{"wiki_id": "http://www.wikidata.org/entity/Q19609781", "itemLabel": "Norman Smurthwaite", "itemDescription": "Football chairman", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Smurthwaite", "wikipedia_page": {"main": "Norman Smurthwaite (born 8 August 1960) is an English businessman and former football club chairman.\nHe qualified as an engineer and built a successful business career and property portfolio before retiring at the age of 50. He took over as chairman of Port Vale in 2013, having been a key figure in the boardroom as the club secured promotion out of League Two in 2012–13. He resigned as chairman following relegation back to League Two in 2016–17. He bought the Liberty Way stadium off Nuneaton Town in July 2018 and sold Port Vale in May 2019.", "link_mentions": [{"page": "Port Vale F.C.", "response": ["Genuine hopes of promotion in 2011–12 were brought to an end after the club was issued with a winding up petition by HM Revenue and Customs on 29 February 2012; the club were by this time unable to pay tax bills, creditors, or staff wages. The club entered administration on 9 March. The club finally exited administration on 20 November 2012, and Tom Pope scored 33 goals to fire Vale to promotion back to League One with a third-place finish. They stabilised in the division under new boss Rob Page, before chairman Norman Smurthwaite orchestrated the departure of Page and his squad in favour of the club's first foreign manager, Bruno Ribeiro, in June 2016. The result was relegation back into League Two at the end of the 2016–17 season, after which Smurthwaite resigned as chairman. He returned to the role the following season and threatened to put the club into administration if a buyer was not found by May 2019, a fate which was avoided when Carol and Kevin Shanahan completed their takeover."]}, {"page": "Jimmy Floyd Hasselbaink", "response": ["Shortly afterwards, Port Vale chairman Norman Smurthwaite revealed that he had rejected Hasselbaink for the vacant managerial position at his club in 2014, out of fear that racist elements of their support would abuse him."]}, {"page": "Lee Hughes", "response": ["Hughes joined Port Vale the day after securing his exit from Notts County, as the BBC reported that \"promotion-chasing boss Micky Adams wants to bring him in to add impetus to a Vale attack who have occasionally misfired this term\". He signed a contract to keep him at Vale Park until the end of the 2012–13 season, at which point his contract would be extended by 12 months if the \"Valiants\" were promoted. However Hughes later revealed that Adams was against the transfer but had been overruled by chairman Norman Smurthwaite. He marked his debut against the \"Gills\" with the winning goal that sent Vale to the top of the table. Being partnered with the country's leading goalscorer Tom Pope allowed Hughes space in front of goal vacated by opposition defenders attempting to double up on Pope. Hughes scored his first hat-trick for the \"Valiants\" in a 7–1 home victory over Burton Albion on 5 April, with two of his goals coming from the penalty spot as he took over from Jennison Myrie-Williams as the club's penalty taker. This performance won him a place on the League Two team of the week. Vale were promoted at the end of the season, with Hughes scoring ten goals in his 18 games, ensuring his contract was extended until summer 2014."]}, {"page": "Michael Brown (footballer, born 1977)", "response": ["He lost his first team place during the 2015–16 season, but despite not playing a game for eight weeks he managed to replace a suspended Anthony Grant and play the full 90 minutes of a 1–0 win over Bury on 28 December. He was named in the Football League team of the week for his performance during a 1–0 win at Blackpool on 9 January. In May 2016, chairman Norman Smurthwaite announced that Brown would assist him in appointing a successor to departing manager Rob Page. Brown was appointed as new manager Bruno Ribeiro's assistant in June 2016; the pair had played together at Sheffield United. He picked up a knee ligament injury in pre-season which kept him out of action for the opening weeks of the 2016–17 season. In May 2017, he confirmed he would remain registered as a player so as to provide emergency cover during the 2017–18 season."]}, {"page": "Vale Park", "response": ["The Valiant 2001 Charter stated that Bratt's management team would invest £400,000 to install under-soil heating in mid-2002, and to also quickly complete the Lorne Street stand. However it took until 2020 for the seats to be installed. Chairman Norman Smurthwaite separated Vale Park from Port Vale after taking the club out of administration in 2012. New high-tech floodlights were fitted in March 2019, paid for by the club's shirt sponsor. The stadium's ownership was returned to the club after Smurthwaite sold the club to Carol and Kevin Shanahan in May 2019. Five months later it was declared an \"asset of community value status\" by Stoke-on-Trent city council. The Shanahans spent £500,000 on ground improvement by summer 2021."]}, {"page": "Rob Page", "response": ["Page needed to avoid a poor start to the 2015–16 season as chairman Norman Smurthwaite warned he was prepared to make \"ruthless decisions\" if the club were struggling by September. Page made nine new signings during pre-season – Sam Kelly, Sam Foley, Anthony Grant, Ben Purkiss, Remie Streete, A-Jay Leitch-Smith, Jak Alnwick, Uche Ikpeazu, and Ryan Inniss – citing the need to sign players who \"desire success\". He was nominated for the League One Manager of the Month award in November following a sequence of three wins out of four which moved Vale to the fringes of the promotion race. However a defeat to League Two side Exeter City in the Second Round of the FA Cup brought speculation over Page's future as manager. He retained his position however, and was named as Football League manager of the week after his side overcame a 2–0 half-time deficit to beat Peterborough United 3–2 on 12 March. He led the club to a 12th-place finish he was linked with various management vacancies in the summer."]}, {"page": "Neil Aspin", "response": ["Building for the 2018–19 season, Aspin released ten players and transfer-listed a further four, whilst bringing in ten new signings and five loan players. Incoming were mostly free transfer signings and included promoted Wycombe Wanderers goalkeeper Scott Brown, Cambridge United captain centre-half Leon Legge, 30-year old Carlisle United central midfielder Luke Joyce and troubled but talented Peterborough United striker Ricky Miller (signed for an undisclosed fee); also arriving were Alfreton Town winger Brendon Daniels, Aldershot Town Player of the Year Manny Oyeleke, The New Saints centre-back Connell Rawlinson, Gateshead defender Theo Vassell, Stevenage midfielder Tom Conlon, and former AFC Bournemouth loanee Ben Whitfield, whilst former fan's favourite Louis Dodds, teenage striker Idris Kanu, forward Scott Quigley, full-back Mitch Clark and midfielder Lewis Hardcastle also joined on season-long loan deals. The team had an indifferent start to the season, with the highlight being a 1–0 victory at local rivals Crewe Alexandra on 22 September. Having seen their team pick up just seven points from an available 27 in November and December, a section of travelling supporters booed and heckled Aspin during a 1–1 draw at Lincoln City on New Year's Day; Aspin reacted badly to the fan's \"lack of respect\" towards him and considered quitting his role, but said that he decided to stay because he had the support of the players and chairman Norman Smurthwaite. However he tendered his resignation on 30 January, stating that \"I am very proud of the job we did in keeping the club in League Two and we leave the club in a better place on and off the pitch. I fully accept results from December have been poor and expected to be higher up the table and know the players are capable of doing that.\""]}, {"page": "Louis Dodds", "response": ["After impressing in caretaker-manager Rob Page's first game in charge on 20 September, Page said Dodds was \"magnificent\" but needed to improve his consistency. Dodds fitted in well to Page's system, with a greater emphasis on possession than under Micky Adams. It took him 21 games to get on the scoresheet in the 2014–15 season, when he put in a man of the match performance in a 2–1 victory over Crawley Town on 20 December. He was named in the Football League team of the week for his performance in a 2–1 home win over Gillingham on 3 January. He passed the 300 career league game mark during the campaign, but admitted he was worried about his future at the club as his contract was due to expire in the summer and chairman Norman Smurthwaite was in no hurry to negotiate new deals with any of the playing squad. He signed a one-year contract with the option for a further year in June 2015."]}, {"page": "Marc Richards", "response": ["He picked up a shoulder injury playing in a pre-season game in July 2018 and manager Phil Brown reported that he would be out of action for at least two months. On 31 January 2019, he travelled to former Port Vale in expectation of a last-minute transfer being arranged, but chairman Norman Smurthwaite blamed \"logistical challenges\" for the deal breaking down. He had fallen out of favour under new Swindon manager Richie Wellens and admitted that \"I either wasn't good enough or wasn't quite at the races in the first half of the year\". He was released by Swindon at the end of the 2018–19 season."]}, {"page": "Racism in association football", "response": ["In September 2014, Liverpool player Mario Balotelli was subjected to racist abuse on Twitter following his tweet mocking Manchester United. Balotelli had tweeted \"Man Utd... LOL'\", following their 5–3 defeat to Leicester City. Also in September 2014, Port Vale chairman Norman Smurthwaite considered appointing Jimmy Floyd Hasselbaink as manager, but decided against it partly because he believed that a racist minority of the club's supporters would make appointing a black manager a poor idea."]}, {"page": "Bruno Ribeiro", "response": ["In June 2016, he was appointed manager of English League One club Port Vale on a three-year contract. He oversaw a complete overhaul of the playing staff, signing an influx of foreign talent including Rigino Cicilia, Anthony de Freitas, Kjell Knops, Calvin Mac-Intosch, Quentin Pereira, Kiko, Carlos Saleiro, Paulo Tavares, Chris Mbamba, Sébastien Amoros, Miguel Santos, and Gëzim Shalaj; as well as British players Anton Forrester and Jerome Thomas, Nathan Ferguson, and Martin Paterson; with Alex Jones and Sam Hart also joining on loan. However it would be 20-year old centre-back Nathan Smith who would prove to be the club's best player; Riberio handed him his debut on the opening day of the season, and Smith would retain his first-team place long after Riberio's departure. He appointed Jak Alnwick, Ben Purkiss and Anthony Grant as joint-captains, and got off to a good start by winning his first six home games at Vale Park. He was named as the Football League Paper's League One Manager of the Day after Vale defeated Scunthorpe United 3–1 on 27 August. However they entered Christmas in 17th-place, leaving chairman Norman Smurthwaite to declare that 'Plan B' had been triggered, meaning the signing of \"seasoned, higher grade\" players, whilst he admitted he felt \"a little bit hoodwinked\" as Ribeiro's friends in the game (José Mourinho, Aitor Karanka, and Carlos Carvalhal) had provided him with glowing references but had thus far failed to lend any of their players to the Vale. Ribeiro resigned as manager of Port Vale on 26 December, hours after witnessing his side lose 1–0 at home to Walsall. Assistant manager Michael Brown took charge on a caretaker basis, but could not arrest the decline as the club went on to be relegated at the end of the 2016–17 season."]}, {"page": "Anthony Grant (footballer, born 1987)", "response": ["He submitted a transfer request in July 2016. After Rob Page switched from manager of Port Vale to Northampton Town he put in a bid for Grant that Vale chairman Norman Smurthwaite dismissed as \"pathetic\", saying \"it wasn't enough to fuel my car for a year\". New Vale manager Bruno Ribeiro then appointed Grant as joint-captain, along with Ben Purkiss and Ben Purkiss. His performance on the opening day of the 2016–17 season – a 0–0 draw with Bradford City – saw him named in the Football League Paper's League One Team of the Day. He was again named in the Team of the Day for his performance in a 2–1 win over Gillingham on 17 September. However, he was sent off for two bookable offences in a 2–1 home win over Fleetwood Town on 12 November, and was suspended for a total of six games and fined £2,000 after he returned to the field after the match to argue with the referee on the full-time whistle. Vale won just two league points and one FA Cup game during his suspension. The club reportedly turned down a transfer bid of £50,000 for the player in the January transfer window."]}, {"page": "Tom Pope", "response": ["He opened the 2014–15 campaign by scoring in each of the first four games of the season. After Rob Page took over as caretaker-manager in September, Pope said that he was happy to act as a \"battering ram\" to help create chances for new signing Jordan Slew. The following month Pope was named as a transfer target by Barnsley manager Danny Wilson, and an unnamed Championship club also had a formal approach to Port Vale turned down. Vale chairman Norman Smurthwaite told him that a new contract offer in the summer would mean a 50% reduction in his wages, despite other clubs indicating they would pay him almost double his current wage. In late October he picked up a knee injury and was ruled out of action for three months after undergoing surgery. He managed to finish as the club's top-scorer for the third successive season despite admitting that he was not fully fit at any point following his recovery from injury."]}, {"page": "Adam Yates (footballer)", "response": ["On 5 August 2017, Yates joined National League side Macclesfield Town on a one-month loan in order to help his return to match fitness. He made his debut for John Askey's \"Silkmen\" later that day in a 1–0 victory at Wrexham. He made seven appearances during his stay at Moss Rose. After returning to Port Vale, he collided with goalkeeper Sam Hornby during a reserve team match with former club Morecambe in November and came out with a fractured nose, cheekbones and eye sockets as well as a broken upper jaw and wrist; manager Neil Aspin said \"I have never seen, on a football pitch, someone get the extent of the injuries he has got\". He was given an extension to his contract the following month, with chairman Norman Smurthwaite saying \"I felt it was our duty to support a player who had given so much service to the club\". Yates announced his retirement as a player in March 2018, though stayed on at the club to work at the Port Vale Foundation Trust. At the end of the 2017–18 season he was named as Community Player of the Year and Clubman of the Year. After a public vote held in December 2019, he was named by The Sentinel as Port Vale's best right-back of the 2010s with 62% of the vote, ahead of James Gibbons (27%) and Ben Purkiss (11%). By this time he was working at the Hubb Foundation charity, ran by club chairwoman Carol Shanahan."]}, {"page": "Mark Marshall", "response": ["In July 2014, Marshall signed for League One side Port Vale on a one-year deal. He scored his first goal for the \"Valiants\" on 30 August, in a 2–1 defeat to Chesterfield at Vale Park. He scored his third goal for the club on 1 November, and also set up the winning goal in a 2–1 victory at Colchester United, and was named on that week's Football League Team of the Week. He scored seven goals in 49 appearances in the 2014–15 campaign, and it was reported in The Sentinel that his \"combination of skill, pace and work rate made him a favourite among supporters\". He was voted as the Away Travel Player of the Year by the club's supporters. He left the club after he rejected the offer of a new contract in the summer, a decision that chairman Norman Smurthwaite described as \"silly\"."]}, {"page": "List of Port Vale F.C. managers", "response": ["Rudge was sacked in January 1999 and though club legend Brian Horton kept the club up that season, relegation followed in the year 2000. He led the club to another Football League Trophy title in 2001 and steadied the ship following a period of administration but quit with the Vale in the play-offs of the third tier in February 2004. Another club legend, Martin Foyle, spent the next three years as manager before departing by mutual consent in September 2007. Lee Sinnott came in two months later, the first time in 28 years someone was appointed who had not previously played or coached at the club. Vale were relegated at the end of the 2007–08 season and manager Dean Glover was given the job initially on a caretaker basis in September 2008. Glover fared poorly however and was sacked at the end of the 2008–09 season. Micky Adams took charge in June 2009, the first experienced manager since Horton. He left Vale in the promotion places to manage boyhood club Sheffield United in December 2010, but a distrarous ten week spell under Jim Gannon ended all hopes of promotion, with Gannon overseeing the shortest reign in the club's history. Adams returned for a second spell in May 2011 and despite the club again entering administration he took the team to promotion out of League Two at the end of the 2012–13 season. He resigned in September 2014 and his assistant, Rob Page, then had close to two seasons in charge with moderate success. Club chairman Norman Smurthwaite then opted for a Contentinel revolution and appointed Portuguese coach Bruno Ribeiro in June 2016, the first manager born outside of Britain to manage the club on a permanent basis. Ribeiro struggled and his assistant Michael Brown took over after six months. Brown failed to keep the club out of the relegation zone by the end of the 2016–17 season and was sacked in September 2017. Smurthwaite turned to club legend Neil Aspin, who narrowly kept the club in the Football League before resigning in January 2019. John Askey, son of yet another club legend Colin Askey, took charge in February 2019. The club's current manager, Darrell Clarke, was appointed in February 2021."]}, {"page": "List of Port Vale F.C. seasons", "response": ["The club had little success throughout the 1960s and 1970s, despite being briefly managed by Stanley Matthews, and in fact were forced to apply for re-election after breaking FA rules on illegal payments in 1968. Gordon Lee guided the club to promotion back to the Third Division the following season, where they would remain until relegation at the end of the 1977–78 campaign. John McGrath steered the club to promotion in 1982–83, though he departed after relegation became inevitable the following season. His assistant, John Rudge, stepped up to become the club's longest-serving and most successful manager, leading the club from 1983 to 1999. Under his leadership Port Vale won promotions in 1985–86, 1988–89 and 1993–94, lifted the League Trophy in 1993 and reached a post-war record finish of eighth in the second tier in the 1996–97 season. After Rudge's reign ended the club entered a decline, slipping into the fourth tier whilst twice entering administration in 2003 and 2012. The decline was arrested when Norman Smurthwaite brought the club out of administration in 2012 and manager Micky Adams achieved automatic promotion from League Two in the 2012–13 season, though they were relegated back into League Two at the end of the 2016–17 season after a failed experiment with a continental staff and playing style."]}, {"page": "History of Port Vale F.C.", "response": ["John Rudge was appointed as manager in December 1983, and would remain in the post for the next 16 years. Overseeing a golden period for the club, Vale won promotion out of the Fourth Division in 1985–86 and into the second tier following promotions from the third tier in 1988–89 and 1993–94. They also won the Football League Trophy in 1993. His reign was ended in January 1999 and the club entered a decline, slipping into the fourth tier whilst twice entering administration in 2003 and 2012 after the chairmanships of first Bill Bell and then Bill Bratt ended in crisis. Norman Smurthwaite took the club out of administration in 2012 and manager Micky Adams achieved automatic promotion from League Two in the 2012–13 season, though they were relegated back into League Two at the end of the 2016–17 season after a failed experiment with a continental staff and playing style.", "Paul Wildes stepped down as chairman and was replaced by Norman Smurthwaite in May 2013. The club continued to progress in the league during the 2013–14, consolidating their League One status with a ninth-place finish. Adams left the club following a poor start to the 2014–15 campaign, and his assistant, Rob Page, stepped up to lead Vale to mid-table finishes in 2014–15 and 2015–16, before quitting the club to take charge at league rivals Northampton Town. Smurthwaite appointed the club's first foreign manager, Bruno Ribeiro, in June 2016. A virtually new squad of foreign recruits arrived and the result was relegation back into League Two at the end of the 2016–17 season under caretaker-manager Michael Brown, who succeeded Ribeiro on Boxing day. Smurthwaite issued a statement apologising for relegation, and stated that he would be stepping down as chairman and would no longer attend games as he looked to sell the club. An atrocious start to the 2017–18 season saw Brown sacked on 16 September with the club bottom of the Football League."]}, {"page": "Peter Farrell (footballer, born 1957)", "response": ["From the turn of the century he played a role in youth development at Bolton Wanderers. In ten years he worked his way up from under-18 coach to assistant academy director. In July 2011, he was appointed as first team coach at Brentford by manager Uwe Rösler. Following Rösler's departure to Wigan Athletic on 7 December 2013, Farrell left the club nine days later. He returned to football as manager of Nigeria Premier League side Warri Wolves in February 2016. He was appointed as first team coach at former club Port Vale in June 2016, working under new manager Bruno Ribeiro. However, he never actually signed a contract with the club or took a day's training leaving chairman Norman Smurthwaite to explain that \"...it is just not Geographically possible and it has put a lot of pressure on him, so Peter is now not going to be part of the future\". Farrell did not find out about the club's change of heart until he heard it reported on the radio, and said \"It would have been more respectful if someone had the decency to ring me up rather than leave it for 10 days\"."]}, {"page": "John Askey", "response": ["On 4 February 2019, Askey signed a contract with League Two club Port Vale to run until the end of the 2018–19 season; he named Dave Kevan as his assistant. He said joining the club \"feels like coming home\". The \"Valiants\" boasted the tenth-largest playing budget in League Two but were underperforming in 18th-place. There was no 'new manager bounce' as Vale fell to four defeats in his first four games, though his coaching methods eventually paid off with an impressive 2–1 win over promotion-chasing Mansfield Town on 9 March. He was named EFL manager of the week after he made two attacking substitutions and reorganized the team's 4–3–3 system to a 4–4–1 formation following a sending off for Leon Legge at Northampton Town on 30 March, inspiring his team to come from 1–0 behind to win 2–1. He was nominated for that month's League Two Manager of the Month award, having secured 11 points from six games to ease relegation fears. Vale ended the season in 20th-place after securing 16 points from Askey's 16 games in charge and he signed a new three-year contract in May 2019, two weeks after Carol and Kevin Shanahan bought the club from Norman Smurthwaite."]}, {"page": "Gavin Gunning", "response": ["Gunning signed a contract of undisclosed-length at newly-relegated League Two club Port Vale in July 2017, having impressed manager Michael Brown on trial. He was sent off on his second appearance for the \"Valiants\" after picking up two yellow cards in a 4–1 defeat to Leeds United in an EFL Cup first round match at Elland Road on 9 August; Brown described it as an \"extremely stupid\" dismissal. However he impressed playing out-of-position at left-back under new manager Neil Aspin, who said his \"heading and challenging has been first class\". He added to his popularity at Vale Park with a headed goal in a 2–0 home victory over Oxford United in the first round of the FA Cup on 3 November. He left the club upon the expiry of his contract on 1 January 2018. Aspin revealed he had disagreed with owner Norman Smurthwaite over the failure to secure Gunning to a new contract."]}, {"page": "Leon Legge", "response": ["Legge was handed the club captaincy after Tom Pope lost his first-team place in October; speaking three months later, he said that the club was in an altogether better place following the departure of chairman Norman Smurthwaite, allowing Legge and Smith the chance to form an effective centre-back partnership under the stewardship of Askey. He was named on the EFL team of the week after scoring the opening goal in a 2–2 draw at Walsall on 22 February. He was nominated for that month's League Two Player of the Month award, with the EFL stating that: \"The veteran defender's experience was pivotal to victory against fellow promotion contenders Colchester with a goal-saving double-block on the line, while his prowess in the air saw him power home a header at Walsall\". He signed a new one-year contract in March. The 2019–20 season ended early that month due to the COVID-19 pandemic in England, with the team in eighth-place, which led Legge to state that the club's progress was merely on hold and the players would return more motivated to achieve promotion the following season."]}, {"page": "A-Jay Leitch-Smith", "response": ["In July 2015, Leitch-Smith signed a 12-month deal with League One side Port Vale after agreeing to leave Yeovil. He earned the contract after impressing manager Rob Page during pre-season training. He scored his first goal for the \"Valiants\" on 14 November, with a header that opened the scoring in a 2–1 win at Barnsley. This was to start a sequence of five goals in four games, which was the best scoring run of his career to that point. For his performances he was short-listed for the League One player of the month award. After scoring his sixth goal of the season in a 1–1 draw with Scunthorpe United at Vale Park on 12 December he was named in the Football League Paper's team of the day. He scored four goals in four games in January to go into double figures for the season to earn himself a nomination for the PFA fans' player of the month award for League One. Chairman Norman Smurthwaite confirmed that Leitch-Smith had rejected the offer of a new contract from the club in May 2016."]}, {"page": "Ben Purkiss", "response": ["New manager Bruno Ribeiro appointed Purkiss as joint-captain, along with Jak Alnwick and Anthony Grant, in July 2016.  He played 12 of the club's first 15 league matches of 2016–17, though was twice unexpectedly dropped from the matchday squad entirely despite not being injured on either occasion. Chairman Norman Smurthwaite confirmed that there had been an issue between Purkiss and Ribeiro. However it was reported that Purkiss was unable to return to the first team due to a shoulder injury. He made his return to action under caretaker-manager Michael Brown on 30 December, days after Ribeiro's resignation. Pukiss went on to state that he had been genuinely injured and that rumours of a falling out with Ribeiro were an exaggeration. Vale were relegated at the end of the season, after which Purkiss questioned the fitness and conditioning of the squad.  After a public vote held in December 2019, he was named by The Sentinel as Port Vale's third-best right-back of the 2010s with 11% of the vote, behind Adam Yates (62%) and James Gibbons (27%)."]}, {"page": "Enoch Andoh", "response": ["He made his debut in the English Football League on 8 August in a 0–0 draw with rivals Crewe Alexandra at Gresty Road. He soon secured his place as the club's first-choice left-winger, and quickly became a popular player with supporters due to his positive attacking play. Club chairman Norman Smurthwaite stated that he expected to sell Andoh for around £2.5 million in the January transfer window, and the Sunday People reported that Tottenham Hotspur were tracking the player. He scored his first goal for the club in a 1–1 draw with Peterborough United on 17 October. Three days later he suffered anterior cruciate damage in a collision with Colchester United goalkeeper Jamie Jones and was ruled out for the rest of the season. He left the club in July 2016 after failing to agree terms on a new contract. He returned to Vale Park to train with the youth team in December 2016. He played a reserve team game for the Vale, the first since his injury, on 8 March 2017."]}, {"page": "Ryan Lloyd", "response": ["He was tipped for a breakthrough season ahead of the 2015–16 campaign by youth team coach Mick Ede. He joined National League club Chester on a one-month loan beginning on 24 November. He found it difficult to adapt to the pace and physicality of the division, but impressed enough for Chester manager Steve Burr to extend his loan spell into until the end of the season. Lloyd returned for a second loan spell at Chester in August 2016. He scored his first goal in senior football on 27 August, in a 4–0 victory over Sutton United at the Deva Stadium. Just two days later he scored again in a 3–1 defeat to Woking at Kingfield Stadium. His performance in a 2–0 victory over Aldershot Town on 17 December was good enough to win him a place in the Non-League Team of the Week. Chester manager Jon McCarthy intended to keep Lloyd beyond the expiry of his loan spell in January 2017, but admitted that other clubs had also expressed an interest in the player. Divisional rivals Southport had a bid of £10,000 accepted by Port Vale chairman Norman Smurthwaite, but Lloyd rejected the move, and was allowed to rejoin Chester on loan for the remainder of the 2016–17 campaign. He was released by new Port Vale manager Michael Brown in May 2017. Lloyd said it was \"frustrating being overlooked\" and that \"I feel like they always looked at me like I was still a young kid, I never got given an opportunity in the first team\"."]}, {"page": "2012–13 Port Vale F.C. season", "response": ["There were no lengthy cup runs, as Vale exited the League Cup with an opening day defeat to Championship club Burnley, and were knocked out of the FA Cup at the Second Round with a loss away at League One side Sheffield United, before their progress in the Football League Trophy was halted by League Two rivals Bradford City. This allowed the \"Valiants\" to focus on gaining promotion, and their goal-scoring feats took them up to second place by 15 September, behind only defensive masters Gillingham. With the new owners in place, Adams could afford to sign experienced players in the January transfer window, and the team pushed on to establish themselves as the division's leaders. However the wheels then fell off as Vale struggled to score as they showed relegation form heading on from mid-February. After just one win in eight games, Vale rediscovered their previous form by mid-March and went on to beat fourth-placed Burton Albion 7–1 in front of 10,978 supporters on 5 April. Promotion was secured 15 days later with a 2–2 draw with Northampton Town before a home crowd of 12,496. After promotion was secured Paul Wildes resigned as chairman and Norman Smurthwaite took full control of the club."]}, {"page": "2013–14 Port Vale F.C. season", "response": ["Manager Micky Adams' first signing of the season was winger Kaid Mohamed, who stepped up to League One from League Two play-off semi-finalists Cheltenham Town; he was seen as a replacement for departing left-winger Ashley Vincent. Also joining the club were Preston North End defender Chris Robertson, Southend United forward Gavin Tomlin, and Sheffield Wednesday central midfielder Chris Lines. Liam Dickinson joined the Vale on trial for the second summer in a row, and again left without a contract after failing to prove his fitness. Adams, known for his gruelingly tough pre-season workouts, did not disappoint and left his players exhausted following their trip to Ireland. Following the trip, Anthony Griffith re-joined the club after securing his exit from League One rivals Leyton Orient. Mathias Kouo-Doumbé, Paul Reid and Ben Parker joined the club on trial, as Vale desperately needed more defensive cover. However the sixth signing of the summer was revealed as former Stoke City left-back Carl Dickinson, who secured his release form Watford in order to join the Vale. Chairman Norman Smurthwaite then told fans that there were to be no new signings as the club's wage bill was now up to 60 per cent of turnover – the maximum allowed under the Football League's new Financial Fair Play rule.", "Just as the club seemed to have found stable leadership and steady progress on the pitch, in October chairman Norman Smurthwaite controversially banned local newspaper The Sentinel from all press events after taking objection with the newspaper's reporting a lengthy delay in producing specially presented third-kit shirts to fans who had pre-paid for the items in May. Smurthwaite responded by stating that the newspaper had been banned for contacting him personally for comment on the story rather than the club's media team, and that he was also frustrated with a Sentinel reporter for attempting to report facts which Smurthwaite had disclosed to the journalist \"in confidence\"."]}, {"page": "2014–15 Port Vale F.C. season", "response": ["A run of six defeats resulted in a surprise resignation from manager Micky Adams on 18 September, and his assistant Rob Page took his place in the hot-seat. Chairman Norman Smurthwaite then initiated his plan for the club to sign young players to develop and later sell for profit at a later date. Vale exited the cups in the early stages after coming up against tough opposition, exiting the FA Cup at the hands of Milton Keynes Dons, losing to Cardiff City in the League Cup and Preston North End in the League Trophy. They climbed up the league table under Page, reaching the outskirts of the play-offs by the end of February before a late season collapse saw them finish in 18th place.", "Manager Micky Adams ended months of speculation surrounded his future when he signed a 12-month rolling contract the following in June 2014. His first signing of the season was versatile left-sided player Colin Daniel. Kaid Mohamed left the club on loan, after he agreed to spend the season playing for Northampton Town. Adams admitted he was finding it difficult to sign new players to take the club forward after losing out on numerous transfer targets to rival clubs. Chairman Norman Smurthwaite was criticised by fans for showing a lack of ambition, but Smurthwaite defended his record by pointing to falling season ticket sales and the high amount of time and money he had invested in the club without financial reward. The second signing of the season was 24-year-old full-back Ryan McGivern, who negotiated a release from relegated Scottish Premier League club Hibernian in order to sign a two-year contract with the Vale. The third arrival was winger Mark Marshall, who had spent the latter half of the previous campaign with Coventry City after serving a two-year ban for taking performance-enhancing drugs. His next signing was winger Byron Moore, who turned down a contract offer at nearby Crewe Alexandra to join the Vale. This capture raised the tensions between Vale and Crewe, particularly after Adams and Crewe boss Steve Davis had a spat over the departure of his son Joe Davis; his father claiming Vale's contract offer to Joe was \"derisory\". Adams looked at a number of players on trial over the summer, including: Michael O’Connor, Steve Jennings, Javan Vidal, and Sylvestre Guyonet. Adams completed his squad on 18 July with a triple signing, taking on a trio of experienced midfielders: Michael Brown, Steve Jennings, and Michael O'Connor. He took the squad on a pre-season tour of Cornwall, including a stay at HMS Raleigh. Adams added to the squad by taking in versatile right-back Frédéric Veseli on a long-term loan from Ipswich Town. Carl Dickinson was appointed as club captain in August 2014, taking the armband from the departed Doug Loft.", "PVFC Limited, the club's holding company, was hit with a winding-up order by HM Revenue and Customs in July 2014; chairman Norman Smurthwaite insisted this would not affect the club and that a funding error caused the problem and expected the order to be withdrawn. Smurthwaite continued to affect changes at the club, controversially axing the system of door-to-door lottery collectors and banishing the Port Vale Community Trust out of Vale Park; the charity subsequently was offered a rent-free tenancy at the Touch building in Trinity Street, Hanley by Vale supporter Jason Nixon who also stated that he had business contacts interested in buying the club."]}, {"page": "Achille Campion", "response": ["Page announced he would look to loan him out at the start of the 2015–16 season as Uche Ikpeazu, Louis Dodds, Ebo Andoh and A-Jay Leitch-Smith were all preferred ahead of Campion on the opening day of the season, and JJ Hooper also joined the club two days later. He began training with National League side Torquay United on 22 October, and agreed a one-month loan deal with the club seven days later after \"Gulls\" manager Kevin Nicholson was impressed by his character. After making one substitute appearance he had a chance to establish himself in the first team following a three-game suspension to Tyrone Marsh. However, he broke his nose on his second start for the club and had to be taken off early in the second half, and the injury then left him unable to feature for the rest of his loan spell. He was released by Port Vale in May 2016. Chairman Norman Smurthwaite used Twitter to express his view that Campion had been treated unfairly by former manager Page and said he hoped to bring the striker back for pre-season."]}, {"page": "2015–16 Port Vale F.C. season", "response": ["Chairman Norman Smurthwaite announced a cut in the wage bill and reduced contract offers for many out-of-contract players, which led to Mark Marshall, Ben Williamson and top-scorer Tom Pope leaving the club on free transfers after rejecting contract offers. A new youth policy was unveiled, and eight free agents, five youth team players and two loan players were signed at the start of the campaign. They made an encouraging start to the campaign, with new names Enoch Andoh and Jak Alnwick impressing, beating Championship side Burnley in the League Cup before going out on penalties to Premier League club West Bromwich Albion. However a poor defeat in the Second Round of the FA Cup to League Two side Exeter City cost the club a lucrative Third Round tie with Liverpool and prompted Smurthwaite to officially put the club up for sale.", "Five youth team players were given professional contracts for the 2015–16 season: defender Lewis Bergin, midfielders Chekaine Steele, Billy Reeves and Omar Haughton, and striker Jonathon Kapend. Manager Rob Page signed a new two-year contract in May 2015. However he needed to avoid a poor start to the season as chairman Norman Smurthwaite warned he was prepared to make \"ruthless decisions\" if the club were struggling by September. The first signings of the season were powerful former loanee defender Remie Streete from Newcastle United, and former Norwich City youth player Sam Kelly. Midfielder Sam Foley also joined the \"Valiants\" on a two-year contract, choosing to leave relegated Yeovil Town just after picking up Yeovil's Player of the Year award. Page further strengthened the defence and midfield by signing Walsall right-back Ben Purkiss and Crewe Alexandra defensive midfielder Anthony Grant. Page needed to find a cost-effective forward with the club both short on strikers following the departure of Tom Pope and Ben Williamson and with little funds available due to a large cut to the wage bill, and so brought in young Watford striker Uche Ikpeazu on loan, having been impressed by Ikpeazu's performances for Crewe last season. Another former Crewe favourite, A-Jay Leitch-Smith, was also signed after impressing Page during pre-season. The eighth and final summer signing was Ryan Inniss, who was confirmed as joining on a season long loan from Crystal Palace after being linked with a return to Vale Park for many weeks. On 6 August, Vale signed goalkeeper Jak Alnwick on a short-term deal; he was signed to compete with Sam Johnson for a first team place as Chris Neal was out injured at the start of the season.", "Chairman Norman Smurthwaite stated that due to falling gate figures the club's wage bill would be cut for the 2015–16 season, meaning a severely reduced contract offer for star striker Tom Pope, who chose to leave the club. In a statement released in March 2017, Smurthwaite stated that on 10 November 2015 he was approached by an American hedge fund consortium who were looking to buy the club. He further stated that a local business also approached the club secretary to purchase the club behind Smurthwaite's back. Following the club's FA Cup exit Smurthwaite officially put the club up for sale, saying that he felt \"humiliated, ashamed and embarrassed\" after witnessing the team's performance. He set an asking price of £4.25 million, stating \"I have never lost money on a transaction in my adult life and I am not starting now\". He also stated that plans to sign a striker in the January transfer window would be scrapped. He continued to reveal that he had been physically assaulted by three Vale supporters in April 2014, though Staffordshire Police could find no record of Smurthwaite's complaint. He also admitted that he had been planning on buying Torquay United before being told by the Football League that he would not be allowed to own two clubs. He further claimed that he had considered appointing Jimmy Floyd Hasselbaink as manager in September 2014, but decided against it partly because he believed that a racist minority of the club's supporters would make appointing a black manager a bad idea.", "Smurthwaite signed an exclusivity deal with a local company in February 2016. He said that if the club were not sold than next season's budget would be slashed by £800,000 and the playing squad would be reduced; Page said that Smurthwaite's comments were \"unwelcome\". Ben Purkiss admitted that Smurthwaite's threat to cut player's wages by 40% had a destabilising effect on the squad. The exclusivity agreement ended in early March, with the club back on general sale. Smurthwaite said this was because the company had significantly reduced their offer and admitted that they needed to find further finances to conclude the deal. A consortium from Boston, USA then signed an exclusivity deal on 14 March. Smurthwaite ended the negotiations after finding that the investors had no working capital. Port Vale owed Norman Smurthwaite £3 million as a director's loan at the end of June 2016."]}, {"page": "2016–17 Port Vale F.C. season", "response": ["The club underwent a complete transformation of the playing and managerial team, with 16 players coming in (plus two on loan) and 16 players going out over the course of the summer. Ten of the new arrivals came from European leagues outside the UK, and bookmakers predicted the club would be relegated, though chairman Norman Smurthwaite expected the team to push for the play-offs under the stewardship of new manager Bruno Ribeiro. Vale were knocked out of the EFL Cup by League Two side Carlisle United, and they failed to make it out of the group stages of the EFL Trophy as they were unable to score against League Two clubs Doncaster Rovers and Mansfield Town. Ribeiro, the club's first foreign manager, resigned on Boxing Day with the club languishing in 17th-place.", "Following the decision of Rob Page to leave Port Vale to manage Northampton Town at the end of the 2015–16 campaign a number of names were linked with the Vale job. Chairman Norman Smurthwaite hinted of three \"outstanding\" candidates, which The Sentinel reported as being Brian Little, Paul Dickov, and José Morais. Bookmakers initially listed Michael Brown as the odds-on favourite, before switching to Morais, then Shefki Kuqi, and then Bruno Ribeiro. Ribeiro was appointed as manager on 20 June, with Michael Brown as his assistant, and Peter Farrell as first team coach. He made Dutch centre-back Kjell Knops his first signing of the season, who had spent the previous five years in the Eerste Divisie with MVV Maastricht. A day later, Curaçao under-20 striker Rigino Cicilia was signed after being released by Dutch side Roda JC Kerkrade. The next to join were French midfielders Quentin Pereira and Anthony de Freitas. Another Dutch centre-back, Calvin Mac-Intosch, was then signed from Cambuur."]}, {"page": "Nathan Smith (footballer, born 1996)", "response": ["He made his League One debut for Port Vale on the opening day of the 2016–17 season, in a 0–0 draw with Bradford City on 6 August. His performance saw him named in the Football League Paper's League One Team of the Day. New manager Bruno Ribeiro had described him as the club's standout player during pre-season. He scored his first goal in the Football League on 16 August, with his header proving to be the only goal of the game against Rochdale. His performances saw him nominated for the League One Player of the Month award for August. This led chairman Norman Smurthwaite to open negotiations for a new contract as he admitted Smith was \"on a boy's wage compared to the rest of the squad\" and Smurthwaite anticipated offers for the player from Championship clubs in the January transfer window. Smith quickly agreed to a new contract to keep him at the club until June 2020. The Football League further recognized his performances by naming him as Young Player of the Month for August. Speaking in February 2017, caretaker manager Michael Brown said that Smith set a good example to his teammates by playing through a hamstring injury. He played every game of the campaign and picked up all five of the club's end of season awards, including the Player of the Year award."]}, {"page": "Alex Jones (footballer, born 1994)", "response": ["Jones joined League One club Port Vale on a five-month loan deal in August 2016. He remained eligible to play in non-first team fixtures for Birmingham City during the loan spell. He made his Football League debut at Vale Park on 16 August, as an 84th-minute substitute for Anton Forrester in a 1–0 win over Rochdale; he won a penalty within two minutes of coming onto the field, though JJ Hooper missed the ensuing penalty, and Jones also had a shot blocked by the last defender after running past goalkeeper Josh Lillis deep into stoppage time. On 27 August, he scored twice to help the \"Valiants\" record a 3–1 victory over Scunthorpe United despite being played at wide right of the front three. Manager Bruno Ribeiro praised him after the match, saying that \"he was fantastic. He scored two goals and worked hard. ... He is one more option for a winger\". His performance won him a place on the Football League Paper's League One Team of the Day. Jones said that he enjoyed playing out of position at right-wing for Port Vale as Ribeiro allowed him a free creative role with few defensive duties, and he also admitted he hoped to extend the loan as he did not suit the style of play at his parent club. He was nominated for the League One Player of the Month award for August and September after scoring six goals in eight games. By the end of his loan spell, Jones had scored ten goals from 21 matches. Port Vale had hoped to convert the loan to a permanent deal, and according to club chairman Norman Smurthwaite, had agreed a fee with Birmingham but were unable to agree terms with the player's agent."]}, {"page": "2017–18 Port Vale F.C. season", "response": ["Norman Smurthwaite resigned as chairman at the end of the 2016–17 season, and 67-year-old former British Rail manager and lifelong Vale supporter Tony Fradley was unveiled as his successor, though Smurthwaite remained as owner. Following relegation, season ticket prices were cut by £50 to £295 with under-12s allowed in for free. The new shirt sponsors were the manorshop.com, owned by Kidsgrove businessman Kevin Jones, who had made a failed attempt to buy the club in May 2017. Speaking in August, Smurthwaite said that the wage budget was 20% higher than the previous season due to the extra money raised from the sales of Jak Alnwick and Anthony Grant in January 2017. The club took out £50,000 in 'promotion insurance', which would cover the cost in bonuses should the club achieve promotion at the end of the season. On 31 January 2018, the sale of Jordan Hugill from Preston North End to West Ham United gained Vale around £1.8 million thanks to a 20% sell on clause negotiated by Micky Adams following his departure from Vale Park in 2014."]}, {"page": "2018–19 Port Vale F.C. season", "response": ["Vale suffered a miserable December following their win over Stoke, drawing three and losing two of their five league games against teams around them in the bottom half of the table. They did manage to pick up a 1–1 draw at league leaders Lincoln City on New Year's Day, though after the game Aspin considered leaving the club after feeling that supporters had shown him a \"lack of respect\". He chose to stay and oversaw a run to the EFL Trophy quarter-finals, where Vale ended up being knocked out by Bristol Rovers. However he resigned on 30 January following a run of one win in ten league games. He was succeeded by John Askey, who managed to turn the team's form around after losing his first four games in charge. As relegation seemed increasingly unlikely, attention them turned to ownership issues, as fans protested against chairman Norman Smurthwaite. Rejecting offers to buy the club, Smurthwaite claimed that he would put the club into administration on 5 May if he was still the club's owner. Carol and Kevin Shanahan completed their takeover on 7 May.", "Norman Smurthwaite returned formally to the role of Port Vale chairman on 1 August. The club started a new kit wear deal with Australian firm BLK. Smurthwaite was quoted as saying he would provide £400,000 for Aspin to spend in the January transfer window, funded by the proceeds of the cup windfalls and sale of Jordan Hugill. Smurthwaite was hospitalised after being struck by a car whilst walking outside Vale Park on 25 January. Smurthwaite blamed \"logistical challenges\" for the deal to bring back former top-scorer Marc Richards breaking down on 31 January (transfer deadline day); the club instead signed four youngsters despite having no manager. As the transfer window was closing, the Port Vale Supporters' Club unanimously gave a vote of no confidence in Smurthwaite and elected to begin formal protests against his ownership. Smurthwaite went on to issue a statement to condemn \"disgraceful abuse\" he had received and to urge supporters to not to use \"inappropriate language\" during protests and to consider the effect of protests on the club and the players; he stated that he was only involved in \"major\" decisions at the club and left day-to-day decisions to CEO Colin Garlick. Responding to accusations that the club had been operating \"on the cheap\", chief executive Colin Garlick stated that the club had the tenth-largest playing budget in League Two. On 1 March, Synectics Solutions owners Carol and Kevin Shanahan revealed that Smurthwaite had rejected their improved offer of £3.5 million for the club. When the couple told Smurthwaite they were planning to go public about their offer he texted them to say \"sorry not interested. now please get back to your day job and continue the sterling work in the community.\""]}, {"page": "2019–20 Port Vale F.C. season", "response": ["Manager John Askey called for patience as he and new owners Carol and Kevin Shanahan tried to rebuild the club following Norman Smurthwaite's ownership. Though the budget was reduced he aimed to have a smaller and more competitive squad. His first summer signing was midfielder Scott Burgess, released from Bury despite an impressive loan spell at York City; the 21-year-old had previously played on loan at Macclesfield Town in Askey's National League title winning season. He next signed Adam Crookes, a 21-year-old defender who had been released by Nottingham Forest despite impressing whilst on loan at Vale in the second half of the 2018–19 season. He then signed 25-year-old Kieran Kennedy, \"a footballing centre-half\" who turned down a new deal at Wrexham in order to return to the English Football League. Big target man striker Richie Bennett then joined, having been let go by Carlisle United. The signings of 27-year-old former Blackpool striker Mark Cullen and 25-year-old former youth-team midfielder Ryan Lloyd were confirmed on 26 June. On 8 July, winger David Amoo arrived on a one-year deal after rejecting a new contract with Cambridge United; this was the first signing to meet Askey's priorities of bringing in a winger, a right-back and a backup goalkeeper. Askey also evaluated five trialists in pre-season friendlies: 19-year-old Bradford (Park Avenue) midfielder Alex Hurst, former Darlington goalkeeper Jonny Maddison, former Millwall and Reading right-back Shaun Cummings, former Yeovil Town winger Rhys Browne and former Coventry City striker Kwame Thomas. Cummings left without a contract as Askey instead again signed another of his former Macclesfield Town players, 23-year-old Callum Evans, who – like Lloyd – had been released by Macclesfield boss Sol Campbell. Bookmakers predicted a mid-table finish for the club. The club kit was reverted to Erreà manufacturers and the shirt sponsors were revealed as Synectics Solutions, the company owned by chairpersons Carol and Kevin Shanahan. The black and gold away kit was launched in tribute to the protestors who helped to oust Smurthwaite. As pre-season drew to a close the club took a week long trip to Scotland. Trialist winger Rhys Browne, yet another former Macclesfield player, became the ninth summer signing on the day of the club's final pre-season friendly. Signing number ten was the new back-up goalkeeper, 24-year-old Jonny Maddison, who had impressed on trial. A third of the five trialists was also signed, though Alex Hurst was immediately loaned back to Bradford (Park Avenue) in order to gain match experience."]}]}}