{"wiki_id": "http://www.wikidata.org/entity/Q19668200", "itemLabel": "Margaret Ida Balfour", "itemDescription": "Scottish doctor and campaigner", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaret_Ida_Balfour", "wikipedia_page": {"main": "Margaret Ida Balfour,  FRCOG (21 April 1866 – 1 December 1945) was a Scottish doctor and campaigner for women’s medical health issues, who made a significant contribution to the development of medicine in India. Her prolific writing during the early 20th century alerted many to the health needs of women and children in India and Africa and the unhealthy environments in which they lived.", "link_mentions": [{"page": "Kaisar-i-Hind Medal", "response": ["* Dr Margaret Ida Balfour, Scottish doctor and campaigner for women's medical health issues"]}, {"page": "Edinburgh School of Medicine for Women", "response": ["* Margaret Ida Balfour: doctor and campaigner for women's health in India"]}, {"page": "Countess of Dufferin Fund", "response": ["* Margaret Ida Balfour"]}, {"page": "1920 New Year Honours", "response": ["* Doctor Margaret Ida Balfour, Joint Secretary, to the Central Committee of the Countess of Dufferin's Fund."]}, {"page": "Medical Women's Federation", "response": ["In addition to their work on the employment of women, the Federation examined varied aspects of women's health during the inter-war years. Issues included venereal disease, nutrition, lunacy law reform, the fitness of women to pilot commercial aeroplanes, the menopause, and guidance on the hygiene of menstruation (a Federation pamphlet on this subject sold 10,000 copies in a single year). In 1921, the Association of Medical Women in India became affiliated to the Federation, and the improvement of women's health in India was a Federation campaign. Another particular focus during this period was sexual health. In 1921, a subcommittee was appointed to discuss birth control, a topic that was much discussed at the time in light of the campaigning of Marie Stopes. In 1930, Dr Margaret Ida Balfour published research into maternity care of mill-workers in Bombay, India. By 1931, a resolution was passed stating that instruction in the provision of birth control should be included in medical schools' gynaecological syllabus. They also argued that the Birth Control Investigation Committee ought to include a woman gynaecologist."]}, {"page": "Women's Medical Service for India", "response": ["Margaret Ida Balfour served as its first director until she retired in 1924. Charlotte Leighton Houlton was the service's Chief Medical Officer from 1935 to 1939. "]}, {"page": "Margaret Balfour (physician)", "response": ["#redirectMargaret Ida Balfour"]}]}}