{"wiki_id": "http://www.wikidata.org/entity/Q1968845", "itemLabel": "Stanley Lord", "itemDescription": "captain of the SS Californian", "wikipedia_url": "https://en.wikipedia.org/wiki/Stanley_Lord", "wikipedia_page": {"main": "Stanley Phillip Lord (13 September 1877 – 24 January 1962) was captain of the SS Californian, the nearest ship to the Titanic on the night it sank on 15 April 1912, and, depending on which sources are believed, likely the only ship to see the Titanic, or at least its rockets, during the sinking. Lord, and the Californian more generally, have been criticized for the fact that the Californian did not render timely assistance to the Titanic despite being between 5 and 20 miles away according to various witness testimonies and the only ship that could have reached Titanic before she sank. Two official inquiries were critical of Lord, but did not recommend criminal charges. Subsequent authors have offered differing opinions on Lord's actions, with some defending, and others criticizing him. The passion among the two factions has resulted in the labels of \"Lordites\" and \"Anti-Lordites\" being applied to the two camps. Central points of debate typically include the appropriateness of Lord's response to the rockets, whether the Californian and Titanic were in fact visible to one another (and additionally the visibility of the rockets), the possible presence of one or more \"Mystery Ships\" that may have been the ships seen by either the Titanic or Californian (assuming they did not in fact see each other), and whether or not the Californian could have saved any additional lives had it attempted to render assistance more quickly.", "link_mentions": [{"page": "January 24", "response": ["*  1962   – Stanley Lord, English naval captain (b. 1877)"]}, {"page": "September 13", "response": ["*  1877   – Stanley Lord, English captain (d. 1962)"]}, {"page": "Bernard Hill", "response": ["| Captain Stanley Lord"]}, {"page": "Captain Stanley Lord", "response": ["#REDIRECT Stanley Lord"]}, {"page": "SS Californian", "response": ["SS Californian was a British Leyland Line steamship that is best known for its inaction during the sinking of the RMS Titanic despite being the closest ship in the area. Judging by available evidence, the Californian was likely the only ship to see the Titanic, or at least its rockets, during the sinking.  The United States Senate inquiry and British Wreck Commissioner's inquiry into the sinking both concluded that the Californian could have saved many or all of the lives that were lost, had a prompt response been mounted to the Titanic distress rockets. The U.S. Senate inquiry was particularly critical of the vessel's Captain, Stanley Lord, calling his inaction during the disaster \"reprehensible\".", "Californian was launched on 26 November 1901 and completed her sea trials on 23 January 1902. From 31 January 1902 to 3 March 1902, she made her maiden voyage from Dundee to New Orleans, Louisiana, United States. Subsequently, she made transatlantic crossings, generally carrying around thirty passengers in addition to her cargo. In 1902, she was chartered by the Dominion Line for five crossings to Portland, Oregon.The Great Ocean Liners She then returned to the Leyland Line service to serve the southern United States. From 1901 to 1911, she was commanded successively by four captains before being finally put under the command of Stanley Lord. By his young age (he obtained his captain's certificate at 24, a very early age compared to many of his colleagues) and by his spirit of initiative and his skills, Lord indeed promised to become a major captain in the British merchant fleet.", "On March 30, 1912, the Californian made a stopover in London on a trip to New Orleans during which she had to face a storm which damaged part of her cotton cargo. Stanley Lord, who had commanded Californian since 27 March 1911, was her captain when she left the Royal Albert Dock, Liverpool, England on 5 April 1912 on her way to Boston, Massachusetts. She was not carrying any passengers on this voyage. On the navigation bridge, Lord was accompanied by three officers and an apprentice: George Stewart (second in command or chief officer), Herbert Stone (second officer), Charles Groves (third officer) and apprentice James Gibson.", "Senator William Alden Smith, in a speech to the U.S. Senate inquiry, said: \"the failure of Capt. Lord to arouse the wireless operator on his ship, who could have easily ascertained the name of the vessel in distress and reached her in time to avert loss of life, places a tremendous responsibility upon this officer from which it will be very difficult for him to escape\". Author Daniel Allen Butler wrote: \"The crime of Stanley Lord was not that he may have ignored the Titanic’s rockets, but that he unquestionably ignored someone’s cry for help.\"", "*Captain Stanley Lord"]}, {"page": "Jack Phillips (wireless officer)", "response": ["Furthermore, Evans did not request that the message be delivered to the bridge, and the crew of Californian did see the rockets from  Titanic at 00:45 and woke their captain, Stanley Lord, who chose to ignore the rockets and returned to bed."]}, {"page": "Titanic (1996 miniseries)", "response": ["| Matthew Walker || Captain Stanley Lord"]}, {"page": "Bernard Kay", "response": ["He portrayed Captain Stanley Lord of the SS Californian in the BBC dramatisation Trial by Inquiry: Titanic in 1967. In 1978 Kay appeared as the underworld crime boss Harry Scott in an episode of the hard-hitting British police drama The Professionals, the episode entitled When the Heat Cools Off.;https://www.imdb.com/title/tt0679345/fullcredits/?ref_=tt_ov_st_sm the bandit leader Cordova in the Zorro television episode \"Alejandro Rides Again\" in 1991 which was filmed in Madrid, Spain. Kay also gave a sympathetic performance  as Korporal Hartwig in an early episode of Colditz."]}]}}