{"wiki_id": "http://www.wikidata.org/entity/Q19665740", "itemLabel": "Jon Paul Phillips", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jon_Paul_Phillips", "wikipedia_page": {"main": "Jon Paul David Phillips (Darlington, March 27, 1980) is an English actor and model. Born and raised in County Durham in the north of England, he attended the prestigious rugby school Barnard Castle School. He is of English, Russian and Mexican descent and is the great-grandson of Mexican painter Diego Rivera and Russian-born Cubist painter Marie Vorobieff. His grandmother is actress Marika Rivera.He made his feature debut in a leading role as Jake in the independent film X/Y, directed by Ryan Piers Williams, portraying a flawed but loyal young man who guides his lost friend through the murky waters of his own journey toward self-discovery.Phillips' previous work includes supporting roles in the films Kilimanjaro, directed by Walter Strafford, and Ass Backwards, directed by Chris Nelson.Phillips starred alongside Abigail Spencer in a television spot for Audi entitled \"Suspect.\" The commercial aired at the 2012 Emmy Awards, an Audi-sponsored event and introduced the NFL season on NBC.", "link_mentions": [{"page": "Marika Rivera", "response": ["In 1938 Rivera married the painter Jean Paul Brusset, and gave birth to their son Jean Brusset in 1941.  Later she was married to Rodney Phillips, who was the owner of the Athelhampton House, Dorset, from 1949 to 1957. In Dorset she bore her second son David Phillips in 1949. David is the father of actor Jon Paul Phillips. After her second divorce she lived in Ealing in Greater London, England. "]}, {"page": "Barnard Castle School", "response": ["* Jon Paul Phillips, actor."]}, {"page": "X/Y", "response": ["X/Y is a 2014 American drama film written and directed by Ryan Piers Williams and starring America Ferrera, Ryan Piers Williams, Melonie Diaz, Jon Paul Phillips, Amber Tamblyn, David Harbour, and Common. The film premiered at the Tribeca Film Festival on April 19, 2014.", "* Jon Paul Phillips as Jake"]}]}}