{"wiki_id": "http://www.wikidata.org/entity/Q1979030", "itemLabel": "John Hajnal", "itemDescription": "Hungarian-British statistical economist (1924–2008)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hajnal", "wikipedia_page": {"main": "John Hajnal FBA (born  Hajnal-Kónyi, [ˈhɒjnɒl ˈkoːɲi]; 26 November 1924 – 30 November 2008), was a Hungarian-British academic in the fields of mathematics and economics (statistics).\nHajnal is best known for identifying, in a landmark 1965 paper, the historical pattern of marriage of northwest Europe in which people married late and many adults remained single. The geographical boundary of this unusual marriage pattern is now known as the Hajnal line.", "link_mentions": [{"page": "W. D. Hamilton", "response": ["Hamilton enrolled in an MSc course in demography at the London School of Economics (LSE), under Norman Carrier, who helped secure various grants for his studies. Later, when his work became more mathematical and genetical, he had his supervision transferred to John Hajnal of the LSE and Cedric Smith of University College London (UCL)."]}, {"page": "Beguinage", "response": ["The understanding of women's motivations for joining the beguinages has changed dramatically in recent decades. The development of these communities is clearly linked to a preponderance of women in urban centers in the Middle Ages, but while earlier scholars like the Belgian historian Henri Pirenne believed that this \"surplus\" of women was caused by men dying in war, that theory has been debunked. Since the groundbreaking work of John Hajnal, who demonstrated that, for much of Europe, marriage occurred later in life and at a lower frequency than had previously been believed, historians have established that single women moved to the newly developed cities because those cities offered them work opportunities.  has shown how the smaller beguinages as well as the court beguinages answered such women's social and economic needs, in addition to offering them a religious life coupled with personal independence, which was a difficult thing to have for a woman."]}, {"page": "List of people associated with the London School of Economics", "response": ["* John Hajnal, statistician"]}, {"page": "Hajnal line", "response": ["The Hajnal line is an imaginary line \"Hajnal (1965) outlined two marriage patterns that historically prevailed in Europe, geographically delineated by an imaginary line connecting Saint Petersburg and Trieste (referred to also as Hajnal's line).\" \"John Hajnal published the revolutionary essay “European Marriage Patterns in Perspective,” which divided Europe along an imaginary line known as the “Hajnal line,” one that separated Eastern and Western Europe\" \"although (for brevity) he calls it “European,” he defines it as being applicable only to the Northwestern Europe, west of an imaginary line connecting “Leningrad” (Saint Petersburg) to Trieste\" \"The existence of an imaginary line which ran down from St Petersburg to Trieste and neatly separated western and eastern European marriage and family patterns has been one of the basic tenets of historical demography and family history for half a century.\" that is drawn between Saint Petersburg, Russia, and Trieste, Italy. ", "In 1965, John Hajnal hypothesized that it divides Europe into two areas characterized by different levels of nuptiality. According to Hajnal, to the west of the line, marriage rates and thus fertility were comparatively low, and a significant minority of women married late or remained single; to the east of the line and in the Mediterranean and select pockets of Northwestern Europe, early marriage was the norm and high fertility was countered by high mortality.  ", "Although John Hajnal himself was stridently anti-fascist and a survivor of the Jewish holocaust, his theory has been warmly received and heavily promoted by Neo-Nazis, and the alt-right.  "]}, {"page": "List of British Jewish scientists", "response": ["* John Hajnal, demographer"]}, {"page": "List of Jewish mathematicians", "response": ["* John Hajnal (1924–2008), statistics"]}, {"page": "Hajnal (name)", "response": ["*John Hajnal (1926–2008), Hungarian-British mathematician and professor of statistics"]}, {"page": "Western European marriage pattern", "response": ["In 1965, John Hajnal posited that Europe could be divided into two areas characterized by a different patterns of nuptiality. To the west of the line, marriage rates and thus fertility were comparatively low and a significant minority of women married late or remained single and most families were nuclear; to the east of the line and in the Mediterranean and particular regions of Northwestern Europe, early marriage and extended family homes were the norm and high fertility was countered by high mortality.Hajnal, John (1965): European marriage pattern in historical perspective en D.V. Glass and D.E.C. Eversley, (eds.) Population in History, Arnold, Londres.Kertzer, David I and Marzio Barbagli. 2001. The history of the European family. New Haven: Yale University Press. p xiv"]}, {"page": "List of fellows of the British Academy elected in the 1960s", "response": ["* John Hajnal"]}, {"page": "Hajnal, John", "response": ["#redirectJohn Hajnal"]}]}}