{"wiki_id": "http://www.wikidata.org/entity/Q1974724", "itemLabel": "Neil Dewar", "itemDescription": "Scottish footballer (1908-1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_Dewar", "wikipedia_page": {"main": "Neil Hamilton Dewar (11 November 1908 – 10 January 1982) was a Scottish footballer who played for Third Lanark, Manchester United, Sheffield Wednesday and the Scotland national team. He usually played as a forward and had a prolific goalscoring record.\n\n", "link_mentions": [{"page": "Lochgilphead", "response": ["* The footballer Neil Dewar was born in the town"]}, {"page": "Dewar", "response": ["*Neil Dewar (1908–1982), Scottish football player"]}, {"page": "1931–32 in Scottish football", "response": ["|Neil Dewar (3)"]}, {"page": "1932–33 in Scottish football", "response": ["|Dally Duncan, Neil Dewar"]}, {"page": "List of Sheffield Wednesday F.C. seasons", "response": ["|Harry Burgess,Neil Dewar &Mark Hooper", "|Neil Dewar", "|Neil Dewar"]}, {"page": "Scotland national football team results (1920–1939)", "response": ["|Neil Dewar (3)", "|Neil Dewar, Dally Duncan"]}, {"page": "Jack Palethorpe", "response": ["Palethorpe gained an immediate place in the Wednesday first team, somewhat controversially replacing the popular Neil Dewar as Wednesday's centre forward. He made his debut on 15 December 1934 against Everton and scored his first goals on Boxing Day, a hat-trick against Birmingham City. In the second half of that season Palethorpe played an integral part in Sheffield Wednesday's excellent run and eventual triumph in the FA Cup of that season scoring goals in the third and fourth rounds as well as one in the semi-final win over Burnley at Villa Park. However his most important goal came in the 4–2 final triumph against West Bromwich Albion when he put Wednesday a goal up inside two minutes after receiving a pass from Ronnie Starling and shooting just inside the post. Despite a good record of 17 goals in 34 matches in all competitions, Palethorpe was once again on his way to another club in September 1935 as he joined Aston Villa for £2,500.Sheffield Wednesday Archive. Gives statistics of Sheffield Wednesday career."]}, {"page": "Mark Hooper", "response": ["Hooper was a consistent performer and remained injury free for much of his career. Between April 1928 and April 1932 he amassed 189 consecutive League and Cup matches for Sheffield Wednesday to create a new record for the club. This record stood for 55 years, until February 1987 when it was beaten by Martin Hodge. In the 1928–29 and 1929–30 seasons Hooper was an ever-present as Wednesday lifted back to back Division One championships. He played in Sheffield Wednesday's 2–1 defeat by Arsenal in the Charity Shield at Stamford Bridge in October 1930. In 1933–34 he was joint top scorer with 13 goals along with Neil Dewar and Harry Burgess as Wednesday finished outside of the top three in Division One for the first time in five seasons. In 1935 he won a FA Cup winners medal as Wednesday beat West Bromwich Albion 4–2 in the final. Hooper scored the second goal for the Owls with a shot that went in off the post. Gives further details of career."]}, {"page": "1932–33 Manchester United F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Neil Dewar"]}, {"page": "1933–34 Manchester United F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Neil Dewar"]}, {"page": "1935 FA Charity Shield", "response": ["The match was criticized as a poor game in which Arsenal under-performed. Wednesday were praised for their direct attacking play and solid defending. The only goal of the game was scored by Neil Dewar, after Arsenal failed to clear the ball at a corner. The second half of the match was broadcast with live commentary by George Allison – who was also the Arsenal manager – on the BBC's Regional radio station.", "| ||9 || Neil Dewar"]}]}}