{"wiki_id": "http://www.wikidata.org/entity/Q1971445", "itemLabel": "Ronald Forbes Adam", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Ronald_Forbes_Adam", "wikipedia_page": {"main": "General Sir Ronald Forbes Adam, 2nd Baronet,  (30 October 1885 – 26 December 1982) was a senior British Army officer. He had an important influence on the conduct of the British Army during the Second World War as a result of his long tenure as Adjutant-General, responsible for the army's organisation and personnel, from June 1941 until the end of the war, and as a close confidant of Field Marshal Sir Alan Brooke, the Chief of the Imperial General Staff (CIGS), the professional head of the British Army.\nA graduate of Eton College and the Royal Military Academy Woolwich, Adam was commissioned on 27 July 1905 into the Royal Artillery. After a posting to India with the Royal Horse Artillery, he served on the Western Front and the Italian Front during the First World War. After the war he attended the Staff College, Camberley, and held successively senior staff postings at the War Office.  He was an instructor at the Staff College between 1932 and 1935, and was briefly its commandant in 1937. When Lord Gort became CIGS, Adam was made Deputy Chief of the Imperial General Staff (DCIGS). In October 1939, he was appointed commander of III Corps. When, in late May 1940, the BEF was ordered to evacuate France, Adam was given the task of organising the Dunkirk perimeter. Following his return from France on 31 May 1940, Adam was appointed General Officer Commanding-in-Chief Northern Command, responsible for the defence of the coastline from The Wash to the Scottish border.\nIn June 1941 he was appointed Adjutant-General. The role was of particular importance during the war years because of the need for the army to adapt its practices to meet the needs of a conscript army led by non-career officers. He set up a personnel selection department that drew up aptitude tests to establish recruits' psychological stability, combatant temperament, technical aptitudes and leadership potential. Under Adam's guidance, officer selection was no longer based on a simple interview by commanding officers, but carried out through a War Office Selection Board (\"Wozbee\") whose members, advised by psychiatrists and psychologists, oversaw various tests, especially those aimed at showing a man's initiative potential. Adam did not accept the traditional view that there was an officer-producing class, but believed that men and women of ability could be found in all parts of the community. Both these innovations met resistance.\nSo too did Adam's proposal to create a Corps of Infantry. This alarmed traditionalists at the War Office, who blocked it. However, Adam managed to then push through another reform creating the General Service Corps (GSC). All recruits—some 710,000 between July 1942 and May 1945— were initially posted to the GSC for the period of their basic training, after which they were sent to a training centre for specialised training. Even more controversial was Adam's championing of the Army Bureau of Current Affairs (ABCA), which produced fortnightly pamphlets on current developments to provide officers with material for compulsory discussion groups with their men. He and other senior officers believed that a citizen army had to be encouraged into battle, not just ordered. The leftward swing in British public opinion during the war years that resulted in a landslide win for the Labour Party in the 1945 general election was blamed on the ABCA. As the end of the war approached, Adam instituted a demobilisation system based on the \"first in, first out\" principle, and he resisted attempts to repeat the practice in 1918–19 of giving priority to the needs of the economy, which had led to mutinies by long-serving men. After the war he retired from the Army in October 1946, and was the chairman of several bodies involved in adult education.", "link_mentions": [{"page": "III Corps (United Kingdom)", "response": ["During the Second World War, III Corps was formed in France under the command of Lieutenant-General Sir Ronald Forbes Adam to control forces of the British Expeditionary Force, after the expansion of that force had rendered control by just two corps headquarters cumbersome. The Corps was withdrawn from Dunkirk after the defeat of British forces by the Germans in May 1940.", "GOC: Lieutenant-General Sir Ronald Forbes Adam (Lieutenant-General Sydney Rigby Wason after 26 May 1940Grehan 2018, Chapter 4)  "]}, {"page": "Operation Sea Lion order of battle", "response": ["* Northern Command — Lieutenant General Ronald Forbes Adam"]}, {"page": "44th (Home Counties) Division", "response": ["The division, as the 44th (Home Counties) Infantry Division (Major-General Edmund Osborne), was mobilised on 3 September 1939 on the outbreak of the Second World War. Initially in Southern and then Eastern Command, the division was sent overseas where it joined the British Expeditionary Force (BEF) in France on 1 April 1940 and was assigned to III Corps (Lieutenant-General Ronald Forbes Adam). It took part in the Battle of St Omer-La Bassée (2329 May) during the retreat to Dunkirk. At the end of May 1940 the division was evacuated from at Dunkirk after the German Army threatened to cut off and destroy the entire BEF from the French Army during the battles of France and Belgium."]}, {"page": "List of British Army full generals", "response": ["| Sir Ronald Forbes Adam, 2nd Baronet"]}, {"page": "Temporary gentlemen", "response": ["The system was gradually reformed; the army replaced the pre-war recommendation system with the Command Interview Boards in 1941.  These boards were criticised for being too focused on the traditional officer class and for promoting unsuitable men—leading to high failure rates at the Officer Cadet Training Units.  The forward-thinking adjutant-general Ronald Forbes Adam and his assistant Frederick Hubert Vinden reformed the system, introducing the more fair-minded War Office Selection Board (WOSB) in April 1942, where officer candidates were interviewed by trained psychiatrists and psychologists.  These were not specifically set-up to diversify recruitment into the lower classes (though this effect was noted) but generally to improve the quality of recruitment.  A further measure, the General Service Corps scheme was set up in July 1942 to assess all new army entrants for suitability for a commission.  It determined that only 6 per cent of those conscripted were deemed suitable, so recruitment from the lower classes was not significantly increased. Notable examples of working men to receive commissions included a lieutenant who was a former blast furnace labourer, a captain who was a road sweeper and lieutenant-colonels who were clerks, railway porters and bus conductors.  Despite the reforms, by the war's end it was found that some 34 per cent of all officers commissioned still came from the public schools."]}, {"page": "Frank Forbes Adam", "response": ["* Sir Ronald Forbes Adam, 2nd Baronet GCB, DSO, OBE (1885–1982), British army general."]}, {"page": "Ronald Adam", "response": ["#REDIRECT Ronald Forbes Adam"]}, {"page": "Sir Ronald Forbes Adam, 2nd Baronet", "response": ["#REDIRECT Ronald Forbes Adam"]}, {"page": "1946 New Year Honours", "response": ["*General Sir Ronald Forbes Adam, , (1632), late Royal Regiment of Artillery, Colonel Commandant, Royal Artillery and Army Educational Corps."]}, {"page": "1939 New Year Honours", "response": ["*Lieutenant-General Sir Ronald Forbes Adam,  late Royal Artillery, Deputy Chief of the Imperial General Staff, The War Office. "]}, {"page": "1918 Birthday Honours", "response": ["*Major Ronald Forbes Adam, Royal Horse Artillery"]}]}}