{"wiki_id": "http://www.wikidata.org/entity/Q19723452", "itemLabel": "William Thomas Bridges", "itemDescription": "Hong Kong lawyer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Thomas_Bridges", "wikipedia_page": {"main": "William Thomas Bridges (1820 or 1821 – 30 September 1894; Chinese: 必列者士; Cantonese Yale: Bītlihtjésih) was a lawyer and public servant in British Hong Kong, where he held the post of Acting Colonial Secretary from 1857 to 1858. He was born in 1820 or 1821 in Blackheath, Kent. Having studied at Winchester College and Corpus Christi College, Oxford, Bridges was called to the Bar at the Middle Temple in 1847. He emigrated to Hong Kong in April 1851 and rose rapidly in local society owing to his special status as a qualified barrister in a colony short of legal experts, becoming Acting Attorney General within a year of his arrival. After a sojourn in England in 1856, where he was awarded an honorary Doctorate of Civil Law, Bridges became a provisional member of the Executive and Legislative Councils upon his return to Hong Kong, and was appointed Acting Colonial Secretary while the incumbent secretary, William Thomas Mercer, was on leave in 1857.In 1856, Thomas Chisholm Anstey arrived in Hong Kong as Attorney General, and his campaigns to root out official corruption rapidly made an enemy of Bridges. Soon afterwards, in 1858, Bridges became prominently involved in a major local scandal when Anstey accused Daniel Richard Caldwell, responsible as Registrar General for policy towards the local Chinese community, of corruption and favourable treatment of an influential Chinese pirate, Ma-chow Wong (黃墨洲). Bridges was a friend of Caldwell and a fellow Freemason, and moved to protect him by ordering Wong's potentially incriminating account books to be destroyed. An initial inquiry acquitted Caldwell and Bridges in 1858; Governor John Bowring recommended Bridges' advancement within the administration, tipping him as a future Attorney General. The controversy surrounding the Caldwell affair continued, however, and after Bowring's departure in 1859 his successor as governor, Hercules Robinson, reopened the case and commenced a new inquiry in 1860, which recommended Caldwell's dismissal. Under fire from the press and facing the prospect of removal from office, Bridges quietly left Hong Kong on 15 April 1861, and retired to private life. He died on 30 September 1894 in Bath.Bridges Street in Sheung Wan is named after him. The law practice he founded in Hong Kong in 1851 continues to exist today, renamed Deacons.", "link_mentions": [{"page": "William Bridges", "response": ["*William Thomas Bridges (1821–1894), barrister in British Hong Kong"]}, {"page": "John Bowring", "response": ["A commission of inquiry into accusations of corruption, operating brothels and associating with leading underworld figures laid by Attorney-General Anstey against Registrar-General Daniel R Caldwell scandalised the administration.  During the course of its proceedings Anstey had opportunity to viciously accuse William Thomas Bridges, one-time acting Attorney-General and constant favourite of Bowring, for receiving stolen goods under the guise of running a money-lending operation from the ground floor of his residence, collecting debts at extortionate rates.  The charges found unproved, Caldwell was exonerated and Anstey suspended, and Bridges later to be appointed acting Colonial Secretary by Bowring, but suspicions remained and Bowring's administration had been ruined."]}, {"page": "Deacons (law firm)", "response": ["The firm is named for the English solicitor Victor Deacon, who in 1880 joined the legal practice established by William Thomas Bridges in 1851 in Hong Kong.Deacons website: \"About Us \" Bridges was the second barrister to commence practice in Hong Kong."]}, {"page": "Bridges Street", "response": ["Its name comes from William Thomas Bridges, a British lawyer, Acting Attorney General and Acting Colonial Secretary, who was active in Hong Kong from 1851 to 1861.香港地方 | 道路及鐵路 | 道路名稱(五)英官員命名道路Hong Kong's First. \"Peculiar, Sometimes Dubious, Civil Servants\" Bridges was an old friend of Sir John Bowring, the 4th Governor of Hong Kong. The law firm established by Bridges later became known as Deacons.Deacons website: \"About Us \""]}, {"page": "List of members of Middle Temple", "response": ["* William Thomas Bridges (1821–1894), barrister and public servant in Hong Kong"]}, {"page": "W. T. Bridges", "response": ["#REDIRECT William Thomas Bridges"]}, {"page": "William T. Bridges", "response": ["#REDIRECT William Thomas Bridges"]}, {"page": "William Tarrant", "response": ["In 1857, Tarrant became involved in a series of notable political scandals. In the first case, the so-called Ah Lum affair, Cheung Ah-lum, the proprietor of the Esing Bakery, was accused of plotting to poison European residents of the colony. Despite Cheung's acquittal in court, Tarrant sued him for damages and was awarded HK$1,010.. Cheung left Hong Kong, and Tarrant accused William Thomas Bridges, the acting Colonial Secretary, of abetting his escape. Bridges sued Tarrant for libel, the latter being ordered to pay £100 ()."]}, {"page": "Esing Bakery incident", "response": ["The trial opened on 2 February. The government had difficulty selecting appropriate charges because there was no precedent in English criminal law for dealing with the attempted murder of a whole community. One of the victims of the poisoning was selected, and Cheong and the nine other defendants were charged with \"administering poison with intent to kill and murder James Carroll Dempster, Colonial Surgeon\". Attorney General Anstey led the prosecution, William Thomas Bridges and John Day the defence. Chief Justice John Walter Hulme, who had himself been poisoned, presided."]}]}}