{"wiki_id": "http://www.wikidata.org/entity/Q1970405", "itemLabel": "Terry Fenwick", "itemDescription": "English footballer and manager (born 1959)", "wikipedia_url": "https://en.wikipedia.org/wiki/Terry_Fenwick", "wikipedia_page": {"main": "Terence William Fenwick (born 17 November 1959) is an English football former player and current head coach of Trinidad & Tobago. Playing as a defender, mainly central, he made a total of 455 appearances in the Football League, for Crystal Palace, Queens Park Rangers, Tottenham Hotspur, Leicester City and Swindon Town.", "link_mentions": [{"page": "Diego Maradona", "response": ["Maradona's second goal, just four minutes after the hotly disputed hand-goal, was later voted by FIFA as the greatest goal in the history of the World Cup. He received the ball in his own half, swivelled around and with 11 touches ran more than half the length of the field, dribbling past five English outfield players (Peter Beardsley, Steve Hodge, Peter Reid, Terry Butcher, and Terry Fenwick) before he left goalkeeper Peter Shilton on his backside with a feint, and slotted the ball into the net.\"Top 10 World Cup goals\". The Telegraph. Retrieved 19 August 2014 This goal was voted \"Goal of the Century\" in a 2002 online poll conducted by FIFA. A 2002 Channel 4 poll in the UK saw his performance ranked number 6 in the list of the 100 Greatest Sporting Moments."]}, {"page": "November 17", "response": ["*1959 – Terry Fenwick, English footballer and manager"]}, {"page": "Seaham", "response": ["Seaham has also produced several able footballers, some of whom have gone on to play for the local team, Sunderland, such as Richie Pitt. Terry Fenwick and Brian Marwood played for England, with the latter, on retirement from football, working as a commentator for Sky Sports. "]}, {"page": "Northampton Town F.C.", "response": ["The following season started promisingly, with players such as Marco Gabbiadini and Jamie Forrester pushing the Cobblers towards a play-off place before the club eventually finished in 18th place due to a large number of injuries in the second half of the season. Kevin Wilson was sacked in November 2001, to make way for his assistant Kevan Broadhurst, who steered the Cobblers from relegation to a remarkable survival with a game to spare after losing only one home game from mid-January. The next season was the worst since the early 1990s, both financially and on the pitch. Early on they were forced into a 'Save our Season' campaign to keep afloat until the end of the year. It was required after the collapse of ITV Digital and much publicised takeover attempts by John FashanuConn, David (28 December 2001) Northampton brought back to reality The Independent. Retrieved 2010-01-21. and Giovanni Di StefanoConn, David (22 May 2002) Arkan's lawyer has ambitions to take over Northampton The Independent.  Retrieved 2010-01-21. had failed and left the club with huge debts. They were taken over by a consortium run by Andrew Ellis, who sacked Broadhurst in January 2003, when Northampton were struggling at the foot of the division. He was briefly replaced by former England player Terry Fenwick who was sacked after a winless spell of seven games. This was, at the time, the eighth-shortest managerial reign in English football history. Martin Wilkinson, the new manager lasted little longer, being dismissed in October 2003 in favour of former Scotland and Tottenham Hotspur defender Colin Calderwood.Calderwood joins Cobblers BBC Sport. 2003-10-09. Retrieved 2010-01-21. Calderwood led Northampton to the play-offs in his first season, where they were knocked out in the semi-finals by Mansfield Town after a penalty shoot-out. In the 2004–05 season, Northampton finished seventh, again in the play-offs, where they were defeated by Southend United. Following this, the manager made substantial changes to the squad, bringing in experienced players such as Ian Taylor and Eoin Jess, and they enjoyed a successful 2005–06 league season. On 29 April, the Cobblers clinched promotion to Football League One, with a 1–0 win at home to Chester City. On 30 May 2006, Northampton announced that Calderwood was leaving to join Nottingham Forest as their new manager,Calderwood named new Forest boss BBC Sport. 2006-05-30. Retrieved 2010-01-21. and he was replaced by John Gorman on 5 June. On 20 December, Gorman resigned due to \"personal issues\" with the side 18th in the table, with Ian Sampson and Jim Barron briefly taking care of first team affairs.Gorman exits as Northampton boss BBC Sport. 2006-12-20. Retrieved 2010-01-21. He was replaced by former Southampton boss Stuart Gray on 2 January 2007.Northampton name Gray as Manager BBC Sport. 2007-01-02. Retrieved 2010-01-21. The Cobblers were relegated from league one on the final day of the 2008–09 season, after suffering a 3–0 defeat away at Leeds United and other results went against them.", "* 2003:       Terry Fenwick"]}, {"page": "Portsmouth F.C.", "response": ["The 1994–95 season was a disappointing one for Portsmouth and after a decline in form which left them struggling at the wrong end of the \"new\" First Division, Jim Smith was sacked on 1 February 1995 and was replaced by Terry Fenwick, who guided them to safety with 4 wins in their final 6 league games.", "At 4.59pm on Friday 31 October 1997, the new £2.2 million Fratton End was officially cleared for its opening, with one minute to spare before a 5 pm deadline. Problems with some misorientated Fratton End rooftop floodlights caused the Fratton End of the pitch to be \"shrouded in gloom on Hallowe'en\", according to the Sky Sports 3 TV commentator, causing some doubt that the live televised Division One game against Swindon Town would take place. Fortunately, the match referee, Paul Danson gave the go-ahead for the evening fixture. The game was won 0–1 by Swindon Town with an official Fratton Park attendance of only 8,707. As a mark of respect to the club's former player and manager, a memorial portrait of Jimmy Dickinson was incorporated into the seating of the new Fratton End stand, along with the club's crest. Terry Venables' role as coach of the Australian national team meant he was frequently absent from Portsmouth. Meanwhile, the team's results were poor. Two-thirds of the way through the 1997–98 season, he and manager Terry Fenwick left the club, with Portsmouth on the bottom of the table, and Venables selling his shareholding back to Martin Gregory, son of former chairman Jim Gregory. Alan Ball then returned as manager for the second time on 26 January 1998. Relegation to the third tier was avoided on the last day of the season – by 1 point."]}, {"page": "FA Youth Cup", "response": ["| Terry Fenwick"]}, {"page": "Ashford United F.C.", "response": ["For 2004–05 the team moved away from their green and white strip and played in lime green shirts and blue shorts. In October 2004 owner/manager Tim Thorogood appointed former England player Terry Fenwick as manager. After a run of poor results he quit three months later. The team finished the season 20th of 22 teams."]}, {"page": "Paul Walsh", "response": ["Walsh was signed by Tottenham Hotspur for £500,000 in February 1988. He continued to drink heavily, and admitted to being a \"ring leader\" of a drinking culture alongside Neil Ruddock, Terry Fenwick and David Howells which was to the detriment of the club's on-field progress. He ended the 1987–88 season with one goal in 11 games for Spurs. He later said he was \"running at 70% capacity\".", "Former Spurs teammate Terry Fenwick, now manager at Portsmouth, took Walsh back to Fratton Park in exchange for Gerry Creaney (valued at £600,000) in September 1995; Walsh signed a three-year contract with the club. He scored five goals in 21 league games in the 1995–96 season before suffering a micro-fracture of the fibula in a seemingly innocuous incident during a 1–1 draw with Millwall at The Den on 27 January. He played against Leicester City on 10 February, but his knee collapsed and the resulting cruciate ligament damage ended his career. He became assistant first-team coach at the club upon his retirement. He had a testimonial game at Fratton Park in May 1998. He was a popular figure at the club, and in February 2005 he came second in the Football Focus poll to find the club's \"cult hero\", behind teammate Alan Knight."]}, {"page": "San Juan Jabloteh F.C.", "response": ["* Terry Fenwick (2005–2011)"]}, {"page": "TT Pro League", "response": ["There have been eight managers that have won the Pro League. In addition, four foreign managers have secured the Pro League championship, which comprise two English (Terry Fenwick, San Juan Jabloteh, three wins, and Ricky Hill, San Juan Jabloteh, one win), a Guyanese (James McLean, North East Stars, one win), and a Saint Lucian (Stuart Charles-Fevrier, W Connection, five wins). Michael McComie became the second Trinidad and Tobago manager to win the league, when he won the title with Joe Public in 2006. Derek King later became the third Trinidad and Tobago manager to claim the league title in 2009, also with Joe Public. In fact, King became the youngest manager to win the league title at 29 years, 198 days. The current managers in the Pro League are:", "The league also names the Manager of the Year award given to the top manager of each Pro League season. The title has been awarded to four foreign managers, which comprises two English (Ricky Hill, San Juan Jabloteh, and Terry Fenwick, San Juan Jabloteh), a Guyanese (James McLean, North East Stars), and a Saint Lucian (Stuart Charles-Fevrier, W Connection). On five occasions the award was given to the manager that led his club to a league championship. Most recently, Derek King became the third Trinidad and Tobago manager to claim the award with Joe Public. King became the youngest manager to win the award at 29 years, 198 days. Beginning in the 2012–13 season, the Pro League re-instituted the Manager and Player of the Month awards given to recognise the best adjudged Pro League manager and player during each month of the league season. The recipient is selected based on points accumulated from coaches, match commissioners, and the media."]}, {"page": "Angus Eve", "response": ["Eve was an assistant coach at San Juan Jabloteh, working with former England international Terry Fenwick. In April 2009 he joined Ma Pau Stars as the assistant coach."]}, {"page": "England national football team records and statistics", "response": ["|Terry Fenwick"]}]}}