{"wiki_id": "http://www.wikidata.org/entity/Q19873106", "itemLabel": "Suzanne Evans", "itemDescription": "British politician (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Suzanne_Evans", "wikipedia_page": {"main": "Suzanne Elizabeth Evans (born February 1965) is an English journalist and politician, formerly associated with the UK Independence Party (UKIP).\nOn 6 May 2010, she was elected as a Conservative councillor in the London Borough of Merton Council. She resigned the Conservative whip on 15 May 2013, and then became a councillor with UKIP from 29 May 2013 to 22 May 2014.Evans was Deputy Chair of UKIP from 2014 to 2016 and 2016 to 2017, with Neil Hamilton and later The Earl of Dartmouth. She was suspended from the party between March and September 2016, and was unable to run in its September 2016 leadership election before being re-appointed to the post of Deputy Chairman by Paul Nuttall. She was one of the three candidates in the party's November 2016 leadership election. She was a spokeswoman for the party and the co-author of its election manifesto in 2015 and 2017. She resigned from the party in December 2018, over the appointment of Stephen Yaxley-Lennon as an advisor to party leader Gerard Batten.She stood as the UKIP candidate in the Shrewsbury and Atcham constituency in the 2015 general election.", "link_mentions": [{"page": "UK Independence Party", "response": ["Batten's appointment of Robinson as an advisor was followed by a wave of high-profile resignations from the party. Farage announced his decision to resign in December 2018, calling Batten \"obsessed\" with Islam and saying that \"UKIP wasn't founded to be a party based on fighting a religious crusade\". Former Deputy Chair Suzanne Evans had left earlier that week after Batten survived a vote of confidence from the party NEC. The former leader of the party in the Welsh Assembly, Caroline Jones, and the MEP William Dartmouth had also cited the party's trajectory to the right as reasons for leaving the party.-  Another former leader, Paul Nuttall, also left for the same reason. By December 2018, a majority of the party's MEPs had left. Others leaving included Peter Whittle, the party's top vote-winner on the London Assembly."]}, {"page": "Lancaster University", "response": ["* Suzanne Evans, Religious Studies (1987, Cartmel) – Former Deputy Chairman of the UK Independence Party"]}, {"page": "Nigel Farage", "response": ["Farage resigned as leader of the United Kingdom Independence Party on 4 July 2016, saying that: \"It's right that I should now stand aside as leader. What I said during the referendum campaign is I want my country back. What I'm saying today is I want my life back. And it begins right now\" and \"I have never been, and I have never wanted to be, a career politician.\" Jean-Claude Juncker, President of the European Commission, described Farage as a \"retro-nationalist\", Caroline Lucas, Green Party MP for Brighton Pavilion, said that his legacy is \"toxic and unforgivable\" and that \"He has used his position to whip up hatred against migrants and divert attention from the real challenges this country is facing.\" Paul Nuttall, a UKIP MEP, tweeted that Farage's \"drive and belief shook establishment politics to its core and gave us a voice\" and Suzanne Evans, former Deputy Chairman of UKIP, said that Farage's resignation surprised her, but \"there is room still in Britain for UKIP\". Writing in The Spectator, after his resignation, the journalist Rod Liddle described Farage as: \"The most important British politician of the last decade and the most successful. His resignation leaves a hole in our political system. With enormous intelligence and chutzpah and a refreshingly unorthodox approach, he built UKIP up from nothing to become established as our third largest party and succeeded in his overriding ambition – to see the UK vote to leave the European Union.\""]}, {"page": "List of Have I Got News for You episodes", "response": ["|Suzanne Evans", "|Suzanne Evans"]}, {"page": "List of people with surname Evans", "response": ["*Suzanne Evans (born 1965), English UKIP politician"]}, {"page": "Shrewsbury Sixth Form College", "response": ["* Suzanne Evans - British journalist and politician"]}, {"page": "List of Question Time episodes", "response": ["|Yvette Cooper, Tim Farron, Suzanne Evans, Conor Burns, Simon Jenkins", "|Ed Davey, Chris Bryant, Sarah Wollaston, Suzanne Evans, Armando Iannucci", "|Amber Rudd, Andy Burnham, Suzanne Evans, Fraser Nelson, Giles Fraser25 June 2015: Giles Fraser was a last minute replacement for Greek finance minister Yanis Varoufakis who was scheduled to be on the panel.", "|Kenneth Clarke, Chris Bryant, Yanis Varoufakis, Suzanne Evans, Julia Hartley-Brewer", "|David Davis, Keir Starmer, Nick Clegg, Suzanne Evans, Melanie Phillips, Alex Salmond", "|David Davis, Barry Gardiner, Nick Clegg, Suzanne Evans, Angus Robertson"]}, {"page": "Paul Nuttall", "response": ["During his leadership bid in 2016, Nuttall pitched himself as the unity candidate and made Suzanne Evans co-deputy chairwoman of the party and Patrick O'Flynn his principal political adviser, both of whom have been seen as political foes of former UKIP leader Nigel Farage. Nuttall vowed in 2016 to \"replace the Labour Party in the next five years and become the patriotic party of the working people\"."]}, {"page": "Template talk:UKIP", "response": ["To add \"Suzanne Evans (acting)\" to the list of leaders."]}, {"page": "2010 Merton London Borough Council election", "response": ["On 15 May 2013, four Conservative councillors defected to the UK Independence Party (UKIP). This included Suzanne Evans, who later became a national UKIP spokeswoman. No by-elections were called as a result of the defections."]}, {"page": "The Agenda with Tom Bradby", "response": ["| 5 || Nicky Morgan, Suzanne Evans, Jeremy Paxman, Griff Rhys Jones and Allison Pearson  || 25 October 2016"]}]}}