{"wiki_id": "http://www.wikidata.org/entity/Q19873162", "itemLabel": "Suzanne Fagence Cooper", "itemDescription": "British non-fiction writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Suzanne_Fagence_Cooper", "wikipedia_page": {"main": "Suzanne Fagence Cooper is a British non-fiction writer who has written extensively on the Pre-Raphaelites and Victorian women.", "link_mentions": [{"page": "Grace Darling", "response": ["Darling's achievement was celebrated in her lifetime; she received a large financial reward in addition to the plaudits of the nation. A number of fictionalised depictions propagated the Grace Darling legend, such as Grace Darling, or the Maid of the Isles by Jerrold Vernon (1839), which gave birth to the legend of “the girl with windswept hair”. Her deed was committed to verse by William Wordsworth in his poem \"Grace Darling\" (1843). A lifeboat with her name was presented to Holy Island. One of a series of Victorian paintings by William Bell Scott at Wallington Hall in Northumberland depicts her rescue efforts. The McManus Galleries in Dundee includes three paintings by Thomas Musgrave Joy that celebrate Grace Darling's deeds with the Forfarshire.Suzanne Fagence Cooper, ‘Joy, Thomas Musgrave (1812–1866)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 5 Oct 2013"]}, {"page": "Sandro Botticelli", "response": ["The first nineteenth-century art historian to be enthusiastic about Botticelli's Sistine frescoes was Alexis-François Rio; Anna Brownell Jameson and Charles Eastlake were alerted to Botticelli as well, and works by his hand began to appear in German collections. The Pre-Raphaelite Brotherhood incorporated elements of his work into their own.Pre-Raphaelite Art in the Victoria & Albert Museum, Suzanne Fagence Cooper, p.95-96 "]}, {"page": "Effie Gray", "response": ["Ruskin confirmed this in his statement to his lawyer during the annulment proceedings: \"It may be thought strange that I could abstain from a woman who to most people was so attractive. But though her face was beautiful, her person was not formed to excite passion. On the contrary, there were certain circumstances in her person which completely checked it.\"Lutyens, M., Millais and the Ruskins, p.191 The reason for Ruskin's disgust with \"circumstances in her person\" is unknown. Various suggestions have been made, including revulsion at either her pubic hair,Phyllis Rose (1983) Parallel LivesFranny Moyle (2009) Desperate Romantics or menstrual blood.Peter Fuller, Theoria: Art and the Absence of Grace, Chatto & Windus, 1988, pp.11–12Suzanne Fagence Cooper (2010) The Model Wife: The Passionate Lives of Effie Gray, Ruskin and Millais. Robert Brownell, on the contrary, in his analysis Marriage of Inconvenience, argues that Ruskin's difficulty with the marriage was financial and related to concerns that Effie and her less affluent family were trying to tap into Ruskin's considerable wealth.", "However, Millais eventually abandoned the Pre-Raphaelite obsession with detail and began to paint in a looser style which produced more paintings for the time and effort. Many paintings were inspired by his family life with his wife, often using his children and grandchildren as models. Millais also used his sister-in-law, Sophie Gray, then in her early teens, as the basis of some striking images in the mid to late 1850s, provoking suggestions of a mutual infatuation.Suzanne Fagence Cooper (2010) The Model Wife: The Passionate Lives of Effie Gray, Ruskin and Millais"]}, {"page": "John Everett Millais", "response": ["Effie's younger sister Sophie Gray sat for several pictures by Millais, prompting some speculation about the nature of their apparently fond relationship.Suzanne Fagence Cooper (2010) The Model Wife"]}, {"page": "Boughton Monchelsea", "response": ["* Thomas Musgrave Joy, painter, was born here in 1812.Suzanne Fagence Cooper, ‘Joy, Thomas Musgrave (1812–1866)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 5 Oct 2013"]}, {"page": "The Mystical Nativity", "response": ["From the moment Botticelli's art is shown in Manchester there's a real change in opinion about his work and certainly by the late 1870s, 1880s Botticelli becomes a real cult figure – somebody the artists who aspire to be on the cutting edge of the art world are looking to...Dante Gabriel Rossetti and Edward Burne-Jones both adapted elements of it for their own work. Burne-Jones copied some of Botticelli's illustrations for Dante's Divine Comedy into his own sketchbooks. Rossetti demonstrated his affection for Botticelli's work by buying his portrait of Smeralda Bandinelli in 1867.Suzanne Fagence Cooper, speaking on the BBC programme The Private Life of a Masterpiece and Pre-Raphaelite Art in the V&A, V&A Publications 2003"]}, {"page": "The McManus", "response": ["The collection includes three paintings by Thomas Musgrave Joy which celebrate Grace Darling's rescue of passengers on the paddlesteamer Forfarshire.Suzanne Fagence Cooper, ‘Joy, Thomas Musgrave (1812–1866)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 5 Oct 2013"]}, {"page": "Duckworth Books", "response": ["In 2003 the company suffered a financial collapse and was put into receivership.John Ezard, \"D-day dawns for Duckworth\", The Guardian, 25 April 2003. Retrieved 30 November 2020. Its assets were bought by Peter Mayer, a former chief executive of Penguin Books, who already owned The Overlook Press of New York City.Famed publisher rescued, bbc.co.uk. Retrieved 30 November 2020. Under new leadership, the company published authors such as Max Brooks, Julia Child, J. J. Connolly, Suzanne Fagence Cooper and Ray Kurzweil.  In 2007 it was reported that Duckworth's trade books were then to be published \"under the Duckworth Overlook\" imprint while academic books would continue to \"carry just the Duckworth name\".Bookview: May 2007, publishingtrends.com. Retrieved 29 November 2020."]}, {"page": "Paul Atterbury", "response": ["* 2001: Victorians at Home and Abroad. London: V & A Publications.  (With Suzanne Fagence Cooper)"]}, {"page": "Sophie Gray", "response": ["Sophie Gray was born in October 1843 to Sophia Margaret Gray, née Jameson (1808–1894), and George Gray (1798–1877), a Scottish lawyer and businessman. Her maternal grandfather, Andrew Jameson, became Sheriff-substitute of Fife.Mervyn Williams (2012) Effie Effie Gray (1828–1897), known initially to the family as \"Phemy,\" was the first of fifteen children, and Sophie was the tenth—three sisters, one also named Sophia Margaret, predeceased her. Two of her five elder brothers died before her birth and two passed away before she was seven.See family tree in Suzanne Fagence Cooper (2010) The Model Wife: The Passionate Lives of Effie Gray, Ruskin and Millais at pp 240–1", "The family lived at Bowerswell, a house re-built in 1842 near the foot of Kinnoull Hill, south-east of Perth. As a child, Gray frequently visited and stayed with her sister Effie in London with her husband, the critic and artist John Ruskin. To an extent Effie, who was fifteen years older than Sophie, acted as a kind of second mother to her and Effie's other siblings. From a young age Gray was exposed to the increasingly strained circumstances of the Ruskins' unconsummated marriage.Suzanne Fagence Cooper (2010) The Model Wife: The Passionate Lives of Effie Gray, Ruskin and Millais, chapter 12 In fact, through her increasing presence in the Ruskin household, Gray may, in some respects, have been a convenient chaperone for her elder sister, whose largely independent social life tended to attract comment.Robert Brownell (2013) Marriage of Inconvenience According to Effie, Ruskin's manservant, Frederick Crawley, expressed to Gray his concern that other servants might spread gossip \"all over Camberwell.\" Gray's governess of three years, a French woman named Delphine, appears to have been discharged by the Grays in March 1854 because of Gray's habit of confiding in her.", "For the next few years Gray continued to sit for Millais. After he and Effie moved to Annat Lodge, close to Bowerswell, she was readily available for this purpose, but while it seems she was beginning to displace Effie herself as a favored subject, it is unsurprising that Effie wanted to keep herself out of the public eye to a degree, following the very public dissolution of her marriage.  In the words of art historian Suzanne Fagence Cooper, whose biographical chapter about Gray (2010) provides the fullest account of her life, Gray \"changes before our eyes from a child to a stunning teenager.\" This change can be traced in three works by Millais: Autumn Leaves (1855–56), Spring (or Apple Blossoms) (1856–1859) and, most strikingly, in a small, but \"unnerving\" portrait of her at the age of 13, entitled Portrait of a Young Lady, or simply Sophie Gray (1857).Tate Britain, Millais, 2007, pp.134-135 Charles Edward Perugini also painted a portrait of Gray as a young woman; the date is not known with certainty and for some years it was attributed mistakenly to Millais. "]}]}}