{"wiki_id": "http://www.wikidata.org/entity/Q19883283", "itemLabel": "Corri Wilson", "itemDescription": "Scottish politician (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Corri_Wilson", "wikipedia_page": {"main": "Corraine \"Corri\" Wilson (born 11 April 1965) is an Alba Party politician who was previously the Scottish National Party (SNP) Member of Parliament (MP) for Ayr, Carrick and Cumnock from 2015–2017.", "link_mentions": [{"page": "Michael Russell (Scottish politician)", "response": ["In November 2020 he was elected to the honorary position of SNP President – having campaigned on a platform of holding an independence referendum in autumn 2021. Russell won 60% of the vote, beating political blogger Craig Murray, who placed second, and former MP Corri Wilson, who placed third."]}, {"page": "Ayr, Carrick and Cumnock (UK Parliament constituency)", "response": ["The newly formed Ayr, Carrick and Cumnock constituency was won by Labour's Sandra Osborne at the 2005 general election with a majority of 9,997 votes (22.2%) ahead of the Conservatives. This was reduced slightly to 9,911 votes (21.6%) in 2010, before the constituency fell to the SNP at the 2015 SNP landslide, with SNP candidate Corri Wilson overturning incumbent Labour MP Sandra Osborne's 13,356 vote lead over the SNP (29.1%), securing the constituency with a majority of 11,265 votes (21.6%). Bill Grant of the Conservatives gained the seat at the 2017 snap general election with a majority of 2,774 votes (6.0%) over Corri Wilson of the SNP. In the 2019 General Election, Allan Dorans of the SNP gained the seat from the Conservatives with a majority of 2,329 votes (5.0%).", "| Corri Wilson"]}, {"page": "Ayr (UK Parliament constituency)", "response": ["At the 2017 general election Conservative candidate Bill Grant gained the Ayr, Carrick and Cumnock constituency with a 2,774 vote majority over the SNP's Corri Wilson."]}, {"page": "List of Scottish National Party MPs", "response": ["|data-sort-value=\"Wilson, Corri\"| Corri Wilson"]}, {"page": "Blair Babe", "response": ["| 77. || Sandra Osborne || Ayr/Ayr, Carrick and Cumnock  || 1997 || 2015 || Lost seat to SNP Corri Wilson"]}, {"page": "List of people with surname Wilson", "response": ["*Corri Wilson (born 1965), Scottish Member of Parliament"]}, {"page": "Chic Brodie (politician)", "response": ["In March 2016, questions were raised about Brodie's Parliamentary expenses. Over the five years that he had been a MSP, he paid a total of £87,616 for \"outsourced constituency work\" to Caledonii Resources, a company set up in 2010. That company was 90% owned by Corri Wilson, who founded it one month before she became an SNP councillor for Ayr East ward in 2012. Some £20,000 was transferred during the Scottish independence referendum campaign in 2014 and a further £20,000 being transferred during the 2015 UK general election campaign."]}, {"page": "2012 South Ayrshire Council election", "response": ["*† Ayr East SNP Cllr Corri Wilson was elected as an MP for Ayr Carrick and Cumnock on 7 May 2015. She resigned her Council seat on 23 June 2015  and a by-election was held on 17 September 2015 and the seat was held by the SNP's John Wallace."]}, {"page": "Cori (name)", "response": ["* Corri Wilson (born 1965), Scottish politician"]}, {"page": "List of MPs for constituencies in Scotland (2015–2017)", "response": ["|Corri Wilson"]}]}}