{"wiki_id": "http://www.wikidata.org/entity/Q19875413", "itemLabel": "Chris Law", "itemDescription": "Scottish politician (born 1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Law", "wikipedia_page": {"main": "Christopher Murray Alexander Law (born 21 October 1969) is a Scottish National Party (SNP) politician. He has been the Member of Parliament (MP)  for Dundee West since 2015. He was first elected at the 2015 general election, winning a seat that had been held by Labour for the previous 65 years.\n\n", "link_mentions": [{"page": "Angus, Scotland", "response": ["*Dundee West — mainly covers Dundee, however a small portion of western Sidlaw area is part of the constituency, is represented by Chris Law of the Scottish National Party."]}, {"page": "Dundee", "response": ["For elections to the British House of Commons at Westminster, the city area and portions of the Angus council area are divided in two constituencies. The constituencies of Dundee East and Dundee West are represented by Stewart Hosie (Scottish National Party) and Chris Law (Scottish National Party), respectively, both of whom were re-elected at the 2019 General Election. For elections to the Scottish Parliament at Holyrood, the city area is divided between three constituencies. The Dundee City East constituency and the Dundee City West constituency are entirely within the city area. The Angus South (Holyrood) constituency includes north-eastern and north-western portions of the city area. All three constituencies are within the North East Scotland electoral region: Shona Robison (SNP) is the Member of the Scottish Parliament (MSP) for the Dundee East constituency; Joe Fitzpatrick (SNP) is the current MSP for the Dundee West constituency and Graeme Dey (SNP) is the current MSP for the Angus South constituency."]}, {"page": "Scottish National Party", "response": ["|Chris LawMP for Dundee West"]}, {"page": "Dundee West (UK Parliament constituency)", "response": ["Labour's majority was reduced in 2005 by the SNP candidate  Joe Fitzpatrick despite changes to the boundaries which should have favoured Labour; suggesting that the constituency might be becoming more marginal, although the gap widened again in 2010. The current MP is Chris Law, who was the first-ever MP from the Scottish National Party elected for Dundee West; as part of the party's near-clean sweep of the majority of Scottish seats at that year's general election.", "| Chris Law"]}, {"page": "Scottish Westminster constituencies from 2005", "response": ["| Chris Law"]}, {"page": "Madras College", "response": ["* Chris Law – Member of Parliament for Dundee West"]}, {"page": "List of Scottish National Party MPs", "response": ["|data-sort-value=\"Law, Chris\"| Chris Law"]}, {"page": "Politics of Dundee", "response": ["Currently, Stewart Hosie (Scottish National Party) is Member of Parliament (MP) for the Dundee East constituency, and Chris Law (Scottish National Party) is MP for the Dundee West constituency."]}, {"page": "International Development Committee", "response": ["| Chris Law MP", "|Chris Law MP"]}, {"page": "Committees on Arms Export Controls", "response": ["|Chris Law MP"]}, {"page": "Chris law", "response": ["#REDIRECT Chris Law "]}, {"page": "1987 Louis Vuitton Cup", "response": ["From the Royal Thames Yacht Club, White Crusader was designed by Ian Howlett and was a traditional 12-metre design evolved from the DeSavery Victory'83 boat of the previous Americas Cup event. However, White Crusader II was a radical design and designed by David Hollam. This second boat was used as a trial horse against White Crusader, but the team eventually decided to use the more conventional designed boat. Tank testing was carried out at Southampton University and HMS Haslar. The deadline for acceptance of challenges was 1 April 1986 and Admiral Sir Ian Easton wrote his own personal cheque for $16,000 as an entry fee deposit. Harold Cudmore acted as skipper-tactician and starting helmsman who then handed over the helm to Chris Law for the remainder of each races. Eddie Warden-Owen was the navigator. Both boats were originally named simply Crusader One and Two but the \"White\" part of their names were added when millionaire Graham Walker (Of White Horse whiskey fame) gave heavy sponsorship to the British challengers at the last minute before the event started so the \"White\" was added to their names."]}, {"page": "1983 Louis Vuitton Cup", "response": ["Peter de Savary funded the Royal Burnham Yacht Club's Victory Syndicate. The team used three skippers over the Cup: Phil Crebbin, Lawrie Smith and Rodney Pattisson. The crew included Chris Law, Robin Fuger, Harold Cudmore, who quit the campaign before the start of the Cup, and future America's Cup Hall of Famer Dean Phipps, racing in his first America's Cup."]}, {"page": "Stena Match Cup Sweden", "response": ["|2003 ||  Chris Law ||  Karol Jablonski ||  Peter Holmberg ||  Jesper Bank", "|2004 ||  Russell Coutts ||  Peter Gilmour ||  Magnus Holmberg ||  Chris Law"]}, {"page": "List of MPs for constituencies in Scotland (2015–2017)", "response": ["|Chris Law"]}]}}