{"wiki_id": "http://www.wikidata.org/entity/Q1989122", "itemLabel": "Margaret Mellis", "itemDescription": "British artist (1914-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaret_Mellis", "wikipedia_page": {"main": "Margaret Nairne Mellis (22 January 1914 – 17 March 2009) was a British artist, one of the early members and last survivors of the group of modernist artists that gathered in St Ives, in Cornwall, in the 1940s. She and her first husband, Adrian Stokes, played an important role in the rise of St Ives as a magnet for artists. She later married Francis Davison, also an artist, and became a mentor to the young Damien Hirst.", "link_mentions": [{"page": "Southwold", "response": ["*Margaret Mellis (1914–2009), a modernist artist of the St Ives School"]}, {"page": "St Ives, Cornwall", "response": ["* Margaret Mellis (1914–2009) British artist, one of the early members and last survivors of the group of modernist artists in St Ives"]}, {"page": "Naum Gabo", "response": ["Gabo visited London in 1935, and settled in 1936, where he found a \"spirit of optimism and sympathy for his position as an abstract artist\". At the outbreak of World War II he followed his friends Barbara Hepworth and Ben Nicholson to St Ives in Cornwall, where he stayed initially with the art critic Adrian Stokes and his wife Margaret Mellis. While in Cornwall he continued to work, albeit on a smaller scale. His influence was important to the development of modernism within St Ives, and it can be seen most conspicuously in the paintings and constructions of John Wells and Peter Lanyon, both of whom developed a softer more pastoral form of Constructivism."]}, {"page": "Culture of Cornwall", "response": ["At the outbreak of World War II Nicholson came to live in St Ives with his wife Barbara Hepworth; staying initially with the philosopher and writer Adrian Stokes (critic) and his wife Margaret Mellis. Naum Gabo also joined them there as well as artists who at the time were at an earlier stage in their careers: John Wells, Wilhelmina Barns-Graham, Terry Frost and Bryan Wynter. Other artists of international repute joined the colony later: notably Patrick Heron, Roger Hilton and Sandra Blow."]}, {"page": "William Gear", "response": ["Gear was born in Methil in south-east Fife, Scotland, the son of Janet (1886-1955) and Porteous Gear (1881-1965), a coal miner. He attended Buckhaven High School where he won the Dux Arts Medal (1932). From 1932 to 1936 he studied at Edinburgh College of Art where fellow students included Wilhelmina Barns-Graham and Margaret Mellis."]}, {"page": "Salthouse", "response": ["The Parish Church of St Nicholas is a Grade I listed building; it was rebuilt by Sir Henry Heydon (died 1504). From 2001 to 2011 the church in Salthouse was the setting for an annual month-long contemporary art exhibition by artists with a Norfolk connection. The exhibition was organised by the North Norfolk Exhibition Project (NNEP). The curator of Salthouse 09 was Simon Martin from Pallant House Gallery in Chichester, on a theme of 'Salt of the Earth.' The exhibition ran from 2 July to 2 August 2009 and included ceramics, film, installation, painting, printmaking and sculpture. The 50 artists in the exhibition included Maggi Hambling, Gary Breeze, Kabir Hussain, Colin Self, Margaret Mellis and Ana Maria Pacheco and the potters Ruthanne Tudball and Stephen Parry."]}, {"page": "Wilhelmina Barns-Graham", "response": ["After her education Barns-Graham made study trips to Paris, London and St Tropez before moving to St Ives, Cornwall in 1940 at the suggestion of the Edinburgh College of Art's Principal Hubert Wellington. Barns-Graham moved near to where a group of modernist artists had settled, at Carbis Bay. This was a pivotal moment in her life. On one of her first evenings there she met the sculptor Barbara Hepworth who made an immediate and lasting impression on her she then went on to meet Borlase Smart, Alfred Wallis and Bernard Leach, as well as the painter Ben Nicholson and the sculptors Naum Gabo and Margaret Mellis. After two weeks in St Ives, Barns-Graham acquired her first studio, directly below the Porthmeor Gallery which was the administrative headquarters of the St Ives Society of Artists. Her paintings at the time were heavily influenced by the Cornish landscapes and the St Ives harbour. During 1940 and 1941 Barns-Graham contributed to the war effort by volunteering in a factory making camouflage nets however using the rough materials gave her dermatitis so she had to give up the work, instead knitting string vests and socks."]}, {"page": "Pier Arts Centre", "response": ["Throughout the 1930s and 40s Gardiner was a key supporter of the small group of artists who sought sanctuary in St Ives and she was also an early champion of the Cornish painter and seaman Alfred Wallis. Following the Second World War she encountered and encouraged a new generation of artists, including Peter Lanyon, Patrick Heron, Terry Frost, Margaret Mellis, John Wells and Roger Hilton, that had been drawn to St Ives by its growing reputation as a centre of innovation.", "| • Martin Boyce || • Robin Gillanders || • Margaret Mellis || • Italo Valenti"]}, {"page": "Adrian Stokes (critic)", "response": ["In 1938 Stokes married and moved with his artist wife, Margaret Mellis, to live in Carbis Bay, [St Ives, Cornwall] where their son Telfer was born. Meanwhile—through bringing Ben Nicholson and Barbara Hepworth, and, with them, Naum Gabo, to St Ives in 1939 – Stokes became the main catalyst of the town's transformation into an internationally acclaimed centre of modern art. During World War II he worked as a market gardener and for the Home Guard. Alongside this work he completed a further Early Italian Renaissance book, Venice (1945). He also wrote an autobiographical book, Inside Out (1947), in which he drew on material from his psychoanalysis to which he added reflections about the art of Cézanne."]}, {"page": "Scottish art", "response": ["Notable post-war artists included Robin Philipson (1916–92), who was influenced by the Colourists, but also Pop Art and neo-Romanticism.MacDonald, Scottish Art, pp. 189–90. Robert MacBryde (1913–66), Robert Colquhoun (1914–64) and Joan Eardley (1921–63), were all graduates of the Glasgow School of Art. MacBryde and Colquhoun were influenced by neo-Romanticism and the Cubism of Adler. The English-born Eardley moved to Glasgow and explored the landscapes of Kincardineshire coast and created depictions of Glasgow tenements and children in the streets.MacDonald, Scottish Art, pp. 191–2. Scottish artists that continued the tradition of landscape painting and joined the new generation of modernist artists of the highly influential St Ives School were Wilhelmina Barns-Graham (b. 1912–2004), Margaret Mellis (b. 1914–2009).MacDonald, Scottish Art, p. 193."]}, {"page": "York Art Gallery", "response": ["In November 2020 the gallery announced that it had acquired works following a successful application to the Derbyshire School Library Service, which had owned the works but closed in 2018. The works acquired are by four British artists: Prunella Clough, Margaret Mellis, Marion Grace Hocken, and Daphne Fedarb."]}, {"page": "Michael Bird (author)", "response": ["* ‘The transformed total: the constructions of Margaret Mellis’, Margaret Mellis (exhib. cat., London: Austin/Desmond Fine Art, 2008)"]}, {"page": "Mellis (disambiguation)", "response": ["*Margaret Mellis, British artist"]}, {"page": "Art in modern Scotland", "response": ["Notable post-war artists included Robin Philipson (1916–92), who was influenced by the Colourists, but also Pop Art and neo-Romanticism.MacDonald, Scottish Art, pp. 189–90. Robert MacBryde (1913–66), Robert Colquhoun (1914–64) and Joan Eardley (1921–63), were all graduates of the Glasgow School of Art. MacBryde and Colquhoun were influenced by neo-Romanticism and the Cubism of Adler. The English-born Eardley moved to Glasgow and explored the landscapes of Kincardineshire coast and created depictions of Glasgow tenements and children in the streets.MacDonald, Scottish Art, pp. 191–2. Scottish artists that continued the tradition of landscape painting and joined the new generation of modernist artists of the St Ives School were Wilhelmina Barns-Graham (1912–2004) and Margaret Mellis (1914–2009).MacDonald, Scottish Art, p. 193."]}, {"page": "Landscape painting in Scotland", "response": ["In the post-war period the English-born Joan Eardley explored the landscapes of the Kincardineshire coast and created depictions of Glasgow tenements and children in the streets. Scottish artists that continued the tradition of landscape painting and joined the new generation of modernist artists of the highly influential St Ives School were Wilhelmina Barns-Graham  and Margaret Mellis. Husband and wife Tom MacDonald and Bet Low with William Senior formed the Clyde Group, aimed at promoting political art and producing industrial landscapes. John Bellany focused on the coastal communities of his birth. The coastal theme would also be pursued by artists such as Elizabeth Ogilvy, Joyce W. Cairns and Ian Stephen.", "In the post-war period the English-born Joan Eardley (1921–63) moved to Glasgow, where she was a graduate of the Glasgow School of Art and explored the landscapes of the Kincardineshire coast and created depictions of Glasgow tenements and children in the streets.MacDonald, Scottish Art, pp. 191–2. Scottish artists that continued the tradition of landscape painting and joined the new generation of modernist artists of the highly influential St Ives School were Wilhelmina Barns-Graham (1912–2004) and Margaret Mellis (1914–2009).MacDonald, Scottish Art, p. 193. Polish realist Josef Herman (1911–2000) was resident in Glasgow between 1940 and 1943Macmillan, Scottish Art, 1460–1990, pp. 370–1. where he influenced husband and wife Tom MacDonald (1914–1985) and Bet Low (born 1924), who with painter William Senior (born 1927) formed the Clyde Group, aimed at promoting political art. Their work included industrial and urban landscapes such as MacDonald's Transport Depot (1944–45) and Bet Low's Blochairn Steelworks (c. 1946). John Bellany (born 1942), mainly focusing on the coastal communities of his birth, labelled \"Scottish realism\", was among the leading Scottish intellectuals from the 1960s.C. Richardson, Scottish Art Since 1960: Historical Reflections and Contemporary Overviews (Aldershot: Ashgate, 2011), , p. 58. Landscape has remained a major form in Scottish painting in the work of artists such as James Morrison (born 1932), Ian MacKenzie Smith (born 1935), Duncan Shanks (born 1937) and Barbara Rae (born 1943).Macmillan, Scottish Art, 1460–1990, p. 400. The coastal theme would also be pursued by artists such as Elizabeth Ogilvy (born 1946), Joyce W. Cairns (born 1947) and Ian Stephen (born 1955)."]}, {"page": "Mellis (surname)", "response": ["*Margaret Mellis (1914–2009), Scottish artist"]}, {"page": "The Minories, Colchester", "response": ["The acquisition and subsequent sale of Robert Bevan’s The Cab Yard in the 1970s paved the way for the purchase of the adjacent property as a new exhibiting space, which became known as The Girling Room.  As a result, the Contemporary Art Society gifted generously to the collection with works such as Margaret Mellis' Lilac Yellow and Ian McKeever's Sand and Sea Series No. 8. The Victor Batte-Lay Trust then developed a policy of acquiring work by 20th century artists preferably with strong regional links."]}, {"page": "List of Scottish women artists", "response": ["*Margaret Mellis (1914–2009), Chinese-born painter"]}, {"page": "Telfer Stokes", "response": ["The son of Margaret Mellis and Adrian Stokes, he was born in St Ives and studied at the Slade School of Fine Art. He pursued postgraduate studies at the Brooklyn Museum Art School after being awarded a Beckmann Fellowship. He taught at Reading Art School and the Bath Academy in Corsham and exhibited his paintings in London, including a show at the Serpentine Gallery. In 1971, Stokes founded publishing firm Weproductions, which produced artist's books; from 1974, he operated in partnership with Helen Douglas. In 2002, Stokes moved to East Anglia to care for his mother. He redirected his focus to sculpture, which he exhibited at the Kettle's Yard open house in 2008 and at shows in various galleries."]}, {"page": "List of women in Cornwall and the Isles of Scilly", "response": ["*Margaret Mellis, St Ives school artist"]}, {"page": "Francis Davison", "response": ["Francis Davison (1919–1984) was a British visual artist and painter. His later work, starting shortly after his marriage to Margaret Mellis in 1948, is characterised by the use of collage: coloured printed paper layered and mounted on board. Davison remained in relative obscurity until finding recognition in the late 1970s and early 80s. He died in 1984."]}]}}