{"wiki_id": "http://www.wikidata.org/entity/Q19882967", "itemLabel": "Joanna Cherry", "itemDescription": "Scottish politician and lawyer (born 1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joanna_Cherry", "wikipedia_page": {"main": "Joanna Catherine Cherry  (born 18 March 1966) is a Scottish politician and lawyer serving as the Member of Parliament (MP) for Edinburgh South West since 2015. A member of the Scottish National Party (SNP), she was the party's Shadow Home Secretary and Shadow Secretary of State for Justice in the House of Commons from 2015 to 2021. She is often spoken of as a future leader of the SNP.", "link_mentions": [{"page": "Politics of Edinburgh", "response": ["|Joanna Cherry"]}, {"page": "David Martin (Scottish politician)", "response": ["In July 2019, Joanna Cherry, Member of Parliament for Edinburgh South West, suggested the Assembly would be used to promote Scottish nationalism. Martin, a unionist, refused to endorse a boycott of the Assembly encouraged by Scotland in Union, the Scottish Conservatives and the Scottish Liberal Democrats. He insisted the running of the Assembly would be impartial and expressed his disappointment at the going ahead of the boycott."]}, {"page": "David Paisley", "response": ["Paisley is the son of author Janet Paisley, one of seven children. He was voted 'Britain's sexiest man' by readers of Gay Times magazine in 2003. Paisley is a vegetarian. In 2021, SNP MP Joanna Cherry alleged he had defamed her on Twitter, though he refuted this and Cherry did not take the matter to court."]}, {"page": "Edinburgh Law School", "response": ["* Joanna Cherry, current Scottish National Party MP for Edinburgh South-West"]}, {"page": "Edinburgh South West (UK Parliament constituency)", "response": ["Edinburgh South West is a Scottish constituency of the House of Commons of the Parliament of the United Kingdom (Westminster), first used in the 2005 general election. It elects one Member of Parliament (MP) by the first past the post system of election. It is currently represented by Joanna Cherry of the SNP since 2015.", "| Joanna Cherry "]}, {"page": "Scottish Westminster constituencies from 2005", "response": ["| Joanna Cherry"]}, {"page": "Gorgie", "response": ["The Gorgie area is within the Edinburgh South West constituency for the Westminster Parliament and is represented by the Rt Hon Joanna Cherry MP of the Scottish National Party."]}, {"page": "PinkNews", "response": ["In June 2019, MP Joanna Cherry took legal action against PinkNews after it published a story that falsely claimed she was being investigated for homophobia. To settle the case, PinkNews issued an apology, paid her legal costs, and made a donation to the Lesbian and Gay Immigration Group."]}, {"page": "Dalry, Edinburgh", "response": ["Dalry is represented by the Edinburgh South West Parliamentary Constituency. The current Member of Parliament (MP) is Joanna Cherry who is a member of the Scottish National Party (SNP). Dalry is represented in the Scottish Parliament as part of the Edinburgh Central constituency, which is currently represented by the SNP's Angus Robertson. Edinburgh Central is located within the Lothian Electoral Region. Locally, residents are served by the Gorgie Dalry Community Council, which is a constituent of the City of Edinburgh Council. The council usually meet in St Martin's church hall on Dalry Road."]}, {"page": "List of Scottish National Party MPs", "response": ["|data-sort-value=\"Cherry, Joanna\"| Joanna Cherry"]}, {"page": "Scottish Politician of the Year", "response": ["*2019: Joanna Cherry MP, Scottish National Party"]}, {"page": "St Margaret's School, Edinburgh", "response": ["*Joanna Cherry, SNP politician"]}, {"page": "List of gay, lesbian or bisexual people: C", "response": ["| Joanna Cherry"]}, {"page": "Joint Committee on Human Rights", "response": ["| Joanna Cherry"]}, {"page": "List of Question Time episodes", "response": ["|Anna Soubry, John McDonnell, Joanna Cherry, Quentin Letts, Alastair Campbell", "|Jacob Rees-Mogg, Angela Eagle, Joanna Cherry, Matthew Parris, Tim Martin", "|Ben Wallace, Joanna Cherry, Emily Thornberry, Merryn Somerset Webb, David Hayman", "|Tom Tugendhat, Ian Murray, Joanna Cherry, Alex Massie, Val McDermid"]}, {"page": "Raymond Doherty, Lord Doherty", "response": ["In April 2010, he was appointed a Senator of the College of Justice, a judge of the Court of Session and High Court of Justiciary, the Supreme Courts of Scotland, taking the judicial title, Lord Doherty. He heard the case brought by a number of Scottish politicians, including Andy Wightman and Joanna Cherry, which sought an answer to the question on whethear the United Kingdom could unilaterally withdraw its notice of its intention to leave the European Union. Lord Doherty refused permission for judicial review,\"Judge refuses permission to proceed in legal challenge over revocability of Article 50, Scottish Legal News, 6 February 2018 but this decision was overturned by the Inner House of the Court of Session.\"Appeal judges grant permission to proceed in legal challenge over revocability of Article 50\", Scottish Legal News, 20 March 2018 "]}, {"page": "Speaker's Lectures", "response": ["* Rt Hon Joanna Cherry, 21 January 2019 (rescheduled)"]}, {"page": "1966 in Scotland", "response": ["* 18 March – Joanna Cherry, Scottish National Party politician and lawyer"]}, {"page": "2015 United Kingdom general election", "response": ["|data-sort-value=\"Cherry, Joanna%\"|Joanna Cherry"]}, {"page": "List of MPs elected in the 2015 United Kingdom general election", "response": ["Other new MPs included; Chris Philp,  Rebecca Long-Bailey, Angela Rayner, Antoinette Sandbach, Mhairi Black, Richard Burgon, Sue Hayman, Joanna Cherry, Oliver Dowden, Andrea Jenkyns, Suella Braverman, Chris Matheson, Amanda Milling, Heidi Allen, Stephen Kinnock, Jess Phillips, Ruth Smeeth, Kelly Tolhurst, Tulip Siddiq, Amanda Solloway, Craig Mackinlay, Alison Thewliss and Clive Lewis."]}, {"page": "Mhairi Black", "response": ["In March 2020, it was reported that Black had a \"blazing row\" with her fellow SNP MP Joanna Cherry, after the latter questioned her decision to visit a primary school with a drag queen."]}]}}