{"wiki_id": "http://www.wikidata.org/entity/Q19874939", "itemLabel": "Viola Klein", "itemDescription": "British sociologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Viola_Klein", "wikipedia_page": {"main": "Viola Klein (1908–1973) was a sociologist in Great Britain. Her work demonstrated that objective ideas about women's attributes are socially constructed. Although her early training was in psychology and philosophy, her most prolific research engagements concerned women's social roles and how these changed after the Industrial Revolution. She was one of the first scholars to bring quantitative evidence to bear on this socio-economic topic. Her research not only illuminated the changing roles of women in society, but she also wrote and lectured on concrete social and political changes that would help facilitate these new roles.", "link_mentions": [{"page": "Glass ceiling", "response": ["The second shift focuses on the idea that women theoretically work a second shift in the manner of having a greater workload, not just doing a greater share of domestic work. All of the tasks that are engaged in outside the workplace are mainly tied to motherhood. Depending on location, household income, educational attainment, ethnicity and location. Data shows that women do work a second shift in the sense of having a greater workload, not just doing a greater share of domestic work, but this is not apparent if simultaneous activity is overlooked. Alva Myrdal and Viola Klein as early as 1956 focused on the potential of both men and women working in settings that included paid and unpaid types of work environments. Research indicated that men and women could have equal time for activities outside the work environment for family and extra activities. This \"second shift\" has also been found to have physical effects as well. Women who engage in longer hours of work in pursuit of family balance, often face increased mental health problems such as depression and anxiety. Increased irritability, lower motivation and energy, and other emotional issues were also found to occur as well. The overall happiness of women can be improved if a balance of career and home responsibilities is found."]}, {"page": "Feminism in the United Kingdom", "response": ["Feminist writers of that period, such as Alva Myrdal and Viola Klein, started to allow for the possibility that women should be able to combine home with outside employment. 1950s’ form of feminism is often derogatorily termed “welfare feminism.”"]}, {"page": "Juliet Mitchell", "response": ["Mitchell gained instant media attention with her pathbreaking article “Women: The Longest Revolution\", in the New Left Review (1966), an original synthesis of Simone de Beauvoir, Frederich Engels, Viola Klein, Betty Friedan and other analysts of women's oppression.https://platypus1917.org/wp-content/uploads/2011/08/38-Singh-Mitchell1.pdf"]}, {"page": "1940s in sociology", "response": ["*Viola Klein's The Feminine Character: History of an Ideology is published."]}, {"page": "1950s in sociology", "response": ["*Viola Klein's and Alva Myrdal's Women's Two Roles: Home and Work is published."]}, {"page": "1960s in sociology", "response": ["*Viola Klein's and Alva Myrdal's Women's Two Roles: Home and Work, 2nd edition is published."]}, {"page": "Social history of Postwar Britain (1945–1979)", "response": ["Feminist writers of the early postwar period, such as Alva Myrdal and Viola Klein, started to allow for the possibility that women should be able to combine home duties with outside employment. Feminism was strongly connected to social responsibility and involved the well-being of society as a whole. This often came at the cost of the liberation and personal fulfillment of self-declared feminists. Even those women who regarded themselves as feminists strongly endorsed prevailing ideas about the primacy of children's needs, as advocated, for example, by John Bowlby the head of the Children's Department at the Tavistock Clinic and by Donald Winnicott.Finch and Summerfield (1991) p 11"]}, {"page": "History of women in the United Kingdom", "response": ["Feminist writers of that period, such as Alva Myrdal and Viola Klein, started to allow for the possibility that women should be able to combine home with outside employment. 1950s’ form of feminism is often derogatorily termed \"welfare feminism.\""]}, {"page": "Ferdynand Zweig", "response": ["In the view of Helen McCarthy, Zweig's studies of working-class men were related to the concerns of other post-war social researchers like Brian Jackson, Dennis Marsden and Peter Willmott, \"all deeply absorbed in the 'male melodrama of the upwardly mobile'\"; Zweig's studies of women in work, however, reflected interests not shared with those men.McCarthy, p. 281. McCarthy argues that Zweig was one of a number of researchers in the 1950s (such as Viola Klein, Pearl Jephcott, Judith Hubback, Nancy Seear and Hannah Gavron) who \"helped to entrench new understandings of married women’s employment as a fundamental feature of advanced industrial societies, and one that solved the dilemmas of 'modern' woman across social classes.\"McCarthy, p. 270. "]}, {"page": "Hannah Gavron", "response": ["The year after her death, Gavron's thesis was published as The Captive Wife, which is cited as an early example of the emergent British feminist literature and a noted early sociological study on women and work. It was a qualitative sociological analysis of narrative accounts of working- and middle-class married women's lives, and has been called one of the \"classic examples of feminist interpretation of housework\". She argued that women tended to leave paid work after childbirth and that motherhood stripped women of independence, bringing their values and aspirations as 'New' women into conflict with the traditional role they were having to play as mothers.Mary Eagleton and Emma Parker, The History of British Women's Writing, 1970–present, vol. 10 (London: Palgrave Macmillan, 2015), p. 115.  In the view of Helen McCarthy, this study meant that Fyvel (Gavron) was one of a number of researchers in the 1950s and early 1960s (such as Nancy Seear, Viola Klein, Ferdynand Zweig, Judith Hubback and Pearl Jephcott) who \"helped to entrench new understandings of married women's employment as a fundamental feature of advanced industrial societies, and one that solved the dilemmas of 'modern' woman across social classes.\"Helen McCarthy, \"Social Science and Married Women’s Employment in Post-War Britain\", Past and Present, vol. 233, no. 1 (2016), p. 270.  In 1990, Ann Oakley wrote that Gavron was an \"optimistic pioneer of modern feminism\" who \"stood as a role model for many of us, trying to make our way in the male-dominated world of social science. She even at times appears in the guise of a cultural metaphor à la Sylvia Plath and many others – a woman torn apart by her position on the edge of time, by those same dilemmas of being female which form the subject matter of her work and writing\".Ann Oakley, \"Optimistic pioneer of modern feminism\", The Observer, 29 August 1990, p. 33. In 2015, Gavron's son Jeremy published his memoirs of her, A Woman on The Edge of Time, which was the 15 Minute Drama on BBC Radio 4 in June 2019."]}, {"page": "Judith Hubback", "response": ["In the words of the historian Helen McCarthy, Hubback was one of a number of researchers in the 1950s (such as Viola Klein, Pearl Jephcott, Ferdynand Zweig, Nancy Seear and Hannah Gavron) who \"helped to entrench new understandings of married women’s employment as a fundamental feature of advanced industrial societies, and one that solved the dilemmas of ‘modern’ woman across social classes.\"McCarthy, p. 270. She reported the frustrations of highly qualified women who felt constrained to stop working once they married or to care for their children; she concluded that women who sacrificed themselves and their capacity for self-actualisation to become full-time mothers and wives instead were \"often too self-sacrificing in the sense that they let themselves drift into a state of mind in which their daily lives gradually destroy them as individuals\".Judith Hubback, Wives Who Went to College (1957), pp. 150–1, cited in McCarthy, p. 284. Hubback argued that women could balance motherhood, marriage and work only through the full support of their husbands.Ina Zweiniger-Bargielowska (ed.), Women in Twentieth-Century Britain: Social, Cultural and Political Change (Longman, 2001), p. 126. Wives Who Went to College was the subject of much discussion: it received 87 reviews in published material and was the subject of leading articles in The Times and The Economist.McCarthy, p. 288."]}, {"page": "Pearl Jephcott", "response": ["In 1942, Jephcott was given leave by the National Association of Girls' Clubs to carry out research into girls' experiences of growing up in England and Wales. She collected information on the work and home life, leisure and relationships of 153 girls aged 14 to 18, the results of which were reported in Jephcott's first book: Girls Growing Up (1942). She followed this up the next year with Clubs for Girls, which provided a guide on organising clubs. She was awarded a Barnett Fellowship to carry out a follow-up study of the girls she spoke to in 1942, and produced Rising Twenties in 1948 as a result. She then worked for Political and Economic Planning, before joining the University of Nottingham in 1950 to oversee research projects, one of which examined youth groups and was published as Some Young People (1954). That year she became a Senior Research Assistant at the London School of Economics, working under Richard Titmuss alongside Nancy Seear and John Smith. They investigated married women in employment in Bermondsey and she focused on home life. The result was Married Women Working, published in 1962. In the view of Helen McCarthy, this study meant that Jephcott was one of a number of researchers in the 1950s and early 1960s (such as Seear, Viola Klein, Ferdynand Zweig, Judith Hubback and Hannah Gavron) who \"helped to entrench new understandings of married women’s employment as a fundamental feature of advanced industrial societies, and one that solved the dilemmas of 'modern' woman across social classes.\"Helen McCarthy, \"Social Science and Married Women’s Employment in Post-War Britain\", Past and Present, vol. 233, no. 1 (2016), p. 270."]}, {"page": "Judith Astelarra", "response": ["While studying in Santiago, she discovered Viola Klein's works on psychology and the condition of women as well as Simone de Beauvoir's memoirs. Both encouraged her to turn to feminism and gender studies. On graduating, she joined the Department of Regional Planning at Chile's Corporation for Regional Reform (CORA). She visited areas where the first collective property models and farm workers settlements were being established. While studying in the United States, she experienced the development of student movements demanding the coverage of women's developments in the universities. She also saw Betty Friedan's creation of the National Organization for Women. After earning her doctorate in New York, she returned to Chile in 1971 where she joined the Socialist Party. In 1973, threatened with a coup d'état against Salvador Allende, together with her family she moved back to Buenos Aires where she served as a governmental official."]}]}}