{"wiki_id": "http://www.wikidata.org/entity/Q19882875", "itemLabel": "Thangam Debbonaire", "itemDescription": "British politician (born 1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thangam_Debbonaire", "wikipedia_page": {"main": "Thangam Elizabeth Rachel Debbonaire (née Singh; born 3 August 1966) is a British Labour Party politician, Shadow Leader of the House of Commons since 2021. She previously was the Shadow Secretary of State for Housing from 2020 to 2021. She was elected Member of Parliament (MP) for Bristol West at the 2015 general election, when she defeated the incumbent Liberal Democrat MP Stephen Williams. Shortly after being elected, Debbonaire was diagnosed with breast cancer, and did not attend a parliamentary vote from June 2015 until March 2016.In January 2016, she was appointed shadow Arts and Culture Minister until resigning on 27 June 2016  because of her lack of confidence in the Labour Party Leader, Jeremy Corbyn. She rejoined his front bench team as a whip in October that year, before being made Shadow Brexit Minister in January 2020.", "link_mentions": [{"page": "Chetham's School of Music", "response": ["*Thangam Debbonaire – Labour MP"]}, {"page": "Bishopston, Bristol", "response": ["Bishopston is in the Bristol West parliamentary constituency and is represented by Thangam Debbonaire of the Labour Party. It is split between the wards of Redland and Bishopston and Ashley Down. Redland ward is represented by Martin Fodor and Fi Hance, both of the Green Party and Bishopston and Ashley Down ward is represented by Lily Fitzgibbon and Emma Edwards, also both of the Green Party"]}, {"page": "Cotham, Bristol", "response": ["Cotham is part of the parliamentary constituency of Bristol West. Since 2015 the Member of Parliament is Thangam Debbonaire, a Labour party member."]}, {"page": "Horfield, Bristol", "response": ["The southern part of the parish is in Bishopston ward, in Bristol West parliamentary constituency. The sitting MP since 2015 is Thangam Debbonaire, Labour. The current councillors are Cllr David Willingham (Liberal Democrat) and Cllr Daniella Radice (Green)"]}, {"page": "Bristol West (UK Parliament constituency)", "response": ["Bristol West is a borough constituency represented in the House of Commons of the Parliament of the United Kingdom since 2015 by Thangam Debbonaire of the Labour Party. It mostly covers the central and western parts of Bristol.", "At the 2005 election the seat was Liberal Democrat target number 18, and Conservative target number 50; it had been frequently described in the media as a \"three-way marginal\", and all parties fought hard for the constituency. The seat was taken by Liberal Democrat Stephen Williams with a large majority, thought to have been aided by the large student electorate, hostile to Labour's top-up fees policy. This Liberal Democrat success was similar to those in other seats with a large student population, such as Cambridge, Manchester Withington, Leeds North West and Cardiff Central. In the 2010 election, Stephen Williams held the seat with an increased majority. In the 2015 general election, the Lib Dem vote fell by 29.2%; Williams came a distant third behind the winning Labour candidate Thangam Debbonaire and more than 5,000 votes behind the Green Party candidate, who achieved the greatest increase in the Green vote (+23%) in any seat that election.  In 2017 Bristol West had the biggest swing to Labour in the country. The 52.1% majority was also the largest in the seat since 1931.", "| Thangam Debbonaire"]}, {"page": "Stephen Williams (British politician)", "response": ["Stephen Roy Williams (born 11 October 1966) is a British Liberal Democrat politician who served as Member of Parliament (MP) for Bristol West from the 2005 general election until his defeat by Labour Party candidate Thangam Debbonaire in 2015. As an MP, he served in the Cameron–Clegg coalition government as Parliamentary Under-Secretary of State in the Department of Communities and Local Government from 2013 to 2015.", "In the 2015 United Kingdom general election, Williams lost his seat to Labour Party candidate Thangam Debbonaire. He came third with 18.8% of the vote. Before the election, he said he was concerned about losing support amongst students for abstaining on the vote to increase tuition fees to £9,000 a year."]}, {"page": "Philip Davies", "response": ["A few days later in December 2016, Davies talked for 78 minutes in an unsuccessful attempt to derail a Bill designed to bring Britain in line with the Istanbul Convention whose purported aim is to protect women against violence. He argued that the Bill was \"sexist against men\" because of its focus and ignored other victims which if recognised equally would have been \"true equality\". Thangam Debbonaire, speaking after him, had to cut her own speech short in order to make sure his filibustering did not succeed. The bill was, however, passed by 135 to 2. At the bill's third reading on 24 February 2017, Davies spoke for 91 minutes and proposed amendments (which were defeated), but was unsuccessful in blocking the Preventing and Combating Violence Against Women and Domestic Violence (Ratification of Convention) Bill, which was passed by 138 votes to 1, with Davies being the only MP to vote against. The government supported the bill."]}, {"page": "Ashley (Bristol ward)", "response": ["Ashley is part of the Bristol West parliamentary constituency, which elects one Member of Parliament. The incumbent MP is Thangam Debbonaire of the Labour Party."]}, {"page": "List of Parliamentary constituencies in Avon", "response": ["|Thangam Debbonaire‡"]}, {"page": "Cabot, Bristol (former ward)", "response": ["In the 2001 Census Cabot wardBristol City Council: Statistics and census information: Ward Finder and information about your ward including councillors, ward profiles and ward maps had a resident population of 9,604. The population is generally young, student/professional and in rented accommodation. The ward was in the Parliamentary constituency of Bristol West (held by Thangam Debbonaire), and had two councillors: Mark Wright and Ani Stafford-Townsend.Bristol City Council: Councillors – surgeries: Councillor Finder – contact details, committee membership, surgeries, list of councillors  As of 2009/10, Cabot had the highest crime rate per resident of any ward in the city, with more than double the offences per head of any other ward."]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Thangam Debbonaire, Bristol West, 2015–present"]}, {"page": "Politics of Bristol", "response": ["|Thangam Debbonaire"]}, {"page": "Gemma Tumelty", "response": ["In 2012 Tumelty was shortlisted to become the Prospective Parliamentary Candidate for the Bristol West constituency, but lost to Thangam Debbonaire despite high-profile backing from senior politicians such as Jon Cruddas and Emily Thornberry."]}, {"page": "List of Sri Lankan Tamils", "response": ["* Thangam Debbonaire - Labour Party MP, born to a mixed Indian-Sri Lankan Tamil father"]}, {"page": "Hotwells", "response": ["Clifton is currently represented by two councillors from the Green Party, and Hotwells and Harbourside by a single Liberal Democrat councillor.Bristol City Council Ward Search The Parliamentary constituency is Bristol West; the MP since 2015 is Thangam Debbonaire of the Labour Party. Prior to Brexit in 2020, Hotwells was represented in the European Parliament by the six MEPs of the South West England constituency."]}, {"page": "Lawrence Hill railway station", "response": ["The station's lack of step-free access to the southbound platform has come under criticism from Bristol West MP Thangam Debbonaire, who noted that due to the time taken to get a train to Stapleton Road and then back to Temple Meads, what should be a five-minute journey could take an hour. Debbonaire stated that step-free access had been promised for some time."]}, {"page": "Official Opposition frontbench", "response": ["| style=\"width: 337px;\" | Thangam Debbonaire", "| colspan=\"2\" |Thangam Debbonaire", "Starmer conducted a post-local election reshuffle from 8 to 9 May, which began with the sacking of Angela Rayner as Party Chair and Campaign Coordinator. However, she successfully negotiated a larger role as Shadow Chancellor of the Duchy of Lancaster and Shadow Secretary of State for the Future of Work. Rosena Allin-Khan, Rachel Reeves and Cat Smith received promotions, alongside Alan Campbell, Shabana Mahmood, Lucy Powell and Wes Streeting who joined the Shadow Cabinet. Allin-Khan and Smith became Secretaries of State for their previous portfolios, and Streeting was given the new position of Shadow Child Poverty Secretary. Anneliese Dodds and Thangam Debbonaire changed roles, but Nick Brown and Valerie Vaz left the opposition front bench. Dodds and Mahmood also replaced Jim McMahon and Jo Stevens as front bench Labour NEC representatives."]}, {"page": "Jeff Smith (British politician)", "response": ["Smith co-founded the Labour Campaign for Drug Policy Reform with Thangam Debbonaire and is Co-Chair of the All-Party Parliamentary Group on Drug Policy Reform. On 20 April 2020, Smith appeared in a virtual online 4/20 event hosted by Voltfacehub, where he spoke in favour of the decriminalisation and regulation of the drug cannabis."]}, {"page": "Debonair", "response": ["* Thangam Debbonaire (born 1966), British politician"]}, {"page": "1966 in the United Kingdom", "response": ["*3 August – Thangam Debbonaire, British Labour politician and MP for Bristol West"]}, {"page": "Westbury Park, Bristol", "response": ["Westbury Park is split between the Parliamentary constituencies of Bristol West and Bristol North West. The MPs for those constituencies are Thangam Debbonaire and Darren Jones respectively. Both are members of the Labour Party."]}, {"page": "List of constituencies in South West England", "response": ["|Thangam Debbonaire‡"]}]}}