{"wiki_id": "http://www.wikidata.org/entity/Q19873642", "itemLabel": "Harold St George Gray", "itemDescription": "British archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_St_George_Gray", "wikipedia_page": {"main": "Harold St George Gray (15 January 1872 – 28 February 1963) was a British archaeologist. He was involved in the Pitt Rivers Museum in Oxford and later was the librarian-curator of the Museum for the Somerset Archaeological and Natural History Society.\nGray was born in 1872 in Lichfield. In 1888 he started working for the archaeologist Augustus Pitt Rivers and trained in archaeological techniques and later took over as his secretary. In 1899 he became assistant to Henry Balfour at the Pitt Rivers Museum before leaving to become curator at the museum in Taunton, which later became the Museum of Somerset, where he stayed until 1949 and wrote frequent papers for their journal. During this time he was involved in the dismissal of Frederick Bligh Bond as archaeologist at Glastonbury Abbey when he claimed that much of his work was helped by the \"spirits of Glastonbury monks\".After leaving Pitt-Rivers he led the excavations at Arbor Low in 1901 and 1902, and then worked on the rings on Bodmin Moor.In 1904 he was involved with Arthur Bulleid in the excavation of Glastonbury Lake Village and later at Meare Lake Village. One of Gray's contributions to archaeology was the scale of the excavations undertaken and the detailed records kept following the teaching of his mentor Pitt-Rivers. He also developed techniques of making three dimensional models of the sites.From 1908 to 1913 he was responsible for excavations at Maumbury Rings, and from 1908 to 1923 at Avebury. His discovery of over forty antler picks at or near the bottom of the henge ditch at Avebury proved that it had been dug out of solid chalk to a depth of 11 m (36 ft) using red deer antlers as picks. In 1922 he excavated Cadbury Camp, and from 1926 to 1929 he was at Windmill Hill, Avebury with  Alexander Keiller.\nIn 1943 he bought the Treasurer's House in Martock to preserve it.  His wife bequeathed it to the National Trust in 1970. Gray was president of the Somerset Archaeological and Natural History Society from 1951 to 1952 and died in 1963.", "link_mentions": {}}}