{"wiki_id": "http://www.wikidata.org/entity/Q19874280", "itemLabel": "Kate Hollern", "itemDescription": "British politician (born 1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kate_Hollern", "wikipedia_page": {"main": "Catherine Malloy Hollern (born 12 April 1955) is a British Labour Party politician serving as Member of Parliament (MP) for Blackburn since 2015. A member of the opposition front bench under the leadership of both Jeremy Corbyn and Keir Starmer, she previously served as the Parliamentary Private Secretary (PPS) to the former from 2017 to 2020, a Shadow Minister for Local Government from 2020 until her resignation in 2021, and briefly a shadow defence minister in 2016. Prior to her election to Parliament, she served as the leader of Blackburn with Darwen Borough Council.", "link_mentions": [{"page": "Hollern", "response": ["* Kate Hollern (born 1955), British Labour Party politician, Member of Parliament (MP) for Blackburn since 2015"]}, {"page": "Blackburn (UK Parliament constituency)", "response": ["Blackburn is a constituency in Lancashire, England, which has been represented in the House of Commons of the UK Parliament since 2015 by Kate Hollern of the Labour Party. From 1979 to 2015, it was represented by Jack Straw who served under the Labour leaders of Neil Kinnock and John Smith and the Labour governments of Tony Blair and Gordon Brown.", "On 25 October 2013, Straw announced that he would stand down as Blackburn's MP at the next election. In March 2014, Kate Hollern was selected, via an all women shortlist, as the candidate for Labour for the 2015 general election, and held the seat.", "| Kate Hollern"]}, {"page": "List of Parliamentary constituencies in Lancashire", "response": ["|Kate Hollern‡"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Kate Hollern, Blackburn, 2015–present"]}, {"page": "Official Opposition frontbench", "response": ["|Kate Hollern", "Shadow Local Government Minister Kate Hollern quit on 13 May after facing allegations of interfering in a sexual harassment complaint. She was replaced by Opposition Whip Jeff Smith in a wider front bench reshuffle on 14 May, which also saw changes including Bambos Charalambous and Holly Lynch switching roles, Mike Amesbury's brief being split with Ruth Cadbury, and Paul Blomfield leaving the front bench. Rachel Hopkins rejoined the front bench as PPS to Shadow Defence Secretary John Healey."]}, {"page": "Jeff Smith (British politician)", "response": ["Smith was appointed as the Shadow Minister for Local Government in the May 2021 Labour reshuffle, filling the position made vacant following Kate Hollern's resignation."]}, {"page": "Justice Select Committee", "response": ["|Kate Hollern MP"]}, {"page": "Parliamentary Under-Secretary of State for the Armed Forces", "response": ["|Kate Hollern (2016)"]}, {"page": "Labour Friends of Palestine and the Middle East", "response": ["|Kate Hollern"]}]}}