{"wiki_id": "http://www.wikidata.org/entity/Q19872187", "itemLabel": "Thomas Cobden", "itemDescription": "architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Cobden", "wikipedia_page": {"main": "Thomas Alfred Cobden (1794 – 1842) was an English architect, best known for designing many buildings in south-east Ireland, such as Cathedral of the Assumption, Carlow, Duckett's Grove and Browne-Clayton Monument.", "link_mentions": [{"page": "St. Patrick's, Carlow College", "response": ["A number of the rooms in the college are named after alumni and people associated with the college such as Cobden Hall named after the architect Thomas Cobden who designed the college building, the John England Room and the Therry Room amongst others.", "* Cobden Hall – former Chapel named after Architect Thomas Cobden."]}, {"page": "Browne-Clayton Monument", "response": ["The Browne-Clayton Monument is the only internally accessible Corinthian column in existence and is thus a unique architectural landmark. It was built of Mount Leinster granite and contains an internal staircase leading to the capital, from which an impressive view of the surrounding countryside can be obtained. Its construction commenced in 1839 and was completed in 1841. The design replicates the monument known as Pompey's Pillar in Alexandria, Egypt, which is approximately six feet lower in height. The Monument was designed by the renowned English architect, Thomas Cobden, who is most famous for the design of the Gothic Revival style Cathedral of the Assumption in Carlow Town as well as the Duckett's Grove near Tullow, County Carlow."]}, {"page": "Carlow", "response": ["Another convent belonging to the Presentation Order of nuns now houses the County Library and the Carlow County Museum. The Cathedral, designed by Thomas Cobden, was the first Catholic cathedral to be built in Ireland after Catholic Emancipation in 1829. Its construction cost £9,000 and was completed in 1833."]}, {"page": "Duckett's Grove", "response": ["Duckett's Grove was built c.1745 on an estate covering more than  of the County Carlow countryside. Originally, the structure was designed as a standard two-storey over-basement Georgian country house. From the mid 1820s, it redesigned in a castellated Gothic revival style by English architect Thomas Cobden for then owner and head of family, John Dawson Duckett."]}, {"page": "Cathedral of the Assumption, Carlow", "response": ["The cathedral is built next door to St. Patrick's, Carlow College, the former seminary of the diocese. Architect Thomas Cobden, designer of much of the adjacent college, designed the cathedral, in the Gothic Revival style. The tower and lantern was inspired by the Belfry of Bruges, Belgium.  The grey-blue stone was from the quarry on the Tullow Road. Colonel Henry Bruen of Oak Park supplied granite from his quarry in Graiguenaspidogue a few kilometres south of Carlow town. He also supplied the Oak for the great-framed roof which came from nearby Oak Park."]}, {"page": "Kilbride, County Wicklow", "response": ["The current 'Manor' house, designed by Thomas Cobden in Tudor Revival style, was under construction when the Valuation House Books were being compiled in 1843. It replaced or incorporated an earlier building, 'Kilbride House' depicted on the 1838 OS maps, possibly built before 1800.  George Moore was living in Kilbride Manor in 1844, when James Frazer noted 'a new mansion and other improvements are in progress'.Fraser, James 1844. A Hand Book for Travellers in Ireland, descriptive of the scenery, towns, seats, antiquities, etc. Dublin. p. 127"]}, {"page": "Cobden, Thomas", "response": ["#redirectThomas Cobden"]}, {"page": "Ballykealy House", "response": ["Ballykealy House, sometimes spelt Ballykealey, was built between 1825 and 1835 for John James Lecky. It is a three story Tudor revival house on a t-shape plan. It was designed by the English architect, Thomas Cobden, who also designed a number of other great houses in County Carlow including Duckett's Grove. The house once sat in an estate of 1,500 acres."]}]}}