{"wiki_id": "http://www.wikidata.org/entity/Q1989569", "itemLabel": "Nigel Moore", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Moore_(racing_driver)", "wikipedia_page": {"main": "Nigel Moore (born 4 January 1992 in Tockwith, England) is a British racing driver.", "link_mentions": [{"page": "Fuji Speedway", "response": ["|  Nigel Moore"]}, {"page": "Shanghai International Circuit", "response": ["| align=\"center\"|  Nigel Moore"]}, {"page": "Karun Chandhok", "response": ["|align=\"left\"|  Philip Hanson Nigel Moore"]}, {"page": "Formula Palmer Audi", "response": ["|  Nigel Moore"]}, {"page": "Autosport BRDC Award", "response": ["| Luciano BachetaTom BlomqvistJack HarveyScott MalvernNigel Moore"]}, {"page": "Britcar", "response": ["| 2016 || Dunlop Endurance || Phil Hanson || Nigel Moore ||  || Tockwith Motorsport || Audi R8 LMS"]}, {"page": "James Winslow", "response": ["|align=\"left\"|  Jakub Śmiechowski Nigel Moore"]}, {"page": "2008 British GT Championship", "response": ["|  Nigel MooreRD7: Team Trimite Pairing Take Second Wet Victory, British GT Championship.", "|  Nigel Moore", "|  Joe Osbourne Nigel Moore", "|  Nigel Moore", "|align=left|  Nigel Moore"]}, {"page": "2009 24 Hours of Le Mans", "response": ["|rowspan=2|  Lawrence Tomlinson Richard Dean Nigel Moore"]}, {"page": "List of 2008 motorsport champions", "response": ["|  Nigel Moore"]}, {"page": "Asian Le Mans Series", "response": ["|  Nigel Moore Phil Hanson"]}, {"page": "2009 British GT Championship", "response": ["|  Nigel Moore", "|align=left|  Nigel Moore"]}, {"page": "2010 Formula Palmer Audi season", "response": ["The scholarship prize went to Nigel Moore, as he overhauled the long-time leader of the championship Maxime Jousse on dropped scores; Jousse having scored four more points than Moore on overall scores. Whereas Moore could drop two retirements for no points loss, Jousse had to drop a finish of seventh place along with a retirement and turned a four-point advantage into a nine-point deficit to Moore, having won six races to Moore's three. Third place went to Spanish driver Ramón Piñeiro, having taken four wins in the last seven races of the season to enable him to move him up from sixth to his eventual placing of third. Kieran Vernon and José Alonso Liste battled over fourth place, with Vernon coming out on top by two points after his third win of the season – to go with his double at the second Brands Hatch meeting – in the series' final race at Silverstone, ahead of Alonso Liste. Other winners during the season were Melroy Heemskerk at the first Brands Hatch meeting, Max Snegirev at Croft and Jordan Williams, who won at Snetterton before an accident with Jousse in the next race left him without funds to complete the season.", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "| align=\"left\" |  Nigel Moore"]}, {"page": "List of 2010 motorsport champions", "response": ["|  Nigel Moore"]}, {"page": "Ginetta GT4 Supercup", "response": ["|  Nigel Moore"]}, {"page": "Ginetta Junior Championship", "response": ["|  Nigel Moore Hepworth International", "| Nigel Moore"]}, {"page": "2010 Ginetta G50 Cup", "response": ["Outside the top five, Wrathall's Dynojet team-mate Adam Morgan took the other overall victory to be claimed during the season – at Croft – while Matt Bell took a class win at Thruxton for United Autosports. Nine wins were taken by guest drivers during the season; Nigel Moore claimed five victories in eleven starts for Tockwith, Jonathan Adam won a race at his home circuit of Knockhill in the Ginetta Cars entry, denoted as the \"guest car\", while Rob Huff took a hat-trick of victories at the opening round at Thruxton when the guest car was run by Dynojet for one event only.", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|align=left|  Nigel Moore"]}, {"page": "2009 GT4 European Cup", "response": ["|  Nigel Moore", "|  Nigel Moore"]}, {"page": "Lawrence Tomlinson", "response": ["|align=\"left\"|  Richard Dean Nigel Moore", "|align=\"left\"|  Richard Dean Nigel Moore", "|align=\"left\"|  Stewart Linn Mike Simpson Nigel Moore"]}, {"page": "Formula Kart Stars", "response": ["Calado became MSA British Cadet Champion against a strong field that included Adam Christodoulou, Daniel Rowbottom, Jordan Oakes, Henry Surtees, Alex Brundle, Lewis Williamson, Richard Bradley and Nigel Moore. Christodoulou and Oakes claimed second and third places overall", "Adam Christodoulou retained his Mini Max title against drivers such as Nigel Moore, Surtees and Stoneman with the class continuing to grow as karting in general began leading more and more towards Rotax and away from the more traditional classes. This was evidenced by the absence of a JICA grid and a full grid of Junior Rotax karts, which were led once again by Christodoulou who made history by becoming the first driver in series history to win two different classes in the same year.", "Jimmy Galloway won the MSA Cadet title despite stiff competition from Rowland, Harvey and Goff to name but a few. In Mini Max Stevens took championship honours in a class that also included Nigel Moore and Stoneman while Adam Christodoulou continued his winning ways with a successful defence of his Junior Rotax title in a class that also included Hamilton, Daniel Rowbottom, Dean Smith and Surtees. Christodoulou was excluded from the championship in late 2004, for illegal tampering of tyres with performance enhancing additives, handing the title to Rowbottom, Christodoulou was later reinstated as champion after an appeal. Although a lot of controversy followed as Christodolou was banned from the sport for illegal engines during the 2004 series, although too much time had passed to strip the title for the second time.", "Nigel Moore beat a small but select JICA field that also included Matt Bell, Jordan Lennox-Lamb, Alice Powell, Will Stevens, Scott Jenkins and Oliver Rowland.", "Like Jenkins, Nigel Moore made a successful defence of his JICA crown against strong opposition from Stevens, Rowland, Scott Jenkins, Lennox-Lamb, Powell, Jack Harvey and Cristofaro while Stoneman won the Super ICC class.", "| 2005 || JICA || Nigel Moore", "| 2006 || JICA || Nigel Moore"]}, {"page": "2008 Ginetta G50 Cup", "response": ["Nigel Moore dominated the first year of the series, winning 14 races and finishing the season over 200 points ahead of runner up Frank Wrathall.", "|rowspan=2|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|  Nigel Moore", "|align=left|  Nigel Moore"]}, {"page": "2007 Ginetta Junior Championship", "response": ["| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "| Nigel Moore", "|align=left| Nigel Moore"]}, {"page": "Jody Firth", "response": ["Firth returned to the cockpit in April 2009, partnering Nigel Moore in the British GT Championship, driving for Team WFR in a GT4-class Ginetta G50. However, his first professional race since 2005 actually came in the Ginetta G50 Cup season opener at the Brands Hatch Indy Circuit, driving for Hepworth International, with his best finish of the weekend being a fifth place in the second race. His first race in the British GT was the 2009 season's opening event, held at Oulton Park, where he and Moore finished eighth in race one, and ninth in race two, taking the GT4 class victory in both races. He and Moore were then entered in the Silverstone round of the GT4 European Cup, taking a victory in race one, before retiring in race two. Moore and Firth entered all eight rounds of the British GT Championship in 2009, with their best overall finish being seventh. The pair were GT4 class champions for that year, taking eleven class victories in total. During the season, Firth also entered two rounds of the MR2 Racing Series, driving a first-generation Toyota MR-2 prepared by Matthew Coggins.He qualified on pole, and won one of the two races he entered, taking the fastest lap. He also drove for Team WFR alongside Warren Hughes and Darren Manning in the 1000 km of Silverstone, part of the Le Mans Series, entering an Embassy WF01-Zytek in the LMP2 category, and finished fourth in class."]}, {"page": "2016 European Le Mans Series", "response": ["|  Nigel Moore"]}, {"page": "2016 GT3 Le Mans Cup", "response": ["|  Nigel Moore"]}, {"page": "2016–17 Asian Le Mans Series", "response": ["|  Nigel Moore", "|  Philip Hanson Nigel Moore", "|  Philip Hanson Nigel Moore", "|align=left|  Nigel Moore"]}, {"page": "2017 24 Hours of Le Mans", "response": ["| rowspan=2 |  Philip Hanson Nigel Moore Karun Chandhok"]}, {"page": "2017 European Le Mans Series", "response": ["|  Nigel Moore"]}, {"page": "Ligier JS P217", "response": ["| Nigel Moore", "| Nigel Moore"]}, {"page": "Nigel Moore", "response": ["Nigel Moore may refer to:", "* Nigel Moore (racing driver) (born 1992), British racing driver", "* Nigel Moore (cricketer) (1930–2003), English cricketer", "* Nigel Moore (basketball) (born 1981), American basketball player"]}, {"page": "List of 2017 motorsport champions", "response": ["| LMP3:  Philip Hanson  LMP3:  Nigel Moore"]}, {"page": "2017–18 Asian Le Mans Series", "response": ["|  Nigel Moore"]}, {"page": "2016 British LMP3 Cup", "response": ["The 2016 Prototype Cup (later renamed the LMP3 Cup Championship) was the inaugural event for the British LMP3 Cup. The series debuted at Snetterton Circuit on 8/9 October 2016, with a single race to launch the championship, which was won by Tockwith Motorsport's Phil Hanson and Nigel Moore.", "Phil Hanson and Nigel Moore set the early pace in qualifying, setting a quick lap around three seconds ahead of the rest of the field. Christian England and Colin Noble followed up for Team West-Tec, 0.8s behind, with Shaun Lynn third for United Autosports.", "| 1 ||  Tockwith Motorsport ||  Phil Hanson   Nigel Moore || Ligier JS P3 || Nissan VK50VE || 1:45.659", "| 1 ||  Tockwith Motorsport ||  Phil Hanson   Nigel Moore || Ligier JS P3 || Nissan VK50VE || 31 laps"]}, {"page": "2016 Road to Le Mans", "response": ["| rowspan=2 |  Philip Hanson Nigel Moore"]}, {"page": "2017 6 Hours of Spa-Francorchamps", "response": ["| rowspan=2 |  Nigel Moore Philip Hanson Karun Chandhok"]}, {"page": "2017 6 Hours of Nürburgring", "response": ["| rowspan=2 |  Nigel Moore Philip Hanson"]}, {"page": "Philip Hanson (racing driver)", "response": ["2016 saw Phil, aged 17 at the time, race in his inaugural endurance racing season, joining the Tockwith Motorsports team for the Asian Le Mans Series. Alongside driver Nigel Moore, the pair were the only consistent two-driver crew of the season, resulting in the duo claiming the Driver’s Championship in the LMP3 class, driving in the #26 Ligier JSP3.", "In June 2017, Phil become the youngest overall finisher in his Le Mans 24 Hour debut, finishing 9th in the LMP2 class and 11th overall in the twice-around-the-clock race. Phil was partnered by Nigel Moore and Karun Chandhok, racing a Ligier-Gibson JSP217.", "|align=\"left\"|  Nigel Moore Karun Chandhok"]}, {"page": "2018–19 Asian Le Mans Series", "response": ["|  Nigel Moore"]}, {"page": "2019 24 Hours of Le Mans", "response": ["| rowspan=2 |  Jakub Śmiechowski James Winslow Nigel Moore"]}, {"page": "2019 European Le Mans Series", "response": ["|  Nigel Moore", "|  Martin Hippe Nigel Moore"]}, {"page": "Bradley Philpot", "response": ["In January, Philpot entered into the Peugeot 208 GTi Racing Experience, with the winner gaining factory driver status at Peugeot Sport for their entry into the 2013 VLN series and 24 Hours Nürburgring.Telegraph | Peugeot 208 GTi Racing Experience Beating compatriots David Pittard,David Pittard | 2013 Review Nigel Moore (racing driver) and Tom Ingram, Philpot was chosen ahead of the other finalists.Peugeot Media Suite | Philpot Represents Peugeot UK"]}]}}