{"wiki_id": "http://www.wikidata.org/entity/Q1986211", "itemLabel": "Paul Banks", "itemDescription": "Interpol member", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Banks_(American_musician)", "wikipedia_page": {"main": "Paul Julian Banks (born 3 May 1978) is an American–British musician, singer, songwriter, and DJ. He is best known as the lead vocalist, lyricist, and guitarist of the rock band Interpol. He released a solo album called Julian Plenti is... Skyscraper in 2009 under the name Julian Plenti, though his solo material is now recorded under his real name. As a singer, his voice lies in the baritone range.", "link_mentions": [{"page": "The Boo Radleys", "response": ["The Boo Radleys are an English alternative rock band who were associated with the shoegazing and Britpop movements in the 1990s. They originally formed in Wallasey, England in 1988, with Rob Harrison on drums, singer/guitarist Simon \"Sice\" Rowbottom, guitarist/songwriter Martin Carr, and bassist Timothy Brown. Their name is taken from the character Boo Radley in Harper Lee's 1960 novel, To Kill a Mockingbird. Shortly after the release of their first album Ichabod and I, Steve Hewitt replaced Robert Harrison on drums and was in turn replaced by Rob Cieka. The band split up in 1999. In their 11-year-long career, the band had one top ten single, the 1995 single \"Wake Up Boo!\", which charted at no. 9; and a number one album, Wake Up!. The band reunited in 2021, without original guitarist Martin Carr, and released a single, \"A Full Syringe and Memories of You,\" their first new music since 1998. Paul Banks of Interpol has cited the band as an influence."]}, {"page": "Interpol (band)", "response": ["Interpol is an American rock band from Manhattan, New York. Formed in 1997, their original line-up consisted of Paul Banks (lead vocals, rhythm guitar), Daniel Kessler (lead guitar, backing vocals), Carlos Dengler (bass guitar, keyboards), and Greg Drudy (drums). Drudy left the band in 2000 and was replaced by Sam Fogarino. Dengler left to pursue other projects in 2010, with Banks taking on the additional role of bassist instead of hiring a new one.", "After the band's appearance at Reading and Leeds in 2011, Fogarino was interviewed. He said, \"[w]e need a big break. Interpol needs it. We need to recoup and go on a proper hiatus.\" He stated that the remaining members of the band would be pursuing separate projects, one of which included a second solo album by Paul Banks. A deluxe edition of the band's first album, Turn on the Bright Lights was released on December 4, 2012, to mark the album's ten-year anniversary. It includes previously hard-to-find tracks, including \"Get The Girls\" and \"Cubed\".", "The band announced on June 5, 2014 that their fifth studio album, entitled El Pintor, would be released on September 9, 2014. This album's name was derived as an anagram by Paul Banks who created the name while thinking of new design concepts for merchandise.Daly, Rhian. \"Albums of the Year: 49 - Interpol: \"El Pintor\".\" NME - New Musical Express November 29, 2014: 27. ProQuest. Web. February 15, 2016 It was the band's first album since the departure of bassist Carlos Dengler, with Paul Banks taking over bass duties for the first time as well as touring member Brandon Curtis taking over keyboard duties on nine of the ten album tracks.", "In September 2016, Paul Banks revealed in an interview on Beats 1 that Interpol would resume writing in the fall.  In January 2017, Interpol announced that their sixth album would be out in 2018 and that they would embark on a tour for Turn On the Bright Lights'  15th anniversary, playing the entire album front to back. In between the tour and announcement of the new album, they released an EP consisting of bonus tracks from El Pintor. The tracks included were \"The Depths\", \"Malfeasance\", and \"What Is What\".", "On January 30, 2019, Interpol released \"Fine Mess\", a song that was left off of Marauder, as a single. On March 28, the band announced a new EP, A Fine Mess, consisting of songs from the Marauder sessions that didn't make the final cut, with a release date of May 17, 2019. On the same day, they released the second single off the EP, \"The Weekend\". On August 16, 2019, Our Love to Admire became unavailable on streaming platforms which caused some panic among fans. Lead singer Paul Banks quickly addressed the issue by reassuring fans via Twitter that the album would be returned to streaming platforms. On December 10, 2020, it was announced that Matador Records had finally acquired the rights to Interpol's entire catalog.", "In 2016, Paul Banks released an album alongside Wu-Tang Clan member RZA under the name Banks & Steelz. The album, titled Anything But Words, was released on August 26, 2016 through Warner Bros. Records.", "In 2020, Paul Banks announced a new side project by the name of Muzz. The band also consists of Josh Kaufman and Matt Barrick. Their self-titled debut LP, Muzz was released on June 5, 2020 through Matador Records.", "*Paul Banks lead vocals, rhythm guitar (1997–present), bass guitar (2014–present)"]}, {"page": "Antics (album)", "response": ["In a 2018 interview with Vice, lead singer Paul Banks listed Antics as his favorite of the band's albums, saying: \"I really put a lot of blood, sweat, and tears onto this record\" and that \"it felt like a very righteous pursuit\". Banks also claimed that their confidence in the album's quality acted as \"the perfect antidote to that sophomore slump\" and the group circumvented the pressure and was able to \"dive straight back in\".", "# \"Narc [Paul Banks Remix]\" – 2:39", "# \"Narc [Paul Banks Remix]\" – 2:39", "* Paul Banks – lead vocals, rhythm guitar"]}, {"page": "Turn On the Bright Lights", "response": ["In a brief interview about the fifteenth anniversary of Turn On the Bright Lights, guitarist Daniel Kessler stated the album's opening track, \"Untitled\" was written specifically to open the band's live shows. This leads into why the song is named \"Untitled\" because the band see the song as the intro song. Lead singer Paul Banks described the riff from the song as \"signature Daniel\".", "Turn On the Bright Lights was released to critical acclaim. The album holds a score of 81 out of 100 from the aggregate site Metacritic based on 21 reviews, indicating \"universal acclaim\". Contemporary reviews of the album often noted Interpol's influences and drew comparisons to several other acts. Michael Chamy of The Austin Chronicle cited \"melodic Peter Hook-like basslines; the divine shoegazer textures of My Bloody Valentine and Ride; a peppy, Strokes-like bounce; and a singer who's a dead ringer for Ian Curtis.\" \"It's almost as if Ian Curtis never hanged himself,\" began Blenders review, with critic Jonah Weiner adding that Paul Banks' vocals channeled Curtis' \"gloomy moan.\" NMEs Victoria Segal called Joy Division comparisons \"obvious and unmistakable, airbourne in the ashen atmospherics,\" while praising Interpol's take on the \"grey-skinned British past\". Billboard wrote that Interpol had created an \"homage to their particular vision of the '80s that stands proudly alongside the best of its idols.\" Scott Seward, writing in The Village Voice, remarked: \"If I like them because they remind me of eating bad bathtub mescaline in the woods and listening to Cure singles, well, that'll do. You might like them for completely different reasons.\"", "In a 2018 interview with Vice, Paul Banks listed Turn on the Bright Lights as his second favorite of the band's albums. He stated: \"as far as ease of making it, we had years to write these songs. The longest writing period of any of your records is your debut. We formed in 1997, so it’s five years, and three-and-a-half/four of playing shows and trying out that material. So it went down smoothly in the studio, and then you have all the excitement of it being your first album. It was a good time in our lives.\" Drummer Sam Fogarino reflected on the album by saying: \"we were very naïve, we didn’t know how to make a record together, and we were lucky to have a good snapshot taken of who we were at the time. And we got a little more confident with every record.\"", "*Paul Banks – lead vocals, rhythm guitar"]}, {"page": "Precipitate (EP)", "response": ["* Paul Banks – lead vocals, rhythm guitar"]}, {"page": "Daniel Kessler (guitarist)", "response": ["It was Kessler's desire to play in a real band which made him approach Carlos Dengler, with whom he attended a history class in New York University. Kessler knew lead singer Paul Banks from a summer program in Paris, France, and asked him to join the band when he ran into him in New York. Kessler's dormmate Greg Drudy was Interpol's first drummer. When Drudy left the band, Kessler asked his friend Sam Fogarino to replace him. "]}, {"page": "The Black EP", "response": ["*Paul Banks – vocals, guitar"]}, {"page": "The Chameleons", "response": ["The Chameleons  have inspired the likes of Oasis, the Verve, the Flaming Lips and Interpol. Oasis's songwriter Noel Gallagher has expressed his liking for the album Strange Times saying, \"It must have influenced my early years as a song writer because I can hear me in it everywhere!\". Guitarist Nick McCabe of the Verve named Script Of The Bridge as one of his ten favorite albums.Clay, Joe.\"Nick McCabe Of Black Submarine's Favourite LPs\". Thequietus. 11 March 2014. Retrieved 6 July 2021. The Flaming Lips included \"Up the Down Escalator\" in the track listing of a CD compilation they did for Late Night Tales. The band have also been cited by the Charlatans's singer Tim Burgess. Moby has been quoted expressing admiration for their work.Gitlin, Lauren. \"Moby Opens New “Hotel”\". Rollingstone.com. 14 March 2005. Retrieved 6 July 2021. Interpol's frontman Paul Banks has said that their bassist Carlos [Dengler] was \"a fan\" of the band.Mouton, Olivier. \"Les fantômes new wave d'Interpol\". Lalibre.be. 18 April 2003. Retrieved 6 July 2021."]}, {"page": "Fukd ID 3", "response": ["* Paul Banks – lead vocals, rhythm guitar"]}, {"page": "Evil (Interpol song)", "response": ["Category:Songs written by Paul Banks (American musician)"]}, {"page": "Interpol (EP)", "response": ["* Paul Banks – lead vocals, rhythm guitar"]}, {"page": "Interpol Remix", "response": ["Interpol Remix is the first remix EP by American rock band Interpol. It consists of four tracks from their second album Antics, each remixed by a member of the band: \"NARC,\" \"Length of Love,\" \"Public Pervert,\" and \"Not Even Jail,\" as remixed by Paul Banks, Sam Fogarino, Carlos Dengler, and Daniel Kessler, respectively.", "#\"NARC (Paul Banks remix)\" – 2:37"]}, {"page": "Obstacle 1", "response": ["Category:Songs written by Paul Banks (American musician)"]}, {"page": "Slow Hands (Interpol song)", "response": ["\"Slow Hands\" is a song by American indie rock band Interpol. It was released as the lead single from their second studio album, Antics (2004), on August 16, 2004 as a digital single and September 13 as vinyl and CD singles. The song was written by Paul Banks, Carlos Dengler, Sam Fogarino, and Daniel Kessler.", "Category:Songs written by Paul Banks (American musician)"]}, {"page": "Brandon Curtis", "response": ["In June 2010, Curtis joined the touring lineup of Interpol, on keyboards and vocals. In 2012, Brandon joined Interpol front man Paul Banks' live band, and he contributed to Banks' 2012 EP entitled \"Julian Plenti Lives...\".", "On October 30, 2013, Curtis' new band Cosmicide released a new song entitled \"Talos' Corpse\" and announced a few US tour dates. \"Talos' Corpse\" was written/produced by Brandon Curtis and mixed by Claudius Mittendorfer, who has previously worked with Paul Banks, Johnny Marr, Kaiser Chiefs, and more."]}, {"page": "C'mere", "response": ["#\"Narc\" (Paul Banks remix) – 2:37", "#\"Narc\" (Paul Banks remix) – 2:37", "Category:Songs written by Paul Banks (American musician)"]}, {"page": "Our Love to Admire", "response": ["In a 2018 interview with Vice, lead singer Paul Banks listed Our Love to Admire as his least favorite of the band's albums. Banks had just gotten sober and the pressure of working with a major label ultimately resulted in a \"stressful\" and \"unpleasant\" experience that was also \"way too much work\". The group had similar issues with the production of their fourth album Interpol, but said that the group was \"proud of the music\" on both, with Banks saying: \"some of my favorite songs we ever wrote are on these two records, so it's not like the situation was bad and the record is bad.\"https://www.vice.com/en_us/article/a3q9mk/rank-your-records-interpol-paul-banks Drummer Sam Fogarino also cited issues with the new label during the album's production, claiming that the band felt welcome at first, but once the label was sold, that changed: \"We're a number now, we're a number on a data print out.\"https://www.phoenixnewtimes.com/music/interpols-sam-fogarino-talks-carlos-d-record-labels-and-whats-next-for-the-band-6601485 Following the album's release, Interpol returned to Matador.", "Paul Banks recalled to Vice that it was the hardest the band had ever worked on a record, claiming that the band spent \"months in the studio\", which is quite common for major labels, but the group had never recorded an album in such a traditional fashion. Banks further added: \"I at one point worked 88 out of 90 days in the studio for that record\" for vocals alone, and that \"it took me 88 days to do then I could do in five days now\". In 2010, Sam Fogarino recalled to LA Weekly that the band made the choice to go with a major label because they wanted to expand their fanbase. Fogarino stated: \"At that point, I had more of the impression that many more artists of our ilk were on majors. They had sort of used the system and started someplace and gone somewhere else because they thought they'd be better… you know, to have more options of exposure and getting a larger fan base. There were a lot of bands in that situation. For us, I don't think we thought it was that out of sync. It was pretty good common sense to try and expand.\"https://www.laweekly.com/exclusive-interpol-interview-paul-banks-on-rebooting-the-interpol-franchise-life-after-carlos-and-clarifying-his-feelings-about-women-and-drugs/ The band ended their two-album contract after recording one album and left Capitol \"amicably\", returning to Matador. Fogarino said: \"It was great that Capitol let us go on a handshake. There was no litigation filed, and nothing ugly about it. It was a good lesson learned at the end of the day.\"https://thevarsity.ca/2010/09/07/the-varsity-interview-sam-fogarino/", "On August 16, 2019, Our Love to Admire became unavailable on streaming platforms which caused some panic among fans. Paul Banks quickly addressed the issue by reassuring fans via Twitter that the album would be returned to streaming platforms. It was speculated that the removal of the album was due to licensing issues between Matador and Capitol. On December 10, 2020, it was announced that Matador had finally acquired Interpol's entire catalog rights, including Our Love to Admire.https://www.billboard.com/articles/business/9497186/deals-matador-interpol-pavement-sony-masterworks-broadway", "* Paul Banks – lead vocals, rhythm guitar"]}, {"page": "Paul Banks (English musician)", "response": ["Paul Banks formed his first band with schoolfriend Rick Witter in 1986, while still in his teens, and went on to play in other local bands, including Brockley Haven, with Witter, Tom Gladwin and John Leach."]}, {"page": "The Heinrich Maneuver", "response": ["Category:Songs written by Paul Banks (American musician)"]}, {"page": "Say Hello to the Angels / NYC", "response": ["Category:Songs written by Paul Banks (American musician)"]}, {"page": "Mammoth (Interpol song)", "response": ["Category:Songs written by Paul Banks (American musician)"]}, {"page": "Interpol: Live in Astoria EP", "response": ["*Paul Banks – lead vocals, guitar"]}, {"page": "Julian Plenti", "response": ["#REDIRECT Paul Banks (American musician) "]}, {"page": "Julian Plenty", "response": ["#REDIRECT Paul Banks (American musician) "]}, {"page": "Interpol discography", "response": ["The discography of American rock band Interpol consists of six studio albums, seven extended plays (EPs), and fifteen singles. Interpol was formed in 1997 by New York University students Daniel Kessler and Greg Drudy, with Carlos Dengler and Paul Banks joining later. Drudy left the band in 2000, and was replaced with Sam Fogarino.", "| Paul Banks, Sophia Peer", "| Paul Banks", "| Paul Banks, Carlos Pugahttps://www.youtube.com/watch?v=Aw90St_8ek0"]}, {"page": "Peter Katis", "response": ["Katis also has a long-standing relationship with Interpol. He recorded and mixed the band's critically acclaimed debut album Turn on the Bright Lights (2002), followed by Antics (2004). He also worked with lead singer Paul Banks on Julian Plenti is... Skyscraper (2009), Julian Plenti Lives... (2012), and Banks (2012).", "|Paul Banks", "|Paul Banks", "|Paul Banks / Julian Plenti"]}, {"page": "Interpol (album)", "response": ["Interpol was released to lukewarm critical reception, with some critics negatively comparing it to their prior albums. In a 2018 interview with Vice, lead singer Paul Banks claimed that tensions within the band, particularly regarding Dengler's departure, made the album \"hard and unpleasant to make\" and that \"we suffered for this record a lot\". However, despite its rocky production, the group was ultimately happy with the album. Banks claimed that \"what ultimately wound up on that record is some of our best stuff\", specifically citing \"Lights\" and \"The Undoing\" as two of the band's best songs yet.https://www.vice.com/en_us/article/a3q9mk/rank-your-records-interpol-paul-banks", "After Interpol's contract with Matador expired in 2006, the band signed on with Capitol Records. According to drummer Sam Fogarino, the group chose to go with a major label because they liked the staff at Capitol and hoped to get more exposure. The band was happy with the decision at first, but the label was sold shortly after they began recording their new album and the staff that they were working with was fired. This, coupled with the confusion of ever-changing staff and the exhaustive months that were spent meticulously recording the album, the group decided to amicably terminate their two-album deal and return to Matador after one record.https://www.sacurrent.com/sanantonio/q-and-a-with-interpols-sam-fogarino/Content?oid=2290638 Recording on Interpol started at Electric Lady Studios in early spring of 2009. The band announced that they were writing new songs in March of that year. Interpol was produced by the band, engineered by Greg Calbi and Claudius Mittendorfer, and mixed by Alan Moulder. Rapper Azealia Banks guested on backing vocals on \"Memory Serves\". Paul Banks told Vice that they chose to self-title the album because \"there’s something laid bare about it, like, 'This is us and this is who we are.' I was never aware that there was a precedent that debut records were supposed to be self-titled. I was just like, 'It feels good to make this one self-titled.'”", "Interpol received a weighted score of 66 out of 100 from review aggregate website Metacritic, indicating \"generally favourable reviews\", based on 22 reviews from music critics AnyDecentMusic? shows a rating of 6.3 based on 33 reviews. Victoria Segal of Q awarded the album 4 out of 5 stars, stating that \"Paul Banks's vocals [are] as attention-grabbing as a hand on the back of the neck while subtle textures rub up against the drama of the guitars\", and concluded by saying that \"for a band who specialise in the dark, their touch is thankfully light\". Chris Coplan from Consequence of Sound gave the album 4 stars out of 5, praising the \"rich narrative\" and \"brilliant pacing found throughout the record\", and describing it as \"a story that builds from an emotionally-resilient semi-joyousness in the beginning [...] to creepy, morose, and sinister by the end\".", "* Paul Banks – lead vocals, rhythm guitar"]}, {"page": "Barricade (song)", "response": ["On August 28, the music video was released via the band's Facebook page. It was filmed at Floyd Bennett Airfield in Brooklyn, and directed by Moh Azima. It consists of Daniel Kessler and Sam Fogarino playing in front of mirrors, while Paul Banks sings in front of a projector.", "Category:Songs written by Paul Banks (American musician)"]}, {"page": "Cancer 4 Cure", "response": ["* Paul Banks – vocals (3)"]}, {"page": "Paul Banks", "response": ["Paul Banks may refer to:", "*Paul Banks (American musician) (born 1978), lead singer of New York City-based band Interpol", "*Paul Banks (English musician) (born 1973), lead guitarist of band Shed Seven, also with the Riding and Albion", "*Paul Banks and Carolyn Harris Preservation Award, by the Association for Library Collections and Technical Services (ALCTS)"]}, {"page": "El Pintor", "response": ["Self-produced by the band and recorded at Electric Lady Studios and Atomic Sound in New York City, the album was engineered by James Brown (known for his work for Foo Fighters) and mixed by Alan Moulder (known for his production and mixing work for My Bloody Valentine, Swervedriver, the Smashing Pumpkins and Nine Inch Nails). The bass duties on the album were taken over by frontman Paul Banks. The album features guest appearances by Brandon Curtis (Secret Machines), Roger Joseph Manning Jr. (Jellyfish) and Rob Moose (Bon Iver).", "*Paul Banks vocals, rhythm guitar, bass guitar, production"]}, {"page": "All the Rage Back Home", "response": ["The music video for \"All the Rage Back Home\", co-directed by Sophia Peer and the band's lead singer, Paul Banks, was released on July 9, 2014. It shows the band performing the song in a dark room intercut with footage of surfers challenging waves. The black-and-white video also features Banks on bass guitar, which he occasionally performed with since the departure of bassist Carlos Dengler in 2010.", "*Paul Banks vocals, guitar, bass guitar, production", "Category:Songs written by Paul Banks (American musician)"]}, {"page": "Josh Kaufman (musician)", "response": ["Kaufman moved to Brooklyn after university and worked as barista while playing in various musical projects performing originals and covers. He reunited with Paul Banks for an acoustic duo just as Interpol were gaining popularity and the garage rock revival was emerging. Meanwhile, Kaufman's friendship with the songwriter Benji Cossa resulted in a stint working at a SoHo printing press. This brought him a steady income while allowing flexibility for the growing amount of touring, production and arranging work that he was doing for artists such as Dawn Landes, Josh Ritter and The National.", "On March 6, 2020, it was announced that Kaufman would be joining Paul Banks and Matt Barrick to form a new band, Muzz. The band also released their first single, \"Bad Feeling.\""]}, {"page": "List of musical supergroups", "response": ["* Paul Banks (Interpol)"]}, {"page": "Banks & Steelz", "response": ["Banks & Steelz is a musical collaboration between Interpol frontman Paul Banks and Wu-Tang Clan rapper RZA. The duo began making music together in 2011 and began recording a full album in 2013. They released their debut studio album, Anything But Words, on August 26, 2016."]}, {"page": "Everything Is Wrong (song)", "response": ["The official music video for \"Everything Is Wrong\" was released on January 22, 2015. It was co-directed by Carlos Puga and Interpol frontman Paul Banks. The video is centered on band members Banks, Daniel Kessler and Sam Fogarino as they walk throughout New York City on their way to a concert they will be playing at. While it shows Kessler and Fogarino acting nice towards other people, Banks is depicted as a more rude person who bothers others. Tom Breihan of Stereogum labeled Banks as \"basically a Jeremy Renner character\" in the video.", "Category:Songs written by Paul Banks (American musician)"]}, {"page": "Marauder (Interpol album)", "response": ["Interpol singer and guitarist Paul Banks revealed in a September 2016 Beats 1 interview that the band would resume writing music in the fall of 2016. They later began holding rehearsal sessions in October. In January 2017, they officially announced that their sixth studio album would be released in 2018 on Matador Records. They took a break from recording the album later in the year so they could commence the anniversary tour for their 2002 debut album, Turn on the Bright Lights. The tour lasted from August to October 2017. They resumed work on the album afterward. In May 2018, it was revealed by the band that the album was in its mastering stage.", "*Paul Banks – vocals, bass guitar, rhythm guitar"]}, {"page": "The Rover (Interpol song)", "response": ["The official music video for \"The Rover\" was released on July 11, 2018. The music video was directed by Gerardo Naranjo with assistance from Ebon Moss-Bachrach, Paul Banks, Daniel Kessler, Sam Fogarino, Samantha Menchaca, Fermin Diaz, Diego Gamaliel, and Romina Soriano.", "Erin Vanderhoof of Vanity Fair described the music video as a \"political love letter to Mexico City\". Vanderhoof specifically referenced Interpol frontman, Paul Banks, deciding to film the music video in Mexico City and living his teenage years there. In describing the video and sights, Banks told  Vanity Fair \"I think someone that I went to school with did college radio there. When we took off, he said, ‘They’re from here, in a sense, they’re one of ours'. If they like you, they put their heart into you, their enthusiasm. It’s a special market in that sense.\"", "Category:Songs written by Paul Banks (American musician)"]}, {"page": "PDA (Interpol song)", "response": ["Category:Songs written by Paul Banks (American musician)"]}, {"page": "Paul Banks (musician, born 1978)", "response": ["#REDIRECT Paul Banks (American musician)"]}]}}