{"wiki_id": "http://www.wikidata.org/entity/Q19882263", "itemLabel": "Richard Arkless", "itemDescription": "Scottish politician (born 1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Arkless", "wikipedia_page": {"main": "Richard Lambert Thomas Arkless (born 7 July 1975) is a  Scottish National Party politician, who was elected as MP for Dumfries and Galloway at the 2015 UK general election. He lost his seat at the following election in 2017.", "link_mentions": [{"page": "1975", "response": ["** Richard Arkless, Scottish politician"]}, {"page": "Russell Brown (British politician)", "response": ["Russell Leslie Brown (born 17 September 1951) is a Scottish Labour Party politician. He is a former Member of Parliament (MP) for Dumfriesshire (1997–2005) and Dumfries and Galloway (2005–2015). He lost his seat at the 2015 general election to Richard Arkless of the Scottish National Party.", "Brown lost his seat at the 2015 general election, finishing in third place with 13,982 votes behind the Scottish Conservatives' Finlay Carson with 16,926 votes and the winner: SNP's Richard Arkless with 23,440 votes."]}, {"page": "List of United Kingdom MPs: A", "response": ["*Richard Arkless"]}, {"page": "Dumfries and Galloway (UK Parliament constituency)", "response": ["* The SNP's share of the vote in the constituency collapsed at the 2005 general election, and remained static in 2010. In 2015, the seat was won by the SNP's Richard Arkless with a 6,514 vote majority. The Conservative share of the vote stayed similar to the 2010 election, whereas Labour polled third, receiving 24.7% of the vote compared to 45.9% in 2010.", "| Richard Arkless"]}, {"page": "David Mundell", "response": ["In 2015, Mundell opened a food bank in the Dumfries and Galloway constituency, which adjoins his own and was at the time represented by the Scottish National Party's Richard Arkless. After the opening, Mundell was escorted from an angry anti-austerity demonstration by police. Mundell, who had previously denied that welfare reform changes were behind the increased demand for food banks, was accused of hypocrisy by opponents who said the opening was \"nothing to celebrate\".  Mundell said he was willing to work with all local organisations who wanted to eradicate poverty."]}, {"page": "Scottish Westminster constituencies from 2005", "response": ["|Richard Arkless"]}, {"page": "List of Scottish National Party MPs", "response": ["|data-sort-value=\"Arkless, Richard\"| Richard Arkless"]}, {"page": "Stranraer Academy", "response": ["*Richard Arkless, SNP Former Member of Parliament for Dumfries and Galloway"]}, {"page": "Justice Select Committee", "response": ["|Richard Arkless (SNP)"]}, {"page": "List of MPs for constituencies in Scotland (2015–2017)", "response": ["|Richard Arkless"]}, {"page": "List of MPs who lost their seat in the 2015 United Kingdom general election", "response": ["|data-sort-value=\"Arkless, Ricahrd\"|Richard Arkless"]}]}}