{"wiki_id": "http://www.wikidata.org/entity/Q19959642", "itemLabel": "Alastair Graham", "itemDescription": "British malacologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Alastair_Graham", "wikipedia_page": {"main": "Alastair Graham, FRS (6 November 1906 – 12 December 2000) was a Scottish zoologist  and academic who specialised in malacology.", "link_mentions": [{"page": "List of malacologists", "response": ["*Alastair Graham (1906–2000) Britain"]}, {"page": "Max & Moritz Prize", "response": ["** For Children and Young People: Full Moon Soup, by Alastair Graham (Bertelsmann Verlag)"]}, {"page": "Deaths in December 2000", "response": ["*Alastair Graham, 94, Scottish zoologist  and academic."]}, {"page": "Dylan Thomas Trail", "response": ["The Trail then follows the beach, before it arrives in New Quay, its finishing point. There are further day walks on extensions of the Trail, including Eli Jenkins' Pub Walk which follows the River Dewi to the coast at Cwmtydu. Another walk is the town trailThe Dylan town trail is described clearly in the following bi-lingual booklet, available at Tourist Information Centres in Ceredigion and online at town trail There's also a photographic guide to the town trail at  The Dylan Thomas Trail in New Quay. S. W. Rhydderch’s Rock Climbing in Silk  includes work that provides a poetic introduction to the town (Seren 2001). around New Quay, taking in the house where his aunt and cousins lived,for more on these relations, see pp105-115 of The Dylan Thomas Trail guide (2002). as well as Dylan’s favourite pub, the Black Lion, where Augustus John used to exhibit. Caitlin preferred the Dolau pub, as did Alastair Graham,for more on Graham, see McLaren who had once been Evelyn Waugh’s lover. "]}, {"page": "List of fellows of the Royal Society G, H, I", "response": ["| Alastair Graham||15/03/1979||6 November 1906 – 12 December 2000 zoologist"]}, {"page": "List of fellows of the Royal Society elected in 1979", "response": ["#Alastair Graham  (1906–2000)"]}, {"page": "Alistair Graham (disambiguation)", "response": ["*Alastair Graham (1906–2000), Scottish zoologist and malacologist"]}, {"page": "Vera Fretter", "response": ["Vera Fretter (5 July 1905 – 15 October 1992) was a British conchologist, and one of the authors (with Alastair Graham) of British Prosobranch Molluscs (1962, revised edition 1994)."]}, {"page": "Alastair Graham (zoologist)", "response": ["#REDIRECT Alastair Graham"]}]}}