{"wiki_id": "http://www.wikidata.org/entity/Q1994815", "itemLabel": "Andrew Giddings", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Giddings", "wikipedia_page": {"main": "Andrew Giddings (born 10 July 1963) is an English musician.  He primarily plays keyboard instruments and is best known as a former member of British rock group Jethro Tull, for whom he was the longest serving keyboardist.", "link_mentions": [{"page": "Jethro Tull (band)", "response": ["Jethro Tull are  a British rock band formed in Blackpool, England, in 1967. Initially playing blues rock and jazz fusion, the band soon incorporated elements of hard rock, folk and classical music, forging a signature progressive rock sound. The group’s bandleader, founder, primary composer and only constant member is Ian Anderson, a multi-instrumentalist who mainly plays flute and acoustic guitar, and is also the lead vocalist. The group has featured a revolving door of musicians throughout the decades, including significant contributors such as electric guitarist Martin Barre (the longest serving member besides Anderson), keyboardists John Evan, Dee Palmer, Peter-John Vettese and Andrew Giddings, drummers Clive Bunker, Barrie \"Barriemore\" Barlow and Doane Perry, and bassists Glenn Cornick, Jeffrey Hammond, John Glascock, Dave Pegg and Jonathan Noyce.", "2006 saw the release of a dual boxed set DVD Collector's Edition, containing two DVDs—Nothing Is Easy: Live at the Isle of Wight 1970 and Living with the Past. Bassist Jon Noyce left the band in March 2006. Keyboardist Andrew Giddings quit the band in July 2006, citing constant touring allowing not enough time for family. They were replaced by David Goodier and John O'Hara respectively. In the following year The Best of Acoustic Jethro Tull, a 24-song set of Tull's and Ian Anderson's acoustic performances taken from various albums, was released. Included are a new live acoustic version of \"One Brown Mouse\" and a live performance of the traditional song (attributed to Henry VIII), \"Pastime with Good Company\".", "* Andrew Giddings – keyboards, accordion, bass (1991–2007)"]}, {"page": "Ian Anderson", "response": ["In the 1990s he began working with simple bamboo flutes. He uses techniques such as over-blowing and hole-shading to produce note-slurring and other expressive techniques on this otherwise simple instrument. Anderson said that around this time his daughter began taking flute lessons and noticed his fingering was incorrect, prompting him to relearn his extensive catalog with the right fingering. In 1995, Anderson released his second solo album, Divinities: Twelve Dances with God, an instrumental work composed of twelve flute-heavy pieces pursuing varied themes with an underlying motif. The album was recorded with Jethro Tull keyboard player Andrew Giddings and orchestral musicians. Anderson released two further song-based solo albums, The Secret Language of Birds in 2000 and Rupi's Dance in 2003. In 2003, Anderson recorded a composition called \"Griminelli's Lament\", in honour of his friend, the Italian flutist Andrea Griminelli."]}, {"page": "J-Tull Dot Com", "response": ["* Andrew Giddings – piano, keyboards, Hammond organ, accordion"]}, {"page": "Roots to Branches", "response": ["Roots to Branches is the 19th studio album by the British band Jethro Tull released in September 1995. It carries characteristics of Tull's classic 1970s progressive rock and folk rock roots alongside jazz and Arabic and Indian influences. All songs were written by Ian Anderson and recorded at his home studio. This is the last Tull album to feature Dave Pegg on the bass, and the first to feature keyboardist Andrew Giddings as an official band member, although he had contributed to Catfish Rising (1991) on a sessional basis. As a result, the album notably features the five longest serving members to date in Jethro Tull’s history. It was also the final Tull album to be released through long-time label Chrysalis Records.", "* Andrew Giddings – keyboards"]}, {"page": "Eric Burdon", "response": ["In 1988, he put together a band with 15 musicians including Andrew Giddings – keyboards, Steve Stroud – bass, Adrian Sheppard – drums, Jamie Moses – guitar and four backing vocalists to record the album I Used To Be An Animal in Malibu, in the United States. In 1990, Eric Burdon's cover version of \"Sixteen Tons\" was used for the film Joe Versus the Volcano. The song, which played at the beginning of the film, was also released as a single. He also recorded the singles \"We Gotta Get out of this Place\" with Katrina & the Waves and \"No Man's Land\" with Tony Carey and Anne Haigis. Later in 1990, he had a small line-up of an Eric Burdon Band featuring Jimmy Zavala (sax and harmonica), Dave Meros(bass), Jeff Naideau (keyboards), Thom Mooney (drums) and John Sterling (guitar) before he began a tour with the Doors guitarist Robby Krieger and they appeared at a concert from Ventura Beach, California, which was released as a DVD on 20 June 2008."]}, {"page": "The Jethro Tull Christmas Album", "response": ["The Jethro Tull Christmas Album is the 21st studio album released by Jethro Tull, on 30 September 2003. This was the band's last studio album for 19 years (until the release of The Zealot Gene in 2022), as well as the last album to feature the lineup of Ian Anderson, guitarist Martin Barre (and his last album with the group), bassist Jonathan Noyce, keyboardist Andrew Giddings, and drummer Doane Perry.", "* Andrew Giddings – keyboards, accordion"]}, {"page": "Electronic voice phenomenon", "response": ["EVP is the subject of Vyktoria Pratt Keating's song \"Disembodied Voices on Tape\" from her 2003 album Things that Fall from the Sky, produced by Andrew Giddings of Jethro Tull."]}, {"page": "Catfish Rising", "response": ["Catfish Rising is the 18th studio album by the British rock group Jethro Tull, released in 1991. It is the first Tull album to feature keyboardist Andrew Giddings. The album continues the hard rock and blues sound of the previous two albums."]}, {"page": "The Secret Language of Birds", "response": ["* Andrew Giddings – accordion, piano, organ, marimba, percussion, electric bass, keyboards, orchestral sounds"]}, {"page": "Divinities: Twelve Dances with God", "response": ["Anderson undertook a solo tour in 1995, playing the entire album, start-to-finish, as the first half of the concert. The second half was Jethro Tull material, many played as an instrumental version. The band was composed of Jethro Tull members Andrew Giddings and Doane Perry, future Tull member Jonathan Noyce, and Chris Leslie.", "* Andrew Giddings    – keyboards"]}, {"page": "Stage Left", "response": ["*Andrew Giddings – Keyboards"]}]}}