{"wiki_id": "http://www.wikidata.org/entity/Q19956771", "itemLabel": "Carol Harrison", "itemDescription": "British theologian", "wikipedia_url": "https://en.wikipedia.org/wiki/Carol_Harrison_(theologian)", "wikipedia_page": {"main": "Carol Harrison  (born 27 November 1960) is a British theologian and ecclesiastical historian, specialising in Augustine of Hippo. Since January 2015, she has been Lady Margaret Professor of Divinity at the University of Oxford; she is the first woman and first lay person to hold this appointment. She is a fellow of Christ Church, Oxford and an honorary fellow of Lady Margaret Hall, Oxford. On 27 April 2015, she was installed as a Canon of Christ Church Cathedral, Oxford. She was previously Professor of the History and Theology of the Latin West at Durham University.\n\n", "link_mentions": [{"page": "Pelagianism", "response": ["Theologian Carol Harrison commented that Pelagianism is \"a radically different alternative to Western understandings of the human person, human responsibility and freedom, ethics and the nature of salvation\" which might have come about if Augustine had not been victorious in the Pelagian controversy. According to Harrison, \"Pelagianism represents an attempt to safeguard God’s justice, to preserve the integrity of human nature as created by God, and of human beings' obligation, responsibility and ability to attain a life of perfect righteousness.\" However, this is at the expense of downplaying human frailty and presenting \"the operation of divine grace as being merely external\". According to scholar Rebecca Weaver, \"what most distinguished Pelagius was his conviction of an unrestricted freedom of choice, given by God and immune to alteration by sin or circumstance.\""]}, {"page": "Pelagius", "response": ["The theologian Carol Harrison commented that Pelagius presented \"a radically different alternative to Western understandings of the human person, human responsibility and freedom, ethics and the nature of salvation\" which might have come about if Augustine had not been victorious in the Pelagian controversy. According to Harrison, \"Pelagianism represents an attempt to safeguard God's justice, to preserve the integrity of human nature as created by God, and of human beings' obligation, responsibility and ability to attain a life of perfect righteousness.\" However, this is at the expense of downplaying human frailty and presenting \"the operation of divine grace as being merely external\". According to the scholar Rebecca Weaver, \"what most distinguished Pelagius was his conviction of an unrestricted freedom of choice, given by God and immune to alteration by sin or circumstance.\""]}, {"page": "Faculty of Theology and Religion, University of Oxford", "response": ["*Lady Margaret Professor of Divinity - Canon Carol Harrison "]}, {"page": "Christ Church Cathedral, Oxford", "response": ["*Lady Margaret Professor of Divinity — Carol Harrison (lay; since 27 April 2015 installation)"]}, {"page": "Carol Harrison", "response": ["Carol Harrison (born 8 February 1955) is an English actress and writer. She is known mostly for her work on British television, in particular in recent years her role as Louise Raymond in BBC's EastEnders.", "*Carol Harrison interview"]}, {"page": "Lady Margaret Professor of Divinity", "response": ["The Lady Margaret Professorship of Divinity is a senior professorship in Christ Church of the University of Oxford. The professorship was founded from the benefaction of Lady Margaret Beaufort (1443–1509), mother of Henry VII. Its holders were all priests until 2015, when Carol Harrison, a lay theologian, was appointed to the chair."]}, {"page": "Martyn Percy", "response": ["| Co-authored with Nigel Biggar, Jamie Coates, Jim Cotter, Sarah Foot, Carol Harrison, Sylvia Sands and Graham Ward"]}, {"page": "List of scholars of St Augustine", "response": ["* Carol Harrison"]}, {"page": "Gillian Clark (historian)", "response": ["*Being Christian in Late Antiquity: A Festschrift for Gillian Clark, edited by Carol Harrison, Caroline Humfress, and Isabella Sandwell (Oxford: Oxford University Press, 2014)"]}, {"page": "List of fellows of the British Academy elected in the 2010s", "response": ["* Canon Professor Carol Harrison, Lady Margaret Professor of Divinity, and Canon of Christ Church Cathedral, University of Oxford"]}, {"page": "Gerald Bonner", "response": ["As of 1964, the Department of Theology was heavily oriented to biblical studies. Bonner's appointment represented an attempt by the University to expand expertise in early Church history. As a result, by the early 1970s, both Church History and Theology had become accepted tracks for Durham theology students. Bonner's \"option\" for Augustine of Hippo in the Honours School of Theology was continued by his successor, Carol Harrison, a theologian and ecclesiastical historian, specialising in Augustine of Hippo."]}]}}