{"wiki_id": "http://www.wikidata.org/entity/Q19975302", "itemLabel": "Vernon Sylvaine", "itemDescription": "British playwright and screenwriter (1896-1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Vernon_Sylvaine", "wikipedia_page": {"main": "Vernon Sylvaine (1896–1957) was a British playwright and screenwriter. He is known for writing several popular stage farces. He began working in film in 1937 when his stage hit Aren't Men Beasts! was turned into a film of the same title starring Robertson Hare and Alfred Drayton. Hare and Drayton starred in two further adaptations of his plays A Spot of Bother (1938) and Women Aren't Angels (1943). He adapted his own play for the 1943 comedy-thriller Warn That Man  starring Gordon Harker, Basil Radford and Judy Kelly. His 1948 play One Wild Oat was turned into a 1951 film of the same title.\nHe was the father of the actress June Sylvaine.", "link_mentions": [{"page": "1940 in literature", "response": ["*Vernon Sylvaine – Nap Hand"]}, {"page": "1941 in literature", "response": ["*Vernon Sylvaine "]}, {"page": "1945 in literature", "response": ["*Vernon Sylvaine – Madame Louise"]}, {"page": "1948 in literature", "response": ["*Vernon Sylvaine - One Wild Oat"]}, {"page": "1950 in literature", "response": ["*Vernon Sylvaine – Will Any Gentleman?"]}, {"page": "1953 in literature", "response": ["*Vernon Sylvaine – As Long as They're Happy"]}, {"page": "Brian Rix", "response": ["After Let Sleeping Wives Lie finished at the Garrick it went on a short tour before opening for a summer season at the newly restored Playhouse in Weston-super-Mare. Rix played the first four weeks and then Leslie Crowther returned and played the last six. Meantime the cast of Rix's next West End production commuted by train every day to rehearse in London, returning in the late afternoon for their evening performance. She's Done It Again, opened at the Garrick to the best reviews Rix had ever enjoyed, but it had the shortest run of any of his productions to that date. Rix could never find an obvious reason for the production's short run, for the play enjoyed a sell-out tour after the Garrick. His favoured explanation was that the play, funny as it was, might have seemed somewhat old-fashioned, as it was adapted by Michael Pertwee from a pre-war farce Nap Hand by Vernon Sylvaine and based upon the birth of Dionne quintuplets."]}, {"page": "Basil Radford", "response": ["* Warn That Man! by Vernon Sylvaine (1941)"]}, {"page": "Ciarán Hinds", "response": ["| Vernon Sylvaine"]}, {"page": "Nigel Green", "response": ["Subsequent West End appearances included Come Live With Me (directed by Roy Rich: Vaudeville Theatre, June 1951),Frances Stephens, Theatre World Annual (London) # 3 (Rockliff 1952), page 20 Heloise (directed by Michael Powell: Duke of York's Theatre, November 1951),Frances Stephens, Theatre World Annual (London) # 3 (Rockliff 1952), page 21 Vernon Sylvaine's As Long as They're Happy, opposite Jack Buchanan (directed by Roy Rich: Garrick Theatre, July 1953),Frances Stephens, Theatre World Annual (London) # 5 (Rockliff 1954), page 38 Félicien Marceau's The Egg (directed by Charles Frank: Saville Theatre, October 1957))Frances Stephens, Theatre World Annual (London) # 9 (Rockliff 1958), page 66 and Agatha Christie's Go Back for Murder (directed by Hubert Gregg: Duchess Theatre, March 1960).Frances Stephens, Theatre World Annual (London) # 11 (Barrie & Rockliff 1960), page 23"]}, {"page": "Raymond Lovell", "response": ["Lovell initially trained as a physician at Cambridge University, but gave up medicine for the stage in the 1920s.Criterion DVD commentary for 49th Parallel by Bruce Eder. On stage he appeared as Henry VIII in The Queen Who Kept Her Head. In 1941 he starred in Vernon Sylvaine's Warn That Man!, then reprised his role for the 1943 film adaptation."]}, {"page": "Sheila Mercier", "response": ["|Vernon Sylvaine", "|Vernon Sylvaine", "|Vernon Sylvaine"]}, {"page": "One Wild Oat", "response": ["It was made at the Riverside Studios in Hammersmith with sets designed by the art director Ivan King. The film was adapted by Vernon Sylvaine from his 1948 play One Wild Oat. The stage production debuted at the Garrick Theatre in London and was directed by Jack Buchanan.", "In addition to the film featuring early appearances from future stars Audrey Hepburn and Roger Moore, the role of Cherrie (June Sylvaine) was played, in the stage and film version, by the wife of the author (Vernon Sylvaine).  Audrey has a thirty-second scene as a hotel receptionist. Interesting to note that thirteen years later, she would be the star and Holloway the support in My Fair Lady."]}, {"page": "Shaw Festival production history", "response": ["*Will Any Gentleman – by Vernon Sylvaine"]}, {"page": "Ralph Lynn", "response": ["He appeared at Aldwych in Vernon Sylvaine's 1940 farce Nap Hand. Lynn's last big hit play was Is your Honeymoon Really Necessary? by E. Vivian Tidmarsh (1944), of which he was producer as well as star. It ran in London for more than two years and for two more years on tour. After the Second World War, by which time Walls was dead, Lynn teamed up again with Robertson Hare for two more Travers farces, Outrageous Fortune (1947) and Wild Horses (1952), which were successful without being smash hits.  In 1954 he starred with Hare in The Party Spirit, at the Piccadilly Theatre. Lynn successfully toured the provinces in revivals of his earlier London farces until the last few years of his life. His last London performance was in 1958."]}, {"page": "Will Any Gentleman...?", "response": ["Will Any Gentleman...? is a 1953 British comedy film directed by Michael Anderson and starring George Cole, Veronica Hurst and William Hartnell. It was based on a 1950 play of the same name by Vernon Sylvaine."]}, {"page": "Kerry Norton-Smyser", "response": ["This secretarial stint came to an end early in 1950. On 2UE she won the important role of Angel White in Hagen's Circus, written by Max Afford; she was in episodes of I Hate Crime, starring Ken Wayne as Larry Kent; and she was part of the team working with comedian Mo McCackie in Cavalcade. For 2GB she was in the serial Kitty Foyle, and she had her first starring role in the Caltex Theater in Adam and Evelyne with Reg Goldsworthy. On stage, she replaced Betty Lucas, who was leaving for England, in One Wild Oat at the Palace Theatre. This was followed by Madam Louise. Both these light comedies were written by Vernon Sylvaine."]}, {"page": "A Spot of Bother (1938 film)", "response": ["A Spot of Bother is a 1938 British comedy film directed by David MacDonald and starring Robertson Hare, Alfred Drayton, Sandra Storme and Kathleen Joyce. The film is a farce in which a bishop unwisely decides to loan the cathedral funds to a dubious businessman. Meanwhile, his secretary is involved with smuggled goods. It was shot at Pinewood Studios and adapted from a play by Vernon Sylvaine. The film's sets were designed by Wilfred Arnold."]}, {"page": "As Long as They're Happy", "response": ["As Long as They're Happy is a 1955 British musical comedy film directed by J. Lee Thompson and starring Jack Buchanan, Susan Stephen and Diana Dors. It is based on the 1953 play of the same name by Vernon Sylvaine.", "The film was based on the comedy play by the British writer Vernon Sylvaine which was first staged in 1953 starring Jack Buchanan. It ran at the Garrick Theatre in the West End for 370 performances until May 1954. In April 1954 it was announced that Buchanan would appear in the film version; it would be his first starring role in a movie in 14 years. In August it was announced Jeanne Carson would co star. "]}, {"page": "John Stone (actor)", "response": ["Born in Cardiff, Glamorgan, Wales, Stone was educated at Brighton College. He served in the R.A.F. and began his career as a journalist. Soon he switched to acting and only appeared on the stage until 1945 when he joined the B.B.C. Repertory Company. He made his first West End appearance in One Wild Oat by Vernon Sylvaine, 1948.Cast list, One Wild Oat (Acting Edition), Samuel French Ltd., 1951 Subsequent appearances include the London premiere of Arthur Miller's A View from the Bridge, Comedy Theatre, 1956;Review, The Stage, 18 October 1956 And Suddenly it's Spring, Duke of York's Theatre, 1959;Review, The Stage, 12 November 1959 Signpost to Murder, Cambridge Theatre, 1962; and the role of Crestwell, the laconic butler, in Noël Coward's Relative Values, Westminster Theatre, 1973."]}, {"page": "Judy Kelly", "response": ["She appeared in the 1941 stage musical Lady Behave. Other wartime stage roles include Vernon Sylvaine's Women Aren't Angels and Warn That Man."]}, {"page": "Women Aren't Angels", "response": ["Women Aren't Angels is a 1943 black and white British comedy film directed by Lawrence Huntington and starring Aldwych Theatre farceurs Robertson Hare and Alfred Drayton, with Polly Ward and Joyce Heron. It was made at Welwyn Studios and based on a 1941 play of the same title by Vernon Sylvaine."]}, {"page": "Madame Louise", "response": ["Madame Louise (also titled \"The Madame Gambles\"), is a 1951 British comedy film directed by Maclean Rogers and produced by Ernest G. Roy and starring Richard Hearne, Petula Clark, Garry Marsh and Richard Gale. It is loosely based on the 1945 play Madame Louise by Vernon Sylvaine, which had featured Alfred Drayton and Robertson Hare, but was extensively reworked to suit the different stars of the film production."]}, {"page": "Frederick Piper", "response": ["Born in London in 1902, Piper worked as a tea merchant before starting his acting career on the stage in the 1920s, playing in London productions and also touring as far afield as Canada. He continued to appear in theatrical productions in the West End alongside his screen roles. These included appearances in the original runs of Barré Lyndon's The Man in Half Moon Street, Vernon Sylvaine's Nap Hand, N.C. Hunter's A Day by the Sea, Robert Bolt's Flowering Cherry and Home at Seven and The White Carnation by R.C. Sheriff."]}, {"page": "Warn That Man", "response": ["It was based on the 1941 play Warn That Man! by Vernon Sylvaine which had run for ten months on the West End stage, with Harker reprising his original role. The film was made at Welwyn Studios, with sets designed by the art director Charles Gilbert."]}, {"page": "Aren't Men Beasts!", "response": ["The film was based on a play of the same name by Vernon Sylvaine. It was made at Elstree Studios by British International Pictures.Wood p.89 John Mead worked on the film as art director."]}, {"page": "Arts Theatre Cronulla", "response": ["The Arts Theatre Cronulla (1963 - 2013). After making the necessary improvements for the building to be licensed for public performances the theatre, under its new name Arts Theatre Cronulla, opened for its first production on 30 November 1963 with a production of Will Any Gentleman...?, by Vernon Sylvaine, directed by Ron Martin. Over the proceeding fifty years the theatre has staged close to 200 productions covering works ranging from the historical greats to the contemporary classics. In 2012 after nearly fifty years in the original 100-year-old building, the theatre underwent major renovations bringing its facilities in line with modern standards. Along with their regular season of plays the Cronulla Arts Theatre also runs adult drama classesAdult Drama Class and a Crash Test drama program for the development of short plays. Unlike the vast majority of the surviving Schools of Arts, which are owned and managed by local councils, Cronulla School of Arts is still privately owned. 13 November 2013 marks the theatre's 50th anniversary. Throughout this period many people have been involved in the theatre and its productions, some of the more notable are: Ron Martin, Dick Moss, Joyce Jacobs, Lorraine Crane, Don Browne, Monte Buchanan, James Bruce, Doreen and Syd Grant, Kathy Goddard and Joy Baker."]}, {"page": "Thelma Grigg", "response": ["After Bush Christmas, Grigg moved to England in a largely unsuccessful effort to further her movie career. She landed minor roles in the 1949 films Christopher Columbus and Train of Events. In 1950 she returned to the stage with Robertson Hare in the West End production of Vernon Sylvaine's Will Any Gentleman...? That same year she appeared in her last known movie role, in the comedy The Lady Craved Excitement."]}, {"page": "John Breck (actor)", "response": ["As John Breck, he appeared at the Citizens Theatre, and on tour with the Citizens Company worldwide, in many productions including Carlo Goldoni's Country Life, The Good Humoured Ladies, The Impresario From Smyrna and The Battlefield,  Karl Kraus' The Last Days of Mankind, Robert David MacDonald's A Waste of Time (based on Proust's A la recherche du temps perdu), Chinchilla, Summit Conference, Don Juan and Webster, James Hadley Chase's No Orchids for Miss Blandish, Noël Coward's Semi-Monde and Sirocco, William Shakespeare's Macbeth, Hamlet and The Merchant of Venice, Philip Massinger's The Roman Actor, Shaun Lawton's Desperado Corner, Vernon Sylvaine's Madame Louise, John Ford and John Webster's Painter's Palace of Pleasure, Hofmannsthal's Rosenkavalier, Genet's The Balcony, The Screens and The Blacks, Bertolt Brecht's The Caucasian Chalk Circle and The Mother, Sean O'Casey's Red Roses For Me, The Marquis de Sade's Philosophy in the Boudoir, Chekhov's The Seagull, Brecht/Weill's The Threepenny Opera, John Fletcher and Philip Massinger's The Custom of The Country, Christopher Marlowe's The Massacre at Paris, and many of the Citizens' annual Christmas shows.''"]}, {"page": "One Wild Oat (play)", "response": ["One Wild Oat is a comedy play by the British writer Vernon Sylvaine which premiered in 1948. Its West End run was at the Garrick Theatre with direction by the veteran entertainer Jack Buchanan. It ran for 508 performances from December 1948 to February 1950.Wearing p.411 The cast originally included Robertson Hare and Alfred Drayton, who had appeared together in several of Sylvaine's farces and their subsequent film adaptations. In 1949, following the death of Drayton, his role was taken over first by Arthur Riscoe and then Hartley Power.", "Category:Plays by Vernon Sylvaine"]}, {"page": "Madame Louise (play)", "response": ["Madame Louise is a 1945 comedy play by the British writer Vernon Sylvaine.", "Category:Plays by Vernon Sylvaine"]}, {"page": "Women Aren't Angels (play)", "response": ["Women Aren't Angels is a 1941 play by the British writer Vernon Sylvaine and featured Robertson Hare, Alfred Drayton and Judy Kelly in its original cast.", "Category:Plays by Vernon Sylvaine"]}, {"page": "As Long as They're Happy (play)", "response": ["As Long as They're Happy is a comedy play by the British writer Vernon Sylvaine which was first staged in 1953. A successful hit, it ran at the Garrick Theatre in the West End for 370 performances between July 1953 and May 1954.Wearing p.239 Veteran entertainer Jack Buchanan directed and starred as a stockbroker trying to cope with the extravagant behaviour of his daughters. Other members of the cast included Dorothy Dickson, Nigel Green, David Hutcheson and Stephen Hancock.Wearing p.239", "Category:Plays by Vernon Sylvaine"]}, {"page": "Warn That Man!", "response": ["Warn That Man! is a 1941 comedy thriller play by the British writer Vernon Sylvaine. A comedy-thriller, its plot concerns an attempt to kidnap wartime Prime Minister Winston Churchill from an English country house.", "Category:Plays by Vernon Sylvaine"]}, {"page": "Will Any Gentleman?", "response": ["Will Any Gentleman? is a 1950 stage farce by the British writer Vernon Sylvaine. The play was first performed at the Royal Court Theatre in Liverpool in July 1950. It then went on to the West End, running for 364 performances at the Stand Theatre between September 1950 and July 1951.Wearing p.42 It starred Robertson Hare, who appeared in several plays by Sylvaine. Hare plays a mild-mannered bank clerk who, after a night out, is hypnotized into a much more assertive lifestyle.", "Category:Plays by Vernon Sylvaine"]}, {"page": "Nap Hand (play)", "response": ["Nap Hand is a 1940 comedy play by Vernon Sylvaine and Guy Bolton. The title refers to the sporting term, a nap hand. The farce revolves around quintuplets.", "Category:Plays by Vernon Sylvaine"]}, {"page": "Joan Jefferson Farjeon", "response": ["After remaining homebound in her early 20s, in 1939, Farjeon illustrated a collection of plays entitled Granny Gray for Eleanor Farjeon. She gained experience painting scenery for the Little Revues of Herbert Farjeon, leading the writer and friend Nicholas Stuart Gray and her aunt to persuade her to leave home and become independent. Farjeon began working as a scenic and costume designer in 1941, and lodged with members of the Theatre Royal, Windsor. Two years later, Tyrone Guthrie invited Farjeon to design for him at Liverpool Playhouse until callup papers meant she worked on land in Ditchling, Sussex. After producing designs for the musical Song of Norway in 1946, she worked on Vernon Sylvaine's comedy Will Any Gentleman? in 1950. Later West End plays Farjeon was an illustrator were Beauty and the Beast in 1950, Agatha Christie's The Hollow in 1951, The Princess and the Swineherd in 1952, the puppet play Rapunzel in 1953, Peter Hall's 1953 production of Henry IV at the Arts Theatre, 1954's The Hunters and the Henwife and The Marvellous Story of Puss in Boots, The Imperial Nightingale and New Clothes for the Emperor adapted from Hans Christian Andersen in 1957, The Other Cinderella in 1958, Christie's Verdict that same year at the Strand Theatre and Lock Up Your Daughters at the Mermaid Theatre in 1959."]}]}}