{"wiki_id": "http://www.wikidata.org/entity/Q19956858", "itemLabel": "Alex Chalk", "itemDescription": "British politician (born 1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alex_Chalk", "wikipedia_page": {"main": "Alexander John Gervase Chalk,  (born 8 August 1976) is a British politician serving as Solicitor General for England and Wales since September 2021 and Member of Parliament for Cheltenham since 2015. Chalk previously served as the Minister of State for Prisons and Probation and Parliamentary Under-Secretary of State for Justice.", "link_mentions": [{"page": "Law officers of the Crown", "response": ["The Attorney General's deputy is the Solicitor General for England and Wales, currently Alex Chalk. Under the Law Officers Act 1997, the Solicitor General may do anything on behalf of, or in the place of, the Attorney General, and vice versa."]}, {"page": "Solicitor General for England and Wales", "response": ["The role has been held by former barrister Alex Chalk since 16 September 2021.", "|Alex Chalk"]}, {"page": "Windlesham House School", "response": ["*Alex Chalk MP (born 1976), Conservative politician, MP for Cheltenham"]}, {"page": "Cheltenham (UK Parliament constituency)", "response": ["| Alex Chalk"]}, {"page": "Chalk (disambiguation)", "response": ["* Alex Chalk, English Conservative Party politician, Member of Parliament (MP) for Cheltenham since May 2015"]}, {"page": "Martin Horwood", "response": ["Despite having secured over 50% of the vote in the 2010 general election, with a 9.3% swing and a 3,920-vote majority, Horwood lost his seat during the national Liberal Democrat collapse in the 2015 general election, losing to the Conservative candidate Alex Chalk. He unsuccessfully attempted to regain his seat during the 2017 general election, although he reduced Chalk's majority by 7.6%."]}, {"page": "List of Parliamentary constituencies in Gloucestershire", "response": ["|Alex Chalk †"]}, {"page": "Vote-OK", "response": ["The Independent reported that they believed candidates Angie Bray (Ealing Central and Acton) and Ben Howlett (Bath) accepted help from Vote-OK.  Alex Chalk (Cheltenham) received help from Vote-OK."]}, {"page": "Neil Carmichael (English politician)", "response": ["In May 2016, it emerged that Carmichael was one of a number of Conservative MPs being investigated by police in the 2015 United Kingdom general election party spending investigation, for allegedly spending more than the legal limit for his constituency in his election campaign.Jamie Wiseman, 'Tory election expenses: Neil Carmichael could be among MPs investigated by police for alleged election fraud ', Stroud News & Journal, 11 May 2016.Rowena Mason and Holly Watt, 'Two Tory MPs reveal CPS is reviewing their election spending ', The Guardian (16 March 2017).Rajeev Syal, 'Theresa May backs MPs investigated over 2015 election spending ' (19 April 2017). As of 16 March 2017, it was clear that the Gloucester police force had passed files to the Crown Prosecution Service for a possible prosecution, but not whether those pertained to Carmichael, to Cheltenham MP Alex Chalk, or to both. The CPS have confirmed that no further action will be taken."]}, {"page": "Justice Select Committee", "response": ["| Alex Chalk MP ", "|Alex Chalk MP (Conservative)"]}, {"page": "List of constituencies in South West England", "response": ["|Alex Chalk†"]}, {"page": "Attorney General's Office (United Kingdom)", "response": ["|Alex Chalk QC MP"]}, {"page": "British Government frontbench", "response": ["| colspan=\"2\" | Alex Chalk QC"]}, {"page": "38 Degrees", "response": ["* Cheltenham Member of Parliament (MP) Alex Chalk accused 38 Degrees of a \"misleading\" advertising campaign after they drove a billboard round his constituency criticising him for his role in the NHS crisis. Chalk described the group as \"a worrying development in British politics\"."]}, {"page": "Up Hatherley", "response": [" It is part of the Cheltenham constituency and is represented in parliament by Conservative MP Alex Chalk."]}, {"page": "Richard Graham (politician)", "response": ["In February 2019, Graham along with Chancellor Philip Hammond and Alex Chalk MP formally opened the £5million School of Business and Technology at the University of Gloucestershire. The Vice Chancellor Stephen Marston spoke of the “massive contribution to Gloucester and its wellbeing”,https://www.youtube.com/watch?v=huP2TY2xGMc  \"Youtube Link to UoG opening of Business School\" whilst the Chancellor added that the investment brings “together academic and business expertise and ensure the students here today develop the skills they need to become the business leaders of the future.” https://www.glos.ac.uk/news/pages/chancellor-exchequer-opens-new-business-school.aspx  \"Chancellor visits UoG\"", "With Alex Chalk, Graham has worked on extending the maximum penalty for stalking. They introduced a Private Member's Bill in 2016 calling for the limit to be doubled. Then justice minister Sam Gyimah thanked Graham for his “considerable efforts in highlighting this issue.”https://www.theguardian.com/law/2017/jan/06/maximum-sentence-for-stalking-to-rise-to-10-years#img-1  \"Guardian Article on Law Changing Maximum Sentence for Stalking\" and the law was changed in January 2017 through the Policing and Crime  Bill.", "Laura Richards, the founder and director of Paladin, National Stalking Advocacy Service released this statement in support of the work of Graham. “This law change will allow Judges greater flexibility when sentencing stalkers and provide some respite for victims of stalking. This is about justice, ensuring better protection for victims as well as changing lives and saving lives. We are grateful to Alex Chalk MP and Richard Graham MP, as well as Baroness Jan Royall for tabling the amendment in the House of Lords.” https://paladinservice.co.uk/success-stalkers-face-maximum-10-year-sentence-government-u-turn/ \"Charity Statement on Law Change on Stalking\""]}, {"page": "List of alumni of Magdalen College, Oxford", "response": ["* Alex Chalk, Conservative MP for Cheltenham and Parliamentary Under-Secretary of State for Justice"]}]}}