{"wiki_id": "http://www.wikidata.org/entity/Q1997099", "itemLabel": "John Burn", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Burn_(rower)", "wikipedia_page": {"main": "John Southerden Burn (25 June 1884 – 28 August 1958) was an English doctor and rower who competed for Great Britain in the 1908 Summer Olympics.Burn was born at Richmond on Thames, the son of Dr Stacey Burn and his wife Agnes Ellen Warner. His father was in practice at Richmond and his grandfather John Southerden Burn was a solicitor and antiquary. Burn was a medical student at Cambridge University and rowed for Cambridge in the Boat Race in 1907 and 1908. The Cambridge crew made up a boat in the eights  which won the bronze medal for Great Britain rowing at the 1908 Summer Olympics. In 1910 Burn partnered Gordon Thomson to win Silver Goblets at Henley Royal Regatta beating Albertus Wielsma and Bernardus Croon in the final.Burn completed his training at St Bartholomew's Hospital and became a House Surgeon there. During World War I he was a temporary Captain in the RAMC and served as Assistant Surgeon at the St John's Ambulance Brigade Hospital with the BEF. He was also anaesthetist in the War Hospital at Le Touquet France.  After the war he was in practice with his father as Burn and Burn. He was also Hon Surgeon at the Royal Hospital, Richmond and Hon. Anaesthetist at the Star and Garter Home, Richmond.\nBurn died at Bognor Regis, Sussex at the age of 74.\nBurn married Ellen La Nauze during the war and had three children.", "link_mentions": [{"page": "Rowing at the 1908 Summer Olympics", "response": ["|Frank JerwoodEric PowellOswald CarverEdward WilliamsHenry GoldsmithHarold KitchingJohn BurnDouglas StuartRichard Boyle"]}, {"page": "Great Britain at the 1908 Summer Olympics", "response": ["| , John Burn,Oswald Carver, Henry Goldsmith,Frank Jerwood, Harold Kitching,Eric Powell, Douglas Stuart,Edward Gordon Williams || Rowing", "|bgcolor=cc9966| 3rd ||align=left| Frank Jerwood, Eric Powell, Oswald Carver,  Edward Williams, Henry Goldsmith, Harold Kitching,  John Burn, Douglas Stuart, Richard Boyle || Bye || Unknown  2nd, semifinal 2 ||bgcolor=lightgray| Did not advance"]}, {"page": "List of Olympic medalists in rowing (men)", "response": ["|Frank JerwoodEric PowellOswald CarverEdward WilliamsHenry GoldsmithHarold KitchingJohn BurnDouglas StuartRichard Boyle"]}, {"page": "Gordon Thomson (rower)", "response": ["In 1909, Thomson was a member of the Cambridge crew in the Boat Race, and won his rowing blue. In 1910, he won Silver Goblets at Henley Royal Regatta partnering John Burn to beat Albertus Wielsma and Bernardus Croon. He was also a rugby player who played for UCS Old Boys, London Scottish and Surrey."]}, {"page": "List of 1908 Summer Olympics medal winners", "response": ["| CambridgeFrank JerwoodEric PowellOswald CarverEdward WilliamsHenry GoldsmithHarold KitchingJohn BurnDouglas StuartRichard Boyle"]}, {"page": "John Southerden Burn", "response": ["Burn married firstly Sarah Sophia Colnett at St Lawrence Jewry on 17 April 1822. They had a daughter Ellen, but Sarah died. He married secondly Jane Norton (1815-1899), and a marriage settlement was made on 27 September 1848. They had children Stacey, a doctor, John a clergyman and Ann. He was the grandfather of John Burn Olympic rower, and cousin of Edmund Blacket Australian architect. He was also uncle by marriage of Christiana Edmunds."]}, {"page": "John Burn", "response": ["John Burn may refer to:", "*John Burn (bishop) (1851–1896), Anglican colonial bishop", "*John Burn (rower) (1884–1958), English doctor and rower", "*John Burn (geneticist) (born 1952), British geneticist and professor of clinical genetics", "*John Burns (disambiguation)"]}, {"page": "Royal Star and Garter Home, Richmond", "response": ["*John Burn, honorary anaesthetist at the Star and Garter Home"]}]}}