{"wiki_id": "http://www.wikidata.org/entity/Q1998363", "itemLabel": "Dave Halliday", "itemDescription": "Scottish footballer and manager (1901-1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Halliday", "wikipedia_page": {"main": "David Halliday (11 December 1901 – 5 January 1970) was a Scottish association footballer and manager. He achieved numerous distinctions and high rankings as a prolific goal scoring forward with six senior clubs; St Mirren, Dundee, Sunderland, Arsenal, Manchester City and Clapton Orient. He bookended his senior career playing at then non-league Queen of the South and Yeovil and Petters United. Halliday's three goals in the FA Cup proper for Yeovil give him a career total of 368 senior goals. From being player / manager at Yeovil, he went on to win trophies managing Aberdeen and Leicester City.He is the most recent of only two players to be outright top scorer in both Scottish and English football's top divisions with 38 Dundee goals in 1923–24 and 43 Sunderland goals in 1928–29. He is the quickest player in history to 100 goals in English football's top division, taking 101 games when at Sunderland. He is the only player to score 30 or more goals in four consecutive seasons in English football's top division (achieved again when at Sunderland). He scored at least 35 league goals in each of those four seasons. He is Sunderland's most prolific goals-per-game striker with 165 goals from 175 games. His 211 goals in English football's top division with Sunderland, Arsenal and Manchester City ranks him the 19th highest scorer at that level. Of the 27 players to have scored 200 or more goals in English football's top division, only Dixie Dean scored at a more prolific rate at that level.Managing Aberdeen, he won the 1946–47 Scottish Cup and the 1954–55 Scottish Football League. He managed Leicester City to promotion to the top division in England from winning the 1956–57 Football League Second Division.", "link_mentions": [{"page": "Alex Ferguson", "response": ["Ferguson joined Aberdeen as manager in June 1978, replacing Billy McNeill who had only managed the club for one season before he was offered the chance to manage Celtic. Although Aberdeen were one of Scotland's major clubs they had won the league only once, in 1955 under Dave Halliday. The team had been playing well, however, and had not lost a league match since the previous December, having finished second in the league the previous season.Crick, p. 159 Ferguson had now been a manager for four years, but was still not much older than some of the players and had trouble winning the respect of some of the older ones such as Joe Harper.Crick, p. 171 The season did not go especially well, with Aberdeen reaching the semi-final of the Scottish Cup and the Scottish League Cup Final, but losing both matches and finishing fourth in the league."]}, {"page": "Dumfries", "response": ["Dumfries has produced a steady stream of professional footballers and managers. The best known footballers of their eras to come from Dumfries are probably Dave Halliday, Ian Dickson, Bobby Ancell, Billy Houliston, Jimmy McIntosh, Willie McNaught and Ted McMinn. Halliday, Dickson, Houliston and McMinn played for home town club, Queen of the South during their careers. Dominic Matteo was born in Dumfries but moved to England while still a young boy. Barry Nicholson lost 4–3 to Queens playing for Aberdeen in the 2008 Scottish Cup semi-finals despite scoring against the team he supported as a boy. Ancell, Houliston, McNaught and Nicholson have represented Scotland and were joined in having done so in season 2010/11 by Cammy Bell and Grant Hanley. Matteo gained 6 full caps for Scotland after having represented England at under-21 level. Halliday was overlooked by Scotland in favour of Hughie Gallacher. Gallacher played for The Queen's but was not from Dumfries. It was as a manager rather than a player that Thomas Mitchell made his name as a multiple FA Cup winner at Blackburn Rovers before joining Woolwich Arsenal as Arsenal F.C. were then named."]}, {"page": "Sunderland A.F.C.", "response": ["Two seasons later the First World War brought the league to a halt. After the league's resumption, Sunderland came close to winning another championship in the 1922–23 season, when they were runners-up to Liverpool.Days, pp. 107–108. They also came close the following season, finishing third.Days, pp. 111–112. The club escaped relegation from the First Division by one point in the 1927–28 season despite 35 goals from Dave Halliday.thumb|right|Sunderland's 1937 FA Cup winning side Halliday improved his goal scoring to 43 goals in 42 games the following season, an all-time Sunderland record for goals scored in a single season.", "The holder of the record for the most league appearances is Jimmy Montgomery, having made 527 first team appearances between 1961 and 1976.Dykes, pp. 280–282. The club's top league goal scorer is Charlie Buchan, who scored 209 goals from 1911 to 1925; Bobby Gurney is the record goalscorer over all competitions with 228 goals between 1926 and 1939. Dave Halliday holds the record for the most goals scored in a season: 43 in the 1928–29 season in the Football League First Division. As of October 2014 John O'Shea is the most capped player for the club, making 100 appearances for the Republic of Ireland.", "| Dave Halliday"]}, {"page": "Aberdeen F.C.", "response": ["Formed in 1903 as a result of the amalgamation of three clubs from Aberdeen, they rarely challenged for honours until the post war decade, when they won each of the major Scottish trophies under manager Dave Halliday. This level of success was surpassed in the 1980s, when, under the management of Sir Alex Ferguson, they won three league titles, four Scottish Cups and a Scottish League Cup, alongside the two European trophies. Aberdeen were the last club outside the Old Firm to win a league title, in 1984–85, and also the last Scottish team to win a European trophy. The team has enjoyed less success since this golden era, though a 19-year wait for a major trophy was ended by winning the 2013–14 Scottish League Cup, followed up by multiple second-place finishes behind Celtic in the league during the 2010s.", "Travers was replaced by former Yeovil Town manager Dave Halliday, one of more than a hundred applicants for the role, and the club moved from their black and gold strip to red and white. Halliday had barely begun his work when World War II halted competitive football in the United Kingdom. For these six years, the club was temporarily taken over by then-directors Charles B Forbes and George Anderson while Halliday served in the war."]}, {"page": "Leicester City F.C.", "response": ["City reached the FA Cup final for the first time in their history in 1949, losing 3–1 to Wolverhampton Wanderers. The club, however, was celebrating a week later when a draw on the last day of the season ensured survival in Division Two. Leicester won the Division Two championship in 1954, with the help of Arthur Rowley, one of the club's most prolific strikers. Although they were relegated from Division One the next season, under Dave Halliday they returned in 1957, with Rowley scoring a club record 44 goals in one season. Leicester remained in Division One until 1969, their longest period ever in the top flight."]}, {"page": "Dundee F.C.", "response": ["Dave Halliday had played on the left wing for his previous clubs, his hometown side Queen of the South and St Mirren. Halliday went to Dundee in 1921 where Scotland internationalist Alec Troup played left wing. Dundee thus converted Halliday to centre forward with prolific results; he finished as Scottish top scorer in the 1923–24 season with 38 goals from his 36 top division appearances. This remains the club record all-time seasonal league goal scoring record. Halliday top scored in England's top division in 1928–29 to become the most recent of only 2 players to be outright top scorer in Scotland and England. With Halliday Dundee reached the 1924–25 Scottish Cup final eliminating the holders en route, the Airdrieonians side of Hughie Gallacher. Dundee led Celtic 1–0 at half time in the final before losing out to a last minute Jimmy McGrory winner. Halliday top scored for Dundee in that cup run. In end of season tours with Dundee, Halliday scored doubles against each of Athletic Bilbao, Real Madrid, Valencia CF and FC Barcelona. Halliday scored 103 goals in 147 league and cup appearances for the Dee. He then moved South to set scoring records in England where other teams profited from Dundee's decision to convert Halliday to centre-forward.Dave Halliday full career profile on www.qosfc.com", "* Most league goals in a season: Dave Halliday, 38, 1923–24"]}, {"page": "Yeovil Town F.C.", "response": ["|1935–38|| Dave Halliday"]}, {"page": "Arthur Rowley", "response": ["However Dave Halliday decided to sell Rowley in the summer of 1958 when he was just 8 goals short of Arthur Chandler's club record for the all-time top goalscorer. This led to a loss of faith by the fans and ultimately his sacking 2 months into the 1958–59 season."]}, {"page": "Football records and statistics in England", "response": ["*Fastest player to 100 English top flight goals Dave Halliday – 101 games", "*Players to score over 30 league goals in four consecutive seasons Dave Halliday – 1925–29. Halliday in fact scored at least 35 goals in each of those four seasons."]}, {"page": "Arrol-Johnston", "response": ["Arrol-Johnston ran a works football team. In 1919 the football club was one of three clubs in Dumfries that merged to form Queen of the South F.C. The most notable players at Arrol-Johnston were Dave Halliday and Ian Dickson. Both then played for Queen of the South before going on to top score for their respective clubs in the top division in England. Halliday in particular had a highly successful goal-scoring career becoming one of the most prolific scorers in both UK and world football history. He then became a trophy-winning manager.Queens Legends career profiles of Dave Halliday and Ian Dickson"]}]}}