{"wiki_id": "http://www.wikidata.org/entity/Q19975370", "itemLabel": "Frank Wall", "itemDescription": "British engineer (1810-1896)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Wall_(steamboat_engineer)", "wikipedia_page": {"main": "Francis Xavier Wall (January 4, 1810 – July 3, 1896)  was a steamboat engineer and millionaire considered the founder of the town of Wall, Pennsylvania, near Pittsburgh. He sold his land to the Pennsylvania Railroad, who built the first railroad station in the area, Wall's Station. He died when he was struck by a train at the station.", "link_mentions": [{"page": "Wall, Pennsylvania", "response": ["Wall is located at the site of a farm purchased by James Walls in 1829.  The property, on the south bank of Turtle Creek, was passed to James' sons Henry and John Walls, who lived in a log cabin near the heart of present-day Wall.  A station on the Pennsylvania Railroad opened in the early 1840s, which was named \"Walls' Station\" in honor of the Walls family.  Eventually, the name of the station and the town that grew up around it was shortened to \"Wall Station\".  Henry and John Walls sold their property to their cousin Frank Wall, an engineer on riverboats who developed the property around the station.  Wall got its name after this Frank Wall, whose said property development led to him being the owner of the first two houses erected in the region.Cushing, Thomas. A Genealogical and Biographical History of Allegheny County, Pennsylvania. Baltimore: Genealogical Pub., 1975; p. 505\"Frank Wall Has A Few Words To Say About The Value Of Poor Farm Land.\" Pittsburg Dispatch 8 Dec. 1891 p. 2"]}, {"page": "Wall (surname)", "response": ["*Frank Wall (herpetologist) (1868–1960), Sri Lankan and Indian physician and herpetologist", "*Frank Wall (American politician) (1908–1998), American politician", "*Frank Wall (Australian politician) (1879–1941), Australian politician", "*Frank Wall (politician) (active 1981–1991), Irish politician", "*Frank Wall (steamboat engineer) (1810–1896), American engineer"]}, {"page": "Ferdinand E. Kuhn", "response": ["Kuhn was married to Katherine \"Kate\" Wall on April 15, 1885, in her hometown of Springfield, Kentucky.  The marriage was performed by Joseph A. Hogarty, whose father sculpted the Henry Clay monument in Lexington.http://files.usgwarchives.net/ky/washington/bios/hogarty61bs.txt Kate Wall had attended Saint Mary's Academy, and was born in Wall, Pennsylvania, named for her father Frank Wall, a wealthy farmer and steamboat engineer from Ireland.Cushing, Thomas. A Genealogical and Biographical History of Allegheny County, Pennsylvania. Baltimore: Genealogical Pub., 1975; p. 505\"Frank Wall Has A Few Words To Say About The Value Of Poor Farm Land.\" Pittsburg Dispatch 8 Dec. 1891 p. 2 "]}, {"page": "Francis Xavier Wall", "response": ["#REDIRECT Frank Wall (steamboat engineer)"]}, {"page": "Frank Wall", "response": ["Frank Wall may refer to:", "* Frank Wall (herpetologist) (1868–1950), physician and herpetologist in Sri Lanka and India", "* Frank Wall (American politician) (1908–1998), member of the Mississippi House of Representatives", "* Frank Wall (Australian politician) (1879–1941), Australian politician", "* Frank Wall (Irish politician) (active 1981–1991), Irish politician", "* Frank Wall (steamboat engineer) (1810–1896), American engineer"]}]}}