{"wiki_id": "http://www.wikidata.org/entity/Q19957901", "itemLabel": "Peter Ginn", "itemDescription": "British archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Ginn", "wikipedia_page": {"main": "Peter Ginn is a British archaeologist, best known as a presenter of the BBC educational television documentary series (2005–2014) known as the BBC historic farm series. Ginn and Ruth Goodman were the only presenters to appear in every Farm series, although he did not appear in the related Victorian Pharmacy. His later television work includes Secrets of the Castle (2014) and Full Steam Ahead (2016).Ginn grew up in Bodicote, Oxfordshire, and went to St John's RC Primary and Blessed George Napier Schools in Banbury. He studied Egyptian archaeology at the Institute of Archaeology, University College London. Ginn was added to the cast of the 2005 series Tales from the Green Valley when his university friend Alex Langlands was injured.", "link_mentions": [{"page": "List of people associated with University College London", "response": ["* Peter Ginn, archaeologist, historian, author and presenter of \" Victorian Farm\", \"Edwardian Farm\", \"Wartime Farm\""]}, {"page": "Allen Scythe", "response": ["Episode 6 of the BBC Two reality television series Wartime Farm featured an Allen Scythe. Cast members Alex Langlands and Peter Ginn used it to harvest hay in a churchyard.Episode 6 Wartime Farm \"...use some clever 1940s technology...\" at bbc.co.uk Accessed 3 March 2018"]}, {"page": "Tales from the Green Valley", "response": ["The series features historians Stuart Peachey and Ruth Goodman, and archaeologists Alex Langlands, Peter Ginn and Chloe Spencer."]}, {"page": "Victorian Farm", "response": ["Victorian Farm is a British historical documentary TV series in six parts, first shown on BBC Two in January 2009, and followed by three Christmas-themed parts in December of the same year. The series, the second in the BBC historic farm series, recreates everyday life on a farm in Shropshire in the 1880s, using authentic replica equipment and clothing, original recipes and reconstructed building techniques. It was made for the BBC by independent production company Lion Television and filmed at a preserved Victorian era living museum farm, Acton Scott Historic Working Farm, Shropshire. The farming team was historian Ruth Goodman, and archaeologists Alex Langlands and Peter Ginn."]}, {"page": "Edwardian Farm", "response": ["Edwardian Farm is a British historical documentary TV series in twelve parts, first shown on BBC Two from November 2010 to January 2011. As the third series on the BBC historic farm series, following the original, Tales from the Green Valley, it depicts a group of historians recreating the running of a farm during the Edwardian era. It was made for the BBC by independent production company Lion Television and filmed at Morwellham Quay, an historic port in Devon. The farming team was historian Ruth Goodman and archaeologists Alex Langlands and Peter Ginn. The series was devised and produced by David Upshalhttp://watch.tvguide.co.uk/engage/1419643/103447255-edwardian_farm and directed by Stuart Elliott, Chris Michell and Naomi Benson."]}, {"page": "Wartime Farm", "response": ["Wartime Farm is a British historical documentary TV series in eight parts in which the running of a farm during the Second World War is reenacted, first broadcast on BBC Two on 6 September 2012. The series, the fourth in the historic farm series, following the original, Tales from the Green Valley, was made for the BBC by independent production company Lion Television in association with the Open University, and was filmed at Manor Farm Country Park close to Southampton.Hampshire County Council: Manor Farm Country Park The farming team consisted of historian Ruth Goodman, and archaeologists Alex Langlands and Peter Ginn.  The Wartime Farm commissioning executives for the BBC are Emma Willis and James Hayes, and the Executive Producer for Lion Television is David Upshal.", "Wartime Farm, Christmas Special was broadcast on BBC Two and BBC HD on 18 December 2012. The 60-minute programme recreated the conditions of Christmas 1944 and was presented by Ruth Goodman and Peter Ginn."]}, {"page": "Tudor Monastery Farm", "response": ["Tudor Monastery Farm is a British factual television series, first broadcast on BBC Two on 13 November 2013. The series, the fifth in the historic farm series, following the original, Tales from the Green Valley, stars archaeologists Peter Ginn and Tom Pinfold, and historian Ruth Goodman. The team discover what farming was like during the Tudor period at the Weald and Downland Open Air Museum.  The program also recurringly features other historians, such as Colin Richards (an expert on rural crafts), and Professor Ronald Hutton (who specializes in folklore and religious beliefs)."]}, {"page": "Full Steam Ahead", "response": ["*Full Steam Ahead, a 2016 British educational TV series starring Ruth Goodman, Alex Langlands, and Peter Ginn"]}, {"page": "Secrets of the Castle", "response": ["Secrets of the Castle, or Secrets of the Castle with Ruth, Peter and Tom is a British factual television series that first broadcast on BBC Two from 18 November to 17 December 2014.BBC - Programme Information The series stars archaeologists Peter Ginn and Tom Pinfold, and historian Ruth Goodman. In the series, the team takes part in the medieval construction project at Guédelon CastleGuédelon Official Website in Treigny, France. During their stay there, they reveal what kind of skills and crafts were needed to build a castle in the 13th century, by using the techniques, tools and materials of the era."]}, {"page": "BBC historic farm series", "response": ["|valign=top| Ruth GoodmanPeter GinnAlex LanglandsStuart PeacheyChloe Spencer", "|valign=top| Ruth GoodmanPeter GinnAlex Langlands", "|valign=top| Ruth GoodmanPeter GinnAlex Langlands", "|valign=top| Ruth GoodmanPeter GinnAlex Langlands", "|valign=top| Ruth GoodmanPeter GinnTom Pinfold"]}, {"page": "Ginn, Peter", "response": ["#redirectPeter Ginn"]}]}}