{"wiki_id": "http://www.wikidata.org/entity/Q19957992", "itemLabel": "Louise Haigh", "itemDescription": "British politician (born 1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Louise_Haigh", "wikipedia_page": {"main": "Louise Margaret Haigh (born 22 July 1987) is a British Labour Party politician serving as the Shadow Secretary of State for Transport since 2021. She was elected as the Member of Parliament (MP) for Sheffield Heeley at the 2015 general election, as the youngest Labour member of that parliament. She served as Shadow Secretary of State for Northern Ireland from 2020 to 2021.", "link_mentions": [{"page": "Tony Lloyd", "response": ["In December 2019, he became the Shadow Secretary of State for Scotland, replacing Lesley Laird. Upon Sir Keir Starmer's election as Labour leader in spring 2020, Lloyd was replaced in this post by Ian Murray but continued as Shadow Secretary of State for Northern Ireland. Louise Haigh replaced him on an interim basis in April 2020 after he was admitted to hospital with coronavirus."]}, {"page": "Soft left", "response": ["*Louise Haigh"]}, {"page": "Sheffield Heeley (UK Parliament constituency)", "response": ["Sheffield Heeley is a constituency represented in the House of Commons of the UK Parliament since 2015 by Louise Haigh, a member of the Labour Party. It is located in the city of Sheffield, South Yorkshire.", "| Louise Haigh"]}, {"page": "Ben Wallace (politician)", "response": ["In February 2018, Wallace was criticised by political opponents for promoting unfounded smears on the leader of the Labour Party. The Sun newspaper had alleged that during the 1980s Jeremy Corbyn had colluded with a Communist spy. In response to the allegations, a spokesman for Corbyn stated that any suggestion that the Labour leader had been an agent, asset or informer was \"an entirely false and a ridiculous smear\". Amidst these allegations, Wallace was criticised for tweeting: \"'Jeremy has been interested in foreign policy issues his entire political career' [sic] – Labour MP Louise Haigh, BBC Daily Politics – yup so was Kim Philby\". Wallace later defended his tweet, and said he \"wasn't comparing, just saying that being interested in foreign policy isn't an answer to the allegations being made\". Wallace told Sky News: \"It was a light-hearted dig at Louise Haigh's excuse that Corbyn was interested in foreign affairs ... I was simply saying Kim Philby was also interested in foreign affairs\"."]}, {"page": "List of Parliamentary constituencies in South Yorkshire", "response": ["|Louise Haigh‡"]}, {"page": "List of United Kingdom MPs: H", "response": ["*Louise Haigh"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Louise Haigh, Sheffield Heeley, 2015–present"]}, {"page": "Shadow Secretary of State for Northern Ireland", "response": ["| Louise Haigh"]}, {"page": "Official Opposition frontbench", "response": ["| colspan=\"2\" |Louise Haigh", "| colspan=\"2\" |Louise Haigh", "Following a period of leave from the role, Tony Lloyd stood down as Shadow Northern Ireland Secretary on 28 April. He was succeeded by Louise Haigh, who was appointed to the position on an interim basis during his absence.", "Most members of the Shadow Cabinet had their portfolios changed, with Lisa Nandy moving from Foreign Affairs to Shadow Secretary of State for Levelling Up, Housing and Communities (A combination of Housing and Communities and Local Government). Ed Miliband became the revived portfolio of Shadow Secretary of State for Climate Change and Net Zero, with the Business and Industrial Strategy part of his former portfolio going to Jonathan Reynolds. David Lammy took on Foreign Affairs and was replaced as Shadow Lord Chancellor by Steve Reed. Nick Thomas-Symonds became Shadow Secretary of State for International Trade, replacing Emily Thornberry who became Shadow Attorney General for England and Wales. Bridget Phillipson became Shadow Secretary of State for Education, Wes Streeting became Shadow Secretary of State for Health and Social Care, Jonathan Ashworth became Shadow Secretary of State for Work and Pensions, Lucy Powell became Shadow Secretary of State for Digital, Culture, Media and Sport and Jim McMahon became Shadow Secretary of State for Environment, Food and Rural Affairs, Louise Haigh was made Shadow Secretary of State for Transport and Jo Stevens was made Shadow Secretary of State for Wales."]}, {"page": "Sheffield High School, South Yorkshire", "response": ["* Louise Haigh, Labour MP for the Sheffield Heeley constituency."]}, {"page": "Boris Johnson", "response": ["By resigning as foreign secretary, Johnson returned to the role of a backbench MP. In July, he delivered a resignation speech, stating that ministers were \"saying one thing to the EU about what we are really doing, and pretending another to the electorate\". Johnson added that \"it is not too late to save Brexit. We have time in these negotiations. We have changed tack once and we can change once again\". Buzzfeed reported Johnson had been in contact with Steve Bannon, Donald Trump's former chief adviser. In interviews, Bannon had praised Johnson and said he should challenge Theresa May for the party leadership. In January 2019, Johnson came under criticism for remarks he had made during the 2016 Leave campaign regarding the prospect of Turkish accession to the European Union; he denied making such remarks. In March 2019, Johnson said that expenditure on investigating historic allegations of child abuse, instead of more police on the streets, was money \"spaffed up the wall\". A victim, anti-abuse organisations, a police chief and Shadow police minister Louise Haigh strongly criticised this."]}]}}