{"wiki_id": "http://www.wikidata.org/entity/Q19974225", "itemLabel": "Hugh Seymour", "itemDescription": "politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Henry_John_Seymour", "wikipedia_page": {"main": "Lieutenant Colonel Hugh Henry John Seymour (25 September 1790 – 2 December 1821) was a British Army officer and a politician. He sat in the House of Commons of the United Kingdom from 1818 until his death.", "link_mentions": [{"page": "George Cholmondeley, 1st Marquess of Cholmondeley", "response": ["*Lady Charlotte Georgiana (d. 24 June 1828) married Lt.-Col. Hugh Henry Seymour, son of Adm. Lord Hugh Seymour, on 18 May 1818."]}, {"page": "Antrim (UK Parliament constituency)", "response": ["|Hugh Seymour", "* Note: Hugh Seymour was known as the Earl of Yarmouth from 25 August 1870."]}, {"page": "Lord Hugh Seymour", "response": ["Vice-Admiral Lord Hugh Seymour (29 April 1759 – 11 September 1801) was a senior British Royal Navy officer of the late 18th century who was the fifth son of Francis Seymour-Conway, 1st Marquess of Hertford and became known for being both a prominent society figure and a highly competent naval officer. He served during the American Revolutionary and French Revolutionary Wars and later in his career performed a period of shore duty on the Admiralty board.", "Hugh Seymour was born in 1759 into one of the wealthiest families in England, as the fifth son of Francis Seymour-Conway, 1st Marquess of Hertford, and his wife Isabella Fitzroy (Hugh retained the surname \"Seymour-Conway\" until his father's death in 1794, at which point he shortened it to Seymour). He was initially educated at Bracken's Academy in Greenwich, where he met lifelong friend John Willett Payne, before joining the Navy at age 11 at his own insistence. Seymour became a captain's servant on the yacht William & Mary,The Naval Chronicle, 1799 Vol. II, p. 359 and two years later moved to HMS Pearl under his relation Captain John Leveson-Gower, stationed off Newfoundland. After several short commissions, including service in the West Indies under George Rodney, Seymour was attached to HMS Alarm as a midshipman in the Mediterranean. Apart from a brief spell in HMS Trident, Seymour remained on her for several years, becoming a lieutenant in 1776. By 1776 the American Revolutionary War was underway, and Seymour continued in Alarm until he was made a commander in 1778, taking command of the xebec HMS Minorca.", "In May 1791 Hugh Seymour became president of the Hambledon Cricket Club, joining a band of like-minded Royal Navy Officers such as Captains Erasmus Gower, Robert Calder, Charles Powell Hamilton, Mark Robinson, Sir Hyde Parker and Robert Linzee.", "Seymour's death was widely mourned among his contemporaries, Lord St. Vincent once describing him as \"an excellent officer\". His service had been energetic and characterised by innovation and invention: he developed a new system of fitting topmasts and was also credited with making epaulettes standard among Royal Navy officers, following his difficulties in convincing French Royalists at the siege of Toulon that he was a British officer, due to his unimpressive uniform.Lord Hugh Seymour (1759–1801), National Maritime Museum, Retrieved 19 September 2008", "Baltra Island, or Isla Baltra, is a small island of the Galápagos Islands.  Also known as South Seymour (named after Lord Hugh Seymour)", "Hugh Seymour, Lord"]}, {"page": "Hugh Seymour", "response": ["Hugh Seymour may refer to:", "* Lord Hugh Seymour (1759–1801), British admiral", "* Hugh Seymour, 6th Marquess of Hertford (1843–1912)", "* Hugh Seymour, 8th Marquess of Hertford (1930–1997)"]}]}}