{"wiki_id": "http://www.wikidata.org/entity/Q20090539", "itemLabel": "Mike Dailly", "itemDescription": "video game designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Dailly_(game_designer)", "wikipedia_page": {"main": "Michael Dailly is a Scottish video game designer, best known for designing Lemmings and the original prototype of Grand Theft Auto, and being one of the four founders of DMA Design (now Rockstar North), alongside David Jones, Russell Kay, and Steve Hammond.Between 2010 and 2018, Dailly was working with YoYo Games as the lead developer of the GameMaker: Studio game engine.", "link_mentions": [{"page": "Lemmings (video game)", "response": ["Lemmings is a puzzle–strategy video game originally developed by DMA Design and published by Psygnosis for the Amiga in 1991 and later ported for numerous other platforms. The game was programmed by Russell Kay, Mike Dailly and David Jones, and was inspired by a simple animation that Dailly created while experimenting with Deluxe Paint.", "Mike Dailly, the first employee of DMA Design and one of the programmers for Lemmings, provided a detailed history of the development of the game entitled \"The Lemmings Story\" in 2006. David Jones, founder of DMA Design, has also commented on the development and success of Lemmings.", "left|thumb|The original Lemmings walk-cycle sprite animations from Mike Dailly (left) and Gary Timmons' improved version on the right. The animation was done using an 8×10 pixel space, with Timmons' version showing a less stiff walk cycle. The animation has eight frames and takes 0.8 seconds to complete one cycle.", "The original sales for Lemmings on the Amiga topped 55,000 copies on the first day of sales; in comparison, Menace sold 20,000 copies and Blood Money sold 40,000 copies cumulatively. With all ports included, Mike Dailly estimated that 15 million copies of Lemmings were sold between 1991 and 2006. In 2011, Luke Plunkett from Kotaku placed the figure at over 20 million, a figure which has been quoted as far back as 1997."]}, {"page": "Rockstar North", "response": ["Rockstar North Limited (formerly DMA Design Limited) is a British video game development company and a studio of Rockstar Games based in Edinburgh. The company was founded as DMA Design in Dundee in 1987 by David Jones, soon hiring former classmates Mike Dailly, Russell Kay, and Steve Hammond. During its early years, DMA Design was backed by its publisher Psygnosis, primarily focusing on Amiga, Atari ST and Commodore 64 games. During this time, they created successful shooters such as Menace, and Blood Money, but soon turned to platform games after the release of Lemmings in 1991, which was an international success and led to several sequels and spin-offs. After developing Unirally for Nintendo, DMA Design was set to become one of their main second-party developers, but this partnership ended after Nintendo's disapproval of Body Harvest.", "In 1984, David Jones, Russell Kay, Steve Hammond and Mike Dailly often met at the Kingsway Amateur Computer Club (KACC) in Dundee. While Jones used an Amiga 1000, the others used Sinclair Spectrum or Commodore 64. They developed numerous small games while attending the KACC: Jones and Kay developed Moonshadow (eventually renamed Zone Trooper), Daily developed Freek Out, and Jones and Dailly collaborated on The Game With No Name. When later attending the Dundee Institute of Technology, Jones began development on a game tentatively titled CopperCon1, working under the temporary name \"Acme Software\", alongside Kay, Hammond and Dailly. To publish the game, Jones first approached Hewson Consultants, where Andrew Braybrook played and recommended the game. When Jones was informed that Hewson wanted the game to be the \"Amiga version of Zynaps\", he realised that sales would be limited, and refused to sign the contract, instead signing a deal with publisher Psygnosis. The game was renamed Draconia, with Tony Smith working on graphics and Jones designing levels."]}, {"page": "Uniracers", "response": ["Shortly after the game's release, DMA Design was sued by Pixar for allegedly copying the unicycle design and concept from their 1987 short film Red's Dream. Mike Dailly, one of the developers at DMA Design, commented, \"The problem with Pixar was that they seemed to think that any computer generated unicycle was owned by them.\" DMA Design lost the lawsuit, and as a result, Nintendo had to terminate production of further Unirally cartridges. According to Dailly, \"The deal was that Nintendo wouldn't make any more carts so Unirally only sold the 300k initial run\". Fellow DMA Design developer Robbie Graham recalled, \"They took footage from Red's Dream and compared it to Unirally and the unicycles were virtually the same; this isn't a big surprise as there’s not a lot of ways you can bring life to a unicycle without looking like the one Pixar did. The judge - being the moron that he was - agreed.\""]}, {"page": "Grand Theft Auto", "response": ["Grand Theft Auto (GTA) is a series of action-adventure games created by David Jones and Mike Dailly. Later titles were developed under the oversight of brothers Dan and Sam Houser, Leslie Benzies and Aaron Garbut. It is primarily developed by British development house Rockstar North (formerly DMA Design), and published by its parent company, Rockstar Games. The name of the series references the term \"grand theft auto\", used in the United States for motor vehicle theft."]}, {"page": "Lemmings 2: The Tribes", "response": ["Mike Dailly, programmer at DMA Design, compared Lemmings 2 to its predecessor in 2015: \"Lemmings 2 was a different beast, the tech was much more complex, but designed to make console versions much better. I think it had too many skills, but the underlying tech was great. I was given the SNES version to do, and it was one of the most complex games I’ve had to write. Some complex internals that had to run quick on a 3.5Mhz chip. Tricky stuff – but fun!\""]}, {"page": "All New World of Lemmings", "response": ["Mike Dailly, programmer at DMA Design, recounted that \"Lemmings 3 was … more to end our commitment to Psygnosis than actually do a good game. The larger character size really spoiled it, but it was done like that because we had been approached by The Children's Television Workshop who wanted to use the character and the game; they wanted the characters to be bigger, and that really complicated things, and spoiled it. By the end of Lemmings 3, I think we were all ready to move on.\" DMA Design head David Jones similarly remarked, \"We needed a break for a while after Lemmings. Three years of hell.\" A 3DO Interactive Multiplayer version was announced to be in development and slated to be published by Psygnosis during E3 1995, however this port was never released for unknown reasons."]}, {"page": "Blood Money (video game)", "response": ["With Blood Money, Jones was determined to use the full colour range of the Amiga, opting to use the blitter as opposed to the hardware scrolling; the blitter allowed graphics to be drawn quickly. Tony Smith, who had worked on Menace, produced the graphics for Blood Money, while Jones began work on a new scrolling system. While developing his own game, Talisman, Mike Dailly created a compact method to move enemies on-screen, which Jones incorporated into Blood Money. The game's animations fascinated Jones' friend Gary Timmons, who then began experimenting with Deluxe Paint; his work on the program led to his employment at DMA Design, and inspired some of the animations used in DMA's next game, Walker (1993). The game's introduction required a star field, which Jones took from a quick demonstration that Dailly had been working on."]}, {"page": "List of best-selling video game franchises", "response": ["| colspan=\"3\" |Grand Theft Auto is an open-world action-adventure video game series created by David Jones and Mike Dailly; the later titles of which were created by brothers Dan and Sam Houser, Leslie Benzies and Aaron Garbut. It is primarily developed by Scottish developer Rockstar North and published by Rockstar Games, and consists of eleven stand-alone games and four expansion packs. Grand Theft Auto is the most successful video game franchise originating from the United Kingdom and is the best-selling action-adventure and open-world series. The most recent entry, Grand Theft Auto V, is the second best-selling video game of all time with over 155 million copies shipped."]}, {"page": "Michael Daly", "response": ["* Mike Dailly, solicitor", "* Mike Dailly (game designer), video game designer"]}, {"page": "Mike Dailly", "response": ["Mike Dailly is a prominent Scottish lawyer. Dailly is Principal Solicitor and Solicitor Advocate at Glasgow's Govan Law Centre and Govanhill Law Centre - free UK community legal resources."]}, {"page": "Grand Theft Auto (video game)", "response": ["An original design document, dated 22 March 1995, was posted online by Mike Dailly on 22 March 2011. The credited author of the document is K.R. Hamilton, and the released version is 1.05. It contained information about elements of the game discussed in various meetings held from 23 January 1995 to the writing of the document which also contains many similarities to the 1986 Commodore 64 Miami Vice.", "* Original Grand Theft Auto prototypes on Mike Dailly's homepage"]}, {"page": "Menace (video game)", "response": ["DMA Design was founded in 1987 by David Jones, Russell Kay, Steve Hammond and Mike Dailly, in Dundee, Scotland. Originally working under the name Acme Software, they began developing games for the Commodore 64 and Amiga. Jones began developing Menace under the working title CopperCon1, in his bedroom at his parents' house. He was attending the Dundee Institute of Technology at the time. To publish the game in 1988, Jones first approached Hewson Consultants, where Andrew Braybrook played the game and recommended it to Hewson. When Jones was informed that Hewson wanted the game to be the \"Amiga version of Zynaps\", he realised that sales would be limited, and refused to sign the contract; despite this, Hewson had already promoted the game in Popular Computing Weekly, before the deal was officially dropped. After signing a publishing deal with Psygnosis, Acme Software was renamed DMA Design."]}]}}