{"wiki_id": "http://www.wikidata.org/entity/Q20027838", "itemLabel": "Bethan Benwell", "itemDescription": "senior lecturer in English Language and Linguistics", "wikipedia_url": "https://en.wikipedia.org/wiki/Bethan_Benwell", "wikipedia_page": {"main": "Bethan Benwell (born 4 August 1971), is a British linguist. He has been a senior lecturer in English Language and Linguistics, for the Division of Literature and Languages, at the University of Stirling since 2008.She was co-investigator on an AHRC-funded project (2007–2010): Devolving Diasporas: Migration and Reception in Central Scotland, 1980–present with James Procter (Newcastle University), Gemma Robinson (University of Stirling), and Jackie Kay (Newcastle University).Her book, Discourse and Identity, which was co-authored with Elizabeth Stokoe, was nominated for the British Association for Applied Linguistics (BAAL) Book Prize in 2007.", "link_mentions": [{"page": "August 4", "response": ["*1971 – Bethan Benwell, English linguist, author, and academic"]}, {"page": "Discursive psychology", "response": ["The field itself was originally labeled as DP during the early 1990s by Derek Edwards and Potter at Loughborough University. It has since been developed and extended by a number of others, including (but by no means limited to): Charles Antaki, Malcolm Ashmore, Frederick Attenborough, Bethan Benwell, Steve Brown, Carly Butler, Derek Edwards, Alexa Hepburn, Eric Laurier, Hedwig te Molder, Sue Speer, Liz Stokoe, Cristian Tileaga, Sally Wiggins and Sue Wilkinson. Discursive psychology draws on the philosophy of mind of Gilbert Ryle and the later Ludwig Wittgenstein, the rhetorical approach of Michael Billig, the ethnomethodology of Harold Garfinkel, the conversation analysis of Harvey Sacks and the sociology of scientific knowledge of those like Mike Mulkay, Steve Woolgar and Bruno Latour. The term \"discursive psychology\" was designed partly to indicate that there was not just a methodological shift at work in this form of analysis, but also, and at the same time, that it involved some fairly radical theoretical rethinking."]}]}}