{"wiki_id": "http://www.wikidata.org/entity/Q2004530", "itemLabel": "Tony Hooper", "itemDescription": "British singer-songwriter (1939-2020)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Hooper", "wikipedia_page": {"main": "Anthony Hooper (14 September 1939 – 18 November 2020) was an English singer-songwriter and musician. He was best known as a founder-member of Strawbs together with Dave Cousins and double bassist Ron Chesterman. He left The Strawbs in 1972 after their album Grave New World, when it became obvious that the band was moving further away from its folk roots towards rock and progressive rock. He rejoined for a 10-year stint in 1983. Hooper had been the guitarist in the Ceilidh and barn dance band, Pitchfork, since 1986, and was also a member of Misalliance.\nHooper died on 18 November 2020, at the age of 81.", "link_mentions": [{"page": "Strawbs", "response": ["Although they started out in the 1960s as a bluegrass band, the band's repertoire shifted to favour their own (mainly Cousins') material.  While in Denmark in 1967, the Strawbs (Cousins, Tony Hooper and Ron Chesterman) with Sandy Denny recorded 13 songs for a proposed first album, All Our Own Work. It was apparently not issued in Denmark and the fledgling band could not get a UK record deal.  (Meanwhile, Denny left to join Fairport Convention and the album was forgotten until it was issued on Pickwick Hallmark in the UK in the mid-1970s.)"]}, {"page": "Shaun Davey", "response": ["Shaun Davey was born in Belfast in 1948 and attended Rockport School in County Down. He graduated from Trinity College, Dublin in the history of Art in 1971. He then took a master's degree at the Courtauld Institute of Art in London. In the late 1970s, he made his first recording, Davey and Morris, with James Morris, and guest artist Dónal Lunny, produced by Tony Hooper of The Strawbs. He worked as a composer of advertising jingles, including \"The Pride of the Herd\" for the National Dairy Council, 7up, Bank of Ireland and many more."]}, {"page": "Ceili Rain", "response": ["*Tony Hooper (May 1995 – 1997) — guitar, vocals"]}, {"page": "The Settlers (band)", "response": ["Like the Seekers, the group also included a double bassist. The original bassist, Mansel Davies, left in 1965 to pursue a career in teaching and was replaced by Geoff Srdzinski (born Geoffrey Srodzinski, 10 June 1946, Plymouth, Devon), who shared accommodation in Hampstead, London, with Tony Hooper of Strawbs. Hooper's song \"Always on My Mind\" was released as a single by the Settlers early in 1967.."]}, {"page": "From the Witchwood", "response": ["*Tony Hooper – lead vocals, backing vocals, acoustic guitar, autoharp, tambourine"]}, {"page": "Just a Collection of Antiques and Curios", "response": ["The band line-up had changed from the previous album, Dragonfly. Only founder-members Dave Cousins and Tony Hooper remained; with double bass player Ron Chesterman and cellist Claire Deniz having departed the band, and bassist John Ford, drummer Richard Hudson, and keyboardist Rick Wakeman having joined.", "#\"Forever\" (Cousins, Tony Hooper) – 3:32", "*Tony Hooper – vocals, acoustic guitar, tambourine"]}, {"page": "Dragonfly (Strawbs album)", "response": ["*Tony Hooper – Vocals, Acoustic & Electric Guitars, Tambourine, Percussion "]}, {"page": "Grave New World", "response": ["The album depicts the story of one man's life. For instance, the track \"Hey Little Man\" represents an older man giving advice to his young son. The songs themselves show the continuation of the movement away from Strawbs' original folk leanings. Founding member Tony Hooper began to be increasingly uncomfortable with this and left after the recording sessions of this album.", "#\"Tomorrow\" (Cousins, Tony Hooper, Ford, Blue Weaver, Richard Hudson) – 4:49", "\"I'm Going Home\" originally appeared on Dave Cousins's solo album Two Weeks Last Summer. This track is the first occasion on which Dave Lambert recorded with the band. He had occasionally been appearing on stage for encores, but after this album and the departure of Tony Hooper, Lambert joined the band full-time.", "*Tony Hooper – lead vocals, backing vocals, acoustic guitar, autoharp, tambourine", "Produced by Dave Cousins, Richard Hudson, John Ford, Blue Weaver and Tony Hooper"]}, {"page": "Bursting at the Seams", "response": ["Bursting at the Seams is the 5th studio album by English band Strawbs. It was the first album to be released after the departure of founder member Tony Hooper and the recruitment of Dave Lambert. It contains their two most successful singles and reached number 2 in the UK Album ChartUK Top 40 Hit Database   everyHit.com. retrieved on December 16, 2008 and number 65 in Canada."]}, {"page": "Strawbs (album)", "response": ["*Tony Hooper – guitars, lead and backing vocals"]}, {"page": "Dave Lambert (English musician)", "response": ["Lambert then joined Cousins in Strawbs on guitar and vocals later in 1972, replacing Tony Hooper, and playing on the album Bursting at the Seams, which reached number two in the UK Albums Chart, the album including Lambert's song \"The Winter and the Summer\". In 1973 Lambert and founding member Dave Cousins started a new line-up of the band that continued until they split up in 1978. He subsequently worked as a songwriter in partnership with Chas Cronk, recorded as a solo artist and spent time working as a ski instructor. Lambert rejoined Strawbs in the 1980s and is still a member of the band.  In 2006 he was part of a briefly-reformed Fire."]}, {"page": "Benedictus (Strawbs song)", "response": ["The B-side is a John Ford composition \"Keep the Devil Outside\", sung by Tony Hooper. The track was recorded at the same time as the album From the Witchwood and was originally released as the B-side of the single \"Witchwood\". This single was quickly withdrawn due to the band's dissatisfaction with the quality of the pressing.", "*Tony Hooper – backing vocals, acoustic guitar"]}, {"page": "Here It Comes (song)", "response": ["*Tony Hooper – backing vocals, acoustic guitar, percussion"]}, {"page": "Don't Say Goodbye (album)", "response": ["*Tony Hooper – lead vocals, backing vocals, acoustic guitar"]}, {"page": "Strawberry Sampler Number 1", "response": ["Strawberry Sampler Number 1 is a studio album by English band Strawbs. It was originally released as a publisher's demonstration record, intended to advertise Dave Cousins's and Tony Hooper's songs to other artists. Most of the songs were re-recorded by the band on later albums (\"Ah Me, Ah My\" was used unchanged on the Grave New World album).", "#\"Ah Me, Ah My\" (Tony Hooper) – 1:22", "*Tony Hooper – lead vocals, backing vocals, acoustic guitar"]}, {"page": "Forever (Strawbs song)", "response": ["\"Forever\" is a song by English band Strawbs written by Dave Cousins and Tony Hooper. It did not feature on any of their studio albums at the time but was included as a bonus track on the CD re-release of the albums Just a Collection of Antiques and Curios and Dragonfly.", "*Tony Hooper – backing vocals, acoustic guitar, percussion", "Category:Songs written by Tony Hooper"]}, {"page": "The Man Who Called Himself Jesus", "response": ["*Tony Hooper – backing vocals, acoustic guitar, percussion"]}, {"page": "All Our Own Work", "response": ["#\"Always on My Mind\" (Tony Hooper) – 1:51", "*Tony Hooper – lead vocals, backing vocals, acoustic guitar"]}, {"page": "Ringing Down the Years", "response": ["*Tony Hooper – backing vocals, acoustic guitar"]}, {"page": "Oh How She Changed", "response": ["\"Oh How She Changed\" is a song by English band Strawbs written by Dave Cousins and Tony Hooper. It was the first single to be released by Strawbs and later appeared on their 1969 album Strawbs. An alternative mix of the song appears on the 2006 box set A Taste of Strawbs and a re-working on 2009's Dancing to the Devil's Beat.", "*Tony Hooper – vocals, acoustic guitar, percussion", "Category:Songs written by Tony Hooper"]}, {"page": "Ron Chesterman", "response": ["Ronald George Arthur Chesterman (27 November 1939 – 16 March 2007) was an English musician and archivist. He is best known as the original double bass player with The Strawberry Hills Boys, starring Dave Cousins on guitar, dulcimer, banjo and vocals, Tony Hooper on guitar and vocals and Ron himself on double bass. They kept that name from 1964 when they formed until June 1967, when they were giving a concert and needed to put the name of the band on stage, so they became The Strawbs. Later, after he left the band, he became a county archivist in Chester.", "* Songs of Ireland (1966) - With David Cousins on banjo, Denny Wright on guitar, Jack Fallon on bass, Steve Benbow on guitar and vocals and The Strawberry Hills Boys : David Cousins, Tony Hooper and Ron Chesterman on backing vocals. Monitor MFS LP MFS 447 Label.", "*Of a time (2012) - With John Paul Jones, Nicky Hopkins, Tony Hooper, etc. "]}]}}