{"wiki_id": "http://www.wikidata.org/entity/Q20032074", "itemLabel": "Susan Speer", "itemDescription": "British psychologist and academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Susan_Speer", "wikipedia_page": {"main": "Susan \"Sue\" Speer C.Psychol, FHEA is a senior lecturer at the School of Psychological Sciences, University of Manchester.From 2005 to 2006 Speer was an ESRC-SSRC collaborative visiting fellow in the department of sociology at the University of California at Los Angeles (UCLA).", "link_mentions": [{"page": "Speer", "response": ["*Susan Speer, a British psychologist"]}, {"page": "Language and gender", "response": ["In methodological terms, there is no single approach that could be said to 'hold the field'. Discursive, poststructural, ethnomethodological, ethnographic, phenomenological, positivist and experimental approaches can all be seen in action during the study of language and gender, producing and reproducing what Susan Speer has described as 'different, and often competing, theoretical and political assumptions about the way discourse, ideology and gender identity should be conceived and understood'. As a result, research in this area can perhaps most usefully be divided into two main areas of study: first, there is a broad and sustained interest in the varieties of speech associated with a particular gender; also a related interest in the social norms and conventions that (re)produce gendered language use (a variety of speech, or sociolect associated with a particular gender which is sometimes called a genderlect). Second, there are studies that focus on ways language can produce and maintain sexism and gender bias, and studies that focus on the contextually specific and locally situated ways in which gender is constructed and operationalized. In this sense, researchers try to understand how language affects the gender binary in society and how it helps to create and support the male-female division."]}, {"page": "Susan A. Speer", "response": ["#REDIRECT Susan Speer"]}, {"page": "Sue Speer", "response": ["#REDIRECT Susan Speer"]}]}}