{"wiki_id": "http://www.wikidata.org/entity/Q20054055", "itemLabel": "Ian Crawford", "itemDescription": "British planetary scientist and astrobiologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Crawford_(astrobiologist)", "wikipedia_page": {"main": "Ian Andrew Crawford  (born 1961) is a British professor of planetary science and astrobiology at Birkbeck, University of London in the United Kingdom.", "link_mentions": [{"page": "Nataraja", "response": ["According to Ian Crawford, professor of planetary science at University of London, the cosmic dance of Shiva as Nataraja represents particle physics, entropy and the dissolution of the universe."]}, {"page": "List of people associated with University College London", "response": ["* Ian Crawford – Professor of Planetary Science and Astrobiology, Birkbeck University of London"]}, {"page": "Hyperspace (book)", "response": ["Reviewing the book for The Observatory in 1996, Ian Crawford was quite negative; noting that he \"was disappointed with this book\". He criticized \"low level of basic scholarship\" visible in poor referencing standards, occasional if minor errors, and unwarranted \"sweeping generalizations\". He also noted that wile the book author is acknowledged to be an expert on superstrings, he found the book discussion of this concept quite lacking."]}, {"page": "North Cestrian School", "response": ["* Ian Crawford (astrobiologist)  "]}, {"page": "Dirk Schulze-Makuch", "response": ["With Ian Crawford he proposed that microbial life may have existed temporarily on Earth´s Moon, at a time of major volcanic outgassing about 3.5 billion years ago."]}, {"page": "Initiative for Interstellar Studies", "response": ["* Dr Ian Crawford, Professor of Planetary Science and Astrobiology at the Department of Earth and Planetary Sciences, Birkbeck College, University of London is a member of the Advisory Council of the i4is"]}, {"page": "Ian Crawford", "response": ["Ian Crawford may refer to:", "* Ian Crawford (astrobiologist) (born 1961), professor of planetary science and astrobiology", "* Ian Crawford (cricketer) (born 1954), English cricketer", "* Ian Crawford (economist), professor of economics", "* Ian Crawford (footballer) (1934–2007), Scottish football player and coach", "* Ian Crawford (musician) (born 1989), American musician from Auburn, Washington", "* Ian Crawford (admiral) (born 1930), see List of Australian admirals"]}, {"page": "List of people associated with Birkbeck, University of London", "response": ["* Ian Crawford, Professor of Planetary Science and Astrobiology"]}, {"page": "Katherine Joy", "response": ["Joy was educated at Sackville School, East Grinstead and studied geology at Royal Holloway, University of London where she graduated with first class honours in 2003. Joy was a doctoral student at University College London working on the evolution of the moon supervised by Ian Crawford. Her work considered sample analysis and remote sensing. She held a joint position at the Natural History Museum, London. She was part of the European Space Agency (ESA) SMART-1 mission. In 2006 Joy joined Birkbeck, University of London where she used the Demonstration of a Compact Imaging X-ray Spectrometer (D-CIXS) instrument, part of the SMART-1 mission, to study X-ray fluorescence from lunar samples. D-CIXS was designed by the Rutherford Appleton Laboratory (RAL) and could measure elemental abundances of magnesium, aluminium and silicon.  Her work has used data from the Mercury Imaging X-ray Spectrometer (MIXS) on the BepiColombo Mercury Planetary Orbiter (MPO)."]}]}}