{"wiki_id": "http://www.wikidata.org/entity/Q20018", "itemLabel": "George Biddell Airy", "itemDescription": "English mathematician and astronomer", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Biddell_Airy", "wikipedia_page": {"main": "Sir George Biddell Airy  (; 27 July 1801 – 2 January 1892) was an English mathematician and astronomer, and the seventh Astronomer Royal from 1835 to 1881. His many achievements include work on planetary orbits, measuring the mean density of the Earth, a method of solution of two-dimensional problems in solid mechanics and, in his role as Astronomer Royal, establishing Greenwich as the location of the prime meridian. His reputation has been tarnished by allegations that, through his inaction, Britain lost the opportunity to discover the planet Neptune.", "link_mentions": [{"page": "Augustin-Jean Fresnel", "response": ["In 1826, the British astronomer John Herschel, who was working on a book-length article on light for the Encyclopædia Metropolitana, addressed three questions to Fresnel concerning double refraction, partial reflection, and their relation to polarization. The resulting article, titled simply \"Light\", was highly sympathetic to the wave theory, although not entirely free of selectionist language. It was circulating privately by 1828 and was published in 1830.Buchwald, 1989, pp. 291–6; Darrigol, 2012, pp. 220–21,303. Meanwhile, Young's translation of Fresnel's De la Lumière was published in installments from 1827 to 1829.Fresnel, 1822a; Kipnis, 1991, pp. 227–8. George Biddell Airy, the former Lucasian Professor at Cambridge and future Astronomer Royal, unreservedly accepted the wave theory by 1831.Buchwald, 1989, p. 296. In 1834 he famously calculated the diffraction pattern of a circular aperture from the wave theory, thereby explaining the limited angular resolution of a perfect telescope . By the end of the 1830s, the only prominent British physicist who held out against the wave theory was Brewster, whose objections included the difficulty of explaining photochemical effects and (in his opinion) dispersion.Darrigol, 2012, pp. 222–3,248."]}, {"page": "Astronomer Royal", "response": ["| 7. || 100px || Sir George Biddell Airy || 1835 || 1881 || "]}, {"page": "Charles Babbage", "response": ["From 1828 to 1839, Babbage was Lucasian Professor of Mathematics at Cambridge. Not a conventional resident don, and inattentive to his teaching responsibilities, he wrote three topical books during this period of his life. He was elected a Foreign Honorary Member of the American Academy of Arts and Sciences in 1832. Babbage was out of sympathy with colleagues: George Biddell Airy, his predecessor as Lucasian Professor of Mathematics at Trinity College, Cambridge,George Biddell Airy#Biography thought an issue should be made of his lack of interest in lecturing. Babbage planned to lecture in 1831 on political economy. Babbage's reforming direction looked to see university education more inclusive, universities doing more for research, a broader syllabus and more interest in applications; but William Whewell found the programme unacceptable. A controversy Babbage had with Richard Jones lasted for six years. He never did give a lecture.", "Babbage's machines were among the first mechanical computers. That they were not actually completed was largely because of funding problems and clashes of personality, most notably with George Biddell Airy, the Astronomer Royal."]}, {"page": "Geodesy", "response": ["* George Biddell Airy 1801–1892, Cambridge & London"]}, {"page": "January 2", "response": ["*1892 – George Biddell Airy, English mathematician and astronomer (b. 1801)"]}, {"page": "Kerguelen Islands", "response": ["In 1874–1875, British, German, and U.S. expeditions visited Kerguelen to observe the transit of Venus. For the 1874 transit, George Biddell Airy of the U.K. Royal Observatory organised and equipped five expeditions to different parts of the world. Three of these were sent to the Kerguelen Islands and led by Stephen Joseph Perry, who set up his main observation station at Observatory Bay and two auxiliary stations, one at Thumb Peak led by Sommerville Goodridge, and the second at Supply Bay, led by Cyril Corbet. Observatory Bay was also used by the German Antarctic Expedition, led by Erich Dagobert von Drygalski in 1902–1903. In January 2007, an archaeological excavation was carried out at this site."]}, {"page": "Luminiferous aether", "response": ["* The experiment of François Arago (1810), to confirm whether refraction, and thus the aberration of light, is influenced by Earth's motion. Similar experiments were conducted by George Biddell Airy (1871) by means of a telescope filled with water, and Éleuthère Mascart (1872)."]}, {"page": "Planets beyond Neptune", "response": ["Even before Neptune's discovery, some speculated that one planet alone was not enough to explain the discrepancy. On 17 November 1834, the British amateur astronomer the Reverend Thomas John Hussey reported a conversation he had had with French astronomer Alexis Bouvard to George Biddell Airy, the British Astronomer Royal. Hussey reported that when he suggested to Bouvard that the unusual motion of Uranus might be due to the gravitational influence of an undiscovered planet, Bouvard replied that the idea had occurred to him, and that he had corresponded with Peter Andreas Hansen, director of the Seeberg Observatory in Gotha, about the subject. Hansen's opinion was that a single body could not adequately explain the motion of Uranus, and postulated that two planets lay beyond Uranus."]}, {"page": "William Thomson, 1st Baron Kelvin", "response": ["During the 1880s, Thomson worked to perfect the adjustable compass to correct errors arising from magnetic deviation owing to the increased use of iron in naval architecture. Thomson's design was a great improvement on the older instruments, being steadier and less hampered by friction. The deviation due to the ship's magnetism was corrected by movable iron masses at the binnacle. Thomson's innovations involved much detailed work to develop principles identified by George Biddell Airy and others, but contributed little in terms of novel physical thinking. Thomson's energetic lobbying and networking proved effective in gaining acceptance of his instrument by The Admiralty."]}, {"page": "1801", "response": ["* July 27 – George Biddell Airy, English mathematician, astronomer (d. 1892)"]}, {"page": "1871", "response": ["** George Biddell Airy presents his discovery that astronomical aberration is independent of the local medium."]}, {"page": "1892", "response": ["* January 2 – Sir George Biddell Airy, English astronomer royal (b. 1801)"]}, {"page": "Gravitational constant", "response": ["Measurements with pendulums were made by Francesco Carlini (1821, ), Edward Sabine (1827, ), Carlo Ignazio Giulio (1841, ) and George Biddell Airy (1854, )."]}, {"page": "Royal Observatory, Greenwich", "response": ["In the early 19th century, the main positional devices were the Troughton Transit instrument and a mural circle, but after George Biddell Airy took over as Astronomer Royal in 1835, he embarked on a plan to have better instruments at Greenwich observatory."]}, {"page": "Soliton", "response": ["Scott Russell's experimental work seemed at odds with Isaac Newton's and Daniel Bernoulli's theories of hydrodynamics. George Biddell Airy and George Gabriel Stokes had difficulty accepting Scott Russell's experimental observations because they could not be explained by the existing water wave theories.  Their contemporaries spent some time attempting to extend the theory but it would take until the 1870s before Joseph Boussinesq and Lord Rayleigh published a theoretical treatment and solutions.Lord Rayleigh published a paper in Philosophical Magazine in 1876 to support John Scott Russell's experimental observation with his mathematical theory. In his 1876 paper, Lord Rayleigh mentioned Scott Russell's name and also admitted that the first theoretical treatment was by Joseph Valentin Boussinesq in 1871. Joseph Boussinesq mentioned Russell's name in his 1871 paper. Thus Scott Russell's observations on solitons were accepted as true by some prominent scientists within his own lifetime of 1808–1882. In 1895 Diederik Korteweg and Gustav de Vries provided what is now known as the Korteweg–de Vries equation, including solitary wave and periodic cnoidal wave solutions.Korteweg and de Vries did not mention John Scott Russell's name at all in their 1895 paper but they did quote Boussinesq's paper of 1871 and Lord Rayleigh's paper of 1876. The paper by Korteweg and de Vries in 1895 was not the first theoretical treatment of this subject but it was a very important milestone in the history of the development of soliton theory."]}, {"page": "List of astronomers", "response": ["| George Biddell Airy || UK || 1801 || 1892", "*George Biddell Airy (UK, 1801–1892)"]}]}}