{"wiki_id": "http://www.wikidata.org/entity/Q20031044", "itemLabel": "Densign White", "itemDescription": "British judoka", "wikipedia_url": "https://en.wikipedia.org/wiki/Densign_White", "wikipedia_page": {"main": "Densign White  (born 21 December 1961) is a male retired British judoka. White competed at the 1984, 1988 and the 1992 Summer Olympics. He represented England and won a gold medal in the 86kg middleweight category, at the 1990 Commonwealth Games in Auckland, New Zealand.White is married to Tessa Sanderson. He was appointed Member of the Order of the British Empire (MBE) in the 2020 Birthday Honours for services to diversity in sport as chair of Sporting Equals.", "link_mentions": [{"page": "Tessa Sanderson", "response": ["On 3 May 2010, she married Densign White, a former Olympic judo athlete, at St. Paul's Cathedral in London. Her bridesmaids were her fellow Olympic teammates Sharron Davies, Kelly Holmes and Christine Ohuruogu. Sanderson unsuccessfully received In vitro fertilisation treatment three times before she was 50. In 2013, she and White started fostering four-month-old twins, Cassius and Ruby Mae, and the couple adopted the twins the following year, when Sanderson was aged 58. Her nephew, Dion Sanderson, is a footballer who made his debut for Wolverhampton Wanderers in October 2019."]}, {"page": "David Starbrook", "response": ["Starbrook took up judo at the late age of 19. He is the author of the book Judo, Starbrook style. He lives in France where he continues to practise and coach judo. His son, Leon, is also a judoka. In November 2007 at the Judo World Cup in Birmingham he was awarded his 9th Dan by Densign White, chairman of the British Judo Association."]}, {"page": "1987 World Judo Championships", "response": ["| Masao Murata   Densign White"]}, {"page": "1991 European Judo Championships", "response": ["| 5.||Densign White||"]}, {"page": "1990 European Judo Championships", "response": ["| Densign White  Fabien Canu", "|bgcolor=CC9966 | 3.||Densign White||"]}, {"page": "Judo at the 1984 Summer Olympics – Men's 86 kg", "response": ["| 5T || align=\"left\"| Densign White|| align=\"left\"| "]}, {"page": "Judo at the 1988 Summer Olympics – Men's 86 kg", "response": ["| 5T || align=\"left\"| Densign White|| align=\"left\"| "]}, {"page": "Judo at the 1992 Summer Olympics – Men's 86 kg", "response": ["| 17T || align=\"left\"| Densign White|| align=\"left\"| "]}, {"page": "1989 European Judo Championships", "response": ["| 5. || Densign White || "]}, {"page": "England at the 1990 Commonwealth Games", "response": ["|Densign White\t        ||86kg middleweight ||1 x gold"]}, {"page": "List of World Judo Championships medalists", "response": ["| rowspan=2|  Fabien Canu ||  Pak Jong-Chol ||  Masao Murata ||  Densign White"]}, {"page": "2020 Birthday Honours", "response": ["* Densign White — Chair, Sporting Equals. For services to Diversity in Sport"]}]}}