{"wiki_id": "http://www.wikidata.org/entity/Q2018757", "itemLabel": "John William Heslop-Harrison", "itemDescription": "British botanist (1881-1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_William_Heslop-Harrison", "wikipedia_page": {"main": "Prof John William Heslop Harrison, FRS FRSE (1881–1967), was Professor of Botany at King's College, Durham University (now Newcastle University). He enjoyed a brilliant career, specialising in the genetics of moths, but is now best remembered for an alleged academic fraud.", "link_mentions": [{"page": "Lamarckism", "response": ["| John William Heslop-Harrison || 1920s || Peppered moths exposed to soot || Inherited mutations caused by soot || Failure to replicate results; implausible mutation rate: \"During the 1920s, the entomologist J. W. Heslop-Harrison published experimental data supporting his claim that chemicals in soot caused widespread mutations from light winged to the dark winged form. Because these mutations were supposedly passed on to subsequent generations, Harrison claimed that he had documented a case of inheritance of acquired traits. Other biologists failed to replicate Harrison's results, and R. A. Fisher pointed out that Harrison's hypothesis required a mutation rate far higher than any previously reported.\""]}, {"page": "Rùm", "response": ["A tree nursery was established at Kinloch in 1960 in order to support a substantial programme of re-introducing twenty native species including silver birch, hawthorn, rowan and holly.Ball. M.E. \"Botany, Woodland and Forestry\" in Clutton-Brock and Ball (1987) page 57. The forested area, which consists of over a million re-introduced native trees and shrubs, is essentially confined to the vicinity of Kinloch and the slopes near this site surrounding Loch Scresort and on nearby Meall á Ghoirtein. The island's flora came to widespread attention with the 1999 publication of the book A Rum Affair by Karl Sabbagh, a British writer and television producer. The book told of a long-running scientific controversy over the alleged discovery of certain plants on Rùm by botanist John William Heslop-Harrison—discoveries that are now considered to be fraudulent. Heslop Harrison is widely believed to have placed many of these plants on the island himself to provide evidence for his theory about the geological development of the Hebridean islands.Sabbagh, Karl (1999) Nonetheless, the native flora offers much of interest. There are rare arctic sandwort and alpine pennycress, endemic varieties of the heath spotted-orchid and eyebright, as well as more common species such as sundew, butterwort, blue heath milkwort and roseroot. A total of 590 higher plant and fern taxa have been recorded.Ball. M.E. \"Botany, Woodland and Forestry\" in Clutton-Brock and Ball (1987) page 48."]}, {"page": "Jack Heslop-Harrison", "response": ["He was born in Middlesbrough to John William Heslop-Harrison and his wife Christian Henderson, the last of three children. His older brother was George Heslop-Harrison."]}, {"page": "Peppered moth evolution", "response": ["John William Heslop-Harrison (1920) rejected Tutt's differential bird predation hypothesis, on the basis that he did not believe that birds ate moths. Instead he advocated the idea that pollutants could cause changes to the soma and germ plasm of the organism. This hypothesis probably has its roots in the 1890s, when it was proposed as a form of Lamarckism. It is important to note its historical context."]}, {"page": "John William Heslop Harrison", "response": ["#REDIRECT John William Heslop-Harrison"]}, {"page": "Heslop-Harrison", "response": ["*John William Heslop-Harrison (1881–1967), British academic"]}, {"page": "Cyril Offord", "response": ["In 1946 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Sir Edmund Whittaker, John William Heslop-Harrison, Alexander Aitken and Alfred Dennis Hobson. He was elected a Fellow of the Royal Society of London in 1952."]}, {"page": "Heslop", "response": ["*John William Heslop-Harrison FRSE (1881–1967), British biologist, father of..."]}, {"page": "John Heslop-Harrison", "response": ["#REDIRECT John William Heslop-Harrison"]}, {"page": "Karl Sabbagh", "response": ["*A Rum Affair: A True Story Of Botanical Fraud (1999) (about the botanical fraud perpetrated by John William Heslop-Harrison)"]}, {"page": "List of fellows of the Royal Society G, H, I", "response": ["| John William Heslop-Harrison||10/05/1928||22 January 1881 – 23 January 1967"]}, {"page": "Template talk:Botanist/Archive 1", "response": ["::::::Maybe not. John William Heslop-Harrison just lost its  template, apparently in an attempt to fix the ref error. Rl (talk) 14:32, 3 February 2009 (UTC)"]}, {"page": "List of fellows of the Royal Society elected in 1928", "response": ["*John William Heslop-Harrison"]}, {"page": "List of botanists by author abbreviation (H)", "response": ["* Hesl.-Harr. – John William Heslop-Harrison (1881–1967)"]}, {"page": "Philip G. Fothergill", "response": ["*Historical Aspects of Organic Evolution [foreword by John William Heslop-Harrison]  (1952)"]}, {"page": "William Andrew Clark", "response": ["He married Helena Heslop-Harrison, daughter of John William Heslop-Harrison FRSE in 1941."]}, {"page": "George Heslop-Harrison", "response": ["He was born in 1911 the son of John William Heslop-Harrison and his wife, Christian Watson Henderson. His younger brother was Jack Heslop-Harrison. George studied at Durham University graduating BSc in 1932. He received a doctorate (PhD) in 1934.", "In 1947 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Alfred Hobson, Robert Wheldon, his father John William Heslop-Harrison and Meirion Thomas. Durham University awarded him a further honorary doctorate (DSc) in 1961."]}, {"page": "Alexander David Peacock", "response": ["In 1923 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Sir James Hartley Ashworth, John William Heslop-Harrison, George Leslie Purser, and John Stephenson. He won the Society's Keith Prize for the period 1953 to 1955."]}, {"page": "R. W. Wheldon", "response": ["In 1943 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were John William Heslop-Harrison, Alfred Hobson, Sir Godfrey Thomson, and Max Born."]}, {"page": "Carex bicolor", "response": ["Carex bicolor was one of several species of plant not previously known in Britain, that were \"discovered\" growing on the island of Rùm in the Inner Hebrides in the 1940s by the botanist John William Heslop-Harrison, Professor of Botany at Durham University. These discoveries added to his reputation, but were later cast into doubt after investigations by classical scholar and botanist John Raven, who found that some of the plants were not present on the island at all, while others had been recently planted there; it is now considered that the claim that the plants were indigenous to Rùm was fraudulent.\"Botanist John Heslop Harrison faked rare plant discoveries\". Alastair Jamieson, The Daily Telegraph, 2 October 2008."]}]}}