{"wiki_id": "http://www.wikidata.org/entity/Q2018197", "itemLabel": "David Moule-Evans", "itemDescription": "English composer and conductor", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Moule-Evans", "wikipedia_page": {"main": "David Moule-Evans (21 November 1905 – 18 May 1988) was an English composer, conductor and academic.\nMoule-Evans was born in Ashford, Kent, and was educated at the Judd School in Tonbridge before studying at the Royal College of Music in London with Malcolm Sargent and Herbert Howells. While at the Royal College he became friendly with his contemporary Michael Tippett, beating him to gain the Mendelssohn Scholarship in 1928 and continuing studies at Queen's College, Oxford. Tippett asked him to conduct the first full concert of his own music at the Barn Theatre in Oxted on 5 April 1930. From 1945 to 1974 Moule-Evans returned to the RCM to teach harmony, counterpoint and composition.\nAs a composer Moule-Evans has been largely forgotten today, but during his lifetime he achieved a measure of success. His Concerto for String Orchestra won the Carnegie British Music award in 1928. The Dance Suite, scored for full orchestra with piano, five percussion players and timpani, was completed in December 1930 and received its first performance at a Royal College of Music Patrons' Fund Concert in March, 1931. He was one of several composer contributors (alongside Ralph Vaughan Williams, William Cole, Julian Gardiner and John Tilehurst) to the 1938 Dorking pageant play England's Pleasant Land, written by E.M. Forster. His Symphony in G (1944) was the controversial £1,000 prizewinner of the Australian International Jubilee Symphony Competition of 1951 with The Musical Times and others claiming that the runner up, a symphony by Robert Hughes, was \"definitely superior\". (Malcolm Sargent revived the work in the UK for a Royal Festival Hall performance by the London Symphony Orchestra in 1952, but to mixed reviews, the Musical Times dismissing it as \"conventional, banal and boring\").The orchestral poem September Dusk was premiered at the BBC Proms on 25 August 1945. Moule-Evans mostly wrote in a popular, straightforward \"light music\" style, although the composer Michael Hurd has commented that his later chamber works, including the Violin Sonata in F-sharp minor (1956) and the Piano Sonata (1966) are more adventurous in style. The only music currently available in recorded form are the soundtracks to a series of British Council documentary films commissioned by Muir Mathieson, including Health of a Nation and London 1942.Moule-Evans married Monica Warden Evans in March 1935  and the couple lived at Claremont, 10 Rose Hill, Dorking in Surrey. Illness cut short his composing career from 1968, although he continued to teach until his death in 1988. His archive and manuscripts are housed in the National Library of Wales.", "link_mentions": [{"page": "Dorking", "response": ["* Composer David Moule-Evans (1905–1988) collaborated with Vaughan Williams on the pageant play England's Pleasant Land, written by E.M. Forster, which was first performed in Dorking in 1938."]}, {"page": "The Queen's College, Oxford", "response": ["* David Moule-Evans, twentieth-century English composer"]}, {"page": "Michael Tippett", "response": ["In February 1930 Tippett provided the incidental music for a performance by his theatrical group of James Elroy Flecker's Don Juan, and in October he directed them in his own adaptation of Stanford's opera The Travelling Companion. His compositional output was such that on 5 April 1930 he gave a concert in Oxted consisting entirely of his own works—a Concerto in D for flutes, oboe, horns and strings; settings for tenor of poems by Charlotte Mew; Psalm in C for chorus and orchestra, with a text by Christopher Fry; piano variations on the song \"Jockey to the Fair\"; and a string quartet.Bowen, pp. 19–20 Professional soloists and orchestral players were engaged, and the concert was conducted by David Moule-Evans, a friend from the RCM. Despite encouraging comments from The Times and the Daily Telegraph, Tippett was deeply dissatisfied with the works, and decided that he needed further tuition. He withdrew the music, and in September 1930 re-enrolled at the RCM for a special course of study in counterpoint with R. O. Morris, an expert on 16th-century music. This second RCM period, during which he learned to write fugues in the style of Bach and received additional tuition in orchestration from Gordon Jacob, was central to Tippett's eventual discovery of what he termed his \"individual voice\"."]}, {"page": "The Judd School", "response": ["Former pupils notable for their military careers are: Neville Duke, a World War Two fighter pilot; Donald Hodge, one of the last surviving veterans of the First World War; and Terence Lewin, former Chief of the Defence Staff and Admiral of the Fleet. Sportsmen alumni include: professional rugby player Martin Purdy; former captain of the Kent County Cricket Club David Fulton; athlete Steven Fennell; and swimmer Xander Alari-Williams. Other notable former students are: Cecil Frank Powell, winner of a Nobel Prize in physics;Taylor (1988), p. 115 Humphrey Burton, former head of BBC Music; composer David Moule-Evans;Who Was Who (OUP), online entry (2007)  Royal portrait painter Bernard Hailstone;Taylor (1988), p. 91 Ronald Ralph Williams, former Bishop of Leicester; and Guy Hands, chief executive officer of Terra Firma Capital Partners. Tom Greatrex MP and Shadow Scotland Office Minister, who represented the constituency of Rutherglen & Hamilton West, attended Judd between 1986 and 1993, Laurence Moss; founder and CEO of Greedy Growth."]}, {"page": "William Sharp (writer)", "response": ["The poems of Fiona Macleod attracted the attention of composers in the first half of the 20th Century as part of the Celtic Twilight movement in the UK and the US.Buchan, Matthew. Celtic Twilight's Immortal Hour in British History, Literature, Music, and Culture (2018) Settings were made by Samuel Barber (Two Poems of the Wind, 1924), Arnold Bax (A Celtic Song Cycle, 1904, and other songs), Frederick Delius (I-Brasil, 1913), John Foulds (Five Mood Pictures), Charles T. Griffes (Three Poems of Fiona MacLeod, 1918), Fritz Hart (four volumes of Five Songs, opp. 73 to 77), Herbert Howells (Five Songs for Low Voice and Piano), David Moule-Evans (Two Celtic Songs, 1945), Philip Sainton (Leaves, Shadows and Dreams), and Caroline Holme Walker (When the Dew is Falling), among others. By far the best known setting was the adaptation of the verse drama The Immortal Hour as the libretto for Rutland Boughton's hugely successful opera of the same name, completed in 1914.Hurd, Michael. Notes to The Immortal Hour, Hyperion CD 22040 (1983)"]}, {"page": "Oxted", "response": ["* Distinguished English composer Michael Tippett lived in Oxted from 1929 to 1951. The first concert entirely devoted to Tippett's music took place at the Barn Theatre on 5 April 1930, conducted by David Moule-Evans. Tippett, Michael. Those Twentieth Century Blues: an Autobiography (London: Hutchinson, 1991), p. 25.: "]}, {"page": "Robert Hughes (composer)", "response": ["In October 1950, to mark the fiftieth anniversary of Federation, the Prime Minister of Australia, Robert Menzies, announced a Jubilee Symphony Competition \"open to all natural-born and naturalised British subjects\", with a prize of £1000. Composers had until June 1951 to compose a symphony with a maximum duration of 40 minutes. Similar competitions for literature and art were also announced with similar prize money, but unlike the symphony competition, these limited participants to Australian citizens only. There was an additional stipulation in the music competition: \"If the winner is not a natural-born or naturalised Australian, a special prize of £250 will be offered for the best entry submitted by an Australian citizen\". The judging panel comprised three British musicians: Sir Arnold Bax (then Master of the Queen's Music), Sir John Barbirolli and Eugene Goossens. First prize was awarded to an obscure English composer David Moule-Evans, and the \"special\" second and third prizes in the competition were awarded to Hughes and Clive Douglas respectively."]}, {"page": "List of compositions for viola: L to N", "response": ["* David Moule-Evans (1905–1988)"]}, {"page": "List of Royal College of Music people", "response": ["*David Moule-Evans (1905–1988), composer"]}, {"page": "List of people from Tonbridge", "response": ["* David Moule-Evans (1905–1988), composer"]}]}}