{"wiki_id": "http://www.wikidata.org/entity/Q201739", "itemLabel": "Mary McCartney", "itemDescription": "British photographer, daughter of Paul and Linda McCartney", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_McCartney", "wikipedia_page": {"main": "Mary Anna McCartney (formerly McCartney-Donald; born 28 August 1969) is a British photographer and Global Ambassador for Meat Free Monday and Green Monday. She is a daughter of musician and singer/songwriter Paul McCartney and photographer/musician Linda McCartney.", "link_mentions": [{"page": "August 28", "response": ["*  1969   – Mary McCartney, English photographer and activist"]}, {"page": "List of photographers", "response": ["* Mary McCartney (born 1969)"]}, {"page": "Linda McCartney", "response": ["Her next vegetarian cookbook, Linda's Kitchen: Simple and Inspiring Recipes for Meatless Meals, was published in 1995, and was nominated for a James Beard award in the Vegetarian Books category in 1996. In 2021, Paul, Stella, and Mary McCartney updated and veganized a number of Linda's vegetarian recipes, and released them as the vegan cookbook, Linda McCartney’s Family Kitchen."]}, {"page": "Mike McGear", "response": ["Michael and his brother Paul were both born in the Walton Centre in Liverpool, England, where their mother, Mary McCartney, had previously worked as a nursing sister in charge of the maternity ward.Miles 1998 p. 4Spitz 2005 p. 75 Michael was not enrolled in a Catholic school as his father, Jim McCartney, believed that they leaned too much towards religion instead of education. At age 17, McCartney started his first job at Jackson's the Tailors in Ranelagh Street, Liverpool. The year after, he took an apprenticeship at Andre Bernard, a hairdresser for ladies in the same street.Mike McCartney biog on Beatles Ireland  iol.ie/~beatlesireland- Retrieved 16 October 2007"]}, {"page": "¡Viva El Amor!", "response": ["*Inner sleeve photos: Mary McCartney"]}, {"page": "List of show business families", "response": ["* The Beatles' member Paul McCartney is the father of photographer Mary McCartney, fashion designer Stella McCartney and musician James McCartney."]}, {"page": "McCartney (surname)", "response": ["** Mary McCartney (born 1969), British photographer, Paul and Linda McCartney's daughter"]}, {"page": "MPL Communications", "response": ["==Mary McCartney Picture department==", "McCartney's second eldest daughter, photographer and photo editor Mary McCartney, runs the picture department."]}, {"page": "Wingspan: Hits and History", "response": ["Released in 2001 in conjunction with a prime time TV documentary, similarly called Wingspan, the associated soundtrack was a commercial success. In the United States, it went straight to number 2 on the Billboard 200 with sales of 221,000 copies in the first week of its release. The album charted there for 14 weeks, selling approximately 970,000 units as of 2005. Wingspan has been certified double platinum by the Recording Industry Association of America, and also reached gold status in the UK, Australia and New Zealand. A DVD release of the broadcast documentary – which dealt with McCartney's relationship with Linda Eastman and their eventual marriage, the traumatic final year of the Beatles' career and his own role in their break-up, and the story of Wings' formation and career through the 1970s towards their dissolution in 1980 – was produced by Mary McCartney, who also interviewed her father in the film."]}, {"page": "List of women who died in childbirth", "response": ["*Mary Theresa Danher (1919), mother of Mary McCartney."]}, {"page": "Lee Eastman", "response": ["He was the son of Louis (b. Russia ~1887, imm. 1906) and Stella (Freyer) Epstein. His sisters were Emmaline and Rose. He married Louise Lindner, daughter of a prominent Cleveland department store executive; they had four children,  including John Eastman and Linda McCartney, the first wife of former Beatle Paul McCartney. Eastman became McCartney's business manager shortly before the breakup of The Beatles while his son John represented McCartney during his 1970 lawsuit to legally dissolve the Beatles. He is the maternal grandfather of potter Heather McCartney, photographer Mary McCartney, fashion designer Stella McCartney, and musician/sculptor James McCartney. Eastman was also the friend and longtime lawyer for and collector of the works of the abstract expressionist painter Willem de Kooning. His sister Rose Frisch became a noted scientist who worked on issues of women's fertility and population studies.Pam Belluck, \"Rose E. Frisch, Scientist Who Linked Body Fat to Fertility, Dies at 96\", New York Times, February 11, 2015; accessed September 25, 2018 His family was Jewish."]}, {"page": "Smile Train", "response": ["Current and former supporters include: Tatyana Ali, John Bishop, Christie Brinkley, Dean Cain, Stephen Colbert, Kevin Connolly, Walter Cronkite, Erik Estrada, Lucy Hale, Sammi Hanratty, Rebecca Herbst, Jane Kaczmarek, Howie Mandel, Mary McCartney, Reba McEntire, Bette Midler, Jimmy Pardo, General Colin Powell, Aishwarya Rai Bachchan, Carly Simon and Hilary Swank."]}, {"page": "Better Alone", "response": ["The first video for \"Better Alone\" was shot in March 2005 in Sussex, England and was directed by Mary McCartney. The video takes place in what appears to be a castle and shows Melanie wearing a green gown. This video on the enhanced CD single used the album version of the song, but the version on Melanie C's YouTube channel uses the radio edit."]}, {"page": "James McCartney", "response": ["In 1989, McCartney and his sisters Mary McCartney and Stella McCartney again joined Paul and Linda on a world tour. He continued his education with a tutor while on the road. In 1993, at age 16, while surfing with friends, he was swept out to sea. The coast guard was called, his family rushed to the site, and he emerged safe on his own 40 minutes later. In 1995, James introduced his sister Mary to television producer Alistair Donald, whom she later married."]}, {"page": "St. Ann's Well, Malvern", "response": ["In October 2009, the Malvern Hills Conservators announced plans to take St Ann's Well cafe back under their own management on  expiry of the tenancy on 31 March  2010 to achieve a long-standing goal of providing a visitor information centre.  Although Malvern Town Council voted in favour of supporting the action taken by the Conservators the announcement was met with opposition from local residents and visitors to the area and a public meeting was called by the  Malvern Hills Conservators to address the concerns of the public on 12 November 2009. Thirty-six members of the public attended the meeting and asked a total of 26 questions regarding plans for St Ann's Well. At a meeting of Malvern Hills Conservators on 11 March 2010, supporters of the proprietor of St Ann's Well asked a further 29 questions, some of them concerning the plans for the cafe and others about other aspects of the Conservators work and in May 2010 a petition asking the Conservators to reconsider their decision was presented to the Board of Conservators. It was signed by 4,500 people, including the actor Martin Shaw, poet Benjamin Zephaniah and Mary McCartney."]}, {"page": "The Moment (Lisa Stansfield album)", "response": ["*Mary McCartney - photographs"]}, {"page": "Elise Valmorbida", "response": ["Valmorbida was one of eight 'Women of Liberty' photographed by Mary McCartney."]}, {"page": "Lauderdale Mansions South", "response": ["More recent former residents of Lauderdale Mansions South have included Kathryn Flett, Observer TV critic and star of the BBC’s Grumpy Old Women series, and Mary McCartney, celebrity photographer and daughter of Paul and Linda McCartney."]}, {"page": "Rye College", "response": ["* Mary McCartney, photographer and vegetarian cookery writer"]}, {"page": "Personal relationships of Paul McCartney", "response": ["== Jim and Mary McCartney==", "In May 1968, McCartney met Eastman again in New York when Lennon and McCartney were there to announce the formation of Apple Corps. In September, McCartney phoned her and asked her to fly over to London. Six months later they were married at a small civil ceremony, when Eastman was four months pregnant with their child, Mary McCartney, at Marylebone Town Hall on 12 March 1969. He later said that his wife was the woman who \"gave me the strength and courage to work again\", after the break-up of the Beatles. McCartney adopted her daughter from her first marriage, Heather, and had three children together: Mary, Stella, and James. McCartney taught Linda to play keyboards, and permanently included her in the line-up of Wings."]}, {"page": "Simon de Pury", "response": ["In 2013 Simon de Pury founded dePurydePury, a private advisory and art consultancy, with his then wife. During this time Simon de Pury curated and organised several exhibitions with artists including Erik Bulatov, Mario Testino, Mary McCartney, and Wojciech Fangor."]}, {"page": "Wingspan (film)", "response": ["Formed around an interview between Paul McCartney and his daughter Mary McCartney (who co-produced it with her then-husband Alistair Donald, its director), it uses the McCartneys' film and photographic archive to tell the story of Paul and Linda's founding of the band Wings in the aftermath of The Beatles' split and of its gradual evolution during the 1970s, through several line-ups. From an initial atmosphere of critical disdain and personal derision for both McCartneys the film charts the band's progress to its commercial peaks of international success and acclaim before it suffers its own disintegration at the beginning of the 1980s."]}, {"page": "Kisses on the Bottom", "response": ["*Mary McCartney – cover photo"]}, {"page": "Staley-Wise Gallery", "response": ["*Mary McCartney"]}, {"page": "List of animal rights advocates", "response": ["!Mary McCartney"]}, {"page": "Lulu Kennedy", "response": ["Lulu launched her own clothing brand Lulu & Co in 2010 to mark Fashion East's 10th anniversary. Initially created as a limited edition capsule collection of ten archive dresses by ten Fashion East designers, Lulu went on to develop the line in house, often collaborating with friends such as artists Tim Noble & Sue Webster, Barry Reigate, Bella Freud & Susie Bick, art director Boyo Studio, and photographer Mary McCartney. It is carried internationally at stockists including Liberty and Net-a-Porter."]}]}}