{"wiki_id": "http://www.wikidata.org/entity/Q20128040", "itemLabel": "Hugh Rotherham", "itemDescription": "English cricketer (1861-1939)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Rotherham", "wikipedia_page": {"main": "Hugh Rotherham (16 March 1861 – 24 February 1939) was an English cricketer who played first-class cricket for a wide variety of amateur teams between 1880 and 1903, including the Marylebone Cricket Club (MCC) and the Gentlemen, and a single first-class match for Warwickshire. He was born and died at Coventry.\nRotherham's father was the Coventry watch manufacturer John Rotherham and he was educated at Uppingham School where he was captain of the cricket team in 1879. Not going to university, he joined his father's company and in the first half of the 1880s played a lot of cricket as a right-handed lower-order batsman and a right-arm fast bowler who bowled in the round-arm style.\nRotherham's first first-class match was for an \"England XI\" against Cambridge University and he took seven wickets in the match. Three weeks later, playing for a \"Gentlemen of England\" side against Oxford he did even better, taking six for 34 and four for 65 to finish with match figures of 10 for 99. That led to his selection for the showpiece Gentlemen v Players match at Lord's, where he took eight wickets as the Gentlemen recorded a rare victory. He played only minor cricket in 1881, but returned in 1882 and again played in some of the bigger fixtures of the year, including the Gentlemen v Players match at The Oval.\nIn the 1883 season, Rotherham was one of the principal participants in the Gentlemen v Players match at The Oval which ended sensationally in a tie. In the Players' first innings, he took six wickets for 41 runs and, when the Gentlemen had been set 150 to win the match, he joined A. P. Lucas, who had opened the innings, with nine wickets down for 136, just 14 short; the pair added 13, of which Rotherham scored 11, but Rotherham was then bowled by Edmund Peate with the scores level.He achieved his best bowling figures in the 1884 season, playing for the Gentlemen of England against Oxford University: in the first Oxford innings, he took eight wickets for 57 runs and he followed that up with six for 93 in the second innings to finish with match figures of 14 for 150. He also appeared in a first-class match between an England XI and the 1884 Australian team at Birmingham, a match scheduled for three days but completed in a single day. The 1884 season was the last in which he played in the Gentlemen v Players series and he failed to take a wicket in his last appearance in this fixture.\nIn 1885 he played only two matches, both taking place in a single week, and thereafter he was almost exclusively involved in second-class games only, including several where he was captain of the Warwickshire team, at that stage not a first-class team. There were only three exceptions: two of the matches played on a tour in September 1886 of North America led by Ned Sanders and consisting of amateur cricketers, of which Rotherham was one, were reckoned to be of first-class status. Then in 1903, almost 17 years after his previous first-class match, he returned for his single first-class appearance for Warwickshire when he captained the side against the touring team from Philadelphia. In this last game, he also kept wicket for the only time in his career and he also made his highest first-class score, an innings of 33.Rotherham became head of the family company and was active in the Coventry guild companies and in the London Clock Makers' Company, where he was master in 1926. His obituary in The Times also states that he was on the board of Barclays Bank. But it also exaggerates his claims to cricketing fame, stating that he appeared in \"the earlier Test matches against Australia\", which is not true.Rotherham was not married. His nephew, Gerard Rotherham, played first-class cricket for Cambridge University, Warwickshire and Wellington in New Zealand, and was a Wisden Cricketer of the Year as a schoolboy at Rugby School during the suspension of first-class cricket in the First World War.", "link_mentions": {}}}