{"wiki_id": "http://www.wikidata.org/entity/Q2027321", "itemLabel": "Len Allchurch", "itemDescription": "Welsh footballer (1933-2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Len_Allchurch", "wikipedia_page": {"main": "Leonard Allchurch (12 September 1933 – 16 November 2016) was a Welsh professional footballer. Allchurch played in the English Football League for almost twenty years, playing in the top flight with Sheffield United and having lengthy spells with Swansea City and Stockport County. A Welsh international, he was born in Swansea and was the brother of fellow international Ivor Allchurch. He had the distinction of never receiving a booking or a caution throughout his entire Football League career.", "link_mentions": [{"page": "Cwmbwrla", "response": ["Wales international footballers John and Mel Charles; Ivor and Len Allchurch; Mel Nurse; Jackie Roberts; and Ernie Jones were all born and raised in the area."]}, {"page": "John Harris (footballer, born 1917)", "response": ["Finally in 1961, his Sheffield United team won promotion from the Second Division as runners-up to Ipswich Town, mainly due to his purchase of Welsh international winger Len Allchurch for £12,500 from Swansea. Under Harris, United enjoyed numerous runs in the FA Cup (reaching the semi-finals in 1961 for the first time since 1936) and the League Cup. Despite financial problems, he led United to fifth place in the first season back in the top division, and over the next few years relied on a steady flow of youngsters graduating from the Northern Intermediate league team to replace players sold to remain in profit. After years of mid-table finishes, he was \"promoted\" to general manager in August 1968 after the team had been relegated the previous season, replaced by Arthur Rowley. However, Rowley was sacked within a year and Harris returned as manager in August 1969."]}, {"page": "1933 in association football", "response": ["* September 12: Len Allchurch, Welsh international footballer (died 2016)"]}, {"page": "Mel Charles", "response": ["He spent seven seasons with the \"Swans\" from 1952 to 1959, all of which ended with Swansea finishing between tenth and twentieth. They consistently picked up results at Vetch Field, but failed to perform away from home. During this time they also reached the final of the Welsh Cup in 1956 and 1957, though lost out to Cardiff City and then Wrexham. A cash-strapped club, their cause was not helped by the fact that the directors refused to pay for overnight stays, and so many times the team's coach would appear outside the opposition's ground just minutes before the match. Swansea were a selling a club, and during his time Ivor and Len Allchurch, Cliff Jones, and Terry Medwin would all be sold to big English clubs. Including Charles, these five players all represented Wales at the World Cup. Jones' brother Bryn also played for Swansea, as did Cyril and Gilbert Beech; this meant three sets of brothers played for the \"Swans\" during this time, in what was an extremely local squad. Throughout the 1950s Swansea were an attacking team, and during his time at Vetch Field Charles picked up four goals in a match against Blackburn Rovers, as well as hat-tricks against Stoke City, Middlesbrough and Sheffield Wednesday. Charles offered to work at a second job to remain at Swansea with their strict wage limit of £14 a week, but this was not permitted, and instead he put in a transfer request. He employed Neil Harris to act as his 'business manager' in his pending transfer move, thereby making him the first ever agent in the English game. In one of his last games for the club, he helped Swansea record their first ever league win over rivals Cardiff City at Ninian Park."]}, {"page": "1933 in Wales", "response": ["*12 September – Len Allchurch, footballer (d. 2016)"]}, {"page": "Ken Mulhearn", "response": ["Mulhearn was signed by First Division Manchester City on 21 September 1967, a transfer which Stockport great Len Allchurch later reflected on by saying \"...a great 'keeper. We never thought we'd replace him when he went to City\". Two days later Manchester City's first choice goalkeeper Harry Dowd sustained an injury, and Mulhearn took his place in the team, his debut coming in a Manchester derby. He kept his place for the remainder of the season, gaining a League Championship medal as part of Manchester City's 1967–68 title-winning side."]}, {"page": "1958 FIFA World Cup qualification – UEFA Group 4", "response": ["| FW ||align=\"left\"| Len Allchurch || September 12, 1933 || 1 || 1 || 90 || 0 || 0 || - || - || - || - ||bgcolor=red| 90 || - ||align=\"left\"| /2 Swansea Town"]}, {"page": "1966 FIFA World Cup qualification – UEFA Group 7", "response": ["|rowspan=2| FW ||align=\"left\" rowspan=2| Len Allchurch ||rowspan=2| 12 September 1933 ||rowspan=2| 4 ||rowspan=2| 3 ||rowspan=2| 360 ||rowspan=2| 0 ||rowspan=2| 0 || - || - ||bgcolor=red| 90 ||bgcolor=red| 90 ||  ||  ||align=\"left\"|  Sheffield United"]}, {"page": "List of footballers in England by number of league appearances", "response": ["!scope=row data-sort-value=\"Allchurch, Len\"|Len Allchurch"]}, {"page": "Allchurch", "response": ["* Len Allchurch (born 1933), Welsh international footballer, brother of Ivor"]}, {"page": "Wales national football team results (1946–1959)", "response": ["|1958 FIFA World Cup Play-Off || Len Allchurch, Dave Bowen|| 55,000"]}, {"page": "List of Wales national football team World Cup and European Championship squads", "response": ["| 21 || MF || Len Allchurch ||  || ||  Swansea Town ||"]}]}}