{"wiki_id": "http://www.wikidata.org/entity/Q2028504", "itemLabel": "Adam Paul Harvey", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Adam_Paul_Harvey", "wikipedia_page": {"main": "Adam Paul Harvey (born 7 July 1984) is an English actor.", "link_mentions": [{"page": "Girls in Love (TV series)", "response": ["* Adam Paul Harvey as Russell, Ellie's boyfriend then later her ex-boyfriend. Like Ellie, he is interested in art. Is in year eleven at his school, Halmer High. Becomes Ellie's ex-boyfriend in the episode \"The Unforgiven\" after Russell cheats on Ellie. They almost get back together in episode \"The Ex Factor\" but Russell cheats on her again."]}, {"page": "Night and Day (TV series)", "response": ["* Adam Paul Harvey as Tom Brake; Fiona and Mike's son, he has never been successful with girls – even though his best (female) friend is in love with him. He also is interested in film, constantly filming events that occur."]}, {"page": "Where the Heart Is (British TV series)", "response": ["* Adam Paul Harvey as Nathan Boothe"]}, {"page": "Sir William Ramsay School", "response": ["* Adam Paul Harvey, actor who played Tom Brake in Night and Day, Ralph Henshaw in Bedtime and Nathan Boothe in Where the Heart Is. More recently he has acted in two films: My Brother Tom (2001) and Son of Rambow (2007)."]}, {"page": "1984 in the United Kingdom", "response": ["* 7 July – Adam Paul Harvey, actor"]}, {"page": "Bedtime (TV series)", "response": ["In the second series, Andrew Oldfield is annoyed by the noise made by Kurdish men from a nearby hostel. His wife writes a letter to the local paper in support of the hostel, causing her to be ostracised by her friends. Andrew also becomes worried that he may have Alzheimer's. Meanwhile, one neighbour (Kevin McNally) is given an ultimatum by his girlfriend (Doon Mackichan), while on the other side, widower Neil Henshall (Alun Armstrong) tries to find out what's troubling his son Ralph (Adam Paul Harvey). Ralph is visited by his girlfriend (Sienna Miller) and the Oldfields receive a visit from an old friend (James Bolam). A burglary at the Oldfields' house casts suspicion on various parties."]}, {"page": "The Five(ish) Doctors Reboot", "response": ["* Adam Paul Harvey – former partner of Georgia Tennant"]}, {"page": "Mad to Be Normal", "response": ["*Adam Paul Harvey as Paul Zemmell"]}]}}