{"wiki_id": "http://www.wikidata.org/entity/Q2025370", "itemLabel": "Dick Burton", "itemDescription": "professional golfer", "wikipedia_url": "https://en.wikipedia.org/wiki/Dick_Burton_(golfer)", "wikipedia_page": {"main": "Richard Burton (11 October 1907 – 30 January 1974) was an English professional golfer.Burton, a former four-loom weaver at Cobden Mill, is mainly remembered for winning The Open Championship (British Open) in 1939, when it was played on the Old Course at St Andrews in Scotland and holding the Open title for the longest time – from 1939 till after World War II.  He played for Great Britain in the Ryder Cup in 1935, 1937, and 1949, and won two of his five matches.", "link_mentions": [{"page": "Ryder Cup", "response": ["In early April 1939, the British P.G.A. chose a selection committee of six and selected Henry Cotton as captain. In August, eight players were named in the team: Cotton, Jimmy Adams, Dick Burton, Sam King, Alf Padgham, Dai Rees, Charles Whitcombe, and Reg Whitcombe. Charles Whitcombe immediately withdrew from the team, not wishing to travel to the United States. With seven selected, three places were left to be filled. War was declared on 3 September and the British P.G.A. immediately cancelled the match: \"The P.G.A. announce that the Ryder Cup match for this year has been cancelled by the state of war prevailing in this country. The P.G.A. of the United States is being informed.\""]}, {"page": "The Open Championship", "response": ["|align=center|74th || align=center|1939 ||  Dick Burton || align=center|290 || align=center|−2 || 2 strokes ||  Johnny Bulla || align=center | 500|| align=\"center\" | 100 || St Andrews"]}, {"page": "Darwen", "response": ["*Dick Burton, golf's Open champion, 1939 (who went on to hold the Claret Jug for seven years after the Championship was suspended because of the Second World War)"]}, {"page": "Old Course at St Andrews", "response": ["|1939 ||  Dick Burton||70||72||77||71||290 (−2)||  The 1939 Open was the last Open until 1946 because of World War II. The Royal Air Force used the fairways of the Old Course as runways. Burton held the Claret Jug the longest (7 years), until the tournament resumed in 1946, also at St Andrews. The winners share was £100."]}, {"page": "1939 in sports", "response": ["* British Open – Dick Burton"]}]}}