{"wiki_id": "http://www.wikidata.org/entity/Q2037842", "itemLabel": "Ross Fisher", "itemDescription": "professional golfer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ross_Fisher", "wikipedia_page": {"main": "Ross Daniel Fisher (born 22 November 1980) is an English professional golfer who plays on the European Tour, where he has won five times, including the 2009 Volvo World Match Play Championship at Finca Cortesin Golf Club in Spain.", "link_mentions": [{"page": "Gary Player", "response": ["In June 2016, in an interview with bunkered.co.uk, Player branded as 'laughable' a report released by The R&A and USGA which said that driving distance in golf was only increasing minimally. He warned of a 'tsunami coming' due to the governing bodies' failure to address issues surrounding new golf technology. After the 2017 Alfred Dunhill Links Championship, Player reiterated these comments, taking to Twitter to say he was 'sad' to see the Old Course at St Andrews 'brought to her knees' after Ross Fisher broke the course record on a day of very low scoring during the final round."]}, {"page": "Phil Mickelson", "response": ["| Ross Fisher,  Lee Westwood", "| Ross Fisher,  Lee Westwood"]}, {"page": "Lee Westwood", "response": ["Westwood continued his fine run of performances in the major championships with a tied third finish at the Masters in April 2012. He finished two strokes behind Bubba Watson and Louis Oosthuizen and bemoaned his putting performance as the reason he did not win the tournament. This was the seventh occasion that he had recorded a top three finish at a major without actually winning one. In April 2012, he successfully defended his title at the Indonesian Masters on the Asian Tour, winning by two strokes. In June 2012, Westwood won the Nordea Masters for the third time, the week prior to the U.S Open, with a five stroke victory over Ross Fisher. This was Westwood's 22nd victory on the European Tour and moved him into ninth place alone on the all time European Tour winners list.", "| Ross Fisher", "| Ross Fisher,  Phil Mickelson", "| Ross Fisher,  Phil Mickelson", "| Ross Fisher,  Phil Mickelson", "| Ross Fisher,  Phil Mickelson"]}, {"page": "BMW PGA Championship", "response": ["| 2009 || Paul Casey|| align=\"center\" |271 || align=center|−17 || 1 stroke ||  Ross Fisher ||Wentworth Club|| align=\"center\" |750,000"]}, {"page": "Nedbank Golf Challenge", "response": ["| style=\"background:lightblue\"|34th || 2014 || AFR, EUR ||  Danny Willett || align=center|270 || align=center|−18 || 4 strokes ||  Ross Fisher || align=center|6,500,000 || align=center|1,250,000"]}, {"page": "Volvo World Match Play Championship", "response": ["| 2009 || EUR ||  Ross Fisher || align=center|4 and 3 ||  Anthony Kim"]}, {"page": "Alfred Dunhill Links Championship", "response": ["| 2017 ||  Tyrrell Hatton (2) || align=center|264 || align=center|−24 || 3 strokes ||  Ross Fisher || Jamie Donaldson andKieran McManus", "| 2016 ||  Tyrrell Hatton || align=center|265 || align=center|−23 || 4 strokes ||  Ross Fisher   Richard Sterne || Danny Willett andJonathan Smart ", "| 2008 ||  Robert Karlsson || align=center|278 || align=center|−10 || Playoff ||  Ross Fisher Martin Kaymer || John Bickerton andBruce Watson"]}, {"page": "Luke Donald", "response": ["Donald continued his excellent match play form in May, reaching the final of the Volvo World Match Play Championship, which he eventually lost 2&1 to fellow Englishman Ian Poulter. He knew that had he had won this tournament he would have gone to world number one for the first time in his career. Donald had previously beaten Ross Fisher, Charl Schwartzel and Martin Kaymer to reach the final; however, he did not add the Volvo World Match Play title to his WGC-Accenture Match Play title he won earlier in the year. This defeat ended Donald's run of 14 consecutive match play wins.", "In the first event of the 2015 European Tour season at the Nedbank Golf Challenge, Donald led the tournament after 36 holes after a 63, and again after 54 holes. He was unable to hold onto that lead after 72 holes and had to settle for third place behind Danny Willett and Ross Fisher. Donald had to face sectional qualifying for the U.S. Open for the first time in 11 years due to his fall to 66th in the world ranking. He managed to finish at the top of his qualifier at the Bears Club to seal a spot."]}, {"page": "Paul Casey", "response": ["Casey won his milestone 10th event on the European Tour at the 2009 BMW PGA Championship at Wentworth Golf Club in Surrey, where he won by one stroke over Wentworth resident and fellow Englishman Ross Fisher. This win vaulted Casey to a career high of 3rd in the Official World Golf Ranking. He had been ranked at No. 41 at the beginning of 2009. Casey suffered a rib injury at the 2009 Open Championship, limiting the amount of golf he could play in the second half of 2009.", "| Ross Fisher"]}, {"page": "European Open (golf)", "response": ["| 2016 ||  Alexander Lévy || align=center|194 || align=center|−19 || Playoff ||  Ross Fisher || Bad Griesbach", "| 2008 ||  Ross Fisher || align=center|268 || align=center|−20 || 7 strokes ||  Sergio García || London"]}, {"page": "Irish Open (golf)", "response": ["| align=center|2010 ||  Ross Fisher || align=center|266 || align=center|−18 || 2 strokes ||  Pádraig Harrington || align=center|500,000 || Killarney"]}, {"page": "Scandinavian Masters", "response": ["| 2012 || EUR ||  Lee Westwood (3) || align=\"center\" |269 || align=center|−19 || 5 strokes ||  Ross Fisher || align=center|250,000 || Bro Hof Slott"]}, {"page": "Robert Karlsson", "response": ["| Ross Fisher,  Martin Kaymer", "| Ross Fisher,  Martin Kaymer"]}, {"page": "Dutch Open (golf)", "response": ["| 2007 ||  Ross Fisher || align=center|268 || align=center|−12 || 1 stroke ||  Joost Luiten || Kennemer"]}, {"page": "WGC-HSBC Champions", "response": ["| style=\"background:lightblue\"|3rd || 2007 || AFR, ANZ, ASA, EUR ||  Phil Mickelson || align=\"center\" |278 || align=center|−10 || Playoff ||  Ross Fisher Lee Westwood || align=\"center\" |5,000,000 || align=\"center\" |833,300 || Sheshan || "]}, {"page": "BMW International Open", "response": ["| 2010 ||  David Horsey || align=center|270 || align=center|−18 || 1 stroke ||  Ross Fisher"]}, {"page": "PGA EuroPro Tour", "response": ["PGA EuroPro Tour alumni include major champions Louis Oosthuizen and Charl Schwartzel, and European Ryder Cup players Nicolas Colsaerts, Jamie Donaldson, Ross Fisher, Tommy Fleetwood and Tyrrell Hatton and Oliver Wilson."]}, {"page": "Abu Dhabi Golf Championship", "response": ["| Tommy Fleetwood (2) || align=center|266 || align=center|−22 || 2 strokes ||  Ross Fisher"]}, {"page": "Marcel Siem", "response": ["In November 2014, Siem claimed victory at the BMW Masters, the first event of the Race to Dubai finals series and his fourth overall on the European Tour. He won in a sudden death playoff over Ross Fisher and Alexander Lévy with a birdie on the first extra hole.", "| Ross Fisher,  Alexander Lévy", "| Ross Fisher,  Alexander Lévy"]}, {"page": "Mark Roe", "response": ["Roe retired from tournament golf in 2006, signing off with a 67 on the Old Course at St Andrews in the final round of the Dunhill Links Championship. He now works as a commentator for Sky Sports. He is also a worldwide respected coach, specialising on the short game,(www.markroe.info) and counts Lee Westwood Francesco Molinari , Justin Rose , Nicolas Colsaerts and Ross Fisher amongst many on the list of world class players he has helped."]}, {"page": "Italian Open (golf)", "response": ["| 2017 || Tyrrell Hatton|| align=\"center\" |263 || align=\"center\" |−21 || 1 stroke || Kiradech Aphibarnrat Ross Fisher|| Milano || "]}, {"page": "Fisher (surname)", "response": ["*Ross Fisher (born 1980), English golfer", "*Ross Fisher (footballer) (born 1964), Australian rules footballer"]}, {"page": "Tavistock Cup", "response": ["The 2012 Tavistock Cup featured the same four teams and was contested at Lake Nona Golf & Country Club for the first time since 2009. Lake Nona won the Tavistock Cup for the fourth consecutive time and has collected five overall Tavistock Cup victories in 2007, 2009, 2010, 2011 and 2012. For the first time since the tournament’s inception, the Payne Stewart Salver Award was shared by five participants who finished the final round at 5-under-par (67): Robert Allenby, Thomas Bjorn, Ernie Els, Ross Fisher and Retief Goosen. The Salver Award is given each year in memory of the former Isleworth member and late champion golfer Payne Stewart to the player with the lowest score in the final round.", "Team Lake Nona was represented by Ross Fisher, Retief Goosen, Peter Hanson, Graeme McDowell, Henrik Stenson and Oliver Wilson.", "*Team Lake Nona: Ben Curtis, Ross Fisher, Retief Goosen, Peter Hanson, Graeme McDowell and Tavistock Cup rookie Gary Woodland. ", "*Team Lake Nona: Ross Fisher, Peter Hanson, Graeme McDowell and Henrik Stenson. ", "*Ross Fisher", "|Robert Allenby, Thomas Bjørn, Ernie Els,Ross Fisher, Retief Goosen (tied)"]}, {"page": "List of European Ryder Cup golfers", "response": ["| Ross Fisher ||  || 2010", "|ENG || align=left|Ross Fisher || 2010 || 2010 || 1 || 4 || 2 ||  || 2 || 2 || 0 || 0 || 1 || 0 || 1 || 0 || 0 || 1 || 1 || 0"]}, {"page": "Portugal Masters", "response": ["| 2012 ||  Shane Lowry || align=center|270 || align=center|−14 || 1 stroke ||  Ross Fisher"]}, {"page": "2007 European Tour", "response": ["| Ross Fisher (1)"]}, {"page": "Anthony Kim", "response": ["Kim lost to Ross Fisher in the finals of the Volvo World Match Play in October 2009 4 & 3 after once again beating Robert Allenby in the semi-finals."]}, {"page": "2007 Open Championship", "response": [":Europe: Fredrik Andersson Hed, Benn Barham, Grégory Bourdy, Peter Baker, Nick Dougherty, Mattias Eliasson, Ross Fisher, Alastair Forsyth, Mark Foster, David Frost, Peter Hanson, Miguel Ángel Jiménez, José-Filipe Lima, Graeme McDowell, Francesco Molinari, Oliver Wilson"]}, {"page": "List of Great Britain and Ireland Seve Trophy golfers", "response": ["|  || Ross Fisher || 2009, 2011"]}, {"page": "Martin Kaymer", "response": ["Kaymer came close to picking up his third win of the year at the Alfred Dunhill Links Championship, but he fell to Robert Karlsson in a three-man playoff that also included Ross Fisher. Kaymer recorded another runner-up finish at the Volvo Masters, finishing two strokes behind winner Søren Kjeldsen. Kaymer earned €1,794,500 in 2008 and finished 8th on the Order of Merit. Kaymer narrowly missed selection for the 2008 Ryder Cup, but European captain Nick Faldo invited Kaymer to assist the European side in a non-playing capacity which Kaymer accepted. Kaymer represented his country at the 2008 Omega Mission Hills World Cup with Alex Čejka. The pair finished in fifth.", "| Ross Fisher,  Robert Karlsson"]}, {"page": "List of male golfers", "response": ["| Ross Fisher||1980–"]}, {"page": "2008 European Tour", "response": ["| Ross Fisher (2)", "|6 || Ross Fisher || || 27 || 1,836,530"]}, {"page": "2008 U.S. Open (golf)", "response": ["*England: Phillip Archer, Robert Dinwiddie, Johan Edfors, Ross Fisher, Alastair Forsyth, Thomas Levet, Ross McGowan"]}, {"page": "Tooting Bec Cup", "response": ["| data-sort-value=Fisher | Ross Fisher"]}, {"page": "2008 PGA Championship", "response": ["Mark Brown, Jonathan Byrd, Paul Casey, Darren Clarke, Fred Couples, Ben Crane, Ben Curtis, Nick Dougherty, Niclas Fasth, Ross Fisher, Alastair Forsyth, Hiroyuki Fujita, Richard Green, Søren Hansen, Peter Hanson, Peter Hedblom, Charles Howell III, Miguel Ángel Jiménez, Brendan Jones, Robert Karlsson, Martin Kaymer, James Kingston, Søren Kjeldsen, Pablo Larrazábal, Tom Lehman, Graeme McDowell, Colin Montgomerie, Nick O'Hern, Louis Oosthuizen, Hennie Otto, Corey Pavin, Prayad Marksaeng, Jyoti Randhawa, Charl Schwartzel, Jeev Milkha Singh, Scott Strange, Toru Taniguchi, Bubba Watson, Steve Webster, Lee Westwood, Oliver Wilson"]}]}}