{"wiki_id": "http://www.wikidata.org/entity/Q2032721", "itemLabel": "Oscar Deutsch", "itemDescription": "British businessman (1893-1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Oscar_Deutsch", "wikipedia_page": {"main": "Oscar Deutsch (12 August 1893 – 5 December 1941) was a British businessman. He was the founder of the Odeon Cinemas chain in the United Kingdom.", "link_mentions": [{"page": "Balsall Heath", "response": ["*Oscar Deutsch, founder of the Odeon cinema chain"]}, {"page": "Odeon Luxe Leicester Square", "response": ["The cinema occupies the centre of the eastern side of Leicester Square in London, featuring a black polished granite facade and  high tower displaying its name. Blue neon outlines the exterior of the building at night. It was built to be the flagship of Oscar Deutsch's Odeon Cinema circuit and still holds that position today. It hosts numerous European and world film premieres,The world premiere of Avatar at Odeon Leicester Square The Telegraph Retrieved 24 March 2011Alice in Wonderland premiere in Leicester Square, London The Telegraph Retrieved 24 March 2011 including the annual Royal Film Performance.Casino Royale is 60th royal film BBC News Retrieved 24 March 2011", "The Odeon cinema building was completed by Sir Robert McAlpine in 1937 to the design of Harry Weedon and Andrew Mather on the site of the Turkish baths and the adjoining Alhambra Theatre a large music hall dating from the 1850s. The site cost £550,000, the cinema took seven months to build at a cost of £232,755 with 2116 seats.page 247, Odeon Cinemas 1: Oscar Deutsch Entertains Our Nation, Allen Eyles, 2002, British Film Institute Publishing The opening night was Tuesday 2 November 1937; the film shown that night was The Prisoner of Zenda.", "There are 800 seats – including 22 full-recliner seats in the Royal Box – and a \"Royal Retiring Room\" for visiting monarchs. Oscar's Bar (named after Odeon's founder Oscar Deutsch) features views across Leicester Square from a glass enclosed balcony."]}, {"page": "Odeon Luxe West End", "response": ["It was closed for almost a year from late-October 1940 when it suffered bomb damage. It re-opened 11 July 1941 with The Flame of New Orleans. Oscar Deutsch Odeon Theatres Ltd. took over in July 1946 and they closed it in July 1950 for some repairs to be carried out to the war damage."]}, {"page": "Edgbaston", "response": ["* Oscar Deutsch lived at 8 Rotton Park Road."]}, {"page": "Perry Barr", "response": ["In the 1920s, Oscar Deutsch opened his first ever Odeon cinema here. The original cinema is now a conference venue, having also been a bingo hall. The 1920s Perry Barr Stadium on the Aldridge Road hosts greyhound racing and the Birmingham Brummies speedway team. It has a 500-seat capacity, and was refurbished in 2004. It is the former home of the Birchfield Harriers, whose Art Deco-styled bas relief badge it still carries.Public Sculpture of Birmingham, George T. Noszlopy, Liverpool University Press, 1998,  The Harriers now operate from nearby Alexander Stadium."]}, {"page": "List of people from Birmingham", "response": ["*Oscar Deutsch – Founder of the Odeon Cinemas chain"]}, {"page": "King Edward VI Five Ways School", "response": ["* Oscar Deutsch - founder of Odeon Cinemas"]}, {"page": "Architecture of Birmingham", "response": ["The original buildings of the University of Birmingham, including its clock tower and The Barber Institute of Fine Arts (opened 1939), and the large Council House Extension and bridge housing the Birmingham Museum & Art Gallery (1911–1919) are from this period. S. N. Cooke and W.N. Twist's Hall of Memory (1922–25) and T. Cecil Howitt's Baskerville House on Broad Street (1938) were part of a large civic complex scheme designed by William Haywood. The Trinity Road Stand at Aston Villa's Villa Park ground was completed in 1924, and was considered the grandest in the land, complete with stained glass windows, Italian mosaics and sweeping staircase, it was thought of as architect Archibald Leitch's masterpiece and was described as \"the St Pancras of football\" by a Sunday Times reporter in 1960. It was demolished in 2000. The Blue Coat School in Harborne dates from 1930, the King Edward VI boys' and girls' schools in Edgbaston from 1840, and the Queen Elizabeth Hospital from 1933 to 1938. A distinctive Art Deco cinema is the Odeon, Kingstanding (1935). Many cinemas were constructed by Oscar Deutsch who commissioned Birmingham-born architect Harry Weedon to design many of these cinemas. Weedon's designs also extended to industrial buildings and he designed the Typhoo Tea factory in Digbeth in 1936."]}, {"page": "Science and invention in Birmingham", "response": ["1928: Brummie, Oscar Deutsch opens his first Odeon Cinema in nearby Brierley Hill. By 1930, \"Odeon\" is a household name and the cinemas are known for their maritime-inspired Art Deco architecture. This style is first used in 1930 on the cinema at Perry Barr in Birmingham, which is bought by Deutsch to expand the chain. He likes the style so much that he commissions the architect, Harry Weedon, to design his future buildings.\"Cinema History For Sale At First Odeon\" . The Independent (Republished by Find Articles), August 11, 1998. Retrieved May 18, 2007 The Odeon cinema chain later becomes one of the largest cinema chains in Europe."]}, {"page": "Samantha Ronson", "response": ["She is the niece of property tycoon Gerald Ronson. Ronson is related to British Conservative politicians Sir Malcolm Rifkind and Leon Brittan, as well as Odeon Cinemas founder Oscar Deutsch. Ronson's older brother, Mark, is a music producer and musician; her fraternal twin sister, Charlotte, is a fashion designer. Ronson has five younger half-siblings; Kenneth and Annabelle, through her mother's remarriage to Mick Jones; as well as Henrietta, David, and Joshua (by her father's marriage to model Michele First). Ronson has two step-brothers, Roman and Chris Jones, by Mick Jones' previous marriage. Ronson's stepfather Mick Jones contributed to a childhood surrounded by music."]}, {"page": "Odeon Cinemas", "response": ["The first Odeon cinema was opened by Oscar Deutsch in 1928, in Brierley Hill, Staffordshire (now West Midlands), although initially called \"Picture House\". The first cinema to use the Odeon brand name was Deutsch's cinema at Perry Barr, Birmingham in 1930. Ten years later Odeon was part of the Rank Organisation who continued their ownership of the circuit for a further sixty years. Through a number of sales and acquisitions in the early 2000s the company was purchased by Terra Firma, which merged Odeon and UCI Cinemas to form Odeon UCI Cinemas Group. Most UCI cinemas then took the Odeon brand name in 2006. Terra Firma/UCI sold the company to AMC Theatres in November 2016. Ironically, UCI was originally formed through the merger of AMC UK and Cinema International Corporation in 1989.", "Odeon Cinemas was created in 1928 by Oscar Deutsch. Odeon publicists liked to claim that the name of the cinemas was derived from his motto, \"Oscar Deutsch Entertains Our Nation\", but it had been used for cinemas in France and Italy in the 1920s, and the word is actually Ancient Greek ᾨδεῖον, Ōideion, meaning \"a place for singing\". The word \"Nickelodeon\" was coined in 1888 and was widely used to describe small cinemas in the United States starting from 1905.", "* Eyles, Allen (2002) Odeon Cinemas; Vol. 1: \"Oscar Deutsch Entertains Our Nation\". London : Cinema Theatre Association "]}, {"page": "Harry Weedon", "response": ["Harold William \"Harry\" Weedon (1887 – 17 June 1970) was a British architect. Although he designed a large number of buildings during a long career, he is best known for his role overseeing the Art Deco designs of the Odeon Cinemas for Oscar Deutsch in the 1930s. Influenced by the work of Erich Mendelsohn and Hans Poelzig – the Odeons \"taught Britain to love modern architecture\" and form \"a body of work which, with London Underground stations, denotes the Thirties like nothing else\".", "Weedon returned to Birmingham and to architecture in 1925, quickly building up his practice designing housing estates and commercial and industrial premises. It was his work in 1932 designing the enlargement of a factory in Hockley, Birmingham for the firm of Deutsch and Brenner that brought him to the attention of Oscar Deutsch – the factory's owner's son – who was in the process of building up his Odeon chain of cinemas and was dissatisfied with the interior proposed for his cinema under construction in Warley near Birmingham. Weedon was approached by Deutsch to complete the design, but at the time his office numbered only six staff and had nobody other than Weedon himself with any cinema experience, so the young Cecil Clavering was recruited to complete the work."]}, {"page": "Mark Ronson", "response": ["Through his mother, he is distantly related to British Conservative politicians Sir Malcolm Rifkind and Leon Brittan, and Odeon Cinemas founder Oscar Deutsch."]}, {"page": "Chingford Mount", "response": ["Many of the buildings were erected in the 1930s to Art Deco designs. The impressive Chingford Odeon cinema, an original Oscar Deutsch building designed by Andrew Mather and opened in September 1935, was demolished in 1972 to make way for a supermarket."]}, {"page": "Deutsch (surname)", "response": ["* Oscar Deutsch (1893–1941), founder of the British Odeon cinema chain"]}, {"page": "Timeline of Birmingham history", "response": ["** 4 August: The first cinema under the Odeon name in Britain is opened in Perry Barr by Balsall Heath-born Oscar Deutsch."]}, {"page": "Joseph Grossman", "response": ["Joseph Grossman (10 October 1888 – 18 January 1949) was a pioneer of the British film industry, most famous as the charismatic Studio Manager of Elstree Studios. Born in Dartford, Kent, the son of Myer Grossman and Rosa Morris, who belonged to Jewish families originally from Germany and Poland, he was always known as \"Joe\" and was famous for his nervous twitches and his Cockney humour. Joe Grossman was a contemporary of Oscar Deutsch and Michael Balcon, both of whom lived near his grandparents in Birmingham. He is mentioned in Michael Balcon's autobiography."]}, {"page": "Hungarians in the United Kingdom", "response": ["* Oscar Deutsch (1893–1941) – founder of Odeon Cinemas"]}, {"page": "Hurley Robinson", "response": ["His work on cinemas was mainly during the 1930s. His cinemas were mainly of the Art Deco style that was popularly used by Oscar Deutsch for his Odeon Cinemas. A lot of Robinson's work was commissioned in the Midlands area of England."]}, {"page": "Arnold Deutsch", "response": ["He was a cousin of Oscar Deutsch, the proprietor of the Odeon Cinemas chain. Though he claimed to be an observant Jew to disguise his role as a Communist agent, Deutsch was in fact lapsed in his religious beliefs."]}, {"page": "Cecil Clavering", "response": ["Clavering's opportunity came when Harry Weedon was commissioned to redesign the interior of a cinema being built in Warley for Oscar Deutsch, owner of the expanding Odeon Cinemas chain. Weedon's practice at the time numbered only six architects, none of whom except Weedon himself had any experience of cinema design, so Clavering was recruited to complete the job. He next worked on the Odeon, Kingstanding, then examples in Sutton Coldfield, Colwyn Bay and Scarborough, \"one masterpiece after the other\" considered \"the finest expressions of the Odeon circuit style\".  Later in 1935 however Clavering stunned Weedon by resigning to take up a job with the Office of Works. Weedon approached Clavering's former tutor who recommended Robert Bullivant as Clavering's replacement."]}, {"page": "New Wine Church", "response": ["The cinema was opened as the Odeon Theatre on 25 October 1937 with Ralph Reader in The Gang Show. It was designed for the Oscar Deutsch chain of Odeon Cinemas by architect George Cole who came up with a streamlined Art Deco style."]}, {"page": "George Coles (architect)", "response": ["Cole designed several other Odeon Cinemas for Oscar Deutsch, as well as the Carlton Cinema in Islington, and the Regal Cinema in Kettering. He designed the Kingsland Empire in his birthplace, Dalston, of which the ceiling and upper walls survive hidden above the Rio Cinema. Coles was also involved in the design of The People's Palace (1936) later subsumed into Queen Mary College, University of London. He designed the British Home Stores (now Primark) in Rye Lane, Peckham."]}, {"page": "Media in Birmingham", "response": ["In the 1920s, Oscar Deutsch opened his first Odeon cinema in the UK, in Perry Barr. By 1930, the Odeon brand was a household name and still thrives today."]}, {"page": "Art of Birmingham", "response": ["Birmingham was the only area of England in the interwar period to follow the German example in emphasising the importance of design for industrial processes as well as traditional craft-based production, teaching courses in industrial design in metals and plastics  at the Birmingham School of Art, and holding an \"Exhibition of Midland Industrial Art\" at Birmingham Museum and Art Gallery in 1934 that attracted 28,000 visitors. During the 1930s Harry Weedon – whose background lay in designing upmarket Arts and Crafts houses in suburbs such as Four Oaks – oversaw the development of the art deco branding of the Odeon Cinemas for Balsall Heath-born Oscar Deutsch; combining graphics, typography and architecture to create one of the first examples of unashamedly modernist design to successfully enter mainstream English culture. In 1930 the Birmingham lighting designer Robert Dudley Best introduced the Bestlite, the first Bauhaus-inspired product to emerge from England and a rare example of commercially viable English modernist design in the inter-war period."]}, {"page": "Bradford Odeon", "response": ["The building in Manchester Road was completed in 1938, on the site of Joseph Cooper's Central Mills Wool Combing works. It was a 2,713-seat super cinema built for Oscar Deutsch's Odeon Cinemas as a competitor to what was then the New Victoria. Odeon's house style was futuristic Art Deco, and this one was a Streamline Moderne building designed by the architect Robert Bullivant of Harry Weedon and Partners. "]}, {"page": "Birmingham Odeon", "response": ["The cinema received its current name in 1942 after it was purchased by Oscar Deutsch's Odeon Cinemas chain. During the 1970s and early to mid-1980s it was a very popular venue for concerts. "]}, {"page": "Odeon, Kingstanding", "response": ["The cinema was constructed between 1935 and 1936 to a symmetrical, modernist, art deco design by Harry Weedon and Cecil Clavering, the latter having joined the former's practice, as an assistant, in 1933. It was commissioned as an independent cinema, and was due to be called \"The Beacon\", after nearby Barr Beacon, but Oscar Deutsch became involved, and the cinema opened as part of his Odeon chain on 22 July 1935. It was built to serve Kingstanding's new, 4,000-home working-class housing estate and had 968 seats in the stalls and 324 in the circle. The first film was The Lives of a Bengal Lancer, starring Gary Cooper.", "The brick building occupies a wedge-shaped site between Kings Road and Kettlehouse Road, overlooking and facing Kingstanding Circle. The centre of the glazed cream and black tile (\"faience\") frontage features three slender fins, also finished with faience, above a stepped brick parapet. Clavering, inspired by the Lichtburg cinema in Berlin, originally intended that these fins would be topped by a searchlight.Allen Eyles, Odeon Cinemas, 2 volumes, volume 1: Oscar Deutsch Entertains Our Nation, London: Cinema Theatre Association, British Film Institute, 2002, , p. 57.Richard Gray, Cinemas in Britain: One Hundred Years of Cinema Architecture, London: Lund Humphries, 1996, , p. 92: \"The original idea was for a searchlight to be mounted on the fins which would scan the night sky, like at the Lichtburg in Berlin. This idea was dropped when Deutsch took over [the cinema]\"."]}, {"page": "Odeon Cinema, Manchester", "response": ["A single-screen cinema, it was capable of seating 2,920 people on two levels (the Stalls and the Balcony), and the building also contained a fully equipped stage, a fly tower, dressing rooms, an orchestra pit, an organ and a cafe. The cinema was designed to operate in the cine-variety era; it was mostly used to show films (such as those featuring Maurice Chevalier and Jeanette MacDonald) but it also put on live stage shows (including those by Francis A Mangan, which were accompanied by a full orchestra). It was purchased in November 1939 by Oscar Deutsch as part of the Odeon Theatres Ltd, and was renamed as the Odeon in 1940. It became a Rank cinema in 1941. Its piano lounge subsequently hosted Bruce Forsyth among others."]}, {"page": "Granada Cinema, Woolwich", "response": ["In the early 20th century, Woolwich was a thriving industrial and military town. In the mid-1930s there were several smaller movie theatres operating in Woolwich, when two leading companies in the business, Sidney Bernstein's Granada and Oscar Deutsch's Odeon, decided more or less simultaneously to establish large cinemas in the town. The first of the two to open in 1937 was the Granada Cinema; the Odeon opened four months later, just across the road.Saint & Guillery, pp. 74–76 (online text)."]}, {"page": "Odeon Theatre Toronto", "response": ["Odeon Cinemas was founded in 1928 by Oscar Deutsch in Brierley Hill, England. In 1938, the company was bought by J. Arthur Rank, and shortly after this time, a Canadian arm of the business was opened, called Odeon Theatres Canada. Toronto's first Odeon theatre was the Odeon Fairlawn, located at 3320 Yonge Street, and was also designed by Jay English. The Odeon Fairlawn opened on 14 August 1947."]}]}}