{"wiki_id": "http://www.wikidata.org/entity/Q2037801", "itemLabel": "Ottilie Patterson", "itemDescription": "Irish singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ottilie_Patterson", "wikipedia_page": {"main": "Anna Ottilie Patterson (31 January 1932 – 20 June 2011) was a Northern Irish blues singer best known for her performances and recordings with the Chris Barber Jazz Band in the late 1950s and early 1960s.", "link_mentions": [{"page": "Warren Mitchell", "response": ["* Where Has Poor Mickey Gone? (1964) as Emilio Dinelli, the Magician (with Ottilie Patterson)"]}, {"page": "List of British blues musicians", "response": ["*Ottilie Patterson"]}, {"page": "Comber", "response": ["*The jazz singer Ottilie Patterson (1932-2011) was born in Comber."]}, {"page": "Fellside Recordings", "response": ["On the jazz side, LAKE Records's roster includes George Melly, Digby Fairweather, Ottilie Patterson, Phil Mason, John Hallam, The Fryer-Barnhart International All Star Jazz Band, The Savannah Jazz Band, Spats Langham, Debbie Arthurs and Keith Nichols."]}, {"page": "Cyril Davies", "response": ["During this period Davies and Korner worked as session musicians, and often backed Ottilie Patterson during her featured set with husband  Chris Barber's band, using amplified instruments for the first time – which did not go down well with their blues purist audience and many fellow musicians. After closing the blues club, Davies and Korner went their separate ways, and, influenced by Muddy Waters electric sound, Davies formed his own electric blues band."]}, {"page": "Chris Barber", "response": ["Donald Christopher Barber OBE (17 April 1930 – 2 March 2021) was an English jazz musician, best known as a bandleader and trombonist. As well as scoring a UK top twenty trad jazz hit with \"Petite Fleur\" in 1959, he helped the careers of many musicians. These included the blues singer Ottilie Patterson, who was at one time his wife, and Lonnie Donegan, whose appearances with Barber triggered the skiffle craze of the mid-1950s and who had his first transatlantic hit, \"Rock Island Line\", while with Barber's band. He provided an audience for Donegan and, later, Alexis Korner, and sponsored African-American blues musicians to visit Britain, making Barber a significant figure in launching the British rhythm and blues and \"beat boom\" of the 1960s.", "Barber was married four times. His second marriage, to Ottilie Patterson, lasted from 1959 until their divorce in 1983. He subsequently had two children during his third marriage. ", "* Golden Hour of Chris Barber and his jazz Band featuring Vocals by Ottilie Patterson and Clarinet by Monty Sunshine , 1974"]}, {"page": "The Mountains of Mourne", "response": ["* Singer Ottilie Patterson recorded it in December 1959 with Chris Barber's Jazz Band on the EP \"Ottilie Swings the Irish\""]}, {"page": "Reading and Leeds Festivals line-ups", "response": ["*Ottilie Patterson", "*Ottilie Patterson", "*Ottilie Patterson", "*Ottilie Patterson", "*Ottilie Patterson", "*Ottilie Patterson"]}, {"page": "Patterson (surname)", "response": ["*Ottilie Patterson (1932–2011), Northern Irish blues singer"]}, {"page": "Regent House School", "response": ["* Ottilie Patterson, blues singer with the Chris Barber jazz band"]}, {"page": "Victoria Theatre, Halifax", "response": ["On 10 March 1957, Chris Barber's Jazz Band played at the venue, with Ottilie Patterson, and on 19 May 1961, Acker Bilk performed."]}, {"page": "Bud Green", "response": ["*\"I Love My Baby\" (Ottilie Patterson, 1957)"]}, {"page": "It's Trad, Dad!", "response": ["* Chris Barber's Jazz Band with Ottilie Patterson", "|\"Down by the Riverside\" || Chris Barber's Jazz Band featuring Ottilie Patterson", "|\"When the Saints Go Marching In\" || Chris Barber's Jazz Band featuring Ottilie Patterson"]}, {"page": "Momma Don't Allow", "response": ["Momma Don't Allow is a short British documentary film of 1956 about a show of the Chris Barber band with Ottilie Patterson in a north London trad jazz club. The film features skip jiving by the audience."]}, {"page": "Ottilie", "response": ["*Ottilie Patterson, a Northern Irish jazz singer."]}, {"page": "The Rare Old Mountain Dew", "response": ["*Ottilie Patterson recorded it as The Real Old Mountain Dew on the EP Ottilie Swings the Irish in December 1959 with Chris Barber's Jazz Band"]}, {"page": "Movilla Abbey", "response": ["The surrounding Movilla Cemetery (managed by Ards and North Down Borough Council), is still in use and is the site of twenty-one Commonwealth burials from World War I and twenty-four from World War II, seven of which remain unidentified. Some of the more recent burials include that of Colonel Robert Blair Paddy Mayne, one of the most highly decorated British soldiers in World War II; and that of Ottilie Patterson (Barber), the jazz and blues singer most noted for her performances with the Chris Barber Band in the 1950s and '60s."]}, {"page": "Black Lion Records", "response": ["| Ottilie Patterson with Chris Barber"]}, {"page": "The Tearjerkers", "response": ["Howard Ingram, in particular, is a particularly vocal critic of the period in which they emerged. 'There's a plaque in Belfast now that champions the role the 1978 people played in putting Belfast on the international music map, and I think it's a load of crap. And I guess Eric Bell & Gary Moore (ex Thin Lizzy), Fruupp (1970s Belfast prog-rock band), Van Morrison, Derek Bell (Chieftains), Ottilie Patterson (Chris barber Jazz Band) and Ruby Murray (one of the UK's biggest female vocalists of the 1950s and the origin of the UK rhyming slang term for 'a curry') might agree with me. I just hate the whole revisionist, self-aggrandising mindset')"]}, {"page": "Marmalade Records", "response": ["* Ottilie Patterson - \"Bitterness of Death\" / \"Spring Song\" (1969, Marmalade 598020)", "* Ottilie Patterson – 3000 Years With Ottilie (Album - July 1969, Marmalade 608011)"]}, {"page": "Jealous Heart", "response": ["In the UK the Vernons Girls and Ottilie Patterson had non-charting single versions of \"Jealous Heart\" in respectively 1959 and 1963 before the version by Irish act the Cadets with Eileen Reid reached No. 42 on the UK Top 50 dated 3 June 1965."]}, {"page": "1963 in jazz", "response": ["*Chris Barber: \"Chris Barber at the BBC\" with Joe Harriott and Ottilie Patterson"]}, {"page": "2011 in the United Kingdom", "response": ["*20 June – Ottilie Patterson, jazz singer (b. 1932)"]}, {"page": "1932 in jazz", "response": ["* 31 – Ottilie Patterson, Northern Irish singer (died 2011)."]}, {"page": "Deaths in June 2011", "response": ["*Ottilie Patterson, 79, Northern Irish singer."]}, {"page": "Terry Cryer", "response": ["* Ottilie Patterson"]}, {"page": "Come On Baby", "response": ["*\"Come On Baby\", song by Ottilie Patterson With Chris Barber's Jazz Band,  Ottilie Patterson\t1962"]}, {"page": "Anna Ottilie Patterson", "response": ["#REDIRECT Ottilie Patterson"]}, {"page": "Anna Ottilja Patterson", "response": ["#REDIRECT Ottilie Patterson"]}, {"page": "Ottilja Patterson", "response": ["#REDIRECT Ottilie Patterson"]}, {"page": "2011 in jazz", "response": ["* 20 – Ottilie Patterson, Northern Irish singer (born 1932)."]}, {"page": "List of years in jazz", "response": ["* 2011 in jazz, Ola Kvernberg awarded Jazz Spellemannprisen; Mari Kvien Brunvoll awarded Vossajazzprisen; deaths of Alys Robi, Amy Winehouse, André Hodeir, Beryl Davis, Bill Tapia, Billy Bang, Bob Flanigan, Bob Brookmeyer, Butch Ballard, Cesária Évora, Charles Fambrough, Christiane Legrand, Charlie Callas, Cornell Dupree, Dinah Kaye, Eugenio Toussaint, Frank Foster, Eddie Marshall, George Shearing, Gordon Beck, Graham Collier, György Szabados, Harald Johnsen, Jack Kevorkian, Jens Winther, Jiří Traxler, Joe Lee Wilson, Joe Morello, Johnny Răducanu, Lars Sjösten, Lucy Ann Polk, Melvin Sparks, Michael Garrick, Milton Babbitt, Norma Zimmer, Ottilie Patterson, Papa Bue, Paul Motian, Paul Weeden, Phoebe Snow, Ralph MacDonald, Ray Bryant, Roger Williams, Ross McManus, Russell Garcia, Sam Rivers, Snooky Young, Ted Nash, Tom Vaughn, Tony Levin, and Walter Norris.", "* 1932 in jazz, deaths of Frank Teschemacher, James \"Bubber\" Miley, Virginia Liston; births of Åke Persson, Akitoshi Igarashi, Al Aarons, Al Levitt, Alan Shorter, Alvin Batiste, Andy Simpkins, Atle Hammer, Ben Aronov, Bengt Hallberg, Bob Cranshaw, Bob Florence, Bobby Cole, Coleridge-Taylor Perkinson, Curtis Fuller, Dave MacKay, David Izenzon, Dick Charlesworth, Don Francks, Don Wilkerson, Donald Byrd, Dorothy Ashby, Duke Pearson, Earl Gill, Ed Bickert, Ed Lincoln, Eddie Higgins, Emil Richards, Ethel Ennis, Gato Barbieri, Gene Russell, Grady Tate, Hadley Caliman, Harold Rubin, Ian Hamer, Irene Kral, Jack Reilly, Jamil Nasser, Jerry Dodgion, Joe Zawinul, John Barnes, John Burch, John Chilton, Johnny Lytle, János Gonda, Keely Smith, Kiane Zawadi, Lalo Schifrin, Leo Welch, Leroy Jenkins, Les Spann, Lol Coxhill, Mark Murphy, Masaru Imada, Masayuki Takayanagi, Michel Legrand, Mickey Roker, Miriam Makeba, Oliver Nelson, Ottilie Patterson, Paul Bley, Pete Jolly, Rauno Lehtinen, Robin Douglas-Home, Roland Hanna, Shelley Moore, Shoji Suzuki, Slide Hampton, Sonny Red, Teddy Smith, Tina Brooks, Walter Davis Jr., Walter Perkins, Walter Wanderley, Webster Young, Whitey Mitchell, and Willis Jackson."]}, {"page": "Georgia Grind", "response": ["Eddie Condon and His Band released a Dixieland version in 1941 on Commodore Records. The band comprised Eddie Condon (guitar), Marty Marsala (trumpet), George Brunis (trombone), Artie Shapiro (bass), Fats Waller (piano), and George Wettling (drums).  It was re-mastered and re-issued as a single in January 2013. Chris Barber recorded a live version in 1958. Hermon Hitson was briefly part of Hermon and the Rockin' Tonics, whose debut recording was \"Been So Long\" / \"Georgia Grind\"  on Royal Records (1965). Frank Traynor released his version as a single in 1972. Ottilie Patterson released the song as the B-side of her 1982 single \"Careless Love\" (Fat Hen Records).A Life in Music: Chris Barber discography 1949–2001, Gerard Bielderman & Julian Purser, published by Gerard Bielderman, December 2001"]}, {"page": "Strictly Come Dancing (series 18)", "response": ["| \"(Won't You Come Home) Bill Bailey\"—Ottilie Patterson & Chris Barber"]}, {"page": "List of Private Passions episodes (2005–2009)", "response": ["|Traditional Arr. Ottilie Patterson"]}]}}