{"wiki_id": "http://www.wikidata.org/entity/Q2034202", "itemLabel": "Henry Pelham-Clinton, 4th Duke of Newcastle", "itemDescription": "British nobleman and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Pelham-Clinton,_4th_Duke_of_Newcastle", "wikipedia_page": {"main": "Henry Pelham Fiennes Pelham-Clinton, 4th Duke of Newcastle-under-Lyne  (31 January 1785 – 12 January 1851) was a British nobleman and politician who played a leading part in British politics in the late 1820s and early 1830s. He was styled Lord Clinton from birth until 1794 and Earl of Lincoln between 1794 and 1795.", "link_mentions": [{"page": "The Park Estate", "response": ["In 1663, the ruined castle and park was bought by William Cavendish, 1st Duke of Newcastle. He initially re-stocked the park with deer, but by the 1720s the area had been given over for cattle grazing. In 1800, whilst Henry Pelham-Clinton, 4th Duke of Newcastle was still a minor, his mother considered disposing of the park. Her agents advised against such a sale as they thought it would depress land values in Nottingham, and they recommended instead a gradual sale of small plots on the periphery of the park. The first domestic building in the park was built in 1809. Built opposite the castle gatehouse, the building served as the vicarage to St. Mary's Church.St. Mary's Parish Statement. St. Mary's PCC. 2003"]}, {"page": "List of knights and ladies of the Garter", "response": ["| Henry Pelham-Clinton, 4th Duke of Newcastle"]}, {"page": "Robert Smirke (architect)", "response": ["* the Milton Mausoleum at Milton, Nottinghamshire (1831–32) for Henry Pelham-Clinton, 4th Duke of Newcastle."]}, {"page": "Charles Tennyson d'Eyncourt", "response": ["* Edwin Clayton Tennyson d'Eyncourt (1813–1903), who entered the Royal Navy and became an Admiral; he married Lady Henrietta Pelham-Clinton, a daughter of Henry Pelham-Clinton, 4th Duke of Newcastle."]}, {"page": "Edwin Tennyson d'Eyncourt", "response": ["On 1 March 1859, Tennyson d'Eyncourt was married to Lady Henrietta Pelham-Clinton (1819–1890), the youngest surviving daughter of Henry Pelham-Clinton, 4th Duke of Newcastle and his wife, the former Georgiana Elizabeth Mundy (daughter and heiress of Edward Miller Mundy of Shipley Hall). Together, they were the parents of:"]}, {"page": "Edward Pelham-Clinton, 10th Duke of Newcastle", "response": ["Pelham-Clinton was the son of Guy Edward Pelham-Clinton, an army officer and a grandson of Lord Charles Clinton, who was a younger son of Henry Pelham-Clinton, 4th Duke of Newcastle. He was educated at Eton and Trinity College, Oxford, and served as an officer in the Royal Artillery during the Second World War, rising to the rank of captain. His younger brother, Alastair Pelham-Clinton, was a Royal Air Force Flying Officer and died in 1943 aged twenty."]}, {"page": "Henry Pelham Pelham-Clinton, 4th Duke of Newcastle", "response": ["#REDIRECT Henry Pelham-Clinton, 4th Duke of Newcastle"]}, {"page": "Ricketts baronets", "response": ["The second Baronet was an admiral in the Royal Navy and appointed High Sheriff of Leicestershire in 1851. He married, firstly, Henrietta Plumbe Tempest in 1834, and, secondly, Lady Caroline Augusta Pelham-Clinton, daughter of Henry Pelham-Clinton, 4th Duke of Newcastle in 1852."]}, {"page": "Duchess of Newcastle", "response": ["* Georgiana Mundy (d.1822), wife of Henry Pelham-Clinton, 4th Duke of Newcastle"]}, {"page": "Edward Miller Mundy (1750–1822)", "response": ["* Georgiana Elizabeth Miller Mundy (1789–1822), who married Henry Pelham-Clinton, 4th Duke of Newcastle in 1807."]}, {"page": "Lord Robert Clinton", "response": ["Clinton was a younger son of Henry Pelham-Clinton, 4th Duke of Newcastle, and Georgiana Elizabeth, daughter of Edward Miller-Mundy. Henry Pelham-Clinton, 5th Duke of Newcastle and Lord Charles Pelham-Clinton were his elder brothers."]}, {"page": "Henry Pelham-Clinton, 4th Duke of Newcastle-under-Lyne", "response": ["#REDIRECT Henry Pelham-Clinton, 4th Duke of Newcastle"]}, {"page": "Lord Charles Clinton", "response": ["Clinton was a younger son of Henry Pelham-Clinton, 4th Duke of Newcastle, and Georgiana Elizabeth, daughter of Edward Miller-Mundy. Henry Pelham-Clinton, 5th Duke of Newcastle was his elder brother and Lord Robert Pelham-Clinton his younger brother."]}, {"page": "Pelham-Clinton", "response": ["*Henry Pelham-Clinton, 4th Duke of Newcastle KG (1785–1851), British nobleman and politician"]}, {"page": "St Radegund's Church, Maplebeck", "response": ["The vicarage was built in 1849 to the designs of Thomas Chambers Hine funded by Henry Pelham-Clinton, 4th Duke of Newcastle."]}, {"page": "All Saints' Church, West Markham", "response": ["The church is the burial place of Henry Pelham-Clinton, 4th Duke of Newcastle. After his wife died in 1822, the 4th Duke built a church and mausoleum at Milton, Nottinghamshire. In 1833, when the new church at Milton was finished, it became the parish church, replacing the old one at West Markham. This situation was reversed, however, in 1949 when All Saints was reinstated as the parish church, and the Duke's mausoleum was left to decay. Milton Church, now simply a mausoleum, was finally rescued in 1972 when the Churches Conservation Trust took it into guardianship.Newcastle Mausoleum"]}, {"page": "Camilla Long", "response": ["Camilla Long is the daughter of Richard Pelham Long and Roslyn Vera Britton, a daughter of Captain Gordon Britton RN, who were married in 1973.Debrett's Peerage and Baronetage (Kelly's Directories, 2000), p. 1231 She has a younger sister, Zoe. Their father’s mother, Marjorie Pelham-Clinton (1910–2005), was a granddaughter of Lord Charles Clinton, a younger son of Henry Pelham-Clinton, 4th Duke of Newcastle. Their grandmother was a first cousin of the 10th Duke, who died in 1988.Burke’s Peerage, vol. 2 (2003), p. 2337"]}, {"page": "Newcastle Scholarship", "response": ["The scholarship was instituted and first awarded in 1829 on the initiative and benefaction of Henry Pelham-Clinton, 4th Duke of Newcastle. The Statutes, recorded in 1841, state:"]}, {"page": "Our Lady and St Peter's Church, Bothamsall", "response": ["The church dates from the 14th century. A design by William Wilkins of 1817 was rejected and the church was rebuilt in 1845 by Henry Pelham-Clinton, 4th Duke of Newcastle with stone from Worksop Manor."]}, {"page": "Sir Digby Neave, 3rd Baronet", "response": ["As mentor, Neave had Edward Gulson. They had a meeting in February 1836 at Clumber, with Henry Pelham-Clinton, 4th Duke of Newcastle. Another meeting to deal with Nottinghamshire Poor Law union issues, in the context of local politics and personalities, was with Robert Lowe at Bingham."]}, {"page": "4th Duke of Newcastle", "response": ["#redirect Henry Pelham-Clinton, 4th Duke of Newcastle"]}, {"page": "List of peers 1790–1799", "response": ["|Henry Pelham-Clinton, 4th Duke of Newcastle||1795||1851||"]}, {"page": "1831 reform riots", "response": ["Rioting broke out in Nottingham on 9 October upon learning of the defeat of the bill.  This was initially directed against the private houses of known opponents of reform.  On 10 October a public meeting turned to violence, the attendees marched on Colwick Hall, home of John Musters, which was damaged.  The same day the mob burned Nottingham Castle, home of anti-reform peer Henry Pelham-Clinton, 4th Duke of Newcastle, who was away at parliament.  Jails in Derby and Markeaton were also attacked and Lowe's Silk Mill in Beeston was burnt on 11 October, the same day the riots ceased.  The Duke was able to gather yeomanry and his own tenants to successfully defend his residence at Clumber Park."]}]}}