{"wiki_id": "http://www.wikidata.org/entity/Q203804", "itemLabel": "Tim Roth", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Roth", "wikipedia_page": {"main": "Timothy Simon Roth (born 14 May 1961) is an English actor. He began acting on films and television series in the 1980s. He was among a group of prominent British actors of the era, the \"Brit Pack\". He gained more attention for his role on films, including The Cook, the Thief, His Wife & Her Lover, Vincent & Theo, and Rosencrantz & Guildenstern Are Dead. Roth collaborated with Quentin Tarantino on several films, such as Reservoir Dogs, Pulp Fiction, Four Rooms and The Hateful Eight. For his performance in Rob Roy, Roth won the BAFTA Award for Best Actor in a Supporting Role, and was nominated for a Golden Globe Award for Best Supporting Actor – Motion Picture and the Academy Award for Best Supporting Actor. He made his directorial debut film The War Zone. He played Cal Lightman in the Fox series Lie to Me and Jim Worth / Jack Devlin in the Sky Atlantic series Tin Star. Roth also portrays Emil Blonsky / Abomination in the Marvel Cinematic Universe.", "link_mentions": [{"page": "Ennio Morricone", "response": ["After the success of Cinema Paradiso, the composer wrote the music for all subsequent films by Tornatore: the drama film Everybody's Fine (Stanno Tutti Bene, 1990), A Pure Formality (1994) starring Gérard Depardieu and Roman Polanski, The Star Maker (1995), The Legend of 1900 (1998) starring Tim Roth, the 2000 romantic drama Malèna (which featured Monica Bellucci) and the psychological thriller mystery film La sconosciuta (2006). Morricone also composed the scores for Baarìa (2009), The Best Offer (2013) starring Geoffrey Rush, Jim Sturgess and Donald Sutherland and the romantic drama The Correspondence (2015)Charlie Brigden: Ennio Morricone: 1928–2020 rogerebert.com & July 2020"]}, {"page": "Cinema of the United Kingdom", "response": ["Mainly outside the commercial sector, film makers from the new commonwealth countries had begun to emerge during the 1970s. Horace Ové's Pressure (1975) had been funded by the British Film Institute as was A Private Enterprise (1974), these being the first Black British and Asian British films, respectively. The 1980s however saw a wave of new talent, with films such as Franco Rosso's Babylon (1980), Menelik Shabazz's Burning an Illusion (1981) and Po-Chih Leong's Ping Pong (1986; one of the first films about Britain's Chinese community). Many of these films were assisted by the newly formed Channel 4, which had an official remit to provide for \"minority audiences.\" Commercial success was first achieved with My Beautiful Laundrette (1985). Dealing with racial and gay issues, it was developed from Hanif Kureishi's first film script. My Beautiful Laundrette features Daniel Day-Lewis in a leading role. Day-Lewis and other young British actors who were becoming stars, such as Gary Oldman, Colin Firth, Tim Roth and Rupert Everett, were dubbed the Brit Pack.Stern, Marlow, and in 1985 we saw the retirement of Roger Moore from the role of Bond after A View to a kill,at the age of 58.\"Gary Oldman Talks 'Tinker, Tailor, Soldier, Spy,' 'Batman' Retirement\". The Daily Beast. 8 December 2011. Retrieved 10 December 2013."]}, {"page": "Heart of Darkness", "response": ["On 13 March 1993, TNT aired a new version of the story, directed by Nicolas Roeg, starring Tim Roth as Marlow and John Malkovich as Kurtz.Tucker, Ken. Heart of Darkness. Entertainment Weekly, 11 March 1994. Retrieved 4 April 2010."]}, {"page": "Joseph Conrad", "response": ["* Heart of Darkness (1993) a TNT feature-length adaptation, directed by Nicolas Roeg, starring John Malkovich and Tim Roth; also released on VHS and DVD"]}, {"page": "May 14", "response": ["*  1961   – Tim Roth, English actor and director"]}, {"page": "Quentin Tarantino", "response": ["In November 2013, Tarantino said he was working on a new film and that it would be another Western. He stated that it would not be a sequel to Django. On January 12, 2014, it was revealed that the film would be titled The Hateful Eight. Production of the Western would most likely have begun in the summer of 2014, but after the script for the film leaked in January 2014, Tarantino considered dropping the movie and publishing it as a novel instead. He stated that he had given the script to a few trusted colleagues, including Bruce Dern, Tim Roth and Michael Madsen.", "On April 19, 2014, Tarantino directed a live reading of the leaked script at the United Artists Theater in the Ace Hotel Los Angeles. The event was organized by the Film Independent at the Los Angeles County Museum of Art, as part of the Live Read series. Tarantino explained that they would read the first draft of the script, and added that he was writing two new drafts with a different ending. The actors who joined Tarantino included Samuel L. Jackson, Kurt Russell, Amber Tamblyn, James Parks, Walton Goggins, and the first three actors to be given the script before the leak: Bruce Dern, Tim Roth and Michael Madsen. In October 2014, Jennifer Jason Leigh was in talks to play the female lead in the film.Jennifer Jason Leigh Tapped for Female Lead in Quentin Tarantino's 'Hateful Eight'. Variety (October 9, 2014). Retrieved on July 2, 2015. Leigh, Channing Tatum, and Demián Bichir joined the cast in November.", "Tarantino has built up an informal \"repertory company\" of actors who have appeared in many roles in his films. Most notable of these is Samuel L. Jackson, who has appeared in six films directed by Tarantino and a seventh written by him, True Romance. Other frequent collaborators include Uma Thurman, who has been featured in three films and whom Tarantino has described as his \"muse\"; Zoë Bell, who has acted or performed stunts in seven Tarantino films; Michael Madsen, James Parks and Tim Roth, who respectively appear in five, four and three films. In addition, Roth appeared in Four Rooms, an anthology film where Tarantino directed the final segment, and filmed a scene for Once Upon a Time in Hollywood before it was cut for time. Other actors who have appeared in several films by Tarantino include Michael Bacall, Michael Bowen, Bruce Dern, Harvey Keitel, Michael Parks, Kurt Russell, and Craig Stark, who have appeared in three films each. Leonardo DiCaprio and Brad Pitt have each appeared in two Tarantino films, the second of which, Once Upon a Time in Hollywood, they appear in together. Like Jackson, Pitt also appeared in the Tarantino-penned True Romance. Christoph Waltz appeared in two Tarantino films, Inglourious Basterds and Django Unchained, winning a Best Supporting Actor Oscar for each role. Waltz had been working as an actor since the 1970s in numerous German movies and TV shows but was a relative unknown when he was cast as Hans Landa in his first film for Tarantino.", "! Tim Roth"]}, {"page": "Rosencrantz and Guildenstern Are Dead", "response": ["The play was eventually adapted for a film released in February 1990, with screenplay and direction by Stoppard.  The motion picture is Stoppard's only film directing credit: \"[I]t began to become clear that it might be a good idea if I did it myself—at least the director wouldn't have to keep wondering what the author meant. It just seemed that I'd be the only person who could treat the play with the necessary disrespect.\" The cast included Gary Oldman as Rosencrantz, Tim Roth as Guildenstern, Richard Dreyfuss as the Player, Joanna Roth as Ophelia, Ian Richardson as Polonius, Joanna Miles as Gertrude, Donald Sumpter as Claudius, and Iain Glen as Hamlet."]}, {"page": "Twin Peaks", "response": ["Most of the original cast returns, including Kyle MacLachlan, Mädchen Amick, Sherilyn Fenn, Sheryl Lee, Ray Wise, and several others. Additions include Jeremy Davies, Laura Dern, Robert Forster, Tim Roth, Jennifer Jason Leigh, Amanda Seyfried, Matthew Lillard, and Naomi Watts."]}, {"page": "1961", "response": ["** Tim Roth, English actor and director"]}, {"page": "Everyone Says I Love You", "response": ["Everyone Says I Love You is a 1996 American musical film written and directed by Woody Allen. It stars Allen, Julia Roberts, Alan Alda, Edward Norton, Drew Barrymore, Tim Roth, Goldie Hawn and Natalie Portman. Set in New York City, Venice and Paris, it features singing by actors not usually known for their performances. The film did not do well commercially, but is among the more critically successful of Allen's films, with Chicago Sun-Times critic Roger Ebert even ranking it as one of Allen's best.", "* Tim Roth as Charles Ferry", "# \"Recurrence/If I Had You\" (Ted Shapiro, Jimmy Campbell, Reg Connelly) — Dick Hyman/Tim Roth"]}, {"page": "Sepp Blatter", "response": ["*United Passions, a 2014 film starring Tim Roth as Blatter"]}, {"page": "Ian Dury", "response": ["Dury's confident and unusual demeanour caught the eyes of producers and directors of drama. His first important and extensive role was in Farrukh Dhondy's mini-series for the BBC King of the Ghetto (1986), a drama set in London's multi-racial Brick Lane area with a cast led by a young Tim Roth."]}, {"page": "Severus Snape", "response": ["Before Alan Rickman was offered the role of Severus Snape, the role was originally offered to Tim Roth, who turned the role down in favour of portraying General Thade in Planet of the Apes.The Nerdist Podcast episode 776: \"Tim Roth\". 23 December 2015."]}, {"page": "Pulp Fiction", "response": ["Pulp Fiction is a 1994 American black comedy crime film written and directed by Quentin Tarantino, who conceived it with Roger Avary.See, e.g., King (2002), pp. 185–7; ;  Starring John Travolta, Samuel L. Jackson, Bruce Willis, Tim Roth, Ving Rhames, and Uma Thurman, it tells several stories of criminal Los Angeles. The title refers to the pulp magazines and hardboiled crime novels popular during the mid-20th century, known for their graphic violence and punchy dialogue.", "* Tim Roth as Ringo/\"Pumpkin\":"]}, {"page": "Ebertfest", "response": ["| Tim Roth, Jouko Ahola, Anna Gourari"]}, {"page": "Uma Thurman", "response": ["The Con Is On, an independent heist comedy Thurman filmed in 2015, opposite Tim Roth, was released on May 4, 2018. Both actors played a con-artist couple planning a jewel heist in Los Angeles, after escaping from a notorious Russian gangster. She reunited with director Lars von Trier to play the first victim of a serial killer during the 1980s in his psychological horror film The House That Jack Built, which premiered on May 14, 2018, at the Cannes Film Festival. In her next film, the supernatural thriller Down a Dark Hall (2018), directed by Rodrigo Cortés, Uma portrayed the role of Madame Duret, the eccentric headmistress of a mysterious school for troubled girls. In its review for the latter film, Variety noted that she \"cuts an elegant figure [...] but her somewhat unconvincing villain could have used more notes of mystery and wit\"."]}, {"page": "Paul McGann", "response": ["Following on from the part of Percy Toplis, McGann sought  a less controversial and more comedic role for his next project. In 1986, he was cast as the anonymous main character (Marwood) in Bruce Robinson's cult film, Withnail and I. He also starred as Anton Skrebensky in Ken Russell's 1989 adaptation of D.H. Lawrence's The Rainbow. McGann's other early film appearances include The Monk, Dealers, Tree of Hands and the epic war film Empire of the Sun. McGann and other young British actors who were becoming established film actors such as Tim Roth, Gary Oldman, Colin Firth and Bruce Payne were dubbed the 'Brit Pack'."]}, {"page": "Dulwich", "response": ["Famous people born in the area include: artist Madge Tennent in 1889; the author, Enid Blyton in 1897; the first compiler of the London A-Z, Phyllis Pearsall in East Dulwich in 1906, she went on to live in Dulwich Village; code breaker extraordinaire Mavis Batey, then Mavis Lever, was born in Dulwich on May 5, 1921; the war-time singer Anne Shelton who lived on Court Lane until shortly before her death in 1994; also on Court Lane, Dr Reginald John Gladstone FRSE embryologist, lived here until his house was destroyed in the blitz in 1941; footballer Trevor Sinclair in 1973; the actor Tim Roth in 1961; the TV personality Lisa Vanderpump in 1960; and actress Sally Hawkins in 1976."]}, {"page": "Tulse Hill", "response": ["*Strand School - Grammar School building, opened in 1913 in Elm Park; it is now called Elm Court School. Former pupils include actor and director Tim Roth, Mick Jones of The Clash, broadcaster David Jacobs, CBE, artist Euan Uglow, rock musician Fruitbat (Les Carter, co-founder of Carter USM), James Lovelock, CH, CBE, FRS, scientist and environmentalist who is best known for the Gaia hypothesis, Leroy Rosenior, professional footballer, coach and broadcaster, Jeremy Spencer, founder-member of Fleetwood Mac, politician Sir Reg Goodwin (former Leader of the Greater London Council) and Leonard Hussey, explorer."]}, {"page": "2001 in film", "response": ["| Planet of the Apes || 20th Century Fox || Tim Burton (director); William Broyles, Jr., Lawrence Konner, Mark Rosenthal (screenplay); Mark Wahlberg, Tim Roth, Helena Bonham Carter, Michael Clarke Duncan, Paul Giamatti, Estella Warren, Cary-Hiroyuki Tagawa, Kris Kristofferson, David Warner, Lisa Marie, Erick Avari, Luke Eberl, Evan Parke, Glenn Shadix, Freda Foh Shen, Chris Ellis, Anne Ramsay, Charlton Heston, Linda Harrison || Sci-Fi || Live action", "| The Musketeer || Universal Pictures / Miramax Films || Peter Hyams (director); Gene Quintano (screenplay); Catherine Deneuve, Mena Suvari, Stephen Rea, Tim Roth, Justin Chambers, Daniel Mesguich, Jean-Pierre Castaldi, Nick Moran, Steve Speirs, Jan-Gregor Kremp, Michael Byrne, David Schofield, Jeremy Clyde, Bill Treacher, Tsilla Chelton, Sonic Youth || Action || Live action", "* Planet of the Apes, directed by Tim Burton, starring Mark Wahlberg, Helena Bonham Carter, Tim Roth, Estella Warren and Michael Clarke Duncan"]}, {"page": "2000 in film", "response": ["| Lucky Numbers || Paramount Pictures / StudioCanal || Nora Ephron (director); Adam Resnick (screenplay); John Travolta, Lisa Kudrow, Tim Roth, Ed O'Neill, Bill Pullman, Michael Rapaport, Michael Moore, Daryl Mitchell, Richard Schiff, Caroline Aaron, Sam McMurray, Michael Weston, Maria Bamford, John F. O'Donohue, Colin Mochrie, Nick Loren, Jake Fritz, Emmy Laybourne, Ken Jenkins || Comedy || Live action", "| Vatel || Miramax Films || Roland Joffé (director); Jeanne Labrune, Tom Stoppard (screenplay); Gérard Depardieu, Uma Thurman, Tim Roth, Timothy Spall, Julian Glover, Julian Sands, Murray Lachlan Young, Hywel Bennett, Richard Griffiths, Arielle Dombasle, Marine Delterme, Philippine Leroy-Beaulieu, Jérôme Pradon, Féodor Atkine, Nathalie Cerda, Emilie Ohana, Sebastien Davis, Louis Bustin, Vincent Grass || Historical, Drama || Live action", "* Vatel, directed by Roland Joffé, starring Gérard Depardieu, Uma Thurman and Tim Roth"]}, {"page": "William Hurt", "response": ["In June 2007, Marvel Studios announced that Hurt would portray General Thaddeus Ross in the 2008 film The Incredible Hulk alongside Edward Norton, Liv Tyler and Tim Roth. Hurt reprised his role in Captain America: Civil War (2016), Avengers: Infinity War (2018), Avengers: Endgame (2019), and Black Widow (2021)."]}, {"page": "2003 in film", "response": ["* To Kill a King, starring Tim Roth, Dougray Scott, Olivia Williams and Rupert Everett – (UK)"]}, {"page": "1995 in film", "response": ["| Best Supporting Actor || colspan=\"2\"| Brad Pitt12 Monkeys || Kevin SpaceyThe Usual SuspectsEd HarrisApollo 13 || Ed HarrisApollo 13 || Kevin SpaceyThe Usual Suspects || Tim RothRob Roy", "| Rob Roy || United Artists || Michael Caton-Jones (director); Alan Sharp (screenplay); Liam Neeson, Jessica Lange, John Hurt, Tim Roth, Eric Stoltz, Andrew Keir, Brian Cox, Brian McCardie, Gilbert Martin, Jason Flemyng, Ewan Stewart, David Hayman, Shirley Henderson || Adventure || Live action", "| Little Odessa || Fine Line Features || James Gray (director/screenplay); Tim Roth, Edward Furlong, Moira Kelly, Vanessa Redgrave, Maximilian Schell, Mina Bern, Paul Guilfoyle, Natalya Andrejchenko, David Vadim, Boris McGiver, Tuesday Knight, Michael Khmurov, Dmitry Preyers, David Ross, Marianna Lead, Mohammed Ghaffari || Crime, Drama || Live action", "| Four Rooms || Miramax Films || Allison Anders, Alexandre Rockwell, Robert Rodriguez, Quentin Tarantino (directors/screenplay); Tim Roth, Antonio Banderas, Jennifer Beals, Paul Calderon, Sammi Davis, Valeria Golino, Madonna, David Proval, Ione Skye, Lili Taylor, Marisa Tomei, Tamlyn Tomita, Bruce Willis, Alicia Witt, Amanda de Cadenet, Lawrence Bender, Lana McKissack, Danny Verduzco, Patricia Vonne, Salma Hayek, Kathy Griffin, Quentin Tarantino || Comedy || Live action", "*Four Rooms, anthology starring Tim Roth, Madonna, Valeria Golino, Antonio Banderas, Tamlyn Tomita, Jennifer Beals", "*Rob Roy, directed by Michael Caton-Jones, starring Liam Neeson, Jessica Lange, John Hurt, Tim Roth"]}, {"page": "Manic Street Preachers", "response": ["Postcards from a Young Man was recorded with producer (and longtime Manics collaborator) Dave Eringa and was mixed in America by Chris Lord-Alge. It was released in a standard version, 2 CD deluxe version, and limited edition box set. The album cover art uses a black and white photograph of British actor Tim Roth."]}, {"page": "1996 in film", "response": ["| Captives || Miramax Films || Angela Pope (director); Frank Deasy (screenplay); Julia Ormond, Tim Roth, Keith Allen, Mark Strong, Siobhan Redmond, Peter Capaldi, Colin Salmon, Richard Hawley, Annette Badland, Jeff Nuttall, Kenneth Cope || Romance, Crime, Drama || Live action", "| Everyone Says I Love You || Miramax Films || Woody Allen (director/screenplay); Alan Alda, Woody Allen, Drew Barrymore, Lukas Haas, Goldie Hawn, Gaby Hoffmann, Natasha Lyonne, Edward Norton, Natalie Portman, Julia Roberts, Tim Roth, David Ogden Stiers, Itzhak Perlman, Edward Hibbert, Patrick Cranshaw, Billy Crudup, Robert Knepper, Scotty Bloch, Isiah Whitlock, Kevin Hagan, Navah Perlman, Waltrudis Buck, Christy Carlson Romano, Arlene Martell || Musical, Comedy || Live action", "* Everyone Says I Love You, directed by and starring Woody Allen, with Edward Norton, Drew Barrymore, Tim Roth, Alan Alda, Goldie Hawn, Julia Roberts"]}, {"page": "1997 in film", "response": ["| Gridlock'd || Gramercy Pictures || Vondie Curtis-Hall (director/screenplay); Tim Roth, Tupac Shakur, Lucy Liu, Thandie Newton, Charles Fleischer, Bokeem Woodbine, Howard Hesseman, John Sayles, Eric Payne, Tom Towles, Tom Wright, Billie Neal, James Pickens Jr., Debra Wilson, Rusty Schwimmer, Richmond Arquette, Elizabeth Peña, Kasi Lemmons, Vondie Curtis-Hall || Black comedy, Crime || Live action", "| Hoodlum || Metro-Goldwyn-Mayer || Bill Duke (director); Chris Brancato (screenplay); Laurence Fishburne, Tim Roth, Vanessa Williams, Andy García, Cicely Tyson, Chi McBride, Clarence Williams III, Richard Bradford, William Atherton, Loretta Devine, Queen Latifah, Ed O'Ross, Mike Starr, Beau Starr, Paul Benjamin, Tony Rich, David Darlow, Bill Henderson, Marc Vann, Leonard Roberts, Kevyn Morrow || Drama, Period || Live action", "* Gridlock'd, starring Tim Roth and Tupac Shakur"]}, {"page": "1998 in film", "response": ["* The Legend of 1900 (La leggenda del pianista sull'oceano), directed by Giuseppe Tornatore, starring Tim Roth, Pruitt Taylor Vince, Mélanie Thierry and Bill Nunn – (Italy/US)"]}, {"page": "1999 in film", "response": ["| The Legend of 1900 || Fine Line Features || Giuseppe Tornatore (director/screenplay); Tim Roth, Pruitt Taylor Vince, Mélanie Thierry, Bill Nunn, Peter Vaughan, Niall O'Brien, Gabriele Lavia, Alberto Vazquez, Clarence Williams III, Sidney Cole, Kevin McNally, Harry Ditson, Adrian McCourt, Eamon Geoghegan || Drama || Live action", "* The War Zone, directed by Tim Roth, starring Ray Winstone and Tilda Swinton (U.K.)"]}, {"page": "Colin Firth", "response": ["In 1987, Firth and other up-and-coming British actors such as Tim Roth, Bruce Payne and Paul McGann, were dubbed the 'Brit Pack'. That year, he appeared with Kenneth Branagh in the film version of J. L. Carr's A Month in the Country. Sheila Johnston observed a theme in his early work of playing those traumatised by war. He portrayed real-life British soldier Robert Lawrence MC in the 1988 BBC dramatisation Tumbledown. Lawrence was severely injured at the Battle of Mount Tumbledown during the Falklands War, and the film details his struggles to adjust to his disability whilst confronted with indifference from the government and public. It attracted controversy at the time, with criticism coming from left and right sides of the political spectrum. Despite this, the performance brought Firth a Royal TV Society Best Actor Award, and a nomination for the 1989 BAFTA Television Award. In 1989, he played the title role in Miloš Forman's Valmont, based on Les Liaisons dangereuses. Released just a year after Dangerous Liaisons, it did not make a big impact in comparison. That year he also played a paranoid, socially awkward character in the Argentinian psychological thriller Apartment Zero."]}, {"page": "1961 in television", "response": ["| Tim Roth"]}, {"page": "Daniel Day-Lewis", "response": ["Day-Lewis gained further public notice that year with A Room with a View (1985), based on the novel by E. M. Forster. Set in the Edwardian period of turn-of-the-20th-century England, he portrayed an entirely different character: Cecil Vyse, the proper upper-class fiancé of the main character. In 1987, Day-Lewis assumed leading man status by starring in Philip Kaufman's adaptation of Milan Kundera's The Unbearable Lightness of Being, in which he portrayed a Czech surgeon whose hyperactive sex life is thrown into disarray when he allows himself to become emotionally involved with a woman. During the eight-month shoot, he learned Czech, and first began to refuse to break character on or off the set for the entire shooting schedule. During this period, Day-Lewis was regarded as \"one of Britain’s most exciting young actors\". He and other young British actors of the time, such as Gary Oldman, Colin Firth, Tim Roth, and Bruce Payne, were dubbed the \"Brit Pack\"."]}, {"page": "1994 in film", "response": ["| Pulp Fiction || Miramax Films || Quentin Tarantino (director/screenplay); John Travolta, Samuel L. Jackson, Uma Thurman, Harvey Keitel, Tim Roth, Amanda Plummer, Maria de Medeiros, Ving Rhames, Eric Stoltz, Rosanna Arquette, Christopher Walken, Bruce Willis, Phil LaMarr, Frank Whaley, Burr Steers, Paul Calderon, Bronagh Gallagher, Steve Buscemi, Angela Jones, Kathy Griffin, Linda Kaye, Duane Whitaker, Peter Greene, Stephen Gibbert, Alexis Arquette, Quentin Tarantino, Julia Sweeney, Lawrence Bender || Crime || Live action", "*Captives, starring Tim Roth – (U.K.)", "*Little Odessa, starring Tim Roth and Edward Furlong"]}, {"page": "1990 in film", "response": ["| The Cook, the Thief, His Wife & Her Lover || Palace Pictures / Miramax || Peter Greenaway (director/screenplay); Richard Bohringer, Michael Gambon, Helen Mirren, Alan Howard, Tim Roth, Ciarán Hinds, Gary Olsen, Ewan Stewart, Roger Ashton-Griffiths, Liz Smith, Ian Dury, Diane Langton, Paul Russell, Emer Gillespie, Ron Cook, Alex Kingston, Roger Lloyd-Pack, Bob Goody || Crime, Drama || Live action", "* Rosencrantz & Guildenstern Are Dead, directed by Tom Stoppard, starring Richard Dreyfuss, Tim Roth and Gary Oldman ", "* Vincent & Theo, directed by Robert Altman, starring starring Tim Roth and Paul Rhys"]}]}}