{"wiki_id": "http://www.wikidata.org/entity/Q2047363", "itemLabel": "Mary Somerset, Duchess of Beaufort", "itemDescription": "British noblewoman, died 1987", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Somerset,_Duchess_of_Beaufort", "wikipedia_page": {"main": "Victoria Constance Mary Somerset, Duchess of Beaufort, CStJ (formerly Lady Mary Cambridge, née Princess Mary of Teck; 12 June 1897 – 23 June 1987) was a British peeress and sportswoman. The elder daughter of the 1st Marquess of Cambridge and Lady Margaret Grosvenor, she was the niece of Queen Mary.\n\n", "link_mentions": [{"page": "Mary of Teck", "response": ["During the Second World War, George VI wished his mother to be evacuated from London. Although she was reluctant, she decided to live at Badminton House, Gloucestershire, with her niece, Mary Somerset, Duchess of Beaufort, the daughter of her brother Adolphus.Pope-Hennessy, p. 596 Her personal belongings were transported from London in seventy pieces of luggage. Her household, which comprised fifty-five servants, occupied most of the house, except for the Duke and Duchess's private suites, until after the war. The only people to complain about the arrangements were the royal servants, who found the house too small, though Queen Mary annoyed her niece by having the ancient ivy torn from the walls as she considered it unattractive and a hazard. From Badminton, in support of the war effort, she visited troops and factories and directed the gathering of scrap materials. She was known to offer lifts to soldiers she spotted on the roads.Pope-Hennessy, p. 600 In 1942, her youngest surviving son, Prince George, Duke of Kent, was killed in an air crash while on active service. Mary finally returned to Marlborough House in June 1945, after the war in Europe had resulted in the defeat of Nazi Germany."]}, {"page": "David Somerset, 11th Duke of Beaufort", "response": ["By the time he was about twelve, it was becoming clear that his father's third cousin Henry Somerset, 10th Duke of Beaufort, was unlikely to have a son, unless his childless wife Mary Somerset, Duchess of Beaufort, died and he remarried, and that Somerset's father and elder brother were almost the heirs apparent. And then the outlook changed in April 1945, when his elder brother John Alexander Somerset was killed in action in the Allied invasion of Germany. As a result, at the age of seventeen Somerset himself became the likely heir."]}, {"page": "Duchess Mary", "response": ["*Mary Somerset, Duchess of Beaufort (1897–1987), Commander of the Order of St John"]}, {"page": "Mary Somerset", "response": ["*Mary Somerset, Duchess of Beaufort", "*Mary Somerset, Duchess of Beaufort (1630–1715)"]}, {"page": "Duchess of Beaufort", "response": ["* 2 December 1682 – 21 January 1700: Mary Somerset, Duchess of Beaufort (1630–1715), born Mary Capell. Wife of Henry Somerset, 1st Duke of Beaufort", "* 7 July 1702 – 18 June 1705: Mary Somerset, Duchess of Beaufort, born Mary Sackville. First wife of Henry Somerset, 2nd Duke of Beaufort", "* 14 September 1711 – 24 May 1714: Mary Somerset, Duchess of Beaufort, born Mary Osborne. Third wife of Henry Somerset, 2nd Duke of Beaufort", "* 24 November 1924 – 5 February 1984. Mary Somerset, Duchess of Beaufort, born Princess Mary of Teck and later The Lady Victoria Constance Mary Cambridge. Wife of Henry Somerset, 10th Duke of Beaufort"]}]}}