{"wiki_id": "http://www.wikidata.org/entity/Q204566", "itemLabel": "George Forrest", "itemDescription": "Scottish botanist  (1873-1932)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Forrest_(botanist)", "wikipedia_page": {"main": "George Forrest (13 March 1873 – 5 January 1932) was a Scottish botanist, who became one of the first western explorers of China's then remote southwestern province of Yunnan, generally regarded as the most biodiverse province in the country.\n\n", "link_mentions": [{"page": "Midlothian", "response": ["*George Forrest (1873–1932), a plant collector who gained fame with his expeditions to the far east who spent a significant part of his early years in Loanhead."]}, {"page": "Yunnan", "response": ["Thousands of plant, insect and mammal species were described in the 19th century by scientists of the French National Museum of Natural History, Paris, in connection with permanent settlements of missionaries of the  in north-west Yunnan, among them noticeably Jean-André Soulié and Felix Biet. From 1916 to 1917, Roy Chapman Andrews and Yvette Borup Andrews led the Asiatic Zoological Expedition of the American Museum of Natural History through much of western and southern Yunnan, as well as other provinces of China. The book, Camps and Trails in China, records their experiences. Other notable explorers include Heinrich Handel-Mazzetti; George Forrest; Joseph Francis Charles Rock, who from 1922 to 1949 spent most of his time studying the flora, peoples and languages of southwest China, mainly in Yunnan; and Peter Goullart, a White Russian who studied Naxi culture and lived in Lijiang from 1940 to 1949."]}, {"page": "Falkirk", "response": ["* George Forrest - a Scottish botanist. Famous for bringing back over 30,000 specimens of 10,000 plants mostly from the Yunnan Province of China."]}, {"page": "Primula bulleyana", "response": ["It was first introduced by George Forrest from Yunnan province, China, in 1906, and named after Arthur K Bulley, his first sponsor, who was a cotton broker from Liverpool and a keen amateur gardener.  He founded the Bees Ltd. nursery and was responsible for the introduction of many hardy plants and alpines to Britain in the early 20th century."]}, {"page": "George Forrest", "response": ["George Forrest may refer to:", "*George Forrest (author) (1915–1999), American author and musician", "*George Forrest (botanist) (1873–1932), Scottish botanist and plant collector", "*George Forrest (Northern Ireland politician) (1921–1968), Ulster Unionist Member of Parliament for Mid Ulster", "*George Forrest (soccer) (1904–1986), Canadian international soccer player", "*George Forrest (VC) (1800–1859), Irish Victoria Cross recipient", "*George Forrest (U.S. politician) (c. 1870–?), mayor of Juneau, Alaska", "*George Forrest (historian) (1925–1997), professor at the University of Oxford"]}, {"page": "Loanhead", "response": ["*George Forrest (1873–1932), a plant collector who gained fame with his expeditions to the far east, he spent a significant part of his early years in the town in a house in Linden Place, which sports a plaque marking the fact.George Forrest"]}, {"page": "Ness Botanic Gardens", "response": ["Ness Botanic Gardens are near the cities of Liverpool and Chester on the English-Welsh border in The Wirral. They occupy a site of 64 acres overlooking the Dee Estuary. The Ness Botanic Gardens were created by Arthur Kilpin Bulley (1861-1942), a wealthy cotton trader from Liverpool and benefited from collections by many garden hunters including George Forrest and Frank Kingdon-Ward.Julia Brittain Bill Terry "]}, {"page": "Bodnant Garden", "response": ["The development of the garden was continued by Henry and Agnes Pochin’s daughter Laura McLaren, Baroness Aberconway, who married Charles McLaren, 1st Baron Aberconway. Laura, like her mother, was a campaigner for women's suffrage and founded the Liberal Women's Suffrage Union. She was also a passionate gardener and inspired her son Henry McLaren, 2nd Baron Aberconway, to whom she entrusted the care of the garden in 1901. Together they created the Skating Pond at the Far End and began work on the Italianate Terraces. Henry McLaren oversaw the major developments of the garden. He sponsored plant hunting expeditions of the day by explorers such as Ernest Wilson, George Forrest and Frank Kingdon-Ward who brought back plants from China and the Himalayas including magnolias, camellias and rhododendrons. He also invested in a plant breeding programme producing Bodnant hybrid rhododendrons.", "In 1917 the recently formed Rhododendron Society, of which Lord Aberconway was a prominent member, employed plant hunter George Forrest to source rhododendrons. Forrest was a seasoned explorer who collected plants in western China and Tibet for nursery owner Arthur Bulley. His expeditions brought back seed of many new rhododendrons and Bodnant's gardeners were able to raise the plants in great numbers. Lord Aberconway and his head gardener Frederick Puddle set about hybridising the new rhododendron species they had raised, to create the Bodnant Hybrid Rhododendrons, of which the garden has around 350. Forrest also brought back to Bodnant Garden seed of Primula bulleyana still seen around the garden."]}, {"page": "Benmore Botanic Garden", "response": ["The Royal Botanic Garden Edinburgh (RBGE) was looking for a place to take the large collection of plants which the botanist George Forrest had brought from China, and the high rainfall at Benmore was ideal. In 1929 the Younger Botanic Gardens were opened as the first outstation of the RBGE. In the 1930s the Forestry Commission established Kilmun Arboretum, to try out tree species in the humid climate conditions, planting large groups of trees rather than individual specimens. Benmore house was used by the Forestry Commission for apprentice training, then in 1965 Edinburgh Corporation took it over as a schools outdoor education centre."]}, {"page": "Henry McLaren, 2nd Baron Aberconway", "response": ["McLaren was an industrialist, and chaired companies from both sides of the family, including John Brown & Company and the Tredegar Iron and Coal Company. In 1915 he was the founding chairman of the Design and Industries Association.DIA web site Around the end of his political career, in 1920, he had Aberconway House built as a residence in Mayfair. He would also inherit the family estate (originally his maternal grandfather's) in Conwy, North Wales, where he extensively developed and added to the Bodnant Garden. He was an avid horticulturalist and took interest in the breeding of rhododendrons and magnolias. He sponsored several botanical collectors, including George Forrest, and Rhododendron aberconwayi is named in his honour. He died at Bodnant, aged 74, and was buried at the mausoleum called \"The Poem\" within Bodnant Garden, the traditional burial place of the Lords Aberconway."]}, {"page": "Plant collecting", "response": ["The collection of live plant specimens from the wild, sometimes referred to as plant hunting,  is an activity that has occurred for centuries. The earliest recorded evidence of plant hunting was in 1495 BC when botanists were sent to Somalia to collect incense trees for Queen Hatshepsut. The Victorian era saw a surge in plant hunting activity as botanical adventurers explored the world to find exotic plants to bring home, often at considerable personal risk. These plants usually ended up in botanical gardens or the private gardens of wealthy collectors. Prolific plant hunters in this period included William Lobb and his brother Thomas Lobb, George Forrest, Joseph Hooker, Charles Maries and Robert Fortune."]}, {"page": "Kilmarnock Academy", "response": ["* George Forrest, botanist and explorer"]}, {"page": "Victoria Medal of Honour", "response": ["** George Forrest (1873–1932)"]}, {"page": "Beesia", "response": ["Beesia is a genus of flowering plants in the buttercup family. It was named in 1915 after the plant nursery firm Bees of Chester, who financed the plant hunting trips of George Forrest and Frank Kingdon-Ward in China.Roy Lancaster Travels in China: A Plantsman's Paradise "]}, {"page": "Abies forrestii", "response": ["Abies forrestii is a species of conifer in the family Pinaceae, endemic to China. It is named after the Scottish botanist and plant-hunter George Forrest (1873–1932), who discovered it for western science in Yunnan province. Its common names include Forrest's fir."]}, {"page": "Golden-breasted fulvetta", "response": ["*L. c. forresti, described by Walter Rothschild in 1926, is found in northeastern Myanmar and northwestern Yunnan (in southern China). They have the coronal stripe made up of white spots which are yellowish towards the nape. It is named after the collector of the type specimen, George Forrest."]}, {"page": "Hemipilia forrestii", "response": ["Hemipilia forrestii is a species of plant in the family Orchidaceae. It is endemic to China. It was named in honour of George Forrest (1873-1932)."]}, {"page": "Pleione forrestii", "response": ["It was named in honour of George Forrest (1873-1932)."]}, {"page": "Rhododendron cyanocarpum", "response": ["It was originally discovered by Père Jean Marie Delavay, but later introduced to western horticulture by George Forrest in 1902. "]}, {"page": "Platanthera calceoliformis", "response": ["The species was first described by William Wright Smith in 1921 as Herminium calceoliforme, having been collected by George Forrest in 1914 on the watershed between the Mekong and Yangtze rivers."]}, {"page": "Pilea peperomioides", "response": ["George Forrest was the first westerner to collect Pilea peperomioides, in 1906 and again in 1910, in the Cang Mountain range in Yunnan Province."]}, {"page": "Utricularia forrestii", "response": ["Utricularia forrestii is a small perennial carnivorous plant that belongs to the genus Utricularia. Its native distribution includes northern Burma and western China. It is represented in herberia by only four specimens. U. forrestii grows as a lithophyte on rocks among mosses at altitudes from  to . It was originally described by Peter Taylor in 1986 and named in honor of George Forrest.Taylor, Peter. (1989). The genus Utricularia - a taxonomic monograph. Kew Bulletin Additional Series XIV: London."]}, {"page": "Veitch Memorial Medal", "response": ["* 1927 : George Forrest (1873–1932)"]}, {"page": "Salvia castanea", "response": ["Salvia castanea is a herbaceous perennial plant discovered in the Yunnan Valley in China in 1904 by plant collector George Forrest. It also grows in Nepal, Bhutan, and Tibet. The plants used in horticulture today likely came from seed collected from a plant at 14,000 ft in Nepal, at the base of Mt. Everest. It grows 3 ft tall in the wild, and 1–2 feet in cultivation in Europe and the U.S. The few 1.0–1.5 in flowers grow in whorls on an inflorescence about 1 ft long. The name castanea, which means 'chestnut colored', refers to the purplish-maroon flowers "]}, {"page": "Salvia digitaloides", "response": ["Salvia digitaloides is a herbaceous perennial shrub native to the Chinese provinces of Guizhou, Sichuan, and Yunnan, first collected by Scot botanist George Forrest and named by Friedrich Ludwig Emil Diels in Germany in 1912, from Forrest's specimens. In its native habitat it grows between 7,000 and 11,000 ft elevation in dry shady pine forests, in east-facing scrub oak forests, and on grassy hillsides and valleys. Uncommon in horticulture, seeds have been collected and plants displayed at Quarryhill Botanical Garden in Glen Ellyn, California. The plant is used medicinally in Yunnan."]}, {"page": "Buddleja fallowiana", "response": ["Buddleja fallowiana is a species of flowering plant in the figwort family Scrophulariaceae. It is endemic to the Yunnan province of western China, where it grows in open woodland, along forest edges and watercourses.Bean, W. J. (1917). Trees and shrubs hardy in Great Britain, 7th edition. Murray, London.  The plant was collected in China by the Scottish botanist George Forrest in 1906, and named in 1917 by Balfour & Smith for George Fallow, a gardener at the Royal Botanic Garden Edinburgh. Fallow had died in Egypt in 1915 from wounds sustained fighting in the Gallipoli Campaign.Sabourin, L. (1929). Le Buddleja fallowiana et sa variété alba. Revue Horticole, pp. 418-420, Vol. 101. 1929."]}, {"page": "Bulbophyllum forrestii", "response": ["Bulbophyllum forrestii is a species of orchid in the genus Bulbophyllum. It was named in honour of George Forrest (1873-1932)."]}, {"page": "Ruellia drymophila", "response": ["The type specimen was collected by botanist George Forrest in August 1906, from the vicinity of Lijiang, Yunnan, at the forested base of a mountain (8500–10,000 ft elevation)."]}, {"page": "Osmanthus delavayi", "response": ["Osmanthus delavayi was discovered by the Jesuit missionary-botanist Fr Pierre Jean Marie Delavay in the mountains near Lan-kong in Yunnan province, China, in 1890. He sent seed to the French nurseryman Vilmorin. Though Maurice de Vilmorin distributed the seed among various correspondents, only a single seed germinated. All the O. delavayi of European gardens were cloned from this one source, until George Forrest obtained further supplies of seed in China after World War I.Alice M. Coats, Garden Shrubs and Their Histories (1964) 1992, s.v. \"Osmanthus\".Franchet, Adrien René. 1886. Bulletin Mensuel de la Société Linnéenne de Paris 1(77): 613–614 Osmanthus delavayi"]}, {"page": "Buddleja forrestii", "response": ["Buddleja forrestii is a deciduous shrub or small tree widely distributed from India to western China. First described by Diels in 1912, he named the species for plant hunter George Forrest, who discovered the plant in Yunnan in 1904 and introduced it to Western cultivation.Stuart, D. (2006). Buddlejas. RHS Plant Collector Guide. Timber Press, Oregon, USA. Bean, W. J. (1914). Trees and shrubs hardy in the British Isles, Vol. 1. p. 323. 7th Ed. 1950. Murray, London."]}, {"page": "Roscoea forrestii", "response": ["Roscoea forrestii is a perennial herbaceous plant occurring in the Sichuan and Yunnan provinces of China. Most members of the ginger family (Zingiberaceae), to which it belongs, are tropical, but R. forrestii, like other species of Roscoea, grows in much colder mountainous regions. It is sometimes grown as an ornamental plant in gardens. It was named after George Forrest (1873–1932) who discovered it in Yunnan.", "Roscoea forrestii was first described scientifically by Elizabeth Jill Cowley, a British botanist, in 1982. The specific epithet commemorates the Scottish plant collector George Forrest, who collected widely in western China and introduced many new garden plants to Europe and beyond. The type specimen was collected by Forrest in 1913 at 3,050 m in the Dali range in Yunnan."]}, {"page": "Buddleja limitanea", "response": ["Buddleja limitanea is a small deciduous shrub. Discovered by George Forrest in Yunnan (1912) and in northern Burma (1914), described by William Wright Smith in 1916.Smith W.W. (1916). Notes Royal Botanic Gardens Edinburgh 9: 86.  Resembling a small B. forrestii and hence sunk under  this name by Leeuwenberg,Leeuwenberg, A. J. M. (1979) The Loganiaceae of Africa XVIII Buddleja L. II, Revision of the African & Asiatic species. H. Veenman & Zonen, Wageningen, Nederland."]}, {"page": "Rhododendron keleticum", "response": ["Category:Taxa named by George Forrest (botanist)"]}]}}