{"wiki_id": "http://www.wikidata.org/entity/Q204426", "itemLabel": "Jane Asher", "itemDescription": "English actress, author, and entrepreneur", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_Asher", "wikipedia_page": {"main": "Jane Asher (born 5 April 1946) is an English actress, author and entrepreneur. She achieved early fame as a child actress and has worked extensively in film and TV throughout her career.\nAsher has appeared in TV shows and films such as Deep End, The Masque of the Red Death, Alfie, The Mistress, Crossroads, Death at a Funeral, and The Old Guys. She has also appeared in two episodes of the 1950s TV series 'The Buccaneers' alongside Robert Shaw. She is also known for supplying specialist cakes and kitchenware, and publishing three best-selling novels. She was a key figure of 1960s UK entertainment and arts culture and was well known as the girlfriend and muse of Beatle Paul McCartney.", "link_mentions": [{"page": "Hercule Poirot", "response": ["In 2017, Audible released an original audio adaptation of Murder on the Orient Express starring Tom Conti as Poirot. The cast included Jane Asher as Mrs. Hubbard, Jay Benedict as Monsieur Bouc, Ruta Gedmintas as Countess Andrenyi, Sophie Okonedo as Mary Debenham, Eddie Marsan as Ratchett, Walles Hamonde as Hector MacQueen, Paterson Joseph as Colonel Arbuthnot, Rula Lenska as Princess Dragimiroff and Art Malik as the Narrator.  According to the Publisher's Summary on Audible.com, \"sound effects [were] recorded on the Orient Express itself.\""]}, {"page": "April 5", "response": ["*1946 – Jane Asher, English actress"]}, {"page": "Through the Looking-Glass", "response": ["* A dramatised audio-recorded version, directed by Douglas Cleverdon, was released in 1959 by Argo Records. The book is narrated by Margaretta Scott, starring Jane Asher as Alice, along with actors Frank Duncan (Humpty Dumpty, Red King, Frog), Tony Church, Norman Shelley, and Carleton Hobbs.Cleverdon, Douglas (1959). Alice Through the Looking Glass [sound recording]. Written by Lewis Carroll (1872). London: Argo. Retrieved via National Library of Australia and Archived on 10 April 2020."]}, {"page": "1946", "response": ["** Jane Asher, English actress"]}, {"page": "British sitcom", "response": ["The Mistress (1985–1987) aired on BBC2 for 12 episodes. Starring Felicity Kendal and Jane Asher, it was written by Carla Lane. It features Kendal playing Maxine, a young florist who is having an affair with a married man, whose wife was played by Asher. The series was produced and directed by Gareth Gwenlan. Series 2 was attempted to be rounded out slightly, while still retaining the thread of having an affair, but serving as a more general comedy."]}, {"page": "Jane Seymour", "response": ["* In 1972, this interpretation was repeated in the film Henry VIII and His Six Wives, adapted from the BBC series, in which Keith Michell reprised his role as Henry; on this occasion Seymour was played by Jane Asher."]}, {"page": "East Lynne", "response": ["The story was last refilmed in 1982, in a star-studded BBC made-for-television production starring amongst many others Martin Shaw, Gemma Craven, Lisa Eichhorn, Jane Asher, Annette Crosbie and Tim Woodward."]}, {"page": "Beatles for Sale", "response": ["The album features eight Lennon–McCartney compositions. In addition, the pair wrote both sides of the non-album single, \"I Feel Fine\" backed with \"She's a Woman\", which accompanied the LP's release. At this stage in their partnership, Lennon and McCartney rarely wrote together as before, but each would often contribute key parts to songs for which the other was the primary author. Nevertheless, Lennon's level of contribution to Beatles for Sale outweighed McCartney's, a situation that, as on A Hard Day's Night, author Ian MacDonald attributes to McCartney's commitment being temporarily sidetracked by his relationship with English actress Jane Asher.", "The lyrics of \"What You're Doing\" concern McCartney's relationship with Jane Asher and demonstrate an aggrieved tone that was uncharacteristic of his writing. Author Simon Philo identifies the song's combination of musical arrangement, \"sonic texture\" and lyrics as an early example of the influence of cannabis on McCartney, who said the drug made him start \"really thinking for the first time\". The recording features a syncopated drum pattern and a jangly Rickenbacker guitar riff, as well as an instrumental coda that McCartney introduces by playing high up on the neck of his Höfner bass. A satisfactory arrangement proved elusive until the band remade the track on the final day of the Beatles for Sale sessions. While highlighting the studio techniques used to achieve the completed recording, MacDonald considers \"What You're Doing\" to be a possible rival to \"I Feel Fine\" as the Beatles' \"first sound experiment\"."]}, {"page": "Rubber Soul", "response": ["Written by McCartney, \"You Won't See Me\" reflects the difficulties he was experiencing in his relationship with actress Jane Asher due to her refusal to put her acting career second to his needs. Gould identifies the song as the third consecutive track in which the narrative conveys miscommunication. McCartney described its music as \"very Motown-flavored\", with a \"feel\" inspired by Motown bassist James Jamerson. The verses use the same chord sequence as the Four Tops' hit \"It's the Same Old Song\", which was titled by its writers, the Holland–Dozier–Holland team, in acknowledgement that they had already used the same pattern in their composition \"I Can't Help Myself\"."]}, {"page": "Revolver (Beatles album)", "response": ["\"For No One\" was inspired by McCartney's relationship with English actress Jane Asher. Along with \"Good Day Sunshine\", which similarly dispensed with guitar parts for Harrison and Lennon, Rodriguez cites the track as an example of McCartney eschewing the group dynamic when recording his songs, a trend that would prove unpopular with his bandmates in later years. The recording features McCartney playing piano, bass and clavichord, accompanied by Starr on drums and percussion. The French horn solo was added by Alan Civil, the principal horn player for the Philharmonia Orchestra, who recalled having to \"busk\" his part, with little guidance from McCartney or Martin at the overdubbing session. While recognising McCartney's \"customary logic\" in the song's musical structure, MacDonald comments on the sense of detachment conveyed in the lyrics to this \"curiously phlegmatic account of the end of an affair\". MacDonald suggests that McCartney was attempting to employ the same \"dry cinematic eye\" that director John Schlesinger had adopted in his 1965 film Darling."]}, {"page": "George Martin", "response": ["Encouraged by the pianist, teacher and broadcaster Sidney Harrison Martin used his veteran's grant to attend the Guildhall School of Music and Drama from 1947 to 1950. He studied piano and oboe, being interested in the music of Rachmaninoff and Ravel and Cole Porter. His oboe teacher was Margaret Eliot (the mother of Jane Asher, who later became involved with Paul McCartney).  After that, Martin explained that he had just picked it up by himself. On 3 January 1948 – while still at the Academy – he married Sheena Chisholm, with whom he had two children, Alexis and Gregory Paul Martin. He later married Judy Lockhart-Smith on 24 June 1966, and they also had two children, Lucie and Giles Martin.George Martin's Biography musicianguide.com. Retrieved: 23 September 2007"]}, {"page": "Eric Sykes", "response": ["In 1956, Sykes performed, wrote scripts, and acted as script editor for the pioneering Rediffusion TV comedy The Idiot Weekly, Price 2d, the first attempt to translate the humour of the Goons to television. It starred Peter Sellers, with Sykes, Kenneth Connor, and Valentine Dyall. During this year he also made his second film appearance, playing a minor role in the Max Bygraves film Charley Moon, which also featured Bill Fraser, Peter Jones, Dennis Price, and (as a child) Jane Asher. During 1956–57, Sykes also wrote for and performed in The Tony Hancock Show, where he again worked with Hattie Jacques."]}, {"page": "Twm Siôn Cati", "response": ["The television series Hawkmoor created by Lynn Hughes and starring John Ogwen as Twm and Jane Asher as Lady Johane Williams was broadcast by the BBC in 1978, depicting Twm as a Welsh Robin Hood/freedom fighter protecting the Welsh people from the repression of English-born Sheriff John Stedman (Jack May) and the cruel (Catholic) Vicar Davyd (Philip Madoc). A Penguin paperback relating some of the television adventures (and containing a poem actually written by Twm) was written by Lynn Hughes and published in 1978."]}, {"page": "Mal Evans", "response": ["In the spring of 1967—after the album was completed—Evans flew with McCartney to Los Angeles to see McCartney's then-girlfriend, Jane Asher, who was acting there with the Old Vic theatre company. The three of them went on a trip to the Rockies, returning to LA in Frank Sinatra's jet. Evans: \"We left Denver in Frank Sinatra's Lear Jet, which he very kindly loaned us. A beautiful job with dark black leather upholstery and, to our delight, a well-stocked bar.\" When they were back in LA, they were invited to visit the house of Michelle and John Phillips, from the Mamas & the Papas. Brian Wilson was also there, as he was working on the Beach Boys' Smile album. Evans wrote about singing \"On Top of Old Smokey\" with McCartney and Wilson, but was not impressed by Wilson's avant-garde attitude to music: \"Brian [Wilson] then put a damper on the spontaneity of the whole affair by walking in with a tray of water-filled glasses, trying to arrange it into some sort of session.\""]}, {"page": "Magic Alex", "response": ["The Beatles had tried in 1964 to buy the  Trinity Island, (Greek: Αγια Τριάδα), off the coast of the Greek island of Euboea (pronounced EV-i-a) (resembling a guitar in shape) but the owners were not interested in a sale. Lennon was still interested in buying or leasing an island to live on together, and discussed it with the other Beatles on 19 July 1967. Mardas' father was a major in the Greek secret police, and Mardas explained that through him the Beatles would have access to Greek government connections, which would speed the acquisition of an island, because many islands did have the right certificates of ownership and were subject to government restrictions. On 22 July 1967, Harrison and his wife Pattie Boyd, Ringo Starr and Neil Aspinall flew to Athens, where they stayed in Mardas' parents' house overnight, until Lennon, along with Cynthia Lennon and their son Julian Lennon, McCartney and Jane Asher, Pattie Boyd's 16-year-old sister Paula, Mal Evans and Alistair Taylor set off for Athens."]}, {"page": "Magical Mystery Tour", "response": ["*\"All You Need Is Love\" – George Martin on piano; Mick Jagger, Keith Richards, Marianne Faithfull, Keith Moon, Eric Clapton, Pattie Boyd Harrison, Jane Asher, Mike McGear, Graham Nash, Gary Leeds, Hunter Davies and others on backing vocals; Sidney Sax, Patrick Halling, Eric Bowie and John Ronayne on violins; Lionel Ross and Jack Holmes on cellos; Rex Morris and Don Honeywill on tenor saxophones; David Mason and Stanley Woods on trumpets and flugelhorn; Evan Watkins and Henry Spain on trombones; Jack Emblow on accordion"]}, {"page": "Yesterday (Beatles song)", "response": ["According to biographers of McCartney and the Beatles, McCartney composed the entire melody in a dream one night in his room at the Wimpole Street home of his then girlfriend Jane Asher and her family. Upon waking, he hurried to a piano and played the tune to avoid forgetting it."]}, {"page": "Great Expectations", "response": ["* 2016 – West Yorkshire Playhouse adaptation written by Michael Eaton and directed by Lucy Bailey. Starring Jane Asher as Miss Havisham."]}, {"page": "Hey Jude", "response": ["Other people believed McCartney wrote the song about them, including Judith Simons, a journalist with the Daily Express. Still others, including Lennon, have speculated that in the lyrics to \"Hey Jude\", McCartney's failing long-term relationship with Jane Asher provided an unconscious \"message to himself\". McCartney and Asher had announced their engagement on 25 December 1967, yet he began an affair with Linda Eastman in June 1968; that same month, Francie Schwartz, an American who was in London to discuss a film proposal with Apple, began living with McCartney in St John's Wood. When Lennon mentioned that he thought the song was about him and Ono, McCartney denied it and told Lennon he had written the song about himself."]}, {"page": "The Good Life (1975 TV series)", "response": ["After the success of The Good Life, the four cast members, most of whom were little-known beforehand, were given their own \"vehicles\" commissioned by the then Head of Comedy and producer of The Good Life, John Howard Davies. Immediately after the series ended, Larbey & Esmonde created a new show for Richard Briers, co-starring Michael Gambon. The Other One was a seven-part sitcom that aired on BBC1 in the autumn of 1977, running concurrently with The Good Life Christmas Special – Silly, but it's fun. A second series of 6 episodes aired in early 1979. Keith starred alongside Peter Bowles in To the Manor Born, which began in September 1979. Eddington joined Nigel Hawthorne and Derek Fowlds in Yes Minister and its sequel Yes Prime Minister. Kendal, who had become something of a sex symbol, went on to join Elspet Gray in Solo, and Jane Asher in The Mistress. Briers later starred alongside Penelope Wilton and Peter Egan in the popular sitcom Ever Decreasing Circles. In 1992, Kendal and Eddington reunited in the Channel Four adaptation of Mary Wesley's The Camomile Lawn."]}, {"page": "Laurence Harvey", "response": ["|Jane Asher, Diana Churchill"]}, {"page": "Peter and Gordon", "response": ["Peter Asher and his sister Jane were child actors in the 1950s. They played siblings in a 1955 episode of the television series The Adventures of Robin Hood. Jane Asher and Paul McCartney dated each other between 1963 and 1968, and Peter and Gordon recorded several songs written by McCartney but credited to Lennon–McCartney. Those hits included \"A World Without Love\" (US & UK #1), \"Nobody I Know\" (US #12; UK #10), \"I Don't Want To See You Again\" (US #16, but not a hit in the UK), and \"Woman\"."]}, {"page": "1967 in television", "response": ["*June 25 – The special Our World becomes the first live worldwide \"via satellite\" TV broadcast, transmitting to 30 countries.  Performers include Mick Jagger, Marianne Faithfull, Keith Richards, Keith Moon, Eric Clapton, Pattie Harrison, Jane Asher, Graham Nash, Hunter Davies, and The Beatles (who perform \"All You Need Is Love,\" a song composed especially for the occasion)."]}, {"page": "1946 in television", "response": ["* April 5 – Jane Asher, English actress"]}, {"page": "1985 in film", "response": ["| Dreamchild || Thorn EMI || Gavin Millar (director); Dennis Potter (screenplay); Coral Browne, Peter Gallagher, Ian Holm, Jane Asher, Nicola Cowper, Caris Corfman, Amelia Shankley, Alan Bennett, Ken Campbell, Tony Haygarth, Fulton Mackay, Frank Middlemass, Julie Walters, Big Mick, Ron Mueck, Karen Prell, Michael Sundin, Steve Whitmire || Drama || Live action"]}, {"page": "1972 in film", "response": ["*Henry VIII and His Six Wives, starring Keith Michell, Charlotte Rampling, Jane Asher – (U.K.)"]}, {"page": "1970 in film", "response": ["*Deep End, directed by Jerzy Skolimowski, starring Jane Asher - (U.K./West Germany)"]}, {"page": "1964 in film", "response": ["* The Masque of the Red Death, starring Vincent Price, Hazel Court and Jane Asher – (U.K.)"]}, {"page": "Maharishi Mahesh Yogi", "response": ["He and the Beatles met in London in August 1967, when George Harrison and his wife Pattie Boyd urged their friends to attend the Maharishi's lecture at the Hilton on Park Lane. The band members went to study with the Maharishi in Bangor, Wales, before travelling to Rishikesh, India, in February 1968 to \"devote themselves fully to his instruction\". Ringo Starr and his wife Maureen left after ten days, Paul McCartney and Jane Asher left after five weeks; the group's most dedicated students, Harrison and John Lennon, departed with their wives sixteen days later."]}, {"page": "Klaus Voormann", "response": ["In the early 1960s, Voormann decided to leave Germany and move to London. George Harrison invited him to live in the Green Street flat in London's Mayfair, formerly shared by all four members of the Beatles: Lennon had moved out to live with his wife Cynthia Lennon, and McCartney went to live in the attic of the home of the parents of his girlfriend Jane Asher. Voormann lived with Harrison and Ringo Starr for a time, before finding work as a commercial artist and renting an apartment of his own. He returned to Hamburg in 1963, where he founded a band called 'Paddy, Klaus & Gibson' with Paddy Chambers on guitar and vocals, Voormann on bass and vocals and Gibson Kemp on drums."]}, {"page": "Gerald Scarfe", "response": ["In 2003 Scarfe collaborated with the National Portrait Gallery and BBC Four to make caricatures of a number of famous Britons, to depict (along with guest commentary) their heroic and villainous attributes.  Amongst the over 30 portraits he depicted included caricatures of Henry VIII, Winston Churchill, Queen Elizabeth I, Pete Best, Richard Branson, Adam Smith, William Blake, The Beatles, Agatha Christie and Diana, Princess of Wales. In 2009, he also created a caricature of James May out of Lego which was shown in episode 5 of James May's Toy Stories.  Scarfe and Jane Asher also appeared in the episode. ", "He is married to actress Jane Asher, whom he met in 1971. The couple wed in 1981GRO Register of Marriages: SEP 1981 13 1708 KEN&CHELSEA - Scarfe = Asher and have a daughter Katie and two sons Alex and Rory."]}, {"page": "Mike McGear", "response": ["* The album McGough and McGear was by Roger McGough and Mike McGear.  Guest musicians, uncredited on the original pressing, include: Jimi Hendrix, Mitch Mitchell, Zoot Money, Paul Samwell-Smith, Gary Leeds and Paul McCartney. Paul's then-girlfriend, Jane Asher, also uncredited, contributed backing vocals on the song \"Living Room.\""]}, {"page": "Leytonstone", "response": ["*Deep End, a 1970 British-German drama starring Jane Asher with a soundtrack by Can, was partly shot on Cann Hall Road and Cathall Road Baths (built 1906, rebuilt later in 1977).Deep End filming locations at IMDb"]}, {"page": "The Adventures of Robin Hood (TV series)", "response": ["Actors appearing in the series who later became better-known included: Lionel Jeffries, Leslie Phillips, Jane Asher, Anne Reid, Edward Mulhare, Patrick Troughton (who in 1953 had been the first actor to portray Robin Hood on TV in a live BBC series), Irene Handl, Nicholas Parsons, Desmond Llewelyn, Sid James, Joan Sims, Bernard Bresslaw, Leo McKern, Alfie Bass, Harry H. Corbett and Wilfrid Brambell (Steptoe and Son), Billie Whitelaw, Paul Eddington, Ronald Allen and Gordon Jackson. John Schlesinger appeared as an actor in three episodes as singing minstrels (Hale and Alan a Dale (series 2)). A number of well-known actresses appeared as Saxon or Norman ladies, including Greta Gynt and Brenda de Banzie."]}, {"page": "Here, There and Everywhere", "response": ["Rolling Stone has noted: \"The tune's chord sequence bears Brian Wilson's influence, ambling through three related keys without ever fully settling into one, and the modulations – particularly the one on the line 'changing my life with a wave of her hand' – deftly underscore the lyrics, inspired by McCartney's girlfriend, actress Jane Asher.\""]}, {"page": "For No One", "response": ["McCartney recalls writing \"For No One\" in the bathroom of a ski resort in the Swiss Alps while on holiday with his then girlfriend Jane Asher. He said, \"I suspect it was about another argument.\" The lyrics end enigmatically with the line \"A love that should have lasted years\". The song's working title was \"Why Did It Die?\" The composition is built on a descending scale progression with a refrain that modulates to the supertonic minor."]}, {"page": "Queen's College, London", "response": ["*Jane Asher, actress, entrepreneur, and philanthropist"]}, {"page": "Blithe Spirit (play)", "response": ["In July 1970, the play was revived in the West End at the Globe Theatre, starring Patrick Cargill as Charles, Phyllis Calvert as Ruth, Amanda Reiss as Elvira and Beryl Reid as Madame Arcati; it ran until January 1971.\"Theatres\", The Times, 23 July 1970; and 14 January 1971, p. 10 It was revived by the National Theatre in 1976 in a production directed by Harold Pinter, starring Richard Johnson as Charles, Rowena Cooper as Ruth, Maria Aitken as Elvira and Elizabeth Spriggs as Madame Arcati. Another London revival played in 1986 at the Vaudeville Theatre, starring Simon Cadell as Charles, Jane Asher as Ruth, Joanna Lumley as Elvira and Marcia Warren as Madame Arcati.\"Blithe Spirit\", The Guardian, 1 February 1986, p. 12"]}, {"page": "Stephen Poliakoff", "response": ["Poliakoff's first feature film was Runners, directed by Charles Sturridge, starring James Fox, Jane Asher and Kate Hardie. It received a limited theatrical release in 1983 before being shown in Channel 4's Film on Four slot. His directorial debut was the much-lauded and now rare Hidden City (1988), premiered at the Venice Film Festival and starring Charles Dance, Richard E. Grant and Cassie Stuart. His television career continued with She's Been Away (1989) starring Peggy Ashcroft and also winning awards at Venice, before a return to film with Close My Eyes (1991), starring Clive Owen, Saskia Reeves and Alan Rickman in an elaborate reworking of the incest theme that had been central to Hitting Town (1976), followed by Century (1994), with Owen, Dance and Miranda Richardson. Less successful were Food of Love (1997) with Grant, Nathalie Baye and Joe McGann and The Tribe (1998) starring Joely Richardson and Jeremy Northam, the latter eventually screened on BBC Two in the absence of a cinema distribution deal where it achieved extremely high viewing figures and was immediately repeated."]}, {"page": "List of show business families", "response": ["* Musician Peter Asher and actress Jane Asher are siblings. Peter is the father of musician Victoria Asher. (This family has no relation to actor William Asher below)"]}, {"page": "A Dance to the Music of Time", "response": ["| Jean Templer || Claire Skinner || Emma Powell || Jane Asher"]}, {"page": "Edward Eliot, 3rd Earl of St Germans", "response": ["Lord St Germans died at St Germans on 7 October 1877, aged 79.GRO Register of Deaths:DEC 1877 5c 29 ST GERMANS Edward Granville Eliot, aged 79 He was the great-grandfather of Margaret Eliot (1914–2011), the mother of Peter and Jane Asher."]}, {"page": "I Want to Hold Your Hand", "response": ["McCartney had recently moved into 57 Wimpole Street, London, where he was lodging as a guest of Dr Richard and Margaret Asher, and whose daughter, actress Jane Asher, had become McCartney's girlfriend earlier in the year. This location briefly became Lennon and McCartney's new writing base, taking over from McCartney's Forthlin Road home in Liverpool. Margaret Asher taught the oboe in the \"small, rather stuffy music room\" in the basement where Lennon and McCartney sat at the piano and composed \"I Want to Hold Your Hand\". In September 1980, Lennon told Playboy magazine:"]}, {"page": "Frinton-on-Sea", "response": ["Frinton is home to the Frinton Summer Theatre Season at the McGrigor Hall every summer. Started in 1937, by the Cambridge Academic T. P. Hoar as an amusement whilst he studied corrosion, it quickly developed a life of its own, employing many later famous actors at the start of their career. Michael Denison, Vanessa Redgrave, Timothy West, Jane Asher, David Suchet, Gary Oldman, Owen Teale, Lynda Bellingham, Jack Klaff, Antony Sher and Neil Dudgeon all started their careers at Frinton. For many years it was run by the British actor Jack Watling, and his son Giles and son-in-law Seymour Matthews. His daughters Debbie and Dilys often appeared on stage, as did 'Allo 'Allo! cast member John D. Collins. It is now run by Clive Brill. Frinton Summer Theatre Production Team 31 July 2019"]}, {"page": "Crossroads (British TV series)", "response": ["The series went into a hiatus from August 2002 to January 2003, during which time further changes were made. The remodelled series, under producer Yvon Grace, appeared to be a self-consciously camp parody, with Jane Asher playing a new central character - the glamorous and bitchy Angel Samson. The series also featured appearances from Kate O'Mara, and people associated with light entertainment, such as Lionel Blair, Les Dennis and Tim Brooke-Taylor. The revived series also launched the careers of Freema Agyeman (Doctor Who, Law & Order: UK), Luke Roberts (Holby City and Mile High), Lucy Pargeter, Shauna Shim and Jessica Fox.", "The 2003 series was criticised by fans who felt the series had moved away from the 1964–88 series and the 2001–02 series, as well as being \"too gay\". Later, Jane Asher apologised to fans as a result of the way the 2003 series went."]}, {"page": "Radio Academy Awards", "response": ["|Jane Asher in Winter Journey"]}, {"page": "Joanna Trollope", "response": ["An adaptation of The Rector's Wife (1994), produced for Channel 4, starred Lindsay Duncan and Ronald Pickup. The Choir, adapted by Ian Curteis, was a five-episode BBC  television miniseries in 1995. It starred Jane Asher and James Fox. Of her other novels, A Village Affair and Other People's Children have also been adapted for television."]}]}}