{"wiki_id": "http://www.wikidata.org/entity/Q2058908", "itemLabel": "Paul Bew", "itemDescription": "Irish historian (born 1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Bew", "wikipedia_page": {"main": "Paul Anthony Elliott Bew, Baron Bew (born 22 January 1950), is a British historian from Northern Ireland and a life peer. He has worked at Queen's University Belfast since 1979, and is currently Professor of Irish Politics, a position he has held since 1991.", "link_mentions": [{"page": "January 22", "response": ["*1950 – Paul Bew, Northern Irish historian and academic"]}, {"page": "Northern Ireland", "response": ["* Paul Bew, Peter Gibbon and Henry Patterson  The State in Northern Ireland, 1921–72: Political Forces and Social Classes, Manchester (Manchester University Press, 1979)"]}, {"page": "Éamon de Valera", "response": ["As Paul Bew concludes, in the constitution of 1937 de Valera was \"trying to placate left-wing Republicans with national phrases and pious people with expressly Catholic bits [and] patriarchal Catholicism\"."]}, {"page": "1950 in literature", "response": ["*January 22 – Paul Bew, Irish historian and academic"]}, {"page": "Blueshirts", "response": ["Paul Bew has also argued against the term \"fascist\" being applied to the Blueshirts, instead labelling them as \"angry rural conservatives\" engaged in populism, with the views of the average member being closer to that of the Irish Parliamentary Party or the Irish Land League than Italian Fascism. On the same line, Alvin Jackson has stated that while some of the Cumann na nGaedheal leadership \"flirted with paramilitarism and the trappings of fascism\", in his view \"O’Duffy’s fondness for outrageous rhetoric and elaborate uniforms was more O'Connellite than Hitlerian\".  Historian John Joseph Lee has remarked that \"Fascism was far too intellectually demanding for the bulk of the Blueshirts\" Marxist historian John Newsinger disputes this line of thinking somewhat by agreeing that the rank and file of the Blueshirts were not ideologically fascists, but so long as the leadership was, the consequences of the Blueshirts coming to power would have been one-party state dictatorship."]}, {"page": "Campbell College", "response": ["*Paul Bew, scholar and life peer"]}, {"page": "Michael Davitt", "response": ["According to English historian Michael Kelly, Davitt's public renunciation of political violence made him \"the Irish Republican Brotherhood's greatest apostate\".  Davitt opposed the random use of force, such as by the Ribbon societies. On the other hand, he never fully renounced violence and, according to Irish historian Paul Bew, was involved in smuggling arms for the IRB between his first release from prison and his expulsion from the IRB council in 1880. Because he considered the landlord system inherently violent, Davitt believed it was moral to use force against it. However, for political reasons he presented the Land League as a peaceful movement and denied that his anti-landlord speeches and comments consisted of incitement to violence. Davitt denounced agrarian crime as \"a species of cowardly terrorism which would do irreparable injury to Ireland\" and the Maamtrasna murders as \"almost without a parallel for its atrocity in the annals of agrarian outrage\". However, the Land League leaders were not in control of their rank-and-file, who frequently used violence to intimidate others into withholding rent and to frighten landlords and their agents. Between 1879 and 1881, crimes related to the Land War rose from 25% to 58% of all crime in Ireland, without the leaders calling for an end to the agitation. Davitt's \"final break with the Fenians\" did not come until the 1882 Phoenix Park murders of the Chief Secretary and Permanent Undersecretary for Ireland."]}, {"page": "House of Lords Appointments Commission", "response": ["*Paul Bew"]}, {"page": "Bruce Anderson (columnist)", "response": ["Anderson was born in Orkney, and was educated at Campbell College, Belfast, and Emmanuel College, Cambridge, where he read History. He was a contemporary of the historian Paul Bew at both school and university."]}, {"page": "Democratic Socialist Party (Ireland)", "response": ["The Democratic Socialist Party (DSP) was a small left-wing political party in the Republic of Ireland. The party was formed by a merger of Jim Kemmy's Limerick Socialist Organisation and the Socialist Party of Ireland. Jim Kemmy was an Irish politician and member of Dáil Éireann. He left the Labour Party in 1972.The Dynamics of Irish Politics by Paul Bew, Ellen Hazelkorn, Henry Patterson, (1989). A number of members of the British and Irish Communist Organisation also joined the party."]}, {"page": "Irish Boundary Commission", "response": ["The press leak effectively ended the commission's work.Paul Bew \"Ireland: The Politics of Enmity, 1789–2006\" (Oxford University Press, 2007) p.447.  After McNeill's resignation Fisher and Feetham, the remaining commissioners, continued their work without MacNeill. As the publication of the commission's award would have an immediate legal effect, the Free State government quickly entered into talks with the British and Northern Ireland governments. In late November members of the Irish government visited London and Chequers; their view was that Article 12 was only intended to award areas within the six counties of Northern Ireland to the Free State, whereas the British insisted that the entire 1920 boundary was adjustable in either direction."]}, {"page": "Repartition of Ireland", "response": ["A de facto border was established by the Government of Ireland Act 1920, in which the British Government established (or attempted to establish) two devolved administrations within the United Kingdom, Northern Ireland and Southern Ireland. The former consisted of north-easterly six of the nine counties of Ulster; the latter of the remaining 26 (including three of Ulster). In 1925, the Irish Boundary Commission was established to consider whether a more appropriate border might be drawn. On 7 November 1925 an English Conservative newspaper, The Morning Post, published leaked notes of the negotiations, including a draft map. The overall effects of the Boundary Commission's recommendations would have been the transfer of 286 square miles to the Free State and 77 square miles to Northern Ireland.'The Irish Border: History, Politics, Culture' By Malcolm Anderson, Eberhard Bort, pg. 96 The leaked report included, accurately, the Boundary Commission recommendation that parts of east Donegal would be transferred to Northern Ireland, plus several other small tracts (see list here). Only 1 in every 25 Northern Irish Catholics would have been placed under Free State rule. The Boundary Commission's recommendations would have shortened the border by 51 miles (approx. 18%). The press leak effectively ended the Commission's work.Paul Bew \"Ireland: The Politics of Enmity, 1789–2006\" (Oxford University Press, 2007) p.447. "]}, {"page": "Land War", "response": ["The west of Ireland was hit by the 1879 famine, a combination of heavy rains, poor yields and low prices that brought widespread hunger and deprivation. Compounded by the reduction in opportunities for outside income, especially seasonal agricultural income in Great Britain, many smallholders were faced with hunger and unable to pay their rent. Some landlords offered rent abatement, while others refused on the grounds that their tenants were participating in anti-landlord agitation. Irish historian Paul Bew notes that five of the largest landlords in Connacht also refused to contribute any money to relief funds, despite collecting more than £80,000 annually in rent. According to historians such as William Vaughan and Phillip Bull, the serious agricultural recession combined with a unified nationalist leadership prepared to exploit the discontent of the masses to produce a powerful and lasting popular movement."]}, {"page": "Maurice Healy", "response": ["* Paul Bew, Healy, Timothy Michael (1855–1931) in: Oxford Dictionary of National Biography (Oxford University Press, 2004)"]}, {"page": "1950 in Northern Ireland", "response": ["*22 January – Paul Bew, professor of Irish politics at Queen's University of Belfast."]}, {"page": "Lord Bew", "response": ["#REDIRECT Paul Bew"]}, {"page": "Baron Bew", "response": ["#REDIRECT Paul Bew"]}, {"page": "John Patrick Hayden", "response": ["* Paul Bew, Conflict and Conciliation in Ireland 1890–1910:  Parnellites and Radical Agrarians, Oxford, Clarendon Press, 1987"]}, {"page": "Irish neutrality during World War II", "response": ["De Valera denounced reports of Bergen-Belsen concentration camp as \"anti-national propaganda\"; according to Paul Bew, this was not out of disbelief but rather because the Holocaust undermined the assumptions underlying Irish neutrality: moral equivalence between the Allies and the Axis, and the idea that the Irish were the most persecuted people in Europe."]}, {"page": "John Henry Whyte", "response": ["Following his death Whyte's family, friends, and colleagues set up the John Whyte Trust Fund to continue Whyte's work, honour his memory and encourage \"informed dialogue and interaction at graduate level among people who are likely to be leaders and opinion-shapers\". To date the fund has awarded one fully paid scholarship and a number of part-paid scholarships as well as essay prizes annually. The fund also hosts an annual John Whyte Memorial Lecture. Speakers have included Paul Bew and Brendan O'Leary."]}, {"page": "Aubane Historical Society", "response": ["The Aubane Historical Society (AHS) is a historical society of amateur historians based in Millstreet, County Cork in Ireland, focusing on local history and the Irish revolutionary period. Brendan Clifford and Jack Lane, members of both the AHS and British and Irish Communist Organisation (BICO), grew up in the Aubane area of north Cork. The AHS has published numerous pamphlets on local history matters, often in relation to the Home Rule politician William O'Brien, the novelist Canon Patrick Sheehan, and the local poet Ned Buckley. According to Jack Lane, the AHS was originally intended to be a local history organisation, but later expanded into the role of opposing the \"revisionist\" movement in Irish history.\"BICO Is Dead—Long Live BICO!\" by Jack Lane, A Review of What? Irish Political Review, Jan. 2009, pp. 36–37 . The Society has been highly critical of Peter Hart, whom it accuses of falsifying interview material,An Phoblacht \"Hart Trouble Diagnosed\"  Review of the AHS' book Troubled History,which is critical of Hart with denunciations of Roy Foster, Brian Hanley, Paul Bew, and Henry Patterson. The AHS regularly attacks Hubert Butler (whom it accuses of being a quasi-racist defender of Protestant Ascendancy) and Elizabeth Bowen, whom it claims acted as a British spy in Ireland during the Second World War and hence lacking any Irish identity.For the AHS' criticism of Bowen, see \"The Dubliner:The Life Times & Works of  James Clarence Mangan\", Clifford 1988, \"A North Cork Anthology\" by Jack Lane, 1993, and \"Notes on Eire\" by Clifford & Lane 2008.  AHS has worked with some writers who might be seen as representing a more traditional republican perspective, including Desmond Fennell, Brian P. Murphy osb, Eoin Neeson and Meda Ryan.See, for instance, Myths From Easter 1916 by Eoin Neeson (AHS, 2007), and About Behaving Normally in Abnormal Circumstances by Desmond Fennell (Athol Books, 2007)."]}, {"page": "The Irish Association for Cultural, Economic and Social Relations", "response": ["A good account of the Association's origins is provided by (Lord) Paul Bew in his 1993 book published by the Institute of Irish Studies at QUB.", "1991-1993: Paul Bew"]}, {"page": "Paul Bew, Baron Bew", "response": ["#REDIRECT Paul Bew"]}, {"page": "John Bew (historian)", "response": ["Bew is the son of Paul Bew, Professor of Irish Politics at Queen's University Belfast and his wife Greta Jones, a history professor at the University of Ulster. "]}]}}