{"wiki_id": "http://www.wikidata.org/entity/Q2057920", "itemLabel": "James Watkins", "itemDescription": "British writer and film director", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Watkins_(director)", "wikipedia_page": {"main": "James Thomas Watkins (born 20 May 1973 in Nottingham, England) is an English film director and screenwriter, best known for directing  The Woman in Black starring Daniel Radcliffe.He wrote and directed the critically acclaimed thriller Eden Lake, starring Michael Fassbender and Kelly Reilly.  It won Best Horror Film at the 2009 Empire Awards, the Jury Prize at Sitges Fantasy Festival and Best Director at Fantasporto. He was nominated for the Douglas Hickox Award at the 2008 British Independent Film Awards.\nWatkins has written scripts for Warner Bros., Working Title, Film4 and BBC Films.", "link_mentions": [{"page": "Hammer Film Productions", "response": ["In June 2010, it was announced that Hammer acquired Wake, a script by Chris Borrelli for an action feature to be directed by Danish filmmaker Kasper Barfoed. In February 2012, the Hammer and Alliance Films adaptation of The Woman in Black was released. Daniel Radcliffe stars as lawyer Arthur Kipps. Jane Goldman wrote the film's screenplay, with James Watkins in the director's chair. In April 2012, the company announced it was to make a sequel to The Woman in Black titled The Woman in Black: Angel of Death. Also in 2012, Hammer and Alliance Films announced two more films going into production during 2012, entitled The Quiet Ones and Gaslight. The Quiet Ones tells the story of an unorthodox professor (Jared Harris) who uses controversial methods and leads his best students off the grid to take part in a dangerous experiment: to create a poltergeist. It was released on 10 April 2014 in the UK and 25 April in the US."]}, {"page": "Eden Lake", "response": ["Eden Lake is a 2008 British slasher film written and directed by James Watkins and starring Kelly Reilly, Michael Fassbender and Jack O'Connell."]}, {"page": "Jane Goldman", "response": ["She continued to work in adaptations, and was also a co-writer with Vaughn and Peter Straughan for the 2011 drama-thriller The Debt, which was based on the 2007 Israeli film HaHov and directed by John Madden. Goldman also adapted for Hammer The Woman in Black, based on Susan Hill's horror novel. This film was directed by James Watkins and it is the first solo screenplay by Goldman. It was released in 2012 and met positive reviews. In March 2013, The Woman in Black won the Empire Award for Best Horror."]}, {"page": "The Woman in Black", "response": ["*In February 2012, a film adaptation was released, starring Daniel Radcliffe (of Harry Potter fame) in the role of Arthur Kipps, and directed by James Watkins of Eden Lake fame. It is a separate adaptation of the novel, not a remake of the 1989 film, and develops a storyline quite different from that of the source material."]}, {"page": "David Julyan", "response": ["| James Watkins"]}, {"page": "Marco Beltrami", "response": ["|James Watkins"]}, {"page": "The Descent Part 2", "response": ["The Descent Part 2 is a 2009 British adventure horror film and sequel to the 2005 horror film The Descent. It was directed by Jon Harris from a screenplay by James McCarthy, J Blakeson, and James Watkins. The film was produced by Christian Colson and Ivana MacKinnon; Neil Marshall, the writer and director of the original, was an executive producer. Shot in London and Surrey, it was released in cinemas in the UK on 2 December 2009 and was given a straight-to-DVD release on 27 April 2010 in the US."]}, {"page": "BAFTA Award for Outstanding Debut by a British Writer, Director or Producer", "response": ["Jury members in recent years have included (former winner) Asif Kapadia, Peter Bradshaw, Jane Goldman, Peter Straughan, James Watkins, Joe Cornish, and Moira Buffini."]}, {"page": "Alex Heffes", "response": ["|James Watkins"]}, {"page": "List of British films of 2008", "response": ["|Eden Lake||James Watkins ||Kelly Reilly, Michael Fassbender, Jack O'Connell ||Horror ||"]}, {"page": "List of directorial debuts", "response": ["* James Watkins – Eden Lake"]}, {"page": "London FrightFest Film Festival", "response": ["Thursday: Eden Lake with Dir James Watkins and Actors Michael Fassbender and Jack O'Connell, I Know How Many Runs You Scored Last Summer with directors Stacey Edmonds and Doug Turner, Scar-3D which screened at the Shaftesbury Avenue Cineworld."]}, {"page": "Hossein Amini", "response": ["|Co-created with James Watkins"]}, {"page": "British Independent Film Awards 2008", "response": ["* James Watkins for Eden Lake"]}, {"page": "Eriq Ebouaney", "response": ["| James Watkins"]}, {"page": "Finn Atkins", "response": ["*Eden Lake (2008) — Paige; Celador Films (director: James Watkins)"]}, {"page": "List of horror films of 2008", "response": ["| James Watkins || Kelly Reilly, Michael Fassbender, Jack O'Connell || United Kingdom || "]}, {"page": "List of action films of the 2010s", "response": ["|James Watkins"]}, {"page": "London Film Critics Circle Awards 2008", "response": ["*James Watkins – Eden Lake"]}, {"page": "José Garcia (actor)", "response": ["| James Watkins & Jill Gagé"]}, {"page": "The Woman in Black (2012 film)", "response": ["The Woman in Black is a 2012 gothic supernatural horror film directed by James Watkins and written by Jane Goldman. It is the second adaptation of Susan Hill's 1983 novel of the same name, which was previously filmed in 1989. The film stars Daniel Radcliffe, Ciarán Hinds, Janet McTeer, Sophie Stuckey, and Liz White. The plot, set in early 20th-century England, follows a young recently widowed lawyer who travels to a remote village where he discovers that the vengeful ghost of a scorned woman is terrorising the locals.", "The film was announced in 2009, with Jane Goldman as screenwriter and later James Watkins as director. Daniel Radcliffe was announced as the actor playing the part of Arthur Kipps on 19 July 2010. Two months later, it was announced that Harry Potter and the Deathly Hallows – Part 2 co-star Ciarán Hinds would join Radcliffe along with Janet McTeer as Mr and Mrs Daily respectively. Before filming, Radcliffe saw a psychologist so he could better understand his character. The part of Joseph Kipps was played by Misha Handley, who is Radcliffe's real life godson.", "At the Kapow! Comic Con in London during April 2011, director James Watkins confirmed filming had been completed in December 2010 and post-production would go on until June 2011.  For its British release, several changes were made in order to qualify for a 12A certificate: Momentum Pictures, the distributor, arranged to have six seconds cut and for changes to other shots, with some scenes darkened and the sound level reduced on some others."]}, {"page": "Richard Holmes (producer)", "response": ["In 2008 he produced, alongside Christian Colson, the critically acclaimed feature film Eden Lake (2008), written and directed by James Watkins."]}, {"page": "List of British films of 2012", "response": ["|| Director: James Watkins   Cast: Daniel Radcliffe, Ciarán Hinds, Janet McTeer"]}, {"page": "List of films broadcast by Horror Channel", "response": ["| James Watkins"]}, {"page": "Merab Ninidze", "response": ["For the last 20 years he has been actively portraying characters in English, Russian and German language films and TV series. He has appeared in numerous German films by various directors. Nowhere in Africa (dir. Caroline Link), with Merab as lead, was awarded an Academy Award for Best Foreign Language Film in 2002. Ninidze has received several European and Russian film prizes, and films in which he has participated are shown regularly at major film festivals. Throughout his career, he has also been active in Russian cinema and TV, landing major roles in Aleksei German’s Paper Soldier and Under Electric Clouds, Bakhtyar Khudojnazarov’s Luna Papa, and others. His recent credits in TV series include Berlin Station in 2015, BBC’s McMafia in 2018 (dir. by James Watkins), and Homeland (2018). In 2017 he attended the Berlinale Film Festival with two of his most recent Georgian films – Hostages (dir. Rezo Gigineishvili) and My Happy Family (dir. Nana Ekvtimishvili and Simon Gross), which also won prizes in various film festivals around the world. In May 2017, theatre and film director Kornel Mundruczo’s film Jupiter’s Moon was shown in main competition at Cannes Film Festival. In September 2017, Merab Ninidze won Best Actor for his role in Jupiter’s Moon at Batumi International Film Festival."]}, {"page": "List of American films of 2012", "response": ["| The Woman in Black || CBS Films / Cross Creek Pictures || James Watkins (director); Jane Goldman (screenplay); Daniel Radcliffe, Ciarán Hinds, Janet McTeer, Liz White, Alisa Khazanova, Tim McMullan, Roger Allam, Daniel Cerqueira, Shaun Dooley, Mary Stockley, Cathy Sara, David Burke, Victor McGuire, Lucy May Barker ||"]}, {"page": "James Watkins", "response": ["* James Watkins (abolitionist) (born c. 1823), American abolitionist and autobiographer", "* James Watkins (director) (born 1973), English film director and screenwriter", "* James Watkins (researcher) (fl. 1970s–2010s), biomechanics and sports science researcher"]}, {"page": "List of horror films of 2012", "response": ["| data-sort-value=\"Watkins, James\" | James Watkins || Daniel Radcliffe, Ciarán Hinds, Janet McTeer || CanadaUnited Kingdom || "]}, {"page": "25th Tokyo International Film Festival", "response": ["|||  || James Watkins || "]}, {"page": "Cross Creek Pictures", "response": ["| rowspan=\"3\"| 2012 || The Woman in Black || James Watkins || CBS Films"]}, {"page": "Bastille Day (2016 film)", "response": ["Bastille Day (released as The Take in North America and on international home release) is a 2016 action thriller film co-written and directed by James Watkins. It is a Luxembourgian, French and American venture produced by Anonymous Content, Vendôme Pictures, TF1 Films Production and StudioCanal. The film stars Idris Elba, Richard Madden, Charlotte Le Bon, Eriq Ebouaney and José Garcia. The film was released in the United Kingdom on 22 April 2016 and 13 July 2016 in France, and on 18 November 2016 in the United States."]}, {"page": "Night Visions (film festival)", "response": ["| 2008 || Eden Lake || James Watkins"]}, {"page": "Nicolas Marié", "response": ["| James Watkins"]}, {"page": "Vertigo Entertainment", "response": ["|James Watkins"]}, {"page": "Rajshri Deshpande", "response": ["She made her digital debut with BBC One's McMafia, directed by James Watkins, in January 2018. Deshpande was also seen in the Netflix show Sacred Games, directed by Anurag Kashyap. In it, she played the character of Subhadra and was praised for her role as the wife of Nawazuddin Siddiqui's character. A scandal arose when she was accused of being a porn star by some viewers, as the show included a nude sex scene. The actress replied that she hadn't done anything wrong. She later portrayed Ismat Chughtai in Nandita Das's Manto."]}, {"page": "Shut Up and Dance (Black Mirror)", "response": ["The episode was filmed over a three-week period; it was the second in the series to be filmed, after \"San Junipero\". Director James Watkins had previously directed horror films Eden Lake (2008) and The Woman in Black (2012), which Lawther says made Watkins \"really [learn] the craft of sustaining incredible suspense over long periods of time.\" It was Watkins' first experience directing television. Having seen art department preparations for series three episodes \"Nosedive\" and \"San Junipero\", Watkins aimed to deviate from their tones to \"embrace being the ugly cousin\". Alex Lawther plays the main character Kenny; having been a fan of the programme prior to auditioning, Lawther particularly liked series two episode \"White Bear\". When first auditioning, Lawther had only seen the script for a couple of scenes and was unaware of the twist ending.", "Director James Watkins was praised by Mullane and Collin for creating tension, with Collin writing that Watkins \"keeps his camera on its feet and hungry\" during moments of tension and Kenny's chase sequences. However, the episode was criticised as too long by Framke and Chitwood, with Framke attributing this to the programme's move to Netflix."]}, {"page": "Thierry Godard", "response": ["| James Watkins"]}, {"page": "McMafia", "response": ["McMafia is a British crime drama television series created by Hossein Amini and James Watkins, and directed by Watkins. It is inspired by the book McMafia: A Journey Through the Global Criminal Underworld by journalist Misha Glenny (2008). The series stars James Norton as Alex Godman, the British-raised son of a Russian mafia boss living in London whose father is trying to escape from the world of organised crime. It is co-produced by BBC, AMC Networks, and Cuba Pictures. It premiered in the United Kingdom on BBC One on 1 January 2018, and in the United States on AMC on 26 February 2018.", "McMafia was inspired by journalist Misha Glenny's non-fiction book McMafia: A Journey Through the Global Criminal Underworld, published in 2008. The series took a few stories from Glenny's book, which documents various mafia organisations thriving around the world today. The series was created by Hossein Amini and James Watkins, and is a co-production of the BBC, AMC, and Cuba Pictures, in association with Twickenham Studios."]}, {"page": "The Ipcress File (TV series)", "response": ["ITV commissioned the series in December 2020, with James Watkins directing and John Hodge writing. Joe Cole, Lucy Boynton and Tom Hollander were cast to star.ITV Turns ‘The Ipcress File’ Into TV Series Penned By ‘Trainspotting's John Hodge; Joe Cole, Lucy Boynton, Tom Hollander Star"]}, {"page": "British Independent Film Award – The Douglas Hickox Award", "response": ["| James Watkins"]}]}}