{"wiki_id": "http://www.wikidata.org/entity/Q2062642", "itemLabel": "Barney Bubbles", "itemDescription": "English graphic artist whose work encompassed graphic design and music video direction (1942-1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Barney_Bubbles", "wikipedia_page": {"main": "Barney Bubbles (born Colin Fulcher; 30 July 1942 – 14 November 1983) was an English graphic artist whose work encompassed graphic design and music video direction. Bubbles, who also sketched and painted privately, is best known for his distinctive contribution to the design practices associated with the British independent music scene of the 1970s and 1980s. His record sleeves, laden with symbols and riddles, were his most recognisable output.", "link_mentions": [{"page": "Colin Fulcher", "response": ["#REDIRECT Barney Bubbles"]}, {"page": "Hawkwind", "response": ["Their follow-up album, 1971's In Search of Space, brought greater commercial success, reaching number 18 on the UK album charts. This album offered a refinement of the band's image and philosophy courtesy of graphic artist Barney Bubbles and underground press writer Robert Calvert, as depicted in the accompanying Hawklog booklet, which would be further developed into the Space Ritual stage show. Science fiction author Michael Moorcock and dancer Stacia also started contributing to the band. Dik Mik had left the band, replaced by sound engineer Del Dettmar, but chose to return for this album giving the band two electronics players. Bass player Dave Anderson, who had been in the German band Amon Düül II, had also joined and played on the album but departed before its release because of personal tensions with some other members of the band. Anderson and Lloyd-Langton then formed the short-lived band Amon Din. Meanwhile, Ollis quit, unhappy with the commercial direction the band were heading in.Carol Clerk, The Saga of Hawkwind, p. 95."]}, {"page": "Jonathan Smeeton", "response": ["* Barney Bubbles"]}, {"page": "1983", "response": ["** Barney Bubbles, English graphic artist (b. 1942)"]}, {"page": "Ian Dury", "response": ["The band's second album Do It Yourself was released in June 1979 in a Barney Bubbles-designed sleeve of which there were over a dozen variations, all based on samples from the Crown wallpaper catalogue. Bubbles also designed the Blockhead logo."]}, {"page": "Stiff Records", "response": ["Barney Bubbles was responsible for much of the graphic art associated with the early Stiff releases."]}, {"page": "Space Ritual", "response": ["The Space Ritual show attempted to create a full audio-visual experience, representing themes developed by Barney Bubbles and Robert Calvert entwining the fantasy of starfarers in suspended animation traveling through time and space with the concept of the music of the spheres.Melody Maker, 28 October 1972  - Watch This Space The performance featured dancers Stacia, Miss Renee and Tony Carrera, stage set by Bubbles,Music Scene, 1 December 1972  - Hawkwind Musicnauts lightshow by Liquid Len and poetry recitations by Calvert. On entering the venue, audience members were given a programmeTour Programme  – An extract from the Saga of Doremi Fasol Latido (reproduced on the 1996 remaster CD) featuring a short sci-fi story by Bubbles setting the band in a Starfarers scenario returning to Earth.", "The sleeveCollectable Records – Original foldout cover and inner sleeves was designed by Barney Bubbles and came in 3x2 panel foldout, the outer 6 panels being colour, the inner 6 panels being monochrome, the discs in psychedelic patterned orange & yellow inner sleeves were folded into this. It made Q Magazine's 100 greatest album covers list."]}, {"page": "NME", "response": ["In 1978, Logan moved on, and his deputy Neil Spencer was made editor. One of his earliest tasks was to oversee a redesign of the paper by Barney Bubbles, which included the logo still used on the paper's masthead today (albeit in a modified form) – this made its first appearance towards the end of 1978. Spencer's time as editor also coincided with the emergence of post-punk acts such as Joy Division and Gang of Four. This development was reflected in the writing of Ian Penman and Paul Morley. Danny Baker, who began as an NME writer around this time, had a more straightforward and populist style."]}, {"page": "Damned Damned Damned", "response": ["The album design was credited to Big Jobs Inc, a pseudonym of Barney Bubbles."]}, {"page": "Almost Blue", "response": ["Album cover was designed by Barney Bubbles. The design is an homage to the 1963 Blue Note album Midnight Blue by Kenny Burrell. Many versions of the artwork were made, with slightly different base colours.", "*Barney Bubbles - sleeve design"]}, {"page": "This Year's Model", "response": ["Early issues of the album have an apparently misprinted sleeve, which cuts off the left side of the front cover (including the letters 'E' from 'Elvis' and 'T' from 'This') and shows a printers' colour bar along the right side (see cover right). This was a deliberate mistake (a favourite technique of cover designer Barney Bubbles), as was pressing \"Special pressing No. 003. Ring 434 32 32. Ask for Moira for your prize\" between the holding spirals on Side 1. Indeed, people calling the aforementioned number (\"Moira\" being a press agent at Radar Records) would be rewarded with a badge."]}, {"page": "My Aim Is True", "response": ["The album cover was designed by Barney Bubbles, who was uncredited on the sleeve. The cover art features rows of tiny black and white checks (surrounding the photo of Costello) on which the phrase \"Elvis Is King\" is written. Costello's pose on the cover would become an iconic look for him, with the Buddy Holly glasses and the knees bent inwards together. He struck a similar pose in the photo on the back of the original sleeve.", "Initially, the LP cover had a black & white photo on the front, and a yellow back. The first 1000 UK copies also came with a form asking the buyer to send in the address of a friend, who would then receive a free copy. The form was titled: HELP US HYPE ELVIS. The free copies that were sent out in response to returned forms were customised with a large special sticker. The form and the sticker were also designed by Barney Bubbles. First pressings came with writings on the dead wax with on the A-side \"Elvis is King\" and \"Porky Prime Cut\" and on the B-side \"on this side too\" and \"porky prime cut too\". Early issues were also printed with many different coloured backs. Later issues then had a green tint on the front picture and a green back. The Demon re-issue originally had a yellow tint on the photo and a yellow back, and the reissue has a green tint photo."]}, {"page": "Strongbow (cider)", "response": ["The original Norman archer logo was designed by artist Barney Bubbles. The \"thudding arrows\" have been a signature of the brand's television advertising since the 1960s. Towards the end of the advertisement, two arrows thud into a bar counter near a glass of Strongbow, or its bar pump."]}, {"page": "Bubble", "response": ["* Barney Bubbles (Colin Fulcher, 1942–1983), English graphic artist"]}, {"page": "Imperial Bedroom", "response": ["The name of the album appears on the sleeve as IbMePdErRoIoAmL. The cover painting, titled \"Snakecharmer & Reclining Octopus\" by Barney Bubbles (but credited to \"Sal Forlenza\") is a pastiche of \"Three Musicians\" by Pablo Picasso, and letters on the zipper-like creatures in the upper right spell \"PABLO SI\"."]}, {"page": "List of people with bipolar disorder", "response": ["* Barney Bubbles, English graphic artist whose work encompassed graphic design and music video direction. Bubbles committed suicide when he was 41."]}, {"page": "Armed Forces (album)", "response": ["While the album's artwork was largely designed by Barney Bubbles and Bazooka, the original UK LP cover, featuring a herd of stampeding elephants, was designed by Tom Pogson. Initial pressings of the LP featured a die-cut fold-out sleeve, which also included four postcards of the band. The American version opted for a standard LP jacket and featured a piece of paint-splattered artwork by Bubbles and Bazooka for the cover, which had also been featured inside the fold-out UK version.", "*Barney Bubbles - artwork (all other artwork)"]}]}}