{"wiki_id": "http://www.wikidata.org/entity/Q20651466", "itemLabel": "Graham Collier", "itemDescription": "English association football player (born 1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Graham_Collier_(footballer)", "wikipedia_page": {"main": "Graham Ronald Collier (born 12 September 1951) is an English former professional footballer who played as a midfielder in the Football League for Nottingham Forest, Scunthorpe United, Barnsley and York City, and in non-League football for Buxton. He took over as assistant manager of Ilkeston Town in June 1994.", "link_mentions": [{"page": "Graham Collier", "response": ["James Graham Collier  (21 February 1937 – 9 September 2011) was an English jazz bassist, bandleader and composer.", "Born in Tynemouth, Northumberland, England, on leaving school Collier joined the British Army as a musician, spending three years in Hong Kong. He subsequently won a Down Beat magazine scholarship to the Berklee School of Music, Boston, studying with Herb Pomeroy and was its first British graduate in 1963. On his return to Britain he founded the first version of an ensemble devoted to his own compositions, Graham Collier Music, which included Kenny Wheeler, Harry Beckett and John Surman, and in later line-ups Karl Jenkins, Mike Gibbs, Art Themen and many other notable musicians. Collier was the first recipient of an Arts Council bursary for jazz and was commissioned by festivals, groups and broadcasters across Europe, North America, Australia and the Far East. He produced 19 albums and CDs of his music and also worked in a wide range of other media: on stage plays and musicals, on documentary and fiction film, and on a variety of radio drama productions.", "Collier was also an author and educator, having written seven books on jazz, and given lectures and workshops around the world. As Simon Purcell noted, \"Jazz education in the UK owes an enormous amount to Graham Collier (alongside Eddie Harvey and Lionel Grigson) without whom our current positions and extent of provision would have been considerably harder to achieve.\" In 1987, Collier launched the jazz degree course at London's Royal Academy of Music and was its artistic director until he resigned in 1999 to concentrate on his own music. In 1989, he was among the group of jazz educators who formed the International Association of Schools of Jazz, whose magazine, Jazz Changes, he co-edited for seven years. He was awarded an Order of the British Empire (OBE) by Queen Elizabeth II in 1987 for his services to jazz.", "Latterly, Collier lived on a small island in Greece, where he composed, wrote and administered his back catalogue, travelling to present concerts and workshops around the world. His book, The Jazz Composer: Moving Music off the Paper, a philosophical look at jazz and jazz composing, was published by Northway Books in 2005, and his nineteenth CD, Directing 14 Jackson Pollocks, mainly recorded in 2004, was released by the Jazzcontinuum label.  He died from heart failure in September 2011.Graham Collier Biography AllMusic", "*\"Relook\": Graham Collier 1937-2011: A Memorial 75th Birthday Celebration (Jazzcontinuum, 2012) - posthumous compilation"]}, {"page": "Graham Ronald Collier", "response": ["#REDIRECT Graham Collier (footballer)"]}]}}