{"wiki_id": "http://www.wikidata.org/entity/Q20648564", "itemLabel": "Mary Robinson", "itemDescription": "British politician (born 1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Robinson_(British_politician)", "wikipedia_page": {"main": "Mary Josephine Robinson (born 23 August 1955) is a British Conservative Party politician. She was elected as the Member of Parliament (MP) for Cheadle at the 2015 general election.", "link_mentions": [{"page": "Stockport", "response": ["There are four parliamentary constituencies in the Stockport Metropolitan Borough: Stockport, Cheadle, Hazel Grove, and Denton and Reddish. Stockport has been represented by the Labour MP Nav Mishra since 2019. Mary Robinson has been the Conservative MP for Cheadle since 2015; and William Wragg has been the Conservative MP for Hazel Grove since 2015. The constituency of Denton and Reddish bridges Stockport and Tameside; the current member is Andrew Gwynne for the Labour Party."]}, {"page": "Bramhall", "response": ["Bramhall is part of the parliamentary constituency of Cheadle, represented by Conservative Mary Robinson since 2015."]}, {"page": "Cheadle (UK Parliament constituency)", "response": ["The current MP is the Conservative Mary Robinson, who defeated Mark Hunter in the 2015 general election.", "| 2015 || Mary Robinson"]}, {"page": "Cheadle, Greater Manchester", "response": ["Since 1950, Cheadle has been part of the Cheadle parliamentary constituency.Craig, p.53 As of 2015, it is represented by Conservative MP Mary Robinson. The area (listed as Cheadle and Gatley) has three councillors who serve on the borough council, who are all Liberal Democrats."]}, {"page": "Mark Hunter (politician)", "response": ["Mark James Hunter (born 25 July 1957) is a British Liberal Democrat politician who became Member of Parliament (MP) for Cheadle at a 2005 by-election. At the 2015 general election, Hunter lost his seat to Mary Robinson of the Conservative Party.", "Mary Robinson defeated Mark Hunter with a majority of 6,453 on a 16.1% swing from the Liberal Democrats to the Conservatives. Hunter said that \"sometimes you have to accept that you can't swim against the national tide.\""]}, {"page": "Metropolitan Borough of Stockport", "response": ["There are four parliamentary constituencies in the Stockport Metropolitan Borough: Stockport, Cheadle, Hazel Grove, and Denton and Reddish.  Stockport has been represented by  Navendu Mishra (Labour) since 2019.  Mary Robinson (Conservative) has been MP for Cheadle since 2015. William Wragg (Conservative) has been MP for Hazel Grove since 2015.  The constituency of Denton and Reddish bridges Stockport and Tameside; the current member is Andrew Gwynne (Labour)."]}, {"page": "Housing, Communities and Local Government Committee", "response": ["|Mary Robinson MP"]}, {"page": "Mary Robinson (disambiguation)", "response": ["Mary Robinson (born 1944) was President of Ireland from 1990 to 1997 and United Nations High Commissioner for Human Rights from 1997 to 2002.", "Mary Robinson may also refer to:", "*Mary Robinson (poet) (1757–1800), English actress, poet and novelist, and mistress of the future George IV", "*Mary Robinson (British politician) (born 1955), British Conservative Party politician, MP for Cheadle since May 2015", "*Mary Robinson (Maid of Buttermere) (1778–1837), \"The Maid of Buttermere\", subject of Melvyn Bragg's novel of that name", "*Mary Robinson (clipper), 1854 clipper ship in the San Francisco and guano trades"]}, {"page": "Heald Green (Stockport electoral ward)", "response": ["Heald Green electoral ward is represented in Westminster by Mary Robinson MP for Cheadle."]}, {"page": "Cheadle Hulme North (Stockport electoral ward)", "response": ["The ward is represented in Westminster by Mary Robinson MP for Cheadle."]}, {"page": "Cheadle Hulme South (Stockport electoral ward)", "response": ["Cheadle Hulme South electoral ward is represented in Westminster by Mary Robinson MP for Cheadle."]}, {"page": "Bramhall South and Woodford (Stockport electoral ward)", "response": ["Bramhall South electoral ward is represented in Westminster by Mary Robinson MP for Cheadle."]}, {"page": "Bramhall North (Stockport electoral ward)", "response": ["Bramhall North electoral ward is represented in Westminster by Mary Robinson MP for Cheadle."]}, {"page": "Cheadle and Gatley (Stockport electoral ward)", "response": ["Cheadle and Gatley electoral ward is represented in Westminster by Mary Robinson MP for Cheadle."]}, {"page": "Stepping Hill (Stockport electoral ward)", "response": ["Stepping Hill electoral ward is represented in Westminster by Mary Robinson MP for Cheadle."]}, {"page": "List of MPs who lost their seat in the 2015 United Kingdom general election", "response": ["|data-sort-value=\"Robinson, Mary\"|Mary Robinson"]}, {"page": "List of United Kingdom MPs by seniority (2015–2017)", "response": ["|622||Mary Robinson||style=\"background-color: \"|C||Cheadle||23/08/1955"]}, {"page": "List of MPs elected in the 2017 United Kingdom general election", "response": ["| data-sort-value=\"Robinson Mary\" | frameless|100pxMary Robinson"]}]}}