{"wiki_id": "http://www.wikidata.org/entity/Q2067092", "itemLabel": "Rob Edwards", "itemDescription": "Welsh footballer and manager (born 1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Rob_Edwards_(footballer,_born_1982)", "wikipedia_page": {"main": "Robert Owen Edwards (born 25 December 1982) is a professional football manager and former player. Edwards played as a centre back. He is the current head coach of EFL League Two club Forest Green Rovers.\nEdwards began his career with Aston Villa, making his senior debut in the Premier League. He then moved to Midlands neighbours Wolverhampton Wanderers in 2004, where he spent four seasons at Championship level. He helped both Blackpool and Norwich to promotions to the Premier League and featured regularly for Barnsley in the Championship before retiring due to injury in 2013.", "link_mentions": [{"page": "December 25", "response": ["*  1982   – Rob Edwards, Welsh footballer"]}, {"page": "Forest Green Rovers F.C.", "response": ["|2021–|| Rob Edwards"]}, {"page": "Sylvan Ebanks-Blake", "response": ["Ebanks-Blake left Telford on 6 February 2018, as manager Rob Edwards wanted to balance the budget.Former Wolves striker Sylvan Ebanks-Blake leaves AFC Telford United‚ thenonleaguefootballpaper.com, 6 February 2018"]}, {"page": "AFC Telford United", "response": ["|Rob Edwards"]}, {"page": "Robert Edwards", "response": ["* Rob Edwards (footballer, born 1970), English footballer formerly of Huddersfield Town", "* Rob Edwards (footballer, born 1973), Welsh international footballer who played for Carlisle, Bristol City, Preston, Blackpool and Exeter", "* Rob Edwards (footballer, born 1982), Welsh international footballer who played for Aston Villa, Wolves, Blackpool and Barnsley", "* Rob Edwards (basketball) (born 1997), American basketball player", "* Rob Edwards (actor) (born 1949), British actor", "* Rob Edwards (screenwriter) (born 1963), American screenwriter", "=== Rob Edwards ===", "* Rob Edwards (actor) (born 1949), British actor", "* Rob Edwards (basketball) (born 1997), American basketball player", "* Rob Edwards (footballer, born 1970), English footballer formerly of Huddersfield Town", "* Rob Edwards (footballer, born 1973), Welsh international footballer who played for Carlisle, Bristol City, Preston, Blackpool and Exeter", "* Rob Edwards (footballer, born 1982), Welsh international footballer who played for Aston Villa, Wolves, Blackpool and Barnsley", "* Rob Edwards (screenwriter) (born 1963), American screenwriter"]}, {"page": "Rhys Weston", "response": ["His last game for Wales was also John Toshack's first game as manager. Toshack brought Weston on for Rob Edwards after 49 minutes in a 2–0 win over Hungary on 9 February 2005. Toshack also called him into the squad for a November 2005 friendly with Cyprus, though Weston did not make it onto the pitch. His final international call–up was on 1 March 2006 in a goalless draw with Paraguay, in which Weston remained on the bench."]}, {"page": "Scott Sellars", "response": ["Since retirement he has previously been assistant manager at Chesterfield and academy coach at Manchester City. He has also worked as the head coach of Wolverhampton Wanderers U23's, as well as assistant head coach under caretaker manager Rob Edwards for Wolves' first team. He is currently Technical Director and Head of Academy at Wolverhampton Wanderers."]}, {"page": "Daniel Jones (footballer)", "response": ["Born in Rowley Regis, West Midlands, Jones joined the Wolverhampton Wanderers academy at the age of ten, and moved up through the ranks to sign his first professional contract at Molineux under Glenn Hoddle in January 2005. He made his first team debut on 1 April 2006, in a 2–0 defeat to Plymouth Argyle at Home Park; he was replaced by Rob Edwards on 62 minutes. He played eight Championship games in the 2006–07 season, though only played one of these games from December onwards."]}, {"page": "2005–06 Blackpool F.C. season", "response": ["| 18 || DF || align=\"left\"|  Rob Edwards ||4||1||1||0||0||0||0||0||5||1||8"]}]}}