{"wiki_id": "http://www.wikidata.org/entity/Q2061535", "itemLabel": "Paul Norell", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Norell", "wikipedia_page": {"main": "Paul Norell (born 11 February 1952) is an English actor residing in Auckland, New Zealand. He is known for his portrayal as the King of the Dead in Peter Jackson's The Lord of the Rings: The Return of the King. Some of his other credits include Hercules: The Legendary Journeys playing the traveling food merchant Falafel and Power Rangers: SPD. He attended the RingCon 2004. Paul has two brothers in the UK: David who is a former actor/director and now manages Oakham School's Queen Elizabeth Theatre and teaches Acting; and Michael, who is a Consultant Cardiologist in Wolverhampton.", "link_mentions": [{"page": "Hercules: The Legendary Journeys", "response": ["* Falafel (Paul Norell)"]}, {"page": "The Lord of the Rings (film series)", "response": ["| Paul Norell", "The Lord of the Rings left a legacy of court cases over profits from the trilogy. Sixteen cast members (Noel Appleby, Jed Brophy, Mark Ferguson, Ray Henwood, Bruce Hopkins, William Johnson, Nathaniel Lees, Sarah McLeod, Ian Mune, Paul Norell, Craig Parker, Robert Pollock, Martyn Sanderson, Peter Tait and Stephen Ure) sued over the lack of revenue from merchandise bearing their appearance. The case was resolved out of court in 2008. The settlement came too late for Appleby, who died of cancer in 2007. Saul Zaentz also filed a lawsuit in 2004 claiming he had not been paid all of his royalties."]}, {"page": "List of Hercules: The Legendary Journeys and Xena: Warrior Princess characters", "response": ["* Falafel (portrayed by Paul Norell) - A traveling merchant who opened food stands all over Greece. He was selling fast food falafels when he first met Hercules in \"The Other Side.\" In \"Once a Hero,\" Falafel was in Argos selling souvenirs like Hercules dolls and Argo models at the time of a 10-year Argonaut reunion. In \"Promises,\" Hercules and Iolaus found that Falafel had set up a fast food stand on the path to Zebron. Iolaus was so hungry that he went against Hercules' advice not to order from Falafel's fast food stand. The food later gave Iolaus stomach problems. In \"The Wedding of Alcmene,\" Falafel was on the road selling tacos to Princess Dirce at the time when Iolaus was running to get Iphicles. Though Iolaus encouraged her not to eat the tacos, Princess Dirce did so anyway and later threw up when she joined Iolaus. Hearing about Jason and Alcmene's wedding, Falafel invited himself to it as a caterer where he made them a giant wedding cake. In \"Doomsday,\" Falafel owed money to his creditors and disguised himself with a beard where he sold sea serpents with \"Eyes and Fries\" in Euboa. In \"Surprise, Falafel became a friend of Hercules' family and catered to his birthday party. When Callisto poisoned the guests, Falafel tried to kill Iphicles who he saw as a pig. In \"The End of the Beginning,\" Falafel was in Cyrenia trying to sell a device called the Falafelometer. Hercules had to step in to save him when a rowdy villager tried to eat one of Falafel's egg-laying chickens.", "* Falafel II (portrayed by Paul Norell) - In the alternate reality, Falafel was a chef who was considered the best. During Nebula II's reign, Falafel II hosted \"Wheel of Misfortune,\" a twisted game show in which \"contestants\" were brutally killed for the enjoyment of the audience. "]}, {"page": "Power Rangers S.P.D.", "response": ["* Paul Norell as Supreme Commander Fowler Birdie"]}, {"page": "Gabriel Reid", "response": ["His 2004 short film, As Dreams Are Made On starring Raymond Hawthorne, was invited to screen at Rhode Island International Film Festival, Melbourne International Film Festival and the New Zealand International Film Festival. at the New Zealand Film Commission His 2015 short film, Every Moment, won four awards at Tropfest N.Z., including Best Film and Best Actress (Bree Peters). at Tropfest Reid and his writing partner, Maile Daugherty, were awarded Best Short Film Screenplay at the New Zealand Writers Guild Awards, the SWANZ. The short was nominated in three categories at the New Zealand Film Awards. In 2019 the New Zealand Film Commission made Reid a recipient of Catalyst He Kauahi; a substantial grant facilitating feature film development via the production of high-end, narrative shorts. The grant was applied to Impossible, written and directed by Reid, produced by Belindalee Hope and Karpal Singh, starring Paul Norell and Diamond Langi. Post-produced at Sir Peter Jackson's Park Road Post, the film was mixed by two-time Academy Award winner Michael Hedges.     "]}, {"page": "List of Power Rangers cast members", "response": ["* Paul Norell -- Supreme Commander Fowler Birdy [voice actor]"]}, {"page": "Middle-earth in film", "response": ["| Paul Norell"]}, {"page": "List of Power Rangers Jungle Fury characters", "response": ["* Crocovile (voiced by Paul Norell) - A Rinshi who holds the spirit of the crocodile. He is voiced by Paul Norell."]}, {"page": "Norell", "response": ["*Paul Norell (born 1952), English actor residing in New Zealand"]}, {"page": "Norell, Paul", "response": ["#redirectPaul Norell"]}]}}