{"wiki_id": "http://www.wikidata.org/entity/Q20647712", "itemLabel": "Les McJannet", "itemDescription": "Scottish footballer and manager (born 1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Les_McJannet", "wikipedia_page": {"main": "William Leslie McJannet (born 2 August 1961) is a Scottish former footballer who made 193 appearances in the Football League playing as a right back for Mansfield Town, Scarborough and Darlington between 1979 and 1992. He remained with Darlington for their 1989–90 Football Conference title-winning season, and also played non-league football for clubs including King's Lynn, Burton Albion, Matlock Town and Boston United.He went on to manage in non-league football, taking charge of Sutton Town, Glapwell and Carlton Town.", "link_mentions": [{"page": "Glapwell F.C.", "response": ["There was gradual improvement, the first season ended in disappointment by missing out on the play-offs by just a single goal after a 3–1 defeat at Stamford A.F.C. on the final day of the season. A change in manager saw John Gaunt replace Les McJannet in the Hall Corner dug-out and the following season Glapwell were just inches away from promotion after an agonising 1–0 defeat at Chasetown F.C. in the play-off final in front of 1300 people. At the start of the 2010–11 season, the club entered an agreement with Mansfield Town F.C. to play their home games at their Field Mill ground. But when the Stags were locked out by their landlord at Christmas, Glapwell returned to play the second half of the season at Hall Corner. After a ninth-place finish and despite striker Ian Holmes's best efforts finishing top goalscorer of the league with 32 goals, poor results at the end of the season had cost them another shot at the play-offs, the club were forced to resign from the Northern Premier League at the end of the season due to ground licensing issues after a dispute with the local parish council. "]}, {"page": "List of Mansfield Town F.C. players", "response": ["|align=\"left\"|Macjannet, LesLes McJannet"]}, {"page": "William Leslie McJannet", "response": ["#REDIRECT Les McJannet"]}, {"page": "1979–80 Mansfield Town F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Les McJannet"]}, {"page": "1980–81 Mansfield Town F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Les McJannet"]}, {"page": "1981–82 Mansfield Town F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Les McJannet"]}]}}