{"wiki_id": "http://www.wikidata.org/entity/Q2062124", "itemLabel": "Conway Tearle", "itemDescription": "actor (1878-1938)", "wikipedia_url": "https://en.wikipedia.org/wiki/Conway_Tearle", "wikipedia_page": {"main": "Conway Tearle (born Frederick Conway Levy, May 17, 1878 – October 1, 1938) was an American stage actor who went on to perform in silent and early sound films.", "link_mentions": [{"page": "Tod Browning", "response": ["While Lon Chaney was making The Tower of Lies (1925) with director Victor Sjöström Browning wrote and directed an Aileen Pringle vehicle, The Mystic.Eaker, 2016: \"Because of the lack of usual Browning stars, The Mystic is an interesting, lesser-known film in the director's canon. Not only is it thematically related to his other films, but it also shows the idiosyncratic continuity of his taste in actresses...\"Sobchack, 2006 p. 24 The picture has many of the elements typical of Browning oeuvre at M-G-M: Carnivals, Hungarian Gypsies and séances provide the exotic mise-en-scene, while the melodramatic plot involves embezzlement and swindling. An American con man Michael Nash (Conway Tearle) develops a moral conscience after falling in love with Pringle's character, Zara, and is consistent with Browning's \"themes of reformation and unpunished crimes.\" and the couple achieve a happy reckoning.Eaker, 2016: \"Their relationship is reminiscent of the one between Priscilla Dean and Wheeler Oakman in Browning's Outside The Law (1920), as are the familiar Browning themes of reformation and unpunished crimes.\" Browning, a former sideshow performer, is quick to reveal to his movie audience the illusionist fakery that serves to extract a fortune from a gullible heiress, played by Gladys Hulette.Eaker, 2016: \"Of course, Zara's clairvoyant act is all illusion and Browning, as usual, lets his audience in on the trickery almost from the outset.\""]}, {"page": "Clara Bow", "response": ["Bow appeared in eight releases in 1926: five for Paramount, including the film version of the musical Kid Boots with Eddie Cantor, and three loan-outs that had been filmed in 1925. In late 1925, Bow returned to New York to co-star in the IbsenesqueKoszarski, Richard. Hollywood on the Hudson, Rutgers University Press, 2008. p. 55 drama Dancing Mothers, as the good/bad \"flapperish\" upper-class daughter Kittens. Alice Joyce starred as her dancing mother, with Conway Tearle as \"bad-boy\" Naughton. The picture was released on March 1, 1926. Local reviews were very positive; \"Clara Bow, known as the screen's perfect flapper, does her stuff as the child, and does it well\",Lacrosse Tribune and Leader, March 24, 1926. and \"her remarkable performance in Dancing Mothers ... \".Bakersfield Californian, August 13, 1926  Louise Brooks remembered her in Brownlow's book; \"She was absolutely sensational in the United States ... in Dancing Mothers ... she just swept the country ... I know I saw her ... and I thought ... wonderful.\""]}, {"page": "Corinne Griffith", "response": ["In 1923, after three years of marriage, Griffith divorced Campbell, who she claimed was an abusive alcoholic. The same year, Griffith left Vitagraph Studios, signing a more lucrative contract of $10,000 a week with First National, where she became one of their most popular stars. Her first film for the studio was Frank Lloyd's Black Oxen (1923), a drama in which she portrayed a mysterious Austrian countess. The film, in which Griffith co-starred with Conway Tearle and Clara Bow, became a hit."]}, {"page": "1938 in film", "response": ["*October 1 – Conway Tearle, 60, American stage & film actor, The Hurricane Express, Romeo and Juliet, Stella Maris, The Lost Zeppelin"]}, {"page": "1920 in film", "response": ["*April Folly directed by Robert Z. Leonard; starring Marion Davies and Conway Tearle"]}, {"page": "Romeo and Juliet (1936 film)", "response": ["* Conway Tearle as Escalus – Prince of Verona"]}, {"page": "James Oliver Curwood", "response": ["* Trails End (1935), directed by Albert Herman. Starring Conway Tearle, Claudia Dell, Fred Kohler and Stanley Blystone"]}, {"page": "Owen Moore", "response": ["Moore appeared in many successful films for Lewis J. Selznick (father of producer David O. Selznick and agent Myron Selznick), in the late teens and early 1920s.  He was a popular star at Selznick Pictures along with Olive Thomas, Elaine Hammerstein, Eugene O'Brien and Conway Tearle. He also appeared in films for his own production company as well as Goldwyn and Triangle."]}, {"page": "Paramount Theatre (Oakland, California)", "response": ["The gala premiere on December 16, 1931, was attended by Kay Francis, star of the opening film, The False Madonna, and cast members Conway Tearle, Charles D. Brown, Marjorie Gateson, and William Boyd (not yet known as Hopalong Cassidy). Notable guests included California's governor James Rolph and Oakland mayor Fred N. Morcom. Tickets were first-come, first-served: sixty cents for the balcony seat and eighty-five cents for a seat in the orchestra.Stone, Susannah Harris. The Oakland Paramount, Lancaster-Miller Publishers, page 18, (1982) –  The program also included a Fox Movietone News newsreel, a Silly Symphony animated cartoon The Spider and the Fly, and the music of the Paramount's own 16-piece house orchestra, under the direction of Lew Kosloff. Last on the program was the stage show Fanchon & Marco's \"Slavique Idea\", a forty-minute revue featuring Sam Hearn, comedians Brock and Thompson, dancer LaVonne Sweet, the acrobatic Seven Arconis, Patsy Marr, and the Sunkist Beauties in a chorus-line finale."]}, {"page": "Vanity Fair (1932 film)", "response": ["Vanity Fair is a 1932 American pre-Code drama film directed by Chester M. Franklin and starring Myrna Loy, Conway Tearle and Anthony Bushell. The film is modernized adaptation of William Makepeace Thackeray's 1848 novel of the same name with the original Regency-era story reset in Twentieth Century Britain. Three years later Thackeray's novel was adapted again as Becky Sharp, the first three-strip technicolor film.", "Upon her arrival at the residence of Lord Crawley, Becky quickly stirs the passions of both the elderly Sir Pitt and his son Rawdon (Conway Tearle).  The new governess entices them with her suggestive comments and by allowing each man into her bedroom at night while she glides about in her satin pajamas.  Soon she and Rawdon begin a secretive affair, but Sir Pitt finally catches them together in Becky's bedroom.  There they inform him they had married the previous day.  That news enrages the old man, who orders his son and his \"shameless little hussy\" out of his house.", "*Conway Tearle as Rawdon Crawley", "The Film Daily was even more critical of the film than Variety. The subheading of its review summarized the film as being a \"Dull Drama\" and an \"Uninteresting Adaptation of Classic Novel That Falls Flat\".\"'Vanity Fair'\", review, The Film Daily (New York, N.Y.), May 8, 1932, page 10. Internet Archive, San Francisco, California. Retrieved February 3, 2018. The influential publication found Conway Tearle's performance to be the only aspect of the production that was truly noteworthy:"]}, {"page": "Anne Nichols", "response": ["In 1937 Nichols produced Hey Diddle Diddle, a comedy play written by Bartlett Cormack whose setting was a duplex apartment in Hollywood. The play premiered in Princeton, New Jersey, on January 21 with Lucille Ball as Julie Tucker, \"one of three roommates coping with neurotic directors, confused executives, and grasping stars who interfere with the girls' ability to get ahead.\" The play received good reviews, but there were problems, chiefly with its star, Conway Tearle, who was in poor health.  Cormack wanted to replace him, but Nichols said the fault lay with the character and insisted that the part needed to be reshaped and rewritten. The two were unable to agree on a solution. The play was scheduled to open on Broadway at the Vanderbilt, but closed after one week in Washington, D.C., when Tearle suddenly became gravely ill.Brady, Kathleen (2001), Lucille: the Life of Lucille Ball, New York, New York: Watson-Guptill Publications, p. 73-74, "]}, {"page": "Edmund Goulding", "response": ["|1921 || A Man of Stone || Selznick|| Conway Tearle, Martha Mansfield || Screenwriter", "|1926 || Dancing Mothers || Paramount Pictures || Conway Tearle, Alice Joyce, Clara Bow || Based on one of his plays"]}, {"page": "Gold Diggers of 1933", "response": ["The story is based on the play The Gold Diggers by Avery Hopwood, which ran for 282 performances on Broadway in 1919 and 1920.IBDB \"The Gold Diggers\"  The play was made into a silent film in 1923 by David Belasco, the producer of the Broadway play, as The Gold Diggers, starring Hope Hampton and Wyndham Standing, and again as a talkie in 1929, directed by Roy Del Ruth. That film, Gold Diggers of Broadway, which starred Nancy Welford and Conway Tearle, was one of the biggest box office hits of that year, and Gold Diggers of 1933 was one of the top-grossing films of 1933.TCM Notes  This version of Hopwood's play was written by James Seymour and Erwin S. Gelsey, with additional dialogue by David Boehm and Ben Markson."]}, {"page": "Bad Company (1925 film)", "response": ["Bad Company is a 1925 American silent romantic drama film directed by Edward H. Griffith, based on a story by John C. Brownell. It stars Madge Kennedy, Conway Tearle, and Bigelow Cooper.The AFI Catalog of Feature Films: Bad CompanyProgressive Silent Film List: Bad Company at silentera.com"]}, {"page": "Phonofilm", "response": ["# Bella Donna (1923) Paramount Pictures feature film directed by George Fitzmaurice and starring Pola Negri and Conway TearleSilentEra entry"]}, {"page": "Gold Diggers of Broadway", "response": ["Businessman Stephen Lee (Conway Tearle) angrily forbids his nephew Wally (William Bakewell) to marry Violet, one of the showgirls. A corpulent lawyer friend, Blake (Albert Gran), advises him to befriend the showgirl first before making a decision. The showgirls are friends who stick together, and the most raucous girl called Mabel (Winnie Lightner) takes a fancy to Blake, calling him 'sweetie' and showing her appreciation by singing him a song (\"Mechanical Man\").", "* Conway Tearle as Stephen Lee ", "*\"Picture a profuse procession of revue spectacle scenes in amazing settings ... superbly staged chorus dancing numbers ..... the flashing wit of Winnie Lightner ... the charm of Nancy Welford ...the astounding dancing of Ann Pennington ...the crooning of Nick Lucas ...love scenes as only Conway Tearle can play them ..... a story that had New York gasping and giggling for one solid year ... and you only begun to imagine the treat that is in store for you\""]}, {"page": "The Hurricane Express", "response": ["* Conway Tearle as Stevens, Railroad attorney "]}, {"page": "Godfrey Tearle", "response": ["Born in New York City and brought up in Britain, he was the son of British actor/manager George Osmond Tearle (1852–1901) and American actress Marianne \"Minnie\" Conway (1852-1896),Ancestry.ca: Marianne \"Minnie\" ConwayMarianne Tearle; socialarchive.iath.virginia.edu the brother of actor Malcolm Tearle, and the half-brother of silent film star Conway Tearle. His maternal grandmother was Sarah Crocker Conway."]}, {"page": "Lucy Beaumont (actress)", "response": ["Beaumont played mostly mother parts on the screen. Some of her films are The Greater Glory (1926), with Conway Tearle, The Man Without A Country (1925), with Pauline Starke, Torrent (1926), with Ricardo Cortez, The Beloved Rogue, with John Barrymore, Resurrection (1927), with Dolores del Río, The Crowd (1928), with Eleanor Boardman and Maid of Salem (1937), her final motion picture, with Claudette Colbert. Her final professional appearance was in April 1937 on the Robert L. Ripley radio programme."]}, {"page": "Klondike Annie", "response": ["* Conway Tearle as Vance Palmer"]}, {"page": "Wildcat (musical)", "response": ["Wildcat was Ball's only appearance in a Broadway production. She previously had been cast in the Bartlett Cormack play Hey Diddle Diddle, a comedy that premiered in Princeton, New Jersey on January 21, 1937. Ball played the part of Julie Tucker, \"one of three roommates coping with neurotic directors, confused executives, and grasping stars who interfere with the girls' ability to get ahead.\" The play received good reviews, but there were problems, chiefly with its star Conway Tearle; the play was scheduled to open on Broadway at the Vanderbilt Theatre, but closed after one week in Washington, D.C. when Tearle suddenly became gravely ill.Brady, Kathleen (2001), Lucille: The Life of Lucille Ball. New York: Watson-Guptill Publications, pp. 73-74. "]}, {"page": "Films of the Golden Age", "response": ["Among the many performers who have been covered by the magazine over the years were Tyrone Power, Butterfly McQueen, Olivia de Havilland, Betty Hutton, Robert Mitchum, Noël Coward, Anita Page, Conway Tearle, Edna May Oliver, James Dean, Dorothy Dandridge, Gene Kelly, Esther Williams, Una Merkel, and directors Michael Curtiz, and W. S. Van Dyke."]}, {"page": "List of American films of 1931", "response": ["|The False Madonna || Stuart Walker || Kay Francis, Conway Tearle, William Boyd || Drama || Paramount", "|Morals for Women || Mort Blumenstock || Bessie Love, Conway Tearle || Drama || Tiffany", "| Pleasure || Otto Brower || Conway Tearle, Carmel Myers, Frances Dade || Drama || Independent"]}, {"page": "List of American films of 1932", "response": ["|Her Mad Night || E. Mason Hopper || Conway Tearle, Irene Rich || Crime || Independent", "|The King Murder || Richard Thorpe || Conway Tearle, Natalie Moorhead || Mystery || Chesterfield ", "|Vanity Fair||Chester M. Franklin ||Myrna Loy, Conway Tearle ||Drama || Independent"]}, {"page": "List of American films of 1934", "response": ["| Fifteen Wives || Frank R. Strayer || Conway Tearle, Natalie Moorhead || Mystery || Chesterfield", "| Sing Sing Nights || Lewis D. Collins || Conway Tearle, Jameson Thomas || Drama || Monogram"]}, {"page": "List of American films of 1935", "response": ["| The Judgement Book || Charles Hutchison || Conway Tearle, Bernadene Hayes || Western || Poverty Row", "| Trails End || Albert Herman || Conway Tearle, Claudia Dell, Fred Kohler || Western || Independent"]}, {"page": "List of American films of 1936", "response": ["|Desert Guns || Charles Hutchison || Conway Tearle, Margaret Morris || Western || Poverty Row", "| Senor Jim || Jacques Jaccard || Conway Tearle, Barbara Bedford, Betty Mack || Western || Independent"]}, {"page": "List of American films of 1920", "response": ["| April Folly || Robert Z. Leonard || Marion Davies, Conway Tearle || Drama || Paramount", "| The Forbidden Woman || Harry Garson || Clara Kimball Young, Conway Tearle || Drama || FBO", "| Marooned Hearts || George Archainbaud || Conway Tearle, Zena Keefe || Drama || Selznick", "| The Road of Ambition || William P. S. Earle || Conway Tearle, Gladden James || Drama || Selznick", "| She Loves and Lies || Chester Withey || Norma Talmadge, Conway Tearle || Comedy drama || Select", "| Two Weeks || Sidney Franklin || Constance Talmadge, Conway Tearle || Romantic comedy || First National", "| Whispering Devils || Harry Garson || Conway Tearle, Rosemary Theby || Drama || Independent"]}, {"page": "List of American films of 1921", "response": ["| A Man of Stone || George Archainbaud || Conway Tearle, Martha Mansfield || Drama || Selznick"]}, {"page": "List of American films of 1922", "response": ["| The Eternal Flame|| Frank Lloyd|| Norma Talmadge, Adolphe Menjou, Conway Tearle|| Adventure || First National", "| Love's Masquerade ||William P. S. Earle || Conway Tearle, Winifred Westover || Drama || Selznick", "| One Week of Love || George Archainbaud || Elaine Hammerstein, Conway Tearle || Drama || Selznick", "| The Referee || Ralph Ince || Conway Tearle, Anders Randolf, Gladys Hulette || Drama || Selznick", "| Shadows of the Sea || Alan Crosland || Conway Tearle, Crauford Kent, Doris Kenyon || Action || Selznick", "| A Wide Open Town || Ralph Ince || Conway Tearle, Faire Binney || Drama || Selznick"]}, {"page": "List of American films of 1923", "response": ["| Ashes of Vengeance || Frank Lloyd || Norma Talmadge, Conway Tearle, Wallace Beery || Drama || First National", "| Black Oxen || Frank Lloyd || Corinne Griffith, Conway Tearle || Drama || First National", "| The Common Law || George Archainbaud || Corinne Griffith, Conway Tearle || Drama || Selznick", "| The Dangerous Maid || Victor Heerman || Constance Talmadge, Conway Tearle, Charles K. Gerrard || Historical comedy || First National", "| The Rustle of Silk || Herbert Brenon || Betty Compson, Conway Tearle, Anna Q. Nilsson || Romance || Paramount"]}, {"page": "List of American films of 1924", "response": ["|Flirting with Love || John Francis Dillon || Colleen Moore, Conway Tearle || Drama || First National", "|Lilies of the Field || John Francis Dillon || Corinne Griffith, Conway Tearle || Drama || First National", "|The Next Corner || Sam Wood || Dorothy Mackaill, Lon Chaney, Conway Tearle || Drama || Paramount", "|The White Moth || Maurice Tourneur || Barbara La Marr, Conway Tearle || Drama || First National"]}, {"page": "List of American films of 1925", "response": ["|The Great Divide || Reginald Barker || Alice Terry, Conway Tearle, Wallace Beery || Drama || MGM", "|Heart of a Siren || Phil Rosen || Barbara La Marr, Conway Tearle || Romance || First National", "|Just a Woman || Irving Cummings || Claire Windsor, Conway Tearle || Drama || First National", "|Morals for Men || Bernard H. Hyman || Conway Tearle, Agnes Ayres, Alyce Mills || Drama || Tiffany", "|The Mystic|| Tod Browning || Aileen Pringle, Conway Tearle || Thriller || MGM", "|School for Wives || Victor Halperin || Conway Tearle, Sigrid Holmquist || Drama || Vitagraph"]}, {"page": "List of American films of 1926", "response": ["|The Dancer of Paris || Alfred Santell || Conway Tearle, Dorothy Mackaill || Drama || First National", "|Dancing Mothers || Herbert Brenon || Alice Joyce, Conway Tearle, Clara Bow || Drama || Paramount", "|The Greater Glory || Curt Rehfeld|| Conway Tearle, Anna Q. Nilsson, May Allison || Drama || First National", "|My Official Wife || Paul L. Stein || Irene Rich, Conway Tearle, Jane Winton || Drama || Warner Bros.", "|The Sporting Lover || Alan Hale || Conway Tearle, Barbara Bedford, Ward Crane || Sports || First National"]}, {"page": "List of American films of 1927", "response": ["|Altars of Desire || Christy Cabanne || Mae Murray, Conway Tearle || Drama || MGM", "|Enemies of Society || Ralph Ince || Conway Tearle, Margaret Morris || Silent || FBO", "|The Isle of Forgotten Women || George B. Seitz || Conway Tearle, Dorothy Sebastian || Drama || Columbia"]}, {"page": "List of American films of 1929", "response": ["| Evidence || John G. Adolfi || Pauline Frederick, Conway Tearle || Crime || Warner Bros.", "| Gold Diggers of Broadway || Roy Del Ruth || Nancy Welford, Conway Tearle || Musical comedy || Warner Bros.", "| The Lost Zeppelin || Edward Sloman || Conway Tearle, Virginia Valli || Adventure || Tiffany", "| Smoke Bellew || Scott R. Dunlap || Conway Tearle, Barbara Bedford || Adventure || Independent"]}, {"page": "List of American films of 1919", "response": ["| Atonement || William Humphrey || Grace Davison, Conway Tearle, Huntley Gordon || Drama || Independent", "|Human Desire || Wilfrid North || Anita Stewart, Conway Tearle, Vernon Steele || Drama || First National", "|The Mind-the-Paint Girl ||Wilfrid North || Anita Stewart, Conway Tearle, Vernon Steele || Drama || Vitagraph", "|A Virtuous Vamp || Sidney Franklin || Constance Talmadge, Conway Tearle || Comedy || First National", "|The Way of a Woman || Robert Z. Leonard || Norma Talmadge, Conway Tearle || Drama || Independent"]}, {"page": "List of American films of 1918", "response": ["|Stella Maris|| Marshall Neilan ||Mary Pickford, Herbert Standing, Conway Tearle || Drama || Paramount", "| Virtuous Wives  || George Loane Tucker ||  Anita Stewart, Conway Tearle, Hedda Hopper || Drama || First National", "| The World for Sale || J. Stuart Blackton || Conway Tearle, Ann Little || Drama || Vitagraph"]}, {"page": "List of American films of 1917", "response": ["| The Fall of the Romanoffs || Herbert Brenon || Alfred Hickman, Nance O'Neil, Conway Tearle || Drama || First National", "| The Judgment House || J. Stuart Blackton || Violet Heming, Wilfred Lucas, Conway Tearle || Drama || Paramount"]}, {"page": "List of American films of 1914", "response": ["| Shore Acres || Jack Pratt || Riley Hatch, Conway Tearle || Drama || Alco"]}, {"page": "List of American films of 1915", "response": ["| Helene of the North || J. Searle Dawley || Marguerite Clark, Elliott Dexter, Conway Tearle || Drama || Paramount", "| Poor Schmaltz || Hugh Ford || Sam Bernard, Conway Tearle || Comedy || Paramount", "| The Seven Sisters || Sidney Olcott || Madge Evans, Marguerite Clark, Conway Tearle || Romance || Paramount"]}, {"page": "List of American films of 1916", "response": ["| The Common Law || Albert Capellani || Clara Kimball Young, Conway Tearle, Paul Capellani || Drama || Selznick", "| The Foolish Virgin|| Albert Capellani || Clara Kimball Young, Conway Tearle, Paul Capellani || Drama || Selznick", "| The Heart of the Hills || Richard Ridgely || Mabel Trunnelle, Conway Tearle || Drama || Edison"]}, {"page": "Jules Levy (musician)", "response": ["His son, Jules Levy, Jr., was also an accomplished cornetist and trumpeter. He recorded from 1919 to 1932,The JAZZ Discography - by Tom Lord at www.lordisco.com often with groups led by Joseph Samuels. Levy was bigamously married to actress Mary “Minnie” Conway in the 1870s. Their son, Frederick Conway Levy, was the popular stage and screen actor Conway Tearle. "]}, {"page": "List of adventure films of the 1920s", "response": ["|Shadows of the Sea||Alan Crosland||Doris Kenyon, Conway Tearle||United States||Sea adventure", "|The Lost Zeppelin||Edward Sloman||Conway Tearle, Virginia Valli, Ricardo Cortez||United States||"]}, {"page": "List of science fiction films of the 1920s", "response": ["|Black Oxen ||Frank Lloyd||Corinne Griffith, Conway Tearle, Clara Bow ||United States||"]}, {"page": "Myrna Loy filmography", "response": ["|Vanity Fair || Becky Sharp || Chester M. Franklin|| Conway Tearle||"]}, {"page": "Stingaree (1934 film)", "response": ["* Conway Tearle as Sir Julian Kent"]}, {"page": "List of British films of 1931", "response": ["|Captivation||John Harvel||Betty Stockfeld, Conway Tearle||Romantic comedy||"]}]}}