{"wiki_id": "http://www.wikidata.org/entity/Q20685269", "itemLabel": "Brian Rawling", "itemDescription": "British producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Rawling", "wikipedia_page": {"main": "Brian Rawling is a British record producer and songwriter. He is the managing director of publisher and production company Metrophonic. Rawling has produced singles and albums for artists such as Cher, with whom he won a Grammy in 1999 for his work on Believe, Tina Turner, Enrique Iglesias, and One Direction.", "link_mentions": [{"page": "Grammy Award for Record of the Year", "response": ["| Brian Rawling & Mark Taylor, producers; Mark Taylor, engineer/mixer"]}, {"page": "Billy Kinsley", "response": ["Kinsley formed a side band, The Cheats, with members Kenny Parry (guitar), and Brian Rawling (drums), playing pubs and clubs in and around Merseyside. In the mid-1980s, Phil Chittuck joined the band in place of Rawling, and they released the following two singles (as Liverpool Express): \"So What\" and \"If You're Out There\". Kinsley later took on more session work. Then most notably he joined (with old friend Kenny Parry) The Pete Best Band, with whom he recorded a live album Live At The Adelphi (recorded in 1988), and on which he plays bass and sings lead vocal and is credited with \"editing\" (the album was not released until the 1990s) as well as working on a single (\"Heaven\").  In the mid-1990s, Kinsley re-joined The Merseybeats. In 1999, he once again joined The Pete Best Band and recorded Casbah Coffee Club, which he produced and sang lead vocal, played bass, and rhythm guitar (once again bringing along his friend Kenny Parry to play lead guitar on some tracks). Liverpool Express recorded an album in 2003, Once Upon a Time, which followed a best of album, and a single, a tribute to the Beatles, titled \"John George Ringo & Paul\"."]}, {"page": "42nd Annual Grammy Awards", "response": ["** Brian Rawling & Mark Taylor, producers; Mark Taylor, engineer/mixer"]}, {"page": "Light Years (Kylie Minogue album)", "response": ["Minogue made several demos with a set of writers and producers arranged by Brian Rawling, including Steve Torch, Graham Stack, and Mark Taylor.;  She ended up recording \"On a Night Like This\", a song written originally for the Swedish recording artist Pandora for her 1999 album No Regrets. In New York, A&R executive Jamie Nelson pitched a demo of \"Spinning Around\" to Minogue and she agreed to record it. The track—written by Ira Shickman, Osborne Bingham, Kara DioGuardi, and Paula Abdul—was originally intended to be featured on Abdul's studio album, but it was given to Minogue after the album failed to materialise. Minogue recorded \"Under the Influence of Love\", a song written by Paul Politi and Barry White that Love Unlimited covered in 1974. The track reminded Minogue of her previous songs, despite having not heard it before the production of Light Years.;  Johnny Douglas wrote and produced \"Password\", \"Disco Down\", and \"Koocachoo\"; he also produced \"So Now Goodbye\", a track that Minogue wrote with Anderson.; ; "]}, {"page": "Dedicated (Lemar album)", "response": ["*Brian Rawling – arranger, producer", "Category:Albums produced by Brian Rawling"]}, {"page": "Enrique (album)", "response": ["Category:Albums produced by Brian Rawling"]}, {"page": "Sound of the Underground (album)", "response": ["Category:Albums produced by Brian Rawling"]}, {"page": "Cherie (album)", "response": ["Category:Albums produced by Brian Rawling"]}, {"page": "Anggun", "response": ["Anggun's sixth French-language studio album, Toujours un ailleurs, was released in November 2015 by TF1 Musique under Universal Music Group with her lead single, \"A nos enfants\". Produced by Frédéric Chateau and Grammy Award-winning producer Brian Rawling, the album revisited the world music direction of her debut international album with diverse cultures ambiance, such as Japanese, Colombian, Samoan, Spanish, and English. Toujours un ailleurs became Anggun's most successful album in France since Luminescence (2005), charting for 24 weeks on the French Albums Chart (peaking at number 43) and sold over 50,000 copies. It also became her best-charting album in Belgium, debuting at number 43 and remaining on the chart for 31 weeks (making 5 re-enters). The album's single, \"Nos vies parallèles\" peaked at number 47 on the French Singles Chart and number 39 on the Belgian Ultratop Singles Chart (her first top-40 hit since \"Être une femme\"). This single featured one of French musical legends Florent Pagny as he helped Anggun to pursue her career in France years ago and Columbian singer Yuri Buenaventura. According to Francophonie Diffusion, \"Nos vies parallèles\" was the third-most played French song worldwide during March 2016. Both Anggun and Florent Pagny traveled to Havana, Cuba, for music video shooting which directed by Igreco. Maxime Le Forestier's song, \"Née quelque part\", being rearranged by Anggun and her team, alongside Grammy Award-winning singer and UN Goodwill Ambassador Angélique Kidjo as she featured in this single. \"Face au vent\" was the third lead single of this album after \"A nos enfants\" and \"Nos vies parallèles\". In this single's music video, actor and dancer Benoît Maréchal being featured again after he did great performance on \"A Crime\" and \"Garde-moi\" music videos in 2006. Darius Salimi was chosen to direct six music videos for this album,including \"A nos enfants\", \"Face au vent\", \"Toujours un ailleurs\", \"Est-ce que tu viendras?\", \"Mon capitaine\", and \"Née quelque part\". To promote the album, Anggun embarked on a 23-date concert tour across France and Belgium."]}, {"page": "Heathen (David Bowie album)", "response": ["*Brian Rawling and Gary Miller – co-producers with Bowie on \"Everyone Says 'Hi", "Category:Albums produced by Brian Rawling"]}, {"page": "Stop Crying Your Heart Out", "response": ["* Brian Rawling – production", "Category:Song recordings produced by Brian Rawling"]}, {"page": "The Very Best of Cher", "response": ["* Producers: Sonny Bono,[ Production and credits] Peter Asher, Michael Bolton, Desmond Child, Bob Esty, Snuff Garrett, Steve Lipson, Giorgio Moroder, Brian Rawling, Guy Roche, Bob Rock, Mark Taylor, Diane Warren, Richie Zito"]}, {"page": "On a Night Like This", "response": ["\"On a Night Like This\" is a song recorded by Australian recording artist Kylie Minogue. It was released on 11 September 2000 by Parlophone as the second single for her seventh studio album, Light Years (2000), and distributed in various formats. The track was originally written for Swedish singer Pandora by Steve Torch, Brian Rawling, Graham Stack, and Mark Taylor, while production was handled by the latter two, it was handed to Minogue to record. Musically, \"On a Night Like This\" is a Europop, dance-pop and house song that also incorporates elements of disco. Its lyrical content delves on experiencing unique, possibly sexual experiences during the night.", "After leaving her label Deconstruction Records in 1999, Minogue signed a deal with British label Parlophone that same year and began recording her album Light Years (2000). The following year, she released her comeback single, \"Spinning Around\", which garnered critical and commercial success in Australasia and Europe, and led to her releasing a follow-up single from Light Years. \"On a Night Like This\" was originally written for Swedish recording artist Pandora by Steve Torch, Brian Rawling, Graham Stack, and Mark Taylor, with production being handled by the latter two. Pandora recorded it for her 1999 album, No Regrets, but its composers reportedly believed the result to not gain as much success as they had hoped. As a result, they handed the recording to Parlophone and suggested Minogue to record her vocals over the backing track, which she did. Greek recording artist Anna Vissi had also obtained rights to record the track, and her version appeared on her studio album Everything I Am (2000); both Pandora's and Minogue's version feature the same instrumental, whilst Vissi's had a significantly different production.", "* Brian Rawling – songwriting, composing", "Category:Song recordings produced by Brian Rawling", "Category:Songs written by Brian Rawling"]}, {"page": "Jonathan Ansell", "response": ["G4 were discovered after finishing second on ITV talent show The X Factor in 2004. G4's self-titled debut album produced by Trevor Horn and Brian Rawling, reached Number One for Mother's Day weekend 2005. In total they released 3 albums, sold in excess of 1.5 million albums in the UK, completed 5 sell-out UK tours, sold in excess of 40,000 Live at the Royal Albert Hall DVDs (one of the concerts on their first tour) and also released a best-selling autobiography Our Way.Published in 2005 'Our Way' an Official Illustrated Book by Darren Henley"]}, {"page": "Jo O'Meara", "response": ["In July 2005, O'Meara signed with Sanctuary Records and on 26 September was released her debut solo single, \"What Hurts the Most\", a version of Mark Wills's 2003 song. The song peaked at number 13 on the United Kingdom and 26 in Ireland. On 3 October she released her debut album, Relentless, produced by Brian Rawling, Graham Stack and Bill Padley. The album peaked at No. 48 in UK and it was described by music critics as \"polished\",  \"well constructed\" and \"better than other ex boy and girl band\" albums, citing the O'Meara \"strong voice\" In November the label began planning the second single but executives and O'Meara disagreed over the choice – between \"To Ease Your Pain\", \"Wish I was Over You\" or \"Relentless\" – and she left the label."]}, {"page": "The Final Countdown (song)", "response": ["In 1999, the dance remix \"The Final Countdown 2000\" was released. It was produced by Brian Rawling, who had previously had success with \"Believe\" by Cher. The band's reaction to the remix was less than enthusiastic. \"That remix was a disaster\", drummer Ian Haugland said, \"I wouldn't pass water on it if it was on fire!\" In a 2013 interview with The National, Joey Tempest commented on the remix, saying, \"The band were not happy with it. We were trying to get some other people to do the remix and it just didn't pan out so it ended up becoming a last-minute thing.\"", "Category:Song recordings produced by Brian Rawling"]}, {"page": "Bailamos", "response": ["\"Bailamos\" was written by Paul Barry and Mark Taylor and produced by Barry and Brian Rawling, the same team which wrote and produced Cher's hit \"Believe\". The track first appeared on a limited edition of his Spanish studio album Cosas del Amor and was released as a single in parts of Latin America and Europe. After attending one of Enrique's concerts in March 1999, Will Smith asked Enrique to contribute to the soundtrack of his upcoming movie Wild Wild West and \"Bailamos\" was chosen to appear.MTV.com Will Smith Sizes Up Enrique Iglesias' \"Bailamos\"-mania 24 June 1999 The song quickly became most requested on pop radio in New York, Los Angeles and Miami. Due to the song's popularity, it was released as a single throughout the world. In English, \"Bailamos\" means \"We Dance\" (We Are Dancing). In the United States, the song was seen as part of a wave of crossover music from Latin American singers and a general increase in interest in Latin music, which was started by Ricky Martin's release \"Livin' la Vida Loca\" as well as Carlos Santana's collaboration with Matchbox 20 frontman Rob Thomas of \"Smooth\". The success of \"Bailamos\" was a breakthrough for Iglesias, which enabled him to sign a multi-album deal with Interscope Records. The song would go on to appear on his debut English album Enrique, though slightly altered to fit with the sound of the album. The soundtrack version has a different arrangement in mix from the version of the album.", "Category:Song recordings produced by Brian Rawling"]}, {"page": "I Was Made for Lovin' You", "response": ["Mexican pop singer Paulina Rubio recorded the song with producer Brian Rawling for her sixth studio album, Border Girl, on 2002 at Soundtrack Studios in New York."]}, {"page": "Believe (Cher album)", "response": ["Believe is the twenty-second studio album by American singer and actress Cher, released on October 22, 1998, by WEA and Warner Bros. Records. Following the commercial disappointment of her previous studio album It's a Man's World (1995), her record company encouraged her to record a dance-oriented album, in order to move into a more mainstream sound. Cher started working on the album in the spring of 1998 with English producers Mark Taylor and Brian Rawling at the Dreamhouse Studios in London. The album was dedicated to her former husband Sonny Bono, who had died earlier that year.", "Cher began working on Believe in the summer of 1998 in London, meeting with producers Mark Taylor and Brian Rawling, who had previously worked with Dickins; additional producers included Todd Terry (\"Taxi Taxi\") and Junior Vasquez (who had originally worked on \"Dov'è L'Amore\", but when he sent back his version from New York, it was rejected by Dickens, who decided instead to give the production of the track to Taylor and Rawling as well). Cher also worked with long-time collaborator Diane Warren (who wrote \"Takin' Back My Heart\") and covered two songs: \"The Power\" (Amy Grant) and \"Love Is the Groove\" (Betsy Cook). Furthermore, she decided to include a remix of her 1988 single \"We All Sleep Alone\" from her 1987 Cher album.", "*Brian Rawling – producer", "Category:Albums produced by Brian Rawling"]}, {"page": "Maria Lawson", "response": ["Lawson's second studio album, Emotional Rollercoaster, was produced by Brian Rawling. In a Myspace blog in 2011, Lawson revealed she had returned to the recording studio to re-record and remix some of the tracks. Emotional Rollercoaster is due out some time in 2014 through Right Track Music/Universal Music Operations."]}, {"page": "Twenty Four Seven (Tina Turner album)", "response": ["The album was produced by Mark Taylor and Brian Rawling, the team behind Cher's Believe, Johnny Douglas (Kylie Minogue, George Michael, All Saints etc.), Terry Britten and Absolute, known for their work with British pop acts like Lisa Stansfield, Will Young, Atomic Kitten, Gareth Gates, and S Club 7. Bryan Adams appears on both the title track and \"Without You\".", "* Record producers – Absolute, Terry Britten, Johnny Douglas, Brian Rawling, Mark Taylor", "Category:Albums produced by Brian Rawling"]}, {"page": "Journey South (album)", "response": ["Category:Albums produced by Brian Rawling"]}, {"page": "One Breath Away", "response": ["\"One Breath Away\" is a pop ballad song by Australian singer Sophie Monk, released as the third single from her debut album, Calendar Girl (2003), on 21 July 2003. The song was re-recorded and mixed for single release. The album version was produced by Garry Miller and Brian Rawling while the single version was produced by the Rockmelons. The single peaked at number 23 on the Australian Singles Chart in August 2003.", "Category:Song recordings produced by Brian Rawling"]}, {"page": "Believe (Cher song)", "response": ["\"Believe\" is a song by American singer and actress Cher from her 22nd studio album, Believe (1998). Preceding the album release by three days, \"Believe\" debuted as the lead single on October 19, 1998. \"Believe\" was written by Brian Higgins, Stuart McLennen, Paul Barry, Steven Torch, Matthew Gray, Timothy Powell and Cher, and was produced by Mark Taylor and Brian Rawling. \"Believe\" departed from Cher's pop rock style of the time, adopting an upbeat dance-pop style. It featured a pioneering use of the audio processing software Auto-Tune to distort Cher's vocals, which was widely imitated and became known as the \"Cher effect\". The lyrics describe empowerment and self-sufficiency after a painful breakup.", "*Brian Rawling – production", "Category:Song recordings produced by Brian Rawling"]}, {"page": "Could I Have This Kiss Forever", "response": ["\"Could I Have This Kiss Forever\" is a mid-tempo duet performed by American singer Whitney Houston and Spanish singer Enrique Iglesias. It was written by Diane Warren and produced by David Foster, Mark Taylor and Brian Rawling. The song first appeared on Iglesias's debut English-language album Enrique (1999) as a slow Latin-styled ballad. It was also included on Houston's first compilation album, Whitney: The Greatest Hits (2000). It achieved chart success in many countries, including Switzerland and the Netherlands, where it reached number one."]}, {"page": "Don't Be Fake", "response": ["Category:Albums produced by Brian Rawling"]}, {"page": "Do It for Love (Hall & Oates album)", "response": ["* Producers – Daryl Hall (Tracks #1 & 3-14); John Oates (Track #1); Tom \"T-Bone\" Wolk (Tracks #1 & 3-14); Brian Rawling (Tracks #1, 4, 7, 11 & 12); Mark Taylor (Tracks #1, 4, 7, 11 & 12); Kenny Gioia and Sheppard Goodman (Tracks #2, 7 & 9); Greg Fitzgerald (Tracks #8, 9 & 10); David Bellochio (Track #13).", "Category:Albums produced by Brian Rawling"]}, {"page": "Be with You (Enrique Iglesias song)", "response": ["\"Be with You\" (\"Sólo me importas tú\" in Spanish countries) is a song by Spanish singer-songwriter Enrique Iglesias, released on 29 February 2000 through Interscope Records as the third single from Iglesias's debut English studio album, Enrique (1999). It was co-written by Iglesias and produced by Mark Taylor and Brian Rawling, the team responsible for Cher's hit song \"Believe\". Iglesias once stated that he initially came up with the lyrics of the song while taking a break from recording in London's Hyde Park.", "Category:Song recordings produced by Brian Rawling"]}, {"page": "Border Girl", "response": ["*Brian Rawling – arranger, drums, producer"]}, {"page": "Renaissance (Lionel Richie album)", "response": ["Renaissance is the sixth studio album by American singer Lionel Richie. It was released by The Island Def Jam Music Group on October 16, 2000 in the United States. A breakaway from his previous two albums Louder Than Words (1996) and Time (1998) which had been released after a decade-long hiatus and featured chief production from James Anthony Carmichael, Richie consulted a team of new collaborators to work with him, including Walter Afanasieff, Brian Rawling, Daryl Simmons, and Mark Taylor as well as Rodney Jerkins and his brother Fred.", "Category:Albums produced by Brian Rawling"]}, {"page": "The Truth About Love (Lemar album)", "response": ["Category:Albums produced by Brian Rawling"]}, {"page": "Another Day (Lemar song)", "response": ["Category:Song recordings produced by Brian Rawling"]}, {"page": "It's Not That Easy", "response": ["* Producer - Brian Rawling  Paul Meehan", "Category:Song recordings produced by Brian Rawling"]}, {"page": "Real Love (Lee Ryan song)", "response": ["\"Real Love\" is a song by English singer-songwriter Lee Ryan from his debut solo album, Lee Ryan (2005). It was released as the fourth and final single from the album in 2006. The song was originally produced by Cutfather & Joe, Ash Howes, Martin Harrington, and Remee, and it was remixed by Brian Rawling and Paul Meehan for its single release. \"Real Love\" was not released in Ryan's native United Kingdom, due to the lack of sales for Ryan's previous singles. The track received attention for its use as the theme song for the UK release of the film Ice Age: The Meltdown. The song peaked at No. 57 in Italy and No. 72 in Switzerland.Official Charts Company", "*Additional production – Brian Rawling, Paul Meehan", "Category:Song recordings produced by Brian Rawling"]}, {"page": "Dreams: The Ultimate Corrs Collection", "response": ["*Brian Rawling – producer", "Category:Albums produced by Brian Rawling"]}, {"page": "Soul Man (album)", "response": ["Category:Albums produced by Brian Rawling"]}, {"page": "The Greatest Hits (Cher album)", "response": ["*Brian Rawling – production", "Category:Albums produced by Brian Rawling"]}, {"page": "Someone Should Tell You", "response": ["* Producer - Brian Rawling  Paul Meehan", "Category:Song recordings produced by Brian Rawling"]}, {"page": "Sergey Lazarev", "response": ["Together with British producer Brian Rawling, Lazarev recorded most of the songs for his solo debut Don't Be Fake that was released in November 2005 and sold more than 300,000 copies in Russia alone. In May 2006 Lazarev received Russia's national Music TV Channel's MUZ TV award as Best New Act. The fourth single from the album \"Fake\" was released to clubs in the UK, debuting on 30 July at #28 on the commercial club chart in Music Week."]}, {"page": "Chenoa (album)", "response": ["*Brian Rawling – Keyboards, Programming, Producer, Mixing, Dirigida, Realization", "|align=\"left\" valign=\"top\"|Atrévete (Mystify)Produced by Brian Rawling and Chris Andersson.", "|align=\"left\" valign=\"top\"|Desnuda Frente A TíProduced by Brian Rawling and Chris Andersson.", "Category:Albums produced by Brian Rawling"]}, {"page": "Lara Fabian (1999 album)", "response": ["| 11. || \"I Will Love Again\" || Paul Barry, Mark Taylor || Mark Taylor, Brian Rawling || 03:45", "| 20. || \"Otro Amor Vendrá\" || Paul Barry, Mark Taylor, Chein Garcia Alonso || Mark Taylor, Brian Rawling || 03:42", "*Track 11 produced by Mark Taylor and Brian Rawling.  Recorded by Mark Taylor and Glen Marchese.  Mixed by Mark Taylor.  Mark Taylor: Keyboards and programming.", "Category:Albums produced by Brian Rawling"]}, {"page": "Relentless (Jo O'Meara album)", "response": ["Relentless is the debut solo album by English singer Jo O'Meara. It was released by Sanctuary Records on 3 October 2005 in the United Kingdom, two and a half years after the initial split of her band S Club 7 in May 2003. Chiefly produced by Brian Rawling and co-written by O'Meara, the album is a mix of contemporary pop, disco and soulful ballads. It debuted and peaked at 48 on the UK Albums Chart.", "Category:Albums produced by Brian Rawling"]}, {"page": "Christopher Banks", "response": ["International releases soon followed, including a US release for the Brian Rawling remix of \"One & Only\". The New Zealand-platinum debut album Infinity was released in Asia, Australia and parts of Europe.Amazon.com: Infinity: Music: Deep Obsession"]}, {"page": "When the Heartache Is Over", "response": ["\"When The Heartache Is Over\" is a song by American recording artist Tina Turner. Written by Graham Stack and John Reid for her tenth and final solo studio album, Twenty Four Seven (1999), it was released as the album's leading single on October 18, 1999. The song was a moderate hit in late 1999 and early 2000, reaching number 10 in the UK and the top 20 in several other European countries. The song is produced by British producers Brian Rawling and Mark Taylor."]}, {"page": "Picture of You (album)", "response": ["* Brian Rawling - producer", "Category:Albums produced by Brian Rawling"]}]}}