{"wiki_id": "http://www.wikidata.org/entity/Q2067323", "itemLabel": "Thomas Armstrong", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Armstrong_(musician)", "wikipedia_page": {"main": "Sir Thomas Henry Wait Armstrong (15 June 1898 – 26 June 1994) was an English organist, conductor, composer and educationalist. He was from a musical family and his early career was as a church and cathedral organist. From the 1920s onwards he was a broadcaster for the BBC giving talks as well as playing.\nWhile organist and faculty member of Christ Church, Oxford Armstrong combined academic work with practical musicianship, as player and conductor. From 1955 to 1968 he was principal of the Royal Academy of Music (RAM), London, where he was known for his concern for the well-being of his staff and students and his efforts to strengthen links with overseas music colleges.", "link_mentions": [{"page": "Constant Lambert", "response": ["The son of Australian painter George Lambert and his wife Amy, and the younger brother of Maurice Lambert, Constant Lambert was educated at Christ's Hospital near Horsham in West Sussex. While still a boy he demonstrated formidable musical gifts, and wrote his first orchestral work at the age of 13. In September 1922 Lambert entered the Royal College of Music, where his teachers were Ralph Vaughan Williams, R. O. Morris and Sir George Dyson (composition), Malcolm Sargent (conducting) and Herbert Fryer (piano). His contemporaries there included the pianist Angus Morrison, conductor Guy Warrack, Thomas Armstrong (a future head of the Royal Academy of Music), and the composers Gavin Gordon, Patrick Hadley and Gordon Jacob.Lloyd, Stephen. Constant Lambert: Beyond the Rio Grande (2015) p 32 "]}, {"page": "Barry Rose", "response": ["In 1956, he joined Martindale Sidwell's choir at Hampstead Parish Church as a bass, and two years later to become organist and choirmaster at St Andrew's Church, Kingsbury. While at Kingsbury, Sir Thomas Armstrong offered rose Rose a place at the Royal Academy of Music to study organ with C. H. Trevor. In April 1960, whilst still a 25-year-old unqualified academy student, Rose became the youngest cathedral organist in the country when he was appointed as the first Organist & Master of the Choristers at the new Guildford Cathedral.Barry Rose (Choral Conductor, Organ) bach-cantatas.com"]}, {"page": "Oxford Bach Choir", "response": ["* Thomas Armstrong (1934–55)"]}, {"page": "Jonathan Freeman-Attwood", "response": ["Professor Jonathan Freeman-Attwood, CBE is the 14th PrincipalHis predecessors were William Crotch, Cipriani Potter, Charles Lucas, Sir William Sterndale Bennett, Sir George Macfarren, Sir Alexander Mackenzie, Sir John McEwen, Sir Stanley Marchant, Sir Reginald Thatcher, Sir Thomas Armstrong, Sir Anthony Lewis, Sir David Lumsden, Lynn Harrell, Sir Curtis Price of the Royal Academy of Music in London;https://www.ram.ac.uk/people/jonathan-freeman-attwood he was appointed in 2008. Alongside his commitment to education, he is a writer, recording producer, broadcaster and trumpet player."]}, {"page": "Ernest Bullock", "response": ["After serving as sub-organist to Sydney Nicholson at Manchester Cathedral from 1912 to 1915, Bullock joined the army during the First World War, serving as captain and adjutant until 1919. On his return to civilian life, he was briefly organist of St Michael's College, Tenbury, and then organist and choirmaster at Exeter Cathedral from 1919 to 1927. In the Oxford Dictionary of National Biography, Sir Thomas Armstrong writes of Bullock's time at Exeter: \"with determination that was considered at times ruthless, he put new life into the music of the cathedral, the diocese, and the region\" In 1919 Bullock married Margery Newborn, daughter of a Lincolnshire solicitor. They had two sons and a daughter."]}, {"page": "Michael Hurd (composer)", "response": ["He was born in Gloucester on 19 December 1928 and educated at The Crypt School, Gloucester,See obituary by contemporary at The Crypt School and Pembroke College, Oxford, where he studied music with Thomas Armstrong and Bernard Rose.Geoffrey Bush. Michael Hurd, in Grove Music Online He was also a composition pupil of Lennox Berkeley. After National Service he taught at the Royal Marines Band School at Deal,Memories of ex bandsmen who knew Hurd  (1953-59) before settling as a freelance composer in East Hampshire, where he took a leading role in the area's music-making.Tribute evening at Petersfield Music Festival, He bought the terraced, two-bedroom cottage at 4, Church Street, West Liss in 1961 and lived there for the rest of his life.Biography, michaelhurd.org "]}, {"page": "Anthony Hedges", "response": ["Hedges was born in Bicester, Oxfordshire, and studied music at Keble College Oxford, where his tutors included Thomas Armstrong. While on National Service for two years at Catterick (from 1955) he was a member of the Band of the Royal Signals Regiment.Anthony Hedges: an obituary. Kenneth Shenton, October 2019 From 1957 he was a music lecturer at The Royal Scottish Academy of Music in Glasgow, and from 1962 a lecturer at The University of Hull (1962–94) where he was awarded an Hon.DMus.Bradbury, Ernest. \"Anthony Hedges.\" The Musical Times 113, no. 1555 (1972): 858-61 During his time in Glasgow he also contributed regular reviews and articles on music to The Glasgow Herald, The Scotsman, The Guardian and The Daily Telegraph. While at Hull he met the poet Philip Larkin. "]}, {"page": "Thomas Armstrong", "response": ["* Thomas Armstrong (Australian politician) (1885–1955), member of the New South Wales Legislative Council", "* Thomas Armstrong (New York politician) (1785–1867), New York politician", "* Thomas Armstrong (Wisconsin politician) (1858–1927), Wisconsin politician", "* Sir Thomas Armstrong (English politician) (c. 1633–1684), English army officer and MP, executed for treason", "* Thomas Armstrong (Florida politician) (born 1937), American politician in the state of Florida", "* Thomas Armstrong (Oxford University cricketer) (1849–1929), English cricketer for Oxford University", "* Thomas Armstrong (Nottinghamshire cricketer) (1872–1938), English cricketer for Nottinghamshire", "* Thomas Armstrong (Australian cricketer) (1889–1963), Australian cricketer for Victoria", "* Thomas Armstrong (Derbyshire cricketer) (1909–2000), English cricketer for Derbyshire", "* Thomas Armstrong (footballer) (1898–?), English footballer for Liverpool", "* Sir Thomas Armstrong (musician) (1898–1994), English organist, conductor, educationalist and adjudicator", "* Thomas Armstrong (author) (1899–1978), British novelist ", "* Thomas Armstrong (painter) (1832–1911), English artist and arts administrator", "* Thomas Armstrong (bishop) (1857–1930), Anglican bishop in Australia"]}, {"page": "Anthony Lewis (musician)", "response": ["In 1968 Lewis was appointed principal of the RAM on the retirement of Sir Thomas Armstrong. His biographer Michael Pope observes that the balance between academic and artistic work that characterised Lewis's life was now tilted away from pure scholarship: \"for the next fourteen years he presided over many important developments in an institution where the emphasis was on performance and composition.\" He was concerned at a perceived split in the musical profession between musicologists and performers, and maintained, \"each should look to the other for help, for between them they could enable a great advance to be made in the interpretation of music\".\"Prof Lewis condemns split in music world\", The Times, 4 January 1968, p. 6 The Times judged the post to be well suited to Lewis's talents, and one that he filled with distinction. During his term of office the academy built its own theatre, with about 300 seats, next to the main building. It opened in 1977 with an operatic triple bill by Purcell, Gardner and Sullivan, in which Lewis shared the conducting with Steuart Bedford.Sadie, Stanley. \"Academy gets a proper theatre\", The Times, 28 October 1977, p. 10"]}, {"page": "List of music students by teacher: A to B", "response": ["===Thomas Armstrong==="]}, {"page": "Thomas Armstrong (conductor)", "response": ["#REDIRECT Thomas Armstrong (musician)"]}, {"page": "Toy Symphony (Arnold)", "response": ["The piece was first performed at a Savoy Hotel fund raising dinner in London on 28 November 1957 by a group of eminent composers, musicians and personalities: Denis Truscott (who was Lord Mayer of London in 1957), Thomas Armstrong, Edric Cundell, W Greenhouse Alt (Edinburgh organist, 1889–1969), Gerard Hoffnung, Eileen Joyce, Steuart Wilson, George Baker, David McBain (director, Royal Military School of Music), Leslie Woodgate, Eric Coates (just three weeks before his death) and Astra Desmond, with the Amici String Quartet and Joseph Cooper, piano. It was conducted by the composer. The work is dedicated to the Musicians Benevolent Fund. A score was published in 1958 by Paterson.Craggs, Stewart R. Malcolm Arnold: A Bio-bibliography (1998), p 39Meredith, Anthony and Harris, Paul. Malcolm Arnold (2004), p 158n"]}, {"page": "Sir Thomas H. W. Armstrong", "response": ["#REDIRECT Thomas Armstrong (musician)"]}]}}