{"wiki_id": "http://www.wikidata.org/entity/Q20685458", "itemLabel": "Scot Young", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Scot_Young", "wikipedia_page": {"main": "Scot Young (Dundee 10 January 1962 – London 8 December 2014) was a Scottish property developer, who came to media attention during a protracted and bitter divorce case brought by his former wife Michelle. He claimed to have lost all his assets in a bad property deal, but his ex-wife claimed he was worth “billions” and that the family court should force Scot to pay her several hundred million pounds.\nMichelle managed to persuade the court that Scot had failed to provide complete financial information, and he was jailed for six months. He suffered psychologically, and he received psychiatric support following his release. In 2014, he fell to his death from a window in the London flat of Noelle Reno, his former girlfriend.", "link_mentions": [{"page": "Philip Green", "response": ["In December 2014, Michelle Young accused Philip Green, Richard Caring and Simon Cowell of helping her ex-husband, businessman Scot Young, to hide assets and so avoid paying maintenance to his ex-wife and their two daughters. In February 2015, a note from HSBC bankers in Caring's files mentioned that Philip Green's wife Tina Green had been holding part of Caring's assets in cash on his behalf, prompting suspicions that Caring might have funnelled profits through Tina Green to avoid paying taxes on his assets."]}, {"page": "Clerkenwell crime syndicate", "response": ["At the time, in December 2014, of the death of a bankrupt businessman Scot Young, who had been involved in 2013 in a high-profile divorce case, media reports that flagged Young's involvement with Patrick Adams asserted that Tommy Adams and Michael Adams faced no charges after their arrest earlier in 2014."]}, {"page": "Scott Young", "response": ["* Scot Young (1962–2014), British businessman"]}, {"page": "Montagu Square", "response": ["* Noelle Reno, fashion model, shared the 4th floor penthouse at No.33 with wayward property financier Scot Young, who jumped to his death from there in December 2014."]}, {"page": "Poju Zabludowicz", "response": ["Zabludowicz was called to the High Court in November 2013 as witness in Scot Young's divorce case.Harper, Tom (14 November 2013). \"David Cameron’s billionaire backer quizzed in court as part of Scot Young divorce battle\". The Independent (London). Retrieved 14 November 2013."]}, {"page": "Richard Caring", "response": ["In December 2014, Michelle Young accused Philip Green, Caring and Simon Cowell of helping her ex-husband, businessman Scot Young, to hide assets and so avoid paying maintenance to his ex-wife and their two daughters. In February 2015, a note from HSBC bankers in Caring's files mentioned that Philip Green's wife Tina Green had been holding part of Caring's assets in cash on his behalf, prompting suspicions that Caring might have funnelled profits through Tina Green to avoid paying taxes on his assets."]}, {"page": "Woodperry House", "response": ["After being owned by Farzaneh and Kaveh Moussavi, an Iranian human rights lawyer, it was sold in 2006 for £20m to financier Scot Young, who then sold it in 2009 as part of his £400m divorce. Young sold it on to the Belgian financier Pierre Lagrange, one of the founders of GLG Partners. Legrange has since downsized to a smaller property. "]}, {"page": "2014 in the United Kingdom", "response": ["**Scot Young, 52, businessman and reality television personality (Ladies of London),"]}, {"page": "Noelle Reno", "response": ["Reno first came to the attention of the press in 2004 as a result of dating Matthew Mellon.\"Tatler Magazine\". November 1, 2005. Antoinette Eugster. http://www.tatler.com/bystander/events/2005/december/nick-jones-and-tanner-krolles-dinner-at-cecconis#!/6524/image/4\"Matthew Mellon: Heir Conditioning. W Magazine. Samantha Conti. Dec 2007. http://www.wmagazine.com/culture/2007/12/matthew_mellon/  The engagement was broken off in 2008.Noelle Reno's degree of freedom. The Telegraph. Tim Walker. May 29, 2008. https://www.telegraph.co.uk/news/celebritynews/2050680/Noelle-Renos-degree-of-freedom.html In 2009, Reno began dating Scot Young. At the time Young was beginning divorce proceedings with wife Michelle Young.Wife's fury over £20 million divorce payout in Scot Young case. The Times. Frances Gibb. November 23, 2013. Scot Young died on December 8, 2014, in London from injuries sustained after falling from the window of the fourth-floor penthouse he shared with Reno. Less than a year later Reno started dating Nick Perks, and in November 2016 they had a son together called Xander Maximillian Perks."]}, {"page": "Philip Moor", "response": ["* The divorce of British entrepreneur Scot Young from his wife Michelle Young. This litigation extended from the paperwork filed in 2006 into 2014 at the passing of Scot Young. Michelle Young was awarded £26 million by Judge Moore's decision.Major accountancy firm writes 'extraordinary' letter to High Court judge presiding over high-profile divorce case These divorce proceedings were documented as the longest in British history.Tycoon Scot Young’s millions still missing four years after fatal plunge"]}]}}