{"wiki_id": "http://www.wikidata.org/entity/Q20684067", "itemLabel": "Mary Estlin", "itemDescription": "(1820-1902)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Estlin", "wikipedia_page": {"main": "Mary Anne Estlin (31 July 1820 – 14 November 1902) was a British abolitionist and leading figure in anti-slavery and anti-prostitution campaigns in Britain.\n\n", "link_mentions": [{"page": "Parker Pillsbury", "response": ["Pillsbury's dislike of slavery led him into active writing and lecturing for the abolitionist movement and other progressive social reform issues.  He became a lecturing agent for the New Hampshire, Massachusetts, and American antislavery societies, and held these posts for over two decades. He edited the Concord (N.H.) Herald of Freedom in 1840, and again in 1845 and 1846.  In 1854, he served as an emissary from the American Anti-Slavery Society to Great Britain. He stayed with the surgeon John Estlin and his abolitionist daughter Mary Estlin. Both John and Mary became involved in Pillsbury's problematic correspondence with the British activist Louis Chamerovzow."]}, {"page": "Estlin", "response": ["* Mary Estlin (1820–1902), British abolitionist"]}, {"page": "Clementia Taylor", "response": ["Taylor, Mary Estlin and Eliza Wigham were active in anti-slavery movement in England and in 1863 they all served on Ladies' London Emancipation Society which Taylor led. The Taylors were also closely involved in the movement for Italian unification and Giuseppe Mazzini was a frequent visitor to Aubrey House. During his celebrated 1864 visit to London, a reception was held at Aubrey House for Giuseppe Garibaldi and after Garibaldi visited Mazzini. Noted radical figures at the reception included feminist Emilie Ashurst Venturi; Aurelio Saffi, Karl Blind, Ferdinand Freiligrath, Alexandre Auguste Ledru-Rollin and Louis Blanc."]}, {"page": "Eliza Wigham", "response": ["In 1863 Wigham served on the committee of Clementia Taylor's Ladies' London Emancipation Society with Mary Estlin. In the same year, she wrote The Anti-Slavery Cause in America and its Martyrs, a short book intended to influence the British government. At the time it was feared that Britain might side with the Confederates in the American Civil War and thus would be supporting slavery."]}, {"page": "Edinburgh Ladies' Emancipation Society", "response": ["The society moved away from its support of Garrison, and Eliza and Jane Wigham were encouraged to leave in protest, but they remained as members. The society tried to steer a compromise position between the radical Garrison and the more conservative position of the BFASS. The Wighams supported Mary Estlin's initiative to find common ground between the Garrisonians and the BFASS."]}, {"page": "Ladies' London Emancipation Society", "response": ["In addition to Taylor, other founder members and executive committee included Mary Estlin, Sarah Parker Remond, Harriet Martineau, Eliza Wigham and women's college founders Charlotte Manning and Elizabeth Malleson. This was said to the first national anti-slavery society for women, although other regional anti-slavery organisations for women pre-dated it including the Edinburgh Ladies' Emancipation Society and the Philadelphia Female Anti-Slavery Society (which was founded in 1833).Smith, Jessie Carney and Wynn, Linda T. Freedom Facts and Firsts: 400 Years of the African American Civil Rights Experience Visible Ink Press, 2009. p. 242. "]}, {"page": "Charlotte Manning", "response": ["In 1863, Manning helped found the Ladies' London Emancipation Society led by the philanthropist Clementia Taylor. Other founder members and executive committee members included Mary Estlin, Sarah Parker Remond, Harriet Martineau, Eliza Wigham and another women's college founder Elizabeth Malleson. The Kensington Society was formed in 1865 and this gathered together intelligent women known to the secretary Emily Davies for their \"thoughtfulness\". This discussion group met at Manning's house, 44 Phillimore Gardens, and she was the President of the society from its formation to its dissolution in 1868. The group attracted many notable women, particularly those associated with the improvement in women's access to higher education in Britain. ‘Kensington Society (act. 1865–1868)’, Ann Dingsdale, Oxford Dictionary of National Biography. Retrieved 21 July 2015"]}, {"page": "Elizabeth Malleson", "response": ["In 1863, she was a founding member of the Ladies' London Emancipation Society. Other founder members and executive committee included Mary Estlin, Sarah Parker Remond, Harriet Martineau, Eliza Wigham and another women's college founder Charlotte Manning."]}]}}