{"wiki_id": "http://www.wikidata.org/entity/Q20647924", "itemLabel": "Paula Sherriff", "itemDescription": "British politician (born 1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paula_Sherriff", "wikipedia_page": {"main": "Paula Michelle Sherriff (born 16 April 1975) is a British Labour politician who served as the Member of Parliament (MP) for Dewsbury from 2015 to 2019.", "link_mentions": [{"page": "Kirklees", "response": ["| rowspan=2| Paula Sherriff"]}, {"page": "Dewsbury (UK Parliament constituency)", "response": ["| Paula Sherriff"]}, {"page": "List of Parliamentary constituencies in West Yorkshire", "response": ["|Paula Sherriff‡"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Paula Sherriff, Dewsbury, 2015–2019"]}, {"page": "Health and Social Care Select Committee", "response": ["| Paula Sherriff MP"]}, {"page": "Council for Arab-British Understanding", "response": ["Paula Sherriff MP, MP for Dewsbury and Shadow Women and Equalities Minister."]}, {"page": "Simon Reevell", "response": ["At the 2015 general election Reevell was defeated by Labour's Paula Sherriff who took the seat with a majority of 1,451."]}, {"page": "2015 Labour Party leadership election (UK)", "response": ["*Yvette Cooper (59): Jon Ashworth, Ian Austin, Adrian Bailey, Roberta Blackman-Woods, Lyn Brown, Nick Brown, Chris Bryant, Karen Buck, Richard Burden, Liam Byrne, Ruth Cadbury, Ann Clwyd, Vernon Coaker, Judith Cummins, Jim Cunningham, Nic Dakin, Geraint Davies, Thangam Debbonaire, Jack Dromey, Maria Eagle, Jim Fitzpatrick, Colleen Fletcher, Vicky Foxcroft, Helen Goodman, Kate Green, Fabian Hamilton, David Hanson, Sue Hayman, John Healey, Sharon Hodgson, George Howarth, Diana Johnson, Helen Jones, Kevan Jones, Stephen Kinnock, Chris Leslie, Khalid Mahmood, Shabana Mahmood, Seema Malhotra, John Mann, Steve McCabe, Catherine McKinnell, Madeleine Moon, Melanie Onn, Matthew Pennycook, Jess Phillips, Bridget Phillipson, Stephen Pound, Marie Rimmer, Geoffrey Robinson, Naz Shah, Virendra Sharma, Paula Sherriff, Andy Slaughter, Ruth Smeeth, Karin Smyth, John Spellar, Daniel Zeichner"]}, {"page": "2015 Labour Party deputy leadership election", "response": ["Before dropping out of the race on 11 June, John Healey had the following 20 nominations: Sarah Champion, Clive Efford, Holly Lynch, Kevin Barron, Andy Slaughter, Clive Betts, Ruth Cadbury, Simon Danczuk, Louise Ellman, Fabian Hamilton, Harry Harpham, Madeleine Moon, Paula Sherriff, Derek Twigg, Paul Blomfield, Ivan Lewis, Gordon Marsden, Chris Leslie, Teresa PearceNew Statesman  9 June 2015"]}, {"page": "List of MPs who lost their seat in the 2015 United Kingdom general election", "response": ["|data-sort-value=\"Sherriff, Paula\"|Paula Sherriff"]}, {"page": "List of United Kingdom MPs by seniority (2015–2017)", "response": ["|527||Paula Sherriff||style=\"background-color: \"|Lab||Dewsbury||16/04/1975"]}, {"page": "Shadow Cabinet of Jeremy Corbyn", "response": ["* Paula Sherriff was not replaced as Shadow Minister for Social Care and Mental Health."]}, {"page": "Laura Coryton", "response": ["In March 2016 Parliament accepted a Tampon Tax amendment proposed by Paula Sherriff MP, the then Chancellor George Osborne pledged in his budget to make menstrual products exempt from sales tax. The amendment is set to be implemented by April 2018.  Coryton launched periodwatch.org to countdown to 2018, when the amendment is expected to be enacted into law, and to hold the government to account."]}, {"page": "Tampon tax", "response": ["Laura Coryton led a \"Stop taxing periods, period\" campaign with an online petition to have the European Union remove the value-added tax for sanitary products. George Osborne mentioned the petition by name in his 2015 Autumn Statement pledge to end the tampon tax at the European Union level. The petition platform's CEO cited the campaign as an example of successful clicktivism, with over 320,000 signatures. In March 2016, Parliament created legislation to eliminate the tampon VAT, following a budget amendment by opposition Labour MP Paula Sherriff. It was expected to go into effect by April 2018 but did not do so; several British women protested for it publicly while displaying blood stains from their periods. On 3 October 2018, new EU VAT rules were put forward by the European Parliament which will allow EU countries to stop taxing sanitary products, but these will not come into effect until 2022. The UK left the EU in January 2020, and following the end of the transition period (at the beginning of 2021) the tampon tax was abolished in the UK, meaning there is now a zero rate of VAT applying to women's sanitary products."]}, {"page": "List of MPs elected in the 2017 United Kingdom general election", "response": ["| data-sort-value=\"Sherriff Paula\" | Paula Sherriff"]}, {"page": "List of Parliamentary constituencies in Yorkshire and the Humber", "response": ["|Paula Sherriff‡"]}, {"page": "Parliamentary votes on Brexit", "response": ["* Paula Sherriff, Dewsbury", "* Paula Sherriff, Dewsbury", "* Paula Sherriff, Dewsbury"]}, {"page": "Results of the 2016 United Kingdom European Union membership referendum by constituency", "response": ["| style=\"text-align:left;\"|Paula Sherriff"]}]}}