{"wiki_id": "http://www.wikidata.org/entity/Q2065879", "itemLabel": "Pearl Hackney", "itemDescription": "British actress (1916-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/Pearl_Hackney", "wikipedia_page": {"main": "Pearl Hackney (28 October 1916 – 18 September 2009) was a British actress and the wife of comic actor Eric Barker. She was born in Burton upon Trent, Staffordshire, but spent much of her early life in Liverpool, Lancashire (now Merseyside).As well as appearing with her husband in a number of productions including 21 episodes of The Eric Barker Half-Hour  her television credits also include Coronation Street, Are You Being Served? (as Mrs. Grainger, wife of Mr. Ernest Grainger, in one episode, \"The Clock\", 1974), The Famous Five and All Creatures Great and Small. She also appeared in various radio episodes of Dad's Army.Her film appearances included Stand Up, Virgin Soldiers (1977), Yanks (1979), The Ploughman's Lunch (1983), and four films for British director Pete Walker: Cool It Carol! (1970), Four Dimensions of Greta (1972), Tiffany Jones (1973), and Schizo (1976).Her stage appearances included the principal role of Parthy in a revival of the musical Show Boat at London's Adelphi Theatre in 1971.She died in Herne Bay, Kent, on 18 September 2009, aged 92 and is buried with her husband in the churchyard of St. Mary's, Stalisfield Green.", "link_mentions": [{"page": "October 28", "response": ["*1916 – Pearl Hackney, English actress (d. 2009)"]}, {"page": "British sitcom", "response": ["All Gas and Gaiters (1966–1971) brought the first light-hearted satirical look at the church and with its sequels paved the way for the Bless Me, Father (1978–1981) with Arthur Lowe, and the highly farcical ecclesiastical comedies such as Father Ted in the mid 1990s and The Vicar of Dibley in 2000. Starring Derek Nimmo with Robertson Hare, (Aldwych Farces), William Mervyn (The Railway Children, Upstairs Downstairs),  John Barron (The Fall and Rise of Reginald Perrin ),  Joan Sanderson (Fawlty Towers, Me and My Girl),  and Ernest Clark (Doctor in the House) , it was written by husband-and-wife team Pauline Devaney and Edwin Apps and directed by John Howard Davies and Stuart Allen. The successful series which after an initial controversy became a favourite of Britain's clergy, was followed by two spin-offs also starring Nimmo: Oh, Brother!  (1968-1970), 19 episodes written by David Climie and Austin Steele, with supporting roles by Shakespearian actor Sir Felix Aylmer, Patrick McAlinney (Bless Me, Father) and Derek Francis and its sequel   Oh, Father! (1973) with Felix Aylmer, Laurence Naismith, Pearl Hackney and David Kelly also written by Climie and Steele. Directed by Gareth Gwenlan (The Fall and Rise of Reginald Perrin, Butterflies, To the Manor Born, Only Fools and Horses and High Hopes. It was not a success and was axed after one series of 7 episodes.\"All Gas and Gaiters\", BBC Comedy website All Gas and Gaiters was produced by Stuart Allen, John Howard Davies, and Robin Nash. The music was provided by Stanley Myers."]}, {"page": "Show Boat", "response": ["The original London West End production of Show Boat opened May 3, 1928, at the Theatre Royal, Drury Lane and featured among the cast, Cedric Hardwicke as Capt. Andy, Edith Day as Magnolia, Paul Robeson as Joe, and Alberta Hunter as Queenie. Mabel Mercer, later famed as a cabaret singer, was in the chorus. Other West End presentations include a 1971 production at the Adelphi Theatre, which ran for 909 performances. Derek Royle was Cap'n Andy, Cleo Laine was Julie, and Pearl Hackney played Parthy Ann."]}, {"page": "Eric Barker", "response": ["He later became one of the most familiar faces in British comedy in his day. Barker gained his renewed start in show business during the Second World War, when he was part of the armed forces radio show Merry Go Round, which he helped to write. After the war the show continued, alternating between Army, Royal Air Force and Royal Navy shows. The Navy show was named Waterlogged Spa, with Barker and his wife, actress Pearl Hackney. His \"Steady Barker\" catchphrase and verbal stumbling over words beginning with the letter \"h\" became well known to audiences. The show's success led to Barker's starring in other radio shows, where he achieved a sizeable following due to his versatility at doing voices.", "Barker married the actress Pearl Hackney (28 October 1916 – 18 September 2009) with whom he often worked, though she also had a comedy career of her own. They had a daughter, Petronella Barker, in 1942, who also appeared in films and television between 1964 and 1983."]}, {"page": "List of Are You Being Served? characters", "response": ["=== Mrs. Grainger (Pearl Hackney) (series 2) ===", "Mrs. Grainger (Pearl Hackney) was Mr. Grainger's wife. She was mentioned by him, to miss Mrs. Dale's Diary, despite that it had gone off the air over ten years earlier, and to want a world-cruise, when it appeared that Mr. Grainger had won a lot of money. Mrs. Grainger's only appearance was when she came to the store in \"The Clock\", to celebrate Mr. Grainger's 65th birthday. She was frequently mentioned by Mr Grainger throughout the series.", "* Pearl Hackney (\"The Clock\", as Mrs. Grainger), died 2009"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Pearl Hackney"]}, {"page": "2009 in film", "response": ["| style=\"text-align:center;\"| 18 || Pearl Hackney || style=\"text-align:center;\"| 92 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actress || "]}, {"page": "List of former Coronation Street characters", "response": ["|Daisy Hibbert || Pearl Hackney || 1978, 1980"]}, {"page": "Dad's Army", "response": ["The majority of the TV scripts were adapted for BBC Radio 4 with the original cast, although other actors played Walker after James Beck's death (which took place soon after recording and before transmission of the first radio series). Harold Snoad and Michael Knowles were responsible for the adaptation, while wartime announcer John Snagge set the scene for each episode. Different actors were used for some of the minor parts: for example Mollie Sugden played the role of Mrs Fox, and Pearl Hackney played Mrs Pike. The first episode was based on the revised version of events seen in the opening of the film version, rather than on the TV pilot. The entire radio series has been released on CD.Dad’s Army.tv page about the radio series, URL accessed 4 June 2006 "]}, {"page": "Deaths in September 2009", "response": ["*Pearl Hackney, 92, British actress, widow of Eric Barker."]}, {"page": "Oh, Brother!", "response": ["Oh, Brother! was followed by a sequel Oh, Father! in 1973, also starring Nimmo and with the same writers. In this series, Dominic left the monastery and became a Roman Catholic priest.  It had a supporting cast of Laurence Naismith, Pearl Hackney and David Kelly.  This was not a success and only lasted a single series of seven episodes."]}, {"page": "Schizo (1976 film)", "response": ["*Pearl Hackney as Woman at seance"]}, {"page": "List of All Creatures Great and Small (1978–1990 TV series) characters", "response": ["*Crump, Mrs — Pearl Hackney", "*Hird, Mrs — Pearl Hackney", "*Pearl Hackney: Mrs Crump in \"Calf Love\" and Mrs Hird in \"Choose a Bright Morning\""]}, {"page": "Petronella Barker (actress, born 1942)", "response": ["The daughter of the comedy actor Eric Barker and the actress Pearl Hackney, she grew up in the village of Stalisfield, Kent, and was educated at Ashford School."]}, {"page": "Hackney (surname)", "response": ["* Pearl Hackney (1916–2009), British actress"]}, {"page": "Four Dimensions of Greta", "response": ["*Frau Gruber ...\tPearl Hackney"]}, {"page": "Something in the City (TV series)", "response": ["Something in the City is a 1959 British television sitcom. Aired on ITV, it was produced by Jack Hylton Productions for Associated-Rediffusion Television. Cast included Eric Barker, Joan Benham, Pearl Hackney, Diane Hart, Deryck Guyler and Peter Hammond. Five episodes were produced. Unlike most shows by Associated-Rediffusion, the series survives intact."]}, {"page": "Cool It Carol!", "response": ["* Pearl Hackney - Mother"]}, {"page": "Present Arms (Dad's Army radio episode)", "response": ["*Pearl Hackney as Mrs Pike"]}, {"page": "Funny Man (TV series)", "response": ["* Pearl Hackney as Gloria Leslie (5 episodes)"]}]}}