{"wiki_id": "http://www.wikidata.org/entity/Q20647672", "itemLabel": "David Mackintosh", "itemDescription": "British politician (born 1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Mackintosh", "wikipedia_page": {"main": "David James Mackintosh (born 2 April 1979) is a British Conservative Party politician. He was the Member of Parliament for Northampton South from the May 2015 general election to the 2017 general election. Prior to his election to Parliament, he worked as a political consultant in the European Parliament and the Conservatives before being elected to the County and Borough councils, rising to become Leader of Northampton Borough Council in 2011.", "link_mentions": [{"page": "David mackintosh", "response": ["#REDIRECT David Mackintosh"]}, {"page": "Northampton Sekhemka statue", "response": ["Northampton Borough Council claimed that they learned the full value of the Sekhemka statue in 2012 during an insurance assessment, and according to The Daily Telegraph it \"immediately began making plans to cash it in and use the money for other heritage projects in the region.\" The then leader of Northampton Borough Council, David Mackintosh, told the BBC that the statue had \"been in our ownership for over 100 years and it's never really been the centrepiece of our collection\", and that \"We want to expand our museum and to do that we need to raise the money\". The council proposed to use the amount realized through a sale for funding \"the restoration of Delapré Abbey, improvements to the museum service and/or other cultural or heritage projects\" but the Museum Association asked that proposed sale be halted pending consultation which \"was needed to establish the financially motivated disposal was 'last resort'\"", "The Save Sekhemka Action group described the sale as a \"day of shame for Northampton\", and said that selling the statue had been \"the decision of one man [council leader David Mackintosh], taken against all professional advice locally, nationally and internationally\" The sale was described by the Egyptian Embassy as a \"shameful and unethical act\". Scott Furlong, of Arts Council England, said: \"It is very disappointing that the local authority committed to the sale and entered into an agreement with an auction house before our discussions with them were concluded.\" Northampton council leader David Mackintosh said the council's share of the proceeds would be used to develop the existing museum. The writer Alan Moore also condemned the council's decision to sell the statue.", "On 1 August 2014, Northampton Museums had their accreditation removed by the Arts Council England, who ruled that the sale broke the required standards for museums managing their collections, rendering the museums ineligible for funding from a range of arts grants and funding bodies. The museums are excluded from future participation until at least August 2019. Scott Furlong of the Arts Council commented: \"It is always hugely regrettable when we have to exclude a museum from the Accreditation Scheme. However, it is equally important that we are robust in upholding the standards and principles which underpin the scheme and are shared by the vast majority of museums.\" The leader of Northampton borough council, David Mackintosh said the Arts Council decision was \"disappointing\" and \"puzzling\", and stated \"We are possibly one of the only local authorities in the country with plans for a multimillion pound investment in their museum service.\""]}, {"page": "David Mackintosh (politician)", "response": ["#REDIRECT David Mackintosh"]}, {"page": "Mackintosh, David", "response": ["#redirectDavid Mackintosh"]}]}}