{"wiki_id": "http://www.wikidata.org/entity/Q2061447", "itemLabel": "Paul Neagu", "itemDescription": "British-Romanian artist (1938-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Neagu", "wikipedia_page": {"main": "Paul Neagu was a Romanian artist living in England who worked in diverse media such as drawing, sculpture, performance art and watercolor. He died on 16 June 2004 in London.His influences included Cubism, Marcel Duchamp, Constantin Brâncuși and Joseph Beuys.\nHis works can be found in public collections including, among others, the British Museum, London, le Fond départemental d'art contemporain, Seine Saint-Denis, Bobigny, France, the Hugh Lane Municipal Gallery of Modern Art, Dublin, the Musee Cantonal de Beaux Arts, Lausanne, Switzerland, the National Museum of Art of Romania, Bucharest, the Philadelphia Art Museum, Philadelphia, USA, and the Tate Gallery, London.\nOne of his works, Going Tornado (1974), was used as an album cover for the Bruford album Gradually Going Tornado from 1980.\n\n\"For Paul Neagu, art is an expression of 'desire in the face of\nthe systems that attempt to inhibit it', as he writes, and desire\ninvolves 'the recovery' of what he calls, variously, the 'hyphen,' the\n'abstract', the 'gamma', all of which involve the 'bodily', conveyed\nparticularly through the 'figural essence of sculpting, paintings,\ndrawings'. Neagu's works, whatever their medium, are certainly full of\ndesire, as their visceral energy suggests.\" Donald Kuspit", "link_mentions": [{"page": "List of Romanians", "response": ["*Paul Neagu"]}, {"page": "List of Romanian artists", "response": ["* Paul Neagu"]}, {"page": "Hornsey College of Art", "response": ["* Paul Neagu, sculptor, performance artist"]}, {"page": "Gradually Going Tornado", "response": ["The title of the album was taken from the British-based Romanian artist Paul Neagu who did a performance under the name \"Gradually Going Tornado\" in London in 1974. Neagu created the album's cover art.", "* Paul Neagu – art direction, design"]}, {"page": "Richard Demarco", "response": ["For many years, the Demarco Gallery promoted cultural links with Eastern Europe, both in terms of presenting artists such as Paul Neagu from 1969, Marina Abramović from 1973 and Neue Slowenische Kunst from 1986 within Scotland, organising exhibitions of contemporary Polish, Romanian and Yugoslav art and in establishing outgoing connections for Scottish artists across Europe.", "In November 2008 a substantial selection from Demarco's archives, covering the period 1963–1980, was made available on-line by the University of Dundee [see below for direct link to online archive].  Images of Demarco's activities during this period, in particular collaborations with Joseph Beuys, Tadeusz Kantor, Paul Neagu and Marina Abramović are available in the selection from the Demarco archives.  Detailed documentation of the Edinburgh Arts journeys from 1972 to 1980 are also available in this selection."]}, {"page": "1938 in art", "response": ["* February 22 – Paul Neagu, Romanian-born artist (d. 2004)"]}, {"page": "Concrete Cows", "response": ["In a programme, The Sculpture 100, made for Sky Television in December 2005, the Concrete Cows were included in a list of the 100 most influential works of twentieth-century open-air sculpture in England.The Sculpture 100, England's public sculpture, 19052005, Sky Television Arts Channel, 2005 The list also includes another piece in Milton Keynes: Triple Starhead by Paul Neagu (in Furzton)."]}, {"page": "Charles de Gaulle Square", "response": ["In the centre of the square stands Paul Neagu's Crucea Mileniului (Millennium Cross), built in the 1990s. In September 2006, on the occasion of the Francophonie Summit held in Bucharest, a statue of Charles de Gaulle was unveiled. Sculpted by Mircea Spătaru, it is  high and was financed by the government."]}, {"page": "Anish Kapoor", "response": ["Kapoor attended The Doon School, an all-boys boarding school in Dehradun, India. In 1971 he moved to Israel with one of his two brothers, initially living on a kibbutz.Jackie Wullschlager (5 May 2012), Lunch with the FT: Anish Kapoor  Financial Times. He began to study electrical engineering, but had trouble with mathematics and quit after six months. In Israel, he decided to become an artist. In 1973, he left for Britain to attend Hornsey College of Art and Chelsea School of Art and Design. There he found a role model in Paul Neagu, an artist who provided a meaning to what he was doing.Louise Jury (14 October 2002), Anish Kapoor: 'The government doesn't understand the importance of culture'  The Independent. Kapoor went on to teach at Wolverhampton Polytechnic in 1979 and in 1982 was Artist in Residence at the Walker Art Gallery, Liverpool. He has lived and worked in London since the early 1970s."]}, {"page": "Romanians in the United Kingdom", "response": ["*Paul Neagu, artist"]}, {"page": "Julius Podlipny", "response": ["Podlipny contributed significantly to the artistic development of his students. According to Neumann, \"[h]e was [...] a person with formative knowledge, some of the best-received Romanian artists being indebted to his school.\" The latter category, Neumann indicates, was primarily illustrated by Ștefan Câlția. Podlipny was also the teacher of Roman Cotoșman, Paul Neagu, Dietrich Sayler, Traian Brădean Corneliu Antim, \"Adierea bucolică a culorilor\", in Ziarul Financiar, October 12, 2007 and Constantin Flondor. Iolanda Malamen, \" 'Lemnul lui Hristos' a fost un dar\", in Ziua, April 5, 2008"]}, {"page": "Bucharest National University of Arts", "response": ["*Paul Neagu"]}, {"page": "Marinko Sudac Collection", "response": ["|Paul Neagu"]}, {"page": "Michael Peckham", "response": ["Michael Peckham's paintings were first shown at Bangor University in 1962. This was followed by an exhibition with William Gear in 1964 at the Bear Lane Gallery, Oxford. During the 1980s and 1990s he exhibited his work at the Christopher Hull Gallery. His solo exhibition at the Millinery Works Gallery opened on 11 September 2001. He exhibited with Richard Demarco in Edinburgh and showed work in 2001 in the Traveling Exhibition “70 over 2000: the Road to Meikle Seggie”. He worked with Richard Demarco to develop an artistic event at the centre of the European Conference on Clinical Oncology (ECCO) at the South Bank in London in 1989. “Death, Life, Regeneration” included work by Helen Chadwick, Joseph Beuys and Paul Neagu.http://www.demarco-archive.ac.uk/richard_demarco_chronology.pdf The Cantata “Bavarian Gentians” commissioned for the occasion from Hugh Wood received its first performance conducted by Richard Hickox at this event."]}, {"page": "Cordelia Oliver", "response": ["Beginning in 1963, Oliver wrote for over 25 years as The Guardian's Scottish arts correspondent, reporting the \"optimism\" she saw in the country's theatre, opera, music, painting and sculpture. She was one of number of figures who were instrumental in establishing a body of critical writing on contemporary art in the 1960s and 1970s. Cordelia Oliver also wrote books and exhibition catalogue essays, including works on Joan Eardley, Jessie M King, and Bet Low. She was known as a particular supporter of women artists, including Margot Sandeman, Winifred Nicholson, Pat Douthwaite, and embroiderer Kathleen Mann. She also promoted the work of Romanian artist Paul Neagu, and was a \"great supporter\" of the Citizen's Theatre."]}, {"page": "Sculpture in Scotland", "response": ["The establishment of the National Gallery of Modern Art in Edinburgh in 1960 provided new possibilities for the display of sculpture. The grounds were initially dominated by two pieces by Henry Moore (1898–86), which were late joined by other major works, including those by Scottish artists. The 1970s saw the emergence of installation and environmental art.M. MacDonald, Scottish Art (London: Thames and Hudson, 2000), , p. 203. Members of the Boyle Family (Mark Boyle, 1934–2005, Jullia Hills, b. 1936, and their two children, Sebastian, b. 1962, and Georgia, b. 1963) have produced work that has included performances and earth sculptures. Their Journey to the Surface of the Earth project, begun in 1967, involved the re-creation of randomly chosen, sections of the earth's surface, designed to challenge ideas of representation and objectivity.A. Patrizio, Contemporary Sculpture in Scotland (Sydney: Craftsman House, 1999), , p. 22. The short-lived Ceramic Workshop in Edinburgh (1970–74) hosted installations by Merilyn Smith (b. 1942) and the Romanian artist Paul Neagu (1938–2004), but demonstrated both interest in the medium and the problems of funding it. It was boosted by the appointment of David Harding (b. 1937) to be the first head of the Department of Environmental Art at Glasgow School of Art in 1985.M. MacDonald, Scottish Art (London: Thames and Hudson, 2000), , p. 206."]}, {"page": "Neagu", "response": ["*Paul Neagu (1938–2004), British-Romanian artist"]}, {"page": "Romanian pavilion", "response": ["* 1995 — Brancusi's Heritage in Romania in the Romanian Pavilion (Giardini) and in the Romanian Institute for Culture and Research in Humanities (Palazzo Correr). Artists: George Apostu, Ștefan Bertalan, Mihai Buculei, Maria Cocea, Roman Cotoșman, Doru Covrig, Darie Dup, Ovidiu Maitec, Paul Neagu, Ion Nicodim, Neculai Păduraru, Constantin Popovici, Mircea Roman, Napoleon Tiron, Aurel Vlad, Marian Zidaru. Commissioners: Dan Hăulică and Coriolan Babeți."]}, {"page": "Victory Square, Timișoara", "response": ["At the end from the Cathedral, the Monument of the Crucifixion was erected in 1999. It is a stainless steel work by Romanian-English sculptor Paul Neagu dedicated to the victims of the 1989 Revolution."]}, {"page": "Neagu, Paul", "response": ["#redirectPaul Neagu"]}]}}