{"wiki_id": "http://www.wikidata.org/entity/Q20677145", "itemLabel": "Nick Jenkins", "itemDescription": "English businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Nick_Jenkins", "wikipedia_page": {"main": "Nicholas David Jenkins (born 13 May 1967) is an English businessman, known for founding the online greeting card retailer Moonpig.com, and being a \"dragon\" on the BBC Two business series Dragons' Den for the thirteenth and fourteenth series.", "link_mentions": [{"page": "Haberdashers' Adams", "response": ["* Nick Jenkins (born 1967) – chief executive of moonpig.com, former Glencore commodities trader."]}, {"page": "Cranfield University", "response": ["* Nick Jenkins – Founder of online greetings card retailer Moonpig, former \"dragon\" on the BBC Two business series Dragons' Den"]}, {"page": "Nick", "response": ["*Nick Jenkins (born 1967), English businessman"]}, {"page": "Dragons' Den", "response": ["| colspan=\"2\" | Nick Jenkins"]}, {"page": "Cranfield School of Management", "response": ["* Nick Jenkins – Founder of online greetings card retailer Moonpig, former \"dragon\" on the BBC Two business series Dragons' Den."]}, {"page": "Stockton, Wiltshire", "response": ["In 2014, Stockton House was bought by Nick Jenkins, founder of the Moonpig greetings card company, who carried out renovations.", "*Nick Jenkins, businessman, owner of Stockton House since 2014"]}, {"page": "Dragons' Den (British TV programme)", "response": ["| Nick Jenkins", "*Steve Parish was originally going to replace Nick Jenkins, but found he did not have the time and stepped down. He was instead replaced by Tej Lalvani.", "| Nick Jenkins", "| Deborah Meaden and Nick Jenkins", "| Nick Jenkins and Sarah Willingham", "| Nick Jenkins", "| Nick Jenkins", "| Nick Jenkins", "| Nick Jenkins", "| Nick Jenkins", "| Nick Jenkins and Sarah Willingham", "| Nick Jenkins and Sarah Willingham", "| Nick Jenkins", "| Nick Jenkins", "| Peter Jones and Nick Jenkins", "| style=\"font-size: 100%;\" style=\"text-align:center;\"| Deal Failed M14 Industries’ investment did not complete. Peter Jones stated that after filming the offer of investment had caused conflict with the company’s current investors which led John Kershaw to re-negotiate, to which he and Nick Jenkins declined. The company remains active and later purchased dating app ‘Double,’ who had appeared in series 13.", "| Peter Jones and Nick Jenkins Aerodrums declined the offer of investment deeming the equity requested by the dragons to be too high. The company remains active.", "| Touker Suleyman, Peter Jones and Nick Jenkins TickX declined the offer of investment deeming the equity requested by the dragons to be too high. The company remains active.", "| Peter Jones and Nick Jenkins AppyParking declined the offer of investment deeming the equity requested by the dragons to be too high. The company remains active.", "Linney announced that he would be departing the show at the end of series twelve, in order to focus on various other projects and dedicate more time to his family. He was replaced by Nick Jenkins from series 13 onwards.", "===Nick Jenkins==="]}, {"page": "Moonpig", "response": ["According to founder Nick Jenkins, \"Moonpig\" was his nickname at school in Newport, Shropshire, hence the name of the brand."]}, {"page": "2015 in British television", "response": ["|BBC Two confirms that entrepreneurs Nick Jenkins, Sarah Willingham and Touker Suleyman will join Dragons' Den for series 13."]}, {"page": "AppyParking", "response": ["In September 2016, founder Dan Hubert appeared on BBC business show Dragon's Den seeking investment to expand the service, valuing the company at £10m ($m) based on a 2% equity offered for a sum of £200,000 ($).Dragons’ Den: Series 14, Episode 7 – Startups.co.uk: Starting a business advice and business ideas He was unsuccessful after declining two offers from Peter Jones and Nick Jenkins, who instead valued the company at £1m ($m)."]}, {"page": "Boomf", "response": ["In 2014, Boomf raised over $1m and is backed by a number of angel investors, including Nick Jenkins, founder of Moonpig, Duncan Jennings and Matt Wheeler."]}, {"page": "Touker Suleyman", "response": ["In 2015, Suleyman was chosen to join the investors' panel on the thirteenth series of BBC television programme Dragons' Den, alongside Nick Jenkins and Sarah Willingham. Suleyman is the only dragon out of the three to have remained on the show since."]}, {"page": "2017 in British television", "response": ["|It is announced that Nick Jenkins and Sarah Willingham will leave Dragons' Den when the current series ends on 26 February.", "|Crystal Palace chairman Steve Parish and former banker Jenny Campbell will join the next series of Dragons' Den, replacing Nick Jenkins and Sarah Willingham."]}, {"page": "Winglights", "response": ["In January 2017, the product was pitched on Dragons' Den, securing an investment from Nick Jenkins."]}, {"page": "Tej Lalvani", "response": ["Lalvani succeeded Nick Jenkins as the next \"dragon\" on Dragons' Den after the departure of Steve Parish who left before filming due to other business commitments. "]}, {"page": "The Snaffling Pig Co", "response": ["The company appeared on the 14th season of BBC Two's Dragons’ Den in 2016 where they gained a £70,000 investment from Nick Jenkins.", "In 2016, the company went on to appear on series 14 of Dragons’ Den, where they gained a £70,000 investment from ‘dragon’ Nick Jenkins."]}]}}