{"wiki_id": "http://www.wikidata.org/entity/Q2061361", "itemLabel": "Paul Morgan", "itemDescription": "British automotive engineer (1948-2001)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Morgan_(engineer)", "wikipedia_page": {"main": "Paul Jonathan Morgan (29 July 1948 – 12 May 2001) was a British engineer who co-founded Ilmor Engineering with Mario Illien in 1983. Ilmor had major successes providing engines for motorsport and won three Queen's Awards for Export Achievement. He was killed in a plane crash at Sywell, Northamptonshire on 12 May 2001.\nMorgan was an engineer at Cosworth from 1970 to 1983. In 1983 he left Cosworth to form Ilmor with fellow engineer Mario Illien. Ilmor was set up with backing from Roger Penske and achieved its first race win powering Mario Andretti's Lola at the Long Beach Grand Prix. In 1989 Morgan and Illien decided to enter Formula One. \nPaul Morgan was killed instantly when his Hawker Sea Fury overturned on landing. David Coulthard won the Austrian Grand Prix the day after Morgan's death in a Mercedes-Ilmor powered McLaren. Coulthard opted not to participate in the traditional champagne celebration as a mark of respect.\nMorgan's widow reduced her shareholding of Ilmor in 2002, selling 10% to DaimlerChrysler. In 2005 DaimlerChrysler acquired all the remaining shares from Mrs. Morgan, Mario Illien and Roger Penske.", "link_mentions": [{"page": "List of companies named after people", "response": ["* Ilmor – Mario Illien and Paul Morgan"]}, {"page": "2001 Austrian Grand Prix", "response": ["Out of respect for Paul Morgan, the managing director of Ilmor Engineering, who was killed in a plane crash at the Sywell Aerodrome in Northampton the day before the race, Coulthard refrained from spraying champagne on the podium. In the subsequent press conference, Coulthard spoke of the importance of driving with a heavy fuel tank, \"I was able to lean the engine out early on after the first few laps and save quite a few laps of fuel as well as obviously with the safety car and that enabled us to go quite long.\" Michael Schumacher said he executed a manual start after a launch control system fault and that his strategy after the collision with Montoya was to wait until the pit stops, adding, \"I didn't have much to lose. I could have stayed behind and wait all race until the pit stops. But then I wouldn't have had a chance to have a go to get back up to the lead, which at some stage I thought I could.\" Barrichello stated he began on used front tyres and unused rear compounds and believed he would have won had Coulthard not remained on track for another three laps, \"It was one of those races where I had a good feeling, I had a good car, I was really driving as fast as I could behind him, but there was very little to take away and unfortunately I couldn't go to win again.\""]}, {"page": "Ilmor", "response": ["Ilmor is a British independent high-performance motor racing engineering company. It was founded by Mario Illien and Paul Morgan in November 1983. With manufacturing based in Brixworth, Northamptonshire, and maintenance offices in Plymouth, Michigan, the company supplies engines and consultancy to the IndyCar Series and MotoGP.", "After originally developing IndyCar engines, the company built a partnership with Mercedes-Benz to power F1 cars for both the Sauber and McLaren teams. After the death of Paul Morgan in a vintage aeroplane crash in 2001, Mercedes increased its stake until it owned the entire company, and renamed it Mercedes-Benz High Performance Engines Ltd. In 2005, Mario Illien concluded a deal to purchase the Special Projects part of the company in partnership with Roger Penske, which worked in partnership with Honda Performance Development for IndyCar engines between 2003 and 2011. This new company, which is independent of Mercedes, is once again known as Ilmor Engineering Ltd. They developed the Ilmor X3 for the 2007 MotoGP World Motorcycle Championship, entering one race before withdrawing and effectively shutting down the race team, due to funding problems.", "In 2001 Paul Morgan was killed while landing one of his vintage airplanes, a Hawker Sea Fury at Sywell Aerodrome, Northamptonshire. In 2002 DaimlerChrysler increased its share to 55% and renamed the company Mercedes-Ilmor. In 2005 DaimlerChrysler became the sole owner of Ilmor and renamed the company Mercedes-Benz High Performance Engines Ltd."]}, {"page": "Mercedes AMG High Performance Powertrains", "response": ["Ilmor was founded by Mario Illien and Paul Morgan in 1983, as an independent British Formula One engine manufacturer. The company name was taken from the surnames of the founders. It originally started building engines for IndyCars with the money of IndyCar team owner and chassis manufacturer Roger Penske.", "In 2001, Paul Morgan was killed whilst landing his vintage aeroplane at Sywell Aerodrome, Northamptonshire. This led to Mercedes-Benz increasing their financial involvement in Ilmor, with the company being renamed Mercedes-Ilmor Ltd."]}, {"page": "Mario Illien", "response": ["During his time at Mowag, Illien maintained his interest in motorsport. In 1979, at the age of 30, he gave up his job and moved to the UK to work in the design department of Cosworth Engineering in Northampton. He spent five years at Cosworth, contributing to the design and development of the company's racing engines, including the DFY V8. It was at Cosworth that Illien met Paul Morgan and the next stage of his career began."]}, {"page": "Paul Morgan", "response": ["Paul Morgan may refer to:", "* Paul Morgan (architect), Australian architect", "* Paul Morgan (engineer) (1948–2001), British engineer", "* Paul Morgan (footballer) (born 1978), Northern Irish association footballer", "* Paul Morgan (journalist), British sports journalist", "* Paul Morgan (rugby league) (died 2001), Australian rugby league footballer and administrator", "* Paul Morgan (rugby) (1974-2015), rugby union and rugby league footballer of the 1990s and 2000s", "* Paul Morgan (priest) (born 1964), superior of the British district of the Society of St Pius X", "* Paul Morgan (actor) (1886–1938), Austrian actor and Kabarett performer", "* Paul Morgan (judge) (born 1952), judge of the High Court of England and Wales"]}]}}