{"wiki_id": "http://www.wikidata.org/entity/Q20676287", "itemLabel": "Jamie Conlan", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jamie_Conlan", "wikipedia_page": {"main": "Jamie Conlan (born 10 October 1986) is a former professional boxer from Northern Ireland who competed from 2009 to 2017, and has since worked as a boxing manager. He held the Commonwealth super-flyweight title in 2016 and challenged for the IBF super-flyweight title in 2017. He is the older brother of professional boxer Michael Conlan.", "link_mentions": [{"page": "List of Commonwealth Boxing Council champions", "response": ["|align=left |  Jamie Conlan"]}, {"page": "Naoya Inoue", "response": ["Inoue stated that he would move to bantamweight in the future but he would seek to unify titles against another junior bantamweight titleholder in December 2017.http://www.asianboxing.info/asian-news/naoya-inoue-seeks-unification-before-the-end-of-2017 Inoue's team later claimed that they were having trouble securing an opponent for the New Year's Eve date. They'd reportedly agreed to terms with IBF champion Jerwin Ancajas, but he would later announce he was fighting Jamie Conlan in November. Ancajas' manager had previously said that negotiations with Inoue had not taken place.http://www.boxingscene.com/naoya-inoue-having-tough-time-securing-his-next-opponent--121002 On November 16, it was announced that Inoue would face Yan Boyeaux on 30 December, in a show televised by Fuji TV.http://www.asianboxing.info/asian-news/naoya-inoue-and-ken-shiro-to-defend-world-titles-on-december-30th Inoue said he planned to box in the United States again within 2 months after fighting Boyeaux.https://www.badlefthook.com/2017/11/16/16667492/naoya-inoue-yoan-boyeaux-set-for-dec-30 Inoue dropped Boyeaux four times before referee Raul Caiz Jr. eventually stepped in at 1 minute and 40 seconds of round 3, giving Inoue the win, successfully retaining the WBO title for the seventh time. Inoue stated that he had plans to move up to bantamweight, where he would seek to become a three-weight world champion."]}, {"page": "Anthony Nelson (boxer)", "response": ["|align=left| Jamie Conlan"]}, {"page": "Jerwin Ancajas", "response": ["Ancajas made his first defense on January 29, 2017, beating José Alfredo Rodríguez by technical knockout, after Rodríguez was unable to continue due to injury.Jerwin Ancajas stops Jose Alfredo Rodriguez » Boxing News Ancajas made a further defense in July 2017, on the undercard of Manny Pacquiao-Jeff Horn against Teiru Kinoshita. Ancajas battered Kinoshita, opening a cut over his right eye and pummeling him to the body, before dropping him in round 7 with a right hook to the body. Kinoshita beat the count but the referee stopped the fight, giving Ancajas a TKO win.Jerwin Ancajas bloodies, stops Teiru Kinoshita, retains junior bantamweight title On November 18, 2017, Ancajas defeated Jamie Conlan with a round 6 TKO. Conlan was battered from the first round, going down after a body shot. He was dropped three more times until the referee stopped the fight. Ancajas was deducted a point in round 5 by referee Steve Gray, following a legitimate shot to Conlan's abdomen. With the win, Ancajas made his third successful title defense in 2017, all by technical knockout and in different countries.Boxing: Jerwin Ancajas devastates Irish challenger to retain world title | ABS-CBN News", "|align=left| Jamie Conlan"]}, {"page": "Yader Cardoza", "response": ["|style=\"text-align:left;\"|Jamie Conlan"]}]}}