{"wiki_id": "http://www.wikidata.org/entity/Q20685460", "itemLabel": "Calum Scott", "itemDescription": "English singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Calum_Scott", "wikipedia_page": {"main": "Calum Scott (born 12 October 1988) is a British singer and songwriter.\nIn April 2015, he became known worldwide after competing on the ITV talent contest Britain's Got Talent, where he performed his version of Robyn's hit \"Dancing on My Own\". After coming sixth in the contest, he released his version as a single the following year, which peaked at number two on the UK Singles Chart and became Britain's best-selling single of summer 2016.\nScott later signed with Capitol and in 2017, released the single \"You Are the Reason\", which was included on his 2018 debut album Only Human, which reached number 4 on the UK Albums Chart. Later in 2018, he collaborated with Leona Lewis to release a duet version of the single \"You Are the Reason\".", "link_mentions": [{"page": "October 12", "response": ["*  1988   – Calum Scott, British singer"]}, {"page": "1988 in music", "response": ["*October 12 – Calum Scott, British singer-songwriter"]}, {"page": "V Festival", "response": ["* Calum Scott"]}, {"page": "Flamingo Land Resort", "response": ["In 2014 a new area in the park called The Riverside One was built. The River Side One area consists of an undercover outdoor stage which has the capacity to hold over 2000 people and consists of an outside cocktail bar called the R-Bar, a pizza shop, gourmet grill, American Diner and amusements. Flamingo Land Resort announced it was to host a brand new event called Party In The Park which was to take place monthly during the high season on the outdoor stage. The shows have become very popular over the recent years, with thousands of visitors and holiday guests enjoying a 3-hour live concert featuring live acts, bands, acrobats, dancers and celebrity guests on stage. Over the recent years it has seen the likes of Tinchy Stryder, Scouting for Girls, Heather Small, Union J, Venga Boys, Calum Scott, Sam Bailey, Peter Andre and many more headline the show.https://www.flamingoland.co.uk/news/643-union-j-to-headline-saturday%E2%80%99s-party-in-the-park.html  When the shows first started they were originally fronted and presented by local entertainer and presenter Ryan Swain and his puppet Frank Lamingo. After 3 consecutive years of fronting the events Ryan passed over the microphone to Dan Metcalf who currently presents the events. The stage used to host daily farewell show which features acrobats called The Bongo Warriors, live music and dance and special guests and Flamingo Land Resort mascots Mia & Mylo Meerkat, this has now been branded the sailaway show and relocated to the pirate ship stage in plaza square . In 2018 for the first time it held first auditions for Britain's Got Talent."]}, {"page": "Around the World (1956 song)", "response": ["*Calum Scott for the soundtrack of the Hulu miniseries, ‘’Four Weddings and a Funeral’’. (2019)"]}, {"page": "Ivete Sangalo", "response": ["The cultural program of the 2016 Summer Paralympics closing ceremony was structured as a concert, being headlined by Ivete Sangalo and Gaby Amarantos, joined by Vanessa da Mata, Céu, Saulo Fernandes, Saulo Laucas, Sepultura guitarist Andreas Kisser, Armandinho, Jonathan Bastos, the groups Nação Zumbi and , and the funk singer Nego do Borel joined by special guest Calum Scott who called her of \"Brazilian Beyoncé\" - a way to explain to the UK public the grandeur of Bahia in Brazil. \"I can barely explain how much I am honored to be on that stage, helping to end one of the greatest and most inspiring events, along with the Brazilian Beyoncé. It was amazing\", said the singer to the British newspaper \"Hull Daily Mail\". Ivete not only caught the attention of the British singer - the international press also highlighted the Bahian performance. The CNN site called the singer \"megastar\". But The Guardian newspaper Ivete defined as 'the most influential woman of Brazil'. An information that drew the attention of the international press was the representative of Ivete, which has no less than 12 million followers on Instagram, for example."]}, {"page": "Hersheypark Stadium", "response": ["| EchosmithCalum Scott"]}, {"page": "Marc Dupré", "response": ["In 2018, Dupré recorded and released a cover of Calum Scott's \"You Are the Reason\" as a duet with his daughter Stella.\"Marc Dupré chante avec sa fille Stella et c'est magnifique\". Showbizz.net, April 22, 2018."]}, {"page": "Hessle High School", "response": ["* Calum Scott, singer"]}, {"page": "1988 in the United Kingdom", "response": ["* 12 October – Calum Scott, British singer-songwriter "]}, {"page": "Not Dark Yet", "response": ["* Calum Scott for his 2018 album Only Human  "]}, {"page": "Leona Lewis", "response": ["In 2014, she made her film debut in Walking on Sunshine, and her fourth studio album, I Am, was released the following year. In 2016, Lewis made her Broadway debut as Grizabella in the revival of Andrew Lloyd Webber's musical Cats, and the following year, she signed a modelling contract with Wilhelmina Models. She then collaborated with Calum Scott on the single \"You Are The Reason\" (2018), and had a recurring role on the American television series The Oath (2019). In 2021, Lewis joined the Paramount Plus show Queen of The Universe as a judge.", "Lewis split from Island Records in June 2016 because of \"something that didn't click\".  In December, she reimagined Hans Zimmer's \"Now We Are Free\" on the album Hans Zimmer: The Classics. The following December, she paid tribute to Lionel Richie with a performance at the 40th Annual Kennedy Center Honors. In 2018, Lewis collaborated with Calum Scott on a new version of his song \"You Are the Reason\" recorded as a duet, with Pitbull on \"Amore\", the lead single for the 2018 film Gotti, and with Hellberg on the song \"Headlights\". \"You Are the Reason\" peaked at number 43 in the UK and charted across the world, and was later certified gold by the BPI and platinum by the RIAA. In 2018, Lewis performed at the National Memorial Day Concert in Washington D.C., and at the 92nd Annual Macy's Thanksgiving Day Parade in New York. She appeared as a musical guest in an episode of NBC's 2019 television show Songland, searching for upcoming songwriters. Lewis recorded the winning song, \"Solo Quiero (Somebody to Love)\", which was written during the show. In November 2019, she performed at the Royal British Legion Festival of Remembrance, at Royal Albert Hall, London, honouring servicemen and veterans.", "In March 2020, Lewis hosted and performed at the youth empowerment event WE Day, at Wembley. The event celebrates students, recognising their impacts on local and global issues. Lewis performed her duet You Are The Reason with singer Calum Scott. Whilst introducing the show and herself, Lewis stated \"I'm someone who knows how far a voice can take you. I won a little show called X Factor 14 years ago. And that never would have happened if I had not learnt to use my voice.\" In May 2020, during the COVID-19 pandemic, Lewis joined several performers during the One Humanity Live broadcast on social media, helping to raise funds for COVID-19 initiatives, performing a cover of \"True Colors\". Lewis continued her charitable work throughout 2020, releasing a cover of Robbie Williams' \"Angels\" in honour of the NHS. In December 2020, Lewis headlined the NSPCC's virtual Christmas concert raising money for Childline and backed Save The Children's campaign to prevent child hunger at Christmas. Furthermore, Lewis sang alongside Smokey Robinson, Tori Kelly and Sam Fischer on a cover of \"What The World Needs Now\", with all proceeds going to the American Red Cross. Lewis also continued to raise money, via Cameo, for Hopefield Animal Sanctuary and RED on World Aids Day, with 100% of the proceeds going to charity."]}, {"page": "List of Capitol Records artists", "response": ["* Calum Scott (UK)"]}, {"page": "We Don't Have to Take Our Clothes Off", "response": ["*Calum Scott, a competitor in Britain's Got Talent performed the song in the 2017 semi-finals of the show.Snapshot24: Golden Buzzer Singer Calum Scott Stunned the Crowd with Amazing Rendition of “We Don't Have to Take Our Clothes Off”"]}, {"page": "Tiësto discography", "response": ["| Calum Scott"]}, {"page": "Nate Albert", "response": ["In 2016, Albert joined Capitol Records as Executive Vice President of A&R.  While there he signed Maggie Rogers whose album Heard It in a Past Life  debuted at Number 1 on the Billboard Album Chart.  Additionally, he worked on projects with artists Cold War Kids, Troye Sivan and Calum Scott."]}, {"page": "List of gay, lesbian or bisexual people: Sa–Sc", "response": ["| Calum Scott"]}, {"page": "Leona Lewis discography", "response": ["On 4 July 2013 Leona confirmed her fourth album would be a Christmas one, citing Motown as the album's musical direction and confirmed there would be a bit of \"original material\". Lewis announced that Christmas, with Love would be released on 2 December 2013 in the UK and the next day in the North America, preceded by the lead single, \"One More Sleep\". The song reached number three on the UK Singles Chart, giving Lewis the most Top 5 hits of any British female solo artist. In 2015, Lewis released the studio album \"I Am\", which charted on the top 40 in several countries, including in the UK and US. In 2018, Lewis sang alongside Calum Scott on the duet version of \"You Are The Reason\", to international success. In 2019, Lewis released \"Solo Quiero (Somebody to Love)\", from Songland. In 2021, Lewis released the single \"Kiss Me It's Christmas\" featuring Ne-Yo, taken from the digital and vinyl re-issue of Lewis' 2013 album Christmas, with Love, entitled \"Christmas, with Love Always\"."]}]}}