{"wiki_id": "http://www.wikidata.org/entity/Q2068511", "itemLabel": "Simon Gilbert", "itemDescription": "British drummer", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Gilbert_(musician)", "wikipedia_page": {"main": "Simon Gilbert (born 23 May 1965) is an English drummer and member of the English band Suede, one of the 'Big Four' Britpop bands of the 1990s, along with Oasis, Blur and Pulp.", "link_mentions": [{"page": "Suede (band)", "response": ["Suede (known in the United States as The London Suede) are an English rock band formed in London in 1989. The band is composed of singer Brett Anderson, guitarist Richard Oakes, bass player Mat Osman, drummer Simon Gilbert and keyboardist/rhythm guitarist Neil Codling.", "Suede's first breakthrough came with their second demo Specially Suede which they sent to compete in Demo Clash, a radio show on Greater London Radio run by the DJ Gary Crowley. \"Wonderful Sometimes\" won Demo Clash for five Sundays in a row during 1990, leading to a recording contract with the Brighton-based indie label RML. The song appeared on a cassette compilation in April 1990 representing Suede's first official release.Barnett, p. 37 After a series of gigs with an unreliable drum machine, Suede decided to recruit a full-time drummer. Justin Welch briefly fulfilled the role, though he only lasted six weeks before joining the Crawley band Spitfire.Harris, p. 36 He did, though, stay long enough to record two songs with the band, which were set to be released as the \"Be My God\"/\"Art\" single on RML Records. The band was dissatisfied with the result, and most of the 500 copies pressed were destroyed.Harris, p. 36-37 Suede placed another advert seeking a replacement. To the band's surprise, it was answered by the Smiths’ former drummer, Mike Joyce. He ultimately turned down the job as he felt Suede still had to forge their own identity. He felt that by being in a band that had similarities to the Smiths, he would have done them more harm than good.Barnett, p. 45 In June 1990, Suede found a permanent drummer, Simon Gilbert, through Ricky Gervais, who would later become a household name for co-writing and starring in the TV series The Office. Both worked at the University of London Union (ULU). After hearing the demo and realising the band did not have a drummer, Gilbert asked to audition.Barnett, p. 50-51", "*Simon Gilbert – drums (1991–2003, 2010–present)", " bar:Simon text:\"Simon Gilbert\""]}, {"page": "Brett Anderson", "response": ["In his teens, Anderson played guitar for garage bands such as The Pigs and Geoff, the latter featuring future Suede bassist Mat Osman. In the late 1980s, while a student at the Bartlett School of Architecture, University College, London, Anderson and Osman formed Suede with Anderson's girlfriend, Justine Frischmann, soon recruiting guitarist Bernard Butler through an advertisement in the NME. After they had received temporary percussional help from former Smiths drummer Mike Joyce, in 1991 Simon Gilbert joined as their official drummer. It was around this time that Frischmann left Anderson for Blur frontman Damon Albarn, which created an early rift in the burgeoning Britpop scene of the early 1990s. After missing too many rehearsals and flaunting her relationship with Albarn while still living with Anderson, Frischmann was fired from the group, going on to front Elastica."]}, {"page": "Suede (album)", "response": ["The record was produced by Ed Buller who the band had met through Nude Records' owner Saul Galpern. Both had worked together at Island Records. The band chose to work with Buller not based on his CV but more on a collective liking of him based on a shared interest of music they liked growing up. The band felt that this mutual interest would help shape their musical direction. Lead singer Brett Anderson said: \"It wasn't so much us attaching ourselves to his CV, it was more kind of like where we were going to go with [the band].\" In terms of writing for the album, Anderson said they had a structural way of doing it. Guitarist Bernard Butler would write guitar parts and melodies mostly on his own. He would then play these in the rehearsal room with bassist Mat Osman and drummer Simon Gilbert playing along. Anderson would then create vocal lines, which he would work on at home changing them to lyrics. These early recordings were done on a cassette recorder rather than a 4-track recorder. 4-track recorders would later be used during recording sessions for the album. During the early recordings, Butler said he was never fully aware of what lyrics Anderson was actually singing in rehearsals or at gigs until much later on. He was more focused on the melodies he was writing himself, saying: \"I just always had the feeling that, if he's happy, I'm happy... if it's working, it's working and just go with it.\"", "*Simon Gilbert – drums"]}, {"page": "Coming Up (album)", "response": ["As opposed to the previous album which followed a stringent pattern of Butler composing music for Anderson's lyrics, Coming Up was a more collaborative project. Anderson stated: \"Coming Up was more of a meritocracy – if something was good enough, it didn't matter what the source was.\" Songs such as \"By the Sea\" and \"She\" required the use of keyboards. Faced with the problem as to how to play them live, Suede recruited Simon Gilbert's cousin Neil Codling, who made his debut at a fan-club gig in January 1996. Buller has stated that the reason why the album has a much better sound than the previous albums is that he had minimal involvement in the mixing process, mixing only two songs. Buller credits much of the album's success to Dave Bascombe, who mixed the majority of the songs. According to Buller, having an outside observer mix the record with \"fresh ears\" enhances the overall production quality. Bascombe's input on \"Trash\" was crucial, as it was his idea to speed up the vocals. One of Suede's popular B-sides \"Young Men\" was left off the album, as Buller felt it was \"too dark\" and not as \"poppy [and] in your face\" as other songs on the record.", "*Simon Gilbert – drums"]}, {"page": "Dog Man Star", "response": ["In early 1994, when Suede were about to release the standalone single \"Stay Together\", the morale within the group was at an all-time low. Butler's father had died just as the band were about to begin their second American tour. The first week of the tour was cancelled, and Suede flew back to London from New York. When the tour did resume, Butler—not only recently bereaved but now engaged to his fiancée Elisa—distanced himself from the rest of the band far more than before. According to Butler, \"they got really resentful of the fact that they were on tour with someone who didn't want to party\". He even travelled separately, either alone, by taxi, or on the tour bus of support act the Cranberries. Then, in Atlanta, Suede suffered the ignominy of having to open for the Cranberries, who had become a bigger draw, thanks to their recent hit \"Linger\". The band agreed to let the Cranberries go on last in three places, given that they were picking up airplay; Anderson said the \"whole rivalry thing was blown out of all proportion.\" By the time of their arrival in New York, Suede had had enough, and the last few dates were cancelled. According to drummer Simon Gilbert, Butler was becoming intolerable and impossible to work with, and the band could not function together any longer. To record Suede's next album Anderson moved to Highgate, north London, and began to write lyrics while living in a secluded flat; a time which is detailed in the band biography Love and Poison.", "In June 2011, Suede released remastered and expanded editions of their previous five studio albums. Released in chronological order each week. The expanded version includes the original 12 tracks remastered. Additional bonus material includes demos, all b-sides from the singles \"Stay Together\", \"We Are the Pigs\" and \"The Wild Ones\". Missing are the b-sides to \"New Generation\", which featured replacement guitarist Richard Oakes. Also included are six extra tracks; notable songs include the original unedited versions of \"The Wild Ones\" and \"The Asphalt World\", and \"La Puissance\", a version of \"The Power\" sung in French. The DVD features song-films which were specially created for the Dog Man Star tour and previously-unseen footage of the band playing at the Casino de Paris and at the Fnac, Les Halles in Paris on 27 November 1993. The bonus DVD material features a 2011 interview with Anderson and Butler including contemporary film inserts from Simon Gilbert. The booklet contains all the lyrics, hand-written lyric drafts and previously unpublished photos of the band. There is also a specially-written note by Anderson; in it he says: \"If I could choose to be remembered for just one musical document it would be this.\" The reissue is notable for having no content featuring Oakes. It was revealed by Suede's biographer David Barnett that Butler made an \"11th hour\" request that all traces of Oakes - B-sides, live footage and promotional videos for the singles be erased from the reissue. The reissue charted at no. 63 in the UK Albums Chart.", "*Simon Gilbert – drums"]}, {"page": "A New Morning", "response": ["In February 2001 the band took up residency at Rockfield Studios in Monmouth, Wales for a three-week trial run with Hoffer. The band were unimpressed with the trial run, especially Simon Gilbert and Richard Oakes, who both had strong opinions on the results. Nevertheless, the band decided to record the album with Hoffer and descended on Parkgate Studios, Hastings, in May with their new member Alex Lee, following Codling's departure. Although the group recorded ten songs with Hoffer that Anderson said were the \"best we've written,\" most of the material recorded with him producing was scrapped. In September the group recorded two songs with ex The Stone Roses producer John Leckie. The versions of \"Beautiful Loser\" and \"Positivity\" were promising; however, Leckie had other commitments, forcing Suede to reconsider their options.", "* Simon Gilbert – drums "]}, {"page": "Head Music", "response": ["For guitarist Richard Oakes, the rehearsals for Head Music were unpleasant. Faced with Anderson's hedonistic lifestyle, Oakes began to drink more to make rehearsing more endurable. As he recalls: \"I remember for quite a few of them, having to make sure that I was semi drunk just in order to turn up.\" Oakes also found his contributions being regularly knocked back in favour of Anderson and Codling's electronic experiments. Anderson felt that his spiralling drug use and Codling's illness made Oakes become more isolated from the group; and that the only people who were still getting on well were Osman and drummer Simon Gilbert. At one point relationships became so strained that Anderson demanded future member Alex Lee to be summoned to the studio presumably because no one else was willing to turn up.", "*Simon Gilbert – drums"]}, {"page": "Sci-Fi Lullabies", "response": ["* Simon Gilbert – drums"]}, {"page": "Stay Together (Suede song)", "response": ["According to an entry in Simon Gilbert's diary in the biography Love and Poison, Butler objected to the lyrics in \"Stay Together\". The entry read: \"Lyrics not to be printed on cover of single in case his mother reads it. '16 tears', obviously paedophilic!.\" The lyrics for \"The Living Dead\" were also criticised by Butler. At the time he said: \"I've written this really beautiful piece of music and it's a squalid song about junkies.\""]}, {"page": "Richard Oakes (guitarist)", "response": ["The first gig Oakes attended was one of Suede's at the Poole Arts Centre in May 1993. Upon hearing that guitarist Bernard Butler had left the band and that the band were auditioning for a replacement, he recorded versions of Suede songs and some of his own material on a 4 track recorder, which he sent to the band's fanclub along with a note that read \"Take me or leave me.\" When drummer Simon Gilbert heard Anderson playing back the tape whilst going through audition tapes, he mistakenly believed it to be an early Suede demo. After the second audition Oakes was invited to join the band."]}, {"page": "Lazy (Suede song)", "response": ["# \"Feel\" (Anderson, Neil Codling, Simon Gilbert, Oakes, Mat Osman)"]}, {"page": "Electricity (Suede song)", "response": ["# \"Implement Yeah!\" (Anderson, Codling, Simon Gilbert, Oakes, Mat Osman)"]}, {"page": "Everything Will Flow", "response": ["# \"Crackhead\" (Anderson, Codling, Simon Gilbert, Oakes, Mat Osman)"]}, {"page": "Can't Get Enough (Suede song)", "response": ["The UK video for the song was directed by John Hillcoat, and features a couple, played by Max Beesley and Laura Fraser, trashing their apartment. An additional Australian-only version of the video was produced and directed by drummer Simon Gilbert, and is a composite of on tour B-roll footage and a live performance."]}, {"page": "Positivity (Suede song)", "response": ["# \"Positivity\" (Brett Anderson, Richard Oakes, Simon Gilbert, Mat Osman, Neil Codling)"]}, {"page": "Neil Codling", "response": ["He and the drummer of Suede, Simon Gilbert, are cousins.Barnett, D. \"Trash, You & Me: The Story Of Suede's Coming Up\". The Quietus. 23 March 2010"]}, {"page": "Simon gilbert (drummer)", "response": ["#REDIRECT Simon Gilbert (musician)"]}, {"page": "Simon Gilbert (drummer)", "response": ["#REDIRECT Simon Gilbert (musician)"]}, {"page": "Stratford-upon-Avon School", "response": ["* Simon Gilbert, drummer with the band Suede"]}, {"page": "Suede discography", "response": ["The discography of the English alternative rock band Suede consists of eight studio albums, four compilation albums, five video albums and over twenty singles. Suede were formed in 1989 by singer Brett Anderson, bassist Mat Osman and guitarist Justine Frischmann. Guitarist Bernard Butler later joined after the group responded to an ad in the Melody Maker. The group played as a four-piece with a drum machine until drummer Simon Gilbert joined. Frischmann left before the group released any material.", "| Simon Gilbert"]}, {"page": "Love and Poison (book)", "response": ["Also covered in great detail is Bernard Butler's departure from the group, which includes accurate diary entries from drummer Simon Gilbert. The recruitment of 17-year-old schoolboy Richard Oakes, as well as keyboard player Neil Codling's struggle with illness and the band's final years are explained thoroughly. One writer wrote that: \"The story of why their last two albums were such a mess, for instance, is far more interesting than either record.\""]}, {"page": "Bloodsports (album)", "response": ["*Simon Gilbert – drums"]}, {"page": "Night Thoughts (album)", "response": ["*Simon Gilbert – drums"]}, {"page": "Simon Gilbert", "response": ["Simon Gilbert may refer to:", "* Simon Gilbert (journalist) (born 1984), English journalist", "* Simon Gilbert (musician) (born 1965), English drummer", "* Simon Gilbert (tenor) (born before 1967), English actor and tenor"]}, {"page": "Simon Gilbert (Musician)", "response": ["#REDIRECT Simon Gilbert (musician)"]}, {"page": "The Blue Hour (album)", "response": ["* Simon Gilbert – drums"]}]}}