{"wiki_id": "http://www.wikidata.org/entity/Q2075963", "itemLabel": "Peter J. Parsons", "itemDescription": "British classicist and papyrologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_J._Parsons", "wikipedia_page": {"main": "Peter John Parsons,  (born 24 September 1936) is a British classicist and academic specialising in papyrology. He was Regius Professor of Greek at the University of Oxford from 1989 to 2003.", "link_mentions": [{"page": "Regius Professor of Greek (Oxford)", "response": ["* Peter J. Parsons, 1989–2003"]}, {"page": "Eric Gardner Turner", "response": ["* Greek manuscripts of the ancient world. Clarendon Press, Oxford, 1971, . The second edition revised and enlarged. Edited by Peter J. Parsons. The University of London, Institute of Classical Studies, 1987 (Bulletin of the Institute of Classical Studies, 46), ."]}, {"page": "Raynes Park High School", "response": ["* Prof Peter J. Parsons, Regius Professor of Greek at the University of Oxford from 1989 to 2003"]}, {"page": "Parsons (surname)", "response": ["*Peter J. Parsons (born 1936), British classicist and papyrologist "]}, {"page": "Alcestis Barcinonensis", "response": ["The decipherment and interpretation of the papyrus has been pushed ahead at four places simultaneously: by Wolfgang Dieter Lebek at the University of Cologne, by Peter J. Parsons, Robin G. M. Nisbet, and G. O. Hutchinson at the University of Oxford, by Miroslav Marcovich at the University of Illinois at Urbana-Champaign and by Vincenzo Tandoi at the University of Foggia.", "* Peter J. Parsons, R. G. M. Nisbet, G. O. Hutchinson: Alcestis in Barcelona. In: Zeitschrift für Papyrologie und Epigraphik 52, 1983, 31-36."]}, {"page": "Greek Minor Prophets Scroll from Nahal Hever", "response": ["Already in 1990 Emanuel Tov published the textual edition of the Greek Minor Prophets Scroll from Nahal Hever. Throughout studies of the fragments, and in reference works, acronyms such as Se2grXII, LXXIEJ12, LXXVTS10a, Rahlfs 493a, 8HevXIIa, LXXVTS10b, Rahlfs 493b, 8HevXIIa, Rahlfs 493 and 8HevXII have been used, so in 1990, Emanuel Tov, Robert A. Kraft and Peter J. Parsons recommend that scholars use the acronym 8HevXIIgr, becoming the modern sigla. Tov, as well as George Howard, agree that if Lifshitz's identifications are correct, then there are two manuscripts of the Minor Prophets.", "The fragmentary state of preservation of the text also makes statements about the textual character difficult. However, the editors agree that this is an early revision of the Septuagint in alignment with the Hebrew text. Dominique Barthélemy established that text found \"is neither a new translation nor an independent one, but rather a recension of the Septuagint text\". According to Tuukka Kauhanen, a Postdoctoral Researcher at the Faculty of Theology at University of Helsinki, this manuscript is an early Hebraizing revision (i.e. in B-text of books such as Joshua, Judges, and Samuel-Kings), Eugene C. Ulrich wrote \"attests the recension commonly referred to as Proto-Theodotion or καιγε\" recension,Eugene Ulrich, The Dead Sea Scrolls and the Origins of the Bible, Grand Rapids, MI: Wm. B. Eerdmans Publishing, 1999, p. 231. which is reaffirmed by Pavlos Vasileiadis, a Doctor of Theology at the Aristotle University of Thessaloniki. James A.E. Mulroney quoting Emanuel Tov, Robert A. Kraft and Peter J. Parsons claim that \"although 8HevXIIgr was a revision of OG towards the proto-MT, it retained significant continuity with the OG text… was a revision, not a new translation\". David L. Washburn wrote that is a direct translation from an MT-type manuscript into Greek, i.e. not part of the Septuagint tradition.David L. Washburn, A Catalog of Biblical Passages in the Dead Sea Scrolls, vol. 2, Leiden: Brill, 2003, p. 2."]}, {"page": "Peter Parsons", "response": ["#REDIRECT Peter J. Parsons"]}]}}