{"wiki_id": "http://www.wikidata.org/entity/Q20713864", "itemLabel": "Flo Morrissey", "itemDescription": "English recording artist; singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Flo_Morrissey", "wikipedia_page": {"main": "The Hon. Florence Clementine (née Florence Elizabeth J. Morrissey, born 25 December 1994), better known by her stage name Flo Morrissey, is an English singer-songwriter from Notting Hill, London. She has released two albums and three singles, and has toured internationally.", "link_mentions": [{"page": "Kathryn Williams", "response": ["* Love & Other Crimes: The Songs Of Lee Hazelwood - Barbican, London - 25 October 2015 (with Ed Harcourt, Matthew E White, Josh T Pearson, Flo Morrissey & Fran Healy)"]}, {"page": "Sunday Morning (The Velvet Underground song)", "response": ["Also in 2017, Flo Morrissey and Matthew E. White covered the song on their album Gentlewoman, Ruby Man, a collection of covers."]}, {"page": "Noah Georgeson", "response": ["! scope=\"row\"| Flo Morrissey"]}, {"page": "Josiah Steinbrick", "response": ["*Flo Morrissey – Tomorrow Will Be Beautiful – Bass, Harpsichord "]}, {"page": "FLO", "response": ["* Flo Morrissey (born 1994), English singer-songwriter"]}, {"page": "End of the Road Festival", "response": ["In 2015 the festival celebrated its 10th anniversary and it took place on 4–6 September. The line up included Tame Impala, Sufjan Stevens in his only 2015 European festival date and The War on Drugs, Mac Demarco, Future Islands, My Morning Jacket, Laura Marling, Django Django, Alvvays, Fat White Family, Slow Club, The Duke Spirit, The King Khan & BBQ Show, Torres, Oscar, Hinds, Low, Fuzz, Natalie Prass, Ought, Stealing Sheep, Giant Sand, Marika Hackman, Kevin Morby, East India Youth, Sleaford Mods, Girlpool, Du Blonde, Brakes, Wand, Jacco Gardner, Flo Morrissey, Metz, Pond, Kiran Leonard, Peter Matthew Bauer, H Hawkline, Ryley Walker, Fumaca Preta, Ultimate Painting, Jane Weaver, Andy Shauf, Saint Etienne, Giant Sand, Palma Violets, Meilyr Jones, Euros Childs, Ex Hex, Diagrams, Stephen Steinbrink and Crushed Beaks."]}, {"page": "Glassnote Records", "response": ["* Flo Morrissey", "* Flo Morrissey and Matthew E. White – Gentlewoman, Ruby Man (January 13, 2017)"]}, {"page": "Matthew E. White", "response": ["Matthew E. White (born August 14, 1982) is an American singer, songwriter, producer and arranger. He has worked as a collaborator, producer, and arranger for acts including Bedouine, Natalie Prass, Cocoon, Foxygen, Justin Vernon, Hiss Golden Messenger, Sharon Van Etten, Ken Vandermark, Steven Bernstein, The Mountain Goats, Dan Croll and Slow Club. As a solo artist he has released two studio albums, Big Inner and Fresh Blood, and two collaboration albums, Gentlewoman, Ruby Man with Flo Morrissey and Broken Mirror: A Selfie Reflection with Lonnie Holley. White is also the founder and a co-owner of  Spacebomb, originally conceived as a record label with a house band, and now a multi-disciplinary music company with a studio and offices in Richmond, Virginia.", "In January 2017, White, along with English singer and songwriter Flo Morrissey, released Gentlewoman, Ruby Man, an album consisting of versions of tracks by artists such as Frank Ocean, the Velvet Underground, Leonard Cohen, James Blake, and the Bee Gees. The album was produced by White in Richmond, Virginia and released by Glassnote Records. The duo performed their cover of Grease on The Late Show with Stephen Colbert before playing the album live four times at concerts in New York, London, Paris and Richmond, VA.", "with Flo Morrissey"]}, {"page": "Benjamin Clementine", "response": ["Clementine is married to British singer-songwriter Flo Morrissey, and the couple had their first child Julian Jupiter Richard Sainte-Clémentine on Christmas Day 2017. A daughter, Helena Clementine, was born on 29 October 2019, in Ojai, California."]}, {"page": "Helena Morrissey, Baroness Morrissey", "response": ["Baroness Morrissey and her husband, Richard, a former financial journalist and stay-at-home dad, are the parents of nine children, three boys and six girls, one of whom is musician Flo Morrissey. They met whilst studying at Cambridge and live in Notting Hill, London."]}, {"page": "List of 2017 albums", "response": ["| Flo Morrissey and Matthew E. White"]}, {"page": "Gentlewoman, Ruby Man", "response": ["Gentlewoman, Ruby Man is a cover album by English singer and songwriter Flo Morrissey and American musician Matthew E. White, released on 13 January 2017 by Glassnote Records. The album consists of a series of versions of tracks by artists such as Frank Ocean, The Velvet Underground, Leonard Cohen, James Blake, and the Bee Gees.", "Category:Flo Morrissey albums"]}]}}