{"wiki_id": "http://www.wikidata.org/entity/Q20751892", "itemLabel": "James Sellar", "itemDescription": "Australian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Zimri_Sellar", "wikipedia_page": {"main": "James Zimri Sellar (4 November 1830 – 20 December 1906) was an Australian politician who represented the South Australian House of Assembly multi-member seat of Adelaide from 1905 to 1906 for the United Labor Party.Sellar was born in Vauxhall in London, England, and migrated to South Australia at the age of nineteen. In 1849, he attended the historic meeting at Neale's Exchange to discuss the proposed Constitution of South Australia. He became a turner in 1850, and also worked as a shorthand reporter for the South Australian Register. He was involved in a campaign among mechanics at Kooringa, near Burra, for an eight-hour day, becoming their spokesperson. He went to Bendigo during the Victorian gold rush, but returned to South Australia in 1853, and having had some success, established the Vauxhall Tea Company, which he operated for 44 years. He was then a land and estate valuer and general arbitrator for another eighteen years. Sellar was a well-known Congregationalist, attending Thomas Quinton Stow's church from his arrival, and occupied a number of senior positions in the voluntary militia force.Sellar was one of the founders of the National Reform Association, and when that wound up, was the first president of the Adelaide Democratic Club. He was also a member of the Labor League of South Australia at its inception in 1876. He made many unsuccessful attempts for municipal and state office from 1878, but was known for his good humour about his various defeats. He was eventually successful in being elected as a Town of Adelaide councillor for Young Ward, serving from 1891 to 1903 and from 1904 to 1906, being defeated for the final time in the same month he died. He was a staunch advocate of universal suffrage and an opponent of state aid to religion. Sellar was elected to the House of Assembly at the 1905 election, and was re-elected with an increased majority at the 1906 election. He was also a member of the party executive by this time.He died at his home, \"St Heliers\", on South Terrace, while in office in 1906, after being ill for several weeks, at the age of 76. The Herald labelled him the \"grand old man of the Labor Party\", while various colleagues praised him as a lifelong democrat who had been advocating his ideals long before the formation of the Labor Party. He was cremated at the West Terrace Crematorium. He was survived by two daughters; two wives and two sons predeceased him.", "link_mentions": [{"page": "James Sellar", "response": ["James Sellar (born 24 March 1989 in Adelaide) is an Australian rules footballer who played with  and  in the Australian Football League (AFL)."]}, {"page": "Sellar", "response": ["* James Sellar (born 1989), Australian rules footballer", "* James Sellar (curler) (born 1957), Scottish and British wheelchair curler and bowles player, 2010 Winter Paralympian"]}]}}