{"wiki_id": "http://www.wikidata.org/entity/Q20713495", "itemLabel": "Thomas Renouf", "itemDescription": "British golfer (1878-1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Renouf", "wikipedia_page": {"main": "Thomas George Renouf (c. 1878 – 14 July 1955) was an English professional golfer from Jersey who played in the late 19th and early 20th century. He had multiple top-10 finishes in the Open Championship. His best result was fifth in the 1909 Open Championship. Renouf caddied in his youth at Royal Jersey Golf Club and became a skilled club maker as well as a manufacturer of golf balls.\n\n", "link_mentions": [{"page": "Cecil Leitch", "response": ["In 1914 she won the first of her four British Ladies Amateurs, taking the title from Muriel Dodd. Her opportunity to possibly win several more was interrupted for five years during World War I. When the Championship was restarted after the war, she won her second straight title then the following year made it three in a row. Leitch was able to reach the Championship finals on six occasions, and in 1926 won her fourth British title, a record she shares with Joyce Wethered. She received golf lessons from Thomas Renouf, the head professional at Silloth."]}, {"page": "British PGA Matchplay Championship", "response": ["| 1923 || Reg Wilson ||  || Walton Heath Golf Club || align=center|4 & 2 ||  Thomas Renouf || align=center|200 || || Abe Mitchell, Tom Williamson"]}, {"page": "1898 Open Championship", "response": ["Defending champion Harold Hilton and Willie Park Jr. led after the first round on 76. Park was even better in the afternoon and led after the first day on 151. Vardon also scored 75 and was second on 154 with Thomas Renouf and J.H. Taylor on 156. Hilton led the amateurs on 157. 43 players made the cut, including five amateurs. Willie Auchterlonie, who had won the previous Open Championship at Prestwick in 1893, was amongst those who failed to make the cut.", "|rowspan=2 align=center|T3 || Thomas Renouf ||  || 77-79=156", "|align=center|9 || Thomas Renouf ||  || 77-79-81-83=320 || align=center|0"]}, {"page": "1899 Open Championship", "response": ["|align=center|10 || Thomas Renouf ||  || 79-82=161"]}, {"page": "1905 Open Championship", "response": ["|Thomas Renouf || "]}, {"page": "1906 Open Championship", "response": ["|Thomas Renouf || ", "|Thomas Renouf ||  || 76-77=153", "|align=center|7 || Thomas Renouf ||  || 76-77-76=229", "|Thomas Renouf ||  || 76-77-76-83=312"]}, {"page": "1907 Open Championship", "response": ["|Thomas Renouf ||  || 83-80=163"]}, {"page": "1909 Open Championship", "response": ["|Thomas Renouf ||  ", "|Thomas Renouf ||  || 76-78=154", "|Thomas Renouf ||  || 76-78-76=230", "|align=center|5 || Thomas Renouf ||  || 76-78-76-73=303 || rowspan=2 align=center|710s"]}, {"page": "1910 Open Championship", "response": ["|Thomas Renouf ||  ", "|Thomas Renouf ||  || 77-76=153", "|Thomas Renouf ||  || 77-76-75=228", "|Thomas Renouf ||  || 77-76-75-81=309"]}, {"page": "1911 Open Championship", "response": ["|Thomas Renouf ||  || align=center|C", "|Thomas Renouf ||  || 75-76=151 || align=center|C"]}, {"page": "1913 Open Championship", "response": ["Ray led after the first two rounds on Monday with 147; Taylor was at 148, Michael Moran at 150, and Thomas Renouf had ", "|Thomas Renouf ||  ", "|align=center|4 || Thomas Renouf ||  || 75-78=153", "|Thomas Renouf ||  || 75-78-84=237", "|Thomas Renouf ||  || 75-78-84-78=315"]}, {"page": "List of people from Jersey", "response": ["*Thomas Renouf, professional golfer (1878–1955)"]}, {"page": "Glasgow Herald Tournament", "response": ["Ted Ray won the qualifying stage again with a score of 212, taking the £25 prize. 16 players scored 222 or better and advanced to the match play stage. The 16 included three Americans, Jock Hutchison, Walter Hagen and Emmet French, together with the Australian Joe Kirkwood Sr. All three Americans lost on the first day of the match play. Hutchison lost to Abe Mitchell while French lost to Ray. Hagen won his first round match but lost to Thomas Renouf in the afternoon. Mitchell met Kirkwood in the final. Mitchell led by four holes after the morning round and won easily 7&6.", "The tournament was played from 29 June–3 July. George Duncan led the qualifying on 139, two clear of Bill Davies. Five players tied on 152 for three places. Freddie Beck, José Jurado and David Millar making it through the six-hole playoff. Aubrey Boomer met Lewis Herrington in the final. Boomer was well known, having won a number of continental open championships and the Daily Mail Tournament early in the year. Herrington, by contrast, was a relatively unknown Yorkshire golfer. He had beaten Stewart Burns and George Duncan in close matches on the first day of the match play and then Mark Seymour and Thomas Renouf to reach the final. Herrington won the first two holes of the final but Boomer had levelled by the sixth and was four up after the morning round. The afternoon round was close until Boomer won three holes in a row from the 9th to be dormie 7. Herrington won the 12th but the match ended at the next with Boomer winning 7&5."]}, {"page": "Northern Professional Championship", "response": ["The first Championship was held in 1920 at the Manchester Golf Club, Hopwood Park. It was a 36-hole medal event and was won by Thomas Renouf after a playoff. The winner received the \"Manchester Guardian Cup\" and the total prize money was £40. The second event was held at Alwoodley Golf Club, Leeds and was won by Arthur Havers, again after a playoff. In 1922 Havers retained the Championship at Blackpool.http://www.golfinggadds.com/page140.htm", "The 1928 Championship was held at Birkdale Golf Club and was won by Bill Large, Sr.. Thomas Renouf, 1920 champion, regained the title in 1929 at Pleasington Golf Club, Blackburn. the 1930 event was held at Brancepeth Castle Golf Club, Durham and was won by local professional Charles Gadd, brother of George, the 1924 and 1926 champion. The event returned to Lytham in 1931 and was won by Bill Davies, a runner-up in 1926 and 1927. Philip Rodgers won in 1932 at Furness Golf Club while Cyril Fryer won in 1933 at Fleetwood Golf Club. Dick Burton won in 1934, played again at Fleetwood Golf Club while Bill Davies, 1931 winner, regained the title in 1935 at Moortown Golf Club."]}, {"page": "Leeds Cup", "response": ["| 1911 || Ted Ray ||  || Roundhay Golf Club || align=center|147 || 1 stroke ||  Thomas Renouf || align=center| || ", "| 1914 || Thomas Renouf ||  || Northumberland Golf Club || align=center|153 || 2 strokes ||  Harry Crapper Charles Roberts Wilfred Thomson || align=center| || ", "| 1925 || Archie Compston ||  || Keighley Golf Club || align=center|140 || 11 strokes ||  Thomas Renouf || align=center| || "]}, {"page": "James Bradbeer", "response": ["Qualifying took place on 19, 20 and 21 June. The top 20 and ties qualified on each of the three days. Ray led after the first day on 147, with Taylor on 148, Irishman Michael Moran on 150 and Thomas Renouf on 153. Gale force winds on the second day led to some high scoring. Bradbeer, however, was able to cope with the heavy winds and posted consistent rounds of 78-79-81-79=317. He tied for seventh place with three other competitors.  Each of the seventh place finishers won £2 10s."]}, {"page": "England–Scotland Professional Match", "response": ["* Thomas Renouf 1903, 1904, 1905, 1910, 1912"]}, {"page": "1911 Coronation Match", "response": ["| James Hepburn/Thomas Renouf"]}, {"page": "Reg Wilson (golfer)", "response": ["Wilson enjoyed considerable success in the News of the World Match Play. He reached the semi-final stage in both 1912 and 1913. In 1912 he lost 7&5 to Harry Vardon, while in 1913 he lost 4&3 to George Duncan. Wilson won the tournament in 1923 at Walton Heath Golf Club  beating Thomas Renouf 4&2  in the final and winning the first prize of £200. He reached the semi-final for the fourth time in 1926, losing to 58-year-old Sandy Herd by 1 hole."]}, {"page": "1906 News of the World Match Play", "response": ["*Northern section: George Duncan, Sandy Herd, Ted Ray, Thomas Renouf, Charles Roberts"]}, {"page": "1908 News of the World Match Play", "response": ["* Northern section: Tom Ball, Tom Beck, Sandy Herd, Ted Ray, Thomas Renouf, Fred Robson, Tom Watt"]}, {"page": "1911 News of the World Match Play", "response": ["*Northern section: Jack Gaudin, Walter Hambleton, Cyril Hughes, Bill Leaver, Ted Ray, Thomas Renouf, Sam Whiting"]}, {"page": "1913 News of the World Match Play", "response": ["* 3 September Northern section at St Anne's Old Links: Sam Whiting won by 1 stroke on 147. Tom Brace, Peter Rainford and Thomas Renouf tied on 151 and played off the next day for two places. Renouf with 73 and Rainford 77 qualified, while Brace scored 80.", "*Northern section: Bill Davies, Arthur Day, James Douglas Edgar, Peter Rainford, Thomas Renouf, Harry Simpson, Sam Whiting"]}, {"page": "Renouf, Thomas", "response": ["#redirectThomas Renouf"]}, {"page": "Michael Moran (golfer)", "response": ["In late 1913 it was announced that Moran was leaving Royal Dublin Golf Club to be professional at Wearside Golf Club at Cox Green, Sunderland from January 1914. The move did not, however, take place, Wearside appointing James MacKenzie, the professional at nearby Seaham Harbour, in early 1914. It was almost immediately announced that Moran would replace MacKenzie at Seaham Harbour, County Durham. Having failed to reach the final stage of the Sphere and Tatler Foursomes Tournament in its first three years, Moran finally succeeded through the Northern section qualifying, an event that also incorporated the Leeds Cup. Moran was drawn with Thomas Renouf, who had won the Leeds Cup. They won their first two matches but lost in the quarter-finals. In early June Moran played in the Cruden Bay Professional Tournament. He qualified comfortably, as one of the leading 16 after the 36-hole stroke-play stage, before losing 4&3 to Harry Vardon in the quarter-finals. Moran played in the Open Championship later that month. He qualified comfortably but had three disappointing rounds before a final round 76 lifted him into a tie for 25th place."]}]}}