{"wiki_id": "http://www.wikidata.org/entity/Q20788789", "itemLabel": "Carol Brown Janeway", "itemDescription": "British editor and translator", "wikipedia_url": "https://en.wikipedia.org/wiki/Carol_Brown_Janeway", "wikipedia_page": {"main": "Carol Janet Brown Janeway (1 February 1944 – 3 August 2015) was an editor and literary translator into English. She is best known for her translation of Bernhard Schlink's The Reader.", "link_mentions": [{"page": "Fragments: Memories of a Wartime Childhood", "response": ["First published in German in 1995 by the Jüdischer Verlag (part of the highly respected Suhrkamp Verlag publishing house), Bruchstücke was soon translated into nine languages; an English translation by Carol Brown Janeway with the title Fragments appeared in 1996, published by Schocken. The book earned widespread critical admiration, most particularly in Switzerland and in the English-speaking countries, and won several awards, including the National Jewish Book Award in the United States, the Prix Memoire de la Shoah in France, and the Jewish Quarterly literary prize in Britain.Holocaust Denial: A Sequel The book sold well, but in contradiction to common belief it was not a bestseller. ", "* Binjamin Wilkomirski: Fragments. Memories of a Wartime Childhood. Translated from the German by Carol Brown Janeway. New York: Schocken Books, 1996 (reprinted in Maechler, 2001a, pp. 375–496)"]}, {"page": "Bernhard Schlink", "response": ["* 1997 The Reader, translated by Carol Brown Janeway, New York: Pantheon Books", "* 2012 Summer Lies (short stories), translated by Carol Brown Janeway, New York: Pantheon Books "]}, {"page": "Janeway", "response": ["*Carol Brown Janeway, British editor and translator of many novels"]}, {"page": "Alfred A. Knopf", "response": ["While there have been many notable editors at Knopf there have only been four editors-in-chief: Alfred A. Knopf, Sr., Robert Gottlieb, Sonny Mehta and Reagan Arthur. Other influential editors at Knopf included Harold Strauss (Japanese literature), Herbert Weinstock (biography of musical composers), Judith Jones (culinary texts), as well as Angus Cameron, Charles Elliott, Gary Fisketjon, Lee Goerner, Ashbel Green, Carol Brown Janeway, Michael Magzis, Anne McCormick, Nancy Nicholas, Daniel Okrent, Regina Ryan, Sophie Wilkins, and Victoria Wilson. Knopf also employed literary scouts to good advantage.Knopf, Alfred A.: Portrait of a Publisher, 1915-1965. 2 vols. New York: Typophiles, 1965."]}, {"page": "St George's School, Edinburgh", "response": ["*Carol Brown Janeway, translator and editor."]}, {"page": "Independent Foreign Fiction Prize", "response": ["* Elke Schmitter, Mrs Sartoris (German, Carol Brown Janeway)", "* Daniel Kehlmann, Measuring the World (translated by Carol Brown Janeway from the German)", "* Daniel Kehlmann, Fame translated by Carol Brown Janeway (Quercus), German", "*Daniel Kehlmann, F (German; trans. Carol Brown Janeway) "]}, {"page": "Daniel Kehlmann", "response": ["His novel Die Vermessung der Welt (translated into English by Carol Brown Janeway as Measuring the World, 2006) is the best selling book in the German language since Patrick Süskind's Perfume was released in 1985. In an ironic way, it deals with Alexander von Humboldt, one of the world's best-known naturalists of the 18th and 19th centuries, and Humboldt's relationship with the mathematician Carl Friedrich Gauss. According to The New York Times, it was the world's second-best selling novel in 2006. ", "*Ich und Kaminski (2003). Me and Kaminski, translated by Carol Brown Janeway (Pantheon, 2008).", "* Die Vermessung der Welt (2005). Measuring the World, translated by Carol Brown Janeway (Pantheon, 2006).", "* Ruhm. Ein Roman in neun Geschichten (2009). Fame. A Novel in Nine Stories, translated by Carol Brown Janeway (Pantheon, 2010).", "* F. (2013). F. A Novel. Translated by Carol Brown Janeway (Pantheon, 2014)."]}, {"page": "Measuring the World", "response": ["The English translation is by Carol Brown Janeway (November 2006)."]}, {"page": "2015 in the United Kingdom", "response": ["**Carol Brown Janeway, 71, translator."]}, {"page": "Deaths in August 2015", "response": ["*Carol Brown Janeway, 71, British-born American editor and translator (The Reader), cancer.Carol Brown Janeway, Award-Winning Editor, Dead at 71"]}, {"page": "Carol Brown Janeaway", "response": ["#REDIRECT Carol Brown Janeway"]}, {"page": "List of women translators", "response": ["* Carol Brown Janeway (1944– 2015)"]}]}}