{"wiki_id": "http://www.wikidata.org/entity/Q20716284", "itemLabel": "Richard Nugee", "itemDescription": "British military personnel", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Nugee", "wikipedia_page": {"main": "Lieutenant General Richard Edward Nugee, CB, CVO, CBE (born 3 June 1963) is a retired senior British Army officer. He served in several senior roles including Defence Services Secretary (2015–2016) and Chief of Defence People (2016–2020), before ending his career leading a review into climate change policy in the Ministry of Defence between March 2020 and May 2021.", "link_mentions": [{"page": "Royal Artillery", "response": ["*Lieutenant General Richard Nugee, CB, CVO, CBE"]}, {"page": "Radley College", "response": ["*Lt Gen Richard Nugee, British Army officer."]}, {"page": "Deputy Chief of the Defence Staff", "response": ["*2016 – 2020 Lieutenant-General Richard Nugee"]}, {"page": "Defence Services Secretary", "response": ["*Major-General Richard Nugee, CVO, CBE 2015–2016 (Assistant Chief of Defence Staff (Personnel and Reserves) as secondary post)Army appointment"]}, {"page": "List of Durham University people", "response": ["File:Nugee and Kibben (cropped).jpg|Richard Nugee"]}, {"page": "List of people associated with the University of London", "response": ["* Richard Nugee - Lieutenant General in the British Army (KCL)", "* Richard Nugee - Lieutenant General in the British Army and Deputy Chief of the Defence Staff (People) (KCL)"]}, {"page": "List of alumni of King's College London", "response": ["*Richard Nugee – Defence Services Secretary"]}, {"page": "Brambletye School", "response": ["* Lt General Richard Nugee, Climate Change Lead for the Ministry of Defence"]}, {"page": "Christopher Nugee", "response": ["He is the brother of John Nugee, Andrew Nugee, and Richard Nugee."]}, {"page": "Assistant Chief of the Defence Staff", "response": ["* Major General Richard Nugee (2015–2016)"]}, {"page": "2016 Special Honours", "response": ["* Lieutenant General Richard Nugee,  - on the relinquishment of his appointment as Defence Services Secretary. – 25 October 2016"]}, {"page": "Edward Nugee", "response": ["In 1955, Nugee met and married Rachel Elizabeth Makower, who had worked as a code breaker at Bletchley Park during the Second World War. They had four sons, including Sir Christopher Nugee and Lt Gen Richard Nugee."]}, {"page": "Nugee, Richard", "response": ["#redirectRichard Nugee"]}, {"page": "James Swift (British Army officer)", "response": ["Swift was appointed Director of Strategy in March 2016; the post was re-titled as Assistant Chief of the General Staff in September 2018. He became General Officer Commanding the 3rd (United Kingdom) Division in November 2018. It was announced on 30 January 2020 that Swift would become Chief of Defence People (CDP), succeeding Lieutenant General Richard Nugee in late February 2020. Swift was promoted to lieutenant general on 27 February 2020."]}, {"page": "2020 New Year Honours", "response": ["* Lieutenant General Richard Nugee, "]}]}}