{"wiki_id": "http://www.wikidata.org/entity/Q20732317", "itemLabel": "Paula Hawkins", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Paula_Hawkins_(author)", "wikipedia_page": {"main": "Paula Hawkins (born 26 August 1972) is a British author best known for her top-selling psychological thriller novel The Girl on the Train (2015), which deals with themes of domestic violence, alcohol, and drug abuse. The novel was adapted into a film starring Emily Blunt in 2016. Hawkins' second thriller novel, Into the Water, was released in 2017.", "link_mentions": [{"page": "Rosamund Pike", "response": ["In 2021, Pike narrated the audiobook of Paula Hawkins' novel A Slow Fire Burning."]}, {"page": "List of years in literature", "response": ["*2015 in literature – Paul Beatty's The Sellout; Paula Hawkins' The Girl on the Train; Hanya Yanagihara's A Little Life", "*2018 in literature – Anna Burns' Milkman; Sigrid Nunez' The Friend;  Paula Hawkins' Into the Water; Death of Stephen Hawking, Philip Roth"]}, {"page": "Laura Prepon", "response": ["In 2016, Prepon appeared in the psychological thriller The Girl on the Train, based on Paula Hawkins' novel of the same name. In 2017, she played Charlotte opposite Sam Elliott in The Hero. Prepon directed the tenth episode of Orange Is the New Blacks fifth season, titled \"The Reverse Midas Touch\"."]}, {"page": "Paula Hawkins (politician)", "response": ["Paula Hawkins (née Fickes; January 24, 1927 – December 4, 2009) was an American politician from Florida. She is the only woman elected to the U.S. Senate from Florida. She was the second woman ever elected to the Senate from the American South. She was the first woman in the country to be elected to a full Senate term without having a close family member who previously served in major public office.", "Hawkins was the eldest of three children born to Paul and Leone Fickes in Salt Lake City, Utah. Her father was a Naval Chief Warrant Officer. In 1934, the family moved to Atlanta, Georgia, where her father taught at Georgia Tech. Her parents split when Paula was in high school, and Leone and the children returned to Utah.Women in Congress: Paula Fickes Hawkins  She finished high school at Richmond, Utah in 1944, then enrolled at Utah State University. Paula was hired to be the Athletic director's secretary and met her future husband. On September 5, 1947, Paula Fickes and Walter Eugene Hawkins were married and moved to Atlanta. Gene earned a degree in electrical engineering and eventually opened his own business. The couple had three children before moving in 1955 to Winter Park, Florida, where Paula became a community activist and Republican volunteer.Pleasants, Julian: \"Samuel Proctor Oral History Program: Paula Hawkins\"  University of Florida, Dept. of History, November 11, 1997", "Hawkins returned to Winter Park in early 1987. She was United States representative to the Organization of American States' Inter-American Drug Abuse Control Commission (CICAD) for seven years before leaving active politics. She remained involved behind the scenes in central Florida and her endorsement was sought by many candidates. Hawkins was named a director of Philip Crosby Associates in 1988.\"Former Senator Paula Hawkins is named to board of Philip Crosby Associates\", PR Newswire, August 15, 1988. She joined the board of Nu Skin Enterprises in 1997.\"Former U.S. Senator From Florida Joins Nu Skin Asia Pacific Board\", PR Newswire, March 4, 1997. She was a life-long member of The Church of Jesus Christ of Latter-day Saints.", "In a freak accident, a television studio partition toppled and struck her in early January 1982 during an interview at WESH-TV in Winter Park, Florida.\"TV Back Drop Falls; Paula Hawkins Hurt\" Lakeland Ledger, January 6, 1982\"Senator Hawkins Injured\" New York Times, January 6, 1982 While not life-threatening, the mishap aggravated a back injury she suffered years before in an automobile collision and caused constant pain which plagued her during her years in Washington. Senator Strom Thurmond, in his capacity as President pro tempore, gave her the use of a room in the Capitol building for a hospital bed where she found pain relief under weighted traction during breaks between congressional activities.", "Hawkins' right side was paralyzed in 1998 as the result of a severe stroke.  After this, she used a wheelchair.  She stayed active, appearing on October 1, 2009, at the opening ceremony of the Waldorf Astoria Orlando at Walt Disney World.Schneider, Mike: \"Congressman: Ex-Fla. Sen. Paula Hawkins dies at 82; first Southern woman elected to the Senate\" Orlando Sentinel, December 4, 2009", "She died on December 4, 2009, of complications from a fall she suffered the previous day.\"Florida Sen. Paula Hawkins, billed as the 'housewife from Maitland', dies at 82\"  Tampa Tribune, December 5, 2009Kam, Dara: \"Paula Hawkins, Florida's first female U.S. senator, dies\" Palm Beach Post, December 4, 2009", "**Jack Eckerd/Paula Hawkins (R), 44%", "**Paula Hawkins (R), 51%", "**Paula Hawkins (R), 45%"]}, {"page": "Emily Blunt", "response": ["In 2016, Blunt co-starred in The Huntsman: Winter's War, which serves as both a prequel and sequel to Snow White and the Huntsman (2012). The film, directed by Cedric Nicolas-Troyan, was a box-office bomb and was mostly dismissed by critics. Blunt then headlined the mystery thriller The Girl on the Train, directed by Tate Taylor. Based on Paula Hawkins' best-selling novel of the same name, Blunt played Rachel Watson, an alcoholic who becomes involved in a missing person's investigation. While the film overall received mixed reviews from critics, who felt it failed to live up to the novel, Blunt's performance earned considerable praise. Writing for Rolling Stone, Peter Travers remarked that \"the movie gives away the game faster than the novel,\" but credited Blunt for \"playing the hell out of [her character] and adding a touch of welcome empathy. [She] digs into the role like an actress possessed – there's not an ounce of vanity here, [and she] raise[s] Girl to the level of spellbinder.\" For her performance in the film, she received nominations for the BAFTA Award for Best Actress and Screen Actors Guild Award (SAG) for Outstanding Female Actor."]}, {"page": "List of best-selling books", "response": ["|Paula Hawkins"]}, {"page": "Haley Bennett", "response": ["In 2015, Bennett starred in Ilya Naishuller's first-person point-of-view film Hardcore Henry. In 2016, she appeared as Emma Cullen in Antoine Fuqua's The Magnificent Seven, co-starred as Megan Hipwell in the Tate Taylor-directed film adaptation of Paula Hawkins' thriller novel The Girl on the Train, and played actress Mamie Murphy in Warren Beatty's comedy-drama Rules Don't Apply. Responses to the first two films were mixed, while the third was more positively received. Bennett's performances were praised in all three. In 2017, Bennett played Saskia Schumann in Jason Hall's PTSD drama film Thank You for Your Service. She had also been cast in Terrence Malick's musical drama film Song to Song, alongside Christian Bale, but her scenes were later cut."]}, {"page": "CWA Ian Fleming Steel Dagger", "response": ["** Paula Hawkins, The Girl on the Train"]}, {"page": "Erin Cressida Wilson", "response": ["Wilson is known for the 2002 film Secretary, which she adapted from a Mary Gaitskill short story. It won her the Independent Spirit Award for Best First Screenplay and holds a rating of 75% on Rotten Tomatoes. She also wrote the screenplays for the 2006 film Fur: An Imaginary Portrait of Diane Arbus, starring Nicole Kidman; for the 2009 erotic thriller Chloe, directed by Atom Egoyan (remake of the 2003 French film Nathalie...); for the 2014 drama Men, Women & Children, co-written with its director Jason Reitman (from the novel by Chad Kultgen); and the 2016 mystery thriller The Girl on the Train, from the Paula Hawkins novel of the same name and it is her highest-grossing film to date."]}, {"page": "Zimbabwean diaspora", "response": ["*Paula Hawkins (author)"]}, {"page": "List of books from the Richard & Judy Book Club", "response": ["* Paula Hawkins – The Girl on the Train"]}, {"page": "Aditi Rao Hydari", "response": ["In 2021, Aditi Rao Hydari's appeared in suspense film The Girl On The Train, directed by Ribhu Dasgupta. The film starring Parineeti Chopra, Kirti Kulhari, Avinash Tiwary, and Sammy Jonas Heaney alongside her, is based on British author Paula Hawkins 2015 novel of the same name."]}, {"page": "Publishers Weekly list of bestselling novels in the United States in the 2010s", "response": ["#The Girl on the Train by Paula Hawkins ", "#The Girl on the Train (trade paperback) by Paula Hawkins", "#The Girl on the Train by Paula Hawkins (movie tie-in)"]}, {"page": "Parineeti Chopra", "response": ["In 2021, her first film The Girl on the Train, a Hindi remake of British film of same name based on the novel of the same name by British author Paula Hawkins, was released on 26 February 2021 on Netflix. The film was directed by Ribhu Dasgupta featuring Chopra as an alcoholic and troubled divorcee who gets embroiled in a murder investigation. It also featured Avinash Tiwary, Aditi Rao Hydari and Kirti Kulhari. The Firstpost review noted her performance as \"sincere\", writing \"She manages to embed herself in Mira’s tortured mind, giving this film its one selling point.\" Bollywood Hungama opined \"Parineeti Chopra delivers a brilliant performance and is sure to benefit from this film.\" Chopra also sang the unplugged version of the song \"Matlabi Yariyan\" for the film."]}, {"page": "Tate Taylor", "response": ["Taylor achieved mainstream success when he directed the film The Help (2011), based on Kathryn Stockett's novel of the same title. Stockett gave him rights to make the film adaptation in June 2008, before the book was published. In addition to receiving generally positive reviews, the film was a major commercial success, earning more than $200 million worldwide, and was nominated for the Academy Award for Best Picture. Tate Taylor has been nominated for and received industry awards including the 2013 Vail Film Festival Vanguard Award, the 2012 BAFTA Award for Best Adapted Screenplay nomination, the 2012 Writers Guild of America Award for Best Adapted Screenplay, the 2012 Critics' Choice Movie Award for Best Adapted Screenplay nomination, the 2012 NAACP Image Award nomination for Outstanding Directing in a Motion Picture and for Outstanding Writing in a Motion Picture, and the 2011 Chicago Film Critics Association nomination. Taylor next directed the James Brown biopic Get on Up (2014), which starred Chadwick Boseman. Though the film was a critical success, it commercially underperformed. His next project The Girl on the Train, an adaption of the book by Paula Hawkins, was released to mixed reviews from critics, but was a box office success."]}, {"page": "Goodreads Choice Awards", "response": ["|The Girl on the Train  by Paula Hawkins", "|Into the Water  by Paula Hawkins", "|Paula Hawkins"]}, {"page": "List of alumni of Keble College, Oxford", "response": ["* Paula Hawkins, novelist and journalist"]}, {"page": "100 Women (BBC)", "response": ["| 100px || data-sort-value=\"Hawk\"|Paula Hawkins ||  || Thriller writer of \"Girl on the Train\""]}, {"page": "2015 in the United Kingdom", "response": ["*Paula Hawkins' novel The Girl on the Train."]}, {"page": "2015 in literature", "response": ["*Paula Hawkins – The Girl on the Train (January 13)"]}, {"page": "The New York Times Fiction Best Sellers of 2015", "response": ["This is a list of adult fiction books that topped The New York Times Fiction Best Seller list in 2015, in the Combined Print & E-Book Fiction category.November 22, 2015 Combined Print & E-Book Fiction. The New York Times. Retrieved November 16, 2015 The most frequent weekly best seller was The Girl on the Train by Paula Hawkins with 16 weeks at the top of the list.", "| February 1 || rowspan=13|The Girl on the Train || rowspan=13|Paula Hawkins", "| May 31 || rowspan=2|The Girl on the Train || rowspan=2|Paula Hawkins", "| June 28 ||  The Girl on the Train || Paula Hawkins"]}, {"page": "The Girl on the Train (novel)", "response": ["The Girl on the Train is a 2015 psychological thriller novel by British author Paula Hawkins that gives narratives from three different women about relationship troubles (caused by three coercive/controlling men) and, for the main protagonist, alcoholism. The novel debuted in the number one spot on The New York Times Fiction Best Sellers of 2015 list (print and e-book) dated 1 February 2015, and remained in the top position for 13 consecutive weeks, until April 2015. In January 2016 it became the #1 best-seller again for two weeks. Many reviews referred to the book as \"the next Gone Girl\", referring to a popular 2012 psychological mystery, by author Gillian Flynn, with similar themes that used unreliable narrators.", "The Girl on the Train has been compared frequently to Gone Girl by Gillian Flynn, as both novels employ unreliable narrators and deal with suburban life. Paula Hawkins has waved these comparisons off, however, saying in an interview with The Hollywood Reporter: \"Amy Dunne is a psychopath, an incredibly controlling and manipulative, smart, cunning woman. [Rachel is] just a mess who can't do anything right.\""]}, {"page": "The Girl on the Train (2016 film)", "response": ["The Girl on the Train is a 2016 American mystery psychological thriller film directed by Tate Taylor and written by Erin Cressida Wilson, based on British author Paula Hawkins' popular 2015 debut novel of the same name. The film stars Emily Blunt, Rebecca Ferguson, Haley Bennett, Justin Theroux, Luke Evans, Allison Janney, Édgar Ramírez, and Lisa Kudrow. The film follows an alcoholic divorcée named Rachel who becomes involved in a missing person investigation.", "During post-production on the film, a cameo appearance by Paula Hawkins was cut from the film."]}, {"page": "Arundel School", "response": ["* Paula Hawkins (author) - Novelist"]}, {"page": "The Fox and the Star", "response": ["The Fox and the Star is an illustrated book by Coralie Bickford-Smith, a cover designer at Penguin Books. Published in 2015, it was chosen as that year's Waterstones Book of the Year, beating highly acclaimed contenders including Harper Lee’s Go Set a Watchman, Elena Ferrante’s My Brilliant Friend, Paula Hawkins’ The Girl on the Train, and A Little Life by Hanya Yanagihara.", "The Fox and the Star was the winner of the 2015 Waterstones Book of the Year Award. Other titles on the award's shortlist had included: Harper Lee's Go Set a Watchman, SPQR: A History of Ancient Rome by Mary Beard; My Brilliant Friend by Elena Ferrante; Reasons to Stay Alive by Matt Haig; The Girl on the Train by Paula Hawkins; The Shepherd's Life by James Rebanks and A Little Life by Hanya Yanagihara."]}, {"page": "The New York Times Fiction Best Sellers of 2016", "response": ["This is a list of adult fiction books that topped The New York Times Fiction Best Seller list in 2016, in the Combined Print & E-Book Fiction category.Oct 16, 2016 Combined Print & E-Book Fiction. The New York Times. Retrieved Oct 7, 2016 The most frequent weekly best seller of the year was The Girl on the Train by Paula Hawkins with 10 weeks at the top of the list, followed by Me Before You by Jojo Moyes with 7 weeks.", "|  || rowspan=\"2\" |The Girl on the Train || rowspan=\"2\" | Paula Hawkins", "|  ||The Girl on the Train || Paula Hawkins", "|  || rowspan=\"2\" |The Girl on the Train || rowspan=\"2\" | Paula Hawkins", "|  || rowspan=\"5\" |The Girl on the Train || rowspan=\"5\" | Paula Hawkins"]}, {"page": "Luckiest Girl Alive", "response": ["Critical reception has been positive. Luckiest Girl Alive has been compared to Gillian Flynn's 2012 novel Gone Girl and Paula Hawkins' The Girl on the Train. The book received praise from Entertainment Weekly and USA Today, the latter of which wrote that \"Recent newsworthy topics create a backdrop that can, at times, make the reader uncomfortable. Yet the visceral tension Knoll creates actually complements the reading experience.\""]}, {"page": "2017 in the United Kingdom", "response": ["*Paula Hawkins' novel Into the Water."]}]}}