{"wiki_id": "http://www.wikidata.org/entity/Q207335", "itemLabel": "Pete Best", "itemDescription": "British musician, former member of the Beatles", "wikipedia_url": "https://en.wikipedia.org/wiki/Pete_Best", "wikipedia_page": {"main": "Randolph Peter Best (né Scanland; born 24 November 1941) is an English musician known as the drummer of the English rock band the Beatles immediately before the band achieved worldwide fame. Fired from the group in 1962 after playing drums as a Beatle for the previous two years in Germany and England, he started his own band, the Pete Best Four. He later joined and started many other bands over the years. He is one of several people who have been referred to as the Fifth Beatle.\nBest's mother, Mona Best (1924–1988), opened the Casbah Coffee Club in the cellar of the Bests' house in Liverpool. The Beatles (at the time known as the Quarrymen) played some of their first concerts at the club. The Beatles invited Best to join the band on 12 August 1960, on the eve of the group's first Hamburg season of club dates. Ringo Starr eventually replaced Best on 16 August 1962, when the group's manager, Brian Epstein, fired Best at the request of John Lennon, Paul McCartney and George Harrison following the band's first recording session. Over 30 years later, Best received a major monetary payout for his work with the Beatles after the release of their 1995 compilation of their early recordings on Anthology 1; Best played the drums on a number of the album's tracks, including the Decca auditions.\nAfter working in a number of commercially unsuccessful groups, Best gave up the music industry to work as a civil servant for 20 years before starting the Pete Best Band.", "link_mentions": [{"page": "John Lennon", "response": ["McCartney recommended that his friend George Harrison become the lead guitarist. Lennon thought that Harrison, then 14 years old, was too young. McCartney engineered an audition on the upper deck of a Liverpool bus, where Harrison played \"Raunchy\" for Lennon and was asked to join. Stuart Sutcliffe, Lennon's friend from art school, later joined as bassist. Lennon, McCartney, Harrison and Sutcliffe became \"The Beatles\" in early 1960. In August that year, the Beatles were engaged for a 48-night residency in Hamburg, in West Germany, and were desperately in need of a drummer. They asked Pete Best to join them. Lennon's aunt, horrified when he told her about the trip, pleaded with Lennon to continue his art studies instead. After the first Hamburg residency, the band accepted another in April 1961, and a third in April 1962. As with the other band members, Lennon was introduced to Preludin while in Hamburg, and regularly took the drug as a stimulant during their long, overnight performances."]}, {"page": "November 24", "response": ["*1941 – Pete Best, Indian-English drummer and songwriter "]}, {"page": "Ringo Starr", "response": ["Starr was afflicted by life-threatening illnesses during childhood, with periods of prolonged hospitalisation. He briefly held a position with British Rail before securing an apprenticeship as a machinist at a Liverpool school equipment manufacturer. Soon afterwards, he became interested in the UK skiffle craze and developed a fervent admiration for the genre. In 1957, he co-founded his first band, the Eddie Clayton Skiffle Group, which earned several prestigious local bookings before the fad succumbed to American rock and roll around early 1958. When the Beatles formed in 1960, Starr was a member of another Liverpool group, Rory Storm and the Hurricanes. After achieving moderate success in the UK and Hamburg, he quit the Hurricanes when he was asked to join the Beatles in August 1962, replacing Pete Best.", "Starr quit Rory Storm and the Hurricanes in January 1962 and briefly joined Sheridan in Hamburg before returning to the Hurricanes for a third season at Butlins.: A second season with the Hurricanes at Butlins; : Starr quit the Hurricanes and briefly joined Sheridan in Hamburg; : Starr quit the Hurricanes and briefly joined Sheridan in Hamburg. On 14 August, Starr accepted Lennon's invitation to join the Beatles. On 16 August, Beatles manager Brian Epstein fired their drummer, Pete Best, who recalled: \"He said 'I've got some bad news for you. The boys want you out and Ringo in.' He said [Beatles producer] George Martin wasn't too pleased with my playing [and] the boys thought I didn't fit in.\" Starr first performed as a member of the Beatles on 18 August 1962, at a horticultural society dance at Port Sunlight.; ; . After his appearance at the Cavern Club the following day, Best fans, upset by his firing, held vigils outside his house and at the club shouting \"Pete forever! Ringo never!\" Harrison received a black eye from one upset fan, and Epstein, whose car tyres they had flattened in anger, temporarily hired a bodyguard.: Harrison received a black eye; : Epstein hired a bodyguard;  (tertiary source).", "Starr's first recording session as a member of the Beatles took place on 4 September 1962. He stated that Martin had thought that he \"was crazy and couldn't play ... because I was trying to play the percussion and the drums at the same time, we were just a four-piece band\". For their second recording session with Starr, on 11 September 1962, Martin replaced him with session drummer Andy White while recording takes for what would be the two sides of the Beatles' first single, \"Love Me Do\", backed with \"P.S. I Love You\". Starr played tambourine on \"Love Me Do\" and maracas on \"P.S. I Love You\". Concerned about his status in the Beatles, he thought: \"That's the end, they're doing a Pete Best on me.\" Martin later clarified: \"I simply didn't know what Ringo was like and I wasn't prepared to take any risks.\""]}, {"page": "The Beatles", "response": ["Led by primary songwriters Lennon and McCartney, the Beatles evolved from Lennon's previous group, the Quarrymen, and built their reputation playing clubs in Liverpool and Hamburg over three years from 1960, initially with Stuart Sutcliffe playing bass. The core trio of Lennon, McCartney and Harrison, together since 1958, went through a succession of drummers, including Pete Best, before asking Starr to join them in 1962. Manager Brian Epstein moulded them into a professional act, and producer George Martin guided and developed their recordings, greatly expanding their domestic success after their first hit, \"Love Me Do\", in late 1962. As their popularity grew into the intense fan frenzy dubbed \"Beatlemania\", the band acquired the nickname \"the Fab Four\", with Epstein, Martin and other members of the band's entourage sometimes given the informal title of \"fifth Beatle\".", "Allan Williams, the Beatles' unofficial manager, arranged a residency for them in Hamburg. They auditioned and hired drummer Pete Best in mid-August 1960. The band, now a five-piece, departed Liverpool for Hamburg four days later, contracted to club owner Bruno Koschmider for what would be a 3½-month residency. Beatles historian Mark Lewisohn writes: \"They pulled into Hamburg at dusk on 17 August, the time when the red-light area comes to life ... flashing neon lights screamed out the various entertainment on offer, while scantily clad women sat unabashed in shop windows waiting for business opportunities.\"", "* Pete Best – drums, vocals (1960–1962)"]}, {"page": "Fifth Beatle", "response": ["The term originated in 1964 with the American disc jockey Murray the K, who pronounced himself the \"fifth Beatle\" due to the amount of promotion and coverage he afforded the band on his radio program. Others referred to as the \"fifth Beatle\" include their original drummer, Pete Best, bassist Stuart Sutcliffe, and keyboardist Billy Preston.", "Sutcliffe was an accomplished painter, but when compared to those of the other Beatles, his musical skills were described as \"inadequate\",An Evening With Pete Best, Part I: The Interview. Retrieved 20 January 2007 and his involvement in the band was mainly a consequence of his friendship with Lennon. Sutcliffe's input was an important early influence on the development of the band's image; Sutcliffe was the first to wear what later became famous as the Beatles' moptop hairstyle, asking his girlfriend Astrid Kirchherr to cut his hair in emulation of the hairdo worn by friend Klaus Voormann, and he arguably came up with the band's name.", "===Pete Best===", "Pete Best was the first drummer of the Beatles. He played with the band during their time as a club act, in both Liverpool and Hamburg, Germany. The band during this time period consisted of Best; bassist Stuart Sutcliffe; and guitarists McCartney, Harrison, and Lennon. Best continued to perform with the band until mid-August 1962, when he was fired and replaced by Ringo Starr. The first official Beatles release to include performances by Best was Anthology 1 in 1995, whereupon he commented, \"Lots of people have laid claim to being the fifth Beatle. I was the fourth, and now I'm getting the credit for it.\"", "When the Beatles returned from West Germany for the first time in 1960, they were short of a bass guitarist. Pete Best suggested Chas Newby. Newby had been with the Black Jacks (Pete Best's group), and was now attending university, but was on holiday and so agreed to play with the Beatles. He appeared with them for four engagements in December 1960 (17 December, Casbah Club, Liverpool; 24 December, Grosvenor Ballroom, Liscard; 27 December, Litherland Town Hall; 31 December, Casbah Club). Lennon asked him to go to West Germany for the Beatles' second trip, but he chose to return to university and after Lennon and Harrison both declined to switch to bass guitar, McCartney, who previously played guitar and piano, reluctantly became the band's bassist.", "A schoolmate of McCartney and Harrison and a close personal friend of Pete Best (he actually lived in Best's house and fathered his youngest brother, Roag), Aspinall joined the Beatles as their road manager, which included driving his old Commer van to and from shows, both day and night. After Mal Evans started work for the Beatles, Aspinall was promoted to become their personal assistant, and eventually ascended to the position of CEO for Apple Corps (a position he held until 10 April 2007).", "*George Best, star footballer of the 1960s, shared last name with Pete Best and celebrity lifestyle. Best was dubbed \"The Fifth Beatle\" and \"O Quinto Beatle\" by the Portuguese press after scoring twice for Manchester United in a 5–1 victory at Estádio da Luz against Benfica in the 1965–66 European Cup quarter-finals, mainly due to his Beatles-style \"mop\" haircut. Best was catapulted to superstar status and arriving back in England the press dubbed him \"El Beatle\".\"The birth of El Beatle\". The Independent. Retrieved 5 September 2014"]}, {"page": "George Martin", "response": ["The Beatles auditioned for Martin on 6 June 1962, in studio three at EMI. Ron Richards and his engineer Norman Smith recorded four songs, which Martin (who was not present during the recording) listened to at the end of the session. The verdict was not promising, however, as Richards complained about Pete Best's drumming, and Martin thought their original songs were simply not good enough. Martin asked the individual Beatles if there was anything they personally did not like, to which George Harrison replied, \"I don't like your tie.\" That was the turning point, according to Smith, as John Lennon and Paul McCartney joined in with jokes and comic wordplay, that made Martin think that he should sign them to a contract for their wit alone."]}, {"page": "Astrid Kirchherr", "response": ["Astrid Kirchherr (; 20 May 1938 – 12 May 2020) was a German photographer and artist known for her association with the Beatles (along with her friends Klaus Voormann and Jürgen Vollmer) and her photographs of the band's original members – John Lennon, Paul McCartney, George Harrison, Stuart Sutcliffe and Pete Best – during their early days in Hamburg. "]}, {"page": "Stu Sutcliffe", "response": ["After talking to Sutcliffe one night at the Casbah Coffee Club (owned by Pete Best's mother, Mona Best), Lennon and McCartney persuaded Sutcliffe to buy a Höfner President 500/5 model bass guitar on hire-purchase from Frank Hessey's Music Shop.\"The Beatles Anthology\" (DVD) 2003 (Episode 1 – 0:28:02) Harrison and McCartney talking about Sutcliffe's first bass guitar.Sutcliffe's President Bass rockmine.com. Retrieved: 9 May 2007 Sutcliffe was versed in music: he had sung in the local church choir in Huyton, his mother had insisted on piano lessons for him since the age of nine, he had played bugle in the Air Training Corps, and his father had taught him some chords on the guitar.Photo of Sutcliffe in church choir  liverpoolmuseums.org.uk. Retrieved 13 May 2007 In May 1960, Sutcliffe joined Lennon, McCartney, and George Harrison (then known as \"the Silver Beatles\"). Sutcliffe's fingers would often blister during long rehearsals, as he had never practised long enough for his fingers to become calloused, even though he had previously played acoustic guitar.Sutcliffe's first guitar  liverpoolmuseums.org.uk. Retrieved 13 May 2007 He started acting as a booking agent for the group, and they often used his Gambier Terrace flat as a rehearsal room.", "Sutcliffe's playing style was elementary, mostly sticking to root notes of chords. Harry—an art school friend and founder and editor of the Mersey Beat newspaper—complained to Sutcliffe that he should be concentrating on art and not music, as he thought that Sutcliffe was a competent musician whose talents would be better used in the visual arts. While Sutcliffe is often described in Beatles' biographies as appearing very uncomfortable onstage, and often playing with his back to the audience, their drummer at the time, Best, denies this, recalling Sutcliffe as usually good-natured and \"animated\" before an audience.An Evening With Pete Best, Part I: The Interview rickresource.com. Retrieved 20 January 2007 When the Beatles auditioned for Larry Parnes at the Wyvern Club, Seel Street, Liverpool, Williams later claimed that Parnes would have taken the group as the backing band for Billy Fury for £10 per week (), but as Sutcliffe turned his back to Parnes throughout the audition—because, as Williams believed, Sutcliffe could not play very well—Parnes said that he would employ the group only if they got rid of Sutcliffe. Parnes later denied this, stating his only concern was that the group had no permanent drummer.Bill Harry interview on Beatle Folks – Retrieved 28 November 2007 Klaus Voormann regarded Sutcliffe as a good bass player,\"Stuart Sutcliffe, The Lost Beatle\" documentary although Beatles' historian Richie Unterberger described Sutcliffe's bass playing as an \"artless thump\"."]}, {"page": "The Quarrymen", "response": ["In early 1960, the Quarrymen returned to Phillips' Sound Recording Services to record Lennon's new original song \"One After 909\", although this recording does not survive. Around the same time, the three made a rehearsal tape at McCartney's home. Harrison was absent (as he had an apprenticeship), and the tape features several jams and original songs, including the McCartney instrumental \"Cayenne\". With few gigs during this period the group often wrote letters to secure bookings, several of which survive. The four disliked the Quarrymen name, and went through several others during this period, including Los Paranoias. By March 1960, Lennon and Sutcliffe came up with a new name: the Beatles. The Beatles (after several line-up changes, including adding Mona's son Pete Best on drums) continued to perform around Liverpool and in Hamburg, Germany, before being signed to Parlophone Records in 1962. After their signing, the Beatles achieved worldwide fame and became one of the most popular and successful musical artists of all time, before breaking up in 1970."]}, {"page": "Brian Epstein", "response": ["In an afternoon meeting with the group at NEMS on 3 December 1961, Epstein proposed the idea of managing the Beatles. John Lennon, George Harrison, and Pete Best arrived late for the meeting, as they had been drinking at The Grapes pub in Mathew Street. McCartney also did not arrive on time because he had just got up and was \"taking a bath\", as Harrison explained. Epstein was upset, but Harrison placated him by saying, \"He may be late, but he'll be very clean.\" Lennon had invited Wooler to be at the meeting so that he could give his opinion of Epstein, but he introduced Wooler by saying, \"This is me dad.\" Epstein was reticent throughout the short meeting, only asking if they had a manager. After learning that they had not, he said, \"It seems to me that with everything going on, someone ought to be looking after you.\" He had further meetings with the group on 6 and 10 December 1961.", "===Dismissal of Pete Best===", "After the first recording session on 6 June 1962 Martin had one reservation, as he felt that using an experienced studio session drummer rather than Pete Best would improve the recording (this was in accordance with normal practice at the time). Lennon, McCartney, and Harrison asked Epstein to sack Best when they learned that Martin wanted to replace him on their recordings. Epstein agonised about the decision, asking the Cavern's disc jockey Bob Wooler if it were a good idea. Wooler replied that Best was \"very popular with the fans,\" who would not like it at all. Epstein dismissed Best on 16 August, over two and half months after the first recording session at EMI studios. Best was never given an explanation for his dismissal.", "Epstein initially offered the vacant position to Johnny Hutchinson of the Big Three, a group that Epstein managed at that time as well. Hutchinson turned down the offer, saying, \"Pete Best is a very good friend of mine. I couldn't do the dirty on him\"—although Hutchinson did play for The Beatles at short notice when Best did not turn up on the evening of his dismissal and for two subsequent bookings, until Ringo Starr was able to join. Starr was well known to the group, as he was then playing with Rory Storm and the Hurricanes, the resident group at Butlins' holiday complex in Skegness. He had also occasionally replaced Best when the drummer was ill, and had performed at a recording session with Lennon, McCartney, and Harrison in Hamburg.", "In his autobiography, Pete Best stated that Epstein drove them both to Blackpool one evening where Epstein expressed his \"very fond admiration.\" Epstein then supposedly said, \"Would you find it embarrassing if I ask you to stay in a hotel overnight?\" Best replied that he was not interested, and the two never mentioned the incident again. There were reports of a brief sexual encounter between Lennon and Epstein during a four-day holiday in Barcelona in April 1963. Lennon always denied the rumours, telling Playboy in 1980: \"Well, it was almost a love affair, but not quite. It was never consummated ... but we did have a pretty intense relationship.\" Lennon's first wife Cynthia also maintained that Lennon's relationship with Epstein was platonic. A fictionalised account of the Spanish holiday is featured in the 1991 film The Hours and Times.Dowling, William J. (1989) Beatlesongs. New York: Simon & Schuster Inc. "]}, {"page": "Neil Aspinall", "response": ["The Beatles played at the opening of the Casbah Coffee Club on 29 August 1959, which was in the cellar of Mona Best's house. Aspinall later rented a room in the house and became very good friends with then-Beatle Pete Best.Photo of The Casbah Club samleach.com – Retrieved 8 October 2006 The Beatles had previously used public transport to travel to local bookings, however by February 1961, they were playing two or three concerts per night at different locations needing their own transportation. Best asked Aspinall to be a part-time road manager for the band, so Aspinall bought an \"old, grey and maroon Commer van\" for £80, and charged each of the group five shillings (25p) per concert. Harrison later said: \"Our early van became the centre of attention every time it pulled up. It was brush-painted red and grey and from head to foot was covered in graffiti – girls' names, and things like 'I love you, John'. It looked interesting, but the moment anybody saw it they would feel free to write all over it.\"The Beatles Anthology DVD 2003 (Episode 1 – 0:55:54) Aspinall talking his early days with The Beatles. The Beatles returned from their second trip to Hamburg in July 1961, and Aspinall left his job to become their permanent road manager, as he was earning more money driving them around than he was earning by being an accountant.photo of Aspinall’s van being loaded on the ferry to Hamburg beatlesource.com – Retrieved 4 November 2007", "In 1961 and 1962, Aspinall had become good friends with Pete Best and subsequently rented a room in the house where Best lived with his parents. During one of the extended business trips of Best's father, the 19-year-oldWilliams, Richard. \"Obituary – Neil Aspinall\", The Guardian, 25 March 2008 Aspinall became romantically involved with Best's mother, Mona Best, who was 17 years his senior. As a result, during this period, Aspinall fathered a child by Mona: Vincent \"Roag\" Best.  iol.ie/~beatlesireland – Retrieved 17 July 2009. Roag Best was born in late July 1962, and just three weeks later, on 16 August 1962, Best was dismissed from the Beatles.", "Aspinall died of lung cancer in New York City in 2008. His funeral was at the Church of St Mary the Virgin in Twickenham. Stella McCartney, Yoko Ono, Barbara Bach (wife of Starr), George Martin, Pete Best and Pete Townshend attended the funeral, with Townshend playing Bob Dylan's \"Mr. Tambourine Man\" as a tribute. The private service was followed by Aspinall's burial at Teddington Cemetery. Aspinall left nearly £7 million in his will in a trust, with the income going to Suzy, his wife of 40 years."]}, {"page": "The Beatles Anthology", "response": ["Two days after the first television special in the series had aired, Anthology 1 was released to stores, and included music recorded by the Quarrymen, the famous Decca Records audition tapes, and various out-takes and demos from the band's first four albums. It also included the song \"Lend Me Your Comb\", omitted from the collection Live at the BBC, released the previous year (1994). The song \"Free as a Bird\" was included at the very start. 450,000 copies of Anthology 1 were sold in its first day of release, the most sales for an album in a single day ever. The band's first drummer Pete Best, replaced by Ringo Starr in 1962 before the Beatles recorded professionally for EMI, received his first substantial Beatles royalties from this album, for the inclusion of early demo tracks on which he played."]}, {"page": "1969 in music", "response": ["*January 18 – Pete Best wins his defamation lawsuit against The Beatles. Best had originally sought $8 million, but ends up being awarded much less."]}, {"page": "1962 in music", "response": ["*August 16 – The Beatles fire drummer Pete Best and replace him with Ringo Starr."]}, {"page": "1960 in music", "response": ["*August 17 – The Beatles make their debut under this name in Hamburg, Germany, beginning a 48-night residency at the Indra club. The band at the time comprises John Lennon, Paul McCartney, George Harrison, Stu Sutcliffe on bass and Pete Best on drums."]}, {"page": "1941 in music", "response": ["**Pete Best, rock drummer (The Beatles, original lineup)"]}, {"page": "The Beatles bootleg recordings", "response": ["The liner notes for the initial release falsely implied that the recordings had been made in the spring of 1962, prior to the Beatles' EMI contract, on a night when Ringo Starr happened to be sitting in for Pete Best. In commentary for a lawsuit to block the album's release, John Lennon wrote, \"the sleeve note, apart from being inaccurate, seems to have been written with a court case in mind.\" The Beatles lost their case, so the album was viewed as a legitimate release. The thirty songs contained on the initial releases were re-licensed over the following two decades to multiple record labels, most notably Sony Music, which packaged the songs in CD form in 1991 (although the product was withdrawn the following year as legal action was pending from the Beatles). After another lawsuit by the Beatles, Lingasong agreed in 1998 to hand over the original tapes and stop all sales."]}, {"page": "List of drummers", "response": ["* Pete Best (The Beatles)"]}, {"page": "Gerald Scarfe", "response": ["In 2003 Scarfe collaborated with the National Portrait Gallery and BBC Four to make caricatures of a number of famous Britons, to depict (along with guest commentary) their heroic and villainous attributes.  Amongst the over 30 portraits he depicted included caricatures of Henry VIII, Winston Churchill, Queen Elizabeth I, Pete Best, Richard Branson, Adam Smith, William Blake, The Beatles, Agatha Christie and Diana, Princess of Wales. In 2009, he also created a caricature of James May out of Lego which was shown in episode 5 of James May's Toy Stories.  Scarfe and Jane Asher also appeared in the episode. "]}, {"page": "Andy White (drummer)", "response": ["In September 1962, White received a call from producer Ron Richards asking him to attend a Beatles recording session at the EMI Studios at Abbey Road in London. Richards was record producer George Martin's assistant at the time and had used White in the past. The Beatles had recorded \"Love Me Do\" twice already: at an EMI audition on 6 June 1962 with Pete Best on drums when he was still a member of the group; and again on 4 September 1962 with Ringo Starr on drums, Starr having replaced Best the previous month.", "A 1992 single included both the Starr and White versions. An easy way to distinguish between the two versions is that White's version features Starr on tambourine; Starr's version does not include a tambourine. The Pete Best version of the song, initially thought to be lost, was released for the first time on Anthology 1 (1995). \"P.S. I Love You\", with White drumming, was released on the \"B\" side of the \"Love Me Do\" single, and on the Please Please Me album."]}, {"page": "West Derby", "response": ["Well known residents of West Derby have include William Lassell who built an observatory at his house \"Starfield\" in West Derby, a suburb of Liverpool. There he had a 24-inch (610 mm) reflector telescope, for which he pioneered the use of an equatorial mount for easy tracking of objects as the Earth rotates.  Others include Shakespearian actor Leslie Banks, the Beatles' first drummer Pete Best, who lived in Haymans Green, the home of the Casbah Club, where members of the future Beatles—John Lennon, Paul McCartney, and George Harrison, along with Ken Brown, as the Quarry Men—were the original house band; Herbert Haresnape, Olympic swimmer 1908, 1912, Bill Shankly the Liverpool F.C. football manager, whose house overlooked Bellefield; Carla Lane the scriptwriter lived close by, as did Eddie Braben, the scriptwriter for Morecambe and Wise, Bessie Braddock the Liverpool Exchange Division MP and Olympic bronze medal boxer, David Price. Albert Menotti Haynes was born and lived in West Derby, he worked as a railway clerk before emigrating to Argentina and founded the Editorial Haynes publishing empire; he and his wife were also involved in founding Northlands School.  Trent Alexander-Arnold of Liverpool F.C. was born in West Derby near the Melwood Training Centre."]}, {"page": "Brad Hall", "response": ["*Pete Best"]}, {"page": "Template talk:The Beatles/Archive 2", "response": ["|| John Lennon • Paul McCartney • George Harrison • Ringo Starr • Pete Best • Stuart Sutcliffe"]}, {"page": "Anthony Phillips", "response": ["Anthony Edwin Phillips (born 23 December 1951) is an English musician, songwriter, producer and singer who gained prominence as the original lead guitarist of the rock band Genesis, from 1967 to 1970. He left in July 1970 and learned to play more instruments, before he began a solo career. His departure from Genesis on the eve of the group's breakthrough to mainstream popularity has led him to be popularly dubbed \"the Pete Best of progressive rock\" (though unlike Best, Phillips left his band voluntarily)."]}, {"page": "Pete Best Four", "response": ["#REDIRECT Pete Best#The Pete Best Combo "]}, {"page": "Anglo-Indian people", "response": ["* Pete Best, original drummer for the Beatles."]}, {"page": "Brian Dunkleman", "response": ["In appearances on The Howard Stern Show, he had insisted that he intended to leave Idol to pursue a career in stand-up comedy and acting, but in 2008, Dunkleman admitted to Stern that he believed leaving the show was a mistake. Dunkleman conceded that he experienced several months of depression, and also still harbored resentment against current show host Ryan Seacrest, but has come to terms with his situation. Stern has compared Dunkleman to Pete Best of The Beatles and several other famous celebrities who chose to leave (or were forced to leave) successful show business careers, only to wind up as has-beens. In 2016, Dunkleman would backtrack and say that the mutual decision to part ways was not a mistake on his part."]}, {"page": "Mclusky", "response": ["More realistically it has been suggested that Falkous and Harding met when working together at Anglian Windows, a small double-glazing call centre in Cardiff. They discussed their musical ambitions after a conversation about Reading Festival, Falkous gave Harding a tape of songs he had written on his own, and shortly after they formed a band called Best after early Beatles drummer Pete Best. The original bass player for Best was Geraint Bevan, Harding's old musical comrade from The Derelicts."]}]}}