{"wiki_id": "http://www.wikidata.org/entity/Q20713180", "itemLabel": "Debbie Moon", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Debbie_Moon", "wikipedia_page": {"main": "Debbie Moon  is an English screenwriter and author, best known as the creator and show-runner of the CBBC fantasy series Wolfblood.", "link_mentions": [{"page": "Wolfblood", "response": ["Wolfblood is a fantasy teen drama television series targeted at a young audience. Created by Debbie Moon, it is a co-production between CBBC and ZDF/ZDFE. The television series revolves around the life of the species known as wolfbloods. They are creatures that have enhanced senses and look like humans but can turn into wolves at will. Their transformation is uncontrolled during a full moon, and they are at their weakest during \"the dark of the moon\", at a new moon. The television series focuses on their daily life and the challenges that they face to hide their secret. Each series has new characters and concepts.", "Wolfblood was created after series creator Debbie Moon, during a visit to a bookshop, saw the words \"wolf\" in one book title and \"blood\" in another and blended them together. The series was commissioned after the BBC Writersroom website announced an open call for children's drama scripts. Moon was among eight writers taken to a conference centre in Kent, and, after a few days of intensive development, it became one of two new original children's dramas to be commissioned by CBBC. The series was filmed in the north-east of England by the same crew who filmed Tracy Beaker Returns. Early series filming locations included Hookergate School and the woods of the surrounding Rowlands Gill countryside, from series 4 onwards the filming moved to at Heworth Grange Comprehensive in East Gateshead (Hawthorn Comprehensive in the series) and the areas around Windy Nook and Newcastle.", "|Debbie Moon", "|Debbie Moon, Matthew Evans, and Foz Allan", "|Debbie Moon", "|Debbie Moon, Jonathan Wolfman, and Sallie Aprahamian"]}, {"page": "Twisted Showcase", "response": ["A fourth series was slated for release in 2016 with an episode called \"Muscle Memory\" written by Debbie Moon and an episode featuring Gareth David-Lloyd's directorial debut. The fourth season did not end up premiering until October 2017 with the episode, \"Be My Head.\""]}]}}