{"wiki_id": "http://www.wikidata.org/entity/Q20739029", "itemLabel": "Frank Garnett", "itemDescription": "English cricketer (1881-1933)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Garnett", "wikipedia_page": {"main": "Frank Masterman Garnett (13 September 1881 – 14 November 1933) was an English cricketer who played at first-class level in India in the period just after World War I. He had earlier had a substantial club career for the Liverpool Cricket Club in the Liverpool and District competition, and also appeared in representative matches for Hong Kong (in 1909) and Burma (in 1912).\nGarnett was born in Liverpool, as was his older brother, Harold Gwyer Garnett, who played at first-class level for Lancashire and also briefly for Argentina. He made his senior club debut for Liverpool aged 15, during the 1897 season, and also played for the Clifton College first XI while attending that school. From 1898 to 1906, Garnett was a regular for Liverpool, often playing alongside his brother. He returned for a final season in 1911, in the meantime, having been a resident of Hong Kong. While in that colony, he had played in the November 1909 interport matches, appearing against Shanghai and the Straits Settlements.By December 1912, Garnett was living in Rangoon. Burma was then under British rule, but had not yet been separated from the Raj. While in Rangoon, he played twice for Burmese teams against a touring side from British Ceylon (now Sri Lanka) – one match for the Rangoon Gymkhana and one for an All-Burma team, a predecessor of the current Myanmar national side. Batting at number three for Rangoon Gymkhana, behind an ex-first-class player in Basil Eddis, Garnett scored 126, though his century was not enough to prevent his team losing by 38 runs. For All-Burma, making only its second recorded appearance (and first since 1894), he came in fifth in the batting line-up, and scored 81, partnering with FitzAlan Drayson, who scored 137, to help Burma to an innings victory. Garnett remained in Burma until at least as late as December 1914, when he played for Rangoon Gymkhana in the Calcutta Triangular tournament, opening the batting with George Forrester, an ex-Oxford University player.Unlike in most other cricket-playing countries, first-class cricket continued largely unabated in India during the First World War. Garnett made his first-class debut in the 1917–18 edition of the Bombay Quadrangular, scoring a half-century, 54, for the Europeans team against the Parsees. He went on to play matches in three out of the next four tournaments, with his final appearance coming in November 1921, during the 1921–22 edition. Garnett's one other first-class appearance had come in November 1918, when he played for \"England\" against \"India\" in a mock Test match celebrating the signing of the armistice to halt the war. His opening partner in that match was Harry Lee, a future England Test player, although he was the only past or present England Test player in the team. Garnett died in Calcutta in November 1933, aged only 52.", "link_mentions": {}}}