{"wiki_id": "http://www.wikidata.org/entity/Q20707531", "itemLabel": "DanTDM", "itemDescription": "British  gamer and YouTuber", "wikipedia_url": "https://en.wikipedia.org/wiki/DanTDM", "wikipedia_page": {"main": "Daniel Robert Middleton (born 8 November 1991), better known online as DanTDM (formerly TheDiamondMinecart), is an English YouTuber, gamer, musician, author, and actor known for his video game commentaries. His online video channels have covered many video games including Minecraft, Roblox and Pokémon.\nHis channel has been listed among the top YouTube channels in the United Kingdom. In July 2015, he was listed as one of the most popular YouTubers in the world by viewership. He has won several Kids' Choice Awards and set Guinness World Records for his gaming and presenting. In 2017, Middleton topped the Forbes list of Highest-Paid YouTube Stars, earning $16.5 million (about GB£12.2 million) in one year. As of November 2021, his YouTube channel has reached over 25.7 million subscribers, 18 billion video views, and has posted over 3,500 videos.\n\n", "link_mentions": [{"page": "Wellingborough", "response": ["* DanTDM, YouTuber and professional gamer."]}, {"page": "Aldershot", "response": ["* DanTDM (Daniel Robert Middleton), YouTube personality, professional gamer, and author."]}, {"page": "University of Northampton", "response": ["* DanTDM, Minecraft YouTuber"]}, {"page": "Waseem Mirza", "response": ["Mirza’s appearance in the DC Comics Batman origin series Pennyworth as well as a role in the TV Mini Series Witness Data, are both expected in 2022 according to the Internet Movie Database. In addition, his podcast series, FutureTECH, is currently in production with an expected launch in 2022. Mirza is widely known to be an electric car advocate having covered the latest developments in the technology for BBC Television. He reported on Britain's first case of Charge Rage according to the BBC. His electric driving adventure went viral among tech-lifestyle blogs when reporting from a Motorway Service Station in South East Britain. Notably, Mirza is a technology expert and was transported virtually into the videogame Minecraft, as part of a short BBC film about the Professional Gamer and YouTuber - DanTDM.  He appeared visibly sick, when describing on-camera for the BBC, the taste and texture of the world's first edible 3D-printed raspberry. Mirza is a member of the Association of British Science Writers and also Equity, which was formerly known as the British Actor’s Equity Association."]}, {"page": "Let's Play", "response": ["Some of the more popular gamers that create these videos have become Internet celebrities and seen as a type of \"professional fan\", according to Maker Studios' Dar Nothaft; other gamers tune into these videos to get a different perspective on games rather than professional review sources. Felix Kjellberg, known by his online pseudonym PewDiePie, has monetized his \"Let's Play\" videos which reach over 40 million subscribers and over 10 billion views, . PewDiePie's influence on game sales has been considerable, and games that are featured in Let's Plays on his channel frequently see large boosts in sales, creating what is called \"the PewDiePie effect\". Some other people or groups include Achievement Hunter, The Yogscast, Smosh Games, Chuggaaconroy, Jacksepticeye, Markiplier, DanTDM, Game Grumps, Stampylonghead and Machinima.com."]}, {"page": "The Playlist", "response": ["|| DanTDM"]}, {"page": "Ralph Breaks the Internet", "response": ["Additionally, Melissa Villaseñor voices Taffyta Muttonfudge, one of the Sugar Rush racers, replacing Mindy Kaling from the original film; Bill Hader provides the uncredited voice of J. P. Spamley, a personification of clickbait pop-up ads represented as a desperate salesman who can not make a sale; John DiMaggio voices Arthur, an insecurity virus; Sean Giambrone (English YouTuber Daniel Middleton/DanTDM in the UK version, but not on the UK home release) voices eBoy, an eBay employee who informs Ralph of the status on the eBay item deadline; Flula Borg voices Maybe, an algorithm who is an assistant to Yesss; and Dianna Agron voices the news anchor covering the virus in the real world. Ali Wong, Timothy Simons, GloZell Green, and Hamish Blake, respectively, voice Felony, Butcher Boy, Little Debbie, and Pyro, all of whom are other characters in Slaughter Race as Shank's racing crew. The film's directors Rich Moore and Phil Johnston reprise their roles as Sour Bill, Zangief (Moore), and the Surge Protector (Johnston), respectively. YouTube personalities Colleen Ballinger, Dani Fernandez, and Tiffany Herrera also voice cameos, with Nicole Scherzinger having a cameo voice role in a mid-credits scene, too."]}, {"page": "YouTube Rewind", "response": ["|DanTDM"]}, {"page": "Minecraft: Story Mode", "response": ["The player can customize Jesse, including choice of gender and skin tone. Jesse is voiced by Patton Oswalt if male and by Catherine Taber if female. Other main characters within the Minecraft: Story Mode world include Jesse's friends Petra (voiced by Ashley Johnson), Axel (Brian Posehn), Olivia (Martha Plimpton), Lukas (Scott Porter), and Jesse's pet pig, Reuben (Dee Bradley Baker). The first season features several characters in supporting roles, including the Order of the Stone—Gabriel (Dave Fennoy), Magnus (Corey Feldman), Ellegaard (Grey Griffin), Soren (John Hodgman) and Ivor (Paul Reubens), the latter of whom becomes a main character from episode five onwards—former Ocelot member and Blaze Rods leader Aiden (Matthew Mercer); the ruler of Sky City, the Founder (Melissa Hutchison); Milo (Jim Meskimen), the leader of an underground building club; Minecraft YouTubers CaptainSparklez, DanTDM, LDShadowLady, Stampy Cat and Stacy Plays (all played by themselves); Torque Dawg (Adam Harrington); Cassie Rose/The White Pumpkin (Ashly Burch); the super-computer PAMA (Jason 'jtop' Topolski); its creator and former Old Builder Harper (Yvette Nicole Brown); the warrior Emily (Audrey Wasilewski); and the Old Builders—Hadrian (Jim Cummings), Mevia (Kari Wahlgren) and Otto (Jamie Alcroft)."]}, {"page": "The Diamond Minecart", "response": ["#REDIRECT DanTDM"]}]}}