{"wiki_id": "http://www.wikidata.org/entity/Q2073259", "itemLabel": "Augustine Webster", "itemDescription": "English martyr", "wikipedia_url": "https://en.wikipedia.org/wiki/Augustine_Webster", "wikipedia_page": {"main": "Augustine Webster (died 4 May 1535) was an English Catholic martyr. He was the prior of Our Lady of Melwood, a Carthusian house at Epworth, on the Isle of Axholme, in north Lincolnshire, in 1531. His feast day is 4 May.", "link_mentions": [{"page": "1535", "response": ["** Saint Augustine Webster, Prior of the London Charterhouse"]}, {"page": "Saint Augustine (disambiguation)", "response": ["* Augustine Webster, English Catholic martyr"]}, {"page": "Oath of Supremacy", "response": ["*Augustine Webster"]}, {"page": "Richard Reynolds", "response": ["Reynolds was arrested and imprisoned in the Tower of London around the middle of April 1535, along with the Carthusian priors John Houghton,Wainewright, John. \"Blessed John Houghton.\" The Catholic Encyclopedia. Vol. 8. New York: Robert Appleton Company, 1910. 3 February 2014 Robert Lawrence and Augustine Webster (a monk of Sheen Priory in Richmond). All four were tried for the denial of the royal supremacy."]}, {"page": "Forty Martyrs of England and Wales", "response": ["* Saint Augustine Webster"]}, {"page": "John Houghton (martyr)", "response": ["However, in 1535, the community was called upon to make the new oath as prescribed by the 1534 Act of Supremacy, which recognised Henry as the Supreme Head of the Church of England. Again, Houghton, this time accompanied by the heads of the other two English Carthusian houses (Robert Lawrence, Prior of Beauvale, and Augustine Webster, Prior of Axholme), pleaded for an exemption, but this time they were summarily arrested. They were called before a special commission in April 1535, and sentenced to death, along with Richard Reynolds, a monk from Syon Abbey."]}, {"page": "List of people executed by the Tudors", "response": ["|Augustine Webster"]}, {"page": "Maurice Chauncy", "response": ["In consequence of their refusal, on 4 May 1535, along with the Bridgettine monk Richard Reynolds, the three Carthusian Priors of London, Beauvale and Axholme, John Houghton, Robert Lawrence and Augustine Webster went to their deaths, and during the next five years fifteen of the London Carthusians perished on the scaffold or were starved to death in Newgate gaol."]}, {"page": "John Rochester (martyr)", "response": ["The government was at first anxious to secure the public acquiescence of the monks of the London Charterhouse regarding royal supremacy in ecclesiastical matters, since for the austerity and sincerity of their mode of life they enjoyed great prestige. Having failed in this, the only alternative was to annihilate the resistance since a refusal engaged the prestige of the monks in the opposite sense. On 4 May 1535 the authorities sent to their death at Tyburn Tree three leading English Carthusians, John Houghton, prior of the London house, Robert Lawrence and Augustine Webster, respectively priors of Beauvale and Axholme. Little more than a month later, it was the turn of three leading monks of the London house: Humphrey Middlemore, William Exmew and Sebastian Newdigate, who were to die at Tyburn Tree on 19 June. This process of attrition was to claim as its victims no less than fifteen of the London Carthusians."]}, {"page": "William Exmew", "response": ["The Crown was at first anxious to secure the public acquiescence of the monks of the London Charterhouse in the matter of the break with Rome, since for the austerity and sincerity of their mode of life they enjoyed great prestige. When there was unexpected resistance, the only alternative was terror. On 4 May 1535 the authorities sent to their death at Tyburn Tree three leading English Carthusians, Doms John Houghton, prior of the London house, Robert Lawrence and Augustine Webster, respectively priors of Beauvale and Axholme."]}, {"page": "Humphrey Middlemore", "response": ["In the following year, on 4 May 1535, the authorities sent to their death at Tyburn Tree for refusal to take the new Oath of Supremacy, three leading English Carthusians, first among them John Houghton, prior of the London house, but also Robert Lawrence and Augustine Webster, respectively priors of Beauvale and Axholme. This led to Middlemore becoming vicar of the community."]}, {"page": "Sebastian Newdigate", "response": ["In 1534 Henry VIII required his subjects to take the Oath of Succession recognizing Anne Boleyn as his lawful wife. Newdigate signed the oath \"in as far as the law of God permits\" on 6 June 1534. However the Carthusian community at the Charterhouse refused to accept the King's assumption of supremacy over the English church, and on 4 May 1535 the Prior of the Charterhouse, John Houghton, was executed, together with two other Carthusian priors, Robert Lawrence and Augustine Webster, priors respectively of Beauvale and Axholme."]}, {"page": "Carthusian Martyrs of London", "response": ["On 4 May 1535 the authorities sent to their death at Tyburn, London three leading English Carthusians, Doms John Houghton, prior of the London house, Robert Lawrence and Augustine Webster, respectively priors of Beauvale and Axholme, along with a Bridgettine monk, Richard Reynolds of Syon Abbey and a secular priest John Haile.Turley, K.V., \"The London Charterhouse: Murder, Plague and Martyrdom\", National Catholic Register, March 12, 2018", "*Saint Augustine Webster, prior of Axholme Charterhouse, executed at Tyburn, London, on 4 May 1535."]}, {"page": "List of Catholic martyrs of the English Reformation", "response": ["# Augustine Webster, Prior of the Axholme Charterhouse, 4 May 1535", "* Augustine Webster"]}, {"page": "Augustine Webster (Saint)", "response": ["#REDIRECT Augustine Webster"]}, {"page": "List of Catholic saints", "response": ["| Augustine Webster"]}, {"page": "Catholic Church in the United Kingdom", "response": ["* Augustine Webster – (d. 1535), Professed Priest of the Carthusians"]}, {"page": "Saint Augustine Webster", "response": ["#REDIRECT Augustine Webster"]}, {"page": "Category talk:British saints", "response": ["Augustine WebsterStub"]}, {"page": "Category talk:Ancient Christian denominations", "response": ["Augustine WebsterStub"]}, {"page": "1530s in England", "response": ["** 4 May – John Houghton, Robert Lawrence, Augustine Webster, Prior and monks of the London Charterhouse, along with Richard Reynolds, Bridgettine monk of Syon (executed)"]}, {"page": "Chronological list of saints and blesseds in the 16th century", "response": ["|Augustine Webster|| || ||1535|| ||"]}, {"page": "Axholme Charterhouse", "response": ["The prior, Saint Augustine Webster, was imprisoned in the Tower of London in 1535 for refusing the Oath of Supremacy and later martyred and canonised.", "*Augustine Webster, 1535"]}, {"page": "St. Augustine Webster", "response": ["#REDIRECT Augustine Webster"]}, {"page": "Carthusian Martyrs", "response": ["In 1537 during the English Reformation the London Charterhouse was dissolved and its members imprisoned and later executed. Eighteen of these, the Carthusian Martyrs of London, were beatified in 1886 by Pope Leo XIII; three of these (Augustine Webster, John Houghton and Robert Lawrence) were canonized in 1970 by Pope Paul VI with other English martyrs as the Forty Martyrs of England and Wales."]}, {"page": "October 1970", "response": ["*The Forty Martyrs of England and Wales, Roman Catholic men and women who had been executed during the English Reformation between 1535 and 1679, were canonized as saints in the Roman Catholic Church by Pope Paul VI.  \"Pope Canonizes British Martyrs\", The New York Times, October 26, 1970, p. 8  On May 4, 1535, John Houghton, Robert Lawrence, Augustine Webster and Richard Reynolds had been the first to be put to death."]}]}}