{"wiki_id": "http://www.wikidata.org/entity/Q2074083", "itemLabel": "Peter Boyle", "itemDescription": "British film editor", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Boyle_(film_editor)", "wikipedia_page": {"main": "Peter Boyle (born 27 May 1946) is an English film editor with more than 30 feature film credits. His work on the film The Hours (2002) was nominated for the Academy Award, the BAFTA Award, and the ACE Eddie, and other honors.Boyle is a graduate of Bradfield College, and began his career working with director Richard Lester. After more than a decade of work as an assistant on feature films and editing commercials, his first credit as editor of a feature film was for McVicar in 1980. He has worked regularly on features and television films since then. From 1988 through 2006, Boyle edited five of the films directed by Kevin Reynolds.\nBoyle has been elected as a member of the American Cinema Editors.Boyle's editing of The Hours (directed by Stephen Daldry, 2002) was honored by numerous nominations for \"best editing\" of 2002 films. Critic Bob Grimm wrote that the film's editing \"is a minor film miracle\". Karen Pearlman selected the film as a case study for her 2016 book on film editing, Cutting Rhythms: Intuitive Film Editing.", "link_mentions": [{"page": "Academy Award for Best Film Editing", "response": ["| Peter Boyle"]}, {"page": "75th Academy Awards", "response": ["**The Hours – Peter Boyle"]}, {"page": "Inseminoid", "response": ["Inseminoid was shot on 35 mm Eastman Kodak film with anamorphic lenses. Warren remembered that this format produced an \"incredibly sharp image and what I would term as the 'American' look.\" The film was brightened during post-production following concerns that it would be harder to sell to television broadcasters if it appeared too dimly lit. Cuts were made to some of the more graphic shots of Sandy giving birth to ensure that the film would not be rejected by the British Board of Film Censors (BBFC). According to Warren, editor Peter Boyle \"had a natural feel for the material and managed to create just the right pace and rhythm throughout the film.\" The title sequence was produced by Oxford Scientific Films."]}, {"page": "56th British Academy Film Awards", "response": ["* The Hours – Peter Boyle"]}, {"page": "BAFTA Award for Best Editing", "response": ["| The Hours || Peter Boyle"]}, {"page": "List of film director and editor collaborations", "response": ["* Kevin Reynolds: Peter Boyle (1988–2006), Tristan & Isolde (2006)."]}, {"page": "Peter Boyle (disambiguation)", "response": ["Peter Boyle (1935–2006) was an American actor.", "Peter Boyle  may also refer to:", "* Peter Boyle (footballer, born 1876) (1876–1939), Irish footballer", "* Peter Boyle (footballer, born 1951), Scottish footballer", "* Peter Boyle (Gaelic footballer), Gaelic football goalkeeper for Donegal", "* Peter Boyle (epidemiologist) (born 1951), Scottish epidemiologist", "* Peter Boyle (film editor) (born 1946), English film editor", "* Peter Boyle (poet) (born 1951), Australian poet"]}, {"page": "List of British Academy Award nominees and winners", "response": ["|Peter Boyle"]}, {"page": "List of accolades received by The Hours", "response": ["During the Berlin International Film Festival, Kidman, Moore and Streep tied for the Silver Bear for Best Actress. Film editor Peter Boyle received an American Cinema Editors nomination for his work, and casting director Daniel Swee won the Casting Society of America's Best Drama Film Casting accolade. The Deutscher Filmpreis awarded The Hours Best Foreign Film, while the GLAAD Media Awards named it Outstanding Wide Release Film. Moore earned a Best Actress award from the Los Angeles Film Critics Association, while Streep was given the award for Best Performance by an Actress in a Leading Role from Outfest, an LGBT-oriented film festival."]}, {"page": "American Cinema Editors Award for Best Edited Feature Film – Dramatic", "response": ["| The Hours || Peter Boyle"]}]}}