{"wiki_id": "http://www.wikidata.org/entity/Q20739384", "itemLabel": "Thomas Parker", "itemDescription": "English electrical engineer and inventor", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Parker_(inventor)", "wikipedia_page": {"main": "Thomas Parker  (22 December 1843 – 5 December 1915) was an English electrical engineer, inventor and industrialist. He patented improvements in lead-acid batteries and dynamos, and was a pioneer of manufacturing equipment that powered electric tramways and electric lighting. He invented the smokeless fuel Coalite. He formed the first company to distribute electricity over a wide area.\nHe was described by Lord Kelvin as \"the Edison of Europe\".\n\n", "link_mentions": [{"page": "1884", "response": ["* Thomas Parker built a practical production electric car in Wolverhampton using his own specially designed high-capacity rechargeable batteries."]}, {"page": "Timeline of transportation technology", "response": ["*1884 - Thomas Parker built a practical production electric car in Wolverhampton using his own specially designed high-capacity rechargeable batteries."]}, {"page": "List of inventors", "response": ["*Thomas Parker (1843–1915), England – electric car"]}, {"page": "Ironbridge", "response": ["*Thomas Parker (1843-1915), electrical engineer and inventor, had his last home at Severn House, Ironbridge, from 1908.Report by Toby Neal, title refers to Thomas Parker day being held 10 October 2015, organized by Madeley Living History Group."]}, {"page": "Thomas Parker", "response": ["Thomas Parker may refer to:", "* Thomas Parker (died 1570) (c. 1510–1570), for Norwich", "* Thomas Parker (died 1558) (by 1519–1558), MP for Cricklade", "* Thomas Parker (died 1580), (by 1527–1580), MP for East Grinstead", "* Sir Thomas Parker (died 1663), MP for Hastings, Seaford and Suffok", "* Thomas Parker, 1st Earl of Macclesfield (1666–1732), English Whig politician", "* Thomas Parker, 6th Earl of Macclesfield (1811–1896), British peer, formerly Conservative MP for Oxfordshire, 1837–1841", "* Thomas Parker, 3rd Earl of Macclesfield (1723–1795), British peer and politician", "* Thomas Parker (rugby league), Welsh rugby league footballer of the 1920s and 1930s", "* Thomas Parker (rower) (1883–?), Australian rower", "* Thomas Parker (footballer) (1907–1964), English footballer", "* Thomas Parker (cricketer) (1845–1880), English-born New Zealand cricketer", "* Thomas Parker (minister) (1595–1677), English nonconforming clergyman and founder of Newbury, Massachusetts", "* Thomas Parker (deacon) (1605–1683), founder of Reading, Massachusetts and deacon of the 12th Congregational Church", "* Sir Thomas Parker (judge) (1695–1784), Chief Baron of the Exchequer", "* Thomas Parker (soldier, born 1753) (1753–1820), American soldier", "* Thomas Parker (engineer) (1843–1916), British railway engineer", "* Thomas Parker (inventor) (1843–1915), British electrical engineer and inventor", "* Thomas Parker (Maine judge) (1783–1860), judge, writer, philanthropist", "* Thomas Parker (district attorney) (1760–1820), U.S. District Attorney for South Carolina 1792–1820; resided in Charleston, South Carolina", "* Thomas Parker (soldier, born 1822), Union Army soldier and Medal of Honor recipient"]}, {"page": "History of the electric vehicle", "response": ["English inventor Thomas Parker, who was responsible for innovations such as electrifying the London Underground, overhead tramways in Liverpool and Birmingham, and the smokeless fuel coalite, built the first production electric car in Wolverhampton in 1884, although the only documentation is a photograph from 1895.", "|1884||align=left|Thomas Parker built a practical production electric car in Wolverhampton using his own specially designed high-capacity rechargeable batteries."]}, {"page": "History of the automobile", "response": ["Sources point to different creations as the first electric car. Between 1832 and 1839 (the exact year is uncertain) Robert Anderson of Scotland invented a crude electric carriage, powered by non-rechargeable primary cells. In November 1881, French inventor Gustave Trouvé demonstrated a working three-wheeled car powered by electricity at the International Exposition of Electricity, Paris. English inventor Thomas Parker, who was responsible for innovations such as electrifying the London Underground, overhead tramways in Liverpool and Birmingham, and the smokeless fuel coalite, built the first production electric car in London in 1884, using his own specially designed high-capacity rechargeable batteries. However, others regard the Flocken Elektrowagen of 1888 by German inventor Andreas Flocken as the first true electric car."]}, {"page": "Parker (surname)", "response": ["*Thomas Parker (disambiguation) (numerous people share this name), including:", "**Thomas Parker, 1st Earl of Macclesfield", "**Thomas Parker (engineer), British locomotive engineer", "**Thomas Parker (inventor), British inventor and industrialist"]}, {"page": "Albert Edward Bridge", "response": ["Opened on 1 November 1864 and named after the Prince of Wales (later Edward VII), its design is almost identical to Victoria Bridge which carries the Severn Valley Railway over the Severn between Upper Arley and Bewdley in Worcestershire.  Designed by John Fowler, its  span cast iron arch has four ribs, each of nine parts bolted together. The patterns for the radiused beam castings for the bridge were prepared by Thomas Parker at the Coalbrookdale Iron Company. Originally it was built to carry the Wenlock, Craven Arms and Lightmoor Extension Railway of the Wellington and Severn Junction Railway across the river. Until the closure of Ironbridge power station it carried coal traffic as part of the line between Lightmoor Junction and Ironbridge Power Station."]}, {"page": "Thomas Parker (engineer)", "response": ["Thomas Parker (11 July 1829 – 25 November 1903)Thomas Parker (1829-1903) Grace's Guide, accessed 29 July 2015. was Locomotive, Carriage and Wagon Superintendent of the Manchester, Sheffield and Lincolnshire Railway from 1886–1893. He introduced a new type of locomotive in Britain, which used a Belpaire firebox."]}, {"page": "Electric car", "response": ["Robert Anderson is often credited with inventing the first electric car some time between 1832 and 1839 but the first practical electric cars were produced in the 1880s. In November 1881, Gustave Trouvé presented an electric car at the Exposition internationale d'Électricité de Paris. In 1884, over 20 years before the Ford Model T, Thomas Parker built a practical production electric car in Wolverhampton using his own specially designed high-capacity rechargeable batteries, although the only documentation is a photograph from 1895 (see below). The Flocken Elektrowagen of 1888 was designed by German inventor Andreas Flocken and is regarded as the first real electric car."]}, {"page": "Battery electric vehicle", "response": ["In 1884, Thomas Parker built a practical production electric car in Wolverhampton using his own specially designed high-capacity rechargeable batteries."]}, {"page": "Coalite", "response": ["Coalite is a brand of low-temperature coke used as a smokeless fuel.  The title refers to the residue left behind when coal is carbonised at . It was invented by Thomas Parker in 1904. In 1936 the Smoke Abatement Society awarded its inventor a posthumous gold medal."]}, {"page": "James Kemnal", "response": ["In 1915, he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Sir Archibald Denny, Thomas Parker, Alexander Cleghorn, and James Currie."]}, {"page": "December 1915", "response": ["* Died: Thomas Parker, English engineer, known for his advances in battery technology and the invention of coalite (b. 1843)"]}, {"page": "St Michael's Church, Madeley", "response": ["The churchyard contains several cast iron tombstones, including those of J. W. Fletcher (died 1785) and Robert Richard Anstice (died 1853),Church of St Michael, edited by Historic England a stone tombstone of Thomas Parker (inventor)Report by Toby Neal, mentioning commemorative Thomas Parker Day on 10 October 2015 and restoration project for the grave. and the war graves of seven British Army soldiers of World War I and two soldiers and an airman of World War II. CWGC Cemetery report, details obtained from casualty record. The churchyard is also the resting place of the Nine Men of Madeley—miners, of whom the youngest was aged 12 years, who lost their lives at the Brick Kiln Leasow ironstone mine in 1864."]}, {"page": "Electric motorsport", "response": ["English inventor Thomas Parker, who was responsible for innovations such as electrifying the London Underground, overhead tramways in Liverpool and Birmingham, and the smokeless fuel coalite, built the first production electric car in London in 1884, using his own specially designed high-capacity rechargeable batteries. Parker's long-held interest in the construction of more fuel-efficient vehicles led him to experiment with electric vehicles. He also may have been concerned about the malign effects smoke and pollution were having in London."]}]}}