{"wiki_id": "http://www.wikidata.org/entity/Q20714062", "itemLabel": "Stewart Lines", "itemDescription": "British racing driver (born 1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stewart_Lines", "wikipedia_page": {"main": "Stewart Lines (born 7 June 1963) is a British racing driver currently competing in the 2019 Britcar Endurance Championship. He has also raced in the British Touring Car Championship, made his debut in 2015.", "link_mentions": [{"page": "Mat Jackson", "response": ["In a rare outing in 2018, Jackson raced with former-BTCC driver Stewart Lines in the Dunlop Endurance Championship in a SEAT Cupra TCR for Maximum Motorsport at round three at Oulton Park in June. They failed to finish the first race completing only 15 laps and in they were later disqualified from race two.http://tsl-timing.com/file/?f=EERC/2018/182563bce.pdf"]}, {"page": "Lines (surname)", "response": ["*Stewart Lines (born 1963), British racing driver"]}, {"page": "Vincent Radermecker", "response": ["|align=\"left\"|  Mathieu Detry Stewart Lines Stéphane Perrin "]}, {"page": "Lea Wood", "response": ["For 2015, Wood moved into team management and driver coaching, running Stewart Lines in the Toyota Avensis."]}, {"page": "2007 Renault Clio Cup United Kingdom", "response": ["|  Stewart Lines", "|align=left|  Stewart Lines"]}, {"page": "Adam Morgan (racing driver)", "response": ["In 2018, Morgan raced in the Dunlop Endurance Championship with former-BTCC driver Stewart Lines in a Class 4E (Endurance) SEAT Cupra TCR run by Maximum Motorsport. They positioned 10th on the grid in race one at Rockingham, 2nd in Class 4E. They finished 14th in race one, 2nd in class and had the fastest lap in Class 2E. In the Endurance race 2, Lines and Morgan finished in 5th, 2nd in Class 4E, and set the fastest lap again. In round two at Silverstone, the SEAT placed 16th on the grid for race one, 2nd in Class 4E again. In race one, they finished 13th, 2nd in Class 4E. In the Endurance race at Silverstone, the SEAT duo finished 3rd in the race, 1st in Class 4E for the first time, setting the fastest lap once again."]}, {"page": "2007 SEAT Cupra Championship", "response": ["|  Stewart Lines", "|align=left|  Stewart Lines"]}, {"page": "2015 British Touring Car Championship", "response": ["|style=\"background:#ccffcc;\"|  Stewart Lines", "* Ex-motocross rider Stewart Lines will make his BTCC debut with Houseman Racing, having previously raced in the Mini Challenge, Volkswagen Cup and the SEAT Cupra Championship.", "|align=left|  Stewart Lines", "|align=left|  Stewart Lines", "|align=left|  Stewart Lines"]}]}}