{"wiki_id": "http://www.wikidata.org/entity/Q2073242", "itemLabel": "Pete Chilver", "itemDescription": "British jazz musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Pete_Chilver", "wikipedia_page": {"main": "Peter William Chilver (19 October 1924 – 16 March 2008) was a British jazz guitarist and hotelier. Chilver is credited with having helped establish the electric guitar in Britain, encouraged by Trinidadian guitarist Lauderic Caton.\n\n", "link_mentions": [{"page": "Ronnie Scott", "response": [":Ronnie Scott (tenor sax), Johnny Dankworth (alto sax), Hank Shaw (trumpet), Tommy Pollard (piano), Pete Chilver (guitar), Joe Muddel (double bass), Laurie Morgan (drums), Alan Dean (vocal)"]}, {"page": "Lauderic Caton", "response": ["Lauderic Caton (31 August 1910 – 19 February 1999) was a Trinidadian guitarist who settled in Britain in 1940. He was an early proponent of the use of electric guitar in Britain, particularly in jazz music.Val Wilmer, \"Lauderic Caton\", The New Grove Dictionary of Jazz online. According to Val Wilmer, \"he exercised a significant influence on Pete ChilverVal Wilmer, \"Obituary: Peter Chilver\", The Guardian, 23 June 2008. and Dave Goldberg, the two jazz guitarists more generally credited as British pioneers of the amplified instrument, while his students, official and unofficial, ranged from jazz exponents to the Nigerian highlife specialist Ambrose Campbell and Hank Marvin of the Shadows.\""]}, {"page": "1924 in jazz", "response": ["* 19 – Pete Chilver, British guitarist and hotelier (died 2008)."]}, {"page": "2008 in jazz", "response": ["* 16 – Pete Chilver, British guitarist and hotelier (born 1924)."]}, {"page": "List of years in jazz", "response": ["* 2008 in jazz, deaths of Alfred Gallodoro, Allan Ganley, Anca Parghel, Arne Domnérus, Bheki Mseleku, Bill Finegan, Bill Saragih, Bob Florence, Bobby Durham, Bobby Tucker, Byrdie Green, Cachao López, Chalmers Alford, Campbell Burnap, Chris Anderson, Connie Haines, Danny Moss, Dave McKenna, Dennis Irwin, Derek Wadsworth, Dick Charlesworth, Dick Sudhalter, Earl Palmer, Eartha Kitt, Eivind Solberg, Esbjörn Svensson, Franz Jackson, Freddie Hubbard, Gene Allen, Géo Voumard, Gerald Wiggins, Guy Warren, Hal Stein, Harald Heide-Steen Jr., Henri Salvador, Henry Adler, Hiram Bullock, Humphrey Lyttelton, Irene Reid, Jackie Orszaczky, Jeff Healey, Jerry Wexler, Jim Aton, Jimmy Carl Black, Jimmy Cleveland, Jimmy Giuffre, Jimmy Gourley, Jimmy McGriff, Joe Beck, John Brunious, Johnny Griffin, Keith Smith, Kenny Cox, Lee Young, LeRoi Moore, Marc Moulin, Mario Schiano, Merl Saunders, Miles Kington, Miriam Makeba, Monty Waters, Nat Temple, Neal Hefti, Page Cavanaugh, Patti Bown, Pekka Pohjola, Pete Candoli, Pete Chilver, Phil Urso, Pierre Van Dormael, Prince Lasha, Ray Ellis, Richard Wright, Ronnie Mathews, Salah Ragab, Steve Harris, Teo Macero, Tommy McQuater, Tony Reedus, Verne Byers, Walt Dickerson, and Yusuf Salim.", "* 1924 in jazz, death of Black Benny; births of Al Haig, Alice Babs, Armando Peraza, Arne Domnérus, Beryl Davis, Bill Perkins, Blossom Dearie, Bob Bain, Bobby Rosengarden, Brew Moore, Bruno Canfora, Bud Powell, Charlie Rouse, Chet Atkins, Chuck Higgins, Coco Schumann, Corky Corcoran, Denny Wright, Dick Buckley, Dick Cathcart, Dick Katz, Dick Marx, Dinah Kaye, Dinah Washington, Earl Palmer, Frances Wayne, Gary Chester, George Wallington, Gil Cuppini, Hal McKusick, Henry Mancini, Herbie Lovelle, J. J. Johnson, Jackie Paris, Jacky June, Jacques Pelzer, Jesse Drakes, Jimmy Cheatham, Jimmy Roberts, Jiří Šlitr, Joe Albany, Joya Sherrill, Kenny Dorham, Lammar Wright Jr., Louie Bellson, Lucky Thompson, Major Holley, Marshall Allen, Marty Flax, Mat Mathews, Max Roach, Nunzio Rotondo, Orlando DiGirolamo, Oscar Valdambrini, Paul Desmond, Pete Chilver, Pupo De Luca, Putte Wickman, Ray Wetzel, Rita Reys, Roger Williams, Rudy Pompilli, Rudy Van Gelder, Ruth Olay, Sam Jones, Sammy Nestico, Sarah Vaughan, Shorty Rogers, Shotaro Moriyasu, Sonny Stitt, Stewart \"Dirk\" Fischer, Teddy Edwards, Teddy Riley, Terry Gibbs, Tom Talbert, Vojislav Simic, and Wilbur Harden."]}]}}