{"wiki_id": "http://www.wikidata.org/entity/Q2078689", "itemLabel": "Peter Tobin", "itemDescription": "Scottish serial killer", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Tobin", "wikipedia_page": {"main": "Peter Britton Tobin (born 27 August 1946) is a Scottish convicted serial killer and sex offender who is currently serving a whole life order at HM Prison Edinburgh for three murders committed between 1991 and 2006. In addition to these three murders, police believe Tobin is responsible for other deaths.Prior to his first murder conviction, Tobin served ten years in prison for a double rape committed in 1993, following which he was released in 2004. Three years after his release, he was sentenced to life with a minimum of twenty-one years for the rape and murder of Angelika Kluk in Glasgow in 2006. Remains of two teenagers who went missing in 1991 were subsequently found at his former home in Margate, Kent. Tobin was convicted of the murder of Vicky Hamilton in December 2008, resulting in his minimum sentence being increased to thirty years, and of the murder of Dinah McNicol in December 2009, resulting in a whole life order.\nTobin has been labelled a psychopath by a senior psychologist and it was thought he might be connected with the Bible John murders of the late 1960s, although police eventually ruled him out of the murders. Tobin has himself reportedly boasted in prison of having murdered a total of 48 people.", "link_mentions": [{"page": "List of Scots", "response": ["* Peter Tobin (born 1946), convicted serial killer and sex offender"]}, {"page": "List of serial killers by country", "response": ["*Peter Tobin: rapist and killer of at least three women in Scotland and England between 1991 and 2006; sentenced to life in prison."]}, {"page": "List of prisoners with whole-life orders", "response": ["!data-sort-value=\"Tobin, Peter\"|Peter Tobin"]}, {"page": "Johnstone", "response": ["* Peter Tobin – serial killer, born in Johnstone in 1946"]}, {"page": "Barrowland Ballroom", "response": ["Between 1968 and 1969, three young women (Patricia Docker, Jemima McDonald and Helen Puttock) were found brutally murdered after nights out at the Barrowland. All three murders were attributed to a man dubbed \"Bible John\" by police after he was heard referring to the Old Testament to one of his victims. Similarities between the murders led police to believe that they were the work of the same man. The man made contact with all three women at the Barrowland Ballroom, before escorting them home and raping and strangling them within yards of their doorsteps. All three women were menstruating and their handbags were stolen. An investigation failed to find Bible John, and the murders remain unsolved. On the night of the murder of Helen Puttock, Puttock's sister Jeannie Langford was with her and spoke to her sister's suspected killer. Jeannie described Bible John as: \"25-35 years old, reddish/fair hair, wore a blue suit and matching trousers with white shirt. Spoke very politely and was very religious\". In 2007, following the murder of Angelica Kluk, speculation arose that serial killer Peter Tobin was Bible John, due to similarities in modus operandi. Tobin frequented the Barrowland regularly, and moved to Brighton in late 1969 when the killings ended."]}, {"page": "Bible John", "response": ["This unidentified serial killer became known as Bible John due to his having repeatedly quoted from the Bible and to have condemned any form of adultery while in the company of his final victim. The known movements and modus operandi of convicted serial killer and rapist Peter Tobin gave rise to speculation that he might be Bible John, after his conviction for three murders in the late 2000s. Police have since eliminated Tobin from their enquiries.", "===Peter Tobin===", "Several criminologists and investigators have speculated that convicted serial killer Peter Tobin may have been Bible John. Tobin was convicted, in May 2007, of the 2006 murder of Polish student Angelika Kluk, who had been raped, beaten and then stabbed to death; he had relocated from Shettleston, Glasgow, to England in August 1969 (before the final two murders committed by Bible John) after marrying his first wife, whom he had met at the Barrowland Ballroom in 1968. From August 1969 Tobin lived in Brighton for 20 years, and from the late 1980s he would alternately reside in either Scotland or the south of England.", "Some contemporary visual similarities exist between Peter Tobin when aged in his 20s and the 1969 composite drawing of Bible John, although the composite drawing showed Bible John with red hair and contemporary pictures of Tobin show he did not have this hair colour. In addition, all three of Tobin's former wives have given accounts of being repeatedly imprisoned, throttled, beaten and raped at his hands, and each has stated he had been driven to extreme physical violence by the female menstrual cycle (a factor long suspected by investigators as being the perpetrator's actual motive behind the murders). In addition, Tobin is known to have been a staunch Roman Catholic with strong religious views, and the alias Bible John may have given to Jean Langford and Helen Puttock in 1969 is similar to one of the pseudonyms known to have been regularly used by Tobin: John Semple.", "Although DNA testing has been used to clear several suspects, detectives believe obtaining a forensic link between Peter Tobin and any of the murder victims linked to Bible John is unlikely, due to the deterioration of the physical samples, owing to poor storage.", "The sole witness ever to have engaged in a lengthy conversation with Bible John, Jean Langford, died in September 2010 at the age of 74. Langford had given police the description used to form the second composite drawing created of the suspect, which continues to remain the most significant clue as to the perpetrator's physical appearance. Despite Professor Wilson's assertion that Peter Tobin may have been Bible John, when Jean Langford discussed her sister's murderer many decades later, she dismissed this theory, stating emphatically that Tobin had not been the man with whom she had shared a taxi on the night of her sister's murder.", "* STV has broadcast a 45-minute documentary focusing upon the murders committed by Bible John. This documentary, titled In Search of Bible John, was initially broadcast in 2011, and explores the possibility Peter Tobin may have been the perpetrator of the three murders."]}, {"page": "List of serial killers by number of victims", "response": ["| Peter Tobin"]}, {"page": "Sex offender", "response": ["* Peter Tobin: British criminal with a long record, including convictions for two rapes, who was convicted of the rape and murder of a female Polish student in 2007. After this conviction, he was found guilty of the murders of two teenage girls who disappeared in 1991, and has reportedly claimed to have killed more than  40 other people."]}, {"page": "Kent Police", "response": ["In November of 2007, Kent Police and Essex Police began a search of serial killer Peter Tobin's former home in Irvine Drive, Margate. Two bodies were located, recovered, and later identified as those of Vicky Hamilton, who went missing from Falkirk in February 1991, and Dinah McNicol, who went missing from Tillingham in August of 1991. Tobin was convicted in December of 2008 for murdering Hamilton and convicted in December of 2009 for murdering McNicol."]}, {"page": "List of people from Brighton and Hove", "response": ["*Peter Tobin (born 1946), serial killer, lived in Brighton in the 1970s and 1980s"]}, {"page": "David Hayman", "response": ["In 2009, Hayman appeared in an episode of the BBC series Robin Hood. In September 2011, Hayman hosted a documentary reconstructing the unsolved murders of Glasgow serial killer Bible John, who murdered three young woman in the late 1960s. The documentary was named In Search of Bible John, and looked at the evidence which links Peter Tobin to the killings. "]}, {"page": "Donald Findlay", "response": ["A combination of high-profile controversies, acute legal skills and a well-cultivated image has generated Findlay a lot of coverage in the Scottish press in recent years and he now has one of the highest legal profiles in Scotland and widely considered to be Scotland's premier criminal law advocate. He took silk, becoming a Queen's Counsel in 1988, but his behaviour has been censured by the Faculty of Advocates on more than one occasion (see below). He has served as a defence lawyer in many high-profile murder cases including Jodi Jones, Mark Scott and the Kriss Donald murder trials. He represented Peter Tobin, the murderer of Angelika Kluk in the so-called \"body in the church\" case..Tobin guilty of Angelika's murder, BBC News Findlay is a member of the Optimum Advocates."]}, {"page": "David Wilson (criminologist)", "response": ["Wilson has advised various police forces as a criminologist, and in 2006 was also involved in the Ipswich serial murder case, as an advisor to Sky News.  Subsequently, Steve Wright was arrested and prosecuted for this series of murders. Wilson co-authored a book with the former Sky broadcast journalist Paul Harrison about their experiences on this case. Wilson also approached convicted murderer Peter Tobin to discuss the Bible John killings, but did not secure a meeting with Tobin. "]}, {"page": "HM Prison Edinburgh", "response": ["* Peter Tobin - Sentenced to life imprisonment with a whole life order for the murders of Angelika Kluk, Vicky Hamilton and Dinah McNicol."]}, {"page": "Unsolved (British TV programme)", "response": ["An hour-long special was aired on 10 December 2008 following the conviction of Peter Tobin for the murder of Vicky Hamilton. It was only because of the police investigation of the murder of Tobin's final victim Angelika Kluk, that led police to trace his history; they discovered that he was living in Bathgate at the time Vicky vanished in 1991. A more significant development that emerged in the years following the series was the possible link between Tobin and Bible John. It was speculated that Tobin was in fact the unidentified man known as Bible John who murdered 3 women in the late 1960s. David Wilson, a professor of criminology at Birmingham University has spearheaded the thesis that both men are the same individual. Wilson states: \"I didn't set out to prove Tobin was Bible John but I would stake my professional reputation on it.\""]}, {"page": "Runaway Train (Soul Asylum song)", "response": ["The UK version of the video featured Vicky Hamilton and Dinah McNicol, who each went missing in 1991. Their remains were found in 2007 at a house in Margate. Peter Tobin has since been convicted of both murders."]}, {"page": "Murder of Angelika Kluk", "response": ["#REDIRECT Peter Tobin#Angelika Kluk murder"]}, {"page": "Frank Mulholland, Lord Mulholland", "response": ["Whilst Solicitor General, he formed the new Serious and Organised Crime Division within the Crown Office, as well as leading the successful prosecution of Peter Tobin in 2007 for the 1991 murder of fifteen-year-old Vicky Hamilton."]}, {"page": "Angelika kluk murder case", "response": ["#REDIRECT Peter Tobin#Angelika Kluk murder"]}, {"page": "Murder of Vicky Hamilton", "response": ["#REDIRECT Peter Tobin#Vicky Hamilton murder"]}, {"page": "Dinah McNicol", "response": ["#REDIRECT Peter Tobin#Dinah McNicol murder"]}, {"page": "Pete Tobin", "response": ["#REDIRECT Peter Tobin"]}, {"page": "Angelika Kluk", "response": ["#REDIRECT Peter Tobin#Angelika Kluk murder"]}, {"page": "Crimewatch", "response": ["|Peter Tobin||A serial killer who murdered Vicky Hamilton, Dinah McNicol and Angelika Kluk||"]}]}}