{"wiki_id": "http://www.wikidata.org/entity/Q2081060", "itemLabel": "Bryan Mahon", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Bryan_Mahon", "wikipedia_page": {"main": "Sir Bryan Thomas Mahon,   (2 April 1862 – 29 September 1930) was an Irish born general of the British Army, a senator of the short-lived Senate of Southern Ireland, and a member for eight years of the Irish Free State Senate until his death.", "link_mentions": [{"page": "10th (Irish) Division", "response": ["The 10th (Irish) Division, was one of the first of Kitchener's New Army K1 Army Group divisions (formed from Kitchener's 'first hundred thousand' new volunteers), authorized on 21 August 1914, after the outbreak of the Great War.Murphy, 2007,  Irish Regiments in the World Wars, The Irish Divisions, 1914–18,The 10th (Irish) Division: p.10, Osprey Publishing (2007)  It included battalions from the various provinces of Ireland.Murphy, 2007, p.10 It was led by Irish General Bryan Mahon and fought at Gallipoli, Salonika and Palestine. It was the first of the Irish Divisions to take to the field and was the most travelled of the Irish formations.Murphy, 2007, p.11 The division served as a formation of the United Kingdom's British Army during World War I.", "* August 1914 – November 1915 Lieutenant-General Sir Bryan Mahon"]}, {"page": "British Salonika Army", "response": ["The Army was formed in Salonika under Lieutenant-General Bryan Mahon to oppose Bulgarian advances in the region as part of the Macedonian front. The army arrived in Salonika (along with French troops) on 15 October 1915.Palmer Alan, The gardeners of Salonika, 1965, p. 11. In May 1916 Lieutenant-General George Milne replaced Bryan Mahon as commander of the Army. It eventually comprised two corps and as the Army of the Black Sea remained in place until 1921.Alan Wakefield & Simon Moody, Under the Devil's Eye: Britain's Forgotten Army at Salonika 1915–1918, Stroud: Sutton Publishing (2004). The dead of the British Salonika Army are commemorated by the Doiran Memorial.", "*November 1915 - May 1916 : Lieutenant-General Bryan Mahon"]}, {"page": "Seanad Éireann (Irish Free State)", "response": ["As a result, of the sixty members of the first Senate, as well as 36 Catholics, there were 20 Protestants, 3 Quakers and 1 Jew. It contained 7 peers, a dowager countess (Ellen, Countess of Desart, who was Jewish), 5 baronets and several knights. The New York Times remarked that the first senate was \"representative of all classes\", though it has also been described as, \"the most curious political grouping in the history of the Irish state\".Article by Elaine Byrne, Irish Times, 30 July 2008. Members included W. B. Yeats, Oliver St. John Gogarty, General Sir Bryan Mahon and Jennie Wyse Power.", "*Sir Bryan Mahon"]}, {"page": "Officers' Training Corps", "response": ["Attached to the Suffolk Regiment, the CURV men reported for duty on 20 January 1900 in Bury St Edmunds. On 11 February, they sailed from Southampton on the SS Doune Castle, arriving in Cape Town on 7 March. Initially the Cambridge Volunteers worked as guards on the railway lines around Cape Town, but then marched with the Suffolk Regiment as part of General Bryan Mahon's column to attack a Boer position in Barberton in September 1900. With a large welcome home awaiting them, including a service in Great St Mary's Church, the volunteers were back in Cambridge on 6 May 1901. All the Volunteers were made Honorary Freemen of the Borough of Cambridge and on 21 December 1904, three years later, CURV was granted the battle honour \"South Africa 1900-01\". Cambridge is the only UOTC to have earned a battle honour."]}, {"page": "Ivor Guest, 1st Viscount Wimborne", "response": ["In 1914, he succeeded his father as Baron Wimborne. At the start of World War I, he was appointed to the staff of the newly formed 10th (Irish) Division under Lieutenant-General Sir Bryan Mahon at the Curragh Camp.Ó Broin, Leon, Dublin Castle & the 1916 Rising, Sidgwick & Jackson, 1970, p. 31Townshend, Charles, Easter 1916: The Irish Rebellion, Penguin, 2006, , p. 147"]}, {"page": "1930 in Ireland", "response": ["*29 September – Bryan Mahon, British Army general, Commander-in-Chief, Ireland and Senator (born 1862)"]}, {"page": "Hubert William Lewis", "response": ["Soon after, Bulgaria entered the war on the German side. Lewis' regiment was one of several that were removed from the Western Front and posted to Greece to prepare for a possible attack by enemy forces on the Macedonian front under the command of Lieutenant-General Bryan Mahon of the British Salonika Army. The force initially entrenched themselves in the Thessaloniki area in preparation for an attack but the decision was eventually made to launch an offense against the enemy forces. On 17 October 1916, the order was given for Lewis' battalion to launch a raid on German trenches near Dorsale. However, bad weather delayed the attack for several days before it was eventually launched at 9 p.m. on 22 October. The battalion was split into four parties with Lewis assigned to \"D\" Party. During the initial rush, D Party was spotted by a German sentry after crossing only  of ground, allowing the enemy forces to open fire with machine guns and artillery. They were targeted by \"intense\" shelling for 40 minutes during which Lewis received a wound to his arm. However, he turned away medical assistance after seeing more badly wounded men needing attention."]}, {"page": "Oireachtas (Irish Free State)", "response": ["Half the initial membership of the Seanad was elected by the Dáil under the single transferable vote. The remaining half was appointed by the President of the Executive Council (prime minister), W. T. Cosgrave. Those elected by the Dáil were divided into two equal groups by lot, one assigned terms of 3 years and the other terms of 9 years. Those appointed by the president were similarly divided and assigned terms of 6 years and 12 years. The President agreed to use his appointments in 1922 to grant extra representation to the Protestant minority in the state, most of whom were former Southern Unionists, to promote inclusiveness in the new Free State. As a result, of the sixty members of the first Seanad, as well as 36 Catholics, there were 20 Protestants, 3 Quakers and 1 Jew. It contained 7 peers, a dowager countess, 5 baronets and several knights. The New York Times remarked that the first Seanad was \"representative of all classes\", though it has also been described as, \"the most curious political grouping in the history of the Irish state\".Article by Elaine Byrne, Irish Times, 30 July 2008 Members included William Butler Yeats, Oliver St. John Gogarty and General Sir Bryan Mahon."]}, {"page": "Royal Dublin Fusiliers", "response": ["The 6th and 7th Dublins joined the 30th Brigade of the 10th (Irish) Division upon their creation in August 1914. The division left Ireland for Basingstoke, England in May 1915. On 7 June the division left the UK under the command of Irish General Bryan Mahon, arriving in Lemnos by late July in preparation for the landings at Suvla Bay, Gallipoli. The Dublins landed at Suvla on 7 August; a day after the first landings there had taken place. Unlike at V Beach at Helles, Suvla was barely defended but incompetence at the higher echelons of command led to the British troops not exploiting their early advantage, ensuring that the Suvla landings became static and allowing the Turks to reinforce their defences. The Dublins took part in the effort to capture a position known as Chocolate Hill (7–8 August), which was successfully taken, though at a heavy cost. On 9 August the Dublins took part in the attempt to recapture Scimitar Hill, and managed to gain some ground but experienced ferocious resistance from the Turks that eventually forced the British to withdraw. The 1st Dublins and the rest of the 29th Division were moved to Suvla to reinforce the British force there. On 21 August the Dublins took part in another attempt to take Scimitar Hill and after the battle, the Suvla front-line became static, with no more major attacks being attempted. In September, the 6th and 7th Dublins and the rest of their division left Suvla, arriving in Mudros on Lemnos later that month."]}, {"page": "Landing at Suvla Bay", "response": ["The Suvla landing was to be made by the newly formed British IX Corps, initially comprising two brigades of the 10th (Irish) Division and the entire 11th (Northern) Division. Command of IX Corps was given to Lieutenant-General Sir Frederick Stopford. British military historian J. F. C. Fuller said of Stopford that he had \"no conception of what generalship meant\" and indeed he was appointed not on his experience (he had seen little combat and had never commanded men in battle) or his energy and enthusiasm (he was aged 61 and had retired in 1909) but because of his position on the list of seniority.  Hamilton had requested either Lieutenant-General Julian Byng or Lieutenant-General Henry Rawlinson, both experienced Western Front corps commanders, but both were junior to Lieutenant-General Sir Bryan Mahon, commander of the 10th Division and so, by a process of elimination, Stopford was selected."]}, {"page": "Commander-in-Chief, Ireland", "response": ["*Lieutenant-General Sir Bryan Mahon 1916–1918"]}, {"page": "Pilgrims Society", "response": ["The first informal meeting of the Pilgrims of Great Britain included General Joseph Wheeler, Colonel (later General Sir) Bryan Mahon, the Hon Charles Rolls and Harry Brittain."]}, {"page": "Royal Munster Fusiliers", "response": ["The first new battalions were raised as units of Kitchener's new K1 Army Group, which led to the formation of the 6th and 7th (Service) Battalions, Royal Munster Fusiliers which were a part of the 30th Brigade of the 10th (Irish) Division, under the command of General Bryan Mahon. The 8th and 9th (Service) Battalions, Royal Munster Fusiliers followed as units of the 16th (Irish) Division's 47th and 48th Brigades, part of Kitchener's second new K2 Army Group. The 16th Division was placed under the command of Major General William Hickie.Staunton, p.221 In the course of the war heavy losses suffered by the two Regular Royal Munster Fusilier Battalions caused the new service battalions to be disbanded and absorbed in turn by the regular battalions, the last on 2 June 1918 when the 8th (Service) Battalion, Royal Munster Fusiliers was amalgamated with the 1st Battalion, Royal Munster Fusiliers."]}, {"page": "Privy Council of Ireland", "response": ["Bryan Mahon,Dáil Éireann  debates 20 Feb 1929 v28 c26  "]}, {"page": "Royal Munster Fusiliers (New Army)", "response": ["The first new battalions were raised as units of Kitchener's new K1 Army Group, which led to the formation of the 6th and 7th (Service) Battalions, Royal Munster Fusiliers (RMF) comprising the 30th Brigade of the 10th (Irish) Division, under the command of General Bryan Mahon."]}, {"page": "City of London Yeomanry (Rough Riders)", "response": ["The battalion landed in South Africa on 3 May, where the companies were posted to separate formations during the guerrilla war phase of the campaign.IY Companies at Roll of Honour. For example, at the end of July the 72nd and 79th Companies of  'The Roughs' joined Col Bryan Mahon's force at Pretoria alongside the 20th (Fife and Forfar Light Horse) Company and a composite squadron formed from the depleted 7th Battalion, IY (25th (West Somerset), 26th (Dorset), 27th (Devon), 48th (North Somerset) and 69th (Sussex) Companies) and saw action at Olifant's Nek in August during the pursuit of Christiaan de Wet. 'The Roughs' were popular among their fellow yeomen because of the large quantities of food and comforts they received from family and friends in the city. In September 1900 72nd Company was serving alongside the composite squadron in a column under Maj-Gen R.A.P. Clements pursuing Koos de la Rey. In October the company was ordered back to Pretoria.Ross, 'With Mahon'.Ross, 'With Clements part 1'.Ross, 'With Clements part 2'.Ross, 'With Clements part 3'."]}, {"page": "Lords Justices of Ireland", "response": ["| Bryan Mahon"]}, {"page": "George Milne, 1st Baron Milne", "response": ["Milne was appointed to command XVI Corps in Salonika in January 1916 with orders to oppose Bulgarian advances on the Macedonian front. When he succeeded Bryan Mahon as Commander-in-Chief of the British Salonika Army, Milne became overall Commander-in-Chief of British Troops in Macedonia on 9 May 1916. As late as 3 June 1916 Milne was ordered by Robertson, now Chief of the Imperial General Staff (CIGS), not to participate in any attack on the Bulgars. He was awarded the Grand Cross of the Order of the White Eagle (1st Class, with Swords) by the King of Serbia on 1 July 1916."]}]}}