{"wiki_id": "http://www.wikidata.org/entity/Q20870467", "itemLabel": "Leslie Spoor", "itemDescription": "politician (1910-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Leslie_Spoor", "wikipedia_page": {"main": "Leslie Spoor (12 October 1910 – 13 March 2011) was a British political activist and the principal founder of what became the Scottish Green Party.\nBorn in Durham and educated  in Edinburgh and Dunfermline, Spoor became politically active while working in London in the 1930s, and was involved in the Battle of Cable Street.  When the Second World War broke out he volunteered as a Stretcher Party Officer during the Blitz. After a move to Edinburgh he joined the Royal Air Force, serving out the war as a wireless operator at Drem airfield in East Lothian. After the war he attended the University of Edinburgh, where he studied history and then teaching.  He taught at Musselburgh Grammar School, and was active in the Scottish Secondary Teachers Association and a leading player in developing Modern Studies - part of his desire to see politics taught in schools. He also lectured for the Open University and in 1964 left school teaching for the FE sector, joining the staff of Napier Technical College.A long-term member of the Labour Party, Spoor was a close friend of Robin Cook.  Spoor retired in 1975, and in 1978 hosted the first meeting of Scottish members of the Ecology Party.  He oversaw the branch's campaign in Edinburgh South for the 1979 general election, and also served on the national executive. Spoor continued campaigning for what became the first UK-wide Green Party, then the independent Scottish Green Party until his death in 2011, aged 100.", "link_mentions": [{"page": "Scottish Greens", "response": ["The Scottish Green Party originated as the Scottish branch of the Ecology Party, founded in 1978 by Leslie Spoor.Paul Cockburn, \"Leslie Spoor\", The Herald, 30 March 2011 The Ecology Party became the UK Green Party and it remained a constituent party until 1990, when the Scottish Green Party became a separate entity. The separation was entirely amicable, as part of the green commitment to decentralisation: the Scottish Green Party supported the referendum on Scottish independence and opposed Britain's entry into the European Common Market in its 1989 European election manifesto, claiming that the Common Market would cause mass unemployment for Scottish workers, force Scotland to move towards a tourist-based economy, enable the destruction of local food markets and cause catastrophic environmental damage – for this reason, the party campaigned for a Europe-wide confederation of individuals on global issues affecting the environment."]}, {"page": "List of centenarians (politicians and civil servants)", "response": ["|Leslie Spoor || 1910–2011 || 100 || Scottish activist and politician, founder of the Scottish Green Party"]}]}}