{"wiki_id": "http://www.wikidata.org/entity/Q2086251", "itemLabel": "Philip Jenkins", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Jenkins", "wikipedia_page": {"main": "Philip Jenkins (born April 3, 1952) is a professor of history at Baylor University in the United States, and co-director for Baylor's Program on Historical Studies of Religion in the Institute for Studies of Religion. He is also the Edwin Erle Sparks Professor of Humanities Emeritus at Pennsylvania State University (PSU). He was professor (from 1993) and a distinguished professor (from 1997) of history and religious studies at the same institution; and also assistant, associate and then full professor of criminal justice and American studies at PSU, 1980–93.Jenkins is a contributing editor for The American Conservative and writes a monthly column for The Christian Century. He has also written articles for Christianity Today, First Things, and The Atlantic.", "link_mentions": [{"page": "Anglican Communion", "response": ["The Lambeth Conference of 1998 included what has been seen by Philip Jenkins and others as a \"watershed in global Christianity\". The 1998 Lambeth Conference considered the issue of the theology of same-sex attraction in relation to human sexuality. At this 1998 conference for the first time in centuries the Christians of developing regions, especially, Africa, Asia, and Latin America, prevailed over the bishops of more prosperous countries (many from the US, Canada, and the UK) who supported a redefinition of Anglican doctrine. Seen in this light 1998 is a date that marked the shift from a West-dominated Christianity to one wherein the growing churches of the two-thirds world are predominant, but the gay bishop controversy in subsequent years led to the reassertion of Western dominance, this time of the liberal variety."]}, {"page": "Christian countercult movement", "response": ["In the Protestant tradition, some of the earliest writings opposing unorthodox groups (such as the Swedenborgians) can be traced back to John Wesley, Alexander Campbell and Princeton Theological Seminary theologians like Charles Hodge and B. B. Warfield.Richard G. Kyle, The Religious Fringe: A History of Alternative Religions in America, Downers Grove: IVP, 1993.Philip Jenkins, Mystics and Messiahs: Cults and New Religions in American History, New York: Oxford University Press, 2000. The first known usage of the term cult by a Protestant apologist to denote a group is heretical or unorthodox is in Anti-Christian Cults by A. H. Barrington, published in 1898.A.H.Barrington, Anti-Christian Cults, Milwaukee: Young Churchman/London: Sampson Low, Marston, 1898."]}, {"page": "Pope Joan", "response": ["Against the lack of historical evidence to her existence, the question remains as to why the Pope Joan story has been popular and widely believed. Philip Jenkins in The New Anti-Catholicism: The Last Acceptable Prejudice suggests that the periodic revival of what he calls this \"anti-papal legend\" has more to do with feminist and anti-Catholic wishful thinking than historical accuracy."]}, {"page": "Ramadan", "response": ["Although Muslims were first commanded to fast in the second year of Hijra (624 CE), they believe that the practice of fasting is not in fact an innovation of monotheismQuran Chapter 2, Revelation 183 but rather has always been necessary for believers to attain taqwa (the fear of God). They point to the fact that the pre-Islamic pagans of Mecca fasted on the tenth day of Muharram to expiate sin and avoid drought. Philip Jenkins argues that the observance of Ramadan fasting grew out of \"the strict Lenten discipline of the Syrian Churches,\" a postulation corroborated by other scholars, including theologian Paul-Gordon Chandler,Jenkins, Philip (2006). The New Faces of Christianity: Believing the Bible in the Global South. p. 182. Oxford University Press. Kindle Edition. but disputed by some Muslim academics.Muhammad Mustafa al-Azami, \"The History of The Quranic Text: From Revelation to Compilation: A Comparative Study with the Old and New Testaments\", 2nd Edition (2008), Azami Publishing House"]}, {"page": "Sufism", "response": ["The Islamic Institute in Mannheim, Germany, which works towards the integration of Europe and Muslims, sees Sufism as particularly suited for interreligious dialogue and intercultural harmonisation in democratic and pluralist societies; it has described Sufism as a symbol of tolerance and humanism—nondogmatic, flexible and non-violent.Jamal Malik, John R. Hinnells: Sufism in the West, Routledge, p. 25 According to Philip Jenkins, a Professor at Baylor University, \"the Sufis are much more than tactical allies for the West: they are, potentially, the greatest hope for pluralism and democracy within Muslim nations.\" Likewise, several governments and organisations have advocated the promotion of Sufism as a means of combating intolerant and violent strains of Islam. For example, the Chinese and Russian governments openly favor Sufism as the best means of protecting against Islamist subversion. The British government, especially following the 7 July 2005 London bombings, has favoured Sufi groups in its battle against Muslim extremist currents. The influential RAND Corporation, an American think-tank, issued a major report titled \"Building Moderate Muslim Networks,\" which urged the US government to form links with and bolster Muslim groups that opposed Islamist extremism. The report stressed the Sufi role as moderate traditionalists open to change, and thus as allies against violence. News organisations such as the BBC, Economist and Boston Globe have also seen Sufism as a means to deal with violent Muslim extremists."]}, {"page": "Substance abuse", "response": ["Philip Jenkins suggests that there are two issues with the term \"drug abuse\". First, what constitutes a \"drug\" is debatable. For instance, GHB, a naturally occurring substance in the central nervous system is considered a drug, and is illegal in many countries, while nicotine is not officially considered a drug in most countries.", "Second, the word \"abuse\" implies a recognized standard of use for any substance. Drinking an occasional glass of wine is considered acceptable in most Western countries, while drinking several bottles is seen as an abuse. Strict temperance advocates, who may or may not be religiously motivated, would see drinking even one glass as an abuse.  Some groups (Mormons, as prescribed in “the Word of Wisdom”) even condemn caffeine use in any quantity. Similarly, adopting the view that any (recreational) use of cannabis or substituted amphetamines constitutes drug abuse implies a decision made that the substance is harmful, even in minute quantities.Philip Jenkins, Synthetic panics: the symbolic politics of designer drugs, NYU Press, 1999, , pp. ix–x In the U.S., drugs have been legally classified into five categories, schedule I, II, III, IV, or V in the Controlled Substances Act. The drugs are classified on their deemed potential for abuse. Usage of some drugs is strongly correlated. For example, the consumption of seven illicit drugs (amphetamines, cannabis, cocaine, ecstasy, legal highs, LSD, and magic mushrooms) is correlated and the Pearson correlation coefficient r>0.4 in every pair of them; consumption of cannabis  is strongly correlated (r>0.5) with usage of nicotine (tobacco), heroin is correlated with cocaine (r>0.4) and methadone (r>0.45), and is strongly correlated with crack (r>0.5)"]}, {"page": "Catholic Church sexual abuse cases", "response": ["Philip Jenkins, professor at the Department of Religion and History at Penn State University, questioned the theses of increased sexual abuse among priests, saying the percentage of priests accused of molesting minors is 1.8%, much of which is not about pedophilia alone.", "Ernie Allen, president of the National Center for Missing and Exploited Children, said, \"We don't see the Catholic Church as a hotbed of this or a place that has a bigger problem than anyone else. I can tell you without hesitation that we have seen cases in many religious settings, from traveling evangelists to mainstream ministers to rabbis and others.\" Philip Jenkins, a long-time Catholic turned Episcopalian, asserts that his \"research of cases over the past 20 years indicates no evidence whatever that Catholic or other celibate clergy are any more likely to be involved in misconduct or abuse than clergy of any other denomination—or indeed, than non-clergy. However determined news media may be to see this affair as a crisis of celibacy, the charge is just unsupported.\"", "Anglican writer Philip Jenkins supported many of these arguments stating that media coverage of the abuse story had become \"...a gross efflorescence of anti-catholic rhetoric.\"Jenkins, Philip, The New Anti-Catholicism – the Last Acceptable Prejudice, Oxford University Press, 2004, pp. 133–57"]}, {"page": "Mastermind (British game show)", "response": ["| 1979 || Philip Jenkins || Christianity AD 30–150 || Vikings in Scotland and Ireland 800–1150 AD || History of Wales 400–1100"]}, {"page": "In God We Trust", "response": ["In Judaism and Christianity, the official motto \"In God We Trust\" is not found verbatim in any verses from the Bible, but very closely in the Old Testament in , \"I will say of the LORD, He is my refuge and my fortress: my God; in him will I trust\" and in the New Testament in , \"Who delivered us from so great a death, and doth deliver: in whom we trust that he will yet deliver us.\" The concept is paraphrased in , , , and . According to Philip Jenkins, a historian of religion, some Bible translations rendered Psalm 56:11 as \"In God I trust; I will not fear\", which could lead to substitution of the first \"I\" for \"we\"."]}, {"page": "Crystal skull", "response": ["Despite some claims presented in an assortment of popularizing literature, legends of crystal skulls with mystical powers do not figure in genuine Mesoamerican or other Native American mythologies and spiritual accounts.Aldred (2000, passim.); Jenkins (2004, pp. 218–219). In this latter work, Philip Jenkins, former Distinguished Professor of History and Religious Studies and subsequent endowed Professor of Humanities at PSU, writes that crystal skulls are among the more obvious of examples where the association with Native spirituality is a \"historically recent\" and \"artificial\" synthesis. These are \"products of a generation of creative spiritual entrepreneurs\" that do not \"[represent] the practice of any historical community\".  The skulls are often claimed to exhibit paranormal phenomena by some members of the New Age movement, and have often been portrayed as such in fiction. Crystal skulls have been a popular subject appearing in numerous science fiction television series, novels, films, and video games.", "The alleged associations and origins of crystal skull mythology in Native American spiritual lore, as advanced by neoshamanic writers such as Jamie Sams, are similarly discounted.See discussion of the various claims put forward by Sams, Kenneth Meadows, Harley Swift Deer Reagan and others concerning crystal skulls, extraterrestrials, and Native American lore, in Jenkins (2004, pp. 215–218). Instead, as Philip Jenkins notes, crystal skull mythology may be traced back to the \"baroque legends\" initially spread by F.A. Mitchell-Hedges, and then afterwards taken up:"]}, {"page": "Black people and Mormonism", "response": ["Professor Philip Jenkins noted in 2009 that LDS growth in Africa has been slower than that of other churches due to a number of reasons: one being the white face of the church due to the priesthood ban, and another being the church's refusal to accommodate local customs like polygamy."]}, {"page": "Secret Gospel of Mark", "response": ["In 2001, Philip Jenkins drew attention to a novel by James H. Hunter entitled The Mystery of Mar Saba, which first appeared in 1940 and was popular at the time. Jenkins saw unusual parallels to Clement's letter to Theodore and Smith's description of his discovery in 1958, but did not explicitly state that the novel inspired Smith to forge the text. Later Robert M. Price, Francis Watson and Craig A. Evans developed the theory that Morton Smith would have been inspired by this novel to forge the letter. This assumption has been contested by, among others, Scott G. Brown, who writes that apart from \"a scholar discovering a previously unknown ancient Christian manuscript at Mar Saba, there are few parallels\" – and in a rebuttal to Evans, he and Allan J. Pantuck find the alleged parallel between the Scotland Yard detective Lord Moreton's last name and Morton Smith's first name puzzling, since Morton Smith got his name long before the novel was written. Francis Watson finds the parallels so convincing that \"the question of dependence is unavoidable\", while Allan J. Pantuck thinks they are too generic or too artful to be persuasive. Javier Martínez, who thinks the question of forgery is open to debate, regards the suggestion that Hunter's novel would have inspired Smith to forge the text to be outlandish. He wonders why it took more than four decades after the story of Smith's discovery made the front page of the New York Times before anyone realized that this so popular novel was Smith's source. Martínez finds Watson's methods, by which he reaches the conclusion that \"[t]here is no alternative but to conclude that Smith is dependent on\" The Mystery of Mar Saba, to be \"surreal as a work of scholarship\". Timo Paananen asserts that neither Evans nor Watson clarifies what criteria they use to establish that these particular parallels are so \"amazing, both in substance and in language\", and that they reduce the rigor of their criteria compared to how they dismiss \"literary dependencies in other context\"."]}, {"page": "Anti-clericalism", "response": ["Although anti-clericalism is more often spoken of regarding the history or current politics of Latin countries where the Catholic Church was established and where the clergy had privileges, Philip Jenkins notes in his 2003 book The New Anti-Catholicism that the U.S., despite the lack of Catholic establishments, has always had anti-clericals.Jenkins, Philip, The New Anti-Catholicism: The Last Acceptable Prejudice, p. 10, Oxford University Press US, 2004"]}, {"page": "Mar Saba letter", "response": ["Scholars Philip Jenkins and Robert M. Price noticed parallels between The Secret Gospel of Mark and a novel by James Hunter published in 1940 entitled The Mystery of Mar Saba.Hypotyposeis blogEvans, Craig A. Exploring the origins of the Bible: canon formation in historical, 2008 p. 272: \"The entire story — finding a long-lost document in the Mar Saba Monastery that is potentially embarrassing to Christianity — is adumbrated by James Hunter's The Mystery of Mar Saba. Indeed, one of the heroes of the story, who helps to unmask the perpetrators and expose the fraud, is Scotland Yard Inspector Lord Moreton.\" In 1980 the Mar Saba letter was included in the revision of the standard edition of works of Clement of Alexandria:  Otto Stählin and Ursula Treu, Clemens Alexandrinus, vol. 4.1: Register, 2nd ed. (Berlin:Akademie-Verlag, 1980), XVII–XVIII."]}, {"page": "The Christian Century", "response": ["The Centurys current editor and publisher is Peter W. Marty, while Steve Thorngate is its managing editor. Regular columnists include Philip Jenkins, Kathryn Reklis, Brian Bantum, Lil Copan, Sam Wells, Debie Thomas, Isaac Villegas, Debra Dean Murphy, and Stephanie Paulsell. The magazine takes a \"liberal\" editorial stance.Left-wing scholars attack the best-selling 'Da Vinci Code',  Richard N. Ostling| Associated Press, July 10, 2004 "]}, {"page": "Gregory S. Paul", "response": ["These conclusions are in line with other sociological research such as Pippa Norris and Ronald Ingelhart's Sacred and Secular (2004) and Phil Zuckerman's Society Without God (2009). His research is not in line with works from John Micklethwait and Adrian Woodbridge,Micklethwait, John and Woodridge, Adrian .God is Back These latter works argue that the resurgence of religion in diverse and previously secular nations such as India, Singapore, China and Turkey, which has primarily been among the more educated, economic upper-class, when viewed alongside the continued religious adherence in the United States, seems to paint Europe (the primary center of Paul and Zuckerman's arguments) as the exception instead of the norm. or research from Peter L. Berger (2009)Berger, Peter. ed., \"Religious America, Secular Europe?\"   and Philip Jenkins.Jenkins, Philip. \"The Next Christendom:  The Coming Global Christianity\""]}, {"page": "Steven Emerson", "response": ["Philip Jenkins, in his 2003 book, Images of terror: what we can and can't know about terrorism responded that certain groups criticize Emerson in order to silence and delegitimize his views."]}, {"page": "List of Pennsylvania State University people", "response": ["* Philip Jenkins, professor of religious studies and writer on modern religious controversies"]}, {"page": "Christ myth theory", "response": ["In his books The Sacred Mushroom and the Cross (1970) and The Dead Sea Scrolls and the Christian Myth (1979), the British archaeologist and philologist John M. Allegro advanced the theory that stories of early Christianity originated in a shamanistic Essene clandestine cult centered around the use of hallucinogenic mushrooms.The Essenes, the Scrolls, and the Dead Sea by Joan E. Taylor (2012)  Oxford University Press p. 305 He also argued that the story of Jesus was based on the crucifixion of the Teacher of Righteousness in the Dead Sea Scrolls.Hall, Mark. Foreword to Allegro, John M. The Dead Sea Scrolls & the Christian Myth. Prometheus 1992, first published 1979, p. ix. Allegro's theory was criticised sharply by Welsh historian Philip Jenkins, who wrote that Allegro relied on texts that did not exist in quite the form he was citing them.Jenkins, Philip. Hidden Gospels. Oxford University Press, 2002, p. 180. Based on this and many other negative reactions to the book, Allegro's publisher later apologized for issuing the book and Allegro was forced to resign his academic post.The Meaning of the Dead Sea Scrolls by Peter Flint and James VanderKam (2005)  T&T Clark pages 323–325A History of the Middle East by Saul S. Friedman (2006)  p. 82", "Philip Jenkins, Distinguished Professor of History at Baylor University, has written \"What you can’t do, though, without venturing into the far swamps of extreme crankery, is to argue that Jesus never existed. The \"Christ-Myth Hypothesis\" is not scholarship, and is not taken seriously in respectable academic debate. The grounds advanced for the \"hypothesis\" are worthless. The authors proposing such opinions might be competent, decent, honest individuals, but the views they present are demonstrably wrong....Jesus is better documented and recorded than pretty much any non-elite figure of antiquity.\"", "Robert Van Voorst has written \"Contemporary New Testament scholars have typically viewed (Christ myth) arguments as so weak or bizarre that they relegate them to footnotes, or often ignore them completely [...] The theory of Jesus' nonexistence is now effectively dead as a scholarly question.\" Paul L. Maier, former Professor of Ancient History at Western Michigan University and current  professor emeritus in the Department of History there has stated \"Anyone who uses the argument that Jesus never existed is simply flaunting his ignorance.\" Among notable scholars who have directly addressed the Christ myth are Maurice Casey and Philip Jenkins."]}, {"page": "John M. Allegro", "response": ["Allegro's theory of a shamanistic cult as the origin of Christianity was criticised sharply by Welsh historian Philip Jenkins who wrote that Allegro was an eccentric scholar who relied on texts that did not exist in quite the form he was citing them. Jenkins called the Sacred Mushroom and the Cross \"possibly the single most ludicrous book on Jesus scholarship by a qualified academic\".Jenkins, Philip. Hidden Gospels. Oxford University Press, 2002, p. 180. Based on the reactions to the book, Allegro's publisher later apologized for issuing the book and Allegro was forced to resign his academic post.The Meaning of the Dead Sea Scrolls by Peter Flint and James VanderKam (Jul 10, 2005)  T&T Clark pp. 323-325 A 2006 article by Michael Hoffman discussing Allegro's work called for his theories to be re-evaluated by the mainstream.Hoffman, Michael., ed. by Dr. Robert Price., \"Wasson and Allegro on the Tree of Knowledge as Amanita\" in Journal of Higher Criticism, 2006.  In November 2009 The Sacred Mushroom and the Cross was reprinted in a 40th anniversary edition with a 30-page addendum by Carl Ruck of Boston University.The Sacred Mushroom and the Cross, 40th anniversary edition by John M. Allegro, Gnostic Media, 2009. "]}, {"page": "Neoshamanism", "response": ["*Philip Jenkins, Dream Catchers: How Mainstream America Discovered Native Spirituality. New York: Oxford University Press, 2004. "]}, {"page": "Prosperity theology", "response": ["By the late 2000s, proponents claimed that tens of millions of Christians had accepted prosperity theology. The Neo-Pentecostal movement has been characterized in part by an emphasis on prosperity theology, which gained greater acceptance within charismatic Christianity during the late 1990s. In the 2000s, churches teaching prosperity theology saw significant growth in the Third World. According to Philip Jenkins of Pennsylvania State University, poor citizens of impoverished countries often find the doctrine appealing because of their economic powerlessness and the doctrine's emphasis on miracles. One region seeing explosive growth is Western Africa, particularly Nigeria. In the Philippines, the El Shaddai movement, part of the Catholic Charismatic Renewal, has spread prosperity theology outside Protestant Christianity. One South Korean prosperity church, Yoido Full Gospel Church, gained attention in the 1990s by claiming to be the world's largest congregation."]}, {"page": "Hitler's Pope", "response": ["In his book The New Anti-Catholicism: The Last Acceptable Prejudice, Philip Jenkins said that Hitler's Pope could not be understood except as a series of \"very low blows against the modern Catholic Church, and specifically the papacy of John Paul II.\"Jenkins, Philip The New Anti-Catholicism: The Last Acceptable Prejudice, p.201, 2003 Oxford University Press US"]}, {"page": "Yuhanna ibn Bukhtishu", "response": ["Yuhanna ibn Bukhtishu (Johannes Bukhtishu) was a 9th-century PersianPhilip Jenkins, The Lost History of Christianity, (HarperCollins, 2008), 78. or Syriac physician from Khuzestan, Persia.Islamic Culture and the Medical Arts, U.S. National Library of MedicineThe first Persian Muslims, who replaced the Persian Christian physicians (bukhtishu' and Maswaih or Masua), was Ahmad b. Al-Tayib al-Sarakhsi (died 900).(Frye, Richaard, Heritage of Persian, Mazda Publishers Inc, fourth edition published in 2004, pages 163-164) "]}, {"page": "Chick tract", "response": ["Elsewhere, Chick defended the controversial Alberto Rivera in at least one book and in an entire series of six full-length comics. Chick also asserted that the Catholic Church, in a grand conspiracy, created Islam, Communism, Nazism, and Freemasonry. In The New Anti-Catholicism, religious historian Philip Jenkins describes Chick tracts as promulgating \"bizarre allegations of Catholic conspiracy and sexual hypocrisy\" to perpetuate \"anti-papal and anti-Catholic mythologies\". Michael Ian Borer, a sociology professor of Furman University at the time, described Chick's strong anti-Catholic themes in a 2007 American Sociological Association presentation and in a peer-reviewed article the next year in Religion and American Culture."]}, {"page": "Catholics for Choice", "response": ["The campaign faced difficulty in the UN from the start and, according to U.N. spokesperson Farhan Haq in 1999, seemed \"unlikely\" to succeed. Anglican Bishop John Baycroft said \"The Vatican has as much right to be [in the UN] as any of the other countries\", as the modern remnant of the Papal States.  Pennsylvania State University professor Philip Jenkins wrote that the See Change campaign is anti-Catholic, and that the major diplomatic and mediation activity of the Vatican makes it deserve recognition far more than many other UN members.", "Helen M. Alvaré, an associate professor of law at the Catholic University of America, has asserted that CFC has \"no grass-roots base among Catholics.\" She said the CFC arguments were not different from other pro-abortion rights groups.The New York Times. Backing Abortion Rights While Keeping the Faith. Banerjee, Neela.  February 27, 2007 Pennsylvania State University professor and historian of religion Philip Jenkins wrote that CFFC is a public voice for anti-Catholic opinions. He wrote that in 1991 Frances Kissling stated, \"I spent twenty years looking for a government that I could overthrow without being thrown in jail. I finally found one in the Catholic church.\" Jenkins also writes that Kissling engages in \"solid seventeenth-century anti-popery\".Jenkins, Philip, The New Anti-Catholicism: The Last Acceptable Prejudice, pgs. 84–87, Oxford University Press US 2003"]}, {"page": "Every Sperm Is Sacred", "response": ["The religious import of the sketch is significant, and is reflected in the widely dispersed usage of the phrase. In the book Monty Python and Philosophy, the argument is teased out to reach a broader (still humorous) conclusion: \"The Pythons ask us to consider the consequences of the belief that God cares about our reproductive practices and sees everything. If so, then he watches our sexual activities. ...Christians must concede that all things considered, this [watching people have sex] is one of God's less onerous activities.\" Philip Jenkins discusses the sketch as an important sign of a growing willingness in the popular media of the 1970s and 1980s to criticize the Catholic Church, saying that \"Catholic attitudes toward sex and contraception are ruthlessly parodied\" in the song, proving that \"Catholicism was available as a legitimate subject of serious fiction.\" Richard Dawkins, in his The God Delusion, cites the song for that reason, the illustration of the \"surreal idiocy\" of some pro-religion, anti-abortion arguments."]}, {"page": "Day-care sex-abuse hysteria", "response": ["The McMartin Preschool case was the first daycare abuse case to receive major media attention in the United States. The case concerned the McMartin Preschool in Manhattan Beach, California, where seven teachers were accused of kidnapping children, flying them in an airplane to another location, and forcing them to engage in group sex, as well as forcing them to watch animals being tortured and killed. The case also involved accusations that children had been forced to participate in bizarre religious rituals, and being used to make child pornography. The case began with a single accusation, made by a mother—who was later found to be a paranoid schizophrenic—of one of the students, but grew rapidly when investigators informed parents of the accusation, and began interviewing other students. The case made headlines nationally during 1984, and seven teachers were arrested and charged that year. However, when a new district attorney took over the case in 1986, his office re-examined the evidence, and dismissed charges against all but two of the original defendants. Their trials became one of the longest and most expensive criminal trials in the history of the United States, but in 1990, all of these charges were also dismissed. The trial was met with disapproval by both its jurors and academic researchers, who criticized the interviewing techniques that investigators had used in their investigations of the school, alleging that interviewers had \"coaxed\" children into making unfounded accusations, repeatedly asking children the same questions, and offering various incentives until the children reported having been abused. Most scholars now agree that the accusations these interviews elicited from children were false. Sociologist Mary de Young and historian Philip Jenkins have both cited the McMartin case as the prototype for a wave of similar accusations and investigations between 1983 and 1995, which constituted a moral panic.Two Decades After McMartin:  A Follow-up of 22 Convicted Day Care Employees "]}, {"page": "Islam in Europe", "response": ["In 2006, the conservative Christian historian Philip Jenkins, in an article for the Foreign Policy Research Institute thinktank, wrote that by 2100, a Muslim population of about 25% of Europe's population was \"probable\"; Jenkins stated this figure did not take account growing birthrates amongst Europe's immigrant Christians, but did not give details of his metholodogy.Philip Jenkins, \"Demographics, Religion, and the Future of Europe\", Orbis: A Journal of World Affairs, vol. 50, no. 3, pp. 533, summer 2006 in 2010, Eric Kaufmann, professor of politics at Birkbeck, University of London said that \"In our projections for Western Europe by 2050 we are looking at a range of 10-15 per cent Muslim population for most of the high immigration countries – Germany, France, the UK\"; he argued that Islam was expanding, not because of conversion to Islam, but primarily due to the religion's \"pro-natal\" orientation, where Muslims tend to have more children. Other analysts are skeptical about the accuracy of the claimed Muslim population growth, stating that because many European countries do not ask a person's religion on official forms or in censuses, it has been difficult to obtain accurate estimates, and arguing that there has been a decrease in Muslim fertility rates in Morocco, the Netherlands and Turkey.Mary Mederios Kent, Do Muslims have more children than other women in western Europe? , Population Reference Bureau, February 2008, Simon Kuper, Head count belies vision of ‘Eurabia’, Financial Times, 19 August 2007, Doug Saunders, The 'Eurabia' myth deserves a debunking , The Globe and Mail, 20 September 2008, Islam and demography: A waxing crescent, The Economist, 27 January 2011"]}, {"page": "Autarchism", "response": ["Ralph Waldo Emerson (1803–1882) biographer Robert D. Richardson described Emerson's anarchy as autarchy', rule by self\". Philip Jenkins has stated that \"Emersonian ideas stressed individual liberation, autarchy, self-sufficiency and self-government, and strenuously opposed social conformity\"."]}, {"page": "1952 in Wales", "response": ["*3 April – Philip Jenkins, academic and Mastermind champion"]}, {"page": "Age of consent reform", "response": ["Philip Jenkins said in the mid-1970s, there was widespread sympathy among homosexual activist groups for lowering the age of consent for all sexual activities with many gay publications discussing lowering it for boys. These tensions and antagonisms continued among activist circles until the 1980s; however, since the 1970s, gay liberationist groups promoting frontline advocacy against the age of consent were falling into decline. In 1971, the age of majority was lowered from 21 years old to 18 years old, except in Mississippi (21), Alabama (19), and Nebraska (19)."]}, {"page": "List of Baylor University people", "response": ["* Philip Jenkins – Distinguished Professor of History and Co-Director of the Program on Historical Studies of Religion", "*Philip Jenkins – Director of Program for Historical Studies of Religion"]}]}}