{"wiki_id": "http://www.wikidata.org/entity/Q20807409", "itemLabel": "Chris Duffy", "itemDescription": "British association football player (1884-1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Duffy_(footballer,_born_1884)", "wikipedia_page": {"main": "Christopher Francis Duffy (24 January 1884 – September 1971) was an English professional football outside left who made over 140 appearances in the Football League for Bury. He also played league football for Newcastle United, Leicester City and Middlesbrough.", "link_mentions": [{"page": "Chris Duffy", "response": ["Chris Duffy may refer to:", "* Chris Duffy (baseball) (born 1980), American baseball player", "* Chris Duffy (footballer, born 1918) (1918–1978), Scottish footballer", "* Chris Duffy (footballer, born 1884) (1884–1971), English footballer outside left", "* Chris Duffy (footballer, born 1973), English footballer defender", "* Chris Duffy, member of Waterfront (band)", "* Chris Duffy, member of Bazooka Joe (band)", "*Chris Duffy (wrestler) (1964-2000), American professional wrestler"]}, {"page": "Ben Davies (footballer, born 1888)", "response": ["Davies began his career with his hometown side Middlesbrough, serving as understudy to England international Tim Williamson during his spell at the club, making 31 league appearances. In 1920, he joined Cardiff City for their first season in the Football League and, after beginning the season as second choice behind Herbert Kneeshaw, he eventually made his debut on 22 January 1921 in a 1–0 victory over Bristol City. He retained his place for the rest of the 1920–21 season, conceding 12 goals in his 19 league appearances as Cardiff won promotion to the First Division. Davies was later forced out of the side by the arrival of Tom Farquharson during the 1922–23 season and moved to Second Division side Leicester City. Davies made his debut for the Foxes on 8 December 1923 in a 2–1 victory over South Shields, becoming the second oldest debutant in the club's history at the time behind Chris Duffy,  and made two further appearances in the same month. He later joined Bradford Park Avenue but did not make an appearance for the side."]}]}}