{"wiki_id": "http://www.wikidata.org/entity/Q208448", "itemLabel": "Augustus De Morgan", "itemDescription": "British mathematician, philosopher and university teacher (1806-1871)", "wikipedia_url": "https://en.wikipedia.org/wiki/Augustus_De_Morgan", "wikipedia_page": {"main": "Augustus De Morgan (27 June 1806 – 18 March 1871) was a British mathematician and logician. He formulated De Morgan's laws and introduced the term mathematical induction, making its idea rigorous.", "link_mentions": [{"page": "Ada Lovelace", "response": ["From 1832, when she was seventeen, her mathematical abilities began to emerge, and her interest in mathematics dominated the majority of her adult life. Her mother's obsession with rooting out any of the insanity of which she accused Byron was one of the reasons that Ada was taught mathematics from an early age. She was privately educated in mathematics and science by William Frend, William King,William King, her tutor, and William King, her future husband, were not related. and Mary Somerville, the noted 19th-century researcher and scientific author. In the 1840s, the mathematician Augustus De Morgan extended her \"much help in her mathematical studies\" including study of advanced calculus topics including the \"numbers of Bernoulli\" (that formed her celebrated algorithm for Babbage's Analytical Engine).Thomas J. Misa, \"Charles Babbage, Ada Lovelace, and the Bernoulli Numbers\" in Ada's Legacy: Cultures of Computing from the Victorian to the Digital Age, edited by Robin Hammerman and Andrew L. Russell (ACM Books, 2015), pp. 18–20, . In a letter to Lady Byron, De Morgan suggested that Ada's skill in mathematics might lead her to become \"an original mathematical investigator, perhaps of first-rate eminence.\""]}, {"page": "Anagram", "response": ["Examples from the 19th century are the transposition of \"Horatio Nelson\" into Honor est a Nilo (Latin: Honor is from the Nile); and of \"Florence Nightingale\" into \"Flit on, cheering angel\". The Victorian love of anagramming as recreation is alluded to by the mathematician Augustus De MorganIn his A Budget of Paradoxes, p. 82. using his own name as an example; \"Great Gun, do us a sum!\" is attributed to his son William De Morgan, but a family friend John Thomas Graves was prolific, and a manuscript with over 2,800 has been preserved.Robert Edoward Moritz, On Mathematics and Mathematicians (2007), p. 151.Anna Stirling, William De Morgan and His Wife (1922) p. 64."]}, {"page": "Alfred Russel Wallace", "response": ["Spiritualism appealed to many educated Victorians who no longer found traditional religious doctrine, such as that of the Church of England, acceptable yet were unsatisfied with the completely materialistic and mechanical view of the world that was increasingly emerging from 19th-century science.Slotten p. 4. However, several scholars who have researched Wallace's views in depth have emphasised that, for him, spiritualism was a matter of science and philosophy rather than religious belief. Among other prominent 19th-century intellectuals involved with spiritualism were the social reformer Robert Owen, who was one of Wallace's early idols,Slotten p. 232. the physicists William Crookes and Lord Rayleigh, the mathematician Augustus De Morgan, and the Scottish publisher Robert Chambers.Shermer p. 183."]}, {"page": "Boolean algebra (structure)", "response": ["The term \"Boolean algebra\" honors George Boole (1815–1864), a self-educated English mathematician. He introduced the algebraic system initially in a small pamphlet, The Mathematical Analysis of Logic, published in 1847 in response to an ongoing public controversy between Augustus De Morgan and William Hamilton, and later as a more substantial book, The Laws of Thought, published in 1854. Boole's formulation differs from that described above in some important respects. For example, conjunction and disjunction in Boole were not a dual pair of operations. Boolean algebra emerged in the 1860s, in papers written by William Jevons and Charles Sanders Peirce. The first systematic presentation of Boolean algebra and distributive lattices is owed to the 1890 Vorlesungen of Ernst Schröder. The first extensive treatment of Boolean algebra in English is A. N. Whitehead's 1898 Universal Algebra. Boolean algebra as an axiomatic algebraic structure in the modern axiomatic sense begins with a 1904 paper by Edward V. Huntington. Boolean algebra came of age as serious mathematics with the work of Marshall Stone in the 1930s, and with Garrett Birkhoff's 1940 Lattice Theory. In the 1960s, Paul Cohen, Dana Scott, and others found deep new results in mathematical logic and axiomatic set theory using offshoots of Boolean algebra, namely forcing and Boolean-valued models."]}, {"page": "Charles Babbage", "response": ["Mary Everest Boole claimed that there was profound influence – via her uncle George Everest – of Indian thought in general and Indian logic, in particular, on Babbage and on her husband George Boole, as well as on Augustus De Morgan:"]}, {"page": "Charles Sanders Peirce", "response": ["Between 1859 and 1891, Peirce was intermittently employed in various scientific capacities by the United States Coast Survey and its successor, the United States Coast and Geodetic Survey,Burch, Robert (2001, 2010), \"Charles Sanders Peirce\", Stanford Encyclopedia of Philosophy where he enjoyed his highly influential father's protection until the latter's death in 1880. That employment exempted Peirce from having to take part in the American Civil War; it would have been very awkward for him to do so, as the Boston Brahmin Peirces sympathized with the Confederacy. At the Survey, he worked mainly in geodesy and gravimetry, refining the use of pendulums to determine small local variations in the Earth's gravity. He was elected a resident fellow of the American Academy of Arts and Sciences in January 1867. The Survey sent him to Europe five times, first in 1871 as part of a group sent to observe a solar eclipse. There, he sought out Augustus De Morgan, William Stanley Jevons, and William Kingdon Clifford, British mathematicians and logicians whose turn of mind resembled his own. From 1869 to 1872, he was employed as an assistant in Harvard's astronomical observatory, doing important work on determining the brightness of stars and the shape of the Milky Way.Moore, Edward C., and Robin, Richard S., eds., (1964), Studies in the Philosophy of Charles Sanders Peirce, Second Series, Amherst: U. of Massachusetts Press. On Peirce the astronomer, see Lenzen's chapter. On April 20, 1877, he was elected a member of the National Academy of Sciences. Also in 1877, he proposed measuring the meter as so many wavelengths of light of a certain frequency,Fisch, Max (1983), \"Peirce as Scientist, mathematician, historian, Logician, and Philosopher\", Studies in Logic (new edition), see p. x. the kind of definition employed from 1960 to 1983.", " Beginning with his first paper on the \"Logic of Relatives\" (1870), Peirce extended the theory of relations that Augustus De Morgan had just recently awakened from its Cinderella slumbers. Much of the mathematics of relations now taken for granted was \"borrowed\" from Peirce, not always with all due credit; on that and on how the young Bertrand Russell, especially his Principles of Mathematics and Principia Mathematica, did not do Peirce justice, see Anellis (1995). In 1918 the logician C. I. Lewis wrote, \"The contributions of C.S. Peirce to symbolic logic are more numerous and varied than those of any other writer—at least in the nineteenth century.\"Lewis, Clarence Irving (1918), A Survey of Symbolic Logic, see ch. 1, §7 \"Peirce\", pp. 79–106, see p. 79 (Internet Archive). Note that Lewis's bibliography lists works by Frege, tagged with asterisks as important. Beginning in 1940, Alfred Tarski and his students rediscovered aspects of Peirce's larger vision of relational logic, developing the perspective of relation algebra."]}, {"page": "Four color theorem", "response": ["As far as is known,There is some mathematical folk-lore that Möbius originated the four-color conjecture, but this notion seems to be erroneous. See  &  the conjecture was first proposed on October 23, 1852,Donald MacKenzie, Mechanizing Proof: Computing, Risk, and Trust (MIT Press, 2004) p103 when Francis Guthrie, while trying to color the map of counties of England, noticed that only four different colors were needed. At the time, Guthrie's brother, Frederick, was a student of Augustus De Morgan (the former advisor of Francis) at University College London. Francis inquired with Frederick regarding it, who then took it to De Morgan (Francis Guthrie graduated later in 1852, and later became a professor of mathematics in South Africa). According to De Morgan:"]}, {"page": "June 27", "response": ["*1806 – Augustus De Morgan, English mathematician and logician (d. 1871)"]}, {"page": "Johann Heinrich Alsted", "response": ["Alsted has been called 'one of the most important encyclopedists of all time'. He was a prolific writer, and his Encyclopaedia (1630) long had a high reputation.  It was preceded by shorter works, including the 1608 Encyclopaedia cursus philosophici. His major encyclopedia of 1630, the Encyclopaedia, Septem Tomis Distincta, was divided into 35 books, and had 48 synoptical tables as well as an index. Alsted described it as \"a methodical systemization of all things which ought to be learned by men in this life. In short, it is the totality of knowledge.\" In its time it was praised by Bernard Lamy and Cotton Mather, and it informed the work of Alsted's student John Amos Comenius. An unfinished encyclopedic project by Gottfried Wilhelm Leibniz began as a plan to expand and modernize it, and the famous diarist Samuel Pepys purchased a copy in 1660—thirty years after its initial publication. Although Jacob Thomasius criticised it for plagiarism for verbatim copying without acknowledgment, Augustus De Morgan later called it \"the true parent of all the Encyclopædias, or collections of treatises, or works in which that character predominates\"."]}, {"page": "Leonhard Euler", "response": ["Dieudonné Thiébault with embellishment by Augustus De Morgan."]}, {"page": "Propositional calculus", "response": ["Propositional logic was eventually refined using symbolic logic. The 17th/18th-century mathematician Gottfried Leibniz has been credited with being the founder of symbolic logic for his work with the calculus ratiocinator. Although his work was the first of its kind, it was unknown to the larger logical community. Consequently, many of the advances achieved by Leibniz were recreated by logicians like George Boole and Augustus De Morgan—completely independent of Leibniz."]}, {"page": "Index of philosophy articles (A–C)", "response": ["* Augustus De Morgan"]}, {"page": "Finitary relation", "response": ["The logician Augustus De Morgan, in work published around 1860, was the first to articulate the notion of relation in anything like its present sense. He also stated the first formal results in the theory of relations (on De Morgan and relations, see Merrill 1990).", "* Merrill, Dan D. (1990) Augustus De Morgan and the logic of relations. Kluwer."]}, {"page": "Mathematical logic", "response": ["In the middle of the nineteenth century, George Boole and then Augustus De Morgan presented systematic mathematical treatments of logic.  Their work, building on work by algebraists such as George Peacock, extended the traditional Aristotelian doctrine of logic into a sufficient framework for the study of foundations of mathematics. Charles Sanders Peirce later built upon the work of Boole to develop a logical system for relations and quantifiers, which he published in several papers from 1870 to 1885."]}, {"page": "March 18", "response": ["*1871 – Augustus De Morgan, Indian-English mathematician and academic (b. 1806)"]}, {"page": "Probability", "response": ["In the nineteenth century, authors on the general theory included Laplace, Sylvestre Lacroix (1816), Littrow (1833), Adolphe Quetelet (1853), Richard Dedekind (1860), Helmert (1872), Hermann Laurent (1873), Liagre, Didion and Karl Pearson. Augustus De Morgan and George Boole improved the exposition of the theory."]}, {"page": "Set (mathematics)", "response": ["Augustus De Morgan stated two laws about sets."]}, {"page": "1871", "response": ["* March 18 – Augustus De Morgan, English professor of mathematics, mathematician (b. 1806)"]}, {"page": "1806", "response": ["* June 27 – Augustus De Morgan, British mathematician, logician (d. 1871)"]}, {"page": "George Boole", "response": ["In 1847, Boole published the pamphlet Mathematical Analysis of Logic. He later regarded it as a flawed exposition of his logical system and wanted An Investigation of the Laws of Thought on Which are Founded the Mathematical Theories of Logic and Probabilities to be seen as the mature statement of his views. Contrary to widespread belief, Boole never intended to criticise or disagree with the main principles of Aristotle's logic. Rather he intended to systematise it, to provide it with a foundation, and to extend its range of applicability.John Corcoran, Aristotle's Prior Analytics and Boole's Laws of Thought, History and Philosophy of Logic, vol.  24 (2003), pp. 261–288. Boole's initial involvement in logic was prompted by a current debate on quantification, between Sir William Hamilton who supported the theory of \"quantification of the predicate\", and Boole's supporter Augustus De Morgan who advanced a version of De Morgan duality, as it is now called. Boole's approach was ultimately much further reaching than either sides' in the controversy. It founded what was first known as the \"algebra of logic\" tradition.Witold Marciszewski (editor), Dictionary of Logic as Applied in the Study of Language (1981), pp. 194–5.", "Boole's work was extended and refined by a number of writers, beginning with William Stanley Jevons. Augustus De Morgan had worked on the logic of relations, and Charles Sanders Peirce integrated his work with Boole's during the 1870s.Ivor Grattan-Guinness, Gérard Bornet, George Boole: Selected manuscripts on logic and its philosophy (1997), p. xlvi; Google Books. Other significant figures were Platon Sergeevich Poretskii, and William Ernest Johnson. The conception of a Boolean algebra structure on equivalent statements of a propositional calculus is credited to Hugh MacColl (1877), in work surveyed 15 years later by Johnson. Surveys of these developments were published by Ernst Schröder, Louis Couturat, and Clarence Irving Lewis.", "Mary Boole claimed that there was profound influence – via her uncle George Everest – of Indian thought in general and Indian logic, in particular, on George Boole, as well as on Augustus De Morgan and Charles Babbage:Kak, S. (2018) George Boole’s Laws of Thought and Indian logic. Current Science, vol. 114, 2570–2573"]}, {"page": "Alfred North Whitehead", "response": ["In A Treatise on Universal Algebra (1898), the term universal algebra had essentially the same meaning that it has today: the study of algebraic structures themselves, rather than examples (\"models\") of algebraic structures.George Grätzer, Universal Algebra (Princeton: Van Nostrand Co., Inc., 1968), v. Whitehead credits William Rowan Hamilton and Augustus De Morgan as originators of the subject matter, and James Joseph Sylvester with coining the term itself.Cf. Michel Weber and Will Desmond (eds.). Handbook of Whiteheadian Process Thought (Frankfurt / Lancaster, Ontos Verlag, Process Thought X1 & X2, 2008) and Ronny Desmet & Michel Weber (edited by), Whitehead. The Algebra of Metaphysics. Applied Process Metaphysics Summer Institute Memorandum, Louvain-la-Neuve, Les Éditions Chromatika, 2010."]}, {"page": "Universal algebra", "response": ["In Alfred North Whitehead's book A Treatise on Universal Algebra, published in 1898, the term universal algebra had essentially the same meaning that it has today. Whitehead credits William Rowan Hamilton and Augustus De Morgan as originators of the subject matter, and James Joseph Sylvester with coining the term itself."]}, {"page": "Murphy's law", "response": ["Mathematician Augustus De Morgan wrote on June 23, 1866:\"Supplement to the Budget of Paradoxes\", The Athenaeum no. 2017 page 836 col. 2 [and later reprints: e.g. 1872, 1915, 1956, 2000]"]}, {"page": "Classical logic", "response": ["The writings of Augustus De Morgan and Charles Sanders Peirce also pioneered classical logic with the logic of relations. Peirce influenced Giuseppe Peano and Ernst Schröder."]}, {"page": "Augustus DeMorgan", "response": ["#REDIRECT Augustus De Morgan"]}, {"page": "De Morgan's laws", "response": ["In propositional logic and Boolean algebra, De Morgan's lawsCopi and CohenMoore and Parker are a pair of transformation rules that are both valid rules of inference. They are named after Augustus De Morgan, a 19th-century British mathematician. The rules allow the expression of conjunctions and disjunctions purely in terms of each other via negation.", "The laws are named after Augustus De Morgan (1806–1871),DeMorgan’s Theorems at mtsu.edu who introduced a formal version of the laws to classical propositional logic. De Morgan's formulation was influenced by algebraization of logic undertaken by George Boole, which later cemented De Morgan's claim to the find. Nevertheless, a similar observation was made by Aristotle, and was known to Greek and Medieval logicians.Bocheński's History of Formal Logic For example, in the 14th century, William of Ockham wrote down the words that would result by reading the laws out.William of Ockham, Summa Logicae, part II, sections 32 and 33. Jean Buridan, in his Summulae de Dialectica, also describes rules of conversion that follow the lines of De Morgan's laws.Jean Buridan, Summula de Dialectica. Trans. Gyula Klima. New Haven: Yale University Press, 2001. See especially Treatise 1, Chapter 7, Section 5.  Still, De Morgan is given credit for stating the laws in the terms of modern formal logic, and incorporating them into the language of logic. De Morgan's laws can be proved easily, and may even seem trivial.Augustus De Morgan (1806–1871)  by Robert H. Orr Nonetheless, these laws are helpful in making valid inferences in proofs and deductive arguments."]}, {"page": "Flea", "response": ["The comic poem Siphonaptera was written in 1915 by the mathematician Augustus De Morgan,  It describes an infinite chain of parasitism made of ever larger and ever smaller fleas."]}, {"page": "Euler's constant", "response": ["The constant first appeared in a 1734 paper by the Swiss mathematician Leonhard Euler, titled De Progressionibus harmonicis observationes (Eneström Index 43). Euler used the notations  and  for the constant. In 1790, Italian mathematician Lorenzo Mascheroni used the notations  and  for the constant. The notation  appears nowhere in the writings of either Euler or Mascheroni, and was chosen at a later time perhaps because of the constant's connection to the gamma function. For example, the German mathematician Carl Anton Bretschneider used the notation  in 1835 and Augustus De Morgan used it in a textbook published in parts from 1836 to 1842."]}, {"page": "DeMorgan", "response": ["#REDIRECT Augustus De Morgan"]}, {"page": "Augustus de Morgan", "response": ["#REDIRECT Augustus De Morgan"]}, {"page": "Isaac Todhunter", "response": ["The son of George Todhunter, a Nonconformist minister, and Mary née Hume, he was born at Rye, Sussex. He was educated at Hastings, where his mother had opened a school after the death of his father in 1826. He became an assistant master at a school at Peckham, attending at the same time evening classes at the University College, London where he was influenced by Augustus De Morgan. In 1842 he obtained a mathematical scholarship and graduated as B.A. at London University, where he was awarded the gold medal on the M.A. examination. About this time he became mathematical master at a school at Wimbledon."]}]}}