{"wiki_id": "http://www.wikidata.org/entity/Q20810522", "itemLabel": "Thomas Wilde Boothby", "itemDescription": "Australian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Wilde_Boothby", "wikipedia_page": {"main": "Thomas Wilde Boothby (9 December 1839 – 19 June 1885), generally known by his full name, or as \"T. Wilde Boothby\", was a politician in the British colony of South Australia.\n\n", "link_mentions": [{"page": "Naracoorte, South Australia", "response": ["* Thomas Wilde Boothby"]}, {"page": "Guy Boothby", "response": ["Boothby was born in Adelaide to a prominent family in the recently established British colony of South Australia.'Boothby, Guy Newell (1867–1905)', Australian Dictionary of Biography, Volume 7, Melbourne University Press, 1979, pp 347–348. His father was Thomas Wilde Boothby,G. N. Hawker, 'Boothby, Thomas Wilde (1839–1885)', Australian Dictionary of Biography, Volume 3, Melbourne University Press, 1969, pp 196–197. who for a time was a member of the South Australian Legislative Assembly, three of his uncles were senior colonial administrators, and his grandfather was Benjamin Boothby (1803–1868), controversial judge of the Supreme Court of South Australia from 1853 to 1867.Alex C Castles, 'Boothby, Benjamin (1803–1868)', Australian Dictionary of Biography, Volume 3, Melbourne University Press, 1969, pp 194–196. When Boothby was aged approximately seven his English-born mother, whom he held in great regard, separated from his father and returned with her children to England. There he received a traditional English grammar school education at Salisbury, Lord Weymouth's Grammar (now Warminster School) and Christ's Hospital, London."]}, {"page": "Benjamin Boothby", "response": ["*Thomas Wilde Boothby (9 December 1839 – 19 June 1885), pastoralist and parliamentarian, married Mary Agnes Hodding (1843 – 16 July 1907) on 10 March 1864. Their children included:"]}, {"page": "Boothby (surname)", "response": ["*Thomas Wilde Boothby (1839–1885), aka T. Wilde Boothby, a politician in South Australia"]}, {"page": "Thomas Boothby", "response": ["#REDIRECT Thomas Wilde Boothby"]}, {"page": "T. Wilde Boothby", "response": ["#REDIRECT Thomas Wilde Boothby"]}, {"page": "County of Jervois", "response": ["The Hundred of Boothby () was proclaimed on 24 January 1878.  It covers an area of  and was named after Thomas Wilde Boothby, a member of the South Australian Parliament from 1873 to 1875.  Its northern end is within the locality of Cleve while its southern end is in the locality of Arno Bay."]}]}}