{"wiki_id": "http://www.wikidata.org/entity/Q2084103", "itemLabel": "Boy Capel", "itemDescription": "English polo player", "wikipedia_url": "https://en.wikipedia.org/wiki/Boy_Capel", "wikipedia_page": {"main": "Captain Arthur Edward \"Boy\" Capel CBE (December 1881 – 22 December 1919) was an English polo player, possibly best-remembered for being a lover and muse of fashion designer Coco Chanel.\n\n", "link_mentions": [{"page": "Deauville", "response": ["* Deauville was a popular vacation spot for Coco Chanel during her affair with Boy Capel. The two opened her second shop there, which was the first place Chanel took the step from hat making to clothing. Deauville was the birthplace of Chanel's clothing career."]}, {"page": "Chanel", "response": ["Coco Chanel thus could sell to them the hats she designed and made; she thus earned a living independent of Balsan. In the course of those salons, Coco Chanel befriended Arthur \"Boy\" Capel, an English socialite and polo player friend of Étienne Balsan; per the upper class social custom. Chanel also became mistress to Boy Capel. Despite that social circumstance, Boy Capel perceived the businesswoman innate to Coco Chanel. And in 1910, Boy Capel financed her first independent millinery shop, Chanel Modes, at 21 rue Cambon in Paris. Because that locale already housed a dress shop, the business-lease limited Chanel to selling only millinery products, not couture. Two years later 1913, the Deauville and Biarritz couture shops of Coco Chanel offered for sale prêt-à-porter sports clothes for women, the practical designs of which allowed the wearer to play sports."]}, {"page": "George Ward, 1st Viscount Ward of Witley", "response": ["Lord Ward of Whitley married firstly Anne Diana France Aysham Capel, daughter of Boy Capel, in 1940. They had two children: the Hon. Georgina Anne Ward (13 March 1941 – June 2010), an actress of stage and screen, and the Hon. Anthony Giles Humble Ward (10 June 1943 – 4 May 1983), but were divorced in 1951. He married secondly Barbara Mary Colonsay McNeill, daughter of Ronald Frank Rous McNeill and former wife of Michael Astor, in 1962. She died in 1980. Lord Ward of Witley died in June 1988, aged 80. His only son had predeceased him without issue, and as a result his title became extinct on his death."]}, {"page": "1919 in the United Kingdom", "response": ["* 22 December – Boy Capel, industrialist, polo player, writer, and lover/muse of Coco Chanel (b. 1881)"]}, {"page": "Coco Chanel", "response": ["* Coco Chanel (2008) was a television movie starring Shirley MacLaine as the 70-year-old Chanel. Directed by Christian Duguay, the film also starred Barbora Bobuľová as the young Chanel and Olivier Sitruk as Boy Capel.", "* Coco avant Chanel (Coco Before Chanel) (2009) was a French-language biographical film directed by Anne Fontaine, starring Audrey Tautou as the young Chanel, with Benoît Poelvoorde as Étienne Balsan and Alessandro Nivola as Boy Capel"]}, {"page": "Capell", "response": ["* Arthur Boy Capel (died 1919), English polo player and lover and muse of fashion designer Coco Chanel"]}, {"page": "Charvet Place Vendôme", "response": ["In the early 20th century, Charvet launched a toilet water, in a rectangular beveled bottle. One of the customers for this perfume was Boy Capel, Coco Chanel's lover. In 1921, two years after his accidental death, the flacon of Chanel's famous Nº 5 perfume was produced in the image of the Charvet bottle."]}, {"page": "Olivier Sitruk", "response": ["Sitruk made his English-language movie premiere in 2008, starring alongside Shirley MacLaine and Barbora Bobuľová in the Lifetime original biographical film, Coco Chanel.  The television movie debuted on September 13, 2008 with a viewership of 5.2 million, the second-highest rated made-for-TV film of 2008.http://tvbythenumbers.com/2008/09/15/lifetimes-coco-chanel-sews-up-52-million-viewers/5115  Sitruk played Boy Capel, a self-made man who was \"the love of [Chanel's] life.\""]}, {"page": "Hotel Barrière Le Normandy Deauville", "response": ["One year after its opening, funded by her English lover Boy Capel, Coco Chanel set up her Chanel hat shop within the hotel grounds."]}, {"page": "Chanel Solitaire", "response": ["* Timothy Dalton as Boy Capel"]}, {"page": "Coco Chanel & Igor Stravinsky", "response": ["* Anatole Taubman as Boy Capel"]}, {"page": "Arthur Capel", "response": ["#REDIRECT Boy Capel"]}, {"page": "Arthur Edward 'Boy' Capel", "response": ["#REDIRECT Boy Capel"]}, {"page": "Boy Capel CBE", "response": ["#REDIRECT Boy Capel"]}, {"page": "Arthur Edward Capel", "response": ["#REDIRECT Boy Capel"]}, {"page": "Captain Arthur Capel", "response": ["#REDIRECT Boy Capel"]}, {"page": "Captain Arthur Edward Capel CBE", "response": ["#REDIRECT Boy Capel"]}, {"page": "Boy (name)", "response": ["* Boy Capel (1881–1919), English polo player, lover and muse of fashion icon Coco Chanel"]}, {"page": "Stern family", "response": ["***** Herman Alfred Stern (1900–1984), married to Beatrice Capel  (sister of Boy Capel)"]}]}}