{"wiki_id": "http://www.wikidata.org/entity/Q20880445", "itemLabel": "John Quinton", "itemDescription": "English banker and football executive", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Quinton_(banker)", "wikipedia_page": {"main": "Sir John Quinton (21 December 1929 – 28 April 2012) was chairman of Barclays Bank from 1987-92.\nIn 1987, he succeeded Timothy Bevan as chairman of Barclays Bank, until 1992, when he was succeeded by Andrew Buxton.Quinton was the first chairman of the FA Premier League.\n\n", "link_mentions": [{"page": "John Quinton", "response": ["John Quinton was born in Brockley, near Lewisham, south east London in 1921 and was educated at Christ's College, Finchley leaving in 1937 having passed the London General School Examination with Matriculation.", "John Quinton was a keen Boy Scout and joined the 186 North London Scout Troop that met in the Church Hall of the Whetstone Congregational Church.  He rapidly became a Patrol Leader and attended camps at Gilwell Park, Essex, as well as the World Scout Jamboree in the Netherlands in 1937.  In 1938 he was chosen to lead the troop camp in Kandersteg, Switzerland.  He then moved up to become a Rover Scout and was awarded the King's Scout badge.  During the war his father, Charles, took on the Rover Scout leadership of the group and his mother, Kate, was also heavily involved with the families of the troop with one or more members on active service; his two brothers Ken and Mike were also members of the troop.  After the end of the war John went back to Scouting and the 186 Troop, ending up as their Group Scout Master.  The story of his death was subsequently published in an article in the 1962 Scout Annual entitled \"He Lived – and Died – by the Scout Law\" which was written by Leslie Hunt who had served with him during the war."]}, {"page": "Deaths in April 2012", "response": ["*Sir John Quinton, 82, British banker (Barclays).Sir John Quinton"]}, {"page": "Barclays", "response": ["# John Quinton (1987–1992)"]}, {"page": "List of Old Norvicensians", "response": ["* Sir John Quinton, chairman of Barclays Bank and the first chairman of the FA Premier League"]}, {"page": "Broadcasting and the foundation of the Premier League", "response": ["Premier League chief executive Rick Parry and chairman Sir John Quinton were assigned the task of finding suitors. Parry initially favoured working with ITV, led by Greg Dyke, but wanted the network to pay in excess of £30 million for live football. In the meantime BSkyB – a company formed by the merger of Rupert Murdoch's Sky Television, and British Satellite Broadcasting – looked into the possibility of obtaining live rights to the Premier League. BSkyB chief executive Sam Chisholm attempted to make a joint offer with ITV which did not come into fruition, so he formed an alliance with the BBC, aware the corporation wanted a highlights package. Although Chisholm was against Parry's idea of a football-only channel, he built a rapport with the Premier League and his company invited Parry to its facilities in Livingston, where he spoke to Murdoch in person.", "Unlike the Football League, the Premier League was set up with a two-man board: Rick Parry, the chief executive, and Sir John Quinton who was appointed as the league's chairman in December 1991. Decisions would be taken on by all members, through a one club-one vote motion. A clear majority needed two-thirds."]}, {"page": "Timothy Bevan", "response": ["He served on the Board of Directors of Barclays Bank from 1966 to 1993. From 1968 to 1974, he served as its Vice Chairman. He served as its Chairman from 1981 to 1987, being succeeded by Sir John Quinton."]}, {"page": "Andrew Buxton", "response": ["In 1993, he succeeded Sir John Quinton as chairman of Barclays Bank. He served as Chairman until 1999."]}]}}