{"wiki_id": "http://www.wikidata.org/entity/Q2089742", "itemLabel": "Cammy Bell", "itemDescription": "Scottish footballer (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Cammy_Bell", "wikipedia_page": {"main": "Cameron Bell (born 18 September 1986) is a Scottish football coach and former player who is currently the director of football at Annan Athletic. Bell played as a goalkeeper for several Scottish clubs and once for the Scotland national team.\nBell began his senior career with Kilmarnock and, after loan spells with Montrose and Queen of the South, went on to play over 100 matches for the club and win the Scottish League Cup in 2012. He represented Scotland once, in 2010.\nBell joined Rangers in 2013, helping them to the Scottish League One title in his first season. He played for Dundee United during the 2016–17 season, saving three penalty kicks in one match against Dunfermline.\nHe then had short spells with Kilmarnock, Hibernian, Partick Thistle, St. Johnstone, Falkirk and Queen's Park before his retirement.", "link_mentions": [{"page": "Dumfries", "response": ["Dumfries has produced a steady stream of professional footballers and managers. The best known footballers of their eras to come from Dumfries are probably Dave Halliday, Ian Dickson, Bobby Ancell, Billy Houliston, Jimmy McIntosh, Willie McNaught and Ted McMinn. Halliday, Dickson, Houliston and McMinn played for home town club, Queen of the South during their careers. Dominic Matteo was born in Dumfries but moved to England while still a young boy. Barry Nicholson lost 4–3 to Queens playing for Aberdeen in the 2008 Scottish Cup semi-finals despite scoring against the team he supported as a boy. Ancell, Houliston, McNaught and Nicholson have represented Scotland and were joined in having done so in season 2010/11 by Cammy Bell and Grant Hanley. Matteo gained 6 full caps for Scotland after having represented England at under-21 level. Halliday was overlooked by Scotland in favour of Hughie Gallacher. Gallacher played for The Queen's but was not from Dumfries. It was as a manager rather than a player that Thomas Mitchell made his name as a multiple FA Cup winner at Blackburn Rovers before joining Woolwich Arsenal as Arsenal F.C. were then named."]}, {"page": "SuperCupNI", "response": ["* Cammy Bell (Kilmarnock) 2002, 2003 (U16)"]}, {"page": "Kilmarnock F.C.", "response": ["After Calderwood left the team at the end of the season, Mixu Paatelainen was appointed manager for the next two years with an option for a third. Despite being the favourites for relegation that season, Kilmarnock finished the season in fifth position. Paatelainen left Kilmarnock to become manager of Finland and his assistant Kenny Shiels was appointed manager. Kilmarnock progressed to the 2012 Scottish League Cup Final with wins against Queen of the South, East Fife and Ayr United in an Ayrshire derby at Hampden. Kilmarnock won the League Cup for the first time, as they defeated Celtic 1–0 in the final. Dieter van Tornhout scored the only goal six minutes from time, with Cammy Bell named Man of the Match. In June 2013, after three years at Kilmarnock Football Club, manager Kenny Shiels was sacked by chairman Michael Johnston after a \"mutual agreement\" between the two.", "*Cammy Bell"]}, {"page": "Steve Simonsen", "response": ["Simonsen was the back-up goalkeeper to Cammy Bell until making his debut for Rangers on 20 January against Forfar, where he won praise for an outstanding reflex save during a 2–0 win for Rangers. Simonsen's only other first team appearance that season for Rangers was in their Scottish Cup semi-final tie against Dundee United, where Simonsen's misplaced kick-out led directly to Dundee United's third goal in a 3–1 defeat for the Ibrox club. After the match, Manager Ally McCoist said he has no sympathy to Simonsen following criticism was directly made to him. Simonsen later described this as \"cruel moment\". Despite on 3 May, Rangers players made history by becoming the first Rangers side in 115 years to go an entire league season unbeaten after a 1–1 draw with Dunfermline during which they clinched the Scottish League One championship. Following the end of the season, he was part of a young Rangers squad that featured in the HKFC International Soccer Sevens held in May."]}, {"page": "Neil Alexander", "response": ["Alexander left Rangers at the end of the 2012–13 season despite expressing his desire to remain at the club. Although he accepted the need to take a pay cut due to the club's financial troubles, he was unhappy with the amount that was offered to him, commenting \"I was desperate to stay but the contract offer was just not acceptable. I deserved better.\" Alexander had been hoping for a two-year extension with the club, similar to a deal given to club captain Lee McCulloch, but was offered a one-year deal at Ibrox and on less than a third of the original £10,000 a week wage offered by the club. After rejecting the deal, Rangers confirmed the pre-contract signing of Cammy Bell as his replacement. Manager Ally McCoist and goalkeeping coach Jim Stewart both tried to convince Alexander to stay with the club."]}, {"page": "Lee Robinson (footballer)", "response": ["Robinson then signed for Kilmarnock on a free transfer. He made one first team appearance in his season at Rugby Park coming on as an early substitute for the injured Cammy Bell against Hibs. Robinson claimed man of the match for his performance after frustrating the opposition with a number of saves including a penalty save which would become a trademark of his game in the upcoming years.", "Robinson signed for Rangers in August 2014, as manager Ally McCoist sought cover for the injured Cammy Bell.Rangers: Goalkeeper Lee Robinson agrees Ibrox deal, BBC Sport After claiming the number one position, he played seven games under the caretaker management of Kenny McDowall. Robinson was released by Rangers at the end of the 2014–15 season."]}, {"page": "Bell (surname)", "response": ["* Cammy Bell (born 1986), Scottish international football goalkeeper"]}, {"page": "Kyle Letheren", "response": ["Letheren signed for Kilmarnock in August 2010, to provide backup to Cammy Bell. Letheren failed to make an appearance for Kilmarnock in his first season, mostly down to the form of Bell. In 2011–12, he was handed his Scottish Premier League debut as a half time substitute for the injured Bell, ironically against Motherwell, at 0–0 and Kilmarnock went on to win the game 2–0. Later that year he was handed his full SPL debut away to Dunfermline Athletic, in a 2–1 win.", "During the 2012–13 season, Cammy Bell suffered an injury leading to Letheren having a run in the first team. That run lasted until mid-October, when Bell returned. His second run in the first team came in early-February, when he played twice, he was involved in a 2–0 win over motherwell & in what was his last appearance for the club, a 1–1 draw against Inverness Caledonian Thistle."]}, {"page": "Cameron Bell", "response": ["#REDIRECT Cammy Bell"]}, {"page": "History of Queen of the South F.C.", "response": ["In the away leg Bob Harris had the Doonhamers in the lead from a free-kick after 2 minutes. With Queen pushing for the critical second goal and throwing caution to the wind late in the game, with 5 minutes remaining two goals by Martin Bernburg of Nordsjælland put the tie beyond Queen's. Despite Dobbie being the most prolific goal scorer at Queen's since Andy Thomson in the early 1990s, Chisholm elected to leave Dobbie out of the starting line-up for both games, preferring instead to play Stewart Kean. Among those selected to start for Queen's was on loan future Scotland international, Cammy Bell."]}, {"page": "2010–11 Kilmarnock F.C. season", "response": ["|13||||GK||Cammy Bell||1||0||0||0||0||0||1||0"]}, {"page": "Kenny Shiels", "response": ["At the start of the 2012–13 season, Shiels was given two-match touchline ban by the SFA in June, having served one suspension on the last game of the season and miss one match at the opening game of the season. His touchline ban was given over commenting made about a referee's decisions made in a match between Celtic and St Johnstone. Following a controversial penalty in a 2–0 defeat against Hibernian on 16 September 2012, Shiels expressed support of needing TV evidence to be shown and branded Hibernian's player Paul Cairney as a \"diver\". On 28 October 2012, Shiels led Kilmarnock to a historic win at Celtic Park against Celtic. The victory was Kilmarnock's first win in the East End of Glasgow for 57 years and led to prominent Killie fans claiming Shiels is the best thing to ever happen to Kilmarnock. After the match, Shiels praised Kelly, whose father died of a heart attack in March, for performance, making him [Shiels] pleased and also praised two of his youngster's for his performance. A week after a memorable win over Celtic, Shiels would report referee Euan Norris of making inappropriate comments, following a 2-1 default against Inverness Caledonian Thistle, which Norris would send-off Cammy Bell. His support even attracted FIFA vice-president Jim Boyce, suggesting that SFA should hire Shiels. His remark also led to Shiels given a five-match touchline ban after disciplinary hearing with the SFA. Following this, Shiels then appealed against his decision, but will serve his touchline ban."]}, {"page": "2011–12 Kilmarnock F.C. season", "response": ["| Cammy Bell"]}, {"page": "Wes Foderingham", "response": ["On 3 July 2015, Foderingham signed a three-year contract with then Scottish Championship club Rangers. He made his debut for the Ibrox club in a 6–2 win over Hibernian in the first round of the Scottish Challenge Cup and was Rangers' first choice goalkeeper over Cammy Bell under new Rangers manager Mark Warburton. On 19 July 2016, Foderingham extended his contract with Rangers for another year until 2019. In July 2018, under new Manager Steven Gerrard, Foderingham became second-choice goalkeeper largely due to the return of Allan McGregor to the Rangers team after a six-year absence. Foderingham made his first appearance of the season for Rangers in a 3–1 win over Kilmarnock in the Scottish League Cup. On 19 May 2020 it was announced that he would leave Rangers at the end of May when his contract ended."]}, {"page": "2012 Scottish League Cup Final", "response": ["Early in the match Kilmarnock defender Mohamadou Sissoko's pass across the penalty area was intercepted by Gary Hooper. However, his shot was saved by goalkeeper Cammy Bell who came off his line quickly. Shortly after Dean Shiels shot narrowly wide from the edge of the area. Around 30 minutes in Scott Brown made room for himself on the right before crossing for Anthony Stokes whose header was saved by Bell. Shiels had another chance but his shot was saved by Fraser Forster. From the resulting corner Sissoko's header was cleared off the line by Stokes. Bell made another save when he tipped Brown's powerful shot from outside the box over the bar. Paul Heffernan was then played in on the right-hand side of the box but his shot was saved by Forster.", "|GK||1|| Cammy Bell", "Kilmarnock goalkeeper Cammy Bell was named man of the match, Sky Sports said that he, \"produced a series of top-drawer saves to deny the Bhoys\"."]}, {"page": "2012–13 Kilmarnock F.C. season", "response": ["| Cammy Bell"]}, {"page": "PFA Scotland Team of the Year", "response": ["| GK ||  style=\"width:200px;\"| Cammy Bell || style=\"width:200px;\"| Rangers ||align=\"center\"|1", "| GK ||  style=\"width:200px;\"| Cammy Bell || style=\"width:200px;\"| Dundee United ||align=\"center\"|1"]}]}}