{"wiki_id": "http://www.wikidata.org/entity/Q20810480", "itemLabel": "Horace Bell", "itemDescription": "English civil engineer and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Horace_Bell_(engineer)", "wikipedia_page": {"main": "Horace Bell (17 June 1839 – 10 April 1903) was an English civil engineer. As his career progressed he also became increasingly prolific as an author.After eight years working in England as a railway engineer Bell relocated to British India (as it was known at the time), where he was in charge of several major railway and related construction projects. He retired in 1894 after which he returned, this time permanently, to England, but he continued to work for several Indian railway companies on a consultancy basis.He wrote several pamphlets and books on railways policy, later also producing lengthy pamphlets on Economics and on Governance which were used as teaching material in government schools.\n\n", "link_mentions": [{"page": "Royal Indian Engineering College", "response": ["*Horace Bell (engineer)"]}, {"page": "Horace Bell", "response": ["Horace Bell (December 11, 1830 – June 29, 1918), was active in the American era of 19th century California, especially in the Los Angeles region. He was a Los Angeles Ranger, filibuster, soldier, lawyer, journalist and newspaper publisher, and author of two Southern California history books.", "Horace Bell was born in Indiana on December 11, 1830.  He was educated in Kentucky and then came to Placerville in El Dorado County in eastern California in August 1850 for the California Gold Rush. He spent two years mining with little success.", "He came to Los Angeles in 1852 to visit an uncle, Alexander Bell, who had settled there in 1842 and married a Mexican Californio, He became wealthy as a trader and influential in politics. Horace Bell became a founding member of the Los Angeles Rangers, a militia company that pursued outlaws in the most violent, lawless county in Southern California.  In 1856, he left California to join in the Walkers Filibuster into Nicaragua, becoming a Major in Walkers army.  In 1859 he joined Benito Juárez's Army in Mexico during the Reform War.  He returned to Indiana to join as a scout in the Union Army during the American Civil War.", "thumb|275px|Horace Bell's daughters, in a carriage for La Fiesta de Los Angeles (1901).", "Horace Bell died on June 29, 1919. He was buried in Rosedale Cemetery in Los Angeles.Bell, Reminiscences of a Ranger, pp. vii-ix", "Horace Bell, was the author of two books about his life and the times of the early years of the State of California.  The first was an 1881 memoir, Reminiscences of a Ranger: Early Times in Southern California. More of his memoirs were included in a posthumously published On the Old West Coast: Being Further Reminiscences of a Ranger (1930). \"Horace Bell, Reminiscences of a Ranger: Early Times in Southern California\", University of Oklahoma Press, Norman, 1999, pp.i-xii Introduction by John Boessenecker  Both volumes are educational about the 19th century American era of California and Los Angeles history.", "The Bell Ranch, homesteaded by Horace Bell and his son Charlie in the 1880s, was in the Simi Hills and Rancho el Escorpión area of the western San Fernando Valley. Place names from that era include:", "The actor Robert Taylor played Bell in the 1967 episode, \"Major Horace Bell,\" of the syndicated television series,  Death Valley Days (q.v.).", "* books.google.com:  Horace Bell, \"On the old west coast, being further reminiscences of a ranger\" — Reprint edition, Arno Press, 1976"]}, {"page": "Horace (given name)", "response": ["*Horace Bell (1830–1918), American writer, soldier, and lawyer", "*Horace Bell (engineer) (1839–1903), English civil engineer"]}, {"page": "Lexham Gardens", "response": ["The civil engineer Horace Bell lived and died at no 114."]}, {"page": "Horace Bell (civil engineer)", "response": ["#REDIRECT Horace Bell (engineer)"]}]}}