{"wiki_id": "http://www.wikidata.org/entity/Q2086433", "itemLabel": "Philip Saville", "itemDescription": "British screenwriter (1930-2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Saville", "wikipedia_page": {"main": "Philip Saville (28 October 1930 – 22 December 2016) was a British  director, screenwriter and former actor whose career lasted half a century. The British Film Institute's Screenonline website described Saville as \"one of Britain's most prolific and pioneering television and film directors\". His work included 45 contributions to Armchair Theatre (1956-1972) and he won two Best Drama Series BAFTAs for Boys from the Blackstuff (1982) and The Life and Loves of a She-Devil (1986).", "link_mentions": [{"page": "Gospel of John", "response": ["The gospel has been depicted in live narrations and dramatized in productions, skits, plays, and Passion Plays, as well as in film. The most recent such portrayal is the 2014 film The Gospel of John, directed by David Batty and narrated by David Harewood and Brian Cox, with Selva Rasalingam as Jesus. The 2003 film The Gospel of John was directed by Philip Saville and narrated by Christopher Plummer, with Henry Ian Cusick as Jesus."]}, {"page": "Hans Christian Andersen", "response": ["* Hans Christian Andersen: My Life as a Fairy Tale (2003), a British made-for-television film directed by Philip Saville, a fictionalized account of Andersen's early successes, with his fairy stories intertwined with events in his own life."]}, {"page": "Oedipus Rex", "response": ["The second English-language film version, Oedipus the King (1968), was directed by Philip Saville and filmed in Greece. Unlike Guthrie's film, this version shows the actors' faces, as well as boasting an all-star cast, including Christopher Plummer as Oedipus; Lilli Palmer as Jocasta; Orson Welles as Tiresias; Richard Johnson as Creon; Roger Livesey as the Shepherd; and Donald Sutherland as the Leading Member of the Chorus. Sutherland's voice, however, was dubbed by another actor. The film went a step further than the play by actually showing, in flashback, the murder of Laius (portrayed by Friedrich Ledebur). It also shows Oedipus and Jocasta in bed together, making love. Though released in 1968, this film was not seen in Europe or the US until the 1970s and 1980s after legal release and distribution rights were granted to video and television."]}, {"page": "Out of the Unknown", "response": ["Series two was broadcast on Thursday nights at 9:30pm, beginning with the episode \"The Machine Stops\" on 6 October 1966. The new series was promoted in listings magazine Radio Times with a front cover of \"The Machine Stops\"’ star Yvonne Mitchell and an article previewing the upcoming episodes, written by Michael Imison. The two most notable productions of the series were \"The Machine Stops\" and \"Level Seven\". \"The Machine Stops\", directed by Philip Saville, was a particularly challenging production—later described by Shubik as \"the most complex and technically demanding script I have ever had in my hand\"Shubik, Play for Today, p. 126.—requiring large and complex sets, including construction of one with a working monorail. The effort paid off, however, as the adaptation was met with good reviews (\"A haunting film – and a deeply disturbing one\"Ward, Out of the Unknown, p. 172. – The Times) and was awarded first prize at the Fifth Festival Internazionale del Film di Fantascienza (International Science Fiction Film Festival) in Trieste on 17 July 1967.Ward, Out of the Unknown, p. 276.  \"Level Seven\" was adapted by J. B. Priestley and directed by Rudolph Cartier. Priestley's script had begun life as a potential screenplay for a feature film, and condensing it down to Out of the Unknown's standard running time of fifty minutes proved impossible. In the end, Shubik convinced the management of the BBC to allow \"Level Seven\" to run to sixty minutes as a one-off exceptional measure. Reviewing \"Level Seven\" in The Listener, J. C. Trewin said, \"the tension was inescapable, the excitement incontestable, more so, undoubtedly, than other thrusts into the future\".Ward, Out of the Unknown, p. 198. The robot costumes created for \"The Prophet\" were later reused in the Doctor Who serial \"The Mind Robber\"."]}, {"page": "1988 in film", "response": ["*The Fruit Machine, directed by Philip Saville, starring Emile Charles, Tony Forsyth, Robert Stephens, Robbie Coltrane and Bruce Payne (U.K.)"]}, {"page": "1966 in film", "response": ["* Stop the World – I Want to Get Off, directed by Philip Saville"]}, {"page": "BBC Television Shakespeare", "response": ["Although An Age of Kings, which was the most expensive and ambitious Shakespearean production up to that point, was a critical and commercial success, The Spread of the Eagle was not, and afterwards, the BBC decided to return to smaller scale productions with less financial risk. In 1964, for example, they screened a live performance of Clifford Williams' Royal Shakespeare Company (RSC) production of The Comedy of Errors from the Aldwych Theatre, starring Ian Richardson as Antipholus of Ephesus and Alec McCowen as Antipholus of Syracuse. 1964 also saw the broadcast of Hamlet at Elsinore, directed by Philip Saville and produced by Peter Luke. Starring Christopher Plummer as Hamlet, Robert Shaw as Claudius and June Tobin as Gertrude, the entire play was shot on-location in Helsingør at the real Elsinore Castle. In 1970, they screened The Tragedy of Richard II, sourced from Richard Cottrell's touring production, and starring Ian McKellen as Richard and Timothy West as Bolingbroke."]}, {"page": "Diana Rigg", "response": ["In the 1960s, Rigg lived for eight years with director Philip Saville, gaining attention in the tabloid press when she disclaimed interest in marrying the older and already-married Saville, saying that she had no desire \"to be respectable\". She was married to Menachem Gueffen, an Israeli painter, from 1973 until their divorce in 1976 and to Archibald Stirling, a theatrical producer and former officer in the Scots Guards, from 25 March 1982 until their divorce in 1990 after his affair with the actress Joely Richardson. With Stirling, Rigg had a daughter, actress Rachael Stirling, who was born in 1977, five years before their marriage."]}, {"page": "No Exit", "response": ["* In 1964 the BBC broadcast an adaptation with Harold Pinter as Garcin broadcast as part of its The Wednesday Play anthology series. It was adapted and directed by Philip Saville.http://bufvc.ac.uk/screenplays/index.php/prog/2888"]}, {"page": "The Freewheelin' Bob Dylan", "response": ["Twelve days later, Dylan made his first trip abroad. British TV director Philip Saville had heard Dylan perform in Greenwich Village, and invited him to take part in a BBC television drama: Madhouse on Castle Street. Dylan arrived in London on December 17. In the play, Dylan performed \"Blowin' in the Wind\" and two other songs. Dylan also immersed himself in the London folk scene, making contact with the Troubadour folk club organizer Anthea Joseph and folk singers Martin Carthy and Bob Davenport. \"I ran into some people in England who really knew those [traditional English] songs,\" Dylan recalled in 1984. \"Martin Carthy, another guy named [Bob] Davenport. Martin Carthy's incredible. I learned a lot of stuff from Martin.\"Loder, Kurt (1984), \"Interview with Kurt Loder, Rolling Stone\", reprinted in "]}, {"page": "List of film and television directors", "response": ["*Philip Saville"]}, {"page": "The Machine Stops", "response": ["* A television adaptation, directed by Philip Saville, was shown in the UK on 6 October 1966 as part of the British science-fiction anthology TV series Out of the Unknown."]}, {"page": "Design for Living", "response": ["A second television adaptation was broadcast by the BBC in its Play of the Month series in May 1979. Rula Lenska played Gilda with Clive Arrindell and Otto and John Steiner as Leo. The director was Philip Saville.Play of the Month: Noël Coward's Design for Living, BBC Genome, accessed 31 March 2020"]}, {"page": "The Gospel of John (2003 film)", "response": ["The Gospel of John is a 2003 epic film that recounts the life of Jesus according to the Gospel of John.John F. A. SawyerThe Blackwell Companion to the Bible and Culture 2012  \"Overshadowed by The Passion is British director Philip Saville's The Gospel of John (2003) a film whose text is the Gospel of John, ... The film is narrated by Christopher Plummer, whose authoritative voice makes the text sound like gospel\" The motion picture is a word-for-word adaptation of the American Bible Society's Good News Bible. This three-hour, epic, feature film follows the Gospel of John precisely, without additions to the story from the other Gospels or omissions of the Gospel's complex passages.", "Category:Films directed by Philip Saville"]}, {"page": "Leslie Ash", "response": ["Having appeared with her sister Debbie in the 1978 British slapstick comedy Rosie Dixon – Night Nurse; her first major film role was playing the romantic lead in Quadrophenia in 1979. In 1980, Ash appeared in the Iron Maiden music video, \"Women in Uniform\" and one of the two Dire Straits music videos of Tunnel of Love. In 1982 she played the role of a fast food chef in the fifth series of Shelley entitled \"When the Chip hits the Fan\", and appeared opposite Joan Collins in the film Nutcracker. In 1983, she had the starring role in The Balance of Nature, a film about a Cockney girl from a tower block with aspirations to win the Miss United Kingdom competition.”The Diary: will Colin consider it?” in The Stage (London, England), Thursday 05 May 1983, p. 15 The same year, she played Julie Morgan, alias Juletta Shane, in Curse of the Pink Panther, and also appeared opposite Nicky Henson as Nancy in the ITV situation comedy The Happy Apple playing a secretary whose opinions successfully reflected public opinion. She then played a regular role in crime series C.A.T.S. Eyes. From 1983 until 1987, she was a co-presenter on the Channel 4 music programme The Tube alongside Jools Holland and Paula Yates. In 1984 she appeared opposite Roger Daltrey and former Quadrophenia co-star Toyah Willcox in the thriller Murder: Ultimate Grounds for Divorce, and played Carol Landau in the 1985 comedy film Shadey, directed by Philip Saville."]}, {"page": "Saville", "response": ["* Philip Saville (1930–2016), British television and film director"]}, {"page": "Pebble Mill Studios", "response": ["CM2 was a 'Topical News & Drama', two-camera vehicle equipped with Philips LDK-14 cameras connected to LDK-5 CCUs (Camera Control Unit) and based on a Dennis TK chassis. In 1982, Boys from the Blackstuff, an English Regions Drama production, was shot on CM2 in Liverpool. The director, Philip Saville, was breaking many conventions including shooting wide-angles and close-ups at the same time)."]}, {"page": "The Life and Loves of a She-Devil", "response": ["|Philip Saville"]}, {"page": "William Stuart-Houston", "response": ["Beryl Bainbridge's 1978 novel Young Adolf depicts the alleged 1912–13 visit to his Liverpool relatives by a 23-year-old Adolf Hitler. Bainbridge adapted the story into a play as The Journal of Bridget Hitler with director Philip Saville,Royden (2004) which was broadcast as a Playhouse (BBC 2) in 1981.Saville, Philip profile, BFI Screenonline"]}, {"page": "The Wednesday Play", "response": ["Adapted for television and directed by Philip Saville."]}, {"page": "Armchair Theatre", "response": ["The German Jewish dramatist Robert Muller, who had arrived in Britain as a refugee in 1938,Tise Vahimagi \"Muller, Robert (1925-1998)\", BFI screenonline. contributed seven plays to the series, three being transmitted in 1962 and directed by Philip Saville, including Afternoon of a Nymph.Mark Duguid \"Afternoon of a Nymph (1962)\", BFI screenonline. Saville worked on more than forty episodes in the series,Oliver Wake \"Philip Saville: biographical essay\" , University of Hull website. while Muller's wife in his later years, the actress Billie Whitelaw, had a part in eleven episodes."]}, {"page": "Metroland (film)", "response": ["Metroland is a 1997 British comedy-drama film directed by Philip Saville and starring Christian Bale and Emily Watson. Written by Adrian Hodges, based on the 1980 novel Metroland by Julian Barnes, the film is about a man whose tranquil and ordinary life is disrupted by the sudden reappearance of his best friend, which leads him to remember his rebellious youth in Paris, to question some of his life choices, and to re-evaluate his priorities and marriage.", "The executive producer Andrew Bendel and director Philip Saville needed three songs from the punk era to be included in the live band scenes played by a fictitious group called The Subverts. Danny de Matos and Del Bartle were asked to write the songs to be included in the film. These three particular songs featured in the film (although not included on the Polygram soundtrack) \"Amerikkka We Hate You\", \"Destroy the Hoi Polloi\" and \"You Destiny\" were also produced by Danny de Matos.", "In his review for the Chicago Sun-Times, Roger Ebert gave the film three out of four stars, noting director Philip Saville ability to tell this \"straightforward story of life choices\" while avoiding a dependence on sentiment. Commenting on the lead character's memories of his past and his choices, Ebert writes:", "Category:Films directed by Philip Saville"]}, {"page": "Roger Deakins", "response": ["|Philip Saville"]}, {"page": "The Buccaneers", "response": ["Independently of Mainwaring's completion, screenwriter Maggie Wadey was commissioned to adapt and finish the novel for a television version co-produced by the BBC and American PBS broadcaster WGBH; it was screened on BBC 1 in the UK and in the Masterpiece Theatre series in the United States during 1995. This serial adaptation was directed by Philip Saville and executive-produced by Phillippa Giles."]}, {"page": "Bruce Payne", "response": ["| Philip Saville"]}, {"page": "Pauline Boty", "response": ["In June 1963 she married the literary agent Clive Goodwin (1932–1978) after a ten-day romance.Watling (1998), p.16 Her marriage disappointed others such as Peter Blake and her married lover, the television director Philip Saville, whom she had met towards the end of her student days and had worked for. (Their affair is said to have provided the material for a screenplay by Frederic Raphael for the movie Darling (1965).)Boty auditioned for the role that went to Julie Christie. See Bill Smith, \"The Only Blonde in the World\", Latest Art, February 2006, p. 1 Boty and Goodwin's Cromwell Road flat became a central hang-out for many artists, musicians, and writers, including Bob Dylan (whom Boty brought to EnglandBoty and Philip Saville brought Dylan to England, collecting him from London Airport. Dylan stayed in Boty's flat. See Smith, p. 10.), David Hockney, Peter Blake, Michael White, Kenneth Tynan, Troy Kennedy Martin, John McGrath, Dennis Potter and Roger McGough.Smith, p. 14 Goodwin, to be later a member of the founding editorial team of the radical journal Black Dwarf, is said to have encouraged Boty to include political content in her paintings."]}, {"page": "Charles Lloyd-Pack", "response": ["| 1969 || The Best House in London || || Philip Saville ||"]}, {"page": "Caroline Milmoe", "response": ["|Philip Saville"]}, {"page": "1930 in British television", "response": ["*28 October – Philip Saville, director (d. 2016)"]}, {"page": "Simon Gipps-Kent", "response": ["Gipps-Kent's first television appearance was at age 13 in Philip Saville's 1971 O Fat White Woman for BBC's Play for Today, in a story by William Trevor of a teacher who takes pleasure in abusing his students.\"O Fat White Woman\", British Film Institute; accessed 27 October 2015. He returned to Play for Today in 1974 in After the Solo. He appeared as the bookworm orphan Peter Beresford in the 1972–73 BBC adaptation of Noel Streatfeild's 1970 children's book Thursday's Child. He headlined as the preteen orphan Stephen in the BBC television adaptation of M. R. James' Lost Hearts, first broadcast on Christmas Day 1973, as part of the A Ghost Story for Christmas series and now part of the British Film Institute (BFI) collection."]}, {"page": "Stop the World – I Want to Get Off", "response": ["A 1966 Warner Bros. release was little more than a filmed version of a staged production. Directed by Philip Saville, it featured additional material by Alan and Marilyn Bergman, David Donable, and Al Ham. The cast included Tony Tanner and Millicent Martin. Neither a critical nor commercial success, it was nominated for an Academy Award for Best Adapted Music Scoring. The film deleted the German mistress sequence and substituted a Japanese mistress. It is not clear whether this was the Bergman contribution or if Newley and Bricusse created the new sequence. It is also unclear why this substitution was made. In the film version, the show ends with \"What Kind of Fool Am I?\" There is no birth of a grandson, nor of Littlechap choosing to die in his place and being reborn, as in the original musical play. With the exception of \"Typische Deutsche,\" the original score is transferred complete."]}, {"page": "Madhouse on Castle Street", "response": ["Madhouse on Castle Street is a British television play, broadcast by BBC Television on the evening of 13 January 1963, as part of the Sunday Night Play strand. It was written by Evan Jones and directed by Philip Saville. The production featured the young American folk music singer Bob Dylan, who soon became a major musical star.", "Madhouse on Castle Street was commissioned as part of the Sunday Night Play strand which had been running on BBC Television since 1960. The play was written by Evan Jones, who would go on to write the screenplays for films such as Modesty Blaise and Funeral in Berlin, and directed by Philip Saville. Saville had seen Bob Dylan performing in New York City in 1962, and in December that year he contracted Dylan to come to London for three weeks to star in Madhouse on Castle Street, in spite of Dylan's complete lack of acting training or experience. This was the performer's first trip outside of North America. Dylan was originally supposed to have played the leading role in the play, but during rehearsals it became apparent that he lacked the ability to learn lines – stating that he would rather \"express himself in song\" – was lax in his time keeping, and would often wander off to smoke cannabis.", "\"Blowin' in the Wind\" was used in the opening and closing credits, replacing a song written by Evan Jones, \"Cut Me Down, My Love\". Dylan also performed \"Hang Me, O Hang Me\", \"Cuckoo Bird\", and \"Ballad of the Gliding Swan\". Philip Saville had heard Dylan singing \"Blowin' in the Wind\" to two Spanish au pairs, early one morning while the singer was staying in his house. \"Hang Me, O Hang Me\" and \"Cuckoo Bird\" were traditional folk songs but Dylan altered the words. Jones provided the original lyrics for \"Ballad of the Gliding Swan\", which Dylan rewrote in performance.", "Category:Films directed by Philip Saville"]}, {"page": "Mark Snow", "response": ["|Philip Saville"]}, {"page": "Conchata Ferrell", "response": ["| Philip Saville"]}, {"page": "Philip Savile", "response": ["#REDIRECT Philip Saville"]}, {"page": "Phillip Saville", "response": ["#REDIRECT Philip Saville"]}, {"page": "Phillip Savile", "response": ["#REDIRECT Philip Saville"]}, {"page": "First Born (TV series)", "response": ["The three-part serial was written by Ted Whitehead and adapted from the novel Gor Saga by Maureen Duffy. It was produced by Sally Head and directed by Philip Saville. The theme tune was composed by Hans Zimmer."]}, {"page": "Bob Dylan", "response": ["Dylan made his first trip to the United Kingdom from December 1962 to January 1963.Heylin (1996), pp. 35–39. He had been invited by television director Philip Saville to appear in a drama, Madhouse on Castle Street, which Saville was directing for BBC Television. At the end of the play, Dylan performed \"Blowin' in the Wind\", one of its first public performances. While in London, Dylan performed at London folk clubs, including the Troubadour, Les Cousins, and Bunjies. He also learned material from UK performers, including Martin Carthy."]}, {"page": "David de Keyser", "response": ["Born in London in August 1927, in the mid-sixties de Keyser worked twice with the writer, actor and director Jane Arden. Their first collaboration, The Logic Game (January 1965), was directed by Philip Saville. They acted together again in another Jane Arden script in the film Separation (Jack Bond 1968) which was set in London and featured music by Procol Harum, Matthew Fisher and Stanley Myers. The themes of both pieces were marital strife and disintegrating relationships."]}, {"page": "Joe Lynch (actor)", "response": ["|Philip Saville"]}, {"page": "Rufus (actor)", "response": ["| Philip Saville"]}, {"page": "Elsa Zylberstein", "response": ["| Philip Saville"]}, {"page": "Christopher Young", "response": ["| Philip Saville"]}]}}