{"wiki_id": "http://www.wikidata.org/entity/Q20818856", "itemLabel": "Tommy Winship", "itemDescription": "English footballer (1890-1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tommy_Winship", "wikipedia_page": {"main": "Thomas Winship (14 July 1890 – 1976), generally known as Tom or Tommy Winship, but also referred to as Wee Winship because of his small stature, was an English footballer who played as an outside left. He scored 25 goals from 224 appearances in the Football League playing for Woolwich Arsenal and Fulham before the First World War and for Darlington and Crewe Alexandra after it.\nWinship began his football career with junior clubs in the area local to his native Newcastle upon Tyne. He played in the North-Eastern League for Wallsend Park Villa before joining Football League First Division club Woolwich Arsenal in late 1910. He made nearly 30 first-team appearances in a little over two years, then spent the last few weeks of the 1912–13 season with Fulham before returning to Arsenal, by then a Second Division team. In the two seasons before the Football League was suspended for the duration of the First World War, he took his appearance total to 56 matches, and then returned to the north-east where he worked in shipbuilding before serving in the Royal Engineers.\nAfter the war, he played for Hartlepools United in the Northern Victory League, then helped Darlington reach runners-up spot in the 1919–20 North-Eastern League and win the title the following year. Darlington were elected to the newly formed Northern Section of the Third Division in 1921, and Winship contributed to their second-place finish in their first season and their Northern Section title in 1924–25. Before Winship could represent Darlington in Second Division football, they had to pay £100 to Arsenal to transfer his registration, which that club had retained. He was not a regular at the higher level, but still took his total of league appearances for Darlington to nearly 150 over five seasons. He then spent one last season in the Football League with Third Division Crewe Alexandra before returning to his native north-east of England where he played at non-League level for a further three years.", "link_mentions": {}}}