{"wiki_id": "http://www.wikidata.org/entity/Q20807765", "itemLabel": "William Hands", "itemDescription": "British cricketer (1886-1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Hands", "wikipedia_page": {"main": "William Cecil Hands (20 December 1886 – 31 August 1974) was an English first-class cricketer who played for Warwickshire between 1909 and 1920. He was born in Edgbaston, Birmingham and died at Northwood, Middlesex.\nHands was an amateur cricketer who played as a lower-order right-handed batsman and a right-arm medium fast bowler. Though not an outstanding performer with either bat or ball, he played in around half of Warwickshire's matches in the four cricket seasons leading up to the First World War, and had some days of success. Against Surrey in the last match of the 1912 season, he finished off the Surrey first innings with figures of five wickets for 10 runs, and these were the best figures of his career.At the outbreak of the First World War, Hands joined the Royal Garrison Artillery as a lieutenant. In 1916, he was reported as having sustained a wound to his leg which required \"a slight operation\". In a review of cricket prospects for the 1919 season published at the end of 1918, when the war was over but service personnel were still in many cases serving, Hands was singled out as one of those whose absence might be felt by Warwickshire.In the event, Hands was back in the Warwickshire side by early June 1919, and over the next two seasons played 13 more first-class matches, again taking useful wickets but now also adding occasional runs. Against Lancashire in July 1919, batting at No 9, he made 63, his only score of more than 50 and his highest first-class innings. In some matches in 1920, he captained the Warwickshire side, and he won recognition in the game against Surrey when he agreed to play on in a torrential thunderstorm in a vain attempt to allow Surrey a deserved victory. He played a single further first-class game after this, but was then reported as being ill, and did not appear in first-clas cricket again. A note in the Leamington newspaper at the start of the 1921 indicated that Hands, who played for the local cricket club, had moved to London for business reasons.", "link_mentions": {}}}