{"wiki_id": "http://www.wikidata.org/entity/Q20878239", "itemLabel": "Rick Smith", "itemDescription": "Welsh musician, founding member of Underworld", "wikipedia_url": "https://en.wikipedia.org/wiki/Rick_Smith_(musician)", "wikipedia_page": {"main": "Richard Smith (born 25 May 1959) is a Welsh musician and composer. He is a founding member of British electronic music group Underworld and an acclaimed composer, having collaborated extensively with director Danny Boyle, most notably as the musical director for the London 2012 Summer Olympics Opening Ceremony, alongside Underworld's Karl Hyde. He is also a founding member of the multi-discipline design and film collective Tomato.", "link_mentions": [{"page": "Underworld (band)", "response": ["Underworld are a British electronic music group formed in 1987 in Cardiff, Wales\"Underworld: Reborn slippy\", The Independent, 19 November 2006, Retrieved on 24 January 2014 and the principal name of Karl Hyde and Rick Smith recording together. Prominent former members include Darren Emerson, from 1991 to 2001, and Darren Price, as part of the live band from 2005 to 2016.", "In the late 1970s, Karl Hyde and Rick Smith formed a band in Cardiff called the Screen Gemz, which was influenced by Kraftwerk and reggae. They were joined by bassist Alfie Thomas, drummer Bryn Burrows, and keyboardist John Warwicker in forming Freur. The band signed to CBS Records and released Doot-Doot (1983). They disbanded in 1986 after followup Get Us Out of Here was withheld.", "On 16 June 2007, Underworld were forced to cancel their show at the Ejekt Festival in Athens, Greece. Approximately 30 masked Greek anarchists stormed the stadium while the Beastie Boys were performing. Rick Smith was one of the people injured in the ensuing violence and he was taken to a nearby Athens hospital for treatment. On 19 October 2007, Underworld cancelled the remaining dates of their European tour due to illness in the band. The tour was picked up again on 28 January 2008, with a concert in Cologne, followed by 16 dates in Europe, including some festivals.", "On 25 August 2010, Rick Smith released a limited edition solo album Bungalow With Stairs 1, music to accompany \"What's Going on in Your Head When You're Dancing\" an exhibition of paintings by Karl Hyde at the Laforet Museum, Harajuku, Tokyo during 2010. The album was available from the band's website and was packaged with the exhibition catalogue. In December 2010 it was announced that Underworld would reunite with Trainspotting director Danny Boyle to write the musical score for his production of Frankenstein at the Royal National Theatre. The production was broadcast as a part of National Theatre Live on 17 March 2011, with a soundtrack release on Underworld's website in March 2011. In February 2011 Underworld confirmed that they would play a huge London summer show on Saturday 27 August on Clapham Common as headliners of South West Four.", "In December 2011, Underworld were chosen to direct the music for the opening ceremony of the 2012 Summer Olympics, reprising their partnership with filmmaker and ceremony director Danny Boyle. The band also contributed two original tracks for the opening ceremony: \"And I Will Kiss\" (featuring Dame Evelyn Glennie with the Pandemonium Drummers) and \"Caliban's Dream\" in collaboration with the Dockhead Choir, Dame Evelyn Glennie, Only Men Aloud, Elizabeth Roberts, Esme Smith (band member Rick Smith's daughter) and Alex Trimble. Underworld contributed 11 of the 36 tracks on the soundtrack, Isles of Wonder. For their work on the Olympics, Underworld won the 2012 Q Award for Innovation in Sound.", "On 22 April 2013, Karl Hyde released his debut solo album Edgeland. In 2014, he went on to release two collaborative albums with Brian Eno titled Someday World on 5 May and High Life on 30 June. Rick Smith went on to do some solo work, with two of his musical works being for projects by frequent collaborator director Danny Boyle. His first work was the soundtrack to Boyle's 2013 film Trance and the score for the 2014 British drama television series Babylon which Boyle co-created and directed the 90 minute pilot.", "* Rick Smith – keyboards and mixing, backing vocals (1987–present)"]}, {"page": "Everything, Everything (album)", "response": ["*Rick Smith\t – \tprogramming, producer"]}, {"page": "Dubnobasswithmyheadman", "response": ["The first version of Underworld had ended after a 1989 tour of North America as the support act to Eurythmics. After the tour Karl Hyde had stayed in the United States for two months to work at Prince's Paisley Park Studios in Minneapolis as a session musician, and then toured with Debbie Harry and Chris Stein of Blondie. When Hyde returned to the UK he found his former bandmate Rick Smith had been collaborating on dance tracks with a teenage DJ named Darren Emerson, a friend of Hyde's brother-in-law, at Hyde and Smith's studio in Romford: Emerson had been eager to learn how to use the equipment in a recording studio, and in turn Smith had been keen to have somebody who could introduce him to electronic music and club culture, which he had grown increasingly interested in. The three men started to swap ideas and create songs, resulting in a series of singles released throughout 1992 and 1993 under the names Underworld and Lemon Interrupt.", "Tomato, the art design collective that includes Underworld's Rick Smith and Karl Hyde, designed the artwork for Dubnobasswithmyheadman. It features black and white type that has been \"multiplied, smeared, and overlaid\" so much that it is nearly unreadable, alongside a \"bold symbol consisting of a fractured handprint inside a broken circle\". The artwork was originally intended for Tomato's book Mmm... Skyscraper I Love You: A Typographic Journal of New York, published in 1994.", "Karl Hyde told Uncut magazine in 2014 that the album's title had come from him misreading Rick Smith's writing on a cassette tape box.", "Dubnobasswithmyheadman received widespread acclaim from music critics. Writing in Melody Maker, a year before he left to co-found the specialist dance music magazine Muzik, Ben Turner proclaimed that \"Dubnobasswithmyheadman is the most important album since The Stone Roses and the best since Screamadelica ... While others are content to go techno techno techno techno [a reference to the lyrics of \"No Limit\" by 2 Unlimited, a UK No. 1 hit the previous year], Underworld have taken a step back, utilising Karl Hyde and Rick Smith's experience in rock music and throwing it full in the face of 22-year-old DJ, Darren Emerson. The result is utterly contemporary, the sound of the moment, beautifully capturing melodic techno, deranged lyricism, historic bass and lead guitars and astounding walls of rhythm ... This breathtaking hybrid marks the moment that club culture finally comes of age and beckons to everyone.\" Dele Fadele of NME said, \"Before Underworld's startling remixes for Björk and Orbital last year, no-one would've put money on ex-members of ... popsters Freur making the first visionary record of '94 ... The sheer weight of ideas on offer and the constant variance of sounds and textures add up to a coherent, cogent whole, not a series of jack-tracks sequenced together, nor a series of hits with filler thrown in ... By writing 'songs'—albeit playful, deranged ones—Underworld have come up with a solution for the facelessness that blights some dance music.\" Vox writer Phil Strongman wrote that \"apart from the lumbering blasphemy of 'Dirt Epic' [sic], the only non-event here, it's all go-with-the-flow stuff laced with intricacies ... Attractive, undulating and with moments of innovation, this Underworld offering transcends many of the limitations of its genre.\" At the end of 1994, Dubnobasswithmyheadman was ranked at number 16 on Melody Makers list of the year's best albums.", "All tracks are produced by Underworld (Darren Emerson, Rick Smith and Karl Hyde). Writing credits are often missing or inconsistent; for example, the original Lemon Interupt single credits Smith, Hyde and Emerson as writers of \"Dirty\", while later editions only credit Smith and Hyde."]}, {"page": "Second Toughest in the Infants", "response": ["Second Toughest in the Infants is the fourth studio album by English electronic music group Underworld, and the second in their \"MK2\" line-up with Darren Emerson. With this album, Underworld expanded on their progressive palette, while developing their signature sound of abrasive beats and anthemic melodies. The name of the album derives from a comment made by member Rick Smith's six-year-old nephew, Simon Prosser, when asked on his progress at infant school (the level of schooling attended by four- to seven-year-old children in the United Kingdom). Second Toughest featured the single \"Pearl's Girl\". The re-issue featured the band's best known single, \"Born Slippy .NUXX\"."]}, {"page": "Change the Weather", "response": ["All songs by Karl Hyde, Rick Smith and Alfie Thomas, unless noted."]}, {"page": "Underneath the Radar", "response": ["All songs by Karl Hyde, Rick Smith, and Alfie Thomas.", "* Rick Smith — keyboards, backing vocals"]}, {"page": "Freur", "response": ["Freur was a Welsh new wave/synth-pop band featuring Karl Hyde and Rick Smith, who went on to form the electronic act Underworld. It was their second band, following their art school collaboration, The Screen Gemz. Their best known song is \"Doot-Doot\", which charted at number 59 on the UK Singles Chart.", "*Rick Smith – keyboards"]}, {"page": "Pearl's Girl", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "Karl Hyde", "response": ["Karl Hyde (born 10 May 1957) is an English musician and artist. He is a founding member of British electronic group Underworld. Hyde has also released a solo album, made albums with Brian Eno and Matthew Herbert, and contributed towards the score for the London 2012 Summer Olympics Opening Ceremony alongside Rick Smith.", "Hyde moved to Cardiff in the late 1970s to study at Cardiff College of Art. There he formed the new wave-synthpop band Freur in 1982 with Rick Smith and Alfie Thomas. The band released two albums, Doot-Doot and Get Us out of Here, before relocating to Essex, and renaming themselves Underworld. They have continued to make music since.", "He contributed towards the score for the London 2012 Summer Olympics Opening Ceremony, alongside Underworld's Rick Smith who was the ceremony's Musical Director."]}, {"page": "Rick Smith", "response": ["Rick Smith may refer to:", "*Rick Smith (American football, born 1948), American football coach", "*Rick Smith (American football executive), former General Manager of the Houston Texans of the NFL", "*Rick Smith (ice hockey) (born 1948), ice hockey player", "*Rick Smith Jr. (born 1981), magician", "*Rick Smith (environmentalist) (born 1968), Canadian environmentalist", "*Rick Smith (author) (born 1967), American entrepreneur and business writer", "*Rick Smith (musician) (born 1959), member of the band Underworld", "*Rick Smith, CEO of Axon (formerly known as TASER International)", "*Rick Smith, also known as Richard F. Smith, former chairman and CEO of Equifax"]}, {"page": "Darren Emerson", "response": ["In 1990, Rick Smith and Karl Hyde relocated to Romford, where Martin Prudence, brother-in-law of Smith, introduced Emerson to him, with Hyde inviting Emerson to become the third member of techno band Underworld. 1994's dubnobasswithmyheadman was their commercial breakthrough onto the then burgeoning British electronica scene. While working on their second album, 1996's Second Toughest in the Infants, they released the single \"Born Slippy .NUXX\" in 1995, which was then re-released in 1996 and became a hit following its inclusion on the soundtrack to the movie, Trainspotting."]}, {"page": "Spikee", "response": ["*Dogman Go Woof written, produced and mixed by Rick Smith and Darren Emerson", "Category:Songs written by Rick Smith (musician)"]}, {"page": "Dark & Long", "response": ["All tracks written, mixed and produced by Rick Smith, Karl Hyde and Darren Emerson unless otherwise noted.", "*The album version of \"Dark & Long\" is written by Rick Smith and Karl Hyde.", "*All versions are written, mixed, and produced by Rick Smith, Karl Hyde, and Darren Emerson, except \"Hall's Edit\" written by Rick Smith and Karl Hyde.", "Category:Songs written by Rick Smith (musician)"]}, {"page": "Cowgirl (song)", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "Rez (song)", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "Rowla", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "Born Slippy Nuxx", "response": ["Vocalist Karl Hyde wrote the lyrics for \"Born Slippy .NUXX\" after a night drinking in Soho, London, hoping to capture the way a drunk \"sees the world in fragments\". The vocals were recorded in one take; when Hyde lost his place, he would sing the same line repeatedly, creating the line \"lager, lager, lager, lager\". Hyde, who was struggling with alcoholism, said he did not intend the song to be a \"drinking anthem\" but rather a \"cry for help\". He was disturbed when audience members raised their lager cans during performances. Underworld producer Rick Smith said the lyrics reflected \"this energy of movement, and of time and place\", like an abstract painting.", "Category:Songs written by Rick Smith (musician)"]}, {"page": "Moaner (song)", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "Push Upstairs", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "Jumbo (Underworld song)", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "King of Snake", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "Bruce Lee (song)", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "Underworld discography", "response": ["Underworld are a British electronic group, and principal name under which duo Karl Hyde and Rick Smith have recorded together since 1983, though they have also worked together under various names both before and after adopting the Underworld moniker. The band is perhaps best known for \"Born Slippy .NUXX\", a track made popular in the Danny Boyle 1996 hit film Trainspotting. The first two albums they recorded together were with the band 'Freur'.", "|style=\"text-align:left\"|Urban Clearway (Produced by Rick Smith)", "|style=\"text-align:left\"|Like a Motorway (Produced by Rick Smith)", "|style=\"text-align:left\"|The Shadow (Process Mix) (remixed by Rick Smith for Underworld)", "|style=\"text-align:left\"|The Shadow (Bing Here Mix) (remixed by Rick Smith for Underworld)"]}, {"page": "Two Months Off", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "Dinosaur Adventure 3D", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "Oblivion with Bells", "response": ["All songs by Karl Hyde and Rick Smith."]}, {"page": "Crocodile (song)", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "Underneath the Radar (song)", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "Ring Road (song)", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "Juanita (Underworld song)", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "Mmm Skyscraper I Love You", "response": ["Category:Songs written by Rick Smith (musician)"]}, {"page": "Barking (album)", "response": ["Each track on the album was written by band members Karl Hyde and Rick Smith in Essex, before being sent to producers well known for their contributions to trance, drum and bass and dubstep. The album sees further collaboration with Mark Knight and D. Ramirez, whose 2009 single, \"Downpipe\", featured lyrics and vocals by Hyde."]}, {"page": "Get Us out of Here", "response": ["All songs written and composed by Karl Hyde, Rick Smith and Alfie Thomas, except where noted.", "*Rick Smith – Keyboards"]}, {"page": "Doot-Doot", "response": ["All songs written and composed by Karl Hyde, Rick Smith and Alfie Thomas."]}, {"page": "Scribble (song)", "response": ["Category:Songs written by Rick Smith (musician)"]}]}}