{"wiki_id": "http://www.wikidata.org/entity/Q20810956", "itemLabel": "Theodore Hack", "itemDescription": "Mayor of Port Adelaide (1873-1880)", "wikipedia_url": "https://en.wikipedia.org/wiki/Theodore_Hack", "wikipedia_page": {"main": "Theodore Hack (17 November 1840 – 27 December 1902) was a South Australian politician.\nHe was born at Echunga, South Australia a son of John Barton Hack and his wife Bridget Hack, née Watson, and was educated at the Adelaide Educational Institution.Hack was by turns landing officer at Semaphore, harbormaster at Port Willunga, clerk with the Engineer-in-Chief's Department, railway storekeeper, timber merchant (with his sister-in-law Stella Ann Robin after the death of her husband Theophilus Robin), then valuer and architect. He was  member of the Port Adelaide council (and for two years its mayor) and the first mayor of Semaphore, as well as a member of the House of Assembly, representing Gumeracha between 1890 and 1893.\nHack was a judge at the Adelaide Jubilee International Exhibition in 1887, a member of the Central Roads' Board and the Fire Brigades' Board, a lay preacher for the Methodist Church and active with several Methodist organisations. He was president of the Local Teachers' Association, the governing body of Prince Alfred College, chairman and treasurer of the Prisoners' Aid Society and an active member of the Chamber of Manufacturers. He died of Bright's disease, from which he had suffered for some time.", "link_mentions": [{"page": "John Barton Hack", "response": ["John Barton Hack (2 July 1805 – 4 October 1884) was an early settler in South Australia; a prominent farmer, businessman and public figure. He lost his fortune in the financial crisis of 1840 and despite his best efforts, never regained anything like his former influence and prosperity. His son Theodore Hack, younger brother Stephen Hack and nephew Wilton Hack were all figures of some significance in the history of the Colony.", "*Theodore Hack MHA (17 November 1840 – 27 December 1902) married Elvira Louisa Ansell (c. 1842 – 7 October 1890) on 17 November 1864. See his entry for family details."]}, {"page": "City of Port Adelaide", "response": ["* Theodore Hack"]}, {"page": "Theophilus Robin", "response": ["Theophilus died of erysipelas following an infected boil on his leg, leaving a widow and nine children. His widow took on Theodore Hack as business partner, styling the business Robin & Hack.http://nla.gov.au/nla.news-article39820316"]}, {"page": "Electoral district of Gumeracha", "response": ["| Theodore Hack"]}, {"page": "Robert Homburg", "response": ["Homburg was elected to the South Australian House of Assembly as a representative for Gumeracha in April 1884, and at the election of 1887 was re-elected with the Sir Robert Dalrymple Ross. In April 1890 he was again returned with Theodore Hack. In 1880 for a short period he was president of the German Club. He was appointed Attorney-General in Thomas Playford's second Ministry in August 1890, and held office till June 1892, when he retired with his colleagues. Homburg was again Attorney-General from 15 October 1892 to 16 June 1893 and from 4 July 1904 to 24 February 1905 (also being Minister of Education in the latter term). "]}, {"page": "Charles Morris (Australian politician)", "response": ["Morris was born at Noarlunga the eldest son of C. E. Morris, and moved when very young to Underdale, where he received his education. At the age of 13 he started working for Robin & Hack (Theophilus Robin and Theodore Hack), timber merchants of Dale Street, Port Adelaide, and 10 years later, with Theophilus John Walter (1859 – 2 December 1946) as \"Walter & Morris\", took over the business, which survived and thrived."]}, {"page": "Members of the South Australian House of Assembly, 1890–1893", "response": ["|| Theodore Hack ||  || Gumeracha || 1890–1893"]}, {"page": "Corporate Town of Semaphore", "response": ["* Theodore Hack 1883–1885"]}, {"page": "Theo Hack", "response": ["#REDIRECT Theodore Hack"]}, {"page": "James S. Hawkes", "response": ["At a little over 16 he went to work for Robin and LeMessurier, timber merchants, of Port Adelaide, and at 18 became their accountant. The owner, Theophilus Robin, died in September 1874, and his widow brought in Theodore Hack to manage what became known as Robin & Hack. Hawkes remained with the company for ten years. Around early September 1884 he left for Silverton, where a rush was on, and tried his hand at prospecting. "]}]}}