{"wiki_id": "http://www.wikidata.org/entity/Q2081635", "itemLabel": "Dennis Tueart", "itemDescription": "English footballer (born 1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dennis_Tueart", "wikipedia_page": {"main": "Dennis Tueart (born 27 November 1949) is an English former footballer who played for Sunderland, Manchester City, Stoke City and Burnley at club level. On the international scene, he won six full caps for England.", "link_mentions": [{"page": "Bryan Robson", "response": ["Robson experienced top-flight football for the first time during the 1976–77 season, and began to appear more regularly in the side, although he was still alternating between the positions of left back and his preferred central midfield role. His rapid progress was halted however, when he received the first serious injury of his career. Playing at left back, he broke his left leg in a tackle with Tottenham Hotspur striker Chris Jones.Robson (2007), pp. 30–32. Two months later Robson made his comeback in a reserve game at The Hawthorns, but the original break was refractured in a challenge with Stoke City's Denis Smith. Again he recovered, and returned to the first team in late December. He went on to enjoy a run in the side and scored his first professional hat-trick, in a 4–0 win against Ipswich Town on 16 March 1977. One month later however, he broke his right ankle in a challenge with Manchester City's Dennis Tueart, causing him to pull out of the England under-23 squad following his call-up."]}, {"page": "Bicycle kick", "response": ["*  According to former Manchester City defender Paul Lake, a notable bicycle kick performed by English left winger Dennis Tueart caused injuries to hundreds of fans who tried to emulate it. In 2012, a fan poll from The Guardian awarded English forward Wayne Rooney's 2011 Manchester derby bicycle kick the title of best goal in the Premier League's history. When Italian striker Mario Balotelli, during his youth development years, patterned his skills on those of Brazilian midfielder Ronaldinho and French midfielder Zinedine Zidane, he fixated on the bicycle kick. In 2015 against Liverpool, Juan Mata scored an iconic bicycle kick that secured the win for his team. Portuguese forward Cristiano Ronaldo's Champions League bicycle kick goal, in 2018, received widespread praise from fellow footballers, including English forward Peter Crouch, who tweeted \"there is only a few of us who can do that\", and Swedish forward Zlatan Ibrahimović, who challenged Ronaldo to \"try it from 40 meters\"—a reference to his FIFA Puskás Award-winning 2012 bicycle kick goal during an international friendly match between Sweden and England."]}, {"page": "Brian Horton", "response": ["Luton then went on to escape relegation on the final day of the 1982–83 season at Maine Road, following a 1–0 over Manchester City, who took their place in the relegation zone. The match became famous for the images of David Pleat dancing across the pitch in jubilation. Pleat ran straight to Horton after finishing his dance and kissed his out-of-contract midfielder, telling him \"you can go anywhere you want to\". However, in the tunnel Horton was punched by Dennis Tueart, starting a brawl amongst the players. Horton was offered a contract by Chelsea, but could not agree terms with chairman Ken Bates, and instead signed a new two-year contract with Luton. Horton left Kenilworth Road at the conclusion of the 1983–84 campaign, as the club secured their top-flight status with a 16-place finish. He had played 131 first-team games for the club, scoring 14 goals. His next move was to Hull City, who appointed him their player-manager, and with whom he ended his playing career in 1986 after making 46 competitive appearances."]}, {"page": "Andy Morrison", "response": ["Morrison was signed by Joe Royle for Manchester City, in the 1998–99 season, following their relegation to Division Two. The transfer fee was £80,000. Morrison made his debut in a 2–1 victory against Colchester United in October 1998. Morrison headed in City's second goal of the game and received a man of the match award, which was presented to him by former City winger Dennis Tueart. Morrison also scored in his second game for City, a 3–0 victory against Oldham Athletic. Morrison endeared himself to the City fans and was soon made captain. He scored his third goal for City in a 1–1 draw with Luton Town. One fanzine asked: \"Where can we get another half-dozen Andy Morrisons?\" According to goalkeeper Nicky Weaver: \"Morrison was a huge signing for us. Joe made him captain straight away. He was an intimidating figure for the opposition and he could be intimidating as a team-mate as well. I'd stand behind him in the tunnel and he'd be beating his chest, ready for battle. The other team would be thinking, 'I don't fancy tangling with him today'. But to be fair to Andy, he wasn't just a brute and growling pitbull. He had a great touch, too.\" In an 1–0 defeat to Wimbledon, in the FA Cup, Morrison was sent off after a scuffle with Carl Cort. Morrison scored his fourth goal of the season, via a thundering header from a corner, in a 6–0 victory against Burnley (Shaun Goater scored a hat trick and Kevin Horlock and Danny Allsopp scored the other goals). City finished in the play-off places in the league. Morrison captained City to victory over Gillingham in the 1999 Football League Second Division play-off Final at Wembley in May 1999.  In the match Morrison's teammates Kevin Horlock and Paul Dickov scored late goals to take the match to extra time and penalties (which City won). Morrison was presented with the playoff trophy at the end of the game and became the fifth City captain (following Sam Cowan, Roy Paul, Tony Book and Mike Doyle) to lift a trophy at Wembley. He has been succeeded, in this respect, by Carlos Tevez (who captained City to victory in the 2011 FA Cup Final) and Vincent Kompany (who has won the EFL Cup four times with City), although they captained City to victories at the new Wembley Stadium."]}, {"page": "1973 FA Cup Final", "response": ["|LW ||11|| Dennis Tueart"]}, {"page": "List of Manchester City F.C. players", "response": ["|align=\"left\" | Dennis Tueart ||  || Forward || 1974–1978  1980–1983 || 275 || 109 || ||"]}, {"page": "Denis Tueart", "response": ["#REDIRECT Dennis Tueart"]}]}}