{"wiki_id": "http://www.wikidata.org/entity/Q20822919", "itemLabel": "Susanne Pollatschek", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Susanne_Pollatschek", "wikipedia_page": {"main": "The Great Mouse Detective (also known as The Adventures of the Great Mouse Detective for its 1992 theatrical re-release and Basil the Great Mouse Detective in some countries) is a 1986 American animated mystery adventure film produced by Walt Disney Feature Animation and released by Walt Disney Pictures. The 26th Disney animated feature film, the film was directed by John Musker, Ron Clements, Dave Michener, and Burny Mattinson (in their feature directorial debuts). The main characters are all mice and rats living in Victorian London.\nBased on the children's book series Basil of Baker Street by Eve Titus and Paul Galdone, it draws heavily on the tradition of Sherlock Holmes with a heroic mouse who consciously emulates the detective. Titus named the main character after actor Basil Rathbone, who is best remembered for playing Holmes in film (and whose voice, sampled from a 1966 reading of \"The Red-Headed League\" was the voice of Holmes in this film, 19 years after his death). Sherlock Holmes also mentions \"Basil\" as one of his aliases in the Arthur Conan Doyle story \"The Adventure of Black Peter\".\nThe Great Mouse Detective was released to theaters on July 2, 1986, to positive reviews and financial success, in sharp contrast to the box office underperformance of Disney's previous animated feature film, The Black Cauldron (1985).\n\n", "link_mentions": [{"page": "1992 in film", "response": ["| The Great Mouse Detective (re-release) || Walt Disney Pictures || Ron Clements, Burny Mattinson, Dave Michener, John Musker (directors/screenplay); Matthew O'Callaghan, Mel Shaw, Pete Young, Vance Gerry, Steve Hulett, Bruce Morris (screenplay); Vincent Price, Barrie Ingham, Val Bettin, Susanne Pollatschek, Candy Candido, Alan Young, Diana Chesney, Eve Brenner, Frank Welker, Basil Rathbone, Laurie Main, Wayne Allwine, Tony Anselmo, Walker Edmiston, Melissa Manchester || Family, Mystery, Comedy || Animation"]}, {"page": "1986 in film", "response": ["| The Great Mouse Detective || Walt Disney Pictures || Ron Clements, Burny Mattinson, Dave Michener, John Musker (directors/screenplay); Matthew O'Callaghan, Mel Shaw, Pete Young, Vance Gerry, Steve Hulett, Bruce Morris (screenplay); Vincent Price, Barrie Ingham, Val Bettin, Susanne Pollatschek, Candy Candido, Alan Young, Diana Chesney, Eve Brenner, Frank Welker, Basil Rathbone, Laurie Main, Wayne Allwine, Tony Anselmo, Walker Edmiston, Melissa Manchester || Family, Mystery, Comedy || Animation", "*The Great Mouse Detective, starring the voices of Vincent Price, Barrie Ingham, Val Bettin, Susanne Pollatschek, Candy Candido, Eve Brenner, Diana Chesney, Frank Welker, Alan Young, directed by John Musker, Ron Clements, David Michener, Burny Mattinson"]}, {"page": "Pollatschek", "response": ["* Susanne Pollatschek (born 1977), Scottish actress"]}]}}