{"wiki_id": "http://www.wikidata.org/entity/Q2094124", "itemLabel": "Pierson Dixon", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/Pierson_Dixon", "wikipedia_page": {"main": "Sir Pierson John Dixon  (13 November 1904 – 22 April 1965) was a British diplomat and writer. He was known to be a firm believer in the value of diplomacy to solve international issues.", "link_mentions": [{"page": "Catullus", "response": ["* Catullus was the main protagonist of the historical novel Farewell, Catullus (1953) by Pierson Dixon. The novel shows the corruption of Roman society."]}, {"page": "Justinian I", "response": ["The Glittering Horn: Secret Memoirs of the Court of Justinian was a novel written by Pierson Dixon in 1958 about the court of Justinian."]}, {"page": "Selwyn Lloyd", "response": ["On the morning of 6 November Macmillan, who had been told by Humphrey (US Treasury Secretary) that there would be no more financial assistance until there was a ceasefire, saw Lloyd before Cabinet and told him that Britain had to stop in view of the drain of foreign exchange reserves. Macmillan had also been lobbying other ministers. Cabinet met at 9.45am at Eden's room at the House of Commons, with Marshal of the RAF Sir William Dickson, Chairman of the Chiefs of Staff Committee, in attendance. Pierson Dixon (British Ambassador to the UN) had warned that the UN were contemplating oil sanctions. In the event, Lloyd was one of three ministers (along with Anthony Head and James Stuart) to support Eden in his wish to carry on fighting. The Cabinet agreed that there was no choice but to agree a ceasefire. Royal Marines had been landing by sea and helicopter on 6 November, and British and French forces had Port Said and had advanced 23 miles to El Cap by the time a ceasefire was announced at 5pm.Williams 2010, pp. 265–7."]}, {"page": "List of ambassadors of the United Kingdom to France", "response": ["*1960–1965: Sir Pierson Dixon"]}, {"page": "John Cronin (British politician)", "response": ["He married Cora Mumby-Croft in 1941 and they had three children: Anne Olivia born in 1942, who married Piers Dixon, Conservative MP for Truro 1970–1974, and son of Sir Pierson Dixon, GCMG, Ambassador to France 1960–1964. Pauline Margaret Cronin was born in 1944, and married Stephen Clarke, the son of Bernard and Doris Clarke. Charles John Cronin was born in 1961 and married Jane Hockey; Charles served on Westminster City Council as a Conservative from 1998 to 2002."]}, {"page": "Permanent Representative of the United Kingdom to the United Nations", "response": ["* 1954–1960: Sir Pierson Dixon"]}, {"page": "John Pendlebury", "response": ["In Athens, Pendlebury stayed at the British School's student hostel, which also provided lodging for visiting scholars doing research in Greece. They dined with the students, conversing with them and each other on scholarly topics. Pendlebury wrote his first impressions to his father, that they were so learned, \"It makes me feel such an impostor being there at all.\". He soon found the companionship more to his liking. He hiked the Greek countryside with Sylvia Benton, who had excavated in Ithaca, competing with her to see who could walk the fastest, and became friends with Pierson Dixon, later British ambassador to France. He struck up a friendship also with another archaeology student, Hilda White, 13 years older than he and several inches shorter. Exploring the Acropolis of Athens with her, he climbed over the parapet and announced to the guard \"I am a Persian.\""]}, {"page": "Piers Dixon", "response": ["The son of diplomat and writer, Sir Pierson Dixon, he was educated at Eton College; Magdalene College, Cambridge; and Harvard Business School. He worked as a stockbroker."]}, {"page": "Theodora (wife of Justinian I)", "response": ["* The Glittering Horn: Secret Memoirs of the Court of Justinian. Pierson Dixon (1958). A historical novel about the court of Justinian with Theodora playing a central part."]}, {"page": "Outline of the United Nations", "response": ["* Pierson Dixon"]}, {"page": "List of ambassadors of the United Kingdom to the Czech Republic", "response": ["|Sir Pierson Dixon||1948||1950||rowspan=\"2\"|Klement Gottwald"]}, {"page": "Droxford railway station", "response": ["On 3 June Anthony Eden (at that time the Foreign Secretary) and Pierson Dixon visited Churchill on the train. Eden was unimpressed, and was later to describe the train as a place where \"it was almost impossible to conduct any business\" owing to there only being one bath and one telephone, each of which was constantly in use by Churchill or Ismay. A string of visits from other close confidantes of Churchill followed, including Ernest Bevin, Geoffrey William Geoffrey-Lloyd, Duncan Sandys and Arthur Tedder, as well as fellow Commonwealth prime ministers Peter Fraser, Sir Godfrey Huggins and William Lyon Mackenzie King. In addition to the meetings held on board, the train took Churchill, Bevin and Smuts to Southampton to watch invasion forces embark. Churchill hosted a dinner aboard the train, at which Eden and Bevin—both considered potential successors to Churchill—discussed the possibility of working together to continue Britain's wartime coalition government in peacetime should Churchill retire. Later that night Dwight Eisenhower, from his nearby base at Southwick House, decided to postpone the invasion from 5 to 6 June owing to predicted bad weather."]}, {"page": "Sir John Pierson Dixon", "response": ["#REDIRECT Pierson Dixon"]}, {"page": "Sir Pierson Dixon", "response": ["#REDIRECT Pierson Dixon"]}, {"page": "John Pierson Dixon", "response": ["#REDIRECT Pierson Dixon"]}, {"page": "List of ambassadors of the United Kingdom to Slovakia", "response": ["|Sir Pierson Dixon||1948||1950||rowspan=\"2\"|Klement Gottwald"]}, {"page": "Presidency of the United Nations Security Council", "response": ["|Pierson Dixon", "|Pierson Dixon", "|Pierson Dixon", "|Pierson Dixon", "|Pierson Dixon", "|Pierson Dixon", "|Pierson Dixon"]}, {"page": "Principal Private Secretary to the Secretary of State for Foreign and Commonwealth Affairs", "response": ["*1943–1947: Pierson Dixon"]}, {"page": "Sir Anthony Rumbold, 10th Baronet", "response": ["In June 1960 Rumbold was appointed Minister in Paris (under the ambassador, Sir Pierson Dixon); The Times suggested that he could have been appointed as ambassador in a smaller mission if he had not chosen to remain on the \"inner circuit\" of major capitals.Foreign Office Appointments, The Times, London, 24 June 1960, page 11 In 1965 he was appointed Ambassador to Thailand; while he was there he was also UK representative on the Council of SEATO. In 1967 he received his final appointment as Ambassador to Austria. He retired from the Diplomatic Service in 1970."]}, {"page": "Lobo Nocho", "response": ["In mid-1964, Nocho became acquainted with British actress Sarah Churchill, the daughter of former Prime Minister Winston Churchill, and by early 1965 the two had struck up a romance, a fact which became widely noted in world news reports after he was photographed escorting her back to London when her father was on his deathbed. Nocho moved into a Rome, Italy villa which she rented for him, and there were reports in Italian newspapers that the two would marry, though Nocho refused to answer media enquiries to this end. The two were still together in July 1966, when Churchill organised a London exhibition of Nocho's paintings at the home of Edwina Dixon, the daughter-in-law of British ambassador to France Pierson Dixon. Nocho gave a number of his paintings to Churchill's friend Pete Ballard, which the latter donated to North Carolina Central University in 2013."]}, {"page": "List of people educated at Bedford School", "response": ["*Sir Pierson Dixon GCMG CB (1904–1965), Principal Private Secretary to the Foreign Secretary, 1943–1948, Ambassador to Czechoslovakia, 1948–1950, Deputy Under-Secretary of State at the Foreign Office, 1950–1954, Permanent Representative of the United Kingdom to the United Nations, 1954–1960, and Ambassador to France, 1960–1965"]}, {"page": "Pierson John Dixon", "response": ["#REDIRECT Pierson Dixon"]}, {"page": "Hugo Dixon", "response": ["Hugo Duncan Dixon was born in December 1963 to the Conservative MP Piers Dixon and the artist Edwina Sandys. The couple divorced in 1970 when Dixon was six. Dixon has an older brother, Mark Pierson Dixon, born in 1962."]}, {"page": "Shirley Clifford Atchley", "response": ["Atchley married Anastasia Zersi Gerasi in 1893, they had two daughters Alexandra Ismene Atchley and Virginia Athenais Atchley. Alexandra married the diplomat Pierson Dixon, and Virginia also married a diplomat, Claud Russell."]}]}}