{"wiki_id": "http://www.wikidata.org/entity/Q2094482", "itemLabel": "Steven Lukes", "itemDescription": "British sociologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Steven_Lukes", "wikipedia_page": {"main": "Steven Michael Lukes  (born 1941) is a British political and social theorist. Currently he is a professor of politics and sociology at New York University. He was formerly a professor at the University of Siena, the European University Institute (Florence) and the London School of Economics.", "link_mentions": [{"page": "Noam Chomsky", "response": ["While mainstream publishing options proved elusive, Chomsky found support from Michael Albert's South End Press, an activist-oriented publishing company. In 1979, South End published Chomsky and Herman's revised Counter-Revolutionary Violence as the two-volume The Political Economy of Human Rights, which compares U.S. media reactions to the Cambodian genocide and the Indonesian occupation of East Timor. It argues that because Indonesia was a U.S. ally, U.S. media ignored the East Timorese situation while focusing on events in Cambodia, a U.S. enemy. Chomsky's response included two testimonials before the United Nations' Special Committee on Decolonization, successful encouragement for American media to cover the occupation, and meetings with refugees in Lisbon. The Marxist academic Steven Lukes publicly accused Chomsky of betraying his anarchist ideals and acting as an apologist for Cambodian leader Pol Pot. Herman said that the controversy \"imposed a serious personal cost\" on Chomsky, Chomsky said that \"conformist intellectuals of East or West\" deal with dissident opinion by trying \"to overwhelm it with a flood of lies\". He regarded the personal criticism as less important than the evidence that \"mainstream intelligentsia suppressed or justified the crimes of their own states\"."]}, {"page": "Émile Durkheim", "response": ["More recently, Durkheim has influenced sociologists such as Steven Lukes, Robert N. Bellah, and Pierre Bourdieu. His description of collective consciousness also deeply influenced the Turkish nationalism of Ziya Gökalp, the founding father of Turkish sociology. Randall Collins has developed a theory of what he calls interaction ritual chains, a synthesis of Durkheim's work on religion with that of Erving Goffman's micro-sociology. Goffman himself was also deeply influenced by Durkheim in his development of the interaction order."]}, {"page": "Relativism", "response": ["* Martin Hollis, Steven Lukes, Rationality and Relativism, Oxford: Basil Blackwell, 1982, "]}, {"page": "Moral relativism", "response": ["* Steven Lukes, Moral Relativism, Picador,2008."]}, {"page": "John Searle", "response": ["Many sociologists, however, do not see Searle's contributions to social theory as very significant. Neil Gross, for example, argues that Searle's views on society are more or less a reconstitution of the sociologist Émile Durkheim's theories of social facts, social institutions, collective representations, and the like. Searle's ideas are thus open to the same criticisms as Durkheim's. Searle responded that Durkheim's work was worse than he had originally believed and, admitting he had not read much of Durkheim's work, said: \"Because Durkheim's account seemed so impoverished I did not read any further in his work.\" Steven Lukes, however, responded to Searle's response to Gross and argued point by point against the allegations that Searle makes against Durkheim, essentially upholding Gross's argument that Searle's work bears a great resemblance to Durkheim's. Lukes attributes Searle's miscomprehension of Durkheim's work to the fact that Searle had never read Durkheim."]}, {"page": "Social fact", "response": ["* From Émile Durkheim, The Rules of the Sociological Method, (Edited by Steven Lukes; translated by W. D. Halls). New York: Free Press, 1982, pp. 50–59."]}, {"page": "Christopher Hitchens", "response": ["After attending two independent schools—Mount House School, Tavistock, Devon, from the age of eight, and the Leys School in Cambridgeshire—Hitchens was admitted to Balliol College, Oxford in 1967 where he read Philosophy, Politics and Economics and was tutored by Steven Lukes and Anthony Kenny. He graduated in 1970 with a third-class degree. In his adolescence, he was \"bowled over\" by Richard Llewellyn's How Green Was My Valley, Arthur Koestler's Darkness at Noon, Fyodor Dostoyevsky's Crime and Punishment, R. H. Tawney's critique on Religion and the Rise of Capitalism, and the works of George Orwell. In 1968, he took part in the TV quiz show University Challenge."]}, {"page": "List of sociologists", "response": ["* Steven Lukes, British social theorist"]}, {"page": "John Gaventa", "response": ["While studying at Oxford with Steven Lukes, author of Power: a Radical View (1974), Gaventa developed a theoretical and methodological approach to the study of community power that has radically transformed community power studies in political sociology and opened a path for the legitimization of participatory research in mainstream sociology and political science. The book Global Citizen Action, edited by Gaventa, is one such example. In an essay written for the book, Gaventa writes, \"Since the 1970s many activists have heard and been guided by the adage 'think globally, act locally.' These essays would suggest the reverse: Think locally about the impacts of global institutions and global forces.\" He used this skills to become an activist in and document series of national mining strikes across the United Kingdom, including the 1974 Wales miners' strike."]}, {"page": "Katha Pollitt", "response": ["On April 29, 2006, Pollitt married the political theorist Steven Lukes."]}, {"page": "List of British Jews", "response": ["* Steven Lukes, political scientist"]}, {"page": "List of Balliol College, Oxford people", "response": ["* Steven Lukes"]}, {"page": "Michael Heath (cartoonist)", "response": ["*No Laughing Matter: A collection of political jokes, Steven Lukes and Itzhak Galnoor, London: Routledge, 1985."]}, {"page": "Royal Grammar School, Newcastle upon Tyne", "response": ["* Steven Lukes (born 1941), Social and political theorist"]}, {"page": "Marcel Granet", "response": ["* Steven Lukes, Emile Durkheim: His Life and Work. A Historical and Critical Study, 1972."]}, {"page": "List of people associated with the London School of Economics", "response": ["* Steven Lukes, political and social theorist"]}, {"page": "Political positions of Noam Chomsky", "response": ["Chomsky's biographers look at this issue in different ways. In Noam Chomsky: A life of dissent, Robert Barsky focuses on Steven Lukes' critique of Chomsky in The Times Higher Education Supplement. Barsky cites Lukes' claim that, obsessed by his opposition to the United States' role in Indochina, Chomsky had \"lost all sense of perspective\" when it came to Pol Pot's Cambodia. Barsky then cites a response by Chomsky in which he says that, by making no mention of this, Lukes is demonstrating himself to be an apologist for the crimes in Timor and adds on this subject, \"Let us say that someone in the US or UK... did deny Pol Pot atrocities.  That person would be a positive saint as compared to Lukes, who denies comparable atrocities for which he himself shares responsibility and know how to bring to an end, if he chose\". Barsky concludes that the vigor of Chomsky's remarks \"reflects the contempt that he feels\" for all such arguments.Robert Barsky, (1997). Noam Chomsky: A life of dissent. MIT Press. pp. 187-8."]}, {"page": "Essentially contested concept", "response": ["Scholars such as H. L. A. Hart, John Rawls, Ronald Dworkin, and Steven Lukes have variously embellished Gallie's proposal by arguing that certain of the difficulties encountered with Gallie’s proposition may be due to the unintended conflation of two separate domains associated with the term concept:"]}, {"page": "European University Institute", "response": ["*Steven Lukes, Political philosophy"]}, {"page": "Stephen Lukes", "response": ["#REDIRECT Steven Lukes"]}, {"page": "The Curious Enlightenment of Professor Caritat", "response": ["The Curious Enlightenment of Professor  Caritat is a book by Steven Lukes.  It is a \"comedy of ideas\" which was published in 1995.", "The market, as once stated by Steven Lukes, reproduces and creates inequalities.  This is shown in Libertaria through the difficulties people have living in society.  The entire state is built on the privatization and trade of various programs and industries on the stock market.  Due to this, it is difficult to find work.  People often have to live on the streets, while students do not have enough money to buy books.  The only way to make money is through stocks, but it is only the wealthy that have the money to do that, creating inequalities.", "Category:Books by Steven Lukes"]}, {"page": "List of British Jewish scientists", "response": ["* Steven Lukes, political scientist"]}, {"page": "Independent Jewish Voices", "response": ["Signatories include Lisa Appignanesi, Sir Geoffrey Bindman, Gerald Cohen, Stanley Cohen, Lady Ellen Dahrendorf, Jenny Diski, Nicole Farhi, Stephen Fry, Alexander Goehr, Eric Hobsbawm, Ann Jungman, Anne Karpf, Beeban Kidron, Brian Klug, David Lan, Mike Leigh, Steven Lukes, Shula Marks, Mike Marqusee, Adam Phillips, Harold Pinter, Nigel Rodley, Jacqueline Rose, Leon Rosselson, Andrew Samuels, Richard Sennett, Avi Shlaim, Gillian Slovo, Shawn Slovo, Janet Suzman, Zoë Wanamaker, Sami Zubaida and David Feldman."]}, {"page": "Nina Stanger", "response": ["Married to Steven Lukes, she had three children with him: Daniel (born 1977), Michael (born 1979), and Alexandra (born 1981). She moved to Italy with her family in 1987.References"]}, {"page": "Factual relativism", "response": ["* Martin Hollis, Steven Lukes, Rationality and Relativism, Oxford: Basil Blackwell, 1982, "]}, {"page": "Jews for Justice for Palestinians", "response": ["* Steven Lukes"]}, {"page": "Index of politics articles", "response": ["Steven Lukes -"]}, {"page": "Lukes", "response": ["* Steven Lukes (born 1941), English academic"]}, {"page": "Marx and Human Nature", "response": ["Marx and Human Nature received positive reviews from the political philosopher Steven Lukes in The Times Literary Supplement and the political scientist David McLellan in Political Studies. The book was also discussed by Joseph Fracchia in Historical Materialism."]}, {"page": "Knowledge and Human Interests", "response": ["Knowledge and Human Interests received positive reviews from Fred E. Jandt in the Journal of Applied Communication Research, Thomas B. Farrell in the Quarterly Journal of Speech, and the sociologist Anthony Giddens in the American Journal of Sociology, a mixed review from the sociologist Steven Lukes in the British Journal of Sociology, and a negative review from the sociologist David Martin in the Jewish Journal of Sociology."]}, {"page": "Jan Hus Educational Foundation", "response": ["Kathy Wilkes of St. Hilda's and Steven Lukes of Balliol were the first philosophers to visit Tomin.Day 1999, 34–35; Bill Newton-Smith, \"Kathy Wilkes\", The Guardian, 19 September 2003, 29. Wilkes visited in April 1979, carrying books for the students. Her first seminar was on Aristotle at Tomin's apartment in Keramická Street from 6 pm to midnight; she gave another a few days later, for 25 people, on \"Identity of Human Personality\".Day 1999, 35–36. She told her colleagues that one of the books she took over had apparently been read by 40 people within the week.Day 1999, 39."]}]}}