{"wiki_id": "http://www.wikidata.org/entity/Q20981623", "itemLabel": "Peter Johnstone", "itemDescription": "Scottish footballer (1887-1917)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Johnstone_(footballer)", "wikipedia_page": {"main": "Peter Johnstone (30 December 1887 – 16 May 1917) was a Scottish footballer who played for Celtic.\nOn leaving school, he worked in his hometown's coalmine, whilst also playing for Junior club Glencraig Celtic. Johnstone signed for Celtic in January 1909, but made only one appearance in his first season at Parkhead. However, he soon became a regular in the side and eventually made over 240 appearances, scoring 29 goals. During his career he played in a variety of roles at forward, midfield and defence. His main position was at outside-right, but in later years played more often in defence. He won three Scottish Cup medals as well as four League championships with Celtic and was a mainstay in their side for several years. Johnstone was never capped for Scotland but he did play for the Scottish League side in 1914 against the Irish League, as well as representing Glasgow on two occasions.\n \nJohnstone enlisted with the army in 1916 to assist the war effort, despite being both a newsagent and a coal-miner – both reserved occupations. He first joined the Argyll and Sutherland Highlanders but later was transferred to the 6th Battalion of the Seaforth Highlanders. Johnstone continued to occasionally play for Celtic during his army training, and in September 1916 travelled overnight from England to help his teammates defeat Rangers in a Glasgow Cup tie. Johnstone died in May 1917 when the 6th Battalion of the Seaforth Highlanders attempted to capture a chemicals factory near Rouex in north-west France during the Battle of Arras. A dedication to his memory is inscribed on the Arras Memorial in the Fauborg d'Amiens Cemetery.On 23 May 2015 a memorial to Peter Johnstone was unveiled in his home village of Glencraig, Fife by Lisbon Lion John Clark and Fife Council Provost (and former Dunfermline Athletic manager), Jim Leishman. The memorial was designed and funded by the Peter Johnstone Memorial Group.", "link_mentions": [{"page": "Fife", "response": ["* Peter Johnstone, Celtic FC footballer"]}, {"page": "Pietermaritzburg", "response": ["*Peter Johnstone, Park Villa FC (born 1970), left PMB in 2004"]}, {"page": "Peter Johnstone", "response": ["Peter Johnstone may refer to:", "*Peter Johnstone (mathematician) (born 1948), professor of mathematics", "*Peter Johnstone (governor) (born 1944), Governor of Anguilla", "*Peter Johnstone (rugby union) (1922–1997), New Zealand rugby union player", "*Peter Johnstone (footballer) (1887–1917), Scottish footballer"]}, {"page": "Jimmy McMenemy", "response": ["On the eve of World War I in season 1913–14, the club were again crowned champions and Cup winners. This team, including new stars Patsy Gallacher, Jimmy McColl and Andy McAtee plus survivors from the earlier successful squad such as Alec McNair and 'Sunny Jim' Young would win a further three titles, and set a sequence of 62 league games unbeaten (65 including the minor Glasgow Cup and Glasgow Merchants Charity Cup) which would not be surpassed for a century. McMenemy, now in his mid-30s, was one of the Celtic players who worked in reserved occupations during the conflict – in his case manufacturing munitions – so was not called to frontline action and able to continue to playing football whenever possible (in summer 1918 he was due to be called up, with one brother having been killed and another wounded on the battlefield, but fell ill with influenza and did not leave Scotland before the armistice in November of that year). A teammate, Peter Johnstone, was one of those did perish on the Western Front."]}, {"page": "1913–14 Scottish Cup", "response": ["|CH |||| Peter Johnstone"]}, {"page": "1911–12 Scottish Cup", "response": ["|LH ||||Peter Johnstone"]}, {"page": "Celtic F.C. and World War I", "response": ["Over 50 contracted and former Celtic players served in the war.  Of the 908,371 British and Commonwealth soldiers who died in the fighting, six were former Celtic players whilst one was still a contracted player at the club. The fallen were Patrick Slavin, Leigh Richmond Roose, Donnie McLeod, Archie McMillan, Bob Craig, John McLaughlin and Peter Johnstone. Roose and Slavin died in the Battle of the Somme (1916), four others died in 1917 and Craig died in 1918.", "===Peter Johnstone===", "Peter Johnstone was the only contracted Celtic player to give his life in the war – a pre-war club legend who had played for Celtic 223 times and won the league four times under manager Willie Maley. Peter joined the 6th Battalion of the Seaforth Highlanders. He died in May 1917, when his regiment were told to capture a chemical factory as part of the Battle of Arras. In the second day of the battle it was reported 43 died, 26 missing and 51 wounded; although he among the missing, rumours of his death spread around Glasgow and were confirmed on 6 June 1917. His name is engraved on the Arras Memorial."]}]}}