{"wiki_id": "http://www.wikidata.org/entity/Q21004932", "itemLabel": "Susan Bailey", "itemDescription": "British psychiatrist and academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Susan_Bailey", "wikipedia_page": {"main": "Dame Susan Mary Bailey,  (born 29 August 1950) is a British psychiatrist and academic who specialises in children's mental health. Since 2004, she has been Professor of Child Mental Health at the University of Central Lancashire. From 2011 to 2014, she was President of the Royal College of Psychiatrists. Since January 2015, she has been Chair of the Academy of Medical Royal Colleges.", "link_mentions": [{"page": "Jeremy Hunt", "response": ["In February 2016, Hunt was polled as the \"most disliked\" frontline British politician. He acknowledged there would be \"considerable dismay\" and announced an urgent inquiry led by Academy of Medical Royal Colleges chair Susan Bailey into junior doctors' morale and welfare. The Academy Trainee Doctors' Group voted unanimously not to participate in the review under the offered terms. He said he had lessons to learn but denied any personal responsibility for the dispute."]}, {"page": "Royal College of Psychiatrists", "response": ["* Professor Dame Susan Bailey (2011 to 2014)"]}, {"page": "List of psychiatrists", "response": ["|Susan Bailey"]}, {"page": "List of Dames Commander of the Order of the British Empire", "response": ["*2014: Geraldine Andrews, Kathryn August, Susan Bailey, Kate Barker, Maizie Barker-Welch, Mary Colette Bowe, Rosemary Butler, Alison Carnwath, Sue Carr, Jessica Corner, Laura Davies, Celia Hoyles, Penelope Keith, Asha Khemka, Frances Kirwan, Elisabeth Laing, Angela Lansbury, Gillian Lynne, Louise Makin, Hilary Mantel, Maura McGowan, Nicola Nelson-Taylor, Frances Patterson, Alison Peacock, Shirley Pearce, Erica Pienaar, Dawn Primarolo, Seona Reid, Zandra Rhodes, Jennifer Roberts, Alison Russell, Pamela Shaw, Ingrid Simler, Julia Slingo, Rachel de Souza"]}, {"page": "Academy of Medical Royal Colleges", "response": ["* Professor Dame Susan Bailey (2015 to 2017)"]}, {"page": "List of people named Susan", "response": ["*Susan Bailey (born 1950), British psychiatrist and academic"]}, {"page": "Murder of James Bulger", "response": ["Police suspected that the boys had sexually assaulted Bulger, since his shoes, socks, trousers and underpants had been removed. The pathologist's report, which was read out in court, found that Bulger's foreskin had been forcibly pulled back. When Thompson and Venables were questioned about this aspect of the attack by detectives and a child psychiatrist, Eileen Vizard, the pair were reluctant to give details. When Venables was let out on parole, his psychiatrist, Susan Bailey, reported that \"visiting and revisiting the issue with Jon as a child, and now as an adolescent, he gives no account of any sexual element to the offence.\"", "Thompson and Venables were considered by the court to be capable of \"mischievous discretion\", meaning an ability to act with criminal intent as they were mature enough to understand that they were doing something seriously wrong. A child psychiatrist, Eileen Vizard, who interviewed Thompson before the trial, was asked in court whether he would know the difference between right and wrong, that it was wrong to take a young child away from his mother, and that it was wrong to cause injury to a child. Vizard replied, \"If the issue is on the balance of probabilities, I think I can answer with certainty.\" Vizard also said that Thompson was suffering from post-traumatic stress disorder after the attack on Bulger. Susan Bailey, the Home Office forensic psychiatrist who interviewed Venables, said unequivocally that he knew the difference between right and wrong."]}, {"page": "Starmus Festival", "response": ["Another panel discussion dealt with the issues of outreach and education and was moderated by David Eicher, with Torsten Wiesel, Alexandra Witze, Susan Bailey, Claude Nicollier, Markus Reymann, Sandra Magnus, May-Britt Moser and Ane Brun as speakers."]}, {"page": "Susan Mary Bailey", "response": ["#REDIRECT Susan Bailey"]}, {"page": "Sue Bailey", "response": ["* Susan Bailey (born 1950), British psychiatrist and academic"]}, {"page": "Dame Susan Bailey", "response": ["#REDIRECT Susan Bailey"]}, {"page": "Timeline of Manchester history", "response": ["* 1960 – 29 August: Susan Bailey, child psychiatrist"]}, {"page": "York Medical Society", "response": ["Orators in the early years included Sir Clifford Allbutt, Sir Victor Horsley, Sir James Crichton-Browne, Sir German Sims Woodhead, Sir T. Lauder Brunton, Sir George Savage and Sir Norman Moore. In the later years, orators included Parveen Kumar, Graeme Catto, Professor Dame Susan Bailey and Lord Kakkar."]}, {"page": "Jeremy Hunt's tenure as Health Secretary", "response": ["In February 2016, Hunt announced he would be unilaterally imposing the new junior doctors' contract without agreement or further negotiation, with NHS trusts instructed to introduce it in August. This followed David Dalton, the chief negotiator for the government and NHS Employers, reporting that junior doctors contract negotiations had ceased after his final offer to the BMA had been declined. The decision to impose angered many junior doctors, with some indicating that they would quit the NHS. Hunt acknowledged this by saying that there would be \"considerable dismay\", and also announced an urgent inquiry led by the chair of the Academy of Medical Royal Colleges Susan Bailey into junior doctors' morale and welfare. The Academy Trainee Doctors' Group (representatives for junior doctors from different royal colleges) voted unanimously not to participate in the review under the offered terms."]}]}}