{"wiki_id": "http://www.wikidata.org/entity/Q21000698", "itemLabel": "Benjamin Webb", "itemDescription": "British priest and architectural historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Benjamin_Webb_(clergyman)", "wikipedia_page": {"main": "Benjamin Webb (28 November 1819 – 27 November 1885) was an English clergyman and co-founder of the Cambridge Camden Society; he was known as a leading authority on questions of ecclesiastical art.", "link_mentions": [{"page": "1839 in architecture", "response": ["* May – Cambridge Camden Society is established in England by John Mason Neale, Alexander Hope and Benjamin Webb to promote Gothic architecture; also this year the Oxfordshire Architectural and Historical Society is founded as the Society for Promoting the Study of Gothic Architecture."]}, {"page": "John Mason Neale", "response": ["* The symbolism of churches and church ornaments: a translation of the first book of the Rationale divinorum officiorum (1843) by John Mason Neale and Benjamin Webb"]}, {"page": "Benjamin Webb", "response": ["Benjamin Webb may refer to:", "* Benjamin Webb (clergyman) (1819–1885), English clergyman"]}, {"page": "Cambridge Camden Society", "response": ["When, in 1833 John Henry Newman began the Oxford Movement, or Tractarianism, a renewal of theology, ecclesiology, sacraments, and liturgical practices within the Anglican Church, all of the pieces were in place for the inception of the Cambridge Camden Society.  Its founders, John Mason Neale, Alexander Hope, and Benjamin Webb, formed the society with the belief that by using Church reform in conjunction with piety of Gothic architecture, England could recapture the religious perfection of the Middle Ages. Their idealism is clear in one of the society's early letters: \"We know that [medieval] Catholick ethics gave rise to Catholick architecture; may we not hope that, by a kind of reversed process, association with Catholick architecture will give rise to Catholick ethics?\" The Ecclesiologists earnestly believed that medieval men were \"more spiritually-minded and less worldly-minded\" than were those of the modern world and that it was their duty to help return England to its former piety."]}, {"page": "1839 in the United Kingdom", "response": ["** Cambridge Camden Society established by John Mason Neale, Alexander Beresford Hope and Benjamin Webb to promote Gothic architecture."]}, {"page": "Alexander Beresford Hope", "response": ["While at Trinity College in 1839, he was, along with John Mason Neale and Benjamin Webb a founder of the Cambridge Camden Society (later the Ecclesiological Society). He re-established it in 1879 as the St Paul's Ecclesiological Society A very wealthy man, he purchased St Augustine's Abbey in Canterbury in 1844, to rebuild it as a college for missionary clergy. He also supervised the commissioning and construction of the church of All Saints, Margaret Street, London, to the designs of William Butterfield on behalf of the Ecclesiological Society."]}, {"page": "Luke Paget", "response": ["He was ordained on 16 June 1877 (Trinity Sunday) and went as assistant curate to St Andrew's Wells Street in London's West End,  serving under Benjamin Webb, the co-founder of the Cambridge Camden Society which had campaigned for the building of the church which had opened in 1847. In 1879 Paget went to the Leeds Clergy School as vice principal but returned to London's East End in 1881. The happiest period of this career, he stated, was at this East End mission to the poor.The Bishop of Stepney On East London Poverty, The Times, 20 January 1909, p4. After an incumbency at St Ives, Cambridgeshire, a brief period as Prebendary of Newington in St Paul's Cathedral  and another brief period as the suffragan Bishop of Ipswich, he was translated to be the Bishop of Stepney in 1909, a position he held until becoming Bishop of Chester in 1919. This appointment was not without controversy as he was by then 66. But he was to serve until 1932 when he was 79."]}, {"page": "Harvey Goodwin", "response": ["Immediately after graduating BA, Goodwin was appointed to a mathematical lectureship at Caius, and at Michaelmas 1841 became Fellow of his college. In 1842 he was ordained deacon, and priest in 1844. His close friends at Cambridge, besides Leslie Ellis and Charles Mackenzie, whose life he wrote in 1864, were Thomas Thorp (afterwards Archdeacon of Bristol), John Mason Neale, Philip Freeman, and Benjamin Webb. With them he shared advanced ecclesiological views, and with Neale and Webb he set on foot in 1848 the Ecclesiological Society, which afterwards developed into the Cambridge Camden Society."]}, {"page": "William Hodge Mill", "response": ["Mill married Maria, daughter of James Ruthven Elphinstone.TNA, British Library, Asia, Pacific and Africa Collections, Private Papers (Mss Eur F200 - Mss Eur F219). Their daughter Maria Elphinstone Mill married Benjamin Webb."]}, {"page": "Victorian restoration", "response": ["One of the main driving forces for the restoration of churches was the Cambridge Camden Society (CCS), which was founded in 1839 by two Cambridge undergraduates, John Mason Neale and Benjamin Webb, as a club for those who shared a common interest in Gothic church design.Clark 1962, pp.155, 160–1. It rapidly became popular: its membership increased from 8 to 180 in its first 12 months.Eastlake 1872, pp. 196–7. Although initially a society for recording and discussing medieval church features, the members of the CCS soon began to expostulate in their journal The Ecclesiologist and particularly in their Few Words to Church-builders of 1844 that the only \"correct\" form for a church building was the \"middle pointed\" or \"Decorated\" style,Clark 1962, p.170–1. in which churches had been built during the hundred years centred on 1300. Ecclesiology obviously struck a chord in society: it was closely linked with the ongoing interest in medievalism and the Gothic Revival.Eastlake 1872, p. 187."]}, {"page": "St Leodegar's Church, Hunston", "response": ["The old church was well documented in the 18th and 19th centuries.  Its rector between 1719 and 1759, Charles Covert, did work on the chancel during his incumbency.  The antiquarian Sir William Burrell, 2nd Baronet, who visited most of Sussex's parish churches during the 18th century, recorded St Leodegar's Church as having a chancel and a nave with a south aisle.  It was pictured and described again 16 years later in The Gentleman's Magazine: there was a flat-arched entrance in the west wall and an older (apparently 12th-century) south door with Norman-style chevron moulding, a continuous roof over the nave and south aisle, a three-bay pointed-arched round-columned arcade separating the aisle and nave, and lancet windows throughout.  The church was said to be \"in so decayed a state that its utter ruin seems unavoidable before long\". Similar features were depicted in sketches by other artists in the 19th century, including one dated  1851 by Richard Henry Nibbs in which the nave and chancel were clearly in ruinous condition. His accompanying notes bore this out. A survey of Sussex churches by John Mason Neale and Benjamin Webb in 1841 noted that there were wall murals inside in the form of painted Biblical verses."]}, {"page": "William Cooke (priest, born 1821)", "response": ["*The Hymnary, ed., with Rev. Benjamin Webb"]}, {"page": "Church of St Luke, Sheen, Staffordshire", "response": ["Beresford Hope was interested in reorganising the parish in line with the Tractarian movement; in 1851 he presented his friend Benjamin Webb to the perpetual curacy of Sheen. Webb had been reluctant to accept the living because of the remoteness of the area, and resigned in 1862; he was replaced by T. E. Heygate, the assistant curate since 1851.A P Baggs, M F Cleverdon, D A Johnston and N J Tringham, \"Sheen\", in A History of the County of Stafford: Volume 7, Leek and the Moorlands, ed. C R J Currie and M W Greenslade (London, 1996), pp. 239-250 British History Online. Accessed 3 January 2020."]}, {"page": "Clement Charles Julian Webb", "response": ["Webb was born on 25 June 1865, the son of the clergyman Benjamin Webb and his wife Maria, daughter of the academic William Hodge Mill.Mark D. Chapman, \"Webb, Clement Charles Julian\", The Oxford Dictionary of National Biography (online ed., Oxford University Press, 2007). Retrieved 9 February 2021. He attended Westminster School from 1876 to 1884, where he was a queen's scholar and the school captain. He then studied classics at Christ Church, Oxford, from 1884 to 1889; though initially not a spectacular student, he graduated with a first-class degree."]}]}}