{"wiki_id": "http://www.wikidata.org/entity/Q21002309", "itemLabel": "Theyre Lee-Elliott", "itemDescription": "English artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Theyre_Lee-Elliott", "wikipedia_page": {"main": "Theyre Lee-Elliott (28 May 1903 – 24 December 1988) was an English artist who created notable Art Deco logos such as the Speedbird and painted the ballet and religious art.\nHe was born David Lee Theyre Elliott in 1903 in Lewes. He was educated at Winchester and Magdalene College, Cambridge where he read theology but was a high jump champion, won a Blue for lawn tennis and represented England at table tennis.He graduated in 1925 and then spent two years at the Central School of Art and Design followed by the Slade School of Fine Art.  He then worked as a commercial artist and his work on book-jackets included Dodsworth, A Farewell to Arms and Eric Linklater's Juan in America. He was a pioneer of informational posters which presented statistics in graphical form and created notable Art Deco logos including Imperial Airways' Speedbird and the Post Office's symbols for air mail and the telephone. The Speedbird was designed in 1932 and its appearance was influenced by the avant-garde work of Edward McKnight Kauffer, echoing Kauffer's angular bird forms in his 1918 poster for the Daily Herald. Other clients during this period included the tailor Austin Reed.He also worked on the scenery at Sadler's Wells Theatre and painted the ballet dancers there.  His work there made him friends with the dancers and musical community.  The paintings were exhibited at the theatre then San Francisco and Hollywood and were published as Paintings of the Ballet in 1947.  In October of that year, he witnessed the marriage of conductor Constant Lambert and artist Isabel Delmer.After an illness in the 1950s, he produced religious art such as The Agony and a selection was exhibited in Paris in 1965.  His final years were spent in Chelsea, where he lived for most of his life.", "link_mentions": {}}}