{"wiki_id": "http://www.wikidata.org/entity/Q21068993", "itemLabel": "Benjamin Nash", "itemDescription": "Australian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Benjamin_Nash", "wikipedia_page": {"main": "Benjamin Nash (5 March 1829 – 19 April 1890) was a tailor and politician in colonial South Australia.\nHe was born in Birmingham and emigrated to Melbourne in 1857 but in July, after only a few months in the gold diggings, moved to Adelaide and set up a tailoring business in Rundle Street.\nHe was prominent in the Voluntary Militia, and from 1858 to 1865 served with the West Adelaide Company under Colonel George Mayo. In 1859 he successfully tendered for the supply of the first uniforms for the Volunteer Military Force. In 1878 he was elected to the Walkerville District Council, and became its chairman.He was elected to the seat of West Torrens and sat from April 1887 to April 1890. He failed in his bid to be reelected, and died of kidney failure ten days later. He was buried in West Terrace Cemetery's Catholic section. He had converted to that faith around two years before his death. He made a gift of an organ to St. Laurence's, his small local church.", "link_mentions": [{"page": "Electoral district of West Torrens", "response": ["| Benjamin Nash"]}, {"page": "Electoral results for the district of West Torrens", "response": ["| Benjamin Nash"]}, {"page": "Members of the South Australian House of Assembly, 1887–1890", "response": ["|| Benjamin Nash || West Torrens || 1887–1893"]}, {"page": "Benjamin Gould (politician)", "response": ["He was Mayor of Hindmarsh from December 1893 to July 1896 (E. Gould was mayor 1887–1888).Parsons, Ronald Hindmarsh Town Corporation of the Town of Hindmarsh, South Australia  He was elected to the South Australian House of Assembly for the seat of West Torrens and sat from April 1887 to April 1893, his colleagues being Benjamin Nash followed by Thomas Henry Brooker."]}, {"page": "Hundred of Nash", "response": ["The Hundred of Nash is a cadastral hundred in the County of Kintore, South Australia on the southeastern fringe of the Nullarbor Plain spanning Fowler's Bay. The hundred was proclaimed in 1890 by Governor Kintore and named for a contemporary member of the state parliament, Benjamin Nash."]}, {"page": "Nash, Benjamin", "response": ["#redirectBenjamin Nash"]}]}}