{"wiki_id": "http://www.wikidata.org/entity/Q21061", "itemLabel": "Doctor P", "itemDescription": "British dubstep producer and DJ", "wikipedia_url": "https://en.wikipedia.org/wiki/Doctor_P", "wikipedia_page": {"main": "Doctor P is the stage name of the English dubstep producer and DJ, Shaun Brockhurst (born 9 April 1986). Shaun has also produced drum and bass under the aliases Sounds Destructive (with Zachary Kemp, currently known as Trolley Snatcha), Slum Dogz (with DJ Swan-E and Krafty MC) and DJ Picto (or simply Picto). Some of his songs, including \"Sweet Shop\", \"Tetris\", \"Big Boss\", \"Watch Out\" and the remixes of Example's \"Last Ones Standing\" and Plan B's \"Love Goes Down\" have all received more than 5 million views on YouTube. He is the co-founder of Circus Records, along with Flux Pavilion, DJ Swan-E and Earl Falconer.His collaboration with Adam F and Method Man, \"The Pit\", was used in a trailer for the 2014 American comedy film Let's Be Cops.\nIn a February 2013 interview, Brockhurst said he was working on a second track with Eva Simons (the first being \"Bulletproof\").\nFlux Pavilion is his childhood friend", "link_mentions": [{"page": "Rave", "response": ["* Brostep / Dubstep – Rusko, Skrillex, Flux Pavilion, Datsik, Chase & Status, Doctor P, Borgore, TC, Modestep, Feed Me, Kill the Noise, Excision"]}, {"page": "UB40", "response": ["Earl Acton Falconer (born 23 January 1959 in Meriden, Warwickshire) is a British bass player and singer in UB40. Falconer also co-founded the UK bass label Circus Records alongside Flux Pavilion, Doctor P and DJ Swan-E."]}, {"page": "Adam F", "response": ["Adam's most recent output was in the form of \"See You Again\", a collaboration with DJ Fresh featuring Michael Warren which was on Fresh's album Nextlevelism. He has also recently collaborated with British electronic music producer Doctor P and Method Man, who is also known for his collaborations with Redman, to produce the late-2013 track \"The Pit\".", "* 2013: \"The Pit\" (with Doctor P featuring Method Man) [Circus]"]}, {"page": "Christchurch", "response": ["Some of New Zealand's acts such as Shapeshifter, Ladi6, Tiki Taane and Truth are from Christchurch. Promoters, Venues and clubs such as Bassfreaks, The Bedford and Dux Live regularly have international and New Zealand acts within the Drum and Bass scene performing live in Christchurch, along with dance parties, raves and gigs all featuring NZ and local Drum and Bass DJs, with often two or three happening on a single night or weekend (e.g. 2010 when UK Dubstep DJ Doctor P with Crushington was playing at The Bedford, while simultaneously Concord Dawn featuring Trei and Bulletproof was playing at Ministry). Independent Christchurch based radio station Pulzar FM is one of the few radio stations in New Zealand that plays Drum and Bass during the day."]}, {"page": "Wireless Festival", "response": ["Doctor P"]}, {"page": "BBC Radio 1's Big Weekend", "response": ["Flux Pavilion & Doctor P"]}, {"page": "Method Man discography", "response": ["! scope=\"row\" | \"The Pit\"(Doctor P & Adam F featuring Method Man)"]}, {"page": "List of dubstep musicians", "response": ["* Doctor P"]}, {"page": "Jersey Live", "response": ["*Doctor P"]}, {"page": "Wakestock (Wales)", "response": ["<BR> Doctor P"]}, {"page": "List of club DJs", "response": ["*Doctor P (real name Shaun Brockhurst, born 9 April 1986), English Dubstep DJ."]}, {"page": "Dev (DJ)", "response": ["* Super Bad Girls also on a Friday. Dev (conscious of restoring the male-female balance of the show) would invite his \"Super bad girls\" (men with female versions of male names doing women's voices) to call in, and tell him how they feel (bad, bad, superbad!), to the music of \"Superbad\" by Flux Pavilion and Doctor P."]}, {"page": "Balaton Sound", "response": ["* Doctor P"]}, {"page": "Eva Simons", "response": ["|| Doctor P"]}, {"page": "Stereosonic", "response": ["*Doctor P"]}, {"page": "Caspa", "response": ["*\"Terminator (Trolley Snatcha Remix)\" / \"Marmite (Doctor P Remix)\" – Sub Soldiers – 2010"]}, {"page": "Love Goes Down", "response": ["# \"Love Goes Down\" (Doctor P Remix) – 5:08", "# \"Love Goes Down\" (Doctor P Dub) – 5:08", "# \"Love Goes Down\" (Doctor P Remix Edit) – 3:47", "# \"Love Goes Down\" (Doctor P Remix) – 5:08"]}, {"page": "Danielle Senior", "response": ["Danielle Senior, now known as Dani Senior, is a London-based multi-platinum selling singer-songwriter, vocal producer and DJ, originally from Devon in the United Kingdom. She spent part of her childhood growing up in Stavanger, Norway. She is notable for her versatile writing style and has written for, and collaborated with, artists across a range of genres internationally, including Plan B (musician), Wretch 32, Shystie, Shenseea, Rationale (musician), Michael Woods (DJ), Sander van Doorn, Nora En Pure, Doctor P, Lvndscape, Burns (musician), Michael Gray (DJ), and for K-pop, J-pop and Cantopop superstars such as Twice, SHINee, KARA, Mariya Nishiuchi, FEMM, Jolin Tsai, Twins (group), and Raymond Lam, amongst others. In 2016 she collaborated with Gareth Malone on the charity single \"Flesh and Blood\" for The Choir For The Invictus Games feat. Laura Wright (singer), which debuted in the top 20 of the Official Singles Chart (UK) and hit no.1 on the iTunes Classical Music Chart, no.2 on the iTunes Pop Music Chart and no.5 on the Vodafone Big Top 40 Chart and Capital FM's top 10 Chart.", "As a persistent collaborator with DJs and Producers within the EDM scene she has written and featured on hit singles including, \"Run This Town\" Ft. Shenseea for OFFAIAH released by Positiva Records Virgin EMI Records on 18 August 2018, (nominated for Best Single and Best Newcomer at the Urban Music Awards UK that year), \"Tell My Heart\" Featuring Dani Senior for Nora En Pure  which spawned a world tour of the same name and \"Need to Feel Loved\" with Sander van Doorn & Lvndscape both released on Spinnin' Records, as well as working with acts such as The Wideboys, AurA and Cozi Costi. As an artist she recently teamed up production duos from Northern Ireland Glass Keys and Menrva, to release her single \"Unwant You\" on 4 April 2021, on the esteemed Swiss EDM label, Sirup Music owned by grammy-nominated EDX (DJ). This follows on from her recent releases \"Way To You\" with Doctor P, and \"Get No Better\" with Eskei83 and ReauBeau, both on the label owned by Doctor P and Flux Pavilion, Circus Records."]}, {"page": "Far East Movement discography", "response": ["! scope=\"row\" | \"Business\"(Doctor P featuring Far East Movement)"]}, {"page": "Camo & Krooked", "response": ["On April 2010, Camo & Krooked released \"Turn Up (The Music)\", featuring the vocals of Pat Fulgoni, through Hospital Records as part of the compilation album Sick Music 2. The song contains lyrics based on the song \"Turn on the Music\" by Roger Sanchez. The track was originally released on a double A-side joint single backed with Netsky's \"Memory Lane\". Their first individual single release on Hospital was \"Climax\", released on 28 June 2010. On October 2010, drum and bass producer and Shogun Audio owner DJ Friction had teamed up with Camo & Krooked to create the collaborative effort of \"Stand Up!\", featuring added vocals from Dynamite MC. Friction had also made a drum and bass remix of the Doctor P track \"Sweet Shop\" alongside the two."]}, {"page": "Flux Pavilion", "response": ["Flux Pavilion co-founded Circus Records along with childhood friend Doctor P, in 2009 with the backing of D&B pioneer DJ Swan-E and Earl Falconer of UB40 In 2010, Flux Pavilion released Lines In Wax containing one of his most popular tracks \"I Can't Stop\".", "In 2011 he produced the single \"Bass Cannon\", which peaked at number 56 on the UK Singles Chart, and was placed on the Radio 1 A-List. Along with Doctor P, Flux Pavilion presented the 2011 compilation album Circus One, to which he contributed four tracks. He is arguably best known for his song \"I Can't Stop\" from the Lines in Wax EP. In February 2011, Chiddy Bang created a freestyle to the song, which has appeared on their Peanut Butter and Swelly mixtape. In August 2011, the track was sampled by producer Shama \"Sak Pase\" Joseph for the song \"Who Gon Stop Me\" by Jay-Z and Kanye West on their collaborative album Watch the Throne. On 5 March 2012, \"I Can't Stop\" was used in the viral Kony 2012 campaign. It was also featured in the 2012 video game SSX, the 2013 film The Great Gatsby and the trailer for Ron Howard's 2013 film Rush starring Chris Hemsworth."]}, {"page": "Louder (DJ Fresh song)", "response": ["#\"Louder\" (Flux Pavilion and Doctor P Remix) – 3:55", "#\"Louder\" (featuring Sian Evans) (Flux Pavilion and Doctor P Remix) - 3:55", "#\"Louder\" (Flux Pavilion and Doctor P Remix) - 3:57"]}]}}