{"wiki_id": "http://www.wikidata.org/entity/Q2101215", "itemLabel": "Denis Payton", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Denis_Payton", "wikipedia_page": {"main": "Denis Archibald West Payton (11 August 1943 – 17 December 2006) was an English musician who played tenor saxophone, baritone saxophone, guitar and harmonica in the rock and roll band the Dave Clark Five.", "link_mentions": [{"page": "August 11", "response": ["*  1943   – Denis Payton, English saxophonist (d. 2006)"]}, {"page": "Walthamstow", "response": ["* Denis Payton, saxophonist for the Dave Clark Five, was born in Walthamstow 1943"]}, {"page": "List of Rock and Roll Hall of Fame inductees", "response": ["| 75px|Get Yourself a College Girl appearance, 1964 - From left: Mike Smith, Lenny Davidson, Denis Payton, Rick Huxley, and Dave Clark.", "| Dave Clark, Lenny Davidson, Rick Huxley, Denis Payton, and Mike Smith."]}, {"page": "1943 in music", "response": ["*August 11 – Denis Payton, saxophonist (The Dave Clark Five) (d. 2006)"]}, {"page": "The Dave Clark Five", "response": ["thumb|The Ed Sullivan Show in 1966. From left: Denis Payton, Dave Clark, Mike Smith, Rick Huxley and Lenny Davidson.", "The band had its origins in 1958, as the backing musicians for north London vocalist Stan Saxon. Dave Clark played drums and contributed background vocals, alongside a frequently changing line-up. Clark and guitarist Rick Huxley both participated in the 1958 line-up. Clark and his bandmates eventually split with Saxon and reconstituted themselves as a standalone concern in January 1962, making their home in the South Grove Youth Club in Tottenham, London. After a little more evolution, a lasting ensemble was settled, with Clark on drums, Huxley moving to bass, Lenny Davidson on lead guitar, Denis Payton on saxophone (and harmonica and second guitar), and Mike Smith on keyboards and main vocals. Davidson's previous bands were the Off Beats and the Impalas.", "Denis Payton died on 17 December 2006 at the age of 63 after a long battle with cancer. Rick Huxley died from emphysema on 11 February 2013 at the age of 72. Lenny Davidson taught guitar for many years at a school in Cambridgeshire, where he still lives.", "In attendance with the three surviving members of the DC5 were the families of Lenny Davidson and Rick Huxley, and Denis Payton's two sons. Mike Smith had planned on attending but died 11 days before the induction. Dave Clark opened up his acceptance speech by saying that he felt like he was at the Oscars. Davidson mentioned that they arrived in New York City for the ceremony on 8 March, exactly 44 years after the group's first appearance on The Ed Sullivan Show.", "*Denis Payton (ex the Renegades, the Les Heath Combo, the Blue Dukes, the Mike Jones Combo) – backing and occasional lead vocals, tenor and baritone saxophones, harmonica, rhythm guitar (1962–1970; died 2006) "]}, {"page": "2006 in music", "response": ["*December 17 – Denis Payton, The Dave Clark Five, 63"]}, {"page": "Catch Us If You Can (film)", "response": ["thumb|250px|From left: Dave Clark, Denis Payton, Mike Smith, Rick Huxley and Lenny Davidson.|alt=", "Denis Payton's last name is misspelled as \"Paynton\" in the opening and closing credits."]}, {"page": "Glad All Over Again", "response": ["*Denis Payton – backing and occasional lead vocals, tenor and baritone saxophones, harmonica, rhythm guitar"]}, {"page": "5", "response": ["*The Dave Clark Five, a.k.a. DC5, an English pop rock group comprising Dave Clark, Lenny Davidson, Rick Huxley, Denis Payton, and Mike Smith; active 1958–1970"]}, {"page": "Mike Smith (Dave Clark Five)", "response": ["thumb|Dave Clark Five The Ed Sullivan Show appearance, 1966. From left: Denis Payton, Dave Clark, Mike Smith, Rick Huxley and Lenny Davidson."]}, {"page": "Dennis", "response": ["* Denis Payton, British musician, saxophonist of Dave Clark Five"]}, {"page": "Glad All Over", "response": ["* Denis Payton – backing vocals, saxophone"]}, {"page": "2006 in British music", "response": ["*17 December – Denis Payton (The Dave Clark Five), 63"]}, {"page": "A Session with The Dave Clark Five", "response": ["*Denis Payton - saxes, backing vocals"]}, {"page": "The History of The Dave Clark Five", "response": ["*Denis Payton - saxophone, harmonica, lead vocals on \"I Miss You\""]}, {"page": "The Dave Clark Five discography", "response": ["|\"At the Scene\"B-side: \"I Miss You\" (from History of the Dave Clark Five) || align=\"center\" | Epic 9882 || align=\"center\" | 18 || align=\"center\" | 13 || align=\"center\" | February 1966 || align=\"center\" rowspan=\"1\"|More Greatest Hits || align=\"center\" | B-side lead vocal by Denis Payton"]}, {"page": "The Dave Clark Five Return!", "response": ["#\"Funny\" (Dave Clark, Denis Payton) - 1:52", "*Denis Payton - tenor saxophone,  backing vocals"]}, {"page": "Payton (surname)", "response": ["*Denis Payton (1943–2006), English saxophonist"]}, {"page": "Glad All Over (Dave Clark Five album)", "response": ["* Denis Payton – saxophone, backing vocals"]}, {"page": "American Tour", "response": ["*Denis Payton - saxophone,  backing vocals"]}, {"page": "Coast to Coast (Dave Clark Five album)", "response": ["*Denis Payton - saxophone,  backing vocals"]}]}}