{"wiki_id": "http://www.wikidata.org/entity/Q21061775", "itemLabel": "Frederick Dickens", "itemDescription": "cricketer (1873-1935)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Dickens_(cricketer)", "wikipedia_page": {"main": "Frederick Dickens (23 April 1873 – 20 February 1935) was an English cricketer who played first-class cricket in 29 matches for Warwickshire between 1898 and 1903. He was born in Stratford-upon-Avon, Warwickshire and died at Warwick.\nDickens played as a left-handed lower-order batsman and a left-arm bowler, rated as medium-pace on one cricket website but as \"slow\" in the contemporary Wisden Cricketers' Almanack. He played a minor match for a \"Gentlemen of Warwickshire\" side in 1898, but appears to have played in first-class cricket as a professional, though a newspaper report at the start of the 1899 season, his most successful, indicates that he was engaged on an individual match-by-match basis, rather than as a full professional on the county staff. He headed the Warwickshire bowling averages in 1899, and his most successful match was the game against Derbyshire when he took five for 22 in the first innings and followed up with six for 23 in the second. He did not take five wickets in an innings again in the 1899 season and in 1900 played only a few matches, without success. He returned for a single match in 1903 and took five Gloucestershire wickets for 96 runs, bowling unchanged through 42 consecutive overs, but it was his last first-class appearance.", "link_mentions": [{"page": "Frederick Dickens", "response": ["Frederick Dickens is buried in Darlington, within the grounds of the town's West Cemetery.", "==Siblings of Frederick Dickens==", "*Frederick Dickens: From Courtship to Courtroom Sidney P. Moss & Carolyn J. Moss", "*Frederick Dickens: Grave in West Cemetery, Darlington"]}, {"page": "List of Warwickshire County Cricket Club players", "response": ["* Frederick Dickens (1898–1903) : F. Dickens (29)"]}]}}