{"wiki_id": "http://www.wikidata.org/entity/Q21060511", "itemLabel": "Joshua Carrott", "itemDescription": "English YouTuber", "wikipedia_url": "https://en.wikipedia.org/wiki/Korean_Englishman", "wikipedia_page": {"main": "Korean Englishman (영국남자) is a YouTube channel created by Josh Carrott and Ollie Kendal. It contains videos in Korean and English describing the reactions of friends and celebrities to South Korean culture and food.\n\nJoshua Carrott was born in England to Daryl and Maureen Carrott. His father was a fireman, and his mother was a policewoman. When he was 12, his family moved from England to Qingdao, China. Carrott was first exposed to Korean culture through South Korean expatriate students at the International School of Qingdao. He then returned to England for university, majoring in Korean language studies at SOAS, University of London. He also studied a year abroad at Korea University. He is married to Gabriela Kook, an Argentine-born South Korean chef.Oliver Kendal is a childhood friend of Carrott; they first met while attending SOAS in London. He has a background in making videos, as well as photography and graphic design. In 2013, he was pursuing a master's degree in Biblical studies. In November of that year, he and Carrott incorporated the private limited company Kendal & Carrott in the United Kingdom. Oliver Kendal is married and has a daughter, Juno.The channel initially introduced Korean food to their English friends, who had never experienced Korean cuisine before. Most famously, they introduced fire noodles to their English friends as a spicy food challenge in 2014; this later developed into the \"Fire Noodle Challenge\". They have since collaborated with both Western and Korean celebrities.Carrott and Kendal launched a second channel, \"Jolly\", in 2017, which is intended for a more global audience. Both Kendal and Carrott frequently have friends and family on as guests, including Kendal's brother-in-law, Chris Lee.In 2019, over half of the channel's views came from Korea.On Josh's 32nd birthday, Ollie published Josh's (partially fictitious) autobiography, which was ghostwritten by his friends, with parts of the proceeds donated to Carrot Land Adventure Park in Ohakune, New Zealand.", "link_mentions": [{"page": "Gabie Kook", "response": ["She is the wife of Joshua Carrott (known on YouTube as \"Korean Englishman\"). The couple married in 2016."]}]}}