{"wiki_id": "http://www.wikidata.org/entity/Q21033443", "itemLabel": "William Broadhurst Brierley", "itemDescription": "British mycologist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Broadhurst_Brierley", "wikipedia_page": {"main": "William Broadhurst Brierley (1889–1963) was an English mycologist. He is known particularly for his work on \"grey mould\".", "link_mentions": [{"page": "Susan Sutherland Isaacs", "response": ["Isaacs embarked upon a series of lectures in infant school education at Darlington Training College; in logic at Manchester University; and psychology at London University. In 1914, she married William Broadhurst Brierley, a botany lecturer. A year later they moved to London where she became tutor to the Workers' Educational Association (WEA) and, from 1916, lectured in psychology at the University of London. In 1922, she divorced Brierley and married Nathan Isaacs (1895–1966), a metals trader who collaborated with his wife in her later work."]}, {"page": "Onygena equina", "response": ["William Broadhurst Brierley studied spore germination in the 1910s. He determined that fully grown (\"ripe\") ascospores can be germinated after a lengthy resting period, but a pretreatment with gastric acids reduced the time required. The time that mature spores need to germinate is correlated to the thickness and color of the spore wall. Treating \"unripe\" ascospores and chlamydospores with gastric juice did not decrease their germination time, and decreased their viability the longer they were treated. These observations confirmed and extended those already published by Ward; taken together, the results indicate that the spores need to pass through the digestive tract of a cow to be viable."]}, {"page": "Marjorie Brierley", "response": ["Marjorie Flowers Ellis was born in London Borough of Lewisham. She completed a 1st class honours degree in psychology at the University College London in 1921, and went on to obtain medical qualifications in 1928. She married William Broadhurst Brierley in 1922.  "]}, {"page": "John Percival (botanist)", "response": ["After education from 1868 to 1877 at the National school in Aysgarth, John Percival, a Quaker, was employed at the York Glass Works, owned at that time by a Quaker family named Spence. Percival worked there from 1877 to 1884. Mrs T. A. (Charlotte) Cotton, a member of the Spence family, endowed him with a scholarship. He matriculated on 13 October 1884 at St John's College, Cambridge. He graduated there with B.A. in 1887, M.A. in 1891, and Sc.D. in 1922. From 1894 to 1903 he was a professor of botany at the Agricultural College at Wye in Kent. At University College, Reading, he was director of the Agricultural Department from 1903 to 1907 and professor of agricultural botany from 1907 to 1932. The Linnean Society elected him a Fellow in 1893 and a vice-president for 1926–1927. William Broadhurst Brierley was his successor in the professorship from which Percival retired in 1932.Bunting, p. 24"]}, {"page": "Nathan Isaacs", "response": ["After the war ended, Isaacs again worked for Bessler, Waechter & Co., where he became a manager. He and Lionel Robbins in 1919 attended the psychology course at London University given by Susan Brierley, née Fairhurst. Isaacs married Susan, after her first marriage to William Broadhurst Brierley ended in divorce, in 1922. He rented a flat in Hunter Street, Bloomsbury, and she carried on a psychoanalytic practice there."]}]}}