{"wiki_id": "http://www.wikidata.org/entity/Q21061840", "itemLabel": "W. Allen Dixon", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/W._Allen_Dixon", "wikipedia_page": {"main": "William Allen Dixon (1821–1893) was a British architect who specialised in the design of churches and particularly Baptist churches. His heyday was in the late 1860s to the early 1870s when he designed at least five church in England, several of which are grade II listed buildings.", "link_mentions": [{"page": "Baptist Church, New Barnet", "response": ["A Baptist Church once stood on the north side of Station Road, New Barnet. The church was designed by W. Allen Dixon and construction was underway by 21 May 1872, when a memorial stone was laid. The building was  in a Renaissance style with elements of the Romanesque. It was built of gault and yellow stock brick with stone dressings. The front featured a three bay Palladian temple front. The church was a grade II listed building with English Heritage. It was demolished to make way for flats around 1982.Taylor, Pamela, & Joanna Corden. (1994) Barnet, Edgware, Hadley and Totteridge: A pictorial history. Chichester: Phillimore. Image caption 84. ", "Category:Buildings designed by W. Allen Dixon"]}, {"page": "William Allen Dixon", "response": ["#REDIRECT W. Allen Dixon"]}, {"page": "Sacred Heart Church, Reading", "response": ["The church was designed by W. Allen Dixon in 1872–75 and was originally an Anglican church known as the Church of St John the Evangelist. After it became disused it was taken up by the Polish community in Reading and is now a Catholic church. The building is grade II listed with Historic England.", "Category:Buildings designed by W. Allen Dixon"]}, {"page": "Cliff Town Congregational Church", "response": ["The Cliff Town Congregational Church is a Grade II listed church in Southend-on-Sea, Essex, England. It was designed by W. Allen Dixon in around 1865.", "Category:Buildings designed by W. Allen Dixon"]}, {"page": "St Margaret's Church, Putney", "response": ["St Margaret's, Putney is situated in Putney Park Lane, Putney, London, England. It was designed by W. Allen Dixon in 1872. Prior to its dedication to St Margaret as an Anglican church it was first a Baptist and then a Presbyterian chapel under the name of Granard Chapel. It is part of the Wandsworth Deanery in the Southwark Diocese of the Church of England, and is also a member of Churches Together in Putney and Roehampton. It is a member of Inclusive Church and during Winter months it runs a homeless shelter once a week with Glass Door. The vicar is currently (2020) the Revd Dr Brutus Green.", "The original parish church for Putney from Norman times was St Mary the Virgin, Wimbledon, a four-mile walk away. By 1302 St Mary the Virgin, Putney had been built in its current place by the river as a Chapel of Ease, becoming its own parish in 1658. The Victorians, ever keen church builders constructed Holy Trinity, Roehampton in 1842 (becoming a parish in 1862), St John's in 1859 and All Saints’ In 1874.  From 1871 to 1911 the population of Putney grew from 9000 to 25,000 requiring a further church. In 1872, The Building News and Engineering Journal recorded that W. Allen Dixon was acting as architect for Colonel Alexander Croll in alterations to Granard Park (or Lodge), Putney Park Lane, Roehampton, and the construction of a new church in its grounds.\"Trade News. Tenders.\" The Building News and Engineering Journal, Vol. 22, January–June 1872, p. 48. It was originally a Baptist chapel completed in 1873 in memory of his mother, for the lodge which is now the site of Granard primary school.Richardson, Kenneth. (2002) The \"Twenty-Five\" Churches of the Southwark Diocese: An inter-war campaign of church-building.  London: The Ecclesiological Society. p. 112.  In 1879 was sold to Presbyterians. When the chapel was transferred to the Presbyterians the Reverend Donald Matheson was appointed minister. He was a bright young thing who, having studied in Germany, where liberal attitudes to Biblical criticism were prevalent, controversially brought in the new translation of the Bible, the Revised Standard Version on its publication in 1881. He was keen on singing and held classes for his congregation as well as sending out postcards with the Sunday hymns on for his flock to practice. Most notably he set up the Granard Debating Society, where a young Ramsay MacDonald opened a debate on socialism. Within the congregation was also the Victorian Liberal and Radical John Bright and a future Lord Chancellor, Douglas Hogg, the first Viscount Hailsham. By 1898 the Presbyterians had moved to Briar Walk and the chapel was left vacant.", "Category:Buildings designed by W. Allen Dixon"]}, {"page": "Potters Bar Old Baptist Church", "response": ["The Potters Bar Old Baptist Church, as it is now known, is a former church in Hertfordshire, England.  It was designed by W. Allen Dixon in 1868. Dixon specialised in church architecture and Baptist churches in particular.", "Category:Buildings designed by W. Allen Dixon"]}, {"page": "Alexander Angus Croll", "response": ["Croll was the owner of Granard Park (or Lodge) Putney Park Lane, Roehampton. In 1872, The Building News and Engineering Journal recorded that architect W. Allen Dixon was acting for \"Colonel\" Croll in alterations to Granard Park and the construction of a new church in its grounds.\"Trade News. Tenders.\" The Building News and Engineering Journal, Vol. 22, January–June 1872, p. 48. The church was originally a Baptist chapel but it later became the Anglican church of St Margaret, Putney Park Lane.Richardson, Kenneth. (2002) The \"Twenty-Five\" Churches of the Southwark Diocese: An inter-war campaign of church-building.  London: The Ecclesiological Society. p. 112. "]}]}}