{"wiki_id": "http://www.wikidata.org/entity/Q21005394", "itemLabel": "Mark Clifford", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Clifford", "wikipedia_page": {"main": "Mark Clifford is a British musician and producer known primarily for his involvement with his band Seefeel. He has been involved in a number of solo and collaborative projects which have resulted in a wide range of material released on many different labels including Warp Records, Rephlex Records, Bella Union, Editions Mego and his own Polyfusia label.", "link_mentions": [{"page": "Bard College at Simon's Rock", "response": ["*Mark Clifford, former Editor-in-Chief of the South China Morning Post"]}, {"page": "Supachai Panitchpakdi", "response": ["He published numerous books, including Educational Growth in Developing Countries (1974), Globalization and Trade in the New Millennium (2001) and China and the WTO: Changing China, Changing World Trade (2002, co-authored with Mark Clifford)."]}, {"page": "Seefeel", "response": ["Seefeel are a British electronic and post-rock band formed in the early 1990s by Mark Clifford (guitar, programming), Daren Seymour (bass), Justin Fletcher (drums, programming), and Sarah Peacock (vocals, guitar). Their work became known for bridging the guitar-based shoegaze sound with the production techniques of ambient techno and electronica.", "The band's first album, Quique, was released in October 1993. Initial recordings for the album were made at home before the band transferred to Falconer Studios in North London, where the recordings were finished and the album mixed. It was mixed and produced by Mark Clifford. On its release, Quique was critically acclaimed, and was one of Melody Maker 's 'Albums of the Year'. In his review for the Melody Maker, Simon Reynolds called the album \"consummate, a blanched canvas for the imagination\". Spin magazine's review stated \"Seefeel, have struck a sublime groove midway between MBV's sensual tumult and Aphex Twin's ambient serenity\" going on to add \"you try to squint your ear in order to bring the music into focus, then give up, and just bask in the gorgeous, amorphous glow\".", "The band also became a notable live act, receiving many positive reviews in the NME and Melody Maker. In his review in Melody Maker of their show at the Garage, London, just prior to the release of Quique, Simon Reynolds noted their performance was \"like an orgasm turned into an environment, a honeycomb space of luminous, globular goo. You feel like you're actually inside the drugged or orgasmic body, a grotto of rushes, tingles, shivers, pangs, spasms\" further adding that the band was \"a pipe-dream come true, and the best new band of '93\". The band toured in Europe with the Cocteau Twins soon after the release of Quique, and Mark Clifford later undertook remix work for the band.", "In 1996, Seefeel released (CH-VOX) on Rephlex. After remixing \"Time to Find Me\", Richard James and Mark Clifford had become friends. James had asked Clifford and Seefeel to do a record for his Rephlex label and they had agreed. When signing to Warp Records, their contract recognised the promise made to James and following the release of Succour, Rephlex were given tracks recorded during these sessions and after but unreleased. Although intended as an EP, the record is considered by many to be the band's 'third' album. (CH-Vox) reduced percussion to a bare minimum and brought aural tapestries of processed guitar and fragmented sounds to the forefront.", "Mark Clifford has released music under the name Disjecta. Disjecta was named after a collection of essays by Samuel Beckett and was described as an outlet for his abstract constructivist electronica. Disjecta's music albums include Looking For Snags (1995), Clean Pit and Lid (1996) and True_Love By Normal (2003). Clifford also released music under the name Woodenspoon.", "*2013 interview with Mark Clifford and Justin Fletcher", "*Extensive interview with Seefeel's Mark Clifford", "*Future Sequence 2010 Interview with Seefeel's Mark Clifford"]}, {"page": "Zavoloka", "response": ["*Mark Clifford - (from Seefeel, label Polyfusia, Warp records) Musician from the UK. In 2007 they released Split01 EP on Polyfusia Records.", "*2007 Mark Clifford & Zavoloka \"Split01\" (CD / Digital download), Polyfusia"]}, {"page": "Quique (album)", "response": ["Quique  is the debut album by British music group Seefeel, released through Too Pure in late 1993. A predominantly instrumental recording which utilises elements of both rock and electronic music, it blends styles including techno, dream pop, ambient, and dub. Guitarist Mark Clifford worked continuously on tracks while other members either completed them or provided component ideas.", "Mark Clifford formed Seefeel in 1992 after posting advertisements for potential group members. After performing a few shows and recording demos, Seefeel signed to the Too Pure label in late 1992. Too Pure's co-owner Richard Roberts stated that upon hearing Seefeel's demo \"there was no obvious song for radio, but in my opinion it felt good. As we viewed ourselves as an experimental label that didn't want to be tied to a sound or a scene, it seemed to make sense to release something with the band.\" Seefeel chose Too Pure as they felt the label had respect for its artists, despite the low budget given to them to record Quique.", "Quique was released in the United Kingdom in late 1993 on Too Pure. In February 1994, US label Astralwerks announced that they had signed the group and were set to give the album a US release in April of that year. Quique was released on compact disc and cassette by Astralwerks. On 10 June 1994, Astralwerks released \"Plainsong\" as a single, with two remixes of \"Time to Find Me\" by the Aphex Twin as b-sides. In 2003, Mark Clifford stated that Quique sold between sixteen or seventeen thousand copies. After the release of Quique, Seefeel left Too Pure and signed to the more electronic music oriented Warp. Warp released their follow-up EP Starethrough on 18 April 1994.", "* Mark Clifford – guitar, sequencing, rhythm treatments, engineering", "thumbnail|Two original Seefeel members Sarah Peacock and Mark Clifford in 2010."]}, {"page": "Otherness (EP)", "response": ["While it was a companion piece to Twinlights, it was very different in style. Otherness is a remix EP, the only such record released by the band. The remixer and collaborator was Mark Clifford from the British experimental band Seefeel. All of the EP's tracks were also featured on either previous or future releases. Both \"Seekers Who Are Lovers\" and \"Violaine\" appeared on Milk and Kisses in totally reimagined versions. \"Feet-Like Fins\" originally appeared on the 1986 album Victorialand, and \"Cherry-Coloured Funk\" originally appeared on the 1990 album Heaven or Las Vegas.", "* Mark Clifford"]}, {"page": "Succour (album)", "response": ["Prior to the album's release, a single for the track \"Fracture\" was released on 26 September 1994. Succour was released on 25 March 1995 by Warp. It was released on compact disc, cassette and vinyl. The album was met with a lukewarm response and was ultimately not released in the United States, factors which contributed to a temporary breakup of the band in 1996. Mark Clifford focused on his side-project Disjecta while Peacock, Fletcher, and Seymour joined Mark Van Hoen for his group Scala.", "* Mark Clifford – mixing, arrangements"]}, {"page": "The Sessions Band", "response": ["* Mark Clifford – banjo"]}, {"page": "More Like Space", "response": ["The tracks on More Like Space were recorded around the same time as the material for Seefeel's album Quique. Mark Clifford stated that the tracks on More Like Space were simpler while the tracks on Quique were more involved and took longer to create.", "The track \"Blue Easy Sleep\" was described as \"essentially instrumental\" \"Time to Find Me (Come Inside)\" features Sarah Peacock's on vocals while \"Come Alive\" features vocals from Mark Clifford."]}, {"page": "Seefeel (album)", "response": ["The album is Seefeel's first full-length release in 14 years. Along with original members Mark Clifford and Sarah Peacock, the album features the rhythm section of former Boredoms drummer Iida Kazuhisa (aka E~Da) and Shigeru Ishihara (aka DJ Scotch Egg).", "* Mark Clifford – producer"]}, {"page": "Clifford, Mark", "response": ["#redirectMark Clifford"]}]}}