{"wiki_id": "http://www.wikidata.org/entity/Q21005715", "itemLabel": "George Edmundson", "itemDescription": "English association football player (born 1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Edmundson_(footballer)", "wikipedia_page": {"main": "Samuel George Alan Edmundson (born 15 August 1997) is an English professional footballer who plays as a centre-back for EFL League One club Ipswich Town.\nBorn in Manchester, Edmundson began his career at Oldham Athletic, joining the club's academy in 2013 and going on to make his senior debut in 2015. He spent six years at Oldham, spending time out on loan at Ramsbottom United, Alfreton Town and AFC Fylde during his time at the club. In June 2019, He joined Scottish club Rangers from Oldham. He spent two seasons at Rangers, including spending time out on loan at Derby County in 2021. He signed for Ipswich Town in July 2021.", "link_mentions": [{"page": "George Edmundson", "response": ["George Edmundson (4 February 1848 – 3 July 1930) was a clergyman of the Church of England and academic historian of the University of Oxford. He took up benefices in Northolt and Chelsea and in retirement lived in the south of France.", "Born at Redcar House in Redcar, Yorkshire, Edmundson was the eldest son of the Rev. George Edmundson of Redcar and St Leonards-on-Sea, by his marriage to Elizabeth Anne, daughter of William Whytehead of Thirsk. His father was lord of the manor of Agglethorpe in Coverdale. He was educated at St Peter's School, York, and at Magdalen College, Oxford, where he was a demy. He took a first class in Mathematical Moderations in 1869 and another first in Maths in 1870, graduated BA in 1871, won the Senior Hall Greek Testament Prize in 1873, and proceeded MA in 1874.EDMUNDSON, Rev. George, in Who Was Who (A. & C. Black, 1920–2008; online edition by Oxford University Press, December 2007 (subscription required), accessed 21 December 2010", "One of Edmundson's major works, The Church of Rome in the First Century, appeared in 1913, having originated as the Bampton Lectures for that year. Much later, J. A. T. Robinson praised it highly. In his Redating the New Testament (1977), he noted that Edmundson's book had largely been ignored at the time, perhaps because he was not a professional New Testament scholar and his conclusions were radically different from the consensus of the \"higher criticism\" of his day.Biography of George Edmundson at ccel.org, accessed 21 December 2010", "*Ford's Lecturer in English History (University of Oxford) 1909–1910The Oxford magazine vol. 27 (1909), p. 136: \"George Edmundson, MA, late Fellow of Brasenose College, to be Ford's Lecturer for the year 1909–10.\"", "*The Swedish Legend in British Guiana: an historical investigation (1900)Hugh Robert Mill, 'Geographical Literature of the month' in The Geographical Journal, vol. 15 (1900), p. 668, online at jstor.org (subscription required): \"The Swedish Legend in British Guiana. An historical investigation by the Rev. George Edmundson. Size 13 x 9. Presented by E. F. im Thurn, Esq. British Guiana – Boundary. British Guiana Boundary. Arbitration with the United States of Venezuela.\""]}, {"page": "2015–16 Oldham Athletic A.F.C. season", "response": ["| 30 October 2015 || DEF ||  || George Edmundson || Ramsbottom United || 30 November 2015 ||"]}, {"page": "Jordan Jones (footballer, born 1994)", "response": ["Jones scored his first Rangers goal on 27 September 2020 against Motherwell at Fir Park, the second in a 5–1 win. On 2 November 2020 it was announced that Jones and George Edmundson had been suspended by Rangers, pending an internal investigation, for attending a party and breaching COVID-19 regulations."]}, {"page": "2017–18 Oldham Athletic A.F.C. season", "response": ["| 13 October 2017 || CB ||  || George Edmundson || AFC Fylde || 1 January 2018 || "]}]}}