{"wiki_id": "http://www.wikidata.org/entity/Q21070029", "itemLabel": "Harry Bartlett", "itemDescription": "Australian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Bartlett_(Australian_politician)", "wikipedia_page": {"main": "Henry Bartlett (6 January 1835 – 8 July 1915), invariably known as \"Harry\", was a politician in the colony of South Australia, dubbed \"Father of the West Coast\".Harry was born in Bideford (or Holsworthy?), Devonshire, or possibly in/near London, and baptised 30 March 1835 in Holsworthy, Devon. His father Richard Bartlett appears to have died soon after the birth of his younger sister Amelia Lucy.  In 1851 Harry was living as a 16 year old with his Bartlett grandfather, an innkeeper in Bideford, Devon, whilst his mother was in nearby Holsworthy.  Harry arrived in Adelaide, South Australia on 5 July 1857 on the Gilmore which had departed Plymouth on 7 March, with his sister Amelia Lucy and mother Mary Anne Ribouleau Bartlett, née Perrers, entered on the ship's manifest as Harry Bartlett, age 21, born Middlesex (but his sister and mother born Holsworthy, Devon), occupation labourer.He soon went to Woolundunga Station, near Port Augusta, and there met John McKinlay, the noted explorer, whom he accompanied on a trip to the Barrier country. Later they went together to Port Lincoln, crossing the gulf in the steamer Daphne. At that time the only buildings in Port Lincoln were a couple of shanties owned by Captain Bishop (later owner of Boston Island), and \"Jimmy\" Owen. He spent several years prospecting on Kangaroo Island, and Yorke Peninsula from Franklin Harbour to the Gawler Ranges, gaining an intimate knowledge of the country.\nHe was elected to the seat of Yorke Peninsula in the South Australian House of Assembly and sat from March 1887 to April 1896. His colleagues were, in turn, Robert Caldwell, Henry Lamshed and Arthur Short. He was remembered for his tireless advocacy on behalf of Yorke Peninsula agriculturists at a time when pastoralists were all-powerful.\nHe owned 742 acres (300 ha) near Port Vincent, by the road to Curramulka.", "link_mentions": [{"page": "Yorke Peninsula", "response": ["* Harry Bartlett (1835–1915) MHA for Yorke Peninsula 1887–1896, dubbed \"Father of the West Coast\"."]}, {"page": "Bartlett (surname)", "response": ["* Harry Bartlett (Australian politician) (1835–1915), South Australian parliamentarian"]}, {"page": "Electoral district of Yorke Peninsula", "response": ["| rowspan=3|Harry Bartlett "]}, {"page": "Members of the South Australian House of Assembly, 1893–1896", "response": ["|| Harry Bartlett ||  || Yorke Peninsula || 1887–1896"]}, {"page": "Members of the South Australian House of Assembly, 1890–1893", "response": ["|| Harry Bartlett ||  || Yorke Peninsula || 1887–1896"]}, {"page": "Members of the South Australian House of Assembly, 1887–1890", "response": ["|| Harry Bartlett || Yorke Peninsula || 1887–1896"]}, {"page": "Henry Lamshed", "response": ["He was a member of the Strathalbyn District Council from 1867 until he closed his carrying business in 1873 to take up farming on Yorke Peninsula. In 1888 he was one of the foundation members of the Yorke's Peninsula District Council. He was elected to the seat of Yorke Peninsula in the South Australian House of Assembly and served from April 1890 to April 1893 as a colleague of Harry Bartlett."]}, {"page": "Arthur Short (politician)", "response": ["When Maitland, Kilkerran, Moolywurtie, and Cunningham were formed into a district he was elected the first district clerk, later Maitland's first town clerk, and Mayor for a total of six years. He was elected to the South Australian House of Assembly seat of Yorke Peninsula and served from April 1893 to April 1896, succeeding Henry Lamshed as associate of Harry Bartlett. He stood again, but was beaten by William Copley."]}, {"page": "Pirie Street Brewery", "response": ["*Frederick Samuel Sison (c. 1831 – 29 December 1891), an Englishman, was a traveller for E. J. F. Crawford before joining with Syme. He married (Amelia) Lucy Bartlett (1840 – 6 October 1914), a sister of Harry Bartlett. He accompanied Syme to Britain, but after the latter's death returned to South Australia, and settled in Port Lincoln, where he built a mansion, \"Boston House\", which still stands. Sison and Bartlett were great mates, went fishing together."]}]}}