{"wiki_id": "http://www.wikidata.org/entity/Q21115130", "itemLabel": "Jane Wernick", "itemDescription": "British construction engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_Wernick", "wikipedia_page": {"main": "Jane Melville Wernick CBE FREng (born April 1954) is a British structural engineer and a director of engineersHRW. Having founded Jane Wernick Associates in 1998, she gave the firm to an employee trust in 2010 and it was incorporated into engineersHRW in May 2015. Previously she worked at Arup (1976–1998). During her career with Arup, and later with Jane Wernick Associates, she was closely involved with projects including Stansted Airport terminal building and the London Eye.", "link_mentions": [{"page": "List of women architects", "response": ["* Jane Wernick (born 1954), architect, educator, associated with the London Eye"]}, {"page": "2015 New Year Honours", "response": ["* Jane Melville Wernick – Jane Wernick Associates Ltd. For services to Structural and Civil Engineering."]}, {"page": "Srdjan Jovanovic Weiss", "response": ["Jovanovic Weiss was born in Subotica and lived in Novi Sad and Belgrade until 1995 completing his degree in architecture and engineering. His previous degree was at Advanced Mathematics at Gymnasium Jovanovic Jovanovic-Zmaj in Novi Sad in 1986. After Belgrade experience he moved to the United States for graduate studies at Harvard University on 1995. After two years at Harvard studying with Richard Gluckman, Jane Wernick, Jacques Herzog, Pierre de Meuron, Adriaan Geuze and Rem Koolhaas Jovanovic Weiss moved to New York where he started practicing architecture with Richard Gluckman and Robert Wilson. In 1998 he won the Second Prize in the 2G Competition to expand Mies van der Rohe's Barcelona Pavilion in Barcelona and soon after opened his own architectural practice called Normal Group for Architecture with a partner. This collaboration lasted until 2003 when Jovanovic Weiss founded NAO.NYC (Normal Architecture Office), a collaborative studio for design of architecture, cities and exhibitions and a successor of Normal Group for Architecture based in New York. He also co-founded SMS (School of Missing Studies), international art & architecture group for studying cities marked or undergoing abrupt transition."]}]}}