{"wiki_id": "http://www.wikidata.org/entity/Q21176737", "itemLabel": "Robert Vere de Vere", "itemDescription": "Irish barrister and judge; active in British Colonial Service", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Vere_de_Vere", "wikipedia_page": {"main": "Robert Stephen Vere de Vere (13 July 1872 – 15 September 1936) was an Irish judge in the British Colonial Service.\nHe was the son of Major Aubrey Stephen Vere O’Brien of Adare, Limerick, Ireland and changed his surname to de Vere by Royal Licence after inheriting Curragh Chase on the death of his father in 1898. He was educated at Winchester School and Trinity College, Cambridge, where he was awarded B.A. in 1891, and LL.B. in 1894. He then entered the Middle Temple to study law and was \"called to the bar\" in 1898.He joined the Colonial Civil Service in Limerick and served as a Magistrate before going to South Africa with the Paget’s Horse Regiment to fight in the Boer War. He later served as Lieutenant in the 5th (Cinque Ports) Battalion of the Royal Sussex Regiment.\nOn his return he was posted to the Gold Coast as a District Commissioner (1903–1905) and then to the Seychelles as Legal Adviser and Crown Prosecutor he also was appointed Acting Chief Justice whilst maintaining residence in Ireland. During the First World War he was a Military Censor with the British Expeditionary Force. From 1922 to 1926, he was the British Judge in the Anglo-French Condominium of New Hebrides, before serving in Cyprus for two years as President of the District Court.\nIn 1928 he was transferred to the Seychelles as Chief Justice and acting Governor, creating a diplomatic incident when the outgoing Chief Justice and acting Governor, Justin Louis Devaux, refused to hand over power until his own departure a month later. In 1931 de Vere was posted to Grenada as Chief Justice, retiring in 1935.He died on 15 September 1936. He had married Isabel Moule, the daughter of the Rev. Handley Moule, Bishop of Durham. They had one daughter, Joan, who married Martin Alban Wynne-Jones, a civil servant. Wynne-Jones later took order in the Anglican Church and they settled in Limerick. They had one son, the noted broadcaster Vere Wynne-Jones.", "link_mentions": {}}}