{"wiki_id": "http://www.wikidata.org/entity/Q211831", "itemLabel": "David Suchet", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Suchet", "wikipedia_page": {"main": "Sir David Courtney Suchet,  ( SOO-shay; born 2 May 1946) is an English actor known for his work on British stage and television. He portrayed Edward Teller in the television serial Oppenheimer (1980) and received the RTS and BPG awards for his performance as Augustus Melmotte in the British serial The Way We Live Now (2001). International acclaim and recognition followed his performance as Agatha Christie's detective Hercule Poirot in Agatha Christie's Poirot (1989–2013), for which he received a 1991 British Academy of Film and Television Arts (BAFTA) nomination.", "link_mentions": [{"page": "Agatha Christie", "response": ["The television adaptation Agatha Christie's Poirot (1989–2013), with David Suchet in the title role, ran for 70 episodes over 13 series. It received nine BAFTA award nominations and won four BAFTA awards in 1990–1992. The television series Miss Marple (1984–1992), with Joan Hickson as \"the BBC's peerless Miss Marple\", adapted all 12 Marple novels. The French television series  (2009–2012, 2013–2020), adapted 36 of Christie's stories.", "BBC television released Agatha Christie: A Life in Pictures in 2004, in which she is portrayed by Olivia Williams, Anna Massey, and Bonnie Wright (at different stages in her life). ITV's Perspectives: \"The Mystery of Agatha Christie\" (2013) is hosted by David Suchet."]}, {"page": "Hercule Poirot", "response": ["Poirot has been portrayed on radio, in film and on television by various actors, including Austin Trevor, John Moffatt, Albert Finney, Peter Ustinov, Ian Holm, Tony Randall, Alfred Molina, Orson Welles, David Suchet, Kenneth Branagh, and John Malkovich.", "Poirot is extremely punctual and carries a pocket watch almost to the end of his career.\"he walked up the steps to the front door and pressed the bell, glancing as he did so at the neat wrist-watch which had at last replaced an old favourite – the large turnip-faced watch of early days. Yes, it was exactly nine-thirty. As ever, Hercule Poirot was exact to the minute.\"  He is also particular about his personal finances, preferring to keep a bank balance of 444  pounds, 4 shillings, and 4 pence. Actor David Suchet, who portrayed Poirot on television, said \"there's no question he's obsessive-compulsive\". Film portrayer Kenneth Branagh said that he \"enjoyed finding the sort of obsessive-compulsive\" in Poirot.", "Japp is a Scotland Yard Inspector and appears in many of the stories trying to solve cases that Poirot is working on. Japp is outgoing, loud, and sometimes inconsiderate by nature, and his relationship with the refined Belgian is one of the stranger aspects of Poirot's world. He first met Poirot in Belgium in 1904, during the Abercrombie Forgery. Later that year they joined forces again to hunt down a criminal known as Baron Altara. They also meet in England where Poirot often helps Japp and lets him take credit in return for special favours. These favours usually entail Poirot being supplied with other interesting cases.Captain Arthur Hastings  In Agatha Christie's Poirot, Japp was portrayed by Philip Jackson. In the film, Thirteen at Dinner (1985), adapted from Lord Edgware Dies, the role of Japp was taken by the actor David Suchet, who would later star as Poirot in the ITV adaptations.", "He appeared again as Poirot in three television films: Thirteen at Dinner (1985), Dead Man's Folly (1986), and Murder in Three Acts (1986). Earlier adaptations were set during the time in which the novels were written, but these television films were set in the contemporary era. The first of these was based on Lord Edgware Dies and was made by Warner Bros. It also starred Faye Dunaway, with David Suchet as Inspector Japp, just before Suchet began to play Poirot. David Suchet considers his performance as Japp to be \"possibly the worst performance of [his] career\".", "==== David Suchet ====", "David Suchet starred as Poirot in the ITV series Agatha Christie's Poirot from 1989 until June 2013, when he announced that he was bidding farewell to the role. \"No one could've guessed then that the series would span a quarter-century or that the classically trained Suchet would complete the entire catalogue of whodunits featuring the eccentric Belgian investigator, including 33 novels and dozens of short stories.\" His final appearance was in an adaptation of Curtain: Poirot's Last Case, aired on 13 November 2013.", "In season 2, episode 4 of TVFPlay's Indian web series Permanent Roommates, one of the characters refers to Hercule Poirot as her inspiration while she attempts to solve the mystery of the cheating spouse. Throughout the episode, she is mocked as Hercule Poirot and Agatha Christie by the suspects. TVFPlay also telecasted a spoof of Indian TV suspense drama CID as \"Qissa Missing Dimaag Ka: C.I.D Qtiyapa\". In the first episode, when Ujjwal is shown to browse for the best detectives of the world, David Suchet appears as Poirot in his search."]}, {"page": "Anthony Hopkins", "response": ["The following year he starred as Quasimodo in the CBS television movie The Hunchback of Notre Dame (1982). The movie also starred Derek Jacobi, David Suchet, Tim Pigott-Smith, Nigel Hawthorne, and John Gielgud. He also starred in Strangers and Brothers (1984), Arch of Triumph (1984), Guilty Conscience (1985), Mussolini and I (1985), and The Tenth Man (1988). "]}, {"page": "James Bond", "response": ["The BBC have adapted five of the Fleming novels for broadcast: in 1990 You Only Live Twice was adapted into a 90-minute radio play for BBC Radio 4 with Michael Jayston playing James Bond. The production was repeated a number of times between 2008 and 2011. On 24 May 2008 BBC Radio 4 broadcast an adaptation of Dr. No. The actor Toby Stephens, who played Bond villain Gustav Graves in the Eon Productions version of Die Another Day, played Bond, while Dr. No was played by David Suchet. Following its success, a second story was adapted and on 3 April 2010 BBC Radio 4 broadcast Goldfinger with Stephens again playing Bond. Sir Ian McKellen was Goldfinger and Stephens' Die Another Day co-star Rosamund Pike played Pussy Galore. The play was adapted from Fleming's novel by Archie Scottney and was directed by Martin Jarvis."]}, {"page": "Kevin Spacey", "response": ["In 2009, he directed the premiere of Joe Sutton's Complicit, with Richard Dreyfuss, David Suchet and Elizabeth McGovern. Later that year, Trevor Nunn directed Spacey in a revival of Inherit the Wind. Spacey played defense lawyer Henry Drummond, a role that was made famous by Spencer Tracy in the 1960 film of the same name. Sam Mendes directed Spacey in Shakespeare's Richard III; Spacey played the title role. The show began in June 2011, commencing a worldwide tour culminating in New York in early 2012. In March 2014, it was announced that Spacey would star in a one-man play at the Old Vic to celebrate his ten years as artistic director. He took on the part of Clarence Darrow in the play."]}, {"page": "Lavrentiy Beria", "response": ["Beria was played by British actor Bob Hoskins in the 1991 film Inner Circle, and by David Suchet in Red Monarch. Simon Russell Beale played Beria in the 2017 satirical film The Death of Stalin."]}, {"page": "May 2", "response": ["*  1946   – David Suchet, English actor "]}, {"page": "Sigmund Freud", "response": ["In 1984, the BBC produced the six-episode mini-series Freud: the Life of a Dream starring David Suchet in the lead role."]}, {"page": "The Chronicles of Narnia", "response": ["Between 1998 and 2002, Focus on the Family produced radio dramatisations of the entire series through its Radio Theatre programme. Over one hundred performers took part including Paul Scofield as the storyteller and David Suchet as Aslan.  Accompanied by an original orchestral score and cinema-quality digital sound design, the series was hosted by Lewis's stepson Douglas Gresham and ran for just over 22 hours. Recordings of the entire adaptation were released on compact disc between 1999 and 2003."]}, {"page": "Thomas Wolsey", "response": ["* David Suchet plays Wolsey in the 2003 two-part television serial Henry VIII with Ray Winstone."]}, {"page": "1946", "response": ["** David Suchet, British actor"]}, {"page": "1860", "response": ["* May 28 – One of the worst storms ever experienced in the region hits the east coast of England, sinking more than 100 ships and killing at least 40 people.Among those rescued at sea is the crew of the brig Hannah, captained by George Jezzard, the great-great-great-grandfather of actor David Suchet."]}, {"page": "Amadeus (play)", "response": ["In 1982, Richard Wherrett directed a Sydney Theatre Company production at the Theatre Royal, Sydney. It starred John Gaden as Salieri, Drew Forsythe as Mozart and Linda Cropper as Constanze, with Lyn Collingwood as Mrs Salieri and Robert Hughes as Venticello II. It ran from 6 April to 29 May 1982. Adam Redfield (as Mozart) and Terry Finn (as Constanze) appeared in the 1984 Virginia Stage Company production, at the Wells Theatre in Norfolk, Virginia, directed by Charles Towers. The play was revived in 1999 at the Music Box Theatre, New York City, directed again by Peter Hall and ran for 173 performances (15 December 1999 until 14 May 2000), receiving Tony Award nominations for Best Revival and Best Actor in a Play (David Suchet, who played Salieri). Also in the cast were Michael Sheen as Mozart, Cindy Katz as Constanze and David McCallum as Joseph II."]}, {"page": "Who's Afraid of Virginia Woolf?", "response": ["Diana Rigg and David Suchet starred in a 1996 production of the play at the Almeida Theatre in London before transferring to the Aldwych Theatre in London's West End in 1997."]}, {"page": "Dr. No (novel)", "response": ["The film Dr. No was released in 1962, produced by Albert R. Broccoli and Harry Saltzman, and directed by Terence Young. It was the first Bond film in the Eon Productions series; Sean Connery portrayed Bond, with Joseph Wiseman as Doctor No and Ursula Andress as Honeychile Rider. Although the story follows the same general storyline, there are some changes: the film shows No to be an operative of the fictional crime organisation SPECTRE and his island fortress is nuclear-powered; No is killed not by a surge of guano, but by drowning in reactor coolant. The novel was dramatised for BBC Radio 4 in May 2008. The actor Toby Stephens played Bond, while No was played by David Suchet."]}, {"page": "Return of the Jedi", "response": ["* Ian McDiarmid as The Emperor, the founder and supreme ruler of the Galactic Empire, and Darth Vader's Sith master. Alan Webb was originally cast in the role but he dropped out due to illness. Lindsay Anderson was offered the role but he declined due to scheduling conflicts with Britannia Hospital. Ben Kingsley and David Suchet were also considered."]}, {"page": "Ulysses (novel)", "response": ["In 1988, the episode \"James Joyce's Ulysses\" of the documentary series The Modern World: Ten Great Writers was shown on Channel 4. Some of the novel's most famous scenes were dramatised. David Suchet played Leopold Bloom."]}, {"page": "Method acting", "response": ["*David Suchet"]}, {"page": "Executive Decision", "response": ["Executive Decision is a 1996 American action film directed by Stuart Baird in his directorial debut. The film stars Kurt Russell, Steven Seagal, Halle Berry, John Leguizamo, Oliver Platt, Joe Morton, David Suchet, and B.D. Wong. It depicts the rescue of an airline hijacked by terrorists, by a small team placed on the plane in mid flight. The film was released in the United States on March 15, 1996, and grossed $122 million against a $55 million budget.", "* David Suchet as Nagi Hassan / Altar, Co-chief of the Extremist Organization"]}, {"page": "Dial M for Murder", "response": ["A Perfect Murder is a 1998 remake directed by Andrew Davis in which the characters of Halliday and Swann are combined, with the husband (Michael Douglas) both hiring and coercing his wife's lover (played by Viggo Mortensen) into a scheme to kill her (Gwyneth Paltrow). However, the lover hatches a revenge plot against the husband. Things go disastrously wrong for both of them, bringing in the cold, smoothly dogged police inspector (David Suchet), whose role is much reduced, as it is Gwyneth Paltrow's character, the wife, who unravels much of the mystery."]}, {"page": "Jeeves", "response": ["* In 1988, David Suchet portrayed Jeeves and Simon Cadell played Bertie Wooster in the BBC Saturday Night Theatre radio adaptation of the novel Right Ho, Jeeves."]}, {"page": "Bertie Wooster", "response": ["* Simon Cadell played Bertie Wooster opposite David Suchet as Jeeves in the BBC Saturday Night Theatre radio adaptation of Right Ho, Jeeves in 1988."]}, {"page": "Edward Gorey", "response": ["* The Gorey Details. BBC Radio program compiled and presented by Philip Glassborow, including interviews with Andreas Brown of the Gotham Book Mart, actor Frank Langella (star of Gorey's Dracula on Broadway), Alison Lurie, Alex Hand, Jack Braginton Smith, Katherine Kellgren, and featuring David Suchet as the voice of Gorey."]}, {"page": "Pinner", "response": ["*Ronnie Barker and David Suchet were both one-time owners of 17th-century Elmdene in Church Lane.Pinner Local History. Retrieved 12 August 2008"]}, {"page": "Iron Eagle", "response": ["* David Suchet as Ministry of Defense Colonel Akir Nakesh"]}, {"page": "Death of a Salesman", "response": ["* 2015: Radio drama, starring David Suchet and Zoë Wanamaker, directed by Howard Davies, and broadcast on BBC Radio 3."]}, {"page": "Murder on the Orient Express", "response": ["David Suchet reprised the role of Hercule Poirot in \"Murder on the Orient Express\" (2010), a 90-minute movie-length episode of the television series Agatha Christie's Poirot co-produced by ITV Studios and WGBH-TV, adapted for the screen by Stewart Harcourt. The original air date was 11 July 2010 in the United States, and it was aired on Christmas Day 2010 in the UK. The cast includes Dame Eileen Atkins as Princess Dragomiroff, Hugh Bonneville as Masterman, Jessica Chastain as Mary Debenham, Barbara Hershey as Mrs Hubbard, Toby Jones as Ratchett, and David Morrissey as Colonel Arbuthnot. The character Cyrus Hardman (the former American police officer turned private detective) has been largely amalgamated with the chauffeur Foscarelli (in as much as regards being the lover of the dead maid) and Dr Constantine (who in the novel is unrelated to the murders) becomes a co-conspirator, depicted as having been the Armstrong family's doctor in America. As in the 2017 film, McQueen's father was the prosecutor rather than the Armstrongs' lawyer, whose career was ruined after he was threatened into acquitting Cassetti. The main difference from the novel is the additional element of Poirot's Catholicism being brought to the forefront, and his personal and religious struggle with whether to expose the murderers or let them off the hook, as well as a much darker atmosphere of the film, in comparison with the novel.", "A board game based on the novel named Orient Express was released in 1985. The point and click computer game Agatha Christie: Murder on the Orient Express was released in November 2006 for Windows and expanded on Agatha Christie's original story with a new playable central character as Hercule Poirot (voiced by David Suchet) is ill and recovering in his train compartment."]}, {"page": "Terence Rattigan", "response": ["There was a revival of The Deep Blue Sea in 1993, at the Almeida Theatre, London, directed by Karel Reisz and starring Penelope Wilton. A string of successful revivals followed, including The Winslow Boy at the Chichester Festival Theatre in 2001 (with David Rintoul, and subsequently on tour in 2002 with Edward Fox), Man and Boy at the Duchess Theatre, London, in 2005, with David Suchet as Gregor Antonescu, and In Praise of Love at Chichester, and Separate Tables at the Royal Exchange, Manchester, in 2006. His play on the last days of Lord Nelson, A Bequest to the Nation, was revived on Radio 3 for Trafalgar 200, starring Janet McTeer as Lady Hamilton, Kenneth Branagh as Nelson, and Amanda Root as Lady Nelson."]}, {"page": "2002 in film", "response": ["| Live from Baghdad || HBO Films || Mick Jackson (director); Robert Wiener, Richard Chapman, John Patrick Shanley, Timothy J. Sexton (screenplay); Michael Keaton, Helena Bonham Carter, Joshua Leonard, Lili Taylor, David Suchet, Bruce McGill, Michael Murphy, Paul Guilfoyle, Hamish Linklater, Michael Cudlitz, Robert Ray Wisdom, Clark Gregg, Matt Keeslar, Kurt Fuller, John Carroll Lynch, Tom Amandes, David Kaye, Bill Moseley, David Shatraw, Murphy Dunne, Peter Jason, Craig Anton, Jason Antoon, Carole Davis, Shaun Toub, Brian George, Joel Swetow, Ofer Samra, Castulo Guerra, Kevin Bacon, James Baker III, Tom Brokaw, George H.W. Bush, Dick Cheney, Tom Foley, Saddam Hussein, Peter Jennings, Ted Koppel, Dan Rather, Bernard Shaw, Fred Ward || Drama, War || Live Action"]}, {"page": "2003 in film", "response": ["| The In-Laws || Warner Bros. Pictures / Franchise Pictures || Andrew Fleming (director); Andrew Bergman, Nat Mauldin, Ed Solomon (screenplay); Michael Douglas, Albert Brooks, Robin Tunney, Ryan Reynolds, David Suchet, Lindsay Sloane, Candice Bergen, Maria Ricossa, Vladimir Radian, Michael Bodnar, Boyd Banks, Susan Aceron, Chang Tseng, Tamara Gorski, Matt Birman, Russell Andrews, Richard Waugh, Kristin Chenoweth || Comedy || || Live Action"]}, {"page": "1996 in film", "response": ["| Executive Decision || Warner Bros. Pictures / Silver Pictures || Stuart Baird (director); Jim Thomas, John Thomas (screenplay); Kurt Russell, Steven Seagal, Halle Berry, John Leguizamo, Oliver Platt, Joe Morton, David Suchet, BD Wong, Len Cariou, Whip Hubley, Andreas Katsulas, Mary Ellen Trainor, Marla Maples, J. T. Walsh, Nicholas Pryor, Robert Apisa, William James Jones, Charles Hallahan, Richard Riehle, Ken Jenkins, Jay Tavare, Christopher Maher, Ray Baker, Michael Milhoan || Action || Live action", "| Deadly Voyage || HBO NYC Productions || John Mackenzie (director); Stuart Urban (screenplay); Omar Epps, Joss Ackland, Sean Pertwee, David Suchet, Andrew Divoff, Jean-Claude La Marre, Adewale Akinnuoye-Agbaje, Ilia Volok, Roman Varshavsky, Chiwetel Ejiofor, Omanza Eugene Shaw, Henry Nartey, Oscar Provencal, Wakefield Ackuaku, David Dontoh, Maxine Burth, Michael Byrne, Ravil Isyanov, Tomas Lukes, Zillah Yao || Thriller || Live action"]}, {"page": "1998 in film", "response": ["| A Perfect Murder || Warner Bros. Pictures  || Andrew Davis (director); Patrick Smith Kelly (screenplay); Michael Douglas, Gwyneth Paltrow, Viggo Mortensen, David Suchet, Sarita Choudhury, Michael P. Moran, Novella Nelson, Constance Towers, David Eigenberg, Gerry Becker, Will Lyman || Crime, Thriller || Live action", "* A Perfect Murder, directed by Andrew Davis, starring Michael Douglas, Gwyneth Paltrow, Viggo Mortensen and David Suchet"]}, {"page": "1999 in film", "response": ["| Wing Commander || 20th Century Fox || Chris Roberts (director/screenplay); Kevin Droney (screenplay); Freddie Prinze Jr., Saffron Burrows, Matthew Lillard, Tchéky Karyo, Jürgen Prochnow, David Suchet, David Warner, Ginny Holder, Hugh Quarshie, Ken Bones, John McGlynn, Richard Dillane, Mark Powley, David Fahm, Mark Hamill, Simon MacCorkindale, Craig Kelly, Fraser James, Kieron Phipps, Raffaello Degruttola, Chris Roberts || Action, Sci-Fi || Live action", "| RKO 281 || HBO Pictures / Scott Free Productions / BBC Films / WGBH Boston || Benjamin Ross (director); John Logan (screenplay); Liev Schreiber, James Cromwell, Melanie Griffith, Brenda Blethyn, Roy Scheider, John Malkovich, Liam Cunningham, David Suchet, Fiona Shaw, Anastasia Hille, Roger Allam, Simeon Andrews, William Armstrong, Jay Benedict, Ron Berglas, Paul Birchard, Neil Conrich, Michael Cronin, Sarah Franzl, Aaron Keeling, Joseph Long, Olivier Pierre, Roger Rose, Rolf Saxon, Adrian Schiller, Kerry Shale, Cyril Shaps, Tusse Silberg, Toby Whithouse, Tim Woodward, Angus Wright, Bobby Valentino, Lucy Cohu || Historical Drama || Live action"]}, {"page": "Agatha Christie's Poirot", "response": ["Poirot (also known as Agatha Christie's Poirot) is a British mystery drama television programme that aired on ITV from 8 January 1989 to 13 November 2013. David Suchet starred as the eponymous detective, Agatha Christie's fictional Hercule Poirot. Initially produced by LWT, the series was later produced by ITV Studios. The series also aired on VisionTV in Canada and on PBS and A&E in the United States.", "|colspan=\"13\" | David Suchet", "Suchet was recommended for the part by Christie's family, who had seen him appear as Blott in the TV adaptation of Tom Sharpe's Blott on the Landscape. Suchet, a method actor, said that he prepared for the part by reading all the Poirot novels and every short story, and copying out every piece of description about the character.Dillin, John (25 March 1992). \"The Actor Behind Popular Poirot\" . The Christian Science Monitor.Dudley, Jane. \"Award-winning actor David Suchet plays Robert Maxwell in a gripping account of the dramatic final stage of the media tycoon's life\" . BBC.co.uk.Dudley, Jane (27 April 1997). \"Inside the mind of a media monster\" . Yorkshire Post. Suchet told The Strand Magazine: \"What I did was, I had my file on one side of me and a pile of stories on the other side and day after day, week after week, I ploughed through most of Agatha Christie's novels about Hercule Poirot and wrote down characteristics until I had a file full of documentation of the character. And then it was my business not only to know what he was like, but to gradually become him. I had to become him before we started shooting\".", "During the filming of the first series, Suchet almost left the production during an argument with a director, insisting that Poirot's odd mannerisms (in this case, putting a handkerchief down before sitting on a park bench) be featured;(29 October 2013). \"David Suchet reveals he almost quit Poirot during the first series after an argument over a hanky\" . Mirror.co.uk. he later said \"there's no question [Poirot's] obsessive-compulsive\". According to many critics and enthusiasts, Suchet's characterisation is considered to be the most accurate interpretation of all the actors who have played Poirot, and the closest to the character in the books. In 2013, Suchet revealed that Christie's daughter Rosalind Hicks had told him she was sure Christie would have approved of his performance.\"Curtain: Press Packet\" . ITVStatic.com.", "Agatha Christie's grandson Mathew Prichard commented: \"Personally, I regret very much that she [Agatha Christie] never saw David Suchet. I think that visually he is much the most convincing and perhaps he manages to convey to the viewer just enough of the irritation that we always associate with the perfectionist, to be convincing!\"", "| David Suchet", "| David Suchet", "Being Poirot is a 50-minute ITV television documentary (2013) in which David Suchet attempts to unravel the mysterious appeal of Hercule Poirot and how he portrayed him. It was broadcast in the United Kingdom on the same evening as the final episode, \"Curtain\".", "Aside from \"Poirot and the Regatta Mystery\", the one authentic Hercule Poirot story not included in any form, whole or partial, in the Agatha Christie's Poirot series is the 1930 play Black Coffee. Although it was adapted into a novel in 1998, with the permission of the Christie Estate, it was not previously available in novel format. David Suchet did give a live reading of the original play version for the Agatha Christie Theatre Company and therefore felt that he had done justice to the entire authentic canon.Radio Times report  of the reading.Details of the reading of Black Coffee  with link to review."]}, {"page": "1987 in film", "response": ["| Harry and the Hendersons || Universal Pictures / Amblin Entertainment || William Dear (director/screenplay); William E. Martin, Ezra D. Rappaport (screenplay); John Lithgow, Melinda Dillon, Don Ameche, David Suchet, Margaret Langrick, Joshua Rudoy, Lainie Kazan, Kevin Peter Hall, M. Emmet Walsh, William Dear, Laurie O'Brien, John Bloom, Rick Baker, Fred Newman, Tom Hester, Tim Lawrence, Mitch Laue || Fantasy, Comedy || Live action", "* Harry and the Hendersons, directed by William Dear, starring John Lithgow, Melinda Dillon, Don Ameche, David Suchet, Margaret Langrick, Joshua Rudoy, Lainie Kazan, and Kevin Peter Hall"]}, {"page": "1986 in film", "response": ["| Iron Eagle || TriStar Pictures || Sidney J. Furie (director/screenplay); Kevin Elders (screenplay); Louis Gossett Jr., Jason Gedrick, David Suchet, Larry B. Scott, Caroline Lagerfelt, Tim Thomerson, Shawnee Smith, Melora Hardin, Lance LeGault, Robert Jayne, Jerry Levine, Robbie Rist, Michael Bowen, David Greenlee, Tom Fridley, Rob Garrison || Action || Live action"]}, {"page": "1985 in film", "response": ["| The Falcon and the Snowman || Orion Pictures || John Schlesinger (director); Steven Zaillian (screenplay); Timothy Hutton, Sean Penn, Pat Hingle, Joyce Van Patten, Richard Dysart, Priscilla Pointer, Chris Makepeace, Dorian Harewood, Macon McCalman, Nicholas Pryor, Jerry Hardin, Lori Singer, David Suchet, Boris Leskin || Spy, Drama || Live action", "| Mussolini: The Untold Story || NBC Productions || William A. Graham (director); Stirling Silliphant (screenplay); George C. Scott, David Suchet, Lee Grant, Mary Elizabeth Mastrantonio, Raúl Juliá, Tracy-Louise Ward, Virginia Madsen, Robert Downey Jr., Gabriel Byrne, Kenneth Colley, Gunnar Moller, Gina Bellman, Godfrey James, Michael Aldridge, George Coulouris, Vernon Dobtcheff, Constantine Gregory, Paul Herzberg, Wolf Kahler, Anne-Louise Lambert, Annabel Leventon, Philip Madoc, Tony Vogel, Milton Johns, Richard Kane, Michael MacKenzie, Stephen Marshall, Paul Kehagias, Spencer Chandler || Drama || Live action"]}, {"page": "1984 in film", "response": ["| Greystoke: The Legend of Tarzan, Lord of the Apes || Warner Bros. || Hugh Hudson (director); P.H. Vazak, Michael Austin (screenplay); Ralph Richardson, Ian Holm, James Fox, Christopher Lambert, Andie MacDowell, Cheryl Campbell, Paul Geoffrey, Ian Charleson, Nigel Davenport, Nicholas Farrell, Richard Griffiths, Hilton McRae, David Suchet, John Wells, Paul Brooke, Ailsa Berk, Mak Wilson, Emil Abossolo-Mbo, Deep Roy, Tali McGregor, Peter Kyriakou, Danny Potts, Eric Langlois, Peter Elliott, John Alexander, Christopher Beck || Adventure || Live action", "| The Little Drummer Girl || Warner Bros. || George Roy Hill (director); John le Carré, Loring Mandel (screenplay); Diane Keaton, Yorgo Voyagis, Klaus Kinski, Sami Frey, Michael Cristofer, Eli Danker, Ben Levine, Jonathan Sagall, Shlomit Hagoel, Juliano Mer, Sabi Dorr, Doron Nesher, Smadar Brener, Shoshi Marciano, Philipp Moog, Bill Nighy, David Suchet, John le Carré || Spy || Live action"]}, {"page": "1983 in film", "response": ["| Trenchcoat || Buena Vista Distribution || Michael Tuchner (director); Jeffrey Price, Peter S. Seaman (screenplay); Margot Kidder, Robert Hays, David Suchet, Gila von Weitershausen, Ronald Lacey, John Justin, Leopoldo Trieste, Jennifer Darling, Kevork Malikyan, Vic Tablian, Daniel Faraldo || Action, Comedy || Live action"]}, {"page": "Orient Express", "response": ["* The series Agatha Christie's Poirot, which adapted the entirety of Christie's works featuring Hercule Poirot as played by David Suchet, included an adaptation of Murder on the Orient Express as part of its 2010 episodes."]}]}}