{"wiki_id": "http://www.wikidata.org/entity/Q21176673", "itemLabel": "Cyril Campion", "itemDescription": "British playwright and screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Cyril_Campion", "wikipedia_page": {"main": "Cyril Theron Campion (1894–1961) was an English playwright and screenwriter. He was the father of the actor Gerald Campion.", "link_mentions": [{"page": "Debt of Honour", "response": ["Debt of Honour is a 1936 British drama film directed by Norman Walker and starring Leslie Banks, Will Fyffe, Geraldine Fitzgerald and Garry Marsh. Based on a story by Sapper, and scripted by Tom Geraghty and Cyril Campion, the film is also known as The Man Who Could Not Forget.Debt of Honour (1936), BFI."]}, {"page": "Ralph Smart", "response": ["* Feature film (co-written with Cyril Campion, Jack Davis Jr., Marriott Edgar and Val Guest, 1938)"]}, {"page": "The Admiral's Secret", "response": ["The Admiral's Secret is a 1934 British comedy film directed by Guy Newall and starring Edmund Gwenn, James Raglan and Dorothy Black. It was based on a play by Cyril Campion and filmed at Twickenham Studios.Wood p.81 The film's sets were designed by James Carter. A quota quickie, it was released by the American company RKO Pictures."]}, {"page": "The Four Masked Men", "response": ["The Four Masked Men is a 1934 British crime film directed by George Pearson and starring John Stuart, Judy Kelly and Richard Cooper.The Four Masked Men (1934) at IMDb It was adapted by Cyril Campion from his play, \"The Masqueraders.\" Its plot concerns a man who hunts down the criminal gang responsible for several robberies and the murder of his brother.Four Masked Men (1934) at British Film Institute website"]}, {"page": "Ask Beccles", "response": ["Ask Beccles is a 1933 British comedy crime film directed by Redd Davis and starring Garry Marsh, Lilian Oldland, Abraham Sofaer and John Turnbull. The film was based on a play by Cyril Campion. It was made at Elstree Studios as a quota quickie for release by Paramount Pictures.Wood p.77"]}, {"page": "The Lash (1934 film)", "response": ["The Lash is a 1934 British drama film directed by Henry Edwards and starring Lyn Harding, John Mills and Leslie Perrins.BFI.org It was based on a play of the same name by Cyril Campion. A brutish millionaire horsewhips his dissolute son. The film was made as a quota quickie by Twickenham Studios, one of the largest producers of Quota films."]}, {"page": "Watch Beverly", "response": ["Watch Beverley is a 1932 British comedy film directed by Arthur Maude and starring Henry Kendall, Dorothy Bartlam and Francis X. Bushman. It was adapted from a play by Cyril Campion."]}]}}