{"wiki_id": "http://www.wikidata.org/entity/Q21165077", "itemLabel": "Paul Gordon Jarvis", "itemDescription": "Leading ecologist and Professor of Forestry and Natural Resources at the University of Edinburgh from 1975 to 2001", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Gordon_Jarvis", "wikipedia_page": {"main": "Paul Gordon Jarvis (1935 - 2013)  was a leading ecologist and Professor of Forestry and Natural Resources at the University of Edinburgh from 1975 to 2001.", "link_mentions": [{"page": "Howard Griffiths (scientist)", "response": ["He is the author, co-author or editor of several textbooks and monographs, including The Carbon Balance of Forest Biomes with Paul Gordon Jarvis."]}, {"page": "List of fellows of the Royal Society J, K, L", "response": ["| Paul Gordon Jarvis||15 May 1997||23 May 1935 – 5 February 2013"]}, {"page": "Botanical Society of Scotland", "response": ["* Paul Gordon Jarvis FRS, plant ecologist, Professor of Forestry and Natural Resources at the University of Edinburgh "]}, {"page": "Deaths in February 2013", "response": ["*Paul Gordon Jarvis, 77, British ecologist.[Mencuccini, M (2013). \"Paul Jarvis, FRS, FRSE: Plant ecologist who showed the link between forests and the atmosphere\". IForest - Biogeosciences and Forestry. 6 (2): 100–101. doi:10.3832/ifor0102-006.]"]}, {"page": "List of fellows of the Royal Society elected in 1997", "response": ["*Paul Gordon Jarvis  (1935-2013) "]}, {"page": "David Beerling", "response": ["Beerling is interested in the history of science and publishes occasional scholarly articles on this theme. These have included an invited commentary entitled 'Gas valves, forests and global change: a commentary on Paul Gordon Jarvis classic 1976 paper written to celebrate the 350th anniversary of the journal Philosophical Transactions of the Royal Society, and the discovery that Isaac Newton's interest in botany extended to thinking about how water moves from roots to leaves and into the atmosphere over 200 years before botanists got round to explaining it. His discovery was widely reported including in Scientific American and Science which coined the memorable 'Newton was no sap' strap line. In 2010, he wrote a piece for Nature discussing theoretical analyses revealing how plant investment in the architecture of leaf veins can be shuffled for different conditions, minimising the construction costs associated with supplying water to leaves. He placed these findings in the context of the pioneering English plant physiologist Stephen Hales's book Vegetable Staticks published in 1727. Hales observed that plants lose water by \"perspiration\" and then went one better by conducting experiments to quantify the process."]}, {"page": "Plant, Cell & Environment", "response": ["The journal was established in 1978 by editor-in-chief Harry Smith (University of Nottingham), together with Paul Gordon Jarvis (University of Aberdeen), David Jennings (University of Liverpool), John Raven (University of Dundee), and Bob Campbell (Blackwell Scientific)."]}]}}