{"wiki_id": "http://www.wikidata.org/entity/Q21183067", "itemLabel": "Joseph Phillips", "itemDescription": "English cricketer (1881-1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Phillips_(English_cricketer)", "wikipedia_page": {"main": "Joseph Herbert Phillips (2 December 1881 – 15 January 1951) was an English cricketer active in first-class cricket from 1904–1911. He played as a right-handed batsman and right-arm fast bowler.\nThe son of  William Garside Phillips, the founder of the Ansley Hall Coal and Iron Company, he was born at Ansley Hall in the Warwickshire village of Ansley on 2 December 1881. Phillips made his debut in first-class cricket for Warwickshire against London County in 1904 at Coventry. He had to wait until 1910 for his next first-class match, which came when Warwickshire played Northamptonshire in the County Championship. He made three further appearances in 1910, before playing a final first-class match in 1911 against Leicestershire. He had little success as a first-class cricketer, scoring 35 runs across his six matches, with a high score of 16. With the ball in hand he took just one wicket from a total of 41 overs bowled.Outside of cricket Phillips was by profession a mining engineer. He married Dorothea Mary Land in 1912, with the couple having two sons; their eldest son, Joseph Anthony Moore Phillips, became a lieutenant colonel in the British Army and later became the Deputy Lieutenant of the now defunct county of Humberside, while their youngest son, Peter William Garside Phillips became a major in the army. Both became highly decorated officers. Peter's son, Mark Phillips, became a successful Olympic gold-medal-winning horseman for Great Britain, and married Anne, Princess Royal, with whom he had two children, Peter Phillips and Zara Phillips. He died at Oldbury Grange in Nuneaton, Warwickshire on 15 January 1951.", "link_mentions": [{"page": "Joseph Phillips", "response": ["Joseph Phillips may refer to:", "*Joseph Phillips (Australian cricketer) (1840–1901), Australian cricketer", "*Joseph Phillips (Barbadian cricketer) (1891-1958), Barbadian cricketer", "*Joseph Phillips (English cricketer) (1881–1951), English cricketer", "*Joseph Phillips (field hockey) (1911–1986), Indian Olympic field hockey player", "*Joseph Phillips (rugby league) (1924–1969), New Zealand rugby league and rugby union player", "*Joseph Phillips (judge), American jurist and politician", "*Joseph Phillips (Wisconsin politician) (1825–1906), mayor of Milwaukee, Wisconsin"]}, {"page": "List of Warwickshire County Cricket Club players", "response": ["* Joseph Phillips (1904–1911) : J. H. Phillips (6)"]}, {"page": "Joseph Phillips (cricketer, born 1881)", "response": ["#REDIRECT Joseph Phillips (English cricketer)"]}]}}