{"wiki_id": "http://www.wikidata.org/entity/Q212738", "itemLabel": "Geoff Hurst", "itemDescription": "English footballer (born 1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Geoff_Hurst", "wikipedia_page": {"main": "Sir Geoffrey Charles Hurst  (born 8 December 1941) is an English former professional footballer. A striker, he remains the only man to score a hat-trick in a World Cup final, when England recorded a 4–2 victory over West Germany at Wembley Stadium in 1966.\nHurst began his career with West Ham United, where he scored 242 goals in 500 first team appearances. There he won the FA Cup in 1964 and the European Cup Winners' Cup in 1965. He was sold to Stoke City in 1972 for £80,000. After three seasons with Stoke he finished his Football League career with West Bromwich Albion in 1976. Hurst went to play football in Ireland (Cork Celtic) and the USA (Seattle Sounders) before returning to England to manage non-league Telford United. He also coached in the England set-up before a two-year stint as Chelsea manager from 1979 to 1981. He later coached Kuwait SC before leaving the game to concentrate on his business commitments.\nIn total he scored 24 goals in 49 England appearances, and as well as success in the 1966 World Cup he also appeared at UEFA Euro 1968 and the 1970 FIFA World Cup. He also had a brief cricket career, making one first-class appearance for Essex in 1962, before concentrating on football.", "link_mentions": [{"page": "Bobby Charlton", "response": ["Charlton opened the scoring with a crisp side-footed finish after a run by Roger Hunt had forced the Portuguese goalkeeper out of his net; his second was a sweetly struck shot after a run and pull-back from Geoff Hurst. Charlton and Hunt were now England's joint-highest scorers in the tournament with three each, and a final against West Germany beckoned.", "England reached the last eight where they again faced West Germany. Charlton controlled the midfield and suppressed Franz Beckenbauer's runs from deep. England took a 2–0 lead in the 50th minute after goals from Alan Mullery and Martin Peters. In the 69th minute, Beckenbauer pulled a goal back for the Germans and Ramsey soon replaced Charlton with Colin Bell, who further tested the German goalkeeper Sepp Maier and also provided a cross for Geoff Hurst, who missed a chance to score. West Germany, who had a habit of coming back from behind, eventually scored twice – a back header from Uwe Seeler made it 2–2. In extra-time, Geoff Hurst had a goal mysteriously ruled outEngland: The Official F.A History, Niall Edworthy, Virgin Publishers, 1997, . p. 101 after which Gerd Müller's goal won the match 3–2. England were out and, after a record 106 caps and 49 goals, Charlton decided to end his international career at the age of 32. On the flight home from Mexico, he asked Ramsey not to consider him again. His brother Jack, two years his senior but 71 caps his junior, did likewise."]}, {"page": "Rhyming slang", "response": ["In the British undergraduate degree classification system a first class honours degree is known as a Geoff Hurst (First) after the English 1966 World Cup footballer. An upper second class degree is called an Attila the Hun (two-one) and a lower second class as a Desmond Tutu (two-two) while a third class degree is known as a Thora Hird."]}, {"page": "December 8", "response": ["*  1941   – Geoff Hurst, English footballer and manager"]}, {"page": "England", "response": ["Football is the most popular of these sports. The England national football team, whose home venue is Wembley Stadium, played Scotland in the first ever international football match in 1872. Referred to as the \"home of football\" by FIFA, England hosted the 1966 FIFA World Cup, and won the tournament by defeating West Germany 4–2 in the final, with Geoff Hurst scoring a hat-trick.\"Hurst the hero for England in the home of football\". FIFA.com. Retrieved 15 January 2015 With a British television audience peak of 32.30 million viewers, the final is the most watched television event ever in the UK.\"Tracking 30 years of TV's most watched programmes\". BBC. Retrieved 25 June 2015"]}, {"page": "England national football team", "response": ["Although Walter Winterbottom was appointed as England's first full-time manager in 1946, the team was still picked by a committee until Alf Ramsey took over in 1963. The 1966 FIFA World Cup was hosted in England and Ramsey guided England to victory with a 4–2 win against West Germany after extra time in the final, during which Geoff Hurst scored a hat-trick. In UEFA Euro 1968, the team reached the semi-finals for the first time, being eliminated by Yugoslavia."]}, {"page": "Gordon Banks", "response": ["Despite another mid-table finish in 1971–72, Stoke beat Chesterfield, Tranmere Rovers, Hull City and Manchester United to reach another FA Cup semi-final. They again faced Arsenal, and once more a draw at Villa Park meant a replay at Goodison Park. The Gunners' goals in a 2–1 victory came from a disputed Frank McLintock penalty and a John Radford goal that television replays showed was clearly offside. In a May 2011 interview, Banks said that he still felt \"cheated\" out of a chance to play for the club in an FA Cup final. Stoke and Banks found solace in the League Cup, though it took them 11 matches to reach the final after overcoming Southport, then Oxford United in a replay, Manchester United in a second replay, Bristol Rovers, and then West Ham United in a second replay following an aggregate draw after two legs. In extra-time of the second leg with West Ham, Banks fouled Harry Redknapp, conceding a penalty, and then saved Geoff Hurst's powerful spot-kick to keep City in the competition. They then faced Chelsea in the final at Wembley. Peter Osgood beat Banks with a hooked shot just before half-time, but goals from Terry Conroy and George Eastham won Stoke the game 2–1. At the end of the season Banks was named as the FWA Footballer of the Year, becoming the first goalkeeper to receive the honour since Bert Trautmann in 1956.", "England beat Argentina 1–0 in the last eight, with Geoff Hurst scoring with a header; the match was sullied by the first-half sending off of Argentinian midfielder Antonio Rattín, who refused to leave the pitch after being dismissed for dissent. In contrast to the previous games, the semi-final against Portugal proved to be a fair contest between two sides of talented players eager to attack from the start of the match. Yet there was panic in the buildup to the game as trainer Harold Shepherdson forgot to buy chewing gum, which Banks used to make his hands stickier and better able to handle the ball, and so Shepherdson had to run to a nearby newsagents to purchase gum as the teams were in the tunnel. Bobby Charlton scored two goals, but Portugal made a strong finish and won a penalty on 82 minutes after Jack Charlton handled the ball in the penalty area. Eusébio converted the penalty after sending Banks the wrong way, and the game finished 2–1 in England's favour. This was the first goal Banks had conceded for England in 721 minutes of regular play, since giving up Scotland's last goal after 81 minutes of the Home International clash in April. This remained a record for an England goalkeeper until 2021 when it was broken by Jordan Pickford.", "England's opponents in the final were West Germany. It was England who dominated the final but it was Banks who was beaten first. A weak header from Ray Wilson handed a chance to Helmut Haller, who sent an accurate but relatively weak shot into the corner of the net; Banks had been unsighted by Jack Charlton, and he failed to adjust his position in time to reach the ball. England equalised through a Geoff Hurst header within six minutes and went ahead late in the second half through Martin Peters. With seconds left in the game, Lothar Emmerich sent a free kick into the England penalty area, and the ball fell to Wolfgang Weber, who guided the ball over a lunging Ray Wilson and an outstretched Banks into the net to take the game into extra-time. In extra-time, the Germans sent shots in at the England goal which Banks managed to catch and control without any great danger. Hurst scored two goals to complete his hat-trick, and though many claimed his second goal never crossed the line Banks always maintained his belief that the officials called the decision correctly. Between these goals Banks had to deal with a fiery shot from Sigfried Held, and was later exposed only for Uwe Seeler to come just centimetres away from connecting with the ball.", "Banks went into the 1970 World Cup as England's number one with 59 caps to his name, and had Peter Bonetti (six caps) and Alex Stepney (one cap) as his understudies. He found the heat and altitude at Guadalajara, Mexico difficult to cope with. The team's efforts at acclimatisation were not helped when Bobby Moore was falsely accused of stealing the infamous \"Bogotá Bracelet\". Despite this, a Geoff Hurst goal was enough to beat their first opponents, Romania. A far tougher test awaited on 7 June, when England faced Brazil. The day before the match Banks was informed that he had been awarded an OBE."]}, {"page": "Pelé", "response": ["* Most goals in FIFA World Cup Final matches: 3 (2 in 1958 and 1 in 1970) (shared with Vavá, Geoff Hurst and Zinedine Zidane)"]}, {"page": "Wallace and Gromit", "response": ["In the Cracking Contraptions episode \"The Soccamatic\", Wallace says to Gromit, \"How do you like my Preston North End soccamatic, Gromit?\". The episode references famous English footballers of the 1950s and '60s, including Nobby Stiles, Tom Finney and Bill Shankly (all of whom played for Preston in their careers) as well as Geoff Hurst and Stanley Matthews."]}, {"page": "West Bromwich Albion F.C.", "response": ["Other notable honours bestowed upon West Brom players include the PFA Young Player of the Year award, which was presented to Cyrille Regis in 1979. In 1998, Billy Bassett and Bryan Robson were named among the list of Football League 100 Legends, along with Arthur Rowley, Geoff Hurst and Johnny Giles. Bryan Robson was also an inaugural inductee into the English Football Hall of Fame in 2002, to be joined two years later by Geoff Hurst. Bobby Robson, a player with Albion, has also been inducted, although this was for his achievements as a manager. In 1919–20, Fred Morris became the first Albion player to finish as top goalscorer in Division One, a feat which has since been repeated by Ronnie Allen, Derek Kevan, Jeff Astle and Tony Brown. Brown, who holds the club records for goals and appearances, was voted into the PFA Centenary Hall of Fame in July 2007."]}, {"page": "1960s", "response": ["* Geoff Hurst"]}, {"page": "1941", "response": ["* December 8 – Geoff Hurst, English footballer"]}, {"page": "1966 FIFA World Cup Final", "response": ["The match is remembered for England's only World Cup and major international title, Geoff Hurst's hat-trick – the first and (as of 2021) only one ever scored in a FIFA World Cup final – and the controversial third goal awarded to England by referee Gottfried Dienst and linesman Tofiq Bahramov. The England team became known as the \"wingless wonders\", on account of their then-unconventional narrow attacking formation, described at the time as a 4–4–2.", "In the 18th minute, Wolfgang Overath conceded a free kick, which Moore took immediately, floating a cross into the West German area, where Geoff Hurst rose unchallenged; his downward glancing header went into the net and levelled the scores at 1-1. The teams were level at half-time, and after 77 minutes England won a corner. Alan Ball delivered the ball to Geoff Hurst whose deflected shot from the edge of the area found Martin Peters. He produced the final shot, beating the West German keeper from eight yards to make the score 2–1 to England.", "England pressed forward and created several chances. In particular, with five minutes gone, Bobby Charlton struck the post and sent another shot just wide. With 11 minutes of extra time gone, Alan Ball put in a cross and Geoff Hurst swivelled and shot from close range. The ball hit the underside of the crossbar, bounced down and was cleared. The referee Gottfried Dienst was uncertain if it had been a goal and consulted his linesman, Tofiq Bahramov from Azerbaijan in the USSR, who indicated that it was, and the Swiss referee awarded the goal to the home team. The crowd and the audience of 400 million television viewers were left arguing whether the goal should have been given or not. The crossbar is now on display in the Wembley Stadium. ", "One minute before the end of play, the West Germans sent their defenders forward in a desperate attempt to score a last-minute equaliser. Winning the ball, Bobby Moore picked out the unmarked Geoff Hurst with a long pass, which Hurst carried forward while some spectators began streaming onto the field and Hurst, as he later revealed, tried to shoot the ball as far into the Wembley stands as he could, to waste time. He mishit that attempt, but the mishit went straight to the top corner of Hans Tilkowski's net, sealing a historic hattrick and winning the World Cup for England. The goal gave rise to one of the most famous calls in English football history, when BBC commentator Kenneth Wolstenholme described the situation as follows:", "|CF ||10||Geoff Hurst", "One of the enduring images of the celebrations in Wembley immediately after the game was the picture of the captain Bobby Moore holding the Jules Rimet Trophy aloft, on the shoulders of Geoff Hurst and Ray Wilson, together with Martin Peters. In recognition of Moore and other West Ham United players' contribution to the win, the club and Newham Borough Council jointly commissioned a statue of this scene. On 28 April 2003 Prince Andrew as president of The Football Association, duly unveiled the World Cup Sculpture (also called The Champions) in a prominent place near West Ham's ground, at the time, the Boleyn Ground, at the junction of Barking Road and Green Street. The -high bronze piece was sculpted by Philip Jackson and weighed 4 tonnes."]}, {"page": "Kenneth Wolstenholme", "response": ["Kenneth Wolstenholme, DFC & Bar (17 July 1920 – 25 March 2002) was an English football commentator for BBC television in the 1950s and 1960s. He is best remembered for his commentary during the 1966 FIFA World Cup Final; in the closing minutes, Wolstenholme commented on a series of pitch invaders as Geoff Hurst dribbled down the pitch before scoring, saying \"some people are on the pitch, they think it's all over!\" The phrase has become deeply embedded in British popular culture.", "Wolstenholme's unscripted delivery in the closing moments of the 1966 FIFA World Cup Final at Wembley Stadium included fourteen words that are among the best known in British sport commentary. With England leading 3–2 against West Germany, a small pitch invasion took place during injury time just as Geoff Hurst scored to put England 4–2 ahead. The events prompted Wolstenholme to say:"]}, {"page": "West Ham United F.C.", "response": ["Three West Ham players were members of the 1966 World Cup final-winning England team: captain Bobby Moore and goalscorers Geoff Hurst and Martin Peters. The club has a long-standing rivalry with Millwall, and the fixture between the two teams has gained notoriety for frequent incidents of football hooliganism. West Ham adopted their claret and sky blue colour scheme in the early 1900s, with the most common iteration of a claret shirt and sky blue sleeves first emerging in 1904.", "Ron Greenwood was appointed as Fenton's successor in 1961 and soon led the club to two major trophies, winning the 1964 FA Cup Final. The team was led by the young Bobby Moore. West Ham also won the European Cup Winners' Cup. During the 1966 FIFA World Cup, key members of the tournament winners England were West Ham players, including the captain, Bobby Moore; Martin Peters (who scored in the final); and Geoff Hurst, who scored the first, and only, hat-trick in a men's World Cup final. All three players had come through the youth team at West Ham. 200px|thumb|right|Champions statue on Barking Road", "There is a \"Champions\" statue in Barking Road, opposite The Boleyn Tavern, commemorating West Ham's \"three sons\" who helped win the 1966 World Cup: Bobby Moore, Geoff Hurst and Martin Peters. Also included on the statue is Everton's Ray Wilson.", "The club promotes the popular idea of West Ham being \"The Academy of Football\", with the moniker adorning the ground's new stadium façade. The comment predominantly refers to the club's youth development system which was established by manager Ted Fenton during the 1950s, that has seen a number of international players emerge through the ranks. Most notably, the club contributed three players to the World Cup-winning England side of 1966, including club icon Bobby Moore, as well as Martin Peters and Geoff Hurst who between them scored all of England's goals in the eventual 4–2 victory. Other academy players that have gone on to play for England have included Trevor Brooking, Alvin Martin, Tony Cottee and Paul Ince.", "|1966|| Geoff Hurst|| Martin Peters", "|1967|| Geoff Hurst|| Bobby Moore", "|1969|| Geoff Hurst|| Billy Bonds", "On 3 May 2016, it was announced via the club's official website that the fourth recipient of the award would be Sir Geoff Hurst, the club's second all-time leading goalscorer, and scorer of a hat-trick in the 1966 World Cup Final. Hurst would be honoured at the club's 2015/16 Player Awards Ceremony. Ken Brown became the sixth recipient of the award, in April 2018. The 2019 honour was awarded to midfielder Ronnie Boyce who made his debut for West Ham in 1960.", "|2016|| Geoff Hurst", "** Geoff Hurst (6) v Sunderland (h) 19 October 1968", "# 502 Geoff Hurst (1959–72)", "# 252 Geoff Hurst (1959–72)"]}, {"page": "1966 FIFA World Cup", "response": ["The 1966 FIFA World Cup was the eighth FIFA World Cup, a quadrennial football tournament for men's senior national teams. It was played in England from 11 July to 30 July 1966. England defeated West Germany 4–2 in the final to win their first and so far only ever title; the match had finished at 2–2 after 90 minutes and went to extra time, when Geoff Hurst scored two goals to complete his hat-trick, the first (and , only) to be scored in a World Cup final, with a handful of spectators wandering on to the pitch during the fourth goal. England were the fifth nation to win the event, and the third host nation to win after Uruguay in 1930 and Italy in 1934. Brazil were the defending champions, but they failed to progress from the group stage.", "Meanwhile, in the other two games, Ferenc Bene's late goal for Hungary against the Soviet Union, who were led by Lev Yashin's stellar goalkeeping, proved little more than a consolation as they crashed out 2–1, and the only goal between Argentina and England came courtesy of England's Geoff Hurst. During that controversial game (for more details see Argentina and England football rivalry), Argentina's Antonio Rattín became the first player to be sent off in a senior international football match at Wembley. Rattín at first refused to leave the field and eventually had to be escorted by several policemen. After 30 minutes England scored the only goal of the match. This game is called el robo del siglo (the robbery of the century) in Argentina.", "London's Wembley Stadium was the venue for the final, and 98,000 people attended. After 12 minutes 32 seconds Helmut Haller put West Germany ahead, but the score was levelled by Geoff Hurst four minutes later. Martin Peters put England in the lead in the 78th minute; England looked set to claim the title when the referee awarded a free kick to West Germany with one minute left. The ball was launched goalward and Wolfgang Weber scored, with England appealing in vain for handball as the ball came through the crowded penalty area.", "With the score level at 2–2 at the end of 90 minutes, the game went to extra time. In the 98th minute, Hurst found himself on the scoresheet again; his shot hit the crossbar, bounced down onto the goal line, and was awarded as a goal. Debate has long raged over whether the ball crossed the line, with the goal becoming part of World Cup history. England's final goal was scored by Hurst again, as a celebratory pitch invasion began. This made Geoff Hurst the only player ever to have scored three times in a single World Cup final. BBC commentator Kenneth Wolstenholme's description of the match's closing moments has gone down in history: \"Some people are on the pitch. They think it's all over ... [Hurst scores] It is now!\"", "* Geoff Hurst", " Geoff Hurst"]}, {"page": "Zinedine Zidane", "response": ["Having already announced he was to retire after the expiration of his Real Madrid contract at the end of the 2005–06 season, the world of football already knew Zidane's second World Cup final was to be the last match of his career. Seven minutes into the 2006 World Cup final in Berlin, Zidane put France ahead with a Panenka-style penalty kick which struck the crossbar and bounced just over the goal line to become only the fourth player in World Cup history to score in two different finals, along with Pelé, Paul Breitner, and Vavá, in addition to being tied for first place with Vavá, Pelé and Geoff Hurst with three World Cup final goals apiece. He almost scored a second goal during the first period of extra time but his header was saved by Italy's goalkeeper Gianluigi Buffon. Zidane was then sent off in the 110th minute of the game after headbutting Marco Materazzi in the chest, so he did not participate in the penalty shootout which Italy won 5–3. This marked the 14th overall expulsion of Zidane's career, and joined him with Cameroon's Rigobert Song as the only players ever to be sent off during two separate World Cup tournaments. He also became the fourth player red-carded in a World Cup final, in addition to being the first sent off in extra time. Zidane's actions made headlines all over the world, while in France Le Figaro called his head-butt \"odious,\" and the front page of L'Equipe asked, \"What should we tell our children, for whom you have become an example for ever? ... How could that happen to a man like you?\" Zidane had received plaudits for his performances during the tournament, with Pep Guardiola writing he exerts so much influence on the team that \"France are never disorganised\". The day after the final, Zidane was awarded the Golden Ball as the player of the tournament.", "* Most goals scored in FIFA World Cup Final matches: 3 goals (shared with Pelé, Vavá and Geoff Hurst)"]}, {"page": "Kenneth Clarke", "response": ["He attended the 1966 FIFA World Cup Final and jokingly claims to have been influential in persuading the linesman, Tofiq Bahramov, to award a goal to Geoff Hurst when the England striker had seen his shot hit the crossbar of opponents West Germany, leaving doubt as to whether the ball had crossed the line. Clarke's position in the Wembley crowd was right behind the linesman at the time, and he shouted at the official to award a goal."]}, {"page": "1970 FIFA World Cup", "response": ["The all-South America tie in Guadalajara was the highest-scoring of the four quarter-finals as Brazil recorded a 4–2 triumph over Peru. The match is considered to be one of the most entertaining matches in World Cup history: Brazil shot 27 times; Peru, 22. Next came a rematch of the previous World Cup final between England and West Germany took place in León. The reigning champions took a two-goal lead, but Franz Beckenbauer halved the deficit when his low shot beat England's second-choice goalkeeper Peter Bonetti, who was playing after Gordon Banks suffered food poisoning the day before. Eight minutes from time, an Uwe Seeler header levelled the score. England's Geoff Hurst then had an apparently legitimate goal ruled out for offside.England: The Official F.A History, Niall Edworthy, Virgin Publishers, 1997, . An extra-time goal from Gerd Müller brought (West) Germany's first-ever competitive victory over England. It has been speculated1970: Heath's surprise victory BBC News that the national embarrassment of losing against Germany played a significant role in the surprise defeat of Harold Wilson's government in the 1970 United Kingdom general election four days later, however recent analysis found no evidence to support this theory.", "*  Geoff Hurst"]}, {"page": "Jack Charlton", "response": ["West Germany awaited in the final at Wembley, and they took the lead through Helmut Haller on 12 minutes; Charlton felt that he could have blocked the shot but at the time he believed that Banks had it covered, though it was Wilson who was at fault for allowing Haller the chance to shoot. England came back and took the lead, but with only a few minutes left in the game Charlton gave away a free kick after fouling Uwe Seeler whilst competing for an aerial ball; Wolfgang Weber scored the equalising goal from a goalmouth scramble created from the free kick. Geoff Hurst scored two goals in extra-time to win the game 4–2."]}, {"page": "Denton, Greater Manchester", "response": ["*Sir Geoff Hurst: the West Ham United and England 1966 World Cup footballer lived in Denton until he was 8 years old. His grandfather lived on Cemetery Road until his death."]}]}}