{"wiki_id": "http://www.wikidata.org/entity/Q212873", "itemLabel": "Jane Birkin", "itemDescription": "English-French singer and actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_Birkin", "wikipedia_page": {"main": "Jane Mallory Birkin, OBE (born 14 December 1946) is a British singer, songwriter, actress and former model. She attained international fame and notability for her decade-long musical and romantic partnership with Serge Gainsbourg. She also had a prolific career as an actress in British and French cinema.\nA native of London, Birkin began her career as an actress, appearing in minor roles in Michelangelo Antonioni's Blowup (1966), and Kaleidoscope (1966). In 1968, she met Serge Gainsbourg while co-starring with him in Slogan, which marked the beginning of a years-long working and personal relationship. The duo released their debut album Jane Birkin/Serge Gainsbourg (1969), and Birkin also appeared in the controversial film Je t'aime moi non plus (1976) under Gainsbourg's direction. Birkin would attain further acting credits in the Agatha Christie adaptations Death on the Nile (1978), and Evil Under the Sun (1982).\nAfter separating from Gainsbourg in 1980, Birkin continued to work as both an actress and a singer, appearing in various independent films and recording numerous solo albums. In 1991, she appeared in the miniseries Red Fox, and in the American drama film A Soldier's Daughter Never Cries, in 1998. In 2016, she starred in the Academy Award-nominated short film La femme et le TGV, which she said would be her final film role.\nBirkin has lived mainly in France since the 1970s. She is the mother of photographer Kate Barry, with her first husband John Barry; actress and singer Charlotte Gainsbourg, with Serge Gainsbourg; and musician Lou Doillon, with Jacques Doillon. In addition to her acting and musical credits, she lent her name to the Hermès Birkin handbag.", "link_mentions": [{"page": "Brigitte Bardot", "response": ["She participated in several musical shows and recorded many popular songs in the 1960s and 1970s, mostly in collaboration with Serge Gainsbourg, Bob Zagury and Sacha Distel, including \"Harley Davidson\"; \"Je Me Donne À Qui Me Plaît\"; \"Bubble gum\"; \"Contact\"; \"Je Reviendrai Toujours Vers Toi\"; \"L'Appareil À Sous\"; \"La Madrague\"; \"On Déménage\"; \"Sidonie\"; \"Tu Veux, Ou Tu Veux Pas?\"; \"Le Soleil De Ma Vie\" (the cover of Stevie Wonder's \"You Are the Sunshine of My Life\"); and \"Je t'aime... moi non-plus\". Bardot pleaded with Gainsbourg not to release this duet and he complied with her wishes; the following year, he rerecorded a version with British-born model and actress Jane Birkin that became a massive hit all over Europe. The version with Bardot was issued in 1986 and became a popular download hit in 2006 when Universal Music made its back catalogue available to purchase online, with this version of the song ranking as the third most popular download."]}, {"page": "December 14", "response": ["*  1946   – Jane Birkin, English-French actress and singer"]}, {"page": "Janis Joplin", "response": ["The Mamas & the Papas' song \"Pearl\" (1971), from their People Like Us album, was a tribute. Leonard Cohen's song \"Chelsea Hotel#2\" (1974) is about Joplin. Lyricist Robert Hunter has commented that Jerry Garcia's \"Birdsong\" from his first solo album, Garcia (1972), is about Joplin and the end of her suffering through death. Mimi Farina's composition \"In the Quiet Morning\", most famously covered by Joan Baez on her Come from the Shadows (1972) album, was a tribute to Joplin.Performed by Joan Baez in her 1972 album Come from the Shadows. Baez wrote the song \"Blessed Are ... ,\" from her 1971 album of the same name, as a tribute to Joplin. Another song by Baez, \"Children of the Eighties,\" mentioned Joplin. A Serge Gainsbourg-penned French language song by English singer Jane Birkin, \"Ex fan des sixties\" (1978), references Joplin along with other disappeared \"idols\" such as Jimi Hendrix, Brian Jones and Marc Bolan. When Joplin was alive, Country Joe McDonald released a song called \"Janis\" on his band's album I-Feel-Like-I'm-Fixin'-to-Die (1967)."]}, {"page": "1946", "response": ["** Jane Birkin, English actress, singer"]}, {"page": "Egon Schiele", "response": ["Schiele was the subject of the 1980 biographical film Excess and Punishment (aka Egon Schiele – Exzess und Bestrafung), originating in Germany with a European cast that explores Schiele's artistic demons leading up to his early death. The film was directed by Herbert Vesely and stars Mathieu Carrière as Schiele, Jane Birkin as his early artistic muse Wally Neuzil, Christine Kaufman as his wife, Edith Harms, and Kristina Van Eyck as her sister, Adele Harms. Also in 1980, the Arts Council of Great Britain produced a documentary film, Schiele in Prison, which looked at the circumstances of Schiele's imprisonment and the veracity of his diary.  In 2016 another biographical film was released, Egon Schiele: Death and the Maiden (German: Egon Schiele: Tod und Mädchen)."]}, {"page": "Juliette Binoche", "response": ["Binoche and numerous other French personalities, including Isabelle Adjani, Yvan Attal, Jane Birkin, and Josiane Balasko, joined Réseau Education Sans Frontieres (RESF) on 7 January 2010 with a symbolic \"cake of solidarity\" to highlight the taxation and legitimacy issues being faced by undocumented workers in France."]}, {"page": "Frankie Howerd", "response": ["In 1971 Howerd recorded, with June Whitfield, a comedy version of the song \"Je t'aime\", previously recorded by Jane Birkin and Serge Gainsbourg, in which she featured as \"Mavis\" alongside Howerd's \"Frank\", and a third unexplained sleeping partner named \"Arthur\". The song was included in the 2004 CD re-issue of Oh! What a Carry On!."]}, {"page": "Cinderella", "response": ["*Cinderella, a British TV modernization featuring Marcella Plunkett as Cinderella, Kathleen Turner as the stepmother and Jane Birkin as the fairy godmother."]}, {"page": "Serge Gainsbourg", "response": ["Gainsbourg was disillusioned as a painter as he lacked talent but earned his living working odd jobs and as a piano player in bars, usually as a stand-in for his father. He soon became the venue pianist at the drag cabaret club Madame Arthur. Whilst filling in a form to join the songwriting society SACEM, Gainsbourg decided to change his first name to Serge, feeling that this was representative of his Jewish background and because, as his future partner Jane Birkin relates: \"Lucien reminded him of a hairdresser's assistant\". He chose Gainsbourg as his last name, in homage to the English painter Thomas Gainsborough, whom he admired. Gainsbourg had a revelation when he saw Boris Vian at the Milord l'Arsouille club whose provocative and humorous songs would influence his own compositions.L'Arc Journal (#90) special issue devoted to Boris Vian, 1984 At the Milord l'Arsouille, Gainsbourg accompanied singer and club star Michèle Arnaud on the guitar. In 1957, Arnaud and the club's director Francis Claude discovered, with amazement, the compositions of Gainsbourg while visiting his house to see his paintings. The next day, Claude pushed Gainsbourg on stage. Despite suffering from stage fright, he performed his own repertoire, including \"Le Poinçonneur des Lilas\", which describes the day in the life of a Paris Métro ticket man, whose job is to stamp holes in passengers' tickets. Gainsbourg describes this chore as so monotonous, that the man eventually thinks of putting a hole into his own head and being buried in another. He was given his own show by Claude and was eventually spotted by Jacques Canetti, who helped propel his career with a spot at the Théâtre des Trois Baudets and on his tours. In 1958, Arnaud began recording several interpretations of Gainsbourg's songs.", "In mid-1968 Gainsbourg fell in love with the younger English singer and actress Jane Birkin, whom he met during the shooting of the film Slogan (1969). In the film, Gainsbourg starred as a commercial director who has an affair on his pregnant wife with a younger woman, played by Birkin.  Gainsbourg also provided the soundtrack and dueted with Birkin on the title theme \"\"La Chanson de Slogan\". The relationship would last for over a decade. In July 1971 they had a daughter, Charlotte, who would become an actress and singer. Although many sources state that they were married, according to their daughter Charlotte this was not the case.  After filming Slogan, Gainsbourg asked Birkin to re-record \"Je t'aime...\" with him. Her vocals were an octave higher than Bardot's, contained suggestive heavy breathing and culminated in simulated orgasm sounds. Released in February 1969, the song topped the UK Singles Chart after being temporarily banned due to its overtly sexual content. It was banned from the radio in several other countries, including Spain, Sweden, Italy and France before 11pm. The song was even publicly denounced by The Vatican. It was included on the joint album Jane Birkin/Serge Gainsbourg, which also contained \"Élisa\" and new recordings of songs written by other artists including \"Les sucettes\", \"L'anamour\" and \"Sous le soleil exactement\". In 2017, Pitchfork named it the 44th best album of the 1960s.", "After a turbulent 13-year relationship, Jane Birkin left Gainsbourg. He still went on to write and produce three more albums for her: Baby Alone in Babylone (1983), Lost Song (1987), Amour des feintes (1990), with many songs being about their relationship (including \"Fuir le bonheur de peur qu'il ne se sauve\", which would be read by Catherine Deneuve during Gainsbourg's funeral in 1991).", "Yet he continued to produce albums and songs for women—typically women with a frail voice—some of them highly successful, like the aforementioned Baby Alone in Babylone (1983) and Amour des feintes (1990) for Jane Birkin, Variations sur le même t'aime (1990) for Vanessa Paradis, Pull marine (1983) for Isabelle Adjani, \"White and Black Blues\" for Joëlle Ursull (which came second at the 1990 Eurovision).", "Gainsbourg appeared in nearly 50 film and television roles. In 1960, he co-starred with Rhonda Fleming in the Italian film La rivolta degli schiavi (The Revolt of the Slaves) as Corvino, the Roman Emperor Massimiano's evil henchman. In 1968 he wrote music for and appeared as himself in Le Pacha directed by Georges Lautner. In 1969, he appeared in William Klein's pop art satire Mr. Freedom, and in the same year he co-starred alongside Jane Birkin in The Pleasure Pit as well as in Slogan, for which he wrote the title song \"La Chanson de Slogan\". Also with Birkin, he acted in the French-Yugoslav film  (19 girls and one sailor) where he played a role of a partisan. They acted together again in Cannabis the following year, and again in Seven Deaths in the Cat's Eye in 1973. He also made a brief appearance with Birkin in Herbert Vesely's 1980 film Egon Schiele – Exzess und Bestrafung.", "|1969|| Jane Birkin/Serge Gainsbourg||4||", "|\"Je t'aime... moi non plus\" (with Jane Birkin)", "|\"La Chanson de Slogan\" (with Jane Birkin)", "|\"La Décadanse\" (with Jane Birkin)", "* 1973: Di doo dah – Jane Birkin", "* 1975: Lolita Go Home – Jane Birkin (about half of the album)", "* 1978: Ex fan des sixties – Jane Birkin", "* 1983: Baby Alone in Babylone – Jane Birkin", "* 1987: Lost Song – Jane Birkin", "* 1990: Amours des feintes – Jane Birkin"]}, {"page": "June Whitfield", "response": ["In 1971, Whitfield and Frankie Howerd recorded a novelty comic version of the song \"Je t'aime\", previously recorded by Jane Birkin and Serge Gainsbourg, in which she featured as \"Mavis\"."]}, {"page": "Maggie Smith", "response": ["In 1982, she starred as Daphne Castle in the locked-room mystery film Evil Under the Sun opposite Peter Ustinov, Jane Birkin and Diana Rigg. The following year, she appeared in the film Better Late Than Never alongside David Niven and Art Carney."]}, {"page": "Nick Cave", "response": ["Cave dated Anita Lane from the late 1970s to mid-1980s. Cave and Lane recorded together on a few occasions. Their most notable collaborations include Lane's 'cameo' verse on Cave's Bob Dylan cover \"Death Is Not The End\" from the album Murder Ballads, and a cover of the Serge Gainsbourg/Jane Birkin song \"Je t'aime... moi non plus/ I love you   ... me neither\". Lane co-wrote the lyrics to the title track for Cave's 1984 LP, From Her to Eternity, as well as the lyrics of the song \"Stranger Than Kindness\" from Your Funeral, My Trial. Cave, Lydia Lunch and Lane wrote a comic book together, entitled AS-FIX-E-8, in the style of the old \"Pussy Galore\"/Russ Meyer movies."]}, {"page": "César Awards", "response": ["|Michel Drucker and Jane Birkin"]}, {"page": "Charlotte Gainsbourg", "response": ["Charlotte Lucy Gainsbourg (; born 21 July 1971) is an English-French actress and singer-songwriter. She is the daughter of English actress Jane Birkin and French singer and songwriter Serge Gainsbourg. After making her musical debut with her father on the song \"Lemon Incest\" at the age of 12, she released an album with her father at the age of 15. More than 20 years passed before she released albums as an adult (5:55, IRM, Stage Whisper and Rest) to commercial and critical success. Gainsbourg has also appeared in many films, including several directed by Lars von Trier, and has received a César Award and the Cannes Film Festival Best Actress Award.", "thumb|Gainsbourg with her mother Jane Birkin in 2010", "Gainsbourg was born on 21 July 1971 in London, to English actress and singer Jane Birkin and French actor and singer-songwriter Serge Gainsbourg.Source of real name and birth date: birth certificate provided by the French Foreign Ministry, according to lesgensducinema.com Gainsbourg was born at the height of her parents' fame; they had made headlines several years earlier with the sexually explicit song \"Je t'aime... moi non plus\" and by that point had become notorious for their turbulent relationship and multiple artistic collaborations. As a result, her birth and childhood were well publicised.", "| Jane Birkin's daughter"]}, {"page": "Cherbourg-Octeville", "response": ["*La Course à l'échalote (1975), directed by Claude Zidi, with Pierre Richard and Jane Birkin"]}, {"page": "List of one-hit wonders on the UK Singles Chart", "response": ["| Jane Birkin and Serge Gainsbourg"]}, {"page": "Dirk Bogarde", "response": ["His other later roles included decadent valet Hugo Barrett in The Servant (1963), which garnered him a BAFTA Award, directed by Joseph Losey and written by Harold Pinter; The Mind Benders (1963), a film ahead of its times in which Bogarde plays a professor conducting sensory deprivation experiments at Oxford University (precursor to Altered States (1980)); the antiwar film King & Country (1964), directed by Joseph Losey, in which he played an army officer at a court martial, reluctantly defending deserter Tom Courtenay; a television broadcaster-writer Robert Gold in Darling (1965), for which Bogarde won a second BAFTA Award, directed by John Schlesinger; Stephen, a bored Oxford University professor, in Losey's Accident, (1967) also written by Pinter; Our Mother's House (1967), an off-beat film noir and British entry at the Venice Film Festival, directed by Jack Clayton, in which Bogarde plays a ne'er-do-well father who descends upon \"his\" seven children on the death of their mother; German industrialist Frederick Bruckmann in Luchino Visconti's La Caduta degli dei, The Damned (1969) co-starring Ingrid Thulin; as ex-Nazi, Max Aldorfer, in the chilling and controversial Il Portiere di notte (or The Night Porter) (1974), co-starring Charlotte Rampling, directed by Liliana Cavani; and most notably, as Gustav von Aschenbach in Morte a Venezia, Death in Venice (1971), also directed by Visconti; as Claude, the lawyer son of a dying, drunken writer (John Gielgud) in the well-received, multidimensional French film Providence (1977), directed by Alain Resnais; as industrialist Hermann Hermann who descends into madness in Despair (1978) directed by Rainer Werner Fassbinder; and as Daddy in Bertrand Tavernier's Daddy Nostalgie, (orThese Foolish Things) (1991), co-starring Jane Birkin as his daughter, Bogarde's final film role."]}, {"page": "1969 in music", "response": ["US and UK pop music remained popular worldwide, with few European acts making the charts outside their home countries; exceptions included Jane Birkin & Serge Gainsbourg, Shocking Blue, Georges Moustaki and Christian Anders.World Charts. Accessed 19 November 2014", "| Jane Birkin/Serge Gainsbourg || Jane Birkin and Serge Gainsbourg ||-"]}, {"page": "1946 in music", "response": ["*December 14 – Jane Birkin, UK actress and singer"]}, {"page": "2000 in film", "response": ["| The Last September || Trimark Pictures / UGC DA International || Deborah Warner (director); John Banville (screenplay); Maggie Smith, Michael Gambon, Keeley Hawes, David Tennant, Lambert Wilson, Jane Birkin, Fiona Shaw, Jonathan Slinger, Richard Roxburgh, Tom Hickey, Gary Lydon, Emily Nagle, Lesley McGuire || Drama || Live action"]}, {"page": "Royal National Theatre", "response": ["* Women of Troy by Euripides, directed by Annie Castledine, starring Josette Bushell-Mingo, Rosemary Harris and Jane Birkin (1995)"]}, {"page": "Peter Ustinov", "response": ["He spoke English, French, Spanish, Italian, German, and Russian fluently, as well as some Turkish and modern Greek. He was proficient in accents and dialects in all his languages. Ustinov provided his own German and French dubbing for some of his roles, both of them for Lorenzo's Oil. As Hercule Poirot, he provided his own voice for the French versions of Thirteen at Dinner, Dead Man's Folly, Murder in Three Acts, Appointment with Death, and Evil under the Sun, but unlike Jane Birkin, who had dubbed herself in French for this film and Death on the Nile, Ustinov did not provide his voice for the latter (his French voice being provided by Roger Carel, who had already dubbed him in Spartacus and other films). He dubbed himself in German as Poirot only in Evil under the Sun (his other Poirot roles being undertaken by three actors). However, he provided only his English and German voices for Disney's Robin Hood and NBC's Alice in Wonderland."]}, {"page": "1998 in film", "response": ["| A Soldier's Daughter Never Cries || October Films || James Ivory (director); Ruth Prawer Jhabvala (screenplay); Kris Kristofferson, Barbara Hershey, Leelee Sobieski, Jesse Bradford, Jane Birkin, Dominique Blanc, Harley Cross, Isaach de Bankolé, Macha Méril, Nathalie Richard, Anthony Roth Costanzo, Bob Swaim, Virginie Ledoyen || Drama || Live action"]}, {"page": "1988 in film", "response": ["*Kung-Fu Master (a.k.a. Le Petit Amour), directed by Agnès Varda, starring Jane Birkin and Charlotte Gainsbourg – (France)"]}, {"page": "1991 in film", "response": ["*La Belle Noiseuse (The Beautiful Troublemaker), directed by Jacques Rivette, starring Michel Piccoli, Jane Birkin and Emmanuelle Béart – (France)"]}, {"page": "1985 in film", "response": ["*Leave All Fair, starring John Gielgud and Jane Birkin (New Zealand/France)"]}, {"page": "1982 in film", "response": ["* Evil Under the Sun, starring Peter Ustinov, Diana Rigg, Maggie Smith, James Mason, Jane Birkin, Nicholas Clay, Sylvia Miles, Roddy McDowall – (U.K.)", "| Evil Under the Sun || Universal Pictures / Associated Film Distribution / EMI Films / Titan Productions / Mersham Productions Ltd. || Guy Hamilton (director); Anthony Shaffer (screenplay); Peter Ustinov, Jane Birkin, Colin Blakely, Nicholas Clay, James Mason, Roddy McDowall, Sylvia Miles, Denis Quilley, Diana Rigg, Maggie Smith, Emily Hone || Mystery || Live action"]}, {"page": "1976 in film", "response": ["*Je t'aime moi non plus (I Love You...Me Neither), directed by Serge Gainsbourg, starring Jane Birkin and Joe Dallesandro – (France)"]}, {"page": "1973 in film", "response": ["*Dark Places, starring Christopher Lee, Joan Collins, Jane Birkin – (U.K.)"]}, {"page": "Johnny Marr", "response": ["He has also worked as a session musician and writing collaborator for artists including Pet Shop Boys, Bryan Ferry, Billy Bragg, Kirsty MacColl, Black Grape, Jane Birkin, Talking Heads, and Beck. Marr played guitar on four songs on Talking Heads' final album Naked, including the single \"(Nothing But) Flowers\", and he prominently appears in that song's music video. ", "In the 1980s and 1990s, Marr played on three Billy Bragg recordings. In the late 1980s, he performed on albums by Bryan Ferry and Talking Heads. In the 1990s and 2000s, he performed on three Pet Shop Boys albums, and also plays guitar and harmonica on their Xenomania-produced album, Yes, released in 2009. In the 1990s, he also performed on albums by M People, Beck and Tom Jones. In the 2000s, he played on albums by bands such as Oasis, Pearl Jam, Jane Birkin, Lisa Germano and Crowded House. He also plays guitar on Girls Aloud's fifth album, Out of Control, on a track entitled \"Rolling Back the Rivers in Time\", as well as harmonica on the track \"Love Is the Key\". He also appeared on two tracks (\"Enough of Me\" and \"Central\") on John Frusciante's album The Empyrean which was released January 2009."]}, {"page": "Eurovision Song Contest 1978", "response": ["The postcards were filmed live, featuring the artists making their way to the stage. They took a corridor, then an elevator. Leaving the lift, they were greeted by the previous participants and then made their entrances to the stage. The camera also made several shots of the audience, notably Jane Birkin and Serge Gainsbourg."]}, {"page": "Raymond Carver", "response": ["*Whoever Was Using This Bed, also directed by Andrew Kotatko (2016), starring Jean-Marc Barr, Radha Mitchell and Jane Birkin, based on Carver's short story of the same name"]}, {"page": "John Barry (composer)", "response": ["Barry was married four times. His first three marriages, to Barbara Pickard (1959–63), Jane Birkin (1965–68), and Jane Sidey (1969–78) all ended in divorce.. WebCitation archive. He was married to his fourth wife, Laurie, from January 1978 until his death. The couple had a son, Jonpatrick. Barry had three daughters, Suzanne (Suzy) with his first wife, Barbara, Kate with his second wife, Jane, and Sian, from a relationship with Ulla Larson between the first two marriages. Suzy Barry, who is married to BBC business journalist Simon Jack, is the mother of his two granddaughters, Phoebe and Florence Ingleby."]}, {"page": "Twiggy", "response": ["On 21 November 2011, she released an album, Romantically Yours, through EMI. A collection of pop and easy listening standards spanning several generations, the album features versions of such compositions as \"Bewitched, Bothered and Bewildered\", \"Blue Moon\", \"My Funny Valentine\", \"Someone to Watch over Me\" and \"They Can't Take That Away from Me\", and London anthem \"Waterloo Sunset\". The album also includes a guest vocal appearance by Twiggy's daughter, Carly Lawson, on Neil Young's \"Only Love Can Break Your Heart\", a guitar solo by Bryan Adams, and a version of Richard Marx's \"Right Here Waiting\" featuring duet vocals with the American songwriter himself. In 2016, archive images of Twiggy, alongside images of Shrimpton and Jane Birkin were used for Tod's Fall/Winter campaign."]}, {"page": "Léo Malet", "response": ["*Nestor Burma, détective de choc, directed by Jean-Luc Miesch (1982), with Michel Serrault (as Nestor Burma), Jane Birkin"]}, {"page": "Agnès Varda", "response": ["Varda died from cancer on 29 March 2019 in Paris, at the age of 90. She was buried at Montparnasse Cemetery on 2 April.  Among those who attended her funeral were Catherine Deneuve, Julie Gayet, Jean-Pierre Léaud, Jane Birkin, and Sandrine Bonnaire. Mourners left flowers and potatoes outside her house on rue Daguerre."]}, {"page": "Variety show", "response": ["From 1965 to 1970 was also aired Dim Dam Dom, a modern, playful and sophisticated show intended for a female audience and produced by Elle chief editor Daisy de Galard. Each episode of Dim Dam Dom was hosted in an all-white studio set by a different speakerine (a female continuity announcer), usually a popular actress or singer like Françoise Hardy, Marie Laforêt, Geraldine Chaplin, France Gall, Jane Birkin, Françoise Fabian, Romy Schneider."]}, {"page": "Fontana Records", "response": ["Fontana's U.S. counterpart label was started in 1964 and distributed by Philips US subsidiary Mercury Records.  The initial single release (F 1501) was a wild teen beat instrumental by famed British session drummer Bobby Graham, both sides featuring Jimmy Page on guitar. Among the hitmakers were Wayne Fontana & the Mindbenders (then later on their own, simply as the Mindbenders), the Troggs, the New Vaudeville Band, Manfred Mann, Dave Dee, Dozy, Beaky, Mick & Tich, and Steam, all of whom had No. 1 hits on the label.  Other successful Fontana artists included the Silkie, Nana Mouskouri, the Pretty Things, the Herd, Gloria Lynne and the duo of Jane Birkin & Serge Gainsbourg.  The label also served as an outlet for other British acts such as the Merseybeats, the Others, Eden Kane, the Escorts and Sight & Sound. Fontna released southern soul 45s such as the Pallbeares also."]}, {"page": "Cecil Beaton", "response": ["* Jane Birkin, 1971"]}, {"page": "Michel Piccoli", "response": ["| Jane Birkin"]}, {"page": "A Nightingale Sang in Berkeley Square", "response": ["The song was published in 1940, when it was first performed in the London revue New Faces by Judy Campbell (later the mother of Jane Birkin). In the same year it was also performed by both Ray Noble and then by Vera Lynn. The tune is a recurring theme in the Fritz Lang film Man Hunt (1941). It was notably sung by Elsie Carlisle, a popular English female singer both before and during the British dance band era."]}, {"page": "Blowup", "response": ["Blowup (sometimes styled as Blow-up or Blow Up) is a 1966 mystery thriller film directed by Michelangelo Antonioni and produced by Carlo Ponti. It was Antonioni's first entirely English-language film, and stars David Hemmings as a London fashion photographer who believes he has unwittingly captured a murder on film. The film also stars Vanessa Redgrave, Sarah Miles, John Castle, Jane Birkin, Tsai Chin, Peter Bowles, and Gillian Hills, as well as 1960s model Veruschka. The film's plot was inspired by Julio Cortázar's short story \"Las babas del diablo\" (1959). The screenplay was by Antonioni and Tonino Guerra, with English dialogue by British playwright Edward Bond. The cinematographer was Carlo di Palma. The film's non-diegetic music was scored by jazz pianist Herbie Hancock, while rock group the Yardbirds also feature. The film is set within the mod subculture of 1960s Swinging London."]}, {"page": "List of films based on video games", "response": ["* Kung Fu Master (1988) – A love story between a 40-year-old woman (Jane Birkin) and a 15-year-old boy addicted to the arcade game Kung-Fu Master. Directed by Agnès Varda."]}, {"page": "Le Divorce", "response": ["The opening title music was Paul Misraki's \"Qu'est-ce qu'on attend pour être heureux\", sung by Patrick Bruel and Johnny Hallyday from Bruel's CD \"Entre deux\". The end title music was Serge Gainsbourg's \"L'Anamour\", sung by Jane Birkin from her CD \"Version Jane\"."]}, {"page": "César Award for Best Supporting Actress", "response": ["* United Kingdom: Jane Birkin, Jacqueline Bisset, Charlotte Rampling, Kelly Reilly,", "|Jane Birkin||The Beautiful Troublemaker||La Belle Noiseuse"]}, {"page": "Franz Ferdinand (band)", "response": ["The band also performed, played, and recorded with Jane Birkin, covering the Serge Gainsbourg song \"Sorry Angel\" for the 2005 album Monsieur Gainsbourg Revisited. In addition, Franz re-recorded the track \"Brown Onions\" for David Shrigley's compilation album Worried Noodles. The band kept instrumentation identical but used lyrics written by Shrigley which include the consistent repetition of the word \"No\" and occasionally \"No brains, no teeth, no legs, no eyes...\". Hot Chip, a band who are reported to be a favourite of Franz Ferdinand, also performed their own version of \"No\" on the same album."]}, {"page": "Adelaide Festival", "response": ["| Raoul starring James Thiérrée; Harold Pinter's The Caretaker starring Jonathan Pryce; Leonard Bernstein's Mass featuring Jubilant Sykes; Force Majeure and Sydney Theatre Company's production Never Did Me Any Harm; Charles Bradley; Roky Erickson; Ariel Pink’s Haunted Graffiti; Michael Rother and Jane Birkin."]}, {"page": "Jacques Rivette", "response": ["Rivette's difficulties in securing financial backing for his films during the late 1970s led him to a business partnership with Pierre Grise Productions and producer Martine Marignac. The company was the chief distributor and financier for all his subsequent films. Their first film, Love on the Ground (1984), again concerned a theatrical group and the blurring of fiction and reality. Geraldine Chaplin and Jane Birkin star as members of a theatrical troupe who are invited to appear in a new play resembling the real life of its director (Kalfon) and the mysterious disappearance of his wife.", "In 2007, Rivette made The Duchess of Langeais, an faithful adaptation of Balzac's novel, and the second of Balzac's trilogy, Histoire des treize, the introduction to which inspired Out 1. Jeanne Balibar and Guillaume Depardieu star as lovers in early 1823 Majorca who are involved in a tormented, frustrating relationship. The film premiered at the 2007 Toronto International Film Festival. In 2009, Rivette made 36 vues du pic Saint-Loup; Jane Birkin starred as a woman who returns to her childhood circus troupe after her father dies, and begins a romance with a wealthy Italian drifter (Sergio Castellitto). The film, which premiered at the 66th Venice International Film Festival, was the director's last."]}, {"page": "Death on the Nile", "response": ["The novel was adapted into a feature film, released in 1978 and starring Peter Ustinov for the first of his six appearances as Poirot. Others in the all-star cast included Bette Davis (Miss Van Schuyler), Mia Farrow (Jacqueline de Bellefort), Maggie Smith (Miss Bowers), Lois Chiles (Linnet Doyle), Simon MacCorkindale (Simon Doyle), Jon Finch (Mr. Ferguson), Olivia Hussey (Rosalie Otterbourne), Angela Lansbury (Mrs. Otterbourne), Jane Birkin (Louise), George Kennedy (Mr. Pennington), Jack Warden (Dr. Bessner), I. S. Johar (Mr. Choudhury) and David Niven (Colonel Race). The screenplay differs slightly from the book, deleting several characters, including Cornelia Robson, Signor Richetti, Joanna Southwood, the Allertons, and Mr. Fanthorp. Tim Allerton is replaced as Rosalie's love interest by Ferguson."]}]}}