{"wiki_id": "http://www.wikidata.org/entity/Q21228729", "itemLabel": "Natasha England", "itemDescription": "Scottish pop singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Natasha_England", "wikipedia_page": {"main": "Natasha England (born Dorothy Natasha Sherratt, 18 December 1952), often credited as Natasha, is a Scottish pop singer whose version of \"Iko Iko\" reached number 10 on the UK Singles Chart in 1982.", "link_mentions": [{"page": "The Belle Stars", "response": ["When the third single, the radio-friendly \"Another Latin Love Song\" again failed to break into the charts, the band tried cover versions instead, with some success. \"Iko Iko\", a cover of The Dixie Cups' 1965 hit (later featured in the 1988 movie Rain Man),Whitburn, Joel (1996). The Billboard Book of Top 40 Hits (6th ed.). New York: Watson-Guptill Publications. p. 57. . was The Belle Stars' long-hoped-for UK Singles Chart debut, peaking at a modest number 35 in June 1982. This single was unfortunately released at the same time as another version by Natasha England, whose version went on to reach the UK Top Ten. The Belle Stars furthered this with \"The Clapping Song\" (their first top 20 hit), a remake of the 1965 Shirley Ellis hit, and then \"Mockingbird\", a hit for Inez and Charlie Foxx in 1963 and James Taylor and Carly Simon in 1974. "]}, {"page": "Natasha", "response": ["* Natasha England (born 1952), Scottish singer, sometimes credited mononymously as Natasha"]}, {"page": "Chas & Dave", "response": ["Chas & Dave first signed a management deal in 1978 with Bob England, who with business partner Natasha England then formed the 'Rockney' label with the duo in 1980, part of the England's Towerbell Records company. The first single released under this label, \"Rabbit\" became their first top 10 hit single. The word \"rabbit\" comes from the Cockney rhyming slang rabbit and pork meaning talk. The song is about a relationship between a man and a woman, in which the man expresses his love for his girlfriend, but complains that she will not stop talking or, rabbiting. It was also used in a television commercial for Courage Bitter. On Christmas Day 1981 they appeared on The Two Ronnies Christmas Special.", "* Episode 2: 4 June 1983, Appearing: Lulu, Rocky Sharpe and the Replays, Natasha England, Bobby Knutt and Roy Jay"]}, {"page": "Iko Iko", "response": ["The song first became popular in 1965 by the girl group the Dixie Cups, who scored an international hit with \"Iko Iko\". In 1967, as part of a lawsuit settlement between Crawford and the Dixie Cups, the trio were given part songwriting credit for the song. In 1972, Dr. John had a minor hit with his version of \"Iko Iko\". In the UK, a version recorded by Scottish singer Natasha England in 1982 made it to the top 10. \"Iko Iko\" became an international hit twice more, the first being the Belle Stars in June 1982 and again with Captain Jack in 2001. An adaptation by Papua New Guinea artist Justin Wellington under the title \"Iko Iko (My Bestie)\" featuring the Solomon Island duo Small Jam became an international hit in 2021 after a successful TikTok challenge.", "The most successful charting version in the UK was recorded by the Scottish singer Natasha (full name Natasha England), whose version reached number 10 on the UK singles chart in 1982. Natasha's single was one of two competing versions of \"Iko Iko\" in the Official Singles Chart Top 40 of week ending 19th June 1982, a chart run-down which saw Natasha at number 24, eleven places higher than the version released by The Belle Stars on Stiff Records. The song also charted highly in Ireland, Israel and New Zealand. The single was produced by Tom Newman. A remix of the single was released in 2007, and Natasha's version enjoyed a resurgence in 2014 when it was included on the soundtrack to the highest-grossing Italian film of 2014, A Boss in the Living Room (Un Boss in Salotto)."]}, {"page": "I Want You to Be My Baby", "response": ["The song has also been recorded by Jimmy and the Mustangs, Colin James, Lindisfarne, Natasha England, Janis Siegel, and Leslie Uggams. Pittsburgh Courier 4 March 1967 \"Wax Works\" by Hazel Garland p.13 A Finnish rendering - \"Armaani Sä Silloin Oisit\" - was recorded by Wiola Talvikki.  It was also a hit for Chinese singer Grace Chang who performed the song in both Chinese (我要你的爱 \"Wo Yao Ni de Ai\") and English in the late 1950s. There was another rendition of the song in a classic 1958 Tamil movie Uthama puthiran entitled Yaaradi Ni Mohini."]}, {"page": "Natasha and the Delites", "response": ["#REDIRECT Natasha England"]}, {"page": "Dorothy Natasha Sherratt", "response": ["#REDIRECT Natasha England"]}, {"page": "Platform Records", "response": ["Natasha England relaunched her career via Platform Records in 2007 with the first digital release of her 1982 top 10 single \"Iko Iko\" and 42-track anthology Back From The Mists of Time.", "* Natasha England"]}]}}