{"wiki_id": "http://www.wikidata.org/entity/Q2121109", "itemLabel": "Richard Jacques", "itemDescription": "British music composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Jacques", "wikipedia_page": {"main": "Richard Adrian Jacques (; born 1973) is a British composer of film, television and video game music. Best known for his critically acclaimed orchestral scores for blockbuster franchises such as James Bond 007: Bloodstone, Sonic the Hedgehog, Mass Effect, LittleBigPlanet 2, Alice In Wonderland, Starship Troopers and Headhunter, Jacques has collaborated with numerous premier TV and movie theatre campaigns for some of the world's largest media agencies including Saatchi & Saatchi and McCann Ericsson, and global brands such as Audi, Bacardi, Mercedes-Benz and Stella Artois. His music for television includes top brand shows for the BBC, ITV and Channel 4.", "link_mentions": [{"page": "List of film score composers", "response": ["* Richard Jacques (born 1973) "]}, {"page": "Sonic 3D Blast", "response": ["The soundtrack for the Genesis version, which features 24 tracks in total, was primarily composed by Jun Senoue and Tatsuyuki Maeda, with Masaru Setsumaru and Seirou Okamoto composing the final boss and staff roll themes respectively. The Saturn version features a different soundtrack by Richard Jacques and features a vocal ending theme titled \"You're My Hero\", performed by Debbie Morris. The musical styles on the soundtrack were described by Sega Saturn Magazine as both traditional Sonic music and \"hardcore techno\".", "Category:Video games scored by Richard Jacques"]}, {"page": "Tommy Tallarico", "response": ["|2009||Sonic and the Black Knight||With Howard Drossin, Richard Jacques, Jun Senoue and various others."]}, {"page": "List of video game musicians", "response": ["*Richard Jacques – Sonic R, Metropolis Street Racer, Headhunter, Sonic Chronicles: The Dark Brotherhood"]}, {"page": "Tim Follin", "response": ["During his game music career, Follin never had the mood or interest to join any demoscene groups. Though Follin knew few fellow video game composers, he highly respected Richard Jacques for the amount of work put into his music.", "Several contemporaries of Follin's have cited him as an inspiration or top composer including Richard Jacques, Jesper Kyd, David Wise, Frédéric Motte, Markus Schneider, Matt \"Gasman\" Westcott, Ramiro \"Extremer\" Vaca, graphic artist Haydn Dalton, and programmer Dean Belfield. Frequent Software Creations collaborator Steve Ruddy, who programmed music drivers used by Follin with Follin's design input, marvelled \"I had no idea how he made it do what it did,\" and described his music as \"astonishing.\""]}, {"page": "Jet Set Radio Future", "response": ["The music is played in a premixed format consisting of certain playlists directed to certain levels, although there is a jukebox. Alongside returning video game composers from the first game Hideki Naganuma and Richard Jacques, the soundtrack features artists such as indie rock band Guitar Vader, Beastie Boys Adrock side project BS 2000, hip hop/breakbeat group Scapegoat Wax, indie pop band Bis, The Latch Brothers (including Mike D of the Beastie Boys, Chris \"Wag\" Wagner and Kenny Tick Salcido), rock band Cibo Matto, musical collective Bran Van 3000, and hip hop group The Prunes.", "Category:Video games scored by Richard Jacques"]}, {"page": "Jet Set Radio", "response": ["The Jet Set Radio soundtrack includes original and licensed tracks with a variety of genres including J-pop, hip hop, funk, electronic dance, rock, acid jazz, and trip hop. The North American version and international rereleases adds metal songs. The 2012 port omits \"Yappie Feet\" and \"Many Styles\" for licensing reasons. The music has been described as energetic, rhythm-heavy, defiant, and multicultural. Most of the soundtrack was composed by Hideki Naganuma, with additional tracks by Richard Jacques, Deavid Soul, Toronto, and B.B. Rights.  Naganuma attempted to match the visual style, and experimented with voices, cutting and rearranging samples to the point that they became nonsensical. In 2012, Naganuma said Jet Set Radio and its sequel had been his favorite projects. Smilebit worked with Sega of America and Sega of Europe to include as many street culture elements as possible, hoping to create music that was internationally acceptable.", "Category:Video games scored by Richard Jacques"]}, {"page": "Sonic R", "response": ["Development began after the completion of Sonic 3D Blast in 1996 and took nine months. It was the second collaboration between Traveller's Tales and Sonic Team and was designed to take advantage of the Saturn hardware. Sonic Team designed the race tracks, while Traveller's Tales handled implementation and programming using a custom game engine. The soundtrack was composed by Richard Jacques; tracks from the game, most notably \"Super Sonic Racing\", have been reused in subsequent Sonic titles. Sega released the game for the Saturn in late 1997, for Windows the following year, and for the GameCube and PlayStation 2 as part of Sonic Gems Collection in 2005.", "The soundtrack for Sonic R was composed by British composer Richard Jacques of Sega Europe, who had also previously worked on the soundtrack of the Sega Saturn and PC versions of Sonic 3D Blast. Work on the soundtrack began in March 1997 when Jacques travelled to Japan to meet with Sonic creator Yuji Naka to discuss the musical approach to take for the game. The first song written was \"Super Sonic Racing\", which would be used for the game's reveal in June at E3. British singer TJ Davis provided the vocals for the song, which Naka liked so much that he requested that she be featured in all the game's songs. Jacques wrote all the lyrics for the songs with the intention that they would complement the on-screen action but still be appealing to someone who had never played the game. Tracks were recorded and programmed at Sega Digital Studios, and then worked on for two weeks at Metropolis Studios in London, where a week was spent on vocals, and a week was spent on producing, mixing, and finalising the tracks. Jacques stated that this task was amongst the most difficult in his career because the lyrics needed to \"really mean something\". Sonic R features two separate mixes of each song in its in-game soundtrack; ones with vocals and instrumental versions, giving the player the option to disable vocals. An official soundtrack CD was released on 21 January 1998.Official Guide, p. 112.", "Category:Video games scored by Richard Jacques"]}, {"page": "James Bond music", "response": ["|Richard Jacques"]}, {"page": "Metropolis Street Racer", "response": ["As well as being an early example of an open world racing game, Metropolis Street Racer is notable for introducing the \"Kudos\" system (whereby players are rewarded for racing stylishly as well as quickly) into video games, and for its detailed and accurate recreations of the cities of London, Tokyo and San Francisco. Music for the game was composed by Richard Jacques, and delivered via nine fictional radio stations (three for each city), similar to the Grand Theft Auto series. The day/night time spectrum during game play is realistic, in that the game uses the internal clock of the Dreamcast to calculate the present time in each city. Play at 8AM in England, for example, and the San Francisco races will all be at night (12 AM).", "Metropolis Street Racer was also the first racer to have radio stations and DJs talking between music tracks. The soundtrack was composed by Richard Jacques. Some songs in the radio stations are sung by TJ Davis, who also sung songs from the Sega Saturn game, Sonic R.", "Category:Video games scored by Richard Jacques"]}, {"page": "Headhunter (video game)", "response": ["Category:Video games scored by Richard Jacques"]}, {"page": "Jacques", "response": ["*Richard Jacques (born 1973), British composer", "*Richard Jacques (military officer) (1704–1745), American colonial officer during Father Rale's War"]}, {"page": "Jun Senoue", "response": ["| with Richard Jacques, Kenichi Tokoi, and Tomonori Sawada"]}, {"page": "EyeToy: Play 2", "response": ["Category:Video games scored by Richard Jacques"]}, {"page": "Wells Cathedral School", "response": ["*Richard Jacques, composer"]}, {"page": "Catchphrase (British game show)", "response": ["From 2013 onwards, a fourth version was introduced, based on Ed Welch's original theme and composed by Marc Sylvan and Richard Jacques. A new title sequence, logo and studio set was also created for the series."]}, {"page": "Hideki Naganuma", "response": ["|Additional tracks by Richard Jacques, Deavid Soul, Toronto, and B.B. Rights.", "|Composer with Richard Jacques, featuring various rock, hip hop, and breakbeat artists."]}, {"page": "Hello Broadway", "response": ["#\"My Way\" (Richard Jacques, Ronald Miller) – 2:53"]}, {"page": "EyeToy: Play 3", "response": ["Category:Video games scored by Richard Jacques"]}, {"page": "Shinobi Legions", "response": ["The in-game tracks were replaced by British video game composer Richard Jacques, while the cutscene music tracks were left intact. Jacques composed the soundtrack in imitation of the style of Yuzo Koshiro's The Revenge of Shinobi. The North American version, published earlier the same year by Vic Tokai, had retained the same music as the Japanese version.", "Category:Video games scored by Richard Jacques"]}, {"page": "Sonic the Hedgehog", "response": ["Other composers who have contributed to Sonic games include Richard Jacques and Hideki Naganuma. Tee Lopes—known for releasing unofficial remixes of Sonic tracks on YouTube—was the lead composer for Sonic Mania and a contributor to Team Sonic Racing. The main theme of the 2006 Sonic the Hedgehog was performed by Ali Tabatabaee and Matty Lewis of the band Zebrahead, while Akon remixed \"Sweet Sweet Sweet\" for its soundtrack. Hoobastank lead singer Doug Robb performed the main theme of Sonic Forces."]}, {"page": "Mass Effect (video game)", "response": ["Films such as Star Wars, Alien, Star Trek II: The Wrath of Khan, Blade Runner, Starship Troopers, and especially Final Fantasy: The Spirits Within, were major influences on the atmosphere and artistic qualities of the game. The team chose Jack Wall, who also penned the music for BioWare's 2005 title Jade Empire, as the main composer of Mass Effect due to his ability to produce a wide range of musical styles. Hudson had a clear idea of what kind of music he wanted in the game, but gave Wall certain artistic freedom to express himself. According to Wall, the main vision was to \"marry the electronic instrument palatte  of the late 70's/early 80's with more organic elements.\" Wall had never written this style of music before, but composer Sam Hulick helped him develop the electronic sound on a classic orchestral foundation. By the end of the project, composers Richard Jacques and David Kates joined Wall and Hulick to finish the score on time. While a total of 110 minutes of music was written for the game, all in-game and cinematic music was crafted as multiple stems to maximize their use and variety. The game went gold on October 22, 2007.", "Category:Video games scored by Richard Jacques"]}, {"page": "Pursuit Force", "response": ["Category:Video games scored by Richard Jacques"]}, {"page": "Headhunter Redemption", "response": ["Category:Video games scored by Richard Jacques"]}, {"page": "OutRun 2006: Coast 2 Coast", "response": ["Category:Video games scored by Richard Jacques"]}, {"page": "Howard Drossin", "response": ["| rowspan=\"2\" | 2009|||Sonic and the Black Knight||With Jun Senoue, Tommy Tallarico, Richard Jacques and others"]}, {"page": "Sega Rally 2006", "response": ["Category:Video games scored by Richard Jacques"]}, {"page": "The Club (video game)", "response": ["The title was released globally on February 8, 2008. Composer Richard Jacques wrote the score for the single player levels, Chris Chudley from Audioantics wrote the score for the multiplayer levels, while Jesper Kyd scored the main theme.", "Category:Video games scored by Richard Jacques"]}, {"page": "Daytona USA: Championship Circuit Edition", "response": ["In response to numerous fan complaints that the original Daytona USA soundtrack was inappropriate for a racing game, Sega Europe's in-house composer, Richard Jacques, was tasked with remixing the original songs, along with musicians from both Sega Japan and Sega America.", "Category:Video games scored by Richard Jacques"]}, {"page": "Jack Wall (composer)", "response": ["| Composed with Sam Hulick, Richard Jacques, and David Kates"]}, {"page": "Starship Troopers (video game)", "response": ["Category:Video games scored by Richard Jacques"]}, {"page": "Battlestations: Midway", "response": ["Category:Video games scored by Richard Jacques"]}, {"page": "Amuze", "response": ["Music for the game was composed by Richard Jacques and recorded at Abbey Road Studios."]}]}}