{"wiki_id": "http://www.wikidata.org/entity/Q2134553", "itemLabel": "Reader Bullard", "itemDescription": "Diplomat and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Reader_Bullard", "wikipedia_page": {"main": "Sir Reader William Bullard  (5 December 1885 – 24 May 1976) was a British diplomat and author.", "link_mentions": [{"page": "History of the United Arab Emirates", "response": ["In 1952 a group of some 80 Saudi Arabian guards, 40 of whom were armed, led by the Saudi Emir of Ras Tanura, Turki Abdullah al Otaishan, crossed Abu Dhabi territory and occupied Hamasa, one of three Omani villages in the Oasis, claiming it as part of the eastern Province of Saudi Arabia. The Sulṭan of Muscat and Imam of Oman gathered their forces to expel the Saudis but were persuaded by the British Government to exercise restraint pending attempts to settle the dispute by arbitration. A British military build-up took place, leading to the implementation of a standstill agreement and the referral of the dispute to an international arbitration tribunal. In 1955 arbitration proceedings began in Geneva only to collapse when the British arbitrator, Sir Reader Bullard, objected to Saudi Arabian attempts to influence the tribunal and withdrew. A few weeks later, the Saudi party was forcibly ejected from Hamasa by the Trucial Oman Levies."]}, {"page": "Tudeh Party of Iran", "response": ["From this point on the party grew immensely and became a major force in Iranian politics. By early 1945, the party had managed to create the first mass organization in Iran's history. Police records later revealed it had an estimated 2,200 hard-core members – 700 of them in Tehran – \"10,000s of sympathizers in its youth and women's organizations, and 100,000s of sympathizers in its labor and craft unions.\"Abrahamian, Tortured Confessions, (1999) p. 81 Its main newspaper, Rahbar (Leader), boasted a circulation of more than 100,000 – triple that of the \"semi-official newspaper\" Ettela'at. British ambassador Reader Bullard called it the only coherent political force in the country, and the New York Times reckoned it and its allies could win as much as 40% of the vote in a fair election.Ettela'at, 24 September 1979, quoted in Abrahamian, History of Modern Iran (2008) pp. 108–09"]}, {"page": "Eastern Approaches", "response": ["In September 1942 Maclean was ordered to Baghdad, where General Wilson, the new head of Persia and Iraq Command, wanted his advice about starting something like the SAS in Persia, should that country fall to the Germans.  He proceeded there to recruit volunteers, passing through many of the places he had seen in peacetime four years earlier: Kermanshah, Hamadan, Kazvin, Teheran.  He was soon diverted to a more urgent task. General Joseph Baillon, the Chief of Staff, and Reader Bullard, the minister (i.e., ambassador, as above), summoned him to Teheran. They were concerned about the influence of Fazlollah Zahedi, the general in charge of the Persian forces in the Isfahan area, who, their intelligence told them, was stockpiling grain, liaising with German agents, and preparing an uprising. Baillon and Bullard asked Maclean to remove Zahidi alive and without creating a fuss. He devised a Trojan horse plan: he and a senior officer would call on Zahidi to pay their respects, and then arrest him \"at the point of a pistol\" within his walled and guarded residence.  He would be whisked out in the British staff car, driven a waiting plane, and flown into internment and exile.  Maclean obtained and trained a platoon of Seaforth Highlanders to cover his retreat, and the plan went like clockwork. (Zahidi spent the rest of the war in British Palestine; five years later he was back in charge of the military of southern Persia, by 1953 he was prime minister.)"]}, {"page": "Bancroft's School", "response": ["|Sir Reader Bullard"]}, {"page": "Holywell Cemetery", "response": ["* Sir Reader Bullard and his sons Sir Giles Bullard and Sir Julian Bullard, all diplomats"]}, {"page": "List of ambassadors of the United Kingdom to Saudi Arabia", "response": ["*1936–1939: Sir Reader Bullard"]}, {"page": "Bullard", "response": ["* Sir Reader Bullard (1885–1976), British diplomat and author"]}, {"page": "Al Buraimi Governorate", "response": ["A standstill agreement was implemented and, on 30 July 1954, it was agreed to refer the dispute to an international arbitration tribunal.UN Meanwhile, Saudi Arabia embarked on a campaign of bribery to obtain declarations of tribal loyalty on which its case was based. In 1955 arbitration proceedings began in Geneva only to collapse when the British arbitrator, Sir Reader Bullard, withdrew. A few weeks later, the Saudi party was forcibly ejected from Hamasa by the Trucial Oman Levies. Together with a few refugee sheikhs and their families, the Saudis were taken to Sharjah and dispatched to Saudi Arabia by sea. The dispute continued to rumble on for many years to come until settled in 1974 by an agreement, known as the Treaty of Jeddah, between Sheikh Zayed (then President of the UAE) and King Faisal of Saudi Arabia."]}, {"page": "List of diplomats of the United Kingdom to Iran", "response": ["*1942–1944: Sir Reader Bullard", "*1944–1946: Sir Reader Bullard"]}, {"page": "Plantation Road", "response": ["Towards the end of his life, the diplomat and author Sir Reader Bullard (1885–1976) lived in Plantation Road."]}, {"page": "Giles Bullard", "response": ["Giles Lionel Bullard was born in Oxford, England, one of five children of Sir Reader Bullard and his wife, Miriam Catherine (Biddy), née Smith (one of his brothers being the diplomat Sir Julian Bullard)."]}, {"page": "Arthur Smith (historian)", "response": ["In 1879, Smith married Mary Smith, with whom he had nine children. They first lived at 7 Crick Road in North Oxford until 1893. Their daughter Miriam married the diplomat Sir Reader Bullard. Smith's daughter Rosalind married Oxford historian Edward Murray Wrong. His youngest daughter Barbara married Sir Hugh Cairns the first Nuffield Professor of Surgery."]}, {"page": "Sir Reader Bullard", "response": ["#REDIRECT Reader Bullard"]}, {"page": "Anglo-Soviet invasion of Iran", "response": ["Following the invasion, Sir Reader Bullard and Andrey Andreyevich Smirnov, the British and Soviet ambassadors to Iran, were summoned. The Shah demanded to know why they were invading his country and why they had not declared war. Both answered that it was because of \"German residents\" in Iran. When the Shah asked if the Allies would stop their attack if he expelled the Germans, the ambassadors did not answer. The Shah sent a telegram to US President Franklin D. Roosevelt, pleading with him to stop the invasion. As the neutral United States had nothing to do with the attack, Roosevelt was not able to grant the Shah's plea but stated that he believed that the \"territorial integrity\" of Iran should be respected."]}, {"page": "Institute of Commonwealth Studies, Oxford", "response": ["The last year of Sir Reader Bullard as Director, 1956, saw the alteration of the Institute’s name from Institute of Colonial Studies to Institute of Commonwealth Studies, reflecting changes in Britain’s imperial status. The Institute of Colonial Studies had been established in 1945. Its antecedent had been the training courses at the University of Oxford for both the probationers of the Indian Civil Service and the Colonial Services (such as the Tropical African Service Course). More directly it had developed out of the University’s response to a proposed expansion, to be made in the post-war years, in the training of colonial civil servants. These proposals were eventually published as the Report on Post-War Training for the Colonial Service (Devonshire Report, 1946). Much of the drafting of the report had been undertaken by Margery Perham, then Reader in Colonial Administration at Oxford, who had also been influential in establishing the Committee for Colonial Studies, the Institute’s supervising body, in 1943. The Institute was set up under the directorship of Perham, assisted by Col. F.B.H. Drummond as administrative secretary who also acted as secretary to the Committee. In 1948 both Perham and Drummond resigned and the Institute’s affairs were placed in the hands of a Committee of Management, consisting of the Beit Professor of Commonwealth History (then, of the History of the British Empire), the Registrar and the Reader in Colonial Administration, who continued to run the Institute until Bullard's appointment as Director in 1951. The Institute, initially located at 10 Bardwell Road, Oxford, moved in 1948 to premises in South Parks Road, in 1951 to 10 Keble Road, and in 1961 to Queen Elizabeth House (21 St Giles). It continued in existence until 1986, when it was amalgamated with the Institute of Agricultural Economics and Queen Elizabeth House to form the International Development Centre, a centre for international Development Studies. In 2005, the centre moved to Mansfield Road and became the Oxford Department of International Development.", ":1951–56 Sir Reader Bullard"]}, {"page": "List of Honorary Fellows of Lincoln College, Oxford", "response": ["* Sir Reader Bullard"]}, {"page": "List of Honorary Fellows of Queens' College, Cambridge", "response": ["* Sir Reader Bullard"]}, {"page": "Buraimi dispute", "response": ["In 1955 arbitration proceedings began in Geneva only to collapse when the British arbitrator, Sir Reader Bullard, objected to Saudi Arabian attempts to influence the tribunal and withdrew – one of the two judges to resign, the other being the Belgian President."]}, {"page": "Saudi Arabia–United Arab Emirates border", "response": ["In 1955 arbitration proceedings began in Geneva only to collapse when the British arbitrator, Sir Reader Bullard, objected to Saudi Arabian attempts to influence the tribunal and withdrew – one of the two judges to resign, the other being the Belgian President."]}]}}