{"wiki_id": "http://www.wikidata.org/entity/Q213680", "itemLabel": "Egon Wellesz", "itemDescription": "Austrian, later British composer, teacher and musicologist (1885-1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Egon_Wellesz", "wikipedia_page": {"main": "Egon Joseph Wellesz (21 October 1885 – 9 November 1974) was an Austrian, later British composer, teacher and musicologist, notable particularly in the field of Byzantine music.", "link_mentions": [{"page": "Achilles", "response": ["* Achilles auf Skyros (Stuttgart 1926) is a ballet by the Austrian-British composer and musicologist Egon Wellesz."]}, {"page": "1974", "response": ["* November 9 – Egon Wellesz, British composer, teacher and musicologist (b. 1885)"]}, {"page": "Arnold Schoenberg", "response": ["Schoenberg was also an influential teacher of composition; his students included Alban Berg, Anton Webern, Hanns Eisler, Egon Wellesz, Nikos Skalkottas, Stefania Turkewich, and later John Cage, Lou Harrison, Earl Kim, Robert Gerhard, Leon Kirchner, Dika Newlin, Oscar Levant, and other prominent musicians. Many of Schoenberg's practices, including the formalization of compositional method and his habit of openly inviting audiences to think analytically, are echoed in avant-garde musical thought throughout the 20th century. His often polemical views of music history and aesthetics were crucial to many significant 20th-century musicologists and critics, including Theodor W. Adorno, Charles Rosen, and Carl Dahlhaus, as well as the pianists Artur Schnabel, Rudolf Serkin, Eduard Steuermann, and Glenn Gould."]}, {"page": "Second Viennese School", "response": ["The principal members of the school, besides Schoenberg, were Alban Berg and Anton Webern, who were among his first composition pupils. Both of them had already produced copious and talented music in a late Romantic idiom but felt they gained new direction and discipline from Schoenberg's teaching. Other members of this generation included Ernst Krenek, Heinrich Jalowetz, Erwin Stein and Egon Wellesz, and somewhat later Eduard Steuermann, Hanns Eisler, Robert Gerhard, Norbert von Hannenheim, Rudolf Kolisch, Paul A. Pisk, Karl Rankl, Josef Rufer, Nikos Skalkottas, Viktor Ullmann, and Winfried Zillig.Rudolf Stephan, \"Wiener Schule\", Die Musik in Geschichte und Gegenwart: allgemeine Enzyklopädie der Musik, second, revised edition, edited by musicologist Ludwig Finscher, 26 volumes in two parts, (Kassel, Basel, London, [etc.]: Bärenreiter-Verlag; Stuttgart and Weimar: J. B. Metzler, 1998): Part 1 (Sachteil), vol. 9 (Sy–Z): cols. 2034–45.  (Bärenreiter);  (Metzler). citation from cols. 2035–36. Schoenberg's brother-in-law Alexander Zemlinsky is sometimes included as part of the Second Viennese School, though he was never Schoenberg's pupil and never renounced a traditional conception of tonality. "]}, {"page": "Vienna Philharmonic", "response": ["Other conductors who worked with the orchestra in the mid-1930s before the Anschluss included Arturo Toscanini, Weingartner, Hans Knappertsbusch, Otto Klemperer, Adrian Boult, Victor de Sabata and George Szell. Walter conducted the last concert before the Anschluss, on 20 February 1938, featuring the world premiere of Egon Wellesz's Prosperos Beschwörungen and Anton Bruckner's Symphony No. 4."]}, {"page": "1974 in music", "response": ["*November 9 – Egon Wellesz, Austrian composer, musicologist and teacher (emigrated to England), 89"]}, {"page": "1959 in music", "response": ["* Egon Wellesz –"]}, {"page": "1956 in music", "response": ["*Egon Wellesz –"]}, {"page": "1951 in music", "response": ["* Egon Wellesz – Incognita, from a novel by William Congreve (December, Oxford).Andrew Porter, \"New Wellesz Opera: 'Incognita,' Based on Congreve Story, Has Its First Performance at Oxford\", New York Times (16 December): 117."]}, {"page": "1931 in music", "response": ["*Egon Wellesz – ", "*Egon Wellesz – Die Bakchantinnen, staged 20 June, Wiener Staatsoper, Vienna"]}, {"page": "String trio", "response": ["| Egon Wellesz (1885–1974) || "]}, {"page": "1885 in music", "response": ["*October 21 – Egon Wellesz, Austrian composer (d. 1974)"]}, {"page": "Robert Mayer (philanthropist)", "response": ["In 1932, Mayer was one of the founders of the London Philharmonic Orchestra, and he also helped found the London Schools Symphony Orchestra in 1951. He was also involved, with Egon Wellesz, with the founding of the ISCM."]}, {"page": "Eclogue", "response": ["The term has also been applied to pastoral music, with the first significant examples being piano works by the Czech composer Václav Tomášek. Jan Václav Voříšek, César Franck, Franz Liszt (in the first book of Années de Pèlerinage), Antonín Dvořák,  Jean Sibelius, Gerald Finzi, Vítězslav Novák, and Egon Wellesz are among other composers who used the title in their work. Claude Debussy based his \"Prélude à l'après-midi d'un faune\" on a famous eclogue by Stéphane Mallarmé. Igor Stravinsky titled the second and third movements of his Duo Concertant (1932) \"Eclogue I\" and \"Eclogue II\". The middle movement of his three-movement Ode (1943) is also titled \"Eclogue\". A work that is believed to be an unfinished piano concerto by Gerald Finzi was posthumously titled \"Eclogue\" by the publisher."]}, {"page": "Music of the Isle of Man", "response": ["A notable musical episode in the Isle of Man was the imprisonment between 1940 and 1941 of many German musicians of Jewish extraction in Hutchinson Internment Camp on the island. These included Hans Gál (who composed there works for performance by the camp orchestra), Egon Wellesz, and Marjan Rawicz."]}, {"page": "Peter Sculthorpe", "response": ["He won a scholarship to study at Wadham College, Oxford, studying under Egon Wellesz. Through Wellesz he met Wilfrid Mellers, whose wide literary interests included many Australian writers, and who recommended Sculthorpe read D. H. Lawrence's Kangaroo.  This led directly to the composition of Irkanda II (String Quartet No. 5). His song-cycle Sun, based on three Lawrence poems, was dedicated to Mellers. These works were later withdrawn, but Lawrence's words returned in a revised version of Irkanda IV and in The Fifth Continent.Graeme Skinner, \"Pete and Tass; Sculthorpe and Drysdale\", ABC Radio 24 Hours, August 1997, p. 34 He left Wadham before completing his doctorate because his father was gravely ill. He wrote his first mature composition, Irkanda IV,, includes recording in his father's memory."]}, {"page": "Giuseppe Bonno", "response": ["* Egon Wellesz: Giuseppe Bonno (1710–1788). Sein Leben und seine dramatischen Werke. In: Sammelbände der Internationalen Musik-Gesellschaft 11, 1909/1911, , pp. 395–442."]}, {"page": "Symphony No. 2", "response": ["*Symphony No. 2 (Wellesz) (Op. 65 The English) by Egon Wellesz, 1947–48"]}, {"page": "List of string quartet composers", "response": ["*Egon Wellesz (1885–1974): Nine string quartets, No. 1 'in five movements' Op. 14 (1911–12) through No. 9, Op. 97 (1966) and Op. 103 Music for String Quartet."]}, {"page": "List of Austrian Jews", "response": ["* Egon Wellesz, composer"]}, {"page": "List of solo cello pieces", "response": ["*Egon Wellesz"]}, {"page": "Staatsoper Hannover", "response": ["* 1921: Die Prinzessin Girnara by Egon Wellesz"]}, {"page": "Wilfrid Mellers", "response": ["Born in Leamington, Warwickshire, Mellers was educated at the local Leamington College and later won a scholarship to Downing College, Cambridge, where he read English under F. R. Leavis. He later lodged with the Leavises for three years while pursuing a Music degree.Boris Ford, Obituary, Wilfrid Mellers, The Guardian, 19 May 2008. Mellers also took private composition lessons in Oxford from Egon WelleszMellers, Wilfrid. 'Egon Wellesz: An 80th Birthday Tribute' in The Musical Times, Vol. 106, No. 1472 (October 1965), pp. 766-767 and Edmund Rubbra.East, Leslie, revised Gordon Rumson. 'Mellers, Wilfrid (Howard)', in Grove Music Online (2001) From 1938 he taught at Dartington Hall, and in September 1940 he married Vera Muriel Hobbs. He spent the Second World War working on the land as a conscientious objector.Dickinson, Peter. 'Mellers, Wilfrid Howard' in The Oxford Dictionary of National Biography (2013)", "* Threnody for 11 strings, in memory of Egon Wellesz (1975)"]}, {"page": "List of dodecaphonic and serial compositions", "response": ["* Egon Wellesz"]}, {"page": "Grace Williams", "response": ["Williams was born in Barry, Glamorgan, the daughter of William Matthews Williams and Rose Emily Richards Williams. Both of her parents were teachers; her father was also a noted musician. She learned piano and violin as a girl, playing piano trios with her father and her brother Glyn, and accompanying her father's choir.  At the County School she began to develop her interest in composition under the guidance of the music teacher Miss Rhyda Jones, and in 1923 she won the Morfydd Owen scholarship to Cardiff University (University College of South Wales and Monmouthshire), where she studied under Professor David Evans. In 1926 she began studying at the Royal College of Music, London, where she was taught by Gordon Jacob and Ralph Vaughan Williams. Other notable female composers studying with Williams at the RCM were Elizabeth Maconchy, Dorothy Gow and Imogen Holst, the daughter of Gustav Holst. In 1930 she was awarded a travelling scholarship, and chose to study with Egon Wellesz in Vienna, where she remained till 1931."]}, {"page": "Peggy Glanville-Hicks", "response": ["Peggy Glanville Hicks, born in Melbourne, first studied composition with Fritz Hart at the Albert Street Conservatorium in Melbourne. There she also studied the piano under Waldemar Seidel. She spent the years from 1932 to 1936 as a student at the Royal College of Music in London, where she studied piano with Arthur Benjamin, conducting with Constant Lambert and Malcolm Sargent, and composition with Ralph Vaughan Williams. (She later asserted that the idea that opens Vaughan Williams' 4th Symphony was taken from her Sinfonietta for Small Orchestra (1935), and it reappears in her 1953 opera The Transposed Heads). Her teachers also included Egon Wellesz, in Vienna, and Nadia Boulanger, in Paris."]}, {"page": "Joseph Horovitz", "response": ["After completing his schooling at The City of Oxford High School Horovitz studied music and modern languages at New College, Oxford, where his teachers included R. O. Morris, Percy Scholes, Bernard Rose and Egon Wellesz.Conway, Paul. 'Joseph Horovitz at 90', in Musical Opinion, October 2016 He later attended the Royal College of Music in London, studying composition with Gordon Jacob. Horovitz then undertook a year of further study with Nadia Boulanger in Paris. His musical career began in 1950, when he became music director at the Bristol Old Vic. He was subsequently active as a conductor of ballet and opera, and toured Europe and the United States."]}, {"page": "Bill Hopkins (composer)", "response": ["Hopkins was born in Prestbury, Cheshire, and educated at Hillcrest Grammar School and Rossall School, Lancashire; his mother's disability meant she was unable to look after him, and he was raised by aunts. Studies with Luigi Nono at Dartington Summer School consolidated his interest in serialism; subsequently he studied at Oxford University with Edmund Rubbra and Egon Wellesz."]}]}}