{"wiki_id": "http://www.wikidata.org/entity/Q2134256", "itemLabel": "Raymond S. Bradley", "itemDescription": "American climatologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Raymond_S._Bradley", "wikipedia_page": {"main": "Raymond S. Bradley is a climatologist and University Distinguished Professor in the Department of Geosciences at the University of Massachusetts Amherst, where he is also research director of the Climate System Research Center. Bradley's work indicates that the warming of Earth's climate system in the twentieth century is inexplicable via natural mechanisms.", "link_mentions": [{"page": "Temperature record of the last 2,000 years", "response": ["The Michael E. Mann, Raymond S. Bradley and Malcolm K. Hughes reconstruction (, MBH98) showed global patterns of annual surface temperature, and average hemispheric temperatures back to 1400 with emphasising on uncertainties."]}, {"page": "Michael E. Mann", "response": ["As lead author of a paper produced in 1998 with co-authors Raymond S. Bradley and Malcolm K. Hughes, Mann used advanced statistical techniques to find regional variations in a hemispherical climate reconstruction covering the past 600 years. In 1999 the same team used these techniques to produce a reconstruction over the past 1,000 years (MBH99), which was dubbed the \"hockey stick graph\" because of its shape. He was one of eight lead authors of the \"Observed Climate Variability and Change\" chapter of the Intergovernmental Panel on Climate Change (IPCC) Third Scientific Assessment Report published in 2001. A graph based on the MBH99 paper was highlighted in several parts of the report and was given wide publicity. The IPCC acknowledged that his work, along with that of the many other lead authors and review editors, contributed to the award of the 2007 Nobel Peace Prize, which was won jointly by the IPCC and Al Gore.", "While still finishing his PhD research, Mann met UMass climate science professor Raymond S. Bradley and began research in collaboration with him and Park. Their research used paleoclimate proxy data from Bradley's previous work and methods Mann had developed with Park, to find oscillations in the longer proxy records. \"Global Interdecadal and Century-Scale Climate Oscillations During the Past Five Centuries\" was published by Nature in November 1995.", "From 1996 to 1998, after defending his PhD thesis at Yale, Mann carried out paleoclimatology research at the University of Massachusetts Amherst funded by a United States Department of Energy postdoctoral fellowship. He collaborated with Raymond S. Bradley and Bradley's colleague Malcolm K. Hughes, a Professor of Dendrochronology at the University of Arizona, with the aim of developing and applying an improved statistical approach to climate proxy reconstructions. He taught a course in Data Analysis and Climate Change in 1997 and became a Research Assistant Professor the following year."]}, {"page": "IPCC Third Assessment Report", "response": ["The third assessment report (TAR) prominently featured a graph labeled \"Millennial Northern Hemisphere temperature reconstruction\" based on a 1999 paper by Michael E. Mann, Raymond S. Bradley and Malcolm K. Hughes (MBH99), which has been referred to as the \"hockey stick graph\". This graph extended the similar graph in Figure 3.20 from the IPCC Second Assessment Report of 1995, and differed from a schematic in the first assessment report that lacked temperature units, but appeared to depict larger global temperature variations over the past 1000 years, and higher temperatures during the Medieval Warm Period than the mid 20th century. The schematic was not an actual plot of data, and was based on a diagram of temperatures in central England, with temperatures increased on the basis of documentary evidence of Medieval vineyards in England. Even with this increase, the maximum it showed for the Medieval Warm Period did not reach temperatures recorded in central England in 2007. The MBH99 finding was supported by cited reconstructions by , ,  and , using differing data and methods. The Jones et al. and Briffa reconstructions were overlaid with the MBH99 reconstruction in Figure 2.21 of the IPCC report."]}, {"page": "RealClimate", "response": ["* Raymond S. Bradley"]}, {"page": "Hockey stick graph", "response": ["In 1998 Michael E. Mann, Raymond S. Bradley and Malcolm K. Hughes developed new statistical techniques to produce  (MBH98), the first eigenvector-based climate field reconstruction (CFR). This showed global patterns of annual surface temperature, and included a graph of average hemispheric temperatures back to 1400 with shading emphasising that uncertainties (to two standard error limits) were much greater in earlier centuries.  independently produced a CPS reconstruction extending back for a thousand years, and  (MBH99) used the MBH98 methodology to extend their study back to 1000.", "In , a working group of climatologists including Raymond S. Bradley, Malcolm K. Hughes, Jean Jouzel, Wibjörn Karlén, Jonathan Overpeck and Tom Wigley proposed a project to improve understanding of natural climatic variations over the last two thousand years so that their effect could be allowed for when evaluating human contributions to climate change. Climate proxy temperature data was needed at seasonal or annual resolution covering a wide geographical area to provide a framework for testing the part climate forcings had played in past variations, look for cycles in climate, and find if debated climatic events such as the Little Ice Age and Medieval Warm Period were global. Reconstructions were to be made of key climate systems, starting with three climatically sensitive regions: the Asian monsoon region, the El Niño–Southern Oscillation region and the Atlantic region. Areas where more data was needed were to be identified, and there was a need for improved data exchange with computer-based archiving and translation to give researchers access to worldwide paleoclimate information.", "Archives of climate proxies were developed: in 1993 Raymond S. Bradley and Phil Jones composited historical records, tree-rings and ice cores for the Northern Hemisphere from 1400 up to the 1970s to produce a decadal reconstruction.. Like later reconstructions including the MBH \"hockey stick\" studies, the  reconstruction indicated a slow cooling trend followed by an exceptional temperature rise in the 20th century.. Their study also used the modern instrumental temperature record to evaluate how well the regions covered by proxies represented the northern hemisphere average, and compared the instrumental record with the proxy reconstruction over the same period. It concluded that the \"Little Ice Age\" period was complex, with evidence suggesting the influence of volcanic eruptions. It showed that temperatures since the 1920s were higher than earlier in the 500-year period, an indication of other factors which could most probably be attributed to human caused changes increasing levels of greenhouse gases..", "As part of his PhD research, Michael E. Mann worked with seismologist Jeffrey Park on developing statistical techniques to find long term oscillations of natural variability in the instrumental temperature record of global surface temperatures over the last 140 years;  showed patterns relating to the El Niño–Southern Oscillation, and  found what was later termed the Atlantic multidecadal oscillation. They then teamed up with Raymond S. Bradley to use these techniques on the dataset from his  study with the aim of finding long term oscillations of natural variability in global climate. The resulting reconstruction went back to 1400, and was published in November as . They were able to detect that the multiple proxies were varying in a coherent oscillatory way, indicating both the multidecadal pattern in the North Atlantic and a longer term oscillation of roughly 250 years in the surrounding region. Their study did not calibrate these proxy patterns against a quantitative temperature scale, and a new statistical approach was needed to find how they related to surface temperatures in order to reconstruct past temperature patterns.."]}, {"page": "Edward Wegman", "response": ["Ultimately, an investigation by George Mason University was completed in February 2012. The investigation found that regarding the Congressional Wegman Report, \"no misconduct was involved\"; while \"extensive paraphrasing of another work did occur, in a background section... the work was repeatedly referenced and the committee found that the paraphrasing did not constitute misconduct\". A separate university committee examining Said & Wegman's 2008 publication, based on the Wegman report, found \"that plagiarism occurred in contextual sections of the article, as a result of poor judgment for which Professor Wegman, as team leader, must bear responsibility.\" The university's reports were not made public, but it was announced that Wegman was to receive an \"official letter of reprimand\" as a consequence. The decision was decried by Raymond S. Bradley, one of the scientists whose work had been copied without attribution by Said & Wegman; Bradley argued that the findings would encourage GMU students to think it acceptable to copy work without attribution."]}, {"page": "Raymond Bradley", "response": ["#REDIRECT Raymond S. Bradley"]}, {"page": "Ray Bradley", "response": ["#REDIRECT Raymond S. Bradley"]}, {"page": "R. S. Bradley", "response": ["#REDIRECT Raymond S. Bradley"]}, {"page": "List of climate scientists", "response": ["*Raymond S. Bradley, American, historical temperatures, paleoclimatology, and climate variability."]}, {"page": "Malcolm K. Hughes", "response": [" In 1998, he was a co-author with Michael E. Mann and Raymond S. Bradley on a paper which produced the first eigenvector-based climate field reconstruction (CFR) incorporating multiple climate proxy data sets of different types and lengths into a high-resolution reconstruction of northern hemisphere temperatures. In 1999 the same team extended the method to cover 1,000 years, producing what was dubbed the hockey stick graph."]}, {"page": "Soon and Baliunas controversy", "response": ["By the late 1980s scientific findings indicated that greenhouse gases including  emissions were leading to global warming. There was increasing public and political interest, and in 1987 the World Meteorological Organization pressed for an international scientific panel to assess the topic. The United States Reagan administration, worried about political influence of scientists, successfully lobbied for the 1988 formation of the Intergovernmental Panel on Climate Change to provide reports subject to detailed approval by government delegates. The IPCC First Assessment Report included a \"schematic diagram\" of global temperature variations over the last thousand years which has been traced to a graph based loosely on Hubert Lamb's 1965 paper. pp. 34, 36  The IPCC Second Assessment Report (SAR) of 1996 featured a graph of an early northern hemisphere reconstruction by Raymond S. Bradley and Phil Jones, and noted the 1994 reconstruction by Hughes and Henry F. Diaz questioning how widespread the Medieval Warm Period had been at any one time. pp. 173–176, fig 3.20", "The media requested opinions from climate scientists and paleoclimatologists familiar with the issues underlying the Soon and Baliunas papers, and to help with information Mann and Michael Oppenheimer drafted and circulated privately a memorandum providing detailed guidance on the topic. They stated \"Nothing in the paper undermines in any way the conclusion of earlier studies that the average temperature of the late twentieth century in the Northern Hemisphere was anomalous against the background of the past millennium\". Colleagues receiving these requests from the media included Tom Wigley, Philip Jones and Raymond S. Bradley."]}, {"page": "The Hockey Stick Illusion", "response": ["The Hockey Stick Illusion first outlines a brief history of climate change science with particular emphasis on the description of the Medieval Warm Period in the first IPCC report in 1990, with its inclusion of a schematic based on central England temperatures which Montford describes as a representation of common knowledge at that time. He then argues that a need to overturn this \"well-embedded paradigm\" was met by the 1998 publication by Michael E. Mann, Raymond S. Bradley and Malcolm K. Hughes' of their \"hockey stick graph\" in Nature. The book describes how Steve McIntyre first became interested in the graph in 2002 and the difficulties he found in replicating the results of \"MBH98\" (the original 1998 study) using available datasets, and further data which Mann gave him on request. It details the publication of a paper by McIntyre and Ross McKitrick in 2003 which criticized MBH98, and follows with Mann and his associates' rebuttals. The book recounts reactions to the dispute over the graph, including investigations by the National Academy of Sciences and Edward Wegman and hearings held on the graph before the United States House Energy Subcommittee on Oversight and Investigations. Efforts taken by other scientists to verify Mann's work and McIntyre's and others' responses to those efforts are described."]}, {"page": "Attorney General of Virginia's climate science investigation", "response": ["While an adjunct assistant professor at the University of Massachusetts Amherst, Michael E. Mann co-authored with Raymond S. Bradley and Malcolm K. Hughes two reconstructions of the past temperatures in the northern hemisphere: MBH98 and MBH99. The latter extended back 1,000 years and was nicknamed the \"hockey stick graph\". In 1999 Mann joined the University of Virginia as an assistant professor. A version of MBH99 featured prominently in the 2001 IPCC Third Assessment Report, and attacks on the graph by those opposing action on global warming became politically prominent. The validity of the research was confirmed by the National Academy of Sciences. In 2005 Mann moved on to a position as an associate professor at Pennsylvania State University. The Climatic Research Unit email controversy which began in November 2009 brought renewed scrutiny, and allegations of scientific malpractice. An investigation by Pennsylvania State University determined on 3 February 2010 that there was no evidence of misconduct by Mann.\"Oxburgh Report Clears Controversial Climate Research Unit\" (Science Magazine, April 14, 2010)"]}, {"page": "Hans Oeschger Medal", "response": ["| valign=\"top\"| Raymond S. Bradley"]}, {"page": "The Hockey Stick and the Climate Wars", "response": ["The Hockey Stick and the Climate Wars: Dispatches from the Front Lines is a 2012 book about climate change by the American  climatologist and geophysicist   Michael E. Mann. In the book Mann describes how he became a researcher investigating the temperature record of the past 1000 years and was lead author, with Raymond S. Bradley and Malcolm K. Hughes, on the 1999 reconstruction that was the first to be dubbed the hockey stick graph. He concisely explains the basics of climate science including statistical methodology dealing with paleoclimate proxy data, and examines the tactics which opponents of action on climate change use to distort the science and attack the reputations of climate scientists. The book describes both this controversy and the broader context of skepticism in science and contrarians rejecting evidence of human influence on climate."]}, {"page": "Wegman Report", "response": ["In 1998 Michael E. Mann, Raymond S. Bradley and Malcolm K. Hughes developed new statistical techniques to produce  (MBH98), which showed global patterns of annual surface temperature, and included a graph of average hemispheric temperatures back to 1400 with shading emphasising that uncertainties (to two standard error limits) were much greater in earlier centuries.  independently produced a CPS reconstruction extending back for a thousand years, and  (MBH99) used the MBH98 methodology to extend their study back to 1000., 2.3.2.2 Multi-proxy synthesis of recent temperature change . The term hockey stick was coined by the climatologist Jerry Mahlman, to describe the pattern this showed, envisaging a graph that is relatively flat to 1900 as forming an Ice hockey stick's \"shaft\", followed by a sharp increase corresponding to the \"blade\"... ", "Wegman's institution, George Mason University, confirmed in October 2010 that they were investigating misconduct charges, following a March 2010 formal complaint by Raymond S. Bradley alleging  plagiarism and fabrications in the Wegman Report.  A 250-page study by computer scientist John Mashey, posted on the \"Deep Climate\" website, claims that 35 of the 91 pages in the Wegman Report were plagiarized, and \"often injected with errors, bias and changes of meaning.\" Wegman responded that he was \"very well aware of the report\", but at the university's request would not comment further until all issues were settled.; . Reviews by outside experts contacted by USA Today found plagiarism from textbooks which was obvious and inappropriate; the social network analysis section had also been partly copied from Wikipedia. Wegman said there was \"speculation and conspiracy theory\" in John Mashey's analysis, and said that \"[t]hese attacks are unprecedented in my 42 years as an academic and scholar.\" He stated that the Wegman Report never \"intended to take intellectual credit for any aspect of paleoclimate reconstruction science or for any original research aspect of social network analysis.\" (USA Today)."]}, {"page": "Bradley, Raymond", "response": ["#REDIRECT Raymond S. Bradley"]}]}}