{"wiki_id": "http://www.wikidata.org/entity/Q2133840", "itemLabel": "Nicholas Farrell", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicholas_Farrell", "wikipedia_page": {"main": "Nicholas C. Frost (born 1955), known professionally as Nicholas Farrell, is an English stage, film, and television actor.", "link_mentions": [{"page": "Hugh Dowding", "response": ["In the 2018 film Hurricane: 303 Squadron, Dowding was played by Nicholas Farrell."]}, {"page": "Pearl Harbor (film)", "response": ["* Nicholas Farrell as a Royal Air Force Squadron leader and combat pilot commanding the Eagle Squadron."]}, {"page": "Airey Neave", "response": ["Neave was portrayed by Geoffrey Pounsett in Nuremberg (2000), Dermot Crowley in Margaret (2009), Nicholas Farrell in The Iron Lady (2011) and Tim McInnerny in Utopia (2014)."]}, {"page": "Hamlet (1996 film)", "response": ["Hamlet is a 1996 film adaptation of William Shakespeare's play Hamlet, adapted and directed by Kenneth Branagh, who also stars as Prince Hamlet. The film also features Derek Jacobi as King Claudius, Julie Christie as Queen Gertrude, Kate Winslet as Ophelia, Michael Maloney as Laertes, Richard Briers as Polonius, and Nicholas Farrell as Horatio. Other cast members include Robin Williams, Gérard Depardieu, Jack Lemmon, Billy Crystal, Rufus Sewell, Charlton Heston, Richard Attenborough, Judi Dench, John Gielgud and Ken Dodd.", "*Nicholas Farrell as Horatio, a good friend of Hamlet whom he met while attending Wittenberg University."]}, {"page": "Kenneth Branagh", "response": ["Branagh has frequently reused actors, including Brian Blessed, Judi Dench, Robin Williams, Derek Jacobi, Nonso Anozie, Nicholas Farrell, Richard Briers, Stellan Skarsgård, Helena Bonham Carter, John Gielgud, Josh Gad, Ian Holm, and Emma Thompson. He also works frequently with composer Patrick Doyle."]}, {"page": "Strong Poison", "response": ["| 2 Oct 1999              || Simon Russell Beale || Emma Fielding       || Nicholas Farrell    || Michael Bakewell"]}, {"page": "2001 in film", "response": ["| Pearl Harbor || Touchstone Pictures / Jerry Bruckheimer Films || Michael Bay (director); Randall Wallace (screenplay); Ben Affleck, Josh Hartnett, Kate Beckinsale, Cuba Gooding Jr., Tom Sizemore, Jon Voight, Colm Feore, Mako, Alec Baldwin, Jennifer Garner, Ewen Bremner, William Fichtner, Andrew Bryniarski, Jaime King, Catherine Kellner, William Lee Scott, Greg Zola, Michael Shannon, Matthew Davis, Dan Aykroyd, Kim Coates, Sara Rue, Tony Curran, Nicholas Farrell, Steve Rankin, John Fujioka, Leland Orser, Ted McGinley, Brandon Lozano, Eric Christian Olsen, Sean Faris, Cary-Hiroyuki Tagawa, Scott Wilson, Graham Beckel, Tom Everett, Tomas Arana, Peter Firth, Glenn Morshower, Yuji Okumoto, Madison Mason, Michael Shamus Wiles, Seth Sakai, Jesse James, Reiley McClendon, Brian Haley, David Hornsby, Randy Oglesby, Ping Wu, Beth Grant, Sung Kang, Raphael Sbarge, Marty Belafsky, Michael Milhoan, Nicholas Downs, Tim Choate, John Diehl, Ron Harper, Scott Wiper, John Pyper-Ferguson, Sean Gunn, David Kaufman, Lindsey Ginter, Pat Healy, Thomas Wilson Brown, Chad Morgan, James Saito, Frederick Koehler || Action, Drama || Live action"]}, {"page": "Royal National Theatre", "response": ["*Dinner by Moira Buffini, with Harriet Walter, Nicholas Farrell and Catherine McCormack, directed by Fiona Buffini (2002) "]}, {"page": "Treasure Island", "response": ["* A 2013 Big Finish Productions audiobook adaptation of Treasure Island was written and directed by Barnaby Edwards and starred Tom Baker as Long John Silver, Nicholas Farrell as the Narrator, and Edward Holtom as Jim Hawkins."]}, {"page": "1995 in film", "response": ["| Othello || Columbia Pictures / Castle Rock Entertainment || Oliver Parker (director/screenplay); Laurence Fishburne, Irène Jacob, Kenneth Branagh, Nathaniel Parker, Michael Maloney, Anna Patrick, Nicholas Farrell, Indra Ové, Michael Sheen, André Oumansky, Philip Locke, John Savident, Gabriele Ferzetti, Pierre Vaneck || Drama || Live action"]}, {"page": "1996 in film", "response": ["| A Midwinter's Tale || Rank Film Distributors / Castle Rock Entertainment || Kenneth Branagh (director/screenplay); Michael Maloney, Richard Briers, Hetta Chamley, Joan Collins, Nicholas Farrell, Mark Hadfield, Gerard Horan, Celia Imrie, Jennifer Saunders, Julia Sawalha, John Sessions, Ann Davies, James D. White, Robert Hines, Allie Byrne, Adrian Scarborough, Brian Pettifer, Patrick Doyle, Shaun Prendergast, Carol Starks, Edward Jewesbury, Katy Carmichael, Paul Randles || Romance, Comedy || Live action", "| Twelfth Night || Fine Line Features || Trevor Nunn (director/screenplay); Helena Bonham Carter, Richard E. Grant, Nigel Hawthorne, Ben Kingsley, Mel Smith, Imelda Staunton, Toby Stephens, Imogen Stubbs, Steven Mackintosh, Peter Gunn, Nicholas Farrell || Comedy || Live action", "| Hamlet || Columbia Pictures / Castle Rock Entertainment || Kenneth Branagh (director/screenplay); Kenneth Branagh, Julie Christie, Billy Crystal, Gerard Depardieu, Charlton Heston, Derek Jacobi, Jack Lemmon, Rufus Sewell, Robin Williams, Kate Winslet, Timothy Spall, Rosemary Harris, Richard Attenborough, John Gielgud, Judi Dench, Reece Dinsdale, Richard Briers, Nicholas Farrell, Michael Maloney, Ian McElhinney, Ray Fearon, Brian Blessed, Simon Russell Beale, Don Warrington, Ravil Isyanov, John Mills, Ken Dodd, John Spencer-Churchill, 11th Duke of Marlborough || Drama || Live action"]}, {"page": "Agatha Christie's Poirot", "response": ["!scope=\"row\" rowspan=\"2\"| Nicholas Farrell"]}, {"page": "1984 in film", "response": ["| Greystoke: The Legend of Tarzan, Lord of the Apes || Warner Bros. || Hugh Hudson (director); P.H. Vazak, Michael Austin (screenplay); Ralph Richardson, Ian Holm, James Fox, Christopher Lambert, Andie MacDowell, Cheryl Campbell, Paul Geoffrey, Ian Charleson, Nigel Davenport, Nicholas Farrell, Richard Griffiths, Hilton McRae, David Suchet, John Wells, Paul Brooke, Ailsa Berk, Mak Wilson, Emil Abossolo-Mbo, Deep Roy, Tali McGregor, Peter Kyriakou, Danny Potts, Eric Langlois, Peter Elliott, John Alexander, Christopher Beck || Adventure || Live action"]}, {"page": "1981 in film", "response": ["| Chariots of Fire || Warner Bros. / The Ladd Company / Allied Stars Ltd / Goldcrest Films / Enigma Productions || Hugh Hudson (director); Colin Welland (screenplay); Ben Cross, Ian Charleson, Nigel Havers, Cheryl Campbell, Alice Krige, Lindsay Anderson, Dennis Christopher, Nigel Davenport, Brad Davis, Peter Egan, John Gielgud, Ian Holm, Patrick Magee, Nicholas Farrell, Struan Rodger, David Yelland, Daniel Gerroll, Richard Griffiths || Historical, Drama || Live action"]}, {"page": "The Browning Version (play)", "response": ["The Theatre Royal Bath put the play on in 2009 in a double bill with Chekhov's one-act play Swansong, both starring Peter Bowles.Nightingale, Benedict. \"Elegance that defies shallow expectation, twice\", The Times, 15 July 2009  A production at the Chichester Festival Theatre (alongside South Downs, a new play written in response to it by David Hare) marked Rattigan's centenary in 2011.Spencer, Charles. \"Companion piece of cruelty and kindness\", The Daily Telegraph, 16 September 2011 The same double production of The Browning Version and South Downs ran at London's Harold Pinter Theatre from April through July 2012 and starred Nicholas Farrell as Crocker-Harris and Anna Chancellor as Millie."]}, {"page": "The Jewel in the Crown (TV series)", "response": ["* Nicholas Farrell as Edward \"Teddie\" Bingham"]}, {"page": "The A.B.C. Murders", "response": ["In 1992, the novel was adapted for television as part of ITV's Agatha Christie's Poirot, and was first aired in the UK on 5 January 1992. It starred David Suchet as Hercule Poirot, Hugh Fraser as Captain Hastings, and Philip Jackson as Chief Inspector Japp, with its guest stars including Donald Sumpter as Alexander Bonaparte Cust, Donald Douglas as Franklin Clarke, Nicholas Farrell as Donald Fraser, and Pippa Guard as Megan Barnard."]}, {"page": "Women in Love", "response": ["BBC Radio 4 broadcast Women in Love as a four-part serial in 1996, dramatised by Elaine Feinstein and starring Stella Gonet as Gudrun, Clare Holman as Ursula, Douglas Hodge as Gerald and Nicholas Farrell as Rupert. It has been repeated several times on BBC Radio 4 Extra, most recently in December 2020."]}, {"page": "Bristol Old Vic Theatre School", "response": ["* Nicholas Farrell – (Chariots of Fire, Pearl Harbor, The Iron Lady)"]}, {"page": "Stella Gonet", "response": ["Gonet married English actor Nicholas Farrell in 2005. The couple co-starred in an episode of Roman Mysteries as Queen Berenice of Judea and Emperor Titus, and as Mr. and Mrs. Musgrove in ITV's 2007 production of Jane Austen's Persuasion, and they both participated in a 2001 Shakespeare's Richard III audiobook. The couple have a daughter, Natasha, born in 2000."]}, {"page": "In the Bleak Midwinter (film)", "response": ["* Nicholas Farrell as Tom Newman (Laertes, Fortinbras, and messengers), a vain, self-righteous method actor who foists his values on everyone else and attempts to distinguish his many characters with a variety of outrageous accents."]}, {"page": "The Miser", "response": ["* On 29 September 1986, BBC Radio 3 broadcast an adaptation using a translation by Miles Malleson and directed by Peter Kavanaugh, with Michael Hordern as Harpagon, Eleanor Bron as Frosine, Jonathan Tafler as Cleante, Nicholas Farrell as Valere, Julia Swift as Elise, Elaine Claxton as Marianne and Shaun Prendergast as La Fleche."]}, {"page": "Almeida Theatre", "response": ["* The Wild Duck by Henrik Ibsen, directed by Robert Icke, starring Nicholas Farrell and Lyndsey Marshal (2018)"]}, {"page": "Greystoke: The Legend of Tarzan, Lord of the Apes", "response": ["* Nicholas Farrell – Sir Hugh Belcher"]}, {"page": "The Listerdale Mystery", "response": ["Nicholas Farrell as Edward Robinson"]}, {"page": "Belinda Lang", "response": ["Lang appeared with Nicholas Farrell and David Robb in Alan Bennett's \"Single Spies\" play during 2016. Her other theatre credits include Present Laughter (1981), The Clandestine Marriage (1984), Dead Funny (1995), Blithe Spirit (1997), and Hay Fever (2006).  BBC Proms 2017 \"Aunt Eller\" in Oklahoma with the John Wilson Orchestra (2017)."]}, {"page": "Sharpe's Regiment", "response": ["The novel was adapted as the opening episode of the fourth season of the Sharpe television series. The adaptation introduced Abigail Cruttenden as Jane and Caroline Langrishe as Lady Anne and guest starred Nicholas Farrell as Fenner, Mark Lambert as Girdwood, Julian Fellowes as the Prince Regent and Julie T. Wallace as Maggie Joyce. It also introduced James Laurenson as an original character, Major-General Ross, who took on the role given to Nairn in the book. The adaptation was faithful to the novel but omitted D'Alembord and Price along with various scenes, including much of the aftermath of the Hyde Park sequence."]}, {"page": "Driving Lessons", "response": ["* Nicholas Farrell as Robert Marshall"]}, {"page": "The Jury (TV serial)", "response": ["*Nicholas Farrell as Jeremy Crawford, Juror #5"]}, {"page": "Lipstick on Your Collar (TV series)", "response": ["* Nicholas Farrell as Maj. Church"]}, {"page": "Eyre Crowe", "response": ["In the 2014 BBC mini-series 37 Days, Crowe is portrayed by actor Nicholas Farrell. Crowe is depicted as a competent and shrewd administrator but one who is exasperated and confused by the Foreign Secretary's (Sir Edward Grey; portrayed by Ian McDiarmid) superior diplomatic prowess. The narrator of the series, a Second Division Clerk in the Foreign Office (portrayed by actor James McArdle), also describes Crowe as: \"German born, educated in Berlin, but...more British than any one of us\"."]}, {"page": "Torchwood", "response": ["Children of Earth featured a largely new supporting cast for the duration of the five-episode serial, such as Permanent Secretary John Frobisher (Peter Capaldi), Clem McDonald (Paul Copley), Frobisher's personal assistant Bridget Spears (Susan Brown), Prime Minister Brian Green (Nicholas Farrell), ruthless operative Agent Johnson (Liz May Brice), Jack's middle-aged daughter Alice (Lucy Cohu), her son Steven (Bear McCausland) and Ianto's sister Rhiannon (Katy Wix). Cush Jumbo was cast as Frobisher's personal assistant Lois Habiba; Habiba was written into the story after Agyeman was unavailable to return to portray Martha.", "Series three is only five episodes long, and was broadcast over consecutive nights as a single story, Children of Earth (2009). The series focuses on the consequences of appeasement policy; having been given 12 children as a tribute in 1965, aliens called the 4-5-6 arrive in the present demanding a greater share of the Earth's child population. For the first time in the series, the majority of the action takes place outside Wales; Torchwood's base of operations is destroyed in the premiere and the remainder of the Torchwood team have relocated to London. Kai Owen is promoted to a regular cast member, while a new cast of political figures are introduced alongside family members of main characters Jack and Ianto. Nicholas Farrell plays Prime Minister Brian Green whose intent is to give in rather than fight the 4–5–6, leaving Torchwood to stand against the government and the aliens. David-Lloyd departs the cast when Ianto is killed by the aliens in episode four, leaving Jack distraught. In the series closing scenes, with Gwen pregnant and Jack abandoning Earth, Torchwood effectively disbands."]}, {"page": "Shakespeare: The Animated Tales", "response": ["* Nicholas Farrell as Hamlet"]}, {"page": "Bloody Sunday (film)", "response": ["*Nicholas Farrell as Brigadier Patrick Maclellan"]}, {"page": "Matador (Danish TV series)", "response": ["| Jim Donaldson || 21 || 1 || Nicholas Farrell"]}, {"page": "Mansfield Park", "response": ["*1983: Mansfield Park, BBC series directed by David Giles, starring Sylvestra Le Touzel as Fanny Price, Nicholas Farrell as Edmund Bertram and Anna Massey as Mrs Norris."]}, {"page": "Dinner (play)", "response": ["*Nicholas Farrell - Lars"]}, {"page": "Plunkett & Macleane", "response": ["* Nicholas Farrell as M.P.'s Secretary"]}, {"page": "Harriet Walter", "response": ["* 2002 Royal National Theatre Paige in Dinner by Moira Buffini, co-starring Nicholas Farrell and Catherine McCormack"]}, {"page": "Richard Hope (actor)", "response": ["In 1987, he played Salto in Handmade Films thriller Bellman and True, written and directed by Richard Loncraine, and Hull City A.F.C. fan Malcolm in Mark Herman’s comedy See You At Wembley, Frankie Walsh which won the Student Academy Award. In Piece of Cake (TV series) directed by Ian Toynton he was ‘Skull’ Skelton and he played Mortimer Tundish in both series of  Debbie Horsfield's comedy drama The Riff Raff Element, with Celia Imrie and Nicholas Farrell."]}, {"page": "Sex, Chips & Rock n' Roll", "response": ["* Howard Brookes – Nicholas Farrell"]}, {"page": "List of biographical films", "response": ["||Nicholas Farrell"]}]}}