{"wiki_id": "http://www.wikidata.org/entity/Q2149595", "itemLabel": "Richard Turnbull", "itemDescription": "British colonial governor and the last governor of the British mandate of Tanganyika from 1958–1961", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Turnbull_(colonial_administrator)", "wikipedia_page": {"main": "Sir Richard Gordon Turnbull, GCMG (7 July 1909 – 21 December 1998) was a British colonial governor and the last governor of the British mandate of Tanganyika from 1958 to 1961. Following the country's independence, he was governor-general from 9 December 1961 to 9 December 1962.", "link_mentions": [{"page": "Federation of South Arabia", "response": ["* Sir Richard Turnbull (21 December 1964 – 22 May 1967)"]}, {"page": "No. 43 Squadron RAF", "response": ["In January 1965, sorties increased with an attack being carried out by eight Hunters on the 16 January against a dissident camp and supply dump in the Wādī Yahar region. More strikes were carried out on the 25th, 26th and 29th of January. On 11 February, the squadron carried out an 15-ship flypast in the form of a 78 to celebrate No. 78 Squadron being presented its squadron standard. Sorties picked back up in March, with 94 being flown in total, with 80 of these being a response to MiGs from the United Arab Republic Air Force who were entering into Aden's airspace. On 8 May, a pair of Hunters carried out a strike on a dissident position near Al-Khuraybah, with another pair attacking a fort destroying an arms dump in the process. Between 10 to 25 June, the squadron deployed to RAF Masirah to undergo a training exercise which included high level reconnaissance sorties over Sharjah, United Arab Emirates, and Muscat, Oman, as well as practising a hypothetical war situation. On 1 September 1965, 13 sorties were flown which saw multiple strikes being carried out against dissidents in the Jabal Khuder region. Operations were briefly suspended for a month on 25 September after the constitution of the Aden Protectorate was suspended by the High Commissioner of Aden Sir Richard Turnbull. The squadron ended the year with a strike being conducted on 31 December in the Wādī Taym area in support of 45 Commando who requested assistance. "]}, {"page": "Sir Richard Gordon Turnbull", "response": ["#REDIRECT Richard Turnbull (colonial administrator)"]}, {"page": "Richard Gordon Turnbull", "response": ["#REDIRECT Richard Turnbull (colonial administrator)"]}, {"page": "Sir Richard Turnbull", "response": ["#REDIRECT Richard Turnbull (colonial administrator)"]}, {"page": "List of British colonial administrators of Aden", "response": ["| Sir Richard Turnbull"]}, {"page": "Queen of Tanganyika", "response": ["Prince Philip, Duke of Edinburgh represented the Queen of Tanganyika at the independence celebrations. On 9 December 1961, the Duke presented Tanganyika's instrument of independence to Julius Nyerere, who then became the Prime Minister of independent Tanganyika. Dar es Salaam was made a city, when the Duke presented the Royal Charter and Letters Patent. He was then made the first Freeman of Dar es Salaam, and afterwards told the gathering: \"A new mantle of dignity and responsibility has fallen on the citizens of Dar es Salaam\". On 11 December, the Duke formally opened the first session of the parliament of independent Tanganyika, on behalf of the Queen, before an assembly of people and diplomats, at a ceremony of pomp and colour. Richard Turnbull, the Governor-General, addressed the Duke, asking him to open Parliament by reading the Speech from the Throne."]}, {"page": "List of heads of state of Tanzania", "response": ["The governor-general was the representative of the monarch in Tanganyika and exercised most of the powers of the monarch. The governor-general was appointed for an indefinite term, serving at the pleasure of the monarch. Since Tanganyika was granted independence by the Tanganyika Independence Act 1961, rather than being first established as a semi-autonomous dominion and later promoted to independence as defined by the Statute of Westminster 1931, the governor-general was to be always appointed solely on the advice of the Cabinet of Tanganyika without the involvement of the British government. As Tanganyika became a republic before Richard Turnbull, the former colonial governor, was replaced, this has never happened. In the event of a vacancy the chief justice would have served as the officer administering the government.", "| Sir Richard Turnbull"]}, {"page": "John Mwakangale", "response": ["In 1958, Mwakangale was one of the few African leaders who were elected to the Legislative Council (LEGCO), a colonial parliament dominated by the British colonial rulers led by  the British governor of Tanganyika. The governor during that time was Sir Edward Twining.  He served as governor from 1949 to 1958. He was succeeded by Sir Richard Turnbull in July 1958. Turnbull was the last governor and relinquished power to Julius Nyerere on independence day, 9 December 1961. Nyerere became the first  prime minister of the newly independent nation of Tanganyika.Mwakikagile, Godfrey, Nyerere and Africa: End of an Era, op. cit., pp. 112:"]}, {"page": "Deaths in December 1998", "response": ["*Richard Turnbull, 89, British colonial governor."]}, {"page": "List of governors of dependent territories in the 20th century", "response": ["::*Richard Turnbull, High commissioner (1964–1967)\t"]}, {"page": "Richard Turnbull (colonial governor)", "response": ["#REDIRECT Richard Turnbull (colonial administrator)"]}, {"page": "Ralph Windham", "response": ["Sir Ralph acted as Governor-General whenever Richard Turnbull had to leave the country."]}, {"page": "Richard Turnbull", "response": ["Richard Turnbull may refer to:", "* Richard Turnbull (theologian)", "* Richard Turnbull (colonial administrator)", "* Richard Turnbull (politician)"]}]}}