{"wiki_id": "http://www.wikidata.org/entity/Q21402763", "itemLabel": "Silvia Vignolini", "itemDescription": "Italian physicist and materials scientist", "wikipedia_url": "https://en.wikipedia.org/wiki/Silvia_Vignolini", "wikipedia_page": {"main": "Silvia Vignolini (born 1981) is an Italian physicist who is Professor of Chemistry and Bio-materials in the Yusuf Hamied Department of Chemistry at the University of Cambridge. Her research investigates natural photonics structures, the self-assembly of cellulose and light propagation through complex structures. She was awarded the KINGFA young investigator award by the American Chemical Society and the Gibson-Fawcett Award in 2018.", "link_mentions": [{"page": "Philip Leverhulme Prize", "response": ["* Chemistry: Artem Bakulin, Thomas Bennett, Kim Jelfs, Daniele Leonori, Silvia Vignolini"]}, {"page": "Alan Schoen", "response": ["Alan Schoen is best known for discovering (while working at NASA) a minimal surface that he named the gyroid.Schoen, Alan H. (1970). \"Infinite periodic minimal surfaces without self-intersections.\" https://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/19700020472_1970020472.pdfSchoen, A.H.: Infinite Regular Warped Polyhedra and Infinite Periodic Minimal Surfaces. Not. Amer. Math. Soc., vol. 15, 1968, p. 727.Schoen, A.H.: A Fifth Intersection-Free Infinite Periodic Minimal Surface of Cubic Symmetry. Not. Amer. Math. Soc., vol. 16, 1969, p. 519. The name stems from the impression in the gyroid's structure that each continuous channel in the array, along different principal crystallographic axes, has connections to additional intersecting channels, which “gyrate” along the channel length.James A. Dolan, Bodo D. Wilts, Silvia Vignolini, Jeremy J. Baumberg, Ullrich Steiner, and Timothy D. Wilkinson. Optical Properties of Gyroid Structured Materials: From Photonic Crystals to Metamaterials. Adv. Optical Mater. 2014, DOI: 10.1002/adom.201400333 https://www.np.phy.cam.ac.uk/uploads/2014-uploads/AdvOptMat14_gyroidreview.pdf The gyroid has become popular among scientists as more and more new occurrences of it in nature are being discovered.Bill Steele. Nanomanufactured polymer film could lead to lower-cost solar cells. Cornell Chronicle. November 24, 2008. http://www.news.cornell.edu/stories/2008/11/new-route-self-assembling-low-cost-solar-cellsJohn Baez. This Week's Finds in Mathematical Physics (Week 225). December 24, 2005. http://math.ucr.edu/home/baez/week225.htmlButterfly Wing Colors Come From Space-Age Structures. Brandon Keim Science. 06.14.10. https://www.wired.com/wiredscience/2010/06/butterfly-colors"]}, {"page": "Gibson-Fawcett Award", "response": ["| Silvia Vignolini"]}]}}