{"wiki_id": "http://www.wikidata.org/entity/Q21402745", "itemLabel": "Louise Heathwaite", "itemDescription": "British hydrochemist", "wikipedia_url": "https://en.wikipedia.org/wiki/Louise_Heathwaite", "wikipedia_page": {"main": "Professor Louise Heathwaite, CBE FRSE FRSB is a British environmental scientist. She is Distinguished Professor in the Lancaster Environment Centre at Lancaster University and Pro-Vice-Chancellor of Research and Enterprise. She is a hydrochemist working on diffuse environmental pollution, especially the pathways of nitrogen and phosphorus loss from agricultural land to water.   \nIn 2015, she was elected a Fellow of the Royal Society of Edinburgh in recognition of the distinguished contribution she has made to catchment science and to science-policy engagement.In July 2021 Heathwaite accepted a ministerial appointment as Chair of the Department for Environment, Food and Rural Affairs (Defra) Science Advisory Council, which provides expert advice to the ’Defra Chief Scientific Adviser and helps guide Defra’s scientific priorities and planning. She was Chief Scientific Adviser to the Scottish Government on Rural Affairs, Food and the Environment from 2012-2017 and was a Council member (ex-officio) on the Natural Environment Research Council (NERC) from 2012-2017, prior to being appointed to the new UK Research and Innovation (UKRI) NERC Council from 2018-2021. Heathwaite served on Defra's Science Advisory Council from 2011-17.\nIn 2017 Heathwaite became the first woman to be elected President of the Freshwater Biological Association (FBA). In 2004 she was elected as Vice-President of the International Association of Hydrological Sciences (IAHS). \nHeathwaite was awarded a CBE in the Queen's Birthday honours 2018 for services to scientific research and scientific advice to government. On receiving the honour she said, “I love trying to work out what makes things tick and working independently, so research was the only career for me. More so, I want science to be useful and I have been very lucky to have had the opportunity to show how science can help with government policy.”", "link_mentions": [{"page": "Freshwater Biological Association", "response": ["Presidents have included Sir John Gray (1918–2011) from 1983 to 1987, Sir Frederick George Thomas Holliday (1935–2016) from 1995 to 2002, Sir Martin Holgate (b.1931) from 2002 to 2017, and Professor Louise Heathwaite from 2017."]}, {"page": "Lancaster Environment Centre", "response": ["Led by co-directors Professor Louise Heathwaite and Professor Phil Haygarth, the Centre seeks to deliver cross-disciplinary science in water-related research areas. Faculty and Research staff in the Centre undertake research to develop scientific tools and techniques to enable the uncertainties associated with land and water use problems to be addressed in the development of sustainable water management strategies."]}, {"page": "2018 Birthday Honours", "response": ["* Professor Ann Louise Heathwaite. Professor, Land and Water Science, Lancaster Environment Centre. For services to Scientific Research and Scientific Advice to Government. "]}]}}