{"wiki_id": "http://www.wikidata.org/entity/Q2149741", "itemLabel": "Richard Hartley", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Hartley_(composer)", "wikipedia_page": {"main": "Richard Hartley is an English composer, best known for his work on The Rocky Horror Show. He grew up in Holmfirth.", "link_mentions": [{"page": "The Rocky Horror Picture Show", "response": ["O'Brien showed a portion of the unfinished script to Australian director Jim Sharman, who decided to direct it at the small experimental space Upstairs at the Royal Court Theatre, Sloane Square, Chelsea, London, which was used as a project space for new work. O'Brien had appeared briefly in a stage production of Andrew Lloyd Webber's Jesus Christ Superstar, directed by Sharman, and the two also worked together in Sam Shepard's The Unseen Hand. Sharman would bring in production designer Brian Thomson. The original creative team was then rounded out by costume designer Sue Blane, musical director Richard Hartley, and stage producer Michael White, who was brought in to produce. As the musical went into rehearsal, the working title, They Came from Denton High, was changed just before previews at the suggestion of Sharman to The Rocky Horror Show.", "The soundtrack was released in 1975 by Ode Records and produced by English composer Richard Hartley. The album peaked at No. 49 on the U.S. Billboard 200 in 1978. It reached No. 12 on the Australian albums chart and No. 11 on the New Zealand albums chart. The album is described as the \"definitive version of the [Rocky Horror] score\"."]}, {"page": "The Rocky Horror Show", "response": ["The show was produced and directed by Jim Sharman. The original London production of the musical premiered at the Royal Court Theatre (Upstairs) on 19 June 1973 (after two previews on 16 and 18 June 1973). It later moved to several other locations in London and closed on 13 September 1980. The show ran for a total of 2,960 performances and won the 1973 Evening Standard Theatre Award for Best Musical. Songs in the musical include \"Time Warp\" (co-written by O'Brien and Richard Hartley), while the costumes were designed by Sue Blane. Its 1974 debut in the US in Los Angeles had a successful nine-month run, but its 1975 Broadway debut at the Belasco Theatre lasted only three previews and forty-five showings, despite earning one Tony nomination and three Drama Desk nominations. Various international productions have since spanned across six continents as well as West End and Broadway revivals and eight UK tours. Actor Tim Curry, who originated the role of Dr. Frank-N-Furter in the original London production, became particularly associated with the musical.", "The original creative team was then rounded out by costume designer Sue Blane and musical director Richard Hartley, although Pete Moss would later take over as musical director. Michael White was also brought in to produce Rocky Horror. As the musical went into rehearsal, the working title for it became They Came from Denton High, but it was changed just before previews at the suggestion of Sharman to The Rocky Horror Show."]}, {"page": "Time Warp (song)", "response": ["Category:Songs with music by Richard Hartley (composer)"]}, {"page": "List of film score composers", "response": ["* Richard Hartley (born 1944)"]}, {"page": "Richard O'Brien", "response": ["O'Brien continued writing musicals with arranger Richard Hartley, including: T. Zee (1976), Disaster (1978), The Stripper (1982 – based on the Carter Brown novel and produced in Australia), and Top People (1984). O'Brien and Hartley also provided three songs for the film The Return of Captain Invincible (1983), starring Alan Arkin. O'Brien wrote his one-man revue Disgracefully Yours (1985) singing as Mephistopheles Smith."]}, {"page": "5th Golden Raspberry Awards", "response": ["**Sheena, music by Richard Hartley"]}, {"page": "Deanna Durbin", "response": ["In song, Durbin's name found its way into the introduction to a song written by satirical writer Tom Lehrer in 1965. Prior to singing \"Whatever Became of Hubert?\", Lehrer said that Vice President Hubert Humphrey had been relegated to \"those where-are-they-now columns: Whatever became of Deanna Durbin, and Hubert Humphrey, and so on.\" She is also referenced in the WWII novelty song \"Peggy the Pin-up Girl\". Interestingly, the lyrics pair her name with her first co-star Judy Garland: \"Even a voice that's so disturbin' / Like Judy Garland or Miss Durbin / Can't compare to my pin-up queen\". In Philippe Mora's film The Return of Captain Invincible (1983), Christopher Lee sings a song called \"Name Your Poison,\" written by Richard O'Brien and Richard Hartley, which has the line, \"Think of young Deanna Durbin / And how she sang on rum and bourbon.\""]}, {"page": "Mindwarp", "response": ["Initially it was intended that the BBC Radiophonic Workshop would provide music scores for both this and the following segment of The Trial of a Time Lord; both were assigned to Malcolm Clarke to begin with, although Terror of the Vervoids was reassigned to Elizabeth Parker shortly afterwards. However, fellow Radiophonic Workshop composer Jonathan Gibbs left early in 1986 and was not replaced until the following year, leaving the other composers backlogged and with no one free to do the incidental music for Mindwarp. It was suggested that Dick Mills could provide both the music and sound effects, but John Nathan-Turner rejected this idea and instead hired film composer Richard Hartley to create the incidental music for this segment. It would be the only time that Hartley worked on the series. The original recordings of Hartley's score no longer exist in the BBC archives with the result that there was no isolated score included on the DVD release of this story. For the Blu-Ray release of Season 23, Richard Hartley, along with Mark Ayres re-recorded the entire score in order to present the serial in a new 5.1 mix."]}, {"page": "List of musicals: M to Z", "response": ["| Richard Hartley and Richard O'Brien", "| Richard Hartley"]}, {"page": "Shock Treatment", "response": ["Starting in the mid 2000s director Benji Sperring, a fan of the film, pursued Richard O'Brien for nearly a decade trying to acquire the rights to produce a stage adaptation. O'Brien finally relented and gave his consent, stipulating that it had to be staged in a very small, intimate venue, as the original The Rocky Horror Show had been.  On this proviso, the show wound up at the King's Head Theatre in Islington, London, where artistic director Adam Spreadbury-Maher made the suggestion that Tom Crowley adapt the script.  Crowley had never seen the film, and read the screenplay first to prepare for his interview. He was initially apprehensive about the project, but Sperring's vision was so concise that he agreed. It was reported that O'Brien adapted and produced the show, but he remained fairly hands-off.  O'Brien, co-composer Richard Hartley and Sperring agreed on the story's direction prior to scripting, and they consulted primarily through email during the rest of the production process."]}, {"page": "Nowhere Fast (Fire Inc. song)", "response": ["*\"Clap Your Hands\" (2:23) (Richard Hartley/Brian Thompson)", "* \"Clap Your Hands\" (2:23) (Richard Hartley/Brian Thompson)"]}, {"page": "Tumbledown", "response": ["**Nominated: Best Original Television Music: Richard Hartley"]}, {"page": "The Barrytown Trilogy", "response": ["| Eric ClaptonRichard Hartley"]}, {"page": "Sheena (film)", "response": ["A soundtrack album of music composed and conducted by Richard Hartley for the film was released in 1984. It was reissued on CD by Varèse Sarabande in 2004, separating the first track into two parts (\"Theme\" and \"Interlude\")."]}, {"page": "Alice in Wonderland (1999 film)", "response": ["In December 2018, composer Richard Hartley was interviewed for Tammy Tuckey's \"Rattling the Stars\" podcast about his work on the film for the 20th anniversary, providing never-before-heard stories.Archived at Ghostarchive and the Wayback Machine: ", "* 1999 – Outstanding Music Composition for a Miniseries or a Movie (Dramatic Underscore) – Richard Hartley (Won)"]}, {"page": "B. J. Wilson", "response": ["Wilson was the drummer on the film soundtrack of The Rocky Horror Picture Show (1975), on which his former Procol Harum bandmate, guitarist Mick Grabham, also played. According to IMDb, Wilson's friend, prominent film composer, Richard Hartley, was the one who invited him to drum on that soundtrack, and Wilson brought Grabham in to play guitar. B.J. also played on two tracks (\"Lady Day\" & \"The Kids\") on Lou Reed's 1973 album \"Berlin\"."]}, {"page": "List of film director and composer collaborations", "response": ["*Richard Hartley"]}]}}