{"wiki_id": "http://www.wikidata.org/entity/Q214660", "itemLabel": "John Fowles", "itemDescription": "British writer (1926-2005)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Fowles", "wikipedia_page": {"main": "John Robert Fowles (; 31 March 1926 – 5 November 2005) was an English novelist of international renown, critically positioned between modernism and postmodernism. His work was influenced by Jean-Paul Sartre and Albert Camus, among others.\nAfter leaving Oxford University, Fowles taught English at a school on the Greek island of Spetses, a sojourn that inspired The Magus (1965), an instant best-seller that was directly in tune with 1960s \"hippy\" anarchism and experimental philosophy. This was followed by The French Lieutenant's Woman (1969), a Victorian-era romance with a postmodern twist that was set in Lyme Regis, Dorset, where Fowles lived for much of his life. Later fictional works include The Ebony Tower (1974), Daniel Martin (1977), Mantissa \n(1982), and A Maggot (1985).\nFowles's books have been translated into many languages, and several have been adapted as films.", "link_mentions": [{"page": "March 31", "response": ["*1926 – John Fowles, English novelist (d. 2005)"]}, {"page": "November 5", "response": ["*2005 – John Fowles, English novelist (b. 1926)"]}, {"page": "University of Oxford", "response": ["Writers associated with Oxford include Vera Brittain, A.S. Byatt, Lewis Carroll, Penelope Fitzgerald, John Fowles, Theodor Geisel, Robert Graves, Graham Greene, Joseph Heller, Christopher Hitchens, Aldous Huxley, Samuel Johnson, Nicole Krauss, C. S. Lewis, Thomas Middleton, Iris Murdoch, V.S. Naipaul, Philip Pullman, Dorothy L. Sayers, Vikram Seth, J. R. R. Tolkien, Evelyn Waugh, Oscar Wilde, the poets Percy Bysshe Shelley, John Donne, A. E. Housman, Gerard Manley Hopkins, W. H. Auden, T. S. Eliot and Philip Larkin, and seven poets laureate: Thomas Warton, Henry James Pye, Robert Southey, Robert Bridges, Cecil Day-Lewis, Sir John Betjeman, and Andrew Motion."]}, {"page": "1970s", "response": ["* John Fowles"]}, {"page": "1926", "response": ["* March 31 – John Fowles, English writer (d. 2005)"]}, {"page": "2005", "response": ["** John Fowles, English novelist (b. 1926)"]}, {"page": "Dorset", "response": ["Dorset is famed in literature for being the native county of author and poet Thomas Hardy, and many of the places he describes in his novels in the fictional Wessex are in Dorset, which he renamed South Wessex.Blamires (pp. 112–114) The National Trust owns Thomas Hardy's Cottage, in Higher Bockhampton, east of Dorchester; and Max Gate, his former house in Dorchester. Several other writers have called Dorset home, including Douglas Adams, who wrote much of The Hitchhiker's Guide to the Galaxy while he lived in Stalbridge; John le Carré, author of espionage novels, was born in Poole; Tom Sharpe of Wilt fame lived in Bridport; John Fowles (The French Lieutenant's Woman) lived in Lyme Regis before he died in late 2005;Blamires (p. 88) T.F. Powys lived in Chaldon Herring for over 20 years and used it as inspiration for the fictitious village of Folly Down in his novel Mr. Weston's Good Wine;Blamires (p. 225) John Cowper Powys, his elder brother, also set a number of his works in Dorset, such as the novels Maiden Castle and Weymouth Sands. Children's author Enid Blyton drew inspiration for many of her works from Dorset. The 19th-century poet William Barnes was born in Bagber and wrote many poems in his native Dorset dialect. Originating from the ancient Norse and Saxon languages, the dialect was prevalent across the Blackmore Vale but has fallen into disuse."]}, {"page": "Mary Anning", "response": ["Much of the material written about Anning was aimed at children, and tended to focus on her childhood and early career. Much of it was also highly romanticised and not always historically accurate. Anning has been referenced in several historical novels, most notably in The French Lieutenant's Woman (1969) by John Fowles, who was critical of the fact that no British scientist had named a species after her in her lifetime. As Anning's biographer Shelley Emling noted, this contrasted with some of the prominent geologists who had used her finds, such as William Buckland and Roderick Murchison, who ended up with multiple fossil species named after them. The only person who did name a species after Anning during her lifetime was the Swiss-American naturalist, Louis Agassiz. In the early 1840s, he named two fossil fish species after Anning – Acrodus anningiae, and Belenostomus anningiae – and another after her friend Elizabeth Philpot. Agassiz was grateful for the help the women had given him in examining fossil fish specimens during his visit to Lyme Regis in 1834. After Anning's death, other species, including the ostracod Cytherelloidea anningi, and two genera, the therapsid reptile genus Anningia, and the bivalve mollusc genus Anningella, were named in her honour. In 2012, the plesiosaur genus Anningasaura was named after Anning and the species Ichthyosaurus anningae was named after her in 2015."]}, {"page": "Shakers", "response": ["Novelist John Fowles wrote in 1985 A Maggot, a postmodern historical novel culminating in the birth of Ann Lee, and describing early Shakers in England."]}, {"page": "Academy Award for Best Adapted Screenplay", "response": ["| The novel by John Fowles", "| The novel by John Fowles"]}, {"page": "Lewes", "response": ["The Collector by John Fowles is set near Lewes with the characters visiting the town, and the Roy Grace crime series by Peter James (writer) based in Brighton has scenes set in Sussex Police HQ based in Lewes. Graham Greene's first novel The Man Within has scenes set in Lewes at the Lewes assizes."]}, {"page": "List of winners and shortlisted authors of the Booker Prize", "response": ["*John Fowles"]}, {"page": "Story within a story", "response": ["The script to Karel Reisz's movie The French Lieutenant's Woman (1981), written by Harold Pinter, is a film-within-a-film adaptation of John Fowles's book. In addition to the Victorian love story of the book, Pinter creates a present-day background story that shows a love affair between the main actors."]}, {"page": "Harold Pinter", "response": ["Pinter also adapted other writers' novels to screenplays, including The Pumpkin Eater (1964), based on the novel by Penelope Mortimer, directed by Jack Clayton; The Quiller Memorandum (1966), from the 1965 spy novel The Berlin Memorandum, by Elleston Trevor, directed by Michael Anderson; The Last Tycoon (1976), from the unfinished novel by F. Scott Fitzgerald, directed by Elia Kazan; The French Lieutenant's Woman (1981), from the novel by John Fowles, directed by Karel Reisz; Turtle Diary (1985), based on the novel by Russell Hoban; The Heat of the Day (1988), a television film, from the 1949 novel by Elizabeth Bowen; The Comfort of Strangers (1990), from the novel by Ian McEwan, directed by Paul Schrader; and The Trial (1993), from the novel by Franz Kafka, directed by David Jones."]}, {"page": "Magic realism", "response": ["Taking into account that, theoretically, magical realism was born in the 20th century, some have argued that connecting it to postmodernism is a logical next step. To further connect the two concepts, there are descriptive commonalities between the two that Belgian critic Theo D'haen addresses in his essay, \"Magical Realism and Postmodernism\". While authors such as Günter Grass, Thomas Bernhard, Peter Handke, Italo Calvino, John Fowles, Angela Carter, John Banville, Michel Tournier, Willem Brakman, and Louis Ferron might be widely considered postmodernist, they can \"just as easily be categorized...magic realist.\"D'haen, Theo L., \"Magical realism and postmodernism\" from MR: Theory, History, Community, pp. 193 A list has been compiled of characteristics one might typically attribute to postmodernism, but that also could describe literary magic realism: \"self-reflexiveness, metafiction, eclecticism, redundancy, multiplicity, discontinuity, intertextuality, parody, the dissolution of character and narrative instance, the erasure of boundaries, and the destabilization of the reader.\"D'haen, Theo L., \"Magical realism and postmodernism\" from MR: Theory, History, Community, pp. 192-3 [D'haen references many texts that attest to these qualities] To further connect the two, magical realism and postmodernism share the themes of post-colonial discourse, in which jumps in time and focus cannot really be explained with scientific but rather with magical reasoning; textualization (of the reader); and metafiction."]}, {"page": "Colin Wilson", "response": ["Tobe Hooper directed the film Lifeforce, based on Wilson's novel The Space Vampires. After its release, Colin Wilson recalled that author John Fowles regarded the film adaptation of Fowles' own novel The Magus as the worst film adaptation of a novel ever. Wilson told Fowles there was now a worse one."]}, {"page": "John Mortimer", "response": ["In 1975 and 1976, Mortimer adapted eight of Graham Greene’s short stories for episodes of Shades of Greene presented by Thames Television. Mortimer was credited with writing the script for Granada Television's 1981 serialization of Brideshead Revisited, based on the novel by Evelyn Waugh. However, Graham Lord's unofficial biography, John Mortimer: The Devil's Advocate,Published in United States as John Mortimer. The Secret Lives of Rumpole's Creator (New York, Thomas Dunne Books, 2006) revealed in 2005 that none of Mortimer's submitted scripts had in fact been used and the screenplay was actually written by the series' producer and director. Mortimer adapted John Fowles's The Ebony Tower starring Laurence Olivier for Granada in 1984. In 1986, his adaptation of his own novel Paradise Postponed was televised. He wrote the script, based on the autobiography of Franco Zeffirelli, for the 1999 film Tea with Mussolini, directed by Zeffirelli and starring Joan Plowright, Cher, Judi Dench, Maggie Smith and Lily Tomlin. From 2004, Mortimer worked as a consultant for the politico-legal US \"dramedy\" television show Boston Legal.In appreciation of John Mortimer , Csmonitor, 16 January 2009; accessed 13 January 2016."]}, {"page": "Mason & Dixon", "response": ["Mason & Dixon was one of the most acclaimed novels of the 1990s. According to Harold Bloom, \"Pynchon always has been wildly inventive, and gorgeously funny when he surpasses himself: the marvels of this book are extravagant and unexpected.\" Bloom has also called the novel \"Pynchon’s late masterpiece.\"Bloom, Harold. Thomas Pynchon (Bloom's Major Novelists). NY, Chelsea House 2003. \"Editor's Note\" viii. John Fowles wrote: \"As a fellow-novelist I could only envy it and the culture that permits the creation and success of such intricate masterpieces.\" In his review for The New York Times Book Review, T. Coraghessan Boyle wrote, \"This is the old Pynchon, the true Pynchon, the best Pynchon of all. Mason & Dixon is a groundbreaking book, a book of heart and fire and genius, and there is nothing quite like it in our literature...\" New York Times critic Michiko Kakutani said, \"It is a book that testifies to [Pynchon's] remarkable powers of invention and his sheer power as a storyteller, a storyteller who this time demonstrates that he can write a novel that is as moving as it is cerebral, as poignant as it is daring.\""]}, {"page": "List of years in literature", "response": ["*1965 in literature – Alex Haley's The Autobiography of Malcolm X, Saul Bellow's Herzog;  Norman Mailer's An American Dream; John Fowles's The Magus; John McGahern's The Dark; Jerzy Kosinski's The Painted Bird; Frank Herbert's Dune; Harlan Ellison's \"Repent, Harlequin!\" Said the Ticktockman; Václav Havel's The Memorandum; Agatha Christie's At Bertram's Hotel and Surprise! Surprise!. Death of T. S. Eliot, W. Somerset Maugham", "*1969 in literature – inaugural Booker Prize awarded to P. H. Newby's Something to Answer For; Mario Puzo's The Godfather; Philip Roth's Portnoy's Complaint; Eric Carle's The Very Hungry Caterpillar; Kurt Vonnegut's Slaughterhouse-Five; Vladimir Nabokov's Ada or Ardor: A Family Chronicle; Maya Angelou's I Know Why The Caged Bird Sings; John Fowles's The French Lieutenant's Woman; Harlan Ellison's A Boy and His Dog; Agatha Christie's Hallowe'en Party; Sam Greenlee's The Spook Who Sat By the Door. Death of Jack Kerouac, B. Traven, Leonard Woolf", "*2005 in literature – Kazuo Ishiguro's Never Let Me Go; John Banville's The Sea; Rick Riordan's The Lightning Thief; Chuck Palahniuk's Haunted; Carol Aebersold and Chanda Bell's The Elf on the Shelf; Stieg Larsson's The Girl With the Dragon Tattoo; Stephanie Meyer's Twilight; Carrie Vaughn's Kitty and the Midnight Hour; Death of Saul Bellow, John Fowles, Elizabeth Janeway, Arthur Miller, Claude Simon, Hunter S. Thompson, Yvonne Vera, August Wilson"]}, {"page": "1926 in literature", "response": ["*March 31 – John Fowles, English novelist (died 2005)"]}, {"page": "2003 in literature", "response": ["*John Fowles – The Journals – Volume 1"]}, {"page": "1998 in literature", "response": ["*John Fowles – Wormholes – Essays and Occasional Writings"]}, {"page": "1985 in literature", "response": ["*John Fowles – A Maggot"]}, {"page": "1982 in literature", "response": ["*John Fowles – Mantissa"]}, {"page": "1979 in literature", "response": ["*John Fowles – The Tree"]}, {"page": "1977 in literature", "response": ["*John Fowles – Daniel Martin"]}, {"page": "1974 in literature", "response": ["*John Fowles – The Ebony Tower"]}, {"page": "1969 in literature", "response": ["*John Fowles – The French Lieutenant's Woman"]}, {"page": "1963 in literature", "response": ["*John Fowles – The Collector"]}, {"page": "1966 in literature", "response": ["*John Fowles – The Magus"]}, {"page": "Lyme Regis", "response": ["Lyme Regis  is a town in west Dorset, England,  west of Dorchester and east of Exeter. Sometimes dubbed the \"Pearl of Dorset\",Love Lyme Regis website it lies by the English Channel at the Dorset–Devon border. It has noted fossils in cliffs and beaches on the Heritage or Jurassic Coast, a World Heritage Site. The harbour wall, known as The Cobb, appears in Jane Austen's novel Persuasion, the John Fowles novel The French Lieutenant's Woman and the 1981 film of that name, partly shot in the town. A former mayor and MP was Admiral Sir George Somers, who founded the English colonial settlement of Somers Isles, now Bermuda, where Lyme Regis is twinned with St George's. In July 2015, Lyme Regis joined Jamestown, Virginia in a Historic Atlantic Triangle with St George's. The 2011 Census gave the urban area a population of 4,712, estimated at 4,805 in 2019.City Population. Retrieved 6 January 2021.", "The Cobb featured in Jane Austen's novel Persuasion (1818) and in the 1981 film The French Lieutenant's Woman, based on the 1969 novel of the same name by John Fowles. The poet Tennyson is said to have gone straight to the Cobb on arrival, saying, \"Show me the exact spot where Louisa Musgrove fell!\"Article by John Vaughan, Monthly Packet (1893):  The town was used in filming All Over the Town (1949), under the name \"Tormouth\".", "*John Fowles (1926–2005), author of The French Lieutenant's Woman and other novels, lived in Lyme Regis from 1965 until his death and was curator of Lyme Regis Museum from 1978 to 1988."]}, {"page": "Alternate reality game", "response": ["John Fowles' 1965 novel The Magus describes an elaborate series of \"masques\" collectively called \"the godgame\", an ARG-like scenario that involves many players in several nations, on both sides of the curtain, all working under the direction of one puppet-master. not all of whom are aware of who the others are. The novel ends ambiguously, leaving the reader to literally choose the ending he or she prefers. In his foreword to the 1977 revised edition of  \"The Magus\", Fowles acknowledged some literary works that had influenced him, including Alain-Fournier's 1913 novel \"Le Grand Meaulnes\" (\"The Lost Estate\") for showing a secret hidden world to be explored, and Richard Jefferies's \"Bevis\" from 1882, for projecting a very different world."]}, {"page": "Southend-on-Sea", "response": ["* John Fowles, author"]}, {"page": "Karel Reisz", "response": ["Back in London, he directed The French Lieutenant's Woman (1981), which was probably the most successful of his later films. Adapted from the John Fowles novel by Harold Pinter, it starred Jeremy Irons and Meryl Streep. In 1982 he directed John Guare's Gardenia Dreams on stage in Boston.John Guare play; Gardenia Drama by John Guare. Directed by Karel Reisz.Beufort, John. The Christian Science Monitor, 6 May 1982. "]}, {"page": "The Collector", "response": ["The Collector is a 1963 thriller novel by English author John Fowles, in his literary debut. Its plot follows a lonely, psychotic young man who kidnaps a female art student in London and holds her captive in the cellar of his rural farmhouse. Divided in two sections, the novel contains both the perspective of the captor, Frederick, and that of Miranda, the captive. The portion of the novel told from Miranda's perspective is presented in epistolary form.", "Some scholars have compared the power struggle between Frederick and Miranda as exemplifying the Hegelian \"master–slave dialectic\", and that both exert power over one another—both physically and psychologically—despite their differences in social background. Pamela Cooper writes in her book The Fictions of John Fowles: Power, Creativity, Femininity, that The Collector \"dramatizes the clash between a socially entrenched, wealthy middle class and an underprivileged but upwardly mobile working or lower middle class.\" Additionally, Cooper views the novel as a Gothic-inspired work presenting this class struggle \"with an insistence on the tedium of Miranda's ordeal.\"", "study, a modern or postmodern piece of literature. John Fowles is well established as a master of language, using a variety of tools to convey different", "Alan Pryce-Jones of The New York Times wrote of the novel: \"John Fowles is a very brave man. He has written a novel which depends for its effect on total acceptance by the reader. There is no room in it for the least hesitation, the smallest false note, for not only is it written in the first person singular, but its protagonist is a very special case indeed. Mr. Fowles's main skill is in his use of language. There is not a false note in his delineation of Fred.\" Hayden Carruth of the Press & Sun-Bulletin praised the novel as \"brisk\" and \"professional,\" adding that Fowles \"knows how to evoke the oblique horror of innocence as well as the direct horror of knowledge.\"", "* Verbal Struggle for Power in \"The Collector\" by John Fowles", "* The Official John Fowles website", "Category:Novels by John Fowles"]}, {"page": "Terence Stamp", "response": ["Stamp collaborated with some of the most revered filmmakers. He starred in William Wyler's adaptation of John Fowles' The Collector (1965), opposite Samantha Eggar, and in Modesty Blaise (1966), for director Joseph Losey and producer Joe Janni. Stamp reunited with producer Janni for two more projects: John Schlesinger's adaptation of Thomas Hardy's Far from the Madding Crowd (1967) starring Julie Christie, and Ken Loach's first feature film Poor Cow (1967)."]}, {"page": "Tie Me Up! Tie Me Down!", "response": ["The abduction narrative of Tie Me Up! Tie Me Down! has some similarities with the film The Collector (1965), directed by William Wyler, in which a butterfly specialist abducts a young woman in order to add her to his collection. The Collector was adapted from the eponymous novel by John Fowles. In style, theme and plot details, however, Tie Me Up! Tie Me Down! differs greatly from Wyler's film and the novel that inspired it. Bride kidnapping is also a central plot device in the Hollywood musical Seven Brides for Seven Brothers (1954)."]}, {"page": "Arthur Hugh Clough", "response": ["In the novel The French Lieutenant's Woman by John Fowles, several chapters have epigraphs from poems by Clough: \"Duty\" (1841), The Bothie of Tober-na-Vuolich (1848) and \"Poems\" (1841–1852).", "*\"The French Lieutenant's Woman\" (1969), by John Fowles."]}, {"page": "Caliban", "response": ["In John Fowles's 1963 novel The Collector, Miranda refers to her kidnapper as Caliban."]}, {"page": "The French Lieutenant's Woman", "response": ["The French Lieutenant's Woman is a 1969 postmodern historical fiction novel by John Fowles. The plot explores the fraught relationship of gentleman and amateur naturalist Charles Smithson and Sarah Woodruff, the former governess and independent woman with whom he falls in love. The novel builds on Fowles' authority in Victorian literature, both following and critiquing many of the conventions of period novels.Warburton 166.", "Magali Cornier Michael criticises this reading of the text, saying that the novel's overwhelming reliance on male perspectives on women and feminism prevents the novel from meeting feminist objectives. Similarly, Michelle Phillips Buchberger argues that The French Lieutenant's Woman, along with Fowles' two earlier novels The Collector (1963) and The Magus (1965), proclaimed a \"pseudo-feminism\" while advocating some feminist ideas; but, she says, they are permeated by a \"fetishism [of women that] perpetuates the idea of woman as 'other'\".Buchberger 133. Alice Ferrebe also notes that, despite Fowles' attempts to critique masculine values, his novels remain male fantasies demonstrative of the \"compromises and contradictions\" created by the gendered situation in which he was writing.Ferrebe 223. Other literary critics, such as William Palmer, Peter Conradi, Bruce Woodcock and Pamela Cooper, have also critiqued Fowles' claims to a feminist perspective and representation.Michelle Phillips Buchberger cites the following in her discussion of the debate: William J. Palmer, The Fiction of John Fowles: Tradition, Art, and the Loneliness of Selfhood (Columbia: University of Missouri Press, 1974), p. 75; Peter Conradi, John Fowles (London:Methuen, 1982), p. 91; Bruce Woodcock, Male Mythologies (Brighton:Harvester, 1984), p. 15; and a discussion of Cooper's criticism in 'An Unholy Inquisition: John Fowles and Dianne Vipond (1995)', repr. in John Fowles, Wormholes: Essays and Occasional Writings, ed. by Jan Relf (New York: Henry Holt, 1998), pp. 365–84.", "*Mandal, Mahitosh (2017). \"'Eyes a man could drown in': Phallic Myth and Femininity in John Fowles's The French Lieutenant's Woman.\" Interdisciplinary Literary Studies: A Journal of Criticism and Theory (19.3). https://muse.jhu.edu/article/672189/pdf https://www.jstor.org/stable/10.5325/intelitestud.19.3.0274", "*FowlesBooks.com—The Official John Fowles web site", "Category:Novels by John Fowles"]}, {"page": "Alexei Sayle", "response": ["Sayle's early work included several performances for Capital London. In 1979, he wrote and performed the radio series, Alexei Sayle and the Fish People, for which he won a Pye Radio Award (later known as the Sony Radio Awards). An album based on the show, The Fish People Tapes, again featuring Sayle, was released. This was followed by Alexei Sayle and the Dutch Lieutenant's Trousers in 1980, the name being a reference to John Fowles' The French Lieutenant's Woman. He also starred in two series of Lenin of the Rovers, a 1988 comedy about Britain's first communist football team. He has since contributed to many other radio shows, including writing the five-part sitcom series, Sorry About Last Night (1999), in which he also played the leading role. On 3 November 2006 he presented Chopwell Soviet, a 30-minute programme on BBC Radio 4 that reviewed the Chopwell miners 80 years after the village of Chopwell became known as Little Moscow. Sayle returned to Radio 4 in 2016 with Alexei Sayle's Imaginary Sandwich Bar. In 2019, he narrated the dramatisation of four of his short stories in the series Alexei Sayle's The Absence of Normal, again on Radio 4. A second series was broadcast in 2021."]}, {"page": "Paul Quarrington", "response": ["While writing a review blurb for Leonard Cohen's book, The Favourite Game, he admired Cohen's \"poetic craftsmanship.\" Another time, in typical whimsical Quarrington fashion, he declared, \"I seem to like authors named John – John Fowles, John Gardner, John Irving. John Gardner is my favourite – he's sadly not so well known these days.\""]}]}}