{"wiki_id": "http://www.wikidata.org/entity/Q2143830", "itemLabel": "William Daniel Conybeare", "itemDescription": "English geologist and palaeontologist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Conybeare_(geologist)", "wikipedia_page": {"main": "William Daniel Conybeare FRS (7 June 1787 – 12 August 1857), dean of Llandaff, was an English geologist, palaeontologist and clergyman. He is probably best known for his ground-breaking work on marine reptile fossils in the 1820s, including important papers for the Geological Society of London on ichthyosaur anatomy and the first published scientific description of a plesiosaur.", "link_mentions": [{"page": "Mosasaurus", "response": ["Mosasaurus (; \"lizard of the Meuse River\") is the type genus (defining example) of the mosasaurs, an extinct group of aquatic squamate reptiles. It lived from about 82 to 66 million years ago during the Campanian and Maastrichtian stages of the Late Cretaceous. The earliest fossils of Mosasaurus known to science were found as skulls in a chalk quarry near the Dutch city of Maastricht in the late 18th century, which were initially thought to have been the bones of crocodiles or whales. One particular skull discovered around 1780, and which was seized by France during the French Revolutionary Wars for its scientific value, was famously nicknamed the \"great animal of Maastricht\". In 1808, naturalist Georges Cuvier concluded it belonged to a giant marine lizard with similarities to monitor lizards but otherwise unlike any known living animal. This concept was revolutionary at the time and helped support the then-developing ideas of extinction. However, Cuvier did not designate a scientific name for the new animal; this was done by William Daniel Conybeare in 1822 when he named it Mosasaurus in reference to its origin in fossil deposits near the Meuse River. The exact affinities of Mosasaurus as a squamate remain controversial, and scientists continue to debate whether its closest living relatives are monitor lizards or snakes.", "After its seizure, the second skull was sent to the National Museum of Natural History, France in 1795 and later cataloged as MNHN AC 9648. By 1808, Camper's son Adriaan Gilles Camper and Georges Cuvier concluded that the fossil, which by then was nicknamed the \"great animal of Maastricht,\" belonged to a marine lizard with affinities to monitor lizards, but otherwise unlike any modern animal. The skull became part of Cuvier's first speculations about the conception of extinction, which later led to his theory of catastrophism, a precursor to the theory of evolution. At the time, it was not believed that a species could go extinct, and fossils of animals were often interpreted as some form of an extant species. Cuvier's idea that there existed an animal unlike any today was revolutionary at the time, and in 1812 he proclaimed, \"Above all, the precise determination of the famous animal from Maastricht seems to us as important for the theory of zoological laws, as for the history of the globe.\" William Daniel Conybeare coined the genus Mosasaurus in 1822, and Gideon Mantell added the specific epithet hoffmannii in 1829. Cuvier later designated the second skull as the new species' holotype (defining example)."]}, {"page": "Dean of Llandaff", "response": ["*Portrait of the geologist William Daniel Conybeare (1787-1857): Gathering the Jewels"]}]}}