{"wiki_id": "http://www.wikidata.org/entity/Q2149693", "itemLabel": "Richard Handley", "itemDescription": "British cyclist", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Handley", "wikipedia_page": {"main": "Richard Handley (born 1 September 1990) is a British former professional road and track racing cyclist, who rode professionally between 2010 and 2019.", "link_mentions": [{"page": "Rás Tailteann", "response": ["|60 || 2012 || Nicolas Baldo ||  || Atlas Personal-Jakroo || Gediminas Bagdonas  || David Clarke  || Richard Handley "]}, {"page": "British National Time Trial Championships", "response": ["| 2012 || Sam Harrison || George Atkins  || Richard Handley"]}, {"page": "JLT–Condor", "response": [":Stage 5 Vuelta Ciclista a León, Richard Handley", "::Stage 2, Richard Handley", ":Angela Davies Memorial Road Race, Richard Handley"]}, {"page": "British National Hill Climb Championships", "response": ["| 2011 ||Long Hill, Buxton, Derbyshire|| Gunnar Gronlund || Richard Handley || Matt Clinton "]}, {"page": "2011 Tour of Britain", "response": ["The breakaway was the key to the day's stage, having made an escape from the field after just , and ultimately held an advantage of almost 90 seconds all the way to the end of the stage. Six riders from six different teams – Gediminas Bagdonas of , Ian Wilkinson of , 's Mathieu Claude, 's Stijn Neirynck, and riding for British continental teams  and , Richard Handley and Wouter Sybrandy – were left to fight for the victory themselves, with  ending a pursuit to catch them with around  remaining, instead deciding to protect their leader Lars Boom and his lead overall. Bagdonas ultimately took the stage win ahead of Wilkinson, Claude and Neirynck, as Boom maintained his lead of 28 seconds in the general classification over 's Leopold König, ahead of the final day's split-stages. Boom and König both finished in the pack led home by Mark Cavendish, 83 seconds behind Bagdonas."]}, {"page": "Tour Series", "response": ["| Richard Handley", "| Richard Handley"]}, {"page": "London–Surrey Cycle Classic", "response": ["|||Dan Fleeman, Richard Handley, Liam Holohan, Matt Jones, Gael le Bellec"]}, {"page": "2012 Tour of Britain", "response": ["The first sprint point on the second stage was contested just over  into the stage, at Duffield. After the sprint point, there were three successive first-category climbs on the  parcours, coming at Cross o' th' Hands, Alstonefield and finally Morridge. The two final sprint points were at Chelford and Culcheth with the stage finishing, for the first time, at Knowsley Safari Park on the outskirts of Liverpool. The breakaway for the stage consisted of six riders, and they managed to remain off the front of the field for the majority of the stage. Making up the group were  stagiaire Matthias Krizek, Jack Bobridge of , Peter Williams representing the  team, 's Richard Handley,  rider Russell Hampton and Pablo Urtasun for the  squad. The sextet managed to establish a lead of over four minutes at one stage on the roads, but were gradually brought back by the peloton, led once again by  with assistance from ; both teams were looking to set up their sprinters Mark Cavendish and Russell Downing respectively."]}, {"page": "2016 Tour de Yorkshire", "response": ["|style=\"background:pink;\" | Richard Handley"]}, {"page": "2016 ONE Pro Cycling season", "response": ["|Richard Handley ||"]}, {"page": "Handley, Richard", "response": ["#redirectRichard Handley"]}, {"page": "Draft talk:Richard Handley (physician)", "response": ["Sidenote, I noticed that there is already an article about a Richard Handley, a cyclist. If this article's name needs to be changed, I think Richard Handley (producer) would be best. ~Junedude433(talk) 18:53, 3 January 2022 (UTC)"]}]}}