{"wiki_id": "http://www.wikidata.org/entity/Q21458328", "itemLabel": "Stewart Carmichael", "itemDescription": "British painter (1867-1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stewart_Carmichael", "wikipedia_page": {"main": "Stewart Carmichael (8 February 1867 – 1950) was a Scottish painter known for his Celtic Revival, Symbolist and historical scenes. He has been described by the poet and academic Alan Riach as \"one of the first truly Modernist Scottish artists, a painter of real stature\".", "link_mentions": [{"page": "Newport-on-Tay", "response": ["The arts have played a major role in the shaping of Newport and its neighbourhood. In 1905 the Tayport Artists' Circle was formed,The National Archives; BT58/12/Cos/1288A including James Douglas, Anna Douglas, Alec Grieve, Stewart Carmichael, William Bradley Lamond, Charles Adamson and the so-called \"Painter's painter\" David Foggie. Led by Frank Laing, their aim was to have an influence through art on the industrial environment; this is explained in a letter from Laing to the town planner/architect Patrick Geddes.Univ of Strathclyde archives"]}, {"page": "Celtic Revival", "response": ["In Scotland were John Francis Campbell's (1821-1885) works the bilingual Popular Tales of the West Highlands (4 vols., 1860–62) and The Celtic Dragon Myth, published posthumously in 1911. The formation of the Edinburgh Social Union in 1885, which included a number of significant figures in the Arts and Craft and Aesthetic movements, became part of an attempt to facilitate a revival in Scotland, similar to that taking place in contemporaneous Ireland, drawing on ancient myths and history to produce art in a modern idiom.Gardiner (2005), p. 170. Key figures were the philosopher, sociologist, town planner and writer Patrick Geddes (1854–1932), the architect and designer Robert Lorimer (1864–1929) and stained-glass artist Douglas Strachan (1875–1950). Geddes established an informal college of tenement flats for artists at Ramsay Garden on Castle Hill in Edinburgh in the 1890s. Among the figures involved with the movement were Anna Traquair (1852–1936), who was commissioned by the Union to paint murals in the Mortuary Chapel of the Hospital for Sick Children, Edinburgh, (1885–86 and 1896–98) and also worked in metal, illumination, illustration, embroidery, and book binding.MacDonald, (2000), pp. 155–6. The most significant exponent of the artistic revival in Scotland was Dundee-born John Duncan (1866–1945). Among his most influential works are his paintings of Celtic subjects Tristan and Iseult (1912) and St Bride (1913).MacDonald (2000), pp. 156–7. Duncan also helped to make Dundee a major centre for the Celtic Revival movement along with artists such as Stewart Carmichael and the publisher Malcolm C MacLeod."]}, {"page": "Stewart Carmicheal", "response": ["#REDIRECT Stewart Carmichael"]}]}}