{"wiki_id": "http://www.wikidata.org/entity/Q2148362", "itemLabel": "Rhys Williams", "itemDescription": "Welsh actor (1897-1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Rhys_Williams_(Welsh_actor)", "wikipedia_page": {"main": "Rhys Williams (31 December 1897 – 28 May 1969) was a Welsh Shakespearean thespian in the Broadway theatre genre of acting, He was a character actor in 78 American films over more than 30 years,  and he later appeared on American television shows.", "link_mentions": [{"page": "The Donna Reed Show", "response": ["* Rhys Williams"]}, {"page": "Carbine Williams", "response": ["* Rhys Williams as Redwick Karson"]}, {"page": "Rhys Williams", "response": ["*Rhys Williams (rugby union, born 1980), Welsh rugby union player", "*Rhys Williams (hurdler) (born 1984), Welsh athlete", "*Rhys Williams (rugby union, born 1988), Welsh rugby union player who plays at centre for Llanelli Scarlets", "*Rhys Williams (soccer, born 1988), Australian professional association football player", "*Rhys Williams (rugby league) (born 1989), Welsh rugby league player", "*Rhys Williams (rugby union, born 1990), Welsh rugby union player who plays at hooker for Cardiff Blues", "*Rhys Williams (soccer, born 1995), American soccer player", "*Rhys Williams (footballer, born 2001), English footballer", "*Rhys Williams (Canadian actor) (born 1983), actor and stunt performer", "*Rhys Williams (Welsh actor) (1897–1969), Welsh actor", "*Albert Rhys Williams (1883–1962), Welsh-American political activist", "*Rhys Williams (Torchwood), portrayed in British science fiction series Torchwood", "*Rhys Williams, a primary character in the 1977 novel Bloodline, by Sidney Sheldon"]}, {"page": "The Crooked Way", "response": ["* Rhys Williams as Lieutenant Joe Williams"]}, {"page": "How Green Was My Valley (film)", "response": ["Huw begins school at a nearby village. Abused by other boys, he is taught to fight by boxer Dai Bando (Rhys Williams) and his crony, Cyfartha (Barry Fitzgerald). After a beating by the cruel teacher Mr. Jonas (Morton Lowry), Dai Bando avenges Huw with an impromptu boxing display on Mr. Jonas to the delight of his pupils.", "*Rhys Williams as Dai Bando, boxer"]}, {"page": "If Winter Comes", "response": ["* Rhys Williams as Effie's puritanical father"]}, {"page": "The Strange Woman", "response": ["* Rhys Williams as Deacon Adams"]}, {"page": "Bad for Each Other", "response": ["Joan confronts Tom and explains Jim's inspirational story and Tom agrees to sends Jim to see Dr. Lester Scobee (Rhys Williams, who cares for the miners of Coalville and their families. Jim is hired and starts to see more and more cases of men from the mine developing lung conditions. He approaches Tom with some X-rays. Before Tom can review the X-rays, he gets a call from Helen who is with her aunt who has become ill. Tom rushes out and after examining Helen's rich and influential aunt, Mrs. Roger Nelson (Marjorie Rambeau), discovers that she is extremely ill and in dire need of emergency surgery. Mrs Nelson insists on not proceeding until she sees her personal physician Dr Gleeson. Tom explains to Gleeson that the surgery is required and Gleeson admits that he is not equipped to perform surgery and that he actually hasn't performed any surgery in over 10 years. Instead, his former partner had been the surgeon. Tom performs the surgery successfully saving Mrs Nelson and Gleeson urges Tom to allow him to take credit. Later Joan upbraids Tom for his unethical behavior and quits the surgery.", "* Rhys Williams as Dr. Leslie M. Scobee"]}, {"page": "Rhys Williams (Welsh American actor)", "response": ["#REDIRECT Rhys Williams (Welsh actor)"]}, {"page": "Rhys Williams (Welsh-American actor)", "response": ["#REDIRECT Rhys Williams (Welsh actor)"]}]}}