{"wiki_id": "http://www.wikidata.org/entity/Q214416", "itemLabel": "Franz Reizenstein", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Franz_Reizenstein", "wikipedia_page": {"main": "Franz Theodor Reizenstein (7 June 1911 – 15 October 1968) was a German-born British composer and concert pianist. He left Germany for sanctuary in Britain in 1934 and went on to have his teaching and performing career there. As a composer, he successfully blended the equally strong but very different influences of his primary teachers, Hindemith and Vaughan Williams.\n\n", "link_mentions": [{"page": "Paul Hindemith", "response": ["At the same time that he was codifying his musical language, Hindemith's teaching and compositions began to be affected by his theories, according to critics like Ernest Ansermet.1961, note to p. 42 added on an errata slip Arriving in the U.S. in 1940, he taught primarily at Yale University, where he founded the Yale Collegium Musicum. He had such notable students as Lukas Foss, Graham George, Andrew Hill, Norman Dello Joio, Mitch Leigh, Mel Powell, Yehudi Wyner, Harold Shapero, Hans Otte, Ruth Schönthal, Samuel Adler, Leonard Sarason, and Oscar-winning film director George Roy Hill. He also taught at the University at Buffalo, Cornell University, and Wells College. During this time he also gave the Charles Eliot Norton Lectures at Harvard, from which the book A Composer's World was extracted. Hindemith had a long friendship with Erich Katz, whose compositions were influenced by him.Davenport 1970, 43. Also among Hindemith's students were the composers Franz ReizensteinMaurice Hinson, Music for More than One Piano: An Annotated Guide (Bloomington and London: Indiana University Press, 2001): 244. . and Robert Strassburg.Composer genealogies: A Compendium of Composers, Their teachers and Their Students Pfitzinger, Scott. Rowman & Littlefield, New York & London 2017 Pg. 522. "]}, {"page": "1968 in music", "response": ["*October 15 – Franz Reizenstein, pianist and composer, 57"]}, {"page": "1956 in music", "response": ["*Franz Reizenstein –"]}, {"page": "1951 in music", "response": ["*July 2–14 – The seventh annual Cheltenham Music Festival is held in Cheltenham, England, with a performance of Brian Easdale's opera The Sleeping Children, premieres of the first symphonies of Malcolm Arnold, John Gardner and Arnold van Wyk, Franz Reizenstein's Serenade for Winds and Maurice Jacobson's Symphonic Suite, as well as performances of works by Humphrey Searle, Robert Masters, Benjamin Frankel and Philip Sainton.A. J., \"Cheltenham Festival\", The Musical Times 92, no. 1303 (Sep., 1951): 416–17."]}, {"page": "Piano Concerto (Grieg)", "response": ["*It was famously parodied in Franz Reizenstein's Concerto Popolare of 1959 (written for Gerard Hoffnung's music festival)."]}, {"page": "List of film score composers", "response": ["* Franz Reizenstein"]}, {"page": "List of German Jews", "response": ["* Franz Reizenstein, pianist, composerAJR"]}, {"page": "BBC Symphony Chorus", "response": ["Under Antal Dorati, Chief Conductor of the BBC Symphony Orchestra from 1963 to 1967, the BBC Choral Society sang Mahler, a great deal of Stravinsky, some Britten, and much Beethoven. When Colin Davis took over in 1967, a new group of composers came to the fore: Berlioz, Liszt (the Dante Symphony as well as the Faust Symphony), and Michael Tippett. This last connection brought the BBC Choral Society its opportunity to make its first recording for a commercial company in recent years (though Mendelssohn's Elijah had been recorded as long ago as 1930): Tippett's oratorio A Child of Our Time was recorded under Davis's direction for Philips Classics Records. There followed a succession of major contemporary works: Voices of Night by Franz Reizenstein in 1969; La Transfiguration de Notre Seigneur Jésus-Christ by Messiaen at the first night of the Proms in 1970; and the Requiem by Gyorgy Ligeti in 1971."]}, {"page": "The Lambeth Walk", "response": ["The composer Franz Reizenstein wrote a set of Variations on the Lambeth Walk, each variation a pastiche of the style of a major classical composer.  Notable are the variations in the styles of Beethoven, Chopin, and Liszt."]}, {"page": "Yvonne Arnaud", "response": ["She still occasionally performed as a pianist later in her career, for example, with the Hallé Orchestra under Sir John Barbirolli in Manchester in 1948. She was also the soloist at the premiere of Franz Reizenstein's pastiche Concerto Popolare at the 1956 Hoffnung Festival (having been chosen after Eileen Joyce declined)."]}, {"page": "Christopher Hassall", "response": ["* Anna Kraus (1952), librettist for the radio opera by composer Franz Reizenstein"]}, {"page": "List of compositions for cello and orchestra", "response": ["*Franz Reizenstein"]}, {"page": "Horror film score", "response": ["In fact, Hammer employed a number of other composers, including Franz Reizenstein (The Mummy, 1959), Malcolm Williamson (The Brides of Dracula, 1960) and Tristram Cary (Quatermass and the Pit, 1967, and Blood from the Mummy's Tomb, 1971). Despite the obvious atonal influence on the earlier Universal film scores, Benjamin Frankel's 1960 score for The Curse of the Werewolf (1960) is believed by some to contain the first film theme to be based entirely on Arnold Schoenberg's Twelve-Tone scale."]}, {"page": "Gerard Hoffnung", "response": ["In 1956 Hoffnung took part in one of the popular \"April Fool's\" concerts in Liverpool, organised by Fritz Spiegl. He took up the idea, and presented a similar, but larger-scale, concert at the Festival Hall in November the same year, in which Spiegl joined him.Shifrin, Malcolm. \"Musical fun\", The Guardian, 29 March 2003 The 1956 \"Hoffnung Music Festival\" played to a sell-out audience in the hall and to BBC viewers throughout Britain.\"Caricature Concert\", The Times, 30 October 1956, p. 3 The success of this concert led to two more Hoffnung Festivals, the second in 1958 and the third in 1961, presented as a tribute after his death. They featured contributions from distinguished musicians. Donald Swann revised Haydn's  Surprise Symphony to make it considerably more surprising. Malcolm Arnold wrote A Grand, Grand Overture, scored for orchestra and vacuum cleaners, and dedicated to US President Hoover.\"A Musical Purge\", The Times, 14 November 1956, p. 3 Franz Reizenstein's Concerto Popolare featured a battle between the soloist, playing the Grieg Piano Concerto, and the orchestra, determinedly playing Tchaikovsky.\"Another Evening of Hoffnung\", The Times 11 February 1963, p. 5 Sir William Walton conducted a one-note excerpt from his cantata Belshazzar's Feast: the word \"Slain!\" shouted by the chorus.\"Wit That Makes You Think\", The Times, 29 November 1961, p. 15 After Hoffnung's death, similar concerts were promoted by his widow, Annetta, and collaborators.A Hoffnung Festival, given at the Festival Hall in 1988, was preserved on CD: Decca 425 401-2 DH2, re-issued in 1996 as 444 921-2 DF2"]}, {"page": "Arnold Cooke", "response": ["In 1929, he gained his Music degree and went to Berlin where he studied composition and piano at the Berlin University of the Arts under Paul Hindemith. Hindemith's composition class also included Harald Genzmer, Oskar Sala and Franz Reizenstein, the latter remained a lifelong friend and kept Cooke's Piano Concerto in his repertoire.Kolja Lessing. Notes to Franz Reizenstein: Solo Sonatas, EDA 20 (2002)", " which he had completed just before his call-up in 1941. The concerto had been commissioned by the South African pianist Adolph Hallis in 1939 but the outbreak of WWII meant that Hallis had to return to South Africa. Kentner gave the first performance in a BBC studio broadcast on 11 November 1943. The work received subsequent broadcast performances from Franz Reizenstein with the BBC Northern Orchestra under Clarence Raybould in 1952  and Eric Parkin with the BBC Northern Orchestra under Brian Priestman in 1972."]}, {"page": "Roman Totenberg", "response": ["Totenberg toured South America with Franz Reizenstein in 1937,  and gave joint recitals with Karol Szymanowski. "]}, {"page": "English Dances (Arnold)", "response": ["*1958 for piano duet by Franz Reizenstein"]}, {"page": "David Wilde", "response": ["David Wilde (born 1935 in Manchester) is an English pianist and composer. As a boy he studied with Solomon and his pupil Franz Reizenstein, who had also studied composition with Hindemith and Vaughan Williams."]}, {"page": "Clifton Parker", "response": ["The 1950s were a prolific period, with Parker composing for many mediums, especially film. However, in 1963 he was one of three composers, the others being William Alwyn and Franz Reizenstein, who abandoned scoring film music in protest of the exorbitant percentage of royalties taken by the publishers."]}, {"page": "Leonid Kreutzer", "response": ["Kreutzer was born in St. Petersburg into a Jewish family. He studied composition under Alexander Glazunov and piano under Anna Yesipova. He was a highly influential piano teacher at the Berlin Academy of Music (Berliner Hochschule für Musik), together with Egon Petri. Amongst Kreutzer's students were Władysław Szpilman, Hans-Erich Riebensahm, Vladimir Horbowski, Karl-Ulrich Schnabel, Franz Osborn, Boris Berlin, Ignace Strasfogel, Franz Reizenstein and Grete Sultan. Leonid Kreutzer also gave musically and technically demanding solo recitals, mostly dedicated to specific composers or themes. At some of these, notably in June 1925, he performed works of contemporaries or modern, avant-garde composers of his time or of the recent past such as César Franck, Claude Debussy, Paul Hindemith and Paul Juon."]}, {"page": "Eileen Joyce", "response": ["In 1956 she was Gerard Hoffnung's first choice as soloist in Franz Reizenstein's parodic Concerto Popolare, to be played at the inaugural Hoffnung Music Festival. She declined, and the job went to Yvonne Arnaud. She appeared as soloist at Sir Colin Davis's debut as a conductor, with the Royal Philharmonic Orchestra (RPO), on 22 September 1957, playing Tchaikovsky's Concerto No. 1. On 28 November 1957, she participated in the premiere performance of Malcolm Arnold's Toy Symphony, Op. 62, at a fund-raising dinner for the Musicians Benevolent Fund. This work has parts for 12 toy instruments, which were taken by Joyce, Eric Coates, Thomas Armstrong, Astra Desmond, Gerard Hoffnung, Joseph Cooper, and other prominent people, all conducted by the composer.Paul R. W. Jackson, The Life and Music of Sir Malcolm ArnoldChester Novello"]}, {"page": "William Pleeth", "response": ["During the war Pleeth served in the same regiment with the composer Edmund Rubbra, with whom he became lifelong friends. Rubbra wrote his Sonata for Cello and Piano for Pleeth and Good.  He also wrote his \"Soliloqui\" for cello and orchestra for Pleeth. Among the other composers who wrote pieces for Pleeth were Franz Reizenstein, Gordon Jacob, Mátyás Seiber and Benjamin Frankel."]}, {"page": "Circus of Horrors", "response": ["The score was provided between Franz Reizenstein and Muir Mathieson. Douglas Slocombe was the cinematographer."]}, {"page": "Norman Del Mar", "response": ["In 1949 Del Mar was appointed principal conductor of the English Opera Group, in which post he remained until 1954. In 1952 he conducted the BBC Symphony Orchestra in the world premiere of Franz Reizenstein's radio opera Anna Kraus. He then held chief conducting posts with the Yorkshire Symphony Orchestra (1954) the BBC Scottish Symphony Orchestra (1960–1965), and the Aarhus Symphony Orchestra (1985–1988). A regular at the BBC Proms concerts, he conducted the famous Last Night on three occasions: 1973, 1975, and 1983. He was also 'permanent guest conductor' with the Göteborg Symphony Orchestra from 1969–1973."]}, {"page": "Meir Katzenellenbogen", "response": ["*Franz Reizenstein"]}, {"page": "Ludwig Hopf", "response": ["Hopf was first cousins with mathematician Heinz Hopf and first cousins once removed with composer Franz Reizenstein."]}, {"page": "1951 in British music", "response": ["*2–14 July – The seventh annual Cheltenham Music Festival is held in Cheltenham, England, with a performance of Brian Easdale's opera, The Sleeping Children, premieres of the first symphonies of Malcolm Arnold, John Gardner, and Arnold van Wyk, Franz Reizenstein's Serenade for Winds, and Maurice Jacobson's Symphonic Suite, as well as performances of works by Humphrey Searle, Robert Masters, Benjamin Frankel, and Philip Sainton.A. J., \"Cheltenham Festival\", The Musical Times 92, no. 1303 (September 1951): 416–17."]}, {"page": "Index of World War II articles (F)", "response": ["# Franz Reizenstein"]}, {"page": "Martin Yates", "response": ["Martin Yates has made over 100 recordings, including (for Dutton Epoch) the world premier recordings of the complete symphonies, ballets and concertos of Richard Arnell, John Joubert's Symphony 2; Symphonies 3 & 4, Sinfonietta 1 & Piano Concerto 2 by Stanley Bate, Thomas Dunhill (Symphony in A), Erik Chisholm (Symphony No. 2), Peter Crossley-Holland (Symphony in D), String Orchestra music by Arnold Bax, Stephen Dodgson and Richard Arnell, Orchestral Songs by John Ireland, Arnold Bax and others, also Piano Concertos (with pianist Victor Sangiorgio) by Stanley Bate, Benjamin Godard and Franz Reizenstein and with pianist Peter Donohoe piano concertos by Malcolm Arnold, Alan Bush and Cyril Scott and with pianist Martin Roscoe the complete piano and orchestra works by Charles-Marie Widor. He has also recorded five Cello Concertos with the celebrated cellist Raphael Wallfisch (Havergal Brian, York Bowen, Alan Bush, John Foulds and Lionel Sainsbury) and premier recordings of Violin Concertos by Richard Arnell and Guirne Creith and also William Walton in its original version and Arthur Bliss with Lorraine MacAslan. He has also made premier recordings of violin concertos by Widor, Charles Villiers Stanford, Sergei Bortkiewicz & Maximilian Steinberg with the Russian violinist Sergey Levitin. He has conducted several recordings of music by Ralph Vaughan Williams including Symphony 5, Concerto for Two Pianos, premier recordings of Serenade for small orchestra, Bucolic Suite, The Blue Bird & The Fat Knight, the entire score of Scott of the Antarctic and the first modern recording of A London Symphony in its second version (1920). During the 1990s he made many recordings of complete musicals for TER, including Brigadoon, The Phantom of the Opera, Jesus Christ Superstar, Sweet Charity, Stop the World I Want to Get Off, The Fantasticks and Seven Brides for Seven Brothers. He conducted the highly regarded Royal National Theatre production of Carousel in London's west end and made the London cast recording."]}, {"page": "London Philharmonic Choir", "response": ["| 20 June 1952||Franz Reizenstein || Voices of Night||LPO||Sir Adrian Boult|| Maida Vale Studios ||UK Première Broadcast"]}, {"page": "1968 in British music", "response": ["*15 October – Franz Reizenstein, German-born composer and pianist, 57"]}, {"page": "Roy Douglas", "response": ["Douglas worked with Walton on the revised version of Belshazzar's Feast, but regretted Walton's decision to use less percussion than in the original.Lloyd, p. 108 The vocal score of Troilus and Cressida was largely the work of Roy Douglas, assisted by Franz Reizenstein in Act III.Lloyd, Note 59, p. 224"]}, {"page": "Hoffnung Music Festival", "response": [":Concerto Popolare (a Piano Concerto to end all Piano Concertos) by Franz Reizenstein", ":Let's Fake an Opera or The Tales of Hoffnung (William Mann and Franz Reizenstein)."]}, {"page": "List of variations on a theme by another composer", "response": ["* Franz Reizenstein: Variations on The Lambeth Walk"]}, {"page": "Anna Kraus", "response": ["Anna Kraus, Op. 30 is a radio opera in one act by composer Franz Reizenstein. The work uses an English language libretto by Christopher Hassall to tell the tragic tale of a German woman who is forced to leave her country due to oppression from the Nazi regime, as the Nazis did not like her political views. The opera was commissioned by the British Broadcasting Corporation following the popular success of Reizenstein's 1951 cantata Voices of Night. The opera premiered on 25 July 1952 on BBC Third Programme with conductor Norman Del Mar leading the BBC Symphony Orchestra and singers Victoria Sladen (as Anna) and Lloyd Strauss-Smith (as Pavel). It was submitted by the BBC later that year for the Prix Italia. Critical reaction to the work was mixed. The New Statesman described the work as \"engaging\" and a \"worthwhile experiment\". The Annual Register wrote that the opera \"suffered from the composer's emotion being too closely engaged in the sufferings of the heroine, a refugee from political oppression\".", "Category:Operas by Franz Reizenstein"]}, {"page": "List of compositions for viola: O to R", "response": ["* Franz Reizenstein (1911–1968)"]}, {"page": "Concerto Popolare", "response": ["#REDIRECT Franz Reizenstein#Hoffnung Festivals"]}, {"page": "William Mann (critic)", "response": ["On leaving Cambridge in 1948 Mann joined The Times in London. In the same year he married Erika Charlotte Emilie Sohler, with whom he had four daughters. He remained at The Times for 34 years, first as assistant music critic (1948–60) and then as chief music critic (1960–82). Although the paper in the post-war decades was generally conservative and traditional, Mann was, as a colleague described him, \"markedly progressive, even iconoclastic, in outlook.\" In 1958 Mann contributed the libretto to Franz Reizenstein's Let's Fake an Opera, produced for the 1958 Hoffnung Music Festival. It consisted of \"ridiculously juxtaposed excerpts from more than forty operas, which delighted both Reizenstein and the audience\".Hoffnung, A. Gerard Hoffnung (Garden Press, 1988), p 156", "*Let’s Fake an Opera (with Franz Reizenstein), 1958"]}]}}