{"wiki_id": "http://www.wikidata.org/entity/Q21484766", "itemLabel": "Ademola Lookman", "itemDescription": "English footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ademola_Lookman", "wikipedia_page": {"main": "Ademola Lookman Olajade Alade Aylola Lookman (born 20 October 1997) is an English professional footballer who plays as a winger for Premier League club Leicester City, on loan from RB Leipzig.\nLookman made his senior debut in 2015, playing as a forward for Charlton Athletic of the Championship, and in January 2017 signed for Everton, who used him mainly as a winger. He has represented England from under-19 to under-21 levels, but has since applied to FIFA to change his national allegiance to Nigeria.", "link_mentions": [{"page": "Jason Euell", "response": ["In September 2013, Euell took charge for the club's U21 squad for the first time. He was credited for promoting youngsters to the first team, such as, Joe Gomez, Ademola Lookman, Jordan Cousins and Joe Aribo."]}, {"page": "EFL Awards", "response": ["|| Ademola Lookman (Charlton Athletic)"]}, {"page": "Charlton Athletic F.C. Under-23s and Academy", "response": ["This was followed by the creation of the Youth Academy in 1998, aiming to find the best local, and worldwide talent to bring to Charlton at a young age. There are 13 players playing in the top 2 tiers of English football who began their footballing career at the Charlton Youth Academy, including Arsenal's Carl Jenkinson, Bournemouth's Harry Arter, Huddersfield's Tareiq Holmes-Dennis & Kasey Palmer, Norwich's Michael Turner, Newcastle's Robert Elliot & Jonjo Shelvey, QPR's Jordan Cousins, Reading's Callum Harriott, West Ham's Darren Randolph, Liverpool's Joe Gomez, Everton's Ademola Lookman and Sheffield Wednesday's Morgan Fox as well as 5 current Charlton first team players Dillon Phillips, Ezri Konsa, Karlan Ahearne-Grant, Chris Solly and Harry Lennon,.Charlton Athletic Youth Academy ", "* Ademola Lookman England U19/20/21", "* Ademola Lookman (Everton)"]}, {"page": "Ademola", "response": ["*Ademola Lookman (born 1997), English professional footballer"]}, {"page": "List of foreign Bundesliga players", "response": ["* Ademola Lookman – RB Leipzig – 2017–18, 2019–20"]}, {"page": "Aleksandar Mitrović", "response": ["Mitrović scored his first goals of the season in a 4–3 defeat to Leeds on 19 September 2020, but went on a scoring drought that lasted until April 2021, in a 3–1 defeat to Aston Villa. The previous October, he had the opportunity to convert a penalty against Sheffield United, but hit his effort off the crossbar. Later in the match, he conceded a penalty when he tackled Jack Robinson, resulting in Billy Sharp scoring the equaliser. Mitrović spent much of the season in and out of the squad, missing matches due to tactical changes (where he was kept out by Ivan Cavaleiro and Ademola Lookman), various injuries, as well as testing positive for COVID-19."]}, {"page": "2017 FIFA U-20 World Cup", "response": ["*  Ademola Lookman"]}, {"page": "List of Nike sponsorships", "response": ["*  Ademola Lookman"]}, {"page": "2015–16 Charlton Athletic F.C. season", "response": ["|2||FW||||37||Ademola Lookman||5||0||0||5", "|Ademola Lookman"]}]}}