{"wiki_id": "http://www.wikidata.org/entity/Q21466176", "itemLabel": "Cyrus Cuneo", "itemDescription": "British-American painter (1879-1916)", "wikipedia_url": "https://en.wikipedia.org/wiki/Cyrus_Cuneo", "wikipedia_page": {"main": "Cyrus Cincinato Cuneo  (18 June 1879 – 23 July 1916), known as Ciro, was an artist, born into an Italian American family of artists and musicians. His parents were Giovanni (John) and Annie Cuneo; his brothers Rinaldo (1877-1939) and Egisto (1890–1972), and his son Terence Cuneo (1907–1996) also became artists.\n\n", "link_mentions": [{"page": "George MacDonald", "response": ["*The Gifts of the Child Christ and Other Tales (1882; republished as Stephen Archer and Other Tales) 1908 edition by Edwin Dalton, London was illustrated by Cyrus Cuneo and G. H. Evison. Available online at the Hathi Trust.", "*The Vicar's Daughter (1871), a sequel to Annals of a Quiet Neighborhood and The Seaboard Parish. 1908 edition by Sampson Low and Company, London was illustrated by Cyrus Cuneo and G. H. Evison.  "]}, {"page": "Hall Caine", "response": ["Around 1890 Caine published a magazine serial called Drink: A Love Story on a Great Question. This was about the same time as Bram Stoker began his notes for his Dracula novel. Stoker and Caine were lifetime literary friends. They shared an interest in mesmerism. Drink contains a number of similarities to Stoker's novel.  In 1906 Drink was published by George Newnes, and illustrated by expatriate Italian American illustrator and painter Cyrus Cuneo. It was described in the Manchester Guardian as 'a rather gruesome love story'. The story is of a girl who inherits a taste for alcohol from her father and is put on the road to recovery by hypnotic influence. Two hundred thousand copies of the book had been sold in England by the time the American edition was published by Appleton in 1907."]}, {"page": "Banff Springs Hotel", "response": ["The hotel was named for William Davidson, who had grown up in Moray, close to Banff, Scotland, and was the first European settler in that area of Canada. The name borne by the Canadian city and the national park is derived from his native country. Halfway up the internal staircase closest to the Bow Falls is found a painting of Davidson felling trees on the Miramichi River during colonial times.  The painting of the pioneer is by the war artist Cyrus Cuneo (1879–1916), who executed a series of paintings for the Canadian Pacific Railway."]}, {"page": "Cuneo (surname)", "response": ["*Cyrus Cuneo (1879-1916), American painter"]}, {"page": "Cyrus Cincinato Cuneo", "response": ["#REDIRECT Cyrus Cuneo"]}, {"page": "Percy Bradshaw", "response": ["*Cyrus Cuneo (18791916)"]}, {"page": "Académie Carmen", "response": ["thumb|\"He never had a more ardent lot of followers than the girl students; they adored him.\" (1906) by Cyrus Cuneo", "Initially, all the students met in a single class. Whistler made his first appearance at the beginning of the second week, and, at his insistence, the students were separated into women's and men's classes. Experienced students were appointed teaching assistants. The women's class was led by Irish painter Inez Eleanor Bate for the length of the school's tenure.Inez Eleanor Addams, from The Correspondence of James MacNeill Whistler. The men's class was led by a series of assistants—American painter Earl Stetson Crawford,Earl Stetson Crawford, from The Correspondence of James MacNeill Whistler. Czech painter Alphonse Mucha,Alphonse Mucha: Master of Art Nouveau, exhibition catalogue, (Glen Falls, NY: The Hyde Collection, January 2018). Italian painter Cyrus Cuneo, and lastly, American painter Clifford Addams. With a dearth of sculpture students, MacMonnies left after the first year.", "In a 1906 magazine article, Cuneo described Whistler's eccentricities, his inability to communicate effectively as a teacher, and his strong favoritism toward the women's class:Cyrus Cuneo, \"Whistler's Academy of Painting, Some Parisian Recollections,\" The Pall Mall Magazine, vol. 38, no. 163 (November 1906), pp. 531-40. \"Instead of sitting down in the usual French fashion and giving each pupil in turn a clear and matter-of-fact criticism, Whistler airily picked his way amongst the easels, glancing here and there, ignoring some canvases altogether, greeting others with 'Yes—yes.' \" \"Whistler's methods and manner confused the average students who came, but his faith in his system was as great as the students' unbelief.\" Despite the prestige of his fame and reputation, many of the students dropped out. The frustration of the male students was expressed in a poem Whistler found scrawled on a wall of the men's studio:", "*Cyrus Cuneo (tutor) "]}, {"page": "Charles Gilson", "response": ["Captain Charles Gilson and Major Charles Gilsonand Barbara Gilson (1878 - 1943) was a British officer and a popular author of science fiction, adventure stories, and historical fiction books for children. Some of his stories were illustrated including at least one book, The Refugee; the strange story of Nether Hall, by Arthur E. Becher. Cyrus Cuneo also illustrated his writing. His fiction included works about the Pygmies of the Upper Congo. He also depicted Boxer Rebellion era adventures. Some of his stories were serialized in magazines. Many of his stories are available online through resources such as Project Gutenberg."]}, {"page": "Ciro", "response": ["*Cyrus Cuneo (1879-1916), Italian American artist who was generally known as Ciro"]}, {"page": "Works by Harry Collingwood", "response": ["| style=\"text-align: center;\" | 27 || 1909 || The Cruise of the 'Thetis'; a tale of the Cuban Insurrection || style=\"text-align: center;\" | 367 || Blackie and Son Limited || Cyrus Cuneo || style=\"text-align: center;\" | 4"]}, {"page": "Nellie Tenison Cuneo", "response": ["Nellie Marion Tenison Cuneo  (26 August 186923 May 1953) was an illustrator and painter who trained in London and Paris. She was married to the American painter and illustrator Cyrus Cuneo  (18 June 187923 July 1916) and their youngest son was the English painter Terence Cuneo  RGI FGRA(1 November 19073 January 1996), known for using a mouse as his signature. ", "The 1881 census shows Tenison (age 11) as the only child at home with her parents, apparently under the care of Annie Florence Robinson (age 24), a governess. She studied at the Chiswick School of art from 18841886 and then, without the support of her family, at Sir Arthur Stockdale Cope's School of Art in South Kensington. By the time of the 1891 census, the Tenisons had moved to 215 Uxbridge Road, which was to remain the family both for Tenison's parents, and for Tenison's husband and children, Cyrus Cuneo's death in 1916.", "She then worked as a freelance illustrator, on publications like the Ludgate Magazine. By 1899 she had saved up enough money to go to Paris to study art, and she enrolled in the Académie Colarossi to train under Whistler, where she met Cyrus Cuneo. They returned to London to marry on in the last quarter of 1903. As Cuneo was an American citizen, Tenison ceased to be a British Subject on her marriage under the UK's 1870 Naturalisation Act.   She did not automatically gain US citizenship by marriage, as this was subject to her being eligible to naturalization (as determined by emigration officials whenever she landed in the United States, certain races and immoral persons, etc. being excluded). Thus, British women who married aliens from 1870 to 1933, when the law changed could become stateless persons. Tenison may not have been aware of this as she recorded her nationality as English in the 1911 census. After the death of her husband, Tenison applied for  naturalisation, and was re-admitted as a British subject on 27 July 1917."]}]}}