{"wiki_id": "http://www.wikidata.org/entity/Q21457348", "itemLabel": "Elizabeth Rivers", "itemDescription": "Irish artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Rivers", "wikipedia_page": {"main": "Elizabeth Joyce Rivers (1903-1964) was an Irish-based painter, engraver and illustrator.", "link_mentions": [{"page": "Aran Islands", "response": ["The cultural and physical history of the islands has made them the object of visits by a variety of writers. For example, Lady Gregory came to Aran in the late 19th century to learn Irish. At the start of the 20th century and throughout his life, Seán Keating spent time painting on the islands every year. Elizabeth Rivers also moved from London and lived in Aran, where she created two books of art and was herself visited by artists such as Basil Rakoczi."]}, {"page": "Cuala Press", "response": ["After Elizabeth Yeats died in 1940, the work of the press was carried on by two of her long-time assistants, Esther Ryan and Mollie Gill under the management of Georgie Hyde-Lees.A Brief Account of the Cuala Press Formerly the Dun Emer Press Founded by Elizabeth Corbet Yeats in MCMIII (1971) The final Cuala title was Stranger in Aran by Elizabeth Rivers, which was published on 31 July 1946.", "* A Picture Book O’Connor, Frank. . Illustrated By Elizabeth Rivers (1943)", "* Stranger in Aran Elizabeth Rivers. (1946)"]}, {"page": "St. Maelruain's Church, Tallaght", "response": ["There are a great many tombstones in the graveyard dating mainly from the 18th and 19th centuries, and some even from the 17th century. One of these commemorates Colonel John Talbot of Belgard who sat in the Parliament of King James II of England and took part in many important military engagements. The graves of the artists Oisin Kelly, Evie Hone and Elizabeth Rivers are in the new graveyard at St. Maelruain's. A survey of the graves was carried out by South Dublin County Council which recorded, amongst other information, locations of the graves, observations on their general condition, and details taken from the grave headstones where readable."]}, {"page": "List of Irish women artists", "response": ["*Elizabeth Rivers (1903–1964), stained-glass, painter, engraver, illustrator"]}, {"page": "Rivers, Elizabeth", "response": ["#redirectElizabeth Rivers"]}]}}