{"wiki_id": "http://www.wikidata.org/entity/Q2149130", "itemLabel": "Richard Brothers", "itemDescription": "early believer and teacher of Anglo-Israelism (alias British Israelism, a theory concerning the Lost Ten Tribes of Israel)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Brothers", "wikipedia_page": {"main": "Richard Brothers (25 December 1757 – 25 January 1824) was an early believer and teacher of British Israelism, a theory concerning the Lost Ten Tribes of Israel.", "link_mentions": [{"page": "British Israelism", "response": ["Aspects of British Israelism and its influences have also been traced to Richard Brothers, who published A Revealed Knowledge of the Prophecies and Times in 1794, John Wilson's Our Israelitish Origin (1844), and John Pym Yeatman's The Shemetic Origin of the Nations of Western Europe (1879).", "* Richard Brothers (1757–1824), an early believer and teacher/promoter of this teaching"]}, {"page": "Timeline of Zionism", "response": [";1794: Richard Brothers, a millenarianist, Christian restorationist, a false prophet and the founder of British Israelism, writes A revealed knowledge of the prophecies & times, predicting the return of the Jews to Jerusalem in 1798 where they will be converted to Christianity."]}, {"page": "New Jerusalem", "response": ["Richard Brothers, the originator of British Israelism, developed a viewpoint that the British are descended from the Lost Tribes of Israel, and that the capital city of Britain should therefore be re-modeled as a New Jerusalem for the coming Age of Enlightenment. Supposedly this idea was already present in 16th Century England, and that it reached its height of influence during and just after the First World War; certain buildings, such as St Paul's Cathedral, supposedly contain elements of the plan in their design."]}, {"page": "Nathaniel Brassey Halhed", "response": ["In 1785 Halhed returned to England, and from 1790–1795 was Member of Parliament for Lymington, Hants. For some time he was a disciple of Richard Brothers, and a speech in parliament in defence of Brothers made it impossible for him to remain in the House of Commons, from which he resigned in 1795. He subsequently obtained a home appointment under the East India Company. He died in London on 18 February 1830.", "Halhed began to look for a parliamentary career: his choice of enemies made him a Tory. His first candidature, at  in 1790, failed and cost him a great deal. He succeeded in acquiring a seat in May 1791 at the borough of Lymington, in Hampshire. His life was changed in 1795 by Richard Brothers and his prophecies. A revealed knowledge of the Prophecies and Times appealed to Halhed and resonated with the style of antique Hindu texts. He petitioned for Brothers in parliament when he was arrested for criminal lunacy. Unsuccessful, he damaged his own reputation.", "In the decade of Hastings's impeachment, Halhed remained involved in the war of pamphlets. The Upanisad (1787) was based on Dara Shikoh's Persian translation. He wrote and distributed a Testimony of the Authenticity of the Prophecies of Richard Brothers, and of his Mission to recall the Jews. Scandalously, he identified London with Babylon and Sodom: and was judged eccentric or mad."]}, {"page": "William Sharp (engraver)", "response": ["He became a convert to the teachings of Mesmer and Swedenborg and came under the religious influence of would-be visionary Jacob Bryan (who worked for Sharp as a printer for a time), and millennialist prophet Richard Brothers, engraving the latter as \"Prince of the Hebrews\". After Brothers' incarceration in an insane asylum in Islington, Sharp became an adherent of prophetess Joanna Southcott, whom he brought from Exeter to London and kept at his own expense for a considerable time; he made a portrait drawing of her which he engraved.Portrait of Joanna Southcott. Despite her apparently premature death, he never lost faith in her divine mission or the possibility that she would reappear, and wrote a book in her defence: \"An answer to the world etc.\" (London, 1806).Sharp, William. An answer to the world etc. (London, 1806)"]}, {"page": "Serpent seed", "response": ["British Israelism traces its roots to Richard Brothers (1759–1824) who was one of the earliest promoters of the theology and published a tract on the topic in 1794. John Wilson (1788–1870), and Edward Hine (1825–1891) followed Brothers in promoting the doctrine in the mid-1800s and each of them also published books on the topic and acquired a large following within various Christian denominations. Elements of their teachings gradually became popular among members of the Church of England.Schambers, p. 2Gardell, Mattias (2003). Gods of the Blood: The Pagan Revival and White Separatism. Durham, NC: Duke University Press. p. 372. Each of them published books on the topic and they also acquired a growing number of followers within various Christian denominations.Schambers, p. 2Gardell, Mattias (2003). Gods of the Blood: The Pagan Revival and White Separatism. Durham, NC: Duke University Press. p. 372. According to the Anti-Defamation League, the earliest versions of the teaching did not seem to be racially motivated, but that began to change as the theology was introduced in the United States. The theology arrived in the United States through British Israelite evangelists in the mid-19th century. Rev. Joseph Williams (1826–1882), who immigrated from the UK to the USA, was probably the first such evangelist. He lectured on the subject in Boston from 1874 until his death in 1882. His teachings on the subject were published in two periodicals, The Trio and The Trumpet of Israel. Rev. Joseph Wild (1834–1908) immigrated from England to Brooklyn during the 1880s. He became the preeminent American promoter of British Israelism. He published multiple books on the subject and influence many white Americans with his teachings.Schambers, p. 3"]}, {"page": "A Revealed Knowledge of the Prophecies and Times", "response": ["#REDIRECT Richard Brothers"]}, {"page": "Donna Kossy", "response": ["In 1994, Feral House published Kossy's first book, Kooks: A Guide to the Outer Limits of Human Belief, an anthology containing updated articles from her zine along with articles written exclusively for the book, with the cover illustration painted by her husband. Organized into seven parts (Religion, Science, Metaphysics, Politics, Conspiracy, Enigmas; plus Outtakes in the 2nd ed.), it documented the rants and ravings of \"kooks\" such as Richard Brothers (Anglo-Israelism alias British Israelism), Charles E. Buon (God's Envoy to the U.S.A.), Ray Crabtree (The Philosopher King), the first biography of Francis E. Dec (Your Only Hope against the Gangster Computer God), Professor Arnold Ehret (Mucusless Diet Healing System), Joe Gould alias Professor Seagull (The Longest Book Ever Written), Jim and Lila Green (Aggressive Christianity Missionary Training Corps), Hillman Holcomb (Well Regulated Militia of Christian Technocracy), Les U. Knight (Voluntary Human Extinction Movement), alien abductee artist Paul Laffoley (Third Generation Lunatic Fringe), Alfred Lawson (Lawsonomy: The Base for Absolute Knowledge), David Linton (How Men Can Have Babies), Emil Matalik (World/U.S. Presidential Candidate Since 1964), the MIT's crank files (The Archive of Useless Research), Rose Mokry (Jewish Poisoners Are the Sole Producers of All the Diseases, Sudden Deaths and Birth Defects), Dr. Cyrus Teed (not Cyrus Tweed) alias Koresh (Koreshanity: We Actually Live on the Inside of the Earth), black supremacist Dwight York alias Malachi Z. York et al. (Ansaaru Allah Community of Nuwaubianism), etc."]}, {"page": "Port Kirwan", "response": ["It is The Birthplace of Richard Brothers who was a well known early believer and teacher of Anglo-Israelism. He was born there on December 25, 1757 and died in London, England on January 25, 1824."]}, {"page": "Jezreel's tower", "response": ["The sect, however, continued and was expanded upon by other \"prophets\", including Richard Brothers, George Turner, William Shaw and John Wroe. Brothers and Turner were committed to asylums but Wroe attracted a strong following in Ashton-under-Lyne (now in Greater Manchester). Groups of supporters appeared in the south, including Chatham."]}, {"page": "1989 Chicago Bears season", "response": ["| Richard Brothers"]}, {"page": "Edward Hine", "response": ["Edward Hine (10 February 1825 – 15 October 1891) was an influential proponent of British Israelism in the 1870s and 1880s, drawing on the earlier work of Richard Brothers (1794) and John Wilson (1840). Hine went as far as to conclude that \"It is an utter impossibility for England ever to be defeated. And this is another result arising entirely from the fact of our being Israel.\""]}, {"page": "Joseph Moser", "response": ["* Anecdotes of Richard Brothers 1795"]}, {"page": "List of dates predicted for apocalyptic events", "response": ["|While campaigning for Richard Brothers' release, Halhead proclaimed that the world would end on this day.", "|Richard Brothers"]}, {"page": "John Finlayson (disciple)", "response": ["John Finlayson or Finleyson (1770–1854) was a disciple of Richard Brothers. Finlayson was born in Scotland in 1770. His descendants make him the second son of Colonel John Hamilton M'Finlay, who married, about 1765, Lady Elizabeth Mary Alexander, eldest sister of the last Earl of Stirling. He was originally a writer at Cupar, Fife, and removed thence to Edinburgh. His relations with Brothers, which began in 1797, are detailed in the article on that enthusiast. He printed at Edinburgh a couple of pamphlets before repairing to London. In London he was 'in considerable practice as a house agent.' Brothers led him to change the spelling of his name, by telling him his ancestors had some 'fine leys' of land granted them for deeds of valour. Brothers, who died (1824) in Finlayson's house at Marylebone, made it his dying charge to his friend that he should write against a rival genius, Bartholomew Prescot of Liverpool. This Finlayson did, describing Prescot's 'System of the Universe,' very correctly, as a 'misapprehended mistaken elaborate performance, or book.'", "# 'An Admonition to the People of all Countries in support of Richard Brothers,' 8vo (dated Edinburgh, 7 September 1797). ", "He married, in 1808, Elizabeth Anne (d. 1848), daughter of Colonel Basil Bruce (d. 1800), and had ten children. His eldest son, Richard Brothers Finlayson, who took the name of Richard Beauford, was a photographer at Galway, where he died on 17 December 1886, aged 75."]}, {"page": "Walley Chamberlain Oulton", "response": ["Between 2 January and 26 February 1787, he produced a tri-weekly sheet, called The Busybody, on the model of The Spectator; at the twenty-fifth number it ceased. The whole work was issued in two volumes in 1789.‘The Busybody: a Collection of Periodical Essays, Moral, Whimsical, Comic, and Sentimental, by Mr. Oulton, Author of several Fugitive Pieces,’ London. In 1795 he published, under the pseudonym of ‘George Horne, D.D.,’ two tracts attacking the pretensions of Richard Brothers the prophet and of his disciple Nathaniel Brassey Halhed. The first was entitled ‘Sound Argument, dictated by Common-sense’ (Oxford, 1795); the second, ‘Occasional Remarks addressed to N. B. Halhed, Esq.’ (London, 1795)."]}, {"page": "Predictions and claims for the Second Coming", "response": ["| Richard Brothers"]}, {"page": "Brothers (surname)", "response": ["*Richard Brothers (1757–1824), Canadian religious leader and author"]}, {"page": "Nephew of God", "response": ["#REDIRECT Richard Brothers"]}, {"page": "William Hamilton Reid", "response": ["Reid took issue with evangelicals and their literature, such as the Evangelical Magazine and its reporting of missionary work. He warned also against the numerous \"fanatical preachers\" of low backgrounds, such as Richard Brothers.Alfred Rubens, Portrait of Anglo-Jewry 1656←1836, Transactions (Jewish Historical Society of England) Vol. 19 (1955–59), pp. 13–52, at p. 34. Published by: Jewish Historical Society of England. Stable URL: https://www.jstor.org/stable/29777944 Commentary in John Brewster's Secular Essay of 1802 clarifies that street preachers to whom Reid objected, of Spa Fields and Islington, included Calvinistic Methodists, many of them young men, associated with Lady Anne Agnes Erskine's connexion."]}, {"page": "Brothers, Richard", "response": ["#redirectRichard Brothers"]}]}}