{"wiki_id": "http://www.wikidata.org/entity/Q214513", "itemLabel": "Mark Hughes", "itemDescription": "Welsh association football player and manager", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Hughes", "wikipedia_page": {"main": "Leslie Mark Hughes, OBE (born 1 November 1963) is a Welsh former football manager and player, who most recently managed Southampton.\nDuring his playing career he usually operated as a forward or midfielder. He had two spells at Manchester United, and also played for Barcelona and Bayern Munich, as well as the English clubs Chelsea, Southampton, Everton and finally Blackburn Rovers. He made 72 appearances for Wales scoring 16 goals. He won a host of winners' medals during his playing career, including two Premier League titles, four FA Cups, three League Cups and two European Cup Winners' Cups. He also collected an FA Cup runners-up medal and a League Cup runners-up medal. Hughes was the first player to win the PFA Players' Player of the Year award twice, in 1989 and 1991. He retired from playing in 2002. \nHis reign as Wales manager was his first managerial post; he was appointed in 1999 and remained in the role until 2004. He failed to qualify for a World Cup or European Championship during his five years in charge, although his reign coincided with a marked improvement in results. Wales came particularly close to securing 2004 European Championship qualification. Hughes then spent four years in charge of Blackburn, guiding them to sixth place in 2005–06. He took charge of Manchester City in June 2008 for a year and a half before spending the 2010–11 season at Fulham. He joined Queens Park Rangers in January 2012, helping them retain their Premier League status in 2011–12. Despite some high-profile signings in the summer of 2012, QPR began the 2012–13 season in very poor form, and Hughes was dismissed on 23 November 2012.Hughes was appointed manager of Stoke City on 30 May 2013. He guided the club to three consecutive ninth-place Premier League finishes in 2013–14, 2014–15 and 2015–16. Progress at Stoke stalled in the 2016–17 season, with the club finishing 13th in the table. Following a poor start to the 2017–18 season, with the club in the relegation zone heading into the new year, he was dismissed by Stoke on 6 January 2018, hours after an FA Cup third round exit to League Two side Coventry City. He was appointed manager of Southampton on 14 March 2018, signing a contract until the end of the season, with Southampton one point above his former club Stoke in 17th place at the time of his appointment. He guided the club to safety at the end of the 2017–18 season, but was dismissed in December 2018 with the club at 18th in the table.", "link_mentions": [{"page": "Chelsea F.C.", "response": ["|1997|| Mark Hughes"]}, {"page": "David Beckham", "response": ["United manager Sir Alex Ferguson had a great deal of confidence in the club's young players. Beckham was part of a group of young talents Ferguson brought into United in the 1990s (known as \"Fergie's Fledglings\"), which included Nicky Butt and Gary and Phil Neville. When experienced players Paul Ince, Mark Hughes, and Andrei Kanchelskis left the club after the end of the 1994–95 season, his decision to let youth team players replace them instead of buying star players from other clubs (United had been linked with moves for players including Darren Anderton, Marc Overmars and Roberto Baggio, but no major signings were made that summer), drew a great deal of criticism. The criticism increased when United started the season with a 3–1 defeat at Aston Villa,The most famous comment was Alan Hansen's \"You can't win anything with kids\", quoted in The Boss 405. Beckham scored United's goal (his first for them in the league) from a distance of around 30 metres. with Beckham scoring United's only goal of the game. However, United recovered from this early season defeat and the young players performed well.", "At the beginning of the 1996–97 season, Beckham was given the number 10 shirt that had most recently been worn by Mark Hughes. On 17 August 1996 (the first day of the Premier League season), Beckham became something of a household name when he scored a spectacular goal in a match against Wimbledon. With United leading 2–0, Beckham noticed that Wimbledon's goalkeeper Neil Sullivan was standing a long way out of his goal, and hit a shot from the halfway line – 57 yards out – that floated over the goalkeeper and into the net.Sky Sports' commentator Martin Tyler's words \"You'll see that over and over again\" proved prophetic as the goal was voted Premier League Goal of the Decade in 2003."]}, {"page": "Fulham F.C.", "response": ["On 29 July 2010, Mark Hughes was named the successor to Hodgson, signing a two-year contract with the club. Hughes had previously managed Manchester City, the Welsh national team and Blackburn. Hughes' first match in charge was against Bolton Wanderers at the Reebok Stadium. The highlight of the season was a 4–0 win in the FA Cup over London rivals Tottenham Hotspur, all goals coming in the first half. Hughes resigned as manager of Fulham on 2 June 2011, having spent fewer than 11 months at the club. The Whites had an encouraging finish in eighth position and qualified for the Europa League via Fairplay.", "|| Mark Hughes", "*Several managers have failed to last more than a year at the club: Bobby Robson, Ray Wilkins, Paul Bracewell, Lawrie Sanchez, Mark Hughes, René Meulensteen, Felix Magath, and Claudio Ranieri. Further to this, Frank Osborne only had a year after his initial arrival at the club during which he was principally in charge of the team (before Dodgin, senior) arrived, although he later took sole charge of the club for an extended period.", "*Ray Lewington: took temporary charge of Fulham for three games following Lawrie Sanchez's dismissal in December 2007.  Lewington also took temporary charge of the club in July 2010 after Roy Hodgson had left the club until the appointment of Mark Hughes."]}, {"page": "Gary Lineker", "response": ["After winning the Golden Boot at the 1986 World Cup in Mexico, Lineker was signed by Barcelona for £2.8 million. Barcelona were being managed by former Queens Park Rangers manager Terry Venables, who had also brought in Manchester United and Wales striker Mark Hughes. Barcelona gave Lineker his first chance of European football, as Leicester had never qualified for Europe while he played for them, and Everton were denied a place in the European Cup for 1985–86 due to the ban on English clubs in European competitions following the Heysel disaster.", "Manchester United manager Alex Ferguson attempted to sign Lineker to partner his ex-Barcelona teammate Mark Hughes in attack, but Lineker instead signed for Tottenham Hotspur in July 1989 for £1.1 million. Over three seasons, he scored 67 goals in 105 league games and won the FA Cup while playing for the club. He finished as top scorer in the First Division in the 1989–90 season, scoring 24 goals as Spurs finished third."]}, {"page": "November 1", "response": ["*  1963   – Mark Hughes, Welsh footballer and manager"]}, {"page": "1963", "response": ["** Mark Hughes, Welsh football player & manager"]}, {"page": "Alex Ferguson", "response": ["United were expected to do well when Mark Hughes returned to the club two years after leaving for Barcelona, but the 1988–89 season was a disappointment for them, finishing 11th in the league and losing 1–0 at home to Nottingham Forest in the FA Cup sixth round. They had begun the season slowly, going on a nine-match winless run throughout October and November (with one defeat and eight draws) before a run of generally good results took them to third place and the fringes of the title challenge by mid February. However, another run of disappointing results in the final quarter of the season saw them fall down to mid-table.", "After a slow start to the 1992–93 season by sitting 10th at the beginning of November, it looked as though United would miss out on the league title yet again. However, after the purchase of French striker Eric Cantona from Leeds for £1.2 million, the future of Manchester United, and Ferguson's position as manager, began to look bright. Cantona formed a strong partnership with Mark Hughes. On 10 April 1993, United were second in the league when they faced Sheffield Wednesday at home. United were losing with four minutes to go before Steve Bruce equalised. After 7 minutes of injury time – which was subsequently dubbed “Fergie Time”, alluding to extra minutes allegedly being granted to Ferguson’s teams to get a goal – Bruce scored the 97th minute winner, with Ferguson celebrating the goal by running from his dugout on to the touch line, while assistant Brian Kidd ran on to the field. Seen as being a decisive victory, it put United top of the league, where they remained. Winning the title ended United's 26-year wait for a league title, and also made them the first Premier League champions. United finished with a ten-point margin over runners-up Aston Villa, whose 1–0 defeat at Oldham Athletic on 2 May 1993 had given United the title. Ferguson was later voted Manager of the Year by the League Managers' Association.", "Ferguson was heavily criticised in the summer of 1995 when three of United's star players were allowed to leave and replacements were not bought. First Paul Ince moved to Internazionale of Italy for £7.5 million, long-serving striker Mark Hughes was sold to Chelsea in a £1.5 million deal, and Andrei Kanchelskis was sold to Everton. Ferguson felt that United had a number of young players who were ready to play in the first team. The youngsters, who would be known as \"Fergie's Fledglings\", included Gary Neville, Phil Neville, David Beckham, Paul Scholes and Nicky Butt, who would all go on to be important members of the team. And so the 1995–96 season began without a major signing, at a time when the likes of Arsenal, Liverpool and Newcastle were making the headlines with big-money signings.", "Many of Ferguson's former players have gone on to become football managers themselves, including Tony Fitzpatrick, Alex McLeish, Gordon Strachan, Mark McGhee, Willie Miller, Neale Cooper, Bryan Gunn, Eric Black, Billy Stark, Bryan Robson, Steve Bruce, Mark Hughes, Roy Keane, Paul Ince, Chris Casper, Mark Robins, Darren Ferguson, Ole Gunnar Solskjær, Henning Berg, Andrei Kanchelskis, Michael Appleton, Ryan Giggs, David Healy, Gabriel Heinze, Paul Scholes, Gary Neville, Jaap Stam, and Phil Neville. Three of these have subsequently managed Manchester United: Giggs (interim player-manager in 2014), Solskjær (2018 to 2021), and Carrick (interim manager in 2021)."]}, {"page": "Ruud Gullit", "response": ["In July 1995, Gullit signed for Chelsea on a free transfer. Initially played as sweeper by manager Glenn Hoddle with limited success, Gullit was moved to his more familiar role in midfield, where he scored six goals. The signing of Gullit, alongside the likes of Mark Hughes and Dan Petrescu, propelled Chelsea to the semi-final of the FA Cup but their league form was disappointing."]}, {"page": "Southampton F.C.", "response": ["In June 2016, Koeman left Southampton to join Everton and Claude Puel replaced him on a three-year contract. The club were eliminated in the group stage of the Europa League but were more successful in the EFL Cup, where they lost 3–2 in the final to Manchester United. The club ended the 2016–17 season in eighth. During the summer, Puel was replaced as manager by Argentine coach Mauricio Pellegrino, previously of Deportivo Alavés. In mid-season, the club sold Dutch defender Virgil van Dijk to Liverpool for an estimated £75 million, Southampton's record sale and a world record for his position. Pellegrino was sacked in March 2018 with the team 1 point above the relegation zone, and his replacement, former player, Mark Hughes, guided the club to a 17th-place finish, avoiding relegation on the last day of the season. Hughes signed a new contract at the end of the season but a poor start to the following season led to him being sacked in December 2018 with the team in 18th place. He was replaced with former RB Leipzig boss Ralph Hasenhüttl, who steered the club away from relegation to finish 16th."]}, {"page": "Queens Park Rangers F.C.", "response": ["In January 2012, club chairman Tony Fernandes appointed Mark Hughes as team manager 36 hours after the previous incumbent Neil Warnock was sacked. Following a tough start to his Loftus Road career and after a run of five straight home wins, Hughes and QPR escaped relegation despite a dramatic 3–2 defeat at Manchester City on the last day of the season.", "On 23 November 2012, Mark Hughes was sacked on the back of a poor start to the 2012–13 season, having amassed only four points in 12 games and with the club languishing at the bottom of the Premier League despite significant financial investment in new players in the 11 months of Hughes' tenure. A day later, Harry Redknapp was confirmed as the new manager. On 28 April 2013, in a 0–0 draw against fellow relegation rivals Reading, and with three games of the season to play, QPR were relegated from the Premier League down to the Championship after two seasons in the top flight."]}, {"page": "Everton F.C.", "response": ["*  Mark Hughes (2007 inductee)"]}, {"page": "Munich air disaster", "response": ["In the midst of the preparations, former United player Eric Cantona, who had retired from football to pursue a career in film in 1997, expressed an interest in returning to Manchester United for a farewell match. Edwards took the opportunity to combine the two events into one.Morrin, pp. 203–204. Due to Cantona's acting career, his schedule meant that he would not be available in February 1998 and the match was moved to 18 August, with the opposition to be a European XI chosen by Cantona; the side selected by Cantona featured the likes of French internationals Laurent Blanc, Pascal Vahirua and Jean-Pierre Papin, England's Paul Gascoigne, former Manchester United players Bryan Robson and Mark Hughes, and Cantona's brother Joël. Cantona himself played the first half of the match for the European XI, before switching sides at half-time. Manchester United ultimately won the match 8–4, with goals from Ryan Giggs, Paul Scholes, Jordi Cruyff, Phil Neville, Nicky Butt, Alex Notman (2) and Cantona, while Papin, Blanc, Martin Dahlin and United player Mark Wilson were the scorers for the European XI."]}, {"page": "Manchester City F.C.", "response": [" Eriksson was replaced by Mark Hughes two days later on 4 June 2008.", "By 2008, the club was in a financially precarious position. Thaksin Shinawatra had taken control of the club the year before, but his political travails saw his assets frozen. Then, in August 2008, the club was purchased by the Abu Dhabi United Group. The takeover was immediately followed by a flurry of bids for high-profile players; the club broke the British transfer record by signing Brazilian international Robinho from Real Madrid for £32.5 million. There wasn't a huge improvement in performance compared to the previous season despite the influx of money however, with the team finishing tenth, although they did well to reach the quarter-finals of the UEFA Cup. During the summer of 2009, the club took transfer spending to an unprecedented level, with an outlay of over £100 million on players Gareth Barry, Roque Santa Cruz, Kolo Touré, Emmanuel Adebayor, Carlos Tevez and Joleon Lescott. In December 2009, Mark Hughes – who had been hired shortly before the change in ownership but was originally retained by the new board – was replaced as manager by Roberto Mancini. City finished the season in fifth position in the Premier League, narrowly missing out on a place in the Champions League, and competed in the UEFA Europa League in season 2010–11.", "| style=\"text-align:left;\"|  Mark Hughes || forward || manager || 2008–2009"]}, {"page": "Wayne Rooney", "response": ["On 8 January, Rooney scored two goals in the 3–2 win over Manchester City at the City of Manchester Stadium in the FA Cup third round. With these goals, Rooney passed Mark Hughes in United's all-time top goalscorers table, moving up to seventh place overall with 164 goals. On 14 January, Rooney made a big contribution to his team in a 3–0 home win against Bolton. Although he missed a penalty, he did create two goals by assisting Paul Scholes for the first goal and Danny Welbeck for the second. On 5 February, Rooney scored twice from the penalty spot as United came back from a 3–0 deficit to draw 3–3 in a Premier League clash against Chelsea at Stamford Bridge. On 11 February 2012, Rooney marked his 500th senior career game by scoring two goals as Manchester United beat rivals Liverpool 2–1 at Old Trafford. This was also his 350th game for United in all competitions. On 4 March, Rooney scored the first goal in a 3–1 away win against Tottenham at White Hart Lane and passed Joe Spence in Manchester United's all-time top goalscorers table, moving up to sixth place overall with 169 goals. He scored another brace in his next game, against Atletico Bilbao in the UEFA Europa League.\"Man Utd 2–3 Atletico Bilbao\" 8 March 2012. Retrieved 8 March 2012. On 11 March, Rooney scored the two goals that brought United the victory against West Brom in a 2–0 home win. On 15 March, Rooney scored in the second leg of the Europa League tie against Athletic Bilbao in Bilbao despite United losing 2–1 on the night and 5–3 on aggregate. In the final day of the season, Rooney put United ahead against Sunderland. Their rivals for the Premier League title, Manchester City, were losing 2–1 in their game going into injury time, so Rooney's winner looked like it would seal the title. However, Manchester City scored twice in injury time, the clincher a 94th-minute winner from Sergio Agüero, to take the trophy.\"Man City snatch dramatic Premier League title win\". BBC. Retrieved 13 May 2012"]}, {"page": "Eric Cantona", "response": ["Cantona quickly settled into the team, slotting in alongside Mark Hughes, while Brian McClair was switched to midfield. Cantona contributed greatly to a quick upturn in the team's fortunes, not only scoring goals but also creating chances for the other players. His first United goal came in a 1–1 draw against Chelsea at Stamford Bridge on 19 December 1992, and his second came on Boxing Day in a 3–3 draw against Sheffield Wednesday at Hillsborough, where they claimed a point after being 3–0 down by the hour mark. However, controversy was never far away, and on his return to Elland Road to play Leeds a few weeks later, he spat at a fan and was fined £1,000 by The Football Association. United only lost twice in the league after Cantona's arrival, and finished the season 10 points clear at the top of the table, finishing as champions for the first time in 26 years, and making Cantona the first player to win consecutive English top division titles with different clubs. He had won a domestic league title with different clubs for three successive seasons, having helped Marseille win the French league title in 1991."]}, {"page": "Stoke City F.C.", "response": ["Pulis was replaced by fellow Welshman Mark Hughes, who signed a three-year contract on 30 May 2013. Hughes led Stoke to a ninth-place finish in 2013–14, their highest position in the Premier League and best finish since 1974–75. The 2014–15 season saw Stoke again finish in ninth position this time, with 54 points. Despite breaking their transfer record twice on Xherdan Shaqiri and then Giannelli Imbula, in 2015–16, Stoke did not make any progress and finished in ninth position for a third season running. Stoke declined in 2016–17, finishing in 13th position. In January 2018, Hughes was sacked after a poor run left the club in the relegation zone. He was replaced by Paul Lambert, who could not prevent the club ending its 10-year spell in the Premier League.", "|  Mark Hughes"]}, {"page": "Sparky", "response": ["*Mark Hughes (born 1963), former Welsh international football player and manager"]}, {"page": "Thierry Henry", "response": ["*Most  PFA Players' Player of the Year wins: 2 (2002–03 & 2003–04) (shared with Gareth Bale, Alan Shearer, Mark Hughes & Cristiano Ronaldo)"]}, {"page": "Blackpool F.C.", "response": ["On 28 August 2010 Blackpool played Fulham in their first-ever home Premier League game, in front of a crowd of 15,529, the largest attendance for over 30 years at Bloomfield Road. On Sky Sports' Football First programme, co-commentator Barry Horne said: \"They are a fantastic crowd. I've watched a lot of Championship games here and the crowd have always been brilliant; they get behind their team.\" Commentator Will Cope later said: \"It's deafening; deafening by the seaside. You wouldn't have thought 15,000 fans could make so much noise.\" After the game Fulham manager Mark Hughes also praised the home support saying that the atmosphere in the stadium would really help the team in their debut season in the Premier League."]}]}}