{"wiki_id": "http://www.wikidata.org/entity/Q21464740", "itemLabel": "Edward Stott", "itemDescription": "(1859 - 1918) English painter", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Stott", "wikipedia_page": {"main": "Edward Stott  (24 April 1855 – 19 March 1918) was an English painter of the late Victorian to early twentieth century period. He trained in Paris under Carolus Duran and was strongly influenced by the Rustic Naturalism of Bastien-Lepage and the work of the Impressionists which he married with the English landscape tradition of John Linnell and Samuel Palmer. In the mid 1880s he settled in rural Sussex where he was the central figure in an artistic colony. His forte was painting scenes of domestic and working rural life and the surrounding landscapes often depicted in fading light. Stott's work achieved critical and commercial success at home and in Europe in his lifetime but his style of painting became unfashionable in the aftermath of the Great War and much of his work is now neglected and unconsidered.", "link_mentions": [{"page": "En plein air", "response": ["In England the Newlyn School was also a major proponent of the technique in the latter 19th century. There were lesser known artist colonies practising , including a loose collective at Amberley in West Sussex centred around the Paris trained Edward Stott who produced atmospheric rural landscapes that were highly popular to some late Victorians.Valerie Webb (2018), Edward Stott (1855 – 1918):A Master of Colour and Atmosphere, Sansom & Company, Bristol, England. ", "* Edward Stott"]}, {"page": "Beaux-Arts de Paris", "response": ["* Edward Stott, painting"]}, {"page": "Alexandre Cabanel", "response": ["* Edward Stott"]}, {"page": "Amberley, West Sussex", "response": ["There is a memorial in the churchyard to Edward Stott RA who lived in Amberley from 1889 until he died in 1918. He is noted for his rural scenes, many sketched close to Amberley. His monument has a bust on top carved by the sculptor Francis Derwent Wood. Wood's  grave is marked with one of his own works, a pieta in bronze. Inside the church is a semi-circular stained glass window to Stott, designed by Robert Anning Bell. Other windows have inscriptions by Eric Gill and his assistant Joseph Cribb. In the church, south of the chancel arch are 12th or 13th century wall-paintings, depicting scenes from the Passion Cycle.", "*Edward Stott (1855 -1918)", "* Valerie Webb (2018), Edward Stott (1855 – 1918): A Master of Colour and Atmosphere, Samsom & Company, Bristol, England. "]}, {"page": "William Stott (artist)", "response": ["From the year 1882, Stott always signed himself 'of Oldham' – both to distinguish himself from another Lancastrian son of a mill-owner, Edward Stott ARA (1855–1918) and to acknowledge his proud Oldham roots."]}, {"page": "Robert Anning Bell", "response": ["File:Edward Stott Memorial Window.jpg|Stained-glass memorial for Edward Stott ARA at St.Michael's Church, Amberley, West Sussex"]}, {"page": "Arthur Tomson", "response": ["Tomson was born at Chelmsford, Essex, on 5 March 1859. He was the sixth child of Whitbread Tomson by his wife Elizabeth Maria. From a preparatory school at Ingatestone in Essex he went to Uppingham. As a lad he developed an interest in art, and on leaving school he enrolled in a course in Düsseldorf. Returning to England in 1882. he settled down to landscape painting, working chiefly in Sussex and Dorset. His landscapes were poetic, and rather similar in sentiment to the art of George Mason and Edward Stott. Although he was at his best in landscape, cats were favourite subjects of study, and he occasionally painted other animals."]}, {"page": "Hilary Stratton", "response": ["Stratton was born in Amberley in West Sussex, the son of Frederick Stratton, a commercial painter and watercolorist and Lucy Stratton. Amberley and the neighbouring hamlet of North Stoke were the centre of an artistic community that included Edward Stott who settled in Amberley in the late 1880s and which over the next forty years attracted many aspiring artists and musicians including some that became eminent such as Arthur Rackham and John Ireland.http://www.amberleysociety.org.uk/AS%20Newsletter%20April%202011.pdf The Amberley Society, Newsletter 2011 His father who in the 1920s had a studio in ChelseaCharles Rennie Mackintosh Society, Journal No 98, Spring 2014, page 31 was a major influence on the young Stratton, encouraging him to practice with different materials and when Stratton Jr was just twelve he carved a Portland stone figure of an ancient Egyptian supporting a bowl under his knees."]}]}}