{"wiki_id": "http://www.wikidata.org/entity/Q21538587", "itemLabel": "Chris Evans", "itemDescription": "English sculptor", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Evans_(artist)", "wikipedia_page": {"main": "Chris Evans is a British artist based in London and a tutor at De Ateliers in Amsterdam. He was the bassist for the now-defunct band Life Without Buildings.\n\n", "link_mentions": [{"page": "Christopher Evans", "response": ["Christopher Evans or Chris Evans may refer ", "* Chris Evans (actor) (born 1981), American actor", "* Chris Evans (presenter) (born 1966), British broadcaster", "* Chris Evans (artist) (born 1967), British artist", "* Chris Evans (Australian politician) (born 1958), member of the Australian Senate", "* Chris Evans (British politician) (born 1977), British Labour Co-operative politician", "* Chris Evans (American football) (born 1997), American football running back for the Cincinnati Bengals", "* Chris Evans (footballer) (born 1962), Welsh footballer and manager", "* Chris Evans (ice hockey) (1946–2000), Canadian professional ice hockey player", "* Chris Evans (basketball) (born 1991), American pro basketball player", "* Chris Evans (journalist) (born 1969), editor of The Daily Telegraph", "*Christopher Evans-Ironside or Chris Evans, English/German composer and musician"]}, {"page": "Life Without Buildings", "response": ["Named after a track by English new wave band Japan, Life Without Buildings formed during the summer of 1999. The band consisted mostly of ex-students of the Glasgow School of Art, Initial band members were Will Bradley (drums), Chris Evans (bass) and Robert Johnston (guitar). Painter Sue Tompkins (vocals) joined later in 1999. The band split writing duties, with Johnston, Bradley and Evans writing the music while Tompkins wrote the vocals. Tompkins' \"talk-sung\" vocal styling eventually became the band's most famous attribute. Impressed after their first London gig, the Rough Trade-affiliated Tugboat label asked the band to record a debut single."]}, {"page": "Any Other City", "response": ["Sue Tompkins' unique vocal style was singled out in multiple reviews. While John Mulvey of NME compared Tompkins' voice to \"the scrape of fingernails on a blackboard,\" opining that \"only mad people and immediate family could warm to Tompkins,\" other critics were more receptive. Jenn Sikes of Splendid praised Tompkins' vocals, stating, \"The chewed word-bits are like little metronomes, counting beats between her  words, which are spoken/sung in a cheery Scottish accent that's childlike but fierce.\" Kellman commented that \"[h]er repet-pet-petitive repetitive style might be at odds with the ears of some listeners, but it's just as unique as the exuberant vocals\" employed by Tompkins' influences. Connor McEleney of Structured Harmony praised bassist Chris Evans by describing him as \"the stronghold underneath which Tompkins makes her unique sound palatable.\"", "*Chris Evans – bass"]}, {"page": "Objectif Exhibitions", "response": ["* Chris Evans (2009)", "Mai Abu ElDahab, Binna Choi, Emily Pethick, \"Circular Facts,\" Mai Abu ElDahab, \"From Berkeley to Berkeley: Objectif Exhibitions 2008–2010,\" Chris Evans, Will Holder, Lisette Smits, \"Goofy Audit,\" Hassan Khan, \"The Agreement,\" Michael Portnoy, \"Script opposition in Late-Model Carrot Jokes\""]}, {"page": "De Ateliers", "response": ["*Chris Evans "]}]}}