{"wiki_id": "http://www.wikidata.org/entity/Q215838", "itemLabel": "John Peter Zenger", "itemDescription": "a German printer and journalist in New York City", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Peter_Zenger", "wikipedia_page": {"main": "John Peter Zenger (October 26, 1697 – July 28, 1746) was a German printer and journalist in New York City. Zenger printed The New York Weekly Journal. He was accused of libel in 1734 by William Cosby, the royal governor of New York, but the jury acquitted Zenger, who became a symbol for freedom of the press.In 1733, Zenger began printing The New York Weekly Journal, which voiced opinions critical of the colonial governor, William Cosby. On November 17, 1734, on Cosby's orders, the sheriff arrested Zenger. After a grand jury refused to indict him, the Attorney General Richard Bradley charged him with libel in August 1735. Zenger's lawyers, Andrew Hamilton and William Smith, Sr., successfully argued that truth is a defense against charges of libel.", "link_mentions": [{"page": "August 5", "response": ["*1735 – Freedom of the press: New York Weekly Journal writer John Peter Zenger is acquitted of seditious libel against the royal governor of New York, on the basis that what he had published was true."]}, {"page": "Defamation", "response": ["An early example of libel is the case of John Peter Zenger in 1735. Zenger was hired to publish the New York Weekly Journal. When he printed another man's article that criticized William Cosby, who was British royal governor of Colonial New York, Zenger was accused of seditious libel. The verdict was returned as not guilty on the charge of seditious libel, because it was proven that all the statements Zenger had published about Cosby had been true, so there was not an issue of defamation. Another example of libel is the case of New York Times Co. v. Sullivan (1964). The U.S. Supreme Court overruled a state court in Alabama that had found The New York Times guilty of libel for printing an advertisement that criticized Alabama officials for mistreating student civil rights activists. Even though some of what The Times printed was false, the court ruled in its favor, saying that libel of a public official requires proof of actual malice, which was defined as a \"knowing or reckless disregard for the truth\".", "The origins of U.S. defamation law pre-date the American Revolution; one famous 1734 case involving John Peter Zenger sowed the seed for the later establishment of truth as an absolute defense against libel charges. The outcome of the case is one of jury nullification, and not a case where the defense acquitted itself as a matter of law, as before the Zenger case defamation law had not provided the defense of truth."]}, {"page": "1735", "response": ["* August 14 – Freedom of the press: The New York Weekly Journal writer John Peter Zenger is acquitted of seditious libel against the royal governor of New York, on the basis that what he published was true."]}, {"page": "1746", "response": ["* July 28 – John Peter Zenger, American printer, whose court case advanced freedom of the press in the American colonies (b. 1697)"]}, {"page": "1697", "response": ["* October 26 – John Peter Zenger, German American newspaper printer (d. 1746)"]}, {"page": "Jury", "response": ["Today in the United States, juries are instructed by the judge to follow the judge's instructions concerning what is the law and to render a verdict solely on the evidence presented in court.  Important past exercises of nullification include cases involving slavery (see Fugitive Slave Act of 1850), freedom of the press (see John Peter Zenger), and freedom of religion (see William Penn)."]}, {"page": "Westchester County, New York", "response": ["* St. Paul's Church Was designated a National Historic Site in 1942. The original church, a wooden structure known as Church of Eastchester, was built in 1695. The present-day stone church was completed in 1764, and its name was changed to St. Paul's in 1795. The church property, which is operated by the National Park Service, includes a cemetery with burial stones dating to 1704 and the remnants of a village green that was the site of what came to be known as the \"Great Election\" of 1733. The publisher of the New York Journal, John Peter Zenger, wrote an account of the election and was arrested and tried for seditious libel. His acquittal established the legal precedent for freedom of the press, which was later incorporated as a basic freedom in the U.S. Bill of Rights."]}, {"page": "Freedom of the press", "response": ["In Britain's American colonies, the first editors discovered their readers enjoyed it when they criticized the local governor; the governors discovered they could shut down the newspapers. The most dramatic confrontation came in New York in 1734, where the governor brought John Peter Zenger to trial for criminal libel after the publication of satirical attacks. The defense lawyers argued that according to English common law, the truth was a valid defense against libel. The jury acquitted Zenger, who became the iconic American hero for freedom of the press. The result was an emerging tension between the media and the government. By the mid-1760s, there were 24 weekly newspapers in the 13 colonies, and the satirical attack on government became common features in American newspapers.Alison Olson, \"The Zenger Case Revisited: Satire, Sedition and Political Debate in Eighteenth Century America\", Early American Literature, vol.35 no.3 (2000), pp. 223–45."]}, {"page": "List of years in literature", "response": ["*1735 in literature –   At the end of the trial of John Peter Zenger for seditious libel in the New York Weekly Journal, he is found not guilty by the jury determining that truth was a defense against charges of libel. ; História trágico-marítima by Bernardo Gomes de Brito; Systema Naturae by Carl Linnaeus"]}, {"page": "John N. Heiskell", "response": ["In 1958, Heiskell received the Elijah Parish Lovejoy Award and the honorary degree of LL.D. degree from Colby College.  In addition, he received honorary degrees from Syracuse University, Columbia University, and the University of Missouri.  In addition, he received the John Peter Zenger Award and an honorary degree from the University of Arizona."]}, {"page": "William Bradford (printer, born 1663)", "response": ["Bradford published the first number of the New-York Gazette on October 16, 1725, the first newspaper printed in the province of New York. Bradford remained as publisher of the New-York Gazette, printing it until he retired. In 1727, he took James Parker as an apprentice for an eight-year term.  In 1731, Bradford's first wife died and afterwards he married a widow named Smith. In 1734, his former apprentice, John Peter Zenger, was brought to court for libel, but Bradford remained out of the case. ", "Bradford's wife Elizabeth gave birth to their first child, Andrew in 1686, who, along with his wife Cornelia Smith Bradford, were early American printers. Andrew published the first newspaper in colonial Philadelphia. William Jr, the brother of Andrew, was a printer and seaman. Bradford's grandson, William Bradford became a well-known printer during the American Revolution for the Continental Congress. The Bradford Family Papers (1620–1906) are deposited at the Historical Society of Pennsylvania. Bradford established printing and publishing businesses that operated for 140 years from 1685 until 1825. He trained several apprentices that including John Peter Zenger, James Parker, Henry DeForest, and his son Andrew Bradford. Andrew's family continued working in the printing and publishing industry for four generations."]}, {"page": "Timeline of pre–United States history", "response": ["*1735 – John Peter Zenger is found innocent of libel by the New York City trial on August 4."]}, {"page": "1735 in literature", "response": ["*August 4 – A jury finds John Peter Zenger not guilty of seditious libel in The New York Weekly Journal."]}, {"page": "Areopagitica", "response": ["*John Peter Zenger"]}, {"page": "Eastchester (town), New York", "response": ["* John Peter Zenger, defendant in a landmark legal case that laid the foundation for press freedom"]}, {"page": "German Americans", "response": ["The most famous of the early German Palatine immigrants was editor John Peter Zenger, who led the fight in colonial New York City for freedom of the press in America. A later immigrant, John Jacob Astor, who came from Baden after the Revolutionary War, became the richest man in America from his fur trading empire and real estate investments in New York.Axel Madsen, John Jacob Astor: America's First Multimillionaire (2001) excerpt", "Others, including Albert Einstein, J. Robert Oppenheimer, Wernher von Braun, Linus Pauling, John Peter Zenger, John Steinbeck, Kurt Vonnegut, Joseph Weizenbaum set intellectual landmarks while Neil Armstrong was the first human to land on the moon."]}, {"page": "News media", "response": ["In 1729, Benjamin Franklin began writing a new form of newspaper that was more satirical and more involved in civic affairs than previously seen. In 1735, John Peter Zenger was accused of seditious libel by the governor of New York, William Cosby. Zenger was found not guilty, largely in part to his attorney Andrew Hamilton, who later wrote a paper in which he argued that newspapers should be free to criticize the government as long as it was true. Later, with the ratification of the Bill of Rights in 1791, freedom of the press would be guaranteed by the First Amendment."]}, {"page": "Lower Manhattan", "response": ["The 1735 libel trial of John Peter Zenger in the city was a seminal influence on freedom of the press in North America. It would be a standard for the basic articles of freedom in the United States Declaration of Independence."]}, {"page": "Federal Hall", "response": ["The original structure on the site was built as New York's second City Hall from 1699 to 1703, on Wall Street, in what is today the Financial District of Lower Manhattan. The stones from Wall Street's old fortifications were used for City Hall. In 1735, John Peter Zenger, an American newspaper publisher, was arrested for committing libel against the British royal governor and was imprisoned and tried there. His acquittal on the grounds that the material he had printed was true established freedom of the press as it was later defined in the Bill of Rights.", "The National Park Service operates Federal Hall as a national memorial. As a national memorial, the site is open free to the public from 9 a.m. to 5 p.m. on weekdays. It has tourist information about the New York Harbor area's federal monuments and parks, and a New York City tourism information center. The gift shop has colonial and early American items for sale. Normally its exhibit galleries are open free to the public daily, except national holidays, and guided tours of the site are offered throughout the day. Exhibits include George Washington’s Inauguration Gallery, including the Bible used to swear his oath of office; Freedom of the Press, the imprisonment and trial of John Peter Zenger; and New York: An American Capital, preview exhibit created by the National Archives and Records Administration."]}, {"page": "Tim Russert", "response": ["*John Peter Zenger Freedom of the Press Award"]}, {"page": "Province of New York", "response": ["The election for an open seat in the New York assembly, held on the Village Green in Eastchester, Westchester County on October 29, 1733, is one of the better known political events in colonial America. Two hundred and seventy-five years after the contest, historians continue to cite the election to advance various arguments about colonial life. One recent student used the election to argue for the persistent importance of monarchy in the outlook of colonists, while another scholar treated the voting as an important point in the development of political awareness among New York artisans. Many writers address the election, held at what is today St. Paul's Church National Historic Site, in Mt. Vernon, as part of the story of the printer John Peter Zenger, whose acquittal in a seditious libel case in 1735 is seen as a foundation of the free press in America. The first issue of Zenger's New York Weekly Journal carried a lengthy report on the famous election, producing one of the few complete accounts of a colonial election available to historians.\"https://www.nps.gov/sapa/learn/historyculture/upload/ElectionOf1733.pdf "]}, {"page": "Trinity Church Cemetery", "response": ["* John Peter Zenger (1697–1746), newspaper publisher whose libel trial helped establish the right to a free press"]}, {"page": "Freedom of speech in the United States", "response": ["The trial of John Peter Zenger in 1735 was a seditious libel prosecution for Zenger's publication of criticisms of the Governor of New York, William Cosby. Andrew Hamilton represented Zenger and argued that truth should be a defense to the crime of seditious libel, but the court rejected this argument. Hamilton persuaded the jury, however, to disregard the law and to acquit Zenger. The case is considered a victory for freedom of speech as well as a prime example of jury nullification. The case marked the beginning of a trend of greater acceptance and tolerance of free speech."]}, {"page": "James Alexander (lawyer)", "response": ["In 1721, Alexander was appointed to the Governor's Council in New York.  In 1723, he was added to the Council in New Jersey and that same year made Attorney General of New Jersey.  He frequently opposed the policies of New York Governor William Cosby and in 1732, Cosby succeeded in having Alexander removed from the council.  In 1733, Alexander started an anti-Cosby newspaper, the New York Weekly Journal, with Peter Zenger as publisher.  Alexander was the principal author of pieces critical of Governor Cosby. The following year, Zenger was arrested on sedition charges, but eventually a jury acquitted Zenger of libel in one of the first instances of jury nullification.  Alexander and William Smith served as Zenger's attorneys until both were disbarred after they challenged the commissions of the judges hearing the case.Linder, Douglas O., \"Key Figures in the Trial of John Peter Zenger\", Famous Trials, University of Missouri-Kansas City School of Law", "* John Peter Zenger", "* The Trial of John Peter Zenger"]}, {"page": "New York City", "response": ["The 1735 trial and acquittal in Manhattan of John Peter Zenger, who had been accused of seditious libel after criticizing colonial governor William Cosby, helped to establish the freedom of the press in North America. In 1754, Columbia University was founded under charter by King George II as King's College in Lower Manhattan."]}, {"page": "Not proven", "response": ["The reintroduction of the \"not guilty\" verdict was part of a wider movement during the 17th and 18th century which saw a gradual increase in the power of juries, such as the trial of William Penn in 1670, in which an English jury first gained the right to pass a verdict contrary to the law (known as jury nullification), and the trial of John Peter Zenger in New York in 1735 in which jury nullification is credited with establishing freedom of the press as a firm right in what became the United States. Legal academic Ian Willock argues that the 1728 case was \"of great significance in calling a halt to a process of attrition which might have led to the total extinction of the criminal jury\"."]}, {"page": "Andrew Hamilton (lawyer)", "response": ["Andrew Hamilton (1676 – August 4, 1741) was a Scottish lawyer in the Thirteen Colonies, where he finally settled in Philadelphia.  He was best known for his legal victory on behalf of the printer and newspaper publisher John Peter Zenger. His involvement with the 1735 decision in New York helped to establish that truth is a defense to an accusation of libel.  His eloquent defense concluded with saying that the press has \"a liberty both of exposing and opposing tyrannical power by speaking and writing truth.\"", "The crowning glory of Hamilton's career was his defense of John Peter Zenger in 1735, which he undertook pro bono. Zenger was a printer in New York City. In his newspaper, Zenger had asserted that judges were arbitrarily displaced, and new courts were erected, without the consent of the legislature, by which trials by jury were taken away when a governor was so disposed. The attorney-general charged him with the crime of seditious libel, and Zenger's lawyers James Alexander and William Smith, objecting to the legality of the judge's commissions, were stricken from the list of attorneys. At this point, no New York attorneys could take the case. The merchant Mary Spratt Alexander suggested to her husband James Alexander that he ask his colleague Andrew Hamilton whom he was in regular correspondence with - and who was outside of the reach of influence by the judge - to come to New York to defend Zenger. Mary Alexander then traveled to Philadelphia to interview Hamilton and provide him with the facts of the case. It is thought that she and her husband were early investors of the New York Weekly Gazette.The Goede Vrouw of Manahata at Home and in Society, 1609-1760, by Mrs. John King Van Rensselaer pub. 1898, page 303"]}, {"page": "United States tort law", "response": ["*John Peter Zenger"]}, {"page": "Electoral-vote.com", "response": ["In 2015 Tanenbaum was joined by Christopher Bates, who contributes to the site under the name Zenger, chosen in honor of John Peter Zenger. Their respective contributions are differentiated by (V) and (Z)."]}, {"page": "John Zenger", "response": ["#redirect John Peter Zenger"]}, {"page": "Peter Zenger", "response": ["#REDIRECT John Peter Zenger"]}, {"page": "Letter to the editor", "response": ["The latter criterion is a fairly recent development in LTE management. Prior to the Cold War paranoia of the mid-20th century, anonymous LTEs were common; in fact, the right to write anonymously was central to the free-press/free-speech movement (as in the 1735 trial against John Peter Zenger, which started with an anonymous essay).  By the 1970s, editors had developed strong negative attitudes toward anonymous letters, and by the end of the 20th century, about 94 percent of newspapers automatically rejected anonymous LTEs. Some newspapers in the 1980s and 1990s created special anonymous opinion forums that allowed people to either record short verbal opinions via telephone (which were then transcribed and published) or send letters that were either unsigned or where the author used a pseudonym. Although many journalists derided the anonymous call-in forums as unethical (for instance, someone could make an unfounded opinion without worry of the consequences or having to back the comment up with hard facts), defenders argued that such forums upheld the free-press tradition of vigorous, uninhibited debate similar to that found in earlier newspapers."]}, {"page": "History of New York City (1665–1783)", "response": ["New York was cosmopolitan from the beginning, established and governed largely as a strategic trading post. One visitor during the early revolutionary period wrote that \"the inhabitants are in general brisk and lively,\" the women were \"handsome,\" he recorded—as did others new to the city—though, he added, \"it rather hurts a European eye to see so many Negro slaves upon the streets.\" There were numerous marriages of people from different ethnic groups. \"Joyce Goodfriend's study of colonial New York City, for instance, suggests that many interracial marriages occurred more because of a lack of opportunity to marry within their own group than a desire to marry outside it. ...over 60% of Englishmen in the New York capital in the late 17th century married women of non-English origins.\" However, by the 1730s over three fourths of the Dutch men and women still married within their own groups, though by this point there was a generation of children of mixed European ancestry.Daily Life in the Colonial City - Krawczynaski Freedom of worship was part of the city's foundation, and the trial for libel in 1735 of John Peter Zenger, editor of the New-York Weekly Journal established the principle of freedom of the press in the British colonies. Sephardic Jews expelled from Dutch Brazil after Portuguese recapture, were welcome in New York when the governor realized their value and gave them exemptions from restrictions on Jews."]}, {"page": "Media in New York City", "response": ["Ethnic variation is not the only measure of the diversity of New York City's newspapers, with editorial opinions running from left-leaning at alternative papers like the Village Voice (before its closure in 2018), to conservative at the New York Post. New York Observer covers politics and the city's rich and powerful with unusual depth. The tradition of a free press owes much to John Peter Zenger, a New York publisher who was acquitted in his 1735 landmark court case, setting the precedent that truth was a legitimate defense against accusations of libel."]}, {"page": "Pro hac vice", "response": ["The origins of the doctrine of admission pro hac vice have been traced as far back as 1629 in the English Court of Common Pleas.Scott J. Goldstein, Constitutional Law: Attorney Not Entitled to Hearing upon Denial of Admission Pro Hac Vice, 44  772, 773 (1979); see also Cooper v. Hutchinson, 184 F.2d 119, 124 (3d Cir. 1950) (citing Thursby v. Warren, 4 Car. 1 79 Eng.Rep. 738 (C.P. 1629)) The doctrine appeared in America as early as 1735 in the New York trial of John Peter Zenger for libel, when the Philadelphia attorney Andrew Hamilton was permitted to appear on Zenger's behalf. By 1876, the custom had become \"general and uniform\" in the United States.Cooper v. Hutchinson, 184 F.2d 119, 122 (3d Cir. 1950) (internal citations omitted)"]}, {"page": "Seditious libel", "response": ["John Peter Zenger was arrested and imprisoned for seditious libel in 1734 after his newspaper criticized the colonial governor of New York. Zenger spent nearly 10 months in jail before being acquitted by a jury in August 1735.Levy, pp. 38–45. One hundred years later, Nova Scotia's Joseph Howe also won a jury acquittal on a charge of seditious libel after his newspaper printed allegations that local politicians and police were stealing from the people.Kesterton, W.H. (1967) A History of Journalism in Canada. Toronto: McClelland and Stewart Limited, pp. 21–23."]}, {"page": "Ray Collins (actor)", "response": ["| Episode dramatizing John Peter Zenger's fight for freedom of the press\""]}, {"page": "Eugene C. Pulliam", "response": ["* Received the John Peter Zenger Award for Press Freedom from the University of Arizona in 1965. See also:"]}, {"page": "Zenger (surname)", "response": ["* John Peter Zenger (1697–1746), a German-American printer, publisher, editor, and journalist", "** SS Peter Zenger, Liberty ship built in the United States during World War II, named after John Peter Zenger"]}, {"page": "Struck jury", "response": ["In 1735, John Peter Zenger, a newspaper publisher, was arrested and tried for libel against the governor of New York, which was then a colony of England.  His first two lawyers were disbarred for attempting to turn the trial into an indictment of the governor.  The judge appointed as lawyer John Chambers, who was a placeman of the governor.  He then moved for a struck jury.  The first panel created was not properly prepared by the clerk out of the book of potential jurors, and was overturned by the judges before use.  The second was properly prepared, but the clerk or sheriff subsequently reordered the names to put a partisan of the governor as the foreman, which was also overturned.  After the local attorney completed the process of getting an unbiased jury, Andrew Hamilton took over the defense, and won an acquittal on the grounds that the printed statements were true. Based on the law at the time, this was also an example of jury nullification."]}, {"page": "Trial of John Peter Zenger", "response": ["#REDIRECTJohn Peter Zenger"]}, {"page": "Zenger, Trial of John Peter", "response": ["#REDIRECTJohn Peter Zenger"]}]}}