{"wiki_id": "http://www.wikidata.org/entity/Q21574198", "itemLabel": "Steven Cree", "itemDescription": "Scottish actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Steven_Cree", "wikipedia_page": {"main": "Steven Cree (born February 29, 1980) is a Scottish film, television, and theatre actor. He is best known for his role as Ian Murray in the Starz television series Outlander. His other work includes the films Brave (2012), 300: Rise of an Empire (2014), Maleficent (2014), 51 Degrees North (2014), Churchill (2017), and the TV series Lip Service.", "link_mentions": [{"page": "Kilmarnock", "response": ["*Steven Cree, actor, best known for his role in Outlander and Outlaw King. "]}, {"page": "The Brightonomicon", "response": ["| Doctor Proctor & Scottish Groundsman ||Steven Cree"]}, {"page": "James Stagg", "response": ["Stagg was portrayed by Patrick Barr in the 1962 film The Longest Day, Christopher James Baker in the 2004 TV movie Ike: Countdown to D-Day, David Haig in his own 2014 play Pressure, and Steven Cree in 2017's Churchill."]}, {"page": "Satellite Award for Best Cast – Television Series", "response": ["| style=\"text-align:center;\"| 2016 || Outlander || Caitriona Balfe • Simon Callow • Steven Cree • Rosie Day • Frances de la Tour • Laura Donnelly • Andrew Gower • Sam Heughan • Nell Hudson • Gary Lewis • Graham McTavish • Tobias Menzies • Grant O'Rourke • Dominique Pinon • Richard Rankin • Clive Russell • Sophie Skelton • Lotte Verbeek • Stephen Walters • Stanley Weber||"]}, {"page": "Brave (2012 film)", "response": ["* Steven Cree as Young Macintosh."]}, {"page": "Gaynor Macfarlane", "response": ["| Claire Rushbrook, Steven Cree, Pippa Bennett-Warner, Ian Conningham and Sam Dale"]}, {"page": "List of composers depicted on film", "response": ["| Steven Cree"]}, {"page": "List of adventure films of the 2010s", "response": ["|2036 Origin Unknown||Hasraf Dulull||Katee Sackhoff, Julie Cox, Steven Cree||||||"]}, {"page": "51 Degrees North", "response": ["51 Degrees North (sometimes stylized as 51° North) is a 2014 science fiction film written and directed by Grigorij Richters and starring Moritz von Zeddelmann, Steve Nallon, Jamie Doyle, Dolly-Ann Osterloh and Steven Cree. The film is visually presented as found footage shot from the perspective of various video recording devices, primarily from a hand-held camcorder operated by the main characters and from CCTV cameras and Social Media. The original soundtrack was composed by Queen and Brian May.", "* Steven Cree as Michael Burlington"]}, {"page": "Shetland (TV series)", "response": ["*Steven Cree as John Henderson"]}, {"page": "Tower Block (film)", "response": ["One night in London, the 15-year-old Jimmy (Ralph Laurila) runs through a housing estate begging passersby for help. Everyone ignores him. He enters the condemned Tower Block 31 and finds his way to the top floor, which is the only floor that is still inhabited as the tenants wait to be rehoused. He bangs on doors as the two masked men who have been chasing him appear. The only person who helps him is office worker Becky (Sheridan Smith), but she is beaten to the ground and he is dragged away. The next morning Detective Constable Devlin (Steven Cree) conducts door-to-door enquiries about the previous night's murder, as the boy's body has been found. Nobody will speak to him; not even Becky, who claims her injuries are the result of a mugging.", "*Steven Cree as DC Devlin"]}, {"page": "Outlander (TV series)", "response": ["* Steven Cree as Ian Murray (seasons 1–4)", "In December 2013, Simon Callow was cast in the supporting role of Duke of Sandringham, and Entertainment Weekly reported in April 2014 that Steven Cree would portray Ian Murray. Bill Paterson was cast as lawyer Ned Gowan in June 2014. Author Gabaldon has a cameo as Iona MacTavish in the August 2014 episode \"The Gathering\". In August 2014 it was announced that Frazer Hines had been cast in the role of a prison warden in an episode to air in 2015. From 1966 to 1969, Hines had portrayed the Doctor Who character Jamie McCrimmon, who Gabaldon said had inspired the setting of the Outlander series and the character of Jamie Fraser. Hines plays Sir Fletcher Gordon, an English prison warden, in the May 2015 episode \"Wentworth Prison\"."]}, {"page": "List of Outlander characters", "response": ["|Steven Cree", "| Steven Cree "]}, {"page": "Bad Girls (series 5)", "response": ["* Steven Cree as Waiter"]}, {"page": "21st Satellite Awards", "response": ["* Steven Cree"]}, {"page": "Churchill (film)", "response": ["* Steven Cree as Group Captain James Stagg"]}, {"page": "Outlaw King", "response": ["* Steven Cree as Christopher Seton"]}, {"page": "Terminator: Dark Fate", "response": ["* Steven Cree as Rigby, a United States Border Patrol agent "]}, {"page": "A Discovery of Witches (TV series)", "response": ["* Steven Cree as Gallowglass (seasons 2–3), son of the late Hugh de Clermont and nephew of Matthew"]}, {"page": "MotherFatherSon", "response": ["* Steven Cree as Andrew Bentham"]}, {"page": "2036 Origin Unknown", "response": ["2036 Origin Unknown is a  2018 British science fiction adventure film directed by Hasraf Dulull, written by Dulull and Gary Hall, and starring Katee Sackhoff and Steven Cree. The film follows mission controller Mackenzie “Mack” Wilson (Sackhoff) and ARTI, an artificial intelligence system (voiced by Cree), as they discover a mysterious object on Mars and witness it transporting to Earth by faster-than-light travel.", "* Steven Cree as ARTI (voice), an artificial intelligence system"]}, {"page": "COBRA (British TV series)", "response": ["*Steven Cree as Stuart Collier, the Chief Constable of Tyneside Police"]}, {"page": "Vivaldi, the Red Priest", "response": ["* Steven Cree as Antonio Vivaldi."]}, {"page": "The Gardener of God", "response": ["* Steven Cree as The Rabbi"]}, {"page": "Beatrice Colin", "response": ["| Claire Rushbrook, Steven Cree, Pippa Bennett-Warner, Ian Conningham and Sam Dale"]}, {"page": "Martyrs Lane", "response": ["Martyrs Lane is a 2021 British horror film written and directed by Ruth Platt, produced by Christine Alderson and Katie Hodgkin and starring Denise Gough, Steven Cree, Anastasia Hille, Hannah Rae and Kiera Thompson.", "* Steven Cree as Thomas"]}]}}