{"wiki_id": "http://www.wikidata.org/entity/Q21560294", "itemLabel": "Sir Thomas Mostyn, 6th Baronet", "itemDescription": "British MP (1776-1831)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_Thomas_Mostyn,_6th_Baronet", "wikipedia_page": {"main": "Sir Thomas Mostyn, 6th Baronet (20 October 1776 – 17 April 1831) of Mostyn Hall, Flintshire and Gloddaeth Hall, Caernarvonshire was a Welsh Member of Parliament.He was born the only son of Sir Roger Mostyn, 5th Baronet and educated at Westminster School and Christ Church, Oxford. He succeeded his father in 1796.\nHe was MP for Flintshire from 1796 to 1797 and again from 1799 to 1831. He was appointed High Sheriff of Caernarvonshire for 1798-99 and High Sheriff of Merionethshire for 1799–1800.\nHe died unmarried in 1831 and the baronetcy became extinct. His main estates passed to his sister Elizabeth and her husband, Sir Edward Pryce Lloyd, who was created Baron Mostyn later that year. The Baron's son adopted the additional name of Mostyn.", "link_mentions": [{"page": "Sheriff of Caernarvonshire", "response": ["*1798: Sir Thomas Mostyn, 6th Baronet of Gloddaeth Hall"]}, {"page": "Edward Lloyd, 1st Baron Mostyn", "response": ["He was High Sheriff of Flintshire for 1796, High Sheriff of Caernarvonshire for 1797 and High Sheriff of Merionethshire for 1804.Complete Baronetage In 1806 he was elected to the House of Commons for Flint Burghs, a seat he held until 1807 and again from 1812 to 1831 and also represented Beaumaris between 1807 and 1812. In 1831, after his wife had inherited the main estates of the unmarried Sir Thomas Mostyn, 6th Baronet, he was raised to the peerage as Baron Mostyn, of Mostyn in County Flint.   "]}, {"page": "1831 in Wales", "response": ["*17 April – Sir Thomas Mostyn, 6th Baronet, politician, 54"]}, {"page": "1776 in Wales", "response": ["*20 October – Sir Thomas Mostyn, 6th Baronet, politician (d. 1831) "]}, {"page": "Mostyn baronets", "response": ["*Sir Thomas Mostyn, 6th Baronet (1776–1831)"]}, {"page": "Thomas Mostyn", "response": ["*Sir Thomas Mostyn, 6th Baronet (1776–1831), Welsh politician"]}]}}