{"wiki_id": "http://www.wikidata.org/entity/Q215999", "itemLabel": "Rudolf Wittkower", "itemDescription": "German-American art historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Rudolf_Wittkower", "wikipedia_page": {"main": "Rudolf Wittkower (22 June 1901 – 11 October 1971) was a British art historian specializing in Italian Renaissance and Baroque art and architecture, who spent much of his career in London, but was educated in Germany, and later moved to the United States. Despite having a British father who stayed in Germany after his studies, he was born and raised in Berlin.", "link_mentions": [{"page": "Caravaggio", "response": ["* Rudolf Wittkower, Art and Architecture in Italy, 1600–1750, Penguin/Yale History of Art, 3rd edition, 1973, "]}, {"page": "Gian Lorenzo Bernini", "response": ["Once he was brought to Rome, he rarely left its walls, except (much against his will) for a five-month stay in Paris in the service of King Louis XIV and brief trips to nearby towns (including Civitavecchia, Tivoli and Castelgandolfo), mostly for work-related reasons. Rome was Bernini's city: “'You are made for Rome,’ said Pope Urban VIII to him, 'and Rome for you'”. It was in this world of 17th-century Rome and the international religious-political power which resided there that Bernini created his greatest works. Bernini's works are therefore often characterized as perfect expressions of the spirit of the assertive, triumphal but self-defensive Counter Reformation Roman Catholic Church. Certainly Bernini was a man of his times and deeply religious (at least later in life),For a more nuanced, cautious discussion of the traditional hagiographic view of Bernini as \"fervent Catholic\" and of his art as simply a direct manifestation of his personal faith, see Mormando, \"Bernini's Religion: Myth and Reality,\" pp. 60–66 of the Introduction to his critical, annotated edition, Domenico Bernini, The Life of Gian Lorenzo Bernini, University Park, Penn State U Press, 2011.See also the same author's article, 'Breaking Through the Bernini Myth' in the online journal, Berfrois, 11 October 2012:  but he and his artistic production should not be reduced simply to instruments of the papacy and its political-doctrinal programs, an impression that is at times communicated by the works of the three most eminent Bernini scholars of the previous generation, Rudolf Wittkower, Howard Hibbard, and Irving Lavin. As Tomaso Montanari's recent revisionist monograph, La libertà di Bernini (Turin: Einaudi, 2016) argues and Franco Mormando's anti-hagiographic biography, Bernini: His Life and His Rome (Chicago: University of Chicago Press, 2011), illustrates, Bernini and his artistic vision maintained a certain degree of freedom from the mindset and mores of Counter-Reformation Roman Catholicism.Regarding Hibbard's classic book on Bernini (Bernini [New York: Penguin, 1965]), often cited as a leading authority, though still a valuable resource, it has never been updated since its original publication and the author's premature death; a vast amount of new information about Bernini has surfaced since then. It also accepts too readily the whitewashed, hagiographic depictions of Bernini, his patrons, and of Baroque Rome as supplied by the first, official biographies by Baldinucci and Domenico Bernini. Similar criticism regarding an insufficiently critical reading of contemporary sources (especially ecclesiastical ones) and a simplistic reductionism in the description of Bernini's true mindset and artistic vision could also be made of the scholarship of Wittkower and Lavin.", "Bernini's reputation, however, was definitively established by four masterpieces, executed between 1619 and 1625, all now displayed in the Galleria Borghese in Rome. To the art historian Rudolf Wittkower these four works—Aeneas, Anchises, and Ascanius (1619), The Rape of Proserpina (1621–22), Apollo and Daphne (1622–1625), and David (1623–24)—\"inaugurated a new era in the history of European sculpture\". It is a view repeated by other scholars, such as Howard Hibbard who proclaimed that, in all of the seventeenth century, \"there were no sculptors or architects comparable to Bernini\". Adapting the classical grandeur of Renaissance sculpture and the dynamic energy of the Mannerist period, Bernini forged a new, distinctly Baroque conception for religious and historical sculpture, powerfully imbued with dramatic realism, stirring emotion and dynamic, theatrical compositions. Bernini's early sculpture groups and portraits manifest \"a command of the human form in motion and a technical sophistication rivaled only by the greatest sculptors of classical antiquity.\"Timothy Clifford and Michael Clarke, Foreword, Effigies and Ecstasies: Roman Baroque Sculpture and Design in the Age of Bernini, Edinburgh: National Gallery of Scotland, 1998, p.7 Moreover, Bernini possessed the ability to depict highly dramatic narratives with characters showing intense psychological states, but also to organize large-scale sculptural works that convey a magnificent grandeur.", "Despite this busy engagement with large works of public architecture, Bernini was still able to devote himself to his sculpture, especially portraits in marble, but also large statues such as the life-size Saint Bibiana (1624, Church of Santa Bibiana, Rome). Bernini's portraits show his ever increasing ability to capture the utterly distinctive personal characteristics of his sitters, as well as his ability to achieve in cold white marble almost painterly-like effects that render with convincing realism the various surfaces involved: human flesh, hair, fabric of varying type, metal, etc. These portraits included a number of busts of Urban VIII himself, the family bust of Francesco Barberini and most notably, the Two Busts of Scipione Borghese—the second of which had been rapidly created by Bernini once a flaw had been found in the marble of the first. The transitory nature of the expression on Scipione's face is often noted by art historians, iconic of the Baroque concern for representing fleeting movement in static artworks. To Rudolf Wittkower the \"beholder feels that in the twinkle of an eye not only might the expression and attitude change but also the folds of the casually arranged mantle\".", "Other projects in Paris suffered a similar fate.Fagiolo, M., 2008. Bernini a Parigi: le Colonne d'Ercole, l'Anfiteatro per il Louvre e i progetti per la Cappella Bourbon. With the exception of Chantelou, Bernini failed to forge significant friendships at the French court. His frequent negative comments on various aspects of French culture, especially its art and architecture, did not go down well, particularly in juxtaposition to his praise for the art and architecture of Italy (especially Rome); he said that a painting by Guido Reni was worth more than all of Paris. The sole work remaining from his time in Paris is the Bust of Louis XIV although he also contributed a great deal to the execution of the Christ Child Playing with a Nail marble relief (now in the Louvre) by his son Paolo as a gift to the Queen of France. Back in Rome, Bernini created a monumental equestrian statue of Louis XIV; when it finally reached Paris (in 1685, five years after the artist's death), the French king found it extremely repugnant and wanted it destroyed; it was instead re-carved into a representation of the ancient Roman hero Marcus Curtius.The most thorough study of Bernini's King Louis XIV Equestrian statue, including its ultimate fate in France, remains Rudolf Wittkower, 'The Vicissitudes of a Dynastic Monument: Bernini's Equestrian Statue of Louis XIV.' In De artibus Opuscula XL: Essays in Honors of Erwin Panofsky, ed. Millard Meiss (New York: New York University Press, 1961), pp. 497–531. For much additional, new data about the work that has surfaced since Wittkower's 1961 work, see the many notes pertinent to the statue in Franco Mormando, Domenico Bernini's Life of Gian Lorenzo Bernini (University Park, PA: Penn State University Press, 2011), pp. 396–402.", "As for Bernini's drawings, about 350 still exist; but this represents a minuscule percentage of the drawings he would have created in his lifetime; these include rapid sketches relating to major sculptural or architectural commissions, presentation drawings given as gifts to his patrons and aristocratic friends, and exquisite, fully finished portraits, such as those of Agostino Mascardi (Ecole des Beaux-Arts, Paris) and Scipione Borghese and Sisinio Poli (both in New York's Morgan Library).Unfortunately there is currently no complete catalogue raisonné of all of the known Bernini drawings. The most thorough edition of his drawings still remains Heinrich Brauer and Rudolf Wittkower, Die Ziechnungen des Gianlorenzo Bernini, Berlin: Verlag Heinrich Keller, 1931, reprinted New York: Collectors Edition, 1970. Also very useful is Ann Sutherland Harris, Selected Drawings of Gian Lorenzo Bernini, New York: Dover, 1977; see also her article, 'Three Proposals for Gian Lorenzo Bernini' in Master Drawings, vol. 41, no.2 (Summer 2003), pp. 119–127. More recent is the catalog of the exhibition of Bernini drawings in Leipzig's Museum der bildenden Kunste (which boasts one of the largest collection of Bernini drawings in the world): Hans-Werner Schmidt et al., Bernini: Erfinder des barocken Rom, Bielefeld: Kerber Art, 2014. For the drawings by Bernini and his workshop in the Vatican collection, see the comprehensive, detailed, illustrated catalog: Manuela Gobbi, and Barbara Jatta, eds., I disegni di Bernini e della sua scuola nella Biblioteca Apostolica Vaticana. Drawings by Bernini and His School at the Vatican Apostolic Library. Vatican City: Biblioteca Apostolica Vaticana, 2015."]}, {"page": "Maximilian I, Holy Roman Emperor", "response": ["Maximilian had an interest in archaeology, \"creative and participatory rather than objective and distancing\" (and sometimes destructive), according to Christopher S.Wood. His chief advisor on archaeological matters was Konrad Peutinger, who was also the founder of classical Germanic and Roman studies. Peutinger commenced an ambitious project, the Vitae Imperatorum Augustorum, a series of biographies of emperors from Augustus to Maximilian (each biography would also include epigraphic and numismatic evidences), but only the early sections were completed. The search for medals ultimately led to a broad craze in Germany for medals as an alternative for portraiture. At the suggestion of the emperor, the scholar published his collection of Roman inscriptions. Maximilian did not distinguish between the secular and the sacred, the Middle Ages and antiquity, and considered equal in archaeological value the various searches and excavations of the Holy Tunic (rediscovered in Trier in 1513 after Maximilian demanded to see it, and then exhibited, reportedly attracting 100,000 pilgrims), Roman and German reliefs and inscriptions, etc. and the most famous quest of all, the search for the remains of hero Siegfried. Maximilian's private collection activities were carried out by his secretary, the humanist Johann Fuchsmagen, on his behalf. Sometimes, the emperor came in contact with antiquities during his campaigns – for example, an old German inscription found in Kufstein in 1504, that he immediately sent to Peutinger. Around 1512–1514, Pirckheimer translated and presented Maximilian with Horapollo's Hieroglyphica. The hieroglyphics would be incorporated by Dürer into the Triumphal Arch, which Rudolf Wittkower considers \"the greatest hieroglyphic monument\"."]}, {"page": "Triton (mythology)", "response": ["Gianlorenzo Bernini sculpted the \"Neptune and Triton\" fountain (1622–23) now in the Victoria and Albert Museum and the  Triton Fountain (1642–43) in Bernini Square, Rome., n84 There is differing opinion on what earlier works he may have drawn from near-contemporary works or examples from antiquity. He may have been influenced by Battista di Domenico Lorenzi's Alpheus and Arethusa (1568–70) or his Triton blowing the conch (late 1570s),, p. 390 and n24; p. 405, n 82. or Stoldo Lorenzi's Neptune fountain. But Rudolf Wittkower has cautioned against exaggerating the influences of Florentine fountains. It has been pointed out that Bernini had access to the Papal collection of genuine Greco-Roman sculptures, and worked with restoring ancient fragments, although it is unclear if any Triton was among these. It is within the realm of possibilities that Bernini might have used as his model the ancient Altar of Domitius Ahenobarbus, which does include Triton in its composition. The Triton of this altar, the Stoldo Lorenzi Triton and the Bernini Triton are all double-tailed, like a pair of human legs."]}, {"page": "Corinthian order", "response": ["During the first flush of the Italian Renaissance, the Florentine architectural theorist Francesco di Giorgio expressed the human analogies that writers who followed Vitruvius often associated with the human form, in squared drawings he made of the Corinthian capital overlaid with human heads, to show the proportions common to both.Francesco di Giorgio's sheet with the drawings, from the Turin codex Saluzziano of his Trattati di architettura ingegneria e arte militare, c. 1480–1500, is illustrated by Rudolf Wittkower, Architectural Principles in the Age of Humanism (1962) 1965, pl. ic"]}, {"page": "Roc (mythology)", "response": ["According to art historian Rudolf Wittkower, the idea of the roc had its origins in the story of the fight between the Indian solar bird GarudaWittkower noted the identification of the roc and Garuda made in Kalipadra Mitra, \"The bird and serpent myth\", The Quarterly Journal of the Mythic Society (Bangalore) 16 1925–26:189. and the chthonic serpent Nāga. The mytheme of Garuda carrying off an elephant that was battling a crocodile appears in two Sanskrit epics, the Mahabharata (I.1353) and the Ramayana (III.39).", "In The Arabian Nights the roc appears on a tropical island during Sinbad's second voyage. Because of Polo's account, others identified the island as Madagascar, which became the location for stories about other giant birds. Doubtless, it was Polo's description that inspired Antonio Pigafetta, one of Ferdinand Magellan's companions, who wrote or had ghost-written an embroidered account of the circumglobal voyage: in Pigafetta's accountOr the Italian version in Ramusio's Delle navigationi et viaggi, mentioned in Rudolf Wittkower, \"'Roc': An Eastern Prodigy in a Dutch Engraving\" Journal of the Warburg Institute 1.3 (January 1938:255–257) p 255 the home grounds of the roc were the seas of China. Such descriptions captured the imaginations of later illustrators, such as Stradanus  1590An engraving after Stradanus is reproduced in Wittkower 1938:fig 33c. or Theodor de Bry in 1594 who showed an elephant being carried off in the roc's talons,De Bry's engraving is reproduced in Attenborough (1961: 35) or showed the roc destroying entire ships in revenge for destruction of its giant egg, as recounted in the fifth voyage of Sinbad the Sailor. Ulisse Aldrovandi's Ornithologia (1599) included a woodcut of a roc with a somewhat pig-like elephant in its talons,Illustrated in Wittkower 1938:33, fig. b. but in the rational world of the 17th century, the roc was regarded more critically."]}, {"page": "Pilaster", "response": ["In discussing Leon Battista Alberti's use of pilasters, which Alberti reintroduced into wall-architecture, Rudolf Wittkower wrote: \"The pilaster is the logical transformation of the column for the decoration of a wall. It may be defined as a flattened column which has lost its three-dimensional and tactile value.\""]}, {"page": "Anton Raphael Mengs", "response": ["His closeness to Johann Joachim Winckelmann has enhanced his historical importance. Mengs came to share Winckelmann's enthusiasm for classical antiquity, and worked to establish the dominance of Neoclassical painting over the then popular Rococo style. At the same time, however, the influence of the Roman Baroque remained strong in his work, particularly in his religious paintings. He would have fancied himself the first neoclassicist, while in fact he may be the last flicker of Baroque art. Rudolf Wittkower wrote: \"In the last analysis, he is as much an end as a beginning\".Wittkower, p 469 Goethe regretted that \"so much learning should have been allied to a total want of initiative and poverty of invention, and embodied with a strained and artificial mannerism.\"Johann Wolfgang von Goethe, Winckelmann und sein Jahrhundert"]}, {"page": "Vincenzo Scamozzi", "response": ["His major book came out one year before his death and was too late to influence his own success. Scamozzi's practice is sometimes spoken of as being a source of the neo-Palladian architecture as it was introduced by Inigo Jones, another follower of Andrea Palladio's own example. Rudolf Wittkower referred to him as among \"the intellectual father(s) of neo-classicism\"."]}, {"page": "Donald Judd", "response": ["Judd was born in Excelsior Springs, Missouri. From 1946 to 1947, he served in the Army as an engineer, and in 1948, he enrolled in the College of William and Mary. Later, he transferred to Columbia University School of General Studies where he earned a bachelor's degree in philosophy and where he worked towards a master's in art history under Rudolf Wittkower and Meyer Schapiro while attending classes at the Art Students League of New York. From 1959 to 1965, he wrote art criticism for major American art magazines. In 1968, he bought a five-story cast-iron building at 101 Spring Street for less than $70,000.William L. Hamilton (March 23, 2006), The Proto-Loft, Reborn The New York Times. Judd used the building (designed by Nicholas Whyte and built in 1870) as his New York residence and studio, and during the next 25 years, renovated it floor by floor, occasionally installing works he purchased or commissioned from other artists."]}, {"page": "Penguin Books", "response": ["Allen Lane approached Nikolaus Pevsner in 1945 for a series of illustrated books that would match the success of the King Penguins. Pevsner recalled his response: \"Allen said, 'You have done the King Penguins now and we are going on with them, but if you had your way, what else would you do?' I had my answer ready—and the answer was very formidable, because I outlined both The Pelican History of Art and The Buildings of England on the spot, each about 40 to 50 volumes. Allen said, 'Yes, we can do both,' and that was the end of the meeting.\"Peter Draper, Reassessing Nikolaus Pevsner, 2004, p. 73. Pevsner's industry quickly bore fruit with the first contracts signed by 1946 for John Summerson's Architecture in Britain, Anthony Blunt's Art and Architecture in France, and Rudolf Wittkower's Italian art and architecture, the first title Painting in Britain, 1530–1790 by Ellis Waterhouse was issued in 1953. By 1955, Pevsner produced a prospectus for the series announcing the publication of four new volumes and a plan for the rest of the series totalling 47 titles. The ambition of the series exceeded previously published multi-volume histories of art such as André Michel's Histoire de l'art (17 vols., 1905–28), the Propyläen Kunstgeschichte (25 vols., 1923–35). Forty-one volumes were published by the time Pevsner retired from editing in 1977. His work was continued by Judy Nairn (his editorial assistant on the Buildings of England) and the medievalist Peter Lasko. Yale University Press acquired the series in 1992 when 45 titles had been completed; by 2004 they had published 21 volumes, mostly revisions of existing editions.Draper, Reassessing Nikolaus Pevsner, p. 75. New volumes continue to be produced in the 2010s, and new editions of older ones."]}, {"page": "Manfredo Tafuri", "response": ["Manfredo Tafuri (Rome, 4 November 1935 – Venice, 23 February 1994), an Italian Marxist architect, historian, theoretician, critic and academic, was described by one commentator as the world's most important architectural historian of the second half of the 20th century.2006 The Assassin: The Critical Legacies of Manfredo Tafuri in Radical Philosophy 138 July/August 2006 He is noted for his pointed critiques of the partisan \"operative criticism\" of previous architectural historians and critics like Bruno Zevi and Siegfried Giedion and for challenging the idea that the Renaissance was a \"golden age\" as it had been characterised in the work of earlier authorities like Heinrich Wölfflin and Rudolf Wittkower."]}, {"page": "Modulor", "response": ["* Rudolf Wittkower"]}, {"page": "Slade Professor of Fine Art", "response": ["* Rudolf Wittkower (1970)"]}, {"page": "Warburg Institute", "response": ["The Warburg Institute maintains a research library of more than 350,000 volumes. These volumes, except for a small number of rare and valuable books, are kept on open shelves and are accessible to all. The library is notable for its unusual and unique reference system: the books are arranged by subject according to Warburg's division of human history into the categories of Action, Orientation, Word, and Image. The institute also holds a large photographic collection of 450,000 photographs of paintings, sculptures, prints and drawings, arranged according to an iconographic system initiated by Rudolf Wittkower and Edgar Wind.K. Mazzucco, 'L'iconoteca Warburg di Amburgo: Documenti per una storia della Photographic Collection del Warburg Institute', Quaderni storici, 141, xlvii n. 3, 2012 The photographic collection also holds the valuable archive of the Image of the Black in Western Art. The Institute's archive contains the personal and working papers of Aby Warburg, together with the archives of Henri Frankfort, Ernst Gombrich and other Warburgian scholars.", "Scholars associated with the Warburg Institute include Ernst Cassirer, Rudolf Wittkower, Otto Kurz, Henri Frankfort, Arnaldo Momigliano, Ernst Gombrich, Erwin Panofsky, Edgar Wind, Frances Yates, Enriqueta Harris, D. P. Walker, Michael Baxandall, Jennifer Montagu, Anthony Grafton, and Elizabeth McGrath. The current group of scholars continues the institute's tradition of interdisciplinary research into history, philosophy, religion, and art. The permanent staff includes a number of academics and graduate students who hold short and long-term fellowships."]}, {"page": "Ecstasy of Saint Teresa", "response": ["The art historian Rudolf Wittkower wrote:"]}, {"page": "List of Catholic artists", "response": ["*Giovanni Battista Piazzetta, Italian Baroque/Rococo painter; works include  The Glory of St. DominicArt and Architecture in Italy, 1600-1750, Volume 3 by Rudolf Wittkower, pgs 88-89 and Assumption of The VirginThe Glory of Venice edited by Jane Martineau and Andrew Robison, pg 473", "*Angelo de Rossi, did sculptures for Popes; is linked to the Accademia di San LucaArt and Architecture in Italy, 1600-1750 by Rudolf Wittkower, pgs 55 and 63H. N. Franz-Duhme, Rossi [Rubeis], Angelo de, in: Oxford Art Online", "*Giacomo Serpotta, stuccoist from Palermo who did a great deal of his work for churchesArt and Architecture in Italy, 1600-1750 by Rudolf Wittkower, pgs 70-71The Cornucopian Mind and the Baroque Unity of the Arts by Giancarlo Maiorino, pgs 110-111Giacomo Serpotta and the stuccatori of Palermo, 1560–1790 by Donald Garstang", "*Gherardo Silvani, Italian architect and sculptor of the Baroque who did much work on the San Gaetano, FlorenceArt and Architecture in Italy, 1600-1750 by Rudolf Wittkower, pgs 118-119", "*Giuseppe Zimbalo, Leccesi architect and sculptor; did the façade of the Basilica of Santa CroceArt and Architecture in Italy, 1600-1750 by Rudolf Wittkower, pg 27 In the Heel of Italy by Martin Shaw Briggs, particularly pgs 260-261, 332, 336, and 350"]}, {"page": "Giovanni Baglione", "response": ["He was born and died in Rome, but from his own account came from a noble family of Perugia. A pupil of the obscure Florentine artist working in Rome, Francesco Morelli (not to be confused with the later French-Italian engraver Francesco Morelli), he worked mainly in Rome, initially with a late-Mannerist style influenced by Giuseppe Cesari (or the \"Cavaliere d'Arpino\"). After an intermezzo Caravaggesco when he was heavily influenced by the young Caravaggio in the early years of the new century, and a Bolognese-influenced phase in the 1610s, Baglione's final style became more generalized and typical of Roman Early Baroque painters such as Guercino, though always reflecting his training in the Central Italian tradition of disegno, the absence of which he criticized in the Caravaggisti.  To Rudolf Wittkower, his style \"vacillated between progressive trends, without absorbing them fully\".O'Neill; Wittkower, who relegates his account of Baglione's style to a note at n. 9, p. 514, and p. 74"]}, {"page": "Baluster", "response": ["Rudolf Wittkower withheld judgement as to the inventor of the balusterH. Siebenhüner, in tracing the baluster's career, found its origin in the profile of the round base of Donatello's Judith and Holofernes, c 1460 (Siebenhüner, \"Docke\", in Reallexikon zur Deutsche Kunstgeschichte vol. 4 1988:102-107) and credited Giuliano da Sangallo with using it consistently as early as the balustrade on the terrace and stairs at the Medici villa at Poggio a Caiano (c 1480),Davies and Hemsol 1983 note the earliest uses of both types of baluster in fictive classicising thrones and architecture in paintings. They instance an earlier use in real architecture on the main façade of the Palazzo Ducale, Urbino, where Luciano Laurana was employed (p. 6 and pl. 3j). and used balustrades in his reconstructions of antique structures. Sangallo passed the motif to Bramante (his Tempietto, 1502) and Michelangelo, through whom balustrades gained wide currency in the 16th century.", "* Rudolf Wittkower, 1974. \"The Renaissance baluster and Palladio\" in Palladio and English Palladianism (London: Thames and Hudson)"]}, {"page": "Neptune and Triton", "response": ["The posture of Neptune's stance, the filling-in of the reverse-V-shaped negative space by another figure (of Triton), were \"radical\" departures from for Bernini,. Her exact words:\"The dynamic composition has been recognized as radical in its rejection of the silhouette-block-shape\". as it was his \"first work in which the silhouette (i.e. block-shape) is broken\",  and his achievement of \"full Baroque freedom\", in the words of Rudolf Wittkower., cited by  However, Wittkower also qualified that Bernini was yet to attain the dynamism (\"the great sweeping movement which animates both David and Pluto [and Daphne] \") in his subsequent works."]}, {"page": "Francesco Mochi", "response": ["His first major work was the Annunciation of the Virgin by the Angel, composed of two statues (the Angel completed 1605, the Virgin Annunciate, 1608,Dates from Ian Wardropper, \"A New Attribution to Francesco Mochi,\" Art Institute of Chicago Museum Studies (1991:102–119, 179), which summarises Mochi's career (pp 106f) in attributing to him an idealised Bust of a Youth at the Art Institute of Chicago. Orvieto, Museo dell'Opera del Duomo). \"A fanfare raising sculpture from its slumber\", as Rudolf Wittkower called it,Wittkower, Art and Architecture in Italy, 1600–1750 3rd ed. (Penguin) 1973:85. it prefigures the baroque with its restrained emotiveness."]}, {"page": "Richard Krautheimer", "response": ["In 1927 he completed his habilitation under Richard Hamann in Marburg. The same year, while researching at the Bibliotheca Hertziana in Rome, Krautheimer developed the idea for a handbook of Roman churches with a colleague, Rudolf Wittkower, later to become the Corpus Basilicarum. In 1928 he accepted a privatdozent teaching position at Marburg. Except for studies-in-residence at the Hertziana (1930/31, 32/33) he remained at Marburg. The Krautheimers fled Nazi persecution, leaving Germany for good. Between 1933 and 1935 Krautheimer worked on the Corpus, accepting paying employment from Frankl's son in the city. The ever-declining political situation for Jews in Axis-alliance countries compelled the Krautheimers to emigrate to the United States of America. Krautheimer found a position at the University of Louisville, Kentucky, a university he purportedly had never heard of. At his request, Louisville hired another fleeing art historian, Krautheimer's friend from school days, Justus Bier. Krautheimer moved to Vassar in 1937 at the request of Vassar's Art Department chair, Agnes Claflin. That same year saw Krautheimer's first volume of the Corpus Basilicarum Christianarum Romae, a scholarly inventory and documentation of the early Christian churches in Rome eventually running to five volumes. The set would not be completed until 1977. Following US entry into World War II, he and Trude became naturalized citizens. Richard volunteered for duty as a senior research analyst for the Office of Strategic Services for the years 1942–44. Here he analyzed aerial photographs of Rome to assist in the protection of historic buildings during bombing. While still at Vassar, he taught (with lecturer status) at New York University (1938–49). Krautheimer was also one of the co-founders of the Census research project, which was founded in 1946 as a cooperation between the Warburg Institute and the Institute of Fine Arts.\"History of the Census\" In: http://www.census.de/census/project?set_language=en He moved to NYU permanently in 1952 as the Jayne Wrightsman Professor of Fine Arts. The early 1950s were devoted to researching his one monograph on an artist, Lorenzo Ghiberti, published jointly with his wife in 1956. He would serve for one semester as acting Director of the Institute of Fine Arts at New York University."]}, {"page": "Alessandro Magnasco", "response": ["A century later he would be described as a \"romantic painter: who painted with candid touches, and ingenious expressiveness, little figures in Gothic churches; or in solitude, hermits and monks; or scoundrels assembled in town squares; soldiers in barracks\".Dizionario geografico-storico-statistico-commerciale degli stati del Re di Sardegna, Volume 7, by Goffredo Casalis, Turin (1840), page 726: \"potrebbe chiamarsi pittore romantico: dipingeva a tocchi franchi, e con isprezzatura ingegnosa, figure piccole in chiese d'architettura gotica, o in solitudini, romiti, cappuccini; ovvero mariuoli sulle piazze, soldati ne’quartieri\". The art historian and critic Luigi Lanzi described him as the Cerquozzi of his school; thereby signaling him into the circle of followers of the Bamboccianti. He indicates that Magnasco had \"figures scarcely more than a span large ... painted with humor and delight\", but not as if this effect had been the intention of the painter. Lanzi says these eccentric pieces were favored by the Grand Duke Giovanni Gastone Medici of Florence. Magnasco also found contemporary patronage for his work among prominent families and collectors of Milan, for example the Arese and Casnedi families.Spike 1986, p. 87. This series of patrons underscores the fact that Magnasco was more esteemed by outsiders than by his fellow Genoese; as Lanzi noted, \"his bold touch, though joined to a noble conception and to correct drawing, did not attract in Genoa, because it is far removed from the finish and union of tints which (Genoese) masters followed.\"Lanzi, p. 287. In the twentieth century, Rudolf Wittkower derided him as \"solitary, tense, strange, mystic, ecstatic, grotesque, and out of touch with the triumphal course of the Venetian school\" from 1710 onward."]}]}}