{"wiki_id": "http://www.wikidata.org/entity/Q2156757", "itemLabel": "Mark Blaug", "itemDescription": "British economist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Blaug", "wikipedia_page": {"main": "Mark Blaug FBA (; 3 April 1927 – 18 November 2011) was a Dutch-born British economist (naturalised in 1982), who covered a broad range of topics during his long career.He was married to Ruth Towse.", "link_mentions": [{"page": "Austrian School", "response": ["Economist Mark Blaug has criticized over-reliance on methodological individualism, arguing it would rule out all macroeconomic propositions that cannot be reduced to microeconomic ones, and hence reject almost the whole of received macroeconomics."]}, {"page": "Capitalism", "response": ["In capitalist economics, market competition is the rivalry among sellers trying to achieve such goals as increasing profits, market share and sales volume by varying the elements of the marketing mix: price, product, distribution and promotion. Merriam-Webster defines competition in business as \"the effort of two or more parties acting independently to secure the business of a third party by offering the most favourable terms\". It was described by Adam Smith in The Wealth of Nations (1776) and later economists as allocating productive resources to their most highly valued usesGeorge J. Stigler, 2008. ([1987]  2008 . \"competition\", The New Palgrave Dictionary of Economics. Abstract.  and encouraging efficiency. Smith and other classical economists before Antoine Augustine Cournot were referring to price and non-price rivalry among producers to sell their goods on best terms by bidding of buyers, not necessarily to a large number of sellers nor to a market in final equilibrium.Mark Blaug, 2008. \"Invisible hand\", The New Palgrave Dictionary of Economics, 2nd Edition, v. 4, p. 565. Abstract . Competition is widespread throughout the market process. It is a condition where \"buyers tend to compete with other buyers, and sellers tend to compete with other sellers\". In offering goods for exchange, buyers competitively bid to purchase specific quantities of specific goods which are available, or might be available if sellers were to choose to offer such goods. Similarly, sellers bid against other sellers in offering goods on the market, competing for the attention and exchange resources of buyers. Competition results from scarcity, as it is not possible to satisfy all conceivable human wants, and occurs as people try to meet the criteria being used to determine allocation."]}, {"page": "Economist", "response": ["* Mark Blaug and Howard R. Vane (1983, 2003 4th ed.). . Table of Contents links. Cheltenham & Edward Elgar Pub."]}, {"page": "English Poor Laws", "response": ["The historiography of the Poor Laws has passed through several distinct phases.Boyer, George, An economic history of the English poor law, 1750–1850, Chapter 2 The \"traditionalist\" or \"orthodox\" account of the Poor Laws focuses upon the deficiencies of the Old Poor Law.Boyer, George, An economic history of the English poor law, 1750–1850, p. 51 This early historiography was influential in successfully overhauling the system. Mark Blaug presents the first revisionist analysis of the Poor Law in \"The Myth of the Old Poor Law and the making of the New\", commenting that the Old Poor Law did not reduce the efficiency of agricultural workers, lower wages, depress rents or compound the burden on rate payers.Blaug, Mark, \"The Poor Law Report Reexamined\", The Journal of Economic History, Vol. 24, No. 2 (June 1964), pp. 229–45. Blaug argues that Old Poor Law was a device \"for dealing with the problems of structural unemployment and substandard wages in the lagging rural sector of a rapidly growing but still underdeveloped economy\". Other areas of Poor Law which have concerned historians include the extent to which the Second Great Reform Act contributed to the Poor Law Amendment ActRees, Rosmary, Poverty and Public Health, 1815–1948, p. 33 and the extent to which outdoor relief was abolished following the New Poor Law.Rose, Michael E. The English Poor Law, 1780–1930. Newton Abbot: David & Charles, 1971."]}, {"page": "Speenhamland system", "response": ["Evidence in the last 30 years shows that the bread scale devised during the Speenhamland meeting in 1795 was by no means universal, and that even the system of outdoor relief which found one of its earliest, though not its first, expressions in Speenhamland was not completely widespread. Allowances or supplements to wages were used generally as a temporary measure and the way they operated differed between regions. Mark Blaug's 1960 essay The Myth of the Old Poor Law charged the commissioners of 1834 with largely using the Speenhamland system to vilify the old poor law and create a will for the passage of a new one. However, historians such as Eric Hobsbawm have argued that the old poor law was still damaging by subsidising employers, and heightening dependency of workers'  incomes on local aristocrats.part 3(1)"]}, {"page": "Classical economics", "response": ["* Mark Blaug (1987). \"classical economics,\" The New Palgrave Dictionary of Economics, v. 1, pp. 414–45."]}, {"page": "Methodological individualism", "response": ["Economist Mark Blaug has criticized over-reliance on methodological individualism in economics, saying that \"it is helpful to note what methodological individualism strictly interpreted [...] would imply for economics. In effect, it would rule out all macroeconomic propositions that cannot be reduced to microeconomic ones [...] this amounts to saying goodbye to almost the whole of received macroeconomics. There must be something wrong with a methodological principle that has such devastating implications\"."]}, {"page": "Georgism", "response": ["Other contemporaries such as Austrian economist Frank Fetter and neoclassical economist John Bates Clark argued that it was impractical to maintain the traditional distinction between land and capital, and used this as a basis to attack Georgism. Mark Blaug, a specialist in the history of economic thought, credits Fetter and Clark with influencing mainstream economists to abandon the idea \"that land is a unique factor of production and hence that there is any special need for a special theory of ground rent\" claiming that \"this is in fact the basis of all the attacks on Henry George by contemporary economists and certainly the fundamental reason why professional economists increasingly ignored him\".Blaug, Mark. Interview in Andelson, Robert V. Critics of Henry George: An Appraisal of Their Strictures on Progress and Poverty. Blackwell Publishing. 1979. p. 686."]}, {"page": "Circulating capital", "response": ["Circulating capital includes intermediate goods and operating expenses, i.e., short-lived items that are used in production and used up in the process of creating other goods or services.Mark Blaug, 2008. \"circulating capital,\"   The New Palgrave Dictionary of Economics, 2nd Edition.  Abstract. This is roughly equal to intermediate consumption. Finer distinctions include raw materials, intermediate goods, inventories, ancillary operating expenses and (working capital). It is contrasted with fixed capital. The term was used in more specialized ways by classical economists such as Adam Smith, David Ricardo and Karl Marx."]}, {"page": "The Wealth of Nations", "response": ["Mark Blaug argues that it was Smith's achievement to shift the burden of proof against those maintaining that the pursuit of self-interest does not achieve social good. But he notes Smith's relevant attention to definite institutional arrangements and process as disciplining self-interest to widen the scope of the market, accumulate capital, and grow income.Mark Blaug (1997). Economic Theory in Retrospect, 5th ed., in ch. 2, sect. 19, \"Adam Smith as an Economist, pp. 59–62."]}, {"page": "Knut Wicksell", "response": ["Elements of his public policy were taken strongly to heart by the Swedish government, including his price-level targeting rule during the 1930s (Jonung 1979) and his vision of a welfare state. Wicksell's contributions to economics have been described by some economists, including historian-of-economics Mark Blaug, as fundamental to modern macroeconomics. Michael Woodford has especially praised Wicksell's advocacy of using the interest rate to maintain price stability, noting that it was a remarkable insight when most monetary policy was based on the gold standard (Woodford, 2003, p. 32). Woodford calls his own framework 'neo-Wicksellian', and he titled his textbook on monetary policy in homage to Wicksell's work."]}, {"page": "Richard Layard, Baron Layard", "response": ["Layard assisted Claus Moser on the Robbins enquiry, and later developed a reputation in the economics of education (with Mark Blaug at LSE), and labour economics (in particular with Stephen Nickell). He advocated many of the policies which characterised the New Labour government, particularly the New Deal, partly by founding the Centre for Economic Performance at the London School of Economics. One approach he took is based on the idea of welfare-to-work, where social welfare payments are structured in a way that encourages (or forces) recipients back into the job market."]}, {"page": "E. Roy Weintraub", "response": ["Eliot Roy Weintraub (; born March 22, 1943) is an American mathematician, economist, and, since 1976, professor of economics at Duke University.• John Lodewijks, 2002. \"Roy Weintraub's Contribution to the History of Economics,\" in S. G. Medema and W. J. Samuels, ed., Historians of Economics and Economic Thought: The Construction of Disciplinary Memory, Routledge, pp. 316–7 [pp. 315 -28.   • Mark Blaug, 1999. Who's Who in Economics, 3d edition. He was born in 1943 in New York City."]}, {"page": "Poor law union", "response": ["The English Poor Laws laid out the system of poor relief that existed in England and Wales from the reign of Elizabeth I until the emergence of the modern welfare state after the Second World War. Historian Mark Blaug has argued that the Poor Law  system provided \"a welfare state in miniature, relieving the elderly, widows, children, the sick, the disabled, and the unemployed and underemployed\".Blaug, Mark. \"The Poor Law Report Re-examined.\" Journal of Economic History (1964) 24: 229–45"]}, {"page": "Mark (given name)", "response": ["*Mark Blaug (1927–2011), Dutch-born British economist "]}, {"page": "Competition (economics)", "response": ["In his 1776  The Wealth of Nations, Adam Smith described it as the exercise of allocating productive resources to their most highly valued uses and encouraging efficiency, an explanation that quickly found support among liberal economists opposing the monopolistic practices of mercantilism, the dominant economic philosophy of the time.Lanny Ebenstein, 2015. Chicagonomics: The Evolution of Chicago Free Market Economics Macmillan, pp. 13–17, 107.George J. Stigler, 2008.  ([1987] 2008,. \"competition,\" The New Palgrave Dictionary of Economics. Abstract. Smith and other classical economists before Cournot were referring to price and non-price rivalry among producers to sell their goods on best terms by bidding of buyers, not necessarily to a large number of sellers nor to a market in final equilibrium.Mark Blaug, 2008. \"invisible hand,\" The New Palgrave Dictionary of Economics, 2nd Edition, v. 4, p. 565. Abstract."]}, {"page": "Economic methodology", "response": ["* the balance of empirical and philosophical approaches• Mark Blaug, 2007. \"The Social Sciences: Economics\", Postwar developments, Methodological considerations in contemporary economics, The New Encyclopædia Britannica, v. 27, pp. 346-47.   • Edward J. Nell (2004) \"Critical Realism and Transformational Growth.\" In Transforming Economics. Edited by P. Lewis. London: Routledge.76-95.   • Frank H. Knight, 1924. \"The Limitations of Scientific Method in Economics\", in The Trend of Economics, R.G. Tugwell, ed., pp. 229-67. Reprinted in  Frank H. Knight, 1935 [1997], The Ethics of Competition, pp. 97- 139.   •Daniel M. Hausman, 1983. \"The Limits of Economic Science\", in The Limits of Lawfulness: Studies on the Scope and Nature of Scientific Knowledge, N. Rescher, ed. Reprinted in  D.M. Hausman, 1992, Essays on Philosophy and Economic Methodology, pp.  99-108.", "* the role of mathematics and mathematical economics in economics• W. Stanley Jevons, 1879. The Theory of Political Economy,  2nd ed., ch. I, \"Introduction\", pp.  1-29.   • Paul A. Samuelson, 1952. \"Economic Theory and Mathematics — An Appraisal\", American Economic Review, 42(2), pp. 56-66.   • D.W. Bushaw and R.W. Clower, 1957. Introduction to Mathematical Economics, pp. vii-viii and ch. 1, pp. 3-8.    •  Gérard Debreu, ([1987] 2008). \"mathematical economics\", The New Palgrave Dictionary of Economics, 2nd Edition. Abstract. (First published with revisions from 1986, \"Theoretic Models: Mathematical Form and Economic Content\", Econometrica, 54(6), pp. 1259-1270.)   • _____ 1991. \"The Mathematization of Economic Theory\", American Economic Review, 81(1), pp. 1-7.    • Robert W. Clower, 1994. \"Economics as an Inductive Science\", Southern Economic Journal, 60(4), pp. 805-814.   • _____, 1995. \"Axiomatics in Economics\", Southern Economic Journal, 62(2), pp. 307-319.   • Mark Blaug, 2003. \"The Formalist Revolution of the 1950s\", Journal of the History of Economic Thought,  25(2), pp. 145-156.  Abstract.  Reprinted in Warren J. Samuels, et al., ed., 2003, A Companion to the History of Economic Thought, Wiley, pp. 395- 409.   • _____,", "* the relation between theory, observation, application, and methodology in contemporary economics.• Wassily Leontief, 1971. \"Theoretical Assumptions and Nonobserved Facts\", American Economic Review, 61(1), pp. 1-7. Reprinted in W. Leontief, 1977, Essays in Economics, v. 1, ch. III, pp. 24-34.   • Mark Blaug, 1992. The Methodology of Economics: Or How Economists Explain, 2nd ed., Cambridge. Description and Preview.   • Roger Backhouse and Mark Blaug, 1994. New Directions in Economic Methodology, Routledge. Contents preview.   • P.A.G. van Bergeijk et al., 1997. Economic Science and Practice: The Roles of Academic Economists and Policy-Makers. Description  & preview links.   • D. Wade Hands, 2001. Without Rules: Economic Methodology and Contemporary Science Theory, Oxford. Description and contents preview.   • Christopher A. Sims, 1996. \"Macroeconomics and Methodology\", Journal of Economic Perspectives, 10(1), pp. 105-120.    • Kevin D. Hoover, 2001. The Methodology of Empirical Macroeconomics,  Oxford. Description and  preview.   • Bruno S. Frey, 2001. \"Why Economists Disregard Economic Methodology, Journal of Economic Methodology, 8(1), pp. 41–47 ."]}, {"page": "Frank Fetter", "response": ["Fetter's stand on this issue further led him to oppose Georgist ideas like the land value tax. Mark Blaug, a specialist in the history of economic thought, credits Fetter and John Bates Clark with influencing mainstream economists to abandon the idea \"that land is a unique factor of production and hence that there is any special need for a special theory of ground rent.... This is in fact the basis of all the attacks on Henry George by contemporary economists and certainly the fundamental reason why professional economists increasingly ignored him.\"Blaug, Mark. Interview in Andelson, Robert V. Critics of Henry George: An Appraisal of Their Strictures on Progress and Poverty. Blackwell Publishing. 1979. p. 686."]}, {"page": "Act for the Relief of the Poor 1601", "response": ["The Historian Mark Blaug has defended the Old Poor Law system and criticised the Poor Law Amendment Act. Evidence to the 1937 Committee on the Poor Law Amendment Act also found some support for the existing system.In praise of the old Poor Law"]}, {"page": "Foundation for European Economic Development", "response": ["The above text was signed by the following leading economists: Moses Abramovitz, W. Brian Arthur, Robert Axelrod, Mark Blaug, Kenneth E. Boulding, Keith Cowling, Richard M. Cyert, Richard H. Day, Paul Davidson, Phyllis Deane, Edward F. Denison, Meghnad Desai, Christopher Freeman, Bruno Frey, Eirik Furubotn, John Kenneth Galbraith, Nicholas Georgescu-Roegen, Richard M. Goodwin, Clive W. J. Granger, Jean-Michel Gradmont, Geoffrey Harcourt, Robert Heilbroner, Albert O. Hirschman, Charles P. Kindleberger, János Kornai, David Laidler, Harvey Leibenstein, Robin C. O. Matthews, Thomas Mayer, Hyman Minsky, Franco Modigliani, Richard R. Nelson, Mancur Olson, Luigi Pasinetti, Mark Perlman, Kurt Rothschild, Paul A. Samuelson, Martin Shubik, Herbert A. Simon, Aris Spanos, Jan Tinbergen, Shigeo Tsuru, Douglas Vickers, E. Roy Weintraub. "]}, {"page": "Economics of the arts and literature", "response": ["* Mark Blaug, 2001.  \"Where Are We Now on Cultural Economics,\" Journal of Economic Surveys, 15(2), pp. 123–14. Abstract."]}, {"page": "Robert Summers", "response": ["* Mark Blaug and  Howard R. Vane (2003).  Who's Who in Economics, pp. 811–812."]}, {"page": "Sidney Weintraub (economist, born 1914)", "response": ["He is the father of the mathematical economist E. Roy Weintraub.• John Lodewijks, 2002. \"Roy Weintraub's Contribution to the History of Economics,\" in S. G. Medema and W. J. Samuels, ed., Historians of Economics and Economic Thought: The Construction of Disciplinary Memory, Routledge, pp. 316–7 [pp. 315 -28.   • Mark Blaug, 1999. Who's Who in Economics, 3d edition."]}, {"page": "Edward Elgar Publishing", "response": ["The first Edward Elgar Publishing book titles were published in 1987 and included The Economics of Education and the Education of an Economist by Mark Blaug, The Economic Revival of Modern Britain by David Coates and John Hillard, and Economic Choice Under Uncertainty by J.L. Ford."]}, {"page": "Kotaro Suzumura", "response": ["* Mark Blaug and  Howard R. Vane, 2003.  Who's Who in Economics', pp. 813-814."]}, {"page": "Education economics", "response": ["* Mark Blaug, 1985. \"Where Are We Now in the Economics of Education?\" Economics of Education Review, 4(1), pp. 17–28. Abstract."]}, {"page": "List of Guggenheim Fellowships awarded in 1958", "response": ["* Mark Blaug, Professor of the History and Methodology of Economics, University of Amsterdam: 1958."]}, {"page": "Historiography of the Poor Laws", "response": ["The Historiography of the Poor Laws can be said to have passed through three distinct phases. Early historiography was concerned with the deficiencies of the Old Poor Law system, later work can be characterized as an early attempt at revisionism before the writings of Mark Blaug present a truly revisionist analysis of the Poor Law system.", "The revisionist analysis of the Poor Law was first presented by Mark Blaug who in 1963 published the paper “The Myth of the Old Poor Law and the making of the New”."]}, {"page": "Value-form", "response": ["Marx borrowed the idea of the form of value from the Greek philosopher Aristotle (circa 384-322 BC), who pondered the nature of exchange value in chapter 5 of Book 5 in his Nicomachean Ethics.See further Scott Meikle, Aristotle's economic thought. Oxford: Clarendon, 1995; Mark Blaug (ed.), Aristotle (384–322 BC). Aldershot: Elgar, 1991; Cosimo Perrotta, \"Economic Value and Moral Value in Aristotle\", in: Tony Aspromourgos and John Lodewijks (eds.), History and Political Economy. Essays in Honour of P.D. Groenewegen. London: Routledge, 2004; Spencer J. Pack, Aristotle, Adam Smith and Karl Marx. On Some Fundamental Issues in 21st Century Political Economy. Cheltenham: Edward Elgar, 2010, Part 1. Aristotle distinguished clearly between the concepts of use-value and exchange-value (a distinction taken over by Adam Smith). Aristotle developed a fairly sophisticated theory of money, and in chapter 9 of Book 1 of his Politics, he describes the circuits of commodity trade C-M-C' (oekonomia) and M-C-M' (chrematistikon).This is explained by Marx in his book A contribution to the critique of political economy (1859). However, Marx criticized and developed Aristotle's ideas in an original way.Cornelius Castoriadis, \"Value, equality, justice, politics: from Marx to Aristotle and from Aristotle to ourselves\", in: Cornelius Castoriadis, Crossroads in the labyrinth. Cambridge, Mass.: MIT Press, 1984, pp. 260-339.", "So there is no agreement about the future of capitalism, the prognoses are difficult to prove, and all kinds of things could contingently happen.Nicholas Georgescu-Roegen, \"Mathematical proofs of the breakdown of capitalism\". In: Econometrica, Vol. 28, Issue 2, April 1960, pp. 225–243. Reprinted in: Nicholas Georgescu-Roegen, Analytical Economics. Cambridge: Harvard University Press, 1966, pp. 398–415. When people \"make history\" instead of being made by history, it means that what they do now, helps to bring the future into being. All the different perspectives may have part of the truth. Hillel Ticktin, the editor of the socialist journal Critique, describes the global situation as \"an intermediate period in a transitional world.\"Hillel Ticktin, \"Editorial: an intermediate period in transitional world.\" Critique, Vol. 46, No. 2, 2018, pp. 171-183, at p. 171. Mark Blaug argued that \"the central weakness of modern economics\" is \"the reluctance to produce the theories that yield unambiguously refutable implications, followed by a general unwillingness to confront those implications with the facts.\"Mark Blaug, The methodology of economics, or how economists explain.Second edition, Cambridge University Press, 1992, p. 238. These days accurate and comprehensive forecasts are worth gigantic amounts of money, and so, such forecasts often become a well-guarded secret. A lot of research is no longer being done, because if it is done, it is immediately stolen without trace (by hackers and burglars who want to cream off and head off the most advanced ideas at their point of production, in real time). In 2018, The Economist Intelligence Unit ranked a severe cyber attack crippling corporate and government activities among the top 10 risks to the global economy. At the micro-level, Dutch researchers studied a sample of 1,058 youths aged 12 to 18 years in 2018, and found that 5.1% of youths said they had sometimes hacked without permission into email accounts, 15,2% into mobile phones, and 5,4% into networks. Around 12% said they hadn't done it, but could do it. 54.6% said they would \"never hack\", but 45.4% said they might give it a try."]}, {"page": "Jaroslav Vaněk", "response": ["* Ярослав Ванек (Jaroslav Vaněk, biography), Russian translation (available at gallery.economicus.ru) from Mark Blaug's publication Great economists since Keynes: introduction to the lives and works of one hundred modern economists, Barnes & Noble 1985, Edward Elgar 1998"]}]}}