{"wiki_id": "http://www.wikidata.org/entity/Q21515839", "itemLabel": "Richard Brinsley Hinds", "itemDescription": "botanist (1812-1847)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Brinsley_Hinds", "wikipedia_page": {"main": "Richard Brinsley Hinds FRCS (11 October 1811, Aldermaston, England – 25 May 1846, Swan River, Western Australia) was a British naval surgeon, botanist and malacologist. He sailed on the 1835–42 voyage by HMS Sulphur to explore the Pacific Ocean, and edited the natural history reports of that expedition.", "link_mentions": [{"page": "List of tuberculosis cases", "response": ["*Richard Brinsley Hinds (1811–1846), British naval surgeon, botanist and malacologist, diagnosed with phthisis in 1845 "]}, {"page": "George Bentham", "response": ["In 1844, he provided the botanical descriptions for The Botany of the Voyage of H.M.S. Sulphur. The editor, Richard Brinsley Hinds, had been surgeon on HMS Sulphur 1835-41 while she explored the Pacific coast of the Americas."]}, {"page": "List of malacologists", "response": ["*Richard Brinsley Hinds (1811–1846) Great Britain"]}, {"page": "HMS Sulphur (1826)", "response": ["Richard Brinsley Hinds (1811-1846) served as surgeon on Sulphur 1835-42. He was a naturalist, and collected numerous samples of plants and marine animals for study. He edited  and The Zoology of the Voyage of H.M.S. Sulphur (1844). The introduction to Zoology, Volume 1 provides a detailed description of the voyage."]}, {"page": "Hindsia", "response": ["Brazil. The species Hindsia longiflora and H. violacea were used to separate the genus from Rondeletia. The genus was named in honour of Richard Brinsley Hinds."]}, {"page": "Hinds (surname)", "response": ["*Richard Brinsley Hinds (1811-1846), British naval surgeon, botanist and malacologist"]}, {"page": "Naval surgeon", "response": ["* Richard Brinsley Hinds (1811–1846) was surgeon on the 1835–1842 voyage of  to explore the Pacific Ocean, and edited the natural history reports of the expedition."]}, {"page": "Sylvanus Charles Thorp Hanley", "response": ["Hanley collected over a period of 60 years, and corresponded frequently with many other naturalists of his time. He acquired several specimens of Unio, now extinct, for Isaac Lea. Several syntypes were collected by him for other leading contemporary biologists, including Arthur Adams, W.H. Dall, Henry B. Guppy, Richard Brinsley Hinds, Jeffries, Leath, Sven Ludvig Lovén, George Montagu, William Harper Pease, Rodolfo Amando Philippi and Tryon Reakirt."]}, {"page": "Dendrobium antennatum", "response": ["Dendrobium antennatum was first formally described in 1843 by John Lindley from a specimen collected in New Guinea by Richard Brinsley Hinds."]}, {"page": "Hinds' dragonet", "response": ["Callionymus hindsii, Hinds' dragonet, is a species of dragonet native to the Indian Ocean and the western Pacific Ocean where it occurs at depths down to .  This species grows to a length of  TL. The specific name is thought to most likely to be in honour of the British naval surgeon, naturalist and writer Richard Brinsley Hinds (1811-1846)."]}]}}