{"wiki_id": "http://www.wikidata.org/entity/Q2159747", "itemLabel": "Robin Donovan", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Robin_Donovan", "wikipedia_page": {"main": "Robin Donovan (born 19 December 1955 in Rustington, West Sussex) is a British former racing driver. He is best known for competing in 14 editions of the Le Mans 24 hours race; his best result there being 6th overall, 3rd in class (LMP1) and 1st privateer home driving with 5 x Le Mans winner Derek Bell MBE and Daytona 24 hours winner Jurgen Lassig in 1994 with the Gulf Racing entered and sponsored Kremer Porsche K8.", "link_mentions": [{"page": "Jean-Pierre Jarier", "response": ["|align=\"left\"|  Carl Rosenblad Robin Donovan"]}, {"page": "Derek Bell (racing driver)", "response": ["|align=\"left\"|  Robin Donovan  Jürgen Lässig"]}, {"page": "2001 24 Hours of Le Mans", "response": ["|rowspan=2|  Robin Donovan Terry Lingner Chris MacAllister"]}, {"page": "1999 24 Hours of Le Mans", "response": ["|rowspan=2|  Yojiro Terada Franck Fréon Robin Donovan"]}, {"page": "1998 24 Hours of Le Mans", "response": ["|  Jean-Pierre Jarier Patrice Goueslard Robin Donovan", "|rowspan=2|  Jean-Pierre Jarier Carl Rosenblad Robin Donovan"]}, {"page": "1996 24 Hours of Le Mans", "response": ["|rowspan=2|  Robin Donovan Piero Nappi Tetsuya Ota"]}, {"page": "1995 24 Hours of Le Mans", "response": ["|rowspan=2|  Riccardo Agusta Robin Donovan Eugene O'Brien"]}, {"page": "1994 24 Hours of Le Mans", "response": ["|rowspan=2|  Derek Bell Robin Donovan  Jürgen Lässig"]}, {"page": "1993 24 Hours of Le Mans", "response": ["|rowspan=2|  Almo Coppelli Robin Donovan Steve Fossett"]}, {"page": "1992 24 Hours of Le Mans", "response": ["|rowspan=2|  Robin Donovan Charles Rickett Almo Coppelli"]}, {"page": "1991 24 Hours of Le Mans", "response": ["|rowspan=2|  Nick Adams Robin Donovan Richard Jones"]}, {"page": "1990 24 Hours of Le Mans", "response": ["|rowspan=2|  Philippe de Henning Charles Zwolsman Robin Donovan"]}, {"page": "1988 24 Hours of Le Mans", "response": ["|rowspan=2|  Martin Schanche Robin Smith Robin Donovan"]}, {"page": "1987 24 Hours of Le Mans", "response": ["|rowspan=2|  Tim Lee-Davey Robin Donovan Raymond Boutinaud"]}, {"page": "1986 24 Hours of Le Mans", "response": ["|rowspan=2|  Robin Donovan Richard Jones Nick Adams"]}, {"page": "1991 World Sportscar Championship", "response": ["|  Robin Donovan"]}, {"page": "1988 World Sportscar Championship", "response": ["|  Robin Donovan", "|  Robin Donovan"]}, {"page": "1987 World Sportscar Championship", "response": ["|  Robin Donovan", "|  Robin Donovan"]}, {"page": "1986 World Sportscar Championship", "response": ["|  Robin Donovan"]}, {"page": "1985 World Sportscar Championship", "response": ["|  Robin Donovan"]}, {"page": "1998 International Sports Racing Series", "response": ["|  Arturo Merzario Fulvio Ballabio Robin Donovan"]}, {"page": "1997 International Sports Racing Series", "response": ["|  Arturo Merzario Robin Donovan"]}, {"page": "Franck Fréon", "response": ["|align=\"left\"|  Yojiro Terada Robin Donovan"]}, {"page": "1995 BPR Global GT Series", "response": ["|  Robin Donovan"]}, {"page": "1997 International Sports Racing Series Jarama", "response": ["| rowspan=2 |  Arturo Merzario Robin Donovan"]}, {"page": "1998 International Sports Racing Series Paul Ricard", "response": ["| rowspan=2 |  Arturo Merzario Robin Donovan Fulvio Ballabio"]}, {"page": "Yojiro Terada", "response": ["|align=\"left\"|  Franck Fréon Robin Donovan"]}, {"page": "Charles Zwolsman Sr.", "response": [" Robin Donovan"]}, {"page": "1988 1000 km of Brands Hatch", "response": ["| rowspan=2 |  Chris Hodgetts Robin Donovan Tim Harvey"]}, {"page": "1987 1000 km of Brands Hatch", "response": ["| rowspan=2 |  Robin Donovan Kenneth Leim"]}, {"page": "1986 1000 km of Brands Hatch", "response": ["| rowspan=2 |  Robin Donovan Max Cohen-Olivar Kenneth Leim"]}, {"page": "1986 360 km of Jerez", "response": ["| rowspan=2 |  Robin Donovan Nick Adams"]}, {"page": "1986 1000 km of Fuji", "response": ["| rowspan=2 |  Robin Donovan Kenneth Leim Yoshiyuki Oguwa"]}, {"page": "1985 800 km of Selangor", "response": ["| rowspan=2 |  Robin Smith Robin Donovan Kenneth Leim"]}, {"page": "Carl Rosenblad (racing driver)", "response": ["|align=\"left\"|  Jean-Pierre Jarier Robin Donovan"]}, {"page": "Jürgen Lässig", "response": ["|align=\"left\"|  Derek Bell Robin Donovan"]}, {"page": "1989 British Touring Car Championship", "response": ["|  Robin Donovan", "|align=left|  Robin Donovan"]}, {"page": "Max Cohen-Olivar", "response": ["|align=\"left\"|  John Sheldon Robin Donovan"]}, {"page": "Centenari", "response": ["For 1998, a new car, the Centenari Mac3, was developed, and the team expanded to a two-car effort, with the M1 being retained. The team started their season at the 1000 km Monza, which was part of the GT Italian Challenge and the Challenge Endurance Italia, with Loic Depailler, Xavier Pompidou, Giovanna Amati and Marco Lucchinelli driving the new Mac3, and Merzario, Giovanni Li Calzi, Robin Donovan and Fulvio Ballabio driving the older M1. Although the two cars were qualified in seventh and twelfth respectively, neither car had a successful race; the Mac3 didn't make the start, and the M1 retired after 73 laps. Both cars finished the ISRS season opener at Paul Ricard, with the M1 finishing fourth, and the Mac3 finishing sixth; both cars were classified in the CN category, and they were the only cars in that category to finish the race. This was followed by a ninth and tenth overall finish (second and third in the CN class) for the Mac3 and M1 at Brno. For Misano, Centenari entered three cars; two M1s, and a Mac3. Both M1s retired, but the Mac3 finished twelfth, and fifth in class. At Donington Park, only one of the M1s was classified as finishing, in last place overall; the other M1 did not start the race, and the Mac3 completed too few laps to be classified. Anderstorp once more saw only one M1 finish, in last place overall; the Mac3's gearbox failed after 31 laps, and the other M1's differential failed after a single lap. Nürburgring saw a small improvement; the Mac3 and one M1 both finished, in twelfth and thirteenth overall; however, these were the bottom positions in the CN class. At the penultimate round at Le Mans, the Mac3 finished tenth overall and second in class, whilst one of the M1's engines expired before it completed a lap, and the other experienced an engine failure after 30 laps. A single M1 was the only entry in the season finale at Kyalami; however, it retired with clutch issues after 32 laps. Centenari were classified joint-second in the CN Team's Championship, and eleventh overall, at the end of the season."]}, {"page": "Centenari M1", "response": ["In 1991, Centenari entered Federico D'Amore and a M1 in several Italian Prototype Championship events. The best result of the season was a third-placed finish at Enna-Pergusa. For 1992, D'Amore left the team, and Stefano Speranza was entered at Monza, but failed to finish. Arturo Merzario was then entered in two races, with his best finish being eighth at Vallelunga. The car was not used again in 1993, but Merzario used the car from 1994 until 1997 in the series. He took the car's first ever victory at Vallelunga in 1995, and he would take four more Italian Prototype Championship victories in the car. The team started their 1998 season at the 1000 km Monza, which was part of the GT Italian Challenge and the Challenge Endurance Italia, with Merzario, Giovanni Li Calzi, Robin Donovan and Fulvio Ballabio driving the M1. Although the car was qualified in twelfth, it did not have a successful race, as it was retired after 73 laps."]}, {"page": "Centenari Mac3", "response": ["For 1998, Centenari developed a new car for the International Sports Racing Series (ISRS) – the Mac3 – and the team expanded to a two-car effort, with the older M1 being retained. The team started their season at the 1000 km Monza, which was part of the GT Italian Challenge and the Challenge Endurance Italia, with Loic Depailler, Xavier Pompidou, Giovanna Amati and Marco Lucchinelli driving the new Mac3, and Merzario, Giovanni Li Calzi, Robin Donovan and Fulvio Ballabio driving the older M1. Although the two cars were qualified in seventh and twelfth respectively, neither car had a successful race; the Mac3 didn't make the start, and the M1 retired after 73 laps. The Mac3 did, however, finish sixth in the ISRS season opener at Paul Ricard; both Centenaris were classified in the CN category, and they were the only cars in that category to finish the race. This was followed by a ninth overall finish (second in the CN class) for the Mac3 at Brno. For Misano, Centenari entered three cars; two M1s, and a Mac3. Both M1s retired, but the Mac3 finished twelfth, and fifth in class. At Donington Park, the Mac3 completed too few laps to be classified. Anderstorp saw the Mac3's gearbox fail after 31 laps. Nürburgring saw the Mac3 finish in twelfth place overall; however, this was the second-to-last position in the CN class (the M1, which finished in thirteenth overall, was last in class). At the penultimate round at Le Mans, the Mac3 finished tenth overall and second in class. A Mac3 was then used in the Hockenheim round of the Internationales FRC Rennen by G. Gomez, but was not classified. The Mac3 was not entered in the ISRS season finale at Kyalami. Centenari were classified joint-second in the CN Team's Championship, and eleventh overall, at the end of the ISRS season."]}]}}