{"wiki_id": "http://www.wikidata.org/entity/Q2153097", "itemLabel": "David Mach", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Mach", "wikipedia_page": {"main": "David Mach  (born 18 March 1956) is a Scottish sculptor and installation artist.", "link_mentions": [{"page": "Kingston upon Thames", "response": ["One of the more unusual sights in Kingston is Out of Order by David Mach, a sculpture in the form of twelve disused red telephone boxes that have been tipped up to lean against one another in an arrangement resembling dominoes. The work was commissioned in 1988 as part of the landscaping for the new Relief Road, and was described by its creator as \"anti-minimalist\".", "In the 1960s, planners proposed a partially elevated ring road encircling the town centre, to alleviate congestion on major shopping streets and traffic heading towards Kingston Bridge. After objections from local residents, an interim one-way system was implemented in July 1963. Following this, the Kingston Relief Road was constructed in Kingston town centre in the late 1980s. Commonly known as the \"Kingston one-way system\", the road encircles the town centre, allowing for major shopping streets such as Clarence Street to be pedestrianised. On the eastern side of the town centre, the road passes underneath John Lewis Kingston in a tunnel, before crossing the River Thames via Kingston Bridge. As part of the project, two bus stations were constructed, cycle lanes installed and several artworks commissioned including Out of Order by David Mach and River Celebration by Carole Hodgson."]}, {"page": "Seattle University", "response": ["The campus includes numerous works by well-known artists: the Centennial Fountain by Seattle artist George Tsutakawa;Campus scene (Centennial Fountain) , captioned image on the Seattle U. web site. Accessed online February 28, 2007. a large glass sculpture in the PACCAR Atrium of Piggot Hall by Tacoma artist Dale Chihuly;Tina Potterf, Home Is Where the Art Is , Seattle University Magazine article reproduced on the Seattle University web site. Accessed online February 28, 2007. and works by Chuck Close, Jacob Lawrence, Gwendolyn Knight, William Morris, and David Mach."]}, {"page": "Peter Gabriel", "response": ["Gabriel employed an innovative approach in the marketing of the Us album. Not wishing to feature only images of himself, he asked artist filmmakers Nichola Bruce and Michael Coulson to co-ordinate a marketing campaign using contemporary artists. Artists such as Helen Chadwick, Rebecca Horn, Nils-Udo, Andy Goldsworthy, David Mach and Yayoi Kusama collaborated to create original artworks for each of the 11 songs on the multi-million-selling CD. Coulson and Bruce documented the process on Hi-8 video. Bruce left Real World and Coulson continued with the campaign, using the documentary background material as the basis for a promotional EPK, the long-form video All About Us and the interactive CD-ROM Xplora1."]}, {"page": "Found object", "response": ["* David Mach"]}, {"page": "Turner Prize", "response": ["Sculpture artist Tony Cragg is awarded the prize by Alan Yentob. Other nominees included figurative/portrait painter Lucian Freud, Pop artist Richard Hamilton, Richard Long, David Mach (graduate of Duncan of Jordanstone College of Art), printer Boyd Webb, sculptor Alison Wilding and Richard Wilson. The appointment of Tate Director, Nicholas Serota, led to many changes such as the introduction of an annual rehang of the Collection and giving priority to modern and contemporary art. During this period the future of the Prize was uncertain. The Turner Prize was modified to be an artist-only prize without a published shortlist and a solo exhibition was awarded to the winner, Tony Cragg."]}, {"page": "Darlington", "response": ["To commemorate the town's contribution to the railways, David Mach's 1997 work Train is located alongside the A66, close to the original Stockton–Darlington railway. It is a life-size brick sculpture of a steaming locomotive emerging from a tunnel, made from 185,000 Accrington Nori bricks. The work had a budget of £760,000."]}, {"page": "Galway International Arts Festival", "response": ["Visual artists who have exhibited have included David Hockney, Bill Viola, Henri Matisse, Patricia Piccinini, Hughie O'Donoghue, David Mach and John Gerrard."]}, {"page": "Red telephone box", "response": ["Scottish sculptor David Mach created the permanent public work Out of Order in 1989 in Kingston upon Thames, London. It takes the form of a row of twelve K6 telephone boxes, the first one upright, the others gradually falling over like dominoes. It was originally intended that the last upright box was to contain a working telephone.", "In 2012, BT helped celebrate the 25th anniversary of the free-phone charity ChildLine by commissioning eighty artists to design and decorate full-sized K6 replicas. These were displayed in public spaces across London and then auctioned by Sotheby's as BT Artboxes. Artists included Peter Blake, Willie Christie, David Mach, Denis Masi, Zaha Hadid and Ian Ritchie."]}, {"page": "K Foundation art award", "response": ["Defending Whiteread, Lord Palumbo told The Guardian that: \"Talent at the highest level attracts derision. We must let the artist fail.\" Scottish sculptor David Mach opined to Scotland on Sunday that \"They're just a bunch of silly buggers. It's good to see money going from a bunch of silly buggers to an artist who is going to make good use of it. What's that saying about a fool and his money...?\" John Bellany, on the other hand, said that \"The emotional, artistic side of [his] nature... admire[d] the audacity and imagination, challenging art and the art manipulators. The rational side of me asks, is this the most expensive art publicity stunt this century, and for whom?\""]}, {"page": "University of Dundee", "response": ["* David Mach , 1988 Turner Prize Nominee"]}, {"page": "Jack Vettriano", "response": ["In The Scotsman, George Kerevan wrote \"He suffers all the same criticisms of the early French Impressionists: mere wallpaper, too simplistic in execution and subject, too obviously erotic.\"\"Artists urge recognition for Vettriano\", The Scotsman, 25 October 2002 Alice Jones wrote in The Independent  that Vettriano has been labelled a chauvinist whose \"women are sexual objects, frequently half naked and vulnerable, always in stockings and stilettos.\" Regarding the criticism, sculptor David Mach has said: \"If he was a fashion designer Jack would be right up there. It’s all just art world snobbery. Anyway, who cares, he probably makes more money than Damien Hirst anyway.\""]}, {"page": "LNER Class A4 4468 Mallard", "response": ["* A brick sculpture of Mallard, known as the Brick Train and created by David Mach in 1997, can be found alongside the A66 road on the eastern outskirts of the town of Darlington, County Durham."]}, {"page": "Scottish National Portrait Gallery", "response": ["*Alex Ferguson by David Mach"]}, {"page": "Culture of Scotland", "response": ["In the eighteenth century Scotland began to produce artists that were significant internationally, all influenced by neoclassicism, such as Allan Ramsay, Gavin Hamilton, the brothers John and Alexander Runciman, Jacob More and David Allan.J. Wormald, Scotland: A History (Oxford: Oxford University Press, 2005), . Towards the end of the century Romanticism began to affect artistic production, and can be seen in the portraits of artists such as Henry Raeburn.D. Campbell, Edinburgh: A Cultural and Literary History (Oxford: Signal Books, 2003), , pp. 142–3. It also contributed to a tradition of Scottish landscape painting that focused on the Highlands, formulated by figures including Alexander Nasmyth.R. J. Hill, Picturing Scotland Through the Waverley Novels: Walter Scott and the Origins of the Victorian Illustrated Novel (Aldershot: Ashgate, 2010), , p. 104. The Royal Scottish Academy of Art was created in 1826,Whitaker's Concise Almanack 2012 (A&C Black, 2011), , p. 410. and major portrait painters of this period included Andrew Geddes and David Wilkie. William Dyce emerged as one of the most significant figures in art education in the United Kingdom.D. Macmillan, Scottish Art 1460–1990 (Edinburgh: Mainstream, 1990), , p. 348. The beginnings of a Celtic Revival can be seen in the late nineteenth centuryM. MacDonald, Scottish Art (London: Thames and Hudson, 2000), , p. 151. and the art scene was dominated by the work of the Glasgow BoysR. Billcliffe, The Glasgow Boys (London: Frances Lincoln, 2009), . and the Four, led Charles Rennie Mackintosh, who gained an international reputation for their combination of Celtic revival, Art and Crafts and Art Nouveau.S. Tschudi-Madsen, The Art Nouveau Style: a Comprehensive Guide (Mineola, NY: Courier Dover, 2002), , pp. 283–4. The early twentieth century was dominated by the Scottish Colourists and the Edinburgh School. They have been described as the first Scottish modern artists and were the major mechanism by which post-impressionism reached Scotland.I. Chilvers, ed., The Oxford Dictionary of Art and Artists (Oxford: Oxford University Press, 4th edn., 2009), , p. 575.\"The Edinburgh School\", Edinburgh Museums and Galleries, retrieved 10 April 2013. There was a growing interest in forms of Modernism, with William Johnstone helping to develop the concept of a Scottish Renaissance.  In the post-war period, major artists, including John Bellany and Alexander Moffat, pursued a strand of \"Scottish realism\".C. Richardson, Scottish Art Since 1960: Historical Reflections and Contemporary Overviews (Aldershot: Ashgate, 2011), , p. 58. Moffat's influence can be seen in the work of the \"new Glasgow Boys\" from the late twentieth century.D. Reid, The Rough Guide to Edinburgh (London: Rough Guides, 3rd edn., 2002), , p. 114. In the twenty-first century Scotland has continued to produce successful and influential such as Douglas Gordon, David Mach,P. Küppers, The Scar of Visibility: Medical Performances And Contemporary Art (Minneapolis, MN: University of Minnesota Press, 2007), , p. 61. Susan Philipsz and Richard Wright."]}, {"page": "Out of Order", "response": ["* Out of Order, an outdoor installation by Scottish artist David Mach located in Kingston upon Thames, southwest London, England"]}, {"page": "Opera Gallery", "response": ["Opera Gallery represents Ellen Von Unwerth,Opera Gallery London 2018 Exhibition in VogueOpera Gallery London 2018 Exhibition on the Times Manolo Valdés, André Brasilier, Nick Gentry, Lita Cabellut, Pablo Atchugarry, Marcello Lo Giudice, Andy Denzler, Joe Black, David Kim Whittaker, Seo Young-Deok, David Mach, and Umberto Mariani."]}, {"page": "Trains in art", "response": ["* Brick Train, by David Mach, 1997"]}, {"page": "Scottish art", "response": ["Since the 1990s, the most commercially successful artist has been Jack Vettriano (born 1951), whose work usually consists of figure compositions, with his most famous painting The Singing Butler (1992), often cited as the best selling print in Britain. However, he has received little acclaim from critics.Chilvers Oxford Dictionary of Art and Artists, p. 657. Contemporary artists emerging from Glasgow and Dundee include David Mach (born 1960), working in the medium of installation art,P. Küppers, The Scar of Visibility: Medical Performances and Contemporary Art (Minneapolis, MN: University of Minnesota Press, 2007), , p. 61. Richard Wright (born 1960), noted for his intricate wall paintings, James Lambie (born 1964) who specialises in colourful sculptural installationsC. Richardson, Scottish Art Since 1960: Historical Reflections and Contemporary Overviews (Aldershot: Ashgate, 2011), , p. 177. and Susan Philipsz (born 1965) who works in sound installations. A group that emerged from Glasgow in the early 1990s, and later described as \"The Irascibles\", includes Roderick Buchanan (born 1965), who works in installations, film and photography, Douglas Gordon (born 1966) working in video art, Christine Borland (1965), whose work focuses on forensic science, and sculptor Martin Boyce (born 1967).N. Mulholland, The Cultural Devolution: Art in Britain in the Late Twentieth Century (Aldershot: Ashgate, 2003) , p. 144. In the generation of more recent artists Lucy McKenzie's (born 1977) painting is often sexually explicit,S. Thornton, Seven Days in the Art World (Granta, 2012), . while Sandy Smith (born 1983) has produced installation art that combines video and landscape art.G. Wichert, \"The Object Moved by Its Own Success\", 15 Bytes, 17 October 2008. Retrieved 12 May 2013."]}, {"page": "Christian Furr", "response": ["In November 2012, Furr curated the art exhibition \"Liverpool Love\" at the new Museum of Liverpool in aid of Claire House Hospice. The exhibition included works by Yoko Ono, Sir Peter Blake David Mach and many respected artists from the art and music scene. In June 2011, Furr was commissioned to paint Blenheim Palace during GE Triathlon. The painting was bought by Jamie Blandford for public display at the Palace in 2014 when it was auctioned to raise funds for the Dame Kelly Holmes Trust by GE."]}, {"page": "Duncan of Jordanstone College of Art & Design", "response": ["* David Mach"]}, {"page": "Buckhaven High School", "response": ["*David Mach - sculptor"]}, {"page": "List of Turner Prize winners and nominees", "response": ["|Lucian FreudRichard HamiltonRichard LongDavid MachBoyd WebbAlison WildingRichard Wilson"]}, {"page": "Red Mansion Foundation", "response": ["For the inaugural programme in 2005, the Foundation invited seven Royal Academicians: John Bellany, Brendan Neiland, Paul Huxley, Christopher Orr, David Mach, Allen Jones and Ian McKeever. The resulting exhibition, \"Royal Academicians in China\", was shown at the National Art Museum of China in Beijing, at the Shanghai Art Museum and at the Royal Academy of Arts in London. Following the success of \"Royal Academicians in China\", The Red Mansion Foundation invited Catherine Kinley, former senior curator at Tate, to select a new group of eight artists to join the exchange programme 2006–2008: Tony Bevan, Rose Finn-Kelcey, Susan Hiller, Satch Hoyt, Lisa Milroy, Dennis Morris, Richard Wentworth and Paul Winstanley."]}, {"page": "Nick Gentry", "response": ["In the summer of 2018 Gentry created a rhino sculpture as part of the Tusk Rhino Trail. The project aimed to draw attention to the severe threat of poaching to the rhino. Each of the 21 rhinos were customised by artists such as Jonathan Yeo, David Mach and Marc Quinn. The works of art were put on public display at iconic London sites before being auctioned by Christie’s, raising funds for Tusk Trust conservation projects protecting rhino and other African species.", "In the summer of 2016 Gentry had his debut New York solo show at C24 Gallery. The exhibit, which marked his debut with the gallery, explored human connectedness, remembrance and nostalgia within the unrelenting, digitally oversaturated world of the present. The works, which mostly feature ethereal humanlike subjects, are constructed from sourced materials made by donors from around the globe that piece together a psychologically compelling narrative of human solidarity. In November and December Gentry's work was exhibited alongside a selection of rare works by Young British Artists Mark Quinn, Damien Hirst, and Tracey Emin at Opera Gallery in London. The show, titled 'BritARTnia' also presented the work of internationally established artists such as Julian Opie of the New British Sculpture movement; celebrity photographer and recipient of the Royal Photographic Society's Centenary medal Terry O'Neill (photographer) and Royal Academician and Turner Prize nominee sculptor David Mach."]}, {"page": "List of fellows of the Royal Society of Arts", "response": ["* David Mach"]}, {"page": "Tusk Trust", "response": ["Each rhino was specially designed, decorated and embellished by internationally renowned artists including Glen Baxter, Jake and Dinos Chapman, Eileen Cooper, Adam Dant, Nancy Fouts, Nick Gentry, Zhang Huan, Patrick Hughes, David Mach, Harland Miller, Marc Quinn, Axel Scheffler, Gavin Turk, Dave White, Ronnie Wood, David Yarrow and Jonathan Yeo."]}, {"page": "List of Scottish artists", "response": ["*David Mach (born 1956), sculptor and installation artist"]}, {"page": "Glenfiddich Spirit of Scotland Awards", "response": ["| David Mach "]}, {"page": "Art in modern Scotland", "response": ["Since the 1990s, the most commercially successful artist has been Jack Vettriano (b. 1959), whose work usually consists of figure compositions, with his most famous painting The Singing Butler (1992), often cited as the best selling print in Britain. However, he has received little acclaim from critics.Chilvers, The Oxford Dictionary of Art and Artists, p. 657. Contemporary artists emerging from Glasgow and Dundee include David Mach (b. 1960), working in the medium of installation art,P. Küppers, The Scar of Visibility: Medical Performances And Contemporary Art (Minneapolis, MN: University of Minnesota Press, 2007), , p. 61. Richard Wright (b. 1960), noted for his intricate wall paintings, Jim Lambie (b. 1965) who specialises in colourful sculptural installationsC. Richardson, Scottish Art Since 1960: Historical Reflections and Contemporary Overviews (Aldershot: Ashgate, 2011), , p. 177. and Susan Philipsz (b. 1965) who works in sound installations. A group that emerged from Glasgow School of Art in the early 1990s, and later described as \"The Irascibles\", includes Roderick Buchanan (b. 1965), who works in installations, film and photography, Douglas Gordon (b. 1966) working in video art, Christine Borland (1965), whose work focuses on forensic science, and sculptor Martin Boyce (b. 1967).N. Mulholland, The Cultural Devolution: Art in Britain in the Late Twentieth Century (Aldershot: Ashgate, 2003) , p. 144. In the generation of more recent artists Lucy McKenzie's (b. 1977) painting is often sexually explicit,S. Thornton, Seven Days in the Art World (Granta, 2012), . while Sandy Smith (b. 1983) has produced installation art that combines video and landscape art.G. Wichert, \"The Object Moved by Its Own Success\", 15 Bytes, 17 October 2008, retrieved 12 May 2013."]}, {"page": "Mach (surname)", "response": ["* David Mach (born 1956), Scottish artist"]}, {"page": "List of Royal Academicians", "response": ["| David Mach   ||align=\"center\" |  1998  || Professor of Sculpture 2000–2007"]}, {"page": "Sculpture in Scotland", "response": ["Ideas-based art began to dominate Scottish sculpture from the mid 1980s. A number of women sculptors, public artists and installation artists rose to prominence in what had been a male dominated area. These included Kirsty McGhie (b. 1959), Sybille von Halem (b. 1963) and Claire Barclay (b. 1968), all of whom were graduates of Environmental Art at Glasgow.A. Patrizio, Contemporary Sculpture in Scotland (Sydney: Craftsman House, 1999), , p. 13. Particularly significant were artists involved with the Transmission Gallery and Variant magazine in Glasgow. Of these Douglas Gordon went on to win the Turner Prize in 1996 and Christine Borland (b. 1965) was short-listed the following year. Contemporary sculptors that have emerged since the 1980s include David Mach (b. 1960), working in the mediums of sculpture and installation art. He has produced work including his Big Heids (1997), which provided a commentary on the declining iron industry.P. Küppers, The Scar of Visibility: Medical Performances And Contemporary Art (Minneapolis, MN: University of Minnesota Press, 2007), , p. 61. James Lambie (b. 1965) specialises in colourful sculptural installations.C. Richardson, Scottish Art Since 1960: Historical Reflections and Contemporary Overviews (Aldershot: Ashgate, 2011), , p. 177. Simon Starling's conceptual art includes Shedboatshed, which won the Turner Prize in 2003.R. Pooler, The Boundaries of Modern Art (Arena, 2013), , p. 67. In 2003, Lambing, Starling and Barclay were chosen to represent the newly devolved-Scotland at the Venice Biennale, marking the place of Scotland, and particularly Glasgow, as a hub of European art culture.C. Richardson, Scottish Art Since 1960: Historical Reflections and Contemporary Overviews (Aldershot: Ashgate, 2011), , pp. 165–6. A group that emerged from Glasgow School of Art in the early 1990s, and later described as \"The Irascibles\", included sculptor Martin Boyce (b. 1967),N. Mulholland, The Cultural Devolution: Art in Britain in the Late Twentieth Century (Aldershot: Ashgate, 2003), , p. 144. who won the Turner Prize in 2011 for his installation Do Words Have Voices."]}, {"page": "Kate Whiteford", "response": ["In 1990, she represented Great Britain at the Venice Biennale as part of Three Scottish Sculptors along with David Mach and Arthur Watson."]}, {"page": "List of alumni of the Royal College of Art", "response": ["* David Mach, 1988 Turner Prize nominee"]}, {"page": "Nichola Bruce", "response": ["Bruce collaborated with Coulson on many projects, including The Human Face with Laurie Andersen and the music video The Blood of Eden for Peter Gabriel featuring vocals by Sinead O'Connor. Nichola Bruce and Michael Coulson were employed as visual co-ordinators by Peter Gabriel's Real World working on a number of projects including an innovative approach to the marketing of the Us album, commissioning contemporary artists such as Helen Chadwick, Rebecca Horn, Nils-Udo, Andy Goldsworthy, David Mach and Yayoi Kusama to create original artworks for each of the 11 songs on the multi-million-selling CD. Coulson and Bruce also documented the process on Hi-8 video and film."]}, {"page": "John Christie (artist)", "response": ["As a director/cameraman his art-related TV programmes include Another Way of Telling, a BBC series on photography made in collaboration with John Berger and Jean Mohr; Salvage of Soho Photographer, a C4 documentary on John Deakin and First Hand, a series of seven films based on literary manuscripts from the British Library. As a lighting cameraman he filmed Ian Breakwell's Continuous Diary (C4), 40 Years of Modern Art (Tate), Ian Breakwell's Public Face/Private Eye (C4), David Mach - From Hill to Castle (BBC2), \"David Nash - At the Edge of the Forest (BBC Wales) and The Other Side Ian Breakwell's installation produced by Anna Ridley and shown at the De La Warr Pavilion and Tate Britain.", "* 1993- From Hill to Castle - David Mach, BBC 2, Lighting Cameraman "]}]}}