{"wiki_id": "http://www.wikidata.org/entity/Q2150276", "itemLabel": "Richard Neville Lester", "itemDescription": "British botanist (1937-2006)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Neville_Lester", "wikipedia_page": {"main": "Richard Neville Lester (13 June 1937 – 4 April 2006) was an English botanist and chemotaxonomist.\n\nAn English botanist born in Birmingham. He was a student and later (1958) research assistant of Jack Hawkes and took part in potato collecting expeditions to Central America and Mexico. He obtained his PhD in 1962 for his thesis \"Immunochemical studies of the genus Solanum\", he continued work on the immunotaxonomy of plants, as well as fungi and bats, at the University of Texas at Austin (until 1964), and then at the University of Kansas (1966-1968). He taught (1964-1966) at Bolton Institute of Technology. He spent a year (1968-1969) in Uganda as a lecturer in botany at Makerere University, where he developed his life long interest in the African eggplant, Solanum melongena.From 1969 he was lecturer at the University of Birmingham, teaching the course for the M.Sc. in 'Conservation and Utilization of Plant Genetic Resources'. While at Birmingham he took part in collecting trips to African for additions to the Birmingham Solanaceae collection.\nHe has published over 135 articles, mostly on the Solanaceae. Together with J.G. Hawkes and A.D. Skelding he organised in 1976 the first International Solanaceae Conference. He contributed to and edited (1977-1979) the Solanaceae Newsletter and was coordinator (1993-1996) of the European Solanaceae Information Network (ESIN). In 1980, together with his student Peter Jaeger, he started a taxonomic revision of all African Solanum species, which remained incomplete at the time of his death.He retired in 2000 and was later diagnosed with a life-threatening cancer; he died in Birmingham on 4 April 2006. He remained active in retirement and worked (2000-2005) as coordinator of EGGNET  where he oversaw the transfer of the endangered Solanaceae collection at Birmingham to Nijmegen Botanical Garden, INRA Montfavet, and Valencia Polytechnic University. He also completed a conspectus of Solanum with co-author Alan Child.The species Solanum lesteri Hawkes & Hjerting is named after him.He married Celia Davidson in 1972 and had two children, John and Clare.", "link_mentions": [{"page": "Lester", "response": ["* Richard Neville Lester (1937–2006), British botanist"]}, {"page": "List of botanists by author abbreviation (K–L)", "response": ["* Lester – Richard Neville Lester ((1937-2006)"]}, {"page": "Richard Lester (disambiguation)", "response": ["* Richard Neville Lester, English botanist and chemotaxonomist"]}]}}