{"wiki_id": "http://www.wikidata.org/entity/Q2152996", "itemLabel": "Jennie Fletcher", "itemDescription": "British swimmer, Olympic gold medallist, former world record-holder", "wikipedia_url": "https://en.wikipedia.org/wiki/Jennie_Fletcher", "wikipedia_page": {"main": "Jennie Fletcher (19 March 1890 – 17 January 1968), later known by her married name Jennie Hyslop, was a British competitive swimmer, Olympic gold medallist, and former world record-holder.  In 1905 she set a new world record in the 100-yard freestyle that stood for seven years. She was selected for the 1908 Olympics, but the women's swimming events were cancelled due to a shortage of participants.  At the 1912 Summer Olympics, she won a gold medal in the 4×100-metre freestyle relay and a bronze medal in the individual 100-metre freestyle race.  In 1971 she was inducted to the International Swimming Hall of Fame as an \"Honor Swimmer\".Fletcher was born in an underprivileged family of 11 siblings and had to combine swimming with daily 12-hour work.  In 1913 she began teaching swimming in Leicester, which ended her competitive career as she turned from an amateur into a professional. In 1917, she married and immigrated to Canada, where she gave birth to a daughter and five sons.", "link_mentions": [{"page": "1912 Summer Olympics", "response": ["The 1912 Games saw the implementation of swimming events for women, with the 100 metre freestyle and 400 metre team relay taking place. Fanny Durack won the individual contest, breaking the world record for the distance in the fourth heat. Her fellow Australian Mina Wylie won the silver medal, and Jennie Fletcher of Great Britain came third to take the bronze medal.Official Report (1913): p. 726. The British team had further success in the women's relay, winning the team relay with the German team in second place and the Austrian team in third. Because only four countries entered the relay there were no heats; only a final was held. The United States did not field a women's team. Eight years later in Antwerp the American women would compete for the first time and sweep 7 out of 7 available medals. In 1924, the United States would enter the largest women's team of any nation.Official Report (1913): p. 727.  New Olympic Records were set in all swimming events at the 1912 Games.Official Report (1913): p. 851."]}, {"page": "Belgrave, Leicester", "response": ["*Jennie Fletcher - British competitive swimmer, Olympic gold medallist  and former world record holder - born in Belgrave."]}, {"page": "Swimming at the 1912 Summer Olympics", "response": ["| Belle MooreJennie FletcherAnnie SpeirsIrene Steer"]}, {"page": "List of Olympic medalists in swimming (women)", "response": ["|valign=top|Belle MooreJennie FletcherAnnie SpeirsIrene Steer"]}, {"page": "Teeswater, Ontario", "response": ["* Jennie Fletcher - a swimmer who moved to Teeswater after winning gold for Britain in swimming at the 1912 Olympics"]}, {"page": "Great Britain at the 1912 Summer Olympics", "response": ["| Jennie Fletcher", "| Jennie Fletcher  Belle Moore  Annie Speirs  Irene Steer"]}, {"page": "Belle Moore", "response": ["At the 1912 Summer Olympics in Stockholm, Sweden, Moore won a gold medal as a member of the first-place British women's team in the 4×100-metre freestyle relay, together with teammates Jennie Fletcher, Annie Speirs and Irene Steer.Sports-Reference.com, Olympic Sports, Athletes,  Isabella Moore.  Retrieved 2 June 2015.Maggie Barry, ' Forgotten Olympic Golden Girl Belle Moore Remembered 100 Years After Landmark Win\", Daily Record (29 April 2012).  Retrieved 2 June 2015.  The British women set a new world record in the event of 5:52.8, beating the German and Austrian women's relay teams by a wide margin.Sports-Reference.com, Olympic Sports, Swimming at the 1912 Stockholm Summer Games,  Women's 4 × 100 metres Freestyle Relay .  Retrieved 2 June 2015.  Swedish King Gustav V presented Moore and her teammates with their gold medals and Olympic laurels.International Swimming Hall of Fame, Honourees,  Belle Moore (GBR).  Retrieved 2 June 2015."]}]}}