{"wiki_id": "http://www.wikidata.org/entity/Q21503650", "itemLabel": "Alexander Hamilton", "itemDescription": "Scottish physician and obstetrician", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Hamilton_(Scottish_physician)", "wikipedia_page": {"main": "Alexander Hamilton FRSE FRCSE FRCPE (1739–1802) was a Scottish physician. He was a co-founder of the Royal Society of Edinburgh in 1783. He was one of the first persons to recognise that puerperal fever was infectious. He was professor of midwifery at the University of Edinburgh.\n\n", "link_mentions": [{"page": "Scottish Enlightenment", "response": ["The growth of a musical culture in the capital was marked by the incorporation of the Musical Society of Edinburgh in 1728.E. G. Breslaw, Doctor Alexander Hamilton and Provincial America (Louisiana State University Press, 2008), , p. 41. Scottish composers known to be active in this period include: Alexander Munro (fl. c. 1732), James Foulis (1710–73) and Charles McLean (fl. c. 1737).J. R. Baxter, \"Culture, Enlightenment (1660-1843): music\", in M. Lynch, ed., The Oxford Companion to Scottish History (Oxford: Oxford University Press, 2001), , pp. 140–41. Thomas Erskine, 6th Earl of Kellie (1732–81) was one of the most important British composers of his era, and the first Scot known to have produced a symphony.N. Wilson, Edinburgh (Lonely Planet, 3rd edn., 2004), , p. 33. In the mid-eighteenth century, a group of Scottish composers began to respond to Allan Ramsey's call to \"own and refine\" their own musical tradition, creating what James Johnson has characterised as the \"Scots drawing room style\", taking primarily Lowland Scottish tunes and adding simple figured basslines and other features from Italian music that made them acceptable to a middle-class audience. It gained momentum when major Scottish composers like James Oswald (1710–69) and William McGibbon (1690–1756) became involved around 1740. Oswald's Curious Collection of Scottish Songs (1740) was one of the first to include Gaelic tunes alongside Lowland ones, setting a fashion common by the middle of the century and helping to create a unified Scottish musical identity. However, with changing fashions there was a decline in the publication of collections of specifically Scottish collections of tunes, in favour of their incorporation into British collections.M. Gelbart, The Invention of \"Folk Music\" and \"Art Music\" (Cambridge: Cambridge University Press), , p. 30.", "* Alexander Hamilton (1739–1802) physician "]}, {"page": "Fordoun", "response": ["* Alexander Hamilton (1739-1802) co-founder of the Royal Society of Edinburgh, one of the first doctors to recognise the infectious nature of puerperal fever."]}, {"page": "St Cuthbert's Church, Edinburgh", "response": ["* Alexander Hamilton (Scottish physician) FRSE (1739–1802) and his son James Hamilton (Scottish physician) FRSE (1767–1839) both Professors of Medicine and Midwifery at Edinburgh University"]}, {"page": "Alexander Hamilton (disambiguation)", "response": ["Alexander Hamilton (1755 or 1757–1804) was the first Secretary of the Treasury and one of the Founding Fathers of the United States of America. ", "Alexander Hamilton may also refer to:", "* Alexander Hamilton (sailor) (before 1688–after 1733), Scottish sea captain, commander of the Bombay Marine", "* Alexander Hamilton (of Ballincrieff) (1684–1763), Scottish politician, MP for Linlithgowshire 1727–1741", "* Alexander Hamilton (died 1768), Irish MP for Killyleagh", "* Alexander Hamilton (died 1809), Irish MP for Ratoath, Carrickfergus and Belfast", "* Alexander Hamilton (British Army officer) (1765–1838), British soldier of the Napoleonic Wars", "* Alexander Hamilton, 10th Duke of Hamilton (1767–1852), Scottish politician", "* Alexander Hamilton Jr. (1786–1875), American colonel and New York City lawyer, son of founding father Alexander Hamilton", "* Alexander Hamilton (general) (1815–1907), American Civil War general, grandson of founding father Alexander Hamilton", "* Alexander Hamilton (Australian politician) (1816–1869), member of the New South Wales Legislative Assembly", "* Alexander Hamilton Jr. (1816–1889), New York City lawyer, Civil War aide-de-camp, grandson of founding father", "* Alexander Hamilton (Maryland doctor) (1712–1756), Scottish-born doctor and writer in colonial Maryland", "* Alexander Hamilton (Scottish physician) (1739–1802), co-founder of the Royal Society of Edinburgh", "* Alexander Hamilton (linguist) (1762–1824), Sanskrit scholar", "* Alexander Hamilton (footballer, born 1865) (1865–?), Scottish footballer", "* Alexander Hamilton (priest) (1847–1928), American Episcopalian priest, great-grandson of founding father", "* Alexander Hamilton (Virginia lawyer) (1851–1916), lawyer and railroad executive", "* Alexander Hamilton (bishop) (1915–2001), Bishop of Jarrow in the Church of England", "* PS Alexander Hamilton, a steamboat built for the Hudson River Day Line in 1924", "* USCGC Alexander Hamilton (WPG-34), a U.S. Coast Guard cutter commissioned in 1937", "* USS Alexander Hamilton, a list of ships", "* Alexander Hamilton (Ceracchi), a 1794 marble bust by Giuseppe Ceracchi", "* Alexander Hamilton (Trumbull), a 1792 painting by John Trumbull", "* Statue of Alexander Hamilton (Central Park), an 1880 granite statue by Carl Conrads", "* Statue of Alexander Hamilton (Columbia University), a 1908 sculpture by William Ordway Partridge", "* Statue of Alexander Hamilton (Washington, D.C.), a 1923 bronze statue by James Earle Fraser", "* Alexander Hamilton (book), a 2004 book by Ron Chernow", "* Alexander Hamilton (film), a 1931 film biography", "* \"Alexander Hamilton\" (song), a song from the 2015 musical Hamilton", "* Alexander Hamilton-Gordon (British Army officer, born 1817) (1817–1890), soldier and MP", "* Alexander Hamilton-Gordon (British Army officer, born 1859) (1859–1939), soldier, son of the above", "* Alexander Hamilton High School (disambiguation)"]}, {"page": "Henry Hamilton (priest)", "response": ["He was born at Blandfield House, between Edinburgh and Leith, the son of Alexander Hamilton, Professor of Midwifery at Edinburgh University. He was educated at Edinburgh University and Trinity College, Cambridge, graduating BA in 1816 and MA in 1819."]}, {"page": "List of presidents of the Royal College of Surgeons of Edinburgh", "response": ["*1776–78 Alexander Hamilton"]}, {"page": "John Drummond of Jamaica", "response": ["Drummond appears to have made frequent returns to Britain, and seems to have had families in each country. He was elected a Fellow of the Royal Society of Edinburgh in 1789. His proposers were William Wright, James Gregory, and Prof Alexander Hamilton. His contribution to the Society (which usually then required a degree of public speaking and presentation to other Fellows) is not clear."]}, {"page": "James Hamilton (physician)", "response": ["He was born in Edinburgh in 1767, the son of Dr Alexander Hamilton. He attended the High School in Edinburgh, and then studied medicine at the University of Edinburgh (in part under his father). He also studied at Paris, Leiden and the University of St Andrews receiving his MD from the latter in 1792. In 1800, he succeeded his father as professor of midwifery at the University of Edinburgh."]}, {"page": "Bartholomew Parr", "response": ["In 1789 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Alexander Hamilton, James Hutton and Andrew Duncan, the elder. In 1797 he was also elected a Fellow of the Royal Society of London."]}, {"page": "Margaret Bethune", "response": ["In order to provide for her young children and elderly mother, the widowed Bethune moved from Largo to Edinburgh in 1852, to seek midwifery training. She purchased a copy of Alexander Hamilton's Concise Rules for the Conduct of Midwives in the Exercise of their Profession, published in 1793, and gained a ticket to work on the wards at a maternity hospital in Edinburgh. "]}]}}