{"wiki_id": "http://www.wikidata.org/entity/Q21537324", "itemLabel": "Richard Hooper", "itemDescription": "Australian miner, trade unionist and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Hooper_(Australian_politician)", "wikipedia_page": {"main": "Richard Hooper (25 January 1846 – 24 July 1909) was an Australian politician who represented the South Australian House of Assembly multi-member seat of Wallaroo from 1891 to 1902.Hooper was born in Cornwall in England and arrived in South Australia in 1858. He was a miner at Moonta, and became president of the Moonta Amalgamated Miners' Association in 1889. Hooper was the first Labor member of the South Australian House of Assembly, but was not a member of the newly formed United Labor Party, instead serving as an Independent Labor member. He was first elected at the 1891 Wallaroo by-election on 23 May. He was re-elected as an Independent Labor member in 1893, 1896 and 1899; although he attended caucus meetings he never joined the United Labor Party. After his parliamentary career, he moved to Western Australia, where he worked as a nightwatchman and was active in the Labor Party there.\n\n", "link_mentions": [{"page": "Australian Labor Party", "response": ["The first election contested by Labour candidates was the 1891 New South Wales election, when Labour candidates (then called the Labor Electoral League of New South Wales) won 35 of 141 seats. The major parties were the Protectionist and Free Trade parties and Labour held the balance of power. It offered parliamentary support in exchange for policy concessions. The United Labor Party (ULP) of South Australia was founded in 1891, and three candidates were that year elected to the South Australian Legislative Council. The first successful South Australian House of Assembly candidate was John McPherson at the 1892 East Adelaide by-election. Richard Hooper however was elected as an Independent Labor candidate at the 1891 Wallaroo by-election, while he was the first \"labor\" member of the House of Assembly he was not a member of the newly formed ULP."]}, {"page": "John McPherson", "response": ["A UTLC meeting with the purpose of creating an elections committee was convened on 12 December 1890, and held on 7 January 1891. The elections committee was formed, officially named the United Labor Party of South Australia with McPherson the founding secretary. Later that year, Labor enjoyed immediate success, electing David Charleston, Robert Guthrie and Andrew Kirkpatrick to the South Australian Legislative Council. A week later, Richard Hooper won the 1891 Wallaroo by-election as an Independent Labor member in the South Australian House of Assembly. McPherson won the 1892 East Adelaide by-election on 23 January, becoming the first official Labor member of the House of Assembly at the age of 32. McPherson held the seat of East Adelaide until his death."]}, {"page": "1893 South Australian colonial election", "response": ["A United Trades and Labor Council meeting with the purpose of creating an elections committee was convened on 12 December 1890, and held on 7 January 1891. The elections committee was formed, officially named the United Labor Party of South Australia with McPherson the founding secretary. Later that year, the ULP enjoyed immediate success, electing David Charleston, Robert Guthrie and Andrew Kirkpatrick to the South Australian Legislative Council. A week later, Richard Hooper won the 1891 Wallaroo by-election as an Independent Labor member in the South Australian House of Assembly. McPherson won the 1892 East Adelaide by-election on 23 January, becoming the first official Labor leader and member of the House of Assembly. At the 1893 election, ten Labor candidates including McPherson and Hooper were elected to the 54-member House of Assembly which gave the ULP the balance of power. So successful, a decade later at the 1905 election, Thomas Price would form the world's first stable Labor government. John Verran led Labor to form the state's first of many majority governments at the 1910 election."]}, {"page": "1892 East Adelaide colonial by-election", "response": ["Successful 1891 Wallaroo by-election candidate Richard Hooper was the first Labor member of the House of Assembly, but was not a member of the newly formed United Labor Party (ULP), instead serving as an Independent Labor member. Although he attended caucus meetings he never joined the ULP. The 1892 East Adelaide by-election saw ULP candidate John McPherson win the seat. It was the first time the ULP had won a seat in the House of Assembly, with electoral success to be followed at the 1893 colonial election, winning 10 of 54 seats and the balance of power, allowing the ULP to support the liberal opposition led by Charles Kingston in defeating the conservative government led by John Downer."]}, {"page": "List of South Australian House of Assembly by-elections", "response": ["|Richard Hooper"]}, {"page": "Richard Hooper", "response": ["Richard Hooper may refer to:", "*Richard Hooper (MP), Member of Parliament (MP) for Plymouth", "*Richard Hooper (Australian politician) (1846–1909), South Australian state MP", "*Richard Hooper (civil servant), former UK civil servant", "*Richard Hooper (umpire) (born 1976), New Zealand cricket umpire"]}, {"page": "Electoral district of Wallaroo", "response": ["Successful 1891 Wallaroo by-election candidate Richard Hooper was the first Labor member of the House of Assembly, but was not a member of the newly formed United Labor Party (ULP), instead serving as an Independent Labor member. The 1892 East Adelaide by-election saw ULP candidate John McPherson win the seat. It was the first time the ULP had won a seat in the House of Assembly, with electoral success to be followed at the 1893 colonial election, winning 10 of 54 seats and the balance of power, allowing the ULP to support the liberal opposition led by Charles Kingston in defeating the conservative government led by John Downer.", "| rowspan=2|Richard Hooper"]}, {"page": "Electoral district of East Adelaide", "response": ["Successful 1891 Wallaroo by-election candidate Richard Hooper was the first Labor member of the House of Assembly, but was not a member of the newly formed United Labor Party (ULP), instead serving as an Independent Labor member. The 1892 East Adelaide by-election saw ULP candidate John McPherson win the seat. It was the first time the ULP had won a seat in the House of Assembly, with electoral success to be followed at the 1893 colonial election, winning 10 of 54 seats and the balance of power, allowing the ULP to support the liberal opposition led by Charles Kingston in defeating the conservative government led by John Downer."]}, {"page": "Members of the South Australian House of Assembly, 1899–1902", "response": ["|| Richard Hooper || Labor || Wallaroo || 1891–1902"]}, {"page": "Members of the South Australian House of Assembly, 1896–1899", "response": ["|| Richard Hooper || Labor || Wallaroo || 1891–1902"]}, {"page": "Members of the South Australian House of Assembly, 1893–1896", "response": ["|| Richard Hooper || Labor || Wallaroo || 1891–1902"]}, {"page": "Members of the South Australian House of Assembly, 1890–1893", "response": ["|| Richard Hooper  || Labor || Wallaroo || 1891–1902", ": Wallaroo MHA David Bews died on 24 February 1891. Independent Labor candidate Richard Hooper won the resulting by-election on 23 May."]}, {"page": "1891 Wallaroo colonial by-election", "response": ["Successful candidate Richard Hooper was the first Labor member of the House of Assembly, but was not a member of the newly formed United Labor Party (ULP), instead serving as an Independent Labor member. Although he attended caucus meetings he never joined the ULP. The 1892 East Adelaide by-election saw ULP candidate John McPherson win the seat. It was the first time the ULP had won a seat in the House of Assembly, with electoral success to be followed at the 1893 colonial election, winning 10 of 54 seats and the balance of power, allowing the ULP to support the liberal opposition led by Charles Kingston in defeating the conservative government led by John Downer."]}, {"page": "Australian Labor Party (South Australian Branch)", "response": ["A United Trades and Labor Council meeting with the purpose of creating an elections committee was convened on 12 December 1890, and held on 7 January 1891. The elections committee was formed, officially named the United Labor Party of South Australia (unlike state Labor, prior to 1912 their federal counterparts included the 'u' in their spelling of Labour) with John McPherson the founding secretary. Four months later, Labor enjoyed immediate success, electing David Charleston, Robert Guthrie and Andrew Kirkpatrick to the South Australian Legislative Council. A week later, Richard Hooper won the 1891 Wallaroo by-election as an Independent Labor member in the South Australian House of Assembly. McPherson won the 1892 East Adelaide by-election on 23 January, becoming the first official Labor leader and member of the House of Assembly."]}]}}