{"wiki_id": "http://www.wikidata.org/entity/Q215919", "itemLabel": "Frank Auerbach", "itemDescription": "(1931 -) British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Auerbach", "wikipedia_page": {"main": "Frank Helmut Auerbach (born 29 April 1931) is a German-British painter. Born in Germany, he has been a naturalised British subject since 1947.", "link_mentions": [{"page": "April 29", "response": ["*1931 – Frank Auerbach, British-German painter"]}, {"page": "David Bowie", "response": ["In 1998, during an interview with Michael Kimmelman for The New York Times, he said \"Art was, seriously, the only thing I'd ever wanted to own.\" Subsequently, in a 1999 interview for the BBC, he said \"The only thing I buy obsessively and addictively is art\". His art collection, which included works by Damien Hirst, Derek Boshier, Frank Auerbach, Henry Moore, and Jean-Michel Basquiat among others, was valued at over £10m in mid-2016."]}, {"page": "History of painting", "response": ["While throughout the 20th century many painters continued to practice landscape and figurative painting with contemporary subjects and solid technique, like Milton Avery, John D. Graham, Fairfield Porter, Edward Hopper, Balthus, Francis Bacon, Nicolas de Staël, Andrew Wyeth, Lucian Freud, Frank Auerbach, Philip Pearlstein, David Park, Nathan Oliveira, David Hockney, Malcolm Morley, Richard Estes, Ralph Goings, Audrey Flack, Chuck Close, Susan Rothenberg, Eric Fischl, Vija Celmins and Richard Diebenkorn.", "During the 1930s through the 1960s abstract painting in America and Europe evolved into movements such as abstract expressionism, Color Field painting, Post painterly abstraction, Op art, hard-edge painting, Minimal art, shaped canvas painting, and Lyrical Abstraction. Other artists reacted as a response to the tendency toward abstraction, allowing figurative imagery to continue through various new contexts like the Bay Area Figurative Movement in the 1950s and new forms of expressionism from the 1940s through the 1960s. In Italy during this time, Giorgio Morandi was the foremost still life painter, exploring a wide variety of approaches to depicting everyday bottles and kitchen implements.David Piper, p. 635 Throughout the 20th century many painters practiced Realism and used expressive imagery; practicing landscape and figurative painting with contemporary subjects and solid technique, and unique expressivity like still-life painter Giorgio Morandi, Milton Avery, John D. Graham, Fairfield Porter, Edward Hopper, Andrew Wyeth, Balthus, Francis Bacon, Leon Kossoff, Frank Auerbach, Lucian Freud, Philip Pearlstein, Willem de Kooning, Arshile Gorky, Grace Hartigan, Robert De Niro, Sr., Elaine de Kooning and others. Along with Henri Matisse, Pablo Picasso, Pierre Bonnard, Georges Braque, and other 20th-century masters. In particular Milton Avery through his use of color and his interest in seascape and landscape paintings connected with the Color field aspect of Abstract expressionism as manifested by Adolph Gottlieb and Mark Rothko as well as the lessons American painters took from the work of Henri Matisse.", "During the 1950s and 1960s as abstract painting in America and Europe evolved into movements such as Color Field painting, post-painterly abstraction, op art, hard-edge painting, minimal art, shaped canvas painting, Lyrical Abstraction, and the continuation of Abstract expressionism. Other artists reacted as a response to the tendency toward abstraction with art brut,Jean Dubuffet: L'Art brut préféré aux arts culturels [1949] (in English: Art brut. Madness and Marginalia, special issue of Art & Text, No. 27, 1987, p. 31-33) as seen in Court les rues, 1962, by Jean Dubuffet, fluxus, neo-Dada, New Realism, allowing imagery to re-emerge through various new contexts like pop art, the Bay Area Figurative Movement (a prime example is Diebenkorn's Cityscape I, (Landscape No. 1), 1963, Oil on canvas, 60 1/4 x 50 1/2 inches, collection: San Francisco Museum of Modern Art) and later in the 1970s Neo-expressionism. The Bay Area Figurative Movement of whom David Park, Elmer Bischoff, Nathan Oliveira and Richard Diebenkorn whose painting Cityscape 1, 1963 is a typical example were influential members flourished during the 1950s and 1960s in California. Although throughout the 20th century painters continued to practice Realism and use imagery, practicing landscape and figurative painting with contemporary subjects and solid technique, and unique expressivity like Milton Avery, Edward Hopper, Jean Dubuffet, Francis Bacon, Frank Auerbach, Lucian Freud, Philip Pearlstein, and others. Younger painters practiced the use of imagery in new and radical ways. Yves Klein, Martial Raysse, Niki de Saint Phalle, Wolf Vostell, David Hockney, Alex Katz, Malcolm Morley, Ralph Goings, Audrey Flack, Richard Estes, Chuck Close, Susan Rothenberg, Eric Fischl, John Baeder and Vija Celmins were a few who became prominent between the 1960s and the 1980s. Fairfield Porter was largely self-taught, and produced representational work in the midst of the Abstract Expressionist movement. His subjects were primarily landscapes, domestic interiors and portraits of family, friends and fellow artists, many of them affiliated with the New York School of writers, including John Ashbery, Frank O'Hara, and James Schuyler. Many of his paintings were set in or around the family summer house on Great Spruce Head Island, Maine.", "Neo-expressionism was a style of modern painting that became popular in the late 1970s and dominated the art market until the mid-1980s. It developed in Europe as a reaction against the conceptual and minimalistic art of the 1960s and 1970s. Neo-expressionists returned to portraying recognizable objects, such as the human body (although sometimes in a virtually abstract manner), in a rough and violently emotional way using vivid colours and banal colour harmonies. The veteran painters Philip Guston, Frank Auerbach, Leon Kossoff, Gerhard Richter, A. R. Penck and Georg Baselitz, along with slightly younger artists like Anselm Kiefer, Eric Fischl, Susan Rothenberg, Francesco Clemente, Jean-Michel Basquiat, Julian Schnabel, Keith Haring, and many others became known for working in this intense expressionist vein of painting."]}, {"page": "Kent", "response": ["A number of significant artists came from Kent, including Thomas Sidney Cooper, a painter of landscapes, often incorporating farm animals,Edward Strachan and Roy Bolton, Russia & Europe in the Nineteenth Century (London: Sphinx Fine Art, 2008 ) p. 46. Richard Dadd, a maker of faery paintings, and Mary Tourtel, the creator of the children's book character, Rupert Bear. The artist Clive Head was also born in Kent. The landscape painter J. M. W. Turner spent part of his childhood in the town of Margate in East Kent, and regularly returned to visit it throughout his life. The East Kent coast inspired many of his works, including some of his most famous seascapes. Kent has also been the home to artists including Frank Auerbach, Tracey Emin and Stass Paraskos."]}, {"page": "Modernism", "response": ["The \"London School\" of figurative painters, including Francis Bacon (1909–1992), Lucian Freud (1922–2011), Frank Auerbach (born 1931), Leon Kossoff (born 1926), and Michael Andrews (1928–1995), have received widespread international recognition.Walker, 219–225"]}, {"page": "1931", "response": ["** Frank Auerbach, German-born painter"]}, {"page": "Soho", "response": ["Dean Street was built in the 1680s and was originally settled by French immigrants. It is home to the Soho Theatre, and a pub known as The French House which during World War II was popular with the French Government-in-exile. Karl Marx lived at No. 64 Dean Street around 1850. The Colony Club was founded by Muriel Belcher and based at No. 41 Dean Street from 1948 to 2008. It was frequented by several important artists including Francis Bacon, Lucian Freud and Frank Auerbach."]}, {"page": "Raphael", "response": ["Other pupils or assistants include Raffaellino del Colle, Andrea Sabbatini, Bartolommeo Ramenghi, Pellegrino Aretusi, Vincenzo Tamagni, Battista Dossi, Tommaso Vincidor, Timoteo Viti (the Urbino painter), and the sculptor and architect Lorenzetto (Giulio's brother-in-law).The direct transmission of training can be traced to some surprising figures, including Brian Eno, Tom Phillips and Frank Auerbach The printmakers and architects in Raphael's circle are discussed below. It has been claimed the Flemish Bernard van Orley worked for Raphael for a time, and Luca Penni, brother of Gianfrancesco and later a member of the First School of Fontainebleau, may have been a member of the team.Vasari (full text in Italian) pp. 197–98 & passim ; see also Getty Union Artist Name List  entries"]}, {"page": "Expressionism", "response": ["*United Kingdom: Francis Bacon, Frank Auerbach, Leon Kossoff, Lucian Freud, Patrick Heron, John Hoyland, Howard Hodgkin, John Walker"]}, {"page": "Walter Sickert", "response": ["Nonetheless, Sickert's paintings of the Camden Town Murder series of c. 1906–1909 were painted in heavy impasto and narrow tonal range, as were numerous other obese nudes in the pre-World War I period in which the fleshiness of the figures is connected to the thickness of the paint—a device that was later adapted by Lucian Freud. The influence of these paintings on successive generations of British artists has been noted in the works of Freud, David Bomberg, Francis Bacon, Frank Auerbach, Howard Hodgkin, and Leon Kossoff.Baron et al. 1992, p. 6.", "Sickert insisted on the importance of subject matter in art, saying that \"all the greater draughtsmen tell a story\", but treated his subjects in a detached manner. Max Kozloff wrote: \"How not to say too much seems to have become a matter of utmost laborious concern for Sickert\", as evidenced by his paintings' studied lack of finish and \"neurasthenic sobriety\" of color.Kozloff, Max (April 1967). \"Sickert's Unsentimental Journey\". Art News.  pp. 51–53, 71–72 According to the painter Frank Auerbach, \"Sickert's detachment became increasingly evident in his uninhibited procedures. He made obvious his frequent reliance on snapshots and press photographs, he copied, used and took over the work of other, dead, artists and made extensive use, also, of the services of his assistants who played a large and increasing part in the production of his work.\"Sickert et al. 1981, p. 7."]}, {"page": "Last Tango in Paris", "response": ["thumb|right|upright=0.9|Double Portrait of Lucian Freud and Frank Auerbach (left side, oil on canvas, 1964) thumb|right|upright=0.9|Study for a Portrait of Isabel Rawsthorne (oil on canvas, 1964)", "The film's opening credits include two paintings by Francis Bacon: Double Portrait of Lucian Freud and Frank Auerbach and Study for a Portrait of Isabel Rawsthorne. The hues used in the film were inspired by the paintings of Bacon. During pre-production, Bertolucci frequently visited an exhibit of Bacon's paintings at the Grand Palais in Paris; he said that the light and colour in Bacon's paintings reminded him of Paris in the winter, when"]}, {"page": "Modern art", "response": ["* Postwar European figurative painting – Lucian Freud, Francis Bacon, Frank Auerbach, Gerhard Richter"]}, {"page": "Impasto", "response": ["The impasto technique serves several purposes. First, it makes the light reflect in a particular way, giving the artist additional control over the play of light in the painting. Second, it can add expressiveness to the painting, with the viewer being able to notice the strength and speed by which the artist applied the paint. Third, impasto can push a piece from a painting to a three-dimensional sculptural rendering.  The first objective was originally sought by masters such as Rembrandt, Titian, and Vermeer, to represent folds in clothes or jewels: it was then juxtaposed with a more delicate painting style. Much later, the French Impressionists created pieces covering entire canvases with rich impasto textures. Vincent van Gogh used it frequently for aesthetics and expression. Abstract expressionists such as Hans Hofmann and Willem de Kooning also made extensive use of it, motivated in part by a desire to create paintings which dramatically record the action of painting itself. Still more recently, Frank Auerbach has used such heavy impasto that some of his paintings become nearly three-dimensional.", "* Tate Britain Gallery, London. Frank Auerbach, Bacchus & Ariadne."]}, {"page": "David Bomberg", "response": ["From 1945 to 1953, he worked as a teacher at Borough Polytechnic (now London South Bank University) in London, where his pupils included Frank Auerbach, Leon Kossoff, Philip Holmes, Philip Holmes' website] Cliff Holden, Edna Mann, Dorothy Mead, Gustav Metzger, Dennis Creffield, Cecil Bailey, and Miles Richmond.Miles Richmond's website   David Bomberg House, one of the student halls of residences at London South Bank University, is named in his honour. He was married to landscape painter Lilian Holt."]}, {"page": "Malcolm Morley", "response": ["As a teenager, Morley was sentenced to three years at Wormwood Scrubs prison for housebreaking and petty theft. While there, he read Irving Stone's 1934 novel Lust for Life, based on the life of Vincent van Gogh, and enrolled in an art correspondence course. He would later look back on these rough beginnings with some humor: \"I [feel] very sorry for artists that haven't had much happen in their early life,\" he once said. Released after two years for good behavior, he joined an artists' colony in St. Ives, Cornwall, then studied art first at the Camberwell School of Arts, described by one art historian as being, at the time, \"one of the more progressive and exciting art schools in London,\" and then at the Royal College of Art (1955–1957), where his fellow students included Peter Blake and Frank Auerbach. In 1956, he saw the exhibition \"Modern Art in the United States: A Selection from the Collections at the Museum of Modern Art\" at the Tate Gallery, and began to produce paintings in an abstract expressionist style. All the same, he would later say that \"I would have liked to be Pollock, but I wouldn't want to be after Pollock. My ambition was too big.\""]}, {"page": "Louis le Brocquy", "response": ["Le Brocquy is widely acclaimed for his evocative \"Portrait Heads\" of literary figures and fellow artists, which include William Butler Yeats, James Joyce, and his friends Samuel Beckett, Francis Bacon and Seamus Heaney, in recent years le Brocquy's early \"Tinker\" subjects and Grey period \"Family\" paintings, have attracted attention on the international marketplace placing le Brocquy within a very select group of British and Irish artists whose works have commanded prices in excess of £1 million during their lifetimes that include Lucian Freud, David Hockney, Frank Auerbach, and Francis Bacon.The painting Tinker Woman with Newspaper (1947–48) set a world auction record for an Irish living artist, Sotheby's, Irish Sale, London, May 2000. The price (Stg£1.15m) places le Brocquy within a very select group of British and Irish artists whose works have commanded prices in excess of £1 million during their lifetimes. http://www.sothebys.com/app/live/dept/DepartmentGlobal.jsp?dept_id=157"]}, {"page": "Francis Bacon (artist)", "response": ["Bacon's main haunt was The Colony Room, a private drinking club at 41 Dean Street in Soho, known as \"Muriel's\" after Muriel Belcher, its proprietor. Belcher had run the Music-box club in Leicester Square during the war, and secured a 3 – 11pm drinking licence for the Colony Room bar as a private-members club; public houses had to, by law, close at 2:30 pm, before re-opening at 5:30 pm. Bacon was a founding member, joining the day after its opening in 1948. He was 'adopted' by Belcher as a 'daughter', and allowed free drinks and £10 a week to bring in friends and rich patrons. In 1948 he met John Minton, a regular at Muriel's, as were the painters Lucian Freud, Frank Auerbach, Patrick Swift and the Vogue photographer, John Deakin. In 1950, Bacon met the art critic David Sylvester, then best known for his writing on Henry Moore and Alberto Giacometti. Sylvester had admired and written about Bacon since 1948. Bacon's artistic inclinations in the 1950s moved towards his abstracted figures which were typically isolated in geometrical cage-like spaces, and set against flat, nondescript backgrounds. Bacon said that he saw images \"in series\", and his work typically focused more on a single subject for sustained periods, often in triptych or diptych formats. Although his decisions might have been driven by the fact that in the 1950s he tended to produce group works for specific showings, usually leaving things until the last minute, there is significant development in his aesthetic choices during the 1950s which influenced his artistic preference for the represented content in his paintings."]}, {"page": "Lucian Freud", "response": ["Freud was one of a number of figurative artists who were later characterised by artist R. B. Kitaj as a group named the \"School of London\".Kitaj's essay in the catalogue for The Human Clay exhibition, Hayward Gallery, London, 1976. This group was a loose collection of individual artists who knew each other, some intimately, and were working in London at the same time in the figurative style. The group was active contemporaneously with the boom years of abstract painting and in contrast to abstract expressionism. Major figures in the group included Freud, Kitaj, Francis Bacon, Frank Auerbach, Michael Andrews, Leon Kossoff, Robert Colquhoun, Robert MacBryde, and Reginald Gray. Freud was a visiting tutor at the Slade School of Fine Art of University College London from 1949 to 1954.", "Freud painted fellow artists, including Frank Auerbach and Francis Bacon and produced a large number of portraits of the performance artist Leigh Bowery. He also painted Henrietta Moraes, a muse to many Soho artists. A series of huge nude portraits from the mid-1990s depicted the very large Sue Tilley, or \"Big Sue\", some using her job title of \"Benefits Supervisor\" in the title of the painting,NPG, 33; Etching, Tate as in his 1995 portrait Benefits Supervisor Sleeping, which in May 2008 was sold by Christie's in New York for $33.6 million, setting a world record auction price for a living artist.Lucian Freud: From \"Ingres of Existentialism\" to Impasto Master BLOUINARTINFO.COM"]}, {"page": "Paula Rego", "response": ["Rego studied at the Slade School of Fine Art, University College London and was an exhibiting member of the London Group, along with David Hockney and Frank Auerbach. She was the first artist-in-residence at the National Gallery in London. She lives and works in London.", "Although Rego was commissioned by her father to produce a series of large-scale murals to decorate the works' canteen at his electrical factory in 1954, while she was still a student, Rego's artistic career effectively began in early 1962, when she began exhibiting with The London Group,Kellaway, Kate. \"Artists: Paula Rego\" , The London Group, Retrieve 23 May 2014. a long-established artists' organization which had David Hockney and Frank Auerbach among its members. In 1965, she was selected to take part in a group show, Six Artists, at the Institute of Contemporary Arts, ICA, in London.\"ICA Exhibitions\" , Institute of Contemporary Art, Retrieved 23 May 2014. That same year she had her first solo show at the Sociedade Nacional de Belas Artes (SNBA) in Lisbon. She was also the Portuguese representative at the 1969 São Paulo Art Biennial.\"Group Exhibitions\", Casa das Historias Paula Rego, Retrieved 22 May 2014. Between 1971 and 1978 she had seven solo shows in Portugal, in Lisbon and Oporto, and then a series of solo exhibitions in Britain, including at the AIR Gallery in London in 1981, the Arnolfini in Bristol in 1983, and the Edward Totah Gallery in London in 1984, 1985 and 1987.Tate Gallery Archives, London, ref. TGA978"]}, {"page": "Royal College of Art", "response": ["Alumni from the twentieth and twenty-first centuries include the sculptors Barbara Hepworth and Henry Moore, painters Frank Auerbach, David Hockney, Bridget Riley, Sir Peter Blake, Gavin Turk and Charles Tunnicliffe, artists Jake and Dinos Chapman, Tracey Emin and R. B. Kitaj, fashion designers Ossie Clark and Zandra Rhodes, industrial designers James Dyson, Sir Jonathan Ive and David Mellor, film directors Tony and Ridley Scott, writer Travis Jeppesen, designers Thomas Heatherwick and architect Sir David Adjaye, prominent member of the suffragette movement Sylvia Pankhurst, the musician Ian Dury and the actor Alan Rickman."]}, {"page": "Timeline of art", "response": ["* 1931 in art – Births of Frank Auerbach, Bridget Riley, Tom Wesselmann, Salvador Dalí paints The Persistence of Memory"]}, {"page": "Saatchi Gallery", "response": ["April – October 1988 featured exhibited works by American figurative painter Leon Golub, German painter and photographer Sigmar Polke, and American Abstract Expressionist painter Philip Guston. During November 1988 – April 1989 a group show featured contemporary American artists, most prominently Eric Fischl. From April – October, the gallery hosted exhibitions of American minimalist Robert Mangold and American conceptual artist Bruce Nauman. From November 1989 – February 1990, a series of exhibitions featured School of London artists including Lucian Freud, Frank Auerbach, Leon Kossoff and Howard Hodgkin.", "*Frank Auerbach"]}, {"page": "London South Bank University", "response": ["* Frank Auerbach, painter"]}, {"page": "List of modern artists", "response": ["* Frank Auerbach"]}, {"page": "List of contemporary artists", "response": ["* Frank Auerbach (born 1931), painter"]}, {"page": "Pinchus Kremegne", "response": ["Underestimated as an artist today, he is overshadowed by Soutine and Chagall. He was remembered with a posthumous one-man show in the Quartier Les Halles in Paris in the 1990s. A more structured vision of nature than Soutine's, Kremegne's last paintings prefigure the work of painters such as Leon Kossoff and Frank Auerbach in England."]}, {"page": "Camberwell College of Arts", "response": ["During the Second World War, Victor Pasmore was appointed head of the painting department.Victor Pasmore biography , Victorpasmore.com Many well-known artists, including Frank Auerbach,Tom Phillips biography  Lawrence Gowing and Edward Ardizzone taught at Camberwell during this period. In 1973, the School expanded into a modern purpose-built block next to the existing premises. Both of them are now Listed Buildings."]}, {"page": "Kindertransport", "response": ["* Frank Auerbach (from Germany), British painter"]}, {"page": "R. B. Kitaj", "response": ["He curated an exhibition for the Arts Council at the Hayward Gallery in 1976, entitled \"The Human Clay\" (an allusion to a line by W. H. Auden), including works by 48 London artists, such as William Roberts, Richard Carline, Colin Self and Maggi Hambling, championing the cause of figurative art at a time when abstract was dominant. In an essay in the controversial catalogue, he invented the phrase the \"School of London\" to describe painters such as Frank Auerbach, Leon Kossoff, Francis Bacon, Lucian Freud, Euan Uglow, Michael Andrews, Reginald Gray, Peter de Francia and himself.Obituary, The Daily Telegraph, October 24, 2007"]}, {"page": "Robert Hughes (critic)", "response": ["Whether positive or negative, his judgments were enthusiastic. He championed London painters like Frank Auerbach and Lucian Freud, helping to popularise the latter in the United States, and wrote with unabashed admiration for Francisco Goya and Pierre Bonnard. By contrast Hughes was dismissive of much postmodernism and neo-expressionism, of painters like Julian Schnabel and David Salle, as well as the vicissitudes of a money-fuelled art market. While his reviews expressed antipathy for the avant-garde, he was beholden neither to any theory nor ideology, and managed to provoke both ends of the political spectrum. He distrusted novelty in art for its own sake, yet he was also disdainful of a conservative aesthetic that avoided risk. Hughes, according to Adam Gopnik, was drawn to work that was rough-hewn, \"craft attempted with passion.\""]}, {"page": "List of German Jews", "response": ["* Frank Auerbach, painter"]}, {"page": "List of British Jews", "response": ["* Frank Auerbach, painter"]}, {"page": "Tom Phillips (artist)", "response": ["From 1958 to 1960 Phillips read English Literature and Anglo Saxon at St Catherine's College, Oxford. He attended life drawing classes at the Ruskin School of Drawing and Fine Art, acted in plays, and designed and illustrated the Isis magazine. Upon graduation he taught Art, Music and English at Aristotle Road School, Brixton, London. He also attended evening classes in life drawing (under Frank Auerbach), and sculpture at Camberwell College of Arts, where he became a full-time student in 1961. When he graduated in 1964 his work was selected for that year's Young Contemporaries Exhibition in London and in the following year, the AIA Galleries in London exhibited his first one-man show. While studying at Camberwell Phillips married Jill, and their daughter Ruth was born in 1964. Their second child was a son, Leo."]}, {"page": "National Museum Cardiff", "response": ["The collection of 20th-century art includes works by sculptors Jacob Epstein, Herbert Ward and Eric Gill and painters including Stanley Spencer, the British Impressionist Wynford Dewhurst, L. S. Lowry, and Oskar Kokoschka. Works by contemporary artists are on rotational display, including those by Luke Jones, Francis Bacon, Frank Auerbach and Rachel Whiteread. Pablo Picasso's Nature Morte au Poron was acquired in 2009."]}, {"page": "Neo-expressionism", "response": ["* Frank Auerbach"]}, {"page": "Sigmar Polke", "response": ["*1986: Awarded a \"Golden Lion\" at the XLII Biennale di Venezia (shared with Frank Auerbach)"]}, {"page": "Mornington Crescent", "response": ["The crescent has a number of literary and artistic associations. The artist Frank Auerbach has a studio nearby and has often painted the crescent and surrounding area. The crescent was a popular subject of the Camden Town Group; the painter Walter Sickert lived there from 1905, at number 6,  and Spencer Gore lived at number 31 from 1909 to 1912. Clarkson Stanfield (a painter friend of Charles Dickens) lived at number 36 from 1834 to 1841. The painter Harden Sidney Melville lived for a time at number 34. Dickens went to a school, Wellington House Academy, on Granby Terrace adjoining Mornington Crescent, after his spell working in a blacking warehouse."]}, {"page": "Art of the United Kingdom", "response": ["Henry Moore emerged after World War II as Britain's leading sculptor, promoted alongside Victor Pasmore, William Scott and Barbara Hepworth by the Festival of Britain.  The \"London School\" of figurative painters including Francis Bacon, Lucian Freud, Frank Auerbach, Leon Kossoff, and Michael Andrews have received widespread international recognition,Walker, 219-225 while other painters such as John Minton and John Craxton are characterized as Neo-Romantics. Graham Sutherland, the Romantic landscapist John Piper (a prolific and popular lithographer), the sculptor Elisabeth Frink, and the industrial townscapes of L.S. Lowry also contributed to the strong figurative presence in post-war British art."]}, {"page": "Bill Gilmour (director)", "response": ["Bill Gilmour is a Scots television director. He was born on 17 March 1939 in the small town of Peebles in the Tweed Valley of the Scottish Borders. He went to Ealing Art College in West London, where he specialised in photography, while attending Frank Auerbach's drawing classes. He joined Scottish Television in 1960 as a camera operator, moving after four years to floor managing, before joining Granada Television in 1967. Gilmour began directing in 1972."]}, {"page": "List of British artists", "response": ["* Frank Auerbach (born 1931)"]}, {"page": "Middlesbrough Institute of Modern Art", "response": ["Works include; Frank Auerbach, Elizabeth Blackadder, David Bomberg, Ken Currie, Jeremy Deller, Tracey Emin, Sir Jacob Epstein, Dame Elisabeth Frink, David Hockney, Peter Howson, Gwen John, Panayiotis Kalorkoti, L.S. Lowry, Ben Nicholson, Eduardo Paolozzi, Adrian Piper, Katherine Pleydell-Bouverie, Anne Redpath, Paula Rego, David Remfry, Lucie Rie, Stanley Spencer, Nancy Spero and Kara Walker."]}, {"page": "The Portrait Now", "response": ["The Portrait Now  was an exhibition of contemporary portraiture held in 1993 to 1994 at the National Portrait Gallery, London. Among many others it included portraits by Michael Andrews, Frank Auerbach,  Francis Bacon, Tony Bevan, Chuck Close, Jim Dine, Peter Edwards, Stephen Finer, Lucian Freud, Richard Hamilton, Howard Hodgkin, David Hockney, Panayiotis Kalorkoti, Jeff Koons, Leon Kossoff, Alice Neel, Nam June Paik,  David Salle, Julian Schnabel and Andy Warhol. It presented a decade of portraiture focusing on the forms of sculpture and painting, however it also included some video pieces."]}, {"page": "Oil on Canvas", "response": ["*Frank Auerbach - cover painting"]}, {"page": "Frank Helmuth Auerbach", "response": ["#Redirect Frank Auerbach"]}, {"page": "1931 in art", "response": ["* April 29 – Frank Auerbach, German-born painter"]}, {"page": "Sidcup Art College", "response": ["* Frank Auerbach, painter, met one of his long-standing subjects, Julia Yardly Mills, when he taught her at Sidcup School of Art"]}, {"page": "Beaux Arts Gallery", "response": ["Founded and operated by portrait sculptor Frederick Lessore in 1923, the gallery was run by his wife Helen Lessore, a painter, until it closed following her death. Prominent exhibitions at the gallery included the first solo exhibition by Christopher Wood; one of the first exhibitions of Barbara Hepworth and her husband John Skeaping, the first solo exhibition of Frank Auerbach and Leon Kossoff.Solo exhibitions of Reginald Fairfax Wells sculpture and pottery."]}, {"page": "Harriet Bridgeman", "response": ["In 1997, Bridgeman was awarded the European Women of Achievement Award in the Arts.  The award was given in recognition of the Bridgeman Art Library's promotion of European culture and the European scope of its clients, collections and research.  In 2005, she was voted the International Business Woman of the Year by the judges of the International Business Awards. She has been given funding for three research projects within the arts by the European Union. In 2006, she founded a Community Interest Company, the Artists' Collecting Society to collect Artists’ Resale Right (Droit de Suite) on behalf of UK-based artists which includes, amongst its many members, Frank Auerbach and the estates of Lucian Freud, Barbara Hepworth, and Howard Hodgkin."]}]}}