{"wiki_id": "http://www.wikidata.org/entity/Q2159036", "itemLabel": "Robert Twigger", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Twigger", "wikipedia_page": {"main": "Robert Twigger (born 30 October 1962) is a British artist and writer. He travels widely but divides his time mostly between the UK and Egypt.", "link_mentions": [{"page": "Alan Sillitoe", "response": ["Sillitoe wrote many novels and several volumes of poems. His autobiography, Life Without Armour, which was critically acclaimed on publication in 1995, offers a view of his squalid childhood. In an interview Sillitoe claimed that \"A writer, if he manages to earn a living at what he's doing, even if it's a very poor living, acquires some of the attributes of the old-fashioned gentleman (if I can be so silly).\"Wood, Ramsay,\"Alan Sillitoe: The Image Shedding the Author\", Four-Quarters, La Salle College, Philadelphia, 1971 Robert Twigger blog entry, 6 August 2011", "*Ramsay Wood's 1971 interview 'Alan Sillitoe: The Image Shedding the Author', Four Quarters, La Salle University, Philadelphia, on Robert Twigger's blog 6 August 2011 "]}, {"page": "1985 in literature", "response": ["*Newdigate Prize: Robert Twigger"]}, {"page": "Newdigate Prize", "response": ["* 1985: Magic. Robert Twigger"]}, {"page": "Somerset Maugham Award", "response": ["* Robert Twigger for Angry White Pyjamas"]}, {"page": "Yoshinkan", "response": ["In 1990,  Gozo Shioda founded the International Yoshinkan Aikido Federation (IYAF) to facilitate the learning of Yoshinkan aikido outside Japan.  Under current dojo director Susumu Chino, the Yoshinkan hombu dojo, located in Shinjuku Tokyo, runs an annual 11-month intensive course called the Senshusei course, in which students from Japan and foreign nations train with the Tokyo Metropolitan Riot Police. The book Angry White Pyjamas by Robert Twigger is based on the author's experiences during the course."]}, {"page": "Angry White Pyjamas", "response": ["Angry White Pyjamas is a book written by Robert Twigger about his time in a one-year intensive program of studying Yoshinkan aikido."]}, {"page": "William Hill Sports Book of the Year", "response": ["| Robert Twigger", "| Robert Twigger"]}, {"page": "Tahir Shah", "response": ["Shah regards family friend Doris Lessing as a key influence, as well as his aunt Amina Shah. In addition, Shah maintains a close association with a number of travel writers and novelists, including Robert Twigger, Tarquin Hall, Jason Webster, Rory Maclean, Jason Elliot, and Marcel Theroux. Shah himself has written about his fascination with the works of Bruce Chatwin, especially his book The Songlines,"]}, {"page": "Senshusei course", "response": ["養神館合気道 国際専修生コース   Retrieved on August 27, 2010. is an intensive, 11-month aikido training program conducted at Yoshinkan Aikido's honbu dojo (headquarters and main training hall) in Shinjuku, Tokyo, Japan.Aikido Yoshinkan: The Senshusei course – Information and application package  Retrieved on February 28, 2010.Goryukai Yoshinkan Aikido: Senshusei  (2007). Retrieved on February 28, 2010.Honeyman, J. (2009): Senshusei (June 1, 2009). Retrieved on February 28, 2010. The course has received attention through Robert Twigger's book, Angry White Pyjamas (1997).Twigger, R. (1997): Angry White Pyjamas. London: Phoenix. ()"]}, {"page": "The Museum of Curiosity", "response": ["*Robert Twigger"]}, {"page": "The Age of Kali", "response": ["In reviewing this book Robert Twigger said that \"Dalrymple has become a kind of Uberjournalist who has superseded Mark Tully as the voice of India and this book collects 19 essays on places and people located on or near the Indian subcontinent.\""]}, {"page": "The Institute for Cultural Research", "response": ["* poet, writer and adventurer Robert Twigger (Polymaths in a monopathic world?)"]}, {"page": "Extinction Club", "response": ["#redirectRobert Twigger"]}, {"page": "Robert Mustard", "response": ["Robert Mustard is featured in the book Angry White Pyjamas by Robert Twigger. The book depicts the life of a trainee undergoing the senshusei training program.Angry White Pyjamas, by Robert Twigger 1997, Phoenix"]}, {"page": "The Idries Shah Foundation", "response": ["In another related article on the Asian Affairs journal weblog, author Robert Twigger writes of it being fifty years since the original publication of The Sufis. He notes that the introduction by popular poet, novelist, critic and classicist, Robert Graves helped get the book noticed, and Shah had the support of American psychologist Robert Ornstein and award-winning author Doris Lessing. More recently, historian William Dalrymple has also expressed his debt to Shah's works, as has The Guardian columnist and author Oliver Burkeman."]}, {"page": "Jacques Payet", "response": ["Payet is mentioned several times in Robert Twigger's book Angry White Pyjamas, about the author's experiences on the 3rd Senshusei Course (1993-1994).  In particular, in an extended passage that is set at the funeral of Gozo Shioda, Twigger says he \"plucked up the courage\" to speak to Payet and reports a subsequent conversation.Twigger, R.  Angry White Pyjamas passage in Google Books  For the content in this passage, the author visited Payet in France to conduct an interview while preparing to write the book following his graduation from the course."]}, {"page": "Micromastery", "response": ["Micromastery: Learn Small, Learn Fast and Find the Hidden Path to Happiness is a self-help book by British author, Robert Twigger, first published in 2017 by Penguin Life and in E-book format."]}, {"page": "Twigger, Robert", "response": ["#redirectRobert Twigger"]}]}}