{"wiki_id": "http://www.wikidata.org/entity/Q21664816", "itemLabel": "Henry Pallett", "itemDescription": "cricketer (1863-1917)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Pallett", "wikipedia_page": {"main": "Henry James Pallett, known as \"Harry Pallett\", (2 January 1863 – 18 June 1917) was an English cricketer who played first-class cricket between 1886 and 1898, principally for Warwickshire. He was born in Birchfield, then in Staffordshire, and died at Aston, Birmingham.\nPallett was a right-handed lower-order batsman, though early in his career he batted higher up the batting order, and a right-arm slow bowler. Prominent in Birmingham area club cricket, he played for Warwickshire from 1883, though the county's games were not considered first-class until 1894, and the team was not included in the County Championship until 1895. At the end of the 1886 season, he was picked for a non-Test match England XI to play the Australian touring team under the captaincy of W. G. Grace and this game was his first-class cricket debut. He then played for the North against the 1890 Australians, in the 1891 North v South match, and for a team representing \"Second-Class Counties\" against the 1893 Australians: in none of these matches did he make much impact with either bat or ball.In 1894, Warwickshire's matches against first-class teams were deemed also to be first-class, and Pallett played 15 matches that year, with outstanding success: he took 79 wickets at an average of 11.87 and among significant wicket-takers was behind only Test cricketers Dick Pougher and Tom Richardson in the national averages. He took five wickets in an innings 10 times and had three 10-wicket matches. His best return of the season, and of his entire first-class career, came in the match against Essex at Leyton, when he took nine first-innings wickets for 55 runs and followed that with five for 45 in the second innings for a match return of 14 for 100. He took a further 11 wickets in the return match at Edgbaston two weeks later.The more competitive cricket that Warwickshire's entry into the County Championship in 1895 brought had some impact on Pallett's bowling figures, but with 95 wickets at an average of 21.49 he was the team's leading wicket-taker and second only to the irregular bowler Alfred Glover in terms of average. His best bowling came in an early-season game against Derbyshire, when he took eight first-innings wickets for 69 runs, and these were the best Championship figures he achieved in his career. He was less effective in 1896, when his 74 wickets cost more than 25 runs apiece, and even less so in 1897, with a poor return of 44 wickets costing more than 33 runs each. In these seasons, however, his batting improved and he made two scores of 55, the first of them, against Surrey in 1896, being not out and therefore counting as his highest first-class score.After a few games in 1898, he disappeared from first-class cricket, although he played in a few Minor Counties matches for Staffordshire in 1903. By profession, he was a schoolmaster.", "link_mentions": [{"page": "Pallett", "response": ["*Henry Pallett (1863–1917), English cricketer"]}, {"page": "List of Warwickshire County Cricket Club players", "response": ["* Henry Pallett (1894–1898) : H. J. Pallett (73)"]}, {"page": "David Buchanan (cricketer)", "response": ["However, from 1877 onwards Buchanan, as a resident in Rugby, played a critical role in the establishment of a Warwickshire County Club, which was officially founded in its present form for the 1882 season. Buchanan was at this stage fifty-two, but captained the club's for its initial four years with considerable success and continued as treasurer of the club until 1889. By this time Warwickshire was well on the way to achieving the status of a first-class team with players like Henry Pallett, the Quaife brothers, Dick Lilley and Ludford Docker."]}, {"page": "James Whitehead (cricketer, born 1860)", "response": ["From 1894, Warwickshire's games against other first-class sides were also considered to be first-class, though the team did not join the County Championship until 1895. In 1894, Whitehead, alongside Henry Pallett, formed part of an extremely successful bowling line-up, and he took five wickets in an innings five times, on four occasions going on to take 10 or more wickets in a match. His best bowling performance came in Warwickshire's first first-class match when he took eight Nottinghamshire wickets for 47 runs; this was the best bowling of his career. He almost equalled that return in the very next game by taking eight Surrey wickets for 49 in the first innings. Whitehead's success brought him selection for one of the representative sides in a non-Test cricket season: he played for A. J. Webbe's XI alongside notables such as Lord Hawke and F. S. Jackson against Cambridge University and took eight wickets in the game. He was, however, unable to sustain this level of performance, though he finished the 1894 season with 73 wickets at the respectable bowling average of 17.17 runs per wicket."]}, {"page": "Harry Pallett", "response": ["#REDIRECTHenry Pallett"]}]}}