{"wiki_id": "http://www.wikidata.org/entity/Q21642767", "itemLabel": "Vari Maxwell", "itemDescription": "cricketer (born 1981)", "wikipedia_url": "https://en.wikipedia.org/wiki/Vari_Maxwell", "wikipedia_page": {"main": "Vari Symington Crawford Maxwell (born 2 January 1981) is a former Scottish international cricketer whose career for the Scottish national side spanned from 2001 to 2007.\nBorn in Ayr, Maxwell made her debut for Scotland in May 2001, against Durham (an English county team), and later in the year was selected in the Scottish squad for the 2001 European Championship, where matches held One Day International (ODI) status. The tournament was Scotland's first at ODI level, and Maxwell in all three of her team's matches, against England, Ireland, and the Netherlands.The next international tournament for Scotland was the 2003 IWCC Trophy in the Netherlands, which served as a qualifier for the 2005 World Cup. Galvin featured in all but one of her team's five matches of the tournament, playing against the Netherlands, Pakistan, Japan, and Ireland. Against Pakistan, she had figures of 4/38 from nine overs, including the first three wickets to fall. Maxwell's figures were the best by a Scotswoman in ODIs (beating Kari Anderson's 3/64 against the Netherlands a day earlier), but Fiona Campbell took 4/25 against Japan three days later, meaning Maxwell's record was short-lived.Maxwell finished her ODI career for Scotland with seven wickets from seven matches, with only Kari Anderson having taken more. She continued to play for Scotland for several more years, including at the 2005 European Championship. Maxwell was initially named in the squad for the 2008 World Cup Qualifier in South Africa, but had to withdraw from the tournament after failing to secure leave from her employer.", "link_mentions": [{"page": "2008 Women's Cricket World Cup Qualifier", "response": ["* Vari Maxwell"]}, {"page": "2003 IWCC Trophy", "response": ["* Vari Maxwell"]}, {"page": "2001 Women's European Cricket Championship", "response": ["* Vari Maxwell"]}]}}