{"wiki_id": "http://www.wikidata.org/entity/Q2160202", "itemLabel": "Ade Edmondson", "itemDescription": "British comedian, actor, writer, musician, television presenter and director", "wikipedia_url": "https://en.wikipedia.org/wiki/Ade_Edmondson", "wikipedia_page": {"main": "Adrian Charles Edmondson (born 24 January 1957) is an English actor, comedian, musician, writer and television presenter. He was part of the alternative comedy boom in the early 1980s and had roles in the television series The Young Ones (1982–1984) and Bottom (1991–1995), which he wrote together with his collaborative partner Rik Mayall. Edmondson also appeared in The Comic Strip Presents... series of films throughout the 1980s and 1990s. For one episode of this he created the spoof heavy metal band Bad News, and for another he played his nihilistic alter-ego Eddie Monsoon, an offensive South African television star.He played the lead role in The Comic Strip's 1985 feature film, The Supergrass. In the 2000s, Edmondson appeared in numerous TV programmes in drama roles including Jonathan Creek, Holby City, Miss Austen Regrets, as himself on Hell's Kitchen and created the sitcom Teenage Kicks. Since 2006, Edmondson has concentrated increasingly on music instead of acting. He formed a folk punk band, The Bad Shepherds, singing and playing mandola and mandolin, and performed and wrote for the Bonzo Dog Doo Dah Band. In 2011, he presented a series of shows for ITV: The Dales, which focused on people working in the Yorkshire Dales, and Ade in Britain in which he undertook a tour of numerous places in Britain. In 2013, Edmondson was crowned the winner of Celebrity Masterchef, and from 2019 to 2020, he appeared in the BBC soap opera EastEnders as Daniel Cook.", "link_mentions": [{"page": "Adrian", "response": ["*Adrian Edmondson better known as Ade Edmondson (born 1957), English actor, comedian, director, writer and musician"]}, {"page": "List of comedians", "response": ["* Ade Edmondson (born 1957)"]}, {"page": "January 24", "response": ["*  1957   – Ade Edmondson, English comedian and musician"]}, {"page": "Ben Elton", "response": ["Raised in a non-religious home, he is an atheist. Elton studied at Stillness Junior School and Godalming Grammar School in Surrey, before leaving home at age 16 to study theatre at South Warwickshire College in Stratford-upon-Avon, where he took and passed A-levels in English, History and Theatre Studies. In 1977 he went to study Drama at the University of Manchester, where he met Rik Mayall and Ade Edmondson, and in 1980 he graduated with upper second-class honours."]}, {"page": "List of British comedians", "response": ["*Ade Edmondson, Guest House Paradiso"]}, {"page": "University of Manchester", "response": ["The university also educated some of the leading figures of Alternative Comedy: Ben Elton, Ade Edmondson and Rik Mayall. "]}, {"page": "Bayswater", "response": ["*Ade Edmondson"]}, {"page": "Jeff Wayne's Musical Version of The War of the Worlds", "response": ["On 15 October 2018 it was announced on the Jeff Wayne's Musical Version of The War of the Worlds Official Twitter page and on the official website that after over a year in work, a brand new production of Jeff Wayne's The War of The Worlds: The Musical Drama will be available on Audible.com on 29 November 2018. This is a brand new 5-hour Audible Original Production based upon Jeff's Musical Version and HG Wells’ dark Victorian tale featuring new story and musical content. It will feature an all-star cast including Michael Sheen as The Journalist, Taron Egerton as The Artilleryman, Ade Edmondson as Ogilvy, Theo James as Parson Nathaniel, with Anna Marie Wayne as Carrie, The Journalist's wife."]}, {"page": "The Rocky Horror Show", "response": ["On 3 May 2006, a benefit concert version of the musical to raise money for Amnesty International. Entitled The Rocky Horror Tribute Show, it was staged at the Royal Court Theatre (where the show had its world premiere in 1973) as a one night only event hosted by Richard O'Brien. The cast featured Anthony Head and Michael Ball sharing the role of Frank-N-Furter, Ade Edmondson and Stephen Gately sharing the role of Brad, Joanne Farrell and Sophie Lawrence sharing the role of Janet, Kraig Thornber as Riff Raff, Toyah Willcox as Magenta, Amy Rosefield as Columbia, Gary Amers as Rocky Horror, Ben Richards as Eddie, Julian Littman as Dr. Scott, and original cast member Patricia Quinn as The Usherette. Christopher Biggins, Rayner Bourton, Robin Cousins, Steve Pemberton, Tony Slattery, Jamie Theakston and O'Brien served as the show's narrators, introducing each musical number. The concert also featured guest appearances from the original Columbia Nell Campbell, and Kimi Wong, O'Brien's first wife and cast member from the 1975 film adaptation of the musical.", "| align=\"center\"|Emma BuntonAde EdmondsonStephen FryAnthony HeadMel GiedroycRichard O'Brien"]}, {"page": "The Jesus and Mary Chain", "response": ["A poster for the band is seen in the 1995 Bottom episode \"Terror\" in the scene where Richie (Rik Mayall) and Eddie (Ade Edmondson) fight three boys dressed as devils."]}, {"page": "University Challenge", "response": ["|University of Manchester (David Nott, Juliet Jacques, Ade Edmondson, Justin Edwards)"]}, {"page": "The Young Ones (TV series)", "response": ["During an event at the Bristol Slapstick Festival 2018, Ade Edmondson was asked about the fifth housemate during an audience question session and named the person playing the 'fifth housemate' as his university friend Mark Dewison. Mark also played a speaking role as Neil's friend (also called 'Neil') during series one episode \"Interesting\". He emerges from Vyvyan's full vacuum cleaner bag and ends up being shoved into the fridge by Rick. However, Dewison and the fifth housemate appear together in the same shot towards the end of the episode."]}, {"page": "Spitting Image", "response": ["*Ade Edmondson (1984)"]}, {"page": "Nigel Planer", "response": ["From September 2018 to November 2018, Planer toured with Ade Edmondson in a play that they wrote together called Vulcan 7."]}, {"page": "The Comic Strip", "response": ["As of 2009, the archive of Channel 4 episodes has been broadcast on UKTV's flagship channel, Gold. In May 2010, it was announced that Gold would broadcast 30th-anniversary documentary, preceded by the next new scripted episode of the series, Five Go to Rehab, a sequel to Five Go Mad in Dorset which featured the entire original cast (Ade Edmondson, Dawn French, Jennifer Saunders, Peter Richardson, as well as Rik Mayall, Nigel Planer, Stephen Mangan and Robbie Coltrane) and was filmed in the first weeks of July 2012, in and around Totnes; Richardson wrote and directed the film. The film showcased the characters thirty years on trying to recapture their youth. The film broadcast on Gold 7 November 2012."]}, {"page": "Enn Reitel", "response": ["Reitel does voiceovers for The X Factor. He played the Town Crier and The Maggot in Tim Burton's Corpse Bride and played Auric Goldfinger in the 2004 video game GoldenEye: Rogue Agent. It is his voice that provides the vocals on Lemon Jelly's \"Nice Weather For Ducks\" in 2002. He narrated the in-game promo spot for the Praying Mantis PMC in Metal Gear Solid 4: Guns of the Patriots. He also does Lorenzo Belli's voice from Capcom's survival horror game Haunting Ground. He was also the voice of Billy the ventriloquist dummy in James Wan's movie Dead Silence. He also provided voice performance for the audiobook of the sixth book in Eoin Colfer's Artemis Fowl series, The Time Paradox. Reitel also provided the voice for Delvin Mallory in The Elder Scrolls V: Skyrim and the Wizard Zabodon in The Big Knights. He also provided the voice of Ost Ordura in Kingdoms of Amalur: Reckoning and Alfred Pennyworth in Batman: The Telltale Series. He also played Male Altmer and Dunmer in The Elder Scrolls Online. He also provided voices of The Time Keeper in Skylanders: Swap Force, Laufey in Hulk and the Agents of SMASH, Master Ding in Kung Fu Panda: Legends of Awesomeness, Sebastian Oliver in Adr1ft, Olgan in Baten Kaitos Origins, Bootstrap Bill Turner in Pirates of the Caribbean: Dead Man's Chest, A Male Pedestrian in Infamous, Deraegis in Batman: The Brave and the Bold, Five Leaf Clover Guy, Japanese Deputy, Robertson, Boss Guraji and Fox in TripTank, Edwin Jarvis in Marvel Heroes, An English Spy in American Dad!, Billy in Dead Silence and The Dreamer in The Secret World. In May 2014, Reitel replaced Ade Edmondson as the voice of the Animal in the Peperami adverts."]}, {"page": "Jonathan Creek", "response": ["The cult success of the series won it the BAFTA for Best Drama Series in 1998. It was notable for featuring comic characters and sub-plots that lent a lot of humour to the series. Unusually, it was produced by the BBC's in-house Entertainment department rather than the Drama department – this was because Renwick preferred working with people he knew rather than the people at Drama who might not share his vision. It has included guest-stars such as Bob Monkhouse, Griff Rhys Jones, Rik Mayall, Jack Dee, Bill Bailey, John Bird,Nigel Planer and Ade Edmondson; who are mainly associated with comedy, but who gave straight performances."]}, {"page": "Ongar railway station", "response": ["Ongar Tube was mentioned in the Ade Edmondson book How To Be A Complete Bastard. You could be a \"Complete Bastard\" by telling tourists that all of London's tourist attractions were within walking distance of Ongar Tube."]}, {"page": "Alternative comedy", "response": ["Meanwhile, another group of comics left the Comedy Store with Peter Richardson to form The Comic Strip and run their own \"Comedy Cabaret\" shows at the Boulevard Theatre, Walkers Court, Soho in October 1980. The Comic Strip, featuring double acts and sketch comedy, consisted of Manchester University and Royal Central School graduates Ade Edmondson, Rik Mayall, Nigel Planer, Dawn French, and Jennifer Saunders, who began to aim their talents at television. As The Comic Strip Presents, the group made over 40 television films for both Channel 4 and BBC."]}, {"page": "Rik Mayall", "response": ["Richard Michael Mayall (7 March 1958 – 9 June 2014) was an English actor, stand-up comedian and writer. He formed a close partnership with Ade Edmondson while they were students at Manchester University and was a pioneer of alternative comedy in the 1980s.", "He attended King's School, Worcester, to which he won a free scholarship. He failed most of his O-levels and scraped through A-levels. In 1975, Mayall went to the University of Manchester to study drama. He claimed that he failed his degree, or that he did not even turn up to his finals but in reality he graduated with lower second-class honours in 1978.  It was there that he met his future comedy partner Ade Edmondson, Ben Elton, a fellow student, and Lise Mayer, with whom he later co-wrote The Young Ones.", "On 5 March 2011, Mayall appeared on Let's Dance for Comic Relief in which he came on stage and attacked Ade Edmondson with a frying pan during his performance of The Dying Swan ballet. Edmondson mentioned backstage that it was the first time in eight years they had done something like that together and claimed Mayall had left his head with a small bump. It would be the last time the duo performed together in public.", "On 9 June 2014, Mayall died at his home in Barnes, Richmond-upon-Thames, London, following a sudden heart attack after a morning jog. He was 56 years old. His funeral took place on 19 June 2014 at St. George's Church in Dittisham, Devon. Among the attendees were Dawn French, Jennifer Saunders, Peter Richardson, Alan Rickman, and Mayall's Young Ones co-stars Ade Edmondson, Nigel Planer, and Alexei Sayle along with Young Ones co-writer Ben Elton. Edmondson also served as a pallbearer. Mayall was buried on his family estate, Pasture Farm, near Totnes in Devon.Hello Magazine", "| 3 series, also co-creator with Ade Edmondson "]}, {"page": "Bishop's Stortford", "response": ["South Mill Arts (formerly the Rhodes Arts Complex) is the town's largest live music venue. A recipient of a National Lottery grant in 2006, the venue hosts both local and international artists, including Midge Ure, The Beat, Ade Edmondson. Other live music venues include pubs The Half Moon and the Rose & Crown. Youth choir Cantate is based in Bishop's Stortford. The choir holds concerts in the surrounding area, including many in the town itself."]}, {"page": "Bad News (band)", "response": ["Bad News are a fictional English heavy metal band created for the Channel 4 television series The Comic Strip Presents.... Its members were Vim Fuego (also known as \"Alan Metcalfe\"), vocals and lead guitar (played by Ade Edmondson); Den Dennis, rhythm guitar (Nigel Planer); Colin Grigson, bass (Rik Mayall); and Spider \"Eight-Legs\" Webb, drums (Peter Richardson).  The band continued outside the context of the TV series, with the actors (in character) eventually playing a number of live gigs as Bad News, and recording an album (1987's Bad News) and a single (a cover of \"Bohemian Rhapsody\") that made the UK charts.  ", "* Vim Fuego, né Alan Metcalfe (Ade Edmondson) – Lead vocals and lead electric guitar"]}, {"page": "List of show business families", "response": ["* Comedian, actor, and singer Ade Edmondson and comedian-actress Jennifer Saunders are the parents of singer-songwriter, Ella Edmondson."]}, {"page": "Nicholas Parsons", "response": ["In 1988, Parsons appeared as himself in The Comic Strip episode \"Mr. Jolly Lives Next Door\", alongside Rik Mayall and Ade Edmondson. The following year, he guest-starred in Doctor Who, playing Reverend Wainwright in the Seventh Doctor serial The Curse of Fenric."]}, {"page": "Ready Steady Cook", "response": ["Celebrity appearances include: David Tennant, Wendy Richard, Kate Winslet, Honor Blackman, James May, Richard Hammond, Paul O'Grady as alter-ego Lily Savage, Cliff Richard, Twiggy, Rakie Ayola, Fiona Bruce, Gail Porter, Midge Ure, Edd China, Amanda Redman, Ade Edmondson and Alan Davies."]}, {"page": "Les Dennis", "response": ["In 2013, Dennis was a contestant in Celebrity MasterChef. He finished as runner-up to Ade Edmondson. He has since returned to the show as a guest judge."]}, {"page": "Double act", "response": ["In the wake of Not the Nine O'Clock News, The Young Ones and the breakthrough onto television of 'alternative comedy' came French and Saunders; Fry and Laurie; Rik Mayall and Ade Edmondson; Hale and Pace; and Smith and Jones. These edgier comics were brasher and crude—comedy's answer to punk rock. They developed the satire and vulgarity of Peter Cook and Dudley Moore rather than the more gentle humour of Morecambe and Wise and The Two Ronnies. In fact, Smith and Jones showed blatant disregard for their predecessors, openly mocking the Two Ronnies (this may have been a factor in Ronnie Barker's decision to retire from comedy in the late 1980s.)", "Rik Mayall and Ade Edmondson combined their success in sitcoms (The Young Ones) and as a double act (The Dangerous Brothers) in 1991 when they created Bottom. Their characters are a pair of sad, pathetic losers forced together by their mutual hopelessness. However, unlike earlier examples of such, the characters in Bottom absolutely hate each other, exacerbating their despair. This often leads to slapstick violence, such as hitting each other with frying pans. Mayall and Edmonson have said Bottom aimed to be more than just a series of toilet gags—it was meant to be a cruder cousin to plays like Waiting for Godot about the pointlessness of life.", "* Ade Edmondson & Rik Mayall"]}, {"page": "Filthy Rich & Catflap", "response": ["*Edward Didgeridoo Catflap (Ade Edmondson): Richie's faithless minder; permanently drunk, disloyal, and violent. Occasionally, Catflap holds up the pretence of being Richie's best friend, although this is usually for personal gain (Edmondson's character in Bottom, Eddie Hitler, is similar but not identical)."]}, {"page": "List of Blackadder characters", "response": ["*Baron von Richthoven (Ade Edmondson) – A German Flying ace who imprisons Blackadder behind enemy lines in the season four episode. (\"Private Plane\")"]}, {"page": "Happy Families (1985 TV series)", "response": ["The first episode focuses on Edith Fuddle (Saunders), who is told by her doctor De Quincy (Stephen Fry), that she has Corrington's disease, and will die within nine months. Throughout the series de Quincy shows himself to be tactless, forgetful and almost negligent - he constantly forgets to inform Cook that she is pregnant, and at one stage injects himself with a dose of morphine intended for Edith.  Although in a bitter feud with her grandson (Ade Edmondson), she enlists his help to go out into the world to find his four sisters, and to bring them back to her for a family reunion before she dies."]}]}}