{"wiki_id": "http://www.wikidata.org/entity/Q21604070", "itemLabel": "George Beasley-Murray", "itemDescription": "Murray, George Raymond Beasley- (1916–2000), Baptist minister and biblical scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Beasley-Murray", "wikipedia_page": {"main": "George Raymond Beasley-Murray (October 10, 1916 – 23 February 2000) was an evangelical Christian and prominent Baptist scholar, Principal of Spurgeon's College, London, and later Professor of New Testament Interpretation at Southern Baptist Theological Seminary.  He is known particularly for what became the standard work on Baptism in the New Testament (1962), and his major study of Jesus and the Kingdom of God (1986).  He received his D.D. from Jesus College, Cambridge.", "link_mentions": [{"page": "Authorship of the Johannine works", "response": ["Since the end of the first century, the Beloved Disciple has been commonly identified with John the Evangelist. In his early-4th-century Ecclesiastical History, Eusebius wrote 'the apostle and evangelist John, the one whom Jesus loved...'.Eusebius of Caesarea, Ecclesiastical History Book 3. Chapter 23. Quote: 'At that time the apostle and evangelist John, the one whom Jesus loved,...' Objections are raised against the identification of John the Apostle with the \"disciple whom Jesus loved\", because the latter is not mentioned before the Last Supper.Craig S. Keener, The Gospel of John: Volume One. p. 84 notes, \"One could argue that the beloved disciple is not one of the Twelve because he is not mentioned by the 'beloved disciple' until the last discourse and passion narrative (one could also use this to separate sections of the gospels into sources).\" See also Robert Kysar, John, the maverick Gospel, (Atlanta: John Knox Press, 1976), 919 The title (\"beloved disciple\") is also strange to George Beasley-Murray because \"if the beloved disciple were one of the Twelve, he would have been sufficiently known outside the Johannine circle of churches for the author to have named him\".Keener, The Gospel of John: Volume 1, 84; See also George Beasley-Murray, John, (Waco: Word Books, 1987), lxxiii"]}, {"page": "G. R. Beasley-Murray", "response": ["#REDIRECT George Beasley-Murray"]}, {"page": "Beasley-Murray, George", "response": ["#redirectGeorge Beasley-Murray"]}]}}