{"wiki_id": "http://www.wikidata.org/entity/Q21664544", "itemLabel": "John Hope-Johnstone", "itemDescription": "British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hope-Johnstone_(photographer)", "wikipedia_page": {"main": "Charles John Hope-Johnstone (1883–1970) was a British photographer and a member or associate of the Bloomsbury Group. He was the editor of the Burlington Magazine from 1919 to 1920, and tutored the children of Augustus John. He had walked to Bosnia with Gerald Brenan before World War I, and introduced the latter to the Bloomsbury Group in 1919. For many years, until his death, he lived in a tiny cottage attached to Gerald Brenan's house in Aldbourne, Wiltshire.Anthony Powell, in his memoirs, describes Hope-Johnstone's status as \"not 'of Bloomsbury' in anything like the strictest sense\", but \"accepted in Bloomsbury circles as an equal\".", "link_mentions": [{"page": "Aldbourne", "response": ["The author and historian Gerald Brenan and his American wife, the poet and novelist Gamel Woolsey, lived in Aldbourne from the late 1930s to 1953. Gerald's long-time friend John Hope-Johnstone, a photographer with links to the Bloomsbury Group, lived in a cottage attached to their house until his death in 1970."]}, {"page": "Gerald Brenan", "response": ["At the age of 18, and to spite his father who wanted him to train for an army career at the Royal Military College, Sandhurst, he set off with an older friend, the occasional photographer and eccentric, John Hope-Johnstone, to walk to China. Between August 1912 and January 1913 they walked 1,560 miles, reaching Bosnia before lack of money made them turn back. Brenan spent the next ten months in Germany, learning the language, surprisingly in preparation for joining the Indian Police Service, but this plan was interrupted by the outbreak of the First World War in August 1914. He immediately joined the British Army and served in France throughout the war. After being demobbed in 1919, Hope-Johnstone introduced Brenan to the Bloomsbury Group."]}, {"page": "John Hope-Johnstone", "response": ["* John Hope-Johnstone (1796–1876), Scottish Conservative MP, de jure 7th Earl of Annandale and Hartfell", "* John Hope-Johnstone (1842–1912) (1841–1912), Scottish Conservative MP, de jure 8th Earl of Annandale and Hartfell", "* John Hope-Johnstone (photographer) (1883–1970), artist associated with the Bloomsbury Group"]}]}}