{"wiki_id": "http://www.wikidata.org/entity/Q21621792", "itemLabel": "Ivor Lawton", "itemDescription": "English association football player (born 1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ivor_Lawton", "wikipedia_page": {"main": "Ivor James John Lawton (born 5 September 1995) is an English footballer who plays for Alvechurch, where he plays as a midfielder.", "link_mentions": [{"page": "Callum Ball", "response": ["However Callum's spell with the club didn't last long, as on 4 October 2019, Callum, along with teammates Ivor Lawton, Linden Dovey, Joel Gyasi, and Luis Morrison were all released from their contracts, with Stratford Town manager Tommy Wright confirming the departures were down to budget cuts at the club."]}, {"page": "2013–14 Coventry City F.C. season", "response": ["* 26 – Coventry City hand squad number to Ivor Lawton ahead of the League One fixture against Rotherham United.", "| 39 || MF || Ivor Lawton ||  || Coventry ||  || – || – || – || – || Academy || 26 November 2013 || 30 June 2014 || Trainee"]}, {"page": "2014–15 Coventry City F.C. season", "response": ["|28||Ivor Lawton||CM||||Coventry||||0||0||Academy||26 November 2013||Trainee||30 June 2015"]}, {"page": "2015–16 Coventry City F.C. season", "response": ["On 1 August 2015, Coventry City ended their pre-season campaign with a 0–0 draw against Oxford United. They played a total of five games, failing to win a single game after three draws and two losses. A Coventry City XI side also drew 0–0 with Leamington during pre-season. Sam Ricketts was named as captain for the season on 3 August 2015. Bryn Morris was signed on season-long youth loan deal from Middlesbrough on 6 August 2015. Norwich City's Jacob Murphy was signed on loan on 15 August 2015 in a deal which will last till the end of the season. On 18 August, Ivor Lawton was loaned out to Nuneaton Town for one month. The club finished the month in fifth place after winning their first three league games but were defeated by Walsall 2–1 and drew at home to Southend United. Coventry were also knocked out the League Cup when they lost on penalties to Rochdale away from home in the first round. Adam Armstrong was awarded with League One's Player of the month award for August.", "|24||Ivor Lawton||CM||||Coventry||||0||0||Academy||26 November 2013||Trainee||30 June 2016", "| 24 ||  || Ivor Lawton || MF || || || || 0+1 || 1", "|  Ivor Lawton ||  Nuneaton Town || 18 August 2015 || 15 September 2015 || "]}, {"page": "2016–17 Coventry City F.C. season", "response": ["|26||Ivor Lawton||CM||||Coventry||||1||0||Academy||26 November 2013||Trainee||31 December 2016", "| 26 ||  || Ivor Lawton || MF || || || || ||", "| Ivor Lawton ||  Halesowen Town || 31 December 2016 || Free || "]}]}}