{"wiki_id": "http://www.wikidata.org/entity/Q21621090", "itemLabel": "Kadeena Cox", "itemDescription": "English athlete", "wikipedia_url": "https://en.wikipedia.org/wiki/Kadeena_Cox", "wikipedia_page": {"main": "Kadeena Cox  (born 10 March 1991) is a British television presenter and parasport athlete competing in T38 para-athletics sprint events and  C4 para-cycling events. She was part of the 2015 IPC Athletics World Championships and the 2016 UCI Para-cycling Track World Championships, in which she won world titles in the T37 100m and C4 500m time trial respectively.Competing for Great Britain at the 2016 Summer Paralympics, in both athletics and cycling, she won a bronze medal in the Women's 100m T38 sprint, before winning a gold medal in the Women's C4-5 cycling time trial, and another gold in the T38 400m sprint, becoming the first British Paralympian to win golds in multiple sports at the same Games since Isabel Barr at the 1984 Summer Paralympics.In 2021 she appeared as a contestant on ITV's I'm a Celebrity...Get Me Out of Here! and was the second star to be voted off the show. In September 2021 Cox was the winner of the sixteenth series of BBC's Celebrity MasterChef.", "link_mentions": [{"page": "Mastermind (British game show)", "response": ["The current record for the overall lowest score is 3 points, set on 21 December 2016 in a Celebrity edition by parasport athlete Kadeena Cox, scoring all 3 points on her specialist subject of Arsenal F.C. She is currently the only ever contestant to score no points in a round."]}, {"page": "Robot Wars (TV series)", "response": ["A second rebooted series was commissioned with a first celebrity special in 16 years, in which celebrities, such as Olympians Kadeena Cox and Alistair Brownlee and Jonny Brownlee, TV presenters Suzi Perry, Neil Oliver and Maggie Aderin-Pocock, singer Jordan Stevens and radio presenters Scott Mills and Robbie Savage had bespoke robots designed for them by eight major roboteers, who mentored them during the specials.", "|Kadeena Machina (Kadeena Cox)"]}, {"page": "List of British cyclists", "response": ["* Kadeena Cox"]}, {"page": "Cox (surname)", "response": ["*Kadeena Cox (born 1991), British athlete"]}, {"page": "MasterChef (British TV series)", "response": ["*2021: Kadeena Cox, Nabil Abdul Rashid, Bez, Kem Cetinay, Munya Chawawa, Michelle Collins, Dion Dublin, Gavin Esler, Patrick Grant, Duncan James, Melissa Johns, Will Kirk, Penny Lancaster, Megan McKenna, Su Pollard, Katie Price, Johannes Radebe, Rita Simons, Joe Swash and Melanie Sykes.", "| Kadeena Cox"]}, {"page": "1991 in the United Kingdom", "response": ["** Kadeena Cox, Paralympic Sprinter and Cyclist"]}, {"page": "List of people with multiple sclerosis", "response": ["* Kadeena Cox (born 1991), British parathlete."]}, {"page": "Wetherby High School", "response": ["* Kadeena Cox – parasports athlete", "File:Kadeena Cox Rio2016.jpg|Kadenna Cox at the 2016 Summer Olympics"]}, {"page": "Pride of Britain Awards", "response": ["*Kadeena Cox"]}, {"page": "I'm a Celebrity...Get Me Out of Here! (British TV series)", "response": ["| Kadeena Cox"]}, {"page": "David Weir (athlete)", "response": ["Weir was a late addition to the British team for the postponed 2020 Summer Paralympics in Tokyo on 21 July 2021. The other additions were Jonnie Peacock, Kadeena Cox and Libby Clegg."]}, {"page": "Jody Cundy", "response": ["At the 2020 Paralympic games in Tokyo, he took home the Silver in the C4-5 1km Time Trial behind Spanish C5 Athlete Alfonso Cabello. Two days later he teamed up with Kadeena Cox and Jaco van Gass to take Gold, in a new WR time of, 47.579 in the C1-5 Mixed 750m Team Sprint ahead of the current world champions China. "]}, {"page": "Libby Clegg", "response": ["Clegg was late addition to the British team for the postponed 2020 Summer Paralympics in Tokyo on 21 July 2021. The other additions were Jonnie Peacock, Kadeena Cox and David Weir."]}, {"page": "Celebrity Mastermind", "response": ["| Kadeena Cox || Arsenal F.C. || 4th"]}, {"page": "Great Britain at the Paralympics", "response": ["|37||Kadeena Cox|| Athletics Cycling || 2016 - 2020 || style=\"text-align:center;\"| F ||style=\"text-align:center;\"|3 ||style=\"text-align:center;\"|1 ||style=\"text-align:center;\"|1 ||style=\"text-align:center;\"|5", "|rowspan=\"3\"|17||rowspan=\"2\"|Kadeena Cox||||rowspan=\"2\"|2016||rowspan=\"2\"|F||1||1||1||rowspan=\"2\"|4"]}, {"page": "Jonnie Peacock", "response": ["Peacock was late addition to the British team for the postponed 2020 Summer Paralympics in Tokyo on 21 July 2021. The other additions were David Weir, Kadeena Cox and Libby Clegg."]}, {"page": "The Great British Bake Off", "response": ["| Kadeena Cox"]}, {"page": "List of A League of Their Own episodes", "response": ["|Chris RamseyKadeena Cox"]}, {"page": "The Church of Jesus Christ of Latter-day Saints in England", "response": ["In 2019, nearly 10,000 attendees from 42 countries attended RootsTech at the ExCeL London. Keynote speakers included Dan Snow, British historian and TV presenter, Paralympic gold medallist Kadeena Cox and entertainer Donny Osmond."]}]}}