{"wiki_id": "http://www.wikidata.org/entity/Q21664459", "itemLabel": "Thomas Glover", "itemDescription": "UK Labour Party politician (1862-1913)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Glover_(politician)", "wikipedia_page": {"main": "Thomas Glover (25 March 1852 – 9 January 1913) was a miner and Labour Party politician in the United Kingdom.\nHe was elected as the Member of Parliament (MP) for St Helens at the 1906 general election, defeating the sitting Conservative Party MP Henry Seton-Karr. He was re-elected in January 1910 with a reduced majority, but at the December 1910 general election he was defeated by the Conservative candidate Rigby Swift.Prior to standing for parliament Thomas Glover was a magistrate and miners agent for the St Helens district. In 1893 he issued a circular forcing all men to join the union and introducing monthly card checks. This action by a magistrate using J.P. initials was queried in parliament by Baron Henry De Worms but the home secretary found it not to be illegal.", "link_mentions": [{"page": "Thomas Glover", "response": ["Thomas Glover may refer to:", "*Sir Thomas Glover (diplomat), English Ambassador to the Ottoman Empire, 1606–1611", "*Thomas Glover (politician) (1852–1913), British Member of Parliament for St Helens, 1906–1910"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Thomas Glover, St Helens, 1906–10"]}, {"page": "List of MPs elected in the January 1910 United Kingdom general election", "response": ["| Thomas Glover"]}, {"page": "St Helens (UK Parliament constituency)", "response": ["| style=\"background-color: \" | || 1906 || Thomas Glover || Labour"]}, {"page": "Rigby Swift", "response": ["In January 1910, Swift ran for Member of Parliament for St Helens on the Conservative Party ticket. The seat had previously been Conservative-held, but since 1906 had been controlled by the Labour Party with a safe majority of 1,411 votes. Swift campaigned hard, but despite his work and a \"brilliant incursion\" by F. E. Smith, Swift was defeated 6,512 votes to 5,717, leaving the sitting Labour member (Thomas Glover) with a majority of 795.Fay (1938) p.23 Swift ran for the same seat again in the December election, the previous government having lasted only 11 months. The campaign was more hard-fought than the previous one, and was described as \"one of the fiercest elections ever contested in a red-hot constituency\". When the results were announced, Swift had won with 6,016 votes to Glover's 5,752, a narrow majority of 264.Fay (1938) p.24"]}, {"page": "Lancashire and Cheshire Miners' Federation", "response": [":1905: Thomas Glover"]}]}}