{"wiki_id": "http://www.wikidata.org/entity/Q21664711", "itemLabel": "Stewart Maiden", "itemDescription": "golfer (1886-1948)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stewart_Maiden", "wikipedia_page": {"main": "Stewart Maiden (February 13, 1886 – November 4, 1948) was the head golf professional at East Lake Golf Club in Atlanta, Georgia. He was best known for teaching grand slam winning golfer Bobby Jones.\n\n", "link_mentions": [{"page": "Bobby Jones (golfer)", "response": ["He was influenced by club professional Stewart Maiden, a native of Carnoustie, Scotland. Maiden was the professional at the Atlanta Athletic Club's East Lake Golf Club, who also trained Alexa Stirling, the three-time winner of the U.S. Women's Amateur, who was five years older than Jones but also a prodigy at East Lake. Jones also received golf lessons from Willie Ogg when he was in his teenage years. Jones played frequently with his father, a skilled player himself. The younger Jones sometimes battled his own temper on the course, but later controlled his emotions as he became more experienced. Jones toured the U.S. during World War I from 1917 to 1918, playing exhibition matches before large crowds, often with Alexa Stirling and Perry Adair, to generate income for war relief. Playing in front of such crowds in these matches helped him, as he moved into national competition a bit later on."]}, {"page": "Alexa Stirling", "response": ["She was coached in golf from a young age at the Atlanta Athletic Club's East Lake Golf Club course by Stewart Maiden, the club's professional, who had learned his golf at Carnoustie, Scotland. At age 13 her golf skills were already evident when on May 15, 1911, she was the low qualifier in the Women's Southern Golf Association championship."]}, {"page": "Bobby Jones: Stroke of Genius", "response": ["The scene changes to Atlanta, Georgia, where Jones, a young boy, observes his father \"Colonel\" Jones playing golf, poorly. The more young Bobby watches, the more he emulates the better players he sees, such as Stewart Maiden, a club professional originally from Scotland. By the time he is 14, Jones wins the 1916 Georgia State Amateur Championship and makes the quarterfinals of the U.S. Amateur that same year. Notable sportswriters of the era such as O.B. Keeler and Grantland Rice take a keen interest in him.", "* Alistair Begg – Stewart Maiden"]}, {"page": "East Lake Golf Club", "response": ["Other notable East Lake players around the same time were amateurs Watts Gunn, Perry Adair, Charlie Yates and Alexa Stirling Fraser many of whom were assisted by East Lake's golf professional Stewart Maiden."]}, {"page": "St. Louis Country Club", "response": ["In 1919, Stewart Maiden left East Lake Golf Club in Atlanta, Georgia, to fulfill a promise he made if St. Louis was awarded the 1921 U.S. Amateur. He remained at St. Louis through 1921 as head professional before returning to East Lake. At the 1921 U.S. Amateur, a 19-year-old Bobby Jones was a participant, though he lost in the quarterfinals to Englishman Willie Hunter, the recent winner of the British Amateur. The Jones-Hunter match was well played during the early holes. However, on the 8th hole - the club's Cape Hole, Jones attempted to drive over the trees, which guarded the right side of the fairway. When his ball clipped a tree, it fell into the creek running down the right side, losing the hole. He never recovered and Hunter went on to win the match 2 and 1. In the other quarterfinal matches, Charles 'Chick' Evans downed Jess Sweetser 1up, while Robert A. Gardner defeated Rudy Knepper 4 and 3, and Jess Guilford bettered Harrison Johnston 1 up. With Guilford winning 5 and 4 over Evans in the semifinals, and Gardner defeating Hunter 6 and 5, the Finals pairing was set. In the championship match, Guilford defeated Gardner 7 and 6.", "In 1925, the St. Louis hosted the U.S. Women's Amateur. Alexa Stirling (Fraser), the 1916, 1919 and 1920 champion and the 1922 champion Glenna Collett (Vare) reached the finals, with Collett winning the final match 9 and 8 over Stirling. Collett would go on to win a total of six U.S. Women's Amateur Championships, with the last coming in 1935. Stirling, a 3-time U.S. Women's Amateur Champion, was another of the East Lake \"whiz kids\" taught by Stewart Maiden. Collett was a member of the first Curtis Cup team in 1932 and served as Captain on four occasions. In 1975, she was inducted into the World Golf Hall of Fame."]}, {"page": "1913 Open Championship", "response": ["Qualifying took place on 19, 20, and 21 June. The top twenty and ties qualified on each of the three days. In windy conditions Laurie Ayton, Snr led the 21 qualifiers on the first day with a score of 152, with 159 as the qualifying score. Conditions were better on the second day and 156 was the qualifying mark; amateur Edward Blackwell led the 21 qualifiers with 147.  Jack Gaudin led the 23 qualifiers on the third day with 148, with 157 as the qualifying score. Seven American-based professionals entered but only two qualified, John McDermott and Tom McNamara. Mike Brady, Alex Campbell, Stewart Maiden, and Alex Smith failed on the first day, while John Jones failed on the third day."]}, {"page": "James Maiden", "response": ["Maiden was the son of James Maiden (1841–1914) and Elspeth Maiden née McLean (1845–1928). He left Scotland in 1901 and emigrated to the United States, became a naturalized citizen, and took a job as assistant under head professional Alex Smith at Nassau Country Club in Glen Cove, New York. His brother, Stewart Maiden (1886–1948), was also a golf professional whose base was at East Lake Golf Club at the Atlanta Athletic Club. Both of the Maiden brothers are credited with helping teach the golf swing to Bobby Jones. It was Stewart Maiden's smooth, silky swing that initially caught Jones' eye, and he said he tried to emulate Stewart's swing."]}, {"page": "Willie Ogg", "response": ["On April 26, 1919, Ogg was paired with the young Bobby Jones – who had taken lessons from Ogg – in an alternate shot match held at Druid Hills Golf Club against James Douglas Edgar and Perry Adair. At the time, Ogg was posted as head professional at East Lake Golf Club in Atlanta where he succeeded Stewart Maiden who accepted a position at St. Louis Country Club. Jones and Ogg, who had played golf together before, knew each other's game well whereas the pairing of Edgar and Adair did not. Ogg and Jones, who used their previous golf playing partnership to their advantage, were able to prevail in the match by the score of 1 up when Jones holed a putt on the final hole. In June 1919, Ogg partnered with Edgar in a best ball match and beat 17-year-old Jones who on that occasion was paired with Adair."]}]}}