{"wiki_id": "http://www.wikidata.org/entity/Q21716256", "itemLabel": "Deborah Frances-White", "itemDescription": "Australian-born British comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Deborah_Frances-White", "wikipedia_page": {"main": "Deborah Frances-White is a London-based comedian, author and screenwriter who also delivers corporate seminars on subjects including charisma, diversity and inclusion. She has both British and Australian citizenship. She hosts the podcasts Global Pillage and The Guilty Feminist. She uses the platform and network she has built through The Guilty Feminist to help multiple charities, especially relating to refugees and/or human rights.", "link_mentions": [{"page": "The News Quiz", "response": ["* Deborah Frances-White"]}, {"page": "List of feminists", "response": ["|1940– ||data-sort-value=\"Frances-White, Deborah Frances\"|Deborah Frances-White||Australia and Great Britain||20th century||–||Stand-up comedian; Feminist in the community of Ex-Jehovah's Witnesses||"]}, {"page": "List of Have I Got News for You episodes", "response": ["|Deborah Frances-White"]}, {"page": "Juliet Stevenson", "response": ["Stevenson's friends and frequent collaborators include director Robert Icke, comedian and feminist broadcaster Deborah Frances-White, poet Aviva Dautch and concert pianist Lucy Parham."]}, {"page": "The Spontaneity Shop", "response": ["The Spontaneity Shop, then known as The Old Spontaneity Shop was formed in 1996 by Tom Salinsky and Deborah Frances-White. Their first shows were at the Troubadour Coffee House in Earl's Court, and they moved to the Canal Cafe in 1999. From 1998-2000 they also ran shows and workshops at Oxford University."]}, {"page": "The Museum of Curiosity", "response": ["*Deborah Frances-White"]}, {"page": "List of Mock the Week episodes", "response": ["|Tom Allen, Deborah Frances-White and Rhys James"]}, {"page": "List of Welsh films", "response": ["2018: Say My Name was set on a Welsh island but filmed around Cardiff, directed by Deborah Frances-White."]}, {"page": "The Bugle", "response": ["|Deborah Frances-White"]}, {"page": "Marsha Shandur", "response": ["In 2016, Shandur co-authored the book Off The Mic: The World's Best Stand Up Comedians Get Serious About Comedy with Deborah Frances-White which came out on Bloomsbury Publishing. The book, about the mechanics of stand-up comedy, features new interviews with 42 comedians, including Eddie Izzard, Phill Jupitus, Sarah Millican, Jim Jefferies, Lewis Black and Marc Maron. The Independent called it \"Fascinating – part textbook, part therapist’s notebook.\" In December 2016, it was nominated for a Chortle Award."]}, {"page": "List of Question Time episodes", "response": ["|Robert Jenrick, Thangam Debbonaire, Hugh Osmond, Deborah Frances-White, John Bercow"]}, {"page": "List of Would I Lie to You? episodes", "response": ["|Raj Bisram and Deborah Frances-White"]}, {"page": "The Alternative Comedy Memorial Society", "response": ["* Deborah Frances-White"]}, {"page": "Monica Beletsky", "response": ["The best seller, The Guilty Feminist by Deborah Frances-White is dedicated to Beletsky and a few other influential people in the podcaster/author's life."]}, {"page": "Sadia Azmat", "response": ["In 2010, Azmat started performing stand-up comedy. She was given insight into how to develop a career through stand-up by professional comedian, Deborah Frances-White.", "In August 2011, she performed her debut show Please Hold – You're Being Transferred to a UK Based Asian Representative at the Edinburgh Fringe Festival at the Laughing Horse @ Finnegan's Wake, which was directed by Deborah Frances-White. In August 2011, Azmat also featured on BBC Radio 4's Front Row and a producer invited her to perform at the Cape Town Festival 2012."]}, {"page": "Richard Herring's interview podcasts", "response": ["|Deborah Frances-White"]}, {"page": "Emma Barnett", "response": ["In February 2021, one hundred public figures signed an open letter to the BBC, organised by Yassmin Abdel-Magied and Mariam Khan, criticising what they called Barnett's \"strikingly hostile\" interview of Zara Mohammed, the first woman and youngest person to be elected Secretary General of the Muslim Council of Britain, and saying that her line of questioning perpetuated “damaging and prejudicial tropes” about Islam and Muslim women. Signatories included Sayeeda Warsi, Diane Abbott, Naz Shah, Deborah Frances-White, Zarah Sultana, Apsana Begum, Faiza Shaheen, Nikesh Shukla, Jordan Stephens and Amina Wadud. Woman's Hour responded to the letter, stating that they would 'reflect' on the interview, but also noted that they believed it 'legitimate... to seek to explore some of the issues facing Muslims in the UK.' The columnist and writer Kenan Malik defended Barnett's approach, stating that it was typical of Barnett's 'abrasive' style and that 'her interruptions of Mohammed revealed a willingness to subject all her interviewees to the same treatment.'"]}, {"page": "Rose Matafeo", "response": ["She currently hosts the podcast Boners of the Heart with comedian and writer Alice Snedden on the Little Empire Podcast Network. She was a guest on Deborah Frances-White's The Guilty Feminist podcast and on the RHLSTP podcast with Richard Herring."]}, {"page": "Frances White", "response": ["*Deborah Frances-White, Australian-British comedy performer; co-founder in 1996 of The Spontaneity Shop "]}, {"page": "Sofie Hagen", "response": ["From December 2015 to December 2016, Hagen co-hosted The Guilty Feminist podcast with Deborah Frances-White."]}, {"page": "Alex Edelman", "response": ["His show \"Millennial\" won the Edinburgh Comedy Award for Best Newcomer at the 2014 Edinburgh Festival Fringe, the first American to do so since Arj Barker won in 1997. Edelman's 2015 Edinburgh Fringe show was titled \"Everything Handed to You\", and was the second most well-reviewed show at that year's festival. His 2018 show, Just For Us, was nominated for the Best Show award at the Edinburgh Fringe. He has appeared in the UK on television shows such as The John Bishop Show, Alan Davies: As Yet Untitled, Live from the BBC, Roast Battle, and contributed several anecdotes about his experiences as a comedian to the 2015 book Off the Mic, by Deborah Frances-White and Marsha Shandur. He has done a BBC Radio 4 comedy series called \"Alex Edelman's Peer Group\"."]}, {"page": "The Guilty Feminist", "response": ["The Guilty Feminist is a feminist comedy podcast hosted by Deborah Frances-White. Created by Frances-White and Sofie Hagen in 2015, the podcast features guests on a panel to discuss topics on and related to feminism, and is recorded in front of a live audience.", "The podcast was created by Deborah Frances-White and Sofie Hagen in December 2015. The idea for the podcast came from the pair having lunch together and often sharing their hypocrisies and double standards with each other. Hagen and Frances-White co-hosted the podcast until September 2016 when Hagen left. Since then a range of guests have co-hosted each episode. The podcast is recorded in front of a live audience and each episode lasts approximately 45 minutes."]}, {"page": "Catherine Bohart", "response": ["She has appeared on TV on The Blame Game, The Stand Up Sketch Show, The Mash Report, Roast Battle, 8 Out of 10 Cats, Alan Davies: As Yet Untitled, Jon Richardson: Ultimate Worrier, Richard Osman's House of Games, and Mock the Week. She is a frequent guest on Deborah Frances-White's The Guilty Feminist podcast. In 2019, Bohart hosted the \"Funny from the Fringe\" podcast for BBC Radio 4 Extra."]}, {"page": "Deborah Frances White", "response": ["#REDIRECT Deborah Frances-White"]}, {"page": "List of Mock the Week panellists", "response": ["| style=\"text-align:left;\" |Deborah Frances-White"]}, {"page": "Say My Name (film)", "response": ["Say My Name is a 2018 comedy film directed by Jay Stern and written by Deborah Frances-White. It starred Lisa Brenner, Nick Blood and Mark Bonnar and was released on 14 October 2018  at the Liverpool International Film Festival."]}, {"page": "Denis Semionov", "response": ["thumb|A graphic piece for Jean-Michel Jarre VR show \"Welcome to the other side\"Semionov generally uses virtual art. In 2017 his VR art project “Between Petrov and Vodkin” about Russian avant-garde was demonstrated at Marché du Film and bought by several studios for distribution. In 2018 he won grand-prix at Open Frame Award of international film festival goEast for his VR cinematographic project “The Nominal Empire”, which was drawn in virtual reality in Oculus Quill. The interactive project combined virtual reality and biomechanics of Vsevolod Meyerhold. In 2019 Denis Semionov became one of five artists who created art pieces during WorldSkills 2019 opening on the 45 000 stadium Kazan arena in collaboration with a speaker Pranav Mistry and a singer Yolka. The project “Lessons of Auschwitz”, where Denis Semionov became an artist and a director, was made with Volumetric video, Tilt Brush and the music of the theremin, created by a musician Peter Theremin. The immersive story, devoted to 75th anniversary of Liberation of Auschwitz concentration camp, won such awards as Webby Award 2020, Red Dot and was shortlisted in Vancouver International Film Festival in the section Immersed Volumetric XR Market. The XR theatre performance \"Flame\", featured a dancer Samantha Alcon, was premiered at the festival NewImages by Forum des images in Paris  and was selected for the immersive section of Raindance Film Festival. The collaboration with Jean-Michel Jarre for the New Year 2021 concert \"Welcome to the Other Side\", which got 75 million viewers online and in VR, featured illustrative Notre-Dame de Paris, made in Oculus Quill. Semionov collaborated with such musicians and performers as Jean-Michel Jarre, Deborah Frances-White, institutions - Venice Biennale, Institut Français, Arts Council England, Deutsches Filminstitut, Forum des Images, Jewish Museum and Tolerance Center, brands – Leica, Samsung, Estée Lauder, Absolut"]}, {"page": "Bisha K. Ali", "response": ["Ali has written for The Huffington Post, and co-presented The Guilty Feminist podcast with Deborah Frances-White and GrownUpLand for BBC Radio 4."]}, {"page": "Zara Mohammed", "response": ["Subsequently, an open letter was published criticising Barnett's line of questioning and tone during the interview. Signatories included politicians Sayeeda Warsi and Diane Abbott, writer Yassmin Abdel-Magied and comedian Deborah Frances-White. A BBC spokesperson said the corporation would reply \"in due course\"."]}, {"page": "British Podcast Awards", "response": ["* The Guilty Feminist - Deborah Frances-White"]}]}}