{"wiki_id": "http://www.wikidata.org/entity/Q21708262", "itemLabel": "Simon Winder", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Winder", "wikipedia_page": {"main": "Simon Winder is a British writer. He is the author of several books, including a trilogy of books on the history of Central Europe: Germania, Danubia and Lotharingia. The second book in the trilogy, Danubia, which deals with the Habsburg monarchy, was longlisted for the Samuel Johnson Prize. His books about Central Europe mix historical writing with autobiographical reflections on his travels in various countries in the region. The title of his book Germania evokes both the Roman term for the area inhabited by the Germanic peoples, and the personification of the German nation, also known as Germania. His book Lotharingia explores the culture and legacy of the historical kingdom of Lotharingia, which encompassed the present-day territory of various European countries, including France, Netherlands and Germany.\nHis books have been praised for their humour and learning.Winder is a publishing director at Penguin Books. He has written for The Guardian. He lives in Wandsworth Town in London.", "link_mentions": [{"page": "Dr. No (novel)", "response": ["The writer Simon Winder believes that because Fleming was writing about Jamaica, the result was \"perhaps the most attractive of all the Bond books—the most relaxed, the most fiendish, the most confident\". According to the literary analyst LeRoy L. Panek, in his examination of 20th century British spy novels, Fleming knew his outdated view of Jamaica would soon be overtaken by events—as evidenced by the novel's description of how the Queen's Club would be lost during independence struggles. According to the cultural historian Michael Denning, this acknowledgement of the end-of-empire leads to a \"sense of doom\" that is the result of \"a shadow of real history hanging over the stories\"."]}, {"page": "Lotharingia", "response": ["* Ascherson, Neal, \"A Mess of Tiny Principalities\" (review of Simon Winder, Lotharingia: A Personal History of Europe's Lost Country, Farrar, Straus, and Giroux, 2019, 504 pp.), The New York Review of Books, vol. LXVI, no. 20 (19 December 2019), pp. 66–68."]}, {"page": "Germania (disambiguation)", "response": ["* a book on German culture by Simon Winder"]}, {"page": "Penguin Classics", "response": ["The first 20 books were released in May 2016, and described by publishing director Simon Winder as \"a mix of the famous and the unjustly overlooked\"."]}, {"page": "Neal Ascherson", "response": ["*\"A Mess of Tiny Principalities\" (review of Simon Winder, Lotharingia: A Personal History of Europe's Lost Country, Farrar, Straus, and Giroux, 2019, 504 pp.), The New York Review of Books, vol. LXVI, no. 20 (19 December 2019), pp. 66–68."]}, {"page": "Edward Stanford Travel Writing Awards", "response": ["* Simon Winder, Lotharingia", "* Simon Winder, Germania: In Wayward Pursuit of the Germans and Their History"]}, {"page": "War Horse (film)", "response": ["Conversely, Simon Winder of The Guardian wrote that the film, \"despite twisting and turning to be even-handed, simply could not help itself and, like some faux-reformed alcoholic, gorged itself on an entire miniature liqueur selection of Anglo-German clichés\". David Denby of The New Yorker wrote that \"The horses themselves are magnificent, and maybe that's reason enough to see the movie. But War Horse is a bland, bizarrely unimaginative piece of work\"."]}, {"page": "The Almost Nearly Perfect People", "response": ["Booth undertook four years of research while writing the book, including travelling to each of the countries and interviewing prominent political and cultural figures of each nationality. In writing about each country, he tried to examine both their successes and their weaknesses to \"rebalance the utopian view\" of Scandinavia held by many British people and to present a different perspective of the region than the extremely positive depiction in a lot of British media. The tone of the book was inspired by Simon Winder's Germania, which combines humour with an historical and travel-based narrative."]}, {"page": "Pocket Penguins", "response": ["Pocket Penguins is a series of books released by Penguin Classics in 2016. The series echoes the style of the original Penguin Books, with smaller A-format size, and tri-band design. The first 20 books were released in May 2016, and described by publishing director Simon Winder as \"a mix of the famous and the unjustly overlooked\". A Pocket Penguins series of 70 titles was published to celebrate Penguin's 70th birthday in 2005. It is known as the Pocket Penguins 70s and is available as a boxed set. A similar set of pocket Penguin 60s - this time only 60 books, each with 60 pages - was published to mark the company’s 60th birthday in 1995."]}, {"page": "Danubia (disambiguation)", "response": ["* Danubia, a book by Simon Winder about the Habsburg monarchy"]}]}}