{"wiki_id": "http://www.wikidata.org/entity/Q21787685", "itemLabel": "Trevor Davies", "itemDescription": "British basketball player", "wikipedia_url": "https://en.wikipedia.org/wiki/Trevor_Davies", "wikipedia_page": {"main": "Trevor Davies (1928 – 22 September 2012) was a British basketball player. He competed in the men's tournament at the 1948 Summer Olympics.", "link_mentions": [{"page": "Climatic Research Unit", "response": ["Hubert Lamb retired in 1978. His successors were Tom Wigley (1978–1993), Trevor Davies (1993–1998), Jean Palutikof and Phil Jones (jointly 1998–2004), Phil Jones (2004–2016), and Tim Osborn (from January 2017); Peter Liss was acting director during investigations between December 2009 and July 2010. In 1984, the unit moved to a new cylindrical building designed by Rick Mather. In 2006, this was named the Hubert Lamb Building in honour of the first director."]}, {"page": "Nebelhorn Trophy", "response": ["| 1974 ||  Judi Genovesi / Kent Weigle ||  Odette Tolman / Trevor Davies ||  Jennifer Thompson / Derek Tyers || "]}, {"page": "Great Britain men's national basketball team", "response": ["3 Lionel Price, 4 Robert Norris, 5 Stanley Weston, 6 Trevor Davies, 7 Malcolm Finlay, 8 Colin Hunt, 9 Frank Cole, 10 Douglas Legg, 11 Ronald Legg, 12 Harry Weston, 13 Alex Eke, 14 Stanley McMeekan, 15 Sydney McMeekan (Coach: Malcolm Finlay)"]}, {"page": "Climatic Research Unit documents", "response": ["Pro-Vice Chancellor of Research at the University of East Anglia, Trevor Davies, said that no data were deleted or \"otherwise dealt with in any fashion with the intent of preventing the disclosure\". In response to allegations that CRU avoided obligations under the UK Freedom of Information Act, independent investigator Muir Russell plans to review CRU's \"policies and practices regarding requests under the Freedom of Information Act\"."]}, {"page": "Grand Prix International St. Gervais", "response": ["| 1978 ||  Kim Krohn / Barry Hagan ||  Karen Barber / Kim Spreyer ||  Tandy Buxton / Trevor Davies || "]}, {"page": "Trevor C. Davies", "response": ["#REDIRECTTrevor Davies"]}]}}