{"wiki_id": "http://www.wikidata.org/entity/Q2176721", "itemLabel": "Caroline Catz", "itemDescription": "British film, television, theatre and radio actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Caroline_Catz", "wikipedia_page": {"main": "Caroline Catz (née Caplan) is an English film, television, narrator, theatre, and radio actress, best known for her role as Louisa Glasson in Doc Martin since 2004. Her other roles have included Detective Inspector Kate Ashurst in Murder in Suburbia, Detective Inspector Helen Morton in DCI Banks, and PC Cheryl Hutchins in The Vice.", "link_mentions": [{"page": "Delia Derbyshire", "response": ["In 2017, a short film by Caroline Catz, Delia Derbyshire: The Myths And The Legendary Tapes (2017) was screened at the BFI London Film Festival. It has been expanded into a feature-length movie that debuted in October 2020."]}, {"page": "Murder of Wendy Sewell", "response": ["The case was featured in the 2004 BBC drama In Denial of Murder in which Jason Watkins played Stephen Downing and Caroline Catz played Wendy Sewell. BBC Press Office 2/2/04"]}, {"page": "Top Girls", "response": ["A 2011 revival at Chichester Festival Theatre, co-produced with Out of Joint and directed by the play's original director Max Stafford-Clark transferred to Trafalgar Studios in the West End, opening on 16 August 2011. The cast included Suranne Jones, Stella Gonet, Olivia Poulet, Lucy Briers, Laura Elphinstone, Lisa Kerr and Catherine McCormack. This production toured in the UK in early 2012, with a new cast including Caroline Catz as Marlene."]}, {"page": "Ben Miller", "response": ["Miller played the role of Murray in the six-part BBC sitcom I Want My Wife Back, starring alongside Caroline Catz. In 2016 he appeared in the Channel 4 comedy Power Monkeys."]}, {"page": "Stephanie Cole", "response": ["From 2004 to 2009, Cole appeared with Martin Clunes and Caroline Catz in the ITV comedy-drama, Doc Martin as Joan Norton, aunt of Clunes' character Dr Martin Ellingham. In 2006, Cole starred with Victoria Wood in the BAFTA award-winning World War II drama Housewife, 49 as Mrs Waite, the local head of what was then the WVS. Cole also had a small role in the 2008 romantic comedy Miss Pettigrew Lives for a Day as Miss Pettigrew's grumpy boss, Miss Holt."]}, {"page": "Doc Martin", "response": ["A major theme throughout the series is Ellingham's relationship with primary schoolteacher (eventually school headmistress) Louisa Glasson (Caroline Catz). Due to his difficulty in expressing feelings and his insensitive nature, the relationship has many ups and downs; though they eventually have a child and later marry.", "* Caroline Catz as Louisa Ellingham (née Glasson) – teacher at Portwenn Primary School, later becomes school headmistress"]}, {"page": "Michael Higgs", "response": ["He is married to actress Caroline Catz, whom he met on the set of The Bill. They have a son who was born in 2001 and a daughter who was born in 2006."]}, {"page": "List of female detective characters", "response": ["* Kate \"Ash\" Ashurst (played by Caroline Catz) is a Detective Inspector on ITV series Murder in Suburbia (2004–05)."]}, {"page": "The Gorillas", "response": ["Later Hector worked as a cleaner at the Royal Geographical Society, and was the subject of a documentary film in 2008, A Message To The World, directed by Caroline Catz, which was shown as part of the Raindance festival, and at the Barbican as part of its \"Pop Mavericks\" season.\"Rockumentary Celebrates The Genius Of Jesse Hector\", The Quietus, 26 September 2008"]}, {"page": "Hotel Babylon (BBC series)", "response": ["* Caroline Catz"]}, {"page": "Don Hale", "response": ["Hale's work on the case eventually helped to force a change in both European and British law, allowing any prisoner, particularly in denial of murder (IDOM) and/or convicted of any serious offence, to be allowed to appeal for parole consideration directly to the Parole Board. Downing's case was one of three test cases originally presented to the European Court of Human Rights by barrister Edward Fitzgerald. After several years of debate and despite a late appeal from the British Government, the case went in Downing's favour and he received £500 in compensation. When the murder conviction was later quashed, Downing also received over £900,000 in compensation. Hale's book about the Stephen Downing appeal case, Town Without Pity, became a best-seller. It was adapted into a BBC TV drama starring Stephen Tompkinson and Caroline Catz called In Denial of Murder. In 2016 Judge Robert Rinder featured Hale's book and his quest for justice within a one-hour special on ITV 1 for Judge Rinder's Crime series. The show was repeated in July 2018. Taking part were Hale, Stephen Downing and a cold case detective Chris Clark, who believes Wendy Sewell, the victim in the Bakewell murder, for which Downing was eventually cleared, may have been another victim of the notorious Yorkshire Ripper Peter Sutcliffe."]}, {"page": "Matlock Mercury", "response": ["The case, and Don Hale's campaign, was featured in the 2004 BBC drama In Denial of Murder in which Stephen Tompkinson played Don Hale and Caroline Catz played Wendy Sewell."]}, {"page": "List of The Bill characters", "response": ["| Rosie Fox || Caroline Catz || 1998-2000 || style=\"text-align:center;\"|10 || P.C. (1998) /D.S. (1999-2000)"]}, {"page": "Great Lives", "response": ["|Caroline Catz, actor"]}, {"page": "The Vice (TV series)", "response": ["The Vice is an ITV police drama about the Metropolitan Police Vice Unit, which ran for five series of varying lengths between 1999 and 2003. The main cast included Ken Stott, Caroline Catz and David Harewood, as well as Rosie Marcel, Marc Warren and Tim Pigott-Smith. The show experimented with different formats, two series of two-part, one-hour episodes; two series of ninety-minute episodes, and then a final series of self-contained one-hour episodes. The Portishead track \"Sour Times\" was used as the theme music to the show.", "| Caroline Catz"]}, {"page": "All Quiet on the Preston Front", "response": ["*Private Dawn Lomax, a trainee teacher (although she later leaves college) and new recruit to the transport section, Eric's girlfriend (later wife) (Caroline Catz)"]}, {"page": "Murder in Suburbia", "response": ["Murder in Suburbia is a British television drama series first broadcast on ITV on 13 March 2004. The series focuses on the work of DS Emma Scribbins (Lisa Faulkner) and DI Kate Ashurst (Caroline Catz), police detectives assigned to the murder squad of the fictional suburban English town of Middleford. In this capacity, they are supervised by DCI Jeremy Sullivan (Jeremy Sheffield).", "Rupert Smith of The Guardian said of the second series premiere; \"Dramas about murdered schoolgirls aren't usually my cup of gore, but this was played so much for laughs that I could almost forgive the opening scene of a terrified child running through a graveyard before meeting her killer's blade. Thereafter it spun cheerfully along as a tale of rural witchcraft, complete with a wise priest who kept a book about demonology on his lectern; I don't know what the Synod would have to say about that. There were hex dolls, blood rituals and quite a lot of firm naked flesh on display, which made Murder in Suburbia comfortingly like an ancient Hammer movie. Caroline Catz and Lisa Faulkner remained well-dressed and wisecracking throughout; more importantly, the show gave work to Clare Clifford, whom I worshipped as homely Shirley in Angels all those years ago.\"", "* Caroline Catz as Detective Inspector Kate Ashurst (\"Ash\")"]}, {"page": "The Bill (series 15)", "response": ["The series was primarily dominated by individual, stand-alone episodes, but serialised plots were also included after being introduced by Richard Handford when he arrived in the previous series; while some of those were multi-part plots that ran over 2-4 episodes, the serialised element of series 15 saw some plots last a majority of the year. They included a brutal stabbing attack on PC Dave Quinnan in the spring, which led to the introduction of Nurse Jenny Delaney, whose love triangle with Quinnan and PC George Garfield led to the exit of Garfield after Huw Higginson's 10-year stint in the role; Quinnan's stabbing was also re-visisted almost a year after his stabbing in series 16. Also carrying into the following year was the arrest of PC Eddie Santini, which in turn was a continuation of his plot involving actor Michael Higgs' off-screen partner Caroline Catz from the previous year, PC Rosie Fox returning as a DS several months after being bullied out of Sun Hill following a campaign by Santini; this plot ended in the spring but was revisited a year later for Santini's trial."]}, {"page": "David Belton", "response": ["* 2007, executive producer, Windscale: Britain’s Biggest Nuclear Disaster, TV documentary narrated by Caroline Catz."]}, {"page": "List of stage names", "response": ["Caroline Catz – Caroline Caplan"]}, {"page": "Lisa Faulkner", "response": ["In the TV show Spooks, her character Helen Flynn was killed off in only the second episode of the first series, having her hand and face burnt in a deep fat fryer before being shot in the head at point-blank range.\"Spooks: The show that is James Bond on a BBC budget\", The Telegraph, 4 December 2008 In 2004, she starred on ITV as D.S. Emma Scribbins (\"Scribbs\") in Murder in Suburbia, in which she played a CID policewoman in company with Caroline Catz, who played her boss, D.I. Ashurst. The show returned for a second series in 2005, with Scribbs adopting the then popular fashion style of \"boho-chic\". In 2006, she starred in the TV series New Street Law. From June 2008, Faulkner narrated the BBC One show Heir Hunters, replacing Nadia Sawalha, until 2017.productions/2008  Flame TV productions"]}, {"page": "Dig, Lazarus, Dig!!!", "response": ["An extended promotional video for \"Night of the Lotus Eaters\" was also released along with a live studio video of \"Midnight Man\" and a promotional video for \"More News From Nowhere\", all directed by artists Iain Forsyth and Jane Pollard. The \"More News From Nowhere\" video released in May 2008, features cameo appearances by journalist Will Self, singer Beth Orton, British TV actors Karl Theobald, Michael Higgs and Caroline Catz plus British artists Tim Noble and Sue Webster and socialite/ broadcaster Peaches Geldof."]}, {"page": "Rosie (given name)", "response": ["* Rosie Fox, in the ITV drama The Bill, played by actress  Caroline Catz"]}, {"page": "Iain Forsyth and Jane Pollard", "response": ["In 2009 they were commissioned by the British Film Institute to produce a new work for the BFI Gallery (the contemporary art space at BFI Southbank) called \"Radio Mania: An Abandoned Work\"  a multi-screen 3D video installation featuring Kevin Eldon, Caroline Catz, Terrence Hardiman and Fenella Fielding with Martians played by Ben Crompton, Iain Lee and Ben Moor. The project was curated by Elisabetta Fabrizi, who invited the artists to access the BFI National Archive of film and television, the largest of its kind in the world, to create a new commission.Fabrizi, Elisabetta (ed), 'The BFI Gallery Book', BFI, London 2011, pp.159-170Fabrizi, Elisabetta, 'Is this Cinema? Am I right to keep on Trying?' in 'Artists Moving image in Britain since 1989', edited by Balsom, Erika, Perks, Sarah, Reynolds,Lucy, Paul Mellon/Yale University Press, London 2019."]}, {"page": "Catz (disambiguation)", "response": ["* Caroline Catz (born Caroline Caplan), an English actress"]}, {"page": "More News from Nowhere", "response": ["\"More News from Nowhere\" is the 28th single by Australian rock band Nick Cave and the Bad Seeds and the second single from the album Dig, Lazarus, Dig!!!. The song has a melodic similarity to \"Deanna\" from the 1988 album Tender Prey and the song also mentions the character of Deanna. The title is a reference to novel News From Nowhere by William Morris. The \"narrative\" of the song follows that of the Odyssey, using modern names for the gods and nymphs in the original. The video was directed by British artists Iain Forsyth and Jane Pollard, who also directed videos for the other singles from this album. It was filmed at the Raymond Revuebar and featured cameo appearances from author Will Self, actors Michael Higgs, Caroline Catz and Karl Theobald, socialite Peaches Geldof, singer/songwriter Beth Orton, British artists Tim Noble and Sue Webster and bass player for The Wonder Stuff Mark McCarthy along with a number of burlesque dancers. The video was cut to the full-length album version of the song, running to over seven minutes."]}, {"page": "List of British actors", "response": ["* Caroline Catz (born 1969)"]}, {"page": "List of fictional police detectives", "response": ["* Detective Inspector Helen Morton - (Played by Caroline Catz in DCI Banks)"]}, {"page": "The Guilty (2000 film)", "response": ["The Guilty is a 2000 American crime film directed by Anthony Waller and starring Bill Pullman, Devon Sawa, Gabrielle Anwar, Angela Featherstone and Joanne Whalley. The film is a remake of the 1992 UK TV two-part telemovie of the same name and identical plot starring Michael Kitchen, Sean Gallagher, Caroline Catz and Carol Starks."]}, {"page": "In Denial of Murder", "response": ["In Denial of Murder is a two-part British television crime drama series, written by Neil McKay and directed by David Richards, that first broadcast on BBC One on 29 February 2004. The series follows investigative journalist Don Hale (Stephen Tompkinson) as he attempts to prove that convicted murderer Stephen Downing (Jason Watkins) was wrongly convicted for the murder of Wendy Sewell (Caroline Catz) in 1973.", "* Caroline Catz as Wendy Sewell"]}, {"page": "Toby Swift", "response": ["| Caroline Catz and Philip Whitchurch", "| Caroline Catz, Ann Mitchell, Tanya Franks, Gerard Horan, Mark Lewis Jones and Harry Myers", "| Geoffrey Streatfeild, Caroline Catz, Sasha Pick and Laurel Lefkow"]}, {"page": "DCI Banks", "response": ["ITV commissioned a second series. Filming began in March 2012, and episodes began broadcasting from 10 October. For this series, the novels Dry Bones that Dream, Innocent Graves and Strange Affair were adapted. With Andrea Lowe on maternity leave, Stephen Tompkinson was joined by Caroline Catz as DI Helen Morton, a character not in the novels.  Sally Haynes, head of the ITV drama commissioning, said of the second series: \"DCI Banks is now established as a firm favourite within ITV's crime drama slate. We're delighted so many viewers are appreciating Robert Murphy’s adaptations and how the team at Left Bank Pictures are producing DCI Banks.\"", "| Caroline Catz || Helen Morton || Detective Inspector || Major Crimes Deputy S.I.O. || || colspan=\"4\" style=\"background:#e0ffff; text-align:center;\"| Main || 2.01—5.06 || 24"]}, {"page": "Caroline (given name)", "response": ["*Caroline Catz, English film, television, narrator, theatre and radio actress"]}, {"page": "Lu Kemp", "response": ["| Caroline Catz, Karim Saleh, Richard Sanda, Hovnatan Avedikian, Chris Pavlo and Helen Longworth"]}, {"page": "List of Elstree Studios productions", "response": ["| The Vice || Police drama || Carlton, Touchpaper Television || 5 || 28 || 1999—2003 || Roger Gartland || Caroline Catz, David Harewood, Ken Stott"]}, {"page": "Screen Two", "response": ["Cast: Caroline Catz, Seamus Gibbins, Barnaby Stone, Joseph Long, Paloma Baeza, Rachel Inman, Reece Baani, Alice Mathews, Pia Mathews, Chattie Salaman, Matt Patresi, Daniel Brewer, Kelly Hunter, Katrin Cartlidge, Edward Atterton, Alan Cooke, Titus Forbes-Adam, John Sandford, Peter Tate, Khaki, Sandra Voe, Christopher Simon, Matthew Scurfield and Tom Faber"]}]}}