{"wiki_id": "http://www.wikidata.org/entity/Q2170914", "itemLabel": "Roy Swinbourne", "itemDescription": "Professional footballer (1929-2015)", "wikipedia_url": "https://en.wikipedia.org/wiki/Roy_Swinbourne", "wikipedia_page": {"main": "Royston Harry \"Roy\" Swinbourne (25 August 1929 – 27 December 2015) was an English footballer who played as a centre forward in the Football League for Wolverhampton Wanderers. He was capped once by England B.", "link_mentions": [{"page": "Wolverhampton Wanderers F.C.", "response": ["*  Roy Swinbourne"]}, {"page": "Kinver", "response": ["* Roy Swinbourne (1929–2015) an English footballer who played centre forward for Wolverhampton Wanderers F.C., lived in Kinver"]}, {"page": "Dennis Wilshaw", "response": ["Thanks to greats such as Jesse Pye and Roy Swinbourne, it took until the 1952–53 for Wilshaw to establish himself in the first team; he bagged 18 goals in 30 games that season. He was a part of the Wolves side that won the league in 1953–54. The club's top-scorer with 25 of Wolves' 96 league goals that season, he described the players poor relationship with manager Stan Cullis, claiming that the club's team spirit was good \"because we all hated his guts\". They came close to securing the title again in 1954–55, but instead finished four points behind Chelsea. Wilshaw became more of a squad member in the 1955–56 and 1956–57 campaigns, playing 46 games across both seasons. In his time, Wolves were one of the greatest teams in the world and he played in victories over Spartak Moscow, Dynamo Moscow, Valencia, Honvéd and Real Madrid. In his time at Molineux, he managed a total of 117 goals in 232 matches for the club."]}, {"page": "List of Wolverhampton Wanderers F.C. records and statistics", "response": ["|10||align=\"left\"| Roy Swinbourne||1945–1957||107||5||0||0||2||114"]}, {"page": "List of Wolverhampton Wanderers F.C. seasons", "response": ["|align=left|Roy Swinbourne", "|align=left|Roy Swinbourne"]}, {"page": "1954 FA Charity Shield", "response": ["|||9 || Roy Swinbourne "]}, {"page": "1953–54 Wolverhampton Wanderers F.C. season", "response": ["|Roy Swinbourne", "|Roy Swinbourne"]}, {"page": "1954–55 Wolverhampton Wanderers F.C. season", "response": ["Roy Swinbourne\t36\t4\t1\t41"]}, {"page": "Wolverhampton Wanderers F.C. v Budapest Honvéd FC", "response": ["At the time, Wolverhampton Wanderers were the champions of England, having won their first ever championship in the 1953–54 season, and were top of the league by one point in the 1954–55 season. Managed by Stan Cullis and captained by England captain Billy Wright, Wolverhampton scored 96 goals as they won the title four points clear of rivals West Bromwich Albion, with Dennis Wilshaw, Johnny Hancocks, and Roy Swinbourne all scoring over 20 goals each.", "Wolverhampton struggled in the opening stages to control Budapest Honvéd's \"deceptive, constantly changing tactics\", which ranged from attacking via the wings, to hitting the ball long, then changing to short passing, with Wolverhampton goalkeeper Bert Williams withstanding the pressure. Honvéd were 2–0 in front after 14 minutes; first, Sándor Kocsis headed in a Ferenc Puskás free-kick given for a foul by Ron Flowers, and the second came after a ball played down the right wing found Kocsis, who played in Ferenc Machos for a \"cleverly placed shot\". Wolverhampton had a series of chances through Flowers, Dennis Wilshaw, Peter Broadbent, Roy Swinbourne, and Les Smith, but Honvéd goalkeeper Lajos Faragó was able to keep the ball out.", "|CF ||9 || Roy Swinbourne", "Wolverhampton goalscorer Roy Swinbourne said afterwards that \"Wolves never played a match in which there was so much pride involved\", while his manager Stan Cullis and sections of the English press declared his team as \"champions of the world\", and that Wolves had proven that English football was \"the genuine, original, unbeatable article... still the best of its kind in the world\", statements which journalist Willy Meisl disagreed with, calling the Molineux pitch a \"quagmire\", and citing a recent Honvéd defeat to Crvena Zvezda. Another journalist, Gabriel Hanot, also disagreed with the viewpoint put forth, claiming that Wolverhampton were inferior to Spanish team Real Madrid and Italian team A.C. Milan, suggesting \"a European championship be organised between clubs\" to give clubs the opportunity to prove they were the greatest."]}, {"page": "2015 in the United Kingdom", "response": ["**Roy Swinbourne, 86, footballer (Wolverhampton Wanderers)."]}, {"page": "2015–16 in English football", "response": ["* 27 December 2015: Roy Swinbourne, 86, Wolverhampton Wanderers forward."]}, {"page": "Deaths in December 2015", "response": ["*Roy Swinbourne, 86, English footballer (Wolverhampton Wanderers)."]}]}}