{"wiki_id": "http://www.wikidata.org/entity/Q21716327", "itemLabel": "John Rowett", "itemDescription": "British historian and academic administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Rowett", "wikipedia_page": {"main": "Dr John Rowett OBE is a British historian and academic administrator. He has served as Fellow and Tutor in History at Brasenose College, Oxford; as Warden of Rhodes House, Oxford (1999–2004); and as Secretary-General of the Association of Commonwealth Universities (2004–07).)As Warden of Rhodes House at the time of the centenary of the Rhodes Trust in 2003, Dr Rowett was active, alongside Rhodes Trust chair Lord Waldegrave of North Hill, in the creation of the Mandela Rhodes Foundation, bringing together Nelson Mandela and the Rhodes Trust in a foundation providing scholarships to promote good leadership in Africa. In 2005, he received an OBE for his contribution to relations between Britain and South Africa. Critical assessments of Dr Rowett's leadership of the Rhodes Trust have been made by writers such as R.W. Johnson.Dr Rowett is known as a historian of modern Britain and the United States. He co-founded and edited the journal Twentieth Century British History, and co-edited the English Historical Review. He was active in the creation of the Rothermere American Institute in the University of Oxford.", "link_mentions": [{"page": "Rhodes Scholarship", "response": ["In 2015, Rhodes Scholar R. W. Johnson published a critical account of the decline of the Rhodes Trust under its warden, John Rowett, and commended its recovery under wardens Donald Markwell and Charles R. Conn.R. W. Johnson, Look Back in Laughter: Oxford's Postwar Golden Age, Threshold Press, 2015, especially pages 195-220."]}, {"page": "Rhodes House", "response": ["* Former Wardens of Rhodes House – Sir Francis Wylie, Sir Carleton Allen, Sir Edgar Williams, Dr Robin Fletcher, Sir Anthony Kenny, Dr John Rowett, Sir Colin Lucas, and Professor Donald Markwell. ", "*Dr John Rowett 1999–2004", "* R.W. Johnson. Look Back in Laughter: Oxford's Postwar Golden Age (Threshold Press, 2015); 260 pp. . Has a critical account of the decline of the Rhodes Trust under Warden John Rowett, and commends recovery under Wardens Donald Markwell and Charles R. Conn."]}, {"page": "Rowett, John", "response": ["#redirectJohn Rowett"]}]}}