{"wiki_id": "http://www.wikidata.org/entity/Q21705110", "itemLabel": "Paul Fouracre", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Fouracre", "wikipedia_page": {"main": "Paul J. Fouracre is professor emeritus of medieval history at the University of Manchester. His research interests relate to early medieval history, the history of the Franks, law and custom in medieval societies, charters, hagiography and serf-lord relations in the eleventh century.  His recent work on the cost of the liturgy, focusing on the social and economic effects of providing \"eternal light\", is a study of the interplay between belief and materiality.Fouracre was co-ordinating editor of Early Medieval Europe from 2005 to 2009 and editor of the first volume of The New Cambridge Medieval History (2005). From 2014 to 2017 he was editor of the Bulletin of the John Rylands Library. He is a Member of the Chetham Society, serving as a Member of Council since 2004 and as President since 2005.", "link_mentions": [{"page": "Charles Martel", "response": ["Whatever the precise circumstances were, it is clear that an army under the leadership of Abd al-Rahman al-Ghafiqi headed north, and after some minor engagements marched on the wealthy city of Tours. According to British medieval historian Paul Fouracre, \"Their campaign should perhaps be interpreted as a long-distance raid rather than the beginning of a war\". They were, however, defeated by the army of Charles at a location between Tours and Poitiers, in a victory described by the Continuations of Fredegar. News of this battle spread, and may be recorded in Bede's Ecclesiastical History (Book V, ch. 23). However, it is not given prominence in Arabic sources from the period.", "Earlier in his life Charles Martel had many internal opponents and felt the need to appoint his own kingly claimant, Chlotar IV. Later, however, the dynamics of rulership in Francia had changed, and no hallowed Merovingian ruler was required. Charles divided his realm among his sons without opposition (though he ignored his young son Bernard). For many historians, Charles Martel laid the foundations for his son Pepin's rise to the Frankish throne in 751, and his grandson Charlemagne's imperial acclamation in 800. However, for Paul Fouracre, while Charles was \"the most effective military leader in Francia\", his career \"finished on a note of unfinished business\".Paul Fouracre, 'Writing about Charles Martel', in Law, Laity and Solidarities: essays in honour of Susan Reynolds, ed. Pauline Stafford et al. (Manchester, 2001), pp. 12-26.", "For early medieval authors, Charles Martel was famous for his military victories. Paul the Deacon for instance attributed a victory against the Saracens actually won by Odo of Aquitaine to Charles. However, alongside this there soon developed a darker reputation, for his alleged abuse of church property. A ninth-century text, the Visio Eucherii, possibly written by Hincmar of Reims, portrayed Martel as suffering in hell for this reason. pp. 275-6 According to British medieval historian Paul Fouracre, this was \"the single most important text in the construction of Charles Martel's reputation as a seculariser or despoiler of church lands\"."]}, {"page": "Pannonian Avars", "response": ["Initially, the Avars and their subjects lived separately, except for Slavic and Germanic women who married Avar men. Eventually, the Germanic and Slavic peoples were included in the Avaric social order and culture, itself Persian-Byzantine in fashion.History of Transylvania Scholars have identified a fused, Avar-Slavic culture, characterized by ornaments such as half-moon-shaped earrings, Byzantine-styled buckles, beads, and bracelets with horn-shaped ends. Paul Fouracre notes, \"[T]here appears in the seventh century a mixed Slavic-Avar material culture, interpreted as peaceful and harmonious relationships between Avar warriors and Slavic peasants. It is thought possible that at least some of the leaders of the Slavic tribes could have become part of the Avar aristocracy\".The New Cambridge Medieval History. Paul Fouracre Apart from the assimilated Gepids, a few graves of west Germanic (Carolingian) peoples have been found in the Avar lands. They perhaps served as mercenaries."]}, {"page": "Carolingian dynasty", "response": ["Pippin was not immediately rewarded, but eventually was given the position of maior palatti or 'mayor of the palace' of Austrasia in 624. This reward was incredibly important, as it secured Pippin a position of prime importance with the Merovingian royal court. The mayor of the palace would essentially act as the mediator between the King and the magnates of the region; as Paul Fouracre summarises, they were 'regarded as the most important non-royal person in the kingdom.' The reason why Pippin was not rewarded sooner is not certain, but two mayors, Rado (613 – c. 617) and Chucus (c. 617 – c. 624), are believed to have preceded him and were potentially political rivals connected to the fellow Austrasian 'Gundoinings' noble family. Once elected, Pippin served faithfully under Chlotar until the latter's death in 629, and solidified the Pippinids' position of power within Austrasia by supporting Chlotar's son Dagobert who became King of Austrasia in 623. Pippin, with support from Arnulf and other Austrasian magnates, even used the opportunity to support the killing of an important political rival Chrodoald, an Agilolfing lord.", "Very little is known about Pippin's early life, but a controversial story from AMP suggests that Pippin reclaimed power in Austrasia by killing a legendary 'Gundoin' as revenge for the assassination of his father Ansegisel. This story is regarded as slightly fantastical by Paul Fouracre, who argues the AMP, a pro-Carolingian source potentially written by Giselle (Charlemagne's sister) in 805 at Chelles, is that Pippin's role primes him perfectly for his future and demonstrates his family to be a 'natural leaders of Austrasia.' However, Fouracre does also acknowledge his existence in charter evidence and confirms that he was political link to rival mayor Wulfoald. These rivalries would make Pippin natural enemies with Gundoin; making the murder plausible as part of Pippin's rise to power.", "In 687, Pippin rallied an Austrasian army and led an assault on Neustria, facing Theuderic III and the Neustrian mayor, now Berchar, in combat. They met at the Battle of Tertry, where the AMP records that Pippin, after offering peace which was rejected by Theuderic at Berchar's behest, crossed the river Omignon at the break of dawn and attacked the Neustrians who believed the battle won when they saw Pippin's camp abandoned. This surprise attack was successful and the Neustrians fled. Following this victory, Berchar was either killed, as the AMP argues, by his own people, but the LHF suggests that it is more likely that he was murdered by his mother-in-law Ansfled. This moment was decisive in Arnulfing history as it was the first moment that any the faction had national control; Paul Fouracre even argues it is for this that the AMP starts with Pippin II, as a false dawn upon which Charles Martel would rebuild. However, historians have discredited the importance of this victory. Marios Costambeys, Matthew Innes and Simon MacLean all show that the Tertry victory did not establish solid authority over Neustria immediately, evidenced by the fact that Pippin immediately installed 'Norbert, one of his followers' (as written in the LHF) and then his son Grimoald in 696 to ensure continued influence.", "As Pippin approached his death in late 714, he was faced with a succession crisis. Drogo, Pippin's old son, died in 707 and his second son Grimoald, according to the LHF, was killed whilst praying to Saint Lambert in Liège in 714 by Rantgar, suspected by Paul Fouracre to be a pagan. Pippin, before his death, made his six year old Theudoald grandson (his son Grimoald's son) his successor in Neustria, a choice that is believed to have been promoted by his wife Plectrude. The decision to make Theudoald was clearly a political choice from within the direct family line, as Pippin did have two adult illegitimate children, Charles Martel and Childebrand I, from a second wife or concubine named Alpaida. They were ousted so Theudoald (with Plectrude's regency) could take the throne, a choice that would result in disaster.", "Also in 725, Charles continued his conquest from Alemannia and invaded Bavaria. Like Alemannia, Bavaria had continued to gain independence under the rule of the Agilolfings clan, who in recent years had increased links with Lombardy and affirmed their own law codes like the Lex Baiuvariorum. When Charles moved, the region was experiencing a power struggle between Grimoald of Bavaria and his nephew Hugbert, but when Grimoald died in 725, Hugbert gained the position and Charles reaffirm their support. The Continuations records that when Charles left Bavaria having taken hostages, one of which was Swanachild who later would become Charles' second wife. Paul Fouracre believes this marriage could have been intentionally forced, based upon the fact that Swanchild's heritage related her both to Alemannia and Bavaria. Not only would their marriage have allowed greater control over both regions, but it also would have cut the existing family ties that the Agilofings had to the Pippinid family branch. Plectrude's sister Regintrud was married to Theodo of Bavaria and this relation provided an opportunity for disenfranchised family members to defect.", "Charles also ruled the Frankish realm, although the majority of his policies were centred upon his conquests and his military ventures. In 19th century historiography, historians like Heinrich Brunner even centred their arguments around Charles' necessity for military resources, in particular the development of mounted warrior or cavalry that would peak in the High Middle Ages. However, in modern historiography, historians like Pierre Riche and Paul Fouracre have discredited his ideas as too simplistic and have aimed to depict more realistic fragments of development that may or not have been interdependent. This was the period in which the Carolingians first began to establish themselves as fully independent from the Merovingian royalty.", "Charles Martel has become notorious in historiography for his role in the development of the concept of feudalism. The debates are rooted in the arguments of historians like François-Louis Ganshof, who viewed Charles' reign as the birth of the 'feudal' relationship between power and property. This results from the increased use of precaria or temporary land grants by the Carolingians, who allocated and spread their power to their subordinates. Ganshof's arguments connect these ties to a military-tenure relationship, however this is never represented in primary material, and instead is only implied and likely derived from an understanding of 'feudalism' in the High Middle Ages. Recent historians like Paul Fouracre have criticised Ganshof's review for being too simplistic, and in reality, even though these systems of vassalage did exist between lord and populace, they were not as standardised as older historiography has suggested. For example, Fouracre has drawn particular attention to the incentives that drew lords and warriors into the Carolingian armies, arguing that the primary draw was 'booty' and treasure gained from conquest rather than 'feudal' obligation."]}, {"page": "Balthild of Chelles", "response": ["In Merovingian Gaul, one side of the seal was intended to be used with official documents. The other side would have been used only for private papers. It is uncertain why the seal matrix came to East Anglia. It may have been a gift, or a representative of Balthild may have worn it as a form of identification. It has also been suggested that the seal matrix was returned to Balthild's kin after she died. Paul Fouracre of the University of Manchester speculated that the seal may belong to a different Baldahildis entirely. The seal matrix is in the keeping of the Norwich Castle Museum."]}, {"page": "Balt dynasty", "response": ["The Balt dynastyRoger Collins, Visigothic Spain, 409–711 (Blackwell, 2008), p. 45.Guy Halsall, Barbarian Migrations and the Roman West, 376–568 (Cambridge University Press, 2007), p. 510.A. Barbero and M. I. Loring, \"The Formation of the Sueve and Visigothic Kingdoms in Spain\", in Paul Fouracre (ed.), The New Cambridge Medieval History, Volume 1: c.500–c.700 (Cambridge University Press, 2005), pp. 175 and 178. or Balth dynastyHerwig Wolfram, History of the Goths (University of California Press, 1979), pp. 32–34, has theories on family connections and Baltic connections. ( or Balthi, i.e., Balts) was the first ruling family of the Visigoths from 395 until 531. They led the Visigoths into the Western Roman Empire in its declining years."]}, {"page": "Milo (bishop of Trier)", "response": ["When Charles Martel drove Saint Rigobert from Reims, Milo was appointed his successor. As bishop, Milo became a controversial figure for the Church. His avarice and fondness of earthly pleasures soon placed him in opposition with the church. Milo did not lead a spiritual life and flagrantly ignored the Rules of Saint Benedict that governed his colleagues. Paul Fouracre says that Boniface considered Milo and bishops like him \"warlike, adulterous, and prone to help themselves to church property\"."]}, {"page": "Ursinus the Abbot", "response": ["An Ursinus wrote the Vita sancti Leodegarii.Jacques-Paul Migne, Patrologia Latina, v. xcvi Later authors tell this story: In 684, bishop Ansoald of Poitiers requested of the new abbot Andulf (684–96) that his monks provide him with a beatific Life of Bishop Leodegar of Autun, martyred three years prior at Sarcing in Artois; and Andulf delegated this task to Ursinus. This Life (or Passion) does not survive, but historian Bruno Krusch claimed to have reconstructed it as the basis of several versions from the Carolingian era. Historian Paul Fouracre initially questioned this account,\"Merovingian History and Merovingian Hagiography\", Past and Present, No. 127 May, 1990, pp. 3-38 but by 1996 he had accepted it.Late Merovingian France. History and Hagiography 640-720 Manchester, 1996"]}, {"page": "Bulletin of the John Rylands Library", "response": ["The Bulletin of the John Rylands Library is a journal published by Manchester University Press. Articles are meant to enhance the \"scholarship and understanding\" of the collections of the John Rylands Library. The journal was established in 1903, and has been published by MUP since 2014. The founding editor was Henry Guppy, while the current editor is Paul Fouracre."]}, {"page": "Medieval World Series", "response": ["*The Age of Charles Martel, Paul Fouracre, 2000."]}, {"page": "Richard Gerberding", "response": ["* Late Merovingian France: History and hagiography, 640-720, Manchester University Press, Manchester, 1996.  (translated and edited with Paul Fouracre)"]}, {"page": "New Studies in Medieval History", "response": ["French and Italian history notably featured in the list of volumes with Chris Wickham's Early Mediaeval Italy (1981), Edward James's The Origins of France (1982), and Roger Collins's Early Medieval Spain (1983) forming a trilogy that was described by Paul Fouracre in Teaching History in 1986 as being \"required reading for undergraduates studying the early middle ages\".Reviewed Work: Early Medieval Spain: Unity in Diversity, 400-1000, (New Studies in Medieval History series) by R. Collins. Review by: P. Fouracre, Teaching History, No. 44 (February 1986), p. 48. Margaret Gibson, in The English Historical Review in 1988, described the series as having a \"reputation for thorough, reliable scholarship\".\"Reviewed Work: Medieval Thought. The Western Intellectual Tradition from Antiquity to the Thirteenth Century by Michael Haren\" Review by: Margaret Gibson, The English Historical Review, Vol. 103, No. 406 (Jan., 1988), pp. 165-166."]}, {"page": "The New Cambridge Medieval History", "response": ["The first volume was the last to be published, in 2005, due to the death of scholars before their chapters were delivered and the tardiness of others in keeping to deadlines which caused the revision of a number of the chapters that had been submitted on time. The intended chapter on the Romans and Lombards in Italy was omitted after the editors gave up waiting for it to be delivered, while Michael Toch, by contrast, produced a draft of his chapter on the Jews in Europe in two weeks.\"Preface\" by Paul Fouracre in The New Cambridge Medieval History Volume 1, c.500–c.700. Cambridge University Press, Cambridge, 2005.", "* Volume 1, c.500–c.700. Edited by Paul Fouracre. 2005."]}, {"page": "Fouracre", "response": ["* Paul Fouracre, professor of medieval history at the University of Manchester"]}, {"page": "Miracula Martialis", "response": ["The Miracula is a potentially useful historical source for a very obscure period in Aquitanian history. For example, the earliest section of the Miracula, possibly from the late 7th century, offers a portrayal of the count of the palace Ebroin (died 680) at odds with that of the contemporary Passio Leudegarii. While the Passio is negative, the Miracula gives a positive account of Ebroin.Paul Fouracre and Richard Gerberding, edd., Late Merovingian France: History and Hagiography, 640–720 (Manchester: Manchester University Press, 1996), p. 291n. The Miracula also gives a unique account of an event in 675: the Aquitanian official Lupus attempted to make himself the king of an independent Aquitaine (ad sedem regam se adstare, \"to stand himself on a royal seat\").Ian N. Wood, \"Frankish Hegemony in England\", The Age of Sutton Hoo: The Seventh Century in North-Western Europe, ed. Martin Carver (Woodbridge: Boydell, 1992), p. 236.Archibald R. Lewis, \"The Dukes in the Regnum Francorum, A.D. 550–751\", Speculum 51.3 (1976), pp. 381–410, at 401."]}, {"page": "Fouracre, Paul", "response": ["#redirectPaul Fouracre"]}]}}