{"wiki_id": "http://www.wikidata.org/entity/Q21716258", "itemLabel": "Gerard Baker", "itemDescription": "British writer and columnist", "wikipedia_url": "https://en.wikipedia.org/wiki/Gerard_Baker", "wikipedia_page": {"main": "Gerard Baker is a British writer and columnist. He was Dow Jones' Managing Editor, and The Wall Street Journal's Editor-in-Chief from March 2013 until June 2018. Baker stepped down as WSJ Editor-in-Chief and transitioned into the role of Editor-at-Large. He was succeeded by WSJ executive editor Matt Murray.", "link_mentions": [{"page": "The Wall Street Journal", "response": ["In November 2016, in an effort to cut costs, The Journal editor-in-chief, Gerard Baker, announced layoffs of staff and consolidation of its print sections. The new \"Business & Finance\" section combined the former \"Business & Tech\" and \"Money & Investing\" sections. The new \"Life & Arts\" section took the place of \"Personal Journal\" and \"Arena\". In addition, The Journal \"Greater New York\" coverage was reduced and moved to the main section of paper. The section was shuttered on July 9, 2021."]}, {"page": "Saint Charles Preparatory School", "response": ["| Gerard Baker"]}, {"page": "List of Corpus Christi College, Oxford people", "response": ["* Gerard Baker – former editor-in-chief, Wall Street Journal https://www.ccc.ox.ac.uk/Mr-Gerard-Baker/", "* Gerard Baker"]}, {"page": "Gerry Baker (disambiguation)", "response": ["*Gerard Baker (born c. 1961), editor and opinion writer for The Wall Street Journal"]}, {"page": "2016 Republican Party presidential debates and forums", "response": ["The fourth debate was held on November 10, 2015, at the Milwaukee Theatre in Milwaukee, Wisconsin, airing on the Fox Business Network and sponsored by The Wall Street Journal. This debate focused on jobs, taxes, and the general health of the U.S. economy, as well as on domestic and international policy issues. The moderators were Neil Cavuto,  Maria Bartiromo  and Gerard Baker."]}, {"page": "David Bird (journalist)", "response": ["After his death, Journal editor-in-chief Gerard Baker praised Bird's reportorial zeal. \"His ability to navigate the vast troves of public oil data was unmatched,\" Baker wrote in a memo to staff. \"At 10:30 a.m. on Wednesdays, he could often be seen hunched over his computer, sifting through spreadsheets and crunching numbers just released by the Energy Information Administration. He was often the first to gain insight into important energy-market trends.\""]}, {"page": "2016 United States presidential election in Wisconsin", "response": ["The Republican Party held its fourth presidential debate on November 10, 2015, in Milwaukee, at the Milwaukee Theatre. Moderated by Neil Cavuto, Maria Bartiromo  and Gerard Baker, the debate aired on the Fox Business Network and was sponsored by The Wall Street Journal. Eight candidates including Donald Trump, Ben Carson, Marco Rubio, Ted Cruz, Jeb Bush, Carly Fiorina, John Kasich, and Rand Paul, participated in the primetime debate that was mostly focused on jobs, taxes, and the general health of the U.S. economy, as well as on domestic and international policy issues. The accompanying undercard debate featured Chris Christie, Mike Huckabee, Rick Santorum, and Bobby Jindal who ended his campaign a week after the debate."]}, {"page": "2016 Wisconsin Republican presidential primary", "response": ["The Republican Party held its fourth presidential debate on November 10, 2015 in Milwaukee, at the Milwaukee Theatre. Moderated by Neil Cavuto, Maria Bartiromo  and Gerard Baker, the debate aired on the Fox Business Network and was sponsored by The Wall Street Journal. Eight candidates including Donald Trump, Ben Carson, Marco Rubio, Ted Cruz, Jeb Bush, Carly Fiorina, John Kasich, and Rand Paul, participated in the primetime debate that was mostly focused on jobs, taxes, and the general health of the U.S. economy, as well as on domestic and international policy issues. The accompanying undercard debate featured Chris Christie, Mike Huckabee, Rick Santorum, and Bobby Jindal who ended his campaign a week after the debate."]}, {"page": "Juli Briskman", "response": ["In 2019, Briskman, a Democrat,  was elected to the Algonkian District seat of the Loudoun County Board of Supervisors, defeating eight-year incumbent Suzanne M. Volpe. She described herself as running on policies such as environmentalism, education, and women's rights, rather than the notice she received for flipping off the president. The Washington Post described her victory as \"fabulous revenge\", and Gerard Baker of London's The Times noted that it highlighted President Trump's perceived issues with suburban American women. "]}, {"page": "Matt Murray (journalist)", "response": ["On June 5, 2018, Murray was named editor in chief, succeeding Gerard Baker, and assumed his new role on June 11."]}, {"page": "Rajiv Pant", "response": ["Pant began his career as Vice President, Director and Manager of Engineering at Knight Ridder, then went on to be CTO of COXnet for three years, during which he received the Newspaper Association of America’s 20 Under 40 Award. In 2007, he joined Condé Nast as their Vice President of Digital technology, then working at The New York Times for 4 years and 2 months. He wrote about his decision to leave The Times for a startup in Quartz, saying: \"I love The Times and its vision, and cherished my four years there. But, there was something missing in my career. I had been in CTO roles at four major media companies, with accomplishments I was proud of. However, I didn’t want my 3 year old son Fitz Raj to know me for only being a successful corporate executive, but for accomplishing something significant for the greater good.\"In 2014, he was honored as a Young Global Leader, a prestigious professional network by The World Economic Forum. It was during this time that he worked at The New York Times, going on to work for startup Some Spider as CPO, now serving in an advisory capacity. On February 1, 2017, Wall Street Journal editor Gerard Baker announced that Pant will be joining them as their inaugural Chief Product and Technology Officer."]}, {"page": "Sticks & Stones (2019 film)", "response": ["Comedian Katherine Timpf remarked that Chappelle \"intended his special to be a protest against cancel culture and oversensitivity\". Gerard Baker of The Wall Street Journal spoke highly of the piece, stating that \"Today's performers mostly fall over each other to demonstrate new establishment bona fides. They may call themselves woke. They're barely breathing.\" He continued by praising the performance: \"[Chappelle] is, in that sense, a true comic—one of extraordinary talent and sophistication.\" D. Watkins of Salon, in a positive review, felt that \"dismissing Chappelle's work as simply or obstinately regressive is not unlike seeing the world through the same lens as\" a Comedy Central network executive who, according to Chappelle, told him that he couldn't say a slur against gay people despite allowing him to routinely use a slur against black people. The forthrightness of Chappelle was appreciated by reviewers such as Jeremy Jahns who commented specifically that \"I couldn't help but appreciate the fact that, well, this guy will do it; he'll go there.\" Jordan Ruimy of World of Reel opined that \"It's an act of sheer chutzpah from Chappelle, but it works as the jokes aren’t only funny but come with a biting sting\", while stating Chappelle's piece feels \"immediate, a plea from one of our very best comedians to his own audience to stop the hysteria.\""]}, {"page": "Timeline of investigations into Donald Trump and Russia (July–December 2017)", "response": ["** In an Oval Office interview with The Wall Street Journals Gerard Baker, Trump states that there was \"nobody on the campaign that saw anybody from Russia\"."]}, {"page": "Capitalism in America", "response": ["Critics found the presentation of ideas engaging, The Times columnist Gerard Baker calling it a \"compelling and well-documented single-volume history.\" Meyerinck attributed it to the author's ability to condense several sources and documents in a \"very well written\" book, and Publishers Weekly credited it to the fast pace at which its several \"fun facts\" were presented. Skousen and American economist Deirdre McCloskey analogized the content as \"spark[ling]\" with quotes and statistics, \"a stylistic device that academic histories often overlook\". For McCloskey and British philosopher Alan Ryan, the most exciting-to-read parts of the book were its biographies and entrepreneurs and innovators. Wrote Ryan, \"The bare recital of their names is enough to conjure up an image of a world remaking itself, taking on the form it still essentially possess.\" Also brought up was the book's ability to present complex ideas in a manner accessible to all readers. British economist Diane Coyle argued the book successfully makes it case \"with some wonderful insights into business history\"."]}]}}