{"wiki_id": "http://www.wikidata.org/entity/Q21745460", "itemLabel": "Frank Parsons", "itemDescription": "English association footballer (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Parsons_(English_footballer)", "wikipedia_page": {"main": "Frank Ronald Parsons (born 29 October 1947) is an English-born, former professional footballer who represented Wales at under-23 level. He  played as a goalkeeper in the Football League for Crystal Palace, Cardiff City and Reading, in addition to a brief spell at Fulham where he did not make an appearance. He also played non-league football for Staines Town, Woking, and Slough Town.", "link_mentions": [{"page": "Jim Eadie (footballer)", "response": ["Eadie began his career at Rangers but never made a first team appearance for the club, moving to Dumbarton where he played a handful of matches before joining Kirkintilloch Rob Roy. It wasn't until he moved south to play in The Football League that he began to play regular football. He signed for Cardiff City in 1969, although he did not make his debut until the following year when he kept a clean sheet in a 2–0 win over Portsmouth in March 1970. The following season, he managed to oust Frank Parsons as the number one goalkeeper as Cardiff just missed out on promotion."]}, {"page": "Frank Parsons (soccer)", "response": ["Frank Parsons was an Australian retired soccer player who played as a striker for the Australia national soccer team. He played his club football for Adamstown and Leichhardt-Annandale."]}, {"page": "Frank Parsons", "response": ["Frank Parsons may refer to:", "* Frank Parsons (Australian footballer), retired Australian footballer", "* Frank Parsons (English footballer) (born 1947), retired English footballer (Crystal Palace and Cardiff City)", "* Frank Parsons (social reformer) (1854–1908), lawyer, professor, and public intellectual; regarded as father of vocational guidance movement", "* Frank Parsons Jr. (1906–1957), American sports shooter"]}, {"page": "Frank Parsons (footballer, born 1947)", "response": ["#REDIRECTFrank Parsons (English footballer)"]}]}}