{"wiki_id": "http://www.wikidata.org/entity/Q218222", "itemLabel": "Zoe Rahman", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Zoe_Rahman", "wikipedia_page": {"main": "Zoe Rahman (born 20 January 1971) is an English jazz composer and pianist.", "link_mentions": [{"page": "Mercury Prize", "response": ["* Zoe Rahman – Melting Pot"]}, {"page": "Jerry Dammers", "response": ["Dammers still regularly DJs in English nightclubs, as well as performing with his band, The Spatial AKA Orchestra, playing his own compositions and tributes to Sun Ra and other experimental jazz artists. The band features established jazz musicians Zoe Rahman, Larry Stabbins and Denys Baptiste. They perform in elaborate Ancient Egyptian and outer space-themed costumes, and share the stage with bizarre props such as model alien heads and mummy sarcophagi. Renowned trombonist Rico Rodriguez also featured in a number of shows."]}, {"page": "MOBO Awards", "response": ["* Best Jazz: Zoe Rahman "]}, {"page": "National Youth Jazz Orchestra", "response": ["NYJO has an extensive discography of over 40 recordings. A new double CD album entitled NYJO FIFTY was released in late 2015 to celebrate the 50th anniversary of NYJO's formation, with guest appearances by alumnus Mark Nightingale and by Zoe Rahman and Julian Siegel, both of whom were commissioned to write new works for the album.\"NYJO FIFTY by The National Youth Jazz Orchestra\" at Whirlwind Records."]}, {"page": "Cheltenham Jazz Festival", "response": ["The Festival has presented a number of star names over the years, including Herbie Hancock, Ornette Coleman, Van Morrison, Jamie Cullum, Jools Holland, Laura Mvula, Eartha Kitt (in her last UK performance), Chick Corea, Maceo Parker, John Scofield, Gilles Peterson, the BBC Big Band, the Loose Tubes (in their first performance together in 20 years), Gregory Porter, Dave Holland, Wilko Johnson, Caro Emerald, Mr Scruff, Charles Lloyd, Silje Nergaard, Billy Cobham, Guillemots, Madeleine Peyroux, The Cinematic Orchestra, Curtis Stigers, The Nextmen, Bennie Maupin, Marti Pellow, Ben Allison, Michael Brecker, Dianne Reeves, The Claudia Quintet, Courtney Pine, Zoe Rahman, Cassandra Wilson, Martha Reeves, Benny Golson, Joe Zawinul, Adrian Adlam,  Archie Shepp, Lee Konitz and Ray Brown."]}, {"page": "Seckou Keita", "response": ["Additionally, Keita has been constructive in making the kora more accessible outside the traditional griot families. Initially, he was considering the value of having a physical record of his music, and how that would help his children to learn the kora and its music without being part of the upbringing he had had, and using sources more familiar to them while growing up in the UK. Historically, only griots would learn the kora from family members by listening and repetition, so with the assistance of Latin jazz pianist, composer and producer Alex Wilson, Keita worked on deconstructing the kora and its outputs so that it could be transcribed and adapted for Western instruments. Eight books of kora music adapted for the piano, flute, cello, violin and clarinet were launched in 2020 and are available for sale from his website. Prior to their release, the world premiere of the transcriptions was performed by Sinfonia Cymru musicians Abel Selaocoe (cello) and Helen Wilson (flute), award-winning jazz pianist Zoe Rahman and Paul Moylan (double bass) in a twilight concert at the Howard Assembly Room at Opera North, Leeds, in January 2019.  "]}, {"page": "Ras Nas", "response": ["Recently, Ras Nas was featured on BBC World Service, The Beat program. The weekly program, reaching millions of listeners worldwide, is presented by Mark Coles. Other artists on the program were Wyclef Jean and Zoe Rahman."]}, {"page": "Clark Tracey", "response": ["He has led his own ensembles since the early 1980s; in these combos he has played with Django Bates, Iain Ballamy, Guy Barker, Jamie Talbot, Mark Nightingale, Dave O'Higgins, Steve Melling, Nigel Hitchcock, Gerard Presencer, Mornington Lockett, Simon Allen, Kit Downes, Zoe Rahman and Alan Barnes.  As a bandleader he has had two tours of the Far East, Yugoslavia, France, Gibraltar and Finland as well as many national UK tours.  His current sextet includes Mark Armstrong, Tom Ridout, James Wade Sired, Gareth Williams and James Owston. Clark has worked steadily as a freelance musician and has appeared mostly in the groups of Alan Barnes."]}, {"page": "British Bangladeshis", "response": ["Artists include dancer and choreographer Akram Khan, pianist Zoe Rahman, vocalist Suzana Ansar and Sohini Alam (born 1978), and the visual artist on film and photography Runa Islam."]}, {"page": "List of people from Chichester", "response": ["* Zoe Rahman - jazz pianist"]}, {"page": "List of British Bangladeshis", "response": ["* Idris Rahman – Clarinettist, saxophonist and music producer. He has produced and mixed albums, including two Mercury Prize-nominated albums (Zoe Rahman's second album Melting Pot and Basquiat Strings' debut album Basquiat Strings with Seb Rochford) and two albums by vocalist Julia Biel.", "* Zoe Rahman – Jazz composer and pianist. In 1999, she was awarded the Perrier Young Jazz Musician of the Year Award. In 2006, her album Melting Pot  was nominated for Album of the Year at the Mercury Music Prize."]}, {"page": "Larry Stabbins", "response": ["His latest project 'Stonephace Stabbins' features Mercury nominated pianist Zoe Rahman, Crispin \"Spry\" Robinson from 1990's Jazz/Rap band Galliano on percussion, Karl Rasheed Abel on bass and Pat Illingworth on drums, all of whom also play in Jerry Dammers’ Spatial AKA Orchestra."]}, {"page": "Cevanne Horrocks-Hopayian", "response": ["*  2010 – Big Ears – Performers – Zoe Rahman, Kuljit Bhamra, Kareem Dayes, Maral Mohammadi, Cevanne Horrocks-Hopayian, Ziazan Horrocks-Hopayian (Phyllis Tweed Publications)"]}, {"page": "1971 in jazz", "response": ["* 20 – Zoe Rahman, English pianist and composer."]}, {"page": "1999 in jazz", "response": ["*Zoe Rahman, British jazz composer and pianist, won the \"Perrier Young Jazz Musician of the Year\" Award."]}, {"page": "Mounqaliba", "response": ["Mounqaliba (Arabic: منقلبة; English: In a State of Reversal) is a 2010 album by Belgian singer Natacha Atlas. Co-produced by Samy Bishai, it was inspired by the poems of Indian poet Rabindranath Tagore. In addition to original works, it also contains covers of Françoise Hardy and Nick Drake songs. The album also features composers Zoe Rahman and Jocelyn Pook."]}, {"page": "Melting Pot (Zoe Rahman album)", "response": ["Melting Pot is the second studio album by English jazz composer Zoe Rahman, released on 1 July 2006 by Manushi Records.", "*Zoe Rahman – piano", "Category:Zoe Rahman albums"]}, {"page": "Music of Sussex", "response": ["Nat Gonella was part of the Brighton jazz scene and also a resident of Saltdean. In 2005, jazz pianist and vocalist Liane Carroll won two BBC Jazz Awards, while jazz composer and pianist Zoe Rahman received a Mercury Prize nomination for her 2006 album Melting Pot. Brighton-based singer Claire Martin has won the Best Vocalist award in the British Jazz Awards five times."]}, {"page": "Soothsayers (band)", "response": ["Hopcraft and Rahman have also collaborated on many other musical projects in this time, with artists including Osibisa, Mad Professor, Rico Rodrigues, Jerry Dammers, Ayub Ogada, Aswad, Julia Biel, Zoe Rahman and Arun Ghosh. In 2011 they were asked by members of the band Antibalas to take part in the London production of the hit musical 'Fela!', about the life of afrobeat creator Fela Kuti, which ran for four months at London's National Theatre. Hopcraft was musical director and trumpeter and Rahman played lead sax part mimed to by the actor in the title role.", "* Zoe Rahman (keyboards)"]}, {"page": "Idris Rahman", "response": ["Rahman has performed and recorded with a whole range of artists including Anoushka Shankar, Arun Ghosh, Julia Biel, Osibisa, Ayub Ogada, Oriole, Dodgy as well as with his sister Zoe Rahman, with whom he has toured and recorded extensively.", "As well as performing regularly, Rahman has a studio in South London where he has produced and mixed many albums, racking up a catalogue including two Mercury-nominated albums that he mixed - Melting Pot by Zoe Rahman and Basquiat Strings' debut album -  and MOBO-nominated album Love Letters and Other Missiles by Julia Biel which he produced. He has written and produced music for television and film, and is currently working on music for a feature film to be released in 2020/21.", "*Al-mahmood, Syed Zain. Bengali music inspires Zoe Rahman's new album. Manchester Evening News. 19 November 2008"]}, {"page": "British Bangladeshi Power & Inspiration 100", "response": ["In 2013, included in the entrepreneur and business section are Telecoms managing director Naufal Zamir The list also revealed less well known and emerging faces such as Sabirul Islam (the \"Teen-Trepreneur\"), Rahima Begum (founder of human rights charity Restless Beings) and Zoe Rahman. In 2014, the list also contained less well-known and emerging faces such as Rupa Huq (Labour Prospective Parliamentary Candidate for Ealing) and Zubair Hoque Formula 4 Racing Driver."]}, {"page": "The Cynic (Zoe Rahman album)", "response": ["The Cynic is the debut studio album by English jazz composer Zoe Rahman, released in 2001 by Manushi Records.", "*Zoe Rahman – piano", "Category:Zoe Rahman albums"]}, {"page": "Where Rivers Meet", "response": ["*Zoe Rahman – piano", "Category:Zoe Rahman albums"]}, {"page": "Zoe Rahman Trio: Live", "response": ["Zoe Rahman Trio: Live (also known as Live with special guest Idris Rahman) is the fourth studio album by English jazz composer Zoe Rahman, released on 11 May 2009 by Manushi Records.", "Chris May of All About Jazz rated the album 4/5 and said, \"Hard swinging and outgoing, Live is an infectious goodtime album and provides a valuable record of where the Zoe Rahman Trio was at in early 2007...\" The Scotsman rated it 3/5 and said of the album, \"Sound is good if a little recessed in places, but the energy and imagination carry the day.\"", "*Zoe Rahman – piano", "Category:Zoe Rahman live albums"]}, {"page": "Kindred Spirits (Zoe Rahman album)", "response": ["Kindred Spirits is the fifth studio album by English jazz composer Zoe Rahman, released on 23 January 2012 by Manushi Records.", "Kindred Spirits is inspired by Zoe Rahman's discovery of the connections between Irish and Scottish folk music and the work of Bengali poet, composer and artist Rabindranath Tagore. The album includes three tracks written by Rabindranath Tagore and Stevie Wonder's \"Contusion\". Rahman wrote over half of the tracks ", "*Zoe Rahman – piano, harmonium", "Category:Zoe Rahman albums"]}, {"page": "Unison (George Mraz and Zoe Rahman album)", "response": ["Unison is a studio album by musicians George Mraz and Zoe Rahman, released on 15 July 2013 by Cube-Metier.", "Music producer Paul Vlcek sought Zoe Rahman out to play with George Mraz from amongst the most talented British jazz pianists.", "*Zoe Rahman – piano", "Category:Zoe Rahman albums"]}, {"page": "List of years in jazz", "response": ["* 1971 in jazz, deaths of Baby Face Willette, Bert Ambrose, Bobby Donaldson, Charlie Shavers, Chas Remue, Derek Humble, Ernie Caceres, Gary McFarland, Gregor, Harold McNair, Harry Arnold, Harry Roy, Harry Shields, Irene Daye, King Curtis, Lil Hardin Armstrong, Lou McGarity, Louis Armstrong, Morey Feld, Sonny White, Tab Smith, and Wynton Kelly; births of Antonio Sánchez, Carla Kihlstedt, Chris Potter, Christian Wallumrød, Dominique Atkins, Ed Motta, Erland Dahlen, Erykah Badu, Frode Berg, Gerald Preinfalk, Graham Wood, Gregory Porter, Håvard Fossum, Helén Eriksen, Ingar Zach, Ingebrigt Håker Flaten, Jamie Saft, Jesse Green, Joey Defrancesco, Kasper Tranberg, Kenya Hathaway, Kristin Asbjørnsen, Leszek Możdżer, Liberty Ellman, Lisa Ekdahl, Mattias Ståhl, Max Beesley, Mika Pohjola, Mina Agossi, Nasheet Waits, Nigel Hitchcock, Noriko Matsueda, Øyvind Brandtsegg, Robert Mitchell, Russell Gunn, Sean J. Kennedy, Shoji Meguro, Solveig Slettahjell, Stian Carstensen, Till Brönner, Tom Norris, Trygve Seim, Vellu Halkosalmi, Vijay Iyer, Walter Blanding, and Zoe Rahman."]}, {"page": "Michael Mondesir", "response": ["He has performed with artists including Jeff Beck, Billy Cobham, Ginger Baker, Eddie Harris, Jack DeJohnette, John McLaughlin, Oumou Sangare, Usher, Whitney Houston, Imogen Heap, Sir George Martin, State of Bengal, Hermeto Pascoal, David Garibaldi, Jan Hammer, Ty, Zoe Rahman, Jim Mullen, Ronnie Wood, John Serry Jr., Andy Summers, Django Bates, Gary Husband, Chante Moore, Lulu, Nitin Sawhney, Lenny White, Chad Smith, Courtney Pine, Jocelyn Brown Jason Rebello, Brice Wassy, Neneh Cherry, Nikki Yeoh, Bernard Purdie, Iain Ballamy Bill Bruford, Julian Joseph, Leni Stern, Mory Kante, Keith More, Trilok Gurtu, Mike Lindup, Aster Aweke, S-Club 7, Talvin Singh and Pee Wee Ellis."]}]}}