{"wiki_id": "http://www.wikidata.org/entity/Q2181776", "itemLabel": "Paul Collins", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Collins_(actor)", "wikipedia_page": {"main": "Paul Collins (born 25 July 1937) is a British actor. He is best known for his role as John Darling in the 1953  Walt Disney Pictures animated film Peter Pan.", "link_mentions": [{"page": "1996 in film", "response": ["| Mother || Paramount Pictures || Albert Brooks (director/screenplay); Monica Johnson (screenplay); Albert Brooks, Debbie Reynolds, Rob Morrow, Isabel Glasser, Paul Collins, John C. McGinley, Vanessa A. Williams, Lisa Kudrow, Anne Haney, Peter White, Matt Nolan, Harry Hutchinson, Kimiko Gelman, Rosalind Allen, Laura Weeks, Danielle Quinn, Spencer Klein, Billye Ree Wallace, James Gleason, Ernie Brown, Richard Assad, Joey Naber || Comedy, Drama || Live action"]}, {"page": "1989 in film", "response": ["| Peter Pan (re-release) || Walt Disney Pictures / RKO Radio Pictures || Clyde Geronimi, Wilfred Jackson, Hamilton Luske (directors); Bobby Driscoll, Kathryn Beaumont, Hans Conried, Paul Collins, Tommy Luske, Heather Angel, Bill Thompson, Robert Ellis, June Foray, Candy Candido, Tom Conway, Roland Dupree, Don Barclay, The Mellomen, Tony Butala, Connie Hilton, Karen Kester, Margaret Kerry || Adventure, Fantasy || Animation"]}, {"page": "1992 in film", "response": ["| For Richer, for Poorer || HBO Pictures / Citadel Entertainment || Jay Sandrich (director); Stan Daniels (screenplay); Jack Lemmon, Talia Shire, Jonathan Silverman, Joanna Gleason, Madeline Kahn, George Wyner, Dakin Matthews, Stephen Caffrey, Hal Riddle, Paul Collins, Perry Moore, Ivar Brogger, James Gleason, Clifton Collins Jr., Shirley Prestia || Comedy || Live action"]}, {"page": "1991 in film", "response": ["| Prison Stories: Women on the Inside || HBO Showcase || Donna Deitch, Joan Micklin Silver, Penelope Spheeris (directors); Dick Beebe, Martin Jones, Marlane Meyer, Jule Selbo (screenplay); Rae Dawn Chong, Lolita Davidovich, Annabella Sciorra, Talisa Soto, Rachel Ticotin, Leontine Guilliard, Debi Parker, Sharon Schaffer, Sandy Martin, Robert Wallach, Terri Hanauer, Edwin Maldonado Jr., Raymond Cruz, Lorraine Morin-Torre, Jennifer Rhodes, Kevin Duffis, Myra Turley, Edith Fields, Virginia Keehne, Elisabeth Moss, Daniel Riordan, Joel Swetow, Gillian Bagwell, Marlon Taylor, John Freeland, Mae E. Campbell, Lois DeBanzie, Paul Collins, Al White, Moe Bertran, Ken Butler, Silvana Gallardo, Francesca P. Roberts, Kimberly Scott, Grace Zabriskie || Drama || Live action"]}, {"page": "1986 in film", "response": ["| George Washington II: The Forging of a Nation || CBS / MGM/UA Television / David Gerber Productions || William A. Graham (director); Richard Fielder (screenplay); Barry Bostwick, Patty Duke Astin, Jeffrey Jones, Richard Bekins, Penny Fuller, Marcia Cross, Norman Snow, Lise Hilboldt, Haviland Morris, Daniel Davis, Richard Fancy, Sam Tsoutsouvas, Leo Burmester, Paul Collins, Erika Alexander, Eve Gordon, Christopher Goutman, Jonathan Farwell, Jeff Hayenga, Guy Paul, Farnham Scott, Nicholas Kepros, Robert Kelly, Clayton Prince, Timothy Landfield, Gregory Abels, Robert Billbrough, John Timmons || Biography, Drama, History || Live action"]}, {"page": "Peter Pan (1953 film)", "response": ["Peter Pan is a 1953 American animated adventure fantasy film produced by Walt Disney Productions and based on the 1904 play Peter Pan, or The Boy Who Wouldn't Grow Up by J. M. Barrie. Directed by Clyde Geronimi, Hamilton Luske and Wilfred Jackson, it is the 14th Disney animated feature film. Starring the voices of Bobby Driscoll, Kathryn Beaumont, Hans Conried, Paul Collins, Heather Angel, and Bill Thompson, the film's plot involves a group of kids who meet Peter Pan and travel to the island of Never Land to stay young, where Peter also attempts to evade Captain Hook.", "* Paul Collins as John Darling, the older of the two Darling boys. He acts very sophisticated and mature for a boy eight years old. He is an analytical thinker and skilled strategist, particularly when he takes leadership over the Lost Boys while capturing Indians and fighting the pirates. He wears large, black glasses and is tall and slim. All the Darling children wear their nightgowns to Never Land, but he also takes a black top hat and an umbrella with him, showing exaggerated maturity."]}, {"page": "List of Metal Gear characters", "response": ["The Director of Central Intelligence is a minor character who appears at the end of Metal Gear Solid 3: Snake Eater. The DCI resembles John McCone (the actual DCI in 1964), but is written as an unnamed fictionalized counterpart. He was the one who planned out the Operation Snake Eater, and as a result Naked Snake refuses to shake his hand during the award ceremony after returning from the mission. He was also the one who employed Ocelot (aka ADAM) as a triple agent within the CIA, KGB and GRU. In the end of Metal Gear Solid: Portable Ops, Ocelot ends up betraying the DCI under orders from a new employer and kills him in order to obtain the location of the Philosopher's Legacy. In the Japanese version, the DCI is voiced by an uncredited actor (in Metal Gear Solid 3) and by Masaharu Sato (in Portable Ops). In the English translation, the DCI is voiced by Paul Collins (in Metal Gear Solid 3) and by Jesse Corti (in Portable Ops)."]}, {"page": "Guiding Light (1960–1969)", "response": ["* Tyler Meade (Paul Collins, August 1969 until end of decade)"]}, {"page": "Guiding Light (1970–1979)", "response": ["* Tyler Meade (Paul Collins until August 1970), written out"]}, {"page": "Mother (1996 film)", "response": ["* Paul Collins as the lawyer"]}, {"page": "Collins (surname)", "response": ["*Paul Collins (disambiguation), multiple people, one of several people including:", "**Paul Collins (end) (1907–1988), American football player", "**Paul Collins (athlete) (1926–1995), Canadian long-distance runner", "**Paul Collins (artist) (born 1936), American realist painter", "**Paul Collins (actor) (born 1937), English actor", "**Paul Collins (Australian religious writer) (born 1940), Australian historian, broadcaster and writer", "**Paul Collins (fantasy writer) (born 1954), Australian writer", "**Paul Collins (musician) (born 1956), American drummer", "**Paul Collins (rugby union) (born 1959), Irish international rugby union footballer", "**Paul Collins (English footballer) (born 1966), English association football player", "**Paul Collins (American writer) (born 1969), American writer"]}, {"page": "Paul Collins", "response": ["Paul Collins may refer to:", "* Paul Collins (end) (1907–1988), American football player", "* Paul Collins (quarterback) (1922–2012), American football player", "* Paul Collins (runner) (1926–1995), Canadian long-distance runner", "* Paul Collins (businessman) (born 1953), New Zealand businessman and sports administrator", "* Paul Collins (English footballer) (born 1966), English association football player", "* Paul Collins (rugby union) (born 1959), former Irish rugby union international player", "* Paul Collins (American Samoan footballer) (born 1997), American Samoan footballer", "* Paul Collins (actor) (born 1937), English actor", "* Paul Collins (artist) (born 1936), American realist painter", "* Paul Collins (Australian religious writer) (born 1940), Australian historian, broadcaster and writer", "* Paul Collins (fantasy writer) (born 1954), Australian writer", "* Paul Collins (musician) (born 1956), American musician", "* Paul Collins (American writer) (born 1969), American writer", "* Paul Collins (Brookside), character in Brookside from 1982 to 1990", "* The Paul Collins Beat, an American power pop band"]}, {"page": "The Breed (2001 film)", "response": ["*Paul Collins - Calmet"]}, {"page": "List of JAG characters", "response": ["Played by Paul Collins. Seasons 3–8, 32 episodes."]}, {"page": "List of American films of 2007", "response": ["| Evan Almighty || Universal Pictures / Spyglass Entertainment / Relativity Media / Original Film / Shady Acres Entertainment || Tom Shadyac (director); Steve Oedekerk (screenplay); Steve Carell, Morgan Freeman, Lauren Graham, John Goodman, John Michael Higgins, Jimmy Bennett, Wanda Sykes, Jonah Hill, Molly Shannon, Graham Phillips, Johnny Simmons, Ed Helms, Rachael Harris, Brian Howe, Harve Presnell, Madison Mason, Bruce Gray, Paul Collins, Jim Doughan, Meagen Fay, Dean Norris, Jon Stewart || Fantasy, Disaster, Comedy"]}, {"page": "List of British actors", "response": ["* Paul Collins (born 1937)"]}, {"page": "List of Sons of Anarchy and Mayans M.C. characters", "response": ["Declan Brogan (Bart McCarthy), Peter Dooley (Paul Collins) and Brendan Roarke (Bob McCracken) are the council of the Real IRA in Belfast. First seen thanking SAMCRO for proving Jimmy O. to have gone rogue, they later propose developing the relationship between the Sons and True IRA even further."]}, {"page": "List of Disney animated universe characters", "response": ["|John Darling||Paul Collins||Peter Pan"]}, {"page": "A Season for Miracles", "response": ["* Paul Collins...Gerald Foster"]}, {"page": "The Rear Column", "response": ["*Mr. J.R. Troup - Paul Collins"]}, {"page": "Sinatra (miniseries)", "response": ["* Paul Collins as Westbrook Pegler"]}, {"page": "Just Dance: Disney Party", "response": ["| \"Following the Leader\" || Paul Collins, Tommy Luske, and Tony Butalacredited as John and Michael Darling; The Lost Boys || Peter Pan || 1 || 2 || 1953 || Trio || ♀/♂/♂"]}, {"page": "Captured (1998 film)", "response": ["After seeing Holden's scuffle with an environmentalist (Thad Geer) on the news, Faye decides to return home from visiting her sister Sheila (Beth Tegarden) earlier than planned. Deciding that Robert still hasn't come home, Joey decides to look for him and sneaks into Holden's house, Holden encounters Joey and several fights erupt until Joey is shot and killed. After Harry (Paul Collins) visits and announces that he has reached an agreement, Holden leaves for a meeting. Meanwhile, Faye returns home to find Robert trapped in the car, where she opens the door for him, only for her to be locked in. Robert soon destroys the phone lines and waits for Holden to return, then locks Holden in the car while holding Faye hostage and taunting him. Meanwhile, Holden calls Buddy for help. As Buddy frees him, Holden runs back in the house armed with a Speargun and instructs him to hide in the garage. However, Buddy decides to run into the house anyway to try to help, only to get shot when he is mistaken for Robert. Soon, Robert and Holden encounter each other and begin having a scuffle, only to be interrupted by Faye with a gun pointed at both of them. As they both try to reason with her, she eventually shoots Holden. The film ends with Faye and Robert sitting on the floor.", "* Paul Collins - Harry"]}, {"page": "Peter Pan (franchise)", "response": ["| Paul Collins"]}, {"page": "The Chase (1991 film)", "response": ["A month later on February 9, 1988, Wallis is now a grandfather and plans on leaving the force soon. Tammie still works at the Union office and Whipple reconnects with her father (Paul Collins), whom she had a brief falling out with in the past. Hutchinson snaps on this particular date and decides to rob the Union office as he has plans to flee the country and move to Brazil. He holds up the place with a gun and demands Tammie to hand over any cash in the office and place it into a suitcase he is carrying. Tammie activates a silent alarm with her foot and the police respond immediately. Hutchinson flees in his Blazer and Silva gets word about the robbery from the sky. He flies over to the scene of the crime so Stair can catch the police chase on camera. Officers descend on the scene and try to cut Hutchinson off. Wallis is one of them, but he gets pinned down in his car due to a faulty seat-belt and by the time he manages to get out of his car, he is mowed down by Hutchinson in his Blazer and is killed instantly. Hutchinson then crashes his car and flees on foot where he encounters Whipple and her boyfriend Julian. Julian runs off and Hutchinson attempts to carjack her. She manages to flee and escape as Hutchinson fires off a few rounds at the car, smashing the back windshield. Hutchinson then encounters John Laurienti (Ben Johnson) and his disabled daughter. He carjacks Laurienti and hides in the passenger seat of Laurienti's truck, ordering him to drive past the approaching police. Laurienti drives past the police officers who are looking for Hutchinson, but they are unaware Hutchinson is even in the vehicle as they lost sight of him after Wallis's death. Only Silva and Stair are aware of the truth but are unable to communicate to the police and inform them of Hutchinson's whereabouts. To prevent Hutchinson from escaping and potentially killing Laurienti, Silva decides to fly the helicopter directly in front of the truck and lands the helicopter on the road, preventing the truck from going any further. Officers then surround Hutchinson and ram the truck to stop him from firing off any rounds. Laurienti is pulled free unharmed, and Hutchinson is then shot dead by police after attempting to kill Laurienti and the approaching police."]}, {"page": "Prison Stories: Women on the Inside", "response": ["*Paul Collins as Mr. Olney "]}, {"page": "Black Widow Murders: The Blanche Taylor Moore Story", "response": ["*Paul Collins as Dr. Nesbitt"]}]}}