{"wiki_id": "http://www.wikidata.org/entity/Q2184777", "itemLabel": "Peter Paxton", "itemDescription": "Scottish golfer", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Paxton", "wikipedia_page": {"main": "Peter Paxton (20 October 1857 – 3 July 1929) was a Scottish professional golfer who played in the late 19th century. Paxton had three top-10 finishes in the Open Championship. He took second place in the 1880 Open Championship five shots behind winner Bob Ferguson. Paxton was an expert club and ball maker.  His golf ball inventions included the Bramble and Sirdar models, the former being the ball of choice for Harry Vardon at one time.  Paxton was also the designer of a number of golf courses, with Coventry Golf Club (Coventry, England) and East Berkshire Golf Club (East Berkshire, England) being among those designs.", "link_mentions": [{"page": "The Open Championship", "response": ["|align=center|20th || align=center|1880 ||  Bob Ferguson || align=center|162 || || 5 strokes ||  Peter Paxton || align=center|Not known || align=\"center\" |8 || Musselburgh"]}, {"page": "Bob Ferguson (golfer)", "response": ["| align=center|1880 ||The Open Championship ||1 shot lead || 40-41-42-39=162 ||5 strokes || Peter Paxton"]}, {"page": "1880 Open Championship", "response": ["The 1880 Open Championship was the 20th Open Championship, held 9 April at Musselburgh Links, Musselburgh, East Lothian, Scotland. Bob Ferguson won the Championship, by five strokes from runner-up Peter Paxton.", "After three rounds Bob Ferguson was tied for the lead with Peter Paxton with Ned Cosgrove only a shot behind. In the final round Ferguson scored 39 to Paxton's and Cosgrove's 44s to win by five strokes.", "|align=center|2 || Peter Paxton ||  || 81-86=167 ||"]}, {"page": "1883 Open Championship", "response": ["|Peter Paxton ||  || 46-39-39-43=167"]}, {"page": "1885 Open Championship", "response": ["Professionals: Jamie Allan, David Anderson Sr., David Anderson Jr., Willie Anderson Sr., David Auchterlonie, Joseph Auchterlonie, Tom Auchterlonie, David Ayton Sr., Willie Brown, Jack Burns, Ben Campbell, Willie Campbell, C. Conacher, David Corstorphine, William Cosgrove, Willie Dunn, George Fernie, J. Fernie, Willie Fernie, Thomas Gourlay, David Grant Sr., William Greig, Sandy Herd, J. Kinsman, Robert Kinsman, Hugh Kirkaldy, Jack Kirkaldy, Bob Martin, George Mason, Douglas McEwan, Jack Morris, James Morris, Tom Morris Sr., Frank Park, Mungo Park, Willie Park Jr., James Paxton, Peter Paxton, James Rennie, Ben Sayers, George Sayers, Archie Simpson, David Simpson, Jack Simpson, Robert Simpson", "|align=center|8 || Peter Paxton ||  || 85-91=176 || align=center|£1"]}, {"page": "East Berkshire Golf Club", "response": ["The course was designed by Peter Paxton."]}, {"page": "Davie Park", "response": ["In addition to his on-the-course skills as a player, Park was also an excellent club maker. He had as an apprentice Peter Paxton who would go on to be a fine player as well as a club and ball maker."]}, {"page": "Albert Tingey Sr.", "response": ["===Match vs. Peter Paxton===", "Tingey met Peter Paxton in a memorable match on 27 October 1900 on a windy and wet day at Tooting Bec Golf Club in south London. Paxton, playing on his home course, was likely the betting favorite, although his results going in were not equal with Tingey who in October 1899 had halved against the venerable Harry Vardon at Watford and had been playing better golf in the short term. Heavy rain the day before had soaked the course making approach shots and putting difficult. Playing in stiff winds, the first 27 holes were stubbornly contested to a draw, but Tingey pulled away in the end winning 4 and 3."]}, {"page": "Paxton, Peter", "response": ["#redirectPeter Paxton"]}]}}