{"wiki_id": "http://www.wikidata.org/entity/Q21884127", "itemLabel": "Thomas Lord Busby", "itemDescription": "British author, painter, and printmaker, active 1804-1837", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Lord_Busby", "wikipedia_page": {"main": "Thomas Lord Busby (baptized 10 November 1782, buried 5 May 1838) was an English portrait artist, etcher, and engraver.\nChristened into the Church of England in November 1782 at St Mary's Church, Whitechapel, Middlesex, Busby was the son of William and Lucy Busbey of Leman Street, Whitechapel.Although Busby left a large body of work, little is known of his life. The British Museum says of him \"Painter, etcher and humorous illustrator: active in London.\"The Benezit Dictionary of British Graphic Artists and Illustrators notes that Busby exhibited portraits at the Royal Academy and the Suffolk Street Gallery of the Royal Society of British Artists between 1804 and 1837 and adds that he is \"probably the same person as the T. L. Busby who exhibited portrait miniatures at the Royal Academy between 1804 and 1821\".\nBusby published several collections of etchings and engravings, including Costume of Hartlepool, an interesting Town in the North of England (1819), which contained six engravings to illustrate The History of Durham. On his Costume of the Lower Orders of London (1819), a critic has commented Busby’s Americans give it folkloric pathomorphic and philosophical twists. These foreigners never can be assimilated because… they specialize in exoticism itself.\nHis Costumes of the Lower Orders in Paris, which had in it twenty-nine coloured etchings, appeared in 1820, and The Cries of London: Drawn from Life in 1823. In 1824, the first issue of Busby’s Civil and Military Costume of the City of London was published and was dedicated by permission to King George IV.\n\nBusby’s portrait of the one-legged black busker Billy Waters was the inspiration of many Derby porcelain and Staffordshire pottery figures. This was one of the American figures appearing in his London collection of 1819 and was also in his Cries of London (1823).In February 1831, The Gentleman's Magazine noted a new engraving by Busby of William Kidd’s “The Traveller disturbed”.Busby was buried in the parish of Paddington in 1838, when his age was stated in the parish register as fifty-six and his abode as Streatham.", "link_mentions": {}}}