{"wiki_id": "http://www.wikidata.org/entity/Q2189091", "itemLabel": "Graham Dilley", "itemDescription": "Cricket player of England. (1959-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Graham_Dilley", "wikipedia_page": {"main": "Graham Roy Dilley (18 May 1959 – 5 October 2011) was an English international cricketer, whose main role was as a fast bowler. He played first-class cricket for Kent County Cricket Club and Worcestershire County Cricket Clubs, and appeared in 41 Test matches and 36 One Day International (ODIs) for the England cricket team.\nDilley is perhaps best remembered for his tail-end batting with Ian Botham in England's second innings against Australia at Headingley in 1981, reaching his highest Test score of 56 in an eighth-wicket partnership of 117 runs.", "link_mentions": [{"page": "The Ashes", "response": ["Despite suffering heavy defeats against the West Indies during the 1980s, England continued to do well in the Ashes. Mike Gatting was the captain in 1986–87 but his team started badly and attracted some criticism. Then Chris Broad scored three hundreds in successive Tests and bowling successes from Graham Dilley and Gladstone Small meant England won the series 2–1.Harte, pp. 662–664."]}, {"page": "Ian Botham", "response": ["Botham continued to play for England under Brearley and achieved the highpoint of his career in the next three Tests as England recovered to win The Ashes. In the third Test at Headingley, Australia opened with 401 for 9 declared, despite good bowling by Botham who took 6 for 95. England responded poorly and were dismissed for 174. Botham was the only batsman to perform at all well and scored 50, which was his first Test half-century since he had been awarded the captaincy thirteen Tests earlier. Having been forced to follow-on, England collapsed again and at 135 for 7 on the afternoon of the fourth day, an innings defeat looked certain. Bookmakers had reportedly been offering odds of 500/1 against an England win after the follow-on was enforced. Botham, himself not long at the wicket, was the sole remaining recognised batsman as he was joined by the fast bowler Graham Dilley, number nine in the batting order, with only Chris Old and Bob Willis to come. With able support from Dilley (56) and Old (29), Botham hit out and by the close of play was 145 not out with Willis hanging on at the other end on 1 not out. England's lead was just 124 but there remained a glimmer of hope. On the final day's play, Botham reached 149 not out before Willis's wicket fell. Australia, with plenty of time remaining, needed 130 to win and were generally expected to get them; but after Botham took the first wicket, Willis took 8 for 43 to dismiss Australia for only 111. England had won by 18 runs; it was only the second time in history that a team following on had won a Test match."]}, {"page": "May 18", "response": ["*1959 – Graham Dilley, English cricketer and coach (d. 2011)"]}, {"page": "Graeme Hick", "response": ["Hick's Worcestershire teammate Graham Dilley had been in no doubt that he would succeed, perhaps ironically given what was to follow writing that Hick exerted \"psychological pressure on the bowlers, like Viv Richards or Javed Miandad.\"", "Prior to Hick's England debut Graham Dilley was bullish, claiming that Hick was \"a lot tougher than people realise\","]}, {"page": "Follow-on", "response": ["By all accounts, everyone on both sides thought the game was lost. Ladbrokes famously offered 500–1 against England winning the Headingley Test. When Graham Dilley joined him at the crease, Botham reportedly said, \"Right then, let's have a bit of fun.\"  Botham, with able support from the lower order, went on to make 149 not out, and gave England a slender lead of 129. The next day a fired-up Bob Willis took 8 for 43, and Australia slumped to 111 all out."]}, {"page": "Worcestershire County Cricket Club", "response": [":1987: Graham Dilley"]}, {"page": "Kent County Cricket Club", "response": ["Other particularly notable former players include spin bowlers Colin Blythe and Tich Freeman. Blythe was a major force in the four County Championship wins in the years leading up to World War I and took 100 wickets in every season from 1902 to 1914.Colin Blythe - Profile, CricInfo. Retrieved 2016-02-29. He played 17 Tests for England but was killed in action during World War I. A memorial at the St Lawrence Ground is dedicated to him. Freeman played during the period after World War I and took over 150 wickets in a season for Kent 14 times. He is the only bowler to take more than 300 wickets in an English season, a feat he achieved in 1928, and the only man to have taken all ten wickets in an innings three times.Tich Freeman - Profile, CricInfo. Retrieved 2016-02-29. Fast bowler Graham Dilley represented England in 41 Test matches in the 1980s, whilst all-rounder Mark Ealham played in 64 one-day internationals in the 1990s and early 2000s."]}, {"page": "Dartford", "response": ["* Graham Dilley (1959–2011), Kent and England cricketer"]}, {"page": "Fifth Doctor", "response": ["*\"Graham Dilley Saves The World\" by Iain McLaughlin and Claire Bartlett, in Short Trips: Past Tense"]}, {"page": "English cricket team in Australia in 1986–87", "response": ["* Graham Dilley (Kent)", "Philip DeFreitas, in his debut tour, eventually turned into an effective bowler for England, though he was never able to live up to the \"Black Botham\" tag that some had given him. Graham Dilley was another who served England well until his final Test in 1989."]}, {"page": "Australian cricket team in England in 1981", "response": ["A galvanised Botham took 6 for 95 in Australia's first innings and scored 50 in England's, but Australia nonetheless compiled 401 for 9 declared (John Dyson scoring 102) and bowled England out for 174, thus forcing England to follow on 227 runs in arrears. Despite a stubborn 46 from Geoff Boycott, in the second innings Botham came to the crease with England on 105 for 5, still requiring 122 runs to avoid an innings defeat. He played an outstanding innings of 149 not out, sharing partnerships of 117 with Graham Dilley for the eighth wicket, 67 with Chris Old for the ninth and 37 with Bob Willis for the tenth, to set Australia a target of 130. Australia then reached 56 for 1, seemingly well set, before Brearley switched Willis' bowling end to allow him to bowl down the slope. Willis bowled a superb spell of 8 for 43 to dismiss Australia for 111; England became only the second team in Test Match history to win a match after being made to follow-on.Cricinfo - The great escape"]}, {"page": "Peter Willey", "response": ["In 1979, Willey caught Dennis Lillee off the bowling of Graham Dilley, resulting in a scorecard entry of: \"Lillee, c. Willey, b. Dilley\".Cricket Archive – match scorecard. Retrieved on 5 September 2009."]}, {"page": "List of nicknames used in cricket", "response": ["* Graham Dilley – Pica, Dill"]}, {"page": "South African rebel tours", "response": ["*Squad: Graham Gooch (captain), Dennis Amiss, Geoffrey Boycott, John Emburey, Mike Hendrick, Geoff Humpage, Alan Knott, Wayne Larkins, John Lever, Chris Old, Arnold Sidebottom, Les Taylor, Derek Underwood, Peter Willey, Bob Woolmer. Graham Dilley had pulled out of the tour before it got underway.", "In 1990, the final tour was led by former England captain Mike Gatting. The team included former and contemporary England players such as batsmen Tim Robinson, Bill Athey and Chris Broad, wicketkeeper Bruce French, and the fast bowlers Paul Jarvis, Graham Dilley and Neil Foster.", "*Squad: Mike Gatting (captain), Bill Athey, Kim Barnett, Chris Broad, Chris Cowdrey, Graham Dilley, Richard Ellison, John Emburey, Neil Foster, Bruce French, Paul Jarvis, Matthew Maynard, Tim Robinson, Greg Thomas, Alan Wells, David Graveney (player/manager)."]}, {"page": "Loughborough MCC University", "response": ["Loughborough MCCU are one of six MCCU teams in Britain, and are considered first-class when playing against other first-class sides. This means that a game against another university would not be considered first class; one against a county side which holds first-class status would.  The cricket coaching was overseen by assistant coach and former Test opening bowler Graham Dilley being Loughborough’s head coach, until his death in 2011, in charge of the technical programme. He was assisted by coaching support which has recently included Nottinghamshire’s Paul Johnson (batting) and Chris Read (wicket-keeping).  Dilley was assisted by: a director of cricket for development monitoring and academic mentoring; a fitness advisor experienced with both county clubs and ECB; a sports psychologist; a physiotherapist working with the squad on physical screening, injury prevention regimes and remedial treatment; and a range of additional generic sports science and sports medicine back-up on the Loughborough campus."]}, {"page": "Benson & Hedges Challenge", "response": ["Mike Gatting (captain), Bill Athey, Ian Botham, Chris Broad, Phillip DeFreitas, Graham Dilley, Phil Edmonds, John Emburey, Neil Foster, David Gower, Allan Lamb, Jack Richards, Gladstone Small"]}, {"page": "Phil Neale", "response": ["Neale's captaincy and contacts were a factor in attracting big name cricketers to Worcester. He played soccer professionally at Scunthorpe United with the England all-rounder Ian Botham, and when Botham fell out with Somerset, he joined Worcestershire. Botham was followed by a fellow England player, the fast bowler Graham Dilley, and Worcestershire also took on the Zimbabwean Graeme Hick, who later qualified for England. Neale's success in drawing team performances from a side not lacking in personalities won him nomination as a Wisden Cricketer of the Year in 1989."]}, {"page": "English cricket team in Australia and New Zealand in 1982–83", "response": ["The England selectors announced their squad on 11 September which flew out to Australia on 13 October. Doug Insole was appointed Tour Manager, with Norman Gifford as his assistant, while Warwickshire physiotherapist Bernard Thomas joined the squad for his eleventh successive tour. Veteran pace bowler Bob Willis was appointed captain. The squad was weakened by the absence of a number of players from the previous Ashes series who had become ineligible for selection; Graham Gooch, Geoff Boycott, John Emburey, Mike Hendrick, Alan Knott, Wayne Larkins, Chris Old, Peter Willey and Bob Woolmer were serving three-year bans from international cricket due to their participation in the rebel tour to South Africa. Somewhat more controversial was the omission of available players like Mike Gatting, Trevor Jesty, Graham Dilley and Phil Edmonds; Gatting and Edmonds had played pivotal roles in Middlesex' county championship success, Gatting scoring over 1600 runs at an average of nearly 59, as well as contributing 21 wickets, and Edmonds taking 80 wickets. With three off-spinners selected in the squad (Hemmings, Marks and Miller), his left-arm orthodox spin would have provided much-needed variety. To bolster their pace stocks, the selectors sprang a surprise by including 21-year-old Jamaican-born Norman Cowans."]}, {"page": "West Indian cricket team in England in 1988", "response": ["England omitted Eddie Hemmings, Bill Athey and Neal Radford from their squad of 14.  They won the toss and elected to put the West Indies in to bat.  Simmons and Greenidge made a first-wicket partnership of 34 before the former was caught by Allan Lamb off the bowling of Graham Dilley.  Bowling alternate overs, Pringle and Small then dismissed Greenidge, Richards and Richie Richardson, leaving the West Indies on 72 for four.  Gus Logie and Carl Hooper were restricted to singles as the England captain Gatting kept a tight in-field.  Hooper made his half-century before being dismissed one run later, caught by John Emburey off the bowling of Small. Logie fell to Small 11 runs later, caught behind, with the score on 180 for six.  The West Indies tail-enders provided little resistance to England, and the innings concluded with the visitors being dismissed for 217 off the last ball.  "]}, {"page": "1959 in the United Kingdom", "response": ["** Graham Dilley, crickieter (died 2011)"]}, {"page": "1983 Cricket World Cup squads", "response": ["| Graham Dilley"]}, {"page": "Bicentennial Test", "response": ["* Graham Dilley."]}, {"page": "List of people from Kent", "response": ["*Graham Dilley (born 1959) – cricketer for Kent and England"]}]}}