{"wiki_id": "http://www.wikidata.org/entity/Q21819933", "itemLabel": "Norman Engleback", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Engleback", "wikipedia_page": {"main": "Norman Engleback (5 October 1927 – 4 December 2015) was an English architect. He worked for the London County Council, and was the lead architect on the Queen Elizabeth Hall, the Purcell Room and the Hayward Gallery on the South Bank; and the National Recreation Centre at Crystal Palace (now the National Sports Centre).\nNorman Engleback was born on 5 October 1927 in Islington, London, the son of William Engleback, a north London scientific instrument maker, and his wife, Elsie (née Parry), a clerk to a manufacturer of floor polish.He died on 4 December 2015.National Life Stories conducted an oral history interview (C467/62) with Norman Engleback in 2001 for its Architects Lives' collection held by the British Library.", "link_mentions": [{"page": "Crystal Palace National Sports Centre", "response": ["The sports centre building was designed by the LCC Architects Department under project architect Norman Engleback between 1953–54 and is a Grade II* listed building.  It has a particularly interesting interior:  there is a central concourse with a complex and delicate exposed concrete frame supporting the roof, which has a folded teak lining, and to one side a series of pools, including a 50m competition pool, and a diving pool with a dramatic reinforced concrete diving platform, and to the other side a smaller sports arena."]}, {"page": "Hayward Gallery", "response": ["The Hayward Gallery was built by Higgs and HillCrown Works  Vauxhall Civic Society and opened on 9 July 1968. Its massing and extensive use of exposed concrete construction are features typical of Brutalist architecture. The initial concept was designed, with the Queen Elizabeth Hall and Purcell Room, as an addition to the Southbank Centre arts complex by team leader Norman Engleback, assisted by John Attenborough, Ron Herron and Warren Chalk,\"The Independent (article by Jonathan Glancey\"  accessed 24/02/93 two members of the later founded group Archigram, of the Department of Architecture and Civic Design of the Greater London Council. Warren Chalk then developed the site plan and connective first floor walkways, while Ron Herron worked on the acoustics for the Queen Elizabeth Hall. Alan Waterhouse, then Dennis Crompton, worked on the designs for the Hayward. The building is named after Sir Isaac Hayward, a former leader of the London County Council, the GLC's predecessor.Facts About London  accessed 02/01/08 Joanna Drew was the founding director; Ralph Rugoff has been director since 2006."]}, {"page": "2015 in the United Kingdom", "response": ["**Norman Engleback, 88, architect."]}, {"page": "Deaths in December 2015", "response": ["*Norman Engleback, 88, British architect."]}]}}