{"wiki_id": "http://www.wikidata.org/entity/Q21997557", "itemLabel": "Harry Hampton", "itemDescription": "Scottish-American professional golfer", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Hampton_(golfer)", "wikipedia_page": {"main": "Harry Hampton (March 21, 1889 – May 5, 1965) was a Scottish-American professional golfer. His best finish in a major championship was a tie for third place in the 1920 PGA Championship when he met Jock Hutchison (the eventual winner of the tournament) in a semi-final match and lost 4 and 3. He finished T7 in the 1927 U.S. Open and won seven tournaments during his professional playing career. Hampton was a good iron player and made 16 holes-in-one in his lifetime.", "link_mentions": [{"page": "Ryder Cup", "response": ["On 27 September 1920 Golf Illustrated wrote a letter to the Professional Golfers' Association of America with a suggestion that a team of 12 to 20 American professionals be chosen to play in the 1921 British Open, to be financed by popular subscription. At that time no American golfer had won the British Open. The idea was that of James D. Harnett, who worked for the magazine. The PGA of America made a positive reply and the idea was announced in the November 1920 issue. The fund was called the British Open Championship Fund. By the next spring the idea had been firmed-up. A team of 12 would be chosen, who would sail in time to play in a warm-up tournament at Gleneagles (the Glasgow Herald 1000 Guinea Tournament) prior to the British Open at St. Andrews, two weeks later. The team of 12 was chosen by PGA President George Sargent and PGA Secretary Alec Pirie, with the assistance of USGA Vice-President Robert Gardner. A team of 11 sailed from New York on the  on 24 May 1921 together with James Harnett, Harry Hampton deciding at the last minute that he could not travel."]}, {"page": "Truro, Nova Scotia", "response": ["* Harry Hampton, Scottish-American golf professional"]}, {"page": "Western Open", "response": ["| 1920 ||  Jock Hutchison || align=center|296 || align=center|+4 || 1 stroke ||  Jim Barnes Clarence Hackney Harry Hampton || Olympia Fields || Olympia Fields, Illinois"]}, {"page": "Michigan Open", "response": ["*1923 Harry Hampton"]}, {"page": "1927 U.S. Open (golf)", "response": ["|rowspan=2 align=center|T1 || Harry Hampton ||  || rowspan=2 align=center|73 || rowspan=2 align=center|+1", "|align=center|6 || Harry Hampton ||  || 73-78=151 || align=center|+7", "|Harry Hampton ||  || 73-78-80=231", "|Harry Hampton ||  || 73-78-80-77=308"]}, {"page": "1921 Open Championship", "response": ["The entries included an unusually large number of U.S.-based players following a funding-raising campaign by an American golf magazine. On 27 September 1920 Golf Illustrated wrote a letter to the Professional Golfers' Association of America with a suggestion that a team of twelve to twenty American professionals be chosen to play in the British Open, to be financed by popular subscription. At that time no American golfer had won the British Open. The idea was that of James D. Harnett, who worked for the magazine. The PGA of America made a positive reply and the idea was announced in the November 1920 issue. The fund was called the British Open Championship Fund. By the next spring the idea had been firmed-up. A team of 12 would be chosen, who would sail in time to play a warm-up tournament at Gleneagles (the Glasgow Herald 1000 Guinea Tournament) prior to the British Open at St Andrews, two weeks later. The team of 12 was chosen by PGA president George Sargent and PGA secretary Alec Pirie, with the assistance of USGA vice-president Robert Gardner. A team of 11 sailed from New York on the RMS Aquitania on 24 May, together with James Harnett, Harry Hampton deciding at the last minute that he could not travel. The American team was: Jim Barnes, Emmet French, Clarence Hackney, Walter Hagen, Charles Hoffner, Jock Hutchison, Tom Kerrigan, George McLean, Fred McLeod, Bill Mehlhorn, and Wilfrid Reid."]}, {"page": "1920 PGA Championship", "response": ["Harry Hampton made a surprising run by winning three consecutive matches before finally succumbing to Jock Hutchison in a semi-final match 4 and 3. James Douglas Edgar won the other semi-final over George McLean by a resounding 8 and 7 margin. Hutchison defeated Edgar, 1 up, in the final."]}, {"page": "1926 PGA Championship", "response": ["| Harry Hampton ||  "]}, {"page": "Harry Hampton (disambiguation)", "response": ["Harry Hampton was a recipient of the Victoria Cross.", "Harry Hampton may also refer to:", "*Harry Hampton (footballer, born 1885) (1885–1963), English international footballer", "*Harry Hampton (footballer, born 1888) (1888–1946), Irish international footballer", "*Harry Hampton (cricketer), English cricketer", "*Harry Hampton (golfer) (1889–1965), Scottish-American professional golfer"]}]}}