{"wiki_id": "http://www.wikidata.org/entity/Q219352", "itemLabel": "Harry Allen", "itemDescription": "footballer (1866-1895)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Allen_(footballer,_born_1866)", "wikipedia_page": {"main": "Harry Allen (19 January 1866 – 23 February 1895) was an English international footballer, who played most of his career for Wolverhampton Wanderers, and was their captain.", "link_mentions": [{"page": "1860s in association football", "response": ["* 19 January – Harry Allen (d. 1895), England international in five matches (1888–1890)."]}, {"page": "Harry Allen", "response": ["Harry Allen may refer to:", "*Harry Allen (footballer, born 1866) (1866–1895), Wolverhampton Wanderers and England footballer", "*Harry Allen (footballer, born 1879) (1879–1939), English footballer for Derby County and Leicester Fosse", "*Harry Allen (Australian footballer) (1890–1978), Australian rules footballer", "*Harry Allen (cricketer) (born 1996), English cricketer", "*Harry Allen (golfer) (1876–1924), American golfer", "*Harry Allen (ice hockey) (1923–1990), Canadian ice hockey player", "*Harry Allen (bowls), Canadian lawn bowls international", "*Harry Allen (Ontario politician) (1889–1963), provincial politician in Ontario, Canada", "*Harry Allen (journalist) (born 1964), hip-hop journalist, activist, and associate of Public Enemy", "*Harry Allen (musician) (born 1966), jazz tenor saxophonist", "*Harry Allen (actor) (1883–1951), Australian actor in California Straight Ahead!", "*Harry Allen (executioner) (1911–1992), hangman, one of the last British executioners", "*Harry Allen (designer) (born 1964), American industrial and interior designer", "*Harry Allen (trans man) (1882–1922), pioneer period Pacific Northwest transgender man"]}, {"page": "1889 FA Cup Final", "response": ["|MF || ||Harry Allen"]}, {"page": "1893 FA Cup Final", "response": ["The 1893 FA Cup Final was a football game contested by Wolverhampton Wanderers and Everton. Wolves won by a single goal, scored by Harry Allen.", "As the second half progressed, Everton began to tire, perhaps feeling the effects of 4 games in 10 days. On the hour mark, Wolves captain Harry Allen launched a hopeful lob from distance, which was misjudged by Williams and allowed to bounce into the net. Everton complained that the crowd had impeded their attempts to clear the ball, thus presenting Allen with the opportunity in the first place.", "| MF||  || Harry Allen (c)"]}, {"page": "1887–88 British Home Championship", "response": ["|align=left|Harry Allen"]}, {"page": "1889–90 British Home Championship", "response": ["|align=left|Harry Allen"]}, {"page": "Dickie Baugh", "response": ["Dick Baugh made his League debut on 8 September 1888, as a full–back for Wolverhampton Wanderers in a 1–1 draw against Aston Villa at Dudley Road, the then home of Wolverhampton Wanderers. Dick Baugh appeared in all of the Wolverhampton Wanderers 22 Football League matches in season 1888–89 and was part of a defence-line that kept four clean–sheets and restricted the opposition to one–League–goal–in–a–match on eight separate occasions. Dick Baugh and Harry Allen were the only Wolverhampton Wanderers players to appear in every League match in season 1888–89. Played in that season's FA Cup Final losing 3–0 to League Champions, Preston North End."]}, {"page": "Jimmy Forrest (footballer)", "response": ["As a result of Rovers' relative lack of success, none of their players were selected to represent England in the 1888 British Home Championship, with Forrest losing his place to Wolverhampton Wanderers's Harry Allen."]}, {"page": "1892–93 FA Cup", "response": ["The Final was  played on 25 March 1893 at Fallowfield Stadium. The final was contested by Wolverhampton Wanderers and Everton. Wolves won 1-0, with a single goal from Harry Allen."]}, {"page": "Fred Geary", "response": ["Geary failed to score for the next six games, before he and Alex Latta each scored hat-tricks in a 6–1 victory over Derby County on 5 November. Geary ended the league season as the club's top scorer (for the third time in four seasons) with 19 goals from 24 league appearances, as Everton finished third in the league table. Geary played in the first three matches of the FA Cup run, scoring four goals before a leg injury resulted in him missing the semi-final against Preston North End. Everton eventually defeated Preston after a second replay to set up a final against Wolverhampton Wanderers. Although Geary was now fit, he was not picked for the Final to be played at Fallowfield, Manchester on 25 March, with Alan Maxwell retaining his place at centre-forward. Wolves won the match with a goal from their captain, Harry Allen, as the Everton forwards were unable to break down Wolves' defence."]}, {"page": "1892–93 Everton F.C. season", "response": ["With Sunderland marching to the title and Everton having to settle for a distant third place, albeit after an excellent run in which saw them win nine of their last ten games it was the F A cup that captured the excitement as the club won through to the final for the first time. The selectors famously fielded a weakened side for the trip to Wolverhampton Wanderers in a league game a week before the two sides met in the cup final and won 4–2. Only four of that team appeared the following week at the cup final as Boyle and Latta were joined by Kelso, having re-established himself in defence ahead of Collins and Stewart who had taken over after Jamieson had left for Sheffield Wednesday the previous month. The major selection surprise was that Patrick Gordon was selected ahead of Fred Geary in attack. The game became farce when the fans encroached onto the woefully inadequate field at Fallowfield in Manchester and made it impossible for Latta and Milward to use their wing play to proper effect, the latter being physically tripped by a spectator on one occasion. Wolves won the game in the second half when Harry Allen's hopeful punt deceived Dick Williams who lost the ball in the sun. Everton were furious though that Allen had received the ball from a spectator who had kicked the ball of Dickie Boyle's toe as the Everton half was taking the ball away from danger and felt that the game should have been reduced to the level of a friendly with the cup being played for at a later date. The game would leave a bad taste in the mouths of every Evertonian for over a decade until they finally did win the cup in 1906."]}, {"page": "1888–89 Wolverhampton Wanderers F.C. season", "response": ["|align=\"left\"|HB||align=\"left\"| Harry Allen"]}]}}