{"wiki_id": "http://www.wikidata.org/entity/Q219784", "itemLabel": "Lawrence Durrell", "itemDescription": "British novelist, poet, dramatist, and travel writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Lawrence_Durrell", "wikipedia_page": {"main": "Lawrence George Durrell (; 27 February 1912 – 7 November 1990) was an expatriate British novelist, poet, dramatist, and travel writer. He was the eldest brother of naturalist and writer Gerald Durrell.\nBorn in India to British colonial parents, he was sent to England at the age of eleven for his education. He did not like formal education, but started writing poetry at age 15. His first book was published in 1935, when he was 23. In March 1935 he and his mother and younger siblings moved to the island of Corfu. Durrell spent many years thereafter living around the world.\nHis most famous work is The Alexandria Quartet, published between 1957 and 1960. The best-known novel in the series is the first, Justine. Beginning in 1974, Durrell published The Avignon Quintet, using many of the same techniques. The first of these novels, Monsieur, or the Prince of Darkness, won the James Tait Black Memorial Prize in 1974. The middle novel, Constance, or Solitary Practices, was nominated for the 1982 Booker Prize. By the end of the century, Durrell was a bestselling author and one of the most celebrated writers in England.Durrell supported his writing by working for many years in the Foreign Service of the British government. His sojourns in various places during and after World War II (such as his time in Alexandria, Egypt) inspired much of his work. He married four times, and had a daughter with each of his first two wives.", "link_mentions": [{"page": "Anaïs Nin", "response": ["Nin was a friend, and in some cases lover, of many literary figures, including Miller, John Steinbeck, Antonin Artaud, Edmund Wilson, Gore Vidal, James Agee, James Leo Herlihy, and Lawrence Durrell. Her passionate love affair and friendship with Miller strongly influenced her both sexually and as an author. Claims that Nin was bisexual were given added circulation by the 1990 Philip Kaufman film Henry & June about Miller and his second wife June Miller. The first unexpurgated portion of Nin's journal to be published, Henry and June, makes it clear that Nin was stirred by June to the point of saying (paraphrasing), \"I have become June,\" though it is unclear whether she consummated her feelings for her sexually. To both Anaïs and Henry, June was a femme fatale—irresistible, cunning, erotic. Nin gave June money, jewelry, clothes, often leaving herself without money."]}, {"page": "Cyprus", "response": ["Examples of Cyprus in foreign literature include the works of Shakespeare, with most of the play Othello by William Shakespeare set on the island of Cyprus. British writer Lawrence Durrell lived in Cyprus from 1952 until 1956, during his time working for the British colonial government on the island, and wrote the book Bitter Lemons about his time in Cyprus which won the second Duff Cooper Prize in 1957."]}, {"page": "Geography of Cyprus", "response": ["Even the highest peaks of the Kyrenia Range are hardly more than half the height of the great dome of the Troodos massif, Mount Olympus (), but their seemingly inaccessible, jagged slopes make them considerably more spectacular. British writer Lawrence Durrell, in Bitter Lemons, wrote of the Troodos as \"an unlovely jumble of crags and heavyweight rocks\" and of the Kyrenia Range as belonging to \"the world of Gothic Europe, its lofty crags studded with crusader castles.\""]}, {"page": "List of English-language poets", "response": ["*Lawrence Durrell (1912–1990, E)"]}, {"page": "Gnosticism", "response": ["Early 20th-century thinkers who heavily studied and were influenced by Gnosticism include Carl Jung (who supported Gnosticism), Eric Voegelin (who opposed it), Jorge Luis Borges (who included it in many of his short stories), and Aleister Crowley, with figures such as Hermann Hesse being more moderately influenced. René Guénon founded the gnostic review, La Gnose in 1909, before moving to a more Perennialist position, and founding his Traditionalist School. Gnostic Thelemite organizations, such as Ecclesia Gnostica Catholica and Ordo Templi Orientis, trace themselves to Crowley's thought. The discovery and translation of the Nag Hammadi library after 1945 has had a huge effect on Gnosticism since World War II. Intellectuals who were heavily influenced by Gnosticism in this period include Lawrence Durrell, Hans Jonas, Philip K. Dick and Harold Bloom, with Albert Camus and Allen Ginsberg being more moderately influenced. Celia Green has written on Gnostic Christianity in relation to her own philosophy.Green, Celia (1981, 2006). Advice to Clever Children. Oxford: Oxford Forum. xxxv–xxxvii. Alfred North Whitehead was aware of the existence of the newly discovered Gnostic scrolls. Accordingly, Michel Weber has proposed a Gnostic interpretation of his late metaphysics.Michael Weber. Contact Made Vision: The Apocryphal Whitehead Pub. in Michel Weber and William Desmond, Jr. (eds.), Handbook of Whiteheadian Process Thought, Frankfurt / Lancaster, Ontos Verlag, Process Thought X1 & X2, 2008, I, pp. 573–599."]}, {"page": "John Steinbeck", "response": ["Fifty years later, in 2012, the Nobel Prize opened its archives and it was revealed that Steinbeck was a \"compromise choice\" among a shortlist consisting of Steinbeck, British authors Robert Graves and Lawrence Durrell, French dramatist Jean Anouilh and Danish author Karen Blixen. The declassified documents showed that he was chosen as the best of a bad lot. \"There aren't any obvious candidates for the Nobel prize and the prize committee is in an unenviable situation,\" wrote committee member Henry Olsson. Although the committee believed Steinbeck's best work was behind him by 1962, committee member Anders Österling believed the release of his novel The Winter of Our Discontent showed that \"after some signs of slowing down in recent years, [Steinbeck has] regained his position as a social truth-teller [and is an] authentic realist fully equal to his predecessors Sinclair Lewis and Ernest Hemingway.\""]}, {"page": "Labyrinth", "response": ["The Argentine writer Jorge Luis Borges was entranced with the idea of the labyrinth, and used it extensively in his short stories (such as \"The House of Asterion\" in The Aleph).  His use of it has inspired other authors (e.g. Umberto Eco's The Name of the Rose, Mark Z. Danielewski's House of Leaves). Additionally, Roger Zelazny's fantasy series, The Chronicles of Amber, features a labyrinth, called \"the Pattern,\" which grants those who walk it the power to move between parallel worlds. The avant-garde multi-screen film, In the Labyrinth, presents a search for meaning in a symbolic modern labyrinth. In Rick Riordan's series Percy Jackson & the Olympians, the events of the fourth novel The Battle of the Labyrinth predominantly take place within the labyrinth of Daedalus, which has followed the heart of the West to settle beneath the United States. Australian author Sara Douglass incorporated some labyrinthine ideas in her series The Troy Game, in which the Labyrinth on Crete is one of several in the ancient world, created with the cities as a source of magical power. Lawrence Durrell's The Dark Labyrinth depicts travelers trapped underground in Crete. A magical labyrinth, based on the original myth, appears in the third episode of The Librarians (\"And The Horns of a Dilemma\")."]}, {"page": "November 7", "response": ["*1990 – Lawrence Durrell, British novelist, poet, dramatist, (b. 1912)"]}, {"page": "Pope Joan", "response": ["The Greek author Emmanuel Rhoides' 1866 novel, The Papess Joanne, was admired by Mark Twain and Alfred Jarry and freely translated by Lawrence Durrell as The Curious History of Pope Joan (1954). The American Donna Woolfolk Cross's 1996 historical romance, Pope Joan, was recently made into a German musical as well as the movie described below. Other novels include Wilhelm Smets's Das Mährchen von der Päpstin Johanna auf’s Neue erörtert (1829), Marjorie Bowen's Black Magic (1909), Ludwig Gorm's Päpstin Johanna (1912),  Yves Bichet's La Papesse Jeanne (2005), and Hugo N. Gerstl's Scribe: The Story of the Only Female Pope (2005).  Howard Pyle's The Merry Adventures of Robbin Hood contains a reference.", "* Lawrence Durrell, The Curious History of Pope Joan. London: Derek Verschoyle, 1954. Freely translated from the Greek Papissa Joanna, 1886, by Emmanuel Rhoides."]}, {"page": "1912", "response": ["* February 27 – Lawrence Durrell, British writer (d. 1990)"]}, {"page": "1990", "response": ["* November 7 – Lawrence Durrell, British writer (b. 1912)"]}, {"page": "Robert Graves", "response": ["UK government documents released in 2012 indicate that Graves turned down a CBE in 1957.http://www.cabinetoffice.gov.uk/sites/default/files/resources/document2012-01-24-075439.pdf In 2012 the Nobel Records were opened after 50 years, and it was revealed that Graves was among a shortlist of authors considered for the 1962 Nobel Prize in Literature, along with John Steinbeck (who was that year's recipient of the prize), Lawrence Durrell, Jean Anouilh and Karen Blixen. Graves was rejected because, even though he had written several historical novels, he was still primarily seen as a poet, and committee member Henry Olsson was reluctant to award any Anglo-Saxon poet the prize before the death of Ezra Pound, believing that other writers did not match his talent."]}, {"page": "Corfu", "response": ["* British naturalist Gerald Durrell wrote three books about his 1935–1940 childhood on Corfu: My Family and Other Animals; Birds, Beasts and Relatives; and The Garden of the Gods. His brother, literary author Lawrence Durrell, also wrote a volume about Corfu: Prospero's Cell: A Guide to the Landscape and Manners of the Island of Corcyra (Corfu).", "* Lawrence Durrell also lived in Corfu for some years and Lawrence wrote, among several other books on Greece, Prospero's Cell: A Guide to the Landscape and Manners of the Island of Corcyra"]}, {"page": "Moral relativism", "response": ["Examples of relativistic literary works: Gogol's Dead Souls; The Alexandria Quartet by Lawrence Durrell; Raymond Queneau's Zazie dans le métro. Or Nuria Perpinya's twenty literary interpretations of the Odyssey."]}, {"page": "Provence", "response": ["* Lawrence Durrell"]}, {"page": "Richard Aldington", "response": ["Richard Aldington (8 July 1892 – 27 July 1962), born Edward Godfree Aldington, was an English writer and poet, and an early associate of the Imagist movement. He was married to the poet Hilda Doolittle (H.D.) from 1911 to 1938. His 50-year writing career covered poetry, novels, criticism and biography. He edited The Egoist, a literary journal, and wrote for The Times Literary Supplement, Vogue, The Criterion and Poetry. His biography of Wellington (1946) won him the James Tait Black Memorial Prize. His contacts included writers like T. S. Eliot, D. H. Lawrence, Ezra Pound, W. B. Yeats, Lawrence Durrell and C. P. Snow. He championed Hilda Doolittle as the major poetic voice of the Imagist movement and helped her work gain international notice.", "Death of a Hero (1929), which Aldington called a \"jazz novel,\" was his semi-autobiographical response to the war. He started writing it almost immediately after the armistice was declared. The novel condemned Victorian materialism as a cause of the tragedy and waste of the war. Rejectionist, an \"Expressionist scream\", it was commended by Lawrence Durrell as \"the best war novel of the epoch\". It was developed mostly while Aldington was living on the island of Port-Cros in Provence, building on the manuscript from a decade before. Opening with a letter to the playwright Halcott Glover, the book takes a satirical, cynical, and critical stance on Victorian and Edwardian cant.Michael Copp (editor), An Imagist at War: The Complete War Poems of Richard Aldington (2002), p. 18. Published in September 1929, by Christmas it had sold more than 10,000 copies in England alone, part of a wave of war remembrances from writers such as Remarque, Sassoon, and Hemingway. The book was quickly translated into German and other European languages. In Russia the book was taken to be a wholesale attack on bourgeois politics, \"the inevitable result of the life which had preceded it\", as Aldington wrote. \"The next one will be much worse\". It was praised by Gorky as revolutionary, and the book, along with Aldington's later fiction, received huge Russian distribution. Aldington was, however, fiercely non-partisan in his politics, despite his passion for iconoclasm and feminism.Richard Aldington (1998) Death of a Hero, Dundurn Press, p. xi.", "*Literary Lifelines: The Richard Aldington and Lawrence Durrell Correspondence (1981)"]}, {"page": "Henry Miller", "response": ["In 1931, Miller was employed by the Chicago Tribune Paris edition as a proofreader, thanks to his friend Alfred Perlès, who worked there. Miller took this opportunity to submit some of his own articles under Perlès' name, since at that time only the editorial staff were permitted to publish in the paper. This period in Paris was highly creative for Miller, and during this time he also established a significant and influential network of authors circulating around the Villa Seurat.Gifford, James. Ed.  The Henry Miller-Herbert Read Letters: 1935–58. Ann Arbor: Roger Jackson Inc., 2007. At that time a young British author, Lawrence Durrell, became a lifelong friend. Miller's correspondence with Durrell was later published in two books. During his Paris period he was also influenced by the French Surrealists.", "In 1939 Lawrence Durrell, British novelist who was living in Corfu, Greece, invited Miller to Greece. Miller described the visit in The Colossus of Maroussi (1941), which he considered his best book. One of the first acknowledgments of Henry Miller as a major modern writer was by George Orwell in his 1940 essay \"Inside the Whale\", where he wrote:"]}, {"page": "Jean Anouilh", "response": ["In 1970 his work was recognized with the Prix mondial Cino Del Duca. In 2012, the Nobel Records were opened after 50 years and it was revealed that Anouilh was among a shortlist of authors considered for the 1962 Nobel Prize in Literature, along with John Steinbeck (winner), Robert Graves, Lawrence Durrell and Karen Blixen. According to a report in The Guardian, \"It is not clear why Anouilh was passed over, but the French poet Saint-John Perse had taken the Nobel in 1960, meaning that France was well represented on the roster of winners, and Svenska Dagbladet reveals that Jean-Paul Sartre, who won the prize in 1964, was starting to be seriously considered as a candidate.\""]}, {"page": "List of poets", "response": ["*Lawrence Durrell (1912–1990), English novelist, poet and dramatist"]}, {"page": "E. M. Forster", "response": ["*Michael Haag, Alexandria: City of Memory (London and New Haven, 2004). This portrait of Alexandria during the first half of the twentieth century includes a biographical account of E. M. Forster, his life in the city, his relationship with Constantine Cavafy, and his influence on Lawrence Durrell."]}, {"page": "Karen Blixen", "response": [", granted the inaugural Hans Christian Andersen Scholarship of the Danish Writers Association in 1955 and received the Henrik Pontoppidan Memorial Foundation Grant in 1959. Peter Englund, permanent secretary of the Swedish Academy, described it as \"a mistake\" that Blixen was not awarded the Nobel Prize in Literature during the 1930s and when Hemingway won the prize in 1954, he stated that Bernard Berenson, Carl Sandburg and Blixen deserved the prize more than he did. Although never awarded the prize, she finished in third place behind Graham Greene in 1961, the year Ivo Andrić was awarded the prize. In 2012, the Nobel records were opened after 50 years and it was revealed that Blixen was among a shortlist of authors considered for the 1962 Nobel Prize in Literature, along with John Steinbeck (the eventual winner), Robert Graves, Lawrence Durrell, and Jean Anouilh. Blixen became ineligible after dying in September of that year."]}, {"page": "List of winners and shortlisted authors of the Booker Prize", "response": ["|Lawrence Durrell || Constance or Solitary Practices || Faber & Faber"]}, {"page": "Patrick Leigh Fermor", "response": ["Leigh Fermor translated the manuscript The Cretan Runner written by George Psychoundakis, a dispatch runner on Crete during the war, and helped Psychoundakis get his work published. Leigh Fermor also wrote a novel, The Violins of Saint-Jacques, which was adapted as an opera by Malcolm Williamson. His friend Lawrence Durrell recounts in his book Bitter Lemons (1957) how, during the Cypriot insurgency against continued British rule in 1955, Leigh Fermor visited Durrell's villa in Bellapais, Cyprus: After a splendid dinner by the fire he starts singing, songs of Crete, Athens, Macedonia. When I go out to refill the ouzo bottle... I find the street completely filled with people listening in utter silence and darkness. Everyone seems struck dumb. 'What is it?' I say, catching sight of Frangos. 'Never have I heard of Englishmen singing Greek songs like this!' Their reverent amazement is touching; it is as if they want to embrace Paddy wherever he goes.Durrell, Lawrence. Bitter Lemons, pp. 103–104."]}, {"page": "Bellapais", "response": ["The village was the home for some years of Lawrence Durrell, who wrote about life in Cyprus in his book Bitter Lemons. He mentions passing the time drinking coffee under the Tree of Idleness in the village and there are two places which lay claim to being the spot.  His book did not identify it completely, and two establishments profit from the name.  His house, up a very steep climb, has a plaque on it and one can have the pleasure of returning by a not-quite-so-perpendicular way that passes by old olive presses."]}, {"page": "Battle of Crete", "response": ["*  Participants on the battle included David Coke • Roald Dahl • Roy Farran • Bernard Freyberg • Clive Hulme • Robert Laycock • Patrick Leigh Fermor • John Pendlebury • George Psychoundakis • Max Schmeling • Theodore Stephanides • Evelyn Waugh (the battle forms an important episode in Waugh's novel Officers and Gentlemen, part of the Sword of Honour trilogy) • Lawrence Durrell • Charles Upham • Geoffrey Cox • Dan Davin (New Zealand Official Historian of the battle)"]}, {"page": "English poetry", "response": ["Other significant poets to emerge in the 1940s include Lawrence Durrell, Bernard Spencer, Roy Fuller, Norman Nicholson, Vernon Watkins, R. S. Thomas and Norman MacCaig. These last four poets represent a trend towards regionalism and poets writing about their native areas; Watkins and Thomas in Wales, Nicholson in Cumberland and MacCaig in Scotland."]}, {"page": "Quincunx", "response": ["* Lawrence Durrell's novel sequence The Avignon Quintet is arranged in the form of a quincunx, according to the author; the final novel in the sequence is called Quinx, the plot of which includes the discovery of a quincunx of stones.."]}, {"page": "Gerald Durrell", "response": ["Gerald Malcolm Durrell,   (7 January 1925 – 30 January 1995) was a British naturalist, writer, zookeeper, conservationist, and television presenter. He founded the Durrell Wildlife Conservation Trust and the Jersey Zoo on the Channel Island of Jersey in 1959. He wrote approximately forty books, mainly about his life as an animal collector and enthusiast, the most famous being My Family and Other Animals (1956).  Those memoirs of his family's years living in Greece were adapted into two television series (My Family and Other Animals, 1987, and The Durrells, 2016–2019) and one television film (My Family and Other Animals, 2005). He was the youngest brother of novelist Lawrence Durrell.", "Durrell was a regular contributor to magazines on both sides of the Atlantic, including Harper's, Atlantic Monthly, and the Sunday Times Supplement. He was also a regular book reviewer for the New York Times. A number of excerpts and stories from his books were used by Octopus Books and Reader's Digest Publishing, including in the Reader's Digest Condensed Books. His works have been translated into 31 languages and made into TV serials and feature films. He has large followings in Northern and Eastern Europe, Russia, Israel, and various Commonwealth countries, including India. The British Library houses a collection of Durrell's books as part of the Lawrence Durrell Collection.", "* The town hall of Corfu announced in 2006 that it would rename Corfu Bosketto (a park in the city of Corfu) Bosketto Durrell, after Gerald and Lawrence Durrell as a mark of respect.", "* In The Footsteps of Lawrence Durrell and Gerald Durrell in Corfu (1935–39), Hilary Whitton Paipeti (1998)", "* \"Durrelliania\": An Illustrated Checklist of Inscribed Books of Lawrence Durrell and Gerald Durrell and Associated Publications, Letters and Notes in the Library of Jeremy J. C. Mallinson, edited by Jeremy Mallinson (1999)", "* Amateurs in Eden: The Story of a Bohemian Marriage: Nancy and Lawrence Durrell, Joanna Hodgkin (2012)", "* Prospero's Cell: A Guide to the Landscape and Manners of the Island of Corcyra, Lawrence Durrell (1945)", "* Spirit of Place: Essays and Letters on Travel, Lawrence Durrell (1969)", "* The Durrell-Miller Letters: 1935-1980, Lawrence Durrell and Arthur Miller (1998)"]}, {"page": "1912 in literature", "response": ["*February 27 – Lawrence Durrell, English poet and novelist (died 1990)"]}, {"page": "1990 in literature", "response": ["*November 7 – Lawrence Durrell, English novelist, dramatist, and travel writer (born 1912)"]}, {"page": "1986 in literature", "response": ["*Cholmondeley Award: Lawrence Durrell, James Fenton, Selima Hill"]}, {"page": "1935 in literature", "response": ["*Lawrence Durrell – Pied Piper of Lovers"]}, {"page": "1937 in literature", "response": ["*Lawrence Durrell (as Charles Norden) – Panic Spring"]}, {"page": "1938 in literature", "response": ["*Lawrence Durrell – The Black Book"]}, {"page": "1953 in literature", "response": ["*Lawrence Durrell – Reflections on a Marine Venus"]}, {"page": "1974 in literature", "response": ["*Lawrence Durrell – Monsieur", "*James Tait Black Memorial Prize for fiction: Lawrence Durrell, Monsieur, or the Prince of Darkness"]}, {"page": "1970 in literature", "response": ["*Lawrence Durrell – Nunquam"]}, {"page": "1968 in literature", "response": ["*Lawrence Durrell – Tunc"]}, {"page": "Lake Mariout", "response": ["*Lawrence Durrell writes about the lake using its ancient name Lake Mareotis in his tetralogy of novels The Alexandria Quartet, where it is the setting for a duck shoot."]}, {"page": "1957 in literature", "response": ["**Justine, the first novel in Lawrence Durrell's The Alexandria Quartet, is published. The last will be published in 1960.", "*Lawrence Durrell – Justine"]}, {"page": "1958 in literature", "response": ["*Lawrence Durrell"]}, {"page": "1960 in literature", "response": ["*Lawrence Durrell – Clea (final volume of The Alexandria Quartet, begun 1957)"]}, {"page": "Raymond Carver", "response": ["In his essay \"On Influence\", Carver states that, while he was an admirer of Ernest Hemingway's fiction, he never saw him as an influence, citing instead the work of Lawrence Durrell."]}, {"page": "Elizabeth Smart (Canadian author)", "response": ["Eager to launch her writing career, Smart quit the Journal and left Ottawa for good. Traveling on her own, she visited New York, Mexico and California, joining a writers' colony at Big Sur. While there, Smart made contact with Barker through Lawrence Durrell, paying to fly Barker and his wife to the United States from Japan where he was teaching. Soon after meeting, they began a tumultuous affair which was to last for years."]}, {"page": "The World at War", "response": ["The series featured interviews with major members of the Allied and Axis campaigns, including eyewitness accounts from civilians, enlisted men, officers and politicians. Among these were Sir Max Aitken, Joseph Lawton Collins, Mark Clark, Jock Colville, Karl Dönitz, James \"Jimmy\" Doolittle, Lawrence Durrell, Lord Eden of Avon, Mitsuo Fuchida, Adolf Galland, Minoru Genda, W. Averell Harriman, Sir Arthur Harris, Alger Hiss, Brian Horrocks, Traudl Junge, Toshikazu Kase, Curtis LeMay, Vera Lynn, Hasso von Manteuffel, Bill Mauldin, John J. McCloy, Lord Mountbatten of Burma, J. B. Priestley, Saburo Sakai, Albert Speer, James Stewart, Charles Sweeney, Paul Tibbets, Walter Warlimont, Takeo Yoshikawa, and historian Stephen Ambrose."]}, {"page": "My Family and Other Animals", "response": ["Durrell had already written several successful books about his trips collecting animals in the wild for zoos when he published My Family and Other Animals in 1956. Its comic exaggeration of the foibles of his family – including his eldest brother Lawrence Durrell, who became a celebrated novelist and poet – and his heartfelt appreciation of the natural world made it very successful. Durrell was able to found the Jersey Zoological Park (now known as the Durrell Wildlife Park) in the Channel Islands. He also became known as a novel-writer and television personality. His books helped stimulate the development of tourism in Corfu.", "However, the book does succeed in preserving the impressions of ten- to fourteen-year-old Gerald extremely vividly and with a great deal of light-hearted humour. Despite the omissions and inaccuracies, Lawrence Durrell commented: \"This is a very wicked, very funny, and I'm afraid rather truthful book – the best argument I know for keeping thirteen-year-olds at boarding-schools and not letting them hang about the house listening in to conversations of their elders and betters\"."]}]}}