{"wiki_id": "http://www.wikidata.org/entity/Q21931904", "itemLabel": "Vincent Wong", "itemDescription": "British actor (1928-2015)", "wikipedia_url": "https://en.wikipedia.org/wiki/Vincent_Wong_(UK_actor)", "wikipedia_page": {"main": "Vincent Wong (4 February 1928 – 13 March 2015) was a British-Chinese actor who had a long career (over 50 years) in television and films. He acted in four James Bond films and in two Batman films.", "link_mentions": [{"page": "2001 in film", "response": ["| Kiss of the Dragon || 20th Century Fox || Chris Nahon (director); Luc Besson, Robert Mark Kamen (screenplay); Jet Li, Bridget Fonda, Tchéky Karyo, Max Ryan, Ric Young, Burt Kwouk, Kentaro, Laurence Ashley, Cyril Raffaelli, Didier Azoulay, John Forgeham, Paul Barrett, Colin Prince, Vincent Glo, Vincent Wong || Martial Arts || Live action"]}, {"page": "2002 in film", "response": ["| Die Another Day || Metro-Goldwyn-Mayer || Lee Tamahori (director); Neal Purvis, Robert Wade (screenplay); Pierce Brosnan, Halle Berry, Toby Stephens, Rick Yune, Rosamund Pike, Judi Dench, John Cleese, Michael Madsen, Samantha Bond, Colin Salmon,  Will Yun Lee, Kenneth Tsang, Michael Gorevoy, Lawrence Makoare, Madonna, Ho Yi, Rachel Grant, Emilio Echevarria, Vincent Wong, Joaquin Martinez, Deborah Moore, Oliver Skeete || Action || Live Action"]}, {"page": "1986 in film", "response": ["| Little Shop of Horrors || Warner Bros. Pictures / The Geffen Film Company || Frank Oz (director); Howard Ashman (screenplay); Rick Moranis, Ellen Greene, Vincent Gardenia, Steve Martin, Jim Belushi, John Candy, Christopher Guest, Bill Murray, Tichina Arnold, Michelle Weeks, Tisha Campbell, Levi Stubbs, Miriam Margoyles, Stanley Jones, Mak Wilson, Danny John-Jules, Heather Henson, Vincent Wong, Kerry Shale, Anthony Asbury, Brian Henson, Mak Wilson, David Barclay, Marcus Clarke, Toby Philpott, Don Austen, William Todd-Jones, Michael Quinn, James Barton, Ronnie Le Drew, Danny Cunningham, Gary Palmer, Paul Swaby, Robert Tygner, Sue Dacre, Paul Springer, David Greenaway, Michael Bayliss, Michael Barclay, Chris Leith, Terry Lee, Ian Tregonning, John Alexander, James Barton, Graham Fletcher || Musical, Horror, Black Comedy || Live action / Puppetry"]}, {"page": "Batman Begins", "response": ["Other cast members include Mark Boone Junior as Arnold Flass, Gordon's corrupt partner; Linus Roache as Thomas Wayne, Bruce's late father; Larry Holden as district attorney Carl Finch; Colin McFarlane as Gillian B. Loeb, the police commissioner; Christine Adams as Jessica, William Earle's secretary; Vincent Wong as an old Asian prisoner; Sara Stewart as Martha Wayne, Bruce's late mother; Richard Brake as Joe Chill, the Waynes' killer; Gerard Murphy as the corrupt High Court Judge Faden; Charles Edwards as a Wayne Enterprises executive; Tim Booth as Victor Zsasz; Rade Šerbedžija as a homeless man, who is the last person to meet Bruce when he leaves Gotham, and the first civilian to see Batman, Risteárd Cooper and Andrew Pleavin as uniformed policemen, and Shane Rimmer and Jeremy Theobald (the star and co-producer of Nolan's 1998 film Following) as Gotham Water Board technicians. Jack Gleeson, who had previously co-starred with Bale in 2002's Reign of Fire and later found fame for his role as Joffrey Baratheon in the HBO series Game of Thrones, appears as a young admirer of Batman who is later saved by him from Ra's al Ghul's men; Gleeson was cast at Bale's recommendation. Actors John Foo, Joey Ansah, Spencer Wilding, Dave Legeno, Khan Bonfils, Mark Strange, Grant Guirey, Rodney Ryan and Dean Alexandrou portray members of the League of Shadows. Hayden Nickel made his acting debut portraying James Gordon Jr."]}, {"page": "Mind Your Language", "response": ["* Fu Wong Chang, portrayed by Vincent Wong (13 episodes)"]}, {"page": "Kiss of the Dragon", "response": ["* Vincent Wong as Minister Tang"]}, {"page": "Holly & Stephen's Saturday Showdown", "response": ["The game Name That Tone saw the introduction of a man by the name of Mr. Lee (played by Vincent Wong), whose original intention was to solely deliver the list of ring tones to whoever was hosting the game to the song of his same name by The Bobbettes - and the autumn saw the arrival of a puppy called Snowy, who like The Hyenas had his name chosen from viewers' suggestions.", "Mr. Lee (played by Vincent Wong) brings on the ring-tones to his own theme tune. Then, contestants from the studio audience pair up with either one of the presenters or the show's celebrity guest to guess the titles of songs in the form of ring-tones, usually for a mobile phone or an MP3. A spin-off show entitled \"MOM's Name that Tone\" featured on CITV on Tuesdays for a while."]}, {"page": "List of Singaporean films", "response": ["|August 2001||Hype||Vincent Wong||nuSTUDIOS, NUS||$19,000||NA"]}, {"page": "List of Dempsey and Makepeace episodes", "response": ["| William Boyde, Brian Coburn, Zienia Merton, Ralph Michael, Vincent Wong, Arnold Lee, Paul Cooper "]}, {"page": "Out for a Kill", "response": ["Burns, referred to by the Chinese drug barons as the \"gweilo Professor\", is quickly released and sent to the USA, where he promises Yi's father Luo Dazhong (Vincent Wong) that he will get revenge for Yi's murder, but Wong is not done with Burns yet.", "* Vincent Wong as Luo Dazhong  "]}, {"page": "List of The Professionals episodes", "response": ["| Chai Lee, John Forgeham, Sharon Duce, Pik-Sen Lim, Arnold Lee, Gertan Klauber, James Marcus, George Little, Andy Ho, Vincent Wong, Rex Wei, Peta Bernard, Kenneth Watson", "| David Yip, Philip Latham, Derek Waring, Megumi Shimanuki, Richard Moore, Owen Holder, Rayner Bourton, Toni Kanal, Vincent Wong, Rex Wei, Heather Emmanuel"]}, {"page": "Noble House (miniseries)", "response": ["*Vincent Wong as Lim Chu"]}, {"page": "List of American films of 2005", "response": ["| Batman Begins || Warner Bros. Pictures / DC Comics || Christopher Nolan (director/screenplay); David S. Goyer (screenplay); Christian Bale, Michael Caine, Liam Neeson, Katie Holmes, Gary Oldman, Cillian Murphy, Tom Wilkinson, Rutger Hauer, Ken Watanabe, Morgan Freeman, Mark Boone Junior, Linus Roache, Rade Šerbedžija, Larry Holden, Colin McFarlane, Christine Adams, Vincent Wong, Sara Stewart, Richard Brake, Gerard Murphy, Charles Edwards, Tim Booth, Risteárd Cooper, Andrew Pleavin, Shane Rimmer, Jeremy Theobald, Jack Gleeson, John Foo, Joey Ansah, Spencer Wilding, Dave Legeno, Khan Bonfils, Mark Strange, Grant Guirey, Rodney Ryan, Dean Alexandrou || Superhero, Action, Drama ||"]}, {"page": "Silver Dream Racer", "response": ["* Vincent Wong as 1st Japanese Man"]}, {"page": "List of recurring actors in the James Bond film series", "response": ["===Vincent Wong===", "Vincent Wong is known for his role as General Li in Die Another Day (2002). He has two uncredited appearances also."]}, {"page": "Privates on Parade (film)", "response": ["* Vincent Wong – Cheng"]}, {"page": "Ping Pong (1986 film)", "response": ["* Vincent Wong as Chinese Gambler"]}, {"page": "2015 in film", "response": ["| style=\"text-align:center;\"| 13 || Vincent Wong || style=\"text-align:center;\"| 87 || style=\"text-align:center;\"| English || style=\"text-align:center;\"| Actor || "]}, {"page": "List of British films of 2015", "response": ["| style=\"text-align:center;\"| 13 || Vincent Wong || style=\"text-align:center;\"| 87 || style=\"text-align:center;\"| British || style=\"text-align:center;\"| Actor || "]}, {"page": "Performance (TV series)", "response": ["|John Gielgud,Terence Rigby,Rosemary Harris,Mike McShaneVincent Wong"]}, {"page": "2015 in the United Kingdom", "response": ["**Vincent Wong, 87, British actor (Doctor Who, James Bond, Batman)"]}, {"page": "Deaths in March 2015", "response": ["*Vincent Wong, 87, British actor (Doctor Who, Die Another Day, Pink Floyd – The Wall)."]}, {"page": "Vincent Wong", "response": ["Vincent Wong may refer to:", "* Vincent Wong (Hong Kong actor) (born 1983), Hong Kong actor", "* Vincent Wong Wing Ki (born 1990), Hong Kong badminton player", "* Vincent Wong (UK actor) (1928–2015), British-Chinese actor who appeared in four Bond films"]}, {"page": "Vincent Wong (UK Actor)", "response": ["#REDIRECT Vincent Wong (UK actor)"]}, {"page": "Mr. Lee (song)", "response": ["In the United Kingdom, the song was used in the CITV Saturday Morning TV Show Ministry of Mayhem. It was used as the theme song to introduce the character Mr Lee, who would deliver the ringtones for the Name That Tone game. Mr. Lee was played by Vincent Wong."]}, {"page": "2015 deaths in British television", "response": ["|Vincent Wong"]}]}}