{"wiki_id": "http://www.wikidata.org/entity/Q219086", "itemLabel": "Mungo Park", "itemDescription": "Scottish naturalist and explorer of the African continent", "wikipedia_url": "https://en.wikipedia.org/wiki/Mungo_Park_(explorer)", "wikipedia_page": {"main": "Mungo Park (11 September 1771 – 1806) was a Scottish explorer of West Africa. After an exploration of the upper Niger River around 1796, he wrote a popular and influential travel book titled Travels in the Interior Districts of Africa in which he theorized the Niger and Congo merged to become the same river. He was killed during a second expedition, having successfully traveled about two-thirds of the way down the Niger. With Park's death, the idea of a Niger-Congo merger remained an open question although it became the leading theory among geographers. The mystery of the Niger's course, which had been speculated about since the Ancient Greeks and was second only to the mystery of the Nile's source, was not solved for another 25 years, in 1830, when it was discovered the Niger and Congo were in fact separate rivers. \nIf the African Association was the \"beginning of the age of African exploration\" then Mungo Park was its first successful explorer; he set a standard for all who followed. Park was the first Westerner to have recorded travels in the central portion of the Niger, and through his popular book introduced the public to a vast unexplored continent which influenced future European explorers and colonial ambitions in Africa.", "link_mentions": [{"page": "List of Scots", "response": ["* Mungo Park (1771–1806), botanist and surgeon who conducted many journeys to Africa and was the first Westerner to encounter the central portion of the Niger River"]}, {"page": "History of Africa", "response": ["Knowledge of Africa increased. Numerous European explorers began to explore the continent. Mungo Park traversed the Niger River. James Bruce travelled through Ethiopia and located the source of the Blue Nile. Richard Francis Burton was the first European at Lake Tanganyika. Samuel White Baker explored the Upper Nile. John Hanning Speke located a source of the Nile at Lake Victoria. Other significant European explorers included Heinrich Barth, Henry Morton Stanley (coiner of the term \"Dark Continent\" for Africa in an 1878 book), Silva Porto, Alexandre de Serpa Pinto, Rene Caille, Friedrich Gerhard Rohlfs, Gustav Nachtigal, George Schweinfurth, and Joseph Thomson. The most famous of the explorers was David Livingstone, who explored southern Africa and traversed the continent from the Atlantic at Luanda to the Indian Ocean at Quelimane. European explorers made use of African guides and servants, and established long-distance trading routes.Shillington (2005), p. 295.Collins and Burns (2007), pp. 254–257."]}, {"page": "Kora (instrument)", "response": ["Mungo Park. The most likely scenario, based on Mandinka oral tradition, suggests that the origins of the kora may ultimately be linked with Jali Mady Fouling Cissoko, some time after the founding of Kaabu in the 16th century."]}, {"page": "Niger", "response": ["In the 19th century Europeans began to take a greater interest in Africa; several European explorers travelled in the area of modern Niger, such as Mungo Park (in 1805–06), the Oudney-Denham-Clapperton expedition (1822–25), Heinrich Barth (1850–55; with James Richardson and Adolf Overweg), Friedrich Gerhard Rohlfs (1865–67), Gustav Nachtigal (1869–74) and Parfait-Louis Monteil (1890–92)."]}, {"page": "History of Niger", "response": ["In the 19th century, contact with Europe began when the first European explorers—notably Mungo Park (British) and Heinrich Barth (German)-explored the area searching for the mouth of the Niger River. Although French efforts at pacification began before 1900, dissident ethnic groups, especially the desert Tuareg, were not subdued until 1922, when Niger became a French colony."]}, {"page": "Niger River", "response": ["Medieval European maps applied the name Niger to the middle reaches of the river, in modern Mali, but Quorra (Kworra) to the lower reaches in modern Nigeria, as these were not recognized at the time as being the same river. When European colonial powers began to send ships along the west coast of Africa in the 16th and 17th centuries, the Senegal River was often postulated to be the seaward end of the Niger. The Niger Delta, pouring into the Atlantic through mangrove swamps and thousands of distributaries along more than , was thought to be coastal wetlands. It was only with the 18th-century visits of Mungo Park, who travelled down the Niger River and visited the great Sahelian empires of his day, that Europeans correctly identified the course of the Niger and extended the name to its entire course.", "Many European expeditions to plot the river were unsuccessful.Plumb, 1952. In 1788 the African Association was formed in England to promote the exploration of Africa in the hopes of locating the Niger, and in June 1796 the Scottish explorer Mungo Park was the first European to lay eyes on the middle portion of the river since antiquity (and perhaps ever). He wrote an account in 1799, Travels in the Interior of Africa. Park proposed a theory that the Niger and Congo were the same river. Although the Niger Delta would seem like an obvious candidate, it was a maze of streams and swamps that did not look like the head of a great river. He died in 1806 on a second expedition attempting to prove the Niger-Congo connection. The theory became the leading one in Europe. Several failed expeditions followed; however the mystery of the Niger would not be solved for another 25 years, in 1830, when Richard Lander and his brother became the first Europeans to follow the course of the Niger to the ocean."]}, {"page": "September 11", "response": ["*1771 – Mungo Park, Scottish surgeon and explorer (d. 1806)"]}, {"page": "1796", "response": ["* June 21 – British explorer Mungo Park becomes the first European to reach the Niger River.", "* July 21 – Mungo Park reaches Ségou, the capital of the Bamana Empire."]}, {"page": "1806", "response": ["* Mungo Park, Scottish explorer (b. 1771)"]}, {"page": "1771", "response": ["* September 11 – Mungo Park, Scottish explorer (d. 1806)"]}, {"page": "Atlantic slave trade", "response": ["The treatment of slaves in Africa was more variable than in the Americas. At one extreme, the kings of Dahomey routinely slaughtered slaves in hundreds or thousands in sacrificial rituals, and slaves as human sacrifices were also known in Cameroon.Kevin Shillington, ed. (2005), Encyclopedia of African History, CRC Press, vol. 1, pp. 333–334; Nicolas Argenti (2007), The Intestines of the State: Youth, Violence and Belated Histories in the Cameroon Grassfields, University of Chicago Press, p. 42. On the other hand, slaves in other places were often treated as part of the family, \"adopted children\", with significant rights including the right to marry without their masters' permission.Rights & Treatment of Slaves . Gambia Information Site. Scottish explorer Mungo Park wrote:"]}, {"page": "List of explorers", "response": ["| Mungo Park"]}, {"page": "History of the Gambia", "response": ["It was once again handed back to the Royal African Company. However, they made no attempt to administer the Gambia. In 1785, Lemain Island was acquired by the British government with the view of the establishment of a convict settlement, but nothing came of the plan. For the next thirty years, British influence in the Gambia was confined to the operations of a small number of traders. Settlements were established by these traders along the river banks. Among these settlements, the most important probably was Pisania. This settlement, which was already in operation by 1779, was occupied by Dr John Laidley and a family by the name of Aynsley. Subsequently, Laidley and the Aynsleys rendered invaluable assistance to Major Daniel Houghton in 1790, Mungo Park in 1795 and 1805, and Major William Grey in 1818, in the course of their journeys into the interior of Africa."]}, {"page": "Scottish Enlightenment", "response": ["* Mungo Park (1771–1806) explorer of West Africa "]}, {"page": "List of museums in Scotland", "response": ["| Sir Walter Scott's Courtroom || 125px || Selkirk || Scottish Borders || Scottish Borders || Local || website, 19th-century Sheriff Court where author Sir Walter Scott dispensed justice to the people of Selkirkshire, exhibits on his life and works, as well as local poet and author James Hogg, explorer Mungo Park, local history and culture"]}, {"page": "Yarrow Water", "response": ["The valley was the birthplace of Mungo Park and has inspired several well-known songs and poems. Its traditions and folk tales were well documented by Walter Scott, who spent part of his childhood nearby, and in adult life returned to live in the vicinity at Abbotsford House, near Melrose.\"Sandyknowe and Early Childhood\" walterscott.lib.ed.ac.uk. Retrieved 26 July 2009.- \"Welcome to Abbotsford\". scottsabbotsford.co.uk. Retrieved 26 July 2009.", "The explorer Mungo Park was born at Foulshiels on the left bank of the river in 1771.\"Foulshiels\"  Gazetteer for Scotland. The Institute of Geography, University of Edinburgh. Retrieved 25 July 2009. In May 1804 Walter Scott came upon Park throwing stones into a deep pool in the river and remarked that \"This appears but an idle amusement for one who has seen so much adventure\". Park replied that this was \"Not so idle perhaps, as you suppose. This was the way I used to ascertain the depth of a river in Africa\". Although he had not yet told anyone, Park was considering his second and fateful expedition at the time. At about the same time, James Hogg (\"The Ettrick Shepherd\") had come to the attention of Scott whilst the former was working at Blackhouse Farm in the Yarrow valley.\"James Hogg: The Ettrick Shepherd\" ettrickyarrow.bordernet.co.uk. Retrieved 25 July 2009."]}, {"page": "T. C. Boyle", "response": ["|Mungo Park"]}, {"page": "John Leyden", "response": ["Other work on Scottish customs includes the editing of the 16th-century tract The Complaynt of Scotland, adding an essay exploring Scottish folk music and customs, printing a volume of Scottish descriptive poems, and nearly finishing his Scenes of Infancy, a diffuse poem based on border scenes and traditions. Leyden meanwhile compiled a work on the Discoveries and Settlements of Europeans in Northern and Western Africa, suggested by Mungo Park's travels, He also made some translations from Persian and Arabic poetry."]}, {"page": "Vitellaria", "response": ["The tree was formerly classified in the genus Butyrospermum, meaning \"butter seed\". The species name parkii honors Scottish explorer Mungo Park, who learned of the tree while exploring Senegal. Park's Scottish origin is reflected in the English word shea, with a final -ea."]}, {"page": "Robert Brown (botanist, born 1773)", "response": ["In 1798, Brown heard that Mungo Park had withdrawn from a proposed expedition into the interior of New Holland (now Australia), leaving a vacancy for a naturalist. At Brown's request, Correia wrote to Sir Joseph Banks, suggesting Brown as a suitable replacement:  He was not selected, and the expedition did not end up going ahead as originally proposed, though George Caley was sent to New South Wales as a botanical collector for Banks. In 1800, however, Matthew Flinders put to Banks a proposal for an expedition that would answer the question whether New Holland was one island or several. Banks approved Flinders' proposal, and in December 1800 wrote to Brown offering him the position of naturalist to the expedition. Brown accepted immediately.Mabberley (1985), pp. 59–63."]}, {"page": "Peebles", "response": ["*Mungo Park (1771–1806), practised medicine, and his house on the north of the Cuddy bears a commemorative plaque"]}, {"page": "Selkirk, Scottish Borders", "response": ["The town has associations with Mungo Park (explorer); James Hogg (\"The Ettrick Shepherd\"), a local poet and writer; and Sir Walter Scott, a writer of romances in the late 18th and early 19th centuries. It is also home to Scotland's oldest horse racing track, the Gala Rig, on the outskirts of the town.", "thumb|High Street, Selkirk, and the Mungo Park Monument (2018).", "*Mungo Park (1771–1806), explorer of the African continent"]}, {"page": "1771 in science", "response": ["* September 11 – Mungo Park (died 1806), Scottish explorer."]}, {"page": "1796 in science", "response": ["* June 21 – Mungo Park becomes the first European to reach the Niger River."]}, {"page": "1806 in science", "response": ["* c. January?? – Mungo Park, Scottish explorer of West Africa (born 1771)"]}, {"page": "1806 in Canada", "response": ["* Mungo Park killed by natives on Niger River in Africa."]}, {"page": "James Rennell", "response": ["Rennell's first and most influential work was the Bengal Atlas (1779) which was followed by the first detailed map of India (1783), the Geographical System of Herodotus (1800), the Comparative Geography of Western Asia (1831), and important studies on the geography of northern Africa—apparent in introductions to the Travels of Mungo Park and Hornemann. He however forged the geographic data of Park by introducing a mountain range, the Mountains of Kong, supposedly located in the western part of Africa. The fake was intended to support his own theory on the course of the Niger River. The Mountains of Kong remained present in maps until the early 20th century. He also contributed papers to Archaeologia on the site of Babylon, the island of St Paul's shipwreck, and the landing-place of Caesar in Britain. Rennell published a book titled Memoir of a map of Hindoostan (1788) and dedicated to Sir Joseph Banks."]}, {"page": "René Caillié", "response": ["Caillié found employment for six months in Guadeloupe. While there he read Mungo Park's account of his exploration of the Middle Niger in present-day Mali. Park had been the first European to reach the Niger River and visit the towns of Ségou, Sansanding and Bamako. An account of his first trip had been published in French in 1799. Park made a second expedition beginning in 1805 but was drowned in descending the rapids on the Niger, near Bussa, in present-day Nigeria. An account of the second trip had been published in English in 1815.", "Caillié reached Kankan in present-day Guinea on 17 June 1827 travelling with a caravan transporting kola nuts. He stayed there for a month. The town was an important commercial centre with a market held three times a week. Instead of having a surrounding mud wall, the town was defended by quickset hedges. Caillié was advised not to travel north along the Milo River as the town of Kankan was fighting for control of the Bouré gold producing area around Siguiri and the Tinkisso River. Instead Caillié left the town heading east in the direction of Minignan in the Ivory Coast. He wished to visit Djenné but wanted to avoid the town of Ségou on the Niger River as Ségou was at war with Djenné. He also feared that he might be recognised as a Christian in Ségou as Mungo Park had visited the town in 1796. "]}, {"page": "John Walker (natural historian)", "response": ["Walker's natural history lectures spanned the academic year and were divided into two sections. The first half of the year he gave his 'Hippocratean' lectures, that is, meteorology, hydrology and geology. The second half of the year was devoted to the three kingdoms of nature: minerals, plants, and animals. During the 1760s, he had accepted Linnaeus' binomial classification system and during his university tenure he readily applied it to botany. However, he did not agree with Linnaeus' classification of minerals and animals and therefore he developed his own unique system for both of these subjects. As shown by Matthew Daniel Eddy, Walker developed a sophisticated theory of the earth based on evidence gathered from geochemistry and human history. Throughout his entire career he kept his ties with the Church of Scotland and in 1790 he was elected to be Moderator, its highest position. Sometime in the late 1790s he began to lose his sight and several of his lectures were taken over by Dr Robert Jameson, a physician and former student who had also studied in mainland Europe. By the time that he died in 1803, Walker had taught well over 800 students, some of whom would go on to have a significant impact on 19th-century natural history. Some of these names include Rev. Prof. John Playfair, Sir James Edward Smith, Sir James Hall, Mungo Park, Robert Waring Darwin, Robert Brown, Thomas Beddoes, Thomas Charles Hope, and Samuel Latham Mitchell."]}, {"page": "List of physicians", "response": ["* Mungo Park - Scottish physician and explorer"]}, {"page": "William Henry Ogilvie", "response": ["In 1908 he returned again to Scotland and married Katharine Margaret 'Madge' Scott Anderson (1879 – 25 June 1965), the daughter of Tom Scott Anderson and a descendant of Dr Alexander Anderson who participated in the last and fatal expedition of explorer Mungo Park.  Will and Madge had two children, Margaret Deloraine 'Wendy' Ogilvie (1909–2003), and George Thomas Anderson Ogilvie (1912–1995), when living at 'Brundenlaws' in the village of Bowden."]}, {"page": "Colonization of the Congo basin", "response": ["* The remote upper Niger by Mungo Park in 1796."]}, {"page": "Bundu (state)", "response": ["Mungo Park, the first European traveller to visit the country, passed through Bondu in 1795, and had to submit to many exactions from the reigning monarch. The royal residence was then at Fatteconda; but when Major William Gray, a British officer who attempted to solve the Niger problem, visited Bondu in 1818 it had been moved to Bulibani (Boolibany), a village with a population of 1500–1800, surrounded by a strong clay wall. In August 1845 the king of Bondu signed a treaty recognizing French sovereignty over his country. The treaty was disregarded by the natives, but in 1858 Bondu came definitively under French control."]}, {"page": "Ségou", "response": ["The village of Ségou-Koro prospered after Biton Mamary Coulibaly became king in 1712 and founded the Ségou (or Bamana) Empire. Mungo Park became the first European known to have visited the village in 1796. The empire gradually declined and was conquered by El Hadj Umar Tall's Toucouleur Empire in 1861, then by the French Army Colonel Louis Archinard in 1890."]}, {"page": "Robert Richard Torrens", "response": ["In 1839 he married Barbara Anson, daughter of Alexander Park, widow of Augustus George Anson and a niece of explorer Mungo Park. In that same year he was awarded an MA \"by grace\"."]}, {"page": "British Rail Class 221", "response": ["| formerly Mungo Park"]}, {"page": "British diaspora in Africa", "response": ["*Mungo Park (1771–1806), explorer"]}, {"page": "Index of Guinea-Bissau-related articles", "response": ["Mungo Park -"]}, {"page": "James Holman", "response": ["James Holman FRS (15 October 1786 – 29 July 1857), known as the \"Blind Traveller,\" was a British adventurer, author and social observer, best known for his writings on his extensive travels. Completely blind and suffering from debilitating pain and limited mobility, he undertook a series of solo journeys that were unprecedented both in their extent of geography and method of \"human echolocation\". In 1866, the journalist William Jerdan wrote that \"From Marco Polo to Mungo Park, no three of the most famous travellers, grouped together, would exceed the extent and variety of countries traversed by our blind countryman.\" In 1832, Holman became the first blind person to circumnavigate the globe. He continued travelling, and by October 1846 had visited every inhabited continent."]}, {"page": "Bamana Empire", "response": ["Mungo Park, passing through the Bambara capital of Ségou two years after Diarra's 1795 death, recorded a testament to the Empire's prosperity:"]}, {"page": "Mumbo jumbo (phrase)", "response": ["Mumbo Jumbo is a West African word often cited by historians and etymologists as deriving from the Mandinka word \"Maamajomboo\", which refers to a masked male dancer who takes part in religious ceremonies. In the 18th century Mumbo Jumbo referred to a West African god. Mungo Park's travel journal Travels in the Interior of Africa (1795) describes 'Mumbo Jumbo' as a character, complete with \"masquerade habit\", whom Mandinka males would dress up as in order to resolve domestic disputes. "]}, {"page": "Hugh Clapperton", "response": ["Immediately after his return to England, Clapperton was raised to the rank of commander, and sent out with another expedition to Africa, the sultan Bello of Sokoto having professed his eagerness to open up trade with the west coast. Clapperton came out on HMS Brazen, which was joining the West Africa Squadron for the suppression of the slave trade. He landed at Badagry in the Bight of Benin, and started overland for the Niger on 7 December 1825, having with him his servant Richard Lemon Lander, Captain Pearce, and Dr. Morrison, navy surgeon and naturalist. Before the month was out Pearce and Morrison were dead of fever. Clapperton continued his journey, and, passing through the Yoruba country, in January 1826 he crossed the Niger at Bussa, the spot where Mungo Park had died twenty years before."]}, {"page": "European exploration of Africa", "response": ["* Mungo Park (explored Niger River in 1790s)"]}, {"page": "Bryan Edwards (politician)", "response": ["When Mungo Park returned in 1796 from his celebrated journey in Africa, Edwards drew up from Park's narrative an account of his travels. Edwards was secretary of the Association for Promoting the Discovery of the Interior Parts of Africa, which published this piece in their Proceedings. When Park wrote his own account of his journeys he availed himself of Edwards' assistance."]}]}}