{"wiki_id": "http://www.wikidata.org/entity/Q219731", "itemLabel": "George Canning", "itemDescription": "British Prime Minister, statesman, and politician (1770-1827)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Canning", "wikipedia_page": {"main": "George Canning  (11 April 1770 – 8 August 1827) was a British Tory statesman. He held various senior cabinet positions under numerous prime ministers, including two important terms as Foreign Secretary, finally becoming Prime Minister of the United Kingdom for the last 118 days of his life, from April to August 1827.\nThe son of an actress and a failed businessman and lawyer, Canning was supported financially by his uncle, Stratford Canning, which allowed him to attend Eton College and Christ Church, Oxford. Canning entered politics in 1793 and rose rapidly. He was Paymaster of the Forces (1800–01) and Treasurer of the Navy (1804–1806) under William Pitt the Younger. Canning was Foreign Secretary (1807–1809) under the Duke of Portland. Canning was the dominant figure in the cabinet and directed the seizure of the Danish fleet in 1807 to assure Britain's naval supremacy over Napoleon. In 1809, he was wounded in a duel with his rival Lord Castlereagh and was shortly thereafter passed over as a successor to the Duke of Portland in favour of Spencer Perceval. He rejected overtures to serve as Foreign Secretary again, owing to Castlereagh's presence in Perceval's Cabinet, and he remained out of high office until after Perceval was assassinated in 1812.\nCanning subsequently served under new Prime Minister the Earl of Liverpool as British Ambassador to Portugal (1814–1816), President of the Board of Control (1816–1821), and Foreign Secretary and Leader of the House of Commons (1822–1827). King George IV disliked Canning and there were efforts to frustrate his foreign policies. Canning, however, successfully built wide public support for his policies. Historian Paul Hayes argues that he scored major achievements in diplomatic relations regarding Spain and Portugal, by helping to guarantee the independence of the American colonies of Portugal and Spain. His policies ensured a major trading advantage to British merchants and supported the Americans' Monroe Doctrine. Historian G. M. Trevelyan says:\n\nFor five years England had been guided by the genius of Canning, and seldom have so much brilliancy in so much wisdom combined to produce such happy results. The constitutional medium through which that genius worked was the loyal friendship of the prime minister, Lord Liverpool.\nWhen Lord Liverpool resigned in April 1827, Canning was chosen to succeed him as Prime Minister ahead of the Duke of Wellington and Sir Robert Peel. They both declined to serve under Canning and the Tories split between Peel and Wellington's Ultra-Tories and the Canningites. Canning then invited several Whigs to join his cabinet. However, his health collapsed and he died in office in August 1827, after just 119 days in office, the shortest tenure of any British Prime Minister to this date.", "link_mentions": [{"page": "Alternate history", "response": ["In the English language, the first known complete alternate history is Nathaniel Hawthorne's short story \"P.'s Correspondence\", published in 1845. It recounts the tale of a man who is considered \"a madman\" due to his perceptions of a different 1845, a reality in which long-dead famous people, such as the poets Robert Burns, Lord Byron, Percy Bysshe Shelley and John Keats, the actor Edmund Kean, the British politician George Canning, and Napoleon Bonaparte, are still alive."]}, {"page": "Athens", "response": ["All over the city can be found several statues or busts. Apart from the neoclassicals by Leonidas Drosis at the Academy of Athens (Plato, Socrates, Apollo, Athena), other notable include the statue of Theseus by Georgios Fytalis at Thiseion, of philhellenes like Lord Byron, George Canning and William Gladstone, the equestrian statue of Theodoros Kolokotronis by Lazaros Sochos in front of the Old Parliament, statues of Ioannis Kapodistrias, Rigas Feraios and Adamantios Korais at the university, of Evangelos Zappas and Konstantinos Zappas at Zappeion, of Ioannis Varvakis at the National Garden, the \"woodbreaker\" by Dimitrios Filippotis, the equestrian statue of Alexandros Papagos at Papagou district and various busts of fighters of Greek independence at the Pedion tou Areos. A significant landmark is also the Tomb of the Unknown Soldier in Syntagma."]}, {"page": "August 8", "response": ["*1827 – George Canning, English lawyer and politician, Prime Minister of the United Kingdom (b. 1770)"]}, {"page": "April 11", "response": ["*1770 – George Canning, Irish-English lawyer and politician, Prime Minister of the United Kingdom (d. 1827)"]}, {"page": "Benjamin Disraeli", "response": ["There was at the time a boom in shares in South American mining companies. Spain was losing its South American colonies in the face of rebellions. At the urging of George Canning the British government recognised the new independent governments of Argentina (1824), Colombia and Mexico (both 1825).Beales, Derek. \"Canning, George (1770–1827)\", Oxford Dictionary of National Biography, Oxford University Press, online edition, January 2008, accessed 23 August 2013 With no money of his own, Disraeli borrowed money to invest. He became involved with the financier J. D. Powles, who was prominent among those encouraging the mining boom. In the course of 1825, Disraeli wrote three anonymous pamphlets for Powles, promoting the companies.Blake (1967), pp. 24–26 The pamphlets were published by John Murray, who invested heavily in the boom.Zachs, William, Peter Isaac, Angus Fraser and William Lister, \"Murray family (per. 1768–1967)\", Oxford Dictionary of National Biography, Oxford University Press, online edition, May 2009, accessed 23 August 2013; and Blake (1967), p. 25"]}, {"page": "Edmund Burke", "response": ["In the 19th century, Burke was praised by both liberals and conservatives. Burke's friend Philip Francis wrote that Burke \"was a man who truly & prophetically foresaw all the consequences which would rise from the adoption of the French principles\", but because Burke wrote with so much passion, people were doubtful of his arguments.Gregory Claeys, 'The Reflections refracted: the critical reception of Burke's Reflections on the Revolution in France during the early 1790s', in John Whale (ed.), Edmund Burke's Reflections on the Revolution in France. New interdisciplinary essays (Manchester University Press, 2000), p. 55, n. 23. William Windham spoke from the same bench in the House of Commons as Burke had when he had separated from Fox and an observer said Windham spoke \"like the ghost of Burke\" when he made a speech against peace with France in 1801.A. D. Harvey, Britain in the early nineteenth century (B T Batsford Ltd, 1978), p. 125. William Hazlitt, a political opponent of Burke, regarded him as amongst his three favourite writers (the others being Junius and Rousseau) and made it \"a test of the sense and candour of any one belonging to the opposite party, whether he allowed Burke to be a great man\".Lock, Burke's Reflections, p. 175. William Wordsworth was originally a supporter of the French Revolution and attacked Burke in A Letter to the Bishop of Llandaff (1793), but by the early 19th century he had changed his mind and came to admire Burke. In his Two Addresses to the Freeholders of Westmorland, Wordsworth called Burke \"the most sagacious Politician of his age\", whose predictions \"time has verified\".Lock, Burke's Reflections, p. 173. He later revised his poem The Prelude to include praise of Burke (\"Genius of Burke! forgive the pen seduced/By specious wonders\") and portrayed him as an old oak. Samuel Taylor Coleridge came to have a similar conversion as he had criticised Burke in The Watchman, but in his Friend (1809–1810) had defended Burke from charges of inconsistency.Lock, Burke's Reflections, pp. 173–74. Later in his Biographia Literaria (1817), Coleridge hails Burke as a prophet and praises Burke for referring \"habitually to principles. He was a scientific statesman; and therefore a seer\".Lock, Burke's Reflections, p. 174. Henry Brougham wrote of Burke that \"all his predictions, save one momentary expression, had been more than fulfilled: anarchy and bloodshed had borne sway in France; conquest and convulsion had desolated Europe. […] [T]he providence of mortals is not often able to penetrate so far as this into futurity\".Claeys, p. 50. George Canning believed that Burke's Reflections \"has been justified by the course of subsequent events; and almost every prophecy has been strictly fulfilled\". In 1823, Canning wrote that he took Burke's \"last works and words [as] the manual of my politics\".E. J. Stapleton (ed.), Some Official Correspondence of George Canning. Volume I (London: Longmans, Green & Co., 1887), p. 74. The Conservative Prime Minister Benjamin Disraeli \"was deeply penetrated with the spirit and sentiment of Burke's later writings\".William Flavelle Monypenny and George Earle Buckle, The Life of Benjamin Disraeli. Earl of Beaconsfield. Volume I. 1804–1859 (London: John Murray, 1929), p. 310."]}, {"page": "John Quincy Adams", "response": ["As the Spanish Empire continued to fracture during Monroe's second term, Adams, Monroe and Clay became increasingly concerned that the \"Holy Alliance\" of Prussia, Austria, and Russia would seek to bring Spain's erstwhile colonies under their control, to the point of even contemplating a Holy Alliance of their own to defend democracy. Adams addressed this issue in the Washington 1821 Fourth of July address, noting a shared \"chain of sympathy\" between the U.S. and Latin America, but arguing for neutrality rather than a Holy Alliance.Traub, 256-258 In 1822, following the conclusion of the Adams–Onís Treaty, the Monroe administration recognized the independence of several Latin American countries, including Argentina and Mexico. In 1823, British Foreign Secretary George Canning suggested that the United States and Britain should work together to preserve the independence of these fledgling republics. The cabinet debated whether to accept the offer, but Adams opposed it. Instead, Adams urged Monroe to publicly declare United States opposition to any European attempt to colonize or re-take control of territory in the Americas, while also committing the United States to neutrality in European affairs. In his December 1823 annual message to Congress, Monroe laid out the Monroe Doctrine, which was largely built upon Adams's ideas. In issuing the Monroe Doctrine, the United States displayed a new level of assertiveness in international relations, as the doctrine represented the country's first claim to a sphere of influence. It also marked the country's shift in psychological orientation away from Europe and towards the Americas. Debates over foreign policy would no longer center on relations with Britain and France, but would instead focus on western expansion and relations with Native Americans. The doctrine became one of the foundational principles of U.S. foreign policy."]}, {"page": "James Monroe", "response": ["For their part, the British also had a strong interest in ensuring the demise of Spanish colonialism, with all the trade restrictions mercantilism imposed. In October 1823, Richard Rush, the American minister in London, advised that Foreign Secretary George Canning was proposing that the U.S. and Britain issue a joint declaration to deter any other power from intervening in Central and South America. Adams vigorously opposed cooperation with Great Britain, contending that a statement of bilateral nature could limit United States expansion in the future. He also argued that the British were not committed to recognizing the Latin American republics and must have had imperial motivations themselves."]}, {"page": "Jacobin (politics)", "response": ["Overall, after 1793 \"Jacobin\" became a pejorative for radical left-wing revolutionary politics and was linked to sedition.  The word was further promoted in England by George Canning's 1797-8 newspaper Anti-Jacobin and later, John Gifford's 1798-1821 Anti-Jacobin Review, which both criticized the English Radicals of the 18th and 19th centuries.  Much detail on English Jacobinism can be found in E. P. Thompson's The Making of the English Working Class. "]}, {"page": "Foreign relations of Mexico", "response": ["Due to rivalry with France and Spain, then-Prime Minister George Canning was interested in recognizing the independence of the newborn nations in the Americas. On June 27, 1824, Canning received Mexican plenipotentiary minister José Mariano Michelena and recognized Mexico as an independent country de facto, and formally on December 30, despite opposition from the British cabinet.Velázquez Flores (2007), p. 85. United Kingdom was the first country to officially recognize the independence of Mexico."]}, {"page": "September 21", "response": ["*1809 – British Secretary of War Lord Castlereagh and Foreign Secretary George Canning meet in a duel on Putney Heath, with Castlereagh wounding Canning in the thigh.Hunt, Giles. The Duel: Castlereagh, Canning and Deadly Cabinet Rivalry. Bloomsbury Academic, 2008. p.137"]}, {"page": "History of the United Kingdom", "response": ["Prime Ministers of the period included: William Pitt the Younger, Lord Grenville, Duke of Portland, Spencer Perceval, Lord Liverpool, George Canning, Lord Goderich, Duke of Wellington, Lord Grey, Lord Melbourne, and Sir Robert Peel."]}, {"page": "William Ewart Gladstone", "response": ["Although born and raised in Liverpool, William Gladstone was of purely Scottish ancestry.Shannon, 1985 His grandfather Thomas Gladstones (1732–1809) was a prominent merchant from Leith, and his maternal grandfather, Andrew Robertson, was Provost of Dingwall and a Sheriff-Substitute of Ross-shire. His biographer John Morley described him as \"a highlander in the custody of a lowlander\", and an adversary as \"an ardent Italian in the custody of a Scotsman\". One of his earliest childhood memories was being made to stand on a table and say \"Ladies and gentlemen\" to the assembled audience, probably at a gathering to promote the election of George Canning as MP for Liverpool in 1812. In 1814, young \"Willy\" visited Scotland for the first time, as he and his brother John travelled with their father to Edinburgh, Biggar and Dingwall to visit their relatives. Willy and his brother were both made freemen of the burgh of Dingwall.Sydney Checkland, The Gladstones: A Family Biography, 1764–1851 (Cambridge University Press, 1971), p. 95. In 1815, Gladstone also travelled to London and Cambridge for the first time with his parents. Whilst in London, he attended a service of thanksgiving with his family at St Paul's Cathedral following the Battle of Waterloo, where he saw the Prince Regent.Checkland, p. 94."]}, {"page": "1809", "response": ["* September 21 – British Secretary of War Lord Castlereagh and Foreign Secretary George Canning meet in a duel on Putney Heath, with Castlereagh wounding Canning in the thigh."]}, {"page": "1820s", "response": ["In the 1820s, the British government was formally headed by King George IV, but in practice, was led by his Prime Ministers Lord Liverpool (1812–1827), George Canning (1827), Lord Goderich (1827–1828), and Duke of Wellington (1828–1830).  This decade was largely peaceful for Britain, with some foreign intervention.  The British supported the Portuguese liberals in the Liberal Wars, and supported Greek rebels in the war for independence.  During this time, London became the largest city of the world, taking the lead from Beijing."]}, {"page": "1827", "response": ["* April 10 – UK: George Canning succeeds Lord Liverpool as British Prime Minister.", "* August 31 – UK: Frederick John Robinson, 1st Viscount Goderich, becomes Prime Minister of the UK, following the death of George Canning.", "* August 8 – George Canning, Prime Minister of the United Kingdom (b. 1770)"]}, {"page": "1822", "response": ["* April 30 – President of the Board of Control George Canning moves, in the House of Commons, to repeal a law that prohibited Roman Catholic peers from sitting or voting in the House of Lords; the motion passes, 235–223, on its second reading, but the House of Lords declines to pass it.Rev. James Taylor, The Age We Live in: A History of the Nineteenth Century, from the Peace of 1815 to the Present Time (William Mackenzie Co., 1882) p286", "** George Canning is appointed British Secretary of State for Foreign Affairs."]}, {"page": "1770", "response": ["* April 11 – George Canning, Prime Minister of the United Kingdom (d. 1827)"]}, {"page": "George IV", "response": ["George spent most of his later reign in seclusion at Windsor Castle, but he continued to intervene in politics. At first it was believed that he would support Catholic emancipation, as he had proposed a Catholic Emancipation Bill for Ireland in 1797, but his anti-Catholic views became clear in 1813 when he privately canvassed against the ultimately defeated Catholic Relief Bill of 1813. By 1824 he was denouncing Catholic emancipation in public.Parissien, p. 189 Having taken the coronation oath on his accession, George now argued that he had sworn to uphold the Protestant faith, and could not support any pro-Catholic measures. The influence of the Crown was so great, and the will of the Tories under Prime Minister Liverpool so strong, that Catholic emancipation seemed hopeless. In 1827, however, Liverpool retired, to be replaced by the pro-emancipation Tory George Canning. When Canning entered office, the King, hitherto content with privately instructing his ministers on the Catholic Question, thought it fit to make a public declaration to the effect that his sentiments on the question were those of his revered father, George III."]}, {"page": "William IV", "response": ["William's elder brother, the Prince of Wales, had been Prince Regent since 1811 because of the mental illness of their father. In 1820, George III died and the Prince Regent became George IV. William, Duke of Clarence, was now second in the line of succession, preceded only by his brother, Frederick, Duke of York. Reformed since his marriage, William walked for hours, ate relatively frugally, and the only drink he imbibed in quantity was barley water flavoured with lemon.Ziegler, p. 130. Both of his older brothers were unhealthy, and it was considered only a matter of time before he became king.Molloy, p. 9. When Frederick died in 1827, William, then more than 60 years old, became heir presumptive. Later that year, the incoming Prime Minister, George Canning, appointed him to the office of Lord High Admiral, which had been in commission (that is, exercised by a board rather than by a single individual) since 1709. While in office, William had repeated conflicts with his Council, which was composed of Admiralty officers. Things finally came to a head in 1828 when, as Lord High Admiral, he put to sea with a squadron of ships, leaving no word of where they were going, and remaining away for ten days. The King requested his resignation through the Prime Minister, the Duke of Wellington; he complied."]}, {"page": "William Lamb, 2nd Viscount Melbourne", "response": ["Lamb's hallmark was finding the middle ground. Though a Whig, he accepted (29 April 1827) the post of Chief Secretary for Ireland in the moderate Tory governments of George Canning and Lord Goderich. Upon the death of his father in 1828 and his becoming the 2nd Viscount Melbourne, of Kilmore in the County of Cavan, he moved to the House of Lords.  He had spent 25 years in the Commons, largely as a backbencher, and was not politically well known.Henry Dunckley, Lord Melbourne p 135"]}, {"page": "Robert Peel", "response": ["In 1827 the Prime Minister Lord Liverpool became incapacitated and was replaced by George Canning. Peel resigned as home secretary.Adelman, Peel and the Conservative Party: 1830–1850, 4, 96–97; Clark, Peel and the Conservatives: A Study in Party Politics 1832–1841, 26–28. Canning favoured Catholic emancipation, while Peel had been one of its most outspoken opponents (earning the nickname \"Orange Peel\", with Orange the colour of the anti-Catholic Orange Order).Ramsay, Sir Robert Peel, 21–48, 91–100. George Canning himself died less than four months later and, after the brief premiership of Lord Goderich, Peel returned to the post of Home Secretary under the premiership of his long-time ally the Duke of Wellington.Clark, Peel and the Conservatives: A Study in Party Politics 1832–1841, 28–30; Ramsay, Sir Robert Peel, 103–04; Read, Peel and the Victorians, 18. During this time he was widely perceived as the number-two in the Tory Party, after Wellington himself.Ramsay, Sir Robert Peel, 104."]}]}}