{"wiki_id": "http://www.wikidata.org/entity/Q219237", "itemLabel": "Rick Astley", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Rick_Astley", "wikipedia_page": {"main": "Richard Paul Astley (born 6 February 1966) is an English singer, songwriter and radio personality, who has been active in music for several decades. He gained worldwide fame in the 1980s, having multiple hits including his signature song \"Never Gonna Give You Up\", \"Together Forever\" and \"Whenever You Need Somebody\", and returned to music full-time in the 2000s after a 6 year hiatus. Outside his music career, Astley has occasionally worked as a radio DJ and a podcaster.Born and raised in Lancashire, Astley became a musician after leaving school, as the drummer for the soul band FBI. Three years later, he rose to fame through his association with the production trio Stock Aitken Waterman; releasing the 1987 album Whenever You Need Somebody, which sold 15.2 million copies worldwide. His debut single \"Never Gonna Give You Up\" was a number 1 hit single in 25 countries, winning the 1988 Brit Award for Best British Single. His 1988 single \"Together Forever\" became his second single to top the US Billboard Hot 100, and was one of his eight songs to reach the top ten on the UK Singles Chart. The title track was a No 1 single in seven countries, and it reached No 3 in the UK. In 1988, Astley followed-up his debut album with Hold Me In Your Arms. The lead single \"She Wants to Dance with Me\" was Astley's first single that he wrote himself, and it became a worldwide top 10 hit.\nIn 1991, Astley left Stock Aitken Waterman and moved his musical direction away from dance-pop and towards soul, which he explored on his albums Free (1991) and Body and Soul (1993). His 1991 single \"Cry for Help\" was Astley's last single to reach the top 10 in either the US or UK. From 1994 to 2000, Astley retired from music to focus on spending time with his wife and raising their daughter. He returned to the music industry in 2000, and released the single \"Sleeping\" and the album Keep It Turned On in 2001. Four years later, Astley released his covers album Portrait.\nAstley became an Internet phenomenon in 2007 when the music video for his song \"Never Gonna Give You Up\" became integral to the Rickrolling meme, and his performance career was revitalised by the meme's popularity. In 2010, Astley released the single \"Lights Out\" after touring with Peter Kay. Six years later, he released his album 50 to celebrate his 50th birthday, which debuted in the UK at No. 1. He released his most recent studio album Beautiful Life in 2018, and released his greatest hits album The Best of Me in 2019. His most recent albums were recorded at his home studio in Surrey.By the time of his brief retirement, Astley had sold approximately 40 million records worldwide. A year after the Rickrolling meme began, Astley was voted \"Best Act Ever\" by Internet users at the MTV Europe Music Awards 2008. His song \"Never Gonna Give You Up\" reached 1 billion views in July 2021, becoming the fourth 1980s song to reach this milestone (behind \"Billie Jean\" by Michael Jackson, \"Take On Me\" by A-ha and \"Sweet Child o' Mine\" by Guns N' Roses).", "link_mentions": [{"page": "Cheshire", "response": ["Cheshire has produced notable musicians such as Rick Astley, Joy Division members Ian Curtis and Stephen Morris, One Direction member Harry Styles, the members of The 1975, Take That member Gary Barlow, The Cult member Ian Astbury,Larkin, Colin (2011) The Encyclopedia of Popular Music, Bish Bash Books, , p. 461 Catfish and the Bottlemen member Van McCann, Girls Aloud member Nicola Roberts, Stephen Hough, John Mayall,John Mayall biographical details.  www.johnmayall.com website. Accessed on 21 February 2008. The Charlatans member Tim Burgess, and Nigel Stonier."]}, {"page": "February 6", "response": ["*1966 – Rick Astley, English singer-songwriter"]}, {"page": "1980s", "response": ["*Rick Astley"]}, {"page": "1966", "response": ["* February 6 – Rick Astley, British pop musician"]}, {"page": "Bananarama", "response": ["In October 2007, Bananarama announced that they would be appearing on 2008's Here and Now Tour with other 1980s artists such as Belinda Carlisle, Paul Young, ABC and Rick Astley. They also announced plans to record a new album of disco cover versions and new songs.", "In June 2009, Bananarama performed at the Isle of Wight Festival. In August 2009, they performed at the 80s Rewind Festival in Henley-on-Thames alongside other 80s acts which included Rick Astley, Belinda Carlisle and Kim Wilde. The duo also performed at The Manchester Gay Pride Festival over the August Bank Holiday weekend."]}, {"page": "Camel (band)", "response": ["* Rick Astley, in an interview with Billboard in 2016, referred to Camel touring The Snow Goose as his first ever concert, stating \"it blew my mind\"."]}, {"page": "Martika", "response": ["In October 2011, Martika stopped using the stage name Vida Edit and launched a new personal website. A year later, she announced an Australian tour, but it was cancelled. She performed in 2014 alongside Debbie Gibson, Samantha Fox, and Rick Astley at a HitParade Festival in Chile."]}, {"page": "Donna Summer", "response": ["For Summer's next album, Geffen Records hired the British hit production team of Stock Aitken Waterman (or SAW), who enjoyed incredible success writing and producing for such acts as Kylie Minogue, Bananarama, and Rick Astley, among others. The SAW team describe the working experience as a labour of love, and said it was their favourite album of all that they had recorded. Geffen decided not to release the album Another Place and Time, and Summer and Geffen Records parted ways in 1988. The album was released in Europe in March 1989 on Warner Bros. Records, which had been Summer's label in Europe since 1982. The single \"This Time I Know It's for Real\" became a top ten hit in several countries in Europe, prompting Warner Bros.' sister company, Atlantic Records, to sign Summer in the US. The single peaked at  7 on the US Hot 100 and became her 12th Gold single in America. She scored two more UK hits from the album, \"I Don't Wanna Get Hurt\" (UK  7) and \"Love's About to Change My Heart\" (UK  20).ITV1/network/The Hit factory: The Stock, Aitken and Waterman Story/Documentary/true story/air date 2012-08-06/"]}, {"page": "Miss World", "response": ["| Rick Astley and The Ken Warwick Dancers"]}, {"page": "Debbie Gibson", "response": ["She later appeared on the April 2008 cover of Lavender Magazine (an LGBT magazine in Minnesota) and was interviewed about her career and upcoming projects. Then on the 24th, Gibson hosted and performed on Spotlightlive '80s Karaoke Experience in New York singing songs such as \"Only in My Dreams\", \"Out of the Blue\", \"Love Shack\" (an original hit for the B-52's) and \"9 to 5\". She performed with Samantha Fox, Tiffany, & Rick Astley at the Colisée Pepsi in Quebec City, Canada, on April 10, 2009."]}, {"page": "1966 in music", "response": ["* February 6 – Rick Astley, English singer-songwriter and radio personality"]}, {"page": "1987 in music", "response": ["  | Rick Astley", "| 2  || Rick Astley || Never Gonna Give You Up || 1987 ||  || UK 1 – Aug 1987, US BB 1 – Jan 1988, Netherlands 1 – Sept 1987, France 1 – Aug 1987, Norway 1 – Oct 1987, Germany 1 – Sept 1987, New Zealand 1 for 1 weeks Feb 1988, Australia 1 for 7 weeks Jun 1988, South Africa 1 of 1988, US CashBox 2 of 1988, Switzerland 2 – Sept 1987, Sweden 3 – Sept 1987, Austria 4 – Nov 1987, Australia 5 of 1988, Italy 13 of 1987, US BB 34 of 1988, POP 61 of 1988, Germany 140 of the 1980s, OzNet 765"]}, {"page": "1988 in music", "response": ["| Hold Me in Your Arms || Rick Astley || UK", "| 5 || Rick Astley || Take Me To Your Heart || 1988 ||  || UK 1 – Oct 1988, Netherlands 1 – Nov 1988, Switzerland 1 – Nov 1988, Republic of Ireland 1 – Oct 1988, Scrobulate 1 of new age, Poland 2 – Dec 1988, Germany 1 – Jan 1989, Sweden 1 – Nov 1988, Norway 1 – Nov 1988, Austria 1 – Dec 1988, France 1 – Oct 1988, RYM 18 of 1988, US BB 24 – Mar 1989, POP 34 of 1989, Germany 242 of the 1980s", "| 4 || Never Gonna Give You Up || Rick Astley || 1 || 2"]}, {"page": "1991 in music", "response": ["| Free || Rick Astley ||-"]}, {"page": "1993 in music", "response": ["*Rick Astley retires from the music industry at the age of 27 after selling 40 million records in a five-year period.", "| Body & Soul || Rick Astley ||-"]}, {"page": "Nat King Cole", "response": ["Cole's last album, L-O-V-E, was recorded in early December 1964—just a few days before he entered the hospital for cancer treatment—and was released just before he died. It peaked at number 4 on the Billboard Albums chart in the spring of 1965. A Best Of album was certified a gold record in 1968. His 1957 recording of \"When I Fall in Love\" reached number 4 in the UK charts in 1987, released in reaction to a version by Rick Astley challenging for the coveted Christmas number 1 spot."]}]}}