{"wiki_id": "http://www.wikidata.org/entity/Q219782", "itemLabel": "Dusty Springfield", "itemDescription": "English singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Dusty_Springfield", "wikipedia_page": {"main": "Mary Isobel Catherine Bernadette O'Brien  (16 April 1939 – 2 March 1999), known professionally as Dusty Springfield, was an English singer whose career spanned over five decades. With her distinctive mezzo-soprano sound, she was a significant singer of blue-eyed soul, pop and dramatic ballads, with French chanson, country, and jazz also in her repertoire. During her 1960s peak, she ranked among the most successful British female performers on both sides of the Atlantic. Her image – marked by a peroxide blonde bouffant/beehive hairstyle, heavy makeup (thick black eyeliner and eye shadow) and  evening gowns, as well as stylised, gestural performances – made her an icon of the Swinging Sixties.Born in West Hampstead in London into a family that enjoyed music, Springfield learned to sing at home. In 1958, she joined her first professional group, The Lana Sisters. Two years later, with her brother Tom Springfield and Tim Feild, Springfield formed the folk-pop vocal trio The Springfields. Two of their five 1961–63 Top 40 UK hits – \"Island of Dreams\" and \"Say I Won't Be There\" – reached no. 5 in the charts, both in the spring of 1963. In 1962 they also hit big in the States with their cover of \"Silver Threads and Golden Needles\".\nSpringfield's solo career began in late 1963 with the upbeat pop record \"I Only Want to Be with You\" — a  UK no. 4 hit, and the first of her six transatlantic Top 40 hits in the 1960s, along with “Stay Awhile” (1964), \"All I See Is You\" (1966), \"I'll Try Anything\" (1967) and the two releases now considered her signature songs: \"You Don't Have to Say You Love Me\" (1966 UK no. 1/US no. 4) and \"Son of a Preacher Man\" (1968/69 UK no. 9/US no. 10). The latter features on the 1968 pop and soul album Dusty in Memphis, one of Springfield's defining works. In March 2020, the US Library of Congress added it to the National Recording Registry, which preserves audio recordings considered to be \"culturally, historically or aesthetically significant\". Between 1964 and 1969 Springfield hit big in her native Britain with several singles which in America either failed to chart or were not released, among them \"I Just Don't Know What to Do with Myself\", \"In the Middle of Nowhere\", \"Some of Your Lovin'\", \"Goin' Back\" and \"I Close My Eyes and Count to Ten\". Conversely, she charted in the US (but not in the UK) with hits including \"Wishin' and Hopin' \", \"The Look of Love\" and \"The Windmills of Your Mind\".\nBetween 1971 and 1986, Springfield failed to register a hit from five album releases (aside from a minor 1979 UK chart appearance), but her 1987 collaboration with UK synthpop duo the Pet Shop Boys, \"What Have I Done to Deserve This?\", took her back to the top of the charts, reaching no. 2 on both the UK singles chart and Billboard's Hot 100. The collaboration also yielded two 1989 UK Top 20 hits: \"Nothing Has Been Proved\" and \"In Private\". In 1990, Springfield charted with “Reputation” – the last of 25 Top 40 UK hits in which she features.\nA fixture on British television, Springfield presented many episodes of the hip 1963–66 British TV music series Ready Steady Go! and, between 1966 and 69, hosted her own series on the BBC and ITV. In 1966, Springfield topped the popularity polls, including Melody Maker's Best International Vocalist, and was the first UK singer to top the New Musical Express readers' poll for Female Singer. She is a member of both the Rock & Roll Hall of Fame and the UK Music Hall of Fame. International polls have lauded Springfield as one of the finest female popular singers of all time.", "link_mentions": [{"page": "April 16", "response": ["*  1939   – Dusty Springfield, English singer and record producer (d. 1999)"]}, {"page": "Elvis Costello", "response": ["Costello, in print, often champions the works of others. He has written several pieces for the magazine Vanity Fair, including a summary of what a perfect weekend of music would be. He has contributed to two Grateful Dead tribute albums and covered Jerry Garcia/Robert Hunter tunes \"Ship of Fools\", \"Friend of the Devil\", \"It Must Have Been the Roses\", \"Ripple\" and \"Tennessee Jed\" in concert. His collaboration with Bacharach honoured Bacharach's place in pop music history. Costello appeared in documentaries about singers Dusty Springfield, Brian Wilson, Wanda Jackson, Ron Sexsmith and Memphis, Tennessee-based Stax Records. He has interviewed one of his own influences, Joni Mitchell, and appeared on the release A Tribute to Joni Mitchell performing \"Edith and the Kingpin\". He performed the title track of the Charles Mingus tribute collection, Weird Nightmare. He appeared on the Nick Lowe tribute album Labour of Love, performing the Lowe song \"Egypt\" and the Gram Parsons tribute album The Return of the Grievous Angel, performing the Parsons song \"Sleepless Nights\". He was instrumental in bringing Sexsmith to a wider audience in 1995 by championing his debut album in Mojo magazine, even appearing on the cover with Sexsmith's debut album."]}, {"page": "Irish diaspora", "response": ["*Dusty Springfield, English-born singer."]}, {"page": "James Bond", "response": ["A Bond film staple are the theme songs heard during their title sequences sung by well-known popular singers. Several of the songs produced for the films have been nominated for Academy Awards for Original Song, including Paul McCartney's \"Live and Let Die\", Carly Simon's \"Nobody Does It Better\", Sheena Easton's \"For Your Eyes Only\", Adele's \"Skyfall\", and Sam Smith's \"Writing's on the Wall\". Adele won the award at the 85th Academy Awards, and Smith won at the 88th Academy Awards. For the non-Eon produced Casino Royale, Burt Bacharach's score included \"The Look of Love\" (sung by Dusty Springfield), which was nominated for an Academy Award for Best Original Song."]}, {"page": "London", "response": ["London has numerous venues for rock and pop concerts, including the world's busiest indoor venue, The O2 Arena and Wembley Arena, as well as many mid-sized venues, such as Brixton Academy, the Hammersmith Apollo and the Shepherd's Bush Empire. Several music festivals, including the Wireless Festival, South West Four, Lovebox, and Hyde Park's British Summer Time are all held in London. The city is home to the original Hard Rock Cafe and the Abbey Road Studios, where The Beatles recorded many of their hits. In the 1960s, 1970s and 1980s, musicians and groups like Elton John, Pink Floyd, Cliff Richard, David Bowie, Queen, The Kinks, The Rolling Stones, The Who, Eric Clapton, Led Zeppelin, The Small Faces, Iron Maiden, Fleetwood Mac, Elvis Costello, Cat Stevens, The Police, The Cure, Madness, The Jam, Ultravox, Spandau Ballet, Culture Club, Dusty Springfield, Phil Collins, Rod Stewart, Adam Ant, Status Quo and Sade, derived their sound from the streets and rhythms of London."]}, {"page": "Led Zeppelin", "response": ["Grant secured a $143,000 advance contract ($ today) from Atlantic Records in November 1968—at the time, the biggest deal of its kind for a new band. Atlantic was a label with a catalogue of mainly blues, soul, and jazz artists, but in the late 1960s it began to take an interest in British progressive rock acts. At the recommendation of British singer Dusty Springfield, a friend of Jones who at the time was completing her first Atlantic album, Dusty in Memphis, record executives signed Led Zeppelin without having ever seen them. Under the terms of their contract, the band had autonomy in deciding when they would release albums and tour and had the final say over the contents and design of each album. They would also decide how to promote each release and which tracks to release as singles. They formed their own company, Superhype, to handle all publishing rights."]}, {"page": "March 2", "response": ["*1999 – Dusty Springfield, English singer (b. 1939)"]}, {"page": "Peggy Lee", "response": ["Lee has been noted as a musical influence on other artists such as Paul McCartney, Madonna, Beyoncé, k.d. lang, Elvis Costello, Diana Krall, Dusty Springfield, Rita Coolidge, Rita Moreno, and Billie Eilish."]}, {"page": "Sherrié Austin", "response": ["Later, she switched to the independent Broken Bow Records label. Her fourth album of country music, titled Streets of Heaven, produced her biggest country hit in its title track. Following this single was \"Son of a Preacher Man\", a cover of the Dusty Springfield song, which was never included on an album."]}, {"page": "Bay City Rollers", "response": ["Alan Longmuir had left the group by early 1976, due to both the pressures of the band's success and feeling discomfort at being a member of a teen band whilst in his late twenties. He was replaced for seven months by 17-year-old Ian Mitchell from Northern Ireland; he was the first band member born outside Edinburgh. With Mitchell, the group released an album titled Dedication (1976), and hit the charts with a cover version of the Dusty Springfield song, \"I Only Want to Be with You. \" The song reached US No. 12, as well as \"Yesterday's Hero\" (featuring live material from a 1976 personal appearance in Toronto's Nathan Phillips Square), and \"Dedication\"."]}, {"page": "The Six Million Dollar Man", "response": ["Dusty Springfield, backed by Ron \"Escalade\" Piscina, sang the theme song written by Glen A. Larson, which was used in the opening and closing credits for the Wine, Women & War and The Solid Gold Kidnapping telefilms. The song was also used in the promotion of the series, but when the weekly series began the song was replaced by the instrumental theme by Oliver Nelson. The first regular episode, \"Population: Zero\", introduced a new element to the opening sequence: a voiceover by Oscar Goldman stating the rationale behind creating a bionic man. The first season narration was shorter than that used in the second and subsequent seasons."]}, {"page": "The Seekers", "response": ["After filling in on a bill headlined by singer Dusty Springfield, they met her brother, songwriter and producer Tom Springfield, who had experience with writing folk-pop material and lyrics/tunes with the siblings' earlier group The Springfields. He penned \"I'll Never Find Another You\", which they recorded in November 1964. It was released by EMI Records, on their Columbia Graphophone Company (Columbia)", "The band were named \"Best New Group of 1964\" at the April 1965 New Musical Express Poll Winners Awards. They appeared at the annual celebratory Wembley Empire Pool concert, on a bill which included the Beatles, the Rolling Stones, Dusty Springfield and the Animals.  In May, another Tom Springfield composition was issued, \"A World of Our Own\", which reached Top 3 in Australia and the U.K. and Top 20 in the U.S. Malvina Reynolds' lullaby \"Morningtown Ride\" was issued in Australia in July and peaked in the Top 10. That same month, Durham had to temporarily leave the group due to emergency nasal surgery; she was replaced on live dates from July to early September by Scottish-born singer Ellen Wade.", "* 1965  – The Seekers won the Best New Group in the New Musical Express Poll Winners Awards and performed on 11 April at the Wembley Empire Pool, in a bill that included The Beatles, The Rolling Stones, Cliff Richard and Dusty Springfield. Archive footage from this show was included in The Seekers' 2014 50th anniversary tour."]}, {"page": "The Replacements (band)", "response": ["The Replacements gained local notoriety following their first live performance, because of Tommy Stinson's young age. Early shows were consistently tight and became more aggressive following the release of the Stink EP in 1982. As their stylistic repertoire began to expand with the writing and recording of Hootenanny the following year, the band's increasingly antagonistic stage show left them with a reputation for their rowdy, often drunken live shows. The band frequently went on stage too intoxicated to play. They were famously banned permanently from Saturday Night Live after performing drunk before a national television audience on January 18, 1986. As one reviewer succinctly observed, the band could quite often be \"mouthing profanities into the camera, stumbling into each other, falling down, dropping their instruments, and generally behaving like the apathetic drunks they were.\" There emerged an element of unpredictability, as The Replacements—when sober—gained critical praise for their live shows. Part of the mystique of The Replacements was the fact that the audience never knew until the start of a concert if the band would be sober enough to play. It was not uncommon for the group to play entire sets of cover versions, ranging anywhere from Bryan Adams's \"Summer of '69\" to Dusty Springfield's \"The Look of Love\" to Led Zeppelin's \"Black Dog.\""]}, {"page": "1960s", "response": ["In the early 1960s, Britain became a hotbed of rock 'n' roll activity during this time. In late 1963, the Beatles embarked on their first US tour and cult singer Dusty Springfield released her first solo single. A few months later, rock 'n' roll founding father Chuck Berry emerged from a -year prison stint and resumed recording and touring. The stage was set for the spectacular revival of rock music."]}, {"page": "1999", "response": ["* March 2 – Dusty Springfield, English pop singer (b. 1939)"]}, {"page": "1970s", "response": ["* Dusty Springfield"]}, {"page": "1939", "response": ["* April 16 – Dusty Springfield, English pop singer (d. 1999)"]}, {"page": "Bonnie Tyler", "response": ["Tyler's two biggest influences from a young age were Janis Joplin and Tina Turner. She cites \"River Deep – Mountain High\" as being her all-time favourite song. Other artists that influenced Tyler in her youth include Aretha Franklin, Wilson Pickett, Meat Loaf, Joe Cocker, Dusty Springfield and Tommy Steele. She has also expressed admiration for contemporary artists such as Guns N' Roses,EMS Music / Locomotive Music, Rock For Asia – Das Charity-Konzert Open Air 2005 DVD (2006). Anastacia, Toni Braxton, Duffy, and Eminem. She has also expressed interest in collaborating with Adele, whom she describes as \"a great song writer, singer and performer.\""]}, {"page": "Shirley Bassey", "response": ["Bassey appeared on the Morecambe and Wise Christmas Show, broadcast on Christmas Day in 1971. Bassey starred in the six-episode The Shirley Bassey Show (1976), the first of her television programmes for the BBC, followed by a second series of six episodes in 1979. The final show of the first series was nominated for the Golden Rose of Montreux in 1977. The series featured guests including Neil Diamond, Michel Legrand, The Three Degrees and Dusty Springfield and featured Bassey in various international locations as well as in the television studio. In 1978, Bassey pleaded guilty to being drunk and disorderly \"after shouting abuse in the street and pushing a policeman\". In 1979, Bassey recorded the title theme song for the Bond film, Moonraker."]}, {"page": "Pet Shop Boys", "response": ["Three-time Brit Award winners and six-time Grammy nominees, since 1984 they have achieved 42 Top 30 singles, 22 of these being Top 10 hits in the UK Singles Chart, including four UK number ones: \"West End Girls\" (also number one on the US Billboard Hot 100), \"It's a Sin\", a synth-pop version of \"Always on My Mind\", and \"Heart\". Other hit songs include a cover of \"Go West\", and their own \"Opportunities (Let's Make Lots of Money)\", and \"What Have I Done to Deserve This?\" in a duet with Dusty Springfield. With five US top ten singles in the 1980s, they are associated with the Second British Invasion.", "The continued success of \"It's a Sin\" was followed by the release of \"What Have I Done to Deserve This?\" on 10 August. Co-written with Allee Willis and also featuring Dusty Springfield on vocals, the single reached number two on the UK Singles Chart and the U.S. Billboard Hot 100 chart. Although the duo had wanted to release this track on their debut album, they had been unable to track down Springfield and were reluctant to record it with any other female singer, despite their record company's suggestions. Springfield's manager finally contacted them in 1986, following the release of Please, and towards the end of that year, she travelled to London to record \"What Have I Done to Deserve This?\" with them. It was the first track to be recorded for the duo's second album. Pet Shop Boys had been told that Springfield was difficult to work with and even that she could no longer sing; however, her performance on the track put any such concerns to rest and they began a collaboration with her, which lasted until the end of the decade. Included on their second album Actually, the song became a massive worldwide hit and resurrected Springfield's career, leading to her 1990 album, Reputation, on which Pet Shop Boys were major contributing writers and producers. This duet was also the start of a series of collaborations with high-profile musicians, going on throughout the band's career.", "During this period, Pet Shop Boys continued to collaborate with many high-profile musicians. They worked again with Dusty Springfield, on the singles \"Nothing Has Been Proved\" (which was a song written for their soundtrack for the film Scandal about the Profumo political scandal in Britain) and \"In Private\". The duo later went on to produce half of the tracks on her 1990 solo Reputation album. Pet Shop Boys were also asked to write and produce an album for Liza Minnelli, in 1989. The album, Results, generated four singles, including the hit single \"Losing My Mind\", a cover version of the Stephen Sondheim song from the 1971 Broadway musical \"Follies\". The duo's own demo of this appeared on their \"Jealousy\" single as a B-side."]}, {"page": "The Smiths", "response": ["Morrissey's role was to create vocal melodies and lyrics.Jennifer Nine, \"The Importance of Being Morrissey\", Melody Maker, 9 August 1997. The full text of the interview is reproduced here.  Retrieved 8 January 2012. Morrissey's songwriting was influenced by punk rock and post-punk bands such as New York Dolls, the Cramps, the Specials and the Cult, along with 1960s girl groups and singers such as Dusty Springfield, Sandie Shaw, Marianne Faithfull and Timi Yuro. Morrissey's lyrics, while superficially depressing, were often full of mordant humour; John Peel remarked that the Smiths were one of the few bands capable of making him laugh out loud. Influenced by his childhood interest in the social realism of 1960s \"kitchen sink\" television plays, Morrissey wrote about ordinary people and their experiences with despair, rejection and death. While \"songs such as 'Still Ill' sealed his role as spokesman for disaffected youth\", Morrissey's \"manic-depressive rants\" and his \"'woe-is-me' posture inspired some hostile critics to dismiss the Smiths as 'miserabilists.'\""]}, {"page": "Pulp Fiction", "response": ["Estella Tincknell describes how the particular combination of well-known and obscure recordings helps establish the film as a \"self-consciously 'cool' text. [The] use of the mono-tracked, beat-heavy style of early 1960s U.S. 'underground' pop mixed with 'classic' ballads such as Dusty Springfield's 'Son of a Preacher Man' is crucial to the film's postmodern knowingness.\" She contrasts the soundtrack with that of Forrest Gump, the highest-grossing film of 1994, which also relies on period pop recordings: \"[T]he version of 'the sixties' offered by Pulp Fiction ... is certainly not that of the publicly recognized counter-culture featured in Forrest Gump, but is, rather, a more genuinely marginal form of sub-culture based around a lifestyle – surfing, 'hanging' – that is resolutely apolitical.\" The soundtrack is central, she says, to the film's engagement with the \"younger, cinematically knowledgeable spectator\" it solicits.Tincknell (2006), p. 139."]}, {"page": "John Paul Jones (musician)", "response": ["In 1964, on the recommendation of Meehan, Baldwin began studio session work with Decca Records. From then until 1968, he played on hundreds of recording sessions.Tolinski, Brad. (January 1998). \"Like a Rock\", Guitar World, p. 60. He soon expanded his studio work by playing keyboards, arranging and undertaking general studio direction, resulting in his services coming under much demand. He worked with numerous artists including the Rolling Stones on Their Satanic Majesties Request (Jones' string arrangement is heard on \"She's a Rainbow\");Australian Broadcasting Corporation  – Triple J Music Specials – Led Zeppelin (first broadcast 12 July 2000) Herman's Hermits; Donovan (on \"Sunshine Superman,\" \"Hurdy Gurdy Man,\" and \"Mellow Yellow\"); Jeff Beck; Françoise Hardy; Cat Stevens; Rod Stewart; Shirley Bassey; Lulu; and numerous others. As well as recording sessions with Dusty Springfield, Jones also played bass for her Talk of the Town series of performances. His arranging and playing on Donovan's \"Sunshine Superman\" resulted in producer Mickie Most using his services as choice arranger for many of his own projects, with Tom Jones, Nico, Wayne Fontana, the Walker Brothers, and many others. In 1967, Most, as music supervisor, also tabbed Jones to arrange the music for Herman's Hermits' theatrical film Mrs. Brown, You've Got a Lovely Daughter, released in January 1968. Such was the extent of Jones' studio work – amounting to hundreds of sessions – that he said years later that \"I can't remember three-quarters of the sessions I was on.\"David Cavanagh, \"Interview with John Paul Jones \", Uncut."]}, {"page": "Tina Arena", "response": ["In 2007, Arena's sixth studio album, Songs of Love & Loss, was recorded independently and self-financed as she no longer had a recording contract in Australia. The album was issued on 1 December 2007 after a new deal was struck with EMI. It has torch songs, originally recorded by women in the 1960s and 1970s, including by Dusty Springfield and Diana Ross, and the arrangements featured a full string orchestra conducted by Simon Hale. A promotional tour of Australia, in early November, included appearances on Dancing with the Stars and Sunrise. Five concert dates backed by a 35-piece orchestra were held over December to January: three at the Sydney Opera House and two at Melbourne's Hamer Hall. The album peaked at No. 3 on the ARIA Albums Chart; at the ARIA Music Awards of 2008 it was nominated for Best Selling Album.", "Numerous media and musical contemporaries have praised Arena's skill as a world-class singer. Music journalist Ed Nimmervoll commented that Arena \"has a voice that can give you goosebumps\", while news journalist Kate de Brito says that it is \"smooth and musical even when she talks.\" Cameron Adams of the Herald Sun says she has a \"beautiful voice telling a beautiful story.\" William Yeoman of The West Australian commented that \"Arena's voice is redolent of both youthful pop and mature cabaret.\" The Australian Broadcasting Corporation's monthly classical music and arts magazine, Limelight, commented that, \"Tina Arena is a performer with a supreme voice, boundless range and energy, and charm to spare.\" Kelsey Munro of The Sydney Morning Herald says that her voice is \"strong, smooth and pitch-perfect.\" According to Heidi Maier of Tom magazine, it can be described as \"remarkably strong\". She also said, \"Tina Arena has a powerhouse voice and when she hits her marks, she hits them with forcefulness and verve.\" Spiritworks Australia says, \"Whether she's singing spine-tingling renditions of contemporary classics by Lulu, Dusty Springfield or Blondie or her self-penned hits Sorrento Moon, Chains or Burn, Tina Arena is acclaimed as one of the world's most versatile and magnificent vocal interpreters. Her voice is smooth, rich and streaming with emotion.\"", "Arena's musical influences include Barbra Streisand, Carole King, Dusty Springfield, Petula Clark, Aretha Franklin and various Italian singers. She has noted that in a non-musical perspective, Princess Diana inspired her and called her \"a great role model for women\"."]}, {"page": "Kensington", "response": ["*Dusty Springfield (1939–1999), singer"]}, {"page": "Springfield", "response": ["* Dusty Springfield (1939–1999), English pop singer (born Mary O'Brien)"]}, {"page": "Atlantic Records", "response": ["In addition to establishing Cotillion, Atlantic began expanding its own roster to include rock, soul/rock, progressive rock, British bands and singer songwriters. Two female artists were personally signed by Wexler, with album releases in 1969, Dusty Springfield (Dusty in Memphis) and Lotti Golden (Motor-Cycle),Barry, Thomas (September 9, 1969). \"The Salty Socking Soul of Lotti Golden\". Look, pp. 76, 78. although Golden also had a close working relationship with Ertegun, who was instrumental in her signing with the label. By 1969, the Atlantic 8000 series (1968–72) consisted of R&B, rock, soul/rock and psychedelic acts. Other releases that year include albums by Aretha Franklin (Soul '69), Led Zeppelin (Led Zeppelin), Don Covay (House of Blue Lights), Boz Scaggs (Boz Scaggs), Roberta Flack (First Take), Wilson Pickett (Hey Jude), Mott the Hoople (Mott the Hoople), and Black Pearl (Black Pearl).", "In 1968 Peter Grant flew to New York with tapes of the debut album by British rock band Led Zeppelin. Ertegun and Wexler knew of the group's leader, Jimmy Page, through The Yardbirds, and their favorable opinion was reinforced by Dusty Springfield, who recommended Atlantic sign the band. Atlantic signed the band to an exclusive five-year contract, one of the \"most substantial\" in the label's history Zeppelin recorded for Atlantic from 1968 to 1973. After the contract expired, they founded their label Swan Song and signed a distribution deal with Atlantic after being turned down by other labels."]}, {"page": "Soul music", "response": ["In the early 1960s, small soul scenes began popping up around the UK. Liverpool in particular had an established black community from which artists such as Chants and Steve Aldo emerged and go on to record within the British music industry. As a result, many recordings were commercially released by British soul acts during the 1960s which were unable to connect with the mainstream market. Nevertheless, soul has been a major influence on British popular music since the 1960s including bands of the British Invasion, most significantly the Beatles.P. Humphries, The Complete Guide to the Music of the Beatles (Music Sales Group, 1998), p. 83. There were a handful of significant British blue-eyed soul acts, including Dusty Springfield and Tom Jones.R. Gulla, Icons of R&B and soul: an encyclopedia of the artists who revolutionized rhythm (Greenwood Publishing Group, 2008), p. xxii. In the 1970s Carl Douglas, the Real Thing and Delegation had hits in the UK. American soul was extremely popular among some youth sub-cultures like the mod, Northern soul and modern soul movements, but a clear genre of British soul did not emerge until the 1980s when several artists including George Michael, Sade, Simply Red, Lisa Stansfield and Soul II Soul enjoyed commercial success.G. Wald, \"Soul's Revival: White Soul, Nostalgia and the Culturally Constructed Past\", M. Guillory and R. C. Green, Soul: Black power, politics, and pleasure (New York University Press, 1997), pp. 139–58. The popularity of British soul artists in the U.S., most notably Amy Winehouse, Adele, Estelle, Duffy, Joss Stone and Leona Lewis, led to talk of a \"Third British Invasion\" or \"British Soul Invasion\" in the 2000s and 2010s.Selling their soul: women leading the way in R&B British invasion  Canada.com June 9, 2008The New British Invasion: Soul Divas 2008  The Daily Voice, April 30, 2008."]}, {"page": "Henley-on-Thames", "response": ["* Singer Dusty Springfield (1939–1999) has a gravesite and marker in the grounds of St Mary the Virgin parish church. Her ashes were scattered in Henley and in Ireland at the Cliffs of Moher. Each year her fans gather in Henley to celebrate \"Dusty Day\" on the closest Sunday to her birthday (16 April)."]}, {"page": "Camp (style)", "response": ["thumb|left|upright|Dusty Springfield in 1966", "Dusty Springfield is a camp icon. In public and on stage, Springfield developed a joyful image supported by her peroxide blonde beehive hairstyle, evening gowns, and heavy make-up that included her much-copied \"panda eye\" mascara.Laurense Cole (2008) Dusty Springfield: in the middle of nowhere, Middlesex University Press. p. 13.Charles Taylor (1997). Mission Impossible: The perfectionist rock and soul of Dusty Springfield, Boston Phoenix. Springfield borrowed elements of her look from blonde glamour queens of the 1950s, such as Brigitte Bardot and Catherine Deneuve, and pasted them together according to her own taste.Bob Gulla (2007) Icons of R&B and Soul: An Encyclopedia of the Artists Who Revolutionized Rhythm, Greenwood Publishing Group  Her ultra-glamorous look made her a camp icon and this, combined with her emotive vocal performances, won her a powerful and enduring following in the gay community. Besides the prototypical female drag queen, she was presented in the roles of the \"Great White Lady\" of pop and soul and the \"Queen of Mods\".Patricia Juliana Smith (1999) \"'You Don't Have to Say You Love Me': The Camp Masquerades of Dusty Springfield\", The Queer Sixties pp. 105–126, Routledge, London  More recently South Korean rapper Psy, known for his viral internet music videos full of flamboyant dance and visuals, has come to be seen as a 21st-century incarnation of camp style. \"Exploring Psy's Digital Dandy Appeal In 'Gangnam Style' \"  (3 October 2012) Rolling Stone (retrieved 21 April 2013)"]}, {"page": "British Invasion", "response": ["The British Invasion was a cultural phenomenon of the mid-1960s, when rock and pop music acts from the United Kingdom and other aspects of British culture became popular in the U.S. and significant to the rising \"counterculture\" on both sides of the Atlantic Ocean. Pop and rock groups such as the Beatles, the Rolling Stones, the Zombies, the Kinks, the Dave Clark Five, Herman's Hermits, the Hollies, the Animals, Gerry and the Pacemakers, the Searchers, the Yardbirds, the Who and Them, as well as solo singers like Dusty Springfield, Cilla Black, Petula Clark, Tom Jones, and Donovan, were at the forefront of the \"invasion\".Perone, James E. Mods, Rockers, and the Music of the British Invasion. Westport, CT: Praeger, 2009. Print.", "One week after the Beatles entered the Hot 100 for the first time, Dusty Springfield, having launched a solo career after her participation in the Springfields, became the next British act to reach the Hot 100, peaking at number twelve with \"I Only Want to Be with You\". During the next three years, many more British acts with a chart-topping US single would appear.  As 1965 approached, another wave of British Invasion artists emerged which usually composed of groups playing in a more pop style, such as The Hollies or The Zombies as well as artists with a harder-driving, blues-based approach like the Dave Clark Five, the Kinks, and the Rolling Stones. On 8 May 1965, the British Commonwealth came closer than it ever had to a clean sweep of a weekly Hot 100's Top Ten, lacking only a hit at number two instead of \"Count Me In\" by Gary Lewis & the Playboys.  The previous week, the British Commonwealth held down the top six on the Hot 100 and also nearly swept the Cash Box singles chart's Top Ten, lacking only a hit at number six instead of \"Count Me In\". That same year, half of the 26 Billboard Hot 100 chart toppers (counting the Beatles' \"I Feel Fine\" carrying over from 1964) and the number-one position on 28 of the 52 chart weeks belonged to British acts. The British trend would continue into 1966 and beyond.Perone, James E. Mods, Rockers, and the Music of the British Invasion. Westport, CT. Praeger, 2009. Print. British Invasion acts also dominated the music charts at home in the United Kingdom."]}, {"page": "Janis Ian", "response": ["Other artists have recorded Ian's compositions, including Roberta Flack, who had a hit in 1973 with Ian's song \"Jesse\", which peaked at #19 on the Billboard pop charts on November 3, 1973. Ian's own version is included on her 1974 album Stars (the title song of which has also been oft-covered, including versions by Joan Baez, Shirley Bassey, Cher, Nina Simone and Barbara Cook). \"At Seventeen\" is Ian's most covered composition with 50 versions by artists including Celine Dion, Miki Howard and Julia Fordham amongst others. Ian's song \"In The Winter\" has also been covered many times by singers including Dusty Springfield and Sheena Easton. Richard Barone recorded Ian's song \"Sweet Misery\" on his album Sorrows & Promises: Greenwich Village in the 1960s in 2016. She continues to tour worldwide, though she's stated that her 2022 N. American tour will be her \"last full tour\"."]}, {"page": "Charles Aznavour", "response": ["Artists who have recorded his songs and collaborated with Aznavour include Édith Piaf, Fred Astaire, Frank Sinatra (Aznavour was one of the rare European singers invited to duet with him), Andrea Bocelli, Bing Crosby, Ray Charles, Bob Dylan (he named Aznavour among the greatest live performers he had ever seen), Dusty Springfield, Liza Minnelli, Mia Martini, Elton John, Dalida, Serge Gainsbourg, Josh Groban, Petula Clark, Tom Jones, Shirley Bassey, José Carreras, Laura Pausini, Roy Clark, Nana Mouskouri and Julio Iglesias. Fellow French pop singer Mireille Mathieu sang and recorded with Aznavour on numerous occasions. The English singer Marc Almond was noted by Aznavour as his favourite interpreter of his songs, having covered Aznavour's \"What makes a man a man\" in the 1990s. Almond cited Aznavour as a major influence on his style and work. In 1974, Jack Jones recorded an entire album of Aznavour compositions entitled Write Me A Love Song, Charlie, re-released on CD in 2006.  Two years later, in 1976, Dutch singer Liesbeth List released her album Charles Aznavour Presents Liesbeth List, which featured Aznavour's compositions with English lyrics. Aznavour and Italian tenor Luciano Pavarotti sang Gounod's aria \"Ave Maria\" together. He performed with Russian cellist and friend Mstislav Rostropovich to inaugurate the French presidency of the European Union in 1995. Elvis Costello recorded \"She\" for the film Notting Hill. One of Aznavour's greatest friends and collaborators from the music industry was Spanish operatic tenor Plácido Domingo, who often performs his hits, most notably a solo studio recording of \"Les bâteaux sont partis\" in 1985 and duet versions of the song in French and Spanish in 2008, as well as multiple live renditions of Aznavour's \"Ave Maria\". In 1994, Aznavour performed with Domingo again and Norwegian soprano Sissel Kyrkjebø at Domingo's third annual Christmas in Vienna concert. The three singers performed a variety of carols, medleys and duets, and the concert was televised throughout the world, as well as released on a CD internationally."]}, {"page": "Jacques Brel", "response": ["* Dusty Springfield"]}, {"page": "Hayes, Hillingdon", "response": ["Botwell House hosted early performances by The Rolling Stones (5 August 1963) and The Who (19 April 1965). Accounts of an open-air pop festival organised at Botwell House in 1963 and 1964  – where performers included Dusty Springfield and Screaming Lord Sutch – suggest these may arguably have been the first examples of an open-air pop festival in the UK (excluding jazz festivals). The Blue Moon club on Church Road – next to Hayes F.C., 1964–1966 – hosted performances by bands including: The Yardbirds (10 June 1964), The Who (20 June 1965), and Eric Clapton's Cream (18 September 1966)."]}, {"page": "Jennifer Warnes", "response": ["In 1985, she recorded a duet version with B. J. Thomas of the song \"As Long As We Got Each Other\", the theme for the TV show Growing Pains. It was used as the opening theme for the second and third seasons. For the fourth season, the song was once again re-recorded with Thomas and Dusty Springfield. However, the Warnes version made its return for the fifth season and the seventh (final) season of the show. The same year, she recorded vocals for Leonard Cohen's record Various Positions, getting equal vocals credits with Cohen in the inside booklet. After releasing a praised tribute LP of Leonard Cohen's songs in 1987, Famous Blue Raincoat, to which Cohen contributed two new compositions, \"First We Take Manhattan\", which featured Stevie Ray Vaughan on guitar, and \"Ain't No Cure for Love\", she contributed vocals to Cohen's 1988 hit LP I'm Your Man, most notably to \"Take This Waltz\" and \"Tower of Song\"."]}, {"page": "Anne Murray", "response": ["Anne Murray Duets: Friends & Legends was released in November 2007 in Canada and January 2008 in the U.S. The album comprised seventeen tracks that included many of Murray's biggest hits over her four-decade career, re-recorded as duets with other established, rising, and – in one case – deceased female singers. These artists included Céline Dion, Shania Twain, k.d. lang, Nelly Furtado, Jann Arden, Québec's Isabelle Boulay, Murray's daughter Dawn Langstroth, Olivia Newton-John, Emmylou Harris, Martina McBride, Shelby Lynne, Amy Grant, Carole King, the Indigo Girls, Irish sextet Celtic Woman, Dusty Springfield, and Sarah Brightman. The duet with soprano Brightman was of her 1970 hit song, \"Snowbird\"."]}, {"page": "Vox (company)", "response": ["Vox's first electric guitars, the Apache, Stroller and Clubman were modeled after solid-body, bolt-neck Fenders, which at the time were not available in the UK. A four-string Clubman Bass followed shortly after. These first guitars were low-priced, had unusual TV connector output jacks and were produced by a cabinet maker in Shoeburyness, Essex. Vox president Tom Jennings commissioned London Design Centre to create a unique new electric guitar, and in 1962 Vox introduced the pentagonal Phantom, originally made in England but soon after made by EKO of Italy. The first Phantom guitars were given to The Echoes to trial in 1962 and were used by them until 1970. They can be heard on many of their recordings and records they did with other artists such as Dusty Springfield. Aside from the unusual body and headstock shapes, Phantoms featured copies of the Fender Stratocaster neck and its attachment, the Strat's three single-coil pick-ups and standard vibrato bridge that in this case copied a Bigsby unit. Aside from being a bit awkward to hold for seated playing, the Phantom guitars now approached professional quality, performance and price. Phil \"Fang\" Volk of Paul Revere & the Raiders played a Phantom IV bass (which was eventually retrofitted with a Fender neck). It was followed a year later by the teardrop-shaped Mark VI, the prototype of which had only two pick-ups (rather than three) and was made specifically for Brian Jones of The Rolling Stones, again using a Bigsby-like \"Hank Marvin\" bridge. By the end of the decade, Stones bassist Bill Wyman was shown in Vox advertisements playing a teardrop hollow-bodied bass made for him by the company, subsequently marketed as the Wyman Bass. Many guitar gear authorities dispute that he ever actually used the instrument for recording or live performance. (See also Vox Bass Guitar.)"]}, {"page": "Carole King", "response": ["Other songs of King's early period (through 1967) include \"Half Way To Paradise\" [Tony Orlando, recorded by Billy Fury in U.K.], \"Take Good Care of My Baby\" for Bobby Vee, \"Up on the Roof\" for the Drifters, \"I'm into Something Good\" for Earl-Jean (later recorded by Herman's Hermits), \"One Fine Day\" for the Chiffons, and \"Pleasant Valley Sunday\" for the Monkees (inspired by their move to suburban West Orange, New Jersey),La Gorce, Tammy. New Jersey's Magic Moments , The New York Times, October 30, 2005. Accessed November 25, 2007. and \"(You Make Me Feel Like) A Natural Woman\" for Aretha Franklin. The duo wrote several songs recorded by Dusty Springfield, including \"Goin' Back\" and \"Some of Your Lovin'.\""]}, {"page": "The Zombies", "response": ["In 1968, Argent and White began working on material for a possible new band when they were approached by CBS to do another Zombies album. Several new tracks were cut with a line-up of Argent, Hugh Grundy, Rodford (bass) and Rick Birkett (guitar), and were combined with some old Decca out-takes and demos that were overdubbed and enhanced in sessions at Morgan Studios in London. The album, scheduled for release in 1969, was cancelled and only a couple of the songs, \"Imagine the Swan\" (one of the newly recorded songs) and \"If It Don't Work Out\" (a demo of a song that Dusty Springfield recorded and released in 1965), were put out as singles instead. (Some of this material was released on various compilation albums during the 1970s and 1980s, and the album, titled R.I.P., was finally released in Japan in 2000)."]}, {"page": "Labelle", "response": ["As grittier soul and heavy rock dominated much of Atlantic's time, the group was let go from their contract in 1970. Bernard Montague, who was managing groups such as The Delfonics, also left them, leaving them seeking new managers. After nearly signing a contract with Herb Hamlett and Frankie Crocker, they eventually picked Vicki Wickham to work with them. Wickham later credited Dusty Springfield with convincing her to hire the group to perform on Ready, Steady, Go in London."]}, {"page": "Ealing", "response": ["Dusty Springfield lived in Kent Gardens, West Ealing as a teenager and attended St. Anne's Convent school in Little Ealing Lane."]}, {"page": "List of one-hit wonders on the UK Singles Chart", "response": ["| The Detroit group followed their only hit with a cover of Dusty Springfield's \"You Don't Have To Say You Love Me\""]}, {"page": "Diana Ross", "response": ["Diana Ross was named one of the Five Mighty Pop Divas of the Sixties along with Dusty Springfield, Aretha Franklin, Martha Reeves, and Dionne Warwick."]}]}}