{"wiki_id": "http://www.wikidata.org/entity/Q220450", "itemLabel": "David Gemmell", "itemDescription": "British author of heroic fantasy (1948-2006)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Gemmell", "wikipedia_page": {"main": "David Andrew Gemmell (; 1 August 1948 – 28 July 2006) was a British author of heroic fantasy, best known for his debut novel, Legend. A former journalist and newspaper editor, Gemmell had his first work of fiction published in 1984. He went on to write over thirty novels. Gemmell's works display violence, yet also explore themes of honour, loyalty and redemption. There is always a strong heroic theme but nearly always the heroes are flawed in some way. With over one million copies sold, his work continues to sell worldwide.\nThe David Gemmell Awards for Fantasy were awarded from 2009 to 2018, with a stated goal to \"restore fantasy to its proper place in the literary pantheon\". A steering group of 18 authors was chaired by writer Stan Nicholls and the award was decided by a public vote.", "link_mentions": [{"page": "Achilles", "response": ["* Achilles is a major supporting character in David Gemmell's Troy series of books (2005–2007)."]}, {"page": "August 1", "response": ["*  1948   – David Gemmell, English journalist and author (d. 2006)"]}, {"page": "Aeneas", "response": ["Aeneas appears in David Gemmell's Troy series as a main heroic character who goes by the name Helikaon."]}, {"page": "July 28", "response": ["*2006 – David Gemmell, English author (b. 1948)"]}, {"page": "Odysseus", "response": ["Odysseus is also a character in David Gemmell's Troy trilogy (2005–2007), in which he is a good friend and mentor of Helikaon. He is known as the ugly king of Ithaka. His marriage with Penelope was arranged, but they grew to love each other. He is also a famous storyteller, known to exaggerate his stories and heralded as the greatest storyteller of his age. This is used as a plot device to explain the origins of such myths as those of Circe and the Gorgons. In the series, he is fairly old and an unwilling ally of Agamemnon."]}, {"page": "Robert E. Howard", "response": ["Howard influenced and inspired later writers including Samuel R. Delany, David Gemmell, Michael Moorcock, Matthew Woodring Stover, Charles R. Saunders, Karl Edward Wagner, Paul Kearney, Steven Erikson, Joe R. Lansdale, and William King.: \"True, the era during which drugstore racks were a Muscle Beach of Kandars, Kothars, Thongors, Wandors, Odans, and Orons is long gone, but is S&S in trouble?\" Tompkins then presents a series of quotes from modern fantasy writers who claim a strong Howardian influence. He also has an influence on the field of fantasy fiction rivaled only by J. R. R. Tolkien and Tolkien's similarly inspired creation of the modern genre of high fantasy.: \"The combined success of Howard's Conan books and J.R.R. Tolkien's LotR in paperback had resulted in unprecedented interest in heroic and high fantasy.\"; \"[Howard] remains of central interest in the field of fantasy for his sword and sorcery; the templates he established for that mode have remained influential for most of the 20th century.\""]}, {"page": "Elysium", "response": ["In David Gemmell's Parmennion series (Lion of Macedon and Dark Prince) and his Troy trilogy, his characters refer to Elysium as the \"Hall of Heroes\". In Siegfried Sassoon's Memoirs of a Fox-Hunting Man, Sassoon writes \"The air was Elysian with early summer\". Its use in this context could be prolepsis, as the British countryside he is describing would become the burial ground of his dead comrades and heroes from World War I."]}, {"page": "List of fantasy authors", "response": ["* David Gemmell, (1948–2006) author of the Drenai novels"]}, {"page": "Morning Star", "response": ["* Morningstar, a 1992 novel by David Gemmell"]}, {"page": "Xanthos", "response": ["In the literary Troy Series by author David Gemmell, the Xanthos is the largest ship ever built, belonging to the series' main character, Helikaon."]}, {"page": "Andromache", "response": ["She is also the subject of a tragedy by French classical playwright Jean Racine (1639–1699), entitled Andromaque, and a minor character in Shakespeare's Troilus and Cressida. \"The Andromache\" is referenced in The Duc De L'Omelette written by Edgar Allan Poe in published in 1832. In 1857, she also importantly appears in Baudelaire's poem, \"Le Cygne\", in Les Fleurs du Mal. Andromache is the subject of a 1932 opera by German composer Herbert Windt and also a lyric scena  for soprano and orchestra by Samuel Barber. She was portrayed by Vanessa Redgrave in the 1971 film version of Euripides' The Trojan Women, and by Saffron Burrows in the 2004 film Troy. She also appears as a character in David Gemmell's Troy series. In the 2018 TV miniseries Troy: Fall of a City, she was portrayed by Chloe Pirrie. She is reimagined in The Old Guard as a present-day immortal paladin who aspires to improve the human condition despite her cynicism rooted in ongoing global conflict."]}, {"page": "Astyanax", "response": ["*In David Gemmell's Troy series, Astyanax is the son of Andromache and Aeneas/Helikaon (though he is unaware of this for most of the story). After the Trojan War, Aeneas escapes from Troy with Andromache and Astyanax to Seven hills, a colony in Italy Aeneas and Odysseus found."]}, {"page": "Battle of Leuctra", "response": ["The battle is fictionalized, though in some detail, in David Gemmell's book, Lion of Macedon, which includes the significant deviation from historical canon in that it is credited to a young Parmenio(n) instead of Epaminondas, who serves merely to gain permission to carry out the echelon tactic. The battle is also the subject of Victor Davis Hanson's 2011 historical fiction novel, The End of Sparta. The battle was also featured in an episode of the BBC's Time Commanders. It was also featured in the historical fiction graphic novel Serpent and Prey, which takes few creative liberties with the battle's portrayal."]}, {"page": "Stephen Hunt (author)", "response": ["Stephen Hunt is a writer best known for a series of fantasy novels with steampunk elements known as the Jackelian series, whose central setting is a nation somewhat resembling Victorian England named the Kingdom of Jackals. Influences on his work include: Jack Williamson, Stephen Goldin, David Gemmell, Bruce Sterling, Larry Niven and Michael Moorcock.", "In November 2008, his second book in the Jackelian series, The Kingdom Beyond the Waves, was nominated for the long-list of the David Gemmell Legend Award for Fantasy. The second novel continues the misadventures of u-boat privateer Commodore Jared Black, as the commodore goes in search of the ruins of a lost ancient utopia."]}, {"page": "List of historical novels", "response": ["*Lion of Macedon by David Gemmell (Alexander's general Parmenion)"]}, {"page": "Legio IX Hispana", "response": ["* In David Gemmell's \"Stones of Power\" historical fantasy series, (1988–1991) the Ninth have been trapped in Limbo and are released by the protagonists (Uther Pendragon in Ghost King and Alexander the Great in Dark Prince (1991)) to help in battles."]}, {"page": "List of fictional diseases", "response": ["|The Legend of Deathwalker by David Gemmell"]}, {"page": "Parmenion", "response": ["Parmenion is the main character in David Gemmell's books Lion of Macedon and Dark Prince."]}, {"page": "Fiction set in ancient Greece", "response": ["* David Gemmell", "* David Gemmell"]}, {"page": "Attalus (general)", "response": ["*In the 1990 and 1991 historical fiction books Lion of Macedon and Dark Prince by David Gemmell. Attalus is portrayed as an assassin, swordsman and later general of Philip II of Macedonia."]}, {"page": "Bibliography of King Arthur", "response": ["* Stones of Power by David Gemmell"]}, {"page": "Gideon Stargrave", "response": ["Despite Morrison's statement, Michael Moorcock was so outraged that he reportedly wrote a letter to Vertigo, to be printed in all their magazines, \"publicly voicing his disgust\". Although Moorcock has encouraged other authors to use Jerry Cornelius, in a way that borders on open source, he has posted a number of comments about a couple of authors who, he believes, have directly lifted the character.Discussion of Morrison's work at Moorcock's Miscellany  David Gemmell is one author, but Moorcock reserves most of his scorn for Morrison:"]}, {"page": "Legend (Gemmell novel)", "response": ["Legend is a fantasy novel by British writer David Gemmell, published in 1984.  It established him as a major fantasy novelist and created the character of Druss, who would appear in several subsequent books. It was the first novel by Gemmell, and in The Drenai saga.", "Druss the Legend is a hero embodying virtue, courage, honour, chivalry and strength of character. Druss is the grandson of Bardan the Slayer, a psychotic madman driven insane by the demon residing within his rune covered enchanted axe, Snaga the Sender (Druss later exorcised the demon while looking for his wife Rowena). Druss is described as a physically imposing man, immensely strong but also possessing great speed and dexterity. He has a hard, flat face, black hair and a thick, black beard and pale blue eyes. Despite his initial lack of formal combat training, he becomes known as a fearsome warrior who has never been bested in single combat. He wears the armour and weapons of his grandfather, which includes a black leather jerkin with silver steel pauldrons, black leather gauntlets with reinforced steel plates covering the knuckles and forearms, black leather boots and a black pot helmet with a silver axe motif on the brow flanked by small silver skulls. Druss was the main protagonist in Gemmell's first novel, Legend, however chronologically his story begins in The First Chronicles of Druss the Legend and is continued in The Legend of Deathwalker. Having died in Legend, Druss reappears in The Swords of Night and Day, both as a spirit wandering in the darkness, and in physical form by possessing his clone. In October 2000 at the World Fantasy Convention in Texas, David Gemmell gave an interview in which he revealed that Druss was based on his stepfather, Bill. \"Years later, when I wrote my first novel, I used Bill as the model for a character. His name was Druss the Legend. Bill re-appeared in many novels thereafter, in many guises.\"", "Category:Novels by David Gemmell"]}, {"page": "The First Chronicles of Druss the Legend", "response": ["The First Chronicles of Druss the Legend is a fantasy novel by British author David Gemmell, first published in 1993. The novel is a prequel to the popular title Legend. The novel details the early life and events of the character Druss, it is followed by The Legend of Deathwalker, which deals with later events in his life between this book and the events in \"Legend\".", "Category:Novels by David Gemmell"]}, {"page": "The King Beyond the Gate", "response": ["The King Beyond The Gate is a fantasy novel by British writer David Gemmell. It was published in 1985. It was the second book published by Gemmell, after Legend, published a year earlier. The book is set in the same fictional world as Legend, that of the Drenai, but is not a sequel in the usual sense as the events of the two books take place around a century apart. Thus the main protagonists of Legend are long since dead and play little part in The King Beyond the Gate, other than passing mentions. This set a precedent for the entire Drenai series, in which very few characters appear in more than one novel, the gaps between novels sometimes running to centuries, giving a more epic, historical flavour to the series.", "Category:Novels by David Gemmell"]}, {"page": "Bantam Books", "response": ["* David Gemmell"]}, {"page": "2006 in literature", "response": ["*July 28 – David Gemmell, English fantasy novelist (born 1948)"]}, {"page": "Druss the legend", "response": ["#REDIRECT David Gemmell#Drenai Series "]}, {"page": "Skilgannon the Damned", "response": ["#REDIRECT David Gemmell#Drenai Series"]}, {"page": "The Swords of Night and Day", "response": ["The Swords of Night and Day is a fantasy novel by David Gemmell, as well as a pair of legendary swords within the book. They also appear in Gemmell's book White Wolf. The book is set 1000 years following the death of Olek Skilgannon.", "Category:Novels by David Gemmell"]}, {"page": "Paul Kearney", "response": ["Paul Kearney (born 1967) is a Northern Irish fantasy author. He is noted for his work in the epic fantasy subgenre and his work has been compared to that of David Gemmell.", "In 2009 Kearney was longlisted for the inaugural David Gemmell Legend Award for Best Fantasy Novel."]}, {"page": "Atlantis in popular culture", "response": ["* David Gemmell's fantasy novels make use of story of Atlantis in the Jon Shannow series (Wolf of Shadow, The Last Guardian and Bloodstone) and the Stones of Power series (Ghost King and Last Sword of Power)."]}, {"page": "Compupress", "response": ["During the late nineties, Anubis, the company’s book-publishing branch, turned to translating fantasy and science-fiction best-sellers in order to compensate for the declining computer-book sales figures. In the next few years the company gradually shifted its production from computer and business-related titles to fantasy and science-fiction. Amongst the authors that Anubis has introduced to the Greek public are Frank Herbert (Dune series), George R. R. Martin (A Song of Ice and Fire series), Terry Brooks (Shannara series), Guy Gavriel Kay (The Fionavar Tapestry, Tigana, A Song for Arbonne, The Lions of Al-Rassan, The Sarantine Mosaic), Terry Goodkind (Sword of Truth series), Robin Hobb (The Farseer trilogy, The Liveship Traders trilogy), David Gemmell (Drenai and Rigante series), Joe Abercrombie (The First Law trilogy). In addition, Anubis has also published more than 80 books of the classic RPG Dragonlance and Forgotten Realms series licensed from Wizards of the Coast, a number of Warhammer novels licensed from Black Library, as well as a dozen Warcraft and Starcraft novels licensed from Blizzard Entertainment."]}, {"page": "Troy: Lord of the Silver Bow", "response": ["#REDIRECT David Gemmell"]}, {"page": "List of high fantasy fiction", "response": ["* David Gemmell's Legend series"]}, {"page": "Drenai", "response": ["#REDIRECT David Gemmell#Drenai Series"]}, {"page": "Deaths in July 2006", "response": ["*David Gemmell, 57, British fantasy novelist."]}, {"page": "The Thirty (Drenai Series)", "response": ["#REDIRECT David Gemmell#Drenai Series"]}, {"page": "Trojan War in literature and the arts", "response": ["*David Gemmell's Troy Series: "]}]}}