{"wiki_id": "http://www.wikidata.org/entity/Q22081694", "itemLabel": "Sadie Morgan", "itemDescription": "English designer, businessperson and spokesperson", "wikipedia_url": "https://en.wikipedia.org/wiki/Sadie_Morgan", "wikipedia_page": {"main": "Sadie Anna Morgan  (born 28 February 1969) is an English designer. In 1995 she founded dRMM, the RIBA Stirling Prize winning architecture practice, with Alex de Rijke and Philip Marsh.\nMorgan is the chair of the Independent Design Panel for High Speed Two (HS2) UK, and a board member of both the National Infrastructure Commission (NIC) UK and the Thames Estuary 2050 Growth Commission. She is one of the Mayor's Design Advocates for the Greater London Authority (GLA), a Non-Executive Director of the Major Projects Association, a Professor of Professional Practice at London University of Westminster, and a Fellow of the UK Royal Society for the Encouragement of Arts, Manufactures and Commerce.", "link_mentions": [{"page": "1969 in architecture", "response": ["*February 28 – Sadie Morgan, English architect and designer"]}, {"page": "National Infrastructure Commission", "response": ["* Sadie Morgan (five-year reappointment confirmed in September 2020)"]}, {"page": "Alex de Rijke", "response": ["Alex de Rijke (born 1960) is a British architect, timber architecture advocate, educationalist and architectural photographer. De Rijke founded the architecture practice, dRMM, in 1995 with Philip Marsh and Sadie Morgan. De Rijke’s research into, and application of, contemporary materials, technologies and methods of construction have helped make dRMM a globally recognised pioneer and authority in engineered timber design."]}, {"page": "DRMM", "response": ["#REDIRECT Sadie Morgan#dRMM Architects"]}, {"page": "Roger Zogolovitch", "response": ["* 2003 - One Centaur Street, London, with Alex de Rijke and Sadie Morgan, dRMM"]}, {"page": "Educational architecture", "response": ["* Joseph Fuller, G. Topham Forrest, Sadie Morgan; architects specialised in educational architecture."]}]}}