{"wiki_id": "http://www.wikidata.org/entity/Q22097886", "itemLabel": "Sydney Lee", "itemDescription": "English billiards and snooker player", "wikipedia_url": "https://en.wikipedia.org/wiki/Sydney_Lee_(snooker_player)", "wikipedia_page": {"main": "Sydney Lee (April 1911 – 1986) was an English professional billiards and snooker player. He was four times a quarter-finalist in the World Snooker Championship during the first half of the twentieth century. He was a snooker referee on Pot Black. He was the game consultant for a 1970 episode of Steptoe and Son entitled \"Pot Black\" and, as well as performing a number of trick shots was the stand-in for many of the more difficult regular shots seen in the show.", "link_mentions": [{"page": "List of snooker players", "response": ["*Sydney Lee"]}, {"page": "Horace Lindrum", "response": ["Lindrum returned to London to compete in the 1937 World Snooker Championship. He won his quarter-final against Sydney Lee and his semi-final against Willie Smith comfortably and met Joe Davis again in the final. The first day was level at 5–5 but Lindrum led 11–9 and extended this to 17–13 at the half-way stage. The fourth day started with a break of 103 by Davis in frame 31. Davis fouled on his first visit to the table and, after a break of 29 by Lindrum, Davis cleared the table on his second visit. Davis reduced the deficit to 21–19 on the fourth day and then won eight frames on the fifth day to lead 27–23. After the final afternoon session Davis still led 29–26, with Lindrum needing to win five of the six evening frames. Lindrum won the first two but Davis won the next two to win the match 31–28. The last two frames were shared to give a final result of 32–29."]}, {"page": "IBSF World Billiards Championship", "response": ["| 1933 || London ||  Sydney Lee ||  Tom Jones || Round Robin", "| 1931 || Sydney ||  Laurie Steeples ||  Sydney Lee || Round Robin"]}, {"page": "List of snooker referees", "response": ["*  Sydney Lee"]}, {"page": "English Amateur Championship", "response": ["The final stages of the 1931 Championship were again held at Thurston's Hall. There were 41 entries, including previous winners Pat Matthews and Laurie Steeples. 9 players qualified: the 2 previous winners who entered, 2 from the London section and 5 from other sections. The final stages immediately followed the London section qualifying, starting on 24 April. Heats were reduced to 5 frames with the final over 9 frames. Steeples had to withdraw as he was on the way to Australia to play in the Empire Amateur Billiards Championship in which Sydney Lee was also competing. Pat Matthews met Harry Kingsley in the final on 29 April, Matthews winning by 5 frames to 4."]}, {"page": "1936 World Snooker Championship", "response": ["| Clare O'Donnell v Sydney Lee || 23–25 March 1936 || Thurston's Hall, London", "The Championship started on 23 March, following the 1935/1936 Daily Mail Gold Cup English billiards tournament two days earlier which has fully occupied Thurston's Hall since the beginning of the year. Sessions were extended to five frames, compared to the four frames that had been played in 1935. The first match was between Clare O'Donnell and Sydney Lee. O'Donnell led 6–4 after the first day and 11–9 after two days. Lee won the last two frames on the final afternoon to reduce O'Donnell's lead to 13–12 and then won the first three in the evening to lead 15–13 before O'Donnell won the last three frames to win the match 16–15."]}, {"page": "1937 World Snooker Championship", "response": ["The first match of the competition proper took place from 22 to 24 February and was between Horace Lindrum and Sydney Lee. Lee won the first , but Lindrum took an 8–2 lead after the first day by winning both the afternoon and evening  4–1.  This was extended to 15–5 after two days, just one frame from victory, as he won three of the five afternoon frames and all but one of the five evening frames. Lindrum took the first frame on the final day to win the match 16–5. The final score was 20–11.", "| Horace Lindrum v Sydney Lee || 22–24 February 1937 || Thurston's Hall, London ||"]}, {"page": "1938 World Snooker Championship", "response": ["The first match in the competition proper was held from 14 to 16 March, with defending champion Joe Davis playing Sydney Lee. Davis led 7–3 after the first day, making a 93  in frame 10. Davis won the match by winning the final frame on the second day, taking a 16–4 lead. Davis had made a 98 break in frame 16. The final score was 24–7. The correspondent for Billiards and Snooker magazine wrote that the quality of Davis's play was far ahead of his contemporaries, and that in the match \"his winning-hazard striking and his positional play were a revelation even for him.\"", "| Joe Davis v Sydney Lee || 14–16 March 1938 "]}, {"page": "1939 World Snooker Championship", "response": ["| Sidney Smith v Sydney Lee || 23–25 January 1939 || Thurston's Hall, London ||", "The first match was between Sidney Smith and Sydney Lee from 23 to 25 January. Smith had a 4–1 lead after the first , and 6–4 at the end of the first day. The next day, Smith claimed four of the five frames in the afternoon session so was 10–5 ahead. After the fourth session, his advantage was 13–7 and, by winning the first three frames on the final day, he achieved decisive 16–7 lead. The final score after  was 21–10."]}, {"page": "1940 World Snooker Championship", "response": ["From 29 February to 2 March, Fred Davis faced Sydney Lee in the third quarter-final. On the first day Lee won frame 4 but Davis led 9–1. The players each won five frames on the second day so that Davis led 14–6. Davis took the first two frames on the third day to win the match 16–6. The final score was 20–11, with Davis making a  of 88 in the evening session.", "| Fred Davis v Sydney Lee || 29 February–2 March 1940 "]}, {"page": "1946 World Snooker Championship", "response": ["Joe Davis and Walter Donaldson met in Wellington, Shropshire from 4 to 6 February 1946. Davis led 6–4 and 12–8 after the first two days. He took a winning lead during the final afternoon  at 16–9. The final score was 21–10. Davis made a  of 129 in frame 29. From 18 to 20 February, Stanley Newman, the winner of the qualifying competition, faced Sydney Lee at the Clifton Hotel in Blackpool. Newman led 6–4 and 12–8 after the first two days. He won four of the five frames on the final afternoon session to lead 16–9. The final score was 19–12.", "| Stanley Newman v Sydney Lee || 18–20 February 1946 || Clifton Hotel, Blackpool ||"]}, {"page": "1947 World Snooker Championship", "response": ["Qualifying matches were held at Burroughes Hall in London from 2 January to 8 February 1947. Herbert Holt had scratched from the qualifying in early December. The first match, between John Pulman and Albert Brown was a repeat of the final of the 1946 English Amateur Championship which Pulman had won. Brown led 14–9 after two days and took a winning 18–9 lead on the final day. Herbert Francis led Willie Leigh 14–10 after two days. Leigh levelled the score at 15–15 after the final afternoon session and eventually won 19–16. Sydney Lee beat Jim Lees 19–16 in the third match. In the last first-round match Kingsley Kennerley won easily against Conrad Stanbury, taking an 18–4 lead on the second evening."]}, {"page": "1948 World Snooker Championship", "response": ["All qualifying matches were held at Burroughes Hall in London. The first-round matches were held from 1 to 13 December 1947. In the first match Sydney Lee conceded his match to John Pulman before the second day's play because of an abscess on his neck. Pulman was leading 8–2 after the first day. Only 10 frames had been played because of a power cut which curtailed the afternoon session to three frames. Conrad Stanbury comfortably won the second match, against Eric Newman, taking a 19–5 winning lead after the second day. The third match between Willie Leigh and Herbert Holt was very close. Leigh won the final frame 83–35 to win the match. The final first-round matches between John Barrie and Herbert Francis was also close. The match was 12–12 after two days. Barrie won the match 19–16."]}, {"page": "1950 World Snooker Championship", "response": ["The qualifying contest was held at an 18-table hall in Battersea, London from 17 October to 12 November 1949. Kingsley Kennerley met John Barrie in the first match. Kennerley won the first five frames and led 15–9 after two days. He won the first three frames on the final day to take a winning 18–9 lead, eventually winning 21–14. Willie Smith met Bill Withers in the second match of the week. Willie Smith led 10–2 after the first day and took an 18–4 lead on the second day. The final score was 28–7. After a 3-day break Sydney Lee met Conrad Stanbury. Lee led 15–9 after two days and won 20–15. Herbert Holt met Dickie Laws in the last quarter-final match. Holt led 17–7 after two days and eventually won 26–9. Kennerley met Willie Smith in the first semi-final and led 16–8 after two days. Kennerley won 22–13. Sydney Lee and Herbert Holt met in the second semi-final. Lee led 7–5 after the first day and 16–8 after the second day. Holt then got influenza and conceded the match. Kennerley met Lee in the final. Lee took a 4–2 lead but Kennerley led 7–5 overnight. Kennerley then extended his lead to 14–10."]}, {"page": "1951 World Snooker Championship", "response": ["John Barrie met Sydney Lee at Burroughes Hall in London from 6 to 8 November. Barrie led 7–5 after the first day  and 15–9 after two days. He made a break of 101 on the second evening. He eventually won 23–12. Barrie then met Dickie Laws on the following three days also at Burroughes Hall. Barrie took an 8–4 lead, increased to a winning 18–6 lead after two days. The final score was 27–8."]}, {"page": "1952 World Professional Match-play Championship", "response": ["Sydney Lee withdrew, granting Kingsley Kennerley a walkover into the quarter-finals. Jackie Rea defeated Jim Lees 33–28 in their match from 12 to 17 November 1951, Albert Brown scored a 33–28 win over John Pulman when they met from 27 November to 1 December, and in a match from 17 to 22 December, Alec Brown achieved a winning margin at 33–17 before his last day's play against Rex Williams, finishing at 39–22. Williams had turned professional in 1951, becoming the first player to make the transition from being an amateur since Pulman and Brown had done so in 1946. Snooker historian Clive Everton wrote that Williams was \"hammered\" by Brown, and that this demonstrated the gulf in ability between the top amateurs and the professionals of the time."]}, {"page": "John Williams (snooker referee)", "response": ["The longstanding referee for snooker television show Pot Black, he took charge after Sydney Lee's retirement at the 1981 event. Williams was forced into retirement in 2002 due to contract negotiations with the World Professional Billiards and Snooker Association, but made sporadic appearances at the World Seniors Championship until 2012.", "As the popularity of snooker on television grew during the 1980s, Williams became a household name along with fellow top referees Len Ganley, John Street and Alan Chamberlain. Between Ganley, Street and Williams, they refereed the final of 17 of the first 20 World Championship finals held at the Crucible Theatre. After Sydney Lee's retirement in 1980, he became the referee of the snooker television show Pot Black for the 1981 event. He remained in the role for the remainder of the series and its revivals during the 1990s. Williams made a return to snooker refereeing when he officiated matches in the 2011 World Seniors Championship, and returned for the 2012 tournament."]}, {"page": "Daily Mail Gold Cup", "response": ["The 1939/1940 event was played from October 1939 to February 1940. There were 7 competitors and a total of 21 matches. Each match lasted six days and was the best of 61 frames, a reduction from the 71 frames played in previous years. There were 7 competitors which included three new to the event: Fred Davis, Walter Donaldson and Sydney Lee. Joe Davis gave Sidney Smith 20 points, Alec Brown 25, Walter Donaldson 25, Fred Davis 30, Tom Newman 40 and Sydney Lee 45. The cup was won for the second time by Alec Brown who won 5 of his 6 matches. Sydney Lee finished in second place ahead of Fred Davis. Both players had won 4 of their 6 matches but Lee had won more frames, 206 to Davis's 188.", "|  Sydney Lee", "*  Sydney Lee 1939/40"]}, {"page": "1939/1940 Daily Mail Gold Cup", "response": ["The 1939/1940 Daily Mail Gold Cup was a professional snooker tournament sponsored by the Daily Mail. The cup was won by Alec Brown with Sydney Lee finishing in second place in the final table. It was the sixth and last Daily Mail Gold Cup tournament, although only the fourth as a snooker event. The Daily Mail Gold Cup ran from 1935 to 1940.", "The 1939/1940 event was a round-robin snooker tournament and was played from 16 October 1939 to 10 February 1940. Most of the matches were played at Thurston's Hall in London. There were 7 competitors and a total of 21 matches. Each match lasted six days and was the best of 61 frames, a reduction from the 71 frames played in previous years. The 7 included three competitors new to the event: Fred Davis, Walter Donaldson and Sydney Lee. The handicap system was the same as the previous year, each match having a separate handicap.", "Joe Davis gave Sidney Smith 20, Alec Brown 25, Walter Donaldson 25, Fred Davis 30, Tom Newman 40 and Sydney Lee 45. Sidney Smith played level with Alec Brown and gave Walter Donaldson 10, Fred Davis 15, Tom Newman 20 and Sydney Lee 30. Alec Brown played level with Walter Donaldson and gave Fred Davis 10, Tom Newman 10 and Sydney Lee 25. Walter Donaldson played level with Fred Davis 15 and gave Tom Newman 10 and Sydney Lee 20. Fred Davis gave Tom Newman 10 and Sydney Lee 25. Tom Newman gave Sydney Lee 15.", "Joe Davis struggled with the harsh handicaps given against him and lost his first three matches. He then had a remarkable win against Sydney Lee . Conceding 45 points in every frame, Davis was 16–14 behind after three days play. He then won 16 of the 20 frames on the next two days to lead 30–20 and eventually won 35–26. Joe lost to brother Fred but won his last match against Sidney Smith. With a 20-point advantage, Smith led 29–26 but Davis won the first 5 frames of the final evening session to win the match and avoid the \"wooden spoon\".", "| align=left|Sydney Lee || 37–24 || align=left|Sidney Smith || 6–11 November || Thurston's Hall, London", "| align=left|Fred Davis || 31–30 || align=left|Sydney Lee || 11–16 December || Thurston's Hall, London", "| align=left|Sydney Lee || 39–22 || align=left|Walter Donaldson || 1–6 January || Burroughes Hall, London", "| align=left|Joe Davis || 35–26 || align=left|Sydney Lee || 8–13 January || Thurston's Hall, London", "| align=left|Sydney Lee || 37–24 || align=left|Tom Newman || 22–27 January || Thurston's Hall, London", "| align=left|Sydney Lee || 37–24 || align=left|Alec Brown || 29 January–3 February || Hayes, Middlesex", "| 2 || style=\"text-align:left;\"| Sydney Lee || 6 || 4 || 206"]}, {"page": "Sidney Lee (snooker player)", "response": ["#REDIRECT Sydney Lee (snooker player)"]}, {"page": "1948 Sunday Empire News Tournament", "response": ["The qualifying tournament was played from 30 August to 2 October 1948. These matches were also played at Leicester Square Hall in London but each match only lasted three days and was the best of 35 frames. 5 players competed with the winner advancing to the final stages, The 5 players were: John Barrie, Albert Brown, Kingsley Kennerley, Sydney Lee and John Pulman. Players received points handicaps and sealed frame handicaps in the same way as in the main event. John Pulman won the qualifying with 6 points from his 4 matches ahead of Kingsley Kennerley with 5 points. Sydney Lee needed to win the last match against Albert Brown but he lost 22–15. Lee had beaten Pulman in the first match of the tournament. Lee received a 5-point lead in each frame but Pulman had won the match 18–17. Lee, however, had been given 2 frames in the sealed handicap to win 19–18."]}, {"page": "1951/1952 News of the World Snooker Tournament", "response": ["With the main event starting earlier than in previous years, the qualifying tournament was also earlier and was held from 28 May to 16 June 1951. These matches were also played at Leicester Square Hall in London. There were 3 competitors: John Barrie, Kingsley Kennerley and Sydney Lee. Unlike the main event, each match lasted six  days and was the best of 73 frames. Barrie won both his matches to qualify. Kennerley beat Lee in the other match."]}, {"page": "1954/1955 News of the World Snooker Tournament", "response": ["The qualifying tournament was held from 6 to 15 May 1954. These matches were also played at Leicester Square Hall in London. There were 3 competitors: Kingsley Kennerley, Sydney Lee and Harry Stokes. Like the main event, each match lasted three days and was the best of 37 frames. Kennerley won both his matches to qualify. Stokes beat Lee in the other match."]}, {"page": "1950/1951 News of the World Snooker Tournament", "response": ["The qualifying tournament was played from 18 September to 7 October 1950. These matches were also played at Leicester Square Hall in London. As in the main event, each match lasted three days and was the best of 37 frames. There were 4 competitors: John Barrie, Alec Brown, Kingsley Kennerley and Sydney Lee. John Barrie and Alec Brown each won their first two matches which meant that the final match, between the two, would decide the winner. Alec Brown won a close match 19–18. Kingsley Kennerley had beaten Sydney Lee 21–16 in their final match."]}, {"page": "1953/1954 News of the World Snooker Tournament", "response": ["The qualifying tournament was played from 25 May to 13 June 1953. These matches were also played at Leicester Square Hall in London. There were 3 competitors: Sydney Lee, Jim Lees and Rex Williams. Matches were over 71 frames, except that there was no play in the match between Lee and Williams on 2 June, the day of the Coronation of Elizabeth II, and the match was reduced to 59 frames. The qualifying was won by Rex Williams who advanced to the main event.", "| align=left|Rex Williams || 40–19 || align=left|Sydney Lee || 1 – 6 June|| ", "| align=left|Sydney Lee || 41–30 || align=left|Jim Lees || 8 – 13 June || "]}, {"page": "Harry Stokes (snooker player)", "response": ["Stokes rarely entered the major English snooker tournaments but played in the 1954 World Professional Match-play Championship where he lost at the quarter-final stage to Fred Davis. He entered again in 1955 but lost to Jackie Rea. He also entered the 1954/1955 News of the World Snooker Tournament, playing in the qualifying stage in May 1954. Stokes beat Sydney Lee but lost to Kingsley Kennerley and didn't qualify for the main event."]}, {"page": "1970 Pot Black", "response": ["Broadcasts were on BBC2, starting with an introductory programme at 9:45 pm on Monday 23 March 1970. This year, the tournament moved to a round-robin format with two groups of four players, the top two players from each group qualifying for a place in the semi-finals. Alan Weeks took over as presenter, with Ted Lowe remaining as commentator and Sydney Lee as referee."]}, {"page": "1971 Pot Black", "response": ["Broadcasts were on BBC2, starting with an introductory programme at 9:45 pm on Wednesday 17 February 1971 The tournament again used a round-robin format with two groups of four players, the top two from each group qualifying for a place in the semi-finals. The players in this event were mainly the same as the previous two, but Ray Reardon was replaced by David Taylor who was making his television debut. Alan Weeks presented the programme, with Ted Lowe as commentator and Sydney Lee as referee."]}, {"page": "1972 Pot Black", "response": ["Broadcasts were on BBC2 and started at 21:00 on Wednesday 12 April 1972 The tournament this year was reduced to 6 players. There was a qualifying stage in which each competitor played three matches. The leading four then played in a round-robin group with the top two players qualifying for the final. Alan Weeks presented the programme with Ted Lowe as commentator and Sydney Lee as referee."]}, {"page": "1973 Pot Black", "response": ["Broadcasts were on BBC2 and started at 21:00 on Tuesday 13 February 1973 The tournament this year was reverted to 8 players. The three ex-winners were in a Pot Black Champions group while the remaining five players were in a League of Champions group. The top two from each group qualified for the semi-finals. Alan Weeks presented the programme with Ted Lowe as commentator and Sydney Lee as referee."]}, {"page": "1974 Pot Black", "response": ["Broadcasts were on BBC2 and started at 21:00 on Tuesday 5 February 1974  Alan Weeks presented the programme with Ted Lowe as commentator and Sydney Lee as referee."]}, {"page": "1975 Pot Black", "response": ["Broadcasts were on BBC2 and started at 19:50 on Saturday 4 January 1975  Alan Weeks presented the programme with Ted Lowe as commentator and Sydney Lee as referee."]}, {"page": "1976 Pot Black", "response": ["Broadcasts were on BBC2 and started at 21:00 on Friday 21 May 1976  Alan Weeks presented the programme with Ted Lowe as commentator and Sydney Lee as referee."]}, {"page": "1977 Pot Black", "response": ["Broadcasts were on BBC2 and started at 21:00 on Friday 7 January 1977  Alan Weeks presented the programme with Ted Lowe as commentator and Sydney Lee as referee."]}, {"page": "1978 Pot Black", "response": ["Broadcasts were on BBC2 and started at 21:00 on Friday 6 January 1978  Alan Weeks presented the programme with Ted Lowe as commentator and Sydney Lee as referee."]}, {"page": "1979 Pot Black", "response": ["Broadcasts were on BBC2 and started at 21:00 on Friday 29 December 1978 Alan Weeks presented the programme with Ted Lowe as commentator and Sydney Lee as referee."]}, {"page": "1980 Pot Black", "response": ["Broadcast on BBC2, the programmes started at 21:00 on Friday 4 January 1980. Alan Weeks presented the programme with Ted Lowe as commentator and Sydney Lee as referee."]}, {"page": "1981 Pot Black", "response": ["Broadcasts were on BBC2 and started at 21:00 on Tuesday 30 December 1980  Alan Weeks presented the programme with Ted Lowe as commentator and top referee John Williams replaced Sydney Lee after 13 years after Lee retired to ill health."]}, {"page": "Sydney Lee", "response": ["Sydney Lee may refer to:", "* Sydney Lee (engraver) (1866–1949), British wood engraver", "* Sydney Lee (snooker player) (1911–1986), English billiards and snooker player"]}, {"page": "List of players to appear in the World Snooker Championship", "response": ["| align=\"left\" data-sort-value=\"Lee, Sydney\"| Sydney Lee"]}, {"page": "British Junior English Billiards Championship", "response": ["| 1925 Apr || Sydney Lee || 700- || George Cooper || ", "| 1925 Dec || Reggie Gartland ||  || Sydney Lee || "]}]}}