{"wiki_id": "http://www.wikidata.org/entity/Q22087124", "itemLabel": "David Melville", "itemDescription": "British clergyman", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Melville_(priest)", "wikipedia_page": {"main": "David Melville, DD (5 February 1813 – 8 March 1904) was a Church of England priest and university administrator.\nEducated initially at Shrewsbury School, he was subsequently awarded a scholarship to Brasenose College, Oxford, where after graduating he was ordained as a clergyman. He became a University don, and one of his scholars was William Ward, 1st Earl of Dudley. In 1846 he left Oxford and moved to Durham where he founded Bishop Hatfield's Hall. He was Canon of Worcester Cathedral until he resigned in late 1902.He married Emma Hill at Kilcoo, County Down on 28 July 1848.", "link_mentions": [{"page": "Hatfield College, Durham", "response": ["Hatfield College is one of the constituent colleges of Durham University in England. It occupies a city centre site above the River Wear on the World Heritage Site peninsula, lying adjacent to North Bailey and only a short distance from Durham Cathedral. Taking its name from a medieval Prince-Bishop of Durham, the college was founded in 1846 as Bishop Hatfield's Hall by David Melville, a former Oxford don.", "The establishment of the college in 1846 as a furnished and catered residence with set fees was a revolutionary idea, but later became the general standard for university accommodation in the modern sense: an \"arrangement where students would be provided with furnished rooms and meals for a flat fee\". Previously, university students were expected to furnish their rooms themselves. This concept came from the young founding master, David Melville, who believed his model would make a university education more affordable.  Essentially, the three principles were that rooms would be furnished and let out to students with shared servants, meals would be provided and eaten in the college hall, and college battels (bills) were set in advance. This system made Hatfield a more economical choice when compared to University College, whose students were generally wealthier, and ensured that student numbers at Hatfield built up steadily. Melville's model was introduced to the wider university after an endorsement from the Royal Commission of 1862.", "At the west end of the dining room is Kitchen Block, which features the main kitchens as well as a small number of student rooms and offices on the higher floors. 'C Stairs', holding the C accommodation block, was officially opened in 1932 by Lord Halifax. It replaced an earlier section of the coaching inn used since the founding of the college. Designed by Anthony Salvin, A & B Stairs – also used for undergraduate housing – was completed in 1849 at a cost of £4,000, and was the first purpose-built part of the college. Containing A and B accommodation blocks, it was renamed and rededicated as the Melville Building in 2005 after a £1million refurbishment. Author Josceline Dimbleby, the great-great-granddaughter of David Melville, was invited to perform the ceremony. ", "* David Melville (1846–1851)Dimbleby, 2004, p. 33"]}, {"page": "David Melville", "response": ["David Melville may refer to:", "* David Melville (academic) (born 1944), British physicist and former vice-chancellor of the University of Kent", "* David Melville, 3rd Earl of Leven or David Leslie (1660–1728), Scottish aristocrat", "* David Melville, 6th Earl of Leven or David Leslie (1722–1802), Scottish aristocrat and Freemason", "* David Melville (inventor) (1773–1856), American inventor", "* David Melville, minister and candidate in the United States House of Representatives elections in Louisiana, 2010", "* David Melville (priest) (1813–1904), British priest and academic", "* David Melville (footballer), Scottish footballer"]}, {"page": "Bishop Cosin's Hall", "response": ["In 1846, David Melville opened Bishop Hatfield's Hall, initiating the pioneering practice of letting rooms furnished and serving food communally at a fixed price. This was intended to make university attendance far more accessible to students of limited means, compared to University College and the colleges of Oxford and Cambridge, where students were expected to furnish their own rooms and to engage servants to prepare their food."]}]}}