{"wiki_id": "http://www.wikidata.org/entity/Q22020051", "itemLabel": "Richard Godson", "itemDescription": "politician (1797–1849)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Godson", "wikipedia_page": {"main": "Richard Godson (1797–1849) was an English barrister and politician. He was member of Parliament for St Albans in 1831–32 and then Kidderminster 1832–34 and 1837–1849. His father was William Godson of Worcester who died in 1822. His brothers were Septimus Holmes Godson, barrister, and Stephen Godson, attorney. Godson's relationship with Kidderminster began when he defended carpet-weavers on trial there in 1830. In 1835, following the abolition of slavery, Godson received compensation for enslaved persons associated with the Pusey Hall Estate in Jamaica. He had declared this \"embarrassment\" openly while campaigning, during which time he supported both the First Reform Bill and emancipation.", "link_mentions": [{"page": "St Albans (UK Parliament constituency)", "response": ["| Richard Godson"]}, {"page": "Kidderminster (UK Parliament constituency)", "response": ["| Richard Godson \t", "| rowspan=2| Richard Godson \t"]}, {"page": "Joseph Clinton Robertson", "response": ["Another bill by Richard Godson and Benjamin Rotch, of 1833, was disliked by Robertson. He himself gave evidence before the Ewart Committee of 1835 on industrial design, and the House of Commons committee on patent law in 1849."]}, {"page": "List of United Kingdom by-elections (1847–1857)", "response": ["|Richard Godson"]}, {"page": "List of MPs elected in the 1831 United Kingdom general election", "response": ["|Richard Godson|| Whig"]}, {"page": "Septimus Holmes Godson", "response": ["Septimus Holmes Godson (1799-1877) was a British barrister who was called to the bar at Gray's Inn in 1837.\"Barristers Called. Michaelmas Term, 1837.\" The Legal Observer, Vol. XV, No. 438, p. 170. He was the youngest son of William Godson who died in 1822.Attested copy of the will of William Godson of Tenbury (Worcs). National Archives. Retrieved 26 December 2015. His brother was Richard Godson (1797-1849) who was member of Parliament for St Albans in 1831-32 and then Kidderminster 1832-34 and 1837–1849.GODSON, Richard (1797-1849). History of Parliament. Retrieved 26 December 2015."]}, {"page": "William Godson", "response": ["His wife was Margaret Probyn (1766–1832). His son Richard Godson (1797-1849) was member of Parliament for St Albans in 1831-32 and then Kidderminster 1832-34 and 1837-1849.GODSON, Richard (1797-1849). History of Parliament. Retrieved 26 December 2015. His son, Septimus Holmes Godson (1799-1877), was a British barrister who was called to the bar at Gray's Inn in 1837.\"Barristers Called. Michaelmas Term, 1837.\" The Legal Observer, Vol. XV, No. 438, p. 170. His son Stephen practised as an attorney at Worcester and died 9 June 1839."]}, {"page": "Godson (surname)", "response": ["* Richard Godson, member of Parliament for Kidderminster, England"]}, {"page": "Godson, Richard", "response": ["#redirectRichard Godson"]}]}}