{"wiki_id": "http://www.wikidata.org/entity/Q22087291", "itemLabel": "Michael Redhead", "itemDescription": "British academic (1929-2020)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Redhead", "wikipedia_page": {"main": "Michael Logan Gonne Redhead  (30 December 1929 – 31 August 2020) was a British academic and philosopher of physics.", "link_mentions": [{"page": "Lakatos Award", "response": [":1988 – Michael Redhead for Incompleteness, Nonlocality and Realism"]}, {"page": "List of philosophers born in the 20th century", "response": ["* Michael Redhead (1929-2020)"]}, {"page": "Tarner Lectures", "response": ["| 1994 || Professor Michael Redhead || From physics to metaphysics"]}, {"page": "Centre for Philosophy of Natural and Social Science", "response": ["* Michael Redhead (Co-Director)"]}, {"page": "Structuralism (philosophy of science)", "response": ["Structuralism asserts that all aspects of reality are best understood in terms of empirical scientific constructs of entities and their relations, rather than in terms of concrete entities in themselves. For instance, the concept of matter should be interpreted not as an absolute property of nature in itself, but instead of how scientifically-grounded mathematical relations describe how the concept of matter interacts with other properties, whether that be in a broad sense such as the gravitational fields that mass produces or more empirically as how matter interacts with sense systems of the body to produce sensations such as weight. Its aim is to comprise all important aspects of an empirical theory in one formal framework. The proponents of this meta-theoretic theory are Bas van Fraassen, Frederick Suppe, Patrick Suppes, Ronald Giere,Alisa Bokulich, Peter Bokulich (eds.), Scientific Structuralism, Springer, p. 140 n. 52. Joseph D. Sneed, Wolfgang Stegmüller, , Wolfgang Balzer, John Worrall, Elie Georges Zahar, Pablo Lorenzano, Otávio Bueno, Anjan Chakravartty, Tian Yu Cao, Steven French, and Michael Redhead."]}, {"page": "Simon Saunders", "response": ["Saunders was an early graduate of the Physics and Philosophy undergraduate degree at the University of Oxford. He then studied the part III Mathematics Tripos at Christ's College, Cambridge under Martin Rees, John Polkinghorne, and Peter Goddard, and completed his PhD at King's College, London in 1989 under the supervision of Michael Redhead. His thesis title was ‘Mathematical and Philosophical Foundations of Quantum Field Theory’."]}, {"page": "Redhead, Michael", "response": ["#redirectMichael Redhead"]}, {"page": "Deaths in August 2020", "response": ["*Michael Redhead, 90, British philosopher of science.Redhead"]}, {"page": "Subtle is the Lord", "response": ["In a 1984 review of the book, Michael Redhead wrote that there had been \"many biographies of Einstein but none of them can even begin to compete with the work of Pais.\" He praised the book for its completeness, stating that it goes much further than previous works in discussing Einstein's contributions as a whole. Redhead noted one \"significant omission\", relating to Erich Kretschmann's critique of universal covariance, but went on to close the review by writing \"I wholeheartedly recommend anyone interested in the history of modern physics to read Pais's extraordinarily able book\". In a second 1984 review, Martin J. Klein wrote that the book is \"rich and rewarding\" and that it \"is written in a lively and effective style\". Felix Gilbert, in a third 1984 review, wrote that the book is \"both sensitive and thorough\" and that he is \"inclined to regard\" it as Einstein's \"definitive biography\". The book was also reviewed in French the same year by Jean Largeault. Among other 1984 reviews, one stated that it was a \"monumental biography\" and that it \"does full justice to the title, the Science and the Life of Einstein\" that was written with \"tremendous erudition and sensibility\". A 1986 review of the book stated that the \"book, despite its blindspots, shortcomings, and difficulties for the uninitiated reader, will remain an indispensable source for anyone interested\" in Einstein's life."]}]}}