{"wiki_id": "http://www.wikidata.org/entity/Q220552", "itemLabel": "Andy Wallace", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Andy_Wallace_(racing_driver)", "wikipedia_page": {"main": "Andy Wallace (born 19 February 1961, in Oxford, England) is a professional racing car driver from the United Kingdom, who has been racing since 1979. In 1976, Wallace attended the Jim Russell Racing Drivers' School. He is the current official  Bugatti test driver. He has raced prototype sports cars since 1988, winning over 25 International Sports car races including:\n\n24 Hours of Le Mans\n24 Hours of Daytona (3 times)\n12 Hours of Sebring (2 times)\nPetit Le Mans 1,000 miles (1,600 km).Wallace was also the driver for the then record-setting speed of 386.4 km/h (240.1 mph) in a McLaren F1, which for over 11 years was the world record for the fastest production car. According to the Autosport's Le Mans supplement, he liked the place so much that he became resident there.Wallace drove for Dyson Racing in the American Le Mans Series through the 2007 racing season.\nIn January 2008 Wallace drove for Alex Job Racing in the #23 Porsche-powered Daytona Prototype backed by Ruby Tuesday in the 24 Hours of Daytona, finishing in 36th place with engine problems.\nOn 2 August 2019, Wallace set a record of 300 mph in a hypercar. It was revealed by Top Gear on 2 September in a Youtube video, showing a certified speed of 490.48 km/h (304.77 mph) in a modified Bugatti Chiron and happened on the Ehra-Lessien test track owned by VW.", "link_mentions": [{"page": "Le Mans", "response": ["* Andy Wallace, born 1961, racecar driver."]}, {"page": "Dale Earnhardt Jr.", "response": ["|  Andy Wallace Tony Stewart"]}, {"page": "McLaren F1", "response": ["On 31 March 1998, Andy Wallace drove the five-year-old XP5 prototype at Volkswagen's test track in Ehra-Lessien, setting a new production car world record. The record consisted of an independently measured  two-way average (peak speed  measured by McLaren) with the rev-limiter raised to 8,300 rpm.", "While McLaren has never claimed specific acceleration figures for the LM, Motor Trend recorded traction-limited times of 0–60 mph in 3.9 seconds and 0–100 mph in 6.7 seconds. The LM was once the holder of the 0–100–0 mph record, which it completed in 11.5 seconds when driven by Andy Wallace at the disused airbase RAF Alconbury in Cambridgeshire."]}, {"page": "Tony Stewart", "response": ["In January 2004, Stewart teamed with Andy Wallace and Dale Earnhardt Jr. in a Boss Motorsports Chevrolet to take fourth in the 24 Hours of Daytona sports car endurance race. The result does not show the trio's performance, however. They had dominated the race until the last two hours when the suspension cracked. With 15 minutes left in the race and Stewart driving, one of the rear wheels came off, finally ending their run. In addition to placing fourth overall, the trio placed third in the Daytona Prototype class.", "*2004: Competed for the second time in the Rolex 24 on 1/31-2/1 for Howard-Boss Motorsports with co-drivers Dale Earnhardt Jr., and Andy Wallace. Team led 355 of 526 laps and had a commanding five-lap advantage before mechanical problems less than 20 minutes short of the finish ended their shot at victory and placed them a disappointing fourth.", "*2005: Competed for the third time in the Rolex 24 on 2/5-2/6 for Howard-Boss Motorsports with co-drivers Jan Lammars and Andy Wallace. Team was leading with less than two hours remaining when a broken gearbox dropped them off the lead lap. Crew was able to make repairs so that the trio could rejoin the race, whereupon they finished third. It was Stewart's first podium finish in the Rolex 24 Hours At Daytona.", "*2006: Competed for the fourth time in the Rolex 24 on 1/28-1/29 for Howard-Boss Motorsports with co-drivers Butch Leitzinger and Andy Wallace. Team finished 30th after suffering mechanical problems throughout the event.", "*2007: Competed for the fifth time in the Rolex 24 on 1/27-1/28 for Howard-Boss Motorsports with co-drivers Butch Leitzinger and Andy Wallace. Team finished 48th after mechanical trouble hampered the trio throughout the event."]}, {"page": "Silverstone Circuit", "response": ["The weekend of 19/20 May 1990 was a busy one at Silverstone, for on the Saturday, a round of the FIA F3000 Championship was run on the Grand Prix circuit, and on the Sunday the contenders in the World Sports-Prototype Championship had their turn. In the F3000 race, Scotland's Allan McNish led Érik Comas home from Marco Apicella. The first two were Lola-Mugen T90/50 mounted, while the third-placed car was a Reynard-Mugen 90D. The sports cars again ran over 300 miles, contesting the Shell BRDC Empire Trophy. The first three places went to British cars, with Jaguar first and second from a Spice-Cosworth in the hands of Fermín Vélez and Bruno Giacomelli. The winning Jaguar XJR11 of Martin Brundle and Michel Ferté was the only to run the full distance of 101 laps, lapping even the second-placed XJR11 of Jan Lammers and Andy Wallace.", "On 12 May 1996, the Northamptonshire circuit hosted a round of the International BPR series which was very a British affair. First was the McLaren F1 GTR of Andy Wallace and Olivier Grouillard followed by the Jan Lammers/Perry McCarthy Lotus Esprit and another McLaren in the hands of James Weaver and Ray Bellm."]}, {"page": "24 Hours of Daytona", "response": ["|  Andy Wallace || 1990, 1997, 1999", "|  Davy Jones Jan Lammers Andy Wallace", "|  Rob Dyson James Weaver Butch Leitzinger Andy Wallace John Paul Jr. Elliott Forbes-Robinson John Schneider", "|  Elliott Forbes-Robinson Butch Leitzinger Andy Wallace"]}, {"page": "12 Hours of Sebring", "response": ["|  Andy Wallace", "|  Juan Manuel Fangio II Andy Wallace"]}]}}