{"wiki_id": "http://www.wikidata.org/entity/Q2201855", "itemLabel": "John Melhuish Strudwick", "itemDescription": "painter (1849-1937)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Melhuish_Strudwick", "wikipedia_page": {"main": "John Melhuish Strudwick (6 May 1849 in Clapham, London – 16 July 1937 in Hammersmith), was an English Pre-Raphaelite painter, the son of William Strudwick (1808–1861) and Sarah Melhuish (1800–1862).", "link_mentions": [{"page": "Scylla", "response": ["Peter Paul Rubens shows the moment when the horrified Scylla first begins to change, under the gaze of Glaucus (c.1636),Musée Bonat, available in at Wikimedia while Eglon van der Neer's 1695 painting in the Rijksmuseum shows Circe poisoning the water as Scylla prepares to bathe. There are also two Pre-Raphaelite treatments of the latter scene by John Melhuish Strudwick (1886)View on Wikimedia and John William Waterhouse (Circe Invidiosa, 1892).Available on the website devoted to the artist"]}, {"page": "Edward Burne-Jones", "response": ["Three of Burne-Jones's studio assistants, John Melhuish Strudwick, T. M. Rooke and Charles Fairfax Murray, went on to successful painting careers. Murray later became an important collector and respected art dealer. Between 1903 and 1907 he sold a great many works by Burne-Jones and the Pre-Raphaelites to the Birmingham Museum and Art Gallery, at far below their market worth. Birmingham Museum and Art Gallery now has the largest collection of works by Burne-Jones in the world, including the massive watercolour Star of Bethlehem, commissioned for the Gallery in 1897. The paintings are believed by some to have influenced the young J. R. R. Tolkien, then growing up in Birmingham."]}, {"page": "George Frederick Bodley", "response": ["As well as being an architect, he was a draughtsman, a connoisseur of art, published a volume of poems in 1899, inspired art works by painters such as John Melhuish Strudwick and designed wallpaper and chintzes for Watts & Co. He served as prime warden of the Fishmongers' Company in 1901–02. In early life he had been in close alliance with the Pre-Raphaelites, and he did a great deal to improve public taste in domestic decoration and furniture."]}, {"page": "St Paul's Girls' School", "response": ["*Ethel Strudwick (1880–1954), High Mistress 1927–1948, daughter of the Pre-Raphaelite painter John Melhuish Strudwick"]}, {"page": "West Kensington", "response": ["*John Melhuish Strudwick, Pre-Raphaelite painter, resided at Edith Villas during the 1880s and into the 1890s."]}, {"page": "St Saviour's Grammar School", "response": ["*John Melhuish Strudwick (1849-1937) – Pre-Raphaelite painter"]}]}}