{"wiki_id": "http://www.wikidata.org/entity/Q22098179", "itemLabel": "Jason Rowland", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jason_Rowland", "wikipedia_page": {"main": "Jason Rowland (born 6 August 1970) is a British former boxer who was British light welterweight champion between 1998 and 2000, and WBU light welterweight World champion in 2000.", "link_mentions": [{"page": "Ricky Hatton", "response": ["|style=\"text-align:left;\"|Jason Rowland"]}, {"page": "Jon Thaxton", "response": ["In November 1999, he fought Jason Rowland for the British light-welterweight title, losing when the fight was stopped in the fifth. In October 2000, he had another shot at the now vacant British light-welterweight title when he fought Ricky Hatton. Despite Hatton being cut badly in the first round, he went on to defeat Thaxton on points. In February 2002, he fought Eamonn Magee for the Commonwealth light-welterweight title, losing when the fight was stopped in the sixth.", "|align=left| Jason Rowland"]}, {"page": "Rowland (surname)", "response": ["*Jason Rowland (born 1970), British boxer"]}, {"page": "Mark Kaylor", "response": ["Kaylor worked with Peck again in 1996, this time in a semi-improvised, fictional film  Real Money, about a group of young boxers getting drawn into underworld villainy and crime. Real Money also starred other well known and well respected faces from the boxing world, such as father and son boxing legends Jimmy Tibbs and Mark Tibbs, Steve Roberts and Jason Rowland. boxer, writer and actor Jimmy Flint who had also starred in many of Ron Peck's films, and later went on to star in many films such as Lock Stock and Two Smoking Barrels, Revolver and Rise of The Footsoldier."]}, {"page": "List of British super-lightweight boxing champions", "response": ["|align=left | Jason Rowland"]}, {"page": "Mark Winters", "response": ["Winters made his professional debut in March 1995 with a win over Trevor Smith. After winning his first 11 fights he became British light welterweight champion in October 1997 after beating Carl Wright on points at the Sheffield Arena.Mee, Bob (2001) \"Talking Boxing: Boxing remains a funny old game\", Daily Telegraph, 13 December 2001. Retrieved 2 January 2016Calzaghe, Joe (2008) No Ordinary Joe, Arrow, , p. 137 Wright required surgery after the fight due to a blood clot on the brain, but later recovered.\"Boxing's Deadly Toll\", BBC, 5 May 1998. Retrieved 2 January 2016 Winters successfully defended the title in February 1998 against Bernard Paul,Kilfeather, Sean (1998) \"Winters to defend title in Belfast\", Irish Times, 4 February 1998. Retrieved 2 January 2016 but lost it three months later when he was beaten on points by Jason Rowland, the first defeat of Winters' career."]}]}}