{"wiki_id": "http://www.wikidata.org/entity/Q22018963", "itemLabel": "Joe Mercer", "itemDescription": "association football player (1889-1927)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Mercer_(footballer,_born_1889)", "wikipedia_page": {"main": "Joseph Powell Mercer (21 July 1889 – 1927) was an English professional footballer who made 150 appearances in the Football League for Nottingham Forest as a centre half. He was the father of footballer and manager Joe Mercer.", "link_mentions": [{"page": "Joe Mercer", "response": ["Mercer was born in Ellesmere Port, Cheshire, the son of a former Nottingham Forest and Tranmere Rovers footballer, also named Joe.http://www.roydenhistory.co.uk/eportwarmemorial/pows/mercer_joe/joemercer.pdf  Joe Mercer senior died following health problems resulting from a gas attack during the Great War when his son was only 12.", "Joe Mercer, a left-half, first played for Ellesmere Port Town. He was a powerful tackler and good at anticipating an opponent's moves. He joined Everton in September 1932 at the age of 18 and claimed a regular first team place in the 1935–36 season. Mercer made 186 appearances for Everton, scoring two goals and a winning a League Championship medal in the 1938–39 season. While playing for Everton he gained five England caps between 1938 and 1939.", "thumb|left|A mosaic in memory of Joe Mercer", "He is commemorated by his old club Manchester City with the road Joe Mercer Way at the City of Manchester Stadium being named after him. On the road there are two mosaics by renowned Manchester artist Mark Kennedy of Mercer; one shows his smiling face lifting the League Championship trophy; the other is a version of a famous photograph showing the back of him as he looks out over the Maine Road pitch towards the Kippax Stand. His contribution to City was commemorated in the Kippax tribute still sung at the Etihad Stadium to the tune of Auld Lang Syne: \"The Stretford End cried out aloud: 'It's the end of you Sky Blues.' Joe Mercer came. We played the game. We went to Rotherham United, we won 1–0 and we were back into Division One. We've won the League, we've won the Cup, we've been to Europe too. And when we win the League again we'll sing this song to you: City, City, City.\"", "At Maine Road a corporate suite, the Joe Mercer Suite, was officially opened by his widow Norah in 1993. A similar facility named after him exists at Goodison. In 1993 Mercer's official biography, Football with a Smile, was written by Gary James. This book sold out within six months and was revised and re-published early in 2010.", "Joe Mercer is also featured upon the mural that surrounds the Emirates Stadium."]}, {"page": "Joseph Mercer", "response": ["* Joe Mercer (1914–1990), English football player and manager", "* Joe Mercer (footballer, born 1889) (1889–1927), his father, English football centre half", "* Joe Mercer (jockey) (1934–2021), English jockey"]}, {"page": "Joseph Powell Mercer", "response": ["#REDIRECT Joe Mercer (footballer, born 1889)"]}]}}