{"wiki_id": "http://www.wikidata.org/entity/Q22005678", "itemLabel": "Jon Lansman", "itemDescription": "British politician (born 1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jon_Lansman", "wikipedia_page": {"main": "Jonathan Lansman (born 9 July 1957) is a British political activist. He is best known for having worked on Jeremy Corbyn's successful 2015 campaign for the leadership of the Labour Party and subsequently founded the pro-Corbyn organisation Momentum. He is a member of the Labour Party's National Executive Committee. Lansman has worked for both Tony Benn and Michael Meacher, and was a prominent supporter of Benn in the early 1980s.\n\n", "link_mentions": [{"page": "Labour Students", "response": ["Further to the disaffiliations by Labour university Clubs, a motion was tabled by Jon Lansman at the Labour Party NEC meeting in September 2019 to dissolve the current organisation on the grounds that it did not pay its affiliation fees nor submitted its political rules to the party. At the NEC meeting this motion passed and Labour Students is no longer affiliated to the Labour Party. This action was challenged by the incumbent Labour Students leadership, but they were unsuccessful."]}, {"page": "Robert Glenister", "response": ["*The Campaign (1983, TV Movie) as Jon Lansman"]}, {"page": "Labour Representation Committee (2004)", "response": ["* Jon Lansman", "* Jon Lansman (Labour CND)"]}, {"page": "Jewdas", "response": ["Jewdas' description of Israel as \"a steaming pile of sewage which needs to be properly disposed of\" on its Twitter feed was criticised by Jon Lansman, founder of the pro-Corbyn organisation Momentum, who said that the organisation's comments were \"not helpful to Jeremy or the cause of opposing antisemitism in the Labour Party\". "]}, {"page": "Ken Livingstone", "response": ["Over 20 Labour MPs called for Livingstone's suspension and newly elected Labour London Mayor Sadiq Khan called for his expulsion. Jon Lansman, founder of the pro-Corbyn Momentum group, called for Livingstone to leave politics altogether. Labour MP John Mann publicly confronted Livingstone and accused him of being a \"liar\" and a \"Nazi apologist\". In a subsequent interview, Livingstone expressed regret both for mentioning Hitler and for any Jews he may have offended but added that \"I'm not going to apologise for telling the truth\". He stated that it was \"absurd\" to call him an antisemite because he had had two former Jewish girlfriends, and that he may have maternal Jewish ancestry. Livingstone said there was a \"well-orchestrated campaign by the Israel lobby to smear anybody who criticises Israeli policy as antisemitic\"."]}, {"page": "Labour Party (UK)", "response": ["While affirming a commitment to democratic socialism, the new version of Clause IV no longer definitely commits the party to public ownership of industry and in its place advocates \"the enterprise of the market and the rigour of competition\" along with \"high quality public services [...] either owned by the public or accountable to them\". In more recent times, a limited number of MPs in the Socialist Campaign Group and the Labour Representation Committee have seen themselves as the standard bearers for the radical socialist tradition in contrast to the democratic socialist tradition represented by organisations such as Compass and the magazine Tribune. The group Progress, founded in 1996, represents the centrist position in the party and was opposed to the Corbyn leadership. In 2015, Momentum was created by Jon Lansman as a grass-roots left-wing organisation following Jeremy Corbyn's election as party leader. Rather than organising among the PLP, Momentum is a rank and file grouping with an estimated 40,000 members.Momentum: Corbyn-backing organisation now has 40,000 paying members, overtaking Green Party . The Independent. Author – Ashley Cowburn. Published 4 April 2018. Retrieved 11 April 2018. The party also has a Christian socialist faction within the Christians on the Left society.Thomas Kurian (ed). The Encyclopedia of Political Science CQ Press. Washington D.c. 2011. p. 1555Routledge, Paul (22 May 1994). \"Labour revives faith in Christian Socialism\". The Independent on Sunday. Archived from the original on 1 July 2018."]}, {"page": "List of alumni of Clare College, Cambridge", "response": ["*Jon Lansman, co-founder and chair of Momentum"]}, {"page": "Iain McNicol", "response": ["In May 2019, Jon Lansman the founder of Momentum writing in the LabourList blog accused McNicol and his team of delaying action on handling antisemitism cases while he was General Secretary, and allowing a backlog of cases to build up which would damage the party and Jeremy Corbyn's leadership."]}, {"page": "HowTheLightGetsIn Festival", "response": ["Speakers included philosopher of language Saul Kripke, Change UK MP Anna Soubry, cognitive psychologist Donald D. Hoffman, novelist Janne Teller, economist and writer Linda Yueh, and Momentum founder Jon Lansman. Donovan, Anna Calvi, and British Sea Power headlined the music programme, while the comedy line-up was led by Lou Sanders and Phil Wang."]}, {"page": "List of people associated with Birkbeck, University of London", "response": ["* Jon Lansman, Labour Party activist"]}, {"page": "Stop the War Coalition", "response": ["Murray told John Harris in an interview for The Guardian: \"It didn't represent the organisation's views on Paris, and I think it was ... well, the best one could say is, extremely insensitive.\" Jon Lansman, of the Corbynite Momentum pressure group, commented later about the material concerning the Paris attacks: \"I think even Stop the War themselves have accepted they were stupid for publishing those articles. There were some very silly things published, and wrong things.\""]}, {"page": "Salma Yaqoob", "response": ["Yaqoob's application was criticised in a leaked email written by Labour MP Naz Shah published in October 2019. In this Shah bitterly criticised Yaqoob, calling her \"despicable\", following the 2017 campaign in which Yaqoob stood against her, concluding: \"I believe she endorsed misogyny, patriarchy and biradri politics\". In a Guardian article, Yaqoob denied running such a campaign, but issued a statement stating that \"I did not run or endorse a campaign of misogyny, patriarchy and clan politics. Even as a political opponent I showed her respect as a woman and a public figure\". She also said: \"As shadow equalities and women minister, I would hope Naz Shah would welcome the principle of women coming forward for political office – even those she disagrees with. I am saddened that she is lobbying nationally to limit the right of local Labour members to make their own choice by seeking to remove me from even a potential shortlist.\" Yaqoob retained the support of Momentum head Jon Lansman, and was eventually endorsed by Momentum."]}, {"page": "Momentum (organisation)", "response": ["Momentum is a British left-wing political organisation which has been described as a grassroots movement supportive of the Labour Party; since January 2017, all Momentum members must be (or become) members of the party. It was founded in 2015 by Jon Lansman, Adam Klug, Emma Rees and James Schneider after Jeremy Corbyn's successful campaign to become Labour Party leader and it is reported to have between 20,000 and 30,000 members in 2021.", "Momentum was founded in 2015 by Jon Lansman and fellow national organisers Adam Klug, Emma Rees and James Schneider, four weeks after Jeremy Corbyn's successful campaign for the Labour Party leadership. Local groups formed to support Corbyn's leadership, uniting several factions of the left across Britain. Lansman was active in Tony Benn's 1981 deputy leadership bid and, after volunteering for Corbyn's leadership bid, had become the director of Jeremy Corbyn Campaign 2015 (Supporters) Ltd, which held the data collected during the campaign. In addition to their support of Corbyn, Momentum has three primary goals: to win elections for Labour, to create a socialist Labour government, and to help build a broader social movement. Corbyn was positive about Momentum after it was formed, saying in 2016: \"I see Momentum as a social movement. A movement that will campaign on all of these issues. But above all, excite and unite people to come together, to come together to challenge injustice, inequality and social exclusion. Bring people together to achieve things together. That is what is makes us [Labour] so different from every other political party in this country.\"", "After their defeat in the 2019 general election, in which Labour lost 60 seats, Jeremy Corbyn and Momentum national coordinator Laura Parker resigned. The election loss led Corbyn to call a leadership election, coupled with the deputy leadership election, with the results of both elections announced in April 2020. On 14 January 2020, Momentum ran a two-day online consultation with their members about endorsing Rebecca Long-Bailey for leader and Angela Rayner for deputy leader. The consultation's closed format was controversial. Of the 7,395 members participating, 70 percent supported Long-Bailey and 52 percent supported Rayner. Momentum planned hundreds of phone-banking events to support Long-Bailey. Keir Starmer won the election in the first round (with Long-Bailey receiving 28 percent of the vote), and Momentum failed to win any of the National Executive Committee by-elections. Momentum congratulated Starmer on his victory, and positioned themselves to work with the new leadership for \"transformational policies\". In May 2020, Momentum founder Jon Lansman announced that he would step down as chairman the following month.", "During the Corbyn years, Momentum was neutral about remaining in the European Union and supported the Labour Party position. Several Momentum members have supported a second referendum, however, with remaining and the government's deal as options. The People's Vote advocacy group, which included trade-union leaders and former Momentum members, was launched in April 2018. The group's launch statement was signed by TSSA union general secretary Manuel Cortes, economist Ann Pettifor, former Momentum steering group member Michael Chessum and former CWU general secretary Billy Hayes. A November 2018 poll of Momentum members found that a majority supported a second referendum. The left-wing, pro-European pressure group Another Europe Is Possible contains Momentum members such as former steering-committee member Michael Chessum. In March 2019, 188 Momentum activists sent an open letter to Jon Lansman supporting a second referendum.", "In 2017, the Labour Party began a democracy review which would give its membership greater voting capabilities. Momentum has advocated greater membership involvement in party decision-making and \"bolder reforms\", such as Labour members having a larger role in policy development. Momentum has pushed for lowering of the nomination threshold for Labour leadership candidates, so a left-wing successor to Corbyn could more easily contest a future election. Jon Lansman, however, called the proposed Labour reforms \"tinkering around the edges\".", "In 2017, Momentum and the Campaign for Socialism (their Scottish sister organisation) won five of the eight seats on the Scottish Labour executive committee. At that year's Labour conference, it was announced that the party would add three more member-elected positions on the NEC in response to a significant rise in membership. During the balloting period, Peter Willsman was removed from Momentum's list of recommended candidates after an allegation of antisemitism; Willsman had been recorded as describing some Jewish critics of Labour as \"Trump fanatics\". Three other Momentum-backed candidates were elected to the NEC: Jon Lansman, Yasmine Dar and Rachel Garnham."]}, {"page": "Imandeep Kaur", "response": ["In August 2019, Kaur spoke on a panel at left-wing political festival The World Transformed in Birmingham, billed alongside Jon Lansman, Keir Milburn, Huda Elmi and Grace Blakeley. The workshop and majority of the multi-day festival was held at Impact Hub Birmingham."]}, {"page": "Antisemitism in the UK Labour Party", "response": ["In May 2016, the vice-chair of Momentum, Jackie Walker, was investigated by the party over private comments she made on Facebook exaggerating the role of Jews in the Atlantic slave trade. Walker said her words had been taken out of context and no further action was taken following the investigation. Jon Lansman, the chair of Momentum, defended her, describing the media as \"a 'lynch mob' whose interest in combating racism is highly selective\". Following that year's Party Conference, at which Walker asked in a training session why Holocaust Memorial Day did not include pre-1940 genocides such as the Atlantic slave trade, she was removed from her Momentum position, while remaining on its steering committee, after Manuel Cortes, the general secretary of the TSSA union, said their funding would be reconsidered otherwise. Lansman called Walker's comments \"ill-informed, ill-judged and offensive\", but not antisemitic. The party suspended her from membership, pending investigation. Walker said that she \"utterly condemn[s] antisemitism\", that her words were taken out of context, and that \"I would never play down the significance of the Shoah. Working with many Jewish comrades, I continue to seek to bring greater awareness of other genocides, which are too often forgotten or minimised. If offence has been caused, it is the last thing I would want to do and I apologise.\" She was expelled from the party for misconduct in March 2019.", "Jennie Formby, the general secretary, said the code supplements the definition \"with additional examples and guidance\", creating \"the most thorough and expansive Code of Conduct on anti-Semitism introduced by any political party in the UK\". NEC member Jon Lansman said \"Clear and detailed guidelines are essential to ensure that antisemitism isn't tolerated, while protecting free speech on Israel's conduct, within a respectful and civil environment. This is what Labour's code of conduct provides.\"", "In May 2019, Labour National Executive Committee member Jon Lansman wrote that leaked emails \"...suggest that former compliance unit officials from the Labour right may have delayed action on some of the most extreme and high-profile antisemitism cases, including Holocaust denial, allowing a backlog of cases to build up that would damage the party and Jeremy's leadership.\" He also accused former General Secretary Iain McNicol and his team of delaying action on handling antisemitism cases, and allowing a backlog of cases to build up that would damage the party and Jeremy Corbyn's leadership.", "The Guardian said a \"series of individual MPs condemned the decision\" and  some did not consider Peake's allegations to be anti-semitic. John McDonnell, shadow chancellor under Jeremy Corbyn, said that \"criticism of practices of [the] Israeli state is not anti-semitic\". He did not believe that Long-Bailey should have been sacked and stood \"in solidarity\" with her. NEC member Jon Lansman said: \"I don't believe there is anything antisemitic in the [Maxine Peake] interview and sacking Rebecca is a reckless overreaction by Keir Starmer.\"", "In December 2017, Momentum founder Jon Lansman categorised antisemitism in the Labour Party into three forms: petty xenophobic remarks, of which he \"[doesn't] think there's much\" in the Party; old-school blood libel type antisemitism, which, according to Lansman, is \"extremely rare\"; and the Israeli–Palestinian conflict, whereby, Lansman says, \"we all understand that when that conflict heats up, it results in dreadful antisemitism. It shouldn't result in that, but it does\"."]}, {"page": "Jewish Voice for Labour", "response": ["The organisation has been described as controversial. The Jewish Labour Movement has called its views an \"extreme fringe\". Jewish Leadership Council chairman Jonathan Goldstein has said that JVL is \"not representative of our community\". Board of Deputies of British Jews President Marie van der Zyl has referred to JVL as \"a tiny organisation whose odious views are representative of no-one but themselves\". Jon Lansman, founder of Momentum, stated that JVL \"is an organisation which is not just tiny but has no real connection with the Jewish community at all\" and \"It doesn't represent the Jewish community in a way that JLM clearly does represent the Labour wing of the Jewish community.\" Luke Akehust, director of We Believe in Israel and secretary of Labour First, has called for JVL to be proscribed."]}, {"page": "Jennie Formby", "response": ["In February 2018, Formby announced she was a candidate to become General Secretary of the Labour Party, shortly after the incumbent, Iain McNicol, resigned. Her main rival, Jon Lansman, the chair of Momentum, dropped out of contention on 11 March, making Formby the frontrunner. On 20 March 2018, she was appointed to the role, effective from April 2018. She resigned on 4 May 2020, following the election of Keir Starmer as new Labour leader, saying \"now we have a new leadership team it is the right time to step down\". She was succeeded by David Evans."]}, {"page": "Christine Shawcroft", "response": ["A supporter of Jeremy Corbyn, and also of Jon Lansman, Shawcroft became a director of Momentum. In January 2018, she was elected as chair of the Labour Party's Disputes Sub-Committee, defeating Ann Black. ", "During the process to choose the next general secretary of the Labour Party in March 2018, following the resignation of Iain McNicol, Shawcroft was vocal in her support for Jon Lansman of Momentum over Jennie Formby of the Unite union, a contest which was proving divisive among supporters of Jeremy Corbyn.  She commented on Facebook: \"Nothing would induce me to support a candidate from a major trade union, they stick it to the rank and file members time after time after time. It’s also time to support disaffiliation of the unions from the Labour Party. The party belongs to us, the members\".  The comments, which were soon deleted, caused consternation among trade unionists and Momentum distanced itself from Shawcroft's statement."]}, {"page": "Jackie Walker (activist)", "response": ["Her private comments were \"uncovered\" by the Israel Advocacy Movement which, it says, aims \"to counter British hostility to Israel.\" The Jewish Chronicle published her comments on 4 May 2016 and notified the Labour Party about them. The Labour Party suspended her, pending investigation, on the same day that The Jewish Chronicle published its article. The Chair of Momentum, Jon Lansman, addressing the criticism of Walker, referred to \"a 'lynch mob' whose interest in combatting racism is highly selective\". The investigation and accompanying suspension concluded after a few weeks with the decision that not to proceed with disciplinary action."]}, {"page": "Timeline of antisemitism in the 21st century", "response": [":Livingstone was subsequently suspended from Labour Party membership \"for bringing the party into disrepute\". Over 20 Labour MPs called for Livingstone's suspension, while Jon Lansman, founder of the pro-Corbyn Momentum group, called for Livingstone to leave politics altogether, and Khan called for his expulsion from the party. In a subsequent interview, Livingstone expressed regret both for mentioning Hitler and for offending Jews but added that \"I'm not going to apologise for telling the truth.\" Corbyn announced that the decision to expel Livingstone would be made by a National Executive Committee internal inquiry, whilst Livingstone insisted that he would be exonerated on the basis of Brenner's book, saying \"how can the truth be an offence?\" Following this controversy, Livingstone has questioned whether or not he has Jewish ancestry on his mother's side stating that Greville Janner used to speculate whether or not he was Jewish because \"my grandmother's name was Zona.\""]}, {"page": "Change UK", "response": ["On 19 February 2019, Labour leader Jeremy Corbyn responded that he was \"disappointed\" by the actions of the MPs leaving Labour. Labour Shadow Chancellor John McDonnell said that Independent Group MPs had a \"responsibility\" to resign and fight by-elections, as they had been elected as Labour MPs and should seek the approval of the electorate for their new platform. Other Labour Party figures stressed reflection, with deputy leader Tom Watson imploring his party to change in order to stave off further defections. Jon Lansman, the founder of Momentum, said he had \"personal sympathy\" for Berger because of the \"hate and abuse\" she had suffered. However, the six other former Labour MPs were, in his opinion, malcontents opposed to Corbyn's leadership."]}, {"page": "Rank and File Mobilising Committee", "response": ["Tony Benn records the founding of the RMFC in his diary of 30 May 1980: \"Frances Morell rang to tell me about the Rank and File Mobilising Committee, which is working to get together the CLPD, LCC, Institute for Workers' Control, Independent Labour Publications and the Socialist Campaign for a Labour Victory, to agree on a programme of party democracy. In the evening we had a party, a sort of new left gathering, with Frances, Ken Livingstone of the GLC, Victor Schonfield, Audrey Wise, Tom Litterick, Chris Mullin, James Curran, a lecturer at PCL, his wife Margaret, George Osgerby, one of James's Students, Dick Clements and Biddy, Geoff Bish [then head of the Labour Party research department], Dawn Primarolo, Jon Lansman of CLPD, Peter Hain and others. These are the people who have formed the Rank and File Mobilising Committee and, when the time comes, they will be the people who organise the Benn election campaign.\"", "Jon Lansman, then secretary of the RFMC, set out the campaigning activities of the group in the early months of the campaign:\"All the organisations have buried the sectarian hatchets which have divided the campaign for party democracy in the past. Numerous CLPs have expressed their support already and many more will follow; but it has been much more than paper commitments. Throughout the country, party and trade union activists are meeting on their own initiatives to organise rallies, to distribute our broadsheet \"Mobilise for Labour Democracy\" and to ensure that motions are sent to conference on the democratic issues.\""]}, {"page": "Sam Tarry", "response": ["In 2016, Tarry worked as a director under Jon Lansman's supervision of Jeremy Corbyn's successful Labour Party leadership campaign."]}, {"page": "The work of the Labour Party's Governance and Legal Unit in relation to antisemitism, 2014–2019", "response": ["On 23 April, Labour's National Executive Committee held a meeting via Zoom to agree the terms of reference for the independent investigation into the circumstances, contents and release of an internal report to conclude with its own report being published by mid-July. Several amendments were passed by the NEC, including one moved by Rayner that referred to the offer of whistleblower protections. On 1 May, the NEC appointed a four-person panel to investigate the report on the party's handling of internal antisemitism complaints. Barrister Martin Forde QC was chosen by the NEC to chair the independent inquiry. He will be supported by three Labour peers: Baroness Debbie Wilcox, a councillor and former leader of Newport City Council; Lord Larry Whitty, a former Labour general secretary; and Baroness Ruth Lister, a social policy professor. Momentum chair and NEC member Jon Lansman proposed Alf Dubs as a panel member because there was no Jewish representation. However, this was voted down in the meeting, including by Keir Starmer with the stated reason that Dubs had vocally supported Starmer's leadership bid. An NEC member pointed out that Baroness Wilcox backed Starmer's leadership campaign; another NEC member, however, argued that Dubs was a higher-profile backer of the leader. Another factor considered was gender balance, particularly as the chair chosen is male. The vote on the proposal to include Dubs was lost 16–18 and there was a request during the meeting for it to voted on again after it was argued that Wilcox had vocally supported Starmer and Rosena Allin-Khan."]}]}}