{"wiki_id": "http://www.wikidata.org/entity/Q22087293", "itemLabel": "Renny Rye", "itemDescription": "British television producer and television director", "wikipedia_url": "https://en.wikipedia.org/wiki/Renny_Rye", "wikipedia_page": {"main": "Renny Rye (born 2 December 1947) is a British television director known for his work in television drama.", "link_mentions": [{"page": "Dennis Potter", "response": ["The last film Potter actively worked on was Midnight Movie (1994), an adaptation of Rosalind Ashe's novel Moths. The film starred Louise Germaine and Brian Dennehy (who had appeared respectively in Lipstick on Your Collar and Gorky Park) and was directed by Renny Rye. Unable to secure financing from the Arts Council, Potter invested £500,000 in the production; BBC Films provided the rest of the capital. The film was not given a cinema release owing to a lack of interest from distributors and remained unseen until after Potter's death. It was finally broadcast on BBC2 in December 1994 in the Screen Two series, two months after a remake of his lost 1967 play Message for Posterity was transmitted."]}, {"page": "Karaoke (TV series)", "response": ["It forms the first half of a pair with the serial Cold Lazarus. The two plays were filmed as a single production by the same team; both were directed by Renny Rye. The series was said to be inspired by Potter's working relationship with Louise Germaine."]}, {"page": "Cold Lazarus", "response": ["It forms the second half of a pair with the television serial Karaoke. The two serials were filmed as a single production by the same team; both were directed by Renny Rye and feature Albert Finney as the writer Daniel Feeld. The plays were unique in being co-productions between the BBC and Channel 4, something Potter had expressly requested before his death. The show was first aired on Channel 4 in 1996 on Sunday evenings, with a repeat on BBC1 the following day."]}, {"page": "Jason Connery", "response": ["| Renny Rye"]}, {"page": "The Box of Delights", "response": ["A BBC TV adaptation of The Box of Delights was broadcast in six parts between 21 November and 24 December in 1984. It starred Devin Stanfield, Patrick Troughton and Robert Stephens as Kay Harker, Cole Hawlings and Abner Brown respectively and adapted for television by Alan Seymour, directed by Renny Rye and produced by Paul Stone."]}, {"page": "Patrick Doyle", "response": ["|Renny Rye"]}, {"page": "Murder in the Mews", "response": ["Director: Renny Rye"]}, {"page": "Clare Douglas", "response": ["*Karaoke (Renny Rye-1996)", "*Cold Lazarus (Renny Rye-1996)", "*Midnight Movie (Renny Rye-1994)", "*Lipstick on Your Collar (Renny Rye-1993)"]}, {"page": "List of Elstree Studios productions", "response": ["| Big Woman || Drama || Bandung Productions, Channel 4 || 1 || 4 || 1998 || Renny Rye || Anastasia Hille, Daniela Nardini, Fidelis Morgan, Annabelle Apsion, Kelle Spry, Jayne Ashbourne", "| Oliver Twist || Drama || Diplomat Films, HTV, United || 1 || 4 || 1999 || Renny Rye || Annette Crosbie, Marc Warren, Michael Kitchen, Lindsay Duncan, Julie Walters, David Ross"]}, {"page": "The Box of Delights (TV series)", "response": ["The Box of Delights is a BBC Television adaptation of John Masefield's 1935 children's fantasy novel The Box of Delights starring Devin Stanfield, Patrick Troughton and Robert Stephens. It was broadcast on BBC1 between 21 November and 24 December 1984. The series was adapted from Masefield's novel by Alan Seymour, directed by Renny Rye and produced by Paul Stone.", "Director Renny Rye was at that time on staff in the BBC Children's department at Television Centre, but had previous experience from the drama department, so was chosen by Edward Barnes to direct what would be what would be one of their most ambitious children's dramas to date. With a large number of effects shots, coupled with extensive location filming, the production was the most expensive children's drama the BBC had yet created, costing more than £1 million in 1984.", "Railway station scenes were filmed at  and  on the steam heritage Severn Valley Railway; Tewkesbury became the fictional Tatchester; the bishop's children's party was recorded at Kinlet Hall, Shropshire (the location of Moffats Independent School, whose pupils and staff served as extras); the interior of Hereford Cathedral and its choir were featured extensively in the final episode (although the exterior of \"Tatchester Cathedral\" was Tewkesbury Abbey). Exterior shots of Abner Brown's theological college were filmed at Eastnor Castle, near Ledbury, Herefordshire. The snowy mountainous landscape of King Arthur's castle was filmed at the Peel of Lumphanan, Lumphanan, Aberdeenshire. During filming, the crew were almost snowed in by 12-foot blizzards. Renny Rye recalls: \"We could hardly use any of the locations I'd recced because we couldn't get out of the hotel. Nearly all the locations were unreachable because the snow was so thick (which is why it looks quite magical in the film), so virtually all of it was shot in the hotel gardens.\"", "To play Kay Harker, the main child protagonist, two hundred children were auditioned. Director Renny Rye recalls: \"My purist notion was that children's imagination was so great they could do it better if they hadn't been tutored. So I went round lots of schools and saw children from many, many schools.\"  Devin Stanfield was chosen on account of having \"a good face without seeming too modern or too handsome...the demands of filming called for someone with a great deal of stamina [with] a ready imagination, especially as he'd be called upon to react to invisible delights that would only afterwards be electronically added to the film.\" Stanfield was the grandson of the actor Leslie Sands and had previously had a few small parts in television programmes.", "The kindly Punch and Judy man Cole Hawlings was played by Patrick Troughton, famous for his portrayal of the Second Doctor in Doctor Who between 1966 and 1969. Renny Rye said that Troughton \"was my favourite Doctor Who...[he] had a quality that is unsurpassed, I think, as someone to pull you into a tale.\" A Blue Peter feature at the time connected Cole Hawlings to the actor's earlier role, observing that Troughton was once again playing a mysterious, scruffy time traveller."]}]}}