{"wiki_id": "http://www.wikidata.org/entity/Q220234", "itemLabel": "Diana Deutsch", "itemDescription": "American psychologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Diana_Deutsch", "wikipedia_page": {"main": "Diana Deutsch (born 15 February 1938) is a British-American psychologist from London, England.  She is Professor of Psychology at the University of California, San Diego, and is a prominent researcher on the psychology of music.  Deutsch is primarily known for the illusions of music and speech that she discovered.  She also studies the cognitive foundation of musical grammars, the ways in which people hold musical pitches in memory, and the ways in which people relate the sounds of music and speech to each other.  In addition, she is known for her work on absolute pitch (perfect pitch), which she has shown is far more prevalent among speakers of tonal languages.  Deutsch is the author of Musical Illusions and Phantom Words: How Music and Speech Unlock Mysteries of the Brain (2019), the Psychology of Music, and also the compact  discs Musical Illusions  and Paradoxes (1995) and Phantom Words and Other Curiosities (2003).", "link_mentions": [{"page": "Shepard tone", "response": ["In 1986, Diana Deutsch discovered that the perception of which tone was higher depended on the absolute frequencies involved, and that an individual would usually hear the same pitch as the highest (this is determined by the absolute pitch of the notes).  Interestingly, different listeners may perceive the same pattern as being either ascending or descending, depending on the language or dialect of the listener (Deutsch, Henthorn and Dolson found that native speakers of Vietnamese, a tonal language, heard the tritone paradox differently from Californians who were native speakers of English)."]}, {"page": "Attention", "response": ["This debate became known as the early-selection vs. late-selection models. In the early selection models (first proposed by Donald Broadbent), attention shuts down (in Broadbent's model) or attenuates (in Triesman's refinement) processing in the unattended ear before the mind can analyze its semantic content. In the late selection models (first proposed by J. Anthony Deutsch and Diana Deutsch), the content in both ears is analyzed semantically, but the words in the unattended ear cannot access consciousness. Lavie's perceptual load theory, however, \"provided elegant solution to\" what had once been a \"heated debate\"."]}, {"page": "Auditory illusion", "response": ["*Diana Deutsch", "*Diana Deutsch's Web Page"]}, {"page": "Handedness", "response": ["In two studies, Diana Deutsch found that left-handers, particularly those with mixed hand preference, performed significantly better than right-handers in musical memory tasks. There are also handedness differences in perception of musical patterns. Left-handers as a group differ from right-handers, and are more heterogeneous than right-handers, in perception of certain stereo illusions, such as the octave illusion, the scale illusion, and the glissando illusion."]}, {"page": "Octave illusion", "response": ["The octave illusion is an auditory illusion discovered by Diana Deutsch in 1973. It is produced when two tones that are an octave apart are repeatedly played in alternation (\"high-low-high-low\") through stereo headphones. The same sequence is played to both ears simultaneously; however when the right ear receives the high tone, the left ear receives the low tone, and conversely.  Instead of hearing two alternating pitches, most subjects instead hear a single tone that alternates between ears while at the same time its pitch alternates between high and low. PDF Document", "* Diana Deutsch's Octave Illusion site"]}, {"page": "Glissando illusion", "response": ["The effect was first reported and demonstrated by Diana Deutsch in Musical Illusions and Paradoxes, 1995."]}, {"page": "Tritone paradox", "response": ["The tritone paradox is an auditory illusion in which a sequentially played pair of Shepard tonesR. N. Shepard. Circularity in judgments of relative pitch. Journal of the Acoustical Society of America, 36(12):2346–2353, 1964.  separated by an interval of a tritone, or half octave, is heard as ascending by some people and as descending by others.Deutsch, D. A musical paradox. Music Perception, 3:275–280, 1986. Different populations tend to favor one of a limited set of different spots around the chromatic circle as central to the set of \"higher\" tones. Roger Shepard in 1963 had argued that such tone pairs would be heard ambiguously as either ascending or descending. However, psychology of music researcher Diana Deutsch in 1986 discovered that when the judgments of individual listeners were considered separately, their judgments depended  on the positions of the tones along the  chromatic circle. For example, one listener would hear the tone pair C–F as ascending and the tone pair G–C as descending. Yet another listener would hear the tone pair C–F as descending and the tone pair G–C as ascending. Furthermore, the way these tone pairs were perceived varied depending on the listener's language or dialect.", "Shepard predicted that the two tones would constitute a bistable figure, the auditory equivalent of the Necker cube, that could be heard ascending or descending, but never both at the same time. Diana Deutsch later found that perception of which tone was higher depended on the absolute frequencies involved: an individual will usually find the same tone to be higher, and this is determined by the tones' absolute pitches. This is consistently done by a large portion of the population, despite the fact that responding to different tones in different ways must involve the ability to hear absolute pitch, which was thought to be extremely rare. This finding has been used to argue that latent absolute-pitch ability is present in a large proportion of the population.  In addition, Deutsch found that subjects from the south of England and from California resolved the ambiguity the opposite way.Deutsch, D. The tritone paradox: An influence of language on music perception. Music Perception, 8:335–347, 1991. Also, Deutsch, Henthorn and Dolson found that native speakers of Vietnamese, a tonal language, heard the tritone paradox differently from Californians who were native speakers of English.Deutsch, D., Henthorn T. and Dolson, M. Speech patterns heard early in life influence later perception of the tritone paradox. Music Perception, 21:357–372, 2004.", "*  Diana Deutsch's page on auditory illusions"]}, {"page": "Deutsch's scale illusion", "response": ["The effect was discovered by Diana Deutsch in 1973. In a clinical study, patients with hemispatial neglect were shown to experience the scale illusion. Further, in an MEG study on normal listeners the scale illusion was found to be neurally represented at or near the auditory cortex.", "* Diana Deutsch's scale illusion page at UCSD"]}, {"page": "Earworm", "response": ["Researchers who have studied and written about the phenomenon include Theodor Reik, Sean Bennett, Oliver Sacks, Daniel Levitin, James Kellaris, Philip Beaman, Vicky Williamson, Diana Deutsch, and, in a more theoretical perspective, Peter Szendy, along with many more. The phenomenon should not be confused with palinacousis, a rare medical condition caused by damage to the temporal lobe of the brain that results in auditory hallucinations."]}, {"page": "List of musicologists", "response": ["*Diana Deutsch"]}, {"page": "Pareidolia", "response": ["In 1971 Konstantīns Raudive wrote Breakthrough, detailing what he believed was the discovery of electronic voice phenomena (EVP). EVP has been described as auditory pareidolia. Allegations of backmasking in popular music, in which a listener claims a message has been recorded backward onto a track meant to be played forward, have also been described as auditory pareidolia. In 1995, the psychologist Diana Deutsch invented an algorithm for producing phantom words and phrases with the sounds coming from two stereo loudspeakers, one to the listener's left and the other to his right, producing a phrase offset in time between the speakers. After listening for a while, phantom words and phrases suddenly emerge, and these often appear to reflect what is on the listener's mind."]}, {"page": "Audio Engineering Society", "response": ["*Diana Deutsch (2016)"]}, {"page": "Cocktail party effect", "response": ["Diana Deutsch, best known for her work in music perception and auditory illusions, has also made important contributions to models of attention. In order to explain in more detail how words can be attended to on the basis of semantic importance, Deutsch & Deutsch and Norman proposed a model of attention which includes a second selection mechanism based on meaning. In what came to be known as the Deutsch-Norman model, information in the unattended stream is not processed all the way into working memory, as Treisman's model would imply. Instead, information on the unattended stream is passed through a secondary filter after pattern recognition. If the unattended information is recognized and deemed unimportant by the secondary filter, it is prevented from entering working memory. In this way, only immediately important information from the unattended channel can come to awareness. "]}, {"page": "List of University of California, San Diego people", "response": ["* Diana Deutsch, Psychology.  Known for her research on the psychology of music including the octave illusion.Lateralization mechanisms and Deutsch's octave illusion, Journal of the Acoustical Society of America, Retrieved 6 August 2017."]}]}}