{"wiki_id": "http://www.wikidata.org/entity/Q2215497", "itemLabel": "Diane Parish", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Diane_Parish", "wikipedia_page": {"main": "Diane Parish (born 1 November 1969) is an English actress. Born in Chelsea, London and a graduate of the Royal Academy of Dramatic Art, Parish has appeared on British television for over two decades. She has appeared in a number of TV shows over the years, including the ITV dramas The Bill and M.I.T.: Murder Investigation Team playing Detective Eva Sharpe. She is perhaps best known for her two roles in BBC One soap opera EastEnders. For a few episodes in 1998, she played singer Lola Christie. Since 2006 Parish has portrayed the character Denise Fox. She is also known for appearing in two series of the BBC One comedy-drama Lovejoy (1993–1994).", "link_mentions": [{"page": "EastEnders", "response": ["The show often includes strong, brassy, long-suffering women who exhibit diva-like behaviour and stoically battle through an array of tragedy and misfortune. Such characters include Angie Watts (Anita Dobson), Kathy Beale (Gillian Taylforth), Sharon Watts (Letitia Dean), Pat Butcher (Pam St Clement), Kat Slater (Jessie Wallace), Denise Fox (Diane Parish), Tanya Branning (Jo Joyner) and Linda Carter (Kellie Bright). Conversely there are female characters who handle tragedy less well, depicted as eternal victims and endless sufferers, who include Ronnie Mitchell (Samantha Womack), Little Mo Mitchell (Kacey Ainsworth), Laura Beale (Hannah Waterman), Sue Osman (Sandy Ratcliff), Lisa Fowler (Lucy Benjamin) and Mel Owen (Tamzin Outhwaite). The 'tart with a heart' is another recurring character. Often their promiscuity masks a hidden vulnerability and a desire to be loved. Such characters have included Pat Butcher (Pam St Clement) (though in her latter years, this changed), Tiffany Mitchell (Martine McCutcheon), Kat Slater (Jessie Wallace), Stacey Slater (Lacey Turner), Dawn Swann (Kara Tointon), Roxy Mitchell (Rita Simons), Whitney Dean (Shona McGarty) and Lauren Branning (Jacqueline Jossa).", "According to the book How to Study Television, in 1995 EastEnders cost the BBC £40,000 per episode on average. A 2012 agreement between the BBC, the Writers' Guild of Great Britain and the Personal Managers' Association set out the pay rate for EastEnders scripts as £137.70 per minute of transmission time (£4,131 for 30 minutes), which is 85 per cent of the rate for scripts for other BBC television series. The writers would be paid 75 per cent of that fee for any repeats of the episode. In 2011, it was reported that actors receive a per-episode fee of between £400 and £1,200, and are guaranteed a certain number of episodes per year, perhaps as few as 30 or as many as 100, therefore annual salaries could range from £12,000 to £200,000 depending on the popularity of a character. Some actors' salaries were leaked in 2006, revealing that Natalie Cassidy (Sonia Fowler) was paid £150,000, Cliff Parisi (Minty Peterson) received £220,000, Barbara Windsor (Peggy Mitchell) and Steve McFadden (Phil Mitchell) each received £360,000 and Wendy Richard (Pauline Fowler) had a salary of £370,000. In 2017, it was revealed that Danny Dyer (Mick Carter) and Adam Woodyatt (Ian Beale) were the highest-paid actors in EastEnders, earning between £200,000 and £249,999, followed by Laurie Brett (Jane Beale), Letitia Dean (Sharon Watts), Tameka Empson (Kim Fox), Linda Henry (Shirley Carter), Scott Maslen (Jack Branning), Diane Parish (Denise Fox), Gillian Taylforth (Kathy Beale) and Lacey Turner (Stacey Slater), earning between £150,000 and £199,999.", "In 2008, the show was criticised for stereotyping their Asian and Black characters, by having a black single mother, Denise Fox (Diane Parish), and an Asian shopkeeper, Zainab Masood (Nina Wadia). There has been criticism that the programme does not authentically portray the ethnic diversity of the population of East London, with the programme being 'twice as white' as the real East End.", "Some storylines have provoked high levels of viewer complaints. In August 2006, a scene involving Carly Wicks (Kellie Shirley) and Jake Moon (Joel Beckett) having sex on the floor of Scarlet nightclub, and another scene involving Owen Turner (Lee Ross) violently attacking Denise Fox (Diane Parish), prompted 129 and 128 complaints, respectively.\"BBC defends EastEnders sex scene\" BBC News. Retrieved 2 November 2006."]}, {"page": "1969", "response": ["** Diane Parish, English actress"]}, {"page": "Beautiful Thing (play)", "response": ["* 26 September 1994: West End at the Duke of York's Theatre, with Amelda Brown, Zubin Varla, Richard Dormer, Diane Parish and Rhys Ifans."]}, {"page": "Lovejoy", "response": ["* Beth Taylor, played by Diane Parish (series 5–6), Lovejoy's new apprentice following the departure of Eric Catchpole"]}, {"page": "Sharon Watts", "response": ["When Sharon discovers Phil has changed his will, leaving everything to Louise, she forces him to change it to include her. After Phil has been sober for six months, he decides he does not want a liver transplant and he should be allowed to die. Sharon stands by his decision but he changes his mind after realising the effect on Dennis and Louise. Phil is placed on a transplant list but gives up hope, telling Sharon the family need to enjoy Christmas without him; she angrily tells him he can die. However, he returns a day later. Sharon is then reunited with her friend Michelle (now Jenna Russell), who will not talk about why she is back. On Christmas Day, a new liver is found for Phil and his surgery is successful. A week later, Sharon tells Phil that Ronnie and Roxy Mitchell (Rita Simons) have both died. At Michelle's leaving party, Sharon overhears Denise Fox (Diane Parish) confess to Shirley that Phil is the father of her unborn child. Sharon makes plans for her and Dennis to move back to Florida until Sharon realises that Phil did not cheat on her as she and Phil were not together at the time he had sex with Denise. Michelle confides in Sharon that since Mark left home with his girlfriend, she and Tim have not had sex for almost two years. She confides in Sharon she broke the law by having a relationship with a 17-year-old student while she was a teacher. Sharon finds out about Denise's plan to have her son adopted so tells Phil the truth after Phil expresses his wish to adopt Dennis. Phil demands to see his son, but Sharon gets them to talk calmly. Sharon agrees to help Phil fight for his son but then stands by him when he agrees to the adoption. Michelle arranges for Sharon and Phil to spend time alone together and Phil decides to take Sharon on holiday. When Michelle is involved in a car crash after her affair with Preston Cooper (Martin Anzor) is exposed, Sharon returns after receiving a phonecall from Ian. Sharon tells Ian and Martin that she knew about Michelle and Preston's affair and she convinces Preston to leave. This angers Michelle when she regains consciousness. Sharon remains in Walford while Phil is still in Italy."]}, {"page": "Walford", "response": ["Next door to the nightclub is a building that originally housed the Snooker World snooker club. When Johnny Allen buys Angie's Den, he buys Snooker World and merges the two together to give Scarlet a more open space. After 4 Turpin Road is again separated into two buildings in 2011, Janine Butcher uses it to house her property management business, Butcher's Joints. After Janine's arrest for murder, it is converted into a salon called Blades, owned by Dean Wicks (Matt Di Angelo) until he is arrested for rape. Belinda Peacock (Carli Norris) then opens her own salon called Elysium until she is forced to close it down a few months later due to high debts. It is reopened in 2019 by Denise Fox (Diane Parish) as a salon named Fox & Hair."]}, {"page": "Rudolph Walker", "response": ["He also played opposite Diane Parish in Lovejoy (starring Ian McShane) where they played Father and Daughter."]}, {"page": "Patrick Trueman", "response": ["Patrick Trueman is a fictional character from the BBC soap opera EastEnders, played by Rudolph Walker. He made his first appearance on 13 September 2001. His storylines include being the possible father of and father-figure to local resident Denise Fox (Diane Parish), his marriage to Yolande Duke (Angela Wynter), an affair with Pat Evans (Pam St Clement), coping with the death of his adoptive son Paul Trueman (Gary Beadle), being assaulted by an unknown assailant in his own shop, coping when Ben Mitchell (Joshua Pascoe) and his father Phil Mitchell (Steve McFadden) begin a vendetta against him, a relationship with Cora Cross (Ann Mitchell), being injured after falling from a ladder, discovering that Denise's fiancé Ian Beale (Adam Woodyatt) had sex with prostitute Rainie Cross (Tanya Franks), suffering two strokes, a relationship with Claudette Hubbard (Ellen Thomas) and becoming embroiled in Claudette's feud with her son Vincent Hubbard (Richard Blackwood). On 7 December 2015, Walker filmed his 1,000th episode as Patrick. On 2 August 2019, it was revealed that Patrick had married Sheree Trueman (Suzette Llewellyn), with whom he secretly has a son, Isaac Baptiste (Stevie Basaula).", "Patrick rents the car-lot, hiring Pat Evans (Pam St Clement) to do bookkeeping. Patrick and Pat begin a casual affair, which Yolande discovers when Stacey Slater (Lacey Turner) informs her; Yolande slaps Pat, who retaliates. Yolande threatens to leave, but Patrick persuades her to rebuild their marriage. Yolande remains resentful and almost strays with Aubrey Valentine (Joseph Marcell), a member of Patrick's former band, The Five Hectors; Aubrey tries to destroy Patrick but fails and the Truemans remain together. Denise Fox (Diane Parish) discovers that a member of Patrick's band is her father although she is unsure which member. Patrick takes a DNA test and it is revealed that he is not Denise's father, but he pretends he is as he has grown attached to her. The truth comes out while Patrick and Denise holiday together; despite initial upset, Denise and the Truemans remain close. Patrick sees Denise as the daughter he never had and acts as grandfather to her two daughters Chelsea (Tiana Benjamin) and Libby (Belinda Owusu).", "In July 2019 Patrick goes on holiday again to Trinidad. Later, he returns in September, alongside new wife Sheree Baptiste (Suzette Lewellyn). Denise (Diane Parish) is initially weary of Sheree and warns Patrick against her, however he reassures her everything is ok. Sheree notices Ted Murray (Christopher Timothy) is feeling lonelier than ever since losing wife Joyce, so pairs him with her mother (Wanda) who are various dates, asks ted to move away with her and see the world. Ted reluctantly accepts and moves away with Wanda (Anni Domingo). "]}, {"page": "Anthony Trueman", "response": ["After living in Cambodia for several years, Anthony returns to the UK and settles in Glasgow, marries a woman named Sophie and has children. In 2013, Patrick falls from a ladder and considers staying with Anthony but decides not to. In 2014, Anthony is featured in a medical journal, in an article about his work in Cambodia, a copy of which Patrick buys. After hearing about Patrick's stroke, he returns to Walford, though Patrick mistakes him for Paul. Despite feeling obliged to take care of his father, Anthony admits he cannot forgive Patrick's absence during his childhood. He writes Denise Fox (Diane Parish) a cheque for £2000 to help look after Patrick and returns to Scotland."]}, {"page": "Yolande Trueman", "response": ["Yolande returns in March 2017 when she attends Denise Fox's (Diane Parish) disciplinary hearing at the Minute Mart HQ. She attempts to control the meeting to help Denise keep her job. An argument ensues when Harry Beckett (Mark Bagnall)  tells Denise she needs to go on a training course. However, Denise refuses to go on the training course and quits her job and Yolande says that if anyone needs to go on a course, it should be Harry. In June 2017, Yolande visits Derek Harkinson (Ian Lavender) at the Minute Mart, informing him that he failed to declare a criminal record on his DBS and if he cannot explain it in a meeting, he will be removed from the back to work scheme. Yolande goes to see her former husband Patrick for his birthday, where they have a dance and remember old times. Yolande phones Derek to tell him that they have to let him go from the scheme and he has to leave the shop."]}, {"page": "Ian Beale", "response": ["Ian sparks a friendly rivalry with Denise Fox (Diane Parish) as the two engage in a fruit-selling war, though he irritates her. Denise's sister, Kim Fox (Tameka Empson), attempts to set them up on a date but this upsets Denise, who kisses Kim's boyfriend Ray Dixon (Chucky Venn). Kim discovers this and disowns her sister, so Ian allows Denise to stay with him, igniting a friendship between them. It eventually leads to a relationship when he confides in her about his life on the streets. Ian decides to open a restaurant, though Lucy is worried it will fail because of his mental illness. He runs out of money for construction but then finds a box of cash that used to belong to Derek Branning (Jamie Foreman). He also gets Janine to invest in the restaurant, and eventually tricks Lucy into signing over all of the businesses to him. Peter (now played by Ben Hardy) returns to live with the family, and is soon followed by Cindy Williams (Mimi Keene), the daughter of Ian's dead ex-wife of the same name. Ian lets Cindy stay, and Denise also moves in with the family. However Carl White (Daniel Coonan), an associate of Derek, arrives in Walford and soon works out that Ian has spent Derek's money. Carl claims the money was his, and so extorts large sums of cash from Ian as payback. Carl is violent, and burns Ian's hand when he tries to refuse to pay him before promising that the debt will be paid if Ian lies in court, and says that he saw Max tampering with the brakes of Carl's car. Ian reluctantly agrees, but on the day of the court case he is kidnapped by Phil, and Max is found not guilty. It is then revealed that Max was in on the kidnapping, but it was just to lure Carl into a trap. Ian then has to face the consequences of his actions, and Denise is angry when she finds out the truth."]}, {"page": "Clocking Off", "response": ["It was effectively an anthology programme, following the lives of a group of workers at a Manchester textile factory, with each episode focusing on the home life of a different character. Well-known actors who appeared in the series included Christopher Eccleston, Sophie Okonedo, Philip Glenister, John Simm, Lesley Sharp, Siobhan Finneran, Emma Cunniffe, Diane Parish, David Morrissey, Ricky Tomlinson, Julian Rhind-Tutt, William Ash, Ben Crompton, Jack Deam, Jack P. Shepherd, Tina O'Brien, Jason Merrells, Pam Ferris, Wil Johnson, Ashley Jensen, Susan Cookson, Mark Benton, Sarah Lancashire, Crissy Rock, Marshall Lancaster, Marc Warren, Claire Sweeney and Maxine Peake.", "* Diane Parish as Sylvia Robinson (Series 1–2)"]}, {"page": "Phil Mitchell", "response": ["The follow-up of Sharongate saw Phil embarking on a problematic marriage with Ben's mother Kathy Beale (Gillian Taylforth); constantly tormenting Kathy's eldest child Ian Beale (Adam Woodyatt) over the course of their long-running animosity; having a one-night stand with Ian's ex-wife Mel Healy (Tamzin Outhwaite); escalating his two most competitive rivalries with Mel's husband Steve Owen (Martin Kemp) and their common nemesis Dan Sullivan (Craig Fairbrass); becoming the surrogate father of godson Jamie (Jack Ryder); establishing a companionship with Jamie's estranged uncle Billy (Perry Fenwick); clashing with love rival Mark Fowler (Todd Carty) over Louise's parentage; harbouring resentment against Mark's younger brother Martin Fowler (James Alexandrou) for accidentally killing Jamie in a car accident; teaming up with Sharon's adoptive brother Dennis Rickman (Nigel Harman) to eliminate their crime boss Jack Dalton (Hywel Bennett) and then cover up the latter's murder; marrying policewoman Kate Morton (Jill Halfpenny) after saving her from Dalton's earlier arrangement to have her killed; crossing paths with Kate's superior DCI Jill Marsden (Sophie Stanton) when she occasionally tries to bring him to justice; being set-up for armed robbery by Sharon and Dennis' illegitimate father Den Watts (Leslie Grantham); helping exonerate Sam for Den's murder after the latter's spouse and killer Chrissie (Tracy-Ann Oberman) frames her for the crime; waging a conflict against Peggy's gangland enemy Johnny Allen (Billy Murray) that culminated in Get Johnny Week; discovering at his wedding to Stella Crawford (Sophie Thompson) that she had been abusing Ben during their relationship; becoming a prime suspect in the murder of his uncle Archie (Larry Lamb); setting fire to The Queen Victoria public house in light of his addiction to crack cocaine; getting shot by ex-lover Shirley Carter (Linda Henry) on the day of his wedding to Sharon; rescuing his two cousins Ronnie (Samantha Womack) and Roxy (Rita Simons) from being murdered by their notorious adversary Nick Cotton (John Altman); framing ex-business partner Max Branning (Jake Wood) for the murder of Ian's daughter Lucy (Hetti Bywater) in the aftermath of her killer being revealed to be Lucy's younger brother Bobby (Eliot Carrington); coping with Peggy's death after she commits suicide to end her cancer endurance; having a child with Denise Fox (Diane Parish); getting hospitalized by Martin's wife Stacey Fowler (Lacey Turner) after threatening to extort money from her closest relative Kat (Jessie Wallace); ending his prolonged marriage to Sharon upon discovering that she had been sleeping with Louise's boyfriend, Keanu Taylor (Danny Walters) and that he is not responsible for her pregnancy as a result of their hidden romance; and being partly responsible for the death of Sharon's son Denny (Harry Hickles/Bleu Landau) after his confrontation with Keanu over the affair had instigated a boat accident that resulted in the younger's death. On 25 December 2020, Phil was later revealed to be the assailant who attacked Ian in the storyline \"Who Attacked Ian Beale?\"", "Phil reacts badly when he discovers Ben (now Joshua Pascoe) is gay, and makes it clear that he prefers Billy's foster son, Jay Brown (Jamie Borthwick). Jay likes spending time with Phil and changes his surname to Mitchell, becoming Phil's surrogate son. Ben secretly enacts revenge on Phil for this rejection, terrorising him with letters, implying he has evidence to incriminate Phil for past misdemeanours. Among other deeds, Ben sends Denise Fox (Diane Parish) evidence that Phil supplied the cut and shut car responsible for her ex-husband, Kevin Wicks' (Phil Daniels), death in 2008. Denise's attempts to get Phil imprisoned fail; however, Marsden soon investigates the allegations and Ben tells her that Phil forced Stella to jump from the roof back in 2007. Phil is held on remand in prison on suspicion of Stella's murder and Ben delights in the distress he causes his father. Ian, however, is horrified by Ben's behaviour, and tells the police that Ben is lying; however, Ben thinks Shirley's best friend, Heather Trott (Cheryl Fergison), is responsible. Fearful and angry, Ben retaliates by murdering Heather just as Phil returns to confront him. Blaming himself for Ben's actions, Phil makes the murder look like a burglary, spurns a grieving Shirley, allows his neighbors and family to become murder suspects, and bullies Ian into keeping quiet after Ben confesses to him."]}, {"page": "Mel Owen", "response": ["Hunter is arrested and Mel enters a lengthy legal battle to release her son from prison, though to no avail; he is imprisoned and Mel visits him. She becomes more reclusive and stressed without Hunter and tries to avenge Hunter's imprisonment by blaming Jack. Mel is informed by the police that Hunter will be transferred to a prison in the North of England for his safety, before being told that during a crash involving the prison van escorting him, he has escaped. Hunter eventually returns to Walford, and she conceals him in a derelict flat, where she tries to treat his wounds sustained in the crash. She plans to obtain fake passports and return to Portugal for a fresh start. When Hunter is healed, Mel smuggles him in the boot of her car and prepares to leave when Lisa returns, wanting Mel's help to smuggle Louise and her fiancé, Keanu Taylor (Danny Walters), out of the country; they agree for the five of them to move to Portugal. Mel learns that Hunter has escaped the car and taken her gun, Mel becomes panicked and tries to find him. In her search, she tries Jack's house, since Hunter wanted revenge on him for his imprisonment, and finds Jack's partner, Denise Fox (Diane Parish), unconscious on the floor after Hunter attacks her. She alerts the paramedics and goes to find Jack in The Queen Vic; she sees landlady Linda Carter (Kellie Bright) escorting him to the barrel store and realises that Hunter has ordered Linda to bring him there. Mel then cajoles Hunter in handing her the gun and they try to sneak him out of the pub unseen. When he is spotted, Hunter holds the pub hostage and shoots Ben Mitchell (Max Bowden); Mel tries to talk to him with no success and he takes Louise (Tilly Keeper) hostage in Albert Square with armed police surrounding them. Hunter shoots Keanu and Mel urges him to stop his actions; Hunter threatens Louise's life; he is then shot dead by a police marksman and Mel cradles his body, devastated."]}, {"page": "Scott Maslen", "response": ["He is married to Estelle Maslen (née Rubio), who is the mother of his son Zak Alexander Maslen (born 25 January 2001). The couple were together for nine years before they were married on 6 September 2008. Several of Maslen's co-stars were in attendance at his wedding, including: Samantha Womack, Rita Simons, Charlie Clements, Jo Joyner, Steve McFadden, Barbara Windsor, Patsy Palmer, Diane Parish and Perry Fenwick.Scott Maslen; Hello!"]}, {"page": "Kevin Wicks", "response": ["It was announced on 18 August 2007 that Daniels had decided not to renew his contract, and on screen, Kevin was killed off in a car crash on 31 December 2007. He is last seen in the next episode which was broadcast on 1 January 2008, when his wife Denise Fox (Diane Parish) goes to visit his corpse.", "Despite an acrimonious introduction to Denise Fox (Diane Parish) in May 2006 - she mistakes him for Grant Mitchell (Ross Kemp) and accuses him of sleeping with her daughter Chelsea (Tiana Benjamin), but they realize they are attracted to each other and start dating but Kevin struggles to cope with Denise's temper but he begins to see a more vulnerable side, convincing him to persevere. It is a volatile romance and Denise ends it several times so Kevin is pursued by Elaine Jarvis (Siân Reeves). However, Kevin supports Denise through the abuse of her ex-husband Owen Turner (Lee Ross), so the couple reunite and move in together. In late 2006, the Wicks family go on holiday to Dorset. Kevin's ex-wife, Shirley, finds them and tries to reunite with her children, Deano and Carly, until Kevin orders her to leave them alone. Shirley refuses and follows them to Walford in January 2007, and reveals her true identity, causing problems. When Kevin tries to make her leave, Shirley threatens to tell her children that Kevin is not their father. The truth eventually comes out and both Carly and Deano shun Kevin. Deano eventually forgives Kevin for lying, but Carly will not. Devastated, Kevin leaves Walford, not telling anyone where he is going and is missing for several months, it is later confirmed he is alive after bank records show he emptied his account in Hastings. He goes to Dungeness and plans to go to France, but after meeting a man named Jed (Burn Gorman) - who steals his ferry tickets and dies in a bus crash - Kevin goes home. When Carly rejects him again, he turns to Shirley for comfort and has sex with her. Kevin regrets it and makes Shirley promise to keep the tryst secret. Kevin manages to rebuild his relationship with his children and proposes to Denise and they marry in April 2007, despite Shirley trying to ruin the day - she turns up at the ceremony and tells Denise about their recent tryst, only to find Kevin has already told her."]}, {"page": "Jane Beale", "response": ["Worried about Ian's behaviour, Peter (now Ben Hardy) calls Jane. She arrives at their house just as Ian is about to propose to his current fiancée, Jane's friend Denise Fox (Diane Parish). Ian is shocked and Jane and Denise feel awkward with each other. Ian and Jane have a heart-to-heart and Ian breaks down, saying that the pressure of his life is overwhelming. She encourages him to stay strong and advises Peter to talk to Denise about it. The next month, Jane returns to watch Bobby compete in a school spelling competition, lodges with Masood, and agrees to buy into Ian's restaurant. Misinterpreting her actions, Masood kisses Jane, but she rebuffs him. Bonding with Jane over past experiences, Ian kisses her, but she flees the house in humiliation, then is further appalled when Max Branning (Jake Wood) tries to seduce her. Jane makes clear to Ian that they are only friends but agrees to keep the truth from Denise. Masood's daughter Shabnam Masood (Rakhee Thakrar) dislikes Jane and Masood's closeness and plots to push Jane closer to Ian, but Denise is trying to push Jane and Masood closer together, and they eventually become a couple."]}, {"page": "List of former EastEnders characters", "response": ["|Lola Christie || Diane Parish || 1998"]}, {"page": "Darren Miller", "response": ["Darren finds employment at Kevin Wicks's (Phil Daniels) car lot, and decides to stay in Walford when his parents split up in 2006, and his mother and sister move to the Cotswolds. He becomes friendly with Libby Fox (Belinda Owusu) and they perform numerous pranks on their families together; an attraction develops, and they begin a relationship. Darren gets involved in a car scam when Kevin starts selling stolen cars that turn out to be dangerous cut and shuts. When Kevin dies due to an accident in one of the cars, Darren takes over control of the car lot. Darren blames Phil Mitchell (Steve McFadden) for Kevin's death, as he forced Kevin to sell the cars. Darren subsequently gets involved in a feud between Phil and Jack Branning (Scott Maslen), helping Jack to trick Phil into a confession about the stolen cars. Darren and Libby's relationship continues into 2008. Libby's mother, Denise Wicks (Diane Parish), feels that Darren is a bad influence on her daughter, and when Libby opts not to apply to Oxford University so she can stay with Darren, Denise persuades him to end the relationship. Darren dumps Libby to satisfy her needs, leaving her heartbroken. She eventually discovers the truth; she reunites with Darren. Darren makes Libby promise that she will not ruin her future and persuades her to apply to university."]}, {"page": "Carly Wicks", "response": ["Despite Sean's assaults on her brother, Carly briefly resumes a sexual relationship with him, but he has little interest in her as he is besotted with Tanya Branning (Jo Joyner). Carly discovers that Kevin has died in a car accident. She visits his body in the morgue and screams, momentarily asking for support from Shirley, who was with Kevin when he died. The following day, however, Carly is incensed that Shirley had been the last face Kevin had seen before he died; she tells Shirley that she wishes it had been her that died instead. She rejects Shirley's further attempts to comfort her, and after Kevin's funeral, Carly and Kevin's wife Denise (Diane Parish) leave Walford to travel the world and scatter Kevin's ashes. Denise returns and reveals that Carly has decided to stay in Thailand. A month later, Carly sends Denise a postcard asking for Kevin's signet ring and it is revealed that Carly is living in Redfern, a suburb of Sydney, Australia.", "When Daniels, who played Carly's father Kevin Wicks, quit the serial, producers decided to write out the rest of the Wicks family. Discussing her contract failing to be renewed, Shirley stated: \"It's a shame the option on my contract hasn't been picked up, but it wouldn't feel right to remain in the Square without the rest of my family.\" In her final scenes Carly and her stepmother Denise (Diane Parish) decide to go travelling to scatter Kevin's ashes. Shirley felt her exit storyline was fitting, stating: \"Kevin was desperate to travel and both Carly and Denise think it would be a fitting tribute for him if they travelled with his ashes and scattered them in the countries he so wanted to see. And Carly won't be coming back.\" Shirley felt one good thing came out of Kevin's death - \"The one positive thing that comes out of Kevin's death is that Carly and Denise get a lot closer. Denise is there for her and together they decide that Kevin would have wanted them to do this together.\" Although Shirley was happy with her exit storyline, she had originally hoped Carly would be killed on-screen."]}, {"page": "The British Soap Awards", "response": ["| \"Outstanding Achievement Award\" (off-screen)Presented by Diane Parish and Gillian Taylforth|| Rob Gittins (EastEnders writer) || N/A", "| \"Best Female Dramatic Performance\"Presented by Martine McCutcheon|| Kym Marsh (Michelle Connor in Coronation Street) || Dido Miles (Emma Reid in Doctors)Diane Parish (Denise Fox in EastEnders)Charlotte Bellamy (Laurel Thomas in Emmerdale)Nadine Rose Mulkerrin (Cleo McQueen in Hollyoaks)"]}, {"page": "Denise Fox", "response": ["Denise Fox  (also Wicks  and Johnson) is a fictional character from the BBC soap opera EastEnders, played by Diane Parish. She made her first appearance on 11 May 2006 and temporarily left EastEnders in early 2008 to give birth to her second child. Her leave-taking had coincided with the departure of Matt Di Angelo (Dean Wicks) and permanent departures of cast members Phil Daniels (Kevin Wicks), Kellie Shirley (Carly Wicks). She returned to Walford on 6 June 2008. This is Parish's second role in EastEnders, as she previously played singer Lola Christie in 1998.", "On 7 November 2005, the BBC announced that Diane Parish had been cast in EastEnders as a \"sassy, strong\" character with links to the established Wicks family, who would be \"a force to be reckoned with.\" Parish had previously appeared in the serial as singer Lola Christie in 1998. In January 2006, Parish's character was revealed to be Denise Fox, who would embark on a romance with fellow newcomer Kevin Wicks (Phil Daniels). Tiana Benjamin was cast as Denise's daughter Chelsea, and spoke of her admiration for Parish, eagerly anticipating the opportunity to work with her. Lara Gould of the Sunday Mirror described the new characters as the \"feisty Fox family\", revealing that Denise would have a second, younger daughter, Elizabeth [\"Libby\"], played by Belinda Owusu. Gould reported that the family would \"arrive in Albert Square with a bang and [...] cause friction from the off\", expanding: \"The Fox girls don't take any nonsense – they'll be a force to be reckoned with.\" Lee Ross was later cast as Denise's former husband and Libby's father Owen Turner. Kris Green of media and entertainment website Digital Spy described Owen as having had \"a disappointing life\", revealing that Denise had separated from him as a result of his heavy drinking."]}, {"page": "Chelsea Fox", "response": ["Chelsea Atkins (also Fox) is a fictional character from the BBC soap opera EastEnders, originally played by Tiana Benjamin from 2006 to 2010, and then Zaraah Abrahams from 2020 onwards. Benjamin was cast in the role and she left her role in the Harry Potter film series to appear in the soap, she made her first appearance as Chelsea in episode 3147, originally broadcast on 5 May 2006 as she is introduced as part of the all-female Fox family alongside her mother, Denise Fox (Diane Parish), and half-sister, Libby Fox (Belinda Owusu). Benjamin announced her departure from the show in April 2010, and she left in episode 4047, originally broadcast on 5 August 2010. In October 2020, the character's return was announced alongside Abrahams' casting, Chelsea returns in episode 6188/6189, originally broadcast on 25 December 2020. ", "On 12 January 2006, an official BBC press report announced the introduction of a new character to EastEnders, Chelsea Fox. Chelsea was due to be part of a new, all female family joining the show, with Chelsea's mother Denise and her sister Libby (played by Diane Parish and Belinda Owusu respectively) completing the clan. The role was cast to Tiana Benjamin, who was 21 at the time. Benjamin has revealed that she was the second Fox to be cast, and on her final audition, she had a workshop and met Diane Parish there. Owusu was cast at a later date. Of her casting, Benjamin said \"I've been a big fan of EastEnders since I was little and I'm very excited to join the show. I've always really admired Diane [Parish] and I can't wait to work with her – it really hasn't sunk in yet! [...] It's one of those jobs that's unlike any other. There's a lot that changes when you take on something as big as EastEnders. I [am] really happy and genuinely excited to be a part of the show.\" She added that the three actors who play the Fox family have a bond,  commenting \"We all respect and understand each other, and manage to have a good time while we're filming too. I felt that we clicked from our first few scenes together.\" Benjamin quit her role as Angelina Johnson in the Harry Potter film series, in order to take the part. Chelsea made her first screen appearance in May 2006 and was the first of the Fox family to be seen by viewers."]}, {"page": "Ben Mitchell (EastEnders)", "response": ["Ben had instructed Jay to bury Lucy's purse and phone, which has been missing since her death. Denise Fox (Diane Parish) digs them up in Patrick Trueman's (Rudolph Walker) allotment and takes them to Ian, who calls the police before Ben convinces him that he found them on Good Friday in a bag in the Square and had no part in Lucy's murder. Ian lies to the police and protects Ben. When Phil is arrested on suspicion of attempting to kill Ronnie, he puts Ben in charge of his garage. Max Branning (Jake Wood) starts helping him with deals, only to trick Ben into signing over the garage to him as revenge for the death of his girlfriend Emma Summerhayes (Anna Acton), which Max has blamed Phil for, though Phil eventually gets the garage back. Ben then starts a sexual relationship with Paul Coker (Jonny Labey), whilst maintaining his relationship with Abi. Ben grows frustrated with Abi's controlling behaviour, and she is suspicious, so Ben has sex with her to allay her fears. Phil catches Ben and Paul half-naked together at the car lot, and angrily tells Ben to leave as he broke his trust, both in hiding his homosexuality and being loyal to Abi. Ben ends his relationship with Paul, leaving Paul heartbroken. Paul tries to speak to Ben on numerous occasions, but fails to win Ben's affections over. Ben and Abi decide to find their own home after realising they can no longer stay with Phil after Sharon leaves him. Ben and Paul flirt and arrange to go to the cinema but when Abi finds them and leaves in anger feeling Ben is not taking their plans seriously, Ben follows her, leaving Paul alone. Paul later tells Ben that he loves him and says Ben must decide who really wants and accept who he really is. To give himself more time, Ben books tickets for Abi to visit a friend on holiday, and then tells Paul he loves him back. Jay sees them kissing, and tells Ben to admit to Abi that he loves Paul. When Phil is later sent to hospital and informed that he will be dead within 12 months unless he has a liver transplant, Ben, alongside Sharon and Jay, refuse to visit him, and Sharon has him change the locks on the house so Phil cannot enter when he is discharged."]}, {"page": "Max Branning", "response": ["After developing a friendship during lockdown, Max supports Linda Carter (Kellie Bright) when he catches her having a drink, despite battling an alcohol addiction. Linda's friend Sharon Watts (Letitia Dean) tells Max to leave Linda alone, but after a heart to heart, Max and Linda kiss. A guilty Linda tells Mick, who angrily warns Max off. However, Linda's marriage continues to fall apart as Mick pushes her away, and she and Max kiss again. Max uses Linda as an alibi after Ian is attacked by an unknown assailant and left for dead. Mick tells Linda to stay away from him, and, hurt, she goes to stay with Max and the pair have sex. Linda becomes suspicious when Max starts to behave secretively, and it is revealed that Max had disposed of Linda's award from the Lucy Beale Foundation, assuming that Linda had attacked Ian. Max decides to join Lauren and Louie in New Zealand and asks Linda to follow him but she says no and leaves Abi in the care of Rainie and her husband Stuart Highway (Ricky Champ) and leaves the square alone. Several months later, Jack takes Abi to visit Max in France but returns without Abi and confirms to Denise Fox (Diane Parish) that Max has fled and taken Abi with him."]}, {"page": "Michelle Fowler", "response": ["In 2012, Kathy's son Ian Beale (Adam Woodyatt) contacts Michelle to inform her of the death of their closest family friend Pat Butcher. Ian and his son Bobby Beale visit Michelle in early 2013 whilst Sharon visits Michelle in July 2013 with her son Denny Rickman (Harry Hickles) whilst recovering from her painkiller addiction. In 2014, Michelle sent her condolences to Ian after the death of his daughter Lucy Beale ((Hetti Bywater). Ian then went to stay with Michelle after he broke up with his partner Denise Fox (Diane Parish). Sharon also invited Michelle to her wedding to Phil Mitchell, asking her to be her matron of honour, but Michelle rejected Sharon's invitation claiming that Ian was unwell. Ian then returned just before the wedding and revealed that both he and Michelle were planning to stop Sharon from marrying Phil. A year later, Ian disappears and Sharon claims that he has gone to America; however, Phil contacts Michelle and she reveals that Ian is not with her. In early 2016, Martin leaves to stay with Michelle for a few weeks after he realised that his son Arthur Fowler Jnr was actually fathered by his best friend Kush Kazemi. She is unable to attend Martin’s wedding to Stacey Branning in May 2016 but sends Ian an email wishing the newlyweds her congratulations, which he reads at their wedding reception.", "Sharon encourages Michelle to make amends with Martin and Ian, but neither of them are interested; Michelle talks to Bex, who says Michelle let herself down and the old Michelle that Bex used to look up to would hate this Michelle, and that she ruined everything she worked for; Michelle cries in Sharon's arms, saying she no longer knows herself. Ian eventually forgives Michelle, but Martin still refuses to speak to her. Michelle attempts to find work in schools, without any luck. Stacey invites Michelle to a family meal but Martin says Michelle is only pretending to care about her family, and tells her that she is not the big sister he used to look up to. Michelle starts community service and hears that Tim wants a divorce, and she tries to avoid the issue. Eventually, Martin and Michelle start to talk again but he is still angry that she has behaved like a teenager. Michelle then realises that she needs to apply for other jobs so enquires about a sales assistant job, which she successfully obtains. Whilst travelling to work on the Tube, Michelle meets a passenger named Tom Bailey (Daniel Casey) on the train and she eventually gets the courage to ask him to go out on a date. Although they get along well, Michelle later loses interest in Tom and decides to reject him. He does not react well and begins to stalk her by sending her flowers and chocolates. Michelle tries to move on and goes on a date with a man but does not hear from him again, unaware that Tom has threatened him. Michelle later invites Tom around for dinner in an attempt to get rid of him for good. When he starts to try and kiss Michelle, this prompts Sharon along with fellow residents Denise Fox (Diane Parish) and Karen Taylor (Lorraine Stanley) to retaliate by hitting him over the head with a vase; Tom is then confronted over lying to Michelle about his wife being dead, to which he responds by leaving the square in disgust. Michelle later decides to spend Christmas with her daughter Vicki in Australia."]}, {"page": "Murder Investigation Team (TV series)", "response": ["Murder Investigation Team is a British police procedural drama/cop thriller series produced by the ITV network as a spin-off from the long-running series, The Bill. The series recounts the activities of the Metropolitan Police's Murder Investigation Team, who are led by D.I. Vivien Friend (Samantha Spiro) and D.S. Rosie MacManus (Lindsey Coulson). The series, also starring Diane Parish and Michael McKell, produced 12 episodes between 2003 and 2005. In September 2005, The Sun reported that ITV would not be commissioning a third series.thebillbios.co.uk", "* Diane Parish as Constable Eva Sharpe (series 2), a D.C. recruited by D.C.I. Wishart from Sun Hill. Eva is described as being sharp by nature, as well as by name, and during her time at borough policing she had earned herself a reputation as a lone wolf whose attitude \"cuts both ways\". Eva initially has an adversarial relationship with Hands, because of his relative inexperience as SIO. She is partnered with MacManus. Prior to appearing in series 2 of M.I.T., Parish played Sharpe on sister series The Bill. "]}, {"page": "Libby Fox", "response": ["Libby Fox (initially known as \"Squiggle\") is a fictional character from the BBC soap opera, EastEnders, played by Belinda Owusu. She made her first appearance on 22 May 2006 and left in 2010. She is the daughter of Denise Fox (Diane Parish) and Owen Turner (Lee Ross), and half-sister of Chelsea Fox (Tiana Benjamin). The Fox family were introduced by executive producer Kate Harwood. The character of Libby was featured in a prominent storyline in 2006, when Owen attempts to murder her. The character then cultivates a relationship with her peer Darren Miller (Charlie G. Hawkins). She is portrayed as intelligent and competitive. The character was axed in April 2010 and her departure episode was broadcast on 5 August 2010. Libby returned in April 2014 as part of the beginning of the Who Killed Lucy Beale? storyline. Since then she continued to make various guest appearances up until 31 January 2017.", "Libby is Denise Fox's (Diane Parish) youngest daughter. Libby secretly contacts her estranged father, Owen Turner (Lee Ross), an abusive alcoholic, and he starts making demands to see her. Denise is reluctant to allow this, but Owen seems to have changed, and Libby is keen for her parents to get back together; Denise is swayed and sleeps with Owen. However, as soon as Owen begins drinking again, he becomes abusive and hits her. He is arrested, but Libby persuades Denise to give a glowing character witness statement and he is released. Owen kidnaps Libby and takes her to Epping Forest. He drugs her and tries to kill her and himself by filling the car with noxious exhaust fumes. She escapes, but he catches her and tries to drown her in a stream. Denise arrives to find Libby unconscious on the bank. She is taken to hospital and makes a full recovery. Owen is imprisoned for 5 years.", "Early in Spring 2006, an official BBC press report announced the introduction of a new, all female family joining EastEnders, Denise Fox (Diane Parish) and her two daughters Chelsea (Tiana Benjamin) and Libby (nicknamed Squiggle), cast to Belinda Owusu, who was 16 at the time. Benjamin has revealed that she was the second Fox to be cast, and on her final audition, she had a workshop and met Diane Parish there. Owusu was cast at a later date. Tiana Benjamin who plays Chelsea has said that the three actors who play the Fox family have a bond,  commenting \"We all respect and understand each other, and manage to have a good time while we're filming too. I felt that we clicked from our first few scenes together.\""]}, {"page": "Cindy Williams (EastEnders)", "response": ["A heavily pregnant Cindy returns to Walford and meets Ian, who is trying to reconcile with fiancée Denise Fox (Diane Parish). He shows little interest until he notices Cindy is in labour, and she admits that she ran away after discovering Gina and Bev were planning to have her baby adopted. Ian helps her deliver her daughter Beth Williams. She reconciles with Ian, but this is marred by Denise leaving him and TJ struggling to bond with Beth. TJ admits he cannot cope with being a father and moves to Milton Keynes with his family. Cindy struggles to cope with being a single mother. She confides in Liam but when she tries to kiss him, he turns her down realising that it would be for the wrong reasons. Cindy finds a Christmas present addressed to Beth; inside is Lucy's jewellery box. Former police officer Emma Summerhayes (Anna Acton) tries to get information from Cindy in her grief about her involvement in Lucy's death, but fails."]}, {"page": "Saturday Kitchen", "response": ["* Diane Parish"]}, {"page": "Owen Turner", "response": ["Owen is the ex-husband of Denise Fox (Diane Parish) and father of her daughter, Libby (Belinda Owusu). He arrives in Walford looking for Libby, whom he has not seen since Denise divorced and left him, due to his alcohol problem. Denise sleeps with Owen, and a couple of days later, he hits her, witnessed by Denise's daughters, Chelsea (Tiana Benjamin) and Libby. Denise ends their relationship so, drunk, Owen holds her hostage in her flat. He drags her up the stairs by her hair and she stabs him with a fork. After Denise's boyfriend Kevin Wicks (Phil Daniels) and Libby notice Denise's absence, they call the police and Owen is arrested. His mother Liz (Kate Williams) visits him in prison. Owen goes on trial and receives a six-month sentence, suspended for two years.", "Owen Turner was introduced by executive producer Kate Harwood in 2006 as the estranged father of the already established character Libby Fox (Belinda Owusu) and ex-partner of Libby's mother Denise Fox (Diane Parish). Actor Lee Ross was cast in the role and a backstory of a \"disappointing\" life and alcoholism was revealed in a press release before Owen's introduction. Ross said, \"I'm very happy to be joining EastEnders and I'm looking forward to working alongside the entire cast including Phil Daniels and Jake Wood whom I've worked with before.\" Owen made his first appearance in June 2006."]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Diane Parish (Acting Diploma 1991)"]}, {"page": "British African-Caribbean people", "response": ["The profile of African-Caribbean actors on television, such as Lennie James, Judith Jacob and Diane Parish, has widened substantially since 1970s programmes such as: Love Thy Neighbour (Rudolph Walker) and Rising Damp (Don Warrington) when their role was often to act simply as either the butt of, or foil to, racist jokes made by White characters. The most influential programme in moving away from this formula was the 1989–94 Channel Four barbershop sitcom Desmond's, starring Norman Beaton and Carmen Munroe. In 1982, at the time, the youngest ever actor to play Doctor Who, Peter Davison is of Afro-Guyanese and English descent.*"]}, {"page": "List of The Bill characters", "response": ["The Bills roster of Detective Constables investigate crimes under the direction of their sergeants. Kevin Lloyd, as Alfred \"Tosh\" Lines, appeared in more episodes than any other DC, in 383 episodes between 1988 and 1998. In the series finale, \"Respect\", Amita Dhiri, Chris Simmons, Patrick Robinson, and Bruce Byron play Constables Dasari, Webb, Banks, and Perkins. Other notable Detective Constables include Eva Sharpe, played by Diane Parish, who departed in 2004 but went on to headline the second series of Murder Investigation Team in 2005, and Rae Baker as Juliet Becker, who departed the series in the 2003 live episode \"Fatal Consequences\". ", "| Eva Sharpe || Diane Parish || 2002-2004 || style=\"text-align:center;\"|91 || D.C."]}, {"page": "Stella Crawford", "response": ["In January 2012, local shopkeeper Denise Fox (Diane Parish) is led to believe that Phil had murdered her husband Kevin Wicks (Phil Daniels) in late December 2007. Denise later suspects that Phil pushed Stella to her death on their wedding day, but Phil denies her accusations and insists that Stella committed suicide. However, Denise goes to the police, telling them she believes that Phil murdered Stella. Ben (now played by Joshua Pascoe) goes to the police and tells police detective DCI Jill Marsden (Sophie Stanton), who has been trying to imprison Phil for years, that Phil forced Stella to jump - telling her that if she did not, then he would shove her instead. Phil is then arrested for Stella's murder and is later charged, but Marsden is forced to release him when Ian reveals to her that Ben had lied about Phil murdering Stella."]}, {"page": "List of EastEnders television spin-offs", "response": ["EastEnders: Secrets from the Square is a documentary series hosted by Stacey Dooley on BBC One. The programme was broadcast as a response to the COVID–19 pandemic which led to the suspension of production on EastEnders. The series includes Dooley interviewing cast members such as Adam Woodyatt, Letitia Dean, Danny Dyer, Kellie Bright and Diane Parish about their experiences on EastEnders.", "EastEnders and rival soap opera Coronation Street took part in a crossover episode for Children in Need on 19 November 2010, called \"East Street\". The EastEnders cast who took part in the mini-episode were Laurie Brett (Jane Beale), Charlie G. Hawkins (Darren Miller), Kylie Babbington (Jodie Gold), Nina Wadia (Zainab Masood), John Partridge (Christian Clarke), Diane Parish (Denise Johnson), Nitin Ganatra (Masood Ahmed), Jamie Borthwick (Jay Brown), Shane Richie (Alfie Moon), Jessie Wallace (Kat Moon), Ricky Norwood (Fatboy) and Shona McGarty (Whitney Dean)."]}, {"page": "Don Gilet", "response": ["Gilét is close friends with EastEnders co-star Diane Parish, both having been in Babyfather together.", "Gilét's first television appearance was on the Channel 4 dating show Streetmate, where he was interviewed as the friend of a participant. His first major role was playing Johnny Lindo in Babyfather (opposite future EastEnders co-star Diane Parish), before landing the lead role in the detective series 55 Degrees North, as Detective Sergeant Nicky Cole. In 2006, he played Leo Charles in The Line of Beauty and had a prominent role in the Doctor Who Christmas episode \"The Runaway Bride\". He often performs his own stunts on set."]}, {"page": "Shirley Carter", "response": ["Shirley first appears, when, against her former husband Kevin Wicks' (Phil Daniels) wishes, she introduces herself to her adult children, Carly (Kellie Shirley) and Dean (Matt Di Angelo). Carly is hostile but Dean is amenable, so Shirley moves to Walford to be near them. Kevin and Shirley maintain an antagonistic relationship. Shirley attempts to sabotage his relationship with Denise Fox (Diane Parish) and threatens to tell her children about their true paternity, which she eventually does: she tells Carly her father is a man named Daniel and Dean that she does not know who his father is. Kevin had brought up Carly and Dean as his own, as well as his natural child with Shirley, Jimbo (Lloyd Richards), who had cystic fibrosis, which Shirley struggled with and ended up walking out on the family, not attending Jimbo's funeral when he died aged 21. The revelation only drives Carly and Dean further away. When she learns that Kevin has been selling cut-and-shut cars, she confronts him. They try to dispose of a stolen car together but are involved in a crash, which kills Kevin. In the aftermath, Carly rejects her mother and leaves Walford. Dean, who gets in trouble with the police, is imprisoned and when released he blames Shirley for all his problems and also moves away."]}, {"page": "Golden Opportunity (The Bill)", "response": ["* DC Eva Sharpe (Diane Parish): Debuted in Episode 012 - At the Deep End"]}, {"page": "Holding On (TV series)", "response": ["The series boasted a stellar cast, including David Morrissey, Lesley Manville and Ellen Thomas, as well as Ace Bhatti and Diane Parish, who were both relatively unknown at the time of the series' broadcast. The series was billed as Marchant's \"first significant project for television\",http://www.screenonline.org.uk/tv/id/534564/index.html and its main themes as \"exploring in complex detail the personal responsibility [of every individual], and how it becomes threatened in a society which has been told by Margaret Thatcher [that] it no longer exists.\" The series was first released on DVD on 1 August 2005.https://www.amazon.co.uk/Holding-DVD-David-Morrissey/dp/B0009WT5DM/ After many years of being out-of-print, the series was finally re-released by Simply Media on 9 November 2015.https://www.amazon.co.uk/d/DVD-Blu-ray/Holding-David-Morrissey/B011USQ1YE/ Following the DVD release, the series drew comparisons to American drama series The Wire, praising the similarities been the multi-layered complex storylines and character development.https://sabotagetimes.com/tv-film/holding-on-the-uk-wire", "* Diane Parish as Janet"]}, {"page": "Fatal Consequences (The Bill)", "response": ["* DC Eva Sharpe - Diane Parish"]}, {"page": "Ethnic Multicultural Media Academy", "response": ["| Diane Parish"]}, {"page": "Tameka Empson", "response": ["In 2008, Empson appeared in the BBC sitcom Beautiful People and in the ITV1 thriller Whitechapel. In 2009, she joined the cast of EastEnders, playing Kim Fox, the half-sister of Denise Fox (Diane Parish). As a result, she has won several awards including an Inside Soap award in 2012 for \"Funniest Female Performance\". She took maternity leave from EastEnders and returned to screens August 2014. On 16 July 2019, it was announced that Empson would be temporarily leaving the series, with her return set to air in 2020. Empson confirmed on Loose Women that the break was her maternity leave for her second child, and that she did not deliberately keep it a secret, but that she \"just wanted to enjoy it\"."]}, {"page": "Bush Hill Park", "response": ["* Diane Parish, actress who plays Denise Fox in the television programme EastEnders.Enfield Independent news report Retrieved 7 June 2013"]}, {"page": "List of EastEnders characters (2007)", "response": ["Detective Inspector Kelly, played by Ian Burfield, is a police detective at Walford Police Station. In 2007, he investigates the death of Pauline Fowler (Wendy Richard) and subsequently arrests Sonia Fowler (Natalie Cassidy) for her murder following the funeral. He arrests May Wright (Amanda Drew) for abducting Summer Swann, and also Phil Mitchell (Steve McFadden) on suspicion of murdering his fiancée Stella Crawford (Sophie Thompson). He appears when he is investigating Jay Brown's stabbing. In August 2008 he investigates the murder of Jase Dyer (Stephen Lord) and interrogates Billy Mitchell (Perry Fenwick) as a key witness. In July 2010 he informs Liz Turner (Kate Williams) that a body found in Albert Square is that of her son Owen (Lee Ross), and takes his ex-wife Denise Johnson (Diane Parish) in for questioning. Denise is released without charge. Kelly later informs Denise's family that her car has been discovered abandoned by a canal, and then that the body of a woman was pulled from the canal along with Denise's mobile phone. Lucas identifies the body as Denise's, however, Kelly still believes somebody else was involved in Owen's murder. Kelly's actor Ian Burfield had previously played a police detective in 1997, DI Hamilton, and went on to play DCI Peter Arthurs in 2018.", "Derek Evans is a social worker, played by Simon Lowe. In March 2007, he visits Bert Atkinson (Dave Hill) and his grandson Jay Brown (Jamie Borthwick), when Bert is trying to get a residency order for Jay to live with him permanently. Jay charms Derek, offering him a cup of tea and talking to him politely, impressing him. In January 2008, Derek visits Tanya Branning (Jo Joyner) and her sister Rainie Cross (Tanya Franks). In October that year, he attempts to sort out Jay's foster care problems when Billy Mitchell (Perry Fenwick) offers to care for him, as Jay does not want Dawn Swann (Kara Tointon) to be his foster mother. Derek inspects the flat above The Queen Victoria public house, and allows Jay to stay with Billy, despite Roxy Mitchell's (Rita Simons) messiness. In July 2009, he visits Denise Wicks (Diane Parish) after Jordan Johnson's (Michael-Joel David Stuart) mother Trina (Sharon Duncan Brewster) reports her to the police, claiming that Denise has been abusing Jordan. In June 2010, he visits Phil Mitchell (Steve McFadden) to assess his family situation involving his children Louise (Brittany Papple) and Ben (Charlie Jones), who has assaulted Jordan. The following month he visits Phil and his mother Peggy Mitchell (Barbara Windsor) to say that Louise's mother Lisa Fowler (Lucy Benjamin) has made an application to see her daughter. Derek explains that the final decision is not up to Phil and Peggy says that Derek is a typical social worker – an interfering, home-wrecking busybody. Derek responds sarcastically and leaves. When Peggy returns Louise to Lisa, they contact Derek again, and when he arrives, Phil steals his bag to get Lisa's address.", "Though she does not appear again, Manju is mentioned on 13 May 2008 by Shabnam Masood (Zahra Ahmadi) who tells her mother Zainab (Nina Wadia) that she is going to see if Mrs Patel has any new clothes in her Sari shop. On 24 July Mrs Patel's shop is mentioned by Jane Beale (Laurie Brett) when she is looking to buy some fabric for an Indian lunch that she and Husband Ian (Adam Woodyatt) are holding at the café. They buy the material from Mrs Patel after seeing it although Mrs Patel isn't seen. Mrs Patel is then mentioned on 24 March 2009 when Syd Chambers (Nina Toussaint-White) announces she is renting 13a Turpin Road, the flat above the bookies from her. In April 2010, she rents the flat to Syed (Marc Elliott) and Amira Masood (Preeya Kalidas). In 2012 she is mentioned by Denise Fox (Diane Parish) and Zainab at Heather Trott's (Cheryl Fergison) funeral service.", "In November 2015, Morris visits Denise Fox (Diane Parish) and tells her that a person the police have in custody has given her address as theirs. She confirms to Morris all of the people who live in her house. Denise then tries to find out from Morris who the arrested person is, and although he is unable to tell her, she realises it is her former stepson Jordan Johnson (Joivan Wade).", "In 2009, Kim Fox (Tameka Empson) books him for her sister Denise Wicks' (Diane Parish) wedding to Lucas Johnson (Don Gilet). ", "Zainab Masood, played by Nina Wadia, is first seen as the owner of Walford Post Office, and employer of Denise Wicks (Diane Parish). Zainab is the mother of Shabnam (Zahra Ahmadi), Tamwar (Himesh Patel) and Syed Masood (Marc Elliott), and is the wife of Masood Ahmed (Nitin Ganatra). Zainab and Masood stay strong through various family difficulties, and Zainab gives birth to another son, Kamil in 2010, but their joy is short-lived as Syed soon admits that he is gay. When Zainab's ex-husband Yusef Khan (Ace Bhatti) arrives, this ultimately leads to her divorcing Masood, and she later remarries Yusef. He abuses her and is killed, leaving her a widow.", "Detective Constable Zachary Carson, played by Jonah Russell, is one of the police officers investigating the attack on Patrick Trueman (Rudolph Walker). He collects witness statements from Deano Wicks (Matt Di Angelo) and Chelsea Fox (Tiana Benjamin), who claim they saw Sean Slater (Robert Kazinsky) attack Patrick, and later he interviews Patrick when he regains consciousness, distressing him until Denise Wicks (Diane Parish) tells Carson to leave the hospital. He leaves Patrick his card, and Patrick later telephones him and tells him Sean is the culprit. One month later, the police officers arrest Chelsea and Deano after it has been discovered they are perverting the course of justice.", "Oscar returns in April 2014 and stays with Max, whilst Tanya is on a night out in London. Abi collects him and brings him to Max in the café and Lauren and Abi take him bowling while Max meets Lucy Beale (Hetti Bywater). In May 2014, Oscar visits again after Lucy's murder and plays with Abi and her boyfriend, Jay Brown (Jamie Borthwick). Lauren is upset and angry that everyone is carrying on as normal and ignoring the fact that Lucy is dead. Oscar and Tanya attend and Jane and Ian Beale's (Adam Woodyatt) wedding in February 2015 and Tanya announces that she is taking a fashion course in Manchester. She allows Oscar to stay with Max for a while but he returns to live with Tanya when Max is arrested and charged with Lucy's murder in July 2015. Disgusted by Max's relationship with Lucy, Tanya refuses to allow Max to see Oscar. In June 2017, Max's brother Jack Branning (Scott Maslen) arranges for Oscar (now Charlee Hall) to visit Max on Father's Day. When Oscar is due to visit Max for his tenth birthday in December 2017, Tanya changes her mind on letting Max see him when Denise Fox (Diane Parish) informs Cora about Max's part in conning the neighbours with Weyland & Co as a form of revenge for being falsely imprisoned for murder.", "Booty closes down in late 2009, so Gaynor loses her job. Gaynor works as a makeup artist for Denise Fox's (Diane Parish) wedding, to Lucas Johnson (Don Gilet). In February 2010 she gives out beauty treatments at Bianca Jackson's (Patsy Palmer) hen party. Gaynor resumes her old job when Roxy Mitchell (Rita Simons) reopens the beauty salon as Roxy's. When Roxy faces financial difficulties, Roxy sells the salon back to Tanya, and Gaynor continues working there. Tanya sells the salon to Sadie Young (Kate Magowan) in 2013, and Gaynor continues as an employee. Sadie leaves and sells the Salon, and Gaynor stops appearing round about this point as she does not have a job any more."]}, {"page": "Zainab Masood", "response": ["Zainab arrives as the owner of Walford's Post Office, clashing with employee Denise Wicks (Diane Parish) immediately, though they later become friends. The post office flounders in debt, and Zainab turns to Inzamam for a loan, but he wants sex in return for the money, which disgusts her and Masood banishes Inzamam from his life when he discovers what his brother has done. Despite the Masoods' best efforts, they are forced to close the post office. The Masoods attempt to turn their fortunes around, starting a catering business. Ian Beale (Adam Woodyatt) invests £2000 and the company merges with Ian and Christian Clarke's (John Partridge) catering company, becoming \"Masala Queen\", with Zainab elected manager. Problems emerge when money goes missing and Zainab suspects Masood, thinking he has done this before. Tamwar admits taking the money – lending it to his older brother, Syed. Masood reveals that Syed's actions are why he was banished from the family; he stole money from the family business and is continuing to do so. Despite this, Zainab contacts Syed and after reconciling with Masood, Syed moves to Albert Square and is joined by his fiancé Amira Shah (Preeya Kalidas). Zainab plans an extravagant wedding for Syed but she grows suspicious of the way Christian acts around him, and is incensed to discover they are having a homosexual relationship. Zainab orders Syed to marry Amira regardless, which he does. Zainab gives birth to another son, Kamil, in 2010, but the family's joy is short-lived as Amira discovers Syed's affair with Christian and Syed comes out as gay. Amira leaves, and Christian's sister, Jane Beale (Laurie Brett), reveals to Masood that Zainab knew about the affair since before the wedding. Masood and Zainab argue, and he packs her belongings and physically throws her out. When the couple reconcile, they cut-off ties to their son, unable to accept his relationship with Christian.", "Zainab is portrayed as a \"tough-talking businesswoman\". Described as \"Walford's answer to Sir Alan Sugar\", Zainab has a \"direct manner\" with \"a tongue that could cut glass\", which can be \"hugely intimidating\".\"Zainab Masood\", BBC.  This became evident shortly after the character's introduction, when Zainab become embroiled in an ongoing feud with her employee Denise Wicks (Diane Parish). An EastEnders spokesperson has commented: \"[Zainab's] not there to make friends\"."]}]}}