{"wiki_id": "http://www.wikidata.org/entity/Q2217490", "itemLabel": "Sammy Chapman", "itemDescription": "Northern Irish footballer (1938-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sammy_Chapman", "wikipedia_page": {"main": "Samuel Edward Campbell Chapman (16 February 1938 – 24 July 2019) was a Northern Ireland international footballer and football manager.", "link_mentions": [{"page": "Mansfield Town F.C.", "response": ["In 1959–60 the club was relegated to the recently created Fourth Division, before gaining promotion back to the Third Division in 1962–63. This promotion was later tainted by life-time suspensions handed out to players Brian Phillips and Sammy Chapman for bribing opponents, including players of Hartlepools United in a vital match which Mansfield won 4–3. Two seasons later, the club again narrowly missed out on promotion to the Second Division. The season after avoiding relegation due to a points deduction for Peterborough United, Mansfield made another headline-grabbing cup run. Mansfield beat First Division West Ham United 3–0 in the Fifth Round of the 1968–69 FA Cup, before narrowly losing to Leicester City in the Quarter Finals. In 1971–72 Mansfield were relegated, again, to the Fourth Division."]}, {"page": "Brian Little", "response": ["Brian Little was appointed caretaker manager of Wolverhampton Wanderers on 31 August 1986 as successor to Sammy Chapman. His appointment came at the end of the blackest spell in the club's history, when three successive relegations had dragged them from the First Division to the Fourth. He oversaw a steady start to the 1986–87 season before Graham Turner was appointed manager 36 days later."]}, {"page": "Ricki Herbert", "response": ["In 1982 Herbert spent some time in England at Southampton F.C., where he made a few appearances for the reserve team and one disastrous friendly appearance for the first team.http://www.saintsfc.co.uk/page/NewsDetail/0,,10280~2071046,00.html He also had a spell in English football with Wolverhampton Wanderers from 1984 to 1986, where he made 49 appearances in total. He was signed by manager Tommy Docherty who had previously coached Herbert while manager of Sydney Olympic. However, his time at the club coincided with them sliding down the leagues; Herbert was part of the team relegated to the third tier in 1985, but left in March 1986 shortly before a successive relegation after falling out with new manager Sammy Chapman."]}, {"page": "1964 British football match-fixing scandal", "response": ["Jimmy Gauld's taped conversations were ultimately used to convict himself and the other players, the judge making it clear that he held Gauld responsible for ruining them. At the end of the trial on 26 January 1965, Gauld – described by the judge as the \"central figure\" of the case – received the heaviest sentence of four years in prison. Brian Phillips and York City wing-half Jack Fountain were each sentenced to fifteen months' imprisonment, Dick Beattie of St. Mirren received nine months', Sammy Chapman of Mansfield Town, Ron Howells of Walsall and Ken Thomson each received six-month sentences while David Layne, Tony Kay and Peter Swan each received four-month sentences.", "Sammy Chapman also returned to football, first with Portsmouth and Crewe Alexandra as a coach and then with Wolverhampton Wanderers as chief scout and then manager. He died in July 2019."]}, {"page": "Bob Hazell", "response": ["Hazell transferred to First Division rivals Leicester City in September of the 1983–84 campaign for a fee of £100,000. He helped Gordon Milne's \"Foxes\" to post a 15th-place finish in 1984–85, but became plagued by injury problems. He had a brief loan spell at old club Wolves in 1985–86, but could do little to prevent Sammy Chapman's side from slipping into the Fourth Division. He left Filbert Street and moved on to Second Division side Reading for the 1986–87 season, but made just four league appearances for Ian Branfoot's \"Royals\", before leaving Elm Park."]}, {"page": "Northern Ireland national football B team", "response": ["The Northern Ireland 'B' team made its first appearance in 1957, playing against Romania 'B' who were not deemed worthy of a 'Full' international (note: Romania was commonly referred to as Rumania in the English language up until the 1980s).  The occasion of October 23, 1957 marked the first use of the Windsor Park floodlights for an international fixture.  A one sided match finished 6-0 with a hat-trick from Derek Dougan and further goals from Sammy McCrory, Sammy Chapman and Jackie Scott.", "|| 23 October 1957  || Romania B        || 6-0 || Windsor Park, Belfast || Sammy McCrory, Sammy Chapman, Derek Dougan 3, Jackie Scott"]}, {"page": "Black Country derby", "response": ["| 1986 || 1 || 0 || 1 || 0 ||align=\"left\"|  Sammy Chapman"]}]}}