{"wiki_id": "http://www.wikidata.org/entity/Q2218817", "itemLabel": "Samuel Rowbotham", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Samuel_Rowbotham", "wikipedia_page": {"main": "Samuel Birley Rowbotham (; 1816 – 23 December 1884, in London) was an English inventor, writer and socialist  who wrote Zetetic Astronomy: Earth Not a Globe under the pseudonym Parallax. His work was originally published as a 16-page pamphlet (1849), and later expanded into a book (1865). \nRowbotham's method, which he called zetetic astronomy, models the Earth as a flat disc centered at the North Pole and bounded along its perimeter by a wall of ice, with the Sun, Moon, planets, and stars moving only several thousand miles above the surface of Earth.", "link_mentions": [{"page": "Flat Earth", "response": ["* English writer Samuel Rowbotham (1816–1885), writing under the pseudonym \"Parallax\", produced in 1849 a pamphlet \"Zetetic Astronomy\" arguing for a flat Earth and published results of many experiments that tested the curvatures of water over a long-drainage ditch, followed by another, called The inconsistency of Modern Astronomy and its Opposition to the Scripture. One of his supporters, John Hampden, lost a bet to Alfred Russel Wallace in the famous Bedford Level experiment, which attempted to prove it. In 1877, Hampden produced a book A New Manual of Biblical Cosmography. Rowbotham also produced studies that purported to show that the effects of ships disappearing below the horizon could be explained by the laws of perspective in relation to the human eye. In 1883, he founded Zetetic Societies in England and New York, to which he shipped a thousand copies of Zetetic Astronomy."]}, {"page": "Modern flat Earth beliefs", "response": ["Modern flat Earth belief originated with the English writer Samuel Rowbotham (1816–1884). Based on conclusions derived from the Bedford Level experiment, Rowbotham published a pamphlet titled Zetetic Astronomy. He later expanded this into the book Earth Not a Globe, proposing the Earth is a flat disc centred at the North Pole and bounded along its southern edge by a wall of ice, Antarctica. Rowbotham further held that the Sun and Moon were  above Earth and that the \"cosmos\" was  above the Earth. He also published a leaflet titled The Inconsistency of Modern Astronomy and its Opposition to the Scriptures, which argued that the \"Bible, alongside our senses, supported the idea that the earth was flat and immovable and this essential truth should not be set aside for a system based solely on human conjecture\"."]}, {"page": "Parallax (disambiguation)", "response": ["*Samuel Rowbotham (1816–1864), who used the pseudonym \"Parallax\" when promoting flat-earth pseudoscientific theories"]}, {"page": "Denialism", "response": ["Adherents of the modern flat-Earth model propose that a dome-shaped firmament encloses a disk-shaped Earth. They may also claim, after Samuel Rowbotham, that the Sun is only 3,000 miles above the Earth and that the Moon and the Sun orbit above the Earth rather than around it. Modern flat-Earthers believe that Antarctica is not a continent but a massive ice flow, with a wall 150 feet or higher, which circles the perimeter of the Earth and keeps everything (including all the oceans' water) from falling off the edge."]}, {"page": "Sameul Rowbotham", "response": ["#REDIRECT Samuel Rowbotham"]}, {"page": "Samuel Birley Rowbotham", "response": ["#REDIRECT Samuel Rowbotham"]}, {"page": "Henry Yule Oldham", "response": ["In 1838 Samuel Rowbotham of the Universal Zetetic Society had claimed to demonstrate that a six-mile length of the Old Bedford River, Cambridgeshire, had a flat surface and not, as would be expected if the earth were a sphere, a curved one. In 1870 on the same spot the noted explorer Alfred Russel Wallace, a trained surveyor, soundly disproved the observation, but the mystery was not allowed to rest and Rowbotham's supporters continued to argue their case with great vigour in the courts, in scientific journals and in pamphlets. In 1901 Oldham used a plate camera and theodolite for his careful observations along the length of the river and he presented his results at an illustrated lecture held at the British Association for the Advancement of Science. His experiment, because of its photographic proof, is regarded as definitive and was taught in schools until images taken from orbiting satellites became available."]}, {"page": "Rowbotham", "response": ["* Samuel Rowbotham (1816–1884), English inventor and writer, advocate for a flat earth"]}, {"page": "Beckenham Crematorium and Cemetery", "response": ["* Samuel Rowbotham, known as Parallax"]}, {"page": "Category talk:Flat Earth", "response": [":There have been (and are) more modern proponents of the flat earth theory, especially since the writings and teachings of Samuel Rowbotham in the 19th century; they call themselves \"Zetetics\", and they typically advance their arguments by (1) recourse to the Bible, and (2) purporting to \"prove\" that the earth is flat using scientific methodology. According to pseudoscience, it includes \"methodology, belief, or practice that is claimed to be scientific, or that is made to appear scientific, but which does not adhere to an appropriate scientific methodology, lacks supporting evidence or plausibility, or otherwise lacks scientific status\". See the Bedford Level experiment for a great example. Good Ol’factory (talk) 22:16, 20 April 2010 (UTC)"]}, {"page": "William Carpenter (flat-Earth theorist)", "response": ["Carpenter was a proponent of English writer Samuel Rowbotham (1816–1885), who produced a pamphlet, with Carpenter's assistance, called Zetetic Astronomy in 1849 arguing for a flat Earth and published results of many experiments that tested the curvatures of water over a long drainage ditch, followed by another, called The inconsistency of Modern Astronomy and its Opposition to the Scripture. Rowbotham also produced studies, mostly printed by Carpenter, that purported to show the effects of ships disappearing below the horizon could be explained by the laws of perspective in relation to the human eye."]}, {"page": "Samuel Shenton", "response": ["* Samuel Rowbotham"]}, {"page": "Lady Elizabeth Blount", "response": ["After Samuel Rowbotham's death in 1884, Blount became the President of the Universal Zetetic Society, whose objective was \"the propagation of knowledge related to Natural Cosmogony in confirmation of the Holy Scriptures, based on practical scientific investigation\". Blount's title and money was said to have attracted an archbishop, several colonels, a Major-General to the membership. The society published a magazine, The Earth Not a Globe Review, and remained active well into the early 20th century. A flat Earth journal, Earth: a Monthly Magazine of Sense and Science, was published between 1901 and 1904, edited by Lady Blount.", "* Samuel Rowbotham"]}, {"page": "Mark Sargent (flat Earth proponent)", "response": ["* Samuel Rowbotham"]}]}}