{"wiki_id": "http://www.wikidata.org/entity/Q2213593", "itemLabel": "Anne Scott-James", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Anne_Scott-James", "wikipedia_page": {"main": "Anne Eleanor Scott-James, Lady Lancaster (5 April 1913 – 13 May 2009)\nwas a British journalist and author. She was one of Britain's first woman career journalists, editors and columnists, and latterly author of a series of gardening books.", "link_mentions": [{"page": "Gardening", "response": ["Cottage gardens, which emerged in Elizabethan times, appear to have originated as a local source for herbs and fruits. One theory is that they arose out of the Black Death of the 1340s, when the death of so many laborers made land available for small cottages with personal gardens. According to the late 19th-century legend of origin,Anne Scott-James, The Cottage Garden (London: Lane) 1981, de-mythologised the origins of the English cottage garden, and its treasured topiary among the vegetables and flowers, popularly supposed to represent heirlooms from the seventeenth century. these gardens were originally created by the workers that lived in the cottages of the villages, to provide them with food and herbs, with flowers planted among them for decoration. Farm workers were provided with cottages that had architectural quality set in a small garden—about —where they could grow food and keep pigs and chickens.A Biographical Dictionary of British Architects, 1600–1840, Howard Colvin, Yale University Press, 2008"]}, {"page": "1981 in literature", "response": ["*Anne Scott-James – The Cottage Garden"]}, {"page": "My Word!", "response": ["The programme ran for 38 series, until 1988. Muir and Norden were in every series, always on opposing teams. As Muir's partner, Barnett was succeeded during the first series by the novelist and critic E. Arnot Robertson. On Robertson's death in 1961 the film critic and Greek scholar Dilys Powell took her place until the show finished, when she was aged 87. Norden's first partner was Nancy Spain; after her death in 1964 she was succeeded by the journalist Anne Scott-James, and then from 1979 by the historian Antonia Fraser. In the one season in which Fraser took the chair her place as Norden's teammate was taken by Irene Thomas.\"My Word!\", BBC Genome. Retrieved 3 May 2021", "|Muir, Norden, Powell, Anne Scott-James, Spain"]}, {"page": "Sissinghurst Castle Garden", "response": ["The gardens contain an internationally respected plant collection, particularly the assemblage of old garden roses. The writer Anne Scott-James considered the roses at Sissinghurst to be \"one of the finest collections in the world\". A number of plants propagated in the gardens bear names related to people connected with Sissinghurst or the name of the garden itself. The garden design is based on axial walks that open onto enclosed gardens, termed \"garden rooms\", one of the earliest examples of this gardening style. Among the individual \"garden rooms\", the White Garden has been particularly influential, with the horticulturalist Tony Lord describing it as \"the most ambitious ... of its time, the most entrancing of its type.\"", "Sackville-West and Nicolson found Sissinghurst in April 1930, after Dorothy Wellesley, their near neighbour and a former lover of Sackville-West's, saw the estate for sale. They had become increasingly concerned about encroaching development near their property Long Barn, near Sevenoaks, Kent. Their offer on Sissinghurst was accepted on 6 May and the castle and the farm around it were bought for £12,375, using only Sackville-West's money rather than Nicolson's. The property was  in total. The house had no electricity, running water, or drains, and the garden was in disarray. Anne Scott-James notes their \"planting inheritance\" as \"a grove of nut-trees, some apple trees, a quince [and] a tangle of old roses\". The physical assets on the site were \"four buildings of beautiful mellow brick, part of a moat [and] various fine walls\". Clearing the ground took almost three years, but by 1939 the garden was largely complete, with the exception of the White Garden. Nicolson was responsible for the design and layout, while Sackville-West, at the head of her team of gardeners, undertook the planting. Simon Jenkins, the architectural writer, describes Nicolson's design as \"post-Picturesque, a garden not as an imitation of nature but as imitation of a house\", and suggests his thinking was much influenced by Lawrence Johnston's garden at Hidcote. Sackville-West's approach was plant-centred, within the constraints of her husband's plan, \"profusion, even extravagance and exuberance, within confines of the utmost linear severity\".", "The National Trust took over the whole of Sissinghurst – its garden, farm, and buildings – in 1967. Since then, the number of visitors has steadily increased. Anne Scott-James,  the author of the first non-Nicolson history of the garden, records 13,200 visitors in 1961, the year of Sackville-West's death, 47,100 in 1967, when the castle passed to the Trust, and 91,584 by 1973. It is now among the Trust's most popular properties, receiving nearly 200,000 visitors in 2017. Although the increased foot traffic has necessitated the replacement of the grass paths with York paving stones, the entry fees generate considerable income which, under the terms of the handover, can only be expended on Sissinghurst. In 2008, Adam Nicholson described the estate as \"better funded than it has been since the 16th century\". Major works of reconstruction, such as the restoration of the Tower brickwork, and the cataloguing and conservation of the collection of books in the library, have been made possible by the availability of these funds.", "Although the estate as a whole is , the gardens themselves occupy only . Anne Scott-James sets out the principles of the design: \"a garden of formal structure, of a private and secret nature, truly English in character, and plant[ed] with romantic profusion\". As gardeners and landscapers, both Sackville-West and Nicolson were amateurs. Nicolson largely undertook the design and Sackville-West the planting. The landscape is designed as a series of \"garden rooms\", each with a different character of colour or theme, the enclosures being high clipped hedges and pink brick walls. The rooms and \"doors\" are so arranged as to offer glimpses into other parts of the garden.", "The Rose Garden was constructed on the site of the old kitchen garden from 1937. It terminates the north–south axis running from the White Garden and concludes with a brick wall, designed by A. R. Powys and known as the Powys Wall, constructed in 1935. Old garden roses, those bred before 1867, formed the heart of the garden's planting. Such roses appealed not only for their lavish appearance, but also for their history. The informal and unstructured massing of the plants was Sackville-West's deliberate choice, and has become one of Sissinghurst's defining features. Roses were supplied by, among others, Hilda Murrell of Edwin Murrell Ltd., notable rose growers in Shropshire, and the florist Constance Spry from her home Winkfield Place. In addition to using established suppliers and receiving plants as gifts from friends, Sackville-West sometimes sourced specimens herself. Sarah Raven records Sackville-West digging up the hybrid perpetual rose 'Souvenir du Docteur Jamain' at an old nursery; Anne Scott-James noted that the rose had passed out of commerce and it was Sackville-West who returned it to cultivation. The Rose Garden is divided by the Roundel, constructed of yew hedging by Nicolson and Nigel in 1933. As elsewhere in the garden, the Trust has replaced the original grass paths with stone and brick, to cope with the increases in visitor numbers. Scott-James considered the roses in the Rose Garden \"one of the finest collections in the world\". The writer Jane Brown describes the Rose Garden, more than any other including the White, as expressing \"the essence of Vita's gardening personality, just as her writing-room enshrines her poetic ghost\"."]}, {"page": "Picture Post", "response": ["Hopkinson said that his photographers were thoroughbreds and that text could always be written after the event, but if his photographers did not come back with good pictures, he had nothing to work with. Years later, Hopkinson said that the greatest photos he ever received to lay out were Bert Hardy's images from the Korean War's Battle of Incheon, which James Cameron wrote the article for. The magazine's greatest photographers included Hardy, Kurt Hutton, Felix H. Man (aka Hans Baumann), Francis Reiss, Thurston Hopkins, John Chillingworth, Grace Robertson, and Leonard McCombe, who eventually joined Life Magazine's staff. Staff writers included MacDonald Hastings, Lorna Hay, Sydney Jacobson, J. B. Priestley, Lionel Birch, James Cameron, Fyfe Robertson, Anne Scott-James, Robert Kee and Bert Lloyd. Many freelancer writers contributed as well, including George Bernard Shaw, Dorothy Parker, and William Saroyan."]}, {"page": "Elizabeth David", "response": ["Veronica Nicholson, a friend with connections in the publishing trade, persuaded David to continue writing, with the aim that she write a book.Cooper, p. 139 She showed some of David's work to Anne Scott-James, the editor of the British edition of Harper's Bazaar, who thought the writing showed a widely travelled person with an independent mind. She offered David a contract, and David's work began appearing in the publication from March 1949.Cooper, pp. 139–140; and Chaney, pp. 235–236"]}, {"page": "Max Hastings", "response": ["Hastings' parents were Macdonald Hastings, a journalist and war correspondent and Anne Scott-James, sometime editor of Harper's Bazaar. He was educated at Charterhouse and University College, Oxford, which he left after a year."]}, {"page": "Cottage garden", "response": ["Cottage gardens, which emerged in Elizabethan times, appear to have originated as a local source for herbs and fruits. One theory is that they arose out of the Black Death of the 1340s, when the death of so many laborers made land available for small cottages with personal gardens. According to the late 19th-century legend of origin,Anne Scott-James, The Cottage Garden (London: Lane) 1981, de-mythologised the origins of the English cottage garden, and its treasured topiary among the vegetables and flowers, popularly supposed to represent heirlooms from the seventeenth century. these gardens were originally created by the workers that lived in the cottages of the villages, to provide them with food and herbs, with flowers planted in for decoration. Helen Leach analysed the historical origins of the romanticised cottage garden, subjecting the garden style to rigorous historical analysis, along with the ornamental potager and the herb garden. She concluded that their origins were less in workingmen's gardens in the 19th century and more in the leisured classes' discovery of simple hardy plants, in part through the writings of John Claudius Loudon. Loudon helped to design the estate at Great Tew, Oxfordshire, where farm workers were provided with cottages that had architectural quality set in a smallholding or large garden—about an acre—where they could grow food and keep pigs and chickens.A Biographical Dictionary of British Architects, 1600–1840, Howard Colvin, Yale University Press, 2008 , p 659"]}, {"page": "St Paul's Girls' School", "response": ["* Anne Scott-James – journalist and editor"]}, {"page": "Osbert Lancaster", "response": ["Karen Lancaster died in 1964. They were markedly different in character, she quiet and home-loving, he extrovert and gregarious, but they were devoted to each other, and her death left him devastated.Boston, p. 77 Three years later he married the journalist Anne Scott-James; they had known each other for many years, although at first she did not much like him, finding him \"stagey\" and \"supercilious\". By the 1960s they had become good friends, and after Karen died the widowed Lancaster and the divorced Scott-James spent increasing amounts of time together. Their wedding was at the Chelsea Register Office on 2January 1967.\"Osbert Lancaster\", The Daily Telegraph, 3 January 1967, p. 13 After their marriage they kept his Chelsea flat, and lived at weekends in her house in the Berkshire village of Aldworth, the house in Henley having been sold.Boston, pp. 229–230", "*  (co-written with Anne Scott-James)"]}, {"page": "Macdonald Hastings", "response": ["He married Anne Scott-James, a columnist and later magazine editor. They had two children: Max and Clare. Max followed in the footsteps of his father and grandfather as a journalist as did Clare initially before becoming an author. Macdonald and Anne Hastings divorced in 1964."]}, {"page": "Rolfe Arnold Scott-James", "response": ["His daughter Anne Scott-James also became a prominent journalist. The military historian Max Hastings is his grandson."]}, {"page": "Ann Scott-James", "response": ["#REDIRECT Anne Scott-James"]}, {"page": "Anne Scott James", "response": ["#REDIRECT Anne Scott-James"]}, {"page": "Deaths in May 2009", "response": ["*Anne Scott-James, 96, British journalist and author, widow of Sir Osbert Lancaster."]}, {"page": "Anne scott james", "response": ["#REDIRECT Anne Scott-James"]}, {"page": "Anne scott-james", "response": ["#REDIRECT Anne Scott-James "]}, {"page": "Gordon McKenzie (journalist)", "response": ["After working for Denis Hamilton, editorial director of Kemsley Newspapers and alongside the group's Foreign Manager Ian Fleming he was given his first editorship at the Sunday Chronicle in 1950: at the age of 33 McKenzie was Fleet Street's youngest editor.  He then edited the Sunday Graphic from 1953-58 where his ideas and production flair attracted the attention of the then Lord Rothermere Esmond Harmsworth. He took up a new editorship at the Sunday Dispatch before moving to the Daily Mail in 1958 as assistant editor. He directed an internationally envied, intellectually diverse team of writers. Among them were Bernard Levin, Vincent Mulchrone, Shirley Conran, Godfrey Winn, Anne Scott-James, Quentin Crew, Barry Norman and Lynda Lee-Potter.  As executive editor in the 1970s and early 1980s, he headed the features department and was a key figure in the Femail marketing policy of attracting women readers without alienating its male readership."]}, {"page": "Anne James", "response": ["*Anne Scott-James"]}, {"page": "Maudie Littlehampton", "response": ["Various candidates have been proposed as the model for Maudie. They include Patsy, wife of the second Lord Jellicoe, Maureen, Countess of Dufferin and Ava,Howard, p. 18 an ex-actress, Pru Wallace, with whom Lancaster had been briefly emotionally entangled during the war,Knox, p. 59 and Anne Scott-James, whom Lancaster had known for many years before their marriage in 1967.Whitehorn, Katharine.  \"James [married names Verschoyle, Hastings, Lancaster, Anne Eleanor Scott-, Lady Lancaster (1913–2009), journalist and author\"] , Oxford Dictionary of National Biography, Oxford University Press, retrieved 22 February 2018.  Lancaster maintained that she was not based on any one real person.Knox, p. 67"]}, {"page": "Anne Scott-James, Lady Lancaster", "response": ["#REDIRECT Anne Scott-James"]}, {"page": "Clare Hastings", "response": ["She is the daughter of Macdonald Hastings and Anne Scott-James, and sister to Max Hastings."]}]}}