{"wiki_id": "http://www.wikidata.org/entity/Q2224233", "itemLabel": "Sara Wheeler", "itemDescription": "author", "wikipedia_url": "https://en.wikipedia.org/wiki/Sara_Wheeler", "wikipedia_page": {"main": "Sara Diane Wheeler  (born 20 March 1961) is an English travel author and biographer, noted for her accounts of polar regions.\n\n", "link_mentions": [{"page": "Royal Society of Literature", "response": ["| Sara Wheeler"]}, {"page": "University of North Dakota Writers Conference", "response": ["| Sara Wheeler"]}, {"page": "Denys Finch Hatton", "response": ["* Too Close to the Sun: The Life and Times of Denys Finch Hatton (2006) by Sara Wheeler "]}, {"page": "Great Lives", "response": ["|Sara Wheeler, author"]}, {"page": "Redland High School for Girls", "response": ["* Sara Wheeler (20 March 1961–) is a travel writer. After being a pupil at Redland High she went on to study Classics and Modern Languages at Brasenose College, University of Oxford. After writing about her travels on the Greek island of Euboea and in Chile, she was accepted by the US National Science Foundation as their first female writer-in-residence at the South Pole and spent seven months in Antarctica."]}, {"page": "The Museum of Curiosity", "response": ["*Sara Wheeler"]}, {"page": "List of Brasenose College, Oxford people", "response": ["* Sara Wheeler, English travel writer and biographer"]}, {"page": "March 20", "response": ["*  1961   – Sara Wheeler, English author and journalist"]}, {"page": "Edward Stanford Travel Writing Awards", "response": ["* Sara Wheeler, Mud and Stars", "* Sara Wheeler, O My America!"]}, {"page": "Huw Lewis-Jones", "response": ["The documentary Wilderness Explored, produced by Jeremy Bristow, aired on the BBC in October 2008 and received widespread critical acclaim. Scotsman online review It was 'Critics Choice' in The Sunday Times, 'Pick of the Week' in The Independent and 'Digital Pick of the Week' in The Telegraph. The Guardian declared it 'a glorious documentary' and The Radio Times described the work as 'an entrancing piece of cultural history'. Guardian online review In 2011, Lewis-Jones provided expert commentary in Robert Murphy's film for BBC Four, Of Ice and Men, alongside Sir Ranulph Fiennes and authors Sara Wheeler and Francis Spufford, tracing the way that Antarctica has captured the imagination over the centuries.BBC Website Of Ice and MenRadio Times review"]}, {"page": "Eilidh McCreadie", "response": ["| Sara Wheeler journeys to the collar of lands around the Arctic Ocean, searching for the truth behind the perceptions of this \"place of greatest dignitie\". She examines some of the myths and legends of this sparsely populated area and how preconceptions match up to the reality."]}, {"page": "Iceland Writers Retreat", "response": ["*2014: Randy Boyagoda, Joseph Boyden, Geraldine Brooks, Andrew Evans, Susan Orlean, Iain Reid, James Scudamore, Sara Wheeler"]}, {"page": "Wheeler, Sara", "response": ["#redirectSara Wheeler"]}, {"page": "Denis G. Lillie", "response": ["Lillie was described by Cherry-Garrard's biographer Sara Wheeler as popular yet perhaps the most unconventional person on the expedition, deeply intellectual yet eccentric. He believed in reincarnation, and claimed he had been a Persian and a Roman in previous lives. His nicknames on board included \"Lithley, \"Lithi\", and \"Hercules\"."]}]}}