{"wiki_id": "http://www.wikidata.org/entity/Q2224483", "itemLabel": "Sarah Radclyffe", "itemDescription": "British film producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Radclyffe", "wikipedia_page": {"main": "Sarah Radclyffe (born 14 November 1950), sometimes credited as Sarah Radcliffe, is a British film producer.She began working as associative producer in the late 1970s on such films as The Tempest (1979) directed by Derek Jarman.\nFrom 1983 to 1984 she worked on the series The Comic Strip Presents and in 1984 she founded the production company Working Title Films together with business partner Tim Bevan. The company's first significant production, Stephen Frears film My Beautiful Laundrette, was released in 1985. The other theatrical films on which Sarah Radclyffe served as executive producer include Caravaggio (1986), Wish You Were Here (1987), Sammy and Rosie Get Laid (1988), A World Apart (1988), Edward II (1991), Sirens (1994), Second Best (1994), Les Misérables (1998), The Lost Son (1999) and The War Zone (1999) for which she was nominated for the European Film Award. She was also executive producer of Cirque du Freak: The Vampire's Assistant which was released in 2009.\nShe has been married to William Penton Godfrey since 1996 and has two sons, Sam and Callum.As of 2018 Radclyffe is a trustee of Anno's Africa, the children's arts charity.", "link_mentions": [{"page": "British Independent Film Awards", "response": ["The British Independent Film Awards (BIFA) were created in 1998 by Elliot Grove and Suzanne Ballantyne of the Raindance Film Festival, with the aim of celebrating merit and achievement in independently funded British filmmaking, honouring new talent and promoting British films and filmmaking to a wider public audience. BIFA founding members include Phillip Alberstat, Chris Auty, André Burgess, Sally Caplan, Pippa Cross, Christopher Fowler, Lora Fox Gamble, Steven Gaydos, Norma Heyman, Emma E. Hickox, Fred Hogge, Robert Jones, Steve Kenis, Alberto Lopez, Ollie Madden, Hamish McAlpine, Neil McCartney, Saul Metzstein, Martin Myers, Sarah Radclyffe, Tracey Scoffield, Mark Shivas, Jim Wilson, and Michiyo Yoshizaki."]}, {"page": "Working Title Films", "response": ["Working Title is a British film and television production company owned by Universal Pictures. The company was founded by Tim Bevan and Sarah Radclyffe in 1983. It produces feature films and several television productions. Bevan and Eric Fellner are now the co-chairmen of the company.", "Working Title Films was co founded by producers Tim Bevan and Sarah Radclyffe in 1983. Radclyffe left in 1992, PolyGram became the company's corporate backer, and Eric Fellner, a fellow independent film producer, joined the company."]}, {"page": "Tim Bevan", "response": ["Bevan co-founded Working Title Films in London with Sarah Radclyffe and Graham Bradstreet in the 1980s. (Eric Fellner now partners Tim Bevan at Working Title Films). Among Bevan's more than 40 films as producer or executive producer are Moonlight and Valentino, Fargo, O Brother, Where Art Thou?, The Guru, Captain Corelli's Mandolin, Love Actually, Notting Hill, Elizabeth, Bridget Jones's Diary, Atonement, and Frost/Nixon. Through 2017, the films he has co-produced have grossed a total of almost $7 billion worldwide."]}, {"page": "The War Zone", "response": ["| 1999 European Film Awards || Best Film – Dixie Linder, Sarah Radclyffe (nominated)"]}, {"page": "Regency Enterprises", "response": ["|co-production with Alcor Films and Sarah Radclyffe/Fron Film"]}, {"page": "The Icemark Chronicles", "response": ["The Icemark Chronicles is a series of books consisting of The Cry of the Icemark, followed by Blade of Fire, and Last Battle of the IcemarkAmazon.co.uk: The Last Battle of the Icemark (Icemark Chronicles): Books: Stuart Hill and the prequel called Prince Of The Icemark. The books were written by Stuart Hill from Leicester. Fox 2000 Pictures optioned the film rights to the book. The film was set to be produced by Courtney Pledger and Sarah Radclyffe, but it is unknown if or when it will be released. The books are published by Chicken House."]}, {"page": "1950 in the United Kingdom", "response": ["* 14 November – Sarah Radclyffe, production manager and producer"]}, {"page": "Second Best (film)", "response": ["Second Best is a 1994 British film produced by Sarah Radclyffe and directed by Chris Menges. It closely follows the 1991 novel of the same name by David Cook, who also wrote the screenplay."]}, {"page": "Sarah Radcliffe", "response": ["*Sarah Radclyffe, English film producer sometimes credited as Sarah Radcliffe"]}, {"page": "Don Boyd", "response": ["In 1977 Boyd established his own production company, Boyd's Co., which over the next decade produced a series of British films including Alan Clarke's Scum, Derek Jarman's The Tempest, Lindsay Anderson's Look Back in Anger and Julien Temple's The Great Rock 'n' Roll Swindle. During this time his company featured the work of such actors, writers, directors, producers, cinematographers and musicians as John Hurt, Ray Winstone, Dame Helen Mirren, Tilda Swinton, Stephen Fry, Michael Tolkin, Jeremy Thomas, Sarah Radclyffe, Bridget Fonda, Kathy Burke, The Edge, and The Sex Pistols."]}, {"page": "Debra Hayward", "response": ["|Assistant to Sarah Radclyffe"]}, {"page": "Stephen Plaice", "response": ["Paul Taylor,\"Pack your bags for a trip to Greeneland\", The Independent (London), 20 July 1994 and transferred to Battersea Arts Centre and to the Lyric Theatre Studio Hammersmith before going on to tour nationally. It was successfully revived in expanded form in the Paganini Ballroom, Barcelo Brighton Old Ship Hotel, in 2008. His short play The Last Post originally produced by Shaker was made into a film by Sarah Radclyffe Productions in 1995 and nominated for a BAFTA. The film was directed by Ed Blum."]}, {"page": "European Film Award for European Discovery of the Year", "response": ["| The War Zone || Tim Roth|| Sarah Radclyffe, Dixie Linder|| ,  "]}, {"page": "List of abandoned and unfinished films", "response": ["| 2001 || Lily and the Secret Planting || Hettie Macdonald || Lucinda Coxon || Sarah Radclyffe || Winona Ryder, Gael Garcia Bernal || Shut down after four days when Winona Ryder was taken to the hospital with \"a gastric infection.\" Kate Winslet was announced as her replacement, but the film was never restarted. || "]}, {"page": "1994 Toronto International Film Festival", "response": ["*Second Best — Sarah Radclyffe"]}, {"page": "Radclyffe, Sarah", "response": ["#redirectSarah Radclyffe"]}, {"page": "Sarah Radcliffe (film producer)", "response": ["#REDIRECT Sarah Radclyffe"]}]}}