{"wiki_id": "http://www.wikidata.org/entity/Q2221868", "itemLabel": "Andrew Parker Bowles", "itemDescription": "British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Parker_Bowles", "wikipedia_page": {"main": "Brigadier Andrew Henry Parker Bowles  (born 27 December 1939) is a retired British Army officer. He is the former husband of Camilla, Duchess of Cornwall, later a member of the British royal family.", "link_mentions": [{"page": "Anne, Princess Royal", "response": ["In 1970, she briefly had a relationship with Andrew Parker Bowles, who later married Camilla Shand. Shand much later married Anne's brother, Prince Charles, as his second wife. Anne was also briefly linked to Olympic equestrian Richard Meade."]}, {"page": "Camilla, Duchess of Cornwall", "response": ["Camilla was raised in East Sussex and South Kensington in England, and was educated in England, Switzerland, and France. In 1973, she married British Army officer Andrew Parker Bowles, with whom she has two children. They divorced in 1995. Camilla was periodically romantically involved with Charles both before and during each of their first marriages. Their relationship became highly publicised in the media and attracted worldwide scrutiny.Charles and Camilla: Portrait of a Love Affair, by biographer Gyles Brandreth, depicts Charles and Camilla's relationship as controversial due to its longevity. The book shows, throughout, the media's interest in the couple and representation of them to the public. In 2005, Camilla married Charles in the Windsor Guildhall, which was followed by a televised Anglican blessing at St George's Chapel in Windsor Castle.", "In the late 1960s, Camilla met Andrew Parker Bowles (then a Guards officer and lieutenant in the Blues and Royals) through his younger brother, Simon Parker Bowles, who worked for her father's wine firm in Mayfair. After an on-and-off relationship for years, Andrew and Camilla's engagement was announced in The Times in 1973.Graham, p. 38 Sally Bedell Smith claimed that the announcement was sent out by the pair's parents without their knowledge, which forced Andrew to propose. They married on 4 July 1973 that year in a Roman Catholic ceremony at the Guards Chapel, Wellington Barracks, in London. Camilla was 25 years old and Parker Bowles 33. Her wedding dress was designed by British fashion house Bellville Sassoon, and the bridesmaids included Parker Bowles' goddaughter Lady Emma Herbert.\"Major A.H. Parker Bowles and Miss C.R. Shand\", The Times, 5 July 1973. It was considered the \"society wedding of the year\"Graham, p. 39 with eight hundred guests in attendance. Royal guests present at the ceremony and reception included Princess Anne, Queen Elizabeth The Queen Mother, and Princess Margaret, Countess of Snowdon.", "In December 1994, after 21 years of marriage, Camilla and her husband both issued divorce proceedings on the grounds they had been living separately for years. In July of that year, her mother Rosalind had died from osteoporosis, and her father later described this as a \"difficult time for her\". Their petition was heard and granted in January 1995 at the High Court Family Division in London. The divorce was finalised in March 1995. A year later, Andrew Parker Bowles married Rosemary Pitman (who died in 2010).Graham, p. 284", "Camilla and Prince Charles reportedly met in mid-1971. Andrew Parker Bowles had ended his relationship with Camilla in 1970 and was courting Princess Anne, Charles's sister. Though Camilla and Charles belonged to the same social circle and occasionally attended the same events, they had not formally met. Their biographer Brandreth states the couple did not first meet at a polo match, as it has been commonly believed.Mayer, p. 98 Instead, they first met at the home of their friend Lucía Santa Cruz, who formally introduced them.>Mayer, pp. 97–98 They became close friends and eventually began seeing one another, which was well known within their social circle.Graham, p. 29 When they became a couple, they regularly met at polo matches at Smith's Lawn in Windsor Great Park, where Charles often played polo. They also became part of a set at Annabel's in Berkeley Square. As the relationship grew more serious, Charles met Camilla's family in Plumpton and he introduced her to some members of his family.Graham, pp. 32–33 The relationship was put on hold after Charles travelled overseas to join the Royal Navy in early 1973, and ended abruptly afterward.", "There have been different statements on why the couple's relationship ended in 1973. Robert Lacey wrote in his 2008 book Royal: Her Majesty Queen Elizabeth II that Charles had met Camilla too early, and that he had not asked her to wait for him when he went overseas for military duties.Lacey, p. 268 Sarah Bradford wrote in her 2007 book Diana that a member of the close circle of his great-uncle Lord Mountbatten claimed Mountbatten arranged for Charles to be taken overseas to end the relationship with Camilla, to make way for an engagement between Charles and his granddaughter Amanda Knatchbull. Some sources suggest Queen Elizabeth The Queen Mother did not approve of the match with Camilla because she wanted Charles to marry one of the Spencer family granddaughters of her close friend Lady Fermoy. Other sources also suggest Camilla did not want to marry Charles but instead wanted to marry Andrew Parker Bowles, having had an on-and-off relationship with Parker Bowles since the late 1960s, or that Charles had decided he would not marry until he was thirty years old."]}, {"page": "Zara Tindall", "response": ["Zara Anne Elizabeth Phillips was born on 15 May 1981 at 8:15 pm in the Lindo Wing of St Mary's Hospital, London. She was christened on 27 July 1981, at Windsor Castle; her first name was suggested by her uncle, the Prince of Wales. Her godparents are her maternal uncle, the Duke of York; the Countess of Lichfield; Helen, Lady Stewart, the wife of Sir Jackie Stewart; Andrew Parker Bowles; and Hugh Thomas. She has an elder brother, Peter, and two younger half-sisters, Felicity Wade (née Tonkin; from her father's affair with Heather Tonkin) and Stephanie Phillips, from her father's second marriage to Sandy Pflueger."]}, {"page": "Lucian Freud", "response": ["On November 10, 2015 Freud's 2004 painting The Brigadier, a portrait of Andrew Parker Bowles in his British Royal Army uniform sold for $34.89 million US at Christie's in New York City, beating the $30 million US presale estimate for the work."]}, {"page": "Earl of Macclesfield", "response": ["Brigadier Andrew Parker Bowles, first husband of the Duchess of Cornwall, is the son of Derek Henry Parker-Bowles (who assumed his mother's maiden surname of Bowles), grandson of Reverend the Hon. Algernon Robert Parker, third son of the sixth Earl. Consequently, he is in distant remainder to the earldom and its subsidiary titles. Another member of the family was the Right Reverend Wilfrid Parker (1883–1966), son of the Hon. Cecil Thomas Parker, second son of the sixth Earl. He served as Bishop of Pretoria (1933-1950)."]}, {"page": "Peter Wood, 3rd Earl of Halifax", "response": ["In 1976, Lord Halifax (then Lord Irwin) (who had once been minded for a potential husband of Princess Anne) married Camilla Younger, of the Scottish brewing family, former wife of Richard Parker Bowles (married in 1973 and divorced in 1976), a younger brother of Andrew Parker Bowles, first husband of Camilla, The Duchess of Cornwall. Andrew also had a dalliance with Princess Anne. The Countess of Halifax and The Duchess of Cornwall are former sisters-in-law."]}, {"page": "Household Cavalry", "response": ["* Andrew Parker Bowles (Blues and Royals)"]}, {"page": "Derek Paravicini", "response": ["Paravicini is the son of Nicolas Paravicini and Mary Ann Parker Bowles, sister of Andrew Parker Bowles. Paravicini's aunt by marriage was Camilla, later Duchess of Cornwall.'Autistic pianist makes legal history after UK's last secret court opens' The Times 14 May 2010 "]}, {"page": "Corsham", "response": ["* Camilla Parker Bowles (b. 1947), and her first husband Andrew Parker Bowles"]}, {"page": "2004 in art", "response": ["*Lucian Freud – The Brigadier (portrait of Andrew Parker Bowles)"]}, {"page": "Andrew Parker-Bowles", "response": ["#REDIRECT Andrew Parker Bowles"]}, {"page": "Wedding of Prince Charles and Camilla Parker Bowles", "response": ["*Andrew Parker Bowles, and Rosemary Parker Bowles, the bride's first husband and his second wife"]}, {"page": "Elizabeth Hope, Baroness Glendevon", "response": ["*Nicholas Vincent Somerset Paravicini (born 1937), eldest son, who married firstly Mary Ann Parker Bowles, a sister of Andrew Parker Bowles, first husband of Camilla, Duchess of Cornwall. They were divorced and in about 1986 he remarried to Susan Rose (\"Suki\") Phipps (born 1941), by whom he had no issue, formerly the wife successively of Richard de la Mare and Derek Marlowe, and the daughter of Alan Phipps (who died in the Battle of Leros) by his wife Hon. Veronica Nell Fraser, a daughter of Simon Fraser, 14th Lord Lovat.Susan Rose Phipps profile, ukpub.net; retrieved 13 September 2008. Suki was brought up by Sir Fitzroy Maclean, 1st Baronet, one of the inspirations for James Bond. Nicholas Vincent Somerset Paravicini had the following issue by his first wife Mary Ann Parker Bowles, two sons and a daughter:  "]}, {"page": "Tom Parker Bowles", "response": ["Parker Bowles is the son of Camilla, Duchess of Cornwall, and Andrew Parker Bowles. His stepfather and godfather is Charles, Prince of Wales. He has one younger sister, Laura Lopes."]}, {"page": "Laura Lopes", "response": ["Laura Rose Lopes (née Parker Bowles; born 1978) is an English art curator. She is the daughter of Camilla, Duchess of Cornwall, and Andrew Parker Bowles, and the stepdaughter of Charles, Prince of Wales."]}, {"page": "Piers Bengough", "response": ["He joined the Grand Military Race Committee in 1963 and was appointed Chairman in 1985 on the retirement of General Sir Cecil Blacker.  He stepped down as Chairman in 2004, being replaced by Brigadier Andrew Parker Bowles. "]}, {"page": "Bowles (surname)", "response": ["*Andrew Parker Bowles (born 1939), British military officer"]}, {"page": "Ian Potter", "response": ["He was survived by his fourth wife Lady (Primrose) Potter.National Library of Australia Bookshop; Retrieved 8 April 2013  His daughter Caroly is married to Simon Betterman Parker Bowles, brother of Brigadier Andrew Parker Bowles, former husband of Camilla, Duchess of Cornwall."]}, {"page": "Massey Lopes, 2nd Baron Roborough", "response": ["Lopes and his wife, Helen Dawson, are the parents of the Hon. George Edward Lopes, whose wife is Sarah Violet Astor of the Astor family, and by them the grandparents of Harry Marcus George Lopes, born 7 October 1977. Harry Lopes was married on 6 May 2006 to Laura Parker Bowles, daughter of Andrew Parker Bowles and Camilla Shand, at St. Cyriac's Church, Lacock, Wiltshire,"]}, {"page": "Andrew Parker", "response": ["* Andrew Parker Bowles (born 1939), retired English military officer, first husband of the Duchess of Cornwall"]}, {"page": "Sir Humphrey de Trafford, 4th Baronet", "response": ["Sir Humphrey Edmund de Trafford, 4th Baronet  (30 November 1891 – 6 October 1971) was a prominent English racehorse owner, and the grandfather of Brigadier Andrew Parker Bowles. He was the son of Sir Humphrey de Trafford, 3rd Baronet, and Violet Alice Maud Franklin.", "On the death of his father, on 10 January 1929, Trafford became the fourth Baronet. In 1940, he was one of four godparents at the christening of his grandson Brigadier Andrew Parker Bowles, Ann's son. Trafford served as a justice of the peace and a deputy lieutenant of Hertfordshire and in 1945 as High Sheriff of Hertfordshire."]}, {"page": "Andrew Buchan", "response": ["|Andrew Parker Bowles"]}, {"page": "Sefton (army horse)", "response": ["The sound of the explosion alerted a number of soldiers still in the barracks, and many of them ran to the scene, including regimental commander Andrew Parker Bowles and veterinary officer, Major Noel Carding. Initially Parker Bowles ordered Sefton's handler to take off his shirt to staunch the horses bleeding; this proved impossible as the groom's hand had been pierced by a four-inch nail.John Stevens Not for the Faint-Hearted, Weidenfeld & Nicolson; 2005.  Another soldier was ordered to use his shirt and to apply pressure to Sefton's severe neck wound,"]}, {"page": "Thomas Parker, 6th Earl of Macclesfield", "response": ["The second son of Thomas Parker, 6th Earl, and his wife Mary Frances Grosvenor, was Hon. Cecil Thomas Parker, who married Rosamond Esther Harriet Longley, daughter of Charles Thomas Longley, Archbishop of Canterbury.The Plantagenet Roll of the Blood Royal, Marquis of Ruvigny, reprinted by Genealogical Publishing Company, 1994 p. 287 Hon. Cecil Parker was the brother-in-law of Major Edward Levett of Rowsley, Derbyshire, whose first wife was Caroline Georgina Longley, also a daughter of Archbishop Longley.Levett's second wife at his death was Susan Alice Arkwright, a descendant of Sir Richard Arkwright. When Edward Levett died in Pau, France, in December 1899, he named his former brother-in-law Parker as his executor. His great-great grandson is Andrew Parker Bowles."]}, {"page": "Rupert Campbell-Black", "response": ["Cooper has acknowledged that the character of Campbell-Black is based upon David Somerset, 11th Duke of Beaufort, and Andrew Parker Bowles, the former husband of Camilla, Duchess of Cornwall.Rowan Pelling, On its 30th anniversary, why Riders is the best erotic fiction of all time dated 7 March 2015 at telegraph.co.uk, accessed 20 January 2018"]}, {"page": "Edward Augustus Bowles", "response": ["Through his elder brother Henry,Sir Henry Ferryman Bowles, 1st baronet (1858–1943), Member of Parliament for Enfield 1889–1906 and 1918–22. who after 1894 lived at neighbouring Forty Hall, Bowles was the great uncle of Andrew Parker Bowles (born 1939), whose first wife, Camilla Shand, became Duchess of Cornwall on her marriage to Charles, Prince of Wales in 2005.Bryan Hewitt (1997) The Crocus King: E. A. Bowles of Myddelton House' by Bryan Hewitt, The Rockingham Press 1997'; genealogical display in Myddelton House museum, 2011", "Recommended Reading: \"The Crocus King:E A Bowles of Myddelton House \"by Bryan Hewitt, with a foreword by Brigadier Andrew Parker Bowles, gt, gt, nephew of E A Bowles The Rockingham Press. 1997. And soon to be  published \"The Crocus King E A Bowles of Myddelton House, The Garden Restored.\" An updating of the previous biography, it covers the past 20 years and the restoration of the garden as the result of Myddelton House Gardens winning 500,000pounds Heritage Lottery Fund money in 2009 ."]}, {"page": "Kuldip Singh Dhillon", "response": ["In the early 1970s, he met the then-Camilla Parker Bowles, and the two became friends.  Mrs. Parker Bowles (as she then was) and her husband Andrew Parker Bowles (also intently interested in the world of polo) would often dine at Dhillon's Gloucestershire home, or host the wealthy property developer at the couple's home in Wiltshire. In 1975, Dhillon joined Cirencester Park Polo Club, and, by his own statement, acquired the nickname of \"Sooty\" while playing against members of the Royal Family."]}, {"page": "Andrew Parker Bowles, OBE", "response": ["#REDIRECT Andrew Parker Bowles"]}]}}