{"wiki_id": "http://www.wikidata.org/entity/Q222116", "itemLabel": "John Boyd Dunlop", "itemDescription": "Scottish inventor", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Boyd_Dunlop", "wikipedia_page": {"main": "John Boyd Dunlop (5 February 1840 – 23 October 1921) was a Scottish inventor and veterinary surgeon who spent most of his career in Ireland. Familiar with making rubber devices, he re-invented pneumatic tyres for his child's tricycle and developed them for use in cycle racing.  He sold his rights to the pneumatic tyres to a company he formed with the president of the Irish Cyclists' Association, Harvey Du Cros, for a small cash sum and a small shareholding in their pneumatic tyre business.  Dunlop withdrew in 1896.  The company that bore his name, Dunlop Pneumatic Tyre Company, was not incorporated until later using the name well known to the public, but it was Du Cros's creation.\n\n", "link_mentions": [{"page": "Bicycle", "response": ["Further innovations increased comfort and ushered in a second bicycle craze, the 1890s Golden Age of Bicycles. In 1888, Scotsman John Boyd Dunlop introduced the first practical pneumatic tire, which soon became universal. Willie Hume demonstrated the supremacy of Dunlop's tyres in 1889, winning the tyre's first-ever races in Ireland and then England.Hume, William (1938). The Golden Book of Cycling. Archive maintained by 'The Pedal Club'. Dunlop, What sets Dunlop apart, History, 1889 Soon after, the rear freewheel was developed, enabling the rider to coast. This refinement led to the 1890s invention of coaster brakes. Dérailleur gears and hand-operated Bowden cable-pull brakes were also developed during these years, but were only slowly adopted by casual riders."]}, {"page": "Belfast", "response": ["* John Boyd Dunlop, inventor"]}, {"page": "February 5", "response": ["*1840 – John Boyd Dunlop, Scottish businessman, co-founded Dunlop Rubber (d. 1921)"]}, {"page": "List of Scots", "response": ["* John Boyd Dunlop (1840–1921), the modern rubber tyre"]}, {"page": "October 23", "response": ["*1921 – John Boyd Dunlop, Scottish businessman, founded Dunlop Rubber (b. 1840)"]}, {"page": "1840", "response": ["* February 5 – John Boyd Dunlop, Scottish inventor (d. 1921)"]}, {"page": "1888", "response": ["* December 7 – John Boyd Dunlop patents the pneumatic bicycle tyre in the United Kingdom."]}, {"page": "1921", "response": ["* October 23 – John Boyd Dunlop, British-born Irish inventor, veterinary surgeon (b. 1840)"]}, {"page": "Donnybrook, Dublin", "response": [":* John Boyd Dunlop (pneumatic tyre inventor)"]}, {"page": "Tire", "response": ["The first patent for what appears to be a standard pneumatic tire appeared in 1847( see US Patent 5104 ) lodged by Scottish inventor Robert William Thomson. However, this never went into production. The first practical pneumatic tire was made in 1888 on May Street, Belfast, by Scots-born John Boyd Dunlop, owner of one of Ireland's most prosperous veterinary practices. It was an effort to prevent the headaches of his 10-year-old son Johnnie, while riding his tricycle on rough pavements. His doctor, John, later Sir John Fagan, had prescribed cycling as an exercise for the boy, and was a regular visitor. Fagan participated in designing the first pneumatic tires. Cyclist Willie Hume demonstrated the supremacy of Dunlop's tires in 1889, winning the tire's first-ever races in Ireland and then England.The Golden Book of Cycling – William Hume, 1938. Archive maintained by 'The Pedal Club'.  In Dunlop's tire patent specification dated 31 October 1888, his interest is only in its use in cycles and light vehicles. In September 1890, he was made aware of an earlier development but the company kept the information to itself.Sir Arthur Du Cros, Bt, Wheels of Fortune, a salute to pioneers, Chapman &  Hall, London 1938", "In 1892, Dunlop's patent was declared invalid because of prior art by forgotten fellow Scot Robert William Thomson of London (patents London 1845, France 1846, USA 1847), although Dunlop is credited with \"realizing rubber could withstand the wear and tear of being a tire while retaining its resilience\". John Boyd Dunlop and Harvey du Cros together worked through the ensuing considerable difficulties. They employed inventor Charles Kingston Welch and also acquired other rights and patents which allowed them some limited protection of their Pneumatic Tyre business's position. Pneumatic Tyre would become Dunlop Rubber and Dunlop Tyres. The development of this technology hinged on myriad engineering advances, including the vulcanization of natural rubber using sulfur, as well as by the development of the \"clincher\" rim for holding the tire in place laterally on the wheel rim."]}, {"page": "List of inventors", "response": ["*John Boyd Dunlop (1840–1921), UK – first practical pneumatic tyre"]}, {"page": "Local Heroes (British TV series)", "response": ["#*John Boyd Dunlop: invented the pneumatic tyre"]}, {"page": "Congo Free State", "response": ["By the final decade of the 19th century, John Boyd Dunlop’s 1887 invention of inflatable, rubber bicycle tubes and the growing popularity of the automobile dramatically increased global demand for rubber. To monopolize the resources of the entire Congo Free State, Leopold issued three decrees in 1891 and 1892 that reduced the native population to serfs. Collectively, these forced the natives to deliver all ivory and rubber, harvested or found, to state officers thus nearly completing Leopold's monopoly of the ivory and rubber trade. The rubber came from wild vines in the jungle, unlike the rubber from Brazil (Hevea brasiliensis), which was tapped from trees. To extract the rubber, instead of tapping the vines, the Congolese workers would slash them and lather their bodies with the rubber latex. When the latex hardened, it would be scraped off the skin in a painful manner, as it took off the worker's hair with it.Hochschild, Adam. King Leopold's Ghost: A Story of Greed, Terror, and Heroism in Colonial Africa. Boston and New York: Houghton Mifflin, 1998, 161."]}, {"page": "Blackrock, Dublin", "response": ["John Boyd Dunlop (1840–1921) lived in a large 18th-century house called South Hill and developed the first practical pneumatic or inflatable tyre. He was one of the founders of the rubber company that bore his name, Dunlop Pneumatic Tyre Company."]}, {"page": "1921 in science", "response": ["* October 23 – John Boyd Dunlop (born 1840), British inventor."]}, {"page": "West Midlands (region)", "response": ["Maxaret, the world's first ABS braking system, was invented in Coventry by Dunlop in the early 1950s for aircraft; John Boyd Dunlop was a Scottish vet who had first produced the first pneumatic tyres in 1889. Matthew Piers Watt Boulton, grandson of Matthew Boulton, and born in the area, invented the aileron, an important flight control surface in 1868, decades before the first actual flight. Triumph Engineering was a famous motorbike firm in Meriden. About a quarter of all British WWI planes were built in Coventry. The Jensen Interceptor FF was the first production four-wheel-drive car in the world, designed by Major Tony Rolt, and built at their factory in West Bromwich."]}, {"page": "1888 in science", "response": ["* December 7 – John Boyd Dunlop patents the pneumatic bicycle tyre."]}, {"page": "Second Industrial Revolution", "response": ["John Boyd Dunlop developed the first practical pneumatic tyre in 1887 in South Belfast. Willie Hume demonstrated the supremacy of Dunlop's newly invented pneumatic tyres in 1889, winning the tyre's first ever races in Ireland and then England.The Golden Book of Cycling – William Hume, 1938. Archive maintained by 'The Pedal Club'. "]}, {"page": "Bicycle pump", "response": ["It is not known when the first bicycle pump was invented, but it is believed to have been in or around 1887, which is when the first inflatable tire or pneumatic tire was produced by John Boyd Dunlop of Scotland. The first bicycle pump consisted of a metal cylinder that had a metal rod running down the middle of it. This would have forced the air out of the cylinder and then sucked in new air when the metal rod was pulled up again. Many modern pumps use a very similar method, while some, such as the electric pumps, use an automated pumping mechanism."]}, {"page": "1840 in science", "response": ["* February 5 – John Boyd Dunlop (died 1921), Scottish-born inventor."]}, {"page": "List of companies named after people", "response": ["* Dunlop – John Boyd Dunlop"]}, {"page": "1921 in the United Kingdom", "response": ["* 23 October – John Boyd Dunlop, inventor (born 1840)"]}, {"page": "List of people from Birmingham", "response": ["*John Boyd Dunlop – Industrialist, built Fort Dunlop"]}, {"page": "John Dunlop", "response": ["*John Boyd Dunlop (1840–1921), Scottish/Irish inventor of the pneumatic tyre and founder of the Dunlop rubber company"]}, {"page": "List of veterinarians", "response": ["*John Boyd Dunlop (1840–1921) — Scottish inventor of the tyre"]}, {"page": "Dunlop", "response": ["* Name derived from John Boyd Dunlop (1840–1921)"]}, {"page": "1887 in Ireland", "response": ["*John Boyd Dunlop develops the first practical pneumatic tyre in Belfast."]}, {"page": "Science and invention in Birmingham", "response": ["1891: The Dunlop Rubber Company co-founded by John Boyd Dunlop established its Birmingham factory Fort Dunlop, later to become the focus of Dunlop as one of the largest multinational manufacturers of automotive and aeronautical tyres."]}, {"page": "Dreghorn", "response": ["The Church of Scotland Dreghorn and Springside Parish Church, at the centre of the village, dates from 1780. Its octagonal plan, which is unusual in Scotland, was produced by the church's principal benefactor, Archibald Montgomerie, 11th Earl of Eglinton. The village's most famous inhabitant, John Boyd Dunlop, was born at a Dreghorn farm in 1840. When practicing as a veterinary surgeon in Belfast, in 1887 he invented pneumatic tyres for bicycles.", "thumb|150px|A memorial plaque to John Boyd Dunlop at Dreghorn village hall.", "John Boyd Dunlop was born at a Dreghorn farm on 5 February 1840. He qualified as a veterinary surgeon at the Dick Vet in Edinburgh and set up practice in Belfast, where he also invented a pneumatic tyres for bicycles in October 1887. The principle had been patented by Robert William Thomson in 1847, but it was Dunlop's invention that made a success of the idea."]}, {"page": "Dunlop Tyres", "response": ["Dunlop Tyres is a brand of tyres which is managed by different companies around the world. Founded by pneumatic tyre pioneer John Boyd Dunlop in Dublin, Ireland, in 1890,https://www.dunlop.eu/dunlop_be/_header/about_us/history/ the brand is operated by Goodyear in North America (passenger car & light truck), Europe, Australia and New Zealand."]}, {"page": "Scottish inventions and discoveries", "response": ["* The pneumatic tyre: Robert William Thomson and John Boyd Dunlop (1822–1873)"]}]}}