{"wiki_id": "http://www.wikidata.org/entity/Q2226152", "itemLabel": "Daryl Gurney", "itemDescription": "Northern Irish darts players", "wikipedia_url": "https://en.wikipedia.org/wiki/Daryl_Gurney", "wikipedia_page": {"main": "Daryl Gurney (born 22 March 1986) is a Northern Irish professional darts player who plays in Professional Darts Corporation (PDC) events.", "link_mentions": [{"page": "Derry", "response": ["* Daryl Gurney, darter"]}, {"page": "Eric Bristow", "response": ["Bristow died on 5 April 2018, after a heart attack while attending a Premier League Darts event at the Echo Arena in Liverpool. Bristow had finished playing some VIPs at a promotional event and was walking back to his car, when he collapsed and was rushed to hospital. Bristow's death was announced during the match between Peter Wright and Daryl Gurney. The crowd paid tribute to Bristow. Speaking to BBC Radio Two, Bobby George said: \"In the afternoon, I was doing a show at a pub opposite the Premier League (darts) building, and he just came in, said 'hello' and had a pint, then said 'see ya', I said 'see ya' because I was working... he went across the road, and two-and-a-half hours later, he was gone."]}, {"page": "Nine-dart finish", "response": ["| Michael Smith ||  Daryl Gurney", "| Michael van Gerwen  ||  Daryl Gurney", "| Peter Wright ||  Daryl Gurney"]}, {"page": "Sweet Caroline", "response": ["Fans of the Northern Ireland national football team adopted the song as an anthem after it was played in the post-match stadium celebrations after defeating England in 2005. It has however been a fan favourite at Windsor Park for 20 years. The song has been used at home games ever since, most notably during UEFA Euro 2016.\"Northern Ireland fans sing 'Sweet Caroline' at Ukraine match\". YouTube. Northern Irish darts player Daryl Gurney began using the song as his walk-on song in 2015 for Professional Darts Corporation events, in tribute to the football team."]}, {"page": "Professional Darts Corporation", "response": ["An additional 19 players have won a single title. That list is composed of Justin Pipe, Raymond van Barneveld, Adrian Lewis, Simon Whitlock, John Part, Wes Newton, Steve Beaton, Gary Anderson, Vincent van der Voort, Mervyn King, Robert Thornton, Alan Norris, Max Hopp, Jonny Clayton, Daryl Gurney, Jamie Hughes, Krzysztof Ratajski, Devon Petersen and José de Sousa."]}, {"page": "Culture of Northern Ireland", "response": ["* Daryl Gurney"]}, {"page": "Jelle Klaasen", "response": ["Klaasen beat Kevin Burness 3–1 in the first round of the 2020 PDC World Darts Championship, before losing to Michael van Gerwen by the same scoreline. At the 2020 UK Open, he started his campaign by defeating Riley's qualifier Jason Askew 6–4. Klaasen then beat William Borland 10–5 before thrashing Steve West 10–1 to set up a sixth-round clash with Gary Anderson. He overcame Anderson 10–9 before losing in the quarter-finals to Daryl Gurney."]}, {"page": "Vincent van der Voort", "response": ["*2021: Fourth round (lost to Daryl Gurney 2–4)"]}, {"page": "Martin Adams", "response": ["In the 2010 World Championship he beat a visibly nervous Anthony Fleet in the first round without losing a leg, followed by further comfortable victories over Daryl Gurney and Garry Thompson. In the semi-final he let a 5–1 lead slip over Welshman Martin Phillips before finally winning 6–4. He then defeated unseeded Dave Chisnall 7–5 in the final to win a second World Championship in a rematch of their first round match a year earlier."]}, {"page": "World Matchplay (darts)", "response": ["| Daryl Gurney", "| Daryl Gurney", "| Daryl Gurney"]}, {"page": "James Wade", "response": ["Wade suffered early exits at the Masters, the 2017 Premier League Darts, and the World Matchplay, resulting in a decade-low ranking of 10th. Wade's hugely disappointing year continued with yet another first round defeat, this time at the hands of Steve West at the World Grand Prix. Wade's Grand Slam campaign saw him win through his group, defeating Phil Taylor along the way. He was beaten in the second round by Daryl Gurney. Wade defeated Kevin Painter and Jamie Caven 6–4, in the first and second rounds of the Players Championship Finals, respectively. In the third round, Wade saw off Ian White 10–6. Wade lost 10–6 at the Quarter Final stage to Rob Cross.", "Wade defeated Japanese Qualifier Seigo Asada 3–2 in the second round of the 2019 PDC World Darts Championship, a high quality, feisty affair in which Wade came under criticism for his celebrations aimed towards Asada. Wade later apologized for his actions. In the third round, Wade would go 0–2, and 1–3 down to Keegan Brown in a hostile atmosphere before producing a remarkable 4–3 comeback win. Wade became the 7th top 10 seed to crash out before the Quarter-Final stage, losing 4–3 to Ryan Joyce in the last 16. Wade was picked for the 2019 Premier League Darts on the 10-year anniversary of him winning the event. Wade's Masters campaign began with a 10–7 victory of Gerwyn Price. He followed the win with victories over Joe Cullen in the Quarter-Finals and Peter Wright in the Semi-Finals to set up a final with Michael van Gerwen. Wade lost the final 11–5 to Van Gerwen. Wade kicked off the 2019 Premier League Darts in style with a 7–4 win over outgoing Raymond van Barneveld with a 99 average. In week 4 of the 2019 Premier League Darts he beat Michael van Gerwen 7–3 Averaging 95.65. Wade continued his excellent form at the UK Open, dismantling fellow countryman James Wilson (darts player) 10–1 in the 4th round. Wade followed up the victory with a 10–7 win over Max Hopp but was surprisingly beaten 7–10 by Ross Smith in the round of 16. In week 5 of the 2019 Premier League Darts, Wade averaged 110 in his 7–0 whitewash win over Daryl Gurney sending him to the summit of the league table. Wade hit a 9-darter in a German Darts Championship match which he lost 5–6 to Darren Webster. Wade won Players Championship 9 in Barnsley defeating the likes of Mark Webster, Christian Kist, Peter Hudson, Aaron Monk, Adrian Lewis, Scott Baker and Michael Smith in the final. The tournament victory was his first on the Players Championships since 2015 and the 12th Players Championship of his career. Wade followed the win up with another title in Barnsley the following week – Players Championship 11 – beating Michael Smith in a repeat final, 8–6. Wade made it a back-to-back double in Barnsley and 3 out of 4, winning Players Championship 12, defeating the likes of Luke Woodhouse, Christian Kist, Ted Evetts, Stephen Bunting, Jonny Clayton, Michael Smith and Jeffrey de Zwaan in the final. The title was Wade's 34th in the PDC. Wade made the Semi-finals of the Premier League for the first time since 2013, defeating Rob Cross 8–6 on the final night of the league stage season, finishing 3rd on the table. Wade would go on to lose 10–5 to Rob Cross the following week in the Semi-Finals at The O2. Wade won a 4th Players Championship title of the year at Wigan, PC 18, defeating the likes of Benito van de Pas, Yordi Meeuwisse, Keegan Brown, Rowby-John Rodriguez, Callan Rydz, Krzysztof Ratajski, and José de Sousa in the final. Wade's 4 PDC titles in one calendar year equalled a personal record set back in 2009.", "At the 2021 Grand Slam of Darts, James hit a 113 average in a group stage match against countryman Rob Cross, winning 5–2 and securing his passage to the round of 16. It was the 9th consecutive year James Wade advanced past the Group Stages & on to the knockout phase of the tournament. James defeated Rowby-John Rodriguez 10–2 in the last 16 and Rob Cross 16–14 in the Quarter-Finals. James lost to the eventual champion Gerwyn Price in the semi-finals 16–9. James reached the last 16 at the 2021 Players Championship Finals where he was beaten 10–7 by Daryl Gurney."]}, {"page": "World Grand Prix (darts)", "response": ["|Daryl Gurney|| Northern Ireland||align=center|1||align=center|0||align=center|1||align=center|8"]}, {"page": "Premier League Darts", "response": ["|align=center| 2019 ||align=right| Daryl Gurney  94.45 ||align=center| 0–7 ||  James Wade 109.59"]}, {"page": "Michael van Gerwen", "response": ["Van Gerwen won the European Darts Grand Prix, his 23rd European Tour title and his 10th title of the year that included wins over Dave Chisnall in quarter-finals by a scoreline of 6–4, a 7–0 whitewash over Michael Smith in the semi-finals and an 8–3 victory over James Wade in the final. The following week, he won his 11th title of the year (his 24th European Tour title) by winning his 5th consecutive Dutch Darts Masters by beating Steve Lennon 8–5 in the final. Notably, in his semi-final match with Daryl Gurney, van Gerwen trailed 2–6 as well as surviving 3 match darts but the Dutchman produced a comeback performance to knock out the Northern Irishman 7–6.", "Van Gerwen lifted the 2018 World Grand Prix title, the fourth time he had won that title, with a 5–2 win over Peter Wright. He failed to retain the European Championship, World Series Finals and Grand Slam titles in 2018, and lost the final of the 2018 Players Championship Finals to Daryl Gurney.", "He retained his Premier League title yet again, beating Daryl Gurney 10–7 in the semifinals, and beating Rob Cross 11–5 in the final. The first two World Series events of 2019 did not go well for him, suffering an 8–6 defeat to Michael Smith in the quarterfinals of the 2019 US Darts Masters, and blowing a 5–1 lead to lose 6–5 to qualifier Martin Schindler in the first round of the 2019 German Darts Masters. Van Gerwen then continued his very poor run of form at the World Matchplay, losing 13–11 to Glen Durrant in the last 16. Van Gerwen once again failed to get out of the quarterfinals in the 2019 Brisbane Darts Masters, losing 8–5 to Gurney. He finally got back to winning ways in Melbourne and New Zealand, winning those finals by scores of 8–3 and 8–1 over Gurney and Van Barneveld respectively.", "At the 2020 Masters, van Gerwen lost in the first round to Jonny Clayton, ending his run of five years as the tournament's champion, and a 20 match unbeaten run at the Marshall Arena. In March he won the UK Open for the third time, beating Gerwyn Price 11–9 in the final. In his run through to the final, he hit his seventh career televised nine-darter, against Daryl Gurney in the semi-finals. In November he won the Players Championship Finals for the 6th time, beating Mervyn King 11–10 in the final.", "|  Daryl Gurney", "|  Daryl Gurney", "|  Daryl Gurney", "|  Daryl Gurney"]}, {"page": "Gurney (surname)", "response": ["*Daryl Gurney (b. 1986), Northern Irish darts player"]}, {"page": "Darren Webster", "response": ["Webster hit his first career nine-dart finish on 11 February 2017 in the 5th UK Open qualifier during a 6-5 win over Benito van de Pas. In July, he won his first players Championship title, defeating Daryl Gurney 6–1 in the final in Barnsley."]}, {"page": "Gary Anderson (darts player)", "response": ["In the final of the European Championship, Anderson held a 10–7 advantage over Van Gerwen, but lost four legs in a row without getting a dart for the title as he was beaten 11–10. He averaged 104.22 against Mark Webster in the second round of the Grand Slam of Darts, but the Welshman took out 71% of his shots at doubles to defeat Anderson 10–6 and he lost in the same stage of the Players Championship Finals 10–4 to Daryl Gurney.", "In the defence of his title, Anderson reached the final of the 2016 World Championship without facing any troubles following wins over Andy Boulton, Daryl Gurney, Vincent van der Voort, James Wade and Jelle Klaasen with the loss of just two sets. In the semi-finals, he won 6–0 over Jelle Klaasen with a 107 average and threw a nine-dart finish in the opening set. He played Adrian Lewis in a rematch of the 2011 final and hit a 170 finish in the penultimate leg, before hitting double 12 (the same double which he hit to win his first World Championship) to retain his title with a 7–5 win, a reversal of the scoreline from five years ago. 34 180s were thrown which is a record in a professional match. Anderson became the 11th player to win more than one World Championship and joined Eric Bristow, Raymond van Barneveld and Lewis in being the only players to have successfully defended their first world title.", "After taking second in his group with victories over Michael van Gerwen and Dave Chisnall, but a loss to Daryl Gurney, Anderson would meet Suljović again in the semi-final of the 2018 Champions League of Darts. The Scotsman secured an 11–4 victory over the Austrian to avenge his defeat in the 2017 Final where the Austrian won 11–9. Anderson was quick to follow up with another 11–4 victory in the final against his fellow countryman Peter Wright to become the third champion in as many stagings of the tournament. A week later in the World Grand Prix, Anderson would again struggle when he fell to the reigning champion Daryl Gurney for the second time in two weeks, with a 3–0 defeat in the quarter-finals.", "In November, Anderson went undefeated in the group stage of the Grand Slam and met MVG in the semi-final having only lost 12 legs combined in the prior rounds. Anderson took the set 16–12 before meeting Gerwyn Price in the final. After at one point leading the match 11–8, Anderson was visibly distracted by Price, and only won 2 of the next 10 legs, to lose 13–16 in the controversial final. The following week in the 2018 Players Championship Finals, Anderson once again met MVG in the semi-finals with each of them having only given up 9 legs in the tournament so far. This time around, Van Gerwen would get the advantage, winning 11–9 before losing to Daryl Gurney by the same margin in the final."]}, {"page": "Paul Hanvidge", "response": ["In 2008, he suffered a first-round exit, losing to Brian Woods, whose average of 96.51 was the highest of the first round. Hanvidge reached the final of the 2008 Norway Open, losing to Willy van de Wiel. Hanvidge was forced to qualify for the 2009 BDO World Championship, but fell three rounds short in a defeat to Paul Gibbs. Hanvidge reached the semifinals of the 2009 British Open, defeating John Walton and Daryl Gurney along the way. He was beaten by Martin Atkins. Hanvidge earned enough ranking points to secure a place in the 2010 BDO World Championship, but was beaten in the first round by Scott Waites while reportedly suffering a bout of dartitis."]}, {"page": "Mark Webster (darts player)", "response": ["Webster did not play many tournaments in 2008, instead choosing to remain in college to earn his plumbing degree. He did though retain the WDF Europe Cup, beating Northern Ireland's Daryl Gurney in the final. Webster also had a great run into the quarter finals of the 2008 Grand Slam of Darts. After surprisingly losing his opening group game to Colin McGarry, he went on to whitewash Michael van Gerwen 5–0 and despite losing to Mervyn King, Webster went through to the knockout stages on leg difference after McGarry failed to beat van Gerwen. Webster then demolished PDC World Champion John Part 10–2 – in a battle of the incumbent world champions – to reach the quarter finals where he lost again to King. Webster then suffered a last 16 exit in the 2008 World Masters, losing to Ross Montgomery and then went out in the group stages of the Zuiderduin Masters. Having beaten Martin Atkins, he lost to wildcard entrant Henny van der Ster who claimed the quarter final spot ahead of Webster and went on to reach the semi-finals.", "Webster saw off Joe Murnan 3–0 in the first round of the 2017 World Championship and then held on when Mensur Suljović rallied from 3–1 down, by taking all three legs in the deciding set to win 4–3 and reach the third round for the second successive year. The opposite then happened as it was Webster who levelled at 3–3 having been 3–1 down, but Daryl Gurney took the seventh set by three legs to one to progress 4–3. Victories over Finland, Ireland and Russia helped Webster and Gerwyn Price into the semi-finals of the World Cup. A pair of 4–2 wins over the Belgian team of Kim and Ronny Huybrechts saw them play in the final, where their only point came courtesy of a Webster win over Raymond van Barneveld as they went down 3–1 to the Dutch. Webster has been battling dartitis in recent years, but hoped that this result in a team event could boost his individual performances.", "* 2017: Third round (lost to Daryl Gurney 3–4)"]}, {"page": "Waterside, Derry", "response": ["*Daryl Gurney, professional darts player"]}, {"page": "Grand Slam of Darts", "response": ["| Daryl Gurney"]}, {"page": "Simon Whitlock", "response": ["Whitlock was beaten 4–0 in the second round of the 2017 World Championship as Darren Webster averaged 104.64. In the final of the second UK Open Qualifier Whitlock took out a 154 finish with his opponent Gary Anderson waiting on 20 to lead 5–3 and went on to win 6–4. He also claimed the fifth event by seeing off Ronny Huybrechts 6–3. At the main event progressed through to the quarter-finals and held a 7–4 advantage over Daryl Gurney, before losing five legs in a row. Whitlock fought back to force a last leg shoot-out, but lost it to be defeated 10–9. His third ranking event title of 2017 came a week later as he overcame Gary Anderson 6–5 in the quarter-finals and Kim Huybrechts 6–4 in the semis, before dispatching Darren Johnson 6–3 to win the fourth Players Championship."]}, {"page": "Andy Smith (darts player)", "response": ["Smith lost in the first round of the 2013 World Championship to qualifier Daryl Gurney 3–1, hitting just 15% of his darts at a double during the match. He beat James Hubbard 5–3 in the second round of the UK Open, before losing 9–7 to Gary Anderson. Smith's deepest run of the year was at the fourth Players Championship where he lost 6–4 to Jelle Klaasen in the semi-finals.", "* 2013: First round (lost to Daryl Gurney 1–3)"]}, {"page": "Robert Thornton (darts player)", "response": ["At the World Grand Prix, Thornton did not drop a set in the first two rounds in wins over Daryl Gurney and Justin Pipe. Thornton then beat Ian White and Mensur Suljović en route to the final. He faced Michael van Gerwen, who hit eighteen 180's, but Thornton beat him 5–4 in sets to win his second PDC major title and third overall. Thornton also rose to number five in the PDC Order of Merit and secured his entry into the Grand Slam of Darts, where he lost 16–7 in the quarter-finals to Phil Taylor.", "In the second round of the 2017 World Championship, Thornton lost the first six legs against Daryl Gurney but recovered to move 3–2 up. He then lost six of the final seven legs to be edged out 4–3. He played in his first final since the 2015 World Grand Prix at the ninth Players Championship and was defeated 6–2 by Michael van Gerwen.", "*2017: Second round (lost to Daryl Gurney 3–4)"]}, {"page": "Mensur Suljović", "response": ["His second round tie with Mark Webster at the 2017 World Championship went to a deciding set in which Webster won all three legs to eliminate Suljović 4–3. Suljović got through to the final of the Gibraltar Darts Trophy after Daryl Gurney missed four darts to beat him in the semi-finals. In the final Michael Smith was 3–0 up, before Suljović took four legs in a row. He was waiting on 56 at 4–4, but Smith completed a 132 finish and won the next leg to defeat Suljović 6–4. Austria played England in the quarter-finals of the 2017 World Cup for the second successive year. Suljović thrashed Adrian Lewis 4–0 and Rowby-John Rodriguez lost 4–1 to Dave Chisnall, before Austria were defeated 4–2 in the decisive doubles match. "]}, {"page": "Stephen Bunting", "response": ["Bunting began 2021 on a high by reaching the semi-finals of the 2021 PDC World Darts Championship beating Andy Boulton, James Wade, Ryan Searle and Krzysztof Ratajski on the way, before being eliminated by the eventual champion, Gerwyn Price. Bunting later reached the semi-finals of the 2021 World Grand Prix, following victories over Daryl Gurney, Wade and Searle. Once again, Bunting was beaten by Price in the semi-finals."]}, {"page": "Garry Thompson (darts player)", "response": ["Thompson earned automatic qualification for the 2009 BDO World Championship, entering the tournament as the number 14 seed. He was drawn against Northern Ireland's Daryl Gurney in the first round but lost 3-1.", "* 2009: 1st Round (lost to Daryl Gurney 1-3)"]}, {"page": "List of people from Derry", "response": ["* Daryl Gurney - Professional Dart Player. 2 Times PDC Major Winner"]}]}}