{"wiki_id": "http://www.wikidata.org/entity/Q22278271", "itemLabel": "Dafydd Hywel", "itemDescription": "Welsh actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Dafydd_Hywel", "wikipedia_page": {"main": "Dafydd Hywel is a Welsh actor who has worked extensively in television roles and movies in both Welsh and English medium since 1969. He is best known for playing Glen Brennig in the Sky1 TV comedy drama series Stella.Dafydd also narrated Video 125s 'The Cambrian Coast' Railway Drivers Eye View Video in 1988.", "link_mentions": [{"page": "1980 in Wales", "response": ["*The Mouse and the Woman, based on a novel by Dylan Thomas, written by Vincent Kane and directed by Karl Francis, co-stars Huw Ceredig, Beti Lloyd-Jones and Dafydd Hywel."]}, {"page": "Coming Up Roses (1986 film)", "response": ["Coming Up Roses () is a 1986 Welsh language comedy film. It was directed by Stephen Bayly and starred Dafydd Hywel, Gillian Elisa and Mari Emlyn. The film was screened in the Un Certain Regard section at the 1986 Cannes Film Festival.", "* Dafydd Hywel as Trevor"]}, {"page": "List of Pobol y Cwm characters", "response": ["|Jack Daniels || Dafydd Hywel || 1976–1984, 1999, 2004"]}, {"page": "The Winter Stallion", "response": ["Dai Davies (Eric Wyn) is a Welshman running a cash-strapped farm in modern Wales and raising his orphaned granddaughter Gwen (Sian MacLean) with the help of her godmother Nerys (Lynette Davies). When he dies unexpectedly, he leaves Gwen's guardianship to his estranged son Alan (Daniel J. Travanti), who has returned to Wales accompanied by his stepson Cliff Dean (Patrick Loomer). Alan's return pits himself against land developer Howard (Dafydd Hywel) and Cliff against Gwen's would-be suitor Gwilyn (Richard Lynch). As Alan and Gwen try to connect in the background of readying the farm's prize stallion Mabon for a race that could save the farm, Howard resorts to dirty tricks to try and force through the farm's sale.", "* Dafydd Hywel as Howard"]}, {"page": "Pen Talar", "response": ["* Albert Green - Dafydd Hywel"]}, {"page": "Becca (film)", "response": ["Becca is a 1989 UK-Australian TV movie about a Welsh farmer who is transported to Australia in the 1840s. It was shot in English and Welsh.Ed. Scott Murray, Australia on the Small Screen 1970–1995, Oxford Uni Press, 1996 p12 Beth Robert and Dafydd Hywel played the main characters."]}, {"page": "Stanley and the Women", "response": ["*Dafydd Hywel as Taff Wyndham"]}, {"page": "Off to Philadelphia in the Morning (TV series)", "response": ["*Dafydd Hywel ... Henry Parry"]}, {"page": "The Blackheath Poisonings (TV series)", "response": ["* Dafydd Hywel as  Sergeant Davis"]}]}}