{"wiki_id": "http://www.wikidata.org/entity/Q22341346", "itemLabel": "Vivian Seay", "itemDescription": "British Honduran nurse, social reformer and activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Vivian_Seay", "wikipedia_page": {"main": "Vivian Wilhelmina Myvett Seay (1881–1971) was a British Honduran nurse, social reformer and activist. Seay, Creole and of the middle class, attended the Anglican Church school and earned her teaching credentials in the pupil-teacher program. In 1920, she founded the country's Black Cross Nurses and led the group until she died, 51 years later. A social activist, the legalization of divorce in Belize is partially attributed to her work. In 1951, she was the only woman founder of the National Party and she was the country's second woman citizen to be honored as Member of the Order of the British Empire.", "link_mentions": [{"page": "List of people on the postage stamps of Belize", "response": ["*Vivian Seay (1992)"]}, {"page": "Cleopatra White", "response": ["Cleopatra Eugenie White was born on 28 June 1898 in British Honduras, now Belize, to Joseph and Maria White. Her mother died when she was a child and she was raised by her father with one sister. White attended Miss Braddick’s School for Girls and Ebenezer Primary School before pursuing nursing. In 1919, when she was 21 White followed her mentor, Vivian Seay, a fellow nurse, into organizing and promoting the Black Cross Nurses Association as a home health care organization. Officially founded in 1920, with untrained personnel, the organization began in its second year to offer general nursing and maternity classes under Dr. K.M.B. Simon, the government medical officer, and Amy Clare Woods George, a certified British Honduran midwife who had studied in Britain."]}, {"page": "Black Cross Nurses", "response": ["The Belize Black Cross Nurses organization was established in British Honduras in 1920 by Vivian Seay, who led the organization until her death in 1971. Dr. K. Simon, medical officer for the Cayo District, moved to Belize Town in 1921, and began instructing members of the UNIA in midwifery, to combat the high mortality rates for infants and mothers. He urged that members take instruction under Belize Town Public Hospital matron Lois M. Roberts, an Englishwoman, in general hospital procedures and hygiene.  As Roberts had been unable to secure sufficient nurses for her training program, she agreed to accept the Black Cross Nurses. By 1922, seventeen of the first training class of twenty nurses passed their exams and were awarded their nursing certificates. By 1923, there were twenty-four certified nurses, who were each assigned a territory in Belize Town to administer to the needs of the poor, as unpaid volunteers."]}]}}