{"wiki_id": "http://www.wikidata.org/entity/Q2232954", "itemLabel": "Nicholas de Lange", "itemDescription": "British historian and rabbi", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicholas_de_Lange", "wikipedia_page": {"main": "Nicholas Robert Michael de Lange (7 August 1944, Nottingham) is Professor of Hebrew and Jewish Studies at the University of Cambridge.", "link_mentions": [{"page": "Heaven", "response": ["According to Nicholas de Lange, Judaism offers no clear teaching about the destiny which lies in wait for the individual after death and its attitude to life after death has been expressed as follows: \"For the future is inscrutable, and the accepted sources of knowledge, whether experience, or reason, or revelation, offer no clear guidance about what is to come. The only certainty is that each man must die – beyond that we can only guess.\"Nicholas de Lange, Judaism, Oxford University Press, 1986"]}, {"page": "Maccabees", "response": ["The author of the First Book of Maccabees regarded the Maccabean revolt as a rising of pious Jews against the Seleucid king (who had tried to eradicate their religion) and against the Jews who supported  him.  The author of the Second Book of Maccabees presented the conflict as a struggle between \"Judaism\" and \"Hellenism\", concepts which he coined.Nicholas de Lange (ed.), The Illustrated History of the Jewish People, London, Aurum Press, 1997, "]}, {"page": "Hasmonean dynasty", "response": ["He also outlawed observance of the Sabbath and the offering of sacrifices at the Jerusalem Temple and required Jewish leaders to sacrifice to idols; punitive executions were also instituted. Possession of Jewish scriptures was made a capital offence. The motives of Antiochus are unclear. He may have been incensed at the overthrow of his appointee, Menelaus,Oesterley, W.O.E., A History of Israel, Oxford, Clarendon Press, 1939 he may have been responding to a Jewish revolt that had drawn on the Temple and the Torah for its strength, or he may have been encouraged by a group of radical Hellenisers among the Jews.Nicholas de Lange (ed.), The Illustrated History of the Jewish People, London, Aurum Press, 1997, "]}, {"page": "Comparative religion", "response": ["Nicholas de Lange, Professor of Hebrew and Jewish Studies at Cambridge University, says that"]}, {"page": "Wolfson College, Cambridge", "response": ["*Nicholas de Lange - Professor of Hebrew and Jewish Studies"]}, {"page": "Ignaz Maybaum", "response": ["In 1949 he became rabbi of Edgware and District Reform Synagogue. From 1956 until his retirement in 1963, he lectured in homiletics and theology at Leo Baeck College. He was also active in inter-religious dialogue. His students include Nicholas de Lange.", "* Ignaz Maybaum: A Reader, Nicholas de Lange (ed.), New York and Oxford: Berghahn Books (2001)", "* Ignaz Maybaum: A Reader, Nicholas de Lange (ed.), New York: Berghahn Books"]}, {"page": "Julia Neuberger", "response": ["Neuberger was born Julia Babette Sarah Schwab in the Hampstead area of London on 27 February 1950, the daughter of art critic Liesel (\"Alice\") and civil servant Walter Schwab.https://www.encyclopedia.com/arts/educational-magazines/neuberger-julia-babette-sarah-1950  Her mother was a German-Jewish refugee who had fled the Nazis, arriving in England at the age of 22 in 1937, while her father was born in England to German-Jewish immigrants who had settled there before World War I. The Schwab Trust, which supports and educates young refugees and asylum seekers, was later set up in her parents' name.  She attended South Hampstead High School and Newnham College, Cambridge, where she first studied Assyriology. After she was refused entry to Turkey because she was British, and then to Iraq because she was Jewish, she had to change her subject and instead studied her second language of Hebrew full-time. Her lecturer at Cambridge, Nicholas de Lange, suggested she should become a rabbi. She obtained her rabbinic diploma at Leo Baeck College."]}, {"page": "Circumcision controversies", "response": ["According to rabbinical accounts, he desecrated the Second Temple of Jerusalem by placing a statue of Olympian Zeus on the altar of the Temple; this incident is also reported by the biblical Book of Daniel, where the author refers to the statue of the Greek god inside the Temple as \"abomination of desolation\". Antiochus' decrees and vituperation of Judaism motivated the Maccabean Revolt; the Maccabees reacted violently against the forced Hellenization of Judea, destroyed pagan altars in the villages, circumcised boys, and forced Hellenized Jews into outlawry.Nicholas de Lange (ed.), The Illustrated History of the Jewish People, London, Aurum Press, 1997, . The revolt ended in the re-establishment of an independent Jewish kingdom under the Hasmoneans, until it turned into a client state of the Roman Republic under the reign of Herod the Great (374 BCE)."]}, {"page": "International Booker Prize", "response": ["*Amos Oz (Israel), Nicholas de Lange (translator), for Judas (הבשורה על-פי יהודה)"]}, {"page": "My Michael", "response": ["My Michael was published in Hebrew in 1968 by Am Oved. It was the best-selling novel in Israel in the 1968–1969 season, with nearly 40,000 copies sold in its first 18 months. The novel was reissued by Keter Publishing House in 1990 and 2008, and by Keter/Yediot Aharonoth in 2010. The English edition, translated by Nicholas de Lange, would be the first of 16 of Oz's books translated into English by the British academic. The English edition was first published in 1972 by Chatto & Windus (London) and Alfred A. Knopf (New York). "]}, {"page": "Nicholas Robert Michael de Lange", "response": ["#Redirect Nicholas de Lange"]}, {"page": "N. de Lange", "response": ["#Redirect Nicholas de Lange"]}, {"page": "2001 in poetry", "response": ["* Amos Oz, The Same Sea (Harcourt); a novel about sexual hanky-panky involving a man, son and several women; most of the book is in verse; the author collaborated on the translation by Nicholas de Lange); a New York Times \"notable book of the year\""]}, {"page": "Category talk:Academics of the University of Cambridge", "response": ["Nicholas de Langenot yet classified"]}, {"page": "British Association for Jewish Studies", "response": ["* 1989 Nicholas de Lange"]}, {"page": "Harrow High School", "response": ["* Nicholas de Lange, professor of Hebrew and Jewish studies, University of Cambridge"]}, {"page": "Nicholas de lange", "response": ["#REDIRECT Nicholas de Lange "]}, {"page": "A Tale of Love and Darkness", "response": ["The English translation was done by Nicholas de Lange and published by Houghton Mifflin Harcourt in 2004. The translation was praised by New York Magazine's book reviewer Boris Kacha as \"preserving the author’s gorgeous, discursive style and his love of wordplay.\""]}, {"page": "Muhammad ibn Muhammad Tabrizi", "response": ["Abu Abd Allah Muhammad ibn Abi Bakr ibn Muhammad Tabrizi was a thirteenth-century Persian Muslim writer, known for his Arabic commentary on the 25e propositions at the beginning of Book II of the Jewish philosopher Maimonides's Guide for the Perplexed, on which Maimonides then based his proof of the existence, unity and incorporeality of God.  The propositions, derived from Aristotle's Physics and Metaphysics, were merely summarised by Maimonides; Tabrizi gives a detailed discussion of them, based on the work of Arabic authors.  It is the earliest known commentary on a part of the Guide.Remark in Colette Sirat, Nicholas de Lange (2002), Hebrew manuscripts of the Middle Ages, Cambridge: Cambridge University Press. . p. 284"]}]}}