{"wiki_id": "http://www.wikidata.org/entity/Q22344825", "itemLabel": "Tony Naden", "itemDescription": "British lexicographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Naden", "wikipedia_page": {"main": "Tony Naden is a British lexicographer who specializes on Western Oti-Volta subgroup of Gur languages. He has compiled dictionaries in the following languages: Dagbanli, Mampelle, Mõõré, Nabt, Talene, KaMara and Yarsi.\n\n", "link_mentions": [{"page": "Gur languages", "response": ["The Gur family was previously called Voltaic, following the French name (langues) Voltaïques (named after the Volta River). It was once considered to be more extensive than it is often regarded today, including the Senufo languages and a number of small language isolates. The inclusion of Senufo within Gur has been rejected by many linguists, including Tony Naden.Naden, Tony. 1989:143 Williamson and BlenchWilliamson and Blench. 2000:18,25-6 place Senufo as a separate branch of Atlantic–Congo, while other non-Central Gur languages are placed somewhat closer as separate branches within the Savannas continuum."]}, {"page": "Dagbani language", "response": ["There is an insight into a historical stage of the language in the papers of Rudolf Fisch reflecting data collected during his missionary work in the German Togoland colony in the last quarter of the nineteenth century, especially the lexical list, though there is also some grammatical information and sample texts. A more modern glossary was published in 1934 by a southern Ghanaian officer of the colonial government, E. Foster Tamakloe, in 1934, with a revised edition by British officer Harold Blair. Various editors added to the wordlist and a more complete publication was produced in 2003 by a Dagomba scholar, Ibrahim Mahama. According to the linguist Salifu Nantogma Alhassan, there is evidence to suggest that there are gender-related double standards in the Dagbani language with \"more labels that trivialise females than males.\" Meanwhile, the data was electronically compiled by John Miller Chernoff and Roger Blench (whose version is published online), and converted to a database by Tony Naden, on the basis of which a full-featured dictionary is ongoing and can be viewed online.", "* Tony Naden"]}, {"page": "Naden", "response": ["*Tony Naden, British lexicographer"]}]}}