{"wiki_id": "http://www.wikidata.org/entity/Q2247716", "itemLabel": "G. L. S. Shackle", "itemDescription": "British economist", "wikipedia_url": "https://en.wikipedia.org/wiki/G._L._S._Shackle", "wikipedia_page": {"main": "George Lennox Sharman Shackle (14 July 1903 – 3 March 1992) was an English economist. He made a practical attempt to challenge classical rational choice theory and has been characterised as a \"post-Keynesian\", though he is influenced as well by Austrian economics. Much of his work is associated with the Dempster–Shafer theory of evidence.", "link_mentions": [{"page": "Keynesian economics", "response": ["G. L. S. Shackle regarded Keynes' move away from Kahn's multiplier as ..."]}, {"page": "Dempster–Shafer theory", "response": ["*G. L. S. Shackle"]}, {"page": "Common cause and special cause (statistics)", "response": ["The distinction has been particularly important in the thinking of economists Frank Knight, John Maynard Keynes and G. L. S. Shackle.", "Keynes' thinking was at odds with the classical liberalism of the Austrian School of economists, but G. L. S. Shackle recognised the importance of Keynes's insight and sought to formalise it within a free-market philosophy."]}, {"page": "Gunnar Myrdal", "response": ["Economist G. L. S. Shackle claimed the importance of Gunnar Myrdal's analysis by which saving and investment are allowed to adjust ex ante to each other. However, the reference to ex ante and ex post analysis has become so usual in modern macroeconomics that the position of Keynes to not include it in his work was currently considered as an oddity, if not a mistake. As Shackle put it:"]}, {"page": "The Perse School", "response": ["*G. L. S. Shackle, economist"]}, {"page": "Knightian uncertainty", "response": ["Whilst Frank Knight's seminal book elaborated the problem, his focus was on how uncertainty generates imperfect market structures and explains actual profits. Work on estimating and mitigating uncertainty was continued by G. L. S. Shackle who later followed up with Potential Surprise Theory."]}, {"page": "Possibility theory", "response": ["Possibility theory is a mathematical theory for dealing with certain types of uncertainty and is an alternative to probability theory. It uses measures of possibility and necessity between 0 and 1, ranging from impossible to possible and unnecessary to necessary, respectively. Professor Lotfi Zadeh first introduced possibility theory in 1978 as an extension of his theory of fuzzy sets and fuzzy logic. Didier Dubois and Henri Prade further contributed to its development. Earlier in the 1950s, economist G. L. S. Shackle proposed the min/max algebra to describe degrees of potential surprise."]}]}}