{"wiki_id": "http://www.wikidata.org/entity/Q2248582", "itemLabel": "William Rowley", "itemDescription": "English Jacobean dramatist (1585-1626)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Rowley", "wikipedia_page": {"main": "William Rowley (c.1585 – February 1626) was an English Jacobean dramatist, best known for works written in collaboration with more successful writers. His date of birth is estimated to have been c. 1585; he was buried on 11 February 1626 in the graveyard of St James's, Clerkenwell in north London. (An unambiguous record of Rowley's death was discovered in 1928, but some authorities persist in listing his death-date as 1642.)", "link_mentions": [{"page": "1620s", "response": ["* William Rowley of England (1585?-1626), playwright"]}, {"page": "English Renaissance theatre", "response": ["  bar:Rowley      text:William Rowley", "*William Rowley", "*William Rowley"]}, {"page": "Thomas Middleton", "response": ["In the 1610s, Middleton began a fruitful collaboration with the actor William Rowley, producing Wit at Several Weapons and A Fair Quarrel. Working alone in 1613, Middleton produced a comic masterpiece: A Chaste Maid in Cheapside. He also became increasingly involved with civic pageants, and in 1620 became officially appointed as chronologist to the City of London, a post he held until his death in 1627, when it passed to Jonson.", "Middleton wrote in many genres, including tragedy, history and city comedy. His best-known plays are the tragedies The Changeling (with William Rowley) and Women Beware Women, and the cynically satirical city comedy A Chaste Maid in Cheapside. Earlier editions of The Revenger's Tragedy attributed the play to Cyril Tourneur,Three Jacobean Tragedies (Penguin, 1968) and the Revels edition (Manchester UP, 1975) stated so on the cover, although the Revels editor makes a case for Middleton inside. or refused to arbitrate between Middleton and Tourneur.The New Mermaids and Revels Student Edition leave open the question of authorship. However, since the statistical studies by David LakeThe Canon of Middleton's Plays (Cambridge University Press, 1975). and MacDonald P. Jackson,Middleton and Shakespeare: Studies in Attribution (1979). Middleton's authorship has not been seriously contested, and no further scholar has defended the Tourneur attribution.The play is attributed to Middleton in Jackson's facsimile edition of the 1607 quarto (1983), in Bryan Loughrey and Neil Taylor's edition of Five Middleton Plays (Penguin, 1988), and in Thomas Middleton: The Collected Works (Oxford, 2007).", "*Wit at Several Weapons, a city comedy (1613); printed as part of the Beaumont and Fletcher Folio, but stylistic analysis indicates comprehensive revision by Middleton and William Rowley.", "*The World Tossed at Tennis (1620). Co-written with William Rowley."]}, {"page": "English drama", "response": ["Other revenge tragedies include The Changeling written by Thomas Middleton and William Rowley, The Atheist's Tragedy by Cyril Tourneur, first published in 1611, Christopher Marlowe's The Jew of Malta, The Revenge of Bussy D'Ambois by George Chapman, The Malcontent (c. 1603) of John Marston and John Ford's 'Tis Pity She's a Whore. Besides Hamlet, other plays of Shakespeare's with at least some revenge elements, are Titus Andronicus, Julius Caesar, and Macbeth."]}, {"page": "Philip Massinger", "response": ["With John Fletcher, John Ford, and William Rowley (?), or John Webster (?):", "With Thomas Middleton and William Rowley:"]}, {"page": "17th century in literature", "response": ["*A Faire Quarrell (play) – Thomas Middleton and William Rowley", "*The Changeling – Thomas Middleton and William Rowley text"]}, {"page": "1661 in literature", "response": ["*William Rowley & Thomas Heywood (?) – The Thracian Wonder (published); previously misattributed to Webster, exact authorship still uncertain,Logan, Terence P., and Denzell S. Smith, eds. The Popular School: A Survey and Bibliography of Recent Studies in English Renaissance Drama. Lincoln, NE, University of Nebraska Press, 1975 probably written c.1600/10", "*John Webster & William Rowley – A Cure for a Cuckold (published)"]}, {"page": "1658 in literature", "response": ["*Thomas Dekker, John Ford, and William Rowley – The Witch of Edmonton (posthumous)"]}, {"page": "1656 in literature", "response": ["*Thomas Middleton, William Rowley, & Philip Massinger – The Old Law"]}, {"page": "1655 in literature", "response": ["*Thomas Heywood and William Rowley – Fortune by Land and Sea"]}, {"page": "1633 in literature", "response": ["*William Rowley (published)"]}, {"page": "1626 in literature", "response": ["*February – William Rowley, English dramatist (born c. 1585)"]}, {"page": "1624 in literature", "response": ["*December 20 – The King's Men provide Sir Henry Herbert (Master of the Revels) with a \"submission,\" a written apology, signed by each actor who had taken part in The Spanish Viceroy earlier in the month. The signatories include Robert Benfield, George Birch, John Lowin, Thomas Pollard, John Rice, Richard Robinson, William Rowley, John Shank, Richard Sharpe, Eliard Swanston, and Joseph Taylor."]}, {"page": "1623 in literature", "response": ["*Thomas Dekker, John Ford, & William Rowley (?) – The Spanish Gypsy", "*John Fletcher and William Rowley – The Maid in the Mill"]}, {"page": "1622 in literature", "response": ["*Thomas Middleton and William Rowley – The Changeling", "*William Rowley(? and another?) – The Birth of Merlin"]}, {"page": "1621 in literature", "response": ["*Thomas Dekker, John Ford, & William Rowley – The Witch of Edmonton"]}, {"page": "1620 in literature", "response": ["*Thomas Middleton & William Rowley – The World Tossed at Tennis (masque)"]}, {"page": "1617 in literature", "response": ["*Thomas Middleton and William Rowley – A Fair Quarrel published"]}, {"page": "1609 in literature", "response": ["*William Rowley – A Search for Money"]}, {"page": "1607 in literature", "response": ["*John Day, William Rowley, and George Wilkins – The Travels of the Three English Brothers"]}, {"page": "John Webster", "response": ["Webster wrote one more play on his own: The Devil's Law Case (c. 1617–1619), a tragicomedy. His later plays were collaborative city comedies: Anything for a Quiet Life () co-written with Thomas Middleton and A Cure for a Cuckold (c. 1624) co-written with William Rowley. In 1624, he also co-wrote a topical play about a recent scandal, Keep the Widow Waking (with John Ford, Rowley and Dekker). The play is lost, but its plot is known from a court case. He is believed to have contributed to the tragicomedy The Fair Maid of the Inn with John Fletcher, Ford and Phillip Massinger. His Appius and Virginia, probably written with Thomas Heywood, is of uncertain date."]}, {"page": "Thomas Dekker (writer)", "response": ["On release, he resumed writing plays, now with collaborators both from his generation (John Day and John Webster) and slightly younger writers (John Ford and Philip Massinger). Among these plays is one, Keep the Widow Waking (1624, with Ford, Webster, and William Rowley), which dramatized two recent murders in Whitechapel. In the latter half of the decade, Dekker turned once more to pamphlet-writing, revamping old work and writing a new preface to his most popular tract, The Bellman of London."]}, {"page": "John Ford (dramatist)", "response": ["Prior to the start of his career as a playwright, Ford wrote other non-dramatic literary works—the long religious poem Christ's Bloody Sweat (1613), and two prose essays published as pamphlets, The Golden Mean (1613) and A Line of Life (1620).Stavig, pp. 20–35. After 1620 he began active dramatic writing, first as a collaborator with more experienced playwrights—primarily Thomas Dekker, but also John Webster and William Rowley—and by the later 1620s as a solo artist.", "*The Witch of Edmonton  (1621; printed 1658), with Thomas Dekker and William Rowley;", "As is typical for pre-Restoration playwrights, a significant portion of Ford's output has not survived. Lost plays by Ford include The Royal Combat and Beauty in a Trance, plus more collaborations with Dekker: The London Merchant, The Bristol Merchant, The Fairy Knight,Critics regard the Ford/Dekker Fairy Knight as distinct from the extant manuscript play of the same name. and Keep the Widow Waking, the last also with William Rowley and John Webster."]}, {"page": "British literature", "response": ["A popular style of theatre in Jacobean times was the revenge play, which had been popularised earlier by Thomas Kyd (1558–94), and then developed by John Webster (1578–1632) in the 17th century. Webster's most famous plays are The White Devil (1612) and The Duchess of Malfi (1613). Other revenge tragedies include The Changeling written by Thomas Middleton and William Rowley."]}, {"page": "John Day (dramatist)", "response": ["The first play in which Day appears as part-author is The Conquest of Brute, with the finding of the Bath (1598), which, with most of his early work, is lost. Day's earliest extant work, written in collaboration with Chettle, is The Blind Beggar of Bethnal Green (acted 1600, printed 1659), a drama dealing with the early years of the reign of Henry VI. It bore the sub-title of The Merry Humor of Tom Strowd, the Norfolk Yeoman, and was so popular that second and third parts, by Day and Haughton, were produced in the next year. The Isle of Gulls (printed 1606), a prose comedy founded upon Sir Philip Sidney's Arcadia, contains in its light dialogue much satire to which the key is now lost, but Algernon Charles Swinburne notes in Manasses's burlesque of a Puritan sermon is a curious anticipation of the eloquence of Mr. Chadband in Bleak House. In 1607 Day produced, in conjunction with William Rowley and George Wilkins, The Travels of the Three English Brothers, which detailed the adventures of Sir Thomas, Sir Anthony and Robert Shirley. This play is a dramatic romance of a type that hearkened back to the early decades of the public stage in London. In 1608 Day published two comedies, Law Tricks, or Who Would have Thought it? and Humour out of Breath."]}, {"page": "Samuel Rowley", "response": ["The long-uncertain question of his connection to the more-famous William Rowley was perhaps clarified by the discovery of his will in the 1960s: in this document, a brother named William is bequeathed all of Samuel's books. Samuel Rowley died in the parish of St Mary's in Whitechapel, where he had resided for decades."]}, {"page": "Thomas Heywood", "response": ["* Fortune by Land and Sea (printed 1655), written in collaboration with William Rowley"]}, {"page": "George Wilkins", "response": ["He is first heard of as the author of a pamphlet on the Three Miseries of Barbary, which dates from 1606.Krueger, Robert (1961). “Manuscript Evidence for dates of two Short Title Catalogue books: George Wilkins’s ‘Three Miseries of Barbary’ and the third edition of Elizabeth Grymeston’s ‘Miscelanea’.” The Library s5-XVI(2):141-142 He then collaborated in 1607 with William Rowley and John Day in The Travels of the Three English Brothers, a dramatisation of the real-life adventures of the Sherley brothers."]}, {"page": "Robert Shirley", "response": ["The exploits of the Shirley brothers were dramatised in the 1607 play The Travels of the Three English Brothers by John Day, William Rowley and George Wilkins."]}, {"page": "Pericles, Prince of Tyre", "response": ["The choruses spoken by Gower were influenced by Barnabe Barnes's The Diuils Charter (1607) and by The Trauailes of the Three English Brothers (1607), by John Day, William Rowley, and Wilkins.British Library, \"Pericles, creation of the play\", Shakespeare Quartos."]}, {"page": "Spitalfields", "response": ["Spitalfields figures in a number of works of literature, including A New Wonder, a Woman Never Vexed (performed 1610–14; printed 1632) by William Rowley, a dramatisation of the foundation of St Mary Spital; The People of the Abyss (1903), the journalistic memoir by Jack London; Hawksmoor (1985) by Peter Ackroyd; Rodinsky's Room (1999) by Iain Sinclair and Rachel Lichtenstein; Brick Lane (2003) by Monica Ali; and The Quincunx (1991) by Charles Palliser."]}, {"page": "Shakespeare apocrypha", "response": ["* The Birth of Merlin was published in 1662 as the work of Shakespeare and William Rowley. This attribution is demonstrably fraudulent, or mistaken, as there is unambiguous evidence that the play was written in 1622, six years after Shakespeare's death. It is unlikely that Shakespeare and Rowley would have written together, as they were both chief dramatists for rival playing companies. The play has been called \"funny, colorful, and fast-paced\",Dominik (1991), p. 7. but critical consensus follows Henry Tyrrell's conclusion that the play \"does not contain in it one single trace of the genius of the bard of Avon\",Tyrrell (1800), p. 411. supplemented by C. F. Tucker Brooke's suggestion that Rowley was consciously imitating Shakespeare's style.Tucker Brooke (1908), p. xlvi."]}, {"page": "King's Men (playing company)", "response": ["Sometime in 1623, the veteran clown William Rowley joined the King's Men for the final two years in his stage career. He would play the Fat Bishop in the next year's A Game at Chess. Richard Perkins, a leading actor from Queen Anne's Men and the Red Bull company, also joined the King's Men late in 1623."]}, {"page": "The Birth of Merlin", "response": ["The Birth of Merlin, or, The Child Hath Found his Father is a Jacobean play, probably written in whole or part by William Rowley. It was first performed in 1622 at the Curtain Theatre in Shoreditch. It contains a comic depiction of the birth of the fully grown Merlin to a country girl, and also features figures from Arthurian legend, including Uther Pendragon, Vortigern, and Aurelius Ambrosius.", "The 1662 first edition of The Birth of Merlin was a quarto printed by Thomas Johnson for the booksellers Francis Kirkman and Henry Marsh; it attributed the play to William Shakespeare and William Rowley. Merlin is thus one of two plays published in the seventeenth century as a Shakespearean collaboration, the other being The Two Noble Kinsmen. Most scholars reject the attribution to Shakespeare and believe that the play is Rowley's, perhaps with a different collaborator. The play has occasionally been revived in the modern era, for example at Theatr Clwyd."]}, {"page": "The Changeling (play)", "response": ["The Changeling is a Jacobean tragedy written by Thomas Middleton and William Rowley. Widely regarded as being among the best tragedies of the English Renaissance, the play has accumulated a large amount of critical commentary.Logan and Smith, pp. 54–55, 59–60, 263–9.", "Category:Plays by William Rowley"]}, {"page": "Saint Winifred", "response": ["William Rowley's 17th-century comedy A Shoemaker a Gentleman dramatises St. Winifred's story, based on the version in Thomas Deloney's story The Gentle Craft (1584)."]}]}}