{"wiki_id": "http://www.wikidata.org/entity/Q2243853", "itemLabel": "Norman Willis", "itemDescription": "British trade unionist; General Secatary of the TUC (1933-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Willis", "wikipedia_page": {"main": "Norman David Willis (21 January 1933 – 7 June 2014) was the General Secretary of the Trades Union Congress (TUC) in the United Kingdom from 1984 to 1993, and President of the European Trade Union Confederation (ETUC) from 1991 to 1993.", "link_mentions": [{"page": "Hayes, Hillingdon", "response": ["* Former TUC leader Norman Willis (1933–2014) was born in Hayes."]}, {"page": "UK miners' strike (1984–85)", "response": ["In contrast to the close cooperation with the Trades Union Congress in the 1970s, the NUM never asked the TUC to support the strike and wrote at the outset to say that, \"No request is being made by this union for the intervention or assistance of the TUC.\"  Scargill disliked Len Murray and blamed the TUC for the failure of the 1926 General Strike. Part way through the strike, Norman Willis took over from Murray as general secretary of the TUC. He attempted to repair relations between Scargill and Kinnock, but to no avail.  When speaking in a miners' hall in November 1984, Willis condemned the violence and advocated a compromise, which led to a noose being lowered slowly from the rafters until it rested close to his head."]}, {"page": "List of Have I Got News for You episodes", "response": ["|Norman Willis"]}, {"page": "General Secretary of the Trades Union Congress", "response": ["*Norman Willis (7 September 1984 – 10 September 1993)", ":1977: Norman Willis", ":1973: Norman Willis"]}, {"page": "Sunbury-on-Thames", "response": ["|Norman Willis – Trade Union Congress general secretary and President of the European Trade Union Confederation|| ||2010s"]}, {"page": "Ashford, Surrey", "response": ["* Norman Willis, General Secretary of the Trades Union Congress (TUC) 1984–92 and president of the European Trade Union Confederation 1991–93"]}, {"page": "European Trade Union Confederation", "response": ["| Norman Willis || 1991–1993 || TUC, United Kingdom"]}, {"page": "Norman David Willis", "response": ["#redirect Norman Willis"]}, {"page": "Spelthorne College", "response": ["* Norman Willis, TUC General Secretary 1984–93"]}, {"page": "List of Oriel College, Oxford, people", "response": ["* Norman Willis – Former General Secretary of the TUC and President of the European Trade Union Confederation."]}, {"page": "Willis (surname)", "response": ["*Norman Willis (1933–2014), British TYC General Secretary (1984–93)"]}, {"page": "That Certain Woman", "response": ["* Norman Willis as Fred"]}, {"page": "Brooklands College", "response": ["* Norman Willis, General Secretary of the TUC, 1984–93"]}, {"page": "List of Question Time episodes", "response": ["|Norman Lamont, Jonathon Porritt, Elizabeth Rees, Norman Willis"]}, {"page": "List of people from the London Borough of Hillingdon", "response": ["* Norman Willis (1933–2014), former leader of the TUC, was born in Hayes."]}, {"page": "List of people who have declined a British honour", "response": ["*Norman Willis, General-Secretary, TUC.", "*Norman Willis, general secretary of the Trades Union Congress; \"turned down a knighthood offered to him by John Major, just as he had turned aside a proposal from the Labour leader John Smith that he might consider going into the House of Lords\"."]}, {"page": "Men in Exile", "response": ["* Norman Willis as Rocky Crane"]}, {"page": "2014 in the United Kingdom", "response": ["**Norman Willis, 81, trade unionist, General Secretary for the TUC (19841993)."]}, {"page": "Hands Across Britain", "response": ["At the time of the start of official campaigning in January 1987, 11 per cent of people were unemployed in the United Kingdom, and it was expected to be a major issue at the 1987 United Kingdom general election. Support was garnered from Cardinal Basil Hume, along with more than 60 celebrities which included Glenda Jackson and Sting. Support also came from the political spectrum with the General Secretary of the Union of Communication Workers Alan Tuffin and the General Secretary of the Trade Union Congress Norman Willis."]}, {"page": "Deaths in June 2014", "response": ["*Norman Willis, 81, British trade unionist, General Secretary of the TUC (1984–1993).Ex-TUC leader Norman Willis dies aged 81"]}, {"page": "I Escaped from the Gestapo", "response": ["*Norman Willis as FBI Chief Rodt"]}, {"page": "History of trade unions in the United Kingdom", "response": ["The strong anti-communist policy persisted in the postwar era. The unions  gave strong support to British participation in the Cold War and NATO, as well as international bodies such as the international Confederation of Free Trade Unions that excluded communist unions of the sort that joined the Soviet-dominated World Federation of Trade Unions. In some unions, especially the National Union of Mineworkers (NUM), the Communists did have some power, as typified by Mick McGahey, vice-president from 1972 to 1987, and Arthur Scargill, the president from 1982 to 2002. More effective in the Communist cause was Ken Gill, president of a large  union and in 1974 the first Communist elected in decades to  the TUC General Council.  He focused on racial issues.Robert Taylor , The TUC: From the General Strike to New Unionism (2000) p. 231  British unions collaborated with the AFL–CIO in the United States on international projects. In the 1980s, worldwide union attention focused on the Solidarity union movement in Poland, which finally succeeded in breaking the communist control of that country. Norman Willis, the general secretary of the TUC, vigorously promoted union support for Solidarity.  The nuclear disarmament movement, which played a major role in Labour Party internal politics in the 1980s, was primarily a middle-class movement that had little support in the labour movement.Ben Pimlott and Chris Cook, eds., Trade Unions in British Politics: The First 250 Years (1991) pp 201-3, 290-92."]}, {"page": "Roy Jackson (trade unionist)", "response": ["Born in Paddington in London, Jackson was educated at North Paddington Central School.  He left to work for the Post Office Savings Bank, followed by a period of National Service with the Royal Navy.  When released from the Navy, he won a trade union scholarship to Ruskin College, where he studied alongside Norman Willis.  He then moved on to Worcester College, Oxford where he completed a degree in philosophy, politics and economics."]}, {"page": "Adam Sharples", "response": ["Sharples entered HM Civil Service in 1988 as a principal in HM Treasury. His departure from NUPE drew comment from The Times, which used him as an example of the \"haemorrhage of talent from the unions of the boys and girls who would, in other circumstances, have grown up into the Norman Willises and Clive Jenkinses of the early 21st century. What's galling isn't just that they're going, but that they are going to the very places doing the unions down\".David Walker, \"Times Diary\", The Times (London), 15 November 1988. "]}]}}