{"wiki_id": "http://www.wikidata.org/entity/Q225392", "itemLabel": "John Redmond", "itemDescription": "Irish politician (1856-1918)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Redmond", "wikipedia_page": {"main": "John Edward Redmond (1 September 1856 – 6 March 1918) was an Irish nationalist politician, barrister, and MP in the House of Commons of the United Kingdom. He was best known as leader of the moderate Irish Parliamentary Party (IPP) from 1900 until his death in 1918. He was also leader of the paramilitary organisation the Irish National Volunteers (INV).\nHe was born to an old prominent Catholic family in rural Ireland; several relatives were politicians. He took over control of the minority IPP faction loyal to Charles Stewart Parnell when that leader died in 1891. Redmond was a conciliatory politician who achieved the two main objectives of his political life: party unity and, in September 1914, the passing of the Government of Ireland Act 1914. The Act granted limited self-government to Ireland, within the United Kingdom. However, implementation of Home Rule was suspended by the outbreak of the First World War. Redmond called on the National Volunteers to join Irish regiments of the New British Army and support the British and Allied war effort to restore the \"freedom of small nations\" on the European continent, thereby to also ensure the implementation of Home Rule after a war that was expected to be of short duration. However, after the Easter Rising of 1916, Irish public opinion shifted in favour of militant republicanism and full Irish independence, so that his party lost its dominance in Irish politics.", "link_mentions": [{"page": "Easter Rising", "response": ["As the executions went on, the Irish public grew increasingly hostile towards the British and sympathetic to the rebels. After the first three executions, John Redmond, leader of the moderate Irish Parliamentary Party, said in the British Parliament that the rising \"happily, seems to be over. It has been dealt with with firmness, which was not only right, but it was the duty of the Government to so deal with it\".House of Commons debate, 3 May 1916: Resignation of Mr Birrell . Hansard. However, he urged the Government \"not to show undue hardship or severity to the great masses of those who are implicated\". As the executions continued, Redmond pleaded with Prime Minister H. H. Asquith to stop them, warning that \"if more executions take place in Ireland, the position will become impossible for any constitutional party\".Finnan, Joseph. John Redmond and Irish Unity: 1912 – 1918. Syracuse University Press, 2004. p. 196 Ulster Unionist Party leader Edward Carson expressed similar views.Lewis, Geoffrey. Carson: The Man Who Divided Ireland. Bloomsbury Publishing, 2006. p. 185 Redmond's deputy, John Dillon, made an impassioned speech in parliament, saying \"thousands of people […] who ten days ago were bitterly opposed to the whole of the Sinn Fein movement and to the rebellion, are now becoming infuriated against the Government on account of these executions\". He said \"it is not murderers who are being executed; it is insurgents who have fought a clean fight, a brave fight, however misguided\". Dillon was heckled by English MPs.House of Commons debate, 11 May 1916: Continuance of martial law . Hansard. The British Government itself had also become concerned at the reaction to the executions, and at the way the courts-martial were being carried out. Asquith had warned Maxwell that \"a large number of executions would […] sow the seeds of lasting trouble in Ireland\".\"Easter Rising 1916 – the aftermath: arrests and executions\" . The Irish Times, 24 March 2016. After Connolly's execution, Maxwell bowed to pressure and had the other death sentences commuted to penal servitude.Foy and Barton, p. 325"]}, {"page": "Republic of Ireland", "response": ["Home Rule seemed certain when the Parliament Act 1911 abolished the veto of the House of Lords, and John Redmond secured the Third Home Rule Act in 1914. However, the Unionist movement had been growing since 1886 among Irish Protestants after the introduction of the first home rule bill, fearing discrimination and loss of economic and social privileges if Irish Catholics achieved real political power. In the late 19th and early 20th-century unionism was particularly strong in parts of Ulster, where industrialisation was more common in contrast to the more agrarian rest of the island, and where the Protestant population was more prominent, with a majority in four counties. Under the leadership of the Dublin-born Sir Edward Carson of the Irish Unionist Party and the Ulsterman Sir James Craig of the Ulster Unionist Party, unionists became strongly militant in order to oppose \"the Coercion of Ulster\". After the Home Rule Bill passed parliament in May 1914, to avoid rebellion with Ulster, the British Prime Minister H. H. Asquith introduced an Amending Bill reluctantly conceded to by the Irish Party leadership. This provided for the temporary exclusion of Ulster from the workings of the bill for a trial period of six years, with an as yet undecided new set of measures to be introduced for the area to be temporarily excluded."]}, {"page": "Roger Casement", "response": ["Elements of the suspicious Clan did not trust Casement completely, as he was not a member of the IRB and held views they considered too moderate. But others, such as John Quinn, regarded him as extreme. Devoy, initially hostile to Casement for his part in conceding control of the Irish Volunteers to John Redmond, was won over in June, and Joseph McGarrity, another Clan leader, became devoted to Casement and remained so from then on.Ó Síocháin, Séamas, Roger Casement: Imperialist, Rebel, Revolutionary, p. 382 The Howth gun-running in late July 1914, which Casement had helped to organise and finance, further enhanced his reputation."]}, {"page": "Rudyard Kipling", "response": ["Kipling wrote the poem \"Ulster\" in 1912, reflecting his Unionist politics. Kipling often referred to the Irish Unionists as \"our party\".Gilmour, p. 241. Kipling had no sympathy or understanding for Irish nationalism, seeing Home Rule as an act of treason by the government of the Liberal Prime Minister H. H. Asquith that would plunge Ireland into the Dark Ages and allow the Irish Catholic majority to oppress the Protestant minority.Gilmour, pp. 242–244. The scholar David Gilmour wrote that Kipling's lack of understanding of Ireland could be seen in his attack on John Redmond – the Anglophile leader of the Irish Parliamentary Party who wanted Home Rule because he believed it was the best way of keeping the United Kingdom together – as a traitor working to break up the United Kingdom.Gilmour, p. 244. Ulster was first publicly read at an Unionist rally in Belfast, where the largest Union Jack ever made was unfolded. Kipling admitted it was meant to strike a \"hard blow\" against the Asquith government's Home Rule bill: \"Rebellion, rapine, hate, Oppression, wrong and greed, Are loosed to rule our fate, By England's act and deed.\" Ulster generated much controversy with the Conservative MP Sir Mark Sykes – who as a Unionist was opposed to the Home Rule bill – condemning Ulster in The Morning Post as a \"direct appeal to ignorance and a deliberate attempt to foster religious hate.\""]}, {"page": "Éamon de Valera", "response": ["While he was already involved in the Gaelic revival, de Valera's involvement in the political revolution began on 25 November 1913, when he joined the Irish Volunteers. The organisation was formed to oppose the Ulster Volunteers and ensure the enactment of the Irish Parliamentary Party's Third Home Rule Act won by its leader John Redmond. After the outbreak of World War I in August 1914, de Valera rose through the ranks and it was not long before he was elected captain of the Donnybrook branch. Preparations were pushed ahead for an armed revolt, and he was made commandant of the Third Battalion and adjutant of the Dublin Brigade. He took part in the Howth gun-running. He was sworn by Thomas MacDonagh into the oath-bound Irish Republican Brotherhood, which secretly controlled the central executive of the Volunteers. He opposed secret societies, but this was the only way he could be guaranteed full information on plans for the Rising.Jordan, Anthony J. Eamon de Valera 1882–1975, p. 32.", "After imprisonment in Dartmoor, Maidstone and Lewes prisons, de Valera and his comrades were released under an amnesty in June 1917. On 10 July 1917, he was elected as the Member of Parliament (MP) for East Clare (the constituency which he represented until 1959) in a by-election caused by the death of the previous incumbent Willie Redmond, brother of the Irish Party leader John Redmond who had died fighting in World War I. In the 1918 general election he was elected both for that seat and Mayo East. But because most other Irish rebellion leaders were dead, in 1917 he was elected President of Sinn Féin, the party which had been blamed incorrectly for provoking the Easter Rising. This party became the political vehicle through which the survivors of the Easter Rising channelled their republican ethos and objectives. The previous President of Sinn Féin, Arthur Griffith, had championed an Anglo-Irish dual-monarchy based on the Austro-Hungarian model, with independent legislatures for both Ireland and Britain."]}, {"page": "Emmeline Pankhurst", "response": ["In 1912 WSPU members adopted arson as another tactic to win the vote. After Prime Minister Asquith had visited the Theatre Royal in Dublin, suffragette activists Gladys Evans, Mary Leigh, Lizzie Baker and Mabel Capper of Oxford Street, Manchester attempted to cause an explosion using gunpowder and benzine, which resulted in minimal damage. During the same evening Mary Leigh threw an axe at the carriage containing John Redmond (leader of the Irish Parliamentary Party), the Lord Mayor, and Asquith.Manchester Guardian 20 July 1912, \"The Dublin Outrages by Women\" Over the next two years women set fire to a refreshments building in Regent's Park, an orchid house at Kew Gardens, pillar boxes, and a railway carriage. Emily Davison threw herself under the Kings Horse at the Epsom Derby in 1913. Her funeral drew 55,000 attendees along the streets and at the funeral. This gave significant publicity to the movement. "]}, {"page": "Conradh na Gaeilge", "response": ["Increasingly Republicans were blunt about what they saw as the League's place within the nationalist movement. The paper, Irish Freedom, declared:The work of the Gaelic League is to prevent the assimilation of the Irish nation by the English nation [...] The work is as essentially anti-English as the work attempted by Fenianism or the Society of United Irishmen [...] The Irish language is a political weapon of the first importance against English encroachment.The issue of the League's political independence was decided at its Annual General Meeting held in Dundalk in 1915. Rumours circulated that John Redmond's Irish Parliamentary Party were seeking to take over the League as they had earlier attempted to take over the Irish Volunteers. Diarmuid Lynch of the IRB mobilised Brotherhood members positioned throughout the League to secure the nominations and votes required to appoint a new Coiste (executive) that \"was safe from the IRB viewpoint\"."]}, {"page": "Fianna Éireann", "response": ["Fianna officers made a decision and detoured with their gun-laden cart up the Howth Road, arriving eventually at Kilmore Road, Artane, where the arms were stored for future recovery. Hobson reluctantly allowed John Redmond to gain influence over the Volunteers, leading to a split at the outbreak of World War I. This and his subsequent opposition to the Easter Rising (he was kept under armed guard that Easter Monday by Seán Mac Diarmada until the rising was well underway) led to Hobson's being sidelined by the republican movement and removed from any leadership role for the rest of his life."]}, {"page": "H. H. Asquith", "response": ["As a minority party after 1910 elections, the Liberals depended on the Irish vote, controlled by John Redmond. To gain Irish support for the budget and the parliament bill, Asquith promised Redmond that Irish Home Rule would be the highest priority.George Dangerfield, The Strange Death of Liberal England (1935) pp. 74–76. It proved much more complex and time-consuming than expected. Support for self-government for Ireland had been a tenet of the Liberal Party since 1886, but Asquith had not been as enthusiastic, stating in 1903 (while in opposition) that the party should never take office if that government would be dependent for survival on the support of the Irish Nationalist Party. After 1910, though, Irish Nationalist votes were essential to stay in power. Retaining Ireland in the Union was the declared intent of all parties, and the Nationalists, as part of the majority that kept Asquith in office, were entitled to seek enactment of their plans for Home Rule, and to expect Liberal and Labour support. The Conservatives, with die-hard support from the Protestant Orangemen of Ulster, were strongly opposed to Home Rule. The desire to retain a veto for the Lords on such bills had been an unbridgeable gap between the parties in the constitutional talks prior to the second 1910 election."]}, {"page": "Waterford", "response": ["The city was represented in the Parliament of the United Kingdom from 1891 to 1918 by John Redmond MP, leader (from January 1900) of the Irish Parliamentary Party. Redmond, then leader of the pro-Parnell faction of the party, defeated David Sheehy in 1891. In 1911, Br. Jerome Foley, Br. Dunstan Drumm and Br. Leopold Loughran left Waterford for Malvern, Australia. Here, they founded a Catholic college which is still in existence today.Steve Stefanopolous, St. Joseph's Malvern, 2003. Held by the De La Salle College Malvern Archives"]}, {"page": "Michael Collins (Irish leader)", "response": ["The settlement overturned the Act of Union by recognising the native Irish legislature's independence. Under a bicameral parliament, executive authority would remain vested in the king, represented in Ireland by a Governor General, but exercised by an Irish government elected by Dáil Éireann as a \"lower house\". British forces would depart the Free State forthwith and be replaced by an Irish army. Along with an independent judiciary, the Treaty granted the new Free State greater independence than any Irish state, and went well beyond the Home Rule which had been sought by Charles Stewart Parnell or by his Irish Parliamentary Party successors John Redmond and John Dillon."]}, {"page": "Seán Lemass", "response": ["Lemass remains one of the most highly regarded holders of the office of Taoiseach, being described even by later Fine Gael Taoisigh Garret FitzGerald and John BrutonBruton hung a picture of Lemass, as well as Irish Parliamentary Party leader John Redmond, in his office. as the best holder of the office, and the man whose cabinet leadership style they wished to follow. Some historians have questioned whether Lemass came to the premiership too late, arguing that had he replaced de Valera as Fianna Fáil leader and Taoiseach in 1951 he could have begun the process of reform of Irish society and the industrialisation of Ireland a decade earlier than 1959 when he eventually achieved the top governmental job. Others speculate whether he had been able to achieve some of his policy reforms he did initiate in the 1950s precisely because de Valera was still the leader, his opponents being unwilling to challenge him given that he appeared to have de Valera's backing."]}, {"page": "Ireland", "response": ["Their formation was followed in 1914 by the establishment of the Irish Volunteers, whose aim was to ensure that the Home Rule Bill was passed. The Act was passed but with the \"temporary\" exclusion of the six counties of Ulster that would become Northern Ireland. Before it could be implemented, however, the Act was suspended for the duration of the First World War. The Irish Volunteers split into two groups. The majority, approximately 175,000 in number, under John Redmond, took the name National Volunteers and supported Irish involvement in the war. A minority, approximately 13,000, retained the Irish Volunteers' name and opposed Ireland's involvement in the war."]}, {"page": "United Kingdom of Great Britain and Ireland", "response": ["Gladstone took the issue to the people in the 1886 election, but the unionists (Conservatives plus Liberal Unionists) won a majority. In 1890 a divorce case showed Parnell was an adulterer; he was forced from power, and died in 1891. Gladstone introduced a Second Home Rule Bill in 1893, which this time was passed by the Commons, but was defeated in the Conservative-dominated House of Lords. The Conservatives came to power until 1906 and Home Rule was a dead issue, but the subsidised sale of farm land greatly reduced the Protestant presence in Ireland south of Ulster. Having been rejected by the Conservatives, the Irish nationalist forces had little choice but to support the minority Liberal Party. New groups split off and they finally all merged in 1900 into the Irish Parliamentary Party led by John Redmond."]}, {"page": "Tim Healy (politician)", "response": ["Parnell admired Healy's intelligence and energy after Healy had established himself as part of Parnell's broader political circle. He became Parnell's secretary but was denied contact to Parnell's small inner circle of political colleagues. Parnell, however, brought Healy into the Irish Party (IPP) and supported him as a nationalist candidate when elected MP for Wexford Borough in 1880–83 against the aspiring John Redmond whose father, William Archer Redmond, was its recently deceased MP. Healy was returned unopposed to parliament, aided by the fact that Redmond stood aside and that he had survived an agrarian court case which alleging intimidation.", "Following Parnell's death in 1891, the IPP's anti-Parnellite majority group broke away forming the Irish National Federation (INF) under John Dillon. Healy was at first its most outspoken member, when in 1892 he captured North Louth for the anti-Parnellites, who in all won seventy-one seats. But finding it impossible to work with or under any post-Parnell leadership, especially Dillon's, he was expelled in 1895 from the INF executive committee, having previously been expelled from the Irish party's minor nine-member pro-Parnellite Irish National League (INL) under John Redmond.Callanan, T. M Healy (1996)"]}, {"page": "Charles Stewart Parnell", "response": ["When the annual party leadership election was held on 25 November, Gladstone's threat was not conveyed to the members until after they had loyally re-elected their 'chief' in his office. Gladstone published his warning in a letter the next day; angry members demanded a new meeting, and this was called for 1 December. Parnell issued a manifesto on 29 November, saying a section of the party had lost its independence; he falsified Gladstone's terms for Home Rule and said they were inadequate. A total of 73 members were present for the fateful meeting in committee room 15 at Westminster. Leaders tried desperately to achieve a compromise in which Parnell would temporarily withdraw. Parnell refused. He vehemently insisted that the independence of the Irish party could not be compromised either by Gladstone or by the Catholic hierarchy. As chairman, he blocked any motion to remove him. On 6 December, after five days of vehement debate, a majority of 44 present led by Justin McCarthy walked out to found a new organisation, thus creating rival Parnellite and anti-Parnellite parties. The minority of 28 who remained true to their embattled 'Chief' continued in the Irish National League under John Redmond, but all of his former close associates, Michael Davitt, John Dillon, William O'Brien and Timothy Healy deserted him to join the anti-Parnellites. The vast majority of anti-Parnellites formed the Irish National Federation, later led by John Dillon and supported by the Catholic Church. The bitterness of the split tore Ireland apart and resonated well into the next century. Parnell soon died, and his faction dissipated. The majority faction henceforth played only a minor role in British or Irish politics until the next time the UK had a hung Parliament, in 1910.", "His brother John Howard inherited the Avondale estate. He found it heavily mortgaged and eventually sold it in 1899. Five years later, at the suggestion of Horace Plunkett it was purchased by the state. It is open to public view and is where the \"Parnell Society\" holds its annual August summer school. The \"Parnell National Memorial Park\" is in nearby Rathdrum, County Wicklow. Dublin has locations named Parnell Street and Parnell Square. At the north end of O'Connell Street stands the Parnell Monument. This was planned and organised by John Redmond, who chose the American Augustus Saint Gaudens to sculpt the statue; it was funded by Americans and completed in 1911. Art critics said it was not an artistic success."]}, {"page": "Irish War of Independence", "response": ["The British Parliament passed the Government of Ireland Act 1914, known as the Home Rule Act, on 18 September 1914 with an amending Bill for the partition of Ireland introduced by Ulster Unionist MPs, but the Act's implementation was immediately postponed by the Suspensory Act 1914 due to the outbreak of the First World War in the previous month. The majority of nationalists followed their IPP leaders and John Redmond's call to support Britain and the Allied war effort in Irish regiments of the New British Army, the intention being to ensure the commencement of Home Rule after the war. However, a significant minority of the Irish Volunteers opposed Ireland's involvement in the war. The Volunteer movement split, a majority leaving to form the National Volunteers under Redmond. The remaining Irish Volunteers, under Eoin MacNeill, held that they would maintain their organisation until Home Rule had been granted. Within this Volunteer movement, another faction, led by the separatist Irish Republican Brotherhood, began to prepare for a revolt against British rule in Ireland.O’Riordan, Tomás: UCC Multitext Project in Irish History John Redmond ", "On 25 November 1913, the Irish Volunteers were formed by Eoin MacNeill in response to the paramilitary Ulster Volunteer Force that had been founded earlier in the year to fight against Home Rule.Cottrell, Peter The Anglo-Irish War The Troubles of 1913–1922, London: Osprey, 2006 page 24. Also in 1913, the Irish Citizen Army was founded by the trade unionists and socialists James Larkin and James Connolly following a series of violent incidents between trade unionists and the Dublin police in the Dublin lock-out.Cottrell, Peter The Anglo-Irish War The Troubles of 1913–1922, London: Osprey, 2006 page 26. In June 1914, Nationalist leader John Redmond forced the Volunteers to give his nominees a majority on the ruling committee. When, in September 1914, Redmond encouraged the Volunteers to enlist in the British Army, a faction led by Eoin MacNeill broke with the Redmondites, who became known as the National Volunteers, rather than fight for Britain in the war. Many of the National Volunteers did enlist, and the majority of the men in the 16th (Irish) Division of the British Army had formerly served in the National Volunteers.Cottrell, Peter The Anglo-Irish War The Troubles of 1913–1922, London: Osprey, 2006 page 25. The Irish Volunteers and the Irish Citizen Army launched the Easter Rising against British rule in 1916, when an Irish Republic was proclaimed. Thereafter they became known as the Irish Republican Army (IRA). Between 1919 and 1921 the IRA claimed to have a total strength of 70,000, but only about 3,000 were actively engaged in fighting against the Crown.Cottrell, Peter The Anglo-Irish War The Troubles of 1913–1922, London: Osprey, 2006 page 28. The IRA distrusted those Irishmen who had fought in the British Army during the First World War, but there were a number of exceptions such as Emmet Dalton, Tom Barry and Martin Doyle. The basic structure of the IRA was the flying column which could number between 20 and 100 men. Finally, Michael Collins created the \"Squad\"—gunmen responsible to himself who were assigned special duties such as the assassination of policemen and suspected informers within the IRA."]}, {"page": "Edward Carson", "response": ["On 25 May 1915, Asquith appointed Carson Attorney-General when the Coalition Government was formed after the Liberal government was brought down by the Shell Crisis and the resignation of Admiral Fisher. He resigned on 19 October, however, citing his opposition to Government policy on war in the Balkans. During Asquith's coalition government of 1915–1916, there was no formal opposition in either the Commons or the Lords. The only party not in Asquith's Liberal, Conservative, Labour Coalition was the Irish Nationalist Party led by John Redmond. However, this party supported the government and did not function as an Opposition. After Carson, the leading figure among the Irish Unionist allies of the Conservative Party, resigned from the coalition ministry on 19 October 1915, he then became the de facto leader of those Unionists who were not members of the government, effectively Leader of the Opposition in the Commons."]}, {"page": "Home rule", "response": ["From the late nineteenth century, Irish leaders of the Home Rule League, the predecessor of the Irish Parliamentary Party, under Isaac Butt, William Shaw, and Charles Stewart Parnell demanded a form of home rule, with the creation of an Irish parliament within the United Kingdom of Great Britain and Ireland. This demand led to the eventual introduction of four Home Rule Bills, of which two were passed, the Government of Ireland Act 1914 won by John Redmond and most notably the Government of Ireland Act 1920 (which created the home rule parliaments of Northern Ireland and Southern Ireland – the latter state did not in reality function and was replaced by the Irish Free State)."]}, {"page": "Francis Ledwidge", "response": ["On the outbreak of World War I in August 1914, and on account of Ireland's involvement in the war, the Irish Volunteers split into two factions, the National Volunteers who supported John Redmond's appeal to join Irish regiments in support of the Allied cause and those who did not. Francis was originally of the latter party.  Nevertheless, having defended this position strongly at a local council meeting, he soon after enlisted (24 October 1914) in Lord Dunsany's regiment, joining 5th battalion Royal Inniskilling Fusiliers, part of the 10th (Irish) Division. This was against Lord Dunsany's wishes and he had offered Ledwidge a stipend to support him if he stayed out of the war. Some have speculated that he went to war because his sweetheart Ellie Vaughey had found a new lover, John O'Neill, whom she later married, but Ledwidge himself wrote, quite forcefully, that he could not stand aside while others sought to defend Ireland's freedom.Letter Ledwidge to Chase p. 698"]}, {"page": "Edward MacLysaght", "response": ["He was an independent delegate to the 1917-18 Irish Convention in which he opposed John Redmond's compromise on Home Rule. By 1918 his involvement in all aspects of the Irish independence movement had deepened greatly. Although not known if he was actually a member of the Irish Republican Army (IRA), he was very active in the Irish War of Independence as a supporter, financially and otherwise, of the East Clare Brigade of the IRA and its legendary leaders, Michael and Conn Brennan."]}, {"page": "Henry Campbell-Bannerman", "response": ["On the day of Campbell-Bannerman's death the flag of the National Liberal Club was lowered to half-mast, the blinds were drawn and his portrait was draped in black as a sign of mourning.The Times (23 April 1908), p. 5. John Redmond, the leader of the Irish Nationalist Party, paid tribute to Campbell-Bannerman by saying that \"We all feel that Ireland has lost a brave and considerate friend\". David Lloyd George said on hearing of Campbell-Bannerman's death:"]}, {"page": "John Bruton", "response": ["Bruton's politics were markedly different from most Irish leaders. Whereas most leaders had come from or identified with the independence movement Sinn Féin (in its 1917–22 phase), Bruton identified more with the more moderate Irish Parliamentary Party (IPP) tradition that Sinn Féin had eclipsed at the 1918 general election. He hung a picture of IPP leader John Redmond, his political hero, on a wall in his office as Taoiseach, in preference to other figures such as Patrick Pearse. But as evidence of Bruton's complexity, he also kept a picture of former Fianna Fáil Taoiseach Seán Lemass, which had been hung there by Reynolds, and which Bruton kept because he viewed Lemass as the best and most reforming Taoiseach in the history of the state."]}, {"page": "County Wexford", "response": ["*John Redmond - 19th- 20th-century nationalist politician"]}, {"page": "Wexford", "response": ["Redmond Square, near the railway station, commemorates the elder John Edward Redmond (1806–1865) who sat in the House of Commons of the United Kingdom as a Liberal Member of Parliament (MP) for the city of Wexford. The inscription reads: \"My heart is with the city of Wexford. Nothing can extinguish that love but the cold soil of the grave.\" His nephew William Archer Redmond (1825–1880) sat as an MP in Isaac Butt's Home Rule Party from 1872 until 1880.  Willie Redmond sat as an MP for Wexford from 1883 until 1885. The younger John Redmond, was a devoted follower of Charles Stewart Parnell and leader of the Irish Parliamentary Party until his death in April 1918. He is interred in the Redmond family vault, at the old Knights' Templars' chapel yard of St. John's Cemetery, Upper St. John's Street."]}, {"page": "Parliament House, Dublin", "response": ["Leaders from O'Connell to Parnell and later John Redmond spoke of the proud day on which an Irish parliament might once again meet in what they called Grattan's Parliament in College Green. When, in 1911, King George V and his consort Queen Mary visited Dublin (where they attracted mass crowds), street sellers sold drawings of the King and Queen arriving in the not too distant future at the Old Houses of Parliament in College Green. In 1914, the Government of Ireland Act 1914 completed all parliamentary stages and received the Royal Assent. The First World War injected what proved to be a fatal delay for Home Rule. In late April 1916, a small band of radical Republicans under Patrick Pearse staged the Easter Rising, in which they seized a number of prominent Irish buildings, mainly in Dublin, and proclaimed an Irish Republic. One building they did not take over was the old Parliament House. Perhaps they feared that, as a bank, it would be heavily protected. Perhaps, expecting that the Rising would ultimately fail and that the reaction to the Rising and what Pearse called their \"blood sacrifice\", rather than the Rising itself, would reawaken Irish nationalism and produce independence, they did not seek to use the building for fear that it, like the GPO, would be destroyed in the British counter-attack. Or perhaps, because of its association with a former Ascendancy parliament, it carried little symbolism for them."]}, {"page": "History of the Republic of Ireland", "response": ["The nationalist leader John Redmond pledged support for the British war effort and many Irishmen served in the British Army (see Ireland and World War I), but the war and the frustration of nationalist ambitions regarding Home Rule led to a radicalisation of Irish nationalism. In 1916, a group of IRB activists within the Irish Volunteers led an insurrection aimed at Irish independence in Dublin, known as the Easter Rising. The rebellion did not have popular support and was put down within a week, but the execution of its leaders, and the subsequent wholesale arrest of radical nationalist activists proved very unpopular with the nationalist public.Charles Townshend Easter 1916, The Irish Rebellion, p269 Coming directly after the Rising, a further attempt was made at the Irish Convention to resolve the impasse over Home Rule, but without success. Finally, the British proposal to extend conscription for the war to Ireland provoked widespread resistance, (see Conscription Crisis of 1918) and discredited the Irish Parliamentary Party who had supported the British war effort.Fergus Campbell, Land and Revolution, Nationalist Politics and Land in the west of Ireland, 1891–1921 p197"]}, {"page": "John French, 1st Earl of Ypres", "response": ["On the evening of 26 April, told that the government had decided to send out a new general to Ireland, French selected Maxwell (who had been military governor of Pretoria) from a shortlist of two. French had already told Asquith that he had ordered the 60th Division to be ready to move, but would not send it without the concurrence of the General Staff. On 27 April, French visited Robertson who agreed with him that to send more troops to Ireland would be \"playing the German game\". However, the next day after visits from Midleton (on instructions from Asquith) and Carson French agreed to send three extra battalions, as well as the cavalry brigade from Aldershot which Maxwell now requested. The rebellion was crushed by 29 April. On 3 May Asquith recorded his concerns that the shooting of rebels might antagonise Irish opinion, but French, despite having been advised by John Redmond that Sinn Féin had little support outside Dublin and that the Army should not use more than minimal force, passed on these concerns with the caveat that he would not interfere with Maxwell's actions. In the opinion of one biographer French's views had not moved on since his hanging of the Cape Colony Boers, and he bears some responsibility for the shootings.Holmes 2004, pp. 324–25"]}, {"page": "Sir Henry Wilson, 1st Baronet", "response": ["Wilson thought that Irish conscription would gain an extra 150,000 men, as well as helping to round up political malcontents. As recently as January Lloyd George had been opposed, worried that it would cause trouble in Ireland and weaken the position of John Redmond's party (worries shared by the administration in Dublin) and about the effect on Irish American and Irish Australian opinion. During the German \"Michael\" Offensive Lloyd George changed his mind and with Milner's support, but over the reservations of the head of the RIC, announced at the War Cabinet (25 March) that conscription was to be extended to Ireland, partly to placate British trade unions at the extension of conscription to British war industries. When he announced the measure in the House of Commons (9 April), he announced that Home Rule was also to be introduced in Ireland, although Wilson was convinced that the southern nationalists would never accept it if Ulster was given the \"safeguards\" promised by Lloyd George. Irish conscription was never implemented but the threat galvanised Irish politics and led to Sinn Féin's victory in December 1918.Jeffery 2006, pp. 221–3."]}, {"page": "1918 Irish general election", "response": ["The IPP suffered a catastrophic defeat and even its leader, John Dillon, was not re-elected. It won only six seats in Ireland, its losses exaggerated by the \"first-past-the-post\" system which gave it a share of seats far short of its much larger share of the vote (21.7%) and the number of seats it would have won under a \"proportional representation\" ballot system. All but one of its seats were in Ulster. The exception was Waterford City, the seat previously held by John Redmond, who had died earlier in the year, and retained by his son Captain William Redmond. Four of their Ulster seats were part of the deal to avoid unionist victories which saved some for the party but may have cost it the support of Protestant voters elsewhere. The IPP came close to winning other seats in Louth and Wexford South, and in general their support held up better in the north and east of the island. The party was represented in Westminster by seven MPs because T. P. O'Connor won the Liverpool Scotland seat due to Irish emigrant votes. The remnants of the IPP in time became the Nationalist Party under the leadership of Joseph Devlin. In the 26 counties that became the Irish Free State, the Irish Parliamentary Party won 181,320 votes out of 606,117 total votes cast in the contested seats which amounts to a 26.0% vote share. If the Independent Home Rule Nationalists are included there were 11,162 votes which comes to 1.8% and a vote share of 27.8% for the Nationalists. The Irish Parliamentary Party held on to just 2 seats in the 26 counties that became Southern Ireland and then the Irish Free State.", "* John Redmond"]}, {"page": "Irish nationalism", "response": ["Following the fall and death of Parnell in 1891 after a divorce crisis, which enabled the Irish Roman Catholic hierarchy to pressure MPs to drop Parnell as their leader, the Irish Party split into two factions, the INL and the INF, becoming practically ineffective from 1892 to 1898. Only after the passing of the Local Government (Ireland) Act 1898 which granted extensive power to previously non-existent county councils, allowing nationalists for the first time through local elections to democratically run local affairs previously under the control of landlord dominated \"Grand Juries\", and William O'Brien founding the United Irish League that year, did the Irish Parliamentary Party reunite under John Redmond in January 1900, returning to its former strength in the following September general election.", "Home Rule was eventually won by John Redmond and the Irish Parliamentary Party and granted under the Third Home Rule Act 1914. However, Irish self-government was limited by the prospect of partition of Ireland between north and south. This idea had first been mooted under the Second Home Rule Bill in 1893. In 1912, following the entry of the Third Home Rule Bill through the House of Commons, unionists organised mass resistance to its implementation, organising around the \"Ulster Covenant\". In 1912 they formed the Ulster Volunteers, an armed wing of Ulster Unionism who stated that they would resist Home Rule by force. British Conservatives supported this stance. In addition, in 1914 British officers based at the Curragh Camp indicated that they would be unwilling to act against the Ulster Volunteers should they be ordered to.", "The Irish Volunteer movement was divided over the attitude of their leadership to Ireland's involvement in World War I. The majority followed John Redmond in support of the British and Allied war effort, seeing it as the only option to ensure the enactment of Home Rule after the war, Redmond saying \"you will return as an armed army capable of confronting Ulster's opposition to Home Rule\". They split off from the main movement and formed the National Volunteers, and were among the 180,000 Irishmen who served in Irish regiments of the Irish 10th and 16th Divisions of the New British Army formed for the War.", "Two further attempts to implement Home Rule in 1916 and 1917 also failed when John Redmond, leader of the Irish Party, refused to concede partition while accepting there could be no coercion of Ulster. An Irish Convention to resolve the deadlock was established in July 1917 by the British Prime Minister, Lloyd George, its members both nationalists and unionists tasked with finding a means of implementing Home Rule. However, Sinn Féin refused to take part in the Convention as it refused to discuss the possibility of full Irish independence. The Ulster unionists led by Edward Carson insisted on the partition of six Ulster counties from the rest of Ireland,ME Collins, Ireland 1868–1966, page 240 stating that the 1916 rebellion proved a parliament in Dublin could not be trusted."]}, {"page": "Irish Volunteers", "response": ["The Irish Volunteers (), sometimes called the Irish Volunteer ForceGerry White and Brendan O'Shea. Irish Volunteer Soldier 1913-23. Osprey Publishing, 2013. p.10. Quote: \"Those wishing to enlist then had to sign the following enrolment form: I, the undersigned, desire to be enrolled for service in Ireland as a member of the Irish Volunteer Force...\".Coleman, Marie. The Irish Revolution, 1916-1923. Routledge, 2013. pp. viii, ix, xix, 9The Irish Volunteer Force/Irish Republican Army (IRA) . BBC History. or Irish Volunteer Army,McCaffrey, Lawrence John. The Irish Question: Two Centuries of Conflict. University Press of Kentucky, 1995. p.129Doerries, Reinhard. Prelude to the Easter Rising: Sir Roger Casement in Imperial Germany. Routledge, 2014. p.20. Quote: \"The message came from Count George Noble Plunkett 'as the delegate sent by the President and Supreme Council of the Irish Volunteer Army'\".Bureau of Military History. Witness Statement 741: Michael J Kehoe, Member Irish Brigade, Germany, 1916 . pp. 18, 23, 40, 47, 57, 62 was a military organisation established in 1913 by Irish nationalists. It was ostensibly formed in response to the formation of the Ulster Volunteers in 1912, and its declared primary aim was \"to secure and maintain the rights and liberties common to the whole people of Ireland\". The Volunteers included members of the Gaelic League, Ancient Order of Hibernians and Sinn Féin,William O'Brien and Desmond Ryan (eds.), Devoy's Post Bag, vol. 2, pp. 439-41 (letter from Patrick Pearse to John Devoy, 12 May 1914). Reproduced in National Library of Ireland, The 1916 Rising: Personalities and Perspectives , online exhibition, accessed 12 September 2015. and, secretly, the Irish Republican Brotherhood (IRB). Increasing rapidly to a strength of nearly 200,000 by mid-1914, it split in September of that year over John Redmond's commitment to the British War effort, with the smaller group retaining the name of \"Irish Volunteers\".", "==John Redmond and the Irish Parliamentary Party==", "While the IRB was instrumental in the establishment of the Volunteers, they were never able to gain complete control of the organisation. This was compounded after John Redmond, leader of the Irish Parliamentary Party, took an active interest. Though some well known Redmond supporters had joined the Volunteers, the attitude of Redmond and the Party was largely one of opposition, though by the Summer of 1914, it was clear the IPP needed to control the Volunteers if they were not to be a threat to their authority.Kee, Robert The Bold Fenian Men, 1976, P. 204 The majority of the IV members, like the nation as a whole, were supporters of Redmond (though this was not necessarily true of the organisation's leadership), and, armed with this knowledge, Redmond sought IPP influence, if not outright control of the Volunteers. Negotiations between MacNeil and Redmond over the latter's future role continued inconclusively for several weeks, until on 9 June Redmond issued an ultimatum, through the press, demanding the Provisional Committee co-opt twenty-five IPP nominees.Tierney, Michael, Eoin MacNeill, 1980, p.141 With several IPP members and their supporters on the committee already, this would give them a majority of seats, and effective control."]}, {"page": "Irish Parliamentary Party", "response": ["A special meeting of the party a week later lasted six days at the end of which 45 \"anti-Parnellites\" walked out, leaving him with 27 faithful followers, J. J. Clancy one of his key defenders. Both sides returned to Ireland to organise their supporters into two parties, the former Parnellite Irish National League (INL) under John Redmond and John Dillon's anti-Parnellite Irish National Federation (INF). By-elections in 1891 were fought with bitter venom by the INF anti-Parnellites, Dillon and Healy making extremely personal attacks on Parnell. The INF was also supported by the Catholic clergy who went to aggressive extremes to ensure that INF candidates were returned.", "The party was taken by surprise by the Easter Rising in April 1916, launched by the section of the Irish Volunteers who had remained in the original organisation. The Volunteers, infiltrated to a large degree by the separatist Irish Republican Brotherhood, declared an Irish Republic and took over much of the centre of Dublin. The rebellion in Dublin was put down in a week of fighting with about 500 deaths. The manner in which British General Maxwell dealt with its leaders won sympathy for their cause. A total of 16 were shot within weeks of the Rising and another hanged several weeks later. The Rising began the decline of constitutional nationalism as represented by the IPP and the ascent of a more radical separatist form of Irish nationalism. John Redmond, protesting at the severity of the state's response to the Rising, wrote to Asquith, \"if any more executions take place, Ireland will become impossible for any Constitutional Party or leader\".Townshend p. 280", "In sharp contrast to Parnell, John Redmond lacked charisma. He worked well in small committees, but had little success in arousing large audiences. Parnell always chose the nominees to Parliament. Now they were selected by the local party organisations, giving Redmond numerous weak MPs over whom he had little control.  Redmond was an excellent representative of the old Ireland, but grew increasingly out-dated as he paid little attention to the new forces attracting younger Irishman, such as Sinn Féin, and the Ancient Order of Hibernians in politics, the Gaelic Athletic Association in sports, and the Gaelic League in cultural affairs. He never tried to understand the forces emerging in Ulster. Redmond was further weakened in 1914 by the formation by Sinn Féin members of the militaristic Irish Volunteers. His enthusiastic support for the British war effort alienated many Catholics. His party had been increasingly hollowed out, and the major crises—notably the Easter Rising on 1916 and the Conscription crisis of 1918—were enough to destroy it.", "The conservative nationalist National League Party operated between 1926 and 1931, founded by former IPP MPs Captain William Redmond (son of Irish National League and IPP leader John Redmond) and Thomas O'Donnell. It quickly faltered, with many of its prominent members (including Redmond, Vincent Rice, John Jinks and James Coburn) joining Cumann na nGaedheal / Fine Gael, although O'Donnell became an active member of Fianna Fáil. A short lived National Centre Party was formed in 1932, absorbing the remnants of the conservative Farmers' Party and led by Frank MacDermot and James Dillon (son of IPP leader John Dillon). The success of Fianna Fáil prompted the National Centre Party to amalgamate with Cumann na nGaedheal to become Fine Gael in 1933. Both MacDermot and Dillon later left Fine Gael, and both argued for Irish entry into World War II in the Allied side, but MacDermot joined Fianna Fáil while Dillon returned to Fine Gael and became party leader 1959–1965.", "*John Redmond (1891–1918)"]}, {"page": "List of political parties in Northern Ireland", "response": ["|John Redmond ||18y ||Irish Parliamentary Party 1900–1918 ||Waterford City"]}, {"page": "John Edward Redmond", "response": ["#REDIRECT John Redmond"]}, {"page": "William O'Brien", "response": ["By 1891 he had become disillusioned with Parnell's political leadership, although emotionally loyal to him he tried to persuade him to retire after the O'Shea divorce case. On Parnell's death that year and the ensuing IPP split, he remained aloof from aligning himself with either side of the Party, either the rump pro-Parnellite Irish National League (INL) led by John Redmond MP or with the anti-Parnellite Irish National Federation (INF) group under John Dillon, although he saw the weight of strength in the latter. O'Brien worked hard in the 1893 negotiations leading to the Commons passing Gladstone's Second Home Rule Bill, which the Lords however rejected. (Gladstone's speech on the First Home Rule Bill had beseeched parliament not to reject it).", "Around 1900 O'Brien, an unbending social reformer and agrarian agitator, was the most influential and powerful figure within the nationalist movement, although not formally its leader. His UIL was by far the largest organisation in the country, comprising 1150 branches and 84,355 members. The result of the rapid growth of his UIL as a national organisation in achieving unity through organised popular opinion, was to effect a quick defensive reunion of the discredited IPP factions of the INL and the INF, largely fearing O’Brien's return to the political field. He can nevertheless be regarded as the architect of the settlement of 1900. The unity under John Redmond disturbed O’Brien, as it resulted in most of the ineffective party candidates being re-elected in the 1900 general election, preventing the UIL from using its power in the pre-selection of candidates. Within a few years the IPP was however, to tactically adjunct the UIL under its wing manoeuvering it out of O'Brien's control.", "O'Brien next intensified the UIL agitation for land purchase by tenant farmers, pressing for compulsory purchase. He formed an alliance with constructive unionists which resulted in the calling of the December 1902 Land Conference, an initiative by moderate landlords led by Lord Dunraven for a settlement by conciliatory agreement between landlord and tenant. The tenant representation was led by O'Brien, the others were John Redmond, Timothy Harrington and T. W. Russell for the Ulster tenants. After six sittings all eight tenant's demands were conceded (one with compromise), O’Brien having guided the official nationalist movement into endorsement of a new policy of \"conference plus business\". He followed this by campaigning vigorously for the greatest piece of social legislation Ireland had yet seen, orchestrating the Land Purchase (Ireland) Act 1903 through parliament,  which effectively ended landlordism, solving the age old Irish Land Question."]}, {"page": "List of political families in the United Kingdom", "response": ["* John Redmond, MP 1881–1918"]}, {"page": "New Ross", "response": ["* John Redmond, MP for New Ross"]}, {"page": "January 1910 United Kingdom general election", "response": ["The general election resulted in a hung parliament, with the Conservative Party led by Arthur Balfour and their Liberal Unionist allies receiving the most votes, but the Liberals led by H. H. Asquith winning the most seats, returning two more MPs than the Conservatives. Asquith formed a government with the support of the Irish Parliamentary Party, led by John Redmond. Another general election was soon held in December."]}, {"page": "1906 United Kingdom general election", "response": ["The Labour Representation Committee was far more successful than at the 1900 general election and after the election would be renamed the Labour Party with 29 MPs and Keir Hardie as leader. The Irish Parliamentary Party, led by John Redmond, achieved its seats with a relatively low number of votes, as 73 candidates stood unopposed."]}, {"page": "1895 United Kingdom general election", "response": ["The 1895 United Kingdom general election was held from 13 July to 7 August 1895. It was won by the Conservatives led by Lord Salisbury who formed an alliance with the Liberal Unionist Party and had a large majority over the Liberals, led by Lord Rosebery. The Irish Parliamentary Party was split at this time; most of its MPs (the \"Anti-Parnellites\") followed John Dillon, while a rump (the \"Parnellites\") followed John Redmond."]}]}}