{"wiki_id": "http://www.wikidata.org/entity/Q2253307", "itemLabel": "Robert of Gloucester", "itemDescription": "English historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_of_Gloucester_(historian)", "wikipedia_page": {"main": "Robert of Gloucester (fl. c. 1260 – c. 1300) wrote a chronicle of British, English, and Norman history sometime in the mid- or late-thirteenth century.", "link_mentions": [{"page": "Giant", "response": ["In folklore, giants (from Ancient Greek: gigas, cognate giga-) are beings of human-like appearance, but are at times prodigious in size and strength or bear an otherwise notable appearance. The word giant is first attested in 1297 from Robert of Gloucester's chronicle. It is derived from the Gigantes (γίγαντες, Georg Autenrieth, A Homeric Dictionary, on Perseus Digital Library) of Greek mythology."]}, {"page": "Battle of Evesham", "response": ["With the Battle of Lewes, de Montfort had won control of royal government, but after the defection of several close allies and the escape from captivity of Prince Edward, he found himself on the defensive. Forced to engage the royalists at Evesham, he faced an army twice the size of his own. The battle soon turned into a massacre; de Montfort himself was killed and his body mutilated. It was described by the contemporary historian Robert of Gloucester as the \"murder of Evesham, for battle it was none\".Robert of Gloucester, Chronicle translated by Stevenson, Rev. Joseph, ed. (1858) in The Church Historians of England: Prereformation series, Volume 5, Part 1; Seeleys; p. 375. Though the battle effectively restored royal authority, scattered resistance remained until the Dictum of Kenilworth was signed in 1267."]}, {"page": "Battle of Brunanburh", "response": ["Few medieval texts refer to a known place, although the Humber estuary is mentioned by several sources. John of Worcester's Chronicon (early 12th C),John of Worcester.”Chronicon\". In The Battle of Brunanburh. A Casebook. Ed. Michael Livingston. University of Exeter Press. 2011. pp.56–7 Symeon of Durham's Historia Regum (mid-12th C), the Chronicle of Melrose (late 12th C)Anonymous.”Chronica de Mailros\". In The Battle of Brunanburh. A Casebook. Ed. Michael Livingston. University of Exeter Press. 2011. pp.66–7 and Robert Mannyng of Brunne's Chronicle (1338)Robert Mannyng of Brune.”Chronicle\". In The Battle of Brunanburh. A Casebook. Ed. Michael Livingston. University of Exeter Press. 2011. pp.126–33 all state that Olaf's fleet entered the mouth of the Humber, while Robert of Gloucester's Metrical Chronicle (late 13th C)Robert of Gloucester.”Metrical Chronicle\". In The Battle of Brunanburh. A Casebook. Ed. Michael Livingston. University of Exeter Press. 2011. pp.84–9 says the invading army arrived \"south of the Humber\". Peter of Langtoft's Chronique (ca. 1300)Peter of Langtoft.”Chronique\". In The Battle of Brunanburh. A Casebook. Ed. Michael Livingston. University of Exeter Press. 2011. pp.90–7 states the armies met at “Bruneburgh on the Humber”, while Robert Mannyng of Brunne's Chronicle (1338) claims the battle was fought at “Brunesburgh on Humber”. Pseudo-Ingulf (ca. 1400)Pseudo-Ingulf.”Ingulfi Croylandensis Historia\". In The Battle of Brunanburh. A Casebook. Ed. Michael Livingston. University of Exeter Press. 2011. pp.134–9 says that as Æthelstan led his army into Northumbria (i.e. north of the Humber) he met on his way many pilgrims coming home from Beverley. Hector Boece's Historia (1527)Hector Boece.”Historiae\". In The Battle of Brunanburh. A Casebook. Ed. Michael Livingston. University of Exeter Press. 2011. pp.146–53 claims that the battle was fought by the River Ouse, which flows into the Humber estuary."]}, {"page": "Thomas Hearne (antiquarian)", "response": ["*Robert of Gloucester's Chronicle (1724)"]}, {"page": "Historic counties of England", "response": ["Great Britain was first divided into administrative areas by the Romans, most likely following major geographical features such as rivers. Before their arrival there were distinct tribal areas, but they were in a constant state of flux as territory was gained and lost. After the demise of Roman Britain around 410 these first divisions of land were generally abandoned, although traditional divisions taking the form of petty kingdoms such as Powys,  Dumnonia and Elmet, remained in those areas which remained British, such as south west England. The areas that would later form the English counties started to take shape soon afterwards, with the Kingdom of Kent founded by settlers around 445. In southern England more widely, shires emerged from earlier sub-kingdoms as part of the administrative structure of Wessex, which then imposed its system of shires, boroughs (or burhs) and ealdormen on Mercia after it came under West Saxon control during the 10th century.  Once the Kingdom of England was united as a whole in 927 it became necessary to subdivide it for administrative convenience and to this end, earldoms were created out of the earlier kingdoms. The whole kingdom was divided into shires by the time of the Norman conquest. Robert of Gloucester accounts for thirty-five shires and William of Malmesbury thirty-two, Henry of Huntingdon, thirty-seven. In most cases the counties or shires in medieval times were administered by a sheriff (derived from \"shire-reeve\") on behalf of the monarch. After the Norman conquest the sheriff was replaced and the shires became counties, or \"areas under the control of a count\", in the French manner."]}, {"page": "William Aldis Wright", "response": ["He was the intimate friend and literary executor of Edward FitzGerald, whose Letters and Literary Remains he edited in 1889. This was followed by the Letters of Edward FitzGerald to Fanny Kemble (1895), his Miscellanies (1900), More Letters of Edward FitzGerald (1901), and The Works of Edward FitzGerald (7 vols., 1903). He edited the metrical chronicle of Robert of Gloucester (1887), Generydes (1878) for the Early English Text Society, Catalogue of the Syriac manuscripts in the British Museum (1–3 vol., 1870–1872), and other texts. His last publication was The Hexaplar Psalter (1911). In 1912 he resigned from the vice-mastership of Trinity College."]}, {"page": "1724 in literature", "response": ["*Thomas Hearne, ed. – Robert of Gloucester's Chronicle"]}, {"page": "Hereford Cathedral", "response": ["Among eminent men who have been associated with the cathedral – besides those who have already been mentioned – are Robert of Gloucester, the chronicler, prebendary in 1291; Nicholas of Hereford, chancellor in 1377, a remarkable man and leader of the Lollards at Oxford; John Carpenter, town clerk of London who baptised there on 18 December 1378; Polydore Vergil, prebendary in 1507, a celebrated literary man, as indeed with such a name he ought to have been; and Miles Smith, prebendary in 1580, promoted to the See of Gloucester – one of the translators of the Authorized King James Version of the Bible."]}, {"page": "Angevin Empire", "response": ["Geoffrey first sent his wife Matilda alone to Normandy in a diplomatic mission to be recognized Duchess of Normandy and replace Stephen. Geoffrey followed at the head of his army and quickly captured several fortresses in southern Normandy. It was then that a noble in Anjou, Robert III of Sablé, rebelled, forcing Geoffrey to withdraw and prevent an attack on his rear. When Geoffrey returned to Normandy in September 1136, the region had become plagued with internal, baronial infighting. Stephen was not able to travel to Normandy and so the situation remained. Geoffrey had found new allies with the Count of Vendôme and, most importantly, William X, Duke of Aquitaine. At the head of a new army and ready for conquest, Geoffrey was wounded and was forced to return to Anjou again. Furthermore, an outbreak of diarrhea plagued his army. Orderic Vitalis stated \"the invaders had to run for home leaving a trail of filth behind them\". Stephen finally arrived in Normandy in 1137 and restored order but had lost much credibility in the eyes of his main supporter, Robert of Gloucester and so Robert changed sides and supported Geoffrey and his half-sister Matilda instead. Geoffrey took Caen and Argentan without resistance, but now had to defend Robert's possessions in England against Stephen. In 1139, Robert and Matilda crossed the channel and arrived in England while Geoffrey kept the pressure on Normandy. Stephen was captured in February 1141 at the Battle of Lincoln, which prompted the collapse of his authority in both England and Normandy.", "Geoffrey now controlled almost all of Normandy, but no longer had the support of Aquitaine now that William X had been succeeded by his daughter, Eleanor, who had married Louis VII of France in 1137. Louis was not concerned with the events in Normandy and England. While Geoffrey consolidated his Norman power, Matilda suffered defeats in England. At Winchester, Robert of Gloucester was captured while covering Matilda's retreat so Matilda freed Stephen in exchange for Robert."]}, {"page": "Robert of Gloucester", "response": ["Robert of Gloucester may refer to one of two persons prominent in medieval England:", "*Robert of Gloucester (historian) (  – )), chronicler of early English history"]}, {"page": "English nationalism", "response": ["The Norman conquest introduced a ruling class over England who displaced English land owners and clergy, and who spoke only Anglo-Norman, though it is likely many if not most were conversant in English from the second generation onwards. William of Malmesbury, a chronicler of mixed Anglo-Norman descent writing in the twelfth century, described the Battle of Hastings as: \"That fatal day for England, the sad destruction of our dear country [dulcis patrie]\".M. T. Clanchy, England and Its Rulers: 1066–1272 (Blackwell, 1998), p. 24. He also lamented: \"England has become the habitation of outsiders and the dominion of foreigners. Today, no Englishman is earl, bishop, or abbot, and newcomers gnaw away at the riches and very innards of England; nor is there any hope for an end of this misery\".Hugh M. Thomas, The English and the Normans: Ethnic Hostility, Assimilation and Identity 1066–c.1220 (Oxford University Press, 2003), p. 56. Another chronicler, Robert of Gloucester, speaking in part of earlier centuries, in the mid to late thirteenth century:"]}, {"page": "List of English chronicles", "response": ["* Robert of Gloucester (–1270)"]}, {"page": "Pridwen", "response": ["Pridwen was, according to the 12th-century writer Geoffrey of Monmouth, King Arthur's shield; it was adorned with an image of the Virgin Mary.  Geoffrey's description of it draws on earlier Welsh traditions found in Preiddeu Annwfn, Culhwch and Olwen, and the Historia Brittonum.  The shield is also named and described by Wace, Layamon, Roger of Wendover and Robert of Gloucester among other medieval writers, and it directly inspired the description of Sir Gawain's shield in Sir Gawain and the Green Knight.", "In the later 13th century the Chronicle of Robert of Gloucester, another heir of the Brut tradition, mentioned Arthur's shield (under the name þridwen) along with its Marian image."]}, {"page": "Rolls Series", "response": ["However, the scope of the series was not limited to conventional chronicles. It also encompassed materials of a more or less legendary character relating to Ireland and Scotland, such as Whitley Stokes's edition of The Tripartite Life of St. Patrick, and the Icelandic sagas edited by Guðbrandur Vigfússon and G.W. Dasent; rhymed chronicles like those of Robert of Gloucester and Robert of Brunne in English, and that of Pierre de Langtoft in French; quasi-philosophical works like those of Roger Bacon and Alexander Neckam, together with folklore materials like the three volumes of Leechdoms, Wortcunning and Starcraft of Anglo-Saxon times. Archival records and legal tracts, such as the Year Books of Edward I and Edward III, the Black Book of the Admiralty, the Red Book of the Exchequer, and Bracton's work De Legibus et Consuetudinibus Angliæ were also included; as were hagiographical documents, dealing for example with the lives of St Dunstan, St Edward the Confessor, St Hugh of Lincoln, St Thomas Becket, and St Wilfrid and other northern saints."]}, {"page": "South English Legendary", "response": ["It is written in verse with a line of fourteen syllables and seven stresses but with much irregularity and deviation, the same metre as the Chronicle attributed to Robert of Gloucester, with certain lives appearing in both, suggesting complex forms of textual entanglement. The South English Legendary grew as it was copied, and later manuscripts often add in new saints' lives."]}, {"page": "Robert de Ferrers, 6th Earl of Derby", "response": ["The origins of this may well have been in the Ferrers family's long held claims on the estate of Peverel Castle through the marriage of Margaret Peverel to Robert the second earl.  King John had assigned stewardship of the estate to the fourth earl, Robert's grandfather, but King Henry had taken it back and awarded it to Prince Edward. Finally there was Edward's custodianship during Robert's minority and the fact that some land had not been relinquished. Be that as it may, Robert of Gloucester observed that \"Of no one was Edward more afraid.\""]}, {"page": "Yes and no", "response": ["Marsh calls this four-form system of Early Modern English a \"needless subtlety\". Tooke called it a \"ridiculous distinction\", with Marsh concluding that Tooke believed Thomas More to have simply made this rule up and observing that Tooke is not alone in his disbelief of More. Marsh, however, points out (having himself analyzed the works of John Wycliffe, Geoffrey Chaucer, John Gower, John Skelton, and Robert of Gloucester, and Piers Plowman and Le Morte d'Arthur) that the distinction both existed and was generally and fairly uniformly observed in Early Modern English from the time of Chaucer to the time of Tyndale. But after the time of Tyndale, the four-form system was rapidly replaced by the modern two-form system."]}, {"page": "Maud de Braose, Baroness Mortimer of Wigmore", "response": ["At the Battle of Evesham on 4 August 1265, Maud's husband Roger fought on the side of Prince Edward, and personally killed Simon de Montfort. As a reward, Roger was given de Montfort's severed head and other parts of his anatomy, including his genitals. Roger sent these gruesome trophies home to Wigmore Castle as a gift to Maud..J. R. Maddicott (1994). Simon de Montfort. Cambridge: Cambridge University Press. p.344  The noted medieval historian Robert of Gloucester confirmed this by recording, To dam Maud the Mortimer that wel foule it ssende.David Matthews (2010). Writing to the King: Nation, Kingship and Literature in England, 1250–1350. Cambridge: Cambridge University Press. p.82 She held a great feast that very night to celebrate the victory, and de Montfort's head was elevated in the Great Hall, still attached to the point of the lance.Costain, The Magnificent Century, p.308"]}, {"page": "Josias Howe", "response": ["Hearne, who purchased a copy at the sale of Arthur Charlett's library on 14 January 1723, gave an account of it in his edition of Robert of Gloucester's Chronicle. Howe's preaching before the court at Oxford was much admired, and on 10 July 1646 he was created B.D. Howe was removed from his fellowship by the parliamentary visitors in 1648 for 'non-appearance', but was restored in 1660, and died in college on 28 August 1701. He has commendatory verses before the Works of Thomas Randolph, 1638, and before the 'Comedies, Tragicomedies, and other Poems' of William Cartwright (London, 1651)."]}]}}