{"wiki_id": "http://www.wikidata.org/entity/Q2256179", "itemLabel": "Don Goodman", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Don_Goodman", "wikipedia_page": {"main": "Donald Ralph Goodman (born 9 May 1966) is an English former professional footballer who played as a striker.\nHis professional career spanned for nearly 20 years, during which he played nearly 600 Football League games and scored 162 goals.", "link_mentions": [{"page": "Motherwell F.C.", "response": ["*1999–00 –  Don Goodman"]}, {"page": "Graham Taylor", "response": ["Taylor spent heavily on players while at Wolves, paying large sums for the likes of Steve Froggatt, Tony Daley, Mark Atkins, John de Wolf, Dean Richards and Don Goodman."]}, {"page": "Bradford City stadium fire", "response": ["The Bradford City matchday squad of players and staff consisted of Terry Yorath, Trevor Cherry, Chris Withe, Don Goodman, Eric McManus, Tony Clegg, John Hawley, Dave Evans, Bryan Edwards, John Hendrie, Mark Ellis, Stuart McCall, Peter Jackson, Bobby Campbell, Martin Singleton and Greg Abbott."]}, {"page": "Denis Smith (footballer, born 1947)", "response": ["In the summer of 1991, Stoke chairman Peter Coates offered Smith the vacant management position at the club, but Smith decided that potentially being dismissed by his hometown club would be too intense an experience emotionally, and chose to stay loyal to Sunderland. This was despite finances being tight at Sunderland as the club saved the money to build the Stadium of Light. However, after just 4 wins in the opening 14 matches of 1991–92, Smith decided to sell star striker Gabbiadini to Crystal Palace for £1.8 million in order to raise funds to improve the squad. He then spent £350,000 on Celtic left-back Anton Rogan and brought in strikers Don Goodman (£900,000 from West Bromwich Albion) and John Byrne (£225,000 from Brighton & Hove Albion). Smith was dismissed on 30 December 1991, with Sunderland lying 17th in the Second Division. His former assistant Malcolm Crosby took Sunderland to the 1992 FA Cup Final, in which they were beaten by Liverpool."]}, {"page": "Dean Richards (footballer)", "response": ["On 6 March 2011, two of his former clubs, Wolves and Tottenham, met in the Premier League. This fixture was designated as a tribute game, and as such featured several official and media tributes to Richards' career and life. Joining the teams in the centre circle at Molineux Stadium for a minute's applause before kick-off were his widow Samantha and his two sons Rio and Jaden as well as representatives from his four former clubs (Ledley King for Tottenham, Claus Lundekvam for Southampton, Matt Murray for Wolves, and Mark Lawn for Bradford City), two of his former managers Graham Taylor and Dave Jones, and two former teammates, Don Goodman and James Beattie."]}, {"page": "David Kelly (association footballer)", "response": ["Kelly did not make the move back to the top-flight with Newcastle as he was transferred to First Division side Wolverhampton Wanderers in June 1993 after manager Graham Turner paid £750,000 to secure his services. He hit 14 goals from 44 games in the 1993–94 season, as Wolves posted an eighth-place finish. New manager Graham Taylor then took Wolves to fourth place in 1994–95, with Kelly top-scoring with 22 goals in 54 appearances, breaking Steve Bull's run of eight consecutive seasons as Wolves's top-scorer. However, he lost his first team place at Molineux to Don Goodman early in the 1995–96 season and requested a transfer."]}, {"page": "1991–92 in English football", "response": ["5 December 1991 - Sunderland pay a club record £900,000 for West Bromwich Albion striker Don Goodman.", "11 January 1992 - Defender Gary Ablett makes the move across Stanley Park to join Everton from Liverpool for £750,000, on the same day that his new club loses 1-0 to Manchester United at Old Trafford, with an Andrei Kanchelskis goal taking Alex Ferguson's team back to the top of the league. Liverpool's improvement continues as a 2-1 home win over Luton Town takes them into third place, sending the visitors back into the relegation zone, while Sheffield United climb out with a 4-2 away win over bottom club Southampton. Coventry draw 2-2 at home with QPR in their first match under the management of Don Howe. Second Division leaders Blackburn beat Bristol City 4-0 at Ewood Park. Brighton keep their survival bid on track with a 3-1 home win over Barnsley. A mid-table clash at Roker Park sees Sunderland beat Millwall 6-2 with Don Goodman scoring a hat-trick. Newcastle have fallen into the relegation zone after being held to a 2-2 draw by Watford at Vicarage Road."]}, {"page": "Bob Taylor (footballer, born 1967)", "response": ["It was Albion manager Bobby Gould who brought him to The Hawthorns for a £300,000 fee in January 1992. Taylor was seen as a replacement for Don Goodman, who had been sold to Sunderland earlier in the season. Taylor scored on his debut against Brentford in a 2–0 Hawthorns win, and added another two on his away debut as Albion beat local rivals Birmingham City 3–0 at St Andrew's. Initially nicknamed \"Trigger\" (due to a perceived resemblance to the character in the television comedy Only Fools and Horses), Taylor soon became known as \"Super Bob\", a moniker he was first given by fans of Bristol City during his spell there, and scored eight times in 19 games during the second half of 1991–92."]}, {"page": "List of Bradford City A.F.C. players", "response": ["|Don Goodman||||1983–1987||70||14||"]}, {"page": "Black Country derby", "response": ["|align=\"left\"| Don Goodman"]}, {"page": "List of West Bromwich Albion F.C. seasons", "response": ["|align=left|Don Goodman", "|align=left|Don Goodman"]}, {"page": "List of Wolverhampton Wanderers F.C. seasons", "response": ["|align=left|Don Goodman"]}, {"page": "List of foreign J1 League players", "response": ["*Don Goodman - Sanfrecce Hiroshima - 1998−1999"]}]}}