{"wiki_id": "http://www.wikidata.org/entity/Q2267003", "itemLabel": "Michael Eavis", "itemDescription": "English dairy farmer and the founder of the Glastonbury Festival", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Eavis", "wikipedia_page": {"main": "Athelstan Joseph Michael Eavis  (born 17 October 1935) is an English dairy farmer and the co-creator of the Glastonbury Festival, which takes place at his farm in Pilton, Somerset.", "link_mentions": [{"page": "October 17", "response": ["*  1935   – Michael Eavis, English farmer, founded the Glastonbury Festival"]}, {"page": "September 19", "response": ["*1970 – Michael Eavis hosts the first Glastonbury Festival.  "]}, {"page": "Friends of the Earth", "response": ["Among those present at the launch of Friends of the Earth (EWNI)'s climate change campaign The Big Ask were Jude Law,Radiohead's Thom Yorke to guest-edit Observer Magazine published March 20, 2008. Edith Bowman, Siân Lloyd, Ross Burden, David Cameron, David Miliband, Thom Yorke, Stephen Merchant, Michael Eavis, and Emily Eavis."]}, {"page": "Glastonbury Festival", "response": ["Regarded as a major event in British culture, the festival is inspired by the ethos of the hippie, counterculture, and free festival movements. It retains vestiges of these traditions, such as the Green Fields area, which includes sections known as the Green Futures and Healing Field. After the 1970s, the festival took place almost every year and grew in size, with the number of attendees sometimes being swollen by gatecrashers. Michael Eavis hosted the first festival, then called Pilton Festival, after seeing an open-air Led Zeppelin concert at the 1970 Bath Festival of Blues and Progressive Music. The festival's record crowd is 300,000 people, set at the 1994 festival, when headliners the Levellers performed a set on The Pyramid Stage.", "The first festival at Worthy Farm was the Pilton Pop, Blues & Folk Festival, hosted by Michael Eavis on Saturday 19 September 1970, and attended by 1,500 people. There had been a commercial UK festival tradition which included the National Jazz and Blues Festival and the Isle of Wight Festival. Organiser Michael Eavis decided to host the first festival, then called Pilton Festival, after seeing an open-air concert headlined by Led Zeppelin at the 1970 Bath Festival of Blues and Progressive Music at the nearby Bath and West Showground in 1970.", "The \"Glastonbury Fair\" of 1971 was instigated by Andrew Kerr after being found and introduced to Michael Eavis by David Trippas and organised with help from Jean Bradbery, Kikan Eriksdotter, John Massara, Jeff Dexter, Arabella Churchill, Thomas Crimble, Bill Harkin, Gilberto Gil, Mark Irons, John Coleman, and Jytte Klamer. The 1971 festival featured the first incarnation of the \"Pyramid Stage\". Conceived by Bill Harkin the stage was a one-tenth replica of the Great Pyramid of Giza built from scaffolding and metal sheeting and positioned over a blind spring which was found by dowsing.", "The 1980s saw the festival become an annual fixture, barring periodic fallow years. In 1981, Michael Eavis took back solo control of the festival, and it was organised in conjunction with the Campaign for Nuclear Disarmament (CND). That year a new Pyramid Stage was constructed from telegraph poles and metal sheeting (repurposed from materials of the Ministry of Defence), a permanent structure which doubled as a hay-barn and cow-shed during the winter.", "The TV broadcast in 1994 was a crucial factor in ensuring that Orbital's performance at the festival achieved legendary status. As a result, living rooms across the country were able to experience what a rave might look like, and suddenly dance music – which had been ignored by the establishment and mainstream press for years – did not seem so dangerous and which would be a turning point for the music at Glastonbury. Speaking to The Guardian in 2013 about the Orbital gig, Michael Eavis noted that it marked dance music's appearance on the mainstream agenda. \"What was previously underground made it on to one of the big stages, and there was no going back from there. As the police and the council made me very well aware, the buzz had been around the raves and the market sound systems and in the travellers' fields for years. But it needed a showcase to make it legal.\" The gig opened the way for others such as the Chemical Brothers, Massive Attack and Underworld, who all played high-profile stages in the following years – developments that led to the launch of the festival's Dance Village in 1997.", "After the 2004 festival, Michael Eavis commented that 2006 would be a year off — in keeping with the previous history of taking one \"fallow year\" in every five to give the villagers and surrounding areas a rest from the yearly disruption. This was confirmed after the licence for 2005 was granted.", "On 20 December 2007, Arabella Churchill, an instrumental figure in the conception of the 1971 festival and since the 1980s area coordinator of the Theatre Field, died at St Edmund's Cottages, Bove Town, Glastonbury at the age of 58. She had suffered a short illness due to pancreatic cancer, for which she had refused chemotherapy and radiotherapy. She was a convert to Buddhism, and arrangements following her death respected her belief. Michael Eavis, paying tribute to her after her death, said \"Her vitality and great sense of morality and social responsibility have given her a place in our festival history second to none\".", "The Glastonbury Festival 2008 was held on 27, 28 and 29 June, headlined by Kings of Leon, Jay-Z and The Verve on Friday, Saturday and Sunday, respectively, with other notable acts including Neil Diamond, Shakin' Stevens, Levellers, and Stackridge, who opened the first festival in 1970. Continuing the procedure introduced in 2007, ticket buyers had to pre-register and submit a passport photo between 1 February and 14 March to buy tickets which went on sale at 9 am on Sunday 6 April. Following 40,000 tickets not being sold, the pre-registration process was reopened on 8 April. Several reasons have been cited for this, including the poor weather of the previous four years and the controversial choice of featuring the hip hop artist, Jay-Z, as a headlining act. A day before the festival began, Michael Eavis announced that there were still around 3,000 tickets remaining, making it possible that it would be the first festival in 15 years not to sell out in advance. It had also been announced that any remaining tickets would be sold from major branches of HMV.", "2008 saw the introduction of a new field adjacent to the Sacred space and Park Stage. Not named by the organisers, the festival goers themselves called it \"Flagtopia\" in reference to the flags located there. After the huge number of tents left behind in 2007 and when one of Michael Eavis's cows died after ingesting a metal tent-peg left in the soil, the Festival devised its Love the Farm, Leave No Trace campaign which gently pushed revellers to respect the environment and clear up after themselves. The Festival had always pushed a green agenda and new initiatives in 2008 included biodegradable tent pegs handed out free to all campers and biotractors running on waste vegetable oil. These new efforts were rewarded with The Greener Festival Award for 2008 alongside a number of other festivals also committed to environmentally friendly music festivals. The 2008 festival was reported to have cost £22 million to produce.", "The Glastonbury Festival 2010 took place between 23 and 28 June. On the last night, Michael Eavis appeared on the main stage with headline artist Stevie Wonder to sing the chorus of the latter's \"Happy Birthday\", marking the festival's 40th year. Tickets went on sale on 4 October 2009, using the same £50 deposit scheme introduced the previous year; unlike the previous two years, and more in common with earlier festivals, the tickets for the 2010 edition sold out in less than 24 hours. U2 were due to headline the Pyramid Stage on Friday night at Glastonbury 2010, but due to frontman Bono sustaining a back injury they were forced to pull out. According to the media, Bono was \"gutted\", even having written a song especially for the festival. Damon Albarn's Gorillaz replaced U2, and joined Muse and Stevie Wonder for the Saturday and Sunday headline slots respectively. It was Albarn's second headlining act in two years. Pet Shop Boys returned after 10 years to headline the Other Stage on the Saturday Night. The entire stage set from their Pandemonium Tour was brought in for the performance which was extremely well received. Radiohead's Thom Yorke and Jonny Greenwood made a surprise appearance with a nine-song set. The weather at the festival was among some of the best ever, the festival-goers enjoying 3 days of abundant sunshine and very warm to hot temperatures, which reached close to 30 degrees on the Sunday; it was the first rain-free festival since 2002 and the hottest since the festival began.", "During 2010 Michael Eavis received a donation from British Waterways of timber from the old gates at Caen Hill Locks in Wiltshire. This was used to construct a new bridge which was dedicated to the memory of Arabella Churchill. The following year more of the redundant lock gates were used to build the Campo Pequeno amphitheatre.", "The festival was not held in 2012, giving the site and organisers a \"fallow year\" which originally would have been in 2011, in keeping with the tradition of taking a break every fifth year. Michael Eavis cited the shortage and likely cost of portable toilets and policing, due to the needs of the 2012 Summer Olympics, as being amongst the reasons. The decision to move the fallow year to 2012 also proved to be a fortunate one, as Somerset experienced spells of persistent heavy rain in the period up to and including the week that the festival would normally have been held. Indeed, Emily Eavis suggested that the festival itself might have been called off, such was the severity of the weather. Registration for tickets to the 2013 festival began in June 2011 and ticket booking opened at 9am on Sunday 7 October 2012, with 135,000 selling out in a record time of one hour and forty minutes. To mark the 2012 Glastonbury weekend, Eavis was invited to guest edit the local paper, the Western Daily Press, on Saturday 23 June.", "Since 1981, the festival has been organised by local farmer and site owner Michael Eavis (through his company Glastonbury Festivals Ltd). Eavis ran the festival with his wife Jean until her death in 1999, and now co-organises the event with his daughter Emily Eavis. In 2002, Festival Republic (a company consisting of both Live Nation and MCD) took on the job of managing the logistics and security of the festival through a 40% stake in the festival management company. This relationship ended in 2012 and Glastonbury festival is now independent. Glastonbury Festivals Ltd donates most of their profits to charities, including donations to local charity and community groups and paying for the purchase and restoration of the Tithe Barn in Pilton."]}, {"page": "Billy Bragg", "response": ["Bragg was invited by Michael Eavis to curate the Leftfield stage at Glastonbury Festival in 2010, which he has continued to do in subsequent years. He also took part in the Bush Theatre's 2011 project Sixty-Six Books, where he wrote a piece based upon a book of the King James Bible. Bragg performed a set of the Guthrie songs that he had set to music for Mermaid Avenue during the Hay Literary Festival in June 2012, he also performed the same set on the Friday night of the 2012 Cambridge Folk Festival."]}, {"page": "Greenbelt Festival", "response": ["| rowspan=\"3\" |Pussy Riot, We Are Scientists, Ozomalti, Ibibio Sound Machine, I'm With Her, Duke Special, Lowkey, Lewis Watson, The Reverend Peyton's Big Damn Band, CC Smugglers, Lee Bains III & The Glory Fires, Pierce Brothers, L.A. Salami, Grace Petrie, Martyn Joseph, Zach Said, Lots Holloway, Xylaroo, The Welcome Wagon, Jack Monroe, Michael Eavis, Kate Raworth, Carol Ann Duffy, Jon McGregor, Harry Baker, Jojo Mehta, Simon Mayo, Vicky Beeching, Lauri Love, Dawn Foster, Robyn Travis, Jonathan Bartley, Eve Poole, Broderick Greer, Lynne Segal, Rants n Bants, Winnie Varghese, Anthony Reddie, Sam Wells, Anna Kessel, Matthew Morris, Paula Gooder, Peterson Toscano, Roman Krznaric, Stephen James Smith, Garth Hewitt, Flo & Joan, Harry & Chris, Tony Law, Bryony Kimmings, Alula Cyr, Milk Presents, Malak Mattar"]}, {"page": "2003 in music", "response": ["*June 27–29 – In the Glastonbury Festival, U.K., headline acts include David Gray, R.E.M., Primal Scream, Morcheeba, The Flaming Lips, Radiohead, Super Furry Animals, Lamb, Macy Gray, Feeder, Manic Street Preachers, Moby and Doves. The weather is mostly dry and the festival deemed a success from both a security and entertainment viewpoint by Michael Eavis."]}, {"page": "1935 in music", "response": ["*October 17 – Michael Eavis, English dairy farmer, founder of the Glastonbury Festival"]}, {"page": "List of sailors", "response": ["* Michael Eavis, founder of the Glastonbury Festival"]}, {"page": "Puriton", "response": ["Puriton hosts its own Party in the Park. It has been run annually since 2010 and takes place in the middle of August, typically from 2-10pm. The afternoon session from 2-6pm hosts a variety of stalls, rides and games for children and an arena in the field where groups from the village and beyond are invited to perform. The evening session from 6-10pm turns the field into a music concert, allowing local bands and artists the chance to perform on a lorry that has been transformed into a stage. 2014 saw Michael Eavis open the evening's entertainment, alongside Puriton's own Dolly Pardon (A spoof of the finale act from Glastonbury Festival 2014, Dolly Parton)."]}, {"page": "Al Stewart", "response": ["In 1970, Stewart and fellow musician Ian A. Anderson headed to the small town of Pilton, Somerset. There, at Michael Eavis's Worthy Farm, Stewart performed at the first-ever Glastonbury Festival to a field of 1,000 hippies, who had paid just £1 each to be there."]}, {"page": "Rock festival", "response": ["|style=\"text-align:left\"|In addition to contemporary music, the festival hosts dance, comedy, theatre, circus, cabaret, and other arts. It is organized by Michael Eavis on his own farm land. The first ever opening act was the English progressive rock group Stackridge."]}, {"page": "Carter the Unstoppable Sex Machine", "response": ["The demise of Rough Trade records necessitated a change of label, and Carter made the switch to Chrysalis Records to work on their third album. That album, 1992 – The Love Album, went straight to number one in the UK Albums Chart, propelling the band to pop stardom. Also, in 1992, the band headlined the Glastonbury Festival where Fruitbat, annoyed at the shortening of their headline set due to other bands overrunning insulted Michael Eavis and was subsequently banned from the festival forever. The band was unhappy, however, and this came across in the anger and cynicism of their next record, Post Historic Monsters."]}, {"page": "WaterAid", "response": ["WaterAid has been associated with the Glastonbury Festival since 1994. In 2006 the festival's founder Michael Eavis and his daughter Emily visited WaterAid's work in Mozambique and by 2007 130 WaterAid volunteers helped at the festival. In 2011, there were around 200 WaterAid volunteers present.. In 2016, by which time there were over 500 Wateraid volunteers at Glastonbury, the charity introduced Talking Toilets which gave out information voiced by celebrities such as Cerys Matthews and Brian Blessed."]}, {"page": "Pilton, Somerset", "response": ["Pilton is famous as the location of the Glastonbury Festival, which is run by Pilton farmer Michael Eavis and his daughter Emily Eavis. Being the village at which the festival is held, all villagers get a free ticket."]}, {"page": "Chilcompton", "response": ["The village holds a village day fete every year, hosting live acts, games, stalls and foodstuffs, along with guest speakers such as Michael Eavis (owner of Glastonbury Festival). There have also been some charity events such as sports relief run-a-mile held in the recreational grounds. The primary school hosts summer and winter fairs. The village hall holds many events from the team at Take Art, a group providing a variety of entertainment, such as stand-up comedy, musical acts and other entertaining acts. The local actors guild (CADS — Chilcompton Amateur Dramatics Society) led by a headmaster of a nearby school, Andrew Morris, put on productions every year, traditionally comic, though recently they have moved to more serious plays, such as Shakespeare's Macbeth."]}, {"page": "Quintessence (English band)", "response": ["In 2010, Maha Dev's new Quintessence were invited by Michael Eavis to play the 40th Anniversary Glastonbury Festival, where they were joined by original vocalist Jones. Produced by John Barham, Quintessence's previous producer, this performance was recorded and released as Rebirth: Live At Glastonbury in 2011. The reunion of Phil Shiva Jones with Dev's Quintessence for the 2010 Glastonbury Festival was documented in a BBC One Inside Out programme which was aired in November 2010."]}, {"page": "Peter Mond, 4th Baron Melchett", "response": ["At the Department of the Environment, he chaired a Government inquiry into the then controversial area of pop festivals, leading to legislation that is still in force (credited by Michael Eavis as the basis on which the Glastonbury Festival has been able to continue to flourish), and it ensured that some of the UK's first wildlife protection laws were passed."]}, {"page": "Max Yasgur", "response": ["*Michael Eavis, British farmer who has hosted the Glastonbury Festival since 1970"]}, {"page": "The Subways", "response": ["Having the home recording system also proved useful for production: the band felt that it would not only benefit themselves, but other local bands who could not afford the studio prices, even in the Welwyn Garden City area. It was here that Billy and Charlotte both stumbled upon the opportunity that would eventually prove significant for the band. \"I was producing a local Welwyn Garden City band in my front lounge one day and I noticed that it was quite good so I asked if they were going to send it to any London venues, because I knew a few that would like it. They said that they were going to send it off to Michael Eavis who runs Glastonbury Festival, and I asked why...\" Michael Eavis that year was running an unsigned bands competition to play on the Other Stage, and The Subways decided that would be a great idea. \"It was really just another address to send one of our CDs off to. All we wanted was to play shows and this was another great opportunity. The CD we sent off to Michael Eavis was literally one among a bunch of 30 that were being sent out to London promoters for a load of gigs we wanted to book. We never expected the phone call saying that we'd won and were to play Glastonbury\", said Cooper on radio. The Subways remain friends with Eavis today, and have suggested that other upcoming bands should send demos to Eavis."]}, {"page": "Arabella Churchill (charity founder)", "response": ["In 1971 she was invited to represent Britain at the Norfolk International Azalea Festival in Virginia, established in 1953 after NATO's Allied command was established there. Each year a NATO country is honoured, and invited to send a beautiful \"Azalea Queen\" as its ambassador. Churchill refused to go, indicating in a letter she believed in the goals of the peace movement, and was horrified by the Vietnam War. Chased through London by a surprised press, she left instead for rural Somerset, where she helped lead the first full-scale incarnation of the Glastonbury Festival with Andrew Kerr, Thomas Crimble, Michael Eavis and many others.", "On Thursday 20 December 2007, Churchill died at St Edmund's Cottages, Bove Town, Glastonbury, Somerset, aged 58. She had suffered a short illness due to pancreatic cancer, for which she had refused chemotherapy and radiotherapy.  Arrangements following her death reflected her Buddhism, and included a parade and simple farewell on the final evening of the Glastonbury Festival in June 2008.  Festival organiser Michael Eavis, paying tribute to Churchill after her death, said \"Her energy, vitality and great sense of morality and social responsibility have given her a place in our festival history second to none.\"", "In 2010 Michael Eavis received a donation from British Waterways of timber from the old gates at Caen Hill Locks in Wiltshire. This was used to construct a new bridge, dedicated to Churchill's memory, at the Glastonbury Festival site."]}, {"page": "System 7 (band)", "response": ["Partly through their extended involvement with Megadog, by 1994 System 7 had become an established live act, in particular playing at many music festivals. In 1995, through his previous association with Michael Eavis, Steve Hillage was asked to oversee the putting together of the first official dance music stage at Glastonbury Festival. In subsequent years System 7 played at Glastonbury a further 15 times, often at the open-air Glade stage, a further dance music development at the festival that started in 2000. The crew from the Glastonbury Glade stage created their own spin-off festival, the Glade Festival, starting in 2004, with System 7 playing there 5 times."]}, {"page": "Wells (UK Parliament constituency)", "response": ["Aside from energy, transportation, retail and distribution which are major sectors, agriculture and tourism are still important areas to this central and quite quintessential part of Somerset which includes the coastal resort of Burnham-on-Sea, the city of Wells with its cathedral, and notable natural landmarks such as the Cheddar Gorge and Glastonbury Tor. The site of the Glastonbury Festival also lies within this seat, causing a major influx of visitors in late June. The founder of the festival, Michael Eavis, stood as the Labour candidate for the 1997 election, receiving 10,204 votes, the highest for Labour since 1974."]}, {"page": "Music of Somerset", "response": ["The Glastonbury Festival of Contemporary Performing Arts, commonly abbreviated to  Glastonbury or Glasto, is the largest green field open-air music and performing arts festival in the world.\"http://www.glastonburyfestivals.co.uk/information/what-is-glastonbury/\" Organiser Michael Eavis stated that he decided to host the first festival, then called Pilton Festival, after seeing an open air Led Zeppelin concert at the Bath Festival of Blues and Progressive Music 1970 at the nearby Bath and West Showground in 1970.Smith, David, 2005. \"Far-out Man .\" In The Observer. The Big Green Gathering (BGG) was a festival with an environmental focus which happened during most summers between 1994 and 2007. It was held at various locations in Somerset and Wiltshire. The event grew from the Green Fields area of the Glastonbury Festival."]}, {"page": "Major Major (band)", "response": ["Major Major became the first confirmed act for Glastonbury Festival 2009, after winning the Rockstar Bands competition on 5 September 2008.  The competition was backed by the Glastonbury Festival organiser Michael Eavis and Peter Gabriel. As winners of the competition, they also played a live set at the Pilton Equinox Party on Friday 18 September – along with Franz Ferdinand and The Ting Tings."]}, {"page": "Wells Cathedral School", "response": ["*Michael Eavis, founder of the Glastonbury Festival"]}, {"page": "Meltdown (festival)", "response": ["| A Tribute to Tony Wilson, Current 93, Alan Price Set, Ben Waters: Boogie 4 Stu, Geno Washington and the Ram Jam Band, John Cooper Clarke, John Otway and Wild Willy Barrett, London Sinfonietta, Lydia Lunch, Madness, Michael Eavis: A Glastonbury Life, Nick Lowe and special guests, Anna Calvi, Peter Asher: A Musical Memoir of the Sixties and Beyond, Ray Davies, Roger McGough and special guests, Ron Sexsmith, Terry Jones and Michael Palin In Conversation, The Crazy World of Arthur Brown and The Legendary Pink Dots, The Fugs, The Sonics and Wire, Yo La Tengo"]}, {"page": "Dave Fanning", "response": ["In more recent years, Fanning has conducted public interviews with celebrities and musicians at events ranging from The Dalkey Book Festival, to Dublin's Web Summit, to the Electric Picnic. These include, Richard E. Grant at University College Dublin, Jonathan Rhys-Meyers in Trinity College Dublin, filmmaker David Cronenberg at Trinity College Dublin, Glastonbury's Michael Eavis at the Aviva Stadium, Sopranos creator David Chase at the residence of the American Ambassador in Dublin's Phoenix Park, producer Steve Lillywhite at Core Media, and Billie Eilish at Electric Picnic."]}, {"page": "Glastonbury (film)", "response": ["Glastonbury is a 2006 rockumentary film directed by Julien Temple which details the history of the Glastonbury Festival from 1970 to 2005. It is the third attempt to make a film about the festival.  The film is made up of footage shot by Temple at the festival in 2002, 2003, 2004 and 2005 as well as footage sent in by festival goers after a request on websites and newspapers for footage. Temple had initially only agreed to make a film of the 2002 festival after organiser Michael Eavis expressed concern that that would be the last year of the festival. Temple then realised that he wanted to make a film detailing the full history of the festival. The film also includes footage shot by Channel 4 and the BBC during their coverage of the festival since 1994."]}, {"page": "Glastonbury Anthems", "response": ["Producer: Ben Challis.  Co-producer: Caroline McGee.  Executive producers for EMI: Stefan Demetriou and Jo Brooks. Executive producers for the BBC: Mark Cooper and Alison Howe.  Artwork  Alex Creedy. Festival Organisers  Michael Eavis & Emily Eavis. Mastered and authored at Abbey Road Studios. Directors: Gavin Taylor (1994, 1995) Janet Fraser Crook (1997-2004), Declan Lowney (1994-2004) & Phil Heyes (2004). A Visit To The Glastonbury Greenfields directed and Produced by Dorian Williams. Released by EMI."]}, {"page": "K Cera Cera", "response": ["Plans to broadcast the track from the main stage of the 1993 Glastonbury Festival at the beginning and end of every day were scuppered by festival organiser Michael Eavis because, in his words, the record was \"simply dreadful\".  The record was instead broadcast at that year's Phoenix Festival.New Musical Express, 24 July 1993."]}, {"page": "Worthy FM", "response": ["Worthy FM was launched in 2007 to replace the festival's previous onsite station, Radio Avalon. The name Worthy FM was chosen by festival organiser Michael Eavis and is named after Worthy Farm, Eavis' farm and the home of the festival.", "Worthy FM started life in the same location as its predecessor, Radio Avalon, on the upper western edge of Big Ground field, near Worthy Farm. It featured a number of different presenters and shows, many focussing in on one particular aspect of the festival, such as its emerging talent competition and the Elemental tent. Many guests came to the station to perform on its outdoor stage, including Bible Code Sundays, Small White Light, The Beathovens and Bluebird Kid Clark, whilst interviews included Michael Eavis, Damian Marley, Paul Weller, Seasick Steve, The Proclaimers and Bob Wilson from Greenpeace"]}, {"page": "Bath Festival of Blues and Progressive Music", "response": ["Michael Eavis was attendant at the festival and was inspired to hold later that year the first event of what would become the Glastonbury festival of contemporary performing arts."]}, {"page": "Brothers Cider", "response": ["In 1995, Michael Eavis offered the Brothers space for a bar at the Glastonbury Festival, near the Jazz World Stage, but with sales restricted to perry-based drinks. When the offer of \"perry\" was met with little understanding the Brothers would describe it as \"like cider but made from pears\" and after repeating this tens of thousands of times the shorthand \"pear cider\" was introduced and understood.  Ten years later, in 2005, Brothers was packaged and launched into pubs and the retail trade."]}, {"page": "Blackbud", "response": ["Blackbud are an English indie rock band from Wiltshire, comprising Joe Taylor (guitar, vocals), Adam Newton (bass, backing vocals) and Sam Nadel (drums, backing vocals). Blackbud have been compared to artists such as Jeff Buckley, Radiohead and Led Zeppelin, and have toured extensively, to critical acclaim, having attracted the attention of Jimmy Page, Michael Eavis and Steve Lamacq, amongst other noteworthy people. In January 2010, the band entered an indefinite hiatus."]}]}}