{"wiki_id": "http://www.wikidata.org/entity/Q2265125", "itemLabel": "Edward Hargitt", "itemDescription": "Scottish ornithologist (1835-1895)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Hargitt", "wikipedia_page": {"main": "Edward Hargitt (3 May 1835 – 19 March 1895) was a Scottish ornithologist and landscape painter.", "link_mentions": [{"page": "Northern flicker", "response": ["File:'Colaptes mexicanus' by Edward Hargitt, 1889.jpg|Painting of \"Colaptes mexicanus\" by Edward Hargitt, 1889"]}, {"page": "List of ornithologists", "response": ["*Edward Hargitt – Scotland"]}, {"page": "Chrysocolaptes", "response": ["The genus was introduced by  English zoologist Edward Blyth in 1843. The type species was subsequently designated as the Javan flameback (Chrysocolaptes strictus) by Scottish ornithologist Edward Hargitt in 1890. The genus name combines the Ancient Greek khrusos meaning \"gold\" and kolaptēs meaning \"chiseller\". The genus belongs to the tribe Campephilini in the subfamily Picinae and is sister to the orange-backed woodpecker, the only species in the genus Reinwardtipicus."]}, {"page": "Dendrocopos", "response": ["The genus was introduced by the German naturalist Carl Ludwig Koch in 1816.  The name Dendrocopus combines the Greek words dendron meaning \"tree\" and kopos meaning \"striking\". The type species was designated as the great spotted woodpecker (Dendrocopos major) by the Scottish ornithologist Edward Hargitt in 1890 in his catalogue of woodpeckers in the collection of the British Museum."]}, {"page": "Bedford Park, London", "response": ["File:The Church, Tabard Inn and Stores from Acton Green by Edward Hargitt 1882.jpg|The Church, Tabard Inn and Stores from Acton Green by Edward Hargitt, 1882"]}, {"page": "1835 in Scotland", "response": ["* 3 May – Edward Hargitt, ornithologist and landscape painter (died 1895)"]}, {"page": "Doerries's pygmy woodpecker", "response": ["John Gould obtained two specimens that he used to draw a lithograph for his collection. They were a cock from Henry Seebohm and a hen from Edward Hargitt, who was the first to write a description of the species in 1881."]}, {"page": "Hargitt", "response": ["#REDIRECT Edward Hargitt"]}]}}