{"wiki_id": "http://www.wikidata.org/entity/Q2276884", "itemLabel": "Samantha Ronson", "itemDescription": "DJ, singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Samantha_Ronson", "wikipedia_page": {"main": "Samantha Ronson (born 7 August 1977) is an English DJ, singer, and songwriter who lives in Santa Monica, California, US.", "link_mentions": [{"page": "August 7", "response": ["*  1977   – Samantha Ronson, English singer-songwriter and DJ"]}, {"page": "St John's Wood", "response": ["*Mark Ronson (DJ, songwriter, record producer and record executive), Samantha Ronson (DJ, singer and songwriter), and Charlotte Ronson (fashion designer) lived in St John's Wood as children, where their parents' home was a celebrity hangout."]}, {"page": "Simon Rex", "response": ["Rex was an investor in the New York City nightclub The Plumm with partners Noel Ashman, Samantha Ronson, Chris Noth, and others. It opened in 2006 and closed in 2009."]}, {"page": "1977 in music", "response": ["*August 7 – Samantha Ronson, English DJ and singer-songwriter (Lindsay Lohan, Mark Ronson) "]}, {"page": "1986 in music", "response": ["*July 2 – Lindsay Lohan, American actress, musician, singer-songwriter, documentary-maker, businesswoman and model (Samantha Ronson, Hilary Duff, Aliana Lohan) "]}, {"page": "List of twins", "response": ["* Charlotte and Samantha Ronson (1977–)"]}, {"page": "List of show business families", "response": ["* Mick Jones of Foreigner is the stepfather of producer and DJ Mark Ronson, fashion designer Charlotte Ronson, and DJ/singer Samantha Ronson."]}, {"page": "Studio 54", "response": ["The second floor of the theater was used as a nightclub, called Upstairs at Studio 54, on weeks when plays were not being staged. The club was operated by Noel Ashman and Josh Hadar, who was one of the Allied partners. Upstairs at Studio 54 performers included Mark Ronson, Samantha Ronson, Gloria Estefan, Jody Watley, and Newsical."]}, {"page": "Pauley Pavilion", "response": ["* Jay-Z concert with Rihanna, on November 8, 2009. Enjoying their performances were Justin Timberlake, Jessica Biel, Nicole Richie, Samantha Ronson, James Blunt, and Jamie Foxx.Jocelyn Vena, Rihanna Joins Jay-Z Onstage At Los Angeles Concert, MTV.com, November 9, 2009"]}, {"page": "9:30 Club", "response": ["Later that month, the 9:30 Club partnered with Planned Parenthood for two shows. The first, a free event titled \"Show Up!\", took place on January 19, 2017 featuring Common and The National. The second was the official 2017 Women's March after-party/benefit show hosted by Funny or Die on January 21, 2017, titled \"Laugh, Dance... then Get to Work!\" Special guests at this performance included Senators Al Franken and Cory Booker, Sleater-Kinney, Sara Bareilles, Sam Harris of X Ambassadors, Ted Leo, Dirty Projectors' David Longstreth, The National, Ani DiFranco, Samantha Ronson, Macklemore, Tig Notaro, Janeane Garofalo, Lizzy Caplan, Ashley Judd, Rosario Dawson, Eric Andre, Michelle Rodriguez, Cameron Esposito and River Butcher, Ronna and Beverly, Casey Wilson, June Diane Raphael, and Morgan Walsh."]}, {"page": "Ikutaro Kakehashi", "response": ["Kakehashi died in April 2017, aged 87. Tributes came from musicians such as Tommy Snyder of Godiego, Chris Carter of Throbbing Gristle, Samantha Ronson, Matthew Herbert, Marc Almond of Soft Cell, Martyn Ware of the Human League, and producer Paul Epworth. Moog Music described him as a \"model of resilience and a genuine trailblazer\", and Dave Smith of Sequential wrote that he was \"just an amazing man, a good friend, a very good competitor of course, and just innovative continually all that time\"."]}, {"page": "DJ AM", "response": ["After a memorial service, Goldstein was interred at Hillside Memorial Park Cemetery, a Jewish cemetery near Los Angeles, on September 2, 2009. The following day, a memorial was held at the Hollywood Palladium. Among the hundreds of attendees were Nicole Richie, Travis Barker, Lindsay Lohan, Samantha Ronson, Eric Dane, Rebecca Gayheart, Scott Caan, and DJ Jazzy Jeff. Wood made an emotional speech at the service, describing Goldstein as her soulmate."]}, {"page": "List of female electronic musicians", "response": ["* Samantha Ronson"]}, {"page": "Jesse Bradford", "response": ["Bradford was an investor in the Manhattan nightclub The Plumm, along with Chris Noth, Samantha Ronson, and Noel Ashman, among others."]}, {"page": "Graduation (album)", "response": ["West began working on Graduation immediately after releasing his second studio album Late Registration. By late September 2005, West had already completed three songs for the album, which he intended to contain a total of twelve tracks. Around the time of the recording of the third studio album, West would often listen to songs written by folk and country singer-songwriters Bob Dylan and Johnny Cash in hopes of developing methods to augment his word play and storytelling abilities. The former musician had been recommended to West by multiple of his friends, including English disc jockey Samantha Ronson, all of whom claimed his music and the way he dealt with the press reminded them of Dylan. West also listened to his most favorite alternative rock bands, including The Killers, Radiohead, Modest Mouse, and Keane, in order to gain new ideas on how to make his hip-hop production style more stadium-friendly. Additionally, West would often test his new songs on his iPod, in his office, in dance clubs and just about anywhere people might listen to his music. He would then make adjustments to the tracks based on feedback he received, repeating the process as many times as necessary."]}, {"page": "Mark Ronson", "response": ["Ronson's has two younger sisters, twins Charlotte Ronson, a fashion designer, and Samantha Ronson, a singer and DJ. Through his mother's second marriage to Mick Jones he has two elder step-siblings and two half-siblings, including actress Annabelle Dexter-Jones. Through his father's second marriage, he has three other half-siblings.", "|Rhymefest & Samantha Ronson"]}, {"page": "Beachwood Canyon, Los Angeles", "response": ["*Samantha Ronson, DJ"]}, {"page": "Chapin School", "response": ["*Samantha Ronson, 1995. Singer-songwriter, deejay"]}, {"page": "Meghan Toohey", "response": ["* DJ Samantha Ronson"]}, {"page": "Samantha Rosnon", "response": ["#REDIRECT Samantha Ronson"]}, {"page": "Delano Las Vegas", "response": ["THEhotel signs were removed from the tower in June 2014, and were replaced two months later with new signs for the renamed hotel. Delano Las Vegas officially opened with a ribbon-cutting ceremony on September 2, 2014. A grand-opening party was held on September 18, 2014, with Samantha Ronson as DJ and a performance by Magic!. The party was also attended by Charlotte Ronson and actress Jaime King. The hotel's penthouses were the last remaining rooms to undergo renovations, with completion expected for October 2014."]}, {"page": "List of Roc-A-Fella Records artists", "response": ["* Samantha Ronson*"]}, {"page": "Perez Hilton", "response": ["On October 11, 2007, a judge cleared the way for Hilton to be deposed in an ongoing defamation suit brought against him by DJ Samantha Ronson, after a post on PerezHilton.com claimed that she had planted cocaine in friend Lindsay Lohan's car and set Lohan up to be photographed while under the influence of alcohol and drugs. Hilton's report was a repetition of gossip initially posted on CelebrityBabylon.com. The judge was informed in court that the owner of that site has already settled the case with Ronson. On January 23, 2008, Perez Hilton was awarded $85,000 by superior court Judge Elihu Berle in this lawsuit filed by Ronson."]}, {"page": "Stryker (DJ)", "response": ["During the September 24, 2008 episode of Loveline, both DJ Samantha Ronson and actress Lindsay Lohan spoke to Stryker regarding the plane crash involving DJ AM and Travis Barker. During the conversation, Stryker casually asked Lohan how long she and Ronson had been together, to which Lohan confessed that they had been in a relationship for \"a very long time\". Despite obvious evidence before this incident, this remark unintentionally became what is widely regarded as Lohan officially 'coming out'."]}, {"page": "1977 in the United Kingdom", "response": ["*7 August – Charlotte Ronson, designer and Samantha Ronson, DJ (twin sisters)"]}, {"page": "Lindsay Lohan", "response": ["Lohan began dating actor Wilmer Valderrama in 2004, Hard Rock Cafe heir Harry Morton in 2006, and DJ Samantha Ronson in 2008 and 2009. In April 2009, following her breakup with Ronson, Lohan appeared in a dating video spoof on the comedy website Funny or Die. It was viewed 2.7 million times in the first week and received favorable comments from the media. In 2016, Lohan was engaged to London-based Russian millionaire Egor Tarabasov, owner of the real estate agency Home House Estates and son of Dmitry Tarabasov. They reportedly split up in mid-2017, with Lohan accusing Tarabasov of abuse and him accusing her of stealing £24,000 worth of his belongings. On November 28, 2021, Lohan announced her engagement to financier Bader Shammas after almost two years of dating."]}, {"page": "List of British Jewish entertainers", "response": ["*Samantha Ronson (born 1977), singer-songwriter"]}, {"page": "List of songs produced by Dallas Austin", "response": ["|\"Built This Way\" || Samantha Ronson"]}, {"page": "Mean Girls", "response": ["# \"Built This Way\" by Samantha Ronson"]}, {"page": "Paris Hilton", "response": ["In February 2012, Hilton introduced a new line of sunglasses in Shanghai, and in May, she released her fifteenth perfume, Dazzle. In June, Hilton made her debut as a DJ at a Brazilian pop-music festival, attracting negative responses from DJs Deadmau5, Samantha Ronson and Afrojack."]}, {"page": "The Plumm", "response": ["The Plumm was a nightclub that opened on April 28, 2006, near the Meatpacking District of Manhattan. It was co-owned by Noel Ashman, Chris Noth, Samantha Ronson, Joey McIntyre, Damon Dash, Jesse Bradford, Simon Rex, and Rodney Afshari among others."]}, {"page": "Does It Offend You, Yeah?", "response": ["Does It Offend You, Yeah? also DJ at various clubs and festivals across the world. They have done so on the same bill as acts such as, Justice, Peaches, MSTRKRFT, Simian Mobile Disco, Steve Aoki, DJ AM, Ladytron, Samantha Ronson and 2 Many DJ's."]}, {"page": "List of gay, lesbian or bisexual people: R", "response": ["| Samantha Ronson"]}]}}