{"wiki_id": "http://www.wikidata.org/entity/Q2272492", "itemLabel": "Mark Wingett", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Wingett", "wikipedia_page": {"main": "Mark Christopher Wingett (born 1 January 1961) is an English actor.\nHe is best known for his roles as PC/DC Jim Carver in The Bill and EastEnders as Mike Swann, Hollyoaks as Frank Symons and Heartbeat as Terry Molloy. His first screen role was in the 1967 film To Sir, with Love as a school pupil.", "link_mentions": [{"page": "1979 in film", "response": ["| Quadrophenia || World-Northal Corporation / The Who Films Ltd || Franc Roddam (director/screenplay); Dave Humphries, Martin Stellman, Pete Townshend (screenplay); Phil Daniels, Leslie Ash, Toyah Willcox, Philip Davis, Mark Wingett, Sting, Ray Winstone, Gary Shail, Garry Cooper, Trevor Laird, Andy Sayce, Kate Williams, Michael Elphick, Kim Neve, Benjamin Whitrow, Daniel Peacock, Jeremy Child, John Phillips, Timothy Spall, Patrick Murray, George Innes, John Bindon, P.H. Moriarty, Hugh Lloyd, Gary Holton, John Altman, Jesse Birdsall, Olivier Pierre, Julian Firth, Simon Gipps-Kent, Mickey Royce, Dave Cash, John Blundell || Drama || Live Action "]}, {"page": "GamesMaster", "response": ["*Episode 16 – Mark Wingett and Huw Higginson – 14 January 1993 "]}, {"page": "Quadrophenia (film)", "response": ["In 1964, young London Mod Jimmy Cooper (Phil Daniels), disillusioned by his parents and a dull job as a post room boy in an advertising firm, vents his teenage angst by taking amphetamines, partying, riding scooters and brawling with Rockers, accompanied by his Mod friends Dave (Mark Wingett), Chalky (Philip Davis) and Spider (Gary Shail)."]}, {"page": "Cowplain", "response": ["* Mark Wingett, actor known for playing police constable Jim Carver in The Bill "]}, {"page": "Breaking Glass (film)", "response": ["The film depicts the rise and fall of Kate Crowley (Hazel O'Connor), an angry but creative young singer and songwriter. At the beginning of the film, she is discovered by Danny (Phil Daniels), a young man who desperately wants to become a promoter of music bands but is stuck working for another agent (who forces him to buy hundreds of copies of the singles of one of his artists, Suzie Sapphire, to fix the music charts). Danny takes an active part in controlling Kate's career, impressed with her talent if not her band, whom he promptly fires. He arranges auditions and reaches out to former friends, and in doing so Kate's new band, Breaking Glass, is formed. Breaking Glass consists of Kate on vocals and keyboard, best friends Tony (Mark Wingett) and Dave (Gary Tibbs) on lead and bass guitar respectively, the heroin-addicted and partially-deaf Ken (Jonathan Pryce) on saxophone and the 'mental' Mick (Peter-Hugo Daly) on drums.", "* Mark Wingett – Tony"]}, {"page": "You Bet!", "response": ["|bgcolor=\"ddffdd\"| Mark Wingett"]}, {"page": "Horndean Technology College", "response": ["*Mark Wingett - Actor"]}, {"page": "Mickey Miller", "response": ["Mickey is the son of Mike Swann (Mark Wingett) and Rosie Miller (Gerry Cowper). Mike left the family when Mickey was just three years old. He grew up with his sister Dawn and later his half siblings Demi (Shana Swash) and Darren Miller (Charlie G. Hawkins). He has always considered his mother's long-term partner, Keith Miller, to be his father, and uses his surname.", "The following year, Mickey's family was completed by the introduction of his elder sister Dawn Swann (Kara Tointon), and his con-artist father Mike Swann (a guest character played by Mark Wingett), who both made their first appearance in a special week of off-set episodes, set in France in September 2005. In the storyline, Mickey went to France with some of his friends to visit his sister, and was surprised to see his estranged father, who had abandoned him as a child."]}, {"page": "Rosie Miller", "response": ["Rosie's mother committed suicide when she was young, leaving her with her brother, Clint, and other siblings. Rosie was married to Mike Swann (Mark Wingett), and they had two children, Mickey and Dawn (Joe Swash and Kara Tointon). While they were still very young, Mike left Rosie and wasn't seen for many years."]}, {"page": "Dawn Swann", "response": ["Dawn Swann grew up in the form of complications before adulthood. Her father, Mike (Mark Wingett), deserted her when she was six. She left home at 16, disapproving of her mother Rosie Miller (Gerry Cowper) for her relationship with her partner Keith (David Spinx). In 2005, she reacquainted herself with Mike in France. She moves to Walford after Mike's property scam fails, and lives with Rosie. Claiming she needs money for a medical operation, she cons her neighbours into paying for her breast implants. Mike comes to Walford, and when his mother Nora (Pamela Cundell) dies, she leaves £5,000 to Rosie. Mike persuades Dawn to pose as Rosie to get the money, and tells Dawn they will start afresh in Spain, but he takes the money and leaves alone."]}, {"page": "Keith Miller (EastEnders)", "response": ["Keith arrives with his partner, Rosie (Gerry Cowper), their twins, Darren (Charlie G. Hawkins) and Demi (Shana Swash), and the family dog, Genghis, joining Rosie's son, Mickey (Joe Swash) and moving into 27 Albert Square. They are later joined by Demi's newborn baby, Aleesha (Freya Coltman-West), Rosie's daughter, Dawn Swann (Kara Tointon) and Dawn's daughter, Summer Swann. Keith, who does not work and spends his time watching documentaries on television, has his incapacity benefits stopped when Stacey Slater (Lacey Turner) catches him on CCTV, moving heavy boxes and reports him for benefit fraud. However, he remains unemployed and it is revealed that he is illiterate, but, his family encouraged him to learn to read and write. Rosie drops several hints that she wants Keith to propose, but, he eventually leaves her when he discovers that she plans to leave him for her ex-husband, Mike Swann (Mark Wingett) and he moves in with Garry Hobbs (Ricky Groves) and Minty Peterson (Cliff Parisi). He later forgives Rosie, when she begs for another chance and moves back in with her. Mike moves out, but, leaves a message for Dawn on the Millers' answering machine. Keith deletes the message, as he does not want Mike to have anything to do with the family. Mike's mother, Nora Swann (Pamela Cundell), later dies in hospital and they have no way of contacting Mike to let him know. Rosie kicks Keith out and he moves in with Gus (Mohammed George) and Juley Smith (Joseph Kpobie). Keith desperately wants Rosie back and knows that the only thing he can offer her is marriage. He proposes and they get back together, but, Keith tries to delay the wedding, as he is not really interested in getting married. He later realises that nothing will really change after they get married and soon changes his mind."]}, {"page": "Gus Smith", "response": ["In 2004, Gus disposes of a handgun he found in Juley's bag. Juley's involvement in crime, including the theft of some charity money, leads to his departure from Walford in April 2005, though he returns in September for a trip to France with Gus, Mickey, Garry Hobbs (Ricky Groves) and Minty Peterson (Cliff Parisi). While in France, Gus meets Mickey's sister and father Dawn and Mike Swann (Kara Tointon and Mark Wingett). Mike exposes Juley as a con man, despite Juley's claims that he is a reformed character. Gus persuades Juley to return to Walford permanently to turn over a new leaf."]}, {"page": "List of former EastEnders characters", "response": ["|Mike Swann || Mark Wingett || 2005–2006"]}, {"page": "Darren Miller", "response": ["The Miller family move to Walford in 2004. In November 2005, Darren finds thousands of pounds belonging to Jake Moon (Joel Beckett), which Alfie Moon (Shane Richie) has accidentally thrown out in the rubbish. Darren uses the money to buy a mobile phone, and spends it mostly on his girlfriend, Kylie, who eventually splits up with Darren because he is unable to buy alcohol. Darren shares the money with his twin sister Demi, but it is found by their older half sister Dawn's (Kara Tointon) father, Mike Swann (Mark Wingett). Mike steals the money, leaving the Millers with nothing."]}, {"page": "Woodentop (The Bill)", "response": ["\"Woodentop\" has an unusual place in the history of The Bill due to the original premise of this being a one-off play. After broadcast, Thames commissioned a full series to be shown the following year, under the name The Bill as the show had the potential to appeal to a mass audience. Although The Bill is clearly a continuation from this episode, the main series contradicts it in a number of ways. For instance, in Woodentop Litten has completed his secondment to CID and is close to securing his place in the detective branch, whereas in The Bill he does not gain his CID secondment until halfway through Series One. In addition many central characters in \"Woodentop\" - such as Sergeant Wilding and Inspector Deeping - vanish between the pilot and the series.  Deeping does gain one mention in Series One, in the episode \"It's Not Such a Bad Job After All\", where Ackland is informed that he is coming to meet her on the scene of a suicide - a later radio transmission, however, reports that Sgt. Bob Cryer is to meet her instead.  Although Wilding is not mentioned following Woodentop, he shares several characteristics with Sgt. Cryer - including a position as the \"father figure\" of the Sun Hill relief, and an apparently tumultuous relationship with Roy Galloway, whom both Cryer and Wilding refer to as a \"bloody superstar\".  In the first episode of Series One, \"Funny Ol' Business - Cops and Robbers\", Galloway and Cryer make apparent reference to the events of Woodentop in regards to Jim Carver.  Galloway suggests that it is Cryer who requested the favour, further suggesting that Cryer and Wilding are in fact the one character, and that, like PC Taffy Morgan (later Taffy Edwards), Jack Wilding's name has merely been changed to Bob Cryer. There are also discrepancies with the naming of some of the characters. In the 2003 live episode of The Bill, made to celebrate the twentieth anniversary of broadcast, Carver and Ackland discuss events from the pilot, whereupon Carver incorrectly refers to the character of Taffy by the surname Morgan, a name that was dropped for the series proper in favour of \"Edwards\". There are also mistakes made in some of the uniforms the cast wore during the episode, for example, in one scene, PC Dave Litten is on foot patrol with PC Jim Carver, and PC Litten's helmet has GR on the helmet badge where it should have had ER, the same that was on PC Carver's helmet. Also the tunics the male officers wore had buttoned down epaulettes, whereas they should have just had the insignia placed on the shoulder of the tunic as this is what the Metropolitan Police wore at the time.  Only four of the cast of \"Woodentop\" would go on to be regulars in the main series of The Bill: Mark Wingett, Trudie Goodwin, Gary Olsen and Colin Blumenau, while a number of characters were re-cast, including Roy Galloway.Colin Blumenau", "* PC Jim Carver - Mark Wingett"]}, {"page": "List of former Hollyoaks characters", "response": ["| Frank Symes || Mark Wingett || 2013 "]}, {"page": "List of The Professionals episodes", "response": ["| Michael Coles, Ian McCulloch, Nickolas Grace, Walter Randall, Mark Wingett, Bill McGuirk, John Barrard, Paul Herzberg, Clifford Earl"]}, {"page": "Ed Waugh and Trevor Wood", "response": ["Alf Ramsey Knew My Grandfather transferred to Newcastle’s Theatre Royal in May 2010 (directed by Andrew Lynford). The Sir Thomas Lipton Trophy and the play were featured on Sky’s Soccer AM as part of the publicity. The play will also be performed at the 900-seat Darlington Civic Theatre (directed by Mark Wingett) in July 2012 and all profits will go to the aid of Darlington FC 1883.", "In the autumn of 2010, their trilogy of \"horseracing plays\" - featuring the central characters of Bob Fletcher and his put upon wife Shirley - played the Customs House. Good To Firm and Raising The Stakes (both directed by Mark Wingett) were reprised while the trilogy was completed by the world premiere of Photo Finish (directed by Jack Milner)."]}, {"page": "List of The Bill characters", "response": ["The following actors portrayed Sergeants and Detective Sergeants. Both of the series' original lead actors, Trudie Goodwin and Mark Wingett, portrayed Sergeants, with Goodwin appearing in 978 episodes as Sergeant June Ackland, and Wingett appearing in 784 episodes as D.S. Jim Carver. Sally Rogers, Sam Callis, Christopher Fox and Lucy Speed, as Sergeants Masters, Stone, Carter, and Moss, respectively, appeared in the series finale \"Respect\". Eric Richard's role as Sergeant Bob Cryer was widely lauded as the standout performance on The Bill. Sergeant Matthew Boyden, played by Tony O'Callaghan is notable as the murder of his character launched the spin-off series Murder Investigation Team in 2003.", "* Mark Wingett played DC Jim Carver from 1983 to 2007. Carver was the main character in the pilot after joining as a probationary PC. He was promoted to DC in 1989 before returning to uniform in 1999. He returned to CID in 2004 before his departure in the wake of the 2005 station fire, however he returned as a DS for three guest appearances in 2007, appearing in Trudie Goodwin's final episodes as Sergeant June Ackland. Carver's storylines included addictions to alcohol and gambling, a marriage in which he was domestically abused and a second to long-term friend June. ", "| Jim Carver || Mark Wingett || 1983-2007 || style=\"text-align:center;\"|784 || P.C. (1984-1986/1999-2003) /D.C. (1987-1999/2003-2005) (D.S. 2007 episodes 487-489 only)"]}, {"page": "Private Schulz", "response": ["Private Schulz is a 1981 BBC television comedy drama serial set mostly in Germany, during and immediately after World War II. It stars Michael Elphick in the title role and Ian Richardson playing various parts. Other notable actors included Tony Caunter, Billie Whitelaw, Billy Murray and Mark Wingett. It was shown on Masterpiece Theatre in the USA."]}, {"page": "Fatal Consequences (The Bill)", "response": ["* DC Jim Carver - Mark Wingett"]}, {"page": "1961 in the United Kingdom", "response": ["**Mark Wingett, British actor"]}, {"page": "History of The Bill", "response": ["During 1983, Thames Television broadcast a one-off drama called Woodentop. It was written by Geoff McQueen, who had previously worked on LWT's The Gentle Touch. Woodentop followed Police Constable Jim Carver (Mark Wingett) on his first day, mentored by Woman Police Constable June Ackland (Trudie Goodwin). The production was seen as innovative for the use of natural lighting, hand-held cameras and an authentic portrayal of British policing. Woodentop was directed by Peter Cregeen, who had played a part in Z-Cars and Juliet Bravo.Thames Television commissioned 12 further episodes for transmission in 1984, which would relaunch under the title of The Bill.", "Under Marquess, The Bill aired grittier and harrowing plots for officers individually including a crack addiction for PC Nick Klein, a male rape for DC Mickey Webb and a cot death for Sergeant Sheelagh Murphy. A trait Marquess succeeded with during his time on the series was casting actors never seen as villains in their careers such as Todd Carty as PC Gabriel Kent and Lynda Bellingham as crime boss Irene Radford. However, there were issues with repetition such as two station fires, two serial killer cops in the aforementioned Gabriel Kent and PC Cathy Bradford, non-cop serial killer plots in 2002, 2004 and 2005, over half a dozen different characters being abducted (some more than once) and a slew of romances (something rarely seen prior to Marquess' arrival). Arguably, the most controversial storyline was the insinuation that show veteran Sergeant June Ackland had slept with her own son after PC Gabriel Kent falsely claimed he was her long-lost son (actually proving to be her son's adoptive brother). June actress Trudie Goodwin criticised the plot in a 2018 interview on The Bill Podcast, calling it far-fetched to introduce the element of a long-lost child 20 years into her time on the series, while she also cited issues with character exits and the direction the show was going when she resigned from the role of June after over 20 years, stating she had lost her enjoyment of being on the programme. The mass dismissals included established show stars such as Tony O'Callaghan as Sergeant Matt Boyden and Mark Wingett as DC Jim Carver.", "In April 2021, reports emerged that The Bill could make a comeback in the form of a spin-off. Although details were scarce, it was reported by various media sources that screen writer Simon Sansome  is trying to revive the series. A pilot script had allegedly been written under the name, \"Sun Hill\" (due to a license agreement that meant the series could not have the original name), and could feature three cast members from the original series: Trudie Goodwin (Sgt June Ackland), Graham Cole (PC Tony Stamp) and Mark Wingett (DC Jim Carver); an entry at the International Movie Database states the premise would be the trio advising the current Sun Hill Police Station team on how to resolve an influx of murder/suicides in Canley, the fictional district The Bill was set in. Wingett confirmed the news on his Twitter page but said the series had not been greenlit at the time  As of November 2021, no further news has been announced nor has a date been set for any potential premiere."]}, {"page": "War of the Dead", "response": ["War of the Dead is a 2011 action horror film written and directed by Marko Mäkilaakso and starring Andrew Tiernan, Mikko Leppilampi, Jouko Ahola, Samuli Vauramo, Andreas Wilson, Mark Wingett, and Antti Reini.", "* Mark Wingett - Selzman"]}, {"page": "Jonathan Dixon (actor)", "response": ["Dixon runs his own independent film production company, Isaac Who, which is based in Leeds in the North of England. The company creates film, TV and video productions with specialism in actor showreels, corporate videos and live music video recordings. Dixon also produces and directors original films as part of Isaac Who. In 2019 he directed a series of short films in collaboration with Psychotastic Productions. These included; \"Assisted\" featuring Steven Arnold and Steve Huison, and \"The Invisible Collection\" starring Ian Gelder & Mark Wingett."]}, {"page": "The Bill (series 21)", "response": ["Series 21 of British television drama The Bill was broadcast from 5 January until 29 December 2005. The series consisted of 106 episodes, making it the series with the highest number of episodes in the show's final decade, tied with series 19. Joint-longest serving cast member, DC Jim Carver (Mark Wingett), exited the show after 21 years, having been with the show since its first ever episode; he was the sixth character with over ten years on the series to have exited in the previous three years. It followed the events of the third Sun Hill station fire. As was the case in 1990 and 2002, a redevelopment to a large part of the station set was explained by an explosion, racist PCSO Colin Fairfax driving a van into the station reception to shift the blame for a terror attack onto the local Asian community; the fire led to three characters being killed off. The death of Carver’s best friend in the blaze, DC Ken Drummond, came before the revelation that his estranged wife June Ackland had an affair with experienced PC Roger Valentine. Ackland, co-protagonist with Carver in the series pilot Woodentop, was involved in a 30-minute special episode that ended with Carver’s exit. Actor Mark Wingett also featured in spin-off documentary series The Bill: Uncovered, exploring Jim’s time on the show that included addictions to alcohol & gambling and two failed marriages. The final of four Uncovered documentaries saw Superintendent Adam Okaro narrate on some of the best moments from the show's 21-year history, however the episode did not air in the U.K; instead it aired in Australia a year after its originally planned broadcast."]}, {"page": "The Bill (series 15)", "response": ["However, the most notable long-term plot saw DC Jim Carver moved back to uniform as a PC due to the real-life Metropolitan Police's controversial tenure system, which moved officers out of CID after ten years if they weren't considered for promotion or a transfer. Actor Mark Wingett revealed in 2018 during an interview on The Bill Podcast  that he and executive producer Richard Handford wanted highlight the effect it caused on officers who were victims of tenure, and with the tragic death of Wingett's close friend and colleague Kevin Lloyd a year earlier, Wingett and Handford made the decision to make Jim an alcoholic. The plot culminated in Jim being arrested for a murder that occurred while he was blacked out during a binge, providing the catalyst for his recovery; the plot remained relevant to Jim's character right up to his exit in 2005 to highlight the \"one day at a time\" methodology used by recovering alcoholics."]}, {"page": "The Bill", "response": ["The Bill was originally conceived by Geoff McQueen in 1983, then a new television writer, as a one-off drama. McQueen had originally titled the production Old Bill. It was picked up by Michael Chapman for ITV franchise holder Thames Television, who retitled it Woodentop as part of Thames's \"Storyboard\" series of one-off dramas and broadcast on ITV under the title Woodentop on 16 August 1983. Woodentop starred Mark Wingett as PC Jim Carver and Trudie Goodwin as WPC June Ackland of London's Metropolitan Police, both attached to the fictional Sun Hill police station.", "On 17 April 2021, various media outlets began reporting that the series may be set for a reboot. Writer Simon Sansome was understood to have bought the rights to the original series, and was planning a revival, dubbed Sun Hill (as licensing meant the series could not be named The Bill once more), alongside Holby City creator and former EastEnders writer Tony McHale, who had previously written episodes of The Bill and one of its spin-offs, Beech is Back. Sansome had been in talks with various cast members during a 2020 reunion and discussed possible appearances for show legends Mark Wingett (Jim Carver), Trudie Goodwin (June Ackland) and Graham Cole (Tony Stamp). However, no official date had been set for a return, nor had the mooted Sun Hill project been picked up by any TV network. On 18 April, Mark Wingett confirmed this on his Twitter account, stating they had been \"approached\" by production companies but the Sun Hill project had not been given the green light.", "* Mark Wingett played Jim Carver from 1983 to 2005. Jim was one of two protagonists in the pilot Woodentop, when he joined Sun Hill as a probationary PC. A promotion to DC in 1988 saw him in CID until 1999, when he was transferred back to uniform so the series could highlight the real-life Metropolitan Police's controversial tenure system that saw officers moved back to uniform if they hadn't been considered for promotion after ten years in the same role. Addiction to alcohol and a marriage that saw him domestically abused came before his return to DC in 2004, with a gambling addiction and marriage to long-term friend June Ackland coming before his exit in 2005. He came back as a DS in 2007 for June's final three episodes, revealing he moved to Manchester after leaving Sun Hill."]}, {"page": "List of EastEnders characters (2005)", "response": ["Dawn Swann, played by Kara Tointon, is the sister of Mickey Miller (Joe Swash) and daughter of Rosie Miller (Gerry Cowper). Dawn is first seen in France when she reacquaints Mickey with their father, Mike Swann (Mark Wingett). She moves to Walford after Mike's property scam fails, and lives with Rosie and her family. Dawn meets Rob Minter (Stuart Laing) and they begin dating, but Rob ends their relationship when his wife, May (Amanda Drew), wants to give their marriage another chance. Dawn discovers she is pregnant with Rob's child, and plans to have an abortion. However May, who is unable to conceive, has other ideas. Dawn later has a relationship with Garry Hobbs (Ricky Groves).", "Mike Swann is played by Mark Wingett.", "Amy, played by Nina Fry, first appears in late October 2005 as a barmaid in Johnny Allen's (Billy Murray) nightclub, Scarlet. Amy then has an affair with Johnny without his partner Tina Stewart (Charlotte Avery) knowing. When Johnny leaves Albert Square and the new manager, Mike Swann (Mark Wingett) has fled, Amy becomes manager of the club. She last appears in January 2006, when Stacey Slater's (Lacey Turner) drink in the club is laced with illegal drugs by Deano Wicks (Matt Di Angelo), and she and Stacey have a fight.", "Nora Swann, played by Pamela Cundell, appears in five episodes between December 2005 and February 2006. She is introduced as the ill mother of Mike Swann (Mark Wingett)."]}, {"page": "List of EastEnders characters (2002)", "response": ["Julius \"Juley\" Smith, played by Joseph Kpobie, first appears in July 2002 as Gus Smith's (Mohammed George) brother. He proves to be a problem for Gus, as he gets involved in crime, including firearm possession and the theft of charity money, which leads to his departure in April 2005. In September 2005 he returns and visits France with Gus, Minty Peterson (Cliff Parisi), Garry Hobbs (Ricky Groves) and Mickey Miller (Joe Swash). Mickey's father Mike Swann (Mark Wingett) sees straight through him and exposes him as a con-man. He returns to Walford and promises to change."]}, {"page": "List of EastEnders characters (2004)", "response": ["Clint first arrives in his old ice cream van, loaded with all the Millers' possessions. The ice cream van bears the somewhat dubious logo of Clint's Creamy Whip. He comes to Walford to help out his family whenever they need him. He is also seen when Mike Swann (Mark Wingett), Rosie's ex-husband, is staying with the Millers and Keith (David Spinx) needs some support. His last appearance is when he helps Rosie to move back out of the Square."]}, {"page": "List of people from Leicester and Leicestershire", "response": ["*Mark Wingett (actor, The Bill)"]}, {"page": "List of British films of 1979", "response": ["|Quadrophenia|| Franc Roddam||Phil Daniels, Leslie Ash, Philip Davis, Mark Wingett|| Musical ||"]}, {"page": "Beyond the Rave", "response": ["|Mark Wingett || Ed's dad"]}, {"page": "List of longest-serving soap opera actors", "response": ["|Mark Wingett || Jim Carver || The Bill || 1983, 1984–2005, 2007 ||  years || "]}]}}