{"wiki_id": "http://www.wikidata.org/entity/Q2277515", "itemLabel": "Ian Bairnson", "itemDescription": "Scottish musician, guitarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Bairnson", "wikipedia_page": {"main": "Ian Bairnson (born 3 August 1953 as John Bairnson) is a Scottish musician, best known for being one of the core members of The Alan Parsons Project. He is a multi-instrumentalist, who has played saxophone and keyboards, although he is best known as a guitarist. He is also known for preferring the sound of a sixpence to a plectrum.\nBairnson was born in Lerwick, Shetland Isles, Scotland.  He grew up in Levenwick, in Shetland, before his family moved to Edinburgh, Midlothian, when he was nine years old, following the death of his father.\nHe was a session guitarist before joining up in 1973 with former Bay City Rollers musicians David Paton and Billy Lyall in the band Pilot and contributed the harmony guitar parts to their hit single, \"Magic.\" During this time with Pilot, he first collaborated with Alan Parsons, the record producer on their debut self-titled album. It was this relationship that helped incorporate most of the band's members (bassist/lead singer Paton and drummer Stuart Tosh) into the Alan Parsons Project. He played the distinctive guitar solo on the track \"I Wouldn't Want to Be Like You\" from Parsons' I Robot (1977) album.\nAs a guitarist, he has been featured on every Alan Parsons Project album, including the 1984 side project Keats.He has played on Kate Bush's first four albums The Kick Inside (1978) (notably playing the guitar solo on \"Wuthering Heights\"), Lionheart (1978), Never for Ever (1980) and The Dreaming (1982).\nHe has also played with the band Bucks Fizz for whom he co-wrote two of their Top 20 hits, \"If You Can't Stand the Heat\" (1982) and \"Run for Your Life\" (1983).\nIn 2009 he appeared on the album of the German bass player Chris Postl, Parzivals Eye. Chris Postl played in RPWL, a German band.\nBairnson lived in Spain from 2003 till 2013, where he had a recording studio and continued working as a session guitarist. He has toured with a number of different bands, the latest being Junk (Bairnson, Pau Chaffer, Sarah Rope and Ángel Celada). Along his session career he has played on more than a hundred albums in different styles. For example: Yvonne Keeley, Joe Cocker, Jon Anderson, Chris DeBurgh, Mick Fleetwood, Neil Diamond. He played live with Sting, Eric Clapton, Beverley Craven and many more.\nAfter moving back to UK in 2013, Bairnson got together with David Paton and produced an album called A Pilot Project where they paid a homage to Eric Woolfson’s legacy. In November 2016 Paton and Bairnson got together again, touring Japan with a Pilot revival and some Alan Parsons Project songs as well.\nIn 2019, Bairnson added guitar solos to two songs from Alan Parsons' new album, The Secret, specifically the tracks \"Years of Glory\" and \"I Can't Get There from Here\".", "link_mentions": [{"page": "August 3", "response": ["*1953 – Ian Bairnson, Scottish saxophonist and keyboard player"]}, {"page": "The Alan Parsons Project", "response": ["The Alan Parsons Project were a British rock band active between 1975 and 1990, whose core membership consisted of Alan Parsons and Eric Woolfson. They were accompanied by a varying number of session musicians and some relatively consistent session players such as guitarist Ian Bairnson, arranger Andrew Powell, bassist and vocalist David Paton, drummer Stuart Elliott, and vocalists Lenny Zakatek and Chris Rainbow. Parsons was an audio engineer and producer by profession, but also a musician and a composer. A songwriter by profession, Woolfson was also a composer, a pianist, and a singer. Almost all the songs on the Project's albums are credited to \"Woolfson/Parsons\".", "A variety of session musicians worked with the Alan Parsons Project regularly,  contributing to the recognizable style of a song despite the varied singer line-up. With Parsons and Woolfson, the studio band consisted of the group Pilot, with Ian Bairnson (guitar), David Paton (bass) and Stuart Tosh (drums). Pilot's keyboardist Billy Lyall contributed. From Pyramid (1978) onward, Tosh was replaced by Stuart Elliott of Cockney Rebel. Bairnson played on all albums, and Paton stayed almost until the end. Andrew Powell appeared as arranger of orchestra (and often choirs) on all albums except Vulture Culture (1985); he was composing the score of Richard Donner's film Ladyhawke (1985). This score was partly in the APP style, recorded by most of the APP regulars, and produced and engineered by Parsons. Powell composed some material for the first two Project albums. For Vulture Culture and later, Richard Cottle played as a regular contributor on synthesizers and saxophone.", "* Andrew Powell – composition, keyboards, orchestral arrangements (1975–1996)John Miles, Laurence Cottle, Ian Bairnson, Contributed to The Alan Parsons Project ", "* Ian Bairnson – guitars (1975–1990)"]}, {"page": "Tales of Mystery and Imagination (Alan Parsons Project album)", "response": ["*Ian Bairnson – electric guitar , acoustic guitar "]}, {"page": "Chris de Burgh", "response": ["1977's third album, At the End of a Perfect Day, whilst well received and featuring both former Fairport Convention drummer Dave Mattacks and later Fairport drummer Gerry Conway, failed to push de Burgh's career significantly, leading to the release of his fourth album Crusader in 1979. Crusader took a more electric direction, including guitar contributions from Ian Bairnson (formerly of Pilot), bass player David Paton (also of Pilot), and drummer Stuart Elliott (formerly of both Cockney Rebel and of Steve Harley and Cockney Rebel), all of whom were also working, at the time, with Kate Bush. The album also featured Sky keyboard player Francis Monkman and Mike Moran. Whilst it attracted a significant number of new fans, Crusader still failed to break through in the UK and US. 1980's Eastern Wind also failed to build further on the (still cult) following in the major territories."]}, {"page": "List of band name etymologies", "response": ["* Pilot - The name came from the last initials of the founding members of the band, David Paton (lead vocals/bass), Billy Lyall (keyboards), and Stuart Tosh (drums). In an interview with David Paton, he said that the idea came from the producer's girlfriend. While Ian Bairnson was involved with the band's first album, he wasn't an official member of the band until their second album, Second Flight."]}, {"page": "Ammonia Avenue", "response": ["* Ian Bairnson – electric and acoustic guitars"]}, {"page": "The Kick Inside", "response": ["The Kick Inside is the debut studio album by English singer-songwriter and musician Kate Bush. Released on 17 February 1978, it includes her UK number one hit, \"Wuthering Heights\". The album peaked at number three on the UK Albums Chart and has been certified Platinum by the British Phonographic Industry. The production included efforts by several progressive rock veterans, including Duncan Mackay, Ian Bairnson, David Paton, Andrew Powell, and Stuart Elliott of the Alan Parsons Project, and David Gilmour of Pink Floyd.", "In 1976 Bush's contract was finally agreed upon by her family. In preparation for the recording, she embarked on playing with the KT Bush Band around various pubs. According to her brother Paddy, who also played with her on stage, these started out as very small affairs with little interest but grew to larger audiences over the months. Finally, in July and August 1977, the rest of the songs were recorded at AIR Studios in London, helmed by producer Andrew Powell. Bush was keen to keep the line-up of the KT Bush Band for the recordings, but EMI insisted that she use properly experienced session musicians. Powell engaged Ian Bairnson, Duncan Mackay and Stuart Elliott among others, many of whom he had worked with before.", "*Ian Bairnson – electric guitar, acoustic guitar (except on 2), backing vocals (9), beer bottles (12)"]}, {"page": "The Dreaming (album)", "response": ["*Ian Bairnson – acoustic guitar (5)", "*Paddy Bush, Ian Bairnson, Stewart Arnold and Gary Hurst – backing vocals (1)"]}, {"page": "Lionheart (Kate Bush album)", "response": ["*Ian Bairnson – electric guitar (1–4, 6, 10), acoustic guitar (2, 10), rhythm guitar (9)"]}, {"page": "Never for Ever", "response": ["* Ian Bairnson – bass vocals (2)"]}, {"page": "This Woman's Work: Anthology 1978–1990", "response": ["*Ian Bairnson: \tGuitar, Background Vocals"]}, {"page": "I Robot (album)", "response": ["*Ian Bairnson – electric and acoustic guitars, backing vocals"]}, {"page": "Eye in the Sky (album)", "response": ["*Ian Bairnson - acoustic & electric guitars"]}, {"page": "Bray, Berkshire", "response": ["* Ian Bairnson - Scottish musician "]}, {"page": "Pyramid (The Alan Parsons Project album)", "response": ["*Ian Bairnson – electric and acoustic guitars"]}, {"page": "Eve (Alan Parsons Project album)", "response": ["* Ian Bairnson – electric and acoustic guitars"]}, {"page": "The Turn of a Friendly Card", "response": ["*Ian Bairnson – electric, acoustic and classical guitars; pedal steel guitar on \"Time\""]}, {"page": "Stereotomy", "response": ["*Ian Bairnson – guitars, guitar synth"]}, {"page": "Vulture Culture", "response": ["*Ian Bairnson – guitar"]}, {"page": "Gaudi (The Alan Parsons Project album)", "response": ["*Ian Bairnson – guitars"]}, {"page": "George Heriot's School", "response": ["* Ian Bairnson (b. 1953) - musician, member of Pilot and The Alan Parsons Project"]}, {"page": "Try Anything Once", "response": ["* Ian Bairnson – synthesizer, bass, guitar, pedal steel guitar, background vocals"]}, {"page": "On Air (Alan Parsons album)", "response": ["On Air is the second solo studio album by English rock musician Alan Parsons. The album's chief creative force was the Alan Parsons Project's long-time guitarist, Ian Bairnson. Its concept revolves around the history of airborne exploration.", "The song \"Brother Up In Heaven\" remembers Ian Bairnson's cousin Erik Mounsey who was killed in a friendly fire incident above Iraq in 1994.", "* Ian Bairnson – guitars, bass guitar, synthesizer", "* On Air at the official Ian Bairnson website"]}, {"page": "The Time Machine (Alan Parsons album)", "response": ["* Ian Bairnson – keyboards, guitars, mandolin, saxophone, composer"]}, {"page": "List of guitarists", "response": ["*Ian Bairnson (Pilot, The Alan Parsons Project, Kate Bush)"]}, {"page": "Pilot (band)", "response": ["Both Paton and Lyall had briefly been substitute members of the Bay City Rollers before that band's breakthrough. Joined by drummer Stuart Tosh, the band recorded several demos during 1972 and 1974 at Craighall Studios, Edinburgh, where Billy Lyall was the resident engineer. They were signed to a management contract with Nick Heath and Tim Heath, sons of British bandleader Ted Heath, and John Cavanagh. In due course they signed to a worldwide recording deal with EMI Records. After the recording of their debut album, From the Album of the Same Name, guitarist Ian Bairnson (who had played on the album as a session musician) joined the band permanently.", "* Ian Bairnson – guitar (1974–1977, 2002, 2007–2016)"]}, {"page": "Wuthering Heights (song)", "response": ["Bush recorded her vocal in a single take. The guitar solo is played by Ian Bairnson, who said that he initially disliked the tone for many years due to \"purely guitarist reasons\". Engineer Jon Kelly said he regretted not placing the solo louder in the mix. The production team, with Bush, began mixing at midnight and stayed until \"five or six in the morning\".", "* Ian Bairnson – electric guitar, guitar solo"]}, {"page": "Tim Renwick", "response": ["Renwick made a live appearance with the Alan Parsons Band in the 1998 Michael Jackson Gala (replacing the original guitarist Ian Bairnson). He recorded with Pink Floyd colleague Rick Wright, playing guitar on his 1996 album Broken China. In 2005 he appeared once more with Pink Floyd as second guitarist (and bassist on \"Wish You Were Here\") for their Live 8 reunion."]}, {"page": "Sixpence (British coin)", "response": ["Some guitarists prefer the rigidity of a coin to the flexibility of a more traditional plastic plectrum; among them are Brian May of Queen and Ian Bairnson of The Alan Parsons Project. May at some time even had sixpence-sized coins featuring his own head struck by the Royal Mint, which he used, gave away, and sold as his signature plectrum."]}, {"page": "Bucks Fizz (album)", "response": ["*Ian Bairnson - guitar, bass"]}, {"page": "Are You Ready (Bucks Fizz album)", "response": ["* Ian Bairnson – Electric Guitars"]}, {"page": "Hand Cut", "response": ["* Ian Bairnson - Guitars"]}, {"page": "I Hear Talk", "response": ["*Ian Bairnson - Guitar"]}, {"page": "Writing on the Wall (Bucks Fizz album)", "response": ["* Ian Bairnson - Guitar"]}, {"page": "List of Scottish musicians", "response": ["*Ian Bairnson, guitarist of Pilot and The Alan Parsons Project"]}, {"page": "Ian", "response": ["*Ian Bairnson, guitarist of The Alan Parsons Project and Pilot"]}, {"page": "David Paton", "response": ["Born Edinburgh, Scotland, Paton grew up in the south-eastern suburb of Gilmerton, Edinburgh, where he attended Liberton High School. His first band was called 'The Beachcombers' and they signed a recording contract in 1968 with CBS Records. They changed their name for The Boots and published their first single, \"The Animal In Me\". This was soon followed by \"Keep Your Lovelight Burning\", but after about two years, the band split because of Financial problems in 1970. He then replaced a guitarist in the Bay City Rollers for a short period of time but never recorded with them. After leaving them in October 1970, he became a member of another Band called 'Fresh', which changed their name for Christyan and published a single, \"Nursery Lane\", in 1971. While still playing with the band, he took a job as a musician in a nightclub called Tiffanys where he met Ian Bairnson.", "In 1973, Paton was a co-founder of Pilot. With Ian Bairnson, Billy Lyall and Stuart Tosh, they recorded several demos with EMI Records and recorded their first album From the Album of the Same Name which was published in 1974. On it was included their first major hit, \"Magic\"  and Bairnson, who was still not an official member of the band, joined them after the recording of the first album. They released their second album Second Flight in 1975, and its single \"January\" topped the UK Singles Chart for three weeks, ironically beginning week ending 1 February. and it was followed in 1976 by their third, Morin Heights which was recorded at Le Studio in Morin Heights in Quebec, Canada, and produced by Roy Thomas Baker. ", "* 1984: Keats - reissued in 2015: with Peter Bardens, Colin Blunstone, Ian Bairnson, Stuart Elliott; produced by Alan Parsons", "* 1976: Solo Casting - William Lyall - Also starring Phil Collins, Stuart Tosh, Ian Bairnson, Ronnie Leahy, etc.", "* 1979: Crusader - Chris de Burgh - Also starring Stuart Elliott, Francis Monkman, Andrew Powell, Ian Bairnson. "]}]}}