{"wiki_id": "http://www.wikidata.org/entity/Q2283199", "itemLabel": "Alan Davies", "itemDescription": "English comedian, actor, and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Davies", "wikipedia_page": {"main": "Alan Roger Davies (; born 6 March 1966) is an English stand-up comedian, writer, actor and TV presenter. He is best known for his portrayal of the title role in the BBC mystery drama series Jonathan Creek (1997–2016) and as the only permanent panellist on the BBC panel show QI since its premiere in 2003, outlasting its original host Stephen Fry.\n\n", "link_mentions": [{"page": "List of comedians", "response": ["* Alan Davies (born 1966)"]}, {"page": "March 6", "response": ["*1966 – Alan Davies, English comedian, actor and screenwriter"]}, {"page": "Stephen Fry", "response": ["In 2003, Fry began hosting QI (Quite Interesting), a comedy panel game television quiz show. QI was created and co-produced by John Lloyd, and features permanent panellist Alan Davies. QI has the highest viewing figures for any show on BBC Four and Dave (formerly UKTV G2).QI.com Audience figures. Retrieved 21 June 2007.  In 2006, Fry won the Rose d'Or award for \"Best Game Show Host\" for his work on the series. In October 2015, it was announced that Fry would retire as the host of QI after the \"M\" series, and he was replaced by Sandi Toksvig."]}, {"page": "List of British comedians", "response": ["*Alan Davies, QI"]}, {"page": "Canonbury", "response": ["* Alan Davies, actor/comedian"]}, {"page": "Chingford", "response": ["* Alan Davies, stand-up comedian and regular guest on the quiz show QI, grew up in Chingford."]}, {"page": "Bill Bailey", "response": ["Bailey has appeared frequently on the intellectual panel game QI since it began in 2003, alongside host Stephen Fry and regular panellist Alan Davies; he was also the winner of the show's unaired pilot episode. Other television appearances include a cameo role in Alan Davies' drama series Jonathan Creek as failing street magician Kenny Starkiss and obsessed guitar teacher in the \"Holiday\" episode of Sean Lock's Fifteen Storeys High. He later appeared with Lock again as a guest on his show TV Heaven, Telly Hell. He has also appeared twice on Friday Night with Jonathan Ross. Bailey also hosted his own show Comic's Choice, which aired in 2011."]}, {"page": "Julia Sawalha", "response": ["She joined actor Ioan Gruffudd in the TV adaptations of C. S. Forester's Horatio Hornblower novels, as the captain's wife Maria. The following year, she became Alan Davies's co-star in Jonathan Creek after Caroline Quentin left, appearing in a Christmas Special (\"Satan's Chimney\"). She returned for a series between 2003 and 2004.", "On 1 January 2004, tabloid newspapers reported that she had married Alan Davies, her co-star in the television series Jonathan Creek. Both she and Davies, who avoided discussing their private lives in public, denied this, and took legal action against the reports."]}, {"page": "John Lloyd (producer)", "response": ["His first new TV series for 14 years, QI starring Stephen Fry (Sandi Toksvig from 2016) and Alan Davies, began on 11 September 2003 at 10pm on BBC Two for a run of 12 episodes. In its eighth series, which started on BBC One in September 2010, Lloyd appeared as a panellist in one of the episodes. Lloyd has presented the radio series The Museum of Curiosity (2011), which he co-created with producers Richard Turner and Dan Schreiber and former co-host Bill Bailey. In December 2011, Lloyd appeared as captain of the winning Trinity College, Cambridge, team on the Christmas University Challenge."]}, {"page": "Christmas cracker", "response": ["On 17 August 2020, while filming a Christmas episode of the television series QI, British comedian Alan Davies set a Guinness World Record for the most crackers pulled by an individual in 30 seconds. He achieved 35 successful cracks, outscoring fellow panelist Justin Moorhouse by five in a head-to-head competition."]}, {"page": "100 Greatest Britons", "response": ["| Alan Davies, comedian and actor."]}, {"page": "John Sessions", "response": ["In between appearing in regular film and TV roles, Sessions made appearances on Have I Got News for You and, more recently, as a semi-regular panellist on QI. He was one of four panellists, including the permanent Alan Davies, on the inaugural episode of QI, in which he demonstrated his effortless memory of the birth and death dates of various historical figures (while simultaneously and apologetically deeming the knowledge of such facts \"a sickness\").", "| 2011 || Little Crackers || Dr. Edward Cole || Episode: \"Alan Davies' Little Cracker: The Curious Incident Of The Dog In The Daytime\""]}, {"page": "The Big Impression", "response": ["*Alan Davies (As Jonathan from Jonathan Creek)"]}, {"page": "Jonathan Creek", "response": ["Jonathan Creek is a long-running British mystery crime drama series produced by the BBC and written by David Renwick. It stars Alan Davies as the title character, who works as a creative consultant to a stage magician while also solving seemingly supernatural mysteries through his talent for logical deduction and his understanding of illusions.", "In 2014, conflicting reports surfaced regarding Alan Davies's view of the show. In one article published online he was said to be 'happy to do Jonathan Creek for another ten years' and praised David Renwick's talent as a writer.", "Others who were tried for the part included Nigel Planer (who would later guest star) and Angus Deayton (who had already worked with Renwick and director Susan Belbin on One Foot in the Grave). Almost a dozen actors were considered before Susan Belbin saw Alan Davies during a rehearsal for a sitcom. Davies was invited round to talk to Renwick and \"turned up in his duffle coat with straggly hair and a broad grin [and] was self-evidently the closest match yet to Creek as we had always seen him\".", "| Alan Davies", "As the series progresses, Creek gradually changes from an asocial anorak (nerd) to a man with a great deal of wit and charm. This helps to fuel the romantic thread between him and Maddy. Jonathan's trademark duffle coat worn in the first series was actually Alan Davies' own coat that he wore to the auditions; it helped him win the role, as the writer and producers thought it suited the character. After the first series, Jonathan's coat was supplied by the wardrobe department. Davies kept the original at his home, and wore it again for the 2009 New Year special.", "|Alan Davies", "There were two attempts to make a U.S. version of Jonathan Creek. The first involved Castle Rock, the production company behind series such as Seinfeld, but the initial scripts were not felt to be good enough, and David Renwick's scripts were rejected by CBS. The second attempt, also by Renwick, was for Whoopi Goldberg and would have included Alan Davies."]}, {"page": "Loughton", "response": ["The character actor Jack Watling (1923–2001) lived for many years in Alderton Hall, Loughton. His son, Giles (born 1953), also an actor, was born there. Actor and playwright Ken Campbell (1941–2008), nicknamed 'The Elf of Epping Forest', lived in Baldwins Hill, Loughton, where a blue plaque to him was erected in 2013. Comedy-drama actor Alan Davies (born 1966) grew up in Loughton, and attended Staples Road school. Actress Jane Carr (born 1950), best known for her role as \"Louise Mercer\" in the American version of the sitcom Dear John from 1988 to 1992, was born in Loughton.", "* Alan Davies (born 1966), Comedian, Actor and Broadcaster"]}, {"page": "Ventnor", "response": ["Between 2005 and 2008, Ventnor hosted the Isle of Wight International Jazz Festival, with headline acts including Maceo Parker, Humphrey Lyttelton and Cleo Laine.  Between 2011 and 2016, Isle of Arts was an annual festival held in the town, with acts including Rich Hall, Sandi Toksvig, Alan Davies and Phill Jupitus.  Isle of Arts ended after 2016, because of the costs of the event. However the range of the Ventnor Fringe has since been expanded, and now runs concurrently with the Ventnor International Festival, with acts visiting from around the world."]}, {"page": "David Baddiel", "response": ["Baddiel has appeared in shows including Little Britain, Skins, The Life of Rock with Brian Pern and Horrible Histories and is a regular guest on panel shows including 8 Out of 10 Cats Does Countdown, QI and Alan Davies’ As Yet Untitled. In 2016, he fronted a four-part travel documentary for Discovery entitled David Baddiel On the Silk Road, a 4,000-mile journey to explore the most famous trade route in history, as well as presenting two episodes of BBC2's Artsnight and becoming a regular presenter of The Penguin Podcast in which he interviews authors about the objects that inspired their books, which has seen him interview guests including Johnny Marr, Zadie Smith and Ruby Wax. Other documentaries he has fronted include Baddiel and the Missing Nazi Billions (BBC2), Who Do You Want Your Child to Be? (BBC2), World's Most Dangerous Roads (BBC2), and an episode of Who Do You Think You Are? (BBC1). He appeared on Desert Island Discs in 2018."]}, {"page": "QI", "response": ["QI (short for Quite Interesting) is a British comedy panel game quiz show for television created and co-produced by John Lloyd. The series currently airs on BBC Two and is presented by Sandi Toksvig. It features permanent panellist Alan Davies and three guest panellists per episode who are mostly comedians. The series was presented by Stephen Fry from its beginning in 2003 until 2016.", "The panel consists of four participants: three rotating guests and one regular, Alan Davies, who has the seat to the immediate right of the host.After eighteen years and 257 episodes, Davies was finally placed to the immediate left in the R series episode \"Reflections\". He also sat to the left of Stephen in the G series episode \"Green\" because it was decided they should save energy by powering down one of the screens and have all panelists to the left. Davies has appeared in every episode, although in \"Divination\" he was not able to appear at the studio but was still able to play \"from beyond\".Alan Davies was absent for the recording of this episode, as he did not want to miss his favourite football team, Arsenal, playing in the Champions League final that same evening. He did however make an appearance through pre-recorded material, which ended with him being 'teleported' to the match as he tested his buzzer. Despite frequent wins, Davies often finishes last due to incurring forfeits.", "In October 2015, it was announced that Fry would be stepping down as host after Series M and would be replaced by Sandi Toksvig. Fry described his position on QI as \"one of the best jobs on television\", but that \"it was time to move on\". According to Alan Davies, Fry quit because the BBC cut the budget, so that three shows had to be recorded on the same day. \"For budget reasons, they ended up making him do three shows in 24 hours\", Davies said. Toksvig said that \"QI is my favourite television programme both to watch and to be on\". Lloyd said that Toksvig will be \"the first female host of a mainstream comedy panel show on British television\", and that although she is very different from Fry, she \"will bring to the show the same kind of wonderful thing that Stephen does, the mixture of real brains and a hinterland of knowledge, plus this naughty sense of humour.\" He also said it will give the show a chance to \"do things in a slightly different way\".", "The makers of the show insist that the answers are not given to the panellists beforehand.QI.com  QI: The BBC Television Series. Retrieved 27 July 2007. The host is given a list of questions about an hour before the show, for preparatory purposes, but the guests are forbidden to ask for preparatory materials or other help. Alan Davies never does any preparation.", "The BBC has received criticism regarding the lack of women on their comedy panel shows. As a result, the corporation decided to ban all-male panels on comedy shows in February 2014, with BBC's director of TV Danny Cohen stating in an interview with The Observer that \"shows without women are unacceptable\". In November 2014, Mirror reported stats revealing that 38% of all QI episodes at that time had featured only men, 55.9% featured only one woman, and only the remaining 6.1% had two or three women, out of a total of three guest panellists per episode (the fourth one being regular panellist Alan Davies). Clem Bastow of The Sydney Morning Herald was supportive of BBC's decision, saying that \"left to their own devices, the producers of these shows are clearly failing massively when it comes to putting together line-ups that aren't just endless parades of the same old white men,\" and noted that this could motivate the producers to uncover some new talent. In 2017, creator of QI John Lloyd commented on BBC's decision, telling the Cheltenham Literature Festival that \"arguing a BBC quota for women panellists risked being mere tokenism\", while his wife Sarah Wallace—director of QI Limited—stated that female comedians are hesitant to appear on the show.", "In September 2018, while responding to a question on equal pay at the Women's Equality Party's conference, Toksvig revealed that she receives 40% of what Stephen Fry was being paid as the host of QI, and the same amount as panellist Alan Davies. Talent fees for QI are managed by Talkback.", "QI has been supported by nearly all critics. Peter Chapman said, \"When the schedules seem so dumbed-down, it's a delight to encounter the brainy and articulate Stephen Fry. He excels in this format, being both scathing and generous.\" Another critic, Laura Barton said, \"QI and its canny coupling of Stephen Fry and Alan Davies, which manages to condense tweedy goodness, cockney charm, pub trivia and class war into one half-hour.\"", "QIs second book, The Book of Animal Ignorance, was released in the UK (in the same hardback format) by Faber & Faber on 4 October 2007. () It promised to be a \"bestiary for the 21st century,\"Lloyd, John & Mitchinson, John The Book of Animal Ignorance (Faber&Faber, 2007), back cover and contains almost completely new quite interesting facts.Animal Ignorance at the QI Shop  Retrieved 5 February 2008. The book includes \"400 diagrams and cartoons by the brilliant Ted Dewan\", another Foreword by Stephen Fry and a \"Forepaw\" by Alan Davies. This publication has also been followed by a pocket-sized version."]}, {"page": "Whitstable", "response": ["* Alan Davies, comedian"]}, {"page": "Caroline Quentin", "response": ["Between 1992 and 1998, Quentin appeared as Dorothy in all 42 episodes of the sitcom Men Behaving Badly. From 1997 until 2000, Quentin starred alongside Alan Davies in Jonathan Creek playing investigative journalist Maddie Magellan, who uses Jonathan's mind to solve murder mysteries. In 1998 she starred in the first sitcom that was specifically built around her: Kiss Me Kate; that year she started the major role of Maggie Mee in the drama Life Begins, which returned for a third series in 2006. Quentin appeared in the television film Hot Money (2001), which was based on the true story of the theft of hundreds of thousands of pounds from the Bank of England."]}, {"page": "Edinburgh Festival Fringe", "response": ["In 2005, a production of Neil Simon's The Odd Couple starring Bill Bailey and Alan Davies also directed by Guy Masterson was staged at the Assembly Hall, the meeting place on the Mound of the Church of Scotland. This had been taken over by Assembly Theatre and transformed into an 840-seat theatre."]}, {"page": "Russell T Davies", "response": ["After successfully pitching the show to ITV, Red Productions joined Davies in casting the show and initially approached Jonathan Creek star Alan Davies to portray Bob. Although he was not gay, Davies accepted the role and spent several weeks researching first-hand Manchester's gay scene with series director Joe Wright. His only objection to the role was Bob being a fan of Manchester United F.C., the team Shindler had named Red Productions for, because of his prolific support of Arsenal F.C. The part of Rose was given to Lesley Sharp, her first leading role after her portrayal of secondary characters in past Red shows Playing the Field and Clocking Off, and Jessica Stevenson was cast as Holly by ITV Head of Drama Nick Elliott on the basis of her performance in the Channel 4 comedy Spaced.", "The production team was also tasked with finding a suitable actor for the role of the Doctor. Most notably, they approached film actor Hugh Grant and comedian Rowan Atkinson for the role. By the time Young suggested The Second Coming and Our Friends in the North actor Christopher Eccleston to Davies, Eccleston was one of three left in the running for the role: the other candidates are rumoured to have been Alan Davies and Bill Nighy. Eccleston created his own characteristics of his rendition of the Doctor based on Davies' life, most notably, his catchphrase \"Fantastic!\":"]}, {"page": "List of Have I Got News for You episodes", "response": ["|Alan Davies", "|Alan Davies", "|Alan Davies and Rupert Allason MP", "|Alan Davies", "|Alan Davies"]}, {"page": "Christopher Eccleston", "response": ["On 11 June 2005, during a BBC radio interview, when asked if he had enjoyed working on Doctor Who, Eccleston responded by saying, \"Mixed, but that's a long story.\"  Eccleston's reasons for leaving the role continue to be debated in Britain's newspapers: on 4 October 2005 Alan Davies told The Daily Telegraph that Eccleston had been \"overworked\" by the BBC, and had left the role because he was \"exhausted\". Eccleston would later go on to say that he left the show because he \"didn't enjoy the environment and the culture that the cast and crew had to work in\", but that he was proud of having played the role. Eccleston said in a subsequent interview, \"My relationship with my three immediate superiors – the showrunner, the producer and co-producer – broke down irreparably during the first block of filming and it never recovered.\""]}, {"page": "Tony Martin (comedian)", "response": ["After a successful guest appearance on Sunday Arts (ABC-TV) in 2009 in which he interviewed US writer & lecturer Robert McKee, Martin commenced working on a new program called A Quiet Word With ... which began airing on ABC1 on 28 September 2010.Tony Martin hosts new ABC show A Quiet Chat With... – The Sydney Morning Herald, 24 September 2010 Rather than being a conventional celebrity-interview show, the program featured Martin having relaxed and informal conversations with comedians and performers that he admired, and in some cases, had worked with during his own career.  The first two episodes, featuring English comedian Bill Bailey and US actor and writer Carrie Fisher, were aired, respectively, in September and November 2010. The remaining ten episodes were screened weekly on ABC1 from 2 April 2011, beginning with British actor and comedian Alan Davies, and concluding on 4 June 2011 with British actor and writer Richard E Grant."]}, {"page": "The Odd Couple (play)", "response": ["In August 2005, British comedians Bill Bailey and Alan Davies played Oscar and Felix at the Edinburgh Fringe Festival directed by Guy Masterson which was the hit of the festival."]}, {"page": "Ready Steady Cook", "response": ["Celebrity appearances include: David Tennant, Wendy Richard, Kate Winslet, Honor Blackman, James May, Richard Hammond, Paul O'Grady as alter-ego Lily Savage, Cliff Richard, Twiggy, Rakie Ayola, Fiona Bruce, Gail Porter, Midge Ure, Edd China, Amanda Redman, Ade Edmondson and Alan Davies."]}, {"page": "X-Treme Sanctions Executive", "response": ["During the final issues of X-Treme X-Men, Storm successfully campaigns the United Nations for a team that would be backed by the United Nations that would have legal authority to enforce peace between mutants and humans.X-Treme X-Men (Vol. 1) #31-36 and #46 The X-Treme Sanctions Executive, also known by the abbreviation XSE, debuts in Uncanny X-Men #445, following the return of writer Chris Claremont. Artists Alan Davies and Chris Bachalo illustrate several of the team's adventures."]}, {"page": "David Renwick", "response": ["In 1997, Renwick devised the comedy-drama and mystery series, Jonathan Creek, based around the crime-solving abilities of the eponymous designer of magic tricks, played by comedian Alan Davies. This series also became successful."]}, {"page": "Richard Beckinsale", "response": ["In 2007, Alan Davies nominated Beckinsale as his chosen subject for the BBC Radio 4 series Great Lives.  Judy Loe and Stephen Frears participated in the discussion of Beckinsale's life and career."]}, {"page": "Animal Aid", "response": ["Animal Aid's current patrons are Peter Egan, Sara Pascoe, Carol Royle, Peter Tatchell and Wendy Turner Webster.  It has other celebrity supporters, including Thom Yorke, Stella McCartney, Richard Wilson, Massive Attack, Alexei Sayle, Benjamin Zephaniah, Martin Shaw, Chrissie Hynde, Alan Davies and the Reverend Professor Andrew Linzey. Patrons and supporters now deceased have included Watership Down author Richard Adams, Tony Benn and comedian Spike Milligan. "]}, {"page": "Bob & Rose", "response": ["Bob was played by stand-up comedian and actor Alan Davies (no relation to writer Russell), who was at the time best known for his lead role in the BBC television mystery series Jonathan Creek. Rose was played by actress Lesley Sharp, who was nominated for the BAFTA and Royal Television Society Best Actress awards for the part. Although critically well-received, Bob & Rose was not a huge success in terms of audience share for ITV, and the final two episodes were relegated from prime-time to later night slots.", "* Alan Davies as Robert Gossage"]}, {"page": "Sean Lock", "response": ["Those who paid tribute included fellow 8 Out of 10 Cats performers Jimmy Carr, Jon Richardson, Rachel Riley, and Susie Dent; many comedians, including Omid Djalili, Ricky Gervais, Lee Mack, Eddie Izzard, Alan Davies, David Mitchell, Rob Brydon, Dara Ó Briain, Vic Reeves, Jo Brand, Jonathan Ross, Stewart Lee and Stephen Fry; Chelsea F.C.; QI; and Channel 4. Harry Hill wrote a piece in The Guardian, describing him as \"the comedian's comedian\". On 19 August 2021, Channel 4 aired a tribute to Lock, showing his stand-up show Keep It Light along with an episode of 8 Out of 10 Cats Does Countdown. Chelsea Football Club paid tribute to Lock on 11 September during their fixture against Aston Villa with a one-minute applause during the 58th (the age at which he died) minute of the match."]}, {"page": "The Big Fat Quiz of the Year", "response": ["|Phill Jupitus || Alan Davies "]}, {"page": "Malcolm Hardee", "response": ["Hardee was also renowned as a talent spotter and owner of clubs which gave vital early exposure to up-and-coming comedians including Charlie Chuck, Alan Davies, Harry Enfield, Harry Hill, Paul Merton, Vic Reeves, Frank Skinner, Johnny Vegas and Jo Brand, with whom he had a two-year affair and whom he persuaded to become a comedian. He hosted the first-ever outing of the new circus group Ra-Ra Zoo, who performed comedy mime to a, for once, silenced audience. He also worked for a time as the manager of Jerry Sadowitz and was an occasional promoter and tour manager for his friend and neighbour Jools Holland."]}, {"page": "Culture of the Isle of Wight", "response": ["Today the island maintains this image, while also being seen nationally as a destination for the 'sea and sandcastles' style of family holiday. In an episode of the TV panel game QI, Alan Davies described the Isle of Wight as still stuck in the 1950s."]}, {"page": "Duffel coat", "response": ["In the BBC series, Jonathan Creek, part of the titular character's signature look includes a duffle coat, which was from actor Alan Davies' own closet."]}, {"page": "Tommy Trinder", "response": ["A biography by Patrick Newley, You Lucky People! – The Tommy Trinder Story, was published by Third Age Press in 2008. Trinder was placed 83rd in Channel 4's The 100 Greatest Stand-Ups in 2007. In 2010, comedian Ross Noble campaigned for people to vote for Trinder in an online poll for an updated version of the list, saying \"Tommy Trinder was a top act and it would be funny to have an act from the 50s top the list. Last time I was ahead of Lenny Bruce so it's bollocks anyway\". The campaign received support from fellow comics Tim Minchin, Alan Davies, Jason Manford and Viz co-founder Simon Donald. Trinder ultimately placed 44th in the 2010 list. In August 2009, BFI Southbank celebrated Trinder's centenary with a season of his film work."]}, {"page": "Sophie Thompson", "response": ["Thompson starred alongside popular British comedians Alan Davies, in Jonathan Creek, and Lee Evans in So What Now? She has also appeared in Persuasion, Midsomer Murders, The Case-Book of Sherlock Holmes , A Harlot's Progress, and the TV movie Magnolia. She played Miss Bartlett in Andrew Davies' 2007 adaptation of E.M. Forster's A Room with a View and also appeared in the last episode of series 4 of Doc Martin."]}, {"page": "Towards Zero", "response": ["In 2007, the novel was adapted as part of the third season of the Agatha Christie's Marple  television series produced by ITV. Geraldine McEwan plays Miss Marple. The novel did not include Miss Marple; other characters are changed as well for this adaptation to fit the series approach. Superintendent Battle is replaced by Superintendent Mallard played by Alan Davies."]}, {"page": "List of talk show hosts", "response": ["| Alan Davies ||  United Kingdom || Alan Davies Après-Ski, Alan Davies: As Yet Untitled"]}, {"page": "Tonight at the London Palladium", "response": ["| 1 || 14 September 2014 || Stephen Mulhern || Bryan Adams, Little Mix, Alfie Boe, Alan Davies, Les Beaux Freres and David and Dania"]}, {"page": "List of Edinburgh Comedy Award winners", "response": ["|Alan Davies Jeff Green Harry Hill's Pub Internationale with Al Murray Owen O'Neill – It's a bit like this... Robert Schimmel"]}, {"page": "Fay Ripley", "response": ["The same year, she filmed the role of Karen Hughes, the sister of a mute character who believes she sees a murder, in the low-budget film Mute Witness (1995), directed by Anthony Waller. After Mute Witnesss British television premiere in 1999, a Daily Record critic wrote that Ripley's dramatic scenes were not as good as her comic ones.Staff (22 May 1999). \"Wink 'n' nod thriller\". Daily Record (Scottish Daily Record & Sunday Mail): pp. 30–31. In 1995, she appeared in an episode of Channel 4's Alan Davies vehicle One for the Road and made her last theatre appearance as a cast member in the Bush Theatre's Two Lips, Indifferent Red.Staff (10 September 1995). [Theatre listings]. The Observer (Guardian Newspapers): p. 154."]}, {"page": "Lesley Sharp", "response": ["Although Sharp has appeared in a variety of films throughout her career, she is probably best known by television audiences. By the late 1990s, she was being offered lead roles in numerous well-written drama series. Common As Muck (1997) was followed by Playing the Field (1998–2002), a drama about a female football team which ran for five series. Sharp had supporting parts in Great Expectations (1999), as Mrs Joe, and in Nature Boy (2000), as Martha Tyler, before landing the role of Trudy Graham in Paul Abbott's BAFTA-award-winning Clocking Off (2000–2003), which lasted four series. Russell T. Davies then cast her opposite Alan Davies in Bob & Rose, which resulted in a BAFTA nomination for Sharp. Further film roles in From Hell, starring Johnny Depp, and Cheeky (1993), which was directed by Naked co-star David Thewlis, preceded another television drama written by Russell T. Davies. In The Second Coming (2003) She was \"the woman who killed God\" in the form of Stephen Baxter, as played by Christopher Eccleston."]}, {"page": "Bromley F.C.", "response": ["Lifelong fan Dave Roberts has written several books on his experiences following Bromley FC: The Bromley Boys (2008), 32 Programmes (2011)  and Home and Away (2016). The Bromley Boys has also been made into a film available on DVD and via streaming, starring Martine McCutcheon, Alan Davies and Jamie Foreman."]}]}}