{"wiki_id": "http://www.wikidata.org/entity/Q228888", "itemLabel": "Jacqueline du Pré", "itemDescription": "British cellist", "wikipedia_url": "https://en.wikipedia.org/wiki/Jacqueline_du_Pr%C3%A9", "wikipedia_page": {"main": "Jacqueline Mary du Pré  (26 January 1945 – 19 October 1987) was a British cellist. At a young age, she achieved enduring mainstream popularity. Despite her short career, she is regarded as one of the greatest cellists of all time.\nHer career was cut short by multiple sclerosis, which forced her to stop performing at the age of 28; she died 14 years later at the age of 42. \nShe was the subject of the 1998 biographical film Hilary and Jackie, which attracted criticism for perceived inaccuracy and sensationalism.", "link_mentions": [{"page": "January 26", "response": ["*1945 – Jacqueline du Pré, English cellist (d. 1987)"]}, {"page": "October 19", "response": ["*1987 – Jacqueline du Pré, English cellist and educator (b. 1945)"]}, {"page": "1945", "response": ["** Jacqueline du Pré, English cellist (d. 1987)"]}, {"page": "1987", "response": ["** Jacqueline du Pré, British cellist (b. 1945)"]}, {"page": "Max von Sydow", "response": ["In 1971, von Sydow starred in The Touch, Bergman's first English-language film, playing a doctor whose wife is having an affair. In 1973, von Sydow appeared in one of his most commercially successful films, William Friedkin's The Exorcist (1973). He played Father Lankester Merrin, the film's titular Jesuit priest, which earned him his second Golden Globe nomination. He reprised the role in the film's sequel, Exorcist II: The Heretic (1977). In 1977, von Sydow made his Broadway debut alongside Eileen Atkins and Bibi Andersson in Per Olov Enquist's The Night of the Tribades, a play about the writer August Strindberg. In 1981, he starred with Anne Bancroft in the Tom Kempinski play Duet for One about the cellist Jacqueline du Pré. Von Sydow made his British stage debut at The Old Vic in 1988 as Prospero in The Tempest, a role he first played in Sweden three decades ago."]}, {"page": "Yo-Yo Ma", "response": ["Another of Ma's cellos, the Davidov Stradivarius, was previously owned by Jacqueline du Pré, who bequeathed it to him. Du Pré voiced her frustration with the cello's \"unpredictability\", but Ma attributed du Pré's sentiment to her impassioned style of playing, adding that the Stradivarius cello must be \"coaxed\" by the player.: \"Jackie's unbridled dark qualities went against the Davydov. You have to coax the instrument. The more you attack it, the less it returns.\" It was until recently set up in a Baroque manner, since Ma exclusively played Baroque music on it."]}, {"page": "Stephen Kovacevich", "response": ["He made his concert debut as a pianist at the age of 11; then, at the age of 18 he moved to London to study under Dame Myra Hess on a scholarship and has been a London resident ever since, currently living in Hampstead. In 1961 he made a sensational European debut at the Wigmore Hall, playing the Sonata by Alban Berg, three Bach Preludes and Fugues and Beethoven's Diabelli Variations. He also toured Britain with Jacqueline du Pré.Elizabeth Wilson Jacqueline Du Pre: Her Life, Her Music, Her Legend 1999, p. 136 In 1967, he made his New York debut and since then he has toured Europe, the United States, the Far East, Australia, New Zealand and South America. As a soloist and conductor, he has frequently performed and recorded works by, amongst others, Mozart, Beethoven, Schubert, Brahms and Bartók. In more recent years, he has performed works by Rachmaninoff.", "Kovacevich often performs chamber works; his chamber music partners have included Jacqueline du Pré, Martha Argerich, Steven Isserlis, Nigel Kennedy, Lynn Harrell, Sarah Chang, Gautier Capuçon, Renaud Capuçon and Emmanuel Pahud."]}, {"page": "John Barbirolli", "response": ["In 1962, HMV persuaded Barbirolli to return. With the Hallé he recorded a Sibelius symphony cycle, Elgar's Second Symphony, Falstaff and The Dream of Gerontius, Schubert's Ninth Symphony, Vaughan Williams's A London Symphony, and works by Grieg and Delius. With other orchestras, Barbirolli recorded a wide range of his repertoire, including many recordings still in the catalogues in 2020. Of these, his Elgar recordings include the Cello Concerto with Jacqueline du Pré, Sea Pictures with Janet Baker, and orchestral music including the First Symphony, Enigma Variations and many of the shorter works. His Mahler recordings include the Fifth and Sixth Symphonies (with the New Philharmonia) and Ninth Symphony (with the Berlin Philharmonic). With the Vienna Philharmonic, he recorded a Brahms symphony cycle, and with Daniel Barenboim, the two Brahms Piano Concertos. He made three operatic sets for HMV: Purcell's Dido and Aeneas with Victoria de los Ángeles (1966),Robertson, Alec, \"Dido and Aeneas\", The Gramophone, October 1966, p. 77 Verdi's Otello with James McCracken, Gwyneth Jones and Dietrich Fischer-Dieskau (1969),Blyth, Alan, \"Verdi: Otello\", The Gramophone, October 1969, p. 97 and a set of Madama Butterfly with Renata Scotto, Carlo Bergonzi and Rome Opera forces that has remained in the catalogues since its first issue in 1967.Anderson, Robert Kinloch, \"Barbirolli's Roman Butterfly\", The Gramophone, September 1967, p. 25; Oliver, Michael, \"Madama Butterfly\", Gramophone, May 1989, p. 90; and O'Connor, Patrick, \"Madama Butterfly\", Gramophone, March 2009, p. 93 The impact of the last was such that the head of the Rome Opera invited him to come and conduct \"any opera you care to name with as much rehearsal as you wish.\" HMV planned to record Die Meistersinger with Barbirolli in Dresden in 1970, but following the Warsaw Pact invasion of Czechoslovakia in 1968 he refused to conduct in the Soviet bloc, and his place was taken by Herbert von Karajan.Kennedy (1971), pp. 306–307, and \"Opera: Wagner\", The Gramophone, October 1971, p. 102"]}, {"page": "Paul Tortelier", "response": ["He taught Jacqueline du Pré when she briefly attended his classes at the Paris Conservatoire, though he was not her main teacher (that was William Pleeth). Other students included Arto Noras, Nathan Waks and Raphaël Sommer. In the 1970s he gave a series of master classes which were recorded and broadcast on TV by the BBC, which demonstrate his very dynamic style of playing."]}, {"page": "1973 in music", "response": ["** Cellist Jacqueline du Pré is forced to retire because she has been diagnosed with multiple sclerosis.Anon., \"Miss du Pré is Forced by Illness to Retire\", The Times issue 58931 (November 6, 1973): 1 col. A.", "* 7 November – Harold Holt Ltd., agent for Jacqueline du Pré, deny newspaper reports that she will never perform again, while at the same time confirming she has been diagnosed with \"a mild case of multiple sclerosis\" and has no definite plans for future performances.Tim Devlin, \"Miss du Pré 'Very Ill' Report Denied\", The Times, issue 58932 (November 7, 1973): 5 col C."]}, {"page": "1987 in music", "response": ["*October 19 – Jacqueline du Pré, English cellist, 42 (multiple sclerosis)"]}, {"page": "1945 in music", "response": ["**Jacqueline du Pré, cellist (d. 1987)"]}]}}