{"wiki_id": "http://www.wikidata.org/entity/Q2281965", "itemLabel": "Sidney Pollard", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Sidney_Pollard", "wikipedia_page": {"main": "Siegfried Sidney Pollard (21 April 1925 – 22 November 1998) was a British economic and labour historian, and Professor at the University of Sheffield. He pioneered the study of the role of economic management in the processes of industrialization - an industrialization which he thought was best examined at regional levels rather than national levels.\n\n", "link_mentions": [{"page": "Michael Postan", "response": [":VIII: The Industrial Economies: The Development of Economic and Social Policies (1989) edited by Peter Mathias and Sidney Pollard"]}, {"page": "Colin Holmes (historian)", "response": ["In 1963 Holmes was appointed to an assistant lectureship at the University of Sheffield in the Department of Economic and Social History under Sidney Pollard, then a rising star in the field of Economic History. During the 1970s the two worked closely together producing several volumes of documents covering European Economic History in the modern period. These books were: The Process of Industrialization (1968); Industrial Power and National Rivalry (1972) and The End of the Old Europe (1973). Holmes and Pollard also edited Essays in the Economic and Social History of South Yorkshire (1977 reprinted 1979). Together with Alan Booth, in 1991 Holmes edited and contributed to a \"festschrift\" for Pollard called Economy and Society. European Industrialisation and its Social Consequences. On Pollard's death in 1988 Holmes became his literary executor and also edited for publication Pollard's Essays on the Industrial Revolution in Britain (2000).", "*(with Sidney Pollard;) Essays on the Industrial Revolution in Britain :(Aldershot; Burlington, Vt.: Ashgate/Variorum, 2000) ", "*'Sidney Pollard 1925–1998', \"Proceedings of the British Academy\", Vol 105 (2000), pp. 513–534.", "*'Professor Sidney Pollard', \"The Independent\", 10 December 1998.", "*'Professor Sidney Pollard', \"The Times\", 18 December 1998."]}, {"page": "G. H. B. Ward", "response": ["Born in central Sheffield, Ward worked as an engineer in a local steelworks.\"Local history \", Dore to Door, Spring 2001 Whilst working in this capacity, Ward became the first Secretary of the Sheffield Labour Representation Committee, on which he represented the Amalgamated Society of Engineers,J. Mendelson, W. Owen, S. Pollard and V. M. Thornes, The Sheffield Trades and Labour Council 1858 - 1958 later becoming Chair.Sidney Pollard, A History of Labour in Sheffield  A major political interest was his campaign against infant mortality, calling for increased supervision of midwives and the milk supply and for education of mothers.Ed. Clyde Binfield et al., The History of the City of Sheffield: Volume I: Politics"]}, {"page": "Pollard (surname)", "response": ["* Sidney Pollard (1925–1998), British economic and labour historian"]}, {"page": "The Making of the English Working Class", "response": ["Sidney Pollard called the book \"without a doubt, a landmark in English historiography\". Robert K. Webb called it \"both very important and extremely exasperating\". David Eastwood argued that it \"transformed the study of labour, class and political radicalism in Britain and America and is incontestably the single most influential work of history of the post-war period\"."]}]}}