{"wiki_id": "http://www.wikidata.org/entity/Q2280064", "itemLabel": "Theo Fabergé", "itemDescription": "jeweler; grandson of Carl Fabergé", "wikipedia_url": "https://en.wikipedia.org/wiki/Theo_Faberg%C3%A9", "wikipedia_page": {"main": "Theo Fabergé (London, 26 September 1922 - 20 August 2007) was the grandson of Peter Carl Fabergé. His father Nicholas Fabergé, Carl's youngest son, arrived in London in 1906 to help run the only branch of 'The House of Fabergé' outside Russia, in Dover Street, London. After 1917 Nicholas remained in London and in 1922 his son, Theo Fabergé was born.\nFrom an early age Theo Fabergé had a passion for making objects of a highly crafted standard. A fascination with the natural beauties of wood led Theo to explore the techniques of ornamental turning, the art of deep-cut engraving and sculpting woods, ivories and metals using precision lathes. He restored a Holtzappfel lathe originating from 1861, and in the 1950s began to design and make elegant objets d'art from rare wood and ivory, for pleasure and then as commissions. \nTheo soon began to receive commissions from notable collectors of Carl Fabergé, and from museums such as the Virginia Museum of Fine Arts, United States. In 1984, Theo was persuaded to produce a Collection to be sold on the international market incorporating precious metals, crystal, enamelling, stone-carving, precious gems and porcelain. The St Petersburg Collection was launched to the public at Marshall Fields, Chicago in 1985.\nTheo's Fabergé's daughter, Sarah Fabergé launched her first designs for the St Petersburg Collection in 1994. \nTheo and his daughter Sarah Fabergé worked on a variety of commissions from the White House Egg for the United States President, to the Brotherhood Egg for Boys' Town. \nAt the time of the establishment of St Petersburg Collection, the Duke of Gloucester admired Theo's work at The Art of the Master Turner' exhibition at the Science Museum in London. Princess Alexandra, The Hon Lady Ogilvy received Theo's Presentation Golden Egg. The Duke of York came aboard the vessel Sthtandart in 1999 when it arrived in the Pool of London bearing the oak for Theo's Sthtandart eggs. The Duke and Duchess of York commissioned the Hole in One Egg in aid of a children's charity. In 2003, Theo was commissioned by the Royal Air Force to produce their commemorative piece for the centenary of the Wright Brothers' first flight, the first being presented to the Duke of Edinburgh.\nThe Collection is shown in major outlets throughout the world. Eminent museums such as the State Hermitage Museum, the San Diego Fine Arts Museum and the St Petersburg City Museum have catalogued Theo Fabergé's creations within their collections.", "link_mentions": [{"page": "Fabergé (disambiguation)", "response": ["*Theo Fabergé (1922–2007), grandson of Peter Carl"]}, {"page": "Theo faberge", "response": ["#REDIRECT Theo Fabergé"]}, {"page": "Theo Faberge", "response": ["#REDIRECT Theo Fabergé   "]}, {"page": "List of jewellery designers", "response": ["* Theo Fabergé"]}, {"page": "Sarah Fabergé", "response": ["Sarah Josephine Fabergé (born July 1958) is the only daughter of Theo Fabergé. She is a founding member of the Fabergé Heritage Council and Director of Special Projects for Fabergé."]}]}}