{"wiki_id": "http://www.wikidata.org/entity/Q22908764", "itemLabel": "Leslie Grinsell", "itemDescription": "English archaeologist and museum curator", "wikipedia_url": "https://en.wikipedia.org/wiki/Leslie_Grinsell", "wikipedia_page": {"main": "Leslie Valentine Grinsell  (14 February 1907 – 28 February 1995) was an English archaeologist and museum curator. Publishing over twenty books on archaeology during his lifetime, he was renowned as a specialist on the prehistoric barrows of southern England.\nBorn in London and raised largely in Brighton, Grinsell developed an early interest in archaeology through visits to Brighton Museum. Later working as a bank clerk in London, he embarked on archaeological research in an amateur capacity, visiting prehistoric barrows during his weekends and holidays to record their shape, dimensions, and location. On the basis of his research, he published a range of academic articles and books on barrows during the 1930s, gaining recognition as Britain's foremost expert on the subject. In 1933, he carried out his only archaeological excavation, at the Devil's Humps in Sussex.\nDuring the Second World War he joined the Royal Air Force and served in Egypt, where he acquainted himself with the archaeological remains of Ancient Egyptian society; after the war he published a book on the Egyptian pyramids. On his return to Britain, Grinsell became the treasurer of the Prehistoric Society, a position that he held from 1947 till 1970. Moving to Devizes, in 1949 he entered the archaeological profession as an assistant to Christopher Hawkes and Stuart Piggott at the Victoria County History project. From 1952 to 1972, Grinsell worked as Keeper of Anthropology and Archaeology at Bristol City Museum, during which time he continued his examination of barrows, focusing on those in south-west England. On retirement, he was appointed to the Order of the British Empire and a festschrift was published in his honour.\nOver the course of his lifetime, Grinsell examined and catalogued around 10,000 barrows and advanced the archaeological understanding of such monuments. His use of non-excavatory fieldwork influenced much British archaeology in the latter part of his 20th century, while his willingness to pay attention to other sources of information, such as folklore and place-names, has been deemed ahead of its time.", "link_mentions": [{"page": "Wayland's Smithy", "response": ["The site was also mentioned in a letter sent to the antiquarian William Stukeley by his daughter Anna on 3 October 1758. There is some folklore associating witch relics with the site. It is referred to as \"Wayland Smith's Forge\" in Walter Scott's 1821 novel Kenilworth. In 1828, a one-inch Ordnance Survey map recorded the site's name as being \"Wayland Smith's Forge\". The folklorist and archaeologist Leslie Grinsell suggested that the decision to name it this on the map was influenced by Scott's novel."]}, {"page": "Coldrum Long Barrow", "response": ["In his 1924 publication dealing with Kent, the archaeologist O. G. S. Crawford, then working as the archaeological officer for the Ordnance Survey, listed the Coldrum Stones alongside the other Medway Megaliths. In 1926, the Coldrum Stones were given to The National Trust, a charity which dedicated it as a memorial to the Kentish prehistorian Benjamin Harrison. A plaque was erected to mark this, which erroneously termed the monument a stone circle; in 1953, the archaeologist Leslie Grinsell expressed the view that \"it is hoped that this error may be rectified in the near future\". Still owned by the Trust, the site is open to visitors all year round, free of charge. On their website, the Trust advises visitors to look for \"stunning views from the top of the barrow\". John H. Evans characterised the site as \"the most impressive\" of the Medway Megaliths, while Grinsell described it as \"the finest and most complete\" of the group."]}, {"page": "Bell barrow", "response": ["Leslie Grinsell constructed a typology for bell barrows:"]}, {"page": "Medway Megaliths", "response": ["The first published record that commented on the existence of stones at the site was in 1719, although they would only be described as the relics of a prehistoric survival in print in 1779, when it was erroneously described as a stone circle and compared to Stonehenge. When the road was widened and deepened in 1827, two of the stones from the revetment curb were removed and deposited in the corner of the wood to the south of the barrow. The site was excavated circa 1845 by a local vicar, the Reverend Lambert Larking, who allegedly found some evidence of ceramics; it has also been asserted, although not proven, that he discovered human bones at the site. When Thomas Wright explored it c.1850, he was aided by a local man who enthusiastically believed that a crock of gold would be buried there, something that Leslie Grinsell deemed to be part of local folklore.", "Folklorist Leslie Grinsell believed that it only adopted the name \"Countless Stones\" following the monument's pillaging circa 1690. The folktale held that an Aylesford baker attempted to count the stones by placing a loaf on each of the stones, but one loaf disappeared, with the Devil appearing in its place. At the end, the baker tried to count the loaves, but found that he had one more than he had brought with him. As he was about to call out the number of the stones, he then fell dead. In 1976, Grinsell noted that this folkloric belief still survived, as evidenced by numbers chalked on to the stones."]}, {"page": "Little Kit's Coty House", "response": ["The archaeologist and folklorist Leslie Grinsell believed that the countless stones motif would only have been applied to the site after the chamber had been toppled, something he suggested had occurred around 1690."]}, {"page": "Chestnuts Long Barrow", "response": ["In the late 1940s, the site was visited by the archaeologists John H. Evans and Albert Egges van Giffen, with the former commenting that they examined the site in its \"overgrown state\". In 1953, the archaeologist Leslie Grinsell reported that several small trees and bushes had grown up within the megaliths. That year, the field was prepared for horticultural use, being levelled and ploughed, although the area around the megaliths was left undisturbed. At this time, 16 megaliths were visible, lying at various angles. A  high holly tree stood in the centre of them, and there was no sign of a mound. The landowner, Richard Boyle, opened a few test trenches in the area, during which he discovered Mesolithic flint tools. A large number of surface finds were discovered in both the field and a quarry  to the east."]}, {"page": "Stanton Drew stone circles", "response": ["A (now recumbent) standing stone called Hautville's Quoit lies across the river to the north on an alignment with the centres of the Great Circle and the southern circle. It is a large stone close to Hautville Quoit Farm, recumbent since at least the mid 17th century but assumed to have originally been upright. Described by Stukeley in 1723 as being  long, it is now about half that length, Leslie Grinsell suggesting that fragments have occasionally been broken off for mending the roads. Stukeley also referred to the presence of a second stone."]}, {"page": "Knap Hill", "response": ["In 1939 C. W. Phillips excavated a bowl barrow outside the enclosure, but never published a report.  Two barrows outside the enclosure are listed in a gazetteer of Wiltshire by Leslie Grinsell, published in 1957, identified as Alton 10 and Alton 13.  Phillips excavated Alton 13, but it may be that the two barrows are the same, in which case the barrow Phillips excavated was the same one that Thurnam investigated in the 1850s.  Phillips found a crouched burial, at the old ground surface, and Neolithic potsherds; the potsherds may not indicate that the barrow is of Neolithic date since the sherds might have been present on the site at the time the barrow was constructed.  Grinsell cites Phillips to say that the barrow lay to the south of the causewayed enclosure, and if this is correct it is not the same barrow that Thurnam opened."]}, {"page": "Nine Stones, Winterbourne Abbas", "response": ["The archaeologist Leslie Grinsell reported that in the mid-1970s, he learned of a folk tale that the stones had once been children who were turned to stones as punishment for playing Five-Stones on a Sunday. This folk motif of humans turned to stone for revelling on a Sunday had been attached to a range of prehistoric monuments across southwestern Britain by the early eighteenth century, although it had been first recorded in Cornwall in 1602. It is likely connected to Sabbatarianism, and may have been spread by Protestant preachers."]}, {"page": "Countless stones", "response": ["The countless stones motif was the subject of a study by folklorist S. F. Menefee, published in the Folklore journal in 1975, and was part of Leslie Grinsell's catalogue of folkloric motifs associated with prehistoric sites in Britain."]}, {"page": "Porlock Stone Circle", "response": ["There are only two known prehistoric stone circles on Exmoor: Porlock and Withypool Stone Circle. The archaeologist Leslie Grinsell suggested that the circular stone monument on Almsworthy Common was \"probably\"  the remains of a stone circle, although more recent assessments regard it as one of the stone settings, a different type of monument more common across Exmoor."]}, {"page": "Withypool Stone Circle", "response": ["There are only two known prehistoric stone circles on Exmoor: Withypool and Porlock Stone Circle. The archaeologist Leslie Grinsell suggested that the circular stone monument on Almsworthy Common was \"probably\"  the remains of a stone circle, although more recent assessments regard it one of the stone settings, a different form of monument which is more common across Exmoor."]}, {"page": "Almsworthy Common", "response": ["The Ordnance Survey list it as a \"Stone Circle\" on their map. In his 1970 study of the archaeology of Exmoor, Leslie Grinsell thought that it was \"probably\" a stone circle."]}]}}