{"wiki_id": "http://www.wikidata.org/entity/Q22958852", "itemLabel": "Kenneth Corfield", "itemDescription": "British camera engineer and industrialist (1924-2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenneth_Corfield", "wikipedia_page": {"main": "Sir Kenneth George Corfield (27 January 1924 – 11 January 2016) was a British camera engineer and industrialist.Born in Rushall near Walsall, Corfield attended the South Staffordshire College of Advanced Technology and worked in management development in ICI's Metals division from 1946 until 1950, when with his brother John he established K. G. Corfield Ltd in Wolverhampton. The company first made accessories for photographers, then launched the Periflex camera in 1953; it also imported Exacta Varex and Minox cameras from East Germany.After a majority holding in the company was bought by Guinness in the early 1960s, he led the expansion of Parkinson Cowan, a maker of gas meters and gas appliances. In 1966 he moved to American company ITT, becoming managing director of their British subsidiary Standard Telephones and Cables in 1969 and then executive chairman from 1979. Here he followed an ambitious expansion strategy, including in 1984 the ill-fated acquisition of computer maker ICL, leading to his resignation the following year.Corfield was also involved in developing the Architect camera and, in partnership with Brian Gould, he purchased the Gandolfi company in 1982 to ensure its future. He was the chair of the Science Museum committee which in 1982 selected Bradford as the home for the National Museum of Photography, Film & Television, later the National Media Museum.\nCorfield was knighted in 1980. He died at the age of 91 on 11 January 2016.", "link_mentions": [{"page": "International Computers Limited", "response": ["On 26 July 1984 a £400 million takeover bid for ICL arrived from Sir Kenneth Corfield, head of Standard Telephones and Cables. The stated rationale was the predicted convergence of computers and telecommunications. The ICL board recommended acceptance of the bid, and the takeover was completed on 10 September. Sir Michael Edwardes, who had been chairman for just six months, resigned, and Laidlaw returned briefly as chairman. Robb Wilmot, who had arrived as managing director in 1981 (at the age of 36) remained, along with Peter Bonfield as marketing director."]}, {"page": "Engineering Council", "response": ["From its recommendations, the Engineering Council was established in 1981, watching over 54 separate institutions. It gained a royal charter on 27 November 1981. The first chairman was Sir Kenneth Corfield, followed by Francis Tombs, Baron Tombs in 1985, Sir William Barlow in 1988, Sir John Fairclough in 1991, Dr. Alan Rudge in 1996 and Dr. Robert Hawley in 1999."]}, {"page": "Standard Telephones and Cables", "response": ["With developments in computer technology influencing and stimulating telecoms, the buzzword of the late 1980s became \"convergence\". An attempt to enter the mainframe computer market with the takeover of ICL led to financial strains. The rationale was the convergence of computing and telecoms but the vision was too early. Almost immediately, STC had financial problems and ICL was ring-fenced to preserve it as a profit centre.  By 1991, with an ageing workforce, loss of business from the newly privatised BT, production spread over too many expensive sites and no clear leadership succession to its former chairman, Sir Kenneth Corfield, STC was bought by Canadian company Northern Telecom (Nortel).Telecom bid to buy STC New York Times, 9 November 1990Nortel History - 1980 to 1989 "]}, {"page": "Parkinson Cowan", "response": ["*c.1960 to 1966: Kenneth Corfield is chairman."]}, {"page": "K. G. Corfield Ltd", "response": ["The driving force behind the company and its products was Sir Kenneth Corfield", "Subsequently, Sir Kenneth Corfield resurrected the firm to build the Architect camera and to become involved in the production of Gandolfi cameras."]}, {"page": "Bicentenary Medal of the Royal Society of Arts", "response": ["*1985 Sir Kenneth Corfield"]}, {"page": "Corfield", "response": ["*Kenneth Corfield (1924-2016), camera designer, engineer and businessman "]}, {"page": "2016 in the United Kingdom", "response": ["**Sir Kenneth Corfield, 91, camera engineer, inventor of the Corfield Periflex."]}, {"page": "Deaths in January 2016", "response": ["*Sir Kenneth Corfield, 91, British camera engineer, inventor of the Corfield Periflex.Sir Kenneth Corfield, the man behind the ‘last successful’ British camera range, dies aged 91"]}]}}