{"wiki_id": "http://www.wikidata.org/entity/Q22955213", "itemLabel": "Corin Hardy", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Corin_Hardy", "wikipedia_page": {"main": "Corin Hardy (born 6 January 1975) is an English film director. He made his directorial debut with the 2015 horror film The Hallow, which he also co-wrote.He directed the 2018 horror film The Nun, a spin-off of The Conjuring 2 (2016) and the fifth film in The Conjuring Universe.In 2020, he directed four episodes of the first season of Gangs of London, a TV series produced for Sky Atlantic.", "link_mentions": [{"page": "Cthulhu", "response": ["British synthwave band, Gunship, released the song \"Cthulhu\" in 2019, featuring a quote from Lovecraft's The Call of Cthulhu and Other Dark Tales narrated by horror-film director, Corin Hardy. "]}, {"page": "The Crow (1994 film)", "response": ["On May 4, 2013, Deadline reported that Luke Evans had been cast as Eric Draven. Evans reaffirmed to Superhero Hype that the film would be as faithful as possible to the original. On July 3, 2013, The Crows creator James O'Barr was named as the creative consultant of the film. In an October 2015 interview, O'Barr would discuss what had changed his mind about the reboot, and efforts to make the reboot a more faithful adaptation of the comic book, while remaining respectful to the original film. On November 21, 2013, Schmoes Know had reports that Norman Reedus was up for the role of a character named \"James\", and that Kristen Stewart had at one time been considered for the part of Shelly. In December 2014, the studio hired Corin Hardy to direct the film. Evans told Den of Geek in an interview that he might not do the film, and it was later revealed that Evans has dropped out of the film due to other projects. On February 9, 2015, O'Barr told Blastr in an interview that he was interested in Sam Witwer for the role.", "As of October 24, 2014, the film was set to start production in the spring of 2015. On February 25, 2015, it was reported that Jack Huston would be starring in the film. On March 14, 2015, O'Barr confirmed to Dread Central at the Lexington Comic and Toy Convention that Huston had been cast as Draven in the reboot, and at a Q&A during the convention he further confirmed that Jessica Brown Findlay had been cast as Shelly Webster. On May 20, 2015, Deadline reports that Andrea Riseborough is in talks to co-star as the female version of Top Dollar. On June 15, 2015, Variety reported two stories: Forest Whitaker was in negotiations for a role and Huston had dropped out due to scheduling conflicts, but Relativity Studios were looking at Nicholas Hoult and Jack O'Connell for the role of Draven. On July 31, 2015, The Hollywood Reporter reported that production on the reboot stalled because of Relativity Media's bankruptcy. O'Barr told comicbook.com in an interview that the film will still happen. TheWrap reported that filming on the reboot was going to start in March 2016 with Corin Hardy on board as director. On June 15, 2016, Deadline reports that Hardy may return to the reboot. On August 10, 2016, Jason Momoa posted a photo of himself with Hardy on his Instagram account. On September 6, 2016, TheWrap reports that Momoa is cast and filming will begin in January 2017. On November 17, 2016, The Hollywood Reporter has reported that Highland Film Group and Electric Shadow have acquired the rights to finance, produce, and distribute the film (now titled The Crow Reborn) from Relativity but may lose both Momoa and Hardy. In September 2017, it was announced that Sony will distribute the film."]}, {"page": "The Crow", "response": ["Corin Hardy was the next director to take on the film and O'Barr said in October 2017:"]}, {"page": "Wimbledon College of Arts", "response": ["* Corin Hardy (film director)"]}, {"page": "Stephen Norrington", "response": ["In 2008, it was announced that Norrington would direct a reboot of The Crow franchise. He left the film by 2013 and was replaced by F. Javier Gutiérrez. By July 2015, Gutiérrez eventually left the project and was replaced by Corin Hardy. Hardy also left the project on 31 May 2018, leaving the film in limbo."]}, {"page": "Christopher Guard", "response": ["| Corin Hardy"]}, {"page": "Bedshaped", "response": ["The video for the song is available on the enhanced CD single version, as well as the Bonus DVD edition of Hopes and Fears and on Strangers.  The video is directed by Corin Hardy, and based on his 2003 stop-motion animated short film \"Butterfly\". The video shows a bedraggled, naked man amongst some refuse, drowning his sorrows in alcohol. He is lonely and sad, and crawls into a bathroom where he hides, and writes some of the song's lyrics such as 'don't laugh at me' and \"don't look away\" on the walls, like graffiti. A cat drags some ill-fitting clothes into the room for him, where he dresses and dares to venture outside. He exits and sees people gathered in a restaurant. He hallucinates and their faces turn into gremlin-like monsters, causing him to run back to the bathroom in fear, only for the walls to collapse and drown him in white light. The wizened man finds himself against a white background, where he witnesses animated versions of Keane's band members playing the titular song with the lyrics he wrote on the walls. Having seemingly found solace in this unusual scene, the man, along with Keane, fades into the light."]}, {"page": "Screen International", "response": ["* Corin Hardy"]}, {"page": "Felipe Marino", "response": ["Marino then wrote and produced an adaptation of Madame Bovary starring Mia Wasikowska, Paul Giamatti, Rhys Ifans, Logan Marshall Green, and rising star Ezra Miller. The film premiered at Telluride and Toronto Film Festivals, and was released by Alchemy (formerly Millennium Entertainment) on June 12, 2015. Most recently, he co-wrote and produced The Hallow, a horror film directed by Corin Hardy. The film had its world premiere in January 2015 at the Sundance Film Festival. IFC acquired the North American rights to the film, and it will be released on November 13, 2015. For the writing of both these films, Marino wrote under the pseudonym of Rose Barreneche for the latter, and Olga Barreneche for the former."]}, {"page": "Pencil Full of Lead", "response": ["The music video for the song was added to YouTube on 20 October 2009. It was directed by Corin Hardy. The video is set in a television studio and opens with a view from the control room. The performance begins with a coloured clay model of Nutini singing amongst an all-female band of real musicians and dancers. He starts to grope the band members and one of the dancers slaps him across the face, radically deforming his clay features. The music stops and an awkward pause ensues as the production staff assess the situation. One of the dancers flattens his hand under her foot, but escapes and runs away as the girls chase him, hitting a camera and tripping over a wire trap that the girls have set. The video ends with the women playing with the component clay parts of Nutini. The video ends with a mini-model of Nutini springing back to life from her hand, and him trying to hide his naked body from view."]}, {"page": "Taissa Farmiga", "response": ["Farmiga reprised her voice role as Raven in Teen Titans: The Judas Contract, again directed by Sam Liu, which premiered at the 2017 WonderCon. She next played Emma Ertz in Elizabeth Chomko's drama film What They Had, and re-teamed with director Hannah Fidell for the comedy film The Long Dumb Road, both of which premiered at the 2018 Sundance. Farmiga next appeared as the Catholic novitiate Sister Irene in Corin Hardy's horror film The Nun, the fifth film in The Conjuring Universe, which was released in September 2018, and emerged as the highest-grossing film in its series."]}, {"page": "Strasbourg European Fantastic Film Festival", "response": ["* The Méliès d’Argent for the best European fantastic film: The Hallow of Corin Hardy"]}, {"page": "Maxime Alexandre", "response": ["| Corin Hardy"]}, {"page": "The Hallow", "response": ["The Hallow (originally titled The Woods) is a 2015 horror film directed by Corin Hardy, written by Hardy and Felipe Marino, and starring Joseph Mawle, Bojana Novakovic, Michael McElhatton, and Michael Smiley.  It is a British-Irish co-production filmed in Ireland. It premiered at the 2015 Sundance Film Festival on 25 January 2015.", "Rotten Tomatoes, a review aggregator, reports that 73% of 56 surveyed critics gave the film a positive review; the average rating is 6.2/10.  The site's consensus reads: \"Drenched in dark atmosphere and bolstered with some real emotion underneath all the chills, The Hallow suggests a wonderfully horrifying future for director Corin Hardy.\"  It has a score of 65/100 on Metacritic based on 12 reviews.  Geoff Berkshire of Variety wrote, \"It takes time for The Hallow to get rolling, but once it reaches a bang-up final act, genre fans could walk out clamoring for a sequel.\"  David Rooney of The Hollywood Reporter wrote, \"As first films go, this one is visually energized, dynamically paced and discerning in its cine-literate references. It's also a kickass calling card for Hardy as he moves on to bigger projects.\"  Michael Roffman of Consequence of Sound rated it C− and wrote, \"Despite a number of supremely original sequences – one of which involves a car trunk, another a cavernous dwelling – they’re all carried out rather predictably, cinching any warranted tension within seconds.\"  Fred Topel of Bloody Disgusting rated it 4/5 stars and called for sequels to revisit the film's mythology, which he praised."]}, {"page": "The Conjuring Universe", "response": ["| Corin Hardy", "A spin-off film titled The Nun, featuring the \"Demon Nun\" character Valak from The Conjuring 2, was directed by Corin Hardy, with The Conjuring 2 co-scribe David Leslie Johnson initially announced as the writer before being replaced by Gary Dauberman and Wan, who also produced with Safran. Demián Bichir starred in the lead role, while Bonnie Aarons reprised her role in the film. The plot of the film follows a nun, a priest and a novitiate as they investigate an unholy secret and confront a malevolent force in the form of a demonic nun. The film was released on September 7, 2018, and grossed $365.6million on a budget of $22million, becoming the highest grossing film in the franchise."]}, {"page": "Atomic Monster Productions", "response": ["|Corin Hardy"]}, {"page": "Sam Raimi's unrealized projects", "response": ["In October 2015, Empire announced that Corin Hardy will direct Refuge from Tom De Ville's script and produced by Raimi. Since then, there have been no further announcements since."]}, {"page": "The Nun (2018 film)", "response": ["The Nun  is a 2018 American gothic supernatural horror film directed by Corin Hardy and written by Gary Dauberman, from a story by Dauberman and James Wan. It is a spin-off/prequel of 2016's The Conjuring 2 and the fifth installment in the Conjuring Universe franchise. The film stars Demián Bichir, Taissa Farmiga and Jonas Bloquet, with Bonnie Aarons reprising her role as the Demon Nun, an incarnation of Valak, from The Conjuring 2. The plot follows a Roman Catholic priest and a nun in her novitiate as they uncover an unholy secret in 1952 Romania.", "On June 15, 2016, Warner Bros. Pictures and New Line Cinema announced The Nun, a spin-off film to The Conjuring 2, which had opened five days earlier. Peter Safran and James Wan produced. The initial script for the film was written by David Leslie Johnson. On February 17, 2017, it was announced that Corin Hardy had signed on to direct The Nun with a new screenplay from Wan and Gary Dauberman. During the filming of Annabelle: Creation, Safran revealed that The Nun would chronologically come first in the Conjuring Universe, making it a further prequel to The Conjuring series and Annabelle series. He said, \"We have a board that we created that has what we hope will ultimately be our series of movies. We have it in chronological order, so we can keep track of where it all happens.\"", "On April 5, 2017, Demián Bichir was cast in the film, as a priest investigating a nun's mysterious suicide. Taissa Farmiga was cast shortly after, as a Roman Catholic nun in her novitiate. Corin Hardy later said that he initially did not want to cast Farmiga due to her being the sister of The Conjuring star Vera Farmiga, but changed his mind when he saw her auditions, \"I watched 100 auditions for this role and she had some kind of presence outside of her own body that is evident, and she's phenomenal.\" Bonnie Aarons was then set to reprise her role as the \"Demon Nun\" character Valak from The Conjuring 2. Charlotte Hope, Jonas Bloquet, and Ingrid Bisu were subsequently announced to star, rounding out the main cast.", "Principal photography for the film began on May 3, 2017, at Castel Film Studios in Bucharest, Romania, with Maxime Alexandre serving as cinematographer. Film director Corin Hardy had a Roman Catholic priest bless the set prior to filming. Scenes were filmed in the Palace of the Parliament building in June, for a fee of €5,000 per hour. Filming also took place at the Corvin Castle in Hunedoara and in Sighișoara, Transylvania. Hardy saw a handprint in the dust while filming in Mogoșoaia, which he believed to be that of a ghost. Hardy announced on his social media accounts that production had wrapped on June 23, 2017, after 38 days."]}, {"page": "Jonas Bloquet", "response": ["| Corin Hardy"]}, {"page": "List of Telugu films of 2018", "response": ["| Corin Hardy"]}, {"page": "List of horror films of 2018", "response": ["| data-sort-value=\"Hardy, Corin\" | Corin Hardy || Bonnie Aarons, Taissa Farmiga ||United StatesRomania ||"]}, {"page": "List of American films of 2018", "response": ["| The Nun || Warner Bros. Pictures / New Line Cinema || Corin Hardy (director); Gary Dauberman (screenplay); Demián Bichir, Taissa Farmiga, Jonas Bloquet, Charlotte Hope, Ingrid Bisu, Bonnie Aarons ||"]}, {"page": "List of unproduced Image Comics projects", "response": ["On November 21, 2013, Schmoes Know had reports that Norman Reedus was up for the role of a character named \"James\", and that Kristen Stewart had at one time been considered for the part of Shelly. In December 2014, the studio hired Corin Hardy to direct the film. Evans told Den of Geek in an interview that he might not do the film, and it was later revealed that Evans has dropped out of the film due to other projects. On February 9, 2015, O'Barr told Blastr in an interview that he was interested in Sam Witwer for the role.", "As of October 24, 2014, the film was set to start production in the spring of 2015. On February 25, 2015, it was reported that Jack Huston would be starring in the film. On March 14, 2015, O'Barr confirmed to Dread Central at the Lexington Comic and Toy Convention that Huston had been cast as Draven in the reboot, and at a Q&A during the convention he further confirmed that Jessica Brown Findlay had been cast as Shelly Webster. On May 20, 2015, Deadline reports that Andrea Riseborough is in talks to co-star as the female version of Top Dollar. On June 15, 2015, according to Variety reported two stories: Forest Whitaker is in negotiations for a role and Huston has dropped out due to scheduling conflicts, but Relativity Studios are looking at Nicholas Hoult and Jack O'Connell for the role of Draven. On July 31, 2015, The Hollywood Reporter reported that production on the reboot stalled because of Relativity Media's bankruptcy. O'Barr told comicbook.com in an interview that the film will still happen. TheWrap reported that filming on the reboot was going to start in March 2016 with Corin Hardy on board as director. On June 15, 2016, Deadline reports that Hardy may return to the reboot. On August 10, 2016, Jason Momoa posted a photo of himself with Hardy on his Instagram account. On September 6, 2016, TheWrap reports that Momoa is cast and filming will begin in January 2017. On November 17, 2016, The Hollywood Reporter has reported that Davis Films, Highland Film Group, and Electric Shadow have acquired the rights to finance, produce, and distribute the film (now titled The Crow Reborn) from Relativity but may lose both Momoa and Hardy. In September 2017, it was announced that Sony will distribute the film."]}, {"page": "List of horror films of the 2020s", "response": ["| Arcane || Corin Hardy || || United States ||Monster"]}, {"page": "Balboa Productions", "response": ["On May 30, 2018, Balboa Productions was set to produce the film adaptations of James Byron Huggins novel Hunter and Michael McGowan and Ralph Pezzullo's memoir \"Ghost,\" as well as a Special Ops film written by retired Army Ranger Max Adams and the TV adaptations of Chuck Dixon's \"Levon's Trade,\" and Charles Sailor's \"Second Son.\" On May 5, 2019, Balboa Productions will co-produce the American remake of The Gangster, The Cop, The Devil with B&C Group and CA Entertainment and Don Lee producing and starring in the remake. In July 2019, Balboa Productions will produce Corin Hardy's monster movie Arcane, and the Iko Uwais-led The Bellhop, as well as the modernized TV reboot of Nighthawks for Peacock and the upcoming History show \"The Tenderloin,\" with Stallone set to direct multiple episodes In 2019, Balboa Productions will produce a Dolph Lundgren-led action series \"The International,\" with Ken Sanzel as the showrunner and Stallone directing the pilot for CBS. In February 2020, Balboa Productions will produce Rowan Athale's film \"Little America,\" with Stallone starring and looking for pre-sales through AGC International.", "| Corin Hardy"]}, {"page": "List of fantasy films of the 2020s", "response": ["| Corin Hardy"]}, {"page": "British Independent Film Award – The Douglas Hickox Award", "response": ["| Corin Hardy"]}]}}