{"wiki_id": "http://www.wikidata.org/entity/Q229056", "itemLabel": "Minnie Driver", "itemDescription": "British-American actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Minnie_Driver", "wikipedia_page": {"main": "Amelia Fiona Jessica Driver (born January 31, 1970) is a British-American actress and singer. She rose to prominence with her break-out role in 1995's Circle of Friends. She went on to star in a wide range of films including the cult classic Grosse Pointe Blank, Gus Van Sant's Good Will Hunting for which she was nominated for both the Academy Award for Best Supporting Actress and a Screen Actors Guild Award, the musical The Phantom of the Opera, Owning Mahowny, and providing the voice of Lady Eboshi in Hayao Miyazaki's Princess Mononoke.  \nIn television, Driver starred with Eddie Izzard in The Riches for which she was nominated for both an Emmy and a Golden Globe. She has starred in the ABC sitcom Speechless, the NBC sitcom About a Boy, and in a recurring role in the NBC series  Will & Grace. She has also starred in several miniseries in the UK including The Deep for BBC One.\nPredating her work as an actress, Driver started as a singer and has released three full solo albums over the span of her career. She has also lent her voice to a variety of animated series and films including SuperMansion and Tarzan as well as video games including Jurassic Park: Trespasser.", "link_mentions": [{"page": "January 31", "response": ["*1970 – Minnie Driver, English singer-songwriter and actress"]}, {"page": "John Cleese", "response": ["Cleese is Provost's Visiting Professor at Cornell University, after having been Andrew D. White Professor-at-Large from 1999 to 2006. He makes occasional well-received appearances on the Cornell campus. In 2001, Cleese was cast in the comedy Rat Race as the eccentric hotel owner Donald P. Sinclair, the name of the Torquay hotel owner on whom he had based the character of Basil Fawlty. That year he appeared as Nearly Headless Nick in the first Harry Potter film: Harry Potter and the Philosopher's Stone (2001), a role he would reprise in Harry Potter and the Chamber of Secrets (2002). In 2002, Cleese made a cameo appearance in the film The Adventures of Pluto Nash, in which he played \"James\", a computerised chauffeur of a hover car stolen by the title character (played by Eddie Murphy). The vehicle is subsequently destroyed in a chase, leaving the chauffeur stranded in a remote place on the moon. In 2003, Cleese appeared as Lyle Finster on the US sitcom Will & Grace. His character's daughter, Lorraine, was played by Minnie Driver. In the series, Lyle Finster briefly marries Karen Walker (Megan Mullally). In 2004, Cleese was credited as co-writer of a DC Comics graphic novel titled Superman: True Brit. Part of DC's \"Elseworlds\" line of imaginary stories, True Brit, mostly written by Kim Howard Johnson, suggests what might have happened had Superman's rocket ship landed on a farm in Britain, not America."]}, {"page": "Princess Mononoke", "response": ["* Yūko Tanaka provides the voice of , the ruler of Irontown who continually clears the forest. Miyazaki stated that Eboshi was supposed to have a traumatic past, although it is not specifically mentioned in the film. Miyazaki said that Eboshi has a strong and secure personality, evident in the fact that she let Ashitaka move freely through the settlement unescorted, despite his unclear motives. He also said that Eboshi does not acknowledge the Emperor's authority in Irontown, a revolutionary view for the time, and displays an atypical attitude for a woman of that era in that she wouldn't hesitate to sacrifice herself or those around her for her dreams. Miyazaki also said that Eboshi resembles a shirabyōshi. Eboshi's English voice actress Minnie Driver stated that she was interested in \"the challenge of playing [a] woman who supports industry and represents the interests of man, in terms of achievement and greed.\" Driver viewed Eboshi as \"a warrior, an innovator and a protector.\"", "An additional theme is the morally ambiguous conflict between humankind's growth and development and Nature's need for preservation. According to the Chicago Sun-Times's Roger Ebert, \"It is not a simplistic tale of good and evil, but the story of how humans, forest animals and nature gods all fight for their share of the new emerging order.\" Billy Crudup, who provided the English voice for Ashitaka, said \"The movie was such an entirely different experience; it had a whole new sensibility I had never seen in animation. It also had something profound to say: that there has to be a give and take between man and nature. One of the things that really impressed me is that Miyazaki shows life in all its multi-faceted complexity, without the traditional perfect heroes and wicked villains. Even Lady Eboshi, who Ashitaka respects, is not so much evil as short-sighted.\" Minnie Driver, the English voice actress for Lady Eboshi, commented similarly: \"It's one of the most remarkable things about the film: Miyazaki gives a complete argument for both sides of the battle between technological achievement and our spiritual roots in the forest. He shows that good and evil, violence and peace exist in us all. It's all about how you harmonize it all.\" Anime historian Susan Napier said there is no clear good vs. evil conflict in Princess Mononoke, unlike other films popular with children. Based on the multiple point of views the film adopts, San and Lady Eboshi can simultaneously be viewed as heroic or villainous. San defends the forest and viewers empathize with her. But she also attacks innocent people, complicating how we evaluate her. Opposed to San, Eboshi tries to destroy the forest and could be considered a villain. But everything she does is out of a desire to protect her village and see it prosper. San and Lady Eboshi survive until film's end, defying the usual convention of good triumphing over evil with the antagonist defeated. Napier concluded that the resolution of the conflict is left ambiguous, implying that Lady Eboshi and San will be able to come to some sort of compromise. The ambiguity suggests that there are no true villains or heroes."]}, {"page": "Tomb Raider", "response": ["Lara Croft has been voiced by five actresses in the video game series: Shelley Blond, Judith Gibbins, Jonell Elliott, Keeley Hawes, and Camilla Luddington. In other media, Croft was also voiced by Minnie Driver in the animated series and portrayed by Angelina Jolie and Alicia Vikander in feature films. Multiple models and body doubles have portrayed Croft in promotional material up until the reboot in 2013. Eight different real-life models have portrayed her at promotional events."]}, {"page": "1970", "response": ["** Minnie Driver, English actress"]}, {"page": "Absolutely Fabulous", "response": ["*Minnie Driver"]}, {"page": "Irish Travellers", "response": ["Irish Travellers have been depicted, usually negatively but sometimes with some care and sympathy, in film, radio, print, and television. Shows like The Riches (2007–2008), the American television series featuring Eddie Izzard and Minnie Driver, take a deeper look into the Traveller lifestyle. The documentary series Big Fat Gypsy Weddings (2010, 2011, and 2012) has been commercially successful in the United Kingdom, offering glimpses of Traveller life as viewed at real-life weddings. A 1997 American film, Traveller, starring Bill Paxton and Mark Wahlberg, also explored the Travellers in America. In his 1993 documentary \"Rules of the Road\" German filmmaker Oliver Herbrich portrayed the Travellers in Ireland and the UK as a nomadic ethnic group forced to adapt to settled lifestyle.Press release documnetary film Rules of the Road, 1993 Some of the main characters in the Irish sitcom, \"Derry Girls,\" encounter a group of Travellers in an episode that aired on 19 March 2019."]}, {"page": "Hank Azaria", "response": ["He has periodically returned to theatrical work, appearing in several productions. In 2003, he appeared as Bernard in a run of David Mamet's play Sexual Perversity in Chicago, along with Matthew Perry and Minnie Driver, in London's West End. Azaria made his first appearance as Sir Lancelot, the French Taunter, and four other characters in Spamalot, the musical version of Monty Python and the Holy Grail, which opened in Chicago in December 2004, before moving to the Shubert Theatre on Broadway. The show met with critical acclaim, receiving fourteen Tony Award nominations in 2005, with Azaria being nominated for Best Performance by a Leading Actor in a Musical. Reuniting with The Birdcage director Mike Nichols, and being a huge Monty Python fan, he saw it as an opportunity he could not pass up, describing it as \"so much fun that I haven't realized how tiring it is,\" and \"the most fun that I've ever had in my entire life.\" He took a break from the show in June 2005, with Alan Tudyk filling in for him, to work on Huff, but returned in December 2005. In late 2007 he starred in Aaron Sorkin's The Farnsworth Invention, playing RCA head David Sarnoff. In 2016, he starred in the world premiere of Dry Powder opposite Claire Danes, John Krasinski, and Sanjit De Silva, directed by Thomas Kail, at the off-Broadway Public Theater in New York City.\"The Verdict: What Do Critics Think of Dry Powder?\" by Olivia Clement, Playbill, March 23, 2016"]}, {"page": "Good Will Hunting", "response": ["Good Will Hunting is a 1997 American psychological drama film directed by Gus Van Sant, and starring Robin Williams, Matt Damon, Ben Affleck, Minnie Driver and Stellan Skarsgård. Written by Affleck and Damon, the film follows 20-year-old South Boston janitor Will Hunting (Damon), an unrecognized genius who, as part of a deferred prosecution agreement after assaulting a police officer, becomes a patient of a therapist (Williams) and studies advanced mathematics with a renowned professor (Skarsgård). Through his therapy sessions, Will re-evaluates his relationships with his best friend (Affleck), his girlfriend (Driver), and himself, facing the significant task of confronting his past and thinking about his future.", ": Nominated: Academy Award for Best Supporting Actress – Minnie Driver", ": Nominated: Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Supporting Role – Minnie Driver"]}, {"page": "Jonathan Pryce", "response": ["Pryce featured, alongside Kathy Burke and Minnie Driver, in the BBC serial Mr. Wroe's Virgins (1993), directed by Danny Boyle. Pryce played Henry Kravis in the HBO produced made-for-TV movie Barbarians at the Gate (1993). He was nominated for a Primetime Emmy Award and for a Golden Globe Award for his role.Nellie Andreeva \"Trio elemental for HBO's 'Zinc'\", Hollywood Reporter (AP), 21 June 2007 Also during 1993, Pryce starred alongside River Phoenix and Judy Davis in the unfinished film Dark Blood, but production had to be shut down when, 11 days short of completion, Phoenix died from a drug overdose.\"Dark Blood\". RiverPhoenix.org. Retrieved 6 November 2007. Director George Sluizer, who owns the rights to what has been filmed, has made available some of the raw material, which features Pryce and Phoenix on a field in Utah, on his personal website.\"Videos\". George Sluizer's official website. Retrieved 19 November 2007. Between 1993 and 1997, Pryce, on a multimillion-dollar contract became the spokesman for the Infiniti automobile marque in a series of American television commercials, in particular for the Infiniti J30 and Infiniti Q45. In one of these advertisements Pryce appeared alongside jazz singer Nancy Wilson in a Prague nightclub.Meredith, Robyn (13 June 1996). \"The Media Business: Advertising;Infiniti chooses artsy ads with musings about the meaning of life to sell its luxury cars.\". The New York Times. Retrieved 6 November 2007. In 1994, Pryce portrayed Fagin in a revival of the musical Oliver!,Jones, Kenneth (10 March 2006). \"Playbill.com's Brief Encounter with Jonathan Pryce \". Playbill. Retrieved 9 December 2007. and starred alongside Emma Thompson in the film Carrington (1995), which centres on a platonic relationship between gay writer Lytton Strachey and painter Dora Carrington. For his portrayal of Strachey, Pryce received the Best Actor Award at the 1995 Cannes Film Festival."]}, {"page": "Ben Affleck", "response": ["The success of 1997's Good Will Hunting, which Affleck co-wrote and acted in, marked a turning point in his career. The screenplay originated in 1992 when Damon wrote a 40-page script for a playwriting class at Harvard University. He asked Affleck to act out the scenes with him in front of the class and, when Damon later moved into Affleck's Los Angeles apartment, they began working on the script in earnest. The film, which they wrote mainly during improvisation sessions, was set partly in their hometown of Cambridge and drew from their own experiences. They sold the screenplay to Castle Rock in 1994 when Affleck was 22 years old. During the development process, they received notes from industry figures, including Rob Reiner and William Goldman. Following a lengthy dispute with Castle Rock about a suitable director, Affleck and Damon persuaded Miramax to purchase the screenplay. The two friends moved back to Boston for a year before the film finally went into production, directed by Gus Van Sant, and co-starring Damon, Affleck, Minnie Driver, and Robin Williams. On its release, Janet Maslin of The New York Times praised the \"smart and touching screenplay\", while Emanuel Levy of Variety found it \"funny, nonchalant, moving and angry\". Jay Carr of The Boston Globe wrote that Affleck brought \"a beautifully nuanced tenderness\" to his role as the working-class friend of Damon's mathematical prodigy character. Affleck and Damon eventually won both the Golden Globe and the Academy Award for Best Original Screenplay. Affleck has described this period of his life as \"dreamlike\": \"It was like one of those scenes in an old movie when a newspaper comes spinning out of the black on to the screen. You know, '$100 Million Box Office! Awards!' \" He remains the youngest writer (at age 25) ever to win an Oscar for screenwriting."]}, {"page": "1970 in music", "response": ["**Minnie Driver, English singer-songwriter and actress"]}, {"page": "Ryan Adams", "response": ["In addition to his own material, Adams has also produced albums for Willie Nelson, Jesse Malin, Jenny Lewis, and Fall Out Boy, and has collaborated with Counting Crows, Weezer, Norah Jones, America, Minnie Driver, Cowboy Junkies, Leona Naess, Toots and the Maytals, Beth Orton and Krista Polvere. He has written Infinity Blues, a book of poems, and Hello Sunshine, a collection of poems and short stories."]}, {"page": "2000 in film", "response": ["| Return to Me || Metro-Goldwyn-Mayer || Bonnie Hunt (director/screenplay); Don Lake (screenplay); David Duchovny, Minnie Driver, Carroll O'Connor, Robert Loggia, David Alan Grier, Bonnie Hunt, James Belushi, Joely Richardson, Eddie Jones, William Bronder, Marianne Muellerleile, Dick Cusack || Romance, Comedy || Live action", "| Beautiful || Destination Films || Sally Field (director); Jon Bernstein (screenplay); Minnie Driver, Joey Lauren Adams, Hallie Kate Eisenberg, Kathleen Turner, Leslie Stefanson, Bridgette Wilson, Kathleen Robertson, Michael McKean, Gary Collins, Linda Hart, Chuti Tiu, Ali Landry, Jessica Collins, Julie Condra, Herta Ware, Colleen Rennison, Jacqueline Steiger || Drama || Live action", "* Beautiful, directed by Sally Field, starring Minnie Driver, Joey Lauren Adams and Kathleen Turner", "* Return to Me, starring David Duchovny and Minnie Driver"]}, {"page": "2003 in film", "response": ["| Owning Mahowny || Sony Pictures Classics || Richard Kwietniowski (director); Maurice Chauvet (screenplay); Philip Seymour Hoffman, John Hurt, Minnie Driver, Maury Chaykin, Sonja Smits, Ian Tracey, Jason Blicker, Chris Collins, Matthew Ferguson, Janine Theriault, Conrad Dunn, Mike \"Nug\" Nahrgang, Philip Craig, M. J. Kang || Crime, Thriller || || Live Action", "* Hope Springs, starring Colin Firth, Minnie Driver and Heather Graham – (UK/US)", "* Owning Mahowny, starring Philip Seymour Hoffman, John Hurt and Minnie Driver – (Canada/UK)"]}, {"page": "1995 in film", "response": ["| Circle of Friends || Savoy Pictures || Pat O'Connor (director); Andrew Davies (screenplay); Chris O'Donnell, Minnie Driver, Saffron Burrows, Alan Cumming, Colin Firth, Geraldine O'Rawe, Aidan Gillen, Mick Lally, Britta Smith, Ciaran Hinds, Tony Doyle, Jason Barry || Drama || Live action", "| GoldenEye || United Artists || Martin Campbell (director); Michael France, Jeffrey Caine, Kevin Wade, Bruce Feirstein (screenplay); Pierce Brosnan, Sean Bean, Izabella Scorupco, Famke Janssen, Joe Don Baker, Judi Dench, Gottfried John, Robbie Coltrane, Alan Cumming, Tcheky Karyo, Desmond Llewelyn, Samantha Bond, Michael Kitchen, Billy J. Mitchell, Minnie Driver, Serena Gordon || Action || Live action", "*Circle of Friends, starring Chris O'Donnell and Minnie Driver – (Ireland)", "* Minnie Driver – Circle of Friends"]}, {"page": "1996 in film", "response": ["| Big Night || The Samuel Goldwyn Company || Campbell Scott, Stanley Tucci (directors); Joseph Tropiano, Stanley Tucci (screenplay); Stanley Tucci, Tony Shalhoub, Minnie Driver, Ian Holm, Isabella Rossellini, Marc Anthony, Allison Janney, Campbell Scott, Susan Floyd, Pasquale Cajano, Robert W. Castle, Andre Belgrader, Gene Canfield, Liev Schreiber || Comedy, Drama || Live action", "| Sleepers || Warner Bros. Pictures / PolyGram Filmed Entertainment / Baltimore Pictures / Propaganda Films || Barry Levinson (director/screenplay); Kevin Bacon, Robert De Niro, Vittorio Gassman, Dustin Hoffman, Jason Patric, Brad Pitt, Brad Renfro, Minnie Driver, Billy Crudup, Ron Eldard, Terry Kinney, Bruno Kirby, Joe Perrino, Geoffrey Wigdor, Jonathan Tucker, Eugene Byrd, Jeffrey Donovan || Drama || Live action", "* Big Night, starring Stanley Tucci, Tony Shalhoub, Ian Holm, Isabella Rossellini, Minnie Driver, Marc Anthony", "* Sleepers, directed by Barry Levinson, starring Brad Pitt, Jason Patric, Kevin Bacon, Minnie Driver, Dustin Hoffman, Robert De Niro"]}, {"page": "1997 in film", "response": ["| Grosse Pointe Blank || Hollywood Pictures / Caravan Pictures || George Armitage (director); Tom Jankiewicz, D. V. DeVincentis, Steve Pink, John Cusack (screenplay); John Cusack, Minnie Driver, Alan Arkin, Dan Aykroyd, Joan Cusack, Jeremy Piven, Hank Azaria, Barbara Harris, Mitchell Ryan, K. Todd Freeman, Michael Cudlitz, Benny Urquidez, Carlos Jacott, Jenna Elfman, Steve Pink, Brent Armitage, Ann Cusack, Belita Moreno, K. K. Dodds, Bill Cusack || Comedy || Live action", "| Good Will Hunting || Miramax Films || Gus Van Sant (director); Ben Affleck, Matt Damon (screenplay); Matt Damon, Ben Affleck, Robin Williams, Minnie Driver, Stellan Skarsgård, Casey Affleck, Cole Hauser, John Mighton, Scott William Winters, Jimmy Flynn, Christopher Britton, Alison Folland, George Plimpton || Drama || Live action", "* Good Will Hunting, directed by Gus Van Sant, starring Robin Williams, Matt Damon, Minnie Driver, Ben Affleck", "* Grosse Pointe Blank, starring John Cusack, Minnie Driver, Dan Aykroyd"]}, {"page": "1998 in film", "response": ["| Hard Rain || Paramount Pictures / PolyGram Filmed Entertainment / Mutual Film Company || Mikael Salomon (director); Graham Yost (screenplay); Morgan Freeman, Christian Slater, Randy Quaid, Minnie Driver, Edward Asner, Michael Goorjian, Dann Florek, Ricky Harris, Mark Rolston, Peter Murnik, Wayne Duvall, Richard Dysart, Betty White || Action, Thriller || Live action", "| The Governess || Sony Pictures Classics || Sandra Goldbacher (director/screenplay); Minnie Driver, Tom Wilkinson, Jonathan Rhys Meyers, Harriet Walter, Florence Hoath || Drama || Live action", "* Hard Rain, starring Christian Slater, Morgan Freeman, Minnie Driver and Randy Quaid"]}, {"page": "1999 in film", "response": ["| Tarzan || Walt Disney Pictures || Chris Buck, Kevin Lima (directors); Tab Murphy, Bob Tzudiker, Noni White (screenplay); Tony Goldwyn, Minnie Driver, Brian Blessed, Glenn Close, Nigel Hawthorne, Lance Henriksen, Wayne Knight, Rosie O'Donnell, Alex D. Linz, Beth Anderson, Jack Angel, Joseph Ashton, Bob Bergen, Rodger Bumpass, Lily Collins, Kat Cressida, Jim Cummings, Aria Noelle Curzon, Jennifer Darling, Debi Derryberry, Patti Deutsch, Paul Eiding, Blake McIver Ewing, Sam Gifaldi, Micah Hauptman, Sherry Lynn, Danny Mann, Jason Marsden, Mickie T. McGowan, Phil Proctor, Ian Redford, Chris Sanders, Brianne Siddall, Shane Sweet, Erik von Detten, Joe Whyte, Danielle Wiener, Frank Welker, April Winchell, Phil Collins, Billy Warren Bodine, Hillary Brooks, Taylor Dempsey, Francesca Falcone, Michael Geiger, Scott Martin Gershin, Amy Gleason, Jackie Gonneau, Debbie Hall, Jonnie Hall, Sandie Hall, Tina Halvorson, Linda Harmon, Karen Harper, Jennifer L. Hughes, Grady Hutt, Luana Jackman, Adam Karpel, Theo Lebow, Brandon Lucas, Ricky Lucchese, James Lively, Melissa Mackay, Ilana Marks, Donna Medine, Nils Montan, Bobbi Page, Brandon Pollard, Scott Record, Michael Reagan, Jessica Rotter, Stephanie Sawyer, Laurie Schillinger, Frank Simms, Susan Stevens Logan, Tiffany Takara, Dominic Thiroux, Jamie Torcellini || Adventure, Comedy, Drama, Family || Animation", "| An Ideal Husband || Miramax Films || Oliver Parker (director/screenplay); Rupert Everett, Julianne Moore, Peter Vaughan, Minnie Driver, Cate Blanchett, Jeremy Northam, John Wood, Ben Pullen, Marsha Fitzalan, Lindsay Duncan, Neville Phillips, Nickolas Grace, Simon Russell Beale, Anna Patrick, Delia Lindsay || Comedy, Romance || Live action", "| South Park: Bigger, Longer & Uncut || Paramount Pictures / Warner Bros. Pictures / Comedy Central Films || Trey Parker (director/screenplay); Matt Stone, Pam Brady (screenplay); Trey Parker, Matt Stone, Mary Kay Bergman, Isaac Hayes, Jesse Howell, Bruce Howell, Deb Adair, Jennifer Howell, George Clooney, Brent Spiner, Minnie Driver, Dave Foley, Eric Idle, Nick Rhodes, Toddy E. Walters, Stewart Copeland, Mike Judge, Howard McGillin || Comedy, Musical || Animation", "| Princess Mononoke || Walt Disney Pictures / Studio Ghibli || Hayao Miyazaki (director/screenplay); Billy Crudup, Claire Danes, Minnie Driver, Billy Bob Thornton, Gillian Anderson, Keith David, Jada Pinkett Smith, Tara Charendoff, John DeMita, John DiMaggio, Debi Derryberry, Corey Burton, Julia Fletcher, Alex Fernandez, Jack Fletcher, Pat Fraley, John Hostetter, John Rafter Lee, Sherry Lynn, Matt K. Miller, Marnie Mosiman, Tress MacNeille, Matt McKenzie, Michael McShane, Dwight Schultz, Pamela Segall, Lewis Arquette, Mary Elizabeth McGlynn, Jessica Lynn, Adam Paul, David Rasner, K.T. Vogt || Epic, Fantasy, Action, Adventure || Animation", "* An Ideal Husband, directed by Oliver Parker, starring Cate Blanchett, Jeremy Northam, Rupert Everett, Julianne Moore and Minnie Driver (U.K.)", "* Tarzan, directed by Kevin Lima and Chris Buck, with the voices of Tony Goldwyn, Minnie Driver, Glenn Close, Brian Blessed, Nigel Hawthorne and Rosie O'Donnell"]}, {"page": "1970 in television", "response": ["|Minnie Driver"]}, {"page": "Nick Hornby", "response": ["About a Boy was adapted for television and aired on NBC from 22 February 2014 to 17 February 2015. The show was developed by Jason Katims and it is the second adaptation based on the 1998 novel. The series stars David Walton, Minnie Driver and Benjamin Stockham."]}, {"page": "1970 in film", "response": ["* January 31 - Minnie Driver, English actress"]}, {"page": "Oldham", "response": ["Oldham, though lacking in leisure and cultural amenities, is historically notable for its theatrical culture. Once having a peak of six \"fine\" theatres in 1908, Oldham is home to the Oldham Coliseum Theatre and the Oldham Theatre Workshop, which have facilitated the early careers of notable actors and writers, including Eric Sykes, Bernard Cribbins and Anne Kirkbride, daughter of acclaimed cartoonist Jack Kirkbride who worked for the Oldham Evening Chronicle. Oldham Coliseum Theatre is one of Britain's last remaining repertory theatres; Charlie Chaplin and Stan Laurel performed there in the early 20th century, and contemporary actors such as Ralph Fiennes and Minnie Driver, among others, have appeared more recently."]}, {"page": "Pierce Brosnan", "response": ["In 2018, Brosnan co-starred with Guy Pearce and Minnie Driver in a mystery thriller film called Spinning Man, based on George Harrar's novel of the same name. He later reprised his role as Sam Carmichael in the sequel to Catherine Johnson's Mamma Mia!, entitled Mamma Mia! Here We Go Again, along with the rest of the cast members from the first film. He also had a supporting role in the action thriller headlined by Dave Bautista in Final Score."]}, {"page": "Maeve Binchy", "response": ["*Circle of Friends (1995 film) – Hollywood film starring Chris O'Donnell and Minnie Driver, based on Binchy's fifth novel, Circle of Friends (1990) with a radical change of ending."]}, {"page": "Alan Cumming", "response": ["Cumming made his film debut in Gillies MacKinnon's short film Passing Glory in 1986. His feature film debut came in 1992 when he starred alongside Sandrine Bonnaire and Bruno Ganz in Ian Sellar's Prague, which premiered at the Cannes Film Festival and earned him the Best Actor award at the Atlantic Film Festival and a Scottish BAFTA Best Actor nomination. American audiences first saw him portraying the smarmy Sean Walsh, an unwanted suitor of Minnie Driver's character, in Circle of Friends, an Irish film released in 1995. Also in 1995 he played Boris Ivanovih Grishenko in the James Bond film GoldenEye. He also played Mr. Elton in Emma in 1996."]}, {"page": "List of individual apes", "response": ["* Kwanza (or Kwan), a gorilla, played Sidney in the romance movie Return to Me (2000) with Minnie Driver and David Duchovny. Kwan resides at Lincoln Park Zoo in Chicago."]}, {"page": "South Park: Bigger, Longer & Uncut", "response": ["* Minnie Driver as Brooke Shields", "As in the television series, most of the characters are voiced by Parker, Stone, and Mary Kay Bergman. Isaac Hayes reprised his role as Chef, and audio samples of staff children Jesse Howell, Anthony Cross-Thomas and Franchesca Clifford were used for the voice of Ike Broflovski. Guest voices for the film include George Clooney as Dr. Gouache, Brent Spiner as Conan O'Brien, Minnie Driver as Brooke Shields, Eric Idle as Dr. Vosnocker, and Dave Foley as brothers Alec, Billy, Daniel and Stephen Baldwin."]}, {"page": "2004 in music", "response": ["| Everything I've Got in My Pocket || Minnie Driver ||-"]}, {"page": "GoldenEye", "response": ["* Minnie Driver as Irina"]}, {"page": "Kate Beckinsale", "response": ["| British Supporting Actress of the Year (tied with Minnie Driver)"]}, {"page": "The Phantom of the Opera (1986 musical)", "response": ["A film adaptation, directed by Joel Schumacher and starring Gerard Butler as the Phantom, Emmy Rossum as Christine, Patrick Wilson as Raoul, Minnie Driver as Carlotta, and Miranda Richardson as Madame Giry, opened on 22 December 2004 in the US."]}, {"page": "The Phantom of the Opera (2004 film)", "response": ["The Phantom of the Opera is a 2004 musical romantic drama film based on Andrew Lloyd Webber's 1986 musical of the same name, which in turn is based on the 1910 French novel Le Fantôme de l'Opéra by Gaston Leroux. Produced and co-written by Lloyd Webber and directed by Joel Schumacher, it stars Gerard Butler in the title role, with Emmy Rossum, Patrick Wilson, Miranda Richardson, Minnie Driver, and Jennifer Ellison in supporting roles.", "* Minnie Driver as Carlotta Giudicelli", "Katie Holmes, who began working with a vocal coach, was the front-runner for Christine Daaé in March 2003. She was later replaced by Anne Hathaway, a classically trained soprano, in 2004. However, Hathaway dropped out of the role because the production schedule of the film overlapped with The Princess Diaries 2: Royal Engagement, which she was contractually obligated to make. Hathaway was then replaced with Emmy Rossum. The actress modeled the relationship between the Phantom and Christine after Suzanne Farrell and George Balanchine. Patrick Wilson was cast as Raoul based on his previous Broadway theatre career. For the role of Carlotta, Minnie Driver devised an over-the-top, camp performance as the egotistical prima donna. Despite also lacking singing experience, Ciarán Hinds was cast by Schumacher as Richard Firmin; the two had previously worked together on Veronica Guerin.The Making of The Phantom of the Opera, [DVD, 2005], Warner Home Video Ramin Karimloo, who later played the Phantom as well as Raoul on London's West End,  briefly appears as the portrait of Gustave Daaé, Christine's father."]}, {"page": "Lara Croft", "response": ["GameTap released Revisioned: Tomb Raider in 2007 via the GameTap TV section of its website. The web series is a collection of ten short animated films that features re-imagined versions of Croft by well-known animators, comic book artists, and writers, including Jim Lee, Warren Ellis, and Peter Chung. Episodes ranged from five to seven and half minutes in length, featuring Minnie Driver as Croft. The creative staff was given considerable freedom to re-interpret the character; they did not consult the video game designers, but were given a guide listing acceptable and unacceptable practices."]}, {"page": "The Day Today", "response": ["The programme occasionally features producer Armando Iannucci and writer Peter Baynham, the latter playing Gay Desk reporter Colin Poppshed, among other characters. John Thomson, Graham Linehan, Tony Haase, and Minnie Driver also appear. Michael Alexander St John provides the voiceover stings, as he did in On the Hour.Emily, Smith, The Steve Coogan Handbook, p.354", "The Day Today also features appearances by Armando Iannucci, Peter Baynham, Jean Ainslie, John Thomson, Graham Linehan, Alan Stocks and Minnie Driver."]}, {"page": "Devil's Night", "response": ["* In the 1997 film Grosse Pointe Blank, Debbie (Minnie Driver) refers to the reason why she is living with her father is because her apartment was burned on Devil's Night."]}, {"page": "FX (TV channel)", "response": ["In 2006, FX debuted two new series, the reality series Black. White. and the drama Thief; neither series was picked up for a second season. During 2007, FX introduced three new dramas: Dirt, starring Courteney Cox; The Riches, starring Eddie Izzard and Minnie Driver; and Damages, starring Glenn Close, Ted Danson and Rose Byrne. All three performed well in the ratings and were renewed for second seasons. By 2008, FX was available in 90.6 million homes in the U.S."]}]}}