{"wiki_id": "http://www.wikidata.org/entity/Q229184", "itemLabel": "Lily Collins", "itemDescription": "British-American actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Lily_Collins", "wikipedia_page": {"main": "Lily Jane Collins (born 18 March 1989) is a British-American actress and model. Born in Guildford, Surrey and raised in Los Angeles, Collins began performing on screen at the age of two in the BBC sitcom Growing Pains. In the late 2000s, Collins began acting and modelling more regularly, and she had a career breakthrough with her performance in the sports-drama film The Blind Side, which was the third highest-grossing film of 2009. She went on to appear in leading roles across feature films such as the sci-fi action-horror Priest (2011), the psychological action-thriller Abduction (2011), the fantasy Mirror Mirror (2012), the urban fantasy The Mortal Instruments: City of Bones (2013), and the independent romantic comedies Stuck in Love (2012), The English Teacher (2013), and Love, Rosie (2014).\nCollins was critically acclaimed for her roles as Marla Mabrey in the comedy Rules Don't Apply (2016), which earned her a nomination for the Golden Globe Award for Best Actress – Motion Picture Musical or Comedy, and for her portrayal of a young adult with anorexia in the controversial Netflix drama To the Bone (2017). She has also achieved recognition for her work in biographical films: she starred as Liz Kendall in the Netflix drama Extremely Wicked, Shockingly Evil and Vile (2019), as J.R.R. Tolkien's wife Edith in Tolkien (2019), and as Rita Alexander in Mank (2020), the latter of which was a critical success, earning 10 Academy Award nominations.\nCollins played Fantine in the BBC miniseries adaptation of Les Misérables (2018–2019), and, since 2020, she has portrayed Emily Cooper in the Netflix series Emily in Paris. For the latter, she received a nomination for the Golden Globe Award for Best Actress – Television Series Musical or Comedy. She made her writing debut with Unfiltered: No Shame, No Regrets, Just Me (2017) in which she discussed her struggles with mental health, including an eating disorder she suffered as a teenager.", "link_mentions": [{"page": "Julia Roberts", "response": ["In 2010, Roberts played an U.S. Army captain on a one-day leave, as part of a large ensemble cast, in the romantic comedy Valentine's Day, and starred as an author finding herself following a divorce in the film adaptation of Eat Pray Love. While she received $3 million up front against 3 percent of the gross for her six-minute role in Valentine's Day, Eat Pray Love had the highest debut at the box office for Roberts in a top-billed role since America's Sweethearts. She appeared as the teacher of a middle-aged man returning to education in the romantic comedy Larry Crowne, opposite Tom Hanks, who also served as the director. The film was poorly received by critics and audiences, although Roberts's comedic performance was praised. In Mirror Mirror (2012), the Tarsem Singh adaptation of Snow White, Roberts portrayed Queen Clementianna, Snow White's evil stepmother, opposite Lily Collins. Peter Travers of Rolling Stone felt that she tried \"way too hard\" in her role, while Katey Rich of Cinema Blend observed that she \"takes relish in her wicked [portrayal] but could have gone even further with it\". Mirror Mirror made $183 million globally."]}, {"page": "March 18", "response": ["*  1989   – Lily Collins, English-American actress"]}, {"page": "University of Southern California", "response": ["File:Tolkien (47748801472) Cropped.jpg|Lily Collins"]}, {"page": "1989", "response": ["** Lily Collins, British-born American actress"]}, {"page": "Les Misérables", "response": ["* A 2018 British TV series by Andrew Davies, starring Dominic West, David Oyelowo and Lily Collins."]}, {"page": "Warren Beatty", "response": ["Rules Don't Apply (2016), is a fictionalized true-life romantic comedy about Howard Hughes, set in 1958 Hollywood and Las Vegas.Archived at Ghostarchive and the Wayback Machine:  It stars Beatty, who wrote, co-produced and directed the film. It co-stars Alden Ehrenreich and Lily Collins, with supporting actors including Annette Bening, Alec Baldwin, Matthew Broderick, Candice Bergen, Ed Harris and Martin Sheen. Some have said that Beatty's film is 40 years in the making. In the mid-1970s, Beatty signed a contract with Warner Bros. to star in, produce, write, and possibly direct a film about Howard Hughes. The project was put on hold when Beatty began Heaven Can Wait. Initially, Beatty planned to film the life story of John Reed and Hughes back-to-back, but as he was getting deeper into the project, he eventually focused primarily on the Reed film Reds. In June 2011, it was reported that Beatty would produce, write, direct and star in a film about Hughes, focusing on an affair he had with a younger woman in the final years of his life. During this period, Beatty interviewed actors to star in his ensemble cast. He met with Andrew Garfield, Alec Baldwin, Owen Wilson, Justin Timberlake, Shia LaBeouf, Jack Nicholson, Evan Rachel Wood, Rooney Mara, and Felicity Jones. It was released on November 23, 2016, and was Beatty's first film in 15 years.  Rotten Tomatoes' \"Top Critics\" gave the film a 63% \"Fresh\" rating, with one review calling it \"hugely entertaining.\" Another review said that \"the wait was worth it.\" "]}, {"page": "Phil Collins", "response": ["In 1984, Collins married American-born Jill Tavelman. They have one daughter, Lily Collins (b. 1989), who became an actress. The marriage encountered problems that  culminated in Collins twice having an affair with Lavinia Lang, a former drama school classmate, while touring with Genesis in 1992. The two were previously engaged, but the relationship ended before they married. In 1994, Collins openly stated that he had fallen out of love with Tavelman and had filed for divorce, which finalised in 1996. As part of the settlement, Collins paid £17 million to Tavelman."]}, {"page": "Snow White", "response": ["*Mirror Mirror (2012), starring Julia Roberts as the Evil Queen Clementianna, Lily Collins as Snow White, Armie Hammer as Prince Andrew Alcott, and Nathan Lane as Brighton, the Queen's majordomo."]}, {"page": "1999 in film", "response": ["| Tarzan || Walt Disney Pictures || Chris Buck, Kevin Lima (directors); Tab Murphy, Bob Tzudiker, Noni White (screenplay); Tony Goldwyn, Minnie Driver, Brian Blessed, Glenn Close, Nigel Hawthorne, Lance Henriksen, Wayne Knight, Rosie O'Donnell, Alex D. Linz, Beth Anderson, Jack Angel, Joseph Ashton, Bob Bergen, Rodger Bumpass, Lily Collins, Kat Cressida, Jim Cummings, Aria Noelle Curzon, Jennifer Darling, Debi Derryberry, Patti Deutsch, Paul Eiding, Blake McIver Ewing, Sam Gifaldi, Micah Hauptman, Sherry Lynn, Danny Mann, Jason Marsden, Mickie T. McGowan, Phil Proctor, Ian Redford, Chris Sanders, Brianne Siddall, Shane Sweet, Erik von Detten, Joe Whyte, Danielle Wiener, Frank Welker, April Winchell, Phil Collins, Billy Warren Bodine, Hillary Brooks, Taylor Dempsey, Francesca Falcone, Michael Geiger, Scott Martin Gershin, Amy Gleason, Jackie Gonneau, Debbie Hall, Jonnie Hall, Sandie Hall, Tina Halvorson, Linda Harmon, Karen Harper, Jennifer L. Hughes, Grady Hutt, Luana Jackman, Adam Karpel, Theo Lebow, Brandon Lucas, Ricky Lucchese, James Lively, Melissa Mackay, Ilana Marks, Donna Medine, Nils Montan, Bobbi Page, Brandon Pollard, Scott Record, Michael Reagan, Jessica Rotter, Stephanie Sawyer, Laurie Schillinger, Frank Simms, Susan Stevens Logan, Tiffany Takara, Dominic Thiroux, Jamie Torcellini || Adventure, Comedy, Drama, Family || Animation"]}, {"page": "1989 in American television", "response": ["|Lily Collins"]}, {"page": "1989 in film", "response": ["* March 18 – Lily Collins, English-American actress"]}, {"page": "Ed Harris", "response": ["In 2016, he also began playing the villainous Man in Black in HBO's sci-fi thriller series Westworld, and had a co-starring role in the ensemble cast of Warren Beatty's romantic comedy drama Rules Don't Apply, with Lily Collins and Alden Ehrenreich. In 2017, he appeared in Dean Devlin's sci-fi film Geostorm, alongside Gerard Butler and Andy García. Harris had been previously set to star in Alejandro González Iñárritu's Starz drama series The One Percent with Hilary Swank and Ed Helms."]}, {"page": "Golden Globe Award for Best Actress – Motion Picture Comedy or Musical", "response": ["| Lily Collins || Marla Mabrey || Rules Don't Apply"]}, {"page": "Gary Oldman", "response": ["In 2020, Oldman starred as Citizen Kane co-writer Herman J. Mankiewicz in David Fincher's biographical drama black-and-white Netflix movie Mank, which follows Mankiewicz's tumultuous development of the script for Citizen Kane alongside director Orson Welles. The film co-stars Amanda Seyfried, Lily Collins, and Charles Dance. Mank had a limited theatrical release on 13 November, and began streaming on Netflix on 4 December. It received positive reviews, earning 88% on Rotten Tomatoes with the critics consensus being, \"Sharply written and brilliantly performed, Mank peers behind the scenes of Citizen Kane to tell an old Hollywood story that could end up being a classic in its own right.\" In 2021, Oldman starred opposite Armie Hammer in Crisis and in Joe Wright's The Woman in the Window, alongside Amy Adams."]}, {"page": "The Last Tycoon", "response": ["*2016: On November 19, 2013, HBO announced that it planned to adapt The Last Tycoon (TV series) with Billy Ray writing the script. On November 7, 2014, Amazon Studios picked up Billy Ray's adaptation after HBO passed it off and announced it would be produced by Sony Pictures Television. On November 23, 2015, actor Matt Bomer was cast as Monroe Stahr, Lily Collins as Cecelia Brady, and it was announced that Ray would write and direct the pilot episode. The pilot was released June 17, 2016. The first season was released on July 28, 2017.  Plans for the second season were cancelled in September 2017."]}, {"page": "Haley Joel Osment", "response": ["In 2019, Osment had a supporting role in the Netflix film Extremely Wicked, Shockingly Evil and Vile, starring alongside Lily Collins whose character Liz follows the prosecution of Ted Bundy, played by Zac Efron. Osment also appeared as the character \"Mesmer\" in the Amazon series The Boys, and as Dr. Stu Camillo in the Seth Rogen and Evan Goldberg produced Hulu series Future Man."]}, {"page": "Edith Tolkien", "response": ["Edith Tolkien was portrayed by Lily Collins in the biopic Tolkien, released in 2019."]}, {"page": "Harvard-Westlake School", "response": ["* Lily Collins, actress, model, host"]}, {"page": "Matt Bomer", "response": ["Bomer appeared in two films in 2016. He played for the first time a villain in the movie The Nice Guys, as a psycho killer named John Boy. Directed by Shane Black, starring Ryan Gosling and Russell Crowe. Gosling and Bomer were at the premiere of the film at the Cannes Film Festival in 2016. The Nice Guys generated positive reviews and enjoyed moderate box office success. His next role was as Matthew Cullen in Antoine Fuqua's Western action film  The Magnificent Seven, playing the farmer husband of Haley Bennett's character. The film received mixed reviews from critics, although the cast and action sequences were praised, and grossed $162.4 million worldwide. He was cast as Monroe Stahr, the lead in Billy Ray's 2016 series The Last Tycoon, loosely based on the F. Scott Fitzgerald novel of the same name, along with actors Kelsey Grammer, Lily Collins, and Dominique McElligott."]}, {"page": "Golden Globe Award for Best Actress – Television Series Musical or Comedy", "response": ["|Lily Collins"]}, {"page": "Nylon (magazine)", "response": ["Cover models have included: Demi Lovato, Christina Aguilera, The Horrors, Avril Lavigne, Selena Gomez, Lily Allen, Paris Hilton, The Kills, Camilla Belle, Karen O, Evan Rachel Wood, Mary-Kate Olsen, Lea Michele, Lil' Kim, Zooey Deschanel, Kristen Stewart, Rachel Bilson, Scarlett Johansson, Cory Kennedy, Mischa Barton, Christina Ricci, Leighton Meester, Blake Lively, Taylor Momsen, The White Stripes, Sienna Miller, Nicole Richie, Megan Fox, Hilary Duff, Emma Stone, Lindsay Lohan, MIA, Zoe Saldana, Drew Barrymore, Jessica Szohr, Mila Kunis,Walansky, Aly (November 30, 2010) \"Mila Kunis Covers Nylon Magazine December/January Issue\" . MyGloss.com. Emily Browning, Katy Perry, Jena Malone, Abbie Cornish, Vanessa Hudgens, Jamie Chung, Selena Gomez, Emma Roberts,\"Nylon TV + Emma Roberts\" . NylonMag.com. April 27, 2011. Chloë Grace Moretz,\"Young Hollywood 2011 – Chloe Moretz\". YouTube: NylonMag official channel. April 26, 2011. Lily Collins, Hayley Williams, Marina, and Lana Del Rey."]}, {"page": "Lancôme", "response": ["Other renowned actresses have also worked with the brand, including Juliette Binoche, Uma Thurman, Drew Barrymore, Mena Suvari, Laura Morante, Kate Winslet, Anne Hathaway, Julia Roberts, Penélope Cruz, Emma Watson, and currently Lily Collins, Lupita Nyong'o, and Zendaya. Clive Owen was the first male spokesperson for Lancôme's Men's skincare range and the fragrance Hypnôse Homme."]}, {"page": "Tarzan (1999 film)", "response": ["* Lily Collins as Baby Ape"]}, {"page": "Lena Headey", "response": ["Headey joined again with Ethan Hawke to star in The Purge (2013), a \"micro-budget\" horror film, in which she took on the role of the matriarch of a family who find themselves endangered by a gang of murderers during the annual Purge, a night during which all crime, even murder, is temporarily legal. The film at number one position in the United States, grossing over US$36 million over the weekend; it eventually made US$89.3 million worldwide. She next played shadowhunter Jocelyn Fray/Jocelyn Fairchild in The Mortal Instruments: City of Bones (also 2013), based on the first book of The Mortal Instruments series by Cassandra Clare, and opposite Lily Collins and Jamie Campbell Bower. The film flopped at the box office, and as a result, plans for sequels were eventually canceled."]}, {"page": "Cecelia Ahern", "response": ["Her second book, Where Rainbows End (U.S. Love, Rosie), also reached number 1 in Ireland and the UK, and won the German CORINE Award in 2005. It was adapted as a motion picture titled Love, Rosie which was released in 2014, directed by Christian Ditter and starring Lily Collins and Sam Claflin."]}, {"page": "Joe Berlinger", "response": ["In 2019, Berlinger re-entered the world of narrative film and directed Extremely Wicked, Shockingly Evil and Vile, his second feature. The film chronicles the life of serial killer Ted Bundy and his longtime girlfriend Elizabeth Kendall. Starring Zac Efron, Lily Collins, Jim Parsons, John Malkovich, Jeffrey Donovan, Haley Joel Osment and Angela Sarafyan, the film screened at the 2019 Sundance Film Festival in January."]}, {"page": "Lil' JJ", "response": ["In 2007, he starred in the Nickelodeon series Just Jordan as Jordan Lewis. In 2008, he, Lily Collins, and Pick Boy appeared together on Nickelodeon for special events. Also Lil' JJ has appeared in the ABC television series The Secret Life of the American Teenager."]}, {"page": "Critics' Choice Movie Award for Best Song", "response": ["| Written by Eddie Arkin & Lorraine Feather; Performed by Lily Collins"]}, {"page": "Sam Troughton", "response": ["In 2020, Troughton starred the biographical comedy drama film Mank, alongside a cast which included Gary Oldman, Amanda Seyfried, Lily Collins and Charles Dance. In 2021, Troughton appeared as Mr.Wilder, the community service boss, in The Outlaws, a BBC series created by and starring Stephen Merchant also featuring Christopher Walken."]}]}}