{"wiki_id": "http://www.wikidata.org/entity/Q22958622", "itemLabel": "Terry Breverton", "itemDescription": "British businessman and academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Terry_Breverton", "wikipedia_page": {"main": "Terry D. Breverton (born 1946) is a British former businessman and academic who has written many books on subjects mainly related to Wales and seamen.", "link_mentions": [{"page": "Owain Glyndŵr", "response": ["* Terry Breverton: Owain Glyndŵr: The Story of the Last Prince of Wales (2013)."]}, {"page": "Roger Williams (soldier)", "response": ["Williams was in England to assist in the fight against the Spanish Armada in 1588. Williams accompanied Sir Francis Drake in the expedition to Spain and Portugal 1589, and later fought on behalf of the French Huguenots. He met the Earl of Essex in 1589, and the two became close when they were sent by Queen Elizabeth to lead an army as allies of Henry of Navarre against the Catholic League during the Spanish occupation of Brittany in 1592. He went on to serve Henry against the League during the late 1580s and 1590s, scored a major victory at the Battle of Arques.Terry Breverton, \"Williams, Roger\" in Wales: A Historical Companion, Amberley, 2012. After Essex returned to England Williams became overall commander of the English forces supporting Henry and de facto envoy of the Queen.Wagner, John, Historical Dictionary of the Elizabethan World: Britain, Ireland, Europe and America, Routledge, p. 327. Shortly afterwards he captured Aumerle with only 600 men. During the Siege of Rouen in 1592, he almost killed Albanian-Italian leader Giorgio Basta in personal combat, slicing his neck and driving him and his men from the field.Lawrence, David, The Complete Soldier: Military Books and Military Culture in Early Stuart England, 1603–1645, Brill, 2009, p. 66. These actions made Williams a famous hero in England, and pamphlets of his exploits were published. Sir Henry Umton stated that King Henry was full of praise for Williams and his men, \"I never heard him give more honour to any service nor to any man than he doth to Sir Roger Williams and the rest\".Motley, John Lothrop, History of the United Netherlands: From the Death of William the Silent to the Twelve Years' Truce – 1609, Cambridge University Press, 2011, p. 145."]}, {"page": "Preseli Hills", "response": ["In 2000 Terry Breverton, a lecturer at Cardiff University, in promoting a book he had published, suggested that the rock star Elvis Presley's ancestors came from the Preseli Hills and may have had links to a chapel at St Elvis."]}, {"page": "Brehon", "response": ["The Martyrology of Tallaght lists the feast dates of five principal  Pre-Patrician Christian Saints as being Abbán of Moyarny, Ailbe of Emly, Ciarán of Saigir, Declán of Ardmore and Ibar of Beggerin. All are said to be originally from Munster and also as being the earliest recorded Christian Saints that had existed in Ireland prior to the arrival of Saint Patrick. Most notable of the five is Ailbe of Emly, he is the patron saint of Munster and also known as St Eilfyw in Wales, where he founded a tiny community called St Elvis in Wales believed to have been one of the smallest parishes to be established in Britain, which is named after him, its just four miles north of the ancient city of St Davids. Its been suggested by certain scholars that it was Saint Ailbe who baptimized Saint David 454 AD at Port Clais in Dyfed. In 2000 Terry Breverton, a lecturer at Cardiff University, while promoting his book, suggested that the rock star Elvis Presley's ancestral roots came from the Celtic prehistoric site of Preseli Hills in Pembrokeshire and may have had links to a chapel at St Elvis."]}, {"page": "Ailbe of Emly", "response": ["Late Welsh sourcesp.67 (no.92), p.70 (no. 35) in Bartrum, P.C.(1966): Early Welsh Genealogical Tracts, Cardiff: UWP. give him a British ancestry. Thus the 16th c. Achau’r Saint records \"Eilvyw a Dirdan Saint Breudan\" (variant : \"Breudain\") while a 16thc. Manuscript of  Bonedd y Saint  records \"Ailvyw vab Dirdan\". This would make him a descendant of Guorthemir (Modern Welsh: Gwerthefyr; English: Vortimer the Blessed), and a cousin of saints David, Cybi, and Sadyrnin.\"Saint Elvis\" in Terry Breverton's Wales: A Historical Companion, pp. 164 f. Amberley Publishing (Stroud), 2009."]}, {"page": "Battle of Arques", "response": ["Henry's rescue came from the sea on 23 September: 4,000 English soldiers under Roger Williams sent by Queen Elizabeth had left England in several waves over three days.Terry Breverton, \"Williams, Roger\" in Wales: A Historical Companion, Amberley, 2012.  Seeing these reinforcements, the Duke of Mayenne decided to retreat, leaving Henry IV victorious."]}, {"page": "Elvis (name)", "response": ["The saint was also a popular figure in medieval Wales, where he was claimed to be of British origin,\"Saint Elvis\" in Terry Breverton's Wales: A Historical Companion, pp. 164 f. Amberley Publishing (Stroud), 2009."]}, {"page": "St Elvis, Pembrokeshire", "response": ["GENUKI notes church and chapel records dating from the 19th century, with two farms. There is still a St Elvis farm (Vagwr Eilw\"Saint Elvis\" in Terry Breverton's Wales: A Historical Companion, pp. 164 f. Amberley Publishing (Stroud), 2009.) and the ruins of the earlier monastery and church, covered with blackthorn. St Elvis's Well is also nearby and continued to produce 360 gallons an hour amid the 1976 drought."]}, {"page": "Llandderfel", "response": ["A Celtic Llan site, founded in the early 6th century by Saint Derfel, the church was rebuilt probably in the early 16th century. A large wooden image of the saint was sent to London in 1538 and burned with John Forest in Smithfield, however the now headless carved red stag and staff are still preserved within the porch.Wales' 1000 Best Heritage Sites by Terry Breverton, Amberley Publishing Limited, 2013, Parish Church of St Derfel, Llandderfel, British Listed Buildings"]}]}}