{"wiki_id": "http://www.wikidata.org/entity/Q22980469", "itemLabel": "Anthony Abell", "itemDescription": "British colonial official", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Abell", "wikipedia_page": {"main": "Sir Anthony Foster Abell  (11 December 1906 – 8 October 1994) was a British colonial official who was Governor of Sarawak and High Commissioner to Brunei.", "link_mentions": [{"page": "Omar Ali Saifuddien III", "response": ["He promoted the use of English extensively among his people. He was instrumental in setting up the first English government school in 1953 namely SOAS College followed by STIPRI girls school and Anthony Abell College. He introduced the scholarship scheme and sent his people to study in the UK to prepare his people to lead the country’s administration. Even though the first Bruneian only got a degree in 1959, Sultan Omar Ali Saifuddin III was quickly able to educate and train enough local people to manage the state affairs.", "* On 25 September 1958, the Sultan received the visit of Syed Putra of Perlis, Hisamuddin of Selangor; Abu Bakar of Pahang and Sir Anthony Abell Governor of Sarawak, who attended the Berkhatan (circumcision) ceremony of the Sultan's sons, Prince Hassanal Bolkiah and Prince Mohamed Bolkiah."]}, {"page": "Cobbold Commission", "response": ["* Anthony Abell, former Governor of Sarawak", ":::B—Recommendations by Sir Anthony Abell and Sir David Watherston"]}, {"page": "20-point agreement", "response": ["The British Government, working with the Federation of Malaya Government, appointed a Commission of Enquiry for North Borneo and Sarawak in January 1962 to determine if the people supported the proposal to create a Federation of Malaysia. The five-man team, which comprised two Malayans and three British representatives, was headed by Lord Cobbold.Cobbold was Governor of the Bank of England from 1949 to 1961. The other members were Wong Pow Nee, Chief Minister of Penang, Mohammed Ghazali Shafie, Permanent Secretary to the Ministry of Foreign Affairs, Anthony Abell, former Governor or Sarawak, and David Watherston, former Chief Secretary of the Federation of Malaya. An inter-governmental committee (The Lansdowne Committee) was appointed to work out the final details of the Malaysia Agreement. Lord Lansdowne served for Britain and Tun Abdul Razak, Deputy Prime Minister of the Federation of Malaya served for Malaya."]}, {"page": "Gentleman Usher of the Blue Rod", "response": ["*1972–1979: Sir Anthony Abell, KCMG"]}, {"page": "Tua Pek Kong Temple, Sibu", "response": ["In 1957, the temple was reconstructed into a concrete structure and was declared open by the then Governor of Sarawak, Sir Anthony Abell. It was a grand occasion for the Sibu Town as the British Royal dignitaries including the Resident attended the ceremony. Another renovation on both wings of the temple was being carried out in 1979 and the roof of temple was changed from \"belian\" (Eusideroxylon zwageri) wood into concrete with glazed roofing tiles; the ridge or roof and column were decorated with traditional dragon and phoenix statues. In 1982, the temple management committee planning to re-build the rear part and construct a 7-storey pagoda for the worship of the Goddess of Mercy where the plan is being realised in 1987 through the aid from Sarawak state government and the temple worshippers. The new pagoda followed closely the traditional Chinese pagoda architecture and subsequently became one of the landmark for Sibu. The renovated building was declared open in 1989."]}, {"page": "List of High Commissioners of the United Kingdom to Brunei", "response": ["*1950–1959: Anthony Abell"]}, {"page": "Malaysia Agreement", "response": ["British Government, working with the Federation of Malaya Government, appointed a Commission of Enquiry for North Borneo and Sarawak in January 1962 to determine if the people supported the proposal to create a Federation of Malaysia. The five-man team, which comprised two Malayans and three British representatives, was headed by Lord Cobbold.Cobbold was Governor of the Bank of England from 1949 to 1961. The other members were Wong Pow Nee, Chief Minister of Penang, Mohammed Ghazali Shafie, Permanent Secretary to the Ministry of Foreign Affairs, Anthony Abell, former Governor or Sarawak, and David Watherston, former Chief Secretary of the Federation of Malaya."]}, {"page": "Abell (surname)", "response": ["*Sir Anthony Abell (1906–1994), British colonial official, Governor of Sarawak"]}, {"page": "Crown Colony of Sarawak", "response": ["| 3. || Anthony Abell || 4 April 1950 || 15 November 1959 || Originally appointed for the term of 3 years only, but his term was extended to 1959. He was later a member of the Cobbold Commission."]}, {"page": "List of roads in Kuching", "response": ["| Named after the 3rd Governor of Sarawak, Sir Anthony Abell."]}, {"page": "Wong Pow Nee", "response": ["He was a member of the Cobbold Commission formed in 1962 that ascertained the views of residents in Sabah (then North Borneo) and Sarawak about joining the Federation of Malaysia preparing the framework for the eventual incorporation of Sabah and Sarawak in 1963. Lord Cobbold headed the Commission. Other members of the Commission assisting him, together with Wong Pow Nee, were Tan Sri Ghazali Shafiee, Sir Anthony Abell and Sir David Watherston. The result of their work was the Cobbold Commission Report 1962.Lim 2010 Proudly he read out the proclamation of the formation of Malaysia at the Esplanade, at George Town in 1963"]}, {"page": "Sarawak Independence Day", "response": ["The Sultanate of Brunei granted the Raj of Sarawak to rule of the Brooke Dynasty in 1841, Sarawak was subsequently recognised as a sovereign nation by the United States (1850) and Great Britain (1864), and it voluntarily became a British protectorate (military protection) in 1888. After the end of World War II, the territory was briefly administered by the British Military Administration, then became a Crown Colony in 1946 when it was ceded to British Government by Charles Vyner Brooke. The transferring of the territory to colonial administration had led to major protests by Sarawakian citizens who wanted the independence of Sarawak to be restored. This led to the assassination of Duncan Stewart, the second governor of the Colony, by Rosli Dhobi, who was captured and subsequently hanged for murder. The position of the Governor was succeeded by Anthony Abell, who also became one of the members for the Cobbold Commission which brought Sarawak and North Borneo to the formation of the Federation of Malaysia."]}, {"page": "Treaty of Labuan", "response": ["In 1957, the British High Commissioner for Brunei Sir Anthony Abell made a proposal to the Brunei government and to the Secretary for the Colonies Alan Lennox-Boyd, in which the Crown Colony of Labuan was to be returned to Brunei after a long time since the island was ceded to Great Britain in December 1846. The Sultan did not agree with the proposal as he saw it as a motive by the Great Britain to accept the proposed merger of the three British Borneo Colonies of Brunei, Sabah and Sarawak into one administration.Muhammad Hadi Muhammad Melayong, Memoir of a Statesman, Bandar Seri Begawan: Brunei History Centre, Ministry of Youth, Culture and Sports, Negara Brunei Darussalam, 2009, p.81", "Sultan Omar Ali Saifuddien III demanded that the Island of Labuan be returned to Brunei alleging that the Treaty of Labuan expired after Labuan had been in possession of Great Britain for 100 years.Muhammad Hadi Muhammad Melayong, Memoir of a Statesman, Bandar Seri Begawan: Brunei History Centre, Ministry of Youth, Culture and Sports, Negara Brunei Darussalam, 2009, p.82 Since it was clearly stated in the Treaty that Labuan was ceded forever,Treaty of Labuan, Article 2: His Highness the Sultan hereby cedes in full sovereignty and property to Her Majesty the Queen of Great Britain and Ireland, Her Heirs and Successors for ever, the Island of Labuan and its dependencies, the Islets adjacent thereto. Sir Anthony Abell \"denied the validity of the Sultan's arguments and said that he did not expect the British government would support Brunei claim for the return of Labuan.\"Muhammad Hadi Muhammad Melayong, Memoir of a Statesman, Bandar Seri Begawan: Brunei History Centre, Ministry of Youth, Culture and Sports, Negara Brunei Darussalam, 2009, p.82 The talks between Brunei and Great Britain about the return of the island to Brunei continued until Labuan, together with Sarawak and North Borneo, joined the Federation of Malaysia in 1963.Muhammad Hadi Muhammad Melayong, Memoir of a Statesman, Bandar Seri Begawan: Brunei History Centre, Ministry of Youth, Culture and Sports, Negara Brunei Darussalam, 2009, p.82"]}, {"page": "Dennis White (colonial administrator)", "response": ["White was educated at Bradfield College, then joined the service of the Rajah of Sarawak in 1932. Before World War II he served in areas where the Dayak majority were suspicious of the government in Kuching, and he played an active part in winning over rebel leaders.\"Sir Dennis White\" (obituary), The Times, London, 4 November 1983, page 13 During the war he was a prisoner in Kuching, and afterwards, as one of the few experienced Sarawak officers to survive, he was closely involved in the difficult negotiations for Sarawak to be ceded to the British Crown. There was an anti-cession movement and the second Governor, Sir Duncan Stewart, was murdered shortly after he arrived; but a happier period followed the arrival of Sir Anthony Abell, the third Governor. White was then based in Sibu – \"his good knowledge of the Dayak and Malay languages was one of his attributes that endeared him to the local people.\""]}, {"page": "Abell, Anthony", "response": ["#redirectAnthony Abell"]}]}}