{"wiki_id": "http://www.wikidata.org/entity/Q229226", "itemLabel": "Elizabeth Gaskell", "itemDescription": "British author", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Gaskell", "wikipedia_page": {"main": "Elizabeth Cleghorn Gaskell (née Stevenson; 29 September 1810 – 12 November 1865), often referred to as Mrs Gaskell, was an English novelist, biographer and short story writer. Her novels offer a detailed portrait of the lives of many strata of Victorian society, including the very poor. Her work is of interest to social historians as well as readers of literature. Her first novel, Mary Barton, was published in 1848. Gaskell's The Life of Charlotte Brontë, published in 1857, was the first biography of Charlotte Brontë. In this biography, she wrote only of the moral, sophisticated things in Brontë’s life; the rest she left out, deciding that certain, more salacious aspects were better kept hidden. Among Gaskell's best known novels are Cranford (1851–53), North and South (1854–55), and Wives and Daughters (1865), each having been adapted for television by the BBC.", "link_mentions": [{"page": "Anne Brontë", "response": ["In Elizabeth Gaskell's biography of Charlotte, Patrick remembered Anne as precocious. Patrick said that when Anne was four years old he had asked her what a child most wanted and that she had said: \"age and experience\".Fraser, The Brontës, p. 31"]}, {"page": "Charlotte Brontë", "response": ["In view of the success of her novels, particularly Jane Eyre, Brontë was persuaded by her publisher to make occasional visits to London, where she revealed her true identity and began to move in more exalted social circles, becoming friends with Harriet Martineau and Elizabeth Gaskell, and acquainted with William Makepeace Thackeray and G.H. Lewes. She never left Haworth for more than a few weeks at a time, as she did not want to leave her ageing father.  Thackeray's daughter, writer Anne Isabella Thackeray Ritchie, recalled a visit to her father by Brontë:", "Brontë's friendship with Elizabeth Gaskell, while not particularly close, was significant in that Gaskell wrote the first biography of Brontë after her death in 1855.", "Before the publication of Villette, Brontë received an expected proposal of marriage from Arthur Bell Nicholls, her father's curate, who had long been in love with her. She initially turned down his proposal and her father objected to the union at least partly because of Nicholls's poor financial status. Elizabeth Gaskell, who believed that marriage provided \"clear and defined duties\" that were beneficial for a woman, encouraged Brontë to consider the positive aspects of such a union and tried to use her contacts to engineer an improvement in Nicholls's finances. According to James Pope-Hennessy in The Flight of Youth, it was the generosity of Richard Monckton Milnes that made the marriage possible. Brontë meanwhile was increasingly attracted to Nicholls and by January 1854 she had accepted his proposal. They gained the approval of her father by April and married in June. Her father Patrick had intended to give Charlotte away, but at the last minute decided he could not, and Charlotte had to make her way to the church without him. The married couple took their honeymoon in Banagher, County Offaly, Ireland. By all accounts, her marriage was a success and Brontë found herself very happy in a way that was new to her.", "Elizabeth Gaskell's biography The Life of Charlotte Brontë was published in 1857. It was an important step for a leading female novelist to write a biography of another, and Gaskell's approach was unusual in that, rather than analysing her subject's achievements, she concentrated on private details of Brontë's life, emphasising those aspects that countered the accusations of \"coarseness\" that had been levelled at her writing. The biography is frank in places, but omits details of Brontë's love for Héger, a married man, as being too much of an affront to contemporary morals and a likely source of distress to Brontë's father, widower, and friends. Mrs Gaskell also provided doubtful and inaccurate information about Patrick Brontë, claiming that he did not allow his children to eat meat. This is refuted by one of Emily Brontë's diary papers, in which she describes preparing meat and potatoes for dinner at the parsonage.Juliet Barker, The Brontës It has been argued that Gaskell's approach transferred the focus of attention away from the 'difficult' novels, not just Brontë's, but all the sisters', and began a process of sanctification of their private lives.", "* The Life of Charlotte Brontë, Elizabeth Gaskell, 1857"]}, {"page": "Cheshire", "response": ["Actors from Cheshire include Daniel Craig, Tim Curry, Pete Postlethwaite, Wendy Hiller, and Lewis McGibbon. The county has also been the origin of several acclaimed writers, including Hall Caine, Alan Garner, Elizabeth Gaskell, and most famously Lewis Carroll, who wrote Alice's Adventures in Wonderland and named its Cheshire Cat character after the county. Artists from Cheshire include ceramic artist Emma Bossons and sculptor/photographer Andy Goldsworthy."]}, {"page": "Emily Brontë", "response": ["Charlotte Brontë remains the primary source of information about Emily, although as an elder sister, writing publicly about her only shortly after her death, she is considered by certain scholars not to be a neutral witness. Stevie Davies believes that there is what might be called Charlotte's smoke-screen and argues that Emily evidently shocked her, to the point where she may even have doubted her sister's sanity. After Emily's death, Charlotte rewrote her character, history and even poems on a more acceptable (to her and the bourgeois reading public) model. Biographer Claire O'Callaghan suggests that the trajectory of Brontë's legacy was altered significantly by Elizabeth Gaskell’s biography of Charlotte, concerning not only because Gaskell did not visit Haworth until after Emily’s death, but also because Gaskell admits to disliking what she did know of Emily in her biography of Charlotte. As O'Callaghan and others have noted, Charlotte was Gaskell's primary source of information on Emily's life and may have exaggerated or fabricated Emily’s frailty and shyness to cast herself in the role of maternal saviour.", "Emily's unsociability and extremely shy nature have subsequently been reported many times.The Ladies' Repository, February 1861.Alexander, Sellars, The Art of the Brontës (1995), p. 100Gérin, Emily Brontë: a biography, p. 196 According to Norma Crandall, her \"warm, human aspect\" was \"usually revealed only in her love of nature and of animals\".Norma Crandall, Emily Brontë: a psychological portrait (1957), p. 81 In a similar description, Literary news (1883) states: \"[Emily] loved the solemn moors, she loved all wild, free creatures and things\",Pylodet, Leypoldt, Literary news (1883) Volume 4, p. 152 and critics attest that her love of the moors is manifest in Wuthering Heights.Brontë Society, The Brontës Then and Now (1947), p. 31 Over the years, Emily's love of nature has been the subject of many anecdotes. A newspaper dated 31 December 1899, gives the folksy account that \"with bird and beast [Emily] had the most intimate relations, and from her walks she often came with fledgling or young rabbit in hand, talking softly to it, quite sure, too, that it understood\".The Record-Union, \"Sacramento\", 31 December 1899. Elizabeth Gaskell, in her biography of Charlotte, told the story of Emily's punishing her pet dog Keeper for lying \"on the delicate white counterpane\" that covered one of the beds in the Parsonage. According to Gaskell, she struck him with her fists until he was \"half-blind\" with his eyes \"swelled up\". This story is apocryphal, and contradicts the following account of Emily's and Keeper's relationship:"]}, {"page": "Gothic fiction", "response": ["Elizabeth Gaskell's tales \"The Doom of the Griffiths\" (1858) \"Lois the Witch\", and \"The Grey Woman\" all employ one of the commonest themes of Gothic fiction: the power of ancestral sins to curse future generations, or the fear that they will."]}, {"page": "Louisa May Alcott", "response": ["In 1847, she and her family served as station masters on the Underground Railroad, when they housed a fugitive slave for one week and had discussions with Frederick Douglass. Alcott read and admired the \"Declaration of Sentiments\" published by the Seneca Falls Convention on women's rights, advocating for women's suffrage, and became the first woman to register to vote in Concord, Massachusetts in a school board election. The 1850s were hard times for the Alcotts, and in 1854 Louisa found solace at the Boston Theatre, where she wrote The Rival Prima Donnas, which she later burned due to a quarrel between the actresses on who would play what role. At one point in 1857, unable to find work and filled with despair, Alcott contemplated suicide. During that year, she read Elizabeth Gaskell's biography of Charlotte Brontë and found many parallels to her own life. In 1858, her younger sister Elizabeth died and her older sister Anna married a man named John Pratt. This felt to Alcott like a breaking up of their sisterhood."]}, {"page": "Manchester", "response": ["Manchester is a UNESCO City of Literature known for a \"radical literary history\". Manchester in the 19th century featured in works highlighting the changes that industrialisation had brought. They include Elizabeth Gaskell's novel Mary Barton: A Tale of Manchester Life (1848), and studies such as The Condition of the Working Class in England in 1844 by Friedrich Engels, while living and working here. Manchester was the meeting place of Engels and Karl Marx. The two began writing The Communist Manifesto in Chetham's Library – founded in 1653 and claiming to be the oldest public library in the English-speaking world. Elsewhere in the city, the John Rylands Library holds an extensive collection of early printing. The Rylands Library Papyrus P52, believed to be the earliest extant New Testament text, is on permanent display there."]}, {"page": "November 12", "response": ["*1865 – Elizabeth Gaskell, English author (b. 1810)"]}, {"page": "Walter Scott", "response": ["Emily Brontë's Wuthering Heights was influenced by the novels of Walter Scott.Elizabeth Gaskell The Life of Charlotte Brontë, London: Smith, Elder & Co., 1857, p.104. In particular, according to Juliet Barker, Rob Roy (1819) had a significant influence, which, though \"regarded as the archetypal Yorkshire novel ... owed as much, if not more, to Walter Scott's Border country\". Rob Roy is set \"in the wilds of Northumberland, among the uncouth and quarrelsome squirearchical Osbaldistones\", while Cathy Earnshaw \"has strong similarities with Diana Vernon, who is equally out of place among her boorish relations\" (Barker p. 501).Ian Brinton. Bronte's Wuthering Heights Reader's Guides. London : Continuum. 2010, p. 14. Quoting Barker, The Brontes. London: Weidenfeld and Nicholas, 1994."]}, {"page": "September 29", "response": ["*1810 – Elizabeth Gaskell, English author (d. 1865)"]}, {"page": "Unitarianism", "response": ["Notable Unitarians include classical composers Edvard Grieg and Béla Bartók; Ralph Waldo Emerson, Theodore Parker, Yveon Seon and Thomas Lamb Eliot in theology and ministry; Oliver Heaviside, Erasmus Darwin, Joseph Priestley, John Archibald Wheeler, Linus Pauling, Sir Isaac Newton and inventor Sir Francis Ronalds in science; George Boole in mathematics; Susan B. Anthony in civil government; Frances Ellen Watkins Harper, Whitney Young of the National Urban League, and Florence Nightingale in humanitarianism and social justice; John Bowring, Samuel Taylor Coleridge and Elizabeth Gaskell in literature; Frank Lloyd Wright in the arts; Josiah Wedgwood, Richard Peacock and Samuel Carter MP in industry; Thomas Starr King in ministry and politics; and Charles William Eliot in education. Julia Ward Howe was a leader in the woman suffrage movement, the first ever woman to be elected to the Academy of Arts and Letters, and author of the Battle Hymn of the Republic, volumes of poetry, and other writing. Although raised a Quaker, Ezra Cornell, founder of Cornell University in Ithaca, New York, attended the Unitarian church and was one of the founders of Ithaca's First Unitarian Church. Eramus Darwin Shattuck, a signatory to the Oregon State Constitution, founded the first Unitarian Church in Oregon in 1865.The Centennial History of Oregon 1811–1912 by Joseph Gaston, p. 582."]}, {"page": "Western canon", "response": ["However, in Britain and America at least women achieved major literary success from the late eighteenth century, and many major nineteenth-century British novelists were women, including Jane Austen, the Brontë family, Elizabeth Gaskell, and George Eliot. There were also three major female poets, Elizabeth Barrett Browning, Christina Rossetti and Emily Dickinson.Bloom (1999), 9Ford (1966), 122 In the twentieth century there were also many major female writers, including Katherine Mansfield, Dorothy Richardson, Virginia Woolf, Eudora Welty, and Marianne Moore. Notable female writers in France include Colette,  Simone de Beauvoir, Marguerite Yourcenar, Nathalie Sarraute, Marguerite Duras and Françoise Sagan."]}, {"page": "1848", "response": ["* October 18 – Elizabeth Gaskell's first novel, Mary Barton: A Tale of Manchester Life, is published anonymously in London."]}, {"page": "1840s", "response": ["* 1848 – Elizabeth Gaskell publishes Mary Barton anonymously."]}, {"page": "1850s", "response": ["*Elizabeth Gaskell publishes North and South in 1854"]}, {"page": "1810", "response": ["* September 29 – Elizabeth Gaskell, British novelist (d. 1865)"]}, {"page": "List of Unitarians, Universalists, and Unitarian Universalists", "response": ["* Elizabeth Gaskell (1810–1865) – British novelist and social reformer"]}, {"page": "One Thousand and One Nights", "response": ["The influence of the versions of The Nights on world literature is immense. Writers as diverse as Henry Fielding to Naguib Mahfouz have alluded to the collection by name in their own works. Other writers who have been influenced by the Nights include John Barth, Jorge Luis Borges, Salman Rushdie, Orhan Pamuk, Goethe, Walter Scott, Thackeray, Wilkie Collins, Elizabeth Gaskell, Nodier, Flaubert, Marcel Schwob, Stendhal, Dumas, Gérard de Nerval, Gobineau, Pushkin, Tolstoy, Hofmannsthal, Conan Doyle, W. B. Yeats, H. G. Wells, Cavafy, Calvino, Georges Perec, H. P. Lovecraft, Marcel Proust, A. S. Byatt and Angela Carter."]}, {"page": "Napoleonic Wars", "response": ["*Sylvia's Lovers by Elizabeth Gaskell is set in the English home-front during the Napoleonic Wars and depicts the impressment of sailors by roving press gangs."]}, {"page": "Wuthering Heights", "response": ["Romanticism was also a major influence, which included the Gothic novel, the novels of Walter ScottElizabeth Gaskell The Life of Charlotte Brontë, London: Smith, Elder & Co., 1857, p.104. and the poetry of Byron. The Brontës' fiction is seen by some feminist critics as prime examples of Female Gothic. It explores the domestic entrapment and subjection of women to patriarchal authority, and the attempts to subvert and escape such restriction. Emily Brontë's Cathy Earnshaw and Charlotte Brontë's Jane Eyre are both examples of female protagonists in such a role."]}, {"page": "Jane Eyre", "response": ["* Helen Burns: Jane's best friend at Lowood School. She refuses to hate those who abuse her, trusts in God, and prays for peace one day in heaven. She teaches Jane to trust Christianity and dies of consumption in Jane's arms. Elizabeth Gaskell, in her biography of the Brontë sisters, wrote that Helen Burns was 'an exact transcript' of Maria Brontë, who died of consumption at age 11.", "The early sequences, in which Jane is sent to Lowood, a harsh boarding school, are derived from the author's own experiences. Helen Burns's death from tuberculosis (referred to as consumption) recalls the deaths of Charlotte Brontë's sisters, Elizabeth and Maria, who died of the disease in childhood as a result of the conditions at their school, the Clergy Daughters School at Cowan Bridge, near Tunstall, Lancashire. Mr. Brocklehurst is based on Rev. William Carus Wilson (1791–1859), the Evangelical minister who ran the school. Additionally, John Reed's decline into alcoholism and dissolution recalls the life of Charlotte's brother Branwell, who became an opium and alcohol addict in the years preceding his death. Finally, like Jane, Charlotte became a governess. These facts were revealed to the public in The Life of Charlotte Brontë (1857) by Charlotte's friend and fellow novelist Elizabeth Gaskell.Stevie Davies, Introduction and Notes to Jane Eyre. Penguin Classics ed., 2006."]}, {"page": "David Copperfield", "response": ["In 1847, Jane Eyre, Charlotte Brontë's first-person narrative, was acclaimed as soon as it was published. Unlike Thackeray, who adored it, Dickens claims years later never to have read it. True or false, he had encountered Elizabeth Gaskell's Mary Barton a novel that called for understanding and sympathy in a class-eaten society.Charles Dickens, Letter, Letter to Rogers, 18 February 1849. Thackeray's Pendennis was serialised at the same time as David Copperfield and it depicts its hero's personal and social journey from the countryside to the city. A rivalry existed between the two writers, though it preoccupied Thackeray more than Dickens. The most direct literary influence is \"obviously Carlyle\" who, in a lecture given in 1840, the year of his meeting with Dickens, on \"On Heroes, Hero-Worship\" and \"the Heroic in History\", claims that the most important modern character is \"the hero as a man of letters\". This is David's destiny, through experience, perseverance and seriousness."]}, {"page": "List of biographers", "response": ["*Elizabeth Gaskell (En, 1810–1865) – Charlotte Brontë", "*Jenny Uglow (En, born 1947) – Elizabeth Gaskell, William Hogarth, Thomas Bewick and the Lunar Society"]}, {"page": "Patrick Stewart", "response": ["Over the years, Stewart took roles in many major television series without ever becoming a household name. He appeared as Vladimir Lenin in Fall of Eagles; Sejanus in I, Claudius; Karla in Tinker Tailor Soldier Spy and Smiley's People; Claudius in a 1980 BBC adaptation of Hamlet. He even took the romantic male lead in the 1975 BBC adaptation of Elizabeth Gaskell's North and South. He also took the lead, playing psychiatric consultant Dr Edward Roebuck in BBC's Maybury in 1981. Stewart continued to play minor roles in films, such as King Leondegrance in John Boorman's Excalibur (1981), the character Gurney Halleck in David Lynch's Dune (1984) and Dr. Armstrong in Tobe Hooper's Lifeforce (1985)."]}, {"page": "John Ruskin", "response": ["Although critics were slow to react and the reviews were mixed, many notable literary and artistic figures were impressed with the young man's work, including Charlotte Brontë and Elizabeth Gaskell.Tim Hilton, John Ruskin: The Early Years (Yale University Press, 1985) p. 73. Suddenly Ruskin had found his métier, and in one leap helped redefine the genre of art criticism, mixing a discourse of polemic with aesthetics, scientific observation and ethics. It cemented Ruskin's relationship with Turner. After the artist died in 1851, Ruskin catalogued nearly 20,000 sketches that Turner gave to the British nation."]}, {"page": "Fredrika Bremer", "response": ["Inspired by the work of De Tocqueville and Martineau, Bremer visited and traveled extensively through the United States. Leaving Copenhagen on 11 September 1849, she arrived in New York on 4 October. With the intent of studying the effect of democratic institutions upon society, particularly for women, she visited Boston and New England, where she met Emerson, Longfellow, Lowell, Hawthorne, and Irving; the Shaker and Quaker communities of the Mid-Atlantic States; the South, where she examined the conditions of its black slaves; and the Midwest, where she toured its Scandinavian communities and Indians. Like De Tocqueville before her, she visited America's prisons and spoke with prisoners. She then visited Spanish Cuba before returning to New York, leaving for Europe on 13 September 1851. Throughout her journey, she wrote extensive letters to her sister Agathe which were later edited into her 2-volume 1853 Homes in the New World. Having previously portrayed the Swedish home as a world unto itself, she now portrayed the American world as a great home through the many families who hosted her as she roamed. She spent six weeks in Britain, visiting Liverpool, Manchester, Birmingham, and London and meeting Elizabeth Gaskell, Charles Kingsley, and George Eliot. Her series of articles about England for the Aftonbladet largely concerned her favorable impression of the Great Exhibition, which she visited four times. They were later gathered for English publication as England in 1851."]}, {"page": "Fleeming Jenkin", "response": ["\"At home he pursued his studies, and was for a time engaged with Dr. Bell in working out a geometrical method of arriving at the proportions of Ancient Greek architecture. His stay in Manchester, though in striking contrast to his life in Genoa, was agreeable. He liked his work, had the good spirits of youth, and made some pleasant friends, one of them the author, Elizabeth Gaskell. He was argumentative, and his mother tells of his having overcome a consul at Genoa in a political discussion when he was only sixteen 'simply from being well-informed on the subject, and honest. He is as true as steel,' she writes, 'and for no one will he bend right or left... Do not fancy him a Bobadil; he is only a very true, candid boy. I am so glad he remains in all respects but information a great child.'\""]}, {"page": "Knutsford", "response": ["There is a Methodist church, a Unitarian church dating from 1689 where Elizabeth Gaskell is buried and a Gospel church, located in the old ticket office at Knutsford station.", "Knutsford was the model for Elizabeth Gaskell's novel Cranford. She lived in the town for some time, on what is now known as Gaskell Avenue, and she is buried in the Unitarian Chapel graveyard. Many of the places and people described in her books can be identified as being based on places and people in the town. In 2007 the BBC adapted the novel and produced a popular TV series Cranford. Despite several references to Knutsford, including King Street and The Heath, the TV adaptation was actually filmed in Lacock, Wiltshire. Notably, in 1987 Legh Road in Knutsford, designed by Richard Harding Watt, doubled for Colonial Shanghai in the opening scenes from Steven Spielberg's film Empire of the Sun. A Gaskell protégé who died in Knutsford in 1859 was the once-popular novelist Selina Davenport, who abandoned writing despairingly in 1834 and kept a tiny Knutsford shop instead.", "thumb|150px|Elizabeth Gaskell in 1832", "* Elizabeth Gaskell (1810–1865) an English novelist, biographer and short story writer, grew up in Knutsford"]}, {"page": "Wilkie Collins", "response": ["*\"A House to Let\" (1858), short story co-written with Charles Dickens, Elizabeth Gaskell and Adelaide Anne Procter", "*\"The Haunted House\", short story co-written with Charles Dickens, Elizabeth Gaskell, Adelaide Anne Proctor, George Sala and Hesba Stretton"]}, {"page": "Michael Gambon", "response": ["His craggy looks soon made him into a character actor. But it was not until Dennis Potter's The Singing Detective (1986) that he became a household name. After this success, for which he won his first British Academy Television Award for Best Actor. He famously starred as detective Inspector Jules Maigret in an ITV adaptation of twelve of Georges Simenon's books. He subsequently played romantic leads, notably in the BBC television series The Borderers (1968–70), in which he was swashbuckling Gavin Ker. In 1990 he played Jerry in Harold Pinter's Betrayal for BBC Radio 3. In 1991, he starred as Tommy Hanbury in an episode of the ITV series Minder called \"Look Who's Coming To Pinner\". He also appeared in the BBC limited series Wives and Daughters (1999) based on the Victorian novel by the same name by Elizabeth Gaskell. He portrayed Squire Hamley and received his second BAFTA Award nomination and win for Best Actor."]}, {"page": "Whitby", "response": ["The town has a strong literary tradition; it can even be said that the earliest English literature comes from Whitby as Cædmon, the first known Anglo Saxon poetThe twelve named Anglo-Saxon poets are Æduwen, Aldhelm, Alfred the Great, Anlaf, Baldulf, Bede, Cædmon, Cnut, Cynewulf, Dunstan, Hereward, and Wulfstan (or perhaps Wulfsige). Most of these are considered by modern scholars to be spurious—see O'Donnell 2005, Introduction 1.22. The three for whom biographical information and documented texts survive are Alfred, Bede, and Cædmon. Cædmon is the only Anglo-Saxon poet known primarily for his ability to compose vernacular verse, and no vernacular verse survives that is known to have been written by either Bede or Alfred. There are a number of verse texts known to have been composed by Cynewulf, but we know nothing of his biography. (No study appears to exist of the \"named\" Anglo-Saxon poets—the list here has been compiled from Frank 1993  Roberta Frank, Opland 1980, Sisam 1953 and Robinson 1990). was a monk at the order that used Whitby Abbey during the abbacy of St Hilda (657–680). Part of Bram Stoker's novel Dracula was set in Whitby, incorporating pieces of local folklore, including the beaching of the Russian ship Dmitri. Stoker discovered the name \"Dracula\" at the old public library. One scholar has suggested that Stoker chose Whitby as the site of Dracula's first appearance in England because of the Synod of Whitby, given the novel's preoccupation with timekeeping and calendar disputes.\"Killing Time: Dracula and Social Discoordination\" in Economics of the Undead Eds. Glen Whitman and James Dow (Rowman & Littlefield, 2014), chapter 23Bram Stoker's Notes for Dracula: A Facsimile Edition by Robert Eighteen-Bisang & Elizabeth Miller (McFarland, 2008), pp. 244–46. Elizabeth Gaskell set her novel Sylvia's Lovers partly in the town which she visited in 1859 and Lewis Carroll stayed at 5, East Terrace between July and September 1854: his first publications may have been published in the Whitby Gazette."]}, {"page": "English novel", "response": ["The Brontë sisters were other significant novelists in the 1840s and 1850s. Their novels caused a sensation when they were first published but were subsequently accepted as classics. They had written compulsively from early childhood and were first published, at their own expense in 1846 as poets under the pseudonyms Currer, Ellis and Acton Bell. The sisters returned to prose, producing a novel each the following year: Charlotte's Jane Eyre, Emily's Wuthering Heights and Anne's Agnes Grey. Later, Anne's The Tenant of Wildfell Hall (1848) and Charlotte's Villette (1853) were published. Elizabeth Gaskell was also a successful writer and first novel, Mary Barton, was published anonymously in 1848. Gaskell's North and South contrasts the lifestyle in the industrial north of England with the wealthier south. Even though her writing conforms to Victorian conventions, Gaskell usually frames her stories as critiques of contemporary attitudes: her early works focused on factory work in the Midlands. She always emphasised the role of women, with complex narratives and dynamic female characters.Abrams, M.H., et al. (Eds.) \"Elizabeth Gaskell, 1810–1865\". The Norton Anthology of English Literature, The Major Authors: The Romantic Period through the Twentieth Century, 7th ed., Vol. B. New York, London: W.W. Norton & Company, 2001. . DDC 820.8—dc21. LC PR1109.N6. "]}, {"page": "Hatter (Alice's Adventures in Wonderland)", "response": ["Mercury was used in the manufacturing of felt hats during the 19th century, causing a high rate of mercury poisoning among those working in the hat industry. Mercury poisoning causes neurological damage, including slurred speech, memory loss, and tremors, which led to the phrase \"mad as a hatter\". In the Victorian age, many workers in the textile industry, including hatters, sometimes developed illnesses affecting the nervous system, such as central nervous system (CNS) tuberculosis, which is portrayed in novels like Alton Locke by Charles Kingsley and North and South by Elizabeth Gaskell, which Lewis Carroll had read. Many such workers were sent to Pauper Lunatic Asylums, which were supervised by Lunacy Commissioners such as Samuel Gaskell and Robert Wilfred Skeffington Lutwidge, Carroll's uncle. Carroll was familiar with the conditions at asylums and visited at least one, the Surrey County Asylum, himself, which treated patients with so-called non-restraint methods and occupied them, amongst others, in gardening, farming and hat-making. Besides staging theatre plays, dances and other amusements, such asylums also held tea-parties."]}, {"page": "Valentine's Day", "response": ["In the United States, the first mass-produced Valentines of embossed paper lace were produced and sold shortly after 1847 by Esther Howland (1828–1904) of Worcester, Massachusetts. Her father operated a large book and stationery store, but Howland took her inspiration from an English Valentine she had received from a business associate of her father.Hobbies, Volume 52, Issues 7–12 p.18. Lightner Pub. Co., 1947 Intrigued with the idea of making similar Valentines, Howland began her business by importing paper lace and floral decorations from England.Dean, Dorothy (1990) On the Collectible Trail p.90. Discovery Publications, 1990 A writer in Graham's American Monthly observed in 1849, \"Saint Valentine's Day ... is becoming, nay it has become, a national holyday.\"Quoted in Schmidt 1993:209. The English practice of sending Valentine's cards was established enough to feature as a plot device in Elizabeth Gaskell's Mr. Harrison's Confessions (1851): \"I burst in with my explanations: 'The valentine I know nothing about.' 'It is in your handwriting', said he coldly.\"Gaskell, Elizabeth Cranford and Selected Short Stories p. 258. Wordsworth Editions, 2006. Since 2001, the Greeting Card Association has been giving an annual \"Esther Howland Award for a Greeting Card Visionary\"."]}, {"page": "Cromer", "response": ["The town is featured as a location in the novels Emma by Jane Austen and North and South by Elizabeth Gaskell.", "North and South by Elizabeth Gaskell Chapter XLIX"]}, {"page": "List of years in literature", "response": ["*1851 in literature – Moby-Dick – Herman Melville; Cranford – Elizabeth Gaskell; Lavengro – George Borrow; The House of the Seven Gables – Nathaniel Hawthorne; A Wonder-Book for Girls and Boys – Nathaniel Hawthorne", "*1853 in literature – Ruth – Elizabeth Gaskell; Bleak House by Charles Dickens is the first English novel to feature a detective; The Heir of Redclyffe – Charlotte Mary Yonge; The Scholar Gipsy – Matthew Arnold; Bartleby, the Scrivener – Herman Melville; Villette – Charlotte Brontë", "*1855 in literature – North and South – Elizabeth Gaskell; Babicka (The Grandmother) – Božena Nemcová; Westward Ho! – Charles Kingsley; The Song of Hiawatha – Henry Wadsworth Longfellow; Leaves of Grass – Walt Whitman; A Month in the Country – Ivan Turgenev", "*1863 in literature – Captain Fracasse – Théophile Gautier; Five Weeks in a Balloon- Jules Verne; Aurora Floyd – Mary Elizabeth Braddon; What Is To Be Done? – Nikolay Chernyshevsky; Romola – George Eliot; The Notting Hill Mystery – Charles Warren Adams; Sylvia's Lovers – Elizabeth Gaskell; The House by the Churchyard – Sheridan Le Fanu; Hard Cash – Charles Reade; The Water-Babies, A Fairy Tale for a Land Baby – Charles Kingsley"]}, {"page": "James Anthony Froude", "response": ["His plight won him the sympathy of kindred spirits, such as George Eliot, Elizabeth Gaskell, and later Mrs. Humphry Ward. Mrs. Ward's popular 1888 novel Robert Elsmere was largely inspired by this era of Froude's life."]}, {"page": "The Tenant of Wildfell Hall", "response": ["Elizabeth Gaskell repeated Charlotte's words about Anne in The Life of Charlotte Brontë, claiming that the subject of The Tenant \"was painfully discordant to one who would fain have sheltered herself from all but peaceful and religious ideas.\" In his essay on Emily Brontë, Algernon Charles Swinburne briefly mentioned The Tenant in the context of Branwell's decline as a novel \"which deserves perhaps a little more notice and recognition than it has ever received\" and added that \"as a study of utterly flaccid and invertebrate immorality it bears signs of more faithful transcription from life than anything in Jane Eyre or Wuthering Heights.\"  Margaret Oliphant believed that Anne \"would have no right to be considered at all as a writer but for her association with [her sisters'] imperative spirits.\" Mary Ward, a novelist, who was widely known for her anti-feminist views, in her introduction to 1900 edition of The Tenant, accused Anne of \"the narrowness of view\" and absence of \"some subtle, innate correspondence between eye and brain, between brain and hand, [which] was present in Emily and Charlotte.\" She concluded that \"it is not as the writer of Wildfell Hall, but as the sister of Charlotte and Emily Brontë, that Anne Brontë escapes oblivion.\" May Sinclair, while famously saying that \"when [Anne] slammed the door of Mrs Huntingdon's bedroom she slammed it in the face of society and all existing moralities and conventions,\" considered that she \"had no genius.\" Despite that, her opinion about The Tenant was unexpectedly high: \"There are scenes, there are situations, in Anne's amazing novel, which for sheer audacity stand alone in mid-Victorian literature, and which would hold their own in the literature of revolt that followed... Her diagnosis of certain states, her realization of certain motives, suggests Balzac rather than any of the Brontës.\" In her introduction to the 1914 edition of the novel Sinclair was also ambivalent about Anne and her novel — while acclaiming it as \"the first presentment of that Feminist novel\", she stated that \"it bores to tears.\" Her opinion of Helen was also mixed: \"If Agnes Grey is a little prig, Helen Huntingdon is a prig enormous... She is Anne Bronte's idea of noble womanhood, the first of the modern, large-souled, intellectual heroines.\" The only thing Sinclair wholly approved of was the author's treatment of marital laws of the time: \"Anne Brontë attacks her problem with a freedom and audacity before which her sisters’ boldest enterprises seem cowardly and restrained... Her behaviour is the least unusual, not to say revolutionary.\""]}, {"page": "1866 in literature", "response": ["*Elizabeth Gaskell (died 1865) – Wives and Daughters (serialization completed and in book form)"]}, {"page": "1865 in literature", "response": ["*November 12 – Elizabeth Gaskell, English novelist (born 1810)"]}, {"page": "1864 in literature", "response": ["*Elizabeth Gaskell – Wives and Daughters (serialization begins)"]}, {"page": "1863 in literature", "response": ["*Elizabeth Gaskell"]}, {"page": "1858 in literature", "response": ["*Elizabeth Gaskell – My Lady Ludlow"]}, {"page": "1857 in literature", "response": ["*Elizabeth Gaskell – The Life of Charlotte Brontë"]}, {"page": "1855 in literature", "response": ["*Elizabeth Gaskell – North and South"]}, {"page": "1854 in literature", "response": ["*April 1 – August 12 – Charles Dickens's novel Hard Times, which he has begun writing on January 3, is serialised in his magazine Household Words. From September 2, it is followed in the magazine by Elizabeth Gaskell's North and South, another social novel based in the Lancashire manufacturing district."]}, {"page": "1853 in literature", "response": ["*January 28 – Charlotte Brontë's novel, Villette, appears, its publication having been delayed in order to allow Ruth, by her friend Elizabeth Gaskell, to be given a head start in the press.", "*Elizabeth Gaskell"]}, {"page": "1851 in literature", "response": ["*Elizabeth Gaskell – Cranford (serialization begins)"]}]}}