{"wiki_id": "http://www.wikidata.org/entity/Q22964254", "itemLabel": "Fanny Cooper", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Fanny_Cooper", "wikipedia_page": {"main": "Fanny Cooper has the stage name of Frances Charlotte Dalton married name Frances Dalton Lacy (1814 – April 21, 1872) was an English actress.", "link_mentions": [{"page": "Thomas Hailes Lacy", "response": ["Lacy made his West End stage debut in 1828 but soon turned manager, a position he held from 1841 at The Theatre in Sheffield (destroyed by fire in 1935). On 25 January 1942, Lacy married actress Frances Dalton who was an actress known as Fanny Cooper. She was taking leading parts at Covent Garden and the Haymarket. The marriage probably took place at St Paul's church in Covent Garden, but maybe in Sheffield. He and his wife toured England together. Lacy's roles included Jacques (As You Like It) and Banquo (Macbeth). He would appear with his wife when she played Countess Wintersen in The Stranger, Nerissa in The Merchant of Venice, and Virginia in James Sheridan Knowles's Virginius."]}, {"page": "Laura Addison", "response": ["She made her first appearance as \"Miss Addison\" on the stage in November 1843, at the Worcester Theatre, as Lady Townley in The Provoked Husband. Her family had opposed her desire to become an actress; she had no introduction and was self-instructed. She was favourably received by the public. She went to Glasgow, playing Desdemona to the Othello of Macready, secured the good opinion of that tragedian. At his instance, after she had played with success at Dublin and Edinburgh, she was engaged by Mr. Phelps, and made her first appearance at Sadler's Wells, then under his management, in August 1846, as Lady Mabel in the Patrician's Daughter of Westland Marston. She remained at Sadler's Wells for several seasons where she overshadowed Fanny Cooper so much that she left. Addison played Juliet, Portia, Isabella in Measure for Measure, Imogen, Miranda, and Lady Macbeth; she appeared as Panthea upon the revival of Beaumont and Fletcher's comedy of A King and no King; and she was the first representative of Margaret Randolph and Lilian Saville in the poetic tragedies of Feudal Times and John Saville of Haysted by James White."]}]}}