{"wiki_id": "http://www.wikidata.org/entity/Q23023947", "itemLabel": "Joshua Reiss", "itemDescription": "British author, academic, inventor and entrepreneur", "wikipedia_url": "https://en.wikipedia.org/wiki/Joshua_Reiss", "wikipedia_page": {"main": "Joshua Reiss is a British author, academic, inventor and entrepreneur.  He is best known for his work in intelligent audio technologies and his co-authorship of the book Audio Effects Theory Implementation and Application.", "link_mentions": [{"page": "Super Audio CD", "response": ["Since the Meyer-Moran study in 2007, approximately 80 studies have been published on high-resolution audio, about half of which included blind tests. Joshua Reiss performed a meta-analysis on 20 of the published tests that included sufficient experimental detail and data. In a paper published in the July 2016 issue of the AES Journal, Reiss says that, although the individual tests had mixed results, and that the effect was \"small and difficult to detect,\" the overall result was that trained listeners could distinguish between hi-resolution recordings and their CD equivalents under blind conditions: \"Overall, there was a small but statistically significant ability to discriminate between standard quality audio (44.1 or 48 kHz, 16 bit) and high-resolution audio (beyond standard quality). When subjects were trained, the ability to discriminate was far more significant.\" Hiroshi Nittono pointed out that the results in Reiss's paper showed that the ability to distinguish high-resolution audio from CD-quality audio was \"only slightly better than chance.\""]}, {"page": "High-resolution audio", "response": ["A 2007 study showed no audio difference between CD quality audio and higher resolution audio. Joshua Reiss performed a meta-analysis on 20 of published tests, saying that trained listeners could distinguish between hi-resolution recordings and their CD equivalents under blind conditions.  Hiroshi Nittono pointed out that the results in Reiss's paper showed that the ability to distinguish hi resolution audio from CD quality audio \"was only slightly better than chance\"."]}]}}