{"wiki_id": "http://www.wikidata.org/entity/Q23007510", "itemLabel": "Gavin Beith", "itemDescription": "Scottish football player and coach (born 1981)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gavin_Beith", "wikipedia_page": {"main": "Gavin Beith (born 7 October 1981) is a Scottish football coach and former player, who played as a midfielder. He is currently co-manager of Scottish Women's Premier League team Aberdeen, having previously been head coach of the Dundee United women's team from 2015 to 2021. As a player, he began his career with Dundee, from where he was loaned to East Fife and Peterhead. He later played for Brechin City, Arbroath, East Fife again, Forfar Athletic and Carnoustie Panmure.", "link_mentions": [{"page": "Dundee United F.C.", "response": ["Dundee United announced in April 2015 that the club would be launching a women's team, with the aim of entering the Scottish league structure in 2016. Gavin Beith was appointed as the team's manager in June 2015."]}, {"page": "Dundee United W.F.C.", "response": ["Scottish Premiership club Dundee United announced in April 2015 that they were going to launch a women's team to compete in the Scottish Women's Football League (SWFL) from the following year. Club co-owner and director Justine Mitchell was instrumental in the decision. There were over fifty applicants for the position of head coach, none of whom were women. Gavin Beith was appointed as the team's first head coach in June 2015, with player trials commencing later that month. Ahead of the 2016 season, Fiona Mearns was chosen as the team captain.", "*Gavin Beith (2015–2021)"]}, {"page": "2019 Scottish Women's Premier League", "response": ["|  Gavin Beith"]}, {"page": "2020 Scottish Women's Premier League", "response": ["| Dundee United || Dundee ||  Gavin Beith || GA Engineering Arena || 1,000 || align=center | 3rd"]}, {"page": "2020–21 Scottish Women's Premier League", "response": ["| Dundee United || Dundee ||  Gavin Beith || Regional Performance Centre || || align=center | 3rd"]}, {"page": "2021–22 Scottish Women's Premier League", "response": ["| Aberdeen || Cove Bay ||  Emma Hunter Gavin Beith || Balmoral Stadium || 2,602 || align=center |1st in SWPL 2"]}]}}