{"wiki_id": "http://www.wikidata.org/entity/Q23022107", "itemLabel": "Mabel Lethbridge", "itemDescription": "autobiographist & newspaper columnist.", "wikipedia_url": "https://en.wikipedia.org/wiki/Mabel_Lethbridge", "wikipedia_page": {"main": "Mabel Florence Lethbridge BEM (7 July 1900 – 14 July 1968) was a 20th-century English writer and business woman. She is the youngest person to date to receive the British Empire Medal, an award affiliated to the Order of the British Empire, for her services in the Great War as a munitions factory worker. She was severely injured when a shell she was packing exploded and described her experiences in a series of autobiographies.", "link_mentions": [{"page": "St Ives, Cornwall", "response": ["* Mabel Lethbridge BEM (1900–1968) Youngest person to receive an BEM, after she was severely injured when a shell exploded in a munition factory in the Great War. Lived in St Ives from 1945 as a writer"]}, {"page": "Haberdashers' School for Girls", "response": ["*Mabel Lethbridge, writer and the youngest person to be awarded a British Empire Medal for her services in the Great War (Class of 1914)"]}, {"page": "Bryan Wynter", "response": ["He settled in Zennor, Cornwall in 1945, and in 1946 was co-founder of the Crypt Group. He married Suzanne Lethbridge, daughter of the writer Mabel Lethbridge whom he met in Cornwall.  He taught at Bath Academy of Art, Corsham, 1951-56.  He was a member of the London Group of artists, and of the Penwith Society of Arts.  He died at Penzance, Cornwall.  His auction record is £131,000 for his painting In the Streams Path (1958), set at Sotheby's on 11 November, 2016.Post-War British Art sale  The work had been acquired by the pop star David Bowie in 1995 at the sale of the collection of Sir John Moores."]}, {"page": "The Great War (TV series)", "response": ["In August 1963, at the suggestion of Alasdair Milne, producer of the BBC's current affairs programme Tonight, the BBC resolved to mark the fiftieth anniversary of the outbreak of the First World War with a big television project. The series was the first to feature veterans, many of them still relatively fit men in their late sixties or early seventies, speaking of their experiences after a public appeal for veterans was published in the national press. Those who appeared in the series included Edward Spears, Henry Williamson, Horace Birks, Benjamin Muse, Melvin Krulewitch, George Langley, Keith Officer, Douglas Wimberley, Charles Carrington, Egbert Cadbury, Euan Rabagliati, Robert Cotton Money, Richard Talbot Kelly, Norman Demuth, Walter Greenwood and Cecil Arthur Lewis. The small number of Germans who appeared included  Stephan Westmann\"Stephan Kurt Westmann: Surgeon with the Kaiser's Army (reviewed by Frank Lorenz Müller)\" in German Historical Institute London Bulletin, Vol. 37 (2015), No. 1, recensio.net, accessed 19 February 2021 and Gustav Lachmann.https://kclpure.kcl.ac.uk/portal/files/74062340/Busch_Television_through_the_eyes_of_ordinary_soldiers_AOM.pdf Others who were interviewed by the BBC but not featured in the series included Norman MacMillan, Mabel Lethbridge, Edgar von Spiegel, Edmund Blunden, Martin Niemöller, John Shea, Hans Howaldt, William Ibbett, Marthe Bibesco, Philip Joubert de la Ferté and Eric Dorman O'Gowan."]}, {"page": "Forgotten Voices of the Great War", "response": ["In 1960, the Imperial War Museum began a momentous and important task. A team of academics, archivists and volunteers set about tracing WWI veterans and interviewing them at length in order to record the experiences of ordinary individuals in war. The IWM aural archive has become the most important archive of its kind in the world. Authors have occasionally been granted access to the vaults, but digesting the thousands of hours of footage is a monumental task. Author Max Arthur puts the interviews into chronological and campaign order, and provides some context about the events that surround the memories. The book includes testimonies from Harry Patch, Philip Neame, Horace Birks, Edmund Blunden, Douglas Wimberley, Mabel Lethbridge, Reginald Leonard Haine, Edward Spears, Godfrey Buxton, Henry Williamson, Tom Adlam, Cecil Arthur Lewis, Montagu Cleeve, Charles Carrington, Keith Officer and Norman Demuth."]}, {"page": "Sven Berlin", "response": ["Berlin was a member of the burgeoning artistic community around St Ives on his return and met a local girl, Jacqueline Moran, with whom he moved into a cottage provided by the writer Mabel Lethbridge. He met his second wife, the artist Juanita Fisher in 1949 while living in a small concrete building next to Porthgwidden Beach, dubbed The Tower.  Here he became something of a tourist attraction, carving stone outside, stripped to the waist. Among commissions he illustrated Peggy Pollard's book Cornwall and also exhibited in 1946 at the Lefevre Gallery in London among others. His friendship with writer Denys Val Baker led to numerous contributions to and illustrations of his work in the literary magazine Cornish Review."]}, {"page": "Colin Gill", "response": ["In the early thirties, he had an affair with Mabel Lethbridge, a Great War heroine and writer, while occupying a studio on the first floor of her Chelsea home. Her daughter Sue is the child model for Gill's 1934 painting The Kerry Flute PlayerLiss Llewellyn Fine Art catalogue entry for 'Study for The Kerry Flute Player' 1934."]}, {"page": "Geoffrey Bles", "response": ["Bles entered publishing in 1923. Geoffrey Bles Limited were general publishers, but with a specialism in religion and translated works. Among the authors Bles published were: C.S. Lewis, J.B. Phillips, Cecil Street, Mabel Lethbridge, Halliday Sutherland, Vicki Baum,\"Mr. Geoffrey Bles.\" Sir James Hutchinson, The Times, 6 April 1957, p. 11. The Times Digital Archive. Retrieved 2 September 2014. and Maria von Trapp."]}, {"page": "St Angela's College, Cork", "response": ["* Mabel Lethbridge (1900 – 1968) an English writer and Great War munitions worker, the youngest person to have been awarded a British Empire Medal"]}, {"page": "1918 New Year Honours", "response": ["*Mabel Lethbridge. For courage and high example shown on the occasion of an accident in a filling factory, causing loss of one leg and severe injuries to the other. "]}]}}