{"wiki_id": "http://www.wikidata.org/entity/Q2303942", "itemLabel": "Martin Bayfield", "itemDescription": "English rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Bayfield", "wikipedia_page": {"main": "Martin Christopher Bayfield (born 21 December 1966) is an English actor, broadcaster, and former rugby union player who played lock forward for Northampton Saints, Bedford Blues and England, gaining 31 England and 3 Lions caps.", "link_mentions": [{"page": "List of sports announcers", "response": ["* Martin Bayfield – BBC Radio 5 Live 2001–2007, ITV Sport 2007–2013 & 2015–present, BT Sport 2013–present"]}, {"page": "Northampton Saints", "response": ["| Martin Bayfield, Ian Hunter, Tim Rodber", "* Martin Bayfield (1993)"]}, {"page": "Harry Potter and the Chamber of Secrets (film)", "response": ["* Robbie Coltrane as Rubeus Hagrid:The half-giant gamekeeper at Hogwarts who is framed for opening the Chamber of Secrets and is sent to Azkaban on Lucius Malfoy's orders. This movie reveals Hagrid's expulsion from Hogwarts due to Tom Riddle (aka. Lord Voldemort) framing him. Martin Bayfield portrays a young Hagrid."]}, {"page": "List of Harry Potter cast members", "response": ["| Robbie Coltrane Martin Bayfield"]}, {"page": "Bedford School", "response": ["The school has produced many internationally famous sportsmen, including cricketer Alastair Cook, who went on to captain the England cricket team, and whose coach at Bedford School was sports master and former England batsman Derek Randall. Other famous Bedford School sportsmen include England rugby internationals Martin Bayfield and Andy Gomarsall; the rower Jack Beresford, winner of five Olympic medals; and 1924 Olympic 100-metre sprint gold medalist Harold Abrahams."]}, {"page": "Bedford Blues", "response": ["*  Martin Bayfield (England)"]}, {"page": "John Partridge (actor)", "response": ["In May 2018 it was announced that he would be appearing on Celebrity Masterchef later that year. He won the competition, beating Martin Bayfield and Spencer Matthews. Later that month, he appeared on Greatest Talent Show Moments, broadcast by Channel 5 to discuss the judging on Over The Rainbow. In June 2018, Partridge announced via Twitter that he would be joining the cast of The Case of the Frightened Lady."]}, {"page": "Norm Hadley", "response": ["Hadley captained his national side five times in 1992–3, including on 17 October 1992 at Wembley Stadium, a 13-26 (1 try to 4) loss to England.  On that day Hadley eclipsed his English counterparts Wade Dooley and Martin Bayfield, and rallied an understrength Canadian side to a respectable outcome. Many however point to Canada's narrow quarter-final defeat to the New Zealand All Blacks in the 1991 World Cup as Canada's finest hour, where Hadley and a big, tough forward pack clearly had the upper hand over New Zealand. That highly regarded 1991 Canadian team made a big impact defeating Fiji and Romania and giving both France and New Zealand difficult games.  Always outspoken, a dispute with national team management saw him not play the 1995 World Cup, where his team desperately needed him in a tough pool that included South Africa and Australia."]}, {"page": "1993 British Lions tour to New Zealand", "response": ["|Martin Bayfield||Northampton||||", "|RL ||5 || Martin Bayfield", "|RL ||5 || Martin Bayfield"]}, {"page": "Matthew Amroliwala", "response": ["He has covered many major news stories, including reporting extensively from Northern Ireland. He has also reported from Bosnia on the fall of Srebrenica and travelled throughout the Balkans during the conflict in Bosnia. Since January 2008, he has co-presented the programme Crimewatch with Kirsty Young and Rav Wilding (later Martin Bayfield), specialising in the solved cases, but missed  the March 2015 episode, and was covered by Jason Mohammad."]}, {"page": "Mark Durden-Smith", "response": ["In 2013, he began presenting ITV's Aviva Premiership Rugby Highlights programme, replacing Craig Doyle and Martin Bayfield. On 3 August 2015, he began presenting the daytime ITV game show Freeze Out, which aired for ten episodes."]}, {"page": "MasterChef (British TV series)", "response": ["* 2018: John Partridge, Michelle Ackerley, Chizzy Akudolu, Keith Allen, Clara Amfo, Martin Bayfield, Jay Blades, Frankie Bridge, Gemma Collins, Josh Cuthbert, Carol Decker, Anita Harris, Jean Johansson, Zoe Lyons, Spencer Matthews, Lisa Maxwell, Monty Panesar, Stella Parton, AJ Pritchard and Stef Reid."]}, {"page": "ITV Sport", "response": ["* Martin Bayfield (Also works for BT Sport)"]}, {"page": "StagKnight", "response": ["StagKnight is an English black comedy-horror film directed by Simon Cathcart and written by Cathcart and Rob Mercer. It stars Martin Bayfield as a murderous knight who hunts down a paintball team during a weekend party. The title is a reference to a stag night, the party featured in the film.", "* Martin Bayfield as Knight / William"]}, {"page": "Mike Carlson", "response": ["In 1998, the United Kingdom terrestrial TV station Channel 5 began covering Monday Night Football for which Carlson was the regular analyst from the start until the channel's coverage ended in 2010. During this time he worked with hosts Martin Bayfield, Josh Chetwynd, Mark Webster, Simon Golding, Colin Murray and Nat Coombs. He contributed to now-defunct weekly American football newspaper First Down and covered NFL Europe for NFL.com, Pro Football Weekly, the International Herald Tribune, and for a couple of seasons, The Guardian."]}, {"page": "1966 in the United Kingdom", "response": ["**Martin Bayfield, rugby player, actor and stuntman"]}, {"page": "The One Show", "response": ["* CrimeRav WildingMartin Bayfield"]}]}}