{"wiki_id": "http://www.wikidata.org/entity/Q2309170", "itemLabel": "David Knight", "itemDescription": "enduro rider", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Knight_(motorcyclist)", "wikipedia_page": {"main": "David \"Knighter\" Knight,  (born 31 May 1978), is a three-time world champion enduro rider from the Isle of Man. But holds 5 World Titles altogether. \nAfter competing in the Enduro FIM Junior Cup, Knight debuted in the World Enduro Championship riding for Yamaha. He finished runner-up in the 250 cc class to Juha Salminen in 2001 and to Samuli Aro in 2002. In 2003, he moved to the biggest 500 cc class and placed fourth.\nFor the 2004 season, Knight moved to the KTM team and finished second to his teammate Aro in the Enduro 3 class. In 2005, continuing in the E3 class, he took his first world title and also won the International Six Days Enduro outright. In 2006, he posted a \"perfect\" season, winning all 14 rounds of the E3 WEC season, also winning almost every special test at each event.\nFor 2007, Knight moved to the United States to take on the Grand National Cross Country (GNCC) series against the best in the US. He replaced Salminen, who in turn moved back to the world championship from the KTM USA team. Despite some mechanical difficulties and an injury, Knight still managed to take the GNCC title. After defending his title in the following season, he moved back to the World Enduro Championship. He won his third world title in 2010.Knight also competes in a wide range of \"extreme\" enduro events, such as the Hells Gate extreme enduro in Italy, the Erzberg Rodeo in Austria, the AMA EnduroCross Championship in Las Vegas, Nevada and the \"Tough One\" in the UK (he has won all of these, even beating Salminen), and won (leading every lap of) the first and second annual Red Bull Last Man Standing events in Texas.\nThe Manxman won two races at the inaugural 2007/08 FIM Indoor Enduro World Cup, beating Taddy Blazusiak to claim the title. In 2009/10 he collected a win and three podiums. The rider got two wins and three podiums in 2012/13, resulting runner-up behind Blazusiak. He has won three editions of the Barcelona Indoor Enduro in 2003, 2006 and 2007, and resulted second six times in 2001, 2002, 2004, 2010, 2011 and 2013.\nKnight is an accomplished all rounder, having won the British Expert trials championship, as well as competing with success in various motocross and beach racing events. His all rounder status was confirmed by his winning of the \"Moto 1\" event in the UK, which got riders from several disciplines of motorcycle sport to compete against each other in several disciplines (including road racing, MX, enduro, trials, etc.).\nKnight received an MBE, June 2011, in the Queens Birthday Honours list.\n\n", "link_mentions": [{"page": "Enduro", "response": ["*David Knight – two-time world champion"]}, {"page": "Stefan Merriman", "response": ["From 1996 he began competing in enduro events, riding on an Australian motorcycle competition licence when he competed in international events.   He won the World Enduro Championship in the  250cc class in 2000, the 400cc in 2001, 250cc in 2003 and Enduro One in 2004. In 2003, Merriman also came close to beating Juha Salminen for the overall World title, finishing second in the overall championship only three points (266 vs. 269) behind Salminen. He led the championship before the final heat where he fell and finished second as Salminen took the win and the championship.\"Merriman pipped at the post\" New Zealand Herald 17 June 2003. In 2004, Merriman moved to Yamaha, winning his fourth world title and placing third overall, behind Salminen and Samuli Aro and ahead of David Knight. The following year, he won eleven of the 18 rounds in the Enduro 2 class, but with four retirements could not challenge KTM's Samuli Aro for the title. In 2006, he took three wins and placed third in the championship."]}, {"page": "Juha Salminen", "response": ["Salminen returned to the World Enduro Championship for the 2007 season, with David Knight replacing him in the KTM factory team in the US. Salminen won the first twelve races of the season, but had to miss out the Slovakian rounds due to breaking his collarbone in a British championship race in Britain. He returned to race for the season-ending rounds in France and secured his 12th world title. In the 2008 season, Salminen won nine of the sixteen rounds and broke compatriot Kari Tiainen's record (77) for most wins in the world championship. However, a retirement in the first Spanish round proved costly for his title chase, and Yamaha's Johnny Aubert became the first man to beat Salminen to the title since the 1998 season."]}, {"page": "Grand National Cross Country", "response": ["| 2008 || David Knight || Isle of Man, UK || KTM", "| 2007 || David Knight || Isle of Man, UK || KTM"]}, {"page": "List of Manx people", "response": ["*David Knight (born 1978), enduro motorcyclist"]}, {"page": "Enduro World Championship", "response": ["|colspan=\"2\"| David Knight (KTM)", "|colspan=\"2\"| David Knight (KTM)", "|colspan=\"2\"| David Knight (KTM)"]}, {"page": "David Knight", "response": ["*David Knight (CND), chair for the Campaign for Nuclear Disarmament 1996–2001", "*David Knight (American football) (born 1951), former American football player", "*David Knight (cricketer) (born 1956), Australian cricketer", "*David Knight (English footballer) (born 1987), English footballer", "*David Knight (motorcyclist) (born 1978), enduro rider from the Isle of Man", "*David Knight (musician) (born 1978), American singer and music composer", "*David Knight (politician) (born 1969), state representative in the U.S. state of Georgia", "*David Knights (born 1945), English musician"]}, {"page": "David Knight (Motorcyclist)", "response": ["#REDIRECT David Knight (motorcyclist) "]}, {"page": "List of people from the Isle of Man", "response": ["*David Knight OBE (born 1978), motorcyclist, three-times winner of the World Enduro Championship."]}, {"page": "Motorsport in the United Kingdom", "response": ["Motocross, motorcycle trials and enduro are also popular forms of motorcycle sports, with notable riders such as Kurt Nicoll, David Thorpe, Jeff Smith, Dave Bickers, David Knight, Sammy Miller, Arthur Lampkin, Martin Lampkin and Dougie Lampkin."]}, {"page": "Knight Rider (disambiguation)", "response": ["*A common nickname for British motorycle enduro world champion David Knight"]}, {"page": "Ramsey Grammar School", "response": ["* David Knight, World Champion Enduro Motocycle rider"]}, {"page": "2011 Birthday Honours", "response": ["*David Knight, for services to the Sport of Motorcycling."]}, {"page": "Erzberg Rodeo", "response": ["| 2005 || David Knight ||  || KTM", "| 2006 || David Knight ||  || KTM"]}, {"page": "FIM SuperEnduro World Championship", "response": ["|  David Knight", "*  David Knight: 7"]}, {"page": "AMA EnduroCross Championship", "response": ["| David Knight || KTM", "| David Knight || KTM"]}, {"page": "2021 Dakar Rally", "response": ["| 101 ||bgcolor=\"skyblue\"|  David Knight || Husqvarna FR 450 Rally || HT Rally Husqvarna Racing || G2.1"]}]}}