{"wiki_id": "http://www.wikidata.org/entity/Q2313675", "itemLabel": "Paul Newton", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Newton_(musician)", "wikipedia_page": {"main": "Paul Newton (born 21 February 1948, Andover, Hampshire, England) is an English rock musician. He was bassist with progressive group Shinn, which featured organist Don Shinn and drummer Brian \"Blinky\" Davison, and then joined a reformed line-up of The Gods with Ken Hensley and Lee Kerslake. He was the original bass guitarist for Uriah Heep and played on the band's first three albums. He subsequently played for a band called Festival for several years on the Mecca Palais circuit and also worked as a studio musician and appeared on various recordings. More recently he has performed with other ex-members of Uriah Heep (Ken Hensley, John Lawton and Lee Kerslake) in Uriah Heep Legends. He has appeared with Behind Closed Doors, a band formed by his son, Julian. Now works occasionally with Bromyard band The Business and Off the Cuff with long time friend, guitarist Dave Beale. He, along with John Lawton, guested on three songs with Uriah Heep at the Masters of Rock Festival in the Czech Republic on July 11th, 2019, making this the first time he has played with the band since 1971.", "link_mentions": [{"page": "Uriah Heep (band)", "response": ["Uriah Heep are an English rock band formed in London in 1969. Their current lineup consists of lead and rhythm guitarist Mick Box, keyboardist Phil Lanzon, lead vocalist Bernie Shaw, drummer Russell Gilbrook, and bassist Dave Rimmer. They have experienced numerous lineup changes throughout their -year career, leaving Box as the only remaining original member. Notable former members of the band are vocalists David Byron, John Lawton, John Sloman, Peter Goalby, and Steff Fontaine, bassists Gary Thain, Trevor Bolder, John Wetton, Bob Daisley, Paul Newton, and John Jowitt, drummers Nigel Olsson, Lee Kerslake and Chris Slade, and keyboardists Ken Hensley and John Sinclair.", "The band's origins go back to 1967 when 19-year-old guitarist Mick Box formed a band in Brentwood called Hogwash, which began playing in local clubs and pubs. When the band's singer left, drummer Roger Penlington suggested his cousin David Garrick (who knew the band) as a replacement. Box and Garrick formed a songwriting partnership and, having higher musical aspirations than their colleagues, decided to give up their day jobs and go professional. They set up a new band called Spice. David Garrick changed his surname to Byron. Drummer Alex Napier (born 1947 in Glasgow, Strathclyde, Scotland) joined, having answered a music paper ad; bassist Paul Newton of the Gods completed the line-up.", "By the end of 1971 it became clear, according to Hensley, that he, Byron and Box had become the tightly knit nucleus of the band. Feeling marginalised and having recently been badly shaken up when he was involved in an accident in Germany in one of the band's cars, first bassist Paul Newton left, in November of '71, and was briefly replaced by Mark Clarke. Newton recalled in a 2000 interview on Uriah Heep's website his departure: \"Well, as you know, my father managed the band in the early days, with the Gods and Spice. He bought a lot of the gear and so on. When we became Uriah Heep and Ken joined the band – and Ken is the first to admit it – he had very definite ideas about what he wanted to do in a band. I suppose in some ways it was like the band was a vehicle which Ken needed and used to put his own ideas together. And there's nothing wrong with that as such. I mean, let's face it, the fact that what we did was successful was great for me too. But after a while you're bound to get some in-fighting in a situation like that. There were other problems too, because Gerry Bron was now the manager and my father was trying to get back some money from him - get some of his money back on the equipment and so on. There was a lot of unhappiness on all sorts of levels and everybody was unhappy in a lot of ways. I actually wanted to leave the band for quite a while before I actually left but I didn't. Anyway, with the heavy work schedules and the pressures and so on, I ended up collapsing on stage one night and the other members of the band decided I should go. It was funny because I didn't want to go and there was a lot of animosity but at the same time it was a tremendous relief\"."]}, {"page": "Ken Hensley", "response": ["In early 1965, Hensley formed a band called The Gods, with the young guitarist Mick Taylor, well known later for his work with John Mayall and The Rolling Stones. Hensley wrote most of the material, sang and played the Hammond B3 organ as the band already had Taylor on guitar. The Gods' line-up included, at one time or another, vocalist and guitar/bass player Greg Lake (later of King Crimson and Emerson, Lake & Palmer), bass player Paul Newton (later the first Uriah Heep bassist), drummer Lee Kerslake (later also of Heep), bassist John Glascock (later of Jethro Tull), and guitarist Joe Konas. In early 1968, they signed with Columbia Records and recorded two LPs and several singles. After that, Newton left the band to join Spice, an Essex-based band. Hensley also played on a one-album side project of The Gods initially planned to become their third album, but was recorded and eventually released in 1969/1970 under the moniker Head Machine's Orgasm. The album was produced by David Paramor (producer of \"The Gods\") and both Hensley and Kerslake featured, along with John Glascock on bass, Brian Glascock on drums, and David Paramor on vocals, all under pseudonyms. Hensley played mostly guitar again, as in the beginning of his career. Although Paramor was credited as composer, the songs bear many of Hensley's influences. The album was released before Hensley joined Toe Fat, and might almost be considered a prototype for the harder side of his future work in Uriah Heep.", "Paul Newton asked Hensley (Christmas 1969) to join forces in Spice, as they were looking for a keyboard player to make their sound less bluesy and more progressive, in keeping with the current trend. In January 1970, Spice changed its name into Uriah Heep. Also in the line-up were guitarist Mick Box and vocalist David Byron. With Uriah Heep, Hensley found a place to develop and showcase his songwriting and lyrical abilities as well as his keyboard and guitar playing. The band's \"classic\" line-up featured Hensley, Byron, Box, Kerslake and bassist Gary Thain, plus the management provided by Gerry Bron (Bronze Records). During his time with Heep (1970–1980), they recorded 13 studio albums, and the live album Uriah Heep Live – January 1973 along with many compilations and singles. Hensley also recorded his first two solo albums, Proud Words on a Dusty Shelf (1973) and Eager To Please (1975) during this time.  He was supported mainly by Mark Clarke and Bugs Pemberton.", "During the fourth Uriah Heep Annual Convention in London, May 2000, plans were made for a one-off concert by the so-called \"Hensley/Lawton Band\". Hensley was joined by former Uriah Heep singer John Lawton, their first public collaboration since the latter's departure from Uriah Heep in 1979. With them were Paul Newton (the band's original bassist) and two members of Lawton's band, Reuben Kane on lead guitar and Justin Shefford on drums. They played a set of old Uriah Heep classics and some of Hensley's solo songs, and the concert was recorded for a CD release, followed by a tour in Europe culminating with a concert in Hamburg, Germany, featuring a full orchestra and a new rendition of Heep's old song \"Salisbury\"."]}, {"page": "David Byron", "response": ["David Byron was educated at Forest School, Walthamstow, from 1958–1964, where, as a popular pupil he excelled at sports and was in the school 1st XI football team.  From the mid-1960s to early 1970s, he did session work for a company called Avenue Recordings, singing lead and backing vocals (occasionally along with Mick Box on guitar and Paul Newton on bass). These were cover versions of Top 20 hits and were released on EPs and LPs.", "His first venture into professional music was with an Epping-based semi-pro band called The Stalkers, which also featured Box. Byron and Box then teamed up to form the band Spice (1967–1969), which also featured Newton on bass and Alex Napier on drums. Before settling on the name Spice other names were considered including 'The Play' and a handful of acetates exist of unreleased tracks recorded at the time and credited to 'The Play'. The band gigged extensively locally under the management of Paul Newton's father and they secured a recording deal with United Artists, which issued the band's only single \"What About The Music/In Love\"; copies of which now fetch around $50 to $100 on the collectors' market."]}, {"page": "Spice (British band)", "response": ["Spice were a British pop rock and rhythm and blues band featuring David Byron (vocals), Mick Box (guitar), Paul Newton (bass guitar), Alex Napier (drums) and Colin Wood (keyboards). (Napier was a replacement for drummer Nigel Pegrum; Pegrum would later join the folk rock band Steeleye Span)."]}, {"page": "Salisbury (album)", "response": ["* Paul Newton – bass guitar, vocals"]}, {"page": "John Lawton (musician)", "response": ["During the 4th Uriah Heep Annual Convention in London, May 2000, plans were made for a one-off concert by the so-called Hensley/Lawton Band. Lawton was joined by former Heep keyboardist Ken Hensley, for the first time 21 years after Lawton's departure from Uriah Heep in 1979. With them were Paul Newton (their original bassist), and 2 members of Lawton's band Reuben Kane on lead guitar and Justin Shefford on drums. They played a collection of old Heep classics and some of Hensley & Lawton's solo songs, and the concert was recorded for a CD release called The Return.", "In September 2008 John Lawton appeared on stage at the Heepvention 2008 in Spain, with former Uriah Heep members Ken Hensley, Lee Kerslake and Paul Newton, together with Jan Dumee from the OTR project on guitar.", "In 2009 John again joined Ken Hensley, Lee Kerslake and Paul Newton to appear at Heepvention 2009 in Salo, Finland with a Finnish guitarist completing the line-up."]}, {"page": "Lee Kerslake", "response": ["In 2003, Kerslake and Daisley's lawsuit was dismissed by the United States District Court in Los Angeles. This dismissal was upheld by the United States Court of Appeals for the Ninth Circuit. Kerslake performed with his own band the \"Lee Kerslake Band\", guested with various bands and regularly joined ex-Heep members Ken Hensley and Paul Newton in \"Uriah Heep Legends\"."]}, {"page": "Look at Yourself (Uriah Heep album)", "response": ["Look at Yourself is the third studio album by British rock band Uriah Heep, released in September 1971 by Bronze Records in the UK and Mercury Records in the US. It was the last Uriah Heep album to feature founding member and bassist Paul Newton.", "* Paul Newton – bass"]}, {"page": "The Gods (band)", "response": ["In May 1967, Mick Taylor got a call from John Mayall who was looking for a new guitarist to replace Peter Green. When Taylor joined the Bluesbreakers, he left behind a faltering blues band. The band sought to revive their fortunes on the club/college circuit. They relocated to London and secured a residency at The Marquee. John Glascock (bass) was replaced by Paul Newton in June 1967 and then by Greg Lake. But the latter was too talented for the backing role they had him in so he soon left to join King Crimson in the summer of 1968. The band had to re-group again and John Glascock was asked to return.", "* Paul Newton - bass (1967)"]}]}}