{"wiki_id": "http://www.wikidata.org/entity/Q2313725", "itemLabel": "Chris Urbanowicz", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Urbanowicz", "wikipedia_page": {"main": "Editors are an English rock band, formed in 2002 in Birmingham. Previously known as Pilot, The Pride and Snowfield, the band currently consists of Tom Smith (lead vocals, guitar, piano), Russell Leetch (bass guitar, synthesiser, backing vocals), Ed Lay (drums, percussion, backing vocals), Justin Lockey (lead guitar), and Elliott Williams (keys, synthesisers, guitars, and backing vocals).\nEditors have so far released two platinum studio albums, and six in total, with several million combined sales. Their debut album The Back Room was released in 2005. It contained the hits \"Munich\" and \"Blood\" and the following year received a Mercury Prize nomination.\nTheir follow-up album An End Has a Start went to number 1 in the UK Album Chart in June 2007 and earned the band a Brit Awards nomination for best British Band. It also spawned another Top 10 hit single, \"Smokers Outside the Hospital Doors\". The band's third album, In This Light and on This Evening, was released in October 2009 and went straight to number 1 in the UK Album Chart. The band released their fourth studio album, The Weight of Your Love, in July 2013, followed by self-produced In Dream in October 2015. In 2018, the band released their sixth album Violence.\nAlongside their critical acclaim and strong success in the UK Singles Chart, they consistently enjoyed sold-out tours and numerous headlining festival slots. Their brand of dark indie rock is commonly compared to the sound of bands such as Echo & the Bunnymen, Joy Division, Interpol, the Chameleons and U2.", "link_mentions": [{"page": "Staffordshire University", "response": ["*Chris Urbanowicz, Lead Guitarist for rock band Editors"]}, {"page": "FC St. Pauli", "response": ["St. Pauli is also a worldwide symbol for punk and related subcultures. The skull and crossbones logo and the team's brown and white football jerseys have often been worn by international artists such as the bands Asian Dub Foundation, Gaslight Anthem and Panteon Rococo. The KMFDM frontman and Hamburg native Sascha Konietzko is a recognisable St. Pauli fan, at one point placing a huge picture of a fist smashing a swastika on his band's main page, with the caption \"St. Pauli Fans gegen Rechts!\" (\"St. Pauli fans against the Right\") underneath it. American punk band Anti-Flag can be seen wearing St. Pauli shirts in numerous music videos for their album American Fall. Another notable supporter and sponsor is Andrew Eldritch, lead singer of band The Sisters of Mercy. On his 2006 \"Sisters Bite The Silver Bullet\"- tour, Eldritch wore the famous skull and crossbones shirt. Georg Holm, the bassist of the Icelandic post rock band Sigur Rós, has performed at several festivals wearing a St. Pauli T-shirt. Alex Rosamilia, the guitarist for The Gaslight Anthem, frequently wears a St. Pauli hat and hoodie and displays a flag of the club's logo in front of the speakers of his guitar amp. Editors guitarist and synthesiser player Chris Urbanowicz frequently wears the skull and crossbones t-shirt. Dave Doughman, the singer for Dayton, Ohio's Swearing at Motorists, who has been spotted in concert with the skull and crossbones on his guitar and amplifier, moved to St. Pauli in 2010. Bad Religion played a charity match against St. Pauli's third team in 2000. German musicians that are fans include: Fettes Brot, Die Ärzte singer/drummer/songwriter Bela B., Kettcar, Tomte and many other bands, most of them underground."]}, {"page": "Aslockton", "response": ["*Chris Urbanowicz, rock musician, was born in Aslockton in 1981."]}, {"page": "Hayden (electronics company)", "response": ["*Chris Urbanowicz - Editors"]}, {"page": "All Sparks", "response": ["Category:Songs written by Chris Urbanowicz"]}, {"page": "Munich (song)", "response": ["All songs written and composed by Chris Urbanowicz, Edward Lay, Russell Leetch and Tom Smith, except where noted.", "Category:Songs written by Chris Urbanowicz"]}, {"page": "Bullets (Editors song)", "response": ["Category:Songs written by Chris Urbanowicz"]}, {"page": "Blood (Editors song)", "response": ["Category:Songs written by Chris Urbanowicz"]}, {"page": "Tom Smith (musician)", "response": ["Smith performed a solo show in February 2012 in Brussels, where he sang old and new Editors songs. Editors released their fourth studio album The Weight of Your Love on 28 June 2013, after a hiatus and the departure of guitarist Chris Urbanowicz in 2012. On the first recording sessions of the album, Smith stated that it had been \"a long, hard couple of years and it got pretty dark because whenever we tried creating new songs it wasn’t good enough. Chris's heart wasn’t in it any more. For a year, we'd leave rehearsals feeling very negative and uninspired.\" Smith also said that \"I've talked for a long time about my love of American bands like R.E.M. and Arcade Fire, and that's the type of sound our new songs are going towards. They're more straightforward than our last album. That was more experimental, whereas the new songs could be played on an acoustic guitar. I don't know what a hit is any more, but these songs feel very classic and immediate.\" The album was mostly recorded live. Regarding the sound of the album, lead singer Tom Smith stated that it \"[has] a foot in that alt rock/Americana world\" and that it feels \"untouchable at times\". Lyrically, the album focuses on \"love songs... that don't adhere to the traditional love song type\". Smith explained, \"If I ever find myself writing something too straightforward, I try to twist it, so it ends up odd and baffling.\""]}, {"page": "Poles in the United Kingdom", "response": ["*Chris Urbanowicz – guitar player in Editors"]}, {"page": "Rickenbacker 620", "response": ["The Rickenbacker 620 is a solid-body guitar manufactured by the Rickenbacker International Corporation (RIC). It is part of the 600 series of guitars which all share the distinctive \"cresting wave\" styled body. The Rickenbacker 620 features triangular fret markers, a thick rosewood fret board, a maple body with neck-thru construction, and maple neck. The 620 also comes standard with a stereo output jack. The guitar's pickups are twin single coil 'Hi-gains'. The Rickenbacker 620 sports the Rickenbacker signature, an 'R' style floating tailpiece. There is a twelve string version of this guitar available, the Rickenbacker 620/12. The Rickenbacker 620 comes in fireglo, mapleglo, jetglo, and midnight blue finishes from the factory. The 620 is less popular with big recording artists than its siblings the 330 and 360, however some guitarists have consistently used them including Christopher Owens of Girls, Caleb Harper of Spacey Jane, and Chris Urbanowicz of Editors. Mike Campbell of Tom Petty and the Heartbreakers acquired the first 620/12 12-string (made in December 1963, actually called a prototype 625/12) in 1977, and has used it on hits such as Listen to Her Heart and Here Comes My Girl.", "* Chris Urbanowicz of Editors"]}, {"page": "1981 in British music", "response": ["*22 June - Chris Urbanowicz, guitarist (Editors)"]}, {"page": "An End Has a Start", "response": ["All tracks written by Tom Smith, Chris Urbanowicz, Russell Leetch & Edward Lay.", "*Chris Urbanowicz – lead guitar, synthesizer"]}, {"page": "Smokers Outside the Hospital Doors", "response": ["The song was recorded and produced at Grouse Lodge Studios, Ireland, under the supervision of producer Jacknife Lee. Lead vocals, rhythm guitar and piano were provided by Tom Smith, lead guitar and synth by Chris Urbanowicz, bass guitar by Russell Leetch and percussion by Ed Lay. Smith and Lay were also part of the choir, along with producer Jacknife Lee, audio engineer Tom McFall and singer Anne Struther, all of whom were chosen purely because they were in the studio at the time.6 Music presents Editors, BBC 6 Music. (Hub performance index). Retrieved on 28 June 2007. When performed live, the choir vocals are provided by Smith, Lay and Leetch, rather than using a pre-recorded backing track.", "The intro of the song is an unaccompanied drum beat played for 8 seconds, at which point the lead vocals and piano, both by Tom Smith, enter. The piano part plays a continual progression of three chords: G, C and E minor. At the end of the first verse, the piano is replaced by a short guitar solo, by Chris Urbanowicz, which continues the progression. The second verse returns to piano, which segues into a distorted rhythm guitar part for the chorus.", "* Chris Urbanowicz – writing", "Category:Songs written by Chris Urbanowicz"]}, {"page": "List of Rickenbacker players", "response": ["* Chris Urbanowicz of Editors"]}, {"page": "An End Has a Start (song)", "response": ["Category:Songs written by Chris Urbanowicz"]}, {"page": "List of people from Nottingham", "response": ["*(Born 1981) Chris Urbanowicz, lead guitarist in Editors."]}, {"page": "The Racing Rats", "response": ["Category:Songs written by Chris Urbanowicz"]}, {"page": "Push Your Head Towards the Air", "response": ["Category:Songs written by Chris Urbanowicz"]}, {"page": "Urbanowicz", "response": ["*Chris Urbanowicz, British musician"]}, {"page": "In This Light and on This Evening", "response": ["In This Light and on This Evening is the third studio album by English rock band Editors. It was released on 12 October 2009 by Kitchenware Records. The band had said the material would have a more raw and anthemic sound compared to their previous work. The first single from the album was \"Papillon\". The second single was \"You Don't Know Love\", released on 25 January of the following year. The third single, \"Eat Raw Meat = Blood Drool\", was released on 24 May. The album also features a bonus extended play of five songs, called Cuttings II. With lead guitarist Chris Urbanowicz's departure from Editors on 16 April 2012, this was the band's last album to feature Urbanowicz.", "All tracks written by Edward Lay, Russell Leetch, Tom Smith, and Chris Urbanowicz.", "*Tom Smith, Chris Urbanowicz, Russell Leetch, Edward Lay – band members"]}, {"page": "Toot Hill School", "response": ["* Chris Urbanowicz - Guitarist from Editors"]}, {"page": "Papillon (Editors song)", "response": ["Category:Songs written by Chris Urbanowicz"]}, {"page": "You Don't Know Love (Editors song)", "response": ["Category:Songs written by Chris Urbanowicz"]}, {"page": "Hudson, New York", "response": ["*Chris Urbanowicz, musician"]}, {"page": "Eat Raw Meat = Blood Drool", "response": ["Category:Songs written by Chris Urbanowicz"]}, {"page": "Last Day (song)", "response": ["Category:Songs written by Chris Urbanowicz"]}, {"page": "No Sound but the Wind", "response": ["Category:Songs written by Chris Urbanowicz"]}, {"page": "The Weight of Your Love", "response": ["This is the first Editors album recorded after the departure of lead guitarist Chris Urbanowicz on 16 April 2012. The band has released a statement on their official website saying it was \"a decision entirely based upon future musical direction\" and that Urbanowicz's departure was \"entirely amicable\". This is also the first album to feature new band members Justin Lockey and Elliott Williams.", "However, in April 2012, the band stated on their official site that they were \"super excited about working with the core of the band as a three-piece and trying to introduce new elements to Editors sound.\" In December of the same year, the band revealed on a Daily Star interview that they were ready to begin recording their fourth album after the departure of Chris Urbanowicz."]}, {"page": "List of songs recorded by R.E.M.", "response": ["| \"Munich\" (Live) || Radio 1's Live Lounge – Volume 3 || Chris Urbanowicz, Edward Lay, Russell Leetch, Tom Smith ||"]}, {"page": "R.E.M. at the BBC", "response": ["#\"Munich\" (Edward Lay, Russell Leetch, Tom Smith, and Chris Urbanowicz) – 3:18"]}]}}