{"wiki_id": "http://www.wikidata.org/entity/Q231086", "itemLabel": "Hannah Murray", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Hannah_Murray", "wikipedia_page": {"main": "Tegan Lauren-Hannah Murray (born 1 July 1989), known professionally as Hannah Murray, is an English actress. She is best known for portraying Cassie in Skins (2007–2008, 2013) and Gilly in the HBO series Game of Thrones (2012–2019), for which she has been nominated along with her castmates for three Screen Actors Guild Awards as ensemble players.\nShe has also received praise for her performances in Polly Stenham's That Face in West End (2008) and in the Off West End play Martine (2014).\nShe's also known for her starring roles in films such as Stuart Murdoch's God Help The Girl (2014), for which she won a Special Jury Prize at the Sundance Film Festival, Jeppe Rønde's Bridgend (2015), for which she won the Best Actress Award at the Tribeca Film Festival, and Kathryn Bigelow's Detroit (2017).", "link_mentions": [{"page": "1989 in American television", "response": ["|Hannah Murray"]}, {"page": "1989 in film", "response": ["** Hannah Murray, English actress"]}, {"page": "Kathryn Bigelow", "response": ["Bigelow collaborated with Mark Boal for the third time on the film Detroit, set during the 1967 Detroit riots. Detroit began filming in the summer of 2016 and was released in July 2017, around the time of the 50th anniversary of the riots, and on the anniversary day of the Algiers Motel incident, which is depicted in the film. John Boyega, Hannah Murray, Will Poulter, Jack Reynor, Anthony Mackie, and Joseph David-Jones starred in the film."]}, {"page": "Queens' College, Cambridge", "response": ["File:Hannah Murray - IFFR 2015-1.jpg|Hannah Murray, actress", "|Hannah Murray"]}, {"page": "Leslie Van Houten", "response": ["The 2009 film Leslie, My Name Is Evil (released in some countries under the titles Manson Girl and Manson, My Name Is Evil) is partially based on Van Houten's early life and stars actress Kristen Hager as Van Houten. In Helter Skelter (2004 remake of the 1976 film) Van Houten was portrayed by actress Catherine Wadkins. A year earlier, in 2003, Amy Yates portrayed Leslie Van Houten in the film The Manson Family. In the 2015 NBC fictional series Aquarius, which centers on the Los Angeles Police Department and the Manson murders, Emma Dumont portrays a character named \"Emma\", who is loosely based on Van Houten. Tania Raymonde portrayed Van Houten in Susanna Lo's 2016 film Manson Girls. Later in 2016, Greer Grammer portrayed Van Houten in Leslie Libman's film Manson's Lost Girls, which starred MacKenzie Mauzy as Kasabian. In 2018 she was portrayed by Gabrielle Klobucar in the made-for-TV documentary Inside the Manson Cult: The Lost Tapes. Also in 2018, English actress Hannah Murray played Van Houten in the feature movie Charlie Says. And in 2019, Van Houten was played by Victoria Pedretti (credited as \"Lulu\") in Quentin Tarantino's film Once Upon a Time in Hollywood."]}, {"page": "Neil Morrissey", "response": ["In July 2013, Morrissey reprised his Skins role as Marcus Ainsworth, the father of Hannah Murray's character Cassie Ainsworth. He appeared in both parts of Skins Pure."]}, {"page": "Duke of York's Theatre", "response": ["* That Face (1 May 2008 – 5 July 2008) by Polly Stenham, starring Lindsay Duncan, Hannah Murray and Matt Smith"]}, {"page": "List of University of Cambridge people", "response": ["*Hannah Murray (Queens')"]}, {"page": "List of A Song of Ice and Fire characters", "response": ["In the HBO television adaptation, she is portrayed by Hannah Murray."]}, {"page": "Murray (surname)", "response": ["*Hannah Murray (born 1989), English actress"]}, {"page": "Tribeca Film Festival", "response": ["* 2015 – Hannah Murray in Bridgend"]}, {"page": "Why Didn't They Ask Evans?", "response": ["Hannah Murray as Dorothy Savage"]}, {"page": "Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series", "response": ["| Alfie Allen, John Bradley-West, Oona Chaplin, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Mackenzie Crook, Charles Dance, Joe Dempsie, Peter Dinklage, Natalie Dormer, Nathalie Emmanuel, Michelle Fairley, Jack Gleeson, Iain Glen, Kit Harington, Lena Headey, Isaac Hempstead-Wright, Kristofer Hivju, Paul Kaye, Sibel Kekilli, Rose Leslie, Richard Madden, Rory McCann, Michael McElhatton, Ian McElhinney, Philip McGinley, Hannah Murray, Iwan Rheon, Sophie Turner, Carice van Houten, Maisie Williams", "| Alfie Allen, Ian Beattie, John Bradley-West, Gwendoline Christie, Emilia Clarke, Michael Condron, Nikolaj Coster-Waldau, Ben Crompton, Liam Cunningham, Stephen Dillane, Peter Dinklage, Nathalie Emmanuel, Tara Fitzgerald, Jerome Flynn, Brian Fortune, Joel Fry, Aiden Gillen, Iain Glen, Kit Harington, Lena Headey, Michiel Huisman, Hannah Murray, Brenock O'Connor, Daniel Portman, Diana Rigg, Iwan Rheon, Owen Teale, Sophie Turner, Carice van Houten, Indira Varma, Maisie Williams, Tom Wlaschiha", "| Alfie Allen, Jacob Anderson, Pilou Asbæk, John Bradley West, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Ben Crompton, Liam Cunningham, Joe Dempsie, Peter Dinklage, Richard Dormer, Nathalie Emmanuel, Jerome Flynn, Iain Glen, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Kristofer Hivju, Rory McCann, Hannah Murray, Staz Nair, Daniel Portman, Bella Ramsey, Richard Rycroft, Sophie Turner, Rupert Vansittart, Maisie Williams"]}, {"page": "1989 in the United Kingdom", "response": ["**Hannah Murray, actress"]}, {"page": "List of biographical films", "response": ["||Hannah Murray"]}, {"page": "Screen International", "response": ["* Hannah Murray"]}, {"page": "Ainsworth (surname)", "response": ["* Cassandra Ainsworth, character in the television series Skins, portrayed by Hannah Murray"]}, {"page": "Skins (British TV series)", "response": ["The seventh series, titled Skins Redux, aired on 1 July 2013. It saw the return of former Skins stars Hannah Murray as Cassie, Jack O'Connell as Cook and Kaya Scodelario as Effy in three individual stories. Lily Loveless as Naomi and Kathryn Prescott as Emily also starred in guest roles. The three stories have their own titles: Skins Fire (Effy), Skins Pure (Cassie) and Skins Rise (Cook). The six-part series began filming on 22 October 2012 and concluded at the end of January 2013.", "Tony Stonem (Nicholas Hoult) is an intelligent and popular boy. His manipulative ways often go unnoticed by many, and are a catalyst for the majority of the events in the series. Sid Jenkins (Mike Bailey) is Tony's best friend and has an entirely opposite personality. He lacks confidence, is socially uneasy and struggles with school work. Tony's girlfriend is Michelle Richardson (April Pearson), a girl who can never stay angry at his mischievous behaviour for long. Outwardly, Michelle appears shallow, vain and conceited, but she works hard, has a strong interest in French and Spanish, and is very emotionally mature. She is friends with Cassie Ainsworth (Hannah Murray), an eccentric girl who has an eating disorder. Cassie attempts to hide her own struggles with mental health while her flamboyant parents ignore her in favour of their new baby."]}, {"page": "Tony Stonem", "response": ["In the episode \"Tony\", he attempts to help his best friend Sid to lose his virginity before turning 17 for fear of being associated with a perceived loser. After momentarily suggesting Sid may lose it to Michelle, he later reveals he was referring to Cassie (Hannah Murray). He orders Sid to acquire some weed from local drug dealer Madison Twatter, and eventually ends up driving a stolen car with his friends into the harbour where the drugs are lost."]}, {"page": "List of Skins characters", "response": ["| Hannah Murray", "| Cassandra \"Cassie\" Ainsworth || Hannah Murray || 1–2, 7 || 1.02, 1.09, 2.09, 2.10, 7.03, 7.04"]}, {"page": "Cassie Ainsworth", "response": ["Cassandra \"Cassie\" Ainsworth is a fictional character in the television series Skins, portrayed by Hannah Murray."]}, {"page": "Anwar Kharral", "response": ["According to fellow actors Mike Bailey (who portrays Sid Jenkins) and Hannah Murray (who portrays Cassie Ainsworth), the characterization of Anwar was partly based on the personality of the actor Dev Patel and the role was written specifically for him after he was cast for Skins."]}, {"page": "Bridgend suicide incidents", "response": ["A 2013 documentary and a 2015 drama film starring Hannah Murray (director Jeppe Rønde) have been made about these incidents, both called Bridgend. The 2015 film was viewed in Wales as sensationalist, lacking truth and exploitative, in that it showed local youths screaming out to their dead friends in the misty woods, skinny dipping en masse and reveling in weekly underage drinking."]}, {"page": "That Face", "response": ["When That Face premiered on the West End, the cast was as follows: Lindsay Duncan, Hannah Murray, Matt Smith, Catherine Steadman and Julian Wadham.Official Website Prior to the West End transfer, Felicity Jones played the Hannah Murray role."]}]}}