{"wiki_id": "http://www.wikidata.org/entity/Q231041", "itemLabel": "Layla El", "itemDescription": "British professional wrestler, dancer, and model", "wikipedia_url": "https://en.wikipedia.org/wiki/Layla_El", "wikipedia_page": {"main": "Layla El (born 25 June 1977) is an English real estate agent and former dancer, model, and retired professional wrestler. She is best known for her time with WWE, where she performed under the mononymous ring name Layla. She danced for Carnival Cruise Lines, the Miami Heat franchise of the National Basketball Association, and Kanye West during his performance at the MTV Video Music Awards before becoming a contestant on the 2006 edition of WWE's Diva Search, which she won to earn a contract with the company.\nInitially appearing on the SmackDown brand, El moved to ECW in January 2007. There, she formed the Extreme Exposé dance troupe with Kelly Kelly and Brooke Adams. In 2008, she was drafted to the Raw brand, where she began managing William Regal. The following year, she returned to SmackDown and formed an alliance with Michelle McCool known as LayCool. In May 2010, she won the WWE Women's Championship for the first time. She is the first British woman and the first Diva Search winner to hold the championship, and was the final champion when the title was retired in 2010. In April 2012, she won the WWE Divas Championship upon her return from a year-long absence due to injury, and held it until September that year. She retired in 2015.", "link_mentions": [{"page": "1977", "response": ["** Layla El, English dancer, model, and retired professional wrestler"]}, {"page": "List of people from Florida", "response": ["|Layla El (1977–)"]}, {"page": "Michelle McCool", "response": ["During the week of November 5, 2007, she appeared on six episodes of Family Feud with several other WWE wrestlers and Divas. She also appeared on the February 6, 2008, episode of Project Runway with Maria Kanellis, Candice Michelle, Torrie Wilson, Kristal Marshall, and Layla El. On June 3, 2008, she appeared on The Best Damn Sports Show Period with John Cena. In addition, McCool appeared in the January 2009 edition of Muscle & Fitness, along with Eve Torres and Maryse. She also appeared on a special WWE edition of Are You Smarter Than a Fifth Grader."]}, {"page": "Beth Phoenix", "response": ["Phoenix, along with Candice Michelle and Layla El, appeared in the February 2009 issue of FLEX Magazine."]}]}}