{"wiki_id": "http://www.wikidata.org/entity/Q231708", "itemLabel": "Edith Nesbit", "itemDescription": "English author and poet", "wikipedia_url": "https://en.wikipedia.org/wiki/E._Nesbit", "wikipedia_page": {"main": "Edith Nesbit (married name Edith Bland; 15 August 1858 – 4 May 1924) was an English author and poet, who published her books for children as E. Nesbit. She wrote or collaborated on more than 60 such books. She was also a political activist and co-founder of the Fabian Society, a socialist organisation later affiliated to the Labour Party.", "link_mentions": [{"page": "Margaret Mitchell", "response": ["An avid reader, young Margaret read \"boys' stories\" by G.A. Henty, the Tom Swift series, and the Rover Boys series by Edward Stratemeyer. Her mother read Mary Johnston's novels to her before she could read. They both wept reading Johnston's The Long Roll (1911) and Cease Firing (1912).Gardner, Sarah E. Blood and Irony: Southern white women's narratives of the Civil War, 1861–1937. Chapel Hill, NC: University of North Carolina Press, 2004. p. 241.  Between the \"scream of shells, the mighty onrush of charges, the grim and grisly aftermath of war\", Cease Firing is a romance novel involving the courtship of a Confederate soldier and a Louisiana plantation belleCooper, Frederic Tabor. \"The Theory of Endings and Some Recent Novels.\" The Bookman, November 1912, Vol. XXXVI: p. 439. with Civil War illustrations by N. C. Wyeth. She also read the plays of William Shakespeare, and novels by Charles Dickens and Sir Walter Scott.Champion, Laurie. American Women Writers, 1900–1945: a bio-bibliographical critical sourcebook. Westport, CT: Greenwood Press, 2000. p. 240.   Mitchell's two favorite children's books were by author Edith Nesbit: Five Children and It (1902) and The Phoenix and the Carpet (1904). She kept both on her bookshelf even as an adult and gave them as gifts. Another author whom Mitchell read as a teenager and who had a major impact in her understanding of the Civil War and Reconstruction was Thomas Dixon. Dixon's popular trilogy of novels The Leopard's Spots: A Romance of the White Man's Burden (1902), The Clansman: A Historical Romance of the Ku Klux Klan (1905) and The Traitor: A Story of the Rise and Fall of the Invisible Empire (1907) all depicted in vivid terms a white South victimized during the Reconstruction by Northern carpetbaggers and freed slaves, with an especial emphasis upon Reconstruction as a nightmarish time when black men ran amok, raping white women with impunity. As a teenager, Mitchell liked Dixon's books so much that she organized the local children to put on dramatizations of his books. The picture the white supremacist Dixon drew of Reconstruction is now rejected as inaccurate, but at the time, the memory of the past was such it was widely believed by white Americans. In a letter to Dixon dated August 10, 1936, Mitchell wrote: \"I was practically raised on your books, and love them very much.\""]}, {"page": "The Railway Children", "response": ["The Railway Children is a children's book by Edith Nesbit, originally serialised in The London Magazine during 1905 and first published in book form in 1906. It has been adapted for the screen several times, of which the 1970 film version is the best known. The Oxford Dictionary of National Biography credits Oswald Barron, who had a deep affection for Nesbit, with having provided the plot. The setting is thought to be inspired by Edith's walks to Grove Park nature reserve, close to where she lived on Baring Rd. Grove Park station, near the reserve, now has a mural commemorating this connection."]}, {"page": "Contemporary fantasy", "response": ["* Edith Nesbit: The Magic City, Psammead series, House of Arden series, The Enchanted Castle, The Magic World and other works"]}, {"page": "The Lion, the Witch and the Wardrobe", "response": ["Edith Nesbit's short story \"The Aunt and Amabel\" includes the motif of a girl entering a wardrobe to gain access to a magical place."]}]}}