{"wiki_id": "http://www.wikidata.org/entity/Q23204293", "itemLabel": "Sarah Smith Herford", "itemDescription": "British painter", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Smith_Herford", "wikipedia_page": {"main": "Sarah Smith Herford or Mrs. John Herford (1818-c. 1870) was a British landscape painter and educator.\n\nSarah was the daughter of Edward Smith of Birmingham and married John Herford. and founded the Unitarian Boarding School for Girls in Altrincham, Cheshire. Among her children were sons Brooke, Edward, and William Henry Herford, and daughters Mary Chance and Laura Herford. Mary Chance became the mother of the painter Helen Allingham who Sarah Herford was said to have inspired.Sarah Herford's work Landscape at Kenilworth was included in the book Women Painters of the World.", "link_mentions": [{"page": "Helen Allingham", "response": ["Paterson showed a talent for art from an early age, drawing some of her inspiration from her maternal grandmother Sarah Smith Herford and aunt Laura Herford, both accomplished artists of their day. Her younger sister Caroline Paterson also became a noted artist. She initially studied art for three years at the Birmingham School of Design. She spent a year at the Royal Female School of Art in London, before following her aunt Laura Herford to the National Art Training School. In 1867 she enrolled in the Royal Academy School, which would later become the Royal College of Art."]}, {"page": "Laura Herford", "response": ["Herford was born on 16 October 1831 to John Herford and Sarah Smith Herford. She studied under Eliza Fox (1824–1903), an artist best known for her genre and portraiture scenes which incorporated contemporary social commentary. Fox held drawing classes for female artists in the living room of her father's home in Regent's Park. Amongst others, Barbara Bodichon and Anna Mary Howitt attended these classes and others run by London-based artists. From the mid-1850s, Herford was heavily involved with the acceptance of women artists. She signed the 1859 petition to admit women to the Royal Academy. She applied under the name 'L. Hereford' and became a pupil in 1861 as the only woman at the Academy.  She exhibited at the Royal Academy from 1861 to 1869 and also at the Suffolk Street Gallery and the British Institution.Laura Hereford in Bénézit Hereford exhibited in 1864 a picture entitled A Quiet Corner, and followed up her success by similar domestic scenes in 1865, 1866, and 1867. She invited her sister's daughter, the painter Helen Allingham, to come live with her in London at the start of her career."]}, {"page": "Mrs. John Herford", "response": ["#REDIRECT Sarah Smith Herford"]}]}}