{"wiki_id": "http://www.wikidata.org/entity/Q232945", "itemLabel": "Marina Sirtis", "itemDescription": "British-American actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Marina_Sirtis", "wikipedia_page": {"main": "Marina Sirtis (; born 29 March 1955) is a British actress. She is best known for her role as Counselor Deanna Troi on the television series Star Trek: The Next Generation and four Star Trek feature films, as well as other appearances in the Star Trek franchise.", "link_mentions": [{"page": "March 29", "response": ["*  1955   – Marina Sirtis, British-American actress"]}, {"page": "Star Trek: The Next Generation", "response": ["In the 1980s, Roddenberry—who was responsible for the original Star Trek, Star Trek: The Animated Series (1973–1974), and the first of a series of films—was tasked by Paramount Pictures with creating a new series in the franchise. He decided to set it a century after the events of his original series. The Next Generation featured a new crew: Patrick Stewart as Captain Jean-Luc Picard, Jonathan Frakes as William Riker, Brent Spiner as Data, Michael Dorn as Worf, LeVar Burton as Geordi La Forge, Marina Sirtis as Deanna Troi, Denise Crosby as Tasha Yar, Wil Wheaton as Wesley Crusher, Gates McFadden as Dr. Beverly Crusher, and a new Enterprise. ", "* Marina Sirtis as Lieutenant Commander/Commander Deanna Troi is the half-human, half-Betazoid ship's counselor. Starting in the season seven episode \"Thine Own Self\", Counselor Troi, having taken and completed the bridge-officer's test, is later promoted to the rank of commander, which allowed her to take command of the ship, and also perform bridge duties other than those of a ship's counselor. The character's relationship with first officer Riker was a carry-over from character ideas developed for Phase II. Troi also appeared in later episodes of Voyager, in the finale of Enterprise, and in the first season of Picard.", "In 2005, the last episode of Star Trek: Enterprise called \"These Are the Voyages...\" (S4E22) featured a holodeck simulation on the USS Enterprise (NCC-1701-D) from Star Trek: The Next Generation during the events of the episode \"The Pegasus\" and the return of Commander William Riker (Jonathan Frakes) and Counselor Deanna Troi (Marina Sirtis).  It was written by Berman and Braga, who noted \"... this was a very cool episode because it has a great concept driving it\". "]}, {"page": "Star Trek Generations", "response": ["The main cast of Star Trek: The Next Generation reprise their roles in Generations: Patrick Stewart as Picard, Jonathan Frakes as Commander William Riker, LeVar Burton as La Forge, Brent Spiner as Data, Gates McFadden as Chief Medical Officer Commander Beverly Crusher, Michael Dorn as Lieutenant Commander Worf, and Marina Sirtis as ship's counselor Commander Deanna Troi. Recurring characters from the series return, including Barbara March and Gwynyth Walsh as the villainous Klingon sisters Lursa and B'Etor Duras, Patti Yasutake as Enterprise nurse Lieutenant Alyssa Ogawa, and Whoopi Goldberg as Guinan."]}, {"page": "Star Trek: First Contact", "response": ["* Marina Sirtis as Deanna Troi, counselor aboard the Enterprise. Sirtis missed working on the television show, and was acutely aware that expectations and stakes for First Contact were high; \"we were scared that people thought we couldn't cut it without the original cast\", she said."]}, {"page": "Star Trek: Voyager", "response": ["* Marina Sirtis, as Counselor Deanna Troi from The Next Generation, appears in \"Pathfinder\", \"Life Line\", and \"Inside Man\"."]}, {"page": "Deanna Troi", "response": ["Deanna Troi is a main character in the science-fiction television series Star Trek: The Next Generation and related TV series and films, portrayed by actress Marina Sirtis. Troi is half-human, half-Betazoid and has the psionic ability to sense emotions. She serves as the ship's counselor on USS Enterprise-D. Throughout most of the series, she holds the rank of lieutenant commander. In the seventh season, Troi takes the bridge officer's examination and is promoted to the rank of commander, but continues as counselor.", "thumb|Marina Sirtis is cast as Deanna Troi, a half-Betazoid Starfleet officer that uses her telepathic abilities to navigate her duties and personal life. ", "Marina Sirtis at first read for the role that would become Tasha Yar in 1986. She had, in total, five readings, all with Gene Roddenberry and other executives. Notably, Roddenberry took a liking to her almost immediately. Denise Crosby, who eventually won the role of Tasha, auditioned for the role of Deanna Troi. Sirtis was said to have had a more \"exotic\" feel about her.As stated in the DVD extras found on a bonus Star Trek TNG DVD", "In 2020, SyFy Wire was very positive about her performance in the Star Trek: Picard episode \"Nepenthe\", explaining that \"It features Deanna Troi at her very best, with Marina Sirtis at the height of her powers.\""]}, {"page": "1955", "response": ["** Marina Sirtis, English actress"]}, {"page": "Cockney", "response": ["*Marina Sirtis, actress, born in Hackney"]}, {"page": "List of Star Trek: The Next Generation episodes", "response": ["The main cast consisted of Patrick Stewart as captain Jean-Luc Picard, Jonathan Frakes as his second-in-command William Riker, Brent Spiner as chief of operations Data, LeVar Burton as chief engineer Geordi La Forge, Marina Sirtis as counselor Deanna Troi, Michael Dorn as chief of security Worf, and Gates McFadden as Dr. Beverly Crusher. McFadden left the show after the first season and was replaced for the second season with Diana Muldaur as Dr. Katherine Pulaski, but returned for the third season and remained with the cast thereafter. Wil Wheaton starred as Wesley Crusher in seasons 1–4, returning for guest appearances in seasons 5 and 7. Denise Crosby played chief security officer Tasha Yar in the first season but her character was killed in the episode \"Skin of Evil\", returning for a guest appearance in season 3. "]}, {"page": "Majel Barrett", "response": ["Barrett-Roddenberry died on the morning of December 18, 2008, at her home in Bel Air, Los Angeles, California, as a result of leukemia. She was 76 years old.Sci-fi icon Majel Barrett Roddenberry dies at 76, Reuters, Thursday, December 18, 2008 A public funeral was held on January 4, 2009, in Los Angeles. More than 250 people attended, including Nichelle Nichols, George Takei, Walter Koenig, Marina Sirtis, Brent Spiner and Wil Wheaton."]}, {"page": "Guinan (Star Trek)", "response": ["Guinan appears in \"The Best of Both Worlds\" part one, where she and Captain Picard mull over his tactics defending the ship from a Borg vessel, contemplating the potential end of human civilization. Guinan assures Picard that, based on her experience with the Borg, \"humanity will survive\" even if only a handful of humans live to \"keep the spirit alive\". Guinan also plays a role in the second part which started the fourth season. She advises Commander William Riker (Jonathan Frakes) in his predicament in dealing with the Borg-assimilated Picard. She tells him that her relationship with Picard \"goes beyond friendship and beyond family\". She appears in the following episode broadcast, which follows up on Picard's experiences as a Borg, \"Family\". In \"The Loss\", Guinan advises Counselor Deanna Troi (Marina Sirtis) when she loses her empathic senses, telling her that she still has her skills as a counselor to rely on. Guinan joins Picard in his holodeck program Dixon Hill in the episode \"Clues\". Her other appearances in the season included \"Galaxy's Child\", \"Night Terrors\" where she reveals she keeps a rifle behind the bar, \"In Theory\", and the first part of \"Redemption\" where she scores higher than Klingon Security Chief Worf (Michael Dorn) on a firing range on the holodeck."]}, {"page": "Tasha Yar", "response": ["Natasha \"Tasha\" Yar is a fictional character that mainly appeared in the first season of the American science fiction television series Star Trek: The Next Generation. Portrayed by Denise Crosby, Yar is chief of security aboard the Starfleet starship USS Enterprise-D and carries the rank of lieutenant. The character's concept was originally based upon the character of Vasquez from the film Aliens (1986). Following further development she became known first as Tanya, and then Tasha. Crosby had originally auditioned for the role of Deanna Troi, while Rosalind Chao became a favorite for Tasha. After Marina Sirtis auditioned for the role, the series' creator Gene Roddenberry decided to switch the roles for the actresses, with Sirtis becoming Troi and Crosby becoming Yar. Chao would later appear on the series in a recurring role as Keiko O'Brien.", "In April 1987, Lianne Langland, Julia Nickson, Rosalind Chao, Leah Ayres and Bunty Bailey were each listed as being in contention for the role. Chao was a favorite candidate, while Denise Crosby was described as \"the only possibility\" for the character of Deanna Troi. The production staff were not keen on having two actresses in the bridge crew roles with similar physical types and hair colors, and so the team took account of the casting of the two roles together.Nemecek (2003): p. 18 The writers and directors guide described Yar as having a muscular but very feminine body type, and being sufficiently athletic to defeat most other crew members in martial arts. After Crosby and Marina Sirtis had each auditioned for Troi and Yar respectively, Gene Roddenberry decided to switch the actresses and cast Crosby as Tasha Yar. He felt that Sirtis' appearance was better suited to the \"exotic\" Troi."]}, {"page": "Patrick Stewart", "response": ["When Stewart was picked for the role of Captain Jean-Luc Picard in Star Trek: The Next Generation (1987–1994), the Los Angeles Times called him an \"unknown British Shakespearean actor\". Still living out of his suitcase because of his scepticism that the show would succeed, he was unprepared for the long schedule of television production that began at 4:45 am each day. He initially experienced difficulty fitting in with his less-disciplined castmates, saying that his \"spirits used to sink\" when he was required to memorise and recite technobabble. He eventually came to better understand the cultural differences between the stage and television, and his favourite technical line became \"spacetime continuum\". He remained close friends with his fellow Star Trek actors and became their advocate with the producers when necessary. Marina Sirtis credited Stewart with \"at least 50%, if not more\" of the show's success because others imitated his professionalism and dedication to acting."]}, {"page": "Kate Mulgrew", "response": ["During Voyager, Mulgrew also played the role of Titania in the animated series Gargoyles (along with fellow Star Trek actors Marina Sirtis and Jonathan Frakes) and Victoria Riddler in Riddler's Moon, a made-for-TV movie."]}, {"page": "Guildhall School of Music and Drama", "response": ["*Marina Sirtis – (Star Trek, Gargoyles)"]}, {"page": "Reginald Barclay", "response": ["In his inaugural appearance in The Next Generations third season episode \"Hollow Pursuits\", Lieutenant Junior Grade Barclay suffers from \"holodiction\" and recreates the crew of the Enterprise-D on the holodeck with attributes and in settings which allow him to more easily interact with them.  Counselor Deanna Troi (Marina Sirtis) and Guinan (Whoopi Goldberg) both support Barclay in escaping to his fantasies, though Troi is miffed to later find herself recreated as \"the Goddess of Empathy\", in what Dr. Lynne Joyrich—Brown University professor of modern culture and media—described as \"a clear sexual invitation\".  Despite his embarrassment, Barclay saves the Enterprise, \"gaining both self-confidence and a newfound respect from his peers as a result.\""]}, {"page": "Katherine Pulaski", "response": ["Following Data's defeat at a game of stratagema in \"Peak Performance\", Pulaski and Counselor Deanna Troi (Marina Sirtis) attempt to console him, but it is left to Captain Picard to convince Data that he is not malfunctioning. Pulaski's final appearance on The Next Generation was in the episode \"Shades of Gray\". When Commander Riker falls ill to a dangerous virus during an away team mission, Pulaski drives out the virus with a device that stimulates his memory centre. After she discovers that negative memories are more effective in removing the virus, she uses memories of fear and survival to save Riker's life."]}, {"page": "Star Trek: Nemesis", "response": ["* Marina Sirtis as Counselor Deanna Troi Sirtis was \"ecstatic\" about the role Troi plays in the movie. She was pleased with the wedding scene, saying that the dress she wore for Nemesis was nicer than the one she wore at her actual wedding. She was happy to work once again with Wil Wheaton and Whoopi Goldberg, but felt that the film would be the last one with the entire cast of The Next Generation. She remained certain that it would not be the last Star Trek film to be made, as she thought that Paramount would want to make a film involving a variety of characters from the different Star Trek series.", "Actors LeVar Burton and Marina Sirtis have spoken unflatteringly of Baird, criticizing him for not watching any of the episodes of The Next Generation. Sirtis has bluntly called Baird \"an idiot.\" Jonathan Frakes, while praising both the character of Shinzon and actor Tom Hardy, said that if he himself had directed, as he had done with the previous two Trek films, he would have made the film less villain-centric and given more screen time to the regular Next Generation cast."]}, {"page": "Star Trek: Insurrection", "response": ["Lieutenant Commander Data (Brent Spiner) is temporarily transferred to an undercover mission observing the peaceful Ba'ku people. While on their planet, he malfunctions and reveals the presence of the joint Federation–Son'a task force observing the Ba'ku. Admiral Matthew Dougherty (Anthony Zerbe) contacts the USS Enterprise-E to obtain Data's schematics for recovery purposes, but adamantly states the presence of the Enterprise is not needed. The crew decides to ignore these orders and takes the Enterprise to capture Data. Captain Jean-Luc Picard (Patrick Stewart) becomes suspicious of Dougherty's insistence that the Enterprise is no longer needed and orders the cause of Data's malfunction to be investigated. The crew discovers that the Ba'ku possess advanced technology, but have rejected its use to live simpler lives. Due to unique \"metaphasic particles\" emanating from their planet's rings, they are effectively immortal. By contrast, the Federation's allies, the Son'a, are a decrepit race who rely on medical technology to prevent death; their excessive use of cosmetic surgery gives them a mummified appearance. The Enterprise crew also begin to experience the rejuvenation effects of the planet: Lt. Commander Geordi La Forge (LeVar Burton) finds his eyes have regenerated and he no longer requires ocular implants, Commander William Riker (Jonathan Frakes) and Counselor Deanna Troi (Marina Sirtis) rekindle their long-abandoned relationship, and Picard develops a romantic relationship with the Ba'ku woman Anij (Donna Murphy).", "* Marina Sirtis as Counselor Deanna Troi", "Michael Dorn returned as Lieutenant Commander Worf, having portrayed him in Deep Space Nine since 1995. Reprising her role as Doctor Beverly Crusher, Gates McFadden said that \"Shooting Star Trek and getting paid to do it is great. But what's actually changed my life the most is traveling around and ... being a tiny little part of this huge mythology that has changed people's lives, in many ways for the better.\" Marina Sirtis appeared once more as Counselor Deanna Troi. She was positive about the film, saying \"we've been involved with this for eleven years, we've done 179 episodes, three movies, and there are still surprises. There are more layers in this movie, it's not as black and white. It goes back to a lot of what Gene Roddenberry felt about Star Trek — I think he's going to be very happy up there when he sees this movie.\"", "As part of a collection of Star Trek: The Next Generation films, Insurrection was released on Blu-ray and DVD on September 22, 2009. The Blu-ray transfer is presented in 1080p high definition enhanced for widescreen television and features 5.1 Dolby TrueHD audio in English, French and Spanish. The release also contains \"Creating the Illusion\" featurettes and new commentary by Jonathan Frakes and Marina Sirtis."]}, {"page": "2002 in film", "response": ["| Star Trek: Nemesis || Paramount Pictures || Stuart Baird (director); John Logan (screenplay); Patrick Stewart, Jonathan Frakes, Brent Spiner, LeVar Burton, Michael Dorn, Gates McFadden, Marina Sirtis, Tom Hardy, Ron Perlman, Dina Meyer, John Berg, Kate Mulgrew, Shannon Cochran, Jude Ciccolella, Alan Dale, Wil Wheaton, Majel Barrett, Stuart Baird, Bryan Singer, Whoopi Goldberg || Sci-Fi, Action || Live Action"]}, {"page": "1995 in film", "response": ["| Gargoyles the Movie: The Heroes Awaken || Buena Vista Home Video / Walt Disney Television Animation || Saburo Hashimoto, Takamitsu Kawamura, Kazuo Terada (directors); Eric Luke, Michael Reaves (screenplay); Thom Adcox-Hernandez, Edward Asner, Jeff Bennett, Clancy Brown, J.D. Daniels, Keith David, Bill Fagerbakke, Jonathan Frakes, Pat Fraley, Ed Gilbert, Peter Renaday, Salli Richardson, Marina Sirtis, Kath Soucie, Frank Welker || Action, Adventure || Animation"]}, {"page": "1996 in film", "response": ["| Star Trek: First Contact || Paramount Pictures || Jonathan Frakes (director); Brannon Braga, Ronald D. Moore (screenplay); Patrick Stewart, Jonathan Frakes, Brent Spiner, LeVar Burton, Michael Dorn, Gates McFadden, Marina Sirtis, Alfre Woodard, James Cromwell, Alice Krige, Michael Horton, Neal McDonough, Marnie McPhail, Robert Picardo, Dwight Schultz, Adam Scott, Eric Steinberg, Patti Yasutake, Majel Barrett, Don Stark, Cully Fredricksen, Dan Woren, Ethan Phillips || Sci-Fi || Live action"]}, {"page": "1998 in film", "response": ["| Star Trek: Insurrection || Paramount Pictures || Jonathan Frakes (director); Michael Piller (screenplay); Patrick Stewart, Jonathan Frakes, Brent Spiner, LeVar Burton, Michael Dorn, Gates McFadden, Marina Sirtis, F. Murray Abraham, Donna Murphy, Anthony Zerbe, Stephanie Niznik, Daniel Hugh Kelly, Gregg Henry, Michael Welch, Michael Horton, Tom Morello, Bruce French, Joseph Ruskin, McKenzie Westmore || Sci-Fi, Action || Live action"]}, {"page": "1955 in television", "response": ["| Marina Sirtis"]}, {"page": "1994 in film", "response": ["| Star Trek Generations || Paramount Pictures || David Carson (director); Ronald D. Moore, Brannon Braga (screenplay); Patrick Stewart, William Shatner, Jonathan Frakes, Brent Spiner, LeVar Burton, Michael Dorn, Gates McFadden, Marina Sirtis, Malcolm McDowell, James Doohan, Walter Koenig, Alan Ruck, Jacqueline Kim, Jenette Goldstein, Thomas Kopache, Glenn Morshower, Tim Russ, Tommy Hinkley, Patti Yasutake, Majel Barrett, Barbara March, Gwynyth Walsh, Rif Hutton, Brian Thompson, Thomas Alexander Dekker, Olivia Hack, Whoopi Goldberg || Sci-Fi || Live action"]}, {"page": "1992 in film", "response": ["| Waxwork II: Lost in Time || Live Home Video / Electric Pictures || Anthony Hickox (director/screenplay); Zach Galligan, Alexander Godunov, Monika Schnarre, Martin Kemp, Bruce Campbell, Michael Des Barres, Jim Metzler, Sophie Ward, Marina Sirtis, Billy Kane, Juliet Mills, John Ireland, Patrick Macnee, David Carradine, George \"Buck\" Flower, Paul Hampton, Stanley Sheff, Elisha Shapiro, Maxwell Caulfield, Kate Murtagh, Anthony Hickox, Harrison Young, Frank Zagarino, Brent Bolthouse, Caron Bernstein, Gerry Lively, Paul Madigan, Kim Henderson, Bob Keen, John Mappin, Robert Kass, Drew Barrymore, Godzilla, Joe Baker, James D.R. Hickox, John O'Leary, Erin Breznikar, Michael Viela, Dorian Langdon, Jonathan Breznihar, Mark Courier, Steve Painter, Paul Jones, Alex Butler, Yolanda Jilot || Fantasy, Comedy || Live action "]}, {"page": "1985 in film", "response": ["| Death Wish 3 || Cannon Film Distributors || Michael Winner (director/screenplay); Menahem Golan, Yoram Globus (screenplay); Charles Bronson, Deborah Raffin, Ed Lauter, Martin Balsam, Gavan O'Herlihy, Alex Winter, Marina Sirtis, Ricco Ross, Barbie Wilde, Manning Redwood || Action, Thriller || Live action"]}, {"page": "1983 in film", "response": ["| The Wicked Lady || MGM/UA / The Cannon Group || Michael Winner (director/screenplay); Leslie Arliss, Aimée Stuart, Gordon Glennon (screenplay); Faye Dunaway, Alan Bates, John Gielgud, Denholm Elliott, Hugh Millais, Prunella Scales, Oliver Tobias, Glynis Barber, Joan Hickson, Helena McCarthy, Mollie Maureen, Derek Francis, Marina Sirtis, Nicholas Gecks, John Savident, Marc Sinden, Mark Burns || Drama || Live action"]}, {"page": "Family Guy", "response": ["Episodes often feature guest voices from a wide range of professions, including actors, athletes, authors, bands, musicians, and scientists. Many guest voices star as themselves. Leslie Uggams was the first to appear as herself, in the fourth episode of the first season, \"Mind Over Murder\".  The episode \"Not All Dogs Go to Heaven\" guest starred the entire cast of Star Trek: The Next Generation, including Patrick Stewart, Jonathan Frakes, Brent Spiner, LeVar Burton, Gates McFadden, Michael Dorn, Wil Wheaton, Marina Sirtis, and even Denise Crosby (season 1 as Tasha Yar), playing themselves; this is the episode with the most guest stars of the seventh season."]}, {"page": "Reading Rainbow", "response": ["* Marina Sirtis"]}, {"page": "Armin Shimerman", "response": ["Along with Patrick Stewart, Marina Sirtis, Jonathan Frakes, John de Lancie, Michael Ansara, and Richard Poe, he is one of only a few actors to play the same character on three different Star Trek series. He played Quark in Star Trek: The Next Generation, Star Trek: Deep Space Nine and Star Trek: Voyager. He reprised the role of Quark in the 1998 film Star Trek: Insurrection but only in deleted scenes."]}, {"page": "Randy Barnett", "response": ["* InAlienable (2008)  Assistant to Crystal Barry (Marina Sirtis) (InAlienable IMDB entry)"]}, {"page": "Gargoyles (TV series)", "response": ["The voice cast featured several actors who are alumni of the Star Trek franchise, including Marina Sirtis and Jonathan Frakes (respectively, Deanna Troi and William Riker on Star Trek: The Next Generation), who were featured regularly as principal cast members. Other Star Trek actors had recurring roles on Gargoyles, including Michael Dorn (Worf on TNG and Star Trek: Deep Space Nine), Kate Mulgrew (Kathryn Janeway on Star Trek: Voyager), Nichelle Nichols (Uhura on Star Trek: The Original Series), and Brent Spiner (Data on TNG); while Avery Brooks (Benjamin Sisko on DS9), Colm Meaney (Miles O'Brien on TNG and DS9), and LeVar Burton (Geordi La Forge on TNG) made guest appearances.", "CONvergence 2014 featured a Gargoyles related theme with many guests from the series including Greg Weisman, Thom Adcox, Marina Sirtis, C. Robert Cargill, Scott Lynch, Amy Berg, and Emma Bull. It is a four-day convention held in Bloomington, Minnesota over the Fourth of July weekend. It was done to celebrate the series' 20th anniversary."]}, {"page": "Encounter at Farpoint", "response": ["The episode was made as a pilot for the new Star Trek series, and was a double length episode at Paramount Television Group's insistence. After the show was initially announced on October 10, 1986, Roddenberry put together a production team which included staff members from the original series such as Robert H. Justman. The show used some existing sets and props from the Star Trek films and both Star Trek: The Original Series and Star Trek: Phase II. New actors were hired for the pilot, which in some cases required the character concepts to be redeveloped to better fit the actor. Marina Sirtis and Denise Crosby were hired for the roles of Macha Hernandez and Deanna Troi respectively, but were later switched by Roddenberry and Crosby's new role renamed to Tasha Yar.", "As the Enterprise arrives, the crew members explore the offerings of Farpoint Station and establish relations with their Bandi host, Groppler Zorn (Michael Bell). The crew becomes suspicious when items they desire seem to appear out of nowhere moments later, and are unable to identify the power source that feeds the station. Deanna Troi (Marina Sirtis), an empath, senses a being with powerful yet despairing emotions nearby, and the crew discover a strange labyrinth beneath the station, but Zorn does not offer an explanation. As the Enterprise crew continues its explorations, a large unknown alien craft enters orbit and begins to fire upon an older Bandi settlement near Farpoint Station, and abducts Zorn. Before Picard orders the ship's phasers to be fired at the craft, Q appears to remind him of humanity's trial and prompts Picard to send an away team to the alien craft. The away team discovers the craft has passages similar to those under Farpoint and they are able to free Zorn. Their actions cause the alien craft to transform into a jellyfish-like space creature, and Picard is able to deduce the mystery of Farpoint Station. He confirms with the apologetic Zorn that the Bandi found a similar lifeform injured on their planet and, while attempting to care for it, they also exploited its ability to synthesize matter to create Farpoint Station. The creature now in orbit is trying to help free its mate by attacking those who hold it captive.", "thumb|right|upright|English actress Marina Sirtis originally gained the role of Security Chief Macha Hernandez", "Marina Sirtis auditioned for the role of Macha Hernandez, while Denise Crosby auditioned for the part of Deanna Troi. They both gained the parts with the approval of Berman and Justman, but Roddenberry switched the roles of the actresses as he thought Sirtis would be better suited for the role of the ship's counselor. Macha Hernandez was re-written to become Tasha Yar to better suit Crosby.", "Jill L. Lanford watched the episode for The Herald Journal, prior to the series premiere. She thought it was a resurrection of a \"legend\". She believed the episode itself was reminiscent of classic Star Trek episodes \"Arena\" and \"The Squire of Gothos\", was the \"perfect vehicle to introduce the crew\", and a \"perfect start\". Don Merrill, writing for TV Guide said that the show was a \"worthy successor to the original\".Reeves-Stevens (1998): p. 58 Bob Niedt reviewed \"Encounter at Farpoint\" for Newhouse News and thought that the show had potential on the back of the episode, but there were problems such as \"spots where the dialogue is pedestrian and interactions sputter\". Tom Shales of The Washington Post viewed DeForest Kelley's cameo as \"touching\", but thought that Patrick Stewart was a \"grim bald crank who would make a better villain\". He felt Jonathan Frakes \"verges on namby-pamby\". Actress Marina Sirtis later recalled the reviews of the show's debut in 1987 while being interviewed to promote The Next Generation's fourth film, Star Trek: Nemesis, saying \"they bloody hated us\". "]}, {"page": "When the Bough Breaks (Star Trek: The Next Generation)", "response": ["The Enterprise enters the Epsilon Mynos system, searching for the legendary world of Aldea. The planet de-cloaks, and reveals itself to the ship. The Aldeans beam down Commander William Riker (Jonathan Frakes), Counselor Deanna Troi (Marina Sirtis), and Chief Medical Officer Beverly Crusher (Gates McFadden) to the planet. The Aldeans explain that they have been unable to bear children for many years and revealed themselves to the Enterprise in hopes they could trade their advanced technology for some of the Enterprise's children so that they can re-populate their world. Riker refuses and the crew is returned to the Enterprise. Simultaneously, seven children, including young Wesley Crusher (Wil Wheaton), are taken down to the planet protected by a planetary energy shield that the crew of the Enterprise are unable to penetrate. While the Aldean elders attempt to integrate the children into their society, Wesley is shown the \"Custodian\", an ancient computer system that the Aldeans rely on but do not understand."]}, {"page": "Denise Crosby", "response": ["In 1987, Crosby was cast in the role of Tasha Yar for the much-publicized return of Star Trek to television in the syndicated series Star Trek: The Next Generation. She had been chosen to play Counselor Deanna Troi before Gene Roddenberry switched the roles that  Marina Sirtis and she had originally been given. Initially one of the top-billed characters and featured prominently in episodes such as \"The Naked Now\" and \"Code of Honor\", the role of Tasha gradually moved into the background as other members of the ensemble cast became a greater focus of the series.  Crosby reportedly grew disillusioned with her role because of its \"Uhura-like\" status: \"I was struggling with not being able to do much with the character. I had all these ideas and couldn't do them. I was just stage dressing.\" Ultimately, Crosby decided to leave the show. Her character was killed by the alien creature Armus during the episode \"Skin of Evil\". She had appeared in 22 episodes when she left."]}, {"page": "Conspiracy (Star Trek: The Next Generation)", "response": ["While the Enterprise is en route to Pacifica on a scientific mission, Captain Picard (Patrick Stewart) receives a highly confidential message from an old friend, Captain Walker Keel (Jonathan Farwell) of the USS Horatio. Keel refuses to discuss his concerns, even though the frequency he is using is supposed to be a secure channel, and insists on a face-to-face meeting. Once they arrive at Dytallix B for this secret meeting, the crew discover the Horatio and two other Federation ships already present. Picard beams alone to the surface and is met by Captain Keel and the other captains. Keel reports strange orders from Starfleet headquarters and what he implies are suspicious deaths of Starfleet officers, and expresses concern of a conspiracy. Picard refuses to accept this without proof, but Keel warns him to remain wary. When the captain returns to the Enterprise, he is challenged by Counselor Troi (Marina Sirtis) about keeping his contact with Keel secret. Picard is skeptical about the conspiracy, but says that he trusts his old friend completely. The Enterprise resumes its previous journey. Picard has Lt. Commander Data (Brent Spiner) review all orders issued by Starfleet Command in the past six months. While the ship is still on its way to Pacifica, a disturbance is detected in nearby space. Upon investigating this, the Enterprise discovers a mass of debris that surely must be the shattered remains of the Horatio. Data completes his study and finds several strange orders from the senior levels of Starfleet. Picard informs his senior staff of the conspiracy theory, and orders the Enterprise to Earth."]}, {"page": "The Measure of a Man (Star Trek: The Next Generation)", "response": ["Spiner identified this episode as his favorite episode of The Next Generation. In an interview, Stewart concurred that this is \"the first truly great episode of the series\", and added that it went to the \"heart of the fundamentals of the Star Trek philosophy and what Gene Roddenberry had been writing about in different ways from the mid '60s.\" But he said that his favourite episode was \"The Inner Light\". On Twitter in April 2013, Marina Sirtis (Troi) named this as her favorite episode."]}, {"page": "Michael Winner", "response": ["Following the allegations made against Harvey Weinstein in October 2017, Winner was accused by three women, Debbie Arnold, Cindy Marshall-Day and an unidentified woman, of demanding they expose their breasts to him – in Arnold's case during an audition at his home. The two named women refused. Actress Marina Sirtis, who was directed by Winner in The Wicked Lady and Death Wish 3, has implied she was mistreated by Winner, as reported by The Stage in 2019:"]}, {"page": "The Neutral Zone (Star Trek: The Next Generation)", "response": ["The survivors—Claire Raymond (Gracie Harrison), a housewife; Ralph Offenhouse (Peter Mark Richman), a financier; and L. Q. \"Sonny\" Clemmons (Leon Rippy), a musician—are from the late 20th century. All died of incurable illnesses at the time and were placed in cryonic suspension after their deaths in the hope that cures might be found in the future. Dr. Crusher, in reviving them, easily cures them of their illnesses. They have to cope with the culture shock of awakening in a distant future with the realization that everything they knew and had are now gone. Of the three, Clemmons seems to fare the best at adapting to life in the future and befriends Data. Claire is distraught at the thought of losing everyone she ever knew, particularly her children, so Counselor Troi (Marina Sirtis) suggests searching for Claire's descendants. Offenhouse is irritated by the lack of access to news or other information, and uses the comm unit to disturb Picard on the bridge. Picard comes down to assure everyone that all questions will be answered, but that the ship's mission requires Picard's full attention."]}, {"page": "Diana Muldaur", "response": ["Some television critics praised Muldaur's performance, with one noting her \"wry, no-nonsense warmth that plays nicely off of some of the icier regulars\". The addition of Muldaur, along with Whoopi Goldberg, also served to redress the absence of women from the principal cast, as the departure of McFadden and Denise Crosby had left only Marina Sirtis, a rapid attrition of women that recalled the imbalance of the original Star Trek series."]}, {"page": "Parallels (Star Trek: The Next Generation)", "response": ["Braga intended to focus the \"Parallels\" on Jean-Luc Picard (Patrick Stewart), but this was changed to Worf in order to make the differences more obvious across the timelines, as Braga worried that Picard's relationships could not significantly differ across near-universes. The producers were concerned with the confusing nature of the initial proposal, but felt that further changes greatly improved it. Wil Wheaton appeared as Wesley Crusher, replacing the initial plan to include Tasha Yar, after Braga was concerned about copying \"Yesterday's Enterprise\". \"Parallels\" received Nielsen ratings of 12.8 percent, one of the highest for the season, but some fans were upset at a Worf/Deanna Troi romance. Critics responded favorably, with praise for both Dorn and Marina Sirtis."]}, {"page": "List of Star Trek characters", "response": ["| Marina Sirtis", "|Marina Sirtis"]}, {"page": "The Host (Star Trek: The Next Generation)", "response": ["Odan's presence becomes dominating over Riker, and Dr. Crusher finds herself initially confused when Odan continues to try to engage with her to continue their relationship. Dr. Crusher is puzzled and full of emotion as she later confides to Counselor Deanna Troi (Marina Sirtis) and wonders about the true depth of her feelings for Odan. With some effort, Odan in Riker's body manages to convince the delegates from the warring planets to work with him. However, Riker's body begins to deteriorate due to the incompatibility of different biologies. The ship transporting the new host has encountered engine malfunctions. Dr. Crusher does everything she can to extend Riker's and Odan's chances while the Enterprise races to meet the Trill ship, and has a deeply emotional moment with Captain Jean-Luc Picard (Patrick Stewart)."]}, {"page": "The Child (Star Trek: The Next Generation)", "response": ["Set in the 24th century, the series follows the adventures of the Starfleet crew of the Federation starship Enterprise-D. In this episode, ship's Counselor Deanna Troi (Marina Sirtis) becomes pregnant by an alien entity and gives birth to a mysterious child. This causes problems for the Enterprise, which is transporting dangerous plague strains. The child's presence on the ship begins to endanger the crew due to effects on a virus sample being transported by the ship. It sacrifices its physical body, turning back into an energy being, telling Troi why it visited before departing.", "The new Chief Medical Officer, Dr. Katherine Pulaski (Diana Muldaur), is brought aboard the Enterprise as it prepares to travel to Aucdet IX in order to take on dangerous virus samples, which will be carried to a Starfleet Medical station hoping they will be able to devise a cure for a plague epidemic in the Rachelis System. After taking aboard the new doctor, the ship is traveling at sub light speed when a ball of energy passes in through the hull, eventually settling in the womb of Counselor Deanna Troi (Marina Sirtis). Captain Jean-Luc Picard (Patrick Stewart) wonders why the new doctor hadn't checked in with him, and locates her in the Ten Forward lounge, where the bartender, Guinan (Whoopi Goldberg), works. Picard finds Doctor Pulaski talking with Troi about her unexpected pregnancy. The senior officers meet to discuss the pregnancy. The fetus is developing at an accelerated rate and would be fully developed in 36 hours. Troi does not know who the father is, but was aware of a \"presence\" entering her body the night before. Though the senior staff debate terminating the pregnancy, Troi decides she will carry the child to term.", "thumb|right|upright|alt=A dark haired woman sits, looking to her left.|Marina Sirtis (pictured) was pleased with the episode as she felt her character was overlooked during the first season."]}, {"page": "Casualty (TV series)", "response": ["A survey published by Radio Times magazine in March 2004 found that Casualty has featured more future stars than any other UK soap or drama series. Actors who appeared in the show before wider success include Kate Winslet, Orlando Bloom, Minnie Driver, Alfred Molina, Christopher Eccleston, Tom Hiddleston, Ashley Artus, Parminder Nagra, Caryn Edwards, Sadie Frost, Ray Winstone, David Walliams, Jonny Lee Miller, Martin Freeman, Helen Baxendale, Robson Green and Brenda Fricker. Discussing her 1993 appearance in Casualty, Winslet told the Radio Times: \"In England, it almost seems to be part of a jobbing actor's training [to appear in Casualty]. As far as I was concerned it was a great episode, a great part. Appearing in Casualty taught me a big lesson in how to be natural in front of the camera.\" In addition, the series has featured a variety of more established stars, including Marina Sirtis, Norman Wisdom, Amanda Redman, Anita Dobson, Jenny Seagrove, Rula Lenska, Prunella Scales, Celia Imrie, Toyah Willcox, Maureen Lipman, Frances Barber, Andrew Sachs, Russ Abbot, Stephanie Beacham, Honor Blackman and Michelle Collins in cameo roles."]}, {"page": "Star Trek: The Magazine", "response": ["|v1 No. 10 || 2/00 || Marina Sirtis, J. G. Hertzler || USS Enterprise (NCC-1701-D), computer systems, the Krenim, Seven of Nine || designing the USS Enterprise (NCC 1701)", "|v1 No. 18 || 10/00 || Kate Mulgrew, Marina Sirtis || USS Voyager (NCC-74656), Kathryn Janeway, Alice, the Klingon Civil War || special Star Trek: Voyager issue", "|v3 No. 10 || 2/03 || Brent Spiner, Tom Hardy, Jonathan Frakes, Marina Sirtis, Stuart Baird, John Logan || USS Enterprise NCC-1701-D, Counselor Troi, Romulan Bird of Prey: 2152 || 3 covers, special Nemesis issue, designing the Reman Scorpion, Starfleet Technical Database – Romulan Propulsion Historical Overview, the Romulan Star Empire, designing the Scimitar"]}]}}