{"wiki_id": "http://www.wikidata.org/entity/Q232899", "itemLabel": "Mary Dyer", "itemDescription": "Quaker martyr", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Dyer", "wikipedia_page": {"main": "Mary Dyer (born Marie Barrett; c. 1611 – 1 June 1660) was an English and colonial American Puritan turned Quaker who was hanged in Boston, Massachusetts Bay Colony, for repeatedly defying a Puritan law banning Quakers from the colony.  She is one of the four executed Quakers known as the Boston martyrs.\nHer birthplace has not been established, but we know that she was married in London in 1633 to William Dyer, a member of the Fishmongers' Company but a milliner by profession.  Mary and William were Puritans who were interested in reforming the Anglican Church from within, without separating from it.  As the English king increased pressure on the Puritans, they left England by the thousands to go to New England in the early 1630s. Mary and William arrived in Boston by 1635, joining the Boston Church in December of that year.  Like most members of Boston's church, they soon became involved in the Antinomian Controversy, a theological crisis lasting from 1636 to 1638.  Mary and William were strong advocates of  Anne Hutchinson and John Wheelwright in the controversy, and as a result, Mary's husband was disenfranchised and disarmed for supporting these \"heretics\" and also for harboring his own heretical views.  Subsequently, they left Massachusetts with many others to establish a new colony on Aquidneck Island (later Rhode Island) in Narraganset Bay.\nBefore leaving Boston, Mary had given birth to a severely deformed infant that was stillborn. Because of the theological implications of such a birth, the baby was buried secretly.  When the Massachusetts authorities learned of this birth, the ordeal became public, and in the minds of the colony's ministers and magistrates, the monstrous birth was clearly a result of Mary's \"monstrous\" religious opinions.  More than a decade later, in late 1651, Mary Dyer boarded a ship for England, and stayed there for over five years, becoming an avid adherent of the Quaker religion that had been established by George Fox several years earlier.  Because Quakers were considered among the most heinous of heretics by the Puritans, Massachusetts enacted several laws against them.  When Dyer returned to Boston from England, she was immediately imprisoned and then banished.  Defying her order of banishment, she was again banished, this time upon pain of death.  Deciding that she would die as a martyr if the anti-Quaker laws were not repealed, Dyer once again returned to Boston and was sent to the gallows in 1659, having the rope around her neck when a reprieve was announced.  Not accepting the reprieve, she again returned to Boston the following year and was then hanged to become the third of four Quaker martyrs.", "link_mentions": {}}}