{"wiki_id": "http://www.wikidata.org/entity/Q232786", "itemLabel": "Alice Eve", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Alice_Eve", "wikipedia_page": {"main": "Alice Sophia Eve (born 6 February 1982) is an English actress. Her movie career includes roles in She's Out of My League, Men in Black 3, Star Trek Into Darkness, and Before We Go. She has had recurring roles on the TV series Entourage and Iron Fist.", "link_mentions": [{"page": "February 6", "response": ["*  1982   – Alice Eve, English actress "]}, {"page": "1982", "response": ["* February 6 – Alice Eve, English actress"]}, {"page": "1982 in American television", "response": ["|Alice Eve"]}, {"page": "Agatha Christie's Poirot", "response": ["Alongside recurring characters, the early series featured actors who later achieved greater fame, including Sean Pertwee (\"The King of Clubs\", 1989; \"Dead Man's Folly\", 2013), Joely Richardson (\"The Dream\", 1989), Polly Walker (\"Peril at End House\", 1990), Samantha Bond (\"The Adventure of the Cheap Flat\", 1990), Christopher Eccleston (\"One, Two, Buckle My Shoe\", 1992), Hermione Norris (\"Jewel Robbery at The Grand Metropolitan\", 1993), Damian Lewis (\"Hickory Dickory Dock\", 1995), Jamie Bamber (\"The Murder of Roger Ackroyd\", 2000), Russell Tovey (\"Evil Under the Sun\", 2001), Kelly Reilly (\"Sad Cypress\", 2003), Emily Blunt (\"Death on the Nile\", 2004), Alice Eve (\"The Mystery of the Blue Train\", 2005), Michael Fassbender (\"After the Funeral\", 2006), Aiden Gillen (\"Five Little Pigs\", 2003), Toby Jones and Jessica Chastain (\"Murder on the Orient Express\", 2010), and Tom Ellis (\"Dead Man's Folly\", 2013)."]}, {"page": "1982 in film", "response": ["* February 6 – Alice Eve, English actress"]}, {"page": "List of people educated at Westminster School", "response": ["*Alice Eve (born 1982), actress"]}, {"page": "Gary Oldman", "response": ["In 2015, Oldman played the head of police that investigates Tom Hardy's character in Child 44, alongside Noomi Rapace and Joel Kinnaman, and had a supporting role in the post-apocalyptic American thriller Man Down, directed by Dito Montiel, and starring alongside Shia LaBeouf and Kate Mara. In 2016, Oldman played a CIA chief in Criminal, directed by Ariel Vromen, and starring Kevin Costner, Tommy Lee Jones, Ryan Reynolds, Alice Eve, and Gal Gadot."]}, {"page": "Maxim (magazine)", "response": ["*Alice Eve (April 2010), age 27"]}, {"page": "Christine Chapel", "response": ["For Star Trek: The Animated Series, Barrett was initially set to reprise the role of Chapel as well as voicing Uhura. Likewise James Doohan was to voice both his own Scotty as well as Hikaru Sulu. However, following the intervention of Leonard Nimoy, Nichelle Nichols and George Takei were both brought back to voice their own characters. Barrett returned in Star Trek: The Motion Picture as Chapel, which she described as a \"very minimal role\", saying that \"If no one had called me Commander Chapel, the audience wouldn't really know that I was there.\" Barrett said in the film franchise Chapel got lost along the way, not appearing in the second or third films despite her view that she was a main character in The Original Series. Nimoy brought back the character for Star Trek IV: The Voyage Home, and Barrett was grateful for his decision. The character was subsequently mentioned in the 2009 film Star Trek, which saw the characters from The Original Series re-cast. Chapel was one of the suggested possibilities for Alice Eve to play in the sequel, Star Trek Into Darkness. It was later revealed that she was portraying Carol Marcus.", "Chapel appeared in two of the Star Trek films featuring The Original Series cast. In Star Trek: The Motion Picture, Chapel had become a doctor on board the Enterprise. Her second appearance was in Star Trek IV: The Voyage Home, where she and Janice Rand (Grace Lee Whitney) were stationed in Starfleet Headquarters in San Francisco. In the 2009 film Star Trek, a Nurse Chapel is mentioned by McCoy (Karl Urban). In the 2013 film Star Trek Into Darkness, Carol Marcus (Alice Eve) tells Kirk (Chris Pine) that after being with him, Chapel left to become a nurse."]}, {"page": "Heterochromia iridum", "response": ["File:Alice Eve, Men in Black 3, 2012 (crop).jpg|Actress Alice Eve has heterochromia: her left eye is blue and right eye is grey."]}, {"page": "List of Star Trek characters", "response": ["| Alice Eve"]}, {"page": "List of fictional doctors", "response": ["|Star Trek film series || Dr. Christine ChapelDr. Beverly CrusherEMH Program AK-1 (The Doctor)Dr. Leonard McCoyDr. Carol MarcusDr. David MarcusDr. Tolian Soran || Majel BarrettGates McFaddenRobert PicardoDeForest Kelley/Karl UrbanBibi Besch/Alice EveMerritt ButrickMalcolm McDowell"]}, {"page": "Janice Rand", "response": ["Following the relaunch of Star Trek in 2009 with a new cast playing those roles seen in The Original Series, there was commentary online about the lack of female characters and whether Rand might be appearing in future installments. While the sequel, Star Trek Into Darkness, was in production, Rand was one of five characters who was stated not to be appearing in the film by writer Roberto Orci. But there was still speculation at the time of the broadcast of the first trailer about who Alice Eve was portraying in the film. The options given by Tor.com was that it was either Janice Rand or Carol Marcus. Daily Variety reported that she was cast as someone new to the franchise, but she was actually cast as Marcus."]}, {"page": "Entourage (American TV series)", "response": ["Vince has an interview with Vanity Fair writer Sophia Lear (Alice Eve). He opens up to Sophia and tells his story only for the article to call him an \"insecure womanizer\". Ari's personal and professional lives collide when he realizes that he might lose his share in the company after his divorce is finalized. Eric takes a meeting with Melinda Clarke and ends up having sex with her instead. He is unnerved when he realizes afterwards that her true intentions were to get back at her ex."]}, {"page": "Stage Beauty", "response": ["* Alice Eve as Miss Frayne"]}, {"page": "Chris Evans (actor)", "response": ["In March 2014, Evans said he may consider doing less acting so that he can focus on directing. In the same year, he made his directorial debut in the romantic comedy Before We Go, in which he also starred opposite Alice Eve. The film tells the story of two strangers who meet at Grand Central Terminal, and form an unlikely bond overnight. It premiered at the 2014 Toronto International Film Festival; The New York Times critic, Ben Keninsberg, opined that it was a moderate effort and the actors' chemistry made it watchable. In the same year, he starred in another romantic comedy, opposite Michelle Monaghan in Playing It Cool. The following year, he played Captain America again in Avengers: Age of Ultron, the sequel to 2012's The Avengers. In 2016, he reprised the role in Captain America: Civil War, the sequel to Captain America: The Winter Soldier. Both of these films were box office hits, grossing $1.4 billion and $1.1 billion worldwide, respectively. The Hollywood Reporter later learned that his salary for Civil War was $15 million."]}, {"page": "Bedales School", "response": ["*Alice Eve (born 1982), actress"]}, {"page": "Typhoid Mary (character)", "response": ["The character was portrayed in the film Elektra by Natassia Malthe. Alice Eve portrayed the character in the second season of the Marvel Cinematic Universe television series Iron Fist.", "* Mary Walker appears in season two of the live-action series Iron Fist, portrayed by Alice Eve. This version of the character is a former special ops soldier whose dissociative identity disorder was triggered after her squad was ambushed in Sokovia. She was the sole survivor, was held captive, tortured and raped for two years before managing to escape. She believes she has two personalities: the kind and friendly \"Mary\", and the malevolent fighter \"Walker\". Her Walker identity is hired by Davos and Joy Meachum to spy on Danny Rand, prompting her Mary persona to warn him. When Danny's Iron Fist power is stolen by Davos, Walker suddenly begins working with Danny's allies to take down Davos, later discovering that she has another secret persona beyond Mary and Walker operating as a vigilante serial killer."]}, {"page": "The Mystery of the Blue Train", "response": ["The novel was televised in 2006 as a special episode of the series Agatha Christie's Poirot, and was aired by ITV on 1 January starring David Suchet as Poirot, Roger Lloyd-Pack as Inspector Caux, James D'Arcy as Derek Kettering, Lindsay Duncan as Lady Tamplin, Alice Eve as Lenox and Elliott Gould as Rufus Van Aldin."]}, {"page": "Jay Baruchel", "response": ["In 2010, Baruchel starred in the films The Trotsky, DreamWorks' She's Out of My League (opposite Alice Eve),INTERVIEW: Jay Baruchel On She's Out Of My League – Rip It Up Magazine  Retrieved September 15, 2010 and the live-action Disney adaptation of The Sorcerer's Apprentice. He also voiced the starring role in the acclaimed animated feature, How to Train Your Dragon, a role he has subsequently continued throughout the franchise, including its television series. Also in 2010, he played two supporting characters in the Canadian comedy series The Drunk and On Drugs Happy Fun Time Hour.\"The Boys are back and on drugs\" . The Globe and Mail, July 12, 2010. He developed the screenplay for Goon, with Evan Goldberg, playing Johnny Klutz, a character of his own creation.Kit, Borys. \"Uni stumbles onto Jay Baruchel's 'Klutz'\" The Hollywood Reporter March 11, 2009 Goon co-stars Seann William Scott and fellow Canadian actor Eugene Levy."]}, {"page": "Trevor Eve", "response": ["Trevor John Eve (born 1 July 1951) is an English film and television actor. In 1979 he gained fame as the eponymous lead in the detective series Shoestring and is also known for his role as Detective Superintendent Peter Boyd in BBC television drama Waking the Dead. He is the father of three children, including actress Alice Eve.", "Eve met Sharon Maughan in 1979, when they both had parts in the West End production of Filumena. They married in 1980 and have three children: Alice Sophia (born 1982), who starred in Star Trek Into Darkness; Jack (born 1985), film-maker; and George (born 1994), who is front man for the band Two Bottle Jump. While they were raising their children the couple divided their time between Britain and the United States. Trevor Eve, Sharon Maughan and Alice Eve all appeared in She's Out of My League playing father, mother and daughter respectively."]}, {"page": "Ordeal by Innocence", "response": ["BBC One broadcast a three-episode series based on Ordeal by Innocence in 2018. It was filmed in Inverkip, Scotland, and stars Bill Nighy as Leo Argyll (changed from \"Argyle\" in the novel), Luke Treadaway as Arthur Calgary, Anna Chancellor as Rachel Argyll, Ella Purnell as Hester Argyll, Eleanor Tomlinson as Mary Durrant, Crystal Clarke as Tina Argyll, Morven Christie as Kirsten Lindstrom, Matthew Goode as Philip Durrant, Alice Eve as Gwenda Vaughan, and Anthony Boyle as Jack Argyll. The script was written by Sarah Phelps, who also adapted the Christie miniseries And Then There Were None and The Witness for the Prosecution for the BBC. First scheduled to air in 2017, the series was delayed due to sexual allegations against actor Ed Westwick, who was originally cast as Mickey Argyll, which led to Westwick's scenes being reshot with Christian Cooke as Mickey."]}, {"page": "List of Welsh Americans", "response": ["*Alice Eve (born 1982), actress"]}, {"page": "Jim Field Smith", "response": ["In Pittsburgh, Pennsylvania in 2008, he directed Jay Baruchel and Alice Eve in his first full-length feature, the DreamWorks romantic comedy She's Out of My League, released worldwide by Paramount Pictures in 2010."]}, {"page": "List of feature films with LGBT characters", "response": ["| Alice Eve"]}, {"page": "Critics' Choice Movie Award for Best Acting Ensemble", "response": ["|Charlize Theron, Nicole Kidman, Margot Robbie, John Lithgow, Kate McKinnon, Connie Britton, Malcolm McDowell, Allison Janney, Rob Delaney, Mark Duplass, Alice Eve, Ashley Greene, Alanna Ubach, D'Arcy Carden"]}, {"page": "Starter for 10 (film)", "response": ["* Alice Eve as Alice Harbinson"]}, {"page": "Shiho Kawaragi", "response": ["*Big Nothing (Josie McBroom (Alice Eve))"]}, {"page": "Chie Nakamura", "response": ["*Replicas – Mona Foster (Alice Eve)"]}, {"page": "Eve (name)", "response": ["* Alice Eve (born 1982), English-American actress"]}, {"page": "Rock 'n' Roll (play)", "response": ["*Young Esme, Alice – Alice Eve"]}, {"page": "Sanjeev Kohli", "response": ["In December 2006, the Sunday Mail revealed that Kohli would be starring in a major ITV thriller, Losing Gemma. Starring alongside Alice Eve, he played \"a member of the British High Commission, who helps a young British tourist jailed in Delhi, India\". Kohli revealed in 2007 that he would be working on a radio comedy project for BBC Radio 4, entitled Fags, Mags and Bags. The series was broadcast in 2008 and was nominated for a Sony Award. The Daily Record also revealed Kohli would be writing for ITV children's show, My Life as a Popat. Kohli has also starred in BBC Three's Rush Hour as an intolerant taxicab driver, and on the same channel in Phoo Action as a television news presenter. "]}, {"page": "Ecosse Films", "response": ["In 2011, Ecosse released The Decoy Bride, a romantic comedy about a famous celebrity wedding on a remote Scottish island and a local girl recruited to act as a decoy bride. Directed by Sheree Folkson, it starred David Tennant, Alice Eve and Kelly Macdonald. The same year they released Wuthering Heights directed by Andrea Arnold and starring Kaya Scodelario as Catherine Earnshaw and newcomer James Howson as Heathcliff. The world premiere was in competition at the 68th Venice International Film Festival."]}, {"page": "List of people with heterochromia", "response": ["* Alice Eve"]}, {"page": "List of characters played by multiple actors in the same film", "response": ["*Emma Thompson and Alice Eve as Agent O in Men in Black 3 (2012)"]}, {"page": "Big Nothing", "response": ["Big Nothing is a 2006 black comedy crime film directed by Jean-Baptiste Andrea, starring David Schwimmer, Simon Pegg and Alice Eve. It had its world premiere at the Cardiff Film Festival on 18 November 2006, and was released in the United Kingdom on 1 December 2006.", "In a small Oregon town, a brutal serial killer nicknamed the \"Oregon undertaker\" has been murdering and mutilating young women. Charlie (David Schwimmer) is an ex-teacher who is fired on his first day as a call center employee. His colleague Gus (Simon Pegg) invites him to join a plot to blackmail a reverend, about whose visits to porn websites he has obtained evidence. Teenage pageant queen Josie McBroom (Alice Eve) overhears them planning the scam, and insists on joining the scheme.", "* Alice Eve as Josie"]}, {"page": "Hawking (2004 film)", "response": ["* Alice Eve as Martha Guthrie"]}, {"page": "Losing Gemma", "response": ["Losing Gemma is a two-part British television thriller, based on the debut novel by Writer Katy Gardner. The screen adaptation was written by Robert Murphy, directed by Maurice Phillips and starred Jonas Armstrong, Alice Eve, Jason Flemyng and Rachel Leskovac. It originally aired on ITV on 18 and 19 December 2006, at 9pm.https://itvstudios.com/programmes/losing-gemma The plot centres on the disappearance of the eponymous Gemma (Leskovac) after she goes backpacking with friend Esther (Eve) in India. When Esther returns from the trip alone, she is haunted by the belief that Gemma's disappearance is her fault, but mystery surrounds what really happened. Notably, the drama has never been released on DVD.", "* Alice Eve as Esther", "Unlikely travel partners Esther (Alice Eve) and Gemma (Rachel Leskovac) are thrown together when their mutual friend, Carol (Koel Purie), has an accident on the eve of their trip. Adventurous loner Esther hopes to part company once in India, but needy Gemma is terrified of travelling alone. Gemma's money bag gets stolen and Carol returns it to her while on the train. She causes great friction between Gemma and Esther, and provokes several fights. Her husband Zac (Jason Flemyng) takes an instant liking to Gemma, and invites her for a cruise on his boat with him and his wife. Gemma requests that Esther be invited and reluctantly the couple agree. They spend the day on the boat sunbathing and relaxing. But Gemma is taken aback when Carol and Zac get naked and start having sex in the water."]}, {"page": "List of American films of 2004", "response": ["| Stage Beauty || Lions Gate Films || Richard Eyre (director); Jeffrey Hatcher (screenplay); Billy Crudup, Claire Danes, Rupert Everett, Zoë Tapper, Tom Wilkinson, Richard Griffiths, Hugh Bonneville, Ben Chaplin, Edward Fox, Alice Eve, Stephen Marcus, Tom Hollander || Romance, Period, Drama ||"]}, {"page": "List of American films of 2007", "response": ["| Starter for 10 || BBC Films || Tom Vaughan (director); David Nicholls (screenplay); James McAvoy, Rebecca Hall, Dominic Cooper, Catherine Tate, Alice Eve, Benedict Cumberbatch, James Corden, Mark Gatiss, Charles Dance, Simon Woods, Elaine Tan, Lindsay Duncan, James Gaddas, John Henshaw, Ben Willbond || Comedy, Drama"]}, {"page": "Alice (name)", "response": ["* Alice Eve, English actress"]}, {"page": "List of Star Trek production staff", "response": ["| Alice Eve"]}, {"page": "Men in Black 3", "response": ["** Alice Eve as Young Agent O"]}]}}