{"wiki_id": "http://www.wikidata.org/entity/Q2337755", "itemLabel": "Al Atkins", "itemDescription": "British heavy metal singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Al_Atkins", "wikipedia_page": {"main": "Allan John Atkins (born 14 October 1947) is an English heavy metal vocalist, best known for being the original lead vocalist and founder for Judas Priest.", "link_mentions": [{"page": "Judas Priest", "response": ["Judas Priest was formed in 1969 in Birmingham, England, by lead vocalist Al Atkins and bassist Brian \"Bruno\" Stapenhill, with John Perry on guitars and John \"Fezza\" Partridge on drums. Perry committed suicide at age 18, and amongst the replacements the band auditioned was future Judas Priest guitarist Kenny \"K. K.\" Downing; at the time, they turned him down in favour of 17-year-old multi-instrumentalist Ernest Chataway, who had played with Birmingham band Black Sabbath when they were still called Earth. Stapenhill came up with the name Judas Priest from Bob Dylan's song \"The Ballad of Frankie Lee and Judas Priest\" on the album John Wesley Harding. Partridge was replaced in 1970 by drummer Fred Woolley, who later re-joined Chataway and Stapenhill in the band Bullion. No member of that early line-up lasted long enough to play on the band's recordings, though several songs co-written by Atkins appeared on their first two albums.", "On 17 March 2014 at the Ronnie James Dio Awards in Los Angeles, Halford announced that the band's 17th studio album was finished. On 28 April, the band released the album's title track \"Redeemer of Souls\" for streaming on their official website. On 14 May 2014, the band's original guitarist Ernie Chataway died at the age of 62 from cancer, as reported by vocalist Al Atkins. Redeemer of Souls was released on 8 July 2014. It sold around 32,000 copies in the United States in its first week of release to land at position No. 6 on The Billboard 200 chart, the band's highest charting position in the US after the double-disc concept album, Nostradamus, debuted at No. 11. This was the band's first top 10 album in the US. The band went on tour in support of the album which ran from 1 October 2014 until 17 December 2015. The Redeemer of Souls Tour led to the sixth live album Battle Cry, which was released on 25 March 2016 after being recorded at the Wacken Open Air festival in Germany on 1 August 2015."]}, {"page": "K. K. Downing", "response": [";Al Atkins"]}, {"page": "Glenn Tipton", "response": ["Tipton's first band was Shave 'Em Dry, with future Starfighters and Ozzy Osbourne drummer Barry Scrannage, which became Merlin, later becoming The Flying Hat Band. This band soon broke up due to management issues. In May 1974, Tipton joined Judas Priest, and coincidentally Scrannage had joined the band Bullion with earlier Judas Priest members Ernest Chataway and Bruno Staphenhill. This was during the recording for Rocka Rolla, so Tipton quickly added his guitar parts to the album. On Sad Wings of Destiny, Tipton showed off more of his guitar work on songs like \"Tyrant\", \"Dreamer Deceiver\" and \"Victim of Changes\". Tipton also presented his own songwriting on the songs \"Prelude\", \"Epitaph\" and \"The Ripper\". He frequently played keyboards on the early albums, although those were no longer featured on any songs after Killing Machine. He is credited with introducing a more metal sound to the band with those songs, as Rocka Rolla was composed of largely blues rock and psychedelic songs left over from the band's former frontman Al Atkins. Although Tipton wrote the lyrics for the songs shortly after joining Judas Priest, producer Rodger Bain rejected putting them on the first album as being not commercial enough. From then onward, Halford and Tipton would be the band's principal songwriters with occasional contributions from Downing."]}, {"page": "West Bromwich", "response": ["*Al Atkins – founder member of Judas Priest. Still lives in West Bromwich"]}, {"page": "Dave Holland (drummer)", "response": ["Throughout the 1990s, besides touring with briefly reformed Trapeze and filling in for various bands like The Screaming Jets during their European tours, at the band's official site Holland gave drum clinics and private lessons, managed and produced bands such as UK band The Love Garden and the Swedish \"teen funk trio\" Shutlanger Sam (fronted by Kim Fransson who later had a solo career where he collaborated with among others hit songwriters Andreas Carlsson and Desmond Child) whom Holland introduced in person at a show with his former Trapeze bandmate Glenn Hughes in Vänersborg 1996, and played on various recordings of his former mates. In 1996, he participated in sessions that involved Glenn Hughes, Tony Iommi of Black Sabbath fame, and keyboardist Don Airey. In 1998, a collaboration with Al Atkins, Judas Priest's original singer, was released, featuring a few covers of early Priest songs that Holland did not originally play on. Judas Priest with Atkins at the helm had supported Trapeze in 1971.", "===With Al Atkins==="]}, {"page": "Sad Wings of Destiny", "response": ["After Halford left the group in the 1990s, Tim Owens was hired to replace him after auditioning \"Victim of Changes\" and \"The Ripper\".  Downing and Tipton thereafter nicknamed Owens \"The Ripper\".  Judas Priest's original singer Al Atkins recorded a version of \"Victim of Changes\" for his album Victim of Changes of 1998.  Judas Priest frequently performed the song \"Mother Sun\" during the Sad Wings era, but never recorded it.  The ballad, with its Queen-like vocals, has survived only in bootleg recordings.  In 2014 Swedish metal band Portrait released a cover version as a B-side on a 2014 CD single."]}, {"page": "Rocka Rolla", "response": ["Several of the songs on the album feature contributions from the band's previous frontman Al Atkins and had been regular parts of their live performances in Manchester, where the band had achieved a cult following during the previous few years. The track \"Caviar and Meths\" was originally a 14-minute effort penned by Atkins, Downing, and Hill but due to time constraints, only the intro was recorded for the album. A longer version of the song appears on Atkins's 1998 album Victim of Changes. Though not the full-length version, it is notably longer at seven minutes. That album also contains covers of \"Winter\" and \"Never Satisfied\".", "The very rare first printing of the UK LP has the words \"Thanks for the words Al!\" printed last in the credits in the blue circle on the back cover. This, presumably a reference to original singer Al Atkins, has been removed on other versions of the Gull vinyl."]}, {"page": "Atkins (surname)", "response": ["* Al Atkins (born 1947), British singer"]}, {"page": "Alan Atkins", "response": ["#REDIRECT Al Atkins"]}, {"page": "Alan Moore (drummer)", "response": ["Moore was already active in the Birmingham rock, blues, folk and country scene, and played with numerous bands, including The Young Casuals, The Other Lot, The Outer Light, Gabriel Oak, Glad Stallion, Tendency Jones and Pendulum. He was first approached by the guitarist K. K. Downing and bass guitarist Ian Hill in 1971, and joined in the early and unofficial phase of the newborn Judas Priest for a period of about a year, while  Al Atkins was still the vocalist. He left in 1972 to join the Birmingham country rock band Sundance, with whom he recorded the album Rain, Steam, Speed (1974), and the single \"Coming Down\"."]}, {"page": "Simon Lees", "response": ["In 2003, Lees recorded two new songs for Al Atkins' remastered solo album, Heavy Thoughts. These were \"Cradle to the Grave\" and \"Sentenced\". The remastered version of the album was released in 2006 on the Market Square label. In February 2003, Lees joined Budgie and recorded seven songs with the band which would later appear as bonus tracks on four of Budgie's remastered albums. Later that year, Lees released his second solo album, Freethinka. In 2004, Lees recorded guitar solos for an album by Neil Murray from The Hamptons, called Krankschaft – Der Varterlands.", "In 2004 and 2005, Lees recorded guitar parts for Al Atkins album, Demon Deceiver (2207), and also wrote the title track. Lees also produced a guitar tuition DVD, Signpost to the Fretboard. In 2006 Lees wrote a series of tuition articles for the internet magazine, All Out Guitar, was interviewed by The Express and Star and on BBC Radio WM. During 2005 and 2006, he co-wrote and recorded the Budgie album, You're All Living in Cuckooland (2006), with bassist and singer Burke Shelley at his studio in Cardiff. Lees played classical guitar on \"Black Velvet Stallion\" for the remastered Budgie album, If I Were Brittania I'd Waive the Rules. He left Budgie in July 2007."]}]}}