{"wiki_id": "http://www.wikidata.org/entity/Q23304606", "itemLabel": "Pat Doran", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Pat_Doran", "wikipedia_page": {"main": "Patrick Doran (born 5 June 1959) is a British rallycross driver of Irish origin, living in Thorverton, Devon. His oldest son, Liam Doran, became a rallycross driver too.\nDoran, sometimes nicknamed \"Plastic Paddy\", is a former four-time British Rallycross Champion. Doran was also the runner-up in the European Rallycross Championship in 1992, behind Will Gollop, also from Great Britain. He also raced a Ford RS200 in the Pikes Peak International Hill Climb.\nCalling Lydden Hill Race Circuit his home, in 2008 he became the owner of the Kentish motorsports venue.", "link_mentions": [{"page": "FIA European Rallycross Championship", "response": ["|  Pat Doran"]}, {"page": "List of professional sports families", "response": ["| Pat Doran"]}, {"page": "2013 European Rallycross Championship", "response": ["|  Pat Doran", "|  Pat Doran", "|align=left|  Pat Doran "]}, {"page": "Brands Hatch race winners", "response": ["|  Pat Doran"]}, {"page": "Liam Doran", "response": ["Liam Doran (born 22 March 1987) is a British professional rallycross driver competing in the FIA World Rallycross Championship, Global RallyCross Championship, X Games, and European Rallycross Championship. He is the son of British rallycross driver and Lydden Hill Race Circuit owner Pat Doran. In his early life he attended Fulston Manor School in Sittingbourne."]}, {"page": "Matthew Curran", "response": ["* Disqualification defeat by Pat Doran at Melbourne Athletic Pavilion, Melbourne on 25 August 1913"]}, {"page": "Fred Storbeck", "response": ["Fred Storbeck's first professional boxing bout was a knockout victory over Bill Chase at the National Sporting Club, London on 29 May 1911, this was followed by fights including; a no contest with Matthew Curran for the British Empire heavyweight title, a knockout defeat by Bombardier Billy Wells for the British Empire heavyweight title, \"during the contest, Storbeck offended Wells by swearing at him. This reaction betrays perhaps unexpected sensitivity in a former ranker, but the English heavyweight almost literally made the South African eat his words by repeatedly ramming a straight left like a telegraph pole into Storbeck's mouth for the remainder of the fight\", a disqualification defeat by Frank Moran (US) at The Ring, Blackfriars Road, London on 1 January 1912, a disqualification victory over Matthew Curran for the British Empire heavyweight title, a knockout defeat by Frank Moran (USA) at The Ring, Blackfriars Road, London on 5 February 1912, one win, a points victory over \"Battling\" Jim Johnson (USA) at Liverpool Stadium on 4 April 1912, this bout was unusual in that \"Battling\" Jim Johnson was an African American boxer and the colour bar was still generally upheld, following two wins, Storbeck then travelled to the United States, with a technical knockout defeat by Jim Stewart at Madison Square Garden, New York City on 8 July 1912, Storbeck then travelled home to South Africa, with a disqualification defeat by Mike Williams for the South African heavyweight title, a disqualification defeat by Jack Lalor for the South African heavyweight title, a knockout victory over Mike Williams for the South African heavyweight title, a disqualification defeat by Jack Lalor defending the South African heavyweight title, Storbeck then travelled to Australia, with a disqualification victory over Bill Lang at Sydney Sports Ground on 5 October 1914, a technical knockout defeat by Ben Doyle at Sydney Stadium on 31 October 1914, a disqualification defeat by Pat Doran at Baker's Pavilion, Melbourne on 28 November 1914, a disqualification victory over Arthur Brown at Sydney Stadium on 15 February 1915, a disqualification defeat by Jerry Jerome at Baker's Pavilion, Melbourne on 6 March 1915, a knockout defeat by Sid Neilson at Adelphi Hall, Maitland, New South Wales on 1 May 1915, Storbeck then travelled home to South Africa, with a points victory over Johnny Rutherford for the vacant South African heavyweight title, a disqualification defeat by Nick van den Bergh for the South African heavyweight title, Fred Storbeck's final professional boxing bout was a knockout defeat by Johnny Squires at City Hall, Johannesburg on 29 August 1921."]}, {"page": "2011 European Rallycross Championship", "response": ["|align=left|  Pat Doran"]}, {"page": "List of European Rally Championship drivers", "response": ["|align=left|  Pat Doran"]}, {"page": "List of rallycross drivers", "response": ["|align=\"left\"|  Pat Doran"]}, {"page": "2018 in rallycross", "response": ["|align=left|  Pat Doran"]}]}}