{"wiki_id": "http://www.wikidata.org/entity/Q2331144", "itemLabel": "Hall Caine", "itemDescription": "British novelist and playwright", "wikipedia_url": "https://en.wikipedia.org/wiki/Hall_Caine", "wikipedia_page": {"main": "Sir Thomas Henry Hall Caine   (14 May 1853 – 31 August 1931), usually known as Hall Caine, was a British novelist, dramatist, short story writer, poet and critic of the late nineteenth and early twentieth century. Caine's popularity during his lifetime was unprecedented. He wrote fifteen novels on subjects of adultery, divorce, domestic violence, illegitimacy, infanticide, religious bigotry and women's rights, became an international literary celebrity, and sold a total of ten million books. Caine was the most highly paid novelist of his day. The Eternal City is the first novel to have sold over a million copies worldwide. In addition to his books, Caine is the author of more than a dozen plays and was one of the most commercially successful dramatists of his time; many were West End and Broadway productions. Caine adapted seven of his novels for the stage. He collaborated with leading actors and managers, including Wilson Barrett, Viola Allen, Herbert Beerbohm Tree, Louis Napoleon Parker, Mrs Patrick Campbell, George Alexander, and Arthur Collins. Most of Caine's novels were adapted into silent black and white films. A. E. Coleby's 1923 18,454 feet, nineteen-reel film The Prodigal Son became the longest commercially made British film. Alfred Hitchcock's 1929 film The Manxman, is Hitchcock's last silent film.\nBorn in Runcorn to a Manx father and Cumbrian mother, Caine was raised in Liverpool. After spending four years in school, Caine was trained as an architectural draughtsman. While growing up he spent childhood holidays with relatives in the Isle of Man. At seventeen he spent a year there as schoolmaster in Maughold. Afterwards he returned to Liverpool and began a career in journalism, becoming a leader-writer on the Liverpool Mercury. As a lecturer and theatre critic he developed a circle of eminent literary friends by whom he was influenced. Caine moved to London at Dante Gabriel Rossetti's suggestion and lived with the poet, acting as secretary and companion during the last years of Rossetti's life.  Following the publication of his Recollections of Rossetti in 1882 Caine began his career as a writer spanning four decades.\nCaine established his residency in the Isle of Man in 1895, where he sat from 1901 to 1908 in the Manx House of Keys, the lower house of its legislature. Caine was elected President of the Manx National Reform League in 1903 and chair of the Keys' Committee that prepared the 1907 petition for constitutional reform. In 1929\nCaine was granted the Freedom of the Borough of Douglas, Isle of Man. Caine visited Russia in 1892 on behalf of the persecuted Jews. In 1895 Caine travelled in the United States and Canada, where he represented the Society of Authors conducting successful negotiations and obtaining important international copyright concessions from the Dominion Parliament.\nDuring the Great War (1914–1918) Caine wrote many patriotic articles and edited King Albert's Book, the proceeds of which went to help Belgian refugees. In 1917, Caine was created an Officer of the Order of Leopold by King Albert I of Belgium. Caine cancelled many literary contracts in America to devote all his time and energy to the British war effort. On the recommendation of the Prime Minister Lloyd George for services as an Allied propagandist in the United States, King George V made him a Knight of the British Empire in 1918 and a Companion of Honour in 1922. Aged 78 Caine died in his home at Greeba Castle on the Isle of Man.", "link_mentions": [{"page": "Bram Stoker", "response": ["The Stokers moved to London, where Stoker became acting manager and then business manager of Irving's Lyceum Theatre, London, a post he held for 27 years. On 31 December 1879, Bram and Florence's only child was born, a son whom they christened Irving Noel Thornley Stoker. The collaboration with Henry Irving was important for Stoker and through him he became involved in London's high society, where he met James Abbott McNeill Whistler and Sir Arthur Conan Doyle (to whom he was distantly related). Working for Irving, the most famous actor of his time, and managing one of the most successful theatres in London made Stoker a notable if busy man. He was dedicated to Irving and his memoirs show he idolised him. In London, Stoker also met Hall Caine, who became one of his closest friends – he dedicated Dracula to him.", "Stoker was a deeply private man, but his almost sexless marriage, his admiration of Walt Whitman, Henry Irving, Hall Caine, and Oscar Wilde, as well as the perceived homoerotic aspects of Dracula, have led to scholarly speculation that he was a repressed homosexual who used his fiction as an outlet for his sexual frustrations.Skal, David J Something in the Blood: The Untold Story of Bram Stoker, Liveright, 2016, p. 564; Genç, Kaya. \"Coming Out Of The Coffin\", The New Inquiry, 24 August 2012 In 1912, he demanded imprisonment of all homosexual authors in Britain: it has been suggested that this was to disguise his own vulnerability.Genç, Kaya \"Coming Out Of The Coffin\", The New Inquiry, 24 August 2012"]}, {"page": "Christian (disambiguation)", "response": ["* The Christian, an 1897 novel and play by Hall Caine, adapted for Broadway"]}, {"page": "Cheshire", "response": ["Actors from Cheshire include Daniel Craig, Tim Curry, Pete Postlethwaite, Wendy Hiller, and Lewis McGibbon. The county has also been the origin of several acclaimed writers, including Hall Caine, Alan Garner, Elizabeth Gaskell, and most famously Lewis Carroll, who wrote Alice's Adventures in Wonderland and named its Cheshire Cat character after the county. Artists from Cheshire include ceramic artist Emma Bossons and sculptor/photographer Andy Goldsworthy."]}, {"page": "Pietro Mascagni", "response": ["Mascagni composed the incidental music for Hall Caine's play, The Eternal City in August 1902; the première of the play with Mascagni's music took place in London on 2 October."]}, {"page": "Bexleyheath", "response": ["*Hall Caine (1853-1931), author, lived in Aberleigh Lodge, Bexleyheath from 1884 to 1889 next door to Red House. Aberleigh Lodge was demolished in the 1970s."]}, {"page": "Wilkie Collins", "response": ["The inconsistent quality of Collins's dramatic and fictional works in the last decade of his life was accompanied by a general decline in his health, including diminished eyesight. He was often unable to leave home and had difficulty writing. During these last years, he focused on mentoring younger writers, including the novelist Hall Caine. He also used his legal background to help protect other writers from copyright infringement of their works. His writing became a way for him to fight his illness without allowing it to keep him bedridden. His step-daughter Harriet also served as an amanuensis for several years. His last novel, Blind Love, was finished posthumously by Walter Besant."]}, {"page": "1916 in literature", "response": ["*Hall Caine ", "*Hall Caine – Our Girls: Their Work for the War"]}, {"page": "1915 in literature", "response": ["*Hall Caine – The Drama of 365 Days: Scenes in the Great War"]}, {"page": "1914 in literature", "response": ["*September 2 – Charles Masterman invites 25 \"eminent literary men\" to Wellington House in London to form a secret British War Propaganda Bureau. Those who attend include William Archer, Arnold Bennett, Hall Caine, G. K. Chesterton, Arthur Conan Doyle, Ford Madox Hueffer, John Galsworthy, Thomas Hardy, Rudyard Kipling, John Masefield, Henry Newbolt, Gilbert Parker, G. M. Trevelyan and H. G. Wells. Kipling soon afterwards writes the poem \"For all we have and are\". W. B. Yeats, however, refuses to sign a letter of support for the War signed by most of the participants and published in The Times on September 18.", "*Hall Caine – King Albert's Book"]}, {"page": "1913 in literature", "response": ["*Hall Caine – The Woman Thou Gavest Me"]}, {"page": "1911 in literature", "response": ["*Hall Caine – The Quality of Mercy (Also known as The Unwritten Law; a new version of Jan the Icelander)"]}, {"page": "1910 in literature", "response": ["*Hall Caine", "*Hall Caine – King Edward: A Prince and a Great Man"]}, {"page": "1917 in literature", "response": ["*Hall Caine – The Woman Thou Gavest Me"]}, {"page": "1901 in literature", "response": ["*Hall Caine – The Eternal City", "*Hall Caine – The Eternal City"]}, {"page": "1904 in literature", "response": ["*November – Hall Caine's novel The Prodigal Son is published by Heinemann in London and opens in a dramatic adaptation at the Grand Theatre, Douglas, Isle of Man.", "*Hall Caine – The Prodigal Son", "*Hall Caine – The Prodigal Son"]}, {"page": "1906 in literature", "response": ["*Hall Caine – Drink: A Love Story on a Great Question", "*Hall Caine – The Bondman Play", "*Hall Caine – My Story"]}, {"page": "1907 in literature", "response": ["*Hall Caine – The Christian (new version)"]}, {"page": "1908 in literature", "response": ["*Hall Caine – Pete (new version of The Manxman)"]}, {"page": "1909 in literature", "response": ["*Hall Caine – The White Prophet"]}, {"page": "1918 in literature", "response": ["*January 1 – The English novelist and wartime propagandist Hall Caine is made a Knight of the KBE."]}, {"page": "1921 in literature", "response": ["*Hall Caine – The Master of Man"]}, {"page": "1897 in literature", "response": ["**Hall Caine's novel The Christian: a story is published and becomes the first in Britain to sell a million copies. The author also writes a dramatization. () ", "*Hall Caine – The Christian"]}, {"page": "1896 in literature", "response": ["*Hall Caine – Jan the Icelander or Home, Sweet Home, A Lecture Story"]}, {"page": "1923 in literature", "response": ["*Hall Caine – The Woman of Knockaloe"]}, {"page": "1928 in literature", "response": ["*Hall Caine – Recollections of Rossetti (second expanded version)"]}, {"page": "1931 in literature", "response": ["*August 31 – Hall Caine, Manx novelist and dramatist (born 1853)"]}, {"page": "1938 in literature", "response": ["*Hall Caine (died 1931) – Life of Christ"]}, {"page": "1894 in literature", "response": ["*Hall Caine ", "*Hall Caine – The Manxman (\"Pete\" version)"]}, {"page": "1893 in literature", "response": ["*Hall Caine "]}, {"page": "1895 in literature", "response": ["**Hall Caine travels in the United States and Canada, representing the U.K. Society of Authors. He obtains international copyright concessions from the Dominion Parliament.", "*Hall Caine – The Manxman (the Philip version)"]}, {"page": "1891 in literature", "response": ["*Hall Caine – The Scapegoat"]}, {"page": "1890 in literature", "response": ["*January – William Heinemann launches his Heinemann publishing business in London's Covent Garden with Hall Caine's successful novel The Bondman.", "**Hall Caine's four-act historical drama Mahomet, based on the life of Muhammad and written for the actor-manager Henry Irving, is banned by the Lord Chamberlain after it causes unrest in Britain's Muslim communities, threatens British rule in parts of India and strains Britain's relations with the Ottoman Empire.", "*Hall Caine", "*Hall Caine – Good Old Times"]}, {"page": "1887 in literature", "response": ["*Hall Caine – The Deemster", "*Hall Caine – Life of Samuel Taylor Coleridge"]}, {"page": "1886 in literature", "response": ["*Hall Caine  – A Son of Hagar"]}, {"page": "1888 in literature", "response": ["*Hall Caine – Ben-my-Chree"]}, {"page": "1885 in literature", "response": ["*Hall Caine"]}, {"page": "1883 in literature", "response": ["*Hall Caine – Cobwebs of Criticism"]}, {"page": "1882 in literature", "response": ["*Hall Caine – Recollections of Rossetti"]}, {"page": "1853 in literature", "response": ["*May 14 – Hall Caine, British novelist and playwright (died 1931)"]}, {"page": "Runcorn", "response": ["thumb|upright=0.65|Sir Hall Caine.Born 1853", "* Sir Hall Caine  (1853–1931), novelist, dramatist, short story writer, poet and critic. World War I allied propagandist. Awarded Order of Leopold (Belgium)."]}, {"page": "The Manxman", "response": ["The Manxman  is a 1929 British silent romance film directed by Alfred Hitchcock and starring Anny Ondra, Carl Brisson and Malcolm Keen. The film is based on a popular 1894 romantic novel The Manxman by Hall Caine, which had previously been made into a film 13 years earlier. It was the last fully silent production that Hitchcock directed before he made the transition to sound film with his next film Blackmail (1929).", "The Manxman began filming on the Isle of Man, but Hitchcock eventually relocated production to Polperro, Cornwall due to frequent creative interference from author Hall Caine, who lived on the Isle of Man. Other scenes were shot at British International Pictures' Elstree Studios, to which Caine was invited to observe. The director began work on the film just two weeks after the birth of his daughter Patricia Hitchcock."]}, {"page": "Hagar", "response": ["In the nineteenth century a more sympathetic portrayal became prominent, especially in America. Edmonia Lewis, the early African-American and Native American sculptor, made Hagar the subject of one of her most well-known works. She said it was inspired by \"strong sympathy for all women who have struggled and suffered\". In novels and poems Hagar herself, or characters named Hagar, were depicted as unjustly suffering exiles. These include the long dramatic poem Hagar by Eliza Jane Poitevent Nicholson (pen name Pearl Rivers), president of the National Woman's Press Association; Hagar in the Wilderness by Nathaniel Parker Willis, the highest-paid magazine writer of his day; and Hagar's Farewell by Augusta Moore. In 1913 this was joined by the overtly feminist novel Hagar, by the American Southern socialist and suffragist Mary Johnston's.Mary Johnston, Suffragist Marjorie Spruill Wheeler The Virginia Magazine of History and Biography Vol. 100, No. 1, \"Working out Her Destiny\": Virginia Women's History (Jan., 1992), pp. 99–118 (article consists of 20 pages), published by Virginia Historical Society Hall Caine gave the name A Son of Hagar to 1885 book set in contemporary England and dealing with the theme of illegitimacy."]}, {"page": "Cheyne Walk", "response": ["* Hall Caine, novelist, as Rossetti's housemate."]}, {"page": "Hall, Sir Caine", "response": ["#REDIRECT Hall Caine"]}]}}