{"wiki_id": "http://www.wikidata.org/entity/Q2335056", "itemLabel": "Staz Johnson", "itemDescription": "English comic book artist and penciller", "wikipedia_url": "https://en.wikipedia.org/wiki/Staz_Johnson", "wikipedia_page": {"main": "Stewart \"Staz\" Johnson is an English comic book artist and penciller, best known for his work on DC Comics' Robin  and Catwoman series. Staz has achieved many astonishing achievements in the comical universe.", "link_mentions": [{"page": "Doctor Who Magazine", "response": ["| Story Mark Wright; art Staz Johnson; inks (pgs 6–8 & 10) David A. Roach; colours James Offredi ", "| Story Mark Wright; art Staz Johnson; inks (pgs 6–8 & 10) David A. Roach; colours James Offredi ", "| Story Scott Gray; art Staz Johnson; inks (pgs 6–8 & 10) David A. Roach; colours James Offredi "]}, {"page": "New X-Men", "response": ["| Staz Johnson"]}, {"page": "Rogue Trooper", "response": ["In 2002 the original Rogue was reintroduced, again in flashback to his days hunting the traitor general, written by Gordon Rennie. Artists have included Staz Johnson, Dylan Teague, Mike Collins, Simon Coleby and PJ Holden. In 2004 Rennie statedGordon Rennie interview , 2000 AD Review, 4 June that he had intended to revamp the character yet again, but had been blocked by 2000 AD editorial. He also hints that any return to the Rogue Trooper universe will concentrate on supporting cast and not include the Rogue character. This can be seen in the new series The 86ers.", "* \"What Lies Beneath\" (with pencils by Staz Johnson and inks by David Roach, in 2000 AD #1301-1304, 2002)", "* \"Lions\" (with Staz Johnson (1308) and Mike Collins (1309), in 2000 AD #1308-1309, 2002)", "* \"Ghouls\" (with pencils by Staz Johnson (episodes 1–4) and Mike Collins (ep. 5–6), and inks by David Roach (ep. 3–6), in 2000 AD #1344-1349, 2003)", "* \"Dead Ringer\" (with Staz Johnson, in 2000 AD Prog 2011, 2010)"]}, {"page": "Gordon Rennie", "response": ["** \"What lies beneath\" (with pencils by Staz Johnson and inks by David Roach, in 2000 AD #1301-1304, 2002)", "** \"Lions\" (with Staz Johnson (1308) and Mike Collins (1309), in 2000 AD #1308-1309, 2002)", "** \"Ghouls\" (with Staz Johnson (1344–1347) and Mike Collins (1348-1349), in 2000 AD #1345-1349, 2003)"]}, {"page": "Brian K. Vaughan", "response": ["*Doctor Octopus: Negative Exposure #1–5 (with Staz Johnson, 2003–2004) collected as Spider-Man/Doctor Octopus: Negative Exposure (tpb, 120 pages, 2004, )"]}, {"page": "Simon Spurrier", "response": ["** \"Old Red\" (with Staz Johnson, in 2000 AD #1232, 2001)"]}, {"page": "Steve Moore (comics)", "response": ["*Killer (with pencils by Staz Johnson and inks by David Roach, in 2000 AD #1264–1272, 2001)"]}, {"page": "Fiona Avery", "response": ["**Rising Stars: Voices of the Dead #1–6 (with Staz Johnson and Al Rio (#5–6), 2005) also collected in Rising Stars: Voices of the Dead and Bright (tpb, 226 pages, 2006, )"]}, {"page": "Rising Stars (comics)", "response": ["The six-issue miniseries Rising Stars: Voices of the Dead features Lionel Zerb, a Special who can see dead people, and was published in Apr–Dec 2005. It was again written by Fiona Avery, with pencils by Staz Johnson and Al Rio. The story concentrates on various mysteries Lionel uncovers because of his ability."]}, {"page": "Ian Edginton", "response": ["**Batman/Aliens 2 (with Staz Johnson, DC, 2003, )"]}, {"page": "Joe Kelly (comics writer)", "response": ["*** \"It Takes a Village\" (with Michael Gaydos, Staz Johnson and Tom Grummett, in #35–38, 2007)"]}, {"page": "United Kingdom Comic Art Convention", "response": ["| 21–22 Mar. 1998 || Manchester || Joe Sacco, Alex Ross, Eddie Campbell, Colleen Doran, Woodrow Phoenix, William Messner-Loebs, Alan Grant, and Dave Taylor  || Cover by Alex Ross; interior work by Ed Hillyer, Martin Hand, Woodrow Phoenix, Roger Langridge, Paul Johnson, Henry Flint, Adrian Salmon, Ashley Sanders, David Pugh, Craig Dixon, Dave Windett, Ian Peterson, Rik Rawling, Dom Morris, Lee Townsend, Phil Elliott, Will Kane, Staz Johnson, Lew Stringer, Jake Carney, Dave Taylor, Jon Haward, Colin MacNeil, Phil Gascoine, John Higgins, Colleen Doran, Charlie Adlard, Paul Marshall, Jim Hodgkins, James Murphy, Mark Buckingham, Dave King, Art Wetherell, Mike Perkins, Duncan Fegredo, Sean Phillips, Paul Staples, Glenn Dakin, Stephen Baskerville, and Bryan Talbot || Presentation of the National Comics Awards; final edition of UKCAC"]}, {"page": "Comic Festival", "response": ["| 26–27 May 2001 || Bristol ||  Eddie Campbell, D'Israeli, Gary Spencer Millidge, Tony Rollinson, Tim Sayer,Sandells, Natalie. \"Comics 2001,\" Sequential Tart vol. IV, issue No. 7 (June 2001). Dave Gibbons, Staz Johnson, Sean Phillips, Charlie Adlard, Greg Staple, Metaphrog, Bob Schreck, Alan Grant, John McCrea, Dez Skinn, Steve Conley, and Lee Barnett || Known as Comics 2001", "| 23–24 May 2003 || Commonwealth Centre, Temple Meads, Bristol ||  Jim Lee, Jeff Smith, Dez Skinn, Mike Conroy, Duncan Fegredo, Steve Yeowell, Gary Spencer Millidge, Phil Winslade, Sean Phillips, Mike Carey, Chris Weston, Chris Francis, Phill Hall, Bryan Talbot, Dave Gibbons, John McCrea, John Cassaday, D'Israeli, Staz Johnson, Gary Erskine, Rich Johnston, Nick Locking, and David HitchcockAllass, Marcia. \"Lovely Bristols,\" Sequential Tart vol. 6, issue No. 6 (June 2003).  ||  Known as Comics 2003"]}, {"page": "Auto Assembly", "response": ["*Staz Johnson - 2008, 2009"]}, {"page": "John Tomlinson (comics)", "response": ["** \"A Hitch in Time\" (with Staz Johnson, in 2000 AD No. 796, 1992)"]}, {"page": "Civil War: X-Men", "response": ["Civil War: X-Men is a four-issue comic book mini-series, published in 2006 by Marvel Comics. The series was written by David Hine, Fabian Nicieza, Peter David, and Dennis Calero. The illustration of the mini-series was done by Staz Johnson and Dennis Calero. Though published as part of the wider Civil War event, its plot is a continuation of the earlier X-Men: The 198 mini-series.  "]}, {"page": "Dava (comics)", "response": ["Dava is a fictional character in the DC Comics universe. She is a martial artist created by writer Chuck Dixon and artist Staz Johnson, and she first appeared in Robin #49 (1998)."]}, {"page": "Democracy (Judge Dredd storyline)", "response": ["* \"Hot Night in 95\" (with art by Staz Johnson, in Judge Dredd Megazine #307–308 and 310, 2011)"]}, {"page": "List of Batman family enemies", "response": ["| Spellbinder III /Lady Spellbinder || Chuck DixonStaz JohnsonScott Hanna || Detective Comics #691(November 1995) || During the Underworld Unleashed crossover event, the Spellbinder I (Delbert Billings) rejects Neron's offer and is shot in the head by his then-girlfriend, Fay Moffit, who then takes the deal for herself and becomes the Spellbinder III, a.k.a. Lady Spellbinder, as a result.Detective Comics #691-692 (November – December 1995)"]}, {"page": "List of Judge Dredd characters", "response": ["Judge Francesco Deacon was one of the first ever street judges, in the 2030s. Before becoming a judge he was in the military police.Carroll, M. (2018) Judges: The Avalanche Abaddon Books, p. 57 He first appeared in Michael Carroll's novel Judges: The Avalanche, and simultaneously in the Judge Dredd comic strip story \"Paradigm Shift\" in 2000 AD #2082–2086 in May 2018, also written by Carroll and with art by Staz Johnson. He has since appeared in a minor role in the series \"Dreadnoughts\" in the Judge Dredd Megazine.Megazine #424–429"]}, {"page": "Batman/Aliens", "response": ["*Batman/Aliens II (by Ian Edginton and Staz Johnson, 160 pages, 2003, Titan Books, , DC, )", "*DC Comics/Dark Horse: Aliens (by Ian Edginton, Ron Marz, James Hodgkins, Staz Johnson, Kevin Nowlan, Chris Sprouse, Bernie Wrightson, 400 Pages, 2016, DC Comics/Dark Horse, )"]}, {"page": "Frank Tieri (writer)", "response": ["*Underworld (5-issue limited series, with Staz Johnson, February 2006-June 2006, collected in Civil War: War Crimes, tpb, 160 pages, 2007, )", "*Civil War: War Crimes (one-shot, with Staz Johnson, December 2006) collected in Civil War: War Crimes (tpb, 160 pages, 2007, )"]}, {"page": "Batman: Anarky", "response": ["Collecting four stories, Batman: Anarky gathers the work of a total of sixteen contributors employed by DC Comics over the course of eight years. While all of the collected stories were written by Alan Grant, contributing pencillers include Norm Breyfogle, Staz Johnson, and John Paul Leon, with various artists assisting as inkers, colorists, and letterers. Each of the artists who worked on the Anarky limited series, \"Metamorphosis\", would later return to continue their work on the Anarky ongoing series in 1999.", "Other contributing illustrators include Staz Johnson, who after penciling \"Anarky: Tomorrow Belongs to Us\", would go on to work exclusively for DC Comics for several more years. Illustrator John Paul Leon collaborated on \"Anarky\" in 1995, just a year after he received his Bachelor's in Fine Arts from School of Visual Arts in 1994. Steve Mitchell, the regular inker for Detective Comics during Grant and Breyfogle's collaborative run, inked \"Anarky in Gotham City\". Cam Smith, Ray McCarthy, and Josef Rubinstein completed the ink work for \"Anarky: Tomorrow Belongs to Us\", \"Anarky\", and \"Metamorphosis, respectively."]}, {"page": "Daniel Way", "response": ["**** \"Good Cop/Bad Cop\" (with Staz Johnson, in vol. 2 #188–189, 2003)"]}, {"page": "Anthony Flamini", "response": ["*Marvel Atlas #1-2 (with co-authors Michael Hoskin, Eric J. Moreels & Stuart Vandal, and art by Staz Johnson & Eliot R. Brown, 2007, tpb, 2008, )"]}, {"page": "Classical Comics", "response": ["*Dracula (by Bram Stoker and adapted by Jason Cobley with artwork by Staz Johnson, colours by James Offredi and lettering by Jim Campbell, 152 pages, Original Text, )"]}, {"page": "List of Heroes graphic novels", "response": ["| Staz Johnson", "| Staz Johnson", "| Staz Johnson", "| Staz Johnson", "| Staz Johnson", "| Staz Johnson"]}, {"page": "2003 in comics", "response": ["* May 23–24: Comics 2003 (Bristol, Avon, England, U.K.) — presentation of the National Comics Awards; guests include Jim Lee, Jeff Smith, Dez Skinn, Mike Conroy, Duncan Fegredo, Steve Yeowell, Gary Spencer Millidge, Phil Winslade, Sean Phillips, Mike Carey, Chris Weston, Chris Francis, Phil Hall, Bryan Talbot, Dave Gibbons, John McCrea, John Cassaday, D'Israeli, Staz Johnson, Gary Erskine, Rich Johnston, Nick Locking, and David HitchcockAllass, Marcia. \"Lovely Bristols,\" Sequential Tart vol. 6, issue #6 (June 2003)."]}, {"page": "2001 in comics", "response": ["* May 26–27: Comics 2001 (Bristol, England, U.K.) — presentation of the National Comics Awards; official guests include Eddie Campbell, D'Israeli, Gary Spencer Millidge, Tony Rollinson, Tim Sayer,Sandells, Natalie. \"Comics 2001,\" Sequential Tart vol. IV, issue #7 (June 2001). Dave Gibbons, Staz Johnson, Sean Phillips, Charlie Adlard, Greg Staple, Metaphrog, Bob Schreck, Alan Grant, John McCrea, Dez Skinn, and Steve Conley"]}]}}