{"wiki_id": "http://www.wikidata.org/entity/Q2337795", "itemLabel": "Edward Hooper", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Hooper_(journalist)", "wikipedia_page": {"main": "The oral polio vaccine (OPV) AIDS hypothesis is a now-discredited hypothesis that the AIDS pandemic originated from live polio vaccines prepared in chimpanzee tissue cultures, accidentally contaminated with simian immunodeficiency virus and then administered to up to one million Africans between 1957 and 1960 in experimental mass vaccination campaigns.\nData analyses in molecular biology and phylogenetic studies contradict the OPV AIDS hypothesis; consequently, scientific consensus regards the hypothesis as disproven. A 2004 Nature article has described the hypothesis as \"refuted\".", "link_mentions": [{"page": "Discredited HIV/AIDS origins theories", "response": ["In the 1999 version of his OPV AIDS hypothesis, Edward Hooper proposed that early batches of the oral polio vaccine (OPV) grown in cultures of chimpanzee kidney cells, infected with a chimpanzee virus, were the original source of HIV-1 in Central Africa. A vial of the batch most strongly implicated by Hooper was found in storage in the UK, and analysis found no HIV/SIV sequences or chimpanzee cellular components, but did find traces of macaque mitochondria. Analysis of five samples of OPV in storage at the Wistar Institute, including one from a batch used in the Belgian Congo between 1958 and 1960, found no chimpanzee DNA.Sarah Ramsay 28 April 2001 \"Cold water downstream from The River\" The Lancet 357 (9265) p.1343  Other molecular biology and phylogenetic studies also contradict the hypothesis, and scientific consensus regards it as disproven.Origin of Human Immunodeficiency Virus (HIV/AIDS) Centers for Disease Control and Prevention website, Accessed 30 January 2007 A 2004 article in the journal Nature described the hypothesis as \"refuted\"."]}, {"page": "The River", "response": ["* The River, a book about a debunked theoretical origin of HIV/AIDS by Edward Hooper"]}, {"page": "Hilary Koprowski", "response": ["British journalist Edward Hooper publicized a hypothesis that Koprowski's research into a polio vaccine in the Belgian Congo in the late 1950s might have caused AIDS."]}, {"page": "Timeline of HIV/AIDS", "response": ["*Edward Hooper releases a book titled The River, which accuses doctors who developed and administered the oral polio vaccine in 1950s Africa of unintentionally starting the AIDS epidemic. The OPV AIDS hypothesis receives a great deal of publicity. It was later refuted by studies demonstrating the origins of HIV as a mutated variant of a simian immunodeficiency virus that is lethal to humans.Origin of Human Immunodeficiency Virus (HIV/AIDS) Centers for Disease Control and Prevention website, Accessed 30th January 2007 Hooper's hypothesis should not be confused with the Heart of Darkness origin theory."]}, {"page": "Hooper (surname)", "response": ["*Edward Hooper, British journalist"]}, {"page": "Bette Korber", "response": ["In the history of HIV/AIDS virus with regard to when and where HIV originated, Edward Hooper had postulated in a best-selling book called The River: A Journey to the Source of HIV and AIDS in 1999 that HIV could have jumped from chimpanzees to humans because of an accidental contamination by chimpanzee SIV of the oral polio vaccine (CHAT) used in Africa in the 1950s. Korber and her colleagues employed the Los Alamos National Laboratory database's genomic data to calculate when the HIV sequence evolution began, using a model of evolution based on the mutation rate of HIV strains and assuming that variable was the same on all branches of the evolutionary tree. In 2000 they published an estimate of approximately 1930 for the origin of the human immunodeficiency virus. Their research was covered widely as establishing a new date for the origin of the human virus, discrediting the oral polio virus theory, and therefore refuting concerns about using oral polio vaccine (OPV). These two concepts of the origin of this virus plus other related theories continued to compete for scientific credibility."]}]}}