{"wiki_id": "http://www.wikidata.org/entity/Q2345046", "itemLabel": "Stephen Rollnick", "itemDescription": "South African psychologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Rollnick", "wikipedia_page": {"main": "Stephen Rollnick is Honorary Distinguished Professor in the School of Medicine, Cardiff University, Wales, UK.  Alongside William R Miller, he developed many of the founding principles of motivational interviewing.", "link_mentions": [{"page": "Motivational interviewing", "response": ["Motivational interviewing (MI) is a counseling approach developed in part by clinical psychologists William R. Miller and Stephen Rollnick. It is a directive, client-centered counseling style for eliciting behavior change by helping clients to explore and resolve ambivalence. Compared with non-directive counseling, it is more focused and goal-directed, and departs from traditional Rogerian client-centered therapy through this use of direction, in which therapists attempt to influence clients to consider making changes, rather than engaging in non-directive therapeutic exploration. The examination and resolution of ambivalence is a central purpose, and the counselor is intentionally directive in pursuing this goal. MI is most centrally defined not by technique but by its spirit as a facilitative style for interpersonal relationship.", "Motivational interviewing was originally developed by William R. Miller and Stephen Rollnick in the 1980s in order to aid people with substance use disorders. However, it has also been implemented to help aid in established models with mental disorders such as anxiety and depression. Currently an established model known as cognitive behavioral therapy (CBT) is being implemented to aid in these issues. Research suggests that with collaborating motivational interviewing and CBT has proved to be effective as they have both shown to be effective. A study was conducted as a randomized cluster trial that suggests that when MI was implemented it \"associated with improved depressive symptoms and remission rate\". There is currently insufficient research papers to prove the effect of MI in mental disorders. However, it is increasingly being applied and more research is going into it."]}, {"page": "William Richard Miller", "response": ["William Richard Miller (born June 27, 1947) is an American clinical psychologist, an emeritus distinguished professor of psychology and psychiatry at the University of New Mexico in Albuquerque. Miller and Stephen Rollnick are the co-founders of motivational interviewing."]}, {"page": "List of clinical psychologists", "response": ["* Stephen Rollnick, with William R. Miller co-founder of motivational interviewing"]}, {"page": "Guilford Press", "response": ["The company's titles are regularly reviewed in prominent publications, including Choice Reviews, Doody's Review Service, Library Journal, and Publishers Weekly. In the academic sphere, Guilford Publications has published books by Aaron T. Beck, who is known as the father of cognitive therapy and was the winner of the 2006 Lasker Foundation Clinical Medical Research Award; Marsha Linehan, the developer of dialectical behavior therapy (DBT); and the founders of motivational interviewing, Stephen Rollnick and William R. Miller. Overcoming Binge Eating, Second Edition, by Christopher G. Fairburn, and Mind Over Mood by Dennis Greenberger and Christine A. Padesky, have been chosen for inclusion in the United Kingdom Reading Well Books on Prescription program, a selective list of self-help books that general practitioners, counselors, and community mental health specialists are encouraged to \"prescribe\" for patients with mild to moderate mental health concerns. Mind Over Mood was also voted by the British Association of Behavioural and Cognitive Therapies as \"the most influential cognitive behavioural therapy publication\" and was recommended by Scientific American Mind."]}, {"page": "Motivational enhancement therapy", "response": ["Motivational enhancement therapy is a strategy of therapy that involves a variation of motivational interviewing to analyze feedback gained from client sessions. Motivational Interviewing was originated by William Miller and Stephen Rollnick based on their experiences treating problem drinkers. The idea of Motivational Interviewing is based on engaging the client to pursue a behavior change. The method revolves around goal making, with assistance from the counselor to help guide the client to that specific set goal. This concept of motivational interviewing later developed into motivational enhancement therapy. The goal of this therapy is to help lead the client to achieve the goals they have set for themselves. Its aim is to provide the client with the opportunity to develop a focus in their life, other than their addiction."]}, {"page": "Decisional balance sheet", "response": ["One research paper reported that combining the decisional balance sheet technique with the implementation intentions technique was \"more effective in increasing exercise behaviour than a control or either strategy alone.\" Another research paper said that a decisional balance intervention may strengthen a person's commitment to change when that person has already made a commitment to change, but could decrease commitment to change if that person is ambivalent; the authors suggested that evocation of change talk (a technique from motivational interviewing) is more appropriate than a decisional balance sheet when a clinician intends to help ambivalent clients resolve their ambivalence in the direction of change. William R. Miller and Stephen Rollnick's textbook on motivational interviewing discusses decisional balance in a chapter titled \"Counseling with Neutrality\", and describes \"decisional balance as a way of proceeding when you wish to counsel with neutrality rather than move toward a particular change goal\"."]}, {"page": "Rollnick, Stephen", "response": ["#redirectStephen Rollnick"]}]}}