{"wiki_id": "http://www.wikidata.org/entity/Q2344980", "itemLabel": "Stephen Conroy", "itemDescription": "Australian politician (born 1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Conroy", "wikipedia_page": {"main": "Stephen Michael Conroy (born 18 January 1963) is an Australian former politician who was an Australian Labor Party member of the Senate from 1996 to 2016, representing the state of Victoria. He served as a minister in the Rudd and Gillard Governments. He resigned from the Senate in September 2016. He now works as a lobbyist and political commentator.\n\n", "link_mentions": [{"page": "Dalek", "response": ["Australian Labor Party luminary Robert Ray described his right wing Labor Unity faction successor, Victorian Senator Stephen Conroy, and his Socialist Left faction counterpart, Kim Carr, as \"factional Daleks\" during a 2006 Australian Fabian Society lunch in Sydney."]}, {"page": "Internet troll", "response": ["In February 2010, the Australian government became involved after users defaced the Facebook tribute pages of murdered children Trinity Bates and Elliott Fletcher. Australian communications minister Stephen Conroy decried the attacks, committed mainly by 4chan users, as evidence of the need for greater Internet regulation, stating, \"This argument that the Internet is some mystical creation that no laws should apply to, that is a recipe for anarchy and the wild west.\"\"Internet without laws a 'recipe for anarchy' , News.ninemsn.com.au, 1 April 2010. Retrieved 5 April 2010. Facebook responded by strongly urging administrators to be aware of ways to ban users and remove inappropriate content from Facebook pages.\"Facebook takes (small) step against tribute page trolls\", TG Daily, 30 March 2010. Retrieved 5 April 2010. In 2012, the Daily Telegraph started a campaign to take action against \"Twitter trolls\", who abuse and threaten users. Several high-profile Australians including Charlotte Dawson, Robbie Farah, Laura Dundovic, and Ray Hadley have been victims of this phenomenon."]}, {"page": "Telecommunications in Australia", "response": ["On 31 December 2007, Stephen Conroy announced the federal government's intention to censor 'inappropriate material' from the Internet. Under the proposed system any Australian who subscribes to an ISP would receive a 'clean' version of the Internet. The Federal Government's stated aim is to protect children from accessing violent and pornographic websites. This plan was later abandoned and the Australian government continues to only block websites that violate online laws."]}, {"page": "Philip Nitschke", "response": ["On 22 May 2009 it was disclosed in the press, citing WikiLeaks, that the Australian Government had added the online Peaceful Pill Handbook to the blacklist maintained by the Australian Communications and Media Authority used to filter internet access to citizens of Australia. The Australian Communications Minister, Stephen Conroy, planned to introduce legislation just before the 2010 election to make internet service providers block a blacklist of \"refused classification\" websites. The blacklist is expected to include Exit's websites and other similar sites. Nitschke said the proposals were the \"final nail in the coffin for euthanasia advocacy\" in Australia, where people are banned from discussing end-of-life issues over the phone, buying books about it or importing printed material on it. \"The one avenue we had open to us was the internet, and now it looks like it will be part of Conroy's grand plan to provide a so-called clean feed to Australia. It's outrageous.\""]}, {"page": "Simon Crean", "response": ["Crean retained this position when Beazley returned to the leadership in January 2005. However, in a reshuffle of the Shadow Cabinet in June 2005, Crean was demoted to Shadow Minister for Regional Development. He then faced a pre-selection challenge for his seat of Hotham from Martin Pakula, a member of his former union, the SPU, a move which Crean publicly blamed on Beazley, Hong Lim, and the Labor Right. Beazley refused to publicly support either candidate, but several frontbenchers, including Julia Gillard, supported Crean. This helped Crean to comfortably win the pre-selection for his seat; Crean singled out Senator Stephen Conroy for his part in the move against him, describing his front-bench colleague as \"venal\" and \"one of the most disloyal people I've ever worked with in my life\". Following the replacement of Kim Beazley by Kevin Rudd as leader in December 2006, Rudd reappointed Crean as Shadow Minister for Trade."]}, {"page": "Fiona Stanley", "response": ["Stanley is a professor at the School of Paediatrics and Child Health at University of Western Australia and the UNICEF Australian Ambassador for Early Childhood Development. She was named Australian of the Year in 2003. In 2011 she was appointed to the board of the Australian Broadcasting Corporation by communications minister Stephen Conroy.Fiona Stanley joins ABC board ABC News, 1 July 2011. Retrieved 17 May 2021. Phase one of the hospital, the Fiona Stanley Hospital named in her honour, officially opened on 3 October 2014."]}, {"page": "Censorship in Australia", "response": ["On 31 December 2007 the Telecommunications Minister of the newly elected Labor government, Stephen Conroy, announced that Australia would introduce mandatory internet filtering. Once more the reason given is that mandatory filtering is required to \"provide greater protection to children from online pornography and violent websites\".", "As of November 2008, the plan includes two blacklists, one of which will filter illegal content according to internet content laws as well as other \"unwanted\" content, and the other will also filter content unsuitable for children. Internet users will be able to opt out of the secondary blacklist for children, but will not be able to opt out of the primary filter, sparking free speech concerns.The Industry Standard Channel – InfoWorld . Thestandard.com. No statement has been made about what content will be considered \"illegal\", or what Stephen Conroy means by \"unwanted\"."]}, {"page": "Australian National University", "response": ["ANU alumni are often visible in government. Bob Hawke and Kevin Rudd, former Australian Prime Ministers, attended the university, as did senior politicians Annastacia Palaszczuk, Barry O'Farrell, Nick Minchin, Kim Beazley Sr, Peter Garrett, Craig Emerson, Stephen Conroy, Gary Gray, Warren Snowdon, Joe Ludwig and Catherine King and Michael Keenan. ANU has produced 30 current Australian Ambassadors, and more than a dozen current heads of Australian Public Service departments, including Prime Minister & Cabinet secretaries Michael Thawley and Martin Parkinson, Finance secretary Jane Halton, Education secretary Lisa Paul, Agriculture secretary Paul Grimes, Attorney-General's secretary Chris Moraitis, Environment secretary Gordon de Brouwer, Employment secretary Renee Leon, Social Services secretary Finn Pratt, Industry secretary Glenys Beauchamp, ASIS director-general Nick Warner and ACCC chairman Rod Sims. Graduates also include Prime Minister of the Solomon Islands Gordon Darcy Lilo, Foreign Minister of Mongolia Damdin Tsogtbaatar, former Indonesian Foreign Minister Marty Natalegawa, former Governor of the Reserve Bank of New Zealand Don Brash, former British Secretary of State for Health Patricia Hewitt and former U.S. Ambassador to Israel Martin Indyk."]}, {"page": "Mark Latham", "response": ["Latham was a strong supporter of Kim Beazley's successor Simon Crean, defending the leader against his critics within the party. He called Crean's principal frontbench detractors, Stephen Smith, Stephen Conroy and Wayne Swan \"the three roosters\". When Crean resigned the Labor leadership, Latham contested the ballot for leader against Beazley. On 2 December 2003, Latham won the vote for the leadership by 47 votes to 45. Kevin Rudd and Julia Gillard were early contenders for the leadership, but both withdrew in favour of Beazley and Latham respectively. At age 42, Latham became the youngest leader of the federal parliamentary Labor Party since its first leader Chris Watson, who became leader at age 33 in 1901. In his first press conference as leader, Latham championed his belief in a \"ladder of opportunity\" that would bring prosperity to all Australians.", "In December, after Latham was incorrectly reported to have blamed Labor's state premiers for the defeat, an unnamed Labor frontbencher predicted a leadership challenge within the next few months, saying Latham's supporters had lost confidence in him. Latham also had a heated public confrontation with the Labor deputy leader in the Senate, Stephen Conroy, renewing speculation there would be a challenge to Latham's leadership in the new year."]}, {"page": "Australian Communications and Media Authority", "response": ["The leaked list, which was reported to have been obtained from a manufacturer of internet filtering software, contained 2395 sites. Approximately half of the sites on the list were not related to child pornography, and included online gambling sites, YouTube pages, gay, straight, and fetish pornography sites, Wikipedia entries, euthanasia sites, websites of fringe religions, Christian sites, and even the websites of a tour operator and a Queensland dentist. Colin Jacobs, spokesman for lobby group Electronic Frontiers Australia, said that there was no mechanism for a site operator to know they got onto the list or to request to be removed from it. Australia's Communications Minister, Stephen Conroy later blamed the addition of the dentist's website to the blacklist on the \"Russian mob\".", "Associate professor Bjorn Landfeldt of the University of Sydney said that the leaked list \"constitutes a condensed encyclopedia of depravity and potentially very dangerous material\". Stephen Conroy said the list was not the real blacklist and described its leak and publication as \"grossly irresponsible\" and that it undermined efforts to improve \"cyber safety\". He said that ACMA was investigating the incident and considering a range of possible actions including referral to the Australian Federal Police, and that Australians involved in making the content available would be at \"serious risk of criminal prosecution\"."]}, {"page": "Anthony Byrne (politician)", "response": ["Working with the chair of the committee, Andrew Hastie, Byrne is known to have exerted strong pressure on the UK Secretary of State for Foreign and Commonwealth Affairs, Dominic Raab, persuading him to re-consider the UK's decision to allow Huawei to provide for their 5G network. It's known he had challenged the Foreign Secretary on the matter in February 2020, saying, \"How would you feel if the Russians laid down infrastructure in your own networks? That's how we feel about Huawei.\" By May, Boris Johnson had announced that the UK would reduce the Chinese tech company's involvement \"to zero\". Stephen Conroy, who had overseen broadband roll out in Australia in 2011, indicated that Bryne and Hastie had played a pivotal role in the UK's decision."]}, {"page": "AIJAC", "response": ["The first Ramban participants were a group of young political leaders who undertook a week-long program of activities in July 2003. The second Ramban mission consisted of a five-member Coalition parliamentary delegation who visited Israel in December 2003. The third Ramban mission in February 2004 was a bipartisan parliamentary delegation consisting of Australian Labor Party Senators Stephen Conroy (Victoria), Linda Kirk (South Australia), Ursula Stephens (New South Wales), and Liberal Members of Parliament Steven Ciobo, Sophie Panopoulos, and Andrew Southcott. More recently, in 2018, Senators Stirling Griff (Centre Alliance) and Kristina Keneally (Labor) attended, along with other politicians, as well as journalists, including Sharri Markson and James Campbell."]}, {"page": "Sky News Australia", "response": ["*Stephen Conroy", "As many of the channel’s primetime contributors are conservatives, the Australian Labor Party and its figureheads Victorian premier Daniel Andrews, Queensland premier Annastacia Palaszczuk and Western Australian premier Mark McGowan are frequently critiqued whilst the policies of the Liberal and National parties of Australia are often endorsed and promoted. However, the channel also frequently features left-leaning politicians and commentators such as Stephen Conroy, Nicholas Reece, and Graham Richardson throughout its panel programming in order to facilitate debate between a multitude of viewpoints on the channel. During the COVID-19 pandemic beginning in the year 2020, some Sky News commentators referred to Victorian Premier Daniel Andrews as a 'Dictator' and a 'Chairman', drawing a comparison to socialist and communist regimes when criticising Andrews’ frequent use of pandemic lockdowns and public health orders."]}, {"page": "Penny Wong", "response": ["In February 2013, Wong was elected as the ALP's deputy Senate leader following the resignation of Chris Evans, thus becoming Deputy Leader of the Government in the Senate.Ministerial Representation & Senate Office Holders in the Senate 43rd Parliament • 25 March 2013 • The Parliament of the Commonwealth of Australia , accessed 8 September 2013 Wong retained the position of Minister for Finance after Kevin Rudd's successful leadership spill in June 2013. Following Stephen Conroy's resignation and the beginning of the Second Rudd Government, she also became the Leader of the Government in the Senate. She was the first woman to be elected as ALP Senate leader, and the first woman to serve as Leader of the Government in the Senate.Senator The Hon Penny Wong , directory.gov.au, accessed 8 September 2013"]}, {"page": "Internet censorship in Australia", "response": ["On 15 December 2009, the Labor government announced plans to mandate censorship of refused classification material in Australia. The then Minister for Broadband, Communications and the Digital Economy, Senator Stephen Conroy, released a statement titled Measures to improve safety of the internet for families, which briefly outlined the proposed purpose and methods of filtering. The scheme aimed to develop \"a package that balances safety for families and the benefits of the digital revolution\", and was intended to complement the work of the ACMA by blocking content hosted overseas which is out of the control of Australian authorities.", "On 22 May 2009, it was disclosed in the press, citing WikiLeaks, that the Australian Government had added Dr Philip Nitschke's online Peaceful Pill Handbook, which deals with the topic of voluntary euthanasia, to the blocklist maintained by the Australian Communications and Media Authority used to filter web access to citizens of Australia. Euthanasia groups will hold seminars around Australia teaching how to evade the proposed filter using proxy servers and virtual networks. A spokeswoman for Senator Conroy said that euthanasia would not be targeted by the proposed web filter,Euthanasia workshops 'to fight filter' (smh) however Stephen Conroy has previously stated that \"while euthanasia remains illegal it will be captured by the RC filter\".", "In 2010, the website of the Australian Sex Party is banned from within several state and federal government departments, including Stephen Conroy's ACMA. Convenor of the Australian Sex Party Fiona Patten has described this ban as \"unconstitutional\".Aussie net censorship turning Chinese The Register", "On 31 December 2007, Stephen Conroy announced the Federal Government's intention to introduce an ISP-based filter to censor \"inappropriate material\" from the Internet to protect children. In this announcement, it was stated that adults could opt out of the filter to receive uncensored access to the Internet.", "In March 2009, Stephen Conroy dismissed suggestions that the Government would use the filter to crack down on political dissent as \"conspiracy theories\".  He stated that the filter would only be used to remove \"refused classification\" (RC) content, using the same rationale as existing television, radio and print publications, and that the Senate could be relied upon to provide rigorous assessment of any proposed legislation. However, Labor's policy statement on the issueLabor's Plan For Cyber Safety contradicts this.  It is also contrary to an earlier ministerial release in 2008.Minister welcomes advances in internet filtering technology ", "Stephen Conroy has stated that 85% of Internet Service Providers, including Telstra, Optus, iPrimus, and iiNet, welcome the Internet filter.Filter goes ahead regardless (smh) In response, Steve Dalby, iiNet's chief regulatory officer, stated that iiNet as a company does not support the Internet filter, and never has.What we really think (iiNet)", "On 9 July 2010, Stephen Conroy announced that any mandatory filtering would be delayed until at least 2011.", "On 9 November 2012, Stephen Conroy shelved the proposed mandatory filter legislation in favour of existing legislation, touting that it was successful in compelling the largest ISPs to adopt a filter. As a result, 90% of Australian Internet users are censored from accessing some web-based content.\"Child abuse material blocked online, removing need for legislation\" , Department of Broadband, Communications and the Digital Economy, 9 November 2012", "In February 2009, then opposition communications spokesman Nick Minchin obtained independent legal advice confirming that a mandatory censorship regime would require new legislation. In March 2009, after the ACMA blocklist was leaked and iiNet withdrew from the filtering trials, he stated that Stephen Conroy was \"completely botching the implementation of this filtering policy\".Opposition says Government is botching internet filter trial (ABC)", "25 March 2009: Stephen Conroy has reportedly stated that this list closely resembles the ACMA list.Stephen Conroy says leaked list of banned websites 'seems like ACMA's blacklist' (news)   ", "In the same discussion Bill Henson's website, despite the PG rating given to his photographs by the same body, appeared on the blocklist due to a technical error according to Stephen Conroy'Technical error' behind Henson website black-listing - ABC News (Australian Broadcasting Corporation) The ACMA has since released a statement claiming the technical error was a \"computer system caching error\" and further stated \"found that this is the only URL where a caching error resulting in the URL being incorrectly added to the list.\"", "At the end of 2008, Stephen Conroy anticipated that the live trial would test the filtering of BitTorrent traffic,Oz net censorship apparatus to target BitTorrent The Register, 22 December 2008. but in March 2009 he stated that the proposed filters would not be effective on peer-to-peer traffic.Conroy admits blacklist error, blames 'Russian mob' Sydney Morning Herald, 27 March 009.", "In December 2009, the results of the filtering trial were released. Stephen Conroy stated, \"The report into the pilot trial of ISP-level filtering demonstrates that censoring RC-rated material can be done with 100 percent accuracy and negligible impact on Internet speed\".Conroy Reveals Plans to Censor the Internet However, concerns have been raised about the report: only a small minority of ISP users participated; the trial did not test using any high-speed Internet connections similar to those available with the National Broadband Network; there is evidence that the filter was evaded; and with only 600 to 700 sites on the RC blocklists, the effect of the filter would be marginal at best.Conroy's clean feed won't block porn (New Matilda)", "GetUp! teamed up with award-winning,31st non-traditional and digital creative agency Fnuky Advertising to launch a campaign in Australia to raise awareness of the Australian Government's flawed plans to introduce web censorship. The campaign impersonated the Australian Federal Government by presenting web censorship as a mock consumer product branded as Censordyne, a parody of the toothpaste brand Sensodyne.Good Clean Internet Censorship Fnuky Advertising's Creative Director, David Campbell selected toothpaste as the platform for the campaign after Stephen Conroy stated the purpose of web censorship in Australia was to \"Fight Moral Decay\". The Censordyne campaign was launched online during July 2009 by a single Twitter post by fake Stephen Conroy, a popular impersonator of the Australian Communications Minister, Stephen Conroy. The campaign featured an online video,YouTube - GetUp! - Censor This? Censordyne - Internet Censorship a Censordyne product websiteCensordyne - Good, clean internet censorship and a Censordyne search engine. Within 24 hours of launch, the words GetUp and Censordyne were the number 2 and 3 most talked about brands on Twitter worldwide.  The campaign received widespread coverage in most major Australian newspapers and news websites. Censordyne become a topic of discussion on Nova 96.9 radio in Sydney and was featured on the Australian ABC television program Insiders.", "In a speech in January 2010, U.S. Secretary of State Hillary Clinton accuses countries with Internet censorship of breaching the UN's Universal Declaration of Human Rights, and the Australian filter fits her definition for censorship. Stephen Conroy welcomed Clinton's speech, and agrees with her that \"freedom of expression has its limits\". Colin Jacobs responded in turn to note that while there are limits to free speech, Clinton had stated that the advantages of the Internet would be jeopardised by introducing censorship.Clinton speech boosts anti-filter campaign (ABC) As part of a diplomatic assault by the United States on Internet censorship in many countries, U.S. State Department spokesman Noel Clay has raised concerns about the filter plan with Australian officials.Stephen Conroy and US at odds on net filter (The Australian)", "The leaders of three of Australia's largest ISPs (Telstra, iiNet, and Internode) have stated in an interview that the web filtering proposal simply cannot work for various technical, legal and ethical reasons.ISP-level content filtering won't work The managing director of iiNet, Michael Malone, has said of Stephen Conroy: \"This is the worst Communications Minister we've had in the 15 years since the [Internet] industry has existed\", and plans to sign up his ISP for participation in live filtering trials by 24 December to provide the government with \"hard numbers\" demonstrating \"how stupid it [the filtering proposal] is\".Net Censorship Plan Backlash (SMH)", "Internode engineer Mark Newton was the subject of a letter of complaint from Stephen Conroy's office for his participation in a Whirlpool forum showing the negative impact of the filter on Internet access speeds.Filtering out the fury: how government tried to gag web censor critics Sydney Morning Herald, 24 October 2008", "Conservative South Australian Liberal Senator Cory Bernardi does not support the mandatory web filter. He considers Stephen Conroy's plan to be \"so devoid of detail\" that it is impossible to form an opinion on it, and says \"Parental responsibility cannot and should not be abrogated to government—if it is, our society will only become weaker ... Yes, illegal content should be banned from the web ... but it is wrong to give the government a blank cheque to determine what is appropriate for us to view on the Internet.\"New hurdle for net censorship (SMH) ", "The Howard Government commissioned a number of independent technical experts to examine Internet filtering. The resulting report was delivered to the Australian Government in February 2008, and released publicly in December 2008. Professor Bjorn Landfeldt, one of the report's authors, stated that filtering technology simply does not work, as it can easily be bypassed and slows access to the Internet by up to 87%. In response, Stephen Conroy has stated that the report involved no empirical testing, and was simply a literature review of material available from other sources; any problems raised by the report would be tested during the filter trials scheduled for mid-January 2009.Fatal Flaws in Web Censorship Plan, says reportGovernment rejects negative internet filter report"]}, {"page": "2007 Australian federal election", "response": ["* Sky News Australia's coverage was hosted by David Speers in Sydney with Helen Dalley at the tally room in Canberra. Guests included former prime minister Bob Hawke, former Labor Leader Kim Beazley, former Liberal Leader John Hewson, and current members in Parliament, including Brendan Nelson and Concetta Fierravanti-Wells from the Liberal Party, Natasha Stott Despoja from the Democrats, Christine Milne from The Greens and Stephen Conroy and Tony Burke from the Labor Party. Party strategists Bruce Hawker and Lynton Crosby analysed the figures from the Sky News Centre in Sydney."]}, {"page": "Ian Macdonald (Australian politician)", "response": ["On 3 November 2011 during debate on carbon tax legislation, Macdonald stated \"GetUp! is the Hitler Youth wing of the Greens political movement.\" Senator Macdonald stood by his comments when challenged. While he later apologised to the Jewish community for this remark, he did not withdraw the comment in Parliament. He also once likened Stephen Conroy to Joseph Goebbels."]}, {"page": "Electronic Frontiers Australia", "response": ["In 2006, the EFA pushed against Cleanfeed, a mandatory ISP level content filtration system proposed by Kim Beazley. Internet filtering was later pursued by Telecommunications Minister Stephen Conroy.  The EFA presented a petition against mandatory internet filtering with 19,000 signatures to the Australian Senate."]}, {"page": "Melbourne High School", "response": ["Former MHS principal once quoted, \"There is a joke here that if you reside in Canberra's halls of power but you haven't been invited to Melbourne High by the PIG, you haven't really made it.\" The Political Interest Group has had speakers ranging from former Federal Treasurer Peter Costello, to former Prime Minister Kevin Rudd, former Prime Minister Julia Gillard (at the time, Shadow Health Minister), former Federal Minister Stephen Conroy and annually has Andrew Bolt speak at the school. Recently PIG has had journalists such as Catherine Deveny, Derryn Hinch, Barrie Cassidy as well as politicians such as Richard di Natale."]}]}}