{"wiki_id": "http://www.wikidata.org/entity/Q234199", "itemLabel": "Jamelia", "itemDescription": "British singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Jamelia", "wikipedia_page": {"main": "Jamelia Niela Davis (born 11 January 1981) is an English singer, songwriter and television presenter. She has released three studio albums, each of which has reached the Top 40 in the UK, which collectively have spawned eight UK top-ten singles. In addition, Jamelia has won four MOBO Awards, a Q Award and has received nine BRIT Award nominations.Jamelia's professional music career began in 1999, when she released her debut single, \"So High\", followed by a more successful single, \"I Do\". She then released her debut full-length studio album, Drama, in June 2000. Jamelia went on to release further successful singles, including \"Superstar\" which charted at number three on the UK Singles Chart and number one in Australia, where it became platinum certified. She went on to further release another two studio albums, Thank You (2003) and Walk with Me (2006), before leaving Parlophone following a dispute with executives over the release of \"No More\", the third offering from Walk with Me.\nJamelia's ten-year-successful career span has led her to becoming a judge on shows such as Move Like Michael Jackson in 2009. Her filmography also includes her own TV documentaries, including Jamelia: Whose Hair Is It Anyway (2008), her own edition of the popular Channel 4 show, The House That Made Me and in 2011, her own BBC Three documentary, Jamelia: Shame About Single Mums. In 2010 she signed a new record deal with All Around the World Productions. She was a panellist on the ITV magazine show Loose Women from 2013 until 2016.\n\n", "link_mentions": [{"page": "1981", "response": ["* January 11 – Jamelia, British singer"]}, {"page": "Are You Being Served?", "response": ["There is a homage to the theme song in the Ladytron song \"Paco!\" from the album 604, and New Zealand band Minuit's \"I hate guns\". A lugubrious version of the theme song is featured on the album The Ape of Naples by the experimental music group Coil. The theme song has also been covered by Australian band Regurgitator on their 1999 album ...art. Pop singer Jamelia's song \"Window Shopping\" (from her 2006 album Walk with Me) begins with a sample of the familiar cash register sound effect as well as Mrs Slocombe's voice inquiring, \"Good morning, Mr Grainger; are you free?\""]}, {"page": "Mercury Prize", "response": ["* Jamelia – Thank You"]}, {"page": "Band Aid (band)", "response": ["*Jamelia"]}, {"page": "Doctors (2000 TV series)", "response": ["Alongside the regular cast, Doctors features numerous recurring and guest characters. Recurring characters typically have a connection to the regulars, such as Izzie Torres (Bethan Moore), the daughter of Daniel, and Eve Haskey (Rachel Bell), the mother of Al. Doctors also features guest stars in each episode, with examples including Emilia Clarke, Alison Hammond, Ruthie Henshall, Jamelia, Claire King, Joe Pasquale, Eddie Redmayne, Lisa Riley and Sheridan Smith."]}, {"page": "Greenbelt Festival", "response": ["The festival regularly attracts the biggest names of Christian music and many mainstream musicians. Those that have played the festival in the past include both new and established musicians, mostly playing rock, folk and pop music. This list encompasses The Alarm, U2, Moby, Pussy Riot, Cliff Richard, Bruce Cockburn, Ed Sheeran, Martyn Joseph, Steve Taylor, Daniel Amos, Phatfish, Servant, Midnight Oil, Michael Franti and Spearhead, Over the Rhine, Iona, Amy Grant, Miles Cain, Lamb, Kevin Max, Lambchop, Goldie, Jamelia, After the Fire, Larry Norman, Randy Stonehill, Asian Dub Foundation, The Polyphonic Spree, Aqualung, Dum Dums, The Proclaimers, Daniel Bedingfield, Eden Burning, Duke Special, Why?, Athlete, Sixpence None the Richer, The Choir, and Delirious?.", "| rowspan=\"3\" | Lambchop, Delirious?, Denys Baptiste, Jamelia, After The Fire, Rob Newman, Rowan Williams"]}, {"page": "1981 in music", "response": ["*October 1 – Jamelia, British singer"]}, {"page": "List of singer-songwriters", "response": ["*Jamelia"]}, {"page": "List of one-word stage names", "response": ["* Jamelia (born 1981), British entertainer"]}, {"page": "Top of the Pops", "response": ["On 30 July 2004, the show took place outside a studio environment for the first time by broadcasting outside in Gateshead. Girls Aloud, Busted, Will Young and Jamelia were among the performers that night."]}, {"page": "Queer Eye (2003 TV series)", "response": ["The soundtrack for Queer Eye for the Straight Guy was released February 10, 2004, in the USA. It reached number one on the electronic music chart, number two on the soundtrack charts and the top 40 in the Billboard 200 album chart. In Australia, the soundtrack was released for the Sydney Gay and Lesbian Mardi Gras, and the popularity of the series in Australia resulted in the soundtrack scoring in the top 10 of the Australian album chart on March 8, 2004. It was certified gold in Australia in March 2004. The song \"Superstar\" by Jamelia from the soundtrack also went to number one on the Australian singles charts in the same week, and the theme song of the show, \"All Things (Just Keep Getting Better)\" by Widelife, went to the top 20 that month. \"All Things\" scored a 2005 Juno Award for \"Dance Recording of the Year\" for Widelife (Rachid Wehbi & Ian Nieman). Rob Eric was the executive producer for the album.", "# \"Superstar\" – Jamelia"]}, {"page": "Brit Awards", "response": ["| 2005 || Daniel Bedingfield, Natasha Bedingfield, Franz Ferdinand, Green Day, Gwen Stefani, Jamelia, Lemar, Keane, Snoop Dogg, Pharrell Williams, Scissor Sisters, Bob Geldof, Robbie Williams and The Streets"]}, {"page": "LMC (British band)", "response": ["* \"Kill It in the Name\" - Jamelia (2011)"]}, {"page": "Music of Denmark", "response": ["Some hit songs of Danish origin have become international hits after being covered by foreign artists. Vengaboys covered The Walkers' \"Shalala Lala\", Jamelia covered Christine Milton's \"Superstar\", Shayne Ward covered Bryan Rice's \"No Promises\" and Celine Dion covered Tim Christensen's \"Right Next to the Right One\". Different covers of Rune's \"Calabria\" have also been international hits."]}, {"page": "Chris Martin", "response": ["Martin has written songs for a variety of acts including Embrace (\"Gravity\") and Jamelia (\"See It in a Boy's Eyes\", co-written with Coldplay producer Rik Simpson). Martin has also collaborated with Ron Sexsmith, Faultline, the Streets, and Ian McCulloch. He also sang a part of the vocals for the Band Aid 20 single \"Do They Know It's Christmas?\" at the end of 2004. In 2005, Martin collaborated with Nelly Furtado on the track \"All Good Things (Come to an End)\", for her 2006 album, Loose. The two were once rumoured to be a couple, after they both performed at Glastonbury in 2002. Nelly Furtado joked about it, saying, \"Yeah, he's my boyfriend — he just doesn't know it yet\".", "|Jamelia"]}, {"page": "Body Language (Kylie Minogue album)", "response": ["Soon, Minogue began work on her ninth studio album Body Language. Aiming to create a dance-pop album inspired by electronic music from the 1980s, Minogue enlisted collaborators such as Cathy Dennis, Dan Carey, Emiliana Torrini, Johnny Douglas and Mantronix. Talking further about Scritti Politti, a British post-punk band, Minogue reminisced about her collaboration with the band's frontman Green Gartside, who provides vocals on the track \"Someday\", saying, \"To this day I haven't met him! I left a message on his answering machine, saying, \"Hi, it's Kylie! I just wanted to say thanks so much! You sound brilliant!\" \"After Dark\" was co-written by Dennis, who had previously co-written \"Can't Get You Out of My Head\" for Minogue. Torrini, who co-wrote \"Slow\", revealed how she was approached for writing the song, saying \"It was like I had just accidentally walked into the line of fire with, \"Hey! You There! It was all quite surreal. I still think Kylie's people were trying to call Jamelia, and they just got the wrong number. It'd be much more funny if that is how it actually happened\". The recording of Body Language took place during the summer of 2003, in London, England; Dublin, Ireland and Marbella, Spain."]}, {"page": "24th Brit Awards", "response": ["**Jamelia – \"Superstar\"", "**Jamelia", "! width=\"50%\" | British Rock Act(presented by Jamelia)", "|Jamelia"]}, {"page": "Top of the Pops 2", "response": ["After the cancellation of Top of the Pops, TOTP2 returned to BBC Two on 30 September 2006. The new show format was similar to the earlier TOTP2, but also included live/original BBC performances. These episodes were produced and broadcast in the 4:3 aspect ratio like the majority of its archive material, except for the first two episodes, which were shown in the 16:9 aspect ratio to accommodate new performances. The first 50-minute special included Nelly Furtado, Jamelia and Razorlight, before it reverted to a 30-minute weekly format at 20:00."]}, {"page": "Handsworth, West Midlands", "response": ["Handsworth has produced some notable popular musical acts: Steel Pulse (whose first studio album Handsworth Revolution is named after the area), Joan Armatrading, Pato Banton, Benjamin Zephaniah, Swami, Apache Indian, Ruby Turner and Bhangra group B21. In addition, hard rock band Black Sabbath's lead guitarist and songwriter Tony Iommi, Steve Winwood, pop singer Jamelia and progressive rock drummer Carl Palmer were born in Handsworth.", "* Jamelia (born 1981), singer-songwriter"]}, {"page": "Barnt Green", "response": ["*Jamelia, singer and television personality, lives in Barnt Green with her husband and three daughters"]}, {"page": "Party in the Park", "response": ["*Jamelia"]}, {"page": "David Walliams", "response": ["| style=\"text-align: center\" | 2 || 8 Out of 10 Cats || Jimmy Carr regular || Captain || Other team captain: Sean Lock regular. Panellists: Jamelia, Josh Widdicombe, Jon Richardson and Victoria Coren"]}, {"page": "Mercury4", "response": ["Their second single, \"5 Years from Now\", was released in January 2004 and reached No. 16 on the Australian charts in February 2004. The band's third single \"Every Little Step\" (May 2004) was a cover of Bobby Brown's 1989 single, and was produced by Cutfather & Joe who wrote and produced the Jamelia hit \"Superstar\". It reached No. 27."]}, {"page": "Mercury4 (album)", "response": ["Their second single \"5 Years From Now\" was released in January 2004 and reached the top 20 of the Australian charts in February 2004. The band's third single \"Every Little Step\", is a cover version of the Bobby Brown hit from his album Don't Be Cruel. This track was produced by Cutfather & Joe who wrote and produced the Jamelia hit, \"Superstar\"."]}, {"page": "Habbo", "response": ["As a website geared towards teenagers, Habbo has attracted sponsorship from outside entities and organizations. This sponsorship includes visits by musicians (such as Gorillaz, Skye Sweetnam, Jamelia, and Akon) as well as various corporations. In 2014 Habbo associated itself with the company DitchTheLabel which hosts various anti-bullying sessions on Habbo."]}, {"page": "Peter Andre", "response": ["In 2014, Andre released the song \"Kid\" (for the film Mr. Peabody & Sherman) which was the lead single from his album Big Night. On 8 October that same year, Andre co-hosted the ITVBe opener with Jamelia. In 2014, Andre became the new face to feature in supermarket Iceland's television commercials."]}, {"page": "List of people from Birmingham", "response": ["*Jamelia – R&B singer", "*Jamelia – RnB singer"]}, {"page": "Radio Academy Awards", "response": ["Amanda Holden, Jamelia, Carol Vorderman, Konnie Huq (Blue Peter), Melinda Messenger, Dolores O'Riordan, and Richard Park) who all presented awards."]}, {"page": "Do They Know It's Christmas?", "response": ["* Jamelia"]}, {"page": "Jeremy Vine", "response": ["In week eight of the show he was in the dance-off, alongside Jamelia, and voted out of the show; finishing in ninth place. He also took part in the 2017 Christmas special with the same partner."]}, {"page": "MTV Europe Music Awards", "response": ["2004: The show was held at Tor di Valle Racecourse in Rome. The outdoor stage was situated in front of the Colosseum, where artists such as Emine, Franz Ferdinand, Beastie Boys, and Anastacia performed to an attendance of over 400,000 people. Outkast received both Best Song and Best Video for their track \"Hey Ya!\". Other multiple winners include Usher and Muse with two awards each. Presenters on the night included Jamelia, Alicia Keys, N.E.R.D, Naomi Campbell, Andre 3000, Kid Rock and Kanye West."]}, {"page": "Karen Poole", "response": ["* Jamelia – \"Taxi\" from the album Thank You", "* Jamelia – \"Beware of the Dog\" from the album Walk with Me"]}, {"page": "Strictly Come Dancing", "response": ["| Jamelia", "| Jamelia", "Series 13 contestant Jamelia holds the record for being in the most dance-offs, which is 5, and shares the record for surviving the most dance-offs with series 18 runner-up Jamie Laing, which is 4. Series 1 semi-finalist Lesley Garrett, Series 11 contestant Mark Benton and Series 17 contestant Mike Bushell share the record for being in the most consecutive bottom twos, which is 4."]}, {"page": "MOBO Awards", "response": ["| \"Thank You\" – Jamelia", "| Jamelia and Shaggy", "The MOBO Awards 2000 ceremony took place at Alexandra Palace, hosted by Trevor Nelson and Lisa Left Eye Lopes and sponsored by Mastercard. There show opened with a performance of Money by Jamelia featuring Beenie Man. Craig David performed an acoustic medley of Fill Me In, 7 Days and Nice & Slow by Usher, Sade exclusively performed By Your Side, Gabrielle performed Rise, MJ Cole performed Crazy Love featuring Elizabeth Troy, Donell Jones performed U Know What's Up featuring ceremony host, Lisa 'Left Eye' Lopes. The show closed with a performance of Who Let The Dogs Out by Baha Men.", "In addition to their performances, Craig David, Jamelia, Beenie Man, MJ Cole and Gabrielle also won awards. With Craig David receiving three awards in total.", "*Best Video: Jamelia - Money", "The 2007 awards ceremony was broadcast live on BBC Three from the O2 Arena in London and hosted by Shaggy and Jamelia. The jazz category returned. Shaggy opened the evening with a medley. T-Pain performed on stage with Yung Joc, Craig David and Kano collaborated on stage; Ne-Yo, Mutya Buena and Robin Thicke also performed. Amy Winehouse performed two songs and accepted the award for Best UK Female. N-Dubz won Best Newcomer. England cricketer Monty Panesar and England footballer Micah Richards were among a line up of guests presenting individual awards which also included Sinitta and Quentin Tarantino."]}, {"page": "2003 in British music", "response": ["*PRS Most Performed Song – \"Superstar\" – Jamelia, written by Mich Hansen, Joseph Belmaati and Remee"]}, {"page": "Band Aid 20", "response": ["*Jamelia"]}, {"page": "Bridget Jones: The Edge of Reason", "response": ["English singer Jamelia covered \"Stop\" after the makers of the 2004 film Bridget Jones: The Edge of Reason approached her to record it to illustrate an integral part of the film. Jamelia instantly accepted the offer and explained how much she was a fan of the character and of the first film.:: Jameila :: Stop  The exclamation mark at the end of the title was dropped for the Jamelia release.", "\"Stop\" was released as a double A-side with the song \"DJ\" on 1 November 2004. The single peaked at number nine on the UK Singles Chart and became Jamelia's fourth consecutive top-10 entry, spending 12 weeks on the chart. It also became her fourth consecutive top-40 single in Australia, peaking at number 37.", "The formats of \"DJ\" and \"Stop\" received a staggered release. On 1 November 2004, the two-track CD one was released along with the \"DJ\" CD release. Due to time constraints, the \"Stop\" music video (directed by Alex Hemming) could not be added in time to make the 1 November release date and so the CD two was released a week later on 8 November 2004. This was also the first DVD single release from Jamelia. The single release also contained a cover of Wham!'s \"Last Christmas\".", "# \"Stop\" by Jamelia – 3:37"]}, {"page": "2004 MTV Europe Music Awards", "response": ["Award presenters on the night included Jamelia, Alicia Keys, N.E.R.D, Naomi Campbell, Andre 3000, Kid Rock and Kanye West.", "* Jamelia", "* Jamelia", "*Jamelia and N.E.R.D — presented Best R&B"]}, {"page": "Daniel de Bourg", "response": ["Dedicated to dance, de Bourg's early interest in singing was rediscovered after a knee injury caused some time out from his dance career.Ray, Ian. (15 November 2007) Interview: Daniel DeBourg Peterborough Evening Telegraph. Retrieved 4 January 2012. de Bourg turned his hand to songwriting; recorded by songstress Jamelia in 2000, his song \"Money\" reached number 5 on the UK Singles Chart., p.265 Remembering de Bourg's musical talents, he was encouraged by a friend to create several demos of his own singing. These attracted the interest of DreamWorks scout Robbie Robertson. de Bourg was introduced to then in house producers Tim & Bob and subsequently signed to the label and the duo produced his debut album, Tell the World. The high-production album, released in 2002, launched the single \"I Need an Angel\", which hit number 30 on the Billboard Adult Contemporary chart."]}, {"page": "Popjustice", "response": ["Support of Debbie Harry, Rachel Stevens, Kylie Minogue, Sugababes, Sophie Ellis-Bextor, Jamelia, Busted, McFly, The Saturdays and Girls Aloud prompted some to suggest financial links to Universal Music, although this was denied by Robinson who pointed out that Popjustice is run independently. However, accusations of bias towards acts who offer exclusive access persist."]}, {"page": "UK Radio Aid", "response": ["Singers who sang live in the studio include Jamie Cullum, Liam Gallagher, David Gray, Jamelia, Texas, Ronan Keating, Bryan Adams, Il Divo, Melanie C, and Russell Watson. Comedy was provided by Jon Culshaw, Avid Merrion, Ricky Gervais, Matt Lucas and David Walliams."]}, {"page": "V Festival", "response": ["* JJB Puma Arena: Underworld, Leftfield, The Flaming Lips, Death in Vegas, Moloko, Groove Armada, Bentley Rhythm Ace, Kelis, M. J. Cole, Horace Andy, Jamelia, Day One, ManCHILD, LSK, Emilíana Torrini, Hybrid, Dara", "* JJB Puma Arena, Basement Jaxx, Primal Scream, Kelis, Groove Armada, Amy Winehouse, Beverley Knight, The Human League, Audio Bullys, Jamelia, Roni Size, Freestylers, Kristian Leontiou, Aqualung, Josh Ritter, Phoenix, Chicane, Rodrigo y Gabriela, Fried, Backlight, Headway"]}, {"page": "G-Unit Records", "response": ["In early January 2010, 50 Cent claimed that he was looking to sign new comedians and authors to the label, venturing outside the realm of recording artists. Atlanta Young Jack Thriller would be the first comedian signed to the label, releasing a weekly \"So Disrespectful,\" YouTube podcast. also becoming a regular guest on Shade45's G-Unit Radio, and co-host of the program. 50 Cent also expressed interest in signing European R&B singer Jamelia to G-Unit Records, citing that it could not only help her build a reputation in the U.S., but it would also be the first signing of a female artist to the label since singer, Olivia. Also in early 2010, in reference to his recent affiliation with 50 Cent and G-Unit Records, Beanie Sigel stated that he would not be signing with the label, as he and 50 Cent mutually \"used\" each other, though no harm to their business relationship was made. Meanwhile, Young Buck responded to various songs released on 50 Cent's Before I Self Destruct. He released five records aimed at 50 Cent, Tony Yayo, Lloyd Banks, G-Unit, and 40 Glocc."]}, {"page": "Sophie Muller", "response": ["* Jamelia – \"Boy Next Door\""]}, {"page": "Danielle Brisebois", "response": ["* Jamelia"]}, {"page": "The Wright Stuff", "response": ["* Jamelia (2011–2012, 2017–18)"]}]}}