{"wiki_id": "http://www.wikidata.org/entity/Q2345785", "itemLabel": "Tina Barrett", "itemDescription": "English singer, songwriter and actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Tina_Barrett", "wikipedia_page": {"main": "Tina Ann Barrett (born 16 September 1976) is an English singer, songwriter and actress. Her major breakthrough came in 1999 when she became a member of the pop group, S Club 7. She has been a member of spin-off group S Club 3 since 2014. She is also a former member of the girl group Mis-Teeq, though she never appeared on any of their recordings.", "link_mentions": [{"page": "September 16", "response": ["*  1976   – Tina Barrett, English singer-songwriter, dancer, and actress "]}, {"page": "1976", "response": ["* September 16 – Tina Barrett, English singer (S Club 7)"]}, {"page": "S Club 7", "response": ["S Club 7 were a British pop group from London, created by former Spice Girls manager Simon Fuller and consisting of members Bradley McIntosh, Hannah Spearritt, Jo O'Meara, Jon Lee, Paul Cattermole, Rachel Stevens and Tina Barrett. The group was formed in 1998 and quickly rose to fame by starring in their own BBC television series, Miami 7. In their five years together, S Club 7 had four UK number-one singles, one UK number-one album, and a string of hits throughout Europe as well as a Top 10 hit on the US Hot 100, with their 2000 single \"Never Had a Dream Come True\". They recorded four studio albums, released 11 singles and went on to sell over 10 million albums worldwide.", "Simon Fuller has commented that he came upon the concept of S Club 7 the day after he was fired by the Spice Girls in November 1997, with the new group meant as a \"continuation\" of the latter. He selected the members for the group after auditioning from over 10,000 hopefuls; Rachel Stevens was the only member of the group who did not audition to gain admittance into the group. Instead, two producers from 19 Management approached her and asked her to go into the studio to record a demo tape for Fuller. Both Jo O'Meara and Paul Cattermole were spotted by producers from 19 and asked to audition. After the auditions had been advertised in The Stage, Jon Lee, Hannah Spearritt, Tina Barrett and Bradley McIntosh auditioned. After some final adjustments, including the removal of three original members, S Club 7 was formed."]}, {"page": "1976 in music", "response": ["**Tina Barrett, British singer-songwriter, actor, and dancer (S Club 7)"]}, {"page": "Longwood University", "response": ["The program has produced a number of professional athletes, most notably Jerome Kersey (NBA), Michael Tucker (MLB), and Tina Barrett (LPGA), all of whom were part of the school's inaugural Athletics Hall of Fame Class in 2006. Alumnus Mark Montgomery is also currently a relief pitcher in the New York Yankees organization."]}, {"page": "Mis-Teeq", "response": ["Alesha Dixon and Sabrina Washington met in 1997 at Dance Attic studios in Fulham through Louise Porter, who was putting together a group for her production company Big Out Ltd. The two worked with Louise Porter for a couple of years before being joined by Tina Barrett to form a trio performing singing and dancing. They were named Face2Face, were unsigned, and all band members still worked day jobs. Barrett left to join S Club 7 after a successful audition for Simon Fuller and was replaced by Zena McNally and Su-Elise Nash. Their then producer David Brant (writer of their first two hit singles, \"Why?\" and \"All I Want\") introduced them via DJ Darren Stokes (TinTinOut) to Inferno Records (sub pop) A&R man Pat Travers, who went on to sign them to Telstar Records and changed their name to Mis-Teeq. After months of recording—including sessions with producers Norwegian duo Stargate along with Brant (Vybrant Music), Ed Case, Blacksmith, Rishi Rich, and Ceri Evans—Mis-Teeq released their debut single in 2001, \"Why?\", a Latin-flavoured mid-tempo song co-written and produced by Brant. A garage remix by Matt \"Jam\" Lamont soon became a success in the underground UK garage scene, and as a result a second music video for the song was filmed and released. \"Why\" became a hit on the UK Singles Chart with a peak position of number eight. McNally decided to leave the line-up in January 2001 saying she felt unhappy about \"an unbalance in the group\"."]}, {"page": "Paul Cattermole", "response": ["Cattermole became a member of S Club 7 after a series of auditions, along with members Tina Barrett, Jon Lee, Bradley McIntosh, Jo O'Meara, Hannah Spearritt and Rachel Stevens in 1999. During five years they released four number one singles and one number one album. They also had a series of TV shows, which were: Miami 7, L.A. 7, Hollywood 7 and Viva S Club. The group rose to fame by starring in their own BBC television series, Miami 7, in 1999. Over the five years they were together, S Club 7 had four UK No.1 singles, one UK No.1 album, a string of hits throughout Europe, including a top-ten single in the United States, Asia, Latin America and Africa."]}, {"page": "Boyfriends & Birthdays", "response": ["* Tina Barrett"]}, {"page": "Jo O'Meara", "response": ["Following the S Club reunion Jo continued to tour with Tina Barrett and Bradley McIntosh performing as S Club 3. In 2017, the trio released a single titled \"Family\" for charity but failed to chart in the UK. "]}, {"page": "Bradley McIntosh", "response": ["After the full group reunion, McIntosh, O'Meara and Tina Barrett – replacing Cattermole – continued as S Club 3."]}, {"page": "Bring It All Back", "response": ["\"Bring It All Back\" is notable for being the only S Club 7 single on which all four female members share lead vocals. The first verse is shared by Jo O'Meara and Rachel Stevens, while the second verse is split between Tina Barrett and Hannah Spearritt. Bradley McIntosh, Jon Lee and Paul Cattermole provide backing vocals and additional vocals on the final chorus. The single contains an extended version of the track with an additional refrain and chorus, as well as a club remix by K-Klass, which appears on all international versions of the single."]}, {"page": "The Clapping Song", "response": ["* Russell Grant released it in 2012 in the UK as a Christmas single along with six backing singers/dancers, including S Club 7's Tina Barrett, Chloe Rich, Miriam Breckner and Rhiannon Drake"]}, {"page": "Seeing Double (2003 film)", "response": ["*Tina Barrett as Tina"]}, {"page": "British African-Caribbean people", "response": ["With multiple UK number-one achievements between 1999 and 2001, S Club 7 had two members of African-Caribbean heritage. Bradley McIntosh was born to Afro-Jamaican parents, who had been members of funk group The Cool Notes, and Tina Barrett, who has Afro-Guyanese and English ancestry."]}, {"page": "Alive (S Club song)", "response": ["\"Alive\" is a song by S Club, released as a single on 18 November 2002. Called a \"power-packed dancefloor thriller\" in the Best inlay booklet, the track features strong disco beats and samples. \"Alive\" was the first single to be released under the S Club name rather than S Club 7, and it was also the first single to be released without Paul Cattermole. \"Alive\" was the penultimate S Club single and apart from the double A-side \"Say Goodbye\"/\"Love Ain't Gonna Wait for You\", was the only track to be released from the fourth album, Seeing Double. It reached #5 in the UK Singles Chart. The B-side, \"Discotek\" was led and co-written by Tina Barrett. The song also served as the main theme for Viva S Club, the band's final TV series."]}, {"page": "1976 in the United Kingdom", "response": ["* 16 September – Tina Barrett, singer (S Club 7)"]}, {"page": "Miami 7", "response": ["* Tina Barrett as Tina"]}, {"page": "Viva S Club", "response": ["* Tina Barrett as Tina"]}, {"page": "L.A. 7", "response": ["* Tina Barrett as Tina"]}, {"page": "Hollywood 7", "response": ["* Tina Barrett as Tina"]}, {"page": "The Girls of FHM", "response": ["The video featured Naomi Campbell, Lisa Scott-Lee from Steps, Myleene Klass from Hear'Say, Jessica Taylor, Kelli Young and Michelle Heaton from Liberty X, Liz McClarnon from Atomic Kitten, Hannah Spearritt and Tina Barrett from S Club 7, Jakki Degg, Jodie Marsh and Michelle Marsh joined them, along with Big Brother 's Nush, Lady Isabella Hervey and Sophie Anderton. Nikki Sanderson and Samia Ghadie from Coronation Street were included; FHM 's 'High Street Honeys' also put in an appearance."]}, {"page": "Tina (given name)", "response": ["*Tina Barrett (born 1976), British singer from S Club 7"]}, {"page": "S Club 7 Go Wild!", "response": ["Jo O'Meara travelled to Thailand in search of the Asian elephant, accompanied by Jon Lee and Tina Barrett.", "Tina Barrett travelled to China in search of the giant panda with Jo O'Meara and Jon Lee.", "Jon Lee, Tina Barrett, and Jo O'Meara traveled to Malaysia in search of the orangutan."]}]}}