{"wiki_id": "http://www.wikidata.org/entity/Q23468384", "itemLabel": "Harry Coulby", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Coulby", "wikipedia_page": {"main": "Harry Coulby (January 1, 1865 – January 18, 1929) was a British American businessman known as the \"Czar of the Great Lakes\" for his expertise in managing the Great Lakes shipping fleet of Pickands Mather & Company. and the Pittsburgh Steamship Company. After retiring, he served as the first mayor of the newly incorporated town of Wickliffe, Ohio. His former home, Coulallenby, now serves as the city hall of Wickliffe. He chose the design for Great Lakes ore carriers in 1905 that became the standard for the next 65 years, and was elected to the National Maritime Hall of Fame in 1984.", "link_mentions": [{"page": "Wickliffe, Ohio", "response": ["The Coulby Mansion and Park were built between 1911-1915Wickliffe Continues Restoration . . by Harry Coulby, a shipping magnate who served as Wickliffe's first mayor. It cost over $1 million at the time.Wickliffe History - Coulby Mansion This mansion is on the National Register of Historic Places.Harry Coulby Mansion - posted to the National Register of Historic Places (24 August 1979)"]}, {"page": "Claypole, Lincolnshire", "response": ["Claypole primary school is on School Lane.Claypole Primary School, claypoleprimary.org Next to the school is a cricket and football field, home to local teams. In the early 1900s public benefactor Harry Coulby gifted the village school and village hall,Claypole Village Hall, claypolevillagehall.org and built an American-style house."]}, {"page": "Pickands Mather Group", "response": ["In the 1880s and 1890s, Pickands Mather rapidly added to their iron mine holdings, and expanded into coal mining, iron ore and coal shipping, dock ownership, and the manufacture of coke and iron and steel rolling mills. In April 1886, Mather hired local stenographer Harry Coulby, who swiftly worked his way up in the corporate ranks to become head of the company's Marine Department. After some years leasing and managing the freighters of other companies, in 1894 Pickands Mather formed the Interlake Company (later the Interlake Steamship Company). By 1912, Interlake had grown to be the second-largest shipping fleet on the Great Lakes, with 37 freighters. The Interlake fleet expanded to 52 ships in 1916."]}, {"page": "Historic country estates in Lake County, Ohio", "response": ["        \"title\": \"thumb|Coulallenby-Harry Coulby Manison\","]}]}}