{"wiki_id": "http://www.wikidata.org/entity/Q23461809", "itemLabel": "Alf Miller", "itemDescription": "association football player (1917-1999)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alf_Miller", "wikipedia_page": {"main": "Alfred George Abraham Miller (25 March 1917 – 2 August 1999), also known as Dusty Miller, was an English professional footballer and coach who played as a wing half in the Football League for Southport and Plymouth Argyle.\nMiller began his career with his hometown club Portsmouth but never appeared for the first-team. He ventured into non-League football before being handed another opportunity in the Football League by Bristol Rovers. Again, he failed to break into the first-team, but a move to Southport saw him make his professional debut in 1937. Two years with Southport amounted to 32 appearances and a move to Plymouth Argyle, but World War II broke out before Miller could make any appearances for the club.\nMiller spent the war years making guest appearances for Aldershot, and finally made his debut for Plymouth in 1946. After injury interrupted his return, he made a move to Colchester United in 1948, where he played just twice before becoming a member of the club's coaching staff. He was briefly caretaker manager with Claude Orrin in early 1955.", "link_mentions": [{"page": "Len Boyd", "response": ["He made his debut on 12 October 1946, taking over at centre-half from Alf Miller for a Second Division match away at Leicester City which Plymouth lost 4–1. In his first season, Boyd played 16 league matches, mainly in the inside left position, and scored four of his five Plymouth goals. He played regularly on the right side of the forward line in the following season, but failed to score, and was regarded as \"a promising but not exceptional inside-forward\". When manager Jack Tresadern switched him to right half for the 1948–49 season, it became clear he was better suited to that position. After three consecutive seasons helping the Devon club avoid relegation from the Second Division, Boyd was sold to First Division club Birmingham City in January 1949 for a fee of £17,500, the first five-figure fee ever received by Plymouth for a player."]}, {"page": "Alfred Miller", "response": ["*Alf Miller (1917–1999), English footballer, mostly played for Southport and Plymouth Argyle "]}, {"page": "1954–55 Colchester United F.C. season", "response": ["During this transitional period, Orrin and Alf Miller took charge of the first-team, before appointing Benny Fenton as manager after attracting 48 applications for the vacancy. Despite a brief boost in on-field fortunes in March and early April, performances tailed off as Colchester picked up just one point in the final eight games of the campaign. The club finished bottom of the Football League and were again required to seek re-election, in which they were successful."]}, {"page": "1949–50 Colchester United F.C. season", "response": ["|Alf Miller"]}, {"page": "1948–49 Colchester United F.C. season", "response": ["|Alf Miller||WH||||Portsmouth||||0||0|| Plymouth Argyle||August 1948||Free transfer", "|Alf Miller", "|Alf Miller"]}, {"page": "List of Colchester United F.C. players (1–24 appearances)", "response": ["Over 400 players made between one and 25 appearances in all competitions during their Colchester United careers. Three players finished their time with the club on exactly 24 appearances, including Warren Aspinall, Elliott Hewitt, Garry Richards and Medy Elito Four of the players featured on this list would either go on to manage the club or were player-manager. These include Alf Miller, Jim Smith, Bobby Roberts and George Burley."]}]}}