{"wiki_id": "http://www.wikidata.org/entity/Q2359041", "itemLabel": "Brett Fraser", "itemDescription": "All-American college swimmer, Cayman Island international swimmer, Olympian", "wikipedia_url": "https://en.wikipedia.org/wiki/Brett_Fraser", "wikipedia_page": {"main": "Brett Michael Fraser (born August 28, 1989) is a competition swimmer and Pan American Games gold medalist from the Cayman Islands.  At the 2008 Summer Olympics, Fraser and his older brother, Shaune Fraser, were two of the three flag-bearers for the Cayman Islands.  He competed in the 200 m backstroke.At the 2012 Summer Olympics, he was flagbearer for the Cayman Islands at the opening ceremony.  He competed in the 50 m, 100 m and 200 m freestyle events. He was a semi-finalist in the 100m and 200m freestyle, placing 14th and 12th overall, respectively.At the 2014 Commonwealth Games, he competed in the 50 m butterfly and the 50 m freestyle.Like his older brother, Fraser accepted an athletic scholarship to attend the University of Florida in Gainesville, Florida, United States, where he swam for coach Gregg Troy's Florida Gators swimming and diving team in National Collegiate Athletic Association (NCAA) and Southeastern Conference (SEC) competition from 2008 to 2011.At the 2011 Pan American Games in Guadalajara, Mexico, Fraser won the gold medal in the men's 200-meter freestyle with a time of 1:47.18.", "link_mentions": [{"page": "2011 Pan American Games", "response": ["Following PASO tradition, Jalisco governor Emilio González Márquez and then Guadalajara mayor Alfonso Petersen Farah received the Pan American Sports Organization flag during the closing ceremony of the 2007 Pan American Games in Rio de Janeiro, Brazil. The event was officially opened by the President of Mexico Felipe Calderón. Brett Fraser, a swimmer from the Cayman Islands, won the first Pan American Games gold medal for his country, while  Saint Kitts and Nevis won its first ever Pan American Games medal of any kind."]}, {"page": "List of Pan American Games medalists in swimming", "response": ["| Brett Fraser || 1:47.18"]}, {"page": "List of University of Florida Olympians", "response": ["* Brett Fraser, Cayman Islands team member at 2008 Beijing Olympics and 2012 London Olympics"]}, {"page": "Cayman Islands at the 2008 Summer Olympics", "response": ["The Cayman Islands sent a delegation to compete at the 2008 Summer Olympics in Beijing, China. The delegation included fifteen people; of the delegation, four athletes participated under the Caymanian flag. In the track and field events was Ronald Forbes, who also served as the Cayman Islands' flag-bearer during the Opening Ceremony and reached quarterfinals in the 110m hurdles, and Cydonie Mothersille, who reached finals and ranked eighth in the 200m dash. Brothers Shaune and Brett Fraser, both swimmers, participated in the 100 and 200m freestyle and in the 200m backstroke, respectively. The Cayman Islands' appearance at the Beijing Olympics marked its ninth appearance since its debut at the 1976 Summer Olympics in Montreal. The Cayman Islands, up to and including Beijing, have yet to medal.", "The Cayman Islands Olympic Committee financed the participation of Brett Fraser in swim meets to prepare for the Beijing Olympics. Runner Cydonie Mothersill and swimmer Shaune Fraser were recipients of the Beijing Olympic Scholarship, which  was awarded by the International Olympic Committee and paid for their training expenses. The Caymanian Olympic delegation received donations from the Cayman Islands Post Office, Atlantic Star, Ltd, and its director, Fahad Al Rashid, in addition to sponsorships that the athletes garnered. In addition to the athletes, the delegation to Beijing included eleven people. Among the rest of the delegation was CIOC president Donald McLean, athletics coach Kendrick Williams, swimming coaches Dominic Ross and Mark Block, and past president Jerris Miller.", "Then-University of Florida student Brett Fraser was the youngest participant in the Caymanian delegation during the Beijing Olympics, at age 18. He swam for the Cayman Islands alongside his brother, Shaune Fraser, although Brett Fraser specifically qualified for the Men's 200 meter backstroke event. Brett Fraser's participation in the Beijing Olympics marked the first time he participated in any Olympic games. During the Olympics themselves, Fraser was placed in Heat 1 during the 13 August preliminary round, where he challenged two other athletes: Oleg Rabota of Kazakhstan, and  Sergey Pankov of Uzbekistan. Fraser completed his event with a time of 2:01.17, placing him 0.78 seconds ahead of second-place heat finalist Rabota, and almost two seconds ahead of third-place heat finalist Pankov. Fraser lead his heat, but ranked 29th place out of 42 athletes overall, falling approximately five seconds behind round leader Ryan Lochte of the United States, who later medaled gold in the event. Brett Fraser did not progress to the next round.", "Former University of Florida student Shaune Fraser, elder brother of Brett Fraser, also participated in swimming events at Beijing. The Olympic games in Beijing marked the second appearance by Shaune Fraser, who appeared before in the 2004 Summer Olympics in Athens when he was 16 years old. Fraser qualified for three events in Beijing: the 100 meters freestyle, the 200 meters freestyle, and the 100 meters butterfly. He previously participated in the 200 meters freestyle in Athens. In the 200 meters freestyle, Fraser participated in Heat 5 during the 10 August preliminaries. Other swimmers in his heat were Israel's Nimrod Shapira Bar-Or and South Africa's Darian Townsend, who respectively ranked first and second in the heat, while Fraser ranked fifth out of eight athletes with a time of 1:48.60. Fraser ranked behind Japan's Sho Uchida by 0.26 seconds, and ahead of Greece's Andreas Zisimos by 0.22 seconds. Overall, Fraser ranked 26th out of 58 athletes. He did not progress to the semifinals in the event. In the 100 meters freestyle, Fraser participated in Heat 5 during the 12 August preliminary rounds. He swam against athletes including the Czech Republic's Martin Verner and Hungary's Balazs Makany, and completed the event in 49.56 seconds. Fraser placed fourth out of eight athletes, placing between Uruguay's Martin Kutscher (5th place, 50.08 seconds) and Balazs and Lithuania's Paulius Viktoravicius (tied for 2nd place, 49.27 seconds). Overall, Fraser tied Yuriy Yegoshin for 36th place out of 64 athletes. He did not advance to semifinals. Lastly, in the 100 meters butterfly, Shaune Fraser participated in Heat 2 of the 14 August preliminary rounds. He competed against, among others, Malaysia's Daniel Bego and Suriname's Gordon Touw Ngie Tjouw. Fraser ranked first in the heat out of seven athletes with a time of 54.08 seconds. Bego, the second-place heat finalist, was 0.3 seconds behind him. Overall, Fraser ranked 51st out of 66 athletes, and did not progress to the semifinal round.", "|align=left|Brett Fraser"]}, {"page": "Swimming at the 2008 Summer Olympics – Men's 200 metre backstroke", "response": ["| 29|| 1 || 4||align=left| Brett Fraser ||align=left|  || 2:01.17 ||"]}, {"page": "Swimming at the 2006 Central American and Caribbean Games – Men's 50 metre freestyle", "response": ["| 28 ||align=left| Brett Fraser ||align=left|  || 26.08 ||"]}, {"page": "Swimming at the 2006 Central American and Caribbean Games – Men's 100 metre freestyle", "response": ["| 21 ||align=left| Brett Fraser ||align=left|  || 56.67 ||"]}, {"page": "Shaune Fraser", "response": ["Fraser's younger brother, Brett Fraser, swam for the Cayman Islands at the 2008 Summer Olympics, and also swam for the University of Florida, where he graduated a year behind his brother.GatorZone.com, Men's Swimming & Diving,  Brett Fraser.  Retrieved July 14, 2010."]}, {"page": "Swimming at the 2006 Central American and Caribbean Games – Men's 200 metre freestyle", "response": ["| 17 ||align=left| Brett Fraser ||align=left|  || 2:01.43 || "]}, {"page": "Swimming at the 2006 Central American and Caribbean Games – Men's 50 metre backstroke", "response": ["| 16 ||align=left| Brett Fraser ||align=left|  || 28.66 || "]}, {"page": "Swimming at the 2006 Central American and Caribbean Games – Men's 100 metre backstroke", "response": ["| 12 ||align=left| Brett Fraser ||align=left|  || 1:01.35 || "]}, {"page": "Swimming at the 2006 Central American and Caribbean Games – Men's 200 metre backstroke", "response": ["| 12 ||align=left| Brett Fraser ||align=left|  || 2:14.06 || "]}, {"page": "Swimming at the 2006 Central American and Caribbean Games – Men's 200 metre individual medley", "response": ["| -- ||align=left| Brett Fraser ||align=left|  || DQ || "]}, {"page": "Swimming at the 2006 Central American and Caribbean Games – Men's 400 metre individual medley", "response": ["| 10 ||align=left| Brett Fraser ||align=left|  || 4:51.18 || "]}, {"page": "Swimming at the 2009 World Aquatics Championships – Men's 50 metre freestyle", "response": ["| 45 ||align=left| Brett Fraser ||align=left|  || 22.80 || 13 || 1 ||"]}, {"page": "Swimming at the 2009 World Aquatics Championships – Men's 100 metre freestyle", "response": ["| 19 ||align=left| Brett Fraser ||align=left|   || 48.56 || 10 || 6 ||  "]}, {"page": "Swimming at the 2009 World Aquatics Championships – Men's 200 metre freestyle", "response": ["| 24 ||align=left| Brett Fraser ||align=left|  || 1:48.18 || 7 || 0 ||"]}, {"page": "Swimming at the 2009 World Aquatics Championships – Men's 50 metre backstroke", "response": ["| 83 ||align=left| Brett Fraser ||align=left|   || 28.47 || 6 || 6 ||  "]}, {"page": "Swimming at the 2009 World Aquatics Championships – Men's 100 metre backstroke", "response": ["| —  ||align=left| Brett Fraser ||align=left|   || DNS || 7 || 9 || "]}, {"page": "Swimming at the 2009 World Aquatics Championships – Men's 200 metre backstroke", "response": ["| – ||align=left| Brett Fraser ||align=left|   || DNS || 6 || 5 ||"]}, {"page": "Cayman Islands at the 2010 Central American and Caribbean Games", "response": ["*Brett Fraser,  Swimming (Men's 200 Free)", "*Brett Fraser,  Swimming (Men's 200 Back)", "*Brett Fraser (m)"]}, {"page": "Swimming at the 2010 Central American and Caribbean Games", "response": ["| Brett Fraser     Cayman Islands  || 1:50.33", "| Brett Fraser     Cayman Islands  || 2:02.35"]}, {"page": "Swimming at the 2010 Commonwealth Games – Men's 200 metre freestyle", "response": ["| Brett Fraser"]}, {"page": "Swimming at the 2010 Commonwealth Games – Men's 100 metre freestyle", "response": ["| Brett Fraser", "| Brett Fraser"]}, {"page": "Swimming at the 2010 Commonwealth Games – Men's 50 metre freestyle", "response": ["| 15 || 9 || 7 ||align=left| Brett Fraser ||align=left|  || 23.34 || Q", "| 5 || 1 ||align=left| Brett Fraser ||align=left|  || 23.27 || "]}, {"page": "Cayman Islands at the 2011 Pan American Games", "response": ["|rowspan=\"4\"|Brett Fraser"]}, {"page": "Chronological summary of the 2011 Pan American Games", "response": ["*Brett Fraser wins the Cayman Islands first ever Pan American Games gold medal by setting a new Pan American Games record in the men's 200 meter freestyle event. The United States wins the other four gold medals that were awarded today.", "|Brett Fraser"]}, {"page": "Cayman Islands at the 2012 Summer Olympics", "response": ["Five athletes from the Cayman Islands were selected to the team, participating only in athletics and swimming. Sprinter Kemar Hyman was the only athlete to compete at his first Olympics. Veteran sprinter Cydonie Mothersill, on the other hand, became the only female and the oldest athlete of the team, competing at her fifth Olympics. Swimmer Brett Fraser, and his brother Shaune advanced past the first round in the men's 100 m freestyle for the first time, since its swimming team began competing in 2004. Fraser became the nation's first swimmer to carry the flag at the opening ceremony. Cayman Islands, however, has yet to win its first Olympic medal.", "|align=left rowspan=3|Brett Fraser"]}, {"page": "Swimming at the 2011 World Aquatics Championships – Men's 50 metre freestyle", "response": ["| 25 || 11 || 5 ||align=left| Brett Fraser || align=left| || 22.65 || "]}, {"page": "Swimming at the 2011 World Aquatics Championships – Men's 100 metre freestyle", "response": ["| 17 || 10 || 8 ||align=left| Brett Fraser || align=left| ||  || "]}]}}