{"wiki_id": "http://www.wikidata.org/entity/Q235772", "itemLabel": "Keisha Buchanan", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Keisha_Buchanan", "wikipedia_page": {"main": "Keisha Kerreece Fayeanne Buchanan (; born 30 September 1984) is a British singer and a founding member of the girl group Sugababes alongside Mutya Buena and Siobhán Donaghy. With the Sugababes, she had six number one singles and two number one studio albums, making them one of the most successful British pop acts of the 21st century. Buchanan was asked to leave the group in September 2009 and was replaced by Jade Ewen.\nIn 2012, she and her former Sugababes colleagues Buena and Donaghy confirmed their reunion. The original trio was not able to release music under the name \"Sugababes\" as it was still being used by the then-current members of the group. Instead they released music under the name Mutya Keisha Siobhan before securing the legal rights to the Sugababes name in 2019.\n\n", "link_mentions": [{"page": "1984", "response": ["* September 30 – Keisha Buchanan, British singer"]}, {"page": "Kingsbury, London", "response": ["*Mutya Buena and Keisha Buchanan, singer/songwriters, Sugababes, born and raised in Kingsbury."]}, {"page": "1984 in music", "response": ["*September 26 – Keisha Buchanan, English singer-songwriter (Sugababes)"]}, {"page": "List of singer-songwriters", "response": ["* Keisha Buchanan"]}, {"page": "Jamelia", "response": ["In an interview with entertainment website Digital Spy in December 2009, Jamelia commented on being a rumoured replacement for Keisha Buchanan, in the girl-group Sugababes and spoke about work with her ongoing album, which was going \"absolutely amazing\". She stated that she was working with producers who have previously worked with Lady Gaga and Beyoncé, and that the album returned her sound to 2004's Thank You. She also vowed to come back with a \"really exciting\" album. On 26 July 2010, Jamelia signed a record deal with an unknown label live on video streaming website Ustream.tv. Ultimately, nothing was released"]}, {"page": "Sugababes", "response": ["Sugababes are a British girl group composed of Keisha Buchanan, Mutya Buena and Siobhán Donaghy. The lineup changed several times before returning to the original lineup in 2019.", "Sugababes were formed in 1998 by All Saints manager Ron Tom and Sarah Stennett, and First Access Entertainment. Siobhán Donaghy and Mutya Buena, both aged just 13, had been signed as solo artists, but decided to work together after performing at the same showcase. While working in the studio, Buena invited her best friend Keisha Buchanan to watch them. Manager Ron Tom decided the three girls were to be a trio, likening their different appearances to the United Colors of Benetton campaign. Originally dubbed the Sugababies, the group's name was tweaked to Sugababes when they were signed by London Records to give the group a more mature image.", "===2009–2010: Keisha Buchanan's departure and Sweet 7===", "Critics and fans reacted very negatively to the news, and British broadsheet The Guardian ran an article named \"Why the Sugababes' show can't go on without Keisha\".Robinson, Peter, 22 September 2009). \"Why the Sugababes' show can't go on without Keisha\" , The Guardian Digital Spy ran an article called \"Keisha Buchanan, We Salute You\" in which they thanked her for her contribution to \"incredible pop songs\".Levine, Nick, \"Keisha Buchanan, we salute you \". Digital Spy, 21 September 2009 According to Berrabah and Range, both women had wanted to quit the Sugababes themselves only to find that their group's management decided that they would follow them, rather than find two new members for Buchanan. In September 2020, Buchanan stated that she did not know that she was ousted from the group until after the public announcement of her departure had already been made."]}, {"page": "Three (Sugababes album)", "response": ["Three is the third studio album by British girl group Sugababes, released by Island Records on 27 October 2003. It generated four singles that charted in various parts of the world; the first, \"Hole in the Head\", became the group's third UK number one single. The three members of the Sugababes each recorded a \"solo\" song on the album—\"Whatever Makes You Happy\" (Keisha Buchanan), \"Sometimes\" (Heidi Range) and \"Maya\" (Mutya Buena). Three debuted at number three on the UK Albums Chart."]}, {"page": "Stripped (Christina Aguilera album)", "response": ["* \"Make Over\" interpolates \"Overload\", as performed by the Sugababes. Later pressings of the album contain songwriting credits for Keisha Buchanan, Mutya Buena, Siobhán Donaghy, Felix Howard, Cameron McVey, Paul Simm and Jonathan Lipsey; these credits were absent on initial pressings of the album."]}, {"page": "Amy Winehouse", "response": ["Winehouse's record label, Universal Republic, released a statement that read in part: \"We are deeply saddened at the sudden loss of such a gifted musician, artist and performer.\" Many musical artists have since paid tribute to Winehouse including U2, M.I.A., Lady Gaga, Marianne Faithfull, Bruno Mars, Nicki Minaj, Keisha Buchanan, Rihanna, George Michael, Adele, Kelly Clarkson, Courtney Love, and the punk rock band Green Day, who wrote a song in her tribute titled \"Amy\". In her 2012 album Banga, singer Patti Smith released \"This Is the Girl\", written as an homage to Winehouse. Mark Ronson dedicated his UK number-one album Uptown Special to Winehouse, stating: \"I'm always thinking of you and inspired by you.\" Winehouse did not leave a will; her estate was inherited by her parents. Winehouse's parents set up the Amy Winehouse Foundation to prevent harm from drug misuse among young people; her brother Alex is an employee."]}, {"page": "2002 in British music", "response": ["UK girl group Sugababes (who were now under their second line-up of original members Keisha Buchanan, Mutya Buena and former Atomic Kitten member Heidi Range, who replaced Siobhán Donaghy after her departure the previous year) scored their first UK number one with \"Freak like Me\". Ronan Keating also returned to the top of the singles chart with a cover of \"If Tomorrow Never Comes\". Liberty X, consisting of the five losers who just failed to make Hear'Say in the talent show Popstars, reached No. 1 with Just a Little, eventually becoming more successful than Hear'Say, who disbanded in October. S Club Juniors, an 8-piece pre-teen spin off from S Club 7 (who saw the departure of band member Paul Cattermole earlier that year) reached No 2 with their debut single One Step Closer."]}, {"page": "Siobhán Donaghy", "response": ["The group was created when Donaghy and Mutya Buena hooked up with Buena's best friend Keisha Buchanan while working together in a studio. Manager Ron Tom decided they were to be a trio and came up with the name \"the Sugababies\". Within a year they were offered a record contract by London Records and started calling themselves the Sugababes.", "According to Donaghy, she left the group because she never got along with Keisha Buchanan, whom she described as a bully. Donaghy became depressed (eventually being diagnosed with clinical depression) and could no longer be a part of the Sugababes. In an interview with thelondonpaper, Donaghy said: \"It's difficult to leave a band and then make sort of a solo career. I left for a very good reason and I've never for a second wanted to go back there.\" Despite this, Donaghy maintained contact with Buena, saying she was always pleased to see her.", "In February 2019, Mutya Buena confirmed that a leak of the demos resulted in the album being postponed. Donaghy has a writing credit on the Bananarama song \"Love in Stereo\" along with Keisha Buchanan, a song that was originally written for MKS's album. In August 2019, Donaghy, Buena and Buchanan reunited for a cover of Sweet Female Attitude's \"Flowers\", produced by DJ Spoony, as part of his album Garage Classical. The trio is credited as Sugababes, making it the first time since 2001 that Donaghy performs under the name."]}, {"page": "Cuffley", "response": ["Its most notable current resident is Sir Terry Leahy, former CEO of Tesco, although this did not prevent locals from objecting vehemently to plans to build a  \"Express\" store in the village replacing one of only two remaining village pubs.Daily Telegraph on-line 23 July 2007 Other famous residents include Premier League footballers Ledley King, Jermain Defoe, Niko Kranjcar, David Bentley, Kyle Walker and Armand Traoré; and also former Sugababes singer Keisha Buchanan and Myleene Klass."]}, {"page": "Heidi Range", "response": ["In December 2005, founding member Mutya Buena departed the Sugababes and was replaced by Amelle Berrabah. The third single from Taller in More Ways was a re-recorded version of \"Red Dress\", which was released in early 2006, and gave the Sugababes their third consecutive top five hit from the album, entering the UK Singles Chart at number 4. Berrabah re-recorded three of the album's twelve tracks and co-wrote a new song with Keisha Buchanan and Range named \"Now You're Gone\". The tracks appeared on a re-release of Taller in More Ways that reached number 18 on the UK Albums Chart. The fourth and final single from Taller in More Ways was \"Follow Me Home\", released only in the UK in June, where it charted at number 32."]}, {"page": "Ne-Yo", "response": ["Aside from working on his own album, Ne-Yo also collaborates with several other artists. His works include: Rihanna's top-ten singles \"Unfaithful\", \"Russian Roulette\", and her number-one hit \"Take a Bow\", Mario Vazquez's \"Gallery\", Paula DeAnda's \"Walk Away (Remember Me)\", and Beyoncé Knowles' Billboard Hot 100 number-one single \"Irreplaceable\", which stayed at the top of the chart for ten consecutive weeks. He wrote the song \"I'm You\" for Leona Lewis's debut album Spirit, and is currently writing songs for her next album and for the debut album of fellow X Factor winner Alexandra Burke. He has also been working with Sugababes for their seventh album, with member Keisha Buchanan confirming that Ne-Yo had written a song called \"No More You\" for their album."]}, {"page": "Simon Webbe", "response": ["Webbe has a daughter, Alanah (born 1996), with ex-girlfriend Nicola Jones, a shop assistant from Solihull. She is the inspiration for his 2007 single \"Grace\". He is reportedly a cousin of the former Sugababes singer, Keisha Buchanan.Simon Webbe: I'm A Celebrity Top 10 facts. Mirror.co.uk (11 November 2008). Retrieved 22 March 2013. His brother Duane Bryan was a contestant on the 2012 series of The Apprentice. He is related to Labour Party politician Claudia Webbe."]}, {"page": "Taller in More Ways", "response": ["\"Gotta Be You\" is a crunk&B song. Ben Hogwood of musicOMH described it as an \"electric piece of club R&B\". According to group member Keisha Buchanan, the Sugababes are the first British band to incorporate the American sound in their music. Kitty Empire of The Observer called it \"brooding R&B\" and noted its reminiscence of \"Try Again\" by American R&B singer, Aaliyah. Similarly, K. Ross Hoffman of AllMusic wrote that \"Gotta Be You\" \"treads melodically close to the song\", in which he described the latter as \"majestic\". Another critic, Nick Southall from Stylus Magazine, wrote that it is \"disarmingly close\" to \"Try Again\"."]}, {"page": "Crazy Titch", "response": ["He gained underground fame due to his membership of grime collective Boyz In Da Hood, which included various artists including half-brother Durrty Goodz. Amongst his better known work was \"Sing Along\" (2004) and \"Gully\" on which he collaborated with Sugababes' Keisha Buchanan. He also produced a mixtape entitled Crazy Times Vol.1, and appeared on the grime DVD Practice Hours. In 2006 he made an appearance as himself along with many other MCs on the Channel 4 show Dubplate Drama. Crazy Titch had a reputation for violence during his time in the grime scene, notorious footage exists of a heated argument between Crazy Titch and Dizzee Rascal and of Crazy Titch allegedly kidnapping a rival and dumping them naked in the countryside."]}, {"page": "Vacuum (band)", "response": ["Vacuum is the name of a Swedish pop band. The members are Mattias Lindblom and Anders Wollbeck. They also work as song writers and producers under the same name. As songwriters and producers Wollbeck and Lindblom have worked with artists such as Tarja Turunen, Tina Arena, Garou, Monrose, TVXQ, Keisha Buchanan, f(x) and The Canadian Tenors. Wollbeck and Lindblom are signed to Universal Music Publishing world wide."]}, {"page": "Push the Button (Sugababes song)", "response": ["\"Push the Button\" is a song by English girl group the Sugababes, released as the lead single from their fourth studio album Taller in More Ways (2005). Composed by Dallas Austin and the Sugababes, it was inspired by an infatuation that group member Keisha Buchanan developed with another artist. Musically, \"Push the Button\" is an electropop and R&B song with various computer effects.", "\"Push the Button\" was conceptualised after group member Keisha Buchanan developed an infatuation with another artist who was collaborating with Austin. Buchanan told Jess Cartner-Morley of The Guardian that she made advances towards the man, but he was unaware of her intentions: \"I really liked this guy, so I'd be like, there's this good movie coming out, you know, dropping hints. And he'd be like, that movie sounds great, let me know what it's like if you go see it. I knew he liked me too but he just wasn't getting what I was trying to say.\" Austin advised Buchanan to tell the man to \"push that button\" or she would eventually move on.  In a video on her songwriting experiences posted onto her YouTube channel in July 2020, Buchanan said that Austin teased her relentlessly about her crush after an outing by rapping and playing the keyboard; she then returned his bantering and the song instantly developed from there. She also said that Austin encouraged her to imagine she was speaking directly to her crush for the spoken word middle-8 section, and she improvised her speech from there.", "*Songwriting – Dallas Austin, Mutya Buena, Keisha Buchanan, Heidi Range", "Category:Songs written by Keisha Buchanan"]}, {"page": "Ugly (Sugababes song)", "response": ["During an interview with Jess Cartner-Morley of The Guardian, the Sugababes revealed that Austin wrote the song after reading \"the cuttings file he was sent about the band\". Keisha Buchanan, one of the group's members, elaborated upon this: \"All the rubbish and nasty stuff that's been written about us, calling us the Sugalumps, that sort of thing.\" The title of the song's parent album, Taller in More Ways, was inspired by a line in \"Ugly\", which reads: \"I grew taller than them in more ways / But there'll always be one who will say / Something bad to make them feel great\"."]}, {"page": "Caught in a Moment", "response": ["In 2003, the Sugababes began to work on songs for their third studio album Three (2003). They wrote and recorded material in various countries around the world as they performed at festivals such as the Liverpool Summer Pops.   \"Caught in a Moment\" was written by the Sugababes—consisting of Keisha Buchanan, Mutya Buena and Heidi Range—in collaboration with Karen Poole, Marius De Vries and its producer, Jony Rockstar. Pete Craigie recorded the group's vocals while Tom Elmhirst mixed the song; both musicians engineered it. \"Caught in a Moment\" is the album's fourth and final single, and was released as a CD single in the United Kingdom on 23 August 2004. It appears on the soundtrack to the 2004 film Wimbledon, and is included on the group's 2006 greatest hits album Overloaded: The Singles Collection.", "*Songwriting – Jony Rockstar, Karen Poole, Marius De Vries, Keisha Buchanan, Mutya Buena, Heidi Range", "Category:Songs written by Keisha Buchanan"]}, {"page": "In the Middle (Sugababes song)", "response": ["The Sugababes wrote \"In the Middle\" in collaboration with Miranda Cooper, Brian Higgins, Niara Scarlett, Shawn Lee, Lisa Cowling, André Tegeler, Phil Fuldner and Michael Bellina, for their third studio album, Three (2003). Group member Heidi Range revealed that the band wanted to write a song with which they could have fun; it was inspired by different situations experienced during a night out. Keisha Buchanan, another member of the Sugababes, told Digital Spy that she wrote 90% of the song but could not comprehend the meaning of the lyrics: \"I think it's because as I've got older I don't really relate to the lyrics. It was more of a fun song but I just don't really feel that attached to it any more.\" Higgins, Xenomania and Jeremy Wheatley produced the song; the latter mixed it at the Town House Studios, London. \"In the Middle\" was programmed by Matt Duguid, Nick Coler, Tim Powell and Tim Larcombe.", "* Songwriting – Miranda Cooper, Brian Higgins, Niara Scarlett, Shawn Lee, Lisa Cowling, Keisha Buchanan, Mutya Buena, Heidi Range, Andre Tegler, Phil Fuldner, Michael Bellina", "Category:Songs written by Keisha Buchanan"]}, {"page": "Too Lost in You", "response": ["* Vocals – Keisha Buchanan, Mutya Buena, Heidi Range"]}, {"page": "Hole in the Head", "response": ["\"Hole in the Head\" is a song performed by British girl group Sugababes, released on 13 October 2003 as the lead single from their third studio album, Three. It was written by Brian Higgins, Miranda Cooper, Tim Powell, Nick Coler, Niara Scarlett, Keisha Buchanan, Mutya Buena, and Heidi Range, and co-produced by Higgins and Jeremy Wheatley. The song was met with acclaim from critics and was a commercial success, entering at the top of the UK Singles Chart. Outside the United Kingdom, the single peaked within the top ten of the charts in ten other countries. It became their second single to chart in the United States, peaking at number ninety-six on the Billboard Hot 100 and topping the Billboard Hot Dance Club Songs chart. The first Sugababes single to chart in the US was \"Round Round\", which peaked at number seven on the Billboard Hot Dance Club Songs chart.", "\"Hole in the Head\" was written by Brian Higgins, Miranda Cooper, Tim Powell, Nick Coler and Niara Scarlett, in collaboration with the Sugababes' members—Keisha Buchanan, Mutya Buena and Heidi Range, for the group's third studio album, Three. Higgins and Jeremy Wheatley  produced the song in conjunction with the songwriting and production team Xenomania, which was founded by Higgins himself. Wheatley also completed the song's mixing process at the Townhouse Studios in London.", "* Songwriting – Brian Higgins, Miranda Cooper, Tim Powell, Nick Coler, Niara Scarlett, Keisha Buchanan, Mutya Buena, Heidi Range", "* Vocals – Keisha Buchanan, Mutya Buena, Heidi Range", "Category:Songs written by Keisha Buchanan"]}, {"page": "Shape (song)", "response": ["* Vocals – Keisha Buchanan, Mutya Buena, Heidi Range"]}, {"page": "Amelle Berrabah", "response": ["Following Mutya Buena's departure from Sugababes, Berrabah was brought in as a replacement by the group's management. Their manager had seen Boo2 perform at an American showcase a few years prior in 2003 and Berrabah had impressed him. As soon as Buena left, he gave Berrabah a call about the opportunity and got her to record three songs to audition for remaining members Keisha Buchanan and Heidi Range. They liked the demos and Berrabah was then announced as the newest member of the trio. The first single to feature Berrabah's vocals, \"Red Dress\", entered the UK Singles Chart at number four. Taller in More Ways was re-released in early 2006 with re-recorded vocals by Berrabah. Because of the hastiness of the replacement, she could only re-record vocals for three of the tracks on the album. She also contributed the song, \"Now You're Gone\" to the new track listing. They performed the 2007 Comic Relief single with fellow girl band, Girls Aloud, \"Walk This Way\", which went to number one.  On 28 April 2007, Berrabah was arrested over allegations that she had assaulted a girl on the dancefloor in a club. No charges were brought."]}, {"page": "Sugababes discography", "response": ["The discography of the British girl group Sugababes consists of seven studio albums, four compilation album, three extended plays, thirty one singles (two as featured artists), two video albums and eight promotional singles. The Sugababes were formed in 1998 and, at various times, featured three vocalists from Heidi Range, Amelle Berrabah, Jade Ewen, Siobhán Donaghy, Mutya Buena and Keisha Buchanan.", "The group's sixth studio album, Catfights and Spotlights was released in 2008, and charted in the top ten of the UK Albums Chart. Two singles were released from the album, including \"Girls\" and \"No Can Do\", the former peaking at number three on the UK Singles Chart. The band's seventh and most recent studio album Sweet 7 was released in March 2010 featuring the lead single \"Get Sexy\", which peaked at number two on the UK Singles Chart; it was the last single to feature Keisha Buchanan. The second single from the album, \"About a Girl\", peaked at number eight in the UK, and was the first single to feature new member Jade Ewen. \"Wear My Kiss\", the album's third single, peaked at number seven in the UK."]}, {"page": "Round Round", "response": ["\"Round Round\" is a song performed by British girl group Sugababes. It was written by group members  Keisha Buchanan, Mutya Buena, and Heidi Range, as well as Miranda Cooper, Niara Scarlett, Brian Higgins, Tim Powell, Nick Coler, Shawn Lee, and Lisa Cowling and produced by Kevin Bacon and Jonathan Quarmby. It was released as the second single from the group's second studio album, Angels with Dirty Faces (2002).", "\"Round Round\" was written by Keisha Buchanan, Mutya Buena, Heidi Range, Miranda Cooper, Niara Scarlett, Brian Higgins, Tim Powell, Nick Coler, Shawn Lee, and Lisa Cowling. Due to the inclusion of a sample from \"Tango Forte\" by German production team Dublex Inc., Florian Pflueger, Felix Stecher, Robin Hofmann, and Rino Spadavecchia are also credited as songwriters. In turn, \"Tango Forte\" is based around an uncredited sample from \"Whatever Lola Wants\" by American composer Les Baxter. Production on \"Round Round\" was helmed by Kevin Bacon and Jonathan Quarmby for Manna Productions based on an original track Higgins and Powell had created for Xenomania Records, while Jeremy Wheatley provided additional production and handled the mixing. Guitar recording and programming were overseen by Yoad Nevo for 247 Arists.", "Category:Songs written by Keisha Buchanan"]}, {"page": "Stronger (Sugababes song)", "response": ["Soon after the release of the group's first album, One Touch (2000), and its singles \"New Year\", \"Run for Cover\" and \"Soul Sound\", the Sugababes were dropped by their record label London Records, and Siobhán Donaghy left the group amid reports of in-fighting with Keisha Buchanan and Mutya Buena. The former Atomic Kitten member Heidi Range was announced as Donaghy's replacement, and the Sugababes subsequently signed to Island Records. \"Stronger\" was written by Buchanan, Buena and Range, in collaboration with Jony Rockstar, Marius de Vries and Felix Howard, for the group's second studio album Angels with Dirty Faces. The song was conceptualised during the period in Range's life when she had not yet joined the group and was separated from her family and friends. -   Range related her experience to the writing process of \"Stronger\", a technique which she suggested was essential for songwriting. The song was produced and mixed by Rockstar. Tom Elmhirst also mixed the song, recorded the group's vocals and programmed it. Range has named \"Stronger\" as her favourite song from the group's career, and considers it personal to her.  \"Stronger\" was released as the album's third single as part of a double A-side with the album's title track in CD, cassette and 12-inch single formats on 11 November 2002. To promote its release, the Sugababes played the track to the Birmingham Mail in October 2002 as part of an interview,  and visited 95.8 Capital FM in November 2002. ", "*Songwriting – Keisha Buchanan, Mutya Buena, Heidi Range, Jony Rockstar, Marius de Vries, Felix Howard", "*Vocals – Keisha Buchanan, Mutya Buena, Heidi Range", "Category:Songs written by Keisha Buchanan"]}, {"page": "Red Dress (Sugababes song)", "response": ["\"Red Dress\" was written by the Sugababes—Keisha Buchanan, Mutya Buena and Heidi Range—in collaboration with Brian Higgins, Miranda Cooper, Tim Powell, Nick Coler, Shawn Lee, Lisa Cowling, and Bob Bradley, for the group's fourth studio album Taller in More Ways (2005). According to Range, the song was inspired by the perception that women must expose their body to be noticed. It was produced by Higgins and Xenomania, who also produced the album track \"Ace Reject\". \"Red Dress\" was mixed by Jeremy Wheatley and Powell with assistance from Richard Edgeler, and programmed by Powell and Higgins. The accompanying keyboards for the track were provided by Powell, Higgins, Tim Larcombe and Jon Shave. The bass was provided by Bradley, while the guitars were provided by Coler and Lee. \"Red Dress\" was recorded by Dario Dendi at Eden Studios, London, with assistance from Chris Poulter and Zoe Smith.", "thumb|200px|right|Amelle Berrabah, Heidi Range and Keisha Buchanan wearing red dresses in the music video for \"Red Dress\".", "*Songwriting – Keisha Buchanan, Mutya Buena, Heidi Range, Brian Higgins, Miranda Cooper, Tim Powell, Nick Coler, Shawn Lee, Lisa Cowling, Bob Bradley", "Category:Songs written by Keisha Buchanan"]}, {"page": "Freak like Me", "response": ["The music video was directed by Dawn Shadforth and Sophie Muller and was filmed in London. It uses the \"We Don't Give a Damn Mix\" of the song, which is more faithful to the original mash-up. The video is set in a strange nightclub, and acts to introduce then-recently added member Heidi Range. It begins outside the nightclub with a man tumbling down the stairs, with Keisha Buchanan in a long coat, seen only from below the knee, walking out of a door, over the man's body and up the stairs. Mutya Buena is seen standing on the stairs facing the direction where the man is lying. Inside, they spot Range dancing and flirting with many guys. They both quickly clash with her, and a fight between them ensues, which ends with Range falling to the floor unconscious. A man tries to help her up, but Buena grabs him by the neck and throws him away from her. Range wakes up again soon after, and stumbles out of the club with another man, where they begin to kiss, until she suddenly bites hard into his arm. Meanwhile, Buchanan takes a man outside, and she leads him into a dark alley, where they flirt briefly, before she scares him away. Buena then goes outside as well, and overpowers a man who towers over her. The music video ends with Buchanan and Buena accepting Range into the group, and dancing into the night. The demonstrations of supernatural strength shown throughout the video and Range biting the man on the arm are generally understood to imply that the women are, as the song suggests, vampire-like \"freaks\". Julian Morris stars in the music video as one of the boys running from Buena."]}, {"page": "Soul Sound", "response": ["The group's members were dissatisfied with the release of \"Soul Sound\" as a single, because they wanted to venture into an R&B sound whereas their record label London Records pushed them into a more pop direction. Soon after the song's release, Donaghy left the group and was replaced by former Atomic Kitten member Heidi Range, making it the last Sugababes single to feature her vocals.Sheridan, 2007. pp 81–82. Further, the sales of One Touch and its last three singles, \"New Year\", \"Run for Cover\" and \"Soul Sound\", failed to meet the expectations of London Records and the group was subsequently dropped. Band member Keisha Buchanan has stated that the song's release and subsequent commercial underperformance was a positive experience because, saying: \"Everything happens for a reason and it looks like it has all worked out\". \"Soul Sound\" was featured in the 2001 film Summer Catch, which stars such actors as Freddie Prinze Jr. and Jessica Biel."]}, {"page": "Overload (Sugababes song)", "response": ["\"Overload\" is the debut single of British girl group Sugababes. It was released on 11 September 2000 through London Records as the lead single from the group's debut studio album, One Touch (2000). At the time, the group consisted of Siobhán Donaghy, Mutya Buena and Keisha Buchanan. It was co-produced and co-written by British songwriters and producers Paul Simm, Felix Howard, Jony Rockstar and Cameron McVey. The general theme of the song involves a teenage girl's crush towards a boy and her finding the situation difficult to manage.", "\"Overload\" was co-written by group members Keisha Buchanan, Mutya Buena, and Siobhán Donaghy together with the song's co-producers Cameron McVey, Paul Simm and long-time Sugababes contributor, Jony Rockstar. The track fuses together styles of soul and hip-hop and features contributions of numerous instruments, including: drum, bass, keyboard, electric guitar and horns.", "Category:Songs written by Keisha Buchanan"]}, {"page": "Follow Me Home (song)", "response": ["\"Follow Me Home\" is a song by British girl group the Sugababes, released as the fourth single from their fourth studio album, Taller in More Ways (2005). The electropop and R&B ballad was written by band members Keisha Buchanan, Mutya Buena and Heidi Range, with Jony Rockstar, Karen Poole and Jeremy Shaw. The producer, Rockstar, developed the idea of a close person as its inspiration. Buena wrote a verse about her daughter, while Buchanan wrote a verse based on her close friend. The song was released as the album's fourth single on 5 June 2006 and contains vocals from Amelle Berrabah in replacement of Buena's, who left the band in December 2005.", "\"Follow Me Home\" was written by the Sugababes—Keisha Buchanan, Mutya Buena, and Heidi Range—in collaboration with Jonathan Lipsey, Karen Poole, and Jeremy Shaw, for the group's fourth studio album, Taller in More Ways (2005). Lipsey developed the idea of a close person as the song's inspiration. Buena wrote the first verse based upon her daughter Tahlia, who was born in March 2005. While writing the verse, she pondered questions such as 'What would you say to her if she was ever in trouble?', and 'How would you say, I'll always be there for you?'. Buena wanted people to interpret the verse in different ways, and stated that the lyrics came naturally. Buchanan drew inspiration from her close friend when she wrote the other verse. Lipsey produced the song under his production name Jony Rockstar. \"Follow Me Home\" was mixed and engineered at Metropolis Studios by Tom Elmhirst and Richard Wilkinson, respectively.", "* Songwriting – Keisha Buchanan, Mutya Buena, Heidi Range, Jonathan Lipsey, Karen Poole, Jeremy Shaw", "Category:Songs written by Keisha Buchanan"]}, {"page": "New Year (song)", "response": ["\"New Year\" is a song by British girl group the Sugababes, released as the second single from their debut studio album One Touch (2000). The song was written by group members Siobhán Donaghy, Mutya Buena and Keisha Buchanan in collaboration with Cameron McVey, Jony Lipsey, Felix Howard and Matt Rowe, and produced by McVey, Lipsey and Paul Simm. \"New Year\" is a pop and R&B ballad with influences of soul and alternative rock. It features acoustic instrumentation, and the lyrics describe the experience of breaking up on Christmas Day.", "British girl group the Sugababes were formed in 1998 by Siobhán Donaghy, Mutya Buena and Keisha Buchanan. Donaghy and Buena first met during an a cappella gig, where they heard each other sing and later performed a duet. The duo decided to work together on a new song, and while they were in the studio, Buchanan came to visit her friend Buena. Donaghy's manager, Ron Tom, concluded that the trio were to join together as a band, known as the Sugababes. They later signed to London Records and began writing songs for their debut album One Touch.", "Category:Songs written by Keisha Buchanan"]}, {"page": "Run for Cover (Sugababes song)", "response": ["\"Run for Cover\" is a song by British girl group Sugababes. Siobhan Donaghy, Keisha Buchanan, Mutya Buena, Jony Lipsey, Cameron McVey, and Paul Simm all co-wrote the song for the band's debut album One Touch (2000). It was released as the album's third single on 9 April 2001 and reached the top 30 in Germany and the top 20 on the UK Singles Chart.", "Category:Songs written by Keisha Buchanan"]}, {"page": "Girls Aloud: Off the Record", "response": ["* Keisha Buchanan", "*Guest stars: Amelle Berrabah, Samiya Berrabah, Zakiya Berrabah, Keisha Buchanan, Ashley Cole, Hillary Shaw"]}, {"page": "Great British Menu", "response": ["| Scotland || Lorna McNee || Gordon Jones || Ben Reade || Richard Corrigan  || Keisha Buchanan"]}, {"page": "Overloaded: The Singles Collection", "response": ["Shortly following the release of the Sugababes' fourth studio album, Taller in More Ways, it was announced in December 2005 that founding group member Mutya Buena had left the band. Two singles were subsequently released from the album featuring new group member Amelle Berrabah, who was announced as Buena's replacement 24 hours after her departure. In June 2006, the Sugababes began working on their fifth studio album which was confirmed for release in 2007. However, group member Heidi Range also revealed that a greatest hits album would be released in time for Christmas 2006, which would include all of the group's hits. When rumours arose that the release of the album was premature, band member Keisha Buchanan stated that the group had already started to plan a greatest hits album. She explained how it was essential for the album to be released following Buena's departure, saying: \"When Mutya left, we decided it was even more important, we should do this as closure so we don't have to relive history all the time.\" Group member Heidi Range also reflected upon this, saying: \"When Mutya was still in the band the greatest hits was always planned for this time anyway. But when she left it seemed even more appropriate.\"", "*Keisha Buchanan – composer, vocals"]}, {"page": "1984 in the United Kingdom", "response": ["* 26 September – Keisha Buchanan, singer"]}, {"page": "Reissue", "response": ["Some recordings are remixed and reissued in an effort to erase prior band member's contributions.  Two such examples were Ozzy Osbourne’s Blizzard of Ozz and Diary of a Madman. British girl group Sugababes reissued two of their studio albums in a similar manner; Taller in More Ways following Mutya Buena's replacement with Amelle Berrabah, and Sweet 7 after Keisha Buchanan's replacement with Jade Ewen. \"Do What U Want\" by Lady Gaga featuring R. Kelly was removed from all streaming and online versions and new vinyl and CD pressings of Gaga's third studio album Artpop in light of the documentary Surviving R. Kelly."]}, {"page": "Easy (Sugababes song)", "response": ["The Sugababes confirmed in June 2006 that a greatest hits album would be released in time for Christmas of that year. The album, titled Overloaded: The Singles Collection, was confirmed to contain two brand new tracks called \"Easy\" and \"Good to Be Gone\". \"Easy\" was written by Jason Pebworth and George Astasio, both members of American rock band Orson, in collaboration with the Sugababes—Keisha Buchanan, Heidi Range and Amelle Berrabah. It was produced by Brio Taliaferro, Pebworth and Astasio. Orson, who shared the same management with the Sugababes, discovered that the group had begun writing material for their new album. They visited the studio with the Sugababes and offered ideas for new tracks, which the group enjoyed. Buchanan spoke upon the Sugababes' involvement with the song by saying that they \"went into the studio separately\" and \"changed things around\". \"Easy\" was mixed by Jeremy Wheatley for 365 Artists at Twenty-One Studios in London, with assistance from Richard Edgeler.", "* Songwriting – Jason Pebworth, George Astasio, Keisha Buchanan, Heidi Range, Amelle Berrabah", "Category:Songs written by Keisha Buchanan"]}]}}