{"wiki_id": "http://www.wikidata.org/entity/Q2351077", "itemLabel": "William Bertram Turrill", "itemDescription": "English botanist (1890-1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Bertram_Turrill", "wikipedia_page": {"main": "William Bertram Turrill FRS OBE FLS (14 June 1890 – 15 December 1961) was an English botanist.", "link_mentions": [{"page": "Taxonomy (biology)", "response": ["William Bertram Turrill introduced the term \"alpha taxonomy\" in a series of papers published in 1935 and 1937 in which he discussed the philosophy and possible future directions of the discipline of taxonomy. ... there is an increasing desire amongst taxonomists to consider their problems from wider viewpoints, to investigate the possibilities of closer co-operation with their cytological, ecological and genetics colleagues and to acknowledge that some revision or expansion, perhaps of a drastic nature, of their aims and methods, may be desirable ... Turrill (1935) has suggested that while accepting the older invaluable taxonomy, based on structure, and conveniently designated \"alpha\", it is possible to glimpse a far-distant taxonomy built upon as wide a basis of morphological and physiological facts as possible, and one in which \"place is found for all observational and experimental data relating, even if indirectly, to the constitution, subdivision, origin, and behaviour of species and other taxonomic groups\". Ideals can, it may be said, never be completely realized. They have, however, a great value of acting as permanent stimulants, and if we have some, even vague, ideal of an \"omega\" taxonomy we may progress a little way down the Greek alphabet. Some of us please ourselves by thinking we are now groping in a \"beta\" taxonomy."]}, {"page": "Linnean Medal", "response": ["*1958: Sir Gavin de Beer and William Bertram Turrill"]}, {"page": "Henry John Elwes", "response": ["Shortly before his death in 1922, Elwes asked Arthur Grove, a friend and fellow lily expert, to undertake the task of producing a supplement. Dame Alice Godman, widow of Frederick DuCane Godman (whose first wife was Elwes' sister), agreed to underwrite the cost of the work (co-written by Grove and the botanist A.D. Cotton) and the first seven parts of the supplement were published between July 1933 and February 1940, with 30 hand-coloured lithographed plates, all but two by Lilian Snelling (1879–1972).Monogram background from Antiquarian Booksellers Association of America (ABAA)  Two final supplements were published in 1960 and 1962 by William Bertram Turrill."]}, {"page": "List of authors of South African botanical taxa", "response": ["*William Bertram Turrill (1890–1961) S ........ Turrill"]}, {"page": "Veitch Memorial Medal", "response": ["* 1953 : William Bertram Turrill (1890–1961) (of Kew),;  Nellie Roberts (silver medal)"]}, {"page": "Justicia flaviflora", "response": ["The species was originally described as Beloperone flaviflora in 1922 by the English botanist William Bertram Turrill based on collections made by Robert O. Williams in the same year.  Turrill considered it a close relative of a Mexican species, Beloperone tenera (now J. tenera).  Its currently accepted name, Justicia flaviflora was coined by the American botanist Dieter C. Wasshausen in 1995, reflecting the predominant view that the members of the genus Beloperone should actually be considered members of the genus Justicia.  As of 2006, the species was last known to have been collected in 1993.  Collections of J. flaviflora are known to exist in the herbaria of the British Museum and at the Royal Botanic Gardens, Kew."]}, {"page": "List of fellows of the Royal Society S, T, U, V", "response": ["|William Bertram Turrill||20/03/1958||14 June 1890 – 15 December 1961"]}, {"page": "List of botanists by author abbreviation (T–V)", "response": ["* Turrill – William Bertram Turrill (1890–1961)"]}, {"page": "Sempervivum altum", "response": ["Sempervivum altum is a species of flowering plant in the family Crassulaceae, native to the Caucasus Mountains. Like other members of the houseleek genus, it grows succulent leaves in rosettes. The rosettes of S. altum are 1–5 cm across, and the leaves are pubescent or pilose. The flowers are pink edged with white, with yellow anthers, growing on a stem 30–40 cm tall. The species was described in 1936 by William Bertram Turrill based on specimens collected by P.L. Giuseppi in a 1935 expedition to the Caucasus Mountains. It is closely related to S. ingwersenii and S. ossetiense from the same region. , the name is not accepted by the World Checklist of Selected Plant Families."]}, {"page": "List of fellows of the Royal Society elected in 1958", "response": ["#William Bertram Turrill"]}, {"page": "Acacia dunnii", "response": ["The species was formally described by the botanist William Bertram Turrill in 1922 in the work Dunn's Wattle as published in the Bulletin of Miscellaneous Information. Synonyms for the plant include Racosperma dunnii as described by Leslie Pedley and Acacia sericata var. dunnii by Joseph Maiden."]}, {"page": "Turrill", "response": ["*William Bertram Turrill (1890–1961), English botanist"]}, {"page": "List of plant genera named for people (Q–Z)", "response": ["|data-sort-value=\"Turrill\"|William Bertram Turrill (1890–1961)"]}]}}