{"wiki_id": "http://www.wikidata.org/entity/Q235318", "itemLabel": "Paula Rego", "itemDescription": "Portuguese visual artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Paula_Rego", "wikipedia_page": {"main": "Dame Maria Paula Figueiroa Rego  (born 26 January 1935) is a Portuguese-British visual artist who is particularly known for her paintings and prints based on storybooks. Rego’s style has evolved from abstract towards representational, and she has favoured pastels over oils for much of her career. Her work often reflects feminism, coloured by folk-themes from her native Portugal.\nRego studied at the Slade School of Fine Art, University College London and was an exhibiting member of the London Group, along with David Hockney and Frank Auerbach. She was the first artist-in-residence at the National Gallery in London. She lives and works in London.", "link_mentions": [{"page": "January 26", "response": ["*  1935   – Paula Rego, Portuguese-born British visual artist"]}, {"page": "Portugal", "response": ["Prominent international figures in visual arts nowadays include painters Vieira da Silva, Júlio Pomar, Helena Almeida, Joana Vasconcelos, Julião Sarmento and Paula Rego."]}, {"page": "National Gallery", "response": ["|Paula Rego||1989–1990"]}, {"page": "Turner Prize", "response": ["Sculpture and installation artist Richard Long is presented the prize after three previous nominations. Controversially, Long is awarded for his lifetime body of work rather than an exhibition of work in 1989. Other nominees included painter Gillian Ayres, figurative painter Lucian Freud, Italian-born sculptor Giuseppe Penone, painter Paula Rego, abstract painter Sean Scully and Richard Wilson. Italian Giuseppe Penone became the first foreign artist to be nominated for the strength of his exhibitions in Britain."]}, {"page": "Tracey Emin", "response": ["Monoprint drawings of mothers and children that Emin drew during a pregnancy in 1990 were included in a 2010 joint exhibition with Paula Rego and Mat Collishaw at the Foundling Museum.", "For the Venice Biennale, she produced a series of new purple neon works, for example, Legs I (2007). This 2007 series of Legs neon works were directly inspired by the Purple Virgin (2004) watercolour series. For example, Legs IV (2007) directly follows the watercolour lines of the Purple Virgin 9 (2004). For a joint 2010 exhibition with Paula Rego and Mat Collishaw she decorated the front of the Foundling Museum with the neon words \"Foundlings and fledglings are angels of this earth\".", "*Film about joint 2010 exhibition with Paula Rego and Mat Collishaw at the Foundling Museum – The Guardian"]}, {"page": "Christmas card", "response": ["From the beginning, Christmas cards have been avidly collected. Queen Mary amassed a large collection that is now housed in the British Museum. The University College London's Slade School of Fine Art houses a collection of handmade Christmas Cards from alumni such as Paula Rego and Richard Hamilton and are displayed at events over the Christmas season, when members of the public can make their own Christmas cards in the Strang Print Room. Specimens from the \"golden age\" of printing (1840s–1890s) are especially prized and bring in large sums at auctions. In December 2005, one of Horsley's original cards sold for nearly £9,000. Collectors may focus on particular images like Santa Claus, poets, or printing techniques. The Christmas card that holds the world record as the most expensive ever sold was a card produced in 1843 by J. C. Horsley and commissioned by civil servant Sir Henry Cole. The card, one of the world's first, was sold in 2001 by UK auctioneers Henry Aldridge to an anonymous bidder for a record breaking £22,250."]}, {"page": "Rugby, Warwickshire", "response": ["The Rugby Art Gallery, Museum and Library which opened in 2000, hosts various temporary art exhibitions, the main collection which is not on permanent display is the nationally renown \"Rugby Collection of 20th century and Contemporary British Art\" which includes 170 artworks by artists such as L. S. Lowry, Stanley Spencer, Paula Rego and Graham Sutherland. The museum hosts Roman artefacts excavated from the nearby Romano-British town of Tripontium, as well as an exhibition of the social history of Rugby. The building also houses the town's library."]}, {"page": "List of Portuguese people", "response": ["* Paula Rego, 20th-century painter"]}, {"page": "Durham Cathedral", "response": ["At the beginning of this century two of the altars in the Nine Altars Chapel at the east end of the cathedral were re-dedicated to Saint Hild of Whitby and Saint Margaret of Scotland: a striking painting of Margaret (with her son, the future king David) by Paula Rego was dedicated in 2004.  Nearby a plaque, first installed in 2011 and rededicated in 2017, commemorates the Scottish soldiers who died as prisoners in the cathedral after the Battle of Dunbar in 1650.  The remains of some of these prisoners have now been identified in a mass grave uncoverered during building works in 2013 just outside the cathedral precinct near Palace Green."]}, {"page": "Diamanda Galás", "response": ["Galás has stated that, for her, painting acts as \"an exorcism of that which is troubling [her] deeply\", and that the visual language she uses allows her \"to paint an analogue of the experience, the misery, and therefore get rid of it for the time being. But only because of that vocabulary\", she adds. Commentators suggest that Galás's paintings look to the past by presenting stylistic similarities with artworks by Expressionist artists such as Edvard Munch, Paul Klee and Jean Dubuffet. One of the Expressionist artists that Galás mentions as influential to her is the Austrian painter and playwright Oskar Kokoschka, especially with his short play Murderer, the Hope of Women (1909), which has very little text but creates 'explosions' by being immensely expressive. According to art historian Donald Kuspit, looking back to early modern art, particularly to Expressionism, was an interest in subjects from that period by late-70s and early-80s Neo-expressionist artists, such as Georg Baselitz, Paula Rego and Jean-Michel Basquiat, who painted objects and human forms in a distorted way, yet not entirely un-recognisable. Galás has also been compared to the artist David Wojnarowicz, whose work is seen as falling within the wider limits of neo-expressionism, for the similarities in which they invite horror through immediate and explicit expression. For Galás, the visual art that she does \"has the same impulse and subject material\" as her music, because she cannot interrupt the creative process when working on a subjects, \"so these are simply different treatments of similar subjects.\" Many of Galás's paintings often borrow their subjects from themes she has explored in her performances and recordings, looking back to the same historical events that have been inspiring her to write lyrics and compose music, as is made apparent by the use of titles such as 'Ragip:Turkish Prison for Infidels', 'Medusa', 'Artemis', Cleopatra', 'Mani: Me Epifilakzin – Salt Maketh A Man Who Fears No God' and 'Ethiopian Martyr/Amharic Brother to Greek Orthodox, Egyptian Coptic and Palestinian Orthodox', among others."]}, {"page": "Kendal", "response": ["*Abbot Hall Art Gallery (housed in a Georgian villa) mounts nationally important exhibitions, such as David Bomberg: Spirit in the Mass (17 July – 28 October 2006). The permanent collection covers George Romney, J. M. W. Turner, John Ruskin, Ben Nicholson, Paula Rego, Lucian Freud, Stanley Spencer and Barbara Hepworth."]}, {"page": "Saatchi Gallery", "response": ["The opening exhibition included a retrospective by Damien Hirst, as well as work by other YBAs, such as Jake and Dinos Chapman and Tracey Emin alongside some longer-established artists including John Bratby, Paula Rego and Patrick Caulfield.", "*Paula Rego", "*Paula Rego"]}, {"page": "List of contemporary artists", "response": ["* Paula Rego (born 1935), painter"]}, {"page": "Murray Edwards College, Cambridge", "response": ["* Paula Rego"]}, {"page": "Culture of Portugal", "response": ["In the early 20th century, Portuguese art increased both in quality and quantity, mainly due to members of the Modernist movement like Amadeo de Souza Cardoso and Almada Negreiros. In the post-war years the abstractionist painter Vieira da Silva settled in Paris and gained widespread recognition, as did her contemporary Paula Rego."]}, {"page": "Ron Mueck", "response": ["Born in 1958 to German parents in Melbourne, Australia, Ron Mueck grew up in the family business of puppetry and doll-making. He worked initially as a creative director in Australian children's television, before moving to America to work there in film and advertising. In 1996, he was asked by Paula Rego, his mother-in-law,Willing, Nick, Paula Rego, Secrets & Stories, Kismet Films for the BBC, 25 March 2017. to make a small figure of Pinocchio for her group exhibition Spellbound: Art and Film, at the Hayward Gallery, London."]}, {"page": "Momart", "response": ["*1994 — Paula Rego"]}, {"page": "Cascais", "response": ["*Casa das Histórias Paula Rego. This is a relatively modern museum devoted to the paintings of Paula Rego and her husband Victor Willing."]}, {"page": "Belém Palace", "response": ["President Jorge Sampaio commissioned painter Paula Rego for a series of paintings to decorate the walls of the Palace chapel in 2002. The painter eventually gave her works entitled \"Ciclo da Vida da Virgem Maria e da Paixão de Jesus Cristo\" (Cycle of Life of the Virgin Mary and the Passion of Jesus Christ\".  The early exhibitions and Presidential initiatives would lead to the inauguration on 5 October 2004 of the Presidential Museum ().  Similarly, the King D. Luís I Painting Gallery was the setting for the 2005 exposition, Do Palácio de Belém, which presented the history of the palace and its architecture, as well as an overview of artistic works that have been displayed there.", "The narrow rectangular chapel, with smooth walls and wood panelling, is occupied by a Neoclassical retable in gold-leafed wood, with a painting by André Reinoso representing the \"A Adoração dos Pastores\" (The Adoration of the Shepherds).This painting actually substituted a representation of the \"Immaculate Conception\" which was removed. The vaulted ceiling is decorated with a profusion of decorative motifs in a \"ferronneire\" similar to those found in the Sala Dourada. On the walls are paintings by the artist Paula Rego, representing the \"Ciclo da Vida da Virgem Maria e da Paixão de Jesus Cristo\" (Circle of Life of the Virgin Mary and the Passion of Christ)."]}, {"page": "Rugby Art Gallery and Museum", "response": ["The art gallery holds \"The Rugby Collection\", over 170 items of 20th century and contemporary British art, including prints, drawings and paintings by artists such as L. S. Lowry, Stanley Spencer, Paula Rego and Graham Sutherland. The collection was built up by Rugby Borough Council from 1946 onwards and still collects \"works by British artists of 'promise and renown' \". There is also a \"Local Art Collection\"."]}, {"page": "Slade School of Fine Art", "response": ["Another cherished period followed the Second World War, under the directorship of William Coldstream, who brought in Lucian Freud to teach, and whose students included Paula Rego, Michael Andrews, and the filmmaker Lorenza Mazzetti. Coldstream was responsible for the creation of the Slade Film Department, the first in any British university, in 1960, with Thorold Dickinson as chief lecturer. Filmmakers associated with the Slade Film Department include Derek Jarman and Peter Whitehead.", "* Paula Rego (born 1935), painter, illustrator and printmaker"]}, {"page": "Serpentine Galleries", "response": ["The Serpentine Gallery was established in 1970 and is housed in a Grade II listed former tea pavilion built in 1933–34 by the architect James Grey West. Notable artists whose works have been exhibited there include Man Ray, Henry Moore, Jean-Michel Basquiat, Andy Warhol, Paula Rego, Sondra Perry, Bridget Riley, Allan McCollum,Liam Gillick, \"Allan McCollum at the Serpentine\", Artscribe, Summer 1989 Anish Kapoor, Christian Boltanski, Philippe Parreno, Richard Prince, Wolfgang Tillmans, Gerhard Richter, Gustav Metzger, Damien Hirst, Maria Lassnig, Jeff Koons and Marina Abramović. On the ground at the gallery's entrance is a permanent work made by Ian Hamilton Finlay in collaboration with Peter Coates, and dedicated to Diana, Princess of Wales, the gallery's former patron."]}, {"page": "2004 in art", "response": ["*Paula Rego – The Cake Woman"]}, {"page": "Blake Morrison", "response": ["His first book was The Movement: English Poetry and Fiction of the 1950s (Oxford University Press, 1980). This was followed in 1982 by a critical guide to Seamus Heaney's poetry. Also in 1982 he co-edited The Penguin Book of Contemporary British Poetry with Andrew Motion. Morrison's first book of poetry, Dark Glasses, was published by Chatto and Windus in 1984. Other published works include Ballad of the Yorkshire Ripper (1986), written in Yorkshire dialect, and Pendle Witches (1996), illustrated with etchings by Paula Rego. His poems have also appeared in several anthologies, including Penguin Modern Poets 1 (1995).", "*Pendle Witches (illustrations by Paula Rego) (Enitharmon Press, 1996)"]}, {"page": "St. Julian's School", "response": ["*Paula Rego, artist"]}, {"page": "List of British artists", "response": ["* Paula Rego (born 1935) – born in Portugal"]}, {"page": "Bill Lewis", "response": ["His position in art in many ways stands for the Stuckist ethic.Moss, Richard. \"Stuckist's Punk Victorian Gatecrashes Walker's Biennial\", Culture24, 17 September 2004. Retrieved 24 November 2009. He has said \"I do this because I can’t do anything else and I’ve spent 20 years doing it.\" He says the importance of his work is not in the technique, but \"what's underneath it\"; he redraws or repaints an image as many as eighty times, until he is satisfied with it. He names as influences Marc Chagall, Paula Rego, Ana Maria Pacheco, films and comic books. He has been quoted as saying \"People are never sure if we are being ironic or not. We are not. We are coming from the heart.\""]}, {"page": "List of people associated with University College London", "response": ["* Paula Rego, painter (Slade, 1952–56)"]}, {"page": "Middlesbrough Institute of Modern Art", "response": ["Works include; Frank Auerbach, Elizabeth Blackadder, David Bomberg, Ken Currie, Jeremy Deller, Tracey Emin, Sir Jacob Epstein, Dame Elisabeth Frink, David Hockney, Peter Howson, Gwen John, Panayiotis Kalorkoti, L.S. Lowry, Ben Nicholson, Eduardo Paolozzi, Adrian Piper, Katherine Pleydell-Bouverie, Anne Redpath, Paula Rego, David Remfry, Lucie Rie, Stanley Spencer, Nancy Spero and Kara Walker."]}, {"page": "1988 in art", "response": ["*Paula Rego – The Dance"]}, {"page": "List of Portuguese painters", "response": ["*Paula Rego (born 1935)"]}, {"page": "Azulejo", "response": ["20th-century artists include Jorge Barradas, Carlos Botelho, Jorge Martins, Sá Nogueira, Menez and Paula Rego. Maria Keil designed the large abstract panels in the initial nineteen stations of the Lisbon Underground (between 1957 and 1972). Through these works she became a driving force in the revival and the updating of the art of the azulejo, which had gone in some decline. Her decorations of the station Intendente is considered a masterpiece of contemporary tile art. "]}, {"page": "1935 in art", "response": ["* 26 January – Paula Rego, Portuguese-born painter"]}, {"page": "Christine and Léa Papin", "response": ["* The Maids, an artwork by Paula Rego"]}, {"page": "Women artists", "response": ["Elene Akhvlediani, Hannelore Baron, Vanessa Bell, Lee Bontecou, Louise Bourgeois, Romaine Brooks, Emily Carr, Leonora Carrington, Mary Cassatt, Elizabeth Catlett, Camille Claudel, Sonia Delaunay, Marthe Donas, Joan Eardley, Marisol Escobar, Dulah Marie Evans, Audrey Flack, Mary Frank, Helen Frankenthaler, Elisabeth Frink, Wilhelmina Weber Furlong, Françoise Gilot, Natalia Goncharova, Nancy Graves, Grace Hartigan, Barbara Hepworth, Eva Hesse, Sigrid Hjertén, Hannah Höch, Frances Hodgkins, Malvina Hoffman, Irma Hünerfauth, Margaret Ponce Israel, Gwen John, Elaine de Kooning, Käthe Kollwitz, Lee Krasner, Frida Kahlo, Hilma af Klint, Laura Knight, Barbara Kruger, Marie Laurencin, Tamara de Lempicka, Séraphine Louis, Dora Maar, Margaret Macdonald Mackintosh, Maruja Mallo, Agnes Martin, Ana Mendieta, Joan Mitchell, Paula Modersohn-Becker, Gabriele Münter, Alice Neel, Louise Nevelson, Georgia O'Keeffe, Betty Parsons, Aniela Pawlikowska, Orovida Camille Pissarro, Irene Rice Pereira, Paula Rego, Bridget Riley, Verónica Ruiz de Velasco, Anne Ryan, Charlotte Salomon, Augusta Savage, Zofia Stryjeńska, Zinaida Serebriakova, Sarai Sherman, Henrietta Shore, Sr. Maria Stanisia, Marjorie Strider, Carrie Sweetser, Annie Louisa Swynnerton, Franciszka Themerson, Suzanne Valadon, Remedios Varo, Maria Helena Vieira da Silva, Nellie Walker, Marianne von Werefkin and Ogura Yuki.Women Artists of the 20th & 21st Centuries, retrieved on June 14, 2007."]}, {"page": "Rego", "response": ["* Paula Rego (born 1935), Portuguese painter"]}, {"page": "Antony Micallef", "response": ["* 2008 -2009, Tate Britain, London, UK Antony Micallef along with Paula Rego and Mark Hearld were invited to take part in the 50th anniversary celebration of the famous Curwen Studios. To commemorate the occasion they exhibited a special limited edition lithograph print in the Tate Britain (Goodison Room)."]}, {"page": "Folio Society", "response": ["* Paula Rego (English nursery rhymes compilation and J M Barrie, Peter Pan and Wendy)"]}, {"page": "List of Portuguese artists", "response": ["* Paula Rego (born 1935)"]}, {"page": "Sarah Kent", "response": ["*Author: Sarah Kent, John McEwen. Paula Rego: The Dancing Ostriches from Disney's \"Fantasia\". Saatchi Gallery, 1996, "]}, {"page": "Leeds Art Fund", "response": ["The LAF has also contributed towards the acquisition of many artworks on display in Leeds Museums and Galleries, including by such well-known names as Thomas Chippendale, J.M.W. Turner, John Sell Cotman, John Atkinson Grimshaw, Stass Paraskos, Paula Rego, Bridget Riley, Grayson Perry and Auguste Rodin. "]}, {"page": "Os Maias", "response": ["Paula Rego painted a series of pastels, inspired by this novel, which have been exhibited in London."]}, {"page": "Os Grandes Portugueses", "response": ["|99||Paula Rego||born 1935||painter"]}]}}