{"wiki_id": "http://www.wikidata.org/entity/Q2351869", "itemLabel": "Prince Maurice of Battenberg", "itemDescription": "member of the Hessian princely Battenberg family and the extended British Royal Family", "wikipedia_url": "https://en.wikipedia.org/wiki/Prince_Maurice_of_Battenberg", "wikipedia_page": {"main": "Prince Maurice Victor Donald of Battenberg , (3 October 1891 – 27 October 1914) was a member of the Hessian princely Battenberg family and the extended British Royal Family, and the youngest grandchild of Queen Victoria. He was known as Prince Maurice throughout his life, since he died before the British Royal Family relinquished their German titles during World War I and the Battenbergs changed their name to Mountbatten.\n\n", "link_mentions": [{"page": "Hemel Hempstead", "response": ["* Prince Maurice of Battenberg (1891–1914), grandson of Queen Victoria was a pupil at Lockers Park School."]}, {"page": "Princess Beatrice of the United Kingdom", "response": ["Following the war, Beatrice was one of several members of the royal family who became patrons of The Ypres League, a society founded for veterans of the Ypres Salient and bereaved relatives of those killed in fighting in the Salient.The Ypres League webpage , Aftermath – when the boys came home, accessed 16 January 2010 She was herself a bereaved mother, as her son, Prince Maurice of Battenberg, had been killed in action during the First Battle of Ypres. Rare public appearances after his death included commemorations, including laying wreaths at the Cenotaph in 1930 and 1935 to mark the 10th and 15th anniversaries of the founding of the League.\"To celebrate the tenth anniversary ...\", Reading Eagle, 9 December 1930, p. 10\"Beatrice Lays Wreath\", Getty Images, image number 3294671, from the Hulton Archive, accessed 16 January 2010", "| 90px ||align=left|Prince Maurice of Battenberg||3 October 1891||27 October 1914||align=left|Died of wounds from action during World War I."]}, {"page": "Prince Henry of Battenberg", "response": ["|align=center| 90px ||Prince Maurice of Battenberg||3 October 1891||27 October 1914||Killed in action during World War I."]}, {"page": "Wellington College, Berkshire", "response": ["* Prince Maurice of Battenberg."]}, {"page": "Mountbatten family", "response": ["* Prince Maurice of Battenberg (1891–1914)"]}, {"page": "Battenberg family", "response": ["*** Prince Maurice of Battenberg (1891–1914)"]}, {"page": "Haemophilia in European royalty", "response": ["*Beatrice, Princess Henry of Battenberg (1857–1944) Issue: Alexander Mountbatten, 1st Marquess of Carisbrooke, Victoria Eugenie, Queen of Spain, Lord Leopold Mountbatten, Prince Maurice of Battenberg", "*Prince Maurice of Battenberg (1891–1914). Killed in action in World War I at the age of 23. Maurice's haemophilia is disputed by various sources: It seems unlikely that a known haemophiliac would be allowed to serve in combat."]}, {"page": "Infante Gonzalo of Spain", "response": ["Gonzalo was born in Madrid. He was baptized with the names Gonzalo Manuel María Bernardo Narciso Alfonso Mauricio.  He received his final name in honor of his uncle, Prince Maurice of Battenberg, who was killed in World War I shortly before Gonzalo's baptism. The infante was educated privately. Because he inherited the genetic disorder hemophilia from his mother's family (a fact not widely known in Spain during his life), he suffered some ill health, although he was an active sportsman. He held the rank of a private in the Engineering Corps of the Spanish Army. In 1927 he was made the 1,166th Knight of the Spanish branch of the Order of the Golden Fleece."]}, {"page": "Burial places of British royalty", "response": ["|Prince Maurice of Battenberg (1914)"]}, {"page": "Lockers Park School", "response": ["*Prince Maurice of Battenberg, a member of the Hesse aristocracy"]}, {"page": "Ypres Town Commonwealth War Graves Commission Cemetery and Extension", "response": ["* Prince Maurice of Battenberg, a grandson of Queen Victoria, is buried in the town cemetery.", "Image:HH Maurice Battenberg in Ypres Town cemetery.jpg|Grave of Prince Maurice of Battenberg"]}, {"page": "Prince maurice of battenberg", "response": ["#REDIRECT Prince Maurice of Battenberg "]}, {"page": "Descendants of Queen Victoria", "response": ["Victoria and Albert had 20 grandsons and 22 granddaughters, two of whom (the youngest sons of Prince Alfred and Princess Helena) were stillborn, and two more (Prince Alexander John of Wales and Prince Harald of Schleswig-Holstein) died shortly after birth. Their first grandchild was the future German Emperor Wilhelm II, who was born to their eldest child, Princess Victoria, on 27 January 1859; the youngest was Prince Maurice of Battenberg, born on 3 October 1891 to Princess Beatrice (1857–1944), who was herself the last child born to Victoria and Albert and the last child to die. The last of Victoria and Albert's grandchildren to die (almost exactly 80 years after Queen Victoria herself) was Princess Alice, Countess of Athlone (25 February 1883 – 3 January 1981).", "| 80px ||Prince Maurice of Battenberg||align=center|Balmoral Castle, Aberdeenshire, Scotland||align=center|Zonnebeke, Flanders, Belgium||Killed in action during World War I. He was the last grandchild of Queen Victoria and Prince Albert."]}, {"page": "1914", "response": ["* October 27 – Prince Maurice of Battenberg (b. 1891)"]}, {"page": "Maurice Mountbatten", "response": ["#REDIRECT Prince Maurice of Battenberg"]}, {"page": "Prince Maurice of Battenberg, KCVO", "response": ["#REDIRECT Prince Maurice of Battenberg"]}, {"page": "State funeral of Edward VII", "response": ["*Prince Maurice of Battenberg, the late king's nephew"]}, {"page": "Diamond Jubilee of Queen Victoria", "response": ["*** Prince Maurice of Battenberg, the Queen's grandson"]}]}}