{"wiki_id": "http://www.wikidata.org/entity/Q2369237", "itemLabel": "Jeremy Bulloch", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeremy_Bulloch", "wikipedia_page": {"main": "Jeremy Andrew Bulloch (16 February 1945 – 17 December 2020) was an English actor. In a career that spanned more than six decades, he gained recognition for originating the physical portrayal of Boba Fett in the Star Wars franchise, appearing as the character in the films The Empire Strikes Back (1980) and Return of the Jedi (1983). Bulloch returned to the franchise for a cameo as Captain Colton in 2005's Revenge of the Sith.", "link_mentions": [{"page": "Return of the Jedi", "response": ["Denis Lawson reprises his role as Wedge Antilles, an X-wing pilot in the Rebellion, from the previous two films. Kenneth Colley and Jeremy Bulloch reprise their roles from The Empire Strikes Back as Admiral Piett, the commander of Darth Vader's flagship, the Executor, and bounty hunter Boba Fett, respectively. Michael Pennington portrays Moff Jerjerrod, the commander of the second Death Star. Warwick Davis appears as Wicket W. Warrick, an Ewok who befriends Leia and leads her and her friends to the Ewok tribe. Baker was originally cast as Wicket, but was replaced by Davis after falling ill with food poisoning on the morning of the shoot. Davis had no previous acting experience and was cast only after his grandmother had discovered an open call for dwarfs for the new Star Wars film. Caroline Blakiston portrays Mon Mothma, a co-founder and leader of the Rebel Alliance. Michael Carter plays Jabba the Hutt's aide, Bib Fortuna (voiced by Erik Bauersfeld), while Femi Taylor and Claire Davenport appear as Jabba's original slave dancers."]}, {"page": "Princess Leia", "response": ["In The Empire Strikes Back (1980), Leia is at the Rebel base on Hoth. She leads its evacuation during an Imperial attack, and then flees with Han, Chewbacca (Peter Mayhew) and C-3PO (Anthony Daniels) on the Millennium Falcon. They dodge pursuing Imperial TIE fighters by flying into an asteroid field when the Falcon hyperdrive breaks down, with Leia piloting the ship at one point. Romance blossoms between Leia and Han during their flight from the Empire; while hiding in the stomach of a space slug, they finally share a kiss. With his ship needing repairs, Han seeks out his old friend Lando Calrissian (Billy Dee Williams) in Cloud City, the floating city over Bespin. Though he welcomes them graciously, Lando soon turns them over to a newly arrived Darth Vader, who hopes to use them as bait to capture Luke. Leia confesses her love for Han as he is frozen in carbonite and then handed over to bounty hunter Boba Fett (portrayed by Jeremy Bulloch, voiced by Jason Wingreen), who is charged with bringing him to the crime lord Jabba the Hutt. Lando helps Leia, Chewbacca and the two droids escape. Leia senses that Luke is in trouble, and goes back to save him after he is nearly killed during a lightsaber duel and confrontation with Vader."]}, {"page": "Lando Calrissian", "response": ["Lando Calrissian first appears in The Empire Strikes Back as the administrator of Cloud City, an old friend of Han Solo (Harrison Ford), and the previous owner of Han's ship, the Millennium Falcon. When Han, Princess Leia (Carrie Fisher), Chewbacca (Peter Mayhew), and C-3PO (Anthony Daniels) arrive at Cloud City, Lando welcomes them as guests of honor - only to betray them to Darth Vader (portrayed by David Prowse, voiced by James Earl Jones), who plans to use them as bait to ensnare Luke Skywalker (Mark Hamill). Lando had reluctantly agreed to betray Han and company after Vader threatened to put Cloud City under the Galactic Empire's control if he refused. Lando allows Vader to freeze Han in carbonite and give him to bounty hunter Boba Fett (Jeremy Bulloch); when Vader takes Leia and Chewbacca prisoner, however, Lando's conscience gets the better of him, and in the ensuing evacuation of Cloud City he helps them escape in the Falcon. He later assists in rescuing Luke from the underside of Cloud City. Afterwards, he promises to help find Han."]}, {"page": "Boba Fett", "response": ["Boba Fett () is a fictional character in the Star Wars franchise. He is an armored bounty hunter featured in both the original and prequel film trilogies, although he first appeared in the Star Wars Holiday Special (1978), voiced by Don Francks. In the original trilogy, the character is a supporting antagonist and was mainly portrayed by Jeremy Bulloch and voiced by Jason Wingreen. Notable for his taciturn demeanor and for never removing his helmet, Fett appears in both The Empire Strikes Back (1980), employed by the Galactic Empire, and Return of the Jedi (1983), serving the crime lord Jabba the Hutt. While seemingly killed in Return of the Jedi after falling into a sarlacc, he has since appeared in Star Wars media set after the film, confirming his survival. A preteen Boba is portrayed by Daniel Logan in the prequel film Attack of the Clones (2002), which reveals the character's origins as the genetic clone and adoptive son of Jango Fett, also a famous bounty hunter.", "Boba Fett is primarily played by Jeremy Bulloch in The Empire Strikes Back and Return of the Jedi. Bulloch's half-brother alerted him to the role. He was cast as Fett because the costume happened to fit \"as if a Savile Row tailor had come out and made it\"; he did not have to do a reading or screen test, and Bulloch never worked from a script for either film."]}, {"page": "Darth Vader", "response": ["In The Empire Strikes Back, Vader becomes obsessed with finding the Force-sensitive Luke and leads his stormtroopers to attack on the Rebel base on Hoth, but the Rebels escape. While conversing with the Emperor (Ian McDiarmid) via hologram, Vader convinces him that Luke would be a valuable ally if he could be turned to the dark side. Vader hires a group of bounty hunters to follow Luke's friends, and negotiates with Bespin administrator Lando Calrissian (Billy Dee Williams) to set a trap for them to bait Luke. After Han, Leia, Chewbacca (Peter Mayhew), and C-3PO (Anthony Daniels) arrive, Vader tortures and freezes Han in carbonite and gives him to the bounty hunter Boba Fett (Jeremy Bulloch). When Luke arrives, Vader overpowers him in a lightsaber duel, severing his hand. Vader tells Luke that he is his father, and tries to persuade him to join the dark side and help him overthrow the Emperor. Horrified, Luke escapes through an air shaft. Vader telepathically tells Luke that it is his destiny to join the dark side."]}, {"page": "The Empire Strikes Back", "response": ["The Empire's forces include Admiral Piett (Kenneth Colley), Admiral Ozzel (Michael Sheard), General Veers (Julian Glover), and Captain Needa (Michael Culver). The Emperor is voiced by Clive Revill and portrayed physically by Elaine Baker. Other cast includes Jeremy Bulloch as the bounty hunter Boba Fett (voiced by Jason Wingreen, who remained uncredited until 2000); other bounty hunters include Dengar (portrayed by Morris Bush) and humanoid lizard Bossk (Alan Harris).", "Jeremy Bulloch did not audition for Boba Fett; he was hired because the costume fit him. It was uncomfortable and top-heavy, making it difficult to maintain his balance, and the mask often steamed up. Bulloch assumed his lines would be dubbed over as he had little dialogue. Fett's voice actor, Jason Wingreen, remained uncredited until 2000. Bulloch also appears as an Imperial officer who restrains Leia on Bespin. There was no other cast member available for the role, so Kurtz had him quickly change out of the Fett costume to stand in. John Morton portrays Fett in the same scene. There was no extensive casting for the Emperor. Lucas chose Clive Revill to provide the character's voice, preferring it from the options given to him, while an older actress, Marjorie Eaton, physically portrayed the Emperor in test footage. The footage proved unsatisfactory, and special effects artist Rick Baker created a full mask that was worn by his wife Elaine. Chimpanzee eyes were superimposed over her face; cat eyes and assistant accountant Laura Crockett's were also considered."]}, {"page": "Star Wars: Episode III – Revenge of the Sith", "response": ["Peter Mayhew, Oliver Ford Davies, Ahmed Best, and Silas Carson reprise their roles as Chewbacca, Sio Bibble, Jar Jar Binks, and Nute Gunray and Ki-Adi-Mundi, respectively, from the previous films. Joel Edgerton and Bonnie Piesse also make cameo appearances, reprising their roles as Owen and Beru Lars respectively from Attack of the Clones. Sound engineer Matthew Wood provides the voice of General Grievous, the fearsome cyborg commander of the Separatists' droid army. Temuera Morrison portrays Commander Cody and the rest of the clone troopers. Bruce Spence portrays Tion Medon, local administrator of Utapau. Jeremy Bulloch (who played Boba Fett in The Empire Strikes Back and Return of the Jedi) appears as Captain Colton, the pilot of the Rebel Blockade Runner Tantive IV. Genevieve O'Reilly portrays senator Mon Mothma, though her speaking scene was ultimately cut. Rohan Nichol portrays Captain Raymus Antilles."]}, {"page": "C-3PO", "response": ["With the help of the city's administrator, Lando Calrissian (Billy Dee Williams), Princess Leia, Chewbacca, and C-3PO escape the city. Having C-3PO on Chewbacca's back proves to be beneficial, in that when Boba Fett (Jeremy Bulloch) escapes the city with a frozen Han, C-3PO notifies them of pursuing stormtroopers. While escaping Vader's flagship Executor, R2-D2 begins repairing C-3PO. Upon making their way to the Rebel's rendezvous point, C-3PO is fully repaired."]}, {"page": "The Newcomers (TV series)", "response": ["* Jeremy Bulloch as Phillip Cooper"]}, {"page": "1997 in film", "response": ["| The Empire Strikes Back (Special Edition) || 20th Century Fox / Lucasfilm || Irvin Kershner (director); Leigh Brackett, Lawrence Kasdan (screenplay); Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, David Prowse, James Earl Jones, Anthony Daniels, Kenny Baker, Peter Mayhew, Frank Oz, Alec Guinness, Jeremy Bulloch, John Hollis,  Jack Purvis, Clive Revill, Kenneth Colley, Julian Glover, Michael Sheard, Michael Culver, Bruce Boa, Christopher Malcolm, Denis Lawson, Richard Oldfield, John Morton, Ian Liston, John Ratzenberger, Brigitte Kahn, Bob Anderson, Richard Bonehill, Tony Clarkin, Peter Diamond, Marjorie Eaton, Mike Edmonds, Stuart Fell, Joe Johnston, Ralph McQuarrie, Treat Williams, Jason Wingreen || Sci-Fi, Fantasy || Live action", "| Return of the Jedi (Special Edition) || 20th Century Fox / Lucasfilm || Richard Marquand (director); Lawrence Kasdan, George Lucas (screenplay); Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Anthony Daniels, David Prowse, James Earl Jones, Ian McDiarmid, Kenny Baker, Peter Mayhew, Frank Oz, Alec Guinness, Sebastian Shaw, Michael Pennington, Kenneth Colley, Michael Carter, Denis Lawson, Tim Rose, Dermot Crowley, Caroline Blakiston, Warwick Davis, Jeremy Bulloch, Femi Taylor, Annie Arbogast, Jack Purvis, Mike Edmonds, Jane Busby, Nicki Reade, Debbie Lee Carrington, Sadie Corre, Tony Cox, Phil Fondacaro, Ben Burtt, Richard Marquand, Mike Quinn, Deep Roy, Phil Tippett, Larry Ward, Robert Watts || Sci-Fi, Fantasy || Live action"]}, {"page": "1983 in film", "response": ["| Return of the Jedi || 20th Century Fox / Lucasfilm || Richard Marquand (director); Lawrence Kasdan, George Lucas (screenplay); Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Anthony Daniels, David Prowse, James Earl Jones, Ian McDiarmid, Kenny Baker, Peter Mayhew, Frank Oz, Alec Guinness, Sebastian Shaw, Michael Pennington, Kenneth Colley, Michael Carter, Denis Lawson, Tim Rose, Dermot Crowley, Caroline Blakiston, Warwick Davis, Jeremy Bulloch, Femi Taylor, Annie Arbogast, Jack Purvis, Mike Edmonds, Jane Busby, Nicki Reade, Debbie Carrington, Sadie Corre, Tony Cox, Phil Fondacaro, Ben Burtt, Richard Marquand, Mike Quinn, Deep Roy, Phil Tippett, Larry Ward, Robert Watts || Sci-Fi, Fantasy || Live action "]}, {"page": "1980 in film", "response": ["| The Empire Strikes Back || 20th Century Fox / Lucasfilm || Irvin Kershner (director); Leigh Brackett, Lawrence Kasdan (screenplay); Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, David Prowse, James Earl Jones, Anthony Daniels, Kenny Baker, Peter Mayhew, Frank Oz, Alec Guinness, Jeremy Bulloch, John Hollis, Jack Purvis, Clive Revill, Kenneth Colley, Julian Glover, Michael Sheard, Michael Culver, Bruce Boa, Christopher Malcolm, Denis Lawson, Richard Oldfield, John Morton, Ian Liston, John Ratzenberger, Brigitte Kahn, Bob Anderson, Richard Bonehill, Tony Clarkin, Peter Diamond, Marjorie Eaton, Mike Edmonds, Stuart Fell, Joe Johnston, Ralph McQuarrie, Treat Williams, Jason Wingreen || Sci-Fi, Fantasy || Live action"]}, {"page": "1945 in film", "response": ["*February 16 – Jeremy Bulloch, English actor (died 2020)"]}, {"page": "Star Wars Holiday Special", "response": ["*The 2002 Attack of the Clones web documentary \"Bucket Head\" features segments of the cartoon, introduced by Jeremy Bulloch, who portrayed Fett in the original trilogy."]}, {"page": "BBC Television Shakespeare", "response": ["Almost immediately, however, the concept for the historical octology ran into trouble. Messina had wanted to shoot the eight sequential history plays in chronological order of the events they depicted, with linked casting and the same director for all eight adaptations (David Giles), with the sequence spread out over the entire six season run. During the early planning stages for King Richard the Second and The First Part of King Henry the Fourth however, the plan for linked casting fell apart, when it was discovered that although Jon Finch (Henry Bolingbroke in Richard) could return as Henry IV, Jeremy Bulloch as Hotspur and David Swift as the Earl of Northumberland were unable to do so, and the parts would have to be recast, thus undermining the concept of shooting the plays as one sequence. Ultimately, during the first season, King Richard the Second, although still directed by Giles, was treated as a stand-alone piece, whilst The First Part of King Henry the Fourth, The Second Part of King Henry the Fourth and The Life of Henry the Fift (all also directed by Giles) were treated as a trilogy during the second season, with linked casting between them. Additionally, in an attempt to establish a connection with the first season's Richard, Jon Finch returned as Henry IV, and The First Part of King Henry the Fourth opened with the murder of Richard from the previous play. The second set of four plays were then directed by Jane Howell as one unit, with a common set and linked casting, airing during the fifth season."]}, {"page": "Mary, Queen of Scots (1971 film)", "response": ["* Jeremy Bulloch as Andrew"]}, {"page": "Robin of Sherwood", "response": ["* Edward of Wickham (Jeremy Bulloch)The headman of the village of Wickham, he and all of the villagers are sympathetic to Robin Hood's band and assist them occasionally.", "| colspan=\"3\" | Gemma Craven as Lilith, Jeremy Bulloch as Edward of Wickham", "| colspan=\"5\" | Robert Daws as Hubert de Giscard, Jeremy Bulloch as Edward of Wickham, Robbie Bulloch as Matthew, Steve Dent and Mark Lewis as Arabs, Graeme Crowther as Robin Hood (uncredited)"]}, {"page": "List of Star Wars characters", "response": ["|Jeremy Bulloch (Revenge of the Sith)", "|Jeremy Bulloch (The Empire Strikes Back and Return of the Jedi), Daniel Logan (Attack of the Clones), Temuera Morrison (The Mandalorian, The Book of Boba Fett)Voice: Jason Wingreen (The Empire Strikes Back), Temuera Morrison (The Empire Strikes Back [Special Edition]), Daniel Logan (The Clone Wars)"]}, {"page": "O Lucky Man!", "response": ["* Jeremy Bulloch as Crash victim / Experimental patient / Sign guy"]}, {"page": "List of Star Wars weapons", "response": ["Many individual characters are seen or described as using rockets and missiles in the Star Wars universe. The bounty hunter Jango Fett (Temuera Morrison) wears a jet pack which can fire an anti-vehicle homing missile, which he uses against Obi-Wan Kenobi in their duel on Kamino in Attack of the Clones.Luceno, et al. (2018), p. 108Barr, et al. (2019), p. 267 Boba Fett (Jeremy Bulloch) also wears a jet pack which can fire either a homing missile or grappling hook, and carries a wrist-mounted mini concussion rocket launcher which can fire a variety of small homing rockets.Luceno, et al. (2018), p. 210Barr, et al. (2019), p. 281"]}, {"page": "Octopussy", "response": ["Other actors in smaller roles include Andy Bradford as MI6 agent 009, Dermot Crowley as Lieutenant Kamp, Orlov's nuclear weapons expert; Peter Porteous as Lenkin, the Kremlin art expert; Eva Rueber-Staier as Rublevitch, Gogol's secretary; Jeremy Bulloch as Smithers, Q's assistant; and Richard LeParmentier as General Peterson's aide. Ingrid Pitt has an uncredited voice cameo as Octopussy's galley mistress. "]}, {"page": "Billy Bunter", "response": ["Billy Bunter was played by Gerald CampionReport of Gerald Campion's passing: ComicsUK.co.uk website. Retrieved 4 October 2007 in the BBC television series Billy Bunter of Greyfriars School.  The series also featured Anthony Valentine as Harry Wharton, Michael Crawford as Frank Nugent, Jeremy Bulloch as Bob Cherry, Melvyn Hayes as Harold Skinner, John Woodnutt, Raf De La Torre, Kynaston Reeves and Jack Melford as Mr Quelch, Roger Delgado as Monsieur Charpentier and Kenneth Cope as school bully Gerald Loder."]}, {"page": "Man with No Name", "response": ["* Boba Fett, an antagonist from George Lucas' Star Wars film series, was based on the Man with No Name, according to Jeremy Bulloch, the actor who portrayed him, from his mannerisms to his green-on-white armor that has the same color scheme as the Man's poncho."]}, {"page": "Theatre 625", "response": ["|Sonia Fraser,Stanley Meadows,Margery Mason,John Allison,John Harvey,Stella Tanner,Hilda Kriseman,Patrick O'Connell,Jeremy Bulloch,Jack Wild"]}, {"page": "CONvergence", "response": ["|Jeremy Bulloch"]}, {"page": "David Prowse", "response": ["Prowse played a cameo role in the Star Wars fan films \"Order of the Sith: Vengeance\" and its sequel \"Downfall\" – Order of the Sith, alongside Jeremy Bulloch and Michael Sheard. These fan films were made in Britain in support of the charity Save the Children."]}, {"page": "Changes in Star Wars re-releases", "response": ["The scene in which Jabba feeds the dancer Oola to his rancor opens with a performance by the Max Rebo Band and its lead singer, Sy Snootles. In the original theatrical release, the song is \"Lapti Nek\", sung in the fictional language Huttese. The Special Edition changed the performance to the new song \"Jedi Rocks\", which mostly received negative criticism. Polygons Owen Good describes the new vocals as difficult to listen to and having \"the volume and vocal fry of a higher pitched Tina Turner but none of the soul\". The puppet used for Snootles was also replaced with CGI. According to Special Edition producer Rick McCallum, this change was made because Lucas could not originally achieve the \"large musical number\" he envisioned because characters could not move in certain ways; Snootles could not open her mouth to lip sync correctly, and her eyes did not move. The Special Edition increased the size of the Max Rebo Band from three members to twelve. Additional footage was filmed of Boba Fett flirting with one of the dancers; original Fett actor Jeremy Bulloch thought this was somewhat contrary to the character's nature."]}, {"page": "List of James Bond allies", "response": ["One of Q's assistants, Smithers makes two film appearances: in For Your Eyes Only and Octopussy.  He is played by Jeremy Bulloch. He is a distinct character from Colonel Smithers, a Bank of England official whom Bond consults in the novel Goldfinger and its film version."]}, {"page": "The Time Warrior", "response": ["Holmes was initially commissioned to novelise his own story, but wrote only the book's prologue, sending it to Dicks with a note telling him to finish the rest himself.  Holmes was not credited for his contribution. An unabridged reading of the Target novel was released by BBC audio on CD in February 2009. It is read by Jeremy Bulloch who played Hal the archer in the TV story."]}, {"page": "Summer Holiday (1963 film)", "response": ["The cast stars Lauri Peters, David Kossoff, Ron Moody and The Shadows and features Melvyn Hayes, Teddy Green, Jeremy Bulloch, Una Stubbs, Pamela Hart, Jacqueline Daryl, Madge Ryan, Lionel Murton, Christine Lawson, Wendy Barry and Nicholas Phipps.  ", "*Jeremy Bulloch Edwin"]}, {"page": "Funday PawPet Show", "response": ["The Funday PawPet Show had many episodes with unusual or memorable topics. Frequently, themed shows celebrate major holidays such as Christmas, New Year's, Halloween, Valentine's Day, Thanksgiving, the Fourth of July, and Christmas in July. On many occasions, the cast went out to various sites to film sequences. Some of the most notable of these shows include trips to conventions such as Fx and MegaCon to interview many of the guest celebrities. The cast did interviews with the actors from the 1971 film Willy Wonka & the Chocolate Factory. In that show, \"Mutt\" kept getting thrown from one star to the next for asking them \"stupid questions\". Other celebrities interviewed on the show include: Jason Marsden (Max Goof from A Goofy Movie), Jay North (Dennis the Menace), Jeremy Bulloch (Boba Fett from Star Wars), and Noel MacNeal (Bear from Bear in the Big Blue House). The show also had \"bumpers\" or intros done by various individuals including the a cappella group Toxic Audio."]}, {"page": "MegaCon", "response": ["| March 12–14, 2010 || Marv Wolfman, George Pérez, Lea Thompson, Claudia Wells, Nichelle Nichols, Jeremy Bulloch, and Peter Mayhew ||  || ", "| March 15–17, 2013 || Media guests included the entire Star Trek: The Next Generation cast: Sir Patrick Stewart, Jonathan Frakes, Brent Spiner, LeVar Burton, Michael Dorn, Marina Sirtis, Gates McFadden, Denise Crosby, John De Lancie and Wil Wheaton, and Daniel Stewart; other guests included: Lou Ferigno, David Prowse, Jeremy Bulloch, Paul Blake, Vic Mignogna, Tara Strong, Morgan Gendel, Arne Starr, Dean Cain, Larry Nemecek, Gigi Edgley, and James and Oliver Phelps. Comic book guests included: Ed McGuinness, Mark Bagley, Frank Cho, Bob Layton, Mike Perkins, Michael Lark, Neal Adams, Mark Waid, Chris Claremont, Mike Choi, Andrew Robinson, Steve Epting, Andy Price, Doug Sneyd, José Delbo, Matteo Scalera, Steve McNiven, Michael Atiyeh, Jimmy Cheung, George Pérez, Gail Simone, Mike McKone, Dave Johnson, Dan Panosian, Brian Pulido, Brandon Peterson, Amanda Conner, Jimmy Palmiotti, Billy Tucci, Georges Jeanty, Tim Townsend, Frenchy and the Punk and Craig Boldman || West Concourse Halls D-E || "]}, {"page": "Michael Sheard", "response": ["In February 2005, he played a small cameo role as the narrator in Star Wars the UK fan film Order of the Sith: Vengeance and its sequel Downfall - Order of the Sith, alongside Jeremy Bulloch and David Prowse. These British fan films were made in support of Save the Children."]}, {"page": "Frazer Hines", "response": ["Because of this success, Hines began attending Corona Theatre School in London where his fellow classmates included Richard O'Sullivan, Dennis Waterman, Jeremy Bulloch and Francesca Annis. Making his debut in the film John and Julie (1955) as an extra in a crowd scene, Hines went on to have minor roles in a number of films including  One Good Turn (1955) and The Woman for Joe (1955) before playing speaking parts in Moby Dick, The Weapon and X the Unknown (all 1956). Hines' breakthrough role however was in 1957 where he performed the role of Napoleon in a six-part television adaptation of John Buchan's 1922 novel Huntingtower. That same year, Hines appeared alongside Charlie Chaplin in the film A King in New York. From 1957 and throughout the 1960s, he performed a steady stream of roles in various television series, such as Jan in The Silver Sword (1957–58), Tim Birch in Emergency – Ward 10 (1963–64), and Roger Wain in Coronation Street (1965). He appeared in a 1964 serial, Smuggler's Bay, with Patrick Troughton.  With a well-established career in television, Hines appeared in feature films less frequently, however he did appear in Tunes of Glory (1960) with Alec Guinness, I Could Go On Singing (1963) with Judy Garland and the James Bond film You Only Live Twice (1967)."]}, {"page": "The Space Museum", "response": ["The script for the third episode was structured to omit the Doctor, as William Hartnell was scheduled to take a week's holiday. For the second episode, despite being in poor health, Hartnell insisted that Jeremy Bulloch grab him roughly to make the kidnap sequence look authentic. Maureen O'Brien felt uneasy working with Pinfield due to his old-fashioned approach, feeling that he did not provide sufficient direction to the cast. The Moroks were named for their moronic behaviour, and the name of their leader Lobos is derived from the word \"lobotomy\". The Xeron actors wore fake eyebrows, with make-up covering their own eyebrows; the fake eyebrows often fell off."]}, {"page": "Starhyke", "response": ["Starhyke began production in October 2004 and starred Claudia Christian of Babylon 5 and Jeremy Bulloch from Star Wars. In 2007, the producers aimed to complete post-production, and in March 2008 it was announced that this process was now finished. However, a later post on the official site stated that post-production would be completed at the end of September 2008, and that there was a private screening of all six episodes in Bristol, UK in November 2008.", "* Jeremy Bulloch as Doctor Yul Striker"]}, {"page": "Play of the Month", "response": ["|George Baker,Jeremy Bulloch,Timothy Dalton,Geraldine McEwan,Clive Revill"]}, {"page": "Jason Wingreen", "response": ["Wingreen lent his voice to the bounty hunter Boba Fett (portrayed by Jeremy Bulloch) in the 1980 sequel to Star Wars, The Empire Strikes Back. For the DVD release of the film in 2004, Wingreen's voice was replaced by New Zealand actor Temuera Morrison in continuity with the 2002 prequel Star Wars: Episode II – Attack of the Clones in which the character is revealed to be a clone of Morrison's Jango Fett who acts as Boba's father.", "Wingreen died at the age of 95 at his home in Los Angeles, California, on December 25, 2015. Jeremy Bulloch, who physically portrayed Boba Fett, paid tribute saying that \"he will be sadly missed by his family, friends and all the Star Wars fans.\""]}, {"page": "Comic Book: The Movie", "response": ["* Jeremy Bulloch"]}, {"page": "John Morton (actor)", "response": ["John Fass Morton (born March 26, 1947) is an American actor, stuntman and writer. He is known for playing Boba Fett in The Empire Strikes Back, acting as a double to Jeremy Bulloch.", "Morton appeared in A Bridge Too Far (1977), in the 1980 hit sequel film Superman II as an astronaut named Nate, and also that year he appeared in Flash Gordon. He was featured in the BBC television series Oppenheimer (1980). He portrayed Dak Ralter, Luke Skywalker's gunner during the Battle of Hoth in The Empire Strikes Back. When Jeremy Bulloch played an Imperial Officer, he needed someone to cover for him as Boba Fett. Being similar in height, Morton was a body double for two days in costume. He filmed with another unit, the sequence when Fett confronts Darth Vader in the Bespin hallway during Han Solo's torture, while Bulloch filmed his scenes as the Imperial Officer. Afterwards, he left Hollywood and eventually settled in public relations work back in Annapolis. He is also an accomplished musician (guitar player) and a writer (Backstory in Blue, 2008)."]}, {"page": "Return of the Ewok", "response": ["*Jeremy Bulloch as Boba Fett"]}, {"page": "FedCon", "response": ["| Richard Dean Anderson – Scott Bakula - Robert Duncan McNeill – Lance Henriksen – Wil Wheaton – Paul McGillion – Marina Sirtis – Jeremy Bulloch – Daniel Logan – Nicole de Boer – Sean Maher – Bonnie Piesse – Dirk Benedict – Tony Amendola – Kate Hewlett – Arlene Martel – Kate Vernon – Carel Struycken – Hubert Zitt – Lieven Litaer – Garrett Wang "]}, {"page": "Richard LeParmentier", "response": ["LeParmentier had a minor role in Superman II with his then-wife Sarah Douglas and Terence Stamp (who later portrayed Supreme Chancellor Valorum in Star Wars: Episode I – The Phantom Menace). He also had roles in films such as Octopussy (1983), which also featured another Star Wars actor, Jeremy Bulloch and Who Framed Roger Rabbit (1988) as Lt. Santino. His last screen role was in 1992, and from 1988 his focus became largely writing and producing. He wrote for several British television series including The Bill and Boon, with his writing partner Paddy Fletcher. He founded the production company Three Rivers Productions in 2008. LeParmentier became a \"staple\" of the Star Wars and science-fiction convention circuit, and made a cameo appearance in an online commercial for the 2012 Xbox 360 video game Kinect Star Wars, which re-created his famous scene from Star Wars. At the time of his death, he was working on Motti Now, a parody of Apocalypse Now, featuring other Star Wars alumni such as Kenneth Colley, Jeremy Bulloch, Garrick Hagon and Jerome Blake."]}, {"page": "Hoffman (film)", "response": ["Hoffman is a 1970 British film directed by Alvin Rakoff and starring Peter Sellers, Sinéad Cusack, Ruth Dunning and Jeremy Bulloch. It is the tale of an older man (Sellers) who blackmails an attractive young woman (Cusack) into spending a week with him in his flat in London. His hope is that she will forget her crooked fiancé and fall in love with him instead.HOFFMAN", "* Tom Mitchell - \tJeremy Bulloch"]}]}}