{"wiki_id": "http://www.wikidata.org/entity/Q23611924", "itemLabel": "Thomas Espin", "itemDescription": "schoolmaster and mathematician, topographical artist, antiquary and amateur architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Espin", "wikipedia_page": {"main": "Thomas Espin  (1767–1822) was an English schoolmaster, mathematician, topographical artist, antiquary and amateur architect, who spent most of his life at Louth in Lincolnshire.", "link_mentions": [{"page": "Louth, Lincolnshire", "response": ["Louth Park Abbey was founded in 1139 by the Bishop Alexander of Lincoln as a daughter-house of the Cistercian Fountains Abbey in Yorkshire.David M. Smith, ‘Alexander (d. 1148)’, Oxford Dictionary of National Biography, Oxford University Press, 2004. Following its dissolution in 1536 it fell into ruin and, today, only earthworks survive, on private land, between Louth and Keddington. Some of the ruins were incorporated into The Priory (now a hotel) by Thomas Espin. Monks' Dyke, now a ditch, was originally dug to supply the abbey with water from the springs of Ashwell and St. Helen's at Louth."]}, {"page": "Louth Park Abbey", "response": ["In 1818, Thomas Espin designed the new town hall in Louth and was permitted to take the materials from the former building, in lieu of his fee, to construct his house The Priory, in the town. He was also allowed to take 'sculptural fragments' from the abbey ruins, which he combined with other medieval stonework, to create a folly beside his garden lake. One fragment is a Romananesque head with curled hair, an indication of a moustache and beard, possibly crowned with a diadem. The others are capitals, the topmost member of a column (or pilaster), and are variously decorated, often with leaves of different kinds."]}, {"page": "Espin, Thomas", "response": ["#redirectThomas Espin"]}, {"page": "Priory Hotel, Louth", "response": ["The Priory Hotel in Louth, Lincolnshire is a building of historical significance and is listed on the English Heritage Register. It is described as an accomplished example of an early 19th Century villa of fine quality.”English Heritage Register. Online reference It was built from 1812 to 1818 by Thomas Espin, a talented topographical artist and draughtsman, amateur architect and mathematician. It was the home of several prominent people over the next two centuries. Today it is a hotel which provides accommodation, restaurant facilities and caters for special events.", "left|thumb|200px|Thomas Espin", "Thomas Espin (1767-1822) built the house between 1812 and 1818. He was the son of Thomas Espin (1729-1810) of Bullington Abbey and Elizabeth Butler. He was educated at Wragby School and later became a Fellow of the Society of Antiquarians. In 1790 he was appointed Master of the Mapletoft School in Louth. The official name of the school was the Mathematical, Architectural, Nautical and Commercial Academy. He had some cards printed to advertise his school.Card for Thomas Espin's School. Online reference When Thomas finished building the Priory in 1818 the school was moved here."]}]}}