{"wiki_id": "http://www.wikidata.org/entity/Q236236", "itemLabel": "Oliver Goldsmith", "itemDescription": "Anglo-Irish writer, poet, and physician", "wikipedia_url": "https://en.wikipedia.org/wiki/Oliver_Goldsmith", "wikipedia_page": {"main": "Oliver Goldsmith (10 November 1728 – 4 April 1774) was an Anglo-Irish novelist, playwright and poet, who is best known for his novel The Vicar of Wakefield (1766), his pastoral poem The Deserted Village (1770), and his plays The Good-Natur'd Man (1768) and She Stoops to Conquer (1771, first performed in 1773). He is thought to have written the classic children's tale The History of Little Goody Two-Shoes (1765).", "link_mentions": [{"page": "Edwin Austin Abbey", "response": ["Abbey was born in Philadelphia in 1852. He studied art at the Pennsylvania Academy of the Fine Arts under Christian Schuessele. Abbey began as an illustrator, producing numerous illustrations and sketches for such magazines as Harper's Weekly (1871–1874) and Scribner's Magazine. His illustrations began appearing in Harper's Weekly before Abbey was twenty years old. He moved to New York City in 1871. His illustrations were strongly influenced by French and German black and white art. He also illustrated several best-selling books, including Christmas Stories by Charles Dickens (1875), Selections from the Poetry of Robert Herrick (1882), and She Stoops to Conquer by Oliver Goldsmith (1887). Abbey also illustrated a four-volume set of The Comedies of Shakespeare for Harper & Brothers in 1896."]}, {"page": "List of English-language poets", "response": ["*Oliver Goldsmith (1728–1774, Ir/E)", "*Oliver Goldsmith (1794–1861, C)"]}, {"page": "Epistolary novel", "response": ["Starting in the 18th century, the epistolary form was subject to much ridicule, resulting in a number of savage burlesques. The most notable example of these was Henry Fielding's Shamela (1741), written as a parody of Pamela. In it, the female narrator can be found wielding a pen and scribbling her diary entries under the most dramatic and unlikely of circumstances. Oliver Goldsmith used the form to satirical effect in The Citizen of the World, subtitled \"Letters from a Chinese Philosopher Residing in London to his Friends in the East\" (1760–61). So did the diarist Fanny Burney in a successful comic first novel, Evelina (1788)."]}, {"page": "Edmund Burke", "response": ["At about this time, Burke joined the circle of leading intellectuals and artists in London of whom Samuel Johnson was the central luminary. This circle also included David Garrick, Oliver Goldsmith and Joshua Reynolds. Edward Gibbon described Burke as \"the most eloquent and rational madman that I ever knew\".Private Letters of Edward Gibbon, II (1896) Prothero, P. (ed.). p. 251 cited in The Decline and Fall of the British Empire: 1781–1998 (2007) Brendon, Piers. Jonathan Cape, London. p. 10  Although Johnson admired Burke's brilliance, he found him a dishonest politician.Boswell, Life of Samuel Johnson, edited by Hill-Powell; v. II, p. 349; 7 April 1775Boswell, Journals, Boswell: The Ominous Years, p. 134, edited by Ryskamp & Pottle; McGraw Hill, 1963"]}, {"page": "Edward Gibbon", "response": ["After he tended to his father's estate—which was by no means in good condition— quite enough remained for Gibbon to settle fashionably in London at 7 Bentinck Street, free of financial concern. By February 1773, he was writing in earnest, but not without the occasional self-imposed distraction. He took to London society quite easily, joined the better social clubs, including Dr. Johnson's Literary Club, and looked in from time to time on his friend Holroyd in Sussex. He succeeded Oliver Goldsmith at the Royal Academy as 'professor in ancient history' (honorary but prestigious). In late 1774, he was initiated as a Freemason of the Premier Grand Lodge of England.i.e., in London's Lodge of Friendship No. 3. see Gibbon's freemasonry."]}, {"page": "Heroic couplet", "response": ["The term \"heroic couplet\" is sometimes reserved for couplets that are largely closed and self-contained, as opposed to the enjambed couplets of poets like John Donne. The heroic couplet is often identified with the English Baroque works of John Dryden and Alexander Pope, who used the form for their translations of the epics of Virgil and Homer, respectively. Major poems in the closed couplet, apart from the works of Dryden and Pope, are  Samuel Johnson's The Vanity of Human Wishes, Oliver Goldsmith's The Deserted Village, and John Keats's Lamia. The form was immensely popular in the 18th century. The looser type of couplet, with occasional enjambment, was one of the standard verse forms in medieval narrative poetry, largely because of the influence of the Canterbury Tales."]}, {"page": "Republic of Ireland", "response": ["Ireland has made a significant contribution to world literature in both the English and Irish languages. Modern Irish fiction began with the publishing of the 1726 novel Gulliver's Travels by Jonathan Swift. Other writers of importance during the 18th century and their most notable works include Laurence Sterne with the publication of The Life and Opinions of Tristram Shandy, Gentleman and Oliver Goldsmith's The Vicar of Wakefield. Numerous Irish novelists emerged during the 19th century, including Maria Edgeworth, John Banim, Gerald Griffin, Charles Kickham, William Carleton, George Moore, and Somerville and Ross. Bram Stoker is best known as the author of the 1897 novel Dracula.", "The history of Irish theatre begins with the expansion of the English administration in Dublin during the early 17th century, and since then, Ireland has significantly contributed to English drama. In its early history, theatrical productions in Ireland tended to serve political purposes, but as more theatres opened and the popular audience grew, a more diverse range of entertainments were staged. Many Dublin-based theatres developed links with their London equivalents, and British productions frequently found their way to the Irish stage. However, most Irish playwrights went abroad to establish themselves. In the 18th century, Oliver Goldsmith and Richard Brinsley Sheridan were two of the most successful playwrights on the London stage at that time. At the beginning of the 20th century, theatre companies dedicated to the staging of Irish plays and the development of writers, directors and performers began to emerge, which allowed many Irish playwrights to learn their trade and establish their reputations in Ireland rather than in Britain or the United States. Following in the tradition of acclaimed practitioners, principally Oscar Wilde, Literature Nobel Prize laureates George Bernard Shaw (1925) and Samuel Beckett (1969), playwrights such as Seán O'Casey, Brian Friel, Sebastian Barry, Brendan Behan, Conor McPherson and Billy Roche have gained popular success. Other Irish playwrights of the 20th century include Denis Johnston, Thomas Kilroy, Tom Murphy, Hugh Leonard, Frank McGuinness, and John B. Keane."]}, {"page": "Jane Austen", "response": ["Among these works are a satirical novel in letters titled Love and Freindship , written at age fourteen in 1790,Todd (2015), 5; Southam (1986), 252 in which she mocked popular novels of sensibility.Litz (1965), 21; Tomalin (1997), 47; Honan (1987), 73–74; Southam (1986), 248–249 The next year she wrote The History of England, a manuscript of thirty-four pages accompanied by thirteen watercolour miniatures by her sister, Cassandra. Austen's History parodied popular historical writing, particularly Oliver Goldsmith's History of England (1764).Honan (1987), 75 Honan speculates that not long after writing Love and Freindship, Austen decided to \"write for profit, to make stories her central effort\", that is, to become a professional writer. When she was around eighteen years old, Austen began to write longer, more sophisticated works.Honan (1987), 93", "Austen's works critique the sentimental novels of the second half of the 18th century and are part of the transition to 19th-century literary realism.Litz (1965), 3–14; Grundy (2014), 195–197; Waldron (2005), 83, 89–90; Duffy (1986), 93–94.  The earliest English novelists, Richardson, Henry Fielding and Tobias Smollett, were followed by the school of sentimentalists and romantics such as Walter Scott, Horace Walpole, Clara Reeve, Ann Radcliffe, and Oliver Goldsmith, whose style and genre Austen rejected, returning the novel on a \"slender thread\" to the tradition of Richardson and Fielding for a \"realistic study of manners\".Grundy (2014), 196 In the mid-20th century, literary critics F. R. Leavis and Ian Watt placed her in the tradition of Richardson and Fielding; both believe that she used their tradition of  \"irony, realism and satire to form an author superior to both\".Todd (2015), 21"]}, {"page": "Joshua Reynolds", "response": ["Reynolds worked long hours in his studio, rarely taking a holiday. He was gregarious and keenly intellectual, with many friends from London's intelligentsia, numbered amongst whom were Dr Samuel Johnson, Oliver Goldsmith, Edmund Burke, Giuseppe Baretti, Henry Thrale, David Garrick, and artist Angelica Kauffman. Johnson said in 1778: \"Reynolds is too much under [Charles James] Fox and Burke at present. He is under the Fox star and the Irish constellation [meaning Burke]. He is always under some planet\".James Boswell, Life of Johnson (Oxford: Oxford University Press, 2008), p. 923."]}, {"page": "Joseph Severn", "response": ["Severn also painted such works as Cordelia Watching by the Bed of Lear, Shepherds in the Campagna, Shelley Composing Prometheus Unbound, Isabella and the Pot of Basil, Portia with the Casket, Ariel, Rienzi, The Infant of the Apocalypse Saved from the Dragon, a large altarpiece for the church of San Paolo fuori le Mura at Rome, and many portraits of statesman and aristocrats, including Baron Bunsen and William Gladstone. The last picture he exhibited at the Royal Academy was a scene from Oliver Goldsmith's The Deserted Village in 1857."]}, {"page": "John Milton", "response": ["Before Milton, \"the sense of regular rhythm ... had been knocked into the English head so securely that it was part of their nature\".Saintsbury 1916 p. 101. The \"Heroick measure\", according to Samuel Johnson, \"is pure ... when the accent rests upon every second syllable through the whole line ... The repetition of this sound or percussion at equal times, is the most complete harmony of which a single verse is capable\".Johnson 1751 no. 86. Caesural pauses, most agreed, were best placed at the middle and the end of the line. In order to support this symmetry, lines were most often octo- or deca-syllabic, with no enjambed endings. To this schema Milton introduced modifications, which included hypermetrical syllables (trisyllabic feet), inversion or slighting of stresses, and the shifting of pauses to all parts of the line.Dexter 1922 p. 57. Milton deemed these features to be reflective of \"the transcendental union of order and freedom\".Saintsbury 1908 ii. 458–59. Admirers remained hesitant to adopt such departures from traditional metrical schemes: \"The English ... had been writing separate lines for so long that they could not rid themselves of the habit\".Dexter 1922 p. 59. Isaac Watts preferred his lines distinct from each other, as did Oliver Goldsmith, Henry Pemberton, and Scott of Amwell, whose general opinion it was that Milton's frequent omission of the initial unaccented foot was \"displeasing to a nice ear\".Saintsbury 1916 p. 114. It was not until the late 18th century that poets (beginning with Gray) began to appreciate \"the composition of Milton's harmony ... how he loved to vary his pauses, his measures, and his feet, which gives that enchanting air of freedom and wilderness to his versification\".Gray 1748 Observations on English Metre. By the 20th century, American poet and critic John Hollander would go so far as to say that Milton \"was able, by plying that most remarkable instrument of English meter ... to invent a new mode of image-making in English poetry.\""]}, {"page": "Mel Brooks", "response": ["Brooks then wrote an adaptation of Oliver Goldsmith's She Stoops to Conquer, but was unable to sell the idea to any studio and believed that his career was over. In 1972, he met agent David Begelman, who helped him set up a deal with Warner Brothers to hire Brooks (as well as Richard Pryor, Andrew Bergman, Norman Steinberg, and Al Uger) as a script doctor for an unproduced script called Tex-X. Eventually, Brooks was hired as director for what became Blazing Saddles (1974), his third film."]}, {"page": "November 10", "response": ["*1728 – Oliver Goldsmith, Irish-English author, poet, and playwright (d. 1774)"]}, {"page": "Pale Fire", "response": ["* Oliver Goldsmith"]}, {"page": "Stendhal", "response": ["Contemporary readers did not fully appreciate Stendhal's realistic style during the Romantic period in which he lived. He was not fully appreciated until the beginning of the 20th century. He dedicated his writing to \"the Happy Few\" (in English in the original). This can be interpreted as a reference to Canto 11 of Lord Byron's Don Juan, which refers to \"the thousand happy few\" who enjoy high society, or to the \"we few, we happy few, we band of brothers\" line of William Shakespeare's Henry V, but Stendhal's use more likely refers to The Vicar of Wakefield by Oliver Goldsmith, parts of which he had memorized in the course of teaching himself English."]}, {"page": "Thomas Gray", "response": ["Gray spent most of his life as a scholar in Cambridge, and only later in his life did he begin travelling again. Although he was one of the least productive poets (his collected works published during his lifetime amount to fewer than 1,000 lines), he is regarded as the foremost English-language poet of the mid-18th century. In 1757, he was offered the post of Poet Laureate, which he refused. Gray was so self-critical and fearful of failure that he published only thirteen poems during his lifetime. He once wrote that he feared his collected works would be \"mistaken for the works of a flea.\" Walpole said that \"He never wrote anything easily but things of Humour.\"Walpole, Letters, vi. 206 Gray came to be known as one of the \"Graveyard poets\" of the late 18th century, along with Oliver Goldsmith, William Cowper, and Christopher Smart. Gray perhaps knew these men, sharing ideas about death, mortality, and the finality and sublimity of death.", "* The Poems of Thomas Gray, William Collins, Oliver Goldsmith, ed. R. Lonsdale (1969; repr. 1976)"]}, {"page": "Washington Irving", "response": ["Washington Irving (April 3, 1783 – November 28, 1859) was an American short-story writer, essayist, biographer, historian, and diplomat of the early 19th century. He is best known for his short stories \"Rip Van Winkle\" (1819) and \"The Legend of Sleepy Hollow\" (1820), both of which appear in his collection The Sketch Book of Geoffrey Crayon, Gent. His historical works include biographies of Oliver Goldsmith, Muhammad and George Washington, as well as several histories of 15th-century Spain that deal with subjects such as Alhambra, Christopher Columbus and the Moors. Irving served as American ambassador to Spain in the 1840s.", "Irving returned from Spain in September 1846, took up residence at Sunnyside, and began work on an \"Author's Revised Edition\" of his works for publisher George Palmer Putnam. For its publication, Irving had made a deal which guaranteed him 12 percent of the retail price of all copies sold, an agreement that was unprecedented at that time.Jones, 464. As he revised his older works for Putnam, he continued to write regularly, publishing biographies of Oliver Goldsmith in 1849 and Islamic prophet Muhammad in 1850. In 1855, he produced Wolfert's Roost, a collection of stories and essays that he had written for The Knickerbocker and other publications,Williams, 2:208–209. and he began publishing a biography of his namesake George Washington which he expected to be his masterpiece. Five volumes of the biography were published between 1855 and 1859.Bryan, William Alfred. George Washington in American Literature 1775–1865. New York: Columbia University Press, 1952: 103.", "|The Life of Oliver Goldsmith"]}, {"page": "1728", "response": ["* November 10 – Oliver Goldsmith, Irish writer (d. 1774)"]}, {"page": "1774", "response": ["* April 4 – Oliver Goldsmith, Irish writer (b. 1728)"]}, {"page": "1773", "response": ["* March 15 – The popular (and enduring) comedy She Stoops to Conquer, by Irish playwright Oliver Goldsmith, is performed for the first time, premiering at London's Covent Garden Theatre."]}, {"page": "Albert Finney", "response": ["While at RADA Finney made an early TV appearance playing Mr Hardcastle in Oliver Goldsmith's She Stoops to Conquer. The BBC filmed and broadcast the RADA students' performances at the Vanbrugh Theatre in London on Friday 6 January 1956. Other members of the cast included Roy Kinnear and Richard Briers. Finney graduated from RADA and became a member of the Royal Shakespeare Company."]}, {"page": "Leonard Rossiter", "response": ["| Oliver Goldsmith"]}, {"page": "George Farquhar", "response": ["* In Act III of She Stoops to Conquer by Oliver Goldsmith, Kate Hardcastle asks her maid, \"Tell me, Pimple, how do you like my present dress?  Don't you think I look something like Cherry in the Beaux Stratagem?\" A theatrical notice in the New York Times for 7 February 1885 remarked that at that date Goldsmith's allusion was \"all that the stage [had] known of George Farquhar for many a year.\"\"Daly's Theatre\" in the New York Times for February 7, 1885, accessed on 19 December 2007"]}, {"page": "Betty Marsden", "response": ["Her theâtre roles included Mrs. Prentice in Joe Orton's What the Butler Saw at the Royal Court Theatre in 1975, and Mrs. Hardcastle in Oliver Goldsmith's She Stoops to Conquer at the Lyric Theatre, Hammersmith, in 1982."]}, {"page": "Children's literature", "response": ["The improvement in the quality of books for children and the diversity of topics he published helped make Newbery the leading producer of children's books in his time. He published his own books as well as those by authors such as Samuel Johnson and Oliver Goldsmith; the latter may have written The History of Little Goody Two-Shoes, Newbery's most popular book."]}, {"page": "Oliver Goldsmith", "response": ["Oliver Goldsmith (10 November 1728 – 4 April 1774) was an Anglo-Irish novelist, playwright and poet, who is best known for his novel The Vicar of Wakefield (1766), his pastoral poem The Deserted Village (1770), and his plays The Good-Natur'd Man (1768) and She Stoops to Conquer (1771, first performed in 1773). He is thought to have written the classic children's tale The History of Little Goody Two-Shoes (1765).", "His premature death in 1774 may have been partly due to his own misdiagnosis of his kidney infection. Goldsmith was buried in Temple Church in London. The inscription reads; \"HERE LIES/OLIVER GOLDSMITH\". A monument was originally raised to him at the site of his burial, but this was destroyed in an air raid in 1941. A monument to him survives in the centre of Ballymahon, also in Westminster Abbey with an epitaph written by Samuel Johnson.\"Oliver Goldsmith: A Poet, Naturalist, and Historian, who left scarcely any style of writing untouched, and touched nothing that he did not adorn. Of all the passions, whether smiles were to move or tears, a powerful yet gentle master. In genius, vivid, versatile, sublime. In style, clear, elevated, elegant.\" Epitaph written by Dr. Johnson, translated from the original Latin.", "Goldsmith wrote this romantic ballad of precisely 160 lines in 1765. The hero and heroine are Edwin, a youth without wealth or power, and Angelina, the daughter of a lord \"beside the Tyne\". Angelina spurns many wooers, but refuses to make plain her love for young Edwin. \"Quite dejected with my scorn\", Edwin disappears and becomes a hermit. One day, Angelina turns up at his cell in boy's clothes and, not recognising him, tells him her story. Edwin then reveals his true identity, and the lovers never part again. The poem is notable for its interesting portrayal of a hermit, who is fond of the natural world and his wilderness solitude but maintains a gentle, sympathetic demeanor toward other people. In keeping with eremitical tradition, however, Edwin the Hermit claims to \"spurn the [opposite] sex\". This poem appears under the title of \"A Ballad\" sung by the character of Mr. Burchell in Chapter 8 of Goldsmith's novel, The Vicar of Wakefield.Dyachok, Tatyana (2012). Oliver Goldsmith's works in the sociocultural context of the Enlightenment. Master's dissertation, Belarusian State University. pp. 341–342", "* The Complete Poetical Works of Oliver Goldsmith (1887), edited by Austin Dobson", "==Memorials concerning Oliver Goldsmith==", "* Goldsmith lived in Kingsbury, now in north-west London, between 1771 and 1774: Oliver Goldsmith Primary School, Goldsmith Lane, and Goldsmith Avenue there are named after him.", "* Goldsmith Road, the Oliver Goldsmith Estate and Oliver Goldsmith Primary School, all in Peckham, are named after him.Oliver Goldsmith Primary School website.", "* The Oliver Goldsmith Summer School is held every June Bank Holiday at Ballymahon with poetry and creative readings being held at Goldsmith's birthplace in nearby Pallas, Forgney.", "* A statue of him stands in a limestone cell at the ruin of his birthplace in Pallas, Forgney, Ballymahon, County Longford. The statue is a copy of the Foley statue that stands outside Trinity college, Dublin and is the focus point of the annual Oliver Goldsmith Summer School.", "* London Underground locomotive number 16 (used on the Metropolitan line of the London Underground until 1962) was named Oliver Goldsmith.", "* In 1870, Goldsmith Street in Phibsborough was renamed after Oliver Goldsmith", "* Goldsmith Street in the 'Poets' Corner' area of Elwood, Melbourne is named after Oliver Goldsmith.", "* Austin Dobson, Henry (Editor) The Complete Poetical Works of Oliver Goldsmith, ", "* Campbell, Gordon (ed.), Oliver Goldsmith (Everyman's Poetry Series), ", "* Connellan, J.A., Oliver Goldsmith of Elphin, Published for the Goldsmith Society (1935)", "* Forster, John, The life and times of Oliver Goldsmith, Published by: Ward, Lock and Co (London, New York, 1848)", "* Goldsmith, Oliver, The Letters of Oliver Goldsmith (Edited by Michael Griffin and David O'Shaughnessy) ", "* Irving, Washington, Life of Oliver Goldsmith, ", "* Oliver Goldsmith at the Eighteenth-Century Poetry Archive (ECPA)", "* Essays by Oliver Goldsmith at Quotidiana.org", "* Oliver Goldsmith: A Biography by Washington Irving from Project Gutenberg", "* Oliver Goldsmith Resource", "* Poems and essays, Oliver Goldsmith, 1839, (William Smith, London)"]}, {"page": "Amanita muscaria", "response": ["An account of the journeys of Philip von Strahlenberg to Siberia and his descriptions of the use of the mukhomor there was published in English in 1736. The drinking of urine of those who had consumed the mushroom was commented on by Anglo-Irish writer Oliver Goldsmith in his widely read 1762 novel, Citizen of the World.Letcher, p 122. The mushroom had been identified as the fly agaric by this time.Letcher, p 123. Other authors recorded the distortions of the size of perceived objects while intoxicated by the fungus, including naturalist Mordecai Cubitt Cooke in his books The Seven Sisters of Sleep and A Plain and Easy Account of British Fungi.Letcher, p 125. This observation is thought to have formed the basis of the effects of eating the mushroom in the 1865 popular story Alice's Adventures in Wonderland.Letcher, p 126. A hallucinogenic \"scarlet toadstool\" from Lappland is featured as a plot element in Charles Kingsley's 1866 novel Hereward the Wake based on the medieval figure of the same name.Letcher, p 127. Thomas Pynchon's 1973 novel Gravity's Rainbow describes the fungus as a \"relative of the poisonous Destroying angel\" and presents a detailed description of a character preparing a cookie bake mixture from harvested Amanita muscaria. Fly agaric shamanism is also explored in the 2003 novel Thursbitch by Alan Garner.Letcher, p 129."]}, {"page": "James Boswell", "response": ["These detailed and frank journals include voluminous notes on the Grand Tour of Europe that he took as a young man and, subsequently, of his tour of Scotland with Johnson. His journals also record meetings and conversations with eminent individuals belonging to The Club, including Lord Monboddo, David Garrick, Edmund Burke, Joshua Reynolds and Oliver Goldsmith."]}, {"page": "List of poets", "response": ["*Oliver Goldsmith (1730–1774), Anglo-Irish writer and poet"]}, {"page": "List of children's literature writers", "response": ["*Oliver Goldsmith (1730–1774) – The History of Little Goody Two-Shoes"]}, {"page": "List of Irish people", "response": ["* Oliver Goldsmith – novelist and dramatist"]}, {"page": "Lyric poetry", "response": ["Exceptions include the lyrics of Robert Burns, William Cowper, Thomas Gray, and Oliver Goldsmith. German lyric poets of the period include Johann Wolfgang von Goethe, Novalis, Friedrich Schiller, and Johann Heinrich Voß. Kobayashi Issa was a Japanese lyric poet during this period. In Diderot's Encyclopédie, Louis chevalier de Jaucourt described lyric poetry of the time as \"a type of poetry totally devoted to sentiment; that's its substance, its essential object\"."]}, {"page": "Canonbury", "response": ["*Canonbury Tower – The manor house of Canonbury was constructed by William Bolton of St Bartholomew's Priory between 1509 and 1532. At the Dissolution of the Monasteries it was granted to Thomas Cromwell. In the 1590s the manor house was rebuilt by Sir John Spencer, Lord Mayor of the City of London, including the construction of its tower. The tower has been occupied by many historical figures, including the philosopher and Lord Chancellor Francis Bacon, and the Irish novelist and playwright Oliver Goldsmith. The Tower Theatre Company was based here from 1953 to 2003. It is currently used as a Masonic research centre."]}, {"page": "Kingsbury, London", "response": ["Kingsbury developed little in housing and population in the 19th century, remaining a polyfocal village. In this age, Oliver Goldsmith, writer and playwright, lived at Hyde Farm, Kingsbury (1771–1774); the third Lord Mansfield was buried at St. Andrew's churchyard in 1840.", "Holy Innocents church is located on Kingsbury Road, next to Oliver Goldsmith Primary School and opposite the Silver Jubilee Park. Next to the park is a large mandir complex including offices that opened in 2014 and combines Indian architecture with eco friendly technology. The community of the mandir moved over from a previous site located in Golders Green.", "*Lorraine Silver, English singer known for her single \"Lost Summer Love\" (1965), which came to be regarded as a classic of Northern soul, went to Oliver Goldsmith Primary School.", "*Oliver Goldsmith Primary School"]}, {"page": "Streatham", "response": ["*Oliver Goldsmith, novelist, playwright and poet"]}, {"page": "Auburn, Alabama", "response": ["Auburn is a historic college town and is the home of Auburn University. It is Alabama's fastest-growing metropolitan area and the nineteenth fastest-growing metro area in the United States since 1990. U.S. News ranked Auburn among its top ten list of best places to live in the United States for the year 2009. The city's unofficial nickname is \"The Loveliest Village On The Plains,\" taken from a line in the poem The Deserted Village by Oliver Goldsmith: \"Sweet Auburn! Loveliest village of the plain...\""]}, {"page": "Auburn, Indiana", "response": ["Auburn's site on Cedar Creek was chosen by Wesley Park and John Badlam Howe at the intersection of two major trails, Goshen-Defiance Road and Coldwater Road, and next to the land of John Houlton.  The name for the community likely came from \"The Deserted Village\" by Oliver Goldsmith, that begins \"Sweet Auburn! Loveliest village of the plain.\"City Parks and Recreation   The plat of the Village of Auburn is dated April 21, 1836, but it was held by Howe and not recorded until March 12, 1879.  John Drury purchased the first lot (Lot 73) for $25.00 on September 5, 1837.  The first store was built at Park's corners by Thomas Freeman, applying for a license on March 5, 1838, and bringing supplies by horseback from Fort Wayne.  Daniel Altenburg, Levi Walsworth, the Sherlock family, Samuel Sprott, David Weave, David Shoemaker, Henry Curtis, Lyman Childsey, James Cosper, and David Cosper were early residents."]}, {"page": "Ashland, Natchitoches Parish, Louisiana", "response": ["Given the decline in population and changing business practices, no businesses except the convenience store in Bienville Parish operate in the 21st century in Ashland. In the 1950s, there were half a dozen. The Ashland Baptist Church, Village Hall, Masonic lodge hall, and Post Office remain the principal entities. The lack of business in 1979 compelled Welborn Ayres to equate Ashland with \"The Deserted Village\" of the Oliver Goldsmith poem."]}, {"page": "Auburn, Maine", "response": ["Auburn was first settled in 1786 as part of Bakerstown, renamed Poland when it was incorporated by the Massachusetts General Court in 1795. It was then part of Minot, formed from parts of Poland and incorporated in 1802. Auburn would itself be formed from parts of Minot and incorporated on February 24, 1842. The name was apparently inspired by \"Auburn\", a village (real or fictitious) featured in the 1770 poem \"The Deserted Village\" by Oliver Goldsmith. Originally part of Cumberland County, the town became county seat of Androscoggin County at its creation in 1854. By annexing land from towns around it, including part of Poland in 1852, Minot in 1873, and all of Danville (first called Pejepscot) in 1867, Auburn grew geographically into one of Maine's largest municipalities. Incorporated a city on February 22, 1869, Auburn in 1917 would be the first city in the state to adopt a council-manager form of government."]}]}}