{"wiki_id": "http://www.wikidata.org/entity/Q2363705", "itemLabel": "Patrick Duncan", "itemDescription": "South African politician (1870-1943)", "wikipedia_url": "https://en.wikipedia.org/wiki/Patrick_Duncan_(South_African_politician)", "wikipedia_page": {"main": "Sir Patrick Duncan,  (21 December 1870 – 17 July 1943) was the sixth Governor-General of the Union of South Africa, holding office from 1937 until his death in 1943.", "link_mentions": [{"page": "Transvaal Colony", "response": ["| Patrick Duncan", "| Patrick Duncan"]}, {"page": "Governor-General of South Africa", "response": ["| Sir Patrick Duncan"]}, {"page": "Lascelles Principles", "response": ["In so far as this matter can be publicly discussed, it can be properly assumed that no wise Sovereign—that is, one who has at heart the true interest of the country, the constitution, and the Monarchy—would deny a dissolution to his Prime Minister unless he were satisfied that: (1) the existing Parliament was still vital, viable, and capable of doing its job; (2) a General Election would be detrimental to the national economy; (3) he could rely on finding another Prime Minister who could carry on his Government, for a reasonable period, with a working majority in the House of Commons. When Sir Patrick Duncan refused a dissolution to his Prime Minister in South Africa in 1939, all these conditions were satisfied: when Lord Byng did the same in Canada in 1926, they appeared to be, but in the event the third proved illusory."]}, {"page": "Milner's Kindergarten", "response": ["Third was Patrick Duncan. Duncan, an Oxford Civil Servant who worked at Inland Revenue, was invited by Lord Milner to South Africa in 1901 to become Treasurer of the Transvaal.  He later became Colonial Secretary of the Transvaal, supported by Richard Feetham as Assistant Colonial Secretary, and John Dove as his assistant.Thompson, J. Lee, \"Forgotten Patriot\", pg. 221", "* Sir Patrick Duncan (1870-1943): While most of the Kindergarten returned to England in 1909, Duncan stayed behind.  He entered South African politics, rising to become Governor General of South Africa from 1937 to 1943.", "* Richard \"Dick\" Feetham (1874-1965): Like Patrick Duncan, Feetham stayed behind in South Africa.  A lawyer, chairman of the Irish Boundary Commission, and eventually a South African Appellate Judge, Feetham was the last surviving member of the Kindergarten.  He died in Natal Colony on 5 November 1965.The Times, 11/18/65, pg. 17 ", "Many of these men continued to associate formally after their South African service through their founding of The Round Table Journal, which was established to promote Imperial Federation.  Patrick Duncan's obituary in the journal's September 1943 edition, may best describe their ethos:", "Duncan became the doyen [leader] of the band of brothers [in South Africa], Milner's young men, who were nicknamed ... The Kindergarten, then in the first flush of youthful enthusiasm.Buchan, John, \"Memory Hold the Door\", pg. 103 It is a fast aging and dwindling band now; but it has played a part in the Union of South Africa colonies, and it is responsible for the foundation and conduct of The Round Table. For forty years and more, so far as the vicissitudes of life have allowed, it has kept together; and always, while looking up to Lord Milner and to his successor in South Africa, the late Lord Selborne, as its political Chief, has revered Patrick Duncan as the Captain of the band."]}, {"page": "White South Africans", "response": ["* Sir Patrick Duncan Governor-General at the start of the Second World War"]}, {"page": "Patrick Duncan", "response": ["Patrick Duncan may refer to:", "*Sir Patrick Duncan (South African politician) (1870–1943), Governor-General of South Africa ", "*Patrick Duncan (anti-apartheid activist) (1918–1967)"]}, {"page": "Sir Patrick Duncan", "response": ["#REDIRECT Patrick Duncan (South African politician)"]}, {"page": "Timeline of World War II (1939)", "response": [":4: The South African Prime Minister Barry Hertzog motion to remain neutral in the war  is defeated in the Assembly 80 votes against 67. At this point, Hertzog goes to the Governor-General Patrick Duncan and asks him to call a new election, which Duncan refuses."]}, {"page": "Charles Theodore Te Water", "response": ["During much of the summer of 1939, te Water was out of London on an extended vacation in Ireland, which weakened his influence with the Chamberlain government. Only on 23 August 1939 did te Water return to London, where the main thrust of his diplomacy was to argue that Poland was the principle problem in refusing to allow Danzig to rejoin Germany, and to argue that Britain should pressure Poland in the same manner that it had pressured Czechoslovakia. In September 1939, when the Danzig crisis led to World War Two,  Hertzog attempted to have South Africa declare neutrality, leading to a crisis in Pretoria that Hertzog deposed as prime minister while the new Anglophile prime minister, Jan Smuts declared war on Germany. Hertzog's motion for neutrality in parliament saw 67 MPs vote for neutrality while another 80 MPs led by the former prime minister Smuts voted for war. Hertzog then went to the Governor-General Sir Patrick Duncan to ask him to dissolve parliament for a general election (which he expected to win, running on a platform calling for South African neutrality); instead Duncan dismissed Hertzog as prime minister and appointed Smuts as the new prime minister. One of Smuts's first acts as prime minister to sack te Water, who was closely associated with Hertzog, as the South African high commissioner in London. Te Water for his part was embittered by what he saw as an illegal action on the part of Duncan in dismissing Hertzog and had already submitted his resignation in protest."]}, {"page": "Minister of Education (South Africa)", "response": ["|Sir Patrick Duncan"]}, {"page": "The Bengal Club", "response": ["In British India, many high-ranking royals and politicians had banquets held in their honour at the Bengal Club (customarily hosted by the club's president) and some of them also stayed at the club. Various writings also mention important political meetings taking place at the club. Royal visitors to the club (in both British and independent India) have included Leopold II; Prince Albert Victor; Prince Arthur (twice); Archduke Franz Ferdinand; Grand Duke Boris Vladimirovich; Carol II;  Edward VIII; Aga Khan III; Prince Philip (twice);  Prince Charles; Prince Edward; and Prince Andrew. Political, diplomatic and military visitors have included Steen Andersen Bille; Robert Ogden Tyler; several Governors General of India;  Edwin Montagu;  Sir Patrick Duncan; Sir John Simon and other members of the  Simon Commission,  Sir Stanley Jackson;  Sir William Slim; C. Rajagopalachari; Jawaharlal Nehru;.  V.V. Giri; various British High Commissioners; and a British parliamentary delegation.  Other guests have included cricketer Arthur Gilligan (while captaining the Marylebone Cricket Club during a historic tour of India); mountaineers Sir Edmund Hillary, Tenzing Norgay and Sir John Hunt (following the 1953 Mount Everest expedition); and footballer Pelé (who played a match for the New York Cosmos in Kolkata)."]}, {"page": "Patrick Duncan (governor-general)", "response": ["#REDIRECT Patrick Duncan (South African politician) "]}, {"page": "Patrick Duncan (Governor-General)", "response": ["#REDIRECT Patrick Duncan (South African politician)"]}, {"page": "1939 South African Senate election", "response": ["The election to the fourth Senate of South Africa took place on November 17, 1939, when the Provincial Councils met to each elect eight members of the Senate. After the election and the appointment of eight more Senators by Governor-General Sir Patrick Duncan, the Senate was left with a pro-war majority. There were 24 pro-government Senators (20 United Party including 7 nominated members, 2 Dominion Party and 2 Labour Party) and 16 opposition Senators (10 supporters of General Hertzog including one nominated member, and 6 Purified National Party). The four Native Representative Senators were also pro-war.Keesing's Contemporary Archives 1937–1940, page 3863"]}, {"page": "Duncan Street (Pretoria)", "response": ["The street is named for Sir Patrick Duncan, Colonial Secretary of the Transvaal Colony in 1905 when Hatfield was founded. Originally, only the section from Church to South Streets was called Duncan Road. The part between South Street and Duxbury Road was known as Nixon Rd, and that from Duxbury to Lynnwood Roads as Lunnon Road. South of Lynwood Road, it was known as James Street."]}]}}