{"wiki_id": "http://www.wikidata.org/entity/Q2372115", "itemLabel": "Geoff McQueen", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Geoff_McQueen", "wikipedia_page": {"main": "Geoffrey \"Geoff\" McQueen (24 July 1947 – 6 July 1994) was a television screenwriter. He is best known for creating Thames Television's long-running police procedural The Bill and the popular comedy-dramas Give Us a Break, Big Deal and Stay Lucky.\nA carpenter and joiner by trade he worked abroad for many years before he began writing in 1978. His first success was in 1982 when an episode of The Gentle Touch he had written was broadcast.\nHe wrote for other shows, including Boon, and two Jim Davidson sitcoms.\nHe died on 6 July 1994, aged 46, from an aneurysm. He was survived by his wife Jan and their two children", "link_mentions": [{"page": "July 24", "response": ["*  1947   – Geoff McQueen, English screenwriter and producer (d. 1994)"]}, {"page": "Paul McGann", "response": ["McGann's breakthrough role was in Give Us a Break, devised by Geoff McQueen, McGann played a good snooker player who got into scrapes with Robert Lindsay, who played his wideboy manager. The series was a comedy drama in the vein of the popular ITV series of the time, Minder. The series only lasted for one season and it was concluded by a one-off special. His first major dramatic role was the British World War I deserter and criminal Percy Toplis in the 1986 BBC serial The Monocled Mutineer. The film was based on the 1978 book of the same name, written by William Alison and John Fairley."]}, {"page": "Police procedural", "response": ["* Geoff McQueen, creator of The Bill"]}, {"page": "Woodentop (The Bill)", "response": ["Thames Television transmitted Woodentop as part of its Storyboard anthology series of one-off dramas. It was written by Geoff McQueen, a writer who had genre experience after writing episodes of LWT's The Gentle Touch. Woodentop stood out from run of the mill police dramas of the time for a number of reasons including the use of hand-held cameras and natural lighting as well as the use of naturally sounding dialogue.   The show created a realistic portrayal of modern-day policing, and there was nothing like it on television at the time, a fact which was actively exploited by the programme's makers.http://www.offthetelly.co.uk/drama/cops.htm", "* Written by Geoff McQueen"]}, {"page": "Boon (TV series)", "response": ["The show's writers included Geoff McQueen, Kevin McNally, Bernard Strother, Anthony Minghella, Tony McHale, Kieran Prendiville and Veronica Henry. Ted Childs was the first executive producer."]}, {"page": "Big Deal (TV series)", "response": ["Big Deal is a British comedy-drama television series originally broadcast by the BBC between 1984 and 1986. The series was created and written by Geoff McQueen, who created several other major television series including Give Us a Break, Stay Lucky, and The Bill."]}, {"page": "Lisa Geoghan", "response": ["Geoghan trained at the Anna Scher Theatre School from the age of 12, and acted at the Old Vic Youth Theatre between 1978 and 1980. Her first TV appearance was a small role in Trevor Preston's drama Fox in 1980. She has been well known in the UK since appearing at 16, as Sarah Gill, in Tucker's Luck. Other leading roles were three seasons in The Bill creator's Geoff McQueen's gambling drama Big Deal (with Ray Brooks) and 20 episodes of Desmond's between 1989–1992."]}, {"page": "History of The Bill", "response": ["During 1983, Thames Television broadcast a one-off drama called Woodentop. It was written by Geoff McQueen, who had previously worked on LWT's The Gentle Touch. Woodentop followed Police Constable Jim Carver (Mark Wingett) on his first day, mentored by Woman Police Constable June Ackland (Trudie Goodwin). The production was seen as innovative for the use of natural lighting, hand-held cameras and an authentic portrayal of British policing. Woodentop was directed by Peter Cregeen, who had played a part in Z-Cars and Juliet Bravo.Thames Television commissioned 12 further episodes for transmission in 1984, which would relaunch under the title of The Bill.", "Early episodes of The Bill had a duration of fifty minutes, with thirty-five being produced over the first three series of The Bill. The fifty-minute episodes were broadcast post watershed, allowing the programme to include scenes of nudity, drug use, violence and swearing.The early series was considered to be realistic of how the police operated, with Geoff McQueen's focus on the mundane and the ordinary aspects of a police station, such as filling in forms and paperwork. The investigations displayed in each episode would vary from muggings and domestics, to bomb scares and armed robbery.", "In 1991, the Rover SD1 Area Car used in the title sequence was replaced by the new Ford Sierra, however the design remained the same; a siren splitting up scenes of various characters from the programme. In 1993, the continued success of the programme led to ITV changing from two 30-minute episodes a week to three. In 1994, the show celebrated its 10th anniversary in October. The special anniversary episodes that week followed Detective Inspector Sally Johnson in court charged with manslaughter after a drug user had died during a police raid. In July that year, series creator and writer Geoff McQueen, died at the age of 46.", "After Handford's debut as producer debut in January 1998, the original foundations of Geoff McQueen's writing was relaxed as he opted for a mix of police drama and exploring the private lives of the cast, but still remained that an incident would not be seen without a member of cast involved - sticking to McQueen's original mantra of the viewer \"doesn't go home with the characters\". The old title sequences were entirely removed, in favour of displaying things that are seen to be associated with policing, such as reflective jackets, a suspect being interviewed, and a map in the CAD room. The theme tune was also revamped, with a change from the irregular time signature. A major off-screen tragedy marred Handford's debut year on the series when actor Kevin Lloyd died on May 2, mere days after he was dismissed after ten years in the role of DC Tosh Lines for showing up to work drunk and for not memorising his lines. In August 1998, The Bill returned to its original format of hour-long episodes, airing twice weekly. Serialisation was also brought in sporadically with some plots running the course of three or four episodes alongside stadalone, one-episode plots; they included experienced PC Tony Stamp accidentally killing a pedestrian with the Area Car and PC Eddie Santini attempting to rape WPC Rosie Fox before bullying her out of Sun Hill."]}, {"page": "The Bill", "response": ["The Bill was originally conceived by Geoff McQueen in 1983, then a new television writer, as a one-off drama. McQueen had originally titled the production Old Bill. It was picked up by Michael Chapman for ITV franchise holder Thames Television, who retitled it Woodentop as part of Thames's \"Storyboard\" series of one-off dramas and broadcast on ITV under the title Woodentop on 16 August 1983. Woodentop starred Mark Wingett as PC Jim Carver and Trudie Goodwin as WPC June Ackland of London's Metropolitan Police, both attached to the fictional Sun Hill police station.", "The Bill is set in and around Sun Hill police station, in the fictional \"Canley Borough Operational Command Unit\" in East London. Geoff McQueen, creator of The Bill, claimed that he named Sun Hill after a street name in his home town of Royston, Hertfordshire."]}, {"page": "Gawn Grainger", "response": ["Grainger authored the following plays: Four to One (1976), Vamp Till Ready (1978), Lies in Plastic Smiles (1979) and Paradise Lost (1980). In the 1980s, he also wrote several scripts for Geoff McQueen 's BBC1 drama series Big Deal starring Ray Brooks."]}, {"page": "List of awards and nominations received by The Bill", "response": ["The Bill is a British police procedural television series that ran from 1984 to 2010. The show, whose name is derived from \"old bill\"—a British slang term for police officers—was unusual among police dramas in that it focused on the lives and work of one shift of police officers, rather than on any particular aspect of police work. The series originated in 1983 as a one-off drama titled Woodentop (another British slang term for the police, derived from the helmets worn by British police officers), written by Geoff McQueen and produced by Thames Television. ITV were sufficiently impressed with Woodentop that they commissioned a series, which started in 1984 under the title of The Bill. At the time of the series' end in August 2010, The Bill was the United Kingdom's longest-running police drama and was among the longest-running of any British television series, having run for almost 27 years."]}, {"page": "McQueen (surname)", "response": ["*Geoff McQueen (1947–1994), television screenwriter"]}]}}