{"wiki_id": "http://www.wikidata.org/entity/Q2370086", "itemLabel": "Arthur Brough", "itemDescription": "British actor (1905-1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Brough", "wikipedia_page": {"main": "Arthur Brough (born Frederick Arthur Baker; 26 February 1905 – 28 May 1978) was a British actor and theatre founder, producer and director best known for portraying the character of bumbling senior menswear salesman Ernest Grainger on the BBC sitcom Are You Being Served?", "link_mentions": [{"page": "Repertory theatre", "response": ["During the forties, fifties, and sixties, two impresarios dominated the field of British rep, mostly in the North.  They were Harry Hanson and his Court players, and Frank H. Fortescue's Famous Players, with Arthur Brough in Folkestone for the South. Their system was the toughest of all, for if you joined one of their companies, it could mean \"twice-nightly\" shows, and a new play to learn every week. Rosemary Harris has told of her 50 consecutive weeks of doing just that at Bedford rep. That cannot happen anymore, owing to the restrictions of British Equity, which came to mandate just eight shows a week, including perhaps two matinées. Fortescue, who died in 1957, was known to be a strict and upright man. When Pygmalion was playing at one of his theatres, the sign \"FOR ADULTS ONLY!\" would be posted in the front of house, because of Eliza Doolittle's line \"Not bloody likely!\"."]}, {"page": "Folkestone", "response": ["There have been many actors and actresses, David Tomlinson was brought up in the town, while others started their careers at Arthur Brough's Folkestone Repertory Company including Robert Arnold; comedians including Michael Bentine (who was in the local patrol of the ARP) and a large number of artists in various fields. Wilkie Collins, Radclyffe Hall, A. E. Coppard and Catherine Crowe were all writers; and there have also been musicians: Noel Redding among them."]}, {"page": "Are You Being Served?", "response": ["* Mr Ernest Grainger (Arthur Brough) (Series 1–5), a 40-year veteran of Grace Brothers, a senior sales assistant and head of the gents' department, who often falls asleep on the job, is usually grumpy, and wears a measuring tape over his shoulders. Arthur Brough died before the filming of Series 6. The character of Mr. Grainger was brought back for the 2016 revival with Roy Barraclough replacing Arthur Brough. "]}, {"page": "Golders Green Crematorium", "response": ["* Arthur Brough, actor"]}, {"page": "Albert Campion", "response": ["Two stories were adapted by the BBC in 1959 and 1960, with Bernard Horsfall as Campion and Wally Patch as Lugg. Each story was shown in six 30-minute episodes. The 1959 adaptation of Dancers in Mourning also featured John Ruddock as Oates, Denis Quilley as Jimmy Sutane, Michael Gough as Squire Mercer and Noel Howlett as 'Uncle' William Faraday. The 1960 adaptation, Death of a Ghost, featured Arthur Brough as Oates."]}, {"page": "Randall and Hopkirk (Deceased)", "response": ["* Arthur Brough"]}, {"page": "Petersfield", "response": ["Actors Buki Akib, Jamie Campbell Bower, Arthur Brough, Tamsin Egerton, Ellis Jones, and Miranda Hart were all born or live in Petersfield, as are  the BBC Radio 4's soap opera The Archers actors Charles Collingwood (Brian Aldridge) and Edward Kelsey (Joe Grundy). Sir Alec Guinness and his wife are buried in Petersfield. In the music world, tenor Wilfred Brown, Sir William Henry Harris  and composer Michael John Hurd have connections to the town; Mark Owen of Take That lives in Petersfield."]}, {"page": "Anne Stallybrass", "response": ["Stallybrass was born in Westcliff-on-Sea, Essex, on 4 December 1938, to Edward Lindsay Stallybrass (1905–1990) and Annie Isobel (née Peacock) Stallybrass (1911–1981), who wed in 1933 in Hackney, London. Stallybrass genealogy site; accessed 19 January 2014. She was educated at St. Bernard's Convent, Westcliff and spent three years training at the Royal Academy of Music, where she won the Drama Gold Medal. She began her professional acting career by spending several years in repertory, gaining experience in Folkestone Kent, with the Arthur Brough Players, before moving to Nottingham and then to Sheffield. "]}, {"page": "Churcher's College", "response": ["* Arthur Brough, actor (Are You Being Served?)"]}, {"page": "Doomwatch", "response": ["Cast: John Paul as Dr Spencer Quist, Simon Oates as Dr John Ridge, John Nolan as Geoff Hardcastle, Simon Cain as Soldier, Barrie Cookson as Wilson, Leslie Meadows as Reggie, David Lincoln as Dave, Victor Platt as Joe Bates, Arthur Brough as Sandy Larch, Anthony Sagar as Sergeant Harris, Peter Welch as Tom Hedley, Sheila Raynor as Mrs. Smith, Joyce Windsor as Mrs. Hunter, Kim Butcher as Child, Geoffrey Palmer as Major Sims, Bill Stratton as Sergeant, Michael Elwyn as Duncan, the BBC thanks the 7 Field Squadron, Royal Engineers for their co-operation."]}, {"page": "Alfie Bass", "response": ["He continued working throughout the 1970s and 80s, particularly in the TV series' Till Death Us Do Part and Are You Being Served?, the latter as Mr. Goldberg, the second in a series of replacements for Arthur Brough's Mr. Grainger character (the first being James Hayter's Mr. Tebbs). As in the Mr. Goldberg role, he often emphasised his Jewish background in his on-screen characterisations."]}, {"page": "Cyril Luckham", "response": ["The son of a paymaster captain in the Royal Navy, Cyril Luckham was educated at RNC Osborne and Dartmouth and briefly followed his father into the service. He was promoted Lieutenant in 1930The London Gazette, 16 December 1930, issue 33670, p.8077 and retired the following year, transferring to the Emergency List.The London Gazette, 17 July 1931, issue 33736, p.4700 Afterwards he trained for the stage with the Arthur Brough school at Folkestone, making his debut with Brough's company there in The Admirable Crichton in 1935. For several years he appeared in provincial repertory, notably with the Rapier Players at Bristol's Little Theatre. He had been promoted to Lieutenant-Commander on the retired list in 1938The London Gazette, 6 December 1938, issue 34577, p.7689 and was recalled to the Navy when the War broke out. He was invalided out soon afterwards following serious illness and returned to the theatre. Luckham made his West End debut as Torvald Helmer in A Doll's House at the Arts Theatre in July 1945.The Stage, 19 July 1945, p.1, column F For several years afterwards his stage work was largely back in the provinces including the touring company of the Old Vic.The Stage, 2 March 1989, p.25, column F"]}, {"page": "Samuel Pickwick", "response": ["*Arthur Brough in Uneasy Dreams: The Life of Mr. Pickwick (1970)  "]}, {"page": "Royal Flash (film)", "response": ["* Arthur Brough as King Ludwig of Bavaria"]}, {"page": "Peter Barkworth", "response": ["Peter Barkworth was born at Margate, Kent. Soon after his birth, the family moved to Bramhall in Cheshire and Barkworth was educated at Stockport School. His headmaster wanted him to go to university but Barkworth had set his heart on a career in acting. In 1946 he won a scholarship to the Royal Academy of Dramatic Art (RADA). He spent the next few years in repertory in Folkestone, with the Arthur Brough company, and also in Sheffield. From the mid-1950s to the early 1960s he taught acting technique at RADA."]}, {"page": "Are You Being Served? (film)", "response": ["Are You Being Served? is a 1977 British comedy film based on the BBC sitcom Are You Being Served? (1972–1985), which follows the staff of the men's and women's clothing departments of the London Grace Brothers department store. The story is an adaptation of the successful stage version of the show, which played at Winter Gardens, Blackpool. The film was directed by Bob Kellett and the screenplay was by series creators and writers David Croft and Jeremy Lloyd. The film also featured the performers from the television series, including Mollie Sugden, John Inman, Frank Thornton, Trevor Bannister, Arthur Brough, Wendy Richard, and Nicholas Smith.", "*Arthur Brough as Mr. Ernest Grainger, the head of the men's department and the oldest member of the staff. He has a kind heart, but tends to be cranky, forgetful, and perpetually ready to fall asleep.  This was Arthur Brough's last appearance as Mr. Grainger as he died before filming of series 6 began."]}, {"page": "1905 in the United Kingdom", "response": ["**Arthur Brough, actor (died 1978)"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Arthur Brough (Acting)"]}, {"page": "A. Wilson (Manager)?", "response": ["*Arthur Brough as Mr. Boyle"]}, {"page": "That's How Murder Snowballs", "response": ["*Arthur Brough as Snowy"]}, {"page": "List of Are You Being Served? characters", "response": ["| Arthur Brough", "===Mr Grainger (Arthur Brough) (series 1–5)===", "Mr Ernest Grainger (Arthur Brough) was the original senior of the menswear department; he had been with Grace Brothers for over four decades. He resented being forced to share the floor with the Ladies Department. He vaguely resembled Winston Churchill, in both appearance and demeanour, and had done impressions of him during the war while in ENSA. Mr Grainger often fell asleep at work, and failed to wake up when called, unless Mr Humphries asked him \"Mr Grainger! Are you free?\" When flabbergasted or grumpy, Mr Humphries would often come to his aid and call: \"Glass of water for Mr Grainger!\" ", "Although he generally got along well with the others, Mr Grainger was sometimes cranky and bad-tempered and would protest and become resentful whenever the menswear department had to share valuable space with the ladies, or when Captain Peacock would nonchalantly mention a perk he had earned despite having served less time at the store than Mr Grainger (such as a visit to the company boardroom). Once he had the opportunity to fill in for Mr Rumbold who was away for a one-month conference (this was a nice gesture, as it entitled Mr Grainger to a slightly bigger pension) but the position went to his head: he took advantage of all Mr. Rumbold's perks (in particular the liquor cabinet and cigars), but imposed strict discipline on the rest of the staff: he threatened to make an adverse entry in Peacock's personnel record and he actually sacked Mrs Slocombe (however, he did repent his ways by the end of the episode). His character left when Arthur Brough died on 28 May 1978, while the sixth series was in pre-production. He was being written into the scripts at this time.", "Mr Percival Tebbs (James Hayter) was Mr Grainger's first replacement as menswear senior, following the death of Arthur Brough (1978) who played Grainger. He shared many traits with his predecessor, but unlike the somewhat sloppy Mr Grainger, he was obsessed with order and propriety and considered himself an excellent salesman. He was also an overachiever and received a number of recognitions from Grace Brothers for his contributions. "]}, {"page": "The Green Man (film)", "response": ["*Arthur Brough as Landlord"]}, {"page": "Too Many Crooks", "response": ["*Arthur Brough as beggar (uncredited)"]}, {"page": "List of British actors", "response": ["* Arthur Brough (1905–1978)"]}, {"page": "List of people from Folkestone", "response": ["*Arthur Brough (1922–1980) actor (Are You Being Served?); established Folkestone Repertory Theatre"]}, {"page": "The Night We Dropped a Clanger", "response": ["* Arthur Brough – Admiral Bewdly"]}, {"page": "List of people from Hampshire", "response": ["*Arthur Brough, actor, was born in Petersfield"]}, {"page": "List of television performers who died during production", "response": ["| Arthur Brough"]}, {"page": "Brough (surname)", "response": ["*Arthur Brough (1905–1978), English actor"]}, {"page": "A House Divided (Upstairs, Downstairs)", "response": ["* Stallinbrass — Arthur Brough"]}, {"page": "Theatre Royal, Aldershot", "response": ["From 1946 to 1948 the Theatre Royal was home to Harry Hanson's Court Players. In the late 1940s, as her film career floundered, Jessie Matthews ran an amateur theatre group at the theatre. In 1948 Garcia leased the theatre to another management who formed the Aldershot Repertory Company who put on plays there including Pygmalion in 1950 starring Jessie Matthews until their final production, the pantomime Aladdin in December 1952. Following this there was a short season of repertory theatre by the Arthur Brough Players but the theatre again went bankrupt and finally closed. A backstage fire in 1957 lead to great damage and the Theatre Royal was demolished in 1959. A block of flats, Matinée House, occupies the site today."]}, {"page": "Campion (1959 TV series)", "response": ["Other actors appearing in the first series include Denis Quilley, Michael Gough, Noel Howlett, Vanda Godsell, Richard Pearson, Olive Sloane, Sheila Burrell and Wally Patch. The second series featured Mary Merrall, Andre Van Gyseghem, Arthur Brough and Shay Gorman."]}, {"page": "Kindly Leave the Kerb", "response": ["The show was scripted by the writing team of Johnnie Mortimer and Brian Cooke.Produced by London Weekend Television it lasted for a single series. Actors who appeared in episodes of the show include Larry Martyn, Nicholas Smith, Geoffrey Hughes, Timothy Bateson, John Kidd, Arthur Brough, Roger Brierley, Hilda Barry and Katya Wyeth."]}, {"page": "Deadline Midnight (TV series)", "response": ["A large number of other actors appeared in episodes of the show including Michael Caine, Derek Farr, Harry H. Corbett, Sarah Miles, Nanette Newman, Sydney Tafler, Valerie White, Alethea Charlton, Nyree Dawn Porter, Jane Merrow, George Coulouris, Claire Gordon, Kenneth Cope, Richard Pearson, Dilys Laye, Ronald Lacey, Larry Martyn, Warren Mitchell, Frank Pettingell, Esmond Knight, John Welsh, Michael Robbins, Pamela Brown, Meredith Edwards, Billy Milton, Reginald Marsh, George Woodbridge, Peter Illing, John Ringham, William Kendall, Stratford Johns, John Barrie, Richard Vernon, John Barron, Anthony Sharp, Wensley Pithey, Bernard Archard, Patricia Burke, Bernard Kay, Derek Newark, Timothy West, Frederick Jaeger, Charles Lloyd Pack, Rita Webb, John Arnatt, Neil Hallett, Derek Francis, Arthur Brough, Elsie Wagstaff, Tenniel Evans, Carmen Silvera, Patrick Newell, Desmond Llewelyn, Jennifer Hilary, Allan Cuthbertson, Lloyd Lamble, David Hemmings and James Beck."]}]}}