{"wiki_id": "http://www.wikidata.org/entity/Q2371313", "itemLabel": "Edwin Alderson", "itemDescription": "British and Canadian First World War general", "wikipedia_url": "https://en.wikipedia.org/wiki/Edwin_Alderson", "wikipedia_page": {"main": "Lieutenant General Sir Edwin Alfred Hervey Alderson, KCB (8 April 1859 – 14 December 1927) was a senior British Army officer who served in several campaigns of the late nineteenth and early twentieth centuries. From 1915 to 1916 during the First World War he commanded the Canadian Expeditionary Force on the Western Front, during which time it saw heavy fighting.", "link_mentions": [{"page": "Battle of Vimy Ridge", "response": ["On 28 May 1916, Byng took command of the Canadian Corps from Lieutenant-General Sir Edwin Alderson.  Formal discussions for a spring offensive near Arras began, following a conference of corps commanders held at the First Army Headquarters on 21 November 1916. In March 1917, the First Army headquarters formally presented Byng with orders outlining Vimy Ridge as the Canadian Corps objective for the Arras Offensive. A formal assault plan, adopted in early March 1917, drew heavily on the briefings of staff officers sent to learn from the experiences of the French Army during the Battle of Verdun. For the first time the four Canadian divisions would fight together. The nature and size of the attack needed more resources than the Canadian Corps possessed; the British 5th Division, artillery, engineer and labour units were attached to the corps, bringing the nominal strength of the Canadian Corps to about 170,000 men, of whom 97,184 were Canadian."]}, {"page": "Lowestoft", "response": ["The Elizabethan pamphleteer Thomas Nashe, a father of modern journalism and a primary source for the literary milieux of William Shakespeare, was born in Lowestoft in 1567.Nicholl, Charles. A Cup of News: The Life of Thomas Nashe. Routledge & Kegan Paul. 1984, p. 11. Robert Potter, poet and translator of Greek drama, was Vicar of Lowestoft until 1804. The 19th-century writer and traveller George Borrow lived at Oulton Broad for many years and wrote most of his books there. Lieutenant General Sir Edwin Alderson also lived at Oulton Broad, on a houseboat, and died in 1927 at the since-demolished Royal Hotel in Lowestoft, where he had been staying for his last month.General's Death – Sir Edwin Alderson's Lowestoft Yachting Associations, Lowestoft Journal, 17 December 1927."]}, {"page": "British Expeditionary Force (World War I)", "response": ["The Canadian Expeditionary Force was the designation of the field force created by Canada for service overseas in the First World War. Its major combat formation was the Canadian Corps, which eventually commanded four Canadian infantry divisions. The Canadian Corps' first commander was General Edwin Alderson, who was succeeded by General Julian Byng in 1916, who was in turn succeeded in 1917, by the Canadian General Arthur Currie until the end of the war. They distinguished themselves in battle from the Second Battle of Ypres, through the Somme and particularly in the Battle of Arras at Vimy Ridge in April 1917. Since they were mostly untouched by the German offensive in the spring of 1918, the Canadians were ordered to help spearhead the last campaigns of the War from the Battle of Amiens in August 1918."]}, {"page": "Sam Hughes", "response": ["As the CEF took up its training facilities on Salisbury Plain, Hughes wanted the 1st Canadian Division to be commanded by a Canadian general. He very reluctantly accepted a British officer, Lieutenant-General Sir Edwin Alderson, as the commander of the 1st Division when it turned out that there was no qualified Canadian officer. Hughes's insistence on supplying the CEF with Canadian-made equipment, regardless of its quality, made for difficult conditions for the men of the CEF, with many soldiers already complaining about the Ross rifle in training. Alderson replaced the Shield Shovels invented by Hughes's secretary, Ena MacAdam, with the standard British Army shovel, much to the relief of the CEF and to Hughes's fury. Hughes constantly sought to undermine Alderson's command, regularly involving himself in divisional matters that were not the normal concern of a defense minister. The first Canadian unit to see action was Princess Patricia's Canadian Light Infantry, a regiment privately raised by a wealthy Montreal industrialist, Hamilton Gault, which arrived on the Western Front in December 1914, separately from the First Contingent. On 16 February 1915, the CEF arrived in France to head for the front lines, taking up position at the crucial Ypres Salient in Belgium."]}, {"page": "Ross rifle", "response": ["Complaints rapidly reached the rifle's chief sponsor, the Canadian Minister of Militia and Defence Sam Hughes. He nevertheless continued to believe in its strengths despite the professional opinion of Sir Edwin Alderson, the British Army officer who was commander of the First Canadian Division. The rifle became an element in political issues within Canada and between Canada and the British. Hughes responded to Alderson's criticism by accusing Alderson of ignorance and copied the letter to many officers in the corps. The effect was to undermine confidence in Alderson and the rifle. Hughes also made accusations that Canadian officers were induced to produce adverse reports on the rifle. After negative reports regarding the rifle were published through the Ottawa Citizen, it became increasingly clear that his own claims before the House of Commons that all the faults of the rifle had been cured were patently false, and Hughes' defence of the rifle could no longer be supported by the Prime Minister."]}, {"page": "Canadian Corps", "response": ["| style=\"background: ; vertical-align:top\" |  Edwin Alderson"]}, {"page": "Ipswich School", "response": ["*Lieutenant-General Sir Edwin Alderson (1859-1927), first commander Canadian Expeditionary Force in World War I."]}, {"page": "Capel St. Mary", "response": ["The village was birthplace in 1859 of Lieutenant-General Sir Edwin Alderson, first commander of the Canadian Expeditionary Force of World War I.Alderson, Sir Edwin Alfred Hervey, Dictionary of Canadian Biography article by Desmond Morton, Retrieved 5 November 2007"]}, {"page": "1st Canadian Division", "response": ["The First Contingent of the Canadian Expeditionary Force was raised in August 1914, shortly after the outbreak of World War I, concentrated at Valcartier Camp in Quebec, and set off for England in the largest trans-Atlantic convoy to date two months later.  Training and reorganization commenced upon arrival in the United Kingdom in October 1914, and it was not until 26 January 1915 that the division was officially organized, under the command of Lieutenant-General Edwin Alderson, a British Army officer.  Several units under command of the First Contingent were excluded from the divisional organization, including the 17th Battalion (Nova Scotia Highlanders), 18th Battalion, and several companies of Newfoundland soldiers (later formed into the Newfoundland Regiment and assigned to the British 29th Division)."]}, {"page": "Oulton Broad", "response": ["Lieutenant-General Sir Edwin Alderson, a keen yachtsman and canoeist, lived in his last years on a houseboat moored at Oulton Broad, called \"Fox\", up until the month before his death in 1927.  He and his wife entertained, especially during the yachting season, and he encouraged the Royal Canoe Sailing Club to hold competitions on the Broad."]}, {"page": "Canadian Expeditionary Force", "response": ["According to historian G. W. L. Nicholson, \"The Somme offensive had no great geographical objectives. Its purpose was threefold – to relieve pressure on the French armies at Verdun, to inflict as heavy losses as possible on the German armies, and to aid allies on other fronts by preventing any further transfer of German troops from the west.\"Nicholson, Gerald W. L. Canadian Expeditionary Force, 1914-1919: Official History of the Canadian Army in the First World War. Ottawa: R. Duhamel, Queen's Printer and Controller of Stationery, 1962.] The Canadian Corps was formed after receiving the 2nd and 3rd and later, 4th divisions. Its first commander was Lieutenant-General Edwin Alderson, who was soon replaced by Lieutenant-General Julian Byng, in time to repulse a German attack at Mont Sorrel in the Ypres sector in June 1916. while much of the BEF was moving toward the Somme. In this engagement, Major-General Malcolm Mercer, commander of the newly formed 3rd Division was killed; he was the most senior Canadian to be killed in the war."]}, {"page": "Richard Ernest William Turner", "response": ["In the chaos that followed, both Turner and Hughes sent erroneous messages back to Lieutenant General Edwin Alderson at divisional headquarters that their line had been broken and was in full retreat, when in fact the 3rd Brigade had not even been attacked yet. Turner was also responsible for sending two reserve battalions forward in a night-time attack on Kitcheners Wood, although he left the details to his subordinate Hughes. Much of the subsequent high casualty rate during the attack can be attributed to Hughes and his insistence on an immediate attack before proper reconnaissance could reveal the presence of enfilading machine gun nests. Although Turner demonstrated great personal bravery when his brigade headquarters came under direct small arms fire and suffered several near misses from artillery, he seemed unable to adequately cope with this new type of mechanized warfare nor with the demands of brigade-sized tactics.", "As the battle raged on, Turner travelled back to Corps headquarters to consult with his commanding officer, Edwin Alderson. The normally reserved Alderson exchanged sharp words with Turner about the unauthorized withdrawal of the 3rd Brigade, a withdrawal that now threatened the entire Ypres Salient.Cassar 2010, p. 213 Historian George Cassar is of the opinion that, had Turner not been a popular Boer War hero and politically well-connected back in Canada, Alderson would have relieved him of command on the spot.Cassar 2010, p. 213"]}, {"page": "Royal Humane Society", "response": ["*Edwin Alderson (Bronze Medal)Alderson, Brig-Gen Edwin Alfred Hervey, Anglo-African Who's Who and Biographical Sketchbook, 1907, Walter H. Willis, Retrieved 12 November 2007 "]}, {"page": "Edwin Alfred Hervey Alderson", "response": ["#REDIRECT Edwin Alderson"]}, {"page": "E.A.H. Alderson", "response": ["#REDIRECT Edwin Alderson"]}, {"page": "Allies of World War I", "response": ["*  Lieutenant-General Edwin Alderson – Commander of the unified Canadian Corps of the Canadian Expeditionary Force (26 January 1915 – September 1915)"]}, {"page": "John Norton-Griffiths", "response": ["In 1896 on the outbreak of the Second Matabele War he joined Lieut.-Colonel Edwin Alderson's Mashonaland Field Force, then in 1897 was commissioned into the British South Africa Police. In the Second Boer War, he served briefly with Brabant's Horse, then as Captain Adjutant to Lord Roberts' bodyguard."]}, {"page": "History of the Canadian Army", "response": ["Based on his own experiences of the Boer War, Hughes believed that Canadian soldiers were much better soldiers than the British, and it was because of Hughes that the Canadians fought together as a separate expeditionary force during the First World War. The staff officers had developed a plan for mobilizing the militia in the event of the war, which Hughes disregarded in August 1914 by creating an entirely new organization called the Canadian Expeditionary Force, which was to consist of numbered battalions that had no connection with the militia regiments. Reflecting his own beliefs about the superiority of Canadians over the British as soldiers, Hughes fought hard to ensure that the divisions of the Canadian Expeditionary Force be commanded by Canadian generals, and very reluctantly accepted a British officer, Lieutenant General Edwin Alderson, as the commander of the 1st Canadian Division and only then because of the lack of a qualified Canadian officer. Alderson found Hughes a difficult man to deal with as the defence minister insisted on involving himself in matters that were normally the concern of a defence minister and because the Canadian nationalist Hughes insisted on equipping the Canadian Expeditionary Force with Canadian-made equipment as much as possible, regardless of whether it was practical or not."]}, {"page": "Hanwood", "response": ["Lieutenant-General Sir Edwin Alderson (1859–1927) had his home at The Glen as a subtenant in the years 1914Earliest mention of The Glen and himself. to 1916,Latest mention of The Glen and himself. coinciding with his period commanding the Canadian Expeditionary Force in World War I. He unveiled the village's war memorial cross (north side of main road adjacent Cock Inn) in 1921, when he admitted he was living in the village when the war started and claimed to be the first resident called on for active service."]}, {"page": "Battle of Diamond Hill", "response": ["|1st Corps Mounted Infantry: Lt-Col. Edwin Alderson"]}, {"page": "Charles Harington (British Army officer, born 1872)", "response": ["The Canadian Corps had been constituted in September after the arrival of the 2nd Canadian Division. When formed under the command of Lieutenant General Edwin Alderson, the corps lacked a general staff and consisted of an infantry division and cavalry brigade. Alderson was succeeded in May 1916 by General Julian Byng, who presided over his first battle as corps commander, just weeks after his appointment. Allocated positions in the Ypres Salient near Hooge, Hill 60 and Zwarteleen, the Canadian Corps had been instructed by Byng to begin preparations for a \"localised attack\" not anticipating the possibility of one being conducted by the German XIII Corps against the tactically important vantages Mount Sorrel and Tor Top.Harington (1940), pp. 47–48Baker, Chris, The Battle of Mount Sorrel 1916, 1914–1918.net. Retrieved on 22 January 2008. "]}, {"page": "Malcolm Mercer", "response": ["On arrival at Plymouth a British officer, Lieutenant General Edwin Alderson, took overall command of the \"Canadian Contingent\" as the Expeditionary Force was then known and Mercer was despatched to Camp Bustard on Salisbury Plain, where he oversaw the training and organising of the Canadian Force to ready it for fighting in Belgium and Northern France. Mercer performed well at this task and an inspection of his camp on 4 November by King George V, Queen Mary, Lord Roberts and Lord Kitchener drew the compliment \"No finer physique in the British Army. A fine brigade. Splendid.\" Mercer's fellow brigadiers in the Expeditionary force, Richard Turner, VC and Arthur Currie commanded similar training camps and together the officers prepared their men for departure to France on 9 February 1915."]}, {"page": "Battle of Mont Sorrel", "response": ["On 28 May 1916, in an abrupt change of command, Lieutenant-General Edwin Alderson was appointed to the largely ceremonial post of Inspector General of Canadian Forces in England and was succeeded by Lieutenant-General Julian Byng as commander of the Canadian Corps.", "The Canadian Corps remained in the Ypres Salient in a stationary yet aggressive status until the beginning of September when the corps was transferred to the Somme. In the aftermath of the battle and in the wake of the death of Major-General M.S. Mercer, Canadian Corps commander Julian Byng was forced to address the politically sensitive topic of appointing a new 3rd Canadian Division commander. Canadian Minister of Militia and Defence Sam Hughes telegraphed Byng and insisted that his son, 1st Canadian Brigade commander Brigadier-General Garnet Hughes, be given command of the 3rd Canadian Division. To the fury of the minister, Byng instead promoted 2nd Canadian Brigade commander Brigadier-General Louis Lipsett, a highly regarded pre-war British regular, to the post. The minister protested and confronted Byng in August 1916 but he did not relent, insisting that \"he had nothing against Garnet Hughes there was simply a better man for the post\". The change in command between Lieutenant-General Edwin Alderson and Julian Byng was also used as an opportunity to make additional changes. Much to the displeasure of Minister Hughes and delight of the Canadian troops, the unreliable Canadian Ross Rifle began to be replaced with the British Lee–Enfield and the Colt machine gun with the Vickers and Lewis machine guns."]}, {"page": "Allied leaders of World War I", "response": ["*Edwin Alderson – Commander of the Canadian Corps (1915–1916)"]}, {"page": "6th (Poona) Division", "response": ["*1908-1912: Major-General Edwin Alderson CB"]}, {"page": "Currie Hall", "response": ["The initials of Canada Corps commanders General Sir Arthur Currie; Sir Edwin Alderson (1915–16), and Sir Julian Byng, 1st Viscount Byng of Vimy (1916–17) are emblazoned on the ceiling of Currie Hall as are the initials of Sir Henry Edward Burstall, Garnet Hughes, General Macdonell, Louis Lipsett, Frederick Oscar Warren Loomis, M. S. Mercer, Sam Steele, R. E. W. Turner, and David Watson."]}, {"page": "Edwin Alfred Harvey Alderson", "response": ["#REDIRECT Edwin Alderson"]}]}}