{"wiki_id": "http://www.wikidata.org/entity/Q23771606", "itemLabel": "Ruben Reuter", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Ruben_Reuter", "wikipedia_page": {"main": "Ruben Reuter (born 28 June 2000) is an English actor, best known for his role as Finn McLaine in The Dumping Ground.", "link_mentions": [{"page": "2000 in the United Kingdom", "response": ["* 28 June – Ruben Reuter, actor"]}, {"page": "The Syndicate", "response": ["* Ruben Reuter as Shane Sanderson"]}, {"page": "2000 in British television", "response": ["*27 June – Ruben Reuter, actor "]}, {"page": "Royds Hall Academy", "response": ["* Ruben Reuter, actor"]}, {"page": "List of The Story of Tracy Beaker (franchise) characters", "response": ["| Ruben Reuter"]}, {"page": "List of The Dumping Ground characters", "response": ["Bailey takes on responsibility of a dog, Mischief (Sage), after he blames himself for the death of his homeless owner Mal (Dai Bradley) and he wins Mike and May-Li round upon training him. When Harry Jones leaves the 'Dumping Ground' for a foster family, Floss cuts off Jeff the giraffe's head and May-Li later returns Jeff to him. Mike and May-Li lecture Tee and Kazima when they leave a holiday club and what they should have done after catching two burglars. Ryan (Lewis Hamilton) accesses everyone's records and he receives a text from Harry, asking for help and he tells Mike and May-Li about Harry's foster placement. Ryan takes Harry and his foster brother, Finn (Ruben Reuter), from their foster home and when they arrive at the 'Dumping Ground', Harry doesn't want to go back. Harry and Finn tell May-Li what their foster home was like. A rabbit is found in the garden and Toni (Nelly Currant) calls it Mr Nibbles. Billie (Gwen Currant) and Finn show May-Li a picture of Toni with her Dad and a rabbit, Mr Nibbles, resembling the one they found. Toni and Billie tell May-Li that their dad let Mr Nibbles out of the hutch and they had foxes. May-Li receives a call from the rabbit owner and she breaks the news to Toni. Toni decides not to accept May-Li's offer of a rabbit when the rabbit has baby rabbits.", "Finn McLaine, portrayed by Ruben Reuter, made his first appearance on 6 March 2015 in series 3 of The Dumping Ground during the episode \"Long Way Home\".", "In Series 6 Episode 3 “Give and Take”, Charlie decides to sell some of her things and Sasha (Annabelle Davis) suggests they make T-shirts to sell, but becomes annoyed with Jody and Finn (Ruben Reuter) helping her. Charlie tells Sasha that she needs money to pay for yoga for her grandfather that helped him when he fell, but he is no longer getting classes as his home has stopped paying. Sasha offers to help her write a letter to the council to continue the funding.", "|  Adam is the father of Claire (Isabelle Burrows-Brown) and the foster father of Harry (Philip Graham Scott) and Finn (Ruben Reuter). A text is sent to Ryan's (Lewis Hamilton) saying \"HELP!\" and Ryan goes to Harry's foster home and Ryan notices Harry and Finn don't look excited about going out with Adam for their birthday. Ryan sneaks Finn and Harry out, running away with them to go back to The Dumping Ground, however, Adam catches them up in his car. Whilst Adam orders Harry and Finn back in the car, Ryan takes his car keys and chucks them into the field. When they get to The Dumping Ground, Harry pleads with Mike (Connor Byrne) not to go back after encouragement from Ryan to speak up and Adam admits to Mike that he was in financial trouble and kept fostering to get money.", "|  Claire is the daughter of Adam (Ray Emmet Brown) and Nina Aycliffe, and the foster (now ex) sister of Harry (Philip Graham Scott) and Finn (Ruben Reuter).", "|  A health and safety inspector, who arrives at The Dumping Ground to carry out a routine inspection. The kids mistake her for the trampoline assessor and accidentally inform her of Finn's (Ruben Reuter) injury on an old trampoline. Dexter (Alexander Aze) throws rubbish over the health and safety inspector's car in order to be taken into care, but his family are given the support of Social Services.", "|  After Finn (Ruben Reuter) injures himself on a trampoline, Toni (Nelly Currant), Billie (Gwen Currant), Finn, Mo (Reece Buttery) and Floss (Sarah Rayson) decide to enter a competition to win a trampoline. In order to win the trampoline, they decide to pretend Billie is an outstanding at trampolining. She arrives at The Dumping Ground to assess Billie, but Mike (Connor Byrne) apologises to her for the kids making up what they said.", "|  When a bear costume is ruined for their play by Mischief (Sage), Harry (Philip Graham Scott) and Finn (Ruben Reuter) visit Mr Twigg at his shut down restaurant with May-Li (Stacy Liu). They take the bear to borrow, but when the kids find a bag of jewels hidden, they move the bear upstairs and Kazima (Akuc Bol) hides the jewels. Later, Mr Twigg visits and tells them that he has been repossessed and the bear is valuable and one of the items the bailiffs had listed. The kids decide to give the jewels to Mr Twigg, but find them stolen and it turns out Alison (Tiana Benjamin) took them.", "|  Iona is an artist Floss (Sarah Rayson) meets when she tries to raise money so the young people can go on their adventure trip. Floss and Finn (Ruben Reuter) takes Tee's (Mia McKenna-Bruce) to show Iona and try to persuade her to buy it. Iona refuses to and Floss tells lies about Finn in order to get her to change her mind. Iona contacts children's services about Floss, who contact Mike."]}, {"page": "The Dumping Ground (series 3)", "response": ["Casting calls confirmed that there would feature 7 new characters, including; twins Toni and Billie, played by Nelly and Gwen Currant; dog Mischief, which CBBC ran a competition for viewers to name it and is played by Sage; a disabled character called Finn, as well as Sasha, Dexter and Ryan, played by Ruben Reuter, Annabelle Davis, Alexander Aze and Lewis Hamilton respectively. This series also saw the final appearance of Joe Maw as Johnny Taylor in the part 1 finale \"Dragon Slayer\"."]}, {"page": "The Dumping Ground: I'm...", "response": ["*Finn McLaine - Ruben Reuter (Series 1–present)"]}]}}