{"wiki_id": "http://www.wikidata.org/entity/Q237843", "itemLabel": "Ashley Jensen", "itemDescription": "Scottish actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Ashley_Jensen", "wikipedia_page": {"main": "Ashley Jensen (born 11 August 1969) is a Scottish actress and narrator. She was nominated for an Emmy for her role on the television series Extras, in which she appeared from 2005 to 2007. She was a cast member of the ABC series Ugly Betty and the short-lived CBS sitcom Accidentally on Purpose. She also plays the main character in the comedy-drama detective television series Agatha Raisin.", "link_mentions": [{"page": "Clan McDuck", "response": ["Downy's image and name are also present in the 2017 incarnation of DuckTales, usually alongside those of her husband. Alongside Fergus, she makes a physical appearance in the episode, \"The Secret(s) of Castle McDuck!\", voiced by Ashley Jensen."]}, {"page": "1969", "response": ["** Ashley Jensen, British actress"]}, {"page": "1999 in film", "response": ["| Topsy-Turvy || USA Films / Pathé Distribution || Mike Leigh (director/screenplay); Jim Broadbent, Allen Corduner, Lesley Manville, Ron Cook, Eleanor David, Timothy Spall, Vincent Franklin, Martin Savage, Dexter Fletcher, Dorothy Atkinson, Shirley Henderson, Kevin McKidd, Louise Gold, Michael Simkins, Andy Serkis, Naoko Mori, Sukie Smith, Theresa Watson, Ashley Jensen, Mark Benton, Steve Speirs, Sam Kelly, Jonathan Aris, Alison Steadman, Adam Searle, Katrin Cartlidge, Brid Brennan || Musical, Drama || Live action"]}, {"page": "British Comedy Awards", "response": ["* Best TV comedy actress: Ashley Jensen", "* Best comedy newcomer: Ashley Jensen"]}, {"page": "Kay Mellor", "response": ["In 2012, she wrote another BBC drama The Syndicate. This returned for a second series in 2013, a third in 2015 and a fourth in 2021 (for more details see below). In 2014, her BBC series In the Club was first broadcast followed by a second series in 2016.  Mellor's drama series Love, Lies and Records ran on BBC One in November and December 2017, starring - amongst others - Rebecca Front and Ashley Jensen. Her ITV drama series Girlfriends, starring Zoë Wanamaker, Miranda Richardson and Phyllis Logan, premiered in January 2018."]}, {"page": "Rose d'Or", "response": ["| || F: Ashley Jensen in Extras || BBC || UK"]}, {"page": "Rab C. Nesbitt", "response": ["The series has featured guest appearances from the likes of Norman Lovett, Peter Mullan, Rikki Fulton, Mary Lee, Anita Dobson, Timothy Spall, Stanley Baxter, Kevin McNally, Clive Russell, Jerry Sadowitz, Viv Lumsden, Sylvester McCoy, Russell Hunter, Peter Capaldi and then-unknowns David Tennant, Ashley Jensen, Ford Kiernan, Greg Hemphill, Karen Dunbar, Jane McCarry and Paul Riley. Series 10 episode 2 notably featured an appearance by Scottish singer Susan Boyle who was the runner-up on Britain's Got Talent in 2009. The series was taken live on tour in 1991, known as Rab C. Nesbitt: In the Flesh, thus meaning that no new series was broadcast that year. A live recording of the tour was released on VHS in 1992 as Rab C. Nesbitt: Live. Two script books accompanying the series have also been released, alongside Rab's autobiography, a novel entitled A Stranger Here Myself."]}, {"page": "Eleventh Hour (British TV series)", "response": ["The show follows the adventures of Professor Ian Hood (originally Alan Hood), played by Patrick Stewart, a Special Advisor to the government's Joint Sciences Committee, who troubleshoots threats stemming from or targeting \"scientific endeavour.\" He is joined by Rachel Young, played by Ashley Jensen, a Special Branch operative who acts primarily as his bodyguard, as Hood has made powerful enemies through his work. The first episode was broadcast on 19 January 2006.", "* Ashley Jensen as DS Rachel Young, Special Branch operative"]}, {"page": "Topsy-Turvy", "response": ["* Ashley Jensen as Miss Tringham, a member of the chorus"]}, {"page": "Blanche Ravalec", "response": ["Ravalec is known for her role as Dolly, Jaws' girlfriend in the 1979 James Bond film Moonraker. Beyond this, she has made over 70 appearances in French-language TV and film. Among her English-to-French dubbing work is as \"Christina McKinney\" (Ashley Jensen) in Ugly Betty, as \"Emily Waltham\" (Helen Baxendale) in Friends, and as \"Bree Van de Kamp\" (Marcia Cross) in Desperate Housewives. She also provides voices for the French dub of Thomas the Tank Engine and Friends."]}, {"page": "Taggart", "response": ["* Ashley Jensen (Episode: A Taste of Money)"]}, {"page": "Tubridy Tonight", "response": ["| 23 February 2008 || Dominic Purcell, Dustin, Ashley Jensen, The Carberrys || Audience game || Katie Melua || \"If the Lights Go Out\" || Details "]}, {"page": "Greatest Britons", "response": ["**Nominees: Simon Cowell; Ashley Jensen"]}, {"page": "The Sunday Night Project", "response": ["| Ashley Jensen"]}, {"page": "David Tennant", "response": ["Tennant made his professional acting debut while still in secondary school. When he was 16, he acted in an anti-smoking film made by the Glasgow Health Board which aired on television and was also screened in schools. The following year, he played a role in an episode of Dramarama. Tennant's first professional role upon graduating from drama school was in a staging of The Resistible Rise of Arturo Ui co-starring Ashley Jensen; one of a few plays in which he performed as part of the agitprop 7:84 Theatre Company. He also made an early television appearance in the Scottish TV sitcom Rab C Nesbitt as a transgender barmaid called Davina. In the 1990s, he appeared in several plays at the Dundee Repertory Theatre."]}, {"page": "Annan, Dumfries and Galloway", "response": ["*Ashley Jensen – actress, best known for her roles in Extras and Ugly Betty."]}, {"page": "Nigel Harman", "response": ["From September 2012 to January 2013 he starred alongside Rob Brydon and Ashley Jensen in Alan Ayckbourn's A Chorus of Disapproval at the Harold Pinter Theatre in the West End."]}, {"page": "Clocking Off", "response": ["It was effectively an anthology programme, following the lives of a group of workers at a Manchester textile factory, with each episode focusing on the home life of a different character. Well-known actors who appeared in the series included Christopher Eccleston, Sophie Okonedo, Philip Glenister, John Simm, Lesley Sharp, Siobhan Finneran, Emma Cunniffe, Diane Parish, David Morrissey, Ricky Tomlinson, Julian Rhind-Tutt, William Ash, Ben Crompton, Jack Deam, Jack P. Shepherd, Tina O'Brien, Jason Merrells, Pam Ferris, Wil Johnson, Ashley Jensen, Susan Cookson, Mark Benton, Sarah Lancashire, Crissy Rock, Marshall Lancaster, Marc Warren, Claire Sweeney and Maxine Peake.", "* Ashley Jensen as Babs Leach (Series 2–4)"]}, {"page": "May to December", "response": ["* Rosie McConachie (series 6) (Ashley Jensen) - Replaces Hilary. A mad Scotswoman who is always asking: \"Hoo's yer juices?"]}, {"page": "Extras (TV series)", "response": ["Extras is a British sitcom about extras working in television, film, and theatre. The series was co-produced by the BBC and HBO and was written, and directed by Ricky Gervais and Stephen Merchant, both of whom starred in it. Extras follows the lives of Andy Millman (Gervais), his platonic friend Maggie Jacobs (Ashley Jensen) and Andy's substandard agent and part-time retail employee Darren Lamb (Merchant) as Millman muddles through life as an anonymous \"background performer\" who eventually finds success as a B-level sitcom star.", "* Ashley Jensen as Maggie Jacobs", "Andy Millman (Ricky Gervais) is an aspiring actor who can only find work as an extra, which he calls being a \"background artist\" as a means of making the work seem more dignified. Andy is accompanied on his various projects by his platonic best friend and fellow extra, Maggie Jacobs (Ashley Jensen). Maggie is well-meaning but ditzy, often missing obvious social cues and failing to exhibit appropriate tact and subtlety in conversations. Unlike Andy, Maggie has no aspirations toward being anything more than an extra. Andy's agent, Darren Lamb (Stephen Merchant), has no real experience in the field of entertainment. He is incompetent, often taking no steps at all to find work for Andy, and even discouraging potential employers from hiring his client due to his flabby physique, age, and lack of acting experience. Darren is assisted by former soap opera star Shaun Williamson, who plays himself. Lamb frequently tries to undermine Andy by suggesting Williamson (who Lamb refers to by his former EastEnders character name, \"Barry\") is better suited for various acting roles that are offered to Andy.", "* Best Sitcom Actress - Ashley Jensen (2006)", "* Best Television Comedy Actress - Ashley Jensen (2005)", "* Best Television Comedy Newcomer - Ashley Jensen (2005)", "* Best Comedy Actress - Ashley Jensen (2006)", "Overall, Extras has been received very well by critics in the UK. The show received 3 BAFTA Award nominations in 2006 including Best Comedy Performance for Ashley Jensen, Best Writer for Ricky Gervais and Stephen Merchant, and Best Situation Comedy. In 2007, both Gervais and Merchant were nominated, separately, for Best Comedy Performance, with Gervais ultimately winning the award."]}, {"page": "Camerton, Somerset", "response": ["* Actress Ashley Jensen"]}, {"page": "List of former EastEnders characters", "response": ["|Fiona Morris || Ashley Jensen || 2000"]}, {"page": "A Cock and Bull Story", "response": ["*Ashley Jensen as Lindsey"]}, {"page": "List of female detective characters", "response": ["* Agatha Raisin is an impatient and nosy retired London PR agent who starts her own detective agency in Carsley, Cotswald, an English village. The book series begun 1992 by English author MC Beaton (Marion Chesney), also the author of Hamish Macbeth series. Agatha is played by Penelope Keith in some BBC radio adaptations and Ashley Jensen in the television adaptation for Sky1."]}, {"page": "Primetime Emmy Award for Outstanding Supporting Actress in a Limited or Anthology Series or Movie", "response": ["| Ashley Jensen || Maggie Jacobs || Extras: The Extra Special Series Finale "]}, {"page": "2006 British Academy Television Awards", "response": ["**Nominees: Peter Capaldi — The Thick of It (BBC Four); Ashley Jensen — Extras (BBC Two); Catherine Tate — The Catherine Tate Show (BBC Two)"]}, {"page": "Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Comedy Series", "response": ["| Alan Dale, America Ferrera, Mark Indelicato, Ashley Jensen, Eric Mabius, Becki Newton, Ana Ortiz, Tony Plana, Kevin Sussman, Michael Urie, Vanessa Williams", "| Alan Dale, America Ferrera, Mark Indelicato, Ashley Jensen, Eric Mabius, Becki Newton, Ana Ortiz, Tony Plana, Stelio Savante, Kevin Sussman, Michael Urie, Vanessa Williams"]}, {"page": "Ugly Betty", "response": ["The season was the last that featured Rebecca Romijn and Ashley Jensen as regulars, with Romijin's character Alexis moving to France to be with her son early in the season, and Jensen's character Christina returning to Scotland with her family in episode 21.", "Following news of the show's cancellation, a number of former cast members returned to reprise their roles in guest appearances, including Ashley Jensen, Christopher Gorham, Freddy Rodríguez, and Grant Bowler.", "| Ashley Jensen", "The buildup to \"Bettymania\" by various broadcasters also began to take shape overseas, especially in the United Kingdom. On December 6, 2006, Channel 4 began to advertise the show. The ad shows seemingly attractive models gathered around a pool, but as the camera angle changes a model comes out of the pool wearing Betty's glasses, then as the models smile, they are all wearing Betty's braces. Another ad parodies Marks and Spencer's successful fashion advertising campaign, as well as Dove and Gap campaigns. A voice over then says, \"Fashion has a new face. 'Ugly Betty' Coming Soon To 4.\" After a week of these teasers, clips from the actual program were included in the trailers. In mid-January, Davina McCall, presenter of Celebrity Big Brother dressed up as Betty live on Channel 4 before the titles of the second eviction show of the evening. On February 16, 2007, Ashley Jensen (Christina) also dressed up as Betty during an airing of Channel 4's Friday Night Project, where she was the guest host. The children's channel CBeebies also parodied the title sequence, with one variation mixing faces of regular CBeebies characters until finally settling with Tiny from Little Robots."]}, {"page": "Colin and Edith", "response": ["Occasionally a special guest was interviewed in the studio or over the phone. Guests included George Lucas, Foo Fighters, Natalie Portman, Tom Jones, Paul McCartney, Dido, Ice Cube, Tom Baker, Richard Park, Take That, a-ha, Ashley Jensen, Trey Parker and Matt Stone, McFly, Nick Park, David Schwimmer, Jason Donovan, Ricky Tomlinson, Peter Kay and Kermit the Frog."]}, {"page": "List of DuckTales characters", "response": ["Downy and Fergus McDuck (voiced by June Foray and Don Messick in the 1987 series; Ashley Jensen and Graham McTavish in the 2017 series) are Scrooge's parents. While the mother and father of Scrooge occasionally have appeared or been referred to in the comics, the names Downy and Fergus were created for their appearances in Don Rosa's 12-part comic book series \"The Life and Times of Scrooge McDuck\".\"The Life and Times of Scrooge McDuck\" by Don Rosa, Gemstone Publishing, "]}, {"page": "Traverse Theatre", "response": ["Tilda Swinton and Forbes Masson memorably performed during the 1980s and Steve Unwin directed Alan Cumming in a 1988 production of The Conquest of the South Pole. Ashley Jensen and Bill Nighy began their acting careers at the Traverse."]}, {"page": "Pilot (Ugly Betty)", "response": ["British actress Ashley Jensen was cast as Christina McKinney, a seamstress and Betty's confidante. Shortly after acquiring an American agent, Jensen travelled to Los Angeles in January 2006 for pilot season. She was sent the script for Ugly Betty and later attended a screen test at the studio, which she described as \"terrifying\". Christina was originally American, but the producers liked Jensen's Scottish accent so much they changed the character's nationality in order for her to keep it and remain British. As well as producing the series, Hayek makes an appearance as a maid on a telenovela watched by the Suarez family. Venezuelan telenovela star Lupita Ferrer also appears in the scene."]}, {"page": "Wilhelmina Slater", "response": ["In Bananas for Betty, Wilhelmina revealed she arranged to have Bradford's sperm extracted after his death in  \"I See Me, I.C.U.. She decided to produce an heir, giving herself a third of the Meade fortune and a place at the company again until the heir comes of age. Because she has a hostile womb, she bribed the seamstress Christina McKinney (played by Ashley Jensen), into being her surrogate. The baby boy was born in There's No Place Like Mode."]}, {"page": "Roughnecks (TV series)", "response": ["The series boasted a high calibre cast, including the likes of Liam Cunningham, Teresa Banham, James Cosmo, Bruce Jones, Clive Russell, Ricky Tomlinson, Paul Copley and Ashley Jensen. Notably for a British television series, the main theme was written and composed by renowned American television composer Mike Post. An official guide to the series, written by Tom McGregor and featuring interviews with the cast and crew, was published on 29 September 1995, prior to the broadcast of the second series. Neither series has been made available on DVD.", "* Ashley Jensen as Heather Butcher (née Brennan)"]}, {"page": "List of Ugly Betty characters", "response": ["Christina McKinney, played by Ashley Jensen, was the first person to befriend Betty when she arrived at Mode; with her knack for office gossip, she revealed to Betty about the true circumstances that led to Betty's hiring as Daniel's assistant. Despite her lack of trust in \"the bitches at Mode\" and especially Wilhelmina, she often became a willing pawn in Wilhelmina's schemes: as an aspiring fashion designer, Christina agreed to deliver evidence that would implicate Bradford Meade for the murder of Fey Sommers; in exchange Wilhelmina featured Christina's designs in the Mode fashion show. Christina admitted that she emigrated from Scotland five years prior to the first season, after abandoning her alcoholic husband Stuart. Stuart would later track Christina down at Mode, where he revealed he had severe liver damage and only had a few months to live, unless he secured the funds for an experimental treatment. Christina promised to get the money, but after her initial attempts failed, she reluctantly accepted Wilhelmina's offer in exchange to serve as the surrogate mother for Wilhelmina and Bradford Meade's child. She later gave birth to the baby (actually her own) during Fashion Week 2009. She eventually leaves with the baby and Stuart to go back to Scotland. She became a famous fashion designer in London and introduces Betty to Mr. Dunne who is a publisher and was last seen in Hilda's bachelorette party."]}, {"page": "Christina McKinney", "response": ["Christina McKinney is a fictional character on the American dramedy Ugly Betty, which aired on ABC between 2006 and 2010. Christina was portrayed by Ashley Jensen. Introduced as a seamstress for the fashion magazine MODE, she is a close friend to the series protagonist Betty Suarez. She became increasingly involved in creative director Wilhelmina Slater's schemes over the course of the show. Jensen left Ugly Betty at the end of its third season to pursue other projects, though she returned the season four episode \"London Calling\". Response to the character was primarily positive.", "While vacationing in the United States, Ashley Jensen auditioned for multiple television projects as part of the pilot season at the suggestion of her talent agent. She was attracted to Ugly Betty for its comedy and treatment of more serious subject matters such as body issues. Since Christina was developed as \"a fast-talking New Yorker\", Jenson mimicked a New York accent for her audition. However, the casting agents encouraged Jensen to use her natural Scottish accent instead, leading to the character being rewritten as Scottish. Before receiving the part, Jensen did screen test and met with the show's producer Salma Hayek. According to The Independent, Jensen's performance as Maggie Jacobs on the British sitcom Extras helped her to secure the role on Ugly Betty. Jensen moved to Los Angeles after the pilot episode was filmed, though her husband Terence Beesley was unable to come with her until later."]}, {"page": "Brothers (Ugly Betty)", "response": ["Ashley Jensen, although credited, was absent from this episode."]}, {"page": "13th Screen Actors Guild Awards", "response": ["** Ugly Betty (ABC) – Alan Dale, America Ferrera, Mark Indelicato, Ashley Jensen, Eric Mabius, Becki Newton, Ana Ortiz, Tony Plana, Stelio Savante, Kevin Sussman, Michael Urie, and Vanessa Williams"]}, {"page": "Derailed (Ugly Betty)", "response": ["This episode was also a tie-in with a contest in which Ashley Jensen's character, Christina, must come up a designer outfit that was created by viewers at home. The winning design was unveiled in this episode.From The Futon Critic 01-14-07 On February 8, 2007 Ricardo Rodriguez of Fort Lauderdale, Florida was announced as the winner.From The Futon Critic 02-08-07"]}, {"page": "Comedy Firsts", "response": ["| style=\"font-size: 100%;\" |The NHS Hillcroft Medical Centre has a vacancy for a practise manager. The receptionist Beryl Oldham (played by Brigit Forsyth) is the favourite for the job, but then pompous ex-Army officer Maurice Ribley (Patrick Barlow) arrives and he is given the job. Also starring Peter Jones as Dr. Roger Capstick, Ashley Jensen as Amanda Cookson, Simon Slater as Dr. Duncan Pettifer and Sarah Lam as Dr. Anna Chen."]}, {"page": "Two Thousand Acres of Sky", "response": ["*Angie Raeburn – played by Ashley Jensen"]}, {"page": "Women in piracy", "response": ["* The \"surprisingly curvaceous\" pirate (voiced by Ashley Jensen) from the 2012 animation The Pirates! In an Adventure with Scientists!."]}, {"page": "Jensen (surname)", "response": ["* Ashley Jensen (born 1969), British actress"]}]}}