{"wiki_id": "http://www.wikidata.org/entity/Q2377165", "itemLabel": "Keith Chapman", "itemDescription": "British television writer and producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Chapman", "wikipedia_page": {"main": "Keith Chapman (born 1959 in Great Yarmouth) is a British television writer and producer, best known as the creator of children's television programmes Bob the Builder and PAW Patrol.", "link_mentions": [{"page": "Great Yarmouth", "response": ["*Keith Chapman (born 1959) children's television writer and producer"]}, {"page": "Basildon", "response": ["* Keith Chapman – creator of Bob The Builder"]}, {"page": "Bob the Builder", "response": ["Bob the Builder is a British stop motion animated children's television series created by Keith Chapman for HIT Entertainment and Hot Animation. In the original series, which aired from 1999 to 2011, Bob appears in a stop motion animated program as a building contractor, specializing in masonry, along with his colleague Wendy, various neighbors, and friends, and their gang of anthropomorphised work-vehicles and equipment. The show is broadcast in many countries but originated from the United Kingdom where Bob was voiced by English actor Neil Morrissey. The show later used CGI animation starting with the spin-off series Ready, Steady, Build!. British proprietors of Bob the Builder and Thomas the Tank Engine sold the enterprise in 2011 to US toy-maker Mattel for $680 million.BBC Radio Four commentary by Gerald Scarfe 8 March 2013; https://www.bbc.co.uk/sounds/play/b01r12ln .", "The third spin-off was titled Bob the Builder: Ready, Steady, Build! It was created by Keith Chapman and Mallory Lewis. The group, now joined by newcomer Scratch are now residing in the town of Fixham Harbour (which is very similar to Bobsville, and is even implied to be Bobsville in several episodes), deal with construction and other building tasks around the area. Unlike previous series, Ready, Steady, Build! is animated in full CGI animation, which allows for larger and more elaborate construction projects that would be too large or expensive for the model sets of the stop-motion series, though it still retains the theme song."]}, {"page": "HIT Entertainment", "response": ["HiT also handled international distribution for Barney & Friends, produced by Lyrick Studios. With the success of Barney, HiT began to develop its own programming. In 1996, HiT was listed on the AIM to raise funding; it used the funding to launch HiT Video that produced direct-to-video programming in the UK. HiT purchased  the television rights for Keith Chapman’s Bob the Builder and started production on the series."]}, {"page": "Norwich University of the Arts", "response": ["*Keith Chapman, television writer and producer, creator of Bob the Builder"]}, {"page": "2005 in British television", "response": ["**Fifi and the Flowertots a new stop motion animated series for children created by Keith Chapman the creator of Bob the Builder begins its screening on Five."]}, {"page": "List of Nelvana programs", "response": ["| Keith Chapman"]}, {"page": "Fifi and the Flowertots", "response": ["Fifi and the Flowertots is a British stop-motion children's television series created by Keith Chapman and produced by Chapman Entertainment and Cosgrove Hall Films. The series originally aired on Five and Nick Jr. in the United Kingdom.", "The series features a group of flower-based characters and their adventures and activities through the garden. The title character and hostess, Fifi Forget-Me-Not, is voiced by Jane Horrocks, while the other characters are voiced by Maria Darling, Tim Whitnall, Marc Silk and John Thomson. This series is animated by Cosgrove Hall Films and produced by Chapman Entertainment. Creator Keith Chapman is also the originator of the Bob the Builder series, which is now owned by Mattel, Chapman also created PAW Patrol and Mighty Express."]}, {"page": "Chapman Entertainment", "response": ["Chapman Entertainment was a British television production company founded by Keith Chapman and Greg Lynn and based in London, England.", "The company was founded by Greg Lynn in London in 2001, together with Keith Chapman and Andrew Haydon a former managing director of John Reid Entertainment, an artist management company. The company was created for the purpose of exploiting both the intellectual property rights of Chapman's creations and also those of interested third parties."]}, {"page": "1959 in the United Kingdom", "response": ["* Keith Chapman, British television writer and producer"]}, {"page": "Kieth Chapman", "response": ["#REDIRECT Keith Chapman"]}, {"page": "James Hornsby School", "response": ["* Keith Chapman Creator of Bob The Builder & PAW Patrol"]}, {"page": "Curtis Organ", "response": ["In October 1972 Keith Chapman accompanied the Lon Chaney silent film \"[The Phantom of the Opera]\" as a fund-raiser for the organ that evolved into an annual campus Halloween event. Cyrus Curtis also gave an Austin organ to nearby Drexel University, and to the auditorium of City Hall in Portland, Maine."]}, {"page": "Roary the Racing Car", "response": ["The series uses a combination of computer-generated imagery and stop-motion animation; the stop frame animation was initially provided by Cosgrove Hall Films, the producer of Noddy's Toyland Adventures, Little Robots, the 2003 Postman Pat series, and many other shows produced by said company, and latterly by Chapman Entertainment's own in-house studio. The series was originated by David Jenkins, who spent four years working in senior management at Brands Hatch Race Circuit. The idea was conceived while watching the Grand Prix on television with his then-18-month-old son, Tom. It was designed and developed by Keith Chapman, creative director of Chapman Entertainment and the creator of Bob the Builder (both 1998 and the later 2015 series), Fifi and the Flowertots, and later, PAW Patrol, and the series executive producer is Greg Lynn. When the show came to the US, HIT Entertainment took the distribution rights, along with Fifi and the Flowertots. The music was done by Kim Goody, who also did the music for Tiny Planets as well (as well as doing the voice for Bong and Halley and singing the theme song)."]}, {"page": "Chapman (surname)", "response": ["*Keith Chapman (born 1958), British children's author and creator of Bob the Builder", "*Keith Chapman (organist) (1945–1989), American organist"]}, {"page": "List of animated feature films of 2004", "response": ["| Bob the Builder: Snowed Under: The Bobblesberg Winter Games ||  || Sarah BallKeith Chapman || HIT EntertainmentHot Animation || CG animation || Direct-to-video || || January 1, 2004 || 52 minutes"]}, {"page": "List of PAW Patrol episodes", "response": ["PAW Patrol is a Canadian CGI–animated television series created by Keith Chapman. It is produced by Spin Master Entertainment, with animation provided by Guru Studio. In Canada, the series is primarily broadcast on TVOntario, which first ran previews of the show in August 2013. The series premiered on Nickelodeon in the United States on August 12, 2013."]}, {"page": "Television program creator", "response": ["* Keith Chapman, created Bob the Builder, Fifi and the Flowertots, and PAW Patrol."]}, {"page": "David Spicer (organist)", "response": ["A native of Austin, Texas, Spicer was a 1968 graduate of the Curtis Institute of Music in Philadelphia, where he was an Artist/Scholar under Alexander McCurdy and a devotee of Virgil Fox. Spicer received his first musical training from his parents, performing on the organ in church at the early age of eight. While at Curtis, Spicer was a classmate and friend of the organist colleague, Dr. Keith Chapman (organist for the famed John Wanamaker organ, center city Philadelphia, PA).  Spicer also completed Graduate studies at Eastern Baptist Theological Seminary in Wynnewood, PA."]}, {"page": "PAW Patrol", "response": ["PAW Patrol is a Canadian computer-animated children's television series created by Keith Chapman. It is produced by Spin Master Entertainment, with animation provided by Guru Studio. In Canada, the series is primarily broadcast on TVOKids, which first ran previews of the show in August 2013. The series premiered on Nickelodeon in the United States on August 12, 2013.", "According to Spin Master, the concept for PAW Patrol stemmed from a prototype for a transforming truck toy that Spin Master co-founder Ronnen Harary designed in 2010. Later the same year, the company requested proposals for a television show based on the transforming toy, and accepted one from Bob the Builder creator Keith Chapman. Chapman sketched early designs of the PAW Patrol team under the working title Raffi & the Rescue Dogs. Spin Master hired toy designers to develop the format further; after the concept was in place, they began designing merchandise."]}, {"page": "Elevation Pictures", "response": ["| align=\"right\"| 2013 || PAW Patrol || Animation, Comedy, Family || Keith Chapman || TVOKids (Canada)Nickelodeon (U.S.) || Nickelodeon Animation Studio, Spin Master Entertainment, Guru Studio"]}, {"page": "Keith Chapman (disambiguation)", "response": ["Keith Chapman is a British television writer and producer who created Bob the Builder and PAW Patrol.", "Keith Chapman may also refer to:", "* Keith Chapman (footballer) (1934–2007), Australian rules footballer", "* Keith Chapman (organist) (1945–1989), American concert organist"]}]}}