{"wiki_id": "http://www.wikidata.org/entity/Q2374697", "itemLabel": "Maurice Ward", "itemDescription": "British hairdresser and inventor mainly known for the invention of a thermal insulator called Starlite.", "wikipedia_url": "https://en.wikipedia.org/wiki/Maurice_Ward", "wikipedia_page": {"main": "Maurice Ward was an English inventor best known for his invention of Starlite, a thermal shielding material.  He was a former hairdresser from Hartlepool, County Durham, England.  Ward believed he should not sell his material directly or allow unsupervised research due to the potential for reverse engineering, and he maintained that he should keep 51% ownership of the formula for Starlite because he valued the material to be worth billions; this is believed to have stunted its commercial success. The formulation for Starlite, a technology which might have revolutionised the world of aerospace and materials science, may have been lost with his passing, although, he hinted during a radio talk show interview that his family might hold information relating to the invention. Starlite was reported to have been acquired by Thermashield, LLC from Ward's family in 2013.", "link_mentions": [{"page": "List of inventors", "response": ["* Maurice Ward (1933–2011), UK – Starlite"]}, {"page": "Starlite", "response": ["Starlite is an intumescent material claimed to be able to withstand and insulate from extreme heat. It was invented by British hairdresser and amateur chemist Maurice Ward (1933–2011) during the 1970s and 1980s, and received significant publicity after coverage of the material aired in 1990 on the BBC science and technology show Tomorrow's World. The name Starlite was coined by Ward's granddaughter Kimberly."]}, {"page": "Amateur chemistry", "response": ["* Maurice Ward, a hairdresser and amateur chemist who invented the thermal insulating material called Starlite."]}, {"page": "Jean Pougnet", "response": ["As opportunity arose during the 1930s, Pougnet left the band scene to concentrate on recitals, concerti, chamber music, broadcasts, recordings, and work in film studios.D. Brook, 1947. His classical reputation in this period is shown in a preserved 'live' recording of the Mozart Sinfonia Concertante with Bernard Shore (principal viola of the BBC Symphony Orchestra) in a Queen's Hall Promenade concert of 8 September 1936, under Sir Henry Wood.CD Symposium 1150. Commercial recordings include Mozart's Rondo in C Major K.373 (Columbia DX769, in 1937) and Mozart's Adagio in E, K.261 (Columbia DX957, in 1939). Pougnet's String Trio, with William Primrose (viola) and Anthony Pini (cello), was broadcasting before the War. (Anthony Pini had recorded with the Pro Arte Quartet during the 1930s and he and Henry Holst were associated with Louis Kentner and Solomon in piano trio recordings during the early 1940s.) With Frederick Riddle replacing Primrose (permanently) at viola desk, Pougnet's trio recorded the E. J. Moeran (1931) String Trio in G major in May 1941.Columbia Records DX 1014–1016. During the War he continued to tour as a soloist in the provinces, sometimes sharing the platform with Leon Goossens or Anthony Pini. In 1943 (6 November) he performed the Mozart Sinfonia Concertante with Maurice Ward (viola) under Sir Adrian Boult for the Royal Philharmonic Society.R. Elkin Royal Philharmonic (Rider, London 1946), 182."]}]}}