{"wiki_id": "http://www.wikidata.org/entity/Q23765977", "itemLabel": "Roy Evans", "itemDescription": "British trade unionist", "wikipedia_url": "https://en.wikipedia.org/wiki/Roy_Evans_(trade_unionist)", "wikipedia_page": {"main": "Roy Lyon Evans  (13 August 1931 – 3 December 2015) was a British trade unionist.\nBorn in Pontarddulais in Wales, Evans' first years were spent speaking only Welsh.  His father died when he was seven years old, after which he and his mother moved to Gorseinon.  He was educated at Gowerton Grammar School, leaving at the age of sixteen to work in a tin mill.Evans completed National Service with the Royal Air Force and joined both the Labour Party and the Iron and Steel Trades Confederation (ISTC).  In 1963, he was appointed as the full-time North West regional organiser, moving to cover West Wales before he was appointed as Deputy General Secretary in 1973, then Assistant General Secretary in 1975.  He was the leading figure in the union's strike of 1980, which achieved a 16% pay rise for members.  The following year, he was elected to the National Executive Committee (NEC) of the Labour Party, on which he voted not to back Peter Tatchell as a candidate, and opposed the Militant Tendency.  As a result of this and his opposition to the UK miners' strike, he lost his NEC seat in 1984.In 1985, Evans was elected as the union's General Secretary, defeating Keith Jones.  He also won election to the General Council of the Trades Union Congress.  He opposed the privatisation of British Steel Corporation, but felt that industrial action would not prevent it, and so took no action.  Retiring in 1993, he described job losses under his leadership as having \"decimated\" the industry.Evans was made an Officer of the Order of the British Empire on his retirement, and returned to live in Wales with his wife.", "link_mentions": [{"page": "Iron and Steel Trades Confederation", "response": [":1985: Roy Evans", ":1975: Roy Evans"]}, {"page": "1931 in Wales", "response": ["**Roy Evans, trade union leader (died 2015)Ian Evans, \"Roy Evans obituary\", The Guardian, 16 December 2015"]}, {"page": "Roy Evans (disambiguation)", "response": ["Roy Evans (born 1948) is an English football player and manager (Liverpool FC).", "Roy Evans may also refer to:", "*Roy Evans (actor), British actor", "*Roy Evans (Australian footballer) (born 1913), Australian rules footballer for Footscray", "*Roy Evans (baseball) (1874–1915), baseball pitcher from 1897–1903", "*Roy Evans (EastEnders), fictional character on the BBC's EastEnders", "*Roy Evans (engineer), Welsh civil engineer and academic", "*Roy Evans (footballer, born 1943) (1943–1969), Welsh international soccer player who died in a car crash in 1969", "*Roy Evans (Neighbours), fictional character on the Australian soap opera Neighbours", "*Roy Evans (rugby league), rugby league footballer of the 1950s and 1960s for Great Britain, and Wigan", "*Roy Evans (table tennis), table tennis player and official; in Welsh Sports Hall of Fame", "*Roy Evans (trade unionist) (1931–2015), Welsh trade union leader"]}, {"page": "Gowerton Comprehensive School", "response": ["* Roy Evans: General Secretary of the Iron and Steel Trades Confederation (1985–93)."]}, {"page": "Deaths in December 2015", "response": ["*Roy Evans, 84, Welsh trade union leader."]}, {"page": "General Council of the Trades Union Congress", "response": ["|rowspan=4| Roy Evans", "|rowspan=3| Roy Evans"]}]}}