{"wiki_id": "http://www.wikidata.org/entity/Q2374889", "itemLabel": "Syms Covington", "itemDescription": "English sailor", "wikipedia_url": "https://en.wikipedia.org/wiki/Syms_Covington", "wikipedia_page": {"main": "Syms Covington (1816–1861) was a fiddler and cabin boy on HMS Beagle who became an assistant to Charles Darwin and was appointed as his personal servant in 1833, continuing in Darwin's service after the voyage until 1839. Originally named Simon Covington, he was born in Bedford, Bedfordshire, England, the youngest child of Simon Covington V and Elizabeth Brown.  After Covington's trip on the Beagle, he then emigrated to Australia and settled as a postmaster, marrying Eliza Twyford there.", "link_mentions": [{"page": "Cocos (Keeling) Islands", "response": ["On 1 April 1836,  under Captain Robert FitzRoy arrived to take soundings to establish the profile of the atoll as part of the survey expedition of the Beagle. To the naturalist Charles Darwin, aboard the ship, the results supported a theory he had developed of how atolls formed, which he later published as The Structure and Distribution of Coral Reefs. He studied the natural history of the islands and collected specimens. Darwin's assistant Syms Covington noted that \"an Englishman [he was in fact Scottish] and HIS family, with about sixty or seventy mulattos from the Cape of Good Hope, live on one of the islands. Captain Ross, the governor, is now absent at the Cape.\""]}, {"page": "Darwin's finches", "response": ["During the survey voyage of HMS Beagle, Darwin was unaware of the significance of the birds of the Galápagos. He had learned how to preserve bird specimens from John Edmonstone while at the University of Edinburgh and had been keen on shooting, but he had no expertise in ornithology and by this stage of the voyage concentrated mainly on geology. In Galápagos he mostly left bird shooting to his servant Syms Covington. Nonetheless, these birds were to play an important part in the inception of Darwin's theory of evolution by natural selection."]}, {"page": "Oxalis enneaphylla", "response": ["Sailors travelling around Cape Horn would consume the leaves to avoid scurvy. This is illustrated by this extract from the Journal of Syms Covington, who sailed aboard  with Charles Darwin. Here he describes the Falkland Islands, and refers to Oxalis enneaphylla as \"wild thyme\":", "While laying here we found it very squally, and at times very cold. The island is in general mountainous. Not a single tree to be seen but there are low brushes with red berries which are very good eating. Here are bullocks horses and pigs that run wild, rabbits, wild geese and ducks and most excellent snipe shooting on the marshy ground and long grass, of which the island in general has very little else. Likewise there is the tea plant, which bears very sweet berry, and wild thyme which we used as tea, and is very good and much more plentiful than the former.Syms Covington, The Journal of Syms Covington (Chapter 4) Online"]}, {"page": "Inception of Darwin's theory", "response": ["At their frequent meetings, Owen argued that intrinsic \"organising energy\" in the \"embryonic germ\" set the lifespan of the species and precluded transmutation. The botanist Robert Brown showed Darwin a different concept, of \"swarming atoms\" inside the germ, allowing nature's self-development. Embarrassed by his lack of labels for his finch specimens, he examined FitzRoy's in the British Museum and contacted seamen including Syms Covington for their collections. From this he was able to relate the finches to separate islands, with distinct species on each island. As well as pressing on with his Journal, he started an ambitious project to get the expert reports on his collection published as a multi-volume Zoology of the Voyage of H.M.S. Beagle. A search for sponsorship was answered when Henslow used his contacts with the Chancellor of the Exchequer Thomas Spring Rice to arrange a Treasury grant of £1,000, a sum equivalent to about £ in present-day terms."]}, {"page": "Pambula, New South Wales", "response": ["Captain John Lloyd, RN, acquired land in 1844 with his severance pay when he left the Royal Navy, and built The Grange on the hill near the river. At about that time he invited the family of Syms Covington to move there. Covington had joined the second survey expedition of HMS Beagle as a fiddler and cabin boy. He became an assistant and manservant to Charles Darwin during the voyage and for a few years afterwards before emigrating to Australia. In 1854 he became Postmaster of Pambula, and managed an inn called the Forest Oak Inn which still stands at a bend on the coast road."]}, {"page": "Galápagos tortoise", "response": ["However, Darwin did have four live juvenile specimens to compare from different islands. These were pet tortoises taken by himself (from San Salvador), his captain FitzRoy (two from Española) and his servant Syms Covington (from Floreana). Unfortunately, they could not help to determine whether each island had its own variety because the specimens were not mature enough to exhibit morphological differences. Although the British Museum had a few specimens, their provenance within the Galápagos was unknown. However, conversations with the naturalist Gabriel Bibron, who had seen the mature tortoises of the Paris Natural History Museum confirmed to Darwin that distinct varieties occurred."]}, {"page": "Second voyage of HMS Beagle", "response": ["At Bahía Blanca, in the southern part of present Buenos Aires Province, Darwin rode inland into Patagonia with gauchos: he saw them use bolas to bring down \"ostriches\" (rheas) and ate roast armadillo. With FitzRoy, he went for \"a very pleasant cruize about the bay\" on 22 September, and about  from the ship, they stopped for a while at Punta Alta. In low cliffs near the point, Darwin found conglomerate rocks containing numerous shells and fossilised teeth and bones of gigantic extinct mammals,; p. 109, Keynes notes the site is now under Puerto Belgrano naval base. in strata near an earth layer with shells and armadillo fossils, suggesting to him quiet tidal deposits rather than a catastrophe.'Cinnamon and port wine': an introduction to the Rio Notebook, Bahía Blanca, September—October 1832. With assistance (possibly from the young sailor Syms Covington acting as his servant), Darwin collected numerous fossils over several days, amusing others with \"the cargoes of apparent rubbish which he frequently brought on board\".", "At the island of \"Buttons Land\" on 23 January 1833, they set up a mission post with huts, gardens, furniture and crockery. Upon returning nine days later, the possessions had been looted and divided up equally by the natives. Matthews gave up, rejoining the ship and leaving the three civilised Fuegians to continue the missionary work. Beagle went on to the Falkland Islands, arriving just after the British return. Darwin studied the relationships of species to habitats and found ancient fossils like those he found in Wales. FitzRoy bought a schooner to assist with the surveying, and they returned to Patagonia, where it was fitted with a new copper bottom and renamed Adventure. Syms Covington assisted Darwin in preserving specimens, and his collecting was so successful that, with FitzRoy's agreement, he hired Covington as a full-time servant for £30 a year.", "Syms Covington stayed with Darwin as his servant. Then, on 25 February 1839 (shortly after Darwin's marriage), Covington left on good terms and migrated to Australia."]}, {"page": "Patagonian weasel", "response": ["The Patagonian weasel or huro (Lyncodon patagonicus) is a small mustelid that is the only member of the genus Lyncodon. Its geographic range is the Pampas of western Argentina and sections of Chile. An early mention of the animal is in the Journal of Syms Covington, who sailed with Charles Darwin on his epic voyage aboard HMS Beagle."]}, {"page": "Mr. Darwin's Shooter", "response": ["Mr Darwin's Shooter is a 1998 novel by Roger McDonald. It describes the life of Syms Covington, manservant to Charles Darwin during Darwin's voyage aboard HMS Beagle.", "The book deals with three periods of Covington's life: childhood, adolescence whilst on , and middle age, where Covington is struggling to deal with the conflict between his religious views and his role in the formulation of the theory of natural selection. Among the many animals Syms Covington shot and prepared for Charles Darwin were the Galápagos finches, which became crucial for his theory."]}, {"page": "Mathew Waters", "response": ["|Syms Covington"]}, {"page": "Covington (surname)", "response": ["*Syms Covington (c. 1816–1861), assistant to Charles Darwin"]}, {"page": "This Thing of Darkness", "response": ["* Syms Covington, cabin boy on HMS Beagle and later a servant of Charles Darwin"]}]}}