{"wiki_id": "http://www.wikidata.org/entity/Q237012", "itemLabel": "Imogen Poots", "itemDescription": "British actress and model", "wikipedia_url": "https://en.wikipedia.org/wiki/Imogen_Poots", "wikipedia_page": {"main": "Imogen Poots (born 3 June 1989) is an English actress and model. She played Tammy in the post-apocalyptic horror film 28 Weeks Later (2007), Linda Keith in the Jimi Hendrix biopic Jimi: All Is by My Side (2013), Debbie Raymond in the Paul Raymond biopic The Look of Love (2013), and Julia Maddon in the American action film Need for Speed (2014). Also in 2014, she portrayed Jesse Crichton in A Long Way Down, along with Pierce Brosnan and Aaron Paul. In 2016, she starred as Kelly Ann in the Showtime series Roadies. In 2020, she played Laura in the Academy Award winning The Father (2020), which starred Anthony Hopkins and Olivia Colman.", "link_mentions": [{"page": "1989", "response": ["* June 3 – Imogen Poots, British actress"]}, {"page": "Who's Afraid of Virginia Woolf?", "response": ["On February 21, 2017, a production directed by James Macdonald began at the Harold Pinter Theatre in London, featuring Imelda Staunton, Conleth Hill, Imogen Poots, and Luke Treadaway. It ran until May 27, 2017."]}, {"page": "28 Days Later", "response": ["A sequel, 28 Weeks Later, was released on 11 May 2007. Danny Boyle and Alex Garland took producing roles alongside Andrew Macdonald. The plot revolves around the arrival of American troops about seven months after the incidents in the original film, attempting to restore order and revitalise a nearly desolate Britain. The cast for this sequel includes Robert Carlyle, Rose Byrne, Jeremy Renner, Imogen Poots, Harold Perrineau, Catherine McCormack, Mackintosh Muggleton and Idris Elba."]}, {"page": "1989 in American television", "response": ["|Imogen Poots"]}, {"page": "Nick Hornby", "response": ["Several of Hornby's books have made the jump from page to screen. Hornby wrote the screenplay for the first, a 1997 British adaptation of Fever Pitch, starring Colin Firth. It was followed by High Fidelity in 2000, starring John Cusack, with the action shifted from London to Chicago. After this success, About a Boy was quickly picked up, and released in 2002, starring Hugh Grant. An Americanized Fever Pitch, in which Jimmy Fallon plays a hopelessly addicted Boston Red Sox fan who tries to reconcile his love of the game with that of his girlfriend (Drew Barrymore), was released in 2005. Johnny Depp purchased film rights to the book A Long Way Down before it was published. The book was made into the 2014 film of the same name starring Pierce Brosnan, Aaron Paul, Toni Collette and Imogen Poots. The film adaptation of Juliet, Naked was released in 2018 starring Rose Byrne, Ethan Hawke and Chris O'Dowd."]}, {"page": "1989 in film", "response": ["**Imogen Poots, English actress"]}, {"page": "Cameron Crowe", "response": ["On June 26, 2016, Crowe's comedy-drama series Roadies premiered on the Showtime television channel. The show, starring Luke Wilson, Carla Gugino and Imogen Poots, tells the story of a colorful road crew who work behind the scenes for a fictional rock band, The Staton-House Band. The pilot episode was written and directed by Crowe, as well as the series finale."]}, {"page": "Sofia Coppola", "response": ["* Marni collection for H&M starring Imogen Poots (2012)"]}, {"page": "Elisabeth Shue", "response": ["In 2010, Shue starred in Piranha 3D as Sheriff Julie Forester. In addition she played the former groupie mother of Abigail Breslin in Janie Jones and a psychologist in Waking Madison alongside Sarah Roemer and Imogen Poots."]}, {"page": "Imelda Staunton", "response": ["Staunton returned to the Harold Pinter Theatre in London West End in 2017 as Martha in Who's Afraid of Virginia Woolf?, starring alongside Conleth Hill, Luke Treadaway and Imogen Poots at the Harold Pinter Theatre. This play was broadcast in National Theatre Live on 18 May 2017."]}, {"page": "Fright Night", "response": ["In May 2009, DreamWorks first announced that it would be overseeing a remake of Fright Night, which came to fruition and was released in 2011 with the same title: Fright Night. The script, penned by Buffy the Vampire Slayer alumna Marti Noxon, loosely followed the plot of the original film. Charley (Anton Yelchin) and his mother (Toni Collette) are transplanted from Corvalis, Iowa, to a Las Vegas suburb; Amy (Imogen Poots) is feistier and sexually aggressive; Evil Ed (Christopher Mintz-Plasse) has endured a falling out with Charley prior to the start of the film; Peter Vincent (David Tennant) is a horror magician modeled after Criss Angel; the Billy Cole character was omitted; and Jerry Dandrige (Colin Farrell) is no longer the lovelorn vampire. He was described by Evil Ed as \"the fucking shark from Jaws\" and has different intentions for his victims."]}, {"page": "Michael Winterbottom", "response": ["The Look of Love, originally announced as The King of Soho until that title had to be dropped due to a legal dispute, is a biography of famed British pornographer/strip club owner/real estate entrepreneur Paul Raymond which reteams Winterbottom with Steve Coogan, who plays Raymond. The film costars Imogen Poots, Anna Friel and Tamsin Egerton and was written by Matt Greenhalgh.\"Imogen Poots, Anna Friel & Tamsin Egerton Join Steve Coogan In Michael Winterbottom's 'The King Of Soho'\" IndieWire, 17 February 2012 It was released in the UK on 26 April 2013."]}, {"page": "Jesse Eisenberg", "response": ["Eisenberg is writing and directing a comedy adaptation of Bream Gives Me Hiccups with Jax Media, starring Parker Posey, Victor Rasuk, and Elliott Smith. A pilot was filmed in June 2016. Non-loginwalled link at bibliogram.pussthecat.org Eisenberg will play the famous mime Marcel Marceau in Resistance, directed and written by Jonathan Jakubowicz. It will focus on Marceau's part in the French resistance during World War II. He will also join Pierce Brosnan and Vanessa Redgrave in a film based on the book The Wreck of Medusa about the painting The Raft of the Medusa as artist Théodore Géricault. Alongside Alexander Skarsgard, Eisenberg will star as a high-frequency trader in Kim Nguyen's tech drama The Hummingbird Project. Eisenberg joined Riley Stearns's dark comedy The Art of Self-Defense alongside Imogen Poots and Alessandro Nivola. Principal photography began in Louisville, Kentucky, on September 11, 2017."]}, {"page": "Gramercy Park", "response": ["*2014: In the film That Awkward Moment, a couple, played by Zac Efron and Imogen Poots, steal a key to the park while being shown a house in Gramercy Park.Foundas, Scott. \"Film Review: That Awkward Moment\", Variety, January 28, 2014. Accessed July 18, 2016. \"Gormican begins and ends That Awkward Moment with Efron's Jason sitting alone and forlorn on a bench in Gramercy Park on a chilly winter's night, and in between flashes back to show us how he got there.\""]}, {"page": "Black Christmas (1974 film)", "response": ["On June 13, 2019, a new remake was announced by Blumhouse Productions. Directed and written by Sophia Takal, co-written by April Wolfe and produced by Jason Blum. Principal photography began on June 24 and wrapped on July 31, 2019, in Dunedin, New Zealand.  Starring Imogen Poots and Cary Elwes, the film was released on December 13, 2019."]}, {"page": "Latymer Upper School", "response": ["*Imogen Poots, actress"]}, {"page": "V for Vendetta (film)", "response": ["**Imogen Poots as Young Valerie Page"]}, {"page": "Sitges Film Festival", "response": ["|Imogen Poots (Vivarium)"]}, {"page": "A Long Way Down", "response": ["The film stars Pierce Brosnan as Martin Sharp, Imogen Poots as Jess Crichton, Toni Collette as Maureen, Aaron Paul as J.J. Sam Neill plays Jess's father."]}, {"page": "Paul Raymond (publisher)", "response": ["The Look of Love (released 26 April 2013) is a film about his life: Michael Winterbottom (director), Steve Coogan (Raymond), Anna Friel (wife, Jean), Imogen Poots (daughter, Debbie) and then-current Paul Raymond Publications employees and editors (extras or pseudo-cameos). The working title was The King of Soho, but this was changed as Howard Raymond had already trademarked it for another (as yet unmade) drama about his father's life; he stated that he had \"never wanted or sought\" to prevent Winterbottom's film being made.Steve Coogan porn king biopic to be renamed, BBC NEWS, 6 July 2012"]}, {"page": "Bouquet of Barbed Wire", "response": ["| Prue Sorenson || Susan Penhaligon || Imogen Poots", "The novel was adapted for ITV by Mammoth Screen,Media Guardian report 21 September 2009 as a three-part series broadcast by ITV on 6–20 September 2010. Adapted by Guy Andrews and directed by Ashley Pearce, it starred Trevor Eve as Peter Manson, Hermione Norris as Cassie Manson, Tom Riley as Gavin Sorenson and Imogen Poots as Prue Sorenson."]}, {"page": "June 1989", "response": ["**Imogen Poots, British actress; in London, England"]}, {"page": "Winnie Holzman", "response": ["From 2014 to 2016, Holzman was one of the producers and writers of the Showtime series Roadies, a behind-the-scenes comedy about people working with a touring rock band created by Cameron Crowe, J. J. Abrams (executive producing), and Holzman, that ran for a season. The series starred Luke Wilson, Imogen Poots, Keisha Castle-Hughes, Peter Cambor, Rafe Spall and Carla Gugino."]}, {"page": "Cassian Elwes", "response": ["| Owen Wilson, Jennifer Aniston, Imogen Poots, Kathryn Hahn, Will Forte, Rhys Ifans, Cybill Shepherd, Ahna O'Reilly, Joanna Lumley, Lucy Punch"]}, {"page": "Stopover in a Quiet Town", "response": ["Lorcan Finnegan and Garret Shanley's Vivarium (2019), in which a couple played by Imogen Poots and Jesse Eisenberg becomes trapped in a deserted housing development, contains multiple references to this episode; in both, a couple is trapped in an artificial environment, ending up right back where they started when they try to get out.Dawn Keetley, \"Vivarium Rewrites The Twilight Zone, Horror Homeroom, April 5, 2020, http://www.horrorhomeroom.com/vivarium-rewrites-the-twilight-zone/"]}, {"page": "28 Weeks Later", "response": ["28 Weeks Later is a 2007  post-apocalyptic horror film directed by Juan Carlos Fresnadillo, who co-wrote it with Rowan Joffé, Enrique López-Lavigne, and Jesus Olmo. The sequel to the 2002 film 28 Days Later, it stars Robert Carlyle, Rose Byrne, Jeremy Renner, Harold Perrineau, Catherine McCormack, Mackintosh Muggleton, Imogen Poots and Idris Elba. It is set after the events of the first film, depicting the efforts of NATO military forces to salvage a safe zone in London, the consequence of two young siblings breaking protocol to find their infected mother, and the resulting reintroduction of the Rage Virus to the safe zone.", "Boyle said in March 2005 that the sequel would feature a new cast, since previous cast members Cillian Murphy, Megan Burns, and Naomie Harris were occupied with their own projects. In September 2006, Robert Carlyle, Rose Byrne, Catherine McCormack, Harold Perrineau, Imogen Poots, Idris Elba, Mackintosh Muggleton and Jeremy Renner were announced as the cast for the sequel.", "In March 2020, Imogen Poots expressed interest in reprising her role. In May 2021, Cillian Murphy expressed interest in potentially reprising his role."]}, {"page": "Buffy the Vampire Slayer in popular culture", "response": ["In 2011 film remake Fright Night vampire hunter Peter Vincent (David Tennant) refers to Charley (Anton Yelchin) and his girlfriend Amy (Imogen Poots) as their \"little Scooby Gang\" because of their desire to kill a vampire."]}, {"page": "List of Irish films", "response": ["| Vivarium || Lorcan Finnegan || Imogen Poots, Jesse Eisenberg || Science Fiction, Thriller ||"]}, {"page": "Roadies (TV series)", "response": ["*Imogen Poots as Kelly Ann Mason, a recently hired lighting rigger with the Staton-House road crew. She is torn between attending film school and staying on with the band. "]}, {"page": "Poots", "response": ["*Imogen Poots (born 1989), British actress"]}, {"page": "List of 28 Days Later characters", "response": ["Tammy Harris (played by Imogen Poots) is the daughter of Don and Alice and older sister to Andy. Unlike her mother and brother, she has no heterochromial eye colours, presumably taking more characteristics from her father, whom, infected, she eventually kills."]}, {"page": "List of American films of 2007", "response": ["| 28 Weeks Later || Fox Atomic || Juan Carlos Fresnadillo (director/screenplay); Rowan Joffé, E. L. Lavigne, Jesus Olmo (screenplay); Robert Carlyle, Rose Byrne, Jeremy Renner, Harold Perrineau, Catherine McCormack, Imogen Poots, Idris Elba, Mackintosh Muggleton, Amanda Walker, Garfield Morgan, Emily Beecham, Philip Bulcock, Roderic Culver, Karen Meagher, Raymond Waring || Horror"]}, {"page": "Miss Austen Regrets", "response": ["Miss Austen Regrets is a 2007 BBC drama film directed by Jeremy Lovering and written by Gwyneth Hughes. It stars Olivia Williams as Jane Austen, with Imogen Poots, Greta Scacchi, Hugh Bonneville, Adrian Edmondson and Jack Huston. It was first aired on 21 August 2007 in the U.K. and on 3 February 2008 in the U.S. by PBS Masterpiece drama anthology television series as part of The Complete Jane Austen, the United States version of The Jane Austen Season.", "* Imogen Poots as Fanny Austen Knight"]}, {"page": "Queen's Gate School", "response": ["*Imogen Poots, actress"]}, {"page": "Jane Austen in popular culture", "response": ["Miss Austen Regrets, a television film starring Olivia Williams as Jane Austen, was released in the same year.  Based on Austen's surviving letters, the semi-biographical television movie focused on the last few years of Jane Austen's life as she looked back on her life and loves and helped her favourite niece, Fanny Knight (Imogen Poots), find a husband."]}]}}