{"wiki_id": "http://www.wikidata.org/entity/Q23799609", "itemLabel": "George Garton", "itemDescription": "English cricketer (born 1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Garton", "wikipedia_page": {"main": "George Henry Simmons Garton (born 15 April 1997) is an English cricketer who plays for Sussex County Cricket Club. He is a left-handed batter who bowls left-arm medium-fast. He made his first-class debut for Sussex against the Leeds/Bradford MCC University side in April 2016. Prior to his first-class debut, Garton was named in England's U19 squad for the 2016 Under-19 Cricket World Cup.In November 2017, Garton was added to England's Test squad for the 2017–18 Ashes series as cover for Jake Ball. In August 2020, in the third round of matches in the 2020 Bob Willis Trophy, Garton took his maiden five-wicket haul in first-class cricket.In June 2021, Garton was named in England's One Day International (ODI) squad for their series against Sri Lanka.On 25 August 2021, Garton was included in the Royal Challengers Bangalore squad for the second phase of the 2021 Indian Premier League (IPL) in the UAE. He made his IPL debut on 29 September 2021 against Rajasthan Royals.In December 2021, Garton was named in England's Twenty20 International (T20I) squad for their series against the West Indies.", "link_mentions": [{"page": "England cricket team", "response": ["| George Garton ||  || Left-handed || Left-arm fast || Sussex ||align=\"center\"| – || T20I ||align=\"center\"| 86 || || – || – || –"]}, {"page": "Sussex County Cricket Club", "response": ["|style=\"text-align:center\"|15|| George Garton ||  ||  || Left-handed || Left-arm fast ||"]}, {"page": "Royal Challengers Bangalore", "response": ["||| George Garton || style=\"text-align:center\"|||  || Left-handed || Left-arm Fast || style=\"text-align:center;\"| 2021 || style=\"text-align:right;\"|  || Overseas"]}, {"page": "List of Indian Premier League players", "response": ["|George Garton"]}, {"page": "Adelaide Strikers", "response": ["|George Garton"]}]}}