{"wiki_id": "http://www.wikidata.org/entity/Q2372265", "itemLabel": "Rob Hume", "itemDescription": "English ornithologist and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Rob_Hume", "wikipedia_page": {"main": "Robert 'Rob' Hume is an English ornithologist, author and journalist specialising in avian and natural history subjects. From Spring 1989 (vol. 12 no. 5), until Summer 2009 (vol. 22 no. 6), he was editor of the RSPB's award-winning Birds magazine, having previously edited the young people's award-winning version, Bird Life, at the RSPB's headquarters, The Lodge.\nHume did his early birdwatching at Chasewater, Staffordshire, and was a member of the West Midland Bird Club. He spent several years studying at Swansea University, during which time he birdwatched regularly at Blackpill and on the Gower Peninsula.\nHe is a past member (and the fifth chairman) of the British Birds Rarities Committee; and a past member of the editorial board of British Birds magazine, but resigned both posts in 1997.  His autobiography, Life With Birds, was published in September 2005.\nHis drawings of birds often appeared in West Midland Bird Club reports and a number of books and journals.He has led wildlife holidays in various European countries, Israel and Africa and has birdwatched widely in Europe, in India and Sri Lanka, Australia, the Caribbean and North America.", "link_mentions": [{"page": "West Midland Bird Club", "response": ["*Rob Hume"]}, {"page": "List of ornithologists", "response": ["*Rob Hume – England"]}, {"page": "British Birds Rarities Committee", "response": ["The committee has two permanent posts, a Chairman and a Secretary: they are appointed by the board of British Birds.Lansdown (1987), p. 488 There had been no fixed term for these appointments before 2008, however, a three-year fixed term, with a limit of ten years, was introduced with the change of chairman in that year.New chairman for BBRC, BBRC Press Release, 4 May 2007 The current chairman, the committee's seventh, is Adam Rowlands;Rarities Committee news: BBRC appoints a new chairman British Birds 100(8):513; BBRC press release, 23 July 2007 the six previous chairmen were Philip Hollom (1959–72), Ian Wallace (1972–76), Peter J. Grant (1976–86), Peter Lansdown (1986–93), Rob Hume (1993–97) and Colin Bradshaw (1997–2008).Dean (2007), Appendix 1, pp. 174–75  The committee's secretary is Nigel Hudson, appointed in 2007.Rarities Committee news: BBRC appoints new secretary British Birds 100(4):254; BBRC press release, 19 March 2007 Its previous secretaries were G. A. Pyman (1959–61), Christopher M. Swaine (1961–63), Denzil D. Harber (1963–66), F. R. Smith (1966–75), J. N. Dymond (1975–77), J. O'Sullivan (1977–78) and Mike Rogers (1978–2006).", "* Rob Hume (1988–97)"]}, {"page": "David Quinn (bird artist)", "response": ["Amongst other publications in which his illustrations are featured is the third edition of the National Geographic Field Guide to the Birds of North America, as well as the Helm Identification Guide to New World Warblers. He has also worked with Rob Hume on a guide to European gulls, yet to be published."]}, {"page": "Peter Hayman (ornithologist)", "response": ["After his education in Taunton school he studied architecture. He worked as an architect for several years in London but in 1969 he became an artist. His main interest was water-colour paintings of British birds. In 1976 the British publisher Mitchell Beazley released the book \"The Birdlife of Britain\" which was written by Philip John Kennedy Burton and illustrated by Hayman. In the 1980s he illustrated some books which were published as Helm Identification Guides. In 1991 he published \"The Complete Guide to the Birdlife of Britain & Europe\". This richly illustrated book with 3,500 water colour paintings which was published in collaboration with Rob Hume was translated in several languages, and became a popular bird guide in Europe.", "*The Complete Guide to the Birdlife of Britain & Europe (1991), by Hayman & Rob Hume - ", "*Birds of Prey of Britain & Europe (2006), by Hayman & Rob Hume - ", "*The Shell Easy Bird Guide (1997), by Rob Hume - "]}, {"page": "Category talk:British journalists", "response": ["Rob Humenot yet classified"]}, {"page": "Hume, R. A.", "response": ["#REDIRECT Rob Hume"]}, {"page": "Hume, Rob", "response": ["#REDIRECT Rob Hume"]}, {"page": "Derek Goodwin", "response": ["He was known as a prolific bird correspondents and was elected as a corresponding member of Deutsche Ornithologen-Gesellschaft in the 1970s, though he never studied German in school. He also taught and mentored noted ornithologists, such as Aubrey Manning, Rob Hume and Desmond Morris when they were students."]}, {"page": "Hume (surname)", "response": ["* Rob Hume, English ornithological writer"]}, {"page": "Robert Hume", "response": ["*Rob Hume, ornithologist"]}, {"page": "List of British scientists", "response": ["* Rob Hume (born 20th century), ornithologist"]}]}}