{"wiki_id": "http://www.wikidata.org/entity/Q2371908", "itemLabel": "Sophie Cox", "itemDescription": "British judoka", "wikipedia_url": "https://en.wikipedia.org/wiki/Sophie_Cox", "wikipedia_page": {"main": "Sophie Cox (born 1981) is a British judo player from Rochdale, Greater Manchester, England. She represented Great Britain at the 2004 Olympics in Greece.  She won silver medals in the 2004 and 2005 European Judo Championships in Romania and the Netherlands. Cox temporarily suspended her judo career in 2005. \nIn 2011, she won one of the bronze medals in the European Judo Championships in Turkey. She represented Team GB in London 2012 Olympic Games at ExCeL London, being knocked out in the first round by Kum Ae An who went on to win the gold medal, in the under 52 kg category.Cox now coaches judo, judo for BJJ and no-gi grappling as well as training in and competing in Brazilian Jiu-Jitsu. She travels all over the UK and Europe to teach and coach but is mostly based in the North West, Rochdale, Stockport, Manchester and Kendal.", "link_mentions": [{"page": "Great Britain at the 2004 Summer Olympics", "response": ["|align=left|Sophie Cox"]}, {"page": "England at the 2002 Commonwealth Games", "response": [":Sophie Cox, women's 57 kg"]}, {"page": "Cox (surname)", "response": ["*Sophie Cox (born 1981), British judoka"]}, {"page": "2005 European Judo Championships", "response": ["| Sophie Cox", "|bgcolor=\"silver\" | 2.||Sophie Cox||"]}, {"page": "2004 European Judo Championships", "response": ["| Sophie Cox", "|bgcolor=\"silver\" | 2.||Sophie Cox||"]}, {"page": "2003 European Judo Championships", "response": ["| Sophie Cox   Sabrina Filzmoser", "|bgcolor=\"CC9966\" | 3.||Sophie Cox||"]}, {"page": "2002 European Judo Championships", "response": ["|7. ||Sophie Cox||"]}, {"page": "Judo at the 2004 Summer Olympics – Women's 57 kg", "response": ["| 1 ||align=\"left\"| Sophie Cox || "]}, {"page": "Great Britain at the 2012 Summer Olympics", "response": ["| style=\"text-align:left;\" | Sophie Cox"]}, {"page": "April 2011 in sports", "response": ["***−52 kg:  Penelope Bonna   Joana Ramos   Ana Carrascosa  & Sophie Cox "]}, {"page": "2011 European Judo Championships", "response": ["|  Ana Carrascosa Sophie Cox", "|bgcolor=\"CC9966\" | 3.|| Sophie Cox || "]}, {"page": "Natalia Yukhareva", "response": ["Yukhareva qualified for the Russian squad in the women's lightweight class (57 kg) at the 2004 Summer Olympics in Athens, by placing third from the European Championships in Bucharest, Romania. She got off to a rough start with a sudden-death defeat from North Korean judoka and 1996 Olympic champion Kye Sun-hui in the prelims. With her opponent moving further into the final, Yukhareva permitted herself a chance for an Olympic bronze medal by immediately clutching Malta's Marcon Bezzina and Great Britain's Sophie Cox in the repechage round, but fell short to France's Barbara Harel by a double yuko and a seoi nage (shoulder throw) in their subsequent match, relegating Yukhareva into the seventh position."]}, {"page": "Elina Nasaudrodro", "response": ["Nasaudrodro qualified for the two-member Fijian judo squad in the women's lightweight class (57 kg) at the 2004 Summer Olympics in Athens, by placing third and receiving a berth from the Oceania Championships in Noumea, New Caledonia. Being young and inexperienced in the senior tournament, Nasaudrodro immediately lost her opening match to highly credentialed British judoka Sophie Cox, who pinned and duly wrapped her on the tatami in a broken scarf hold (kuzure kesa gatame) within a minute."]}]}}