{"wiki_id": "http://www.wikidata.org/entity/Q237074", "itemLabel": "Sally Gunnell", "itemDescription": "British former track and field athlete", "wikipedia_url": "https://en.wikipedia.org/wiki/Sally_Gunnell", "wikipedia_page": {"main": "Sally Jane Janet Gunnell  (born 29 July 1966) is a British former track and field athlete who won the 1992 Olympic gold medal in the 400 metres hurdles. She is the only female British athlete to have won Olympic, World, European and Commonwealth titles, and was the first female 400 metres hurdler in history to win the Olympic and World titles and break the world record. Her former world record time of 52.74 secs in 1993, remained in the world all-time top ten until 2021 and is the current British record. She was made an MBE in 1993 and an OBE in 1998.", "link_mentions": [{"page": "July 29", "response": ["*1966 – Sally Gunnell, English hurdler and sportscaster"]}, {"page": "Stuttgart", "response": ["Since the monumental happenings of the 1980s, Stuttgart has continued being an important centre of not just Europe, but also the world. In 1993, the World Horticultural Exposition, for which two new bridges were built, and World Athletics Championships of that year took place in Stuttgart in the Killesburg park and Mercedes-Benz Area respectively, bringing millions of new visitors to the city. At the 1993 WCA, British athlete Sally Gunnell and the United States Relay team both set world records. In 2003, Stuttgart applied for the 2012 Summer Olympics but failed in their bid when the German Committee for the Olympics decided on Leipzig to host the Olympics in Germany. Three years later, in 2006, Stuttgart once again hosted the FIFA World Cup as it had in 1974."]}, {"page": "Linford Christie", "response": ["During the McVicar case, Christie raised another of his grievances with the media – insinuating comments about the figure-hugging running suits that Christie wore in his races. The term Linford's lunchbox had been coined by The Sun newspaper in reference to the noticeable bulge of Christie's genitalia in his Lycra shorts. He said \"Linford's lunchbox is one of my grievances with the media. I don't like it ... Nobody ever goes on about Sally Gunnell's breasts ... I think it is disgusting, I don't like it at all.\"L. Christie & T. Ward, Linford Christie: An Autobiography (1990, updated 1996 as To Be Honest With You) In court, the judge Mr Justice Popplewell, amused some by tactlessly asking Christie to explain the phrase, asking \"What is 'Linford's lunchbox?'\" The reference to his genital bulge became a part of pop culture at the time, as evidenced in a joke by Nick Hancock: \"There's nothing new you can say about Linford Christie, except he's slow and has got a small penis\"."]}, {"page": "Quorn", "response": ["The initial advertising campaign for Quorn featured sports personalities, including footballer Ryan Giggs, rugby player Will Carling, and Olympic runner Sally Gunnell. In 2013, the company appointed Mo Farah as its ambassador in a marketing push for fitness."]}, {"page": "World Athletics Championships", "response": ["|Women || 400 metres hurdles || 52.74 || Sally Gunnell ||  || 19 August || 1993"]}, {"page": "List of sports announcers", "response": ["* Sally Gunnell – Channel 4 1998–1999, BBC Sport 1999–2006"]}, {"page": "Creatine", "response": ["While creatine's influence on physical performance has been well documented since the early twentieth century, it came into public view following the 1992 Olympics in Barcelona. An August 7, 1992 article in The Times reported that Linford Christie, the gold medal winner at 100 meters, had used creatine before the Olympics. An article in Bodybuilding Monthly named Sally Gunnell, who was the gold medalist in the 400-meter hurdles, as another creatine user. In addition, The Times also noted that 100 meter hurdler Colin Jackson began taking creatine before the Olympics."]}, {"page": "Steve Cram", "response": ["Cram now works as a television presenter and athletics commentator predominantly for BBC Sport and as a motivational speaker. He participated in Prince Edward's 1987 charity television special The Grand Knockout Tournament. Cram starred alongside UK Olympic Gold medalists Sally Gunnell and Adam Eason in BBC's 2006 primetime TV series Run for Glory, helping the runners and participants overcome psychological barriers to running the London Marathon. He was the BBC's lead commentator for the Athletic events at the 2012 Summer Olympics in London. Cram has also presented as part of three Winter Olympics -"]}, {"page": "Chigwell", "response": ["*Sally Gunnell, athlete, pupil at West Hatch High School"]}, {"page": "Athletics at the 1992 Summer Olympics", "response": ["| valign=top| Phylis SmithSandra DouglasJennifer StouteSally Gunnell ||3:24.23"]}, {"page": "Sharron Davies", "response": ["Davies believes that trans women should not be allowed to compete in women's sports. Three national LGBT sports associations in the UK released a statement saying her comments were \"deeply irresponsible transphobia\". Her words were supported by Olympic medal-winning sports women Sally Gunnell, Nicola Adams, and Kelly Holmes."]}, {"page": "Bargain Hunt", "response": ["| Kelly Holmes and Sally Gunnell"]}, {"page": "400 metres hurdles", "response": ["| align=center|11 || align=center|21 || align=center|52.74 || Sally Gunnell||  || 19 AUG 1993 || Stuttgart||", "** Sally Gunnell (GBR), Olympic 1992, World 1993"]}, {"page": "Kelly Holmes", "response": ["Subsequently, Holmes was given the honour of carrying the British flag at the closing ceremony of the games, on 29 August, the day after her second victory. A homecoming parade was held in her honour through the streets of Hildenborough and Tonbridge on 1 September, which was attended by approximately 40,000 people. Holmes won the BBC Sports Personality of the Year in 2004, saying she achieved her goals after \"20 years of dreaming\". She also asserted the award was \"the biggest sporting honour your country can give you\". The tributes to her at the BBC awards ceremony were led by the six British female athletes who had previously won gold at the Olympic Games in a \"Magnificent Seven\"-style feature – those six being Mary Rand, Ann Packer, Mary Peters, Tessa Sanderson, Sally Gunnell and Denise Lewis."]}, {"page": "1993 World Championships in Athletics", "response": ["|Sally Gunnell||52.74WR", "|Linda KeoughPhylis SmithTracy GoddardSally Gunnell||3:23.41"]}, {"page": "Colin Jackson", "response": ["Since ending his athletics career at the 2003 World Indoor Championships Jackson has been involved in numerous endeavours, in athletics and other areas. He coached his close friend the swimmer Mark Foster until Foster's retirement in April 2016. He has coached two of Wales best Olympic prospects, 400m runner Timothy Benjamin and 400m hurdler Rhys Williams. He was also one of the members of the successful London 2012 Olympic bid team and is a key member of the BBC's televisions athletics coverage. However, he started his broadcasting career in 2004 by co-hosting, with Sally Gunnell, the BBC reality TV programme Born to Win."]}, {"page": "Gail Emms", "response": ["Emms has appeared on the sports-based panel show A Question of Sport and is a regular guest on Fighting Talk. On 6 March 2014, she appeared on Sport Relief's Top Dog with her dog Raffa, a Westie. They won their heat, and went on to win the semi-final against Jenni Falconer on 20 March and the final, where they competed against Sally Gunnell."]}, {"page": "Great Britain at the 2004 Summer Olympics", "response": ["23 August saw Britain's first gold medal of the track and field events, Kelly Holmes winning the women's 800 metres. This was Britain's first gold medal on the track since Sally Gunnell won the 400-metre hurdles at the 1992 Barcelona games.", "The BBC's coverage was anchored (at various times of the day) by Craig Doyle, Clare Balding, Suzi Perry, Sue Barker, Steve Rider, Hazel Irvine and Steve Cram. Expert analysts and commentators included Sharron Davies, Jonathan Edwards, Sally Gunnell, Michael Johnson, Colin Jackson, and Steve Redgrave."]}, {"page": "Steyning", "response": ["*Sally Gunnell, former British athlete and gold-medal winner in the 1992 Summer Olympic Games"]}]}}