{"wiki_id": "http://www.wikidata.org/entity/Q237696", "itemLabel": "Phyllida Lloyd", "itemDescription": "Film director, theatre director", "wikipedia_url": "https://en.wikipedia.org/wiki/Phyllida_Lloyd", "wikipedia_page": {"main": "Phyllida Christian Lloyd,  (born 17 June 1957) is an English film director and producer, best known for Mamma Mia! (2008) and The Iron Lady (2011). Her theatre work includes directing productions at the Royal Court Theatre and Royal National Theatre, and opera director for Opera North and the Royal Opera House Covent Garden.", "link_mentions": [{"page": "Cinema of the United Kingdom", "response": ["The first decade of the 21st century was a relatively successful one for the British film industry. Many British films found a wide international audience due to funding from BBC Films, Film 4 and the UK Film Council, and some independent production companies, such as Working Title, secured financing and distribution deals with major American studios. Working Title scored three major international successes, all starring Hugh Grant and Colin Firth, with the romantic comedies Bridget Jones's Diary (2001), which grossed $254 million worldwide; the sequel Bridget Jones: The Edge of Reason, which earned $228 million; and Richard Curtis's directorial debut Love Actually (2003), which grossed $239 million. The most successful of all, Phyllida Lloyd's Mamma Mia! (2008), grossed $601 million."]}, {"page": "John Falstaff", "response": ["*In Phyllida Lloyd's 2017 all-female Donmar Warehouse production of Henry IV (combining both parts), which was videotaped and broadcast, Sophie Stanton played Falstaff."]}, {"page": "Julius Caesar (play)", "response": ["* 2012: An all-female production starring Harriet Walter as Brutus and Frances Barber as Caesar was staged at the Donmar Warehouse, directed by Phyllida Lloyd. In October 2013, the production transferred to New York's St. Ann's Warehouse in Brooklyn."]}, {"page": "Worcester, England", "response": ["Stars who started their careers in the Worcester Repertory Company and the Swan Theatre include Imelda Staunton, Sean Pertwee, Celia Imrie, Rufus Norris, Kevin Whately and Bonnie Langford. Directors too have made a name for themselves: Phyllida Lloyd starting her career as an associate under John Doyle."]}, {"page": "Meryl Streep", "response": ["Streep found major commercial success when she starred in Phyllida Lloyd's Mamma Mia! (2008), a film adaptation of the musical of the same name, based on the songs of Swedish pop group ABBA. Co-starring Amanda Seyfried, Pierce Brosnan, Stellan Skarsgård, Colin Firth, Julie Walters, and Christine Baranski, Streep played a single mother and a former girl-group singer, whose daughter (Seyfried), a bride-to-be who never met her father, invites three likely paternal candidates to her wedding on the idyllic Greek island of Skopelos. An instant box office success, Mamma Mia! became Streep's highest-grossing film to date, with box office receipts of US$602.6 million, also ranking it first among the highest-grossing musical films. Nominated for another Golden Globe, Streep's performance was generally well received by critics, with Wesley Morris of The Boston Globe commenting: \"The greatest actor in American movies has finally become a movie star.\"", "Streep re-teamed with Mamma Mia director Phyllida Lloyd on The Iron Lady (2011), a British biographical film about Margaret Thatcher, which takes a look at the Prime Minister during the Falklands War and her years in retirement. Streep, who attended a session of the House of Commons to see British Members of Parliament (MPs) in action in preparation for her role as Thatcher, called her casting \"a daunting and exciting challenge\". While the film had a mixed reception, Streep's performance gained rave reviews, earning her Best Actress awards at the Golden Globes and the BAFTAs, as well as her third win at the 84th Academy Awards.- -  Former advisers, friends, and family of Thatcher criticized Streep's portrayal of her as \"inaccurate\" and \"biased\". The following year, after Thatcher's death, Streep issued a formal statement describing Thatcher's \"hard-nosed fiscal measures\" and \"hands-off approach to financial regulation\", while praising her \"personal strength and grit\"."]}, {"page": "Tina Turner", "response": ["Turner announced in December 2016 that she had been working on Tina, a musical based on her life story, in collaboration with Phyllida Lloyd and Stage Entertainment. The show opened in London in April 2018 with Adrienne Warren in the lead role. Warren reprised her role on Broadway in the fall of 2019."]}, {"page": "St Catherine's College, Oxford", "response": ["* 2005: Phyllida Lloyd CBE "]}, {"page": "Prospero", "response": ["* Harriet Walter (2017), in Phyllida Lloyd's Donmar Warehouse production, which was set in an all-women's prison and performed by the inmates."]}, {"page": "Golden Globe Award for Best Motion Picture – Musical or Comedy", "response": ["| style=\"text-align:left;\"|Mamma Mia! || Phyllida Lloyd || Benny Andersson, Judy Craymer, Tom Hanks, Phyllida Lloyd, Björn Ulvaeus, & Rita Wilson"]}, {"page": "Caliban", "response": ["*In Phyllida Lloyd's 2017 all-female Donmar Warehouse production set in a women's prison and performed by its inmates, Caliban was played by Sophie Stanton."]}, {"page": "Mamma Mia! (musical)", "response": ["In 1997, Craymer commissioned Catherine Johnson to write the book for the musical. In 1998, Phyllida Lloyd became the director for the show.", "The musical opened in the West End at the Prince Edward Theatre on April 6, 1999, and transferred to the Prince of Wales Theatre on June 9, 2004, where it played until September 2012, when it moved to the Novello Theatre. Directed by Phyllida Lloyd with choreography by Anthony Van Laast, the original cast featured Siobhan McCarthy, Lisa Stokke, and Hilton McRae.'Mamma Mia' listing london-theatreland.co.uk, accessed February 6, 2010\" 'Mamma Mia!' review\", Billboard, April 10, 1999, accessed February 7, 2010", "The musical opened on Broadway at the Winter Garden Theatre on October 18, 2001, after beginning previews on October 5. The director is Phyllida Lloyd with choreography by Anthony Van Laast. As of October 2017, it is the ninth longest-running Broadway show and the longest-running jukebox musical in Broadway history. On April 18, 2013, it was announced that Mamma Mia! would transfer from its home at the Winter Garden Theatre to the Broadhurst Theatre later that year to make way for the musical adaptation of Rocky.\"Broadway's 'Mamma Mia!' Will Transfer to The Broadhurst Theatre\" playbill.com, Retrieved 18 April 2013 The show played its final performance at the Winter Garden Theatre on October 19, 2013 and began performances at the Broadhurst Theatre on November 2, 2013.\" 'Mamma Mia!' to Play Final Performance at Winter Garden Theatre on October 19; Begins at Broadhurst on November 2\" broadwayworld.com, Retrieved 15 July 2013", "Mamma Mia! was adapted as a film, produced by Judy Craymer and Gary Goetzman, written by Catherine Johnson directed by Phyllida Lloyd and with Tom Hanks, Rita Wilson, Björn Ulvaeus, and Benny Andersson as executive producers. Meryl Streep stars as Donna Sheridan and Amanda Seyfried as Sophie and Pierce Brosnan as Sam Carmichael. The movie also features Christine Baranski, Dominic Cooper, Colin Firth, Stellan Skarsgård and Julie Walters. It premiered July 18, 2008, in the US.  Most of the songs remained intact with the exceptions of \"Under Attack\", \"One of Us\", \"Knowing Me, Knowing You\", and \"Thank You for the Music\". \"Knowing Me, Knowing You\" was used as the wedding music and \"Thank You for the Music\" is sung during the second half of the end credits. The first half is occupied with a \"Dancing Queen\" reprise and \"Waterloo\", with a \"Mamma Mia\" reprise and \"I Have a Dream\" sung before the credits (though the latter is sung as Sophie mails the invitations at the start of the film). \"When All Is Said and Done\", a song not used in the musical, was added for the film sung by Sam, Donna, and the company. \"Our Last Summer\" was used earlier in the movie, with Sophie, Bill, Sam, and Harry singing it. \"The Name of the Game\", while filmed, was subsequently edited out of the film for the final cut.  The song is included in full on the motion picture soundtrack  – an abbreviated version of the song and scene appear on the DVD/Blu-ray as a supplement. In addition, \"Thank You for the Music\" is used as a hidden track, and is performed by Amanda Seyfried."]}, {"page": "English National Opera", "response": ["Among the conductors associated with the company have been Colin Davis, Reginald Goodall, Charles Mackerras, Mark Elder and Edward Gardner. The current music director of ENO is Martyn Brabbins.  Noted directors who have staged productions at ENO have included David Pountney, Jonathan Miller, Nicholas Hytner, Phyllida Lloyd and Calixto Bieito. ENO's current artistic director is Daniel Kramer. In addition to the core operatic repertoire, the company has presented a wide range of works, from early operas by Monteverdi to new commissions, operetta and Broadway shows.", "In 2004 ENO embarked on its second production of Wagner's Ring. After concert performances over the previous three seasons,Holden, Anthony \"Sound girl in the Ring\" , The Observer, 30 November 2003 the four operas of the cycle were staged at the Coliseum in 2004 and 2005 in productions by Phyllida Lloyd, with designs by Richard Hudson, in a new translation by Jeremy Sams.Holden, Anthony. \"To Valhalla and back\" , The Observer, 10 April 2005 The first instalments of the cycle were criticised as poorly sung and conducted, but by the time Twilight of the Gods was staged in 2005, matters were thought to have improved: \"Paul Daniel's command of the score is more authoritative than could have been predicted from his uneven accounts of the previous operas.\"Picard, Anna. \"Twilight of the Gods/ENO\", The Independent on Sunday, 10 April 2005 The production attracted generally bad notices. The four operas were given individual runs, but were never played as a complete cycle.Gilbert, p. 556"]}, {"page": "Thomas Newman", "response": ["In 2008 he also scored Sam Mendes' Revolutionary Road. In 2009, he scored Jim Sheridan's Brothers (the remake of the Susanne Bier film). In 2011, he scored Tate Taylor's The Help, John Madden's The Debt, Phyllida Lloyd's The Iron Lady, and George Nolfi's The Adjustment Bureau.", "| Phyllida Lloyd"]}, {"page": "List of theatre directors in the 20th and 21st centuries", "response": ["*Phyllida Lloyd"]}, {"page": "Joan Armatrading", "response": ["In 2016, Armatrading was commissioned by director Phyllida Lloyd and the Donmar Warehouse to write the music to an all-female production of William Shakespeare's The Tempest. Armatrading released an accompanying digital album, The Tempest Songs."]}, {"page": "Stellan Skarsgård", "response": ["| Phyllida Lloyd"]}, {"page": "Malvern St James", "response": ["* Phyllida Lloyd, Director of \"Mamma Mia\""]}, {"page": "Janet McTeer", "response": ["McTeer played Mary, Queen of Scots in Mary Stuart, a play by Friedrich Schiller in a new version by Peter Oswald, directed by Phyllida Lloyd. She acted opposite Harriet Walter as Queen Elizabeth I in London's West End in 2005, a role she reprised in the 2009 Broadway transfer.Jones, Kenneth. \"London's Mary Stuart, With Walter and Tony Winner McTeer, Heading to Broadway in 2009\", Playbill, 14 July 2008. McTeer received a Tony Award nomination for her role in Mary Stuart, and won the Drama Desk Award for Outstanding Actress in a Play.", "In 2016, McTeer played Petruchio in the New York Public Theater Shakespeare in the Park all-female production of The Taming of the Shrew, directed again by Phyllida Lloyd. She co-starred alongside Liev Schreiber in Les Liaisons Dangereuses on Broadway, with McTeer cast as Marquise de Merteuil. The play ran from October 2016 to January 2017."]}, {"page": "Royal Exchange, Manchester", "response": ["* Death and the King's Horseman by Wole Soyinka. World premiere directed by Phyllida Lloyd with George Harris and Claire Benedict (1990)", "Nicholas Hytner (1985–1989), Ian McDiarmid (1986–1988) and Phyllida Lloyd (1990–1991)."]}, {"page": "Reflexive pronoun", "response": ["* Herself (film), a 2020 drama film directed by Phyllida Lloyd"]}, {"page": "Donmar Warehouse", "response": ["In January 2012, Josie Rourke became the third Artistic Director in the Donmar's history. The first production under her leadership was George Farquhar's The Recruiting Officer, which Rourke also directed. Her first season also included Robert Holman's 1987 play, Making Noise Quietly, directed by Peter Gill; Jack Thorne's new version of The Physicists by Swiss playwright Friedrich Duerrenmatt; Brian Friel's Philadelphia, Here I Come!, directed by Lyndsey Turner; and Rourke's own production of Jean Racine's Berenice, in a new translation by Alan Hollinghurst and Phyllida Lloyd's all female Julius Caesar, which later went on to play at the St. Ann's Warehouse, New York.", "The Donmar built a temporary, in-the-round, 420-seat theatre next to King's Cross station. This theatre housed the all-female Shakespeare trilogy: The Tempest, Julius Caesar and Henry IV, directed by Phyllida Lloyd, from September to December 2016."]}, {"page": "Opera North", "response": ["*Winner of the TMA Theatre Award for Outstanding Achievement in Opera 2007 (for Peter Grimes, directed by Phyllida Lloyd),TMA press release  and in 2004"]}, {"page": "Death and the King's Horseman", "response": ["The British premiere was directed by Phyllida Lloyd at the Royal Exchange Theatre in Manchester in 1990. It starred George Harris and Claire Benedict."]}, {"page": "Kim Medcalf", "response": ["Medcalf's post-EastEnders work included a role in a dramatic staged reading of The Penelopiad directed by Phyllida Lloyd at St James's Church, Piccadilly on 23 October 2005, appearances for Children in Need on 18 November 2005 and in South Pacific at the Symphony Hall on 29 & 30 November 2005. In Spring 2006, she undertook a four-month run in the revival of Hay Fever at the Theatre Royal Haymarket alongside Judi Dench."]}, {"page": "Royal Court Theatre", "response": ["* Hysteria by Terry Johnson, directed by Phyllida Lloyd (1993)"]}, {"page": "What the Butler Saw (play)", "response": ["5) In 1995, a Royal National Theatre production of the play premiered in February at the RNT's Lyttelton Theatre and then went on tour prior to returning to the RNT repertoire. Phyllida Lloyd directed the play."]}, {"page": "List of female film and television directors", "response": ["* Phyllida Lloyd (UK)"]}, {"page": "Boston Marriage (play)", "response": ["It was performed in London at the Donmar Warehouse from March 2001 until April 2001. Directed by Phyllida Lloyd, it featured Zoë Wanamaker (Anna), Anna Chancellor (Claire), and Lyndsey Marshal. It moved to the West End at the New Ambassadors Theatre, where it ran from November 28, 2001 until February 16, 2002."]}, {"page": "Patty Jenkins", "response": ["In 2015, Jenkins signed on as director for the DC Extended Universe film Wonder Woman, with a screenplay by Allan Heinberg and a story co-written by Heinberg, Zack Snyder and Jason Fuchs, and starring Gal Gadot.Chitwood, Adam (June 1, 2017). \"'Wonder Woman' Producer Charles Roven on the Many Writers That Tried to Tackle the Script\" . Collider. The film was released in June 2017 and gave Jenkins the biggest domestic opening for a female director, surpassing previous record holder Fifty Shades of Grey by Sam Taylor-Johnson. With this film, Jenkins also became the first female director of an American studio superhero movie. The film was acclaimed by both critics and audiences and grossed over $800 million worldwide, exceeding box office original predictions. Wonder Woman eventually became the highest-grossing film directed by a woman, surpassing previous record holder Mamma Mia! by Phyllida Lloyd. However in 2019, Frozen II directed by Jennifer Lee (with Chris Buck) and Captain Marvel, directed by Anna Boden (with Ryan Fleck) became number 1 and 2 respectively, dropping Wonder Woman and Jenkins to number 3."]}, {"page": "Goldcrest Films", "response": ["Goldcrest Films' financing arms, Goldcrest Pictures and Goldcrest Capital Partners, structure transactions in the media sector.  From 2006 to 2008 — the first two years of operation — the companies provided services on 18 films, including Twilight, Tropic Thunder, Knowing, Eagle Eye, Revolutionary Road and Angus, Thongs and Perfect Snogging.  Goldcrest Capital also raises funds and provides services on UK independent feature films. The first two films of this new initiative were Andrea Arnold's Wuthering Heights - produced by Douglas Rae and Robert Bernstein of Ecosse Films and Kevin Loader and co-financed with the UK Film Council, Film4 and Screen Yorkshire - and Phyllida Lloyd’s biopic of Margaret Thatcher, The Iron Lady. This starred Meryl Streep and was produced by Damian Jones for Pathé, Film4 and the UK Film Council with the participation of Canal+ and Cine Cinema."]}, {"page": "Annette Badland", "response": ["|Phyllida Lloyd"]}, {"page": "Peter Oswald", "response": ["*Mary Stuart (Synopsis: The events leading up to the trial and execution of Mary, Queen of Scots, in 1587, after a play by Friedrich von Schiller) - First Produced 2005 at the Donmar Warehouse (London) and later transferred to the Apollo Theatre in London's West End running until 2006, directed by acclaimed British opera, film and theater director Phyllida Lloyd with Janet McTeer as Mary Stuart and Harriet Walter as Elizabeth I of England. Janet McTeer and Harriet Walter starred also in the 2009 Broadway transfer of the production at the Broadhurst Theatre, New York City.Jones, Kenneth.\"London's Mary Stuart, With Walter and Tony Winner McTeer, Heading to Broadway in 2009\", playbill.com, 14 July 2008. It earned seven Tony Award nominations including Best Revival of a Play. McTeer received a Tony Award nomination for her role in Mary Stuart and won the Drama Desk Award, Outstanding Actress in a Play. In 2008, the play was also produced at the Ensemble Theatre, Sydney, Australia with Kate Raison as Mary Stuart and Greta Scacchi as Elizabeth I of England, who won a nomination for best actress in a lead role at the Sydney Theatre Awards 2008."]}, {"page": "Jackie Clune", "response": ["Clune played Glendower and Westmorland in Phyllida Lloyd's new all-female stage production (world premiere) starring Dame Harriet Walter at the Donmar Warehouse of Henry IV (Parts I and II combined, in October–November 2014) which went to St Ann's Warehouse in NY (USA) until 13 December 2015."]}, {"page": "Karen Dunbar", "response": ["As a comedy actress, she has also tackled serious roles, most notably to date her performance in the poetic monologue A Drunk Woman Looks at the Thistle adapted by Denise Mina from Hugh MacDiarmid's poem of the same name. In between 2012 and 2016, she was featured in Phyllida Lloyd's acclaimed trilogy of all-female Shakespeare plays at the Donmar Warehouse,  playing Casca in Julius Caesar, Bardolph/Vernon in Henry IV and Trinculo in The Tempest."]}, {"page": "Women's cinema", "response": ["Mamma Mia! directed by Phyllida Lloyd became the #5 highest-grossing film of 2008 and the highest-grossing film ever in the United Kingdom. Lloyd's next film, the Margaret Thatcher biopic The Iron Lady (2012) grossed $114 million worldwide. Debbie Isitt has directed successful mainstream films, including \"Confetti\" and the \"Nativity!\" trilogy."]}, {"page": "Mary Stuart (play)", "response": ["The first UK production of Mary Stuart to be staged for the Schiller bicentenary in 2005, was at Derby Playhouse where it ran from 3 to 26 May. Using Robert David MacDonald's translation, the play was directed by Uzma Hameed and starred Hilary Tones as Elizabeth I and Chloe Angharad as Mary Stuart. The production drew parallels between the danger to Elizabethan England from Catholic Rome and the modern threat of Islamist terrorism, and was described by The Stage as \"seriously good drama, powerfully staged.\"  Mary Stuart, which holds a place in the opera repertory in Donizetti's version (as Maria Stuarda), can still hold the stage in its original form as demonstrated in its successful production, given in a 2005 run at the Donmar Warehouse.  Using Peter Oswald's new translation, it was  directed by Phyllida Lloyd and starred Janet McTeer as Mary, Queen of Scots and Harriet Walter as Elizabeth of England. The production transferred to the Apollo Theatre in London's West End, where it also played a sold-out engagement from late 2005 into January 2006. The production opened on Broadway on 30 March 2009 (previews), officially 19 April, for a limited engagement through mid-August. It earned seven Tony Award nominations including Best Revival of a Play."]}, {"page": "The Penelopiad", "response": ["Following a successful dramatic reading directed by Phyllida Lloyd at St James's Church, Piccadilly on 26 October 2005, Atwood finished a draft theatrical script.. The Canadian National Arts Centre and the British Royal Shakespeare Company expressed interest and both agreed to co-produce. Funding was raised mostly from nine Canadian women, dubbed the \"Penelope Circle\", who each donated CAD$50,000 to the National Arts Centre.. An all-female cast was selected consisting of seven Canadian and six British actors, with Josette Bushell-Mingo directing and Veronica Tennant as the choreographer. For music a trio, consisting of percussions, keyboard, and cello, were positioned above the stage. They assembled in Stratford-upon-Avon and rehearsed in June and July 2007.. The 100-minute play was staged at the Swan Theatre between 27 July and 18 August at the National Arts Centre in Ottawa between 17 September and 6 October. Atwood's script gave little stage direction allowing Bushell-Mingo to develop the action. Critics in both countries lauded Penny Downie's performance as Penelope, but found the play had too much narration of story rather than dramatisation... Adjustments made between productions resulted in the Canadian performance having emotional depth that was lacking in Bushell-Mingo's direction of the twelve maids... The play subsequently had runs in Vancouver at the Stanley Industrial Alliance Stage between October 26 and November 20, 2011,. and in Toronto, produced by the Nightwood Theatre and staged at Buddies in Bad Times Theatre between January 10–29, 2012.. The Nightwood Theatre show was directed by Kelly Thornton with choreography by Monica Dottor and starring Megan Follows. A review in The Globe and Mail gave the play 3.5 of 4 stars.."]}, {"page": "Catherine Johnson (playwright)", "response": ["Her career accolades to date include the Bristol Old Vic/HTV Playwriting award (1987), and the Thames Television Writer-in-Residence and Best Play awards (1991) Mamma Mia! was also nominated for an Olivier Award for Best New Musical (2000) and for a Tony Award for Best Book of a Musical Book (2002). Catherine received The UK Film Council script award at The Women in Film and TV 2008 Awards and also jointly with Judy Craymer and Phyllida Lloyd, The ITV achievement of the year award. Mamma Mia! was named Best Musical at the UK National Film Awards in September 2008, and was nominated for the Golden Globe Award for Best Motion Picture - Musical or Comedy in December 2008. In January 2009, Mamma Mia! was nominated for the Outstanding British Film award at the BAFTA 62nd British Academy Film Awards."]}, {"page": "Harriet Walter", "response": ["Walter played Brutus in Julius Caesar in 2012, and the title role in Henry IV in 2014, in all-female productions at the Donmar Warehouse. Both productions transferred to Brooklyn's St. Ann's Warehouse in New York. She was set to reprise both roles, as well as playing Prospero in an all-female production of The Tempest, as part of director Phyllida Lloyd's Shakespeare trilogy at the Donmar's temporary, in-the-round, 420-seat theatre next to King's Cross station in 2016."]}, {"page": "Tony Award for Best Direction of a Musical", "response": ["| Phyllida Lloyd", "| rowspan=\"1\" align=\"center\"| Phyllida Lloyd"]}, {"page": "Tony Award for Best Direction of a Play", "response": ["| Phyllida Lloyd"]}, {"page": "Kevin Davy", "response": ["In 1994, after being recommended by the late Colin Goddard, former studio owner of Moonrakers Studio, Manchester, Davy relocated to London, where he took up the post of trumpet chair and actor/musician at the Donmar Warehouse on their production of the Brecht/Weil, work;The Threepenny Opera directed by Phyllida Lloyd, and under the musical direction of Gary Yershon, and Kate Edgar. Collaborations with writer SuAndi followed, leading to Davy's participation in community-driven projects and a long-standing international tour with the show Afrika Afrika (Oct 2008 – March 2009), conceived by André Heller and choreographed by Georges Mamboye. Produced by Matthias Hoffman."]}, {"page": "Ann Roth", "response": ["| rowspan=4|2008 || Mamma Mia! || Phyllida Lloyd || "]}, {"page": "Douglas Hodge", "response": ["For the National Theatre in May 1994 Hodge played the title role in Phyllida Lloyd's Olivier Theatre staging of Shakespeare's Pericles; and Al' in Stephen Poliakoff's Blinded by the Sun directed by Ron Daniels at the Cottesloe Theatre in May 1997."]}, {"page": "Helen Blatch", "response": ["Born in Southampton, Hampshire, Blatch trained at The Questors Student Group Course, finishing in 1958, and performed with the Questors for some years afterwards. She spent some years in repertory, working with directors such as Sam Walters, David Scase, David Thacker and Phyllida Lloyd. Her performances attracted positive reviews (\"Miss Blatch .. is capable of an extraordinary tranquillity of both voice and manner, against which slight nuances of intonation or expression register with great effect\"; \"Helen Blatch captures perfectly the fragility and neuroses of the regressing morphine addict living in a dream of the past\"; \"Helen Blatch is strong and striking ... Her wit is waspish, her frailty acute, her quest for affection chilling.\")", "| 1987 || Just Between Ourselves || Everyman Theatre, Cheltenham || || Phyllida Lloyd"]}, {"page": "List of opera directors", "response": ["* Phyllida Lloyd (born 1957)"]}, {"page": "Playtone", "response": ["| Phyllida Lloyd"]}, {"page": "Deborah Norton", "response": ["| The School for Scandal  || Richard Brinsley Sheridan || Phyllida Lloyd || Manchester Royal Exchange"]}, {"page": "John Dossett", "response": ["| Phyllida Lloyd", "| Phyllida Lloyd"]}]}}