{"wiki_id": "http://www.wikidata.org/entity/Q23887449", "itemLabel": "Julie Summers", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Julie_Summers", "wikipedia_page": {"main": "Julie Summers (born 1960) is an English author, historical consultant and writer, best known for the book Jambusters. The book focuses on several women who were members of the Women's Institute during World War II and who were inspiration for the ITV series Home Fires. She is the granddaughter of Philip Toosey and the great niece of Sandy Irvine.", "link_mentions": [{"page": "Philip Toosey", "response": ["The film The Bridge on the River Kwai was released in 1957. In the film, the senior  British officer was portrayed as working with the Japanese. This was regarded by many former prisoners of war as a gross travesty of the truth. Toosey initially refused repeated requests by the veterans to speak out against the film, being much too modest to seek any glory or recognition for himself.  Eventually he was persuaded to write a letter to the Daily Telegraph, which caused several other veterans to emphasise the injustice that had occurred.  Nevertheless, the film was highly successful and so formed the public perception of events at Tamarkan.  As a result, Toosey agreed several years later to be interviewed by Professor Peter Davies, providing 48 hours of taped interviews on the understanding that they were not to be published until after Toosey's death.  Eventually Davies documented Toosey's achievements in a 1991 book entitled The Man Behind the Bridge () and a BBC Timewatch programme.  A book by his oldest granddaughter, Julie Summers, The Colonel of Tamarkan, was published in 2005 ().", "* The Colonel of Tamarkan. Philip Toosey and the Bridge on the River Kwai by Julie Summers – Simon & Schuster – London – 2005 .", "*Youtube lecture by Julie Summers"]}, {"page": "Home Fires (British TV series)", "response": ["The series was inspired by the book Jambusters by Julie Summers. With the first series having an average viewing ratings of 6.2 million ITV commissioned a second six-part series, aired in April 2016. The show focuses on a largely female cast, including notable actresses Francesca Annis, Samantha Bond, Claire Rushbrook, Fenella Woolgar and Leanne Best."]}, {"page": "Simon Block", "response": ["Simon Block is a British screenwriter and producer best known for his work on the Julie Summers inspired ITV series Home Fires.", "Block wrote on several popular dramas, such as Lewis, New Tricks and Hotel Babylon, being a recurring writer with his writing credits appearing Series 3 Episode 1, Series 2 Episode 8 and Series 2 Episode 2. Block wrote the first episode of Series 1 of Home Fires alongside Julie Summers who inspired the show with her book. It is about the life of Women's Institute members on the Home Front during the Second World War. The first series is set between September 1939 and early 1940. However following the first episode Block became the main writer, writing 10 episodes to date."]}]}}