{"wiki_id": "http://www.wikidata.org/entity/Q238798", "itemLabel": "Frederic Calland Williams", "itemDescription": "English engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederic_Calland_Williams", "wikipedia_page": {"main": "Sir Frederic Calland Williams,  (26 June 1911 – 11 August 1977), known as F.C. Williams or Freddie Williams, was an English engineer, a pioneer in radar and computer technology.", "link_mentions": [{"page": "August 11", "response": ["*1977 – Frederic Calland Williams, British co-inventor of the Williams-Kilborn tube, used for memory in early computer systems (b. 1911)"]}, {"page": "Max Newman", "response": ["Newman lost no time in establishing the renowned Royal Society Computing Machine Laboratory at the University. In February 1946, he wrote to John von Neumann, expressing his desire to build a computing machine. The Royal Society approved Newman's grant application in July 1946. Frederic Calland Williams and Thomas Kilburn, experts in electronic circuit design, were recruited from the Telecommunications Research Establishment. Kilburn and Williams built Baby, the world's first electronic stored-program digital computer based on Alan Turing's and John von Neumann's ideas."]}, {"page": "University of Manchester", "response": ["Some of the best-known scientists are: John Dalton (founder of modern atomic theory), Ernest Rutherford who proved the nuclear nature of the atom whilst working at Manchester, Ludwig Wittgenstein (considered one of the most significant philosophers of the 20th century, who studied for a doctorate in engineering), George E. Davis (founder of the discipline of chemical engineering), Alan Turing (a founder of computer science and AI, and notable figure in gay rights history), Marie Stopes (pioneer of birth control and campaigner for women's rights),  Bernard Lovell (a pioneer of radio astronomy), Tom Kilburn and Frederic Calland Williams (who developed the Manchester Baby, the world's first stored-program computer at Victoria University of Manchester in 1948), and physicist and television presenter Brian Cox. "]}, {"page": "1946 in science", "response": ["* December 11 – Frederic Calland Williams receives a patent for a random-access memory device."]}, {"page": "Tom Kilburn", "response": ["A graduate of Sidney Sussex College, Cambridge, Kilburn worked on radar at the Telecommunications Research Establishment (TRE) in Malvern under Frederic Calland Williams during the Second World War.  After the war ended, he was recruited by Williams to work on the development of computers at the University of Manchester. He led the development of a succession of innovative Manchester computers that incorporated a host of ground-breaking innovations and developments, including the Ferranti Mark 1, the world's first commercial computer, and the Atlas, one of the first time-sharing multiprocessing computers that incorporated job scheduling, spooling, interrupts, instruction pipelining and paging.", "On graduation, Kilburn was recruited by C.P. Snow. He was given a quick course in electronics, and was posted to the Telecommunications Research Establishment (TRE) in Malvern, where he worked on radar in Group 19 under Frederic Calland Williams. The group was responsible for designing and debugging electronic circuitry. Although Williams was initially disappointed at being given someone with so little practical experience, Kilburn became a valued member of the team. On 14 August 1943, he married Irene Marsden, a shop assistant. They went on to raise a son, John, and a daughter, Anne."]}, {"page": "Royal Society Bakerian Medal", "response": ["*1964 Frederic Calland Williams, Inventive technology: the search for better electric machines"]}, {"page": "Stockport Grammar School", "response": ["*Sir Frederic Calland Williams CBE (1911-1977), engineer and computer pioneer, who developed radar in World War II and the first stored-program digital computer"]}, {"page": "Freddie Williams", "response": ["*Frederic Calland Williams (1911–1977), English engineer"]}, {"page": "Benjamin Franklin Medal (Royal Society of Arts)", "response": ["* 1957 Professor Frederic Calland Williams OBE DSc MIEE FRS, professor of electrical engineering at the University of Manchester"]}, {"page": "Frederick Williams", "response": ["*Frederic Calland Williams (1911–1977), known as Freddie Williams, English engineer"]}, {"page": "Mary Lee Woods", "response": ["Errors with the programs were one problem, but errors caused by the computer were another. The computer frequently misread the binary digits it was given. The engineers thought the mathematicians could compensate for this by programming arithmetic checks, and the mathematicians would too readily assume that a wrong program result was due to a computer error when it was due to a program error. This caused inevitable friction between the mathematicians and the engineers. At the centre of this was a program that Woods had written for inverting a matrix to solve 40 simultaneous equations, which was a large number for the time. The long rows of data required by this calculation took the computer too long to process without an error. For one dispute Woods went to Tom Kilburn, who was second only to Professor Sir Frederic Calland Williams in the engineering department. Kilburn was polite but did not argue, and she felt he was ignoring her complaint. However, 50 years later when she asked him about the exchange, he said that he had not argued \"because [he] knew [she was] right.\""]}, {"page": "List of English inventions and discoveries", "response": ["* 1946–1947: The Williams tube, a cathode ray tube used to store electronically (500 to 1,000 bits of) binary data, developed by Frederic Calland Williams (1911–1977) and Tom Kilburn (1921–2001).", "* 1948: The Manchester Baby – the world's first electronic stored-programme computer – built by Frederic Calland Williams (1911–1977) and Tom Kilburn (1921–2001) at the Victoria University of Manchester.", "* 1949: The Manchester Mark 1 computer developed by Frederic Calland Williams (1911–1977) and Tom Kilburn (1921–2001); historically significant because of its pioneering inclusion of index registers.", "* February 1951: The Ferranti Mark 1 (a.k.a. the Manchester Electronic Computer), the world's first successful commercially available general-purpose electronic computer, invented by Frederic Calland Williams (1911–1977) and Tom Kilburn (1921–2001)."]}, {"page": "Richard Grimsdale", "response": ["Richard Lawrence Grimsdale was born on 18 September 1929 in Australia, where his father, an English engineer, was working on construction of the suburban railway system for the Metropolitan-Vickers company. The family returned to England, where he was educated at Manchester Grammar School, and then studied electrical engineering at Manchester University, where he earned his Bachelor of Science, his Master of Science in 1951, writing a thesis on \"Computing Machines - Design of Test Programmes\", and ultimately his Doctor of Philosophy, writing his thesis on the \"Transistor Digital Computer\" under the supervision of Frederic Calland Williams."]}, {"page": "F.C.Williams", "response": ["#REDIRECT Frederic Calland Williams"]}, {"page": "Freddy (given name)", "response": ["* Frederic Calland Williams (1911–1977), English engineer sometimes known as Freddie Williams"]}, {"page": "Geoff Tootill", "response": ["In 1947, he was recruited by Frederic Calland Williams to join another ex-TRE colleague, Tom Kilburn, at Manchester University developing the world's first wholly electronic stored-program computer. In the UK, three projects were then underway to develop a stored program computer (in Cambridge, the NPL and Manchester) and the main technical hurdle was the memory technology. In order to test the cathode ray tube memory designed by FC Williams when it was constructed, Kilburn and Tootill designed an elementary computer, known as the \"Manchester Baby\". The computer could store 32 instructions or numbers using a single Cathode Ray Tube (CRT). On 21 June 1948, after months of patient work constructing and testing the Baby piece by piece, coping with the unreliable electronic components of the day, the machine finally ran a routine written by Kilburn (they didn't use the word \"program\" then) to find the highest proper factor of a number. In Tootill's words \"And we saw the thing had done a computation\".  A day or two later, the Baby ran successfully for 52 minutes to find the highest proper factor of 218, which required c. 3.5m arithmetic operations."]}, {"page": "List of people with surname Williams", "response": ["*Frederic Calland Williams (1911–1977), English electrical engineer"]}, {"page": "List of British innovations and discoveries", "response": ["*Manchester Baby was the world's first electronic stored-program computer. Developed by Frederic Calland Williams & Tom Kilburn"]}, {"page": "Kirklees College", "response": ["* Tom Kilburn, worked with Frederic Calland Williams to produce the Manchester Mark 1 known as Baby in 1946, one of the first computers, and professor of computer science from 1964–81 at the University of Manchester"]}, {"page": "Peter Baxandall", "response": ["Baxandall attended King's College School in London, then got his BSc in electrical engineering at Cardiff Technical College (1942). He was a radio instructor for the Fleet Air Arm for two years, and then worked for the Telecommunications Research Establishment (at the Circuit Research Division headed by Frederic Calland Williams), later renamed and merged to form the Royal Signals and Radar Establishment, until his retirement in 1971. After retiring he worked as a consultant on various audio projects including loudspeakers, tape duplication, and microphone calibration. During this time he continued to publish, including a \"seminal chapter\" on electrostatic loudspeakers. The Audio Engineering Society made him a Fellow in 1980, and in 1993 awarded him with a Silver Medal for his contributions to the field."]}, {"page": "Sir Frederic Calland Williams", "response": ["#REDIRECT Frederic Calland Williams"]}]}}