{"wiki_id": "http://www.wikidata.org/entity/Q23988337", "itemLabel": "Eric Hatfeild", "itemDescription": "English cricketer (1887-1918)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eric_Hatfeild", "wikipedia_page": {"main": "Charles Eric Hatfeild, MC (11 March 1887 – 21 September 1918), known as Eric Hatfeild, was an English cricketer who played first-class cricket for Oxford University and Kent County Cricket Club in the years before the First World War. Hatfeild was an officer in the Royal East Kent Yeomanry and the East Kent Regiment. He was decorated for gallantry during the war and was killed in action in September 1918 at Cambrai on the Western Front.", "link_mentions": [{"page": "List of cricketers who were killed during military service", "response": ["|Eric Hatfeild"]}, {"page": "Keith Barlow", "response": ["Barlow was commissioned as a 2nd Lieutenant in the Royal East Kent Mounted Rifles (REKMR), part of the reserve Territorial Force South Eastern Mounted Brigade, in 1911 alongside fellow Kent cricketers Allan Leach-Lewis and Eric Hatfeild as well as James Tylden, who went on to play for Kent after the war. His unit was mobilised in Canterbury on 4 August 1914 at the beginning of the First World War, and Barlow was appointed Acting Captain on 30 October.Lewis P, Op. cit., pp.39–41. He remained in the UK when the first line elements of the REKMR were sent to the Gallipoli Campaign in September 1915,Lewis P, Op. cit., p.80.  serving as second in command of the 3/1st REKMR."]}, {"page": "Charles Hatfeild", "response": ["#REDIRECT Eric Hatfeild"]}, {"page": "Kent County Cricket Club in 1910", "response": ["Former captain Cloudesley Marsham made his last first-class appearance for Kent before the First World War against Cambridge University and did not play in a Championship match during the season. Keith Barlow played against both Cambridge and Oxford University, the only first-class appearances of his career. Other than Barlow, four players made their senior debuts for Kent during 1910: Eric Hatfeild, Charles Hooman, Freddie Knott and Percy Morfee. Hooman appeared 15 times for the county during the season, his only season of first-class cricket with Kent."]}, {"page": "List of Marylebone Cricket Club players (1895–1914)", "response": ["* Eric Hatfeild (1911/12) : C. E. Hatfeild (Kent). Tours: South America (1911/12)."]}, {"page": "Hatfeild, Eric", "response": ["#redirectEric Hatfeild"]}]}}