{"wiki_id": "http://www.wikidata.org/entity/Q23901624", "itemLabel": "Reginald Baiss", "itemDescription": "cricketer (1873-1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Reginald_Baiss", "wikipedia_page": {"main": "Reginald Sydney Habershon Baiss (6 March 1873 – 2 May 1955) was an English cricketer who played first-class cricket for Oxford University and Kent County Cricket Club between 1895 and 1901. He was born at Belvedere, Kent and died at Tunbridge Wells.\nBaiss was the son of Sydney and Caroline Baiss. His father was a wholesale drug merchant who operated a business in Bermondsey. Educated at Tonbridge School and at Brasenose College, Oxford, Baiss played cricket as a right-handed lower-order batsman and a wicket-keeper. Baiss appeared in three matches for the Oxford side in 1895, two of them games against Kent, and in the first of these he scored an unbeaten 52 which was his highest first-class score. He was not however picked for the University Match and did not win a cricket Blue, although he won two rugby union Blues during his time at Oxford. Both during the university term and afterwards he also played in several matches for Kent in a season when the county used nine wicket-keepers. After an absence of six years from the first-class game, he re-appeared for the county in two games in the 1901 season. In club cricket he was a \"prolific scorer\" for Lessness Abbey and Sevenoaks Vine and played for Band of Brothers, an amateur side closely associated with the Kent county club.Working as a stockbroker, Baiss also represented Kent in both rugby and field hockey. In 1909, he is recorded in The Times as the secretary of the London Playing Fields Society, the organisation set up in 1890 to promote the use of London's open spaces for organised sport, with an address in Kensington, London. He married Lucy Hope Hallowes in 1908; his only son, James, played a in two first-class cricket matches for Oxford University and one for Free Foresters.", "link_mentions": [{"page": "Baiss", "response": ["* Reginald Baiss (1873–1955), English cricket player"]}]}}