{"wiki_id": "http://www.wikidata.org/entity/Q23954", "itemLabel": "Ken Johnson", "itemDescription": "jazz band leader and dancer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_%22Snakehips%22_Johnson", "wikipedia_page": {"main": "Kenrick Reginald Hijmans Johnson (10 September 1914 – 8 March 1941), known as Ken \"Snakehips\" Johnson, was a swing band leader and dancer. He was a leading figure in black British music of the 1930s and early 1940s before his death while performing at the Café de Paris, London, in the Blitz during the Second World War.\nJohnson was born in Georgetown, British Guiana (present-day Guyana). He showed some musical ability, but his attraction to dancing was opposed by his father, who wished him to have a career in medicine. He was schooled in Britain, but instead of continuing on to university, he travelled to New York, perfecting dance moves and immersing himself in the vibrant jazz scene in Harlem. He returned and set up the West Indian Dance Orchestra, a nearly all-black swing band, with Leslie Thompson, a Jamaican musician. In 1937 he legally took over the band, causing Thompson and several musicians to leave. He filled the vacancies with musicians from the Caribbean, and the band's popularity grew.\nFrom 1938 the band began broadcasting on BBC Radio, recorded their first discs and appeared in an early television broadcast. Increasingly popular, they were employed as the house band at the Café de Paris, an upmarket and fashionable nightclub located in a basement premises below a cinema. A German bombing raid on London in March 1941 hit the cinema, killing at least 34 and injuring dozens more. Johnson and one of the band's saxophonists were among those killed, and several other band members were injured.\nThe West Indian Dance Orchestra were the leading swing band in Britain at the time, well-known through their radio broadcasts, and popular, but their impact was more social than musical. As an all-black orchestra playing the most up-to-date music of the time, Johnson was seen as a pioneer for black musical leaders in the UK. When the band broke up after Johnson's death, the members had an impact on the nature and sound of British jazz. Johnson was tall, elegant, and modelled himself professionally on Cab Calloway. In 1940 he began a relationship with Gerald Hamilton, a man twenty years older than he. After Johnson's death Hamilton never travelled without a framed photograph of him, always referring to him as \"My Husband\".\n\n", "link_mentions": [{"page": "Ken Johnson", "response": ["*Ken Johnson (defensive end, born 1947) (born 1947), American football defensive end for the Cincinnati Bengals, played 1970–1977", "*Ken Johnson (defensive end, born 1955) (born 1955), American football defensive end for the Buffalo Bills and the Kansas City Chiefs", "*Ken Johnson (Canadian football) (born 1951), gridiron football quarterback, primarily in the CFL (1978–1982)", "*Ken Johnson (basketball, born 1962), American basketball player for Michigan State and the Portland Trail Blazers", "*Ken Johnson (basketball, born 1978), American basketball player for Ohio State and the Miami Heat", "*Ken Johnson (left-handed pitcher) (1923–2004), American baseball player, played 1947–1952", "*Ken Johnson (right-handed pitcher) (1933–2015), American baseball player, 1958–1970; pitched a no-hitter in 1964 game he lost", "*Ken Johnson (footballer) (1931–2011), English-born association footballer who played for Hartlepools United", "*Ken Johnson (racing driver) (born 1962), American CART driver 1988–1989", "*Ken Johnson or Slick (wrestling) (born 1957), American professional wrestling manager", "*Ken Johnson (athlete) (1928–2015), British distance runner", "*Ken Johnson (sport shooter) (born 1968), American sport shooter", "*Ken Johnson (art critic) (born 1953), American art critic", "*Ken Johnson (Alabama politician), member of the Alabama House of Representatives"]}, {"page": "Lawrence Benjamin Brown", "response": ["In his 2017 book, Fighting Proud, in the chapter dedicated to Ken Johnson, historian Stephen Bourne lists Brown as one of the many jazz musicians, whose homosexuality \"has not been fully acknowledged.\""]}]}}