{"wiki_id": "http://www.wikidata.org/entity/Q239157", "itemLabel": "Robert Henry Codrington", "itemDescription": "Anglican priest and anthropologist (1830-1922)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Henry_Codrington", "wikipedia_page": {"main": "Robert Henry Codrington (15 September 1830, Wroughton, Wiltshire – 11 September 1922) was an Anglican priest and anthropologist who made the first study of Melanesian society and culture. His work is still held as a classic of ethnography.\nCodrington wrote, \"One of the first duties of a missionary is to try to understand the people among whom he works,\" and he himself reflected a deep commitment to this value. Codrington worked as headmaster of the Melanesian Mission school on Norfolk Island from 1867 to 1887. Over his many years with the Melanesian people, he gained a deep knowledge of their society, languages, and customs through a close association with them. He also intensively studied \"Melanesian languages\", including the Mota language.", "link_mentions": [{"page": "Mana", "response": ["Missionary Robert Henry Codrington traveled widely in Melanesia, publishing several studies of its language and culture. His 1891 book The Melanesians: Studies in their Anthropology and Folk-Lore contains the first detailed description of mana. Codrington defines it as \"a force altogether distinct from physical power, which acts in all kinds of ways for good and evil, and which it is of the greatest advantage to possess or control\"."]}, {"page": "Magic (game terminology)", "response": ["\"Mana\" is a word that comes from Polynesian languages meaning something along the lines of \"supernatural power\". The concept of mana was introduced in Europe by missionary Robert Henry Codrington in 1891 and was popularized by Mircea Eliade in the 1950s. It was first introduced as a magical fuel used to cast spells in the 1969 short story, \"Not Long Before the End\", by Larry Niven, which is part of and later popularized by his The Magic Goes Away setting. It has since become a common staple in both role-playing and video games."]}, {"page": "R. H. Codrington", "response": ["#REDIRECT Robert Henry Codrington"]}, {"page": "Mwotlap language", "response": ["Robert Henry Codrington, an Anglican priest who studied Melanesian societies, first described Mwotlap in 1885. While focusing mainly on Mota, Codrington dedicated twelve pages of his work The Melanesian Languages to the \"motlav\" language. Despite being very short, this description can be used to show several changes that occurred in Mwotlap during the 20th century. Furthermore, Codrington described Volow, a language closely related to Mwotlap (sometimes even considered a dialect of Mwotlap). Volow, almost extinct today, was spoken in the east of Mota Lava, in the area of Aplow."]}, {"page": "Qat (deity)", "response": ["Robert Henry Codrington (1891), The Melanesians: Studies in their Anthropology and Folklore. now called Ro-Lei.  They lived together until one day Qat's mother reproached her daughter-in-law and made her cry.  Ro-Lei's tears washed away the earth which covered her wings; she put them on and flew away. Qat shot an arrow with a rope tied to it into the roots of a great banyan tree in the sky and climbed after her into the sky world, but later as he climbed down with Ro-Lei, the root snapped and he plunged to his death, while she flew safely away."]}, {"page": "Austronesian peoples", "response": ["In linguistics, the Malayo-Polynesian language family also initially excluded Melanesia and Micronesia, due to what they perceived were marked physical differences between the inhabitants of these regions from the Malayo-Polynesian speakers. However, there was growing evidence of their linguistic relationship to Malayo-Polynesian languages, notably from studies on the Melanesian languages by Georg von der Gabelentz, Robert Henry Codrington and Sidney Herbert Ray. Codrington coined and used the term \"Ocean\" language family rather than \"Malayo-Polynesian\" in 1891, in opposition to the exclusion of Melanesian and Micronesian languages. This was adopted by Ray who defined the \"Oceanic\" language family as encompassing the languages of Southeast Asia and Madagascar, Micronesia, Melanesia, and Polynesia."]}, {"page": "Codrington", "response": ["* Robert Henry Codrington, (1830–1922), British Anglican priest and anthropologist"]}, {"page": "Robert Codrington", "response": ["*Robert Henry Codrington (1830–1922), English Anglican priest and anthropologist "]}, {"page": "Mota language", "response": ["Robert Henry Codrington compiled the first dictionary of Mota (1896), and worked with George Sarawia and others to produce a large number of early publications in this language. "]}, {"page": "Reverend Codrington", "response": ["#REDIRECT Robert Henry Codrington"]}, {"page": "Robert Codrington (missionary)", "response": ["#REDIRECT Robert Henry Codrington"]}, {"page": "Efatese language", "response": ["*Robert Henry Codrington (1885) \"Fate, Sandwich Islands\", in The Melanesian Languages, 471–476. Oxford: Clarendon Press."]}]}}