{"wiki_id": "http://www.wikidata.org/entity/Q2394411", "itemLabel": "Anthony Milner", "itemDescription": "English musical composer and tutor", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Milner", "wikipedia_page": {"main": "Anthony Francis Dominic Milner (13 May 1925 – 22 September 2002) was a British composer, teacher and conductor.\nMilner was born in Bristol, and educated at Douai School, Berkshire. He was awarded a bursary to attend the Royal College of Music, where he studied piano with Herbert Fryer and theory with R. O. Morris. He studied composition privately with Mátyás Seiber. Milner's own teaching career began at Morley College, London, where he taught music theory and history from 1948 to 1964. He was lecturer in music at King's College London, from 1965 to 1971, when he moved to Goldsmiths' College as senior lecturer, becoming principal lecturer in 1974. In 1980 he was appointed full-time principal lecturer at the Royal College, where he had taught part-time since 1961. He remained in this post until his retirement in 1989.Milner had close academic ties with North America. Beginning in 1964, he gave frequent summer lecture tours in the USA and Canada. Milner's teaching interests centred on twentieth-century British music and on sacred and liturgical music. He was Composer-in-Residence at the Summer School of Liturgical Music at Loyola University New Orleans in 1965 and 1966, and the first director of Spode Music Week, an annual residential Music school that places particular emphasis on the music of the Roman Catholic liturgy.In 1985 Pope John Paul II appointed Anthony Milner a Knight of St. Gregory, in recognition of his work for Catholic liturgical music.Milner's early compositions were influenced by Michael Tippett, who was Morley College's music director at the time of his appointment to the staff. As he developed his own voice, he continually  sought new ways of expressing himself within an essentially tonal style.  Contrapuntal rigour and the influence of plainsong are evident in most of his works. Choral works with religious texts are central to his output. The Water and the Fire a dramatic oratorio,  was premiered at the 1964 Three Choirs Festival in Hereford. A commission for the Leicestershire Schools Music Festival in 1967 resulted in a Te Deum, first performed by the Leicestershire Schools Symphony Orchestra and Chorus in May 1967 under the direction of the composer. But there are also orchestral works, including the Variations for Orchestra (1959) and three Symphonies (1972, 1978 and 1986), and some chamber music.From 1954 to 1965 Milner was director and harpsichordist of the London Cantata Ensemble, with whom he gave the first broadcast performances in the UK of many Buxtehude cantatas as well as frequently conducting performances of his own music.Milner was homosexual but non-practising due to his Catholic faith.", "link_mentions": [{"page": "Mátyás Seiber", "response": ["Seiber emigrated to England in 1935 and settled in London, after his marriage in Caterham, Surrey at 169 Stafford Road. He only became a British citizen after the war. Seiber taught composition and cello privately while working as a consultant for the subsidiary of Schott in London and composed film music. Michael Tippett invited him to be a professor of composition at Morley College in London, and from 1942 he was on the staff there; he became a teacher of composition, music aesthetics, and music theory. His students included Peter Racine Fricker, Don Banks, Anthony Milner, Hugh Wood, Karel Janovický, Malcolm Lipkin, John Exton, Wally Stott (who later became Angela Morley) and Barry Gray. During this period, he created and trained his choir, the Dorian Singers."]}, {"page": "David Matthews (composer)", "response": ["David Matthews read Classics at Nottingham University and afterwards, feeling himself still too much self-taught, studied composition with Anthony Milner; he was also much helped by the advice and encouragement of fellow British composer Nicholas Maw. Then, for three years, he was associated with Benjamin Britten and the Aldeburgh Festival. Not until he was 25 did he produce a work that satisfied him sufficiently to be pronounced his 'Opus 1'. He has largely avoided teaching, but to support his composing career has been employed in much editorial work and orchestration of film music. He has also written occasional articles and reviews for various music journals - the culmination of which activity being his 1980 book about Sir Michael Tippett, a composer he admires enormously."]}, {"page": "Morley College", "response": ["*Anthony Milner"]}, {"page": "John Buller (composer)", "response": ["John Buller was born in London on 7 February 1927.  His musical career began as a chorister at St Matthew's, Westminster. Although the BBC accepted a work of his in 1946, he opted to earn his living as an architectural surveyor. Buller returned to music in his thirties, taking an external London University BMus in 1964 after private study with Anthony Milner. He gave up his surveying work in 1974 and from then was a full-time composer."]}, {"page": "Anthony Gilbert (composer)", "response": ["Gilbert, who was born in London on 26 July 1934, trained initially as a translator, then studied composition with Mátyás Seiber privately, and with Alexander Goehr and Anthony Milner at Morley College (Williams 2001). He also studied with Gunther Schuller at Tanglewood. He was head of the School of Composition at the Royal Northern College of Music until 1999. Amongst his students there were Simon Holt, Martin Butler and James Saunders. He is published by the University of York Music Press (since 1994) and Schott Music (works prior to 1994)."]}, {"page": "Paul Steinitz", "response": ["Steinitz's music making was not restricted to Bach and other Baroque composers. He was a champion of contemporary, mostly British, composers. Commissions and first performances were established in the 1950s and 1960s and included works by Stravinsky (Canticum Sacrum, guest conducted by Robert Craft, in 1956), Bruno Maderna, Luigi Dallapiccola, Peter Maxwell Davies, John Tavener, Anthony Milner, Stanley Glasser (sung in Zulu), Christopher Brown, Geoffrey Burgon and his own pupil Nicholas Maw."]}, {"page": "Hugh Wood", "response": ["Wood was born in Parbold, Lancashire and grew up in a musical family; while still a teenager, he was encouraged by the composer Alan Bush. He says that his \"earliest enthusiasm was Bach... and that's been at the center of everything ever since.\"In conversation with Robert Worby on BBC Radio 3's Hear and Now program (broadcast 16 June 2012) After military service in Egypt, he studied History at New College, Oxford, where he dedicated much of his time to music and writing compositions for the theatre. In 1954, he moved to London to study composition privately with William Lloyd Webber, Anthony Milner, Iain Hamilton, and Mátyás Seiber. He also started a parallel career as a music teacher by finding work in schools, including Morley College, and as a lecturer at the Royal Academy of Music."]}, {"page": "R. O. Morris", "response": ["Morris became famous as an exceptional  teacher of counterpoint, and wrote several texts including Introduction to Counterpoint (Oxford 1944), Contrapuntal Technique in the Sixteenth Century (Oxford, 1922), Foundations of Practical Harmony and Counterpoint, Volume 1 of The Oxford Harmony (1946), and The Structure of Music (Oxford, 1935).Morris, Reginald Owen, by H C Colles and Howard Ferguson, Grove Music Online, 2001 From 1926 for two years he taught at the Curtis Institute in Philadelphia. His students included the composers Gerald Finzi, Sir Michael Tippett, Constant Lambert, Robin Milford, Anthony Milner, Edmund Rubbra, Bernard Stevens and Jean Coulthard. "]}, {"page": "Leicestershire Schools Symphony Orchestra", "response": ["Over the years the orchestra's repertoire has included a number of specially commissioned works by composers such as Sir Michael Tippett (The Shires Suite), David Bedford (Alleluia Timpanis), Bryan Kelly (Sancho Panza, Sinfonia Concertante), Anthony Milner (Te Deum), Alan Ridout (Concertante Music, Symphony No.2, Funeral Games for a Greek Warrior), Brian Bonsor (The Pied Piper of Hamelin), William Mathias (Sinfonietta), Herbert Baumann (Variations on an Old English Folk Song), and Herbert Chappell (Overture Panache)."]}, {"page": "List of symphony composers", "response": ["*Anthony Milner (born 1925), British composer of 3 orchestral symphonies and a symphony for organ"]}, {"page": "Douai School", "response": ["*Anthony Milner (1925–2002), composer"]}, {"page": "Oboe concerto", "response": ["*Anthony Milner"]}, {"page": "Meredith Davies", "response": ["*Anthony Milner's cantata St Francis, with the City of Birmingham Chorus and Symphony Orchestra (1959)", "*Anthony Milner's Symphony No 2, with the Royal Liverpool Philharmonic Orchestra (late 1970s)"]}, {"page": "John Carmichael (composer)", "response": ["John Carmichael was born in Melbourne in 1930. He studied piano with Margaret Schofield and in 1947 won a scholarship to the Melbourne Conservatorium of Music, where his teacher was Raymond Lambert. He also studied composition with Dorian Le Gallienne. Moving to Europe, he studied at the Paris Conservatoire with Marcel Ciampi and in London with Arthur Benjamin and Anthony Milner, a pupil of Mátyás Seiber. He wrote the music for Britain's Festival of Women during this period. He also wrote reviews and critiques for music magazines."]}, {"page": "Surendran Reddy", "response": ["Surendran Reddy was born in Durban, South Africa on 9 March 1962. He grew up in Zimbabwe where he started his musical career at an early age. He studied piano at the Rhodesian Academy of Music in Bulawayo and already did concert tours as a classical pianist at the age of 13. At 15 he won a scholarship which took him to the Royal College of Music in London where he studied from 1977 to 1981 with inter alia Bernard Roberts and Yonty Solomon (piano), George Malcolm (harpsichord), Virginia Pleasants (forte piano), Anthony Milner (Harmony and counterpoint). From 1981 to 1982 he studied musicology at King's College, London University with inter alia Brian Trowell, Reinhard Strohm, Pierluigi Petrobelli and Thomas Walker. He graduated at the age of 19 having won numerous awards. While still a student he had opportunities to perform at London's Wigmore Hall, St Martin-in-the-Fields and Queen Elizabeth Hall. "]}, {"page": "Uncovered (film)", "response": ["*Anthony Milner as Inspector"]}, {"page": "Malcolm Lipkin", "response": ["From 1954 to 1957 Lipkin studied composition with Mátyás Seiber and later read music externally at London University for his B.Mus. under the guidance of Dr. Anthony Milner, eventually being awarded the degree of D.Mus.Lond for his published, reviewed, publicly performed works. His first major success was the Violin Sonata No 1 (1957), which received over 100 performances within a year of its composition.Burn, Andrew. Liner notes to Recollections, Divine Art CD DDA 25202 (2020) This was written for the violinist Yfrah Neaman and premiered by Neaman and Howard Ferguson. "]}, {"page": "List of fellows of the Royal College of Music", "response": ["* Anthony Milner, 1973"]}, {"page": "Herbert Fryer", "response": ["* Anthony Milner, composer."]}, {"page": "List of music students by teacher: K to M", "response": ["===Anthony Milner==="]}, {"page": "Deaths in September 2002", "response": ["*Anthony Milner, 77, British musician."]}, {"page": "Milner, Anthony", "response": ["#redirectAnthony Milner"]}]}}