{"wiki_id": "http://www.wikidata.org/entity/Q24074205", "itemLabel": "Jack Aitchison", "itemDescription": "Scottish association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Aitchison", "wikipedia_page": {"main": "Jack Aitchison (born 5 March 2000) is a Scottish professional footballer who plays as a forward for Forest Green Rovers on loan from Barnsley.", "link_mentions": [{"page": "Celtic F.C. Player of the Year", "response": ["*Academy Player of the Year: Jack Aitchison"]}, {"page": "2000 in the United Kingdom", "response": ["* 5 March – Jack Aitchison, footballer"]}, {"page": "Arsenal F.C. supporters", "response": ["*Jack Aitchison"]}, {"page": "2000 in Scotland", "response": ["* 5 March – Jack Aitchison, footballer"]}, {"page": "John Aitchison (disambiguation)", "response": ["John or Jack Aitchison may also refer to:", "* Jack Aitchison (born 2000), Scottish footballer ", "* Jack Aitchison (Australian footballer) (1911–1976), Australian rules footballer", "* Jack Aitchison, candidate in Midlothian Council election, 2007 and 2012"]}, {"page": "Scottish Premiership", "response": ["; Youngest goalscorer: Jack Aitchison, for Celtic v Motherwell, 16 years and 71 days"]}, {"page": "List of Celtic F.C. records and statistics", "response": ["*Youngest first-team player: Jack Aitchison, 16 years, 71 days (against Motherwell, 15 May 2016)", "*Youngest goalscorer: Jack Aitchison, 16 years, 71 days (against Motherwell in Scottish Premiership, 15 May 2016)."]}, {"page": "History of Celtic F.C. (1994–present)", "response": ["Deila was criticised for Celtic's poor European campaign, and a series of indifferent performances in the league saw him placed under further scrutiny. In April 2016, Celtic suffered a 5–4 loss on penalties to Old Firm rivals Rangers in the semi-final of the Scottish Cup, after a 2–2 extra-time draw in which Celtic fought back against the newly promoted Championship side twice to level the score. Three days later, Deila announced his resignation from his post once Celtic had finished the season. Nevertheless, Deila led Celtic to their fifth consecutive League championship, clinching the title on 8 May with a 3–2 win over nearest challengers Aberdeen. Celtic finished the season a week later with an emphatic 7–0 win over Motherwell, seeing Deila depart the club on a high note after two years in charge. The seventh goal in that game was scored by debutant Jack Aitchison, who at 16 years and 71 days old became both the youngest player ever to represent the club in a competitive match and the youngest goalscorer."]}, {"page": "2015–16 Celtic F.C. season", "response": ["|99||||FW||Jack Aitchison", "|align=center|Jack Aitchison"]}, {"page": "2017 UEFA European Under-17 Championship qualification", "response": ["* Jack Aitchison"]}, {"page": "2016–17 Celtic F.C. season", "response": ["|76||||FW||Jack Aitchison"]}, {"page": "Jack Aitchison (footballer, born 2000)", "response": ["#REDIRECT Jack Aitchison"]}, {"page": "Karamoko Dembélé", "response": ["On 3 October 2016, Dembélé gained widespread media attention after making his debut for Celtic's under-20 side aged 13 playing with and against players who were up to seven age groups above him. He was named on the bench because several regular starters were away playing for Scotland's under-19 team and was brought in during the 81st minute, replacing the youngest first-team player in Celtic's history, the 16-year-old Jack Aitchison. A match report on the official Celtic website stated that \"the diminutive playmaker didn't look out of place and played his part in the closing stages.\" The response to Dembélé's U20 debut included concern about the physical and mental impact of such a young player being fast-tracked through the developmental ranks. On 2 June 2017, Dembélé signed a youth registration contract to stay at Celtic."]}, {"page": "2018 UEFA European Under-19 Championship qualification", "response": ["* Jack Aitchison"]}, {"page": "Rory Currie", "response": ["In January 2017, he was named as one of the Daily Records Scottish footballing prospects for 2017 alongside Tony Gallagher, Matthew Knox, Ronan Hughes,  Liam Burt and Jack Aitchison. Currie suffered a serious knee ligament injury in November 2017. He was subsequently loaned to East Fife, Forfar Athletic and Linfield."]}, {"page": "2017–18 SPFL Development League", "response": ["|align=\"left\"| Jack Aitchison"]}, {"page": "2018–19 Celtic F.C. season", "response": ["| align=\"left\" |  Jack Aitchison", "| align=\"left\" |  Jack Aitchison"]}]}}