{"wiki_id": "http://www.wikidata.org/entity/Q24034678", "itemLabel": "Ross Thomson", "itemDescription": "Scottish politician (born 1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ross_Thomson", "wikipedia_page": {"main": "Ross Thomson (born 21 September 1987) is a former Scottish Conservative Party politician who was the Member of Parliament (MP) for Aberdeen South from June 2017 to November 2019. Thomson was the first Conservative MP elected for Aberdeen South since the 1992 general election. He was a Member of the Scottish Parliament (MSP) for the North East Scotland region from May 2016 until June 2017. He was elected to Aberdeen City Council in the 2012 local elections.\n\n", "link_mentions": [{"page": "North East Scotland (Scottish Parliament electoral region)", "response": ["|rowspan=\"2\"|Ross Thomson(Conservative)"]}, {"page": "List of Aberdonians", "response": ["*Ross Thomson (born 1987), politician and former MSP, former Conservative MP for Aberdeen South"]}, {"page": "Aberdeen South (UK Parliament constituency)", "response": ["Ross Thomson of the Conservatives went on to gain the seat at the 2017 snap general election with a majority of 4,752 votes (10.6%) ahead of the sitting SNP MP Callum McCaig.", "| Ross Thomson"]}, {"page": "List of gay, lesbian or bisexual people: T–V", "response": ["| Ross Thomson "]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Ross Thomson; MP for Aberdeen South (2017–2019) "]}, {"page": "List of Question Time episodes", "response": ["|Ross Thomson, Kezia Dugdale, Mike Russell, Fraser Nelson, Val McDermid"]}, {"page": "James Dornan", "response": ["In May 2019, Dornan was accused of homophobia after using the word 'fag' to describe a gay Conservative MP, Ross Thomson. The Scottish Conservatives complained that \"Dornan has form when it comes to making crass and offensive remarks\" and he apologised for his use of language."]}, {"page": "University of Aberdeen Conservative and Unionist Association", "response": ["* Ross Thomson - Former Member of Parliament for Aberdeen South and former Member of the Scottish Parliament for North East Scotland."]}, {"page": "Callum McCaig", "response": ["McCaig was elected as the Member of Parliament for Aberdeen South at the 2015 general election, where he won the seat from Labour's Anne Begg with a 20% swing. However, at the 2017 United Kingdom general election, he lost to Conservative candidate Ross Thomson. McCaig was subsequently appointed as a special adviser to SNP leader and First Minister Nicola Sturgeon."]}]}}