{"wiki_id": "http://www.wikidata.org/entity/Q24052675", "itemLabel": "Peter Chapman", "itemDescription": "politician (born 1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Chapman_(politician)", "wikipedia_page": {"main": "Peter John Chapman MSP (born 13 May 1950) is a retired Scottish Conservative and Unionist politician. He served as a Member of the Scottish Parliament (MSP) for the North East Scotland region between 2016 and 2021. In the Scottish Parliament, he was the Conservative spokesperson for rural economy and connectivity, until May 2018 when he resigned over a lobbying row.", "link_mentions": [{"page": "North East Scotland (Scottish Parliament electoral region)", "response": ["|rowspan=\"3\"|Peter Chapman(Conservative)"]}, {"page": "Lumphanan", "response": ["Lumphanan is in the Aberdeenshire Council ward of Aboyne, Upper Deeside and Donside. The three councillors for the ward are Paul Gibb (Scottish Conservative and Unionist Party), Geva Blackett (SNP) and Peter Argyle (Scottish Liberal Democrats). It is in the Scottish Parliament Constituency of Aberdeenshire West, represented by Alexander Burnett (politician) of the Conservatives. For Scottish elections, it is represented by seven list MSPs for North East Scotland - 4 Conservatives; Peter Chapman (politician), Liam Kerr, Bill Bowman (Scottish politician) and Tom Mason (Scottish politician) 2 Scottish Labour Party - Jenny Marra and Lewis MacDonald and one Liberal Democrat - Mike Rumbles. Lumphanan is in the UK Parliament constituency of West Aberdeenshire and Kincardine, also represented by a Conservative, Andrew Bowie."]}, {"page": "Opposition Shadow Cabinets of the Scottish Parliament", "response": ["|Peter Chapman"]}, {"page": "Endorsements in the 2016 United Kingdom European Union membership referendum", "response": ["Scottish Conservative MSPs also included Miles Briggs, Peter Chapman, Jackson Carlaw, John Lamont, Alex Johnstone, Rachael Hamilton, Liz Smith, Donald Cameron, Adam Tomkins, Douglas Ross, Brian Whittle, Finlay Carson and Annie Wells."]}, {"page": "Peter Chapman", "response": ["Peter Chapman may refer to:", "* Peter Chapman (politician) (born 1950), Scottish Conservative politician", "* Peter Chapman (murderer) (born 1977), English convicted murderer", "* Peter Chapman (cartoonist) (1925–2016), Australian comic book writer and illustrator", "* Coins (composer) (Peter Chapman, born 1980), Canadian music producer and composer"]}]}}