{"wiki_id": "http://www.wikidata.org/entity/Q2405597", "itemLabel": "Terry Fields", "itemDescription": "British politician (1937-2008)", "wikipedia_url": "https://en.wikipedia.org/wiki/Terry_Fields", "wikipedia_page": {"main": "Terence Fields (8 March 1937 – 28 June 2008) was a British politician and firefighter. A member of the Militant group, he was the Labour Member of Parliament for Liverpool Broadgreen from 1983 to 1992. He was expelled from the Labour Party in 1991 with the rest of Militant. Earlier he had been on the executive of the Fire Brigades Union.", "link_mentions": [{"page": "Poll tax", "response": ["Mass protests were called by the All Britain Anti-Poll Tax Federation with which the vast majority of local Anti-Poll Tax Unions (APTUs) were affiliated. In Scotland, the APTUs called for mass nonpayment, which rapidly gathered widespread support and spread as far as England and Wales even though no-payment meant that people could be prosecuted. In some areas, 30% of former ratepayers defaulted. While owner-occupiers were easy to tax, nonpayers who regularly changed accommodation were almost impossible to trace. The cost of collecting the tax rose steeply, and its returns fell. Unrest grew and resulted in a number of poll tax riots. The most serious was in a protest at Trafalgar Square, London, on 31 March 1990, of more than 200,000 protesters. Terry Fields, Labour MP for Liverpool Broadgreen, was jailed for 60 days for his refusal to pay the poll tax."]}, {"page": "1983 United Kingdom general election", "response": ["|Terry Fields"]}, {"page": "1992 United Kingdom general election", "response": ["Sitting MPs Dave Nellist, Terry Fields, Ron Brown, John Hughes and Syd Bidwell, who had been expelled or deselected by the Labour Party and stood as independents, were all defeated, although in Nellist's case only very narrowly. Tommy Sheridan, fighting the election from prison, polled 19%.", "|Terry Fields"]}, {"page": "Poll tax (Great Britain)", "response": ["The opposition Labour Party, at its 1988 annual conference, decided against support for a non-payment campaign.Andy McSmith Faces of Labour: The Inside Story, London: Verso, 1996, p.114 In July 1991, Terry Fields, Labour Member of Parliament (MP) for Liverpool Broadgreen, and a member of the Militant tendency, was imprisoned for sixty days for refusing to pay. At the time of Fields' jailing, Labour leader Neil Kinnock commented: \"Law makers must not be law breakers.\"\"1991: Anti-poll tax MP jailed\", BBC on this Day, 11 July"]}, {"page": "Socialist Campaign Group", "response": ["* Terry Fields (expelled in 1991 for his membership of the Militant tendency)"]}, {"page": "Richard Alexander (British politician)", "response": ["He adopted a maverick approach in the House of Commons, and was never made a Minister. He was fully in support of the Conservatives on defence issues, describing Tony Benn's approach to the Falklands war as a \"prima facie case of treason and sedition\" and strongly opposing the \"no first use\" pledge on nuclear weapons. On other issues he was more moderate, being a member of the Tory Campaign for Homosexual Equality for a time (he resigned over a controversial article which suggested that Prince Charles should embrace Prince Edward in order to advance their campaign).  Alexander could also appear a classic Tory. He faithfully supported Margaret Thatcher, bridled at the poor dress sense of the Labour MP Terry Fields (a member of the Militant group), supported rate capping of left-wing councils, and sought the abolition of Wages Councils which set minimum pay rates."]}, {"page": "Rosie Cooper", "response": ["At the 1992 general election, now a Liberal Democrat, she was back in her native Liverpool, coming second at Liverpool Broadgreen 7,027 votes behind Labour's Jane Kennedy, but ahead of the former deselected Labour MP Terry Fields."]}, {"page": "Liverpool Edge Hill (UK Parliament constituency)", "response": ["When the constituency disappeared for the 1983 general election, 59.85% of its territory was transferred to the new constituency of Liverpool Mossley Hill, where David Alton was re-elected. The remaining 40.15% of the seat fell into Liverpool Broadgreen, which was won by the Labour left-winger Terry Fields."]}, {"page": "Dave Nellist", "response": ["When Tony Blair was first elected to Parliament in 1983, he initially shared an office with Nellist at the Palace of Westminster. The duo's differing political views were considered not to make for the most harmonious working environment, so Blair was quickly allocated office space with  Gordon Brown, another newly elected Labour MP, and Nellist subsequently shared the office of the other Militant supporting MP, Terry Fields.Tam Dalyell, \"Terry Fields: Labour MP from the Militant Tendency who was jailed for 60 days for refusing to pay the poll tax\", The Independent, 2 July 2008. (accessed 12 April 2013)", "Nellist in 1991 was one of the two MPs who were supporters of Militant, which had been found to contravene the Labour Party constitution several years earlier. Following a National Executive Committee meeting in December 1991, along with Terry Fields he was expelled from the Labour Party and deselected as a candidate for the 1992 general election."]}, {"page": "List of United Kingdom MPs: F", "response": ["*Terry Fields (1983–1992)"]}, {"page": "Pat Wall", "response": ["Wall died in the intensive care unit at Bradford Royal Infirmary on Monday 6 August 1990.\"Labour MP Dies After Long Illness\" The Times, 7 August 1990 More than 700 people attended a memorial meeting held after his funeral, the speakers including Arthur Scargill, Max Madden MP, Dennis Skinner MP, Dave Nellist MP, Bob Cryer MP and Terry Fields MP.\"Pat Wall Memorial Meeting\" Militant, 24 August 1990"]}, {"page": "Ron Brown (Scottish politician)", "response": ["In 1991 he visited Terry Fields MP, who had been imprisoned for 60 days for not paying his poll tax. He was accompanied by Jeremy Corbyn MP, Bernie Grant MP and Ken Livingstone MP. They made a secret recording of Fields, an action contrary to visitation rules. However, transgressing these rules carried no penalty. The group said the recording was made at the request of a journalist."]}, {"page": "1991 in the United Kingdom", "response": ["* 11 July – Labour MP, Terry Fields, joins the list of people jailed for refusal to pay the poll tax after he receives a sixty-day prison sentence. He is the first MP to be jailed for refusing to pay the controversial tax which was introduced early last year."]}, {"page": "Modern Records Centre, University of Warwick", "response": ["The Centre also holds the papers of several Labour Members of Parliament: Richard Crossman, Maurice Edelman, Terry Fields, William Hamling, Pat Wall, and William Wilson."]}, {"page": "Terence Fields", "response": ["#REDIRECTTerry Fields"]}, {"page": "Liverpool Broadgreen (UK Parliament constituency)", "response": ["|rowspan=\"2\"| Terry Fields"]}, {"page": "De La Salle Academy, Liverpool", "response": ["* Terry Fields, Labour MP from 1983-92 for Liverpool Broadgreen;"]}, {"page": "Anti-Poll Tax Unions", "response": ["The Anti-Poll Tax Unions played a major part in the legal actions in which around 20 million people were summoned for non-payment of the tax. Those jailed included Terry Fields, MP for Liverpool Broadgreen."]}, {"page": "Premiership of Margaret Thatcher", "response": ["The poll tax was introduced in Scotland in 1989 and England and Wales in 1990. This highly visible redistribution of the tax burden onto the less well-off proved to be one of the most controversial policies of Thatcher's premiership. Additional problems emerged when many of the tax rates set by local councils proved to be much higher than earlier predicted. Opponents organised to resist bailiffs and disrupt court hearings of community charge debtors. One Labour MP, Terry Fields, was jailed for 60 days for refusing to pay."]}, {"page": "Deaths in June 2008", "response": ["*Terry Fields, 71, British MP for Liverpool Broadgreen (1983–1992), lung cancer."]}, {"page": "List of elected British politicians who have changed party affiliation", "response": ["|Terry Fields"]}, {"page": "1991 in England", "response": ["* 11 July - Labour Party MP, Terry Fields, joins the list of people jailed for refusal to pay the poll tax after he receives a 60-day prison sentence. He is the first MP to be jailed for refusing to pay the controversial tax which was introduced early last year."]}, {"page": "Socialist Party (England and Wales)", "response": ["The Socialist Party (SP) was formerly the Militant group which practised entryism in the Labour Party around the Militant newspaper. Founded in 1964, the Militant newspaper described itself as the \"Marxist voice of Labour and Youth\". In the 1980s, Militant supporters Dave Nellist, Pat Wall and Terry Fields were elected to the House of Commons as Labour MPs. In 1982, Liverpool District Labour Party adopted Militant's policies for Liverpool City Council in its battle against cuts in the rate support grant from government, and came into conflict with the Conservative government.", "In 1989–1990, Militant led the All-Britain Anti-Poll Tax Federation, which organised a non-payment campaign against the poll tax. Terry Fields was jailed for refusing to pay the poll tax and expelled from the Labour Party for defying the law. The Labour Party had earlier found Militant guilty of operating as an entryist group, contrary to the party's constitution.", "The Socialist Party argues that the Labour Party under the leadership of Tony Blair and since \"has deprived the working people in Britain of any kind of political representation\"Socialism in the 21st Century p. 10 and campaigns for a new mass party of the working class based on the trade unions and the working class movement. It argues that political representatives such as Members of Parliament should only receive the \"average workers wage\", and its parliamentary candidates would only take the average wage of a skilled worker, if elected, in the same way that Labour MPs who supported Militant (the forerunner of the Socialist Party) – Terry Fields, Dave Nellist and Pat Wall – did in the 1980s. In elections, when not standing as part of an alliance, the Socialist Party fields candidates as Socialist Alternative. The right to stand under the name Socialist Party was won by the Socialist Party of Great Britain, which was founded in 1904."]}]}}