{"wiki_id": "http://www.wikidata.org/entity/Q24060307", "itemLabel": "Georgia Stanway", "itemDescription": "association football player (born 1999)", "wikipedia_url": "https://en.wikipedia.org/wiki/Georgia_Stanway", "wikipedia_page": {"main": "Georgia Marie Stanway (born 3 January 1999) is an English footballer who plays as a forward for FA Women's Super League club Manchester City and the England national team. She has also represented England at various youth levels.\nIn 2016, Stanway was nominated for BBC Young Sports Personality of the Year. In 2017, she was nominated for PFA Women's Young Player of the Year. In June 2018, she was named in the UEFA Women’s Champions League squad of the season. In 2019, she was awarded PFA Women's Young Player of the Year.", "link_mentions": [{"page": "Stanway", "response": ["* Georgia Stanway (b. 1999), English association football player"]}, {"page": "List of people from Barrow-in-Furness", "response": ["* Georgia Stanway - footballer for England and Manchester City"]}, {"page": "2016 FIFA U-17 Women's World Cup", "response": ["* Georgia Stanway"]}, {"page": "2015 UEFA Women's Under-17 Championship qualification", "response": ["* Georgia Stanway"]}, {"page": "2016 UEFA Women's Under-17 Championship", "response": ["* Georgia Stanway", "* Georgia Stanway"]}, {"page": "2018 FIFA U-20 Women's World Cup", "response": ["| Georgia Stanway"]}, {"page": "Leah Williamson", "response": ["On 14 October 2018, Arsenal laid down a huge marker in their title challenge with a 5–0 thrashing of champions Chelsea, inflicting a first home defeat on the champions since July 2016. Williamson said, \"This result means everything, regardless of league standings, we want to be the Arsenal of old, the Arsenal that everyone doesn’t want to play.\" As a die hard Arsenal fan, the win meant a lot to Williamson. \"I said to Mitch [Emma Mitchell] as we were walking over, as an Arsenal supporter I hope that they feel it, that I feel exactly what they’re feeling watching this game. First and foremost I’m a supporter of this football club.\" Joe Montemurro began utilizing Williamson on the right of a back 3 and after a 4–0 win at Bristol City on 28 October, in which Williamson assisted Jordan Nobbs for one of the goals, he said, \"Leah’s really adapting to a bit more of a pro-active defending methodology. She’s got a bit of freedom to go forward and I’m really enjoying working with her. She’s getting the rewards for the amazing work that she’s put in over pre-season and the season so far, so all credit to her.\" Arsenal won their first 9 games and went into the match with Man City 6 points clear of their title rivals. By the time Arsenal faced Man City on 2 December, their injury crisis was such that they were forced to start 17 year old Paige Bailey Gayle in an injury hit team that lost 2–0 to a brace by Georgia Stanway. Two games later, a 2–1 home defeat to Chelsea which happened to be Williamson's 100th Arsenal appearance allowed Man City to move a point clear albeit having played one game more. On the injury situation, Williamson said, \"Obviously injuries are a factor and everyone can see we’re down to the bare bones at the moment and it was before Christmas. But genuinely, we are not a team that makes excuses and it’s not something we’re talking about. We are focusing more on how to get the ball from A to B, for example.\" On the achievement of reaching 100 appearances at the age of just 21. Williamson added, \"It’s funny, I was just talking to my mum and we said I could have done it much more quickly were it not for injuries. Naturally, I am always striving for more. In our meeting room at the training ground, the names of all the women who have made 100 appearances are on the wall and I look at some of the names on that wall and, without being too much of a fan girl, a lot of them are my heroes. It’s amazing to be up there now in their company. But it’s about the future for me too and the first 100 is amazing and especially at my age, I really do aim to get a few hundred more yet with this football club and in this shirt. This is more than just a football club to me. My family are all Arsenal supporters and they remind me every day that I am living a dream to play here and I hope that I have made them proud. Important day for me and them, I just wish we could have won\". "]}, {"page": "2015 Manchester City W.F.C. season", "response": ["||12||||Georgia Stanway                          ||FW||  3 ||  1 ||   ||   ||   ||   ||   ||   || 2 || 1 ||   ||   ||  5 ||  2 ||   ||  ", "|12||  || Georgia Stanway      || FW ||  1 || 0 || 1 ||  2", "| Georgia Stanway"]}, {"page": "2016 UEFA Women's Under-17 Championship qualification", "response": ["* Georgia Stanway"]}]}}