{"wiki_id": "http://www.wikidata.org/entity/Q24025938", "itemLabel": "Clare Haughey", "itemDescription": "Scottish politician (born 1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Clare_Haughey", "wikipedia_page": {"main": "Clare Joan Haughey (née Donnelly, born April 1967) is a Scottish politician serving as Minister for Children and Young People since 2021, having previously served as Minister for Mental Health from 2018 to 2021. A member of the Scottish National Party (SNP), she has served as a Member of the Scottish Parliament (MSP) for Rutherglen since in the 2016.", "link_mentions": [{"page": "Rutherglen", "response": ["In 1999, the Scottish Parliamentary constituency of Glasgow Rutherglen was created, with the same boundaries as the then UK parliamentary constituency. In 2011, The constituency was redrawn and renamed simply Rutherglen (although it also encompasses Cambuslang and Blantyre). Following the 2016 elections, Clare Haughey (SNP) is the MSP for Rutherglen. The defeated incumbent James Kelly (Labour) was elected as a list MSP for the Glasgow region which includes Rutherglen due to the town's proximity to the city.Boundary changes create new Rutherglen seat, but area remains in Glasgow region, Daily Record, 2 June 2010 All local representatives have strong personal ties to the area.", "* Clare Haughey, SNP MSP (for Rutherglen)"]}, {"page": "Scottish Government", "response": ["|Clare Haughey "]}, {"page": "Cambuslang", "response": ["In the 2016 elections, Clare Haughey won the seat for the SNP with 15,222 votes, giving a majority of 11.4%, replacing James Kelly who had been elected both in 2007 and 2011. Kelly remained in the Parliament as a 'list member' elected on a regional proportional representation basis."]}, {"page": "Education in Scotland", "response": ["| data-sort-value=\"McDonald\" | Clare Haughey MSP"]}, {"page": "Glasgow (Scottish Parliament electoral region)", "response": ["| rowspan=\"2\"| Clare Haughey(SNP)"]}, {"page": "Malky Mackay", "response": ["In December 2016, the Scottish Football Association (Scottish FA) appointed Mackay as its performance director, responsible for overseeing the development of young players. The appointment was criticised by some people, including politician Clare Haughey, due to Mackay's previous behaviour. The anti-racism campaign group Kick It Out made comments that were supportive of Mackay, pointing out that he had since received equality and diversity training from the (English) FA."]}, {"page": "Trinity High School, Rutherglen", "response": ["*Clare Haughey, politician"]}, {"page": "Gilbertfield Castle", "response": ["In March 2017, an application by Persimmon Homes to build over 400 houses in land immediately to the north of Gilbertfield Castle was approved by South Lanarkshire Council's planning committee; this was somewhat controversial as the land had previously been designated Green belt. Various concerns were raised by local residents, community councillors (representing Halfway/Cambuslang East district), the Lowland Reserve Forces and Cadets Association who have a rifle range adjacent to the site,Cambuslang, Dechmont Rifle Ranges, Canmore and Clare Haughey and James Kelly, MSPs for the area, which were presented to the committee along with a 1300-signature petition opposing the development, without success. Revisions had already been made to the plans after the Scottish Environmental Protection Agency objected to the builder's initial submission in 2016."]}, {"page": "Haughey", "response": ["* Clare Haughey, MSP"]}, {"page": "James Kelly (Scottish politician)", "response": ["Kelly sought selection for the Glasgow regional list prior to the 2016 Scottish Parliament election. While Kelly lost his Holyrood constituency seat to the SNP's Clare Haughey in 2016, he was elected as a list MSP for the Glasgow region. Haughey's majority of 3,743 made it a target seat for Labour in the future. The equivalent Westminster seat Rutherglen and Hamilton West was won back by Labour's Gerard Killen in the 2017 UK general election, despite being one of the biggest swings towards the SNP two years prior. He was the party's campaign manager for the 2017 general election.", "Kelly nominated Anas Sarwar in the 2021 Scottish Labour leadership election. Following Sarwar's election as Leader of the Scottish Labour Party, he was re-appointed as Parliamentary Business Manager as well as spokesperson for Community Safety and Drugs Policy ahead of the 2021 Scottish Parliament election. In the election he lost out to Clare Haughey in the constituency, and though four Labour candidates were elected on the regional vote, Kelly had been fifth on the party list so was not returned as an MSP.Scottish election: Blow for Labour as it fails to take Rutherglen target seat, The National, 7 May 2021"]}, {"page": "Minister for Children and Young People", "response": ["|Clare Haughey"]}, {"page": "Scotland's Futures Forum", "response": ["*Clare Haughey MSP"]}]}}