{"wiki_id": "http://www.wikidata.org/entity/Q24052671", "itemLabel": "Annie Wells", "itemDescription": "politician (born 1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Annie_Wells_(politician)", "wikipedia_page": {"main": "Carol Ann \"Annie\" Wells (born 24 February 1972) is a Scottish Conservative politician who served as Deputy Leader of the Scottish Conservative Party to Jackson Carlaw in 2020. She has served as a Member of the Scottish Parliament (MSP) for the Glasgow region since 2016.\nThe Deputy Leadership position was abolished on 12 August 2020, shortly after Douglas Ross was appointed Scottish Conservative Leader.", "link_mentions": [{"page": "Glasgow (Scottish Parliament electoral region)", "response": ["|rowspan=\"2\" | Annie Wells(Conservative)"]}, {"page": "Scottish Conservatives", "response": ["| 4 || 100px || Annie Wells || 14 February 2020 || 12 August 2020", "|Annie Wells ||Glasgow ||2016 || Shadow Cabinet Secretary for Health and Social Care"]}, {"page": "Jackson Carlaw", "response": ["On 6 January 2020, Carlaw confirmed his candidacy for the February 2020 Scottish Conservative Party leadership election and launched his campaign in Edinburgh on 15 January. He received support from Ruth Davidson, Murdo Fraser, Adam Tomkins, Liz Smith, Annie Wells and Jamie Greene. This gave Carlaw the position of favourite over his opponent Michelle Ballantyne. He centred his campaign around how he could beat Nicola Sturgeon and the SNP in the next Scottish Parliament election and the local elections in 2022. He also promised to make the Scottish Conservatives more for the middle and working classes and continue to maintain the Scottish Conservatives as the main party of the Union. Carlaw won the election with 4,917 votes in his favour, as opposed to 1,581 for Ballantyne. He promised to provide a \"clear, focused and ambitious alternative to the SNP\"."]}, {"page": "Opposition Shadow Cabinets of the Scottish Parliament", "response": ["| rowspan=\"2\" |Annie Wells", "|Annie Wells"]}, {"page": "LGBT+ Conservatives", "response": ["* Annie Wells MSP"]}, {"page": "Annie Wells", "response": ["Annie Wells (born March 24, 1954) is an American photographer, winner of a Pulitzer Prize for Spot News Photography."]}, {"page": "List of female members of the Scottish Parliament", "response": ["|data-sort-value=\"Wells, Annie\"|Annie Wells"]}, {"page": "Endorsements in the 2016 United Kingdom European Union membership referendum", "response": ["Scottish Conservative MSPs also included Miles Briggs, Peter Chapman, Jackson Carlaw, John Lamont, Alex Johnstone, Rachael Hamilton, Liz Smith, Donald Cameron, Adam Tomkins, Douglas Ross, Brian Whittle, Finlay Carson and Annie Wells."]}, {"page": "Douglas Ross (Scottish politician)", "response": ["Ross announced his candidature in the August 2020 Scottish Conservative Party leadership election following Jackson Carlaw's resignation on 30 July 2020. On 5 August, he won the contest unopposed and became leader. On 11 August, he conducted a reshuffle where he made Ruth Davidson the Leader of the Conservative Party in the Scottish Parliament, dismissed Annie Wells and Liam Kerr from their deputy leadership positions and did not give Carlaw a position. As a result of the Alex Salmond parliamentary inquiry in early 2021, Ross called on opposition parties to pass a motion of no confidence against the Scottish Government."]}, {"page": "Liam Kerr", "response": ["Kerr is the Scottish Conservatives' Shadow Cabinet Secretary for Justice. He served as Deputy Leader of the Scottish Conservative Party, alongside Annie Wells, under Jackson Carlaw. However, they both were dismissed and the post was abolished shortly after Douglas Ross became Scottish Conservative leader in August 2020."]}]}}