{"wiki_id": "http://www.wikidata.org/entity/Q24005636", "itemLabel": "Charlie Ward", "itemDescription": "English footballer (born 1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_Ward_(footballer)", "wikipedia_page": {"main": "Charlie Ward (born 19 February 1995) is an English footballer who plays as a midfielder for USL Championship side Oklahoma City Energy.", "link_mentions": [{"page": "Charles Ward", "response": ["*Charlie Ward (born 1970), American professional basketball player, Heisman trophy winner", "*Charlie Ward (golfer) (1911–2001), English professional golfer", "*Charlie Ward (footballer) (born 1995), British footballer", "*Charlie Ward (fighter), Irish MMA fighter"]}, {"page": "Charlie Ward", "response": ["Charlie Ward, Jr. (born October 12, 1970) is a former American professional basketball player. Ward was an exceptional football player as well, winning the Heisman Trophy, Davey O'Brien Award, and College Football National Championship while quarterbacking the Florida State Seminoles. Despite his college football success, he was famously not drafted to the NFL, opting instead to play in the National Basketball Association (NBA).", "Ward won the 1993 Heisman Trophy, Maxwell Award, and Davey O'Brien Award as a quarterback for The Florida State University, and subsequently led the Seminoles to their first-ever National Championship when FSU defeated Nebraska 18–16 in the 1993 Orange Bowl. The Seminoles had suffered their only defeat of the season to a second-ranked Notre Dame team, but their path to the National Championship was cleared a week later when the Irish were upset at home by Boston College. Ward holds the fourth-largest margin of victory in the history of Heisman trophy balloting, with a 1,622-point difference, fourth only to Joe Burrow's 1,846 point win in 2019, O. J. Simpson's 1,750-point win in 1968Heisman Trophy  and Troy Smith's 1,662-point win in 2006. He was also the only Heisman winner to play in the NBA. In 1993, Charlie Ward won the James E. Sullivan Award from the Amateur Athletic Union (AAU) as the most outstanding amateur athlete in the United States.", "Ward is a member of Omega Psi Phi fraternity. He and his wife Tonja have three children: Caleb, Hope, and Joshua (Trashaun) In June 2007, Ward was hired as an assistant coach for the varsity boys basketball team by Westbury Christian School in Houston, Texas, having passed on many professional sports opportunities. He was previously an assistant coach for the Houston Rockets. In addition, in November 2007, he accepted the job as head coach for the varsity football team at Westbury Christian School, stating that his desire is to help prepare young minds for Christ.Rockets' assistant coach Ward named high school assistant coach June 14, 2007 In February 2014, it was announced that Ward accepted the head coaching position at Booker T. Washington High School in Pensacola, Florida, where his son Caleb would be attending and playing football. As of March 8, 2018, Charlie is the Ambassador of Football for Florida State University. In March 2018, Ward became the head Boys' Basketball coach for Florida State University Schools (FSUS or Florida High) in Tallahassee, Florida. Currently Florida High's Boys Basketball program has improved since Ward's arrival. Charlie is also the host of a web series, Chalk Talk with Charlie Ward, where he discusses his thoughts on Florida State Seminole Football.", "Charlie Ward made his acting debut on the Netflix comedy series Family Reunion episode \"Remember M'dear's Fifteen Minutes?\" playing himself in 2020. "]}, {"page": "List of foreign MLS players", "response": ["*Charlie Ward – Houston – 2017–18"]}, {"page": "All-time Houston Dynamo roster", "response": ["|Charlie Ward"]}, {"page": "2013–14 Stoke City F.C. season", "response": ["|align=\"left\"|31||align=\"left\"|MF||align=\"left\"| Charlie Ward"]}, {"page": "2014–15 Stoke City F.C. season", "response": ["|align=\"left\"|31||align=\"left\"|MF||align=\"left\"| Charlie Ward"]}, {"page": "List of foreign USL Championship players", "response": ["*Charlie Ward – RVG FC Toros, San Antonio FC, Ottawa Fury, Oklahoma City Energy – 2016–"]}, {"page": "2017 Houston Dynamo season", "response": ["| Charlie Ward"]}, {"page": "South Texas Derby", "response": ["!scope=\"row\" align=\"left\"| Charlie Ward"]}, {"page": "2017 MLS Expansion Draft", "response": ["| Charlie Ward (INTL)|| ||"]}, {"page": "2018 San Antonio FC season", "response": ["| Charlie Ward", "|align=\"left\"| Charlie Ward", "|align=left| Charlie Ward", "|  Charlie Ward", "|  Charlie Ward"]}, {"page": "2018 Houston Dynamo season", "response": ["| Charlie Ward"]}, {"page": "2019 Ottawa Fury FC season", "response": ["|January 18, 2019 ||  Charlie Ward || 14 || MF ||  San Antonio FC || Signed", "| align=left| Charlie Ward"]}, {"page": "2020 OKC Energy FC season", "response": ["| 19|| Charlie Ward ||  || MF ||  || 2020 ||  Ottawa Fury || 10||0", "|align=left| Charlie Ward", "|align=left| Charlie Ward", "|  Charlie Ward"]}, {"page": "2021 OKC Energy FC season", "response": ["| 14|| Charlie Ward ||  || MF ||  || 2020 ||  Ottawa Fury || 25||1", "|align=left| Charlie Ward", "|align=left| Charlie Ward"]}]}}