{"wiki_id": "http://www.wikidata.org/entity/Q24052779", "itemLabel": "Clare Bailey", "itemDescription": "politician from Northern Ireland (born 1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Clare_Bailey", "wikipedia_page": {"main": "Clare Bailey (born 18 June 1970) is a Northern Irish politician who has been the Leader of Green Party Northern Ireland since November 2018.", "link_mentions": [{"page": "Green Party (Ireland)", "response": ["In the 2020 general election, the party had its best result ever, winning 7.1% of the first-preference votes and returning 12 TDs, an increase of ten from the last election. It became the fourth-largest party in the Dáil and entered government in coalition with Fianna Fáil and Fine Gael. Ryan, Martin and Roderic O'Gorman were appointed as cabinet ministers, with four Green Ministers of State. Clare Bailey, the leader of the Green Party in Northern Ireland, was amongst a number of Green members who stood against the coalition. She said it proposed the \"most fiscally conservative arrangements in a generation\" and that \"the economic and finances behind this deal will really lead to some of the most vulnerable being hit the hardest\", as well as it not doing enough on climate and social justice. She also said the deal \"fails to deliver on our promise to tackle homelessness and provide better healthcare\", \"represents an unjust recovery\" and \"sets out an inadequate and vague pathway towards climate action\". In the 2020 Seanad election the party returned two senators. A further two senators were nominated by Taoiseach, Micheál Martin bringing the total party representation in the Oireachtas to 16. In July 2020, Eamon Ryan retained his leadership of the party with a narrow leadership election victory over Catherine Martin in the 2020 Green Party leadership election by 994 votes to 946, a margin of 48 votes."]}, {"page": "List of political parties in the United Kingdom", "response": ["| Clare Bailey"]}, {"page": "List of political parties in Northern Ireland", "response": ["|Clare Bailey"]}, {"page": "Belfast South (UK Parliament constituency)", "response": ["4. Correction: Clare Bailey, Green Party in Northern Ireland (not Green Party of England and Wales)"]}, {"page": "Green Party Northern Ireland", "response": ["* Clare Bailey (21 November 2018 – present)", "In May 2016 the Greens picked up their second seat in the Northern Ireland Assembly when Clare Bailey took a seat in south Belfast.", "|Clare Bailey", "*South Belfast: Clare Bailey MLA", "* Clare Bailey, MLA for Belfast South"]}, {"page": "List of Queen's University Belfast people", "response": ["* Clare Bailey – Green Party leader and MLA for Belfast South"]}, {"page": "Lagan College", "response": ["* Clare Bailey, Green Party MLA for South Belfast"]}, {"page": "Belfast South (Assembly constituency)", "response": ["! rowspan=3|Clare Bailey(Green (NI))"]}, {"page": "Ormeau Road", "response": ["The area is represented in the Northern Ireland Assembly by Clare Bailey, Matthew O'Toole, Paula Bradshaw, Deirdre Hargey and Christopher Stalford."]}, {"page": "Committee for Agriculture, Environment and Rural Affairs", "response": ["| ||Clare Bailey"]}, {"page": "Leaders of political parties in the United Kingdom", "response": ["| Clare Bailey"]}]}}