{"wiki_id": "http://www.wikidata.org/entity/Q240573", "itemLabel": "Sophie Turner", "itemDescription": "British-Canadian actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Sophie_Turner", "wikipedia_page": {"main": "Sophie Belinda Jonas (née Turner; born 21 February 1996) is an English actress. She made her acting debut as Sansa Stark on the HBO epic fantasy television series Game of Thrones (2011–2019), for which she received a Primetime Emmy Award nomination for the Outstanding Supporting Actress in a Drama Series in 2019.\nTurner appeared in the television film The Thirteenth Tale (2013) and made her feature film debut in Another Me (2013). She appeared in the action comedy Barely Lethal (2015) and portrayed a young Jean Grey / Phoenix in the X-Men film series (2016–2019).\n\n", "link_mentions": [{"page": "Jean Grey", "response": ["Famke Janssen portrayed the character as an adult in the X-Men films while Sophie Turner portrayed her as a teenager and young adult."]}, {"page": "1996", "response": ["** Sophie Turner, English actress"]}, {"page": "Phoenix Force (comics)", "response": ["* Jean Grey appears in X-Men: Apocalypse, portrayed by Sophie Turner. Jean is one of the most ostracized of Charles Xavier's students because she struggles to control her powers as exhibited when she suffers a premonitory nightmare, shaking the school and causing Xavier strain as he tries to wake and calm her. In the film's climax during the X-Men's battle against Apocalypse, Charles tells Apocalypse in an astral battle ground that he is not the most powerful psychic. After bringing Jean there, Charles convinces her to unleash the full extent of her powers. She shatters Apocalypse's astral projection before disintegrating his physical body, her body surrounded by a flaming bird-shaped aura."]}, {"page": "Turner (surname)", "response": ["*Sophie Turner, British actress"]}, {"page": "Japanese bondage", "response": ["Shibari has also featured in Western pop culture. For example, in the music video for The Jonas Brothers song \"Sucker,\" Joe Jonas and Sophie Turner briefly appear to be engaging in a form of Japanese-inspired bondage. More to the point, shibari is explicitly referenced in \"Tying the Knot,\" the nineteenth episode of The Good Wife's fifth season, as the practice of shibari is integral to the episode's plot; in this episode, fictional characters Colin Sweeney and Renata Ellard Sweeney (portrayed by actors Dylan Baker and Laura Benanti respectively) are revealed to engage in the art of shibari, and shibari is also used as a means by which Renata's friend, Morgan Donnelly (portrayed by actress Jenn Gambatese), is murdered."]}, {"page": "1996 in film", "response": ["* February 21 - Sophie Turner, English actress"]}, {"page": "1996 in American television", "response": ["|Sophie Turner"]}, {"page": "A Little White Wedding Chapel", "response": ["* Joe Jonas and Sophie Turner (May 1, 2019)"]}, {"page": "I'll Be There for You (The Rembrandts song)", "response": ["On the 25th anniversary of the show, Jonas Brothers appeared in a music video of the theme song featuring Priyanka Chopra Jonas, Sophie Turner and Danielle Jonas."]}, {"page": "Saturn Award for Best Supporting Actress on Television", "response": ["| Sophie Turner"]}, {"page": "Blake Shelton", "response": ["| Netflix Special; alongside John Legend, Sophie Turner, Niall Horan, and more."]}, {"page": "Sansa Stark", "response": ["Sansa Stark is a fictional character in the A Song of Ice and Fire series of epic fantasy novels by American author George R. R. Martin, and its television adaptation Game of Thrones, where she is portrayed by English actress Sophie Turner. Introduced in A Game of Thrones (1996), Sansa is the elder daughter and second child of Lord Eddard Stark and his wife Lady Catelyn Stark. She subsequently appeared in the following three novels: A Clash of Kings (1998), A Storm of Swords (2000), and A Feast for Crows (2005). While absent from the fifth novel A Dance with Dragons, Sansa will return in the forthcoming book, The Winds of Winter.", "In an interview with The New York Times, actress Sophie Turner said that \"[Sansa is] no longer a pawn in anyone's game; she's no longer a prisoner...she's the one taking charge and doing her own thing, which is very exciting\". Turner later told Time magazine about how gratifying it was to watch Sansa's development during Season 6 and defended the show on the criticism of its cruel treatment of women: \"In my opinion, Game of Thrones is not sexist, and it's accurate to medieval time. The show puts social boundaries on the women, and they break out of these boundaries.\"", "Sophie Turner has received several award nominations for her portrayal of Sansa including an Emmy nomination for Outstanding Supporting Actress in a Drama Series in 2019. For her performance in the series she earned the Glamour Award for Best UK TV Actress in 2016 and 2017, and an EWwy Award for Best Supporting Actress in a Drama Series in 2016. Other nominations include the Young Artist Award for Best Performance in a TV Series by a Supporting Young Actress in 2012, and the EWwy Award for Best Supporting Actress in a Drama Series in 2015."]}, {"page": "List of A Song of Ice and Fire characters", "response": ["In the HBO television adaptation, she is portrayed by Sophie Turner."]}, {"page": "Hillfield Court", "response": ["Although no blue plaque appears on the building, Hillfield Court has been home to many interesting and famous people over the years. These include actress Diana Wynyard, author Barnaby Williams, novelist Kay Dick and the photographer Bill Brandt. The wet-stamp of many of Brandt's photos reads \"Bill Brandt, 58 Hillfield Court, Belsize Avenue, NW3\" and have sold at Christie's for many thousands of pounds. Additionally, directors of many films as well as one of the leading actresses in the West End Musical Miss Saigon have also lived there. Sophie Turner, the English actor who rose to international fame playing Sansa Stark in the HBO series Game of Thrones lived in the block in the early 2010s, as did media personality and paparazzo Darryn Lyons."]}, {"page": "Diplo", "response": ["On May 1, 2019, Diplo live-streamed Joe Jonas' Las Vegas wedding to Sophie Turner on Instagram, \"not knowing it was a serious wedding\". Soon after the couple told the tabloids that Diplo ruined their wedding, the DJ responded on social media. Five months later, Diplo and the Jonas Brothers released a song titled \"Lonely\". The song's official music video chronicles Diplo's attempts to make amends with Joe Jonas and his brothers."]}, {"page": "Jason Dohring", "response": ["In 2014, Dohring co-narrated the audio book The Mortal Instruments: City of Heavenly Fire by Cassandra Clare with actress Sophie Turner.", "|with actress Sophie Turner"]}, {"page": "Joffrey Baratheon", "response": ["After Robert's death, Cersei Lannister (Lena Headey) and her father Tywin (Charles Dance) make Joffrey King, and his mother uses him as a puppet. He is also betrothed to Sansa Stark (Sophie Turner) to cement an alliance between the Houses of Stark and Lannister. A cruel tyrant, Joffrey makes sadistic torture and mass murder the main features of his kingdom, and even has Sansa's father Ned (Sean Bean) executed for treason (which he declares he will never allow to go unpunished) over Sansa's pleas for mercy and Cersei's disapproval."]}, {"page": "Isabel Coixet", "response": ["That same year, Coixet shot and produced Ayer no termina nunca (Yesterday Never Ends) which premiered in the Panorama Section of the 63rd edition of the International Film Festival of Berlin. The film also opened the Málaga Film Festival the same year, where it won four Silver Biznagas in the categories Special Jury Prize, Best Actress, Best Photography and Best Editing, the last two prizes won by Jordi Azategui. In the end of 2012 she also started shooting a new project, which she finished in 2013, called Another Me, an English-language thriller written and directed by Coixet with a cast that featured Sophie Turner, Rhys Ifans, Jonathan Rhys-Meyers and Geraldine Chaplin, among others."]}, {"page": "The Staircase", "response": ["A dramatic limited series adaptation of the docuseries, to be co-produced by Annapurna Television and HBO Max, was announced in March 2021. The series is set to star Colin Firth as Peterson, Toni Collette as his wife Kathleen and Sophie Turner as one of Peterson's adopted daughters, Trini Alvarado as Patty his ex-wife, with Antonio Campos and Maggie Cohn both attached as writers and showrunners."]}, {"page": "Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series", "response": ["| Sophie Turner"]}, {"page": "Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series", "response": ["| Amrita Acharia, Mark Addy, Alfie Allen, Josef Altin, Sean Bean, Susan Brown, Emilia Clarke, Nikolaj Coster-Waldau, Peter Dinklage, Ron Donachie, Michelle Fairley, Jerome Flynn, Elyes Gabel, Aidan Gillen, Jack Gleeson, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Richard Madden, Jason Momoa, Rory McCann, Ian McElhinney, Luke McEwan, Roxanne McKee, Dar Salim, Mark Stanley, Donald Sumpter, Sophie Turner, Maisie Williams", "| Alfie Allen, John Bradley-West, Oona Chaplin, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Mackenzie Crook, Charles Dance, Joe Dempsie, Peter Dinklage, Natalie Dormer, Nathalie Emmanuel, Michelle Fairley, Jack Gleeson, Iain Glen, Kit Harington, Lena Headey, Isaac Hempstead-Wright, Kristofer Hivju, Paul Kaye, Sibel Kekilli, Rose Leslie, Richard Madden, Rory McCann, Michael McElhatton, Ian McElhinney, Philip McGinley, Hannah Murray, Iwan Rheon, Sophie Turner, Carice van Houten, Maisie Williams", "| Alfie Allen, Josef Altin, Jacob Anderson, John Bradley-West, Dominic Carter, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Ben Crompton, Charles Dance, Peter Dinklage, Natalie Dormer, Nathalie Emmanuel, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Conleth Hill, Rory McCann, Ian McElhinney, Pedro Pascal, Daniel Portman, Mark Stanley, Sophie Turner, Maisie Williams", "| Alfie Allen, Ian Beattie, John Bradley-West, Gwendoline Christie, Emilia Clarke, Michael Condron, Nikolaj Coster-Waldau, Ben Crompton, Liam Cunningham, Stephen Dillane, Peter Dinklage, Nathalie Emmanuel, Tara Fitzgerald, Jerome Flynn, Brian Fortune, Joel Fry, Aiden Gillen, Iain Glen, Kit Harington, Lena Headey, Michiel Huisman, Hannah Murray, Brenock O'Connor, Daniel Portman, Diana Rigg, Iwan Rheon, Owen Teale, Sophie Turner, Carice van Houten, Indira Varma, Maisie Williams, Tom Wlaschiha", "| Alfie Allen, Jacob Anderson, Dean-Charles Chapman, Emilia Clarke, Nikolaj Coster-Waldau, Liam Cunningham, Peter Dinklage, Nathalie Emmanuel, Iain Glen, Kit Harington, Lena Headey, Conleth Hill, Kristofer Hivju, Michiel Huisman, Faye Marsay, Jonathan Pryce, Sophie Turner, Carice van Houten, Gemma Whelan, Maisie Williams", "| Alfie Allen, Jacob Anderson, Pilou Asbæk, Hafþór Júlíus Björnsson, John Bradley West, Jim Broadbent, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Liam Cunningham, Peter Dinklage, Richard Dormer, Nathalie Emmanuel, James Faulkner, Jerome Flynn, Aidan Gillen, Iain Glen, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Kristofer Hivju, Tom Hopper, Anton Lesser, Rory McCann, Staz Nair, Richard Rycroft, Sophie Turner, Rupert Vansittart, Maisie Williams", "| Alfie Allen, Jacob Anderson, Pilou Asbæk, John Bradley West, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Ben Crompton, Liam Cunningham, Joe Dempsie, Peter Dinklage, Richard Dormer, Nathalie Emmanuel, Jerome Flynn, Iain Glen, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Kristofer Hivju, Rory McCann, Hannah Murray, Staz Nair, Daniel Portman, Bella Ramsey, Richard Rycroft, Sophie Turner, Rupert Vansittart, Maisie Williams"]}, {"page": "1996 in the United Kingdom", "response": ["* 21 February – Sophie Turner, actress"]}, {"page": "Peachtree Corners, Georgia", "response": ["The former site of BJ's Wholesale Club was used as the set of the 2012 movie The Watch starring Ben Stiller, Vince Vaughn, and Jonah Hill.  A home on Fitzpatrick Way in Peachtree Corners was used as a filming location for the 2015 movie Barely Lethal starring Sophie Turner, Jessica Alba, and Samuel L. Jackson.  The film used Simpsonwood Park as the staging area. In 2021, Jones Bridge Park and the area of Peachtree Industrial Blvd. and Holcomb Bridge Rd. in Peachtree Corners were the sites of the filming of season 4 of the Netflix production of Ozark starring Jason Bateman, Laura Linney, Julia Garner, Jordana Spiro, Jason Butler Harner, Esai Morales, Peter Mullan, Janet McTeer, and others."]}, {"page": "Film industry in Florida", "response": ["Florida is also the home of many famous actors.  Celebrity residents of Florida have included Burt Reynolds, Sylvester Stallone, John Travolta, Kelly Preston, Andy Garcia, Tom Cruise, Ron Palillo, Joe Jonas, Sophie Turner, Kaye Stevens, Michael Winslow, Larry Haines, Margaret Hayes, Roberta Haynes, Meinhardt Raabe, Jackie Gerlich, Hedy Lamarr, Susana Giménez, David Caruso, Christian Slater, Kenan Thompson, Vanilla Ice, Christian Daniel, Iggy Pop, Donna Summer, Oprah Winfrey, Margaret Kerry, Jerry Springer, Antonio Sabàto Jr., Gloria Estefan, Jackie Gleason, Richard Boone, Perry Como, David Winters, Herb Shriner, Jean Shepherd, Bob McFadden, Scott \"Carrot Top\" Thompson, Billy Connolly, Cody Burger, Mickey Kuhn, Bobby Breen, Peter Palmer, Ricou Browning,  Philip Michael Thomas, Eugene Levy, Barrie Ingham, Mike Douglas, Leslie Nielsen, Eddie Egan, Kirby Grant, Arlene Dahl, Patricia Dane, Norma Miller, Lili Damita, Martha O'Driscoll, Dixie Dunbar, June Preisser, Phyllis Thaxter, Vic Damone, Vaughn Monroe, Tom Fadden, Kimbo Slice, Dick Smothers, Rhonda Shear, Luke Halpin, Jay North, Dan White, Dennis Hoey, Freddie Bartholomew, George Hamilton, Gary Burghoff, Jo Ann Pflug, Steve Sipek, Arthur Metrano,  Dave Madden, David Cassidy, Davy Jones, Anthony Newley, Gayle Hunnicutt, Cindy Crawford, Gail Edwards, Enrique Iglesias, Phil Collins, Sofia Vergara, Hulk Hogan, Nick Hogan,  Randy Savage, Dave Bautista, John Cena, and Dwayne Johnson.  There are also quite a few successful film directors located in the state including Daniel Myrick, George Abbott, and Harry Revier."]}, {"page": "Diane Setterfield", "response": [" she won the 2007 Quill Award, Debut author of the year, for this novel. It is written in the Gothic tradition, with echoes of Jane Eyre and Wuthering Heights. The rights were acquired by David Heyman at Heyday Films and the novel was adapted for television by Christopher Hampton. Starring Vanessa Redgrave, Olivia Colman, and Sophie Turner, The Thirteenth Tale was televised on BBC2 in December 2013."]}, {"page": "Allie Esiri", "response": ["Allie Esiri has created poetry shows with readers including Damian Lewis, Helen McCrory, Samuel West, Dominic West, Helena Bonham Carter, Tobias Menzies, Giles Terera, Tamsin Greig and Sophie Turner. \"A Poem for Every Night of the Year\" had a launch event show at the National Theatre on the Olivier stage on 25 November 2016. It was reviewed in The Telegraph. Esiri hosted the show and poems were read by Samuel West, Hattie Morahan, Giles Terera and Kate Duchene. Esiri curated and hosted similar events at the Hay Festival, Cheltenham Literature Festival, Edinburgh Festival, Oxford Literary Festival and Bath Festivals with Tony Robinson, Sophie Turner, Ronni Ancona, Alexander Armstrong, Beatie Edney, Damian Lewis, Helen McCrory, Gina Bellman, Hugh Ross, Nathaniel Parker, Sanjeev Bhaskar, Alison Steadman, Samuel West and Harry Enfield. Allie Esiri's latest anthology, A Poem for Every Day of the Year was published by Macmillan on 7 September 2017. The Guardian recently chose it as one of their top ten poetry books and it was chosen by the chair of the National Trust as the book she would take her to her desert island on Desert Island Discs. A Poem for Every Day of the Year show at the National Theatre took place on 10 November 2017 - joining Esiri on stage were actors Adjoa Andoh, Simon Russell Beale, Joanna Lumley, Stephen Mangan, Helen McCrory and Samuel West. A Poem for Every Day of the Year was in The Observer, the Times and the New Statesmen books of the year. "]}, {"page": "The King's High School for Girls", "response": ["* Sophie Turner (b. 1996), Game of Thrones actress"]}, {"page": "Daeg Faerch", "response": ["In 2018, Faerch co-starred with Sophie Turner in the independent film, Josie."]}, {"page": "Sophia (given name)", "response": ["* Sophie Turner (born 1996), English Actress"]}, {"page": "Chesterton, Warwickshire", "response": ["Actress Sophie Turner spent her childhood in the village."]}, {"page": "X-Men (film series)", "response": ["| Famke JanssenSophie TurnerSummer Fontana"]}, {"page": "Jean Grey in other media", "response": ["Jean Grey/Phoenix appears in seven of the thirteen films of Fox's X-Men franchise, initially portrayed by Famke Janssen and later by Sophie Turner as a younger depiction in the prequel films.", "A younger version of Jean, now portrayed by Sophie Turner, appears in X-Men: Apocalypse. Jean is introduced as a young student at Xavier's School for Gifted Youngsters. After meeting Scott Summers, Jean explains that other students are afraid of her because the unreached full potential of her powers. Jean is affected by the energy wave released by an ancient, god-like mutant who had awakened that day. This causes Jean to have a nightmare of the world ending during which the entire school shakes, most of the students are awoken from sleep, and the Professor hurries to her room to find that her telekinetic powers, already immensely strong, are quite literally burning the walls of her room. Jean is reassured by Xavier that she is not losing control of her powers, despite her doubts. When the mansion is destroyed, she comforts Scott over the loss of his brother and conceals herself, Scott, and Nightcrawler from Stryker's men. While in Stryker's base, she connects with Weapon X (Wolverine) and releases him from his cell. Before he, fearfully, leaves the complex Jean restores the few remaining memories of his that she can. She then joins the fight in Cairo where she telekinetically protects the group from Angel's metal wings. After Xavier is saved, he mentally links with her and reveals to Apocalypse that he is not the most powerful psychic, and convinces Jean to unleash the full extent of her powers. Aided with Cyclops, Storm and Magneto, she weakens Apocalypse until he incinerates. She is last seen helping to re-build the mansion, alongside Erik Lensherr, before joining Cyclops, Storm, Nightcrawler, Quicksilver, under the leadership of Hank and Raven, to become the new official team of X-Men and preparing to test her powers in her very first Danger Room session against a group of Mark I Sentinels."]}, {"page": "List of X-Men film series cast members", "response": ["James McAvoy, Michael Fassbender, Jennifer Lawrence, and Nicholas Hoult star in X-Men: First Class (2011) as younger versions of Xavier, Lehnsherr, Darkhölme, and McCoy, respectively, while Lucas Till appears as Alex Summers / Havok. X-Men: Days of Future Past (2014) features both the original cast (except for Romijn) and the new actors, while also introducing Evan Peters as Peter Maximoff / Quicksilver. McAvoy, Fassbender, Lawrence, Hoult, Till, and Peters reprise their roles in X-Men: Apocalypse (2016), where Sophie Turner, Tye Sheridan, Kodi Smit-McPhee, and Alexandra Shipp portray younger versions of Grey, Scott Summers, Kurt Wagner / Nightcrawler, and Storm. Except for Till, all new actors return in Dark Phoenix (2019).", "| Sophie Turner", "| Sophie Turner"]}, {"page": "Sophie", "response": ["* Sophie Turner (born 1996), British actress"]}, {"page": "Playbox Theatre Company", "response": ["Sophie Turner", "*Sophie Turner "]}, {"page": "List of British former child actors", "response": ["*Sophie Turner (born 1996)"]}, {"page": "Joe Jonas", "response": ["Jonas started dating English actress Sophie Turner in 2016. They got engaged in October 2017, and married on May 1, 2019, in Las Vegas, Nevada. They held their second wedding in Paris, France on June 29, 2019. In July 2020, Turner gave birth to their daughter."]}, {"page": "List of British actors", "response": ["* Sophie Turner (born 1996)"]}, {"page": "Game of Thrones", "response": ["Eddard \"Ned\" Stark (Sean Bean) is the head of House Stark. He and his wife, Catelyn (Michelle Fairley), have five children: Robb (Richard Madden), Sansa (Sophie Turner), Arya (Maisie Williams), Bran (Isaac Hempstead-Wright), and Rickon (Art Parkinson). Ned also has an illegitimate son, Jon Snow (Kit Harington), who, along with his scholarly friend, Samwell Tarly (John Bradley), serve in the Night's Watch under Lord Commander Jeor Mormont (James Cosmo). The Wildlings living north of the Wall include the young Gilly (Hannah Murray), and the warriors Tormund Giantsbane (Kristofer Hivju) and Ygritte (Rose Leslie).", "File:Sophie Turner by Gage Skidmore 3.jpg |Sophie Turner as Sansa Stark", "About two dozen wigs were used by the actresses. Made of human hair and up to  in length, they cost up to $7,000 each and were washed and styled like real hair. Applying the wigs was time-consuming; Emilia Clarke, for example, required about two hours to style her brunette hair with a platinum-blonde wig and braids. Other actors, such as Jack Gleeson and Sophie Turner, received frequent hair coloring. For characters such as Daenerys (Clarke) and her Dothraki, their hair, wigs and costumes were processed to appear as if they had not been washed for weeks."]}, {"page": "1996 in British television", "response": ["*2 February – Sophie Turner, actress and model"]}, {"page": "X-Men in other media", "response": ["A sequel tetralogy that served as a prequel to the original trilogy started with X-Men: First Class. Following a young Professor X (James McAvoy), Magneto (Michael Fassbender), Beast (Nicholas Hoult), Mystique (Jennifer Lawrence), Havok (Lucas Till) and Banshee (Caleb Landry Jones) as the original team, the film was directed by Matthew Vaughn and released on June 3, 2011. X-Men: Days of Future Past, a sequel to both the original trilogy and X-Men: First Class, with Singer returning to direct, was released on May 23, 2014. The film centered around the original trilogy members using time travel to gain help from their younger counterparts of the prequel tetralogy. X-Men: Apocalypse was released on May 27, 2016, with Mystique leading the team with Beast, Quicksilver (Evan Peters), Storm (Alexandra Shipp), Nightcrawler (Kodi Smit-McPhee), Cyclops (Tye Sheridan) and Jean Grey (Sophie Turner). The tetralogy concluded with a fourth film, Dark Phoenix, written and directed by Simon Kinberg and released on June 7, 2019, with the same roster from Apocalypse."]}, {"page": "Suzy Amis Cameron", "response": ["In 2009, Amis Cameron founded Red Carpet Green Dress, a global initiative showcasing sustainable fashion on the red carpet at the Oscars. Collaborating with fashion brands such as Armani, Vivienne Westwood, and Reformation, the gowns and tuxedos have included vintage, recycled, repurposed and eco design. Previous campaign ambassadors include Emma Roberts, Priyanka Bose, Naomie Harris, Olga Kurylenko, Kellan Lutz, Sophie Turner, and Missi Pyle."]}]}}