{"wiki_id": "http://www.wikidata.org/entity/Q240238", "itemLabel": "Bessie Love", "itemDescription": "American actress (1898–1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bessie_Love", "wikipedia_page": {"main": "Bessie Love (born Juanita Horton; September 10, 1898 – April 26, 1986) was an American-British actress who achieved prominence playing innocent, young girls and wholesome leading ladies in silent and early sound films. Her acting career spanned eight decades—from silent film to sound film, including theatre, radio, and television—and her performance in The Broadway Melody (1929) earned her a nomination for the Academy Award for Best Actress.", "link_mentions": [{"page": "April 26", "response": ["*  1986   – Bessie Love, American actress (b. 1898)"]}, {"page": "September 10", "response": ["*1898 – Bessie Love, American actress (d. 1986)"]}, {"page": "Widescreen", "response": ["The experimental Natural Vision widescreen process developed by George K. Spoor and P. John Berggren used 63.5 mm film and had a 2:1 aspect ratio. In 1926, a Natural Vision film of Niagara Falls was released. In 1927, the Natural Vision process was used in the production of The American  The Flag Maker. It was directed by J. Stuart Blackton and starred Bessie Love and Charles Ray, but was never released theatrically."]}, {"page": "1986", "response": ["** Bessie Love, American actress (b. 1898)"]}, {"page": "1898", "response": ["** Bessie Love, American actress (d. 1986)"]}, {"page": "The Hollywood Revue of 1929", "response": ["Unlike M-G-M's imposing feature films, which always boasted strong story values, The Hollywood Revue of 1929 was a plotless parade of variety acts. Conrad Nagel, interviewed for the book The Real Tinsel, recalled, \"Everybody thought Harry Rapf was crazy for making it.\" Billed as an \"All-Star Musical Extravaganza\", the film includes performances by once and future stars, including Joan Crawford singing and dancing on stage. (She later remarked, \"Revue was one of those let's-throw-everyone-on-the-lot-into-a musical things, but I did a good song-and-dance number.\"). Other segments feature Gus Edwards, John Gilbert, Norma Shearer, Lionel Barrymore, Buster Keaton, Marie Dressler, Bessie Love, Marion Davies, Anita Page, and the comedy team of Karl Dane and George K. Arthur.", "* \"I Never Knew I Could Do a Thing Like That\" sung by Bessie Love", "* \"Marie, Polly, and Bess\" with Marie Dressler, Polly Moran, and Bessie Love"]}, {"page": "Charleston (dance)", "response": ["* 1925 – Actress Bessie Love dances the Charleston in the film The King on Main Street.", "* 1926 – The film The Song and Dance Man – Bessie Love performed the Charleston."]}, {"page": "The Broadway Melody", "response": ["The Broadway Melody was written by Norman Houston and James Gleason from a story by Edmund Goulding, and directed by Harry Beaumont. Original music was written by Arthur Freed and Nacio Herb Brown, including the popular hit \"You Were Meant for Me\". The George M. Cohan classic \"Give My Regards to Broadway\" is used under the opening establishing shots of New York City, its film debut. Bessie Love was nominated for an Academy Award for Best Actress for her performance.", "Eddie Kearns (Charles King) sings \"The Broadway Melody\", and tells some chorus girls that he brought the Mahoney Sisters vaudeville act to New York to perform it with him in the latest revue being produced by Francis Zanfield (Eddie Kane). Harriet \"Hank\" Mahoney (Bessie Love) and her sister Queenie Mahoney (Anita Page) are awaiting Eddie's arrival at their apartment. Hank, the older sister, prides herself on her business sense and talent, while Queenie is lauded for her beauty. Hank is confident they will make it big while Queenie is less eager to put everything on the line to become a star. Hank declines the offer of their Uncle Jed (Jed Prouty) to join a 30-week traveling show but consents to think it over.", "As this was not just one of the first sound features made, but also one of the first sound musicals, the production used trial-and-error to learn how to record sound properly. After the rushes were seen, the sets would often be changed to improve the recording qualities, and scenes would be re-shot, resulting in long days for the actors and an overall long shooting schedule. It took over three hours to film Bessie Love's brief ukulele-playing scene. For earlier takes, a full orchestra was just off-camera, but, for later takes, the actors sang and danced to prerecorded music.", "At the 2nd Academy Awards, The Broadway Melody won for Best Picture. Harry Beaumont received a nomination for Best Director (lost to Frank Lloyd for The Divine Lady), and Bessie Love was nominated for Best Actress (lost to Mary Pickford for Coquette). No nominations were announced prior to the 1930 ceremonies. Love and Beaumont are presumed to have been under consideration, and are listed as such by the Academy of Motion Picture Arts and Sciences."]}, {"page": "Wallace Beery", "response": ["File:Bessie Love and Wallace Beery in scene from Dynamite Smith (1924).jpg|Dynamite Smith (1924) with Bessie Love"]}, {"page": "1930 in music", "response": ["* Chasing Rainbows starring Bessie Love, Charles King, Jack Benny and Marie Dressler", "* Good News, starring Bessie Love, Cliff Edwards and Penny Singleton and featuring Abe Lyman & his Band"]}, {"page": "1986 in film", "response": ["| style=\"text-align:center;\"| 26 || Bessie Love || style=\"text-align:center;\"| 87 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actress || "]}, {"page": "1983 in film", "response": ["| The Hunger || MGM/UA Entertainment Co. || Tony Scott (director); Ivan Davis, Michael Thomas (screenplay); Catherine Deneuve, David Bowie, Susan Sarandon, Cliff De Young, Dan Hedaya, Beth Ehlers, Rufus Collins, Willem Dafoe, John Pankow, John Stephen Hill, Ann Magnuson, James Aubrey, Bauhaus, Bessie Love || Horror || Live action"]}, {"page": "1981 in film", "response": ["| Lady Chatterley's Lover ||  Cannon Films / Columbia Pictures || Just Jaeckin (director/screenplay); Marc Behm, Christopher Wicking (screenplay); Sylvia Kristel, Nicholas Clay, Shane Briant, Ann Mitchell, Elizabeth Spriggs, Pascale Rivault, Peter Bennett, Anthony Head, Frank Moorey, Bessie Love, John Tynan, Michael Huston, Fran Hunter, Ryan Michael, Mark Colleano || Romance, Drama || Live action", "| Ragtime || Paramount Pictures || Miloš Forman (director); Michael Weller (screenplay); James Cagney, Howard E. Rollins, Jr., Brad Dourif, Elizabeth McGovern, Moses Gunn, Mary Steenburgen, James Olson, Kenneth McMillan, Pat O'Brien, Mandy Patinkin, Donald O'Connor, Fran Drescher, Richard Griffiths, Norman Mailer, Robert Joy, Jeff Daniels, Debbie Allen, Jeffrey DeMunn, Edwin Cooper, Frankie Faison, Alan Gifford, Richard Oldfield, George Harris, Samuel L. Jackson, Michael Jeter, Andreas Katsulas, Joe Praml, Calvin Levels, Bessie Love, Christopher Malcolm, Stuart Milligan, John Ratzenberger, Zack Norman, Ethan Phillips, Barry Dennen, Jack Nicholson || Drama || Live action", "| Reds || Paramount Pictures / Barclays Mercantile / Industrial Finance / JRS Productions || Warren Beatty (director/screenplay); Trevor Griffiths (screenplay); Warren Beatty, Diane Keaton, Edward Herrmann, Jerzy Kosinski, Jack Nicholson, Gene Hackman, Paul Sorvino, Maureen Stapleton, Nicolas Coster, William Daniels, M. Emmet Walsh, Ian Wolfe, Bessie Love, Max Wright, George Plimpton, Kathryn Grody, Dolph Sweet, Dave King, Roger Sloman, Jan Triska, Harry Ditson, Leigh Curran, Nancy Duiguid, Stuart Richman, Oleg Kerensky, John J. Hooker || Epic, Historical, Drama || Live action"]}, {"page": "1930 in film", "response": ["*Chasing Rainbows, starring Bessie Love, a musical comedy with Technicolor sequences", "*Good News, starring Bessie Love, a musical comedy with Technicolor sequences"]}, {"page": "1929 in film", "response": ["*The Broadway Melody, musical comedy starring Charles King, Anita Page and Bessie Love"]}, {"page": "1928 in film", "response": ["*The Matinee Idol, directed by Frank Capra, starring Bessie Love and Johnnie Walker."]}, {"page": "1925 in film", "response": ["*The King on Main Street, directed by Monta Bell; starring Bessie Love & Adolphe Menjou", "*The Lost World, starring Bessie Love and Wallace Beery"]}, {"page": "Intolerance (film)", "response": ["* Bessie Love as The Bride"]}, {"page": "1898 in film", "response": ["*September 10 - Bessie Love, American actress (died 1986)"]}, {"page": "Vitagraph Studios", "response": ["Founder Albert E. Smith, in collaboration with coauthor Phil A. Koury, wrote an autobiography, Two Reels and a Crank, in 1952.Smith, Albert E. in collaboration with Phil A. Koury, Two Reels And A Crank, Garden City, N.Y.: Doubleday & Company, 1952. It includes a very detailed history of Vitagraph and a lengthy list of people who had been in the Vitagraph Family which included Billy Anderson, Florence Lawrence, Florence Turner, Richard Barthelmess, John Bunny, Francis X. Bushman, Dolores Costello, Maurice Costello, Sidney Drew, Dustin Farnum, Flora Finch, Hoot Gibson, Corinne Griffith, Alan Hale, Oliver Hardy, Mildred Harris, Hedda Hopper, Rex Ingram, Alice Joyce, Boris Karloff, J. Warren Kerrigan, Rod La Rocque, E.K. Lincoln, Bessie Love, May McAvoy, Victor McLaglen, Adolphe Menjou, Antonio Moreno, Conrad Nagel, Mabel Normand, Lottie Pickford, Billy Quirk, Wallace Reid, May Robson, Wesley Ruggles, George Stevens, Anita Stewart, Constance Talmadge, Natalie Talmadge, Norma Talmadge, William Desmond Taylor, Alice Terry, George Terwilliger, Florence Vidor, Earle Williams, Clara Kimball Young, and hundreds of other people are listed. In the text of the book he also refers to hiring a 17-year-old Rudolph Valentino into the set-decorating department, but within a week he was being used by directors as an extra in foreign parts, mainly as a Russian Cossack."]}, {"page": "List of people from Texas", "response": ["* Bessie Love (1898–1986), actress"]}, {"page": "Mary Astor", "response": ["Astor later moved to Fountain Valley, California, where she lived near her son, Anthony del Campo (from her third marriage to Mexican film editor Manuel del Campo), and his family, until 1971. That same year, suffering from a chronic heart condition, she moved to a small cottage on the grounds of the Motion Picture & Television Country House, the industry's retirement facility in Woodland Hills, Los Angeles, where she had a private table when she chose to eat in the resident dining room. She appeared in the television documentary series Hollywood: A Celebration of the American Silent Film (1980), co-produced by Kevin Brownlow, in which she discussed her roles during the silent film period. After years of retirement, she had been urged to appear in Brownlow's documentary by a former sister-in-law Bessie Love who also appeared in the series."]}, {"page": "Anita Page", "response": ["The Broadway Melody (1929) opposite Bessie Love is considered among her most successful films, and it won Best Picture at the Academy Awards. Page transitioned to talking pictures, but she criticised the total loss of silent films. \"In my opinion, silents were much better than talkies. One thing you had was mood music, which you could have playing throughout your scene to inspire you. My favorite song was 'My Heart at Thy Sweet Voice' from Samson and Delilah. I never seemed to tire of it. The trouble with talkies was, they let you have the music, but they'd stop it when you had to talk and it was always a let down for me.\""]}, {"page": "Randall and Hopkirk (Deceased)", "response": ["*Bessie Love"]}, {"page": "Garden of Allah Hotel", "response": ["* Bessie Love"]}, {"page": "Chorus line", "response": ["*Bessie Love"]}, {"page": "George Kirke Spoor", "response": ["* The American (1927), starring Bessie Love and Charles Ray"]}, {"page": "Hollywood (British TV series)", "response": ["* ActorsMary Astor, Eleanor Boardman, Louise Brooks, Olive Carey, Iron Eyes Cody, Jackie Coogan, Dolores Costello, Viola Dana, Douglas Fairbanks, Jr., Janet Gaynor, Leatrice Joy, Lillian Gish, Bessie Love, Ben Lyon, Marion Mack, Tim McCoy, Colleen Moore, Charles 'Buddy' Rogers, Gloria Swanson, Blanche Sweet, John Wayne, Eva von Berne, and Lois Wilson.", "# \"The Man with the Megaphone\"Silent film directors were flamboyant pioneers, making up their technique as they went along. Filming 'indoor' sets on open outdoor lots and combating the elements, communicating with actors in spite of overwhelming distraction and deafening noise, directors (male and female) fashion great films out of chaos and confusion. Interviews include Bessie Love, Janet Gaynor and King Vidor."]}, {"page": "Leading lady", "response": ["* Bessie Love"]}, {"page": "The Hunger (1983 film)", "response": ["Willem Dafoe and John Pankow have brief appearances as two youths harassing Sarah at a phone booth, John Stephen Hill and Ann Magnuson play a wild young couple whom Miriam and John pick up at a nightclub to consume at the start of the film, and James Aubrey plays a man whom Miriam brings to Sarah as her potential first victim. English gothic rock band Bauhaus appear during the film's opening credits as a group performing at the nightclub, where they play their single \"Bela Lugosi's Dead.\" Silent film star Bessie Love makes her final film appearance as an aging fan at Sarah's book signing."]}, {"page": "Bimbo", "response": ["It was not until the 1920s that the term bimbo first began to be associated with females in popular culture. In 1920, Frank Crumit, Billy Jones, and Aileen Stanley all recorded versions of \"My Little Bimbo Down on the Bamboo Isle\", with words by Grant Clarke and music by Walter Donaldson. The song uses the term \"bimbo\" to describe an island girl of questionable virtue. The 1929 silent film Desert Nights uses it to describe a wealthy female crook, and in The Broadway Melody, an angry Bessie Love calls a chorus girl a bimbo. The first use of its female meaning cited in the Oxford English Dictionary is dated 1929, from the scholarly journal American Speech, where the definition was given simply as \"a woman\"."]}, {"page": "List of stars on the Hollywood Walk of Fame", "response": ["| Bessie Love || Motion pictures || 6777 Hollywood Boulevard"]}, {"page": "La Peau de chagrin", "response": ["George D. Baker directed yet another version of the story, a 1923 American silent film called Slave of Desire starring George Walsh and Bessie Love.Workman, Christopher; Howarth, Troy (2016). Tome of Terror: Horror Films of the Silent Era. Midnight Marquee Press. p. 269. ."]}, {"page": "List of premature obituaries", "response": ["* Bessie Love, the American actress, relocated to England in the 1930s, and was erroneously reported as dead multiple times by the American press. In the 1940s, an American impostor was found murdered in a New York apartment. In the 1960s, the Los Angeles Times had published that Love was, correctly, a graduate of Los Angeles High School, but, incorrectly, one who had died."]}, {"page": "Bessie", "response": ["*Bessie Love, stage name of American film actress Juanita Horton (1898-1986)"]}, {"page": "Los Angeles High School", "response": ["* Bessie Love, actress"]}, {"page": "No Highway in the Sky", "response": ["* Bessie Love as Aircraft passenger"]}, {"page": "Claire Windsor", "response": ["The publicity paid off; in 1922 the newly formed Western Association of Motion Picture Advertisers (WAMPAS) began their annual WAMPAS Baby Stars awards and she was named, along with Bessie Love, Lila Lee, Mary Philbin and Colleen Moore, as the year's most promising starlets. That same year Claire signed a contract with Goldwyn Pictures Corporation. She would appear in Broken Chains with fellow WAMPAS Baby Star Colleen Moore."]}, {"page": "Good News (musical)", "response": ["The show opened on Broadway in 1927, the same year as Show Boat, but though its plot was decidedly old-fashioned in comparison to Show Boat's daring storyline, it was also a hit.  Good News spawned two films, one in 1930, starring Bessie Love and one in 1947  starring June Allyson; an unsuccessful 1974 Broadway revival, and a 1993 updated production by Music Theatre of Wichita, which created a largely new libretto and made changes to the score. It proved to be DeSylva, Brown, and Henderson's biggest hit out of a string of topical musicals.Information from the Michael Gruber Library", "MGM released two film versions,  the first in 1930 with Bessie Love and Cliff Edwards and the second in 1947 with June Allyson and Peter Lawford.  The Railroad Hour broadcast a 45-minute condensed version as its first episode on October 4, 1948."]}]}}