{"wiki_id": "http://www.wikidata.org/entity/Q2419126", "itemLabel": "Theophilus Eaton", "itemDescription": "Founder of New Haven, Connecticut, first governor of the New Haven Colony", "wikipedia_url": "https://en.wikipedia.org/wiki/Theophilus_Eaton", "wikipedia_page": {"main": "Theophilus Eaton (c. 1590—January 7, 1658) was a merchant, farmer, and Puritan colonial leader who was the co-founder and first governor of New Haven Colony, Connecticut.", "link_mentions": [{"page": "Connecticut", "response": ["The main body of settlers came in one large group in 1636. They were Puritans from Massachusetts Bay Colony led by Thomas Hooker, who established the Connecticut Colony at Hartford. The Quinnipiack Colony was established by John Davenport, Theophilus Eaton, and others at New Haven in March 1638. The New Haven Colony had its own constitution called \"The Fundamental Agreement of the New Haven Colony\", signed on June 4, 1639."]}, {"page": "Elihu Yale", "response": ["Born in Boston, Massachusetts, to David Yale (1613–1690) and Ursula Knight, he was the grandson of Ann Lloyd (1591–1659), who after the death of her first husband, Thomas Yale (1587–1619) in Chester, Cheshire, England, married Governor Theophilus Eaton (1590–1658) of New Haven Colony."]}, {"page": "January 7", "response": ["*1658 – Theophilus Eaton, American farmer and politician, 1st Governor of the New Haven Colony (b. 1590)"]}, {"page": "Peter Stuyvesant", "response": ["Stuyvesant became involved in a dispute with Theophilus Eaton, the governor of English New Haven Colony, over the border of the two colonies. In September 1650, a meeting of the commissioners on boundaries took place in Hartford, Connecticut, called the Treaty of Hartford, to settle the border between New Amsterdam and the English colonies to the north and east. The border was arranged to the dissatisfaction of the Nine Men, who declared that \"the governor had ceded away enough territory to found fifty colonies each fifty miles square.\" Stuyvesant then threatened to dissolve the council. A new plan of municipal government was arranged in the Netherlands, and the name \"New Amsterdam\" was officially declared on 2 February 1653. Stuyvesant made a speech for the occasion, saying that his authority would remain undiminished.Henry K. Kessler, and Eugene Rachlis, Peter Stuvesant and His New York (1959)."]}, {"page": "1590", "response": ["* Theophilus Eaton, Puritan colonial merchant (d. 1658)"]}, {"page": "1658", "response": ["* January 7 – Theophilus Eaton, English-born Connecticut colonist (b. 1590)"]}, {"page": "New Haven, Connecticut", "response": ["In 1637 a small party of Puritans reconnoitered the New Haven harbor area and wintered over. In April 1638, the main party of five hundred Puritans who had left the Massachusetts Bay Colony under the leadership of Reverend John Davenport and London merchant Theophilus Eaton sailed into the harbor. It was their hope to set up a theological community with the government more closely linked to the church than that in Massachusetts, and to exploit the area's excellent potential as a port. The Quinnipiacs, who were under attack by neighboring Pequots, sold their land to the settlers in return for protection."]}, {"page": "New England Confederation", "response": ["*Theophilus Eaton, Commissioner"]}, {"page": "Eaton, New Hampshire", "response": ["Eaton was incorporated in 1760 by Colonial Governor Benning Wentworth, and named for Governor Theophilus Eaton of Connecticut, a generous contributor to the funds needed to settle Massachusetts in 1630.  He later formed a colony at New Haven, Connecticut, along with Reverend John Davenport and David Yale, great-grandfather of Yale University's founder, Elihu Yale."]}, {"page": "Theophilus", "response": ["* Theophilus Eaton (1590–1658), merchant, farmer, Puritan colonial leader, co-founder and first governor of New Haven Colony, Connecticut"]}, {"page": "Grove Street Cemetery", "response": ["*Theophilus Eaton (1590–1657)—a founder of New Haven, first Governor of New Haven."]}, {"page": "New Haven Colony", "response": ["In 1637, a group of London merchants and their families moved to Boston with the intention of creating a new settlement.  The leaders were John Davenport, a Puritan minister, and Theophilus Eaton, a wealthy merchant who brought £3000 to the venture. Both had experience in fitting out vessels for the Massachusetts Bay Company. The two ships that they chartered arrived in Boston on June 26, 1637. They learned about the area around the Quinnipiac River from militia engaged in the Pequot War, so Eaton set sail to view the area in late August. The site seemed ideal for trade, with a good port lying between Boston and the Dutch city of New Amsterdam on Manhattan and good access to the furs of the Connecticut River valley settlements of Hartford and Springfield.", "They further determined \"that the word of God shall be the only rule to be attended unto in ordering the affairs of government in this plantation.\" Theophilus Eaton was chosen as the first Magistrate. As the Bible contains no reference to trial by jury, the colonists eliminated it and the magistrate sat in judgment.Edgar J. McManus, Law and Liberty in Early New England: Criminal Justice and Due Process, 1620–1692 (1993)  p 103"]}, {"page": "History of Connecticut", "response": ["In 1637 a group of London merchants and their families, disgusted with the high Church Anglicanism around them, moved to Boston with the intention of creating a new settlement.Charles M. Andrews, The Colonial Period of American History: The Settlements II (1936)  pp 144-94 The leaders were John Davenport, a Puritan minister, and Theophilus Eaton, a wealthy merchant who brought £3000 to the venture. They understood theology, business and trade, but had no farming experience. The good port locations in Massachusetts had been taken, but with the removal of the Pequot Indians, there were good harbors available on Long Island Sound. Eaton found a good location in spring 1638 which he named New Haven. The site seemed ideal for trade, with a good port lying between Boston and the Dutch city of New Amsterdam (New York City), and good access to the furs of the Connecticut River valley settlements of Hartford and Springfield. The settlers had no official charter or permissions, and did not purchase any land rights from the local Indians. Legally, they were squatters.Edward Channing, History of the United States (1905) 1:408-11 Minister Davenport was an Oxford-educated intellectual, and he set up a grammar school and wanted to establish a college, but failed to do so. The leaders attempted numerous merchandising enterprises, but they all failed. Much of their money went into a great ship sent to London in 1646, with £5000 in cargo of grain and beaver pelts. It never arrived.Isabel M. Calder, The New Haven Colony  (1934)  ch 1-3"]}, {"page": "Connecticut Colony", "response": ["Governor John Haynes of the Massachusetts Bay Colony led 100 people to Hartford in 1636. He and Puritan minister Thomas Hooker are often considered the founders of the Connecticut colony. Hooker delivered a sermon to his congregation on May 31, 1638, on the principles of government, and it influenced those who wrote the Fundamental Orders of Connecticut later that year. The Fundamental Orders may have been drafted by Roger Ludlow of Windsor, the only trained lawyer living in Connecticut in the 1630s; they were transcribed into the official record by secretary Thomas Welles. The Revolution John Davenport and merchant Theophilus Eaton led the founders of the New Haven Colony, which was absorbed into Connecticut Colony in the 1660s."]}, {"page": "New Haven Green", "response": ["The Green was used as the main burial grounds for the residents of New Haven during its first 150 years, but by 1821 the practice was abolished and many of the headstones were moved to the Grove Street Cemetery. However, the remains of the dead were not moved, and thus still remain below the soil of the Green.  It is conservatively estimated that between 4,000 and 5,000 people remain buried there, including Benedict Arnold's first wife, members of President Rutherford B. Hayes' family, Reverend James Pierpont (founder of Yale University), and Theophilus Eaton, one of the founders of New Haven and the church and governor of the New Haven Colony for 19 years."]}, {"page": "Blue Laws (Connecticut)", "response": ["According to Peters the blue laws \"were never suffered to be printed\", but especially in the 19th century they were confused with the Code of 1650 of the colonists of Connecticut and with the statutes drafted in 1655 by Governor Theophilus Eaton for the then unconnected Colony of New Haven, for which he drew on the writings of the Reverend John Cotton and the laws of the Massachusetts Bay Colony, and which were printed in London in blue covers for the use of the colonists."]}, {"page": "John Davenport (minister)", "response": ["In 1637, he acquired the patent for a colony in Massachusetts and sailed with much of his congregation for Boston. While staying in Boston with Reverend John Cotton in March 1638, he sat during the church trial of Anne Hutchinson which resulted in her excommunication from the Boston church, ending the Antinomian Controversy.  Later that month he co-founded the Colony of New Haven along with his classmate, Theophilus Eaton, a wealthy merchant from London who became the colony's first governor. He was a large proponent of education in his colony and is often credited with the co-founding of Hopkins School.Chronicles of Hopkins Grammar School: 1660-1935. Thomas B Davis. Quinnipiack Press, New Haven, CT. 1938 As a burgess, he was an important figure in the colony up until his departure to Boston in 1668. He unsuccessfully opposed the incorporation of the New Haven colony into the reorganized colony of Connecticut under a royal charter in 1667."]}, {"page": "Nathaniel Eaton", "response": ["Eaton's older brother, Gov. Theophilus Eaton, led the group along with John Davenport as their religious leader. They intended to start their own settlement – probably due in part to the commanding persona of John Winthrop, Governor of the Massachusetts Bay Colony at the time (1637 to 1640, and many other terms). Winthrop was termed \"an object of great fear in all the colonies,\" and caused the Rev. Thomas Hooker and others to go off and form their own colonies as well. Deciding that he didn't want to be involved in the animosity, he – like Rev. Thomas Hooker before him – founded a new colony, the colony of New Haven, though Winthrop and others literally begged both of them to stay."]}, {"page": "Fundamental Agreement of the New Haven Colony", "response": ["*Theophilus Eaton"]}, {"page": "Davenport College", "response": ["In 1638 he sailed to North America with his congregation and a patent for a colony in Massachusetts. One year later he co-founded the city of New Haven with Theophilus Eaton and served as its burgess until his departure to Boston 30 years later. Beginning in the 1640s, Davenport advocated for the creation of a college near the New Haven Green, a vision realized by Yale College some fifty years after his death.  He is also credited with co-founding the nearby Hopkins School."]}, {"page": "Nicholas Hilliard", "response": ["Hilliard was born in Exeter in 1547.  He was the son of Richard Hilliard (1519–1594) of Exeter, Devon, also spelt Hellyer, a goldsmith who became a staunch Protestant and was Sheriff of Exeter in 1568, by his marriage to Laurence, daughter of John Wall, a City of London goldsmith.Kinney (1983), pp.3–12 He was one of four boys: two others became goldsmiths, and one a clergyman.   Hilliard may have been a close relative of Grace Hiller (Hilliar), first wife of Theophilus Eaton (1590–1657), the co-founder of New Haven Colony in America."]}, {"page": "Edward Hopkins", "response": ["He married Ann Yale (born about 1615, daughter of David and Ann (Lloyd) Yale of Wales, and step-daughter of Theophilus Eaton) in 1636 or 1637 in Hartford, Connecticut).http://ctstatelibrary.org/wp-content/uploads/2015/05/Edward-Hopkins.pdf ", "In 1637 he joined a venture led by Theophilus Eaton, an indirect relation through his wife, and John Davenport which led to the establishment of a settlement at the mouth of the Quinnipiac River and the founding of the New Haven Colony. Two months later he was sent north to recently founded Hartford on the Connecticut River to negotiate additional land purchases for the New Haven colonists, but decided to instead stay in Hartford, becoming one of the early settlers of the Connecticut Colony. In the colony's first election in 1639 he became one of several Assistants to the General Court. Then, in 1640 Hopkins was elected governor. Because the colony's charter forbade reelection to the governorship, Hopkins and John Haynes (Connecticut's first governor) traded off as governor (save one term by George Wyllys) between 1639 and 1655, each serving as Deputy Governor to the other when not governor."]}, {"page": "Robert Seeley", "response": ["When his old friend John Davenport arrived in Massachusetts, Seeley joined his group and helped establish the New Haven Colony in 1638.  Seeley served as New Haven's first town marshal and lieutenant of the militia.  He was generally known in the community as Lieutenant Seeley.  He also participated in Theophilus Eaton's exploratory expedition in Long Island Sound."]}, {"page": "List of Puritans", "response": ["*Theophilus Eaton"]}, {"page": "Caroline era", "response": ["The main body of settlers – Puritans from Massachusetts Bay Colony, led by Thomas Hooker – arrived in 1636 and established the Connecticut Colony at Hartford. The Quinnipiac Colony ...  The New Haven Colony was established by John Davenport, Theophilus Eaton, and others in March 1638. This colony had its own constitution called \"The Fundamental Agreement of the New Haven Colony\" ratified in 1639."]}, {"page": "St Stephen Coleman Street", "response": ["Early in the 17th century, St. Stephen's became a Puritan stronghold.D.A. Kirby, The Radicals of St. Stephen's, Coleman Street, London, 1624-1642 (Corporation of London, 1970).D.A. Williams, 'London Puritanism: the parish of St Stephen's, Coleman Street', The Church Quarterly Review vol 160 (1959), pp. 464-82.A. Johns, 'Coleman Street', Huntington Library Quarterly, 71 part 1 (2008), pp. 33-54 (University of Chicago pdf). A very prominent vestryman throughout this time was Sir Maurice Abbot.A. Thrush, 'Abbot, Maurice (1565-1642), of Coleman Street, London', in A. Thrush and J.P. Ferris (eds), The History of Parliament: the House of Commons 1604-1629 (Cambridge University Press, 2010), History of Parliament Online. The church was renovated at the cost of the parishioners in 1622, and a gallery was added over the south aisle in 1629. John Davenport, the vicar appointed in 1624, later resigned to become a Nonconformist pastor. It was during his Puritan incumbency that the playwright and Shakespeare collaborator Anthony Munday was buried in the church in 1633. In that year Davenport departed for the United Netherlands, but returned in 1636 and, in company with Theophilus Eaton and a company centred upon a core of parishioners of St Stephen's, in 1637 sailed for New England. Finding Boston torn by religious dissent they diverted to Long Island Sound, where they founded the plantation of New Haven Colony, Connecticut.I.M. Calder, 'Gift from St. Stephen's, Coleman Street, London', The Yale University Library Gazette Vol. 8, No. 4, Lafayette Centenary Number (April 1934), pp. 147-149 (Jstor - open)."]}, {"page": "List of places in the United States named after people", "response": ["*Eaton, New Hampshire – Connecticut Governor Theophilus Eaton"]}, {"page": "Ezekiel Rogers", "response": ["He arrived in New England in December 1638 with the families on the ship John of London, and wintered at Salem, Massachusetts. The first printing press brought to America came on board the ship with them, with the printer Stephen Daye.Rowley and Ezekiel Rogers, The First North American Printing Press (PDF)  Theophilus Eaton and John Davenport were then setting up their colony at New Haven; they tried to enlist Rogers, but without success."]}, {"page": "1658 in England", "response": ["* 7 January – Theophilus Eaton, colonial leader (born 1590)"]}, {"page": "List of colonial governors of Connecticut", "response": ["The New Haven Colony was established by the Puritan colonist Theophilus Eaton, who was of the opinion that the policies of the Massachusetts Bay Colony were too lax in enforcing Puritan standards.  After some exploration he purchased land from local Indians at the mouth of the Quinnipiac River in cx 1638.  The colony in 1639 established a government modeled on that drafted by the leaders of the Connecticut Colony, which called for annual elections of its governor.  Eaton was elected governor until his death in 1658.  Following the restoration of King Charles II to the English throne in 1660, the colony became a subject of his ire when it harbored two fugitive regicides of Charles I, Edward Whalley and William Goffe.  In 1662 Charles II issued a royal charter for the Connecticut Colony that merged the two colonies.  The process of merger was not completed until 1665.  The colony's last governor, William Leete, also later served as governor of Connecticut.", "|1 || Theophilus Eaton || 1639 || 1658"]}, {"page": "Eaton (surname)", "response": ["* Theophilus Eaton (1590–1658), first governor of New Haven Colony, Connecticut"]}, {"page": "Political party strength in Connecticut", "response": ["|rowspan=19|Theophilus Eaton"]}, {"page": "George Lloyd (bishop of Chester)", "response": ["His daughter Anne married Thomas Yale, whose son David was father of Elihu Yale, benefactor of the college now named for him.  Anne married secondly Theophilus Eaton, merchant, diplomat, and, later, one of the founders and the first governor of the New Haven Colony.  The Eatons emigrated to New England in 1637, aboard the Hector of London.Douglas Richardson, Kimball G. Everingham, Magna Carta Ancestry: A Study in Colonial and Medieval Families (2005), p. 910."]}, {"page": "Hopkins Academy", "response": ["The school was founded in 1664 with an endowment from Edward Hopkins, an English colonist who was Governor of the Connecticut Colony and a wealthy Connecticut merchant. Hopkins died in 1657 and in his will he set up a trust naming John Davenport, Theophilus Eaton, John Cullick and William Goodwin as trustees.  Goodwin, who helped to settle Hadley, used part of Hopkins' trust to set up a fund for the then Hopkins Donation School. Three hundred pounds were to be disposed of from Mr. Hopkins' estate and ordered to Hadley for erecting and maintaining a school there. The management thereof for the said schoole was appointed for year end viz; the Rev Jonathan Russell, Mr. Samuel Smith, Mr. Peter Tilton and Capt Aaron Cooke and finding in the records at Springfield, September 24, 1674.http://credo.library.umass.edu/view/pageturn/mums704-i7728/#page/72/mode/1up  The Hadley townspeople donated land to help build up the trust to pay for educational costs. The Hopkins Trust is the oldest charitable fund to be in continuous use in the United States. Edward Hopkins played a pivotal role in establishing and operating other prominent institutions within the United States, including Harvard University. As a result, Hopkins Academy is \"related\" to many well-known schools, including Yale, Amherst College, and the Hopkins School of New Haven, Connecticut."]}, {"page": "Thomas Powell (1641–1722)", "response": ["A Puritan minister named John Davenport led his flock from exile in the Netherlands back to England and finally to America in the spring of 1637. The group arrived in Boston on the ship Hector on June 26, but decided to strike out on their own, based on their impression that the Massachusetts Bay Colony was lax in its religious observances. In April 1638, the main party of five hundred Puritans left Massachusetts under the leadership of Davenport and the London merchant Theophilus Eaton, and sailed into their new haven.  The Quinnipiac Native Americans, who were under attack by neighboring Pequots, had sold their land to Eaton and the settlers in return for protection. These settlers established the New Haven Colony. In 1662, the colony merged with the Connecticut Colony."]}, {"page": "David Atwater", "response": ["Born in 1615 Royton, Lenham, Kent, England son of John Atwater and Susan Narsin, came to North America June 26, 1637 when he was 22. He sailed to America on a ship named Hector. Traveling with him was John Davenport and Theophilus Eaton (founders of New Haven). His brother, Joshua and sister Ann, were also on board."]}, {"page": "John Brockett (American colonist)", "response": ["He emigrated on June 26, 1637, to Boston, Massachusetts Bay Colony. John Brockett was the first Brockett in America when he arrived at Boston, Massachusetts Bay Colony. He came on the ship \"Hector\" with Reverend John Davenport (Puritan). The passengers on board that ship were \"gentlemen in wealth and character, with their servants and household effects.\" Most were from London and engaged as merchants and commercial businesses. Their arrival was joyously hailed at Boston for they were the wealthiest of immigrants to New England at that time. Shortly arriving, however, a small group led by Theophilus Eaton decided not to join Massachusetts Bay Colony, but to form a new colony. They explored the coast along Long Island Sound and chose a site that became New Haven Colony. Seven individuals wintered there to hold the site. Others arrived on 13 April 1638, including Davenport and John Brockett. They purchased land from the Quinnipiac Indians and formed a government based upon strict religious principles. He moved on 13 Apr 1638 to New Haven Colony.Edward Brockett. The Descendants of John Brockett; One of the Original Founders of New Haven Colony. East Orange, NJ. 1905. Page 23. Brockett was a signer of the first covenant of New Haven and became a leader among the founders of New Haven. His name appears more often on early town records than anyone but Eaton. In 1639, Brockett surveyed an area that is now the center of New Haven and laid out the borders with such accuracy that the same borders are used to this day."]}, {"page": "Samuel Eaton", "response": ["Eaton took orders and was beneficed, but being unable to conform to the regulations of the church as interpreted by Archbishop Laud, he accompanied his eldest brother Theophilus Eaton to New England in 1637, and became the colleague of John Davenport at New Haven. A difference of opinion afterwards arose between him and Davenport. At the convention of 4 June 1639 (O. S.) Eaton took exception to the fifth article of the constitution, which limited the right of voting and of holding public office to church members only on the ground that 'the free planters ought not to surrender this power out of their hands.' After his brother and Davenport had replied, he found so little support that he withdrew his dissent. The following year he set out for England with the design of gathering a company to settle Toboket, afterwards Branford, of which a grant had been made to him. On his way he preached for some time in Boston, but declined an invitation to settle there permanently."]}, {"page": "Trial of Thomas Hogg", "response": ["Theophilus Eaton, governor of the colony, and his deputy brought Hogg to a barnyard where the crime was supposed to have taken place. They ordered him to scratch the sow under her ear, after which \"there appeared a working of lust in the sow, insomuch that she powred out seede before them.\" Hogg was then ordered to scratch another sow, but she was not stimulated. The governor and deputy governor were frustrated that, despite their experiment, Hogg denied the charges. Without the confession, the \"impudent liar\" could not be hanged because the requirement of two witnesses could not be met. Instead, he was convicted of lying and stealing, for which he was severely whipped and incarcerated. While imprisoned, Hogg was kept on a \"mean diet and hard labor, that his lusts not be fed.\""]}, {"page": "William Jones (deputy governor)", "response": [" They arrived in Boston, Massachusetts, on July 27, 1660, in company with the regicides, judges Edward Whalley and William Goffe. They moved to New Haven in August of the same year; took possession of the mansion of Governor Theophilus Eaton, and continued to live there until their deaths. Jones was made a freeman in 1661. One of the most interesting facts in his life was his connection with the two judges, Whalley and Goffe. During their hiding in New Haven, Jones' house was their place of refuge for eleven days. The honors seem to have been shared with Reverend John Davenport during this exciting episode in  New Haven."]}, {"page": "Abraham Pierson, the elder", "response": ["In 1659 Pierson published a pamphlet entitled Some Helps for the Indians, showing them how to improve their natural reason, to know the true God and the true Christian Religion. It is a short statement of the fundamental principles of monotheism, with a linear translation into the Quiripi language that Pierson made with Thomas Stanton and unnamed Quiripi translators. Verses in Latin by Pierson on the death of Theophilus Eaton have been published."]}]}}