{"wiki_id": "http://www.wikidata.org/entity/Q24183505", "itemLabel": "Steve Cooper", "itemDescription": "Welsh association football manager and former player", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Cooper_(football_manager)", "wikipedia_page": {"main": "Steve Cooper (born 10 December 1979) is a Welsh professional football manager and former player. He is  currently the head coach of EFL Championship club Nottingham Forest.\nCooper began his coaching career at Wrexham's academy while playing as a defender in the Welsh football leagues. He moved to Liverpool in 2008 and was appointed manager of their academy in 2011. Cooper joined the England youth set-up in 2014, initially coaching the U16s, before winning the 2017 FIFA U-17 World Cup with the U17s. He became head coach of Swansea City in 2019.\n\n", "link_mentions": [{"page": "Nottingham Forest F.C.", "response": ["On 21 September 2021, Forest announced the appointment of Steve Cooper as the club's new head coach. Despite being bottom of the league when Cooper was appointed, Cooper inspired an impressive turnaround in form leaving the club in 7th position at Christmas.", "|align=left| Steve Cooper", "|Head coach ||  Steve Cooper"]}, {"page": "Swansea City A.F.C.", "response": ["Swansea City were relegated on 13 May 2018, following a 2–1 defeat to already-relegated Stoke City. On 11 June 2018, Graham Potter was announced as the club's new manager, replacing Carvalhal. On 2 February 2019, Huw Jenkins resigned as chairman amid increasing criticism over the club's sale to the American consortium in 2016 and the club's subsequent relegation from the Premier League. He was replaced with Trevor Birch. The first season back in the Championship produced a 10th-place finish, including a quarter-final appearance in the FA Cup. However, Potter left at the end of the season to manage Premier League club Brighton. He was succeeded by former England U17 manager Steve Cooper, with Mike Marsh joining him as his assistant. In September 2019, Cooper was named EFL Championship Manager of The Month, with Swansea City sitting top of the table after an unbeaten first month; this was Swansea's best start to a season in 41 years. On the final day of the season, Swansea beat Reading 4–1 to finish sixth, moving into the play-offs ahead of Nottingham Forest on goal difference, but were later defeated by Brentford in the semi-final second leg.", "At the end of the 2020–21 season, Swansea finished 4th in the league and secured a play-off place for a second consecutive season. Swansea progressed to the 2021 EFL Championship play-off Final after defeating Barnsley 2–1 on aggregate, but lost to Brentford at Wembley Stadium. For the 2021–22 season, the club unveiled a modernised version of the original crest to mark the 40th anniversary of the Swans' first promotion to the top flight in 1981. After Steve Cooper left the club, Russell Martin became head coach. Martin spoke with former Swansea boss Graham Potter before accepting the job. He said, \"I know the fanbase and what they expect in terms of the modern Swansea Way, that started under Roberto Martínez and continued under Brendan Rodgers and Michael Laudrup. We, as a coaching team, are very much aligned with that. It excites me.\""]}, {"page": "Mike Marsh (footballer)", "response": ["On 13 June 2019, Marsh was named assistant first-team coach to Steve Cooper at Swansea City."]}]}}