{"wiki_id": "http://www.wikidata.org/entity/Q2415411", "itemLabel": "William Billingsley", "itemDescription": "Porcelain artist (1758-1828)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Billingsley_(artist)", "wikipedia_page": {"main": "William Billingsley (1758–1828) was an influential painter of porcelain in several English porcelain factories, who also developed his own recipe for soft-paste porcelain, which produced beautiful results but a very high rate of failure in firing.  He is a leading name associated with the English Romantic style of paintings of groups of flowers on porcelain that is sometimes called \"naturalistic\" by older sources, although that may not seem its main characteristic today.  \nHe trained in his home town of Derby, and though his work certainly reached the London market, all his many movements never took him further than the Midlands and South Wales, by then the heart of the British porcelain-making industry, although wares were often sent to London to be painted.  His porcelain body was made by him at Pinxton and later at the Nantgarw Pottery, which he founded in 1813 with his son-in-law.  He had spent over twenty years at Derby porcelain, a period after 1808 at Worcester porcelain, and ended his career at Coalport porcelain.", "link_mentions": [{"page": "Hausmaler", "response": ["In England, among independent porcelain-painters of the mid-18th century, William Duesbury went on to manufacture porcelain as a founder of the Royal Crown Derby and owner of manufactories at Bow, Chelsea, Derby and Longton Hall.  Chamberlain's Factory making Worcester porcelain was another started by an enamel painter, and the complicated career of the painter William Billingsley included periods running a decorating shop. The largest concentration of artists was in Londo, and many wares were sent there to be decorated, and them passed to the showrooms that were also in London, long after porcelain ceased to be made in the capital."]}, {"page": "Royal Crown Derby", "response": ["In 1745 André Planché, a Huguenot immigrant from Saxony, settled in Derby, where between 1747 and 1755 he made soft-paste porcelain vases and figurines. At the beginning of 1756 he formed a business partnership with William Duesbury (1725–1786), a porcelain painter formerly at Chelsea porcelain factory and Longton Hall, and the banker John Heath.The original agreement survives in the Victoria and Albert Museum. This was the foundation of the Derby company, although production at the works at Cockpit Hill, just outside the town, had begun before then, as evidenced by a creamware jug dated 1750, also in the possession of the Victoria and Albert Museum. Planché disappeared from the scene almost at once, and the business was developed by Duesbury and Heath, and later Duesbury alone. A talented entrepreneur, Duesbury developed a new body which contained glass frit, soapstone and calcined bone. This enabled the factory to begin producing high-quality tableware. He quickly established Derby as a leading manufacturer of dinner services and figurines by employing the best talents available for modelling and painting. Figure painting was done by Richard Askew, particularly skilled at painting cupids, and James Banford. Zachariah Boreman and John Brewer painted landscapes, still lifes, and pastorals. Intricate floral patterns were designed and painted by William Billingsley.", "*John W, William Billingsley 1758-1828 1968."]}, {"page": "1828 in art", "response": ["** William Billingsley, English painter of porcelain (born 1758)"]}, {"page": "Royal Worcester", "response": ["Artists and designers who worked for the factory included Thomas Baxter, William Billingsley, John Stinton, David Bates, James Hadley, Christopher Dresser, Charles Baldwin, Harry Davis and Peter Ewence.  A number of Royal Worcester fruit painters from the late 19th century onwards are known to collectors."]}, {"page": "1758 in art", "response": ["** William Billingsley, English painter of porcelain (died 1828)"]}, {"page": "1828 in the United Kingdom", "response": ["* William Billingsley, porcelain painter (born 1758)"]}, {"page": "Nantgarw", "response": ["Nantgarw lies on the River Taff. It is known for its porcelain, produced in between 1813-1814, and later between 1817-1820 at the Nantgarw Pottery, commemorated at the Nantgarw Chinaworks Museum. The potter and painter William Billingsley is credited with starting the porcelain trade here."]}, {"page": "Cambrian Pottery", "response": ["After William Billingsley, then owner of the Nantgarw porcelain factory, asked the Board of Trade for help, as he was not making a profit, the board asked Dillwyn, as a noted nearby pottery manager,  to report on the matter. Dillwyn was so impressed with Billingsley's soft-paste porcelain product that he arranged with him to transfer production to the Cambrian Pottery, which began in 1814.  However, Billingsley kept the secret of his recipe for the paste, which was of extremely high quality, especially for receiving painting, \"highly translucent and of beautiful whiteness, but very liable to melt out of shape in the kiln\" and so extremely expensive to make, as a high proportion of pieces were unsaleable,Honey, 314-315, 314 quoted 90% according to many sources."]}, {"page": "William Weston Young", "response": ["In early 1814, Young became the major investor in William Billingsley and Samuel Walker's venture; the Nantgarw Pottery, Nantgarw, Glamorganshire. Billingsley and Walker, through their prior ties with Flight, Barr & Barr at Royal Worcester had signed an agreement not to disclose their new porcelain recipe to a third party, but there was no clause preventing them from using that recipe themselves. The pottery was set up, but something of Billingsley & Walker's understanding of the recipe or manufacturing process was amiss, as 90% of the porcelain was ruined in the firing. The resources of the three associates soon ran out, and the group approached the British Government's Committee of Trade and Plantations asking for a grant of £500, referring to the subsidy the French Government had given the famous Sèvres Porcelain Factory. They were not successful, but one member of the committee, a porcelain enthusiast; Sir Joseph Banks, suggested to his friend and ceramicist Lewis Weston Dillwyn of the Cambrian Pottery of Swansea, Glamorganshire, should make an inspection and report on the matter."]}, {"page": "Nantgarw China Works", "response": ["The factory made porcelain of very high quality, especially in the years from 1813–1814 and 1817–1820.  Porcelain produced by Nantgarw was extremely white and translucent, and was given overglaze decoration of high quality, mostly in London or elsewhere rather than at the factory.  The wares were expensive, and mostly distributed through the London dealers.  Plates were much the most common shapes made, and the decoration was typically of garlands of flowers in a profusion of colours, the speciality of the founder, William Billingsley.  With Swansea porcelain, Nantgarw was one of the last factories to make soft-paste porcelain, when English factories had switched to bone china, and continental and Asian ones continued to make hard-paste porcelain.Battie, 147; Honey, 314-323", "Established in November 1813, when artist and potter William Billingsley and his son-in-law Samuel Walker, a skilled technician, rented \"Nantgarw House\" on the eastern bank of the Glamorganshire Canal, eight miles north of Cardiff in the Taff Valley, Glamorganshire, Wales, and set about building the kilns and ancillary equipment in its grounds, necessary to transform the building into a small porcelain pottery."]}]}}