{"wiki_id": "http://www.wikidata.org/entity/Q2424994", "itemLabel": "Roger Allam", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Allam", "wikipedia_page": {"main": "Roger William Allam (born 26 October 1953) is a British actor, who has performed on stage, in film, on television and radio.\nHe played Inspector Javert in the original London production of the stage musical Les Misérables, First Officer Douglas Richardson in the award-winning radio series Cabin Pressure, and DI Fred Thursday in the TV series Endeavour. He is also known for his roles as Illyrio Mopatis in the HBO series Game of Thrones, Royalton in Speed Racer, Lewis Prothero in the 2005 adaptation of V for Vendetta and as Peter Mannion MP in The Thick Of It.\nHe has been nominated four times for the Laurence Olivier Award for Best Actor, winning twice.", "link_mentions": [{"page": "Colin Dexter", "response": ["A prequel series, Endeavour, featuring a young Morse and starring Shaun Evans and Roger Allam, began airing on the ITV network in 2012. Dexter was a consultant in the first few years of the programme. As with Morse, Dexter occasionally made cameo appearances in Lewis and Endeavour. Endeavour has aired seven series, with the eighth series, delayed by the coronavirus pandemic, airing in September 2021, taking young Morse's career into 1971."]}, {"page": "October 26", "response": ["*1953 – Roger Allam, British actor"]}, {"page": "Philip Henry Gosse", "response": ["Father and Son was also adapted for BBC Radio 4 in 2005 by Nick Warburton. Roger Allam played Gosse and Derek Jacobi, Edmund."]}, {"page": "Prospero", "response": ["* Roger Allam (2013), videotaped and later broadcast as part of their Live Cinema broadcasts."]}, {"page": "1999 in film", "response": ["| RKO 281 || HBO Pictures / Scott Free Productions / BBC Films / WGBH Boston || Benjamin Ross (director); John Logan (screenplay); Liev Schreiber, James Cromwell, Melanie Griffith, Brenda Blethyn, Roy Scheider, John Malkovich, Liam Cunningham, David Suchet, Fiona Shaw, Anastasia Hille, Roger Allam, Simeon Andrews, William Armstrong, Jay Benedict, Ron Berglas, Paul Birchard, Neil Conrich, Michael Cronin, Sarah Franzl, Aaron Keeling, Joseph Long, Olivier Pierre, Roger Rose, Rolf Saxon, Adrian Schiller, Kerry Shale, Cyril Shaps, Tusse Silberg, Toby Whithouse, Tim Woodward, Angus Wright, Bobby Valentino, Lucy Cohu || Historical Drama || Live action"]}, {"page": "Henry Pelham", "response": ["Pelham was played by Roger Allam in the 2011 film Pirates of the Caribbean: On Stranger Tides."]}, {"page": "Les Misérables (musical)", "response": ["| style=\"text-align:center;\" | Roger Allam", "The original London cast included Colm Wilkinson as Jean Valjean, Roger Allam as Javert, Ken Caswell as the Bishop of Digne, Patti LuPone as Fantine, Zoë Hart, Justine McIntyre, Jayne O'Mahony and Joanne Woodcock as Young Cosette, Danielle Akers, Gillian Brander and Juliette Caton as Young Éponine, Susan Jane Tanner as Madame Thénardier, Alun Armstrong as Thénardier, Frances Ruffelle as Éponine, Rebecca Caine as Cosette, Michael Ball as Marius, David Burt as Enjolras, with Ian Tucker, Oliver Spencer and Liza Hayden sharing the role of Gavroche.", "The cast includes Colm Wilkinson as Valjean, Roger Allam as Javert, Patti LuPone as Fantine, Alun Armstrong as Thénardier, Susan Jane Tanner as Mme. Thénardier, Frances Ruffelle as Éponine, Ian Tucker as Gavroche, Michael Ball as Marius, David Burt as Enjolras, Rebecca Caine as Cosette and Zoë Hart"]}, {"page": "Christ's Hospital", "response": ["Former pupils in theatre and film include Jason Flemyng, Leo Gregory, James D'Arcy, Michael Wilding and Roger Allam."]}, {"page": "Les Liaisons dangereuses", "response": ["* An eight-part adaptation of the novel was broadcast as BBC Radio 4's \"Woman's Hour Drama\" (20–30 July 1992). It starred Juliet Stevenson, Samuel West, Melinda Walker, Diana Rigg, and Roger Allam."]}, {"page": "Michael Frayn", "response": ["Frayn's more recent play Democracy ran successfully in London (the National Theatre, 2003-4 and West End transfer), Copenhagen and on Broadway (Brooks Atkinson Theatre, 2004-5); it dramatised the story of the German chancellor Willy Brandt and his personal assistant, the East German spy Günter Guillaume. Five years later, again at the National Theatre, it was followed by Afterlife, a biographical drama of the life of the great Austrian impresario Max Reinhardt, director of the Salzburg Festival, which opened at the Lyttelton Theatre in June 2008, starring Roger Allam as Reinhardt.Fiona Maddocks, \"The History Play Man; Daring: Frayn's Drama Slips in and out of Rhyming Couplets \"To Blur the Distinction between Theatre and Life Just as Rheinhardt Did,\" The Evening Standard, 3 June 2008."]}, {"page": "Blithe Spirit (play)", "response": ["BBC Radio's broadcasts of the play include a 1983 version with Paul Eddington as Charles, Julia McKenzie as Ruth, Anna Massey as Elvira and Peggy Mount as Madame Arcati.\"Radio\", The Times, 27 December 1983, p. 17  In December 2008 a BBC radio adaptation was made by Bert Coules, with Roger Allam as Charles, Hermione Gulliford as Ruth, Zoe Waites as Elvira and Maggie Steed as Madame Arcati.Donovan, Paul '\"Pick of the day – TV & radio\", The Sunday Times, 7 December 2008, p. 87 In December 2014, an adaptation of the play by Sean O'Connor was broadcast on BBC Radio 4 as part of an episode of The Archers, with the characters from the series playing the roles in Blithe Spirit.\"Afternoon Drama: Blithe Spirit\", BBC Radio 4, accessed 29 December 2014"]}, {"page": "Our Friends in the North", "response": ["Our Friends in the North was originally written by the playwright Peter Flannery for the theatre, while he was a writer in residence for the Royal Shakespeare Company (RSC).Eaton, p. 2 The idea came to Flannery while he was watching the rehearsals for the company's production of Henry IV, Part 1 and Part 2 at Stratford-upon-Avon in 1980; the scale of the plays inspired him to come up with his own historical epic. The original three-hour long theatre version of Our Friends in the North, directed by John Caird and featuring Jim Broadbent and Roger Allam among the cast, was produced by the RSC in 1982. It initially ran for a week at The Other Place in Stratford before touring to the city in which it was set, Newcastle upon Tyne, and then playing at The Pit, a studio theatre in the Barbican Centre in London.Eaton, p. 8 In its original form, the story went up only to the 1979 general election and the coming to power of the new Conservative government under Margaret Thatcher.Eaton, p. 121 The play also contained a significant number of scenes set in Rhodesia, chronicling UDI, the oil embargo and the emergence of armed resistance to white supremacy.Eaton, p. 6 This plot strand was dropped from the televised version, although the title Our Friends in the North, a reference to how staff at BP in South Africa referred to the Rhodesian government of Ian Smith, remained.Eaton, p. 7"]}, {"page": "Noël Coward Theatre", "response": ["On 8 June 2005, Dion Boucicault's Victorian melodrama The Shaughraun opened; however, its success at the Dublin Gate Theatre was not repeated in London and it closed on 30 July. A dark period of around three months followed before the theatre was transferred to the ownership of Delfont Mackintosh Limited and reopened in October 2005 with The Right Size's new production Ducktastic!. Once again this failed to live up to expectations and closed just three weeks after opening on 19 November 2005. A short Christmas season of Patrick Stewart's one-man version of Charles Dickens' A Christmas Carol played from 6 to 31 December 2005, before the theatre hosted the Edinburgh International Festival hit drama Blackbird starring Roger Allam. The award-winning play Enron (directed by Rupert Goold, starring Samuel West and Tim Pigott-Smith) transferred here after a sellout run at the Royal Court. The European premiere of the Broadway hit, Avenue Q, started previewing on 2 June 2006 and had its opening night on 28 June 2006, finally closing on 28 March 2009 prior to transferring to the Gielgud Theatre.", "* Blackbird (13 February 2006 – 13 May 2006) by David Harrower, starring Roger Allam and Jodhi May"]}, {"page": "Duke of York's Theatre", "response": ["* The Moderate Soprano (12 April 2018 – 30 June 2018) by David Hare, starring Roger Allam and Nancy Carroll"]}, {"page": "Bow, London", "response": ["* Roger Allam, actor known for ITV’s Endeavour, born in Bow."]}, {"page": "Dervla Kirwan", "response": ["From April to May 2012, Kirwan appeared on stage at the Chichester Festival Theatre in a Jeremy Herrin production of Uncle Vanya. Kirwan played Sonya alongside an exceptional cast which included Roger Allam (as Vanya), Timothy West and Lara Pulver. The play received warm reviews and response to Kirwan's performance was generally positive."]}, {"page": "The Duchess of Malfi", "response": ["*Radio – on BBC Radio 3, 8/11/1992, with Fiona Shaw in the title role, Roger Allam and John Shrapnel."]}, {"page": "Jodhi May", "response": ["In August 2005, May appeared in Blackbird by David Harrower alongside Roger Allam at the Edinburgh Festival in a production by German director Peter Stein. The play transferred to the Albery Theatre, London in February 2006 and won a best new play award."]}, {"page": "Tamsin Greig", "response": ["Greig made a cameo appearance in the 2004 comedy Shaun of the Dead. She starred with Richard E. Grant in the 2009 film Cuckoo, and with Roger Allam and Gemma Arterton in Tamara Drewe (2010). The latter role earned Greig a British Independent Film Awards nomination for Best Supporting Actress. She co-starred in 2015's comedy-drama The Second Best Exotic Marigold Hotel and in the 2016 release of Breaking the Bank, opposite Kelsey Grammer."]}]}}