{"wiki_id": "http://www.wikidata.org/entity/Q24203391", "itemLabel": "Carrie Morrison", "itemDescription": "first female solicitor in England", "wikipedia_url": "https://en.wikipedia.org/wiki/Carrie_Morrison", "wikipedia_page": {"main": "Carol Morrison (3 February 1888 – 20 February 1950) was the first woman to be admitted as a solicitor in England.\n\n", "link_mentions": [{"page": "Soroptimist International", "response": ["* Carrie Morrison"]}, {"page": "Women in law", "response": ["* Carrie Morrison was the first woman solicitor in the United Kingdom."]}, {"page": "Auvergne Doherty", "response": ["Auvergne Doherty was among the first cohort of women called to the Bar, along with Theodora Llewellyn-Davis, Helena Normanton, Monica Geikie Cobb, Ethel Bright Ashford, Elsie Wheeler, Beatrice Davy, Sybil Campbell and Dr Ivy Williams. Ivy Williams was the first woman to be called to the Bar in 1922. Helena Normanton was the first woman law student and first woman barrister to practice in 1922. Carrie Morrison became the first women solicitor."]}, {"page": "Mary Sykes", "response": ["Having been articled to her father, a partner in his own firm of solicitors in Huddersfield (Armitage, Sykes and Hinchcliffe), in November 1922, along with Mary Pickup, Carrie Morrison, and Maud Crofts,  she was one of the first women to sit the Law Society’s Final Examination, the first time the examination was opened to women following the passing of the Sex Disqualification (Removal) Act 1919. Morrison was the first of them to finish her articles, and was the first woman admitted to the role of solicitor. Sykes was admitted as a solicitor in 1923. She worked for her father’s firm until 1930, when she set up her own firm, Mary E Sykes & Co. She remained in practice as a solicitor until 1968. In 1980 Mary E Sykes & Co merged with Ramsdens Solicitors.  Sykes was elected president of the Huddersfield Law Society in 1951 and in 1955 was appointed as a magistrate."]}, {"page": "List of first women lawyers and judges in Europe", "response": ["* Carrie Morrison (1922): First female solicitor in England"]}, {"page": "Ambrose Appelbe", "response": ["In 1929, Appelbe married fellow solicitor Carrie Morrison.England & Wales, National Probate Calendar (Index of Wills and Administrations), 1858-1966, 1973-1995  At the 1935 United Kingdom general election, he stood unsuccessfully for the Labour Party in Harwich.British parliamentary election results 1918-1949, Craig, F. W. S.  In 1958, he was a founding trustee of the Albany Trust."]}, {"page": "Women in law in the United Kingdom", "response": ["In 1922 Carrie Morrison, Mary Pickup, Mary Sykes, and Maud Crofts became the first women in England to qualify as solicitors; Morrison was the first of them admitted as a solicitor."]}]}}