{"wiki_id": "http://www.wikidata.org/entity/Q24258822", "itemLabel": "Chris Grube", "itemDescription": "British sailor", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Grube", "wikipedia_page": {"main": "Chris Grube (born 22 January 1985) is a British sailor who competed at the 2016 Summer Olympics in Rio de Janeiro, Brazil.", "link_mentions": [{"page": "Grube (surname)", "response": ["* Chris Grube (born 1985), British sailor"]}, {"page": "Luke Patience", "response": ["Patience and Stuart Bithell were selected to compete for Great Britain at the 2012 Summer Olympics in London, United Kingdom in the men's 470 class ahead of Chris Grube and Nick Rogers. heading into the final race of the event the pair were guaranteed at least a silver medal but had to beat the leading Australian crew of Mathew Belcher and Malcolm Page with a boat between them in order to take gold. Patience and Bithell finished fourth in the race with the Australian's second, meaning they took the silver medal.", "In March 2016 Patience was forced to find a new partner after Willis was diagnosed with bowel cancer and had to withdraw from the Olympics; he teamed up with Chris Grube and had to requalify for the Olympics. They took part in a World Cup event at Hyères in France, despite suffering a black flag disqualification in one race they finished tenth overall. In May 2016 Patience and Grube were confirmed as the Great Britain team's entry for the men's 470 in Rio."]}, {"page": "2013 Extreme Sailing Series", "response": ["Competing for the second year, Team Wales consisted of Dave Evans (Skipper/Helm), Chris Grube/Bleddyn Mon (Tactician), Will Howden (Mainsail Trim), Tudur Owen (Headsail Trim) and Trystan Seal (Bowman)."]}, {"page": "Sailing at the 2016 Summer Olympics – Qualification", "response": ["|  |||| 2014 Worlds || 4 || Luke PatienceElliot Willis  ||  Luke PatienceChris Grube"]}, {"page": "Great Britain at the 2016 Summer Olympics", "response": ["|align=left|Chris GrubeLuke Patience"]}, {"page": "2018 Sailing World Cup", "response": ["|Miami || Luke PatienceChris Grube ||  || "]}, {"page": "US Sailing's Miami Olympic Classes Regatta", "response": ["*2018 –  Luke Patience & Chris Grube"]}, {"page": "Sailing at the 2020 Summer Olympics – Qualification", "response": ["|  ||  || 2018 Worlds || 11 || Luke PatienceChris Grube || Luke PatienceChris Grube"]}, {"page": "Great Britain at the 2020 Summer Olympics", "response": ["|align=left|Chris GrubeLuke Patience"]}]}}