{"wiki_id": "http://www.wikidata.org/entity/Q2427370", "itemLabel": "Thomas Southorn", "itemDescription": "British colonial administrator (1879-1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Southorn", "wikipedia_page": {"main": "Sir Wilfrid Thomas Southorn  (4 August 1879 – 15 March 1957) (Chinese Translated Name: 修頓, Old Translated Name:蕭敦), known as Tom, was a British colonial administrator, spending the large part of career in Ceylon (now Sri Lanka) before serving as Colonial Secretary of Hong Kong, then Governor of The Gambia.\n\n", "link_mentions": [{"page": "Governor of Hong Kong", "response": ["| Thomas Southorn修頓", "| Thomas Southorn修頓", "| Thomas Southorn修頓"]}, {"page": "List of colonial governors of the Gambia", "response": ["| rowspan=\"2\" |Sir Thomas SouthornKCMG KBE(1879–1957)"]}, {"page": "Chief Secretary for Administration", "response": ["| rowspan=3| Sir Thomas Southorn修頓"]}, {"page": "Southorn Playground", "response": ["Southorn Playground is bounded by Hennessy Road to the north, Luard Road to the west, Johnston Road to the south, and buildings to the east. It has been Wan Chai's main recreational area since the 1930s. It was named in 1934 after Sir Wilfrid Thomas Southorn, the Colonial Secretary from 1925 to 1936.", "The land on which the Southorn Playground sits was reclaimed from Victoria Harbour as part of the Praya East Reclamation Scheme during the 1920s. In 1929, the government set up the Playing Fields Committee to study the provision of children's playgrounds. The committee recommended setting aside areas for children, and Thomas Southorn suggested preserving the land between Johnston Road and Hennessy Road as a playground.", "A formal opening ceremony was held for the then-Wanchai Children's Playground, officiated by Thomas Southorn and Rotary Club president Ts'o Seen Wan, on 11 July 1934. The playground was actually open in some capacity prior to the commemorative opening ceremony – an April 1934 news article stated that the facility already had an average daily attendance of some 275 children."]}, {"page": "Mountain Lodge", "response": ["Governor Sir Francis Henry May and Lady May used it extensively and there are several photos of their family showing everyday life at Mountain Lodge 1910–1920.A collection of photos at the Hong Kong Public Records Office Thomas Southorn also lived there with his wife, including during 1925–1936.Out and about – Bella Southorn's stories reflect the life she loved as the wife of a colonial civil servant, SCMP Post Magazine, Jason Wordie, 24 Apr 2011"]}, {"page": "Chief Justice of the Supreme Court of Hong Kong", "response": ["|Thomas Southorn"]}]}}