{"wiki_id": "http://www.wikidata.org/entity/Q24200099", "itemLabel": "Mark Aldred", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Aldred", "wikipedia_page": {"main": "Mark David Aldred (born 18 April 1987) is a British rower who competed at the 2016 Summer Olympics in Rio.", "link_mentions": [{"page": "Cambridge University Lightweight Rowing Club", "response": ["| March 23, 2008 ||style=\"background:#004685; color:#FFF;\"| Lost || 6:15 || 2½ || John Kyffin, James Fulcher, Ben Thomas, Peter Herrick, Alex Markham, George Blessley, Mark Aldred, Christopher Kerr, Ted Randolph", "| March 22, 2009 ||style=\"background:#B7E1E4; color:#000;\"| Won || 5:49 || 3 || Christopher Kerr, John Kiely, Alistair Chappelle, Mark Aldred, George Blessley, John Hale, Iain Rist, Donald Evans, Elizabeth Box", "* 2016 Rio — Mark Aldred GBR LM4- ", "* 2014 World Rowing Championships, Amsterdam — Mark Aldred GBR LM4- - Bronze", "* 2013 World Rowing Championships, Chungju — Mark Aldred GBR LM2- - Bronze"]}, {"page": "Aldred", "response": ["* Mark Aldred (born 1987), British rower"]}, {"page": "Richard Chambers (rower)", "response": ["He competed at the 2014 World Rowing Championships in Bosbaan, Amsterdam, where he won a bronze medal as part of the lightweight coxless four with Mark Aldred, Chris Bartley and his brother Richard."]}, {"page": "2013 World Rowing Championships", "response": ["| Sam ScrimgeourMark Aldred || 6:52.08"]}, {"page": "2014 World Rowing Championships", "response": ["| Mark AldredPeter ChambersRichard ChambersChris Bartley || 5:49.58"]}, {"page": "Peter Chambers", "response": ["In 2016, he won European silver in the men's lightweight four, and was selected for the British Olympic team competing in the men's lightweight coxless four event with Chris Bartley, Mark Aldred and Jono Clegg, finishing in seventh place."]}, {"page": "Chris Bartley (rower)", "response": ["The following year he competed at the 2014 World Rowing Championships in Bosbaan, Amsterdam, where he won a bronze medal as part of the lightweight coxless four with Mark Aldred, Peter Chambers and Richard Chambers.", "In 2016 he was selected for the British Olympic team and competed in the men's lightweight coxless four event with Jono Clegg, Mark Aldred and Peter Chambers, finishing in seventh place."]}, {"page": "2014 European Rowing Championships", "response": ["|Mark AldredPeter ChambersRichard ChambersChris Bartley || 6:10.97"]}, {"page": "Great Britain at the 2016 Summer Olympics", "response": ["|align=left|Mark AldredChris BartleyPeter ChambersJono Clegg"]}, {"page": "Rowing at the 2016 Summer Olympics – Qualification", "response": ["| 9 || align=left|  || align=left| Mark AldredChris BartleyPeter ChambersJono Clegg"]}, {"page": "Rowing at the 2016 Summer Olympics – Men's lightweight coxless four", "response": ["| align=left | Chris BartleyMark AldredJono CleggPeter Chambers", "| align=left | Chris BartleyMark AldredJono CleggPeter Chambers", "| align=left | Chris BartleyMark AldredJono CleggPeter Chambers"]}, {"page": "2016 European Rowing Championships", "response": ["|Chris BartleyMark AldredJono CleggPeter Chambers || 6:47.73"]}, {"page": "Jono Clegg", "response": ["Two years later he was selected for the British Olympic team and competed in the men's lightweight coxless four event with Chris Bartley, Mark Aldred and Peter Chambers finishing in seventh place."]}, {"page": "Aldred, Mark", "response": ["#redirectMark Aldred"]}, {"page": "Sam Scrimgeour", "response": ["Scrimgeour competed at the 2013 World Rowing Championships in Chungju, where he won a bronze medal as part of the lightweight coxless pair with Mark Aldred. He then competed at the 2014 World Rowing Championships in Bosbaan, Amsterdam, where he won a bronze medal as part of the lightweight coxless pair with Jono Clegg. The following year he was part of the British team that topped the medal table at the 2015 World Rowing Championships at Lac d'Aiguebelette in France, where he won a gold medal as part of the lightweight coxless pair with Joel Cassells. "]}, {"page": "2011 British Rowing Championships", "response": ["|Open 4-    ||NottinghamMatt Ley, Rob Yates, Matt Gotrel, Richard Watton||Durham UniversityStu McCluskey, Callum McBrierty, Stephen Jones, John Ford||LondonRichard Dunley, Alex Cawthorne, Mark Aldred, David Loveday"]}]}}