{"wiki_id": "http://www.wikidata.org/entity/Q242542", "itemLabel": "Margaret Murray", "itemDescription": "British egyptologist and anthropologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaret_Murray", "wikipedia_page": {"main": "Margaret Alice Murray (13 July 1863 – 13 November 1963) was an Anglo-Indian Egyptologist, archaeologist, anthropologist, historian, and folklorist. The first woman to be appointed as a lecturer in archaeology in the United Kingdom, she worked at University College London (UCL) from 1898 to 1935. She served as President of the Folklore Society from 1953 to 1955, and published widely over the course of her career.\nBorn to a wealthy middle-class English family in Calcutta, British India, Murray divided her youth between India, Britain, and Germany, training as both a nurse and a social worker. Moving to London, in 1894 she began studying Egyptology at UCL, developing a friendship with department head Flinders Petrie, who encouraged her early academic publications and appointed her Junior Professor in 1898. In 1902–03 she took part in Petrie's excavations at Abydos, Egypt, there discovering the Osireion temple and the following season investigated the Saqqara cemetery, both of which established her reputation in Egyptology. Supplementing her UCL wage by giving public classes and lectures at the British Museum and Manchester Museum, it was at the latter in 1908 that she led the unwrapping of Khnum-nakht, one of the mummies recovered from the Tomb of the Two Brothers – the first time that a woman had publicly unwrapped a mummy. Recognising that British Egyptomania reflected the existence of a widespread public interest in Ancient Egypt, Murray wrote several books on Egyptology targeted at a general audience.\nMurray also became closely involved in the first-wave feminist movement, joining the Women's Social and Political Union and devoting much time to improving women's status at UCL. Unable to return to Egypt due to the First World War, she focused her research on the witch-cult hypothesis, the theory that the witch trials of Early Modern Christendom were an attempt to extinguish a surviving pre-Christian, pagan religion devoted to a Horned God. Although later academically discredited, the theory gained widespread attention and proved a significant influence on the emerging new religious movement of Wicca. From 1921 to 1931 Murray undertook excavations of prehistoric sites on Malta and Menorca and developed her interest in folkloristics. Awarded an honorary doctorate in 1927, she was appointed Assistant Professor in 1928 and retired from UCL in 1935. That year she visited Palestine to aid Petrie's excavation of Tall al-Ajjul and in 1937 she led a small excavation at Petra in Jordan. Taking on the presidency of the Folklore Society in later life, she lectured at such institutions as the University of Cambridge and City Literary Institute, and continued to publish in an independent capacity until her death.\nMurray's work in Egyptology and archaeology was widely acclaimed and earned her the nickname of \"The Grand Old Woman of Egyptology\", although after her death many of her contributions to the field were overshadowed by those of Petrie. Conversely, Murray's work in folkloristics and the history of witchcraft has been academically discredited and her methods in these areas heavily criticised. The influence of her witch-cult theory in both religion and literature has been examined by various scholars, and she herself has been dubbed the \"Grandmother of Wicca\".", "link_mentions": [{"page": "Diana (mythology)", "response": ["Leland's claim that Aradia represented an authentic tradition from an underground witch-cult, which had secretly worshiped Diana since ancient times has been dismissed by most scholars of folklore, religion, and medieval history. After the 1921 publication of Margaret Murray's The Witch-cult in Western Europe, which hypothesized that the European witch trials were actually a persecution of a pagan religious survival, American sensationalist author Theda Kenyon's 1929 book Witches Still Live connected Murray's thesis with the witchcraft religion in Aradia.Hutton, 2000, p. 199.Clifton, p. 62. Arguments against Murray's thesis would eventually include arguments against Leland. Witchcraft scholar Jeffrey Russell devoted some of his 1980 book A History of Witchcraft: Sorcerers, Heretics and Pagans to arguing against the claims Leland presented in Aradia. Historian Elliot Rose's A Razor for a Goat dismissed Aradia as a collection of incantations unsuccessfully attempting to portray a religion. In his book Triumph of the Moon, historian Ronald Hutton doubted not only of the existence of the religion that Aradia claimed to represent, and that the traditions Leland presented were unlike anything found in actual medieval literature,Hutton, 2000, pp. 145–148. but also of the existence of Leland's sources, arguing that it is more likely that Leland created the entire story than that Leland could be so easily \"duped\". Religious scholar Chas S. Clifton took exception to Hutton's position, writing that it amounted to an accusation of \"serious literary fraud\" made by an \"argument from absence\".Clifton, p. 67.", "A few Wiccan traditions would elevate Diana to a more prominent position of worship, and there are two distinct modern branches of Wicca focused primarily on Diana. The first, founded during the early 1970s in the United States by Morgan McFarland and Mark Roberts, has a feminist theology and only occasionally accepts male participants, and leadership is limited to female priestesses. McFarland Dianic Wiccans base their tradition primarily on the work of Robert Graves and his book The White Goddess, and were inspired by references to the existence of medieval European \"Dianic cults\" in Margaret Murray's book The Witch-Cult in Western Europe. The second Dianic tradition, founded by Zsuzsanna Budapest in the mid 1970s, is characterized by an exclusive focus on the feminine aspect of the divine, and as a result is exclusively female. This tradition combines elements from British Traditional Wicca, Italian folk-magic based on the work of Charles Leland, feminist values, and healing practices drawn from a variety of different cultures.Budapest, Zsuzsanna. Holy Book of Women's Mysteries, The. 1980 (2003 electronic). .Adler, Margot. Drawing Down the Moon: Witches, Druids, Goddess-Worshippers, and Other Pagans in America Today. Boston: Beacon press, 1979; 1986. . Chapter 8: Women, Feminism, and the Craft\"."]}, {"page": "Esbat", "response": ["The term esbat is derived from Old French s'esbattre (Modern French ébat), meaning to frolic and amuse oneself, diversion. It was a borrowing by 20th century anthropologist Margaret Murray's use of French witch trial sources on supposed Witches' Sabbaths in her attempts to \"reconstruct\" a Witch Cult in Western Europe.", "The term esbat in this sense was described by Margaret Murray."]}, {"page": "Gerald Gardner (Wiccan)", "response": ["Born into an upper-middle-class family in Blundellsands, Lancashire, Gardner spent much of his childhood abroad in Madeira. In 1900, he moved to colonial Ceylon, and then in 1911 to Malaya, where he worked as a civil servant, independently developing an interest in the native peoples and writing papers and a book about their magical practices. After his retirement in 1936, he travelled to Cyprus, penning the novel A Goddess Arrives before returning to England.  Settling down near the New Forest, he joined an occult group, the Rosicrucian Order Crotona Fellowship, through which he said he had encountered the New Forest coven into which he was initiated in 1939. Believing the coven to be a survival of the pre-Christian witch-cult discussed in the works of Margaret Murray, he decided to revive the faith, supplementing the coven's rituals with ideas borrowed from Freemasonry, ceremonial magic and the writings of Aleister Crowley to form the Gardnerian tradition of Wicca.", "According to Gardner's later account, one night in September 1939 they took him to a large house owned by \"Old Dorothy\" Clutterbuck, a wealthy local woman, where he was made to strip naked and taken through an initiation ceremony. Halfway through the ceremony, he heard the word \"Wicca (Male)\" and \"Wicce (Female)\", and he recognised it as an Old English word for \"witch\". He was already acquainted with Margaret Murray's theory of the Witch-cult, and that \"I then knew then that which I had thought burnt out hundreds of years ago still survived.\" This group, he claimed, were the New Forest coven, and he believed them to be one of the few surviving covens of the ancient, pre-Christian Witch-Cult religion. Subsequent research by the likes of Hutton and Heselton has shown that in fact the New Forest coven was probably only formed in the mid-1930s, based upon such sources as folk magic and the theories of Margaret Murray.", "In 1954, Gardner published a non-fiction book, Witchcraft Today, containing a preface by Margaret Murray, who had published her theory of a surviving Witch-Cult in her 1921 book, The Witch-Cult in Western Europe. In his book, Gardner not only espoused the survival of the Witch-Cult, but also his theory that a belief in faeries in Europe was due to a secretive pygmy race that lived alongside other communities, and that the Knights Templar had been initiates of the Craft. Alongside this book, Gardner began to increasingly court publicity, going so far as to invite the press to write articles about the religion. Many of these turned out very negatively for the cult; one declared \"Witches Devil-Worship in London!\", and another accused him of whitewashing witchcraft in his luring of people into covens. Gardner continued courting publicity, despite the negative articles that many tabloids were producing, and believed that only through publicity could more people become interested in witchcraft, so preventing the \"Old Religion\", as he called it, from dying out."]}, {"page": "Horned God", "response": ["In traditional and mainstream Wicca, the Horned God is viewed as the divine male principality, being both equal and opposite to the Goddess. The Wiccan god himself can be represented in many forms, including as the Sun God, the Sacrificed God and the Vegetation God, although the Horned God is the most popular representation. The pioneers of the various Wiccan or Witchcraft traditions, such as Gerald Gardner, Doreen Valiente and Robert Cochrane, all claimed that their religion was a continuation of the pagan religion of the Witch-Cult following historians who had purported the Witch-Cult's existence, such as Jules Michelet and Margaret Murray.", "Stewart Farrar, a High Priest of the Alexandrian tradition referred to the Horned God as Karnayna, which he believed was a corruption of the word Cernunnos. The historian Ronald Hutton has suggested that it instead came from the Arabic term Dhul-Qarnayn which meant \"Horned One\". Margaret Murray had mentioned this information in her 1933 book The God of the Witches, and Hutton theorised that Alex Sanders had taken it from there, enjoying the fact that he shared his name with the ancient Macedonian emperor. Prudence Jones has suggested that the name may instead derive from Karneios, a Spartan deity conflated with Apollo as a subordinate consort to Diana.Jones, P. 2005. A Goddess Arrives: Nineteenth Century Sources of the New Age Triple Moon Goddess. Culture and Cosmos, 19(1): 45-70.", "===Margaret Murray===", " and others, Margaret Murray, in her 1921 book The Witch-Cult in Western Europe, proposed the theory that the witches of the early-modern period were remnants of a pagan cult and that the Christian Church had declared the god of the witches was in fact the Devil. Without recourse to any specific representation of this deity, Murray speculates that the head coverings common in inquisition-derived descriptions of the devil \"may throw light on one of the possible origins of the cult.\"", "Margaret Murray's theory of the historical origins of the Horned God has been used by Wiccans to create a myth of historical origins for their religion.  There is no verifiable evidence to support claims that the religion originates earlier than the mid-20th century.", "Modern scholarship has disproved Margaret Murray's theory, however various horned gods and mother goddesses were indeed worshipped in the British Isles during the ancient and early Medieval periods.", "The \"father of Wicca\", Gerald Gardner, who adopted Margaret Murray's thesis, claimed Wicca was a modern survival of an ancient pan-European pagan religion. Gardner states that he had reconstructed elements of the religion from fragments, incorporating elements from Freemasonry, the Occult, and Theosophy, which came together in the Hermetic Order of the Golden Dawn, where Gardner met Aleister Crowley, whose influence became the basis for Wiccan magical practices."]}, {"page": "July 13", "response": ["*1863 – Margaret Murray, British archaeologist, anthropologist, historian, and folklorist (d. 1963)"]}, {"page": "Modern Paganism", "response": ["In the 1920s Margaret Murray theorized that a secret underground religion had survived the witchcraft prosecutions enacted by the ecclesiastical and secular courts. Most historians now reject Murray's theory, as she based it partially upon the similarities of the accounts given by those accused of witchcraft; such similarity is now thought to actually derive from there having been a standard set of questions laid out in the witch-hunting manuals used by interrogators.", "Historian Ronald Hutton identified a wide variety of different sources that influenced Wicca's development, including ceremonial magic, folk magic, Romanticist literature, Freemasonry, and the historical theories of English archaeologist Margaret Murray. English esotericist Gerald Gardner was at the forefront of the burgeoning Wiccan movement. He claimed to have been initiated by the New Forest coven in 1939, and that the religion that he discovered was a modern remnant of the old Witch-Cult described in Murray's works, which originated in the pre-Christian paganism of Europe. Various forms of Wicca have since evolved or been adapted from Gardner's British Traditional Wicca or Gardnerian Wicca, such as Alexandrian Wicca. Other forms loosely based on Gardner's teachings are Faery Wicca, Kemetic Wicca, Judeo-Paganism or jewitchery, and Dianic Wicca or feminist Wicca, which emphasizes the divine feminine, often creating women-only or lesbian-only groups.Telesco (2005) p.114 In the academic community Wicca has also been interpreted as having close affinities with process philosophy."]}, {"page": "November 13", "response": ["*1963 – Margaret Murray, Indian-English anthropologist and author (b. 1863)"]}, {"page": "Robin Hood", "response": ["Robin Hood has also been claimed for the pagan witch-cult supposed by Margaret Murray to have existed in medieval Europe, and his anti-clericalism and Marianism interpreted in this light.Robert Graves English and Scottish Ballads. London: William Heinemann, 1957; New York: Macmillan, 1957. See, in particular, Graves' notes to his reconstruction of Robin Hood's Death. The existence of the witch cult as proposed by Murray is now generally discredited."]}, {"page": "Wicca", "response": ["Most early Wiccan groups adhered to the duotheistic worship of a Horned God of fertility and a Mother Goddess, with practitioners typically believing that these had been the ancient deities worshipped by the hunter-gatherers of the Old Stone Age, whose veneration had been passed down in secret right to the present. This theology derived from Egyptologist Margaret Murray's claims about the witch-cult in her book The Witch-Cult in Western Europe published by Oxford University Press in 1921; she claimed that whereas the cult as recorded in the Early Modern witch trials had venerated a Horned God, centuries before it had also worshipped a Mother Goddess. This duotheistic Horned God/Mother Goddess structure was embraced by Gardner – who claimed that it had Stone Age roots – and remains the underlying theological basis to his Gardnerian tradition. Gardner claimed that the names of these deities were to be kept secret within the tradition, although in 1964 they were publicly revealed to be Cernunnos and Aradia; the secret Gardnerian deity names were subsequently changed.", "Wiccans celebrate several seasonal festivals of the year, commonly known as Sabbats. Collectively, these occasions are termed the Wheel of the Year. Most Wiccans celebrate a set of eight of these Sabbats; however, other groups such as those associated with the Clan of Tubal Cain only follow four. In the rare case of the Ros an Bucca group from Cornwall, only six are adhered to. The four Sabbats that are common to all British derived groups are the cross-quarter days, sometimes referred to as Greater Sabbats. The names of these festivals are in some cases taken from the Old Irish fire festivals and the Welsh God Mabon, though in most traditional Wiccan covens the only commonality with the Celtic festival is the name. Gardner himself made use of the English names of these holidays, stating that \"the four great Sabbats are Candlemass, May Eve, Lammas, and Halloween; the equinoxes and solstices are celebrated also.\" In the Egyptologist Margaret Murray's The Witch-Cult in Western Europe (1921) and The God of the Witches (1933), in which she dealt with what she believed had been a historical Witch-Cult, she stated that the four main festivals had survived Christianisation and had been celebrated in the pagan Witchcraft religion. Subsequently, when Wicca was first developing in the 1930s through to the 1960s, many of the early groups, such as Robert Cochrane's Clan of Tubal Cain and Gerald Gardner's Bricket Wood coven adopted the commemoration of these four Sabbats as described by Murray.", "Wicca took as its basis the witch-cult hypothesis. This was the idea that those persecuted as witches during the early modern period in Europe were not, as the persecutors had claimed, followers of Satanism, nor were they innocent people who confessed to witchcraft under threat of torture, as had long been the historical consensus, but rather that they were adherents of a surviving pre-Christian pagan religion. This theory had been first expressed by the German Professor Karl Ernest Jarcke in 1828, before being endorsed by German Franz Josef Mone and then the French historian Jules Michelet. In the late 19th century it was then adopted by two Americans, Matilda Joslyn Gage and Charles Leland, the latter of whom promoted a variant of it in his 1899 book, Aradia, or the Gospel of the Witches. The theory's most prominent advocate was the English Egyptologist Margaret Murray, who promoted it in a series of books – most notably 1921's The Witch-Cult in Western Europe and 1933's The God of the Witches. Almost all of Murray's peers regarded the witch-cult theory as incorrect and based on poor scholarship. However, Murray was invited to write the entry on \"witchcraft\" for the 1929 edition of the Encyclopædia Britannica, which was reprinted for decades and became so influential that, according to folklorist Jacqueline Simpson, Murray's ideas became \"so entrenched in popular culture that they will probably never be uprooted.\"Jacqueline Simpson (1994). Margaret Murray: Who Believed Her, and Why? Folklore, 105:1-2: 89-96.  Simpson noted that the only contemporary member of the Folklore Society who took Murray's theory seriously was Gerald Gardner, who used it as the basis for Wicca. Murray's books were the sources of many well-known motifs which have often been incorporated into Wicca. The idea that covens should have 13 members was developed by Murray, based on a single witness statement from one of the witch trials, as was her assertion that covens met on the cross-quarter days four times per year. Murray was very interested in ascribing naturalistic or religious ceremonial explanations to some of the more fantastic descriptions found in witch trial testimony. For example, many of the confessions included the idea that Satan was personally present at coven meetings. Murray interpreted this as a witch priest wearing horns and animal skins, and a pair of forked boots to represent his authority or rank; most mainstream folklorists, on the other hand, have argued that the entire scenario was always fictitious and does not require a naturalistic explanation, but Gardner enthusiastically adopted many of Murray's explanations into his own tradition. The witch-cult theory represented \"the historical narrative around which Wicca built itself\", with the early Wiccans claiming to be the survivors of this ancient pagan religion."]}, {"page": "Wheel of the Year", "response": ["The contemporary Neopagan festival cycle, prior to being known as the Wheel of the Year, was influenced by works such as The Golden Bough by James George Frazer (1890) and The Witch-Cult in Western Europe (1921) by Margaret Murray. Frazer claimed that Beltane (the beginning of summer) and Samhain (the beginning of winter) were the most important of the four Gaelic festivals mentioned by Cormac. Murray used records from early modern witch trials, as well as the folklore surrounding European witchcraft, in an attempt to identify the festivals celebrated by a supposedly widespread underground pagan religion that had survived into the early modern period. Murray reports a 1661 trial record from Forfar, Scotland, where the accused witch (Issobell Smyth) is connected with meetings held \"every quarter at Candlemas, Rud−day, Lambemas, and Hallomas.\"Kinloch, George Ritchie. Reliquiae Antiquae Scoticae. Edinburgh, 1848. In The White Goddess (1948) Robert Graves claimed that, despite Christianization, the importance of agricultural and social cycles had preserved the \"continuity of the ancient British festal system\" consisting of eight holidays: \"English social life was based on agriculture, grazing, and hunting\" implicit in \"the popular celebration of the festivals now known as Candlemas, Lady Day, May Day, Midsummer Day, Lammas, Michaelmas, All-Hallowe'en, and Christmas; it was also secretly preserved as religious doctrine in the covens of the anti-Christian witch-cult.\"Robert Graves, The White Goddess, New York: Creative Age Press, 1948. Published in London by Faber & Faber."]}, {"page": "Witchcraft", "response": ["During the 20th century, interest in witchcraft in English-speaking and European countries began to increase, inspired particularly by Margaret Murray's theory of a pan-European witch-cult originally published in 1921, since discredited by further careful historical research.Rose, Elliot, A Razor for a Goat, University of Toronto Press, 1962. Hutton, Ronald, The Pagan Religions of the Ancient British Isles, Cambridge, Mass.: Blackwell Publishers, 1993. Hutton, Ronald, The Triumph of the Moon: A History of Modern Pagan Witchcraft, Oxford University Press, 1999. Interest was intensified, however, by Gerald Gardner's claim in 1954 in Witchcraft Today that a form of witchcraft still existed in England. The truth of Gardner's claim is now disputed too.Kelly, Aidan, Crafting the Art of Magic, Llewellyn Publications, 1991.Hutton, Ronald, Triumph of the Moon, Oxford University Press, 1999.", "The Wicca that Gardner initially taught was a witchcraft religion having a lot in common with Margaret Murray's hypothetically posited cult of the 1920s.Murray, Margaret A., The Witch-Cult in Western Europe, Oxford University Press, 1921. Indeed, Murray wrote an introduction to Gardner's Witchcraft Today, in effect putting her stamp of approval on it. Wicca is now practised as a religion of an initiatory secret society nature with positive ethical principles, organised into autonomous covens and led by a High Priesthood. There is also a large \"Eclectic Wiccan\" movement of individuals and groups who share key Wiccan beliefs but have no initiatory connection or affiliation with traditional Wicca. Wiccan writings and ritual show borrowings from a number of sources including 19th and 20th-century ceremonial magic, the medieval grimoire known as the Key of Solomon, Aleister Crowley's Ordo Templi Orientis and pre-Christian religions.Hutton, R.,The Triumph of the Moon: A History of Modern Pagan Witchcraft, Oxford University Press, pp. 205–252, 1999.Kelly, A.A., Crafting the Art of Magic, Book I: a History of Modern Witchcraft, 1939–1964, Minnesota: Llewellyn Publications, 1991.Valiente, D., The Rebirth of Witchcraft, London: Robert Hale, pp. 35–62, 1989. Right now there are just over 200,000 people who practice Wicca in the United States.", "Organized groups began to emerge in the mid 20th century, including the Ophite Cultus Satanas (1948) and The Church of Satan (1966). After seeing Margaret Murray's book The God of the Witches, the leader of Ophite Cultus Satanas, Herbert Arthur Sloane, said he realized that the horned god was Satan (Sathanas). Sloane also corresponded with his contemporary Gerald Gardner, founder of the Wiccan religion, and implied that his views of Satan and the horned god were not necessarily in conflict with Gardner's approach. However, he did believe that, while gnosis referred to knowledge, and Wicca referred to wisdom, modern witches had fallen away from the true knowledge, and instead had begun worshipping a fertility god, a reflection of the creator god. He wrote that \"the largest existing body of witches who are true Satanists would be the Yezedees\". Sloane highly recommended the book The Gnostic Religion, and sections of it were sometimes read at ceremonies.Black Magic, Satanism, Voodoo, by Dr. Leo L. Martello, 1972 (Interview with Sloane on pp. 31–34, Our Lord Sathanas)  The Church of Satan, founded by Anton LaVey in 1966, views Satan not as a literal god, but merely a symbol. Still, this organization does believe in magic and incorporates it in their practice, distinguishing between Lesser and Greater forms.", "Much of what witchcraft represents in Africa has been susceptible to misunderstandings and confusion, thanks in no small part to a tendency among western scholars since the time of the now largely discredited Margaret Murray to approach the subject through a comparative lens vis-a-vis European witchcraft."]}, {"page": "Coven", "response": ["\"Coven\" () usually refers to a group or gathering of witches. The word \"coven\" (from Anglo-Norman covent, cuvent, from Old French covent, from Latin conventum = convention) remained largely unused in English until 1921 when Margaret Murray promoted the idea that all witches across Europe met in groups of thirteen which they called \"covens\".Murray, Margaret (1921). The Witch Cult in Western Europe: A Study in Anthropology."]}, {"page": "Robert Graves", "response": ["* Margaret Murray"]}, {"page": "Pan (god)", "response": ["In 1933, the Egyptologist Margaret Murray published the book, The God of the Witches, in which she theorised that Pan was merely one form of a horned god who was worshipped across Europe by a witch-cult. This theory influenced the Neopagan notion of the Horned God, as an archetype of male virility and sexuality. In Wicca, the archetype of the Horned God is highly important, as represented by such deities as the Celtic Cernunnos, Hindu Pashupati, and Greek Pan."]}, {"page": "Human sacrifice", "response": ["* Margaret Murray – The Divine King in England"]}, {"page": "Matriarchy", "response": ["Austrian writer Bertha Diener, also known as Helen Diner, wrote Mothers and Amazons (1930), which was the first work to focus on women's cultural history. Hers is regarded as a classic of feminist matriarchal study.Elizabeth A. Sackler Center for Feminist Art: The Dinner Party: Heritage Floor: Helen Diner (Brooklyn, N.Y.: Brooklyn Museum, last updated March 27, 2007), as accessed March, 2008, & November 15, 2013. Her view is that in the past all human societies were matriarchal; then, at some point, most shifted to patriarchal and degenerated. The controversy was reinforced further by the publication of The White Goddess by Robert Graves (1948) and his later analysis of classical Greek mythology and the vestiges of earlier myths that had been rewritten after a profound change in the religion of Greek civilization that occurred within its very early historical times. From the 1950s, Marija Gimbutas developed a theory of an Old European culture in Neolithic Europe which had matriarchal traits, replaced by the patriarchal system of the Proto-Indo-Europeans with the spread of Indo-European languages beginning in the Bronze Age. According to Epstein, anthropologists in the 20th century said that \"the goddess worship or matrilocality that evidently existed in many paleolithic societies was not necessarily associated with matriarchy in the sense of women's power over men. Many societies can be found that exhibit those qualities along with female subordination.\" From the 1970s, these ideas were taken up by popular writers of second-wave feminism and expanded with the speculations of Margaret Murray on witchcraft, by the Goddess movement, and in feminist Wicca, as well as in works by Eisler, Elizabeth Gould Davis, and Merlin Stone."]}, {"page": "When God Was a Woman", "response": ["The book is now seen as having been instrumental in the modern rise of feminist theology in the 1970s to 1980s, along with authors such as Elizabeth Gould Davis, Riane Eisler and Marija Gimbutas.  Some have related it as well to the work of authors  Margaret Murray and Robert Graves."]}, {"page": "Janus", "response": ["In her 1921 book The Witch-Cult in Western Europe, folklorist Margaret Murray claimed that evidence found in records of the early modern witch trials showed the witches' god, usually identified in the records as the Devil, was in fact often a male priest dressed in a double mask representing Janus. Murray traced the presence of a man dressed with a mask on the back of his head at some witch meetings to confessions of accused witches in the Pyrenees region, and one statement in particular that the leader of the witches appeared \"comme le dieu Janus\" (\"as the god Janus\"). Via the etymology given by James Frazier, Murray further connected the figure on Janus or Dianus in the witch-cult with the more well known goddess of witchcraft, Diana.Murray, Margaret. 1921. The Witch-Cult in Western Europe Both Murray's contemporaries and modern scholars have argued that Murray's hypothesis and the connections she drew between Janus and Diana, and linking the early modern witch trials with ancient pagan beliefs, are dubious."]}, {"page": "List of archaeologists", "response": ["*Margaret Murray (1863–1963) Anglo-Indian; Egyptologist"]}, {"page": "Pseudohistory", "response": ["In her books, starting with The Witch-Cult in Western Europe (1921), English author Margaret Murray claimed that the witch trials in the early modern period were actually an attempt by chauvinistic Christians to annihilate a secret, pagan religion, which she claimed worshipped a Horned God. Murray's claims have now been widely rejected by respected historians. Nonetheless, her ideas have become the foundation myth for modern Wicca, a contemporary Neopagan religion. Belief in Murray's alleged witch-cult is still prevalent among Wiccans, but is gradually declining."]}, {"page": "Baphomet", "response": ["Lévi believed that the alleged devil worship of the medieval Witches' Sabbath was a perpetuation of ancient pagan rites. A goat with a candle between its horns appears in medieval witchcraft records,In Margaret Murray's survey of The Witch-Cult in Western Europe, the devil was said to appear as \"a great Black Goat with a Candle between his Horns\". Murray, p. 145. For the devil as a goat, see pp. 63, 65, 68–69, 70, 144–146, 159, 160, 180, 182, 183, 233, 247, 248. and other pieces of lore are cited in ."]}, {"page": "1963 in literature", "response": ["*Margaret Murray – My First Hundred Years (autobiography)", "*November 13 – Margaret Murray, Indian-born English archeologist and historian (born 1863)"]}, {"page": "Ash (deity)", "response": ["Some depictions of Ash show him as having multiple heads, unlike other Egyptian deities, although some compound depictions were occasionally shown connecting gods to Min. In an article in the journal Ancient Egypt (in 1923), and again in an appendix to her book, The Splendor that was Egypt, Margaret Murray expands on such depictions, and draws a parallel to a Scythian deity, who is referenced in Sebastian Münster's Cosmographia universalis."]}, {"page": "1863 in literature", "response": ["*July 13 – Margaret Murray, Indian-born English archeologist and historian (died 1963)"]}, {"page": "Isobel Gowdie", "response": ["The four confessions she made over a period of six weeks include details of charms and rhymes, claims she was a member of a coven in the service of the Devil and that she met with the fairy queen and king. Lurid information concerning carnal dealings with the Devil were also provided. A combination of demonic and fairy beliefs, the narratives were used by Margaret Murray as the basis for her now mostly discredited theories about cults and witchcraft.", "Gowdie's confessions formed the crux of historian Margaret Murray's thesis about covens consisting of thirteen members; Murray also asserted cults were structured this way throughout Europe although her work was later discredited. Wilby opines there may have been dark shamanic aspects contained in the fairy elements. Despite the Privy Council's April 1662 proclamation, torture was often still employed and Levack speculates some form of it may have been applied to Gowdie; she may have become unbalanced by the imprisonment and lengthy inquisitions. While kept in solitary confinement, she was probably prevented from sleeping and mistreated. Scholars, such as Callow and Diane Purkiss, suggest Gowdie's narratives about sumptuous meals are indicative of a woman who was continually hungry; other details may be evidence of a powerless woman, angry and sexually frustrated by the austerity imposed by the ministers. Church and court records show rape as a recurrent crime during civil unrest and in the mid-16th century; Gowdie described her first carnal experience with the Devil as being in 1647 when soldiers may still have been in the area and Wilby postulates the lurid sexual details may be Gowdie's \"fantasy-response to the trauma of rape.\""]}, {"page": "Margaret Alice Murray", "response": ["#REDIRECT Margaret Murray"]}, {"page": "Familiar", "response": ["Margaret Murray delves into variations of the familiar found in witchcraft practices. Many of the sources she employs are trial records and demonological texts from early to modern England. These include the 1556 Essex Witchcraft Trials of the Witches of Hatfield Perevil, the 1582 Trial of the Witches of St. Osyth, and the 1645 Essex Trials with Matthew Hopkins acting as a witch-finder. In 1921, Murray published The Witch Cult in Western Europe. Her information concerning familiars comes from witchcraft trials in Essex in the 16th and 17th centuries. Within this book Murray dedicates an entire chapter to the familiar spirit. Her detailed contribution to the topic included several court cases and accounts from Europe in which she finds mention of familiars."]}, {"page": "Sacred king", "response": ["Robert Graves used Frazer's work in The Greek Myths and made it one of the foundations of his own personal mythology in The White Goddess, and in the fictional Seven Days in New Crete he depicted a future in which the institution of a sacrificial sacred king is revived. Margaret Murray, the principal theorist of witchcraft as a \"pagan survival,\" used Frazer's work to propose the thesis that many kings of England who died as kings, most notably William Rufus, were secret pagans and witches, whose deaths were the re-enactment of the human sacrifice that stood at the centre of Frazer's myth. This idea used by fantasy writer Katherine Kurtz in her novel Lammas Night."]}, {"page": "Pseudoarchaeology", "response": ["Academic archaeologist Cornelius Holtorf believed however that critics of alternative archaeologies like Fagan were \"opinionated and patronizing\" towards alternative theories, and that purporting their views in such a manner was damaging to the public's perception of archaeologists.Holtorf 2005. p. 545. Holtorf highlighted that there were similarities between academic and alternative archaeological interpretations, with the former taking some influence from the latter. As evidence, he highlighted archaeoastronomy, which was once seen as a core component of fringe archaeological interpretations before being adopted by mainstream academics.Holtorf 2005. p. 547. He also noted that certain archaeological scholars, like William Stukeley (1687–1765), Margaret Murray (1863–1963) and Marija Gimbutas (1921–1994) were seen as significant figures to both academic and alternative archaeologists. He came to the conclusion that a constructive dialogue should be opened up between academic and alternative archaeologists.Holtorf 2005. p. 550. Fagan and Feder have responded to Holtorf's views in detail, asserting that such a dialogue is no more possible than is one between evolutionary biologists and creationists or between astronomers and astrologers: one approach is scientific, the other is anti-scientific.[Fagan and Feder 2006]"]}, {"page": "Herne the Hunter", "response": ["In his 1929 book The History of the Devil – The Horned God of the West R. Lowe Thompson suggests that \"Herne\" as well as other Wild Huntsmen in European folklore all derive from the same ancient source, citing that \"Herne\" may be a cognate of the name of Gaulish deity Cernunnos in the same way that the English \"horn\" is a cognate of the Latin \"cornu\" (see Grimm's Law for more details on this linguistic feature) explaining that \"As the Latin cornu changes into horn so might Cerne change into Herne.\" He adds, \"In any case the reader may also be prepared to recognize Cernunnos and the older magician, who emerge as the Wild Huntsman. My assumption is that these two forms have been derived from the same Palæolithic ancestor and can, indeed, be regarded as two aspects of one central figure, will help us to understand the identification of Herlechin and Herne, whom I will take as the most familiar example of the huntsman.\"The History of the Devil by R. Lowe Thompson, 1920, page 133 Margaret Murray also identified Cernunnous with Herne in her 1933 book The God of the Witches. Callow, Embracing the Darkness: A Cultural History of Witchcraft. Bloomsbury Publishing, 2017.  (pg. 212, 246)  Some modern Neopagans such as Wiccans accept Lowe Thompson's equation of Herne with Cernunnos (which they further connect to the Greco-Roman god Pan).'Simple Wicca: A simple wisdom book' by Michele Morgan, Conari, 2000, ,  Herne however is a localised figure, not found outside Berkshire and the regions of the surrounding counties into which Windsor Forest once spread, and clear evidence for the worship of Cernunnos has been recovered only on the European mainland, and not in Britain.Ronald Hutton, The Pagan Religions of the Ancient British Isles: Their Nature and Legacy,  People of the Mist (ch. 5) \"Herne\" could be derived ultimately from the same Indo-European root *ker-n-, meaning bone or horn, from which \"Cernunnos\" derives. However, a more direct source may be the Old English hyrne, meaning \"horn\" or \"corner\",Shipley, Joseph Twadell. 'Dictionary of Early English'. Philosophical Library, 1955. Page 330.Bosworth, Joseph. A Dictionary of the Anglo-Saxon Language, Containing the Accentuation—the Grammatical Inflections—the Irregular Words Referred to Their Themes—the Parallel Terms, from the Other Gothic Languages—the Meaning of the Anglo-Saxon in English and Latin—and Copious English and Latin Indexes ... Longman, Rees, Orme, Brown, Green, and Longman, 1838. Page 189. which is inconsistent with the Cernunnos theory.Petry, Michael John (1972). Herne the Hunter: A Berkshire Legend. William Smith (Booksellers) Ltd. ."]}, {"page": "Triple Goddess (Neopaganism)", "response": ["Ronald Hutton argues that the concept of the triple moon goddess as Maiden, Mother, and Crone, each facet corresponding to a phase of the moon, is a modern creation of Graves',The Myth and Ritual School: J.G. Frazer and the Cambridge Ritualists. Routledge. , .Hutton, Ronald (1997). \"The Neolithic Great Goddess: A Study in Modern Tradition\" from Antiquity, March 1997. who in turn drew on the work of 19th and 20th century scholars such as especially Jane Harrison; and also Margaret Murray, James Frazer,  the other members of the \"myth and ritual\" school or Cambridge Ritualists, and the occultist and writer Aleister Crowley.Triumph of the Moon, p. 41."]}, {"page": "Sheela na gig", "response": ["A popular hypothesis is that sheela na gigs represent a pagan goddess, but academics believe the situation was more complex, with multiple interpretations and roles for the female character as spiritual traditions changed over time. The goddess in question usually is identified as Celtic, the hag-like Cailleach figure of Irish and Scottish mythology. Margaret Murray proposed this, as did Anne Ross, who wrote in her essay \"The Divine Hag of the Pagan Celts\", \"I would like to suggest that in their earliest iconographic form they do in fact portray the territorial or war-goddess in her hag-like aspect\". Georgia Rhoades suggests that the figures may represent the crone or an earth goddess from Celtic mythology.", "This hypothesis usually is combined with the \"goddess\" explanation for the figures discussed above. Barbara Freitag suggests that the figures were used in a fertility context and associates them with \"birthing stones\". There is folkloric evidence of at least some of the sheela na gigs being used in this manner, with the figures being loaned out to women in labour. Other figures have wedding traditions associated with them. According to Margaret Murray, the figure in Oxford at the church of St Michael at the North Gate has an associated tradition of being shown to brides on their wedding day. This theory does not seem to apply to all the figures: some are thin with their ribs showing and thin breasts, which do not suggest fertility. Others are plump and are shown in a sexual context with a partner (as at Whittlesford). Theresa Oakley and Alex Woodcock recently discovered an exhibitionist couple at Devizes, who seem to represent fertility. The faces of some figures are striated, indicating scarring or tattoos. Weir notes that a close examination of the figures reveals features that are not consistent with a fertility function."]}, {"page": "Witch's mark", "response": ["As far as the historical study of the witch's mark goes, historians are split into different camps. The first camp, sometimes called \"Murray-ists\", supports British anthropologist Margaret Murray's theory of the witch's mark. Historical discussion of the witch's mark began after the publication of Murray's books on the subject; Witchcult in Western Europe and The God of the Witches in the early 20th century. Her writings argue strongly that Devil's marks were in actuality tattoos that identified members of an organized pagan religion that she believed flourished in the Middle Ages.The Witch-Cult in Western Europe – A Study in Anthropology By Margaret Alice Murray. OXFORD 1921 After the publication of her work, the historical community became divided between Murrayist and non-Murrayist scholars; \"When the Witchcult in Western Europe appeared in 1921, it broke this deadlock; yes, said Murray, witches had indeed been up to something of which society disapproved, but it was in no way supernatural; they were merely members of an underground movement secretly keeping pagan rituals alive in Christian Europe.\"Jaqueline Simpson, \"Margaret Murray: Who Believed her and Why\" Folklore 105 (1994):89–96. Murray's work became widely accepted and she was considered an expert in witchcraft studies after its publication. Murray is also credited with the renewed interest in neo-pagan religions, and later, Wicca, which occurred after the publications of her books. However, today her controversial ideas have been largely rejected by scientists and academics due to the lack of any evidence."]}, {"page": "Johann Jakob Bachofen", "response": ["* Margaret Murray"]}, {"page": "1963 in science", "response": ["* November 13 – Margaret Murray (born 1863), Indian-English anthropologist and author."]}, {"page": "Cunning folk in Britain", "response": ["A 1932 article by Lewis Spence in The Weekly Scotsman, responding to the popularization of Margaret Murray's Witch-cult hypothesis, stated that 'the Saxon word \"wicca\", a witch, as well as the term \"carline\" were of immemorial usage' in lowland Scotland while in the highlands, where English words were less known, 'wise women' or \"Nicnevins\" (\"daughters of heaven\") were used. Spence argued that a native tradition had 'flourished' in Scotland, and elsewhere in Britain, and, while it maintained many differences, had been greatly influenced by French practices from the mid-fifteenth century and this saw the introduction of the word 'witch'. While still associating folk tradition with 'witchcraft' he suggested it was 'a widespread cult of pagan origin, having a well-digested system of medical and magical lore of its own, a distant ritual, and with affiliations throughout the whole of the Lowlands and a certain part of the Highlands'."]}, {"page": "Ronald Hutton", "response": ["The response from the Neopagan community was somewhat mixed. Many Pagans embraced his work, with the prominent Wiccan Elder Frederic Lamond referring to it as \"an authority on the history of Gardnerian Wicca\".Lamond 2004. p. 64-65. Public criticism came from the practising Wiccan Jani Farrell-Roberts, who took part in a published debate with Hutton in The Cauldron magazine in 2003. Farrell-Roberts was of the opinion that in his works, Hutton dismissed Margaret Murray's theories about the Witch-Cult using Norman Cohn's theories, which she believed to be heavily flawed. She stated that \"he is... wrongly cited as an objective neutral and a 'non-pagan' for he happens to be a very active member of the British Pagan community\" who \"had taken on a mission to reform modern paganism by removing from it a false history and sense of continuance\".Farrell-Roberts, Jani. (May 2003). The Cauldron", "Interviewing Hutton for The Independent, the journalist Gary Lachman commented that he had \"a very pragmatic, creative attitude, recognising that factual error can still produce beneficial results\", for instance noting that even though their theories about the Early Modern Witch-Cult were erroneous, Margaret Murray and Gerald Gardner would help lay the foundations for the creation of the new religious movement of Wicca."]}, {"page": "Doreen Valiente", "response": ["She had also become familiar with the idea of a pre-Christian witch-cult surviving into the modern period through the works of Charles Godfrey Leland, Margaret Murray, and Robert Graves, although believed that the religion was extinct. It was in autumn 1952 that she read an article by the reporter Allen Andrews in Illustrated magazine titled \"Witchcraft in Britain\". Discussing the recent opening of the Folklore Centre of Superstition and Witchcraft in Castletown on the Isle of Man, it mentioned the museum's director, Cecil Williamson, and its \"resident witch\", Gerald Gardner.", "Valiente began visiting local libraries and archives in order to investigate the history of witchcraft in Sussex. On the basis of this research, the esoteric press Aquarian published her first book, Where Witchcraft Lives, in 1962. Just as Gardner had done in his book Witchcraft Today, here Valiente did not identify as a practising Wiccan, but as an interested scholar of witchcraft. It contained her own research into the history and folklore of witchcraft in her county of Sussex, which she had collected both from archival research and from the published work of the historian L'Estrange Ewen. It interpreted this evidence in light of the discredited theories of Margaret Murray, which claimed that a pre-Christian religious movement had survived to the present, when it had emerged as Wicca. Hutton later related that it was \"one of the first three books to be published on the subject\" of Wicca, and that the \"remarkable feature of the book is that it remains, until this date [2010], the only one produced by a prominent modern witch that embodies actual original research into the records of the trials of people accused of the crime of witchcraft during the early modern period.\" In 1966, Valiente then produced a manuscript for a book titled I am a Witch!, a collection of poems with a biographical introduction; however, it was never published, publishers not believing that it would be commercially viable."]}, {"page": "Goddess movement", "response": ["The existence of witchcraft as the remnants of an old pagan religion as late as the early Modern Age was first suggested to a wide readership by Margaret Murray's books, The Witch Cult in Western Europe, The God of the Witches (1933) and The Divine King in England. Her works have since been largely discredited by other scholars but have left a feminist legacy upon Wiccan culture."]}, {"page": "Faerie faith", "response": ["The history of the Faerie Faith begins with \"the Dallas Dianics,\" founded by Mark Roberts and Morgan McFarland in the Dallas/Ft. Worth area of Texas (in 1999, the name of the tradition was changed to the McFarland Dianic Tradition).  McFarland, Roberts, and a third member together formed the Covenstead of Morrigana. According to the McFarland Dianic Homepage, \"It was Mark who pointed out to Morgan the reference to \"Dianic cults\" in Margaret Murray's The Witch Cult in Western Europe. It spoke to their beliefs and practices, and they adopted the name \"Dianic\" for their tradition. Later that year, Mark and Morgan began creating rituals based on the Ogham. McFarland went on to initiate several high priestesses who hived off to start other covens. In 1979 she withdrew as high priestess, and now serves as matriarch and advisor to the Council of High Priestesses of the McFarland Dianic Tradition."]}]}}