{"wiki_id": "http://www.wikidata.org/entity/Q24260343", "itemLabel": "Ambrose Goddard", "itemDescription": "British Member of Parliament (died 1815)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ambrose_Goddard", "wikipedia_page": {"main": "Ambrose Goddard (c. 1727–1815) was a British politician who sat in the House of Commons from 1772 to 1806.\nGoddard was the third son of Ambrose Goddard and his wife Elizabeth Awdry, daughter of Ambrose Awdry of Seend, Wiltshire. He was educated at Winchester College from 1743 to 1745. He settled in Lisbon where he was in merchant activities and was agent for the Post Office there until 1772. On death of his elder brother in 1770, he succeeded to the family inheritance and returned to Wiltshire. He married Sarah Williams, daughter of Rev. Thomas Williams of Pilrowth, Carmarthenshire on 16 August 1776.Goddard was returned as Member of Parliament for Wiltshire at a by-election on 21 August 1772 after a hard-fought and expensive contest. He was returned unopposed in 1774 and 1780. In 1784 he was a member of the St. Alban's Tavern group who tried to bring Fox and Pitt together. He held the seat until 1806.\nGoddard died on 19 June 1815. He and his wife Sarah had three sons and seven daughters; from 1788 they employed Agnes Porter as governess.  His son Thomas Goddard became MP for Cricklade.\n\n", "link_mentions": [{"page": "Wiltshire (UK Parliament constituency)", "response": ["|rowspan=\"3\"| Ambrose Goddard"]}, {"page": "St. Alban's Tavern group", "response": ["|   Ambrose Goddard. "]}, {"page": "History of Swindon", "response": ["The canal enabled Swindon businesses and farmers to transport goods over a wider area and brought new residents from outside the county, among them navvies who settled after completion of the canal work. Ambrose Goddard, Lord of the Manor of Swindon at the time, was a shareholder in the canal company, and authorised a number of its land purchases along its eventual route, land which he himself owned."]}, {"page": "Goddard family", "response": ["*1745–1754 Ambrose Goddard (cousin of Pleydell Goddard)", "*1757–1770 Thomas Goddard (eldest son of Ambrose Goddard)", "*1770–1815 Ambrose Goddard (youngest son of Ambrose Goddard); MP for Wiltshire 1772–1806; Director of the Wilts and Berks Canal, donated site for Christ Church", "*Ambrose Goddard (1779–1854), 1837–41."]}, {"page": "Cricklade (UK Parliament constituency)", "response": ["| Ambrose Goddard", "|rowspan=\"3\"| Ambrose Goddard", "| Ambrose Goddard"]}, {"page": "Goddard (surname)", "response": ["* Ambrose Goddard (c. 1727–1815), MP for Wiltshire", "*Ambrose Goddard (born 1819) (1819–1898), MP for Cricklade"]}, {"page": "List of MPs elected in the 1796 British general election", "response": ["|Ambrose Goddard"]}, {"page": "Sir Thomas Lethbridge, 2nd Baronet", "response": ["**Jacinta (\"Jessy\") Dorothea Lethbridge, who in 1818 married Ambrose Goddard (1779–1854), MP, of Swindon in Wiltshire, and was the mother of Ambrose Lethbridge Goddard, and of Emma Caroline Goddard who married Greville Phillimore.", "*Secondly, in 1803, he married Anne Goddard, a daughter Ambrose Goddard, of Swindon in Wiltshire, by whom he had two sons and four daughters:", "**Ambrose Goddard Lethbridge (died 1875), a barrister and Fellow of All Souls College, Oxford."]}, {"page": "Agnes Porter", "response": ["In 1788 Porter moved from Great Yarmouth to be a governess to the daughters of Ambrose Goddard M.P. The Goddard family lived at Swindon House in Wiltshire."]}, {"page": "List of MPs elected in the 1774 British general election", "response": ["| Ambrose Goddard"]}, {"page": "List of MPs elected in the 1780 British general election", "response": ["| Ambrose Goddard"]}, {"page": "List of MPs elected in the 1784 British general election", "response": ["| Ambrose Goddard"]}, {"page": "List of MPs in the first United Kingdom Parliament", "response": ["| Ambrose Goddard"]}, {"page": "List of MPs elected in the 1802 United Kingdom general election", "response": ["| Ambrose Goddard"]}, {"page": "List of MPs elected in the 1790 British general election", "response": ["| Ambrose Goddard"]}, {"page": "Thomas Goddard (MP)", "response": ["He was a member of the Goddard family associated with Wiltshire, Hampshire and Berkshire and the son of Ambrose Goddard."]}, {"page": "Old Town Hall, Swindon", "response": ["Until the construction of the town hall on the High Street, the town council had met in the Goddard Arms on the High Street. This small pub had been owned by the Goddard family since 1621 and was a small cottage alehouse known as the Crown until 1820. The Goddard Arms was used for public meetings in the early 19th century and was used in this way by Ambrose Goddard to report progress on the Wilts & Berks Canal."]}]}}