{"wiki_id": "http://www.wikidata.org/entity/Q24254979", "itemLabel": "Arthur Cole", "itemDescription": "British Member of Parliament (1780-1844)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Henry_Cole", "wikipedia_page": {"main": "Hon. Arthur Henry Cole (28 June 1780 – 16 June 1844) was an Anglo-Irish politician and civil servant who sat in the British House of Commons for Enniskillen from 1828 to 1844.Cole was the fourth son of William Cole, 1st Earl of Enniskillen (died 1803), and Anne, daughter of Galbraith Lowry-Corry, Irish MP for Tyrone and sister of Armar Lowry-Corry, 1st Earl Belmore. He was the younger brother of John Cole, 2nd Earl of Enniskillen, Sir Galbraith Lowry Cole, and Right Rev. William Cole. He was educated at Trinity College Dublin.Cole arrived in British India in 1802 as part of the East India Company, and was described by Lord Cornwallis as \"a very fine lad, and modest, and well behaved.\" He was appointed the British Resident in Mysore in 1812, serving for about 15 years before returning home to start his political career. Cole's Park and Cole's Road in Fraser Town, Bangalore are named after him. He was also influential in the construction of an Anglican church, St. Bartholomew's Church, in Mysore.He was elected as Member of Parliament for the Conservative Party in an 1828 by-election, following the resignation of his brother-in-law Richard Magenis. He resigned from Parliament on 4 June 1844 because of ill health, and died 12 days later at his residence in Manchester Square, Marylebone, just shy of his 64th birthday. He was succeeded by his nephew Henry Arthur Cole.", "link_mentions": [{"page": "Enniskillen (UK Parliament constituency)", "response": ["| Hon. Arthur Cole Hamilton"]}, {"page": "Henry Cole (Conservative politician)", "response": ["Hon. Henry Arthur Cole (14 February 1809 – 2 July 1890) was an Anglo-Irish politician, cricketer and army officer."]}, {"page": "Arthur Cole", "response": ["Arthur Cole may refer to:", "* Arthur Cole (priest) (died 1558), Canon of Windsor and president of Magdalen College, Oxford", "* Arthur Cole, 1st Baron Ranelagh (died 1754), Irish politician", "* Arthur Cole-Hamilton (1750–1810), Anglo-Irish politician born Arthur Cole"]}, {"page": "List of United Kingdom by-elections (1832–1847)", "response": ["|Henry Arthur Cole"]}, {"page": "Richard Magenis (died 1831)", "response": ["Magenis married firstly, 1788, Lady Elizabeth Anne Cole (died 26 May 1807), daughter of William Cole, 1st Earl of Enniskillen and niece of Hon. Arthur Cole-Hamilton, with whom he represented Enniskillen. They had five sons and four daughters."]}]}}