{"wiki_id": "http://www.wikidata.org/entity/Q2424777", "itemLabel": "Mike Barker", "itemDescription": "British film director", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Barker_(director)", "wikipedia_page": {"main": "Mike Barker (born 29 November 1965) is a British film director. His 2003 film To Kill a King was entered into the 25th Moscow International Film Festival.", "link_mentions": [{"page": "A Good Woman (film)", "response": ["A Good Woman is a 2004 romantic comedy-drama film directed by Mike Barker. The screenplay by Howard Himelstein is based on the 1892 play Lady Windermere's Fan by Oscar Wilde. It is the fourth screen version of the work, following a 1916 silent film using Wilde's original title, Ernst Lubitsch's 1925 version and Otto Preminger's 1949 adaptation entitled The Fan.", "Category:Films directed by Mike Barker"]}, {"page": "Michael Barker", "response": ["Michael or Mike Barker may refer to:", "*Mike Barker (producer) (born 1968), co-creator of American Dad!", "*Mike Barker (director) (born 1965), film and television director "]}, {"page": "Best Laid Plans (1999 film)", "response": ["Best Laid Plans is a 1999 American crime film directed by Mike Barker.", "Category:Films directed by Mike Barker"]}, {"page": "Butterfly on a Wheel", "response": ["Butterfly on a Wheel (US: Shattered, Europe: Desperate Hours) is a 2007 British–Canadian mystery thriller film directed by Mike Barker, co-produced and written by William Morrissey, and starring Pierce Brosnan, Gerard Butler, and Maria Bello. The film's title is an allusion to a line of Alexander Pope's poem \"Epistle to Dr Arbuthnot\": \"Who breaks a butterfly upon a wheel?\" The line is usually interpreted as questioning why someone would put great effort into achieving something minor or unimportant, or who would punish a minor offender with a disproportional punishment.", "Category:Films directed by Mike Barker"]}, {"page": "Primetime Emmy Award for Outstanding Drama Series", "response": ["| Bruce Miller, Warren Littlefield, Elisabeth Moss, Daniel Wilson and Fran Sears, executive producers; Mike Barker, Sheila Hockin, Eric Tuchman, Kira Snyder, Yahlin Chang, Frank Siracusa and John Weber, co-executive producers; Dorothy Fortenberry, producer; Joseph Boccia, produced by; Margaret Atwood and Ron Milbauer, consulting producers", "| Bruce Miller, Warren Littlefield, Elisabeth Moss, Daniel Wilson, Fran Sears, Mike Barker, Eric Tuchman, Sheila Hockin, John Weber and Frank Siracusa, executive producers; Kira Snyder, Yahlin Chang and Margaret Atwood, co-executive producers; Dorothy Fortenberry and Marissa Jo Cerar, supervising producers; Nina Fiore and John Herrera, producers; Kim Todd, produced by"]}, {"page": "To Kill a King", "response": ["To Kill a King is a 2003 English Civil War film directed by Mike Barker and starring Tim Roth, Rupert Everett and Dougray Scott. It centres on the relationship between Oliver Cromwell and Thomas Fairfax in the post-war period from 1648 until the former's death, in 1658. The plot includes considerable artistic license with historical facts.", "*25th Moscow International Film Festival - 2003, Mike Barker", "*Emden International Film Festival - 2003, Mike Barker ", "Category:Films directed by Mike Barker"]}, {"page": "List of Spanish films of 2005", "response": ["| align = \"center\" rowspan = \"2\" | 10 || A Good Woman || Director: Mike BarkerCast: Helen Hunt, Scarlett Johansson, Tom Wilkinson || align = \"center\" | "]}, {"page": "The Tenant of Wildfell Hall (1996 TV series)", "response": ["The Tenant of Wildfell Hall is a 1996 British television serial adaptation of Anne Brontë's 1848 novel of the same name, produced by BBC and directed by Mike Barker. The serial stars Tara Fitzgerald as Helen Graham, Rupert Graves as her abusive husband Arthur Huntington and Toby Stephens as Gilbert Markham. The first two parts aired in the United Kingdom on 17 November 1996, and the third on 24 November."]}, {"page": "Moby Dick (2011 miniseries)", "response": ["Moby Dick is a Canadian-German television miniseries based on Herman Melville's 1851 novel of the same name, produced by Tele München Gruppe, with Gate Film, In association with RTH/ORF. Starring William Hurt as Captain Ahab, it was directed by Mike Barker with a screenplay by Nigel Williams. The cast also includes Ethan Hawke as Starbuck, Charlie Cox as Ishmael, Eddie Marsan as Stubb,  Gillian Anderson as Ahab's wife, Elizabeth and Donald Sutherland as Father Mapple."]}, {"page": "British Academy Television Award for Best International Programme", "response": ["| The Handmaid's Tale || Bruce Miller, Warren Littlefield, Elisabeth Moss, Mike Barker || Channel 4"]}, {"page": "List of neo-noir films", "response": ["| Mike Barker"]}, {"page": "Broadchurch (series 2)", "response": ["James Strong, who directed five of the eight episodes in series one, directed the first two episodes of series two. Mike Barker, Jessica Hobbs, and Jonathan Teplitzky also directed episodes, with Barker directing episodes seven and eight. John Conroy was the director of photography for all eight episodes. Editing for series two was overseen by Mike Jones, Ben Lester, Dom Strevens, and Helen Chapman, with production design by Simon Rogers and art direction by John West."]}, {"page": "Bruna Papandrea", "response": ["|Mike Barker"]}, {"page": "Luckiest Girl Alive", "response": ["In April 2015, Lionsgate announced that they had optioned the film rights to Luckiest Girl Alive, with Reese Witherspoon's Pacific Standard set to produce. It was announced in February 2021, that Mila Kunis is set to star in the film, now at Netflix. Produced by Made Up Stories and Picturestart, the screenplay was written by Knoll and will be directed by Mike Barker."]}, {"page": "The Handmaid's Tale (TV series)", "response": ["| Bruce Miller, Warren Littlefield, Elisabeth Moss, Daniel Wilson, Fran Sears, Mike Barker, Sheila Hockin, Eric Tuchman, Kira Snyder, Yahlin Chang, Frank Siracusa, John Weber, Dorothy Fortenberry and Joseph Boccia", "| Bruce Miller, Warren Littlefield, Elisabeth Moss, Daniel Wilson, Fran Sears, Mike Barker, Eric Tuchman, Sheila Hockin, John Weber, Frank Siracusa, Kira Snyder, Yahlin Chang, Margaret Atwood, Dorothy Fortenberry, Marissa Jo Cerar, Nina Fiore, John Herrera and Kim Todd"]}, {"page": "Ben Seresin", "response": ["| Mike Barker", "| Mike Barker"]}, {"page": "Mike Barker (film director)", "response": ["#REDIRECT Mike Barker (director)"]}, {"page": "Made Up Stories (company)", "response": ["It was announced on February 22, that the company was adapting Jessica Knoll's novel Luckiest Girl Alive in partnership with PICTURESTART for film at  Netflix. It will star Mila Kunis, and be directed by Mike Barker.", "|Mike Barker"]}, {"page": "Brian Tufano", "response": ["|Harry Hook, Mike Barker, Noella Smith"]}, {"page": "Luckiest Girl Alive (film)", "response": ["Luckiest Girl Alive is an upcoming American mystery film directed by Mike Barker from a screenplay by Jessica Knoll, based on her novel of the same name.", "In August 2015, it was announced Lionsgate had acquired film rights to Luckiest Girl Alive by Jessica Knoll, with Reese Witherspoon set to produce under her Pacific Standard banner. In February 2021, it was announced Mila Kunis would star in the film, with Mike Barker set to direct the film, from a script by Knoll, with Netflix set to distribute, and Lionsgate and Witherspoon no longer attached. In July 2021, Finn Wittrock, Scoot McNairy, Chiara Aurelia, Thomas Barbusca, Justine Lupe, Dalmar Abuzied, Alex Barone, Carson MacCormac, Jennifer Beals and Connie Britton joined the cast of the film.", "Category:Films directed by Mike Barker"]}, {"page": "Hit & Run (TV series)", "response": ["Hit & Run was written by Avi Issacharoff, Lior Raz, Dawn Prestwich, and Nicole Yorkin. Mike Barker directed the pilot and 3 other episodes; Neasa Hardiman and Rotem Shamir directed 3 and 2 episodes, respectively. This is the first Netflix original series from Israel. On 20 September 2021, Netflix canceled the series after one season."]}]}}