{"wiki_id": "http://www.wikidata.org/entity/Q2420007", "itemLabel": "Tom Meighan", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Meighan", "wikipedia_page": {"main": "Thomas Peter Meighan (, born 11 January 1981) is an English singer and musician, best known as the former lead vocalist for the rock band Kasabian. He enjoyed large-scale success with Kasabian in the 2000s and 2010s. He is said to have an intense, frenetic personality both on and off stage. He has been compared to Liam Gallagher, whom he has referred to as the \"perfect frontman\". Meighan finished 13th in Radio X's poll of the greatest frontmen.", "link_mentions": [{"page": "Irish diaspora", "response": ["*Tom Meighan, lead singer of Kasabian"]}, {"page": "The Who", "response": ["In 2010, the Who performed Quadrophenia with parts played by Vedder and Tom Meighan at the Royal Albert Hall as part of the Teenage Cancer Trust series of 10 gigs. A planned tour for early 2010 was jeopardised by the return of Townshend's tinnitus. He experimented with an in-ear monitoring system that was recommended by Neil Young and his audiologist."]}, {"page": "Roger Daltrey", "response": ["In February 2010, Townshend and Daltrey, headlining as the Who, performed the half-time show at Super Bowl XLIV in front of 105.97 million viewers across the globe. In March 2010, Townshend and Daltrey, along with an extensive backing band, performed Quadrophenia at the Royal Albert Hall in London as a tenth anniversary charity benefit for the Teenage Cancer Trust. Eddie Vedder of Pearl Jam sang the part of the Godfather and Tom Meighan of Kasabian sang the part of Aceface."]}, {"page": "Quadrophenia", "response": ["The Who performed Quadrophenia at the Royal Albert Hall on 30 March 2010 as part of the Teenage Cancer Trust series of ten gigs. This one-off performance of the rock opera featured guest appearances from Pearl Jam's Eddie Vedder and Kasabian's Tom Meighan."]}, {"page": "Blaby", "response": ["*Tom Meighan"]}, {"page": "Kasabian (album)", "response": ["*Tom Meighan – lead vocals , backing vocals "]}, {"page": "Kasabian", "response": ["Kasabian ( ) are an English rock band formed in Leicester in 1997 by Tom Meighan, Sergio Pizzorno, Chris Karloff, and Chris Edwards. Drummer Ian Matthews joined in 2004. Karloff left the band in 2006 and founded a new band called Black Onassis. Jay Mehler joined as touring lead guitarist in 2006, leaving for Liam Gallagher's Beady Eye in 2013, to be replaced by Tim Carter. Meighan left the band in July 2020.", "Following early 2012 dates in Japan, Australia, and Europe, Kasabian launched their North American leg in Dallas on 12 March, with 19 dates in U.S. and Canada until late April. It was announced on 16 May on the Kasabian website that their show of 15 December 2011, that was filmed at the O2 in London, would be screened in over 60 cinemas in the UK and Ireland on 30 May 2012. The film, titled Kasabian Live! Live at the O2 is distributed by Altive Media and Eagle Vision. On 29 June 2012, Kasabian performed at the Main Square festival in Arras France. At the end of the set, Tom Meighan returned to the stage without the band and performed The Beatles \"She Loves You\" unaccompanied, something that he had also done three days earlier in Athens, Greece, and on 16 June in Denmark at the NorthSide Festival. On 8 July 2012, the band headlined the UK festival T in the Park. Kasabian also headlined the Reading and Leeds Festivals on 24 and 25 August 2012.", "*Tom Meighan – lead and backing vocals (1997–2020)", " bar:Meighan  text:Tom Meighan"]}, {"page": "Killing in the Name", "response": ["After X Factor creator Simon Cowell denounced the campaign as \"stupid\" and \"cynical,\" the group gained more attention and was mentioned on various UK news channels, radio stations and websites. Rage Against the Machine added their support. Morello said that achieving the Christmas number one would be \"a wonderful dose of anarchy\" and that he planned to donate the unexpected windfall to charity. Dave Grohl, Muse, Them Crooked Vultures, Liam Howlett and The Prodigy were among many musicians and celebrities supporting the campaign. The campaign received support from Paul McCartney, who had appeared on The X Factor with the finalists, and X Factor contestants Jedward. Critics noted that both The X Factor and Rage Against the Machine are signed to labels that are part of Sony BMG; Morello dismissed conspiracy claims as ridiculous. Kasabian's Tom Meighan and Sergio Pizzorno expressed their happiness at the campaign's success in an NME interview and criticised The X Factor."]}, {"page": "1981 in the United Kingdom", "response": ["** Tom Meighan, singer and songwriter"]}, {"page": "Empire (Kasabian album)", "response": ["According to Tom Meighan in an interview on the album with the NME in early 2006, \"Empire\" is a word used by the band to describe something that is good. As of 3 May 2017 the album has sold over 800,000 copies in the band's home country of the UK.", "AllMusic's David Jeffries commended the band for taking a grand-scale approach to mixing their influences into an Oasis-sized project, but felt they forgot to write catchy tracks to lead the album, saying that: \"Lost in all this is the instantly grabbing songwriting of Kasabian's debut, and to some extent, the bandmembers themselves, who often seem to be riding this swirl instead of guiding it.\" Despite praising a few tracks, Lauren Murphy of Entertainment.ie felt the album was just a retread of their debut with Tom Meighan's vocals starting to sound strained throughout, concluding with: \"If Kasabian hadn't attempted to build their Empire by recounting its wonderment prematurely, it might have stood a chance; instead, their audacity just proves them to be, unsurprisingly, more geezer, less Caesar.\" Peter Relic of Rolling Stone criticized the album for sounding like a rehash of established British rock bands and Meighan for having weak vocal delivery on the tracks, calling it \"miles worse than their shallow but tasty first, its big-budget production only making its shortcomings more apparent.\"", "*Tom Meighan – lead vocals , backing vocals "]}]}}