{"wiki_id": "http://www.wikidata.org/entity/Q242571", "itemLabel": "Elizabeth Goudge", "itemDescription": "English fiction writer (1900-1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Goudge", "wikipedia_page": {"main": "Elizabeth de Beauchamp Goudge FRSL (24 April 1900 – 1 April 1984) was an English writer of fiction and children's books. She won the Carnegie Medal for British children's books in 1946 for The Little White Horse. Goudge was long a popular author in the UK and the US and regained attention decades later. In 1993 her book The Rosemary Tree was plagiarised by Indrani Aikath-Gyaltsen; the \"new\" novel set in India was warmly reviewed in The New York Times and The Washington Post before its source was discovered. In 2001 or 2002 J. K. Rowling identified The Little White Horse as one of her favourite books and one of few with a direct influence on the Harry Potter series.", "link_mentions": [{"page": "April 1", "response": ["*  1984   – Elizabeth Goudge, English author (b. 1900)"]}, {"page": "April 24", "response": ["*1900 – Elizabeth Goudge, English author and educator (d. 1984) "]}, {"page": "Charlotte Brontë", "response": ["** Emma, by \"Charlotte Brontë and Another Lady\", published 1980; although this has been attributed to Elizabeth Goudge, the actual author was Constance Savery.Bronte, Charlotta and Another Lady. Emma. Moscow: Folio. 2001. 11."]}, {"page": "J. K. Rowling", "response": ["Rowling acknowledges Homer, Geoffrey Chaucer, and William Shakespeare as literary influences. Scholars agree that Harry Potter is heavily influenced by the juvenile fantasy of writers such as C. S. Lewis, J. R. R. Tolkien, Elizabeth Goudge, Ursula K. Le Guin, Dianna Wynne Jones, and E. Nesbit. According to the critic Beatrice Groves, Harry Potter is also \"rooted in the Western literary tradition\", including the classics. Commentators also note similarities to the children's stories of Enid Blyton and Roald Dahl. Rowling expresses admiration for Lewis, in whose writing battles between good and evil are also prominent, but rejects any connection with Dahl."]}, {"page": "1984", "response": ["** Elizabeth Goudge, English writer (b. 1900)"]}, {"page": "1900", "response": ["* April 24 – Elizabeth Goudge, English writer (d. 1984)"]}, {"page": "Wells, Somerset", "response": ["Elizabeth Goudge used Wells as a basis for the fictional cathedral city of Torminster, in her book A City of Bells.", "* Elizabeth Goudge – author of novels, short stories and children's books, was born in Wells in 1900."]}, {"page": "List of children's literature writers", "response": ["*Elizabeth Goudge (1900–1984) – The Little White Horse, Linnets and Valerians"]}, {"page": "Battle of Lepanto", "response": ["At the start of the 20th century too, Emilio Salgari devoted his historical novel, Il Leone di Damasco (\"The Lion of Damascus\", 1910), to the Battle of Lepanto, which was eventually to be adapted to film by Corrado D'Errico in 1942. In 1942 as well, English author Elizabeth Goudge has a character in her war-time novel, The Castle on the Hill (1942), recall the leading role of John of Austria in the battle and the presence of Cervantes there. Much as combatants had appropriated Chesterton's poem to the circumstances of World War I,Luke J. Foster, \"Tilting After the Trenches: The Quixotic Return of Heroism in G.K. Chesterton's Modernism\", Columbia University Department of English & Comparative Literature 2015, p.2 Gould harnessed that ancient incident to British resistance to Nazi Germany during World War II.The Castle on the Hill, Chapter V, pp 83–84"]}, {"page": "1900 in literature", "response": ["*April 24 – Elizabeth Goudge, English novelist and children's author (died 1984)"]}, {"page": "1993 in literature", "response": ["**Indrani Aikath Gyaltsen's novel Cranes' Morning appears in India, but proves to be plagiarized from Elizabeth Goudge's The Rosemary Tree (1956); its author will commit suicide in 1994."]}, {"page": "1984 in literature", "response": ["*April 1 – Elizabeth Goudge, English writer (born 1900)"]}, {"page": "1946 in literature", "response": ["*Elizabeth Goudge – The Little White Horse", "*Carnegie Medal for children's literature: Elizabeth Goudge, The Little White Horse"]}, {"page": "List of fictional rabbits and hares", "response": ["|Elizabeth Goudge"]}, {"page": "Bullroarer", "response": ["In Britain and Ireland, the bullroarer—under a number of different names and styles—is used chiefly for amusement, although formerly it may have been used for ceremonial purposes.Haddon, The Study of Man,p 225: \"Those given to me were made for me, and may not represent the common form of bull-roarer in the north-east corner of Ireland. My informant stated that once when, as a boy, he was playing with a 'boomer' an old country woman said it was a 'sacred' thing.\" In parts of Scotland it was known as a \"thunder-spell\" and was thought to protect against being struck by lightning.Haddon, The Study of Man, p. 222: \"It was believed that the use of this instrument [thunder-spell] during a thunder-storm saved one from being struck with 'the thun'er-bolt'.\" In the Elizabeth Goudge novel Gentian Hill (1949), set in Devon in the early 19th century, a bullroarer figures as a toy cherished by Sol, an elderly farm labourer, who being mute, uses it occasionally to express strong emotion; however, the sound it makes is perceived as being both eerie and unlucky by two other characters,  who have an uneasy sense that ominous spirits of the air (\"Them\") are being invoked by its whirring whistle.Goudge, Elizabeth. Gentian Hill, New York: Coward-McCann, Inc., 1946, pp. 71-72, 168, 315-321, 346-348, 354."]}, {"page": "Lucy Walter", "response": ["* The novelist Elizabeth Goudge published a novel about Lucy, The Child from the Sea, in 1970."]}, {"page": "The Bridge of San Luis Rey", "response": ["* The Bridge of San Luis Rey is mentioned in Elizabeth Goudge's war-time novel The Castle on the Hill (1942, Chapter I, Part II), where a major character explains that, \"... in this case death came to those five just at the most fitting moment of their lives, and that this so-called tragedy, as it affected the lives of others, brought alterations in the pattern [of life] that spelled in the long run only blessing and peace\": this character, an elderly historian, is attempting to offer consolation to a woman he has just met whose life has been full of personal tragedy and war-time disaster)."]}, {"page": "List of works titled after Shakespeare", "response": ["*The Herb of Grace by Elizabeth Goudge (IV.v)"]}, {"page": "List of irregularly spelled English names", "response": ["|Elizabeth Goudge"]}, {"page": "James Elroy Flecker", "response": ["The Pilgrims' Song from Hassan and its setting by Delius play a pivotal role at the beginning of Elizabeth Goudge's novel The Castle on the Hill (1942).Elizabeth Goudge, The Castle on the Hill, Chapters I.i, II.i"]}, {"page": "Low fantasy", "response": ["Some sources place Harry Potter and His Dark Materials in the low fantasy genre.  Karin E. Westman, writing in The Oxford Handbook of Children's Literature states that because \"[J. K.] Rowling is much more interested in how fantasy provides perspective on everyday experience and the individual's place in society,\" and her inclusion of bildungsroman (a coming-of-age story) and the school story genres, \"align her primarily with the domestic (or low) fantasy of authors such as E. Nesbit, Elizabeth Goudge, and Paul Gallico...as well as authors like Philip Pullman and Jonathan Stroud, who are also interested in the intersection of the personal and the political within quotidian experiences.\""]}, {"page": "Fire and Hemlock", "response": ["*Other books mentioned: Don Quixote, The Hundred and One Dalmatians, Henrietta's House (by Elizabeth Goudge, a book which includes its own list of books recommended for a girl to read), Uncle Tom's Cabin, Black Beauty, Sherlock Holmes, Tom's Midnight Garden, Kim, The War of the Worlds, Twelfth Night, Perelandra, The Man Who Was Thursday, The Napoleon of Notting Hill, and The Thirty-Nine Steps."]}, {"page": "May Morning", "response": ["In the 19th century, the young townsmen blew horns and ran riot, after the singing. Activities have varied over the previous centuries.  Vera Brittain wrote a poem with the title May Morning in 1916. The first ten lines depict the actual event.Vera Brittain, May Morning. One fictional description of the Tudor May Morning is in \"Towers in the Mist\" by Elizabeth Goudge.Elizabeth Goudge, Towers in the Mist. Another description is found in the film Shadowlands directed by Richard Attenborough, on an episode in the life of the English scholar, writer and fellow of Magdalen's C. S. Lewis, starring Anthony Hopkins as C. S. Lewis and Debra Winger as Joy Davidman."]}, {"page": "Thomas Tompion", "response": ["In Elizabeth Goudge's 1960 novel The Dean's Watch, Thomas Tompion is remembered reverently by the clockmaker Isaac Peabody."]}, {"page": "Indrani Aikath Gyaltsen", "response": ["Soon after its publication, it became clear that her second novel, Cranes' Morning, had been plagiarised from The Rosemary Tree by the English novelist Elizabeth Goudge, which had been published in London by Hodder & Stoughton in 1956. Molly Moore of the Washington Post Foreign Service wrote: \"Aikath-Gyaltsen recast the setting to an Indian village, changing the names and switching the religion to Hindu but often keeping the story word-for-word the same\". When the plagiarism was uncovered, Crane's Morning had been published by Penguin Books in India and Ballantine Books in the U.S. but not yet in the UK."]}, {"page": "Rotherfield Peppard", "response": ["Rotherfield Peppard (often referred to simply as Peppard by locals) is a village and civil parish in the Chiltern Hills in South Oxfordshire. It is centred  west of Henley-on-Thames,  north of Reading, Berkshire and  southwest of Rotherfield Greys. The 2011 Census recorded the parish population as 1,649. The area includes Peppard Hill, which is  west of the centre of the village and adjoins Sonning Common. Peppard Common is public woodland and meadow in between in a ravine. The far east of the parish is a golf course and the far west is Kingwood Common which is also wooded common land. In 1951, Elizabeth Goudgehttps://www.elizabethgoudge.org/ (1900-1984), novelist and winner of the Newberry Award for Best Children's Book (The White Horse), moved to Rotherfield Peppard, where she lived until her death. A blue plaque, unveiled in 2008, identifies her home."]}, {"page": "Publishers Weekly list of bestselling novels in the United States in the 1940s", "response": ["# Green Dolphin Street by Elizabeth Goudge", "# Pilgrim's Inn by Elizabeth Goudge"]}, {"page": "Berry Pomeroy Castle", "response": ["The castle is the fictional setting for Elizabeth Goudge's World War II novel The Castle on the Hill (1942), set in late 1940 during the start of the Blitz after the Battle of Britain, imagined as still being occupied by the descendants of the original family who built the castle after William the Conqueror arrived in 1066. Goudge's story includes an episode in which the castle is mainly destroyed by a German bomber jettisoning its bomb-load."]}, {"page": "C. Walter Hodges", "response": ["Hodges spent most of his career as a freelance illustrator. For many years he did line drawings for the Radio Times. He also produced its 1938 Christmas edition. Among the writers for children with whom he collaborated as an illustrator were Ian Serraillier, Rosemary Sutcliff (The Eagle of the Ninth), Rhoda Power (Redcap Runs Away), Elizabeth Goudge (The Little White Horse) and William Mayne.", "*Elizabeth Goudge, The Little White Horse (1946), Smokey House (1939), Sister of the Angels (1939), The Dean's Watch (1960), Make-Believe (1949)"]}, {"page": "1900 in the United Kingdom", "response": ["* 24 April – Elizabeth Goudge, novelist (died 1984)"]}, {"page": "Romani people in fiction", "response": ["* 1958:   Elizabeth Goudge's The White Witch.  Features a description of the lifestyle of the Romnichals of the UK during the civil war."]}, {"page": "White Witch (disambiguation)", "response": ["* The White Witch, a 1958 novel by Elizabeth Goudge"]}, {"page": "Fritz Umgelter", "response": ["* Das mittlere Fenster (1959) — (based on the novel The Middle Window by Elizabeth Goudge)"]}, {"page": "Harry Potter influences and analogues", "response": ["In an interview in The Scotsman in 2002, Rowling described Elizabeth Goudge's The Little White Horse as having, \"perhaps more than any other book . . . a direct influence on the Harry Potter books. The author always included details of what her characters were eating and I remember liking that. You may have noticed that I always list the food being eaten at Hogwarts.\" Rowling said in O that \"Goudge was the only [author] whose influence I was conscious of. She always described exactly what the children were eating, and I really liked knowing what they had in their sandwiches.\""]}, {"page": "Romantic Novelists' Association", "response": ["The Romantic Novelists' Association (RNA) is the professional body that represents authors of romantic fiction in the United Kingdom. It was founded in 1960 by Denise Robins (first president), Barbara Cartland (first vice-president), Vivian Stuart (first elected chairman), and other authors including Elizabeth Goudge, Netta Muskett, Catherine Cookson, Rosamunde Pilcher and Lucilla Andrews.", "* Elizabeth de Beauchamp Goudge (Elizabeth Goudge) "]}, {"page": "List of Anglicans", "response": ["*Elizabeth Goudge (1900–1984), English novelist"]}, {"page": "On Green Dolphin Street (novel)", "response": ["On Green Dolphin Street  is a novel by Sebastian Faulks, published by Hutchinson in 2001. The title comes from a 1947 composition by Bronislau Kaper and Ned Washington—written for the Hollywood film Green Dolphin Street—and later recorded by jazz musicians Miles Davis (1958), and Bill Evans (1959), among others. The film was an adaptation of the best-seller novel Green Dolphin Street (1944) by Elizabeth Goudge."]}, {"page": "The Little White Horse", "response": ["The Little White Horse is a low fantasy children's novel by Elizabeth Goudge, first published by the University of London Press in 1946 with illustrations by C. Walter Hodges, and Anne Yvonne Gilbert in 1992. Coward–McCann published a US edition next year. Set in 1842, it features a recently orphaned teenage girl who is sent to the manor house of her cousin and guardian in the West Country of England. The estate, village, and vicinity are shrouded in mystery and magic; the \"little white horse\" is a unicorn.", "* Elizabeth Goudge Society page and reader forum"]}, {"page": "Oxfordshire Blue Plaques Board", "response": ["|data-sort-value=\"Goudge\"|Elizabeth Goudge"]}, {"page": "List of children's books made into feature films", "response": ["| The Little White Horse (1946), Elizabeth Goudge"]}, {"page": "List of children's classic books", "response": ["| The Little White Horse || Elizabeth Goudge || 1946 ||"]}]}}