{"wiki_id": "http://www.wikidata.org/entity/Q24247083", "itemLabel": "Adrian Flowers", "itemDescription": "British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Adrian_Flowers", "wikipedia_page": {"main": "Adrian John Flowers (11 July 1926 – 18 May 2016) was a British photographer known for his portraits of celebrities that included Twiggy, Paul McCartney, Linda McCartney and Vanessa Redgrave.\n\n", "link_mentions": [{"page": "Edward Lucie-Smith", "response": ["*Glenys Barton (1997; with Adrian Flowers and Robin Gibson)"]}, {"page": "Len Deighton's London Dossier", "response": ["Among the contributors are the Sunday Times columnist and editor Godfrey Smith, musician and TV presenter Steve Race, the Evening Standard critic and columnist Milton Shulman, photographer and journalist Daniel Farson, photographer Adrian Flowers, investigative reporter and crime writer Eric Clark,Existential Ennui, 19 December 2011: Len Deighton's London Dossier Linked 2016-11-02  and photographer, journalist and foodie Adrian Bailey.Londonist, 23 February 2010: Len Deighton's London Dossier, Chapter 2: Food Linked 2016-11-02"]}, {"page": "Chris Killip", "response": ["Killip was born in Douglas, Isle of Man; his parents ran the Highlander pub. He left school at 16 to work as a trainee hotel manager, while also working as a beach photographer. In 1964, aged 18, he moved to London where he worked as an assistant to the advertising photographer Adrian Flowers. He soon went freelance, along with periods working in his father's pub on the Isle of Man. In 1969, Killip ended his commercial work to concentrate on his own photography. The work from this time was eventually published by the Arts Council as Isle of Man: A Book about the Manx in 1980 with a text by John Berger. In 1972, he was commissioned by the Arts Council to photograph Bury St Edmunds and Huddersfield, and in 1975 he won a two-year fellowship from Northern Arts to photograph the northeast of England. He moved to Newcastle-upon-Tyne to pursue this work, which Creative Camera devoted its entire May 1977 issue to."]}, {"page": "Brian Duffy (photographer)", "response": ["In 1955 Duffy began freelancing as a fashion artist for Harper's Bazaar where he first came into contact with commercial photography. Inspired by the photographic contact sheets he saw passing through the art director's desk he sought a job as a photographers assistant. Unsuccessfully, he applied for a job with John French and was subsequently employed at Carlton studios and then at Cosmopolitan Artists. Duffy went on to work as an assistant to the photographer Adrian Flowers during which time he received his first photographic commission from Ernestine Carter, who at the time was the fashion editor of The Sunday Times."]}, {"page": "Flowers (name)", "response": ["*Adrian Flowers (1926–2016), British photographer"]}, {"page": "Matthew Flowers", "response": ["Matthew Flowers is the son of Angela Flowers (art dealer) and Adrian Flowers (photographer).  He has two brothers and two sisters."]}, {"page": "2016 in the United Kingdom", "response": ["**Adrian Flowers, 89, photographer."]}, {"page": "Deaths in May 2016", "response": ["*Adrian Flowers, 89, British photographer.Adrian Flowers"]}, {"page": "Tessa Traeger", "response": ["*Machine Dreams: a New Technology, The Photographers' Gallery, London, September–November 1989. Work by Traeger, David Buckland, Graham Budgett, Calum Colvin, Mike Dean, Susan Derges, Steven Dowsing, Edwina Fitzpatrick, Adrian Flowers, and David Godbold."]}, {"page": "Angela Flowers", "response": ["In 1952, aged 19, she met fashion and portrait photographer Adrian Flowers, marrying him seven weeks later (\"I met Adrian in the January and proposed to him in the February because it was leap year ... and we got married a few weeks later\"). She studied drama and music at the Guildhall School of Music and Drama in London, and did some music and acting work, and also worked in advertising.", "In 1970, Angela Flowers met the writer and business journalist Robert Heller. Already an art collector, he helped manage the gallery. She and Adrian Flowers divorced in 1972, and she and Heller stayed together. In 1999, she said \"We've been together 29 years now and I'm still hoping to get married. Perhaps I'll ask him next year, which is a leap year.\" They married in 2003. He died in 2012. Angela and Robert had a daughter, Rachel Heller, born on 15 September 1973, who was born with Down's syndrome. Rachel is an artist and is represented by Flowers Gallery."]}]}}