{"wiki_id": "http://www.wikidata.org/entity/Q24340814", "itemLabel": "Tam Baillie", "itemDescription": "Scottish youth worker and policy manager", "wikipedia_url": "https://en.wikipedia.org/wiki/Tam_Baillie", "wikipedia_page": {"main": "Tam Baillie (born 1957) is a Scottish youth worker and policy manager who served as Scotland's Commissioner for Children and Young People between 2009–2017.", "link_mentions": [{"page": "Lennoxtown", "response": ["*Tam Baillie,  Scotland's Commissioner for Children and Young People between 2009–2017."]}, {"page": "Children and Young People's Commissioner Scotland", "response": ["Tam Baillie took up the position in May 2009, initially for a two-year term; he was reappointed in 2011 to serve until May 2017. Baillie was appointed in May 2009 after an interview process which included children and young people as well as Members of the Scottish Parliament.  In 2009, the Commissioner's office began to plan a national consultation of children and young people in Scotland called 'a RIGHT blether'. As part of the consultation there was a national vote in which children and young people were able to influence the Commissioner's office's work plan for the next four years. Children and young people were able to vote on what they thought the Commissioner should take action on in four key areas: Where I live, where I learn and develop, My neighbourhood or community and Scotland. On 10 February 2011, Baillie was reappointed for a second term, to serve until May 2017. At that point the Commissioner's office had a budget of £1.3million and employed fourteen people.", "*Tam Baillie (April 2009 to May 2017)"]}, {"page": "Time for Inclusive Education", "response": ["The former Children and Young People's Commissioner Scotland, Tam Baillie, has also supported TIE's aims. He publicly backed the campaign in October 2016, arguing that the issues that had been raised by the campaigners regarding homophobic bullying in schools should be \"addressed by the Scottish Government and education providers to ensure we live up to our international rights obligations and to create school communities based on equality and respect for all.\" His successor, Bruce Adamson, has also supported the campaign and has strongly advocated the group's calls for legislation on LGBT inclusivity in schools."]}]}}