{"wiki_id": "http://www.wikidata.org/entity/Q24320", "itemLabel": "Lesley Garrett", "itemDescription": "English soprano singer, musician, broadcaster and media personality", "wikipedia_url": "https://en.wikipedia.org/wiki/Lesley_Garrett", "wikipedia_page": {"main": "Lesley Fram Garrett, CBE (born 10 April 1955) is an English soprano singer, musician, broadcaster and media personality.  She is noted for being at home in opera and \"crossover music\".", "link_mentions": [{"page": "April 10", "response": ["*1955 – Lesley Garrett, English soprano and actress"]}, {"page": "Carousel (musical)", "response": ["| Nettie Fowler || Julie's cousin and owner of a small seaside spa || Christine Johnson°, Shirley Verrett, Lesley Garrett, Patricia Routledge, Cheryl Studer, Renée Fleming", "A revival opened at London's Savoy Theatre on December 2, 2008, after a week of previews, starring Jeremiah James (Billy), Alexandra Silber (Julie) and Lesley Garrett (Nettie).Coveney, Michael. \"Carousel, Savoy Theatre, London\". The Independent, December 4, 2008.  Retrieved on December 21, 2010. The production received warm to mixed reviews.See, e.g., Spencer, Charles. \"Carousel at the Savoy Theatre\". The Telegraph, December 3, 2008; Billington, Michael. Carousel. The Guardian, December 3, 2008; and Smith, Sam. Carousel. MusicOMH.  All retrieved on December 27, 2010  It closed in June 2009, a month early.\"Carousel Posts Closing Notices at Savoy, 20 Jun\" . WhatsOnStage, June 9, 2009.  Retrieved on December 28, 2010 Michael Coveney, writing in The Independent, admired Rodgers' music but stated, \"Lindsay Posner's efficient revival doesn't hold a candle to the National Theatre 1992 version\". A production at Theater Basel, Switzerland, in 2016 to 2017, with German dialogue, was directed by Alexander Charim and choreographed by Teresa Rotemberg. Bryony Dwyer, Christian Miedl and Cheryl Studer starred, respectively, as Julie Jordan, Billy Bigelow and Nettie Fowler.\"Richard Rodgers: Carousel\" , Diary: Theater Basel, Operabase.com. Retrieved on March 8, 2018 A semi-staged revival by the English National Opera opened at the London Coliseum in 2017. The production was directed by Lonny Price, conducted by David Charles Abell, and starred Alfie Boe as Billy, Katherine Jenkins as Julie and Nicholas Lyndhurst as the Starkeeper. The production received mixed to positive reviews.Morgan, Fergus. \"Carousel starring Alfie Boe and Katherine Jenkins – review round-up\", The Stage, April 18, 2017"]}, {"page": "The Sound of Music", "response": ["| style=\"text-align:center;\" | Lesley Garrett", "Connie Fisher was selected by public voting as the winner of the show. In early 2007, Fisher suffered from a heavy cold that prevented her from performing for two weeks. To prevent further disruptions, an alternate Maria, Aoife Mulholland, a fellow contestant on How Do You Solve a Problem like Maria?, played Maria on Monday evenings and Wednesday matinee performances. Simon Shepherd was originally cast as Captain von Trapp, but after two preview performances he was withdrawn from the production, and Alexander Hanson moved into the role in time for the official opening date along with Lesley Garrett as the Mother Abbess. After Garrett left, Margaret Preece took the role. The cast also featured Lauren Ward as the Baroness, Ian Gelder as Max, Sophie Bould as Liesl, and Neil McDermott as Rolf. Other notable replacements have included Simon Burke and Simon MacCorkindale as the Captain and newcomer Amy Lennox as Liesl. Summer Strallen replaced Fisher in February 2008,\"Summer Strallen is Maria in London's The Sound of Music Feb.26\" , Broadwayworld.com, February 4, 2008, accessed November 15, 2017 with Mulholland portraying Maria on Monday evenings and Wednesday matinees.\"Aoife Mulholland\" , Thisistheatre.com, 29 April 2015", "A UK tour began in 2009 and visited more than two dozen cities before ending in 2011. The original cast included Connie Fisher as Maria, Michael Praed as Captain von Trapp and Margaret Preece as the Mother Abbess. Kirsty Malpass was the alternate Maria.The Sound of Music UK Tour , Thesoundofmusictour.com, Retrieved May 18, 2009 Jason Donovan assumed the role of Captain Von Trapp, and Verity Rushworth took over as Maria, in early 2011. Lesley Garrett reprised her role as Mother Abbess for the tour's final engagement in Wimbledon in October 2011."]}, {"page": "The Mikado", "response": ["After the Gilbert copyrights expired in 1962, the Sadler's Wells Opera mounted the first non-D'Oyly Carte professional production in England, with Clive Revill as Ko-Ko. Among the many professional revivals since then was an English National Opera production in 1986, with Eric Idle as Ko-Ko and Lesley Garrett as Yum-Yum, directed by Jonathan Miller. This production, which has been revived numerous times over three decades, is set in a swanky 1920s English seaside hotel, with sets and costumes in black and whiteHall, George. \"The Mikado review at London Coliseum – 'still delivers the goods'\", The Stage, 23 November 2015 \"as an homage to the Marx Brothers, Noël Coward, and Busby Berkeley\". Canada's Stratford Festival has produced The Mikado several times, first in 1963 and again in 1982 (revived in 1983 and 1984) and in 1993.\"Production History\", Stratford Festival website, accessed 15 February 2014"]}, {"page": "Arbroath", "response": ["Arbroath Male Voice Choir was founded in 1934 and is now one of only a few male voice choirs left in Scotland. At 2012 the choir has over 45 members drawn from Arbroath, Angus and Dundee. The musical director is Sheena Guthrie. The choir sings a mix of songs from classical, through Scottish, show tunes and pop. It performs two main concerts each year, one at Christmas, another in spring, and offers several smaller events for good causes. The choir is notable for attracting well known, often international singers to its annual spring concert as guests. In recent years they have included, Jamie McDougall, Karen Cargill, Gordon Cree, Cheryl Forbes and Colette Ruddy. March 2012 saw the international diva Lesley Garrett as the choir's special guest."]}, {"page": "St Botolph's Church, Boston", "response": ["The Restoration Trust also holds several fundraising concerts. Artists who have performed at the church include Lesley Garrett, The Black Dyke Band, and The Pontarddulais Male Voice Choir. On 26 June 2013, the Boston Stump Restoration Trust held their annual dinner in the nave in St Botolph's Church. In September 2013, the Restoration Trust held a Grand Celebrity Concert with the St Botolph's Singers, featuring Caroline Trutz and Special Guest, Aled Jones."]}, {"page": "1955 in music", "response": ["*April 10 – Lesley Garrett, soprano"]}, {"page": "Llangollen International Musical Eisteddfod", "response": ["In 2012 the Eisteddfod played host to Lesley Garrett, Alison Balsom, Nicola Benedettii and Sian Edwards in a celebration concert for the Queen's Diamond Jubilee. There were also appearances by Alfie Boe, Steffan Morris, and Valentina Nafornta, and a performance of Karl Jenkins's new work \"The Peacemakers\" by a specially formed massed choir accompanied by the Llangollen International Eisteddfod Orchestra. The week was rounded off by the Grand Finale Concert, featuring Fflur Wyn, Wynne Evans, Mark Llewelyn Evans, John Owen-Jones and Richard Balcombe."]}, {"page": "Eurovision Song Contest 1998", "response": ["The intermission performance was entitled Jupiter, The Bringer of Joviality (a movement from orchestral suite The Planets composed by Gustav Holst in 1914) described as a \"great coming-together, a magnificent...muesli\" by host and commentator Wogan. It was a medley sung and danced, highlighting the multiculturalism of the United Kingdom and included bagpipes, a male voice choir, a soprano singer, a violinist, and some dancing tribal warriors. Pieces inspired by English, Scottish, Welsh, Irish, Indian and Zulu cultures were played. Over 200 people were involved in the interval act, which included Clan Sutherland, flutist Andy Findon, an excerpt of Patti Boulaye's Sun Dance (which would later open as a West End musical), harpist Carys Hughes, bhangra dancers Nachda Sansaar, Canoldir Male Voice Choir, Grimethorpe Colliery Band, trumpeters of the Band of the Blues and Royals, Vanessa-Mae, Lesley Garrett and the BBC Concert Orchestra conducted by Martin Koch."]}, {"page": "Royal Academy of Music", "response": ["Former students include Olga Athaide Craen, John Barbirolli, Judith Bingham, Harrison Birtwistle, Dennis Brain, Alan Bush, Doreen Carwithen, Rebecca Clarke, Jacob Collier, Clifford Curzon, Edward Gardner, Lesley Garrett, Evelyn Glennie, Eleanor Greenwood, Dorothy Howell, Katherine Jenkins, Elton John, Annie Lennox, Felicity Lott, Moura Lympany, Vanessa-Mae, Denis Matthews, Michael Nyman, Elsie Southgate, Eva Ruth Spalding, Florence Margaret Spencer Palmer, Ashan Pillai, Simon Rattle, Cecile Stevens, Arthur Sullivan, Eva Turner, Maxim Vengerov, Henry Wood and Carol Anne Williams."]}, {"page": "London Palladium", "response": ["Lloyd Webber and David Ian's production of The Sound of Music opened at the Palladium in November 2006. The production ran for just over two years, before closing on 21 February 2009. It starred Connie Fisher and Summer Strallen as Maria, Simon Shepherd, Alexander Hanson and Simon MacCorkindale as Captain Von Trapp and Lesley Garrett and Margaret Preece as the Mother Abbess. A production of Sister Act the Musical opened on 2 June 2009, starring Patina Miller as Deloris, Sheila Hancock as Mother Superior, Ian Lavender as Monsignor Howard, Chris Jarman as Shank, Ako Mitchell as Eddie, Katie Rowley Jones as Sister Mary Robert, Claire Greenway as Sister Mary Patrick and Julia Sutton as Sister Mary Lazarus.", "* 2006-09: The Sound of Music directed by Jeremy Sams, produced by Andrew Lloyd Webber, starring BBC How Do You Solve a Problem Like Maria? winner Connie Fisher, Alexander Hanson, Lesley Garrett"]}, {"page": "Jan Ravens", "response": ["Ravens has regularly imitated Newsnight host Kirsty Wark, Charlotte Green formerly of BBC Radio 4 (with double entendres), Ellen MacArthur (who regularly bursts into tears), Nigella Lawson (with double entendres), Ann Widdecombe (narrating fanciful racy storylines in her novels), Patricia Routledge's Hyacinth Bucket, Queen Elizabeth II, a chirpy Sandi Toksvig, a stern-faced Gillian McKeith, Sophie Raworth (with a bemused school-girl grin) and Fiona Bruce (with barely concealed filthy invitations) of BBC News, Anne Robinson of The Weakest Link, Lesley Garrett (often referring to her generous cleavage), Hillary Clinton, Theresa May and the Geordie-accented Ruth Archer from the BBC Radio 4 series The Archers.  She also appeared as the then Prime Minister Margaret Thatcher in an episode of Are You Being Served? although only her voice is heard."]}, {"page": "English National Opera", "response": ["In 2005, after an internal debate that had been going on since 1991, ENO announced that surtitles would be introduced at the Coliseum. Surveys had shown that only a quarter of audience members could hear the words clearly.Gilbert, p. 445 With a few exceptions, including Lesley Garrett and Andrew Shore, ENO singers of the 21st century were considered to have poorer diction than earlier singers such as Masterson and Derek Hammond-Stroud.Gilbert, p. 224, and Canning, Hugh. \"Model conduct – Opera\", The Sunday Times, 11 September 2005, \"Culture\" section, p. 26 Harewood and Pountney had been immovably opposed to surtitles, as both believed that opera in English was pointless if it could not be understood.  Harewood thought, moreover, that surtitles could undermine the case for a publicly funded opera-in-English company.Gilbert, p. 557 The editor of Opera magazine, Rodney Milnes, campaigned against surtitles on the grounds that \"singers would give up trying to articulate clearly and audiences would cease focusing on the stage\".Gilbert, p. 466 Despite these objections, surtitles were introduced from October 2005.Canning, Hugh. \"Model conduct – Opera\", The Sunday Times, 11 September 2005, \"Culture\" section, p. 26"]}, {"page": "Sarah Brightman", "response": ["* Lesley Garrett – \"Abide with me\" (FA Cup Final 19 May 2007)"]}, {"page": "On Ilkla Moor Baht 'at", "response": ["* A contemporary rendition was produced by Welcome to Yorkshire for Yorkshire Day 2013.  It features a rap by Brian Blessed, as well as an operatic verse by soprano Lesley Garrett."]}, {"page": "Kathleen Ferrier", "response": ["As the result of a separate appeal, augmented by the sales proceeds of a memoir edited by Neville Cardus, the Kathleen Ferrier Memorial Scholarship Fund was created to encourage young British and Commonwealth singers of either sex. The Fund, which has operated from 1956 under the auspices of the Royal Philharmonic Society, initially provided an annual award covering the cost of a year's study to a single prizewinner.Leonard, p. 250 With the advent of additional sponsors, the number and scope of awards has expanded considerably since that time; the list of winners of Ferrier Awards includes many singers of international repute, among them Felicity Palmer, Yvonne Kenny, Lesley Garrett and Bryn Terfel. The Kathleen Ferrier Society, founded in 1993 to promote interest in all aspects of the singer's life and work, has since 1996 awarded annual bursaries to students at Britain's major music colleges. In 2012, the Society organised a series of events to commemorate the centenary of Ferrier's birth  and in February 2012 Ferrier was one of ten prominent Britons honoured by the Royal Mail in the \"Britons of Distinction\" stamps set. Another was Frederick Delius."]}, {"page": "Serse", "response": ["Serse was produced for the stage at the La Scala Theater in Milan, Italy in January 1962. The production was conducted by Piero Bellugi, and an all-star cast featuring Mirella Freni, Rolando Panerai, Fiorenza Cossotto, Irene Companez, Leonardo Monreale, Franco Calabrese, and Luigi Alva in the title role. Because Handel operas were still in a relatively early stage of their return to the stage, musicians had not yet thought to ornament the da capo sections (repetition of the A section) of the arias and thus, they were not ornamented. A complete recording was made in 1979. A particularly highly acclaimed production, sung in English, was staged by the English National Opera in 1985, to mark the 300th anniversary of the composer's birth. Conducted by Sir Charles Mackerras, it was directed by Nicholas Hytner, who also translated the libretto, and starred Ann Murray in the title role, with Valerie Masterson as Romilda, Christopher Robson as Arsamene, and Lesley Garrett as Atalanta.Evan Dickerson, \"Seen and Heard Opera Review\" on Seen and Heard International website, retrieved 2 October 2014 The production returned for a sixth revival to the London Coliseum in September 2014, starring Alice Coote as Xerxes.William Hartston, \"Handel's Xerxes by the English National Opera: Astonishing comedy, glorious fun\", Daily Express (London), 17 September 2014. Accessed 2 October 2014. Hytner's production was also performed by San Francisco Opera in 2011. Numerous performances around the world include the Royal Opera of Versailles in 2017 and the Opernhaus Düsseldorf in 2019."]}, {"page": "The Helix, Dublin", "response": ["The Helix has been host to world-class performances ranging from the Russian State Philharmonic Orchestra, The St Petersburg Ballet, international theatre and world singers through to popular West End shows. Opera singers performing have included Dame Kiri Te Kanawa, Lesley Garrett and Bryn Terfel. Rock musicians Van Morrison and Lou Reed have also played the venue. Irish groups such as Celtic Thunder have also performed there."]}, {"page": "Ariodante", "response": ["||1996, filmed atEnglish National Opera||Ann Murray,Joan Rodgers,Lesley Garrett,Christopher Robson,Paul Nilon,Gwynne Howell||Ivor Bolton,English National Opera||David Alden||Arthaus MusikDVD cat. 100065"]}, {"page": "Through the Keyhole", "response": ["| 2 || Danny DyerSally PhillipsChris Kamara || Michael OwenLesley GarrettEmily Atack || 12 January 2019 ||"]}, {"page": "Lytham St Annes", "response": ["In 2009 Daniel Cuffe and Peter Taylor took over with a one-night concert by Lesley Garrett, but since then the concert has grown into a three-night festival with such performers as Olly Murs, Status Quo, Katherine Jenkins, Boyzone, Alfie Boe, Toyah Willcox, Bananarama, Rick Astley, Belinda Carlisle, T'Pau and the Real Thing. The 2013 line-up included Russell Watson, Jason Donovan, Sonia and Rita Ora.", "The headline act for the 2014 event was Tom Jones, with support from Cerys Matthews. The opening night, on Friday 1 August, was billed as \"The '80s versus the '90s\", and featured ABC, Blue, Hue and Cry, Atomic Kitten, the Christians, Captain Sensible, Heather Small, Howard Jones, B*Witched, China Crisis and Brother Beyond. The final day featured the Halle Orchestra, Michael Ball, Lesley Garrett and Rhydian Roberts.Lytham Proms Magazine (2014), published by www.lythamproms.co.uk, p.9"]}, {"page": "Crouch End", "response": ["Crouch End is the home of the symphonic choir, Crouch End Festival Chorus. The choir has worked with many classical and popular music artists including Ennio Morricone, Noel Gallagher, Andrea Bocelli, Katherine Jenkins. It has recorded with Lesley Garrett, Bryn Terfel, Ray Davies, Alfie Boe, EMI Classics and Classic FM, performed at The Proms in the Royal Albert Hall on several occasions and recorded works for film, television and sound track recording. Amongst those is the soundtrack for Doctor Who. It also commissions works from modern composers on its own account."]}, {"page": "Crossover music", "response": ["Within the classical recording industry, the term \"crossover\" is applied particularly to classical artists' recordings of popular repertoire such as Broadway show tunes. Two examples of this are Lesley Garrett's excursions into musical comedy and also José Carreras's recording West Side Story, as well as Teresa Stratas' recording Showboat. Soprano Eileen Farrell is generally considered to be one of the first classical singers to have a successful crossover recording with her 1960 album I've Got a Right to Sing the Blues."]}, {"page": "Thorne, South Yorkshire", "response": ["The Academy replaced Thorne Grammar School, whose notable alumni were the opera singer Lesley Garrett; George Porter, a nobel prize-winning chemist; Charles Spencer, pianist; and Sir Graham Hall, former CEO of Yorkshire Electricity.", "*Lesley Garrett, operatic soprano"]}, {"page": "Perfect Day (Lou Reed song)", "response": ["* Lesley Garrett"]}, {"page": "Sue Perkins", "response": ["In August and September 2008, Perkins appeared in the reality television series Maestro on BBC Two. During the series, a group of eight celebrities attempted (until eliminated) to learn to conduct orchestral, choral and operatic music. During the series, Perkins conducted three pieces, two of them with soprano soloist Lesley Garrett. Perkins won the series. In 2008, Perkins narrated the series ....And Proud on Virgin 1."]}, {"page": "EMI Classics", "response": ["* Lesley Garrett"]}, {"page": "List of people from Yorkshire", "response": ["|Lesley Garrett "]}, {"page": "Strictly Come Dancing", "response": ["| style=\"background:tan;\"|Lesley Garrett", "| Lesley Garrett & Anton Du Beke", "|Lesley Garrett", "Series 13 contestant Jamelia holds the record for being in the most dance-offs, which is 5, and shares the record for surviving the most dance-offs with series 18 runner-up Jamie Laing, which is 4. Series 1 semi-finalist Lesley Garrett, Series 11 contestant Mark Benton and Series 17 contestant Mike Bushell share the record for being in the most consecutive bottom twos, which is 4."]}, {"page": "Ruthie Henshall", "response": ["| Lesley Garrett: Music from the Movies"]}, {"page": "Craig Revel Horwood", "response": ["Horwood became a judge on Comic Relief Does Fame Academy in 2005, along with Lesley Garrett and Richard Park. He and Garrett replaced vocal coaches David Grant and Carrie Grant on the panel; however, the pair still appeared as voice coaches on the series. He returned as a judge for the third series of the Comic Relief edition in 2007."]}, {"page": "Dominic Miller", "response": ["* Lesley Garrett, The Singer (2003)"]}, {"page": "Dave Willetts", "response": ["Willetts has recorded several albums, mostly collections of songs from musicals. Including 'Once in a Lifetime', released just before his 60th birthday. He has performed on albums alongside Lesley Garrett, Clive Rowe and Claire Moore amongst others. Including appeared on 'Music And Songs From Aspects of Love/Phantom of the Opera' in 2008.Dan Dietz "]}, {"page": "1998 in British music", "response": ["Film composer John Barry produced his first full-length classical work, The Beyondness of Things.  One of Britain's most successful classical composers, Sir Michael Tippett, died at the age of 93, having developed pneumonia while visiting Stockholm for a retrospective of his concert music.  It was also the year when 12-year-old soprano Charlotte Church produced her first album, Voice of an Angel, which was certified triple platinum in UK sales alone, and launched her career as an opera crossover artist.  Her countryman, rising star Bryn Terfel, gave a recital at Carnegie Hall. Established opera singer Lesley Garrett released her hit album of the same name, including songs from popular musicals as well as operatic arias."]}, {"page": "Because (Guy d'Hardelot and Edward Teschemacher song)", "response": ["*Lesley Garrett"]}, {"page": "Classic Brit Awards", "response": ["Wednesday 25 May 2005. Hosted by Lesley Garrett."]}, {"page": "I'm Gonna Be (500 Miles)", "response": ["Kay also directed a video clip of the song featuring himself as Brian Potter, Lucas as Andy, David Walliams as Lou, The Proclaimers and an audience of celebrity guests, comprising Johnny Ball, David Beckham, David Bellamy, Dusty Bin, Tony Blackburn, Stan Boardman, Basil Brush, Bob the Builder, Holly Willoughby, Bucks Fizz, Cannon and Ball, Bob Carolgees & Spit the Dog, Jasper Carrott, Keith Chegwin, Jimmy Cricket, Tess Daly, Bobby Davro (referred to in the lyrics), Carol Decker, Sally Dynevor, Lesley Garrett, Andy Gray, Clare Grogan, Paul Henry, Frazer Hines, Siobhan Redmond (credited as \"Her off Holby City\"), Elton John, The Krankies, Burt Kwouk, Bonnie Langford, Eddie Large, Michael Le Vell, Limahl, Kenny Lynch, Des Lynam, Timmy Mallett, Jennie McAlpine, Bill Oddie, Paul O'Grady, Postman Pat, Wendi Peters, Robert Powell, Rod, Jane and Freddy, Rupert the Bear, Showaddywaddy, Status Quo, Frank Sidebottom, Sonia, Dennis Taylor, David Tennant, Willie Thorne, Kate Thornton, Dave Lee Travis, Owen Newton, Martin Tyler, Roy Walker, Louis Walsh, Pete Waterman, Elton Welsby, June Whitfield, Gary Wilmot, and Bob Wilson. "]}, {"page": "G4 (group)", "response": ["G4 & Friends was released on 28 November 2005, and followed the same format as their first album, but also included collaborations with Lesley Garrett and Robin Gibb, both of whom were special guests during the group's UK tour. Their recording of \"Miss You Nights\" with original artist Cliff Richard was also featured on the latter's album Two's Company The Duets. G4 & Friends entered the charts at #6, and while not as successful as their first album, it was still certified platinum. Their version of \"When a Child is Born\", also from the album, was originally in the running to become christmas number one for 2005, but was disqualified due to the inclusion of free stickers in the CD case.", "|align=\"left\"| \"All I Ask of You\" (featuring Lesley Garrett)"]}, {"page": "Loose Women", "response": ["| style=\"text-align:center\" | Lesley Garrett "]}, {"page": "Mike Christie (singer)", "response": ["During 2017, G4 released their 5th album 'Love Songs' featuring Merrill Osmond and Lesley Garrett and taking it on a 32 date tour around the UK and Ireland. Along with The X Factor China winner Mary-Jess Leaverland and saxophone player Oli Nez, but for the show in London Union Chapel G4 were joined by Merrill Osmond and Lesley Garrett. G4 also took their Christmas by Candlelight Tour around the UK for the third year running."]}, {"page": "So in Love", "response": ["*Lesley Garrett – 1996"]}, {"page": "Graham Bickley", "response": ["He was a guest artist for a gala concert in Leeds with Lesley Garrett and the Opera North Orchestra, and with orchestrator Martin Koch, he produced a concert to celebrate the work of Nelson Riddle, with The BBC Concert Orchestra and transmitted live on BBC Radio 2."]}, {"page": "Lord's Taverners", "response": ["* Lesley Garrett (2016–2018)"]}, {"page": "Leslie Garrett", "response": ["#redirect Lesley Garrett"]}, {"page": "The Raggle Taggle Gypsy", "response": ["| A North Country Lass || Lesley Garrett || 2012 || \"The Raggle Taggle Gypsies\" || The Cecil Sharp version, performed by classical soprano and orchestra"]}, {"page": "Long Ago (and Far Away)", "response": ["*Lesley Garrett (1996)"]}, {"page": "Garsington Opera", "response": ["Amongst the notable singers who have performed with the company are Susan Chilcott (The Countess in Le nozze di Figaro, 1993 ) Susan Bullock (Helena in Die ägyptische Helena, 1997) Yvonne Kenny (Christine in Intermezzo, 2001) Matthew Rose (Osmin in Die Entführung aus dem Serail, 2013) Lesley Garrett (Despina in Così fan tutte, 2015) Toby Spence (Idomeneo in Idomeneo, 2016) Roderick Williams (Eugene Onegin in Eugene Onegin, 2016) and Miah Persson (Countess in Capriccio, 2018). Conductors include David Parry, Ivor Bolton, Jane Glover, Jac van Steen, Richard Farnes and the founder of Grange Park Opera, Wasfi Kani."]}, {"page": "Street Scene (opera)", "response": ["* , English National Opera (1992 revival), with Lesley Garrett as Rose Maurrant, Caroline O'Connor as Mae Jones; directed by David Pountney"]}, {"page": "Come What May (2001 song)", "response": ["*The song was recorded as a duet on Lesley Garrett's album When I Fall In Love, with Michael Ball."]}]}}