{"wiki_id": "http://www.wikidata.org/entity/Q2435314", "itemLabel": "Timothy Rees", "itemDescription": "British bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Timothy_Rees", "wikipedia_page": {"main": "Timothy Rees  (15 August 1874 – 29 April 1939) was a Bishop of Llandaff.\nTimothy Rees was a Cardiganshire man, educated at St David's College School and then St David's College Lampeter.  He subsequently pursued a monastic vocation at the Community of the Resurrection at Mirfield in Yorkshire. When in 1931 he became Bishop of Llandaff he was the first member of a religious community to be appointed to an Anglican see in Wales for over three centuries. He was a distinguished speaker both in English and Welsh and a respected hymnographer.\nHe was born to David Rees and his wife Catherine at Llain, Llanbadarn Trefeglwys, Ceridigion.  The National Library of Wales, and others, report his birth as 15 August 1874, though some sources claim 1869.", "link_mentions": [{"page": "Bishop of Llandaff", "response": ["| 60px Timothy Rees "]}, {"page": "Community of the Resurrection", "response": ["The community has fostered 11 bishops in different parts of the Anglican Communion. Both of the two founders became bishops in the Church of England. Charles Gore was Bishop of Worcester (1902–05), Birmingham (1905–11) and Oxford (1911–19), and Walter Howard Frere became Bishop of Truro (1923–35). Timothy Rees became Bishop of Llandaff (1931–39) in Wales, and Thomas Hannay became Bishop of Argyll and The Isles in Scotland (1942–62), and Primus of the Scottish Episcopal Church from 1952 to his retirement in 1962."]}, {"page": "College of the Resurrection", "response": ["| The Reverend Fr Timothy Rees CR"]}, {"page": "1939 in Wales", "response": ["*29 April - Timothy Rees, Bishop of Llandaff, 64"]}, {"page": "Miskin", "response": ["Funds for the building of the church were raised by public donations and events, notably the Grand Fete at Miskin Manor which raised over £1,000, with the majority of the funds coming from Emma Eleanor Williams, Gwilym Williams' widow. The church was licensed on 23 December 1907 and later consecrated by Right Rev Timothy Rees, Bishop of Llandaff, on Sunday 23 April 1933."]}, {"page": "Category talk:Ancient Christian denominations", "response": ["Timothy ReesStub"]}, {"page": "The 16' Club", "response": ["*Timothy ReesJohn Lambert Rees, Timothy Rees of Mirfield and Llandaff : a biography (Morehouse-Gorham, 1945), at page 32"]}, {"page": "Timothy Rees (judoka)", "response": ["Timothy Rees (born 24 July 1980) is a Canadian judoka and academic who represented Canada in Judo at the 2012 Paralympics in the -100 kg category. He was eliminated in the first round by Britain's Joe Ingram."]}, {"page": "Morgan Lindsay", "response": ["Lindsay died, aged 78, at his home at Ystrad Fawr on Friday 1 November 1935. He was buried at Holy Trinity Church, Ystrad Mynach on 5 November 1935; the funeral service was conducted by The Revd. Alfred Monahan, the then Archdeacon of Monmouth and Chaplain to the Royal Monmouthshire Royal Engineers with a full military service.  The streets of the town were lined with thousands of people. A memorial service was held at Holy Trinity Church on Sunday 17 November, conducted by the Bishop of Llandaff, The Right Revd. Timothy Rees. The bishop paid this tribute to Col. Morgan Lindsay:"]}]}}