{"wiki_id": "http://www.wikidata.org/entity/Q2434995", "itemLabel": "Timon Screech", "itemDescription": "British art historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Timon_Screech", "wikipedia_page": {"main": "Timon Screech  (born 28 September 1961 in Birmingham) was professor of the history of art at the School of Oriental and African Studies (SOAS), University of London from 1991 - 2021, when he left the UK in protest over Brexit. He is now a professor at the International Research Center for Japanese Studies (Nichibunken) in Kyoto.\nScreech is a specialist in the art and culture of early modern Japan.\nIn 1985, Screech received a BA in Oriental Studies (Japanese) at the University of Oxford. In 1991, he completed his PhD in art history at Harvard University. As well as his permanent posts, he has been visiting professor at the University of Chicago, Heidelberg University, and Tokyo University of Foreign Studies and guest researcher at Gakushuin University and Waseda University in Japan, and at Yale, Berkeley and UCLA in the USA. His main current research project is related to the deification of the first Tokugawa shogun, Ieyasu, in 1616-17, and his cult as the Great Avatar.\nIn July 2018 Screech was elected a Fellow of the British Academy (FBA).\nScreech’s work had been translated into Chinese (Taiwan and PRC), French, German, Japanese, Korean, Polish and Romanian.\nHis leisure interests are aleurophilia, learning Burmese, and cultivating the former Kingdom of the Ryukyus.", "link_mentions": [{"page": "Ukiyo-e", "response": ["Traditional Japanese religions do not consider sex or pornography a moral corruption in the sense of most Abrahamic faiths, and until the changing morals of the Meiji era led to its suppression, shunga erotic prints were a major genre. While the Tokugawa regime subjected Japan to strict censorship laws, pornography was not considered an important offence and generally met with the censors' approval. Many of these prints displayed a high level a draughtsmanship, and often humour, in their explicit depictions of bedroom scenes, voyeurs, and oversized anatomy. As with depictions of courtesans, these images were closely tied to entertainments of the pleasure quarters. Nearly every ukiyo-e master produced shunga at some point. Records of societal acceptance of shunga are absent, though Timon Screech posits that there were almost certainly some concerns over the matter, and that its level of acceptability has been exaggerated by later collectors, especially in the West."]}, {"page": "Timon", "response": ["* Timon Screech, British art historian"]}]}}