{"wiki_id": "http://www.wikidata.org/entity/Q24455609", "itemLabel": "Carla Humphrey", "itemDescription": "British association football player (born 1996)", "wikipedia_url": "https://en.wikipedia.org/wiki/Carla_Humphrey", "wikipedia_page": {"main": "Carla Humphrey (born 15 December 1996) is an English footballer who plays as a midfielder for Liverpool.", "link_mentions": [{"page": "Doncaster Rovers Belles L.F.C.", "response": ["In February 2016, eight players signed as full-time players for the first time in the club's history: Emily Simpkins, Rhiannon Roberts, Courtney Sweetman-Kirk, Natasha Dowie, Becky Easton, Katrin Omarsdottir, Kasia Lipka and Carla Humphrey."]}, {"page": "Katie Zelem", "response": ["On 12 October 2014, Zelem was an unused substitute in Liverpool's win against Bristol City, as they retained the FA WSL title after a dramatic final day of the season. In November 2014, Zelem was nominated by The FA for the WSL Development Player of the Year, alongside Carla Humphrey and Natasha Baptiste. In the same month, Zelem was named Liverpool's Young Player of the Year. Liverpool coach Matt Beard praised Zelem, likening her to Frank Lampard and stating she has great career in the future. In December, Zelem signed a new contract."]}, {"page": "The FA Women's Football Awards", "response": ["|Carla Humphrey"]}, {"page": "2016–17 Arsenal L.F.C. season", "response": ["|Carla Humphrey"]}, {"page": "Arsenal W.F.C. Academy", "response": ["Arsenal Women's Football Club's Academy is the footballing team of the club's younger female players. The academy operates for girls from 9 to 17 years old. Players such as Alex Scott, Chloe Kelly, Vyan Sampson and Carla Humphrey have ascended from the academy."]}, {"page": "2017–18 Arsenal W.F.C. season", "response": ["| Carla Humphrey"]}, {"page": "2019–20 Bristol City W.F.C. season", "response": ["| align=\"left\" | Carla Humphrey"]}, {"page": "Arsenal Women 11–1 Bristol City Women", "response": ["|CM ||8 ||Carla Humphrey"]}, {"page": "2021 FA Women's League Cup Final", "response": ["For the quarter-finals, Bristol City were drawn against a top-flight team for the first time in the competition in the shape of Aston Villa who had earned promotion the previous season and transitioned to a fully-professional team for the first time as a result. They had finished top of a group that, like Bristol's, had contained three second division teams. At the time of the match, Aston Villa were 11th in the WSL having taken six points from eight games, four points ahead of Bristol. Despite missing three key first-team players; goalkeeper Sophie Baggaley and midfielder Carla Humphrey who were positive for COVID-19 and defender Jemma Purfield who was deemed a close contact, Bristol put in one of their most resilient performances of the season. After a goalless first half, Ebony Salmon broke the deadlock against her former club with two breakaway goals before the hour mark. Aston Villa's persistence eventually paid off as substitute Stine Larsen found a way past Benedicte Håland, the stand-in goalkeeper making her first appearance for the club, in the 86th-minute but it was too little too late as the hosts hung on for a 2–1 win. In the semi-final, Bristol faced Championship leaders Leicester City who had turned professional during the offseason and were in the knockout stage of the League Cup for the first time. Bristol City, in their third week of interim management under Matt Beard after Tanya Oxtoby had stepped down to take maternity leave, came into the game off the back of their first WSL win of the season, a convincing 3–0 victory over fellow strugglers Brighton & Hove Albion. A tightly-contested match, Bristol edged past their lower league opposition 1–0 courtesy of a first senior career goal for Kiera Skeels who had joined the club on loan from Reading six days earlier.", "|MF ||8|| Carla Humphrey   ||            || "]}]}}