{"wiki_id": "http://www.wikidata.org/entity/Q2443399", "itemLabel": "Clement Deykin", "itemDescription": "British rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Clement_Deykin", "wikipedia_page": {"main": "Clement Pemberton Deykin (1 October 1877 – 14 March 1969) was a British rugby union player who competed in the 1900 Summer Olympics. He was born in Lapley, Staffordshire, and played for Moseley Wanderers RFC. He was a member of the British rugby union team, which won the silver medal.", "link_mentions": [{"page": "Rugby union at the 1900 Summer Olympics", "response": ["* Clement Deykin"]}, {"page": "Moseley Wanderers", "response": ["Neither of the reports mention the Olympics with the Evening Gazette reporting on the English Union rather than British team and it is unclear whether the players even realized they were competing in the Olympics. However it is clear that fatigue was probably a major contributor to the defeat. At least five of the players are believed to have played for their respective clubs, in England, the day before the game. For example, it is recorded that Clement Deykin represented the Midland Counties on the 24 October, Moseley on 27 October, made the trip to Paris overnight, and then played for the Wanderers the next day.", "* Clement Deykin Moseley"]}, {"page": "Lapley", "response": ["* Clement Deykin (1877 in Lapley – 1969) a British rugby union player who competed in the 1900 Summer Olympics as a member of the British rugby union team which won the silver medal. He played for Moseley Wanderers RFC."]}, {"page": "List of 1900 Summer Olympics medal winners", "response": ["F. C. BaylissJ. Henry BirtlesJames CantionArthur DarbyClement DeykinL. HoodM. L. LoganHerbert LoveittHerbert NicolV. SmithM. W. TalbotJoseph WallisClaude WhittindaleRaymond WhittindaleFrancis Wilson"]}, {"page": "Deykin", "response": ["#REDIRECT Clement Deykin"]}, {"page": "List of Olympic medalists in rugby", "response": ["F. C. BaylissJ. Henry BirtlesJames CantionArthur DarbyClement DeykinL. HoodM. L. LoganHerbert LoveittHerbert NicolV. SmithM. W. TalbotJoseph WallisClaude WhittindaleRaymond WhittindaleFrancis Wilson"]}]}}