{"wiki_id": "http://www.wikidata.org/entity/Q2448340", "itemLabel": "Reginald Gardiner", "itemDescription": "actor (1903-1980)", "wikipedia_url": "https://en.wikipedia.org/wiki/Reginald_Gardiner", "wikipedia_page": {"main": "William Reginald Gardiner (27 February 1903 – 7 July 1980) was an English actor on the stage, in films and on television.", "link_mentions": [{"page": "February 27", "response": ["*1903 – Reginald Gardiner, English-American actor and singer (d. 1980)"]}, {"page": "The Great Dictator", "response": ["On the Western Front in 1918, a Jewish Private (Charlie Chaplin) fighting for the Central Powers nation of TomainiaThe spelling of the country's name is derived from the numerous local newspapers flashed onscreen between 14 and 15 minutes into the film that indicate the end of World War I, such as The Tomainian past, thus establishing the proper spelling. valiantly saves the life of a wounded pilot, Commander Schultz (Reginald Gardiner), who carries valuable documents that could secure a Tomainian victory. However, after running out of fuel, their plane crashes into a tree and the Private subsequently suffers memory loss. Upon being rescued, Schultz is informed that Tomainia has officially surrendered to the Allied Forces, while the Private is carried off to a hospital.", "* Reginald Gardiner as Commander Schultz, a Tomainian who fought in World War I, who commands soldiers in the 1930s. He has his troops abstain from attacking Jews, but is arrested by Hynkel, after which he becomes a loyal ally to the Barber. He later leads the invasion of Osterlich and helps the Barber pretend to be Adenoid Hynkel in his (successful) attempt at saving Osterlich."]}, {"page": "Greer Garson", "response": ["Greer was a special guest on an episode of the TV series Father Knows Best, playing herself. On 4 October 1956, Garson appeared with Reginald Gardiner as the first two guest stars of the series in the premiere of NBC's The Ford Show, Starring Tennessee Ernie Ford. She appeared as a mystery guest on What's My Line on 25 October 1953 and again on 6 April 1958 to promote her appearance on stage in Auntie Mame. She also served as a panelist rather than a guest on the What's My Line episode which aired on 12 May 1957.Archived at Ghostarchive and the Wayback Machine: "]}, {"page": "Laura (1944 film)", "response": ["Fox casting director Rufus LeMaire and Zanuck both objected to Webb because of his effeminate mannerisms, which were exactly what Preminger felt suited the character. Preminger filmed the actor delivering a monologue from the Coward play, and Zanuck agreed that Webb was perfect for the role. Zanuck was similarly campaigning for actor Reginald Gardiner to play the role of Shelby, though Fox contractee Vincent Price finally got the role."]}, {"page": "Suspense (radio drama)", "response": ["| September 7  || Voyage Through Darkness || Olivia de Havilland and Reginald Gardiner "]}, {"page": "1980 in film", "response": ["| style=\"text-align:center;\"| 7 || Reginald Gardiner || style=\"text-align:center;\"| 77 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "Harold Lloyd", "response": ["The Old Gold Comedy Theater ended in June 1945 with an adaptation of Tom, Dick and Harry, featuring June Allyson and Reginald Gardiner and was not renewed for the following season. Many years later, acetate discs of 29 of the shows were discovered in Lloyd's home, and they now circulate among old-time radio collectors."]}, {"page": "The Lodger: A Story of the London Fog", "response": ["*Reginald Gardiner as Dancer at Ball (uncredited)"]}, {"page": "Laramie (TV series)", "response": ["* Reginald Gardiner"]}, {"page": "The Arthur Murray Party", "response": ["* Second half of 60-minute DuMont show with Reginald Gardiner and Lily Ann Carol (October 22, 1950) at Internet Archive"]}, {"page": "Green Acres", "response": ["During its six-season run, many familiar actors guest-starred on the show, along with other lesser-known performers who later achieved stardom, among them John Daly, Elaine Joyce, Gary Dubin, Herbert Anderson, June Foray, Bob Cummings, Sam Edwards, Jerry Van Dyke, J. Pat O'Malley, Johnny Whitaker, Jesse White, Al Lewis, Gordon Jump, Bernie Kopell, Len Lesser, Bob Hastings, Don Keefer, Don Porter, Alan Hale, Melody Patterson, Rusty Hamer, Regis Toomey, Heather North, Allan Melvin, Parley Baer, Jack Bannon, Reginald Gardiner, Rick Lenz, Al Molinaro, Pat Morita, and Rich Little in a cameo as himself."]}, {"page": "Mr. Belvedere", "response": ["As early as the 1950s, attempts were made to adapt the character to television. Three pilots for a proposed series based on the Belvedere character were made during the 1950s and 1960s, a 1956 attempt starring Reginald Gardiner, a 1959 effort with Hans Conried, and a 1965 version starring Victor Buono in the title role. All efforts, however, were unsuccessful until 1985, when ABC picked up Mr. Belvedere to series to serve as a mid-season replacement, with British actor Christopher Hewett playing Lynn Belvedere."]}, {"page": "Train (disambiguation)", "response": ["* \"Trains\", a monologue by Reginald Gardiner"]}, {"page": "Marie Antoinette (1938 film)", "response": ["* Reginald Gardiner as Comte d'Artois"]}, {"page": "What a Way to Go!", "response": ["* Reginald Gardiner as mad painter brushing everything in Pinky's palace pink, including rabbits and Louisa"]}, {"page": "John Payne (actor)", "response": ["Payne toured with several Shubert Brothers shows, and frequently sang on New York City-based radio programs.  On Broadway he appeared in the revue At Home Abroad (1935–36) alongside Ethel Waters, Eleanor Powell and Beatrice Lillie. He understudied for Reginald Gardiner and took over one night. He was seen by Fred Kohlmar of Sam Goldwyn's company and was offered a movie contract."]}, {"page": "A Yank in the R.A.F.", "response": ["He decides to enlist in the Royal Air Force (RAF). Meanwhile, Brown attracts the appreciative attention of two RAF officers, Wing Commander John Morley (John Sutton) and Flying Officer Roger Pillby (Reginald Gardiner). Morley persists in seeing Brown, despite being told at the outset that there is another man. Pillby is unable to persuade either Baker or Morley to introduce him.", "* Reginald Gardiner as Flying Officer Roger Pillby"]}, {"page": "Mr. Hobbs Takes a Vacation", "response": ["* Reginald Gardiner as Reggie McHugh"]}, {"page": "A Damsel in Distress (1937 film)", "response": ["Jerry is incorrectly led to believe that he is the American that Lady Alyce is in love with. He goes to the castle, encouraged by Albert but discouraged by Keggs (Reginald Gardiner), a scheming butler whose money is on another beau. The closest Jerry can get to Lady Alyce is a castle tour, at least until Albert can sneak him upstairs.", "* Reginald Gardiner as Keggs"]}, {"page": "List of caricatures at Sardi's", "response": ["* Reginald Gardiner by Alex Gard"]}, {"page": "The Horn Blows at Midnight", "response": ["When he is deposited at the Hotel Universe via the building's elevator, he accidentally foils a robbery attempt by suave guest Archie Dexter (Reginald Gardiner) and his girlfriend accomplice, Fran Blackstone (Dolores Moran). Dexter blames Fran and breaks off their relationship. When Athanael prevents her attempt at suicide from the hotel's roof, he misses the deadline. Elizabeth persuades her boss to give him a second chance, and travels to Earth to inform him.", "* Reginald Gardiner as Composer / Archie Dexter"]}, {"page": "A Damsel in Distress (novel)", "response": ["In 1928, Wodehouse collaborated with Ian Hay in adapting the book for the stage. Hay, Wodehouse, and A. A. Milne invested in the production, about which Wodehouse said \"I don't think we shall lose our money, as Ian has done an awfully good job.\" The play, which opened at the New Theatre, London, on 13 August 1928, had a successful run of 234 performances. It was produced by Nicholas Hannen, and starred Basil Foster, Jane Baxter, and Reginald Gardiner.McIlvaine (1990), p. 305, J38."]}, {"page": "Born to Dance", "response": ["* Reginald Gardiner as Conducting Central Park Policeman", "**Mock conducted by Reginald Gardiner as the Central Park Policeman, who spoofs conductor Leopold Stokowski, incorporating his long hair and dramatic gestures"]}, {"page": "The Flying Deuces", "response": ["While the boys are vacationing  in Paris from working in a fish market in Des Moines, Ollie falls in love with Georgette (Jean Parker), the beautiful daughter of an innkeeper. She turns down his marriage proposal because she is married to a Foreign Legion officer named Francois (Reginald Gardiner). Heartbroken, Ollie contemplates suicide. He is joined by his friend Stan in sinking himself into a river. (In some versions this proceeding is complicated by the presence of an \"escaped shark\".) Stan repeatedly interrupts Ollie as he is about to throw the weight in, and asks him to consider the possibility of reincarnation. Ollie decides his preference is to be reincarnated as a horse. Francois catches sight of them and convinces them to enlist in the Foreign Legion in order to forget Ollie's failed romance (little does Francois know that his wife was the object of Ollie's obsession). When Stan asks how long it will take Ollie to forget, Francois says it will only take a matter of a few days.", "| Reginald Gardiner ||   Francois   "]}, {"page": "The Story of Mankind (film)", "response": ["* Reginald Gardiner as William Shakespeare"]}, {"page": "Gardiner (surname)", "response": ["* Reginald Gardiner (1903–1980), English actor"]}, {"page": "1980 in the United Kingdom", "response": ["* 7 July – Reginald Gardiner, actor (born 1903)  "]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Reginald Gardiner (Acting Diploma 1924)"]}, {"page": "The Birds and the Bees (film)", "response": ["George \"Hotsy\" Hamilton (George Gobel), a very eligible but naive vegetarian heir to a meat-packing fortune, returns home to Connecticut by luxury cruise ship, accompanied by Marty Kennedy (Harry Bellaver), his valet, guardian and best friend, after spending three years together on a scientific expedition in the Belgian Congo looking for a rare snake.  On board, the woman-shy George attracts a lot of attention from the opposite sex, despite being the consummate milquetoast, but the one he cannot avoid is Jean Harris (Mitzi Gaynor), a beautiful con artist travelling with her equally larcenous father, Colonel Patrick Henry \"Handsome Harry\" Harris (David Niven), and his partner-in-crime Gerald (Reginald Gardiner).", "*Reginald Gardiner as Gerald"]}, {"page": "Captains of the Clouds", "response": ["The film stars James Cagney and Dennis Morgan as Canadian pilots who do their part in the Second World War, and features Brenda Marshall, Alan Hale Sr., George Tobias, Reginald Gardiner, and Reginald Denny in supporting roles. The title of the film came from a phrase used by Billy Bishop, the First World War fighter ace, who played himself in the film.Mackey, Doug. \"North Bay's Big Movie - Captains of the Clouds 1941.\" pastforward.ca, August 29, 2003. The same words are also echoed in the narration of The Lion Has Wings documentary (1939).", "| Reginald Gardiner || Scrounger Harris"]}, {"page": "Rock-A-Bye Baby (film)", "response": ["Rock-A-Bye Baby is a 1958 American musical comedy film starring Jerry Lewis. A loose remake of Preston Sturges' film The Miracle of Morgan's Creek (1944), the film was directed and written by Frank Tashlin, and features Marilyn Maxwell, Connie Stevens and Reginald Gardiner.", "*Reginald Gardiner as Harold Hermann"]}, {"page": "Androcles and the Lion (1952 film)", "response": ["* Reginald Gardiner as Lentulus"]}, {"page": "Christmas in Connecticut", "response": ["Elizabeth Lane (Barbara Stanwyck) is a single New Yorker, employed as a food writer. Her articles about her fictitious Connecticut farm, husband, and baby are admired by housewives across the country. Her publisher, Alexander Yardley (Sydney Greenstreet), is unaware of the charade and insists that Elizabeth host a Christmas dinner for returning war hero Jefferson Jones (Dennis Morgan), who read all of her recipes while in the hospital and is so fond of her that his nurse, Mary Lee (Joyce Compton), wrote a letter to the publisher. Facing a career-ending scandal, not only for herself but for her editor, Dudley Beecham (Robert Shayne), Lane is forced to comply. In desperation, Elizabeth agrees to marry her friend, John Sloan (Reginald Gardiner), who has a farm in Connecticut.  She also enlists the help of her chef friend and \"honorary uncle\" Felix Bassenak (S. Z. Sakall), who has been providing her with the recipes for her articles.", "* Reginald Gardiner as John Sloan", "Principal photography took place from late May to late July 1944. Bette Davis was originally announced in February 1944 as the female lead for the film, but was replaced by Stanwyck in April.  Stanwyck's suitor, played in the film by Reginald Gardiner, was originally to have been played by John Alexander.  Sydney Greenstreet and director Peter Godfrey kept the cast amused on the set during filming.Mankiewicz, Ben (November 24, 2021) Intro to Turner Classic Movies showing Edith Head designed Barbara Stanwyck's gowns for the film and Milo Anderson designed additional gowns. Christmas in Connecticut timestamp 00:43  "]}, {"page": "The 20th Century Fox Hour", "response": ["| 14 || \"Mr. Belvedere\" || April 18, 1956 || Reginald Gardiner, Eddie Bracken, Zasu Pitts"]}, {"page": "Everybody Sing (1938 film)", "response": ["*Reginald Gardiner as Jerrold Hope"]}, {"page": "Halls of Montezuma (film)", "response": ["* Reginald Gardiner as Sgt. Johnson"]}, {"page": "Sweethearts (1938 film)", "response": ["Broadway stars Gwen Marlowe (Jeanette MacDonald) and Ernest Lane (Nelson Eddy) are appearing in a 6-year run of  Victor Herbert's operetta Sweethearts (Ray Bolger dances the role of  Hans). They are also very much in love after six years of marriage. Norman Trumpett (Reginald Gardiner) is a successful Hollywood talent scout under pressure to recruit Marlowe and Lane for his studio, which their Broadway producer Felix Lehman (Frank Morgan) is equally determined to prevent.", "* Reginald Gardiner as Norman Trumpett"]}, {"page": "List of American films of 1945", "response": ["| Christmas in Connecticut || Peter Godfrey || Barbara Stanwyck, Dennis Morgan, Reginald Gardiner, Sydney Greenstreet || Comedy || Warner Bros.; Remake of 1992 film"]}, {"page": "List of American films of 1962", "response": ["|Mr. Hobbs Takes a Vacation||Henry Koster || James Stewart, Maureen O'Hara, Fabian, Reginald Gardiner, Marie Wilson, John McGiver || Comedy||Fox"]}, {"page": "Back Street (1961 film)", "response": ["* Reginald Gardiner as Dalian "]}, {"page": "Cluny Brown", "response": ["*Reginald Gardiner as Hilary Ames"]}]}}