{"wiki_id": "http://www.wikidata.org/entity/Q2446852", "itemLabel": "John Thaw", "itemDescription": "actor from England (1942-2002)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Thaw", "wikipedia_page": {"main": "John Edward Thaw,  (3 January 1942 – 21 February 2002) was an English actor who appeared in a range of television, stage, and cinema roles. He starred in the television series Inspector Morse as title character Detective Chief Inspector Endeavour Morse, Redcap as Sergeant John Mann, The Sweeney as Detective Inspector Jack Regan, Home to Roost as Henry Willows, and Kavanagh QC as title character James Kavanagh.", "link_mentions": [{"page": "February 21", "response": ["*2002 – John Thaw, English actor and producer (b. 1942)"]}, {"page": "Inspector Morse", "response": ["Detective Chief Inspector Endeavour Morse, GM, is the eponymous fictional character in the series of detective novels by British author Colin Dexter. On television, he appears in the 33-episode drama series Inspector Morse (1987–2000), in which John Thaw played the character, as well as the (2012–) prequel series Endeavour, portrayed by Shaun Evans. The older Morse is a senior CID (Criminal Investigation Department) officer with the Thames Valley Police in Oxford in England and, in the prequel, Morse is a young detective constable rising through the ranks with the Oxford City Police and in later series the Thames Valley Police.", "Morse is ostensibly the embodiment of white, male, middle-class Englishness, with a set of prejudices and assumptions to match (even though as the son of a taxi driver his background was thoroughly working class). As a result, he may be considered a late example of the gentleman detective, a staple of British detective fiction. This is in sharp contrast to the working-class lifestyle of his assistant Lewis (named after another rival clue-writer, Mrs. B. Lewis); in the novels, Lewis is Welsh, but in the TV series this is altered to a Tyneside (Geordie) background, appropriately for the actor Kevin Whately. Morse is in his forties at the start of the books (Service of all the Dead, Chapter Six: \"… a bachelor still, forty-seven years old …\"), and Lewis slightly younger (e.g. The Secret of Annexe 3, Chapter Twenty-Six: \"a slightly younger man – another policeman, and one also in plain clothes\"). John Thaw was 45 at the beginning of shooting the TV series and Kevin Whately was 36."]}, {"page": "January 3", "response": ["*  1942   – John Thaw, English actor and producer, played Inspector Morse (d. 2002)"]}, {"page": "1970s", "response": ["* John Thaw"]}, {"page": "1942", "response": ["** John Thaw, English actor (d. 2002)"]}, {"page": "2002", "response": ["* February 21 – John Thaw, English actor (b. 1942)"]}, {"page": "Southwold", "response": ["The town and its vicinity has been used as the setting for numerous films and television programmes, including Iris about the life of Iris Murdoch starring Judi Dench, Drowning by Numbers by Peter Greenaway, Kavanagh QC starring John Thaw, East of Ipswich by Michael Palin, Little Britain with Matt Lucas and David Walliams, and a 1969 version of David Copperfield."]}, {"page": "Hubert de Burgh, 1st Earl of Kent", "response": ["Hubert is a character in Shakespeare's play King John. On screen, he has been portrayed by Franklyn McLeay in the silent short King John (1899) which recreates John's death scene; by Jonathan Adams in the BBC TV drama series The Devil's Crown (1978); and by John Thaw in the BBC Shakespeare version of The Life and Death of King John (1984). The story of his daughter's marriage is told in Edith Pargeter's novel The Marriage of Meggotta (1979)."]}, {"page": "Queen's Counsel", "response": ["* Kavanagh QC, a 1995-2001 ITV legal drama starring John Thaw."]}]}}