{"wiki_id": "http://www.wikidata.org/entity/Q24572562", "itemLabel": "Alison Di Rollo", "itemDescription": "British lawyer", "wikipedia_url": "https://en.wikipedia.org/wiki/Alison_Di_Rollo", "wikipedia_page": {"main": "Alison Di Rollo QC (née Lafferty) was the Solicitor General for Scotland from 2016 to 2021. She was nominated for the post by Scottish First Minister, Nicola Sturgeon on 31 May 2016 as part of the formation of the Second Sturgeon government, following the 2016 Scottish Parliament election. Her nomination was confirmed by the Scottish Parliament on 1 June 2016.", "link_mentions": [{"page": "Solicitor General for Scotland", "response": ["*2016: Alison Di Rollo"]}, {"page": "Hutchesons' Grammar School", "response": ["*Alison Di Rollo – Solicitor General for Scotland"]}, {"page": "James Wolffe", "response": ["In 2020, Wolffe informed the Scottish Government of his intention to step down as Scotland's Lord Advocate after the May 2021 Scottish Parliament election. Prior to Nicola Sturgeon's re-election as First Minister, it was confirmed that both Wolffe and Solicitor General Alison Di Rollo, would resign as Scotland's law officers."]}, {"page": "2016 in Scotland", "response": ["* Solicitor General for Scotland – Lesley Thomson; then, from 1 June 2016, Alison Di Rollo"]}, {"page": "Second Sturgeon government", "response": ["In the May 2016 Scottish Parliament election, the Scottish National Party (SNP) won 63 of the 129 seats contested. Incumbent First Minister Nicola Sturgeon soon afterwards announced her intention to form a minority government. She was nominated for the post of first minister by a vote of the Scottish Parliament on 17 May, defeating Scottish Liberal Democrat leader, Willie Rennie by 63 votes to 5, with 59 abstentions. Ahead of the formation of the new government, long-serving ministers Alex Neil and Richard Lochhead announced their resignations from the cabinet. Sturgeon recommended the appointment of James Wolffe as Lord Advocate and Alison Di Rollo as Solicitor General on 31 May 2016. Their recommendation was confirmed by the Scottish Parliament on the same day.", "|Alison Di Rollo  "]}, {"page": "2017 in Scotland", "response": ["* Solicitor General for Scotland – Alison Di Rollo"]}, {"page": "List of female justice ministers", "response": ["|Alison Di RolloSolicitor General for Scotland"]}, {"page": "2018 in Scotland", "response": ["* Solicitor General for Scotland – Alison Di Rollo"]}, {"page": "Third Sturgeon government", "response": ["Shortly after being elected, Sturgeon re-appointed John Swinney as Deputy First Minister of Scotland and also appointed him the newly created Cabinet Secretary for Covid Recovery post. Humza Yousaf, Kate Forbes, Shirley-Anne Somerville and Michael Matheson all remained in government. Shona Robison and Keith Brown made a return to cabinet, having previously served in Sturgeon's governments. Only Mairi Gougeon and Angus Robertson were new to government. The Scottish Parliament confirmed the appointment of ministers and junior ministers on 20 May.In May 2021, both the Lord Advocate, James Wolffe, and Solicitor General for Scotland, Alison Di Rollo, announced their intention to step down as Scotland's top law officers. On 17 June, Sturgeon nominated Dorothy Bain QC  to serve as Lord Advocate and Ruth Charteris QC to serve as Solicitor General. This is the first time in history both posts have been held by women."]}]}}