{"wiki_id": "http://www.wikidata.org/entity/Q2450532", "itemLabel": "Raymond Francis", "itemDescription": "actor (1911-1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Raymond_Francis", "wikipedia_page": {"main": "Raymond Francis (6 October 1911- 24 October 1987) was a British actor best known for his role as Detective Chief Superintendent Tom Lockhart in the Associated-Rediffusion detective series Murder Bag, Crime Sheet and No Hiding Place. He played the role of Lockhart in these series from 1956 to 1967, and the character was one of the first recurring television detectives.", "link_mentions": [{"page": "The Adventure of the Empty House", "response": ["The story was adapted for a 1951 TV episode of We Present Alan Wheatley as Mr Sherlock Holmes in... starring Alan Wheatley as Holmes, Raymond Francis as Dr. Watson and Bill Owen as Inspector Lestrade. The episode is now lost."]}, {"page": "A Scandal in Bohemia", "response": ["The story was adapted for a 1951 TV episode of We Present Alan Wheatley as Mr Sherlock Holmes in... starring Alan Wheatley as Holmes, Raymond Francis as Dr. Watson and Olga Edwardes as Irene Adler."]}, {"page": "Carrington V.C. (film)", "response": ["Carrington V.C. is a 1954 legal drama released by Kingsley-International Pictures starring David Niven and Margaret Leighton. Others in the cast include Noelle Middleton, Allan Cuthbertson, Victor Maddern, Raymond Francis, Michael Bates, Laurence Naismith, Geoffrey Keen and Maurice Denham.", "* Raymond Francis as Major Jim Mitchell"]}, {"page": "Reach for the Sky", "response": ["* Raymond Francis as Wing Commander Hargreaves"]}, {"page": "The Adventure of the Dying Detective", "response": ["* A 1951 TV episode of We Present Alan Wheatley as Mr Sherlock Holmes in... was adapted from the story, starring Alan Wheatley as Holmes, Raymond Francis as Dr. Watson and Bill Owen as Inspector Lestrade. The episode is now lost."]}, {"page": "Adaptations of Sherlock Holmes", "response": ["One of the earliest television appearances was the 1951 BBC mini series Sherlock Holmes starring Alan Wheatley as Holmes and Raymond Francis as Watson."]}, {"page": "Fiddlers Three (play)", "response": ["*Raymond Francis"]}, {"page": "No Hiding Place", "response": ["It was the sequel to the series Murder Bag (1957–1958) and Crime Sheet (1959), all starring Raymond Francis as Detective Superintendent, later Detective Chief Superintendent Tom Lockhart.", "No Hiding Place carried on from where the TV series Murder Bag and Crime Sheet left off. Murder Bag featured 55 episodes. 30 in Season One (16 September 1957 to 31 March 1958), all untitled (having case numbers, and were listed a Murder Bag - case One, etc) The Penguin TV Companion by Jeff Evans, page 416 and 25 in Season Two (30 June 1958 to 1 April 1959), all titled, and all featuring the word \"Lockhart\" as the first word of their title. Half-hour detective series that introduced viewers to the snuff-taking as Detective Superintendent Lockhart, played by Raymond Francis. It was created by Glyn Davies, Produced by Barry Baker and written by Barry Baker and Peter Ling Backup sergeants and others changed regularly. The murder bag in the title carried 42 items which were needed in the investigation of a crime. The show was produced live in the studio. According to IMDb there were 29 episodes in series one and 40 in series two.", "In Crime Sheet, Lockhart had now been promoted to Detective Chief Superintendent.The Penguin TV Companion by Jeff Evans, page 148 The writers of the series revealed to the TV Times in 1962 that Lockhart could not be promoted above this rank, as he would no longer be expected to visit the crime scene, thus hindering the potential of the storylines. 17 episodes (23 episodes according to IMDb) of 30 minutes were produced from 8 April 1959 to 9 September 1959. Due to Raymond Francis contracting mumps, the final episode of Crime Sheet did not feature Lockhart but Chief Superintendent Carr, played by Gerald Case.", "| Raymond Francis || Tom Lockhart"]}, {"page": "Five Go Mad in Dorset", "response": ["*Police Inspector – Raymond Francis"]}, {"page": "Above Us the Waves", "response": ["*Raymond Francis as Officer on towing submarine"]}, {"page": "Clive Francis", "response": ["Francis was born in Eastbourne, Sussex. He is the son of actors Raymond Francis and Margaret Towner."]}, {"page": "Miss Marple (TV series)", "response": ["|Gwen Watford, Moray Watson, Trudie Styler, Jess Conrad, Ciaran Madden, Keith Drinkel, Debbie Arnold, Frederick Jaeger, Valentine Dyall, Raymond Francis, David Horovitch, Anthony Smee, Andrew Cruickshank, Hugh Walters, Arthur Bostrom, Stephen Churchett, John Moffatt"]}, {"page": "Shaw Theatre", "response": ["Before being refurbished in 1998, the Shaw Theatre originally opened its doors in 1971 as a purpose built theatre within the St Pancras library. The opening production was the show Zigger Zagger with a cast that included Barrie Rutter and Paula Wilcox. In 1972, Simon Ward and Sinéad Cusack appeared in Romeo and Juliet. Later in the same year Vanessa Redgrave, Nyree Dawn Porter and Windsor Davies starred in Twelfth Night. Other stars who appeared in the theatre's early days included Ian McKellen, Mia Farrow, Julia McKenzie and Raymond Francis. The theatre hosted a series of 'Sunday nights at the Shaw', with many notable actors including Judi Dench, Dame Flora Robson, Patricia Routledge and Michael Williams. It also hosted numerous productions by the National Youth Theatre."]}, {"page": "It Shouldn't Happen to a Vet", "response": ["* Raymond Francis as Colonel Bosworth"]}, {"page": "Storm Over the Nile", "response": ["* Raymond Francis as the Colonel's aide"]}, {"page": "The Man in the Sky", "response": ["*Raymond Francis as Jenkins"]}, {"page": "List of fictional police detectives", "response": ["* Detective Superintendent Tom Lockhart (later Detective Chief Superintendent) – (played by Raymond Francis in No Hiding Place)"]}, {"page": "The Steel Bayonet", "response": ["* Raymond Francis as General"]}, {"page": "Bedtime Stories (1974 TV series)", "response": ["*Raymond Francis as Harry"]}, {"page": "Just My Luck (1957 film)", "response": ["* Raymond Francis as Ritchie "]}, {"page": "Dickens of London", "response": ["*Raymond Francis as Mr. Beadnell"]}, {"page": "The Case of Marcel Duchamp", "response": ["The Case of Marcel Duchamp is a 1984 British mystery film directed by David Rowan and starring Guy Rolfe, Raymond Francis, Harold Innocent and Juliet Hammond. Sherlock Holmes and Doctor Watson come out of retirement to solve a final case concerning the artist Marcel Duchamp.BFI.org", "* Raymond Francis - Dr. Watson "]}, {"page": "The Body in the Library (film)", "response": ["*Raymond Francis as Sir Henry Clithering  "]}, {"page": "Gabrielle Brune", "response": ["In 1938, Brune was described as \"Mrs. G. M. Thompson, wife of an English actor\" in a news report about her first professional trip to America: (NB: Raymond Francis).Frank Reil, \"Line on Liners\" Brookyn Daily Eagle (20 April 1938): 23. via Newspapers.com In 1942, she married an American Army officer, Maj. Walter J. Currie, in London.\"Wed in England\" Advocate-Messenger (28 June 1942): 1. via Newspapers.com\"Informally at Home: Gabrielle Brune, Actress Wife of Lieut.-Colonel Walter Currie, U. S. Army\" The Tatler and Bystander (15 March 1944): 327."]}, {"page": "Sherlock Holmes (1951 TV series)", "response": ["Sherlock Holmes (also known as We Present Alan Wheatley as Mr. Sherlock Holmes in...) is a British mystery television series that was produced by the BBC featuring Alan Wheatley as Sherlock Holmes and Raymond Francis as Dr. Watson. This was the first series of Sherlock Holmes stories adapted for television.", "* Raymond Francis as Dr. Watson (6 episodes)"]}, {"page": "Olga Edwardes", "response": ["| colspan=2                  | Raymond Francis"]}, {"page": "The Deep Blue Sea (1954 TV play)", "response": ["*Raymond Francis as Jackie Jackson"]}, {"page": "Together (1980 TV series)", "response": ["*Raymond Francis as Edward Fuller"]}, {"page": "Margaret Towner (actress)", "response": ["Her first professional theatre role after graduating from RADA was in a touring stage production of \"The Bare Idea\", a play about a nudist camp written by Gordon Sherry. She toured with the cast of \"The Bare Idea\" until nightly German Luftwaffe bombing raids on Southampton ended the production around 1940. Shortly after the show's cancellation, she then joined the Entertainments National Service Association's (ENSA) touring stage production of \"The Amazing Dr. Clitterhouse\" during World War II, where she met her future husband, actor Raymond Francis. The couple married and had three children, Caroline, Frances and Clive. Towner \"reluctantly\" retired from acting for more than thirty years to raise her family. Francis became best known for his role of Superintendent Lockhart on the ITV series, No Hiding Place, during the 1950s and 1960s.", "Towner died on 10 April 2017 at the age of 96. She was survived by three children: two daughters and one son, actor Clive Francis. Her late husband, actor Raymond Francis, died in 1987."]}, {"page": "List of actors who have played Dr. Watson", "response": ["| Raymond Francis"]}, {"page": "Four Winds (play)", "response": ["It premiered at the Theatre Royal, Brighton before transferring to the Phoenix Theatre in London's West where it ran for 38 performances between 29 September and 31 October 1953. The original cast included William Kendall, Frank Lawton, Raymond Francis, Peggy Evans, Betty Ann Davies and Patricia Cutts.Wearing p.257 It then went on tour."]}]}}