{"wiki_id": "http://www.wikidata.org/entity/Q24572773", "itemLabel": "Alice Rogers", "itemDescription": "Emeritus professor of mathematics at King's College London", "wikipedia_url": "https://en.wikipedia.org/wiki/Alice_Rogers", "wikipedia_page": {"main": "Frances Alice Rogers  is a British mathematician and mathematical physicist. She is an emeritus professor of mathematics at King's College London.", "link_mentions": [{"page": "Superspace", "response": ["Superspace is also commonly used as a synonym for the super vector space. This is taken to be an ordinary vector space, together with additional coordinates taken from the Grassmann algebra, i.e. coordinate directions that are Grassmann numbers.  There are several conventions for constructing a super vector space in use; two of these are described by RogersAlice Rogers, Supermanifolds: Theory and Applications, World Scientific (2007) . and DeWitt.Bryce DeWitt, Supermanifolds, Cambridge University Press (1984) ."]}, {"page": "Supermanifold", "response": ["Three different definitions of supermanifolds are in use.  One definition is as a sheaf over a ringed space; this is sometimes called the \"algebro-geometric approach\".Alice Rogers, Supermanifolds: Theory and Applications, World Scientific, (2007)  (See Chapter 1) This approach has a mathematical elegance, but can be problematic in various calculations and intuitive understanding. A second approach can be called a \"concrete approach\", as it is capable of simply and naturally generalizing a broad class of concepts from ordinary mathematics. It requires the use of an infinite number of supersymmetric generators in its definition; however, all but a finite number of these generators carry no content, as the concrete approach requires the use of a coarse topology that renders almost all of them equivalent. Surprisingly, these two definitions,  one with a finite number of supersymmetric generators, and one with an infinite number of generators, are equivalent.Rogers, Op. Cit. (See Chapter 8.)", "Historically, this approach is associated with Alice Rogers, Bryce DeWitt and work by Jadczyk and Pilch.A. Jadczyk, K. Pilch, \"Superspaces and supersymmetries\". Comm. Math. Phys. 78 (1980), no. 3, pp373--390."]}, {"page": "List of women in mathematics", "response": ["* Alice Rogers, English expert on supermanifolds"]}, {"page": "Kavli Medal", "response": ["*2018: Alice Rogers,  for her outstanding contributions to mathematics education"]}, {"page": "2016 Birthday Honours", "response": ["*Professor (Frances) Alice Rogers – Emeritus Professor of Mathematics, King's College, London. For services to Mathematics Education and Higher Education."]}, {"page": "Rogers, Alice", "response": ["#redirectAlice Rogers"]}]}}