{"wiki_id": "http://www.wikidata.org/entity/Q24521", "itemLabel": "Keith Padgett", "itemDescription": "Falkland Islands politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Padgett", "wikipedia_page": {"main": "Keith Padgett is an English politician who served as Chief Executive of the Falkland Islands from 2012 to 2016. Before his appointed as Chief Executive, Padgett served as the islands' Financial Secretary from 2008, which was renamed Director of Finance with the implementation of the 2009 Constitution. He also acts as Director of Corporate Resources.Padgett first came to the Falklands in 2001 to serve as Deputy Financial Secretary under Derek Howatt. He was a candidate for Chief Executive in 2007, losing out to Tim Thorogood. In 2008, he succeeded Howatt as Financial Secretary and in 2012 Padgett became Chief Executive of the Falkland Islands, taking over from Thorogood who resigned for family reasons.As Chief Executive, Padgett led the Falkland Islands efforts to develop oil exploration in the Falklands Exclusive Economic Zone and assisted the Governor in leading commemorations for the 30th anniversary of the Falklands War in 2012. He presided over the sovereignty referendum in 2013, acting as returning officer, and also served as returning officer at the November 2013 general election.\nIn early 2016 Padgett announced his intention to retire and was succeeded by Barry Rowland in October 2016.", "link_mentions": [{"page": "Padgett", "response": ["* Keith Padgett, Falkland Islands politician"]}, {"page": "Chief Executive of the Falkland Islands", "response": ["| Keith Padgett || 1 February 2012 || 3 October 2016"]}, {"page": "Tim Thorogood", "response": ["In August 2007, the Legislative Assembly of the Falkland Islands selected Thorogood to be the British Overseas Territory's new Chief Executive. He took up the position on 3 January 2008. During his time as Chief Executive, the Falkland Islands Government increased investment in the search for hydrocarbons in the waters surrounding the islands. In 2011, Thorogood announced that he would be leaving the Falklands for family reasons. He left office in 2012 and was replaced by the Director of Finance, Keith Padgett."]}, {"page": "List of state leaders in 2012", "response": ["**#Keith Padgett, Chief Executive of the Falkland Islands (2012–2016)"]}, {"page": "2013 Falkland Islands general election", "response": ["The Falkland Islands general election of 2013 was held on Thursday 7 November 2013 to elect all eight members of the Legislative Assembly (five from the Stanley constituency and three from the Camp constituency) through universal suffrage using block voting, with each Stanley constituent having up to 5 votes and each Camp constituent having up to 3 votes. A total of 1,046 ballots (4,750 votes) were cast in Stanley, representing a turn-out of 75.4%, and 242 ballots (675 votes) in Camp, representing a turn-out of 85.5%. As no political parties are active in the Falklands, all the candidates stood as Independents. The Chief Executive of the Falkland Islands, Keith Padgett, acted as returning officer. It was the second election since the new Constitution came into force replacing the Legislative Council (which had existed since 1845) with the Legislative Assembly."]}, {"page": "2013 Falkland Islands sovereignty referendum", "response": ["The results were announced by Keith Padgett, the Chief Executive of the Falkland Islands, at 22:40 FKST (UTC−3), in Stanley Town Hall. The high vote to remain a British territory was widely expected, with even the small Argentine population on the islands saying they would vote 'Yes'. Several commentators, including the BBC's correspondent Caroline Wyatt, had anticipated a fairly large 'No' vote from islanders who wanted a second referendum on independence. However, out of the 1,518 ballots cast, only three voters were against keeping the islands' current status. Turnout was over 90% with 1,650 islanders eligible to vote in a population of 2,841. It is possible that at least one of the three people that voted 'No' did so out of a desire for full independence. There was one blank and one invalid votes each, the latter coming from a voter who both ticked the Yes box and crossed the No one. Despite recognizing the intent for a yes vote, the officials considered it invalid, as the rules written directly above on the ballot clearly forbade making signs in both boxes. Around twenty to thirty \"doubtful\" votes with signs others than ticks or crosses in the yes box were examined during the count, and deemed valid yes votes."]}, {"page": "List of state leaders in 2013", "response": ["**Head of Government – Keith Padgett, Chief Executive of the Falkland Islands (2012–2016)"]}, {"page": "List of state leaders in 2014", "response": ["**Head of Government – Keith Padgett, Chief Executive of the Falkland Islands (2012–2016)"]}, {"page": "List of state leaders in 2015", "response": ["**Head of Government – Keith Padgett, Chief Executive of the Falkland Islands (2012–2016)"]}, {"page": "List of state leaders in 2016", "response": ["**# Keith Padgett, Chief Executive of the Falkland Islands (2012–2016)"]}, {"page": "List of governors of dependent territories in the 21st century", "response": ["::*Keith Padgett, Chief executive (2012–2016)"]}, {"page": "List of leaders of dependent territories in 2016", "response": ["**# Keith Padgett, Chief Executive of the Falkland Islands (2012–2016)"]}, {"page": "List of leaders of dependent territories in 2015", "response": ["**Chief Executive – Keith Padgett, Chief Executive of the Falkland Islands (2012–2016)"]}, {"page": "List of leaders of dependent territories in 2014", "response": ["**Chief Executive – Keith Padgett, Chief Executive of the Falkland Islands (2012–2016)"]}, {"page": "List of leaders of dependent territories in 2013", "response": ["**Chief Executive – Keith Padgett, Chief Executive of the Falkland Islands (2012–2016)"]}]}}