{"wiki_id": "http://www.wikidata.org/entity/Q245075", "itemLabel": "Dev Patel", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Dev_Patel", "wikipedia_page": {"main": "Dev Patel (; born 23 April 1990) is a British actor. He is the recipient of various accolades including a BAFTA Award, a Screen Actors Guild Award, a Critics' Choice Award, in addition to receiving nominations for an Academy Award, another BAFTA Award, two Golden Globe Awards and three SAG awards. Patel made his screen debut as Anwar Kharral in the first two series of the British television teen drama Skins (2007–2008), landing the role with no prior professional acting experience. His breakthrough came in 2008 with the leading role of Jamal Malik in Danny Boyle's drama Slumdog Millionaire, for which  19-year-old Dev was nominated for the BAFTA Award for Best Actor in a Leading Role, becoming one of the youngest nominees in Best Actor category. He won the Critics' Choice Movie Award for Best Young Performer and the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture.", "link_mentions": [{"page": "April 23", "response": ["*  1990   – Dev Patel, English actor"]}, {"page": "Sir Gawain and the Green Knight", "response": ["The poem has been adapted to film three times, twice by writer-director Stephen Weeks: first as Gawain and the Green Knight in 1973 and again in 1984 as Sword of the Valiant: The Legend of Sir Gawain and the Green Knight, featuring Miles O'Keeffe as Gawain and Sean Connery as the Green Knight. Both films have been criticised for deviating from the poem's plot. Also, Bertilak and the Green Knight are never connected. On 30 July 2021, The Green Knight was released, directed by American filmmaker David Lowery for A24 and starring Dev Patel as Gawain and Ralph Ineson as the Green Knight, albeit with some significant deviations from the original story."]}, {"page": "1990", "response": ["* April 23 – Dev Patel, British actor"]}, {"page": "Srinivasa Ramanujan", "response": ["* The Man Who Knew Infinity is a 2015 film based on Kanigel's book. British actor Dev Patel portrays Ramanujan."]}, {"page": "Aladdin (1992 Disney film)", "response": ["In October 2016, it was reported that Disney was developing a live-action adaptation of Aladdin with Guy Ritchie signed on to direct the film. John August is writing the script, which will reportedly retain the musical elements of the original film, while Dan Lin is attached as producer. Lin revealed that they were looking for a diverse cast. In April 2017, Will Smith entered talks to play the Genie. The following month, Jade Thirlwall entered talks to portray the role of Jasmine. Alan Menken said filming was slated to begin August 2017. Production had originally been scheduled to begin in July, but was delayed due to Disney having trouble finding the right people to play Aladdin and Jasmine. British actress Naomi Scott and Indian actress Tara Sutaria were being considered to play Jasmine. For the role of Aladdin, British actors Riz Ahmed and Dev Patel were initially considered, but it was later decided that a newcomer should be cast in the role. In July 2017, it was announced that Egyptian-Canadian actor Mena Massoud had been cast as Aladdin, Scott as Jasmine, and Smith as the Genie. At the 2017 D23 Expo, Menken announced that he would be co-writing new songs for the film with Academy Award winners Pasek and Paul while Vanessa Taylor would re-write the script. In August 2017, Marwan Kenzari, Nasim Pedrad, and Numan Acar joined the cast as Jafar, Dalia, and Hakim, respectively. The following month, Billy Magnussen and Navid Negahban were cast as Prince Anders and the Sultan, respectively. Filming began on September 6, 2017, at Longcross Studios and concluded on January 24, 2018. The film was released on May 24, 2019."]}, {"page": "Maggie Smith", "response": ["In 2012, she played Muriel Donnelly in the British comedy The Best Exotic Marigold Hotel alongside Judi Dench, Dev Patel, Bill Nighy, Tom Wilkinson, and Penelope Wilton. The film was distributed by Fox Searchlight and received positive reviews. She received a Screen Actors Guild Award nomination for the role. The film became a surprise box-office hit following its international release and was such a financial success, it spawned a sequel, The Second Best Exotic Marigold Hotel (2015). Also in 2012, Smith starred in Dustin Hoffman's directorial debut, Quartet, based on Ronald Harwood's play. The film co-starred Tom Courtney, Pauline Collins, Billy Connolly, and Michael Gambon. The film premiered at the Toronto International Film Festival to positive reviews and garnered her a 10th Golden Globe nomination. The following year, Smith starred in the romantic comedy My Old Lady (2014) alongside Kristin Scott Thomas and Kevin Kline. The film received modest critical praise according to Rotten Tomatoes, with Smith's performance being a standout."]}, {"page": "Judi Dench", "response": ["In 2011, Dench reunited with director John Madden on the set of the comedy-drama The Best Exotic Marigold Hotel (2012), starring an ensemble cast also consisting of Celia Imrie, Bill Nighy, Ronald Pickup, Maggie Smith, Tom Wilkinson, and Penelope Wilton, as a group of British pensioners moving to a retirement hotel in India, run by the young and eager Sonny (Dev Patel). Released to positive reviews by critics, who declared the film a \"sweet story about the senior set featuring a top-notch cast of veteran actors\", it became a surprise box-office hit following its international release, eventually grossing $US134 million worldwide, mostly from its domestic run. Best Exotic Marigold Hotel was ranked among the highest-grossing specialty releases of the year, and Dench, whom Peter Travers from Rolling Stone called \"resilient marvel\", garnered a Best Actress nod at both the British Independent Film Awards and Golden Globe Awards."]}, {"page": "Danny Boyle", "response": ["In 2008 he directed Slumdog Millionaire, the story of an impoverished child (Dev Patel) on the streets of Mumbai, India, who competes on the local version of Who Wants to Be a Millionaire?, for which Boyle won Academy and BAFTA Awards for Best Director. The most successful British film of the decade, the film won eight Academy Awards and seven BAFTA Awards. Boyle commented, \"To be a film-maker...you have to lead. You have to be psychotic in your desire to do something. People always like the easy route. You have to push very hard to get something unusual, something different.\" Andrew Macdonald, producer of Trainspotting, said \"Boyle takes a subject that you've often seen portrayed realistically, in a politically correct way, whether it's junkies or slum orphans, and he has managed to make it realistic but also incredibly uplifting and joyful.\" The success led a deal with Fox Searchlight."]}, {"page": "Gawain", "response": ["Film portrayals of Gawain, and the Arthurian legend in general, are heavily indebted to Malory; White's The Once and Future King also exerts a heavy influence. Gawain appears as a supporting character in films such as Knights of the Round Table (1953, played by Robert Urquhart) and Excalibur (1981, played by Liam Neeson), all of which draw on elements of Gawain's traditional characterizations.Blanch & Wasserman, p. 185. Other films give Gawain a larger role. In the 1954 adaptation of Prince Valiant, he is a somewhat boorish, though noble and good-natured, foil for his squire and friend, Valiant.Blanch & Wasserman, pp. 187–88. He plays his traditional part in the 1963 film Sword of Lancelot (played by George Baker), seeking revenge when Lancelot kills his unarmed brother Gareth, but ultimately coming to Lancelot's aid when he uncovers Mordred's responsibility.Williams, p. 386. Sir Gawain and the Green Knight has been adapted to film several times, including 1973's Gawain and the Green Knight (played by Murray Head) and 1984's Sword of the Valiant (played by Miles O'Keeffe), both directed by Stephen Weeks; neither film was well reviewed and both deviate substantially from the source material.Blanch & Wasserman, pp. 190–91 A 1991 television adaptation by Thames Television, Gawain and the Green Knight, was both more faithful and better received.Blanch & Wasserman, pp. 191–93. Other film portrayals included Robert Gwyn Davin's in First Knight (1995), Anthony Hickox in Prince Valiant (1997), Sebastian Roché in Merlin (1998), Noah Huntley in The Mists of Avalon (2001), and Joel Edgerton in King Arthur (2004). In the 2008 television series Merlin, Gawain appears as Sir Gwaine, played by Eoin Macken. Though of noble origin, he passes himself as a peasant due to his mother's mistreatment by the king his father served; he is finally knighted by Arthur due to his personal value. In the 2011 series Camelot, he is played by Clive Standen. In 2020's Cursed, Gawain is played by Matt Stokoe, who doubles as the Green Knight. In the 2021 film The Green Knight, Gawain is portrayed by Dev Patel."]}, {"page": "1990 in film", "response": ["* April 23 – Dev Patel, British actor"]}, {"page": "Ralph Fiennes", "response": ["In 2020, Fiennes voiced a tiger in the family fantasy adventure film Dolittle starring Robert Downey Jr.. In the same year, he appeared in the monologue play Beat the Devil by David Hare at the Bridge Theatre in London, and then in the 2021 film version of the play. Also in 2021, he starred in the British drama film The Dig playing the Suffolk archaeologist Basil Brown alongside Carey Mulligan, and Lily James. The film received positive reviews with critics praising his performance in the film. Mark Kermode critic of The Guardian described Fiennes portrayal as having an \"admirable eloquence\". Later in 2021, Fiennes is also set to star in Matthew Vaughn's period spy film The King's Man and Cary Joji Fukunaga's James Bond film No Time to Die. He is set to reunite with director Wes Anderson in The Wonderful Story of Henry Sugar starring opposite Benedict Cumberbatch, Dev Patel, and Ben Kingsley."]}, {"page": "Golden Globe Award for Best Actor – Motion Picture Musical or Comedy", "response": ["| Dev Patel || David Copperfield || The Personal History of David Copperfield"]}, {"page": "List of films considered the worst", "response": ["The Last Airbender is a fantasy/adventure film written, produced, and directed by M. Night Shyamalan and is based on the acclaimed Nicktoons animated television series Avatar: The Last Airbender. Upon release, the film received extremely negative reviews, with critics panning the bad acting, numerous plot holes, screenplay, poor special effects (despite its reported $150 million budget), and especially Shyamalan's directing. It was also ridiculed for the poor quality of its post-converted 3-D, and the casting of white and Indian actors to portray characters who were East Asian or Inuit in the source material triggered accusations of racism and whitewashing. Further criticism came from fans of the original cartoon series, who said the film differed tremendously from its critically acclaimed source material. David Onda of Comcast wrote that it \"has been called one of the worst ever made. The movie was universally panned by critics and failed to make back its production budget domestically.\" It garnered nine nominations at the 31st Golden Raspberry Awards, and won five, including Worst Picture and Worst Director. Roger Ebert wrote, \"The Last Airbender is an agonizing experience in every category I can think of and others still waiting to be invented. The laws of chance suggest that something should have gone right. Not here. It puts a nail in the coffin of low-rent 3D, but it will need a lot more coffins than that.\" When asked if Last Airbender had been the worst film he has ever seen, Mike Ryan of Vanity Fair answered, \"Yes\". Hi highlighted the film in their \"Worst Films Ever\" series, and Screen Rant and Digital Trends included it in their worst film lists. Dev Patel would later express regret and dislike for his role and his experience with the film. He described his performance as Prince Zuko as being as though he “saw a stranger on the screen that I couldn't relate to.”"]}]}}