{"wiki_id": "http://www.wikidata.org/entity/Q245935", "itemLabel": "Lady Louisa Stuart", "itemDescription": "Daughter of British Prime Minister", "wikipedia_url": "https://en.wikipedia.org/wiki/Lady_Louisa_Stuart", "wikipedia_page": {"main": "Lady Louisa Stuart (12 August 1757 – 4 August 1851) was a British writer of the 18th and 19th centuries. Her long life spanned nearly ninety-four years.", "link_mentions": [{"page": "Horace Walpole", "response": ["After Walpole's death, Lady Louisa Stuart, in the introduction to the letters of her grandmother, Lady Mary Wortley Montagu (1837), wrote of rumours that Horace's biological father was not Sir Robert Walpole but Carr, Lord Hervey (1691–1723), elder half-brother of the more famous John Hervey. T. H. White writes: \"Catherine Shorter, Sir Robert Walpole's first wife, had five children. Four of them were born in a sequence after the marriage; the fifth, Horace, was born eleven years later, at a time when she was known to be on bad terms with Sir Robert, and known to be on romantic terms with Carr, Lord Hervey.\" The lack of physical resemblance between Horace and Sir Robert, and his close resemblance to members of the Hervey family, encouraged these rumours. Peter Cunningham, in his introduction to the letters of Horace Walpole (1857), vol. 1, p. x, wrote: "]}, {"page": "John Stuart, 3rd Earl of Bute", "response": ["# Lady Louisa Stuart (12 August 1757 – 4 August 1851), writer, who died unmarried"]}, {"page": "1827 in literature", "response": ["*Lady Louisa Stuart – Memoir of Lady Mary Coke"]}, {"page": "Charles Townshend", "response": ["Townshend conceived a great and dangerous passion for his step-daughter Frances Douglas, Lady Douglas, and her memorialist, Lady Louisa Stuart, wrote after his death of his character:", "This was careless, gay, inconsiderate, volatile, seemingly foreign to every serious reflection or feeling. He had one of those happy tempers which nothing can ruffle, without a grain of pride, sternness or resentment in his nature. Ready to laugh with every body and at every thing, he poured out wit in torrents; and it was so much the worse for truth if ever truth stood in wit's way.Lady Louisa Stuart, Memoire of Frances, Lady Dougles, at page 37; Edinburgh and London, Scottish Academic Press, 1985", "*Lady Louisa Stuart, Memoire of Frances, Lady Douglas (Edinburgh and London, Scottish Academic Press, 1985)"]}, {"page": "John Hervey, 2nd Baron Hervey", "response": ["The malicious caricature of Sporus does Hervey great injustice, and he is not much better treated by Horace Walpole, who in reporting his death in a letter (14 August 1743) to Horace Mann, said he had outlived his last inch of character. Nevertheless, his writings prove him to have been a man of real ability, condemned by Walpole's tactics and distrust of able men to spend his life in court intrigue, the weapons of which, it must be owned, he used with the utmost adroitness. His wife Lady Hervey (1700–1768), of whom an account is to be found in Lady Louisa Stuart's Anecdotes, was a warm partisan of the Stuarts. She retained her wit and charm throughout her life, and has the distinction of being the recipient of English verses by Voltaire."]}, {"page": "Lady Mary Wortley Montagu", "response": ["Despite the immediate success following the publication of Turkish Embassy Letters, Lady Bute was furious and worried about how an unauthorized publication would impact the family's reputation. One of the manuscript volumes that others found was Lady Mary's famous diary, and Lady Bute did not have any knowledge of this existence until a few days before her mother's death. After she received these volumes, Lady Bute \"kept it always under lock and key, and though she often looked over it herself, and read passages aloud to her daughters and friends, excepting the first five or six copy-books, which at a late period, she permitted Lady Louisa Stuart to peruse alone, upon condition that nothing should be transcribed.\" Lady Louisa Stuart, the youngest of Lady Bute's daughters, was scolded for reading books and wanting to be like her grandmother. Later, Lady Louisa followed her grandmother's footsteps and became a writer. Then when Lady Bute felt that the end of her life was near, in 1794, she burnt the diary that her mother kept since her marriage. She chose to burn the diary because Lady Bute always spoke to her mother with great respect, and she feared the possibility of a scandal.", "Her Letters and Works were published in 1837. Montagu's octogenarian granddaughter Lady Louisa Stuart contributed to this, anonymously, an introductory essay titled \"Biographical Anecdotes of Lady M. W. Montagu\", from which it was clear that Stuart was troubled by her grandmother's focus on sexual intrigues and did not see Lady Mary Wortley Montagu's Account of the Court of George I at his Accession as history. However, Montagu's historical observations, both in the \"Anecdotes\" and the Turkish Embassy Letters, prove quite accurate when put in context.Looser, Devoney. British Women Writers and the Writing of History 1670–1820 JHU Press, 2000. 64–67. Print. . Despite the availability of her work in print and the revival efforts of feminist scholars, the complexity and brilliance of Lady Mary Wortley Montagu's extensive body of work has not yet been recognized to the fullest.Backscheider, Paula R., and Ingrassia, Catherine E., eds., British Women Poets of the Long Eighteenth Century. Baltimore, MD: Johns Hopkins University Press, 2009. 881. Print."]}, {"page": "Marquess of Bute", "response": ["Numerous other members of the family have also gained distinction. Robert Stuart, younger son of the first Baronet, was created a Baronet in his own right in 1707. The Hon. James Stuart-Mackenzie, younger son of the second Earl, succeeded to the Mackenzie estates through his paternal grandmother and assumed by Royal licence the additional surname of Mackenzie. He was a member of parliament. The Hon. James Stuart-Wortley-Mackenzie, second son of the third Earl, was a politician and the father of James Stuart-Wortley, 1st Baron Wharncliffe (see the Earl of Wharncliffe for more information on this branch of the family). Lieutenant-General the Hon. Sir Charles Stuart, fourth son of the third Earl, was a distinguished soldier and the father of Charles Stuart, 1st Baron Stuart de Rothesay (see the Baron Stuart de Rothesay). The Most Reverend the Hon. William Stuart, fifth son of the third Earl, was Archbishop of Armagh. His son Sir William Stuart was a member of parliament. His eldest son William Stuart also sat as a member of parliament. Lady Louisa Stuart, daughter of the third Earl, was a writer. Lord Evelyn Stuart, second son of the first Marquess, was a soldier and politician. Lord Henry Crichton-Stuart, third son of the first Marquess, was the father of Henry Villiers-Stuart, 1st Baron Stuart de Decies (see the Baron Stuart de Decies for more information on this branch of the family)."]}, {"page": "George Hayter", "response": ["File:Lady Louisa Stuart by George Hayter.jpg|Lady Louisa Stuart at the age of ninety-three, sketch in oils"]}, {"page": "Mary Stuart, Countess of Bute", "response": ["# Lady Louisa Stuart (12 August 1757 – 4 August 1851), writer who died unmarried"]}, {"page": "Caroline Townshend, 1st Baroness Greenwich", "response": ["An excoriating sketch of Lady Greenwich's character and unkindness to her daughter was recorded by Lady Louisa Stuart in her Memoire of Frances, Lady Douglas.Edinburgh and London, Scottish Academic Press, 1985"]}, {"page": "Francis Scott, 2nd Duke of Buccleuch", "response": ["Buccleuch was buried on 26 April 1751 in Eton College Chapel. Lady Louisa Stuart called him \"a man of mean understanding and meaner habits\", and added that after his first wife's death \"he plunged into such low amours, and lived so entirely with the lowest company, that his person was scarcely known to his equals, and his character fell into utter contempt.\" Though a distant kinswoman by marriage and therefore privy to family remembrances of Buccleuch, Stuart's judgment must be treated with caution; she had no first-hand knowledge of the man, having not yet been born at the time of his death."]}, {"page": "Charles Stuart (British Army officer, born 1753)", "response": ["He had several notable brothers and sisters, including John Stuart, 1st Marquess of Bute (1744–1814); The Most Rev. and Hon. William Stuart (1755–1822), a clergyman who became Archbishop of Armagh, and James Archibald Stuart (1747–1818), another soldier who raised the 92nd Foot in 1779. His sisters were Lady Louisa Stuart (1757–1851), a writer who died unmarried, Lady Mary Stuart (c. 1741 – 1824), who married James Lowther, later the 1st Earl of Lonsdale; Lady Anne Stuart (born c. 1745), who married Lord Warkworth, later the 2nd Duke of Northumberland; Lady Jane Stuart (c. 1748 – 1828), who married George Macartney, later the first Earl Macartney; and Lady Caroline Stuart (b. 1763 – 1813), who married The Hon. John Dawson, later first Earl of Portarlington.Cokayne, George Edward, The Complete Peerage of England, Scotland, Ireland, Great Britain, and the United Kingdom Extant, Extinct, or Dormant."]}, {"page": "William Medows", "response": ["In 1770, Medows enjoyed a romantic friendship with his second cousin, Lady Louisa Stuart, then aged thirteen, a daughter of John Stuart, 3rd Earl of Bute. Medows was then thirty-two, and Lord Bute considered him unsuitable and put a stop to it. Lady Louisa was bitterly disappointed, and never married.Graham, Harry, [Jocelyn Henry C. Graham], A Group of Scottish Women (New York, Duffield & Co., 1908) Chapter XVIII online at Lady Louisa Stuart (1757–1851) at electricscotland.com (Retrieved 2 March 2008) Later the same year, Medows married another lady, Frances Augusta Hammerton.Rt. Hon. Sir William Medows at thepeerage.com (Retrieved 2 March 2008)"]}, {"page": "Richard Wilson (Barnstaple MP)", "response": ["He married Anne, daughter of Charles Townshend. They were divorced in 1798. Lady Louisa Stuart wrote of his elopement with Anne Townshend that:", "...this Mr Wilson - whose name, when known, made nobody the wiser - was an Irishman, born to an inheritance of three hundred a year, but greatly in debt, of no profession, accounted a black-leg, and chiefly remarkable for having fought two or three duels... His conversation was bragging and his manner familiar and aisy like those of the Paddy in a farce. All his friends had ten thousand a year; he talked of his horses and carriages, his estate and his interest; and when he addressed you as a lady, you could not help drawing back for fear he should give you a kiss.Lady Louisa Stuart, Memoire of Frances, Lady Douglas, Edinburgh and London, Scottish Academic Press, 1985"]}, {"page": "Lady Mary Coke", "response": ["She began writing it in August 1766 and stopped making regular additions in January 1791, when Anne's husband died. The published edition includes entries only up to December 1774. (Her great-great-great-nephew James Archibald Home edited this edition.) After 1791, Lady Mary continued to pass on her opinions to friends and relatives, such as her niece Lady Frances Scott (her sister Caroline's daughter by her first marriage to Francis, earl of Dalkeith) and her first cousin once removed Lady Louisa Stuart. Louisa Stuart in 1827 wrote an acerbic memoir of Lady Mary, which is another major source for her life.Miller, Karl, Stuart, Lady Louisa (1757–1851), writer in Oxford Dictionary of National Biography, Oxford University Press, September 2004 & online edition, January 2006 (subscription required) accessed 29 February 2008"]}, {"page": "The Lady of the Lake (poem)", "response": ["The first hint of The Lady of the Lake occurs in a letter from Scott to Lady Abercorn dated 9 June 1806, where he says he has 'a grand work in contemplation … a Highland romance of Love Magic and War founded upon the manners of our mountaineers'.The Letters of  Sir Walter Scott: 1787‒1807, ed. H. J. C. Grierson (London, 1832), 303. He saw this as doing for the Highlands what The Lay of the Last Minstrel had done for the Borders.Ibid., 309 (Scott to John Leyden, 5 July 1806). But in January 1807 he had decided to postpone the Highland work in favour of Marmion since 'it would require a journey of some length into the country not only to refresh my faded or inaccurate recollection of the scenery; But also to pick up some of the traditions still floating in the memory of the inhabitants'Ibid., 347 (Scott to Anna Seward, 13 January 1807). The poem was eventually begun during a visit to the southern Highlands at the end of August and beginning of September 1809,The Letters of Sir Walter Scott: 1808‒1811, ed. H. J. C. Grierson (Edinburgh, 1832), 237‒38n. but in the early stages it seems not to have been composed in a straightforward manner, Scott writing to his Highland correspondent Mrs Clephane on 27 October of the same year: 'I have been amusing myself with trying to scratch out a Douglas tale but this is only for your own ear and family as I have not formed any serious intention of combining or systematizing the parts I have written'. But the poem now had its name, The Lady  of the Lake.Ibid., 264, 261. Scott announced good progress in November and December.Ibid., 270 (Scott to Lady Louisa Stuart, 7 November [1809]); 274 (Scott to Lady Abercorn, 31 December 1809).  There was some interruption from legal business,The Letters of Sir Walter Scott 1831‒1832 and Appendices of Early Letters, ed. Sir Herbert Grierson (London, 1837), 318 (Scott to George Ellis, 1 February 1810). but the first two cantos were in print by 14 March, and the next two by 14 April with the fifth in the press and the sixth within sight of completion.The Letters of Sir Walter Scott: 1808‒1811, ed. H. J. C. Grierson (Edinburgh, 1832), 311 (Scott to Lady Abercorn, 14 March 1810); 324 (Scott to Lady Abercorn, 14 April 1810)."]}, {"page": "William Wentworth, 2nd Earl of Strafford (1722–1791)", "response": ["When Strafford was widowed in 1785, society gossip quickly linked his name with that of Lady Louisa Stuart (1757–1851), leading Lady Diana Beauclerk to remark \"So Lady Louisa Stuart is going to marry her great-grandfather, is she?\"Memoirs of the Argylls in the Journal of Lady Mary Coke, vol. 1, p. xlix However, Stuart looked on Strafford merely as an elderly uncle, and not as a suitor, and he for his part did nothing to promote such an alliance.Graham, Harry, [Jocelyn Henry C. Graham], A Group of Scottish Women (New York, Duffield & Co., 1908) Chapter XVIII "]}, {"page": "Harold the Dauntless", "response": ["According to J. G. Lockhart Scott began Harold the Dauntless soon after completing The Bridal of Triermain, that is early in 1813, keeping it before him 'as a congenial plaything, to be taken up whenever the coach brought no proof-sheets to jog him as to serious matters'.J. G. Lockhart, Memoirs of the Life of Sir Walter Scott, Bart., 7 vols (Edinburgh, 1837), 4.14. Its progress was remarkably erratic. In October 1815 Scott sent Canto 2 to James Ballantyne;The Letters of Sir Walter Scott: 1787‒1807, ed. H. J. C. Grierson (London, 1932), 488 (Scott to James Ballantyne, [October 1815]). on the 21st he is 'while the humour hits going on with Harold the Dauntless';Ibid., 105 (Scott to James Ballantyne, [21 October 1815]). on 2 November the first canto at least has been, or is in the course of being, printed;Ibid., 114 (Scott to Lady Louisa Stuart). and on 22 December Scott says it is nearly finished.Ibid., 145 (Scott to J. B. S. Morritt). But by 16 May 1816 it is still 'in the state of the Bear and Fiddle' (i. e. in the middle) and he is planning to resume it shortly.Ibid., 233 (Scott to Morritt). It is not till 14 November 1816 that another claim that it is nearly complete corresponded with reality:Ibid., 294 (Scott to Lady Louisa Stuart). on the 22nd Scott informs Morritt that is finishing it.Ibid., 298 . Sending a copy hot from the press on 31 January 1817 he explains to Lady Louisa Stuart: 'I once thought I should have made it something clever, but it turned vapid upon my imagination; and I finished it at last with hurry and impatience'.Ibid., 380."]}, {"page": "Rokeby (poem)", "response": ["Sales were initially promising. J. G. Lockhart reported that bookshops in Oxford were besieged by customers wanting to read the poem, and bets were placed as to whether Rokeby would outsell Byron's recent Childe Harold's Pilgrimage.  Byron himself wrote urgently from Italy asking his publisher John Murray to send him a copy.  In the event Rokeby sold ten thousand copies in the first three months.The Letters of Sir Walter Scott: 1811–1814, ed. H. J. C. Grierson (London, 1932), 260 (Scott to Lady Louisa Stuart, 23 April 1813)."]}, {"page": "List of children of prime ministers of the United Kingdom", "response": ["11. Lady Louisa Stuart"]}, {"page": "Jane Scott, Countess of Dalkeith", "response": ["Following her death, it was said by Lady Louisa Stuart that the duke \"plunged into such low amours, and lived so entirely with the lowest company, that, although he resided constantly in the neighbourhood of London, his person was scarcely known to his equals, and his character fell into utter contempt.\" According to his will, he also had a number of illegitimate children by two other mothers."]}, {"page": "Frances Douglas, Lady Douglas", "response": ["Her aunt Lady Jane Scott died in 1779 and left her a manor (now called Douglas House) in Petersham, London and a considerable financial inheritance. In 1782, Douglas and her brother traveled to Dublin and stayed with Lady Carlow. She was the sister of Lady Louisa Stuart, who was a close friend. While in Ireland, she met with Anne Townshend, her stepsister, who needed help sorting out the financial difficulties from an unfortunate marriage.", "*Hon. Caroline Lucy Douglas (1784-1857), who married Admiral Sir George Scott, K.C.B., and had no children; she became known as a novelistLady Louisa Stuart, Memoire of Frances, Lady Douglas (Edinburgh, U.K.: Scottish Academic Press, 1985), page 97.", "Their family home was Bothwell Castle, where she entertained poets and authors in an atmosphere of 'ease, comfort and gaiety'. She entertained the French émigré aristocracy. Guest also included M. G. Lewis, Mary Berry, and Sir Walter Scott, who met  Lady Louisa Stuart there in 1799."]}, {"page": "List of women writers (M–Z)", "response": ["*Lady Louisa Stuart (1757–1851, England), mem. & correspondent"]}]}}