{"wiki_id": "http://www.wikidata.org/entity/Q24572807", "itemLabel": "Alice Kinsella", "itemDescription": "British artistic gymnast", "wikipedia_url": "https://en.wikipedia.org/wiki/Alice_Kinsella", "wikipedia_page": {"main": "Alice Nicole Kinsella (born 13 March 2001) is an English artistic gymnast and member of the British national gymnastics team. She represented Great Britain at the 2020 Summer Olympics and won a bronze medal in the team event. She is the 2018 Commonwealth Games and 2019 European champion on the balance beam.", "link_mentions": [{"page": "Kinsella", "response": ["* Alice Kinsella (born 2001), British gymnast"]}, {"page": "List of Olympic medalists in gymnastics (women)", "response": ["|Jennifer GadirovaJessica GadirovaAlice KinsellaAmelie Morgan"]}, {"page": "Mark Kinsella", "response": ["He is the father of Liam Kinsella and 2020 Olympic bronze medallist Alice Kinsella."]}, {"page": "Becky Downie", "response": ["On 6 July Downie was named to the team to compete at the 2018 European Championships alongside Alice Kinsella, Georgia-Mae Fenton, Kelly Simm, and Lucy Stanhope. On 7–8 July Downie returned to competition and competed at the Heerenveen Friendly where she tied for first on uneven bars and Great Britain placed third in the team final. Downie withdrew from the European Championships after sustaining an ankle injury during podium training.", "On September 27, Downie was named to the team to compete at the World Championships in Doha, Qatar alongside Alice Kinsella, Ellie Downie, Georgia-Mae Fenton, and Kelly Simm.", "In September Downie was named to the team to compete at the 2019 World Championships in Stuttgart alongside Alice Kinsella, Ellie Downie, Taeja James, and Georgia-Mae Fenton.  During qualifications Downie helped Great Britain place seventh, earning a spot in the team final and qualifying a team for Great Britain to the 2020 Olympic Games in Tokyo.  Individually Downie qualified for the uneven bars final.  During the team final she contributed scores on uneven bars and balance beam towards Great Britain's sixth place finish.  In the uneven bars final Downie performed a clean routine, earning a score of 15.000 and winning the silver medal behind reigning World uneven bars Champion Nina Derwael of Belgium.  This was Downie's first individual World Championships medal.  Earlier that day Downie's sister Ellie won her first individual World Championships medal, a bronze medal on vault."]}, {"page": "Alice (name)", "response": ["* Alice Kinsella, (born 2001) British artistic gymnast"]}, {"page": "European Artistic Gymnastics Championships – Women's balance beam", "response": ["|  Alice Kinsella"]}, {"page": "Ellie Black", "response": ["In February Black was named to the team to compete at the 2018 Commonwealth Games alongside Shallon Olsen, Isabela Onyshko, Brittany Rogers, and Rose-Kaying Woo.  While there she helped Canada win gold for the first time since the 1990 Commonwealth Games ahead of second place England in the team finals.  Individually Black won gold in the all-around ahead of Georgia Godwin of Australia and Alice Kinsella of England.  She also won silver on vault, behind Olsen, and placed sixth on balance beam and fourth on floor exercise."]}, {"page": "List of Olympic female artistic gymnasts for Great Britain", "response": ["|Alice Kinsella", "|  || Jennifer Gadirova, Jessica Gadirova,Alice Kinsella, Amelie Morgan ||  2020 Tokyo || Women's team"]}, {"page": "Gymnastics at the 2020 Summer Olympics", "response": ["| Jennifer GadirovaJessica GadirovaAlice KinsellaAmelie Morgan"]}, {"page": "2014 in artistic gymnastics", "response": ["|  Senior AA: Ruby Harrold  Senior VT: Claudia Fragapane    Senior UB: Ruby Harrold    Senior BB: Becky Downie    Senior FX: Kelly Simm Junior AA: Tyesha Mattis Junior VT: Tyesha Mattis Junior UB: Georgia Mae Fenton Junior BB: Catherine Lyons Junior FX: Catherine Lyons & Amy Tinkler Espoir AA: Lucy Stanhope Espoir VT: Elise Waugh  Espoir UB: Alice Kinsella  Espoir BB: Lana Chilton  Espoir FX: Maisie Lloyd Jones  ", "| TF:  England  AA:  Georgia-Mae Fenton  VT:  Casey Jo Bell  UB:  Alice Kinsella  BB:  Amelia Montague  FX:  Georgia-Mae Fenton", "| TF:  Great Britain  AA:  Alice Kinsella", "| AA: Maisie Methuen  VT: Alice Kinsella  UB: Taeja James  BB: Lucy Stanhope  FX: Laura Kaletha"]}, {"page": "FIG World Rankings", "response": ["|Alice Kinsella"]}, {"page": "2015 in artistic gymnastics", "response": ["| Senior AA: Amy Tinkler  Senior VT: Claudia Fragapane  Senior UB: Becky Downie  Senior BB: Amy Tinkler  Senior FX: Kelly Simm  Junior AA: Catherine Lyons  Junior VT: Catherine Lyons  Junior UB: Alice Kinsella  Junior BB: Catherine Lyons  Junior FX: Catherine Lyons  Espoir AA: Chiara Bunce  Espoir VT: Annabel Agba  Espoir UB: Chiara Bunce  Espoir BB: Amelie Morgan  Espoir FX: Isabel Davis", "| TF:   AA:  Alice Kinsella", "| Senior: Kelly Simm  Junior: Alice Kinsella  Espoir: Isabel Davis", "| Senior: Becky Downie  Junior: Alice Kinsella  Espoir: Chiara Bunce"]}, {"page": "2016 in artistic gymnastics", "response": ["| Senior AA: Claudia Fragapane  Senior VT: Katie Meadow  Senior UB: Claudia Fragapane  Senior BB: Claudia Fragapane  Senior FX: Claudia Fragapane  Junior AA: Alice Kinsella  Junior VT: Taeja James  Junior UB: Taeja James  Junior BB: Alice Kinsella  Junior FX: Alice Kinsella ", "| Senior AA: Claudia Fragapane  Senior VT: Ellie Downie  Senior UB: Gabby Jupp  Senior BB: Becky Downie  Senior FX: Amy Tinkler  Junior AA: Maisie Methuen  Junior VT: Sophie Scott  Junior UB: Megan Parker  Junior BB: Alice Kinsella  Junior FX: Zoe Simmons", "| Senior:  Marine Boyer  Junior:  Alice Kinsella", "| Senior:  Ellie Downie  Junior:  Alice Kinsella", "| Senior: Claudia Fragapane  Junior: Alice Kinsella", "| Senior: Becky Downie  Junior: Alice Kinsella"]}, {"page": "Claudia Fragapane", "response": ["Fragapane made her comeback debut at the British Championships, where she only competed on uneven bars, balance beam, and floor exercise.  In event finals she placed fourth on uneven bars and second on floor exercise behind Ellie Downie.  On 19 March she was named to the team to compete at the 2019 European Championships, replacing Kelly Simm after she broke her foot.  She competed alongside Downie, Alice Kinsella, and Amelie Morgan.  During qualifications Fragapane finished first on floor exercise and advanced to the final.  During the final she placed fifth."]}, {"page": "Ellie Downie", "response": ["On 27 September Downie was named to the team to compete at the World Championships in Doha, Qatar alongside Becky Downie, Alice Kinsella, Georgia-Mae Fenton, and Kelly Simm.  The team finished ninth in qualifications and did not advance to the team final.  Individually Downie qualified to the all-around final where she finished 11th.", "Downie was selected to compete at the 2019 European Championships alongside Amelie Morgan, Alice Kinsella, and Kelly Simm.  She competed at the British Championships where she placed first in the all-around, on vault, and on floor exercise.  She later competed at the Birmingham World Cup where she placed seventh after falling off the balance beam and uneven bars.  At the European Championships Downie qualified to the all-around final in fourth place and to the vault final in first.  In the all-around final Downie finished second behind Mélanie de Jesus dos Santos of France.  She won bronze in the vault final behind 2015 vault champion Maria Paseka and 2017 vault champion Coline Devillard.", "In September Downie was named to the team to compete at the 2019 World Championships in Stuttgart alongside Alice Kinsella, Becky Downie, Taeja James, and Georgia-Mae Fenton. During qualifications Downie helped Great Britain place seventh, earning a spot in the team final and qualifying a team for Great Britain to the 2020 Olympic Games in Tokyo.  Individually Downie qualified for the vault final.  During the team final she contributed scores on vault and uneven bars towards Great Britain's sixth place finish.  In the vault final Downie performed a Double-Twisting Yurchenko and a Cheng, earning an average score of 14.816 and winning the bronze medal behind Americans Simone Biles and Jade Carey.  This was Downie's first individual World Championships medal.  Later that day Downie's sister Becky won her first individual World Championships medal, a silver medal on the uneven bars."]}]}}