{"wiki_id": "http://www.wikidata.org/entity/Q2459335", "itemLabel": "Gilly Coman", "itemDescription": "actress (1955-2010)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gilly_Coman", "wikipedia_page": {"main": "Gilly Coman (13 September 1955 – 13 July 2010) was an English actress, who played Aveline in the first four series of Carla Lane's sitcom Bread.\nShe also appeared in Scully, Coronation Street, Brookside, A Touch of Frost, Inspector Morse, Springhill and Emmerdale Farm and in the BBC sitcom Open All Hours. She played Marigold Lockton in The Man Who Made Husbands Jealous (1997), the TV adaptation of the Jilly Cooper novel.\nComan died of a suspected heart attack on 13 July 2010 at her mother's grave in Church of the Resurrection and All Saints, Caldy, on the Wirral peninsula in Merseyside. She had a heart condition and died just two weeks before she was scheduled for a pacemaker operation.", "link_mentions": [{"page": "Bread (TV series)", "response": ["The only Boswell daughter was Aveline (Gilly Coman/Melanie Hill), a colourful, enduring model who married Protestant vicar Oswald Carter (Giles Watling) at the end of series 4 (to staunchly-Catholic Nellie's outrage); after trying to conceive throughout series 5, Aveline gives birth to Ursula in series 6.", "| Gilly Coman || rowspan=\"2\" | Aveline Boswell || 39 || 1–1988 Christmas Special || 1986–1988", "In 1989, at the height of Bread's success, the departure of two of the series leading actors, Peter Howitt as Joey, and Gilly Coman as Aveline, led to the characters being re-cast. Bread was also criticised several times in both the Radio Times and on  Points of View for its bad language before the 9pm watershed - Grandad's catchphrase \"Piss off!\" was often the cause of complaints."]}, {"page": "Melanie Hill", "response": ["Hill replaced Gilly Coman as the character of Aveline in the last three series' of Carla Lane's BBC television sitcom Bread. She has also appeared in such programmes as The Bill playing Marie Carver (née Graham), Auf Wiedersehen, Pet playing Hazel Redfern, Hot Money playing Liz Hoodless, Juliet Bravo playing Jean Simpson, Emmerdale playing Avril Kent and Cape Wrath playing Brenda Ogilvie."]}, {"page": "List of Brookside characters", "response": ["|Denise || Gilly Coman || 1992"]}, {"page": "Springhill (TV series)", "response": ["*Gilly Coman as Liz Freeman"]}, {"page": "The Man Who Made Husbands Jealous", "response": ["In 1997, a TV miniseries version was produced for ITV by Anglia Television, starring Stephen Billington as Lysander Hawkley, Hugh Bonneville as Ferdinand Fitzgerald , and Rhona Mitra as Flora Seymour.  Other cast members included Gilly Coman as the Marigold, Kim Criswell as Georgie, and Kate Byers as Kitty Rannaldini."]}, {"page": "Coman", "response": ["*Gilly Coman (1960–2010), British-based actress"]}, {"page": "2010 in British television", "response": ["|Gilly Coman"]}, {"page": "Deaths in July 2010", "response": ["*Gilly Coman, 50, British actress (Bread), suspected heart attack."]}, {"page": "2011 British Academy Television Awards", "response": ["*Gilly Coman"]}, {"page": "Gilly (disambiguation)", "response": ["* Gilly Coman (1955–2010), English actress"]}, {"page": "Screen Two", "response": ["Cast: Linus Roache, Tom Wilkinson, Robert Carlyle, Cathy Tyson, James Ellis, Lesley Sharp, Robert Pugh, Christine Tremarco, Paul Barber, Rio Fanning, Gilly Coman, Fred Pearson, Jimmy Gallagher, Tony Booth, John Bennett, Kim Johnson, Keith Cole, Bobby Martino, Valerie Lilley, Jimmy Coleman, Michael Ananins, Mickey Poppins, Adrian Luty, Bill Dean, Matyelok Gibbs, Charley Wilde, Euan Blair, Marsha Thomason, Victoria Arnold and Guiseppe Murphy"]}, {"page": "The Man Who Made Husbands Jealous (film)", "response": ["*Gilly Coman as Marigold Lockton"]}]}}