{"wiki_id": "http://www.wikidata.org/entity/Q24565054", "itemLabel": "Jami Reid-Quarrell", "itemDescription": "Scottish actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jami_Reid-Quarrell", "wikipedia_page": {"main": "Jami Reid-Quarrell (born 20 January 1978), is a Scottish actor who is best known for his role as the villain Colony Sarff in series 9 of the BBC television series Doctor Who, for which he was voted Best Male Guest Actor of the 2015 season on the Doctor Who TV fansite. He is also a singer, physical performer and choreographer who has appeared in numerous theatre, film and TV productions, operas and musicals. In 2010 he created the role of Dr Gangle for Andrew Lloyd Webber's sequel to Phantom of the Opera, Love Never Dies. His stage appearances include Equus with Daniel Radcliffe, Trevor Nunn's The Tempest with Ralph Fiennes and with renowned physical theatre companies such as Punchdrunk and Frantic Assembly. He has also appeared around the world with such companies as the Royal Opera House, Archaos and the Royal Shakespeare Company where he underwent in-depth Shakespearean training tutored by Cicely Berry. He also choreographs and movement directs for theatre and screen, including shows for Trevor Nunn and pop videos for Depeche Mode (\"Fragile Tension\"), Casiokids (\"Finn Bikkjen\") and Boy Kill Boy (\"No Conversation\").", "link_mentions": [{"page": "Davros", "response": ["Davros returns in the two-part Series 9 opening \"The Magician's Apprentice\" and \"The Witch's Familiar\" (2015), having escaped the Crucible's destruction and ending up on a restored Skaro with his life being prolonged by the Daleks. But when the aged Davros' health begins to fail, he remembers his childhood self, played by Joey Price, meeting the Twelfth Doctor (Peter Capaldi) during the Kaleds' thousand-year war prior to Genesis of the Daleks. The young Davros finds himself lost on the battlefield and surrounded by handmines, with the Doctor throwing his sonic screwdriver to the boy with the intent to save him before learning his name and leaving the child to his fate. Davros, seeking a final revenge on the Doctor, employs the snake-like Colony Sarff (Jami Reid-Quarrell) to bring him to Skaro. When it appears that the Doctor has lost his companion Clara Oswald (Jenna Coleman) to the Daleks, Davros manages to trick the Doctor into using his regeneration energy to heal him, extending his own life while infusing every Dalek on Skaro with the energy. But the Doctor reveals Davros' scheme has also revitalised the decomposing-yet-still-alive Daleks left to rot in Skaro's sewers, causing them to revolt and destroy the city. The Doctor then discovers the Daleks have a concept of mercy and are allowed to have the word in their vocabulary when he encounters Clara, having disguised herself in a Dalek's robotic chassis. The Doctor and Clara escape, the former having an epiphany as to how Davros somehow put a sliver of compassion into the Daleks. He then returns to the battlefield in Davros' childhood, using a Dalek gun to destroy the handmines with the one bit of compassion in Davros' life instilled in the Daleks' design to ensure Clara being saved."]}, {"page": "Physical theatre", "response": ["*Jami Reid-Quarrell"]}, {"page": "Love Never Dies (musical)", "response": ["| align=\"center\"| Jami Reid-Quarrell"]}, {"page": "The Magician's Apprentice (Doctor Who)", "response": ["Kelly Hunter had previously appeared as the Shadow Architect in the Series 4 episode \"The Stolen Earth\", with Julian Bleach also having appeared as Davros in that episode and its conclusion, \"Journey's End\". Clare Higgins played Ohila of the Sisterhood of Karn in the mini-episode \"The Night of the Doctor\", which was part of the 50th Anniversary specials in 2013, and again in the season finale \"Hell Bent\". Jami Reid-Quarrell made a subsequent appearance as \"The Veil\" in \"Heaven Sent\", the penultimate episode of Series 9."]}, {"page": "Heaven Sent (Doctor Who)", "response": ["In the episode, the alien time traveller the Twelfth Doctor (Peter Capaldi) is imprisoned in a waterlocked castle by his people, the Time Lords. A shrouded creature (played by Jami Reid-Quarrell) pursues the Doctor in an attempt to interrogate truths from him. The episode received universal critical acclaim, with many labelling it one of the strongest episodes of the ninth series and of the show overall. Special attention was given to Capaldi's acting, Moffat's writing, and Talalay's direction.", "This episode primarily features the Doctor, with the non-speaking Veil portrayed by movement artist Jami Reid-Quarrell (who also appeared as Colony Sarff in \"The Magician's Apprentice\" / \"The Witch's Familiar\" earlier in the series). Former companion Clara (Jenna Coleman) and an uncredited Gallifreyan child also make brief appearances."]}, {"page": "Hell Bent (Doctor Who)", "response": ["Maisie Williams, who played Ashildr in \"The Girl Who Died\", \"The Woman Who Lived\" and \"Face the Raven\", appeared in this episode, as did Ken Bones, who reprised his role from \"The Day of the Doctor\" and Clare Higgins, who played Ohila. Timothy Dalton, who had previously played Rassilon in \"The End of Time\", was asked to reprise the role but was unavailable for filming. Donald Sumpter previously appeared as Enrico Casali in The Wheel in Space (1968) and as Commander Ridgeway in The Sea Devils (1972). He also appeared in The Eternity Trap (2009), a story from spin-off series The Sarah Jane Adventures, playing Erasmus Darkening. Jami Reid-Quarrell returned as a Wraith, after previously playing Colony Sarff in \"The Magician's Apprentice\" / \"The Witch's Familiar\", as well as the Veil in \"Heaven Sent\"."]}, {"page": "Jami (name)", "response": ["*Jami Reid-Quarrell (born 1978), Scottish actor"]}, {"page": "The Coach with the Dragon Tattoo", "response": ["Class follows four students of Coal Hill Academy and their alien teacher, as they deal with various alien threats. In this episode, the students, while trying to get over the traumatic events of the previous episode, must find and defeat a dragon-like alien of unknown origin who brutally murders people of the Academy. Meanwhile, Miss Quill (Katherine Kelly) feels that the inspector in charge of reviewing her (Jami Reid-Quarrell) might not be who he appears to be."]}, {"page": "Quarrell", "response": ["*Jami Reid-Quarrell (born 1978), Scottish actor"]}]}}