{"wiki_id": "http://www.wikidata.org/entity/Q2453511", "itemLabel": "Russell Anderson", "itemDescription": "Scottish association football player (born 1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Russell_Anderson", "wikipedia_page": {"main": "Russell Anderson (born 25 October 1978) is a Scottish former professional footballer who played as a centre back. He played in the Scottish leagues for Aberdeen, the Premier League for Sunderland, and the Football League for Plymouth Argyle, Burnley and Derby County. Anderson won 11 caps for Scotland at full international level between 2002 and 2008.\n\n", "link_mentions": [{"page": "October 25", "response": ["*1978 – Russell Anderson, Scottish footballer"]}, {"page": "1978", "response": ["** Russell Anderson, Scottish footballer"]}, {"page": "Aberdeen F.C.", "response": ["* Russell Anderson (1996–2007, 2012–15)", "|align=\"left\"|Russell Anderson"]}, {"page": "List of Aberdonians", "response": ["*Russell Anderson (born 1978), footballer"]}, {"page": "Kevin McNaughton", "response": ["Beginning his career in the Scottish Premier League with Aberdeen after coming through the club's youth programme, where he won the Scottish Youth Cup in 2000–01, McNaughton was thrust into the first team at 18, making his debut on 5 October in a 2–1 win over St Mirren, and became a regular for the 2000–01 and 2001–02 seasons in a team containing lots of young players brought through the youth system like Darren Mackie, Russell Anderson and Darren Young. A knee injury sustained in 2002 kept him out for 12 weeks and on his return McNaughton struggled to return to form. It wasn't until new Aberdeen manager Jimmy Calderwood arrived, that he managed to recover his previous form."]}, {"page": "Aberdeen Grammar School", "response": ["The most notable alumnus is Lord Byron, the Romantic poet and writer.  A statue of him was erected in the front courtyard of the school.  Other alumni include Scottish international footballer Russell Anderson, mathematician Hector Munro Macdonald,", "* Russell Anderson, Scotland international footballer, captain of Aberdeen F.C.."]}, {"page": "Gary Teale", "response": ["In 2008, he was called up to George Burley's first Scotland squad alongside fellow on loan Plymouth player Russell Anderson."]}, {"page": "Paul Lawson (footballer)", "response": ["In September 2017 he was appointed as player/manager of the club, with Russell Anderson his assistant.", "His brother-in-law is former Aberdeen captain Russell Anderson (Anderson is married to Lawson's sister), and he was an Aberdeen fan while growing up, along with his family."]}, {"page": "Lee Croft", "response": [":A.  Soccerbase's stats for the match between Nottingham Forest and Derby County on 17 September 2011 count a substitute appearance made by Croft, however it should be credited to Russell Anderson. Therefore, until and unless they correct it, he should have one less appearance for Derby than given on his Soccerbase page."]}, {"page": "Anderson (surname)", "response": ["*Russell Anderson (born 1978), Scottish footballer"]}, {"page": "Derek McInnes", "response": ["The club had a positive start to 2014, taking maximum points from games against Dundee United, Kilmarnock and Hibs. At the end of the month Russell Anderson scored in the 94th minute to level the game at 2–2 and secure a point for the Dons against Motherwell at Fir Park to keep them in second place. McInnes praised his players and believed they \"showed good determination to get something from the game.\" He was rewarded for his efforts as he picked up the Manager of the month award for February. Ahead of the League Cup final, McInnes signed an extension to his contract, tying himself to the club until the summer of 2017."]}, {"page": "Scott Severin", "response": ["In July 2004, Severin left Hearts on the expiration of his contract, and became Jimmy Calderwood's first signing at Aberdeen. He signed a new three-and-a-half-year contract with Aberdeen in December 2005. On the final day of the 2006–07 season, Severin scored in a victory against rivals Rangers which secured a UEFA Cup place for the following season. In July 2007 he was handed the captaincy of Aberdeen, succeeding Russell Anderson."]}, {"page": "Zander Diamond", "response": ["In the 2005–06 season, Jimmy Calderwood was appointed Aberdeen manager. He quickly tied Diamond down on a long-term contract after his partnership with Aberdeen captain Russell Anderson helped the club narrowly miss out on European qualification.Aberdeen Football Club website , afc.co.uk; accessed 14 August 2014."]}, {"page": "Ebbe Skovdahl", "response": ["In the following season Aberdeen's fortunes improved domestically, but were knocked out of the 2000–01 UEFA Cup by Irish side Bohemians on the away goals rule. This was the first time that a Scottish club had been knocked out of European competition by Irish opposition. The next year Aberdeen improved dramatically as Skovdahl guided them to 4th place in the 2001–02 Scottish Premier League. Young players such as Kevin McNaughton, Russell Anderson, Philip McGuire, striker Darren Mackie, and goalkeeper Ryan Esson were developed."]}, {"page": "2006–07 Scottish Premier League", "response": ["|November||  Craig Levein (Dundee United)  ||  Russell Anderson (Aberdeen) ||  Anthony Stokes (Falkirk)"]}, {"page": "1978 in the United Kingdom", "response": ["* 25 October – Russell Anderson, footballer"]}, {"page": "Sportsound", "response": ["| 2005–06 || Russell Anderson || Aberdeen"]}, {"page": "Mark Reynolds (footballer, born 1987)", "response": ["Reynolds was appointed vice-captain of Aberdeen for the 2013–14 season. In August 2013, he scored in a 3–1 win against his former club Motherwell. On 28 February 2014, Reynolds signed a new four-year contract extension. At that time, former Aberdeen captain Willie Miller compared Reynolds's central defensive partnership with Russell Anderson to his own successful pairing with Alex McLeish."]}, {"page": "List of Scottish Premier League monthly award winners", "response": ["| Russell Anderson (Aberdeen)"]}, {"page": "2007–08 Aberdeen F.C. season", "response": ["|  Russell Anderson || Sunderland || £1 Million", "On 27 June, club captain Russell Anderson moved to Premier Leagu side Sunderland, signing a 3-year contract with the club. He donated his signing-on fee to the youth development scheme at Pittodrie.Anderson seals Sunderland switch, BBC Sport, 27 June 2007"]}, {"page": "2007–08 Sunderland A.F.C. season", "response": ["|align=\"left\"|21||align=\"left\"|DF||align=\"left\"|Russell Anderson ", "|Russell Anderson", "|Russell Anderson"]}, {"page": "Russell Anderson (disambiguation)", "response": ["Russ or Russell Anderson may refer to:", "*Russell Anderson (born 1978), Scottish footballer", "*Russell Anderson (politician) (born 1951), Australian politician"]}]}}