{"wiki_id": "http://www.wikidata.org/entity/Q2463992", "itemLabel": "Alf Common", "itemDescription": "English footballer (1880-1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alf_Common", "wikipedia_page": {"main": "Alfred Common (25 May 1880 in Millfield (Sunderland) – 3 April 1946 in Darlington) was an English footballer who played at inside forward or centre forward. He is most famous for being the first player to be transferred for a fee of £1,000 on his transfer to Middlesbrough from Sunderland in 1905.\n\n", "link_mentions": [{"page": "1946", "response": ["** Alf Common, English footballer (b. 1880)"]}, {"page": "1880", "response": ["** Alf Common, English footballer (d. 1946)"]}, {"page": "1905 in sports", "response": ["* Alf Common becomes the first player ever to be transferred for £1,000 when he moves from Sunderland to Middlesbrough"]}, {"page": "Middlesbrough F.C.", "response": ["In 1903, the club moved to Ayresome Park, their home for the next . In 1905, the club sanctioned the transfer of Alf Common for £1,000, a record fee. Over the next few years, their form fluctuated greatly, rising to sixth in 1907–08 before dropping to 17th two seasons later. The club rose to their highest league finish to date, third, in 1913–14. World War I soon intervened and football was suspended.", "* Alf Common"]}, {"page": "Middlesbrough", "response": ["Middlesbrough FC is a Championship football team, owned by local haulage entrepreneur Steve Gibson and managed by Neil Warnock. The 34,000 capacity Riverside Stadium is owned and host to home games by the club since 1995, when they left Ayresome Park. Founder members of the Premier League in 1992, Middlesbrough won the Football League Cup in 2004, and were beaten finalists in the 2005-06 UEFA Cup. In 1905, they made Britain's first £1,000 transfer when they signed Alf Common from local rivals Sunderland. Middlesbrough Ironopolis FC was briefly based in the town during the late 19th century, it later dissolved."]}]}}