{"wiki_id": "http://www.wikidata.org/entity/Q24668273", "itemLabel": "Rosena Allin-Khan", "itemDescription": "British politician (born 1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/Rosena_Allin-Khan", "wikipedia_page": {"main": "Rosena Chantelle Allin-Khan (born 1977) is a British doctor and politician serving as Shadow Cabinet Minister for Mental Health since 2020. A member of the Labour Party, she has been Member of Parliament (MP) for Tooting since the 2016 Tooting by-election.\nShe stood as a candidate at the 2020 Labour Party deputy leadership election, finishing in second-place after three rounds of voting. She was previously Shadow Minister for Sport between October 2016 and January 2020.", "link_mentions": [{"page": "Tooting", "response": ["The Member of Parliament for Tooting is Dr Rosena Allin-Khan of the Labour Party, who was first elected in a 2016 by-election to represent the parliamentary constituency of Tooting. This followed the election of her predecessor Sadiq Khan to the role of Mayor of London in May 2016."]}, {"page": "Brunel University London", "response": ["* Rosena Allin-Khan (Medical Biochemistry ), Labour Party politician, MP For Tooting"]}, {"page": "Lucy Cavendish College, Cambridge", "response": ["* Rosena Allin-Khan, Member of Parliament for Tooting since 2016."]}, {"page": "List of United Kingdom MPs: A", "response": ["|Rosena Allin-Khan"]}, {"page": "St George's Hospital", "response": ["* Rosena Allin-Khan, doctor and Labour MP for Tooting"]}, {"page": "Tooting (UK Parliament constituency)", "response": ["Tooting is a constituency created in 1974 in Greater London. It is represented in the House of Commons of the UK Parliament since 2016 by Dr. Rosena Allin-Khan, a member of the Labour Party.", "|Rosena Allin-Khan"]}, {"page": "Furzedown", "response": ["Rosena Allin-Khan is now the MP for the area having won the by-election in June 2016 - 2016 Tooting by-election."]}, {"page": "List of Parliamentary constituencies in London", "response": ["| Dr Rosena Allin-Khan‡"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Rosena Allin-Khan, Tooting, 2016–present"]}, {"page": "Official Opposition frontbench", "response": ["| colspan=\"2\" rowspan=\"3\" |Rosena Allin-Khan", "Starmer conducted a post-local election reshuffle from 8 to 9 May, which began with the sacking of Angela Rayner as Party Chair and Campaign Coordinator. However, she successfully negotiated a larger role as Shadow Chancellor of the Duchy of Lancaster and Shadow Secretary of State for the Future of Work. Rosena Allin-Khan, Rachel Reeves and Cat Smith received promotions, alongside Alan Campbell, Shabana Mahmood, Lucy Powell and Wes Streeting who joined the Shadow Cabinet. Allin-Khan and Smith became Secretaries of State for their previous portfolios, and Streeting was given the new position of Shadow Child Poverty Secretary. Anneliese Dodds and Thangam Debbonaire changed roles, but Nick Brown and Valerie Vaz left the opposition front bench. Dodds and Mahmood also replaced Jim McMahon and Jo Stevens as front bench Labour NEC representatives.", "The Shadow Secretary of States for Mental Health and International Development were demoted to shadow ministers, but still sitting in the shadow cabinet, at a rank similar to Shadow Chief Secretary to the Treasury.  Preet Gill became Shadow Cabinet Minister for International Development under the Shadow Foreign Secretary and Rosena Allin-Khan became Shadow Cabinet Minister for Mental Health under the Shadow Health Secretary."]}, {"page": "1977 in the United Kingdom", "response": ["*1 January – Rosena Allin-Khan, politician"]}, {"page": "Matt Hancock", "response": ["Hancock received criticism for perceived sexism after suggesting on 5 May 2020 that Labour MP and shadow health minister Rosena Allin-Khan change the \"tone\" of her comments. Allin-Khan, a doctor, had stated in Parliament a lack of testing was costing lives when Hancock suggested she should \"take a leaf out of the Shadow Secretary of State's [Jonathan Ashworth's] book in terms of tone\"."]}, {"page": "United Kingdom by-election records", "response": ["* Rosena Allin-Khan was the first Muslim by-election victor, at the 2016 Tooting by-election."]}, {"page": "Poles in the United Kingdom", "response": ["*Rosena Allin-Khan (born 1977) – medical practitioner and Labour Party MP for Tooting in London"]}]}}