{"wiki_id": "http://www.wikidata.org/entity/Q24700938", "itemLabel": "Richard Pape", "itemDescription": "British writer and explorer", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Pape", "wikipedia_page": {"main": "Richard Bernard Pape MM (17 March 1916 – 19 June 1995) was a British Second World War escapee, adventurer, autobiographer and novelist.\nPape was born in 1916 in Roundhay, Leeds, Yorkshire. He worked as a journalist in the Yorkshire Post's publicity department, but on the outbreak of the Second World War he joined the Royal Air Force.He became a sergeant navigator in a Short Stirling bomber. On a 1941 mission he was shot down close to the German/Dutch border, was twice captured and twice escaped. Following his second capture he was tortured by the Gestapo. He was repatriated by the Germans on health grounds in 1944.In November of that year he was on a retraining course when he was burnt in a drunken motorcycle accident on the Isle of Man, which led to his being hospitalised at Queen Victoria Hospital, East Grinstead, for pioneer plastic surgery under Archibald McIndoe: he thus became a member of the Guinea Pig Club.He was discharged in 1947 and decorated for his persistence as an escaper. He went to live in South Africa and wrote a book-length account of his adventures, Boldness Be My Friend, which he said he wrote to exorcise the \"demons\" which plagued him after the war.  The book was brought to Anthony Blond's London literary agency in 1952 by Vanora McIndoe, Sir Archibald's daughter. After being read and approved by Blond's colleague Isabel Colegate, it was published in 1953 by Paul Elek, who paid a £600 advance.Still fighting his demons, in 1954 he drove \"17,500 miles\" from the North Cape in Norway to the Cape of Good Hope in South Africa, in an Austin A90 Westminster. He then wrote a book, Cape Cold to Cape Hot (1956), about his adventures en route, \"which came close to killing him\".He later undertook similar endurance drives in North America for the Rootes Group and embarked on further adventures in Antarctica, where he fell in the sea at McMurdo Sound.In 1964, following the advice of his colleague Leonard Cheshire, VC, that he should \"do something useful with his life instead of trying to repeatedly kill himself\", Pape went to Papua New Guinea where he established a Leonard Cheshire Home for \"mentally handicapped native children\". He also worked as Principal Publications Officer of the Australian administration's Department of Information. He would spend nine and a half years in Papua New Guinea and, while there, he met and married Stephanie Prouting, a solicitor working for the Public Solicitor's Office in Port Moresby.In June 1965, Pape returned his Military Medal to the Queen in protest at The Beatles having been awarded the MBE. He was quoted as saying: \"The Beatles' MBE reeks of mawkish, bizarre effrontery to our wartime endeavours.\"He died in Canberra, Australia in 1995 at the age of 79.", "link_mentions": [{"page": "Guinea Pig Club", "response": ["*Richard Pape (1916–1995)"]}, {"page": "List of people who have declined a British honour", "response": ["*In June 1965 a number of holders of honours and decorations, mainly awarded for military service, returned their insignia in protest at the nomination of the four members of The Beatles for the MBE. They included Hector Dupuis, a member of the House of Commons of Canada, Paul Pearson, a former RAF squadron leader, and James Berg, all of whom returned their MBEs; David Evan Rees, a former sea captain, who returned his OBE; and Richard Pape, a wartime escapee and author, who returned his Military Medal."]}, {"page": "Mona Louise Parsons", "response": ["Upon the invasion of the Netherlands by the Germans in May 1940, Parsons joined a network of resistance composed of people from diverse walks of life: farmers, teachers, businesspeople. Like the famous Corrie ten Boom, Parsons sheltered downed Allied airmen in her home, \"Ingleside\", near Laren. At the beginning of the German occupation, Parsons dismissed her servants so that their quarters on the top floor of Ingleside could be used to accommodate Allied airmen. A hiding place, behind the closet in the master bedroom, was available as a temporary emergency shelter for the airmen if her home was searched by the Nazis. Once the pilots left Parsons' home, they were transported to Leiden, where fishing boats took them to rendezvous with British submarines for their return to England. The number of Allied pilots she saved is unknown. The last airmen to hide at Ingleside remained for an unprecedented six days in September 1941. The network had been infiltrated, and contacts were unable to move the airmen as previously planned. Flight Engineer William 'Jock' Moir and Navigator Richard Pape were finally moved to Leiden, where they were caught by the Gestapo.After the war, Richard Pape wrote a book about his wartime experiences: Boldness Be My Friend (1953). Pape briefly mentions Mona Leonhardt (Parsons) in Boldness Be My Friend, then in much more detail in Sequel To Boldness (1959) and again in the entirely rewritten Boldness Be My Friend (1984). In fact, Pape kept in contact with Mona after the war, and visited her on at least one occasion whilst her husband Billy Leondhart was still alive. He started work on her biography in the late 1950s, but this never came to anything."]}, {"page": "John Dundas (RAF officer)", "response": ["Dundas subsequently became a journalist for the Yorkshire Post and its editorial staff. Another who worked on the paper at the time, Richard Pape,Pape later served in RAF Bomber Command. He was taken prisoner by the Germans, but escaped by feigning illness and being repatriated during a prisoner exchange. His post-war account of his wartime career, Boldness Be My Friend (1953), was very successful. recalled him as a man indifferent to his personal appearance, who wore frayed trousers, frequently had ink-stained hands and would spill beer over himself when drinking, yet who was also popular with the newspaper's younger, female staff members."]}, {"page": "Paul Elek", "response": ["Paul Elek is a British publisher, the founder of Paul Elek Publishers, whose publication of Richard Pape's first book, Boldness Be My Friend saved him from bankruptcy.", "Richard Pape's first book, Boldness Be My Friend, was an account of his Second World War adventures as a navigator in a Lancaster bomber that was shot down close to the German/Dutch border, and his captures and escapes."]}, {"page": "Richard Bernard Pape", "response": ["#REDIRECT Richard Pape"]}, {"page": "Pape, Richard", "response": ["#redirectRichard Pape"]}, {"page": "Deaths in June 1995", "response": ["*Richard Pape, 79, British writer and POW escaper ."]}]}}