{"wiki_id": "http://www.wikidata.org/entity/Q24703084", "itemLabel": "Paul Matthews", "itemDescription": "musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Matthews_(musician)", "wikipedia_page": {"main": "Paul Michael Matthews (born 24 October 1978) is a New Zealand musician, songwriter, and record producer based in London (UK). He co-founded I Am Giant in 2008 and is the band's bass guitarist and songwriter. He was also the bass guitarist for New Zealand bands Stylus and Tadpole.\nMatthews also began producing records in 2002 with Blindspott's Self-titled Triple Platinum debut album. Matthews has since produced music for Six 60, Opshop and Setting Fire to Stacey among others.", "link_mentions": [{"page": "Paul Matthews", "response": ["Paul Matthews may refer to:", "* Paul Matthews (bishop) (1866–1954), Episcopal bishop of New Jersey", "* Paul Matthews (musician) (born 1978), New Zealand musician, songwriter, and record producer", "* Paul Matthews (poet), British poet featured in Children of Albion", "* Paul Matthews (footballer) (born 1946), English footballer"]}, {"page": "I Am Giant", "response": ["The band was formed by New Zealanders Shelton Woolright, Paul Matthews, who then recruited Brit Ed Martin. Drummer Shelton Woolright had been with Blindspott, the only rock band in New Zealand music history to have both their debut and follow up albums enter the charts at number 1 until NZ band Devilskin also took that honour in 2016. Bassist Paul Matthews credits include Tadpole, and more recently Stylus. Matthews is also a producer/engineer and has worked on high-profile kiwi artists including producing Blindspott's debut album. With Woolright they co-produced Six60's single \"Rise Up 2.0\" which has now gone double platinum.", "In December 2014 Ed Martin left the band to embark on a solo project which is to be produced by Paul Matthews.", "After Blindspott played their final concert in 2007, Shelton Woolright and fellow Kiwi Paul Matthews moved to London to look at starting a band in the UK. Matthews and Woolright auditioned over 150 singers and 120 guitarists before coming across Ed Martin and Max O'Donnell.", "In June the band started the recording of their unnamed second album at the Drop In Music Studio in Saint-Jean-de-Luz, France. Andrew Kerr did not travel for the recording, Michael Triponel and bassist Paul Matthews filled in on guitars. As with The Horrifying Truth, Forrester Savell is producing the album.", "* Paul Matthews – bass guitar, backup vocals, album guitars (2008–present)"]}, {"page": "Shelton Woolright", "response": ["Following his departure from Blindspott, Woolright formed the band I Am Giant in 2008 with Paul Matthews, Ed Martin and Max O'Donnell. The band currently consists of Woolright, Matthews and Aja Timu."]}, {"page": "Paul Matthews (New Zealand musician)", "response": ["#REDIRECT Paul Matthews (musician)"]}]}}