{"wiki_id": "http://www.wikidata.org/entity/Q24712818", "itemLabel": "Kit de Waal", "itemDescription": "English novelist and short story writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Kit_de_Waal", "wikipedia_page": {"main": "Mandy Theresa O'Loughlin (born 26 July 1960), known professionally as Kit de Waal, is a British/Irish writer. Her debut novel, My Name Is Leon, was published by Penguin Books in June 2016. After securing the publishing deal with Penguin, De Waal used some of her advance to set up the Kit de Waal Creative Writing Fellowship to help improve working-class representation in the arts. The audiobook version of My Name is Leon is voiced by Sir Lenny Henry. De Waal has also published short stories, including the collection Supporting Cast (2020).", "link_mentions": [{"page": "Lenny Henry", "response": ["* My Name Is Leon by Kit de Waal (audiobook) 2016."]}, {"page": "James Hawes (author)", "response": ["In 2008, James Hawes became Senior Lecturer in Creative Writing at Oxford Brookes University. In 2012 he was promoted to Reader. Among his former students there are Kit de Waal (My Name is Leon) and Catherine Chanter (The Well)."]}, {"page": "De Waal (surname)", "response": ["*Kit de Waal (born 1960) pseudonym of Irish/British writer Mandy O'Loughlin"]}, {"page": "Huddersfield Literature Festival", "response": ["Johnny Ball, Paul Burston, Ann Cleeves, Jon Copley, Kit de Waal, Professor Angela Gallop, Joanne Harris, Darren Henley, Alan Johnson, Kate Fox, Lisa Luxx, Owen O'Neill, Nikesh Shukla, Cath Staincliffe, Michael Stewart."]}, {"page": "Kerry Group Irish Fiction Award", "response": ["** Kit de Waal – My Name is Leon (Viking)"]}, {"page": "Desmond Elliott Prize", "response": ["| || My Name is Leon || Kit de Waal || Viking Press"]}, {"page": "Grand Hotel, Birmingham", "response": ["The hotel features in Kit de Waal's novel The Trick to Time."]}, {"page": "2013 Costa Book Awards", "response": ["*Kit de Waal, \"The Old Man and the Suit\""]}, {"page": "SI Leeds Literary Prize", "response": ["The 2014 judges – Kerry Young, Gail Bolland,\" Gail Bolland (co-ordinator)\", SI Leeds Literary Prize. Elise DillsworthElise Dillsworth Agency. and Kadija George – chose as first prizewinner Mahsuda Snaith\"Inscriber Mahsuda Snaith makes SI Leeds Literary Prize 2014 Shortlist\", Inscribe, 24 September 2014. for The Constellation of Ravine Roy. Season Butler won second prize for Hanging from the Hammer of the Bell, and Anita Sivakumaran won third prize for The Queen. The SI Readers' Choice award, chosen from the shortlist by some 20 SI members, went to Kit de Waal for Blue in Green.\"SI Leeds Literary Prize - 2014 Prize\", Ilkley Literature Festival."]}, {"page": "Daughters of Africa", "response": ["Among the contributors to New Daughters of Africa are: Adeola Solanke, Adrienne Kennedy, Afua Hirsch, Aida Edemariam, Aja Monet, Akosua Busia, Aminatta Forna, Amma Asante, Anaïs Duplan, Andaiye, Andrea Levy, Andrea Stuart, Angela Barry, Anni Domingo, Arthenia Bates Millican, Ayesha Harruna Attah, Ayeta Anne Wangusa, Ayòbámi Adébáyò, Barbara Chase-Riboud, Barbara Jenkins, Beatrice Lamwaka, Bernardine Evaristo, Beverley Bryan, Bonnie Greer, Bridget Minamore, Camille T. Dungy, Candace Allen, Candice Carty-Williams, Carolyn Cooper, Catherine Johnson, Chibundu Onuzo, Chika Unigwe, Chimamanda Ngozi Adichie, Chinelo Okparanta, Claudia Rankine, Cordelia Ray, Danielle Legros Georges, Delia Jarrett-Macauley, Diana Evans, Diana Ferrus, Diane Abbott, Donika Kelly, Doreen Baingana, Dorothea Smartt, Edwidge Danticat, Edwige-Renée Dro, Effie Waller Smith, Elizabeth Keckley, Elizabeth Nunez, Elizabeth Walcott-Hackshaw, Ellah Wakatama Allfrey, Ellen Banda-Aaku, Esi Edugyan, Eve Ewing, Florida Ruffin Ridley, Gabeba Baderoon, Gabrielle Civil, Glaydah Namukasa, Goretti Kyomuhendo, Hannah Azieb Pool, Harriet Anena, Hawa Jande Golakai, Hilda Twongyeirwe, Imbolo Mbue, Irenosen Okojie, Isabella Matambanadzo, Jackee Budesta Batanda, Jacqueline Bishop, Jay Bernard, Jennifer Nansubuga Makumbi, Jennifer Teege, Jesmyn Ward, Joan Anim-Addo, Joanne C. Hillhouse, Josephine St. Pierre Ruffin, Juliana Makuchi Nfah-Abbenyi, Juliane Okot Bitek, Kadija Sesay, Karen Lord, Karen McCarthy Woolf, Ketty Nivyabandi, Kit de Waal, Lebogang Mashile, Leila Aboulela, Leone Ross, Lesley Lokko, Linda Bellos, Lisa Allen-Agostini, Lola Shoneyin, Maaza Mengiste, Makhosazana Xaba, Malika Booker, Malorie Blackman, Margo Jefferson, Marie NDiaye, Marina Salandy-Brown, Marion Bethel, Maxine Beneba Clarke, Meta Davis Cumberbatch, Mildred Barya, Minna Salami, Monica Arac de Nyeko, Nadia Davids, Nadifa Mohamed, Nah Dove, Nalo Hopkinson, Namwali Serpell, Nana-Ama Danquah, Nana Asma'u, Nana Ekua Brew-Hammond, Nana Oforiatta Ayim, Natalia Molebatsi, Natasha Trethewey, Nawal El Saadawi, Nikky Finney, Nnedi Okorafor, Noo Saro-Wiwa, Novuyo Rosa Tshuma, Olúmìdé Pópóọlá, Panashe Chigumadzi, Patience Agbabi, Patrice Lawrence, Patricia Cumper, Phillippa Yaa de Villiers, Rachel Eliza Griffiths, Rashidah Ismaili, Rebecca Walker, Reni Eddo-Lodge, Rosamond S. King, Roxane Gay, Sade Adeniran, Safia Elhillo, Sandra Jackson-Opoku, Sapphire, Sarah Ladipo Manyika, Sarah Parker Remond, Sefi Atta, Simi Bedford, Sisonke Msimang, Stella Dadzie, SuAndi, Sue Woodford-Hollick, Summer Edward, Susan Kiguli, Taiye Selasi, Tanella Boni, Tess Onwueme, Tiphanie Yanique, Trifonia Melibea Obono, Valerie Tagwira, Verene Shepherd, Verna Wilkins, Wangui wa Goro, Wanjiku wa Ngũgĩ, Warsan Shire, Winsome Pinnock, Yaba Badoe, Yassmin Abdel-Magied, Yemisi Aribisala, Yewande Omotoso, Yolanda Arroyo Pizarro, Yrsa Daley-Ward, Yvonne Adhiambo Owuor, Yvonne Bailey-Smith, Yvonne Vera, Yvvette Edwards, Zadie Smith, Zandria Robinson, Zetta Elliott, Zita Holbourne, Zoe Adjonyoh, Zukiswa Wanner, and others.Otosirieze Obi-Young, \"Margaret Busby-Edited Anthology to Feature 200 Female Writers Including Adichie, Aminatta Forna, Bernadine Evaristo, Imbolo Mbue, Warsan Shire, Zadie Smith\", Brittle Paper, 10 January 2018.Emily Temple, \"LIT HUB'S MOST ANTICIPATED BOOKS OF 2019\", LitHub, 28 December 2018.Margaret Busby, \"From Ayòbámi Adébáyò to Zadie Smith: meet the New Daughters of Africa\", The Guardian, 9 March 2019.Carole Buchan, \"Anthology of writing by women of African descent features more than 200 contributors\", Sussex Express, 29 April 2019.\"Toni Morrison: Melissa Lucashenko and Maxine Beneba Clarke reflect on late author's legacy\", The Guardian, 8 August 2019. "]}, {"page": "The Moth (magazine)", "response": ["Previous judges include Mike McCormack, Belinda McKeon, Donal Ryan, Kit de Waal, Kevin Barry and Mark Haddon. The judge for 2021 is Ali Smith."]}, {"page": "Burt Caesar", "response": ["Also that year Caesar presented Black Screen Britain, a two-part Radio 4 documentary series exploring how British film and television drama portrayed post-war African-Caribbean migrants and created opportunities for pioneering black actors.\"Black Screen Britain\", The Black Presence in Britain, 28 March 2009.\"Black Screen Britain\", Culture Wise.Episodes: \"Reclaiming Our Image\" and \"Ambassadors for the Race\", Black Screen Britain, BBC Radio 4, September 2009. He is a regular reader of poetry and short stories on a variety of programmes, including Poetry Please.\"Love and the Rest\", Poetry Please, BBC Radio 4, 7 February 2016.\"Burt Caesar\", Radio Listings.\"The Beautiful Thing\" (\"A short story about emigration, backstory and new beginnings by Kit de Waal. Read by Burt Caesar\"), BBC Radio 4, 22 March 2015. On the programme A Good Read in 2010, Caesar's choice of book was C. L. R. James's Beyond a Boundary.Tricia Wombell, \"A Good Read: Cricket lovely cricket\", Black Book News, 5 April 2010."]}, {"page": "Kit de waal", "response": ["#REDIRECT Kit de Waal"]}, {"page": "Kit de Waal Creative Writing Scholarship", "response": ["#REDIRECT Kit de Waal"]}, {"page": "The Literary Consultancy", "response": ["In 2009, TLC became a resident founding member of the Free Word Centre — an international organisation for literature, literacy and freedom of expression – where events are hosted, including an annual literary conference. \"The Literary Conference: Writing in a Digital Age\" ran for the first time at the Free Word Centre in June 2012. In 2016, TLC's 20th birthday was celebrated with the hosting of the \"industry conversation\" What’s Your Story? in association with Writers' Centre Norwich, Free Word Centre, Apples & Snakes, English PEN and FMcM, featuring a specially commissioned poem by Lemn Sissay, a symposium chaired by Professor Jon Cook (University of East Anglia), and contributions from guest speakers including Kit de Waal, Giles Duley, Margaret Busby, Elif Shafak, Henny Beaumont, Mark Ball, Raymond Antrobus and Abi Morgan, following a keynote address by TLC founder Becky Swift."]}, {"page": "New Binary Press", "response": ["A number of New Binary Press publications represent marked political leanings. In 2017, the press published The Elysian: Creative Responses, an anthology of poetry, short fiction, and critical essays which respond to The Elysian in Cork city, a building which Marjorie Brennan describes as a \"a symbol of the worst excesses of the Celtic Tiger\". Edited by Graham Allen and Billy Ramsell, the collection includes contributions by a number of notable writers and critics, including Cónal Creedon, Doireann Ní Ghríofa, and Frank McDonald. Earlier in 2017, New Binary Press released John Barber's Remembering the Dead: Northern Ireland, a Web-based commemoration of the victims of The Troubles which builds on earlier iterations intended as a response to gun violence in the US. In 2018, New Binary Press published Autonomy, edited by Kathy D'Arcy, a project which sought to raise funds in support of the campaign to repeal the Eight Amendment of the Irish Constitution, as well as contribute to the campaign for \"safe, legal abortion\" in Ireland. Kit de Waal has associated New Binary Press with the publication of working class writers."]}, {"page": "Books Are My Bag Readers' Awards", "response": ["|Kit de Waal"]}, {"page": "List of black British writers", "response": ["* Kit de Waal (born 1960)"]}, {"page": "The Third Day (TV series)", "response": ["The series was commissioned in June 2019, with the announcement that Jude Law was cast in the lead role. Marc Munden was hired to direct the first three episodes, with Dennis Kelly writing.Jude Law To Star In HBO & Sky Mystery Drama 'The Third Day' From Sky Studios & Plan B Entertainment In July, Katherine Waterston, Paddy Considine and Emily Watson were added to the cast.Katherine Waterston Circling HBO & Sky's Jude Law Mystery Drama 'The Third Day'Katherine Waterston, Paddy Considine, Emily Watson board Sky/HBO series 'The Third Day' (exclusive) Naomie Harris and John Dagleish were added in August, with Philippa Lowthorpe hired to direct the final three episodes of the series. Kit de Waal and Dean O'Loughlin also joined Kelly to co-write two episodes.Naomie Harris Joins HBO & Sky Mystery Drama 'The Third DayThe Third Day': 'Mary Poppins Returns' Star John Dagleish Joins HBO & Sky Mystery Drama"]}, {"page": "BBC list of 100 \"most inspiring\" novels", "response": ["The BBC relied on six experts: Stig Abell, Mariella Frostrup, Juno Dawson, Kit de Waal, Alexander McCall Smith and Syima Aslam.  The CBC characterized the panel as composed of \"writers, curators and critics\".  According to The Guardian, the list commemorated the publication of Robinson Crusoe, 300 years earlier – \"widely seen as the progenitor of the English-language novel\"."]}, {"page": "List of women writers (M–Z)", "response": ["*Kit de Waal (b. 1960, England/Ireland), nv."]}, {"page": "My Name Is Leon", "response": ["#REDIRECT Kit de Waal"]}]}}