{"wiki_id": "http://www.wikidata.org/entity/Q2470305", "itemLabel": "Briton Rivière", "itemDescription": "British artist of Huguenot descent (1840-1920)", "wikipedia_url": "https://en.wikipedia.org/wiki/Briton_Rivi%C3%A8re", "wikipedia_page": {"main": "Briton Rivière  (14 August 1840 in London – 20 April 1920 in London) was a British artist of Huguenot descent. He exhibited a variety of paintings at the Royal Academy, but devoted much of his life to animal paintings.", "link_mentions": [{"page": "Saint George and the Dragon", "response": ["* Briton Rivière, St. George and the Dragon, c. 1914."]}, {"page": "Sydney Thompson Dobell", "response": ["Sydney Dobell was also famous as an early breeder of deerhounds. One was given to him by Mr Ronald McDonald of Skye. She was supposed to be descended from the deerhounds of Cher Foreman McDonald. Later generations of his deerhounds were painted by Sydney Dobell's brother-in-law, Briton Rivière, notably in The empty chair, which was first exhibited at the Dudley Gallery, London, in 1869. It was bought for a great deal of money by Howard Dobell, his uncle. It was owned in 1924 by Ralph Dobell, Brooklands, Cheltenham who lent it to an exhibition at Cheltenham Art Gallery & Museum."]}, {"page": "1920 in the United Kingdom", "response": ["* 20 April – Briton Rivière, painter (born 1840)"]}, {"page": "Edward Onslow Ford", "response": ["Much of Ford's early success came in portraiture. His portrait busts are extremely refined and show his subjects at their best.  He sculpted many portrait busts which are noted for their tasteful conception, delicate modelling, and verisimilitude. The best, perhaps, are the heads of John Everett Millais, Thomas Huxley, Herbert Spencer, Sir WQ Orchardson, Matthew Ridley Corbet, the duke of Norfolk, Briton Rivière, Sir Lawrence Alma-Tadema, Sir Walter Armstrong, Sir Hubert von Herkomer, Arthur Hacker (1894), and M. Dagnan-Bouveret. Those in bronze of his fellow-artist Arthur Hacker (1894) and of the politician Arthur Balfour are striking likenesses, as is the marble statue of Sir Frederick Bramwell for the Royal Institution."]}, {"page": "1877 in art", "response": ["* Briton Rivière"]}, {"page": "Rivière", "response": ["* Briton Rivière (1840–1920), British artist"]}, {"page": "1920 in art", "response": ["* April 20 – Briton Rivière, British painter (b. 1840)"]}, {"page": "The New Art Gallery Walsall", "response": ["The permanent collection of artworks at the Gallery incorporates the municipal holdings built up from 1892, from the formal foundation of Walsall's art collection. It ranges from Victorian paintings by Frank Holl and Briton Rivière, including some of local interest through to works by contemporary artists, such as Catherine Yass, Robert Priseman and Fiona Banner. Through the Contemporary Art Society Special Collection scheme, the New Art Gallery Walsall was able to add to its collections works by Gavin Turk, Hew Locke, Mike Nelson, Yoshihiro Suda, Dorothy Cross, Laura Ford, Darren Lago, Estelle Thompson, Richard Woods, Yinka Shonibare and Rose Finn-Kelcey. The works that comprise this collection transfer ownership to Walsall Council from the Contemporary Art Society in 2014.", "Cupboard Love Briton Riviere.jpg|Cupboard Love (Briton Rivière) 1881"]}, {"page": "Briton Riviere", "response": ["#REDIRECT Briton Rivière"]}, {"page": "The Expression of the Emotions in Man and Animals", "response": ["The published book assembled illustrations rather like a Victorian family album, with engravings of the Darwin family's domestic pets by the zoological illustrator T. W. Wood as well as work by the artists Briton Rivière, Joseph Wolf and A.D. May. It also included portraits by the Swedish photographer Oscar Rejlander (1813–1875), anatomical diagrams by Sir Charles Bell (1774–1842) and Friedrich Henle (1809–1885), as well as illustrational quotations from the Mécanisme de la physionomie humaine (1862) by the French neurologist Duchenne de Boulogne (1806–1875).Duchenne (de Boulogne), G.-B., (1990) The Mechanism of Human Facial Expression by Guillaume-Benjamin (Amand) Duchenne de Boulogne edited and translated by R. Andrew Cuthbertson, Cambridge University Press and Paris: Éditions de la Maison des Sciences de L'Homme, originally published (1862) Paris: Éditions Jules Renouard, Libraire As a result of his domestic psychology experiments, Darwin reduced the number of commonly observed emotions from Duchenne's calculation of more than sixty facial expressions, to just six \"core\" expressions: anger, fear, surprise, disgust, happiness and sadness."]}, {"page": "1878 in art", "response": ["* Briton Rivière – Persepolis"]}, {"page": "Aggravation", "response": ["* Aggravation (1896), a painting by Briton Rivière, English artist "]}, {"page": "1840 in art", "response": ["* August 14 – Briton Rivière, English painter (died 1920)"]}, {"page": "From the Lions Mouth", "response": ["The album cover artwork was taken from the 1872 painting Daniel in the Lion's Den by Briton Rivière.", "* Briton Rivière – album cover artwork"]}, {"page": "Briton (disambiguation)", "response": ["*Briton Rivière (1840-1920), British painter"]}, {"page": "Diogenes and Alexander", "response": ["Edwin Landseer's Alexander and Diogenes presents the encounter between the twain as between two dogs.  Alexander is a white bulldog with a military collar who looks down haughtily upon Diogenes, represented as a scruffy farrier's dog in a barrel.  Landseer was inspired to create the painting when he encountered two dogs in the street, one observing the other from within a barrel, and was reminded of the encounter between Alexander and Diogenes.  The painting in turn was to become the inspiration for the anthropomorphic dogs in Disney's Lady and the Tramp.  Charles Darwin and Briton Rivière agreed with each other that the hair of the Alexander dog was inaccurately represented."]}, {"page": "Joan Riviere", "response": ["Riviere married Evelyn Riviere, a barrister and son of artist Briton Rivière in 1906. Their only child, Diana, was born in 1908."]}, {"page": "Rest in peace", "response": ["File:Briton Rivière - Requiescat - Google Art Project.jpg|Requiescat, oil on canvas painting by Briton Rivière, 1888, Art Gallery of New South Wales."]}, {"page": "National Kaiser Wilhelm Monument", "response": ["The design was mockingly known by the nickname Wilhelm in the lions' den. This alluded to the compositional appeal of the central figure in a semicircle, which was similar to Briton Rivière recent painting Daniel's Answer to the King."]}, {"page": "Briton Reviere", "response": ["#REDIRECT Briton Rivière"]}, {"page": "Daniel in the lions' den", "response": ["*Briton Rivière, Daniel's Answer to the King"]}, {"page": "April 1920", "response": ["*Died: Briton Rivière, 79, British painter"]}, {"page": "Hugh Goldwin Rivière", "response": ["Hugh Goldwin Rivière (1869–1956) was a noted British portraitist. He was one of seven children of Briton Rivière and was of Huguenot descent."]}, {"page": "List of Royal Academicians", "response": ["| Briton Rivière   ||align=\"center\" |  1881  || "]}, {"page": "Cultural depictions of dogs", "response": ["File:Briton Rivière - Requiescat - Google Art Project.jpg|Briton Rivière (1840-1920) Requiescat (Rest in peace) 1888"]}, {"page": "Frederick Stacpoole", "response": ["Most of Stacpoole's plates were executed in a mixed mezzotint style (i.e. mezzotint with some line engraving and stipple engraving). His work was only of reproductions, including a large number of prints after Briton Rivière (chiefly published by Messrs. Agnew), Thomas Faed (chiefly published by Messrs. H. Graves), and Charles Burton Barber. He also engraved pictures by others.Joshua Reynolds, Richard Ansdell, Sir Francis Grant, Sir John Watson-Gordon, Edwin Landseer, Thomas Brooks, Robert Collinson, Jerry Barrett, Alice Havers, John Frederick Tayler, A. Bouvier, Philip Richard Morris, and James Sant."]}, {"page": "Victorian painting", "response": ["Landseer and other animal painters such as Briton Rivière also became well known for sentimental paintings of dogs. Landseer's The Old Shepherd's Chief Mourner, showing a sheepdog sitting beside a coffin, was particularly well-regarded by John Ruskin, who described it as \"a touching poem upon canvas, which, it cannot be doubted, has caused many a stout heart to 'play the woman' by moving it to tears\". Many of the artists of the period were keen huntsmen, and accepted as a given that nature was inherently cruel and that learning to embrace this cruelty was a mark of manliness. In this context, dogs exhibiting emotions were a highly popular topic in a time of rapidly declining religious faith, suggesting the possibility of a nobility within nature that transcended cruelty and the will to live as a driving force."]}]}}