{"wiki_id": "http://www.wikidata.org/entity/Q247462", "itemLabel": "Ryan Shawcross", "itemDescription": "English association football player (born 1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ryan_Shawcross", "wikipedia_page": {"main": "Ryan James Shawcross (born 4 October 1987) is an English former professional footballer who played as a centre-back.\nShawcross began his career with Manchester United and made his debut for the club against Crewe Alexandra in the League Cup; he then spent time on loan at Belgian feeder club Royal Antwerp. He joined Championship club Stoke City on loan in August 2007 and made an instant impact scoring on his debut against Cardiff City. His good form prompted Stoke to pay Manchester United £1 million in January 2008 to keep him at the Britannia Stadium. He formed a good defensive partnership with Leon Cort as Stoke gained promotion to the Premier League for the first time, ending 23 years away from the top flight.\nDespite making a bad start to Premier League football, Shawcross established himself as first-choice centre-back along with Abdoulaye Faye. Stoke comfortably stayed up, and after another mid-table finish in 2009–10, Shawcross was handed the captaincy by manager Tony Pulis ahead of the 2010–11 season. With Faye drifting out of the team, Robert Huth became Shawcross's defensive partner and the team reached the 2011 FA Cup Final, finishing runners-up to Manchester City. The run to the final also meant that Stoke entered the UEFA Europa League in 2011–12, and they reached the round of 32 losing to Spanish team Valencia. Shawcross continued to be a regular under Pulis in 2012–13 and then under Mark Hughes in 2013–14 which saw him win the player of the year award. Shawcross remained at Stoke until February 2021, after making 453 appearances over a 14-year period with the club.", "link_mentions": [{"page": "Chester", "response": ["* Ryan Shawcross (born 1987), Stoke City F.C. footballer"]}, {"page": "Buckley, Flintshire", "response": ["*Ryan Shawcross, a professional footballer with Stoke City."]}, {"page": "Ricardo Fuller", "response": ["Fuller scored his first goal of the 2010–11 season against Tottenham Hotspur at the Britannia Stadium. He then dislocated his shoulder for the second time in his Stoke career away at Newcastle United and then suffered a repeat injury in the next away match at Bolton. He made his 150th league appearance for Stoke on 6 November 2010 against Sunderland. Fuller scored his 100th goal in British football on 9 November against Birmingham City with another sole effort. In the January transfer window there was strong rumours that Fuller would be leaving Stoke to join Sunderland. However Sunderland denied that they made a bid for Fuller. Following the 5–0 FA Cup semi-final win over Bolton Wanderers Stoke captain Ryan Shawcross revealed that a speech from Fuller inspired the team. In the next match against Aston Villa Fuller sustained an Achilles tendon injury and missed the rest of the 2010–11 season including the 2011 FA Cup Final."]}, {"page": "Tony Pulis", "response": ["Pulis was named Manager of the Month for April 2007 after Stoke picked up 11 points from 5 league games. This unbeaten run lifted Stoke to seventh in the table, on equal points with sixth-place Southampton. A 1–1 draw against Queens Park Rangers on the final day of the season, however, led to Stoke finishing eighth in the Championship. Pulis sold several key players prior to the 2007–08 season; club captain Danny Higginbotham was one of a number of players to depart, joining Sunderland for £3 million. Pulis, however, utilised the loan market again, signing five players on loan, including Ryan Shawcross from Manchester United, with a few of these loan signings joining on a permanent deal in the January transfer window."]}, {"page": "Matthew Upson", "response": ["Upson joined Stoke City on a two-year contract on 9 August 2011. He said that playing in the UEFA Europa League was one of the main reasons he decided to join Stoke. Upson made his debut for Stoke in a 1–0 victory over FC Thun in the Europa League, and scored his first goal for the club in the second leg in a 4–1 victory at the Britannia Stadium. After joining Stoke, Upson and fellow summer signing Jonathan Woodgate were used as backup to first-choice centre backs Robert Huth and Ryan Shawcross. He was a regular in the Europa League, appearing in all six group matches, but was sent off in the last as Stoke qualified for the round of 32. He scored his first league goal for Stoke in a 2–0 home win against Swansea City on 26 February 2012 in a man-of-the-match performance. With Shawcross suspended, Upson made his first League appearance of the 2012–13 season on 29 December 2012 against Southampton; he scored Stoke's second goal in a 3–3 draw."]}, {"page": "Robert Huth", "response": ["In the summer of 2011, manager Tony Pulis signed former England international centre backs Jonathan Woodgate and Matthew Upson, forcing Huth into playing in the unfamiliar right back position. After a series of poor defensive performances by Stoke, however, Huth returned to his centre-back pairing with Ryan Shawcross, going on to score his first goal of the season against Everton. In a match against Sunderland, Huth was sent-off for tackling David Meyler, although replays showed that he pulled out of the challenge. Sunderland took full advantage of the extra man and scored the only goal through James McClean. Stoke attempted to have Huth's red card overturned on appeal, but failed in their efforts. Huth scored twice towards the end of the season against Midlands opponents Wolves and Aston Villa respectively. His performances for the side prompted Pulis to open discussions with Huth over a new contract."]}, {"page": "List of foreign MLS players", "response": ["*Ryan Shawcross – Inter Miami – 2021"]}, {"page": "Royal Antwerp F.C.", "response": ["*  Ryan Shawcross"]}, {"page": "Francis Jeffers", "response": ["After a lively start against Stoke City on 20 October 2007, Jeffers was on the end of a tackle from Ryan Shawcross and was stretchered off with ankle ligament damage. He was out for roughly seven weeks. Jeffers came back as a substitute on 10 December 2007 versus Hull City, but ended up on the losing team after a 1–0 loss. Just 48 hours later, Jeffers played at Hillsborough for the first time in two months, and not only played for 45 minutes of the match, but also scored the winning goal after 82 minutes from the penalty spot. This was Jeffers' second goal for Wednesday."]}, {"page": "Abdoulaye Faye", "response": ["Faye began his career playing for ASEC Ndiambour and Jeanne d'Arc in his native Senegal before moving to French side Lens in 2002. After spending time out on loan at Istres he attracted the attentions of Sam Allardyce who signed him for Bolton Wanderers in July 2005. After two seasons at Bolton he followed Allardyce to Newcastle United where he spent one season before joining Stoke City in August 2008 for £2.25 million. Faye became a popular player at the Britannia Stadium in 2008–2009 as he won the player of the year and was named captain by Tony Pulis for the 2009–2010 season. He lost the capacity to Ryan Shawcross for 2010–2011 and then had a third spell working with Allardyce at West Ham United. Faye helped the Hammers gain promotion to the Premier League in 2011–12 before joining Hull City where he was again involved in a promotion winning season in 2012–13 before being released at the end of the 2013–14 season.", "Following his first season at Stoke he was awarded the captain's armband on a permanent basis for the 2009–10 season. Faye had another good season for City but was also hampered by injuries and had to leave the field before 30 minutes on a number of occasions. Manager Tony Pulis gave the captaincy to Ryan Shawcross for the 2010–11 season. He struggled to make much of an impact during the season and was released at the end of it after he was not offered a new contract. Stoke manager Tony Pulis and the Stoke sentinel paid tribute to Faye."]}, {"page": "Ishmael Miller", "response": ["On 18 July 2007, Miller had been linked with a move to Preston North End. On 13 August 2007, West Bromwich Albion manager Tony Mowbray confirmed that he was interested in taking Miller on a season-long loan. On 15 August Miller completed a season long loan to West Brom with a view to a permanent transfer. \"Ishmael will give us a different option up front,\" Mowbray predicted. \"He's a big, quick, powerful lad who is looking for an opportunity to play more regularly. He will increase competition for places with the other strikers we've already got at the club.\" He scored on his debut for West Bromwich Albion with an individual effort in their 2–0 home win against Preston North End on 18 August. He had been on the pitch for only seven minutes, having replaced Kevin Phillips, the other scorer in the game, in the 66th minute. He scored on his first start for Albion against Ipswich Town and helped the team to a 4–0 victory, before scoring twice in Albion's 4–2 home loss to Cardiff City. Miller's form during October led to his nomination for Championship player of the month, but the award went to Stoke City's on-loan defender Ryan Shawcross. He was further recognised later in November, when he received his first call-up to the England under-21s."]}, {"page": "List of people from Chester", "response": ["*Ryan Shawcross, footballer."]}, {"page": "Glenn Whelan", "response": ["Whelan retained his place in the side at the start of the 2014–15 season before he was ruled out of six weeks suffered a fractured leg whilst on international duty with Ireland in October 2014. He returned to the side in December 2014 after successfully recovering from his injury. Whelan signed a two-year contract extension in January 2015. In February 2015, Following an injury to captain Ryan Shawcross, Whelan acted as stand-in captain and after a woeful 4–1 defeat against Blackburn Rovers in the FA Cup Whelan had a dressing room rant at his teammates. Whelan played 30 times for Stoke in 2014–15 as the Potters finished in 9th position for a second season running and they ended the campaign with a 6–1 victory against Liverpool. His performances during the campaign earn him the praise of teammates Adam and Shawcross who both described Whelan as the teams 'unsung-hero'.", "Whelan was again a key figure under Hughes in 2015–16, making 42 appearances as Stoke again finished in 9th position. He also filled in as stand-in captain during the season due to injury to Ryan Shawcross. He made his 300th appearance for Stoke on 12 March 2016 against Southampton, however he was not to be on the winning team as Stoke lost 2–1 at home. At the end of the campaign, Whelan admitted that he was disappointed that the team did not finish higher in the table."]}, {"page": "Michael Barnes (footballer)", "response": ["On 25 October 2006, he made his debut for the first team, coming on as a half-time substitute for Phil Marsh. However, he himself was substituted just before half-time in extra time, being replaced by Ryan Shawcross. Barnes played in the final of the 2006–07 Manchester Senior Cup, scoring United's only goal in a 3–1 loss to Manchester City. In August 2007, he gave several impressive performances for United in the 2007 Champions Youth Cup in Malaysia, which United went on to win."]}, {"page": "Leon Cort", "response": ["He joined Crystal Palace in the summer of 2006 before joining Stoke City in October 2007 in a swap deal with Clint Hill. Cort formed a strong defensive partnership with Ryan Shawcross at the Britannia Stadium as Stoke gained promotion to the Premier League. Cort was unable to hold on to his place in the top flight and joined Burnley in January 2010 for a fee of £1.5 million. He then had a short loan spell with Preston North End before ending his career at Charlton Athletic.", "Cort's last game for Palace was at Selhurst Park against Stoke. Cort's career at the Britannia Stadium began very well, with assured performances featuring a remarkable tally of eight goals in just six months from the defender helping the Potters gain promotion to the Premier League. However the next season, Cort find himself further down the pecking order as Ryan Shawcross and Abdoulaye Faye was preferred to be used in central defence."]}, {"page": "Marc Wilson (footballer)", "response": ["Following the signings of Erik Pieters and Marc Muniesa, assistant manager Mark Bowen stated that Wilson could revert to a midfield position in 2013–14. As expected Wilson began the season in a centre midfield spot and he stated that he is enjoying the change in style under Hughes. He failed to hold down a regular place in midfield and after spending a few months on the bench he returned to the starting line-up in December 2013, playing at centre-back after injury to Robert Huth. Wilson continued to play alongside Ryan Shawcross in centre of defence until the end of the 2013–14 season as Stoke finished in 9th position. Wilson played 30 times for Stoke in 2014–15 as Stoke again finished in 9th position. Wilson was the only Stoke player to be sent-off in the Premier League during the season after he received two yellow cards against Swansea City on 2 May 2015."]}]}}