{"wiki_id": "http://www.wikidata.org/entity/Q2483178", "itemLabel": "John Murray, 11th Duke of Atholl", "itemDescription": "Scottish clan chief (1929-2012)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Murray,_11th_Duke_of_Atholl", "wikipedia_page": {"main": "John Murray, 11th Duke of Atholl (19 January 1929 – 15 May 2012), was a South African-born hereditary peer of the Peerage of Scotland, hereditary Clan Chief of Clan Murray, and Colonel-in-Chief of the Atholl Highlanders. As Duke of Atholl, he commanded the only legal private army in Europe. He acceded as the 11th duke on 27 February 1996, succeeding his second cousin, once removed, The 10th Duke of Atholl.", "link_mentions": [{"page": "John Murray", "response": ["*John Murray, 11th Duke of Atholl (1929–2012), British peer"]}, {"page": "Duke of Atholl", "response": ["The dukedom of Atholl and remaining titles were passed on to the late Duke's fourth cousin twice removed, Iain Murray, the tenth Duke of Atholl. He was the grandson of Sir Evelyn Murray, son of Sir George Murray, grandson of Dr George Murray, Bishop of Rochester, son of Bishop Lord George Murray, second son of the third Duke. As all the English titles had become extinct on the ninth Duke's death, the tenth Duke was not entitled to an automatic seat in the House of Lords, gaining in 1957 the then unfortunate distinction of being the highest ranking peer without a seat in the upper chamber of parliament. However, in 1958 Atholl was elected a Scottish Representative Peer and was able to take a seat in the House of Lords. Through the Peerage Act 1963 all hereditary Scottish peers gained the right to sit in the House of Lords. The tenth Duke was unmarried and was succeeded in 1996 by his second cousin once removed, John Murray, 11th Duke of Atholl. He was the grandson of the Rev. Douglas Stuart Murray, brother of the aforementioned Sir George Murray, great-grandfather of the tenth Duke. On his death in 2012, the eleventh Duke was succeeded by his eldest son, Bruce Murray, 12th Duke of Atholl.", "*John Murray, 11th Duke of Atholl (1929–2012) (second cousin, once removed of the 10th Duke; great-great grandson of Rt. Rev. George Murray, eldest son of Rt. Rev. Lord George Murray, second son of the 3rd Duke)", "*********15px John Murray, 11th Duke of Atholl (1929–2012)"]}, {"page": "Atholl Highlanders", "response": ["It was feared that the regiment would be disbanded following the 10th Duke's death in 1996, until his successor, John Murray, 11th Duke of Atholl, wrote to the estate trustees insisting that he would continue his traditional role.Daily Mirror, March 20, 1996 The 11th Duke, although resident in South Africa, visited Blair Atholl almost every year to inspect the regiment's annual parade until his death. The 12th Duke continues this tradition."]}, {"page": "Murray (surname)", "response": ["Lord George's descendant George Murray, 10th Duke of Atholl, died in February 1996. The new Duke of Atholl is John Murray, 11th Duke of Atholl, a South African. The new Duke has taken the chiefship of the Murrays."]}, {"page": "Deaths in May 2012", "response": ["*John Murray, 11th Duke of Atholl, 83, South African-born hereditary peer of the Peerage of Scotland."]}, {"page": "Bruce Murray, 12th Duke of Atholl", "response": ["The elder son of John Murray, 11th Duke of Atholl, and Margaret Yvonne  Leach, now styled the Dowager Duchess of Atholl,Information on Murray, Bruce George Ronald – website Royal Genealogy Page of the Department of Computer Science, University of HullCharles Mosley, editor, Burke's Peerage and Baronetage, 106th edition, 2 volumes (Crans, Switzerland: Burke's Peerage (Genealogical Books) Ltd, 1999), volume 1, page 133. graduated from Jeppe High School for Boys Johannesburg in 1979. He was educated at Saasveld Forestry College before serving his two years' National Service with the South African Infantry Corps. He is currently a volunteer member of the Transvaal Scottish Regiment, holding the rank of lieutenant. Previously he managed a tea plantation, but then ran a signage business producing signs for commercial buildings.KAOXA'S SHELTER, THE DIGGING STICK, Volume 17, No 1 ISSN 1013-7521 April 2000, Acknowledgements  – website of the South African Archaeological SocietyLocal Marquess presents colours to Her Majesty - www.zoutnet.co.za He was commissioned into the Atholl Highlanders in 2000,Clan & Septs  – website of the Clan Murray Society being appointed as lieutenant colonel.Highlander’s Visit (5/29 – 6/7)  – website of the Atholl 250th Anniversary Committee Upon the death of his father on 15 May 2012, he succeeded to all his father's titles, becoming the 12th Duke of Atholl.John Murray, the 11th Duke of Atholl, dies in South Africa  – website of The Courier"]}, {"page": "2012 in South Africa", "response": ["* 15 May – John Murray, 11th Duke of Atholl, surveyor (b. 1929)"]}]}}