{"wiki_id": "http://www.wikidata.org/entity/Q2482444", "itemLabel": "Frank Close", "itemDescription": "Particle physicist", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Close", "wikipedia_page": {"main": "Francis Edwin Close,  (born 24 July 1945) is a particle physicist who is Emeritus Professor of Physics at the University of Oxford and a Fellow of Exeter College, Oxford.", "link_mentions": [{"page": "Cold fusion", "response": ["Cold fusion researchers placed a \"rosier spin\" on the report, noting that they were finally being treated like normal scientists, and that the report had increased interest in the field and caused \"a huge upswing in interest in funding cold fusion research.\" However, in a 2009 BBC article on an American Chemical Society's meeting on cold fusion, particle physicist Frank Close was quoted stating that the problems that plagued the original cold fusion announcement were still happening: results from studies are still not being independently verified and inexplicable phenomena encountered are being labelled as \"cold fusion\" even if they are not, in order to attract the attention of journalists."]}, {"page": "July 24", "response": ["*1945 – Frank Close, English physicist and academic"]}, {"page": "Klaus Fuchs", "response": ["After a great deal of research for his 2019 biography, Trinity, Frank Close confirmed that while MI5 suspected Fuchs for over two years, \"it was decrypters at GCHQ who supplied clear proof of his guilt ... not the crack American team that is normally given all the credit\", according to a review of the book.", "In his 2019 book, Trinity: The Treachery and Pursuit of the Most Dangerous Spy in History, Frank Close asserts that \"it was primarily Fuchs who enabled the Soviets to catch up with Americans\" in the race for the nuclear bomb. The author of the 2020 book Atomic Spy gives his efforts less value. Nancy Thorndike Greenspan suggests that the Soviets would have developed their bomb even without his help, \"though probably not until 1951\". On the other hand, the earlier development of the Soviet bomb may have had one significant benefit to the world, a balance of power; the author is convinced that this prevented the United States from using their bomb on North Korea."]}, {"page": "Theory of everything", "response": ["Frank Close regularly argues that the layers of nature may be like the layers of an onion, and that the number of layers might be infinite. This would imply an infinite sequence of physical theories.", "* The Theory of Everything: Are we getting closer, or is a final theory of matter and the universe impossible? Debate between John Ellis (physicist), Frank Close and Nicholas Maxwell."]}, {"page": "Wolfgang Pauli", "response": ["* Pauli exclusion principle with Melvyn Bragg, Frank Close, Michela Massimi, Graham Farmelo \"In Our Time 6 April 2017\""]}, {"page": "Exeter College, Oxford", "response": ["* Frank Close"]}, {"page": "Very Short Introductions", "response": ["| 109 || Particle Physics || Frank Close ||  || || physics", "| 205 || Nothing || Frank Close ||  || The Void, 2007 || ", "| 438 || Nuclear Physics || Frank Close ||  || || physics"]}, {"page": "Glueball", "response": ["In particle physics, a glueball (also gluonium, gluon-ball) is a hypothetical composite particle.Frank Close and Phillip R. Page, \"Glueballs\", Scientific American, vol. 279 no. 5 (November 1998) pp. 80–85 It consists solely of gluon particles, without valence quarks. Such a state is possible because gluons carry color charge and experience the strong interaction between themselves. Glueballs are extremely difficult to identify in particle accelerators, because they mix with ordinary meson states."]}, {"page": "Relativistic Heavy Ion Collider", "response": [" (And reply by F. Wilczek.) The risk of a doomsday scenario was indicated by Martin Rees, with respect to the RHIC, as being at least a 1 in 50,000,000 chance.Cf. Brookhaven Report mentioned by Rees, Martin (Lord), Our Final Century: Will the Human Race Survive the Twenty-first Century?, U.K., 2003, ; note that the mentioned \"1 in 50 million\" chance is disputed as being a misleading and played down probability of the serious risks (Aspden, U.K., 2006) With regards to the production of strangelets, Frank Close, professor of physics at the University of Oxford, indicates that \"the chance of this happening is like you winning the major prize on the lottery 3 weeks in succession; the problem is that people believe it is possible to win the lottery 3 weeks in succession.\" After detailed studies, scientists reached such conclusions as \"beyond reasonable doubt, heavy-ion experiments at RHIC will not endanger our planet\""]}, {"page": "The Time Machine (Alan Parsons album)", "response": ["\"Temporalia\" features a narration by professor Frank Close on the idea of the universe itself acting as a sort of time machine; this is an extract of \"Equinox – The rubber Universe\". \"Press Rewind\" ponders what he might do if he were able to reverse time, and change decisions he had made. \"Out Of The Blue\" relates to a time traveller from the future. \"Call Up\" is about travelling to the past and bringing back all the great people in history, to help change the world. \"Ignorance Is Bliss\" talks about how sad people are in comparison to ancient and simpler times, and the possibility of change for good to a simple way of life. \"Rubber Universe\" is related to the expansion of the universe.", "#\"Temporalia\" (Parsons) - instrumental with narration by Professor Frank Close – 1:00", "* Prof. Frank Close – narration on \"Temporalia\""]}, {"page": "Bruno Pontecorvo", "response": ["According to Oleg Gordievsky, the highest-ranking KGB officer ever to defect, and Pavel Sudoplatov, the former deputy director of Foreign Intelligence for the Soviet Union, Pontecorvo was a Soviet spy. However, Sudoplatov misidentified Pontecorvo as the spy codenamed Mlad, whom we now know was Ted Hall. While Pontecorvo always denied working on nuclear weapons, in Canada, Britain or the Soviet Union, he never confirmed or denied that he was a spy. The actual evidence against him was flimsy. Frank Close noted that the blueprints of the Canadian NRX reactor had made their way to the Soviet Union, and Lona Cohen obtained a sample of uranium from the NRX after it started operation in 1947. Nunn May could not have been the culprit, so Pontecorvo is the prime suspect.", "* Jodcast Interview with Professor Frank Close on the life, research and disappearance of Bruno Pontecorvo"]}, {"page": "Royal Institution Christmas Lectures", "response": ["| Frank Close"]}, {"page": "The King's (The Cathedral) School", "response": ["* Prof Frank Close OBE, Professor of Theoretical Physics since 2001 at the University of Oxford and Fellow of Exeter College. Winner of the 2013 Michael Faraday Prize."]}, {"page": "John Clive Ward", "response": ["Pryce arranged for Ward to receive an award from the Department of Scientific and Industrial Research (DSIR) for two years. It was then that he developed the Ward–Takahashi identity, originally known as \"Ward Identity\" (or \"Ward's Identities\"). This result in quantum electrodynamics was inspired by a conjecture of Freeman Dyson, and was disclosed in a one-half-page letter typical of Ward's succinct style.  In their book Quantum Electrodynamics, Walter Greiner and  state in their discussion of charge renormalisation: \"the Ward Identity has a much more fundamental significance: it ensures the universality of the electromagnetic interaction.\" In his book The Infinity Puzzle, Frank Close wrote: \"Ward's Identities are the basic foundations on which the entire edifice of renormalisation rests.\""]}, {"page": "Atomic spies", "response": ["*Klaus Fuchs — the German-born British theoretical physicist who worked with the British delegation at Los Alamos during the Manhattan Project. Fuchs was arrested in the UK and tried there. Lord Goddard sentenced him to fourteen years' imprisonment, the maximum for violating the Official Secrets Act.  Fuchs escaped the charge of espionage due to a lack of independent evidence and because, at the time of his activities, the Soviet Union was an ally, not an enemy, of Great Britain.A.M. Hornblum, The Invisible Harry Gold (Yale University Press, 2010) kindle edition. locations 4030-37 In December 1950 he was stripped of his British citizenship. He was released on June 23, 1959, after serving nine years and four months of his sentence at Wakefield prison. Fuchs was allowed to emigrate to Dresden, then in communist East Germany. In his 2019 book, Trinity: The Treachery and Pursuit of the Most Dangerous Spy in History, Frank Close asserts that \"it was primarily Fuchs who enabled the Soviets to catch up with Americans\" in the race for the nuclear bomb."]}, {"page": "Richard Dalitz", "response": ["His research collaborators included Hans Bethe, Frank Close, F. J. Duarte, Freeman Dyson, Nicholas Kemmer, Rudolf Peierls, Christopher Llewellyn Smith and John Clive Ward."]}, {"page": "Gresham Professor of Astronomy", "response": ["|  33 ||Frank Close OBE || 1 September 2000"]}, {"page": "End Day", "response": [":However, after the plane crashed, the physicist Frank Close reassured that this particular scenario is unlikely to happen, as similar experiments have already been done by the time the movie was produced and no disaster came after it. This is the only scenario in the movie that didn't end with a scientist telling that \"it's not a question of if but when\", as Close ending the segment by saying that \"It makes great science fiction, great entertainment, great television, but on this - we can sleep easy\"."]}, {"page": "Future Fantastic", "response": ["Interviewed John Clute (author), Michael Burns (physicist and military systems designer), Richard A. Hull (inventor), Peter Graneau (inventor), Jim Greggs (inventor), Franklin Mead (Senior. Scientist at the Advanced Concepts Office), Frank Close (physicist), Edwin May (nuclear physicist), Richard Wiseman (psychologist)"]}, {"page": "Christine Sutton", "response": ["She was Physical Sciences Editor for New Scientist magazine in the early 1980s, and has authored several non-fiction science books, most recently (with Frank Close and Michael Marten) The Particle Odyssey (1987, 2002)."]}, {"page": "The Museum of Curiosity", "response": ["*Frank Close"]}, {"page": "Close (surname)", "response": ["* Frank Close, British physicist"]}, {"page": "Safety of high-energy particle collision experiments", "response": ["Similar concerns had previously also been raised in the context of the Relativistic Heavy Ion Collider, with Frank Close, professor of physics at the University of Oxford, to comment at the time that \"the chance of [strangelet creation] is like you winning the major prize on the lottery 3 weeks in succession; the problem is that people believe it is possible to win the lottery 3 weeks in succession.\"BBC End Days (Documentary)", "Concerns were raised in connection with the RHIC particle accelerator, both in the media and in the popular science media. The risk of a doomsday scenario was indicated by Martin Rees, with respect to the RHIC, as being at least a 1 in 50 million chance.Cf. Brookhaven Report mentioned by Rees, Martin (Lord), Our Final Century: Will the Human Race Survive the Twenty-first Century?, U.K., 2003, ; note that the mentioned \"1 in 50 million\" chance is disputed as being a misleading and played down probability of the serious risks (Aspden, U.K., 2006) With regards to the production of strangelets, Frank Close, professor of physics at the University of Oxford, indicates that \"the chance of this happening is like you winning the major prize on the lottery 3 weeks in succession; the problem is that people believe it is possible to win the lottery 3 weeks in succession.\" After detailed studies, scientists reached such conclusions as \"beyond reasonable doubt, heavy-ion experiments at RHIC will not endanger our planet\" and that there is \"powerful empirical evidence against the possibility of dangerous strangelet production.\""]}, {"page": "List of English people", "response": ["* Frank Close (born 1945), physicist"]}, {"page": "Higgs boson", "response": ["In the paper by Higgs the boson is massive, and in a closing sentence Higgs writes that \"an essential feature\" of the theory \"is the prediction of incomplete multiplets of scalar and vector bosons\". (Frank Close comments that 1960s gauge theorists were focused on the problem of massless vector bosons, and the implied existence of a massive scalar boson was not seen as important; only Higgs directly addressed it.) In the paper by GHK the boson is massless and decoupled from the massive states. In reviews dated 2009 and 2011, Guralnik states that in the GHK model the boson is massless only in a lowest-order approximation, but it is not subject to any constraint and acquires mass at higher orders, and adds that the GHK paper was the only one to show that there are no massless Goldstone bosons in the model and to give a complete analysis of the general Higgs mechanism. All three reached similar conclusions, despite their very different approaches: Higgs' paper essentially used classical techniques, Englert and Brout's involved calculating vacuum polarisation in perturbation theory around an assumed symmetry-breaking vacuum state, and GHK used operator formalism and conservation laws to explore in depth the ways in which Goldstone's theorem may be worked around. Some versions of the theory predicted more than one kind of Higgs fields and bosons, and alternative \"Higgsless\" models were considered until the discovery of the Higgs boson.", "Physicist and author Frank Close and physicist-blogger Peter Woit both comment that the paper by GHK was also completed after Higgs and Brout–Englert were submitted to Physical Review Letters,"]}, {"page": "Crucifixion of Jesus", "response": ["In an edition of the BBC Radio 4 programme In Our Time entitled Eclipses, Frank Close, Emeritus Professor of Physics at the University of Oxford, stated that certain historical sources say that on the night of the Crucifixion \"the moon had risen blood red,\" which indicates a lunar eclipse. He went on to confirm that as Passover takes place on the full moon calculating back shows that a lunar eclipse did in fact take place on the night of Passover on Friday 3 April 33AD which would have been visible in the area of modern Israel, ancient Judea, just after sunset."]}, {"page": "1964 PRL symmetry breaking papers", "response": ["In the paper by Higgs the boson is massive, and in a closing sentence Higgs writes that \"an essential feature\" of the theory \"is the prediction of incomplete multiplets of scalar and vector bosons\". (Frank Close comments that 1960s gauge theorists were focused on the problem of massless vector bosons, and the implied existence of a massive scalar boson was not seen as important; only Higgs directly addressed it."]}, {"page": "Symphony of Science", "response": ["\"The Quantum World\" is the eleventh installment of the Symphony of Science series, released on September 6, 2011. It deals with the bizarre discoveries made in the field of quantum mechanics, through \"a musical investigation into the nature of atoms and subatomic particles.\" It features Morgan Freeman, Stephen Hawking, Michio Kaku, Brian Cox, Richard Feynman, and Frank Close. Programs sampled for this instalment include Richard Feynman's Fun to Imagine, Morgan Freeman's Through the Wormhole, Brian Cox's TED Talk, along with BBC documentaries  Visions of the Future, What Time is it, Wonders of the Universe, and What Is Reality. The refrain is sung by Cox."]}]}}