{"wiki_id": "http://www.wikidata.org/entity/Q24851863", "itemLabel": "Debbie Bestwick", "itemDescription": "British entrepreneur", "wikipedia_url": "https://en.wikipedia.org/wiki/Debbie_Bestwick", "wikipedia_page": {"main": "Deborah Jayne Bestwick  (born 7 March 1970) is a British entrepreneur. Following a short career in video game retail, she was part of the December 1990 merger between British video game publisher 17-Bit Software and Swedish developer Team 7 that led to the formation of Team17, where she acts as chief executive officer. Bestwick was awarded various accolades related to the video game industry between 2015 and 2017, and was pronounced a Member of the Most Excellent Order of the British Empire in June 2016 for her services in that industry.", "link_mentions": [{"page": "Clive Sinclair", "response": ["On 16 September 2021, Sinclair died in London following an illness related to cancer that he had for over a decade. He was 81 years old. Sinclair was remembered on his death for his contributions towards computing and video games by numerous people, including Elon Musk, Satya Nadella, the Oliver Twins, Debbie Bestwick, Charles Cecil, and David Braben. A Times leader following his death described Sinclair as a tenacious inventor whose career was a triumph of perseverance similar to that of many of Britain's greatest inventors, such as Sir James Dyson and Alexander Graham Bell, 'who are a reminder that failure is an essential prelude to success'."]}, {"page": "Golden Joystick Awards", "response": ["| Debbie Bestwick MBE"]}, {"page": "The Holgate Academy", "response": ["* Debbie Bestwick, a founder and current CEO of Team17"]}, {"page": "Team17", "response": ["Team17 Group plc is a British video game developer and publisher based in Wakefield, England. The venture was created in December 1990 through the merger of British publisher 17-Bit Software and Swedish developer Team 7. At the time, the two companies consisted of and were led by Michael Robinson, Martyn Brown and Debbie Bestwick, and Andreas Tadic, Rico Holmes and Peter Tuleby, respectively. Bestwick later became and presently serves as Team17's chief executive officer. After their first game, Full Contact (1991) for the Amiga, the studio followed up with multiple number-one releases on that platform and saw major success with Andy Davidson's Worms in 1995, the resulting franchise of which still remains as the company's primary development output, having developed over 20 entries in it.", "Team 7's first game was Miami Chase, a Miami Vice-inspired racing game that was published by Codemasters in 1990, as a budget title for Amiga systems, and received an 82% review score from British Amiga-centric magazine Amiga Power. Brown had followed the game's development closely, because of which he suggested to Robinson that they should not only publish but also develop games at 17-Bit Software, using Team 7 as their internal development team and himself as project manager. Robinson agreed to undergo the venture and moved Debbie Bestwick from her position as sales manager of Microbyte to commercial support for 17-Bit Software. Eventually, 17-Bit Software and Team 7 agreed to formally merge into one team, amalgamating the two teams' names as \"Team17\". Team17 was officially created on 7 December 1990."]}, {"page": "Deborah Bestwick", "response": ["#REDIRECT Debbie Bestwick"]}]}}