{"wiki_id": "http://www.wikidata.org/entity/Q24844360", "itemLabel": "Peter Owen", "itemDescription": "British publisher (1927-2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Owen_(publisher)", "wikipedia_page": {"main": "Peter Owen (24 February 1927 – 31 May 2016) was a British publisher, the founder of Peter Owen Publishers.He was born Peter Offenstadt in Nuremberg in 1927, with rickets, the only child of a German Jewish couple. His mother was Winifred Offenstadt.He was sent to live with his grandmother in England at the age of five, later to be joined by his parents, who were reluctant to leave Germany.In 1948, at the age of 21, Owen went into partnership with Neville Armstrong in a publishing enterprise called Peter Neville. This lasted until 1955. He went on to found Peter Owen Publishers in 1951. \nHe was awarded the OBE for services to literature in 2014.Owen's funeral instructions included, \"no religious crap of any kind\".", "link_mentions": [{"page": "Friedrich Nietzsche", "response": ["Köhler's views have not found wide acceptance among Nietzsche scholars and commentators. Allan Megill argues that, while Köhler's claim that Nietzsche was conflicted about his homosexual desire cannot simply be dismissed, \"the evidence is very weak,\" and Köhler may be projecting twentieth-century understandings of sexuality on nineteenth-century notions of friendship. It is also known that Nietzsche frequented heterosexual brothels. Nigel Rodgers and Mel Thompson have argued that continuous sickness and headaches hindered Nietzsche from engaging much with women. Yet they offer other examples in which Nietzsche expressed his affections to women, including Wagner's wife Cosima Wagner.Rogers, N., and M. Thompson. 2004. Philosophers Behaving Badly. London: Peter Owen."]}, {"page": "Nuremberg", "response": ["*Peter Owen (1927–2016), British publisher, founded Peter Owen Publishers"]}, {"page": "Anna Kavan", "response": ["Living alone in London during the mid-1920s, she began studying painting at the London Central School of Arts and Crafts, and continued to paint throughout her life. Kavan regularly travelled to the French Riviera where she was introduced to heroin by racing car drivers she took up with.Ironside Virginia, \"Julia and the Bazooka\" Peter Owen Publishers reprint 2007, introduction. ", "Kavan continued to undergo sporadic inpatient treatments for heroin addiction and in her later years in London lived as a virtual recluse. She enjoyed a late triumph in 1967 with her novel Ice, inspired by her time in New Zealand and the country's proximity to the inhospitable frozen landscape of Antarctica. The original manuscript was titled The Cold World. When her publisher Peter Owen sent Kavan his initial response, neither rejecting nor accepting her text, he described it as a cross between Kafka and The Avengers.David Callard, The Case of Anna Kavan, biography published by Peter Owen, 1992. This post-apocalyptic novel brought critical acclaim. It is her best-known novel, still puzzling the reader for its strangeness and nowadays rather introduced as a slipstream novel than a science fiction one.", "Although popularly supposed to have died of heroin overdose, Kavan died of heart failure at her home in Kensington and was found dead on 5 December 1968. The previous night she had failed to attend a reception in honor of Anaïs Nin at the home of her London-based publisher Peter Owen.Emily Hill, A Novel Approach, interview with Peter Owen for Dazed & Confused, 2010 :\"The author of Ice, who died in 1968 with enough heroin stockpiled in her house to kill the whole street, did so on the night she was expected at one of Peter Owen’s parties. When the police broke in the door, they found the gold invitation, so Owen was the first person they called. \"I didn’t realise at the time that I was dealing with a really major writer who would become a cult figure\", Owen admits. \".", "Many of her works were published posthumously, some edited by her friend and legatee, the Welsh writer Rhys Davies. London-based Peter Owen Publishers have been long-serving advocates of Kavan's work and continue to keep her work in print. Doris Lessing, J.G. Ballard, Anaïs Nin, Jean Rhys, Brian Aldiss, Christopher Priest, Nina Allan, Virginia Ironside and Maggie Gee are among the writers who have praised her work.", "In September 2014, the Anna Kavan Society organized a one-day symposium at the Institute of English Studies in association with Liverpool John Moores University Research Centre for Literature and Cultural History and Peter Owen Publishers. The Anna Kavan Symposium brought together scholars and writers to historicize Kavan's work (from the post-colonial aspects of Kavan's fiction and journalism to the interwar and World War II period), situate her within the literary and intellectual context of her times, and chart her legacy as a writer.", "* Eagle's Nest  (London : Peter Owen, 1957, Open Library) ", "* A Bright Green Field and Other Stories  (London : Peter Owen, 1958, Open Library)", "* Ice (Peter Owen Publishers, London 1967, scheduled for reissue in Christmas 2017. Open Library)", "* Julia and the Bazooka (London : Peter Owen, 1970)", "* My Soul in China (London : Peter Owen, 1975)", "* Mercury (London : Peter Owen, 1994)", "* The Parson (London : Peter Owen, 1995)", "* Guilty (London : Peter Owen, 2007)", "*Machines in the Head: the Selected Short Writing of Anna Kavan (London : Peter Owen, 2019)", "* \"A Bright Green Field.\" In Springtime Two: An Anthology of Current Trends, edited by Peter Owen & Wendy Owen. London: Peter Owen Ltd., 1958.", "* The Case of Anna Kavan : A Biography, by David Callard. London: Peter Owen, 1994", "*A Stranger on Earth: The Life and Work of Anna Kavan, by Jeremy Reed.  London: Peter Owen, 2006", "The largest collection of archival material from Kavan is held by the University of Tulsa's McFarlin Library, Department of Special Collections and University Archives. This includes her personal archive of manuscripts and artwork in the Anna Kavan papers, 1867–1991; further material in the Meic Stephens collection of Anna Kavan ephemera, 1943–1971; the Richard R. Centing collection of Anna Kavan, 1943–1991; David A. Callard collection of Anna Kavan; and the Anais Nin papers, 1969–1992.  Other collections beyond Tulsa include The Peter Owen Archives at the Harry Ransom Center, University of Texas with correspondence between Kavan and her publisher Peter Owen and related material. Other archives  contain letters from Kavan to publishers include the William A Bradley Literary Agency, Francis Henry King, Scorpion Press, John Lehmann, Kay Dick and Gerald Hamilton.", "*Peter Owen Publishers "]}, {"page": "Peter Owen Publishers", "response": ["Peter Owen Publishers is a family-run London-based independent publisher based in London, England. It was founded in 1951.John Self, \"Peter Owen: Sixty years of innovation\", Books Blog, The Guardian, 4 July 2011. ", "The company was founded in 1951 by Peter Owen, who had previously worked for Stanley Unwin at The Bodley Head. Owen's first editor was Muriel Spark, who would later write a novel called A Far Cry From Kensington drawing on her experiences working there.Emily Hill, \"Novel Approach: Peter Owen\", Dazed, February 2011.", "Their published authors include Paul Bowles and Jane Bowles, the Japanese Catholic author Shusaku Endo, the Spanish writers Julio Llamazares, José Ovejero, Cristina Fernández Cubas and Salvador Dalí,Julie Cirelli, \"Peter Owen on Salvador Dalí\", AnOther, 24 June 2011. as well as André Gide, Jean Cocteau, Colette, Anna Kavan, Anaïs Nin,Stephen Fowler, \"Blazing the trail: an interview with Peter Owen\", 3:AM Magazine, 24 November 2009. Natsume Sōseki, Yukio Mishima, Gertrude Stein, Hermann Hesse, Karoline Leach, the revisionist biographer of Lewis Carroll, Hans Henny Jahnn, Tarjei Vesaas and Miranda Miller. So far, the independent press has published seven Nobel Prize winners. Although best known for fiction (especially in translation), the company also publishes plenty of non-fiction.", "In 1991, Owen compiled an anthology to commemorate forty years of publishing, The Peter Owen Anthology: Forty Years of Independent Publishing. Remaining independent since its founding, his press continues to publish today. Guide to the Peter Owen publishing records, Special Collections, University of Delaware Library, Newark, Delaware. Retrieved 17 May 2020. The company records are held in Special Collections at the University of Delaware.", "*Peter Owen publishing records, Special Collections, University of Delaware Library, Newark, Delaware."]}, {"page": "Peter Vansittart", "response": ["*The Story Teller. London, Peter Owen, 1968.", "*Pastimes of a Red Summer. London, Peter Owen, 1969.", "*Landlord. London, Peter Owen, 1970.", "*Quintet. London, Peter Owen, 1976.", "*Lancelot. London, Peter Owen, 1978.", "*The Death of Robin Hood. London, Peter Owen, 1981.", "*Three Six Seven. London, Peter Owen, 1983.", "*Aspects of Feeling. London, Peter Owen, 1986.", "*Parsifal. London, Peter Owen, 1988; Chester Springs, Pennsylvania, Dufour, 1989.", "*The Wall. London, Peter Owen, 1990.", "*A Choice of Murder. London, Peter Owen, 1992.", "*A Safe Conduct. London, Peter Owen, 1995; Chester Springs, Pennsylvania, 1995.", "*Hermes in Paris London, Peter Owen, 2000", "*Worlds and Underworlds: Anglo-European History Through the Centuries. London, Peter Owen, 1974.", "* Obituary in The Guardian by Vansittart's longtime publisher Peter Owen"]}, {"page": "Margareta Bergman", "response": ["* Margareta Bergman. Mirror Mirror, 1986. Translated by Veronica Ralston. (Original title: Spegel, Spegel) Reprinted Peter Owen, 1998."]}, {"page": "Middle-earth in film", "response": ["| colspan=\"3\" | Peter King and Peter Owen"]}, {"page": "Peter Owen (disambiguation)", "response": ["Peter Owen is a make-up artist.", "Peter Owen may also refer to:", "*Peter Owen (publisher) (1927–2016), British publisher", "*Peter Owen Publishers, a London-based publisher founded in 1951", "*Peter Owen (actor) in Miss Mabel", "*Peter Owen (racer) in 2000 Sports Racing World Cup season", "*Peter Owen-Jones (born 1957), English clergyman, author and TV presenter"]}, {"page": "2016 in the United Kingdom", "response": ["**Peter Owen, 89, publisher."]}, {"page": "Deaths in May 2016", "response": ["*Peter Owen, 89, German-born British publisher.Peter Owen dies"]}, {"page": "Ice (Kavan novel)", "response": ["Kavan completed an early draft of Ice in March 1964. It was first submitted to Weidenfeld & Nicolson by Francis King, but was rejected. It was then accepted by Peter Owen, though he expressed doubts about the manuscript, citing a deficiency of character and narrative. Kavan defended the work, writing that \"it is not meant to be realistic writing. It's a sort of present day fable...\" She \"saw the story as one of those recurring dreams ... which at times become nightmare. This dreamlike atmosphere is the essence of the [novel].\" Early readers described the novel as a cross between Kafka and The Avengers, which Kavan felt was an apt description."]}, {"page": "Peter Offenstadt", "response": ["#REDIRECT Peter Owen (publisher)"]}, {"page": "Neville Armstrong", "response": ["After the war, Armstrong became an impresario at Bolton's Theatre, South Kensington. This made little money, and he next tried his hand at working as a literary agent, which led him into book publishing. He went into a short-lived partnership with John Calder as Spearman Calder, then in 1948 Armstrong formed a publishing partnership with Peter Owen called Peter Neville. Owen was then aged only 21.“MEET THE PUBLISHERS” in Colophon, Vol. 1, Issues 1–11 (1950), p. 34: “Peter Nevill was founded by two young men, Peter Owen and Neville Armstrong. The former, then twenty-one, and the youngest publisher in Britain...” In 1955, Armstrong launched his own London publishing house, under the name of Neville Spearman Publishers. One of his first publications under that name was the collected poems of Trevor Blakemore.Poems by Trevor Blakemore, ed. Robert Gittings (London: Neville Spearman, 1955)"]}]}}