{"wiki_id": "http://www.wikidata.org/entity/Q24851885", "itemLabel": "Robert MacLeod", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_MacLeod", "wikipedia_page": {"main": "Robert James MacLeod (born May 1964) is a British businessman, the chief executive (CEO) of Johnson Matthey, a British multinational chemicals and precious metals company, since 2014.He succeeded Neil Carson, who was CEO of Johnson Matthey from 2004 until his retirement in 2014.", "link_mentions": [{"page": "2008 Progressive Conservative Party of New Brunswick leadership election", "response": ["*Robert MacLeod, former president of party (2007–2008)Daniel McHardie. \"Conservative party president resigns\", New Brunswick Telegraph-Journal. Page A3, July 17, 2008 and son of former interim leader Malcolm MacLeod.  Announced his candidacy on July 28, 2008.Jesse Robichaud. \"Sussex businessman enters Tory race\", Moncton Times & Transcript.  Page A7, July 29, 2008.", "*Kirk MacDonald, MLA since 1999, in cabinet 2006. He was mentioned again as a potential candidate after the PC annual meeting in late October 2007. He endorsed Robert MacLeod for leader.", "| style=\"width: 170px\" | Robert MacLeod", "*July 28, 2008 - Robert MacLeod declares his candidacy."]}, {"page": "Robert McLeod", "response": ["* Robert MacLeod (born 1964), British businessman", "* Robert MacLeod, pseudonym of Bill Knox"]}, {"page": "Progressive Conservative Party of New Brunswick leadership elections", "response": ["*Robert MacLeod 1,760"]}, {"page": "Neil Carson (businessman)", "response": ["Carson retired in 2014, and was succeeded as CEO of Johnson Matthey by Robert MacLeod."]}, {"page": "Michael O. Thorner", "response": ["Robert MacLeod's discovery that dopamine is the hormone responsible for inhibiting prolactin release led to Thorner being recruited to UVA to join in the research. He continued this work to develop treatment for prolactin-secreting pituitary tumors to restore normal prolactin levels and reduction the size of the tumor by using dopamine agonists. This is now the standard of care for patients with prolactin-secreting tumors."]}, {"page": "MacLeod, Robert", "response": ["#redirectRobert MacLeod"]}]}}