{"wiki_id": "http://www.wikidata.org/entity/Q2489962", "itemLabel": "Steven Anderson", "itemDescription": "Scottish footballer (born 1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steven_Anderson", "wikipedia_page": {"main": "Steven James Stuart Anderson (born 19 December 1985) is a Scottish footballer who plays for Forfar Athletic. Anderson plays in central defence.", "link_mentions": [{"page": "Stephen Anderson", "response": ["*Stone Cold Steve Austin (Steven Anderson, born 1964), American actor, producer, and retired professional wrestler", "*Steven Anderson (born 1985), Scottish footballer", "*Steven Anderson (pastor) (born 1981), American Baptist pastor"]}, {"page": "Alan Main", "response": ["Main started in the first nine SPL games of the 2009–10 season before being edged out by former Kilmarnock and Rangers goalkeeper Graeme Smith, who had missed the early part of the season due to an injury sustained in a pre-season match. During this run in the team Main saved a Derek Riordan penalty in a 3–1 win over Hibernian in the Scottish League Cup. Main remained on the substitutes' bench after Smith made his way into the starting line-up, and was released by St Johnstone at the end of the 2009–10 season, having become the player with the most appearances for the club (361). This record was broken by Steven Anderson in 2016.\"St Johnstone midfielder Murray Davidson lavishes praise on record breaker Steven Anderson\" - Capital City Press, 20 March, 2016"]}, {"page": "Liam Craig", "response": ["On 29 December 2018, Craig played his 362nd game for St Johnstone and scored in a 2–0 away win over Dundee; This put him second place behind teammate Steven Anderson in the club's all-time appearances list. In the same week, he was also appointed as chairman of the PFA Scotland (players' union) management committee.Listen to players on reconstruction, says St Johnstone star Liam Craig, Sean Hamilton, The Courier, 28 April 2020Management Committee, PFA Scotland; retrieved 5 February 2021"]}, {"page": "Sanel Jahić", "response": ["Jahić trained with Scottish Premiership club St Johnstone in October 2013. He signed a short-term contract with the club after they lost defenders Steven Anderson and Frazer Wright to injury and suspension respectively. On 6 January 2014, Jahić left St Johnstone after his contract expired."]}, {"page": "Dave Mackay (footballer, born 1981)", "response": ["Ahead of the 2016–17 season, Mackay made his return to training after months on the sidelines with a hip injury. However, Mackay, once again, needed surgery on his hip after undergoing an injection. Due to ongoing problems with his hip, Mackay was forced to retire from playing professional football in September 2016. Upon retirement, Mackay was met with praise, with his teammate Steven Anderson describe him as the best player who has never been capped in Scotland, while his former Manager McInnes referred him as his perfect signing in his managerial career."]}, {"page": "2007 Scottish Challenge Cup Final", "response": ["The beginning of the match was dominated by St Johnstone and after 13 minutes they were awarded a penalty kick by referee Eddie Smith when Dunfermline midfielder Stephen Simmons collided with St Johnstone's Steven Anderson in the penalty area. Paul Sheerin took the penalty kick and scored beyond Dunfermline's goalkeeper, Paul Gallacher, by hitting the ball into the bottom-left corner of the goal to score his seventh penalty of the season.Docherty, John. \"A wait off their shoulders; Challenge Cup Saints hold off Pars to end marathon hunt for cup glory\". Daily Record (Glasgow). 26 November 2007. Just several minutes after the first goal St Johnstone had an opportunity to score again when Kenny Deuchar had an attempt on goal after a pass from Rocco Quinn; the header beat goalkeeper Gallacher but went just wide of the goalpost. In the 19th minute, however, St Johnstone did score their second goal when Peter MacDonald struck a left-footed volley from 12 yards out which Dunfermline's goalkeeper Gallacher failed to stop.", "|DF || || Steven Anderson || || "]}, {"page": "Rob Kiernan", "response": ["On 22 June 2015, Kiernan signed a two-year deal at Rangers with the transfer fee reported to be £200,000. Over the course of the subsequent season, he played in central defence alongside Danny Wilson. The pair, however, received criticism for some of their performances, notably in the team's 3–2 loss to Hibernian in the 2016 Scottish Cup Final. On 19 July 2016, Kiernan extended his contract with Rangers for another year, until 2018. Kiernan scored his first goal for Rangers and only his third goal of his professional career on 10 December 2016, heading a James Tavernier free-kick to net the first of two goals as Rangers won 2–0. On 27 December 2016, he was linked with a £2m move to Fulham and the following day, during Rangers' 1–1 draw with St Johnstone, Kiernan appeared to strike Saints captain Steven Anderson. For this, Kiernan was offered a two-match suspension for violent conduct by the Scottish Football Association, however he chose to contest the charge, and it was ultimately dismissed by disciplinary tribunal on 12 January."]}, {"page": "Joe Shaughnessy", "response": ["Shaughnessy signed a pre-contract agreement with St Johnstone on 20 May 2015, agreeing a two-year deal. In October 2017, he was named as St Johnstone captain, replacing Steven Anderson in the role. He left St Johnstone at the end of the 2018–19 season."]}, {"page": "2011–12 St Johnstone F.C. season", "response": ["|6|||| DF|| Steven Anderson"]}, {"page": "Brian Winter", "response": ["In September 2010 he had to be talked out of quitting as a referee after he failed to send off Steven Anderson despite showing two yellow cards to the player in the space of 12 minutes."]}, {"page": "2012 Piala Indonesia", "response": ["|align=\"left\"| Steven Anderson"]}, {"page": "2012–13 St Johnstone F.C. season", "response": ["|6|||| DF|| Steven Anderson"]}]}}