{"wiki_id": "http://www.wikidata.org/entity/Q2490346", "itemLabel": "Maria Francesca Rossetti", "itemDescription": "English author", "wikipedia_url": "https://en.wikipedia.org/wiki/Maria_Francesca_Rossetti", "wikipedia_page": {"main": "Maria Francesca Rossetti (17 February 1827 – 24 November 1876) was a London-born English author and nun. She was the sister of artist Dante Gabriel Rossetti and William Michael Rossetti, and of Christina Georgina Rossetti, who dedicated her 1862 poem Goblin Market to Maria.", "link_mentions": [{"page": "John William Polidori", "response": ["His sister, Frances Polidori, married exiled Italian scholar Gabriele Rossetti, and thus John, posthumously, became the uncle of Maria Francesca Rossetti, Dante Gabriel Rossetti, William Michael Rossetti, and Christina Georgina Rossetti. William Michael Rossetti published Polidori's journal in 1911."]}, {"page": "Dante Gabriel Rossetti", "response": ["The son of émigré Italian scholar Gabriele Pasquale Giuseppe Rossetti and his wife Frances Mary Lavinia Polidori, Gabriel Charles Dante Rossetti was born in London, on 12 May 1828. His family and friends called him Gabriel, but in publications he put the name Dante first in honour of Dante Alighieri. He was the brother of poet Christina Rossetti, critic William Michael Rossetti, and author Maria Francesca Rossetti.Treuherz et al. (2003), pp. 15–18. His father was a Roman Catholic, at least prior to his marriage, and his mother was an Anglican; ostensibly Gabriel was baptised as and was a practising Anglican. John William Polidori, who had died seven years before his birth, was Rossetti's maternal uncle. During his childhood, Rossetti was home educated and later attended King's College School,  and often read the Bible, along with the works of Shakespeare, Dickens, Sir Walter Scott, and Lord Byron."]}, {"page": "1876 in literature", "response": ["*November 24 – Maria Francesca Rossetti, English critic and translator (born 1827)"]}, {"page": "Gabriele Rossetti", "response": ["* Maria Francesca Rossetti"]}, {"page": "Gaetano Polidori", "response": ["His daughter Frances (Frances Mary Lavinia Polidori, 27 April 1800 – 8 April 1886W. M. Rossetti (ed.), Dante Gabriel Rossetti: his family-letters (1970 [1895]), 21–24 (transcript: rossettiarchive.org) in 1826 married exiled Italian scholar Gabriele Rossetti.The date of the proposal was 7 December 1825, that of the weddings, in the Roman Catholic and English Church, on 8 and 10 April 1826, respectively. W. M. Rossetti (ed., trans.), Gabriele Rossetti: A Versified Autobiography (2016 [1901]), endnote 65. They had four children, Maria Francesca Rossetti, Dante Gabriel Rossetti, William Michael Rossetti and Christina Georgina Rossetti. After Gabriele's death in 1854, Frances quickly burned the remaining copies of his book Il Mistero dell' Amor Platonico del Medio Evo. Frances herself died in 1886 and was buried in the family plot at Highgate Cemetery."]}, {"page": "William Michael Rossetti", "response": ["Born in London, Rossetti was a son of immigrant Italian scholar Gabriele Rossetti and his wife Frances Rossetti née Polidori; he was the brother of Maria Francesca Rossetti, Dante Gabriel Rossetti and Christina Georgina Rossetti."]}, {"page": "Rossetti", "response": ["** Maria Francesca Rossetti (1827–1876), English author"]}, {"page": "List of Protestant authors", "response": ["* Maria Francesca Rossetti, author and nun"]}, {"page": "Frances Polidori", "response": ["The learning environment developed by the couple had uncommon effects on the cultural growth of their four children. In just a short time, they overtook their mother and teacher. However, Frances continued to play an active role in the lives of her daughters. In 1840, Maria Francesca Rossetti printed a translation of the poem by Giampietro Campana In the death of Guendalina Talbot. It was the first work of many to be produced by her children."]}, {"page": "List of Anglicans", "response": ["*Maria Francesca Rossetti "]}, {"page": "Charles Allston Collins", "response": ["Collins fell in love with Maria Francesca Rossetti, but she rejected him. He became increasingly ascetic and introspective.  These attitudes were expressed in Collins's best-known work, Convent Thoughts, which depicted a nun in a convent garden.  Collins went on to exhibit many highly devotional images."]}, {"page": "Maria Rossetti", "response": ["#REDIRECTMaria Francesca Rossetti"]}, {"page": "List of British Italians", "response": ["* Maria Francesca Rossetti"]}, {"page": "Olivia Rossetti Agresti", "response": ["Olivia Frances Madox Rossetti was born in London to William Michael Rossetti, one of the seven founding members of the Pre-Raphaelite Brotherhood and the editor of its literary magazine The Germ and Lucy Madox Brown. A granddaughter of Gabriele Rossetti and Ford Madox Brown, she was hence a niece of Maria Francesca Rossetti, Dante Gabriel Rossetti and Christina Rossetti, as well as a first cousin of Ford Madox Ford, Oliver Madox Hueffer and Juliet Catherine Emma Hueffer (the mother of Frank Soskice) through her mother's half-sister Catherine Madox Brown. "]}, {"page": "Rossettis", "response": ["* Maria Francesca Rossetti (1827--1876), author. "]}]}}