{"wiki_id": "http://www.wikidata.org/entity/Q2492102", "itemLabel": "Henry Pelham-Clinton, 5th Duke of Newcastle", "itemDescription": "British politician (1811-1864)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Pelham-Clinton,_5th_Duke_of_Newcastle", "wikipedia_page": {"main": "Henry Pelham Fiennes Pelham-Clinton, 5th Duke of Newcastle-under-Lyne,  (22 May 1811 – 18 October 1864), styled Earl of Lincoln before 1851, was a British politician.\n\n", "link_mentions": [{"page": "May 22", "response": ["*  1811   – Henry Pelham-Clinton, 5th Duke of Newcastle, English politician (d. 1864)"]}, {"page": "Trent Affair", "response": ["On December 28, 1861, Governor of the Colony of British Columbia James Douglas wrote to Secretary of State for the Colonies Henry Pelham-Clinton, 5th Duke of Newcastle, arguing that Britain should have the opportunity to take parts of the U.S.-held Pacific Northwest while America was preoccupied with the Civil War. He lay out his reasoning in the letter regarding the military strength of both nations in the region:Despatch to London: Douglas, Sir James to Pelham-Clinton, 5th Duke of Newcastle Henry Pelham Fiennes, 28 December 1861"]}, {"page": "List of knights and ladies of the Garter", "response": ["| Henry Pelham-Clinton, 5th Duke of Newcastle"]}, {"page": "Alexander Hamilton, 10th Duke of Hamilton", "response": ["* Lady Susan Hamilton, who married 1st, Henry Pelham-Clinton, 5th Duke of Newcastle; 2nd, Jean Alexis Op de Beeck."]}, {"page": "Henry Pelham Pelham-Clinton, 5th Duke of Newcastle", "response": ["#REDIRECT Henry Pelham-Clinton, 5th Duke of Newcastle"]}, {"page": "Lord Edward Clinton", "response": ["Clinton was the second son of Henry Pelham-Clinton, 5th Duke of Newcastle and his wife Lady Susan Hamilton and educated at Eton until 1853."]}, {"page": "Clinton, New Zealand", "response": ["Clinton was named for Henry Pelham-Clinton, 5th Duke of Newcastle, former British Secretary of State for the Colonies."]}, {"page": "Labouchere Amendment", "response": ["In April 1870, transvestites Boulton and Park were arrested for wearing drag outside the Strand Theatre. They were charged with conspiracy to commit sodomy with Lord Arthur Pelham-Clinton, who died (probably of suicide) later that year and who was the third son of the Henry Pelham-Clinton, 5th Duke of Newcastle. However, since there was no actual witness of any such act nor evidence of semen on their posterior regions, the charges were dropped."]}, {"page": "Somerset, Queensland", "response": ["With its separation from New South Wales on 10 December 1859, the new colony of Queensland acquired over  of coastline extending as far north as Cape York Peninsula. The colony's first parliament passed a resolution in 1860 favouring direct connection with England via the Torres Strait. In December 1861, Sir George Ferguson Bowen (1821–99), Governor of Queensland (1859–67), described the necessity for a station in the far north of Queensland. From a naval and military point of view, a post at or near Cape York would be valuable, due to the establishment of a French colony and naval station in New Caledonia. Bowen informed Henry Pelham-Clinton, 5th Duke of Newcastle, Secretary of State for the Colonies, that the government of Queensland would be willing to undertake the formation and management of a station at Cape York and to support a civil establishment there.C G Austin, \"Early History of Somerset and Thursday Island\", Journal of the Royal Historical Society of Queensland, Volume 4, issue 2, Brisbane 1949, p. 217."]}]}}