{"wiki_id": "http://www.wikidata.org/entity/Q2499856", "itemLabel": "Frederic Moore", "itemDescription": "British entomologist and lepidopterist", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederic_Moore", "wikipedia_page": {"main": "Frederic Moore FZS (13 May 1830 – 10 May 1907) was a British entomologist. He was also an illustrator and produced six volumes of Lepidoptera Indica and a catalogue of the birds in the collection of the East India Company.\n\nIt has been said that Moore was born at 33 Bruton Street, but that may be incorrect given that this was the address of the menagerie and office of the Zoological Society of London from 1826 to 1836. Moore was appointed an assistant in the East India Company Museum London from 31 May 1848 on a \"disestablished basis\" and became a temporary writer and then an assistant curator at the East India Museum with a pension of £330 per annum from 31 December 1879. He had a daughter Rosa Martha Moore. He began compiling Lepidoptera indica (1890–1913), a major work on the butterflies of the South Asia in 10 volumes, which was completed after his death by Charles Swinhoe. Many of the plates were produced by his son while some others were produced by E C Knight and John Nugent Fitch. Many species of butterfly were described by him in this work.\n\"Moore entered the doors of entomology by way of his artistic abilities. Dr. T. Horsfield (1777–1859), long associated with the East India Museum, required someone capable of doing natural history drawings and, through an introduction, Frederic Moore obtained the post. Thus began a lifetime association with Indian Lepidoptera\"Moore's son F. C. Moore was also an artist and prepared many of the plates in Lepidoptera Indica. Moore's brother T. J. Moore was a curator at the Liverpool Museum for forty years and his son Thomas Francis Moore was an osteologist at the National Museum at Melbourne.The colours of Indian butterflies, based on the plates in the Lepidoptera Indica were studied by J.C. Mottram in 1918.Moore was an associate of the Linnean Society of London, a member of the Entomological Society of London, a corresponding member of the Entomological Society of Stettin and of the Entomological Society of the Netherlands. His other works included A Catalogue of the Birds in the Museum of the East-India Company (1854–58, with Thomas Horsfield) and The Lepidoptera of Ceylon (1880–87).", "link_mentions": [{"page": "Common house martin", "response": ["The common house martin was first described by Carl Linnaeus in his landmark 1758 10th edition of Systema Naturae as Hirundo urbica, but was placed in its current genus, Delichon, by Thomas Horsfield and Frederic Moore in 1854. Delichon is an anagram of the ancient Greek term χελιδών (chelīdōn), meaning \"swallow\", and the species name urbicum (urbica until 2004, due to a misunderstanding of Latin grammar) means \"of the town\" in Latin."]}, {"page": "List of ornithologists", "response": ["*Frederic Moore – England"]}, {"page": "Charles Swinhoe", "response": ["Swinhoe was a keen shikari and had shot 50-60 tigers. He was also a member of the British Ornithologists' Union and contributed papers to The Ibis on the birds of southern Afghanistan and central India, and donated 300 bird skins from each country to the British Museum. While at Mhow he collaborated with Lieutenant Henry Edwin Barnes on the birds of central India. (Ibis 1885: 62–69, 124–138) He collected insects, chiefly Lepidoptera from Bombay, Poona, Mhow and Karachi districts.  He had one of the largest collections of Indian Lepidoptera at the time (40,000 specimens of 7,000 species and 400 new species described by him), and completed the Lepidoptera Indica series after the death of Frederic Moore in 1907. He also published in the Annals and Magazine of Natural History. He also wrote A Revision of the Genera of the Family Liparidae which covered 1130 entries and published a Catalogue of the Moths of India (Calcutta, 1887–89) with Everard Charles Cotes. After retirement he settled at Oxford and received an honorary M.A. for his work in entomology. The Entomological Society of France made him an honorary member. His Lepidoptera collection was purchased by James John Joicey."]}, {"page": "Indian natural history", "response": ["* 1812. Richard Parry, Esq. Drawings of Mammalia and Birds from Sumatra. The King of Tanjore's Drawings of Mammalia and Birds from Southern India presented by John Torin, Esq.Horsfield, T. & Frederic Moore (1856–8) THe birds in the museum of the Hon. East-India Company. Vol 1. W. H. Allen and Co. scanned book", "Guha, Ramachandra 2003. Churchill in Bangalore. The Hindu, Sunday 21 December 2003. Lepidopterists include Edward Yerbury Watson (?–1897) who took an interest in the Hesperiidae, Mark Alexander Wynter-Blyth (1906–1963), T. R. Bell (1863–1948) and Charles B. Antram (1864–1955). However entomology beyond butterfly collection gained importance due to the growing economic importance of agriculture. The position of an Imperial Entomologist was created at the Imperial Agricultural Research Institute (later the Indian Agricultural Research Institute). Entomologists who left a mark include William Stephen Atkinson (1820–1876), E. Brunetti (1862–1927), Thomas Bainbrigge Fletcher (1878–1950), Sir George Hampson (1860–1936), H. E. Andrewes (1863–1950), G. M. Henry (1891–1983), Colonel C. T. Bingham (1848–1908), William Monad Crawford (1872–1941), W. H. Evans (1876–1956), Michael Lloyd Ferrar, F. C. Fraser (1880–1963), Harold Maxwell-Lefroy (1877–1925), Frederic Moore (1830–1907), Samarendra Maulik (1881–1950), Lionel de Nicéville (1852–1901), Ronald A. Senior-White ( 1891–1954), Edwin Felix Thomas Atkinson (1840–1890) and Charles Swinhoe (1836–1923). With forests being of major economic value, there was an interest in forest entomology. Forest entomology started with E. P. Stebbing (1870–1960) and he was followed by many including A. D. Imms (1880–1949), who is better known for his entomology textbook that continues with new revisions to remain a standard reference. Other entomologists associated with forest entomology included C. F. C. Beeson. Malaria was a widespread disease and studies on mosquitoes gained special importance. Ronald Ross (1857–1932) established the link between mosquitoes and malaria during his researches when positioned at Bangalore, Ootacamund and Secunderabad. Sir S. R. Christophers (1873–1978) pioneered in the study of mosquitoes and was involved in the creation of the Malaria Survey of India. Others involved in this field included J. A. Sinton (1884–1956).Rao, BR Subba (1998) History of entomology in India. Institution of Agricultural Technologists, Bangalore."]}, {"page": "List of authors of names published under the ICZN", "response": ["* Moore – Frederic Moore (1830–1907) butterflies and moths"]}, {"page": "Robert Templeton", "response": ["In Ceylon Templeton worked mainly on Lepidoptera, Coleoptera and Hymenoptera alongside Edgar Leopold Layard (1824–1900). New species of Lepidoptera collected by Templeton and Layard were described by Frederic Moore, Francis Walker and George Robert Gray. The new Coleoptera were described by Joseph Sugar Baly, Francis Walker, John Obadiah Westwood, Carl August Dohrn and Francis Polkinghorne Pascoe. Templeton's publications on Lepidoptera amount to some general comments on papilionid butterflies and two species descriptions — Oiketicus terlius and Oiketicus (Cryptothelia) consortus."]}, {"page": "William Stephen Atkinson", "response": ["In Calcutta he joined The Asiatic Society and later became its secretary. He became interested in the Lepidoptera of Bengal and started breeding moths and communicated with Henry Tibbats Stainton. In 1857 he became a member of the Entomological Society. In 1860 he became Director of Public Instruction in Bengal and made visits to Darjeeling where he made extensive collections. He made trips to Sikkim with Dr Thomas Anderson of the Calcutta Botanic Garden. In 1865 he became a trustee of the New Indian Museum. He was in correspondence with Frederic Moore.", "Atkinson lived for many years in Calcutta collecting and painting pictures of specimens. His collection was purchased on his death by William Chapman Hewitson and deposited with the Natural History Museum in London. Frederic Moore and Hewitson described and published many of the new species collected by him."]}, {"page": "Tirumala limniace", "response": ["\"Green with golden scattered spots and beaded dorsal crescent\". (Frederic Moore quoted in Bingham)"]}, {"page": "William Chapman Hewitson", "response": ["*with Frederic Moore (1879–1888). Descriptions of New Indian Lepidopterous Insects: From the Collection of the Late Mr. W.S. Atkinson, M.A., F.L.S., &c. Calcutta: The Asiatic Society of Bengal. "]}, {"page": "Neptis hylas", "response": ["Race varmona = eurynome. Frederic Moore describes this from a drawing by Samuel Neville Ward as follows:"]}, {"page": "Graphium sarpedon", "response": ["Frederic Moore quoted in Bingham, 1907, described it as: \"Smooth, thickened from the second to the 5th segment and thence decreasing to the end; with two short subdorsal fleshy spines on the 4th segment, between which is a transverse pale yellow line, two shorter spines also on the 2nd and 3rd and two on the anal segment; colour green, with a longitudinal posterior lateral and lower pale yellowish line.\"", "The pupa is green with a slender and pointed thoractic projection, yellowish wing cases and lateral bands. \"Conical, truncated in front; thorax produced into a lengthened obtusely-pointed frontal process.\" (Frederic Moore quoted in Bingham, 1907)"]}]}}