{"wiki_id": "http://www.wikidata.org/entity/Q2493517", "itemLabel": "Gerard Bucknall", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Gerard_Bucknall", "wikipedia_page": {"main": "Lieutenant General Gerard Corfield Bucknall,  (14 September 1894 – 7 December 1980) was a senior British Army officer who served in both the First and Second World Wars. He commanded the 5th Infantry Division and later XXX Corps during the Battle of Normandy in 1944.", "link_mentions": [{"page": "Bernard Montgomery", "response": ["With the success of Cobra, which was soon followed by unleashing the 3rd American Army under the General George S. Patton, Eisenhower wrote to Montgomery: \"Am delighted that your basic plan has begun brilliantly to unfold with Bradley's initial success\". The success of Cobra was aided by Operation Spring when the II Canadian Corps under General Guy Simonds (the only Canadian general whose skill Montgomery respected) began an offensive south of Caen that made little headway, but which the Germans regarded as the main offensive. Once the 3rd American Army arrived, Bradley was promoted to take command of the newly created 12th Army Group consisting of 1st and 3rd American Armies. Following the American breakout, there followed the Battle of Falaise Gap, as the British, Canadian and Polish soldiers of 21st Army Group commanded by Montgomery advanced south, while the American and French soldiers of Bradley's 12th Army Group advanced north to encircle the German Army Group B at Falaise, as Montgomery waged what Urban called \"a huge battle of annihilation\" in August 1944. Montgomery began his offensive into the Suisse Normande region with Operation Bluecoat with Sir Richard O'Connor's VIII Corps and Gerard Bucknall's XXX Corps heading south. A dissatisfied Montgomery sacked Bucknall for being insufficiently aggressive and replaced him with General Brian Horrocks. At the same time, Montgomery ordered Patton—whose Third Army was supposed to advance into Brittany—to instead capture Nantes, which was soon taken."]}, {"page": "7th Armoured Division (United Kingdom)", "response": ["The 7th Armoured Division was one of the three British follow-up divisions of the two British assault corps earmarked for the Normandy landings.Ellis, p. 79 The 22nd Armoured Brigade embarked on 4 June and most of the division landed on Gold Beach by the end of 7 June, a day after the initial landings.Forty, p. 36 The division, part of Lieutenant General Gerard Bucknall's XXX Corps, initially took part in Operation Perch and Operation Goodwood, two operations that formed part of the Battle for Caen, itself part of Operation Overlord, codename for the Allied invasion of Normandy. During Perch, the division was to spearhead one arm of a pincer attack to capture the city. Due to a change in plan, elements of the division engaged tanks of the Panzer-Lehr-Division and the Heavy SS-Panzer Battalion 101 in the Battle of Villers-Bocage.Buckley, pp. 23–27 Following the capture of Caen, the division took part in Operation Spring, which was intended to keep the German forces pinned to the British front away from the Americans who were launching Operation Cobra and then Operation Bluecoat, an attack to support the American break-out and intercept German reinforcements moving to stop it. After the Battle of the Falaise Gap, which saw most of the German Army in Normandy destroyed, the 7th Armoured Division then took part in the Allied advance from Paris to the Rhine."]}, {"page": "Battle of Villers-Bocage", "response": ["The Second Army commander, Lieutenant-General Miles Dempsey, ordered Lieutenant-General Gerard Bucknall, the XXX Corps commander and Major-General George Erskine, the 7th Armoured Division commander, to disengage the 7th Armoured Division from Tilly-sur-Seulles, move through the gap, seize Villers-Bocage and menace the exposed left flank of the Panzer-Lehr Division. The British objective was a ridge  to the east of Villers-Bocage. Dempsey hoped that its capture would force the Panzer-Lehr Division to withdraw or risk being surrounded. The 50th (Northumbrian) Infantry Division and most of the infantry brigade of the 7th Armoured Division were to continue the attack against the Panzer-Lehr Division around Tilly-sur-Seulles and the 1st US and 2nd US Infantry divisions of the V US Corps would continue their advance."]}, {"page": "Normandy landings", "response": ["* 25px XXX Corps, commanded by Lieutenant General Gerard Bucknall"]}, {"page": "Allied invasion of Sicily", "response": ["On 3 August, XIII Corps exploited the disorganisation caused by the threat to Adrano and resumed their advance on Catania, and by 5 August the town was in their hands. Adrano fell to the 78th Division on the night of 6 August, while on the right, the 51st (Highland) Division took Biancavilla,  southeast of Adrano. After the fall of Adrano, the 1st Canadian Division was withdrawn into Army Reserve. On 8 August, the 78th Division moved north from Adrano took Bronte and the 9th Division, advancing from Troina, took Cesaro, valuable positions on the New Hube Line. Both divisions converged on Randazzo, on the north-west slopes of Etna. Randazzo fell on 13 August and 78th Division was taken into reserve. As the Allied advance continued, the front line shortened and Montgomery decided to withdraw XIII Corps HQ and the British 5th Infantry Division, now commanded by Major General Gerard Bucknall (replacing Major General Berney-Ficklin who returned to England), on 10 August, to allow them to prepare for the landings on mainland Italy. On the northern coast, the U.S. 3rd Division continued to meet strong resistance and difficulties created by extensive demolition of the road. Two more end-run amphibious attacks, and the rebuilding efforts of the engineers, kept the advance moving. Although Generalfeldmarschall Kesselring had already decided to evacuate, the Axis forces continued their delaying tactics, assisted by the favorable defensive terrain of the Messina Peninsula; on the night of 16 August, the leading elements of the 3rd Division entered Messina."]}, {"page": "I Corps (United Kingdom)", "response": ["I Corps, now commanded by Lieutenant General John Crocker, then took part in the Normandy landings on 6 June 1944 where, along with XXX Corps, under Lieutenant General Gerard Bucknall (who had commanded I Corps between April and August 1943), it was a spearhead corps of Lieutenant General Miles Dempsey's British Second Army, itself part of the 21st Army Group. The corps was then involved in the Battle of Normandy in fierce attritional fighting for control of the Normandy beachhead. After fighting for two months in the Battle for Caen, I Corps was subordinated on 1 August 1944 to the Canadian First Army, commanded by Lieutenant General Harry Crerar, for the remainder of the Normandy campaign Hart, p.19 and the subsequent operations in the Low Countries.Williams, p. 466. participating in Operation Astonia, the capture of Le Havre, and the operations to clear the Channel Coast, later helping to garrison \"The Island\" area between Arnhem and Nijmegen in the aftermath of the failed airborne invasion of the Netherlands, Operation Market Garden. During Operation Pheasant, I Corps was unique in that it fielded multi national divisionsm - Polish 1st Armoured Division, the Canadian 4th Armoured Division the British 49th Polar Bears Division and the US 104th Timberwolf Division. After the Battle of the Scheldt I Corps Headquarters then took over administration of the 21st Army Group's logistics area around the port of Antwerp, Belgium until the end of the war.", "* Apr-Aug 1943 Lieutenant-General Gerard Bucknall"]}, {"page": "53rd (Welsh) Infantry Division", "response": ["After the British Expeditionary Force (BEF) in France and Belgium was evacuated from Dunkirk in mid-1940, the threat grew of a German invasion of Northern Ireland. The 61st Infantry Division arrived to help defend it, with the 53rd Division charged with responsibility for the southern half of Ulster and the 61st Division the northern.Delaforce, p. 13. The divisions came under the command of III Corps.Barclay, p. 36. In March 1941, the garrison was reinforced with the 5th Infantry Division, a Regular Army formation that had fought in France in 1940.Delaforce, p. 15. The 53rd Division took part in many exercises, training by battalion, brigade, division and corps level. \"It was a very different 53rd Division which returned to near its own countryside in November 1941, from the comparatively untrained one which had moved to Ireland in driblets between October 1939 and April 1940.\"Barclay, p. 41. The 53rd Division, now commanded by Major-General Gerard Bucknall, returned to the Welsh Border counties again in November 1941, with the divisional HQ based in Whitchurch, Shropshire.Barclay, p. 42.", "In September 1942, the division received a new GOC (General Officer Commanding), Major-General Robert Knox \"Bobby\" Ross, an officer of the Queen's Royal Regiment (West Surrey) who arrived to replace Major-General Gerard Bucknall. Like most senior British commanders of the Second World War, he was a veteran of the Great War, where he had been awarded the Distinguished Service Order and the Military Cross. Before promotion to command of the 53rd, he had commanded the 160th Infantry Brigade and before that, the 2nd Battalion, Queen's Royal Regiment in Palestine. He commanded the 53rd (Welsh) Division until August 1945, training the division to a very high standard in England and Kent and leading it throughout the campaign in North-west Europe.", "|Major-General Gerard Bucknall"]}, {"page": "Allied invasion of Italy", "response": ["Operation Baytown was the preliminary step in the plan in which the British Eighth Army would depart from the port of Messina, Sicily, across the narrow Straits and land near the tip of Calabria (the \"toe\" of Italy), on 3 September 1943. The short distance meant landing craft could launch from there directly, rather than be carried by ship. The British 5th Infantry Division (Major-General Gerard Bucknall) of XIII Corps, under Lieutenant-General Miles Dempsey, would land on the north side of the \"toe\" while its 1st Canadian Infantry Division (Major-General Guy Simonds) would land at Cape Spartivento on the south side. Montgomery was strongly opposed to Operation Baytown. He predicted it would be a waste of effort since it assumed the Germans would give battle in Calabria; if they failed to do so, the diversion would not work, and the only effect of the operation would be to place the Eighth Army 480 km (300 miles) south of the main landing at Salerno. He was proved correct; after Operation Baytown, the British Eighth Army marched 480 km north to the Salerno area against no opposition other than engineering obstacles."]}, {"page": "49th (West Riding) Infantry Division", "response": ["On 26 April 1942, the division HQ was again reconstituted, this time in South Wales, serving under Western Command, commanded by Major General Curtis. The division initially had only the 147th Brigade under command, although the 70th Brigade became part of the division on 18 May, followed on 26 August by the 146th Brigade, and numerous other supporting units which later joined the division.Joslen, pps. 79–80 The division then spent the next few months engaged in training throughout Wales and England, with the intention of catching up with the latest training methods. In March 1943, the division, abandoning the mountain and arctic warfare roles, participated in Exercise Spartan, the largest military exercise held in England.Delaforce, p. 21 In April 1943, the division was assigned to I Corps, under Lieutenant General Gerard Bucknall, and was earmarked as an assault division for the invasion of Normandy, scheduled for spring the following year. On 30 April the division received a new GOC, Major General Evelyn \"Bubbles\" Barker. A highly competent officer and a decorated veteran of the First World War, Major General Barker ordered the divisional sign to be changed from its current emblem of a polar bear with its head lowered, which the GOC believed to be a sign of a lack of martial intent, into a more \"aggressive\" sign.Delaforce, p. 23 \"That Bear is too submissive. I want a defiant sign for my division, lift up its head and make it roar\", Barker wrote. Subsequently the 49th Division was issued with a new \"aggressive\" insignia, now featuring a Polar Bear with its head facing upwards, roaring.", "In July, as the division was selected to be one of the three divisions to spearhead the Normandy invasion, then scheduled for the following year, the 49th was sent to Scotland, where it began strenuous training in amphibious warfare and combined operations, which continued throughout 1943 and into 1944.Delaforce, p. 24 However, in early 1944, when General Sir Bernard Montgomery took over command of the 21st Army Group, which commanded all Allied land forces in the upcoming invasion, Major General Douglas Graham's 50th (Northumbrian) Infantry Division, which had fought with distinction in North Africa and Sicily, was chosen by Montgomery as one of the two British assault divisions – the other being Major General Tom Rennie's 3rd Division – and the 49th Division, despite training for the role for many months, was instead relegated to a backup role, causing great disappointment to all ranks.Delaforce, p. 26 In January 1944, the division moved to East Anglia, where, on 2 February, it was transferred from Lieutenant General John Crocker's I Corps, with which it had served since April 1943, to XXX Corps, under Lieutenant General Gerard Bucknall, and continued training for the invasion.Delaforce, pps. 26-27"]}, {"page": "XXX Corps (United Kingdom)", "response": ["General Officer Commanding Lt-Gen Gerard Bucknall (to 3 August 1944)Lt-Gen Brian Horrocks (from 4 August 1944)", "In Normandy XXX Corps, now commanded by Lieutenant-General Gerard Bucknall, again included the 50th Division which landed on Gold Beach. It quickly overwhelmed the German defenders of the 716th Infantry Division and had linked up with the I Corps by the end of D-Day. Following D-Day the corps launched Operation Perch. It made slow gains facing stiff resistance but by 10 June had linked up with US forces advancing from Omaha Beach. On 12 June, an opportunity arose. The Germans had a gap in their front lines near the Town of Caumont-l'Éventé. The 7th Armoured Division was sent to exploit the gap and head towards Villers-Bocage in an attempt to outflank the German Panzer-Lehr-Division and force them to withdraw, resulting in the Battle of Villers-Bocage. This attack was thwarted by elements of the Panzer Lehr Division and the 101st SS Heavy Panzer Battalion. Bucknall was heavily criticised for his decisions during the operation and battle.", "* Jan–Jul 1944 Lieutenant-General Gerard Bucknall"]}, {"page": "5th Infantry Division (United Kingdom)", "response": ["The 5th Division saw action during the invasion of Sicily where, towards the end of the campaign, in early August, the divisional commander, Major-General Berney-Ficklin, who had commanded the division since July 1940, was replaced by Major-General Gerard Bucknall. The division was pulled out of the line and absorbed replacements, and invaded the Italian mainland in Operation Baytown on 3 September (four years since Britain's entry into the war), still as part of XIII Corps of the Eighth Army, but now serving alongside the 1st Canadian Infantry Division, and advanced up the spine of Italy. Later in the year, the division fought in the Moro River Campaign, although sustaining relatively light casualties in comparison to the other Allied formations involved."]}, {"page": "Gold Beach", "response": ["Gold was assigned to Lieutenant General Gerard Bucknall's British XXX Corps, with the 50th (Northumbrian) Infantry Division–commanded by Major General Douglas Graham–allotted as the assault division. The 50th was a highly experienced division that had already seen combat in France, North Africa, and Sicily. The men underwent extensive training in amphibious landings, including Exercise Fabius, a major training exercise at Hayling Island in May 1944. Demolition teams responsible for disabling underwater beach obstacles trained in swimming pools in the United Kingdom. Briefings were undertaken using detailed maps that used fictitious place names, and most of the men did not find out their destination until they were already on their way to Normandy. The amphibious landing was to be preceded by extensive air bombardment as well as naval bombardment by Bombarding Force K, a task force of eighteen ships, primarily cruisers and destroyers. Amphibious tanks of the 8th Armoured Brigade were to arrive at 07:20, followed by infantry at 07:25. The 231st Infantry Brigade was assigned to land at Jig, and the 69th Infantry Brigade at King. The 231st was to head west to capture Arromanches and establish contact with the American forces at Omaha, while the 69th was to move east and link up with the Canadian forces at Juno. The 47th Royal Marine Commando was assigned to land at Gold, infiltrate inland, and capture the small port at Port-en-Bessin from the landward side."]}, {"page": "Gerald Templer", "response": ["He remained in the army during the interwar period and served with his battalion, still the 1st Irish Fusiliers, after briefly returning to England, in operations in Persia (now Iran) and Iraq in 1919–20 as part of a multi-national attempt to prevent the spread of bolshevism, which was followed by service in Egypt.Cloake, pps. 29–37 Returning to England with the battalion, where it was amalgamated with the 2nd Battalion in November 1922,Cloake, pps. 37–38 Templer was a reserve for the 1924 Summer Olympics as a 120-yard hurdler, although in the end he did not compete.Cloake, p. 38 In January 1925 the battalion again returned to Egypt, where it remained until October 1927 when it was sent to India, although Templer did not accompany them. Just before the battalion sailed for India he had returned to England to attend the Staff College, Camberley, which he did from 1928 to 1929, and was the youngest student there, aged just 29.Cloake, p. 47 Among his many fellow students were men such as John Harding, Richard McCreery, Gordon MacMillan, Alexander Galloway, Gerard Bucknall, Philip Gregson-Ellis, Alexander Cameron and Cameron Nicholson. In the year senior to him were Eric Dorman-Smith, John Hawkesworth, John Whiteley, Evelyn Barker, Oliver Leese, Ronald Penney, Robert Bridgeman, Philip Christison and numerous others while, in Templer's second year, in the year below, were George Erskine, Harold Freeman-Attwood, Neil Ritchie, Herbert Lumsden, Reginald Denning and Maurice Chilton. Templer's instructors there included Bernard Paget, Henry Pownall and Bernard Montgomery. Due to the Royal Irish Fusiliers being reduced to a single battalion in 1922, and thus promotion in the regiment being slower than in the rest of the army, Templer was forced to transfer to the Loyal Regiment (North Lancashire), to gain a promotion to captain, which was backdated to 11 August 1928.Heathcote, Anthony pg 274 After graduation from the Staff College, Templer joined the 2nd Battalion of his new regiment, then stationed at Aldershot, in January 1930.Cloake, pps. 49–50", "He did not remain there for much longer, however, as, in September 1942, he was promoted to become GOC II CorpsHeathcote, Anthony pg 275 as the British Army's youngest acting lieutenant-general. However, the corps was actually II Corps District, a static formation, with responsibility for the defence of northern East Anglia against invasion. By this time, the threat of invasion had much receded and, by early 1943, much of Templer's command had been posted away, the 1st Division moving to North Africa and the 76th Division being reduced to a reserve division, leaving Templer with little more than 30 Home Guard battalions.Cloake, p. 98 Then, in April 1943, he took command of XI Corps, with the 54th and 61st Divisions and numerous smaller units under command. In May XI Corps absorbed II Corps and assumed responsibility for the defence of all of East Anglia. Despite this, Templer was growing impatient at training troops and wished for a field command. To this end, in July, he approached General Sir Bernard Paget, the Commander-in-Chief, Home Forces (and formerly one of Templer's instructors at the Staff College), and offered to give up his rank of acting lieutenant-general so that he could command a division on active service. His offer was accepted and, together with Gerard Bucknall (a fellow student at the Staff College who, like Templer, had risen rapidly but was presumably sharing his mindset), Templer, reverting to major-general on 30 July, flew out to Algiers, arriving there the day after.Cloake, p. 99"]}, {"page": "Operation Husky order of battle", "response": ["* 5th Infantry DivisionMolony, p. 81n.Commanded by Major-General Horatio Berney-Ficklin (succeeded by Major-General Gerard Bucknall on 3 AugustMolony, p. 177n)."]}, {"page": "Tasker Watkins", "response": ["Following the outbreak of the Second World War in September 1939, Watkins joined the British Army, initially as a private in the Duke of Cornwall's Light Infantry, in October. After serving for over a year as a private he was sent for officer training and was commissioned, with the rank of second lieutenant, into the Welch Regiment on 17 May 1941. He was given the service number 187088. He was posted to the regiment's 1st/5th Battalion, a Territorial Army (TA) unit. The battalion was one of three (the others being the 4th Welch Regiment and the 2nd Monmouthshire Regiment) which formed part of the 160th Infantry Brigade, itself being one of three brigades (the others being the 158th and 159th) forming the 53rd (Welsh) Infantry Division. The division, then commanded by Major General Gerard Bucknall, was serving in Northern Ireland until moving to Wales late in 1941, and then to Kent in April 1942, where it remained for over two years before it saw action, until then being engaged in training and military exercises."]}, {"page": "Richard Gale (British Army officer)", "response": ["By December 1940 Gale, who had not seen service with the British Expeditionary Force (BEF) in France and Belgium, had been promoted to the acting rank of lieutenant-colonel and, wishing for a field command, was given command of the 2/5th Battalion, Leicestershire Regiment, a second-line Territorial Army (TA) unit that was part of Brigadier Gerard Bucknall's 138th Infantry Brigade, itself part of the 46th Infantry Division, then commanded by Major-General Charles Hudson, which had fought with the BEF.Mead, p. 155 The battalion, along with the rest of the division, was serving in Scotland, reforming after having sustained very severe casualties in France, before moving to East Anglia in January 1941. Then, in the summer of 1941, the 1st Parachute Brigade was formed as part of the expansion of the British Army's newly created airborne forces, and Gale was offered command of the brigade by General Sir Alan Brooke, the Commander-in-Chief, Home Forces (and soon to be Chief of the Imperial General Staff), who was impressed with the high morale and standards in Gale's battalion; he accepted the command.Dover, pp. 26–27 In late October the 1st Airlanding Brigade, under Brigadier George Hopkinson, along with the 1st Parachute Brigade, under Gale, were assigned to the newly created 1st Airborne Division, whose first General Officer Commanding (GOC) was Major-General Frederick Browning."]}, {"page": "Harry Crerar", "response": ["First Canadian Army became operational in Normandy at noon on 23 July when it assumed responsibility for the eastern part of Montgomery's 21st Army Group's line, which was held by Lieutenant-General John Crocker's British I Corps. In a letter to Brooke, Montgomery noted that Crerar \"made his first mistake at 1205 hrs, and his second after lunch.\" Crerar immediately clashed with Crocker, requiring Montgomery's intervention. Crerar suggested that he be given Lieutenant-General Gerard Bucknall's British XXX Corps or Lieutenant-General Neil Ritchie's British XII Corps instead; Bucknall had been his GSO2 at Kingston, and Ritchie was a colleague when Crerar  had worked at the War Office in the 1920s, and he was confident that he could work with them. Montgomery was unwilling to reorganise his forces just to accommodate this. British I Corps would remain part of the First Canadian Army until March 1945, and despite the rocky start, Crerar and Crocker would build a good working relationship. Simonds's II Canadian Corps came under Crerar's command at noon on 31 July, and the Polish 1st Armoured Division was assigned to II Canadian Corps on 5 August, making the First Canadian Army a truly multinational force."]}, {"page": "Miles Dempsey", "response": ["For the invasion of Sicily, Dempsey's XIII Corps had two infantry divisions, the 5th Division under Berney-Ficklin and the 50th Division under Major-General Sidney Kirkman, and Brigadier John Cecil Currie's 4th Armoured Brigade, which had only two armoured regiments, the 44th Royal Tank Regiment and the 3rd County of London Yeomanry (Sharpshooters). He was also responsible for the 1st Airborne Division, under Major-General George Hopkinson, which would be dropped by parachute and glider just prior to the amphibious landings. The landings on Sicily on 10 July 1943 initially went well, with XIII Corps achieving all its first day objectives, but by 12 July progress slowed after the 5th Division encountered elements of the German Hermann Göring Division. Montgomery and Dempsey attempted to capture Catania using paratroops and commandos. This was only partially successful, and Catania was not taken. Dempsey suggested an amphibious operation, but this was rejected by Montgomery in favour of switching the main axis of the Eighth Army's advance inland to XXX Corps to the west of Mount Etna. On 3 August Dempsey relieved Berney-Ficklin of his command. His performance had impressed neither Dempsey nor Montgomery, and the latter was happy to replace him with another protégé, Gerard Bucknall."]}, {"page": "Brian Horrocks", "response": ["It was a year before Horrocks recovered sufficiently to tell Field Marshal Sir Alan Brooke, the Chief of the Imperial General Staff (CIGS), that he was \"very anxious to be given another corps\".Alanbrooke. War Diaries, p. 555. Restored to the acting rank of lieutenant-general in August 1944, he was sent to France to assume command of XXX Corps during the cataclysm engulfing the trapped German 7th Army and 5th Panzer Army in the Falaise Pocket. Montgomery had been dissatisfied with the performance of the corps and its GOC, Gerard Bucknall, a fellow Middlesex Regiment officer, since the landings in Normandy two months earlier.Smart. Biographical Dictionary of British Generals of the Second World War, p. 51. Horrocks retained control of XXX Corps during the advance through Belgium, taking Brussels, and at one point advanced  in only six days.Warner. Horrocks, p. 110. Supplies were a constant concern; the major French deep-water ports were still in German hands, and Allied supply lines stretched back to the Normandy beaches. Montgomery's 21st Army Group was by now operating  from its ports—twice the distance logistical planners had accounted for—so XXX Corps was diverted towards Antwerp to secure its docks and harbour.French. Raising Churchill's Army, p. 119. The city and port fell to the 11th Armoured Division in early September, but Montgomery halted XXX Corps for resupply short of the wide Albert Canal to the north of the city, which consequently remained in enemy hands.Neillands. The Battle for the Rhine, p. 53. Horrocks regretted this after the war believing that his corps might have advanced another  with the fuel available.Horrocks. A Full Life, p. 205. Although some doubt this could have been achieved without delays, it is now known that XXX Corps was opposed by only one German division, although Allied forces were unaware of this at the time.Warner. Horrocks, p. 111. The pause allowed the Germans to regroup around the Scheldt River, and by the time the Allies resumed their advance, the First Paratroop Army (General Kurt Student) had arrived and set up strong defensive positions along the opposite side of the canal.Neillands. The Battle for the Rhine, p. 58. The task of breaking the strengthened German line, which stretched from Antwerp to the North Sea along the Scheldt River, would fall to the First Canadian Army in the month-long, costly Battle of the Scheldt.Neillands. The Battle for the Rhine, pp. 157–161. By mid-September, XXX Corps had been diverted again, this time to the east."]}, {"page": "Lord Lieutenant of Middlesex", "response": ["*Gerard Bucknall 10 July 1963 – 1965"]}, {"page": "Bucknall", "response": ["*Gerard Bucknall (1894-1980), British World War II general."]}, {"page": "Operation Bluecoat", "response": ["The British advance was held up by the German reinforcements. VIII Corps also had to protect its eastern flank, because XXX Corps had not kept up the same rate of advance. The commander of XXX Corps, Lieutenant-General Gerard Bucknall, was dismissed on 2 August and the commander of the 7th Armoured Division, Major General George Erskine, was sacked the next day. Lieutenant General Brian Horrocks, a veteran of North Africa replaced Bucknall on 4 August. The Second Army advance was brought to a temporary halt on 4 August. Vire fell to an American night attack by the 116th Regiment of the US 29th Division against the 363rd Division on 6 August. On the same day, the 43rd (Wessex) Division and tanks of the 13th/18th Royal Hussars captured Mont Pinçon.", ":XXX Corps (Gerard Bucknall to 2 August then Brian Horrocks)"]}, {"page": "John Crocker", "response": ["Again, Crocker's appointment was not destined to last long as, in September, he relinquished command of XI Corps over to Lieutenant-General Gerard Bucknall, and took command of IX Corps from Lieutenant-General Francis Nosworthy. The corps, with Gordon MacMillan as its Brigadier General Staff (BGS), was then stationed in Northern England under Northern Command, with responsibility for Durham, Northumberland, and the North Riding of Yorkshire.Mead, p. 107 Crocker's rank of Major-General was made permanent on 4 December 1942 (with seniority backdated to 16 November 1941). On 16 March 1943 Crocker's rank of Lieutenant-General was made temporary.", "Crocker returned to England in May after his IX Corps HQ was disbanded and he remained temporarily unemployed. On his return to service in August he was, upon the recommendation of General Sir Harold Alexander, commander of the Allied 18th Army Group in North Africa, to Brooke, given command of I Corps in early August.Delaney, p. 138 Crocker took over from Lieutenant-General Gerard Bucknall, who had requested demotion to Temporary Major-General to command a division overseas.", "However, Caen did not fall on D-Day as planned, although a battalion of the British 3rd Division made a spirited attempt before being driven back by the 21st Panzer Division. Instead, Crocker's corps took part in the bloody two-month Battle for Caen, including Operation Charnwood, which still had the 3rd Canadian and 3rd British Divisions under command (the latter now under Major-General Lashmer Whistler after Rennie was injured), along with Major-General Lewis Lyne's 59th Division.Mead, p. 108 The operation began on 7 July and, after heavy fighting, had captured most of the Caen city centre, although the Germans still held the southern half. The corps, losing the 3rd Division soon after and gaining Major-General Evelyn Barker's 49th Division in exchange, came under command of Lieutenant-General Harry Crerar's First Canadian Army in August 1944, I Corps drove forward to the River Seine and then took part in the unglamorous mopping up operations along the French and Belgian coastline. The relationship between Crocker and Crerar was not always cordial, with the latter, shortly after taking Crocker's I Corps under command of the First Army, attempted to sack Crocker and replace him with either Lieutenant-Generals Neil Ritchie (GOC XII Corps) or Gerard Bucknall (GOC XXX Corps). However, Crerar was overruled by General Montgomery, the 21st Army Group commander, although the relationship improved thereafter.Delaney, pps 156-160"]}, {"page": "Alfred Dudley Ward", "response": ["In late September 1943 Ward exchanged jobs with Brigadier Roy Urquhart to take command of the 231st Brigade Group while Urquhart became BGS XII Corps, which had seen recent action in the Allied invasion of Sicily. However, within a week of arriving he was ordered to exchange jobs once more, and assumed command of the 17th Infantry Brigade which, strangely, Stopford, his corps commander in England, had commanded in France in 1940. The brigade was one of three which formed part of Major General Gerard Bucknall's 5th Infantry Division, which he led in the early stages of the Italian campaign."]}, {"page": "Gerald Bucknall", "response": ["#REDIRECT Gerard Bucknall"]}, {"page": "Richard McCreery", "response": ["McCreery was appointed adjutant of his regiment in December 1921. He attended the Staff College, Camberley, from 1928 to 1929. His fellow students in the Junior Division there included Gerard Bucknall, Gerald Templer, Alexander Cameron, Alexander Galloway, I. S. O. Playfair, John Harding, Philip Gregson-Ellis and Gordon MacMillan, whilst the instructors included Richard O'Connor, Bernard Paget, Henry Pownall, Harold Franklyn and Bernard Montgomery.Mead 2010, pps. 43–44 He was then appointed brigade major of the 2nd Cavalry Brigade in 1930 and Commanding Officer of his regiment in 1935.Liddell Hart Centre for Military Archives"]}, {"page": "Headquarters Northern Ireland", "response": ["*Major-General Gerard Bucknall 1944–1948"]}, {"page": "West Downs School", "response": ["*Gerard Bucknall (Lieutenant-General);"]}, {"page": "Moro River Campaign", "response": ["The Moro River runs from the central mountain spine of Italy to the Adriatic coast south of Ortona. The German defences on the Moro were a centerpiece of the Winter Line, which guarded the eastern side of the Apennines along Route 5. Montgomery hoped to punch through the Winter Line, capture Ortona and Pescara and advance to Rome. The British 78th Infantry Division, which had been spearheading V Corps since the Volturno Line actions and had sustained over 7,000 casualties in less than six months,Hingston (1946), p. 23 was relieved by the fresh 1st Canadian Infantry Division (Major-General Christopher Vokes), ready to renew the offensive on 5 December 1943.Hoyt (2007), p. 115 The 78th Infantry Division was sent into the mountains on the relatively quiet left wing of the army, joining the British 5th Infantry Division (Major-General Gerard Bucknall) under XIII Corps."]}, {"page": "Horatio Berney-Ficklin", "response": ["On 10 July Berney-Ficklin's 5th Division landed on Sicily as part of Operation Husky, the Allied invasion of Sicily. They were amongst the first British troops to land in Europe for more than three years. Before the day was over his division had captured Syracuse, with Augusta falling soon days later. Thereafter the division, aiming for Messina, who had faced only light resistance from the Italian Army, faced stiffening opposition from the Germans, in particular from the Hermann Göring Division in the Plain of Catania. Before the campaign was over, however, on 3 August Berney-Ficklin was relieved of his command and replaced as GOC by Major General Gerard Bucknall, a protégé of Montgomery's who was two years younger, and returned to England.Mead, p. 65 Despite being a popular GOC, his performance in Sicily had impressed neither Montgomery or Dempsey, thus ending Berney-Ficklin's long association with the division.Smart, p. 31 Ironically Bucknall, who commanded the 5th Division in the early stages of the Italian Campaign before being promoted to the command of XXX Corps in the Normandy Campaign, would himself be relieved of his command exactly a year later, for much the same reason as Berney-Ficklin was relieved. On 5 August Berney-Ficklin, for his services in Persia and Iraq, was mentioned in despatches."]}, {"page": "Gerard", "response": ["*Gerard Bucknall (1894–1980), British army general"]}, {"page": "G.C. Bucknall", "response": ["#REDIRECT Gerard Bucknall"]}, {"page": "Operation Perch", "response": ["On 12 June, Dempsey met with Lieutenant-General Gerard Bucknall (XXX Corps) and Major-General George Erskine (7th Armoured Division) and ordered Erskine to disengage the division from the fighting around Tilly-sur-Seulles. The 7th Armoured Division was to exploit the gap to seize Villers-Bocage and advance behind the left flank of the Panzer-Lehr Division, to a ridge about  east of the town. It was believed that the appearance of British tanks behind the Panzer-Lehr Division on high ground astride German supply-lines would compel the Panzer-Lehr Division to withdraw or be trapped. To support the flanking move of the 7th Armoured Division, the 50th (Northumbrian) Infantry Division was to continue its attack against the Panzer-Lehr Division around Tilly-sur-Seulles. The US V Corps would push forward at the same time, the 1st US Infantry Division to capture Caumont and the high ground nearby and the 2nd US Infantry Division to advance towards Saint-Lô."]}, {"page": "Douglas Graham (British Army officer)", "response": ["After being evacuated to hospital in the United Kingdom, by January 1944 Graham, after being mentioned in despatches for his service in North Africa and Italy, was judged to be sufficiently recovered from his injuries to be given command of the 50th (Northumbrian) Infantry Division, a highly experienced first-line TA formation which had served with distinction in North Africa and Sicily, in place of Major General Sidney Kirkman, who was being given command of XIII Corps on the Italian front. Even at this stage of the war division GOCs with Graham's extensive battle experience were scarce. Comprising the 69th, 151st and 231st Infantry Brigades along with divisional troops, the 50th Division, with its considerable fighting experience, was brought back from Sicily in November 1943 to spearhead the Allied invasion of Normandy, codenamed Operation Overlord. However, after so much time spent fighting overseas, and, after being informed that the division was to play a leading role in the invasion, (replacing Major General Evelyn Barker's 49th Division, the initial choice) morale in the 50th Division was not high, with many veterans believing they had done more than fair share of the fighting, although morale later improved, due to Graham's leadership. The division was assigned to XXX Corps, under Lieutenant General Gerard Bucknall, which itself was part of the British Second Army, commanded by Lieutenant General Miles Dempsey (Graham's brigade commander in France from 1939 to 1940), and, supported by the 56th Independent Infantry Brigade and the 8th Armoured Brigade, was to land at Gold Beach on D-Day. For the invasion itself Graham had some 38,000 troops, more than twice the average strength of a division, under his command."]}, {"page": "Index of World War II articles (G)", "response": ["# Gerard Bucknall"]}, {"page": "Operation Perch order of battle", "response": ["Lieutenant-General Gerard Bucknall"]}, {"page": "Moro River Campaign order of battle", "response": [":* 5th British Infantry Division (Major-General Gerard Bucknall)"]}]}}