{"wiki_id": "http://www.wikidata.org/entity/Q2493793", "itemLabel": "Darryl Way", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Darryl_Way", "wikipedia_page": {"main": "Richard Darryl Way (born 17 December 1948 in Taunton, Somerset, England) is an English rock and classical musician who was a founding member of Curved Air and co-writer of their only hit single, \"Back Street Luv\". He is best known as a violinist although he also plays keyboards.", "link_mentions": [{"page": "Marillion", "response": ["Following the UK tour to promote Script for a Jester's Tear, Mick Pointer was dismissed due to Fish's dissatisfaction with what he later described as the drummer's \"awful\" timing and failure to develop as a musician with the rest of the band. Ian Mosley, who had played for acts including  Darryl Way's Wolf and the Gordon Giltrap band, was eventually secured as Pointer's replacement after a series of other drummers, including Andy Ward and Jonathan Mover, were short-lived. Despite the numerous production problems encountered during this period, the second album, Fugazi, built upon the success of the first album with a more streamlined hard rock sound. It improved on the chart placing of its predecessor by reaching the top five and produced the singles \"Punch and Judy\" (number 29) and \"Assassing\" (number 22)."]}, {"page": "Heavy Horses", "response": ["As with the band's previous album Songs From the Wood, other members of the band beyond just Anderson were involved in writing music for the album, with guitarist Martin Barre writing portions of the title track and \"No Lullaby\" and Palmer writing string arrangements for most of the album as well as the instrumental bridge of \"...And the Mouse Police Never Sleeps\". Darryl Way of Curved Air guests on the album, playing violin on the title track and \"Acres Wild\".", "AllMusic calls Heavy Horses one of the prettiest records of the band, praising both Martin Barre's and John Glascock's playing as Robin Black engineering and the special participation of Curved Air violinist Darryl Way.", "* Darryl Way – violin (on \"Acres Wild\" and \"Heavy Horses\")"]}, {"page": "Ian Mosley", "response": ["Mosley studied percussion at the Guildhall School of Music and Drama under teacher Gilbert Webster and, aged 18, played in the orchestra for the musical Hair. His first professional band was Darryl Way's Wolf. Mosley played drums for former Genesis guitarist Steve Hackett, both on two of his solo studio albums and on tour. He played for Gordon Giltrap. He also played on the 1975 album Birds by Dutch band Trace."]}, {"page": "Stewart Copeland", "response": ["Returning to England, Copeland worked as road manager for the progressive rock band Curved Air's 1974 reunion tour, and then as drummer for the band during 1975 and 1976. The band kicked off with a European tour, which started poorly. Band leader Darryl Way, a notorious perfectionist,Welch, Chris (1973). In Canis Lupus [sleeve notes]. grew impatient with the struggling of his bandmates, especially novice drummer Copeland.Sutcliffe, Phil & Fielder, Hugh (1981). L'Historia Bandido. London and New York: Proteus Books. . Pages 15–16. Then, for reasons no one could pinpoint, the musicians suddenly \"clicked\" with each other and the band caught fire, quickly becoming a popular and acclaimed live act."]}, {"page": "Eddie Jobson", "response": ["Jobson was born Edwin Jobson in Billingham, Stockton-on-Tees, England on 28 April 1955. He started to learn piano at age 7, and added violin when he was 8 - he received a Diploma of Distinction from the Royal Academy of Music at the same age, and was playing in an orchestra at 12. At 16 he applied to study at the Royal Academy, but this was denied a place because of his age, so he joined local band, Fat Grapple, instead. When he was 17 in 1972, Fat Grapple supported Curved Air, and shortly afterwards Jobson replaced the departing Darryl Way on violin."]}, {"page": "Steve Hogarth", "response": ["In 1985, Hogarth and guitarist Colin Woore left the band to form How We Live,  The duo were signed to Columbia Records. In 1987, following record company changes, How We Live's debut album Dry Land was unsuccessful. Hogarth considered leaving the music industry and becoming a milkman or postman. However, a meeting with his publishers arranged by a friend, Darryl Way, a founding member of Curved Air, persuaded him to send a tape to Marillion, who were recruiting for a new lead vocalist following the departure of Fish in late 1988."]}, {"page": "Curved Air", "response": ["The group evolved out of the band Sisyphus,C.Keyes personal communication who played one of their early gigs in the ballroom of Leith Hill Place, Surrey for a masked ballBrennan, Mark (1995). \"Curved Air\". In Midnight Wire [CD booklet]. Repertoire Records. and which was formed by Darryl Way (who studied violin at Dartington College and the Royal College of Music) and Francis Monkman, a member of the Royal Academy of Music. While wandering through an outlet store of the Orange Music Electronic Company, Monkman was intrigued by the sound of Way testing his first electrically amplified violin, and the two \"got to talking.\" They discovered they had a lot in common, and in 1969 invited pianist Nick Simon who, along with bassist Rob Martin and drummer Florian Pilkington-Miksa, completed the line-up of Sisyphus. \"Darryl and Nick were very much into Spirit. One could cite them as a formative influence for Curved Air\", Monkman later remembered. Many of the early Curved Air songs were written for Sisyphus, among them \"Young Mother in Style\" and \"Screw\".", "This division was reflected in the arrangement of tracks on Second Album and Phantasmagoria; side A of both albums was occupied by music composed by Darryl Way, while side B was devoted solely to Monkman's compositions, with no true collaboration between the two writers. While working in the studio the band was in a dire condition. \"I remember the moment when Clifford Davis, our manager after Mark Hanau, spelled out what we were going to have to do just to get somewhere near even. We felt burned out\", Monkman later said. By the end of 1972 Monkman was a self-admitted \"nervous wreck\"  and on the verge of physical and mental breakdown. He had to wear earplugs to go on the London Underground and went to a naturopath three times a week.", "Curved Air split up, Way formed Darryl Way's Wolf, Pilkington-Miksa joined Kiki Dee's band, and Monkman moved into session work and was later to play in, among others, the supergroup Sky.", "In 1974 Chrysalis sued the band. \"We had broken their contract on the advice of Clifford Davis, who said we could prove that they had not been acting in our best interests, but by then he was no longer our manager!\" Monkman explained. In order to discharge an enormous unpaid VAT bill,Sutcliffe, Phil & Fielder, Hugh (1981). L'Historia Bandido. London and New York: Proteus Books. . Pages 15–16. in September 1974 the band's mainstays (Kristina, Way, Monkman, and Pilkington-Miksa) reunited for a three-week tour of the UK, put together by Darryl Way's manager, Miles Copeland III. The reunion interrupted Way's new band, Stark Naked and the Car Thieves, and since the bass slot for Curved Air needed filling, Way brought along the new band's bassist, Phil Kohn.", "However, Darryl Way wanted to continue Curved Air with Sonja Kristina. Way brought in two more \"Car Thieves\", guitarist Mick Jacques and drummer Stewart Copeland.(Miles Copeland III's brother). Now more members of this new lineup came from Stark Naked and the Car Thieves than Curved Air . With Darryl Way at the helm, this new band often employed the same classical and folk influences as the original band and played the now classic Curved Air songs at their shows), but their core sound was rooted in pop, rhythm and blues, and hard rock. Miles Copeland III, still serving as Curved Air's manager, put the group on his own label, BTM.Sutcliffe, Phil (1993). \"Stewart Copeland: A Population Statistic\". In Message in a Box: The Complete Recordings (pp.10–12) [Boxed set booklet]. A&M Records Ltd.", "In 1984 Darryl Way asked Sonja Kristina to provide vocals to several of his solo recordings, two of which, \"Renegade\" and \"We're Only Human\", were released as a single under the Curved Air name. A third track, a cover of \"O Fortuna\", was released as a Sonja Kristina solo track on the b-side to \"Walk on By\", but was withdrawn due to objections from the Carl Orff estate. Yet another track, \"As Long as There's a Spark\", was originally recorded by Way and Kristina, but released as a Darryl Way solo track, with Way performing the vocals himself. Way and Kristina followed these recordings with a short tour in 1988, again under the Curved Air name.", "In early 2008, the band regrouped.Ticket News, Vernon, CT \"Curved Air reunites and hits the road.\" On 4 May 2008, in a message to the Curved Air Yahoo Group, Kristina advised that the new line-up would be herself, Darryl Way (violin), Florian Pilkington-Miksa (drums), Andy Christie (guitar) and Chris Harris (bass). Francis Monkman, who was originally pictured with Kristina, Way and Pilkington-Miksa for the reunion, left the project. \"Unfortunately, he didn't have the same vision as the rest of us as to how (the new project) should be approached and wasn't prepared to compromise, so our ways had to part\", commented Way. Sonja Kristina confirmed, \"Francis was in at the beginning but had extremely different ideas from Darryl about how he wanted this new Curved Air to prepare and develop. Eventually, he withdrew. We continued with Darryl as our musical director and producer.\" The new line-up played in Southern England, Italy and Malta in 2008.", "For the 2009 dates in Japan on 16 and 17 January at Club Citta, Kawasaki, the guitarist was Kit Morgan who replaced Christie. On 9 August 2009, Eddie Jobson stood in for Darryl Way at a one-off gig in Chislehurst.", "On 4 September 2015, Curved Air played a special concert at Under The Bridge, London, to mark the 45th Anniversary of the release of Air Conditioning. The album was played in full for the first time ever. The band was joined on stage by Darryl Way for \"Vivaldi\" and two other songs. Ian Eyre also played bass during \"Back Street Luv\".", "* Darryl Way – violin, keyboards, backing vocals, guitars, drum machine (1970–1972, 1974–1976, 1984, 1988, 1990, 2008–2009)", "* Darryl Way – violin, keyboards, backing vocals", "* Darryl Way – violin, keyboards, backing vocals", "* Darryl Way – violin, keyboards, backing vocals", "* Darryl Way – violin, keyboards, backing vocals", "* Darryl Way – violin, keyboards, backing vocals", "* Darryl Way – violin, keyboards, backing vocals", "* Darryl Way – violin, keyboards, backing vocals", "* Darryl Way – violin, keyboards, guitars, drum machine", "* Darryl Way – violin, keyboards, backing vocals", "* Darryl Way – violin, keyboards, backing vocals", "* Darryl Way – violin, keyboards, backing vocals", "|New recordings of songs from the first five studio albums plus two new tracks especially written by Darryl Way for the album – The Fury and Coming Home."]}, {"page": "Hohner Pianet", "response": ["Early Pianets were used on a number of hit recordings from the 1960s and 1970s, including \"She's Not There\" by The Zombies; \"Louie Louie\" by The Kingsmen; \"I Am the Walrus\", \"Getting Better\", \"The Night Before\", \"Tell Me What You See\", \"You Like Me Too Much\" by The Beatles; \"This Guy's in Love With You\" by Herb Alpert; \"These Eyes\" by The Guess Who; and \"Joy to the World\" by Three Dog Night.  In the glam rock era, the Pianet was used by Bryan Ferry on the first few Roxy Music albums, for instance featuring prominently in their hit \"Editions of You\". It was a staple of the \"classic lineup\" sound of Curved Air (1970–1972), featuring prominently on their first 3 albums, played by both guitarist/keyboardist Francis Monkman and violinist Darryl Way. The 1972–74 lineup of progressive rock pioneers King Crimson used a pair of Pianets in live performance, played both by the group's violinist David Cross, and the guitarist, Robert Fripp. Genesis keyboardist Tony Banks used the Pianet prominently in the group's early career, as a lead instrument through a homemade fuzz box."]}, {"page": "Radio Silence (Boris Grebenshchikov album)", "response": ["*Darryl Way – violin"]}, {"page": "Time Is the Key", "response": ["*Darryl Way – violin (1)"]}, {"page": "Expresso II", "response": ["*Darryl Way – violin (3, 5)"]}, {"page": "Broken English (album)", "response": ["* Darryl Way – violin"]}, {"page": "Sonja Kristina", "response": ["In 2008, Curved Air was reformed with other original members including Darryl Way and Florian Pilkington-Miksa and, later, Kirby Gregory from the Air Cut line up. The band continues to record and perform internationally.Prog, April 2014, p. 58 Over and Above by Sid Smith"]}, {"page": "Dartington College of Arts", "response": ["* Darryl Way (Musician)"]}, {"page": "If (band)", "response": ["The above line-up is possibly the band's best known, but the band was subject to other personnel changes.Logan, Nick &Woffinden, Bob (eds.) The New Musical Express Book of Rock, W.H. Allen & Co. Ltd (Star), 1973, p. 257. . With If coming off the road when Dick Morrissey was admitted to hospital, J. W. Hodkinson joined Darryl Way's Wolf, Terry Smith and Dave Quincy went off to form ZZebra, John Mealing joined Klaus Doldinger's Passport before going on to Strawbs, Jim Richardson went on to do studio session work, and Dennis Elliott joined the hugely successful group Foreigner."]}, {"page": "John Etheridge", "response": ["In late 1972, Etheridge joined Curved Air violinist Darryl Way's band Wolf, which went on to record three albums in the progressive rock canon for the Deram label: Canis Lupus (1973), Saturation Point (1973), and Night Music (1974). It also provided an outlet for his first compositions, at a rate of one or two tracks per album.", "With Darryl Way's Wolf"]}, {"page": "Island Records discography", "response": ["*ILPS 9550 - Darryl Way: Concerto For Electric Violin, 1978"]}, {"page": "Phantasmagoria (Curved Air album)", "response": ["#\"Marie Antoinette\" (Darryl Way, Sonja Kristina Linwood) – 6:20", "* Darryl Way – violin, keyboards (1, 3), tubular bells (1), melon (1)"]}, {"page": "Air Conditioning (album)", "response": ["Both music and lyrics for \"Situations\" were written jointly by Darryl Way and Rob Martin. Martin recalled that their collaboration on the song was so tight that often each melody was produced alternately by first one composer, then the other.", "# \"Stretch\" (Darryl Way, Monkman) – 4:05", "* Darryl Way – electric violin and vocals"]}, {"page": "Second Album (Curved Air album)", "response": ["The content and arrangement of the material reflected a sharp division in the band which would lead to their break-up the following year; all the songs on side A were composed by Darryl Way (with some assistance from Ian Eyre) with lyrics by Sonja Kristina, while all those on side B were composed by Francis Monkman.Joynson, Vernon (1995). The Tapestry of Delights . London: Borderline Books. Francis Monkman explained: \"Basically Darryl and I respect each others' work, but we don't really see eye-to-eye on most things. And we never really got the co-writing thing together. I wanted to get my first 'epic' together, so it looks like a split forming (at the time of the \"Second Album\").\"Wynne, Richard. (1999) \"Francis Monkman\" . The Official Curved Air Website.", "# \"Young Mother\" (Darryl Way, Sonja Kristina Linwood) – 5:55", "*Darryl Way – violin, backing vocals, piano (5)"]}, {"page": "The Best of Jethro Tull – The Anniversary Collection", "response": ["* Darryl Way - violin (disc 2, track 6)"]}, {"page": "Curved Air – Live", "response": ["* Darryl Way – violin, keyboards, backing vocals "]}, {"page": "Trace (band)", "response": ["* Darryl Way - violins"]}, {"page": "List of electric violinists", "response": ["* Darryl Way"]}, {"page": "Midnight Wire", "response": ["Midnight Wire is the fifth studio album by Curved Air and was recorded in 1975. It marked another line-up change in the band, with Darryl Way and Sonja Kristina recruiting new musicians after the end of the reunion tour marked by the Curved Air - Live album. Kristina's friend Norma Tager, who had helped design the costumes she wore on stage from Curved Air's reunion in 1974 to their breakup in 1976, contributed all the lyrics to the songs.", "#\"Day Breaks My Heart\" (Darryl Way, Tager) – 4:38", "* Darryl Way – violin"]}, {"page": "Airborne (Curved Air album)", "response": ["Airborne is the sixth studio album by Curved Air and was recorded in 1976. Like their last few releases, it was not a significant commercial success. After a follow-up non-album single, \"Baby Please Don't Go\" b/w \"Broken Lady\", the group disbanded. Drummer Stewart Copeland went on to form The Police, while violinist Darryl Way and lead singer Sonja Kristina both pursued solo careers. Bassist Tony Reeves and guitarist Mick Jacques both later became members of the semiprofessional band Big Chief.", "* Darryl Way – violin, keyboards"]}, {"page": "I.R.S. No Speak", "response": ["| 013 || Darryl Way || Under The Soft || 1991 || violinist for Curved Air, Darryl Way's Wolf "]}, {"page": "List of bands that played at Dagenham Roundhouse", "response": ["| Darryl Ways Wolf"]}, {"page": "Live at the BBC (Curved Air album)", "response": ["#\"Vivaldi\" (Darryl Way) – 6:25", "* Darryl Way – violin, vocals "]}, {"page": "Alive, 1990", "response": ["Alive, 1990 is a recording from the Curved Air reunion concert 23 September 1990. The lineup reunited Sonja Kristina, Francis Monkman, Florian Pilkington-Miksa and Darryl Way, sixteen years after the last time all four of them played together.", "# \"Twenty Years on (Intro)\" (Francis Monkman, Darryl Way) – 4:11", "* Darryl Way – electric violin, keyboards; backing vocal on \"Backstreet Luv\""]}, {"page": "List of Royal College of Music people", "response": ["*Darryl Way (born 1948), rock and classical musician"]}, {"page": "Spirits Burning", "response": ["* Darryl Way: Curved Air"]}]}}