{"wiki_id": "http://www.wikidata.org/entity/Q25190108", "itemLabel": "Justin Pearson", "itemDescription": "British stunt man and stunt coordinator", "wikipedia_url": "https://en.wikipedia.org/wiki/Justin_Pearson_(stuntman)", "wikipedia_page": {"main": "Justin Pearson (born 1971) is a British stunt man and stunt coordinator who is best known for his stunt work in Harry Potter and the Deathly Hallows – Part 2 (2011) and Skyfall (2012), for which he received Screen Actors Guild Awards in 2012 and 2013 respectively, as part of a stunt ensemble.In addition to Justin's role within the film and television stunt industry, he runs a jousting display team,The Knights of the Damned Jousting Stunt Team.", "link_mentions": [{"page": "Justin Pearson", "response": ["Justin Pearson (born August 20, 1975) is a vocalist and bassist known for  his music career, playing in a number of San Diego-based noise rock, punk and grindcore bands, as well as his record label Three One G Records. Starting off in the punk outfit Struggle in 1994, ensuing projects such as Swing Kids, The Locust, Dead Cross and Retox. He has collaborated with Kool Keith, Gabe Serbian, Karen O, Nick Zinner, Adam Gnade, Invisibl Skratch Piklz, Asia Argento, The Bloody Beetroots, Silent, among many others.", "Justin Pearson was born on August 20, 1975 and initially raised in Phoenix, Arizona by his parents. He was an only child and went by the nickname J.P. Pearson has stated he liked music and the aesthetics of rock music since he was little. Around ten his mother's cousin let him borrow a guitar, and he eventually moved onto bass. He also began skateboarding and listening to the Thrasher skate/rock compilation tapes with bands like Septic Death, the Sex Pistols, The Misfits, and Suicidal Tendencies. He has stated he was especially drawn towards the music that touched on social politics. Pearson also got into break dancing and early rap like Run DMC and the Beastie Boys, as well as developing an interest in metal. In Phoenix he lived a couple blocks away from some of the members of Slayer.", "The Locust was formed in 1994 by Bobby Bray, Justin Pearson, Dylan Scharf, Dave Warshaw, and Dave Astor. After a number of personnel changes, they arrived at the current four-piece lineup in 2001, consisting of Bray, Pearson, Joey Karam and Gabe Serbian. The Locust was initially a powerviolence project whose first release was a split with genre pioneers Man Is the Bastard. Later releases incorporated synthesizers and became increasingly theatrical. The band regularly played shows in all-ages punk clubs in Los Angeles and San Diego, usually donning insect costumes.", "After being impressed by the band's demos Deathwish Inc offered to put out the band’s first 7-inch, The Rains after some remixing and remastering. After the release the band wanted to play live shows, however the band did not yet have a bass player. The band's original idea was to get a different bass player for each show, however the band got in touch with bassist Justin Pearson and after a two shows the band asked Pearson to join. In the months that followed, Some Girls added a second guitar player Christopher Sprague and recorded another EP, The Blues. The band's EPs would later be collected on the band's 2003 compilation album All My Friends Are Going Death.", "Retox formed in 2011, originally out of founding members Justin Pearson's and Gabe Serbian's disappointment that their previous band Head Wound City was too short-lived and wanted to rehash that sound, though this sound evolved over time and with the addition of Thor Dickey and Michael Crain. The band released a self-titled EP and their debut album Ugly Animals that year through Ipecac Recordings, a California-based record label co-founded by Mike Patton and Greg Werckman. Ugly Animals was self-funded by the band members and recorded on analog tape to capture the aesthetic of the band that couldn't be captured digitally, a decision made by engineer Manny Nieto.", "Justin Pearson is a vegetarian and, although not an activist, has participated in campaigns for PETA on behalf of animal rights. He only uses secondhand leather and for the most part eats non-genetically modified, organic food. Pearson became a vegetarian in his early teens for ethical reasons, inspired by aspects of the punk community, especially the group Downcast and reading No Answers fanzine."]}]}}