{"wiki_id": "http://www.wikidata.org/entity/Q25189285", "itemLabel": "Stephen Garrett", "itemDescription": "British film and television producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Garrett_(producer)", "wikipedia_page": {"main": "Stephen Garrett (born 16 April 1957) is a British film and television producer. He is best known for founding the Kudos production company, and executive producing the BBC spy drama Spooks. As a film producer and executive producer, his credits include Eastern Promises (2007), Miss Pettigrew Lives for a Day (2008), Salmon Fishing in the Yemen (2011) and The Night Manager (2016). In 2016, he launched a new production company, Character Seven.", "link_mentions": [{"page": "Primetime Emmy Award for Outstanding Limited or Anthology Series", "response": ["| Stephen Garrett, Simon Cornwell, Stephen Cornwell, Susanne Bier, David Farr, John le Carré, Tom Hiddleston, Hugh Laurie, Alexei Boltho and William D. Johnson, executive producers; Rob Bullock, producer"]}, {"page": "The Night Manager (TV series)", "response": ["|Simon Cornwell, Stephen Garrett, Stephen Cornwell, Hugh Laurie, Tom Hiddleston, Susanne Bier, David Farr, John le Carré, William D. Johnson, Alexei Boltho, Rob Bullock"]}, {"page": "Stephen Garrett (Film and TV producer)", "response": ["#REDIRECT Stephen Garrett (producer)"]}, {"page": "Stephen Garrett (film and TV producer)", "response": ["#REDIRECT Stephen Garrett (producer)"]}, {"page": "28th Producers Guild of America Awards", "response": ["** The Night Manager (AMC) – Simon Cornwell, Stephen Garrett, Stephen Cornwell, Hugh Laurie, Tom Hiddleston, Susanne Bier, David Farr, John le Carré, William D. Johnson, Alexei Boltho, Rob Bullock"]}, {"page": "The Undoing", "response": ["| Susanne Bier, David E. Kelley, Per Saari, Nicole Kidman, Bruna Papandrea, Stephen Garrett, Celia D. Costas and Deb Dyer"]}, {"page": "32nd Producers Guild of America Awards", "response": ["** The Undoing (HBO) – Susanne Bier, David E. Kelley, Per Saari, Nicole Kidman, Bruna Papandrea, Stephen Garrett, Celia D. Costas, and Deb Dyer"]}]}}