{"wiki_id": "http://www.wikidata.org/entity/Q2513293", "itemLabel": "Esther Rantzen", "itemDescription": "English television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Esther_Rantzen", "wikipedia_page": {"main": "Dame Esther Louise Rantzen  (born 22 June 1940) is an English journalist and television presenter, who presented the BBC television series That's Life! for 21 years, from 1973 until 1994. She works with various charitable causes, and  founded the charities ChildLine, promoting child protection, which she set up in 1986, and The Silver Line, designed to combat loneliness in older people's lives, which she set up in November 2012.\nRantzen has been recognised for her contribution to television and society. She was awarded an OBE for services to broadcasting in 1991, a CBE for services to children in 2006, and in the 2015 New Year Honours, was made a Dame for services to children and older people through ChildLine and The Silver Line. She is Patron for the charity Operation Encompass and a Trustee for the charity Silver Stories both charities created and run by husband and wife David Carney-Haworth OBE and Elisabeth Carney-Haworth OBE.", "link_mentions": [{"page": "Gary Lineker", "response": ["Lineker was the highest-paid BBC employee, receiving payments of £1.75–1.76 million in the years 2016–17, 2017–18, 2018–19, and 2019–20, according to the BBC's list of top salaries. His pay has been criticised by Julian Knight, chair of the parliamentary Digital, Culture, Media and Sport Committee, and Dame Esther Rantzen. The BBC's Director General, Tim Davie, stated that Lineker's pay was justified \"because of the value of analysis to the viewing audience\"."]}, {"page": "June 22", "response": ["*  1940   – Esther Rantzen, English journalist"]}, {"page": "Viz (comics)", "response": ["Occasionally, celebrities are granted the 'honour' of strips all to themselves. Billy Connolly has had more than one about him trying to ingratiate himself with the Queen and Bob Hope had a strip featuring the comedian trying to think up amusing last words to utter on his deathbed (but ended up with a torrent of swearing). The singer Elton John has also appeared frequently in recent issues as a double-dealing Del Boy-type character attempting to pull off small-time criminal scams such as tobacco smuggling, benefit fraud and cheating on fruit machines. Most recently, he was seen posing as a window cleaner and conning customers to pay him, before being mistaken for a Peeping Tom and given a thorough hiding. The strips always end with Elton being beaten at his own game by one or more of his musical contemporaries from the 1970s and 1980s. Other celebs to have been featured in their own strips include Jonathan Ross, Russell Brand, Esther Rantzen, Stephen Fry, Noel Edmonds, Jimmy Savile (as the headmaster of \"Pop School\", as \"Sir Jimmy Savile, the Owl\" and in \"Jimmy Savile's Haunted Head\"), Johnny Vaughan, Adam Ant, Jimmy Hill, Noddy Holder, Boy George, Freddie Garrity, Steve McFadden, Morrissey (constantly finding daffodils stuck into the seat of his trousers, parodying his appearances on Top of the Pops), Busted, Eminem, Big Daddy, Danny Baker and plenty more."]}, {"page": "1940", "response": ["** Dame Esther Rantzen, British broadcaster"]}, {"page": "The Archers", "response": ["* Dame Judi Dench made an appearance as the (hitherto usually silent) Pru Forrest in 1989 for the 10,000th episode. Terry Wogan was featured and Esther Rantzen was responsible for the sound effects."]}, {"page": "Somerville College, Oxford", "response": ["Somervillians include Prime Ministers Margaret Thatcher and Indira Gandhi, Nobel Prize winning scientist Dorothy Hodgkin, television personalities Esther Rantzen and Susie Dent, reformer Cornelia Sorabji, writers Marjorie Boulton, A. S. Byatt, Vera Brittain, Susan Cooper, Penelope Fitzgerald, Winifred Holtby, Nicole Krauss, Iris Murdoch and Dorothy L. Sayers, politicians Shirley Williams, Margaret Jay and Sam Gyimah, Princess Bamba Sutherland and her sister, biologist Marian Dawkins, philosophers G. E. M. Anscombe, Patricia Churchland, Philippa Foot and Mary Midgley, psychologist Anne Treisman, archaeologist Kathleen Kenyon, actress Moon Moon Sen, soprano Emma Kirkby, banker Baroness Vadera and numerous (women's rights) activists."]}, {"page": "Fulham", "response": ["Esther Rantzen, presenter of long-running BBC One TV magazine, That's Life! frequently used North End market to gauge public opinion (vox pop)."]}, {"page": "British Academy Film Awards", "response": ["| Esther RantzenRoger Moore"]}, {"page": "Miss World", "response": ["| Sacha Distel, Esther Rantzen, Germaine Greer and Ray Moore"]}, {"page": "Uri Geller", "response": ["Geller has lived in Tel Aviv in Israel since 2015. He previously lived in the village of Sonning-on-Thames, Berkshire, in England. He is trilingual, speaking fluent Hebrew, Hungarian and English. In an appearance on Esther Rantzen's 1996 television talk show Esther, Geller declared that he had suffered from anorexia nervosa and bulimia for several years. He has written 16 fiction and non-fiction books."]}, {"page": "Fanny Cradock", "response": ["The public were incensed at her eye-rolling rudeness and condescension, and felt that Fanny Cradock had ruined Troake's special day. The Daily Telegraph wrote \"Not since 1940 can the people of England have risen in such unified wrath....\". Fanny wrote a letter of apology to Troake, but the BBC terminated her contract two weeks after the broadcast of the programme. She would never again present a cookery programme for the BBC. (Troake, by contrast, published A Country Cookbook of recipes the following year; it included the coffee cream dessert Cradock had vetoed.)London, McDonald and Jane's  Speaking about the incident on Room 101 in 1999, The Big Time producer Esther Rantzen described Cradock as \"hell on wheels\", and that she had \"reduced this poor little lady [Troake] to nothing\"."]}, {"page": "Spitting Image", "response": ["Writer and MP Jeffrey Archer appeared as an annoying, self-commenting writer whose books were not read by anyone. Kenneth Williams was depicted with a large nose and big teeth, and Harry Secombe was depicted as overly religious. Alan Bennett was shown at home as watching Spitting Image on TV. Esther Rantzen always had a permanent grin and was frequently carrying an onion (reflecting a concurrent running joke in Private Eye suggesting insincere theatrical tears), whilst Cilla Black had large teeth and a thick Scouse accent."]}, {"page": "Terry Wogan", "response": ["In 1980, the BBC's charity appeal for children was first broadcast as a telethon called Children in Need, with Wogan presenting alongside Sue Lawley and Esther Rantzen. He campaigned extensively for the charity, and often involved himself via auctions on his radio show, or more directly by taking part in well-publicised sponsored activities.", "On 21 September 2013, Wogan appeared as a panellist on ITV game show Through the Keyhole. In November 2013, he participated in a celebrity edition of the BBC One game show Pointless, with celebrities including Bobby Ball and Esther Rantzen, in aid of Children in Need."]}, {"page": "United Kingdom in the Eurovision Song Contest 2003", "response": ["* Southern EnglandEsther Rantzen"]}, {"page": "Shaun Woodward", "response": ["*Death by Television by Esther Rantzen, Shaun Woodward (Century, 1999) ", "*Ben: Story of Ben Hardwick by Esther Rantzen, Shaun Woodward (Penguin Character Books, 1985) "]}, {"page": "Margaret Moran", "response": ["On 18 May 2009, television presenter Esther Rantzen announced that she would stand against Moran in Luton South as an \"anti-sleaze\" candidate. Rantzen launched her campaign in July 2009, however she lost her deposit in the 2010 general election. On 28 May 2009, Moran announced that she would not stand at the forthcoming general election, citing the \"bruising effect upon my friends, my family and my health.\" Moran also said \"The House of Commons fees office gave me incorrect advice upon which I acted. They have now apologised.\" Subsequently, she was barred from standing in the next general election by a disciplinary panel of the Labour Party."]}, {"page": "Lynsey de Paul", "response": ["After a four-year period in California in the late 1970s and early 1980s with her partner at the time, actor James Coburn, whom she met at a party thrown by Joan CollinsPaul Donnelley, Fade to Black: A Book of Movie Obituaries, Music Sales Group, 2003, page 161 de Paul returned to England. Although she only released one self-composed solo single, \"Strange Changes\", in the 1980s, it made the UK disco chart, published in the music magazine Record Mirror, and prime time TV appearances in the UK and Germany. She co-wrote with Terry Britten \"A Little TLC\", which was covered by Sam Hui as \"心思思\" with Cantonese lyrics and it was awarded an RTHK Top 10 Gold Songs Award in Hong Kong in 1986. Other versions of this song were recorded by Latino boy band Menudo, with lead vocals by Ricky Martin as a track on their 1988 album Sons of Rock; as well as Japan based Filipina soul singer Marlene as a track on her album Looking for Love; and also featured in the US children's television programme, Kidd Video. De Paul later released her own version of the song on her website music store. Her song \"Brandy\", which had been the B-side of the single \"Getting a Drag\" was released by Japanese singer Miki Asakura on her 1981 album \"Sexy Elegance\" with new lyrics and the title \"Friday Night\". Whilst continuing to write songs for artists as diverse as Shirley Bassey (\"There's No Place Like London\"), funk/soul band Heatwave, Marti Webb (both recording the song \"All I Am\") and the Real Thing (\"We Got Love\"), de Paul also branched out into record production, acting in musicals and plays, interviewing and TV presentation and drawing cartoons. She also continued to compose TV themes, including for the BBC's 1981 comedy series The Olympian Way  and in 1988 the long-running Esther Rantzen programme Hearts of Gold.", "In 2015, PRS for Music established an annual Lynsey de Paul prize for emerging female singer-songwriters in honour of the singer-songwriter. The 2015 winner of the prize was Emma McGrath, who was presented with the award at an event celebrating the life of Lynsey de Paul, hosted by Esther Rantzen. McGrath later said in an interview with Women's Music News \"...I was 15 and I won the Lynsey de Paul Prize. I think that award is significant because she was creating a career at a time when it probably wasn’t as easy as it is now to be a female in the music industry.\" The second Lynsey de Paul prize was presented to Elsa Hewitt in September 2016. Jemio was awarded the prize in 2017. The PRS Foundation announced the 2018 winners of the Lynsey de Paul Prize on 27 September 2018, with soul singer-songwriter Amahla receiving the top bursary and five other (Bianca Gerald, Dani Sylvia, Fiona Lee, Rebekah Fitch and Harpy) being runners up. Amahla went on to receive a \"Rising Star Award\" from Apple Music, as announced by PRS.", "Close friend Esther Rantzen was quoted as saying \"Lynsey was a close friend and neighbour and we saw a lot of each other. She was beautiful and ageless; she looked 35 and was so gifted. She was a writer and composer but she was also very clever with words, very witty. Obviously she sang and played the piano, but she was also an artist, she painted as well. In fact, she could do everything. I called her Renaissance woman. She really was quite outstanding\".", "De Paul suffered a brain haemorrhage on the morning of 1 October 2014 at her home in Mill Hill and was later pronounced dead at Barnet General Hospital. Her niece, Olivia Rubin, told The Times that her death was \"completely unexpected\", adding: \"She was a vegetarian, she didn't smoke, she didn't drink – she was amazing, in fact.\" Broadcaster and friend Esther Rantzen, for whose television series Hearts of Gold de Paul had written the theme, said: \"She was a renaissance woman. She could do everything: she could sing, she could compose, she was an immensely talented artist. She became a huge star but she was also a loyal and generous friend. It’s an absolutely tragic loss.\"  She was interred with a Humanist funeral at Hendon Cemetery. De Paul is listed on the official Grammy website under \"remembering the music people we lost in 2014–15\"."]}, {"page": "List of show business families", "response": ["* Documentary maker and producer Desmond Wilcox was married to journalist turned presenter Esther Rantzen. Their daughter Rebecca is a producer and television presenter."]}, {"page": "Sheena Easton", "response": ["In 1979, she married Sandi Easton, the first of her four husbands. They divorced after eight months, and Sheena decided to keep the surname Easton. That year, one of her tutors coaxed her into auditioning for Esther Rantzen, producer of the BBC programme The Big Time. Rantzen was planning a documentary film to chronicle a relative unknown's rise to pop-music stardom. Easton was selected as the subject for the programme; EMI executives awarded her a contract, and Christopher Neil was assigned as her recording producer. Deke Arlon became her first manager, and Easton spent much of 1980 being followed by camera crews, who filmed her throughout the process of her audition through to making her first EMI single, \"Modern Girl\". In the course of the filming, she met and sang for Dorothy Squires, Dusty Springfield and Lulu, whose manager Marion Massey told her that she saw Easton as a potential TV star with her own series, but not as a pop singer for the 1980s as she lacked \"rugged individuality\"."]}, {"page": "Childline", "response": ["In 1986 Esther Rantzen, presenter of That's Life!, a popular consumer TV show, suggested to the BBC that they create \"Childwatch\", a programme about child abuse that was screened on 30 October 1986 on BBC1, the aim being to try to detect children at risk before their lives were in danger. Viewers were asked if they would take part in the survey in an edition of That's Life!. A helpline was opened after the programme so that any child currently suffering abuse could call for help. Rantzen, together with her BBC producers Sarah Caplin and Ritchie Cogan, therefore suggested they should create a helpline specifically for children in danger or distress, to be open throughout the year, 24/7, and launch it on the programme. The project was made possible by a benefactor Ian Skipper who underwrote the charity for the first three years."]}, {"page": "Bernard Manning", "response": ["Manning's detractors criticised his style of humour, with television presenter Esther Rantzen commenting that \"for me, he's always been the villain of comedy\". Manning's family and friends said that his controversial ways were all an act. He lived next door to an Indian physician's family, who have appeared in many newspaper articles over the years to defend Manning as a \"perfect gentleman\". Satya Rudravajhala, the poet widow of Visveswara Rao Rudravajhala, wrote a eulogy that was published in the local paper, the Middleton Guardian, conveying the family's sentiments."]}, {"page": "Ron Atkinson", "response": ["In 2006, Atkinson took part in the BBC Two programme Excuse My French. Atkinson, comedian Marcus Brigstocke and television presenter Esther Rantzen were immersed in the French language by staying in a remote town in the Provence region, being compelled to adapt to the French lifestyle and speak the language. His assignment at the end of the course was to provide a match analysis on a football match (Paris Saint-Germain – AS Monaco) in French for a French radio station. Being a complete beginner to the French language, he found the experience a considerable challenge, although he succeeded. The assignment was made more difficult by the fact that the match was a dull goalless draw, leaving him with little to talk about."]}, {"page": "That's Life!", "response": ["That's Life! was a magazine-style television series on BBC1 between 26 May 1973 and 19 June 1994, presented by Esther Rantzen throughout the entire run, with various changes of co-presenters. The show presented hard-hitting investigations alongside satire and occasional light entertainment. It was generally recorded about an hour prior to transmission, which was originally on Saturday nights and then on Sunday nights. In its latter days, in an attempt to win back falling ratings, it was moved back to Saturday nights.", "Among the co-presenters was songwriter and lyricist Richard Stilgoe; for the show he wrote comic songs satirising various domestic issues, such as a song to celebrate the date 25 years into the future when he would have at last paid off the mortgage to his house. The co-hosts of the show were always men, though several women were featured as the 'humour' contributors, including actresses Joanna Monro and Mollie Sugden. In later shows the co-hosts would dramatise cases by each reading the dialogue of a character. In 1972 Cyril Fletcher enjoyed something of a renaissance in his long comedy career when Esther Rantzen asked him to join and recite some of his 'Odd Odes'. He proved such a success with the audience that he became a fixture of the show for eight years.", "After successfully launching 19 year old Sheena Easton on to the pop charts via her early 1980s TV show The Big Time, Esther Rantzen decided to get involved in launching another pop star's career with a talent competition on That's Life!. The 1992 Search for a Star competition had entries from over 2,000 auditionees, with nine finalists chosen to perform a medley of Beatles songs on the episode broadcast on 22 March 1992.Radio Times Issue 3560,", "==Esther Rantzen’s House Trap==", "In October 2018, it was announced that a similar version of the show would air on Channel 5, with Rantzen presenting alongside Eamonn Holmes and Ruth Langsford. However, rather than being a mix of light hearted features, comedy and consumer advice, the resulting programme (Esther Rantzen’s House Trap) was a production more in keeping with the format of the BBC's long-running Watchdog programme, with hidden cameras trying to trap rogue traders in the homes of a number of undercover actors. Unlike Watchdog, these actors were all people of an advanced age with each episode focusing on a different trade, such as locksmiths, where older people were likely to being preyed upon. Rantzen would be the only one of the names previously announced that would feature in the show, as Holmes and Langsford would continue with their own Channel 5 series instead.", "Esther Rantzen’s House Trap was a 4-part series produced by Karen Plumb and Grant Mansfield at Plimsoll Productions for Channel 5, who commissioned the show alongside other consumer-focused shows such as Shop Smart Save Money and Do the Right Thing."]}, {"page": "TV-am", "response": ["TV-am was spearheaded by the 'Famous Five' who were not only lined up as presenters on the station, but were also shareholders: Michael Parkinson, David Frost (1983–92), Angela Rippon (1983), Anna Ford (1983) and Robert Kee. Esther Rantzen had originally been one of the station's 'star' line up of presenter/shareholders, but pulled out in 1981 after the birth of her third child; she and the company agreed that the early-morning starts would present a problem in her raising her child. She had also been persuaded by the BBC to continue producing and presenting That's Life! and conceded she did not want to give up the show, or worse, see it continue with another anchor.Esther: The Autobiography. Rantzen, Esther. 2001 BBC Books. "]}, {"page": "Password (American game show)", "response": ["| Esther Rantzen"]}, {"page": "Marcus Brigstocke", "response": ["Brigstocke's television work has included Have I Got News for You and Live at the Apollo. He took part in the BBC Two programme Excuse My French (2006) with Ron Atkinson and Esther Rantzen. They were immersed in the French language by staying in a French town in Provence. Brigstocke's ultimate assignment was to perform a live stand-up comedy act in French to a French audience."]}, {"page": "Celebrity chef", "response": ["The earliest television celebrity chef in the UK was Fanny Cradock. She appeared on British television for over two decades, from the 1950s through the 1970s. She originally became popular following the publication of her first cookbook in 1949, The Practical Cook, and after gaining a cult following with cookery demonstrations in theatres around the country. Her television career came to an end when she appeared as a judge on reality television show The Big Time in 1976. She appeared to pretend to retch as contestant Gwen Troake described her menu for former Prime Minister Edward Heath. Presenter Esther Rantzen later described the incident as like \"Cruella de Vil meets Bambi\"."]}, {"page": "Richard Stilgoe", "response": ["In 1966 Stilgoe played Benjamin in the West End musical, Jorrocks. He made his name on the BBC television teatime programme, Nationwide, followed by Esther Rantzen's That's Life!, a light-hearted consumer affairs programme for which he wrote comic songs satirising minor domestic misfortunes, often to the tune of \"Oh! Mr Porter\". One notable song concerned officials who have \"Statutory Right of Entry to your Home\", with Stilgoe playing and singing, in barber-shop style, all parts himself using trick photography. His ability to write a song from almost any source material and at speed is part of his cabaret act, which includes singing the instructions from a Swedish payphone; a pastiche of the King's Singers listing the kings and queens of England in which he sings all four parts; and composing a song in the interval from words and musical notes called out by the audience. He has also written and presented BBC radio programmes, including Hamburger Weekend, Used Notes, Stilgoe's Around, Maestro and Richard Stilgoe's Traffic Jam Show on BBC Radio 4."]}, {"page": "Jobsworth", "response": ["The term became widespread in vernacular English through its use in the popular 1970s BBC television programme That's Life! which featured Esther Rantzen covering various human interest and consumer topics. A \"Jobsworth of the Week\" commissionaire's hat was awarded each week to \"a startling tale of going by the book\".BBC News: \"Your job's worth more than you are\".", "The term remains in use, particularly in the UK, to characterise inflexible employees, petty rule-following and excessive administration, and is generally used in a pejorative context.House of Commons Hansard Debates for 1 May 1996 (pt 10) \"There seems to be here an element of what might qualify for Esther Rantzen's \"jobsworth\" award. I would certainly like to look at it more closely. I will therefore follow up the matters that my hon. Friend has raised today, and I hope to be able to write to him in due course.\""]}, {"page": "Patsy Kensit", "response": ["*The Chase: Celebrity Special (27 September 2014) – Contestant with Natalie Anderson, Esther Rantzen, and Brian McFadden; won\"The Chase: Celebrity Special\". Itv.com"]}, {"page": "Fivepenny Piece", "response": ["For a while in the 1970s the group had a weekly interlude spot on the BBC programme That's Life! with Esther Rantzen."]}, {"page": "Joanna Monro", "response": ["Joanna Monro (born 1956) is a British actress and former television presenter who, in the 1980s, appeared on the BBC show That's Life! with Esther Rantzen."]}, {"page": "Strictly Come Dancing", "response": ["| Esther Rantzen", "|Esther Rantzen"]}, {"page": "Burma Campaign UK", "response": ["Burma Campaign UK supporters include Damien Rice, Annie Lennox, Maxi Jazz, Emma Thompson, Anna Friel, Tony Robinson, Maureen Lipman, Jay Kay, Joanna Lumley, Esther Rantzen, Kabir Bedi, Sir Ian McKellen and Gillian Anderson."]}, {"page": "Children in Need", "response": ["In 1980, the first Children in Need telethon was broadcast. It was a series of short segments linking the evening's programming instead of the usual continuity. It was devoted to raising money exclusively destined for charities working with children in the United Kingdom. The new format, presented by Terry Wogan, Sue Lawley and Esther Rantzen, saw a dramatic increase in public donations: £1 million was raised that year.", "*Esther Rantzen (1980–1982)", "| Sue LawleyEsther Rantzen", "| Esther Rantzen"]}, {"page": "Tim Vine", "response": ["|Pointless Celebrities || Contestant || 1 Dec 2012 - Karen Taylor, 3 Sep 2016 - Terry Alderton, 3 Mar 2019 - Esther Rantzen, 30 Oct 2021 - Nina Conti."]}, {"page": "Samantha Womack", "response": ["In January 2005 she narrated Jordan & Peter: Laid Bare for ITV2. She later directed an anti-bullying music video for Liverpool band Just 3, entitled Stand Tall. The video starred her and Liverpool F.C. footballer Jamie Carragher. The video was heavily backed by Childline ambassador Esther Rantzen."]}, {"page": "Barney Barnato", "response": ["Barnato died in 1897 in mysterious circumstances; records state that he was lost overboard near the island of Madeira, whilst on a passage home to England.Who do you think you are? — Esther Rantzen on BBC.co.uk. Accessed 3 September 2008. Although some have wondered if this was suicide and suggested that the Jameson Raid had had a major impact on him and left him severely depressed, his family vigorously rejected that theory, saying that it was totally out of character for a man who had been a pioneer in the rough-and-ready days of emerging Southern Africa. His body was recovered from the sea and he was buried at Willesden Jewish Cemetery in London.", "His will divided up his considerable fortune between his family, amongst which was his sister Sarah and her husband Abraham Rantzen, great-grandparents of TV presenter Esther Rantzen. Another beneficiary was his son, Woolf Barnato, who used part of the multimillion-pound fortune he inherited at the age of two, to become a pioneer racing driver in the 1920s, one of the so-called Bentley Boys."]}, {"page": "Tubridy Tonight", "response": ["| 3 November 2007 || Sophie Dahl, Esther Rantzen, Sean Kelly || || Sinéad O'Connor || \"Dark I Am Yet Lovely\" || Details "]}, {"page": "Pate's Grammar School", "response": ["* Desmond Wilcox, TV reporter, husband of Esther Rantzen"]}, {"page": "Grumpy Old Women", "response": ["| Esther Rantzen || || || ||"]}, {"page": "Freddie Starr", "response": ["The man behind the hamster story was the British publicist, Max Clifford, at that time Starr's agent, who concocted the story as a practical joke. When asked in a television interview with Esther Rantzen some years later whether Starr really had eaten a hamster, his reply was \"Of course not\". Clifford was unapologetic, insisting that the story had given a huge boost to Starr's career. "]}, {"page": "Doc Cox", "response": ["In October 2008, Cox was part of a That’s Life! reunion broadcast on BBC London 94.9. Cox said of the impending reunion: \"It'll be lovely to chat to Esther again. Somebody once asked me who my greatest influences were, and I had to reply 'Buddy Holly, George Formby, my dad, Martin Luther King and Esther Rantzen'.\""]}, {"page": "Wogan", "response": ["Over the course of the show's run, when Wogan himself was unavailable to host the show, guest presenters were brought in, with Selina Scott being the first stand-in in 1985. Others included David Frost (in 1986), Kenneth Williams (in 1986), Ben Elton (in 1989), Joanna Lumley (in 1989), Selina Scott (again in 1991), Jonathan Ross (in 1990), Gloria Hunniford (in 1991), Felicity Kendal, Esther Rantzen and Bruce Forsyth. The most successful stand in was Sue Lawley (in 1988) who became the most frequent replacement for the host and indeed for some time was Wogan's 'official' stand in.  When Lawley gained her own late night chat show Saturday Matters with Sue Lawley on BBC1 in 1989, other celebrities again took it in turns to stand in for Wogan."]}]}}