{"wiki_id": "http://www.wikidata.org/entity/Q2527461", "itemLabel": "Violet Bonham Carter", "itemDescription": "politician (1887-1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Violet_Bonham_Carter", "wikipedia_page": {"main": "Helen Violet Bonham Carter, Baroness Asquith of Yarnbury,  (15 April 1887 – 19 February 1969), known until her marriage as Violet Asquith, was a British politician and diarist. She was the daughter of H. H. Asquith, Prime Minister from 1908 to 1916, and she was known as Lady Violet, as a courtesy title, from her father's elevation to the peerage as Earl of Oxford and Asquith in 1925. Later she became active in Liberal politics herself, and was a leading opponent of appeasement. She stood for Parliament and became a life peer.\nShe was also involved in arts and literature. Her diaries cover her father's premiership before and during the First World War and continue until the 1960s. She was Sir Winston Churchill's closest female friend, apart from his wife, and her grandchildren include the actress Helena Bonham Carter.", "link_mentions": [{"page": "Roy Jenkins", "response": ["Between 1951 and 1956 he wrote a weekly column for the Indian newspaper The Current. Here he advocated progressive reforms such as equal pay, the decriminalisation of homosexuality, the liberalisation of the obscenity laws and the abolition of capital punishment.Campbell, Roy Jenkins: A Well-Rounded Life, p. 153, p. 182. Mr Balfour's Poodle, a short account of the House of Lords crisis of 1911 that culminated in the Parliament Act 1911, was published in 1954. Favourable reviewers included A. J. P. Taylor, Harold Nicolson, Leonard Woolf and Violet Bonham Carter.Campbell, Roy Jenkins: A Well-Rounded Life, p. 148. After a suggestion by Mark Bonham Carter, Jenkins then wrote a biography of the Victorian radical, Sir Charles Dilke, which was published in October 1958.Campbell, Roy Jenkins: A Well-Rounded Life, p. 149, p. 151.", "Since 1959 Jenkins had been working on a biography of the Liberal Prime Minister, H. H. Asquith. For Jenkins, Asquith ranked with Attlee as the embodiment of the moderate, liberal intelligence in politics that he most admired. Through Asquith's grandson, Mark Bonham Carter, Jenkins had access to Asquith's letters to his mistress, Venetia Stanley.Campbell, Roy Jenkins: A Well-Rounded Life, p. 236. Kenneth Rose, Michael Foot, Asa Briggs and John Grigg all favourably reviewed the book when it was published in October 1964.Campbell, Roy Jenkins: A Well-Rounded Life, p. 239. However, Violet Bonham Carter wrote a defence of her father in The Times against the few criticisms of Asquith in the book,Violet Bonham Carter, 'Asquith Revealed By Events', The Times (2 November 1964), p. 11. and Robert Rhodes James wrote in The Spectator that \"Asquith was surely a tougher, stronger, more acute man...than Mr. Jenkins would have us believe. The fascinating enigma of his complete decline is never really analysed, nor even understood. ... We required a Sutherland: but we have got an Annigoni\".Robert Rhodes James, 'Last of the Romans?', The Spectator (6 November 1964), p. 23. John Campbell claims that \"for half a century it has remained unchallenged as the best biography and is rightly regarded as a classic\"."]}, {"page": "Suez Crisis", "response": [" Lady Violet Bonham Carter, an influential Liberal Party member, wrote in a letter to the Times that"]}, {"page": "Michael Heseltine", "response": ["The Union cellars were opened on 30 October 1954, and Heseltine persuaded the visiting Sir Bernard and Lady Docker to contribute to the considerable cost.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 35. Debates over which he presided included censorship of the Arts (no vote taken), welcoming the decline of British Imperialism (defeated 281–381) and calling for a \"change in the principles and practice of British Trade Unions\" (carried 358-200).Pearce 2016, pp. 550–2. Guest speakers that term included Rajani Palme Dutt, Lady Violet Bonham Carter, his old headmaster John Wolfenden and Jacob Bronowski, whilst Aneurin Bevan addressed a packed meeting of the University Labour Club, chaired by Anthony Howard, in the Union Chamber.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 36."]}, {"page": "Max Aitken, 1st Baron Beaverbrook", "response": ["When The Decline and Fall of Lloyd George was published in 1963, favourable reviewers included Clement Attlee, Roy Jenkins, Robert Blake, Lord Longford, Sir C. P. Snow, Lady Violet Bonham Carter, Richard Crossman and Denis Brogan. Kenneth Young said the book was \"the finest of all his writing\"."]}, {"page": "Helena Bonham Carter", "response": ["Bonham Carter was born in Islington, London. Her father, Raymond Bonham Carter, who came from a prominent British political family, was a merchant banker and served as the alternative British director representing the Bank of England at the International Monetary Fund in Washington, D.C., during the 1960s. Her mother, Elena (née Propper de Callejón), is a psychotherapist who is of Spanish and mostly Jewish background, and whose parents were diplomat Eduardo Propper de Callejón from Spain and painter Baroness Hélène Fould-Springer. Bonham Carter's paternal grandmother was politician and feminist Violet Bonham Carter, daughter of H. H. Asquith, the Prime Minister of the United Kingdom during the first half of the First World War.", "Bonham Carter and Burton lived in adjoining houses in Belsize Park, London. Bonham Carter owned one of the houses; Burton later bought the other and they connected the two. In 2006, they bought the Mill House in Sutton Courtenay, Oxfordshire. It was previously leased by her grandmother, Violet Bonham Carter, and owned by her great-grandfather H. H. Asquith.", "Bonham Carter's paternal grandparents were British Liberal politicians Sir Maurice Bonham-Carter and Lady Violet Bonham Carter. Helena is descended on her father's side from John Bonham Carter, Member of Parliament for Portsmouth. Helena's paternal great-grandfather was H. H. Asquith, 1st Earl of Oxford and Asquith and Prime Minister of Britain 1908–1916. She is the great-niece of Asquith's son, Anthony Asquith, English director of such films as Carrington V.C. and The Importance of Being Earnest, and a first cousin of the economist Adam RidleyL. G. Pine, The New Extinct Peerage 1884–1971: Containing Extinct, Abeyant, Dormant and Suspended Peerages with Genealogies and Arms (London: Heraldry Today, 1972), p. 16 and of politician Jane Bonham Carter."]}, {"page": "H. H. Asquith", "response": ["His eldest son Raymond, after an academic career that outstripped his father's was killed at the Somme in 1916. His second son Herbert (1881–1947) became a writer and poet and married Cynthia Charteris. His later life was marred by alcoholism. His third son Arthur (1883–1939), became a soldier and businessman. His only daughter by his first wife, Violet, later Violet Bonham Carter (1887–1969), became a well-regarded writer and a life peeress as Baroness Asquith of Yarnbury. She married Asquith's Personal Private Secretary Maurice Bonham Carter in 1915. His fourth son Cyril (1890–1954) was born on the day Asquith became a QC  and later became a Law Lord.", "*Bodleian Library catalogue record (finding aid) of Lady Violet Bonham Carter's private papers"]}, {"page": "John Simon, 1st Viscount Simon", "response": ["Simon was a vigorous campaigner against socialism, across the country in the general elections of 1945, 1950 and 1951. Churchill blocked Simon, who had stepped down as leader of the National Liberals in 1940, from joining the Conservative Party. Churchill was keen to lend Conservative support to the (official) Liberals, including his old friend Lady Violet Bonham Carter, but blocked a full merger between the Conservatives and the National Liberals although a constituency-level merger was negotiated with the Conservative Party chairman Lord Woolton in 1947 (thereafter, the National Liberals were increasingly absorbed into the Conservatives for practical purposes until they fully merged in 1968)."]}, {"page": "Archibald Sinclair, 1st Viscount Thurso", "response": ["Sinclair consistently opposed the continental dictatorships, and kept the National Liberals at arms length. He supported the League of Nations and collective security. He backed, as did Attlee, Churchill's book Arms and the Covenant. He joined the Anti-Nazi Council of Eugen Spier, with Churchill and Violet Bonham Carter, Margaret Bondfield and Hugh Dalton.  Public opinion at this point of the later 1930s by no means agreed, and John Alfred Spender attacked Sinclair in The Times on foreign policy, claiming that he, like the League of Nations Union, wished for war with the Axis Powers.", "At the time of the Munich Crisis in September 1938, Sinclair was one of the anti-appeasement group who gathered around Churchill, with Leo Amery, Robert Boothby, Robert Cecil, Harold Macmillan and Harold Nicolson. On a personal level, Violet Bonham Carter was a frequent guest of the Sinclairs at Dalnawillan Lodge in the Flow Country, as were Harcourt Johnstone and Lady Gwendoline Churchill, wife of Jack Churchill and Winston's sister-in-law. Bonham Carter was a Liberal activist, close follower of Churchill, anti-appeaser and League of Nations Union member.", "*Violet Bonham Carter, ed. Mark Pottle, Champion Redoubtable: The Diaries of Violet Bonham Carter 1914–1945 (Weidenfeld & Nicolson, 1998)"]}, {"page": "List of political families in the United Kingdom", "response": ["**Violet Bonham Carter (1887–1969), daughter of H. H. Asquith. (see Bonham Carters)", "***Violet Bonham Carter (1887–1969), President of the Liberal Party 1945–1947 and life peer. Spouse of Maurice.", "****Laura Bonham Carter, daughter of Violet Bonham Carter and married to Jo Grimond (1913–1983), MP for Orkney and Shetland 1950–1983, Leader of the Liberal Party 1956–1967 and created life peer (1983)"]}, {"page": "Earl of Oxford and Asquith", "response": ["Several other members of the Asquith family have also gained distinction. Raymond Asquith, eldest son of the first Earl and father of the second, was a barrister and intellectual. Herbert Asquith, second son of the first Earl, was a poet, novelist and lawyer. Arthur Melland Asquith (1883–1939), third son of the first Earl, was a Brigadier-General in the Army. Cyril Asquith, fourth son of the first Earl, was a Lord of Appeal in Ordinary and was created a life peer as Baron Asquith of Bishopstone in 1951. Violet Asquith, better known under her married name of Violet Bonham Carter, was a Liberal politician and was created a life peer as Baroness Asquith of Yarnbury in 1964. Her eldest son Mark Bonham Carter was a publisher and politician and was created a life peer as Baron Bonham-Carter in 1986. His daughter is the life peer Jane Bonham Carter, Baroness Bonham-Carter of Yarnbury.", "** 15px Helen Violet Bonham Carter, Baroness Asquith of Yarnbury née Violet Asquith (1887–1969)"]}, {"page": "Clement Davies", "response": ["*Violet Bonham Carter, ed. Mark Pottle, Daring to Hope: Diaries 1945–1969 (Weidenfeld & Nicolson, 2000)"]}, {"page": "Margot Asquith", "response": ["*Bodleian Library catalogue of Lady Violet Bonham Carter's private papers"]}, {"page": "Donald Maclean (spy)", "response": ["Maclean was then instructed to give up political activity and enter the Diplomatic Service, where at the right moment he would best be able to serve the cause.Cecil, A Divided Life (1989), pp. 35–36. He graduated with a First in Modern Languages and abandoned his earlier ideas of teaching English in the Soviet Union when pressed by fellow Communists at Cambridge. After spending a year preparing for the Civil Service examinations, Maclean passed with first-class honours.Cecil, A Divided Life (1989), p. 37. At the Final Board, Maclean was asked by one of the panel interviewing him, whether he had favoured communism while a university student, ostensibly because the panel knew of a trip he had taken to Moscow in his second year at Cambridge. Maclean lied: \"At Cambridge, I was initially favourable to it but I am little by little getting disenchanted with it.\" His apparent sincerity satisfied members of the panel, which included a family friend, Lady Violet Bonham Carter."]}, {"page": "Chartwell", "response": ["On the lakes lived Churchill's large collection of wildfowl, including the black swans, a gift from the Australian Government, which restocked the lakes with them in 1975. Churchill had a sentimental attachment to the fauna that lived at Chartwell: his close friend Violet Bonham Carter recalled their conversation in the garden in the early 1950s; \"He was bemoaning the fact that the summer had been a bad one for butterflies when suddenly to his delight he saw two Red Admirals alighting on a clump of Buddleia bushes he had planted to attract them. I shall never forget his pleasure\"."]}, {"page": "Sutton Courtenay", "response": ["*Tim Burton and Helena Bonham Carter bought the Mill House in 2006, which was previously leased by her grandmother, Violet Bonham Carter, and owned by her great-grandfather H. H. Asquith"]}, {"page": "Asquith (disambiguation)", "response": ["**Violet Bonham Carter (1887–1969), politician and diarist, elder daughter of H.H. Asquith by his first wife"]}, {"page": "Romanes Lecture", "response": ["* 1963 Violet Bonham Carter — The impact of personality in politics (45 years after her father gave the lecture)"]}, {"page": "1941 Committee", "response": ["*Violet Bonham Carter"]}, {"page": "National Liberal Club", "response": ["One of the items damaged in the blast was the 1915 portrait of Winston Churchill (a member of the club), by Ernest Townsend. Ironically, after 25 years of being hidden from sight, it had only just been put on display the year before. Painted in the year of the Dardanelles Campaign, Churchill was soon unavailable for unveiling the portrait as he went into exile in the trenches. After his return, his strong support for the Lloyd George coalition meant that from 1916 he proved to be persona non-grata at the club, and this only increased after he left the Liberal Party in 1924. Thus from 1915 to 1940 (with only a brief display in 1923-4), the painting was held by the club in storage. When Churchill became Prime Minister in May 1940, the club rushed out the painting and put it on display in the main lobby (where it still hangs today). It was bombed after one year, suffering a diagonal gash down the middle. The painting was then painstakingly restored, and Churchill re-unveiled it himself on 22 July 1943, at a ceremony also attended by his wife (a lifelong Liberal), Liberal Leader Sir Archibald Sinclair (a friend and colleague of over 30 years, then serving in Churchill's cabinet), lifelong friend Lady Violet Bonham Carter, Club chairman Lord Meston and cartoonist David Low.", "Since the club's 1882 foundation, women had always been allowed to use the club as visitors, but remained barred from membership until the 1960s, when it became one of the first \"gentlemen's clubs\" to admit women members. It offered women an 'associate membership' category from 1967 until 1976. The Lady Associate membership referendum was submitted for adoption by the General Committee in June 1967. The first five applications for Lady Associate Members were approved by the Membership Committee in November 1967. \"Number of lady associate members elected, or applying, at 19 January 1968\" was 34. One of the early Lady Associate Members was Miss. V.E. Wilcox, approved by the Membership Committee in March 1968. Lady Associate members initially had to be the wife or widow of a member of NLC. In 1969, women who were not related by family relationships to a male member could be nominated as Lady Associate Member, paying a higher membership fee to a Lady Associate member who is a wife or widow of a member. Both types of Lady Associate member fees were still lower than male members' membership fees because of restricted privileges of Lady Associate members. Other early Lady Associate members included Violet Bonham Carter and Nancy Seear.", "*Violet Bonham Carter, Liberal activist and daughter of H. H. Asquith."]}, {"page": "Violet Bonham-Carter", "response": ["#REDIRECT Violet Bonham Carter"]}, {"page": "Violet Bonham Carter, Baroness Asquith of Yarnbury", "response": ["#REDIRECT Violet Bonham Carter"]}, {"page": "Helen Violet Bonham Carter", "response": ["#REDIRECT Violet Bonham Carter"]}, {"page": "The Black Book (list)", "response": ["* Violet Bonham Carter, anti-fascist Liberal politician. Referred to as \"an Encirclement lady politician\""]}]}}