{"wiki_id": "http://www.wikidata.org/entity/Q252423", "itemLabel": "Robbie Hart", "itemDescription": "Football referee (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robbie_Hart", "wikipedia_page": {"main": "Robert \"Robbie\" Hart (born 9 October 1947) is an English former football referee in the English Football League and Premier League. During his officiating career he was based in Darlington, County Durham.", "link_mentions": [{"page": "Robert Hart", "response": ["* Robbie Hart (born 1947), England association football referee", "* Robbie Hart (cricketer) (born 1974), New Zealand cricketer", "* Robbie Hart, a character in the 1998 film The Wedding Singer"]}, {"page": "Julian Dicks", "response": ["In 1995 England first team manager, Terry Venables, was putting together a squad to compete in Euro96 in England. Dicks' performances had earlier given rise to journalists to call for his inclusion in the squad. Two further disciplinary events ended such calls. On 11 September 1995 he was booked for stamping on the head of Chelsea's John Spencer in a 3–1 home defeat for West Ham. Spencer required eight stitches in his head. On 16 September 1995 at Highbury he was dismissed for the eighth time in his career for a foul on Arsenal's Ian Wright. The two incidents coming so close together caused the media to focus on the incident involving John Spencer. TV pundit Andy Gray and politician, radio journalist and Chelsea supporter, David Mellor called for FA to get involved. The game had been televised live on Sky TV and a recording of it was provided to the match referee, Robbie Hart who had booked Dicks during the game. The Sun newspaper ran a full back-page on the incident with several pictures of the challenge and of blood on Spencer's face. Mellor's radio program, 606, had focused so intently on the clash that combined with The Sun's coverage, public focus was sufficient for Dicks' daughters to be attacked at their school in Essex. The FA considered the video evidence provided and a report from referee Hart and Dicks was given a three-match ban. This ban put in doubt any future involvement in England squads due to concerns over his indiscipline and he was not called into the Euro 96 squad."]}, {"page": "FA Cup Final referees", "response": ["|1986||Alan Robinson||Robbie HartAllan Gunn||C. Topliss"]}, {"page": "Robbie", "response": ["*Robbie Hart (born 1947), English football referee", "*Robbie Hart, lead character in the 1998 film The Wedding Singer"]}, {"page": "New Zealand cricket team in India in 2003–04", "response": ["* Robbie Hart (wk)"]}, {"page": "List of international five-wicket hauls at the National Stadium", "response": ["*Robbie Hart"]}]}}