{"wiki_id": "http://www.wikidata.org/entity/Q2531866", "itemLabel": "Gerald Templer", "itemDescription": "senior British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Gerald_Templer", "wikipedia_page": {"main": "Field Marshal Sir Gerald Walter Robert Templer,  (11 September 1898 – 25 October 1979) was a senior British Army officer. He fought in both the world wars and had taken part in the crushing of the Arab Revolt in Palestine. As Chief of the Imperial General Staff, the professional head of the British Army, from 1955 to 1958, he was Prime Minister Anthony Eden's chief military adviser during the Suez Crisis. He is also credited as a founder of the United Kingdom's National Army Museum.\nHe is best known for implementing strategies that heavily contributed to the defeat of the Malayan National Liberation Army (MNLA) during the Malayan Emergency. Although some historians have described his approach as a successful example of a \"hearts and minds\" campaign, other scholars have dismissed this as a myth due to his reliance on population control and coercion. Despite the ethics of his actions being hotly debated in the British parliament, many of the strategies he enforced were later (unsuccessfully) implemented by the United States in Vietnam.", "link_mentions": [{"page": "Louis Mountbatten, 1st Earl Mountbatten of Burma", "response": ["Others were not so conflicted. Field Marshal Sir Gerald Templer, the former Chief of the Imperial General Staff, once told him, \"You are so crooked, Dickie, that if you swallowed a nail, you would shit a corkscrew\"."]}, {"page": "History of Malaysia", "response": ["The Malayan Emergency as it was known, lasted from 1948 to 1960 and involved a long anti-insurgency campaign by Commonwealth troops in Malaya. The British strategy, which proved ultimately successful, was to isolate the MCP from its support base by a combination of economic and political concessions to the Chinese and the resettlement of Chinese squatters into \"New Villages\" in \"white areas\" free of MCP influence. From 1949 the MCP campaign lost momentum and the number of recruits fell sharply. Although the MCP succeeded in assassinating the British High Commissioner, Sir Henry Gurney, in October 1951, this turn to terrorist tactics alienated many moderate Chinese from the Party. The arrival of Lt.-Gen Sir Gerald Templer as British commander in 1952 was the beginning of the end of the Emergency. Templer helped create the modern techniques of Counter-insurgency warfare in Malaya and applied them against the MCP guerillas. Although the insurgency was defeated Commonwealth troops remained with the backdrop of the Cold War against the Soviet Union.\"Malaya: Siege's End\", Time, New York, 2 May 1960. Against this backdrop, independence for the Federation within the Commonwealth was granted on 31 August 1957,\"A New Nation\", Time, New York, 9 September 1957 with Tunku Abdul Rahman as the first prime minister."]}, {"page": "Konrad Adenauer", "response": ["Shortly after the war ended, the American occupation forces once again installed him as Mayor of Cologne, which had been heavily bombed. After the city was transferred into the British zone of occupation, however, the Director of its military government, General Gerald Templer, dismissed Adenauer for incompetence in December 1945. Adenauer considered the Germans the political equals of the occupying Allies, a view that angered Templer. Adenauer's dismissal by the British contributed much to his subsequent political success and allowed him to pursue a policy of alliance with the West in the 1950s without facing charges of being a \"sell-out\"."]}, {"page": "Kuala Lumpur", "response": ["There is another park in close vicinity to Kuala Lumpur i.e. Templer Park initiated and opened by Sir Gerald Templer in 1954 during the \"Emergency\" time.Ashlrigh Seow. A Man and his Park. // Senses of Malaysia, vol. 17 (January–February), 2011, p. 62–65"]}, {"page": "October 25", "response": ["*1979 – Gerald Templer, English field marshal and politician, British High Commissioner in Malaya (b. 1898)"]}, {"page": "September 11", "response": ["*1898 – Gerald Templer, English field marshal and politician, British High Commissioner in Malaya (d. 1979)"]}, {"page": "Special Operations Executive", "response": ["Due to the dangers and lack of friendly population few operations were conducted in Germany itself. The German and Austrian section of SOE was run by Lieutenant Colonel Ronald Thornley for most of the war, and was mainly involved with black propaganda and administrative sabotage in collaboration with the German section of the Political Warfare Executive. After D-Day, the section was re-organised and enlarged with Major General Gerald Templer heading the Directorate, with Thornley as his deputy."]}, {"page": "1979", "response": ["** Gerald Templer, British field marshal (b. 1898) "]}, {"page": "Suez Crisis", "response": ["In July 1956, Eden ordered his CIGS, Field Marshal Gerald Templer, to begin planning for an invasion of Egypt. Eden's plan called for the Cyprus-based 16th Independent Parachute Brigade Group to seize the canal zone. The Prime Minister's plan was rejected by Templer and the other service chiefs, who argued that the neglect of parachute training in the 16th Independent Parachute Brigade rendered his plan for an airborne assault unsuitable. Instead, they suggested the sea-power based Contingency Plan, which called for the Royal Marines to take Port Said, which would then be used as a base for three British divisions to overrun the canal zone.", "On 2 November 1956 the First Sea Lord Admiral Mountbatten sent a letter to Eden telling him to stop the invasion before troops landed in the canal zone as the operation had already proved to be too costly politically. The next day, Mountbatten made a desperate phone call to Eden asking for permission to stop the invasion before it began, only to be refused. Mountbatten's views led to clash of personalities with the Chief of the Imperial General Staff, General Gerald Templer who supported the invasion. In response to Mountbatten's call to cancel the invasion, Templer penned a memo, which read:"]}, {"page": "Malayan Emergency", "response": ["On 6 October 1951, the British High Commissioner in Malaya, Sir Henry Gurney, was assassinated during an MNLA ambush. General Gerald Templer was chosen to become the new High Commissioner in January 1952. During Templer's two-year command, \"two-thirds of the guerrillas were wiped out and lost over half their strength, the incident rate fell from 500 to less than 100 per month and the civilian and security force casualties from 200 to less than 40.\" Orthodox historiography suggests that Templer changed the situation in the Emergency and his actions and policies were a major part of British success during his period in command. Revisionist historians have challenged this view and frequently support the ideas of Victor Purcell, a Sinologist who as early as 1954 claimed that Templer merely continued policies begun by his predecessors.", "Gurney's successor, Lieutenant General Gerald Templer, was instructed by the British government to push for immediate measures to give Chinese ethnic residents the right to vote.", "During the war British and Commonwealth forces hired Iban headhunters from Borneo to decapitate suspected MNLA members, arguing that this was done so for identification purposes. However in practice this led to British troops taking the decapitated heads of Malayan people as trophies. Proof of this practice was first leaked to the public in 1952 when the British communist the Daily Worker published multiple photographs of British soldiers posing with decapitated heads as trophies. Initially British government spokespersons belonging to the Admiralty and the Colonial Office claimed the photographs were fake. However, Colonial Secretary Oliver Lyttelton (after confirmation from Gerald Templer) confirmed to parliament that the photos were indeed genuine. The Colonial Office privately noted that \"there is no doubt that under international law a similar case in wartime would be a war crime\". After the Daily Worker articles exposing the decapitating MNLA suspects the practice was banned by Winston Churchill who feared that such photographs would give ammunition to communist propaganda. After the war, one of the trophy heads was found within a British regimental museum.", "During the Malayan Emergency, Britain was the first nation to employ the use of herbicides and defoliants to destroy bushes, food crops, and trees to deprive the insurgents of cover and as part of the food denial campaign in the early 1950s. The 2,4,5-T and 2,4-D (Agent Orange) were used to clear lines of communication and wipe out food crops as part of this strategy and in 1952, trioxone, and mixtures of the aforementioned herbicides, were sent along a number of key roads. From June to October 1952, 1,250 acres of roadside vegetation at possible ambush points were sprayed with defoliant, described as a policy of \"national importance.\" The British reported that the use of herbicides and defoliants could be effectively replaced by removing vegetation by hand and the spraying was stopped. However, after that strategy failed, the use of herbicides and defoliants in effort to fight the insurgents was restarted under the command of British General Sir Gerald Templer in February 1953 as a means of destroying food crops grown by communist forces in jungle clearings. Helicopters and fixed-wing aircraft despatched STCA and Trioxaone, along with pellets of chlorophenyl N,N-Dimethyl-1-naphthylamine onto crops such as sweet potatoes and maize. Many Commonwealth personnel who handled and/or used Agent Orange during the conflict suffered from serious exposure to dioxin and Agent Orange. An estimated 10,000 civilians and insurgents in Malaya also suffered from the effects of the defoliant, but many historians think that the number is much larger since Agent Orange was used on a large scale in the Malayan conflict and, unlike the US, the British government limited information about its use to avoid negative world public opinion). The prolonged absence of vegetation caused by defoliation also resulted in major soil erosion to areas of Malaya."]}, {"page": "Battle of Anzio", "response": ["By early February, German forces in Fourteenth Army numbered some 100,000 troops organised into two Army Corps, the 1st Parachute Corps under Schlemm and the LXXVI Panzer Corps under Lieutenant General Traugott Herr. Allied forces by this time totalled 76,400 (including the recently arrived British 56th Infantry Division, under Major-General Gerald Templer, which arrived complete on February 16). After making exploratory probes on the Campoleone salient on the afternoon of February 3 the German forces launched a full counterattack at 23:00 in order to reduce the salient and \"iron out\" the front line. Von Mackensen had planned for the salient to be ground away rather than employing a rapid, focused thrust to cut it off. Some hours after the attack started the coherence of the front line had been completely shattered, and the fighting for the salient had given way to small unit actions, swaying back and forth through the gullies. In the morning of February 4 the situation was becoming more serious, with the 1st Battalion, Irish Guards (of 24th Guards Brigade), only having one cohesive rifle company left and on the opposite side of the salient, the 6th Battalion, Gordon Highlanders (of 2nd Brigade) was beginning to crumble and later lost three complete companies as prisoners."]}, {"page": "Operation Foxley", "response": ["There was some opposition to the assassination plan among the British authorities, particularly from the Deputy Head of SOE's German Directorate, Lt. Col. Ronald Thornley. However, his superior, Sir Gerald Templer, and British Prime Minister Winston Churchill supported it. "]}, {"page": "Colchester", "response": ["*Gerald Templer (1898–1979) – British army officer"]}, {"page": "List of places named after people", "response": ["* Templer's Park – Gerald Templer, a senior British Army officer "]}, {"page": "Maurice Buckmaster", "response": ["Following this, he was an intelligence officer with 50th (Northumbrian) Infantry Division, which he decided to leave after the division was scheduled to move to the Middle East. He was involved in Operation Menace in September 1940, a failed attempt to seize the port of Dakar in former French territory.Howarth (1980), p.136-137Foot (1966), p.151 Following a meeting with Gerald Templer, he was recruited into Special Operations Executive (SOE), or MO1(SP).National Archives, London. File HS 9/232/8 -Maurice Buckmaster"]}, {"page": "Jane Bown", "response": ["Bown worked primarily in black-and-white and preferred to use available light. Until the early 1960s, she worked primarily with a Rolleiflex camera. Subsequently, Bown used a 35 mm Pentax SLR, before settling on the Olympus OM-1 camera, often using an 85 mm lens. She photographed hundreds of subjects, including Orson Welles, Samuel Beckett, Sir John Betjeman, Woody Allen, Cilla Black, Quentin Crisp, P. J. Harvey, John Lennon, Truman Capote, John Peel, the gangster Charlie Richardson, Field Marshal Sir Gerald Templer, Jarvis Cocker, Björk, Jayne Mansfield, Diana Dors, Henri Cartier-Bresson, Eve Arnold, Evelyn Waugh, Brassai and Margaret Thatcher. She took Queen Elizabeth II's eightieth birthday portrait."]}, {"page": "Tunku Abdul Rahman", "response": ["On 6 October 1951, Sir Henry Gurney was killed in an ambush by communist revolutionaries. He was replaced by General Sir Gerald Templer who brought with him a new policy from the British Government in London. Templer was to guide the people of Malaya towards the attainment of a United Malayan Nation. The policy had also called for the partnership of all communities. To put this new policy into effect, the government had agreed to hold elections at the Municipal and Town Council level, as the first step towards a democratic government, and Kuala Lumpur was chosen as one of the venues for the experiment. All the existing political parties were prepared to contest.", "In August 1953, Gerald Templer offered Tunku a portfolio in the Government, but Tunku refused it. Earlier in July 1953, the government set up a working committee to examine the possibility of holding State and Federal Elections. The committee was set up after Templer obtained the concurrence of Malay Rulers who at first were quite reluctant to accept such proposals due to their deep-rooted fear of what might befall them if Independence were granted. When the names of the members of the Election Committee were announced, Tunku observed that a majority of them were Onn Jaafar's supporters."]}, {"page": "Worshipful Company of Painter-Stainers", "response": ["*Gerald Templer"]}]}}