{"wiki_id": "http://www.wikidata.org/entity/Q25326687", "itemLabel": "Rose Scott-Moncrieff", "itemDescription": "founder of biochemical genetics", "wikipedia_url": "https://en.wikipedia.org/wiki/Rose_Scott-Moncrieff", "wikipedia_page": {"main": "Rose Scott-Moncrieff (Mrs O.M. Meares) (1903-1991), was an English biochemist, credited with founding the science of bio-chemical genetics.", "link_mentions": [{"page": "Primulin (anthocyanin)", "response": ["The first crystalline form of this pigment was prepared by Rose Scott-Moncrieff in about 1930. This was the first crystalline anthrocyanine pigment ever identified. This was possible because of her insight into linking genetics with chemistry.Rose Scott-Moncrieff and the dawn of (Bio) Chemical Genetics, Cathie Martin, April 2016, Biochemical classics, Biochemist.org, Retrieved 5 July 2016"]}, {"page": "Muriel Wheldale Onslow", "response": ["Amongst her followers was Rose Scott-Moncrieff who went on to identify the first crystalline form of primulin in about 1930. This was the first crystalline anthocyanin pigment ever identified. Onslow and Scott-Moncrieff have been credited with founding biochemical genetics, although Scott-Moncrieff is thought to have the stronger claim.Rose Scott-Moncrieff and the dawn of (Bio) Chemical Genetics, Cathie Martin, April 2016, Biochemical classics, Biochemist.org. Retrieved 5 July 2016"]}, {"page": "Rose Scott‐Moncrieff", "response": ["#redirect Rose Scott-Moncrieff"]}, {"page": "Alice Elizabeth Gairdner", "response": ["Gairdner joined the John Innes Horticultural Institution (now the John Innes Centre) in 1919 as a student, joining the so-called 'Ladies Lab' along with Caroline Pellew, Dorothea De Winton, Dorothy Cayley, Aslaug Sverdrup and Irma Andersson-Kottö. Gairdner investigated male sterility in flax, initially with Bateson, and continued the work after his death. In papers published in 1921 and 1929, they proposed that nuclear-cytoplasmic interactions may be causing the male sterility phenotype. Gairdner primarily worked with J. B. S. Haldane, who led the genetics research at the institution from 1927 to 1937, following Bateson's death in 1926. By 1929, Gairdner had been appointed as a 'Cytologist', as her worked combined genetic analysis with microscopy. With Haldane she studied the genetics of Antirrhinum, leading to the publication of two papers in 1929 and 1933 on the inheritance of two linked factors that could interact to give a lethal phenotype. These papers indicate that Gairdner was solely responsible for the practical work (continuing crosses set up by her predecessor, Ida Sutton), and Haldane for the theoretical interpretation. She also studied Cleiranthus, and collaborated with Haldane and Rose Scott-Moncrieff in the investigation of pigmentation in the flowers. Gairdner also published several articles with Cyril Darlington describing chromosome pairing and ring formation during meiosis in Campanula. Gairdner presented the work on ring formation in Campanula at the Genetics Society meeting in 1936."]}]}}