{"wiki_id": "http://www.wikidata.org/entity/Q25301435", "itemLabel": "Thomas Goldsworthy Dutton", "itemDescription": "British printmaker; London lithographer of naval subjects; printed in colours; worked for the lithographic firm Day and Haghe (1819/20-1891)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Goldsworthy_Dutton", "wikipedia_page": {"main": "Thomas Goldsworthy Dutton (1820–1891) was a 19th-century English marine lithographer, draftsman, watercolourist, painter, and etcher.", "link_mentions": [{"page": "Marine art", "response": ["The ship portrait genre was taken to America by a number of emigrants, most English like James E. Buttersworth (1817–1894) and Robert Salmon.  The Luminist Fitz Henry Lane (1804–1865) was the earliest of a number of artists who developed American styles based in landscape art; he painted small boats at rest in tranquil small bays. Martin Johnson Heade was a member of the Hudson River School, and painted tranquil scenes, but also threatening storms of alarming blackness.  Winslow Homer increasingly specialized in marine scenes with small boats towards the end of the century, often showing boats in heavy swells on the open sea, as in his The Gulf Stream.Thomas Eakins often painted river scenes, including Max Schmitt in a Single Scull (1871). Thomas Goldsworthy Dutton (1820-1891) has the reputation of being one of the finest lithographers of 19th Century nautical scenes and ship portraits.T.G.Dutton"]}, {"page": "The Murray (clipper ship)", "response": ["*A lithograph Clipper Ship 'The Murray'  (1861) by Thomas Goldsworthy Dutton is held by the National Maritime Museum, Greenwich, London."]}, {"page": "Orient (clipper ship)", "response": ["*A painting by Thomas Goldsworthy Dutton is held by the National Maritime Museum."]}, {"page": "Newcastle (clipper)", "response": ["The Newcastle launched in 1857, 1275 tons, was built by W. Pile junior at Sunderland for Richard Green's London to India service. The National Maritime Museum in Greenwich has a bill of sale for the transaction (NMM MS GRN 14). She was designed by the noted naval architect Bernard Waymouth (1824–1890). Waymouth went on to design the Leander (1867) and the Thermopylae (1868). He also served as Lloyd's Register's senior surveyor for London. The Newcastle was drawn by the artist William Foster in 1857, and his picture was made into a lithograph that same year by Thomas Goldsworthy Dutton; she was shown flying the Green Blackwall line House flag on her main mast. Her first commander was R.D. Crawford."]}, {"page": "George Pechell Mends", "response": ["Sketches and watercolours by Mends survive from as early as 1838 and as late as 1865. Over 80 of these works are in the collection of the National Maritime Museum, more than half of which are from a sketchbook that covers the period of 1850 to 1853, immediately before and during his time on HMS Trafalgar, with some examples in private hands. The lithographer and artist Thomas Goldsworthy Dutton used some of his work, and other notable artists also copied it.", "File:The Burning of the United States steam frigate Missouri at Gibraltar Augt 26th 1843 - falling of the mainmast and explosion of the last gun - everybody had quitted the vessel RMG PY0897 (cropped).jpg|Mends was a witness to the burning of the United States steam frigate  at Gibraltar 26 August 1843. His sketch was the basis for a painting by Edward Duncan. This litho from Thomas Goldsworthy Dutton is from that work."]}, {"page": "Thomas Dutton (disambiguation)", "response": ["*Thomas Goldsworthy Dutton (1820–1891), English marine lithographer"]}]}}