{"wiki_id": "http://www.wikidata.org/entity/Q254766", "itemLabel": "Catherine Tate", "itemDescription": "English comedian, actress and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Catherine_Tate", "wikipedia_page": {"main": "Catherine Jane Ford (born 12 May 1968), known professionally as Catherine Tate, is an English actress, comedian, and writer. She has won numerous awards for her work on the BBC sketch comedy series The Catherine Tate Show (2004–2007), as well as being nominated for an International Emmy Award and seven BAFTAs. Tate played Donna Noble in the 2006 Christmas special of Doctor Who, and later reprised her role, becoming the Tenth Doctor's regular companion for the fourth series in 2008.Following the success of The Catherine Tate Show, Tate starred as Joannie Taylor in the BBC One comedy series Catherine Tate's Nan (2009–2015). In 2011, she began a recurring role as Nellie Bertram in the U.S. version of The Office and was a regular until the series ended. Tate played the role of Miss Sarah Postern in the BBC One sitcom Big School (2013–2014). Since 2017, she has played the voice role of Magica De Spell in the DuckTales animated series.\nTate has also appeared in films, including Mrs Ratcliffe's Revolution (2007), Gulliver's Travels (2010), Monte Carlo (2011), and SuperBob (2015).", "link_mentions": [{"page": "List of comedians", "response": ["* Catherine Tate (born 1969)"]}, {"page": "Doctor Who", "response": ["Since the 2005 revival, the Doctor generally travels with a primary female companion, who occupies a larger narrative role. Steven Moffat described the companion as the main character of the show, as the story begins anew with each companion and she undergoes more change than the Doctor. The primary companions of the Ninth and Tenth Doctors were Rose Tyler (Billie Piper), Martha Jones (Freema Agyeman), and Donna Noble (Catherine Tate) with Mickey Smith (Noel Clarke) and Jack Harkness (John Barrowman) recurring as secondary companion figures. The Eleventh Doctor became the first to travel with a married couple, Amy Pond (Karen Gillan) and Rory Williams (Arthur Darvill), whilst out-of-sync meetings with River Song (Alex Kingston) and Clara Oswald (Jenna Coleman) provided ongoing story arcs. The tenth series introduced Pearl Mackie as Bill Potts, the Doctor's first openly gay companion. Pearl Mackie said that the increased representation for LGBTQ people is important on a mainstream show.", "Since 1999, Big Finish Productions has released several different series of Doctor Who audios on CD.  The earliest of these featured the Fifth, Sixth and Seventh Doctors, with Paul McGann's Eight Doctor joining the line in 2001.  Tom Baker's Fourth Doctor began appearing for Big Finish in 2012.  Along with the main range, adventures of the First, Second and Third Doctors have been produced in both limited cast and full cast formats, as well as audiobooks.  The 2013 series Destiny of the Doctor, produced as part of the series' 50th Anniversary celebrations, marked the first time Big Finish created stories (in this case audiobooks) featuring the Doctors from the revived show. Along with this, in May 2016 the Tenth Doctor, David Tennant, appeared alongside Catherine Tate in a collection of three audio adventures. In August 2020, Big Finish announced a new series of audios beginning release in May 2021, featuring Christopher Eccleston reprising his role as the Ninth Doctor."]}, {"page": "Davros", "response": ["In the follow-up episode \"Journey's End\" (2008), it is revealed that the stolen planets are required as a power source for Davros' ideal final solution: the Reality Bomb, which produces a wavelength that would cancel out the electrical field binding atoms to reduce all life outside the Crucible into nothingness in both his universe and countless other realities. But Davros learns too late that Dalek Caan, who came to the realisation of his race's atrocities as a consequence of saving his creator, used his prophecies and influence to ensure the Daleks' destruction while manipulating events to bring the Tenth Doctor and Donna Noble (Catherine Tate) together for the role the latter would play. Though the Doctor attempts to save him, having earlier taunted the Doctor for turning his companions into killers and being the cause of the deaths of countless people during his travels, Davros furiously refuses the Doctor's help and accuses him of being responsible for the destruction while screaming: \"Never forget, Doctor, you did this! I name you forever: You are the Destroyer of Worlds!\" Thus the Doctor is forced to leave Davros to his supposed fate as the Crucible self-destructs."]}, {"page": "May 12", "response": ["*  1968   – Catherine Tate, English actress and screenwriter"]}, {"page": "Sonic screwdriver", "response": ["*In a comic The Catherine Tate Show sketch, Catherine Tate's teenage character Lauren Cooper accuses her English teacher (played by David Tennant) of being \"the Doctor\". After much provocation, the teacher uses the sonic screwdriver to transform Lauren into a Rose Tyler action figure."]}, {"page": "1969", "response": ["** Catherine Tate, English actress, comedian, and writer"]}, {"page": "Madness (band)", "response": ["Some members of the band appeared in Catherine Tate's Nan's Christmas Carol. They first posed as carol singers, then played \"Baggy Trousers\" over the credits. On 18 January 2010, Madness released a fourth single, \"Forever Young\", from The Liberty of Norton Folgate. The single failed to chart."]}, {"page": "Assassins (musical)", "response": ["A new production of Assassins starring Catherine Tate as Sarah Jane Moore, Aaron Tveit as John Wilkes Booth, Mike McShane as Samuel Byck, Andy Nyman as Charles Guiteau, and Jamie Parker as the Balladeer opened on November 21, 2014, at the Menier Chocolate Factory in London and ran until March 7, 2015.", "| Catherine Tate"]}, {"page": "The Archers", "response": ["* In September 2016, in an hour-long episode concluding a highly publicised storyline in which Helen Titchener had stabbed her abusive husband Rob, some notable names guest starred as jury members, including Dame Eileen Atkins, Catherine Tate and Nigel Havers."]}, {"page": "List of British comedians", "response": ["*Catherine Tate (born 1968), The Catherine Tate Show "]}, {"page": "Magica De Spell", "response": ["In the reboot, Magica speaks with an English accent as she is voiced by Catherine Tate, former Doctor Who costar to David Tennant (who voices Scrooge McDuck in the new series). Within the reboot's storyline, Magica has a history with Clan McDuck and a vendetta against Scrooge after he caused her to accidentally turn Poe into a raven and refused to stop him from flying away prior to the start of the series. During a climactic battle atop Mount Vesuvius 15 years prior, Scrooge sealed her physical body within his Number One Dime, though she was able to turn her shadow into her \"niece\", Lena De Spell. Throughout the first season, Magica manifested as a shadowy specter and forced Lena to gain the Duck family's trust in order to acquire Scrooge's Dime and regain her body. While Magica eventually regained her corporeal form during an eclipse that occurred in the season one finale before proceeding to decimate Duckburg, she is defeated and forced to flee after being stripped of her powers by the combined efforts of Scrooge and his family destroying her staff. In the second-season episode, \"A Nightmare on Killmotor Hill!\", Magica uses a telepathic helmet to invade Lena's dreams and get her powers back from her, though she is foiled once more and Lena destroys her helmet. In a later episode, \"GlomTales!\", she joins an alliance of Scrooge's greatest enemies led by Flintheart Glomgold in a joint effort to destroy Scrooge and his family. However, Glomgold ends up losing his fortune, as well as that of the other villains', to Louie Duck, causing the villains to turn on the former second richest duck in the world. In season three, Magica regained her powers while helping Lena and her friends fend off the Phantom Blot, whose village Magica destroyed in the past, but she was in turn fended off by Lena, who had mastered her own powers during the fight."]}, {"page": "Balham", "response": ["*The Bedford is a pub venue for live music and comedy on Bedford Hill. Performers at the Banana Cabaret have included Stephen K Amos, Omid Djalili, Harry Hill, Eddie Izzard, Al Murray and Catherine Tate. The pub has won various awards including the Publican Music Pub of the Year 2002; the Morning Advertiser Pub of the Year 2004; and the Evening Standard Pub of the Year 2002. In 1876, the pub building (then named the Bedford Hotel) housed the coroner's inquest into the notorious unsolved murder of Charles Bravo, a resident and lawyer who was poisoned, possibly by his wife. The Priory, where the alleged murder took place, is also a landmark noted for the specific architectural style."]}, {"page": "Bloomsbury", "response": ["*Catherine Tate (born 1968), actress and comedian, brought up in the Brunswick Centre, close to Russell Square."]}, {"page": "Comic Relief", "response": ["Sketches included a crossover between Catherine Tate’s Nan character and James Bond (Daniel Craig), a Comic Relief Zoom meeting featuring Jack Whitehall and various celebrities and a trailer for 2020 - The Movie featuring Keira Knightley, Michael Sheen, Jodie Whittaker, KSI, Anna Friel and Dame Joan Collins. Sheen and Tennant also starred in a special edition of their TV show Staged while McGuinness and his Top Gear co-stars, Freddie Flintoff and Chris Harris were asked questions by kids in a segment hosted by Radio 1's Jordan North. The Vicar of Dibley's Geraldine Granger (played by Dawn French) appeared alongside the Reverend Kate Bottley to open the show. There were musical performances from The Proclaimers, Gabrielle and the cast of Back to the Future the Musical. After the main show, Amanda Holden and Jason Manford presented The Great Comic Relief Prizeathon."]}, {"page": "Bernard Cribbins", "response": ["In 2009, Cribbins was honoured for his work in children's television with a Special Award at the British Academy Children's Awards which was presented by former co-star Catherine Tate, who portrayed his character's granddaughter in Doctor Who. He was appointed Officer of the Order of the British Empire (OBE) in the 2011 Birthday Honours for services to drama. In 2014, he was awarded the J.M. Barrie award for his \"lasting contribution to children's arts\"."]}, {"page": "Lenny Henry", "response": ["In June 2000, for a BBC documentary, he sailed a trimaran from Plymouth to Antigua with yachtsman Tony Bullimore.  In 2005, he appeared in Birmingham, as an act for Jasper Carrott's Rock with Laughter. He appeared alongside performers such as Bill Bailey, Jasper Carrott, Bonnie Tyler, Bobby Davro and the Lord of the Dance troupe. In 2006, Henry starred in the BBC programme Berry's Way. He did the voice of Dark Nebula in Kirby: Squeak Squad. On 16 March 2007, Henry made a cameo appearance as himself in a sketch with Catherine Tate, who appeared in the guise of her character Geordie Georgie from The Catherine Tate Show. The sketch was made for the BBC Red Nose Day fundraising programme of 2007."]}, {"page": "Ebenezer Scrooge", "response": ["* Catherine Tate as Nan in Nan's Christmas Carol, 2009"]}, {"page": "Royal Shakespeare Company", "response": ["On 23 April 2016, the RSC performed a one night extravaganza, called ‘Shakespeare Live!’. Broadcast on BBC Two from the Royal Shakespeare Theatre, it marked the 400th anniversary of Shakespeare’s Death. It involved a collection of Shakespeare scenes and monologues with appearances from David Tennant, Catherine Tate, Dame Judi Dench, Benedict Cumberbatch and even one from Prince Charles."]}, {"page": "David Schwimmer", "response": ["Schwimmer starred on the London stage in May 2005, with Catherine Tate, Lesley Manville, Sara Powell, and Saffron Burrows, in Neil LaBute's Some Girl(s) at the Gielgud Theatre. In the production, he plays a teacher who is ready to settle down and marry, but decides to visit four ex-girlfriends first. For his performance, Schwimmer received critical reviews. The Independent wrote that Schwimmer \"is not called upon to extend his range nearly as far as one might have expected in Some Girl(s). [...] Schwimmer remains bland, competent, and boyish—though not fatally boyish in the manner that appears to have turned these women on.\" However, Charles Spencer of The Daily Telegraph praised Schwimmer, reporting he \"proves inspired casting. He takes to the stage with ... his endearing gaucheness seems designed to ensure our continued sympathy. Schwimmer mercilessly lays bare his character's opportunism, casual cruelties, and chronic self-deception.\""]}, {"page": "1968 in television", "response": ["| Catherine Tate"]}, {"page": "1968 in film", "response": ["**Catherine Tate, English actress, comedian and writer"]}, {"page": "ITV Channel Television", "response": ["Despite being a small station, Channel took on a role in ensuring that ITV's independently produced programmes complied with the UK's guidelines and laws. On 18 May 2008, The Sunday Times newspaper reported that ITV plc was using Channel's compliance role as a loophole, enabling it to lessen a possible fine for breaching Ofcom regulations during the 2005 British Comedy Awards. During the programme Robbie Williams presented an award to Ant and Dec which should have gone to Catherine Tate who had received a greater number of phone-in votes. For this breach, Ofcom fined the broadcaster, which was worked out as a maximum of 5% of the offending broadcaster's advertising revenue. However, as the programme was independently produced Channel is seen as the offending broadcaster for not ensuring compliance, despite Channel having no role in commissioning the programme. Therefore, any fines received are minimal as Channel's advertising income was by far the smallest of all the ITV companies.ITV’s Ant and Dec vote-rigging fine to be ‘derisory’, The Sunday Times, 18 May 2008"]}, {"page": "Everybody Loves Raymond", "response": ["A pilot for a British remake, titled The Smiths, has been commissioned to be produced for BBC One and was filmed in May 2013 at Elstree Studios.  Lee Mack wrote and starred in the pilot, as Michael Smith.  The pilot also starred Catherine Tate, Tom Davis, Gwen Taylor and David Troughton.Tartaglione, Nancy. BBC Commissions Pilot For 'Everybody Loves Raymond' Remake 'The Smiths.' Deadline Hollywood (May 9, 2013)."]}, {"page": "Basildon", "response": ["Basildon was the setting for the BBC programme White Gold with filming taking place in Basildon Town Centre. Channel 5 programme Extreme Hair Wars was set at JET training academy in Basildon. The fictional character Nellie Bertram, played by Catherine Tate in the U.S. comedy television series The Office was said to have been born in Basildon."]}, {"page": "Red hair", "response": ["This prejudice has been satirised on a number of TV shows. English comedian Catherine Tate (herself a redhead) appeared as a red-haired character in a running sketch of her series The Catherine Tate Show. The sketch saw fictional character Sandra Kemp, who was forced to seek solace in a refuge for ginger people because she had been ostracised from society.Catherine Tate: Ginger Refuge video Gingerism.com, 18 December 2008 The British comedy Bo' Selecta! (starring redhead Leigh Francis) featured a spoof documentary which involved a caricature of Mick Hucknall presenting a show in which celebrities (played by themselves) dyed their hair red for a day and went about daily life being insulted by people."]}, {"page": "Jeanette Winterson", "response": ["In 2009, Winterson donated the short story \"Dog Days\" to Oxfam's Ox-Tales project, covering four collections of UK stories by 38 authors. Her story appeared in the Fire collection.Ox-Tales . Oxfam. Retrieved on 26 August 2011. She also supported the relaunch of the Bush Theatre in London's Shepherd's Bush. She wrote and performed work for the Sixty Six Books project, based on a chapter of the King James Bible, along with other novelists and poets including Paul Muldoon, Carol Ann Duffy, Anne Michaels and Catherine Tate.The Sixty Six Project . Bush Theatre. Retrieved on 26 August 2011.Guardian  \"Sixty-Six Books – review\" 16 October 2011."]}, {"page": "Never Mind the Buzzcocks", "response": ["In 2010, guest hosts continued to present the show's 24th series, including Mark Ronson, Jack Dee, Josh Groban, Terry Wogan, Tim Minchin, Robert Webb, Tim Westwood, Catherine Tate, Frankie Boyle (hosting for the second time) and David O'Doherty, who also hosted a compilation show transmitted on 11 January 2011. On 16 July 2011, the first ever live Never Mind the Buzzcocks special was hosted at Latitude. It lasted roughly two hours, was hosted by David O'Doherty, had the team captains Phil Jupitus and Noel Fielding, and featured guests Seann Walsh, Charlie Baker, Paloma Faith and Robert Milton (standing in for Seasick Steve, who was supposed to be there but never arrived)."]}, {"page": "Dawn French", "response": ["French and Saunders have also followed separate careers. During French's time starring in Murder Most Horrid, from 1991 to 1999, she played a different character each week, whether it was the murderer, victim, or both. In 2002, French appeared in the comedy/drama mini-series Ted and Alice. In the series, set in the Lake District, French played a tourist information officer who falls in love with an alien. She appeared once in the Saunders led sitcom Absolutely Fabulous as TV interviewer Kathy in 1992, a parody of Lorraine Kelly, she reprised that role for Absolutely Fabulous: The Movie in 2016 as a more established veteran journalist as Kelly is now. She also appeared in the BBC sitcom Wild West, with Catherine Tate,\"Catherine Tate profile\" BBC. Retrieved 26 May 2007. in which she played a woman living in Cornwall who is a lesbian, more through lack of choice than any specific natural urge. This series did not meet with as much success as her earlier roles and it ended in 2004 after two years."]}, {"page": "The Secret Policeman's Ball", "response": ["Participating UK comedians were : Russell Brand, Eddie Izzard, Peter Serafinowicz, David Walliams, Jimmy Carr, Catherine Tate, Noel Fielding, Matt Berry, Micky Flanagan, Jack Whitehall, John Oliver."]}, {"page": "Paul Jackson (producer)", "response": ["In 2006, Jackson returned to the UK as Director of Comedy and Entertainment for the ITV network, intending to return comedy back to the ITV schedule. As well as cementing Harry Hill's TV Burp into the heart of the network's Saturday nights, Benidorm, Headcases, Ladies of Letters and No Heroics were all commissioned by Jackson's new team, alongside one off comedy films starring talent such as Catherine Tate, Shane Richie, Timothy Spall, Julia McKenzie and Anton Rodgers as well as writers such as Caroline Aherne, Richard Herring and Irvine Welsh."]}, {"page": "Russell T Davies", "response": ["In September 2008, BBC Books published The Writer's Tale, a collection of emails between Davies and Radio Times and Doctor Who Magazine journalist Benjamin Cook. Dubbed the \"Great Correspondence\" by Davies and Cook, The Writer's Tale covers a period between February 2007 and March 2008 and explores his writing processes and the development of his scripts for the fourth series of Doctor Who: \"Voyage of the Damned\", \"Partners in Crime\", \"Midnight\", \"Turn Left\", \"The Stolen Earth\", and \"Journey's End\". The book's first chapter focuses on Cook's \"big questions\" on Davies' writing style, character development—he used the Doctor Who character Donna Noble (Catherine Tate) and the Skins character Tony Stonem (Nicholas Hoult) as contrasting examples—, how he formulated ideas for stories, and the question \"why do you write?\". After several weeks, Cook assumes an unofficial advisory role to the scriptwriting and the development of the series. The book's epilogue consists of a short exchange between Davies and Cook: Cook changes from his role as \"Invisible Ben\" to \"Visible Ben\" and strongly advises to vastly alter the denouement to \"Journey's End\" from a cliffhanger which led into \"The Next Doctor\"—which had occurred in the previous three series finales, \"The Parting of the Ways\", \"Doomsday\", and \"Last of the Time Lords\"—to a melancholy ending that showed the Doctor alone in the TARDIS. After three days of deliberation, Davies accepts Cook's suggestion and thanks him for improving both episodes."]}, {"page": "Noel Edmonds", "response": ["On 16 March 2007, Edmonds made a cameo appearance as himself in a sketch with Catherine Tate who appeared in the guise of her character Joannie \"Nan\" Taylor from The Catherine Tate Show. Nan appeared on a special episode of Deal or No Deal, where she ended up cheating. The sketch was made for the BBC Red Nose Day fundraising programme of 2007."]}, {"page": "Little Britain", "response": ["A crossover between the UK and USA versions, this featured guest appearances by Catherine Tate and Robbie Williams.", "Walliams reprises the role of Lou Todd for Comic Relief. Guest stars included Stephen Hawking and Catherine Tate. However, Lucas does not feature."]}, {"page": "Mark Gatiss", "response": ["From December 2010 to March 2011, Gatiss was playing the role of Bernard in Alan Ayckbourn's Season's Greetings at the Royal National Theatre in London alongside Catherine Tate."]}, {"page": "Big Train", "response": ["Its stars included the actor Kevin Eldon, Mark Heap, and Simon Pegg in both series one and two, with Julia Davis and Amelia Bullmore in the first series (Nick Frost also appeared in two episodes), and Rebecca Front, Tracy-Ann Oberman and Catherine Tate in the second series. All its lead actors have starred in a variety of other comedy shows including I'm Alan Partridge, Look Around You, Spaced, Smack the Pony, Brass Eye and Green Wing. Catherine Tate went on to get her own show on the BBC, The Catherine Tate Show. The first series was directed by Graham Linehan and other series contributors included David Mitchell."]}, {"page": "Duke of York's Theatre", "response": ["* Under the Blue Sky (25 July 2008 – 20 September 2008) by David Eldridge, starring Catherine Tate, Francesca Annis and Dominic Rowan"]}, {"page": "Gielgud Theatre", "response": ["*2005: Some Girls by Neil LaBute, starring David Schwimmer and Catherine Tate"]}, {"page": "British Comedy Awards", "response": ["At the 2005 British Comedy Awards show, the wrong show received the People's Choice Award. The award was \"mistakenly given\" to Ant & Dec's Saturday Night Takeaway even though The Catherine Tate Show received the most tabulated votes and should have been declared the winner, and Anthony McPartlin and Declan Donnelly (Ant & Dec) were asked to return their 2005 award.", "* Best comedy newcomer: Catherine Tate", "* People's choice award: The Catherine Tate Show declared actual winner (2008); \"mistakenly\" awarded to Ant & Dec's Saturday Night Takeaway (2005)", "* Best TV Comedy Actress: Catherine Tate"]}, {"page": "David Walliams", "response": ["In 2013, Walliams appeared in two episodes of the comedy series Blandings as Rupert Baxter, an efficiency expert hired to serve as Lord Emsworth's secretary. Also that year, and in 2014, Walliams starred as chemistry teacher Keith Church in the BBC One sitcom Big School, which he created and co-wrote. The series also starred Catherine Tate, Frances de la Tour and Philip Glenister. In March 2014 Walliams narrated a short video for the charity, Electrical Safety First, featuring the character Charley from the Charley Says educational films of the 1970s.", "For Comic Relief 2015, Walliams appeared as Lou Todd and Stephen Hawking in the Andy Pipkin role along with Catherine Tate as a nun. In 2015, coinciding with the 125th anniversary of Agatha Christie's birth, Walliams played the role of Tommy Beresford in Partners in Crime, a six-part BBC series. In September 2015, Walliams began filming for his BBC sketch show Walliams & Friend, which also starred Joanna Lumley and Morgana Robinson and premiered on Christmas Eve in 2015. The show returned for a full series in November 2016."]}, {"page": "Don't Dilly Dally on the Way", "response": ["*In The Catherine Tate Show, during the \"Life at Ma's\" sketch (a spoof of Life on Mars), the last four lines are sung by Catherine Tate and a variety of other characters."]}, {"page": "The Bedsitting Room (play)", "response": ["A radio adaptation was broadcast on BBC Radio 4 on 26 December 2015 featuring Paul Merton, Derek Jacobi, Bernard Cribbins and Catherine Tate."]}, {"page": "Patsy Palmer", "response": ["In 2005, Palmer took part in BBC's Strictly Come Dancing show, to raise money for the Children in Need fund. She has also made a cameo appearance with Catherine Tate's sketch show The Catherine Tate Show. In February 2007, she was a jury member on the BBC programme The Verdict, where various celebrities ruled on a contemporary and controversial case, based on evidence and examples from real life."]}, {"page": "The Sketch Show", "response": ["The show started at the Edinburgh Festival Fringe in 1999, and starred Mack, Catherine Tate and Dan Antopolski. Mack later expressed regret at not including them in the TV show, stating: \"I'm not a great believer in regret, but looking back over the last eighteen years of me doing this job, not keeping our sketch show Bits together and jumping at the first offer to put a version of it on telly is probably the biggest mistake I've made.\""]}, {"page": "The Paul O'Grady Show", "response": ["On Friday 18 December 2009, O'Grady presented his final show with an array of special guests; including Beverley Callard and William Roache, Honor Blackman, Natalie Cassidy, JLS, Scott Maslen, Joe McFadden, Linda Thorson, Melanie Sykes, Catherine Tate (appearing as Joannie \"Nan\" Taylor), Kate Thornton and The Teletubbies. Plus, other celebrities including Kim Cattrall, Whoopi Goldberg, Jonas Brothers, Alan Menken and Enrique Iglesias.", "The Paul O'Grady Show appeared in a series 3 episode of The Catherine Tate Show, where Tate's character Joannie \"Nan\" Taylor made an appearance. Originally she acted very sweet, but later revealed her true colours. When O'Grady mentioned that they had replaced Joannie's old chair with a new one and placed it in her flat, she became enraged at them for intruding her flat. Nan started swearing and walked off the set, much to the disgust of O'Grady. I"]}, {"page": "Rose Tyler", "response": ["In spin-off series Torchwood (2006–2011), the audience learns that Rose's act of resurrecting Jack cursed him with being unable to die. Her absence and the Doctor's pained estrangement from her proves a point of contention for the Doctor's series 3 (2007) companion Martha Jones (Freema Agyeman); when Martha protects the Doctor, living as a human without his memories, it is still Rose that he dreams of. When the Doctor is reunited with Donna Noble (Catherine Tate) in the show's fourth series (2008) during \"Partners in Crime\", Rose mysteriously begins to appear in the Doctor's life—first seen only by Donna, and later in silent video messages which the Doctor is oblivious to. In \"Turn Left\", when a \"Time Beetle\" creates an alternate universe in which Donna never meets the Doctor and the Doctor dies, Rose travels from her parallel world to this world, working alongside the organisation UNIT to send Donna back in time, and make Donna's younger self turn left at a junction and not right. Rose tells Donna to say two words to the Doctor; \"Bad Wolf\". The Doctor concludes this is a sign that the universe, and reality itself is under threat. Later, in the midst of Davros' (Julian Bleach) plot to obliterate existence, Rose unites with the Doctor and his companions Donna, Martha, Jack and Sarah Jane to make a stand against him and his army of Daleks. In the midst of the battle, a part-human Doctor is created and destroys the Daleks. The Doctor returns Rose to the parallel universe along with Jackie, and his part-human counterpart. Rose challenges the Doctor to say the words he did not say to her during their previous farewell. The Doctor does not answer, but his part-human counterpart whispers in her ear and Rose kisses him. The Doctor retreats, leaving Rose behind with his part-human counterpart. In the closing scenes of \"The End of Time\" (2010), just prior to his regeneration, the Doctor travels to Rose's housing estate in the first minutes of 2005. He speaks to her from the shadows, asking her what year it is. She tells him it is 1 January 2005. The Doctor promises her that she will have a really great year."]}, {"page": "Noel Fielding", "response": ["In 2011, he took part in Catherine Tate's TV movie Laughing at the Noughties in which he and other British comedians discussed the comedy highlights of the noughties.", "|Catherine Tate: Laughing at the Noughties"]}, {"page": "MegaCon", "response": ["| May 24–27, 2018 (Orlando) || Jeff Goldblum, Lucy Lawless, Jason Momoa, Stephen Moyer, Norman Reedus, Elijah Wood, Amy Acker, Alexa Bliss, John Cena, Charlie Cox, Michael Cudlitz, William B Davis, Keir Dullea, Cary Elwes, Joe Flanigan, Annabeth Gish, Amy Jo Johnson, Gary Lockwood, China McClain, Jennifer Morrison, Shinsuke Nakamura, Mitch Pileggi, Paul Reubens, Chris Sarandon, Wallace Shawn, Jewel Staite, Braun Strowman, Joonas Suotamo, Catherine Tate, Billy Dee Williams, Cress Williams, Nafessa Williams "]}, {"page": "The Sunday Night Project", "response": ["| Catherine Tate", "| Catherine Tate and Mark Ronson"]}, {"page": "Tracy-Ann Oberman", "response": ["Oberman has contributed to several radio sketch shows and, in 2008, co-authored with Diane Samuels the play Three Sisters on Hope Street. In 2010, she wrote and starred alongside Catherine Tate in her BBC Radio 4 play Bette and Joan and Baby Jane and in 2012 wrote the BBC Radio 4 play Rock and Doris and Elizabeth. In 2015 she wrote and starred in the third part of her Hollywood Trilogy for BBC Radio 4, Mrs. Robinson, I Presume, alongside John Simm and Kevin Bishop. Oberman was a regular columnist for The Guardian newspaper during 2007, for which she is still an occasional contributor. She was a regular contributor to The Jewish Chronicle (2009–2017) and also contributes to Red magazine.", "At the end of 2009, Oberman returned to radio to star in \"Gregory Evans’ mind-boggling play\" Shirleymander for Radio 4, with reviewer Moira Petty describing Oberman's turn as Dame Shirley Porter as \"freakishly real\". In 2010, Oberman remained with the radio medium, performing opposite Catherine Tate.", "That year Oberman was cast as series regular \"Beverly Jordan\" opposite Michael Barrymore in Bob Martin, and became a lead performer in Lenny Henry in Pieces, starring actor/comedian Lenny Henry, which ran until 2003. In 2002 Oberman joined the second and final series of the sketch show Big Train, performing beside comedians Simon Pegg and Catherine Tate.", "Oberman wrote and performed in her first BBC Radio 4 play which went out to great critical acclaim on 29 April 2010. Catherine Tate played Bette Davis and Oberman herself (after persuasion by the producer) played Joan Crawford, with Lorelei King as Hedda Hopper. The play was chosen as Pick of The Week by Gillian Reynolds, and garnered a huge amount of press interest due to the subject matter, and it being Oberman's first radio play."]}]}}