{"wiki_id": "http://www.wikidata.org/entity/Q2546377", "itemLabel": "Walter Sparrow", "itemDescription": "English actor (1927-2000)", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Sparrow", "wikipedia_page": {"main": "Walter Leonard Sparrow (22 January 1927 – 31 May 2000) was an English film and television actor best known for his appearance as Duncan in the 1991 film Robin Hood: Prince of Thieves starring Kevin Costner.\nBorn in Eltham, London in 1927, Sparrow began his career as a stand-up comic before moving to acting with a period with the Royal Shakespeare Company. His first film role was in 1964, in Dr. Terror's House of Horrors, with Christopher Lee. Subsequent films, interspersed between countless TV appearances, included the 1969 sex fantasy Zeta One, Young Sherlock Holmes, and the acclaimed 1988 film The Accidental Tourist starring William Hurt, Kathleen Turner and Geena Davis.\nHis career enjoyed a resurgence in the 1990s, with Sparrow playing key roles in the 1991 film Robin Hood: Prince of Thieves as the blinded retainer Duncan, 1993's The Secret Garden as gruff gardener Ben Weatherstaff, and the 1995 American coming-of-age film Now and Then as tragic drifter 'Crazy Pete'. In 1998 he starred in Tony Harrison's film Prometheus.\nSparrow's even more prolific TV appearances included regular roles in the soap opera Emmerdale Farm, as three different minor characters in 1980, 1987 and 1993, and the comedy Paris, and guest spots on Hugh and I, Adam Adamant Lives!, Randall and Hopkirk (Deceased), Z-Cars, The Onedin Line, All Creatures Great and Small, Alas Smith and Jones, Rumpole of the Bailey, One Foot in the Grave, Ernie in Birds of a Feather, and The Bill among many others.\nSparrow is also well known for playing Maurice, a peasant who was threatened to be shipped to the Americas, in the 1998 Cinderella remake Ever After.\nOne of his more notable guest appearances was in the 1989 episode Danger UXD of the sitcom Only Fools and Horses, which had 16.1 million viewers, as sex shop owner Dirty Barry. His last appearance was in 2000 in an episode of the BBC's medical drama series Doctors.", "link_mentions": [{"page": "2000 in film", "response": ["| style=\"text-align:center;\"| 31 || Walter Sparrow || style=\"text-align:center;\"| 73 || style=\"text-align:center;\"|UK || style=\"text-align:center;\"| Actor || "]}, {"page": "1995 in film", "response": ["| Now and Then || New Line Cinema / Moving Pictures || Lesli Linka Glatter (director); I. Marlene King (screenplay); Gaby Hoffmann, Demi Moore, Thora Birch, Melanie Griffith, Christina Ricci, Rosie O'Donnell, Ashleigh Aston Moore, Rita Wilson, Devon Sawa, Lolita Davidovich, Rumer Willis, Cloris Leachman, Hank Azaria, Bonnie Hunt, Janeane Garofalo, Walter Sparrow, Bradley Coryell, Travis Robertson, Justin Humphrey, Brendan Fraser || Drama || Live action"]}, {"page": "1998 in film", "response": ["* Prometheus, directed by Tony Harrison, starring Walter Sparrow (UK)"]}, {"page": "1993 in film", "response": ["| The Secret Garden || Warner Bros. Pictures || Agnieszka Holland (director); Caroline Thompson (screenplay); Kate Maberly, Heydon Prowse, Andrew Knott, Maggie Smith, John Lynch, Irene Jacob, Colin Bruce, Laura Crossley, Walter Sparrow || Drama, Family || Live action"]}, {"page": "1991 in film", "response": ["| Robin Hood: Prince of Thieves || Warner Bros. Pictures / Morgan Creek Productions || Kevin Reynolds (director); Pen Densham, John Watson (screenplay); Kevin Costner, Morgan Freeman, Christian Slater, Alan Rickman, Mary Elizabeth Mastrantonio, Geraldine McEwan, Michael McShane, Brian Blessed, Michael Wincott, Nick Brimble, Harold Innocent, Walter Sparrow, Daniel Newman, Daniel Peacock || Action, Adventure || Live action"]}, {"page": "1985 in film", "response": ["| Young Sherlock Holmes || Paramount Pictures / Amblin Entertainment || Barry Levinson (director); Chris Columbus (screenplay); Nicholas Rowe, Alan Cox, Anthony Higgins, Sophie Ward, Roger Ashton-Griffiths, Freddie Jones, Nigel Stock, Brian Oulton, Susan Fleetwood, Earl Rhodes, Patrick Newell, Donald Eccles, Walter Sparrow, Nadim Sawalha, Roger Brierley, Vivienne Chandler, Lockwood West, John Scott Martin, Willoughby Goddard, Ralph Tabakin, Nancy Nevinson, Michael Hordern || Mystery, Adventure || Live action"]}, {"page": "Only Fools and Horses", "response": ["While their characters were less significant, well-known actors who played cameos in the programme included Joan Sims, best known for her numerous roles in the Carry On films, who guest-starred in the feature-length episode \"The Frog's Legacy\" as an aunt of Trigger and old friend of Del's late mother; successful film actor David Thewlis, who played a young wannabe musician in \"It's Only Rock and Roll\"; John Bardon, who played the role of Jim Branning in the soap opera EastEnders, as the supermarket security officer in \"The Longest Night\". Walter Sparrow, who appeared as Dirty Barry in \"Danger UXD\", went on to appear in several Hollywood films."]}, {"page": "Ace of Wands (TV series)", "response": ["3 episodes. Children have gone berserk. Tarot investigates, and meets the fiendish Uncle Harry (Dermot Tuohy) and his strange troupe of traveling entertainers. Featuring Carmen Munroe as The Queen, Roy Holder as The Jack, Walter Sparrow as the King, George Waring as the Headmaster, Sheila Raynor as the Headmistress and Lorna Heilbron as Miss Pascoe"]}, {"page": "Randall and Hopkirk (Deceased)", "response": ["*Walter Sparrow"]}, {"page": "The Wednesday Play", "response": ["| Clive EndersbyJohn BrandonHal GaliliWalter SparrowSteven BerkoffCallen AngeloRobert Arden", "| Robert PowellMichael RobbinsGeoffrey HughesWalter SparrowJohn ReesReg Lye"]}, {"page": "The Champions", "response": ["| colspan=\"5\" style=\"background-color: white;\" |Richard and Craig investigate Sharron's disappearance while on holiday in Cornwall and come across rumours of witchcraft. This turns out to be a cover for an entirely different undertaking.With Terence Alexander, Adrienne Corri, Walter Sparrow, Michael Bilton, Jerold Wells, David Lodge, Frank Thornton, Anne Sharp"]}, {"page": "The Secret Garden (1993 film)", "response": ["*Walter Sparrow as Ben Weatherstaff, the gardener"]}, {"page": "Play of the Month", "response": ["|Nigel Stock,Lee Montague,Charles Tingwell,Jerome Willis,Colin Jeavons,James Bree,Willoughby Gray,George Roubicek,George Pastell,Walter Sparrow,Peter van Dissel", "|Rex Harrison,Frank Finlay,Rosemary Leach,Bernard Hepton,Ronald Lacey,Roger Delgado,Robert Eddison,Paul Whitsun-Jones,John Hollis,Walter Sparrow", "|Michael Pennington,Laura Davenport,Nigel Havers,Charles Keating,John Shrapnel,Charles Kay,Gordon Gostelow,Michael Graham Cox,Michael N. Harbour,Martin Clunes,Glen Murphy,John Ringham,Oliver Smith,Walter Sparrow,John Abineri,Andrew Burt,Geoffrey Beevers"]}, {"page": "Now and Then (film)", "response": ["* Walter Sparrow as Crazy Pete, an old man who only comes out at night and scares the girls but they later learn he is nice after he rescues Samantha. He is later revealed to be Peter Sims, the father of Jonathan and husband of Beverly Anne."]}, {"page": "Edna, the Inebriate Woman", "response": ["* Walter Sparrow as Common Lodging House Proprietor"]}, {"page": "Danger UXD", "response": ["| Walter Sparrow"]}, {"page": "His Lordship Entertains", "response": ["* Walter Sparrow - Mr Flint"]}, {"page": "The Accidental Tourist (film)", "response": ["* Walter Sparrow as hot dog vendor"]}, {"page": "List of Dalziel and Pascoe cast members", "response": ["*Walter Sparrow"]}, {"page": "List of former Emmerdale characters", "response": ["| Harry Moore|| Walter Sparrow || 1980"]}, {"page": "List of actors in Royal Shakespeare Company productions", "response": ["*Walter Sparrow"]}, {"page": "Fred Paxford", "response": ["In the 1993 movie Shadowlands, Fred Paxford is played by Walter Sparrow."]}, {"page": "Gone to the Dogs (TV series)", "response": ["* Walter Sparrow as Stretch"]}, {"page": "Screen Two", "response": ["Cast: Maggie Smith, Michael Hordern, Renée Asherson, Stephanie Cole, Maurice Denham, Thora Hird, Zoë Wanamaker, Damaris Hayman, Leonard Maguire, Anna Cropper, Preston Lockwood, Arthur Hewlett, John Baskcomb, Walter Sparrow, Aimée Delamain", "Cast: Rachel Weisz, Rufus Sewell, Bernard Hill, Paul Reynolds, Walter Sparrow, Susannah Doyle"]}, {"page": "List of All Creatures Great and Small (1978–1990 TV series) characters", "response": ["*Strong, Roland — Walter Sparrow"]}, {"page": "Paris (1994 TV series)", "response": ["*Walter Sparrow as Hugo"]}, {"page": "List of The Main Chance episodes", "response": ["| Jack Woolgar, Anthony Bate, Michael Gover, Walter Sparrow"]}, {"page": "Sparrow (surname)", "response": ["* Walter Sparrow (1927–2000), British film and television actor"]}, {"page": "Prometheus (1998 film)", "response": ["Prometheus is a 1998 film-poem created by English poet and playwright Tony Harrison, starring Walter Sparrow in the role of Prometheus. The film-poem examines the political and social issues connected to the fall of the working class in England, amidst the more general phenomenon of the collapse of socialism in Eastern Europe, using the myth of Prometheus as a metaphor for the struggles of the working class and the devastation brought on by political conflict and unfettered industrialisation. It was broadcast on Channel 4 and was also shown at the Locarno Film Festival. It was used by Harrison to highlight the plight of the workers both in Europe and in Britain. His film-poem begins at a post-industrialist wasteland in Yorkshire brought upon by the politics of confrontation between the miners and the government of Margaret Thatcher. It has been described as \"the most important artistic reaction to the fall of the British working class\" at the end of the twentieth century.", "Walter Sparrow plays the role of an elderly, emphysema-laden Yorkshire miner who is about to retire. In a bleak, post-industrialist landscape, the old miner meets a boy who is reciting a poem about Prometheus. The youth is played by Jonathan Waintridge. The miner eventually ends up in a depleted local cinema and, though sick with emphysema, he defiantly lights-up a cigarette. With the old miner at the theatre, the run-down projection equipment suddenly comes to life and projections appear on the old screen."]}, {"page": "Somewhere to Run", "response": ["*Walter Sparrow as Neighbour"]}]}}