{"wiki_id": "http://www.wikidata.org/entity/Q254022", "itemLabel": "Eddie Izzard", "itemDescription": "British stand-up comedian (born 1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eddie_Izzard", "wikipedia_page": {"main": "Eddie Izzard (; born 7 February 1962) is an English stand-up comedian, actor, writer, and activist. Her comedic style takes the form of rambling whimsical monologues and self-referential pantomime.\nHer stand-up comedy tours have included Live at the Ambassadors (1993), Definite Article (1996), Glorious (1997), Dress to Kill (1998), Circle (2000), Stripped (2009), and Force Majeure (2013). She starred in the 2007 television series The Riches and has appeared in numerous films including Ocean's Twelve and Ocean's Thirteen, Shadow of the Vampire, The Cat's Meow, and Valkyrie. She has also worked as a voice actor on films such as Five Children and It, The Chronicles of Narnia: Prince Caspian, Abominable, and the Netflix original series Green Eggs and Ham. Among various accolades, Izzard won two Primetime Emmys for Dress to Kill and was nominated for a Tony Award for her Broadway performance in A Day in the Death of Joe Egg.\nIn 2009, she completed 43 marathons in 51 days for Sport Relief despite having no history of long-distance running. In 2016, she ran 27 marathons in 27 days in South Africa in honour of Nelson Mandela, raising £1.35 million. Regularly performing in French, among other languages, Izzard is an active supporter of Europeanism and the European Union. A dedicated Labour Party activist, she twice ran unsuccessfully for the party's National Executive Committee but temporarily joined as runner-up after Christine Shawcroft resigned in March 2018. Izzard is genderfluid and has said she prefers she and her pronouns, but \"doesn't mind\" he and him.", "link_mentions": [{"page": "Charlie Chaplin", "response": ["Chaplin is the subject of a biographical film, Chaplin (1992) directed by Richard Attenborough, and starring Robert Downey Jr. in the title role and Geraldine Chaplin playing Hannah Chaplin. He is also a character in the historical drama film The Cat's Meow (2001), played by Eddie Izzard, and in the made-for-television movie The Scarlett O'Hara War (1980), played by Clive Revill. A television series about Chaplin's childhood, Young Charlie Chaplin, ran on PBS in 1989, and was nominated for an Emmy Award for Outstanding Children's Program. The French film The Price of Fame (2014) is a fictionalised account of the robbery of Chaplin's grave."]}, {"page": "List of comedians", "response": ["* Eddie Izzard (born 1962)"]}, {"page": "Dalek", "response": ["Daleks have been the subject of many parodies, including Spike Milligan's \"Pakistani Dalek\" sketch in his comedy series Q,Newman, p. 35 and Victor Lewis-Smith's \"Gay Daleks\". Occasionally the BBC has used the Daleks to parody other subjects: in 2002, BBC Worldwide published the Dalek Survival Guide, a parody of The Worst-Case Scenario Survival Handbooks. Comedian Eddie Izzard has an extended stand-up routine about Daleks, which was included in his 1993 stand-up show \"Live at the Ambassadors\". The Daleks made two brief appearances in a pantomime version of Aladdin at the Birmingham Hippodrome which starred Torchwood star John Barrowman in the lead role. A joke-telling robot, possessing a Dalek-like boom, and loosely modelled after the Dalek, also appeared in the South Park episode \"Funnybot\", even spouting out \"exterminate\". A Dalek can also be seen in the background at timepoints 1:13 and 1:17 in the Sam & Max animated series episode \"The Trouble with Gary\". In the Community parody of Doctor Who called Inspector Spacetime, they are referred to as Blorgons."]}, {"page": "Eden Project", "response": ["|Eddie Izzard"]}, {"page": "February 7", "response": ["*  1962   – Eddie Izzard, English comedian, actor, and producer"]}, {"page": "J. K. Rowling", "response": ["On 10 June 2020, Rowling published a 3,600-word essay on her website in response to the criticism. She again wrote that many women consider terms like \"people who menstruate\" to be demeaning. She said that she was a survivor of domestic abuse and sexual assault, and stated that \"When you throw open the doors of bathrooms and changing rooms to any man who believes or feels he's a woman ... then you open the door to any and all men who wish to come inside\", while stating that most trans people were vulnerable and deserved protection. Reuters reported that, in the United States, women's rights groups said in 2016 that 200 municipalities which allowed trans people to use women's shelters reported no rise in any violence as a result; they also said that excluding transgender people from facilities consistent with their gender makes them vulnerable to assault. Rowling's essay was criticised by, among others, the children's charity Mermaids (which supports transgender and gender non-conforming children and their parents), Stonewall, GLAAD and the feminist gender theorist Judith Butler. Rowling has been referred to as a trans-exclusionary radical feminist (TERF) on multiple occasions, though she rejects the label. Rowling has received support from actors Robbie Coltrane and Eddie Izzard, and some feminists such as activist Ayaan Hirsi Ali and the radical feminist Julie Bindel. The essay was nominated by the BBC for their annual Russell Prize for best writing."]}, {"page": "Monty Python", "response": ["Monty Python were the inaugural recipients of the Empire Inspiration Award in 1997. Palin, Jones and Gilliam received the award on stage in London from Elton John while Cleese and Idle appeared via satellite from Los Angeles. In 1998 during the US Comedy Arts Festival, where the troupe were awarded the AFI Star Award by the American Film Institute, the five remaining members, along with what was purported to be Chapman's ashes, were reunited on stage for the first time in 18 years. The occasion was in the form of an interview called Monty Python Live at Aspen, (hosted by Robert Klein, with an appearance by Eddie Izzard) in which the team looked back at some of their work and performed a few new sketches. On 9 October 1999, to commemorate 30 years since the first Flying Circus television broadcast, BBC2 devoted an evening to Python programmes, including a documentary charting the history of the team, interspersed with new sketches by the Monty Python team filmed especially for the event.", "Stand-up comedian Eddie Izzard, a devoted fan of the group, has occasionally stood in for absent members. When the BBC held a \"Python Night\" in 1999 to celebrate 30 years of the first broadcast of Flying Circus, the Pythons recorded some new material with Izzard standing in for Idle, who had declined to partake in person (she taped a solo contribution from the US). Izzard hosted The Life of Python (1999), a history of the group that was part of Python Night and appeared with them at a festival/tribute in Aspen, Colorado, in 1998 (released on DVD as Live at Aspen). Izzard has said that Monty Python was a significant influence on her style of comedy and Cleese has referred to her as \"the lost Python\"."]}, {"page": "Peter Sellers", "response": ["As a kid Eddie Murphy developed playing multiple characters in imitation of his acting hero, with Chris Rock hailing Murphy's performances (such as the multiple roles in The Nutty Professor) \"Peter Sellers-esque.\" During an interview in 2002, Robin Williams told Michael Parkinson that Sellers was an important influence, especially his multi-character roles in Dr. Strangelove, stating, \"It doesn't get better than that.\" Williams was considered to play Sellers in the HBO biopic but turned it down over scheduling conflicts, though Williams considered it an honour to be able to portray him.video:  Eddie Izzard notes that the Goons \"influenced a new generation of comedians who came to be known as 'alternative'\"—including himself, while the media historian Graham McCann states \"the anarchic spirit of the Goon Show ... would inspire, directly or indirectly and to varying extents, ... The Hitchhiker's Guide to the Galaxy, The Young Ones, Vic Reeves Big Night Out, The League of Gentlemen [and] Brass Eye.\""]}, {"page": "Spike Milligan", "response": ["Eddie Izzard described Milligan as \"The Godfather of Alternative Comedy\". \"From his unchained mind came forth ideas that just had no boundaries. And he influenced a new generation of comedians who came to be known as 'alternative'.\""]}, {"page": "The Goon Show", "response": ["The show paved the way for surreal and alternative humour, as acknowledged by comedians such as Eddie Izzard.:vii The surreality was part of the attraction for Sellers, and this exacerbated his mental instability especially during the third series. ", "Eddie Izzard notes that the Goons and Milligan in particular \"influenced a new generation of comedians who came to be known as 'alternative'.\":vii John Cleese notes that \"In comedy, there are a very small number of defining moments when somebody comes along and genuinely creates a breakthrough, takes us into territory where nobody has been before. The only experiences to which I can compare my own discovery of the Goons are going to see N. F. Simpson's play One Way Pendulum ... or, later on, hearing Peter Cook for the first time. They were just light years ahead of everyone else.\":151"]}, {"page": "Robert Watson-Watt", "response": ["On 3 September 2014 a statue of Sir Robert Watson-Watt was unveiled in Brechin by the Princess Royal. One day later, the BBC Two drama Castles in the Sky, aired with Eddie Izzard in the role of Watson Watt."]}, {"page": "Who's Afraid of Virginia Woolf?", "response": ["A Broadway revival was scheduled to premiere on April 9, 2020, in a production directed by Joe Mantello and produced by Scott Rudin. It was canceled due to the COVID-19 pandemic after nine preview performances, without officially opening.\" 'Who's Afraid of Virginia Woolf' Announces Broadway Closing\" broadwayworld.com, March 21, 2020 It starred Laurie Metcalf, Rupert Everett, Russell Tovey, and Patsy Ferran. Eddie Izzard had been set to play George, but it was announced on September 11, 2019, that Everett would replace her.Gans, Andrew. \"Rupert Everett Replaces Eddie Izzard in Broadway Revival of Who's Afraid of Virginia Woolf?\" Playbill, September 11, 2019"]}, {"page": "Lord Voldemort", "response": ["Voldemort appears in The Lego Batman Movie as one of the prisoners in the Phantom Zone that Joker recruits to take over Gotham City. Though Ralph Fiennes is featured in this movie as the voice of the British butler Alfred Pennyworth, he does not reprise his role as Voldemort. Instead, Voldemort is voiced by Eddie Izzard."]}, {"page": "Eric Idle", "response": ["Idle's play What About Dick? was given a staged reading at two public performances in Hollywood on 10–11 November 2007. The cast included Idle, Billy Connolly, Tim Curry, Eddie Izzard, Jane Leeves, Emily Mortimer, Jim Piddock and Tracey Ullman. The play returned on 26–29 April 2012 in the Orpheum Theatre with most of the cast returning with the exception of Emily Mortimer who was replaced by Sophie Winkleman. Russell Brand also joined the cast. The play was made available for digital download on 13 November 2012."]}, {"page": "Tracey Ullman", "response": ["In 2011, she returned to the British stage in the Stephen Poliakoff drama My City. Her performance earned her an Evening Standard Theatre Awards nomination for Best Actress. In 2012, she joined the cast of Eric Idle's What About Dick?, described as a 1940s-style stand-up improv musical comedy radio play, taking on three roles. The show played for four nights in April in Los Angeles at the Orpheum Theater. She had performed the piece previously in a test run for Idle back in 2007. Cast members included Idle, Eddie Izzard, Billy Connolly, Russell Brand, Tim Curry, Jane Leeves, Jim Piddock, and Sophie Winkleman. On 6 October 2014, it was formally announced that she would star in a limited engagement of The Band Wagon."]}, {"page": "Unicycle", "response": ["* Eddie Izzard, comedian and actor'Eddie Izzard'"]}, {"page": "Worcester, England", "response": ["The Countess of Huntingdon's Hall is a historic church now used as venue for an eclectic range of musical and comedy performances. Recent acts have included Van Morrison, Eddie Izzard, Jack Dee, Omid Djalili and Jason Manford. The Marrs Bar is a venue for gigs and stand-up comedy. Worcester has two multi-screen cinemas; the Vue Cinema complex is located in Friar Street and the Odeon in Foregate Street – both were 3D-equipped by March 2010."]}, {"page": "The Day of the Triffids", "response": ["* In December 2009, the BBC broadcast a new version of the story, written by ER and Law & Order writer Patrick Harbinson. It stars Dougray Scott as Bill Masen, Joely Richardson as Jo Playton, Brian Cox as Dennis Masen, Vanessa Redgrave as Durrant, Eddie Izzard as Torrence, and Jason Priestley as Coker. An estimated 6.1 million people viewed the first episode. In this version the Triffids originally evolved in Zaire, and their oil is used as an alternative fuel, averting global warming. The elements of repopulating the Earth and the plague were overlooked in this adaptation; another difference in the plot was that the Earth was blinded by a solar flare rather than a meteor shower."]}, {"page": "List of British comedians", "response": ["*Eddie Izzard (born 1962)"]}, {"page": "Judi Dench", "response": ["Dench appeared as a headmistress alongside Eddie Izzard, Carla Juri, and James D'Arcy in Andy Goddard's war drama film Six Minutes to Midnight (2020) about a discovery at a school for the daughters of the Nazi elite that leads to a series of deadly events. The film received largely mixed reviews from critics who found it a \"fascinating fact-based WWII-era story to tell,\" but also remarked that it \"largely loses it in muddled spy shenanigans.\" Dench's third film in 2020 was Blithe Spirit, a comedy film based upon the 1941 play of the same name, in which she played an talentless but eccentric medium named Madame Arcati. Directed by Edward Hall, it was released to negative reviews, with Sheila O'Malley from RogerEbert.com calling it \"aggressively un-funny,\" though Dench was named the \"only bright spot\" in the film."]}, {"page": "Improvisation", "response": ["Notable pioneers in the field of improvisation, comedic or otherwise, include Mike Myers, Neil Mullarkey, Paul Merton, Stephen Fry, John Sessions, Josie Lawrence, Viola Spolin, Paul Sills, David Shepherd, Del Close, Josephine Forsberg, Gary Austin, Martin de Maat, and Keith Johnstone. Notable performers include: Paul Merton, Stephen Colbert, Steve Carell, Bill Murray, Harold Ramis, Robert Townsend, Colin Mochrie, Ryan Stiles, Ross Noble, Eddie Izzard, Tony Slattery, Mike McShane, Sandi Toksvig, Wayne Brady, Jonathan Winters, T. J. Jagodowski, Robin Williams, Conan O'Brien and David Pasquesi."]}, {"page": "Irish Travellers", "response": ["Irish Travellers have been depicted, usually negatively but sometimes with some care and sympathy, in film, radio, print, and television. Shows like The Riches (2007–2008), the American television series featuring Eddie Izzard and Minnie Driver, take a deeper look into the Traveller lifestyle. The documentary series Big Fat Gypsy Weddings (2010, 2011, and 2012) has been commercially successful in the United Kingdom, offering glimpses of Traveller life as viewed at real-life weddings. A 1997 American film, Traveller, starring Bill Paxton and Mark Wahlberg, also explored the Travellers in America. In his 1993 documentary \"Rules of the Road\" German filmmaker Oliver Herbrich portrayed the Travellers in Ireland and the UK as a nomadic ethnic group forced to adapt to settled lifestyle.Press release documnetary film Rules of the Road, 1993 Some of the main characters in the Irish sitcom, \"Derry Girls,\" encounter a group of Travellers in an episode that aired on 19 March 2019."]}, {"page": "Balham", "response": ["*The Bedford is a pub venue for live music and comedy on Bedford Hill. Performers at the Banana Cabaret have included Stephen K Amos, Omid Djalili, Harry Hill, Eddie Izzard, Al Murray and Catherine Tate. The pub has won various awards including the Publican Music Pub of the Year 2002; the Morning Advertiser Pub of the Year 2004; and the Evening Standard Pub of the Year 2002. In 1876, the pub building (then named the Bedford Hotel) housed the coroner's inquest into the notorious unsolved murder of Charles Bravo, a resident and lawyer who was poisoned, possibly by his wife. The Priory, where the alleged murder took place, is also a landmark noted for the specific architectural style."]}, {"page": "Streatham", "response": ["*Eddie Izzard, comedian and actor"]}, {"page": "Richie Sambora", "response": ["To coincide with his solo album Aftermath of the Lowdown, Sambora and friends performed as the house band on The Late Late Show with Craig Ferguson on CBS for one week (December 3–7, 2012).  Several guests sang along with the band over the week, including Ferguson (singing Sugar Daddy), Denis Leary, Eddie Izzard and even Larry King, who sang the Late Late Show theme song."]}, {"page": "Nothing Records", "response": ["In October 1998, Micko gained further attention for an acting role in filmmaker Todd Haynes' glam rock drama Velvet Goldmine, starring alongside Ewan McGregor, Christian Bale, Jonathan Rhys Meyers, Toni Collette and Eddie Izzard. Micko played the mysterious Jack Fairy, who was loosely inspired by musicians Brian Eno and Marc Bolan.  The role came about by chance for Micko, as Todd Haynes had been taking residence in the home of Micko's brother, Wash Westmoreland, while shooting his film Safe.  Todd had met Micko though his brother and felt there would be a place for him somewhere in his new film, Velvet Goldmine.  Initially auditioning for a minor part, Micko was instead cast in the pivotal role of Jack Fairy."]}]}}