{"wiki_id": "http://www.wikidata.org/entity/Q254620", "itemLabel": "Katrin Cartlidge", "itemDescription": "English actress (1961-2002)", "wikipedia_url": "https://en.wikipedia.org/wiki/Katrin_Cartlidge", "wikipedia_page": {"main": "Katrin Juliet Cartlidge (15 May 1961 – 7 September 2002) was an English actress. She first appeared on screen as Lucy Collins in the Channel 4 soap opera Brookside (1982–1983), before going on to win the 1997 Evening Standard Film Award for Best Actress for the Mike Leigh film Career Girls. Her other film appearances included Leigh's Naked (1993), Before the Rain (1994), Breaking the Waves (1996) and From Hell (2001).", "link_mentions": [{"page": "Ebertfest", "response": ["| Katrin Cartlidge, Vincent D’Onofrio, Colm Meaney"]}, {"page": "2001 in film", "response": ["| From Hell || 20th Century Fox || Albert Hughes, Allen Hughes (directors); Terry Hayes, Rafael Yglesias (screenplay); Johnny Depp, Heather Graham, Ian Holm, Robbie Coltrane, Ian Richardson, Jason Flemyng, Samantha Spiro, Annabelle Apsion, Katrin Cartlidge, Susan Lynch, Lesley Sharp, Estelle Skornik, Paul Rhys, Vincent Franklin, Ian McNeice, David Schofield, Sophia Myles, Joanna Page, Anthony Parker || Horror, Mystery || Live action"]}, {"page": "2002 in film", "response": ["| style=\"text-align:center;\"| 7 || Katrin Cartlidge || style=\"text-align:center;\"| 41 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actress || "]}, {"page": "1996 in film", "response": ["| Breaking the Waves || October Films || Lars von Trier (director/screenplay); Peter Asmussen (screenplay); Emily Watson, Stellan Skarsgard, Katrin Cartlidge, Jean-Marc Barr, Udo Kier, Adrian Rawlins, Jonathan Hackett, Sandra Voe, Mikkel Gaup, Roef Ragas, Phil McCall, Robert Robertson || Drama || Live action"]}, {"page": "1997 in film", "response": ["| Career Girls || October Films / Film Four Distributors || Mike Leigh (director/screenplay); Katrin Cartlidge, Lynda Steadman, Mark Benton, Kate Byers, Andy Serkis, Joe Tucker || Comedy, Drama || Live action"]}, {"page": "1999 in film", "response": ["| Topsy-Turvy || USA Films / Pathé Distribution || Mike Leigh (director/screenplay); Jim Broadbent, Allen Corduner, Lesley Manville, Ron Cook, Eleanor David, Timothy Spall, Vincent Franklin, Martin Savage, Dexter Fletcher, Dorothy Atkinson, Shirley Henderson, Kevin McKidd, Louise Gold, Michael Simkins, Andy Serkis, Naoko Mori, Sukie Smith, Theresa Watson, Ashley Jensen, Mark Benton, Steve Speirs, Sam Kelly, Jonathan Aris, Alison Steadman, Adam Searle, Katrin Cartlidge, Brid Brennan || Musical, Drama || Live action"]}, {"page": "1994 in film", "response": ["| Naked || Fine Line Features || Mike Leigh (director/screenplay); David Thewlis, Katrin Cartlidge, Lesley Sharp, Greg Cruttwell, Claire Skinner, Peter Wight, Ewan Bremner, Elizabeth Berrington, Gina McKee, Toby Jones, Darren Tunstall, Susan Vidler || Black Comedy, Drama || Live action  "]}, {"page": "No Man's Land (2001 film)", "response": ["*Katrin Cartlidge - Jane Livingstone, journalist"]}, {"page": "Brookside (TV series)", "response": ["The Collins family at number 8 also had an eventful time. Nearing retirement, Paul suffered humiliation at his redundancy and subsequent unemployment, resulting in the family having to move to Brookside Close in the first episode. In another British soap opera first, a controversial storyline aired in 1985 saw their teenage son Gordon (originally Nigel Crowley, later Mark Burgess) coming out as homosexual when his copy of Gay Times was delivered to the neighbouring Corkhills by mistake. This made him the first openly gay character on a British TV series. The following year, Lucy Collins (originally Katrin Cartlidge, then Maggie Saunders) embarked on an affair with an older married man. During this time Annabelle became a magistrate and the main breadwinner."]}, {"page": "Parliament Hill School", "response": ["* Katrin Cartlidge, actress"]}, {"page": "Breaking the Waves", "response": ["| Katrin Cartlidge", "The Criterion Collection initially released the film in the United States in 1997 on LaserDisc in a director's approved 2-disc edition and featured four deleted scenes selected by Lars von Trier, the complete European director's cut, a promo clip prepared by Lars von Trier for the 1996 Cannes Film Festival and the U.S. theatrical trailer. On 27 January 1998, the film was made available on VHS format courtesy of Artisan Entertainment in an edited cut, while a subsequent DVD release was made available from Artisan on 25 July 2000, in a non-anamorphic edition and lacking the special features which appeared on Criterion's LaserDisc edition. Criterion again reacquired home distribution rights to the film and released a Dual-Format digipack 1-disc Blu-ray and 2-disc DVD edition on 15 April 2014. The set contains a new 4k transfer and DTS-HD 5.1 Master Audio, most of the previous restored special features from the original LaserDisc, in addition to new select-scene audio commentary featuring von Trier, editor Anders Refn, and location scout Anthony Dod Mantle, new interview with filmmaker and critic Stig Björkman, new interviews with actors Emily Watson and Stellan Skarsgård, interview from 2004 with actor Adrian Rawlins, excerpts from Watson's audition tape, with commentary by von Trier, deleted scene featuring late actor Katrin Cartlidge and a booklet featuring an essay by critic David Sterritt and an excerpt from the 1999 book \"Trier on von Trier\"."]}, {"page": "Annie Chapman", "response": ["* From Hell. (2001). Directed by the Hughes Brothers, the film casts Katrin Cartlidge as Annie Chapman."]}, {"page": "Topsy-Turvy", "response": ["* Katrin Cartlidge as the madame of a Paris brothel"]}, {"page": "Eat the Rich (film)", "response": ["* Katrin Cartlidge as Katrin"]}, {"page": "Naked (1993 film)", "response": ["* Katrin Cartlidge as Sophie"]}, {"page": "List of pneumonia deaths", "response": ["| Katrin Cartlidge"]}, {"page": "List of female movie actors by name: C", "response": ["*Katrin Cartlidge (1961–2002)"]}, {"page": "Katrin", "response": ["*Katrin Cartlidge (1961–2002), British actress"]}, {"page": "Evening Standard British Film Awards", "response": ["*Best Actress : Katrin Cartlidge – Career Girls"]}, {"page": "Career Girls", "response": ["Career Girls is a 1997 British comedy-drama film written and directed by Mike Leigh which tells the story of two women, who reunite after six years apart. The film stars Katrin Cartlidge and Lynda Steadman. The women were originally thrown together when they shared a flat while at university and the film focuses on their interpersonal relationship.", "* Katrin Cartlidge as Hannah Mills", "**Nominated: Best Actress – Leading Role (Katrin Cartlidge)", "**Won: Best Actress (Katrin Cartlidge)"]}, {"page": "List of Brookside characters", "response": ["|rowspan=\"2\"|Lucy Collins || Katrin Cartlidge || 1982–1984, 1990"]}, {"page": "Jonathan Cake", "response": ["After appearing in episodes of Frank Stubbs Promotes and Goodnight Sweetheart, Cake was cast as Gareth in the BBC series Degrees of Error (1995), opposite Beth Goddard, Julian Glover and Phyllida Law. He then played Ewan in two episodes of the series Grange Hill (1996), Nat in two episodes of Cold Lazarus (1996), and Hattersley in the TV miniseries adaptation of Anne Brontë's The Tenant of Wildfell Hall (1996). He was also cast in the TV films Nightlife (1996, with Katrin Cartlidge and Jane Horrocks), The Girl (1996) and Wings the Legacy (1996, with Una Stubbs). Also in 1996, Cake was in True Blue, a British sports film based on the book True Blue: The Oxford Boat Race Mutiny by Daniel Topolski and Patrick Robinson, and in an episode of The Thin Blue Line."]}, {"page": "From Hell (film)", "response": ["* Katrin Cartlidge as Annie Chapman, prostitute."]}, {"page": "Boston Society of Film Critics Awards 1997", "response": ["2. Katrin Cartlidge – Career Girls"]}, {"page": "Tourism in Bosnia and Herzegovina", "response": ["The Sarajevo Film Festival has been hosted at the National Theater, with screenings at the Open-air theater Metalac and the Bosnian Cultural Center, all located in downtown Sarajevo and has hosted such world-renowned actors, directors, and musicians as: Robert De Niro, Steve Buscemi, Bono, Coolio, John Malkovich, Morgan Freeman, Nick Nolte, Daniel Craig, Willem Dafoe, Anthony Minghella, Katrin Cartlidge, Alexander Payne, Sophie Okonedo, Stephen Frears, Michael Moore, Darren Aronofsky, Mickey Rourke, Gillian Anderson, Kevin Spacey, and many other major cultural figures from the Balkans, Europe, and the Americas."]}, {"page": "2002 in the United Kingdom", "response": ["**Katrin Cartlidge, actress (born 1961)"]}, {"page": "1961 in the United Kingdom", "response": ["*15 May – Katrin Cartlidge, actress (died 2002)"]}, {"page": "List of British Jewish entertainers", "response": ["*Katrin Cartlidge (1961–2002), actress"]}, {"page": "Boy Gets Girl", "response": ["*Royal Court Theatre, London, 2001. Directed by Ian Rickson; starring Katrin Cartlidge.\" Boy Gets Girl Reviews\" royalcourttheatre.com, accessed May 20, 2015Fisher, Phillip. Boy Gets Girl britishtheatreguide.info, accessed May 20, 2015"]}, {"page": "The Weight of Water (film)", "response": ["* Katrin Cartlidge as Karen Christenson"]}, {"page": "List of comedy films of the 1990s", "response": ["|Naked||||David Thewlis, Lesley Sharp, Katrin Cartlidge||United Kingdom||Black comedy"]}, {"page": "Independent Spirit Award for Best Female Lead", "response": ["|Katrin Cartlidge || Claire Dolan||Claire Dolan"]}, {"page": "List of British films of 1997", "response": ["|Career Girls||Mike Leigh ||Katrin Cartlidge, Lynda Steadman||Drama ||"]}, {"page": "Searching for Debra Winger", "response": ["Arquette's other subjects include her sister Patricia Arquette, Emmanuelle Béart,  Katrin Cartlidge, Laura Dern, Jane Fonda, Teri Garr, Whoopi Goldberg, Melanie Griffith, Daryl Hannah, Salma Hayek, Holly Hunter, Diane Lane, Kelly Lynch, Julianna Margulies, Chiara Mastroianni, Samantha Mathis, Frances McDormand, Catherine O'Hara, Julia Ormond, Gwyneth Paltrow, Martha Plimpton, Charlotte Rampling, Vanessa Redgrave, Theresa Russell, Meg Ryan, Ally Sheedy, Adrienne Shelly, Sharon Stone, Tracey Ullman, JoBeth Williams, Alfre Woodard, and Robin Wright Penn."]}, {"page": "Dream Publisher", "response": ["* An international audio book collection by the poet France Prešeren (featuring Vanessa Redgrave, Katrin Cartlidge, Marjana Lipovšek, Simon Callow, Blixa Bargeld, etc.)"]}, {"page": "Paul Collins (Brookside)", "response": ["Paul Collins is a fictional character from the British Channel 4 soap opera Brookside, played by Jim Wiggins. One of the show's original characters, Paul debuted during the episode broadcast on 2 November 1982. Wiggins was cast by Brookside creator Phil Redmond and Janet Goddard. Paul is introduced as the husband of Annabelle Collins (Doreen Sloane) and father to Gordon Collins (Nigel Crowley) and Lucy Collins (Katrin Cartlidge). Paul is characterised as an unlucky character who has been made redundant from a lucrative management role. He is forced to move to a small house on Brookside Close and change his lifestyle. Writers made him appear as a product of a different generation and an ex-army officer who had a sense of discipline instilled in him. Wiggins has described Paul as \"aloof\" and \"conservative\", which made viewers unsympathetic to his plight.", "The Collins children provided Paul with many of his storylines. Writers also used the Collins family to explore the issue of sexuality. Paul and Annabelle's son Gordon (Nigel Crowley, later Mark Burgess) comes out as gay and they find it difficult to accept him. The worried parents yet again \"wonder where they've gone wrong\" and blame themselves. When Gordon goes on holiday to France, Paul and Annabelle \"pray\" that the experience will change his sexuality. They incorrectly presume their son is no longer gay after a holiday. Gordon faces homophobia from the house cleaner, Carol Thompson (Geraldine Griffiths), when she assumes she will develop AIDS after cleaning the family toilet. Writers portrayed Paul unexpectedly defending Gordon and informs him that he is a victim of prejudice.Redmond 1987, p.56. Writers portrayed Paul being supportive of his daughter Lucy Collins (Katrin Cartlidge), who begins a relationship with a married man James. Paul tries to intervene and which results in James ending their affair. When Lucy begins dating Barry Grant (Paul Usher) he is less supportive and the parents once again blame themselves."]}, {"page": "European Film Award for Best Actress", "response": ["| Katrin Cartlidge||colspan=\"2\"|Career Girls || Hannah Mills"]}, {"page": "Katrin Cartlidge Foundation", "response": ["The Katrin Cartlidge Foundation is a charitable foundation established in memory of actress Katrin Cartlidge, who died suddenly and unexpectedly in 2002, at the age of 41. Through the foundation, and as referenced to the Sarajevo Film Festival, support is provided to emerging filmmakers.", "The impact of the sudden death of actress Katrin Cartlidge saw the creation of the Katrin Cartlidge Foundation by trustees Mike Leigh, Peter Gevisser, Simon McBurney, Chris Simon and Cat Villiers. Patrons include Lars von Trier and Cartlidge's sister Michelle. Established at the Sarajevo Film Festival, an annual bursary is awarded by \"an elected curator, chosen by the (Foundation) Trustees from a wide and eclectic number of Katrin Cartlidge’s friends and colleagues… (to) a new creative voice… While the new talent nominated each year will be a filmmaker, it is anticipated that the choices will be as varied and extraordinary as Katrin’s own choice of filmmakers and friends from across the arts.\"\"Katrin Cartlidge Foundation: Award\" KatrinCartlidgeFoundation.org.uk (Retrieved 24 July 2009)", "* 2012: Orwa Nyrabia and Diana El Jeiroudi, for their contribution to independent film in Syriahttp://www.screendaily.com/diana-el-jeiroudi-and-orwa-nyrabia-honoured-with-katrin-cartlidge-award/5044384.article|title: Diana El Jeiroudi and Orwa Nyrabia honoured with Katrin Cartlidge Award", "* 2009: Juanita Wilson for The Door\"Katrin Cartlidge Foundation 2009\" SFF.ba, 23 July 2009 (Retrieved 24 July 2009) at the 15th Sarajevo Film Festival", "* Katrin Cartlidge Foundation KatrinCartlidgeFoundation.org.uk "]}, {"page": "Hotel Splendide (2000 film)", "response": ["*Katrin Cartlidge as Cora Blanche"]}, {"page": "Claire Dolan", "response": ["* Katrin Cartlidge as Claire Dolan"]}, {"page": "Cartlidge", "response": ["* Katrin Cartlidge (1961–2002), English actress", "** Katrin Cartlidge Foundation"]}, {"page": "Cinderella (2000 film)", "response": ["* Katrin Cartlidge as Goneril"]}, {"page": "Gordon Collins (Brookside)", "response": ["Gordon Collins moved to Brookside Close aged 15 with his family in 1982 after his father, Paul (Jim Wiggins) loses his job.  While Lucy (Katrin Cartlidge) struggles to fit in on Brookside Close (which she refers to as 'purgatory'), Gordon settles in quicker.  Gordon is seen by Paul and his mother Annabelle (Doreen Sloane) as having better prospects than Lucy and so when they can only afford to allow one to remain at independent school, Gordon stays while Lucy has to attend the sixth-form college at Brookside Comprehensive, where she is bullied."]}, {"page": "Annabelle Collins (Brookside)", "response": ["Annabelle stories were often centric to the problems of her children, Gordon Collins (Nigel Crowley) and Lucy Collins (Katrin Cartlidge). Annabelle struggles to accept her son's homosexuality and her daughter's wayward behaviour. Producers created an affair storyline between Annabelle and Brian Lawrence (Vincent Maguire), which nearly ruined her marriage. Sloane liked the story because she believed it made Annabelle \"come alive\" and \"become human\". Other stories include training to be a magistrate and her problematic relationship with her mother, Mona Harvey (Margaret Clifton). Sloane died on 8 April 1990 after being diagnosed with cancer. She had continued to film new scenes regardless of her illness. The character made her final appearance on 9 May 1990. The Collinses departure storyline featured them moving to the Lake District to live with Mona.", "The character appears in the first ever episode of Brookside. Annabelle is characterised as an \"intelligent woman\" who had been used to a busy life before moving into Brookside Close.Redmond 1987, p.55. In the character's backstory, Annabelle was born in Birkenhead.Redmond 1987, p.100. Annabelle is portrayed as the matriarch of the Collins family consisting of herself, husband Paul Collins (Jim Wiggins) and their two children Gordon Collins (Nigel Crowley) and Lucy Collins (Katrin Cartlidge).Redmond 1987, p.53. They were introduced into the series an as upper class family who are forced to move into Brookside Close, after Paul is made redundant from a lucrative management role at the firm Petrochem. They are a nuclear family who strive for trouble-free existence.Redmond 1987, p.57. The move forced the Collinses to give up their large home and down-size. Paul is forced to take benefits and Lucy is removed from private schooling to support their new financial situation. Annabelle is a former French teacher but the move to Brookside Close sees her take on new ventures. Unable to cope with their new lives, she and Paul spiral into a depression and Annabelle starts a local ratepayers association. This puts her at odds with her neighbours, who are unable to understand her passion for the association. Writers also portrayed Annabelle at odds with Sheila Grant (Sue Johnston) when she refuses to support Sheila's women's action group during a union strike. Overtime the character adjusts to her new life and overcomes her snobbery. She also becomes accepted in the community and becomes a more neighbourly character."]}, {"page": "Merisairas", "response": ["Merisairas, also known as Seasick, is a 1996 thriller film directed by Veikko Aaltonen and starring Bob Peck, Katrin Cartlidge and Peter Firth.BFI.org An English-language film, it was a co-production between Sweden, Finland and France. The screenplay concerns eco-terrorists who attack a ship carrying toxic waste. ", "* Katrin Cartlidge – Elena Polakov"]}]}}