{"wiki_id": "http://www.wikidata.org/entity/Q2550081", "itemLabel": "Warwick Deeping", "itemDescription": "English novelist (1877-1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Warwick_Deeping", "wikipedia_page": {"main": "George Warwick Deeping (28 May 1877 – 20 April 1950) was an English novelist and short story writer, whose best-known novel was Sorrell and Son (1925).", "link_mentions": [{"page": "Smith", "response": ["* Smith, a 1932 novel by Warwick Deeping"]}, {"page": "Henry III of England", "response": ["Henry appears in King John by William Shakespeare as a minor character referred to as Prince Henry but within modern popular culture, Henry has a minimal presence and has not been a prominent subject of films, theatre or television. Historical novels which feature him as a character include Longsword, Earl of Salisbury: An Historical Romance (1762) by Thomas Leland,Fiona Price, Reinventing Liberty: Nation, Commerce and the British Historical Novel from Walpole to Scott. Edinburgh, Edinburgh University Press, 2016.  (p.28) The Red Saint (1909) by Warwick Deeping,John Marriott,  English history in English fiction. London: Blackie, 1940. (p.59) The Outlaw of Torn (1927) by Edgar Rice Burroughs, The De Montfort Legacy (1973) by Pamela Bennetts, The Queen from Provence (1979) by Jean Plaidy, The Marriage of Meggotta (1979) by Edith Pargeter and Falls the Shadow (1988) by Sharon Kay Penman.Lynda G. Adamson, World Historical Fiction : An Annotated Guide to Novels for Adults and Young Adults Phoenix, Ariz. : Oryx Press, 1998.  (p.660)"]}, {"page": "1911 in literature", "response": ["*Warwick Deeping - Fox Farm"]}, {"page": "Merchant Taylors' School, Northwood", "response": ["* Warwick Deeping – novelist"]}, {"page": "1927 in literature", "response": ["*Warwick Deeping – Kitty"]}, {"page": "1933 in literature", "response": ["*Warwick Deeping – Two Black Sheep"]}, {"page": "Southend-on-Sea", "response": ["* Warwick Deeping, author"]}, {"page": "Weybridge", "response": ["Several authors have lived in Weybridge. The writer George Meredith moved to the town with his first wife in 1849. Whilst living at Weybridge he wrote The Shaving of Shagpat: An Arabian Entertainment, his first work of fiction, which was published in 1856. He moved to Box Hill in 1868. Following the Dreyfus affair, the French novelist Émile Zola (1840–1902) was exiled to England from July 1898 to June 1899, during which time he lived at the Oatlands Park Hotel. The novelist E. M. Forster (1879–1970) lived at 19 Monument Green from 1904 until 1912, during which he wrote all six of his novels. A plaque recording his residence in Weybridge was installed on the outside wall of his former home in the 1980s. The novelist Warwick Deeping lived on Brooklands Lane from 1918 until his death in 1950."]}, {"page": "Loughton", "response": ["George Pearson (1875–1973), a pioneering director and film-writer in the early years of British cinematography, was headmaster of Staples Road Junior School, Loughton 1908–1913. Charles Ashton (1884 – c. 1968), film actor from the silent movie era, lived at 20 Carroll Hill, Loughton, from 1917–34. He starred in more than 20 films between 1918–29, including the first film version of The Monkey's Paw, and Kitty, based on Warwick Deeping's novel of the same name."]}, {"page": "Monteiro Lobato", "response": ["*Sorrell and Son, by Warwick Deeping – 1942"]}, {"page": "Kitty", "response": ["* Kitty, a 1927 novel by Warwick Deeping"]}, {"page": "Ethel M. Dell", "response": ["George Orwell, in his novel Keep the Aspidistra Flying, has his protagonist make several scathing comments about Dell and others (notably, Warwick Deeping) and reserves special venom for The Way of an Eagle. He refers to her in answers to a questionnaire The Cost of Letters (1946) on the subject of a serious writer earning a living by writing."]}, {"page": "List of University of Cambridge people", "response": ["*Warwick Deeping (Trinity)"]}, {"page": "HMT Warwick Deeping", "response": ["HMT Warwick Deeping (H136) was a naval trawler of the British Royal Naval Patrol Service during World War II, sunk off the Isle of Wight in October 1940.", "The Warwick Deeping was built in 1934 by Cochrane & Sons Shipbuilders of Selby for the Newington Steam Trawling Company of Kingston upon Hull as a North Sea fishing trawler.", "At 22:30 on the night of 11–12 October 1940 she was on patrol in the English Channel, about  south of the Isle of Wight, in company with HMS Listrac (former French armed merchant ship),  when she encountered five German torpedo boats; Falke, Wolfe, Greif, Kondor and Seeadler which had sailed from Cherbourg to sortie along the English coast. The two British ships soon found themselves under fire, and Listrac, believing that the German ships were Royal Navy vessels attacking in error switched on her identification lights. She was promptly shelled, causing a large explosion aboard, and then torpedoed and sunk, with the loss of her captain and 11 men. The Warwick Deeping attempted to escape, but was relentlessly attacked, and hit by a torpedo, which failed to explode. She was hit several times by shells, one of which finally disabled her engines. Now helpless and sinking, the crew abandoned the ship, but instead of delivering the coup de grace the German torpedo boats unexpectedly broke off their attack and sailed away. An hour later all 22 crew were rescued.", "The Warwick Deeping lies in  of water at  and is a popular wreck diving site."]}, {"page": "Love Among the Ruins", "response": ["* Love Among the Ruins, a novel by Warwick Deeping"]}, {"page": "Sorrell and Son (1927 film)", "response": ["Sorrell and Son is a 1927 American silent drama film released on December 2, 1927 and nominated for the Academy Award for Best Director at the 1st Academy Awards the following year. The film was based on the 1925 novel of the same name by Warwick Deeping, Sorrell and Son, which became and remained a bestseller throughout the 1920s and 1930s."]}, {"page": "Epic Pooh", "response": ["Moorcock's most recent revisions to the piece add mention of such authors as Pratchett and Rowling and drop those whose names would be less familiar today (Moorcock also has claimed that Philip Pullman's His Dark Materials deserved credit, though the essay was written and revised before those books were published). As an example, from the original \"... are successful. It is the tone of Warwick Deeping's Sorrell and Son, of John Steinbeck at his worst, or, in a more sophisticated form...\" and from the revised version \"... are successful. It is the tone of many forgotten British and American bestsellers, well-remembered children's books, like The Wind in the Willows, you often hear it in regional fiction addressed to a local audience, or, in a more sophisticated form...\""]}, {"page": "The Road (disambiguation)", "response": ["*The Road, or The Ten Commandments, a 1931 novel by Warwick Deeping"]}, {"page": "Ethel Mannin", "response": ["*Three New Love Stories (1925) with Warwick Deeping and Gilbert Frankau"]}, {"page": "Publishers Weekly list of bestselling novels in the United States in the 1920s", "response": ["# Sorrell and Son by Warwick Deeping", "# Doomsday by Warwick Deeping", "# Sorrell and Son by Warwick Deeping", "# Old Pybus by Warwick Deeping", "# Roper's Row by Warwick Deeping"]}, {"page": "Publishers Weekly list of bestselling novels in the United States in the 1930s", "response": ["# Exile by Warwick Deeping", "# The Bridge of Desire by Warwick Deeping", "# Old Wine and New by Warwick Deeping"]}, {"page": "Doomsday (novel)", "response": ["Doomsday is a novel by Warwick Deeping which was published in 1927.", "Category:Novels by Warwick Deeping"]}, {"page": "1925 in the United Kingdom", "response": ["* Warwick Deeping's novel Sorrell and Son."]}, {"page": "Warwick Deeping (novelist)", "response": ["#REDIRECT Warwick Deeping"]}, {"page": "The Man Who Went Back", "response": ["The Man Who Went Back (1940) is an adventure novel by Warwick Deeping about a man who has a car accident in 1939 England. He is transported back into post-Roman Britain and has to contend with the knowledge that he is from the future, in the past.", "Category:Novels by Warwick Deeping"]}, {"page": "Deeping", "response": ["* Warwick Deeping (1877-1950), English author", "* HMT Warwick Deeping, British anti-submarine trawler in World War II"]}, {"page": "Physician writer", "response": ["*Warwick Deeping (1877–1950) prolific English novelist and short story writer; most famous novel is Sorrell and Son (1925)"]}, {"page": "Gurney Slade", "response": ["* Mr Gurney and Mr Slade, a book by Warwick Deeping"]}, {"page": "Fox House", "response": ["* Fox Farm (novel), a 1911 novel by the British writer Warwick Deeping"]}, {"page": "Cassell's Magazine", "response": ["In the 1890s, under Pemberton's editorship, the magazine was based on the Strand Magazine, attempting to be a competitor to that periodical. Contributing authors included Wilkie Collins, whose 1870 novel Man and Wife raised the magazine's circulation to 70,000. Following the success of George Newnes's Tit-Bits, the Strand Magazine and Alfred Harmsworth's Answers, Cassell's began publishing a combination of journalistic miscellanea and illustrated fiction by popular novelists such as Robert Louis Stevenson, Arthur Quiller-Couch, Sheridan Le Fanu, J. M. Barrie, P. G. Wodehouse, Marjorie Bowen and Warwick Deeping. The Examiner,Launceston, Tasmania, 6 January, 1917,  (p. 8).  "]}, {"page": "Bright young things", "response": ["|Warwick Deeping (1877–1950)"]}, {"page": "Kitty (1929 film)", "response": ["Kitty is a 1929 British drama film directed by Victor Saville and starring Estelle Brody and John Stuart.  The film was adapted from the 1927 novel of the same name by Warwick Deeping and marked the third co-star billing of Brody and Stuart, who had previously proved a very popular screen pairing in Mademoiselle from Armentieres (1926) and Hindle Wakes (1927)."]}, {"page": "The Strange World of Gurney Slade", "response": ["There is also a 1944 novel by Warwick Deeping called Mr Gurney and Mr Slade, also known as The Cleric's Secret."]}]}}