{"wiki_id": "http://www.wikidata.org/entity/Q255384", "itemLabel": "Malcolm Archer", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Malcolm_Archer", "wikipedia_page": {"main": "Malcolm Archer (born 1952) is an English composer, conductor and organist. He combines this work with a recital career.  Archer was formerly Organist and Director of Music at Bristol Cathedral, Wells Cathedral and at St Paul's Cathedral and Director of Chapel Music at Winchester College. He married Alison (an artist and musician) in 1994, and they have a son (b.1997) and a daughter. (b.1999)", "link_mentions": [{"page": "St Paul's Cathedral", "response": ["The Director of Music is Andrew Carwood. Carwood was appointed to succeed Malcolm Archer as Director of Music, taking up the post in September 2007. He is the first non-organist to hold the post since the 12th century."]}, {"page": "Bristol Cathedral", "response": ["The earliest known appointment of an organist of Bristol Cathedral is Thomas Denny in 1542. Notable organists have included the writer and composer Percy Buck and the conductor Malcolm Archer. The present Organist is Mark Lee and the Assistant Organist Paul Walton."]}, {"page": "Wells Cathedral", "response": ["The first recorded organist of Wells was Walter Bagele (or Vageler) in 1416. The post of organist or assistant organist has been held by more than 60 people since. Peter Stanley Lyons was Master of Choristers at Wells Cathedral, and Director of Music at Wells Cathedral School in 1954–1960.Entry in Register of Twentieth Century Johnians, Volume I, 1900–1949. St John's College, Cambridge.Obituary of P. S. Lyons, Rutland and Stamford Mercury, Friday, 20 April 2007. The choral conductor James William Webb-Jones, father of Lyons's wife Bridget, whom he married in the cathedral, was Headmaster of Wells Cathedral School in 1955–1960. Malcolm Archer was the appointed Organist and Master of the Choristers in 1996–2004. Matthew Owens was the appointed organist from 2005 to 2019. The current Organist and Master of the Choristers is Jeremy Cole."]}, {"page": "Ave verum corpus", "response": ["There is a version by Franz Liszt [Searle 44], and also ones by Camille Saint-Saëns, Orlande de Lassus, Imant Raminsh, Alexandre Guilmant, William Mathias, Colin Mawby, Malcolm Archer and Jack Gibbons. Liszt also composed a fantasy on Mozart's work, preceded by a version of Allegri's celebrated Miserere, under the title  [Searle 461 – two versions]. Versions of this fantasy for orchestra [Searle 360] and piano four-hands [Searle 633] follow closely the second version for piano. "]}, {"page": "List of University of Cambridge people", "response": ["*Malcolm Archer (Jesus)"]}, {"page": "List of Anglican church composers", "response": ["*Malcolm Archer"]}, {"page": "For All the Saints", "response": ["*For all the Saints, sung by the choir of St. Paul's Cathedral (dir. Malcolm Archer)"]}, {"page": "Archer (surname)", "response": ["* Malcolm Archer (born 1952), British composer, organist, and conductor"]}, {"page": "King Edward VII and Queen Mary School", "response": ["*Malcolm Archer (born 1952), Organist and Director of Music, St Paul's Cathedral"]}, {"page": "List of organists", "response": ["* Malcolm Archer (born 1952)"]}, {"page": "List of British classical composers", "response": ["*Malcolm Archer (born 1952)"]}, {"page": "Andrew Carwood", "response": ["He was appointed to succeed Malcolm Archer as Director of Music at St Paul's Cathedral, London, taking up the post in September 2007, the first non-organist to hold the post since the 12th century."]}, {"page": "Malcolm archer", "response": ["#REDIRECT Malcolm Archer "]}, {"page": "City of Bristol Choir", "response": ["City of Bristol Choir was formed in 1991 by Malcolm Archer  (now organist and director of music at Winchester College). The choir now enjoys a busy schedule of concerts and events under the direction of David Ogden, who was appointed Director of Music in 2000."]}, {"page": "Malcolm (given name)", "response": ["*Malcolm Archer (born 1952), English organist, conductor, and composer"]}, {"page": "Winchester College Chapel Choir", "response": ["The Director of Chapel Music at Winchester College is Howard Ionascu (as of December 2018), previously Director of the Junior Academy at the Royal Academy of Music.  Previous directors include David Hurley (2017 – 2018), Malcolm Archer (2007 – 2017), Christopher Tolley (1992–2007), Julian Smith (1977–1992) and Raymond Humphrey (1970–1977)."]}, {"page": "Choir of Leeds Parish Church", "response": ["The parish church uses the New English Hymnal and its 2006 supplement \"New English Praise\" 2006; the Worcester Psalter edited by Sir Ivor Atkins provides the pointing of the psalms. Other collections include Anthems for Unison and Two-Part Singing, Volumes and 2 RSCM, Anthems for Men's Voices, the Favourite Anthem Book Volume 5, Sing Low Novello edited by Dr Barry Rose, Advent for Choirs edited by Malcolm Archer & Stephen Cleobury, Lent, Passiontide and Easter for Choirs edited by Lionel Dakers and John Scott, Hilariter [RSCM Ripon and Leeds] - a resource book for Eastertide edited by Simon Lindley, The University Carol Book - edited by Dr Erik Routley and Hymns for Choirs edited by Sir David Willcocks, and 100 Carols for Choirs edited by Sir David Willcocks and John Rutter."]}, {"page": "Southern Cathedrals Festival", "response": ["*2004 Malcolm Archer: Benedicite"]}, {"page": "A Song to David", "response": ["Four stanzas of the poem were set as the anthem \"Praise Above All, for Praise Prevails\" by the British composer Malcolm Archer specifically to celebrate the 300th anniversary of the founding of the Parish Church of St. Helena, Beaufort, South Carolina, in 2012."]}]}}