{"wiki_id": "http://www.wikidata.org/entity/Q2553573", "itemLabel": "Thomas Wilson Barnes", "itemDescription": "British chess player", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Wilson_Barnes", "wikipedia_page": {"main": "Thomas Wilson Barnes (1825–1874) was an English chess master, one of the leading British masters of his time.", "link_mentions": [{"page": "List of chess players", "response": ["* Thomas Wilson Barnes (England, 1825–1874)"]}, {"page": "Paul Morphy", "response": ["In Europe, Morphy was generally hailed as world chess champion. In Paris, at a banquet held in his honor on April 4, 1859, a laurel wreath was placed over the head of a bust of Morphy, carved by the sculptor Eugène-Louis Lequesne. Morphy was declared by the assembly \"the best chess player that ever lived.\" At a similar gathering in London, where he returned in the spring of 1859, Morphy was again proclaimed \"the Champion of the World\". He was also invited to a private audience with Queen Victoria. So dominant was Morphy that even masters could not seriously challenge him in play without some kind of handicap. At a simultaneous match against five masters, Morphy won two games against Jules Arnous de Rivière and Henry Edward Bird, drew two games with Samuel Boden and Johann Jacob Löwenthal, and lost one to Thomas Wilson Barnes.Géza Maróczy, Paul Morphy. Sammlung der von ihm gespielten Partien mit ausführlichen Erläuterungen, Veit und Comp., Leipzig 1909. Reprinted by Olms-Verlag, Zürich 1979."]}, {"page": "List of world records in chess", "response": ["Paul Morphy also gave an impressive exhibition. On April 26, 1859, at London's St. James Chess Club, Morphy played \"five games simultaneously against a group of masters who could be described as among the top ten players of the day\", scoring 3–2. He defeated Jules Arnous de Rivière and Henry Bird, drew Samuel Boden and Johann Löwenthal, and lost only to Thomas Wilson Barnes."]}, {"page": "Thomas Barnes", "response": ["*Thomas Wilson Barnes (1825–1874), English chess master"]}, {"page": "Thomas Barnes (chess player)", "response": ["#redirect Thomas Wilson Barnes"]}, {"page": "List of eponyms (A–K)", "response": ["* Thomas Wilson Barnes, British chess master – Barnes Defence, Barnes Opening"]}, {"page": "Jules Arnous de Rivière", "response": ["Arnous-Rivière fared poorly in his casual games against Morphy, but did well in more formal match play.  He lost to Serafino Dubois (+8-21=3) in 1855, and Gustav Neumann (+3-7=2) in 1864, but he drew with Ignatz von Kolisch (5:5) in 1859, and defeated Thomas Wilson Barnes in London (+5−2=0) and Paul Journoud in Paris (+7−2=1) in 1860, and Johann Löwenthal (+2−0=0) in Paris in 1867. He also lost a close match to Mikhail Chigorin by +4−5=1 in 1883."]}, {"page": "Andria Dadiani", "response": ["Andrei Dadiani learned to play chess from his parents. In 1864 he met Thomas Wilson Barnes while vacationing in Homberg, Germany. Under Barnes's tutelage, Dadian won his first tournament at Homberg that year. In 1867 Dadian met Ignatz Kolisch who had just won the Paris tournament. He played Kolisch and won a few games."]}, {"page": "Barnes Opening", "response": ["The opening is named after Thomas Wilson Barnes (1825–1874), an English player who had an impressive eight wins over Paul Morphy, including one game where Barnes answered 1.e4 with 1...f6, known as Barnes Defence."]}, {"page": "King's Pawn Game", "response": ["* 1... f6 is known as the Barnes Defence after Thomas Wilson Barnes. This move is clearly inferior, taking away the f6-square from the knight and weakening Black's kingside, although Barnes managed to defeat Paul Morphy with this defence in 1858.Philip W. Sergeant, Morphy's Games of Chess, Dover Publications, 1957, pp. 238–40. "]}, {"page": "Category talk:Chess players", "response": ["Thomas Wilson Barnesnot yet classified"]}, {"page": "Staunton–Morphy controversy", "response": ["Morphy arrived in Liverpool on June 20, 1858, and immediately caught the train to Birmingham. However, on arrival he found that the tournament had been postponed by two months, to August 24. Morphy traveled to London the following day but had fallen ill, and was not fit to visit the London chess clubs until June 23. The Illustrated London News, of which Staunton was the chess editor, printed an article \"Arrival of Mr. Morphy\" on June 26. At the St. George's club he met Staunton and re-issued the challenge, which Staunton accepted provided he was given a month to prepare. Although he declined to play a few casual games against Morphy, Staunton invited him to his home in Streatham, which in those days was a country village whose first railway station had opened only two years earlier. There they played a couple of consultation games, with Staunton partnered by John Owen and Morphy by Thomas Wilson Barnes. The Morphy-Barnes team defeated Staunton-Owen in both consultation games. A little later Staunton proposed that they delay their match until after the Birmingham tournament in August, and Morphy reluctantly agreed. Staunton announced in the Illustrated London News:"]}, {"page": "List of chess openings named after people", "response": ["*Barnes Opening – 1.f3 – named after Thomas Wilson Barnes;"]}]}}