{"wiki_id": "http://www.wikidata.org/entity/Q2553140", "itemLabel": "Anthony Buckeridge", "itemDescription": "author (1912-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Buckeridge", "wikipedia_page": {"main": "Anthony Malcolm Buckeridge  (20 June 1912 – 28 June 2004) was an English author, best known for his Jennings and Rex Milligan series of children's books. He also wrote the 1953 children's book A Funny Thing Happened which was serialised more than once on Children's Hour.\nHe was awarded the OBE in 2003.\n\n", "link_mentions": [{"page": "June 28", "response": ["*2004 – Anthony Buckeridge, English author (b. 1912)"]}, {"page": "June 20", "response": ["*1912 – Anthony Buckeridge, English author (d. 2004)"]}, {"page": "Children's literature", "response": ["Boarding schools in literature are centred on older pre-adolescent and adolescent school life, and are most commonly set in English boarding schools. Popular school stories from this period include Ronald Searle's comic St Trinian's (1949–1953) and his illustrations for Geoffrey Willans's Molesworth series, Jill Murphy's The Worst Witch, and the Jennings series by Anthony Buckeridge."]}, {"page": "Stephen Fry", "response": ["Fry has been the reader for the British versions of all of J. K. Rowling's Harry Potter series of audiobooks. He discussed this project in an interview with Rowling in 2005. He has also read for Douglas Adams' The Hitchhiker's Guide to the Galaxy film tie-in edition and has made recordings of his own books, such as The Stars' Tennis Balls and Moab Is My Washpot, and of works by Roald Dahl, Michael Bond, A. A. Milne, Anthony Buckeridge, Eleanor Updale, George Orwell, and Alexander Pushkin. In June 2015, Fry backed children's fairy tale app GivingTales in aid of UNICEF together with other British celebrities Sir Roger Moore, Ewan McGregor, Dame Joan Collins, Joanna Lumley, Michael Caine, David Walliams, Charlotte Rampling, Paul McKenna and Michael Ball."]}, {"page": "List of children's literature writers", "response": ["*Anthony Buckeridge (1912–2004) – Jennings school stories"]}, {"page": "School and university in literature", "response": ["* Anthony Buckeridge: Jennings series"]}, {"page": "1912 in literature", "response": ["*June 20 – Anthony Buckeridge, English children's author (died 2004)"]}, {"page": "1950 in literature", "response": ["*Anthony Buckeridge – Jennings Goes to School"]}, {"page": "The Boat Race", "response": ["In Missee Lee by Arthur Ransome (one of the Swallows and Amazons series of children's books) Captain Flint (who had dropped out of Oxford) tells Missee Lee he was in gaol once on Boat-race night. High spirits. A fancy for policemen's helmets. When Missee Lee says Camblidge won and evellybody happy he replies Not that year, ma'am. We were the happy ones that year.Missee Lee chapter 16  In the Jennings books by Anthony Buckeridge the protagonist's teacher Mr Wilkins is a former Cambridge rowing blue.  The 1969 film The Magic Christian features the Boat Race, as Sir Guy makes use of the Oxford crew in one of his elaborate pranks."]}, {"page": "Jennings (novel series)", "response": ["The Jennings series is a collection of novels written by Anthony Buckeridge (1912–2004) as children's literature which concern the humorous escapades of J.C.T. Jennings, a schoolboy at Linbury Court preparatory school in England. There are 24 novels in the series, excluding reprints and other material. The first of the series, Jennings Goes to School, appeared in 1950, and new titles were published regularly until the mid-1970s (including Jennings at Large, published in 1977, the only novel to feature Jennings during the school holidays). The two final volumes were published in the 1990s: Jennings Again in 1991, and That's Jennings  in 1994.", "In 1980, there was a stage play called Jennings Abounding! (not based on the novel of that title) aimed at the schools market. Described as a comedy with music, with book and lyrics by Anthony Buckeridge, music by Hector Cortes and William Gomez, and additional music and arrangement by Nigel Carver.", "\"Jennings Goes to School\" and \"Jennings Again!\" were adapted for radio by Anthony Buckeridge, and read by Stephen Fry.  The adaptations were released on audio cassette in 1991., ZBBC 1226.  \"Jennings' Little Hut\" was broadcast on BBC Radio 4 in 2010, narrated by Mark Williams."]}, {"page": "Jeremy Clarkson", "response": ["He played the role of a preparatory school pupil, Atkinson, in a BBC radio Children's Hour serial adaptation of Anthony Buckeridge's Jennings novels until his voice broke."]}, {"page": "2004 in the United Kingdom", "response": ["* 28 June – Anthony Buckeridge, writer (born 1912)"]}, {"page": "Rex Milligan", "response": ["#REDIRECT Anthony Buckeridge#Rex Milligan"]}, {"page": "Seaford College", "response": ["Seaford College is an independent co-educational boarding and day school at East Lavington, south of Petworth, West Sussex, England.Seaford College – Reviews, Rankings, Reports, Stats & News 2009/10 Founded in 1884, it is a member of the Headmasters' and Headmistresses' Conference. The college is in Lavington Park, a  Area of Outstanding Natural Beauty in the South Downs. The land is owned by a charitable trust and the site is run by the Board of Governors who are the trustees. The college is the inspiration for the Jennings and Darbishire children's books, written by alumnus Anthony Buckeridge.", "*Anthony Buckeridge , children's author"]}, {"page": "Preparatory school (United Kingdom)", "response": ["* Anthony Buckeridge's 'Jennings' series set at 'Linbury Court'."]}, {"page": "School story", "response": ["Commercially successful authors of school novels include writers for boys, such as P. G. Wodehouse, Anthony Buckeridge, and prolific writer Charles Hamilton, better known as Frank Richards, who wrote the Greyfriars School series, St. Jim's and Rookwood, and others for the Amalgamated Press between 1906 and 1940, his most famous character being Billy Bunter. Writers for girls include Angela Brazil, Enid Blyton, Elinor Brent-Dyer, Dorita Fairlie Bruce, Mary Gervaise and Elsie Oxenham.", "*Anthony Buckeridge (Jennings in a boarding school, Rex Milligan in a grammar school)"]}, {"page": "Angela Brazil", "response": ["Boys' school stories were popular from the 1870s until the 1930s and continued to find an audience into the 1970s. Prominent writers included Talbot Baines Reed, and Charles Hamilton, who wrote under a number of pen names, including Frank Richards, as author of the successful Greyfriars School series. Anthony Buckeridge later wrote the Jennings books. Themes between boys' and girls' school fiction had some commonality, such as sports, honour, and friendship."]}, {"page": "Oxford \"-er\"", "response": ["Test Match Special aside, by the mid-20th century the \"-er\" was being replaced by snappier nicknames. Thus, in the stories of Anthony Buckeridge (1912–2004), set in a preparatory school of the 1950s, Jennings was \"Jen\", and not \"Jenners\". Even so, in the Harry Potter books of J. K. Rowling (b. 1965), Dudley Dursley was addressed as Dudders."]}, {"page": "Harry Potter influences and analogues", "response": ["The Harry Potter series draws upon a long literary tradition of stories set in boarding schools. This school story genre originated in the Victorian era with Tom Brown's Schooldays, by Thomas Hughes. Tom Brown's Schooldays laid down a basic structure which has been widely imitated, for example in Anthony Buckeridge's 1950s Jennings books."]}, {"page": "1912 in the United Kingdom", "response": ["* 20 June – Anthony Buckeridge, author (died 2004)"]}, {"page": "List of people from Thanet", "response": ["*Anthony Buckeridge (20 June 1912 – 28 June 2004), author best known for his Jennings series of novels, lived in Ramsgate and taught at St. Lawrence College."]}, {"page": "List of people from Lewes, East Sussex", "response": ["*Anthony Buckeridge (1912–2004), children's author, noted for his Jennings series, lived near Lewes from 1962 until his death."]}, {"page": "Public school (United Kingdom)", "response": ["Rugby School inspired a whole new genre of literature, i.e. the school story. Thomas Hughes's Tom Brown's School Days, published in 1857 was set there. There were however as many as 90 earlier novels set in British boarding schools, taking as an example just girls' school stories, published between Sarah Fielding's 1749 The Governess, or The Little Female Academy and the seminal 1857 Tom Brown's School Days. Such stories were set in a variety of institutions including private boarding and prep schools as well as public schools. Tom Brown's School Days influence on the genre of British school novels includes the fictional boarding schools of Talbot Baines Reed's St Dominic's, Rudyard Kipling's Stalky & Co. at \"the College\", Frank Richards' Billy Bunter at Greyfriars School, James Hilton's Mr Chips at Brookfield, Anthony Buckeridge's Jennings at Linbury Court, P. G. Wodehouse's St. Austin's and girls' schools Malory Towers and St. Trinian's. It also influenced J. K. Rowling's Harry Potter series, set at the fictional boarding school Hogwarts. The series' first novel Harry Potter and the Philosopher's Stone has many direct parallels in structure and theme to Tom Brown's School Days."]}, {"page": "Olivier Séchan", "response": ["He became a director at the publishing firm Hachette. He began writing children's books that were published in the famous Bibliothèque rose and Bibliothèque verte series. He created the recurring characters Luc and Martine, and translated many of the Jennings novels of Anthony Buckeridge. His work for young readers proved very popular."]}, {"page": "Buckeridge", "response": ["*Anthony Buckeridge (1912–2004), English author"]}, {"page": "List of children's book series", "response": ["|Anthony Buckeridge"]}, {"page": "June 1912", "response": ["** Anthony Buckeridge, English children's writer, known for the Jennings series, in London (d. 2004) "]}, {"page": "Deaths in June 2004", "response": ["*Anthony Buckeridge, 92, English author, creator of the Jennings books."]}, {"page": "Darbishire", "response": ["*Charles Edwin Jeremy Darbishire, the school friend of John Jennings in the Jennings novels by Anthony Buckeridge"]}]}}