{"wiki_id": "http://www.wikidata.org/entity/Q2553986", "itemLabel": "Mark Lindsay Chapman", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Lindsay_Chapman", "wikipedia_page": {"main": "Mark Lindsay Chapman (born 8 September 1954) is an English actor. He is known for his roles as Chief Officer Henry Wilde in the film Titanic (1997), as John Lennon in the film Chapter 27 (2007) and as Dr. Anton Arcane on the USA Network TV series Swamp Thing from 1990–1993.", "link_mentions": [{"page": "September 8", "response": ["*1954 – Mark Lindsay Chapman, English actor"]}, {"page": "Titanic (1997 film)", "response": ["* Mark Lindsay Chapman as Chief Officer Henry Wilde: The ship's chief officer, who lets Cal on board a lifeboat because he has a child in his arms. Before he dies, he tries to get the boats to return to the sinking site to rescue passengers by blowing his whistle. After he freezes to death, Rose uses his whistle to attract the attention of Fifth Officer Lowe, which leads to her rescue."]}, {"page": "Four Past Midnight", "response": ["The Langoliers was adapted for a two-part TV movie in 1994. The TV movie stars Kate Maberly, Kimber Riddle, Patricia Wettig, Mark Lindsay Chapman, Frankie Faison, Baxter Harris, Dean Stockwell, David Morse, Christopher Collet, and Bronson Pinchot."]}, {"page": "2001 in film", "response": ["| Beethoven's 4th || Universal Studios Home Entertainment || David Mickey Evans (director); John Loy (screenplay); Judge Reinhold, Julia Sweeney, Joe Pichler, Matt McCoy, Veanne Cox, Jeff Coopwood, Dorien Wilson, Mark Lindsay Chapman, Art LaFleur, Dr. Joyce Brothers, David Mickey Evans, Michaela Gallo, Kaleigh Krish, Nick Meaney, Natalie Elizabeth Marston, June Lu || Comedy, Family || Live action"]}, {"page": "1995 in film", "response": ["| Stephen King's The Langoliers || ABC / Laurel Entertainment || Tom Holland (director/screenplay); Patricia Wettig, Dean Stockwell, David Morse, Mark Lindsay Chapman, Frankie Faison, Baxter Harris, Kimber Riddle, Christopher Collet, Kate Maberly, Bronson Pinchot, John Griesemer, Stephen King, Tom Holland || Horror, Mystery, Sci-Fi || Live action"]}, {"page": "1997 in film", "response": ["| Titanic || 20th Century Fox / Paramount Pictures || James Cameron (director/screenplay); Leonardo DiCaprio, Kate Winslet, Billy Zane, Kathy Bates, Frances Fisher, Bernard Hill, Jonathan Hyde, Danny Nucci, Gloria Stuart, David Warner, Victor Garber, Bill Paxton, Eric Braeden, Ioan Gruffudd, Bernard Fox, Suzy Amis, Jason Barry, Michael Ensign, Jonathan Evans-Jones, Mark Lindsay Chapman, Ewan Stewart, Jonathan Phillips, Simon Crane, Edward Fletcher, James Lancaster, Lew Palter, Elsa Raven, Martin Jarvis, Rosalind Ayres, Rochelle Rose, Scott G. Anderson, Paul Brightwell, Martin East, Gregory Cooke, Craig Kelly, Liam Tuohy, Terry Forrestal, Lewis Abernathy, Nicholas Cascone, Anatoly Sagalevich, Anders Falk, Edward Kamuda, Karen Kamuda || Period, Action, Drama, Romance || Live action"]}, {"page": "Murder, She Wrote", "response": ["* Mark Lindsay Chapman (1987-1995)"]}, {"page": "Mark Chapman", "response": ["* Mark Lindsay Chapman (born 1954), English film and television actor"]}, {"page": "Beethoven's 4th (film)", "response": ["* Mark Lindsay Chapman as Jonathan \"Johnnie\" Simmons"]}, {"page": "Eric Menyuk", "response": ["Menyuk was in the running to play the android character Data in Star Trek: The Next Generation. A memo from John Pike to John Ferrard dated April 13, 1987, listed Menyuk as one of several actors who were in contention for the role, also including Mark Lindsay Chapman, Kevin Peter Hall, and Kelvin Han Yee. Brent Spiner was eventually chosen for the role over Menyuk."]}, {"page": "Anton Arcane", "response": ["* Anton Arcane appears in 1990's Swamp Thing: The Series, portrayed by Mark Lindsay Chapman."]}, {"page": "Chapter 27", "response": ["Twenty-two years prior to this film's production, actor Mark Lindsay Chapman, while professionally using the name Mark Lindsay, had been almost cast as John Lennon in the biopic John and Yoko: A Love Story (1985). Yoko Ono had been deeply involved in the production and had herself been initially impressed with his audition and approved his casting prior to discovering his full name was Mark Lindsay Chapman. She then nixed his casting on the grounds it was \"bad karma\", and a great deal of press attention was given to his having almost gotten the role. The director of Chapter 27, Jarrett Schaefer, auditioned many Lennon impersonators, but was especially impressed with Mark Lindsay Chapman's tape because he conveyed the \"tough town\" street-smart quality of Lennon that the impersonators failed to convey, as they always played Lennon as larger-than-life. Schaefer described Lennon as having a \"chip on his shoulder and always cracking these cynical one-liners\", and felt that actor Chapman was best at conveying this quality. Schaefer had some difficulty negotiating the casting with the film's producers because of Chapman's name. After Chapman was cast, he asked Chapman how he should be billed to which Chapman replied \"Mark fucking Lindsay Chapman. That's my fucking name.\" Schaefer remarks that this was so reflective of how Lennon talked, it just reinforced his sense that Chapman was right for the part."]}, {"page": "Henry Tingle Wilde", "response": ["*Mark Lindsay Chapman (1997) (Titanic)"]}, {"page": "List of films at the 2007 Sundance Film Festival", "response": ["|colspan=\"6\"| Starring Jared Leto, Judah Friedlander, Lindsay Lohan, Mark Lindsay Chapman"]}, {"page": "Swamp Thing (1990 TV series)", "response": ["The series also introduced characters like the Kipp family, as well as a completely new incarnation of Anton Arcane played by Mark Lindsay Chapman. A young boy named Jim Kipp, played by Jess Ziegler, was intended to appeal to the young audience. However, after the first 12 episodes, a decision was made to return the series to a darker tone seen in the original Swamp Thing film. Consequently, the story had Jim Kipp abducted by a South American child-stealing ring acting under Arcane's orders, and Jim never appeared again in the series. Durock noted: \"The way they wrote him out was kind of a shock to me and everybody else except for, I suppose, the writers... That's a hell of a way to meet your demise!\" Indeed, the Swamp Thing evolved as it went along. Regarding these shifts, Durock commented: \"I guess we finally got it ironed out with the next 50, we kind of tried to hit a balance\".Harris, Will A Chat with Dick Durock  Bullz-Eye.com (February 20, 2008). Retrieved on 6-27-09.", "* Mark Lindsay Chapman as Dr. Anton Arcane: A smarmy villain who attempted to steal Holland's formula and serves as his nemesis."]}, {"page": "Beethoven (franchise)", "response": ["| Mark Lindsay Chapman"]}, {"page": "Chapman (surname)", "response": ["* Mark Lindsay Chapman (born 1954), English film and television actor"]}, {"page": "John and Yoko: A Love Story", "response": ["Mark Lindsay was originally considered for the role of John Lennon. Yoko Ono had been deeply involved in the production and had herself been initially impressed with his audition and approved his casting prior to discovering his full name was Mark Lindsay Chapman. She then nixed his casting on the grounds it was \"bad karma\" as his name was similar to Mark David Chapman. Lindsay was quietly paid off and the role went to Mark McGann. Eventually Lindsay did portray Lennon, in the film Chapter 27 (2007), which ironically had Mark David Chapman as the lead character."]}, {"page": "The Langoliers (miniseries)", "response": ["* Mark Lindsay Chapman as Nick Hopewell, a British secret agent and hitman going to Boston for a final mission. He is tough, quick, yet compassionate for the other passengers with the exception of Toomy."]}, {"page": "Takashi Taniguchi", "response": ["*Chapter 27 (John Lennon (Mark Lindsay Chapman))"]}, {"page": "List of science fiction television films", "response": ["|1986||Annihilator||Michael Chapman||Mark Lindsay Chapman, Susan Blakely, Lisa Blount||United States||"]}, {"page": "Assassin's Creed III", "response": ["The main protagonist of the game is Ratonhnhaké:ton (Noah Watts), also known as Connor, a half-English, half-Mohawk assassin born in 18th-century Colonial America. Connor's supporting cast includes Achilles Davenport (Roger Aaron Brown), Connor's mentor and a retired assassin; Connor's mother Kaniehtí:io / Ziio (Kaniehtiio Horn); Connor's first mate aboard the Aquila, Robert Faulkner (Kevin McNally); and French taverner Stephane Chapheau (Shawn Baichoo), Connor's first Assassin recruit. During the game, Connor battles the Colonial Templars, who are led by his father, the British nobleman Haytham Kenway (Adrian Hough), who is playable in the first three sequences of the game. Haytham is aided by several historical figures who are portrayed as members of the Templar Order, including Charles Lee (Neil Napier), Thomas Hickey (Allen Leech), John Pitcairn (Robert Lawrenson), Benjamin Church (Harry Standjofski), William Johnson (Julian Casey), and Nicholas Biddle (Fred Tatasciore). The era also features several other historical figures such as Israel Putnam (Andreas Apergis), George Washington (Robin Atkin Downes), Thomas Jefferson (John Emmet Tracy), Mason Weems (Tod Fennell), Paul Revere (Bruce Dinsmore), Edward Braddock, Benjamin Franklin (Rick Jones), and Samuel Adams (Mark Lindsay Chapman)."]}, {"page": "List of Assassin's Creed characters", "response": ["Samuel Adams (voiced by Mark Lindsay Chapman) (1722–1803) was an American statesman, political philosopher, a Sons of Liberty Patriot and one of the Founding Fathers of the United States."]}, {"page": "Supah Ninjas", "response": ["* House of Lords: A British crime group whose weapons were cricket paddles and are led by Sir Nigel Wickett. They were after Kickbutt (Lucas Cruikshank) after he stole their money. They are defeated by the ninjas and Kickbutt. Two of them are portrayed by Mark Lindsay Chapman and Ray Park."]}, {"page": "Silk Hope", "response": ["*Mark Lindsay Chapman as Ted Bass "]}, {"page": "Bram Stoker's Legend of the Mummy", "response": ["*Mark Lindsay Chapman as Daw"]}, {"page": "Annihilator (film)", "response": ["Annihilator is a 1986 science fiction television film directed by Michael Chapman and starring Mark Lindsay Chapman, Catherine Mary Stewart, Susan Blakely and Lisa Blount. It was an unsold pilot for a potential TV series.", "* Mark Lindsay Chapman as Robert Armour"]}]}}