{"wiki_id": "http://www.wikidata.org/entity/Q2567620", "itemLabel": "Jim Lea", "itemDescription": "British musician, songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Jim_Lea_(musician)", "wikipedia_page": {"main": "James Whild Lea (born 14 June 1949) is an English musician, most notable for playing bass guitar, keyboards, piano, violin, and guitar, and singing backing vocals in Slade from their inception until 1992, and for co-writing most of their songs.", "link_mentions": [{"page": "June 14", "response": ["*1949 – Jim Lea, English singer-songwriter, bass player, and producer "]}, {"page": "Christmas music", "response": ["| 10 || \"Merry Xmas Everybody\" || , Jim Lea|| Slade || 1974"]}, {"page": "The Specials", "response": ["A 1994 single credited to \"X Specials\" featured Staple, Golding, Radiation, and Panter. A cover of the Slade song \"Coz I Love You\", the project was produced by Slade's Jim Lea."]}, {"page": "Slade", "response": ["Slade are  a British rock band formed in Wolverhampton in 1966. They rose to prominence during the glam rock era in the early 1970s, achieving 17 consecutive top 20 hits and six number ones on the UK Singles Chart. The British Hit Singles & Albums names them the most successful British group of the 1970s based on sales of singles. They were the first act to have three singles enter the charts at number one; all six of the band's chart-toppers were penned by Noddy Holder and Jim Lea. As of 2006, total UK sales stand at 6,520,171, and their best-selling single, \"Merry Xmas Everybody\", has sold in excess of one million copies. According to the 1999 BBC documentary It's Slade, the band have sold over 50 million records worldwide.", "All the members of Slade grew up in the Black Country. Drummer Don Powell and bassist Jim Lea were born and brought up in Wolverhampton, lead vocalist Noddy Holder was born and brought up in nearby Caldmore, and lead guitarist Dave Hill moved to Wolverhampton from Holbeton as a child. Slade have released over 30 albums, three of which reached No. 1 in the UK Albums Chart. Their releases have spent 315 weeks in the UK charts and they have earned 24 top-30 UK hits .", "The Mavericks and the 'N Betweens were on their way to separate gigs in Germany when they met on a ferry in 1965. Powell and Hill asked Holder if he would be interested in joining The 'N Betweens, but Holder declined. Later, back in their home town of Wolverhampton, the musicians met again and this time Holder agreed to join the group. Jim Lea, whose musical background and strong bass guitar skills were considered an asset, had already been recruited. Lea, who also played the piano and violin, had been in the Staffordshire Youth Orchestra and had gained first class honours in a London music-school practical exam.", "In early 1974, the band were voted the number one foreign group by Spain's biggest music magazine of the time and were voted best overseas group in Finland, Belgium and Ireland.Slade Fan Club Newsletter January – February 1974Slade Fan Club Newsletter April – May 1974 The Disc Music Awards rated Slade as the best live group and top British group. Slade made number four in the \"top groups in the world\" category. Individual members were also acknowledged; Noddy Holder was number five in the best British male singers whilst Jim Lea made number nine in the top songwriter list. In the Record and Radio Mirror poll results of 1974, Slade were voted top British group, with Holder number two in the top British male singer list. Dave Hill and Jim Lea made the top British guitarist list at number one and seven respectively. Lea also appeared at number nine in the top British keyboardist list and number two in the miscellaneous instruments list. Don Powell was voted top British percussionist. The band collected the 1974 Belgian award for Best World Group.Fan Club Newsletter August – September 1974", "* Jim Lea – bass, keyboards, violin, vocals (1966–1992)", "* Jim Lea – Bass, Keyboards, Violin, Vocals"]}, {"page": "Status Quo (band)", "response": ["In August 2011, Status Quo began filming their first cinematic documentary with film director Alan G. Parker. Entitled Hello Quo!, the production opened in cinemas on 22 October 2012. A Blu-ray/DVD release followed, through Anchor Bay Productions, on 29 October. The movie included contributions from Brian May, Jeff Lynne, Cliff Richard, Joe Elliott, Paul Weller, Joe Brown, Jim Lea, Andy Scott and Steve Diggle."]}, {"page": "Bow Wow Wow", "response": ["Known simply as \"Annabella\", Lwin remained with RCA Records and her first solo release was the 1985 single \"Don't Dance With Strangers\", produced by the System. She followed up with the album Fever in 1986. The title track, a cover of the Peggy Lee classic, was recorded with and produced by multi-instrumentalist Jim Lea of Slade. Another single from the album, \"War Boys\", produced by John Robie, spent six weeks on the US Billboard Hot Dance/Disco, chart, peaking at No. 28. \"Don't Dance With Strangers\" and \"Fever\" were included on The Best of Bow Wow Wow, released by BMI on 29 October 1996."]}, {"page": "(What's the Story) Morning Glory?", "response": ["All songs written by Noel Gallagher, except \"Cum on Feel the Noize\" by Noddy Holder and Jim Lea; \"Step Out\" co-written by Stevie Wonder, Henry Cosby and Sylvia Moy."]}, {"page": "You Boyz Make Big Noize", "response": ["You Boyz Make Big Noize is the fourteenth and final studio album by the British rock group Slade. It was released on 27 April 1987 and reached No. 98 in the UK charts. The album was largely produced by bassist Jim Lea, although some tracks were produced by John Punter and Roy Thomas Baker. It was the last studio album by the original lineup, prior to their split in 1992.", "Following Slade's decision to stop touring in 1984, the band continued to record new material. The 1985 album Rogues Gallery had been a hit across Europe but saw only limited success in the UK and US. When the band set out to record their next album in 1986, they hoped to record a hit album that would put Slade back into the public eye. Initially the band hired producer Roy Thomas Baker to produce the album, but the band felt his working methods were too lengthy and expensive. In the end, Baker completed two tracks, John Punter produced another two and Jim Lea finished the rest.You Boyz Make Big Noize – Salvo 2007 remaster booklet liner notes", "*Jim Lea – bass guitar, keyboards, guitars, backing vocals, producer, arranger", "Category:Albums produced by Jim Lea"]}, {"page": "If The Beatles Had Read Hunter...The Singles", "response": ["# \"'Coz I Luv You\" (Noddy Holder/Jim Lea) (3:29) (A cover of the band Slade's 1971 single)"]}, {"page": "Noddy Holder", "response": ["Neville John \"Noddy\" Holder  (born 15 June 1946) is an English musician and actor. He was the lead singer and rhythm guitarist of the English band Slade, one of the UK's most successful acts of the 1970s. Holder co-wrote most of Slade's material with bass guitarist Jim Lea and is known for his unique and powerful voice.", "In 1966 drummer Don Powell persuaded Holder to join The 'NBetweens, a group which already included guitarist Dave Hill and bass guitarist/ keyboard player/violinist/songwriter Jim Lea. Together they formed the band Ambrose Slade, eventually to become Slade, one of Britain's top-selling rock bands. Slade also recorded some ballads, \"Everyday\" and \"How Does It Feel?\" in particular being widely acclaimed."]}, {"page": "Codsall", "response": ["* Jim Lea (born 1949), English musician; member of Slade from their inception until 1992; went to Codsall Secondary Modern School"]}, {"page": "Don Powell", "response": ["Powell became a member of The Vendors, a band that guitarist Dave Hill later joined. The Vendors became the N'Betweens and bass guitarist / keyboard player / violinist / guitarist Jim Lea joined at an audition. Powell then spotted Noddy Holder playing with Steve Brett & The Mavericks and he and Hill got Holder to join the N'Betweens. They regrouped as Ambrose Slade, changed the name to Slade and the success began."]}, {"page": "List of bass guitarists", "response": ["* Jim Lea (Slade)"]}, {"page": "1952 in British music", "response": ["*14 June – Jim Lea, guitarist (Slade)"]}, {"page": "Bilbrook, Staffordshire", "response": ["* Jim Lea (born 1949) an English musician, most notable for playing bass guitar, keyboards, piano, violin, guitar, and singing backing vocals in Slade from their inception until 1992, brought up in Bilbrook, where his parents owned The Grange pub"]}, {"page": "Annabella Lwin", "response": ["Simply calling herself \"Annabella\", she remained with RCA Records. Her first solo release was the 1985 single \"Don't Dance With Strangers\", produced by the System. She followed that up with the album Fever in 1986. The title track, a cover of the Peggy Lee classic, was produced by and recorded with multi-instrumentalist Jim Lea of Slade. Another single from the album, \"War Boys\", produced by John Robie, spent six weeks on the US Billboard Hot Dance Music/Club Play chart, peaking at No. 28. \"Don't Dance With Strangers\" and \"Fever\" were included on The Best of Bow Wow Wow, released on 29 October 1996 by BMI."]}, {"page": "Brewood", "response": ["Jim Lea of Slade lives on the outskirts. Martin Gilks, drummer of the British pop band The Wonder Stuff, grew up in Brewood. Siân Reeves, British actress most famous for playing the character Sydney Henshall in the Manchester-based television drama Cutting It, grew up in Brewood."]}, {"page": "Gibson EB-3", "response": ["* Jim Lea played an EB-3 in Slade during their most successful period in the early 1970s."]}, {"page": "Codsall Community High School", "response": ["* Jim Lea - member of Slade, perfected his electronic violin skills under the tutelage of Ron Williams"]}, {"page": "Play It Loud", "response": ["Following the lack of commercial success of their debut Beginnings, the band and their new manager Chas Chandler began considering their next career move. Having not been pleased with the debut album, Chandler thought the band would benefit from writing their own material and a change of image. He decided that the band should project a skinhead image in the effort to generate interest in the band. Both guitarist Dave Hill and bassist Jim Lea were mortified by the revised image, but the band agreed to try the idea and adopted Dr Marten boots, braces, cropped hair and aggressive \"bovver boy\" posturing.Beginnings/Play It Loud - 2006 Salvo remaster booklet liner notes", "*Jim Lea - bass, violin, backing vocals"]}, {"page": "Slade Alive!", "response": ["Today, the album has been considered one of the greatest live albums of all time. Kiss, who were heavily influenced by Slade, would title their 1975 live album Alive! as a homage to Slade Alive!.Ken Sharpe interview with Jim Lea", "*Jim Lea - bass, backing vocals"]}, {"page": "Slayed?", "response": ["*Jim Lea – bass, piano, violin, backing vocals"]}, {"page": "Sladest", "response": ["*Jim Lea – bass, piano, violin, backing vocals"]}, {"page": "Old New Borrowed and Blue", "response": ["\"Just Want a Little Bit\" is a cover of the 1959 Rosco Gordon song, which was a minor hit in 1964 for Liverpool group The Undertakers. The song was later recorded in 1977 by The Animals too, of which Slade manager and producer Chas Chandler was bassist. At the time, the song was a regular inclusion in Slade's live set. \"When the Lights Are Out\" is the band's first track to feature Jim Lea on lead vocals. In a 1974 interview for the \"19\" readers, Holder jokingly commented: \"There's nothing like a good singer and Jimmy's nothing like a good singer.\"Slade Talk To \"19\" Readers - Track 17 on Salvo remaster The song was later covered by Bob Segarini in 1978 and American rock group Cheap Trick on their 2009 album The Latest. Lea would also record his own version with his brother Frank Lea under the name The Dummies in 1979. \"My Town\" originally appeared as the B-Side to \"My Friend Stan\".", "Chandler had persuaded Lea to finish \"My Friend Stan\" after he heard Lea playing the melody at home on his piano.Slade's Greatest Hits compilation booklet \"Everyday\" also features piano and was released as a single at Chandler's insistence. Jim Lea was totally opposed to it being an A-side and argued with Chandler for the durationTHE NOIZE - THE SLADE DISCOGRAPHY by Ian Edmundson and Chris Selby, Amazon 2019 of a flight from the UK to Australia. When it was released, the band knew they were taking a risk but \"Everyday\" would become a firm favourite on stage.Slade's remastered album booklet Old New Borrowed and Blue The song featured Lea on guitar as guitarist Dave Hill was away on honeymoon at the time of the recording sessions. \"Good Time Gals\" also featured as the B-Side to \"Everyday\".", "*Jim Lea — bass, piano, guitar, backing vocals, lead vocals (track 2)"]}, {"page": "Cum On Feel the Noize", "response": ["\"Cum On Feel the Noize\" is a song by the English rock band Slade, which was released in 1973 as a non-album single. It was written by lead vocalist Noddy Holder and bassist Jim Lea, and produced by Chas Chandler. It reached No. 1 in the UK Singles Chart, giving the band their fourth number one single, and remained in the charts for twelve weeks. The song was included on the band's 1973 compilation album Sladest. In a UK poll in 2015 it was voted 15th on the ITV special The Nation's Favourite 70s Number One.", "*Jim Lea - bass, backing vocals", "Category:Songs written by Jim Lea"]}, {"page": "Jimmy Lea", "response": ["#REDIRECT Jim Lea (musician)"]}, {"page": "Slade in Flame (album)", "response": ["To accompany the film, lead vocalist Noddy Holder and bassist Jim Lea began writing material for a soundtrack album, which would continue to see the band break out of their successful formula and try different musical ideas. Having completed a fifth US tour, the band spent a month recording the new album. In October 1974, the lead single \"Far Far Away\" was released and reached No. 2 in the UK. The Slade in Flame album followed in November, peaking at No. 6. Though the record was lauded by critics, the album did not sell as well as expected, particularly as the band's previous three albums had all reached number one.", "*Jim Lea - bass, piano, backing vocals"]}, {"page": "Beginnings (Ambrose Slade album)", "response": ["The band spent a week in the Philips studio at Stanhope Place recording Beginnings with engineer Roger Wake. Having thought the band's demo of \"Mad Dog Cole\" was great, Baverstock insisted the band write more material of their own. The three other originals, \"Roach Daddy\", \"Pity The Mother\" and \"Genesis\", were then written within days. In a 1980 interview, bassist Jim Lea recalled: \"This was our first major crack at making a record, so it was all important not to let it slip. So we did \"Roach Daddy\", \"Mad Dog Cole\" and \"Genesis\" out of total fear. \"Pity The Mother\" was another one of the songs that Bavistock \"forced\" us to write.\" At a time when the band were not yet fully writing their own material, the album contained eight covers of songs the band regularly played as part of their live-set. Of the covers, Lea said: \"They were all numbers that we were doing live on stage at the time. We had started to move away from the Flower Power thing then, but we were still doing unusual numbers. You can see by all the writers of the songs, they are all big names now, but at the time they were unheard of. Frank Zappa – he was totally unknown, he had only recorded one album, but we recorded his \"Ain't Got No Heart\".\" Contrary to Lea's statement, Zappa had actually released six studio albums before Ambrose Slade released their debut.", "*Jim Lea – bass, violin, producer", "Category:Albums produced by Jim Lea"]}, {"page": "Nobody's Fools", "response": ["*Jim Lea - bass, backing vocals"]}, {"page": "Whatever Happened to Slade", "response": ["Recalling the album in the 1984 biography Feel the Noize!, bassist Jim Lea said: \"It was a heavy metal album. It was a mistake and I was against that title.\" Lead vocalist Noddy Holder said in his 1999 biography Who's Crazee Now?: \"Whatever Happened to Slade was much rockier than Nobody's Fools. It was a return to our original sound\". In a 2009 interview answering fan questions, drummer Don Powell was asked which Slade album he would recommend to a new listener as the \"definitive Slade studio album\". He said: \"Whatever Happened to Slade because at that particular time we had nothing to lose.\"", "The first track on the album, \"Be\", became popular in Slade's live sets, featuring on the band's subsequent live album Slade Alive, Vol. 2 (1978). For a fan club newsletter in 1979, bassist Jim Lea spoke of the track, saying \"songs like \"Be\" are hardly concise, they're clever, but hardly the sing-along down at the pub type song.\" AllMusic described the song as being \"unlike any other the band had done\".", "*Jim Lea - bass, backing vocals"]}, {"page": "Slade Alive, Vol. 2", "response": ["All songs written by Noddy Holder and Jim Lea except \"My Baby Left Me\" by Arthur Crudup.", "*Jim Lea - bass, backing vocals"]}, {"page": "Return to Base", "response": ["Return to Base is the eighth studio album by the British rock group Slade. It was released on 1 October 1979 by Barn Records, and did not enter any national album charts. At the time of the album's release, the band's success had waned and were receiving little fortune. Forced to play at small halls and clubs around the UK, the only income they were reliant on was Noddy Holder and Jim Lea's songwriting royalties. Their recent singles had sold poorly and they were no longer drawing in large audiences. Prior to their last-minute call up for the 1980 Reading Festival, they were on the verge of disbanding.", "Having returned to the UK from the United States in August 1976, Slade found themselves out-of-favour at the time of the UK's Punk rock explosion. The band's 1977 album Whatever Happened to Slade proved a commercial failure while their tour that spring had shown that they could no longer fill large venues. Slade's waning success soon led to the band taking any gig they could. They found themselves playing small venues, mainly universities and clubs. The band's tours often ran at a loss, with the band having to bring their own PA and lightshow. Bassist Jim Lea however was unphazed. \"I still thought the band was great,\" he told Chris Charlesworth in 1983, \"We were playing as well if not better than we ever had... now we had something to prove again.\"We'll Bring the House Down - 2007 Salvo remaster booklet liner notes", "In mid-1980, by which point the band were on the verge of disbanding, the band were offered to appear at Reading Festival in August 1980 in a last minute call-up. The band only had a couple of their road crew to help them on the day. Jim Lea recalled \"We had to pay to park in the public area. With no roadies, we had to carry our own gear and there was even trouble getting into the backstage area.\" Despite the failure of Return to Base and the band's lack of success, the performance at the festival was a success and the band became popular once again. As a result of this success, several tracks from the album which the band considered the strongest reappeared on the band's next album, We'll Bring the House Down (1981), which successfully rejuvenated the band's successes, both critically and commercially.", "*Jim Lea – bass, piano, synthesizer, backing vocals, producer", "Category:Albums produced by Jim Lea"]}, {"page": "We'll Bring the House Down", "response": ["*Jim Lea - bass, keyboards, synthesizer, backing vocals, producer", "Category:Albums produced by Jim Lea"]}, {"page": "Girlschool", "response": ["Back in England, the continuous succession of recording sessions, gigs and promotional work started again, but the strain of this routine was wearing out Kelly Johnson, who was also tired of the music the band had been playing for four years without a break. The other members struggled to convince her to stay and the chance to record with British celebrities Noddy Holder and Jim Lea as producers persuaded the guitarist to carry on with Girlschool. Holder and Lea, who had returned in those years to great success and popularity in Great Britain with the 70s rock band Slade, were hired to produce only a single, with the following album already scheduled to be recorded in Los Angeles with Quiet Riot producer Spencer Proffer. However, the good chemistry found with the two Slade members led the band to decide to record not a single, but their whole fourth studio album in North London with Lea and Holder, giving up the trip to the USA. This time the group changed sensibly both their appearance and their musical style in order to appeal to a large American audience, which Bronze considered more oriented toward AOR and glam rock than to the 'biker metal' Girlschool had produced before. Play Dirty, released in October 1983, is an album with a very polished sound, filled with keyboards, choruses and melodies, but it lacks much of the aggression and power of the preceding works. The album contains covers of the Slade songs \"High & Dry\" and \"Burning in the Heat\" and of T.Rex’s \"20th Century Boy\", which was also released as a single. Play Dirty failed to enter the top 50 chart in the UK and had a lukewarm reception by fans and critics at home. A struggle between Bronze and PolyGram for the worldwide contract of the band resulted also in poor promotion for the album in the USA. Moreover, a disastrous performance at Wembley Arena supporting ZZ Top did not help Girlschool's already degraded image in Great Britain."]}, {"page": "Till Deaf Do Us Part", "response": ["* Jim Lea – bass, keyboards, backing vocals, producer", "Category:Albums produced by Jim Lea"]}, {"page": "Slade on Stage", "response": ["All songs written by Noddy Holder and Jim Lea except \"You'll Never Walk Alone\" by Rodgers and Hammerstein.", "*Jim Lea - bass, backing vocals, producer", "Category:Albums produced by Jim Lea"]}, {"page": "The Amazing Kamikaze Syndrome", "response": ["The Amazing Kamikaze Syndrome is the eleventh studio album by the British rock group Slade. It was released on 3 December 1983 and reached No. 49 in the UK charts. The album was produced largely by bassist Jim Lea. The two UK Top 10 singles released from the album, \"My Oh My\" and \"Run Runaway\", were produced by John Punter.", "*Jim Lea - bass, keyboards, guitars, backing vocals, lead vocal on verses (track 7), producer", "Category:Albums produced by Jim Lea"]}, {"page": "Back to Back (Status Quo album)", "response": ["It was the last recorded before the group temporarily disbanded in 1985 and therefore the last to feature original bass guitarist Alan Lancaster and drummer Pete Kircher. Lancaster co-wrote the first single, \"Ol' Rag Blues\", with Keith Lamb, lead singer of British bands The Kase, Sleepy Talk and Mr. Toad, and founder and lead singer of Australia's successful glam rock band Hush. Lancaster was angered when the production company declined to release the version featuring his lead vocal (which has since been made available as a bonus track on the 2006 remastered reissue), in preference to that featuring the voice of Francis Rossi.  He also made no secret of his dislike of \"Marguerita Time\", which he thought was too pop-orientated for the group. When they appeared on BBC's Top of the Pops to mime to the single, his place was taken by Jim Lea of Slade, who were also on the programme that week. The Top of the Pops performance was also notable for Rick Parfitt falling into Pete Kircher's drum set near the end of the song while the song kept playing. On the DVD Hello Quo, Parfitt claims that he had planned this action, although many people thought he was drunk. On the same DVD, Alan Lancaster also said that he wasn't so concerned with \"Marguerita Time\" as he was with \"Going Down Town Tonight\", which – according to him – was not a Status Quo recording and featured no Status Quo musicians apart from Francis Rossi."]}]}}