{"wiki_id": "http://www.wikidata.org/entity/Q256402", "itemLabel": "Jodhi May", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Jodhi_May", "wikipedia_page": {"main": "Jodhi Tania May (née Hakim-Edwards; 8 May 1975) is a British actress. She remains the youngest recipient of the Best Actress award at the Cannes Film Festival, for A World Apart (1988). Her other film appearances include The Last of the Mohicans (1992), Sister My Sister (1994), and A Quiet Passion (2016).", "link_mentions": [{"page": "Jane Seymour", "response": ["* Seymour is a supporting character in the 2003 BBC television drama The Other Boleyn Girl, played by Naomi Benson opposite Jared Harris as Henry VIII and Jodhi May as Anne Boleyn."]}, {"page": "Malcolm McLaren", "response": ["To part-fund the business, in February 1972 McLaren was paid £50 to marry a former Goldsmiths fellow student, Jocelyn Hakim, so that she could achieve British citizenship. Hakim took the surname Edwards and subsequently gave birth to Jodhi May (later an actress) in 1975. There is no truth in the rumour that McLaren was May's father, which is based on the fact that May's birth surname was her mother's married name."]}, {"page": "2000 in film", "response": ["| The House of Mirth || Sony Pictures Classics || Terence Davies (director/screenplay); Gillian Anderson, Dan Aykroyd, Terry Kinney, Anthony LaPaglia, Laura Linney, Elizabeth McGovern, Eric Stoltz, Eleanor Bron, Jodhi May, Penny Downie, Pearce Quigley, Lorelei King, Morag Siller, Pamela Dwyer || Drama || Live action"]}, {"page": "1995 in film", "response": ["| Sister My Sister || NFH Productions || Nancy Meckler (director); Wendy Kesselman (screenplay); Julie Walters, Joely Richardson, Jodhi May || Drama, Thriller || Live action", "| The Scarlet Letter || Hollywood Pictures / Cinergi Pictures || Roland Joffé (director); Douglas Day Stewart (screenplay); Demi Moore, Gary Oldman, Robert Duvall, Robert Prosky, Edward Hardwicke, Joan Plowright, Lisa Joliffe-Andoh, Roy Dotrice, Larissa Laskin, Amy Wright, George Aguilar, Tim Woodward, Dana Ivey, Sheldon Peters Wolfchild, Eric Schweig, Kristin Fairlie, Sarah Campbell, Kennetch Charlette, Jodhi May || Period, Drama || Live action", "*Sister My Sister, starring Joely Richardson, Jodhi May and Julie Walters – (U.K.)"]}, {"page": "1988 in film", "response": ["*A World Apart, directed by Chris Menges, starring Barbara Hershey and Jodhi May – (U.K./Zimbabwe)"]}, {"page": "1992 in film", "response": ["| The Last of the Mohicans || 20th Century Fox / Morgan Creek Productions || Michael Mann (director/screenplay); Christopher Crowe (screenplay); Daniel Day-Lewis, Madeleine Stowe, Russell Means, Eric Schweig, Jodhi May, Steven Waddington, Wes Studi, Maurice Roeves, Patrice Chéreau, Dylan Baker, Edward Blatchford, Tracey Ellis, Terry Kinney, Sebastian Roche, Justin M. Rice, Dennis Banks, Pete Postlethwaite, Colm Meaney, Mac Andrews, Benton Jennings, Jared Harris || Period, Drama || Live action"]}, {"page": "Lady Sarah Lennox", "response": ["In 1999, a six-part mini-series based on the lives of Sarah Lennox and her sisters aired in the UK. It was called Aristocrats, and Sarah was played by actress Jodhi May."]}, {"page": "Philippa Gregory", "response": ["Some of her novels have won awards and have been adapted into television dramas. The most successful of her novels has been The Other Boleyn Girl, published in 2001 and adapted for BBC television in 2003 with Natascha McElhone, Jodhi May and Jared Harris. In the year of its publication, The Other Boleyn Girl also won the Romantic Novel of the Year and it has subsequently spawned sequels – The Queen's Fool, The Virgin's Lover, The Constant Princess, The Boleyn Inheritance, and The Other Queen. Miramax bought the film rights to The Other Boleyn Girl and released a film of the same name in February 2008."]}, {"page": "Stephen Poliakoff", "response": ["He subsequently returned to his favoured form, television, this time choosing a flexible serial format resulting in the acclaimed and Prix Italia-winning Shooting the Past (1999), the fresh critical and audience success of Perfect Strangers (2001), a family drama starring Matthew Macfadyen, Michael Gambon and Lindsay Duncan and  The Lost Prince (2003), a single drama recognised with an Emmy award rare for a non-American production. The film also featured Miranda Richardson in a Golden Globe-nominated performance as Queen Mary of Teck. Michael Gambon, Gina McKee, Tom Hollander and Bill Nighy appeared in major roles. Late 2005 saw the one-off drama Friends and Crocodiles (2006) starring Damian Lewis and Jodhi May, with its overlapping companion piece, Gideon's Daughter (2006), starring Bill Nighy, Miranda Richardson and Emily Blunt, appearing early the following year. The latter won a Peabody Award in April 2007, with Golden Globes for Nighy and Blunt."]}, {"page": "Noël Coward Theatre", "response": ["* Blackbird (13 February 2006 – 13 May 2006) by David Harrower, starring Roger Allam and Jodhi May"]}, {"page": "Tipping the Velvet", "response": ["Tipping the Velvet was adapted into a BBC television drama serial of the same name, originally screened in three episodes on BBC Two in 2002. It was produced for the BBC by the independent production company Sally Head Productions, and starred Rachael Stirling as Nan, Keeley Hawes as Kitty, Anna Chancellor as Diana, and Jodhi May as Florence. The BBC had previously adapted Oranges Are Not the Only Fruit in 1990 and some other scenes in dramas to follow, but none had been so explicit. Sally Head Productions defended the decision to air the entire program uncut.Brooks, Richard (18 August 2002). \"Explicit lesbian drama will top BBC schedule\", The Sunday Times (London), p. 7. Waters was quite surprised that the BBC chose to produce and broadcast a television adaptation that faithfully followed the relish and detail of sexual escapades in the book.Tipping the Velvet: DVD Special Features (2002). Acorn Media. Stirling thoroughly enjoyed the role, despite her avowed heterosexuality: \"To counteract any hard-core sex within it, there's a huge sense of humour and a huge sense of fun and frivolity and joy of life. It was so utterly believable that you never for a moment thought, Fuck, there's no reason why I'm standing here naked.\"Stockwell, Anne (13 May 2003). \"My Life as a Victorian Dyke, The Advocate Issue 889, pp. 58–60."]}]}}