{"wiki_id": "http://www.wikidata.org/entity/Q2578928", "itemLabel": "Richard Saul", "itemDescription": "Royal Air Force air marshals", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Saul", "wikipedia_page": {"main": "Air Vice-Marshal Richard Ernest Saul,  (16 April 1891 – 30 November 1965) was a pilot during the First World War and a senior Royal Air Force commander during the Second World War.", "link_mentions": [{"page": "Battle of Britain", "response": ["File:Air Vice-Marshal Richard Saul.jpg|13 Group Commander, Richard Saul"]}, {"page": "Keith Park", "response": ["Park's subsequent objection to Leigh-Mallory's behaviour during the Big Wing controversy may have contributed to his and Dowding's removal from command at the end of the battle, but neither Park nor Dowding had much time for internal politics and fell easy prey to their waiting critics. Richard Saul of 13 Group on the other hand, wrote to Park on learning of his pending departure from No. 11 Group, commenting on \"the magnificent achievements of your group in the past six months; they have borne the brunt of the war, and undoubtedly saved England\".Orange, p. 135 Sir Keith Park Park remained indignant, however, over his and Dowding's treatment for the rest of his life. Park was posted immediately to Training Command, becoming AOC No. 23 Group RAF,Air of Authority – A History of RAF Organisation – Air Chief Marshal Sir Keith Park before seeing later high ranking service in the Mediterranean and elsewhere, while Dowding was sent to America."]}, {"page": "No. 13 Group RAF", "response": ["As Fighter Command expanded prior to World War II, it was seen that a new Group was needed to command the air defences of Scotland, Northern Ireland, and the north of England. 13 Group was duly reformed in September 1939. During the initial stages of World War II, No. 13 Group was Commanded by Air Vice Marshal Richard Saul."]}, {"page": "1891 in Ireland", "response": ["*16 April – Richard Saul, British Royal Air Force air vice marshal (died 1965 in the United Kingdom)."]}, {"page": "List of people from Dublin", "response": ["*Richard Saul – aviator and commander in the Battle of Britain"]}, {"page": "RAF Fighter Command order of battle 1940", "response": ["| 13 Group||RAF Newcastle,RAF Newcastle Kenton Bar, Newcastle upon Tyne||Richard Saul|| North of England and Scotland "]}, {"page": "Henry Hunter (RAF officer)", "response": ["He fared better against his fellow officers, reaching the final of the RAF Singles Championship in 1925, only to be beaten by the title holder Flying Officer Charles Frederick Roupell. In 1930 he made it through to the third round. However he had the consolation of being RAF Doubles Champion, partnered with Squadron Leader Richard Saul, for several years."]}, {"page": "R E Saul", "response": ["#REDIRECT Richard Saul"]}, {"page": "List of Battle of Britain airfields", "response": ["13 Group covered the north of England, Scotland and Northern Ireland and was commanded by Air Vice-Marshal Richard Saul."]}, {"page": "Air Vice-Marshal R E Saul", "response": ["#REDIRECT Richard Saul"]}, {"page": "R Saul", "response": ["#REDIRECT Richard Saul"]}, {"page": "Index of World War II articles (R)", "response": ["# Richard Saul"]}, {"page": "RE Saul", "response": ["#REDIRECT Richard Saul"]}, {"page": "AHQ Air Defences Eastern Mediterranean", "response": ["Air Headquarters Air Defences Eastern Mediterranean (Air H.Q. Air Defences Eastern Mediterranean or AHQ Air Defences Eastern Mediterranean) was a sub-command of RAF Middle East Command which itself was a sub-command of the Mediterranean Air Command during World War II.Richards, D. and H. Saunders, The Royal Air Force 1939-1945 (Volume 2, HMSO, 1953).Craven, Wesley F. and James L. Cate. The Army Air Forces in World War II, Volume 2, Chicago, Illinois: Chicago University Press, 1949 (Reprinted 1983, ). Air H.Q. Air Defences Eastern Mediterranean was established on 4 March 1943, by renaming the RAF command known as AHQ Egypt. Air Vice Marshal Richard Saul was the only commander of Air HQ Air Defences Eastern Mediterranean which was renamed Air HQ Eastern Mediterranean on 1 February 1944. Air of Authority - A History of RAF Organisation", "Air HQ Air Defences Eastern Mediterranean<BR>Air Vice Marshal Richard Saul<BR>Commanders Air of Authority - A History of RAF Organisation and Squadron AssignmentsRichards, D. and H. Saunders, The Royal Air Force 1939-1945 (Volume 2, HMSO, 1953)."]}, {"page": "RAF Middle East Command", "response": ["* Air Headquarters (AHQ) Air Defences Eastern Mediterranean under Air Vice Marshal Richard Saul;"]}, {"page": "Richard Ernest Saul", "response": ["#REDIRECT Richard Saul"]}, {"page": "Saul (surname)", "response": ["* Richard Saul (1891-1965), Irish air marshal"]}, {"page": "Saul, Richard", "response": ["#redirectRichard Saul"]}]}}