{"wiki_id": "http://www.wikidata.org/entity/Q2575137", "itemLabel": "Cynan Garwyn", "itemDescription": "King of Powys, Wales", "wikipedia_url": "https://en.wikipedia.org/wiki/Cynan_Garwyn", "wikipedia_page": {"main": "Cynan Garwyn was king of Powys in the north-east and east of Wales, who flourished in the second half of the 6th century. Little reliable information exists which can be used to reconstruct the background and career of the historical figure. Available materials include early Welsh poetry, genealogies and hagiography, which are often late and of uncertain value.", "link_mentions": [{"page": "Ambrosius Aurelianus", "response": ["Mike Ashley suggests that the descendants of Ambrosius could include other people named by Gildas. He favours the inclusion in this category of one Aurelius Caninus (\"Aurelius the dog-like\"), whom Gildas accuses of parricide, fornication, adultery, and warmongering. His name \"Aurelius\" suggests Romano-British descent. The insulting nickname \"Caninus\" was probably invented by Gildas himself, who similarly insults other contemporary rulers. Due to the name used by Gildas, there are theories that this ruler was actually named Conan/Cynan/Kenan. Some identify him with Cynan Garwyn, a 6th-century King of Powys, though it is uncertain if he was a contemporary of Gildas or lived one or two generations following him. Another theory is that this ruler did not reign in Britain but in Brittany. Caninus, in this view, might be Conomor (\"Great Dog\"). Conomor is considered a likelier contemporary of Gildas. Conomor was likely from Domnonée, an area of Brittany controlled by British immigrants from Dumnonia. He might be remembered in British legend as Mark of Cornwall."]}, {"page": "610", "response": ["* Selyf ap Cynan succeeds his father Cynan Garwyn as king of Powys (Wales)."]}, {"page": "List of rulers of Wales", "response": ["* Cynan Garwyn (?–610)"]}, {"page": "Taliesin", "response": ["In 1960, Ifor Williams identified eleven of the medieval poems ascribed to Taliesin as possibly originating as early as the sixth century, and so possibly being composed by a historical Taliesin.The Poems of Taliesin, ed. by Ifor Williams, trans. by J. E. Caerwyn Williams, Mediaeval and Modern Welsh Series, 3 (Dublin: Dublin Institute for Advanced Studies, 1987 [repr. from 1968; first publ. Canu Taliesin 1960]). The bulk of this work praises King Urien of Rheged and his son Owain mab Urien, although several of the poems indicate that Taliesin also served as court bard to King Brochfael Ysgithrog of Powys and his successor Cynan Garwyn, either before or during his time at Urien's court. Some of the events to which the poems refer, such as the Battle of Arfderydd (c. 573), are referred to in other sources.", "Taliesin's authorship of several odes to King Urien Rheged (died c. 590) is commonly accepted,National Library of Wales, article TaliesinJ. Koch, Celtic Culture: Aberdeen breviary-celticism and they mention The Eden Valley and an enemy leader, Fflamddwyn, identified as Ida or his son Theodric.Charles Oman, England Before the Norman Conquest - The poems refer to victories of Urien at the battles of Argoed Llwyfain, The Ford of Clyde and Gwen Ystrad. Taliesin also sang in praise of Cynan Garwyn, king of Powys.Ifor Williams, Canu Taliesin (University of Wales Press, 1960), poem I. Cynan's predecessor, Brochwel Ysgithrog, is also mentioned in later poems."]}, {"page": "List of legendary kings of Britain", "response": ["|Aurelius Caninus, 6th-century king of Gwent or Powys; Cynan Garwyn (582–610), king of Powys"]}, {"page": "Aurelius Conanus", "response": ["Little else can be said of Aurelius Conanus with any certainty; it is not even known in which part of Britain he ruled. Historian John Edward Lloyd suggests that the form Caninus, appearing in one important manuscript of De Excidio, may have been a corruption of the more common Cuna(g)nus, or Cynan in Welsh.Lloyd, p. 132. As such he may be identified with one of the figures of that era who bore that name, such as Cynan Garwyn of Powys or his relative Cynin ap Millo. Lloyd suggests a connection with the degenerate descendants of the great hero Ambrosius Aurelianus whom Gildas mentions in Chapter 25. In this case his kingdom may have been located out in the territory later taken by the Anglo-Saxons, i.e. what is now England."]}, {"page": "Book of Taliesin", "response": ["*XXIII\t\"Trawsganu Kynon\"\t(\"Satire on Cynan Garwyn\")", "Twelve of the poems in the manuscript were identified by Ifor Williams as credibly being the work of a historical Taliesin, or at least 'to be contemporary with Cynan Garwyn, Urien, his son Owain, and Gwallawg', possibly historical kings who respectively ruled Powys; Rheged, which was centred in the region of the Solway Firth on the borders of present-day England and Scotland and stretched east to Catraeth (identified by most scholars as present-day Catterick in North Yorkshire) and west to Galloway; and Elmet. These are (giving Skene's numbering used in the content list below in Roman numerals, the numbering of Evans's edition of the manuscript in Arabic, and the numbers and titles of Williams's edition in brackets): "]}, {"page": "Medieval Welsh literature", "response": ["The poetry of Taliesin has been preserved in a 14th-century manuscript known as Llyfr Taliesin (Book of Taliesin). This manuscript contains a large body of later mystical poetry attributed to the poet, but scholars have recognised twelve poems that belong to the 6th century. They are all poems of praise: one for Cynan Garwyn, king of Powys about 580; two for Gwallawg, king of Elmet, a kingdom based around the modern Leeds; and nine other poems associated with Urien Rheged, a ruler of the kingdom of Rheged, located around the Solway Firth, and his son, Owain."]}, {"page": "List of monarchs of Powys", "response": ["*Cynan Garwyn, (White-Shanks) (? - 610)"]}, {"page": "Brochwel Ysgithrog", "response": ["Brochwel was the son of King Cyngen Glodrydd and his wife St. Tudlwystl, a daughter of Brychan ap Gwyngwen ap Tewdr. As far as is known Brochwel married Arddyn Benasgel, sometimes written Arddun Penasgell (Wing Headed), daughter of King Pabo Post Prydain. They were the parents of King Cynan Garwyn and Saint Tysilio, the founder of the old church at Meifod."]}, {"page": "Brycheiniog", "response": ["In the time of Idwallon, the aggressive Cynan Garwyn (king of Powys) invaded a number of lands, including Brycheiniog. However, Rhiwallion was able to succeed owing to the subsequent collapse of Powysian power, under pressure from Dogfeiling and the extreme youth of Cynan's later successor."]}, {"page": "Cynan", "response": ["* Cynan Garwyn (fl. 6th century), king of Powys"]}, {"page": "Llanrhychwyn", "response": ["A popular belief, based on a misinterpretation of a line of poetry in the Red Book of Hergest by 18th- and early 19th-century antiquarian scholars, is that Taliesin (c. 534–c.599), the 6th-century Welsh bard and the earliest poet of the Welsh language whose work has survived, was an inhabitant of the area, living on the shores of Llyn Geirionydd and buried there. It has even been claimed that he was also born in this area, but it is far more likely that he was born in Powys, as demonstrated by his poems to Cynan Garwyn, King of Powys."]}, {"page": "List of longest-reigning monarchs", "response": ["| Cynan Garwyn"]}, {"page": "Selyf ap Cynan", "response": ["Selyf ap Cynan or Selyf Sarffgadau (died 616) appears in Old Welsh genealogies as an early 7th-century King of Powys, the son of Cynan Garwyn."]}, {"page": "Cynan Garwyn ap Brockfael", "response": ["#redirectCynan Garwyn"]}, {"page": "Aergol Lawhir", "response": ["Aergol was known to be an enemy of King Cynan Garwyn of Powys and they clashed at Crug Dyfed."]}, {"page": "St Enghenedl's Church, Llanynghenedl", "response": ["The site of the former St Enghenedl's Church is in the village of Llanynghenedl, in Anglesey, north Wales, in the north-west of the island about  east of the port town of Holyhead. Little is known about Enghenedl, the saint to whom the church was dedicated.  He was one of the sons of Cynan Garwyn, King of Powys in the late 6th century, and a brother of his successor, Selyf ap Cynan or Selyf Sarffgadau.  This is the only church recorded as being dedicated to Enghenedl, whose feast day was celebrated on Quinquagesima (the Sunday before Ash Wednesday). The village takes its name from the church; the Welsh word  originally meant \"enclosure\" and then \"church\", and \"‑ynghenedl\" is a variant of the saint's name."]}, {"page": "List of state leaders in the 6th century", "response": [":*Cynan Garwyn, King (582–610)"]}, {"page": "List of state leaders in the 7th century", "response": [":*Cynan Garwyn, King (582–610)"]}]}}