{"wiki_id": "http://www.wikidata.org/entity/Q257750", "itemLabel": "Jayne Torvill", "itemDescription": "figure skater", "wikipedia_url": "https://en.wikipedia.org/wiki/Jayne_Torvill", "wikipedia_page": {"main": "Jayne Torvill, OBE (born 7 October 1957) is a British professional ice dancer and former competitor. With Christopher Dean, she won a gold medal at the 1984 Winter Olympics and a bronze medal at the 1994 Winter Olympics, becoming one of the oldest figure skating Olympic medalists.", "link_mentions": [{"page": "Figure skating", "response": ["In 1984, more than 24 million people in Great Britain watched ice dance pair Jayne Torvill and Christopher Dean earn unanimous 6.0s for presentation, the only perfect score in Olympic skating history, which was ranked the 8th greatest sporting moment in a UK poll. In the 1993 National Sports Study II, considered by the Associated Press as the largest study of spectator sport popularity in America, women's figure skating was the second most popular spectator sport in America, just behind NFL football out of over 100 sports surveyed. The 1993 study found that three figure skaters – Dorothy Hamill, Peggy Fleming, and Scott Hamilton – were among the eight most popular athletes in the United States, of more than 800 athletes surveyed. Dorothy Hamill was statistically tied with Mary Lou Retton as the most popular athlete in America. The Tonya Harding scandal in 1994 increased interest in figure skating. The first night of the women's figure skating competition in the 1994 Winter Olympics achieved higher Nielsen TV ratings than the Super Bowl three weeks earlier and, to that date, was the most watched sports television program of all time."]}, {"page": "October 7", "response": ["*  1957   – Jayne Torvill, English figure skater"]}, {"page": "Winter Olympic Games", "response": ["Sapporo, Japan, and Gothenburg, Sweden, were front-runners to host the 1984 Winter Olympics. It was therefore a surprise when Sarajevo, Yugoslavia, was selected as host. The Games were well-organised and not affected by the run-up to the war that engulfed the country eight years later. A total of 49 nations and 1,272 athletes participated in 39 events. Host nation Yugoslavia won its first Olympic medal when alpine skier Jure Franko won silver in the giant slalom. Another sporting highlight was the free dance performance of British ice dancers Jayne Torvill and Christopher Dean; their Boléro routine received unanimous perfect scores for artistic impression, earning them the gold medal."]}, {"page": "1957", "response": ["* October 7 – Jayne Torvill, British ice dancer and Olympian "]}, {"page": "Ice dance", "response": ["Ice dance became an Olympic sport in 1976; Lyudmila Pakhomova and Alexandr Gorshkov from the Soviet Union were the first gold medalists.Hines (2011), p. xxvi The Soviets dominated ice dance during most of the 1970s, as they did in pair skating. They won every Worlds and Olympic title between 1970 and 1978, and won medals at every competition between 1976 and 1982.Hines (2006), pp. 217–218 In 1984, British dancers Jayne Torvill and Christopher Dean, who Hines calls \"the greatest ice dancers in the history of the sport\",Hines (2006), p. 240 briefly interrupted Soviet domination of ice dance by winning a gold medal at the Olympic Games in Sarajevo. Their free dance to Ravel's Boléro has been called \"probably the most well known single program in the history of ice dance\".Kestnbaum, p. 228 Hines asserts that Torvill and Dean, with their innovative choreography, dramatically altered \"established concepts of ice dancing\".Hines (2006), p. 239"]}, {"page": "1994 Winter Olympics", "response": ["On 6 January, Tonya Harding's ex-husband, Jeff Gillooly and his friend Shawn Eckdardt, conspired with Shane Stant to club fellow female figure skater Nancy Kerrigan in the knee. Both Harding and Kerrigan were selected for the Olympic team. After Harding admitted to helping to cover up the attack, the United States Olympic Committee initiated proceedings to remove her from the Olympic team, but Harding retained her place after threatening legal action. In the ladies' singles, Ukraine's Oksana Baiul won ahead of Kerrigan and Chen Lu, with Harding finishing eighth.LOOC (IV): 148 In the men's singles, Russia's Alexei Urmanov won ahead of Canada's Elvis Stojko and France's Philippe Candeloro.LOOC (IV): 147 Relaxation of the amateurism rules led to several former stars returning, such as ice dancing 1984 Champions Great Britain's Jayne Torvill and Christopher Dean, who took a bronze behind Russians Oksana Grishuk and Evgeny Platov, and Maya Usova and Alexander Zhulin. In pair skating, the Russians also took a double, with Ekaterina Gordeeva and Sergei Grinkov winning ahead of Natalia Mishkutenok and Artur Dmitriev.LOOC (IV): 145"]}, {"page": "1984 Winter Olympics", "response": ["The figure skating events took place at the Skenderija sports center. The American Scott Hamilton, world champion from 1981 to 1983, was first after the compulsory figures of the men's competition. The Canadian Brian Orser won the short program and the free skate ahead of Hamilton. Orser, who finished seventh in the compulsory figures, won the silver medal, while Hamilton won gold. The bronze medal went to Czechoslovakian Jozef Sabovčík. The favorites in the women's competition were the Americans Elaine Zayak and Rosalynn Sumners, world champions in 1982 and 1983, as well as East Germany's Katarina Witt. Zayak was only thirteenth in the compulsory figures, which Sumners won, and Witt came third. The East German won the short program while Sumners took fifth place. In the free skate, Witt had a good performance that allowed her to win the gold medal while Sumners, who had a less difficult program than expected, settled for the silver medal. The Soviet Kira Ivanova took third place. The Soviets Elena Valova and Oleg Vassiliev, world champions in 1983, won the short program and the free program and finished in first place in the pairs event. American siblings Kitty and Peter Carruthers were second and another Soviet pair, Larisa Seleznyova and Oleg Makarov, finished third. British ice dancers Jayne Torvill and Christopher Dean did not disappoint the public. They carried out a very original program set to the music of Boléro by Maurice Ravel and the nine judges give them the maximum score of six for artistic impression. Torvill and Dean become Olympic champions ahead of two Soviet couples (Natalia Bestemianova/Andrei Bukin and Marina Klimova/Sergei Ponomarenko)."]}, {"page": "Michelle Kwan", "response": ["For the 2004–2005 competitive season, Kwan skated her long program to \"Boléro\", choreographed by British ice dancer Christopher Dean who had famously skated to the music with Jayne Torvill two decades before, and debuted a new short program, \"Adagio\" from Aram Khachaturian's ballet Spartacus. At the U.S. Championships, she won her 9th title, tying the all-time record previously set by Maribel Vinson-Owen. Vinson-Owen had coached Frank Carroll, who in turn coached Kwan. At the 2005 World Championship, Kwan competed for the first time under the new judging system. She had a rough qualifying round and placed third in the short program. In the free skate, Kwan fell on her triple salchow and two-footed a triple lutz. Although she finished third in both the short and long program portion of the competition, Kwan was edged by Carolina Kostner for the bronze medal and finished fourth overall, missing third place by 0.37 points. It was the first time since 1995 that Kwan had failed to medal at any international competition, and would be her final competitive event."]}, {"page": "List of people on the postage stamps of Gabon", "response": ["*Jayne Torvill (1984 airmail)"]}, {"page": "1981 in sports", "response": ["** Ice dancing champions: Jayne Torvill & Christopher Dean, Great Britain"]}, {"page": "1984 in sports", "response": ["** Ice dancing champions: Jayne Torvill & Christopher Dean, Great Britain"]}, {"page": "1983 in sports", "response": ["** Ice dancing champions: Jayne Torvill & Christopher Dean, Great Britain"]}, {"page": "1982 in sports", "response": ["** Ice dancing champions: Jayne Torvill & Christopher Dean, Great Britain"]}, {"page": "World Figure Skating Championships", "response": ["| 1981 ||  Hartford ||  Jayne Torvill / Christopher Dean ||  Irina Moiseeva / Andrei Minenkov ||  Natalia Bestemianova / Andrei Bukin", "| 1982 ||  Copenhagen ||  Jayne Torvill / Christopher Dean ||  Natalia Bestemianova / Andrei Bukin ||  Irina Moiseeva / Andrei Minenkov", "| 1983 ||  Helsinki ||  Jayne Torvill / Christopher Dean ||  Natalia Bestemianova / Andrei Bukin ||  Judy Blumberg / Michael Seibert", "| 1984 ||  Ottawa ||  Jayne Torvill / Christopher Dean ||  Natalia Bestemianova / Andrei Bukin ||  Judy Blumberg / Michael Seibert"]}, {"page": "Culture of the United Kingdom", "response": ["In Ice Dance, many of the compulsory moves were developed by dancers from the UK in the 1930s.James R. Hines (2011). Historical Dictionary of Figure Skating\". p. 102. Scarecrow Press At the 1984 Winter Olympics, Jayne Torvill and Christopher Dean won ice dancing gold with the highest-ever score for a single programme. The pair received perfect 6.0 scores from every judge for artistic impression, and twelve 6.0s and six 5.9s overall."]}, {"page": "Alexei Yagudin", "response": ["Yagudin started the 2001–02 Olympic season with a bronze medal at the 2001 Goodwill Games in September. He altered his training regimen as a result, and then enjoyed the best season in his career. He defeated Plushenko at the 2001–02 Grand Prix Final and regained his European title. At the 2002 Winter Olympics in Salt Lake City, Yagudin won the men's event, receiving first-place votes from every judge throughout the competition, became one of the youngest male figure skating Olympic champions. He received four 6.0 scores for his free skate. Yagudin's perfect marks are the most for an Olympic performance since Jayne Torvill and Christopher Dean's free dance in 1984 and set a record for a men's skater in the Olympics. After the Olympics, Yagudin won his fourth World title, receiving six perfect 6.0s for his short program and another two for his free skating at the competition. He became the first singles skater to receive six perfect marks for the short program, including the first ever perfect mark for required elements. This record cannot be equaled or broken because the International Skating Union introduced the ISU Judging System after the 2002–03 season."]}, {"page": "Manchester Arena", "response": ["On the opening night, 15,000 spectators watched Jayne Torvill and Christopher Dean perform; the crowd was a record for an ice event. Attendance records were set in 1997 when 17,425 people watched Manchester Storm play Sheffield Steelers, a record for an ice hockey match in Europe at that time. When 14,151 people watched Manchester Giants play London Leopards, it set a British record for attendance at a basketball match. The venue attracts over a million customers each year for concerts and family shows, making it one of the world's busiest indoor arenas, and was named \"International Venue Of The Year\" in 2002 in the 'Pollstar' awards, and was nominated in the same category from 2002 to 2009. The arena was named \"Busiest Arena Venue In The World\", based on ticket sales for concerts from 2003 to 2007, ahead of other indoor arenas including Madison Square Garden and Wembley Arena. The arena was the 'World's Busiest Arena' from 2001 until 2007 based on ticket sales for concerts, attracting five and a half million customers. It was voted 'Europe's Favourite Arena' at the TPi Awards in 2008 by the touring companies that bring the shows to the venue."]}, {"page": "Keith Chegwin", "response": ["Chegwin was originally set to take part in the seventh series of Dancing on Ice, but he was forced to withdraw after breaking three ribs and fracturing his shoulder on the first day of training with Jayne Torvill and Christopher Dean. Chegwin joined the eighth series of Dancing on Ice partnered with Olga Sharutenko. Chegwin was eliminated on 17 February 2013. From October to January 2013, he played the part of Drosselmeyer in the 'Nutcracker On Ice' with Imperial Ice Stars from Russia at the London Palladium."]}, {"page": "Amateur sports", "response": ["In 1992, trust funds were abolished, and the International Skating Union voted both to remove most restrictions on amateurism, and to allow skaters who had previously lost their amateur status to apply for reinstatement of their eligibility.  A number of skaters, including Brian Boitano, Katarina Witt, Jayne Torvill and Christopher Dean, and Ekaterina Gordeeva and Sergei Grinkov, took advantage of the reinstatement rule to compete at the 1994 Winter Olympics.  However, when all of these skaters promptly returned to the pro circuit again, the ISU decided the reinstatement policy was a failure and it was discontinued in 1995."]}]}}