{"wiki_id": "http://www.wikidata.org/entity/Q25752960", "itemLabel": "William Henry Hamlyn", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Henry_Hamlyn", "wikipedia_page": {"main": "William Henry Hamlyn FRIBA (16 February 1889 – 1968) was an architect based in England noted for his buildings for the London Midland and Scottish Railway.\nHe was born in Wigan in Lancashire. He studied architecture with Reginald Wynn Owen in Liverpool and later at the Royal Academy School.\nHe entered railway service in 1911 initially with the London and North Western Railway. He was elected a fellow of the Royal Institute of British Architects in 1934 and became the chief architect for the London, Midland and Scottish Railway company. He drew up plans with Percy Thomas for the rebuilding of Euston railway station in 1936, but the outbreak of the Second World War resulted in their cancellation\nHe designed a series of pre-fabricated railway stations which were built on blitz-damaged station sites from 1945 onwards. A prototype was erected at Queen’s Park railway station and the first installation was destined for Bootle New Strand railway station.\nHe retired in 1949 and died in 1968.", "link_mentions": [{"page": "South Kenton station", "response": ["The station opened on 3 July 1933 with access from both sides of the railway via a footbridge to the single island platform serving only the Euston-Watford DC line; this footbridge (which started at the bottom of the embankment) was later replaced by a pedestrian tunnel, cutting out a long climb for passengers entering the station. The station designed by the architect William Henry Hamlyn was built in a more modern \"concrete and glass\" style construction including a \"streamlined\" waiting room rather than the brick and woodwork LNWR stations elsewhere on the DC line.", "Category:William Henry Hamlyn buildings"]}, {"page": "Becontree tube station", "response": ["The London, Midland and Scottish Railway (LMSR) took ownership of the LT&SR in 1923 and the station opened as Gale Street Halt on 28 June 1926 to serve the new Becontree Estate and subsequent residential areas. Initially, there were no roads leading to the station. In 1929, the company proposed quadrupling their line between Barking and Upminster and electrifying one pair of tracks for the District line. The station was rebuilt and new platforms were constructed for the new pair of tracks. Gale Street Halt was renamed as Becontree and the new station building to the designs of the architect William Henry Hamlyn opened on 18 July 1932, with electrified District line services starting operation 2 months after on 12 September. In addition to the start of electrified services, two new adjacent stations on the District line named Upney and Heathway (now Dagenham Heathway) opened.", "Category:William Henry Hamlyn buildings"]}, {"page": "Leeds railway station", "response": ["The first rationalisation occurred in 1938, when two railway stations (New and Wellington) were combined to form Leeds City Station, opening on 2 May that year. This was designed by LMS architect William Henry Hamlyn. The third railway station, Leeds Central, was unaffected by the change. Part of Wellington railway station later became a parcels depot. The north concourse and the Queens Hotel were built at this time."]}, {"page": "Apsley railway station", "response": ["The station was designed by the architect William Henry Hamlyn and opened on 26 September 1938, to serve the paper producing area of Apsley Mill and Nash Mill, it was operated initially by the London, Midland and Scottish Railway. The station then passed on to the London Midland Region of British Railways on nationalisation in 1948.", "Category:William Henry Hamlyn buildings"]}, {"page": "Luton railway station", "response": ["The station, consisting of only 3 platforms was rebuilt in 1939 to the designs of the London, Midland and Scottish Railway company architect William Henry Hamlyn.", "Category:William Henry Hamlyn buildings"]}, {"page": "Hoylake railway station", "response": ["Prior to 1938, the station was of varying architectural styles. Built in 1938 adjoining the Up platform, the current station building, designed by the architect William Henry Hamlyn, is in the Art Deco style, with a circular clerestory over the booking hall, becoming a Grade II Listed Building in 1988. The sign currently on display in front of the station was recently restored during a renovation. The adjoining footbridge was built at the same time as the Art Deco building, and new level crossing gates were installed. The goods yard had a 5-ton crane from 1938.", "Category:William Henry Hamlyn buildings"]}, {"page": "Lea Hall railway station", "response": ["The station was designed by the architect William Henry Hamlyn and opened in 1939.", "Category:William Henry Hamlyn buildings"]}, {"page": "Queens Hotel, Leeds", "response": ["Category:William Henry Hamlyn buildings"]}, {"page": "Euston House", "response": ["It was built between 1933 and 1934 as the headquarters of the London, Midland and Scottish Railway, to designs by the architects Albert Victor Heal and William Henry Hamlyn. The LMS had recognised the need for several departments to work closely together and the new building was designed to accommodate 1,300 people on 9 floors.Dundee Courier - Saturday 24 February 1934 Half of the cost of construction was met by the Ministry of Transport in recognition of the company fulfilling its obligations under the scheme for the remission of passenger duty. Construction of the building required the demolition of the disused City and South London Railway entrance building to Euston Underground station."]}, {"page": "Denis Dunlop", "response": ["* Former London Midland & Scottish Railway (LMS) School of Transport, Derby (William Henry Hamlyn, 1937–8): eight square bas-relief panels carved in Portland stone and set between each window on the majestic facade. Each panel represents different activities of the LMS: locomotive building, rolling stock construction, signals, and telegraphs, civil engineering, architecture, research, marine transport and traffic operations;"]}, {"page": "Midland Hotel, Derby", "response": ["The original building is of red brick construction with a rectangular plan, three storeys high with seven bays at the front. The outer bay on either side protrudes slightly. A stone cornice runs beneath the second-floor windows. The windows are decorated with stone frames and balconets (above the ground floor). The inner bays contain singular windows while on the outer bays the windows are arranged in pairs on the first floor and triplets on the top and bottom floors. A second building, designed by William Henry Hamlyn and built by Holliday and Greenwood was added behind the original between 1933 and 1938, linked to the main building by a single-storey block on the Midland Road side. The second building is also in red brick and of a rectangular plan, with a further three storeys of five bays."]}, {"page": "LMS School of Transport", "response": ["It was designed by the company architect, William Henry Hamlyn and is dominated by the centrepiece of the facade, the entrance portico, with a full height staircase window and roof lantern. A Portland stone arcade with bas-reliefs by Denis Dunlop runs along the first floor. It opened on 22 July 1938 by the Minister of Transport, Leslie Burgin.", "The LMS commissioned various art works for the building. Just inside the main entrance, they installed two mural panels by Norman Wilkinson, one showing an LMS steam ferry, the other three steam locomotives, depicting progress from Stephenson's Rocket to the Princess Coronation Pacific. In the lounge, William Henry Hamlyn designed a mural which shows the development of road and rail transport from 1838 to 1938. It was executed by John Carter, John Ferguson Cooper and Harold Haynes Matthews.", "Category:William Henry Hamlyn buildings"]}]}}