{"wiki_id": "http://www.wikidata.org/entity/Q257844", "itemLabel": "Ivor Forbes Guest", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Ivor_Forbes_Guest", "wikipedia_page": {"main": "Ivor Forbes Guest DUniv MA FRAD (14 April 1920 – 30 March 2018) was a British historian and writer, best known for his study of ballet. He was chairman of the Royal Academy of Dance for twenty three years (1970–93) and has been a Vice-President since 1993 and Secretary then Trustee of the Radcliffe Trust. In 1997 he was made a Doctor of the University by the University of Surrey, its highest honorary doctorate.He was married to the movement notation expert Ann Hutchinson Guest and acted as a trustee of the Language of Dance Centre, which she founded.", "link_mentions": [{"page": "April 14", "response": ["*1920 – Ivor Forbes Guest, English lawyer, historian, and author (d. 2018)"]}, {"page": "1920 in the United Kingdom", "response": ["* 14 April – Ivor Forbes Guest, historian of dance (died 2018)"]}, {"page": "Fanny Elssler", "response": ["* Ivor Forbes Guest, Fanny Elssler (Wesleyan University Press, Middletown, Connecticut, 1970)"]}, {"page": "Sylvia (ballet)", "response": ["Sylvia, and Coppélia before it, are often touted as two of the first modern ballets for their novel scores.Vaughan, David (2004). \"Frederick Ashton and His Ballets\". Retrieved June 5, 2005. Tchaikovsky himself remarked to fellow composer Sergei Taneyev upon the ingenuity of Sylvia, calling it \"... the first ballet, where the music constitutes not only the main, but the only interest. What charm, what elegance, what richness of melody, rhythm, harmony.\" While this statement may be a little hyperbolic, it says something very important about the uniqueness of the ballet. Sylvias score is varied and rich, and it stands out, drawing the focus from the sets, the dancers, the costumes. Instead of receding into the background, setting only the mood, Delibes' score sets the action. The music of Sylvia was also notable for its new, more developed use of leitmotifs.BalletNotes (2001). \"Léo Delibes\". Retrieved June 11, 2005. Such a stylistic choice is characteristic of Delibes, who was a great admirer of Wagner. Indeed, echoes of Wagner's influence are quite obvious in the music such as its \"symphonic\" nature, as described by Ivor Forbes Guest in the 1954 edition of The Ballet Annual."]}, {"page": "Guest (surname)", "response": ["*Ann Hutchinson Guest (born 1918), authority on dance notation and wife of Ivor Forbes Guest"]}, {"page": "List of members of the Ordre des Arts et des Lettres", "response": ["|Ivor Forbes Guest|| style=\"background:#c96;\"|Chevalier||2000"]}, {"page": "Ivor Guest", "response": ["*Ivor Forbes Guest (1920–2018), British lawyer and ballet historian, husband of movement notation expert Ann Hutchinson Guest", "*Ivor Guest (died 1917), elder brother of Ernest Lucas Guest and uncle of Ivor Forbes Guest"]}, {"page": "Queen Elizabeth II Coronation Award", "response": ["*1991 - Ivor Forbes Guest"]}, {"page": "Guest, Ivor Forbes", "response": ["#REDIRECT Ivor Forbes Guest "]}, {"page": "April 1920", "response": ["*Born: Ivor Forbes Guest, British chairman of the Royal Academy of Dance from 1970 to 1993; in Chislehurst, London (d. 2018)"]}, {"page": "Herbert Melville Guest", "response": ["Guest's two youngest sons, Cecil Marmaduke (1888–1954), known as Duke, and Oliver Basil (born 1891), served in the Transvaal Scottish in the First World War. The elder of them, Duke, was later commissioned in the South African Scottish and served in France. He was gassed and declared unfit for further service, remaining in England until the end of the war. Duke was married in England in 1918 and lived in Kent. One of his sons is the historian Ivor Forbes Guest."]}, {"page": "1920 in British music", "response": ["*14 April – Ivor Forbes Guest, historian of dance (died 2018)"]}, {"page": "2018 in literature", "response": ["**Ivor Forbes Guest, English historian and writer, 97 (born 1920)Muere a los 97 años Ivor Guest, el gran historiador del ballet"]}, {"page": "Deaths in March 2018", "response": ["*Ivor Forbes Guest, 97, British historian and writer.Muere a los 97 años Ivor Guest, el gran historiador del ballet "]}, {"page": "Kenneth Robertson", "response": ["Kenneth Robertson (born 1931) is a British sculptor, known for his public work inspired by animals and the human form engaged in dance.http://www.gallery-pangolin.com/downloads/gallery-pangolin/catalogues/sterling.pdfAs a former dental surgeon working in London with a broad understanding of anatomy, his first sculptures were influenced by red deer he then farmed in rural Hampshire. In 1997 he began a series of dancers, working in wax to capture movement and mood as expressed by the actions of dancers both contemporary and in classical ballet. He has collaborated with professional dancers and choreographers such as Russell Maliphant and his researches into the language of dance have referenced dance movement analysis authority Ann Hutchinson Guest and dance historian Ivor Forbes Guest."]}]}}