{"wiki_id": "http://www.wikidata.org/entity/Q2579847", "itemLabel": "William MacQuitty", "itemDescription": "British film producer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_MacQuitty", "wikipedia_page": {"main": "William MacQuitty (15 May 1905 – 4 February 2004) was a British film producer and also a writer and photographer. He is most noted for his production of the 1958 Rank Organisation / Pinewood Studios film, A Night to Remember, which recreates the story of the sinking of RMS Titanic, based on the book of the same name by Walter Lord. MacQuitty had seen Titanic being launched, when he was a child.", "link_mentions": [{"page": "A Night to Remember (book)", "response": ["The second adaptation was the 1958 British drama film A Night to Remember starring Kenneth More, which is still widely regarded as \"the definitive cinematic telling of the story.\" The film came about after its eventual director, Roy Ward Baker, and its producer, Belfast-born William MacQuitty both acquired copies of the book – Baker from his favorite bookshop and MacQuitty from his wife – and decided to obtain the film rights. MacQuitty had actually seen Titanic being launched on 31 May 1911 and still remembered the occasion vividly. He met Lord and brought him on board the production as a consultant. The film diverges from both the book and the NBC TV adaptation in focusing on a central character, Second Officer Charles Lightoller, played by Moore. Its conclusion reflects Lord's world-historical theme of a \"world changed for ever\" with a fictional conversation between Lightoller and Colonel Archibald Gracie, sitting on a lifeboat. Lightoller declares that the disaster is \"different ... Because we were so sure. Because even though it's happened, it's still unbelievable. I don't think I'll ever feel sure again. About anything.\""]}, {"page": "Abu Simbel", "response": ["One scheme to save the temples was based on an idea by William MacQuitty to build a clear freshwater dam around the temples, with the water inside kept at the same height as the Nile. There were to be underwater viewing chambers. In 1962 the idea was made into a proposal by architects Jane Drew and Maxwell Fry and civil engineer Ove Arup.Fry Drew Knight Creamer, 1978, London, Lund Humphries They considered that raising the temples ignored the effect of erosion of the sandstone by desert winds. However, the proposal, though acknowledged to be extremely elegant, was rejected."]}, {"page": "2004 in the United Kingdom", "response": ["* 4 February – William MacQuitty, film producer (born 1905)"]}, {"page": "Sydney Box", "response": ["The couple were then hired by the Rank Organisation to run Gainsborough Studios. They disapproved of the Gainsborough melodramas which had been the studio's major successes for several years, and switched production to a broader range of more \"realistic\" films with mixed results. Box made 36 films at Gainsborough, which was merged into the Rank Organization in 1949. In 1951 he founded his own production company London Independent Producers with William MacQuitty."]}, {"page": "Campbell College", "response": ["Several Campbell students have been involved in filmmaking. These include William MacQuitty (A Night to Remember), Andrew Eaton (Resurrection Man), Nick Hamm (The Hole), Dudi Appleton (The Most Fertile Man in Ireland), and Mark Huffam (Saving Private Ryan).  A collection of Lepidoptera by Thomas Workman is displayed in the school.", "*William MacQuitty, film producer"]}, {"page": "A Night to Remember (1958 film)", "response": ["A Night to Remember is a 1958 British docudrama film based on the eponymous 1955 book by Walter Lord. The film and book recount the final night of RMS Titanic, which on her maiden voyage from Southampton to New York City struck an iceberg in the North Atlantic and then sank in the early morning hours of Monday, 15 April 1912. Adapted by Eric Ambler and directed by Roy Ward Baker, the film stars Kenneth More as the ship's Second Officer Charles Lightoller and features Michael Goodliffe, Laurence Naismith, Kenneth Griffith, David McCallum and Tucker McGuire. It was filmed in the United Kingdom and tells the story of the sinking, portraying the main incidents and players in a documentary-style fashion with considerable attention to detail. The production team, supervised by producer William MacQuitty (who saw the original ship launched) used blueprints of the ship to create authentic sets, while Fourth Officer Joseph Boxhall and ex-Cunard Commodore Harry Grattidge worked as technical advisors on the film. Its estimated budget of up to £600,000 (£ adjusted for inflation []) was exceptional and made it the most expensive film ever made in Britain up to that time.", "The film adaptation came about after its eventual director, Roy Ward Baker, and its producer, Belfast-born William MacQuitty, both acquired copies of the book -– Baker from his favorite bookshop and MacQuitty from his wife -– and decided to obtain the film rights. MacQuitty succeeded in raising finance from John Davis at the Rank Organisation, who in the late 1950s were expanding into bigger-budgeted filmmaking. The job of directing was assigned to Roy Baker, who was under contract to Rank, and Baker recommended Ambler be given the job of writing the screenplay. Lord was brought on board the production as a consultant."]}, {"page": "Above Us the Waves", "response": ["Director Ralph Thomas says the film was made because producer William MacQuitty \"was very involved with the Navy and he loved submarines.\"Brian McFarlane, An Autobiography of British Cinema 1997 p 558 MacQuitty had a production company in partnership with Sydney Box called London Independent Producers, which tended to use the same core creative personnel. They purchased film rights in 1952, before the book had been published."]}, {"page": "Titanic in popular culture", "response": ["Barbara Stanwyck and Clifton Webb starred as an estranged couple in the 1953 film Titanic. The film makes little effort to be historically accurate and focuses on the human drama as the couple, Mr and Mrs Sturges, feud over the custody of their children while their daughter has a shipboard romance with a student travelling on the ship. As Titanic sinks the couple are reconciled, the women are rescued and Sturges and his son go down with the ship. The film earned an Oscar for its screenplay. The film's lack of regard for historical accuracy can be explained by the fact that it uses the disaster merely as a backdrop for the melodrama. This proved unsatisfactory for some, notably Belfast-born William MacQuitty, who had witnessed the launch of Titanic as a boy and had long wished to make a film that put the nautical events front and centre."]}, {"page": "1958 in Northern Ireland", "response": ["*1 July – Release of the film A Night to Remember (about the sinking of the Titanic) produced by William MacQuitty."]}, {"page": "1943 in Northern Ireland", "response": ["*Release of the Crown Film Unit drama documentary short A Letter From Ulster directed by Brian Desmond Hurst assisted by William MacQuitty.."]}, {"page": "Hate (short story)", "response": ["\"Hate\" is a science fiction short story by British writer Arthur C. Clarke, first published in 1961Short Stories. Arthurcclarke.net, 2007-2011, retrieved June 22, 2011 and subsequently included in several collections of Clarke's writings, including The Collected Stories of Arthur C. Clarke.  The story originated when movie producer William MacQuitty asked Clarke to write a film treatment titled The Sea and the Stars.  Nothing came of the project so Clarke transformed the treatment into a short story.  If magazine retitled it \"At the End of Orbit\" for publication but Clarke preferred his original title because it has \"more punch\" and it is under that title that the story has since been published."]}, {"page": "Jane Drew", "response": ["a poem, Rowfant Lake, for Jane Sir Hugh Casson, Cedric Price, Baroness Lee, Delia Tyrwhitt,Delia Tyrwhitt first met Jane and Max in Chandigarh in 1953 Lord Reilly,Sir Paul Reilly, Director of the Design Council Lord Elwyn-Jones, William MacQuitty, Arnold Whittick,Arnold Whittick was an art and architectural historian Elizabeth and Mervyn Dalley,Mervyn Dalley (CMG, MA (Cantab)) and his wife, Elizabeth, first met Jane in Iran at Masjid-i-Suleiman, when Jane stayed with them; they remained friends, and years later Jane converted their old rectory house in England. Mervyn Dailey wrote a note on Jane's work in Iran Romi Khosla,Romi Khosla (BA (Cantab), AA Dipl.), son of High Court Judge G. D. Khosla (a friend of Jawaharlal Nehru), was an accountant who, under Jane's guidance switched careers to architecture Roz Jacobs,Roza Jacobs was Vice President and Fashion Director of Macy's store in New York \"...a good and loyal friend\" Noma Copley,Noma Copley was a jewellery designer, earlier married to the painter William Copley Kenane Barlow,Kenane Barlow (wife of Peter Barlow) \"and the five Barlows\" wrote Jane an affectionate poem. Peter had met Jane on the Torbay express to London Sergei Kadleigh,Sergei Kadleigh (AA Dipl. (Hons), ARIBS) was a Russian-born British architect Maria Luisa Plant Zaccheo,Maria Luisa Plant Zaccheo, (Dr. Arch.(Rome), ARIBA) was an associate in Jane's office 1971–1980 Lord Goodman, Lady Jean Medawar,Jean Medawar was a pioneer in family planning; Jane designed the Margaret Pyke Centre for her Arunendu Das,Arun Das worked in Jane's office on the Margaret Pyke Centre J.R. Bhalla,Jai Rattan Bhalla, (FRIBA, FHS, FVI, HFAIA) was President of the Indian Institute of Architects. Although not involved in the Chandigarh project, he was appreciative of Jane's interest in the training of young Indian architects The Lord Perry,Walter Laing Macdonald Perry, Lord Perry of Walton (OBE, FRSE), was a pharmacologist and vice-chancellor of the Open University (1921–2003). Lord Perry was instrumental in the planning of the Open University and Jane was his development architect Victor Pasmore, Mike Lacey,Mike Lacey was Director of Lovell Construction on the OU project at Milton Keynes Nigel Wood,Nigel Wood (MA, C.Eng., MICE, MCIOB) was a craftsman builder who worked for Jane on the OU project at Milton Keynes, St Pauls Girls' School, Carlton House Terrace and Jane's own flat and offices Peter Greenham,Peter Greenham (CBE, RA, PPRBA) was a renowned portrait painter Sunita Kanvinde,Sunita Kanvinde was a student of painting and graphics in Delhi and was helped by Jane when she came to England Tony Forrest,Tony Forrest (DA (Edin.)) was a building contractor and artist, specialising in combining architecture and landscapes with human elements Heather Brigstocke, Peter Murray, Berthold Lubetkin, Frances Webb Leishman,Frances Webb Leishman was the American wife of a retired British diplomat and merchant banker, and a freelance journalist, who once interviewed Jane for Woman's Hour Robert Bliss,Robert L. Bliss (FAIA) was Dean of Architecture at the University of Utah when, in 1975, she visited Salt Lake City, Utah during her lecture tour of the United States Viren Sahai,Viren Sahai (OBE, DipTP., ARIBA) was born in India, studied architecture, painting and town planning and was Chairman of the Bristol Centre for the Advancement of Architecture Sir John Summerson,Sir John Summerson (CBE, FBA) contributed an extract from an essay on Batty Langley Patrick Harrison,Patrick Harrison (CBE) met Jane while he was secretary of the RIBA Ebenezer Akita,Ebenezer Akita (AA Dip., ARIBA, FGIA) was President of the Ghana Institute of Architects Charles Correa, and Olufemi Majekodunmi.Olufemi Majekodunmi (DARch, ARIBA, FNIA, FIArb) was President of the Nigerian Institute of Architects, and reviewed Jane's work on the University of Ibadan"]}, {"page": "The Informers (1963 film)", "response": ["The Informers (US title - Underworld Informers) is a 1963 British crime film produced and distributed in the UK by The Rank Organisation and distributed in the USA by Continental Film Distributors.  It was directed by Ken Annakin and produced by William MacQuitty, with the screenplay by Paul Durst and Alun Falconer from the novel Death of a Snout by Douglas Warner. It stars Nigel Patrick, Margaret Whiting, Harry Andrews, Derren Nesbitt and Colin Blakely. Cinematography was by Reginald H. Wyer. It was filmed at Pinewood Studios and on location in London."]}, {"page": "Brian Desmond Hurst", "response": ["Hurst worked for the Ministry of Information during the Second World War for whom his films included A Call for Arms (1940), Miss Grant Goes to the Door (1940) and his homeland film A Letter From Ulster (1943) where Hurst and Terence Young (as scriptwriter) and his fellow Ulsterman and Assistant Director William MacQuitty created a film \"promoting a sense of community\" between the people of Northern Ireland and over one hundred thousand troops from the America based in Northern Ireland at the time. Brian McIlroy explained that \"Hurst was able to persuade one Catholic and one Protestant soldier to write letters home, explaining their impressions of their stay. From these letters, Terence Young, the scriptwriter, was able to construct a sequence of activities that revealed the different traditions of Ireland.\"", "William MacQuitty."]}, {"page": "Blue Scar", "response": ["Blue Scar was produced by Outlook Films, an independent production company established in 1948 by director Jill Craigie and managed in partnership with producer William MacQuitty. Craigie was a socialist documentary filmmaker, and Blue Scar was the first and only non-documentary film she directed; after Blue Scar, she concluded that documentary was the best film genre for social criticism."]}, {"page": "Edith Rosenbaum", "response": ["Edith Louise Rosenbaum Russell (June 12, 1879 – April 4, 1975) was an American fashion buyer, stylist and correspondent for Women's Wear Daily, best remembered for surviving the 1912 sinking of the RMS Titanic with a music box in the shape of a pig. The papier-mâché toy, covered in pigskin and playing a tune known as \"The Maxixe\" when its tail was twisted, was used by Edith Russell to calm frightened children in the lifeboat in which she escaped. Her story became widely known in the press at the time and was later included in the best-selling account of the disaster A Night to Remember by Walter Lord. Russell was also portrayed in the award-winning British docudrama produced by William MacQuitty that was based on Lord's book.", "Edith lived at London's Claridge's Hotel in the 1940s, moving eventually to a suite at the Embassy House Hotel in Queens Gate, London. She seems to have been expatriated by the early 1950s. At this time she became increasingly in demand as a pundit on the Titanic tragedy which had reentered public consciousness due to recently released films and books about the event. She attended a special media preview of the movie Titanic in 1953, afterward giving interviews to Life magazine and the New York daily press.Life Magazine, May 18, 1953, p. 96. She posed for photos carrying her famous toy pig and standing beside the dress she had worn on a fateful night. In 1955 historian Walter Lord published his best-seller A Night to Remember which featured Edith's story.Lord, Walter, A Night to Remember (1955), pp. 44, 123, 187. She later served as an advisor on the 1958 British film adaptation of Lord’s book, produced by William MacQuitty. She and her lucky pig were also portrayed in the film.MacQuitty, William, A Life to Remember (1994), p. 326."]}, {"page": "William Macquitty", "response": ["#REDIRECTWilliam MacQuitty"]}, {"page": "MacQuitty, William", "response": ["#redirectWilliam MacQuitty"]}, {"page": "London Independent Producers", "response": ["London Independent Producers was a British film production company. It was founded in 1951 by Sydney Box and William MacQuitty. Box had recently been head of production of Gainsborough Pictures, part of the Rank Organisation. After Gainsborough was closed down Box left Rank and chose to produce independently.Spicer p.147 Box's wife, the director Muriel Box, acted as a third partner."]}, {"page": "Titanic International Society", "response": ["At its 2003 convention in Newport, Rhode Island, the Society’s guest of honor was Lusitania survivor Barbara McDermott. In 2004, the Society's journal, Voyage, featured a cover story on the life of William MacQuitty, who died in February of that year at age 98. MacQuitty was the British producer of the 1958 film, A Night to Remember, which recreated the story of the sinking of the Titanic. As a six-year old, he had witnessed her launch in Belfast. The Voyage cover was headlined, \"A gentleman to remember\"."]}]}}