{"wiki_id": "http://www.wikidata.org/entity/Q2578239", "itemLabel": "William Cargill", "itemDescription": "New Zealand politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Cargill_(New_Zealand_politician)", "wikipedia_page": {"main": "William Walter Cargill (27 August 1784 – 6 August 1860) was the founder of the Otago settlement in New Zealand, after serving as an officer in the British Army. He was a member of parliament and Otago's first Superintendent.", "link_mentions": [{"page": "South Island", "response": ["The Otago Settlement, sponsored by the Free Church of Scotland, took concrete form in Otago in March 1848 with the arrival of the first two immigrant ships from Greenock (on the Firth of Clyde) – the John Wickliffe and the Philip Laing. Captain William Cargill, a veteran of the Peninsular War, served as the colony's first leader: Otago citizens subsequently elected him to the office of Superintendent of the Province of Otago."]}, {"page": "Otago", "response": ["The Otago settlement, an outgrowth of the Free Church of Scotland, was founded in March 1848 with the arrival of the first two immigrant ships from Greenock on the Firth of Clyde—the John Wickliffe and the Philip Laing. Captain William Cargill, a veteran of the Peninsular War, was the secular leader: Otago citizens subsequently elected him to the office of provincial Superintendent after the New Zealand provinces were created in 1853. The Otago Province was the whole of New Zealand from the Waitaki River south, including Stewart Island and the sub-Antarctic islands. It included the territory of the later Southland Province and also the much more extensive lands of the modern Southland Region."]}, {"page": "Invercargill", "response": ["In 1856, a petition was put forward to Thomas Gore Browne, the Governor of New Zealand, for a port at Bluff. Due to the Otago gold rush, the region's population grew during the 1860s with the settlement of Bluff.Wright (2009), p. 148 Browne agreed to the petition and gave the name Invercargill to the settlement north of the port. Inver comes from the Scottish Gaelic word inbhir meaning a river's mouth and Cargill is in honour of Captain William Cargill, who was at the time the Superintendent of Otago, of which Southland was then a part.Wright (2009), p. 224 The settlement's chief surveyor was John Turnbull Thomson, a British civil engineer."]}, {"page": "List of places named after people", "response": ["* Invercargill – William Cargill"]}, {"page": "Otago Peninsula", "response": ["Charles Kettle, the association's surveyor, laid out suburban and country blocks in 1846 and 1847. The arrival of the first migrant ships in early 1848 saw the focus of settlement move to Dunedin while Port Chalmers on the other side of the harbour succeeded Otago as the international port. In December William Cargill, secular leader of the Otago settlement, successfully petitioned the government to re-instate 'Otago' as its original name. The old whaling village and adjacent Māori settlements had now become 'Otakou'."]}, {"page": "List of New Zealand place name etymologies", "response": ["* Invercargill (Waihōpai) - from Scottish Gaelic inbhir anglicised \"Inver\" meaning a confluence and William Cargill, founder of Otago."]}, {"page": "Dunedin", "response": ["The name \"Dunedin\" comes from Dùn Èideann, the Scottish Gaelic name for Edinburgh, the capital of Scotland. Charles Kettle the city's surveyor, instructed to emulate the characteristics of Edinburgh, produced a striking, \"Romantic\" town-planning design. There resulted both grand and quirky streets as the builders struggled and sometimes failed to construct his bold vision across the challenging landscape. Captain William Cargill (1784-1860), a veteran of the Napoleonic Wars, served as the secular leader of the new colony. The Reverend Thomas Burns (1796-1871), a nephew of the poet Robert Burns, provided spiritual guidance. By the end of the 1850s around 12,000 Scots had emigrated to Dunedin, many from the industrial lowlands."]}, {"page": "John Cargill (politician)", "response": ["Cargill was born in 1821; he was the son of William Cargill, one of Otago's most prominent settlers. Edward Cargill was a younger brother. John Cargill served in the Royal Navy, and he served in the West Indies on Ringdove and . He retired from the navy in 1840 and by 1841, he came to Tasmania and then Port Phillip. He visited the Pacific Islands and settled in Ceylon where he had a coffee plantation. He was asked by his father to help with preparations for the Otago emigration scheme and returned to England in 1846. On 24 November 1847, the Cargill family sailed for New Zealand on the ship , arriving at what is now Port Chalmers, Otago on 23 March 1848."]}, {"page": "William Cutten", "response": ["of bankruptcy. At age 26, Cutten emigrated to New Zealand in 1848, arriving in Dunedin with the first settlers, including William Cargill on the John Wickliffe. Two years later, in 1850, he married Cargill's eldest daughter, Christina Dorothea Cargill, and the couple had 11 children."]}, {"page": "2nd New Zealand Parliament", "response": ["John and his father William Cargill resigned in 1858 and October 1859, respectively. The first vacancy was filled by John Parkin Taylor, who retired from parliament at the end of this term. The second vacancy was filled by Thomas Gillies."]}, {"page": "Cargill's Castle", "response": ["The ruins of Cargill's Castle stand on a promontory overlooking the Pacific Ocean in New Zealand's southern city of Dunedin. It is one of about ten castles in New Zealand, the other one in Otago being nearby Larnach Castle. More a castle in name than in fact, this Italianate mansion was built for Edward Cargill, eighth child of city founder William Cargill, in the late 19th century, who called it The Cliffs. Designed by the young architect Francis Petre, and built in concrete by Harry Lyders at a cost of £14,000, it was completed in 1877. Several kilometres south of the castle is Tunnel Beach, so named because this quiet beach is only accessible through a steeply sloping tunnel cut into the  high cliffs by the Cargill family. It is also very likely that Petre was the supervisor of the construction of the tunnel. While designing the house, Petre fell in love with Cargill's daughter Margaret. After a difficult courtship (due to Petre's staunch Catholicism and the Cargill family's equally staunch Presbyterianism) the couple were eventually permitted to marry, the wedding taking place in the villa's principal salon on 1 March 1881."]}, {"page": "John Wickliffe (ship)", "response": ["John Wickliffe was the first ship to arrive carrying Scottish settlers, including Otago settlement founder Captain William Cargill, in the city of Dunedin, New Zealand.NZ History Online: 23 March The ship was named after a religious reformer, John Wycliffe."]}, {"page": "Mount Cargill", "response": ["The peak is named for Captain William Cargill, an early leader of the Province of Otago. Māori legend tells of the mountain showing the profile of a prominent warrior, and indeed from Dunedin Buttar's Peak and Mount Cargill between them do form the outline of a reclining figure, with the nearby Buttar's Peak being the head and Mount Cargill the body."]}, {"page": "Scottish diaspora", "response": ["The Lay Association of the Free Church of Scotland founded Dunedin at the head of Otago Harbour in 1848 as the principal town of its Scottish settlement. The name comes from Dùn Èideann, the Scottish Gaelic name for Edinburgh, the Scottish capital.McLintock, A H (1949), The History of Otago; the origins and growth of a Wakefield class settlement, Dunedin, NZ: Otago Centennial Historical Publications, OCLC 154645934 Charles Kettle the city's surveyor, instructed to emulate the characteristics of Edinburgh, produced a striking, 'Romantic' design.Hocken, Thomas Moreland (1898), Contributions to the Early History of New Zealand (Settlement of Otago), London, UK: Sampson Low, Marston and Company, OCLC 3804372 The result was both grand and quirky streets as the builders struggled and sometimes failed to construct his bold vision across the challenging landscape. Captain William Cargill, a veteran of the war against Napoleon, was the secular leader. The Reverend Thomas Burns, a nephew of the poet Robert Burns, was the spiritual guide."]}, {"page": "The Octagon, Dunedin", "response": ["Despite the reserve status, the Anglican Church sought to build in the centre of the Octagon, applying directly to Governor Sir George Grey. It was not until construction was about to begin that the local (predominantly Presbyterian) community became aware of what was happening. This resulted in a major furore. Otago Superintendent William Cargill was put in charge of resolving the dispute, which resulted in the Anglicans being forced to withdraw their plans for The Octagon. (The Anglican St. Paul's Cathedral stands today at its northern edge.)"]}, {"page": "Princes Street, Dunedin", "response": ["The former Exchange Building, from which The Exchange takes its name, was an impressive structure, designed by William Mason as a Post Office and later occupied by the University of Otago and the Otago Museum. Next to this was the 1863 Customhouse building, and outside the two was an open space known as Customhouse Square. The Exchange building was pulled down in 1969, and it was largely the destruction of this building that led to changes in attitudes by Dunedinites regarding the change of their cityscape. Since this time, changes to the city's old buildings have been met with vociferous protests. The Customhouse building is also long since gone. Today, the site of the buildings is the location of one of Dunedin's biggest office blocks, John Wickliffe House, and the nearby John Wickliffe Plaza. Both are named for the John Wickliffe, the first of the two ships which brought the Otago Association's settlers to Dunedin (a nearby building, Philip Laing House, is named for the other of these two ships). Despite this, the area is the site of several prominent Victorian buildings, notably former bank buildings at the northern end of the area. Other imposing buildings in the area include the Chief Post Office building, the proposed site of a hotel, and – one block to the east – Consultancy House, a seven-storey 1908 building regarded (by dint of its construction methods) as Dunedin's first skyscraper. John Wickliffe Plaza is also the site of one of Dunedin's more notable public monuments, the Cargill Monument, dedicated to city founder Captain William Cargill. This monument, designed by Charles Robert Swyer and built in 1863-4, was originally sited in the Octagon, but was moved to the Exchange in 1872.", "At the southern end of the Oval is a further junction, with Princes Street terminating in a link road to South Dunedin's main street, King Edward Street, and a further road skirting the edge of a hilly spur to join South Road at the northern end of the suburb of Caversham. This latter road passes Dunedin's Southern Cemetery, the oldest and arguably most historic of the city's main cemeteries. The Southern Cemetery's earliest graves are from 1858,  and it contains the remains of many of the city's founding fathers, including Captain William Cargill, Thomas Burns, and Johnny Jones. The cemetery is notable for its large Chinese and Jewish sections. "]}, {"page": "Otago Province", "response": ["| William Cargill"]}, {"page": "Captain William Cargill", "response": ["#REDIRECT William Cargill (New Zealand politician)"]}, {"page": "History of the Dunedin urban area", "response": ["The name comes from Dùn Èideann, the Scottish Gaelic name for Edinburgh, the Scottish capital. Charles Kettle the city's surveyor, instructed to emulate the characteristics of Edinburgh, produced a striking, 'Romantic' design. The result was both grand and quirky streets as the builders struggled and sometimes failed to construct his bold vision across the challenging landscape. Captain William Cargill, a veteran of the war against Napoleon, was the secular leader. The Reverend Thomas Burns, a nephew of the poet Robbie Burns, was the spiritual guide."]}, {"page": "Charles Kettle", "response": ["Kettle continued working on the project for the next two years but after the demise of the New Zealand Company in 1850, his relations with William Cargill, leader of the Otago settlement, deteriorated, partly because Kettle was English while Cargill was narrowly Scottish. By 1852, Kettle had been made the colonial government's surveyor at Otago, thus resolving some of the tensions. In 1854 he resigned."]}, {"page": "Thomas Burns (minister, born 1796)", "response": ["At the age of 47, Burns joined the Free Church secession from the Church of Scotland. The proposal for a Free Church settlement in New Zealand gained Burns's interest, and he was offered the position of minister of the New Edinburgh scheme (later the Otago scheme) in June 1843. Burns and William Cargill established a lay association to promote the settlement in May 1845."]}, {"page": "Tunnel Beach", "response": ["Tunnel Beach is a locality  southwest of the city centre of Dunedin, New Zealand. Located just south of St Clair, Tunnel Beach has sea-carved sandstone cliffs, rock arches and caves.Dunedin New Zealand, Tunnel Beach New Zealand Tourism Guide Beyond the beauty of the rugged sandstone cliffs, its claim to fame is the tunnel down to the beach that a local politician, John Cargill, son of Captain William Cargill, had commissioned for his family in the 1870s.Tunnel Beach (from the New Zealand Department of Conservation website. Retrieved 2007-10-09.) Local legend says that one or more of Cargill's daughters drowned while swimming at the beach, but there is no truth to this story.Isaacs, C. \"Tall tales told in (graphic) novel form,\" Otago Daily Times, 9 November 2015. Retrieved 14 December 2018."]}, {"page": "Aber and Inver (placename elements)", "response": ["Invercargill in the South Island of New Zealand is a special case. It was first named Inverkelly in honour of an early settler called Kelly, and was then renamed in honour of Captain William Cargill, who was at the time the Superintendent of Otago, of which Southland was then a part. Since the city was indeed built at the mouth of the Waihopai River, the Inver- element was apparently chosen consciously."]}, {"page": "History of the Otago Region", "response": [" The settlement was planned to be named New Edinburgh but instead the local name Otago (a variant of Ōtākou) was used. George Rennie and William Cargill, both from Scotland, along with the Free Church of Scotland were the initial backers of the settlement. The Free Church had split in 1843 in protest at landowners having power over the nomination of ministers.", "William Cargill (first superintendent 1853–1860) and Thomas Burns (both Scottish) were the leaders of the new settlement, however, a number of Englishmen also had positions of power. John Turnbull Thomson was an English surveyor at this time and named many of Otago's landmarks.  Otago's other coastal port of Oamaru was laid out in 1858 and its streets were named after British rivers. Some settlers arrived as assisted immigrants. James McNeil, on the site of Balclutha and the Provincial Government established a ferry service across the Clutha in 1857."]}, {"page": "1860 in New Zealand", "response": ["* 6 August: William Cargill, British soldier, Otago founder and politician"]}, {"page": "Locations in New Zealand with a Scottish name", "response": ["The South Island also contains the Strath-Taieri and the Ben Ohau Range of mountains, both combining Scots Gaelic and Māori origins, as does Glentaki, in the lower valley of the Waitaki River. Invercargill has the appearance of a Scottish name, since it combines the Scottish prefix \"Inver\" (Inbhir), meaning a river's mouth, with \"Cargill\", the name of Scottish early settler William Cargill. (Invercargill's main streets are named after Scottish rivers, e.g.;, Dee, Tay, Spey, Esk, Don, Doon, Clyde, ). Inchbonnie is a hybrid of Lowland Scots and Scottish Gaelic"]}, {"page": "Caversham, New Zealand", "response": ["To the northeast of the Glen, a hill spur including a  cliff separates Caversham from the central part of the city. Though the name is rarely used, this spur is called Montecillo Ridge, named for the mansion of early settler W.H. Reynolds. It is occasionally referred to as \"Hillside\", after the house of the city's founding father Captain William Cargill which was located here.Herd, p. 40 This ridge overlooks \"The Flat\", as the plain stretching across to the Pacific coast was (and is still) locally known. South Road winds around the spur, connecting with the southern end of Princes Street. One of the city's older and more historic cemeteries, Dunedin Southern Cemetery, lies on the inner city side of this spur.Herd, pp. 112–113", "Captain William Cargill, founder of the Otago settlement, lived just to the northeast of Caversham above The Glen; his house \"Hillside\" gave its name to Hillside Road, which was at one time called Cargill Road. The area around the site of Cargill's long-demolished house between The Glen and Kensington is still referred to as Hillside. Cargill's Corner, the major road junction at the South Dunedin end of Hillside Road, is also named in his honour."]}, {"page": "South Dunedin", "response": ["South Dunedin contains the city's second most important retail district, centred on Cargill's Corner, named for Otago provincial founder Captain William Cargill (Hillside Road—at one time called Cargill Road—is named for his house, \"Hillside\", which lay some  to the north).Herd and Griffiths (1980), p. 40 At this junction, two main suburban arterial routes—King Edward Street and Hillside Road—cross. A small shopping mall, South City, is located at Cargill's Corner."]}, {"page": "Scottish New Zealanders", "response": ["The Otago Settlement, sponsored by the Free Church of Scotland, materialised in March 1848 with the arrival of the first two immigrant ships from Greenock on the Firth of Clyde – the John Wickliffe and the Philip Laing. Captain William Cargill, a veteran of the Peninsular War, served as the colony's first leader: Otago citizens subsequently elected him to the office of Superintendent.", "In 1856, a petition was put forward to Thomas Gore Browne, the Governor of New Zealand, for a port at Bluff. Browne agreed to the petition and gave the name Invercargill to the settlement north of the port. Inver comes from the Scots Gaelic word inbhir meaning a river's mouth and Cargill is in honour of Captain William Cargill, who was at the time the Superintendent of Otago, of which Southland was then a part.", "The Lay Association of the Free Church of Scotland founded Dunedin at the head of Otago Harbour in 1848 as the principal town of its Scottish settlement. The name comes from Dùn Èideann, the Scottish Gaelic name for Edinburgh, the Scottish capital.McLintock, A H (1949), The History of Otago; the origins and growth of a Wakefield class settlement, Dunedin, NZ: Otago Centennial Historical Publications, OCLC 154645934 Charles Kettle the city's surveyor, instructed to emulate the characteristics of Edinburgh, produced a striking, 'Romantic' design.Hocken, Thomas Moreland (1898), Contributions to the Early History of New Zealand (Settlement of Otago), London, UK: Sampson Low, Marston and Company, OCLC 3804372 The result was both grand and quirky streets as the builders struggled and sometimes failed to construct his bold vision across the challenging landscape. Captain William Cargill, a veteran of the war against Napoleon, was the secular leader. The Reverend Thomas Burns, a nephew of the poet Robert Burns, was the spiritual guide.", "The Octagon was first laid out during Charles Kettle's surveying of the city in 1846. His plans for the centre of Dunedin included a large Octagonal area (Moray Place) enclosing a smaller octagonal shape, originally designated as a reserve. Despite the reserve status, the Church of England sought to build in the centre of the Octagon, applying directly to Governor Sir George Grey. It was not until building was about to commence that the local (predominantly Scottish and Presbyterian) community became aware of what was happening. This resulted in a major furore within the city. Otago Superintendent William Cargill was put in charge of the dispute, resulting in the Anglicans being forced to withdraw their plans for The Octagon (The Anglican St. Paul's Cathedral stands today at the northern edge of The Octagon).", "* William Cargill (28 August 1924 – 29 January 2004)"]}, {"page": "Kensington, New Zealand", "response": ["The lower slopes of Montecillo Ridge were at one time the site of \"Hillside\", the home of Dunedin city's founding father Captain William Cargill. Though the house is long gone, its name lives on in that of South Dunedin's Hillside Road."]}, {"page": "Superintendent (New Zealand)", "response": ["* 1853 William Cargill"]}, {"page": "Dunedin Southern Cemetery", "response": ["* Captain William Cargill"]}, {"page": "Dunedin Country", "response": ["| rowspan=2 | William Cargill"]}, {"page": "Edward Cargill", "response": ["Cargill was born in Edinburgh, Scotland, in 1823; he was the seventh son of William Cargill, one of Otago's most prominent settlers. John Cargill was an elder brother. Edward Cargill was educated in Edinburgh and, after the family moved to England, at Norwich Grammar School and at Perone's School. He went to sea from age 14 and visited Australia and the Far East. In 1844, he settled in Ceylon and worked for the Bank of Western India. He was then a merchant in Ceylon and was in various partnerships. Cargill then went to Melbourne in Australia, where he stayed from 1855 to 1857 an importer of Eastern goods."]}, {"page": "John Hyde Harris", "response": ["Harris married Annie Cunningham Cargill in Dunedin on 3 September 1851. She was the daughter of William Cargill, who was to become the first Superintendent of Otago in 1853. Harris and Cargill had different political views, but Harris often agreed with William Cutten, who was married to another of Cargill's daughters. Annie Cunningham died on 18 January 1881, aged 51. They had three daughters and six sons."]}, {"page": "Otago Witness", "response": ["Graham expressed views in his newspaper such as advocating for a 10 hour working day, suggesting that the province was suitable only for grazing and not the agriculture that settlement was being planned on. Matters deteriorated when he directly attacked the Free Church Association, the New Zealand Company and  William Cargill of spreading misleading information about the prospects of Otago, which resulted in the cancelling of 40 subscriptions. In June 1849 the newspaper began publishing weekly. In November 1849 the newspaper received a letter signed by 147 citizens (which was nearly every adult male in the Dunedin) in which they stated that they had no sympathy for the editor’s views. Despite this the newspaper continued to be published even though Graham was suffering from consumption until it ceased publication on 21 December 1850. Graham died in February 1851.", "James Macandrew who was planning to immigrate to Otago was aware of the  Otago News and its combative relationship with the settlement’s leadership and that the copies being circulated in the United Kingdom were undermining efforts at marketing Otago. As a businessman he was keen for the settlement to prosper so soon after his arrival in Dunedin in January 1851 he joined a group of 11 leading citizens (the others being A. J. Burns, T. Burns, J. Cargill, William Cargill, William H. Cutten, J. R. Johnston, John Jones, Edward McGlashan, William H. Reynolds and W. H. Valpy)  in providing the capital necessary to purchase the printing plant of the Otago News.  Using the newly acquired printing plant the first issue of the Otago Witness appeared in early February 1851, three years after the founding of the settlement, which by now had a population of 745. Committing itself to principles in agreement with those of the settlement’s founders, Its name was chosen to indicate the city's connection with Edinburgh, where the Edinburgh Witness was a popular paper.", "The newspaper however began showing at times signs of the partisanship that its predecessor had been accused of. The most notable example occurred when the newspaper objected to the Provincial Councils policy of continuing an immigration policy with an emphasis in line with Cargill’s of encouraging  Scottish Presbyterian settlers. Cutten had married Cargill’s daughter, which lead to a falling out between the two until they reconciled. Generally however the newspaper supported Cargill, who was the province’s first Superintendent. The Witness' early issues gained some notoriety for its polemical editorials, which were often skewed in favor of the political views and policies of Dunedin founding father Captain William Cargill, but it soon became a more balanced journal."]}]}}