{"wiki_id": "http://www.wikidata.org/entity/Q2575649", "itemLabel": "Elisabeth Frink", "itemDescription": "English sculptor and printmaker (1930-1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Elisabeth_Frink", "wikipedia_page": {"main": "Dame Elisabeth Jean Frink  (14 November 1930 – 18 April 1993) was an English sculptor and printmaker. Her Times obituary noted the three essential themes in her work as \"the nature of Man; the 'horseness' of horses; and the divine in human form\".", "link_mentions": [{"page": "Chatsworth House", "response": ["*Modern sculpture includes such pieces as War Horse and Walking Madonna by Dame Elisabeth Frink, and 14 bronze portrait heads by Angela Conner. "]}, {"page": "Dorothy Hodgkin", "response": ["*British commemorative stamps - Hodgkin was one of five 'Women of Achievement' selected for a set issued in August 1996. The others were Marea Hartman (sports administrator), Margot Fonteyn (ballerina/choreographer), Elisabeth Frink (sculptor) & Daphne du Maurier (writer). All except Hodgkin were Dames Commander of the Order of the British Empire (DBEs). In 2010, during the 350th anniversary of the founding of the Royal Society, Hodgkin was the only woman in a set of stamps celebrating ten of the Society's most illustrious members, taking her place alongside Isaac Newton, Edward Jenner, Joseph Lister, Benjamin Franklin, Charles Babbage, Robert Boyle, Ernest Rutherford, Nicholas Shackleton and Alfred Russel Wallace."]}, {"page": "Fulham", "response": ["The Art Bronze Foundry, founded by Charles Gaskin in 1922 still operates in Michael Road, off the New King's Road, a short distance from Eel Brook Common. It has produced works by Henry Moore, Elisabeth Frink, Barbara Hepworth and Jacob Epstein among others. Its work may be seen in public spaces all over the world.Art Bronze Foundry London Ltd ; accessed 22 October 2016."]}, {"page": "Milton Keynes", "response": ["Other numerous public sculptures in Milton Keynes include work by Elisabeth Frink, Philip Jackson, Nicolas Moreton and Ronald Rae."]}, {"page": "West Bretton", "response": ["The Yorkshire Sculpture Park, consists of  of landscaped ground with a large collection of sculptures including some by Elisabeth Frink, some by Auguste Rodin, and others by local sculptors Barbara Hepworth, born in Wakefield, and Henry Moore, born in Castleford."]}, {"page": "Georg Solti", "response": ["In celebration of his 75th birthday in 1987, a bronze bust of Solti by Dame Elisabeth Frink was dedicated in Lincoln Park, Chicago, outside the Lincoln Park Conservatory.Eckert, Thor Jr. \"Milestone for Maestro Solti – Chicago style\", The Christian Science Monitor, 15 October 1987, accessed 21 March 2012 It was first displayed temporarily at the Royal Opera House in London.\"Grant Park: Sir Georg Solti Bust\" , Chicago Park District, accessed 21 March 2012 The sculpture was moved to Grant Park in 2006 in a new Solti Garden, near Orchestra Hall in Symphony Center."]}, {"page": "Christian art", "response": ["As a secular, non-sectarian, universal notion of art arose in 19th-century Western Europe, ancient and Medieval Christian art began to be collected for art appreciation rather than worship, while contemporary Christian art was considered marginal.  Occasionally, secular artists treated Christian themes (Bouguereau, Manet) — but only rarely was a Christian artist included in the historical canon (such as Rouault or Stanley Spencer).  However many modern artists such as Eric Gill, Marc Chagall, Henri Matisse, Jacob Epstein, Elisabeth Frink and Graham Sutherland have produced well-known works of art for churches.Beth Williamson, Christian Art: A Very Short Introduction, Oxford University Press (2004), page 110. Salvador Dalí is an artist who had also produced notable and popular artworks with Christian themes. Contemporary artists such as Makoto Fujimura have had significant influence both in sacred and secular arts. Other notable artists include Larry D. Alexander and John August Swanson. Some writers, such as Gregory Wolfe, see this as part of a rebirth of Christian humanism."]}, {"page": "Coventry Cathedral", "response": ["Coventry's new cathedral adopted a modernist design. The interior is notable for its huge tapestry (once thought to be the world's largest) of Christ, designed by Graham Sutherland, the emotive sculpture of the Mater Dolorosa by John Bridgeman in the East end, and the Baptistry window designed by John Piper (made by Patrick Reyntiens), of abstract design that occupies the full height of the bowed baptistery, which comprises 195 panes, ranging from white to deep colours. The stained glass windows in the Nave, by Lawrence Lee, Keith New and Geoffrey Clarke, face away from the congregation. Spence's concept for these Nave windows was that the opposite pairs would represent a pattern of growth from birth to old age, culminating in heavenly glory nearest the altar—one side representing Human, the other side, the Divine. Also worthy of note is the Great West Window known as the Screen of Saints and Angels, engraved directly onto the screen in expressionist style by John Hutton. A pane of the Hutton window, depicting The Angel with the Eternal Gospel, was smashed during a burglary in January 2020. (Although referred to as the West Window, this is the 'liturgical west' opposite the altar which is traditionally at the east end. In this cathedral the altar is actually at the north end.) The foundation stone, the ten stone panels inset into the walls of the cathedral called the Tablets of the Word, and the baptismal font were designed and carved by the émigré German letter carver Ralph Beyer. The lectern has a bookrest in the form of an eagle, by the sculptor Elisabeth Frink. She also designed the canopy for the Bishop's throne."]}, {"page": "List of people on the postage stamps of the United Kingdom", "response": ["*Elisabeth Frink (1996)"]}, {"page": "Religious art", "response": ["As a secular, non-sectarian, universal notion of art arose in 19th-century Western Europe, secular artists occasionally treated Christian themes (Bouguereau, Manet). Only rarely was a Christian artist included in the historical canon (such as Rouault or Stanley Spencer). However many modern artists such as Eric Gill, Marc Chagall, Henri Matisse, Jacob Epstein, Elisabeth Frink and Graham Sutherland have produced well-known works of art for churches.Beth Williamson, Christian Art: A Very Short Introduction, Oxford University Press (2004), page 110. Through a social interpretation of Christianity, Fritz von Uhde also revived the interest in sacred art, through the depiction of Jesus in ordinary places in life."]}, {"page": "1967 in art", "response": ["* May 14 – Dedication of Liverpool Metropolitan Cathedral in England, designed by Frederick Gibberd, with stained glass by John Piper, Patrick Reyntiens and Margaret Traherne and a bronze crucifix by Elisabeth Frink."]}, {"page": "Liverpool Metropolitan Cathedral", "response": ["On the altar, the candlesticks are by R. Y. Goodden and the bronze crucifix is by Elisabeth Frink. Above the altar is a baldachino designed by Gibberd as a crown-like structure composed of aluminium rods, which incorporates loudspeakers and lights.  Around the interior are metal Stations of the Cross, designed by Sean Rice. Rice also designed the lectern, which includes two entwined eagles. In the Chapel of Reconciliation (formerly the Chapel of Saint Paul of the Cross), the stained glass was designed by Margaret Traherne.  Stephen Foster designed, carved and painted the panelling in the Chapel of St. Joseph. The Lady Chapel contains a statue of the Virgin and Child by Robert Brumby and stained glass by Margaret Traherne. In the Blessed Sacrament Chapel is a reredos and stained glass by Ceri Richards and a small statue of the Risen Christ by Arthur Dooley. In the Chapel of Unity (formerly the Chapel of Saint Thomas Aquinas) is a bronze stoup by Virginio Ciminaghi, and a mosaic of the Pentecost by Hungarian artist Georg Mayer-Marton which was moved from the Church of the Holy Ghost, Netherton, when it was demolished in 1989. The gates of the Baptistry were designed by David Atkins."]}, {"page": "Lancaster University", "response": ["The Peter Scott Gallery is open to the public free of charge. The Gallery is located on the Bailrigg campus and houses the university's international art collection, which includes Japanese and Chinese art, antiquities, works by twentieth-century British artists including works by artists from the St Ives School, Sir Terry Frost, Wilhelmina Barns-Graham, Barbara Hepworth and William Scott. Among other British artists whose work is represented are Norman Adams, Patrick Caulfield, Elisabeth Frink, Kenneth Martin and Winifred Nicholson. Within the last fifteen years works by Andy Goldsworthy, Peter Howson and Albert Irvin have been acquired. The university collection also includes prints by significant European artists such as Dürer, Miró, Ernst and Vasarely."]}, {"page": "Worthing", "response": ["In the visual arts, painter Copley Fielding lived at 5 Park Crescent in the mid-18th century. and more recently Jamie Hewlett and Alan Martin created cult comic figure Tank Girl while at college in the town in the 1980s./  The town has a famous work by sculptor Elisabeth Frink. Uniquely in England, Desert Quartet (1990), Frink's penultimate sculpture, was given Grade II* listing in 2007, less than 30 years from its creation. It may be seen on the building opposite Liverpool Gardens.  Hand-painted by Gary Bevans over more than five years, English Martyrs' Catholic Church in Goring has the world's only known reproduction of Michelangelo's Sistine Chapel ceiling.", "* Liverpool Gardens – overlooking the graceful Georgian Liverpool Terrace, the gardens and terrace are named after Lord Liverpool. Overlooking the park from the east are four bronze heads known as Desert Quartet, sculpted by Dame Elisabeth Frink."]}, {"page": "List of awards and honours received by Nelson Mandela", "response": ["* City Council of Dublin, Ireland, unveiled sculpture in Merrion Square by Elisabeth Frink dedicated to Nelson Mandela, 26 June"]}, {"page": "West Suffolk (county)", "response": ["Shortly before its abolition the West Suffolk County Council commissioned Elisabeth Frink to sculpt a statue of St Edmund to commemorate the end of 970 years of independent administration of the area. The statue, in the grounds of the abbey of Bury St Edmunds, was completed in 1976."]}, {"page": "Murray Edwards College, Cambridge", "response": ["* Elisabeth Frink"]}, {"page": "Chelsea College of Arts", "response": ["At the beginning of the 1930s, the School of Art began to widen, including courses in craft training and commercial design from 1931. H.S Williamson, the school's appointed headmaster from 1930 to 1958, introduced sculpture shortly after World War II. Notable artists from this period were employed as teachers such as Henry Moore and Graham Sutherland. Alumni from this period included Elisabeth Frink, Edward Burra, Patrick Caulfield, Ethel Walker, Dirk Bogarde, Robert Clatworthy, John Latham and John Berger.", "* Elisabeth Frink (sculptor and printmaker)"]}, {"page": "Paternoster Square", "response": ["At the north end of the square is the bronze Paternoster (also known as Shepherd and Sheep) by Dame Elisabeth Frink. The statue was commissioned for the previous Paternoster Square complex in 1975, and was replaced on a new plinth following the redevelopment. Another sculpture in the square is Paternoster Vents by Thomas Heatherwick."]}, {"page": "Shirley, West Midlands", "response": ["Our Lady of the Wayside RC church contains one of Elisabeth Frink's Risen Christ sculpturesDomesday Reloaded: A Solihull Parish Priest (2) as well as art by Walter Ritchie."]}, {"page": "1990 in art", "response": ["* Elisabeth Frink - Desert Quartet (sculpture, Worthing, England) –"]}, {"page": "Exchange Square (Hong Kong)", "response": ["File:HK Central Exchange Square Man n OX red.JPG|A water buffalo by English sculptor Elisabeth Frink stands in Exchange Square"]}, {"page": "Frederick Gibberd", "response": ["A further achievement by Gibberd in planning Harlow is his incorporation of works by many leading architects of the post-war years, such as FRS Yorke, Powell & Moya, Graham Dawbarn, John Poulson, Maxwell Fry & Jane Drew, Michael Neylan, William Crabtree, Leonard Manasseh, ECP Monson, Gerard Goalen, Gerald Lacoste, Richard Sheppard and H. T. Cadbury-Brown. A substantial collection of public sculptures is visible around the town, including works by Henry Moore, Elisabeth Frink, Auguste Rodin and Barbara Hepworth."]}, {"page": "Woolland", "response": ["The sculptor Elisabeth Frink had a studio in the village during the 1970s."]}, {"page": "Art of the United Kingdom", "response": ["Henry Moore emerged after World War II as Britain's leading sculptor, promoted alongside Victor Pasmore, William Scott and Barbara Hepworth by the Festival of Britain.  The \"London School\" of figurative painters including Francis Bacon, Lucian Freud, Frank Auerbach, Leon Kossoff, and Michael Andrews have received widespread international recognition,Walker, 219-225 while other painters such as John Minton and John Craxton are characterized as Neo-Romantics. Graham Sutherland, the Romantic landscapist John Piper (a prolific and popular lithographer), the sculptor Elisabeth Frink, and the industrial townscapes of L.S. Lowry also contributed to the strong figurative presence in post-war British art."]}, {"page": "Liverpool Cathedral", "response": ["In 1993 \"The Welcoming Christ\", a large bronze sculpture by Dame Elisabeth Frink, was installed over the outside of the west door of the cathedral. This was one of her last completed works, installed within days of her death."]}, {"page": "Middlesbrough Institute of Modern Art", "response": ["Works include; Frank Auerbach, Elizabeth Blackadder, David Bomberg, Ken Currie, Jeremy Deller, Tracey Emin, Sir Jacob Epstein, Dame Elisabeth Frink, David Hockney, Peter Howson, Gwen John, Panayiotis Kalorkoti, L.S. Lowry, Ben Nicholson, Eduardo Paolozzi, Adrian Piper, Katherine Pleydell-Bouverie, Anne Redpath, Paula Rego, David Remfry, Lucie Rie, Stanley Spencer, Nancy Spero and Kara Walker."]}, {"page": "Windsor Sculpture Park", "response": ["The Windsor Sculpture Park, formerly known as the Odette Sculpture Park, is an open space in Windsor, Ontario, Canada, that shows 35 large-scale contemporary sculptures by world-renowned artists including Elisabeth Frink, Gerald Gladstone, and Sorel Etrog.", "File:Elisabeth Frink Odette Sculpture Park 02.jpg|Flying Men, Elisabeth Frink"]}, {"page": "1993 in art", "response": ["*Elisabeth Frink – Risen Christ (Liverpool Cathedral)", "*18 April – Dame Elisabeth Frink, English sculptor (b. 1930)."]}, {"page": "Victoria Building, University of Liverpool", "response": ["The Victoria Gallery & Museum is open to the public from Tuesday to Saturday each week and admission is free.  On the ground floor is the Waterhouse Café and a shop. On the first floor is the art collection which comprises paintings, sculptures and ceramics.  Artists represented include Joseph Wright of Derby, J. M. W. Turner, Jacob Epstein, Lucian Freud, Elisabeth Frink and John James Audubon.  A series of special exhibitions is organised.  Also on this floor is the Leggate Lecture Theatre in which educational talks are given."]}, {"page": "Ragley Hall", "response": ["Ragley was the site of the Jerwood Sculpture Park, opened in July 2004. The Park included works that won the Jerwood Sculpture Prizes, and the work of Dame Elisabeth Frink, among others. However the site was closed in April 2012."]}, {"page": "Tunstall, Staffordshire", "response": ["Tunstall was home to the independent Frink School of Figurative Sculpture, which occupied a fine old factory (and former Old Court) in Roundwell Street for a number of years until about 2004. The Frink School was named after Elisabeth Frink, British sculptress, and was a small intimate academy with a specific discipline of study closer in spirit to a master and apprentice structure than an educational institution. This has since moved to nearby Leek.Create Stoke Interview with Rosemary Barnett, head of The Frink School of Figurative Sculpture "]}, {"page": "1975 in art", "response": ["* Elisabeth Frink – Shepherd and Sheep"]}, {"page": "Elizabeth Frink", "response": ["#redirect Elisabeth Frink"]}, {"page": "Dame Elisabeth Frink", "response": ["#REDIRECTElisabeth Frink"]}, {"page": "Frink, Dame Elisabeth", "response": ["#REDIRECTElisabeth Frink"]}, {"page": "1930 in art", "response": ["* 14 November – Elisabeth Frink, English sculptor (d. 1993)"]}, {"page": "Margam Country Park", "response": ["in 1985 a sculpture park was established by the Welsh Sculpture Trust which exhibited work by internationally famous sculptors including Henry Moore, Barbara Hepworth and Elisabeth Frink. The sculpture park has since closed."]}, {"page": "Peter Hawkins", "response": ["Hawkins was the owner of a fine art collection, including works by Monet, Pissarro and Alfred Sisley, Graham Sutherland, Sir Jacob Epstein, and Dame Elisabeth Frink. He also owned a collection of Japanese sword guards and was very keen on Japanese delicacy."]}, {"page": "1952 in art", "response": ["* Elisabeth Frink – Bird"]}, {"page": "Steve Shirley", "response": ["In 2012, Shirley donated the entirety of her art collection, including works by Elisabeth Frink, Maggi Hambling, Thomas Heatherwick, Josef Herman and John Piper to Prior's Court School and the charity Paintings in Hospitals."]}]}}