{"wiki_id": "http://www.wikidata.org/entity/Q2582394", "itemLabel": "Robert Swan", "itemDescription": "English explorer", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Swan", "wikipedia_page": {"main": "Robert Charles Swan, OBE, FRGS (born ) is the first person to walk to both Poles.\n\nHe was born on 28 July 1956 in Durham, England, and attended Aysgarth School and then Sedbergh School (1969–1974) before completing a BA degree in Ancient History (1976–1979) at St Chad's College, Durham University. He is currently an advocate for the protection of Antarctica and renewable energy. Swan is also the founder of 2041, a company which is dedicated to the preservation of the Antarctic and the author with Gil Reavill of Antarctica 2041: My Quest to Save the Earth's Last Wilderness.In November 2017, Swan undertook the South Pole Energy Challenge, the first expedition of its kind: a 600-mile journey to the South Pole with his son Barney Swan, surviving solely using renewable energy.", "link_mentions": [{"page": "July 28", "response": ["*  1956   – Robert Swan, English explorer"]}, {"page": "1985", "response": ["* November 3 - The Footsteps of Scott expedition, lead by Robert Swan set off from Ross Island, retracing Robert Falcon Scott's ill-fated route to the South Pole."]}, {"page": "Martin Chávez", "response": ["Chavez serves on the Board of the Mexican American Legal Defense and Educational Fund (MALDEF). Chávez is a member of the National Building Museum's Intelligent Cities Advisory Committee and member of the U.S. Department of Agriculture's Vibrant Cities and Urban Forests Task Force.Task Force Members | Vibrant Cities & Urban Forests  In March 2011, Chávez joined polar explorer and environmentalist Robert Swan, on an expedition to explore the effects of climate change in the Antarctica. Chávez visited the remnants of the Larsen Ice Shelf known as \"Larsen B\"; once an ice shelf larger than the state of Rhode Island, which disintegrated over a three-week period in 2002 as a result of climate change. Chavez serves a Member of the Board of Directors of American Rivers.http://www.americanrivers.org/about/governance/"]}, {"page": "Boardman Tasker Prize for Mountain Literature", "response": ["*1987 Roger Mear and Robert Swan, In the Footsteps of Scott"]}, {"page": "St Chad's College, Durham", "response": ["* Robert Swan –  BA degree in Ancient History (1976–1979) – Honorary Fellow, Explorer – the first person to reach both the South and North Pole on foot"]}, {"page": "Robert", "response": ["* Robert Swan, the first person to walk to both Poles"]}, {"page": "List of polar explorers", "response": ["* Robert Swan"]}, {"page": "North Wales Wildlife Trust", "response": ["*2001 Robert Swan"]}, {"page": "Sedbergh School", "response": ["*Robert Swan OBE, Polar explorer: the first man in history to walk to both the North and South Poles"]}, {"page": "List of Durham University people", "response": ["* Robert Swan (St Chad's) – Honorary Fellow of St Chad's, Explorer – the first person to reach both the South and North Pole on foot"]}, {"page": "List of Antarctic expeditions", "response": ["* 1984–1987 – In the Footsteps of Scott – led by Robert Swan"]}, {"page": "Richard Weber (explorer)", "response": ["* \"The Arctic is a very challenging terrain and in order to face it you need to be with the right people. There are no two better people in the world to be with than Mikhail Malakhov and Richard Weber. They are the best.\" (Robert Swan)"]}, {"page": "Ben Saunders (explorer)", "response": ["Robert Swan OBE and Falcon Scott (Captain Scott's grandson) were patrons of the expedition."]}, {"page": "Robert Swann", "response": ["Robert Swann may refer to:", "*Robert Swann, co-founder of Alphamosaic", "*Robert Swann (land trust pioneer) (1918–2003), founder of the E. F. Schumacher Society", "*Robert Swann (actor) (1945–2006), British actor", "*Robert Swan (born 1956), Antarctic explorer", "*Robert Swan (alpine skier) (born 1943), Canadian former alpine skier"]}, {"page": "Cinema of the United Arab Emirates", "response": ["|Mariam Al Qassimi, Rashed Al Zaabi, Winston Cowie,  Razan Khalifa Al Mubarak, Jane Goodall, Robert Swan."]}, {"page": "2008 Summer Olympics torch relay route", "response": ["| April 5 || colspan=2|  ()(start)Victory Square(finish)Palace Square || 20 km || Lyubov Yegorova – cross-country skiingViktor Zhdanovich – fencingVladimir Salnikov, Alexander Popov, Sergey Kopliakov, Andrey Krylov – gold medalist swimmerAlexander Dityatin – gold medalist artistic gymnasticsTatyana Kazankina – gold medalist runnerAnatoly Alyabyev – gold medalist biathlonEvgeni Plushenko, Tatiana Totmianina, Maxim Marinin, Anton Sikharulidze, Alexei Urmanov, Oksana Kazakova, Artur Dmitriev, Oleg Vasiliev – gold medalist figure skaterSvetlana Zhurova – speed skatingTamara Moskvina – figure skating coachFedor Emelianenko – mixed martial artistRobert Swan – polar explorersArtur Chilingarov – cosmonautValentina Tereshkova – astronautAlisa Freindlich – actressAndrei Arshavin – football player Olympic Torch route in Saint Petersburg with all torchbearers and lap definitions (.doc file) See also:  Olympic Torch Will Be Carried By Drouz, Freindlich and Evgeni Plushenko See also:  Олимпийский огонь несли || 80"]}, {"page": "Aysgarth School", "response": ["*Robert Swan, Polar explorer"]}, {"page": "List of Question Time episodes", "response": ["|Cheryl Gillan, Ieuan Wyn Jones, Glenys Kinnock, Robert Swan, Lembit Opik"]}, {"page": "List of Desert Island Discs episodes (1991–2000)", "response": ["|||Robert Swan||Huge copy of The Times atlas – largest available so he can see where he has been (168 countries so far)||An accountancy course|| more"]}, {"page": "Focus Corporation", "response": ["Focus was also part of a team of Canadian environmental professionals that were sent to assess the cleanup of surface debris from Bellingshausen Station, a Russian Research Station located at Bellingshausen, Antarctica. The expedition was led by Robert Swan. Their findings will be presented to the United Nations at the World Earth Summit in Rio de Janeiro in 2012."]}, {"page": "Ecoweek", "response": ["In 2017 ECOWEEK published its first book titled ECOWEEK Book#1: 50 Voices for Sustainability, featuring fifty articles by leading architects, designers, professionals, academics and environmentalists from around the world. Among them award-winning architects Kengo Kuma, BIG, MVRDV, Francoise-Helene Jourda, Diebedo Francis Kere, Michael Sorkin, Prof. David Orr and Antarctica explorer Robert Swan. The same year ECOWEEK also issued ECOWEEK: The Workshops a publication with a collection of ideas and projects from the ECOWEEK workshops (2009-2016)."]}, {"page": "Sue Stockdale", "response": ["In October 1996, Stockdale returned to her roots and reunited with Raleigh International. This time, she was Deputy Expedition Leader during a 3-month stint in Chile. From there, she joined Robert Swan as a mentor on his UNESCO “One Step Beyond Expedition” to Antarctica. The expedition saw 35 young people from 25 countries sail down to Antarctica on board the Professor Khromov, and work on a number of cultural and environmental initiatives. Stockdale then joined an International expedition to the Geographical North Pole in 1998, led by Victor Boyarsky, which covered the last degree from 89 degrees to the North Pole from Ice Camp Barneo on the Russian side of the Arctic. The expedition, dubbed “Brave Hearts in the Arctic”, saw her run into former expedition leader Hempleman Adams in a chance encounter, who was awaiting an airlift home from a helicopter."]}]}}