{"wiki_id": "http://www.wikidata.org/entity/Q2580060", "itemLabel": "William Moon", "itemDescription": "British inventor", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Moon", "wikipedia_page": {"main": "William Moon, Hon. LLD, FRSA, FRGS (18 December 1818 – 9 October 1894) was an Englishman who created Moon type, the first widely used practical reading alphabet for the blind.", "link_mentions": [{"page": "Moon type", "response": ["Moon type was developed by William Moon (1818—1894), a blind Englishman living in Brighton, East Sussex. After a bout of scarlet fever, Moon lost his sight at age 21 and became a teacher of blind children.  He discovered that his pupils had great difficulty learning to read the existing styles of embossed reading codes, and devised his own system that would be \"open and clear to the touch.\"Farrell, p. 102.", "* \"William Moon\""]}, {"page": "Horsmonden", "response": ["*William Moon (1818–94), teacher and philanthropist, was born in Horsmonden"]}, {"page": "List of people from Brighton and Hove", "response": ["*William Moon, teacher and inventor of an alphabet for the blind"]}, {"page": "Robert Charles Moon", "response": ["Robert Charles Moon (1844–1914) was an ophthalmologist who practiced medicine in England and the United States. He was the son of William Moon (1818–1894), inventor of \"Moon type\", an embossed alphabet for the blind."]}, {"page": "Sir Charles Lowther, 3rd Baronet", "response": ["Lowther was a benefactor of William Moon, funding the construction of his workroom in 1856 and donating to the Moon Society, which distributed literature for the blind in Moon type."]}, {"page": "Dr. William Moon", "response": ["#REDIRECT William Moon"]}, {"page": "Ross School of Business", "response": ["Michigan Journal of Business is a biannual, peer-reviewed, open access, academic journal that is published by undergraduate students at the Stephen M. Ross School of Business (University of Michigan). It was established in 2007 by William Moon and publishes theses, empirical research, case studies, and theories relating to accounting, economics, finance, marketing, management, operations management, information systems, business law, corporate ethics, and public policy. The editorial staff is composed of students of the University of Michigan. The journal is abstracted and indexed in EBSCO's Business Source Complete database. Archival issues are available at the MJB's website."]}, {"page": "Portal talk:Writing", "response": ["Moon (William Moon) - "]}, {"page": "James Hatley Frere", "response": ["He devised a cheap method of setting up and stereotyping his books. 'The letters, formed of copper wire, are laid on a tin plate, previously washed over with a solution of zinc; when heat is applied to the under-surface, the letter becomes soldered on to the plate, and such plates produced extremely good printing'. T. M. Lucas of Bristol and William Moon of Brighton adopted this system of stereotyping."]}, {"page": "William Moon (disambiguation)", "response": ["William Moon may refer to:", "*William Moon, inventor of Moon type", "*William Moon (EastEnders), fictional character on the BBC soap opera EastEnders"]}, {"page": "Moon (surname)", "response": ["*William Moon (1818–1894), English inventor of Moon type, a writing system for the blind", "*William Moon (EastEnders)"]}, {"page": "Moon, William", "response": ["#redirectWilliam Moon"]}, {"page": "Visual impairment in art", "response": ["* Portrait of William Moon, created by an unknown photographer. Published in Light for the Blind: History of the Origin and Success of Moon's System of Reading 1873."]}]}}