{"wiki_id": "http://www.wikidata.org/entity/Q258656", "itemLabel": "Sarah Aaronsohn", "itemDescription": "Jewish spy working for the British in World War I", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Aaronsohn", "wikipedia_page": {"main": "Sarah Aaronsohn (Hebrew: שרה אהרנסון‎; 5 January 1890 – 9 October 1917) was a member of Nili, a ring of Jewish spies working for the British in World War I, and a sister of notable agronomist Aaron Aaronsohn. She is often referred to as the \"heroine of Nili.\"", "link_mentions": [{"page": "1890", "response": ["* January 5 – Sarah Aaronsohn, member of the Jewish spy ring Nili (d. 1917)"]}, {"page": "Nili", "response": ["Sarah Aaronsohn, her brothers Aaron and Alex, and their sister Rivka, together with their friend (and Rivka's fiancé) Avshalom Feinberg formed and led Nili.", "In 1915, even before the group commenced operations, the Turks imprisoned Feinberg on suspicion of spying, which was not true at the time. When Feinberg was arrested for espionage and held in Beersheba, Yosef Lishansky joined Nili in December 1915. Because he was active in the south, he was recruited by Feinberg to pass information to and from Sarah Aaronsohn, who was operating from Atlit.", "*Spies in Palestine: Love, Betrayal, and the Heroic Life of Sarah Aaronsohn by James Srodes (2016, Counterpoint Press)  ", "* Prof.  Billie Melman, Sarah Aaronsohn (Jewish Women: A Comprehensive Historical Encyclopedia, Jewish Women's Archive)"]}, {"page": "List of Zionists", "response": ["* Sarah Aaronsohn"]}, {"page": "Zikhron Ya'akov", "response": ["Zikhron Ya'akov came to fame during World War I for the establishment of the Nili spy ring by Sarah Aaronsohn, together with her brothers, Aaron (a noted botanist) and Alex, and their friend Avshalom Feinberg. The group volunteered to spy on Ottoman positions and report them to British agents offshore. In September 1917, the Ottomans caught one of Sarah's carrier pigeons and cracked the Nili code. In October, they surrounded Zikhron Ya'akov and arrested Sarah and several others. After four days of torture, they planned on transporting Sara elsewhere, she requested to be taken home to change her clothes and shot herself with a pistol hidden in her bathroom and died after several days. Sara shot herself in the throat, leaving her unable to speak, in order to avoid releasing classified information. The Aaronsohn House–Nili Museum recreates the history of this period.", "*Sarah Aaronsohn"]}, {"page": "Richard Meinertzhagen", "response": ["During 1917, Meinertzhagen was transferred from East Africa to be put in place at Deir el-Belah. He made contact with Nili, a Jewish spy network headed by the agronomist Aaron Aaronsohn. Meinertzhagen later asserted that he respected Aaronsohn more than anyone else he ever met. They were instrumental in contacting Jewish officers in the Ottoman army, amongst many other sources, for information, and attempted their defection to the allies. A German Jewish doctor stationed at el-Afulah railway junction gave valuable reconnaissance reports on troop movements south.  Meinertzhagen's department produced regular maps from the data showing the dispositions of enemy forces in the desert.R. M's Army Diary, 1899–1926, pp. 224–5; Sheffy, British Military Intelligence, pp. 269–73; J.D. Grainger, Palestine 1917, pp. 100–1 In October 1917, the Turks broke up the network by intercepting a carrier pigeon and subjecting the Jews to hideous torture. Sarah Aaronsohn, (Aaron's sister), age 27, a key figure, committed suicide in her home after torture.Sarah Aaronsohn (Jewish Virtual Library, based on New Encyclopedia of Zionism and Israel, ed., Geoffrey Wigoder, Copyright 1994 by Associated University Press, The Jewish Agency for Israel and The World Zionist Organization.) Meinertzhagen's sources of information dwindled to the occasional prisoner caught out by patrols and deserters."]}, {"page": "Aaron Aaronsohn", "response": ["During World War I, the Ottomans had joined sides with the Germans, and Aaronsohn feared the Jews would suffer the same fate as the Armenians under the Turks. Together with his assistant Avshalom Feinberg, his sister Sarah Aaronsohn and a few others, Aaronsohn organized Nili, a ring of Jewish residents of Palestine who spied for Britain during World War I. He recommended the plan of attack through Beersheva that General Edmund Allenby ultimately used to take Jerusalem in December 1917 as part of the Sinai and Palestine Campaign. Owing to information supplied by Nili to the British Army concerning the locations of oases in the desert, General Allenby was able to mount a surprise attack on Beersheba, bypassing strong Ottoman defenses in Gaza."]}, {"page": "Avshalom Feinberg", "response": ["Feinberg was born in Gedera, Palestine, then part of the Ottoman Empire, to Israel Lolik Feinberg and Fanny Feinberg (née Belkind). He had two sisters, Tzila and Shoshanna. Feinberg studied in France. He then returned to work with Aaron Aaronsohn at the agronomy research station in Atlit. Soon after war began, the four Aaronsohn siblings (Sarah Aaronsohn, Rivka, Alex, and Aaron) founded the Nili underground along with Feinberg. They were later joined by Yosef Lishansky and others. In 1915 Feinberg traveled to Egypt and made contact with the British Department of Naval Intelligence. In 1917, he again went to Egypt, on foot. He was apparently killed on his way back by a group of Bedouins near the British front in Sinai, close to Rafah. His fate was unknown until after the 1967 Six-Day War, when his remains were found under a palm tree that had grown from date seeds in his pocket."]}, {"page": "October 1917", "response": ["* Died: Hussein Kamel of Egypt, Egyptian noble, Sultan of Egypt from 1914 to 1917 (b. 1853); Sarah Aaronsohn, Jewish Palestinian spy, member of the Nili spy network, sister to botanist Aaron Aaronsohn (b. 1890)"]}, {"page": "Alexander Aaronsohn", "response": ["Aaronsohn was part of the influential Aaronsohn family who were major figures in the Zionist movement; his brother was Aaron Aaronsohn and his sister was Sarah Aaronsohn, the three of whom were founder members of the Jewish spy network NILI. Sarah Aaronsohn was caught by the Turks, brutally tortured and committed suicide at home during her custody in 1917, aged 26."]}, {"page": "Aliyah and Yishuv during World War I", "response": ["A big coalition of dozens of activists inside of the land of Israel decided to go against the decision of the World Zionist Organization on being neutral and they established the underground Nili organization. The leaders of Nili were Aaron and Sarah Aaronsohn, Avshalom Feinberg and Joseph Lishinski. The underground acted within the land of Israel and in Syria between 1915 and 1917. The interconnection between the Nili and the British intelligence took place during visits British ships in Atlit, through messengers in Egypt, and pigeon post (when they needed to send announcements fast). Nili was exposed in 1917, and the Turkish authorities started a retaliation against the underground network and against the whole Jewish settlement."]}, {"page": "List of people on the postage stamps of Israel", "response": ["*Sarah Aaronsohn – Zionist martyr (1991, 2015)"]}, {"page": "Aaronson", "response": ["* Sarah Aaronsohn  (1890–1917), Jewish spy working for the British in World War I, sister of Aaron Aaronsohn"]}, {"page": "Postage stamps and postal history of Israel", "response": ["Researchers at Emory University found that, through 2005, 161 Israeli stamps deal with women, though most do so anonymously. Of the 45 stamps dedicated to individual women, 11 concerned Biblical characters and eight were of fighters: Haviva Reik, Hannah Szenes, Rachel Yanait Ben Zvi, Rivka Guber, Rene Levy, Zivia Lubetkin, Sarah Aaronsohn, and an unnamed member of the Jewish Brigade."]}, {"page": "Sara Aharonson", "response": ["#redirect Sarah Aaronsohn"]}, {"page": "Sarah Aharonson", "response": ["#redirect Sarah Aaronsohn"]}, {"page": "Yosef Lishansky", "response": ["Lishansky joined Nili in December 1915, when Avshalom Feinberg was arrested for espionage and held in Beersheba. Because he was active in the south, he was recruited by Feinberg to pass information to and from Sarah Aaronsohn, who was operating from Atlit. He did this by hiding notes in the loaves of bread passed to the prisoners. In January 1917, after Feinberg was released and sought to secretly travel to Egypt to meet with the British, he was accompanied by Lishansky, who had intimate knowledge of the area. On 20 January they were attacked by two Ottoman soldiers and a gang of Bedouin near Rafah, which left Feinberg dead and Lishansky wounded. Lishansky was left to die but managed to reach a British patrol that took him to a hospital in Port Said, where he met Aaron Aaronsohn on 25 January 1917, and told him about Feinberg's death. Because Lishansky was the only witness to the killing, rumors started circulating that he was the one who killed Feinberg for personal reasons, or because of a romance with Sarah Aaronsohn. They were disproved only after the Six-Day War, when Feinberg's remains were found and the Bedouin in the region interrogated.", "In October 1917, while Lishansky was in Zikhron Ya'akov, the Ottoman authorities received information about Nili's activities by accidentally catching a homing pigeon with a message from Sarah Aaronsohn, and after capturing the Nili operative Na'aman Belkind, they found out about a cell in Zikhron. They encircled the village, capturing Sarah Aaronsohn, but Lishansky managed to escape, and became a fugitive with a price on his head. He met with HaShomer members carrying gold and accompanied them to Tel Adas."]}, {"page": "Timeline of Ottoman Syria history", "response": ["*5 January – Sarah Aaronsohn (b. Zikhron Ya'akov), Palestinian Jewish spy, member of the Nili spying network (d. 1917)."]}, {"page": "Sarah Aaronson", "response": ["#redirect Sarah Aaronsohn"]}, {"page": "James Srodes", "response": ["His most recent biography is Spies in Palestine: Love, Betrayal and the Heroic Life of Sarah Aaronsohn published by Counterpoint Press in 2016. The book is the story of Sarah Aaronsohn and her prominent family, early settlers of Palestine who formed the NILI espionage network to spy for the Allies against the Ottoman Turkish Empire during World War One.Goulden, Joseph C.. “Book Review: Spies in Palestine: Love, Betrayal and the Heroic Life of Sarah Aaronsohn,” Washington Times, November 27, 2016. The book is a story of lost opportunities. The Times of Israel quotes Srodes as saying, “There was a brief window at the turn of the 20th century where Jews and Arabs had a common alliance of sorts that could have been built on, because they had a common enemy in the Ottoman Turks. But the fact that it didn’t turn out that way is a real tragedy.” O’Malley, JP. “With Spy Sarah Aaronsohn’s Suicide, Israeli History was Rewritten, Claims Author,” Times of Israel, December 14, 2006. According to Booklist, “In this engaging story of the woman called the Flame of Israel, a woman greatly admired by the fabled Lawrence of Arabia, Srodes also details the lost opportunity for a peaceful alliance between the new Israel and the indigenous people of the region.”Bush, Vanessa. “Review of Spies in Palestine,” Booklist, September 15, 2016.", "*Spies in Palestine: Love, Betrayal and the Heroic Life of Sarah Aaronsohn (2016, Counterpoint Press) ()"]}, {"page": "Aaronsohn, Sarah", "response": ["#redirectSarah Aaronsohn"]}, {"page": "Template talk:Authority control/Archive 11", "response": ["::::I don't doubt that it exists, now. I wondered if it was necessary. Random example, Sarah Aaronsohn, has 5 IDs at the National Library of Israel. So this is not actually a real authority control for Aaronsohn, but a group of pages related to her. And frankly, all 5 are useless. So why should we spend effort in providing these 5? Lasse Åberg has two links to the Swedish national library, both are basically empty, but one is for Lars-Erik Åberg. Same person? Related? No idea, and neither won't anyone directed to that second page. Worth the extra effort? No. The Abbasid dynasty has three VIAF codes. This is an error at VIAF side, not here. Show one and be done with it. Fram (talk) 12:08, 6 April 2021 (UTC)"]}]}}