{"wiki_id": "http://www.wikidata.org/entity/Q2580133", "itemLabel": "William Norwood Potter", "itemDescription": "English chess player", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Norwood_Potter", "wikipedia_page": {"main": "William Norwood Potter (27 August 1840 – 13 March 1895) was an English chess master and writer. He is primarily remembered for the quality of his chess journalism, and for his association with Wilhelm Steinitz, the first winner of a world chess championship match.", "link_mentions": [{"page": "Howard Staunton", "response": ["In response to Morphy's complaints Lord Lyttelton, then president of the British Chess Association, said that it was reasonable for Staunton to decline the match, but that in his opinion Staunton should have done so plainly in his first letter to America, but had instead often given the impression that he would soon be ready to start the match.  later wrote, although not specifically about this affair, that he thought there was no chance of Staunton's health being good enough for a serious contest from 1853 onwards. William Norwood Potter wrote in his obituary of Staunton in the City of London Chess Magazine"]}, {"page": "John Cochrane (chess player)", "response": ["Even after Cochrane returned to India, later in 1843, Staunton's articles and books continued to publish Cochrane's games, and contain most of the games by Cochrane that are still known about, whether played in England or India. It was Staunton who made British chess aware of how strong Cochrane was at his peak, and described him as \"Father of the English Chess School\". During the second part of Cochrane's career in India his main opponents were the Indian players Moheschunder Bannerjee and Saumchurn Guttack. Cochrane's first recorded use of the Cochrane Gambit against Petrov's Defence was in a game against Bannerjee in 1848. Bannerjee's fondness for fianchettoed openings, as reported by Cochrane, eventually led to the Indian defence class of openings.  Another game, published in William Norwood Potter's City of London Chess Magazine shows Bannerjee playing with the black pieces and beating Cochrane in a game that opened with the King's Indian Four Pawns Attack. When Staunton organised the world's first international chess tournament, the Calcutta Chess Club as a group made one of the largest donations to the tournament's funds, and in addition its principal officers Cochrane and T.C. Morton made two of the largest personal contributions.This can be viewed online at or downloaded as PDF from  During his second period in India Cochrane became known as the Father of the Calcutta Bar (local association of barristers). Staunton also published an incident in which Cochrane gave the whole of his fee for a case to a group of famine-stricken Indians"]}, {"page": "Mary Potter", "response": ["Mary Potter was born in a rented house at 23 Old Jamaica Road in Bermondsey, South London. She was the fifth child, and the only girl, born to William and Mary Anne (Martin) Potter. One of her brothers was the chess master William Norwood Potter. Mary Potter had a congenital heart and lung disease which left her in frail health, and with a permanent cough, for the rest of her life. Her father left the family home in 1848, went to Australia, and never returned, leaving his wife to raise the children by herself.\"Mary Potter: Her Story\", Little Sisters of the Poor"]}, {"page": "William Potter", "response": ["* William Norwood Potter (1840–1895), English chess player and writer"]}]}}