{"wiki_id": "http://www.wikidata.org/entity/Q2585866", "itemLabel": "Christopher Robin Milne", "itemDescription": "English author and bookseller", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Robin_Milne", "wikipedia_page": {"main": "Christopher Robin Milne (21 August 1920 – 20 April 1996) was an English author and bookseller and the only child of author A. A. Milne. As a child, he was the basis of the character Christopher Robin in his father's Winnie-the-Pooh stories and in two books of poems.\n\n", "link_mentions": [{"page": "A. A. Milne", "response": ["He was the father of bookseller Christopher Robin Milne, upon whom the character Christopher Robin is based.", "Milne married Dorothy \"Daphne\" de Sélincourt (1890–1971) in 1913 and their son Christopher Robin Milne was born in 1920. In 1925, Milne bought a country home, Cotchford Farm, in Hartfield, East Sussex.", "Milne is most famous for his two Pooh books about a boy named Christopher Robin after his son, Christopher Robin Milne (1920–1996), and various characters inspired by his son's stuffed animals, most notably the bear named Winnie-the-Pooh. Christopher Robin Milne's stuffed bear, originally named Edward, was renamed Winnie after a Canadian black bear named Winnie (after Winnipeg), which was used as a military mascot in World War I, and left to London Zoo during the war. \"The Pooh\" comes from a swan the young Milne named \"Pooh\". E. H. Shepard illustrated the original Pooh books, using his own son's teddy Growler (\"a magnificent bear\") as the model. The rest of Christopher Robin Milne's toys, Piglet, Eeyore, Kanga, Roo and Tigger, were incorporated into A. A. Milne's stories, and two more characters – Rabbit and Owl – were created by Milne's imagination. Christopher Robin Milne's own toys are now on display in New York where 750,000 people visit them every year.", "The bulk of A. A. Milne's papers are housed at the Harry Ransom Center at the University of Texas at Austin. The collection, established at the center in 1964, consists of manuscript drafts and fragments for over 150 of Milne's works, as well as correspondence, legal documents, genealogical records, and some personal effects. The library division holds several books formerly belonging to Milne and his wife Dorothy. The Harry Ransom Center also has small collections of correspondence from Christopher Robin Milne and Milne's frequent illustrator Ernest Shepard."]}, {"page": "Dartmouth, Devon", "response": ["* Christopher Robin Milne, son of A. A. Milne, after whom the character Christopher Robin in the Winnie-the-Pooh books was named, used to own the Harbour Bookshop.  The bookshop was reported as facing closure in September 2011 and the report was fulfilled."]}, {"page": "1996", "response": ["* April 20 – Christopher Robin Milne, English author and bookseller (b. 1920)"]}, {"page": "1920", "response": ["* August 21 – Christopher Robin Milne, English author, bookseller (d. 1996)"]}, {"page": "The Wind in the Willows", "response": ["In The Enchanted Places, Christopher Robin Milne wrote of The Wind in the Willows:"]}, {"page": "Tigger", "response": ["Tigger is a fictional character, an anthropomorphic stuffed tiger. He was originally introduced in the 1928 story collection The House at Pooh Corner, the sequel to the 1926 book Winnie-the-Pooh by A. A. Milne. Like other Pooh characters, Tigger is based on one of Christopher Robin Milne's stuffed toy animals. He appears in the Disney cartoon versions of Winnie the Pooh and has also appeared in his own film, The Tigger Movie (2000).", "Like most of the characters in Winnie-the-Pooh, Tigger was based on one of Christopher Robin Milne's stuffed animals, in this case a stuffed-toy tiger. However, the word \"tiger\" is never actually used in the book. The term \"Tigger\" is used instead, both as the character's name and as a description of his type of animal. No other \"Tiggers\" appear in the story, and at one point Tigger (who has just seen his reflection in a mirror and mistaken it for another individual) comments he thought he was the only one. Despite that belief, he constantly uses the term in the plural, as in \"Tiggers don't like honey.\" and \"So that's what Tiggers like!\", etc. The term is always capitalized."]}, {"page": "Christopher Robin", "response": ["Christopher Robin is a character created by A. A. Milne, based on his son Christopher Robin Milne. The character appears in the author's popular books of poetry and Winnie-the-Pooh stories, and has subsequently appeared in various Disney adaptations of the Pooh stories.", "Christopher Robin appears in Milne's poems and in the two books: Winnie-the-Pooh (1926) and The House at Pooh Corner (1928). In the books he is a young boy and one of Winnie-the-Pooh's best friends. His other friends are Eeyore, Kanga, and Roo, Rabbit, Piglet, Owl, and Tigger. In the second book, there are hints that Christopher Robin is growing up. In the final chapter, the inhabitants of the Hundred Acre Wood throw him a farewell party after learning he must leave them soon. It is implied that he will attend boarding school; Christopher Robin Milne, for whom the stories were originally developed, left home to attend Stowe School at age 9.", "== Christopher Robin Milne ==", "Christopher Robin was based on the author A. A. Milne's son, Christopher Robin Milne, who later in life became disappointed about the use of his name. Christopher Milne wrote in one of a series of autobiographical works: \"It seemed to me almost that my father had got where he was by climbing on my infant shoulders, that he had filched from me my good name and left me nothing but empty fame,\" One of the poems, \"Vespers\" – which describes young Christopher Robin saying his evening prayers – was said by Christopher Milne as \"the one work that has brought me over the years more toe-curling, fist-clenching, lip-biting embarrassment than any other.\"Eccleshare, Julia. 2002. Beatrix Potter to Harry Potter: portraits of children's writers. National Portrait Gallery. . p. 33"]}, {"page": "Piglet (Winnie-the-Pooh)", "response": ["Like most of the characters, Piglet was based on one of Christopher Robin Milne's stuffed animals. In the original color versions of Ernest H. Shepard's illustrations in the Winnie‑the‑Pooh books, Piglet has pale pink skin and a green jumper. He is smaller than most animals, being only slightly taller than Roo. His voice is described as \"squeaky\"."]}, {"page": "Rabbit (Winnie-the-Pooh)", "response": ["While most of the cast in the books are based on stuffed animals owned by Christopher Robin Milne, Ernest H. Shepard's illustrations of Rabbit look more like a living animal. Rabbit resembles an ordinary rabbit, except that he walks on two legs and uses his front paws as hands. The top of his head reaches about to Pooh's nose."]}, {"page": "Roo", "response": ["Roo is a fictional character created in 1926 by A. A. Milne and first featured in the book Winnie–the–Pooh. He is a young kangaroo (known as a joey) and his mother is Kanga. Like most other Pooh characters, Roo is based on a stuffed toy animal that belonged to Milne's son, Christopher Robin Milne, though stuffed Roo was lost in the 1930s in an apple orchard somewhere in Sussex.The Teacher's Calendar School Year 2006-2007, page 125 (McGraw-Hill Professional 2006): \"Piglet, Kanga, Roo, and Tigger were all stuffed animals\".", "Like most of the characters in Winnie-the Pooh, Roo was based on one of Christopher Robin Milne's stuffed toys. The illustrations show Roo with brown fur and an upturned tail."]}, {"page": "Ashdown Forest", "response": ["In the 1980s the Lord of the Manor, William Sackville, 10th Earl De La Warr, offered Ashdown Forest for sale direct to the local authority, East Sussex County Council, if they would buy it; otherwise he would probably sell the forest piecemeal on the open market.Willard (1989), p.167. On 25 November 1988 this threat to split up the forest was averted when, with the benefit of donations from many sources, including the proceeds of a public appeal supported by Christopher Robin Milne that raised £175,000, East Sussex County Council purchased the freehold of Ashdown Forest from the executors of the Earl, who had died the previous February. The freehold was then vested by the council in a newly created charitable trust, the Ashdown Forest Trust.", "The freehold of Ashdown Forest, which essentially consists of the common land set aside in 1693, when the ancient forest was divided up by decree of the Duchy of Lancaster, plus a number of later land acquisitions, is owned by the Ashdown Forest Trust, a registered charity controlled and managed by East Sussex County Council. Ownership was vested in the trust after the council bought the freehold from the executors of the Lord of the Manor, the 10th Earl De La Warr, in November 1988. This purchase was the culmination of a high-profile and passionate fund-raising campaign by members of the public, which included an endorsement by Christopher Robin Milne (by then living and working in Devon), who were concerned that the earl's stated intention, in the absence of a purchase of the forest by the county council, was to sell it piecemeal into private hands, a possibility which seemed to become more likely when the earl died before the contract could be completed. Fortunately, the county council was able to complete the purchase from the executors, the council matching the amount raised by the public campaign to enable the asking price of over £1 million to be met.See Willard (1989), pp. 167-176, for a first-hand account of the fund-raising campaign. She herself had served for many years as a member of the Board of Conservators."]}, {"page": "1920 in literature", "response": ["*August 21 – Christopher Robin Milne, English writer and bookseller (died 1996)"]}, {"page": "1996 in literature", "response": ["*April 20 – Christopher Robin Milne, English writer and bookseller (born 1920)"]}, {"page": "The New Adventures of Winnie the Pooh", "response": ["Winnie the Pooh was created by British author A.A. Milne in the 1920s. The character was named after a teddy bear owned by his son, Christopher Robin Milne. He had named his toy bear after Winnie, a Canadian black bear he often saw at London Zoo, and \"Pooh\", a swan they had met while on holiday. Drawing from this and other toys owned by his son, Milne created the world of Winnie-the-Pooh. He first appeared by name on December 24, 1925, in a Christmas story commissioned and published by the London Evening News. The following year, a collection of Pooh stories was formally released bearing the name Winnie-the-Pooh. The stories proved very popular and inspired a sequel."]}, {"page": "Winnie-the-Pooh (book)", "response": ["Milne and Shepard collaborated previously for English humour magazine Punch, and in 1924 created When We Were Very Young, a poetry collection. Among the characters in the poetry book was a teddy bear Shepard modeled after his son's toy. Following this, Shepard encouraged Milne to write about his son Christopher Robin Milne's toys, and so they became the inspiration for the characters in Winnie-the-Pooh.", "Among the characters in When We Were Very Young was a teddy bear that Shepard modelled after one belonging to his son. With the book's success, Shepard encouraged Milne to write stories about Milne's young son, Christopher Robin Milne, and his stuffed toys. Among Christopher's toys was a teddy bear he called \"Winnie-the-Pooh\". Christopher got the name \"Winnie\" from a bear at the London Zoo, Winnipeg. \"Pooh\" was the name of a swan in When We Were Very Young. Milne used Christopher and his toys as inspiration for a series of short stories, which were compiled and published as Winnie-the-Pooh. The model for Pooh remained the bear belonging to Shepard's son."]}, {"page": "1920 in the United Kingdom", "response": ["* 21 August – Christopher Robin Milne, author and bookseller (died 1996)"]}, {"page": "Poohsticks", "response": ["Poohsticks was invented by English author A. A. Milne for his son Christopher Robin Milne. The game first came to prominence upon Milne's description in his 1928 book The House at Pooh Corner,A. A. Milne. (1928) The House at Pooh Corner, London: Methuen. . as well as the 1983  Disney animated featurette Winnie the Pooh and a Day for Eeyore. As first depicted, protagonist Pooh accidentally drops a pine cone into a river from a bridge and, after observing how it appeared on the other side of the bridge, devises the rules for Poohsticks, later playing the game with the other characters, Christopher Robin, Tigger, and Eeyore.", "Milne first played the game at a bridge located in Ashdown Forest, close to the village of Upper Hartfield, East Sussex, England. Built in 1907 and originally called Posingford Bridge, it is considered to be the bridge on which Milne and his son first played the game. However, it is uncertain whether the game was first played at the bridge and then written into the story, or vice versa. The bridge maintained the public's interest and a campaign to rebuild it in the late seventies was considered important enough to feature on the BBC Nine O'Clock News. The bridge was subsequently reopened by Christopher Robin Milne and officially renamed as Poohsticks Bridge."]}, {"page": "Stowe School", "response": ["* Christopher Robin Milne, (1920-1996), bookseller and son of A. A. Milne"]}, {"page": "Hundred Acre Wood", "response": ["The Hundred Acre Wood of the Winnie-the-Pooh stories is in actuality Five Hundred Acre Wood in Ashdown Forest in East Sussex, England, where the Winnie-the-Pooh stories were set. A. A. Milne's country home at Cotchford Farm, Hartfield was situated just north of Ashdown Forest, and Five Hundred Acre Wood is a dense beech wood that Christopher Robin Milne would explore on his way from Cotchford Farm onto the Forest. Five Hundred Acre Wood is long-established, having been originally sold off from the Forest in 1678. The wood remains privately owned, being part of Buckhurst Park estate,Buckhurst Park website and is not therefore generally accessible to the public, though two footpaths which are public rights of way, one of which is part of a long-distance footpath, the Wealdway, cross through the wood and may be used by members of the public."]}, {"page": "The Book of Pooh", "response": ["The series appears to take place some time after the events of Milne's original stories since his son Christopher Robin Milne is clearly a sixth grader and 11 years old. The series departs from many of the established facts of Milne's books; for example, Tigger resides in the Hundred Acre Wood from the start and Kanga and Roo are later introduced as newcomers. Neither Christopher nor his mother speak with an English accent, such is the case in The New Adventures of Winnie the Pooh where Christopher has an American accent. Kessie, the bluebird from The New Adventures of Winnie the Pooh episodes \"Find Her, Keep Her\" and \"A Bird in the Hand\" returns as a main character in this series."]}, {"page": "Barbara Willard", "response": ["One of her last books, The Forest - Ashdown in East Sussex, published by Sweethaws Press in 1989, gives a detailed account of  Ashdown Forest. In the introduction to the book, Christopher Robin Milne notes that Willard had moved from her home on the Sussex Downs to the edge of Ashdown Forest in 1956 and that her new surroundings had provided the inspiration and setting for ten of her children's historical novels (eight in the Mantlemass series and two others). It is evident by her own account in her book that she actively involved herself in the affairs of the forest. She was a representative of the forest Commoners elected to the forest's Board of Conservators in 1975, and she remained in that capacity for ten years. She tells how she was later heavily involved in the fundraising campaign which enabled East Sussex County Council to purchase the forest in 1988, enabling it to remain as a place of beauty and tranquility open to the public."]}]}}