{"wiki_id": "http://www.wikidata.org/entity/Q25866193", "itemLabel": "Sam Clemmett", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Sam_Clemmett", "wikipedia_page": {"main": "Sam Clemmett (born 1 October 1993) is a British actor. He is best known for his role as Albus Potter in the play Harry Potter and the Cursed Child.", "link_mentions": [{"page": "Norfolk", "response": ["* Sam Clemmett, actor, from Brundall known for starring in West End stage play Harry Potter and the Cursed Child, Haribo Tangfastics television advert and the BBC documentary Murder Games: The Life and Death of Breck Bednar where he played Breck Bednar the teen murdered by Lewis Daynes"]}, {"page": "Brundall", "response": ["*Sam Clemmett, performed as Albus Potter in Harry Potter and The Cursed Child."]}, {"page": "Harry Potter and the Cursed Child", "response": ["Harry Potter and the Cursed Child is a 2016 British two-part play written by Jack Thorne based on an original story by J. K. Rowling, John Tiffany, and Thorne. Previews of the play began at the Palace Theatre, London, on 7 June 2016, and it premiered on 30 July 2016. The play opened on Broadway on 21 April 2018 at the Lyric Theatre, with previews starting on 16 March 2018. Its cast was similar to that of the first year in the West End, with returning actors Anthony Boyle, Sam Clemmett, Noma Dumezweni, Poppy Miller, Jamie Parker, Alex Price, and Paul Thornley.", "| colspan=\"2\" style=\"text-align:center;\"|Sam Clemmett"]}, {"page": "Wizarding World", "response": ["| colspan=\"2\" | Sam Clemmett", "In December 2013, J. K. Rowling announced that she was working on a Harry Potter–based play, and in June 2015 it was officially titled Harry Potter and the Cursed Child. The two-part, West End stage play, written by British playwright Jack Thorne, is based on an original story by Thorne, John Tiffany and Rowling. It is directed by Tiffany with choreography by Steven Hoggett, set design by Christine Jones, costume design by Katrina Lindsay, lighting design by Neil Austin, music by Imogen Heap, and sound design by Gareth Fry. The story begins nineteen years after the events of Deathly Hallows and follows Harry Potter, now a Ministry of Magic employee, and his younger son Albus Severus Potter, who is about to attend Hogwarts. On 20 December 2015, it was announced that Jamie Parker, Noma Dumezweni and Paul Thornley would play Harry Potter, Hermione Granger and Ron Weasley respectively. The play debuted at the Palace Theatre, London on 7 June 2016 in previews, with the official opening on 30 July. The script was released in book form the day after the play's world premiere. The play opened on Broadway at the redesigned Lyric Theatre, New York City on 22 April 2018. Parker, Dumezweni, and Thornley reprised their roles on Broadway with Poppy Miller, Sam Clemmett, Alex Price, and Anthony Boyle also reprising their roles as Ginny Potter, Albus Potter, Draco Malfoy, and Scorpius Malfoy, respectively."]}, {"page": "The War Below", "response": ["* Sam Clemmett as Charlie MacDonald"]}]}}