{"wiki_id": "http://www.wikidata.org/entity/Q2592881", "itemLabel": "Reginald Drax", "itemDescription": "Royal Navy admiral (1880-1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Reginald_Drax", "wikipedia_page": {"main": "Admiral  Sir Reginald Aylmer Ranfurly Plunkett-Ernle-Erle-Drax, KCB, DSO, JP, DL (born Plunkett; 28 August 1880 – 16 October 1967), commonly known as Reginald Plunkett or Reginald Drax, was an Anglo-Irish admiral. The younger son of the 17th Baron of Dunsany, he was Director of the Royal Naval College, Greenwich, President of the Naval Inter-Allied Commission of Control in (Berlin), commander-in-chief of successive Royal Navy bases.  His brother Edward, who became the 18th Baron of Dunsany, was best known as the famous playwright and author Lord Dunsany.  Edward inherited the paternal estates in Ireland, while Reginald was bequeathed most of his mother's inheritance across portions of the West Indies, Kent, Surrey, Dorset, Wiltshire and Yorkshire.  He extended his surname by special Royal licence in 1916, and was noted for the quadruple-name result, Plunkett-Ernle-Erle-Drax.", "link_mentions": [{"page": "Lord Dunsany", "response": ["Plunkett's only grown sibling, a younger brother, from whom he was estranged from about 1916, for reasons not fully clear but connected to his mother's will, was the noted British naval officer Sir Reginald Drax. Another younger brother died in infancy."]}, {"page": "Molotov–Ribbentrop Pact", "response": ["By the end of May, drafts had been formally presented. In mid-June, the main tripartite negotiations started. Discussions were focused on potential guarantees to Central and Eastern Europe in the case of German aggression. The Soviets proposed to consider that a political turn towards Germany by the Baltic states would constitute an \"indirect aggression\" towards the Soviet Union. Britain opposed such proposals because they feared the Soviets' proposed language would justify a Soviet intervention in Finland and the Baltic states or push those countries to seek closer relations with Germany.. The discussion of a definition of \"indirect aggression\" became one of the sticking points between the parties, and by mid-July, the tripartite political negotiations effectively stalled while the parties agreed to start negotiations on a military agreement, which the Soviets insisted had to be reached at the same time as any political agreement. One day before the military negotiations began, the Soviet Politburo pessimistically expected the coming negotiations to go nowhere and formally decided to consider German proposals seriously.. The military negotiations began on 12 August in Moscow, with a British delegation headed by the retired admiral Sir Reginald Drax, French delegation headed by General Aimé Doumenc and the Soviet delegation headed by Kliment Voroshilov, the commissar of defence, and Boris Shaposhnikov, chief of the general staff. Without written credentials, Drax was not authorised to guarantee anything to the Soviet Union and had been instructed by the British government to prolong the discussions as long as possible and to avoid answering the question of whether Poland would agree to permit Soviet troops to enter the country if the Germans invaded.. As the negotiations failed, a great opportunity to prevent the German aggression was probably lost.Stalin 'planned to send a million troops to stop Hitler if Britain and France agreed pact'"]}, {"page": "Baron of Dunsany", "response": ["The seventeenth Baron was succeeded by his son, the eighteenth Baron. He was a well-known poet, playwright and author of short stories and novels, best known now for his short stories in the field of fantasy, the Jorkens stories, and his novel The King of Elfland's Daughter.  The descendants of his younger brother, Reginald Drax, bear not only the Dunsany's surname Plunkett, but also other surnames inherited from their mother, Ernle Elizabeth Louisa Maria Grosvenor Ernle-Erle-Drax, née Ernle Elizabeth Louisa Maria Grosvenor Burton (1855–1916), giving them a rare quadruple-barrelled surname of Plunkett-Ernle-Erle-Drax."]}, {"page": "Cheam School", "response": ["* Reginald Drax, admiral"]}, {"page": "Reginald Aylmer Ranfurly Plunkett-Ernle-Erle-Drax", "response": ["#REDIRECT Reginald Drax"]}, {"page": "Charborough House", "response": ["Col. Francis Augustus Plunkett Burton (d.1865) married Sarah Charlotte Elizabeth Ernle-Erle-Drax, the heiress of Charborough. He was the son of Admiral James Ryder Burton by his wife Anne Maria Plunkett, daughter of Randal Plunkett, 13th Baron of Dunsany (1739–1821). He died without male progeny leaving as his heiress his only daughter Ernle Elizabeth Louisa Maria Grosvenor Burton (d.1916), who married her cousin John William Plunkett, 17th Baron of Dunsany and was the mother of Lord Dunsany and Sir Reginald Drax. In 1871, she married as her second husband Lt. John Lloyd Egginton, of the 3rd Dragoon Guards, of Cheltenham, eldest son of Rev. John Clemson Egginton of Bilbrook, Staffordshire."]}]}}