{"wiki_id": "http://www.wikidata.org/entity/Q2599", "itemLabel": "Paul McCartney", "itemDescription": "English singer-songwriter, bassist of The Beatles", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_McCartney", "wikipedia_page": {"main": "Sir James Paul McCartney  (born 18 June 1942) is an English singer, songwriter, musician, and record and film producer who gained worldwide fame as co-lead vocalist, co-songwriter, and bassist for the Beatles. One of the most successful composers and performers of all time, he is known for his melodic approach to bass-playing, his versatile and wide tenor vocal range, and his musical eclecticism, exploring styles ranging from pre-rock 'n' roll pop to classical and electronica. His songwriting partnership with John Lennon remains the most successful in history.Born in Liverpool, McCartney taught himself piano, guitar and songwriting as a teenager, having been influenced by his father, a jazz player, and rock 'n' roll performers such as Little Richard and Buddy Holly. He began his career as a member of the Quarrymen in 1957, which evolved into the Beatles in 1960. Sometimes called \"the cute Beatle\", McCartney later involved himself with the London avant-garde and spearheaded the incorporation of such experimental aesthetics into the Beatles' studio productions. Starting with the 1967 album Sgt. Pepper's Lonely Hearts Club Band, he gradually became the band's de facto leader, providing the creative impetus for most of their music and film projects. Many of his Beatles songs, including \"And I Love Her\", \"Yesterday\", \"Eleanor Rigby\" and \"Blackbird\", rank among the most covered songs in history.After the Beatles disbanded, he debuted as a solo artist with the 1970 album McCartney and formed the band Wings with his first wife, Linda, and Denny Laine. Led by McCartney, Wings was one of the most successful bands of the 1970s, with more than a dozen international top 10 singles and albums. He resumed his solo career in 1980 and has toured as a solo artist since 1989. Without Wings, his UK or US number-one hits have included \"Uncle Albert/Admiral Halsey\" (with Linda), \"Coming Up\", \"Pipes of Peace\", \"Ebony and Ivory\" (with Stevie Wonder) and \"Say Say Say\" (with Michael Jackson). Beyond music, he has taken part in projects to promote international charities related to such subjects as animal rights, seal hunting, land mines, vegetarianism, poverty, and music education.\n\nMcCartney has written or co-written 32 songs that have topped the Billboard Hot 100, and as of 2009, had sales of 25.5 million RIAA-certified units in the US. His honours include two inductions into the Rock and Roll Hall of Fame (as a member of the Beatles in 1988 and as a solo artist in 1999), an Academy Award, 18 Grammy Awards, an appointment as a Member of the Order of the British Empire in 1965, and a knighthood in 1997 for services to music. As of 2020, he was one of the wealthiest musicians in the world, with an estimated fortune of £800 million.", "link_mentions": [{"page": "Allen Ginsberg", "response": ["In 1996, he also recorded a song co-written with Paul McCartney and Philip Glass, \"The Ballad of the Skeletons\", which reached number 8 on the Triple J Hottest 100 for that year."]}, {"page": "April 10", "response": ["*1970 – Paul McCartney announces that he is leaving The Beatles for personal and professional reasons."]}, {"page": "Brigitte Bardot", "response": ["Bardot was idolized by the young John Lennon and Paul McCartney. pg. 69. pg. 171. They made plans to shoot a film featuring The Beatles and Bardot, similar to A Hard Day's Night, but the plans were never fulfilled. Lennon's first wife Cynthia Powell lightened her hair colour to more closely resemble Bardot, while George Harrison made comparisons between Bardot and his first wife Pattie Boyd, as Cynthia wrote later in A Twist of Lennon. Lennon and Bardot met in person once, in 1968 at the May Fair Hotel, introduced by Beatles press agent Derek Taylor; a nervous Lennon took LSD before arriving, and neither star impressed the other. Lennon recalled in a memoir: \"I was on acid, and she was on her way out.\" pg. 24. According to the liner notes of his first (self-titled) album, musician Bob Dylan dedicated the first song he ever wrote to Bardot. He also mentioned her by name in \"I Shall Be Free\", which appeared on his second album, The Freewheelin' Bob Dylan. The first-ever official exhibition spotlighting Bardot's influence and legacy opened in Boulogne-Billancourt on 29 September 2009 – a day after her 75th birthday.Brigitte Bardot at 75: the exhibition , connexionfrance.com, September 2009; accessed 4 August 2015. The Australian pop group Bardot was named after her."]}, {"page": "Bass guitar", "response": ["In 1953, Monk Montgomery became the first bassist to tour with the Fender bass, in Lionel Hampton's postwar big band. Montgomery was also possibly the first to record with the electric bass, on July 2, 1953, with the Art Farmer Septet. Roy Johnson (with Lionel Hampton), and Shifty Henry (with Louis Jordan and His Tympany Five), were other early Fender bass pioneers. Bill Black, who played with Elvis Presley, switched from upright bass to the Fender Precision Bass around 1957. The bass guitar was intended to appeal to guitarists as well as upright bass players, and many early pioneers of the instrument, such as Carol Kaye, Joe Osborn, and Paul McCartney were originally guitarists.", "Several other companies also began manufacturing bass guitars during the 1950s. 1956 saw the appearance at the German trade fair \"Musikmesse Frankfurt\" of the distinctive Höfner 500/1 violin-shaped bass, made using violin construction techniques by Walter Höfner, a second-generation violin luthier. Due to its use by Paul McCartney, it became known as the \"Beatle bass\". In 1957, Rickenbacker introduced the model 4000, the first bass to feature a neck-through-body design in which the neck is part of the body wood. Kay Musical Instrument Company began production of the K-162 in 1952, Danelectro released the Longhorn in 1956, and Burns London/Supersound in 1958."]}, {"page": "Bagpipes", "response": ["Since the 1960s, bagpipes have also made appearances in other forms of music, including rock, metal, jazz, hip-hop, punk, and classical music, for example with Paul McCartney's \"Mull of Kintyre\", AC/DC's \"It's a Long Way to the Top (If You Wanna Rock 'n' Roll)\", and Peter Maxwell Davies's composition An Orkney Wedding, with Sunrise. "]}, {"page": "Buddy Holly", "response": ["John Lennon and Paul McCartney saw Holly for the first time when he appeared on Sunday Night at the London Palladium. The two had recently met and begun their musical association. They studied Holly's records, learned his performance style and lyricism, and based their act around his persona. Inspired by Holly's insect-themed Crickets, they chose to name their band \"The Beatles\". Lennon and McCartney later cited Holly as one of their main influences.", "Holly's life story inspired a Hollywood biographical film, The Buddy Holly Story (1978); its lead actor Gary Busey received a nomination for the Academy Award for Best Actor for his portrayal of Holly. The film was widely criticized by the rock press, and by Holly's friends and family, for its inaccuracies. This led Paul McCartney (whose MPL Communications by then controlled the publishing rights to Buddy Holly's song catalog) to produce and host his own documentary about Holly in 1985, titled The Real Buddy Holly Story. This video includes interviews with Keith Richards, Phil and Don Everly, Sonny Curtis, Jerry Allison, Holly's family, and McCartney, among others."]}, {"page": "The Beach Boys", "response": ["In its evaluation of Pet Sounds, the book 101 Albums that Changed Popular Music (2009) calls it \"one of the most innovative recordings in rock\", and states that it \"elevated Brian Wilson from talented bandleader to studio genius\". In 1995, a panel of numerous musicians, songwriters and producers assembled by Mojo voted Pet Sounds the greatest record ever made. Paul McCartney frequently spoke of his affinity with the album, citing \"God Only Knows\" as his favorite song of all time, and crediting it with furthering his interest in devising melodic bass lines. He said that Pet Sounds was the primary impetus for the Beatles' 1967 album Sgt. Pepper's Lonely Hearts Club Band. According to author Carys Wyn Jones, the interplay between the two groups during the Pet Sounds era remains one of the most noteworthy episodes in rock history. In 2003, when Rolling Stone magazine created its list of the \"500 Greatest Albums of All Time\", the publication placed Pet Sounds second to honour its influence on the highest-ranked album, Sgt. Pepper."]}, {"page": "Bloody Sunday (1972)", "response": ["Paul McCartney (who is of Irish descent)Experience Festival  McCartney bio recorded the first song in response only two days after the incident. The single, entitled \"Give Ireland Back to the Irish\", expressed his views on the matter. This song was one of few McCartney released with Wings to be banned by the BBC.The seven ages of Paul McCartney  BBC News Entertainment, 17 June 2006. Retrieved 27 August 2006."]}, {"page": "Charles Dickens", "response": ["In the 1950s, \"a substantial reassessment and re-editing of the works began, and critics found his finest artistry and greatest depth to be in the later novels: Bleak House, Little Dorrit, and Great Expectations – and (less unanimously) in Hard Times and Our Mutual Friend\".Britannica Academica, subscription required. Dickens was a favourite author of Roald Dahl; the best-selling children's author would include three of Dickens's novels among those read by the title character in his 1988 novel Matilda. An avid reader of Dickens, in 2005, Paul McCartney named Nicholas Nickleby his favourite novel. On Dickens he states, \"I like the world that he takes me to. I like his words; I like the language\", adding, \"A lot of my stuff – it's kind of Dickensian.\" Screenwriter Jonathan Nolan's screenplay for The Dark Knight Rises (2012) was inspired by A Tale of Two Cities, with Nolan calling the depiction of Paris in the novel \"one of the most harrowing portraits of a relatable, recognisable civilisation that completely folded to pieces\". On 7 February 2012, the 200th anniversary of Dickens's birth, Philip Womack wrote in The Telegraph: \"Today there is no escaping Charles Dickens. Not that there has ever been much chance of that before. He has a deep, peculiar hold upon us\".\"Why Charles Dickens speaks to us now\". . The Telegraph. Retrieved 31 May 2019"]}, {"page": "Clavichord", "response": ["In 1976 Oscar Peterson played (with Joe Pass on acoustic guitar) songs from Porgy And Bess on the clavichord. Keith Jarrett also recorded an album entitled Book of Ways (1986) in which he plays a series of clavichord improvisations. The Beatles' \"For No One\" (1966) features Paul McCartney playing the clavichord. Rick Wakeman plays the Clavinet in the track \"The Battle\" from the album Journey to the Centre of the Earth."]}, {"page": "David Lynch", "response": ["In 2009, Lynch organized a benefit concert at Radio City Music Hall for the David Lynch Foundation. On April 4, 2009, the \"Change Begins Within\" concert featured Paul McCartney, Ringo Starr, Donovan, Sheryl Crow, Eddie Vedder, Moby, Bettye LaVette, Ben Harper, and Mike Love of the Beach Boys.Jon Pareles, \"Paul McCartney and Ringo Starr Reunite at Radio City \", The New York Times, April 4, 2009, Arts Section David Wants to Fly, released in May 2010, is a documentary by German filmmaker David Sieveking \"that follows the path of his professional idol, David Lynch, into the world of Transcendental Meditation (TM)\".Variety, David Wants to Fly Review, Alissa Simon February 14, 2010 "]}, {"page": "Dave Grohl", "response": ["In June 2008, Grohl was Paul McCartney's special guest for a concert at the Anfield football stadium in Liverpool, in one of the central events of the English city's year as European Capital of Culture. Grohl joined McCartney's band singing backup vocals and playing guitar on \"Band on the Run\" and drums on \"Back in the U.S.S.R.\" and \"I Saw Her Standing There\". Grohl also performed with McCartney at the 51st Annual Grammy Awards, again playing drums on \"I Saw Her Standing There\". Grohl also helped pay tribute to McCartney at the 2010 Kennedy Center Honors along with No Doubt, Norah Jones, Steven Tyler, James Taylor, and Mavis Staples. He sang a duet version of \"Maybe I'm Amazed\" with Norah Jones on December 5, 2010.", "At the 12-12-12 Sandy benefit concert Paul McCartney joined Grohl and the surviving members of Nirvana (Krist Novoselic and touring guitarist Pat Smear) to perform \"Cut Me Some Slack\", a song later recorded for the Sound City soundtrack. In what was regarded as a Nirvana reunion with McCartney as a stand-in for Kurt Cobain, this was the first time in eighteen years that the three had played alongside each other."]}, {"page": "David Bowie", "response": ["Voice instructor Jo Thompson describes Bowie's vocal vibrato technique as \"particularly deliberate and distinctive\". Schinder and Schwartz call him \"a vocalist of extraordinary technical ability, able to pitch his singing to particular effect.\" Here, too, as in his stagecraft and songwriting, Bowie's roleplaying is evident: historiographer Michael Campbell says that Bowie's lyrics \"arrest our ear, without question. But Bowie continually shifts from person to person as he delivers them ... His voice changes dramatically from section to section.\" In a 2014 analysis of 77 \"top\" singers' vocal ranges, Bowie was 8th, just behind Christina Aguilera and just ahead of Paul McCartney. In addition to the guitar, Bowie also played a variety of keyboards, including piano, Mellotron, Chamberlin, and synthesisers; harmonica; alto and baritone saxophones; stylophone; viola; cello; koto (in the \"Heroes\" track \"Moss Garden\"); thumb piano; drums (on the Heathen track \"Cactus\"), and various percussion instruments."]}, {"page": "Dubbing (filmmaking)", "response": ["|Russ TamblynPaul McCartney"]}, {"page": "Django Reinhardt", "response": ["Denny Laine and Jimmy McCulloch, members of Paul McCartney's band Wings, have mentioned him as an inspiration."]}, {"page": "Elvis Presley", "response": ["On December 21, 1970, Presley engineered a meeting with President Richard Nixon at the White House, where he expressed his patriotism and explained how he believed he could reach out to the hippies to help combat the drug culture he and the president abhorred. He asked Nixon for a Bureau of Narcotics and Dangerous Drugs badge, to add to similar items he had begun collecting and to signify official sanction of his patriotic efforts. Nixon, who apparently found the encounter awkward, expressed a belief that Presley could send a positive message to young people and that it was, therefore, important that he \"retain his credibility\". Presley told Nixon that The Beatles, whose songs he regularly performed in concert during the era, exemplified what he saw as a trend of anti-Americanism. Presley and his friends previously had a four-hour get-together with The Beatles at his home in Bel Air, California, in August 1965. On hearing reports of the meeting, Paul McCartney later said that he \"felt a bit betrayed. ... The great joke was that we were taking [illegal] drugs, and look what happened to him\", a reference to Presley's early death, linked to prescription drug abuse."]}, {"page": "Ed Sullivan", "response": ["In a 1990 press conference, Paul McCartney recalled meeting Sullivan again in the early 1970s. Sullivan apparently had no idea who McCartney was. McCartney tried to remind Sullivan that he was one of the Beatles, but Sullivan obviously could not remember, and nodding and smiling, simply shook McCartney's hand and left. In an interview with Howard Stern around 2012, Joan Rivers said that Sullivan had been suffering from dementia toward the end of his life."]}, {"page": "Eric Clapton", "response": ["Clapton's 1996 recording of the Wayne Kirkpatrick/Gordon Kennedy/Tommy Sims tune \"Change the World\" (on the soundtrack of the film Phenomenon) won the Grammy Award for Song of the Year in 1997, the same year he recorded Retail Therapy (an album of electronic music with Simon Climie under the pseudonym TDF). On 15 September 1997, Clapton appeared at the Music for Montserrat concert at the Royal Albert Hall, London, performing \"Layla\" and \"Same Old Blues\" before finishing with \"Hey Jude\" alongside fellow English artists Paul McCartney, Elton John, Phil Collins, Mark Knopfler and Sting.\"Billboard 6 September 1997\". p.59. Billboard. Retrieved 12 December 2014 That autumn, Clapton released the album Pilgrim, the first record containing new material for almost a decade.", "Clapton released the album  Reptile in March 2001. One month after the 11 September attacks, Clapton appeared at the Concert for New York City, performing alongside Buddy Guy.\"Concert for New York City – Various Artists\" . AllMusic. Retrieved 28 May 2019 An event marking the Golden Jubilee of Queen Elizabeth II in June 2002, Clapton performed \"Layla\" and \"While My Guitar Gently Weeps\" at the Party at the Palace concert in the grounds of Buckingham Palace. On 29 November 2002, the Concert for George was held at the Royal Albert Hall, a tribute to George Harrison, who had died a year earlier of lung cancer.Stephen Thomas Erlewine. \"Concert for George\" . AllMusic. Retrieved 15 May 2012 Clapton was a performer and the musical director. The concert included Paul McCartney, Ringo Starr, Jeff Lynne, Tom Petty and the Heartbreakers, Ravi Shankar, Gary Brooker, Billy Preston, Joe Brown and Dhani Harrison. In 2004, Clapton released two albums of covers of songs by bluesman Robert Johnson, Me and Mr. Johnson and Sessions for Robert J. Guitarist Doyle Bramhall II worked on the album with Clapton (after opening Clapton's 2001 tour with his band Smokestack) and joined him on his 2004 tour. In 2004, Rolling Stone ranked Clapton No. 53 on their list of the \"100 Greatest Artists of All Time\". Other media appearances include the Toots & the Maytals Grammy award-winning album True Love, where he played guitar on the track \"Pressure Drop\"."]}, {"page": "Elvis Costello", "response": ["Costello's recording contract with Columbia Records ended after Blood & Chocolate. In 1987 he released compilation album, Out of Our Idiot on his UK label, Demon Records consisting of B-sides, side projects, and unreleased songs from recording sessions from 1980 to 1987. He signed a new contract with Warner Bros. and in early 1989 released Spike, which spawned his biggest single in the U.S., the Top 20 hit \"Veronica\", one of several songs Costello co-wrote with Paul McCartney. At the 1989 MTV Video Music Awards on 6 September in Los Angeles, \"Veronica\" won the MTV Award for Best Male Video.1989 MTV Video Music Awards: Video Vanguard Award MTV. Retrieved 7 December 2011", "A vegetarian since the early 1980s, Costello says he was moved to reject meat after seeing the documentary The Animals Film (1982), which also helped inspire his song \"Pills and Soap\" from 1983's Punch the Clock. In January 2013, Costello teamed up with Paul McCartney to create an ad campaign backing vegetarian foods produced by the Linda McCartney Foods brand.", "In 1987, Costello began a songwriting collaboration with Paul McCartney. They wrote a number of songs together in a short period of time, that were released over a period of years. These songs included:", "* Costello has also issued solo demo recordings of \"Veronica\", \"Pads, Paws and Claws\" and \"Mistress and Maid\" (a song he did not otherwise record). Two other officially unissued McCartney/Costello compositions also exist as demos (\"Tommy's Coming Home\" and \"Twenty Fine FIngers\"). These two tracks, along with other McCartney/Costello demos of tunes they did release, have been widely bootlegged and have been released on the Paul McCartney Archive edition of Flowers in the Dirt.", "Costello has worked with Paul McCartney, Madness, Tony Bennett, Burt Bacharach, Allen Toussaint, T Bone Burnett, Lucinda Williams, Johnny Cash, Kid Rock, Lee Konitz, Brian Eno, and Rubén Blades."]}, {"page": "Frank Zappa", "response": ["Many musicians, bands and orchestras from diverse genres have been influenced by Zappa's music. Rock artists such as The Plastic People of the Universe, Alice Cooper, Larry LaLonde of Primus, Fee Waybill of the Tubes all cite Zappa's influence, as do progressive, alternative, electronic and avant-garde/experimental rock artists like Can, Pere Ubu, Yes, Soft Machine, Henry Cow, Faust, Devo, Kraftwerk, Trey Anastasio and Jon Fishman of Phish, Jeff Buckley, John Frusciante, Steven Wilson, and The Aristocrats. Paul McCartney regarded Sgt. Pepper's Lonely Hearts Club Band as the Beatles' Freak Out!.MacDonald, 1994, Revolution in the Head, p. 171. Jimi Hendrix and heavy rock and metal acts like Black Sabbath, Simon Phillips, Mike Portnoy, Warren DeMartini, Alex Skolnick, Steve Vai, Strapping Young Lad, System of a Down, and Clawfinger have acknowledged Zappa as inspiration. On the classical music scene, Tomas Ulrich, Meridian Arts Ensemble, Ensemble Ambrosius and the Fireworks Ensemble regularly perform Zappa's compositions and quote his influence. Contemporary jazz musicians and composers Bill Frisell and John Zorn are inspired by Zappa, as is funk legend George Clinton."]}, {"page": "Fenway Park", "response": ["Since 2003, there has been at least one concert every year at Fenway by such artists as Bruce Springsteen and the E Street Band, Jimmy Buffett, Billy Joel, The Rolling Stones, Neil Diamond, The Police, Jason Aldean, Dave Matthews Band, Tom Petty & The Heartbreakers, Aerosmith, Phish, Roger Waters, Paul McCartney, James Taylor (2015-2017 consecutively: 2015 & 2017 with Bonnie Raitt, 2016 with Jackson Browne), Pearl Jam, Foo Fighters, Dead & Company and New Kids On The Block 2011 (with Backstreet Boys), 2017 and 2021. In 2017, Lady Gaga brought her Joanne World Tour to the stadium, making her the first woman to headline a concert there. In 2019, The Who played their first ever show at the stadium with the Boston Symphony Orchestra. On August 3, 2021, Guns N' Roses played a show as a part of their 2020 Tour, where they revealed a new song \"Absurd\"."]}, {"page": "Relax (song)", "response": ["The hit version, produced by Trevor Horn and featuring the band along with other musicians, entered the UK Top 75 singles chart in November 1983 but did not crack the Top 40 until early January 1984. Three weeks later it reached number one, in the chart dated 28 January 1984, replacing Paul McCartney's \"Pipes of Peace\". One of the decade's most controversial and most commercially successful records, \"Relax\" eventually sold a reported two million copies in the UK alone, easily ranking among the ten biggest-selling singles ever. It remained in the UK Top 40 for 37 consecutive weeks, 35 of which overlapped with a radio airplay ban by the BBC (owing to lyrics perceived as overtly sexual). In June 1984, bolstered by the instant massive success of the band's follow-up single \"Two Tribes\", the single re-entered the Top Ten for a further nine weeks including two spent at number two (behind \"Two Tribes\"). At that time Frankie Goes to Hollywood were the only act apart from the Beatles and John Lennon to concurrently occupy the top two positions on the chart. Several 12-inch single versions (and the \"Frankie Say Relax\" t-shirt craze) fed the \"Relax\" phenomenon. The single re-entered the UK Top 75 in February 1985, and, more successfully, in October 1993, when it spent three weeks in the Top Ten."]}, {"page": "George Harrison", "response": ["George Harrison  (25 February 1943 – 29 November 2001) was an English musician, singer-songwriter, and music and film producer who achieved international fame as the lead guitarist of the Beatles. Sometimes called \"the quiet Beatle\", Harrison embraced Indian culture and helped broaden the scope of popular music through his incorporation of Indian instrumentation and Hindu-aligned spirituality in the Beatles' work. Although the majority of the band's songs were written by John Lennon and Paul McCartney, most Beatles albums from 1965 onwards contained at least two Harrison compositions. His songs for the group include \"Taxman\", \"Within You Without You\", \"While My Guitar Gently Weeps\", \"Here Comes the Sun\" and \"Something\".", "At first, Harold Harrison was apprehensive about his son's interest in pursuing a music career. However, in 1956, he bought George a Dutch Egmond flat-top acoustic guitar, which according to Harold, cost £3.10s.– (equivalent to £ in ).: Dutch Egmond; : His father was apprehensive about his interest in pursuing a music career. One of his father's friends taught Harrison how to play \"Whispering\", \"Sweet Sue\" and \"Dinah\". Inspired by Donegan's music, Harrison formed a skiffle group, the Rebels, with his brother Peter and a friend, Arthur Kelly.; : A friend of his father's taught Harrison some chords; ;   On the bus to school, Harrison met Paul McCartney, who also attended the Liverpool Institute, and the pair bonded over their shared love of music.; ."]}, {"page": "Geddy Lee", "response": ["Lee began playing music in school when he was 10 or 11 and got his first acoustic guitar at 14. In school, he first played drums, trumpet and clarinet. However, learning to play instruments in school wasn't satisfying to Lee, and he took basic piano lessons independently. His interest increased dramatically after listening to some of the popular rock groups at the time. His early influences included Jack Bruce of Cream, John Entwistle of The Who, Jeff Beck, and Procol Harum.Prato, Greg. \"Biography of Geddy Lee\", All Music \"I was mainly interested in early British progressive rock\", said Lee. \"That's how I learned to play bass, emulating Jack Bruce and people like that.\" Bruce's style of music was also noticed by Lee, who liked that \"his sound was distinctive – it wasn't boring.\" Lee has also been influenced by Paul McCartney, Chris Squire, and James Jamerson."]}, {"page": "Irish diaspora", "response": ["*Paul McCartney, John Lennon and George Harrison of The Beatles."]}, {"page": "Isaac Asimov", "response": ["In December 1974, former Beatle Paul McCartney approached Asimov and asked him if he could write the screenplay for a science-fiction movie musical. McCartney had a vague idea for the plot and a small scrap of dialogue; he wished to make a film about a rock band whose members discover they are being impersonated by a group of extraterrestrials. The band and their impostors would likely be played by McCartney's group Wings, then at the height of their career. Intrigued by the idea, although he was not generally a fan of rock music, Asimov quickly produced a \"treatment\" or brief outline of the story. He adhered to McCartney's overall idea, producing a story he felt to be moving and dramatic. However, he did not make use of McCartney's brief scrap of dialogue. McCartney rejected the story. The treatment now exists only in the Boston University archives.Asimov, I. (1980) In Joy Still Felt Avon, p. 693"]}, {"page": "Isle of Wight", "response": ["* The Beatles' song \"When I'm Sixty-Four\" (1967), credited to Lennon-McCartney and sung by Paul McCartney, refers to renting a cottage on the island;"]}, {"page": "James Bond", "response": ["A Bond film staple are the theme songs heard during their title sequences sung by well-known popular singers. Several of the songs produced for the films have been nominated for Academy Awards for Original Song, including Paul McCartney's \"Live and Let Die\", Carly Simon's \"Nobody Does It Better\", Sheena Easton's \"For Your Eyes Only\", Adele's \"Skyfall\", and Sam Smith's \"Writing's on the Wall\". Adele won the award at the 85th Academy Awards, and Smith won at the 88th Academy Awards. For the non-Eon produced Casino Royale, Burt Bacharach's score included \"The Look of Love\" (sung by Dusty Springfield), which was nominated for an Academy Award for Best Original Song."]}, {"page": "June 18", "response": ["*  1942   – Paul McCartney, English singer-songwriter and guitarist "]}, {"page": "Joey Ramone", "response": ["In 1974, Jeffrey Hyman co-founded the punk rock band the Ramones with friends John Cummings and Douglas Colvin. Colvin was already using the pseudonym \"Dee Dee Ramone\" and the others also adopted stage names using \"Ramone\" as their surname: Cummings became Johnny Ramone and Hyman became Joey Ramone. The name \"Ramone\" stems from Paul McCartney: he briefly used the stage name \"Paul Ramon\" during 1960/1961, when the Beatles, still an unknown five-piece band called the Silver Beetles, did a tour of Scotland and all took up pseudonyms; and again on the 1969 Steve Miller album Brave New World, where he played the drums on one song using that name."]}, {"page": "John Lennon", "response": ["John Winston Ono Lennon (born John Winston Lennon; 9 October 19408 December 1980) was an English singer, songwriter, musician and peace activist who achieved worldwide fame as the founder, co-songwriter, co-lead vocalist and rhythm guitarist of the Beatles. Lennon was characterised by the rebellious nature and acerbic wit in his music, writing and drawings, on film, and in interviews. His songwriting partnership with Paul McCartney remains  the most successful in history.", "At the age of 15, Lennon formed a skiffle group, the Quarrymen. Named after Quarry Bank High School, the group was established by Lennon in September 1956. By the summer of 1957, the Quarrymen played a \"spirited set of songs\" made up of half-skiffle and half-rock and roll. Lennon first met Paul McCartney at the Quarrymen's second performance, which was held in Woolton on 6 July at the St Peter's Church garden fête. Lennon then asked McCartney to join the band.", "Lennon's most intense feelings were reserved for McCartney. In addition to attacking him with the lyrics of \"How Do You Sleep?\", Lennon argued with him through the press for three years after the group split. The two later began to reestablish something of the close friendship they had once known, and in 1974, they even played music together again before eventually growing apart once more. During McCartney's final visit in April 1976, Lennon said that they watched the episode of Saturday Night Live in which Lorne Michaels made a $3,000 offer to get the Beatles to reunite on the show. According to Lennon, the pair considered going to the studio to make a joke appearance, attempting to claim their share of the money, but they were too tired. Lennon summarised his feelings towards McCartney in an interview three days before his death: \"Throughout my career, I've selected to work with... only two people: Paul McCartney and Yoko Ono... That ain't bad picking.\""]}, {"page": "July 6", "response": ["*  1957   – John Lennon and Paul McCartney meet for the first time, as teenagers at Woolton Fete, three years before forming the Beatles."]}, {"page": "Jimi Hendrix", "response": ["In mid-November, they performed at the Bag O'Nails nightclub in London, with Clapton, John Lennon, Paul McCartney, Jeff Beck, Pete Townshend, Brian Jones, Mick Jagger, and Kevin Ayers in attendance. Ayers described the crowd's reaction as stunned disbelief: \"All the stars were there, and I heard serious comments, you know 'shit', 'Jesus', 'damn' and other words worse than that.\" The performance earned Hendrix his first interview, published in Record Mirror with the headline: \"Mr. Phenomenon\". \"Now hear this ... we predict that [Hendrix] is going to whirl around the business like a tornado\", wrote Bill Harry, who asked the rhetorical question: \"Is that full, big, swinging sound really being created by only three people?\" Hendrix said: \"We don't want to be classed in any category ... If it must have a tag, I'd like it to be called, 'Free Feeling'. It's a mixture of rock, freak-out, rave and blues\". Through a distribution deal with Polydor Records, the Experience's first single, \"Hey Joe\", backed with \"Stone Free\", was released on December 16, 1966.  After appearances on the UK television shows Ready Steady Go! and the Top of the Pops, \"Hey Joe\" entered the UK charts on December 29 and peaked at number six.; . Further success came in March 1967 with the UK number three hit \"Purple Haze\", and in May with \"The Wind Cries Mary\", which remained on the UK charts for eleven weeks, peaking at number six. On March 12, 1967, he performed at the Troutbeck Hotel, Ilkley, West Yorkshire, where, after about 900 people turned up (the hotel was licensed for 250) the local police stopped the gig due to safety concerns.", "Released in the UK on May 12, 1967, Are You Experienced spent 33 weeks on the charts, peaking at number two.: UK chart data for Are You Experienced; : UK release date. It was prevented from reaching the top spot by the Beatles' Sgt. Pepper's Lonely Hearts Club Band. On June 4, 1967, Hendrix opened a show at the Saville Theatre in London with his rendition of Sgt. Pepper title track, which was released just three days previous. Beatles manager Brian Epstein owned the Saville at the time, and both George Harrison and Paul McCartney attended the performance. McCartney described the moment: \"The curtains flew back and he came walking forward playing 'Sgt. Pepper'. It's a pretty major compliment in anyone's book. I put that down as one of the great honors of my career.\" Released in the US on August 23 by Reprise Records, Are You Experienced reached number five on the Billboard 200.: Release dates for Are You Experienced; : Peak US chart position."]}]}}