{"wiki_id": "http://www.wikidata.org/entity/Q260670", "itemLabel": "Dion Fortune", "itemDescription": "British occultist and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Dion_Fortune", "wikipedia_page": {"main": "Dion Fortune (born Violet Mary Firth, 6 December 1890 – 6 January 1946) was a British occultist, ceremonial magician, novelist and author. She was a co-founder of the Fraternity of the Inner Light, an occult organisation that promoted philosophies which she claimed had been taught to her by spiritual entities known as the Ascended Masters. A prolific writer, she produced a large number of articles and books on her occult ideas and also authored seven novels, several of which expound occult themes.\nFortune was born in Llandudno, Caernarfonshire, North Wales, to a wealthy upper middle-class English family, although little is known of her early life. By her teenage years she was living in England's West Country, where she wrote two books of poetry. After time spent at a horticultural college she began studying psychology and psychoanalysis at the University of London before working as a counsellor in a psychotherapy clinic. During the First World War she joined the Women's Land Army and established a company selling soy milk products. She became interested in esotericism through the teachings of the Theosophical Society, before joining an occult lodge led by Theodore Moriarty and then the Alpha et Omega occult organisation.\nShe came to believe that she was being contacted by the Ascended Masters, including \"the Master Jesus\", and underwent trance mediumship to channel the Masters' messages. In 1922 Fortune and Charles Loveday claimed that during one of these ceremonies they were contacted by Masters who provided them with a text, The Cosmic Doctrine. Although she became the president of the Christian Mystic Lodge of the Theosophical Society, she believed the society to be uninterested in Christianity, and split from it to form the Community of the Inner Light, a group later renamed the Fraternity of the Inner Light. With Loveday she established bases in both Glastonbury and Bayswater, London, began issuing a magazine, gave public lectures, and promoted the growth of their society. During the Second World War she organised a project of meditations and visualisations designed to protect Britain. She began planning for what she believed was a coming post-war Age of Aquarius, although she died of leukemia shortly after the war's end.\nFortune is recognised as one of the most significant occultists and ceremonial magicians of the early 20th century. The Fraternity she founded survived her and in later decades spawned a variety of related groups based upon her teachings. Her novels in particular proved an influence on later occult and modern Pagan groups such as Wicca.", "link_mentions": [{"page": "Aleister Crowley", "response": ["Crowley also had a wider influence in British popular culture. After his time in Cefalù which had brought him to public attention in Britain, various \"literary Crowleys\" appeared; characters in fiction based upon him. One of the earliest was the character of the poet Shelley Arabin in John Buchan's 1926 novel The Dancing Floor. In his novel The Devil Rides Out, the writer Dennis Wheatley used Crowley as a partial basis for the character of Damien Morcata, a portly bald defrocked priest who engages in black magic. The occultist Dion Fortune used Crowley as a basis for characters in her books The Secrets of Doctor Taverner (1926) and The Winged Bull (1935). He was included as one of the figures on the cover art of The Beatles' album Sgt. Pepper's Lonely Hearts Club Band (1967), and his motto of \"Do What Thou Wilt\" was inscribed on the vinyl of Led Zeppelin's album Led Zeppelin III (1970). Led Zeppelin co-founder Jimmy Page bought Boleskine in 1971, and part of the band's film The Song Remains the Same was filmed in the grounds. He sold it in 1992. Though David Bowie makes but a fleeting reference to Crowley in the lyrics of his song \"Quicksand\" (1971), it has been suggested that the lyrics of Bowie's No. 1 hit single \"Let's Dance\" (1983) may substantially paraphrase Crowley's 1923 poem \"Lyric of Love to Leah\". Ozzy Osbourne and his lyricist Bob Daisley wrote a song titled \"Mr. Crowley\" (1980).  Crowley began to receive scholarly attention from academics in the late 1990s."]}, {"page": "Atlantis", "response": ["Some subsequent occultists have followed Blavatsky, at least to the point of tracing the lineage of occult practices back to Atlantis. Among the most famous is Dion Fortune in her Esoteric Orders and Their Work."]}, {"page": "December 6", "response": ["*1890 – Dion Fortune, Welsh occultist, psychologist, and author (d. 1946)"]}, {"page": "Lilith", "response": ["The western mystery tradition associates Lilith with the Qliphoth of kabbalah. Samael Aun Weor in The Pistis Sophia Unveiled writes that homosexuals are the \"henchmen of Lilith\". Likewise, women who undergo wilful abortion, and those who support this practice are \"seen in the sphere of Lilith\". Dion Fortune writes, \"The Virgin Mary is reflected in Lilith\", and that Lilith is the source of \"lustful dreams\"."]}, {"page": "Margaret Murray", "response": ["As a result of her work in this area, she was invited to provide the entry on \"witchcraft\" for the fourteenth edition of the Encyclopædia Britannica in 1929. She used the opportunity to propagate her own witch-cult theory, failing to mention the alternate theories proposed by other academics. Her entry would be included in the encyclopedia until 1969, becoming readily accessible to the public, and it was for this reason that her ideas on the subject had such a significant impact. It received a particularly enthusiastic reception by occultists such as Dion Fortune, Lewis Spence, Ralph Shirley, and J. W. Brodie Innes, perhaps because its claims regarding an ancient secret society chimed with similar claims common among various occult groups. Murray joined the Folklore Society in February 1927, and was elected to the society's council a month later, although she stood down in 1929. Murray reiterated her witch-cult theory in her 1933 book, The God of the Witches, which was aimed at a wider, non-academic audience. In this book, she cut out or toned down what she saw as the more unpleasant aspects of the witch-cult, such as animal and child sacrifice, and began describing the religion in more positive terms as \"the Old Religion\"."]}, {"page": "Modern Paganism", "response": ["The belief in magical rituals and spells is held by a \"significant number\" of contemporary Pagans. Among those who believe in it, there are a variety of different views about what magic is. Many Neopagans adhere to the definition of magic provided by Aleister Crowley, the founder of Thelema: \"the Science and Art of causing change to occur in conformity with Will\". Also accepted by many is the related definition purportedly provided by the ceremonial magician Dion Fortune: \"magic is the art and science of changing consciousness according to the Will\"."]}, {"page": "Occult", "response": ["In the English-speaking world, prominent figures in the development of occultism included Helena Blavatsky and other figures associated with her Theosophical Society, senior figures in the Hermetic Order of the Golden Dawn like William Wynn Westcott and Samuel Liddell MacGregor Mathers, as well as other individuals such as Paschal Beverly Randolph, Emma Hardinge Britten, Arthur Edward Waite, and—in the early twentieth century—Aleister Crowley, Dion Fortune, and Israel Regardie. By the end of the nineteenth century, occultist ideas had also spread into other parts of Europe, such as the German Empire, Austria-Hungary, and the Kingdom of Italy."]}, {"page": "Reincarnation", "response": ["At this time popular awareness of the idea of reincarnation was boosted by the Theosophical Society's dissemination of systematised and universalised Indian concepts and also by the influence of magical societies like The Golden Dawn. Notable personalities like Annie Besant, W. B. Yeats and Dion Fortune made the subject almost as familiar an element of the popular culture of the west as of the east. By 1924 the subject could be satirised in popular children's books.Richmal Crompton, More William, George Newnes, London, 1924, XIII. William and the Ancient Souls; \"The memory usually came in a flash. For instance, you might remember in a flash when you were looking at a box of matches that you had been Guy Fawkes.\" Humorist Don Marquis created a fictional cat named Mehitabel who claimed to be a reincarnation of Queen Cleopatra.Marquis, \"Archy and Mehitabel\" (1927)"]}, {"page": "Wicca", "response": ["As well as pantheism and duotheism, many Wiccans accept the concept of polytheism, thereby believing that there are many different deities. Some accept the view espoused by the occultist Dion Fortune that \"all gods are one god, and all goddesses are one goddess\" – that is that the gods and goddesses of all cultures are, respectively, aspects of one supernal God and Goddess. With this mindset, a Wiccan may regard the Germanic Ēostre, Hindu Kali, and Catholic Virgin Mary each as manifestations of one supreme Goddess and likewise, the Celtic Cernunnos, the ancient Greek Dionysus and the Judeo-Christian Yahweh as aspects of a single, archetypal god. A more strictly polytheistic approach holds the various goddesses and gods to be separate and distinct entities in their own right. The Wiccan writers Janet Farrar and Gavin Bone have postulated that Wicca is becoming more polytheistic as it matures, tending to embrace a more traditionally pagan worldview. Some Wiccans conceive of deities not as literal personalities but as metaphorical archetypes or thoughtforms, thereby technically allowing them to be atheists. Such a view was purported by the High Priestess Vivianne Crowley, herself a psychologist, who considered the Wiccan deities to be Jungian archetypes that existed within the subconscious that could be evoked in ritual. It was for this reason, she said \"The Goddess and God manifest to us in dream and vision.\""]}, {"page": "1946", "response": ["* January 8 – Dion Fortune, British writer (b. 1890)"]}, {"page": "1890", "response": ["* December 6 – Dion Fortune, British occultist (d. 1946)"]}, {"page": "Isis", "response": ["Isis continues to appear in modern esoteric and pagan belief systems. The concept of a single goddess incarnating all feminine divine powers, partly inspired by Apuleius, became a widespread theme in literature of the nineteenth and early twentieth centuries. Influential groups and figures in esotericism, such as the Hermetic Order of the Golden Dawn in the late nineteenth century and Dion Fortune in the 1930s, adopted this all-encompassing goddess into their belief systems and called her Isis. This conception of Isis influenced the Great Goddess found in many forms of contemporary witchcraft. Today, reconstructions of ancient Egyptian religion, such as Kemetic Orthodoxy or the Church of the Eternal Source, include Isis among the deities they revere. An eclectic religious organization focused on female divinity calls itself the Fellowship of Isis because, in the words of one of its priestesses, M. Isidora Forrest, Isis can be \"all Goddesses to all people\"."]}, {"page": "Magic (supernatural)", "response": ["According to scholar of religion Henrik Bogdan, \"arguably the best known emic definition\" of the term magic was provided by Crowley. Crowley—who favoured the spelling 'magick' over magic to distinguish it from stage illusionism—was of the view that \"Magick is the Science and Art of causing Change to occur in conformity with Will\". Crowley's definition influenced that of subsequent magicians. Dion Fortune of the Fraternity of the Inner Light for instance stated that \"Magic is the art of changing consciousness according to Will\". Gerald Gardner, the founder of Gardnerian Wicca, stated that magic was \"attempting to cause the physically unusual\", while Anton LaVey, the founder of LaVeyan Satanism, described magic as \"the change in situations or events in accordance with one's will, which would, using normally acceptable methods, be unchangeable.\""]}, {"page": "Marion Zimmer Bradley", "response": ["In the late 1950s or early 1960s, Bradley and Walter H. Breen founded the Aquarian Order of the Restoration based on the work of Dion Fortune. By 1961 she was formally initiating others, including Ramfis S. Firethorn."]}, {"page": "Glastonbury", "response": ["The religious connections and mythology of the town have also attracted notable authors. The occultist and writer Dion Fortune (Violet Mary Firth) lived and is buried in Glastonbury. Her old house is now home to the writer and historian Geoffrey Ashe, who is known for his works on local legends. Frederick Bligh Bond, archaeologist and writer. Eckhart Tolle, a German-born writer, public speaker, and spiritual teacher lived in Glastonbury during the 1980s. Eileen Caddy was at a sanctuary in Glastonbury when she first claimed to have heard the \"voice of God\" while meditating. Her subsequent instructions from the \"voice\" directed her to take on Sheena Govan as her spiritual teacher,An Interview with Dorothy Mclean . livingnewstories.com, 6 May 2008.Unconventional spiritualist who helped to found Findhorn, the 'Vatican of the New Aage', in northeast Scotland  The Times, 20 December 2006.Eileen and Peter, by then parents to two sons, had moved to Scotland to be part of a little community in which Sheena was spiritual queen..  The Independent, 5 January 2007.Obituary – Eileen Caddy  The Guardian , 8 January 2007. and became a spiritual teacher and new age author, best known as one of the founders of the Findhorn Foundation community."]}, {"page": "Avalon", "response": ["In more recent times, writers such as Dion Fortune, John Michell, Nicholas Mann and Geoffrey Ashe have formed theories based on perceived links between Glastonbury and Celtic legends of the Otherworld in attempts to link the location firmly with Avalon, drawing on the various legends based on Glastonbury Tor as well as drawing on ideas like Earth mysteries, ley lines and even the myth of Atlantis. Arthurian literature also continues to use Glastonbury as an important location as in The Mists of Avalon, A Glastonbury Romance, and The Bones of Avalon. Even the fact that Somerset has many apple orchards has been drawn in to support the connection.\"Glastonbury: Alternative Histories\", in Ronald Hutton, Witches, Druids and King Arthur. Glastonbury's reputation as the real Avalon has made it a popular site of tourism. Having become one of the major New Age communities in Europe, the area has great religious significance for neo-Pagans and modern Druids, as well as some Christians. Identification of Glastonbury with Avalon within hippie subculture, as seen in the work of Michell and in the Gandalf's Garden community, also helped inspire the annual Glastonbury Festival that eventually became the largest musical and cultural event in the world."]}, {"page": "1926 in literature", "response": ["*Dion Fortune – The Secrets of Dr. Taverner"]}, {"page": "1928 in literature", "response": ["*Dion Fortune – Esoteric Orders and Their Work"]}, {"page": "1930 in literature", "response": ["*Dion Fortune – Psychic Self-Defence"]}, {"page": "1931 in literature", "response": ["*Dion Fortune – Spiritualism in the Light of Occult Science"]}, {"page": "1935 in literature", "response": ["*Dion Fortune – The Mystical Qabalah"]}, {"page": "1946 in literature", "response": ["*January 6 – Dion Fortune, British occultist, Christian Qabalist, ceremonial magician and novelist (born 1890)"]}, {"page": "1949 in literature", "response": ["*Dion Fortune (died 1946) – The Cosmic Doctrine"]}, {"page": "Ceremonial magic", "response": ["===Dion Fortune===", "Dion Fortune (1890–1946) was a Welsh occultist, ceremonial magician, novelist and author. She was a co-founder of the Fraternity of the Inner Light, an occult organisation that promoted philosophies which she claimed had been taught to her by spiritual entities known as the Ascended Masters. A prolific writer, she produced a large number of articles and books on her occult ideas and also authored seven novels, several of which expound occult themes."]}, {"page": "Dion", "response": ["*Dion Fortune (1890–1946), British occultist"]}, {"page": "Israel Regardie", "response": ["Among those to read the work was the occultist Dion Fortune, who considered it to be \"quite the best book on magic\" that she had read. She and Regardie met, but while the latter admired her writings he was unimpressed with her in person. Regardie later publicly criticised her for misrepresenting his works in her reviews of them; she had claimed that his works bolstered her beliefs about the Masters, although Regardie insisted that he was sceptical about the existence of such entities."]}, {"page": "Society for the Inner Light", "response": ["#REDIRECT Dion Fortune"]}, {"page": "Enochian magic", "response": ["Paul Foster Case (1884–1954), an occultist who began his magical career with the Alpha et Omega, was critical of the Enochian system. According to Case, the system of Dee and Kelley was incomplete, lacked sufficient protection methods, and was in fact just the basis of an older, more complete Qabalistic system. Case believed he had witnessed the physical breakdown of a number of practitioners of Enochian magic, due to the lack of protective methods. In a letter to occultist Dion Fortune, Case wrote:"]}, {"page": "Outline of spirituality", "response": ["* Dion Fortune"]}, {"page": "The Waterboys", "response": ["The Waterboys' lyrics show influences from different spiritual traditions. The first is the romantic Neopaganism and esotericism of authors such as Yeats and Dion Fortune, which can be observed in the repeated references to the ancient Greek deity Pan in both \"The Pan Within\" and \"The Return of Pan\". Pan was also featured on the album art for Room to Roam. \"Medicine Bow\", a song from the recording sessions for This Is the Sea, refers to Native American spirituality in its use of the word \"medicine\" to mean spiritual power. Scott's interest in Native American issues is also demonstrated in his preliminary recordings for the group's debut album, which included the songs \"Death Song of the Sioux Parts One & Two\" and \"Bury My Heart\". \"Bury My Heart\" is a reference to Dee Brown's Bury My Heart at Wounded Knee.The phrase \"Bury My Heart at Wounded Knee\" is originally from Stephen Vincent Benet's poem \"American Names\". a history of Native Americans in the western United States. Scott took the traditional Sioux song \"The Earth Only Endures\" from Bury My Heart at Wounded Knee, and set it to new music; the arrangement appears on The Secret Life of the Waterboys. Christian imagery can be seen in the songs \"December\" from The Waterboys, \"The Christ in You\" on Universal Hall, and indirectly in the influence of C. S. Lewis in a number of other songs, but Scott writes that his lyrics are not influenced by Christianity."]}, {"page": "Dream Harder", "response": ["Dream Harder was a return to a rock, or even hard rock, sound after the traditional Celtic-influenced preceding two albums. It did, however, continue The Waterboys' tradition of arranging a William Butler Yeats poem, in this case \"Love And Death\".  \"The Return of Pan\" is The Waterboys' second ode to the Greek deity, and the album contains a number of references to the romantic Neopaganism of Dion Fortune and the mystical Christianity of C. S. Lewis, as well as a tribute to guitarist Jimi Hendrix."]}, {"page": "Violet Firth", "response": ["#REDIRECT Dion Fortune"]}, {"page": "Hod (Kabbalah)", "response": ["Hod is said to be the sphere in which the magician mostly works. An example is given by occultist and author Dion Fortune in The Mystical Qabalah: "]}, {"page": "Doreen Valiente", "response": ["In 1997 Valiente discovered the Centre for Pagan Studies (CFPS), a Pagan organisation based in the Sussex hamlet of Maresfield that had been established in 1995. Befriending its founders, John Belham-Payne and his wife Julie Belham-Payne, she became the centre's patron and gave several lectures for the group. In 1997 Cooke died, leaving Valiente grief-stricken. Her final public speech was at the Pagan Federation's annual conference, held at Croydon's Fairfield Halls in November 1997; here she praised the work of early twentieth-century occultist Dion Fortune and urged the Wiccan community to accept homosexuals. Valiente's health was deteriorating as she was diagnosed first with diabetes and then terminal pancreatic cancer; increasingly debilitated, John Belham-Payne and two of her friends became her primary carers. In her last few days she was moved to the Sackville Nursing Home, there requesting that Belham-Payne publish an anthology of her poems after her death. She died on 1 September 1999, with Belham-Payne at her side. CFPS' barn in Maresfield, where an all-night vigil was held; those invited included Ralph Harvey, and Ronald Hutton. After this Pagan rite was completed, her coffin was cremated at Brighton's Woodvale crematorium, in an intentionally low-key service with John Belham-Payne, Doreen's last High priest as celebrant for the funeral. As per her wishes, Valiente's ashes were scattered in Sussex woodland. Her magical artefacts and manuscripts, including her Book of Shadows, were bequeathed to John Belham-Payne. Her book of poems was published posthumously in 2000, followed by an enlarged second edition in 2014."]}, {"page": "Left-hand path and right-hand path", "response": ["The occultist Dion Fortune considered Abrahamic religions to be RHP.", "In New York, Madame Blavatsky founded the Theosophical Society with several other people in 1875. She set about writing several books, including Isis Unveiled (1877) in which she introduced the terms Left-Hand Path and Right-Hand Path, firmly stating that she herself followed the RHP, and that followers of the LHP were practitioners of Black Magic who were a threat to society. The occult community soon picked up on her newly introduced duality, which, according to historian Dave Evans, \"had not been known before\" in the Western Esoteric Tradition. For instance, Dion Fortune, the founder of an esoteric magical group (the Society of the Inner Light) also took the side of the RHP, making the claim that \"black magicians\", or followers of the LHP, were homosexuals and that Indian servants might use malicious magical rites devoted to the goddess Kali against their European masters."]}, {"page": "Keter", "response": ["In The Mystical Qabalah Dion Fortune describes Keter as pure consciousness, beyond all categories, timeless, a point that crystallises out of the Ein Soph, and commences the process of emanation that ends in Malkuth."]}, {"page": "Psychic vampire", "response": ["Dion Fortune wrote of psychic parasitism in relation to vampirism as early as 1930 in her book, Psychic Self-Defense.Charles and Collins, Carr; The Story of Dion Fortune, Thoth Books, 1998, , p150, Fortune considered psychic vampirism a combination of psychic and psychological pathology, and distinguished between what she considered to be true psychic vampirism and mental conditions that produce similar symptoms. For the latter, she named folie à deux and similar phenomena."]}, {"page": "W. E. Butler", "response": ["While in India, he studied with Indian mystics and also came into contact with Theosophist mystic Annie Besant, who politely rejected his requests to study with her. He returned to England and joined Dion Fortune's Society of the Inner Light in 1925, where he continued to train and participate until sometime toward the end of World War II.Hermetic Order of the Temple of Starlight. Retrieved 5 September 2018."]}]}}