{"wiki_id": "http://www.wikidata.org/entity/Q2603978", "itemLabel": "Bramwell Tovey", "itemDescription": "British conductor and composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bramwell_Tovey", "wikipedia_page": {"main": "Bramwell Tovey,  (born 11 July 1953) is a British conductor and composer.\n\n", "link_mentions": [{"page": "July 11", "response": ["*  1953   – Bramwell Tovey, English-Canadian conductor and composer"]}, {"page": "Los Angeles Philharmonic", "response": ["*2008–2010 Bramwell Tovey (Hollywood Bowl)", "Beginning in the Summer of 2005, the Philharmonic created the new position of Principal Guest Conductor of the Los Angeles Philharmonic at the Hollywood Bowl. Leonard Slatkin was initially given a two-year contract, and in 2007 he was given a one-year extension. In March 2008, Bramwell Tovey was named to the post for an initial two-year contract beginning Summer of 2008; he subsequently received a one-year extension. After Tovey's term ended, no conductor has since held the position at the Hollywood Bowl."]}, {"page": "Joseph Alessi", "response": ["* Maestro - with Foden's Band; Bramwell Tovey, conductor (Egon CD-SFZ136)"]}, {"page": "Peter and the Wolf", "response": ["| Bramwell Tovey", "| Bramwell Tovey"]}, {"page": "British brass band", "response": ["* Bramwell Tovey: Coventry Variations, Pictures in the Smoke & The Night To Sing"]}, {"page": "Grammy Award for Best Instrumental Soloist(s) Performance (with orchestra)", "response": ["| James Ehnes, soloist; Vancouver Symphony Orchestra; Bramwell Tovey, conductor"]}, {"page": "The Royal Conservatory of Music", "response": ["*2005: Bramwell Tovey, conductor and composer"]}, {"page": "Thea Gill", "response": ["In addition to her acting work, Gill is also a jazz singer and has worked as the Midsummer Lounge's featured act on board the Mediterranean and Caribbean cruise ship M.S. Carousel. Gill also did in 2002 a three-night solo singing act at the jazz club, Top o' the Senator, in Toronto. In 2005, Gill appeared in director Richard Bell's Eighteen as a seductive World War II-era chanteuse. This marked Gill's first singing performance in a movie. The song, \"In a Heartbeat\", was written by Bramwell Tovey and was later nominated for a Genie Award."]}, {"page": "James Ehnes", "response": ["* 2018 James Newton Howard: Violin Concerto, Aaron Jay Kernis: Concerto for Violin, Bramwell Tovey: Stream of Limelight"]}, {"page": "List of Canadian composers", "response": ["*Bramwell Tovey (born 1953)"]}, {"page": "Violin Concerto (Walton)", "response": ["| Bramwell Tovey"]}, {"page": "Candide (operetta)", "response": ["A concert performance at the Hollywood Bowl in September 2010, conducted by Bramwell Tovey, featured Richard Suart as Pangloss, Frederica von Stade as the Old Lady, Alek Shrader as the title character and Anna Christy as Cunegonde.Swed, Mark. \"Music review: Candide at the Hollywood Bowl\". Los Angeles Times, 3 September 2010"]}, {"page": "Flute Sonata (Poulenc)", "response": ["The orchestral arrangement has been recorded by Galway with the Royal Philharmonic Orchestra and Charles Dutoit, and later by Emily Beynon with the BBC National Orchestra of Wales and Bramwell Tovey, Jennifer Stinton with the Scottish Chamber Orchestra and Steuart Bedford, and Bezaly with the Residentie Orkest Den Haag and Neeme Järvi.\"Poulenc Lennox Berkeley Flute Sonata\", WorldCat. Retrieved 7 April 2020"]}, {"page": "Vancouver Symphony Orchestra", "response": ["From 2000 to 2018, the VSO's Music Director was Bramwell Tovey.  His initial contract was extended in December 2004 through the 2009–2010 season, and further extended in January 2010 through the 2014–2015 season.David Gordon Duke, \"Bramwell Tovey signs on for five more years\".  Vancouver Sun, 28 January 2010. They played during the Opening and Closing Ceremonies of the 2010 Winter Olympics. In November 2013, the VSO announced the further extension of Tovey's contract through the 2017–2018 season, and the scheduled conclusion of his music directorship of the VSO at that time. Tovey took the title of VSO Music Director Emeritus with the 2018–2019 season, the VSO's 100th season. The VSO and Tovey won the 2008 Grammy Award for Best Instrumental Soloist Performance (with Orchestra), for their recording of the Korngold, Barber, and Walton violin concerti, featuring Canadian violinist James Ehnes.  The recording won a 2008 Juno Award for Classical Album of the Year (large ensemble).", "* Bramwell Tovey (2000–2018)", "*Barber, Korngold, Walton, Violin Concertos, Soloist James Ehnes, Vancouver Symphony Orchestra, Bramwell Tovey, Grammy Awards winner 2008, Juno Awards winner 2008."]}, {"page": "BBC Concert Orchestra", "response": ["Gilbert Vinter served as its first principal conductor. Barry Wordsworth, principal conductor from 1989 to 2006, now holds the title of Conductor Laureate.  In August 2010, the orchestra announced the simultaneous appointments of Keith Lockhart as its seventh principal conductor, with immediate effect, and of Johannes Wildner as principal guest conductor.  Lockhart concluded his principal conductorship of the orchestra at the end of 2017, and now has the title of chief guest conductor, effective January 2018.  In November 2017, the orchestra announced the appointment of Bramwell Tovey as its next principal conductor, effective January 2018, with an initial contract of five years.  In November 2019, the BBC CO announced the appointment of Anna-Maria Helsing as its next principal guest conductor, the first female conductor ever named to the post, and the third female conductor to be named to a titled post with a BBC orchestra.", "* Bramwell Tovey (2018–present)"]}, {"page": "Canadian classical music", "response": ["*Bramwell Tovey (Vancouver Symphony Orchestra))"]}, {"page": "Juno Awards of 2005", "response": ["*Borodin, Bramwell Tovey, Vancouver Symphony Orchestra"]}, {"page": "Ilford County High School", "response": ["*Bramwell Tovey (b. 1953), Conductor"]}, {"page": "Ian Bousfield", "response": ["* Masters of Space and Time – with The National Youth Brass Band of Great Britain; Bramwell Tovey, conductor (Polyphonic QPRL225D) – contains W.A. Mozart's Concerto No. 2 in E Flat Major for trombone and brass band, arr. Mark Freeh."]}, {"page": "CBC Records", "response": ["The label's classical division was closed in 2008, around the same time as CBC Radio 2's repositioning from an almost entirely classical and jazz service to a predominantly adult album alternative format.\"A CBC without an orchestra can be sound step for Radio 2\". Toronto Star, March 29, 2008. The label's last classical release was Barber/Korngold/Walton: Violin Concertos, a recording by Bramwell Tovey and James Ehnes in conjunction with the Vancouver Symphony Orchestra which won the Grammy Award for Best Instrumental Soloist(s) Performance (with Orchestra) in 2008. A few pop-oriented projects remained in development,\"Why the show may, in fact, go on\". The Globe and Mail, August 9, 2008. but the corporation's primary strategy shifted from releasing physical recordings to internet distribution technologies such as podcasting, online music sales and the 2012 launch of CBC Music."]}, {"page": "Winnipeg Symphony Orchestra", "response": ["In 1992, then-Music Director Bramwell Tovey and the WSO's Composer-in-Residence Glenn Buhr, along with others, created the WSO's New Music Festival.  In the 2011–2012 season, the WSO began the 'Sistema Winnipeg' programme, modelled after Venezuela's El Sistema, to provide music education to disadvantaged children in Winnipeg.", "* Bramwell Tovey (1989–2001)"]}, {"page": "Richard Bell (director)", "response": ["Eighteen stars Brendan Fletcher, Carly Pope, Mark Hildreth, Thea Gill, and Alan Cumming. The film was narrated by Ian McKellen, with music composed by Bramwell Tovey and performed by the Vancouver Symphony Orchestra. Eighteen was released on DVD on June 27, 2006. It made its Canadian broadcast television premiere on City TV on March 1, 2008 and became available on iTunes in 2010.", "In 2020, Bell was nominated for a Canadian Screen Award for co-writing the original song \"I've Got A Big One\" with composer Bramwell Tovey for Brotherhood. He was previously nominated with Tovey in 2007 for a Genie Award for co-writing the song \"In a Heartbeat\" for his film Eighteen. Vancouver newspaper Xtra West awarded him Visual Artist of the Year for the same film at their annual Hero Awards that year."]}, {"page": "D'Oyly Carte Opera Company", "response": ["Dame Bridget D’Oyly Carte died in 1985, leaving in her will a £1 million legacy to enable the company to be revived. The company secured sponsorship from Sir Michael Bishop, who later became chairman of the board of trustees, the Birmingham City Council and BMI British Midland Airways (of which Bishop is chairman). Richard Condon was appointed the revived company's first general manager, and Bramwell Tovey was its first musical director.Bradley (2005), pp. 53–54 and 63 In succeeding seasons, the company's productions of The Mikado and H.M.S. Pinafore were nominated for Olivier Awards.Lisle, Nicola. \"When the wheels came off the Carte\", Classical Music, 17 February 2007, p. 12 From 1988 to 2003, the company mounted productions of the Gilbert and Sullivan operas on tour and in London, and it produced several operettas by Offenbach, Lehár and Strauss. Unlike the original company, which had regularly performed up to a dozen operas each year, 48 weeks a year, the new company generally presented only one or two operas in shorter seasons. In the first season, in 1988, the operas played were Iolanthe and The Yeomen of the Guard, both starring Gillian Knight. The company made its debut at the Sunderland Empire Theatre on 29 April 1988, and, after touring, opened in London at the Cambridge Theatre in July.Kelly, Richard. \"lolanthe\", The Guardian, 2 May 1988, p. 20; and Canning, Hugh. \"Cambridge Theatre – Iolanthe\", The Guardian, 14 July 1988, p. 17 The press notices were good, particularly about the musical aspects of the new company; opinion was divided about the staging. The Observer thought the productions \"miles superior to the later work of the old D'Oyly Carte; better designed, better lit ... better played and better sung.\"Ratcliffe, Michael. \"Through a glass darkly\", The Observer, 17 July 1988, p. 40 A review in The Guardian praised the musical standards, but added, \"Gilbert and Sullivan is as much theatrical as musical entertainment and there remains a lot to be done on the visual side.\"Canning, Hugh. \"Cambridge Theatre – Iolanthe\", The Guardian, 14 July 1988, p. 17"]}, {"page": "Violin Concerto (Korngold)", "response": ["*James Ehnes and Bramwell Tovey with the Vancouver Symphony Orchestra"]}, {"page": "Juno Award for Classical Composition of the Year", "response": ["*2003 – Bramwell Tovey, Requiem for a Charred Skull"]}, {"page": "Juno Award for Classical Album of the Year – Large Ensemble or Soloist(s) with Large Ensemble Accompaniment", "response": ["*2008 – James Ehnes/Bramwell Tovey/Vancouver Symphony Orchestra, Korngold, Barber & Walton Violin Concertos"]}, {"page": "Bramwell (name)", "response": ["* Bramwell Tovey (born 1953), British conductor and composer"]}, {"page": "Juno Awards of 2003", "response": ["Winner: \"Requiem for a Charred Skull\", Bramwell Tovey, Voices on High"]}, {"page": "Tovey", "response": ["* Bramwell Tovey (b. 1953), British conductor and composer"]}, {"page": "Cockaigne (In London Town)", "response": ["*Bramwell Tovey/Winnipeg Symphony Orchestra (CBC Records SMCD 5176)"]}, {"page": "Discover Russian", "response": ["*conductor Bramwell Tovey"]}, {"page": "Iwan Edwards", "response": ["Over the past four decades, Maestro Edwards has founded and directed the 110-voice St. Lawrence Choir, the F.A.C.E. Treble Choir, Concerto Della Donna, Choeur des enfants de Montréal, and the Canadian Chamber Choir in addition to working with the Ottawa Choral Society, the Lanaudière International Festival Chorus, and the Vancouver Bach Choir. These collaborations have led to performances with prominent orchestras in Montreal, Quebec City, Ottawa, and Vancouver and, internationally, the Karlovy Vary Symphony Orchestra in the Czech Republic. Renowned conductors with whom Maestro Edwards has worked include Charles Dutoit, Franz-Paul Decker, Zubin Mehta, Bramwell Tovey, Trevor Pinnock, Helmut Rilling, Robert Shaw, Leonard Slatkin, Roger Norrington and Kent Nagano.http://www.concertodelladonna.ca/en/meet/index.htm During his 21-year tenure at the helm of the Chorus of the Montreal Symphony Orchestra, recordings involving the chorus won a Grammy Award (\"Les Troyens\" – Berlioz) and two Juno Awards (Berlioz's \"Les Troyens\" and \"La Damnation de Faust\"). Over the course of his long relationship with the MSO, Maestro Edwards has conducted numerous MSO performances including Handel’s \"Messiah\" at Notre Dame Basilica."]}, {"page": "Glenn Dicterow", "response": ["In recent years, Dicterow has been the featured soloist with the New York Philharmonic in Prokofiev's Second Violin Concerto with guest conductor Yuri Temirkanov, Gian Carlo Menotti's Violin Concerto under the direction of Kurt Masur, and Bruch's Violin Concerto No. 1 with Christian Thielemann. During the Philharmonic's 1998 Asian Tour, he was soloist in the Barber Violin Concerto in Manila, Korea, and in Beijing, China, where he performed in The Great Hall of the People to an audience of more than 10,000 people. In the 2005–06 season, he was the soloist in Mozart's Violin Concerto No. 3, K.216 with Bramwell Tovey conducting, and Mozart's Serenade No. 7 in D major, K.248B, \"Haffner\", with Sir Colin Davis. In the 2006–07 season he played the Brahms Double Concerto with Philharmonic Principal Cello Carter Brey in New York and on the Orchestra's 2007 European Tour."]}, {"page": "Alan Gibson", "response": ["Towards the end of his career, Gibson was approached by a group of cricketing nomads known as the Poet's and Peasants' who asked him to be their official club poet. Gibson agreed, on the condition that the club dispatch to him a bottle of the finest single malt at the beginning of each season. The terms of this informal contract were swiftly agreed upon and Gibson had the official title of 'Ciub Poet' bestowed upon him. He was later invited by the club's founders David Pearl and Bramwell Tovey to speak at one of the club's AGMs, at which he gave a moving and amusing after-dinner speech about his early cricketing days. Gibson would occasionally refer to the Poet's and Peasants' in his pieces for The Times. And on one notable occasion, having written in one of his articles that Betjeman had been right about Slough, the Mayor of Slough took umbrage and challenged Gibson's cricket club to a cricketing duel. The match was duly staged on a decidedly ropey wicket in Slough, where the Poet's and Peasants' were humiliated by the Mayor of Slough's XI who had several very able cricketers playing for them, including Ian Gould. "]}, {"page": "Jean Cras", "response": ["His lyric tragedy, Polyphème is considered his masterpiece. The opera was acclaimed at its premiere in 1922, giving Cras a burst of notoriety in the French press. The title character is Polyphemus, who, according to Greek mythology, is the eldest Cyclops and son of Poseidon. It tells the well-known story of the attempt by Polyphemus (baritone) to steal Galatea (soprano) from Acis (tenor). In the original myth Polyphemus eventually kills Acis by rolling a rock onto him. Albert Samain, the librettist, humanized Polyphemus by having him become aware of the feelings shared by two lovers and thus, decide not to crush them. Ultimately, the cyclops wanders into the sea to find death because the couple's happiness horrifies him. The music is impressionistic, restless, and highly chromatic, in the spirit of Chausson and Duparc. The influence of Debussy's opera Pelléas et Mélisande is also noticeable. (A recording of this opera was released in 2003, with Bramwell Tovey conducting the Luxembourg Philharmonic Orchestra and Armand Arapian in the title role.)"]}, {"page": "Calgary Opera", "response": ["Bramwell Tovey was artistic director of the company from January 2019 to October 2020.  Heather Kitchen is the current managing director and chief executive officer of the company.  In September 2021, the company announced the appointment of Jonathan Brandani as its new artistic director.", "* Bramwell Tovey and John Murrell:  The Inventor (2011)"]}, {"page": "Foden's Band", "response": ["*Bramwell Tovey"]}, {"page": "Luxembourg Philharmonic Orchestra", "response": ["The orchestra's fifth music director, David Shallon suddenly died in 2000 while on tour in Japan.  Bramwell Tovey took over as music director in September 2002, and held the post until 2006.  The OPL appointed Emmanuel Krivine as their music director starting from the 2005-2006 season.  In May 2009, Krivine extended his contract with the orchestra through the 2014-2015 season.   Krivine concluded his OPL tenure at the end of the 2014–2015 season. In June 2014, the OPL announced the appointment of Gustavo Gimeno as its next principal conductor, as of the 2015-2016 season, with an initial contract of 4 years.  In March 2017, the OPL announced the extension of Gimeno's contract through the 2021-2022 season.", "* Bramwell Tovey (2002-2006)"]}, {"page": "27th Genie Awards", "response": ["* Bramwell Tovey and Richard Bell, \"In a Heartbeat\" — Eighteen"]}, {"page": "Serouj Kradjian", "response": ["Kradjian has appeared with the Toronto, Vancouver and Edmonton Symphonies, Göttingen Symphony, Russian National Orchestra, the Armenian Philharmonic and the Thailand Philharmonic under the baton of conductors such as Bramwell Tovey, Peter Oundjian, Stéphane Denève, Eduard Topchjan, Gudni Emilsson and Raffi Armenian."]}]}}