{"wiki_id": "http://www.wikidata.org/entity/Q2609096", "itemLabel": "Nancy Storace", "itemDescription": "English operatic soprano", "wikipedia_url": "https://en.wikipedia.org/wiki/Nancy_Storace", "wikipedia_page": {"main": "Anna (or Ann) Selina Storace, known as Nancy Storace (Italian: [stoˈratʃe]; 27 October 1765 – 24 August 1817), was an English operatic soprano. The role of Susanna in Mozart's Le nozze di Figaro was written for and first performed by her.\nBorn in London, her singing career as a child prodigy began in England by the age of 12.  This led to further study in Italy and to a successful singing career there during the late 1770s.  While in Monza (or shortly before in Milan) in 1782, she was recruited to form part of Emperor Joseph II's new Italian opera company in Vienna, where the assembled singers who joined her \"created in the two years leading up to the premiere of The Marriage of Figaro, were welded into the finest buffa ensemble anywhere.\"In Vienna, she befriended both Mozart and Joseph Haydn. A sudden failure of her voice in 1785 caused her to withdraw from the stage for five months; though her career continued to be successful, she never fully recovered her former vocal prowess. After marrying in 1784, she left Vienna in 1787 and returned to London, where she continued her career, notably singing in her brother Stephen Storace's operas. She remained in London, but by 1808 had retired from the stage. She died in 1817.", "link_mentions": [{"page": "Antonio Salieri", "response": ["However, there is also evidence attesting to the fact that Mozart and Salieri sometimes appeared to support each other's work. For example, when Salieri was appointed Kapellmeister in 1788, he chose to revive Figaro instead of introducing a new opera of his own, and when he attended the coronation festivities for Leopold II in 1790, Salieri had no fewer than three Mozart masses in his luggage. Salieri and Mozart even jointly composed a cantata for voice and piano, Per la ricuperata salute di Ofelia, which celebrated the return to the stage of the singer Nancy Storace. This work, although it had been printed by Artaria in 1785, was considered lost until 10 January 2016, when the Schwäbische Zeitung reported on the discovery by musicologist and composer Timo Jouko Herrmann of a copy of its text and music while doing research on Antonio Salieri in the collections of the Czech Museum of Music. Mozart's Davide penitente (1785), his Piano Concerto KV 482 (1785), the Clarinet Quintet (1789) and the 40th Symphony (1788) had been premiered on the suggestion of Salieri, who supposedly conducted a performance of it in 1791. In his last surviving letter from 14 October 1791, Mozart told his wife that he had picked up Salieri and Caterina Cavalieri in his carriage and driven them both to the opera; about Salieri's attendance at his opera The Magic Flute, speaking enthusiastically: \"He heard and saw with all his attention, and from the overture to the last choir there was not a piece that didn't elicit a 'Bravo!' or 'Bello!' out of him [...].\"Solomon, Maynard, Mozart: A Life, Harper Perennial (1996)"]}, {"page": "October 27", "response": ["*1765 – Nancy Storace, English soprano (d. 1817)"]}, {"page": "The Marriage of Figaro", "response": ["|Susanna, the countess's maid||soprano||Nancy Storace"]}, {"page": "Hayes, Hillingdon", "response": ["* Composer Stephen Storace (1762–1796), famous in his day and a friend of Mozart, lived from the late 1780s in Wood End, Hayes. Mozart created the role of Susanna in The Marriage of Figaro (1786) for his sister, Nancy Storace (1765–1817)."]}, {"page": "Lost literary work", "response": ["* W. A. Mozart and Antonio Salieri are known to have composed together a cantata for voice and piano called Per la ricuperata salute di Ofelia which was celebrating the return to stage of the singer Nancy Storace, and which has been lost, although it had been printed by Artaria in 1785. The music had been considered lost until November 2015, when German musicologist and composer Timo Jouko Herrmann identified the score while searching for music by one of Salieri's ostensible pupils, Antonio Casimir Cartellieri, in the archives of the Czech Museum of Music in Prague.Muller, R., and Kahn, M., \"Czech musician performs long-lost Mozart score for first time\", Reuters, Feb. 16, 2016."]}, {"page": "1817 in music", "response": ["*August 24 – Nancy Storace, operatic soprano (b. 1766)"]}, {"page": "Charles Dibdin", "response": ["Dibdin still provided texts for operas, including The Cabinet, which was presented at Covent Garden in February 1803 with John Braham, Nancy Storace and Charles Incledon, and in December The British Fleet in 1342.William Parke, Musical Memoirs (Richard Burton, London 1830), Vol. 1, pp. 304–06, 324. At least two further operas appeared: Broken Gold was a farce in two acts on the occasion of Lord Nelson's victory and death, produced at Drury Lane with John Bannister in 1806, which was 'damned on the first night, and never published'.Adolphus, Memoirs of John Bannister, II, p. 140. His last production, The Round Robin, was first acted at the Haymarket in June 1811. This incorporated his highly successful song 'The standing toast,' which had been written some time before.Hogarth (Ed.), Songs of Charles Dibdin (1848), Vol. 1 pp. 166, 169, 173."]}, {"page": "John Soane", "response": ["Performing at the Teatro della Pergola was Nancy Storace with whom Soane formed a lifelong friendship. Their journey continued on via Bologna, Padua, Vicenza, Verona, Mantua where he sketched Palazzo del Te, Parma, Piacenza. Milan where he attended La Scala, the theatre was a growing interest, Lake Como from where they began their crossing of the Alps via the Splügen Pass.Darley, 1999, pp. 53–54 They then passed on to Zurich, Reichenau, Switzerland, Wettingen, Schaffhausen, Basel on the way to which the bottom of Soane's trunk came loose on the coach and spilled the contents behind it, he thus lost many of his books, drawings, drawing instruments, clothes and his gold and silver medals from the Royal Academy (none of which was recovered). He continued his journey on to Freiburg im Breisgau, Cologne, Liège, Leuven and Brussels before embarking for England.Darley, 1999, p. 55"]}, {"page": "1785 in music", "response": ["*January 21 – Soprano Nancy Storace, who was about to give birth, was replaced as Rosina in a Vienna production of Giovanni Paisiello's Il barbiere di Siviglia by Luisa Laschi, to great acclaim.Christopher Raeburn, \"Laschi [Mombelli], Luisa\", The New Grove Dictionary of Music and Musicians, second edition, edited by Stanley Sadie and John Tyrrell (London: Macmillan Publishers, 2001)."]}, {"page": "List of program music", "response": ["* Tu Sospiri?, for orchestra related to Nancy Storace and Mozart"]}, {"page": "La clemenza di Tito", "response": ["The opera remained popular for many years after Mozart's death.Stivender, D. ed. and trans., La clemenza di Tito (libretto), in The Metropolitan Opera Book of Mozart Operas, NY: HarperCollins, 1991, p. 502 It was the first full Mozart opera to reach London, receiving its première there at His Majesty's Theatre on 27 March 1806. The cast included John Braham, whose long-time companion Nancy Storace had been the first Susanna in The Marriage of Figaro in Vienna. However, as it was only played once, it does not appear to have attracted much interest. As far as can be gathered, it was not staged in London again until at the St Pancras Festival in 1957. The first performance at La Scala in Milan was on 26 December 1818. The North American premiere was staged on 4 August 1952 at the Berkshire Music Center in Tanglewood. For a long time, Mozart scholars regarded Tito as an inferior effort of the composer. Alfred Einstein in 1945 wrote that it was \"customary to speak disparagingly of La clemenza di Tito and to dismiss it as the product of haste and fatigue\", and he continues the disparagement to some extent by condemning the characters as puppets – e.g., \"Tito is nothing but a mere puppet representing magnanimity\" – and claiming that the opera seria was already a moribund form.Einstein, A. Mozart: His Character, His Work, NY: Oxford University Press, 1945, pp. 408–11 However, in recent years the opera has undergone something of a reappraisal. Stanley Sadie considered it to show Mozart \"responding with music of restraint, nobility and warmth to a new kind of stimulus\".Sadie, S. The New Grove Mozart, New York: Norton, 1983, p. 164. , offers a mixed appraisal of its musical and dramatic worth. The opera retains a reasonably high profile, and is in the lower reaches of the 'Top 50' performed at major houses, worldwide."]}, {"page": "Lo sposo deluso", "response": ["|Nancy Storace"]}, {"page": "Garden Museum", "response": ["The church originally housed the 15th- and 16th-century tombs of many members of the Howard family, including now-lost memorial brasses to Thomas Howard, 2nd Duke of Norfolk (died 1524) and his wife Agnes Howard, Duchess of Norfolk (died 1545), and is also the burial place of Anne Boleyn's mother, Elizabeth Boleyn (died 1538), formerly Howard. Elias Ashmole (instrumental in the development of speculative freemasonry) was buried in the church in 1692. Later burials inside the church includes the soprano Nancy Storace."]}, {"page": "Michael Kelly (tenor)", "response": ["Michael Kelly (25 DecemberH. van Thal (ed.): Solo Recital. The Reminiscences of Michael Kelly (London: Folio Society, 1972), p. 19, note. 1762 – 9 October 1826) was an Irish tenor, composer and theatrical manager who made an international career of importance in musical history.This article includes text drawn from Encyclopædia Britannica, 1911. One of the leading figures in British musical theatre around the turn of the nineteenth century, he was a close associate of playwright and poet Richard Brinsley Sheridan. He also became friends with musicians such as Mozart and Paisiello, and created roles for the operas of both composers. With his friend and fellow singer Nancy Storace, he was one of the first tenors of that era from Britain and Ireland to become famous in Italy and Austria. In Italy he was also known as O'KellyThis name was given by Father Dolphin, Prior of the Convent of St Dominic at Naples, cf Thal (ed.) 1972, p. 85. or even Signor Ochelli.H. Rosenthal and J. Warrack: Concise Oxford Dictionary of Opera (London: Oxford University Press, 1974). Although the primary source for his life is his Reminiscences, doubt has been cast on the reliability of his own account, and it has been said that '[a]ny statement of Kelly's is immediately suspect.'Richard Graves: \"The Comic Operas of Stephen Storace\", in The Musical Times vol. 95 no. 1340 (October 1954), pp. 530–532.", "Among them was the male soprano Venanzio Rauzzini (1746–1810), friend of Haydn and Charles Burney who, after a period at Vienna and Munich, settled in England c.1774 and was the teacher of the young Nancy Storace.Thal (ed.) 1972, p. 362. While in Dublin in 1778, he took Michael Kelly under his wing, gave him lessons and taught him several songs, including his own \"Fuggiamo di questo loco\" (which Linley introduced into The Duenna with words by Sheridan as \"By him we love offended\"). Rauzzini advised he should be sent to a conservatory in Rome or Naples, and his father laid plans accordingly. Meanwhile, Michael Arne stayed in Dublin to produce Garrick's dramatic romance Cymon, for which he had written the music: in exchange for his father's kindnesses, Arne gave Michael daily lessons and regular encouragement.Thal (ed.) 1972, p. 24–26.", "At Livorno, Kelly first met Stephen and Nancy Storace,Kelly tells the story that, arriving at Livorno from Sicily, he was as thin as a rake, with a mass of fair hair, and had not long ceased singing treble. Nancy and Stephen, whom he did not know, stood together on the Livorno Mole, and Nancy said in English to her brother, \"Look at that girl dressed in boy's clothes.\" Kelly then astonished her by replying, also in English, \"You are mistaken, Miss; I am a very proper he animal, and quite at your service!\"; Thal (ed.), p. 64. who, aged 15, was then prima donna of the comic opera there. Stephen Storace helped him mount a concert, and with funds he went on to Pisa, met the tenor Giuseppe Viganoni (1754-1823),P. H. Highfill, K. A. Burnim and E. A. Langhans: A Biographical Dictionary of Actors, Actresses, Musicians, Dancers, Managers and Other Stage Personnel in London, 1660-1800, vol. 15: Tibbett to M. West (Carbondale and Edwardsville: Southern Illinois University Press, 1993), pp. 162-64 (Google). appeared at the theatre with soprano Clementina Baglioni,La Baglioni was Mozart's first Rosina in La finta semplice: see K.-J. Kutsch and L. Riemens, ed. H. Rost, Grosses Sängerlexikon, 4th, enlarged edition, vol. 1 (Munich: K. G. Saur, 2003), p. 205 (Google). and dined with the violinist Soderini.Thal (ed.) 1972, p. 66–68. For Soderini see Highfill, Burnim and Langhans, Biographical Dictionary, vol. 14 (1991), p. 193. At Florence, Campigli gave him a spring season as first comic tenor at the Teatro Nuovo, and at Lord Cowper's house he heard Pietro Nardini play Tartini's sonata. He made a successful debut in Il francese in Italia, coached by the actor-tenor Filippo LaschiFilippo Laschi (1739-1789), see short biography in L. Macy, The Grove Book of Opera Singers, 2nd edition (O.U.P., 2008).), opposite the charming Signora Lortinella (called \"Ortabella\"), and Andrea Morigi as primo buffo.Thal (ed.) 1972, p. 68–71. He was in lodgings with the composer  (1755–1826): the male soprano  (a famous cantabile singerHighfill, Burnim and Langhans, Biographical Dictionary, vol. 5 (1978), pp. 438–440 (Google).) gave Kelly some lessons.Thal (ed.) 1972, p. 73.", "After a benefit concert at Verona, at Treviso he met the 'greatest reputed dilettante singer in Europe', Teresa de Petris.Thal (ed.) 1972, p. 103. She invited Kelly to sing with her in Anfossi's new oratorio, and her consort Count Vidiman engaged him for four months, sending him first to Parma and Colorno to present himself to the Archduchess, for whom he sang and played billiards for a week.Thal (ed.) 1972, p. 104–107. He returned to Venice in October for Vidiman, where Nancy Storace was appearing in an opera of Vicente Martín y Soler.Thal (ed.) 1972, p. 108. When his contract was completed, through Countess Rosenberg he (and Storace) received an invitation to join an Italian company then being assembled to occupy a permanent residency at the court of Emperor Joseph II, Holy Roman Emperor at Vienna.Thal (ed.) 1972, p. 110–111.", "Kelly sang opposite Nancy Storace in this company. In 1785, they were performing Stephen Storace's opera Gli sposi malcontenti. After she lost her voice for a time he sang in three operas with Mmes Cortellini,  and Laschi, and won applause humorously modelling a character on the mannerisms of da Ponte in performances witnessed by that writer. He and one Calvasi played the two Antipholus roles in Storace's Gli equivoci, based on The Comedy of Errors.Thal (ed.) 1972, p. 130–131.", "Paisiello's The Barber of Seville was presented with Nancy Storace: Kelly and Mandini alternated in the role of the Count.Thal (ed.) 1972, p. 140. When Paisiello came to the court Kelly witnessed his meeting with Mozart. The poet Giovanni Battista Casti also arrived, and in 1784 with Paisiello produced a new opera Il re Teodoro in Venezia. The cast included Mandini, Francesco Benucci, , Laschi, Storace and Viganoni, and Kelly took the buffo role of Gaforio, which became his nickname thereafter.Thal (ed.) 1972, p. 131–132.", "*Nancy Storace - on the flamboyant virtuosity of this singer as a teenager"]}, {"page": "Stephen Storace", "response": ["Stephen John Seymour Storace (4 April 1762 – 19 March 1796)Baker's Biographical Dictionary of Twentieth-Century Classical Musicians.  New York: Schirmer Books, 1997. was an English composer of the Classical era, known primarily for his operas. His sister was the famous opera singer Nancy Storace. ", "The Pirates, also produced in 1792, was partly adapted from Gli Equivoci, and is remarkable as affording one of the earliest instances of the introduction of a grand finale into an English opera. These works were followed by some less successful productions; but The Cherokee (1794) and The Three and the Deuce (1795) were very favourably received.  The Cherokee did not, unlike The Siege of Belgrade, attempt to add any \"exotic\" music for the Cherokee – their \"War March\" is disappointingly four-square and tonal, but the \"War Whoop\" is an exciting number.  The work also introduced the public to the boy-treble star, \"Master Walsh\", whose coloratura talents must have been remarkable as his numbers are no less complex than Crouch's or Nancy Storace's.  He was to figure regularly in Storace's works thereafter.", "Nancy Storace organised that the unfinished work was completed (Kelly claims to have had a hand in doing so, but it is more likely that he paid other hands to do it, since he freely admitted he could not read the bass clef.  Most likely the work was finished and orchestrated by the Orchestra Leader, John Shaw, who was Kelly's collaborator on all his later projects).  The work was given as a Benefit Performance for Storace's widow.  Mahmoud survives, but it is clear that the completed version was very makeshift."]}, {"page": "Charles Incledon", "response": ["In February the following year, Thomas Arne's opera Love in a Village was revived for Mrs. Billington, into which she introduced William Boyce's duet 'Together let us range the fields' for herself and Incledon, which was loudly encored. In the same month was presented a new comic opera written by Dibdin, The Cabinet (the music by various composers), in which Incledon appeared together with John Braham and Nancy Storace, and in delivering the hunting song 'his fine volume of voice filled the whole theatre'.Parke, Musical Memoirs (1830) vol 1, p. 304–06. Incledon's MacHeath was reprised at Margate in August 1803. Another new Dibdin opera, The British Fleet in 1342 (music entirely by Braham) appeared in December, and on that evening the highlight was a duet by Braham and Incledon, 'All's Well', which was encored.Parke, Musical Memoirs (1830), vol 1, p. 324."]}, {"page": "Classical music of the United Kingdom", "response": ["In the earlier part of the century the British singers Michael Kelly, Nancy Storace and John Braham were prominent and by their example sustained the international opera and oratorio works of Handel, Haydn, Mozart and their successors in the British arena.A. Steptoe, ed., The Mozart-Da Ponte operas: the cultural and musical background to Le nozze di Figaro, Don Giovanni, and Così fan tutte (Oxford: Oxford University Press, 1990), p. 148. Braham, whose career thoroughly spanned the opera stage and concert platform, established a tradition in public recital which was continued by his successors down into the early 20th century.P. Gordon, Musical visitors to Britain, (London: Routledge, 2005), pp. 253-5. Arias or ballads from the English opera became concert standards in recital."]}, {"page": "Anna Maria Crouch", "response": ["Born Anna Maria Phillips, she first went on stage as a child, acting and singing. Articled to Thomas Linley, she made her debut at Drury Lane theatre in 1780 as Mandane in Thomas Arne's Artaxerxes, and became a principal in the regular company of the theatre under the management of Sheridan and Linley. In 1781 she made a great success as the heroine in Charles Dibdin's Lionel and Clarissa. She was a notable Ophelia, Olivia and Celia.H. van Thal (ed.), Solo Recital - The Reminiscences of Michael Kelly (Folio Society, London 1972), Biographical Index, p. 339. Her Polly Peachum in The Beggar's Opera was well known. In 1787 her stage partnership began with the Irish actor and singer, Michael Kelly, on his arrival in London with Stephen and Nancy Storace from the Viennese court."]}, {"page": "Antonio Sacchini", "response": ["Initially settling in Rome, Sacchini spent several years composing opere buffe for the Teatro Valle. These works made him famous throughout Europe. One of the most notable of them – it has been revived and recorded in modern times – was the two-act intermezzo La contadina in corte (1765). In 1768, Sacchini moved to Venice, having accepted the temporary post of director of the Conservatorio dell'Ospedale dei Poveri Derelitti (the \"Ospedaletto\"), offered by his predecessor in the job Tommaso Traetta, who had been Sacchini's friend since their studies together in Naples and who was now leaving Venice to work at the court of Saint Petersburg.See Giuseppe Ellero, Maria Carla Paolucci, Jolanda Scarpa (ed.), Arte e musica all'Ospedaletto. Schede d'archivio sull'attività musicale degli Ospedali dei Derelitti e dei Mendicanti di Venezia (sec. XVI–XVIII), Venice, Stamperia di Venezia Editrice, 1978 In Venice, Sacchini soon made a name for himself as a singing master (his pupils included Nancy Storace and, possibly, Adriana Gabrielli, who, under the name Adriana Ferrarese del Bene was subsequently to go down in history as the first singer to play Mozart's Fiordiligi). While continuing to pursue his career as an opera composer, he also spent time writing sacred pieces (oratorios, masses, hymns, motets) for the Conservatorio and various Venetian churches, as his contract required."]}, {"page": "Anna Storace", "response": ["#REDIRECT Nancy Storace"]}, {"page": "Anna Selina Storace", "response": ["#REDIRECT Nancy Storace"]}, {"page": "The Pirates (opera)", "response": ["|Fabulina||soprano|| Nancy Storace"]}, {"page": "Fra i due litiganti il terzo gode", "response": ["|Nancy Storace"]}, {"page": "Prima la musica e poi le parole", "response": ["|Nancy Storace"]}, {"page": "La scuola de' gelosi", "response": ["It was first performed at the Teatro San Moisè in Venice on 27 December 1778.Elena Biggi Parodi, \"La fortuna della musica di Salieri in Italia ai tempi di Mozart\" in Da Beaumarcais a Da Ponte, ed. Elena Biggi Parodi and Rudolph Angermüller, Torino, 1996, pp. 41–51. In 1783 it was given at the Burgtheater in Vienna to inaugurate the reestablishment of the Italian opera troupe. Salieri revised the score for the 1783 performances, creating new arias and expanding the role of woodwinds and brass in the scoring of the work. The cast included Francesco Benucci as Blasio and Nancy Storace as the countess, the original Figaro and Susanna in Mozart's The Marriage of Figaro. It reached London in 1786, where, as in many other European cities, it enjoyed great success. Joseph Haydn composed two insertion arias for the work, one lost, the surviving aria, \"Dice benissimo\", for the bass role Lumaca and orchestra, H. 24b/5."]}, {"page": "La grotta di Trofonio", "response": ["|Nancy Storace"]}, {"page": "Concert aria", "response": ["*\"Ch'io mi scordi di te?\", K. 505, written for Nancy Storace"]}, {"page": "List of British Italians", "response": ["* Nancy Storace"]}, {"page": "Storace", "response": ["* Nancy Storace (1766–1817), operatic singer"]}, {"page": "No Song, No Supper", "response": ["The piece was first given as a part of a benefit evening for Michael Kelly. He took the role of Frederick, with Nancy Storace taking the role of Margaretta, a role which she was also to sing at her farewell performance in 1808. It was immediately put into the Drury Lane repertoire and remained popular during Storace's lifetime.", "|Margaretta ||soprano|| Nancy Storace"]}, {"page": "Gli equivoci", "response": ["|Nancy Storace "]}, {"page": "Una cosa rara", "response": ["|Nancy Storace"]}, {"page": "Karl Geiringer", "response": ["*(1981) with Irene Geiringer, Stephen and Nancy Storace in Vienna, in Essays on the Music of J.S. Bach and other divers subjects: a tribute to Gerhard Herz, pages 235-244. Edited by Eobert L. Weaver. University of Louisville, Louisville, Kentucky. "]}]}}