{"wiki_id": "http://www.wikidata.org/entity/Q260857", "itemLabel": "David E. H. Jones", "itemDescription": "British chemist, columnist and science writer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_E._H._Jones", "wikipedia_page": {"main": "David Edward Hugh Jones (20 April 1938 – 19 July 2017) was a British chemist and author, who under the pen name Daedalus was the fictional inventor for DREADCO.  Jones' columns as Daedalus were published for 38 years, starting weekly in 1964 in New Scientist. He then moved to the journal Nature, and continued to publish until 2002.  Columns from these magazines, along with additional comments and implementation sketches, were collected in two books: The Inventions of Daedalus:  A Compendium of Plausible Schemes (1982) and The Further Inventions of Daedalus (1999).", "link_mentions": [{"page": "Space elevator", "response": ["Both the tower and cable ideas were proposed in David E. H. Jones' quasi-humorous Ariadne column in New Scientist, December 24, 1964."]}, {"page": "New Scientist", "response": ["Throughout most of its history, New Scientist has published cartoons as light relief and comment on the news, with contributions from regulars such as Mike Peyton and David Austin. The Grimbledon Down comic strip, by cartoonist Bill Tidy, appeared from 1970 to 1994. The Ariadne pages in New Scientist commented on the lighter side of science and technology and included contributions from David E. H. Jones, Daedalus. The fictitious inventor devised plausible but impractical and humorous inventions, often developed by the (fictitious) DREADCO corporation. Daedalus later moved to Nature."]}, {"page": "David Jones", "response": ["* David E. H. Jones (1938–2017), best known as Daedalus, British writer and scientist"]}, {"page": "Daedalus (Ariadne)", "response": ["#REDIRECT David E. H. Jones"]}, {"page": "James R. Newman", "response": ["* \"The World of Mathematics by James R. Newman\"—a 1989 book review in the journal Nature by David E. H. Jones."]}, {"page": "Daedalus Research Evaluation and Development Corporation", "response": ["#REDIRECT David E. H. Jones"]}, {"page": "DREADCO", "response": ["#REDIRECT David E. H. Jones"]}, {"page": "Deadalus Research Evaluation And Development Corporation", "response": ["#REDIRECT David E. H. Jones"]}, {"page": "The Inventions of Daedalus", "response": ["#REDIRECT David E. H. Jones"]}, {"page": "3D printing", "response": ["In 1974, David E. H. Jones laid out the concept of 3D printing in his regular column Ariadne in the journal New Scientist."]}, {"page": "Eltham College", "response": ["* David E. H. Jones, chemist and writer"]}, {"page": "Deadalus Research Evaluation and Development Corporation", "response": ["#REDIRECT David E. H. Jones"]}, {"page": "Daedalus (fictional inventor)", "response": ["#REDIRECT David E. H. Jones"]}, {"page": "Archaeoacoustics", "response": ["An early interpretation of the idea of archaeoacoustics was that it explored acoustic phenomena encoded in ancient artifacts. For instance, the idea that a pot or vase could be \"read\" like a gramophone record or phonograph cylinder for messages from the past, sounds encoded into the turning clay as the pot was thrown. There is little evidence to support such ideas, and there are few publications claiming that this is the case. In comparison, the more contemporary approach to the field now has many publications and a growing significance. This earlier approach was first raised in the 6 February 1969 issue of New Scientist magazine, where it was discussed in David E. H. Jones's light-hearted \"Daedalus\" column. He wrote:"]}, {"page": "Bicycle and motorcycle dynamics", "response": ["In 1970, David E. H. Jones published an article in Physics Today showing that gyroscopic effects are not necessary to balance a bicycle. Since 1971, when he identified and named the wobble, weave and capsize modes, Robin Sharp has written regularly about the behavior of motorcycles and bicycles. While at Imperial College, London, he worked with David Limebeer and Simos Evangelou."]}, {"page": "Daedalus research evaluation and development corporation", "response": ["#REDIRECT David E. H. Jones "]}, {"page": "David E H Jones", "response": ["#REDIRECT David E. H. Jones "]}, {"page": "David E.H. Jones", "response": ["#REDIRECT David E. H. Jones "]}, {"page": "David EH Jones", "response": ["#REDIRECT David E. H. Jones "]}, {"page": "Peter Jones (classicist)", "response": ["Peter Vaughan Jones MBE (born 1942) is a Cambridge graduate with a doctorate on Homer.Peter V. Jones at the National Library of Australia He is a former senior lecturer in Classics at the University of Newcastle upon Tyne, and co-founded with Jeannie Cohen the Friends of Classics charity. He used to be a teacher but is now employed as a writer, journalist and broadcaster. He is the brother of the late David E. H. Jones."]}, {"page": "List of people with surname Jones", "response": ["*David E. H. Jones (1938–2017), British chemist and writer (pseudonym Daedalus of DREADCO)"]}, {"page": "List of Newcastle University people", "response": ["* David E. H. Jones - chemist"]}, {"page": "2017 in the United Kingdom", "response": ["**David E. H. Jones, 79, chemist and author."]}, {"page": "Deaths in July 2017", "response": ["*David E. H. Jones, 79, British chemist and author.David Jones, British chemist and ‘court jester in the palace of science,’ dies at 79"]}]}}