{"wiki_id": "http://www.wikidata.org/entity/Q260464", "itemLabel": "Ed Balls", "itemDescription": "British politician (born 1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ed_Balls", "wikipedia_page": {"main": "Edward Michael Balls (born 25 February 1967) is a British broadcaster, writer, economist, professor and former politician who served as Secretary of State for Children, Schools and Families from 2007 to 2010, and as Shadow Chancellor of the Exchequer from 2011 to 2015. A member of the Labour Party and the Co-operative Party, he was Member of Parliament (MP) for Normanton and later for Morley and Outwood between 2005 and 2015.\nBalls attended Nottingham High School before studying philosophy, politics and economics at Keble College, Oxford, and was later a Kennedy Scholar in economics at the John F. Kennedy School of Government, Harvard University. He was a teaching fellow at Harvard from 1988 to 1990, when he joined the Financial Times as the lead economic writer. Balls had joined the Labour Party while attending Nottingham High School, and became an adviser to Shadow Chancellor Gordon Brown in 1994, continuing in this role after Labour won the 1997 general election, and eventually becoming the Chief Economic Advisor to the Treasury.\nAt the 2005 general election, Balls was elected as the MP for Normanton (which in 2010 became Morley and Outwood), and in 2006 became Economic Secretary to the Treasury. When Brown became Prime Minister in 2007, Balls became Secretary of State for Children, Schools and Families, serving until the 2010 general election; Labour were at that point defeated after thirteen years in government, and returned to Opposition. Balls was appointed as Shadow Secretary of State for Education under Harriet Harman and finished in third place at the 2010 Labour leadership election, triggered by Brown's resignation as Leader of the Labour Party, after which he was appointed as Ed Miliband's Shadow Home Secretary. He served in this role until 2011, when he was then appointed as Shadow Chancellor of the Exchequer, a role that he held until he was unseated at the 2015 general election.\nFollowing his electoral defeat, he became a senior fellow at Harvard University Kennedy School's Mossavar-Rahmani Center for Business and Government, and a visiting professor to the Policy Institute at King's College London. He was appointed chairman of Norwich City F.C. in December 2015, a position he held until December 2018. In 2020, he was appointed Professor of Political Economy at King's College London. Balls was a contestant on series 14 of the BBC's Strictly Come Dancing, surviving until week 10, and in 2021 was the winner in the BBC's Celebrity Best Home Cook.", "link_mentions": [{"page": "List of political scandals in the United Kingdom", "response": ["* The Ed Balls document leak was exposed by the Daily Telegraph and showed that shadow chancellor Ed Balls was involved in a supposed plot known as 'Project Volvo' to oust Tony Blair as leader and replace him with Gordon Brown shortly after the 2005 election."]}, {"page": "February 25", "response": ["*1967 – Ed Balls, British politician; Shadow Chancellor of the Exchequer"]}, {"page": "Gordon Brown", "response": ["In mid-2008, Brown's leadership was presented with a challenge as some MPs openly called for him to resign.  This event was dubbed the 'Lancashire Plot', as two backbenchers from (pre-1974) Lancashire urged him to step down and a third questioned his chances of holding on to the Labour Party leadership.  Several MPs argued that if Brown did not recover in the polls by early 2009, he should call for a leadership contest.  However, certain prominent MPs, such as Jacqui Smith and Bill Rammell, suggested that Brown was the right person to lead Britain through its economic crisis.  In the autumn, Siobhain McDonagh, an MP and junior government whip, who during her time in office had never voted against the government, spoke of the need for discussion over Brown's position.  While she did not state that she wanted Brown deposed, she implored the Labour Party to hold a leadership election. McDonagh was sacked from her role shortly afterward, on 12 September. She was supported in making clear her desire for a contest by Joan Ryan (who applied, as McDonagh had, for leadership nomination papers, and became the second rebel to be fired from her job), Jim Dowd, Greg Pope, and a string of others who had previously held positions in government. In the face of this speculation over Brown's future, his ministers backed him to lead the party, and Harriet Harman and David Miliband denied that they were preparing leadership bids. After Labour lost the Glasgow East by-election in July, Harman, the deputy leader of the party, said that Brown was the \"solution\", not the \"problem\"; Home Secretary Smith, Justice Secretary Jack Straw, Schools Secretary Ed Balls and Cabinet Office Minister Ed Miliband all re-affirmed their support for Brown. The deputy Prime Minister under Blair, John Prescott, also pledged his support. Foreign Secretary David Miliband then denied that he was plotting a leadership bid, when on 30 July, an article written by him in The Guardian was interpreted by a large number in the media as an attempt to undermine Brown. In the article, Miliband outlined the party's future, but neglected to mention the Prime Minister. Miliband, responded to this by saying that he was confident Brown could lead Labour to victory in the next general election, and that his article was an attack against the fatalism in the party since the loss of Glasgow-East. Miliband continued to show his support for Brown in the face of the challenge that emerged in September, as did Business Secretary John Hutton, Environment Secretary Hilary Benn, and Chief Whip Geoff Hoon."]}, {"page": "Keble College, Oxford", "response": ["File:Ed balls.jpg|Ed Balls, Former Shadow Chancellor of the Exchequer"]}, {"page": "Financial Times", "response": ["In July 2006 the FT announced a \"New Newsroom\" project to integrate the newspaper more closely with FT.com. At the same time it announced plans to cut the editorial staff from 525 to 475. In August 2006 it announced that all the required job cuts had been achieved through voluntary layoffs. A number of former FT journalists have gone on to high-profile jobs in journalism, politics and business. Robert Thomson, previously the paper's US managing editor, was the editor of The Times and is now the publisher of the Wall Street Journal. Will Lewis, a former New York correspondent and News Editor for the FT, is the current editor of the Daily Telegraph. Dominic Lawson went on to become editor of the Sunday Telegraph until he was sacked in 2005. Andrew Adonis, a former education correspondent, became an adviser on education to the then British Prime Minister, Tony Blair, and was given a job as an education minister and a seat in the House of Lords after the 2005 election. Ed Balls became chief economic adviser to the Treasury, working closely with Gordon Brown, the chancellor of the exchequer (or finance minister), before being elected a Member of Parliament in 2005, and became Secretary of State for Children, Schools and Families in July 2007. Bernard Gray, a former defence correspondent and Lex columnist, was chief executive of the publishing company CMP before becoming chief executive of TSL Education, publisher of the Times Educational Supplement. David Jones, at one time the FT Night Editor, then became Head of IT. He was a key figure in the newspaper's transformation from hot metal to electronic composition and then onto full-page pagination in the 1990s. He went on to become Head of Technology for the Trinity Mirror Group."]}, {"page": "Home education in the United Kingdom", "response": ["In 2009, Ed Balls,Elective Home Education Hansard 11 June 2009 : Column 44WS the Secretary of State for Children, Schools and Families, commissioned Graham Badman, the former Director of Children's Services at Kent County Council,Parents who home educate children to be forced to register The Guardian, 11 June 2009 to review current practice of local authorities in relation to home educators, and to investigate if home education was used as a cover for some forms of child abuse.Action To Ensure Children’s Education & Welfare DCSF Press Release, January 2009", "Although the Department framed legislation to implement much of the review, Queen's Speech: Bill-by-bill BBC News Children, Schools and Families Bill Schedule 1 - Home education, England (draft legislation) due to a lack of cross-party support and intense campaigning by home education advocacy groups it was  dropped by the Labour administration in the run-up to the 2010 General Election.Ed Balls drops key education reforms BBC News 7 April 2010"]}, {"page": "New Labour", "response": ["In the months following Labour's 1997 election victory, referendums were held in Scotland and Wales regarding devolution. There was a clear majority supporting devolution in Scotland and a narrower majority in Wales—Scotland received a stronger degree of devolution than Wales. The Labour government passed laws in 1998 to establish a Scottish Parliament and Welsh Assembly and the first elections for these were held in 1999.Elliot, Faucher-King & Le Galès 2010, p. 65. Blair attempted to continue peace negotiations in Northern Ireland by offering the creation of a regional parliament and government. In 1998, the Good Friday Agreement was made, allowing for a 108-member elected assembly and a power-sharing arrangement between nationalists and unionists. Blair was personally involved in these negotiations.Elliot, Faucher-King & Le Galès 2010, p. 69. The Fabian Society was a forum for New Labour ideas and for critical approaches from across the party. The most significant Fabian contribution to Labour's policy agenda in government was Ed Balls's 1992 pamphlet advocating Bank of England independence. In 1998, Blair and his New Labour government introduced the Human Rights Act. This was made to give UK law what the European convention of human rights had established. It was given the royal assent on the 9 November 1998, but it was not truly put in place until early October 2000."]}, {"page": "Bevanism", "response": ["Bevanism was influenced by Marxism: Bevan's biographer and later Leader of the Labour Party Michael Foot said that Bevan's \"belief in the class conflict stayed unshaken\", while acknowledging that Bevan was not a traditional Marxist. Despite declaring inspiration from Marx, Bevan did not visibly support insurrectionist concepts of proletarian revolution, arguing that revolution depended on the circumstances, or the typical organisational model of many Communist parties. According to Ed Balls, Bevan and his supporters instead preferred a strident but pluralist conception of democratic socialism, tempered by pragmatic sensibilities and practical application."]}, {"page": "Keir Hardie", "response": ["Labour founder Keir Hardie has been voted the party's \"greatest hero\" in a straw poll of delegates at the 2008 Labour conference in Manchester. Labour peer Lord Morgan, Ed Balls, David Blunkett and Fiona Mactaggart argued the case for four Labour figures at a Guardian fringe meeting at the Labour conference 2008 in Manchester, 23 September 2008."]}, {"page": "Norwich City F.C.", "response": ["The club also maintains a healthy celebrity support with celebrity cook Delia Smith and comedian Stephen Fry both having moved from being fans of the club to running it. Actor Hugh Jackman is also a fan of the club, having been taken to Carrow Road as a child by his English mother, though he turned down an opportunity to become an investor in the club in 2010. BT Sport Presenter Jake Humphrey, who was born in Peterborough but moved to Norwich with his family at the age of nine, is another celebrity supporter. Other well-known supporters include Sky Sports presenter Simon Thomas, who is Vice-President of the Norwich City Supporters Trust, Norfolk-born musician, model and media personality Myleene Klass, fiction author Philip Pullman, and Labour ex-politician Ed Balls. Journalist and broadcaster Sir David Frost also declared his love for The Canaries during his lifetime.", "On 27 December 2015, former Shadow Chancellor Ed Balls was appointed Chairman, however he left in late 2018."]}, {"page": "Alexei Sayle", "response": ["In February 2016, Sayle said of Labour Party leader Jeremy Corbyn: \"He's ascetic and morally incorruptible. The propaganda that's thrown against him is disgraceful. Until he appeared, you had to vote for one kind of Oxbridge twat or another, people who all go to the same dinner parties, people like the Ed Ballses and George Osbornes. Jeremy has shown that, within a democratic tradition, other things are possible.\" In 2016, he wrote a comment piece for The Guardian saying that he was happy to mock New Labour in his act but now that Corbyn was about to \"reform the party in his own image – ascetic, socialist, kindly and ethical\" he would stop making jokes about Labour."]}, {"page": "Jimmy Reid", "response": ["After a private service in Rothesay his hearse was driven into Glasgow for a secular funeral service at the Govan Old Parish Church on 19 August. The cortege passed the BAE Systems Surface Ships yard in Govan, one of the shipyards saved after the collapse of UCS, where hundreds of workers had gathered outside in tribute. The funeral service  was attended by notable figures including Ed Balls, Ed Miliband, Gordon Brown, Alex Salmond, Sir Alex Ferguson and Sir Billy Connolly."]}]}}