{"wiki_id": "http://www.wikidata.org/entity/Q260111", "itemLabel": "Steve Baker", "itemDescription": "British politician (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Baker_(politician)", "wikipedia_page": {"main": "Steven John Baker (born 6 June 1971) is a British politician and a former Royal Air Force engineer, consultant and bank worker, who served as Chair of the European Research Group (ERG) from 2016 to 2017 and 2019 to 2020. A member of the Conservative Party, he has been the Member of Parliament (MP) for Wycombe in Buckinghamshire since 2010.In June 2015 he became co-chair of Conservatives for Britain, a campaigning organisation formed of Eurosceptic MPs. He co-founded The Cobden Centre and sits on its advisory board. He established and chairs the all-party parliamentary group (APPG) on Economics, Money and Banking. He was Chair of the ERG, a pro-Brexit group of Conservative MPs, from 20 November 2016 until his promotion to ministerial office at the Department for Exiting the European Union on 13 June 2017, but resigned from his office on 9 July 2018 following the resignation of David Davis over concerns with the government's strategy on Brexit. The same day Jacob Rees-Mogg appointed Baker as the Deputy Chair and de facto whip of the ERG, alongside Mark Francois. In September 2019 Baker was again elected as the group's chair, taking over from Rees-Mogg. In February 2020 he announced his resignation from the post, but confirmed that he would continue as a member.", "link_mentions": [{"page": "St Cross College, Oxford", "response": ["* Steve Baker, British politician"]}, {"page": "High Wycombe", "response": ["The town is currently represented by Conservative MP Steve Baker. He is chairman of the eurosceptic European Research Group and was a junior minister in the Department for Exiting the European Union from 2017 to 2018. In July 2018, Baker resigned alongside Brexit Secretary David Davis and Foreign Secretary Boris Johnson in opposition to the Chequers plan proposed by Prime Minister Theresa May."]}, {"page": "David Davis (British politician)", "response": ["In July 2016, following a referendum in which a small majority of those voting supported leaving the European Union, Davis was appointed by the new Prime Minister, Theresa May, to the new Department for Exiting the European Union (DExEU) as Secretary of State, with responsibility for negotiating the UK's prospective exit from the EU. He was sidelined mid-way through the talks, with the Prime Minister's Europe Adviser Olly Robbins taking charge of negotiations. Davis resigned from his government position on 8 July 2018 over May's Brexit strategy and the Chequers plan. Following his resignation the DExEU junior minister, Steve Baker, and the Foreign Secretary, Boris Johnson, also resigned.", "On 8 July 2018, Davis resigned as Brexit Secretary as he did not \"believe\" in the Prime Minister's Chequers plan for Brexit. Following Davis' resignation, Steve Baker and Boris Johnson also resigned."]}, {"page": "Hazlemere", "response": ["As of August 2020, Hazlemere has two electoral wards. However, the new Buckinghamshire Council does not use the existing ward boundaries, and instead has a single unitary ward for Hazlemere; this ward elects five councillors in total. Hazlemere North and Hazlemere South are part of the Wycombe Parliamentary constituency, currently represented by Steve Baker MP, a Conservative."]}, {"page": "Institute of Economic Affairs", "response": ["David Davis, Steve Baker and Lord Callanan, ministers at the Department for Exiting the European Union (DExEU) at the time, all recorded meetings with the IEA in the first three months of 2018. The Observer reported on 29 July 2018 that the director of the IEA was secretly recorded in May and June telling an undercover reporter that funders could get to know ministers on first-name terms and that his organisation was in \"the Brexit influencing game\". While seeking funding, Littlewood said that the IEA allowed donors to affect the \"salience\" of reports and to shape \"substantial content\". The recording was to be given to the Charity Commission on 30 July."]}, {"page": "Mark Francois", "response": ["On 3 March 2020, Francois was announced as chair of the ERG, succeeding Steve Baker. In this capacity he wrote to Michel Barnier, head of the task force negotiating the post-Brexit relationship between the UK and the EU, a letter titled \"A Missive from a Free Country\". Barnier replied in an open letter."]}, {"page": "List of United Kingdom MPs: B", "response": ["* Steve Baker (2010–present)"]}, {"page": "Libertarian Alliance", "response": ["The Tame-Gabb LA for many years held dinners and conferences with high-profile speakers as Adam Smith Institute Director Eamonn Butler and libertarian writer Claire Fox in 2006,\"LA Conference 2006\" Libertarian Alliance anarcho-capitalist philosophers David D. Friedman and Hans-Hermann Hoppe in 2008,\"LA Conference 2008\" Libertarian Alliance and LGBT activist Peter Tatchell and Conservative Party Member of Parliament Steve Baker in 2010.\"LA Conference 2010\" Libertarian Alliance Since 2010, there have been no such events, with the focus being on publications, social media, and the Free Life Podcast.\"The Free Life Podcast\" Free Life Podcast"]}, {"page": "Wycombe (UK Parliament constituency)", "response": ["Wycombe  is a constituency represented in the House of Commons of the UK Parliament since 2010 by Steve Baker, a Conservative.", "|Steve Baker || Conservative"]}, {"page": "List of Parliamentary constituencies in Buckinghamshire", "response": ["|Steve Baker †"]}, {"page": "Cornerstone Group", "response": ["|Steve Baker || Wycombe || 2010"]}, {"page": "Steven Baker", "response": ["Steven or Steve Baker is the name of:", "* Steve Baker (baseball) (born 1956), major league pitcher", "* Steve Baker (footballer, born 1962), English footballer", "* Steve Baker (footballer, born 1978), English footballer ", "* Steve Baker (ice hockey) (born 1957), American ice hockey goaltender", "* Steve Baker (motorcyclist) (born 1952), former Grand Prix motorcycle road racer", "* Steve Baker (speedway rider), Australian motorcycle speedway rider", "* Steve Baker, designer of the Space Crusade boardgame", "* Steve Baker (illusionist) (born 1938), American comedian, magician and escape artist", "* Steve Baker (politician) (born 1971), British Conservative Party MP for Wycombe"]}, {"page": "Wycombe Hospital", "response": ["The Accident and Emergency department was closed in 2005. A midwife-led birthing centre replaced the maternity unit and other services have been moved to the other hospitals run by the Trust. A campaign called Hand Back Our Hospital is attempting to restore services at the hospital. More than 6000 people have signed a petition calling for the restoration of the casualty department.  Wycombe MP Steve Baker commissioned a report from the Durrow healthcare consultancy in 2014. This suggested that the hospital could be used for a \"new generation\" of casualty unit with an ambulance station integrated into the hospital and could offer GP appointments."]}, {"page": "Treasury Select Committee", "response": ["| Steve Baker MP"]}, {"page": "Transport Select Committee", "response": ["| Steve Baker MP (Conservative)", "| Steve Baker MP (Conservative)"]}, {"page": "Poltair School", "response": ["* Steve Baker, Conservative MP since 2010 for Wycombe"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Steve Baker; MP for Wycombe (2010–present)"]}]}}