{"wiki_id": "http://www.wikidata.org/entity/Q2608158", "itemLabel": "Robert Brown Black", "itemDescription": "British colonial administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Black_(colonial_administrator)", "wikipedia_page": {"main": "Sir Robert Brown Black  (3 June 1906 – 29 October 1999) was a British colonial administrator who served as the third Governor of Singapore from 30 June 1955 to 9 December 1957, and 23rd Governor of Hong Kong from 23 January 1958 to 31 March 1964.\nBorn in Edinburgh and educated at George Watson's College and the University of Edinburgh, he would spend three decades overseas and return to Britain in the 1960s.", "link_mentions": [{"page": "Chinese University of Hong Kong", "response": ["The Fulton Commission report was tabled in the Legislative Council in June 1963, and the Chinese University of Hong Kong Ordinance was passed in September of that year. The school was officially inaugurated in a ceremony at City Hall on 17 October 1963, officiated by the founding chancellor, Sir Robert Brown Black. The next year, Dr. Li Choh-ming was appointed the first Vice-Chancellor of the university. The university originally comprised the Faculty of Arts, Faculty of Science and Faculty of Social Science. Construction began at the site of the new campus in the Ma Liu Shui area, where Chung Chi College was already established, for new facilities to house central administration and the relocated New Asia and United colleges."]}, {"page": "Governor of Hong Kong", "response": ["| Sir Robert Brown Black柏立基"]}, {"page": "Hong Kong City Hall", "response": ["The foundation stone laying ceremony took place on 25 February 1960 with Sir Robert Brown Black, then Governor of Hong Kong,Hong Kong City Hall at ArtLinkArt who also presided over the official opening ceremony on 2 March 1962. Hong Kong Memory: Grand opening of Hong Kong City Hall The City Hall was placed under the responsibility of the Urban Council. It has been listed as a Grade I historic building since 2009.List of the 1,444 Historic Buildings in Building Assessment (as of 8 June 2017)"]}, {"page": "Chief Secretary for Administration", "response": ["| Sir Robert Brown Black柏立基", "| rowspan=3| Sir Robert Brown Black"]}]}}