{"wiki_id": "http://www.wikidata.org/entity/Q261669", "itemLabel": "Finola Hughes", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Finola_Hughes", "wikipedia_page": {"main": "Finola Hughes (born 29 October 1959) is an English actress, television host, entrepreneur, author, and dancer, best known for her role as Anna Devane on the ABC soap operas General Hospital and All My Children, and her portrayal of Laura in the 1983 film Staying Alive, the sequel to Saturday Night Fever.\nShe is also known for her portrayal of Anna Devane's identical twin, Dr. Alexandra Devane Marick, on All My Children, and Patty Halliwell on the supernatural series, Charmed. She also portrayed Carol in the final seasons of the NBC sitcom Blossom. Hughes has also appeared in the films Aspen Extreme, Above Suspicion and Like Crazy.\n\n", "link_mentions": [{"page": "1960", "response": ["** Finola Hughes, British actress"]}, {"page": "Fionnuala", "response": ["*Finola Hughes"]}, {"page": "Showgirls", "response": ["A long list of actresses was considered for the role of Nomi Malone, including Pamela Anderson, Drew Barrymore, Angelina Jolie, Vanessa Marcil, Jenny McCarthy, Denise Richards, and Charlize Theron, but they all turned it down before Elizabeth Berkley, following the cancellation of Saved by the Bell, signed on to play the role. Madonna, Sharon Stone, Sean Young, Daryl Hannah, and Finola Hughes (who allegedly turned down the script because she thought it was sexist) were considered for the part of Cristal Connors before Gina Gershon became available."]}, {"page": "1995 in film", "response": ["| Above Suspicion || HBO Pictures / Rysher Entertainment || Steven Schachter (director/screenplay); Jerry Lazarus, William H. Macy (screenplay); Christopher Reeve, Joe Mantegna, Kim Cattrall, Edward Kerr, Geoffrey Rivas, Finola Hughes, William H. Macy, Ron Canada, Natalia Nogulich, Clark Gregg, Marty Levy, J.J. Johnston, Blake Foster, Frank Medrano, Joanna Miles, Gerald Castillo, Timothy Landfield, Peter Michael Goetz, Lionel Mark Smith, Sandy Martin, Arthur Taxier, Dana Reeve, Holley Chant, David Byron, Seidy Lopez, Ellis Williams || Crime, Thriller, Drama || Live action "]}, {"page": "1998 in film", "response": ["| Pocahontas II: Journey to a New World || Walt Disney Home Video || Tom Ellery, Bradley Raymond (directors); Allen Estrin, Cindy Marcus, Flip Kobler (screenplay); Irene Bedard, Billy Zane, Donal Gibson, David Ogden Stiers, John Kassir, Russell Means, Frank Welker, Linda Hunt, Danny Mann, Michelle St. John, Jim Cummings, Finola Hughes, Jean Stapleton, Brad Garrett, Judy Kuhn, Jeff Bennett, Rob Paulsen, Gregg Rainwater, W. Morgan Sheppard, Kath Soucie, April Winchell, Bob Bergen, Rodger Bumpass, Jennifer Darling, Debi Derryberry, Paul Eiding, Bill Farmer, Jonathan Joss, Georgina Lightning, Phil Proctor, Russell Werkman, Mark O'Brien, Mickie McGowan, Andrew Roa, Marjorie Tanin, Darrell James, Tim Weske, Patricia Cullen, Colin McCabe || Musical, Adventure, Family || Animation"]}, {"page": "1993 in film", "response": ["| Aspen Extreme || Hollywood Pictures || Patrick Hasburgh (director/screenplay); Paul Gross, Peter Berg, Finola Hughes, Teri Polo, William Russ, Trevor Eve, Martin Kemp, Tony Griffin, William McNamara || Sports || Live action", "*Aspen Extreme, starring Peter Berg, Paul Gross, Finola Hughes, Teri Polo"]}, {"page": "1983 in film", "response": ["*Staying Alive, directed by Sylvester Stallone, starring John Travolta, Cynthia Rhodes, Finola Hughes", "| Staying Alive || Paramount Pictures / RSO Records || Sylvester Stallone (director/screenplay); Norman Wexler (screenplay); John Travolta, Cynthia Rhodes, Finola Hughes, Steve Inwood, Julie Bovasso, Charles Ward, Norma Donaldson, Jesse Doran, Joyce Hyser, Frank Stallone, Kurtwood Smith, Sylvester Stallone || Dance, Musical || Live action"]}, {"page": "1980 in film", "response": ["| The Apple || The Cannon Group / NF Geria II / Filmgesellschaft mbH || Menahem Golan (director/screenplay); Catherine Mary Stewart, Allan Love, Grace Kennedy, George Gilmour, Joss Ackland, Vladek Sheybal, Ray Shell, Miriam Margoyles, Derek Deadman, George S. Clinton, Finola Hughes, Femi Taylor, John Chester, Michael Logan, Francesca Poston, Leslie Meadows, Gunter Notthoff, Clem Davies, Coby Recht, Iris Recht || Sci-Fi, Musical, Comedy || Live action "]}, {"page": "Charmed", "response": ["During the first two seasons, the sisters face various evil beings from week to week. However, in the third season, they discover that their ultimate enemy is The Underworld's demonic ruler, The Source of All Evil. Eventually, Prue is killed in the season three finale by The Source's personal assassin, Shax (Michael Bailey Smith). While grieving for their older sister, Piper and Phoebe discover that they also have a younger half-sister, Paige Matthews (Rose McGowan), who had been the secret love child of their witch mother, Patty (Finola Hughes), and her \"whitelighter\" (guardian angel) Sam Wilder (Scott Jaeck). Paige's magical abilities represent her dual heritage as both a witch and whitelighter; like Prue, she possesses a form of telekinesis, but she has to verbally call for objects to \"orb\" (teleport) them to their intended destination. As she attempts to control the two sides of her ancestry, Paige also learns how to orb herself and others, and to heal others with the touch of her hand; she eventually receives her own whitelighter charges to train and protect as they learn witchcraft.  Paige can also \"glamour\", shapeshifting into a different human appearance.", "* Rose McGowan as Paige Matthews (seasons 4–8), the youngest half-sister who initially receives the power to move objects with her mind by orbing (\"teleporting\") objects from one location to another through a vocal command. She was the secret love child of the Halliwell sisters' mother Patty (Finola Hughes) and her whitelighter Sam Wilder (Scott Jaeck), making Paige both a witch and whitelighter. She was given up at birth and raised by her adoptive parents. Paige is introduced upon Prue's funeral at the beginning of season four, where she goes on to help reconstitute The Charmed Ones by taking Prue's place in the \"Power of Three\". As the series progresses, Paige also receives the whitelighter powers of orbing herself and others, as well as sensing, glamouring, and healing."]}, {"page": "Cats (musical)", "response": ["| style=\"text-align:center;\" | Finola Hughes", "Lynne choreographed the original London production with a dance crew consisting of her assistant Lindsay Dolan, the dance captain Jo-Anne Robinson, and cast members Finola Hughes and John Thornton. The resulting choreography blends ballet, modern dance, jazz and tap, interspersed with acrobatic displays. Lynne also trained the cast to evoke the movement, physicality and behaviour of actual cats. These feline traits were incorporated into the movement and choreography so as to create an \"anthropomorphic illusion\". Lynne considered the 13-minute \"Jellicle Ball\" dance to be the crux of the show, noting that in order to work as a dance-driven musical, Cats \"had to succeed there or die\". She recalled the difficulty she faced in persuading Lloyd Webber to add the extended dance break, culminating in her and her dance crew having to dance all the parts in the \"Jellicle Ball\" to convince him."]}, {"page": "Phantom Zone", "response": ["* The Phantom Zone is featured in All-Star Superman. Like the comics, Superman places Bar-El (voiced by Arnold Vosloo) and Lilo (voiced by Finola Hughes) into the Phantom Zone until a cure for their Kryptonite illness can be found."]}, {"page": "Piper Halliwell", "response": ["In the opening episode of the fourth season (2001–02), \"Charmed Again (Part 1)\", it is revealed Piper has been healed of her injuries from the season three finale and Prue was unable to be saved. Piper attempts numerous spells to resurrect Prue to no avail, and when she comes into contact with her Grams, it is revealed that Prue is still struggling to adjust to being in the afterlife and that she is being helped to process her actual death by both Penny and the girls' mother Patty Halliwell (Finola Hughes). Penny also reveals to Piper that Prue cannot be summoned back to Earth because seeing Prue would not allow the sisters to grieve and move on to continue their destiny. This leads to Piper being broken and outraged towards everyone around her, especially to Leo which she states \"saved the wrong sister\". Finally accepting Prue is really gone, she attends the funeral of her big sister. This results in Phoebe having a premonition to save a young girl at the funeral and later discovering her identity as their younger half-sister Paige Matthews (Rose McGowan). A love child between their mother and her whitelighter, who was kept secret because of her whitelighter heritage. Piper struggles to accept the new sister and role of the now eldest sibling as she and Paige initially butt heads, but eventually grow to have a mutual respect for each other. With the addition of Paige, Piper and Phoebe are able to reconstitute the Power of Three and avenge Prue's death in vanquishing her murderer Shax and The Source himself twice – both in his original incarnation and that of his next incarnation, Cole. The sisters are later visited by the Angel of Destiny (Dakin Matthews) and given an offer to live a normal life without magical powers or the threat of demons. After Piper declines alongside her sisters, the Angel informs her that she is pregnant with her first child."]}, {"page": "Paige Matthews", "response": ["Paige Matthews is a fictional character from the American television series Charmed, played by Rose McGowan from October 4, 2001, until May 21, 2006. The character was created by executive producer Brad Kern as a replacement for lead character Prue Halliwell, following the departure of actress Shannen Doherty. Paige is introduced into season four as the fiercely independent younger half-sister of the show's remaining female leads, Piper  (Holly Marie Combs) and Phoebe Halliwell (Alyssa Milano). Like her sisters, Paige is a witch, and more specifically, a Charmed One—one of the most powerful witches of all time. Paige is introduced as the secret love child of the Halliwell sisters' mother Patty (Finola Hughes) and her whitelighter (guardian angel) Sam Wilder (Scott Jaeck), making Paige both a witch and whitelighter. She was given up at birth and raised by her adoptive parents.", "Paige appears as the secret half-sister in the final five seasons of Charmed, portrayed by Rose McGowan within 112 episodes from 2001 to 2006. In the first episode of the fourth season (2001–2002), \"Charmed Again (Part 1)\", we are introduced to Paige, a recovering alcoholic in her early twenties working for South Bay Social Services as an assistant, working her way toward becoming a social worker. In the same episode, it is revealed that after Paige's adoptive parents (played by Lisa Darr and M. Scott Wilkinson) died, she went searching for her birth parents and suspected that she might be related to the Halliwell sisters. With Patty Halliwell (Finola Hughes) long since deceased, Paige relented on pursuing the matter further. After the Source of All Evil learns of Paige's existence, he orders her killed. Paige is eventually saved by Phoebe Halliwell (Alyssa Milano) and her boyfriend Cole Turner (Julian McMahon), and then subsequently introduced to Piper Halliwell (Holly Marie Combs) and her husband Leo Wyatt (Brian Krause). Paige then goes on to help reconstitute The Charmed Ones by taking Prue Halliwell's (Shannen Doherty) place in  \"The Power of Three\". This is made possible after it is revealed that she is the daughter of Patty and the Whitelighter Sam Wilder (Scott Jaeck), making her a \"sister-witch\" to Phoebe and Piper. The episode reveals that Paige was given up at birth to protect her from the wrath of The Elders if they were to discover her Whitelighter heritage."]}, {"page": "Prue Halliwell", "response": ["In the premiere of season four (2001–02) \"Charmed Again (Part 1)\", it is revealed that Prue could not be saved in time from the fatal wounds she acquired from Shax in the season three finale. Although the character is never shown again, Piper attempts numerous spells to resurrect Prue to no avail, and when she comes into contact with her Grams, it is revealed that Prue is still struggling to adjust to being in the afterlife and that she is being helped to process her actual death by both Penny and the girls' mother Patty Halliwell (Finola Hughes). Penny also reveals to Piper that Prue cannot be summoned back to Earth because seeing Prue would not allow the sisters to grieve and move on to continue their destiny. This leads to Piper becoming broken and outraged towards everyone around her, especially to her husband Leo who she states \"saved the wrong sister\". Finally accepting Prue is really gone, she attends the funeral of her big sister. This results in Phoebe having a premonition to save a young girl at the funeral and later discovering her identity as their younger half-sister Paige Matthews (Rose McGowan). A love child between their mother and her whitelighter, who was kept secret because of her whitelighter heritage. With the addition of Paige, Piper and Phoebe are able to reconstitute the Power of Three and avenge Prue's death in vanquishing her murderer Shax."]}, {"page": "4th Golden Raspberry Awards", "response": ["**Finola Hughes – Staying Alive as Laura", "**Finola Hughes – Staying Alive as Laura"]}, {"page": "Pauline Collins", "response": ["|Finola Hughes"]}, {"page": "Blossom (TV series)", "response": ["* Carol Russo (played by Finola Hughes) – An Englishwoman with a daughter named Kennedy, she eventually marries Nick, becoming the stepmother to his three children. She and Kennedy's father are divorced, but still have an amicable relationship. In the penultimate episode of the series, Carol realizes that she is pregnant with Nick's child."]}, {"page": "Sunset Beach (TV series)", "response": ["Other notable guest appearances include Finola Hughes as Cole's ex-fiancée Helena, Christopher Darden as Les Gordon, John O'Hurley as the host of Wheel of Misfortune, Kim Alexis as a hotel maid, Jack Wagner as a thief named Jacques Dumont, and Barbara Mandrell as Casey's ill mother Alex Mitchum."]}, {"page": "Dimitri Marick", "response": ["Soon after his debut on the soap opera, Dimitri became a complex leading man and took part in some of the most notable plots of the 1990s. He had a very popular romance with Erica Kane (Susan Lucci). Dimitri and Erica's storylines include a tumultuous romance leading to two failed marriages and a miscarriage. One of the biggest obstacles in their relationship was Erica's vindinctive and manipulative daughter, Kendall Hart (Sarah Michelle Gellar). Dimitri also had a popular romance with Alexandra Devane (Finola Hughes) and a loving yet antagonistic relationship with his half-brother, Edmund Grey (John Callahan).", "The romance between Dimitri and Finola Hughes' Alexandra Devane Marick also rose in popularity. Soap Opera Update named them the best couple of the year in 1999 for All My Children despite the fact that their love story played out through brief flashbacks. The magazine compared the couple's relationship to the television series Once and Again. Soap Opera Update also referred to them as the \"break out supercouple of the year\"."]}, {"page": "Tristan Rogers", "response": ["Rogers returned to General Hospital as Robert Scorpio on 29 February 2012 after Anna Devane (Finola Hughes) called him back to Port Charles to tell him that their daughter Robin Scorpio-Drake had been killed in a lab accident. After seven episodes, he left again on 8 March 2012. Rogers expressed disappointment. He later returned to the series on 15 November 2012 but later departed on 18 December 2012 as his character was drugged into a coma. Rogers reprised the role on 4 October 2013 as part of his on-screen daughter's return. However, on 14 November 2013 it was announced that he would be departing the series to return to The Young and the Restless as Colin Atkinson. He made his last appearance on 30 January 2014."]}, {"page": "Emma Frost", "response": ["* Emma Frost appears in the 1996 live-action television movie called Generation X, portrayed by Finola Hughes."]}, {"page": "Ian Buchanan", "response": ["| Favorite Super Couple: Daytime – shared with Finola Hughes", "| Favorite Super Couple: Daytime – shared with Finola Hughes"]}, {"page": "Kimberly McCullough", "response": ["In 1985, after failing to land a role on the TV sitcom Webster, McCullough auditioned for the role of Robin Scorpio, the 6-year-old daughter of Robert Scorpio (Tristan Rogers) and Anna Devane (director/actress Finola Hughes). The producers made her audition 12 times but eventually gave her the part and her role became a popular success.Soapography, aired June 16, 2007, \"Kimberly McCullough and Rick Springfield\"."]}, {"page": "Laura Spencer (General Hospital)", "response": ["In February 2013, Laura reappears in Port Charles, and witnesses a close moment between Luke and Anna Devane (Finola Hughes). She then surprises Lulu at The Haunted Star where she reveals that she met up with Lucky in Ireland. Laura also reconnects with Elizabeth and meets Lucky's son, Aiden for the first time. On Valentine's Day, Luke and Laura share a brief reunion. The past comes back to haunt them when Lulu and husband Dante Falconeri (Dominic Zamprogna) reveal that someone sent Lulu a replica of the original Ice Princess diamond. Scott then arrives and reveals that he and Laura are back together. Their impending nuptials are derailed when Lulu is kidnapped by a very much alive Stavros Cassadine. Nikolas suddenly arrives with news of Lulu's whereabouts and is immediately shot. They eventually end up on Cassadine Island where they confront Stavros. Dante frees Lulu and Laura traps Stavros in the cryogenic chamber he held Lulu in. They are shocked when Lulu refuses to go home and claims Stavros as her husband. Laura wants to postpone her wedding to Scott until Lulu regains her memories but after a kiss with Luke, Laura realizes she needs to move on. Laura and Scott are married on May 20, 2013, at Nikolas's castle Wyndemere by her mother Lesley. Laura makes plans to revive Deception Cosmetics with Lucy Coe (Lynn Herring) but those plans are derailed when she goes to help a gravely ill Luke against Scott's wishes. Luke and Laura return to Port Charles and reunites with their family only Scott to reveal he is filing for divorce. Laura then returns to Paris for her annual check up."]}, {"page": "Lady Shiva", "response": ["* Lady Shiva appears in Beware the Batman, voiced by Finola Hughes. She appears as an elite member of the League of Assassins. In \"Safe\", Lady Shiva sends Silver Monkey to capture Dr. Jason Burr so that they can get the Ion Cortex. After the mission fails, Lady Shiva learns from Silver Monkey that Katana faked her death, had the Soultaker Sword in her possession all this time, and was helping to defend Burr. Lady Shiva states that they will obtain the Ion Cortex another way and that Katana is now the bigger prize for the League of Assassins. In \"Family\", Lady Shiva shows up in person at the Argos Club where she foils Silver Monkey's scheme to usurp her position within the League. Lady Shiva commented that the League of Assassins' ninjas are more afraid of her than Silver Monkey. After Silver Monkey was incapacitated by the ninjas, Lady Shiva uses the reclaimed Soultaker Sword to steal the soul of Bethanie Ravencroft (who claimed that she wasn't working against her) and Lady Shiva announces that she has other plans to deal with Silver Monkey. Lady Shiva then fights Batman and Katana to a draw, but escapes and leaves her ninjas to deal with them. In \"Sacrifice\", Lady Shiva learns that a package bound to the League of Assassins was stolen by Anarky. Anarky makes a deal with Lady Shiva where she will get back her package in exchange for a small favor. Lady Shiva leads the League of Assassin ninjas to the supposed location of the package at the Gotham Contagion Research Center. Batman and Katana arrive where Lady Shiva unleashes her League of Assassin ninjas and then she fights Batman and Katana as they try to prevent her from unknowingly releasing a virus. When a League of Assassins ninja unknowingly releases a vial of Calibosix (a cell mutation virus), Lady Shiva leaves as two of her ninjas get infected. Batman, Katana, and Lady Shiva had to work together to evade the infected ninjas while Anarky taunts them from his lair. As Batman tries to get them out, Lady Shiva states that Batman is more of a hero and that Katana is just a killer like her. Batman, Katana, and Lady Shiva then climb to Level 1 while evading the infected ninjas. While Katana buys Batman and Katana some time to get away, Lady Shiva ends up attacking Batman as the building's Breach Protocol is activated. Batman defeats Lady Shiva and handcuffs her to pipe. By the time Katana is cured with the serum, Lady Shiva has already gotten away. When Lady Shiva returns to her lair, she finds the package with a note from Anarky as it is shown that the package contains the body of Ra's al Ghul. In \"Instinct\", Jason Burr (who still has some of Cypher's control in him from a previous episode) tells Lady Shiva that the Ion Cortex will soon belong to the League of Assassins. Lady Shiva then ends up \"welcoming\" Jason to the League of Assassins. In \"Fall\", Lady Shiva revives Ra's al Ghul from suspended animation so that the League of Assassins can put their plans to control the Ion Cortex in order to plunge Gotham City into darkness. When Jason Burr fights off Cypher's control and tries to regain control of the Ion Cortex, Lady Shiva uses the Soultaker Sword to steal Jason Burr's soul. In \"Darkness\", Lady Shiva continues to help her master. When Silver Monkey stalls the ninjas to allow Batman to escape, she takes on Silver Monkey by herself. After a close battle, it is implied that she used the Soultaker Sword's abilities on Silver Monkey as she is later seen holding Silver Monkey's mask. In \"Reckoning\", Lady Shiva is seen by Ra's al Ghul side before she is defeated by Katana."]}, {"page": "Gloria Monty", "response": ["Monty's dismissal became inevitable between the declining ratings and the departure of popular cast members such as Tristan Rogers (Robert Scorpio) and Finola Hughes (Anna Devane, who Monty fired among much criticism). In early 1992, after only a year, Monty was replaced with Wendy Riche. She produced several made-for-television movies based on her friend Mary Higgins Clark's novels. She also chaired the New Jersey Motion Picture & Television Commission."]}]}}