{"wiki_id": "http://www.wikidata.org/entity/Q261001", "itemLabel": "Shaun Woodward", "itemDescription": "British politician (born 1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Shaun_Woodward", "wikipedia_page": {"main": "Shaun Anthony Woodward (born 26 October 1958) is a British politician who was the Labour Member of Parliament (MP) for St Helens South from 2001 to 2015. He served in the cabinet from 28 June 2007 to 11 May 2010 as Secretary of State for Northern Ireland. Following the 2010 general election, Woodward was the Shadow Secretary of State for Northern Ireland until 7 October 2011, when he was replaced by Vernon Coaker.\nA former television researcher and producer, Woodward began his political career in the Conservative Party. He was elected in 1997 as a Conservative MP for Witney, but joined Labour in 1999.", "link_mentions": [{"page": "October 26", "response": ["*1958 – Shaun Woodward, English journalist and politician, Secretary of State for Northern Ireland"]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Shaun Woodward", "| Shaun Woodward"]}, {"page": "Dungannon and South Tyrone Borough Council", "response": ["Under the Review of Public Administration (RPA) the council is due to merge with Magherafelt District Council and Cookstown District Council in 2011 to form a single council for the enlarged area totalling 1714 km² and a population of 120, 096. The next election was due to take place in May 2009, but on 25 April 2008, Shaun Woodward, Secretary of State for Northern Ireland announced that the scheduled 2009 district council elections were to be postponed until the introduction of the eleven new councils in 2011."]}, {"page": "Secretary of State for Northern Ireland", "response": ["| Shaun WoodwardMP for St Helens South"]}, {"page": "Ulster Defence Association", "response": ["Shaun Woodward, the British Secretary of State for Northern Ireland, stated that this \"is a major act of leadership by the UDA and further comprehensive evidence of the success of politics over violence in Northern Ireland\" and the act was also welcomed by Sinn Féin and DUP politicians.\" Northern Ireland politicians hail UDA move \"  Belfast Telegraph. Retrieved 8 January 2010. The President of the Republic of Ireland, Mary McAleese, described the decommissioning as \"a very positive milestone on the journey of peace\".\"President hails 'milestone on journey of peace'\"  The Irish Times. Retrieved 8 January 2010. US Secretary of State Hillary Clinton also welcomed the move as a step towards lasting peace in Northern Ireland.\" Clinton welcomes weapons decommission by N. Ireland's loyalist paramilitary group \" Xinhua. Retrieved 8 January 2010."]}, {"page": "Castlereagh (borough)", "response": ["The borough was divided into four electoral areas: Castlereagh Central, South, East and West. In the 2011 elections, 23 members were elected. As of February 2012 the political composition of the council was: 11 Democratic Unionist Party (DUP), 6 Alliance Party, 3 Ulster Unionist Party (UUP), 2 Social Democratic and Labour Party (SDLP) and 1 Green Party councillor. The last election was due to take place in May 2009, but on 25 April 2008, Shaun Woodward, Secretary of State for Northern Ireland announced that the scheduled 2009 district council elections were to be postponed until the introduction of the eleven new councils in 2011.Northern Ireland elections are postponed, BBC News, April 25, 2008, accessed April 27, 2008 The proposed reforms were abandoned in 2010, and the most recent district council elections took place in 2011"]}, {"page": "Whitehaven", "response": ["On 20 July 2006, Broadcasting Minister Shaun Woodward and Industry Minister Margaret Hodge announced that Whitehaven would be the pilot site for the switchover to digital terrestrial television in the United Kingdom. The selection of a pilot site followed on from trial switchovers held in Ferryside and Bolton."]}, {"page": "Witney", "response": ["Witney, in recent times, has been a safe seat for the Conservative Party. Former Foreign Secretary Douglas Hurd and former leader of the Conservatives and Prime Minister, David Cameron were both MPs for Witney. In the 1997 General Election, Shaun Woodward stood and won the seat as a Conservative, after Hurd retired. Woodward switched to the Labour Party in 1999.  In the 2001 General Election Woodward stood as the Labour candidate in the St Helens South constituency, and David Cameron retook Witney for the Conservatives. He became Prime Minister in coalition with the Liberal Democrats in May 2010 and continued after the 2015 election, in which the Conservative Party gained a majority, but retired to the backbenches after the referendum which rejected his government's recommendation to remain in the European Union. He stood down as an MP soon after, triggering a by-election which was held on 20 October 2016, and Robert Courts was elected. Courts was re-elected in 2017.  However, Witney Town Council is currently controlled by the Labour Party and the majority of the town of Witney's councillors on West Oxfordshire District Council are Labour. The current mayor is Labour's Joy Aitman.", "*Shaun Woodward, Conservative and then Labour MP for Witney, then Labour MP for St Helens South from 2001 to 2015."]}, {"page": "List of current members of the British Privy Council", "response": ["| Shaun Woodward"]}, {"page": "Tory Reform Group", "response": ["* Labour Party: Shaun Woodward, Alan Howarth, Peter Temple-Morris, Alan Amos, Anthony Nelson, Robert V. Jackson, Judith SymesReformer, August 2003, page 25"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Shaun Woodward"]}, {"page": "Shaun Anthony Woodward", "response": ["#redirect Shaun Woodward"]}, {"page": "Tim Sainsbury", "response": ["He has two daughters, Camilla (born 1962) and Jessica (born 1970), and two sons, James (born 1962) and Alexander (born 1968). Camilla was married until late 2015 to Shaun Woodward (an MP who defected from the Conservative Party to Labour). Jessica is married to Peter Frankopan."]}, {"page": "David Cameron", "response": ["On 4 April 2000, Cameron was selected as PPC for Witney in Oxfordshire. This had been a safe Conservative seat, but its sitting MP Shaun Woodward (who had worked with Cameron on the 1992 election campaign) had \"crossed the floor\" to join the Labour Party and was selected instead for the safe Labour seat of St Helens South. Cameron's biographers Francis Elliott and James Hanning describe the two men as being \"on fairly friendly terms\".Elliott and Hanning (2007), p. 192. Cameron, advised in his strategy by friend Catherine Fall, put a great deal of effort into \"nursing\" his potential constituency, turning up at social functions, and attacking Woodward for changing his mind on fox hunting to support a ban.\"Why Shaun Woodward changed his mind\" (Letter). The Daily Telegraph. 21 December 2000."]}]}}