{"wiki_id": "http://www.wikidata.org/entity/Q2618161", "itemLabel": "Willie Morgan", "itemDescription": "Scottish footballer (born 1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/Willie_Morgan", "wikipedia_page": {"main": "William Morgan (born 2 October 1944) is a Scottish former professional footballer.", "link_mentions": [{"page": "William Morgan", "response": ["* Willie Morgan (born 1944), Scottish footballer"]}, {"page": "Chicago Sting", "response": ["== Cosmos doubled, Willie Morgan, Foulkes quits ==", "1977: Head coach Bill Foulkes headed for Britain yet again before the 1977 season to sign a player who would prove to be one of the most successful and popular players in the NASL's history – Willie Morgan, the Scottish international midfielder. Morgan, who arrived on loan from Bolton Wanderers had played over 500 games in the Football League for Bolton Wanderers, Burnley and Manchester United.", "* 1977 Willie Morgan"]}, {"page": "Martin Buchan", "response": ["Buchan was signed by Manchester United manager Frank O'Farrell on 29 February 1972 for £120,000, and at the time was the club's record signing. His first game for United came on 4 March 1972 against Tottenham in the First Division. He was unable to prevent United from suffering relegation to the Second Division in 1973–74. However, United bounced back at the first attempt as Second Division champions. Buchan became club captain in 1975 following the departure of Willie Morgan."]}, {"page": "List of Manchester United F.C. players", "response": ["|scope=\"row\"| Willie Morgan"]}, {"page": "John Connelly (footballer, born 1938)", "response": ["In the following three seasons, Connelly played a full part and scored plenty of goals to help Burnley finish fourth, second and third, respectively, in the league. In addition to finishing second in the 1961–62 season, Burnley reached the FA Cup final where they were beaten 3–1 by Tottenham Hotspur. Connelly played on the right wing and received a runners-up medal. In the 1963–64 season, the emergence of a talented young Scottish winger, Willie Morgan, meant that Connelly was forced to play on the left wing. In April 1964 he was transferred to Manchester United for £56,000.John Connelly – Burnley FC – Clarets MAD  "]}, {"page": "History of Manchester United F.C. (1945–1969)", "response": ["By May 1969, the United squad was rather aged. Foulkes, whose appearances were now limited and who would retire the following season, was now 37. Shay Brennan and Bobby Charlton were now in their early thirties and Denis Law was just months short of his 30th birthday, although the squad did include some impressive younger players including 20-year-old forward Brian Kidd and new signing Willie Morgan, an acquisition from Burnley just after the European Cup victory. Alex Stepney, 26, was now United's regular goalkeeper, having been signed from Chelsea three years earlier to replace Harry Gregg."]}, {"page": "History of Manchester United F.C. (1969–1986)", "response": ["The new-look Manchester United side contained impressive young players like Steve Coppell, Sammy McIlroy, Brian Greenhoff, Jimmy Greenhoff, Arthur Albiston and Stuart Pearson. Although goalkeeper Alex Stepney was still with United, Busby's final signing and United's former captain Willie Morgan had left in the summer of 1975 after a dispute with manager Tommy Docherty. United were now being captained by Martin Buchan."]}, {"page": "1972–73 in Scottish football", "response": ["|Lou Macari, Jimmy Bone, Joe Harper, Willie Morgan"]}, {"page": "Willie Irvine", "response": ["Irvine joined the Burnley youth team initially on a month's trial, along with other young players including Brian O'Neil and Willie Morgan. He suffered an injury to his ankle but recovered in time for the final trial match against local rivals Blackburn Rovers. His performances during the month had sufficiently impressed manager Harry Potts, and Irvine was offered a permanent contract.Thomas (2005), p. 48 He became a full member of the youth team and was an understudy to the team that won the Football League First Division in the 1959–60 season. As an apprentice footballer he earned a basic wage of £7 per week.Thomas (2005), p. 46 While in the youth squad, Irvine was converted into a centre forward and in his first match in the position scored a hat-trick for the Burnley C team. He scored more than 40 goals for the A team in the Lancashire League during the 1961–62 season, including 6 in an 8–3 win against a Blackburn Rovers representative team. On 14 October 1961, Irvine made his debut for the Burnley reserve side, scoring a hat-trick in the 6–1 victory over Barnsley.Thomas (2005), p. 64 Both the A team and the reserves were crowned champions of their respective divisions at the end of the season, and Potts singled out Irvine for particular praise, stating that Burnley had not \"had a more consistent goal getter than Willie for a very long time.\"Thomas (2005), p. 67"]}]}}