{"wiki_id": "http://www.wikidata.org/entity/Q261571", "itemLabel": "Gwyneth Jones", "itemDescription": "Welsh operatic soprano", "wikipedia_url": "https://en.wikipedia.org/wiki/Gwyneth_Jones_(soprano)", "wikipedia_page": {"main": "Dame Gwyneth Jones  (born 7 November 1936) is a Welsh operatic dramatic soprano, widely regarded as  one of the greatest Wagnerian sopranos in the second half of the 20th century.", "link_mentions": [{"page": "Rise and Fall of the City of Mahagonny", "response": ["The July 1998 Salzburg Festival production featured Catherine Malfitano as Jenny, Gwyneth Jones as Begbick, and Jerry Hadley as Jimmy. The Vienna State Opera added it to its repertoire in January 2012 in a production by Jérôme Deschamps conducted by Ingo Metzmacher starring Christopher Ventris as Jimmy and Angelika Kirchschlager as Jenny, notably casting young mezzo-soprano Elisabeth Kulman as Begbick, breaking the tradition of having a veteran soprano (like Varnay or Jones) or musical theater singer (like Patti LuPone) perform the role."]}, {"page": "Franz Schmidt", "response": ["As a composer, Schmidt was slow to develop, but his reputation, at least in Austria, saw a steady growth from the late 1890s until his death in 1939. In his music, Schmidt continued to develop the Viennese classic-romantic traditions he inherited from Schubert, Brahms, and Bruckner. He also takes forward the \"gypsy\" style of Liszt and Brahms. His works are monumental in form and firmly tonal in language, though quite often innovative in their designs and clearly open to some of the new developments in musical syntax initiated by Mahler and Schoenberg. Although Schmidt did not write a lot of chamber music, what he did write, in the opinion of such critics as Wilhelm Altmann, was important and of high quality. Although Schmidt's organ works may resemble others of the era in terms of length, complexity, and difficulty, they are forward-looking in being conceived for the smaller, clearer, classical-style instruments of the Orgelbewegung, which he advocated. Schmidt worked mainly in large forms, including four symphonies (1899, 1913, 1928 and 1933) and two operas: Notre Dame (1904–6) and Fredigundis (1916–21). A CD recording of Notre Dame has been available for many years, starring Dame Gwyneth Jones and James King."]}, {"page": "November 7", "response": ["*1936 – Gwyneth Jones, Welsh soprano"]}, {"page": "Tristan und Isolde", "response": ["There are several DVD productions of the opera including Götz Friedrich's production at the Deutsche Oper in Berlin featuring the seasoned Wagnerians René Kollo and Dame Gwyneth Jones in the title roles. Deutsche Grammophon released a DVD of a Metropolitan Opera performance featuring Jane Eaglen and Ben Heppner, conducted by James Levine, in a production staged by Dieter Dorn and a DVD of the 1993 Bayreuth Festival production with conductor Daniel Barenboim and featuring Waltraud Meier as Isolde and Siegfried Jerusalem as Tristan, staged by Heiner Müller. More recently Barenboim's production at La Scala, Milan, in the production by Patrice Chéreau has also been issued on DVD. There is also a technically flawed, but historically important video recording with Birgit Nilsson and Jon Vickers from a 1973 live performance at the Théâtre antique d'Orange, conducted by Karl Böhm."]}, {"page": "Luchino Visconti", "response": ["|Peter Glossop, Gwyneth Jones & Leontyne Price, Giulietta Simionato, Bruno PrevediConducted by Carlo Maria GiuliniViscontiana 2001, p. 65–66"]}, {"page": "List of Welsh people", "response": ["*Gwyneth Jones (born 1936), singer"]}, {"page": "Wales", "response": ["The BBC National Orchestra of Wales performs in Wales and internationally. The Welsh National Opera is based at the Wales Millennium Centre in Cardiff Bay, while the National Youth Orchestra of Wales was the first of its type in the world. Wales has a tradition of producing notable singers, including Geraint Evans, Gwyneth Jones, Anne Evans, Margaret Price, Tom Jones, Bonnie Tyler, Bryn Terfel, Mary Hopkin, Charlotte Church, Donna Lewis, Katherine Jenkins, and Shirley Bassey. Popular bands that emerged from Wales include Badfinger, the Manic Street Preachers, the Stereophonics and Feeder, the Super Furry Animals and Catatonia. The Welsh traditional and folk music scene is in resurgence with performers such as Siân James"]}, {"page": "Otello", "response": ["A long lineage of renowned baritones have sung Iago since 1887. Among them: Victor Maurel (the role's first exponent), Mattia Battistini, Mario Ancona, Antonio Scotti, Titta Ruffo, Pasquale Amato, Carlo Galeffi and Lawrence Tibbett. Leading post-war exponents of the part have included Giuseppe Valdengo, Leonard Warren, Robert Merrill, Tito Gobbi, Sherrill Milnes and James Morris. Many lyric sopranos have also sung the role of Desdemona since 1887, including Renata Tebaldi (1954), Leonie Rysanek (1960), Gwyneth Jones (1968), Mirella Freni (1974), Kiri Te Kanawa (1974), Margaret Price (1977), Renata Scotto (1978), Katia Ricciarelli (1985), Cheryl Studer (1993), Renée Fleming (1996) and Sonya Yoncheva (2015)."]}, {"page": "John Barbirolli", "response": ["In 1962, HMV persuaded Barbirolli to return. With the Hallé he recorded a Sibelius symphony cycle, Elgar's Second Symphony, Falstaff and The Dream of Gerontius, Schubert's Ninth Symphony, Vaughan Williams's A London Symphony, and works by Grieg and Delius. With other orchestras, Barbirolli recorded a wide range of his repertoire, including many recordings still in the catalogues in 2020. Of these, his Elgar recordings include the Cello Concerto with Jacqueline du Pré, Sea Pictures with Janet Baker, and orchestral music including the First Symphony, Enigma Variations and many of the shorter works. His Mahler recordings include the Fifth and Sixth Symphonies (with the New Philharmonia) and Ninth Symphony (with the Berlin Philharmonic). With the Vienna Philharmonic, he recorded a Brahms symphony cycle, and with Daniel Barenboim, the two Brahms Piano Concertos. He made three operatic sets for HMV: Purcell's Dido and Aeneas with Victoria de los Ángeles (1966),Robertson, Alec, \"Dido and Aeneas\", The Gramophone, October 1966, p. 77 Verdi's Otello with James McCracken, Gwyneth Jones and Dietrich Fischer-Dieskau (1969),Blyth, Alan, \"Verdi: Otello\", The Gramophone, October 1969, p. 97 and a set of Madama Butterfly with Renata Scotto, Carlo Bergonzi and Rome Opera forces that has remained in the catalogues since its first issue in 1967.Anderson, Robert Kinloch, \"Barbirolli's Roman Butterfly\", The Gramophone, September 1967, p. 25; Oliver, Michael, \"Madama Butterfly\", Gramophone, May 1989, p. 90; and O'Connor, Patrick, \"Madama Butterfly\", Gramophone, March 2009, p. 93 The impact of the last was such that the head of the Rome Opera invited him to come and conduct \"any opera you care to name with as much rehearsal as you wish.\" HMV planned to record Die Meistersinger with Barbirolli in Dresden in 1970, but following the Warsaw Pact invasion of Czechoslovakia in 1968 he refused to conduct in the Soviet bloc, and his place was taken by Herbert von Karajan.Kennedy (1971), pp. 306–307, and \"Opera: Wagner\", The Gramophone, October 1971, p. 102"]}, {"page": "Royal College of Music", "response": ["Since opening in 1882, the college has had a distinguished list of teachers and alumni, including most of the composers who brought about the \"English Musical Renaissance\" of the 19th and 20th centuries. Students in the time of Stanford and Parry included Samuel Coleridge-Taylor, Gustav Holst, Ralph Vaughan Williams and John Ireland.Firman, Rosemary. \"Stanford, Sir Charles Villiers (1852–1924)\", Oxford Dictionary of National Biography, Oxford University Press, 2004, accessed 11 December 2011   Later alumni include Benjamin Britten, Michael Tippett, Malinee Peris, Colin Davis, Olga Jegunova, Vasco Dantas, Gwyneth Jones, Rowland Lee, Neville Marriner, Hugh McLean, Gervase de Peyer, Madeleine Mitchell, Trevor Pinnock, Anna Russell, Andrew Lloyd Webber, Julian Lloyd Webber, David Helfgott, James Horner, Jacob Mühlrad, Isyana Sarasvati, Sir Reginald Thatcher, Gillian Weir, and the guitarist John Williams."]}, {"page": "Norma (opera)", "response": ["During the 1980s and 1990s, the role of Norma was performed by such diverse singers as Katia Ricciarelli, Anna Tomowa-Sintow, Marisa Galvany, Dame Gwyneth Jones, and Jane Eaglen. Other Normas include Hasmik Papian, Fiorenza Cedolins, Galina Gorchakova, Maria Guleghina, Nelly Miricioiu, June Anderson, Edita Gruberová and Carmela Remigio (who performs more frequently the role of Adalgisa).Dinko Fabris, \"La Norma\", la Repubblica , Bari edition, 25 May 2011, p. 16; Alessandro Cammarano, \"Venezia – Teatro La Fenice: Norma\", OperaClick , 20 May 2015. Remigio also sang the minor role of Clotilde in the Ravenna Festival's 1994 staging conducted by Riccardo Muti and recorded by EMI."]}, {"page": "Liceu", "response": ["*1980s: Simon Estes (1981/1997), Matti Salminen (1981/2004), Ewa Podleś (1981/2007), Martti Talvela (1982/1989), Franco Bonisolli Éva Marton (1982/2006), Gwyneth Jones (1985/1997), Nicolai Ghiaurov (1985/1992), Rockwell Blake (1986/1996), Dolora Zajick (1988/2008)."]}, {"page": "Antal Doráti", "response": ["In 1969 he made the world premiere recording of Sibelius's tone poem Luonnotar, with Gwyneth Jones as soprano soloist.  In 1973 he conducted the world premiere recording of Max Bruch's Concerto for Two Pianos and Orchestra, which was written in 1912 but only rediscovered in 1971."]}, {"page": "Hansel and Gretel (opera)", "response": ["*1993: Sir Colin Davis and the Staatskapelle Dresden recorded the opera for Philips Classics with Edita Gruberová and Ann Murray as the children. Dame Gwyneth Jones portrays Gertrud."]}, {"page": "Vienna State Opera", "response": ["* Gwyneth Jones"]}, {"page": "Queen of Hearts (Alice's Adventures in Wonderland)", "response": ["* The Queen of Hearts features in Unsuk Chin's 2007 opera Alice in Wonderland; the role was created for Dame Gwyneth Jones."]}, {"page": "Music of Wales", "response": ["In the twentieth century, Wales produced a large number of classical and operatic soloists of international reputation, including Ben Davies, Geraint Evans, Robert Tear, Bryn Terfel, Gwyneth Jones, Margaret Price, Rebecca Evans and Helen Watts, as well as composers such as Alun Hoddinott, William Mathias, Grace Williams and Karl Jenkins.  From the 1980s onwards, crossover artists such as Katherine Jenkins, Charlotte Church and Aled Jones began to come to the fore. Welsh National Opera, established in 1946, and the BBC Cardiff Singer of the World competition, launched in 1983, attracted attention to Wales's growing reputation as a centre of excellence in the classical genre."]}, {"page": "Grammy Award for Best Opera Recording", "response": ["**Andrew Kazdin (producer), Pierre Boulez (conductor), Jeannine Altmeyer, Hermann Becht, Peter Hofmann, Siegfried Jerusalem, Gwyneth Jones, Manfred Jung, Donald McIntyre, Matti Salminen, Ortrun Wenkel, Heinz Zednik, the Bayreuth Festival Orchestra for Wagner: Der Ring des Nibelungen"]}, {"page": "Welsh National Opera", "response": ["During the 1960s the company continued to widen its range. Its first Wagner production, Lohengrin, and its first Mozart, The Marriage of Figaro, were both performed in 1962, conducted by Charles Groves.Fawkes, p. 284 Another Welsh opera, Hughes's Serch yw'r Doctor (\"Love, the Doctor\") was staged in 1960. The popular Italian repertoire remained the core of the annual seasons, mostly directed by the head of production, John Moody. Leading roles were taken by rising stars such as John Shirley-Quirk, Gwyneth Jones, Thomas Allen, Josephine Barstow and Margaret Price, the last of whom made her operatic debut with the company in 1962.Fawkes, pp. 283 – 284, and 287 Established singers guesting with the company included Geraint Evans who played the title role in Don Pasquale in 1966, and Ian Wallace in the same part the following year. Evans was also seen as Leporello in Don Giovanni in 1966 and as Falstaff in 1969.Fawkes, pp. 285, 287 and 351"]}, {"page": "Sarah Caldwell", "response": ["Highlights in Boston that she conducted and/or stage directed included Le voyage de la lune, Otello (with Tito Gobbi as Iago), Command Performance (world premiere), Manon and Faust (both with Beverly Sills and Norman Treigle), Lulu (U.S. East Coast premiere), I puritani (with Dame Joan Sutherland), Intolleranza (U.S. premiere), Boris Godunov (original version), Hippolyte et Aricie (U.S. stage premiere, with Plácido Domingo), La bohème (with Renata Tebaldi and Domingo), Moses und Aron (U.S. premiere), The Rake's Progress, Bluebeard's Castle, Carmen (with Marilyn Horne), Macbeth (original version), The Good Soldier Schweik, The Fisherman and His Wife (world premiere, with Muriel Costa-Greenspon), La finta giardiniera, Norma (with Sills), Les Troyens, Don Carlos (U.S. premiere of original French version), Don Quichotte, War and Peace (U.S. stage premiere, with Arlene Saunders), Benvenuto Cellini (U.S. premiere, with Jon Vickers), I Capuleti e i Montecchi, Montezuma (U.S. premiere), Ruslan and Ludmila (U.S. premiere), Rigoletto (with Sills, Richard Fredricks, and Susanne Marsee), Stiffelio (U.S. stage premiere), La damnation de Faust, Tosca (with Magda Olivero), La vide breve, El retablo de maese Pedro, The Ice Break (U.S. premiere), Aïda (with Shirley Verrett in the title role), Die Soldaten (U.S. premiere), The Invisible City of Kitezh, Taverner (U.S. premiere), The Makropoulos Case (with Anja Silja, William Cochran, and Chester Ludgin), Médée (in French and Greek), Dead Souls (U.S. premiere), Der Rosenkavalier (with Dame Gwyneth Jones) and, finally, The Balcony (world premiere, 1990)."]}, {"page": "Los Angeles Master Chorale", "response": ["** Verdi:  Messa da Requiem,  Zubin Mehta conducting, Gwyneth Jones, soprano; Grace Bumbry, mezzo-soprano; Franco Corelli, tenor; Ezio Flagello, baritone (Myto Records)"]}, {"page": "Wales Millennium Centre", "response": ["The evening celebrations began with Cymru for the World, which celebrated the achievements of five leading Welsh artists; Gwyneth Jones, Shirley Bassey, Siân Phillips, Alun Hoddinott and Richard Burton, represented by his daughter Kate Burton. This included tributes from Robert Hardy, Jonathan Pryce, Derek Jacobi, Nana Mouskouri, Catrin Finch, Ruth Madoc and Ian McKellen. The concert was directed by Ken Caswell and conducted by David Charles Abell."]}, {"page": "Salome (opera)", "response": ["Nevertheless, Maria Cebotari, Ljuba Welitsch, Birgit Nilsson, Leonie Rysanek, Éva Marton, Radmila Bakočević, Montserrat Caballé, Anja Silja, Phyllis Curtin, Karan Armstrong, Nancy Shade, Dame Gwyneth Jones, Catherine Malfitano, Hildegard Behrens, Maria Ewing, Teresa Stratas (only in a film version, not on stage), Olive Fremstad, Brenda Lewis, and Karita Mattila are among the most memorable who have tackled the role in the last half-century. Each of these singers has brought her own interpretation to the title character. Perhaps the two most famous recordings of the opera are Herbert von Karajan's EMI recording with Hildegard Behrens and Sir Georg Solti's Decca recording with Birgit Nilsson as Salome."]}, {"page": "Alun Hoddinott", "response": ["This brought Hoddinott a national profile, which was followed by a string of commissions by leading orchestras and soloists. These commissions continued up to his death, and he was championed by some of the most distinguished singers and instrumentalists of the 20th century. These include singers including Dame Margaret Price, Dame Gwyneth Jones, Sir Thomas Allen, Jill Gomez, Sir Geraint Evans and more recently Claire Booth, Helen Field, Gail Pearson and Jeremy Huw Williams. Instrumentalists have included Ruggiero Ricci, Mstislav Rostropovich, Dennis Brain, Osian Ellis, Cecil Aronowitz, Nia Harries, Roger Woodward and John Ogdon to name a few, and more recently euphonium player , cellist Kathryn Price, trombonist Mark Eager and song pianist Andrew Matthews-Owen."]}, {"page": "Ariadne auf Naxos", "response": ["In 1976, again Karl Böhm conducted a new Vienna State Opera production, this time designed and staged by Filippo Sanjust, with Gundula Janowitz as Ariadne, James King als Bacchus, Agnes Baltsa as composer and Edita Gruberová as Zerbinetta, supported by Erich Kunz, Walter Berry, Heinz Zednik, Barry McDaniel, Kurt Equiluz, Axelle Gall and Sona Ghazarian. Janowitz sang the Ariadne 48 times in Vienna, followed by Lisa Della Casa (40 performances), Anni Konetzni (34), Maria Jeritza (33), Leonie Rysanek (30), Lotte Lehmann (25), Gwyneth Jones (14), Maria Reining and Anna Tomowa-Sintow (both 12 performances each), Christel Goltz and Claire Watson (both 10)."]}, {"page": "James McCracken", "response": ["McCracken made a number of complete opera recordings, including \"Le prophète\" (with Marilyn Horne and Renata Scotto, (Col/CBS), 1976), \"Carmen\" (conducted by Leonard Bernstein, (DG), 1972), \"Fidelio\" (with Birgit Nilsson, (Decca/London), 1964), \"Otello\" (with Dame Gwyneth Jones, (EMI/Angel), 1968) and \"Pagliacci\", on which side 4 of the original LP version was a recital of opera arias, (Decca/London), (1967), as well as Schoenberg's Gurre-Lieder (with Jessye Norman, Tatiana Troyanos and David Arnold, (Phi), 1979), and a program of Irish and Scottish songs with piano (EMI/Angel), 1977. Additionally, he sang the part of Waldemaar in Gurre-Lieder when it opened the Edinburgh International Festival in 1961. The broadcast of this concert, under the direction of Leopold Stokowski, has now been issued on CD (Guild Historical)."]}, {"page": "Gwyneth Jones", "response": ["Gwyneth Jones may refer to:", "* Gwyneth Jones (soprano) (born 1936), Welsh soprano", "* Gwyneth Jones (novelist) (born 1952), British science fiction novelist"]}, {"page": "Eva Turner", "response": ["After retiring from the stage, she remained active in the industry, the following year, she was offered the position of visiting the Professor of voice at the University of Oklahoma, and a one-year contract was extended for nine years. She derived amusement from a misprint in a local newspaper which described her as \"Professor of Vice\", especially as she was later to say that she was \"not in demand\" except as a singer. She returned to London in 1959 where she was appointed Professor of Singing at the Royal Academy of Music, a position she held until aged well into her 80s. Her style of teaching was too forthright for some (Rita Hunter found it too demanding), but it produced such successful students as Amy Shuard, Roberta Knie, Janet Coster and Dame Kiri Te Kanawa. Shuard and later Dame Gwyneth Jones, both of whom had success in the role of Turandot, studied this part with her."]}, {"page": "Fiorenza Cossotto", "response": ["| 1967|| Medea,Neris || Lamberto Gardelli Gwyneth Jones  Bruno Prevedi || Decca Records"]}, {"page": "The Royal Opera", "response": ["Solti, however, was an advocate of opera in the vernacular,\"What Sort of Opera for Covent Garden?\", The Times, 9 December 1960, p. 18 and promoted the development of British and Commonwealth singers in the company, frequently casting them in his recordings and important productions in preference to overseas artists.Haltrecht, p. 295 Among those who came to prominence during the decade were Gwyneth Jones and Peter Glossop.Blyth, Alan. \"Obituaries\", The Gramophone, July 1971, p. 31 Solti demonstrated his belief in vernacular opera with a triple bill in English of L'heure espagnole, Erwartung and Gianni Schicchi.\"Solti's Success with Opera in English\", The Times, 18 June 1962, p. 5 Nevertheless, Solti and Webster had to take into account the complete opposition on the part of such stars as Callas to opera in translation. Moreover, as Webster recognised, the English-speaking singers wanted to learn their roles in the original so that they could sing them in other countries and on record.\"Sir David Webster's 21 Years at Covent Garden\", The Times, 12 April 1965, p. 14 Increasingly, productions were in the original language. In the interests of musical and dramatic excellence, Solti was a strong proponent of the stagione system of scheduling performances, rather than the traditional repertory system. By 1967, The Times said, \"Patrons of Covent Garden today automatically expect any new production, and indeed any revival, to be as strongly cast as anything at the Met in New York, and as carefully presented as anything in Milan or Vienna\".\"Twenty marvellous years at Covent Garden\", The Times, 13 January 1967, p. 14"]}, {"page": "Anja Silja", "response": ["In the 1980s, Silja added Lady Macbeth of the Mtsensk District (opposite Chester Ludgin), La Cubana, Regan in Lear, Prinz Orlofsky in Die Fledermaus (with Karita Mattila and Judith Blegen, staged by Maurice Béjart), the Kostelnička in Jenůfa (at the Glyndebourne Festival),Simeone, Nigel, \"Opera and Concert Reports: Jenůfa/The Makropoulos Case\" (July 1989).  The Musical Times, 130 (1757): pp. 422–429. Grete in Der ferne Klang, and the Nurse in Die Frau ohne Schatten (opposite Dame Gwyneth Jones as Barak's Wife)."]}, {"page": "Theo Adam", "response": ["At the Metropolitan Opera, he appeared first as Sachs in Die  Meistersinger on 7 February 1969, alongside Pilar Lorengar as Eva, John Alexander as Stolzing, conducted by Joseph Rosenstock. That same year he was Wotan in Das Rheingold and Die Walküre, alongside Birgit Nilsson, Régine Crespin, Lili Chookasian, and Jon Vickers, conducted and directed by Herbert von Karajan. He returned to the Metropolitan Opera in 1972 for Sachs and Wotan with a similar cast that now also included Gwyneth Jones. After a sixteen-year absence, Adam returned for the last time in March 1988 as Wotan in Die Walküre with Peter Hofmann as Siegmund, Sabine Hass as Sieglinde, conducted by James Levine.Metropolitan Opera Archives "]}]}}