{"wiki_id": "http://www.wikidata.org/entity/Q26252947", "itemLabel": "Cameron Dawson", "itemDescription": "association football player (born 1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Cameron_Dawson", "wikipedia_page": {"main": "Cameron Miles Dawson (born 7 July 1995) is an English footballer who plays as a goalkeeper for EFL League Two club Exeter City, on loan from Sheffield Wednesday.\n\n", "link_mentions": [{"page": "Silverdale School", "response": ["* Cameron Dawson – Goalkeeper for Exeter City F.C."]}, {"page": "Steel City derby", "response": ["The first of the two derbies was hosted by Sheffield United at Bramall Lane on Friday 9 November 2018, kicking off at 7:45 pm after completing a minute of silence in remembrance of soldiers who gave their lives in conflict. Sky UK, who televised the match, were later criticised and branded disrespectful for playing canned crowd noise over the performance of the Last Post, when the crowd were, in fact, silent. Just 14 minutes into the game, Sheffield United's Mark Duffy was fouled by Sheffield Wednesday's Morgan Fox and was awarded a penalty, taken by David McGoldrick and saved by Cameron Dawson. The night ended with a goalless draw."]}, {"page": "1995 in the United Kingdom", "response": ["* 7 July – Cameron Dawson, footballer"]}, {"page": "Scott Brown (footballer, born April 1985)", "response": ["On 9 June 2021, Brown agreed a two-year deal to join Exeter City as a player-coach, becoming Matt Taylor's second signing of the summer. He sat on the bench as cover for Cameron Dawson in the first half of the 2021–22 season, though stated he did not want to block the progress of the club's young goalkeepers."]}, {"page": "Dawson (surname)", "response": ["*Cameron Dawson (born 1995), English football player"]}, {"page": "Cameron (given name)", "response": ["*Cameron Dawson (born 1995), English footballer"]}, {"page": "Sheffield Wednesday F.C. Academy", "response": ["* Cameron Dawson"]}, {"page": "Joe Wildsmith", "response": ["At the start of the 2017–18 season, Wildsmith appeared in three matches (playing once in the league and twice in the League Cup). He then signed a five year contract with Sheffield Wednesday, keeping him until 2022. Wildsmith then made his return to the starting line–up against Birmingham City on 27 September 2017, as they lost 1–0. Following this, he started in the next two matches, including earning a clean sheet against Leeds United on 1 October 2017. After spending two months returning to the substitute bench, Wildsmith didn't return to the starting line–up until on 15 December 2017 against Wolverhampton Wanderers, losing 1–0. Since returning to the first team, he regained his first choice goalkeeper role for the rest of the season. Wildsmith then kept four consecutive clean sheets for the club between 6 January 2018 and 30 January 2018. Wildsmith continued to remain as the club's first choice goalkeeper until he was dropped in favour of Cameron Dawson for the remaining matches of the 2017–18 season. At the end of the 2017–18 season, Wildsmith made twenty–nine appearances in all competitions.", "Ahead of the 2018–19 season, Wildsmith said he's ready to fight for his place for the first choice goalkeeper role.  However, Manager Jos Luhukay stated while he preferred Cameron Dawson as the first choice keeper in the league, though he would put Wildsmith as a keeper in cup competitions. Luhukay eventually did put Wildsmith in goal for the League matches, starting against Sunderland and Wolverhampton Wanderers. However, he spent the rest of the 2018–19 season, placed on the substitute bench, with Dawson and Westwood preferred to be used in goal under both Luhukay and Steve Bruce and made two appearances in all competitions."]}, {"page": "2015–16 Sheffield Wednesday F.C. season", "response": ["| 28 August 2015 || GK ||  || Cameron Dawson || 2 years || June 2017 || "]}, {"page": "2016–17 Sheffield Wednesday F.C. season", "response": ["| 9 August 2016 || GK ||  || Cameron Dawson || Wycombe Wanderers || 16 August 2016 || ", "|align=\"center\"| Cameron Dawson", "|25 || ||Cameron Dawson ||4 ||50.00% ||2 ||0 ||0 ||2"]}, {"page": "2016–17 Wycombe Wanderers F.C. season", "response": ["| 9 August 2016 || GK ||  || Cameron Dawson || Sheffield Wednesday || 16 August 2016 || "]}, {"page": "2017–18 Chesterfield F.C. season", "response": ["| 6 December 2017 || GK ||  || Cameron Dawson || Sheffield Wednesday || 13 December 2017 || "]}, {"page": "2017–18 Sheffield Wednesday F.C. season", "response": ["| 6 December 2017 || GK ||  || Cameron Dawson ||  Chesterfield || 20 December 2017 || ", "| 28 June 2017 || GK ||  || Cameron Dawson || 3 years || June 2020 || ", "|25 || ||Cameron Dawson ||6 ||66.66% ||2 ||2||0 ||4"]}, {"page": "2017–18 Reading F.C. season", "response": ["Reading were knocked out of the 2017–18 FA Cup on 26 January, losing 3–1 to Sheffield Wednesday at Hillsborough. Sheffield Wednesday took a 3–0 lead thanks to two goals from Atdhe Nuhiu and one from George Boyd before Cameron Dawson turned into his own net to give Reading a consolation goal. Reading's first league victory in eight games came on 30 January, in their rearranged fixture against Burton Albion from 27 January. Reading traveled to Burton Albion's Pirelli Stadium where two goals from Jón Daði Böðvarsson and one from Chris Gunter secured the points for the Royals, with Lucas Akins scoring a penalty for the hosts."]}, {"page": "2018–19 Sheffield Wednesday F.C. season", "response": ["|| 25 || GK || Cameron Dawson || 2 || 0 || 0 || 0 || 0 || 0 || 2 || 0", "|25 || ||Cameron Dawson ||28 ||17.86% ||3 ||2||0 ||5", "| Cameron Dawson"]}, {"page": "2019–20 Sheffield Wednesday F.C. season", "response": ["| 27 January 2020 || GK ||  || Cameron Dawson || 4 1⁄2 years || June 2024 || ", "|25 || ||Cameron Dawson ||28 ||35.71% ||8 ||1||1 ||10"]}]}}