{"wiki_id": "http://www.wikidata.org/entity/Q26263133", "itemLabel": "Daryll Neita", "itemDescription": "British female sprinter", "wikipedia_url": "https://en.wikipedia.org/wiki/Daryll_Neita", "wikipedia_page": {"main": "Daryll Neita (born 29 August 1996) is a British sprinter. She won Olympic bronze medals in 2016 and 2021, and World Championship silver medals in 2017 and 2019 in the 4 × 100 metres relay. Her 100 metres best of 10.93 secs (2021) puts her second on the UK all-time list behind Dina Asher-Smith.", "link_mentions": [{"page": "4 × 100 metres relay", "response": ["|Asha Philip, Imani Lansiquot, Dina Asher-Smith, Daryll Neita", "|Asha PhilipImani LansiquotDina Asher-SmithDaryll Neita"]}, {"page": "Oaklands College", "response": ["* Daryll Neita"]}, {"page": "List of British records in athletics", "response": ["|Asha PhilipDesiree HenryDina Asher-SmithDaryll Neita", "|Asha PhilipImani LansiquotDina Asher-SmithDaryll Neita"]}, {"page": "List of European Athletics Championships medalists (women)", "response": ["|Asha PhilipDina Asher-SmithBianca WilliamsDaryll Neita", "| Asha PhilipBianca WilliamsImani-Lara LansiquotDina Asher-SmithDaryll Neita* "]}, {"page": "London Grand Prix", "response": ["|Asha PhilipDesiree HenryDina Asher-SmithDaryll Neita"]}, {"page": "Asha Philip", "response": ["She won her first senior individual title in 2017, claiming gold at the 2017 European Athletics Indoor Championships 60 metres for women, and with Dina Asher-Smith, Desiree Henry and Daryll Neita formed part of the Great Britain 4 × 100 m relay squad which won an Olympic bronze medal in the 4 x 100 metres relay at the 2016 Rio Games. She also won silver medals in the same event at the 2017 and 2019 World Championships. A noted fast starter and 60 metre sprinter, Philip generally runs the first leg on relay duty.", "In 2016, she competed at the Olympic Games in Rio. Philip reached the semi-finals of the 100 metres, but did not qualify for the finals. Philip then went on to win a bronze medal in the 4 x 100 metres relay, along with teammates Desiree Henry, Dina Asher-Smith and Daryll Neita. The quartet set a new British record with a time of 41.77 seconds."]}, {"page": "London Youth Games", "response": ["Jackie Agyepong, Dina Asher-Smith, Steve Backley, Jack Binstead, Julia Bleasdale, Abdul Buhari, Linford Christie, Tasha Danvers, Monique Davis, Tyrone Edgar, Mo Farah, Jo Fenn, Rikki Fifton, Dalton Grant, Desiree Henry, John Herbert, JJ Jegede, Jade Johnson, Jeanette Kwakye, Joice Maduaka, Daryll Neita, Christine Ohuruogu, Tosin Oke, Samson Oni, Scott Overall, Abi Oyepitan, Asha Philip, Kyle Powell, John Regis, Sabrina Sinha, Laura Turner, David Weir, Benedict Whitby, Conrad Williams, Nadia Williams''"]}, {"page": "2017 World Championships in Athletics", "response": ["|valign=top| Asha PhilipDesirèe HenryDina Asher-SmithDaryll Neita || 42.12"]}, {"page": "2016 European Athletics Championships", "response": ["|Asha PhilipDina Asher-SmithBianca WilliamsDaryll Neita || 42.45 SB"]}, {"page": "Shaftesbury Barnet Harriers", "response": ["|Daryll Neita"]}, {"page": "Desirèe Henry", "response": ["Henry improved her personal bests in 2016 to 11.06 in the 100 meters and 22.46 in the 200 meters and earned selection for the Rio Olympics. She has recently began sprinting 400 meters in 2015. In Rio, she reached the semifinals of the 100 metres, running 11.09, having run 11.08 in her heat. She went on to win a bronze medal in the sprint relay, setting a new British record of 41.77, along with her teammates Asha Philip, Dina Asher-Smith and Daryll Neita."]}, {"page": "Athletics at the 2016 Summer Olympics", "response": ["| valign=top|Asha PhilipDesiree HenryDina Asher-SmithDaryll Neita|| 41.77 "]}, {"page": "Dina Asher-Smith", "response": ["At the 2016 Summer Olympic in Rio, Asher-Smith finished fifth in the 200 metres, in 22.31 seconds, then won a bronze medal with her teammates Asha Philip, Desiree Henry and Daryll Neita in the 4 x 100 metres relay in a British record of 41.77 seconds."]}, {"page": "2021 in sports", "response": ["** 60 m winners:  Zach Jewell (m) /  Daryll Neita (f)"]}, {"page": "Athletics at the 2020 Summer Olympics", "response": ["|Asha PhilipImani LansiquotDina Asher-SmithDaryll Neita || 41.88"]}, {"page": "2018 European Athletics Championships", "response": ["| valign=top|Asha PhilipBianca WilliamsImani-Lara LansiquotDina Asher-SmithDaryll Neita* || 41.88"]}, {"page": "2019 World Athletics Championships", "response": ["|Asha PhilipDina Asher-SmithAshleigh NelsonDaryll NeitaImani-Lara Lansiquot* || 41.85 "]}, {"page": "4 × 100 metres relay at the Olympics", "response": ["| 9= || 41.77 ||align=left| || Asha Philip, Desirèe Henry, Dina Asher-Smith, Daryll Neita"]}, {"page": "Great Britain at the 2016 Summer Olympics", "response": ["|align=left|Daryll Neita", "|align=left|Daryll NeitaAsha PhilipDesirèe HenryDina Asher-Smith"]}, {"page": "List of 2016 Summer Olympics medal winners", "response": ["|Asha PhilipDesirèe HenryDina Asher-SmithDaryll Neita|| 41.77 "]}, {"page": "Athletics at the 2016 Summer Olympics – Women's 100 metres", "response": ["| 4 || 7 ||align=left| Daryll Neita ||align=left|  || 0.169 || 11.41 || "]}, {"page": "Athletics at the 2016 Summer Olympics – Women's 4 × 100 metres relay", "response": ["There was no further plot twist in the final. Even though the United States were along the curb in the less advantageous lane 1, Tianna Bartoletta shot out to the lead around the first turn, making up the stagger on Canada's Farah Jacques before the halfway point in the turn. It was a clean, unobstructed pass to Allyson Felix because Canada was still waiting for the incoming runner to arrive. Felix pulled away down the backstretch, with Jamaica's double sprint gold medalist Elaine Thompson separating from the rest of the field. As English Gardner ran a great turn, USA passed Germany in lane 4, while Jamaica was just about to make up the stagger on Trinidad and Tobago to their immediate outside. By the time Gardner handed off to Tori Bowie, the USA had a 3-metre lead over Jamaica, Great Britain just ahead of Trinidad and Tobago racing for bronze. On the run in, Bowie lost some ground on the lead over Jamaica's two time Olympic gold medalist Shelly-Ann Fraser-Pryce, but still held a comfortable lead, as Great Britain's Daryll Neita separated from Trinidad and Tobago's Khalifa St. Fort, who was also caught by Germany's Rebekka Haase before the line.", "|2 || 7 || align=left| || align=left|Asha Philip, Desirèe Henry, Dina Asher-Smith, Daryll Neita || 41.83 || ", "| align=\"left\" |Asha Philip, Desirèe Henry, Dina Asher-Smith, Daryll Neita"]}, {"page": "Athletics at the 2016 Summer Olympics – Qualification", "response": ["| || Asha PhilipDaryll NeitaDesiree Henry"]}, {"page": "2016 European Athletics Championships – Women's 4 × 100 metres relay", "response": ["| 1 || 1 ||align=left|  ||align=left| Asha Philip, Dina Asher-Smith, Bianca Williams, Daryll Neita || 42.59 || Q, SB", "|  || 5 ||align=left|  ||align=left| Asha Philip, Dina Asher-Smith, Bianca Williams, Daryll Neita || 42.45 || SB"]}, {"page": "Great Britain at the 2016 European Athletics Championships", "response": ["|align=left|Asha PhilipDina Asher-SmithDaryll NeitaBianca Williams "]}, {"page": "Chronological summary of the 2016 Summer Olympics", "response": ["|Asha PhilipDesiree HenryDina Asher-SmithDaryll Neita"]}, {"page": "2017 Diamond League", "response": ["| 11 || align=left| Daryll Neita ||align=left|  ||  || 5"]}, {"page": "2017 European Athletics Team Championships Super League", "response": ["|  || A || 5 || align=left| || align=left|Asha Philip, Desiree Henry, Shannon Hylton, Daryll Neita || 0.125 || DNF ||  || 0"]}, {"page": "Great Britain and Northern Ireland at the 2017 World Championships in Athletics", "response": ["|Dina Asher-SmithDesirèe HenryDaryll NeitaAsha Philip", "|style=text-align:left|Daryll Neita", "|style=text-align:left|Asha PhilipDesirèe HenryDina Asher-SmithDaryll Neita"]}, {"page": "2017 World Championships in Athletics – Women's 100 metres", "response": ["| 13 || 6 || 9 || style=\"text-align:left;\"|Daryll Neita || style=\"text-align:left;\"| || 11.15 || ", "| 13 || 1 || 4 || align=left|Daryll Neita || align=left| || 11.16 ||"]}, {"page": "2017 World Championships in Athletics – Women's 4 × 100 metres relay", "response": ["USA with Aaliyah Brown and the home British team with Asha Philip were out fast, gaining slightly on Tatjana Pinto for Germany to their outside, while outside of Germany, Jura Levy had Jamaica pulling away. USA and Jamaica had smooth handoffs to Allyson Felix and Natasha Morrison respectively, but the British team had a hesitation on the handoff to Desirèe Henry, losing a slight amount of time. On the backstretch, Henry passed Germany's Lisa Mayer. Felix made a comfortable hand off to Morolake Akinosun slightly ahead of Jamaica's handoff to Simone Facey, GBR handing off to Dina Asher-Smith two steps later. Through the final turn, Germany's Gina Lückenkemper made up a lot of ground as the field tightened. At the final handoff Jamaica's Sashalee Forbes took a quick glance back, USA's Tori Bowie took a more serious look to make sure she got the baton, effectively in  handoff style, while Germany to Rebekka Haase and the British to Daryll Neita used the more conventional blind handoffs to pull closer. Onto the straightaway, Bowie had a half metre lead over Forbes and Neita, who were virtually even. Neita looked to stay with Bowie for the first half of the straightaway, separating from Jamaica before Bowie put in some clear separation for the USA win. As Neita tightened, Forbes started to close but not enough for Jamaica to take the silver away from the British.", "| 2 || 1 || 5 ||align=left|  ||align=left| Asha Philip, Desirèe Henry, Dina Asher-Smith, Daryll Neita || 41.93 || , ", "|  || 5 ||align=left|  ||align=left| Asha Philip, Desirèe Henry, Dina Asher-Smith, Daryll Neita || 42.12 || "]}, {"page": "Great Britain and Northern Ireland at the World Athletics Championships", "response": ["|  || Asha PhilipDesirèe HenryDina Asher-SmithDaryll Neita  || 2017 London || Women's 4 × 100 metres relay", "|  || Asha Philip  Dina Asher-Smith  Ashleigh Nelson  Daryll Neita  Imani-Lara Lansiquot* || 2019 Doha || Women's 4 × 100 metres relay"]}, {"page": "And They're Off!", "response": ["And They're Off! (also known as And They're Off!... for Sport Relief) is a British television programme hosted by Ore Oduba with commentary from Dave Lamb and demonstrations from Daryll Neita and is shown on BBC One, featuring contestants predicting which celebrity will win a physical challenge to raise money for Sport Relief. The show features contestants in the BBC Pacific Quay studio answering questions to bet on which celebrity will win in a physical challenge. If their celebrity loses, they go home. The winner wins a prize donated to Sport Relief, for example: Cirque du Soleil tickets."]}, {"page": "2018 British Athletics Championships", "response": ["| Daryll Neita || 11.19 "]}, {"page": "Great Britain and Northern Ireland at the 2018 European Athletics Championships", "response": ["|  || Asha PhilipImani-Lara LansiquotBianca WilliamsDina Asher-SmithDaryll Neita*|| Women's 4 × 100 metres relay || ", "|align=left| Daryll Neita", "|align=left|Dina Asher-SmithImani-Lara LansiquotAsha PhilipBianca WilliamsDaryll Neita (heat only)"]}, {"page": "Athletics at the 2020 Summer Olympics – Qualification", "response": ["| Dina Asher-SmithDaryll NeitaAsha Philip"]}, {"page": "2018 European Athletics Championships – Women's 100 metres", "response": ["| 8 || 2 || 5 || align=left|Daryll Neita || align=left| || 11.48 || ", "| 10 || 2 || 6 || align=left|Daryll Neita || align=left| || 11.27 || "]}, {"page": "2018 European Athletics Championships – Women's 4 × 100 metres relay", "response": ["|Asha Philip, Imani-Lara Lansiquot  Bianca Williams, Daryll Neita", "| 1 || 1 || 2 ||align=left|  ||align=left| Asha Philip, Imani-Lara Lansiquot, Bianca Williams, Daryll Neita || 42.19  || , "]}]}}