{"wiki_id": "http://www.wikidata.org/entity/Q2624799", "itemLabel": "William Rimmer", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Rimmer_(music)", "wikipedia_page": {"main": "William Rimmer (1862–1936) was a Lancashire composer and conductor of brass band music who was particularly well known for his marches.\nRimmer was born in Southport in 1862 into a musical family.  His father was bandmaster of the Lancashire Volunteer Rifles and encouraged both Rimmer and his brother Robert in their musical studies. At the age of 15 Rimmer joined the Southport Rifle band as a side-drummer and then moved on to the cornet, eventually becoming the band's principal cornet soloist.  As a young man he made himself into one of the finest cornet players in the country under the eye of Alexander Owen at Besses o' th' Barn Band.  His prowess on the instrument became well known, and he was engaged as a soloist by many of the best bands of the day.  He eventually gave up playing to concentrate on training and conducting bands.  He started his conducting career with the Skelmersdale Old Band and the Skelmersdale Temperance Band where he saw excellent success at local contests from 1891 to 1895. Then like most of the top brass band conductors of his generation, he became associated with many different bands in the Lancashire area. At the height of his fame conducted every winning band at both the Crystal Palace and Belle Vue competitions between 1905 and 1909.In 1999, a CD dedicated to his music, recorded by Fodens Courtois Band, was released on the Doyen label (DOY CD080).\nOn 29 July 2007, Phillip Hunt devoted his weekly \"Sounds of Brass\" radio programme on BBC Radio Devon to Rimmer and his works.", "link_mentions": [{"page": "American march music", "response": ["*William Rimmer (1862–1936)"]}, {"page": "Rimmer", "response": ["* William Rimmer, English-born American artist", "* William Rimmer (music), English composer of brass band music"]}, {"page": "Southport", "response": ["* William Rimmer, composer and conductor"]}, {"page": "British brass band", "response": ["* William Rimmer"]}, {"page": "William Rimmer", "response": ["William Rimmer (20 February 181620 August 1879) was an American artist born in Liverpool, England. He was the son of a French refugee, who emigrated to Nova Scotia, where he was joined by his wife and child in 1818, and who in 1826 moved to Boston, where he earned a living as a shoemaker. Rimmer's father \"believed himself to be the French dauphin, the son of Louis XVI and Marie Antoinette. \"Armstrong, Craven et al, 200 Years of American Sculpture, David R. Godine, Publisher in association with the Whitney Museum of American Art, New York, 1976 p. 302 The son learned the father's trade; at fifteen became a draughtsman and sign-painter; then worked for a lithographer; opened a studio and painted some ecclesiastical pictures."]}, {"page": "Slaidburn", "response": ["The parish church of St Andrew has a superb Jacobean screen and a fine Georgian pulpit. The brass band composer William Rimmer (1862–1936) composed the now-popular march, named Slaidburn after the village, for the Slaidburn Silver Band. A new village hall has opened to much fanfare and is being well used.http://www.slaidburnvillagehall.com  There is a local pub, the Hark to Bounty, which upstairs houses the ancient halmote or courthouse of the Manor of Slaidburn"]}, {"page": "Harry Mortimer", "response": ["Harry Mortimer was born in Hebden Bridge, Yorkshire, his father being conductor Fred Mortimer (1880–1953). Fred taught Harry and his brothers Rex and Alex to play the cornet, and also composition. Later Harry was taught by William Rimmer (1862–1936). In 1910 the family moved to Luton, where Harry became cornet soloist in the Luton Brass Band, and at the age of 14 years became conductor of the Luton Red Cross Junior Band. The Luton band was also conducted by Fred at this time, which raised their standard considerably. Under the conductor William Halliwell, the Band won the national championship in 1923 at Crystal Palace, the southernmost English Brass Band to do so. Their father then became conductor of the well-known Fodens Motor Works Band, meaning that the family moved to Sandbach, Cheshire. His three sons played in this band too: Alex euphonium, Rex (euphonium) and Harry (cornet)."]}, {"page": "Wingates Band", "response": ["== William Rimmer ==", "It was in 1891 that the band signed its first professional conductor, Mr William Rimmer from Southport. Mr Rimmer was one of the all-time 'giants' of the British band movement. By the turn of the century he had transformed Wingates into an outfit amongst the finest in the land. In 1906 the band achieved the 'double' of British Open and British national Champions. This was repeated in 1907, a feat known as the 'double double' which has only once been emulated since then in the 1970s by the world famous Black Dyke Mills Band."]}, {"page": "Heritage of the March", "response": ["|OO||William Rimmer; Robert Browne Hall", "|MMMM||William Rimmer; Alexander F. Lithgow"]}, {"page": "Charles Trussell", "response": ["*Victorine (Intermezzo?) (March?) c. 1903. A March entitled Victorine composed by William Rimmer (music) existsheld in Kerepehi Brass Band library stamped with C. Trussell.  So this is likely to have been mistaken as a composition by Trussell."]}, {"page": "George Allan (composer)", "response": ["George Allan (21 March 1864 – 16 March 1930) was a composer and arranger of music for brass bands who was born, and resided for most of his life, in New Shildon, County Durham, United Kingdom. As a composer he was a contemporary of William Rimmer and J. Ord Hume."]}]}}