{"wiki_id": "http://www.wikidata.org/entity/Q262467", "itemLabel": "Anna Calvi", "itemDescription": "English singer-songwriter and guitarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Anna_Calvi", "wikipedia_page": {"main": "Anna Margaret Michelle Calvi (born 24 September 1980) is an English singer-songwriter and guitarist. Her accolades include three Mercury Prize nominations, one Brit Award nomination, and a European Border Breakers Award. She has been noted by some critics as a virtuoso guitarist, as well as for her powerful, wide-ranging operatic contralto voice and sometimes androgynous stage appearance.\nBorn to therapist parents in London, Calvi graduated from the University of Southampton with a degree in music, having studied violin. She subsequently worked as a private guitar instructor before embarking on a music career. She released her eponymous debut album in 2011 through Domino Records to critical acclaim, earning a Mercury Prize nomination for Album of the Year, a British Breakthrough Act nomination at the 2012 Brit Awards and a European Border Breakers Award.\nHer second album, One Breath was released in 2013, earning her a second Mercury Prize nomination. She followed this in 2014 with the EP Strange Weather and subsequently wrote the music for a stage production of the opera The Sandman, directed by Robert Wilson. Calvi released her third full-length album, Hunter, in August 2018 earning her a third Mercury Prize nomination.", "link_mentions": [{"page": "Ennio Morricone", "response": ["* Anna Calvi has admitted Morricone's influence."]}, {"page": "Maria Callas", "response": ["* A number of non-operatic singers including Anna Calvi, Linda Ronstadt,\"And This Is What 48 Looks Like\", The New York Times, April 19, 1995 and Patti SmithPatti Smith in conversation with Kurt Andersen on PRI's Studio 360 on December 24, 2009 have mentioned Callas as a great musical influence. Former opera singer turned pop singer Giselle Bellas cites Callas as an influence; her song \"The Canary\" from her debut album Not Ready to Grow Up is inspired by the relationship between Callas and Onassis. Other popular musicians have paid tribute to Callas in their music:"]}, {"page": "David Byrne", "response": ["In May 2014, Byrne announced his involvement with Anna Calvi's EP, Strange Weather, collaborating with her on two songs: a cover of Keren Ann's \"Strange Weather\" and Connan Mockasin's \"I'm the Man, That Will Find You\"."]}, {"page": "Putney", "response": ["*Anna Calvi, singer and songwriter"]}, {"page": "Mercury Prize", "response": ["* Anna Calvi – Anna Calvi", "* Anna Calvi – One Breath", "* Anna Calvi – Hunter", "* Anna Calvi (no wins, nominated 2011/2014/2019)"]}, {"page": "Jeff Buckley", "response": ["There are many musicians who have been influenced by the sounds of Buckley over the years including Muse, Adele, Bat For Lashes, Lana Del Rey, Anna Calvi, Kiesza, Ben Folds, Jonny Lang, Eddie Vedder, Fran Healy and Chris Cornell."]}, {"page": "Nina Simone", "response": ["Musicians who have cited Simone as important for their own musical upbringing include Elton John (who named one of his pianos after her), Madonna, Aretha Franklin, Adele, David Bowie, Patti LaBelle, Boy George, Emeli Sandé, Antony and the Johnsons, Dianne Reeves, Sade, Janis Joplin, Nick Cave, Van Morrison, Christina Aguilera, Elkie Brooks, Talib Kweli, Mos Def, Kanye West, Lena Horne, Bono, John Legend, Elizabeth Fraser, Cat Stevens, Anna Calvi, Cat Power, Lykke Li, Peter Gabriel, Justin Hayward, Maynard James Keenan, Cedric Bixler-Zavala, Mary J. Blige, Fantasia Barrino, Michael Gira, Angela McCluskey, Lauryn Hill, Patrice Babatunde, Alicia Keys, Alex Turner, Lana Del Rey, Hozier, Matt Bellamy, Ian MacKaye, Kerry Brothers, Jr., Krucial, Amanda Palmer, Steve Adey and Jeff Buckley. John Lennon cited Simone's version of \"I Put a Spell on You\" as a source of inspiration for the Beatles' song \"Michelle\". American singer Meshell Ndegeocello released her own tribute album Pour une Âme Souveraine: A Dedication to Nina Simone in 2012. The following year, experimental band Xiu Xiu released a cover album, Nina. In late 2019, American rapper Wale released an album titled Wow... That's Crazy, containing a track called \"Love Me Nina/Semiautomatic\" which contains audio clips from Simone."]}, {"page": "BBC Radio 6 Music", "response": ["The 2019 edition of the festival took place in Liverpool. It ran for three days across four different venues and included sets from The Good, The Bad & The Queen, Anna Calvi, John Grant, Idles, Fontaines D.C. and She drew the gun."]}, {"page": "Don Valley Stadium", "response": ["In 2011, the Arctic Monkeys hosted a two-day comeback festival at the adjacent Don Valley grass bowl to celebrate the release of Suck It and See. The band headlined and were supported on both days, by Miles Kane, The Vaccines, Dead Sons and Anna Calvi as well as local artists."]}, {"page": "Domino Recording Company", "response": ["Founded in 1993, by Laurence Bell and Jacqui Rice, the label's first release was the Sebadoh EP Rocking the Forest, licensed from Sub Pop records for release in the UK.  Many of the early releases were by American artists who in the US were signed to Drag City (Smog, Will Oldham, Royal Trux), a relationship which continues to this day. Success was not immediate, as labels such as Domino, who were releasing more established American rock and unusual British music, were marginalised during the Britpop era, but a steady stream of new signings gave the label increasing credibility. Recent high-profile releases from Anna Calvi, Franz Ferdinand, Arctic Monkeys, and The Kills have only acted as a catalyst to this, and Domino is now one of the longest running and most successful independent record labels in the UK.", "* Anna Calvi"]}, {"page": "Carlo Gesualdo", "response": ["In the NME musician Anna Calvi named Gesualdo as one of her ultimate cult heroes:Ultimate Cult Heroes: Gesualdo at "]}, {"page": "Rock Werchter", "response": ["|IsbellsAnna CalviM. WardEd SheeranJames MorrisonMilow"]}, {"page": "Festival Internacional de Benicàssim", "response": ["*Anna Calvi"]}, {"page": "Songs of Love and Hate", "response": ["Judy Collins recorded \"Dress Rehearsal Rag\" in 1966 on the album In My Life, years before it would appear on Songs of Love and Hate.  The Art Of Time Ensemble featuring Sarah Slean recorded \"Dress Rehearsal Rag\" for their 2009 album Black Flowers. Nick Cave & the Bad Seeds recorded a version of \"Avalanche\" for their 1984 album From Her to Eternity, as did Ghost for the deluxe edition of their 2018 album Prequelle, and Aimee Mann for the soundtrack of the documentary miniseries I’ll Be Gone in the Dark. \"Famous Blue Raincoat\" has been covered numerous times, notably by Jennifer Warnes, who once toured as a back-up singer for Cohen, on her 1987 tribute album to him, Famous Blue Raincoat. It has also been covered by Tori Amos on the Leonard Cohen tribute album Tower of Song. Warnes also covered \"Joan of Arc\" on Famous Blue Raincoat as a duet with Cohen. Allison Crowe recorded \"Joan of Arc\" for release on her 2004 album Secrets and this version also appears on the Mojo 2008 tribute compilation CD Cohen Covered. Anna Calvi has also covered \"Joan of Arc\" live and in the studio, available as a B-side to her single \"Desire\"."]}, {"page": "Sziget Festival", "response": ["* Anna Calvi"]}, {"page": "Alex Thomas", "response": ["As of 2018 Alex has been playing with Anna Calvi, appearing on her album Hunter. On 2 September 2019, Alex was welcomed in to the Zildjian Family of worldwide artists.", "* Anna Calvi - Hunter (2018)"]}, {"page": "Arctic Monkeys", "response": ["Arctic Monkeys embarked in May 2011 on their Suck It and See Tour. They headlined the Benicàssim Festival 2011 alongside the Strokes, Arcade Fire and Primal Scream. They also headlined Oxegen 2011, Super Bock Super Rock 2011, V Festival 2011, Rock Werchter and T in The Park. They confirmed on 7 February that they were playing two \"massive homecoming shows\" at the Don Valley Bowl in Sheffield on 10 and 11 June, support included Miles Kane, Anna Calvi, the Vaccines and Dead Sons and Mabel Love, clips from the show were also used in the music video for \"The Hellcat Spangled Shalalala\". They played at Lollapalooza 5–7 August 2011. On 21 August, they also played at Lowlands, the Netherlands. The tour continued until March 2012."]}, {"page": "Waldegrave School", "response": ["*Anna Calvi, singer songwriter"]}, {"page": "Rock for People", "response": ["**Line Up: Faith No More, Franz Ferdinand, Skrillex, The Prodigy, Refused, Orbital, Example, Enter Shikari, Architects, Crystal Castles, Flogging Molly, The Subways, Two Door Cinema Club, August Burns Red, I Killed The Prom Queen, The Kooks, H2O, Selah Sue, The Asteroids Galaxy Tour, The Computers, The Octopussys, Molotov Jukebox, Anna Calvi, Scarred By Beauty, 3 Feet Smaller, The Inspector Cluzo, The Feud, Keko Yoma, Irie Révoltés, Grimus and others."]}, {"page": "Jezebel (Frankie Laine song)", "response": ["*In 2011, English singer-songwriter Anna Calvi recorded a cover which blends both Laine's English and Piaf's French iterations, released as a single."]}, {"page": "Reading and Leeds Festivals line-ups", "response": ["*Anna Calvi"]}, {"page": "Meltdown (festival)", "response": ["| A Tribute to Tony Wilson, Current 93, Alan Price Set, Ben Waters: Boogie 4 Stu, Geno Washington and the Ram Jam Band, John Cooper Clarke, John Otway and Wild Willy Barrett, London Sinfonietta, Lydia Lunch, Madness, Michael Eavis: A Glastonbury Life, Nick Lowe and special guests, Anna Calvi, Peter Asher: A Musical Memoir of the Sixties and Beyond, Ray Davies, Roger McGough and special guests, Ron Sexsmith, Terry Jones and Michael Palin In Conversation, The Crazy World of Arthur Brown and The Legendary Pink Dots, The Fugs, The Sonics and Wire, Yo La Tengo", "| Bianca Casady & The C.I.A., Estrella Morente, Benjamin Clementine, Sinkane, Sunn O))), Psapp, screening of There Will Be Blood with live performance of Johnny Greenwood's score, Gaby Moreno, Atomic Bomb!, Hypnotic Brass Ensemble, María Rodés, Eliza McCarthy, New York Brass Band, Carmen Consoli, Petra Haden, Anna Calvi, John Luther Adams, Matthew Herbert, Lonnie Holley & Alexis Taylor, François & The Atlas Mountains, Young Jean Lee, Young Marble Giants, Gob Squad, London Sacred Harp Singers, Monsalve y Los Forajidos, screening of Planet of the Apes with live orchestral performance"]}, {"page": "The Joe Strummer Foundation", "response": ["The foundation has given support to hundreds of musicians including some, like Bastille and Anna Calvi, that have gone on to find wide audiences. The first national tour by Strummerville bands – the \"Westway Round the UK Tour\" – was begun in Autumn 2010 with the headline artist Beans on Toast."]}, {"page": "Nick Launay", "response": ["Nicolas Launay is an English record producer, composer and recording engineer. He is one of the most sought after record producers in the world due to his success with recent albums by Nick Cave and the Bad Seeds, Anna Calvi, IDLES, Yeah Yeah Yeahs and Arcade Fire. Noted for his flamboyant style he is among the most successful producers of the post-punk era, helming records from pivotal acts including Public Image Ltd, Gang of Four, Killing Joke, The Birthday Party, and The Slits.", "Launay is known primarily for his passionate approach to recording with emphasis on raw sounds and capturing mood. Other artists he has worked with include: Kate Bush, Talking Heads, David Byrne, INXS, Models, Midnight Oil, Grinderman, Lou Reed, The Veils, Anna Calvi, Supergrass, The Living End, Band of Skulls, Silverchair and IDLES. He lives in Hollywood, United States and travels to London frequently. More recent work includes producing Yeah Yeah Yeahs' Mosquito, It's Blitz!, mixing Arcade Fire's Neon Bible and The Suburbs, and producing and recording Nick Cave and the Bad Seeds' Push the Sky Away, Skeleton Tree along with Grinderman and Grinderman 2.", "* 2018: Hunter by Anna Calvi"]}, {"page": "Sound and Vision", "response": ["Artists who have covered \"Sound and Vision\" include Scottish rock band Franz Ferdinand, American indie rock band the Sea and Cake, English singer-songwriter Anna Calvi, and American singer-songwriter Beck, whose version included a 157-piece orchestra. Franz Ferdinand's Alex Kapranos recalled that the band were asked to cover a song from 1977 for BBC Radio 1 and chose \"Sound and Vision\" as it was his favourite song from that year, particularly due to the song's unique structure and unpredictability: \"You feel like the song is playing for eternity in some other universe. It's like you caught a snippet of something that will always be playing.\" Bowie's original recording appeared in the 1993 television serial The Buddha of Suburbia, and an excerpt appeared in the Off-Broadway musical Lazarus. According to Pegg, instead of performing the song live in the musical, an excerpt from the original was used in order to \"underscore a particularly dramatic moment\". Hopkin's backing vocal was echoed in the American rock band Doves' 2002 single \"There Goes the Fear\"."]}, {"page": "Stanmer House", "response": ["In 2009, the Willkommen Collective started a music festival at Stanmer House. The first event featured performances from The Leisure Society, Alessi's Ark, Peggy Sue and more in Stanmer House and grounds. The second festival took place on 12 September 2010 and was named Foxtrot. The lineup included Laura Marling, Anna Calvi, Francois & the Atlas Mountains and Sons of Noel and Adrian. The third annual festival took place in September 2011 and featured Herman Düne, Sam Amidon, This Is The Kit and more."]}, {"page": "Eurockéennes", "response": ["* Anna Calvi"]}, {"page": "Lady Grinning Soul", "response": ["* Anna Calvi – Strange Weather (EP) (2014)"]}, {"page": "Glastonbury Festival line-ups", "response": ["* Anna Calvi", "* Anna Calvi"]}, {"page": "Adrian Utley", "response": ["| Anna Calvi"]}, {"page": "Latitude Festival", "response": ["<BR>Anna Calvi", "Latitude 2014 (the ninth edition) took place on 17–20 July. The first acts were revealed on 11 December 2013. The first headliner announced for the festival was going to be Two Door Cinema Club, but after singer Alex Trimble fell ill, Lily Allen headlined the Friday night. On 20 January Damon Albarn was announced as the festival's second headliner via Twitter. The third headliners announced were The Black Keys. Other acts who performed across the festival included Röyksopp, Robyn, Haim, Billy Bragg, Bombay Bicycle Club, Tame Impala, Slowdive, Hall & Oates, First Aid Kit, Booker T. Jones, Anna Calvi, Phosphorescent, Nils Frahm, Goat, Cass McCombs, Willis Earl Beal, Marika Hackman, San Fermin, Son Lux and Josephine Foster.", "<BR>Anna Calvi", "<BR>Anna Calvi"]}, {"page": "List of Arctic Monkeys concert tours", "response": ["Across 10 and 11 June 2011 the band played two 'homecoming' concerts at Don Valley Bowl, Sheffield. Playing to approximately 20,000 people across the two days, the shows took place in a festival style tent to commemorate the release of the band's fourth studio album Suck It And See, which had been released the previous Monday (6 June). On Friday 10 June, the opening slot was occupied by local band  Dead Sons, with London quartet The Vaccines taking the penultimate support slot, and Liverpudlian solo artist and friend of Alex Turner Miles Kane being the main support act. On 11 June local band Mabel Love opened the show, with female singer-songwriter Anna Calvi performing in the second support slot and Miles Kane being the final support act again. It is believed that Alex Turner's father David Turner was in attendance, along with Alex's then-girlfriend Alexa Chung. It was also rumoured that Reverend and the Makers' frontman Jon McClure also made an appearance at the show on Saturday."]}, {"page": "Vieilles Charrues Festival", "response": ["* Thursday, July 16 : Muse / Brodinski / Anna Calvi / Soprano", "Festival des Vieilles Charrues 2015 - Anna Calvi - 011.jpg|Anna Calvi"]}, {"page": "Rock en Seine", "response": ["| - Crocodiles- Lilly Wood & The Prick- The La's- Anna Calvi- Nneka", "| - Sg Lewis- Anna Calvi- Black Star- Charlotte Gainsbourg"]}, {"page": "List of Live Lounge cover versions", "response": ["|Anna Calvi ||\"Naughty Girl\" by Beyoncé ||16 February 2012"]}, {"page": "Osheaga Festival", "response": ["Saturday: Jesuslesfilles, The High Dials, Mother Mother, The Mountain Goats, Suuns, PS I Love You, Anna Calvi, Sam Adams, Fucked Up"]}, {"page": "Green Man Festival", "response": ["Fenne Lily, The War on Drugs, Fleet Foxes, Brian Jonestown Massacre, Lemon Twigs, Teenage Fanclub, Anna Calvi, Dirty Projectors, The Wedding Present", "Neutral Milk Hotel, Mercury Rev, Beirut, The Waterboys, Bill Callahan, Caribou, First Aid Kit, Slint, Nick Mulvey, The War on Drugs, Kurt Vile, Sharon Van Etten, Daughter, Poliça, Real Estate, Mac DeMarco, Panda Bear, Anna Calvi, Georgia Ruth, H. Hawkline, Sen Segur, Memory Clinic", "*Busk On The Usk was a free one-day festival held in Newport, South Wales at various locations along the banks of the River Usk. The event was The Welsh Contemporary Music's contribution to the London 2012 Cultural Olympiad and was co-produced by Fiona Stewart. The event featured a program of live music, discussions and lectures, art installations and local food stalls. The event was organised by Green Man with help from the people of Newport along with contributions from a number of Wales’ most important cultural organisations including Sŵn Festival, the Do Lectures, the Laugharne Weekend, the Bevan Foundation, the Centre for Regeneration Excellence Wales, Riverfront Theatre, University of Wales Newport and Arts Council Wales. The music line-up included Scritti Politti, Anna Calvi, Cate Le Bon and Jon Langford. An estimated 6,000 people attended the event."]}, {"page": "Pohoda (music festival)", "response": ["Most notable acts for 2012: Kasabian, Lou Reed, Kooks, Elbow, Two Door Cinema Club, Orbital, Anna Calvi, Emilíana Torrini, Aloe Blacc, Public Enemy, Yann Tiersen  and Bat for Lashes."]}, {"page": "Live from Abbey Road", "response": ["#Blondie and Anna Calvi", "# Ryan Adams, Anna Calvi, Ben Harper, Amos Lee, Seal, Damien Rice"]}, {"page": "Haldern Pop", "response": ["| 206, Agnes Obel, Alex Winston, Alexi Murdoch, Anna Calvi, Ben Howard, Bodi Bill, Brandt Brauer Frick Ensemble, Codes In The Clouds, Coma, Dan Mangan, Destroyer, Dry The River, Explosions in the sky, Fleet Foxes, Gisbert zu Knyphausen, Golden Kanine, Hauschka, Isbells, James Blake, James Vincent McMorrow, Johnny Flynn, Josh T. Pearson, Julia Marcell, LaBrassBanda, Matthew and the Atlas, Miss Li, Moddi, Moss, My Brightest Diamond, Nils Frahm & Anne Müller, Okkervil River, Other Lives, Retro Stefson, Rival Consoles, Selah Sue, Socalled, SpringerParker, Steve Cradock, Suuns, The Antlers, The Avett Brothers, The Black Atlantic, The Low Anthem, The Wombats, Tim Isfort, Timber Timbre, Toy Horses, Warpaint, Wild Beasts, Wir sind Helden, Yuck"]}, {"page": "European Border Breakers Award", "response": ["| United Kingdom || Anna Calvi || Anna Calvi"]}, {"page": "Paredes de Coura Festival", "response": ["|Stephen Malkmus and the Jicks, Anna Calvi, Digitalism, Patrick Watson, The Temper Trap"]}, {"page": "List of NME concert tours", "response": ["*2011 (Spring): Anna Calvi, Grouplove, Big Deal, The History of Apple Pie"]}, {"page": "Wayne Shanklin", "response": ["Anna Calvi covered \"Jezebel\" which was released on Domino Records on October 11, 2010."]}, {"page": "Mr Hudson and the Library", "response": ["In 2007, Mr Hudson and the Library played a number of high profile support tours, most notably on Amy Winehouse’s Back to Black tour - but have also supported Paolo Nutini, Mika and Groove Armada. They appeared at many UK festivals, including Glastonbury, T in the Park, The Big Chill, V Festival, Godiva Festival, and Bestival. On their own UK tour, they were supported by Cheap Hotel; their singer Anna Calvi went on to acclaimed solo success. In October 2007, Mr Hudson and the Library played at the Millennium Stadium in Cardiff in support of The Police. They also supported Kanye West on his Europe leg of his Glow in the Dark Tour, performing in Dublin, Belfast and other European cities."]}, {"page": "Q Awards", "response": ["* Play Award: Anna Calvi"]}, {"page": "List of gay, lesbian or bisexual people: C", "response": ["| Anna Calvi"]}, {"page": "Hove Festival", "response": ["* Anna Calvi"]}]}}