{"wiki_id": "http://www.wikidata.org/entity/Q26251816", "itemLabel": "David Kasumu", "itemDescription": "English association football player (born 1999)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Kasumu", "wikipedia_page": {"main": "David Ayomide K. Kasumu (born 5 October 1999) is an English professional footballer who plays as a midfielder for League One club Milton Keynes Dons.", "link_mentions": [{"page": "St Paul's Catholic School, Milton Keynes", "response": ["* David Kasumu (Footballer)"]}, {"page": "2018–19 Luton Town F.C. season", "response": ["Steve Rutter, a former coach educator for The Football Association who taught Jones during his coaching courses, was appointed as assistant manager. Luton achieved their first away win of the season after beating Oxford United 2–1. Ricky Holmes gave the home team the lead early in the second half, before Luton equalised through Collins who followed up for the rebound after Cornick's shot had hit the crossbar from Mpanzu's cross. Potts scored the winning goal in the 98th minute with a header from Sheehan's free kick, after he had a goal disallowed earlier in stoppage time. Luton won 3–2 at home to Scunthorpe United, and took the lead in the 10th minute with a Cornick shot from a tight angle, before Scunthorpe equalised seven minutes later through Lee Novak. Lee restored Luton's lead in the 26th minute with a 20-yard left-footed shot and James Justin converted Stacey's low cross on 85 minutes, before Stephen Humphrys scored a consolation goal for Scunthorpe in stoppage time. Luton progressed to the second round of the EFL Trophy as Southern Group H winners after a 3–0 home win over Milton Keynes Dons, in which they took the lead in the 17th minute when Sheehan scored a penalty after David Kasumu tripped Shinnie. LuaLua doubled the lead with a curling shot into the bottom corner on 29 minutes, and Grant finished the scoring 15 minutes into the second half with a close-range header."]}, {"page": "Kasumu, David", "response": ["#redirectDavid Kasumu"]}, {"page": "2019–20 Blackpool F.C. season", "response": ["A second-consecutive defeat occurred on 14 September at home to MK Dons. Russell Martin scored the visitors' first goal on five minutes. A mistake by Curtis Tilt let Jordan Houghton through, who made it 2–0 just after the hour mark. David Kasumu made it 3–0 with fifteen minutes remaining. Blackpool dropped to ninth place in the table.Blackpool 0–2 MK Dons - BBC Sport, 14 September 2019"]}, {"page": "David Ayomide Kasumu", "response": ["#REDIRECT David Kasumu"]}]}}