{"wiki_id": "http://www.wikidata.org/entity/Q26270185", "itemLabel": "Osborne Markham", "itemDescription": "politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Osborne_Markham", "wikipedia_page": {"main": "Osborne Markham (27 May 1769 – 22 October 1827) was a British politician, MP for Calne 1806–1807.\nMarkham was the sixth son of William Markham, Archbishop of York.He was educated at Westminster School and Christ Church, Oxford, matriculating in 1787 aged 18, graduating B.A. 1791, M.A. 1794. He was called to the bar at Lincoln's Inn in 1794.Markham's father, Archbishop Markham, appointed him Chancellor of the Diocese of York soon after he qualified, in 1795. Although he subsequently gave up the legal profession, he retained the chancellorship, as a sinecure, until 1818.Through his brother Admiral John Markham's connections at the Admiralty, First Lord of the Admiralty Lord St Vincent appointed Markham as a commissioner on the Navy Board in August 1803. Markham was an ally of Lord St Vincent and the Admiralty, which were then in conflict with the Navy Board. In March 1804, he refused to sign a Navy Board letter to the Admiralty opposing the classing or shoaling of shipwrights. The Navy Board cited collective responsibility to deny a lack of consensus. Lord St Vincent stated in the House of Lords that Markham was the only member of the Navy Board who did his duty to the public or was competent to hold his office. On the resignation of Prime Minister Henry Addington's government in May 1804, both his brother Admiral Markham and Lord St Vincent resigned from the Admiralty, but Osborne Markham continued at the Navy Board until a quarrel with Sir Andrew Hamond, Comptroller of the Navy, the following year.In a by-election on 17 February 1806, Markham was elected MP for Calne in place of Lord Henry Petty. In his only known parliamentary speech, on 14 May 1806, he defended Lord St Vincent's record at the Admiralty. He opposed the abolition of the slave trade.In March 1807, Markram vacated his seat, having been recommended by Prime Minister Lord Grenville as a commissioner for the department of Barrack Master General. The fall of Grenville's ministry delayed confirmation of the appointment, but was ratified in April 1807. He became comptroller of the department in December 1816.He died on 22 October 1827.", "link_mentions": [{"page": "William Markham (bishop)", "response": ["*Osborne Markham (1769–1827), MP for Calne"]}, {"page": "Calne (UK Parliament constituency)", "response": ["| Osborne Markham"]}, {"page": "List of United Kingdom by-elections (1801–1806)", "response": ["| 17 February 1806 || Calne || u* || Lord Henry Petty || Osborne Markham || appointed"]}, {"page": "List of United Kingdom by-elections (1806–1818)", "response": ["|2 April 1807\t||Calne||u*||\tOsborne Markham ||Henry Smith|| Resignation (Commissioner of Barrack Master General)"]}, {"page": "List of ministerial by-elections to the Parliament of the United Kingdom", "response": ["| 17 February 1806 || Calne || u|| Lord Henry Petty || Osborne Markham || Chancellor of the ExchequerPetty sought re-election at Cambridge University "]}, {"page": "List of MPs elected in the 1806 United Kingdom general election", "response": ["| Osborne Markham"]}, {"page": "List of MPs elected in the 1802 United Kingdom general election", "response": ["| Lord Henry Petty – resigned Replaced by Osborne Markham 1806"]}]}}