{"wiki_id": "http://www.wikidata.org/entity/Q262108", "itemLabel": "Rob Wilson", "itemDescription": "British politician (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Rob_Wilson", "wikipedia_page": {"main": "Robert Owen Biggs Wilson (born 4 January 1965) is an English politician and political author. He was elected Conservative Member of Parliament for the Reading East parliamentary constituency in the 2005 general election, being re-elected in the elections of 2010 and 2015, before being defeated in 2017. He became Minister for Civil Society in the Cabinet Office on 27 September 2014.", "link_mentions": [{"page": "Reading, Berkshire", "response": ["Reading's municipal boundaries do not include all of the surrounding suburbs. Some of these areas (Tilehurst, Calcot, Earley, Winnersh and Woodley) are, at least partly, within West Berkshire or Wokingham Borough. This unusual configuration creates difficulties. The diminishing amount of land available and suitable for development within the borough's boundary can bring the council into conflict with its neighbours' development plans; this is exacerbated by the fact that the wards within the borough boundaries have tended to elect Labour councillors, while the suburban wards outside the borough have tended to vote Conservative. This particularly affects education (many schools have catchment areas that cross administrative boundaries), and transport. A perennial example is whether to construct a third road crossing of the Thames, which South Oxfordshire's politicians and residents oppose. On this subject, Rob Wilson, then MP for Reading East, said in a House of Commons debate in January 2006:"]}, {"page": "Robert Wilson", "response": ["* Rob Wilson, known as Fresh I.E., Canadian rapper", "* Rob Wilson (born 1965), British politician and entrepreneur, MP for Reading East", "* Rob Wilson (racing driver) (born 1952), racing driver from New Zealand", "* Rob Wilson (ice hockey) (born 1968), Canadian-British professional ice hockey coach"]}, {"page": "Caversham, Reading", "response": ["There is a shortage of primary school places in the west of Caversham, but a 2006 proposal to use part of Mapledurham playing fields to build a replacement for Caversham Primary School did not receive public support. A new Heights Primary School http://theheightsprimary.co.uk took its first pupils in September 2014 in temporary accommodation, and has not yet found a permanent site. The Education Funding Authority (EFA) acquired a site (previously residential) in Upper Warren Avenue during 2014, but there was criticism of the choice from local residents. After representations from affected constituents, the local MP, Rob Wilson, intervened. Following discussions with the EFA, Reading Borough Council was commissioned to work with local stakeholders on alternative sites. Five possibilities were proposed – two parks, a wildlife site, a residential site and a field in adjoining Oxfordshire. The subsequent consultation showed a clear preference for occupying a small part of Mapledurham playing fields (5%).http://beta.reading.gov.uk/media/3300/The-Heights-consultation---Statistical-Result-Summary-with-navigation/pdf/Heights_consultation_-_Statistical_Result_Summary_with_navigation.pdf The consultation is not binding, and there remain some legal difficulties. It is in trust for recreation purposes and was gifted by the late Mr Hewett to residents of Mapledurham and Reading. Yet there would also be significant benefits for the community; the children of the area would have a school within walking distance, the recreation land would be used by the community more and the centre of Caversham's traffic would be reduced."]}, {"page": "List of documentary films", "response": ["|Oliver Stone's Untold History of the United States †||2012||Oliver Stone||Oliver Stone, Tara Tremaine, and Rob Wilson"]}, {"page": "David Crausby", "response": ["Thurnham retired at the 1997 general election, having crossed the floor to join the Liberal Democrats on 12 October 1996. Crausby defeated the new Conservative candidate, Rob Wilson, by 12,669 votes. He made his maiden speech on 17 July 1997, in which he remembered the inventor of the spinning mule Samuel Crompton who was born in Bolton."]}, {"page": "Jane Griffiths (politician)", "response": ["At the 2001 general election, Griffiths increased her majority from 3,795 to 5,588. However, her disputes with her local party became much more public thereafter. In early 2002, she wrote in The Sunday Times about rampant sexism within the Parliamentary Labour Party.  Subsequently, she alleged she was experiencing bullying by local Labour Party activists in Reading. This was denied by the local Party Chair. The ensuing tensions culminated in Griffiths' deselection as the candidate for the 2005 general election, a first for any MP in ten years.  'Personality issues' were cited, whilst Griffiths contended she was the victim of a conspiracy by '1970s men': her assertion was criticized as 'wild conspiracy theories' in an open letter by seventeen female members of the party. She vowed not to stand as an independent, and the seat fell to a very narrow Labour defeat, with Griffiths being succeeded by Conservative Rob Wilson in 2005. In between her deselection and the end of her term, she fought off suggestions she would defect to the Conservatives."]}, {"page": "Lancing College", "response": ["* Rob Wilson, Minister for Civil Society (Cabinet Office) (2014–2017)"]}, {"page": "Reading East (UK Parliament constituency)", "response": ["The Reading East parliamentary constituency was first contested in 1983, when it was won by a partial incumbent, Gerry Vaughan, a Conservative who was before that election sitting MP for abolished Reading South. He held the seat through two general elections until he retired before the 1997 election.  The constituency was in 1997 won by the Labour Party's Jane Griffiths, thus a backbencher under the Blair Ministry. She retained the seat in the 2001 election but was deselected by her Constituency Labour Party before the 2005 election, when the seat was won by the Tory candidate, Rob Wilson, who held the seat through two elections.  The seat was regained by the Labour Party's candidate in 2017, Matt Rodda, achieving the party's best showing since the seat's creation.  The 2017 result came when there was a hung parliament nationally.  Until 2005 the seat had been a national bellwether. ", "| Rob Wilson"]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Reading East || Rob Wilson || Conservative || Jane Griffiths || Labour"]}, {"page": "Palmer Park, Reading", "response": ["The park also contains Palmer Park Stadium, a velodrome and athletics stadium.Palmer Park Stadium , Reading Borough Council, UK. Included in the park are Palmer Park Library,Palmer Park Library, Reading Borough Libraries, UK. Palmer Park Bowling Club,Palmer Park Bowling Club, BowlsClub.org. two playgrounds,Palmer Park Reading Playgrounds Reopen after £146,000 Facelift , Reading, Berkshire, UK, 26 March 2010. a community cafeChalkboard Cafe impresses Reading MP Rob Wilson. and a number of football pitches which are used every week for local matches. During the summer months, some of the goal posts are removed to make way for a cricket pitch."]}, {"page": "Eye of the Storm", "response": ["* The Eye of the Storm: The View from the Centre of the Political Scandal, a 2014 book by Rob Wilson"]}, {"page": "List of people from Reading, Berkshire", "response": ["* Rob Wilson (b. 1965; former Member of Parliament for Reading East)"]}, {"page": "1965 in the United Kingdom", "response": ["**Rob Wilson, politician"]}, {"page": "Wallingford School", "response": ["*Rob Wilson, politician and Member of Parliament for Reading East (2005–2017)"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Rob Wilson; MP for Reading East (2005–2017)"]}, {"page": "Caversham Primary School", "response": ["Reading East MP Rob Wilson met the school council in October 2009."]}, {"page": "Education Select Committee", "response": ["| Rob Wilson"]}, {"page": "Innovation, Universities, Science and Skills Select Committee", "response": ["| Rob Wilson MP"]}, {"page": "List of people with surname Wilson", "response": ["**Rob Wilson (racing driver) (born 1952), racing driver and driver coach", "**Rob Wilson (born 1965), British politician and entrepreneur, MP for Reading East", "** Rob Wilson (born 1973) known as Fresh I.E., Canadian rap artist"]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| Reading East||style=\"background-color: \"| ||Conservative||style=\"background-color: \"| ||Rob Wilson (C)||Seat held"]}, {"page": "Cameron–Clegg coalition", "response": ["| Rob Wilson MP"]}]}}