{"wiki_id": "http://www.wikidata.org/entity/Q26251182", "itemLabel": "David L. Kennedy", "itemDescription": "British archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/David_L._Kennedy", "wikipedia_page": {"main": "David Leslie Kennedy (born 25 April 1948) is an archaeologist and historian of the Roman Near East, with a focus on Aerial Archaeology, Roman landscape studies and the Roman military. He is Emeritus Professor and Senior Honorary Research Fellow in Roman Archaeology and History at the University of Western Australia.\n\n", "link_mentions": [{"page": "Septimius Severus", "response": ["Though his military expenditure was costly to the empire, Severus was a strong and able ruler. The Roman Empire reached its greatest extent under his reignover  million square kilometres.David L. Kennedy, Derrick Riley (2012), Rome's Desert Frontiers, page 13 , RoutledgeR.J. van der Spek, Lukas De Blois (2008), An Introduction to the Ancient World, page 272 , Routledge"]}, {"page": "List of archaeologists", "response": ["*David L. Kennedy (born 1948) British and Australian; Roman Near East"]}, {"page": "Limes (Roman Empire)", "response": ["Following his African conquests, the Roman Empire may have reached its greatest extent during the reign of Septimius Severus,David L. Kennedy, Derrick Riley (2012), Rome's Desert Frontiers, page 13, RoutledgeR.J. van der Spek, Lukas De Blois (2008), An Introduction to the Ancient World, page 272, Routledge under whom the empire encompassed an area of 2 million square miles ( million square kilometers)."]}, {"page": "David Kennedy", "response": ["*David L. Kennedy (born 1948), Scottish Roman archaeologist and historian at the University of Western Australia and the University of Oxford"]}, {"page": "Borders of the Roman Empire", "response": ["Following his African conquests, the Roman Empire may have reached its greatest extent during the reign of Septimius Severus,David L. Kennedy, Derrick Riley (2012), Rome's Desert Frontiers, page 13, RoutledgeR.J. van der Spek, Lukas De Blois (2008), An Introduction to the Ancient World, page 272, Routledge under whom the empire encompassed an area of ."]}, {"page": "Harrat Khaybar", "response": ["Al-Saeed and his team later collaborated with British archaeologist David L. Kennedy, who had used aerial archaeology to study similar structures in Jordan, but was not allowed to cross the border into Saudi Arabia. According to Kennedy, the structures in the Harrat Khaybar were created between 2,000 and 9,000 years earlier. As of 2017, the team of researchers had reportedly discovered over 900 kites in Harrat Khaybar."]}, {"page": "David L. Kennedy (archaeologist)", "response": ["#REDIRECT David L. Kennedy"]}]}}