{"wiki_id": "http://www.wikidata.org/entity/Q262068", "itemLabel": "Fatima Whitbread", "itemDescription": "British athlete; former javelin thrower", "wikipedia_url": "https://en.wikipedia.org/wiki/Fatima_Whitbread", "wikipedia_page": {"main": "Fatima Whitbread MBE (born Vedad; 3 March 1961) is a retired British javelin thrower. She won the 1986 European Championships in Stuttgart, having broken the world record with a throw of 77.44 metres in the qualifying round the previous day. She went on to win the 1987 World Championships in Rome. She is also a two-time Olympic medallist, winning bronze at the 1984 Los Angeles Olympics and silver at the 1988 Seoul Olympics. Her former world record throw makes her one of only two women in history to have thrown the javelin (old model) over 75 metres.\n\n", "link_mentions": [{"page": "March 3", "response": ["*  1961   – Fatima Whitbread, English javelin thrower"]}, {"page": "Fatima (given name)", "response": ["*Fatima Whitbread, British former javelin thrower and multiple medal-winner"]}, {"page": "The Krypton Factor", "response": ["In March 1988, an International special was broadcast in the UK, Australia and New Zealand as part of Australia's bi-centennial celebrations. Made in the UK and presented by Gordon Burns, the episode featured Marian Chanter and Alison Heath, winner and runner-up respectively of the UK Krypton Factor Grand Final 1987 and John Cargill and Christopher Connolly, winner and runner-up respectively of the Australia & New Zealand Krypton Factor 1987 final. The International title was won by Alison Heath, and the trophy was presented by Fatima Whitbread."]}, {"page": "Through the Keyhole", "response": ["| 12 || Willie RushtonEve PollardAlan Coren || Lord Montagu of BeaulieuFatima Whitbread || 15 July 1988", "| 8 || Rob BeckettJanet Street-PorterKrishnan Guru-Murthy || Shane LynchFatima WhitbreadScott Mills || 23 February 2019 ||"]}, {"page": "Grays, Essex", "response": ["*Fatima Whitbread"]}, {"page": "List of Turkish people", "response": ["*Fatima Whitbread"]}]}}