{"wiki_id": "http://www.wikidata.org/entity/Q26258226", "itemLabel": "George Dobson", "itemDescription": "English association football player, born 1997", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Dobson_(footballer,_born_1997)", "wikipedia_page": {"main": "George David Dobson (born 15 November 1997) is an English footballer who plays as a midfielder for Charlton Athletic. He is a versatile player who can play as a defensive midfielder or as a centre-back, having mainly played as the latter as a youth player.", "link_mentions": [{"page": "West Ham United F.C. Under-23s and Academy", "response": ["*George Dobson"]}, {"page": "Darrell Clarke", "response": ["On 10 May 2019, Clarke signing a three-year contract to become Walsall's new manager following their relegation into League Two at the end of the 2018–19 season. He signed 16 players as 23 departed – including midfielder George Dobson, who was sold on to Sunderland – and got off to a poor start after Walsall picked up just one win the opening ten games of the 2019–20 campaign, with the team sound defensively but failing to create any chances in a 5–3–2 formation. Form improved as Clarke switched to a 4–4–2 formation and got the best out of 22-year old Wes McDonald, however a run of six league defeats began in October and drew the club into a relegation battle, though was immediately followed by a run of only two defeats in 11 league games. Walsall were in mid-table when the season was ended early due to the COVID-19 pandemic in England and Walsall Supporters’ Trust secretary Steve Davies said that the team were \"starting to gel and the signing of Wes McDonald was key\". Clarke went on to admit that the following campaign would likely see him focus more on youth as the club faced a challenging financial future due to the effects of the pandemic. He left the Bescot Stadium midway through the 2020–21 with Walsall 11th in the table after Port Vale agreed to pay Walsall a compensation package."]}, {"page": "List of foreign football players in the Netherlands", "response": ["*George Dobson – Sparta Rotterdam – 2017–18"]}, {"page": "Florent Cuvelier", "response": ["In June 2016, Cuvelier returned to Walsall, signing a one-year contract. He struggled with an ankle knock and ear infection in the first half of the 2016–17 season, before going on to struggle with a calf injury. Despite these setbacks he signed a new one-year contract in March 2017, with manager Jon Whitney saying \"he's the type of person you can build your team around.\" He was restricted to 23 appearances across the 2017–18 season due to the form of George Dobson. Speaking in April he stated that the appointment of new manager Dean Keates had the players \"buzzing\" as Cuvelier also made a return to the starting eleven at the Bescot Stadium under the new manager. However he was released by Walsall at the end of the 2017–18 season."]}, {"page": "George Dobson (footballer, born 1862)", "response": ["George Dobson was an English footballer who played for Bolton Wanderers and then before and at the start of the Football League for Everton. He was one of the club's first professional players.", "George Dobson was signed by his local club, Bolton Wanderers in 1884. In the March of following year, 1885, he moved to Everton. He played 130 matches before the Football League started in September 1888. He was described as well built, strong and a clean kicker. He made right-back his own position in the 1888–1889 season until injury finished his career in 1889.", "George Dobson made his League debut on 8 September 1888, as a wing-half, at Anfield, the then home of Everton. The home team defeated the visitors, Accrington 2–1. George Dobson appeared in 18 of the 22 League matches played by Everton in season 1888–89. As a full-back he played in an Everton defence that achieved one clean-sheet and restricted the opposition to one–League–goal–in–a–match on four occasions. (registration & fee required)", "George Dobson was not retained as he had an injury that prevented him from continuing as a footballer. He died in Wallasey, Cheshire on 16 October 1941, aged 79."]}, {"page": "George Dobson", "response": ["George Dobson may refer to:", "* George Dobson (rugby union) (1873–1917), Welsh rugby union forward", "* George Dobson (rugby league), English rugby league footballer of the 1900s, 1910s and 1920s ", "* George Dobson (footballer, born 1862) (1862–1941), English football player (Everton)", "* George Dobson (footballer, born 1901) (1897–1950), English footballer (Barnsley, Norwich City and Rotherham County)", "* George Dobson (footballer, born 1949) (1949–2007), English football player (Brentford)", "* George Dobson (footballer, born 1997), English football player (Sunderland)"]}, {"page": "2015–16 West Ham United F.C. season", "response": ["| 27 July 2015 || CB ||  || George Dobson || Arsenal || Undisclosed ||"]}, {"page": "2016–17 West Ham United F.C. season", "response": ["| 1 July 2016 || CB ||  || George Dobson || Walsall || End of Season || "]}, {"page": "2016–17 Walsall F.C. season", "response": ["| 1 July 2016 || CB ||  || George Dobson || West Ham United || End of season || "]}, {"page": "George Dobson (footballer born 1997)", "response": ["#REDIRECT George Dobson (footballer, born 1997)"]}]}}