{"wiki_id": "http://www.wikidata.org/entity/Q262827", "itemLabel": "Thomas Lewis", "itemDescription": "British cardiologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Lewis_(cardiologist)", "wikipedia_page": {"main": "Sir Thomas Lewis, CBE, FRS, FRCP (26 December 1881 – 17 March 1945) was a British cardiologist (although he personally disliked the term, preferring cardiovascular disease specialist). He coined the term \"clinical science\".\n\n", "link_mentions": [{"page": "Myocarditis", "response": ["Cases of myocarditis have been documented as early as the 1600s,P. Schölmerich. (1983.) \"Myocarditis — Cardiomyopathy Historic Survey and Definition\", International Boehringer Mannheim Symposia, 1:5. but the term \"myocarditis\", implying an inflammatory process of the myocardium, was introduced by German physician Joseph Friedrich Sobernheim in 1837.Joseph Friedrich Sobernheim. (1837.) Praktische Diagnostik der inneren Krankheiten mit vorzueglicher Ruecksicht auf pathologische Anatomic. Hirschwald, Berlin, 117. However, the term has been confused with other cardiovascular conditions, such as hypertension and ischemic heart disease. Following admonition regarding the indiscriminate use of myocarditis as a diagnosis from authorities such as British cardiologist Sir Thomas Lewis and American cardiologist and a co-founder of the American Heart Association Paul White, myocarditis was under-diagnosed."]}, {"page": "University College Hospital", "response": ["* Sir Thomas Lewis, cardiologist at the hospital"]}, {"page": "Atrial flutter", "response": ["Atrial flutter was first identified as an independent medical condition in 1920 by the British physician Sir Thomas Lewis (1881–1945) and colleagues. AFL is the second most common pathologic supraventricular tachycardia but occurs at a rate less than one-tenth of the most common supraventricular tachycardia (atrial fibrillation). The overall incidence of AFL has been estimated at 88 cases per 100,000 person-years. The incidence of AFL is significantly lower (~5 cases/100,000 person-years) in those younger than age 50 and is far more common (587 cases/100,000 person-years) in those over 80 years of age."]}, {"page": "Erythromelalgia", "response": ["| Erythralgia || Thomas Lewis in 1933"]}]}}