{"wiki_id": "http://www.wikidata.org/entity/Q26214698", "itemLabel": "TroyBoi", "itemDescription": "British DJ, record producer and musician", "wikipedia_url": "https://en.wikipedia.org/wiki/TroyBoi", "wikipedia_page": {"main": "Troy Henry (born 23 November 1987), known professionally as TroyBoi, is a British DJ, record producer, and musician.\nHis music combines elements of trap, house, bass, future bass, vogue, and dubstep. His debut album Left is Right was released in 2017, followed by the extended plays, V!bez, Vol. 2 (2018) and V!bez, Vol. 4 (2021).", "link_mentions": [{"page": "Troyboi", "response": ["#REDIRECT TroyBoi"]}, {"page": "Tom Norris (record producer)", "response": ["|Marshmello, TroyBoi", "|MC Lan, Skrillex, TroyBoi, Ludmilla, Ty Dolla $ign"]}, {"page": "Warlordz", "response": ["\"Warlordz\" (stylised in all caps) is a song by British electronic music producer TroyBoi featuring American record producer Skrillex, released on 21 June 2019 through Owsla.", "On 16 June, the song was previewed during a live-set by TroyBoi and Skrillex at Paradiso Festival, with the song later being announced as \"Warlordz\". It was further announced that the song was to be released the week after.", "On 21 June, the song was released as a digital download on international digital stores through American record label Owsla, as well as being released through various music streaming services. The song's artwork was created by Spanish painter Sanjulián and was adapted by Marilyn Hue and Jade Fenix Hobday to depict TroyBoi and Skrillex fighting a horde of gorillas.", "\"Warlordz\" was well received by most critics. Bella Bagshaw of Dancing Astronaut called the song \"boisterous\", and that it was \"intuitively named for its audacious architects\", finalising her review by stating that the track \"exudes the complexity and dexterity of its creators, oscillating between throaty Asian vocals and tender piano-driven interludes.\" Your EDM's Matthew Meadow noted that even though Skrillex only gets credited as a featured artist, it does not make his contributions to the song \"any less bombastic\" and that the style of both artists being \"clearly presented in this 3-minute tribal bass journey\", with TroyBoi's style of trap and bass music feeling \"right at home\" alongside Skrillex's heavy wobbles and punchy synths. Writing for T.H.E – Music Essentials, Pavan Kumar praised the song, mainly focusing on Skrillex's contributions to the song, calling such \"raw, subtle and yet, ever-engaging\" and his quality of work would make you go \"absolutely berserk.\"", "Category:TroyBoi songs", "Category:Song recordings produced by TroyBoi", "Category:Songs written by TroyBoi"]}, {"page": "Justice (Justin Bieber album)", "response": ["Justice is the sixth studio album by Canadian singer Justin Bieber. It was released on March 19, 2021, by Def Jam Recordings. The album features guest appearances from Khalid, Chance the Rapper, the Kid Laroi, Dominic Fike, Daniel Caesar, Giveon, Beam, Burna Boy, and Benny Blanco. The \"Triple Chucks\" deluxe edition of the album was released on March 26, 2021, exactly a week after the standard version. It features additional guest appearances from Lil Uzi Vert, Jaden, Quavo, DaBaby, and Tori Kelly. The complete edition was released on October 8, 2021, and includes the tracks on store versions of the album that did not make the regular album. It features additional guest appearances from TroyBoi and Poo Bear. The album serves as the follow-up to Bieber's previous album, Changes (2020). The album includes production from Benny Blanco, Virtual Riot, Andrew Watt, Skrillex, Finneas, Jon Bellion, the Monsters & Strangerz, and numerous others."]}, {"page": "Troy Henry", "response": ["#REDIRECT TroyBoi"]}, {"page": "Street Dance Girls Fighter", "response": ["|Rosalía & Travis Scott + Justin Beiber (Feat. TroyBoi)"]}]}}