{"wiki_id": "http://www.wikidata.org/entity/Q2621135", "itemLabel": "Natalie Cassidy", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Natalie_Cassidy", "wikipedia_page": {"main": "Natalie Ann Cassidy (born 13 May 1983) is an English actress. She has played Sonia Fowler in EastEnders since 1993, appeared in the BBC Two sitcom-horror Psychoville and was a contestant on the seventh series of Strictly Come Dancing and the ninth series of Celebrity Big Brother.", "link_mentions": [{"page": "EastEnders", "response": ["EastEnders has been praised for its portrayal of characters with disabilities, including Adam Best (David Proud) (spina bifida), Noah Chambers (Micah Thomas) (deaf), Jean Slater (Gillian Wright) and her daughter Stacey (Lacey Turner) (bipolar disorder), Janet Mitchell (Grace) (Down syndrome), Jim Branning (John Bardon) (stroke) and Dinah Wilson (Anjela Lauren Smith) (multiple sclerosis). The show also features a large number of gay, lesbian and bisexual characters (see list of soap operas with LGBT characters), including Colin Russell (Michael Cashman), Barry Clark (Gary Hailes), Simon Raymond (Andrew Lynford), Tony Hills (Mark Homer), Sonia Fowler (Natalie Cassidy), Naomi Julien (Petra Letang), Tina Carter (Luisa Bradshaw-White), Tosh Mackintosh (Rebecca Scroggs), Ben Mitchell (Harry Reid/Max Bowden), Paul Coker (Jonny Labey), Iqra Ahmed (Priya Davdra), Ash Kaur (Gurlaine Kaur Garcha), and Callum \"Halfway\" Highway (Tony Clay). Kyle Slater (Riley Carter Millington), a transgender character, was introduced in 2015.", "In the early 2000s, EastEnders covered the issue of euthanasia  with Ethel Skinner's (Gretchen Franklin) death in a pact with her friend Dot Cotton (June Brown), the unveiling of Kat Slater's (Jessie Wallace) sexual abuse by her uncle Harry (Michael Elphick) as a child (which led to the birth of her daughter Zoe (Michelle Ryan), who had been brought up to believe that Kat was her sister), the domestic abuse of Little Mo Morgan (Kacey Ainsworth) by husband Trevor (Alex Ferns) (which involved marital rape and culminated in Trevor's death after he tried to kill Little Mo in a fire), Sonia Jackson (Natalie Cassidy) giving birth at the age of 15 and then putting her baby up for adoption, and Janine Butcher's (Charlie Brooks) prostitution, agoraphobia and drug addiction. The soap also tackled the issue of mental illness and carers of people who have mental conditions, illustrated with mother and daughter Jean (Gillian Wright) and Stacey Slater (Lacey Turner); Jean suffers from bipolar disorder, and teenage daughter Stacey was her carer (this storyline won a Mental Health Media Award in September 2006\"Mental Health Media Awards 2006\" BBC. Retrieved 28 February 2008.). Stacey went on to struggle with the disorder herself. The issue of illiteracy was highlighted by the characters of middle-aged Keith (David Spinx) and his young son Darren (Charlie G. Hawkins). EastEnders has also covered the issue of Down syndrome, as Billy (Perry Fenwick) and Honey Mitchell's (Emma Barton) baby, Janet Mitchell (Grace), was born with the condition in 2006. EastEnders covered child abuse with its storyline involving Phil Mitchell's (Steve McFadden) 11-year-old son Ben (Charlie Jones) and lawyer girlfriend Stella Crawford (Sophie Thompson), and child grooming involving the characters Tony King (Chris Coghill) as the perpetrator and Whitney Dean (Shona McGarty) as the victim.", "According to the book How to Study Television, in 1995 EastEnders cost the BBC £40,000 per episode on average. A 2012 agreement between the BBC, the Writers' Guild of Great Britain and the Personal Managers' Association set out the pay rate for EastEnders scripts as £137.70 per minute of transmission time (£4,131 for 30 minutes), which is 85 per cent of the rate for scripts for other BBC television series. The writers would be paid 75 per cent of that fee for any repeats of the episode. In 2011, it was reported that actors receive a per-episode fee of between £400 and £1,200, and are guaranteed a certain number of episodes per year, perhaps as few as 30 or as many as 100, therefore annual salaries could range from £12,000 to £200,000 depending on the popularity of a character. Some actors' salaries were leaked in 2006, revealing that Natalie Cassidy (Sonia Fowler) was paid £150,000, Cliff Parisi (Minty Peterson) received £220,000, Barbara Windsor (Peggy Mitchell) and Steve McFadden (Phil Mitchell) each received £360,000 and Wendy Richard (Pauline Fowler) had a salary of £370,000. In 2017, it was revealed that Danny Dyer (Mick Carter) and Adam Woodyatt (Ian Beale) were the highest-paid actors in EastEnders, earning between £200,000 and £249,999, followed by Laurie Brett (Jane Beale), Letitia Dean (Sharon Watts), Tameka Empson (Kim Fox), Linda Henry (Shirley Carter), Scott Maslen (Jack Branning), Diane Parish (Denise Fox), Gillian Taylforth (Kathy Beale) and Lacey Turner (Stacey Slater), earning between £150,000 and £199,999."]}, {"page": "May 13", "response": ["*1983 – Natalie Cassidy, English actress and singer"]}, {"page": "Walk This Way", "response": ["The music video premiered on The Box on February 2, 2007, and was shown on Channel 4's Popworld the following day. The video was filmed over three days in January 2007 – Sugababes on the first, Cheryl Cole, Nicola Roberts, and Kimberley Walsh on the second, and Nadine Coyle and Sarah Harding on the third and final day. The video includes cameos from Davina McCall, Lily Cole, Stephen Mangan, Graham Norton, Ruby Wax and Natalie Cassidy."]}, {"page": "Wendy Richard", "response": ["In 1996, Richard was diagnosed with breast cancer. She had an operation and was given the all-clear, but experienced a recurrence of the disease in 2002.BBC News – EastEnders star has cancer. Retrieved 5 October 2008 Her cancer went into remission after years of treatment and she was given a clean bill of health in 2005. Articles about her departure from EastEnders suggested that her health problems did not play any role in her decision, but was because her character in the soap remarried, to Richard's displeasure. Richard later said she left because of stress and that she had been stress-free since leaving the show. She kept in touch afterwards with co-stars Bill Treacher, Natalie Cassidy, Todd Carty, and James Alexandrou. "]}, {"page": "Claire Sweeney", "response": ["Twelve years after starring in Celebrity Big Brother, Sweeney appeared again in a Comic Relief fundraising show, this time alongside Natalie Cassidy, Dean Gaffney and Ricky Groves on Let's Dance for Comic Relief in February 2013. They performed to \"You Can't Stop the Beat\" from Hairspray. In their heat, the group placed second after beating Ricky Hatton in the judges' vote by a score of 2 to 1. The group then took part in the Grand Final 9 March 2013, losing to winning finalist Antony Cotton."]}, {"page": "Strictly Come Dancing", "response": ["| Natalie Cassidy", "|Natalie Cassidy", "| Natalie Cassidy & Vincent Simone"]}, {"page": "The Paul O'Grady Show", "response": ["On Friday 18 December 2009, O'Grady presented his final show with an array of special guests; including Beverley Callard and William Roache, Honor Blackman, Natalie Cassidy, JLS, Scott Maslen, Joe McFadden, Linda Thorson, Melanie Sykes, Catherine Tate (appearing as Joannie \"Nan\" Taylor), Kate Thornton and The Teletubbies. Plus, other celebrities including Kim Cattrall, Whoopi Goldberg, Jonas Brothers, Alan Menken and Enrique Iglesias."]}, {"page": "James Alexandrou", "response": ["In July 2003 he participated in a \"Soap Stars Special\" edition of The Weakest Link. Over Christmas of 2005, Alexandrou starred in the crime caper, Who Stole The Snowman? On 14 April 2006 it was announced that Alexandrou would leave EastEnders in Autumn 2007. He and Natalie Cassidy, who played his on-screen wife Sonia Fowler, left on 2 February 2007 (to tie in with the exits of Wendy Richard and Ray Brooks). When asked about his departure Alexandrou said, \"I've decided to leave the show to experience other aspects of my industry. Having turned 21, I felt it was a good time to leave. I owe everything to the show and would love to come back one day - that's if EastEnders would have me.\" On 12 October 2014 it was announced that actor James Bye would be taking over playing the role in the character's return to Albert Square.", "In March 2009 he played the part of Romeo in the Globe Theatre's production of Romeo and Juliet. In October 2009, Alexandrou joined up with EastEnders cast members, Natalie Cassidy (Sonia Jackson) and Nina Wadia (Zainab Masood), to star in comedy shorts for BBC Raw Words."]}, {"page": "Anna Scher Theatre", "response": ["The school has trained many actors who went on to star in the soap opera EastEnders, including Martin Kemp, Gillian Taylforth, Patsy Palmer, Sid Owen, Natalie Cassidy, Jake Wood, Susan Tully, Tilly Vosburgh and Brooke Kinsella. Scher also trained Oscar-nominated actor Daniel Kaluuya, and he thanked her in his BAFTA award winning speech."]}, {"page": "Tubridy Tonight", "response": ["*Natalie Cassidy", "| 9 February 2008 || Natalie Cassidy, Louis Walsh, Donal MacIntyre || || Los Campesinos! || \"Death to Los Campesinos!\" || Details "]}, {"page": "Brian Conley", "response": ["On 18 August 2017, it was announced that Conley would be taking part in the fifteenth series of Strictly Come Dancing. He was partnered with Welsh professional dancer Amy Dowden. Conley and Dowden were voted off the show in Week 5 after their Jive to Tom Jones' \"It's Not Unusual\". In February 2021, it was announced that he would be joining the BBC soap opera EastEnders as series regular Terry Cant, the long-lost father of established character Sonia Fowler (Natalie Cassidy)."]}, {"page": "Alfie Moon", "response": ["Mo has Harry's money transferred to her account and tells Alfie. He insists that this is not good for Kat and tells her so she burns the money. Sadly, this makes her very depressed and she tries to commit suicide but Alfie finds her and calls an ambulance. At the hospital, he admits that he is still in love with her. He takes her home and decides to stay temporarily to help her with the kids and her assessment by Social Services. During the social worker's visit, Kat is withdrawn and won't answer questions, insisting she is fine but Alfie tells the social worker that they are working on it and admits feeling guilty for starting the fire. After Kat visits a convent (Zoe's birthplace), she makes peace with the past and tells Alfie and Stacey that she will claim the money. Alfie and Stacey discover that Kat's claim won't grant her any money so he takes Kat on a trip to central London, giving them a chance to reminisce before having lunch at a posh restaurant. Kat knows that she won't get any compensation and is disgusted when Alfie tells her he already knew. Soon after, Kat takes the opportunity to tell Alfie that she wants them to reconcile and although initially resisting, he changes his mind once back in Walford. On the spur of the moment, they buy a scratchcard and realise they have won £1,000,000. Alfie and Kat decide to use the money to move somewhere new and run a bar. Alfie suggests going to Australia but he and Kat decide to return to Spain so she can be closer to Zoe. But after tests, a doctor tells Alfie he may have a brain tumour. Kat buys plane tickets for the next day and Alfie chooses not to tell Kat about the tumour and ignore warnings that the tumour will grow. Sonia Fowler (Natalie Cassidy) also advises him not to fly as this could cause problems so they drive to Spain."]}, {"page": "Dot Cotton", "response": ["Dot trips over Dave and falls awkwardly onto a chair. Nobody knows she is injured until her step-granddaughter, Sonia Fowler (Natalie Cassidy), finds her. Dot is then taken to hospital and Sonia blames her neighbours for not looking out her and scolds Sharon and Ian. Dot is worried when the doctor tells her that she will need an operation on her hip but she refuses physiotherapy. Dot goes to stay with Dotty for three months, returning when she hears that Abi is brainstem dead after an accident. Dot is surprised to see the launderette had reopened and Karen Taylor (Lorraine Stanley) is working there. After attending Abi's funeral, Dot goes to stay with Charlie, Liz and Matthew in Ireland. Dot returns several months later. She is worried about her health and despite being told by her doctor that she is fine, she visits Dr Legg. He confirms that she is in good health and reveals he is dying of pancreatic cancer. Dot is shocked that he is refusing treatment but eventually accepts his decision and decides to make the most of the time they have left together. Dot cares for Dr Legg in her home until his death. She inherits his entire estate and goes away to visit her family.", "The Daily Telegraph's Gerard O'Donovan agreed that \"June Brown, as Dot, was mesmerising\", but was similarly critical of the episode as a whole, concluding: \"Overall [...] the feeling couldn't be avoided that in the greater scheme of things this was a fuss over nothing. Had it been a swan song, it would have been a worthy one. But doubtless Dot will be out and about again tonight, fag in hand, quoting from the Good Book. Enjoyable as this Albert Square indulgence was, I suspect that most fans will be hoping this one-hander remains a one-off.\" Leigh Holmwood for The Guardian suggested that viewers may have agreed with O'Donovan's assessment, highlighting the fact that the episode received only 8.7 million viewers, compared to 9.4 million watching EastEnders the previous week. A 2003 episode centred around Dot also resulted in a notable ratings slump. The New Year episode, which detailed her childhood evacuation to the countryside, received just 8.1 million viewers, compared with 12.2m the previous evening and 16m on Christmas Day. Prior to this, however, a 2002 two-hander episode featuring just Dot and Sonia Jackson (Natalie Cassidy) was watched by 11.5 million viewers, with an almost 60% share of viewers in the timeslot."]}, {"page": "UK national selection for the Eurovision Song Contest", "response": ["| Jonathan Ross, Bruno Tonioli, Paddy O'Connell, Natalie Cassidy"]}, {"page": "United Kingdom in the Eurovision Song Contest 2005", "response": ["A panel of experts provided feedback regarding the songs during the show. The panel consisted of Bruno Tonioli (choreographer, dancer and television personality), Jonathan Ross (television and radio presenter, actor, comedian and producer), Natalie Cassidy (actress) and Paddy O'Connell (television and radio presenter). A public vote consisting of regional televoting, SMS voting and online voting selected the winner, \"Touch My Fire\" performed by Javine. The results of each televoting region and the online vote awarded 2, 4, 6, 8 and 12 points to their top five songs, while the SMS vote was awarded based on the percentage of votes each song achieved. For example, if a song gained 10% of the SMS vote, then that entry would be awarded 10 points. The public vote in the show registered over 1 million votes."]}, {"page": "Pauline Fowler", "response": ["Pauline is a member of the Beale family. Her storylines focus on drudgery, money worries and family troubles. The matriarchal stalwart of the fictional London community of Albert Square, she is at first portrayed as a loving, doting, very family-oriented mother. In later years, however, she becomes a more stoic, opinionated battle-axe who alienates her relatives through overbearing interference. Pauline is married to the downtrodden Arthur Fowler (Bill Treacher); she finds out he has had a one-night stand with Christine Hewitt (Elizabeth Power), which leads to Pauline hitting him with a frying pan. Their marriage remains rocky until his death in 1996. She is used for comedic purposes in scenes with her launderette colleague, Dot Cotton (June Brown), and scriptwriters included many feuds in her narrative, most notably with her daughter-in-law, Sonia Fowler (Natalie Cassidy), and Den Watts (Leslie Grantham), a family friend who got her daughter, Michelle Fowler (Susan Tully), pregnant at 16. A famous episode in 1986, which includes Pauline discovering that Den is the father of Michelle's baby, drew over 30 million viewers, and was listed at number 36 in The Times' 1998 list of \"Top 100 cult moments in Film\". Richard announced Pauline's retirement from the serial in July 2006, and the character was killed off in a \"whodunnit?\" murder storyline, with Richard making her final appearance on 25 December 2006."]}, {"page": "Kat Slater", "response": ["Kat begins to have second thoughts about the divorce after Pam Coker (Lin Blakley) gives a speech about love and family. Stacey reveals to Alfie that their rent is increasing and Kat is struggling with money. Alfie then invites Kat to his flat for lunch and they reminisce about their relationship. The next day, Kat lashes out at Alfie for leaving leftovers for the children, but at the urging of Stacey, she agrees to be his date to Ian and Jane's wedding if he makes more effort for making up for the fire. On the wedding day, she gets heavily drunk, and during the reception, shoves Sonia Jackson's (Natalie Cassidy) head into the wedding cake. When the nursery raise their rates, Kat is forced to leave the children in Mo's care to work her shift at the market, but ends up having drinks with Kim Fox-Hubbard (Tameka Empson). When Mo brings the children over to the pub, they misbehave and Kat is thrown out of the pub. Undeterred, Kat and Kim continue drinking and sneak into the pub to steal another bottle of wine. Linda Carter (Kellie Bright), catches them, and while Kim leaves to find the cash to pay for it, Linda prepares to call social services to tell them of Kat's irresponsibility as a mother, but Kat snatches Linda's phone and throws it across the ground. When Kim returns with Shirley Carter (Linda Henry), she confesses her fears about being a bad mother, resulting in the other three women sharing their experiences of motherhood and reassuring her. Kat also tells Linda to speak to Mick about her fears that the baby may not be his. Linda then realises that the phone call was still connected, and promises to fix things to make sure social services do not know about what happened, however Kat receives a call from a social worker requesting to visit her. Kat is surprised when a lawyer visits her about Harry telling her about a compensation case with four other women also raped by Harry."]}, {"page": "The Catherine Tate Show", "response": ["*Natalie Cassidy – with Lauren Cooper"]}, {"page": "Jim Branning", "response": ["Despite being overtly racist initially, these hostile feelings mellow, as shown through his close friendship with the Trinidadian shopkeeper, Patrick Trueman (Rudolph Walker). Jim works as a potman, collecting glasses in The Queen Victoria public house, and likes to drink and gamble, to Dot's dismay. He is initially opposed to his granddaughter Sonia's (Natalie Cassidy) lesbian relationship with Naomi Julien (Petra Letang) but later gives his blessing. He clashes with Dot after she takes in an illegal immigrant, Anya (Olga Fedori), whose baby, Tomas, they find at a church. He reports Anya to immigration and she is taken into custody, but Dot keeps Anya's baby and makes Jim promise to look after him with her. In their old age, the Brannings struggle to look after the child, and Dot eventually listens to Jim's pleas and hands the baby over to social services."]}, {"page": "Sonia Fowler", "response": ["Sonia Fowler (also Jackson)\"Helpdesk\", BBC'.' Retrieved 3 March 2007. is a fictional character from the BBC soap opera, EastEnders, played by Natalie Cassidy. Her first appearance was on  and she departed on  She returned brieflyNatalie: I left over lesbian plot  MSN TV UK in 2010 along with other members of the Jackson family, and re-appeared in the soap from  and again in January 2011. Sonia returned as a permanent character on , as part of a storyline that saw her mother Carol (Lindsey Coulson) develop breast cancer. Cassidy took maternity leave in 2016 and Sonia left on 20 September 2016 for her dream job in Kettering. Cassidy made two guest stints during her maternity leave, on 25 December 2016 via webcam and for a three episode arc from 14 to 18 April 2017. She returned full-time on 27 June 2017. On 29 December 2020 it was announced that Cassidy took an extended break from the show with Sonia set to leave the square but returned in spring 2021. She departed on 8 January and returned on 16 April.", "1994 was a \"historic\" year for EastEnders, as in April, a third weekly episode was introduced. Due to the programme's increased frequency, a number of new characters were introduced to the regular cast in the latter part of 1993 and early 1994. Among them were the Jackson family: mother Carol (Lindsey Coulson), her four children, Bianca (Patsy Palmer), Robbie (Dean Gaffney), Sonia (Natalie Cassidy), and Billie (Devon Anderson), as well as Carol's partner Alan Jackson (Howard Antony). Though Carol and Alan were not initially married in the serial, and though Alan was only the biological father of Billie, the whole family took on Alan's surname. The family was created by writer Tony McHale.", "Natalie Cassidy won the award for \"Best Actress\" for the role of Sonia, at the 2001 British Soap Awards. Additionally, in 2004, Cassidy was awarded \"best dramatic performance by a young actor or actress\" for the role."]}, {"page": "Graham Norton's Bigger Picture", "response": ["|Natalie Cassidy, Germaine Greer, Elijah Wood, and Steve Carell"]}, {"page": "Steve Owen (EastEnders)", "response": ["When the pair return from their honeymoon, they hear about Phil's shooting and Steve is promptly implicated as the prime suspect. It soon transpires that the weapon that hospitalized Phil was Steve's handgun, which has gone missing ever since the incident occurred just at the end of Steve and Mel's wedding. Steve is later arrested when police detective DCI Jill Marsden (Sophie Stanton) and her unit gather evidence of his implication, most notably his motive for knowing about Mel sleeping with Phil on Christmas 2000. Upon hearing of this, both Phil's mother Peggy (Barbara Windsor) and his young godson Jamie (Jack Ryder) constantly accuse Steve of committing the crime. Steve insistently proclaims his innocence behind Phil's shooting and ends up clashing with Jamie on multiple occasions; at this stage, Jamie has already grown to dislike Steve since he was recently Matthew's best-friend and had previously testified against Steve for Saskia's murder. Steve later visits Phil in the hospital and threatens him should he ever use Mel to his advantage in their feud again. Later that evening, Steve receives a visit from Dan and is again confronted by Jamie moments later. When Steve tauntingly tells Jamie that Phil is a liar, Jamie punches Steve and they fight when Steve punches Jamie back. Dan breaks up the fight just as Robbie's sister Sonia (Natalie Cassidy), who is also Jamie's girlfriend, intervenes as well. Jamie demands Steve to get out of the square for good, but Steve refuses and again protests his innocence. However, when Phil recovers and discharges himself from the hospital that night, Steve is indeed proven innocent when Phil ends up confronting the real culprit: his former girlfriend and Mel's best-friend, Lisa Shaw (Lucy Benjamin)."]}, {"page": "Janine Butcher", "response": ["The character has been described as a \"super-bitch\" and a \"classic villainess\". She has proven popular with critics and fans of the show. Her storylines typically involve her in an antagonistic role. She has been married four times to Barry Evans (Shaun Williamson) whom she killed on New Year’s Day 2004, David (Harry Towb), Ryan Malloy (Neil McDermott) and Michael Moon (Steve John Shepherd). Her feuds include a long-standing conflict with stepmother Pat Butcher (Pam St Clement), Sonia Jackson (Natalie Cassidy), Lynne Slater (Elaine Lordan), Laura Beale (Hannah Waterman), Peggy Mitchell (Barbara Windsor), Stacey Slater (Lacey Turner) and Kat Slater (Jessie Wallace). Her initial departure saw Janine being wrongfully charged for the death of Laura Beale. Upon her return, Janine is caught forging a wedding that ends with the her new husband abruptly dying of a fatal heart attack. She later accidentally kills local resident Danielle Jones (Lauren Crace) in a hit-and-run car drive; conspires with Peggy's husband Archie (Larry Lamb) to defraud the Mitchell family from their ownership of The Queen Victoria public house; becomes a prime suspect in Archie's murder investigation before attempting to kill her third husband Ryan by poisoning him. She later gives birth to a daughter Scarlett with fourth husband Michael before eventually killing him - leading to her third departure from the show. ", "Janine makes friends with Clare Bates (Gemma Bissix) and Sonia Jackson (Natalie Cassidy) and they cause trouble for Felix Kawalski (Harry Landis), when they spread rumours that he is a pervert who murdered his wife, and keeps her body in his cellar. She is overjoyed when Frank returns, and they move to Manchester in 1996. However, Frank returns to Walford in 1998, leaving Janine with her sister Clare."]}, {"page": "Driving School", "response": ["A four-part celebrity version was produced in 2003 in aid of Comic Relief. Celebrities taking part consisted of Gareth Gates, Paul O'Grady, Nadia Sawalha, Natalie Cassidy, Simon Day and Jade Goody. They found out live during the Red Nose Day telethon on 14 March if they had passed. None of them had. Mel Giedroyc was the narrator."]}, {"page": "EastEnders theme tune", "response": ["| 27 || 28 November 2000 || Sonia Fowler (Natalie Cassidy) breaks down after giving Chloe up for adoption.", "| 32 || 6 May 2002 || Sonia Fowler (Natalie Cassidy) and Jamie Mitchell (Jack Ryder) decide to end their relationship.", "| 41 || 2 February 2007 || Martin Fowler (James Alexandrou) and Sonia Fowler (Natalie Cassidy) leave Walford with their daughter Rebecca (Jade Sherif) to live in Manchester."]}, {"page": "So Graham Norton", "response": ["| Lauren Bacall, Natalie Cassidy and Jack Ryder"]}, {"page": "Jane Beale", "response": ["Jane returns in November with the news that Bobby (now played by Eliot Carrington) is missing. Masood finds him asleep on Walford Common near where Lucy's body was found. When he is returned home it is apparent that he has been trying to solve the murder and wants to live in Walford. Jane agrees that Bobby needs his father and finds them a flat. Denise digs up Lucy's missing purse and phone in Patrick's allotment and Jane convinces Ian not to hand them in to the police. Denise is angry when she finds out Ian had sex with Jane the day after Lucy's death. Jane reunites Ian and Peter when they fall out after Ian discovers that Peter was sourcing Lucy's drugs for her, and later she decides to stay at the Beale house. She takes Lucy's phone and purse and hides them under a loose floorboard without telling Ian. Jane kisses Ian and regrets it, but later realises she loves him and they kiss again under the mistletoe. Jane does not want everyone to know about their relationship, but Alfie Moon (Shane Richie) has already found out and the news quickly spreads across the Square. When Jane finds out, she tells Ian that their relationship will not work, but after a discussion with Alfie, she changes her mind and proposes to Ian, who accepts. They plan their wedding for February. Jane is upset when her parents decline her invitation, disapproving of her remarrying Ian, but Sonia Fowler (Natalie Cassidy) supports her and she makes her matron of honour. On the day of the wedding, Jane receives a card from Lauren, revealing she knows that Lucy was killed at home. Visibly disturbed, she flees her wedding reception and is confronted by Peter, who also has discovered that Lucy died in the house. Ian realises Jane is lying and accuses her of killing Lucy; initially, she confesses, but Ian sees through her and realises Bobby is the real culprit. Jane covered for Bobby by taking Lucy's body and putting it in the common, then convinced Bobby that he didn't kill his sister; that is why they left Walford soon after the murder. Ian forgives Jane and, with the twins' maternal half-sister Cindy Williams (Mimi Keene), they agree that Bobby can never find out. Jane is devastated when Cindy stops her and Ian adopting Beth."]}, {"page": "Stacey Slater", "response": ["Stacey helps Belinda out at her new salon and Belinda is impressed with her. Martin's teenage daughter Bex Fowler (Jasmine Armfield) confides in Stacey about her boyfriend Shakil Kazemi (Shaheen Jafargholi) wanting sex with her and asks for advice. When Bex's mother and Martin's former wife Sonia Fowler (Natalie Cassidy) leaves, Bex moves in with the Fowlers, leaving the flat overcrowded, so they move into Sonia's old house. Max returns to Walford after being wrongly imprisoned for murdering Lucy Beale (Hetti Bywater), and Stacey is happy that he is back. Stacey is upset when Martin is involved in a bus crash but he recovers and agrees to having a baby with Stacey. Stacey and Martin decide to keep their distance from the Kazemis following Bex's bullying ordeal, caused by an explicit photo of Shakil being distributed from Bex's phone. Carmel is hurt with being excluded from Arthur's life and Stacey and Carmel fight when Carmel makes remarks about Stacey's mental health, so Stacey bans her from seeing Arthur. However, Max persuades Stacey to let Carmel be involved with Arthur. Stacey tells Martin that she is pregnant and they agree to seek medical advice because she is worried about her postpartum psychosis returning. In July 2017, Stacey goes for a job interview at The Queen Vic and is accepted as a barmaid there once again."]}, {"page": "Jamie Mitchell", "response": ["During his time on the programme, Jamie's story arc mostly revolved on his close relationships with his godfather Phil Mitchell (Steve McFadden) and on-off girlfriend Sonia Jackson (Natalie Cassidy). The character was originally Phil's second cousin once removed, but later became his surrogate son after it transpired that Jamie had been regularly abused by uncle and guardian Billy (Perry Fenwick) – who himself debuted on the show a week before Jamie's first appearance. Elsewhere, Jamie's romance with Sonia faced many complications ever since she gave birth to Chloe (Jade Sharif) at the age of 15; Jamie believed he was the father of Sonia's child until it was revealed that his best-friend, Martin Fowler (James Alexandrou), was actually Chloe's father after they had a previous fling prior to her dating Jamie.", "After standing up to Billy and coping with Grant leaving the square, Jamie progressively bonds with Phil more than ever. He soon begins a romantic friendship with local teenager Sonia Jackson (Natalie Cassidy), who had initially rejected his efforts after Jamie ends up losing his virginity to Frank's spoiled daughter Janine (Charlie Brooks); she later changed her mind after Janine humiliates Jamie by spreading rumours about his inadequate prowess in bed. In response to this, Jamie dumps Janine while she is working for Kathy's son Ian (Adam Woodyatt) at the local cafe; Jamie begins to clash with Ian over the latter's ongoing rivalry with Phil despite being his stepson as well. By then, Jamie has befriended Sonia's brother Robbie (Dean Gaffney) and their friend Martin Fowler (James Alexandrou) – the latter of whom becomes Jamie's best-friend after he defends Martin from an altercation with Beppe's brother Gianni (Marc Bannerman)."]}, {"page": "Gus Smith", "response": ["Gus first arrives in Walford in May 2002, working for a bed company and meets Sonia Jackson (Natalie Cassidy). Gus falls in love with Sonia and they get together after she splits up with Jamie Mitchell (Jack Ryder). When she and Jamie realise they still have feelings for each other, she breaks up with Gus and reconciles with Jamie. In July, Gus is joined in Walford by his troublesome brother Juley (Joseph Kpobie), taking over as local road sweeper, and is given Wellard the dog when his friend Robbie Jackson (Dean Gaffney) leaves London for India."]}, {"page": "Naomi Julien", "response": ["Naomi Julien is a fictional character from the BBC soap opera EastEnders, portrayed by Petra Letang. She first appeared in the show in the episode broadcast on 15 August 2005. Her storylines include a relationship with established character Sonia Fowler (Natalie Cassidy), a friendship with Garry Hobbs (Ricky Groves) and Minty Peterson and being threatened by Dr. May Wright (Amanda Drew). The character was axed in January 2007 and her final scenes were broadcast on 24 May 2007.", "Naomi arrives in Albert Square as Sonia Fowler's (Natalie Cassidy) nurse friend. She lives with Dot Branning (June Brown) and Jim Branning (John Bardon), then moves in with Garry Hobbs (Ricky Groves) and Minty Peterson (Cliff Parisi). Garry takes a liking to Naomi and they share a kiss, but she develops romantic feelings for Sonia. Sonia tells Naomi that she is having problems with her husband Martin Fowler (James Alexandrou) and is considering a trial separation. Naomi consoles Sonia and they kiss, but Sonia immediately regrets it. Martin blames Naomi for spoiling his marriage, and they become enemies. Naomi initially accepts that Sonia still loves Martin and remains friends with her. However, Sonia eventually leaves Martin to live with Naomi."]}, {"page": "Joe Macer", "response": ["Joe Macer was widowed in 1982 and has two daughters, Megan (Niky Wardley) and Shelly, from his first marriage. He soon met Pauline Fowler (Wendy Richard), a dancing companion at their salsa dance club, and they become good friends. Joe falls in love with Pauline and proposes to her once in The Queen Victoria public house. She turns Joe down but he does not give up, and asks her again in February 2006 after falsely telling her that he will leave for Dubai; this time she accepts. On their wedding day on 17 February 2006, Pauline has doubts about remarrying, but goes through with it any way. However she chooses to keep her surname as Fowler as she doesn't want 'a new identity'. Soon after, Joe admits his former criminal career to Pauline, revealing that his lifelong friend Bert Atkinson (Dave Hill) served time in prison for Joe's crimes, and that he still owes Bert. Joe refuses to choose between Pauline and Bert, and Pauline throws him out of the house. After he and Bert convert Pauline's loft, Pauline forgives him and lets him come home, but their relationship remains uneasy as she becomes obsessed with her irrational vendetta against her daughter-in-law, Sonia (Natalie Cassidy).", "The destruction of Pauline and Joe's marriage was part of the build-up to the exits of both characters. Pauline was killed off in a \"shocking\" and dramatic storyline, which saw her collapsing and dying in the middle of Albert Square, leaving both characters and viewers in uncertainty about the cause of her demise. The storyline continued through 2007, as first Pauline's funeral was interrupted by the police in order to perform an autopsy on her body, and then Pauline's former daughter-in-law Sonia Fowler (Natalie Cassidy) was arrested for the murder."]}, {"page": "Beale family", "response": ["In 1996, Casey Anne Rothery and Alex Stevens took on the roles of Lucy and Peter, however, Peter was recast in 1998 to Joseph Shade. Rothery and Shade remained in the show until 2004, when the characters were recast to Melissa Suffield and James Martin. Thomas Law took over from Martin in 2006 and he and Suffield remained until 2010. Paul Nicholls first appeared in 1996 as Joe Wicks, the son of David. In 2000, Chloe Jackson was introduced as the daughter of teenagers Sonia Jackson, played by Natalie Cassidy, and Martin Fowler – although Martin was not revealed as the father until several weeks after Sonia unexpectedly gave birth. The storyline culminates in Chloe being adopted and the character being renamed Rebecca.", "In 2011, it was announced that Hetti Bywater would be playing the role of Lucy from January 2012. Peter returned in 2013, played by Ben Hardy. Bobby was recast to Rory Stroud and Mimi Keene joined the show as Cindy Beale's youngest daughter, Cindy. Bosses described Cindy as a \"magnet for trouble\" and \"shares many similarities with her late mother\" as well as \"cheeky and hugely likeable, the mischievous teen has no fears or inhibitions and will shake up life for the Beales and the Square in general\". Martin, Sonia and Rebecca returned to the show in 2014. Natalie Cassidy reprised the role of Sonia whilst Martin and Rebecca were recast to James Bye and Jasmine Armfield respectively. Rebecca is described as \"a well-behaved teenager, but is also a little fighter. A bright child who is passionate about music\" who \"wants to do well in life and make her parents proud, but it's this determination that will be the making or undoing of her\"."]}, {"page": "Robbie Jackson", "response": ["Robbie arrives in Albert Square in 1993 with the rest of the Jackson family: mother Carol Jackson (Lindsey Coulson), her partner Alan Jackson (Howard Antony), and his half-siblings, Bianca Jackson (Patsy Palmer), Sonia Jackson (Natalie Cassidy) and Billie Jackson (Devon Anderson). Initially a troublesome teen, Robbie has little success at school and is frequently in trouble for his behaviour, along with his friend Kevin (John Pickard). In November 1994, the pair find a dog which Robbie names Wellard. Robbie manages to persuade the dog's owner to relinquish care to him, after he discovers that Wellard was being neglected, and Wellard then becomes Robbie's pet. As he ages, Robbie becomes more responsible, but has little success in anything he chooses to do. He has several careers in Albert Square including radio control for the Evans' mini cab company, a job as manager in the local video rental store, and is hoping to return to the video shop ", "1994 was a \"historic\" year for EastEnders, as in April, a third weekly episode was introduced. Due to the programme's increased frequency, a number of new characters were introduced to the regular cast in the latter part of 1993 and early 1994. Among them were the Jackson family: mother Carol (Lindsey Coulson), her four children, Bianca (Patsy Palmer), Robbie (Dean Gaffney), Sonia (Natalie Cassidy), and Billie (Devon Anderson), as well as Carol's partner Alan Jackson (Howard Antony). Though Carol and Alan were not initially married in the serial, and though Alan was only the biological father of Billie, the whole family took on Alan's surname."]}, {"page": "Petra Letang", "response": ["In 2005, Letang was cast as Naomi Julien — the lesbian lover of Sonia Fowler (Natalie Cassidy) — in BBC's EastEnders. She left the role in 2007, reportedly because scriptwriters had \"run out of ideas for her\". Prior to this, Letang had gone public with her fears that her character would be axed following a \"bad public reaction\" to the lesbian storyline that saw Naomi break up the marriage of Sonia and Martin Fowler (James Alexandrou)."]}, {"page": "The British Soap Awards", "response": ["| \"Best Actress\" || Natalie Cassidy (Sonia Jackson in EastEnders)", "| \"Best Dramatic Performance from a Young Actor or Actress\" || Natalie Cassidy (Sonia Jackson in EastEnders) || Sam Aston (Chesney Brown in Coronation Street)  Gemma Atkinson (Lisa Hunter in Hollyoaks)  Luke Tittensor (Daz Eden in Emmerdale) "]}, {"page": "Ben Mitchell (EastEnders)", "response": ["On the day before Halfway and Whitney's wedding, Halfway confesses to Whitney that he kissed Ben, leading her to call off their wedding. Just as Whitney is about to expose Halfway's secret to the packed pub, all of the residents are held hostage by Hunter Owen (Charlie Winter), who has escaped prison. Ben is shot in the siege, but is revived by Sonia Fowler (Natalie Cassidy). The attack on Ben leads to Phil forgiving his son and Ben and Halfway also get together. Martin soon returns to Walford to care for his daughter, Bex Fowler (Jasmine Armfield). He pleads with Ben to dispose of the wrench Stacey used to attack Phil, so that she and his kids can return home. However, Ben blackmails Martin into getting involved in criminal jobs for him, saying he will let Stacey come home when he wants to. Ben does dispose of the wrench but further blackmails Martin with footage of him stealing a car. An angry Martin punches Ben and it is then that a past incident of Martin dangling Ben from a railway bridge when he was a child is revisited. Ben says that he is bigger now and will not back down easily. Martin turns to Jack Branning (Scott Maslen), who has recently rejoined the police for advice, and he gets Ben and his accomplices arrested. Ben is however released on bail. He confronts Martin and the next morning, he tells Martin that he is sorry for what he has put him through and that Stacey is free to return to Walford. However, that evening, Ben and his henchmen kidnap Martin and hang him off the railway bridge, just as Martin did to Ben when he was younger. Ben threatens to have Stacey and their kids killed if she does not stay away and if Martin does not continue working for him."]}, {"page": "Natalie Evans", "response": ["To mark the character's exit a special documentary was aired in March 2004, entitled EastEnders Revealed: Natalie Evans. The programme looked back over 10 years of the character's time in the soap and featured interviews from Speed and tributes from her former castmates Shaun Williamson (Barry), Charlie Brooks (Janine), Natalie Cassidy (Sonia Jackson), Gary Beadle (Paul), Pam St. Clement (Pat) and Tony Caunter (Roy)."]}, {"page": "Bianca Jackson", "response": ["Bianca Jackson first arrived with her family; including mother Carol Jackson (Lindsey Coulson), her love interest Alan Jackson (Howard Antony), and Bianca's three half-siblings Robbie Jackson (Dean Gaffney), Sonia Jackson (Natalie Cassidy) and Billie Jackson (Devon Anderson).  She initially works at her uncle Ian Beale's (Adam Woodyatt) fish and chip shop before becoming the market assistant of Sanjay Kapoor (Deepak Verma). Later she runs her own clothing stall on Bridge Street market. Bianca has a short relationship with an older man, Richard Cole (Ian Reddington), but he swiftly dumps her when he grows bored and Bianca gets revenge by harassing him with pranks and stealing his credit card. David Wicks (Michael French) then enjoys mutual flirtation with Bianca until Carol informs David that Bianca is his daughter. Horrified, David promptly keeps his distance, and Bianca remains unaware of their biological relationship. Bianca enters into a relationship with Ricky Butcher (Sid Owen) and they move into a bedsit together. Bianca spends much time clubbing with her childhood friend Tiffany Raymond (Martine McCutcheon) and Ricky starts an affair with Bianca's other childhood friend Natalie Price (Lucy Speed). When Bianca discovers the affair, she breaks up with Ricky and drives Natalie from Walford. One night an intoxicated Bianca is nearly assaulted. She is rescued by David and when she tries to kiss him, he confesses that he is her father. Bianca is left stunned and humiliated. Initially she feels hostile and resentful over David's absence for the majority of her life. Eventually, Bianca has a change of heart and comes to accept David as her father, becoming keen to bond with him. The relationship is further complicated, when during July 1995 David confides in the Samaritans charity (unbeknownst to any of his family) that he still feels sexually attracted to Bianca despite the knowledge that he is her biological father. A case of GSA, this was one of EastEnders most controversial and daring storylines at this point in the show's history. There is further tension when Bianca makes David uncomfortable by reconciling with and dating his stepbrother Ricky again. Bianca is confused by David's unexplained strange and occasionally hostile behaviour. David never admits to Bianca the truth behind his initial feelings towards her, but she and David eventually bond naturally as a father and daughter.", "In his book EastEnders: The First 10 Years: A Celebration, EastEnders scriptwriter Colin Brake describes 1994 as a \"historic\" year for EastEnders, as in April, a third weekly episode was introduced. Due to the programme's increased frequency, a number of new characters were introduced to the regular cast in the latter part of 1993 and early 1994. Among them were the Jackson family, created by Tony McHale: mother Carol (Lindsey Coulson), her four children, Bianca (Patsy Palmer), Robbie (Dean Gaffney), Sonia (Natalie Cassidy), and Billie (Devon Anderson), as well as Carol's partner Alan Jackson (Howard Antony). Though Carol and Alan were not initially married in the serial, and though Alan was only the biological father of Billie, the whole family took on Alan's surname. It later transpired that David Wicks (Michael French) was Bianca's father.", "On 1 August 2010, it was reported that Palmer was pregnant with her fourth child and that she would take maternity leave from EastEnders. To facilitate the departure, Bianca will feature in a major storyline, which executive producer Bryan Kirkwood said was the only possible reason Bianca would have for leaving her family. In December 2010, it was announced that Natalie Cassidy would return as part of Bianca's departure storyline which started in January 2011. Bianca's departure was broadcast on 21 January 2011. Palmer gave birth earlier than expected, meaning that she started leave three weeks before she planned to. Key moments were therefore not filmed, and changes had to be made to the storyline to accommodate her absence. Bianca reappeared from December 2011, though Palmer stated in February 2011 that she was in no hurry to return, did not miss it and did not know when she would be back. On 19 July 2011, Palmer revealed that she had signed a new 'working mums' contract and would be returning before the end of the year."]}]}}