{"wiki_id": "http://www.wikidata.org/entity/Q26329797", "itemLabel": "William Crompton-Stansfield", "itemDescription": "British landowner and Whig politician, of Esholt Hall, Yorkshire, and Frimley Park, Surrey (1790–1871)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Crompton-Stansfield", "wikipedia_page": {"main": "William Rookes Crompton-Stansfield  (3 August 1790 – 5 December 1871) of Esholt Hall, Yorkshire, and Frimley Park, Surrey, was a British landowner and Whig politician who was MP for Huddersfield, Yorkshire, from 1837 to 1853.", "link_mentions": [{"page": "Esholt", "response": ["His son Sir Walter Calverley-Blackett (1707–77) lived at Esholt Hall before his marriage and until it sale in 1755. The estate was later owned by the MP William Crompton-Stansfield (1790–1871)."]}, {"page": "William Markham (bishop)", "response": ["His granddaughter, Emma Markham, another daughter of his son William, married the politician William Crompton-Stansfield who sat in the Parliament of the United Kingdom from 1837–53 as Whig Member of Parliament (MP) for Huddersfield."]}, {"page": "Huddersfield (UK Parliament constituency)", "response": ["|1837 || William Crompton-Stansfield || Whig"]}, {"page": "List of MPs elected in the 1852 United Kingdom general election", "response": ["|Huddersfield||William Crompton-Stansfield||Reformer"]}, {"page": "James Stansfeld", "response": ["Stansfeld's father, James Sr, was the sixth son of David Stansfield (1755–1818) of Hope Hall, Halifax, and his wife Sarah Wolrich (1757–1824), daughter of Thomas Wolrich (1719–91) of Armley House, Leeds. He was a descendant of the Stansfeld family of Stansfield and Sowerby, Yorkshire, and a distant cousin of the politician William Crompton-Stansfield and the soldiers James Rawdon Stansfeld, Thomas Wolryche Stansfeld and John R. E. Stansfeld.", "* William Crompton-Stansfield"]}, {"page": "Esholt Priory", "response": ["His son, Sir Walter Calverley-Blackett, 2nd Bt, sold it to Robert Stansfield (1727–72) of Bradford, Yorkshire, in 1755. It passed to his niece, Anna Maria Rookes (1762–1819) and her husband Joshua Crompton (1754–1832) whose son was the MP William Crompton-Stansfield (1790–1871). After his death in 1871, the estate was inherited by his nephew General William Henry Crompton-Stansfield (1835–88)."]}, {"page": "Frimley Park", "response": ["In the early 1860s most of the estate was parcelled up and sold off. The house with  of land was purchased by the Whig politician William Crompton-Stansfield in 1862. "]}, {"page": "William Rookes Crompton Stansfield", "response": ["#REDIRECT William Crompton-Stansfield"]}, {"page": "John Raymond Evelyn Stansfeld", "response": ["Stansfeld was born on 20 April 1880. He was the youngest child and only son of John Birkbeck Evelyn Stansfeld (1846–1911), Rector of Preston, and his wife Marie Agnes Barrenger. John Snr was the son of Rev. John Stansfield (1814–61), Vicar of Coniston Cold. His cousin, was John Stansfeld (1840–1928) of Field House, Sowerby, and Dunninald Castle, Montrose. He was a descendant of the Stansfeld family of Stansfield and Sowerby, Yorkshire, and a distant cousin of William Crompton-Stansfield, Sir James Stansfeld, James Rawdon Stansfeld and Thomas Wolryche Stansfeld."]}, {"page": "James Rawdon Stansfeld", "response": ["Stansfeld was born on 11 August 1866, he was the son of Lt-Gen. Thomas Wolrich Stansfeld Jnr (1829–1910), and grandson of Thomas Wolrich Stansfeld Snr (1779–1853). Thomas Snr was the eldest son of David Stansfield (1755–1818) of Hope Hall, Halifax, and his wife Sarah Wolrich (1757–1824), daughter of Thomas Wolrich (1719–91) of Armley House, Leeds. He was a descendant of the Stansfeld family of Stansfield and Sowerby, Yorkshire, and a cousin of the politicians William Crompton-Stansfield and Sir James Stansfeld and the soldiers Thomas Wolryche Stansfeld and John R. E. Stansfeld."]}, {"page": "Thomas Wolryche Stansfeld", "response": ["Stansfeld was born in Leeds on 30 June 1877, the youngest son of Thomas Wolryche Stansfeld Sr (1822–85) of Weetwood Grange, Leeds. Thomas Sr was the son of Hatton Hamer Stansfeld (b.1793) of Burley, Leeds, a son of David Stansfield (1755–1818) of Hope Hall, Halifax, and his wife Sarah Wolrich (1757–1824), daughter of Thomas Wolrich (1719–91) of Armley House, Leeds. He was a descendant of the Stansfeld family of Stansfield and Sowerby, Yorkshire, and a distant cousin of William Crompton-Stansfield, Sir James Stansfeld, James Rawdon Stansfeld and John R. E. Stansfeld."]}]}}