{"wiki_id": "http://www.wikidata.org/entity/Q2634624", "itemLabel": "Willie Donachie", "itemDescription": "Scottish footballer and manager (born 1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Willie_Donachie", "wikipedia_page": {"main": "William Donachie (born 5 October 1951) is a Scottish former professional footballer. Donachie had a long playing career, the majority of which was with Manchester City. He also played for Norwich City, Burnley, Oldham Athletic and Portland Timbers. Donachie played 35 times for Scotland and was selected in two FIFA World Cup squads (1974 and 1978). Towards the end of his playing career Donachie became a player-coach at Oldham, working with Joe Royle. Donachie has since worked for numerous teams in coaching roles.", "link_mentions": [{"page": "Millwall F.C.", "response": ["In 2005, Theo Paphitis announced that he was stepping down as chairman of the club with Jeff Burnige to replace him from May 2005. At the end of the 2004–05 season, manager Dennis Wise announced that he was leaving as he was unable to form a working relationship with the new chairman. Former Millwall striker Steve Claridge was announced as the new player-manager of Millwall. However, when Burnige then stepped down just two months after taking up the post, it was announced on 27 July that Claridge had been sacked after just 36 days, without ever taking charge of the team in a competitive match. Former Wolverhampton Wanderers manager Colin Lee replaced him but lasted only five months in charge of the club. On 21 December, with the club bottom of the Championship, he became the club's Director of Football and was replaced as manager by 32-year-old player Dave Tuttle, on a short-term contract until the end of the 2005–06 season. Tuttle had no prior experience in football management. In February 2006, Lee left the club altogether. Millwall experienced a difficult season, having had four managers in 2005. Their 13 goals scored at home was the second worst in Football League history. Their relegation to League One was confirmed on 17 April 2006 with a 2–0 loss against Southampton. In the closed season Nigel Spackman was appointed as the new manager, but he lasted only four months after a string of bad results. In September 2006, Theo Paphitis (chairman from 1997 to 2005) ended his nine-year association with the club after a year-long spell as a non-executive director. On 19 March 2007, Willie Donachie signed a two-year contract following some progress which had seen the club climb to 11th place in the league. Before Donachie took charge, Millwall had taken only six points from their first ten games. In the 2007–08 season Millwall sat bottom of the table at the beginning of October. Donachie was sacked on 8 October, with Richard Shaw and Colin West becoming caretaker managers.", "|2006–2007|| Willie Donachie"]}, {"page": "Castlemilk", "response": ["*Willie Donachie, footballer"]}, {"page": "Montserrat national football team", "response": ["Montserrat's fortunes changed dramatically in 2018 with the arrival of Willie Donachie and launch of the CONCACAF Nations League. The side won three of their four qualifying games, but missed out on qualification for the 2019 CONCACAF Gold Cup on goal difference after Nicaragua scored with 25 minutes to go against Barbados.Montserrat miss out on first Gold Cup qualification Euronews. 25 March 2019. Retrieved 25 March 2019. The team went on to take second place in their group in the inaugural season with two wins, draws, and losses each, thus keeping their place in the second tier.", "|  Willie Donachie", "*  Willie Donachie (2018–)"]}, {"page": "2006–07 in English football", "response": ["| Nigel Spackman || Millwall || 25 September 2006Spackman & Millwall part company BBC Sport. Retrieved on 2 January 2007 || Willie Donachie || 22 November 2006Donachie gets permanent Lions job BBC Sport. Retrieved 21 December 2006"]}, {"page": "Antigua and Barbuda national football team", "response": ["|style=\"text-align: left;\"| Willie Donachie"]}, {"page": "Mikele Leigertwood", "response": ["Leigertwood is eligible to represent Antigua and Barbuda. Willie Donachie, Antigua and Barbuda's manager, tried to bring Leigertwood into the squad for a World Cup qualifier in June 2008, but the player had a wedding to attend. He was also eligible to represent Saint Vincent and the Grenadines."]}, {"page": "Ryan Smith (footballer)", "response": ["Smith moved on loan to League One side Millwall on 21 March 2007 on an initial one-month loan deal, but this was extended on 17 April 2007 to run until the end of the 2006–07 season. Smith impressed during his time on loan at Millwall and manager Willie Donachie expressed an interest in retaining the youngster's services. In July 2007 Milwall paid £150,000 for Smith, who signed a two-year contract with the club."]}, {"page": "Kenny Jackett", "response": ["upright|thumb|left|Jackett whilst Milwall managerFollowing his exit from Swansea Jackett was soon appointed reserve team manager of Manchester City on 7 March 2007. Later in the year he was interviewed for the vacant managerial post at League One club Millwall after the sacking of Willie Donachie, but initially pulled out of the running. However, on 6 November 2007 he left the Premier League club to take up this position."]}]}}