{"wiki_id": "http://www.wikidata.org/entity/Q2636767", "itemLabel": "Alan Maley", "itemDescription": "Visual Effects Artist (1931-1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Maley", "wikipedia_page": {"main": "Alan Maley (7 January 1931 – 13 May 1995) was a British visual effects artist as well as a matte painter.He won at the 44th Academy Awards in the category of Best Visual Effects for his work on Bedknobs and Broomsticks. His win was shared with Danny Lee and Eustace Lycett.", "link_mentions": [{"page": "Raiders of the Lost Ark", "response": ["Matte paintings were used to create more elaborate backgrounds: these included the establishing shot of Marion's Nepalese bar and the warehouse where the Ark is later stored, the latter painted by Michael Pangrazio. Spielberg disliked the painting of the China Clipper plane (by Alan Maley) as he did not think it looked real against the water they had filmed. Jones' attire—a leather jacket and khaki pants—was based on Humphrey Bogart's in The Treasure of the Sierra Madre (1948) and Charlton Heston in Secret of the Incas (1954). Costume designer Deborah Nadoolman Landis dumped boxes of hats on the floor for Ford to try on. After picking the right style, she purchased an Australian model she aged with Fuller's earth and mineral oil, and then scrunched beneath a bed. The hat allowed them to create a recognizable image even in silhouette. Designer Ralph McQuarrie was responsible for the Ark decorations."]}, {"page": "Academy Award for Best Visual Effects", "response": ["|Alan Maley, Eustace Lycett and Danny Lee"]}, {"page": "1995 in film", "response": ["| style=\"text-align:center;\"| 13 || Alan Maley || style=\"text-align:center;\"| 64 || style=\"text-align:center;\"| US || style=\"text-align:center;\"| Matte artist, visual effects || "]}, {"page": "Bedknobs and Broomsticks", "response": ["|Alan Maley, Eustace Lycett and Danny Lee"]}, {"page": "44th Academy Awards", "response": ["*Bedknobs and Broomsticks – Danny Lee, Eustace Lycett and Alan Maley"]}, {"page": "The Computer Wore Tennis Shoes", "response": ["The animated title sequence, by future Academy Award-winning British visual effects artist Alan Maley, reproduced the look of contemporary computer graphics using stop motion photography of paper cutouts. It has been cited as an early example of \"computational kitsch.\""]}, {"page": "List of British Academy Award nominees and winners", "response": ["|Alan MaleyEustace Lycett"]}, {"page": "Maley", "response": ["* Alan Maley (1931–1995), British special effects artist"]}]}}