{"wiki_id": "http://www.wikidata.org/entity/Q2633615", "itemLabel": "George Camsell", "itemDescription": "English footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Camsell", "wikipedia_page": {"main": "George Henry Camsell (27 November 1902 – 7 March 1966) was an English footballer who scored a club record 325 league goals in 419 games for Middlesbrough, and 18 goals in 9 appearances for England. His 59 goals in one season (1926–27) for Middlesbrough was a Football League record at the time, and has only been bettered once within the English game by Dixie Dean of Everton in 1927–28. His 9 hat-tricks that season remain a Football League record. He also holds the  highest goals-to-games ratio for England of anyone who has played more than a single international.", "link_mentions": [{"page": "Northumberland", "response": ["There are many notable footballers from the county, pre Second World War and immediate post war greats were George Camsell and Hughie Gallacher, these were described in the \"Clown Prince of Football\" by Len Shackleton. The author played for Newcastle United and Northumberland County Cricket Club. Shackleton’s book was controversial when it was first published because chapter 9, named \"The Average Director's Knowledge of Football\", was produced as a blank page. Notable players after the Second World War included Joe Harvey, Jackie Milburn, Brian Clough and Newcastle's Bobby Moncur who led his team to win the Inter City Fairs Cup in 1969. "]}, {"page": "Durham, England", "response": ["*George Camsell (1902–1966), international footballer, born in Framwellgate Moor."]}, {"page": "Brian Clough", "response": ["In 2007/08, a redevelopment scheme building new houses on the old Middlesbrough General Hospital site named roads after famous former Middlesbrough F.C. players including Willie Maddren, George Camsell and Clough."]}, {"page": "Middlesbrough F.C.", "response": ["Before league football resumed, Middlesbrough won the Northern Victory League, but the team were unable to maintain their previous form and finished the 1919–20 season in mid-table. They remained in the First Division for the next few seasons, but were relegated in 1923–24 after finishing bottom, 10 points adrift of their nearest rivals. Three seasons later, they won the Division Two title. During that season, debutant George Camsell, who had signed from Third Division North side Durham City the previous season, finished with a record 59 league goals, which included nine hat-tricks. He would continue as top scorer for each of the next 10 seasons. Their tenure back in the top flight lasted only one season, and the club were relegated. They were promoted at the first attempt in 1928–29, winning another Second Division title. The club remained in the First Division until 1954.", "* George Camsell", "* George Camsell (453)", "* George Camsell (345)", "* George Camsell"]}, {"page": "Football records and statistics in England", "response": ["*Most hat-tricks in one season: 9, George Camsell (Middlesbrough, 1926–27)"]}]}}