{"wiki_id": "http://www.wikidata.org/entity/Q263094", "itemLabel": "Elizabeth Stride", "itemDescription": "Whitechapel murder victim", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Stride", "wikipedia_page": {"main": "Elizabeth \"Long Liz\" Stride (née Gustafsdotter; 27 November 1843 – 30 September 1888) is believed to have been the third victim of the unidentified serial killer known as Jack the Ripper, who killed and mutilated a minimum of five women in the Whitechapel and Spitalfields districts of London from late August to early November 1888.Unlike the other four canonical Ripper victims, Stride had not been mutilated following her murder, leading some historians to suspect Stride had not actually been murdered by Jack the Ripper. However, Stride's murder occurred less than one hour before the murder of the Ripper's fourth canonical victim, Catherine Eddowes, within walking distance, and her act of murder is suspected to have been disturbed by an individual entering the crime scene upon a two-wheeled cart. In addition, both women had been murdered by slash wounds to the throat, leading most authors and researchers to consider Stride to be the third of the Ripper's canonical five victims.Stride was nicknamed \"Long Liz\". Several explanations have been given for this pseudonym; some believe it sources from her married surname (a stride being a reference to a long step), while others believe this is a reference to either her height, or her general facial structure.", "link_mentions": [{"page": "1888", "response": ["* September 30 – Whitechapel murders: The bodies of London prostitutes Elizabeth Stride and Catherine Eddowes, the latter mutilated, are found. They are generally considered Jack the Ripper's third and fourth victims, respectively.", "** Elizabeth Stride, victim of Jack the Ripper (b. 1843)"]}, {"page": "Prince Albert Victor, Duke of Clarence and Avondale", "response": ["Rumours that Prince Albert Victor may have committed, or been responsible for, the Jack the Ripper murders were first mentioned in print in 1962.Cook, p. 8; Meikle, p. 177.\"Who Was Jack the Ripper?\". Time. 9 November 1970. Retrieved 25 September 2019. It was later alleged, among others by Stephen Knight in Jack the Ripper: The Final Solution, that Albert Victor fathered a child with a woman in the Whitechapel district of London, and either he or several high-ranking men committed the murders in an effort to cover up his indiscretion. Though such claims have been repeated frequently, scholars have dismissed them as fantasies, and refer to indisputable proof of the Prince's innocence.Aronson, p. 110; Cook, p. 9; Cornwell, pp. 133–135; Harrison, pp. 142–143; Hyde, The Cleveland Street Scandal, p. 58; Meikle, pp. 146–147; Rumbelow, pp. 209–244. For example, on 30 September 1888, when Elizabeth Stride and Catherine Eddowes were murdered in London, Albert Victor was over 500 miles (over 800 km) away at Balmoral, the royal retreat in Scotland, in the presence of Queen Victoria, other family members, visiting German royalty and a large number of staff. According to the official Court Circular, family journals and letters, newspaper reports and other sources, he could not have been near any of the murders.Marriott, pp. 267–269. Other fanciful conspiracy theories are that he died of syphilis or poison, that he was pushed off a cliff on the instructions of Lord Randolph Churchill, or that his death was faked to remove him from the line of succession.Aronson, pp. 213–217; Cook, p. 10; McDonald pp. 193–199."]}, {"page": "Spitalfields", "response": ["**Elizabeth Stride (1843–1888), resided at a common lodging house at 32 Flower and Dean Street."]}, {"page": "List of prostitutes and courtesans", "response": ["*Elizabeth Stride, one of the \"canonical five\" victims of Jack the Ripper"]}, {"page": "Kip Winger", "response": ["Kip Winger's theatrical composing debut is the musical thriller Get Jack, with book/lyrics by Damien Gray (Atomic the Musical, Animagique, Sing On Tour). The story revolves around the five female victims of Jack the Ripper. Mary Ann Nichols, Annie Chapman, Elizabeth Stride, Catherine Eddowes, and Mary Jane Kelly—known as the \"canonical five\"—who rise from the dead to track down Jack and take revenge."]}, {"page": "Mary Ann Nichols", "response": ["The subsequent murders of Elizabeth Stride and Catherine Eddowes the week after the inquest had closed, and that of Mary Jane Kelly on 9 November, were also linked by a similar modus operandi, and the murders were blamed by the press and public on a single serial killer, known by October 1888 as \"Jack the Ripper\"."]}, {"page": "Jack the Ripper suspects", "response": ["Metropolitan Police Service files show that their investigation into the serial killings encompassed 11 separate murders between 1888 and 1891, known in the police docket as the \"Whitechapel murders\". Five of these—the murders of Mary Ann Nichols, Annie Chapman, Elizabeth Stride, Catherine Eddowes, and Mary Jane Kelly—are generally agreed to be the work of a single killer, known as \"Jack the Ripper\". These murders occurred between August and November 1888 within a short distance of each other, and are collectively known as the \"canonical five\". The six other murders—those of Emma Elizabeth Smith, Martha Tabram, Rose Mylett, Alice McKenzie, Frances Coles, and the Pinchin Street torso—have been linked with Jack the Ripper to varying degrees.", "Lechmere's home address, visits to family, and route to work link him to the times and places of murders; he passed three streets where Martha Tabram, Polly Nichols, and Annie Chapman were murdered roughly at the same time the murders are estimated to have occurred. The \"Double Event\" murders of Elizabeth Stride and Catherine Eddowes occurred on a Saturday, his only night off from work: Stride was killed near Lechmere's mother's house in an area he grew up in, and the direct route from Stride's murder scene to the location of Eddowes's murder followed a path to Lechmere's route to work that he had used for twenty years. Mary Kelly was also murdered on his route to work, and the time frame in which she is estimated to have been killed matches his route, although the day she was killed was a holiday and he may have had the day off.", "Michael Maybrick (alias Stephen Adams; 31 January 1841 – 26 August 1913) was an English composer and singer best known under his pseudonym Stephen Adams as the composer of \"The Holy City\". In his book from 2015 They All Love Jack: Busting the Ripper Bruce Robinson documents how this suspect frequented the Whitechapel area where the murders took place and investigates a description of a man seen by Matthew Packer on the night of the murder of Elizabeth Stride who resembled Michael Maybrick. The suspect's profession meant he frequently travelled around the UK and the dates and locations of his performances coincide with when and where the letters to the police were sent from. The suspect's presence in Bradford around Christmas 1888 also coincides with the murder of a seven-year-old boy, Johnnie Gill, a murder which the Ripper had foretold to police in a letter.", "Other named suspects include Swiss butcher Jacob Isenschmid, German hairdresser Charles Ludwig, apothecary and mental patient Oswald Puckridge (1838–1900), insane medical student John Sanders (1862–1901), Swedish tramp Nikaner Benelius, and even social reformer Thomas Barnardo, who claimed he had met one of the victims (Elizabeth Stride) shortly before her murder.Davenport-Hines, Richard (2004). \"Jack the Ripper (fl. 1888)\", Oxford Dictionary of National Biography. Oxford University Press. Subscription required for an online version. Isenschmid and Ludwig were exonerated after another murder was committed while they were in custody.Evans and Rumbelow, pp. 86–88 There was no evidence against Barnardo, Benelius, Puckridge or Sanders.Evans and Rumbelow, pp. 88, 80 According to Donald McCormick, other suspects included mountebank L. Forbes Winslow,Cullen, p. 91 whose own suspect in the case was a religious maniac, G. Wentworth Bell Smith.Whitehead and Rivett, p. 109 Most recently, morgue assistant Robert Mann was added to the long list of suspects.Trow, Mei J (2009). Jack the Ripper: Quest for a Killer. Pen & Sword Books. "]}, {"page": "Saucy Jacky postcard", "response": ["Postmarked and received on 1 October 1888, the postcard mentions that the two victims killed on 30 September were killed very close to one another, stating: \"double event this time\". Elizabeth Stride and Catherine Eddowes were both killed in the early morning of 30 September, and part of Eddowes' ear was found detached at the crime scene as a result of facial mutilations that the killer performed. Some authors have argued that the letter was sent before the murders were publicised, making it unlikely that a hoaxer would have such knowledge of the crime, but the letter was postmarked more than 24 hours after the killings took place, long after many details were known by journalists and residents of the area.Sugden p 269"]}, {"page": "From Hell letter", "response": ["While newsmen considered this letter a mere joke, they decided after two days to notify Scotland Yard of the matter. The double murder of Elizabeth Stride and Catherine Eddowes took place the night that the police received the \"Dear Boss\" letter. The Central News people received a second communication known as the \"Saucy Jacky\" postcard on 1 October 1888, the day after the double murder, and the message was duly passed over to the authorities. Copies of both messages were soon posted to the public in the hopes that the writing style would be recognised. While the police felt determined to discover the author of both messages, they found themselves overwhelmed by the media circus around the Ripper killings and soon received a large amount of material, most of it useless."]}, {"page": "Mary Jane Kelly", "response": ["On 10 November, Dr Bond wrote a report officially linking Kelly's murder with four previous ones to occur in and around Whitechapel—those of Mary Ann Nichols, Annie Chapman, Elizabeth Stride, and Catherine Eddowes. Bond also provided an offender profile of the murderer, which suggested the perpetrator was a solitary, eccentric individual who was subject to periodic attacks of homicidal and erotic mania, and who had been in an extreme state of satyriasis as he performed the mutilations upon Kelly and the four previous victims.Letter from Thomas Bond to Robert Anderson, 10 November 1888, HO 144/221/A49301C, quoted in Evans and Skinner, pp. 360–362 and Rumbelow, pp. 145–147 On the same day, the Commissioner of the Metropolitan Police, Sir Charles Warren,Begg, Jack the Ripper: The Facts, p. 299 issued a pardon for \"any accomplice, not being a person who contrived or actually committed the murder, who shall give such information and evidence as shall lead to the discovery and conviction of the person or persons who committed the murder [of Mary Jane Kelly]\".Evans and Skinner, pp. 347–349 Despite this offer, and the extensive police investigation, no one was ever charged or tried for any of these murders."]}, {"page": "Jack the Ripper, Light-Hearted Friend", "response": ["* From August 31 through September 30, 1888, when Mary Ann Nichols,  Annie Chapman, Elizabeth Stride and Catherine Eddowes were killed, Carroll was vacationing in Eastbourne, East Sussex along with Isa Bowman, a child actress and personal friend of his. Meanwhile, Thomas Vere Bayne had severe back pain during the summer of 1888 and was barely able to move. On November 9, 1888, when Mary Jane Kelly was killed, both Carroll and Bayne were reportedly in Oxford."]}, {"page": "Jack the Ripper: The Final Solution", "response": ["Meanwhile, Gorman alleges, Kelly was looking after the daughter, Alice, both during and after the raid. Gorman asserts that at first Kelly was content to hide the child, but then she, along with her friends Mary Ann Nichols, Annie Chapman and Elizabeth Stride, decided to blackmail the government. Gorman accuses Salisbury of conspiring with his fellow freemasons, including senior policemen in the London Metropolitan Police, to stop the scandal by staging the murders of the women. Gorman says Salisbury assigned the task to Gull, who lured the four women into a carriage individually where Gull murdered them with the assistance of coachman John Netley and Sir Robert Anderson, Assistant Commissioner of Scotland Yard. Gorman claims a fifth victim, Catherine Eddowes, was killed accidentally in a case of mistaken identity because she used the alias Mary Ann Kelly and was confused with Mary Jane Kelly. Gorman alleges that Netley tried to kill the young Alice twice but after the second unsuccessful attempt several witnesses chased Netley, who threw himself into the Thames and drowned. Gorman completes the story by saying that Alice lived well into old age, later becoming Walter Sickert's mistress, and that Alice and Walter Sickert are his parents."]}, {"page": "Catherine Eddowes", "response": ["Eddowes was murdered in the early hours of Sunday 30 September within the City of London. She was the second woman killed within an hour; the night having already seen the murder of Elizabeth Stride within the jurisdiction of the Metropolitan Police. These two murders are commonly referred to as the \"double event\";Evans and Rumbelow, pp. 114–140 a term which originates from the content of the \"Saucy Jacky\" postcard received at the Central News Agency on 1 October. ", "Frederick Foster, an architect who had produced a plan of Mitre Square following Eddowes's murder, then testified that an individual could walk from Berner Street (site of the murder of Elizabeth Stride) to Mitre Street in twelve minutes. His testimony was followed by  that of an Inspector Collard of the City Police, who described responding to the crime scene and the subsequent actions of police.", "* 1 October 1888 Times news article pertaining to the \"double event\" murders of Elizabeth Stride and Catherine Eddowes"]}, {"page": "Martha Tabram", "response": ["Contemporary newspaper reports published at the beginning of September linked Tabram's murder to those of Emma Elizabeth Smith on 3 April and Mary Ann Nichols on 31 August, though before she died, Smith had told the police that a gang had attacked her. The later killings of Annie Chapman on 8 September, of both Elizabeth Stride and Catherine Eddowes on 30 September and of Mary Jane Kelly on 9 November were also linked at the time to Tabram's. The last five murders mentioned are now generally referred to as the \"canonical five\" victims of Jack the Ripper. All were knife murders of impoverished prostitutes in the Whitechapel and Spitalfields districts, generally perpetrated in darkness in the small hours of the morning, in a secluded site to which the public could gain access, and which occurred on or close to a weekend or holiday."]}, {"page": "Calling card (crime)", "response": ["* Jack the Ripper is believed to have left two calling cards by Goulston Street, London on September 30, 1888, the night he murdered Elizabeth Stride and Catherine Eddowes: a scrap of Eddowes' apron and some graffiti reading Juwes are the men That Will not be Blamed for nothing. Some authors believe the graffiti may have already been there prior to the apron piece being dropped and that the two should not be linked."]}, {"page": "Montague Druitt", "response": ["On 31 August 1888, Mary Ann Nichols was found murdered in the impoverished Whitechapel district in the East End of London, with her throat slashed. During September, three more women (Annie Chapman on the 8th, and Elizabeth Stride and Catherine Eddowes on the 30th) were found dead with their throats cut. On 9 November 1888, the body of Mary Jane Kelly was discovered. Her throat had been severed down to the spine. In four of the cases the bodies were mutilated after death. The similarities between the crimes led to the supposition that they were committed by the same assailant, who was given the nickname \"Jack the Ripper\". Despite an extensive police investigation into the five murders, the Ripper was never identified and the crimes remain unsolved.Whittington-Egan and Whittington-Egan, pp. 91–92"]}, {"page": "Servant Girl Annihilator", "response": ["According to author Philip Sugden in The Complete History of Jack the Ripper, the conjecture that the Texas killer and Jack the Ripper were one and the same man originated in October 1888, when an editor with the Atlanta Constitution proposed this conjecture, following the murders of Elizabeth Stride and Catherine Eddowes by Jack the Ripper.", "Similar to the murders in Austin, all five of the Ripper's victims would follow a similar pattern of lower-class women within the radius of Whitechapel, deep throat cuts, severe body mutilations and organs removed, except in the case of Elizabeth Stride. Several witness testimonies of sightings of the alleged Ripper talking to Elizabeth Stride right before she was found dead have provided description of him. One William Marshall claimed the Ripper was  \"a stout man of about 5 feet 6 inches tall wearing a black cut-away coat, dark trousers, and a cap that was \"like something a sailor would wear.\" A police constable named William Smith claimed, \"the man had a dark complexion and a dark moustache, wearing a cutaway coat and dark trousers and carrying a parcel wrapped in newspaper.\" A recent immigrant named Israel Schwarts claimed \"he shouted 'Lipski' to a second man... he had a full face, was broad-shouldered, and wearing a dark jacket and trousers with a peaked cap.\" "]}, {"page": "Israel Schwartz", "response": ["Shortly after the time that Schwartz claimed this incident had happened, the body of Elizabeth Stride was found in the same location. That same day Schwartz identified Stride's body as that of the woman he had seen attacked and gave testimony to the police about what he had seen. He was able to give descriptions of both men but was unable to say whether they knew each other or had been working together. "]}, {"page": "List of people from Gothenburg", "response": ["* Elizabeth Stride (née Gustafsdotter) (1843–1888) alleged third victim of serial killer Jack the Ripper"]}, {"page": "Jack the Ripper", "response": ["Extensive newspaper coverage bestowed widespread and enduring international notoriety on the Ripper, and the legend solidified. A police investigation into a series of eleven brutal murders committed in Whitechapel and Spitalfields between 1888 and 1891 was unable to connect all the killings conclusively to the murders of 1888. Five victims—Mary Ann Nichols, Annie Chapman, Elizabeth Stride, Catherine Eddowes, and Mary Jane Kelly—are known as the \"canonical five\" and their murders between 31 August and 9 November 1888 are often considered the most likely to be linked. The murders were never solved, and the legends surrounding these crimes became a combination of historical research, folklore, and pseudohistory, capturing public imagination to the present day.", "The canonical five Ripper victims are Mary Ann Nichols, Annie Chapman, Elizabeth Stride, Catherine Eddowes, and Mary Jane Kelly.3000 Facts about Historic Figures  p. 171", "Elizabeth Stride and Catherine Eddowes were both killed in the early morning hours of Sunday  1888. Stride's body was discovered at approximately  in Dutfield's Yard, off Berner Street (now Henriques Street) in Whitechapel.Holmes, Profiling Violent Crimes: An Investigative Tool, p. 233 The cause of death was a single clear-cut incision, measuring six inches across her neck which had severed her left carotid artery and her trachea before terminating beneath her right jaw.Naming Jack the Ripper: New Crime Scene Evidence, A Stunning Forensic Breakthrough  p. 60 The absence of any further mutilations to her body has led to uncertainty as to whether Stride's murder was committed by the Ripper, or whether he was interrupted during the attack.Cook, p. 157; Marriott, Trevor, pp. 81–125 Several witnesses later informed police they had seen Stride in the company of a man in or close to Berner Street on the evening of 29 September and in the early hours of 30 September,Wilson et al., p. 38 but each gave differing descriptions: some said that her companion was fair, others dark; some said that he was shabbily dressed, others well-dressed.Begg, Jack the Ripper: The Definitive History, pp. 176–184", "Eddowes's body was found in a corner of Mitre Square in the City of London, three-quarters of an hour after the discovery of the body of Elizabeth Stride. Her throat was severed and her abdomen ripped open by a long, deep and jagged wound before her intestines had been placed over her right shoulder. The left kidney and the major part of the uterus had been removed, and her face had been disfigured, with her nose severed, her cheek slashed, and cuts measuring a quarter of an inch and a half an inch respectively vertically incised through each of her eyelids.Foul Deeds and Suspicious Deaths in London's East End  p. 88 A triangular incision—the apex of which pointed towards Eddowes's eye—had also been carved upon each of her cheeks,Jack the Ripper – Through the Mists of Time  p. 27 and a section of the auricle and lobe of her right ear was later recovered from her clothing. The police surgeon who conducted the post mortem upon Eddowes's body stated his opinion these mutilations would have taken \"at least five minutes\" to complete.Medical report in Coroner's Inquests, no. 135, Corporation of London Records, quoted in Evans and Skinner, pp. 205–207 and Fido, pp. 70–74"]}]}}