{"wiki_id": "http://www.wikidata.org/entity/Q263076", "itemLabel": "Robin Walker", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Robin_Walker", "wikipedia_page": {"main": "Robin Caspar Walker (born 12 April 1978) is a British politician who has served as Minister of State for School Standards since 2021. A member of the Conservative Party, he was a Parliamentary Under-Secretary of State serving jointly between the Scotland Office and Northern Ireland Office under Prime Minister Boris Johnson from 2019 to 2020. Walker has been the Member of Parliament (MP) for Worcester since 2010. He identifies as a one-nation Conservative.", "link_mentions": [{"page": "April 12", "response": ["*  1978   – Robin Walker, English businessman and politician"]}, {"page": "Mike Foster (Worcester MP)", "response": ["Foster lost his seat to Robin Walker (Conservative) in the May 2010 election."]}, {"page": "List of political families in the United Kingdom", "response": ["**Robin Walker (1978–), Conservative MP 2010–. Son of Peter."]}, {"page": "Donald Woods", "response": ["Woods and friends Drew Court and Robin Walker devised a plan for him to be smuggled out of his house. Disguised as a Roman Catholic priest, Father \"Teddy Molyneaux\", on New Year's Eve 1977, Woods hitchhiked out of town then drove in convoy with Court  before attempting to cross the Telle River, a tributary of the Orange River, between South Africa and Lesotho. However, following days of steady rain, the river had flooded, leaving him to resort to crossing at the Telle Bridge border crossing in a Lesotho Postal Service truck driven by an unsuspecting Mosotho man, who was merely giving the \"priest\" a ride."]}, {"page": "Peter Walker, Baron Walker of Worcester", "response": ["Walker and his wife had five children. His son Robin Walker was elected MP for the Worcester constituency in the 2010 general election."]}, {"page": "Michael Scott (architect)", "response": ["Later, Ronnie Tallon and Robin Walker became partners, and the firm was renamed Scott Tallon Walker in 1975, shortly after the firm won the RIBA Royal Gold Medal. Scott, who spent most of his life living at Sandycove Point, just south of Dún Laoghaire in south Dublin, was buried near Sneem in County Kerry."]}, {"page": "List of Balliol College, Oxford people", "response": ["* Robin Walker"]}, {"page": "Worcester (UK Parliament constituency)", "response": ["Peter Walker's son, Robin Walker, was elected as the Conservative MP at the 2010 general election. The constituency is marginal and was selected as a \"target\" by the Labour Party in 1997, and by the Conservative Party in 2010.", "| Robin Walker"]}, {"page": "List of Parliamentary constituencies in Herefordshire and Worcestershire", "response": ["|Robin Walker †"]}, {"page": "Parliamentary Under-Secretary of State for Scotland", "response": ["|Robin Walker"]}, {"page": "Welsh Affairs Select Committee", "response": ["| Robin Walker MP (Conservative)", "| Robin Walker MP (Conservative)"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Robin Walker; MP for Worcester (2010–present)"]}, {"page": "Paul Blomfield", "response": ["He is Secretary of the APPG on Debt and Personal Finance. He introduced a High Cost Credit Bill into the House of Commons in July 2013 and co-ordinated a cross-party campaign, around a Charter to Stop the Payday Loan Rip-Off. Citizens Advice gave their Parliamentarian of the Year 2014 award jointly to Paul Blomfield and Conservative MP Robin Walker for their work on the issue."]}, {"page": "Business, Energy and Industrial Strategy Committee", "response": ["| Robin Walker MP (Conservative)"]}, {"page": "Robin Walker (disambiguation)", "response": ["Robin Walker may refer to:", "*Robin Walker, British politician", "*Robin Walker (game designer), creator of the Team Fortress series of computer games", "*Robin Walker, Irish architect, best known for his work with firm Scott Tallon Walker", "*Robin Walker, composer of the large scale orchestral work The Stone Maker (1995)"]}, {"page": "British Government frontbench", "response": ["| colspan=\"2\" | Robin Walker"]}]}}