{"wiki_id": "http://www.wikidata.org/entity/Q263636", "itemLabel": "Dee Palmer", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Dee_Palmer", "wikipedia_page": {"main": "Dee Palmer (formerly David Palmer; born 2 July 1937) is an English composer, arranger, and keyboardist best known for having been a member of the progressive rock group Jethro Tull from 1976 to 1980 (although she had worked with the band as an arranger since their inception in 1968).", "link_mentions": [{"page": "Yes (band)", "response": ["In 1993 the album Symphonic Music of Yes was released and features orchestrated Yes tracks arranged by Dee Palmer. Howe, Bruford and Anderson perform on the record, joined by the London Philharmonic Orchestra, the English Chamber Orchestra and the London Community Gospel Choir."]}, {"page": "Jethro Tull (band)", "response": ["Jethro Tull are  a British rock band formed in Blackpool, England, in 1967. Initially playing blues rock and jazz fusion, the band soon incorporated elements of hard rock, folk and classical music, forging a signature progressive rock sound. The group’s bandleader, founder, primary composer and only constant member is Ian Anderson, a multi-instrumentalist who mainly plays flute and acoustic guitar, and is also the lead vocalist. The group has featured a revolving door of musicians throughout the decades, including significant contributors such as electric guitarist Martin Barre (the longest serving member besides Anderson), keyboardists John Evan, Dee Palmer, Peter-John Vettese and Andrew Giddings, drummers Clive Bunker, Barrie \"Barriemore\" Barlow and Doane Perry, and bassists Glenn Cornick, Jeffrey Hammond, John Glascock, Dave Pegg and Jonathan Noyce.", "* Dee Palmer – keyboards (1977–1980; also worked with the band as an arranger between 1967 and 1976)"]}, {"page": "List of transgender people", "response": ["|Dee Palmer  ", "|Wright, J. (2004).  \"Dee Palmer Interview \".  Retrieved April 3, 2007."]}, {"page": "Thick as a Brick", "response": ["* Dee Palmer – orchestral arrangements"]}, {"page": "Aqualung (album)", "response": ["\"My God\" was recorded on 11–12 April 1970, followed by \"Wond'ring Aloud\" on 21 June, both at Morgan Studios. After an American tour, bass player Glenn Cornick was fired from the band, and was replaced with Jeffrey Hammond, an old friend of Ian Anderson. Aqualung would be Hammond's first album with the band. It would also mark the first time John Evan had recorded a full album with the band, as his only prior involvement was to provide several keyboard parts on the previous 1970 album, Benefit. In December, the album became one of the first to be recorded at the newly opened studios of Island Records in Basing Street, London. Led Zeppelin were recording their untitled fourth album at the same time. In an interview on the 25th anniversary edition of the album, Tull's bandleader Ian Anderson said that trying to record in that studio was very difficult, because of its \"horrible, cold, echoey\" feel. There were two recording studios at the location; Led Zeppelin worked in the smaller studio while Tull got the larger, which was the main body of a converted church. The orchestral segments were arranged by Dee Palmer, who had worked with the band since 1968's This Was, and would later join as a keyboard player. The master reels were assembled at Apple Studios on 2 March 1971. Aqualung would be the last Jethro Tull album to include Clive Bunker as a band member, as he retired shortly after recording to start a family.", "* Dee Palmer – orchestral arrangements and conducting"]}, {"page": "Heavy Horses", "response": ["Heavy Horses was the first album recorded by Jethro Tull at the newly constructed Maison Rouge studio in Fulham, London, a custom built recording studio which was funded and owned by Ian Anderson. Much of the album was recorded at night, as Anderson felt that daytime hours at the studio needed to be left open for potential business clients. Keyboardist Dee Palmer (then David Palmer) recalled her diary entries at the time of recording as saying that \"I'd start at 7pm and go home at 7am!\" Heavy Horses was the first album on which Anderson began to experience vocal issues, the beginning of an affliction which would become more serious in the 1980s and later develop into chronic obstructive pulmonary disease. Anderson's vocals sound more nasal and gruff on some of the album's tracks as a result, particularly on the title track.", "* Dee Palmer – keyboards, portative pipe organ, orchestral arrangements"]}, {"page": "Repeat – The Best of Jethro Tull – Vol II", "response": ["* Dee Palmer – arranger, saxophone, synthesizer, keyboards, conductor"]}, {"page": "A Passion Play", "response": ["* Dee Palmer – orchestral arrangements"]}, {"page": "A (Jethro Tull album)", "response": ["Musically, the album was a departure from prior Tull works, adopting more of an electronic rock sound with heavy use of synthesizers, although still retaining the band's trademark folk influence and Anderson's flute playing. Lyrically, the album saw a similar departure from the fantasy and folklore themes of previous Tull work, instead emphasizing contemporary matters such as the Cold War. The album was the first Tull album released following a large lineup change which saw drummer Barrie \"Barriemore\" Barlow and keyboardists John Evan and Dee Palmer departing the band in 1980 while bassist John Glascock had died from heart complications the previous year. The album instead features Glascock's touring replacement Dave Pegg on bass in his first recorded appearance with the band, Mark Craney on drums and Eddie Jobson on keyboards (with Jobson credited as a \"special guest\"). ", "A features a dramatically different line-up of Tull from the band's previous album, Stormwatch (1979). Former keyboardist John Evan and organist Dee Palmer were fired from the group, while drummer Barriemore Barlow left the band due to depression over the death of John Glascock as well as plans to start his own band."]}, {"page": "Too Old to Rock 'n' Roll: Too Young to Die!", "response": ["* Dee Palmer – saxophone (on track 5), piano (on track 11)", "Orchestrations by Dee Palmer.", "Orchestra conducted by Dee Palmer."]}, {"page": "This Was", "response": ["This Was also contains the only Jethro Tull lead vocal not performed by Ian Anderson on a studio album, in \"Move on Alone\". Mick Abrahams, the song's author, provided vocals on the track; Dee Palmer provided the horn arrangement.", "* Dee Palmer – French horn and orchestral arrangements"]}, {"page": "Stand Up (Jethro Tull album)", "response": ["* Dee Palmer – string arrangements and conductor on track 9"]}, {"page": "David Palmer", "response": ["* Dee Palmer, British arranger and keyboardist, formerly David Palmer of Jethro Tull"]}, {"page": "Minstrel in the Gallery", "response": ["In late 1974, upon completion of touring for the band's seventh album  War Child, the band returned to the idea of recording outside of the UK with frontman Ian Anderson commissioning the creation of a mobile studio to allow the band to record anywhere they wished. The mobile studio, constructed by engineer Robin Black and Morgan Studios engineer Pete Smith, was christened the Maison Rogue Mobile Studio and was transported in April 1975 to Monte Carlo, Monoco, where the band would record the album in the Prince of Wales Hotel. Anderson rented a home in Los Angeles in December 1974 to finish writing of the album, where he was joined by orchestral arranger (and future Jethro Tull keyboardist) Dee Palmer to assist in finalizing string arrangements for the album.", "* Dee Palmer – string quintet arrangements and conducting"]}, {"page": "Stormwatch (album)", "response": ["Stormwatch was notably the last Tull album to feature the \"classic\" line-up of the 1970s, as drummer Barrie \"Barriemore\" Barlow and keyboardists John Evan and Dee Palmer all left or were fired from the band in the months after the album's tour concluded in April 1980, while bassist John Glascock died from heart complications in November 1979 during the tour. Glascock's playing is largely absent on the album as a result of his medical issues, with Anderson playing bass on all but three tracks.", "Stormwatch was recorded over a series of sessions lasting from August 1978 until July 1979, although the majority of the album's tracks were recorded in the later 1979 sessions. The initial series of sessions in 1978 only produced one track which would appear on the album (\"Something's On the Move\") with guitarist Martin Barre mentioning in a 1979 interview that \"we completed an album's worth of material, then we went away to America-- and when we got back, we listened to it again and it was not there at all. So, we decided to start again.\" In early 1979, the band recorded for the album while Ian Anderson, keyboardist/arranger David Palmer (now Dee Palmer) and Barre simultaneously wrote music for The Water's Edge, a commissioned program for the Scottish Ballet. Some of the music written for The Water's Edge would later develop into tracks on Stormwatch, such as \"Elegy\" and \"Dark Ages\".", "* Dee Palmer – synthesizers, portable organ and orchestral arrangements (credited as \"David Palmer\")"]}, {"page": "War Child (album)", "response": ["The album prominently features Dee Palmer's string orchestration across an eclectic musical set, with the band members, as the two predecessor albums, playing a multitude of instruments. The music is lighter and more whimsical than the dark A Passion Play, with hints of comedy in the lyrics and the music' structure, although the lyrics still unleash lashing critiques of established society (as in \"Queen and Country\" and \"Bungle in the Jungle\"), religion (\"Two Fingers\") and critics (\"Only Solitaire\").", "* Dee Palmer – orchestral arrangements"]}, {"page": "Benefit (album)", "response": ["* Dee Palmer – orchestral arrangements"]}, {"page": "Songs from the Wood", "response": ["Inspired by English pagan folklore and countryside living, the album signalled a resumption of the band's wide-ranging folk rock style which combined traditional instruments and melodies with hard rock drums, synthesisers and electric guitars, all laid in the band's complex progressive rock template. The album was the first Jethro Tull album to include Dee Palmer as an official member of the band, who after eight years of serving as the band's orchestral arranger had joined as a second keyboardist in early 1976.", "Compared to previous Jethro Tull albums, Songs From the Wood saw greater writing contributions from other members of the band besides Anderson, particularly from new keyboardist Dee Palmer and guitarist Martin Barre. Palmer wrote significant portions of several songs, including the title track, \"Hunting Girl\", \"Velvet Green\", \"Ring Out, Solstice Bells\" and \"Pibroch (Cap in Hand)\" and also introduced the portative pipe organ to the rest of the band, an instrument which became a major element of the album's classical folk sound. The band made use of a variety of other instruments and recording techniques to contribute to the album's folk theme, including medieval-era percussion played by Barlow such as nakers and a tabor as well as a reverse echo guitar effect played by Barre on \"Pibroch (Cap in Hand)\" to imitate the sound of bagpipes. \"Ring Out, Solstice Bells\" was recorded with the intention of being a Christmas single. However Chrysalis Records disliked that the song was in 7/4 time and asked the band to re-record the song in the more common 4/4 time, a suggestion which Anderson said that the band \"weren't particularly pleased with.\"  The band re-recorded the song, now re-titled \"Magic Bells\" at Lansdowne Studios with Mike Batt of the Wombles producing, however the decision was eventually made by Chrysalis to scrap the new version and release the original instead. One song recorded during the sessions for the album was cut, initially titled \"Dark Ages\" (the same name of a different song later featured on the band's 1979 album Stormwatch), the track remained unreleased until 2017 when it was included on the 40th Anniversary \"Country Set\" edition of the album, where it was given the title \"Old Aces Die Hard\" by Anderson.", "* Dee Palmer – piano, portative pipe organ, synthesisers"]}, {"page": "Dee", "response": ["* Dee Palmer (*1937), English musician"]}, {"page": "David Palmer (musician)", "response": ["#REDIRECT Dee Palmer"]}, {"page": "John Evan", "response": ["Evan departed Jethro Tull in July 1980, with the \"Big Split\" of the band. He then went on to form Tallis with fellow departing Tull member, Dee Palmer. He appeared in the 2004 DVD Jethro Tull – A New Day Yesterday: The 25th Anniversary Collection (1969–1994) (originally released in 1994 on VHS), the 2008 DVD Jethro Tull – Their Fully Authorised Story (1968–2008), and the 2009 CD/DVD combo Jethro Tull – Live at Madison Square Garden (1978). In 2018, Evan appeared in a video segment, dressed as a flower, during Ian Anderson's Jethro Tull 50th Anniversary tour."]}, {"page": "Martin Barre", "response": ["Martin Barre commenced a tour of the U.S. in the spring of 2019 to celebrate the 50th Anniversary of his joining Jethro Tull and the release of Stand Up. On the tour he was supported by his band consisting Alan Thomson (bass), Dan Crisp (guitar and vocals) and Darby Todd (drums), along with special guests (former Tull members) Dee Palmer on keyboards and Clive Bunker on drums. The band were completed with Ali Humphries and Becca Langsford on backing vocals. The show was presented with a full multimedia backing show provided by fans from The Jethro Tull Group. A new double CD album release was available at the shows. MLB is a celebration of 50 years of Jethro Tull as arranged and performed by Martin, his band and guests.", "For 2020, Barre had planned to celebrate 50 years of Jethro Tull music with a world tour. However, most shows were cancelled or rescheduled due to the global COVID-19 pandemic.  Adam Wakeman, Clive Bunker and Dee Palmer were scheduled to be guest musicians in several presentations.", "* 2018 Dee Palmer (Through Darkened Glass)"]}, {"page": "Bursting Out", "response": ["* Dee Palmer – portative organ, synthesizers"]}, {"page": "Nightcap: The Unreleased Masters 1973–1991", "response": ["***Dee Palmer - keyboards, orchestra conductor (on track 4)", "***Dee Palmer - keyboards, orchestra conductor"]}]}}