{"wiki_id": "http://www.wikidata.org/entity/Q264069", "itemLabel": "George Clarkson Stanfield", "itemDescription": "British artist (1828–78)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Clarkson_Stanfield", "wikipedia_page": {"main": "George Clarkson Stanfield (1 May 1828 – 22 March 1878) was an English painter best known for his topographical views painted during his visits to the Rhine Valley, Switzerland, and the Italian lakes. He was the son of the marine painter Clarkson Frederick Stanfield.", "link_mentions": [{"page": "Clarkson Frederick Stanfield", "response": ["Clarkson Frederick Stanfield  (3 December 179318 May 1867) was a prominent English painter (often inaccurately credited as William Clarkson Stanfield) who was best known for his large-scale paintings of dramatic marine subjects and landscapes. He was the father of the painter George Clarkson Stanfield and the composer Francis Stanfield.", "His eldest surviving son, George Clarkson Stanfield (1828–78) was also a painter of similar subjects, largely trained by his father. Another son, Francis Stanfield (1835–1914) was an English Catholic priest who is noted for having composed several notable hymns. His grandson by his daughter Harriet, Joseph Ridgard Bagshawe was also a marine painter."]}, {"page": "Lisson Grove", "response": ["* Stanfield: George Clarkson Stanfield and his son, both artists."]}, {"page": "Stanfield (surname)", "response": ["*George Clarkson Stanfield (1828–1878), English painter (son of Clarkson)"]}, {"page": "Elhanan Bicknell", "response": ["Bicknell occupied a large house at Herne Hill, Surrey, from 1819. In 1828 he began what became a major collection of pictures by contemporary or recent British artists. By 1850, he had collected some of the works of Thomas Gainsborough, J. M. W. Turner and numerous others including David Roberts, Edwin Landseer (such as Doubtful Crumbs), George Clarkson Stanfield, Thomas Webster, William Collins, William Etty and Augustus Wall Callcott.Dianne Sachko Macleod, “Art collecting and Victorian middle-class taste,” Art History, 10 (3) September 1987, pp.336-7  He became personally acquainted with most of the artists, entertained them in his home and paid them well. The house did not have a Long gallery, so Bicknell placed these works, with pieces of sculpture such as Edward Hodges Baily's Eve at the Fountain, throughout the rooms, and opened his house to art connoisseurs. Gustav Friedrich Waagen published a description and listing by room in his Treasures of Art in Great Britain. A visitor who came to see the collection in 1857 said, \"It could not have been formed in better taste.\"”Visits to private galleries of the British School - The collection of Elhanan Bicknell, Esq., at Herne Hill,” The Art-Journal, 1857, Vol III, p.10. This may have been John Ruskin who lived nearby and made regular visits to see the paintings of, \"my always kind neighbour.\"John Ruskin & Sir Edward Tyas Cook, Turner at the National Gallery and in Mr Ruskin’s Collection, G. Allan, London, 1903, p.390."]}, {"page": "History of Lisson Grove", "response": ["* Stanfield: George Clarkson Stanfield and his son, both artists."]}]}}