{"wiki_id": "http://www.wikidata.org/entity/Q264023", "itemLabel": "Hazel Blears", "itemDescription": "British politician (born 1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hazel_Blears", "wikipedia_page": {"main": "Hazel Anne Blears (born 14 May 1956) is a former British Labour Party politician, who served as the Member of Parliament (MP) for Salford and Eccles, previously Salford, from 1997 to 2015.\nShe served in the Cabinet as Minister without Portfolio and Chair of the Labour Party between 2006 and 2007, and Secretary of State for Communities and Local Government from 2007 to 2009, when she resigned.\nCommenting on her resignation, Gordon Brown said that Blears had made an \"outstanding contribution\" to public life.", "link_mentions": [{"page": "Cheshire", "response": ["On 25 July 2007, the Secretary of State Hazel Blears announced she was 'minded' to split Cheshire into two new unitary authorities, Cheshire West and Chester, and Cheshire East. She confirmed she had not changed her mind on 19 December 2007 and therefore the proposal to split two-tier Cheshire into two would proceed. Cheshire County Council leader Paul Findlow, who attempted High Court legal action against the proposal, claimed that splitting Cheshire would only disrupt excellent services while increasing living costs for all. A widespread sentiment that this decision was taken by the European Union long ago has often been portrayed via angered letters from Cheshire residents to local papers. On 31 January 2008 The Standard, Cheshire and district's newspaper, announced that the legal action had been dropped. Members against the proposal were advised that they may be unable to persuade the court that the decision of Hazel Blears was \"manifestly absurd\"."]}, {"page": "May 14", "response": ["*1956 – Hazel Blears, English lawyer and politician, Secretary of State for Communities and Local Government"]}, {"page": "1997 United Kingdom general election", "response": ["Although the Conservatives lost many ministers such as Michael Portillo, Tony Newton, Malcolm Rifkind, Ian Lang and William Waldegrave and controversial MPs such as Neil Hamilton and Jonathan Aitken, some of the Conservative newcomers in this election were future Prime Minister Theresa May, future Chancellor of the Exchequer Philip Hammond as well as future Speaker John Bercow. Meanwhile, Labour newcomers included future Cabinet and Shadow Cabinet members Hazel Blears, Ben Bradshaw, Yvette Cooper, Caroline Flint, Barry Gardiner, Alan Johnson, Ruth Kelly, John McDonnell, Stephen Twigg and Rosie Winterton, as well as future Speaker Lindsay Hoyle. The election of 120 women, including 101 to the Labour benches, came to be seen as a watershed moment in female political representation in the UK."]}, {"page": "London Stansted Airport", "response": ["In November 2006, Uttlesford District Council rejected a BAA planning application to increase the permitted number of aircraft movements and to remove the limit on passenger numbers. BAA immediately appealed against the decision and a public inquiry opened, lasting from May until October 2007. Planning Inspector Alan Boyland made his recommendations in January 2008.  Those recommendations were largely followed by the Secretary of State for Transport (Geoff Hoon) and the Secretary of State for Communities and Local Government (Hazel Blears), who jointly allowed the applicant's appeal in October 2008. A legal challenge by community campaign group Stop Stansted Expansion  was rejected by the High Court in March 2009.", "The public inquiry into BAA's second runway application had been scheduled to start on 15 April 2009, but the start was delayed by Secretary of State Hazel Blears to allow time for BAA and the government to consider the implications of the March 2009 Competition Commission's ruling that BAA must sell Stansted within two years. As 2011 drew to a close, BAA was still appealing against the Competition Commission ruling. On 20 August 2012, after losing a case at the Court of Appeal, BAA agreed to cease challenging the Competition Commission's ruling and to sell Stansted."]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Hazel Blears", "| Hazel Blears"]}, {"page": "Kennington", "response": ["Kennington is within the Division bell zone for the Houses of Parliament. This means that, at least in theory, it is within eight minutes from the division lobbies of the Houses of Parliament. A large number of members of parliament and civil servants live within the area. An article in The Sunday Times described Kennington as \"the politicians' enclave across the Thames from Westminster\"; and The Times observed that \"Kennington ... is the suburb that has featured the most in the MPs' expenses scandal. Hazel Blears and Alistair Darling are only two of the ministers with Kennington second homes\".", "* Hazel Blears, Member of Parliament and former Secretary of State for Communities and Local Government."]}, {"page": "Barbara Castle", "response": ["One of her most memorable achievements as Transport minister was to pass legislation decreeing that all new cars had to be fitted with seat belts. Despite being appointed to the Ministry of Transport, a role which she was originally unenthusiastic about, Castle could not actually drive herself, and was chauffeured to functions. (The Labour politician Hazel Blears recalled driving Castle at one time as a young Labour Party activist in the 1980s.Hazel Blears’ memories of Barbara Castle , The Labour History Group, 20 June 2007) Despite her lack of a driving licence, she attracted controversy when she told local government leaders to give added emphasis to motor vehicle access in urban areas, as \"most pedestrians are walking to or from their cars.\""]}, {"page": "Salford", "response": ["Salford was enfranchised as a parliamentary borough by the Great Reform Act of 1832, returning a single Member of Parliament (MP). From 1868 it returned two MPs to the House of Commons until the Redistribution of Seats Act 1885, when the constituency was split into three single-member divisions: Salford North, Salford South and Salford West. •  •  Boundaries changed again under the provisions of the Representation of the People Act 1948 when the constituencies were reorganised into Salford East and Salford West. Since 1997, Salford has lain within the reconstituted Salford parliamentary constituency. Hazel Blears – a member of the Labour Party – has been the MP for the constituency since 1997. Rebecca Long-Bailey has been the MP for Salford and Eccles since 2015, a member of UK Labour. From the general election of 2010 Salford will be part of the new constituency of Salford and Eccles."]}, {"page": "Smithfield, London", "response": ["Whilst the market continues to trade, its future remains unclear following Government Planning Minister Ruth Kelly's instigating a major public inquiry in 2007. The public inquiry for the demolition and redevelopment of the General Market Building took place between 6 November 2007 and 25 January 2008. In August 2008, Communities Secretary Hazel Blears announced that planning permission for the General Market's redevelopment had been refused, stating that the threatened buildings made \"a significant contribution\" to the character and appearance of Farringdon and the surrounding area."]}, {"page": "Martin Bell", "response": ["He announced that he was considering standing against a third Conservative MP, Sir Nicholas Winterton, the MP for Macclesfield, at the 2010 general election, but following Winterton's announcement that he was not going to seek re-election, did not do so. He indicated that he might stand against Hazel Blears in Salford (the first sitting MP of a party other than the Conservative Party against whom he expressed an interest in standing) although in the end he did not stand in any constituency."]}, {"page": "Falmer", "response": ["To the west of the parish is the site of Falmer Stadium, home of Brighton & Hove Albion F.C. Despite its name and proximity to Falmer, it is actually inside the City of Brighton and Hove boundary. After a lengthy process including a public enquiry, it was approved by the Office of the Deputy Prime Minister in 2005, but Lewes District Council subsequently mounted a legal challenge and overturned the decision on a technicality. The stadium was finally approved by Secretary of State Hazel Blears on 24 July 2007. The 30,500-seater stadium opened in July 2011."]}, {"page": "Hilary Benn", "response": ["In 2007, Benn was the bookmakers' favourite for the Deputy Leadership of the Labour Party. Early polls in the deputy leadership contest showed him to be the grassroots' favourite – in a YouGov poll of party members, Benn was top with 27%, followed by Education Secretary Alan Johnson with 18%, Environment Secretary David Miliband with 17%, Justice Minister Harriet Harman with 10%, and Labour Party Chair Hazel Blears with 7%. The contest was launched on 14 May 2007 after the resignation of incumbent deputy leader John Prescott, Benn had some difficulties securing the necessary 45 nominations required to get on the ballot paper but he acquired the support needed to join five other candidates—Hazel Blears, Harriet Harman, Alan Johnson, Peter Hain and backbencher Jon Cruddas. Supporting nominations from constituency Labour parties showed Hilary Benn obtaining 25%, Jon Cruddas 22%, Harriet Harman 19%, Alan Johnson 14%, Hazel Blears 12% and Peter Hain 8% of the constituency parties that voted. The contest closed on Sunday 24 June 2007, with Harriet Harman winning. Benn was eliminated in the third round of voting, having reached 22.33% of the vote. Harman was elected in the fifth round with 50.43% of the vote."]}, {"page": "Blairism", "response": ["* Hazel Blears – former Secretary of State for Communities and Local Government"]}, {"page": "Frank Dobson", "response": ["Dobson's naturally pugnacious style earned him rapid promotion to the front bench, where he served in several important posts from 1982. His liking for dirty jokes and conviviality won him many friends. He once remarked of Hazel Blears, who is 4'10\" in height, \"The good thing about global warming is that Hazel Blears will be the first to go when the water rises.\" After privatisation of the Rover Group in 1988 he quipped, \"The price charged for Rover was so low that there is some suspicion that Lord Young thought it was a dog.\" As Spokesman on Environment and London from 1994, he led the national Labour response to a series of scandals over City of Westminster council and its former leader Shirley Porter."]}, {"page": "Boris Berezovsky (businessman)", "response": ["According to Alexander Litvinenko, a Russian Federal Security Service (FSB) officer in London was preparing to assassinate Berezovsky with a binary weapon in September 2003. This alleged plot was reported to British police.Alex Goldfarb and Marina Litvinenko. Death of a dissident: The Poisoning of Alexander Litvinenko and the Return of the KGB, The Free Press (2007)  Hazel Blears, then a Home Office Minister, said that inquiries made [into these claims] were \"unable to either substantiate this information or find evidence of any criminal offences having been committed\".House of Commons Hansard Written Answers for 13 January 2004 (pt 8), House of Commons of the United Kingdom, 13 January 2004"]}, {"page": "Bez (dancer)", "response": ["Bez stood as a candidate for the Salford and Eccles constituency in the 2015 UK General Election. The incumbent Member of Parliament (MP), Hazel Blears, announced her intention to stand down at the election. Bez ran on a platform of \"free energy, free food and free anything\". He received 703 votes (1.6% of the total turnout) which placed him in sixth position in the constituency. The seat was won by the new Labour Party candidate, Rebecca Long-Bailey, who received 21,364 votes (49.4% of the total)."]}, {"page": "John Denham (politician)", "response": ["As part of the Cabinet reshuffle on 5 June 2009, Denham was appointed to the role of Secretary of State for Communities and Local Government. He replaced Hazel Blears who had resigned from the post on 3 June 2009."]}, {"page": "List of current members of the British Privy Council", "response": ["| Hazel Blears"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Hazel Blears"]}, {"page": "Caroline Flint", "response": ["In February 2007, it was announced that she would be Hazel Blears' campaign manager in Blears' campaign for the Deputy Leadership election of the Labour Party following John Prescott's resignation. Blears did not win, coming sixth in the election."]}]}}