{"wiki_id": "http://www.wikidata.org/entity/Q2645790", "itemLabel": "Alfie Fripp", "itemDescription": "British RAF officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfie_Fripp", "wikipedia_page": {"main": "Alfred George Fripp (13 June 1914 –3 January 2013), known as \"Alfie\" or \"Bill\", was a British Royal Air Force squadron leader who was a flight sergeant during the Second World War. He was shot down by the Luftwaffe in 1939 and held in twelve different prisoner of war camps, including Stalag Luft III, later the site of the \"Great Escape\".  As the last of the \"39ers\" (those taken prisoner in the first year of the war), he was the oldest surviving and longest serving British POW.", "link_mentions": [{"page": "January 3", "response": ["* 2013 – Alfie Fripp, English soldier and pilot (b. 1913)"]}, {"page": "Robert Fripp", "response": ["Alfie Fripp, the last of the \"39ers\", shot down by the Luftwaffe and then held in 12 different POW camps during World War II, was his uncle."]}, {"page": "Fripp", "response": ["* Alfie Fripp (1913 - 2013), British airman"]}, {"page": "No. 57 Squadron RAF", "response": ["*Alfie Fripp, longest serving and last surviving British prisoner of war"]}, {"page": "Alfred Fripp", "response": ["* Alfie Fripp, Alfred George (\"Alfie\" or \"Bill\") Fripp (1913–2013), longest serving and oldest surviving British World War II Prisoner of War"]}, {"page": "2013 in the United Kingdom", "response": ["**Alfie Fripp, 98, RAF pilot, longest-serving British POW during World War II."]}, {"page": "Deaths in January 2013", "response": ["*Alfie Fripp, 98, British RAF airman, longest-serving British POW during World War II.Alfie Fripp, prisoner of war at Stalag Luft III, dies, aged 98"]}, {"page": "Michael James Casey", "response": ["Tasked with a reconnaissance mission over the Wesel-Bocholt area of Germany, Casey took off from the airfield at Etain at 1100 hours on 16 October 1939 flying a Bristol Blenheim Mark I (serial L1141). His observer was Sergeant Alfie Fripp RAF and his wireless operator/air gunner Aircraftman 1st Class J. Nelson RAF.Chorley (1992), p.19 A Luftwaffe Messerschmitt Bf109 flown by Leutnant Hans-Folkert RosenboomKilled in action 16 August 1940. Douglas G Sankey, section L-R of Jagdgeschwader 1 (Fighter Wing 1) intercepted the Blenheim and, after a long chase sometimes only 6 feet from the ground, shot it down near Lingen.Feast (2015) p.138-139The Times, 21 October 1939. All three airmen scrambled clear of the wreckage before it burst into flames. Issued with prisoner of war number 24, Casey was sent to Luftwaffe prison camp Stalag Luft I at Barth where he met Squadron Leader Roger Bushell. Bushell later masterminded the Great Escape. While held at Barth, Casey was one of a group of prisoners known as \"ghosts\" who hid from the Germans within the camp for extended periods and did not attend the roll calls to give the impression that they had escaped. This tied up German military and police resources to scour the region for escapers.Feast (2015) p.140 Casey was a member of the group of \"bad lads\" with Bushell who were sent to the reputedly escape proof Stalag Luft III in the province of Lower Silesia near the town of Sagan (now Żagań in Poland)."]}, {"page": "List of people from Bournemouth", "response": ["* Alfie Fripp (1914–2013) Royal Air Force squadron leader, served six years as prisoner of war"]}, {"page": "Alfie (name)", "response": ["* Alfie Fripp (1913–2013), Second World War Royal Air Force flight sergeant"]}]}}