{"wiki_id": "http://www.wikidata.org/entity/Q26478535", "itemLabel": "John Laurie", "itemDescription": "politician, died 1864", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Laurie_(1797%E2%80%931864)", "wikipedia_page": {"main": "John Laurie (1797 – 2 August 1864) was a British Conservative politician.\nLaurie was first elected Conservative MP for Barnstaple at a by-election in 1854—caused by the constituency's result at the 1852 general election being declared void on petition due to bribery, leading to the writ for the seat also being suspended in 1853. However, Laurie's term was short-lived after, upon petition, he was unseated in March 1855, due to bribery. He later regained the seat in 1857 and held it until 1859 when he did not seek re-election.", "link_mentions": [{"page": "Barnstaple (UK Parliament constituency)", "response": ["| John LaurieLaurie's election at the by-election of 1854 was declared void on petition, and a second by-election held", "| John Laurie"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*John Laurie; MP for Barnstaple (1854–1855; 1857–1859)"]}, {"page": "John Wimburn Laurie", "response": ["He was born in London, England, the son of John Laurie and Eliza Helen Collett, and educated at Harrow, Dresden and the Royal Military College, Sandhurst.The Canadian men and women of the time a handbook of Canadian biography, HJ Morgan (1898) He entered the British Army in 1853 and served in 4th Kings Own Regiment in Crimea (1855) and Mauritius (1857) on his way to India (1858). He served in South Africa (1881). While in Nova Scotia, Laurie also served during the North-West Rebellion of 1885, at which point he was the highest-ranking officer in Canada.Prairie Warships: River Navigation in the Northwest Rebellion By Gordon Errett Tolton, p. 129 He achieved the rank of Lieutenant General in 1887.", "His oldest son John Laurie Jr. was killed in the Second Boer War and is listed on the South African War Memorial in Halifax and the Memorial Arch at the Royal Military College of Canada. He was also the father of George Brenton Laurie who was killed in World War One."]}, {"page": "List of MPs elected in the 1857 United Kingdom general election", "response": ["|John Laurie||Conservative"]}, {"page": "List of United Kingdom by-elections (1847–1857)", "response": ["|John Laurie", "|John Laurie"]}, {"page": "John Laurie (1797-1864)", "response": ["#REDIRECT :John Laurie (1797–1864)"]}]}}