{"wiki_id": "http://www.wikidata.org/entity/Q26404923", "itemLabel": "Ewan Law", "itemDescription": "British Member of Parliament (1747-1829)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ewan_Law", "wikipedia_page": {"main": "Ewan Law (1747 – 24 April 1829) was a British politician, MP for Westbury (1795–1800) and Newtown (1802).\nHe was baptised on 30 October 1747, the son of Edmund Law, later Bishop of Carlisle and Mary Chistian.Entering the East India Company in Bengal in 1763, Law rose through the ranks, joining the council in Patna in 1770, becoming junior merchant in 1772, senior merchant in 1776, and company chief in Patna in 1777. He returned to the UK in 1780, and retired in 1782. He had numerous connections in British India: his brother Thomas Law was an East India Company official; his wife's brother William Markham was Private Secretary to Governor-General Warren Hastings; a sister married Sir Thomas Rumbold, Governor of Madras; his nephew Edward Law, 1st Earl of Ellenborough later became Governor-General.Elected MP for Westbury in 1790, Law spoke against the Impeachment of Warren Hastings (his brother Edward Law was senior counsel for Hastings' defence), believing Hastings to be \"honest and honourable\" and condemning the conduct of the trial as \"a libel on British justice\" on 6 June 1793. He vacated the seat in January 1795.In 1802 Law's brother Sir Edward Law was appointed Lord Chief Justice and ennobled as Lord Ellenborough, therefore vacating his seat at MP for Newtown. Law succeeded him, elected unopposed in a by-election on 5 May 1802, but there was a delay in his taking his seat, caused by his name being spelled wrongly (\"Evan\" rather than \"Ewan\") in the election return. He held the seat until the 1802 general election.\nHe served on the Commission of Naval Enquiry appointed to investigate malpractice in the navy 1802–05, but he was then in ill health, and could not attend regularly. In 1804 he wrote that attendance was \"too much for me\", and anticipated keenly that the enquiry would be ended.He died on 24 April 1829.", "link_mentions": [{"page": "William Markham (bishop)", "response": ["*Henrietta Sarah Markham (1764–1844), married Ewan Law MP"]}, {"page": "Westbury (UK Parliament constituency)", "response": ["| Ewan Law"]}, {"page": "Sir George Clerk, 6th Baronet", "response": ["Clerk married Maria Anne Law (1788-1866), the daughter of Ewan Law , brother of Edward Law, 1st Baron Ellenborough, in 1810."]}, {"page": "Newtown (UK Parliament constituency)", "response": ["| Ewan Law"]}, {"page": "Edmund Law", "response": ["* Ewan Law (1747–1829), MP for Westbury (1795–1800) and Newtown (1802)"]}, {"page": "George Henry Law", "response": ["Law was the younger brother of Bishop John Law (1745–1810), Ewan Law  (1747–1829), Lord Chief Justice Lord Ellenborough (1750–1818), and Thomas Law (1756–1834), a property investor in Washington, D.C."]}, {"page": "John Law (bishop)", "response": ["Law was the elder brother of Ewan Law  (1747–1829), of Edward Law, 1st Baron Ellenborough (1750–1818), who became Lord Chief Justice of England and Wales, and of George Henry Law (1761–1845), Bishop of Chester and Bishop of Bath and Wells. Another brother, Thomas Law (1756–1834), was a business man who settled first in British India and then in 1793 in the United States, where he married as his second wife Eliza Parke Custis, a granddaughter of Martha Washington.Allen C. Clark, Thomas Law: A Biographical Sketch (Washington, D.C.: Press of W. F. Roberts, 1900), pp. 11–12: \"Early in 1796 the engagement with Eliza Park Custis was announced... Thomas Law, youngest son of the late Bishop of Carlisle, to Miss Custis.\"Thomas Jefferson, ed. J. Jefferson Looney, The Papers of Thomas Jefferson, Retirement Series (vol. 3, 2006), p. 209 Eliza and Thomas Law divorced in 1811."]}, {"page": "Thomas Law (1756–1834)", "response": ["Thomas Law was born on October 23, 1756 in Cambridge, England, as the youngest son of a clerical British family. He was raised in the Anglican Church as his father was Edmund Law, Bishop of Carlisle; At Google Books. his brothers were  John Law, Bishop of Clonfert and Kilmacduagh in Ireland; At Google Books; Ewan Law MP; Edward Law, 1st Baron Ellenborough, Lord Chief Justice; and George Henry Law, Bishop of Bath and Wells.George Henry Law, National Portrait Gallery (London)"]}, {"page": "List of United Kingdom by-elections (1801–1806)", "response": ["| 5 May 1802 || Newtown || u || Sir Edward Law || Ewan Law || appointed"]}, {"page": "List of Great Britain by-elections (1790–1800)", "response": ["|15 January 1795||Westbury||u||Ewan Law||Samuel Estwick (younger)||Resignation"]}, {"page": "List of MPs in the first United Kingdom Parliament", "response": ["| Sir Richard Worsley – resignedReplaced by Sir Edward Law 1801 Replaced by Ewan Law 1802"]}, {"page": "List of MPs elected in the 1790 British general election", "response": ["| Ewan Law  – resigned  Replaced by Samuel Estwick (younger) 1795"]}]}}