{"wiki_id": "http://www.wikidata.org/entity/Q2658164", "itemLabel": "Ben Hillier", "itemDescription": "British record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Hillier", "wikipedia_page": {"main": "Ben Hillier is an English songwriter and pop-rock record producer who is part of the creative team 140 dB. He produced the notable albums Playing the Angel, Sounds of the Universe and Delta Machine by Depeche Mode, Think Tank by Blur, Some Cities by Doves and Cast of Thousands by Elbow.", "link_mentions": [{"page": "Depeche Mode", "response": ["In October 2005, the band released their 11th studio album Playing the Angel. Produced by Ben Hillier, the album peaked at No. 1 in 18 countries and featured the hit single \"Precious\". This is the first Depeche Mode album to feature lyrics written by Gahan and, consequently, the first album since 1984's Some Great Reward featuring songs not written by Gore. \"Suffer Well\" was the first ever post-Clarke Depeche Mode single not to be written by Gore (lyrics by Gahan, music by Philpott/Eigner). The final single from the album was \"John the Revelator\", an uptempo electronic track with a running religious theme, accompanied by \"Lilian\", a lush track that was a hit in many clubs all over the world.", "In May 2008, the band returned to the studio with producer Ben Hillier to work on some songs that Martin Gore had demoed at his home studio in Santa Barbara, California. Later that year it was announced that Depeche Mode were splitting from their long-term US label, Warner Music, and signing with EMI Music worldwide. The album was created in four sessions, two in New York and two in Santa Barbara. A total of 22 songs were recorded, with the standard album being 13 songs in length while many of the others were released in subsequent deluxe editions."]}, {"page": "Paul Oakenfold", "response": ["In September 1994 and again in 1998 he teamed up with Steve Osborne and Ben Hillier to remix the Rolling Stones's song You Got Me Rocking and Duran Duran's song Out of My Mind. He began producing his own tracks as well, continuing to remix songs from popular artists.  He began using Goa music, something he discovered on the beaches of Goa in India, fusing it with similar-sounding European tracks to create his own distinct sound. He took this to the mainstream in 1994 and created a pair of two-hour sets for BBC Radio 1's Essential Mix the first of these was broadcast in the early hours of Sunday 20 March 1994, with the second being the legendary \"Goa Mix\" broadcast on Sunday 18 December 1994.   His album Perfecto Fluoro became the #1 essential dance collection of Boston Beat during 1996 with Jamiroquai's Travelling Without Moving."]}, {"page": "Natalie Imbruglia", "response": ["In late-2008, in the second year of work on her eventual 2009 album Come to Life, Imbruglia parted with her label, Brightside/Sony BMG. She obtained the rights to songs recorded for the album and planned to record on her own label, Malabar Records. Songs were co-written with Ben Hillier, Dave McCracken, her then-husband Daniel Johns, Gary Clark, Jamie Hartman, Paul Harris, Shep Solomon and Chris Martin of Coldplay. Some tracks were produced by Hillier and mixed by Danton Supple."]}, {"page": "Flood (producer)", "response": ["In 2013, Flood worked again with Depeche Mode, being responsible for the mixing process of their album \"Delta Machine\", which was produced by Ben Hillier."]}, {"page": "Think Tank (Blur album)", "response": ["Recording sessions started in November 2001, taking place in London, Morocco and Devon, and finished a year later. The album's primary producer was Ben Hillier with additional production by Norman Cook (Fatboy Slim), and William Orbit. At the start of the sessions, guitarist Graham Coxon had been in rehab for alcoholism. After he re-joined, relationships between him and the other members became strained. After initial recording sessions, Coxon left, leaving little of his presence on the finished album. This is the only Blur album to not feature Coxon as a full-time member; he returned to the band for their next album The Magic Whip (2015).", "Recording sessions for Think Tank started in November 2001 at Albarn's 13 Studio in London. Albarn, James and Rowntree had come to the studio along with Ben Hillier, who explained that \"there was tension to begin with. Alex had made some belittling comment about Gorillaz in the press, but there was a 'fuck you' and a 'fuck you' and it was all mates again but for the fact that Graham was missing\". During 2001, Coxon had been battling alcoholism and depression, and failed to turn up to the initial session. Despite Coxon's absence, the rest of the band decided to start recording without him.", "Blur received a number of awards and nominations for Think Tank. At the 2003 Q Awards, Think Tank won the award for Best Album.The awards Blur have won or got nominated for  This was the third time the band had received this award, previously winning in 1994 and 1995 for Parklife and The Great Escape respectively. Blur also received nomination for Best Act in the World Today and, along with Ben Hillier, were nominated in the Best Producer category. The album also won in the Best Album category at the South Bank Show Awards in 2004 and was nominated in a similarly titled category at the Danish Music Awards the same year. Think Tank was nominated for Best British Album at the 2004 Brit Awards. The promo videos for Out of Time and Good Song also won several awards.", "* Ben Hillier – producer, engineer, percussion", "Category:Albums produced by Ben Hillier"]}, {"page": "Pop (U2 album)", "response": ["* Ben Hillier – programming"]}, {"page": "Read My Lips (Sophie Ellis-Bextor album)", "response": ["*Ben Hillier – producer, programming, piano, drums", "Category:Albums produced by Ben Hillier"]}, {"page": "Betty Boo", "response": ["In 2006, Clarkson formed a pop duo called WigWam, with Alex James, bassist from Blur.  Together, they worked with music producer Ben Hillier, along with former Boo collaborators The Beatmasters. Despite working to create \"an album of experimental yet accessible 21st century pop\", just one single emerged from their musical partnership, the self-titled \"WigWam\" released on 3 April 2006 via Instant Karma Records."]}, {"page": "Tom McRae", "response": ["and forming his first band, \"The Ministers of Orgasm\". Subsequently, McRae was involved in bands \"Raising Cain\" and \"Orchid Lounge\". A chance meeting with recording engineer and record producer Roger Bechirian, (Elvis Costello, Squeeze, Carlene Carter, The Undertones), led to a working relationship. Bechirian helped to shape McRae's soft-spoken sound, which later gained McRae a deal with Dave Bates's db Records (db records). In 2000, director Scott Walker chose McRae to perform at the Meltdown Festival in the Royal Festival Hall. McRae's confessional, self-titled debut appeared in autumn 2001, during the height of the new acoustic movement and earned him comparisons to Nick Drake and Bob Dylan. Critics raved and McRae gained nominations for the Mercury Prize, a Q magazine award and the BRIT Award for Best Newcomer. By then, McRae was working with Oliver (\"Oli\") Kraus, cellist, and in 2003 was joined by Olli Cunningham on keyboards. McRae's second album, Just Like Blood, was released in the UK in February 2003 produced by Ben Hillier, whose credits include Elbow, Martha Wainwright and Blur. McRae then moved to California, where he wrote and recorded his next album, All Maps Welcome, which was released in May 2005."]}, {"page": "Alex James (musician)", "response": ["James worked with Sophie Ellis-Bextor on her solo debut Read My Lips, co-writing and co-producing \"Move This Mountain\", and co-producing \"I Believe\" with Ellis-Bextor and producer Ben Hillier. He also played bass on both tracks. Ellis-Bextor's 2003 album, Shoot from the Hip also featured James as bass player and co-writer on the track \"Love Is It Love\". He also joined his friend and singer-songwriter Betty Boo in a band called WigWam in 2005. In 2009, James appeared as bass player on debut Bad Lieutenant record Never Cry Another Tear. The band consists of New Order lead singer Bernard Sumner and guitarist Phil Cunningham, along with Jake Evans of Rambo And Leroy. In 2013, James co-wrote the song \"Did I Lose You?\", performed by Giorgia and Olly Murs."]}, {"page": "Blur: The Best Of", "response": ["* Ben Hillier – producer, mixing"]}, {"page": "Counting Down the Days", "response": ["Counting Down the Days is the third studio album by Australian singer Natalie Imbruglia. It was released by Brightside Recordings on 4 April 2005 in the United Kingdom. Her debut with the label, Imbruglia reteamed with Gary Clark to work on her next project, but also consulted a wider range of producers to collaborate with her, including Eg White, Martin Harrington, Ben Hillier, Ash Howes, Daniel Johns, David Kosten, Stephen Lipson, Paul Mac, and Ian Stanley.", "* Ben Hillier – production, mixing, piano & dulcimer (track 10)"]}, {"page": "Some Cities", "response": ["Initially, the band set out to record their third album with producer William Orbit. In a February 2005 interview with The Irish Times, vocalist/bassist Jimi Goodwin said, \"Jeff Barrett from our label, Heavenly, suggested we work with William and we were fine with that, we're always up for trying new stuff. But I think we expected too much from him. He was happy just to be in the studio with us because he hadn't worked with a band since Blur. His point was he was just recording what he was hearing. He wasn't doing anything that we wouldn't do ourselves normally and we put a lot of pressure on him almost to subvert us. He's a top guy, but it just didn't work.\" The band subsequently co-produced Some Cities with Ben Hillier, who also mixed the album (except for \"Some Cities\" and \"Walk in Fire\", which were mixed by Rich Costey). Much of the recording occurred at a farmhouse in the English countryside over the course of 2004, except for closing track \"Ambition\", which was recorded in an empty Benedictine monastery in Scotland, which the band had found while doing a photo shoot for the album. The huge reverb effect was achieved using the acoustics of the main hall. The recording process is shown in the mini-documentary Cities Under Construction, featured on the bonus DVD included with the special edition of the album.", "* Produced by Doves and Ben Hillier.", "* Mixed by Ben Hillier and Doves, except \"Some Cities\" and \"Walk in Fire\" mixed by Rich Costey.", "* Engineering and programming by Ben Hillier and Richard Morris.", "* Ben Hillier – percussion on \"Some Cities,\" glockenspiel on \"Snowden,\" and piano and percussion on \"The Storm\"", "Category:Albums produced by Ben Hillier"]}, {"page": "Head Music", "response": ["*Ben Hillier  – engineering"]}, {"page": "Out of Time (Blur song)", "response": ["\"Out of Time\" is a song by British band Blur from their seventh studio album, Think Tank (2003). The song was written and produced by band members Damon Albarn, Alex James and Dave Rowntree, with Ben Hillier also serving as a producer. After being premiered via BBC Radio 1 on 3 March, it was released as the album's lead single on 14 April 2003, by Parlophone. The song became the band's first release without guitarist Graham Coxon. It is a pop ballad featuring acoustic guitars and bass, as well as a Moroccan orchestra. Lyrically, it deals with a civilisation that has lost touch, with Coxon's departure being referenced in the lyrics.", "While in Marakesh, Blur worked with Groupe Regional du Marrakech, who provided orchestral arrangement on \"Out of Time\". According to Ben Hillier, who produced the song, the orchestra's work was \"astonishing\"; he elaborated that \"while I was setting the mics up, they started playing. All the chords sounded fantastic. And I looked out at the end of the session, and none of them had headphones on! What they were playing along to, I have no idea. They must have heard it through the door\". In February 2003, it was revealed that the album would be titled Think Tank and the lead single \"Out of Time\" would be premiered on 3 March, on BBC Radio 1, followed by a commercial release on 14 April 2003, by Parlophone.", "* Ben Hillier – producer, keyboards, samples", "Category:Song recordings produced by Ben Hillier"]}, {"page": "Asleep in the Back", "response": ["*Ben Hillier – Percussion (2), Backing Vocals (10)", "**Ben Hillier and Elbow (2,3,5,6,9,10)", "**Ben Hillier (2,3,4,5,6,9,10,12)", "**Ben Hillier (2,4,5,6,7,9,10,12)", "Category:Albums produced by Ben Hillier"]}, {"page": "Cast of Thousands", "response": ["Category:Albums produced by Ben Hillier"]}, {"page": "Playing the Angel", "response": ["Musically, the album has a much more raw and gritty sound than its predecessor. Gillian Telling of Rolling Stone described the album's sound as featuring \"the band's classic blend of synth-pop beats, heavy guitar riffs and dark lyrics\". The album has been called a more organic record for using more analogue synths than digital ones. In addition, most of the soundscapes presented are harsher and groovier than the more mellow Exciter. Producer Ben Hillier said that the verses on opening track \"A Pain That I'm Used To\" were extremely difficult to get right and Gore believed that the intro was also extremely difficult. According to Hillier, the choruses came together very well. Gore also told Keyboard Magazine that he had been listening to a lot of gospel music and that it directly inspired the track \"John The Revelator\" though the track strays far from its inspiration. Hillier also recalled that the tracks \"Suffer Well\" and \"The Sinner in Me\" were massively changed from their original demos. \"Nothing's Impossible\" was also massively changed from its demo and was transformed into one of the heaviest and more distorted songs on the album. The demo version of \"Nothing's Impossible\" appears on the deluxe edition of Sounds of The Universe.", "* Ben Hillier – production, mixing, engineering", "Category:Albums produced by Ben Hillier"]}, {"page": "Electricity (Suede song)", "response": ["The band re-emerged with \"Electricity\" after nearly two years away from the public eye. For the first time, synthesizers are used as a primary part of a song, working in parallel with the distorted guitar as opposed to just providing backing. The single helped guide the band's new direction, as evident in the fact that synths were also heavily used on Head Music. According to the song's co-writer Neil Codling, it is \"hard-edged, spiky and more like the last album than anything else on this one.\" According to singer Brett Anderson, it is just a \"simple love song.\" On the choice of the album's lead single, he said: \"it was either going to be this or ‘Savoir Faire’. There are about five singles on the album, so in the end I couldn’t really tell which one should be first. It was pretty much flip a coin or roll some dice.\" However, there was in fact another contender for first single. Both \"Electricity\" and the title track \"Head Music\" were played to Sony A&R personnel around the world, who voted in favour of what they felt was the \"safer\" choice in \"Electricity\". The latter track ultimately was not chosen as a single from the album. \"Electricity\" was produced by Steve Osborne, \"Popstar\" and \"See That Girl\" were produced by Ben Hillier while \"Waterloo\" was produced by Bruce Lampcov.", "Category:Song recordings produced by Ben Hillier"]}, {"page": "Good Song", "response": ["* \"Good Song\", \"Me, White Noise\" (alternate version) and \"Morricone\" produced by Blur and Ben Hillier", "* Ben Hillier: Turntables", "Category:Song recordings produced by Ben Hillier"]}, {"page": "Precious (Depeche Mode song)", "response": ["* Ben Hillier – production, mixing, engineering", "Category:Song recordings produced by Ben Hillier"]}, {"page": "Just Like Blood", "response": ["* Ben Hillier – percussion (1, 2, 4, 10), drums (2, 4, 9), organ (2, 7), sitar (4), ARP synthesizers (7), Memory Man effects pedal (7), banjo (8)", "Category:Albums produced by Ben Hillier"]}, {"page": "A Pain That I'm Used To", "response": ["Category:Song recordings produced by Ben Hillier"]}, {"page": "Suffer Well", "response": ["Category:Song recordings produced by Ben Hillier"]}, {"page": "Music Is My Radar", "response": ["*\"Music Is My Radar\" produced by Blur and Ben Hillier", "Category:Song recordings produced by Ben Hillier"]}, {"page": "Walking with Thee", "response": ["*Ben Hillier – production", "Category:Albums produced by Ben Hillier"]}, {"page": "WigWam (duo)", "response": ["WigWam were an English pop duo, comprising Alex James, the bassist from Blur, and vocalist Betty Boo.WigWam - Betty Boo meets Blur's Alex James With record producer Ben Hillier, and former Boo collaborators Beatmasters, WigWam were said to be creating an album which they described as \"experimental yet accessible 21st century pop\". However, James did not mention the project in his 2007 autobiography, and it is considered defunct."]}, {"page": "News and Tributes", "response": ["With this album The Futureheads garnered comparisons to Blur, and particularly the album Modern Life Is Rubbish. It was produced by Ben Hillier, who has also produced for Blur and Depeche Mode. Singer/lyricist/guitarist Barry Hyde has revealed recently that second single \"Worry About It Later\" concerns \"...modern attitudes towards casual sex\".", "Category:Albums produced by Ben Hillier"]}, {"page": "John the Revelator / Lilian", "response": ["Category:Song recordings produced by Ben Hillier"]}, {"page": "Black and White Town", "response": ["Category:Song recordings produced by Ben Hillier"]}, {"page": "Cathy Davey", "response": ["Davey's debut album, Something Ilk, was recorded at a studio in Wales, produced by Ben Hillier whose previous credits included Blur and Elbow, and released in 2004. RTÉ reviewer Harry Guerin said it was \"high on presence and very low on filler\" and gave it three out of five stars. Hot Press remarked, \"Not only is her voice elfin, immediate and distinct the songs are also hugely compelling. They are digestible without being lightweight, austere in places without seeming detached\". The Irish Independents Paul Byrne described it as \"one of the best Irish albums of 2004\". Davey performed a nationwide tour in September 2004. She also supported Graham Coxon and Supergrass during tours they undertook that year. The singer later dismissed Something Ilk, saying \"I think the record company [EMI's Regal Recordings] thought I was an indie rock chick when they signed me and that album is very much other people's idea of what I should sound like. [...] I didn't have the confidence to say no to some of the things [Ben Hillier] suggested\". Davey claimed not to \"know my arse from my elbow when I signed for them\" and did not like performing those songs in a live arena. Despite this, the Irish Independent described her as \"very talented—far more so than [Gemma] Hayes\" but regretted that she had \"failed to find an audience for her fine debut Something Ilk\"."]}, {"page": "Martyr (song)", "response": ["Category:Song recordings produced by Ben Hillier"]}, {"page": "49th Annual Grammy Awards", "response": ["**Ben Hillier, producer; Steve Fitzmaurice & Ben Hillier, mixers (Depeche Mode)"]}, {"page": "Hillier", "response": ["* Ben Hillier, British songwriter and  producer"]}, {"page": "Strange House", "response": ["Category:Albums produced by Ben Hillier"]}, {"page": "Come Clean (Curve album)", "response": ["* Ben Hillier – additional drum programming on \"Killer Baby\"", "* Ben Hillier – engineering on \"Chinese Burn\", \"Coming Up Roses\" and \"Dirty High\", mixing (assistant) on \"Chinese Burn\""]}, {"page": "Q Awards", "response": ["** Blur / Ben Hillier (Blur — Think Tank)"]}, {"page": "Snowden (song)", "response": ["Category:Song recordings produced by Ben Hillier"]}, {"page": "Sky Starts Falling", "response": ["Category:Song recordings produced by Ben Hillier"]}, {"page": "Miloco Studios", "response": ["When Milo Music bought Orinoco in 2000, the Miloco name was created. 2006 saw Miloco open three new studios. The first was the former Innovation Studios on Highbury Corner in North London, renamed ‘The Yard’ after the road on which it is, Swan Yard. After opening The Yard came the addition of dance producer and DJ Pete Heller's Kentish Town studio, Musikbox, and then producer Ben Hillier built a unique live tracking studio in the former Orinoco building, which is now called The Pool."]}, {"page": "St. Jude (album)", "response": ["Category:Albums produced by Ben Hillier"]}, {"page": "Rascalize", "response": ["Recorded with producer Ben Hillier (The Horrors, Blur, Elbow) in London, released through Deltasonic.", "*Ben Hillier – producer", "Category:Albums produced by Ben Hillier"]}, {"page": "Wrong (Depeche Mode song)", "response": ["Category:Song recordings produced by Ben Hillier"]}, {"page": "Animals (Sparkadia song)", "response": ["Category:Song recordings produced by Ben Hillier"]}]}}