{"wiki_id": "http://www.wikidata.org/entity/Q2659427", "itemLabel": "John Chapman", "itemDescription": "Roman Catholic priest and Abbot of Downside Abbey", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Chapman_(priest)", "wikipedia_page": {"main": "John Chapman  (25 April 1865 – 7 November 1933) was an English Roman Catholic priest, received into the Roman Catholic Church at the age of 25, the 4th Abbot of Downside Abbey of the English Benedictine Congregation from 1929 until his death, and a New Testament and patristics scholar.\nHe is best known for having founded one of the independent schools in Britain: Worth, in West Sussex.\n\n", "link_mentions": [{"page": "Oxford Movement", "response": ["*John Chapman, patristic scholar and Roman Catholic priest."]}, {"page": "John Chapman", "response": ["John Chapman may refer to:", "*John Chapman (Leicester MP) represented Leicester (UK Parliament constituency)", "*Sir John Chapman, 2nd Baronet (c. 1710–1781), British Member of Parliament for Taunton, 1741–1747", "*John Chapman (1810–1877), British Member of Parliament for Grimsby, 1862–1865 and 1874–1877", "*John Chapman (congressman) (1740–1800), United States Representative from Pennsylvania", "*John Chapman Andrew (1822–1907), Member of Parliament in New Zealand", "*John Chapman (Australian politician) (1879–1931), Australian Senator", "*John Chapman (theologian) (1704–1784), English cleric and scholar", "*John Chapman (engineer) (1801–1854), English political and economic writer", "*John Chapman (screenwriter) (1927–2001), English playwright and screenwriter", "*John Chapman (baseball) (1899–1953), former shortstop", "*John Chapman (cricketer, born 1877) (1877–1956), English cricketer", "*John Chapman (cricketer, born 1814) (1814–1896), English cricketer", "*John Chapman (New Zealand cricketer) (1865-1949), New Zealand cricketer", "*John Chapman (football manager) (1882–1948), footballer and manager", "*John Chapman (rugby league), Australian rugby league player", "*John Chapman (harness racing) (1928–1980), Canadian driver", "*John Chapman (priest) (1865–1933), British priest, abbot, and religious scholar", "*John Chapman (evangelist) (1930–2012), Australian evangelist", "*John Chapman (bishop), Anglican bishop in Canada", "*Johnny Appleseed (John Chapman, 1774–1845), pioneer nurseryman and missionary", "*John Chapman (publisher) (1821–1894), publisher of the Westminster Review", "*John Chapman (Medal of Honor) (1844–1905), French soldier who fought in the American Civil War", "*John Chapman (general) (1896–1963), Australian Army general of WWII", "*John Chapman (artist) (born 1946), British artist", "*John Chapman (producer), British television producer"]}, {"page": "Johannine Comma", "response": ["Priscillian was probably a Sabellianist or Modalist Monarchian.For an alternate view, and explanation of the terms, see Was Priscillian a Modalist Monarchian? by Tarmo Toom Some interpreters have theorized that Priscillian created the Comma Johanneum. However, there are signs of the Comma Johanneum, although no certain attestations, even before Priscillian\".Georg Strecker, The Johannine Letters (Hermeneia); Minneapolis: Fortress Press, 1996. ‘Excursus: The Textual Tradition of the \"Comma Johanneum\"’. And Priscillian in the same section references The Unity of the Church section from Cyprian.John Chapman Notes on the Early History of the Vulgate Gospels (1908) p. 264 In the early 1900s the Karl Künstle theory of Priscillian origination and interpolation was popular: \"The verse is an interpolation, first quoted and perhaps introduced by Priscillian (a.d. 380) as a pious fraud to convince doubters of the doctrine of the Trinity.\"Preserved Smith Erasmus, A Study Of His Life, Ideals And Place In History, p.165, 1st ed. 1923. However, Priscillian is generally considered as non-Trinitarian. The Künstle idea was more nuanced. William Edie summarizes \"To Priscillian, therefore, in all probability, must be attributed the origin of the gloss in this its original and heretical form. Afterwards it was brought into harmony with the orthodox doctrine of the Trinity by the omission of the words in Christo Jesu and the Substitution of tres for tria.\" The Review of Theology and Philosophy The Comma Joanneum p.169, 1906. The accusation of a Trinitarian heresy by Priscillian was not in the charges that led to the execution of Priscillian and six followers; we see this in the later 5th-century writings.", "John Chapman looked closely at these materials and the section in Liber Apologeticus around the Priscillian faith statement \"Pater Deus, Filius, Deus, et Spiritus sanctus Deus; haec unum sunt in Christo Iesu\". Chapman saw an indication that Priscillian found himself bound to defend the comma by citing from the \"Unity of the Church\" Cyprian section.\"It seems plain that the passage of St, Cyprian was lying open before the Priscillianist author of the Creed (Priscillian himself?) because he was accustomed to appeal to it in the same way. In Priscillian's day St. Cyprian had a unique position as the one great Western Doctor.\" John Chapman,  Notes on the Early History of the Vulgate Gospels, 1908, p.264"]}, {"page": "Worth Abbey", "response": ["Worth Abbey is a daughter house of the monastic community of Downside Abbey, in Somerset. The first monastic community of 17 monks was founded in September 1933 in the property formerly known as \"Paddockhurst\", near Turners Hill village, by Abbot John Chapman of Downside. Worth was a dependent priory of Downside from 1933-1957. The conditions of sale of the property laid down that the name \"Paddockhurst\" should not be used by the new owners. Because the priory lay within the boundaries of Worth parish, the name \"Worth\" was chosen for the site. The first prior of Worth, Dom Anselm Rutherford, chose \"Our Lady, Help of Christians\", as the patron of the new monastery."]}, {"page": "Worth School", "response": ["In 1933 the Paddockhurst country estate of Lord Cowdray was purchased by Downside Abbey. John Chapman, Abbot of Downside, relocated the junior school to the estate, thus establishing a preparatory school for boys aged 7 to 13 named Worth Priory.Condon, Ian; A House Called Paddockhurst: A Short History of Worth's Victorian Mansion. Worth School (February 2010) pg 9 This school, set in the mansion house of Paddockhurst, was a junior school for Downside School. Having 60 pupils at foundation, numbers rose to 100 in 1939 when the school was evacuated and moved to Downside Abbey for the duration of the Second World War. In 1957 pupil numbers rose to 256, the school becoming the second largest preparatory school in the country."]}, {"page": "Ashfield cum Thorpe", "response": ["*John Chapman (1865-1933), Roman Catholic priest born in the village who was the 4th Abbot of Downside Abbey and founded Worth School in West Sussex."]}, {"page": "List of Christian mystics", "response": ["* John Chapman (1865–1933)"]}, {"page": "John Chapman OSB", "response": ["#REDIRECT John Chapman (priest)"]}, {"page": "Bernard Orchard", "response": ["After graduating Orchard taught initially at a preparatory school before in 1932 taking the monastic habit at Downside Abbey, adopting the name Bernard; he was subsequently ordained as a Roman Catholic priest in 1939. At Downside he both taught at the school, took the role of choirmaster and began his career as a biblical scholar under the tutelage of Abbots John Chapman and Christopher Butler. From 1943 he took advantage of Divino afflante Spiritu, the papal encyclical of Pope Pius XII, which for the first time permitted modern methods of biblical criticism to be employed by Catholics, to embark upon A Catholic Commentary on Holy Scripture, eventually published in 1951."]}, {"page": "Chapman (surname)", "response": ["*Johnny Appleseed or John Chapman (1774–1847), American pioneer orchardist and Swedenborgian Christian missionary", "*John Chapman (artist) (born 1946), British artist", "*John Chapman (screenwriter), (1927–2010), English playwright, screenwriter and scriptwriter", "*John Chapman (footballer), English manager of Manchester United football team", "*John Chapman (congressman) (1740–1800), American Federalist Party politician", "*John Chapman (priest) (1865–1933), British Roman Catholic priest", "*John Chapman (publisher) (1821–1894), British publisher and physician", "*Joseph John Chapman (1784-1849), California pioneer"]}, {"page": "List of alumni of Christ Church, Oxford", "response": ["* John Chapman (1865–1933), abbot of Downside Abbey and founder of Worth School."]}]}}