{"wiki_id": "http://www.wikidata.org/entity/Q26503631", "itemLabel": "Alexander Mitchell Donnet", "itemDescription": "Scottish trade unionist and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Mitchell_Donnet", "wikipedia_page": {"main": "Alexander Mitchell Donnet, Baron Donnet of Balgay (26 June 1916 – 14 May 1985) was a Scottish trade unionist.\nDonnet grew up in Dundee, where he attended the Harris Academy.  He joined the National Union of General and Municipal Workers in 1935 and, in 1959, was appointed as the union's full-time regional officer for Scotland, and from 1970 until 1976 was also the union's national chairman.Donnet became active in the Scottish Trades Union Congress (STUC), and was elected as its president for 1970/71.  In 1972, he was for the first time elected to the General Council of the Trades Union Congress (TUC), serving for four years.  He also served on the Commission on the Constitution, Scottish Economic Council, Forestry Commission, Price Commission and Scottish Transport Group.In 1978, Donnet retired from his trade union posts and received a life peerage being created Baron Donnet of Balgay, of Balgay in the District of the City of Dundee on 19 May 1978.  He spent two years chairing the Scottish Transport Group, and also took up a place on the Scottish Development Agency.  He fully retired in 1982, and died three years later.\n\n", "link_mentions": [{"page": "List of life peerages (1958–1979)", "response": ["|Alexander Mitchell Donnet"]}, {"page": "Alex M. Donnet", "response": ["#REDIRECT Alexander Mitchell Donnet"]}, {"page": "Alexander Donnet, Baron Donnet of Balgay", "response": ["#REDIRECT Alexander Mitchell Donnet"]}, {"page": "Baron Donnet of Balgay", "response": ["#REDIRECT Alexander Mitchell Donnet"]}, {"page": "Baron Donnet", "response": ["#REDIRECT Alexander Mitchell Donnet"]}, {"page": "Alexander Donnet", "response": ["#REDIRECT Alexander Mitchell Donnet"]}, {"page": "Alexander Donnet, Baron Donnet", "response": ["#REDIRECT Alexander Mitchell Donnet"]}]}}