{"wiki_id": "http://www.wikidata.org/entity/Q2651525", "itemLabel": "John Fenning", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Fenning", "wikipedia_page": {"main": "John Reginald Keith Fenning (23 June 1885 – 3 January 1955) was a British doctor and rower who competed in the 1908 Summer Olympics.Fenning was born in Fulham, London. He entered London Hospital Medical College in January 1904 but it took him thirteen years to complete his course. He became a rower for Leander Club. He partnered Gordon Thomson at bow in the coxless pairs to win the gold medal for Great Britain rowing at the 1908 Summer Olympics. Later in the same afternoon he and Thomson were in the Leander coxless four with Philip Filleul and Harold Barker which won a silver medal, losing to the Magdalen College, Oxford crew.After he qualified in 1927, Fenning initially practiced in the Home Counties but in 1937, he moved to the Midlands. Fenning died at Coventry at the age of 69.", "link_mentions": [{"page": "Barts and The London School of Medicine and Dentistry", "response": ["* John Fenning – British doctor and Olympic gold medallist"]}, {"page": "Rowing at the 1908 Summer Olympics", "response": ["|Philip FilleulHarold BarkerJohn FenningGordon Thomson"]}, {"page": "Brands Hatch", "response": ["The Club Circuit had six meeting during 1962, and witnessed the coming of Formula Junior. At the Easter Monday meeting, a Formula Junior race saw the lap record tumble to 55.6secs and the first-ever 80 mph lap (actual speed was 80.29 mph) by John Fenning, abroad a Lotus 20-Ford. The 'Trio' meeting in July saw the end of an era when a 500 took the chequered flag for the last time with Mike Ledbrook, driving a Cooper-Norton Mark 8 in the 500 and 250cc race. At the Boxing Day meeting, Hulme won the Formula Junior race driving the prototype Brabham BT6-Ford, setting a new outright lap record at 54.8secs (82.06 mph)."]}, {"page": "Reims-Gueux", "response": ["| style=\"padding-left: 7px\"|  John Fenning"]}, {"page": "Rowing at the 1908 Summer Olympics – Men's coxless pair", "response": ["|align=center| 1 || John Fenning || Gordon Thomson || ", "|align=center| 1 || John Fenning || Gordon Thomson ||  ||align=center| 9:46.0", "|align=center| 1 || John Fenning || Gordon Thomson ||  ||align=center| 9:41.0"]}, {"page": "Rowing at the 1908 Summer Olympics – Men's coxless four", "response": ["|align=center| 2 || Philip Filleul || Harold Barker  John Fenning || Gordon Thomson || ", "|align=center| 1 || Philip Filleul || Harold Barker  John Fenning || Gordon Thomson ||  ||align=center| 9:04.0", "|align=center| 2 ||  Philip Filleul || Harold Barker  John Fenning || Gordon Thomson ||  ||align=center| Unknown"]}, {"page": "Great Britain at the 1908 Summer Olympics", "response": ["| , John Fenning,Philip Filleul, Gordon Thomson || Rowing", "|rowspan=2 align=left| Men's coxless pair ||bgcolor=gold| 1st ||align=left| John Fenning  Gordon Thomson ||rowspan=2 colspan=2 bgcolor=lightgray| None held || 9.46  1st, semifinal 1 || 9.41", "|bgcolor=silver| 2nd ||align=left| Philip Filleul, Harold Barker,  John Fenning, Gordon Thomson || 9.4  1st, semifinal 2 || Unknown"]}, {"page": "List of Olympic medalists in rowing (men)", "response": ["|Philip FilleulHarold BarkerJohn FenningGordon Thomson"]}, {"page": "Philip Filleul", "response": ["Filleul was born at Bath, Somerset. He was strokeman in the Leander coxless four with John Fenning, Gordon Thomson and Harold Barker which won a silver medal for Great Britain rowing at the 1908 Summer Olympics, and lost to the Magdalen College, Oxford crew.Sports Reference Olympic Sports – Philip Filleul"]}, {"page": "Harold Barker", "response": ["Barker was born at Marylebone, London. He was educated at Christ Church, Oxford and was a member of the Oxford crew in the Boat Race in 1908. He also won the Silver Goblets at Henley Royal Regatta in 1908, partnering Albert Gladstone to beat Julius Beresford and Karl Vernon.  He was then a member of  the Leander coxless four with Philip Filleul, John Fenning and Gordon Thomson which won a silver medal for Great Britain rowing at the 1908 Summer Olympics and which lost to the Magdalen College, Oxford crew.Sports Reference Olympic Sports – Harold Barker Barker rowed again in the Oxford crew in the Boat Race in 1909."]}, {"page": "Gordon Thomson (rower)", "response": ["Thomson partnered John Fenning at stroke in the coxless pairs to win the gold medal for Great Britain rowing at the 1908 Summer Olympics. Later in the same afternoon he and Fenning were in the Leander coxless four with Philip Filleul and Harold Barker which won a silver medal, losing to the Magdalen College, Oxford crew."]}]}}