{"wiki_id": "http://www.wikidata.org/entity/Q266402", "itemLabel": "Eva Le Gallienne", "itemDescription": "British actress (1899-1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eva_Le_Gallienne", "wikipedia_page": {"main": "Eva Le Gallienne (January 11, 1899 – June 3, 1991) was a British-born American stage actress, producer, director, translator, and author. A Broadway star by age 21, Le Gallienne gave up her Broadway appearances to devote herself to founding the Civic Repertory Theatre, in which she was both director, producer, and lead actress. Noted for her boldness and idealism, she became a pioneering figure in the American repertory movement, which enabled today's off-Broadway. A versatile and eloquent actress herself (playing roles ranging from Peter Pan to Hamlet), Le Gallienne also became a respected stage director, coach, producer and manager.\nLe Gallienne consciously devoted herself to the art of the theater as opposed to the show business of Broadway and dedicated herself to upgrading the quality of the stage. She ran the Civic Repertory Theatre Company for 10 years (1926–1936), producing 37 plays during that time. She managed Broadway's 1100-seat Civic Repertory Theatre at 107 West 14th Street (formerly the Fourteenth Street Theatre) from 1926 to 1932, which was home to her company whose actors included herself, Burgess Meredith, John Garfield, Norman Lloyd, J. Edward Bromberg, Paul Leyssac, Florida Friebus, David Manners, and Leona Roberts.\n\n", "link_mentions": [{"page": "Henrik Ibsen", "response": ["*Eight Plays, translated by Eva Le Gallienne (Modern Library, 1982)."]}, {"page": "January 11", "response": ["*1899 – Eva Le Gallienne, English-American actress, director, and producer (d. 1991)"]}, {"page": "Peter Falk", "response": ["While working in Hartford, Falk joined a community theater group called the Mark Twain Masquers, where he performed in plays that included The Caine Mutiny Court-Martial, The Crucible, and The Country Girl by Clifford Odets. Falk also studied with Eva Le Gallienne, who was giving an acting class at the White Barn Theatre in Westport, Connecticut. Falk later recalled how he \"lied his way\" into the class, which was for professional actors. He drove down to Westport from Hartford every Wednesday, when the classes were held, and was usually late. In his 1997 interview with Arthur Marx in Cigar Aficionado Magazine, Falk said of Le Gallienne: \"One evening when I arrived late, she looked at me and asked, 'Young man, why are you always late?' and I said, 'I have to drive down from Hartford.'\" She looked down her nose and said, \"What do you do in Hartford? There's no theater there. How do you make a living acting?\" Falk confessed he was not a professional actor. According to him Le Gallienne looked at him sternly and said: \"Well, you should be.\" He drove back to Hartford and quit his job. Falk stayed with the Le Gallienne group for a few months more, and obtained a letter of recommendation from Le Galliene to an agent at the William Morris Agency in New York. In 1956, he left his job with the Budget Bureau and moved to Greenwich Village to pursue an acting career."]}, {"page": "1930s", "response": ["* Eva Le Gallienne"]}, {"page": "1920s", "response": ["* Eva Le Gallienne"]}, {"page": "1991", "response": ["* June 3 – Eva Le Gallienne, English-born actress (b. 1899)"]}, {"page": "1899", "response": ["* January 11 – Eva Le Gallienne, English actress (d. 1991)"]}, {"page": "Alice's Adventures in Wonderland", "response": ["As the book and its sequel are Carroll's most widely recognised works, they have also inspired numerous live performances, including plays, operas, ballets, and traditional English pantomimes. These works range from fairly faithful adaptations to those that use the story as a basis for new works. Actress Eva Le Gallienne adapted both Alice books for the stage in 1932; this production has been revived in New York in 1947 and 1982. Joseph Papp staged Alice in Concert at the Public Theater in New York City in 1980. Elizabeth Swados wrote the book, lyrics, and music. Based on both Alice's Adventures in Wonderland and Through the Looking-Glass, Papp and Swados had previously produced a version of it at the New York Shakespeare Festival. Meryl Streep played Alice, the White Queen, and Humpty Dumpty. The cast also included Debbie Allen, Michael Jeter, and Mark Linn-Baker. Performed on a bare stage with the actors in modern dress, the play is a loose adaptation, with song styles ranging the globe. A community theatre production of Alice was Olivia de Havilland's first foray onto the stage."]}]}}