{"wiki_id": "http://www.wikidata.org/entity/Q2662556", "itemLabel": "Ajayi Crowther", "itemDescription": "Yoruba linguist and the first African Anglican bishop in Nigeria (1809-1891)", "wikipedia_url": "https://en.wikipedia.org/wiki/Samuel_Ajayi_Crowther", "wikipedia_page": {"main": "Samuel Ajayi Crowther (c. 1809–31 December 1891), was a Nigerian linguist, clergyman, and the first African Anglican bishop of West Africa. Born in Osogun (in what is now Ado-Awaye, Oyo State, Nigeria), he and his family were captured by slave raiders when he was about twelve years old. This took place during the Yoruba civil wars, notably the Owu wars of (1821-1829),where his village Oshogun was sacked. Ajayi was later on resold to Portuguese slave dealers, where he was put on board to be transported to the New World through the Atlantic.\nCrowther was freed from slavery at a coastal port by the Royal Navy's West Africa Squadron, which was enforcing the British ban against the Atlantic slave trade. The liberated peoples were resettled in Sierra Leone. In Sierra Leone, Ajayi adopted an English name of Samuel Crowther, and began his education in English. He adopted Christianity and also identified with Sierra Leone's then ascendant Krio ethnic group. He studied languages and was ordained as a minister in England, where he later received a doctoral degree from Oxford University. He prepared a Yoruba grammar and translation of the Anglican Book of Common Prayer into Yoruba, also working on a Yoruba version of the Bible, as well as other language projects.", "link_mentions": [{"page": "December 31", "response": ["*1891 – Samuel Ajayi Crowther, Nigerian bishop and linguist (b. 1809)"]}, {"page": "Nigeria", "response": ["Britain intervened in the Lagos kingship power struggle by bombarding Lagos in 1851, deposing the slave-trade-friendly Oba Kosoko, helping to install the amenable Oba Akitoye and signing the Treaty between Great Britain and Lagos on 1January 1852. Britain annexed Lagos as a crown colony in August 1861 with the Lagos Treaty of Cession. British missionaries expanded their operations and travelled further inland. In 1864, Samuel Ajayi Crowther became the first African bishop of the Anglican Church.Peterson, Derek R., ed., Abolitionism and imperialism in Britain, Africa, and the Atlantic (Ohio University Press, 2010)."]}, {"page": "Proverb", "response": ["File:Bishop Samuel Ajayi Crowther.png|Bishop Samuel Ajayi Crowther (c.1809-1891)", "In the 19th century, a growing number of scholars published collections of proverbs, such as Samuel Adalberg who published collections of Yiddish proverbs (1888 & 1890) and Polish proverbs (1889–1894). Samuel Ajayi Crowther, the Anglican bishop in Nigeria, published a collection of Yoruba proverbs (1852). Elias Lönnrot published a collection of Finnish proverbs (1842)."]}, {"page": "Sierra Leone", "response": ["In the early 19th century, Freetown served as the residence of the British colonial governor of the region, who also administered the Gold Coast (now Ghana) and the Gambia settlements. Sierra Leone developed as the educational centre of British West Africa. The British established Fourah Bay College in 1827, which rapidly became a magnet for English-speaking Africans on the West Coast. For more than a century, it was the only European-style university in western Sub-Saharan Africa. Samuel Ajayi Crowther was the first student to be enrolled at Fourah Bay. Fourah Bay College soon became a magnet for Sierra Leone Creoles and other Africans seeking higher education in British West Africa. These included Nigerians, Ghanaians, Ivorians and many more, especially in the fields of theology and education. It was the first western-style university in West Africa. Under colonial rule, Freetown was known as the \"Athens of Africa\" due to the large number of excellent schools in Freetown and surrounding areas. Nwauwa, Apollos O. (2003) Book review: \"The Athens of West Africa: A History of International Education at Fourah Bay College, Freetown, Sierra Leone by Daniel J.  Paracka Jr. New York: Routledge\". Comparative Education Review, Vol 49(4). Archived. Retrieved 29 October 2021."]}, {"page": "1809", "response": ["* Samuel Ajayi Crowther, 1st Black Anglican Bishop, pioneer linguist (d. 1891)"]}, {"page": "1891", "response": ["* December 31 – Samuel Ajayi Crowther, 1st African Anglican bishop, linguist and legendary missionary (b. 1809)"]}, {"page": "Igbo language", "response": ["The first book to publish Igbo terms was History of the Mission of the Evangelical Brothers in the Caribbean (), published in 1777.  Shortly afterwards in 1789, The Interesting Narrative of the Life of Olaudah Equiano was published in London, England, written by Olaudah Equiano, a former slave, featuring 79 Igbo words.  The narrative also illustrated various aspects of Igbo life in detail, based on Equiano's experiences in his hometown of Essaka. Following the British Niger Expeditions of 1854 and 1857, a Yoruba priest, Samuel Ajayi Crowther, assisted by a young Igbo interpreter named Simon Jonas, produced a primer for the Igbo language in 1857."]}, {"page": "Freetown", "response": ["Freetown is home to Fourah Bay College, the oldest university in West Africa, founded in 1827. The university played a key role in Sierra Leone's colonial history. The college's first student, Samuel Ajayi Crowther, went on to be named as the first indigenous Bishop of West Africa. National Railway Museum has a coach car built for the state visit of Elizabeth II in 1961. The Big Market on Wallace Johnson Street is the showcase for local artisans' work."]}, {"page": "Eshu", "response": ["From the time of the first English translations of Yorùbá words in the mid nineteenth century, Èṣù has been rendered as \"devil\" or \"satan\". The first known instance of this came from Samuel Ajayi Crowther's \"Vocabulary of the Yoruba\" (1842) where his entries for \"Satan\" and \"Devil\" had Eshu in English. Subsequent dictionaries over the years have followed suit, permeating popular culture and Yorùbá societies as well. Lately, many online campaigns have been set up to protest this, and many activists have worked to correct it. There have also been quite a number of academic work examining the mistranslation."]}, {"page": "Sara Forbes Bonetta", "response": ["Captain Davies was a Yoruba businessman of considerable wealth, and after their wedding the couple moved back to their native Africa, where they had three children: Victoria Davies (1863), Arthur Davies (1871), and Stella Davies (1873). Sara Forbes Bonetta continued to enjoy such a close relationship with Queen Victoria that she and Bishop Samuel Ajayi Crowther were the only Lagos indigènes the Royal Navy had standing orders to evacuate in the event of an uprising in Lagos. Victoria Matilda Davies, Bonetta's first daughter, was named after Queen Victoria, who was also her godmother. She married the successful Lagos doctor Dr. John Randle, becoming the stepmother of his son, Nigerian businessman and socialite J. K. Randle. Bonetta's second daughter Stella Davies and Herbert Macaulay, the grandson of Samuel Ajayi Crowther, had a daughter together: Sarah Abigail Idowu Macaulay Adadevoh, named after her maternal grandmother Sara and her paternal grandmother Abigail. A descendant of Sara's through her line was the Ebola heroine Ameyo Adadevoh. Many of Sara's other descendants now live in either Britain or Sierra Leone; a separate branch, the Randle family of Lagos, remains prominent in contemporary Nigeria."]}, {"page": "Church of Nigeria", "response": ["Christianity came to Nigeria in the 15th century through Augustinian and Capuchin monks from Portugal. The first mission of the Church of England was, though, only established in 1842 in Badagry by Henry Townsend. In 1864 Samuel Ajayi Crowther, an ethnic Yoruba and former slave, was elected Bishop of the Niger and the first black Bishop of the Anglican Communion. Lagos became a diocese of its own in 1919.", "In 2005, as one of the goals of the Vision of the Church of Nigeria, the church-owned Ajayi Crowther University in Oyo was granted license to operate as a private university in Nigeria on 7 January 2005."]}, {"page": "Yoruba language", "response": ["* Samuel Ajayi Crowther"]}, {"page": "Bromley", "response": ["On 3 June 1952, the Duchess of Kent laid the foundation stone of the present church, which was designed by T W G Grant and built by David Nye. Besides the tower, other parts of the fabric of the original church were used in the rebuilding. Inside there are some interesting monuments: to Samuel Ajayi Crowther, John Cole Patteson and Vedanayagam Samuel Azariah, who were all bishops in the Commonwealth."]}, {"page": "Onitsha", "response": ["In 1857 British palm oil traders established a permanent station in the city with Christian missionaries joining them, headed by the liberated African bishop Samuel Ajayi Crowther (a Yoruba recaptive) and Reverend John Taylor (an Igbo Recaptive).."]}, {"page": "Samuel Adjai Crowther", "response": ["#REDIRECT Samuel Ajayi Crowther"]}, {"page": "Oyo State", "response": ["The first degree awarding institution in Nigeria is the University of Ibadan (established as a college of the University of London when it was founded in 1948, and later converted into an autonomous university in 1962). The other universities in the state are: Lead City University, Ibadan, Ajayi Crowther University, Oyo, Koladaisi University, Dominican University, Ibadan, Dominion University and Ladoke Akintola University of Technology, Ogbomoso. The Polytechnic, Ibadan, Oyo State College of Agriculture and Technology Igbo Ora, Adeseun Ogundoyin Polytechnic Eruwa are located in Oyo State.", "* Ajayi Crowther University, Oyo", "*Samuel Ajayi Crowther, priest and historian"]}, {"page": "List of Nigerians", "response": ["* Samuel Ajayi Crowther"]}, {"page": "Herbert Macaulay", "response": ["Herbert Macaulay was born in Broad Street, Lagos, on 14 November 1864 to the family of Thomas Babington Macaulay and Abigail Crowther. His parents were children of people captured from what is now Nigeria, resettled in Sierra Leone by the British West Africa Squadron, and eventual returnees to present day Nigeria. Thomas Babington Macaulay was one of the sons of Ojo Oriare while Abigail Crowther was the daughter of Bishop Samuel Ajayi Crowther, a descendant of King Abiodun. Thomas Babington Macaulay was the founder of the first secondary school in Nigeria, the CMS Grammar School, Lagos.", "Prior to the beginning of the twentieth century, Macaulay associated with many Lagos socialites, worked as a private surveyor and had a moderate outlook about colonialism. However, by the end of the 1900s, he had begun to veer from his professional and social activities to become a political activist. He joined the Anti-Slavery and Aborigines' Protection Society. Macaulay was an unlikely champion of the masses. A grandson of Ajayi Crowther, the first African bishop of the Niger Territory, he was born into a Lagos that was divided politically into groups arranged in a convenient pecking order – the British authorities who lived in the posh Marina district, the Saros and other slave descendants who lived to the west, and the Brazilians who lived behind the whites in the Portuguese Town. Behind all three lived the real Lagosians, the masses of indigenous Yoruba people, disliked and generally ignored by their privileged neighbours. It was not until Macaulay's generation that the Saros and Brazilians even began to contemplate making common cause with the masses."]}, {"page": "Samuel Johnson (Nigerian historian)", "response": ["Samuel Johnson was born a recaptive Creole in Freetown, Sierra Leone, as the third of seven children of Henry Erugunjinmi Johnson and Sarah Johnson on June 24, 1846. His father, who gave himself the  Yoruba name Erugunjinmi, was born in 1810 in the town of Oyo-Ile, capital of the Oyo Empire. Henry was an Omoba (prince) of the Oyo clan, and was a grandson of the 18th-century alaafin (king) Abiodun. He was later captured in the Atlantic Slave Trade but fortunately was rerouted to Sierra Leone, like many Yorubas, such as Samuel Ajayi Crowther (his distant cousin) and others. He later met Samuel Johnson, whose name he gave to his son. Johnson had 2 older brothers, Henry and Nathaniel, and a younger brother, Obadiah. Henry and Nathaniel both became missionaries and archdeacons like Samuel, while Obadiah became the first indigenous Yoruba medical doctor. He completed his education at the Church Missionary Society (CMS) Training Institute and subsequently taught during what became known as the Yoruba civil war."]}, {"page": "Abiodun (Oyo ruler)", "response": ["His son Alaafin Atiba was the founder of the ruling dynasty in the present Oyo. His grandson Cândido da Fonseca Galvão, under the title of Dom Oba II, was an important South American abolitionist during Pedro II of Brazil's rule. His other descendants include the 18th-century warrior Oluyole, the historian Samuel Johnson, his brother physician Obadiah Johnson, Samuel Ajayi Crowther, the first African Bishop of the CMS, prominent colonial politician Bode Thomas, as well as Nigerian founding father Herbert Macaulay. An important contemporary descendant was Dr. Ameyo Adadevoh. His great-great grandson, Lamidi Adeyemi III is the current Alaafin of Oyo."]}, {"page": "James R. Newby", "response": ["He decided to tour Europe, and after visiting Greece (Olympic Games) and Germany (gambling at Baden-Baden), arrived in Edinburgh, Scotland, where he was converted through street evangelism of \"Revivalists\" Meek and Mitchell. He preached in the open air and churches in Edinburgh, studied at Henry Grattan Guinness' Harley House missionary training college in London and went to Nigeria and Cameroon as a missionary with the Anglicans, sailing with Bishop Samuel Ajayi Crowther on 20 July 1876. There he worked among Igbo people and visited mission stations at Fernando Po, Old Calabar, and Victoria (Limbe, Cameroon)."]}, {"page": "Church Mission Society", "response": ["* West Africa (1804): Melchior Renner and Peter Hartwig were sent to the Pongo River, the country of the Susu people in Guinea. The West Africa mission was extended to Sierra Leone (1816). Samuel Ajayi Crowther, a Yoruba by birth, was selected to accompany the missionary James Schön on the Niger expedition of 1841.  Crowther (later appointed first African Anglican bishop in Nigeria) was the principal missionary to Yorubaland in 1844 and the Niger in 1857. "]}, {"page": "List of Nigerian writers", "response": ["*Samuel Ajayi Crowther (1807–1891), linguist, translator, diarist, explorer, writer"]}, {"page": "Bonny Island", "response": ["In the 19th Century AD, Bonny Island accepted Christianity through the ministry of Bishop Samuel Ajayi Crowther. Prior to this event, the totem of the kingdom had been the iguana."]}, {"page": "Samuel A. Crowther", "response": ["#REDIRECT Samuel Ajayi Crowther"]}, {"page": "Crowther", "response": ["* Samuel Ajayi Crowther (1809–1891), Nigerian bishop"]}, {"page": "Yoruba literature", "response": ["The first Yoruba grammar was published in 1843 by Bishop Samuel Ajayi Crowther.  He was of Yoruba origin himself."]}, {"page": "Calendar of saints (Episcopal Church)", "response": ["*31 Samuel Ajayi Crowther, Bishop in the Niger Territories, 1891"]}, {"page": "Fourah Bay College", "response": ["The college was established in February 1827 as an Anglican missionary school by the Church Missionary Society with support from Charles MacCarthy, the governor of Sierra Leone. Samuel Ajayi Crowther was the first student to be enrolled at Fourah Bay. Fourah Bay College soon became a magnet for Sierra Leone Creoles and other Africans seeking higher education in British West Africa. These included Nigerians, Ghanaians, Ivorians and many more, especially in the fields of theology and education. It was the first western-style university in West Africa. Under colonialism, Freetown was known as the \"Athens of Africa\" due to the large number of excellent schools in Freetown and surrounding areas.", "* Samuel Ajayi Crowther"]}, {"page": "University of Sierra Leone", "response": ["It has its origins in the Fourah Bay College, which was established as an Anglican missionary school by the Church Missionary Society with support from Charles MacCarthy, the governor of Sierra Leone. Samuel Ajayi Crowther was the first student to enroll at Fouray Bay. Fourah Bay College soon became a magnet for Krio and other Africans seeking higher education in British West Africa. These included Nigerians, Ghanaians, Ivorians and many more, especially in the fields of theology and education. It was the first western-style university in West Africa. Under colonialism, Freetown was known as \"the Athens of West Africa\" as an homage to the college."]}, {"page": "Colonial Nigeria", "response": ["The CMS initially promoted Africans to responsible positions in the mission field; for instance, they appointed Samuel Ajayi Crowther as the first Anglican bishop of the Niger. Crowther, a liberated Yoruba slave, had been educated in Sierra Leone and in Britain, where he was ordained before returning to his homeland with the first group of CMS missionaries. The Anglicans and other religious groups had a conscious \"native church\" policy to develop indigenous ecclesiastical institutions to become independent of Europeans. Crowther was succeeded as bishop by a British cleric. In the long term, the acceptance of Christianity by large numbers of Nigerians depended on the various denominations adapting to local conditions. They selected an increasingly high proportion of African clergy for the missions."]}, {"page": "Timeline of Nigerian history", "response": ["| 1864 || || Samuel Ajayi Crowther becomes first African Anglican Bishop.G. I. C. Eluwa. \"Background to the Emergence of the National Congress of British West Africa\", African Studies Review, September 1971."]}, {"page": "J. F. Ade Ajayi", "response": ["As an early writer of Nigerian and African history, though not a pioneer like Kenneth Dike, Ajayi brought considerable respect to the Ibadan School and African research. He is known for the arduous research and rigorous effort he puts into his work. By extensive use of oral sources in some of his works such as pre-twentieth century Yoruba history, he was able to weigh, balance and assay each and all of his sources, uncovering a pathway towards facts in the period which was scarce in written and non-prejudiced forms.Robert A. Hess, J. F. Ade Ajayi and the New Historiography in West Africa, African Studies Review  > Vol. 14, No. 2, pp 1–4 (Sep. 1971) Ajayi also tries to be dispassionate in his writings, especially when writing about controversial or passionate subjects in African history. In an article on the history of Yoruba writing, he was able to appraise critically and with resignation, Samuel Ajayi Crowther, a hero to Ade Ajayi. His style of rigorous research presented new pathways in African historiography and augmented awareness among scholarly circles outside the continent to African methodologies and perceptions. By weighing sources both written and oral, he was able to find new issues of interest that formed the basis of British colonisation of Lagos, balancing official British documentation of the event with additional material."]}, {"page": "Moses Orimolade Tunolase", "response": ["At age 12 years, Orimolade had a dream in which he was presented with a rod, a Royal Insignia and a crown. He woke with a personal conversion to the Christian faith and a conviction of his calling to preach the gospel of Jesus Christ but his evangelistic mission did not begin until after a period of seven years in confinement. Some of his close associates at the time attributed this confinement to a protracted illness while others regarded it as a period spent in training and preparation for his missionary work. Orimolade emerged from this confinement with partial recovery of the use of his legs and a remarkable ability to pray and preach the King James Version of the Bible that had been translated into his own native Yoruba language earlier by his tribesman, Bishop Samuel Ajayi Crowther.", "The availability of the translations of the scriptures in African languages brought the Bible to life among the African people and changed their views of the missionaries and the missions. Drumming, clapping and dancing as methods of worship were embraced by the African people but created challenges for the missionaries and their European concept of worship. The difference in understanding of religious expression resulted in clashes and conflicts between the missionaries and the African leadership in the Anglican Church. The blind insistence of the missionaries on the superiority of the European concept of Christianity provided the moral impetus for the denial of the African leadership the right to succeed Bishop Samuel Ajayi Crowther and left the African people in the Anglican Church disconnected and discontent."]}, {"page": "List of people from Freetown", "response": ["*Samuel Ajayi Crowther, Sierra Leonean-Nigerian clergyman and first Anglican Bishop of West Africa."]}]}}