{"wiki_id": "http://www.wikidata.org/entity/Q26678275", "itemLabel": "Robert Westley Hall-Dare", "itemDescription": "English politician, died 1836", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Westley_Hall-Dare", "wikipedia_page": {"main": "Robert Westley Hall-Dare (3 March 1789 – 20 May 1836) was a British Conservative politician who was Member of Parliament for South Essex from 1832, as a Tory, until his death in 1836. He was succeeded by George Palmer.", "link_mentions": [{"page": "List of Old Harrovians", "response": ["*Robert Westley Hall-Dare (1789–1836), MP for South Essex (1832–1836)Harrow, 1800–1911, p. 23"]}, {"page": "South Essex (UK Parliament constituency)", "response": ["|rowspan=\"3\"| Robert Westley Hall-Dare"]}, {"page": "List of United Kingdom by-elections (1832–1847)", "response": ["|Robert Westley Hall-Dare"]}, {"page": "Waller Hobson", "response": ["On 11 June 1891 Hobson married Frances Maria Hall-Dare, daughter of Robert Westley Hall-Dare and Frances Anne Catharine Lambart.‘Armagh clergy and parishes: being an account of the clergy of the Church of Ireland in the Diocese of Armagh, from the earliest period, with historical notices of the several parishes, churches, &c’ by James B. Leslie, 1911, Dundalk : W. Tempest. They had no children."]}, {"page": "Mabel Bent", "response": ["Hall-Dare was born on 28 January 1847, second daughter of Robert Westley Hall-Dare (1817–1866) and his wife Frances Anna Catherine (née Lambart) (c. 1819–1862).For the Hall-Dare family, see thepeerage.com. Her birthplace was her grandfather’s estate, Beauparc, on the River Boyne in County Meath, Ireland. Shortly after her birth the family moved to Temple House, County Sligo, before re-locating in the early 1860s to County Wexford, acquiring the property that was later to become Newtownbarry House, in Newtownbarry (now the village of Bunclody). While a teenager, Hall-Dare suffered several bereavements, losing both her parents and her two brothers. "]}]}}