{"wiki_id": "http://www.wikidata.org/entity/Q26689989", "itemLabel": "John Walrond", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_John_Walrond,_1st_Baronet", "wikipedia_page": {"main": "Sir John Walrond Walrond, 1st Baronet (1 March 1818 – 23 April 1889), of Bradfield House, Uffculme in Devon (known as John Walrond Dickinson until 22 April 1845), was a British Conservative Party politician.", "link_mentions": [{"page": "Knightshayes Court", "response": ["Benjamin Dickinson, a wealthy merchant, banker, and mayor of Tiverton, built the first mansion at Knightshayes between 1785 and 1788.The Setting of Knightshayes Park and Garden, The Parks Agency, September 2007, pp. 10–14 His great-grandson, Sir John Walrond, 1st Baronet, sold the Knightshayes estate to Sir John Heathcoat-Amory, 1st Baronet in 1868. The Heathcoat-Amory family, who had established their wealth from lace production, owned much of the manufacturing and land around Tiverton, and Heathcoat-Amory chose the site of Knightshayes, because of its view of his distant factory, nestled in the Exe valley below. He demolished the Dickinson house and built a new mansion slightly above it, which survives today."]}, {"page": "William Walrond, 1st Baron Waleran", "response": ["Walrond was the son of Sir John Walrond, 1st Baronet of Bradfield House, Uffculme, Devon and the Hon. Frances Caroline Hood, youngest daughter of Samuel Hood, 2nd Baron Bridport.thepeerage.com William Hood Walrond, 1st Baron Waleran He was educated at Eton and served as a captain in the Grenadier Guards in 1872. He was Lieutenant-Colonel commanding the 1st (Exeter and South Devon) Devonshire Rifle Volunteer Corps from 9 June 1877,Army List. and a J.P. and DL for Devon.Debretts Guide to the House of Commons 1886"]}, {"page": "Baron Waleran", "response": ["Baron Waleran, of Uffculme in the County of Devon, was a title in the Peerage of the United Kingdom. It was created on 23 December 1905 for the Conservative politician Sir William Walrond, 2nd Baronet, of Bradfield House, Uffculme. The name of the barony, with its spelling being a variant of the family name, appears to have been chosen to suggest a possible ancestry from Waleran the Huntsman, feudal baron of West Dean, Wiltshire, at the time of the Domesday Book of 1086, which was held by the Waleran family until the death of Walter Walerand in 1200/1 leaving three daughters his co-heiresses.Sanders, I.J., English Baronies, Oxford, 1960, p.96 His elevation to the peerage did not cause a by-election due to the upcoming general election, where his son, William, succeeded him as the Member of Parliament for Tiverton. The Walrond Baronetcy, of Bradfield and of Newcourt, both in the County of Devon, was created in the Baronetage of the United Kingdom on 24 February 1876 for the first Baron's father, John Walrond, who also represented Tiverton in Parliament. The title was named after the family's manor of Bradfield, Uffculme, Devon, held by them since the 13th century. The baronetcy and barony became extinct on the death of the first Baron's grandson, the second Baron, on 4 April 1966.", "*Sir John Walrond Walrond, 1st Baronet (1818–1889) "]}, {"page": "Tiverton (UK Parliament constituency)", "response": ["|rowspan=\"2\"| John Walrond, of Bradfield, Uffculme"]}, {"page": "Gilbert Acland-Troyte", "response": ["He was the third son of Colonel Charles Arthur William Troyte of Huntsham Court, by his wife Katherine Mary Walrond, daughter of Sir John Walrond, 1st Baronet of Bradfield House, Uffculme, Devon. Acland-Troyte was educated at Eton College and  Trinity College, Cambridge"]}, {"page": "Charles Hepburn-Stuart-Forbes-Trefusis, 20th Baron Clinton", "response": ["After his first wife's death in 1869, in 1875 Lord Clinton remarried to Margaret Walrond (d.1930), daughter of Sir John Walrond, 1st Baronet, of Bradfield House, Uffculme, Devon. As Lady Clinton, Margaret organised the 'Ladies of Devonshire' wedding gift of pearl earrings to Mary of Teck, the future Queen Mary. By Margaret he had seven further children:"]}, {"page": "Sir Thomas Dyke Acland, 12th Baronet", "response": ["On 1 November 1879 in All Saints' Chapel in Uffculme, he married Gertrude Walrond, a daughter of Sir John Walrond, 1st Baronet, of Bradfield House, Uffculme in Devon, The marriage was childless."]}, {"page": "Charlotte Hood, 3rd Duchess of Bronté", "response": ["* Hon. Frances Caroline Hood (b. 29 March 1821, d. 1 October 1903), wife of Sir John Walrond, 1st Baronet."]}, {"page": "Sir Thomas Dyke Acland, 11th Baronet", "response": ["* Sir Thomas Dyke Acland, 12th Baronet (1842–1919), who married Gertrude Walrond, a daughter of Sir John Walrond, 1st Baronet."]}, {"page": "Walrond", "response": ["*Sir John Walrond (1818-1889), British politician"]}, {"page": "Bradfield House", "response": ["It is one of the largest mansions in Devon,Pevsner, p.197 having been substantially enlarged in about 1860 by Sir John Walrond Walrond, 1st Baronet (1818–1889), to the design of the architect John Hayward, and incorporates within the Victorian structure the original mediaeval  great hall, one of the largest, most ornate  and best preserved in the county.", "The manor of Bradfield was from the 13th century until the early 20th century the principal seat of the Walrond family. Devon seats of cadet lines of this family included Bovey House in the parish of Beer, purchased c. 1670 from Sir William Pole of Shute and inherited from his first wife by John Rolle, 1st Baron Rolle (died 1842)of Bicton,Pevsner, p.190 Dunchideock House, the inheritance of Elizabeth Pitman the wife of the 2nd Baron Waleran,Pevsner, p.342 and  Tidwell House in East Budleigh, from about 1730.Pevsner, p.347 In 1876 the Walrond baronetcy \"of Bradfield\" was created for Sir John Walrond Walrond, 1st Baronet (1818–1899) and the title Baron Waleran, with variant spelling, was created for his son William Walrond, 1st Baron Waleran (1849–1925). On the death of his son the second baron in 1966, the titles became extinct and the family became extinct in the male line.", "*John Walrond (son)", "*John Walrond (son), married Joan Stofford, daughter and heiress of John Stoffard of Stoffard", "*John Walrond (son), married Alice Ufflett, daughter and heiress of John Ufflett by his wife Agnes Fishaker, daughter and heiress of Sir Martyn Fishaker.", "*John Walrond (son), married Margaret Moore, daughter of John Moore (died 1510) of nearby Moor Hayes in the parish of Cullompton, by his wife Elizabeth Clivedon (died 1515), whose monument exists in Cullompton (?) Church,\"MI\" (monumental inscription) per Vivian, but location not specified, probably in St Andrew's Church, Cullompton, the parish church of Moor Hayes  daughter and co-heiress of John Clivedon of Willond Burlescombe, a nearby parish. Margaret's brother was Richard More (died 1516), Archdeacon of Exeter and Treasurer of Exeter Cathedral, where his monument exists.Viviam, p.572, pedigree of Moore of Moorhays John IV's 2nd son Humphry Walrond founded the Walrond family of Clist.", "*John Walrond (eldest son) ", "*Sir John Walrond Walrond, 1st Baronet (1818–1889) (son), Conservative MP for Tiverton in 1866, born John Walrond Dickinson, who assumed the surname and arms of Walrond in 1845 at the same time as did his father. He was the son of  Benjamin Bowden Dickinson (1793–1851) by his wife the heiress Frances Walrond. He was created a baronet \"of Bradfield\" in 1876. He married Hon. Frances Caroline Hood, daughter of Samuel Hood, 2nd Baron Bridport (1788–1868). On inheriting Bradfield House he found it in a state of disrepair and decided to restore it.Report and Transactions of the Devonshire Association, 1910 In about 1860 he greatly expanded the house by adding the west service wing, at the same time he restored the Tudor aspect of the east front.Pevsner, p.197 In 1867, perhaps to assist in financing his works, he sold the Knightshayes estate, long a Dickinson possession, to the Amory family.Devon Record Office: \"1926 B/D/E/6/8 1867 Contents: The Knightshayes Estate. Rough draft contract for sale (Walrond to Amory)\" He was a benefactor of the Royal Devon and Exeter Hospital in Exeter and served as its President in 1874. His portrait by George Frederic Watts  (1817–1904) survives in the hospital's collection.", "*William George Hood Walrond, 2nd Baron Waleran (1905–1966), grandson of Sir John Walrond, 1st Bt. He died without male issue, whereupon the titles and male line of Walrond of Bradfield became extinct."]}, {"page": "William Holbech (cricketer)", "response": ["Holbech was born in Quebec in 1882, in Murray Bay (now known as La Malbaie).William Holbech – CricketArchive. Retrieved 28 December 2014. His father, Lt.-Col. Walter Holbech of the King's Royal Rifle Corps, was on active duty at the time of his birth. The Holbech family owned Farnborough Hall, near Farnborough, Warwickshire, and Holbech's paternal grandfather, Charles Holbech, was Archdeacon of Coventry from 1873 to 1887. His maternal grandfather, Sir John Walrond, Bt., was MP for Tiverton, in east Devon. John Walrond's son, William Walrond (later raised to the peerage as Baron Waleran), and grandson, The Hon. William Walrond, both later represented the same constituency, with the latter also killed in the First World War.William Hugh Holbech – The Peerage. Retrieved 28 December 2014. William Holbech was educated at Eton College, going on to the Royal Military College, Sandhurst. He was made a second lieutenant in the Scots Guards in January 1902, and promoted lieutenant in March 1904, passing into the reserve in February 1907."]}]}}