{"wiki_id": "http://www.wikidata.org/entity/Q2663889", "itemLabel": "Euros Lyn", "itemDescription": "television director", "wikipedia_url": "https://en.wikipedia.org/wiki/Euros_Lyn", "wikipedia_page": {"main": "Euros Lyn (; born 1971) is a Welsh film and television director, best known for his work in Doctor Who, Sherlock, Black Mirror and Daredevil.\n\n", "link_mentions": [{"page": "Lyn", "response": ["* Euros Lyn, Welsh director for television"]}, {"page": "List of film and television directors", "response": ["*Euros Lyn"]}, {"page": "Hugo Award for Best Dramatic Presentation", "response": ["| Doctor Who: \"The Girl in the Fireplace\"* || Euros Lyn (director), Steven Moffat (screenplay) || BBC Cymru Wales/BBC One", "| Doctor Who: \"Silence in the Library\"/\"Forest of the Dead\" || Euros Lyn (director), Steven Moffat (screenplay) || BBC Cymru Wales"]}, {"page": "Pauline Collins", "response": ["| Euros Lyn"]}, {"page": "Rose (Doctor Who episode)", "response": ["When the episode underran, Euros Lyn directed additional material set outside Rose's estate during the second production block, this time recorded in Gabalfa, Cardiff on 18 October. On 10 November, Lyn directed an insert shot of Jackie Tyler at HTV's Culverhouse Cross Studio 1 in Cardiff."]}, {"page": "The End of the World (Doctor Who)", "response": ["\"The End of the World\" is the second episode of the first series of the British science fiction television programme Doctor Who. Written by executive producer Russell T Davies and directed by Euros Lyn, the episode was first broadcast on BBC One on 2 April 2005 and was seen by approximately 7.97 million viewers in the United Kingdom."]}, {"page": "The Unquiet Dead", "response": ["\"The Unquiet Dead\" is the third episode of the first series of the British science-fiction television programme Doctor Who, first broadcast on 9 April 2005 on BBC One. It was written by Mark Gatiss and directed by Euros Lyn.", "Simon Callow, who portrayed Dickens, was considered apt since he possessed extensive knowledge of the author and had experience playing the character and recreating his public readings. Callow contended that for him to agree to play Dickens, the script would have to be a sufficiently high quality. When he heard that the author was to feature in Doctor Who his heart \"sank\" as he felt fiction has a tendency to posit the author as \"a kind of all-purpose Victorian literary character and really understand little, if anything, about him, his life or his books\". Director Euros Lyn noted that the material being of interest to Callow was key to getting him involved. Promoting his role in Doctor Who, Callow stated that writer Mark Gatiss knew \"exactly what Dickens is all about\" and \"very cleverly connects his idealism... with the Doctor's desire to save the world\". Callow was also pleased that the episode portrayed Dickens as he was towards the end of his life: ill and sad rather than energetic. In the 2011 episode \"The Wedding of River Song\", Callow returned to reprise his role as Dickens briefly."]}, {"page": "Tooth and Claw (Doctor Who)", "response": ["Interviewed in Doctor Who Confidential, director Euros Lyn said that various martial arts films were viewed in researching the opening fight sequence, including Crouching Tiger, Hidden Dragon."]}, {"page": "Llangennith", "response": ["*Euros Lyn - Television director"]}, {"page": "The Girl in the Fireplace", "response": ["\"The Girl in the Fireplace\" is the fourth episode of the second series of the British science fiction television series Doctor Who. It was first broadcast on BBC One on 6 May 2006. Written by Steven Moffat and directed by Euros Lyn, the episode is inspired by Audrey Niffenegger's novel The Time Traveler's Wife.", "In 2004, Russell T DaviesDoctor Whos executive producerwas responsible for Casanova, a serial set in the 18th century. During his research, Davies became fascinated by Madame de Pompadour and wanted to include her in a story which also involved The Turka clockwork man who played chess around the same period and which was later revealed to be a hoax. In early 2005, Steven Moffatwho had written \"The Empty Child\" and \"The Doctor Dances\" for the serieswas assigned to write the story. Euros Lyn was later assigned to direct it. Sophia Myles stated in an interview on Doctor Who Confidential that she did not have to audition for the role of Madame de Pompadour, she was offered it."]}, {"page": "Torchwood", "response": ["The first block of series two, consisting of episodes by Raynor and Tregenna, was directed by Andy Goddard. Colin Teague directed the second block, which consists of episode two by Moran and episode four by Tregenna, with Ashley Way directing the third block, consisting of the series two premiere by Chibnall and the sixth episode of the series, by JC Wilsher. Euros Lyn directed all five episodes of the third series, Children of Earth."]}, {"page": "The Idiot's Lantern", "response": ["\"The Idiot's Lantern\" is the seventh episode of the second series of the British science fiction television series Doctor Who, which was first broadcast on 27 May 2006 on BBC One. It was written by Mark Gatiss and directed by Euros Lyn.", "\"The Idiot's Lantern\" received mixed reviews. Ian Berriman of SFX gave \"The Idiot's Lantern\" a rating of four out of five, calling the main plot \"fairly insubstantial\" and noting it would not please viewers who liked everything explained. However, he referred to it as \"enjoyable\" and praised the directing of Euros Lyn. Berriman considered the highlight of the episode to be the subplot of family. IGN's Ahsan Haque rated the episode 6.8 out of 10, finding several logic flaws and calling the story \"marginally interesting\". Digital Spy reviewer Dek Hogan felt \"The Idiot's Lantern\" was a disappointment after Gatiss's previous Doctor Who script \"The Unquiet Dead\", feeling that a similar plot had been done before and it played like a \"pastiche of Doctor Who than the show itself\". He was also not favourable to Lipman's performance as the Wire, saying the character \"[lacked] menace\", and found the subplot of Tommy's father \"annoying\". Stephen Brook of The Guardian named it as an episode of the series he disliked, finding it \"too clever and way too preachy\"."]}, {"page": "New York Comic Con", "response": ["| February 6–8, 2009 || 77,000 || Dave Gibbons, Joss Whedon, McG, Daniel Dae Kim, Euros Lyn, Lou Ferrigno"]}, {"page": "Fear Her", "response": ["\"Fear Her\" is the eleventh episode of the second series of the British science-fiction series Doctor Who, first broadcast on BBC One on 24 June 2006. It was written by Matthew Graham and directed by Euros Lyn.", "*Episode commentary by Euros Lyn, Abisola Agbaje and Steffan Morris (MP3)"]}, {"page": "Gwen Cooper", "response": ["Children of Earth director Euros Lyn remarks that by the third series Gwen has grown so that \"she now is on a par with Jack, in terms of having the knowledge and the experience to make decisions and to be a heroine\". Daniel Martin of The Guardian opines that her characterisation in the serial \"shows just how far she's come\", whilst Robert Lloyd of the Los Angeles Times feels that she is a \"soulful leather-jacketed action heroine\". Myles states that Gwen becomes a harsher character, but she feels that, \"if she wasn't, people would die\". David Cornelius observes that Gwen is no longer the kind-hearted outsider she was when she first joined Torchwood. By Children of Earth she has become \"colder and much more aggressive\". Her horrific experiences turn her into \"a biting cynic\"; when both government and army betray the British people, Gwen claims to understand finally why the Doctor does not save humanity from world crises. She believes he \"must look at this planet and turn away in shame\". A press release stated that Miracle Day had Gwen \"make the most terrible decisions, on behalf of all mankind\". This is evident in \"The Blood Line\", where her character is shown to be willing to sacrifice the entire Torchwood team, in addition to her dying father, for the good of the world. Commenting on Gwen's characterisation in this episode, Dan Martin notes that \"Gwen sees transition into the Earth Mothering Tank Girl become complete, as she plays God and appears to love it.\""]}, {"page": "Jaime Winstone", "response": ["|Director: Euros Lyn"]}, {"page": "65th World Science Fiction Convention", "response": ["* Best Dramatic Presentation, Short Form: Doctor Who: The Girl in the Fireplace written by Steven Moffat, directed by Euros Lyn"]}, {"page": "Freema Agyeman", "response": ["It was later revealed by Torchwood: Children of Earth director Euros Lyn that the production team had intended for Agyeman to appear in that production, but she was already committed to Law & Order: UK. In a video interview conducted at the Law and Order: UK press launch, Agyeman does not rule out a return to Torchwood, stating that \"it's always a possibility.\" Torchwood creator and head writer Russell T. Davies, also responsible for Doctor Who, subsequently affirmed that he would be open to casting Agyeman in a future series of Torchwood."]}, {"page": "Martha Jones", "response": ["Director Euros Lyn comments that the production team had intended for Agyeman and Clarke to join Torchwood for its third series, but their careers led them elsewhere. When the characters interact with UNIT officers in Children of Earth, Martha's absence is explained by her being on honeymoon. Head writer and executive producer Russell T Davies explains that Agyeman was cast in Law & Order: UK before Children of Earth had been officially commissioned. Because Law & Order offered her 13 episodes a year, she went with that over Torchwood which had been reduced to 5. In response, Davies created the character of Lois Habiba, played by Cush Jumbo, to be a \"kind of a Martha figure\", one with added innocence who is out of her depth. Agyeman does not rule out returning to the show at a later date, however. Davies reveals in his non-fiction book Doctor Who: The Writer's Tale that Martha was also intended to appear in The Sarah Jane Adventures series two finale Enemy of the Bane in December 2008, but the character had to be replaced with classic series character Brigadier Lethbridge-Stewart (Nicholas Courtney) \"at the last minute\" due to Agyeman's role in Law & Order: UK; had Martha appeared, the character would have appeared in all three programmes in the franchise."]}, {"page": "Ianto Jones", "response": ["Comparing Jack's relationship with Ianto to his romantic tension with Gwen, David-Lloyd states \"I think [there are] different sorts of love or lust, as it might be, and I think that's an ongoing thing ... At the moment, I think there's two different sorts of love going on there.\" He also states that he feels that Ianto's relationship with Jack is his first same-sex relationship, and doesn't feel that Ianto would be a \"labelist\", but were he, he would identify as bisexual, but that he \"wouldn't regard himself the same way as Jack does because they're from different times.\" Author Stephen James Walker feels sorry for Ianto, perceiving his relationship with Jack as a one-sided one. To him, Ianto views the relationship as \"serious and committed\", as seen in \"A Day in the Death\" where he tells Owen that it is not just about sex. However, from dialogue in \"Something Borrowed\", Walker believes that Jack appears to equate his relationship with Ianto to nothing more than a \"recreational activity\". Walker also notes how important it was for Ianto when he cut in to dance with Jack, as this is the first time that his relationship with Jack is presented before the rest of the crew.Walker, p. 197 The novel The House that Jack Built includes a scene where Gwen tries to clarify whether Ianto understands the nature of his relationship with Jack, saying \"You do know he's ...\", which Ianto finishes \"Just a shag?\" before adding \"Yes I know. I can't help it, though. I've never been much good at casual.\" In radio play \"The Dead Line\", set just prior to series three, Ianto expounds his insecurities to Jack, who refutes them, confirming that his feelings for Ianto are real. When asked if the relationship will continue in series three, executive producer Julie Gardner replied, \"Yes, I like seeing them as a couple\", while director Euros Lyn stated that \"the love story between Captain Jack and Ianto [would continue] to unfold\" in the third series. While Gareth David-Lloyd feels that the love story between Jack and Ianto was not fully resolved, which is \"part of the tragedy\", the character and his relationship with Jack had been sufficiently explored in the third series for David-Lloyd to be \"happy to walk away from it.\""]}, {"page": "List of Torchwood characters", "response": ["Lois' character was created by Russell T Davies to replace Martha Jones (Freema Agyeman) when they could not get her for the third series. He describes her as \"kind of a Martha figure\", but one who lacks Martha's experiences and is \"out of her depth.\" Director Euros Lyn characterises Lois as an \"everygirl\" and a \"reluctant hero\" who is conflicted between helping Torchwood and obeying the government. Lyn also compared her role in the narrative to being similar to that of Rose Tyler and Gwen Cooper, used respectively as audience surrogates on Doctor Who and Torchwood."]}, {"page": "Owen Teale", "response": ["| Euros Lyn"]}]}}