{"wiki_id": "http://www.wikidata.org/entity/Q26702694", "itemLabel": "Antonio Aakeel", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Antonio_Aakeel", "wikipedia_page": {"main": "Antonio Aakeel is an English actor, known for his leading role in the 2018 comedy film Eaten by Lions, for which he was named a Screen International Star of Tomorrow by Screen Daily. He also appeared in Tomb Raider and the BAFTA award-winning series Three Girls.", "link_mentions": [{"page": "Johnny Vegas", "response": ["In May 2017, it was announced Vegas would be starring in new comedy feature Eaten by Lions opposite Antonio Aakeel and Jack Carroll, directed by Jason Wingard."]}, {"page": "Reece Dinsdale", "response": ["In May 2015, Dinsdale completed his third drama for BBC Television, \"Scratch\", starring Will Ash and Chris Coghill, once again for the Moving On series. Dinsdale thereafter directed a fourth TV drama, again in the Moving On series, for Jimmy McGovern: \"Eighteen\", a story about the attempted deportation of an Afghan youth back to his native Kabul, starring Antonio Aakeel and Rosie Cavaliero. The series was aired in November 2016. In 2017, Dinsdale directed Sue Johnston in \"Lost\" by Shaun Duggan for the Moving On series."]}, {"page": "Hayley Tamaddon", "response": ["It was announced in May 2017 Tamaddon would appear in comedy feature Eaten by Lions alongside Antonio Aakeel and Jack Carroll, directed by Jason Wingard."]}, {"page": "Nitin Ganatra", "response": ["It was announced in May 2017 that Ganatra would appear in comedy feature Eaten by Lions, alongside Antonio Aakeel and Jack Carroll. He also appeared in the Channel 4 drama The State, portraying the father of a young British Muslim who went to join ISIS. In 2020, he portrayed spell science teacher Mr. Daisy in the CBBC series The Worst Witch."]}, {"page": "Screen International", "response": ["* Antonio Aakeel"]}, {"page": "List of people from Wolverhampton", "response": ["175px|thumb|Antonio Aakeel, 2017", "* Antonio Aakeel – (born ca.1985) English actor  IMDb Database retrieved 27 January 2021"]}, {"page": "Katie and Emily", "response": ["\"Katie and Emily\" featured a number of cameo appearances. Phil Goldie, who won the \"Skins Needs You\" competition for young directors, appears as a man in the café where Naomi meets Katie. Clara Nicholls and Antonio Aakeel, the winners of a competition to win a speaking role in Skins, played the shop assistant and security guard respectively at the boutique where Katie and Emily shop for ball gowns, while another finalist from the competition, Allana Taylor, starred as a girl dancing with the students' Head of Form, Doug (Giles Thomas), at the ball. One of the series' runners, Laurence Wigfield, played a bystander at the ball and the crew's \"jack of all trades\", Tyrone Hyman, appeared on a poster in Katie and Emily's bedroom."]}, {"page": "Vicki Pepperdine", "response": ["In 2017 Pepperdine appeared in comedy feature Eaten by Lions alongside Antonio Aakeel and Jack Carroll, directed by Jason Wingard."]}, {"page": "List of British films of 2016", "response": ["|| Director: Pete Travis  Cast: Riz Ahmed, James Floyd, Billie Piper, Cush Jumbo, Roshan Seth, Antonio Aakeel"]}, {"page": "Tomb Raider (film)", "response": ["Additionally, Antonio Aakeel plays Lara's friend Nitin. Duncan Airlie James plays Terry, a mixed martial arts club operator. Josef Altin portrays Lara's boss Bruce, Billy Postlethwaite and Roger Nsengiyumva appear as Bill and Rog, Lara's co-workers and opponents at the race, and Michael Obiora portrays Baxter, the Croft Holdings' receptionist."]}, {"page": "Antonio aakeel", "response": ["#REDIRECT Antonio Aakeel"]}, {"page": "The Contract (2016 film)", "response": ["The Contract (previously known as Squat) is a 2016 British crime thriller feature film directed by Nic Auerbach. The Contract is a nascent love story of two people from polar opposite worlds, thrown together by circumstance. The film stars Robert Fucilla, Sarah Armstrong, Danny Webb, Patrick Ryecart, Antonio Aakeel, and Jack Brady. The film was released on DVD and online 18 January 2016.", "* Antonio Aakeel as Raza"]}, {"page": "Norwich Film Festival", "response": ["Jury: Dexter Fletcher, Stephen Woolley, James Marsh, Arianne Sutner, Jill Culton, Julie Lockhart, Lisa Cortés, Stuart Dryburgh, Will Becher, Todd Banhazl, Kate Phillips, Antonio Aakeel & Tim Downie."]}, {"page": "The Line of Freedom", "response": ["The Line of Freedom is a 2013 political drama film directed and produced by David Whitney and starring Antonio Aakeel. The film had its world premiere at the Dubai International Film Festival in 2013. It was instantly banned in Pakistan due to the controversial depiction of its security forces and subsequently contributed to a national ban of the Internet Movie Database. The film has sparked a backlash from some titling it \"anti-state propaganda\" and resulted in its star Antonio Aakeel, and others who had helped in the production allegedly receiving death threats.", "* Antonio Aakeel as Nasir Baloch"]}, {"page": "Three Girls (TV series)", "response": ["* Antonio Aakeel as Immy"]}, {"page": "Eaten by Lions", "response": ["Eaten by Lions is a 2019 British comedy film written and directed by Jason Wingard. The film stars Antonio Aakeel as Omar and Jack Carroll as Pete. The film is the feature-length adaptation of the director's 2013 short film  'Going to Mecca' which won best comedy at the Manchester International Film Festival. The feature follows half-brothers Omar and Pete as they embark on a journey to find Omar's estranged father, confronting him on the day of his daughter's engagement party."]}, {"page": "The Hungry", "response": ["* Antonio Aakeel as Chirag Joshi"]}, {"page": "List of British films of 2017", "response": ["|| Director: Bornila Chatterjee  Cast: Naseeruddin Shah, Tisca Chopra, Antonio Aakeel, Neeraj Kabi, Sayani Gupta, Arjun Gupta, Suraj Sharma, Jayant Kripalani"]}, {"page": "List of British films of 2018", "response": ["|| Director: Jason Wingard  Cast: Antonio Aakeel, Jack Carroll, Asim Chaudhry, Johnny Vegas, Vicki Pepperdine, Kevin Eldon"]}, {"page": "Badla (2019 film)", "response": ["* Antonio Aakeel as Sunny Singh Toor (Rani and Nimbi's son)"]}, {"page": "Dublin Murders", "response": ["* Antonio Aakeel as Raphael \"Rafe\" Hyland"]}, {"page": "Junya Enoki", "response": ["*Tomb Raider – Nitin (Antonio Aakeel) "]}, {"page": "Nasreen Paracha", "response": ["Nasreen decides to apply for a place at Oxford University, and Missy accompanies her to her interview. Missy confides in Nasreen about her plans for the future, which Nasreen mocks. The pair argue, but later reconcile their friendship. While walking on the street, the pair are hit by a speeding car driven by Anwar Wazir (Antonio Aakeel). The pair initially survive the accident, but Nasreen is distraught when she finds Missy's dead body in her bed, who has died as a result of internal bleeding. Angry with Anwar over Missy's death, she asks Sam to order the Murgatroyd family to attack him, but later disgusted with herself for her violent actions, she confides in Kaneez. Still grieving over Missy, Nasreen stops attending school in order to work at a factory, but after Kaneez and Naveed's disapproval, she rejoins school. Nasreen kisses classmate Chloe Voyle (Fern Deacon) at a party, who outs Nasreen. Initially petrified to come out due to the Muslim community's opinion on homosexuality, Nasreen takes pride in herself and comes out as a lesbian at school. She later takes her A Level exams, which she underperforms in, meaning she cannot attend Oxford. However, unbeknownst to Nasreen, Kaneez drives to the university and pleads with them to let Nasreen attend despite her results, to which they eventually agree. Nasreen then spreads Missy's ashes and leaves for university."]}, {"page": "Missy Booth", "response": ["Missy starts at sixth form with Nasreen, who is planning to go to Oxford University. Missy hides her upset at the thought of Nasreen leaving and their lives changing, deciding to support her instead. She accompanies Nasreen to Oxford to attend her interview and when Nasreen becomes scared about being rejected, Missy convinces her to attend it. When they return home, Missy confides in Nasreen that she plans to leave school again to join the fair. Nasreen laughs and accuses Missy of \"throwing her life away\" like her mother. Missy retaliates by slapping Nasreen. The pair eventually make up with each other and while walking home, they are hit by a speeding car driven by Anwar Wazir (Antonio Aakeel). Missy survives with two broken arms, but when she goes to bed, she is shocked to see her dead grandmother, who informs Missy that she has died. Nasreen visits Missy and is distraught to find her dead body. Missy then appears in Nasreen's imagination, where the pair discuss their friendship."]}, {"page": "Slow Horses", "response": ["*Antonio Aakeel as Hassan Ahmed"]}, {"page": "List of British films of 2021", "response": ["|| Directors: Abid Khan  Cast: Antonio Aakeel, Quintessa Swindell, Óscar Casas, Julius Fleischanderl, Laura Frederico, Isabel Guardiola, Leticia Marín, Virgile Bramly"]}, {"page": "Characters of Ackley Bridge", "response": ["Missy Booth (portrayed by Poppy Lee Friar) is the older sister of Hayley (Cody Ryan), and the daughter of Simone (Samantha Power). She is also the lifelong best friend of Nasreen Paracha (Amy-Leigh Hickman). The pair start at Ackley Bridge College, having previously attended different schools. Due to Missy retaking a year, she is placed in the year group below Nasreen. Missy's grandmother Julie (Rita May) worries about her money being stolen. Missy suspects that her motherstole the money, and enlists Nasreen's help to find her. Before going to school, Missy goes upstairs to help Julie get out of the bath, but is distraught to find her dead in the bath. Unsure on what to do, she leaves her body, and goes to school. She later confides in Nasreen, but tells her to keep it a secret, as there is no longer a legal guardian to look after Hayley. Teacher Emma Keane (Liz White) finds out, and reports Julie's death to the social board, who puts Hayley into foster care. With the help of Simone, Missy manages to regain custody of Hayley. Missy begins a relationship with Nasreen's half-brother, Aaron Turner (Adam Fielding). When he surprises her with a firework display, she proposes to him. She later becomes pregnant with his baby and tells Aaron, who is delighted. However, feeling it is too soon to have a child, she has an abortion. Aaron finds out, and angry that Missy did not consult him, he ends the relationship. Missy starts at sixth form with Nasreen, who is planning to go to Oxford University. She accompanies Nasreen to Oxford to attend her interview, and when they return home, Missy confides in Nasreen that she plans to leave school again to join the local fair. Nasreen laughs, and accuses Missy of \"throwing her life away\" like her mother. The pair make up with each other, and while walking home, they are hit by a speeding car driven by Anwar Wazir (Antonio Aakeel). Missy has two broken arms, but when she goes to bed, she is shocked to see her dead grandmother, who informs her that she has died. Nasreen visits Missy, and is distraught to find her dead body.", "Nasreen Paracha (portrayed by Amy-Leigh Hickman) is the older sister of Razia (Nazmeen Kauser) and Saleem (Esa Ashraf/Yaseen Khan), and the daughter of Kaneez (Sunetra Sarker) and Iqbal (Narinda Samra). Nasreen comes out to lifelong best friend Missy Booth (Poppy Lee Friar) as a lesbian. She then kisses her teacher, Lila Shariff (Anneika Rose), while on a night out with Missy. After coming out to Kaneez, she engages in a fake arranged marriage with Naveed Haider (Gurjeet Singh), who is also secretly gay. She later meets Sam Murgatroyd (Megan Parkinson), who attends an anti-Muslim march in the local area. Despite Sam and her family's views, the pair begin a relationship. Nasreen later ends their relationship when she is disillusioned with who Sam is. Missy starts at sixth form with Nasreen, who is planning to go to Oxford University. She accompanies Nasreen to Oxford to attend her interview, and when they return home, Missy confides in Nasreen that she plans to leave school again to join the local fair. Nasreen laughs, and accuses Missy of \"throwing her life away\" like her mother. The pair eventually make up with each other, and while walking home, they are hit by a speeding car driven by Anwar Wazir (Antonio Aakeel). Although injured, they are believed to be fine. However, Nasreen then finds Missy's dead body, after she died from an internal bleed. Nasreen is informed by headteacher Mandy Carter (Jo Joyner) that she will be accepted into Oxford if she achieves the necessary grades, but in haste, she quits school and decides to work at a tea towel factory. Kaneez persuades her to go back to school, but she does not perform well in her A Level exams. Kaneez then drives to Oxford, and persuades the acceptance board to allow her to attend the university.", "Anwar Wazir (portrayed by Antonio Aakeel) is a resident of Ackley Bridge. Whilst speeding in his car, he accidentally runs over Nasreen Paracha (Amy-Leigh Hickman) and Missy Booth (Poppy Lee Friar). He sticks around to wait for the ambulance to come. Despite initially being believed to be okay, Missy dies in her sleep due to an internal bleed. Nasreen struggles to cope with the death of her best friend, and goes for a walk in the town to get away from everybody. She sees Anwar at his house, and learns that he only lives three streets away from her. Nasreen instructs Sam Murgatroyd (Megan Parkinson) to hurt him, and she gets her cousins to beat him. They post the video of the beating online, and despite it being a revenge attack, the town believes it to be a hate crime. This causes a racial divide in the town, and Nasreen meets with Anwar. The pair apologise to each other for what they have done."]}, {"page": "Granada Nights", "response": ["Granada Nights is a 2021 coming-of-age film directed by Abid Khan starring Antonio Aakeel, Quintessa Swindell, Tábata Cerezo and Óscar Casas."]}, {"page": "Octonauts: Above & Beyond", "response": ["|Antonio Aakeel"]}]}}