{"wiki_id": "http://www.wikidata.org/entity/Q267234", "itemLabel": "Shailesh Vara", "itemDescription": "British politician (born 1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Shailesh_Vara", "wikipedia_page": {"main": "Shailesh Lakhman Vara (born 4 September 1960) is a Ugandan-British politician. He has served as a member of the Conservative Party and Member of Parliament (MP) for North West Cambridgeshire since the 2005 general election, succeeding Brian Mawhinney as the Conservative MP for the seat. Vara is a former Vice-Chairman of the Conservative Party.\nIn 2006, he was appointed to the shadow ministerial post of Shadow Deputy Leader of the House of Commons. He previously held Parliamentary Under Secretary of State roles at the Ministry of Justice and Department of Work and Pensions, before being appointed to the Northern Ireland Office (NIO) under Karen Bradley in January 2018. Vara resigned as an NIO minister in November 2018 over the Government's proposed Brexit agreement.", "link_mentions": [{"page": "Cambridgeshire", "response": ["| North West Cambridgeshire || Shailesh Vara"]}, {"page": "Peterborough", "response": ["In 1997, the North West Cambridgeshire constituency was formed, incorporating parts of the city and neighbouring Huntingdonshire. The sitting member is the Conservative Shailesh Vara, who succeeded Sir Brian Mawhinney, former Secretary of State for Transport and Chairman of the Conservative Party, in 2005. Mawhinney, who had previously served as Member of Parliament for Peterborough from 1979, was created Baron Mawhinney of Peterborough in the county of Cambridgeshire later that year."]}, {"page": "September 4", "response": ["*  1960   – Shailesh Vara, Ugandan-English lawyer and politician"]}, {"page": "Brunel University London", "response": ["* Shailesh Vara (Law), Conservative Party politician, MP for North West Cambridgeshire"]}, {"page": "Ramsey, Cambridgeshire", "response": ["Nationally Ramsey is in the parliamentary constituency of North West Cambridgeshire, which elects one Member of Parliament (MP) by the first past the post system of election. Since 2005 North West Cambridgeshire's member of the House of Commons has been Shailesh Vara (Conservative). He was preceded by Sir Brian Mawhinney (Conservative) who represented the constituency from 1997 until 2005."]}, {"page": "Tony Clarke (British politician)", "response": ["At the 2001 general election, Clarke held the seat with a majority of 885 votes over the Conservative candidate Shailesh Vara. However, Conservative Brian Binley took the seat with a majority of 4,419 at the May 2005 General Election."]}, {"page": "Aylesbury Grammar School", "response": ["* Shailesh Vara, Conservative MP since 2005 for North West Cambridgeshire"]}, {"page": "Yaxley, Cambridgeshire", "response": ["At Westminster Yaxley is in the parliamentary constituency of North West Cambridgeshire, and elects one Member of Parliament (MP) by the first past the post system of election. Yaxley is represented in the House of Commons by Shailesh Vara (Conservative). Shailesh Vara has represented the constituency since 2005. The previous member of parliament was Brian Mawhinney (Conservative) who represented the constituency between 1997 and 2005."]}, {"page": "Stilton", "response": ["At Westminster Stilton is in the parliamentary constituency of North West Cambridgeshire, and elects one Member of Parliament (MP) by the first past the post system of election. Stilton has been represented in the House of Commons by Shailesh Vara (Conservative since 2005. The previous member of parliament was Brian Mawhinney (Conservative, 1997–2005).", "Today Stilton is not licensed to make the cheese since it is not located in one of the three counties licensed to do so: Derbyshire, Leicestershire and Nottinghamshire. The manufacturers of Stilton cheese in these counties applied for and received Protected Geographical Status (PGS) in 1996, so that production is currently limited to these three counties and must use pasteurised milk, which can be drawn from many counties within the central belt of England. Recent evidence indicates that it is unlikely that the village would have been a centre for selling of cheese unless cheese was also made in the area. Furthermore, the original recipe for a cream cheese made in Stilton in the early 18th century has since been discovered and since more than one type of cheese was usually made, it is possible that a blue cheese was also made in the area.BBC Radio 4 The Food Programme, \"Food Myths\", 20 September 2009 The Parish of Stilton applied to Defra for an amendment to the Stilton PDO to be included into the Protected area but was unsuccessful. Further attempts to achieve this have been made, supported by Shailesh Vara MP, the Member of Parliament for North West Cambridgeshire, Shailesh Vara MP 31 January 2020 but have so far been unsuccessful."]}, {"page": "North West Cambridgeshire (UK Parliament constituency)", "response": ["The seat was won upon its creation in 1997 by Sir Brian Mawhinney, former Conservative MP for Peterborough (which was gained at the same election by the Labour Party). He retired from the House of Commons in 2005 and was created Baron Mawhinney, of Peterborough in the county of Cambridgeshire. The Conservative Shailesh Vara has represented the constituency since the 2005 general election.", "| Shailesh Vara"]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| North West Cambridgeshire || Shailesh Vara || Conservative || Sir Brian Mawhinney || Conservative"]}, {"page": "British Asian", "response": ["Use of \"Asian Briton\" has appeared as both an illustrative term in media and for purposes of self-identity. For example, in 2005, politician Shailesh Vara was described as an Ugandan Asian Briton. Television presenter Sonia Deol and journalist Yasmin Alibhai-Brown have identified themselves as Asian Britons. In 1999, Alibhai-Brown published an Institute for Public Policy Research report, advising various departments of the Government of the United Kingdom to use the term Asian Briton. Research project Minorities at Risk described this as an effort \"to link ethnic groups to their heritage, and to make greater recognition of the sacrifices made by members of ethnic groups during World War II\"."]}, {"page": "List of Parliamentary constituencies in Cambridgeshire", "response": ["|Shailesh Vara †"]}, {"page": "Sawtry", "response": ["As a civil parish, Sawtry has a parish council consisting of fifteen councillors. The village is represented on Huntingdonshire District Council by two councillors for the Sawtry ward, and on Cambridgeshire County Council by one councillor for the electoral division of Sawtry and Ellington. It is in the parliamentary constituency of North West Cambridgeshire, represented at the House of Commons by Shailesh Vara (Conservative)."]}, {"page": "Water Newton", "response": ["At Westminster Water Newton is in the parliamentary constituency of North West Cambridgeshire, and elects one Member of Parliament (MP) by the first past the post system of election. Water Newton is represented in the House of Commons by Shailesh Vara (Conservative). Shailesh Vara has represented the constituency since 2005. The previous member of parliament was Brian Mawhinney (Conservative) who represented the constituency between 1997 and 2005."]}, {"page": "List of United Kingdom MPs: V", "response": ["*Shailesh Vara (2005–present)"]}, {"page": "Vara", "response": ["*Shailesh Vara, British Conservative Party politician"]}, {"page": "Abbots Ripton", "response": ["At Westminster, Abbots Ripton is in the parliamentary constituency of North West Cambridgeshire, and has represented since 2005 in the House of Commons by Shailesh Vara (Conservative)."]}, {"page": "Molesworth, Cambridgeshire", "response": ["At Westminster Molesworth is in the parliamentary constituency of North West Cambridgeshire, and elects one Member of Parliament (MP) by the first past the post system of election. Molesworth is represented in the House of Commons by Shailesh Vara (Conservative). Shailesh Vara has represented the constituency since 2005. The previous member of parliament was Brian Mawhinney (Conservative) who represented the constituency between 1997 and 2005."]}, {"page": "Pidley", "response": ["At Westminster Pidley is in the parliamentary constituency of North West Cambridgeshire, and elects one Member of Parliament (MP) by the first past the post system of election. Pidley is represented in the House of Commons by Shailesh Vara (Conservative). Shailesh Vara has represented the constituency since 2005. The previous member of parliament was Brian Mawhinney (Conservative) who represented the constituency between 1997 and 2005."]}, {"page": "Morborne", "response": ["At Westminster Morborne is in the parliamentary constituency of North West Cambridgeshire, and elects one Member of Parliament (MP) by the first past the post system of election. Morborne is represented in the House of Commons by Shailesh Vara (Conservative). Shailesh Vara has represented the constituency since 2005. The previous member of parliament was Brian Mawhinney (Conservative) who represented the constituency between 1997 and 2005."]}, {"page": "Needingworth", "response": ["At Westminster Needingworth is in the parliamentary constituency of North West Cambridgeshire, which is represented in the House of Commons by Shailesh Vara (Conservative). Shailesh Vara has represented the constituency since 2005. The previous member of parliament was Brian Mawhinney (Conservative) who represented the constituency between 1997 and 2005."]}, {"page": "Kings Ripton", "response": ["At Westminster Kings Ripton is in the parliamentary constituency of North West Cambridgeshire, where it is represented  by Shailesh Vara (Conservative)."]}, {"page": "Barham, Huntingdonshire", "response": ["At Westminster, Barham is in the parliamentary constituency of North West Cambridgeshire and elects one Member of Parliament (MP) by the first past the post system of election. Barham and is represented in the House of Commons by Shailesh Vara (Conservative). Shailesh Vara has represented the constituency since 2005. The previous member of parliament was Brian Mawhinney (Conservative) who represented the constituency between 1997 and 2005."]}, {"page": "Bury, Cambridgeshire", "response": ["At Westminster, Bury is in the parliamentary constituency of North West Cambridgeshire, and elects one Member of Parliament (MP) by the first past the post system of election.  Bury is represented in the House of Commons by Shailesh Vara (Conservative). Shailesh Vara has represented the constituency since 2005. The previous member of parliament was Brian Mawhinney (Conservative) who represented the constituency between 1997 and 2005."]}]}}