{"wiki_id": "http://www.wikidata.org/entity/Q26754457", "itemLabel": "Charles Connor", "itemDescription": "politician, died 1914", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Connor_(MP)", "wikipedia_page": {"main": "Charles Cunningham Connor (c. 1840 – 10 February 1914) was an Irish Unionist MP for North Antrim.\nConnor was educated at the Royal Academical Institution, Belfast and Queen's University Belfast, and was a businessman prior to entering Parliament, as well as an alderman of Belfast City Council. Between 1889 and 1891 he was Mayor of Belfast (the last before the post was upgraded to Lord Mayor). He was elected to Parliament at the general election of 1892, but did not stand in 1895.", "link_mentions": [{"page": "North Antrim (UK Parliament constituency)", "response": ["| Charles Connor"]}, {"page": "Charles Connor", "response": ["Charles Connor (January 14, 1935July 31, 2021) was an American drummer, best known as a member of Little Richard's band. Richard's shout of \"a-wop bop-a loo-mop, a-lop bam-boom\" at the beginning of \"Tutti Frutti\" is said to be a reference to Connor's drum rhythms.  James Brown described Little Richard and his band, with Connor as the drummer, as \"the first to put funk into the rhythm.\"", "In his later career, Connor drummed with Sam Cooke, Jackie Wilson, The Coasters, Big Joe Turner, Larry Williams, Don Covay, George Lightfoot, and Dee Clark.  During the 1980s, Connor put together a new group, Charles Connor’s Upsetters. Their first single was a cover of Richard’s “I Got It”, then they issued some originals, including “Kiss My Love” and “Drummer Man” (featuring Charles’ first lead vocal", "*Charles Connor Interview NAMM Oral History Library (2006)"]}, {"page": "Charles Cunningham Connor", "response": ["#REDIRECT Charles Connor (MP)"]}, {"page": "Charles C. Connor", "response": ["#redirectCharles Connor (MP)"]}, {"page": "Charles Connors", "response": ["* Charles Connor (MP) (1840–1914), Irish member of Parliament", "* Charles Connor (1935–2021), American R&B drummer who worked with Little Richard"]}]}}