{"wiki_id": "http://www.wikidata.org/entity/Q267528", "itemLabel": "Maurice Norman", "itemDescription": "English footballer (born 1934)", "wikipedia_url": "https://en.wikipedia.org/wiki/Maurice_Norman", "wikipedia_page": {"main": "Maurice Norman (born 8 May 1934) is an English former footballer who played nearly 400 times in the Football League as a centre half for Norwich City and Tottenham Hotspur. At international level, Norman won 23 caps for the England national team.Norman was born in Mulbarton, Norfolk. He began his career at Norwich City, and played 35 league matches for the Canaries between 1952 and 1955. Despite such a short career with the club, he was elected into the Norwich City Hall of Fame in 2002. He signed for Tottenham Hotspur in November 1955 for a £28,000 transfer fee, that also included the return transfer of Ireland international striker Johnny Gavin to Norwich. Norman played his first game for his new club against Cardiff City, and stayed at White Hart Lane until 1965, making 411 first-team appearances and scoring 19 goals for Spurs. He was an integral part of Bill Nicholson's Double-winning Tottenham team of 1960–61 that went on to retain the FA Cup in 1962, and win the 1963 Cup Winners' Cup.At international level, Norman made 23 appearances for England, including in the 1962 World Cup. He was also a member of the England squad at the 1958 World Cup, but did not play. He suffered a double fracture of tibia and fibula playing for Spurs against a Hungarian Select XI in November 1965, which brought a premature end to his career.", "link_mentions": [{"page": "May 8", "response": ["*  1934   – Maurice Norman, English footballer"]}, {"page": "Tottenham Hotspur F.C.", "response": ["*  Maurice Norman"]}, {"page": "Torquay United F.C.", "response": ["In front of Plainmoor's second ever largest attendance – the official attendance was slightly above 20,000 – the team performed well: Billy Atkinson put United 1–0 up from the penalty spot after Robin Stubbs had been felled; Spurs responded turning on the style to give themselves a 3–1 lead with two goals from Alan Gilzean and one from Maurice Norman; and then, in the last few minutes, it was the turn of record signing Robin Stubbs to net two goals and make it 3–3."]}, {"page": "London XI", "response": ["Team: Jack Kelsey (Ars), Peter Sillett (Che), Jim Langley (Ful), Danny Blanchflower (Tot), Maurice Norman (Tot), Ken Coote (Bre), Vic Groves (Ars), Jimmy Greaves (Che), Bobby Smith (Tot), Johnny Haynes (Ful), George Robb (Tot)."]}]}}