{"wiki_id": "http://www.wikidata.org/entity/Q26701524", "itemLabel": "William Cavendish-Bentinck", "itemDescription": "English politician, died 1909", "wikipedia_url": "https://en.wikipedia.org/wiki/William_George_Cavendish-Bentinck", "wikipedia_page": {"main": "William George Cavendish-Bentinck (6 March 1854 – 22 August 1909), was a member of parliament for Penryn and Falmouth between 1886 and 1895, who married into the American Livingston family.", "link_mentions": [{"page": "Bentinck family", "response": ["***********William Cavendish-Bentinck, 3rd Duke of Portland (1738–1809), British politician, twice Prime Minister; married to Dorothy Bentinck, Duchess of Portland (1750–1794)", "**************William Cavendish-Bentinck, 6th Duke of Portland (1857–1943), British Conservative politician; married to Winifred Cavendish-Bentinck, Duchess of Portland (1863–1954)", "***************William Cavendish-Bentinck, 7th Duke of Portland (1893–1977), British Conservative politician; married to Ivy Cavendish-Bentinck, Duchess of Portland (1887–1982)", "*North and South Bentinck Arms, inlets off Burke Channel, were named after William Cavendish-Bentinck, 3rd Duke of Portland by Captain Vancouver in 1793. North Bentinck Arm is significant in the history of Canada because it was here in 1793 that Sir Alexander Mackenzie completed the first recorded transcontinental crossing of North America by a European north of Mexico."]}, {"page": "William Cavendish-Bentinck", "response": ["William Cavendish-Bentinck may refer to:", "* Lord William Cavendish-Bentinck (1774–1839), British statesman", "* William Cavendish-Bentinck, 3rd Duke of Portland (1738–1809), British prime minister", "* William Cavendish-Bentinck, 6th Duke of Portland (1857–1943), Knight of the Garter", "* William Cavendish-Bentinck, 7th Duke of Portland (1893–1977), 2nd Chancellor of the University of Nottingham"]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| William Cavendish-Bentinck"]}, {"page": "List of MPs elected in the 1886 United Kingdom general election", "response": ["| William Cavendish-Bentinck"]}, {"page": "George Cavendish-Bentinck", "response": ["Cavendish-Bentinck was born in Westminster, Middlesex, in 1821, the only son of Major-General Lord Frederick Cavendish-Bentinck (1781–1828), fourth son of Prime Minister William Cavendish-Bentinck, 3rd Duke of Portland (1738–1809).  His mother was Mary Lowther (d. 1863), a daughter of William Lowther, 1st Earl of Lonsdale (1757–1844), a Tory politician who served as a Member of Parliament for Appleby, Carlisle, Cumberland, and Rutland."]}, {"page": "David James Jenkins", "response": ["He contested Harwich at the 1868 general election,  without success. At the 1874 general election Jenkins was elected as a Member of Parliament (MP) for Penryn and Falmouth.Craig, Election results 1832–1885, page 236 He held the seat until the 1886 general election, when he was defeated by the Conservative Party candidate William Cavendish-Bentinck."]}, {"page": "Elizabeth Livingston Cavendish-Bentinck", "response": ["On August 12, 1880, she married William George Cavendish-Bentinck (1854–1909), the son of The Rt. Hon. George Augustus Frederick Cavendish-Bentinck (1821–1891) and Prudentia Penelope Leslie (d. 1896), the daughter of Col. Charles Powell Leslie II (1769–1831).  His father, a British barrister and cricketer was also a Conservative member of parliament from 1859 to 1891, who was the only son of Major-General Lord Frederick Cavendish-Bentinck (1781–1828), the fourth son of Prime Minister William Cavendish-Bentinck, 3rd Duke of Portland (1738–1809), and brother to William Bentinck, 4th Duke of Portland (1768–1854).  Together, they had:"]}]}}