{"wiki_id": "http://www.wikidata.org/entity/Q26753886", "itemLabel": "Daniel Ambrose", "itemDescription": "politician, died 1895", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Ambrose", "wikipedia_page": {"main": "Daniel Ambrose (1843 – 17 December 1895) was a medical practitioner and an Irish nationalist politician and Member of Parliament (MP) in the House of Commons of the United Kingdom of Great Britain and Ireland. He was born in Loughill Co Limerick and his parents were Stephen Ambrose, from Ardagh and Margaret Kennedy from Adare.\nHe was elected as an Irish National Federation (Anti-Parnellite) MP for the South Louth constituency at the 1892 general election. He was re-elected at the 1895 general election, but died in office in December 1895. The by-election for his seat was won by the Anti-Parnellite Richard McGhee.\nHis cousin, Robert Ambrose, also served as an Anti-Parnellite MP.", "link_mentions": [{"page": "List of United Kingdom MPs: A", "response": ["|Daniel Ambrose"]}, {"page": "South Louth (UK Parliament constituency)", "response": ["| Daniel Ambrose"]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["| Daniel Ambrose", "*19 March: Louth South - Richard McGhee (Anti-Parnellite) replacing Dr Daniel Ambrose (Anti-Parnellite) who died 17 December 1895"]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| Daniel Ambrose"]}, {"page": "James Gubbins Fitzgerald", "response": ["Fitzgerald did not contest the general election in 1892.  At the general election in 1895 he attempted to dislodge the sitting Anti-Parnellite MP, Daniel Ambrose – also a doctor – at South Louth, but was defeated by almost 2 to 1."]}, {"page": "List of United Kingdom by-elections (1885–1900)", "response": ["|Daniel Ambrose"]}, {"page": "Robert Ambrose (politician)", "response": ["Ambrose wrote A Plea for Industrial Regeneration of Ireland, published in 1909.  His cousin, Daniel Ambrose, also served as an anti-Parnellite MP. Another first cousin, was John Wolfe Ambrose, the man is commemorated in the Ambrose Tunnel in New York."]}, {"page": "Ambrose, Daniel", "response": ["#redirectDaniel Ambrose"]}]}}