{"wiki_id": "http://www.wikidata.org/entity/Q2670594", "itemLabel": "Bob Donaldson", "itemDescription": "Scottish football player (1868-1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bob_Donaldson", "wikipedia_page": {"main": "Robert Donaldson (27 August 1868 – 28 April 1947) was a Scottish footballer. He played as a forward.\nDonaldson played for Airdrieonians and Blackburn Rovers before joining Newton Heath in 1892.  He scored 66 goals in 147 appearances for Newton Heath. The first of these goals, scored against Blackburn Rovers on 3 September 1892, was also the club's first ever league goal. However, Newton Heath lasted just two seasons before demotion to the Second Division, where they remained when Donaldson retired from playing football in 1897.", "link_mentions": [{"page": "Donaldson", "response": ["*Bob Donaldson (1868–1947), Scottish footballer"]}, {"page": "Gilbert Godsmark", "response": ["Gilbert Godsmark (January 1877 – February 1901) was an English footballer who played as an inside forward. Born in Derby, he began his career at Ashford United. In January 1900, he became Newton Heath's first signing for which they paid a fee, joining the club for £40 on the recommendation of forward Bob Donaldson. Half of the fee was paid on signing, with the remainder due if Godsmark were kept on after an initial trial period. He made his debut on 3 February 1900, playing at inside right in a 1–0 home win over Sheffield Wednesday; his performance was well received, with the Athletic News reporting that \"Godsmark proved a great success, he has any amount of dash and ability\".Dykes (1994), pp. 151–2. However, his stay at Newton Heath was curtailed three months later by a call-up to be a reservist with the British Army in the Second Boer War, after just nine league appearances and four goals. After just nine months in South Africa, Godsmark died from an unknown disease. Because his death meant he was unable to return to Newton Heath after the war, despite them retaining his registration after he was enlisted, they withheld the remaining £20 of his fee, for which Ashford served them with a writ."]}, {"page": "1897–98 Small Heath F.C. season", "response": ["Despite still being unable to field a full-strength team, and with players in unaccustomed positions, Small Heath's winning ways continued at home to Newton Heath. A crowd of 6,000 saw Lewis open the scoring with a tap-in after an earlier goal had been disallowed for offside, then William Bryant tied the scores just before half-time. Soon after the interval, Lewis \"whizzed\" a second goal into the net, and Abbott hit the post, before Bob Donaldson's apparent equaliser was disallowed, again for offside.\"Small Heath v. Newton Heath\". Manchester Guardian: p.7. 25 October 1897.'Retlaw' (22 October 1897). \"Football Arrows\". The Birmingham Pictorial and Dart: p.6. The Small Heath club had complained bitterly about their failure to be awarded exemption from the qualification process for the 1897–98 FA Cup, particularly as their less successful neighbours Walsall were exempted. Drawn to visit Burslem Port Vale in the third qualifying round, the club's directors made a \"tempting\" but unsuccessful offer to the host club to switch the venue to Coventry Road.'Captain Forward' (5 November 1897). \"League Tit-Bits\". The Owl (Birmingham): p.4. In a result that \"could scarcely be credited in Birmingham until the evening papers confirmed it\", Port Vale won by two goals to one.'Retlaw' (5 November 1897). \"Football Arrows\". The Birmingham Pictorial and Dart: p.6. Off the field, the club announced that the local schools league were to be allowed to play matches at the Coventry Road ground before their own fixtures.'Captain Forward' (29 October 1897). \"League Tit-Bits\". The Owl (Birmingham): p.4."]}, {"page": "Robert Donaldson", "response": ["* Bob Donaldson (1868–1947), Scottish footballer"]}]}}