{"wiki_id": "http://www.wikidata.org/entity/Q26702498", "itemLabel": "Sithu Aye", "itemDescription": "Scottish progressive metal guitarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Sithu_Aye", "wikipedia_page": {"main": "Sithu Aye  (Burmese: စည်သူမောင်မောင်အေး; born 26 June 1990) is a Scottish-Burmese guitarist, musician, and producer based in Scotland. He began his career with the release of his first album, Cassini, in 2011, which was self-recorded and independently released. He has released five full-length albums and six EPs. His latest album, 10 Years: Remixes and Reimaginings, was released November 29, 2021. He has toured in Japan with Reflections and Protest The Hero, the UK and Europe with Skyharbor, the UK with Galactic Empire and the US and Canada with Haken.", "link_mentions": [{"page": "Mayones Guitars & Basses", "response": ["*Sithu Aye"]}, {"page": "Sithu", "response": ["* Sithu Aye (born 1990), Scottish-Burmese guitarist, musician, and producer based in Scotland"]}, {"page": "Djent", "response": ["The scene has grown rapidly, and members of the original online community, including the bands Chimp Spanner, Sithu Aye, and Monuments, have gone on to tour and release albums commercially. Other bands that often use djent include A Life Once Lost, Veil of Maya, Vildhjarta, and Xerath. Born of Osiris have also been described as being inspired by the djent movement. Furthermore, Hacktivist and DVSR are djent bands that use rapping as primary vocal style."]}, {"page": "Pale Blue Dot (disambiguation)", "response": ["* \"Pale Blue Dot\"; a 2012 song by Sithu Aye."]}, {"page": "Intervals (band)", "response": ["*Headlined in Europe with support from Sithu Aye and The Omnific (June 2019)"]}, {"page": "Reflections (Minnesota band)", "response": ["* Japan Tour with Protest the Hero, Cyclamen and Sithu Aye.Mautner, Zack. (November 13, 2015).\"Protest The Hero To Tour Japan\". It Djents. Retrieved on 2016-04-15."]}, {"page": "Aye", "response": ["* Sithu Aye (born 1990), Scottish-Burmese musician"]}, {"page": "David Maxim Micic", "response": ["* Sithu Aye – Set Course For Andromeda (2016)"]}, {"page": "Plini", "response": ["* I (split EP with Sithu Aye) (2013) ", "* \"Particles Collide\" Invent the Universe (Sithu Aye, 2012)", "* \"Pulse, Pt. 1\" Pulse (Sithu Aye, 2014)"]}]}}