{"wiki_id": "http://www.wikidata.org/entity/Q26701851", "itemLabel": "William Lockhart", "itemDescription": "politician, died 1857", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Lockhart_(MP)", "wikipedia_page": {"main": "William Lockhart (1787 – 25 November 1856) was a British Conservative politician.\nWilliam Lockhart was born in 1787 the eldest son of Rev. Dr John Lockhart of the parish of Blackfriars Glasgow and his first wife Elizabeth Dinwoodie.Lockhart was elected Conservative MP for Lanarkshire at the 1841 general election and held the seat until his death in 1856. It was recognized the although he was no great orator the ‘House of Commons did not possess a better man of business, nor one who studied more attentively the interests of his constituents'.Alongside his role as MP, Lockhart was Dean of Faculties at Glasgow University from 1851 to 1853.He was a Deputy-Lieutenant of Lanarkshire and Colonel Commandant of the Lanarkshire Yeomanry Cavalry.", "link_mentions": [{"page": "Lanarkshire (UK Parliament constituency)", "response": ["|rowspan=\"3\"|William Lockhart"]}, {"page": "Baron Keane", "response": ["*John Manly Arbuthnot Keane, 3rd Baron Keane (1 September 1816 – 27 November 1901) Captain Rifle Brigade. He married firstly on 11 May 1848 in St George's Hanover Square London Mary Jane Palliser (19 November 1801 – 24 October 1881) the daughter Sir Hugh Palliser 2nd Baronet she was formerly married to William Lockhart MP (married 1822, divorced 1835). He married secondly on 6 May 1885 in Kensington Middlesex Francina Maria Morrell née Lane (1825 – 20 November 1901) daughter of Charles Lane and widow of Thomas Morrell Bishop-Coadjutor of Edinburgh. John Baron Keane and Lady Keane died in the same month and are buried in Brookwood Cemetery (North West corner Plot 3). His estate was valued at £13,185 6s 1d."]}, {"page": "List of MPs elected in the 1852 United Kingdom general election", "response": ["|Lanarkshire||William Lockhart||Conservative"]}, {"page": "William Lockhart", "response": ["William Lockhart may refer to:", "* William Lockhart of Lee (1621–1675), Oliver Cromwell's ambassador at Paris", "* William Lockhart (surgeon) (1811–1896), medical missionary and fellow of the Royal College of Surgeons", "* William Lockhart (priest) (1820–1892), English Roman Catholic priest, convert from Anglicanism", "* Sir William Lockhart (Indian Army officer) (1841–1900), British Indian Army general", "* William Lockhart (MP) (1787–1856), British Member of Parliament for Lanarkshire"]}, {"page": "Palliser baronets", "response": ["**Mary Jane Palliser (19 November 1801 – 24 October 1881). Married firstly William Lockhart (1787–1856),  on 16 April 1822 in Walcott Bath,Marriage contract dated 15 April 1822 divorced 1835. Married secondly John Manly Arbuthnot Keane later the 3rd Baron Keane (1816–1901) on 11 May 1848 in St George's Hanover Square London.Marriage certificate - John Manly Arbuthnot Keane and Mary Jane Palliser"]}, {"page": "List of United Kingdom by-elections (1847–1857)", "response": ["|William Lockhart"]}, {"page": "John Coulter (Lord Provost)", "response": ["His daughter, Margaret Coulter, died unmarried in 1794. The family estates then passed to Robert Dinwiddie, her cousin.http://www.glasgowwestaddress.co.uk/Old_Country_Houses/Auchinraith.htm Robert sold it to a distant cousin William Lockhart MP for Lanarkshire.http://www.glasgowwestaddress.co.uk/Old_Country_Houses/Auchinraith.htm"]}]}}