{"wiki_id": "http://www.wikidata.org/entity/Q26722369", "itemLabel": "John Smyth", "itemDescription": "1815 - 1869 (Mr)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_George_Smyth_(1815%E2%80%931869)", "wikipedia_page": {"main": "John George Smyth JP DL MP (5 February 1815 – 10 June 1869) was a Conservative member of Parliament for the City of York from August 28, 1847 to July 11, 1865.Smyth was the eldest son of John Henry Smyth (1780–1822), of  Heath Hall, Wakefield, Yorkshire, a Whig MP for Cambridge University (1812–1822) and Lady Elizabeth Anne FitzRoy, daughter of George FitzRoy, 4th Duke of Grafton. His younger brother, Henry Smyth, was an Army officer and the grandfather of Sir John Smyth, 1st Baronet, recipient of the Victoria Cross.Smyth married the Honourable Diana Bosville Macdonald (12 April 1812 – 8 December 1880), daughter of Godfrey Macdonald, 3rd Baron Macdonald of Sleat, on 25 April 1837. They had four daughters.", "link_mentions": [{"page": "John Smyth", "response": ["John Smyth may refer to:", "*John Smyth (Baptist minister) (1554–1612), considered the earliest Baptist", "*John Smyth (barrister) (1941–2018), British QC", "*John Smyth (footballer) (born 1970), Irish former professional footballer", "*John Smyth (Master of Pembroke) (1744–1809), clergyman and Master of Pembroke College, Oxford", "*John Smyth (minister) (1796–1860), Scottish minister in the Free Church of Scotland ", "*John Smyth (priest) (died 1704), Anglican archdeacon in Ireland", "*John Smyth (sculptor) (c. 1773–1840), Irish sculptor", "*John Smyth (snooker referee) (1928–2007)", "*John Smyth (1748–1811), MP for Pontefract", "*Sir John Smyth, 1st Baronet (1893–1983), British MP, Privy Counsellor in 1962, recipient of the Victoria Cross during the First World War", "*John Smythe (disambiguation)"]}, {"page": "Sir John Smyth, 1st Baronet", "response": ["Smyth was born in 1893 in Teignmouth, Devon, the son of William John Smyth (1869–1893), a member of the Indian Civil Service, and Lilian May Clifford. His grandfather was Army officer Henry Smyth, who was the second son of John Henry Smyth (1780–1822), of Heath Hall, Wakefield, Yorkshire, a Whig MP for Cambridge University (1812–1822) and Lady Elizabeth Anne FitzRoy, daughter of George FitzRoy, 4th Duke of Grafton. His great-uncle John George Smyth was an MP for the City of York.", "*Cricinfo: Brigadier Sir John Smyth"]}, {"page": "John George Smyth", "response": ["* Sir John Smyth, 1st Baronet (1893–1983), British Indian Army officer and member of parliament for Norwood"]}, {"page": "John Smyth (1748–1811)", "response": ["John Smyth (1748–1811) was a British politician who sat in the House of Commons from 1783 to 1807.", "Smyth was the son of John Smyth of Heath Hall, Heath, West Yorkshire and his wife Bridget Foxley, daughter of Benjamin Foxley of London. He was educated at Westminster School and was admitted at  Trinity College, Cambridge in 1766. He married in 1778 Lady Georgiana, eldest daughter of Augustus Henry FitzRoy, 3rd Duke of Grafton.", "***William John Smyth (1869-) of the Indian Civil Service, married Lilian May, daughter of Capt. Henry Clifford, RN, and had issue"]}, {"page": "Henry Smyth (British Army officer, born 1816)", "response": ["In 1865, he married Rebecca Mary Pierce. They had one son, William John Smyth (2 May 1869 – 25 February 1893), a member of the Indian Civil Service, who was the father of Sir John Smyth, 1st Baronet, a recipient of the Victoria Cross."]}, {"page": "John Henry Smyth", "response": ["Smyth inherited Heath Hall, Wakefield, Yorkshire from his father John Smyth (1748–1811), MP of Pontefract from 1783 to 1807. His mother was Lady Georgiana, eldest daughter of Augustus Henry FitzRoy, 3rd Duke of Grafton.", "John Henry married Sarah Caroline Ibbetson, daughter of Henry, on 5 July 1810, but she died the following year on 29 May aged just 25. Three years later on 18 April 1814, he was remarried to his cousin Lady Elizabeth Anne FitzRoy, daughter of his uncle, George FitzRoy, 4th Duke of Grafton. They had two sons and four daughters: his eldest son was John George Smyth, a Conservative MP for City of York (1847–1865), while his second son, Henry Smyth, was an Army officer and the grandfather of Sir John Smyth, 1st Baronet, recipient of the Victoria Cross. His daughters were Elizabeth Sarah, Louisa Georgiana, Maria Isabella, and Frances."]}]}}