{"wiki_id": "http://www.wikidata.org/entity/Q2677094", "itemLabel": "Steven Hartley", "itemDescription": "English Actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Steven_Hartley", "wikipedia_page": {"main": "Steven Hartley (born 12 August 1960, in Shipley) is an English actor known internationally for his television, film and theatre roles. He has appeared in over 60 principal and leading roles on television and film since 1985, including EastEnders, The Bill, The Young Indiana Jones Chronicles, Rumble, Strictly Confidential, Badboys, Trial & Retribution, Sharman, Holby City, Casualty, Doctors, Pie in the Sky, The Cut, Agatha Christie's Marple, Merlin, Married... with Children, The Borgias,  Vera alongside Brenda Blethyn, Ripper Street, and the BAFTA nominated BBC series Happy Valley. Most recently he has appeared in  Silent Witness ,  Brassic for Sky TV  Shadow and Bone for Netflix, All creatures great and small (TV series)) Grace (TV Series).\nHe has worked opposite notable actors on film Including Marlon Brando, Catherine Zeta-Jones, Benicio del Toro, Lauren Bacall, Kristin Scott Thomas, Woody Harrelson and Jon Voight. His films include Allies (2014)  Ruby Strangelove (2015), Robocroc (2013), Jetstream (2012), The Walker (2007), A Dog of Flanders (1999), Christopher Columbus: The Discovery (1992), Split Second (1992), Young Toscanini (1988). \nHartley's extensive theatre work includes reprising his role as Bill Sikes in the West End Musical Oliver! in 2009-2010 for producer Cameron Mackintosh, the third time Hartley has played the role since being cast by director Sam Mendes in 1996 and recently played a leading role in Fit and Proper People for the Royal Shakespeare company at The Soho Theater\nHartley is a legendary performer in the gaming industry with over 20 Video games to his credit. Including Sony Studios' Blood & Truth on PSVR as Tony Sharp, as Luis Belosa in Squadron 42 alongside an all-star cast, including Gary Oldman, Gillian Anderson, Mark Strong and Mark Hamill, voices for Greedfall, The Witcher 3: Wild Hunt (Eredin king of the wild hunt), and Zynbel in the BAFTA award-winning game Hellblade: Senua's Sacrifice. He also has roles in Sword Coast Legends , Dark Souls III, Wolcen, Lords of Mayhem, Nioh 2, Sea of Thieves. Often working in performance capture and motion capture for many of these games.\nHartley has one of the most recognisable voices in the UK,, having voiced countless TV documentaries and TV and radio commercials and has been the station voice of Talksport for 22 years. In 2005, he was nominated for Sexiest Male at the British Soap awards . He was also nominated for a Broadway World West End Award for best takeover for Bill Sikes in Oliver! in 2011.In 2019, Hartley shared his memories of The Bill and his career in general in an interview for The Bill Podcast.", "link_mentions": [{"page": "Oliver!", "response": ["Cameron Mackintosh produced another revival of the show which opened at the London Palladium in the West End on 8 December 1994. The production team included a young Sam Mendes as director, with Anthony Ward as designer, Matthew Bourne as choreographer, Martin Koch as music supervisor and William David Brohn as orchestrator. The cast included Jonathan Pryce (after much persuasion) as Fagin, Sally Dexter as Nancy, Miles Anderson as Bill Sikes, James Villiers as Mr. Brownlow, James Saxon as Mr. Bumble, Jenny Galloway as Widow Corney, David Delve as Mr. Sowerberry and Julia Deakin as Mrs. Sowerberry. The role of Oliver was played by numerous child actors during the run of four years, including Gregory Bradley, Ben Reynolds, Jon Lee, Steven Webb, James Bourne,  James Rowntree and Tom Fletcher, while the Artful Dodger was played by Adam Searles and others including Matt Johnson, Paul Bailey and Bronson Webb. The role of Bet was played by Danielle McCormack, Rosalind James, Francesca Jackson and Lindsey Fawcett.Wolf, Matt. \"Review: Oliver!\", Variety, December 12, 1994 The musical closed on 21 February 1998.\"Oliver! listing, 1994–1998\" thisistheatre.com, retrieved May 28, 2010 The role of Fagin was later played by many notable British actors and comedians including George Layton, Russ Abbot, Jim Dale and Robert Lindsay (who won an Olivier Award for his performance in 1997). Bill Sikes was later portrayed by Steven Hartley and Joe McGann, and Nancy by Sonia Swaby, Claire Moore and Ruthie Henshall.", "When Rowan Atkinson fell ill in April 2009, Russ Abbot stepped in to play the role temporarily.Shenton, Mark. \"Stepping in for Ailing Atkinson, Abbot Will Play Fagin in London Oliver!\" , Playbill, April 3, 2009 Abbot had starred in the 1997 Palladium run. In July 2009, British comedian Omid Djalili replaced Atkinson as Fagin,Shenton, Mark. \"Djalili Succeeds Atkinson as Fagin in London's Oliver! Beginning July 20\" . Playbill, July 20, 2009 receiving positive reviews. In December 2009, Griff Rhys Jones took over as Fagin, with Steven Hartley as Bill Sikes.Paddock, Terri. \"Griff Rhys Jones Takes Over Oliver!s Fagin, 14 Dec\". whatsonstage.com, December 14, 2009 Hartley had played Sikes in the 1997 Palladium production. In March 2010, Kerry Ellis took over the role of Nancy, also receiving positive reviews.Kerry Ellis Gives Oliver! New Oom-pah-pah\" . Whatsonstage.com, March 30, 2010 At the same time, Bleach, D'Silva and Ferguson were replaced by Jason Morell, Christian Patterson and Claire Machin, respectively. In June 2010, Russ Abbot again took over as Fagin. Stephen Moore was a replacement for Mr. Brownlow. Ron Moody, the original Fagin, joined the cast at the end of the performance on 14 June 2010, in celebration of the show's 50th Anniversary. Griff Rhys Jones returned as Fagin in December 2010."]}, {"page": "Shipley, West Yorkshire", "response": ["* Steven Hartley (1960 –), actor, born in Shipley"]}, {"page": "1999 in film", "response": ["| A Dog of Flanders || Warner Bros. Pictures || Kevin Brodie (director/screenplay); Robert Singer (screenplay); Jack Warden, Jeremy James Kissner, Jesse James, Jon Voight, Cheryl Ladd, Steven Hartley, Bruce McGill, Andrew Bicknell, Farren Monet Daniels, Madylin Sweeten, Fred Van Kuyk, Frederick Oxby, Julien Bosman, Bouli Lanners, Anne Grandhenry || Family, Drama || Live action"]}, {"page": "1992 in film", "response": ["| Split Second || Astro Distribution || Tony Maylam, Ian Sharp (directors); Gary Scott Thompson (screenplay); Rutger Hauer, Kim Cattrall, Neil Duncan, Michael J. Pollard, Alun Armstrong, Pete Postlethwaite, Ian Dury, Roberta Eaton, Tony Steedman, Steven Hartley, Sara Stockbridge || Sci-fi || Live action"]}, {"page": "Oliver's Twist", "response": ["| Oliver meets actor Steven Hartley of the police drama The Bill. He invites Hartley's co-stars Trudie and George for a hot and spicy fest."]}, {"page": "Split Second (1992 film)", "response": ["* Steven Hartley as Foster McLaine"]}, {"page": "EastEnders theme tune", "response": ["|9 May 1989 || Matthew Jackson (Steven Hartley) attacks his wife Carmel Jackson (Judith Jacob). There are no drum beats."]}, {"page": "List of former EastEnders characters", "response": ["|Matthew Jackson || Steven Hartley || 1988–1989"]}, {"page": "List of The Bill characters", "response": ["| Tom Chandler || Steven Hartley || 2000-2002 || style=\"text-align:center;\"|115 || Superintendent"]}, {"page": "Carmel Jackson", "response": ["Shortly after Carmel moves to the Square, her brother Darren (Gary McDonald) and his children, Junior (Aaron Carrington) and Aisha (Aisha Jacob), join her. Darren and Carmel are complete opposite of each other; Darren is inconsiderate and often dabbles on the wrong side of the law with dodgy scams, such as porn video laundering and instigating a counterfeit money ring. Carmel despairs over his thoughtless behaviour and criminal antics, but he ignores her and she regularly takes over caring for his two young children. Junior proves to be troublesome, and after Carmel discovers that he has been playing truant from school for some time, she reports Darren to the truancy officer as an irresponsible parent. This does not please Darren and he is even more annoyed when Carmel refuses flatly to put up with his behaviour any longer. Animosity between the two increases when Carmel starts dating Matthew Jackson (Steven Hartley) later that year; Darren is unhappy about his sister dating a white man. Carmel defends Matthew against her brother's racism, and after Darren cons Ian Beale (Adam Woodyatt), she throws him out. Darren then leaves alone, leaving his children so Carmel sends them to her parents as she only has a one bedroom flat.", "Carmel's storylines included a brief relationship with a toyboy, Kelvin Carpenter (Paul Medford), and numerous family and career-based problems. In 1988, Carmel gained a new partner, a white man named Matthew Jackson, played by Steven Hartley. The characters were shown to marry in a register office in January 1989, beginning a domestic violence storyline. By March 1989, Matthew was beating Carmel. This was the first time that EastEnders had dealt with the issue of domestic violence. After several months of abuse, a \"particularly violent\" incident ended with Junior stabbing Matthew with a kitchen knife to protect his aunt. By July 1989, the marriage \"was as good as dead\". Jacob has commented, \"It was a great part to play. People couldn’t understand how a professional woman can stay with someone who beats her. That shows the durability of the character.\""]}, {"page": "Kerry Ellis", "response": ["Her return to the stage for the first time almost a year, Ellis replaced Jodie Prenger in the role of Nancy in Cameron Mackintosh's London revival of Oliver! at Theatre Royal, Drury Lane. Ironically, Ellis had appeared in the BBC talent show I'd Do Anything (2009), mentoring potential Nancys (including Jodie Prenger) in the fore-running to the opening of this London revival. She also mentored potential candidates in Over the Rainbow (2010), BBC's subsequent talent show that searched for a Dorothy Gale for the 2011 musical adaptation of The Wizard of Oz. Ellis first played Nancy on 29 March 2010 to positive reviews, starring alongside Griff Rhys Jones (and later Russ Abbot) as Fagin and Steven Hartley as Bill Sikes. She was the second and final actress to play Nancy in the London revival, continuing the role until the end of the show's run on 8 January 2011. Ellis was nominated for the 2010 BroadwayWorld.com UK Award for Best Leading Actress in a Musical and the 2011 Whatsonstage.com Theatregoers' Choice Award for Best Takeover in a Role but lost to Sheridan Smith as Elle Woods in Legally Blonde and Rachel Tucker as Elphaba in Wicked, respectively."]}, {"page": "List of EastEnders characters (1987)", "response": ["Junior idolises Darren and so he is devastated in July 1988 when his father abandons him and his sister and disappears without a word to anyone. Junior is forced to move away from Walford and go and live with his Grandparents, but he shows up regularly to visit Carmel and gets into more trouble, such as stealing Colin Russell's (Michael Cashman) CD collection and then selling them on to Rod Norman (Christopher McHallem) for a profit. This act even leads to him getting arrested after Colin's boyfriend, Guido (Nicholas Donovan), decides to teach him a lesson and informs the police. He gets off with a warning, but continues to make trouble for himself when he persuades Ricky Butcher (Sid Owen) to buy him alcohol, and is witnessed drinking by Dot Cotton (June Brown). Dot is appalled to see an underage boy getting drunk, and she promptly informs Carmel. By 1989 Junior has become so troublesome that his elderly, sickly grandparents can no longer cope and Carmel is instructed to take both her brother's children in again. This is met unfavourably by Carmel's new husband Matthew Jackson (Steven Hartley), who freely admits that he dislikes Junior immensely.", "In July 1988, Darren abandons both his children and leaves Walford without a word to anyone. Aisha is then sent away from Walford to live with her grandparents. However, the following year, she is sent back to Carmel, much to the annoyance of her abusive husband, Matthew Jackson (Steven Hartley). Matthew finds caring for Aisha a chore and gets annoyed with her for crying, wandering into his bedroom constantly and making his flat a mess. Eventually Carmel and Matthew's marriage comes to an end after Junior stabs Matthew in self-defence. In August 1989 Aisha's grandfather dies, and so the entire Roberts family move away from Walford to tend to Aisha's grieving grandmother."]}, {"page": "List of EastEnders characters (1988)", "response": ["Matthew Jackson, played by Steven Hartley, is the manager of the local music store. He is first seen on screen in May 1988 as a new love interest for the social worker, Carmel Roberts (Judith Jacob). Matthew had had an unhappy childhood. His mother Lynne Jackson (Patricia Ford) had become pregnant at 16 and after bringing him up for 15 years, she had been forced to put him into custody. Matthew was fostered by another family and he had subsequently refused all contact with his mother and rather resented her for abandoning him.", "|  The mother of Darren (Gary McDonald), Carmel (Judith Jacob) and Maxine Roberts (Ella Wilder). She arrives in Walford to visit Carmel looking for answers about Darren and they have a conversation. Following Carmel's engagement to Matthew Jackson (Steven Hartley), Mrs Roberts and her husband begin caring for their grandchildren Junior (Aaron Carrington) and Aisha (Aisha Jacob). In January 1989, Mrs Roberts couldn't attend Carmel and Matthew's wedding because her own mother had \"a turn\" on the day of the ceremony, and sent her prayer book with Maxine in lieu. Later that month, it became apparent that she and her husband could not cope with Junior and Aisha, and Maxine send them to live with Carmel. In August 1989, Mr Roberts dies and Carmel and the children leave Walford to help Mrs Roberts with her grief."]}, {"page": "List of EastEnders characters (1989)", "response": ["Maxine Roberts, played by Ella Wilder, is the selfish sister of Carmel Roberts (Judith Jacob) and Darren Roberts (Gary McDonald), who first appears at Carmel's wedding to Matthew Jackson (Steven Hartley) in January 1989"]}, {"page": "I'd Do Anything (2008 TV series)", "response": ["**Nancys: Facing their fears interacting with rats and acting with Steven Hartley as Bill Sykes"]}, {"page": "Sarah Lark", "response": ["After appearing on I'd do Anything Lark's next major show was as the Strawberry seller in Cameron Mackintosh's revival production of Oliver! at the Theatre Royal, Drury Lane, London. She understudied the part of Nancy, performing it on a few occasions during the absence of winner Jodie Prenger, performing opposite Rowan Atkinson, Omid Djalili and Griff Rhys Jones as Fagin, and Burn Gorman and Steven Hartley as Bill Sykes. Lark departed the cast on 27 March 2010 after performing in the production for 14 months."]}, {"page": "List of Merlin characters", "response": ["King Caerleon (portrayed by Steven Hartley) led mercenaries around Camelot to conquer land. He ran with them, carrying a sword. It is unknown if he was good at sword fighting, but it is assumed that this would be the case since he appeared to lead from the front. Several years before, he fought in the Battle of Denaria and survived which implies that he was skilled in battle."]}, {"page": "Sharman (TV series)", "response": ["* Steven Hartley as Paul O'Dowd"]}, {"page": "The Cut (British TV series)", "response": ["* 'Little' Joey Horton (played by Steven Hartley) is the landlord of the Dive Bar, and was a friend of Jay's grandfather. He first appears in Series 1, when Jay and Fin track him down and demand Jay's cafe back, which Joey won in a poker game. Joey agreed to another game, which Fin won. In Series 2, Frankie finds Joey when trying to track Jay. She is soon joined by Cameron, and Joey intimidates them until the rest of the gang arrive to assist. Joey lets everyone go, but seems to recognise Stephen."]}, {"page": "A Dog of Flanders (1999 film)", "response": ["A Dog of Flanders  is a 1999 film directed by Kevin Brodie and starring Jack Warden, Jeremy James Kissner, Jesse James, Jon Voight, Cheryl Ladd, Steven Hartley, and Bruce McGill. The screenplay was written by Brodie and Robert Singer, based on the 1872 novel of the same name by Ouida. The film was shot on location in Belgium, but ironically not in Antwerp where the story supposedly takes place. It was the fifth film based on the original novel.", "Nello soon introduces Patrasche to his lifelong companion and artistic muse Aloise (Madylin Sweeten), daughter of the local mill owner Nicholas Cogez (Steven Hartley). Meanwhile, Nello and Jehaan struggle to appease their wicked, heartless landlord Stephens (Andrew Bicknell). Despite this plight, Nello sets his hopes on winning a famous art contest to gain respect from the art world. Aloise wholly supports her friend in this endeavor, as does the gregarious local blacksmith William (Bruce McGill). Nello gains a mentor when he meets artist Michel La Grande (Jon Voight) by the statue of Peter Paul Rubens outside the Cathedral of Our Lady. After defending the boy against Patrasche's vagrant first owner, Michel brings him into his study and begins his tutelage, though he leaves for business in Rome soon afterward.", "* Steven Hartley as Nicholas Cogez"]}, {"page": "List of Doctors characters", "response": ["| Steven Hartley"]}, {"page": "Toby Swift", "response": ["| Steven Hartley, Ann Mitchell, Ben Onwukwe, Emma Noakes, Tilly Vosburgh, Simon Treves and Peter Marinker"]}, {"page": "Out of Order (1987 film)", "response": ["* Steven Hartley ...  CID"]}, {"page": "List of The Cut characters", "response": ["|'Little' Joey Horton || Steven Hartley || 1x07, 2x07 || 2"]}, {"page": "Chernobyl: The Final Warning", "response": ["*Steven Hartley as Aleksandr Mashenko"]}, {"page": "List of Doctors characters (2000)", "response": ["Before the series began, Helen married Phil (Mark Adams), with whom she had two children, a son Dan (Joshua Prime) and a daughter Claire (Tara Coleman-Starr). In 2002, Helen becomes a widow when Phil is killed in a car crash. However, at the time of the crash, she is in bed with colleague Marc Elliot (Tom Butcher), and is riddled with guilt until she discovers that Phil was also guilty, hiding the fact he has a second family. Helen and Marc set up \"Best Practice\" together and start a relationship. Over time, Helen grows to dislike Marc and claims she is not in love with him anymore, and Marc leaves to build orphanages in Kosovo. In 2004, Helen falls in love with Dr. Jack Ford (Steven Hartley) and he proposed to her, with Helen agreeing. However, Jack is murdered by his former wife Ria (Mandana Jones), devastating Helen. The next year, Marc returns with a new fiancé, Bella Forest (Sharon Maharaj). However, Marc and Helen realise that they still have feelings for each other, so the pair leave Letherbridge."]}, {"page": "Merlin (series 4)", "response": ["* Steven Hartley as King Caerleon", " would also join the casting playing Agravaine and Lamia. James Callis joined that casting for the fourth episode as Julius Borden. Gemma Jones will play Cailleach the gatekeeper to the spirit world. Lindsay Duncan will appear in one episode playing the Queen of Annis. Steven Hartley also joined the casting as King Caerleon. Rupert Young will also return. Tom Hopper and Adetomiwa Edun confirmed that they will also return on their roles."]}, {"page": "Hartley (surname)", "response": ["* Steven Hartley (born 1960), British actor"]}, {"page": "List of British films of 2014", "response": ["|| Director: Dominic Burns   Cast: Julian Ovenden, Chris Reilly, Matt Willis, Edmund Kingsley, Leon Vickers, Mark Moraghan, Paul Ridley, Frank Leboeuf, Steven Hartley"]}, {"page": "Hellblade: Senua's Sacrifice", "response": ["Set in the late 8th century, the game starts with Senua (Melina Juergens), a Pict warrior from Orkney arriving at the border of Helheim in a quest to save the soul of her dead lover, Dillion (Oliver Walker), from the goddess Hela. Senua believes she suffers from a curse that causes her to hear the voices of spirits, referred to as \"Furies\", in her head, the most notable of which is the Narrator (Chipo Chung), who is aware of the player's presence and often breaks the fourth wall by talking to them directly. She is followed by the Darkness (Steven Hartley), a dark entity at the core of the curse. She carries Dillion's severed head to use it as a vessel for his soul and is guided by her memories of the stories of Druth (Nicholas Boulton), a former slave of the Norsemen well-versed in their legends, now deceased, who became her friend and mentor during a year-long self-imposed exile. To enter Helheim, Senua overcomes several tests and defeats both the fire giant Surt and the god of illusions Valravn, but as she crosses the bridge to Helheim, she is attacked by Hela, who defeats her with a single blow and shatters her sword. Barely surviving the encounter, Senua contemplates suicide, but instead scars herself with her broken blade. She then follows visions of Druth and a man-shaped light she believes to be Dillion to a great tree, where she undergoes four trials that test her body, spirit, and mind and is rewarded with the legendary sword Gramr, a weapon powerful enough to kill Hela. "]}]}}