{"wiki_id": "http://www.wikidata.org/entity/Q26732248", "itemLabel": "John Blencowe", "itemDescription": "politician, died 1900", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Blencowe", "wikipedia_page": {"main": "John George Blencowe (28 February 1817 – 28 April 1900) was a British Liberal Party politician.", "link_mentions": [{"page": "Weston Hall", "response": ["The house is situated in the village of Weston in the south of the county. It was given to the Sitwell family's ancestor Susanna Jennens in 1714 as a St. Valentine's Day present from her uncle Sir John Blencowe, who lived at nearby Marston St Lawrence, after the death of her husband. The property was then inherited through the female line until Sacheverell's father, the eccentric Sir George Sitwell, took a lease on the house from an aunt. The library still contained a recipe book written by Susanna Jennens' mother Anne Blencowe, which was published in 1925."]}, {"page": "Lewes (UK Parliament constituency)", "response": ["| John Blencowe"]}, {"page": "Brackley (UK Parliament constituency)", "response": ["|rowspan=\"2\"| John Blencowe"]}, {"page": "Marston St. Lawrence", "response": ["Sir John Blencowe and his wife Anne Blencowe lived and were buried here. John was a barrister and Anne was noted for gathering recipes.Joan Thirsk, ‘Blencowe , Anne, Lady Blencowe (1656–1718)’, Oxford Dictionary of National Biography, Oxford University Press, Oct 2005; online edn, Jan 2007 accessed 16 Nov 2016 The labouring-class poet Mary Leapor (1722–46) was born in Marston St Lawrence.Stuart Gillespie, ‘Leapor, Mary (1722–1746)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 16 Nov 2016"]}, {"page": "Edmund Probyn", "response": ["Born to William Probyn and his wife Elizabeth, Probyn was baptised on 16 July 1678, and is next recorded as having matriculated at Christ Church, Oxford on 23 April 1695, joining the Middle Temple on 27 November. He was called to the Bar on 15 May 1702, and in 1720 married Elizabeth Blencowe, daughter of Sir John Blencowe."]}, {"page": "List of United Kingdom by-elections (1857–1868)", "response": ["|John Blencowe"]}, {"page": "Anne Blencowe", "response": ["Anne Wallis was born to Susanna Glyde and her husband Professor John Wallis, who taught geometry at Oxford University and was employed as a cryptographer. Anne Wallis is thought to have had a good education. In 1675 she married a barrister, John Blencowe, who had recently inherited Marston Hall and his family's estate at Marston St. Lawrence in Northamptonshire. She became Anne, Lady Blencowe. The couple had seven children and five survived to be adults."]}, {"page": "Blencowe, John", "response": ["#redirectJohn Blencowe"]}]}}