{"wiki_id": "http://www.wikidata.org/entity/Q26845643", "itemLabel": "Robert Everist", "itemDescription": "English entrepreneur", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Everist", "wikipedia_page": {"main": "Robert Lewis Everist (born November 1952) is an English businessman. He was born in Enfield Town in the London conurbation. An entrepreneur, he has set up childcare centres, commercial office space, small schools and plastic manufacturing businesses.", "link_mentions": [{"page": "Attenborough, Nottinghamshire", "response": ["Nearer to the nature reserve is a tennis club, along with a private day-nursery, which, in 2005, along with the Attenborough Prep School, was bought by Robert Everist, who then sold the nursery and closed the 100-year-old school. In media coverage, it was claimed that Everist's company had pressured employees into handing in their notice a week before closing the company. The Attenborough Cricket Club (which doubles as the village green) and St. Mary's Church (a Church of England parish church). This southeastern part of Attenborough is bounded to the northwest by the railway line and on the other three sides by the wetlands of the nature reserve. It is the historic part of the village, with two listed buildings and the listed church itself.Beeston and District Civic Society  Listed buildings"]}, {"page": "Bothamsall", "response": ["The hall was sold in 2009 to couple, Robert Everist and Susan Mills. 2010 saw the start of a significant and vital restoration. The project was financed by the Hall's owners, who use the mansion as their primary home."]}, {"page": "Lound Hall", "response": ["As of 2011 Lound Hall is a private property, belonging to entrepreneur couple Robert Everist and Susan Mills, owners of the Cherubs Group. In 2019 Mills's son, the Made in Chelsea cast member Charlie Mills, named the hall as his address during a court appearance. The house and gardens are not currently open to the public but the exterior and stable courtyard can be seen from footpaths that pass through the grounds and main drive."]}, {"page": "Everist, Robert", "response": ["#redirectRobert Everist"]}]}}