{"wiki_id": "http://www.wikidata.org/entity/Q268196", "itemLabel": "Alan Campbell", "itemDescription": "British politician (born 1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Campbell_(politician)", "wikipedia_page": {"main": "Sir Alan Campbell (born 8 July 1957) is a British Labour Party politician who has been the Member of Parliament (MP) for Tynemouth since 1997. He was appointed as Chief Whip of the Labour Party in May 2021.", "link_mentions": [{"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Alan Campbell", "| Alan Campbell"]}, {"page": "Lancaster University", "response": ["* Alan Campbell, Politics (1978, Furness) – MP for Tynemouth"]}, {"page": "National Executive Committee of the Labour Party", "response": ["In addition, the Chief Whip of the Labour Party (currently Alan Campbell MP) and the Chair of the Parliamentary Labour Party (currently John Cryer MP) attend ex officio without a vote."]}, {"page": "Alan Campbell", "response": ["*Alan Campbell (actor) (born 1957), actor known for his role as Derek Mitchell on the TV series Jake and the Fatman", "*Alan Campbell (footballer, born 1944) (born 1944), Northern Irish footballer", "*Alan Campbell (Gaelic footballer) (born 1991), Irish Gaelic football player", "*Alan Campbell (Irish footballer) (born 1960), former Republic of Ireland international footballer", "*Alan Campbell (pastor) (1949–2017), Pentecostal pastor in Belfast, Northern Ireland", "*Sir Alan Campbell (politician) (born 1957), British Labour Party Member of Parliament", "*Alan Campbell (rower) (born 1983), British Olympic rower", "*Alan Campbell (Scottish footballer) (born 1948), former Scottish football midfielder", "*Alan Campbell (screenwriter) (1904–1963), married to Dorothy Parker", "*Alan Campbell (writer) (born 1971), author of the novels Scar Night and Iron Angel", "*Alan Campbell, Baron Campbell of Alloway (1917–2013), British judge and life peer", "*Sir Alan Campbell (diplomat) (1919–2007), British ambassador to Ethiopia and Italy", "*Alan Campbell-Swinton"]}, {"page": "List of current members of the British Privy Council", "response": ["| Sir Alan Campbell"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Alan Campbell"]}, {"page": "List of United Kingdom MPs: C", "response": ["* Alan Campbell (1997–present)"]}, {"page": "Consett", "response": ["*Alan Campbell (born 1957), Labour MP for Tynemouth and former Home Office Minister for Crime Reduction and Government Whip, was born in the town."]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["* Alan Campbell (b. 1957)"]}, {"page": "Northumbria University", "response": ["* Alan Campbell, MP for Tynemouth"]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Tynemouth || Alan Campbell || Labour || Alan Campbell || Labour"]}, {"page": "Tynemouth (UK Parliament constituency)", "response": ["Tynemouth is a constituency represented in the House of Commons of the UK Parliament since 1997 by Alan Campbell, a member of the Labour Party.", "The seat has historically shown the highest level of support for the Conservative Party in the Tyne and Wear area, with the Conservatives holding the seat for 47 years from 1950 to 1997; though sometimes with only narrow majorities.  However, since the 1997 general election, it has been represented by Alan Campbell of the Labour Party", "The present member, Alan Campbell reached the level of government below a Minister of State in 2008, as a  Parliamentary Under-Secretary of State for the Home Office.", "| Alan Campbell", "For the 2010 election, this was the primary target seat for the Conservatives in North East England following impressive local council victories since 2006 and the recent marginality of Alan Campbell's 2005 re-election.", "Michael McIntyre was councillor for the Whitley Bay Ward at the time of polling. The Conservatives hoped to snatch the seat, but could only diminish Alan Campbell's majority. In the Mayoral election held on the same day, Mayor Linda Arkley (Conservative) narrowly lost re-election.", "Labour MP Alan Campbell was returned in 2001 with a smaller majority during Tony Blair's second landslide."]}, {"page": "List of Parliamentary constituencies in Tyne and Wear", "response": ["|Alan Campbell"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Alan Campbell, Tynemouth, 1997–present"]}, {"page": "Whitley Bay High School", "response": ["* Alan Campbell – MP for Tynemouth, taught History at the school from 1980–9, and married a former pupil."]}, {"page": "Official Opposition frontbench", "response": ["|Alan Campbell", "|Alan Campbell", "Starmer conducted a post-local election reshuffle from 8 to 9 May, which began with the sacking of Angela Rayner as Party Chair and Campaign Coordinator. However, she successfully negotiated a larger role as Shadow Chancellor of the Duchy of Lancaster and Shadow Secretary of State for the Future of Work. Rosena Allin-Khan, Rachel Reeves and Cat Smith received promotions, alongside Alan Campbell, Shabana Mahmood, Lucy Powell and Wes Streeting who joined the Shadow Cabinet. Allin-Khan and Smith became Secretaries of State for their previous portfolios, and Streeting was given the new position of Shadow Child Poverty Secretary. Anneliese Dodds and Thangam Debbonaire changed roles, but Nick Brown and Valerie Vaz left the opposition front bench. Dodds and Mahmood also replaced Jim McMahon and Jo Stevens as front bench Labour NEC representatives."]}, {"page": "Neville Trotter", "response": ["Although his majorities were not huge, he successfully held on to Tynemouth, never being defeated at the polls. In 1992, the year after the Meadow Well Riots in the constituency, his majority was just under six hundred votes. After his retirement, Tynemouth was won by Labour's Alan Campbell."]}, {"page": "List of University of Leeds people", "response": ["*Alan Campbell, Labour Member of Parliament for Tynemouth and former Government Whip (PGCE)"]}]}}