{"wiki_id": "http://www.wikidata.org/entity/Q268702", "itemLabel": "Mary Somerville", "itemDescription": "science writer and polymath", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Somerville", "wikipedia_page": {"main": "Mary Somerville (née Fairfax, formerly Greig; 26 December 1780 – 29 November 1872) was a Scottish scientist, writer, and polymath. She studied mathematics and astronomy, and in 1835 she was elected together with Caroline Herschel as the first female Honorary Members of the Royal Astronomical Society.\nWhen John Stuart Mill, the philosopher and economist, organised a massive petition to Parliament to give women the right to vote, he had Somerville put her signature first on the petition.\nWhen she died in 1872, The Morning Post declared in her obituary that \"Whatever difficulty we might experience in the middle of the nineteenth century in choosing a king of science, there could be no question whatever as to the queen of science\".Somerville College, a college of the University of Oxford, is named after her, reflecting the virtues of liberalism and academic success which the college wished to embody. She is featured on the front of the Royal Bank of Scotland polymer £10 note launched in 2017, alongside a quote from her work The Connection of the Physical Sciences.", "link_mentions": [{"page": "Ada Lovelace", "response": ["When she was a teenager (18), her mathematical talents led her to a long working relationship and friendship with fellow British mathematician Charles Babbage, who is known as \"the father of computers\". She was in particular interested in Babbage's work on the Analytical Engine. Lovelace first met him in June 1833, through their mutual friend, and her private tutor, Mary Somerville.", "Lovelace became close friends with her tutor Mary Somerville, who introduced her to Charles Babbage in 1833. She had a strong respect and affection for Somerville, and they corresponded for many years. Other acquaintances included the scientists Andrew Crosse, Sir David Brewster, Charles Wheatstone, Michael Faraday and the author Charles Dickens. She was presented at Court at the age of seventeen \"and became a popular belle of the season\" in part because of her \"brilliant mind.\" By 1834 Ada was a regular at Court and started attending various events. She danced often and was able to charm many people, and was described by most people as being dainty, although John Hobhouse, Byron's friend, described her as \"a large, coarse-skinned young woman but with something of my friend's features, particularly the mouth\". This description followed their meeting on 24 February 1834 in which Ada made it clear to Hobhouse that she did not like him, probably due to her mother's influence, which led her to dislike all of her father's friends. This first impression was not to last, and they later became friends.", "From 1832, when she was seventeen, her mathematical abilities began to emerge, and her interest in mathematics dominated the majority of her adult life. Her mother's obsession with rooting out any of the insanity of which she accused Byron was one of the reasons that Ada was taught mathematics from an early age. She was privately educated in mathematics and science by William Frend, William King,William King, her tutor, and William King, her future husband, were not related. and Mary Somerville, the noted 19th-century researcher and scientific author. In the 1840s, the mathematician Augustus De Morgan extended her \"much help in her mathematical studies\" including study of advanced calculus topics including the \"numbers of Bernoulli\" (that formed her celebrated algorithm for Babbage's Analytical Engine).Thomas J. Misa, \"Charles Babbage, Ada Lovelace, and the Bernoulli Numbers\" in Ada's Legacy: Cultures of Computing from the Victorian to the Digital Age, edited by Robin Hammerman and Andrew L. Russell (ACM Books, 2015), pp. 18–20, . In a letter to Lady Byron, De Morgan suggested that Ada's skill in mathematics might lead her to become \"an original mathematical investigator, perhaps of first-rate eminence.\"", "Lovelace first met Charles Babbage in June 1833, through their mutual friend Mary Somerville. Later that month, Babbage invited Lovelace to see the prototype for his difference engine. She became fascinated with the machine and used her relationship with Somerville to visit Babbage as often as she could. Babbage was impressed by Lovelace's intellect and analytic skills. He called her \"The Enchantress of Number.\"Some writers give it as \"Enchantress of Numbers\". In 1843, he wrote to her:"]}, {"page": "December 26", "response": ["*1780 – Mary Somerville, Scottish mathematician, astronomer, and author (d. 1872)"]}, {"page": "List of Scots", "response": ["* William Somerville (1771–1860), physician, inspector of the Army Medical Board, husband of Mary Somerville"]}, {"page": "November 29", "response": ["*1872 – Mary Somerville, Scottish-Italian astronomer, mathematician, and author (b. 1780)"]}, {"page": "Refraction", "response": ["Similar acoustics effects are also found in the Earth's atmosphere. The phenomenon of refraction of sound in the atmosphere has been known for centuries;Mary Somerville (1840), On the Connexion of the Physical Sciences, J. Murray Publishers, (originally by Harvard University) however, beginning in the early 1970s, widespread analysis of this effect came into vogue through the designing of urban highways and noise barriers to address the meteorological effects of bending of sound rays in the lower atmosphere."]}, {"page": "Scientist", "response": ["English philosopher and historian of science William Whewell coined the term scientist in 1833, and it first appeared in print in Whewell's anonymous 1834 review of Mary Somerville's On the Connexion of the Physical Sciences published in the Quarterly Review. To be exact, the person coined the term scientist was referred to in Whewell 1834 only as \"some ingenious gentleman.\" Ross added a comment that this \"some ingenious gentleman\" was Whewell himself, without giving the reason for the identification. Ross 1962, p.72. Whewell wrote of \"an increasing proclivity of separation and dismemberment\" in the sciences; while highly specific terms proliferated—chemist, mathematician, naturalist—the broad term \"philosopher\" was no longer satisfactory to group together those who pursued science, without the caveats of \"natural\" or \"experimental\" philosopher. Whewell compared these increasing divisions with Somerville's aim of \"[rendering] a most important service to science\" \"by showing how detached branches have, in the history of science, united by the discovery of general principles.\"  Whewell reported in his review that members of the British Association for the Advancement of Science had been complaining at recent meetings about the lack of a good term for \"students of the knowledge of the material world collectively.\" Alluding to himself, he noted that \"some ingenious gentleman proposed that, by analogy with artist, they might form [the word] scientist, and added that there could be no scruple in making free with this term since we already have such words as economist, and atheist—but this was not generally palatable\"."]}, {"page": "Victorian era", "response": ["As early as 1830, astronomer John Herschel had already recognised the need for the genre of popular science. In a letter to philosopher William Whewell, he wrote that the general public needed \"digests of what is actually known in each particular branch of science... to give a connected view of what has been done, and what remains to be accomplished.\" Indeed, as the British population became not just increasingly literate but also well-educated, there was growing demand for science titles. Mary Somerville became an early and highly successful science writer of the nineteenth century. Her On the Connexion of the Physical Sciences (1834), intended for the mass audience, sold quite well. Arguably one of the first books in the genre of popular science, it contained few diagrams and very little mathematics. It had ten editions and was translated to multiple languages. As its name suggests, it offered readers a broad overview of the physical sciences at a time when these studies were becoming increasingly distinct and specialised. It was the most popular science title from the publisher John Murray until Charles Darwin's On the Origin of Species (1859). Although Somerville's rendition of Pierre-Simon de Laplace's masterpiece Mécanique Céleste, The Mechanism of the Heavens (1831), was intended to inform the masses of the latest advances in Newtonian mechanics and gravitation, it was also used as a textbook for students at the University of Cambridge till the 1880s."]}, {"page": "1833", "response": ["* June 5 – Ada Lovelace is introduced to Charles Babbage by Mary Somerville."]}, {"page": "1872", "response": ["* November 28 – Mary Somerville, British mathematician (b. 1780)"]}, {"page": "1830s", "response": ["* June 5, 1833 – Ada Lovelace is introduced to Charles Babbage by Mary Somerville."]}, {"page": "Natural science", "response": ["By the 19th century, the study of science had come into the purview of professionals and institutions. In so doing, it gradually acquired the more modern name of natural science. The term scientist was coined by William Whewell in an 1834 review of Mary Somerville's On the Connexion of the Sciences. But the word did not enter general use until nearly the end of the same century."]}, {"page": "Somerville College, Oxford", "response": ["This new effort resulted in the founding of Somerville Hall, named after the then recently deceased Scottish mathematician and renowned scientific writer Mary Somerville. It was felt that the name would reflect the virtues of liberalism and academic success which the college wished to embody. She was admired by the founders of the college as a scholar, as well as for her religious and political views, including her conviction that women should have equality in terms of suffrage and access to education.", "Today House is home to only one or two students, and, until 2014, it housed the college bar. It also contains Green Hall, where guests to college are often greeted and in which prospective students are registered and wait for interviews; some of the college's paintings by Roger Fry are located here. Most of the administration of college, and the academic pigeon-holes are in House, as is the Mary Somerville Room, a reception room featuring paintings by Mary Somerville, George Romney and George Frederic Watts.", "Amelia Edwards, John Stuart Mill, John Ruskin and Vera Brittain have been notable benefactors to the library. It contains paintings by Mary Somerville, John Constable, Maud Sumner and Patrick George.", "There was no hall large enough to seat the entire college until 1911, when Maitland Hall and Maitland, designed by Edmund Fisher in Queen Anne style and Edwardian Baroque, were opened by H. A. L. Fisher, the Vice-Chancellor of the university and Gilbert Murray. Murray, whose translations of Greek drama were performed at Somerville in 1912 and 1946, supported Somerville in many ways, including endowing its first research fellowship. A fund was raised as a memorial to Miss Maitland, Principal of Somerville Hall (College from 1894) from 1889 to 1906, and the money was used to pay for oak panelling in Hall. The panelling of the south wall was designed to frame a portrait of Mary Somerville by John Jackson. The buildings were constructed on the site of an adjoining building gifted to Somerville by E. J. Forester in 1897 and bought from University and Balliol Colleges for £4,000 and £1,400 respectively. There was difficulty in constructing the buildings, now thought to have resulted from the outer limit of the Oxford city fortifications running under the site. In 1935, Morley Horder reconstructed the archway connecting Maitland Hall and the south wing of Walton House, creating a Reading Room off the main hall; in 1947, André Gide gave a lecture that filled both these rooms and the staircase and quadrangle outside.", "The first principal of Somerville Hall was Madeleine Shaw-Lefèvre (1879–1889). The first principal of Somerville College was Agnes Catherine Maitland (1889–1906), when in 1894 it became the first of the five women's halls to adopt the title of college, the first to appoint its own teaching staff, the first to set an entrance examination, and the first to build a library. She was succeeded by the classical scholar Emily Penrose (1906–1926), who set up in 1903 the Mary Somerville Research Fellowship offering women in Oxford opportunities for research.", "The two colours also feature in the college's coat of arms, which depicts three mullets in chevron reversed gules, between six crosses crosslet fitched sable. The college's motto, Donec rursus impleat orbem, was originally that of the family of Mary Somerville. Her family befriended the new hall, allowing it to adopt their arms and motto. The Latin motto itself is described as \"baffling\" as, although it translates as \"Until It Should Fill the World Again\", what the subject of the sentence (\"it\") is left unspecified. The crest, which is often omitted, is a hand grasping a crescent and occasionally a helmet with mantling is added."]}, {"page": "Timeline of photography technology", "response": ["* 1826 – Mary Somerville a Scottish science writer and polymath conducted a series of experiments to explore the relationship between light and magnetism and she published her first paper, \"The magnetic properties of the violet rays of the solar spectrum\", in the Proceedings of the Royal Society.https://mathshistory.st-andrews.ac.uk/Biographies/Somerville/"]}, {"page": "Scottish Enlightenment", "response": ["* Mary Somerville (1780–1872) science writer, astronomer, polymath"]}, {"page": "William Whewell", "response": ["One of Whewell's greatest gifts to science was his wordsmithing. He often corresponded with many in his field and helped them come up with new terms for their discoveries.  In fact, Whewell came up with the term scientist itself in 1833, and it was first published in Whewell's anonymous 1834 review of Mary Somerville's On the Connexion of the Physical Sciences published in the Quarterly Review. To be exact, the person coined the term scientist was referred to in Whewell 1834 only as \"some ingenious gentleman.\" Ross added a comment that this \"some ingenious gentleman\" was Whewell himself, without giving the reason for the identification. Ross 1962, p.72. (They had previously been known as \"natural philosophers\" or \"men of science\")."]}, {"page": "Mary Augusta Ward", "response": ["Ward became very involved in the negotiations surrounding the foundation of Somerville College in Oxford in 1879. She suggested that the new institution should be named after Mary Somerville. Ward was appointed as the first secretary of the Somerville Council and prepared for the arrival of new students despite being eight months pregnant when Somerville opened in October 1879."]}, {"page": "Caroline Herschel", "response": ["She was the first woman to receive a salary as a scientist. She was the first woman in England to hold a government position. She was the first woman to publish scientific findings in the Philosophical Transactions of the Royal Society, to be awarded a Gold Medal of the Royal Astronomical Society (1828), and to be named an Honorary Member of the Royal Astronomical Society (1835, with Mary Somerville). She was also named an honorary member of the Royal Irish Academy (1838). The King of Prussia presented her with a Gold Medal for Science on the occasion of her 96th birthday (1846).", "The Royal Astronomical Society elected her an Honorary Member in 1835, along with Mary Somerville; they were the first women members. She was also elected as an honorary member of the Royal Irish Academy in Dublin in 1838."]}, {"page": "Thomas Phillips", "response": ["Phillips also painted portraits of Walter Scott, Robert Southey, George Anthony Legh Keck (1830), Thomas Campbell (poet), Joseph Henry Green, Samuel Taylor Coleridge, Henry Hallam, Mary Somerville, Sir Edward Parry, Sir John Franklin, Dixon Denham, the African traveller, and Hugh Clapperton. Besides these he painted two portraits of Sir David Wilkie, the Duke of York (for the town-hall, Liverpool), Dean William Buckland, Sir Humphry Davy, Samuel Rogers, Michael Faraday (engraved in mezzotint by Henry Cousins), John Dalton, and a head of Napoleon I, painted in Paris in 1802, not from actual sittings, but with Empress Josephine's consent, who afforded him opportunities of observing the First Consul while at dinner. Years later in Paris, he was to portray his younger colleague Ary Scheffer (c. 1835, Musée de la Vie romantique, Paris)."]}, {"page": "1780 in literature", "response": ["*December 26 – Mary Somerville, Scottish science writer and polymath (died 1872)"]}, {"page": "Alexander Nasmyth", "response": ["Nasmyth set up a drawing school and \"instilled a whole generation with the importance of drawing as a tool of empirical investigation\"; his pupils included David Wilkie, David Roberts, Clarkson Stanfield and John Thomson of Duddingston; and it was probably from him that John James Ruskin (father of John Ruskin) learned to paint as a schoolboy in Edinburgh in the later 1790s. Another successful pupil was the painter, teacher, art dealer and connoisseur Andrew Wilson, who had his first art training under Nasmyth. Nasmyth was not only the tutor to the polymath Mary Somerville but he also introduced her to the leading intellectuals in Edinburgh."]}, {"page": "Banknotes of the pound sterling", "response": ["As of August 2017, the Royal Bank of Scotland is in the process of adopting a new series of banknotes. These will be made of polymer. Two (the £5 and £10 notes) have already been released, whilst a new £20 note is being designed. The £5 note shows Nan Shepherd on the obverse accompanied by a quote from her book 'The Living Mountain', and the Cairngorms in the background. The reverse displays two mackerel, with an excerpt from the poem  (The Choice) by Scottish Gaelic poet Sorley MacLean. The obverse of the £10 note shows Mary Somerville, with a quote from her work 'The Connection of the Physical Sciences', and Burntisland beach in the background. The reverse displays two otters and an excerpt from the poem 'Moorings' by Norman MacCaig. The obverse of the £20 note, to be introduced in 2020, will show Catherine Cranston.", "| align=\"center\" |  || £10||Mary Somerville ||otter"]}, {"page": "Popular science", "response": ["thumb|Title page of Mary Somerville's On the Connexion of the Physical Sciences (1834), an early popular-science book.", "As early as 1830, astronomer John Herschel had recognized the need for the genre of popular science. In a letter to philosopher William Whewell, he wrote that the general public needed \"digests of what is actually known in each particular branch of science... to give a connected view of what has been done, and what remains to be accomplished.\" Indeed, as the British population became not just increasingly literate but also well-educated, there was growing demand for science titles. Mary Somerville became an early and highly successful science writer of the nineteenth century. Her On the Connexion of the Physical Sciences (1834), intended for the mass audience, sold quite well. Arguably one of the first books in the genre of popular science, it contained few diagrams and very little mathematics. It had ten editions and was translated into multiple languages. It was the most popular science title from the publisher John Murray until On the Origin of Species (1859) by Charles Darwin."]}, {"page": "Francis Beaufort", "response": ["Francis Beaufort was descended from French Protestant Huguenots, who fled the French Wars of Religion in the sixteenth century. His parents moved to Ireland from London. His father, Daniel Augustus Beaufort, was a Protestant clergyman from Navan, County Meath, Ireland, and a member of the learned Royal Irish Academy. His mother Mary was the daughter and co-heiress of William Waller, of Allenstown House. Francis was born in Navan on 27 May 1774. He had an older brother, William Louis Beaufort and three sisters, Frances, Harriet, and Louisa. His father created and published a new map of Ireland in 1792. Francis grew up in Wales and Ireland until age fourteen.:Image:BeaufortTomb.JPG He left school and went to sea, but never stopped his education. By later in life, he had become sufficiently self-educated to associate with some of the greatest scientists and applied mathematicians of his time, including Mary Somerville, John Herschel, George Biddell Airy, and Charles Babbage."]}, {"page": "Jedburgh", "response": ["Several notable people were born in the town, including Reverend Doctor Thomas Somerville's niece, Mary Somerville in 1780 (the eminent scientist and writer, after whom Somerville College, Oxford is named, and who appeared on the Royal Bank of Scotland £10 note from 2017)."]}, {"page": "Burntisland", "response": ["* Mary Somerville, science writer and polymath"]}, {"page": "1826 in science", "response": ["* Mary Somerville presents a paper on \"The Magnetic Properties of the Violet Rays of the Solar Spectrum\" to the Royal Society in London."]}, {"page": "1831 in science", "response": ["* Mary Somerville translates Laplace's Mécanique céleste as The Mechanism of the Heavens."]}, {"page": "1833 in science", "response": ["* June 5 – Ada Lovelace is introduced to Charles Babbage by Mary Somerville."]}, {"page": "1835 in science", "response": ["* Caroline Herschel and Mary Somerville become the first women members of the Royal Astronomical Society."]}, {"page": "1780 in science", "response": ["* December 26 – Mary Somerville, British scientific writer (died 1872)."]}, {"page": "Maria Mitchell", "response": ["Mitchell traveled to Europe in 1857. While abroad, Mitchell toured the observatories of contemporary European astronomers Sir John and Caroline Herschel and Mary Somerville. She also spoke with a number of natural philosophers including Alexander von Humboldt, William Whewell, and Adam Sedgewick before continuing her travels with Nathaniel Hawthorne and his family. Mitchell never married, but remained close to her immediate family throughout her life, even living in Lynn, Massachusetts with her sister Kate and her family in 1888.", "Though Mitchell herself did not have a college education, she was appointed professor of astronomy at Vassar College by its founder, Matthew Vassar, in 1865 and became the first female professor of astronomy. Mitchell was the first person appointed to the faculty and was also named director of the Vassar College Observatory, a position she held for more than two decades. Mitchell also edited the astronomical column of Scientific American during her professorship. Thanks in part to Mitchell's guidance, Vassar College enrolled more students in mathematics and astronomy than Harvard University from 1865 to 1888. In 1869, Mitchell joined Mary Somerville and Elizabeth Cabot Agassiz in becoming some of the first women elected to the American Philosophical Society. Hanover College, Columbia University, and Rutgers Female College granted Mitchell honorary degrees."]}, {"page": "Mary Fairfax Somerville", "response": ["#REDIRECT Mary Somerville"]}, {"page": "Agnes Mary Clerke", "response": ["In 1893, Agnes was awarded the Actonian Prize of 100 guineas by the Royal Institution. As a member of the British Astronomical Association she attended its meetings regularly, as well as those of the Royal Astronomical Society. In 1903, with Margaret Lindsay Huggins, she was elected an honorary member of the Royal Astronomical Society, a rank previously held only by three other women, Caroline Herschel and Mary Somerville (in 1835), and Anne Sheepshanks (in 1862)."]}, {"page": "Anthotype", "response": ["An anthotype is an image created using photosensitive material from plants. This  process was originally invented by Mary Somerville who presented her research to Sir John Herschel (who is often misquoted as the inventor) in 1842. An emulsion is made from crushed flower petals or any other light-sensitive plant, fruit or vegetable. A coated sheet of paper is then dried. Place some material, for example leaves or a transparent photo positive on the paper and expose to direct full sunlight until the image part not covered by the material is bleached out by the sun rays. The color remains  in the shadowed parts. The paper remains sensitive against such rays."]}, {"page": "List of Scottish scientists", "response": ["| Mary Somerville"]}, {"page": "Science book", "response": ["Mary Somerville's On the Connexion of the Physical Sciences (first edition 1834) was arguably the first book in the genre of popular science."]}, {"page": "Somerville (crater)", "response": ["This is one of a handful of lunar craters named after a woman, Mary Somerville."]}, {"page": "John Murray (publishing house)", "response": ["He was succeeded by his son John Murray II, who made the publishing house important and influential. He was a friend of many leading writers of the day and launched the Quarterly Review in 1809. He was the publisher of Jane Austen, Sir Walter Scott, Washington Irving, George Crabbe, Mary Somerville and many others. His home and office at 50 Albemarle Street in Mayfair was the centre of a literary circle, fostered by Murray's tradition of \"Four o'clock friends\", afternoon tea with his writers."]}, {"page": "Google Doodle", "response": ["In addition to celebrating many well-known events and holidays, Google Doodles celebrate artists and scientists on their birthdays, including Mary Somerville, Andy Warhol, Albert Einstein, Leonardo da Vinci, Rabindranath Tagore, Louis Braille, Ella Fitzgerald, Percival Lowell, Edvard Munch, Nikola Tesla, Béla Bartók, René Magritte, Norman Hetherington, John Lennon, Steve Irwin, Audrey Hepburn, Michael Jackson, Vladimir Dakhno, Robert Moog, Frankie Manning, Akira Kurosawa, Satyajit Ray, H. G. Wells, Freddie Mercury, Samuel Morse, Hans Christian Ørsted, Mahatma Gandhi, Dennis Gabor, Édith Piaf, Constantin Brâncuși, Antonio Vivaldi, Abdel Halim Hafez, Teresa Teng, Umm Kalthoum, Jules Verne, Leonhard Euler, Lucille Ball, Hedy Lamarr, and James Welch, among over 9,000 others. The featuring of Lowell's logo design coincided with the launch of another Google product, Google Maps. Google Doodles are also used to depict major events at Google, such as the company's own anniversary. The celebration of historic events is another common topic of Google Doodles including a Lego brick design in celebration of the interlocking Lego block's 50th anniversary. Some Google Doodles are limited to Google's country-specific home pages while others appear globally."]}]}}