{"wiki_id": "http://www.wikidata.org/entity/Q26838336", "itemLabel": "Diana Lambert", "itemDescription": "British actor (1931-1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Diana_Lambert", "wikipedia_page": {"main": "Diana Lambert (1931–1995) was a British actress.She was born on 17 September 1931 in Kensington, London, England as Diana Charlotte Herrmann. She was an actress, known for The Nun's Story (1959), Seance on a Wet Afternoon (1964) and Vicky's First Ball (1956). She played Anna in episode 28 of The Adventures of William Tell, The Avenger (1959).\nLambert was also in Mrs Thursday, The Famous Five and appeared in the BBC department store sitcom Are You Being Served? three  times (1976 and 1985), once playing a customer and the other two playing Captain Peacock's long suffering, battle axe wife.She died in Kensington, London in 1995 aged 63.", "link_mentions": [{"page": "List of Are You Being Served? characters", "response": ["=== Mrs Peacock (Diana King/Diana Lambert) (series 4, 8, 9, 10) ===", "Mrs Peacock (Diana King/Diana Lambert) was the long-suffering wife of Captain Peacock. She always suspected Captain Peacock of cheating on her and all her on-screen appearances were during periods of marital discord. In Mrs Peacock's first appearance (\"Oh What A Tangled Web\"), she suspected Captain Peacock of having an affair with Mr Rumbold's secretary, Miss Hazelwood, because her brother had seen them in a car together, although he was later cleared. In her second appearance (\"A Personal Problem\"), because Captain Peacock had accidentally put his hands down Miss Pickthorpe's cleavage to retrieve some spilt blancmange and semolina pudding at a party (the department Miss Pickthorpe works for was never specified, and the semolina pudding turned out to be Mr Harrowgate and Miss Fawcett the year before. Like Miss Pickthorpe, their department was never found out). Mrs Peacock became Mr Rumbold's secretary, and she pretended that she was having an affair with him to make Captain Peacock jealous. In her third appearance (\"The Sweet Smell of Success\"), Mrs Peacock burst into Mr Rumbold's office because she suspected Captain Peacock of flirting with Mr Rumbold's new secretary, Miss Belfridge. In her fourth appearance (\"Grounds For Divorce\"), Captain Peacock chose to stay with her rather than a bank/accounts clerk who had become infatuated with him. In her fifth appearance (\"Friends And Neighbours\"), Mrs Peacock came to the Grace Brothers houses to check up on her husband (like Mrs Rumbold), but she left satisfied (unlike Mrs Rumbold). Captain Peacock once mentioned that she had many brothers and sisters (\"His And Hers\" and \"The Think Tank\"). By the time of Grace and Favour, Mrs Peacock seems to be either dead or divorced from Captain Peacock as she is neither seen nor mentioned.", "* Diana Lambert (\"Fifty Years On\", as the Six-Pound Fox Customer); also appeared as Mrs. Peacock in two episodes, died 1994–5"]}, {"page": "The Vicious Circle (1957 film)", "response": ["* Diana Lambert - Latimer's Office Nurse"]}, {"page": "Crane (TV series)", "response": ["4. A Danger To Others. When Julie Lamont disappears, Crane and Orlando are asked to find her. They expect to find her dead but there are surprises in store. Sally Home as Julie Lamont, Eric Pohlmann as Dr. Knunsden, Diana Lambert as Francine, John Bryans as Dr. Mustapha, Michael Godfrey as Perez."]}, {"page": "Act of Violence (1956 TV play)", "response": ["*Diana Lambert - Katina Kroz"]}]}}