{"wiki_id": "http://www.wikidata.org/entity/Q26806300", "itemLabel": "Harry Nicholls", "itemDescription": "English actor and comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Nicholls_(comedian)", "wikipedia_page": {"main": "Henry Thomas \"Harry\" Nicholls (1 March 1852 – 29 November 1926) was an English actor, comedian, songwriter and playwright, popular during the Victorian era. As an actor, he appeared in music hall, Victorian burlesques and Edwardian musical comedy. He was perhaps best known for starring in the Theatre Royal, Drury Lane's annual Christmas pantomimes, alongside Dan Leno and Herbert Campbell and as the author of long-running musicals at the Gaiety Theatre.", "link_mentions": [{"page": "1882 in music", "response": ["* \"In My Fust 'Usband's Time\" (w.m. Harry Nicholls)"]}, {"page": "Dan Leno", "response": ["After these pantomime performances proved popular with audiences, Leno was hired in 1888 by Augustus Harris, manager at the Theatre Royal, Drury Lane, to appear in that year's Christmas pantomime, Babes in the Wood.Anthony, p. 88 Harris's pantomime productions at the huge theatre were known for their extravagance and splendour. Each one had a cast of over a hundred performers, ballet dancers, acrobats, marionettes and animals, and included an elaborate transformation scene and an energetic harlequinade. Often they were partly written by Harris.\"Mr. Pitcher's Art\", Obituary, The Times, 3 March 1925Anthony, p. 87 Herbert Campbell and Harry Nicholls starred with Leno in the next fifteen Christmas productions at Drury Lane. Campbell had appeared in the theatre's previous five pantomimes and was a favourite of the writer of those productions, E. L. Blanchard. Blanchard left the theatre when Leno was hired, believing that music hall performers were unsuitable for his Christmas pantomimes. This was not a view shared by audiences or the critics, one of whom wrote: "]}, {"page": "Harry Nicholls", "response": ["Harry Nicholls VC (21 April 1915 – 11 September 1975) was an English recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces."]}, {"page": "Widow Twankey", "response": ["*Harry Nicholls 1885 Royal Strand Theatre"]}, {"page": "Augustus Harris", "response": ["At Drury Lane, Harris continued to devise elaborate spectacle and effects for his melodramas: in A Life of Pleasure (1893) there was a representation of the promenade at the Empire music hall, and in Cheer Boys, Cheer (1895) the sinking of HMS Birkenhead was spectacularly  portrayed.Mander and Mitchenson, p. 69 He continued to stage the annual pantomimes, which he wrote in collaboration with Harry Nicholls and others. They ran from Christmas to Easter. An example from the 1890s is Little Bo-Peep, Little Red Riding Hood and Hop o' my Thumb (1892) with Marie Loftus, Marie Lloyd and Little Tich in the title roles, Dan Leno and Herbert Campbell as Mr and Mrs Thumb, and Arthur Williams as the Dame, heading a cast of more than 40. The reviewer in the theatrical paper The Era remarked that every year people felt that Harris had \"reached the limit of splendour and ingenuity\", and were proved wrong the following year.\"Drury Lane\", The Era, 29 December 1892, p. 8", "*Babes in the Wood (Blanchard and Harry Nicholls) 1888WorldCat "]}, {"page": "A Runaway Girl", "response": ["A Runaway Girl is a musical comedy in two acts written in 1898 by Seymour Hicks and Harry Nicholls.  The composer was Ivan Caryll, with additional music by Lionel Monckton and lyrics by Aubrey Hopwood and Harry Greenbank.  It was produced by George Edwardes at the Gaiety Theatre, London, opening on 21 May 1898 and ran for a very successful 593 performances.  It starred Hicks's wife, Ellaline Terriss and Edmund Payne."]}, {"page": "Nicholls (name)", "response": ["* Harry Nicholls (comedian) (1852–1926), English comedian", "* Harry Nicholls (1915–1975), English recipient of the Victoria Cross"]}, {"page": "List of British music hall performers", "response": ["* Harry Nicholls (1852–1926)"]}, {"page": "The Toreador", "response": ["The Toreador is an Edwardian musical comedy in two acts by James T. Tanner and Harry Nicholls, with lyrics by Adrian Ross and Percy Greenbank and music by Ivan Caryll and Lionel Monckton.  It opened at the Gaiety Theatre in London, managed by George Edwardes, on  17 June 1901 and ran for an extremely successful 675 performances.  It starred Marie Studholme, Gertie Millar, Harry Grattan, Edmund Payne, George Grossmith, Jr. and the young Sidney Bracy.  Gabrielle Ray later joined the cast.  The show also enjoyed Broadway runs in 1902 and 1904 and toured internationally."]}, {"page": "The Messenger Boy", "response": ["*Hooker Pasha (Commissioner of the Nile) – Harry Nicholls"]}, {"page": "The Music Hall Guild of Great Britain and America", "response": ["| Harry Nicholls (comedian)"]}, {"page": "Jane (1915 film)", "response": ["Jane is a 1915 American silent film produced by the Oliver Morosco company and distributed by Paramount Pictures. It is based on a stage play Jane by W.H. Lestocq and Harry Nicholls. Frank Lloyd directed, early in his career, and up-and-coming stage comic Charlotte Greenwood debuts and stars in her first motion picture. This was Lloyd's second directed feature film after several years of making shorts. This film survives in the Library of Congress.Jane at silentera.com databaseThe American Film Institute Catalog Feature Films:1911-20 by The American Film Institute, c.1988The Library of Congress American Silent Feature Film Survival CatalogCatalog of Holdings The American Film Institute Collection and The United Artists Collection at The Library of Congress, (<-book title) p.92 c.1978 by the American Film Institute"]}, {"page": "Theatre productions of Dan Leno", "response": [" One critic wrote that \"'the cake' for frolicsome humour is taken by the dapper new-comer, Mr. Dan Leno, who is sketched as the galvanic baroness in the wonderfully amusing dance which sets the house in a roar. The substantial \"babes\", Mr. Herbert Campbell and Mr. Harry Nicholls, would have no excuse if they did not vie in drollery with the light footed Dan Leno.\"Penny Illustrated Paper, 5 January 1887, pp. 12–13 Babes was a triumph: the theatre reported record attendance, and the run was extended until 27 April 1889.Brandreth, p. 28 Leno went on to star in a total of 16 Christmas pantomimes at Drury Lane from 1888 to 1904.Anthony, p. 88; after Harris died in 1896, Arthur Collins became manager at Drury Lane and helped to write the pantomimes. In 15 of these, he played alongside Herbert Campbell, a veteran pantomime performer, with Leno playing predominantly dame roles.Disher, p. 56 Leno became famous for his characterisations of dame roles, and he was described as the \"precursor of contemporary pantomime dames\".Taylor, p. 108", "| By Augustus Harris. Co-starring E. L. Blanchard and Harry Nicholls.Anthony, p. 88", "| By Augustus Harris and Harry Nicholls. Nicholls and Campbell played King and Queen.\"Theatre Royal, Drury Lane: Jack and the Beanstalk, 1890\", British Library Evonian Catalogue, accessed 15 January 2013Anthony, p. 91", "| By Harry Nicholls and Augustus Harris. Little Tich played the title role with Marie Lloyd as Princess Allfair and Fanny Leslie as King Dulcimar.Anthony, p. 114", "| By Augustus Harris and Harry Nicholls.  The production co-starred Marie Lloyd as Polly Perkins and Little Tich as Man Friday.\"The origin of popular pantomime stories\", Victoria and Albert Museum website, accessed 10 February 2013", "| By Arthur Sturgess and Arthur Collins. Music by Walter Slaughter.  Leno starred with Harry Nicholls, Herbert Campbell, Johnny Danvers and Charles Lauri.\"Jack and the Beanstalk\", The Era, 2 December 1899, p. 8"]}, {"page": "Herbert Campbell", "response": ["During his solo career, Campbell made a successful transition from music hall performer to variety artist. Unlike many of his peers, he was embraced by audiences and performed a number of songs, including: \"When You Come to Think of It\" by Harry Nicholls, \"A Seaside Holiday at Home\", \"Mama's Darling Boy\",  \"We Don't Want to Fight\", \"The Great McNoodle\" and \"In my fust 'usband's time\",Sounds of the Music Hall , 124b.com, accessed 21 April 2012 Later on in life, Campbell, Leno and comedian Harry Randall decided to go into business together and formed a music hall management company. Quite often they would top their own bills."]}, {"page": "Hugh J. Ward", "response": ["*Sir Bingo Preston, the British Consul in A Runaway Girl by Seymour Hicks and Harry Nicholls, composer Ivan Caryll 1902"]}, {"page": "Harry nicholls (actor)", "response": ["#REDIRECT Harry Nicholls (comedian)"]}, {"page": "William Lestocq", "response": ["His authorship credits (often as co-author) include the plays A Bad Penny (1882), The Sultan of Mocha (1887), Uncles and Aunts (1888), In Danger (1889), Jane (1890) (with Harry Nicholls), The Sportsman (1893) (adaptation of Monsieur chasse! by Georges Feydeau), and The Foundling (1894) (with E.M. Robson).Who's who in the Theatre, p. 377 (1916)", "* Jane: A Farce in Three Acts (with Harry Nicholls)"]}, {"page": "Daly's Theatre (30th Street)", "response": ["* 1898 and 1900: A Runaway Girl, an Edwardian musical comedy, with music by Ivan Caryll and Lionel Monckton, book by Harry Nicholls and Seymour Hicks and lyrics by Aubrey Hopwood and Harry Greenbank"]}, {"page": "1901 in British music", "response": ["*17 June – The Toreador, with book by James T. Tanner and Harry Nicholls, music by Ivan Caryll and Lionel Monckton, and lyrics by Adrian Ross and Percy Greenbank, opens at the Gaiety Theatre (later moving to the Comedy Theatre, and runs for 675 performances. "]}, {"page": "Aubrey Hopwood", "response": ["With Harry Greenbank he wrote the lyrics for the Edwardian musical comedy  A Runaway Girl (1898)Gänzl, Kurt, The British Musical Theatre (2 vols.; 1986 Macmillan Press), p. 692  to a book by Seymour Hicks and Harry Nicholls and a score by Ivan Caryll and additional music by Lionel Monckton. It was produced by George Edwardes at the Gaiety Theatre in London, opening on 21 May 1898 and ran for a very successful 593 performances. The piece ran at Daly's Theatre in New York City in 1898 for 216 performances and again in 1900.\"Daly's Theatre\", Internet Broadway Database, accessed November 29, 2018 The production starred Edmund Payne and Hicks's wife, Ellaline Terriss."]}]}}