{"wiki_id": "http://www.wikidata.org/entity/Q2685516", "itemLabel": "Percy Boomer", "itemDescription": "English golfer", "wikipedia_url": "https://en.wikipedia.org/wiki/Percy_Boomer", "wikipedia_page": {"main": "Percy Hugh Boomer (1885 – 29 April 1949) was a professional golfer from the Isle of Jersey who played in the early 20th century. Boomer won three tournaments—the 1923 Belgian Open, the 1924 Swiss Open, and the 1927 Dutch Open. His brother, Aubrey Boomer, was also a professional golfer, as was his son Percy George (known as George). George qualified for the 1950 Open Championship but missed the cut by a single stroke.", "link_mentions": [{"page": "Dutch Open (golf)", "response": ["|1927 ||  Percy Boomer || align=center|147 || align=center| || 1 stroke ||  Henry Cotton || Haagsche", "|1926 ||  Aubrey Boomer (3) || align=center|151 || align=center| || 5 strokes ||  Percy Boomer Jos van Dijk || Haagsche"]}, {"page": "Omega European Masters", "response": ["|1924 || ||  Percy Boomer || align=center|150 || || ||"]}, {"page": "Belgian Open (golf)", "response": ["| 1926 ||  Aubrey Boomer (2) || align=center|137 || align=center| || 9 strokes ||  Percy Boomer || Royal Zoute || ", "| 1923 ||  Percy Boomer || align=center|143 || align=center| || ||  || Royal GC Belgium ||"]}, {"page": "Ernest Jones (golfer)", "response": ["Jones died in 1965. His career included playing competitively on the European tour, winning a number of tournaments, head golf professional at several of America's most esteemed golf clubs, and a career of teaching both tour professional and amateur golfers. In 1965 he was the recipient of the Ben Hogan award.  Along with Harvey Penick, Tommy Armour, and Percy Boomer, he was inducted into the World Golf Teachers Hall of Fame in 1977 ."]}, {"page": "Arthur Lees", "response": ["In 1949, following the death of Percy Boomer, Sunningdale Golf Club hired Lees as its club professional.  At the time, Sunningdale was still feeling the effects of the Second World War, as its membership was low. Lees improved the situation by attracting new members; The Times later wrote that he took on the role of \"self-appointed recruiting agent.\" Lees performed his head professional duties for the club even during his playing career. One of his assistants was future professional golfer Sam Torrance, who was 16 when Lees gave him the job. Lees remained the head pro at Sunningdale until 1977."]}]}}