{"wiki_id": "http://www.wikidata.org/entity/Q269900", "itemLabel": "Camilla Luddington", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Camilla_Luddington", "wikipedia_page": {"main": "Camilla Anne Luddington (born 15 December 1983) is a British actress, best known for her role as Josephine “Jo” Wilson in the ABC medical drama series, Grey's Anatomy. She is also known for voicing Lara Croft in the Tomb Raider video games, for which she provided the motion capture.\n\n", "link_mentions": [{"page": "December 15", "response": ["*  1983   – Camilla Luddington, English actress"]}, {"page": "Tomb Raider", "response": ["Lara Croft has been voiced by five actresses in the video game series: Shelley Blond, Judith Gibbins, Jonell Elliott, Keeley Hawes, and Camilla Luddington. In other media, Croft was also voiced by Minnie Driver in the animated series and portrayed by Angelina Jolie and Alicia Vikander in feature films. Multiple models and body doubles have portrayed Croft in promotional material up until the reboot in 2013. Eight different real-life models have portrayed her at promotional events."]}, {"page": "1983", "response": ["** Camilla Luddington, English actress"]}, {"page": "Berkshire", "response": ["* Camilla Luddington (1983; actress)"]}, {"page": "Jonathan Pryce", "response": ["In 2015, he joined the cast of the HBO series Game of Thrones in Season 5 as the High Sparrow. Pryce admitted that one of the main reasons he took on the role was because of how influential the character is plot-wise. While initially being quite sceptical about \"sword and sorcery\" shows, Pryce later had a change of heart after his positive experiences on the Thrones sets. In 2015, he also appeared at The Globe Theatre as Shylock in The Merchant of Venice. His real life daughter Phoebe played Shylock's daughter Jessica. In 2015, he joined the cast of The Healer starring with Oliver Jackson-Cohen, Camilla Luddington, and Jorge Garcia."]}, {"page": "1983 in American television", "response": ["|Camilla Luddington"]}, {"page": "Lara Croft", "response": ["Core Design handled the initial development of the character and the series. Inspired by strong female icons, Gard designed Lara Croft to counter stereotypical female characters. The company modified the character for subsequent titles, which included graphical improvements and gameplay additions. American developer Crystal Dynamics took over the series after the 2003 sequel Tomb Raider: The Angel of Darkness was received poorly. The new developer rebooted the character along with the video game series. The company altered her physical proportions and gave her additional ways of interacting with game environments. Croft has been voiced by six actresses in the video game series: Shelley Blond (1996), Judith Gibbins (1997–98), Jonell Elliott (1999–2003), Keeley Hawes (2006–14), Camilla Luddington (2013–present), and Abigail Stahlschmidt (2015).", " bar:TR9 from:05/03/2013 till:10/11/2015 width:15 color:TR9 text:\"Camilla Luddington\" shift:(70,-3)"]}, {"page": "List of Justice League members", "response": ["|Camilla Luddington"]}, {"page": "Zatanna", "response": ["* Zatanna appears in Justice League Dark (2017), voiced by Camilla Luddington.", "* Zatanna appears in Justice League Dark: Apokolips War (2020), voiced again by Camilla Luddington."]}, {"page": "Ascot, Berkshire", "response": ["*Camilla Luddington (1983–), actress, born and raised in Ascot"]}, {"page": "Jorge Garcia", "response": ["In 2015, he joined the cast of The Healer starring with British actor Oliver Jackson-Cohen, Camilla Luddington and Jonathan Pryce."]}, {"page": "Susquehanna University", "response": ["*Camilla Luddington - actress"]}, {"page": "Grey's Anatomy", "response": ["Lexie Grey (Chyler Leigh), Meredith's paternal half-sister, joins the residency program in season 4 until her death with her love-interest Mark Sloan in the plane crash at the end of season 8, after which Seattle Grace is renamed Grey Sloan Memorial Hospital in their memory. Former Mercy-West residents April Kepner (Sarah Drew) and Jackson Avery (Jesse Williams) join Seattle Grace following an administrative merger in season 6. Other additions include Leah Murphy (Tessa Ferrer), who departs at the end of season 10 but returns during season 13; Shane Ross (Gaius Charles), who leaves with Yang for Zurich, Switzerland in the season 10 finale; Stephanie Edwards (Jerrika Hinton), who resigns at the end of season 13; Jo Wilson (Camilla Luddington), who marries Karev; Andrew DeLuca (Giacomo Gianniotti), the former love-interest of Meredith's maternal half-sister Maggie Pierce (Kelly McCreary), who also serves as head of cardiothoracic surgery; and Ben Warren (Jason George), an anesthesiologist-turned-resident-turned-firefighter, who marries Bailey. Season 11 sees the death of Derek Shepherd, and in season 12, attending cardiovascular surgeon Nathan Riggs (Martin Henderson) joins the show. In the early episodes of season 14, Riggs leaves the series to start a life with Owen's long-lost sister Megan (Abigail Spencer); by the season finale, Robbins, Kepner and Warren also depart the show. Midway through the sixteenth season, Karev made his final appearance on the series. During the seventeenth season, DeLuca is stabbed while chasing a child abductor and despite efforts of Hunt and Altman, he passes away. Avery and Koracick also depart in season 17 as Avery moves to Boston to take over his family's Foundation, whilst Koracick leaves to assist Avery.", "|Camilla Luddington", "In the season 9 premiere, interns Dr. Jo Wilson (Camilla Luddington), Dr. Shane Ross (Gaius Charles), Dr. Stephanie Edwards (Jerrika Hinton), Dr. Leah Murphy (Tessa Ferrer) and Dr. Heather Brooks (Tina Majorino) are introduced. Steven Culp and William Daniels play Dr. Parker and Dr. Craig Thomas, respectively. Dr. Parker is Chief of Cardiothoracic Surgery and Dr. Craig Thomas (William Daniels) is an attending cardiothoracic surgeon at Mayo Clinic, where Cristina worked temporarily. Dr. Alana Cahill (Constance Zimmer) introduced in season 9 is appointed to cut costs at the hospital and she eventually decides the best course of action would be to seek out a new buyer until the 4 crash survivors and Torres on the behalf of Sloan pool their money together in a bid to purchase the hospital themselves. Kepner starts dating a paramedic named Matthew Taylor (Justin Bruening) and they form a deep relationship over the course of seasons 9 and 10 and she eventually agreed to marry before reconciling with Avery in the middle of her wedding ceremony to Matthew. Lauren Boswell (Hilarie Burton) is introduced as a craniofacial surgeon consulting on a case at Grey Sloan Memorial who showed romantic interest in Arizona and eventually ended up having a one-night stand with her.", "In July 2012, Dane (Sloan) confirmed that he was departing the show to pursue other projects; he made his final appearances in the first 2 episodes of season 9. With the start of season 10, Camilla Luddington, Gaius Charles, Jerrika Hinton and Tessa Ferrer were introduced to the show as series regulars. They were first introduced to the show in season 9 as the new interns. On August 13, 2013, Oh (Cristina) announced that the show's tenth season would be her final one. In March 2014, it was announced that Isaiah Washington, who portrayed Preston Burke in the first 3 seasons of the show, would make a guest appearance to coincide with the departure of series regular Sandra Oh, his former on-screen love-interest. Neither Charles's nor Ferrer's contracts were renewed for season 11."]}, {"page": "New York Film Academy", "response": ["* Camilla Luddington, actress"]}, {"page": "TASIS England", "response": ["* Camilla Luddington - actor, Grey's Anatomy"]}, {"page": "Supergirl (Kara Zor-El)", "response": ["* Supergirl appears as a playable character in Infinite Crisis, voiced by Camilla Luddington."]}, {"page": "Luddington", "response": ["*Camilla Luddington, British-American actress"]}, {"page": "Spike Video Game Awards", "response": ["*Camilla Luddington as Lara Croft, Tomb Raider"]}, {"page": "List of Grey's Anatomy characters", "response": ["| Josephine \"Jo\" Wilson || Camilla Luddington ||10, 11, 12, 13, 14, 15, 16, 17, 18 || 9 || OB/GYN Resident, Former Attending General Surgeon, Former Surgical Innovation Fellow, Former Chief Resident, Grey Sloan Memorial Hospital Shareholder || M.D.", "* Jo Karev (Camilla Luddington): Alex's second wife, a surgical innovation fellow who works at Grey Sloan Memorial Hospital. Who he later divorces in season 16 to go live with ex-wife Izzie Stevens."]}, {"page": "List of biographical films", "response": ["||Camilla Luddington"]}, {"page": "List of Batman films cast members", "response": ["| Camilla Luddington", "| Camilla Luddington"]}, {"page": "Izzie Stevens", "response": ["Izzie makes a treatment error that endangers the life of a patient, and is fired from the hospital's surgical program. Believing Alex is partially to blame, she writes him a Dear John letter and leaves. Izzie later learns that Alex was not responsible for her lost job, and returns to make amends with him, but Meredith informs her that Alex is moving on. Izzie informs Alex that she no longer has cancer. Although he is pleased, Alex officially breaks up with Izzie, telling her that he loves her but deserves better. She leaves Seattle to start fresh. Several episodes later, Alex informs Meredith that Izzie sent divorce papers, which he signs in the season 6 episode \"How Insensitive\". In the sixth-season finale, Alex is shot and asks for Izzie. Imagining that Meredith's half-sister Lexie (Chyler Leigh) is Izzie, he apologizes and asks her never to leave him again. In the season 12 episode \"I Choose You\", Alex's new partner Jo (Camilla Luddington) finds an invoice from the fertility clinic that housed Izzie and Alex's fertilized embryos from when she had cancer, and ponders the possibility that he has \"a bunch of Izzie babies\". In the 300th episode, Alex reveals he never found out what happened to Izzie, but envisions a perfect life for her, always smiling, now that he has moved on and is happy with Jo. While the character was not fully seen in the season 16 episode \"Leave a Light On\", it was revealed that Alex left Jo and got back together with Izzie, who is now working as a surgical oncologist. The two of them are revealed to be living on a farm in Kansas raising 5-year-old twins named Alexis and Eli, who were born as a result of Izzie moving forward with IVF five to six years earlier."]}, {"page": "List of Grey's Anatomy cast members", "response": ["In the tenth season, the new batch of interns introduced during the ninth season were made series regulars including Camilla Luddington as Dr. Jo Wilson, Gaius Charles as Dr. Shane Ross, Jerrika Hinton as Dr. Stephanie Edwards, Tessa Ferrer as Dr. Leah Murphy with the exception of Tina Majorino as Dr. Heather Brooks (who died during the season 9 finale). Caterina Scorsone was upgraded to a series regular to continue her role as Dr. Amelia Shepherd, one of Dr. Derek Shepherd's four sisters. Scorsone previously played Dr. Amelia Shepherd since the seventh season as a recurring role. Kelly McCreary as Dr. Maggie Pierce was promoted to a series regular after being credited as guest-starring until the eleventh episode of eleventh season. The cast has received numerous awards and nominations, including a Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series, a Golden Globe Award for Best Television Series – Drama, and numerous Primetime Emmy Award nominations for individual cast members.", "|Camilla Luddington", "| scope=\"row\" style=\"text-align:left;\" | Camilla Luddington"]}, {"page": "Californication (TV series)", "response": ["* Lizzie (Camilla Luddington) is the nanny of Marcy and Charlie's son, and later becomes Charlie's occasional sex partner. (season five)"]}, {"page": "List of Americans of English descent", "response": ["*Camilla Luddington"]}, {"page": "Supergirl in other media", "response": ["Supergirl appears as a playable character in Infinite Crisis, voiced by Camilla Luddington, with the Arcane Supergirl voiced by India de Beaufort."]}, {"page": "List of works based on Peter Pan", "response": ["* In the seventh episode on season 10 of Grey's Anatomy, Jo Wilson (Camilla Luddington) dresses as Tinker Bell for Halloween and shows up at her boyfriend Alex Karev's (Justin Chambers) house, after a fight they had resulting from his estranged father appearance, showing her loyalty to the boy who didn't grow up."]}, {"page": "Vote.org", "response": ["Despite conflicts over their change in CEO and loss of donor support, Vote.org's development of numerous new digital and offline tools in 2020 yielded a number of important milestones for their organization. This included registering 34 million new voters, partnering with over 1,000 companies to allow time off work on Election Day, and feeding 40,500 voters by supplying food trucks to long voter lines. Vote.org’s newest partnerships with tech companies like Propel, developer of the Fresh EBT app, allowed for 60,000 low-income participants of the Supplemental Nutrition Assistance Program to register to vote before the 2020 election.  This program expanded Vote.org’s donor-base and cooperation with “Schusterman Family Foundation, Blue Meridian Partners, Flourish Ventures, Google.org, Flu Lab, Wend Collective, Blue Haven Initiative and The Late Show with Stephen Colbert. Other backers included a roster of celebrities and political figures, like Stacey Abrams, Andrew Yang, Julia Louis-Dreyfus, Ariana Grande and Camilla Luddington.” "]}, {"page": "List of The Southern Vampire Mysteries characters", "response": ["Claudette is the late triplet sibling of Claude and Claudine who was murdered in the short story Fairy Dust. She is a Sky fairy. In the fifth season of True Blood, Claudette is portrayed by Camilla Luddington and is one of 17 Crane sisters."]}, {"page": "MCM London Comic Con", "response": ["| Expo 23 || 24–26 May 2013 || 76,000 || Edgar Wright, Jason Flemyng, Mark Meer, Dougray Scott, Barrett Foa, Andrew Lee Potts, Hannah Spearritt, Shinichiro Watanabe, Tom Hopper, Alexander Vlahos, Camilla Luddington, Tyler Hoechlin and fellow cast members of Teen Wolf, Rob Van Dam"]}, {"page": "Tomb Raider (2013 video game)", "response": ["Crystal Dynamics began development of Tomb Raider soon after the release of Tomb Raider: Underworld in 2008. Rather than a sequel, the team decided to completely reboot the series, re-establishing the origins of Lara Croft for the second time, as they did with Tomb Raider: Legend. Tomb Raider is set on Yamatai, an island from which Lara, who is untested and not yet the battle-hardened explorer she is in other titles in the series, must save her friends and escape while being hunted down by a malevolent cult. Camilla Luddington was announced to voice and perform as Lara Croft in 2010, replacing Keeley Hawes.", "Keeley Hawes did not return as Lara Croft for 2013's Tomb Raider, after completing Tomb Raider: Legend, Anniversary, Underworld and Lara Croft and the Guardian of Light. She reprised the role of Lara in the downloadable game Lara Croft and the Temple of Osiris, which was released on 9 December 2014. In December 2010, Crystal Dynamics was said to be auditioning dozens of voice actresses. On 26 June 2012, the voice actress of Lara Croft was revealed to be Camilla Luddington. Lara is played by Nadine Njeim in the Arabic dub, by Nora Tschirner in the German dub, by Alice David in the French dub, by Karolina Gorczyca in the Polish dub, by Yuko Kaida in the Japanese dub, by Benedetta Ponticelli in the Italian dub, by Guiomar Alburquerque Durán in the Spanish dub and by Polina Sherbakova in the Russian dub.", "On 31 May 2012, a gameplay trailer was released online, showcasing more action-based gameplay along with varying plot elements. The trailer confirmed the presence of several other non-playable characters besides Lara on the island, many of which appear to be part of a menacing organization. On 4 June, at Microsoft's E3 2012 press conference, a new gameplay demonstration was shown, depicting environmental destruction and other interactivity, stealth combat using a bow and arrow, quick-time events and parachuting. During summer 2012, gameplay was shown of Lara hunting, exploring the island and killing for the first time. They were shown at Eurogamer Expo 2012 at London on 27 September. On 8 December, a new trailer was shown during Spike Video Game Awards. At the beginning, an introduction was made by Camilla Luddington and during the event, the trailer was followed by a musical orchestra, led by the music composer, Jason Graves. The next week, IGN presented: Tomb Raider Week. Each day from Monday to Friday, exclusive previews, features and trailers were released, showing more details for the upgrading system, survival tools and challenge tombs. Tomb Raider officially went gold on 8 February 2013.", "| Best Voice Actress (Camilla Luddington)"]}, {"page": "Westwood High School (Austin, Texas)", "response": ["* Camilla Luddington (born 1983), actress best known for her role as Jo Wilson on ABC's Grey's Anatomy, attended Westwood High School for one year"]}, {"page": "William & Kate: The Movie", "response": ["Kate Middleton is played by Camilla Luddington, an English-born actress, while the part of William was taken by Nico Evers-Swindell, a New Zealander.", "* Camilla Luddington – Catherine Middleton"]}, {"page": "True Blood (season 5)", "response": ["* Camilla Luddington as Claudette Crane"]}, {"page": "Grey's Anatomy (season 9)", "response": ["* Camilla Luddington as Dr. Jo Wilson", "In August 2012, it was announced that Camilla Luddington, Gaius Charles and Tina Majorino had been cast as Jo Wilson, Shane Ross, and Heather Brooks respectively; these characters would be the new interns of Seattle Grace-Mercy West. TVGuide later reported that even with all of the recurring cast being added to Grey's Anatomy for the new season that True Blood star Camilla Luddington is the only actress with an option to become a series-regular. In September 2012, it was announced that Jerrika Hinton and Tessa Ferrer had been cast as new interns Stephanie Edwards and Leah Murphy respectively. In August 2012, it was announced that Debbie Allen would reprise her role as Catherine Avery at sometime in series, and she is set to direct the third episode. In September 2012, it was announced that Steven Culp would be cast as a new doctor at a new hospital, and would be known as Dr. Parker. "]}, {"page": "The Pact (2012 film)", "response": ["A sequel titled The Pact 2 was released on VOD in September 2014 and was given a limited-theatrical release the following month. The film had Lotz, Steger, and Hudson return to perform their same roles, and Camilla Luddington was brought on to perform in the leading role of June Abbott. McCarthy did not return to direct the film, which was instead written and directed by Dallas Hallam and Patrick Horvath."]}, {"page": "Going, Going, Gone (Grey's Anatomy)", "response": ["The episode saw the death of Dr. Mark Sloan (Eric Dane); the actor was let go due to budget cuts by the producers. Excessive spoilers were not released, in order to keep the fates of select characters unknown. However, multiple cast members leaked pictures from the set. Jason George returned in a guest capacity. Long-running cast member Camilla Luddington makes her first appearance as Jo Wilson in this episode. The episode received positive reviews from critics.", "In the season eight finale, Dr. Meredith Grey (Ellen Pompeo), Dr. Derek Shepherd (Patrick Dempsey), Dr. Cristina Yang (Sandra Oh), Dr. Lexie Grey (Chyler Leigh), Dr. Mark Sloan (Eric Dane), and Dr. Arizona Robbins (Jessica Capshaw) are caught in an aviation accident, leaving Lexie Grey dead, and the rest of the doctors stranded. \"Going, Going, Gone\" picks up about one month after the crash, and throughout the episode, features home videos of Sloan. The episode begins with Seattle Grace Mercy West Hospital's new interns, Dr. Shane Ross (Gaius Charles), Dr. Jo Wilson (Camilla Luddington), Dr. Heather Brooks (Tina Majorino), and Dr. Stephanie Edwards (Jerrika Hinton), expressing fear of Meredith Grey, who is now an attending general surgeon. It is revealed that former resident Dr. Alex Karev (Justin Chambers) will be pursuing a pediatric surgical fellowship at Johns Hopkins Hospital. The scene switches to Minnesota, where Yang is now a cardiothoracic surgical fellow."]}]}}