{"wiki_id": "http://www.wikidata.org/entity/Q2697631", "itemLabel": "Henry Howard, 1st Earl of Northampton", "itemDescription": "English aristocrat and courtier (1540-1614)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Howard,_1st_Earl_of_Northampton", "wikipedia_page": {"main": "Henry Howard, 1st Earl of Northampton KG (25 February 1540 – 15 June 1614) was an important English aristocrat and courtier. He was suspect as a crypto-Catholic throughout his life, and went through periods of royal disfavour, in which his reputation suffered greatly. He was distinguished for learning, artistic culture and his public charities. He built Northumberland House in London and superintended the construction of the fine house of Audley End. He founded and planned several hospitals. Francis Bacon included three of his sayings in his Apophthegms, and chose him as \"the learnedest councillor in the kingdom to present to the king his Advancement of Learning.\" After his death, it was discovered that he had been involved in the murder of Sir Thomas Overbury.", "link_mentions": [{"page": "February 25", "response": ["*1540 – Henry Howard, 1st Earl of Northampton, English aristocrat and courtier (d. 1614)"]}, {"page": "Gunpowder Plot", "response": ["Uncertain of the letter's meaning, Monteagle promptly rode to Whitehall and handed it to Cecil (then Earl of Salisbury). Salisbury informed the Earl of Worcester, considered to have recusant sympathies, and the suspected Catholic Henry Howard, 1st Earl of Northampton, but kept news of the plot from the King, who was busy hunting in Cambridgeshire and not expected back for several days. Monteagle's servant, Thomas Ward, had family connections with the Wright brothers, and sent a message to Catesby about the betrayal. Catesby, who had been due to go hunting with the King, suspected that Tresham was responsible for the letter, and with Thomas Wintour confronted the recently recruited conspirator. Tresham managed to convince the pair that he had not written the letter, but urged them to abandon the plot. Salisbury was already aware of certain stirrings before he received the letter, but did not yet know the exact nature of the plot, or who exactly was involved. He therefore elected to wait, to see how events unfolded."]}, {"page": "June 15", "response": ["*1614 – Henry Howard, 1st Earl of Northampton, English courtier and politician, Lord Warden of the Cinque Ports (b. 1540)"]}, {"page": "1614", "response": ["* June 15 – Henry Howard, 1st Earl of Northampton, important English aristocrat and courtier (b. 1540)"]}, {"page": "1540", "response": ["* February 25 – Henry Howard, 1st Earl of Northampton, English aristocrat and courtier (d. 1614)"]}, {"page": "William Byrd", "response": ["The second stage in Byrd's programme of liturgical polyphony is formed by the Gradualia, two cycles of motets containing 109 items and published in 1605 and 1607. They are dedicated to two members of the Catholic nobility, Henry Howard, 1st Earl of Northampton and Byrd's own patron Sir John Petre, who had been elevated to the peerage in 1603 under the title Lord Petre of Writtle. The appearance of these two monumental collections of Catholic polyphony reflects the hopes which the recusant community must have harboured for an easier life under the new king James I, whose mother, Mary Queen of Scots, had been a Catholic. Addressing Petre (who is known to have lent him money to advance the printing of the collection), Byrd describes the contents of the 1607 set as \"blooms collected in your own garden and rightfully due to you as tithes\", thus making explicit the fact that they had formed part of Catholic religious observances in the Petre household."]}, {"page": "Henry Howard, Earl of Surrey", "response": ["* Henry Howard, 1st Earl of Northampton, who died unmarried."]}]}}