{"wiki_id": "http://www.wikidata.org/entity/Q26923495", "itemLabel": "Helen Stokes-Lampard", "itemDescription": "British medical academic and general practitioner", "wikipedia_url": "https://en.wikipedia.org/wiki/Helen_Stokes-Lampard", "wikipedia_page": {"main": "Dame Helen Jayne Stokes-Lampard  (born October 1970) is a British medical academic and a general practitioner. She is Chair of the Academy of Medical Royal Colleges (AoMRC) a GP Principal and Chair of the National Academy for Social Prescribing (NASP). She was Chair of the Royal College of General Practitioners (RCGP) from November 2016 to November 2019. She is also a Professor of GP Education at Birmingham University and a visiting Chair at St George's Medical School in London.  She has a particular interest in women's health.", "link_mentions": [{"page": "General practitioner", "response": ["In May 2017, there was said to be a crisis in the UK with practices having difficulties recruiting GPs they need. Prof. Helen Stokes-Lampard of the Royal College of General Practitioners said, “At present, UK general practice does not have sufficient resources to deliver the care and services necessary to meet our patients’ changing needs, meaning that GPs and our teams are working under intense pressures, which are simply unsustainable. Workload in general practice is escalating – it has increased 16% over the last seven years, according to the latest research – yet investment in our service has steadily declined over the last decade and the number of GPs has not risen in step with patient demand ... This must be addressed as a matter of urgency.”."]}, {"page": "1970 in Wales", "response": ["*October – Helen Stokes-Lampard, chair of the Royal College of General Practitioners"]}, {"page": "List of Dames Commander of the Order of the British Empire", "response": ["*2022: Vivienne Cox, Flora Duffy, Jenny Harries, Sylvia Heal, Laura Kenny, Sara Khan, Emily Lawson, Diane Lees, Joanna Lumley, Julie Lydon, June Raine, Vanessa Redgrave, Sarah Springman, Helen Stokes-Lampard"]}, {"page": "National Health Service", "response": ["Social care will cost more in future according to research by Liverpool University, University College London, and others and higher investment are needed. Professor Helen Stokes-Lampard of the Royal College of GPs said, “It’s a great testament to medical research, and the NHS, that we are living longer – but we need to ensure that our patients are living longer with a good quality of life. For this to happen we need a properly funded, properly staffed health and social care sector with general practice, hospitals and social care all working together – and all communicating well with each other, in the best interests of delivering safe care to all our patients.”\"NHS faces staggering increase in cost of elderly care, academics warn\", The Guardian."]}, {"page": "Academy of Medical Royal Colleges", "response": ["*Professor Helen Stokes-Lampard (2020 to present)"]}, {"page": "List of Question Time episodes", "response": ["|Grant Shapps, Alison McGovern, David Linden, Helen Stokes-Lampard, Stuart Rose"]}, {"page": "Learned Society of Wales", "response": ["*Dame Helen Stokes-Lampard "]}, {"page": "Maureen Baker", "response": ["She was  elected as Honorary Secretary of the Royal College of General Practitioners (RCGP) in 1999. In May 2013 she was elected as chair of the RCGP Council, taking up the position in November 2013. During her term as chair of RCGP council, she often articulated problems affecting general practice, acknowledging that some of these problems have been attributed to the \"pull of London and the South-east\". She has commented on the need to be able to improve the distribution of the medical workforce, suggesting that reasonable incentives might help attract doctors to some areas. Her term as Council Chair ended in November 2016, when she was succeeded as Chair by Helen Stokes-Lampard."]}, {"page": "Peston on Sunday", "response": ["| Emily Thornberry, Piers Morgan, Helen Stokes-Lampard, Russell Kane, with Alastair Campbell and Sir Craig Oliver"]}, {"page": "Martin Marshall", "response": ["In October 2016 he was elected as the RCGP's Vice Chair for External Affairs. In July 2019, he became the Chair elect of the RCGP council, to succeed Helen Stokes-Lampard. In November 2019 he took up role of Chair of RCGP for a three year term. He also holds a Professorship in Health Care Improvement at University College London."]}, {"page": "National Academy for Social Prescribing", "response": ["* Prof Helen Stokes-Lampard (chair)"]}]}}