{"wiki_id": "http://www.wikidata.org/entity/Q2695316", "itemLabel": "Arthur White", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_White_(actor)", "wikipedia_page": {"main": "Arthur B. White (born 1933) is an English stage and screen actor, best known for his occasional role as the collator (police archivist) Ernie Trigg in the crime drama A Touch of Frost, alongside his real-life younger brother David Jason. His parents were Arthur R White and Olwen Jones. He also appeared briefly along with his brother in two episodes of The Darling Buds of May.\nIn 1978 White appeared as part of an underworld gang, playing the role of Freddy in an episode of the 1970s British police drama The Professionals, the episode entitled When the Heat Cools Off.In 2008, he worked with Jason again on the comic fantasy The Colour of Magic, where he starred as a character called \"Rerpf\". He has also made appearances on popular television series such as Crossroads, The Professionals, London's Burning, As Time Goes By, Wycliffe, Heartbeat and Family Affairs.", "link_mentions": [{"page": "David Jason", "response": ["Jason's elder brother is the actor Arthur White, born in 1933. The two appeared together in the crime drama A Touch of Frost, with Arthur playing police archivist Ernie Trigg; and again in 2008, in the comic fantasy The Colour of Magic, where Arthur starred as a character called \"Rerpf\". He also appeared briefly with his brother in two episodes of The Darling Buds of May."]}, {"page": "A Touch of Frost", "response": ["* Arthur White as PC Ernie Trigg", "* PC Ernie Trigg (Arthur White, 1994–2010), the police archivist of paper files and pre-computer information. He helps Frost with knowledge of known associates and crime methods he has collected over the years that are not available in the police computer system. He and Frost knew each other long before they were both stationed at Denton. White, who played the character, is David Jason's real life brother."]}, {"page": "Theatre 625", "response": ["|Judi Dench,Ruth Porcher,Ronald Hines,Arthur White,Michel Ray,Bryan Hunt,Charles Houston,Arthur Lovegrove,Shane Rimmer,Edward Burnham,Douglas Ditta,Philip Stone,Derrick Glibert,Peter Purves,Tony Steedman,Barry Jackson,Maurice Selwyn"]}, {"page": "Carnacki", "response": ["* Arthur White as March"]}, {"page": "Devil's Planet", "response": ["* Arthur White — Kinano"]}, {"page": "It's Your Funeral", "response": ["* Arthur White . . . Stallholder"]}, {"page": "Arthur White", "response": ["Arthur White may refer to:", "* Arthur White (American football) (c. 1877–1929), American football coach", "* Arthur White (priest) (1880–1961), Archdeacon of Warrington", "* Arthur White (Canadian politician) (1907–1973), Canadian politician", "* Arthur White (baseball), American baseball player", "* Arthur White (actor) (born 1933), British actor, older brother of actor David Jason"]}, {"page": "Pardon My Genie", "response": ["The premise was that a magic genie (Hugh Paddick) appeared in present-day Britain, summoned by a young apprentice named Hal Adden, a pun that goes some way towards characterising the series. Various comical misunderstandings arise, primarily aimed at youngsters. Arthur White replaced Paddick for the second run of thirteen episodes. Throughout both series, Hal was played by Ellis Jones, with Roy Barraclough as his long-suffering boss, Mr Cobbledick."]}, {"page": "Crane (TV series)", "response": ["8. A Mouthful Of Ashes. Crane gives Orlando a ticket to the theatre, with no idea that he is sending him into danger, in which he too will become involved. Anthony Newlands as Stark, Maxine Audley as Freda, Arthur White as Pirelli.", "11. A Violent Animal. Crane's smuggling activities has caused a man from the mainland to come to kill him. Peter Dyneley as Peter Garvey, Michael Mellinger as Achmet, Arthur White as Pirelli, Keith Barron as Rene Leclerc, John Cater as Afiz, Arthur Blake as Sgt. Zahaz, Jolyon Booth as Gibbah, Michael Allaby as Policeman."]}, {"page": "Kevin Moreton", "response": ["Moreton starred in the BBC Children's TV series Striker. The show ran for three series on the BBC from 1975 to 1976 and was written by actor Kenneth Cope. Moreton played the title role, young Ben Dyker, the star forward of the Brenton youth team. Other notable cast members included Joe Gladwin as Harry, Sam Williams as Nicky and Arthur White as Mr Robson."]}, {"page": "It's a Grand Life", "response": ["It's a Grand Life is a 1953 British comedy film starring Frank Randle and Diana Dors.http://www.bfi.org.uk/films-tv-people/4ce2b6ad5dbb3 Music hall comedian Frank Randle who had previously starred in a film series of World War II army comedies (Somewhere in England (1940), Somewhere in Camp (1942), Somewhere on Leave (1942), Somewhere in Civvies (1943), Somewhere in Politics (1949)) stars as an accident-prone Private in his final film appearance.  The film also features the professional wrestler Jack Pye and the popular pianist Winifred Atwell.  The role of Pte Pendergast was played by Arthur White, who is the elder brother of the actor Sir David Jason.", "* Arthur White - Pte. Prendergast"]}, {"page": "The Train Now Standing", "response": ["*Arthur White - Fred (series 1)"]}, {"page": "The Nesbitts Are Coming", "response": ["* Arthur White as  PC Crowther"]}]}}