{"wiki_id": "http://www.wikidata.org/entity/Q269638", "itemLabel": "Jenny Chapman", "itemDescription": "British Labour Party politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Jenny_Chapman", "wikipedia_page": {"main": "Jennifer Chapman, Baroness Chapman of Darlington (born 25 September 1973) is a British politician and life peer attending shadow cabinet as a Shadow Minister of State at the Cabinet Office since 2021. A member of the Labour Party, she served as Member of Parliament (MP) for Darlington from 2010 to 2019.\nBorn in Surrey and raised in Darlington, Chapman served as a Shadow Justice Minister from 2011 to 2016, a Shadow Education Minister in 2016 and a Shadow Brexit Minister from 2016 to 2019. She lost her seat in the House of Commons to the Conservative candidate at the 2019 general election. She chaired Keir Starmer's campaign in the 2020 Labour Party leadership election, and was appointed his political secretary and awarded a life peerage following his election. In 2021, Chapman moved to the opposition front bench in a new position established to shadow Lord Frost.", "link_mentions": [{"page": "September 25", "response": ["*  1973   – Jenny Chapman, English politician"]}, {"page": "Brunel University London", "response": ["* Jenny Chapman (Psychology), Labour Party politician, MP For Darlington"]}, {"page": "Darlington", "response": ["the Member of Parliament (MP) for this seat is Conservative Peter Gibson. Former members of parliament for the town include Jenny Chapman, the former Shadow Prisons Minister and Shadow Minister for Leaving the European Union, Alan Milburn, the former Secretary of State for Health under the Tony Blair Labour Government and Michael Fallon, who was Secretary of State for Defence under the David Cameron coalition government and Theresa May's Conservative government."]}, {"page": "List of barons in the peerages of Britain and Ireland", "response": ["#*Jenny Chapman, Baroness Chapman of Darlington"]}, {"page": "List of political families in the United Kingdom", "response": ["*Jenny Chapman (1973–), MP for Darlington 2010–."]}, {"page": "Darlington (UK Parliament constituency)", "response": ["The constituency was created for the 1868 election and covers the market town of Darlington in County Durham. The seat has been held by all three major parties in its long existence, but has been a marginal constituency between the Labour and Conservative parties in the years since the Second World War. Labour held the seat for 27 years from 1992 with their candidate Jenny Chapman winning the seat in 2010 with a 3,388 majority down from 10,404 in the previous election. In 2015, her majority over the Conservatives fell to 3,158. In the UK General election 2019 Conservative Peter Gibson defeated Chapman with a 3,294 majority.", "| Jenny Chapman"]}, {"page": "List of Parliamentary constituencies in County Durham", "response": ["|Jenny Chapman‡"]}, {"page": "Hummersknott Academy", "response": ["* Jenny Chapman, Darlington MP"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Jenny Chapman, Darlington, 2010–2019"]}, {"page": "Baroness Chapman", "response": ["* Jenny Chapman, Baroness Chapman of Darlington (born 1973)"]}, {"page": "Progressive Britain", "response": ["Progress also published The Purple Book, in September 2011, exploring fresh non-statist policies for Labour. Authors included: Alan Milburn, Peter Mandelson, Jacqui Smith, Tessa Jowell, Andrew Adonis, Caroline Flint, Douglas Alexander, Frank Field, Liam Byrne, Ivan Lewis, Rachel Reeves, Tristram Hunt, Liz Kendall and Jenny Chapman. There were ideas such as foundation trusts providing GP services, a school voucher system, crime commissioners, directly elected mayors and 'hasbos'. The Labour Party leader at the time, Ed Miliband, wrote a foreword to the book.", "Progress is chaired by Alison McGovern. In 2014 its vice-chairs were the Labour MPs Jenny Chapman, Stephen Doughty, Julie Elliott, Tristram Hunt, Dan Jarvis, Liz Kendall, Seema Malhotra, Toby Perkins, Lucy Powell, Steve Reed, Jonathan Reynolds and Nick Smith."]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["* Nick Smith, MP for Blaenau Gwent since 2010 who married in 2012 Jenny Chapman was MP for Darlington 2010–19.", "* Nick Smith, MP for Blaenau Gwent since 2010, whose wife Jenny Chapman was MP for Darlington 2010–19"]}, {"page": "Rupert Read", "response": ["On television, Read appeared on Channel 5's 5 News in a performance described by Naomi Klein as \"absolutely amazing\", and BBC Politics Live where he notably successfully put pressure on Labour MP Jenny Chapman and Conservative minister Nadhim Zahawi to agree, live on TV, to meet Extinction Rebellion, and additionally demanded that politicians stop spreading the myth – and misleading statistics – that the UK is a leader on climate change action. More recently during the October 2019 Extinction Rebellion, Rupert appeared on BBC question time along with Secretary of State for Transport Grant Shapps MP, Lisa Nandy MP, businessman Theo Paphitis and journalist Julia Hartley-Brewer."]}, {"page": "Chapman (surname)", "response": ["*Jenny Chapman (born 1973), British Labour politician"]}, {"page": "List of Question Time episodes", "response": ["|Damian Hinds, Jenny Chapman, Simon Wolfson, Merryn Somerset Webb, Yanis Varoufakis"]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| Darlington||style=\"background-color: \"| ||Labour||style=\"background-color: \"| ||Jenny Chapman (L)||Seat held.  Incumbent Alan Milburn stood down"]}, {"page": "Dominic Raab", "response": ["In November 2018, Raab was criticised by Labour's shadow Brexit minister, Jenny Chapman, after Raab said that he \"hadn't quite understood the full extent\" of how much UK trade relies on the Dover-Calais crossing."]}, {"page": "Nick Smith (British politician)", "response": ["Smith has two daughters and lives in Nantyglo. He married fellow Labour MP Jenny Chapman in July 2014. He previously lived in Camden Town.NICHOLAS DESMOND JOHN SMITH  at checksure.biz, accessed 21 May 2010  Nick is a keen hiker, and is the President of his borough's Red Ramblers organisation. He is also President of Ebbw Valley Brass. Nick's hobbies include hiking, watching rugby and cinema, and he chairs the parliamentary group on film. Nick is a member of the Parc Bryn Bach Running Club in Tredegar https://pbbrc.run/ and chairs the parliamentary group in support of Parkrun."]}, {"page": "2010 Labour Party leadership election (UK)", "response": ["*David Miliband (81): Bob Ainsworth, Douglas Alexander, Willie Bain, Gordon Banks, Hugh Bayley, Stuart Bell, Ben Bradshaw, Russell Brown, Richard Burden, Liam Byrne, David Cairns, Alan Campbell, Jenny Chapman, Ann Clwyd, Ann Coffey, Rosie Cooper, Mary Creagh, Stella Creasy, Alex Cunningham, Simon Danczuk, Alistair Darling, Gloria De Piero, Brian Donohoe, Gemma Doyle, Angela Eagle, Julie Elliott, Louise Ellman, Chris Evans, Jim Fitzpatrick, Caroline Flint, Paul Flynn, Mike Gapes, Barry Gardiner, Pat Glass, Mary Glindon, Fabian Hamilton, David Hanson, Tom Harris, Mark Hendrick, Margaret Hodge, George Howarth, Tristram Hunt, Alan Johnson, Tessa Jowell, Gerald Kaufman, Liz Kendall, Ivan Lewis, Michael McCann, Gregg McClymont, Siobhain McDonagh, Pat McFadden, Anne McGuire, Ian Mearns, Alun Michael, Jessica Morden, Meg Munn, Jim Murphy, Ian Murray, Pamela Nash, Fiona O'Donnell, Toby Perkins, Bridget Phillipson, Yasmin Qureshi, Nick Raynsford, Jamie Reed, Jonathan Reynolds, Frank Roy, Chris Ruane, Anas Sarwar, Virendra Sharma, Barry Sheerman, Angela Smith, Nick Smith, Peter Soulsby, Graham Stringer, Mark Tami, Gareth Thomas, Valerie Vaz, Phil Wilson, John Woodcock, Shaun Woodward", "| Jenny Chapman || David Miliband || None || None || None || None"]}, {"page": "Chris Williamson (politician)", "response": ["Tom WatsonHolly LynchStella CreasyAnna TurleyRosie DuffieldLouise EllmanRuth SmeethJenny ChapmanRoberta Blackman-WoodsStephen DoughtyKarin SmythBaroness ThorntonLord McNicolBaroness Morgan of HuytonLord TurnbergGloria De PieroBaroness Royall of BlaisdonYvette CooperBaroness Massey of DarwenBaroness KingsmillLord SoleyMadeleine Moon"]}, {"page": "Jennifer Chapman", "response": ["#REDIRECT Jenny Chapman"]}, {"page": "List of United Kingdom MPs by seniority (2010–2015)", "response": ["|529||Jenny Chapman||style=\"background-color: \"|Lab||Darlington"]}, {"page": "The Purple Book (Labour Party)", "response": ["*Jenny Chapman"]}, {"page": "Coalition for Marriage", "response": ["In  the 2015 general election, the organisation delivered leaflets for and against former MPs based on their record on the issue of same-sex marriage. Candidates targeted for voting for the act included Nick Clegg, Sarah Wollaston, Julian Huppert, Anna Soubry, Caroline Lucas, Ed Balls, Jenny Chapman and Simon Kirby. Leaflets highlighting opposition were distributed in the seats of Jacob Rees-Mogg, Roger Godsiff and Craig Whittaker."]}, {"page": "MPs first elected in 2010 to the 55th UK Parliament", "response": ["| Darlington||style=\"background-color: \"| ||Labour||style=\"background-color: \"| ||Jenny Chapman (L)||Parliamentary Assistant to Alan Milburn MP & Councillor for Darlington Borough Council||1973"]}]}}