{"wiki_id": "http://www.wikidata.org/entity/Q26997219", "itemLabel": "Patrick Hodgkinson", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Patrick_Hodgkinson", "wikipedia_page": {"main": "Patrick Hodgkinson (8 March 1930 – 21 February 2016) was a British architect, best known for his design of London's Brunswick Centre.", "link_mentions": [{"page": "Brunswick Centre", "response": ["The centre replaced streets of run-down Georgian era terrace housing. It was designed by Patrick Hodgkinson in the mid-1960s, based on studies by Leslie Martin.  It was initially planned as a private development at a time when private, mixed-use development in the UK was rare.  Building started in 1967 and was completed in 1972, though the building fell some way short of its intended size.  The original plan extended up to Euston Road but the Ministry of Defence would not release the site of a building they leased for use by the Territorial Army (and that still stands next to the Centre today)."]}, {"page": "1972 in architecture", "response": ["* Brunswick Centre in London, designed by Patrick Hodgkinson."]}, {"page": "Architecture of London", "response": ["Significant council housing works in London include the Brunswick Centre (1967–72) by Patrick Hodgkinson and the Alexandra Road Estate (1972–78) by Neave Brown of the Camden Council architects department."]}, {"page": "Architecture of Finland", "response": ["Beginning already in the late 1920s, tens of foreign architects were enticed to seek work in the office of Alvar Aalto, albeit for short durations, most notably the Danish architect Jørn Utzon, British architect Patrick Hodgkinson and Swiss architect Bruno Erat. Erat in particular settled in Finland and became renowned as a pioneer of ecological houses, especially in the use passive solar heating and in 1978 built the first low energy building in Finland.Bruno Erat, Solbranten House 1, Espoo, 1978-79. See: Esa Piironen, Small Houses in Finland. Rakennustieto, Helsinki, 2004, 24-27."]}, {"page": "Hodgkinson", "response": ["*Patrick Hodgkinson, English architect"]}, {"page": "George Finch (architect)", "response": ["thumb|200px|Brixton Recreation Centre interior|leftFinch was born in Tottenham, the son of a milkman. During WWII, he and his sister, Shirley, were evacuated to Saffron Walden, Essex, where he attended Newport Free Grammar School. Finch then studied architecture, at North London Polytechnic (now London Metropolitan University), moving in 1950 to the  Architectural Association School of Architecture. He graduated in 1955 from a year that included Neave Brown, Kenneth Frampton, Patrick Hodgkinson, William Gillitt and Roy Stout."]}, {"page": "Deaths in February 2016", "response": ["*Patrick Hodgkinson, 85, British architect.Patrick Hodgkinson obituary "]}]}}