{"wiki_id": "http://www.wikidata.org/entity/Q27050011", "itemLabel": "Philippa Jones", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Philippa_Jones", "wikipedia_page": {"main": "Philippa Jones MFA (b. 1982, Buckinghamshire, United Kingdom) is a British artist and curator based in St. John's, Newfoundland and Labrador. Her practice includes printmaking, painting, animation, and interactive installations, to explore constructed realities and active myth making. She is notable as the first artist from Newfoundland and Labrador to be included in the National Gallery of Canada contemporary biennial.", "link_mentions": [{"page": "Newfoundland and Labrador", "response": ["Newfoundland and Labrador's arts community is recognized nationally and internationally. The creation of Fogo Island Arts in 2008 on Fogo Island created a residency-based contemporary art program for artists, filmmakers, writers, musicians, curators, designers, and thinkers. In 2013 and 2015, the province was represented at the Venice Biennale as Official Collateral Projects. In 2015, Philippa Jones became the first Newfoundland and Labrador artist to be included in the National Gallery of Canada contemporary art biennial. Other notable contemporary artists who have received national and international attention include Will Gill, Kym Greeley, Ned Pratt and Peter Wilkins."]}, {"page": "Wales at the 2010 Commonwealth Games", "response": ["Philippa Jones"]}, {"page": "Eastern Edge", "response": ["From December 2016 to March 2020, the current Executive Director of Eastern Edge is artist Philippa Jones. Currently, the Interim Director is Daniel Rumbolt, and Charlotte May Hobden is the Programming Assistant."]}, {"page": "Art of Newfoundland and Labrador", "response": ["Newfoundland and Labrador's arts community is now recognized nationally and internationally. Fogo Island Arts, launched in 2008 on Fogo Island, supports a residency-based contemporary art program. In 2013 and 2015, the province was represented at the Venice Biennale as Official Collateral Projects. In 2015, Philippa Jones became the first Newfoundland and Labrador artist to be included in the National Gallery of Canada contemporary art biennial after it was reinstated.", "thumb|Philippa Jones. \"MIRIAD Island\" (2012), pen and ink on wove paper, 71.5 x 456.5 cm. Collection of National Gallery of Canada, Ottawa.|612x612px", "In 2016, in response to an exhibition featuring work by Will Gill, Philippa Jones, Jerry Ropson and others, author Lisa Moore wrote, \"Newfoundland is a malleable idea, constantly being dreamt and reconfigured.\" \"All cultures are in constant flux, of course. But Newfoundland, hyper-aware of being a distinct society, is at the same time riven with a kind of archival anxiety to hold fast to defining myths; the stories we tell to bring ourselves into existence. This anxiety might be a symptom caused by existing on the periphery, subject to constant swings in economic instability and geographical isolation in a sublime but rugged beauty.\""]}, {"page": "Mary Florence MacDonald", "response": ["MacDonald received critical acclaim for her curatorial work. In 2016, her project Land of Mirrors was presented at Eastern Edge Gallery, and featured the work of Michael Flaherty, Will Gill, Philippa Jones, Jerry Ropson, and Jason Wells. As explained by author Lisa Moore in Canadian Art,", "\"There is a subtle ambiguity in the subtitle of this exhibition. It might mean that ongoing experiments are happening in Newfoundland, have always happened there, or it might mean that experiments are happening to the very     thingness that is Newfoundland—or was Newfoundland...Either way, a wilful dreaming is evoked. Newfoundland is a malleable idea, constantly being dreamt and reconfigured. The question also hints at the fanciful, mildly surreal aesthetic throughout the exhibit. MacDonald and the five artists, Will Gill, Jason Wells, Jerry Ropson, Michael Flaherty and Philippa Jones, are intent on exploring a new Newfoundland.\""]}, {"page": "St. Michael's Printshop", "response": ["* Philippa Jones"]}]}}