{"wiki_id": "http://www.wikidata.org/entity/Q27049964", "itemLabel": "Dylan Fletcher", "itemDescription": "British sailor", "wikipedia_url": "https://en.wikipedia.org/wiki/Dylan_Fletcher", "wikipedia_page": {"main": "Dylan James Fletcher-Scott  (born 3 April 1988) is a British sailor and Olympic Champion in Men's 49er in Tokyo 2020. Fletcher and Alain Sign placed sixth in the 49er event at the 2016 Summer Olympics.\nStarting sailing at age 11 and racing at 13, Fletcher has always sailed double handers. Quickly finding himself at the front of the 405 fleet he moved up into the 29er enjoying similar success including 2nd at the Senior 29er worlds in 2006 (Weymouth). He then transitioned into the 49er climbing up the ranks collecting medals along the way.\nFletcher now sails with Olympic 2012 470 Silver medalist Stuart Bithell. The team medalled at every regatta in 2017 winning both the European and World Championships. They have qualified to represent Great Britain at the 2020 Summer Olympics in the Men's 49er class.Fletcher won Olympic gold representing Great Britain at the 2020 Summer Olympics in the Men's 49er class with crew Stuart Bithell.Fletcher was appointed Member of the Order of the British Empire (MBE) in the 2022 New Year Honours for services to sailing.", "link_mentions": [{"page": "Stuart Bithell", "response": ["Stuart Bithell  (born 28 August 1986 in Rochdale) is a British sailor and Olympic champion. He competed with Luke Patience in the 470 class at the 2012 Summer Olympics where he won a silver medal and in the 2020 Summer Olympics where he won a gold medal in the Men's 49er class with Dylan Fletcher.", "In 2013, it was announced that Bithell and Patience would part ways, their aim for 470 gold no longer viable. While Patience continued in the 470, Bithell moved on to partner with John Pink in the 49er class. They failed to qualify for Rio 2016, losing out to Dylan Fletcher and Alain Sign. After Rio, Pink and Sign both left the class. This resulted in Bithell and Fletcher teaming up. The decision was made in Portland, while the two competed against each other in the Moth class. They worked tirelessly together to reach Tokyo 2020.", "Bithell became Olympic champion representing Great Britain at the 2020 Summer Olympics in the Men's 49er class with Dylan Fletcher."]}, {"page": "Sailing at the 2020 Summer Olympics", "response": ["| Dylan FletcherStuart Bithell"]}, {"page": "List of Olympic medalists in sailing by discipline", "response": ["|Dylan FletcherStuart Bithell"]}, {"page": "Sailing at the 2016 Summer Olympics – Qualification", "response": ["|  ||  || 2014 Worlds || 6 || John PinkStuart Bithell || Dylan FletcherAlain Sign"]}, {"page": "Great Britain at the 2016 Summer Olympics", "response": ["|align=left|Dylan FletcherAlain Sign"]}, {"page": "Charlotte Dobson", "response": ["Dobson was born on 5 June 1986 in Glasgow, Scotland.  She studied psychology at the University of Edinburgh. In August 2021 she married fellow olympic sailor Dylan Fletcher."]}, {"page": "Dylan Fletcher-Scott", "response": ["#REDIRECT Dylan Fletcher"]}, {"page": "Alain Sign", "response": ["Alain Sign (born 3 February 1986) is a British sailor. He and Dylan Fletcher placed sixth in the 49er event at the 2016 Summer Olympics."]}, {"page": "Sailing at the 2020 Summer Olympics – Qualification", "response": ["|  ||  || 2018 Worlds || 5 || James PetersFynn Sterritt || Dylan FletcherStuart Bithell"]}, {"page": "Great Britain at the 2020 Summer Olympics", "response": ["|  ||Stuart BithellDylan Fletcher||Sailing||49er||", "|align=left|Stuart BithellDylan Fletcher"]}, {"page": "List of 2020 Summer Olympics medal winners", "response": ["|Dylan FletcherStuart Bithell"]}, {"page": "2019 SailGP championship", "response": ["| Dylan Fletcher"]}]}}