{"wiki_id": "http://www.wikidata.org/entity/Q2702479", "itemLabel": "Cyril Deverell", "itemDescription": "Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Cyril_Deverell", "wikipedia_page": {"main": "Sir Cyril John Deverell  (9 November 1874 – 12 May 1947) was a British Army Field Marshal, who served as Chief of the Imperial General Staff from 1936 to 1937. He fought in the Fourth Anglo-Ashanti War and the First World War and later advised the Government on the importance of maintaining the capability to mount an Expeditionary Force for operations on mainland Europe.", "link_mentions": [{"page": "John Vereker, 6th Viscount Gort", "response": ["In May 1937, Gort was appointed a Companion of the Order of the Bath. In September 1937, he became Military Secretary to the War Minister, Leslie Hore-Belisha, with the temporary rank of lieutenant-general. On 6 December 1937, as part of a purge by Hore-Belisha of senior officers, Gort was appointed to the Army Council, made a general and replaced Field Marshal Sir Cyril Deverell as Chief of the Imperial General Staff. On 1 January 1938, he was made a Knight Commander of the Order of the Bath."]}, {"page": "Leslie Hore-Belisha", "response": ["Unhappy with the Army Council's opposition to his policies, Hore-Belisha sacked Field Marshal Cyril Deverell, the Chief of the Imperial General Staff, along with the Adjutant General and Master-General of the Ordnance in December 1937. Guided by Liddell Hart, he interviewed John Dill and Archibald Wavell before finally settling on Lord Gort, a relatively junior general, as Deverell's replacement. The new team at the head of the British Army was not a success. Gort was no more enthusiastic about Hore-Belisha's course of action than Deverell had been and objected to Liddell Hart's continued influence. For his part by March 1939, Hore-Belisha would declare that \"Gort has no brain at all\"."]}, {"page": "Royal Horse Guards", "response": ["At Villeselve some horsemen from the Royals, Dragoon Guards and 10th Hussars saw some infantry in the sunken lanes \"The Germans had taken up what positions they could in the open\",Lloyd, A Trooper in the tins, HCM and wheeling round made, what was the last cavalry manoeuvre of its kind in Europe.  As many as 70–100 enemy soldiers were killed by sabres.Official History of 6th Cavalry Brigade In 1918 the regiment remounted on horses and were part of Edmund Allenby's army in Palestine mainly engaged in reconnaissance. On 20 May 1918, Haig went to see Major General Cyril Deverell commanding 3rd Division, who complained of the lack of trained officers for battalion and company commanders in the fighting south of Arras and north of Lys.Sheffield & Bourne, p.424"]}, {"page": "53rd (Welsh) Infantry Division", "response": ["|Major-General Cyril Deverell"]}, {"page": "Battle of Bazentin Ridge", "response": ["The 7th Division was brought back after only five days' rest, with no time to assimilate large numbers of replacements. In the afternoon of 13 July, a battalion of the 20th Brigade (Brigadier-General Cyril Deverell) moved forward under local initiative and captured the Hammerhead early. Outposts went forward at  and the two attacking battalions were led forward in single-file, up communication trenches and over ground strewn with wire and abandoned trenches, through two infantry companies, which then drew back into reserve. The jumping-off line was a bank with low trees marked by tape, with a bush on the right flank and Flat Iron Copse on the left,  from the German line and closer to a salient called The Snout, which had been bombarded by heavy trench mortars and appeared empty. Stokes mortars went forward but machine-guns were to wait until they could go straight through to the furthest objective. The brigade was ready by  telephones still worked and few casualties had been suffered."]}]}}