{"wiki_id": "http://www.wikidata.org/entity/Q27050076", "itemLabel": "Jasmin Paris", "itemDescription": "British runner (born 1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jasmin_Paris", "wikipedia_page": {"main": "Jasmin Karina Paris (born November 1983) is a British runner who has been a national fell running champion and who has set records for the Bob Graham Round and the Ramsay Round.\nShe is well known in Great Britain as a fell runner, but became known on the international stage as a sky runner after her victory in the 2016 Skyrunner World Series (Sky Extreme) and bronze medal at the 2016 Skyrunning World Championships (Sky Ultra). She received significant media attention for her overall win in the 2019 Spine Race.", "link_mentions": [{"page": "Bob Graham Round", "response": ["* 2016: Jasmin Paris - 15:24"]}, {"page": "Skyrunner World Series", "response": ["|  Jonathan Albon ||  Jasmin Paris"]}, {"page": "Jeff Paris (mathematician)", "response": ["Paris was married to Malvyn Loraine Blackburn until 1983 when he married Alena Vencovská. He has three sons and three daughters including runner Jasmin Paris."]}, {"page": "Paddy Buckley Round", "response": ["The women's record is held by Jasmin Paris with a time of 18 hours and 33 minutes, set in 2016."]}, {"page": "Ramsay Round", "response": ["On Saturday 18 June 2016, Jasmin Paris set a new record for the Ramsay Round, knocking 46 minutes from the previous fastest round to set a new time of 16 hours 13 minutes. Previously the fastest ladies' time was that of Nicky Spinks who on 31 May 2014 recorded a time of 19 hours 39 minutes for a clockwise round, breaking the previous record set by Helene Diamantides."]}, {"page": "Three Peaks Race", "response": ["| Jasmin Paris"]}, {"page": "Fellsman", "response": ["| Jasmin Paris"]}, {"page": "Paris (surname)", "response": ["* Jasmin Paris (born 1983), British fell running champion, daughter of Jeff Paris (mathematician)", "* Jeff Paris (mathematician) (born 1944), British mathematician, father of Jasmin Paris"]}, {"page": "Nicky Spinks", "response": ["Spinks first completed the Bob Graham Round in 2005.  She subsequently set a woman's record of 18:12 in 2012 then lowered her own record to 18:06 in 2015.  She set the women's record for the Paddy Buckley Round in 2013 at 19:02 and the Ramsay Round in 2014 at 19:39. She thus simultaneously held the women's fastest times for each of the three most famous 24-hour British mountain courses (which has never happened with the men's record) from 2014 until 2016, when Jasmin Paris broke Spinks's records for the individual rounds and set an overall best combined time of 50:10.Inov-8: Jasmin Paris Rewrites the Mountain Running Record Books.  "]}, {"page": "Borrowdale Fell Race", "response": ["| Jasmin Paris", "| Jasmin Paris", "| Jasmin Paris"]}, {"page": "Wasdale Fell Race", "response": ["Billy Bland has the most wins, with nine between 1980 and 1988. Jasmin Paris has won the women's race six times between 2012 and 2018.", "| Jasmin Paris", "| Jasmin Paris", "| Jasmin Paris", "| Jasmin Paris", "| Jasmin Paris", "| Jasmin Paris", "| Jasmin Paris"]}, {"page": "Langdale Horseshoe", "response": ["| Jasmin Paris", "| Jasmin Paris"]}, {"page": "Skyline Scotland", "response": ["In 2016, four runners featured prominently at the front of the race for much of the way: Tom Owens, Jonathan Albon, Marc Lauenstein and Finlay Wild. Albon and Owens lost a few minutes in low cloud locating the checkpoint on Stob Coire Sgreamhach but were still leading together with Lauenstein at the start of the long climb up to the Aonach Eagach. By the top of the climb, Albon had pulled ahead and he held the lead on the crossing of the exposed ridge and the descent to the finish, winning in a time of 6:33:52. Owens finished second around three minutes later.Jonathan Albon: Glen Coe Skyline; Jonathan Albon on Strava: Glen Coe Skyline. Jasmin Paris won the women's race in a time of 8:15:56.BBC: Ready, Steady, Coe: Runners Tackle Mountain Challenges; Skyrunner World Series: Albon and Paris are Extreme Champions.", "Windy and wet conditions for the 2018 event resulted in a bad weather course being used. This was  in length with around  of ascent. Kilian Jornet was the men's winner in 3:37, after having won the Ring of Steall race the previous day. There was a close finish in the women's Glen Coe Skyline, with Hillary Gerardi winning in 4:17:48, seven seconds ahead of Jasmin Paris.Skyline Scotland: Kilian Jornet and Hillary Gerardi win Salomon Glen Coe Skyline 2018.", "|  Jasmin Paris"]}, {"page": "Three Shires Fell Race", "response": ["| Jasmin Paris", "| Jasmin Paris"]}, {"page": "Isle of Jura Fell Race", "response": ["The men's course record is 3:05:14 set by Finlay Wild in 2017, beating the previous record which had been set three years earlier by Hector Haines. Jasmin Paris holds the women's record, with 3:38:43 set in 2015.", "| Jasmin Paris", "| Jasmin Paris", "| Jasmin Paris", "| Jasmin Paris", "| Jasmin Paris"]}, {"page": "Ennerdale Horseshoe Fell Race", "response": ["| Jasmin Paris", "| Jasmin Paris"]}, {"page": "Skyrunning World Championships", "response": ["| Caroline Chaverot || Eva Moreda || Jasmin Paris"]}, {"page": "2016 Skyrunning World Championships", "response": ["|||align=left|Jasmin Paris ||align=left|  ||14:22"]}, {"page": "British Fell Running Championships", "response": ["|Jasmin Paris", "|Jasmin Paris"]}, {"page": "2016 Skyrunner World Series", "response": ["|  Jasmin Paris", "|  Jasmin Paris", "| bgcolor=Khaki| Jasmin Paris"]}, {"page": "Tromsø SkyRace", "response": ["|align=left| Jasmin Paris ||8:43:53"]}, {"page": "Carol Morgan", "response": ["In 2018 she successfully defended her Spine Race title winning by a margin of 10 hours in conditions so severe the non-stop race was paused for 12 hours (but not the race clock) due to heavy winds and snow. Amongst the other challenges of winter in the Cheviots the 2018 runners had to content with frozen water bottles. While conditions varied for competitors over the course of the 4+ days in addition to eating snow, Morgan has to contend with \"50 mph winds with a chill factor of minus 16°C, snow drifts up to [her] belly button\". Her record in the Spine Race was beaten in 2019 by Jasmin Paris who surpassed Morgan's record by 26 hours 41 minutes."]}, {"page": "Spine Race", "response": ["The 2019 race received considerable media attention when the overall win was taken by British women's fell running champion Jasmin Paris.BBC Sport: Spine Race: Jasmin Paris Becomes First Female Winner of 268-mile Ultra Marathon.", "| Jasmin Paris"]}, {"page": "Dragon's Back Race", "response": ["| Jasmin Paris"]}, {"page": "Sabrina Verjee", "response": ["In Summer 2019 she was the overall winner of the Spine Fusion, a summer race which follows a similar route to the Pennine Way but is not identical, in a time of 81hrs 19mins. In January 2020 she finished fifth overall, and first woman, in the Spine Race, the equivalent winter race; her time was 108hrs 7 mins, outside the female race record of 83hrs 12mins set the previous year by Jasmin Paris."]}]}}