{"wiki_id": "http://www.wikidata.org/entity/Q2707095", "itemLabel": "Idwal Foel", "itemDescription": "10th-century King of Gwynedd in Wales", "wikipedia_url": "https://en.wikipedia.org/wiki/Idwal_Foel", "wikipedia_page": {"main": "Idwal Foel (Idwal the Bald; died c. 942) or Idwal ab Anarawd (Idwal son of Anarawd) was a 10th-century King of Gwynedd in Wales. A member of the House of Aberffraw, he inherited the throne from his father, Anarawd ap Rhodri. William of Malmesbury credited him as \"King of the Britons\" in the manner of his father.", "link_mentions": [{"page": "Edmund I", "response": ["Æthelstan had succeeded as the king of England south of the Humber and he became the first king of all England when he conquered Viking-ruled York in 927, but after his death Anlaf Guthfrithson was accepted as king of York and extended Viking rule to the Five Boroughs of north-east Mercia. Edmund was initially forced to accept the reverse, the first major setback for the West Saxon dynasty since Alfred's reign, but he was able to recover his position following Anlaf's death in 941. In 942 he took back control of the Five Boroughs and in 944 he regained control over the whole of England when he expelled the Viking kings of York. Eadred had to deal with further revolts when he became king and York was not finally conquered until 954. Æthelstan had achieved a dominant position over other British kings and Edmund maintained this, perhaps apart from Scotland. The north Welsh king Idwal Foel may have allied with the Vikings as he was killed by the English in 942 and his kingdom of Gwynedd was conquered by the southern Welsh king Hywel Dda. The British kingdom of Strathclyde may also have sided with the Vikings as Edmund ravaged it in 945 and then ceded it to Malcolm I of Scotland. Edmund also continued his brother's friendly relations with Continental rulers, several of whom were married to his half-sisters.", "Edmund inherited overlordship over the kings of Wales from Æthelstan, but Idwal Foel, king of Gwynedd in north Wales, apparently took advantage of Edmund's early weakness to withhold fealty and may have supported Anlaf Guthfrithson, as according to the Annales Cambriæ he was killed by the English in 942 and his kingdom was then conquered by Hywel Dda, the king of Deheubarth in south Wales. Attestations of Welsh kings to English charters appear to have been rare compared with those in Æthelstan's reign, but in the historian David Dumville's view there is no reason to doubt that Edmund retained his overlordship over the Welsh kings. Attestations became more common again after Eadred succeeded Edmund. In a charter of 944 disposing of land in Devon, Edmund is styled \"king of the English and ruler of this British province\", suggesting that the former British kingdom of Dumnonia was still not regarded as fully integrated into England, although the historian Simon Keynes \"suspects some 'local' interference\" in the wording of Edmund's title."]}, {"page": "931", "response": ["* King Morgan Hen of Glywysing and Gwent (Wales) submits to the overlordship of King Æthelstan, and attends his court with Kings Hywel Dda of Deheubarth and Idwal Foel of Gwynedd."]}, {"page": "918", "response": ["* Kings Idwal Foel of Gwynedd and Hywel ap Cadell, and Prince Clydog of Deheubarth (Wales) submit to the overlordship of Edward the Elder. The Vikings raid Anglesey. "]}, {"page": "934", "response": ["* King Tewdwr of Brycheiniog attends the court of King Æthelstan and signs the English Land Charters. Kings Hywel Dda of Deheubarth, Idwal Foel of Gwynedd and Morgan Mwynfawr (\"the Old\") of Morgannwg are compelled to accompany Æthelstan on his campaign against King Constantine II of Scotland."]}, {"page": "942", "response": ["* Idwal Foel, king of Gwynedd, openly rebels against the overlordship of Edmund I. He and Llywelyn ap Merfyn, king of Pows, are killed fighting the English forces.", "* Idwal Foel, king of Gwynedd (Wales)"]}, {"page": "Æthelstan", "response": ["Æthelstan set out on his campaign in May 934, accompanied by four Welsh kings: Hywel Dda of Deheubarth, Idwal Foel of Gwynedd, Morgan ap Owain of Gwent, and Tewdwr ap Griffri of Brycheiniog. His retinue also included eighteen bishops and thirteen earls, six of whom were Danes from eastern England. By late June or early July he had reached Chester-le-Street, where he made generous gifts to the tomb of St Cuthbert, including a stole and maniple (ecclesiastical garments) originally commissioned by his step-mother Ælfflæd as a gift to Bishop Frithestan of Winchester. The invasion was launched by land and sea. According to the twelfth-century chronicler Simeon of Durham, his land forces ravaged as far as Dunnottar in north-east Scotland, the furthest north that any English army had reached since Ecgfrith's disastrous invasion in 685, while the fleet raided Caithness, then probably part of the Norse kingdom of Orkney.Foot, Æthelstan: The First King of England, pp. 87–88, 122–123, 165–167; Woolf, From Pictland to Alba, pp. 158–166; Hunter Blair, An Introduction to Anglo-Saxon England, p. 46", "No battles are recorded during the campaign, and chronicles do not record its outcome. By September, however, he was back in the south of England at Buckingham, where Constantine witnessed a charter as subregulus, thus acknowledging Æthelstan's overlordship. In 935 a charter was attested by Constantine, Owain of Strathclyde, Hywel Dda, Idwal Foel, and Morgan ap Owain. At Christmas of the same year Owain of Strathclyde was once more at Æthelstan's court along with the Welsh kings, but Constantine was not. His return to England less than two years later would be in very different circumstances.Foot, Æthelstan: The First King of England, pp. 88–89; Woolf, From Pictland to Alba, pp. 166–168."]}, {"page": "Hywel Dda", "response": ["In 942 Hywel's cousin Idwal Foel, King of Gwynedd, determined to cast off English overlordship and took up arms against the new English king, Edmund. Idwal and his brother Elisedd were both killed in battle against Edmund's forces. By normal custom Idwal's crown should have passed to his sons, but Hywel intervened. He sent Iago and Ieuaf into exile and established himself as ruler over Gwynedd, which also likely placed him in control of the Kingdom of Powys, which was under the authority of Gwynedd. As such Hywel became king of nearly all of Wales except for Morgannwg and Gwent in the south.Lloyd, pp. 337–338.", "Following Hywel's death in 948, his kingdom was soon split into three. Gwynedd was reclaimed by the sons of Idwal Foel, while Deheubarth was divided between Hywel's sons."]}, {"page": "List of rulers of Wales", "response": ["* Idwal Foel ab Anarawd (Idwal the Bald) (916–942)"]}, {"page": "Kingdom of Gwynedd", "response": ["The House of Aberffraw was displaced in 942 by Hywel Dda, a King of Deheubarth from a junior line of descent from Rhodri Mawr. This occurred because Idwal Foel, the King of Gwynedd, was determined to cast off English overlordship and took up arms against the new English king, Edmund I. Idwal and his brother Elisedd were both killed in battle against Edmund's forces. By normal custom Idwal's crown should have passed to his sons, Ieuaf and Iago ab Idwal, but Hywel Dda intervened and sent Iago and Ieuaf into exile in Ireland and established himself as ruler over Gwynedd until his death in 950 when the House of Aberffraw was restored. Nonetheless, surviving manuscripts of Cyfraith Hywel recognize the importance of the lords of Aberffraw as overlords of Wales along with the rulers of Deheubarth.Of the three surviving groups of manuscripts of the Cyfraith Hywel (all dating from the 12th century or later), one group recognizes Gwynedd exclusively, another Deheubarth exclusively, and the last both together. See: Wade-Evans, A.W. Welsh Medieval Law. \"Introduction\". Oxford Univ., 1909. Accessed 30 Jan 2013."]}, {"page": "Kingdom of Powys", "response": ["In 942 Hywel Dda of Deheubarth (Rhodri's grandson through his second son, Cadell) seized Gwynedd on the death of his cousin, Idwal Foel. He apparently took Powys from Llywelyn ap Merfyn at the same time and arranged for a dynastic marriage between their children. Hywel had founded Deheubarth in 920 out of his maternal and paternal inheritances, and maintained close relations with Æthelstan, King of the Anglo-Saxons, often visiting Æthelstan's court. Hywel studied the English legal system and reformed Welsh law in his own realms (later called the Cyfraith Hywel or \"Laws of Hywel\"), and when he went on pilgrimage to Rome in 928, he took his collection of laws, which allegedly were blessed by the pope."]}, {"page": "List of state leaders in the 10th century", "response": [":*Idwal Foel, King (916–942)", ":*Idwal Foel, King (916–942)"]}, {"page": "Maredudd ab Owain", "response": ["Following Maredudd's death around AD 999, the throne of Gwynedd was recovered for the line of Idwal Foel by Cynan ap Hywel. The throne of Deheubarth went to a man named Rhain who was accepted as Maredudd's son by its people but whoafter the kingdom's conquest by Llywelyn ap Seisyllwas recorded by most Welsh histories as an Irish pretender and usurper. The kingdom was later restored to Maredudd's family, but through Hywel, the grandson of his brother Einion."]}, {"page": "Cynan ap Hywel", "response": ["Cynan ap Hywel (ruled 999–1005) was a Prince of Gwynedd, one of the kingdoms or principalities of medieval Wales. He was the son of Hywel ap Ieuaf, a previous king from the line of Idwal Foel (his grandfather). On Hywel's death, the realm was ruled by his brother, but almost immediately was seized by Maredudd ab Owain."]}, {"page": "Ieuaf", "response": ["Idwal ab Idwal (, died 988), usually known as Ieuaf () to distinguish him from his father Idwal Foel, was joint king of Gwynedd in northern Wales from 950 to 969. He possibly also ruled Powys for some time."]}, {"page": "Iago ab Idwal ap Meurig", "response": ["On the death of Llywelyn ap Seisyll in 1023, the rule of Gwynedd returned to the ancient dynasty with the accession of Iago, who was a great-grandson of Idwal Foel."]}, {"page": "Owain ap Hywel Dda", "response": ["Owain was one of the three sons of Hywel the Good. Upon Hywel's death in 948, Owain, Rhodri, and Edwin divided his lands among themselves according to Welsh law. The sons were not able to retain Hywel's hegemony over Gwynedd, which was reclaimed for its earlier dynasty by the sons of Idwal Foel.", "In 950, two of the sons of Idwal Foel, Iago and Ieuaf, invaded the south, penetrating as far as Dyfed. The sons of Hywel retaliated by invading the north in 954, reaching as far north as the Conwy valley before being defeated at Llanrwst and being obliged to retreat to Ceredigion."]}, {"page": "King of the Britons", "response": ["|Idwal Foel ap Anarawd||916–942||Gwynedd||King of the Britons (in 927)||William of Malmesbury||"]}, {"page": "List of nicknames of European royalty and nobility: I", "response": ["*Idwal Foel "]}, {"page": "Edward the Elder", "response": ["In early 918, Æthelflæd secured the submission of Leicester without a fight, and the Danes of Northumbrian York offered her their allegiance, probably for protection against Norse (Norwegian) Vikings who had invaded Northumbria from Ireland, but she died on 12 June before she could take up the proposal. The same offer is not known to have been made to Edward, and the Norse Vikings took York in 919. According to the main West Saxon version of the Anglo-Saxon Chronicle, after Æthelflæd's death the Mercians submitted to Edward, but the Mercian version (the Mercian Register) states that in December 918 her daughter Ælfwynn \"was deprived of all authority in Mercia and taken into Wessex\". Mercia may have made a bid for continued semi-independence which was suppressed by Edward, and it then came under his direct rule. Stamford had surrendered to Edward before Æthelflæd's death, and Nottingham did the same shortly afterwards. According to the Anglo-Saxon Chronicle for 918, \"all the people who had settled in Mercia, both Danish and English, submitted to him\". This would mean that he ruled all England south of the Humber, but it is not clear whether Lincoln was an exception, as coins of Viking York in the early 920s were probably minted at Lincoln. Some Danish jarls were allowed to keep their estates, although Edward probably also rewarded his supporters with land, and some he kept in his own hands. Coin evidence suggests that his authority was stronger in the East Midlands than in East Anglia. Three Welsh kings, Hywel Dda, Clydog and Idwal Foel, who had previously been subject to Æthelflæd, now gave their allegiance to Edward."]}, {"page": "Lifton, Devon", "response": ["At a meeting of the Witan in Lifton on 12 November 931 King Æthelstan granted land to his thegn Wulfgar, and the charter was witnessed by King Hywel Dda of Deheubarth and King Idwal Foel of Gwynedd."]}, {"page": "Rhodri ap Hywel", "response": ["On Hywel's death in 950 Deheubarth was shared between Rhodri and his two brothers, Edwin and Owain. The sons of Hywel were not able to keep hold of Gwynedd, which was reclaimed for the traditional dynasty of Aberffraw by Iago ap Idwal and Ieuaf ap Idwal, the sons of Idwal Foel."]}, {"page": "10th century in Wales", "response": ["*Idwal Foel, King of Gwynedd"]}, {"page": "Carno", "response": ["In 952, Iago and Ieuaf, the two exiled sons of Idwal Foel, King of Gwynedd, invaded Dyfed. But they were defeated in a decisive battle near Carno by the sons of Hywel Dda, King of Deheubarth. The victory secured the sovereignty of North Wales."]}, {"page": "Idwal Foel ap Anarawd", "response": ["#REDIRECT Idwal Foel"]}, {"page": "House of Aberffraw", "response": ["Members of the House of Aberffraw would include Idwal Foel, Iago ab Idwal, Cynan ab Iago, Gruffudd ap Cynan, Owain Gwynedd, Gwenllian ferch Gruffydd, Llywelyn the Great, Llywelyn ap Gruffudd, and Owain Lawgoch. Several later Welsh families, including the Wynn family of Gwydir and the Anwyl of Tywyn family, would claim to be heirs of the dynasty."]}, {"page": "Idwal", "response": ["*Idwal Foel (died 942), a King of Gwynedd"]}, {"page": "List of Anglo-Welsh wars", "response": ["* 940 when Idwal Foel of Gwynedd invaded England and was driven back and later deprived of his lands."]}, {"page": "List of people known as the Bald", "response": ["*Idwal Foel (died c. 942), a king of Gwynedd in Wales"]}, {"page": "List of rulers of Gwynedd", "response": ["* Idwal Foel ab Anarawd (Idwal the Bald) (916–942)"]}, {"page": "Idwal the Bald", "response": ["#redirect Idwal Foel"]}]}}