{"wiki_id": "http://www.wikidata.org/entity/Q2705883", "itemLabel": "Rhun Hir ap Maelgwn", "itemDescription": "King of Gwynedd", "wikipedia_url": "https://en.wikipedia.org/wiki/Rhun_Hir_ap_Maelgwn", "wikipedia_page": {"main": "Rhun ap Maelgwn Gwynedd (died c. 586), also known as Rhun Hir ap Maelgwn Gwynedd (English: Rhun the Tall, son of Maelgwn Gwynedd), sometimes spelt as 'Rhûn', was King of Gwynedd (reigned c. 547 – c. 586). He came to the throne on the death of his father, King Maelgwn Gwynedd. There are no historical records of his reign in this early age. A story preserved in both the Venedotian Code and an elegy by Taliesin says that he waged a war against Rhydderch Hael of Alt Clut and the kings of Gododdin or Manaw Gododdin. The small scattered settlement of Caerhun in the Conwy valley is said to be named for him, though without strong authority. Rhun also appears in several medieval literary stories, as well as in the Welsh Triads. His wife was Perwyr ferch Rhûn \"Ryfeddfawr\" and their son was Beli ap Rhun \"Hîr\".\nRhun ap Maelgwn appears in the royal genealogies of the Harleian genealogies, Jesus College MS. 20, and Hengwrt MS. 202. The Bonedd y Saint (English: Descent of the Saints) says that he is the ancestor of Saint Edeyrn (the Bonedd y Saint says that Edeyrn was the great-grandson of Rhun, while Hengwrt MS. 202 says that he was the grandson of Rhun).", "link_mentions": [{"page": "560", "response": ["* Elidyr of Strathclyde invades Gwynedd (Wales) and tries to expel his brother-in-law, king Rhun Hir ap Maelgwn."]}, {"page": "586", "response": ["* Rhun Hir ap Maelgwn, king of Gwynedd"]}, {"page": "List of rulers of Wales", "response": ["* Rhun Hir ap Maelgwn (Rhun the Tall) (c. 547–c. 580)"]}, {"page": "Rhun", "response": ["* Rhun Hir ap Maelgwn (died 586), King of Gwynedd"]}, {"page": "Kingdom of Gwynedd", "response": ["Maelgwn eventually died from the plague in 547, leaving a succession crisis in his wake. His son-in-law, Elidyr Mwynfawr of the Kingdom of Strathclyde, claimed the throne and invaded Gwynedd to displace Maelgwn's son, Rhun Hir ap Maelgwn. Elidyr was killed in the attempt, but his death was then avenged by his relatives, who ravaged the coast of Arfon. Rhun counter-attacked and exacted the same penalty on the lands of his foes in what is now central Scotland. The long distances these armies travelled suggests they were moving across the Irish Sea, but, because almost all of what is now northern England was at this point (c. 550) under Brittonic rule, it is possible that his army marched to Strathclyde overland. Rhun returned to Gwynedd, and the rest of his reign was far less eventful. He was succeeded by his son, Beli ap Rhun in c. 586."]}, {"page": "Rhun Hir ap Maelgwyn", "response": ["#REDIRECT Rhun Hir ap Maelgwn"]}, {"page": "List of nicknames of European royalty and nobility: R", "response": ["*Rhun Hir ap Maelgwn "]}, {"page": "Hir (disambiguation)", "response": ["* Rhun Hir ap Maelgwn (died c. 586), king of Gwynedd"]}, {"page": "Rhun ap Maelgwn Gwynedd", "response": ["#REDIRECT Rhun Hir ap Maelgwn"]}, {"page": "Rhun Hir", "response": ["#REDIRECT Rhun Hir ap Maelgwn"]}, {"page": "Rhun ap Maelgwn", "response": ["#REDIRECT Rhun Hir ap Maelgwn"]}, {"page": "List of rulers of Gwynedd", "response": ["* Rhun Hir ap Maelgwn (Rhun the Tall) (c. 547–c. 580)"]}, {"page": "List of state leaders in the 6th century", "response": [":*Rhun Hir ap Maelgwn, King (c.547–c.580)"]}, {"page": "Rhun (Welsh given name)", "response": ["*Rhun Hir ap Maelgwn (died c. 586), king of Gwynedd"]}, {"page": "List of rulers named Rhun", "response": ["*Rhun Hir ap Maelgwn (died c. 586), king of Gwynedd"]}]}}