{"wiki_id": "http://www.wikidata.org/entity/Q270009", "itemLabel": "Alistair Burt", "itemDescription": "British politician (born 1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alistair_Burt", "wikipedia_page": {"main": "Alistair James Hendrie Burt (born 25 May 1955) is a British politician who served as Member of Parliament (MP) for North East Bedfordshire from 2001 until 2019. He was previously MP for his native Bury North in Greater Manchester from 1983 until 1997. Burt was Parliamentary Under Secretary of State then Minister of State at the Department of Social Security from 1992 to 1997, and Parliamentary Under Secretary of State at the Foreign and Commonwealth Office from 2010 to 2013. Burt was also Minister of State at the Department of Health from May 2015 to July 2016.\nFirst elected as a Conservative, Burt had the Conservative whip removed on 3 September 2019. On 29 October he was one of ten Conservative MPs to have the whip restored. He retired at the 2019 general election.In September 2020 he was appointed as Pro-Chancellor of Lancaster University, succeeding Lord Liddle.\n\n", "link_mentions": [{"page": "May 25", "response": ["*1955 – Alistair Burt, English lawyer and politician"]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Alistair Burt"]}, {"page": "1983 United Kingdom general election", "response": ["|Alistair Burt"]}, {"page": "David Owen", "response": ["During his investigation into the matter he attempted to access his archived documents and files from his time as minister. At first he was told \"they couldn't find them\" and was later told they had all been destroyed;Archived at Ghostarchive and the Wayback Machine:  the exact series of events that led to the destruction of these documents remains a mystery and continues to raise questions amongst MPs such as Alistair Burt. Lord Owen has regularly told the media that he is not a conspiracy theorist but that he does suspect there has been a cover-up carried out by the Civil Service and that this was done after prosecutions and jail sentences were brought against government officials in France."]}, {"page": "Bury, Greater Manchester", "response": ["* Alistair Burt (born 1955), former MP 2001–2019 for North East Bedfordshire was born in Bury and was School Captain of Bury Grammar School. Prior to losing his seat to David Chaytor in 1997 he represented his hometown as MP for Bury North from 1983."]}, {"page": "Lancaster University", "response": ["Former Chancellor Sir Chris Bonington serves as the Chancellor's Ambassador, whilst Alistair Burt is the current Pro-Chancellor and chair of the University Council, succeeding Roger Liddle in October 2020."]}, {"page": "List of current members of the British Privy Council", "response": ["| Alistair Burt"]}, {"page": "Tory Reform Group", "response": ["*Vice-Presidents: Alistair Burt MP, Damian Green MP, Jonathan Evans, Robert Buckland MP and Jane Ellison."]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Alistair Burt"]}, {"page": "David Chaytor", "response": ["He contested the parliamentary constituency of Calder Valley at the 1987 General Election, but was defeated by 6,045 votes by the sitting Conservative MP Donald Thompson. He again contested Calder Valley at the 1992 General Election, at which he reduced Thompson's majority to 4,878. He had to cede the candidacy for Calder Valley because of an all women shortlist which selected Christine McCafferty. However, Chaytor contested the marginal seat of Bury North at the 1997 General Election which he won, defeating the then Social Security minister Alistair Burt by 7,866 votes. Chaytor made his maiden speech on 17 June 1997, where he talked of the humble Bury black pudding and Bury's most famous son, Robert Peel."]}, {"page": "David Crausby", "response": ["He contested the marginal Bury North seat, having been just elected as Chairman of the local constituency Labour Party, at the 1987 general election but was defeated by the sitting Conservative MP Alistair Burt by 6,911 votes. He contested the Conservative-held marginal seat of Bolton North East at the 1992 general election where the sitting MP Peter Thurnham was defending an 813 majority. Bolton North East became more marginal with Thurnham retaining the seat by just 185 votes."]}, {"page": "Jim Dobbin", "response": ["In 1983 he was elected as a councillor in the Metropolitan Borough of Rochdale, becoming the Labour group leader in 1994, and became the leader of the council in 1996. He stepped down from both the National Health Service and the council at Rochdale on his election to the House of Commons. In 1992 he had unsuccessfully contested the Bury North seat, coming second to the sitting Conservative MP Alistair Burt, by 4,764 votes."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Alistair Burt"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Alistair Burt"]}, {"page": "List of United Kingdom MPs: B", "response": ["* Alistair Burt (1983–1997), (2001–2019)"]}, {"page": "Bury Grammar School", "response": ["| Alistair Burt"]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["* Alistair Burt (b. 1955)"]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| North East Bedfordshire || Alistair Burt || Conservative || Alistair Burt || Conservative"]}, {"page": "Bury North (UK Parliament constituency)", "response": ["| Alistair Burt"]}, {"page": "North East Bedfordshire (UK Parliament constituency)", "response": ["|rowspan=\"3\"| Alistair Burt"]}, {"page": "Shaker Aamer", "response": ["In September 2011, Foreign Office Minister Alistair Burt said that negotiations were ongoing and confidential. Supporters of Aamer criticized the UK government for not doing enough on his behalf; they urged the government to step up their efforts."]}, {"page": "Conservative Friends of Israel", "response": ["*Alistair Burt MP"]}, {"page": "Mohammad Reza Rahimi", "response": ["The European Union's foreign policy chief Catherine Ashton, who leads nuclear talks with Iran on behalf of six world powers, released a statement, stating that she \"is deeply disturbed by racist and anti-Semitic statements made by Iranian First Vice-President Mohammad Reza Rahimi. Such statements are unacceptable and should not be tolerated.\" Italian Foreign Minister Giulio Terzi also condemned Rahimi's remarks, calling them \"Disturbing and absolutely unacceptable.\"International officials ask Iran to refrain from anti-Semitic statements Michael Astor, The Associated Press (republished in The Gazette (Montreal)) 28 June 2012. Alistair Burt, the British foreign minister for the Middle East, stated that \"We condemn utterly the baseless comments from Iran's vice president Rahimi about the Talmud and the Jewish faith, made at a United Nations drugs control event in Tehran this week. Racism and anti-semitism are unacceptable in any circumstance, let alone at an event sponsored by the United Nations. We call upon Iran to correct this scandalous statement, and to ensure that its officials respect the proper international norms and standards in the future.\"UK condemns Iranian vice president for anti-semitic remarks, The Guardian, 28 June 2012.Iran's Vice-President Mohammad-Reza Rahimi Remarks Condemned As 'Anti-Semitic', HuffPost, 28 June 2012."]}, {"page": "Paul Flynn (politician)", "response": ["In November 2011, Flynn expressed concern that Matthew Gould, the UK's ambassador to Israel, had \"proclaimed himself to be a Zionist\".Hansard Public Administration Committee 24 November 2011 Martin Bright, writing in The Jewish Chronicle, reported that when challenged, Flynn said that Gould was vulnerable to accusations \"of having Jewish loyalty\" and that the position should be given to \"someone with roots in the UK\". Flynn said, \"there hasn't been a Jewish ambassador to Israel and I think that is a good decision – to avoid the accusation that they have gone native.\" These comments drew criticism from Middle East Minister Alistair Burt, who stated that \"Paul Flynn should take some time to consider his comments, which could easily be misconstrued. There is absolutely no reason why our ambassador to Israel should not be Jewish. Any allegations about Matthew Gould's conduct are utterly unsubstantiated. He is a first-class ambassador.\""]}, {"page": "Frank White (British politician)", "response": ["His first elected political office was as a councillor to Bolton County Borough council, representing the Tonge ward from 1964 to 1974. On his second attempt, he was elected at the October 1974 general election as the Member of Parliament (MP) for the marginal Bury and Radcliffe constituency.General Election 10 October 1974: Bradford North — Caithness & Sutherland . Political Science Resources. Retrieved 31 March 2013. He was an assistant government whip from 1976 to 1978. His Bury and Radcliffe seat was abolished by boundary changes for the 1983 general election. Instead he stood in the new Bury North seat, but lost to the Conservative candidate Alistair Burt.General Election 9 June 1983: Bridlington — Cardiff South & Penarth . Political Science Resources. Retrieved 31 March 2013. In 1986, he was elected as a councillor to Bolton Metropolitan Borough council, once again representing the Tonge ward. After ward boundary and name changes in 2004, he represented the Tonge with The Haulgh ward. He attempted to re-enter Parliament in the 1987 general election for Bolton North East, but failed by 813 votes."]}, {"page": "International Commission on Missing Persons", "response": ["ICMP is governed by the ICMP Board of Commissioners, which includes the current chairman Thomas Miller (since May 2011), Alistair Burt, Her Majesty Queen Noor, Knut Vollebaek, Rolf Ekéus. Sanji Monageng, María Eugenia Brizuela de Ávila, Bert Koenders, and Dirk Brengelmann. Previous chairs include Cyrus Vance (Chairperson 1996–1997), Bob Dole (Chairperson 1997–2001), and Jim Kimsey (Chairperson 2001 – 2011)."]}, {"page": "United Kingdom general election records", "response": ["* 2001: Henry Bellingham, Alistair Burt, Derek Conway, Charles Hendry, Greg Knight, Andrew Mitchell, Bob Spink"]}]}}