{"wiki_id": "http://www.wikidata.org/entity/Q27032", "itemLabel": "Edmund Dulac", "itemDescription": "French-born British illustrator and stamp designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Edmund_Dulac", "wikipedia_page": {"main": "Edmund Dulac (born Edmond Dulac; 22 October 1882 – 25 May 1953) was a French British naturalised magazine illustrator, book illustrator and stamp designer. Born in Toulouse he studied law but later turned to the study of art at the École des Beaux-Arts. He moved to London early in the 20th century and in 1905 received his first commission to illustrate the novels of the Brontë Sisters. During World War I, Dulac produced relief books and when after the war the deluxe children's book market shrank he turned to magazine illustrations among other ventures. He designed banknotes during World War II and postage stamps, most notably those that heralded the beginning of Queen Elizabeth II's reign.\n\n", "link_mentions": [{"page": "October 22", "response": ["*1882 – Edmund Dulac, French-English illustrator (d. 1953)"]}, {"page": "Rubaiyat of Omar Khayyam", "response": ["Hodder and Stoughton (1909), illustrations by Edmund Dulac;", "* The artist/illustrator Edmund Dulac produced some much-beloved illustrations for the Rubaiyat, 1909."]}, {"page": "Brothers Grimm", "response": ["In Germany,  was also released in a \"popular poster-sized  (broadsides)\" format and in single story formats for the more popular tales, such as \"Hansel and Gretel\". The stories were often added to collections by other authors without respect to copyright as the tales became a focus of interest for children's book illustrators, with well-known artists such as Arthur Rackham, Walter Crane, and Edmund Dulac illustrating the tales. A popular edition that sold well was released in the mid-19th century and included elaborate etchings by George Cruikshank. At the deaths of the brothers, the copyright went to Hermann Grimm (Wilhelm's son) who continued the practice of printing the volumes in expensive and complete editions. However, the copyright lapsed after 1893 and various publishers began to print the stories in many formats and editions. In the 21st century,  is a universally recognized text, commonly called Grimms' Fairy Tales in English. Jacob and Wilhelm's collection of stories has been translated to more than 160 languages with 120 different editions of the text available for sale in the US alone."]}, {"page": "One Thousand and One Nights", "response": ["Famous illustrators for British editions include: Arthur Boyd Houghton, John Tenniel, John Everett Millais and George John Pinwell for Dalziel's Illustrated Arabian Nights Entertainments, published in 1865; Walter Crane for Aladdin's Picture Book (1876); Frank Brangwyn for the 1896 edition of Lane's translation; Albert Letchford for the 1897 edition of Burton's translation; Edmund Dulac for Stories from the Arabian Nights (1907), Princess Badoura (1913) and Sindbad the Sailor & Other Tales from the Arabian Nights (1914). Others artists include John D. Batten, (Fairy Tales From The Arabian Nights, 1893), Kay Nielsen, Eric Fraser, Errol le Cain, Maxfield Parrish, W. Heath Robinson and Arthur Szyk (1954)."]}, {"page": "Children's literature", "response": ["Twentieth-century artists such as Kay Nielson, Edmund Dulac, and Arthur Rackham produced illustrations that are still reprinted today. Developments in printing capabilities were reflected in children's books. After World War II, offset lithography became more refined, and painter-style illustrations, such as Brian Wildsmith's were common by the 1950s."]}, {"page": "Polish złoty", "response": ["|Edmund Dulac"]}, {"page": "Brian Froud", "response": ["Among Froud's major influences are the 19th and early 20th-century illustrators Arthur Rackham, Edmund Dulac, and Richard Dadd. Froud cites the early influence of Rackham, \"in particular, [Rackham's] drawings of trees that had faces\", as sparking his interest in illustrating fairy tales, and describes having had a love of nature from childhood that has informed his style. He is frequently inspired by the landscape of Dartmoor. Other influences Froud cites include the Robinson brothers (Thomas, Charles and William), the Pre-Raphaelites, William Morris and Northern European art from the 1500s and 1600s. He was fascinated by Greek, Druid, Celtic and German 15th-century history and mythology. Froud's work has also been influenced by Arthurian legend, \"com[ing] from Glastonbury as a sacred centre\". Jeremiah Horrigan of the Poughkeepsie Journal wrote that Froud's style \"echoes not only the great 19th century illustrators he reveres, but also harbors a wealth of elements ranging from Medieval to ancient Celtic and Nordic folk art.\""]}, {"page": "The Raven", "response": ["Many 20th-century artists and contemporary illustrators created artworks and illustrations based on \"The Raven\", including Edmund Dulac, István Orosz,—Anamorphic illustration for \"The Raven\"—the same illustration with a chrome-plated brass cylinder and Ryan Price."]}, {"page": "Eric Gill", "response": ["Gill was commissioned to produce a sequence of seven bas-relief panels for the façade of The People's Palace, now the Great Hall of Queen Mary University of London, which opened in 1936. In 1937, he designed the background of the first George VI definitive stamp series for the post office.Peter Worsfold, Great Britain King George VI Low Value Definitive Stamps, The Great Britain Philatelic Society, 2001, . The effigy of George VI was drawn by Edmund Dulac, who had a debate with Gill in newspapers about stamp designing after the Edward VIII postage stamps late-1936, quoted in Colin White, Edmund Dulac, Studio Vista, 1977, p. 172. In 1938 Gill produced The Creation of Adam, three bas-reliefs in stone for the Palace of Nations, the League of Nations building in Geneva, Switzerland. During this period he was made a Royal Designer for Industry, the highest British award for designers, by the Royal Society of Arts and became a founder-member of the RSA's Faculty of Royal Designers for Industry when it was established in 1938. In April 1937, Gill was elected an Associate member of the Royal Academy."]}, {"page": "Laurence Binyon", "response": ["In 1904 he married historian Cicely Margaret Powell, and the couple had three daughters. During those years, Binyon belonged to a circle of artists, as a regular patron of the Vienna Café in Oxford Street. His fellow intellectuals there were Ezra Pound, Sir William Rothenstein, Walter Sickert, Charles Ricketts, Lucien Pissarro and Edmund Dulac."]}, {"page": "Picture book", "response": ["Toy books were introduced in the latter half of the 19th century, small paper bound books with art dominating the text. These had a larger proportion of pictures to words than earlier books, and many of their pictures were in color. The best of these were illustrated by the triumvirate of English illustrators Randolph Caldecott, Walter Crane, and Kate Greenaway whose association with colour printer and wood engraver Edmund Evans produced books of great quality.Hunt, p. 674 In the late 19th and early 20th century a small number of American and British artists made their living illustrating children's books, like Rose O'Neill, Arthur Rackham, Cicely Mary Barker, Willy Pogany, Edmund Dulac, W. Heath Robinson, Howard Pyle, or Charles Robinson. Generally, these illustrated books had eight to twelve pages of illustrated pictures or plates accompanying a classic children's storybook."]}, {"page": "Richard Williams (animator)", "response": ["Williams grew up on Golfdale Road, a suburban street in Toronto, where he and his childhood friend Martin Hunter put on magic shows and comedy acts for the local neighbourhood: \"we collected \"$16.25, wealth beyond the dreams of avarice\".Hunter, Martin, Young Hunting – a memoir, ECW Press, Toronto (2008), 40 Williams' mother Kay was an accomplished illustrator whose work was inspired by Arthur Rackham and Edmund Dulac. Kay read her son the stories of the Arabian Nights, which would later inspire his magnum opus The Thief and the Cobbler. \"Kay introduced us to The Thief of Baghdad with its flying carpets, magical horses and wicked viziers\".Hunter, Martin, Young Hunting – a memoir, ECW Press, Toronto (2008), 38 At the age of five, Kay took her son to see Snow White and the Seven Dwarfs (1937), a film which made a \"tremendous impression\" on him. Later he would quote his mother as saying to him \"“You saw ‘Snow White’ when you were 5, and you were never the same.”"]}, {"page": "Laurence Housman", "response": ["*Stories from the Arabian Nights, Retold by Laurence Housman (1907) — illustrated by Edmund Dulac", "*Princess Badoura: a tale from the Arabian nights (1913) — illustrated by Edmund Dulac"]}, {"page": "Willy Pogany", "response": ["William Andrew Pogany (born Vilmos András Pogány; August 24, 1882 – July 30, 1955) was a prolific Hungarian illustrator of children's and other books. His contemporaries include C. Coles Phillips, Joseph Clement Coll, Edmund Dulac, Harvey Dunn, Walter Hunt Everett, Harry Rountree, Sarah Stilwell Weber, and N.C. Wyeth. He is best known for his pen and ink drawings of myths and fables. A large portion of Pogany's work is described as Art Nouveau. Pogany's artistic style is heavily fairy-tale orientated and often feature motifs of mythical animals such as nymphs and pixies. He paid great attention to botanical details.  He used dreamy and warm pastel scenes with watercolors, oil paintings, and especially pen and ink."]}, {"page": "Postage stamps and postal history of Great Britain", "response": ["A set of four stamps was issued in 1936 for Edward VIII before he abdicated. George VI's coronation was marked with a commemorative: part of an omnibus issue which included every colony in the Empire. New definitives featured a profile of the King on a solid colour background, based on a plaster cast by Edmund Dulac. This was a precursor of the Machins three decades later: see below."]}, {"page": "Pauline Baynes", "response": ["At nineteen, again like her sister, she won a place at the prestigious Slade School of Fine Art, just as it left its usual premises on the Gower Street campus of University College London to begin a period of wartime cohabitation with the Ruskin School of Drawing in the University of Oxford. Studying the work of the illustrators Gustave Doré, Edmund Dulac, Arthur Rackham, Ernest Shepard, R. S. Sherriffs, Rex Whistler, Jacques-Marie-Gaston Onfroy de Bréville (\"Job\") and the anonymous illuminators of mediaeval manuscripts, she became more convinced then ever that she had a vocation to follow in their footsteps. She was not a diligent student, frittering away her time on \"coffee and parties\", and she left the Slade without a qualification. She did, however, achieve the distinction, one shared with her sister, of exhibiting at the Royal Academy of Arts, in 1939."]}, {"page": "Michael Winner", "response": ["Winner was an art collector, and a connoisseur of British illustration. Winner's art collection includes works by Jan Micker, William James, Edmund Dulac, E. H. Shepard, Arthur Rackham, Kay Nielsen and Beatrix Potter. His collection once included almost 200 signed colour-washed illustrations by Donald McGill."]}]}}