{"wiki_id": "http://www.wikidata.org/entity/Q271284", "itemLabel": "Alan Parker", "itemDescription": "English film producer and director (1944-2020)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Parker", "wikipedia_page": {"main": "Sir Alan William Parker  (14 February 1944 – 31 July 2020) was an English filmmaker. His early career, beginning in his late teens, was spent as a copywriter and director of television advertisements. After about ten years of filming adverts, many of which won awards for creativity, he began screenwriting and directing films.\nParker was known for using a wide range of filmmaking styles and working in differing genres. He directed musicals, including Bugsy Malone (1976), Fame (1980), Pink Floyd – The Wall (1982), The Commitments (1991) and Evita (1996); true-story dramas, including Midnight Express (1978), Mississippi Burning (1988), Come See the Paradise (1990) and Angela's Ashes (1999); family dramas, including Shoot the Moon (1982), and horrors and thrillers including Angel Heart (1987) and The Life of David Gale (2003).His films won nineteen BAFTA awards, ten Golden Globes and six Academy Awards. His film Birdy was chosen by the National Board of Review as one of the Top Ten Films of 1984, and won the Grand Prix Spécial du Jury prize at the 1985 Cannes Film Festival. Parker was appointed a Commander of the Order of the British Empire for his services to the British film industry and knighted in 2002. He was active in both British cinema and American cinema, along with being a founding member of the Directors Guild of Great Britain and lecturing at various film schools.\nIn 2000 he received the Royal Photographic Society Lumière Award for major achievement in cinematography, video or animation.  In 2013 he received the BAFTA Academy Fellowship Award, the highest honour the British Film Academy can give a filmmaker. Parker donated his personal archive to the British Film Institute's National Archive in 2015.", "link_mentions": [{"page": "Cinema of the United Kingdom", "response": ["Goldcrest producer David Puttnam has been described as \"the nearest thing to a mogul that British cinema has had in the last quarter of the 20th century.\" Under Puttnam, a generation of British directors emerged making popular films with international distribution. Some of the talent backed by Puttnam — Hugh Hudson, Ridley Scott, Alan Parker, and Adrian Lyne — had shot commercials; Puttnam himself had begun his career in the advertising industry. When Hudson's Chariots of Fire (1981) won 4 Academy Awards in 1982, including Best Picture, its writer Colin Welland declared \"the British are coming!\".\"This week's new theatre and dance\". The Guardian. Retrieved 19 July 2012. When Gandhi (1982), another Goldcrest film, picked up a Best Picture Oscar, it looked as if he was right."]}, {"page": "February 14", "response": ["*  1944   – Alan Parker, English director, producer, and screenwriter (d. 2020)"]}, {"page": "Musical film", "response": ["In the 1970s, film culture and the changing demographics of filmgoers placed greater emphasis on gritty realism, while the pure entertainment and theatricality of classical-era Hollywood musicals was seen as old-fashioned. Despite this, Fiddler on the Roof and Cabaret were more traditional musicals closely adapted from stage shows and were strong successes with critics and audiences. Changing cultural mores and the abandonment of the Hays Code in 1968 also contributed to changing tastes in film audiences. The 1973 film of Andrew Lloyd Webber and Tim Rice's Jesus Christ Superstar was met with some criticism by religious groups but was well received. By the mid-1970s, filmmakers avoided the genre in favor of using music by popular rock or pop bands as background music, partly in hope of selling a soundtrack album to fans. The Rocky Horror Picture Show was originally released in 1975 and was a critical failure until it started midnight screenings in the 1980s where it achieved cult status. 1976 saw the release of the low-budget comic musical, The First Nudie Musical, released by Paramount. The 1978 film version of Grease was a smash hit; its songs were original compositions done in a 1950s pop style. However, the sequel Grease 2 (released in 1982) bombed at the box-office. Films about performers which incorporated gritty drama and musical numbers interwoven as a diegetic part of the storyline were produced, such as Lady Sings the Blues, All That Jazz, and New York, New York. Some musicals made in Britain experimented with the form, such as Richard Attenborough's Oh! What a Lovely War (released in 1969), Alan Parker's Bugsy Malone and Ken Russell's Tommy and Lisztomania."]}, {"page": "Michael Mann", "response": ["Mann later moved to London in the mid 1960s to go to graduate school in cinema. He went on to receive a graduate degree at the London Film School in 1967. He spent seven years in the United Kingdom going to film school and then working on commercials along with contemporaries Alan Parker, Ridley Scott and Adrian Lyne. In 1968, footage he shot of the Paris student revolt for a documentary, Insurrection, aired on NBC's First Tuesday news program and he developed his '68 experiences into the short film Jaunpuri which won the Jury Prize at Cannes in 1970."]}, {"page": "Ridley Scott", "response": ["In 1968, Ridley and Tony Scott founded Ridley Scott Associates (RSA), a film and commercial production company. Working alongside Alan Parker, Hugh Hudson and cinematographer Hugh Johnson, Ridley Scott made many commercials at RSA during the 1970s, including a 1973 Hovis bread advertisement, \"Bike Round\" (underscored by the slow movement of Dvořák's \"New World\" symphony rearranged for brass), filmed in Gold Hill, Shaftesbury, Dorset. A nostalgia themed television advert that captured the public imagination, it was voted the UK's favourite commercial in a 2006 poll. In the 1970s the Chanel No. 5 brand needed revitalisation having run the risk of being labelled as mass market and passé. Directed by Scott in the 1970s and 1980s, Chanel television commercials were inventive mini-films with production values of surreal fantasy and seduction, which \"played on the same visual imagery, with the same silhouette of the bottle.\""]}, {"page": "Trevor Jones (composer)", "response": ["| Alan Parker", "| Alan Parker"]}, {"page": "1970s", "response": ["* Alan Parker"]}, {"page": "1980s", "response": ["The 1980s saw the return of studio-driven films, coming from the filmmaker-driven New Hollywood era of the 1970s. The period was when 'high concept' films gained popularity, where movies were to be easily marketable and understandable, and, therefore, they had short cinematic plots that could be summarized in one or two sentences. The modern Hollywood blockbuster is the most popular film format from the 1980s. Producer Don Simpson is usually credited with the creation of the high-concept picture of the modern Hollywood blockbuster. In the mid 1980s, a wave of British directors, including Ridley Scott, Alan Parker, Adrian Lyne and Tony Scott (with the latter directing a number of Don Simpson films) ushered in a new era of blockbusters using the crowd-pleasing skills they had honed in UK television commercials."]}, {"page": "1944", "response": ["** Sir Alan Parker, English film director, producer, actor and writer (d. 2020)"]}]}}