{"wiki_id": "http://www.wikidata.org/entity/Q2710509", "itemLabel": "Grant McCann", "itemDescription": "Northern Irish association football player and manager (born 1980)", "wikipedia_url": "https://en.wikipedia.org/wiki/Grant_McCann", "wikipedia_page": {"main": "Grant Samuel McCann (born 14 April 1980) is a Northern Irish professional football manager and former player who played as a midfielder in the Football League. He was most recently the manager of EFL Championship club Hull City.\nBorn in Belfast, McCann played in the Distillery youth system from 1995 until signing for the West Ham United Academy of Football in 1996, where he started his professional career. He made his debut on 19 May 2001 in a 2–1 away defeat to Middlesbrough. McCann also won 39 caps for Northern Ireland after making his senior debut against Malta in 2001, with the last of his 39 caps won in a 6–0 friendly defeat against the Netherlands in June 2012.\n\n", "link_mentions": [{"page": "Peterborough United F.C.", "response": ["|align=left| Grant McCann", "|align=left| Grant McCann", "|align=left| Grant McCann"]}, {"page": "Doncaster Rovers F.C.", "response": ["Darren Ferguson left his post in June 2017 and was replaced by another former Peterborough boss in Grant McCann ahead of the 2018/19 season. Under McCann, Rovers finished sixth in League One, qualifying for the end of season play-offs where they faced Charlton Athletic over two legs. A 2–1 defeat in the first leg and an early Krystian Bielik goal in the second left Rovers with a mountain to climb at The Valley, but goals from  captain Tommy Rowe and Andy Butler forced extra time. John Marquis put Rovers ahead for the first time in extra time, only for Darren Pratley to equalise a minute later. Rovers lost the penalty shoot-out 4–3 with misses coming from Rowe and Marquis as they fell just short of making the Wembley Stadium showdown."]}, {"page": "Scunthorpe United F.C.", "response": ["*Grant McCann – Northern Ireland international"]}, {"page": "Livingston F.C.", "response": ["*   Grant McCann"]}, {"page": "Hull City A.F.C.", "response": ["On 21 June 2019, Grant McCann was appointed as head coach on a one-year rolling contract. In a season delayed due to the COVID-19 pandemic in the United Kingdom, Hull started well but lost 16 of their last 20 games, a run that included an 8–0 hammering at Wigan. On 22 July 2020, Hull were relegated to League One. On 24 April 2021, Hull were promoted back to the Championship at the first time of asking after a 2–1 victory away at Lincoln City. The following week, a 3–1 win at home to Wigan Athletic saw the Tigers crowned EFL League One Champions.", "On 25 January 2022, manager Grant McCann and his assistant Cliff Byrne left the club.", "|align=\"left\"|Grant McCann||||June 2019 – January 2022"]}, {"page": "West Ham United F.C. Under-23s and Academy", "response": ["| Grant McCann || MF || 4 || 0 ||  Hull City (manager) ||  Belfast ||  Northern Ireland || Age 21 vs. Middlesbrough, Premier League, 19 May 2001 || align=\"center\"| Glenn Roeder"]}, {"page": "Darren Moore", "response": ["Moore returned to management during the summer, after agreeing to replace Grant McCann as the manager of League One side Doncaster Rovers. Moore's reign in charge began well, as they maintained a six-game undefeated streak, prior to losing 1–0 against Blackpool."]}]}}