{"wiki_id": "http://www.wikidata.org/entity/Q271935", "itemLabel": "Tom Clarke", "itemDescription": "British politician (born 1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Clarke_(politician)", "wikipedia_page": {"main": "Sir Thomas Clarke,  (born 10 January 1941) is a British Labour Party politician who was a Member of Parliament (MP) from 1982 until 2015, representing Coatbridge, Chryston and Bellshill from 2005 until losing his seat to Philip Boswell of the SNP in the May 2015 general election.", "link_mentions": [{"page": "January 10", "response": ["*1941 – Tom Clarke, Scottish politician, Shadow Secretary of State for Scotland"]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Tom Clarke", "| Tom Clarke"]}, {"page": "List of current members of the British Privy Council", "response": ["| Tom Clarke"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Tom Clarke"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Tom Clarke"]}, {"page": "Michael Connarty", "response": ["Following the 1997 general election he became the Parliamentary Private Secretary to the Minister of Film and Tourism Tom Clarke but this appointment lasted only until 1998 when Clarke was sacked from the government. Connarty spent his parliamentary career as a backbencher. In 1998, he became a member of the European Scrutiny Select committee, which is the committee responsible for scrutinising the legislation set by the European Parliament. He was appointed as the Chair of the Committee from 2006–10. In 2002, Connarty was one of three MPs behind the revival of the Tribune Group of left-wing Labour MPs."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Tom Clarke"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Tom Clarke"]}, {"page": "List of United Kingdom MPs: C", "response": ["* Tom Clarke (1982–present)"]}, {"page": "Thomas Clarke", "response": ["Thomas or Tom Clarke may refer to:", "* Tom Clarke (politician) (born 1941), British Member of Parliament 1982–2015", "* Tom Clarke (Irish republican) (1858-1916)", "* Tom Clarke (musician) (born 1986), lead singer of the Enemy", "* Tom Clarke (Australian footballer) (1906–1981), Australian rules footballer who played for Essendon", "* Tom Clarke (footballer, born 1987), currently with Fleetwood Town", "* Tom Clarke (Irish republican) (1857–1916), revolutionary leader involved in the 1916 Easter Rising", "* Tom Clarke (writer) (1918–1993), British television writer", "* Tom Clarke (Taken), a fictional character in the TV series Taken played by Ryan Hurst"]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*Tom Clarke (b. 1941)"]}, {"page": "Brian Rix", "response": ["Amongst his many activities, he was the co-chairman (with Tom Clarke ) of the All Party Parliamentary Group on Learning Disability; chairman of the Rix Thompson Rothenberg (RTR) Foundation which provides small grants for projects serving people with a learning disability; and president of the grant making Normansfield and Richmond Foundation. He was also a constant supporter of the Rix Centre at the University of East London, which develops and disseminates tools and training for multi-media advocacy to enhance the lives of people with a learning disability. Rix also served as the first chairman of the Arts Council Monitoring Committee on Arts and Disability as well as founding and chairing the charity Libertas (working alongside Sir John Cox and Rix's son, Jonathan) which produced dozens of audio guides for disabled people at museums, historical buildings and other places of interest. Subsequent legislation in which he played an important role made this charity redundant."]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Coatbridge, Chryston and Bellshill || Tom Clarke || Labour || (boundary changes) || Labour"]}, {"page": "Coatbridge, Chryston and Bellshill (UK Parliament constituency)", "response": ["Tom Clarke of the Scottish Labour held this seat from its creation in 2005, having previously represented the predecessor constituencies of Monklands West and Coatbridge & Chryston since 1982. Clarke lost his seat to Phil Boswell of the Scottish National Party in 2015 with Boswell then losing his seat two years later to Hugh Gaffney of the Labour Party. In 2019 the SNP regained the seat with Steven Bonnar winning over Hugh Gaffney with a majority of 5,642 votes.", "| Tom Clarke"]}, {"page": "Tom Clarke (Labour Politician)", "response": ["#REDIRECT Tom Clarke (politician)"]}, {"page": "Coatbridge and Chryston (UK Parliament constituency)", "response": ["| Tom Clarke"]}, {"page": "The Rex, Berkhamsted", "response": ["A local campaign group, Friends of the Rex, was formed in 1997 with the aim of saving the Rex from demolition and acquiring it for use as a film centre, with film critic Barry Norman as their honorary president. The campaign was supported by the Twentieth Century Society, Joan Bakewell, and actors Hugh Grant, Hayley Mills and Ian Richardson. Campaigners formed the Rex Film and Arts Centre Trust to put forward a number of commercial proposals for a leisure complex including cinema screens, a swimming pool and a pub. The dilapidated state of the Rex was discussed in the House of Commons; Tom Clarke of the Department for Culture, Media and Sport declined to offer government subsidy for restoring the Rex, and the local MP Richard Page took the view that the Rex was now an eyesore and should be de-listed and demolished to make way for sheltered housing."]}, {"page": "Coatbridge and Airdrie (UK Parliament constituency)", "response": ["| Tom Clarke"]}, {"page": "Monklands West (UK Parliament constituency)", "response": ["| Tom Clarke"]}, {"page": "1994 Labour Party leadership election", "response": ["| Tom Clarke || Blair || Beckett"]}, {"page": "Lewis Macdonald", "response": ["thumb|Official parliamentary portrait, 2011|leftMacdonald unsuccessfully contested the Moray UK Parliament constituency at the 1997 general election. Prior to his election as an MSP, he worked as a parliamentary researcher to the MPs Frank Doran and Tom Clarke. After being elected in the 1999 Scottish Parliament election, Macdonald joined the Scottish Executive in March 2001. He was briefly Deputy Minister for Transport and Planning from March to November 2001. He then served as Deputy Minister for Enterprise, Transport and Lifelong Learning, later renamed Deputy Minister for Enterprise and Lifelong Learning, from 2001 to 2004. He served as Deputy Minister for Environment and Rural Development from 2004 to 2005 and Deputy Minister for Health and Community Care from 2005 to 2007."]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Tom Clarke, Coatbridge and Airdrie, 1982–83; Monklands West, 1983–97; Coatbridge and Chryston, 1997–2005; Coatbridge, Chryston and Bellshill, 2005–2015"]}, {"page": "James Dempsey (Scottish politician)", "response": ["Dempsey was Member of Parliament for Coatbridge and Airdrie from 1959 until his death in 1982. His maiden speech, on 28 October 1959, was on the subject of unemployment. His final appearance was asking a question about the Christmas payments for pensioners, on 18 January 1982.  He died in office in 1982, aged 65. His successor in the resulting by-election was Tom Clarke."]}, {"page": "1994 Monklands East by-election", "response": ["Both Liddell and Ullrich wished to avoid focusing on the allegations.  Liddell initially supported the council, but towards the end of the campaign, she became critical of it.  Her criticisms were strongly opposed by Tom Clarke, Labour MP for Monklands West and former Provost of Monklands Council."]}, {"page": "Monklandsgate", "response": ["Accusations included: £21m spent on capital projects in Coatbridge while only £2m was spent in Airdrie; councillors handing out green job application forms while the job centre handed out white ones; and also accusations of nepotism as dozens of council workers were related to Labour councillors. The accusations were of increased interest to the media as the Monklands West MP was Tom Clarke, former Monklands District Provost and one time Shadow Secretary of State for Scotland, while the Monklands East MP was the Labour leader, John Smith. The allegations of sectarianism were never proven, however allegations of nepotism were found to be true."]}, {"page": "Equality Act (Sexual Orientation) Regulations 2007", "response": ["In the House of Commons, the regulations  were adopted by 309 votes to 99.The Public Whip division analysis, 19 March 2007  The dissenters were mostly Conservative MPs, although twenty-nine Tories did support the measures (Desmond Swayne, James Duddridge, David Cameron, George Osborne, Crispin Blunt, Andrew Tyrie, Andrew Mackay, Nick Herbert, Hugo Swire, Francis Maude, Oliver Letwin, Patrick McLoughlin, Chris Grayling, Michael Gove, Andrew Mitchell, Alan Duncan, Michael Fabricant, Theresa Villiers, Graham Stuart, Andrew Lansley, Bill Wiggin, Peter Ainsworth, Robert Key, Tony Baldry, David Willetts, Nigel Evans, Jeremy Hunt, John Bercow and Eleanor Laing). However ten Labour Members (Joe Benton, Tom Clarke, Frank Cook, Jim Dobbin, David Drew, Peter Kilfoyle, Jim McGovern, Alan Meale, Geraldine Smith and David Taylor) voted against, along with four Liberal Democrats (Alan Beith, Colin Breed, Tim Farron and Bob Russell)."]}, {"page": "Tom Clarke (Labour politician)", "response": ["#REDIRECT Tom Clarke (politician)"]}, {"page": "United Kingdom general election records", "response": ["|Tom Clarke"]}, {"page": "1994 Labour Party deputy leadership election", "response": ["| Tom Clarke || Tony Blair || Margaret Beckett"]}, {"page": "List of MPs for constituencies in Scotland (2005–2010)", "response": ["|Tom Clarke"]}, {"page": "List of people with chronic fatigue syndrome", "response": ["|Tom Clarke"]}, {"page": "1982 Coatbridge and Airdrie by-election", "response": ["1. Representing the Labour Party was Tom Clarke, born in Coatbridge on 10 January 1941."]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| Coatbridge, Chryston and Bellshill||style=\"background-color: \"| ||Labour||style=\"background-color: \"| ||Tom Clarke (L)||Seat held"]}]}}