{"wiki_id": "http://www.wikidata.org/entity/Q2719909", "itemLabel": "Jemma Redgrave", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Jemma_Redgrave", "wikipedia_page": {"main": "Jemima Rebecca Redgrave (born 14 January 1965), known as Jemma Redgrave, is a fourth-generation British actress of the Redgrave family. She played the title character in four series of Bramwell, and has a recurring role in Doctor Who as Kate Stewart, Head of Scientific Research at UNIT. As well as a career in television, she has appeared in many onstage productions and on film, including her portrayal of Evie Wilcox in the BAFTA-award-winning Merchant Ivory adaptation of Howards End.\n\n", "link_mentions": [{"page": "Vanessa Redgrave", "response": ["A member of the Redgrave family of actors, she is the daughter of Sir Michael Redgrave and Lady Redgrave, the sister of Lynn Redgrave and Corin Redgrave, the wife of Italian actor Franco Nero, the mother of actresses Joely Richardson and Natasha Richardson and of screenwriter and director Carlo Gabriel Nero, the aunt of British actress Jemma Redgrave, the mother-in-law of actor Liam Neeson and film producer Tim Bevan, and the grandmother of Daisy Bevan and Micheál and Daniel Neeson."]}, {"page": "Howards End (film)", "response": ["* Jemma Redgrave as Evie Wilcox", "Anthony Hopkins accepted the part of Henry Wilcox after reading the script, passed to him by a young woman who was helping edit Slaves of New York and The Silence of the Lambs simultaneously in the same building. Phoebe Nicholls, Joely Richardson, Miranda Richardson, and Tilda Swinton were all considered for the part of Margaret Schlegel before Emma Thompson accepted the role. James Ivory was unaware of Emma Thompson before she was recommended to him by Simon Callow, who made a small cameo as the music lecturer in the concert scene. Jemma Redgrave (Evie Wilcox), who played the daughter of Vanessa Redgrave's character (Ruth Wilcox), is her niece off-screen. Samuel West, who played Leonard Bast, is the son of Prunella Scales, who played Aunt Juley."]}, {"page": "Michael Redgrave", "response": ["Redgrave was married to the actress Rachel Kempson for 50 years from 1935 until his death. Their children Vanessa (b. 1937), Corin (1939–2010) and Lynn Redgrave (1943–2010), and their grandchildren: Natasha Richardson (1963–2009), Joely Richardson (b. 1965) and Jemma Redgrave (b. 1965) are also involved in theatre or film as actors. Their grandson Carlo Gabriel Nero is a screenwriter and film director; only Luke Redgrave has taken a path outside the theatre."]}, {"page": "1965 in television", "response": ["| Jemma Redgrave"]}, {"page": "1988 in film", "response": ["*Dream Demon, directed by Harley Cokeliss, starring Jemma Redgrave – (U.K.)"]}, {"page": "1992 in film", "response": ["| Howards End || Sony Pictures Classics || James Ivory (director); Ruth Prawer Jhabvala (screenplay); Anthony Hopkins, Vanessa Redgrave, Helena Bonham Carter, Emma Thompson, James Wilby, Samuel West, Jemma Redgrave, Prunella Scales, Joseph Bennett, Adrian Ross Magenty, Jo Kendall, Ian Latimer, Simon Callow, Mary Nash, Siegbert Prawer, Susie Lindeman, Nicola Duffett, Mark Payton, Barbara Hicks, Peter Cellier, Crispin Bonham-Carter, Patricia Lawrence, Margery Mason, Peter Darling, Mark Tandy, Anne Lambton, Allie Byrne, Sally Geoghegan  || Period, Drama || Live action"]}, {"page": "1991 in literature", "response": ["*February – Sisters Vanessa Redgrave (Olga) and Lynn Redgrave (Masha) make their first and only joint appearance on stage, with niece Jemma Redgrave as Irina, in the title rôles of Chekhov's Three Sisters at the Queen's Theatre, London."]}, {"page": "Lynn Redgrave", "response": ["Redgrave was born in Marylebone, London, to actors Sir Michael Redgrave and Rachel Kempson. Her sister is actress Vanessa Redgrave; her brother was actor and political activist Corin Redgrave. She was the aunt of writer/director Carlo Gabriel Nero and of actresses Joely Richardson, Jemma Redgrave and Natasha Richardson, and the sister-in-law of director Tony Richardson, actress Kika Markham and Italian actor Franco Nero. Her grandfather was silent screen leading man Roy Redgrave."]}, {"page": "List of Doctor Who supporting characters", "response": ["*Kate Stewart [née Lethbridge-Stewart] (Beverley Cressman, Jemma Redgrave)"]}, {"page": "Big Finish Productions", "response": ["Destiny of the Doctor, produced in conjunction with AudioGO, who were rights holders to the 2005–present series, marked the first time Big Finish produced storylines featuring the Ninth, Tenth, and Eleventh Doctors to mark the 50th anniversary of the franchise. In February 2015, Big Finish announced that following a licensing deal with BBC Worldwide, they had been permitted to produce an audio series entitled UNIT: Extinction, starring Kate Stewart played by Jemma Redgrave. The debut of the character on audio marks the second time Big Finish have been actively permitted to utilise material introduced in the 2005 revival.", "Other spin-off series include Jago & Litefoot, featuring Henry Gordon Jago (Christopher Benjamin) and Professor George Litefoot (Trevor Baxter), characters from the 1970s storyline The Talons of Weng-Chiang; Counter-Measures, featuring a group of scientists featured in 1988's Remembrance of the Daleks; Vienna, focusing on an assassin named Vienna Salvatori (played by former Star Trek: Deep Space Nine actress Chase Masterson) who was introduced in the Seventh Doctor audio drama The Shadow Heart; UNIT, originally focused around the UNIT during the hiatus years of Doctor Who, starring the Seventh Doctor (Sylvester McCoy) and Elizabeth Klein (Tracey Childs, who first appeared in Colditz) and later became focused on UNIT from the revived series, featuring Kate Stewart (Jemma Redgrave and Osgood (Ingrid Oliver), as well as guest characters Jo Grant, River Song (Alex Kingston) and Doctor Chin Lee (Pik-Sen Lim, who first appeared in the Ambassadors of Death)."]}, {"page": "Rachel Kempson", "response": ["Kempson married fellow actor Michael Redgrave in 1935, and became the daughter-in-law of Roy Redgrave and Margaret Scudamore. Kempson was the mother of Vanessa (born 1937), Corin (1939–2010) and Lynn Redgrave (1943–2010) and the grandmother of Joely and Natasha Richardson (1963–2009), Jemma Redgrave, Luke Redgrave, Arden Redgrave, Harvey Redgrave, Carlo Gabriel Nero, Benjamin B. Clark, Kelly B. Clark and Annabel Lucy Clark."]}, {"page": "Brigadier Lethbridge-Stewart", "response": ["The 2012 episode \"The Power of Three\" introduced the Brigadier's daughter, new UNIT chief Kate Stewart (Jemma Redgrave). The character was originally created in the unlicensed video spin-off Downtime in 1995, in which the Brigadier also appeared. Kate becomes a recurring character making appearances alongside the Eleventh Doctor (Matt Smith),Twelfth Doctor (Peter Capaldi), and Thirteenth Doctor (Jodie Whittaker)."]}, {"page": "List of show business families", "response": ["** Kika was married to the late Corin Redgrave (see Redgrave family) and is stepmother of actress Jemma Redgrave.", "*** Corin's widow is actress Kika Markham and his daughter is actress Jemma Redgrave."]}, {"page": "Peter Bowles", "response": ["The role of Vic Parkes was Bowles' first, but not last, performance as an East End gangster. After Running Late Sir Peter Hall began to offer Bowles a succession of leading roles in West End theatre, including Terence Rattigan's Separate Tables opposite Patricia Hodge and George Bernard Shaw's Major Barbara with Jemma Redgrave. George S. Kaufman's The Royal Family and Noël Coward's Hay Fever, both opposite Judi Dench at the Theatre Royal Haymarket, followed. In 1996 Bowles played Arnolphe in Molière's The School for Wives at the Piccadilly Theatre."]}, {"page": "Natasha Richardson", "response": ["Richardson was born and raised in Marylebone, London, a member of the Redgrave family, known as a theatrical and film acting dynasty. She was the daughter of director and producer Tony Richardson and actress Vanessa Redgrave, granddaughter of actors Sir Michael Redgrave and Rachel Kempson,Debrett's People of Today. Debrett's Peerage Ltd., 2007 sister of Joely Richardson, half-sister of Carlo Gabriel Nero and Katharine Grimond Hess, niece of actress Lynn Redgrave and actor Corin Redgrave and cousin of Jemma Redgrave."]}, {"page": "Three Sisters (play)", "response": ["* In 1991, sisters Vanessa Redgrave (Olga) and Lynn Redgrave (Masha) made their first and only appearance together onstage in this, with niece Jemma Redgrave as Irina at the Queen's Theatre, London."]}, {"page": "List of fictional doctors", "response": ["|Bramwell || Dr. Eleanor BramwellDr. Robert Bramwell || Jemma RedgraveDavid Calder"]}, {"page": "Joely Richardson", "response": ["Joely Kim Richardson was born in Marylebone, London, to the theatrical Redgrave family, the daughter of actress Vanessa Redgrave and director Tony Richardson, and the granddaughter of actors Sir Michael Redgrave and Rachel Kempson, Lady Redgrave. Actress Natasha Richardson (1963–2009) was her sister and actor Liam Neeson is her brother-in-law.  She is the aunt of Micheál and Daniel Neeson and the niece of actors Lynn Redgrave and Corin Redgrave and cousin of actress Jemma Redgrave, who is five days younger than Richardson."]}, {"page": "The Cherry Orchard", "response": ["A version of the play was performed as the opening production on the Chichester Festival Theatre Stage in May–June 2008, with a cast including Dame Diana Rigg, Frank Finlay, Natalie Cassidy, Jemma Redgrave and Maureen Lipman.Billington, Michael.\"Theatre Review, 'The Cherry Orchard'\"The Guardian, 25 May 2008"]}, {"page": "Redgrave", "response": ["** Jemma Redgrave"]}, {"page": "Bramwell (TV series)", "response": ["Bramwell is a British television series starring Jemma Redgrave as Dr. Eleanor Bramwell, a woman challenging the domination of men in the medical establishment, who runs a free hospital for the poor in the East End of London, during the late Victorian era. The series was produced by Whitby Davison Productions in association with Carlton Television, and was shown on ITV 22 May 1995 to 18 June 1998, in a total of four series.", "* Jemma Redgrave as Dr. Eleanor Bramwell"]}, {"page": "Keith Boak", "response": ["He directed the documentary Running the Bulls and six short films for C4, including These Colours Don't Run (with John Hannah), Fist of the Dragonfly (with Simon Russell Beale and Burt Kwouk), After the Party (with Jemma Redgrave and Morag Hood), Nightclub, The Return of Neville Dead, and The Loser (with Phil Daniels and Sean Bean)."]}, {"page": "Corin Redgrave", "response": ["Redgrave was part of the third generation of a theatrical dynasty spanning four generations. His parents were Sir Michael Redgrave and Rachel Kempson; Vanessa and Lynn Redgrave were his sisters. His first marriage was to Deirdre Deline Hamilton-Hill (1939–1997). They had a daughter, actress Jemma Redgrave, and a son, Luke, a camera operator and production assistant. Redgrave and Hamilton-Hill divorced in 1975. Redgrave and Kika Markham married in 1985 in Wandsworth, London, and remained together until Redgrave's death. The couple had two sons, Harvey (born 1979) and Arden (born 1983)."]}, {"page": "Margaret Scudamore", "response": ["Her grandchildren Corin Redgrave, Lynn Redgrave and Vanessa Redgrave and great-grandchildren Jemma Redgrave, Joely Richardson, Natasha Richardson and Carlo Nero have successfully followed the family tradition into acting."]}, {"page": "Holby City", "response": ["The show began with only eleven main characters in its first series, all of whom have since left the show. New main characters have been both written in and out of the series since, with a core of fifteen to twenty main actors employed on the serial at any given time. In casting the first series, Young sought out actors who were already well known in the television industry, something which has continued throughout the show's history, with cast members including Patsy Kensit, Jane Asher, Robert Powell, Adrian Edmondson, Alex Walkinshaw and Jemma Redgrave."]}, {"page": "London Academy of Music and Dramatic Art", "response": ["* Jemma Redgrave - (Doctor Who, Howards End)"]}, {"page": "Possession (Byatt novel)", "response": ["The novel was also adapted as a radio play, serialised in 15 parts between 19 December 2011 and 6 January 2012, on BBC Radio 4's Woman's Hour. it featured Jemma Redgrave as Maud, Harry Hadden-Paton as Roland, James D'Arcy as Ash and Rachael Stirling as LaMotte."]}, {"page": "Redgrave family", "response": ["*Jemma Redgrave and Tim Owen; 1992 — 2020 (divorced) - two sons, Gabriel and Alfie"]}, {"page": "Kathleen Wilhoite", "response": ["Wilhoite starred in two theatrical productions for New York City's Second Stage Theater in 1987: Division Street and Moonchildren. For her performance in the latter, critic Frank Rich of The New York Times praised her \"frisky comic style\" and likened her to \"Shirley MacLaine in that star's earliest show-biz incarnation.\" This was followed by supporting film roles in Angel Heart (1987), the comedy Crossing Delancey (1988), and a lead role in the British-set horror film Dream Demon (also 1988), opposite Jemma Redgrave. Next, Wilhoite appeared in the Patrick Swayze-starring Road House (1989), Curtis Hanson's neo-noir Bad Influence (1990), and the drama Lorenzo's Oil (1992). She also appeared on television, portraying a resident of the titular town in David Lynch's series Twin Peaks in 1990."]}, {"page": "The Buddha of Suburbia (TV serial)", "response": ["* Jemma Redgrave as Eleanor"]}, {"page": "Downtime (Doctor Who)", "response": ["* Beverley Cressman – Kate Lethbridge-Stewart. The only daughter of Brigadier Lethbridge-Stewart, Kate lives with her only son Gordon James ('Gordy') on a houseboat. Unbeknownst to her, she possesses the last remaining locus in a toy chest, which has taken the form of a wooden yeti carving. Kate is initially resentful of her father, blaming his work for the disintegration of their family, although they make their peace at the story's conclusion. Cressman was, at the time, married to Miles Richardson and became involved in the production when her husband was cast as Captain Cavendish. Despite being a newcomer to the team of already established Doctor Who actors, she quickly became admired by Nicholas Courtney who felt she performed her role 'admirably'. The character of Kate Lethbridge-Stewart would return in another direct-to-video production (2004's Daemos Rising) before becoming a recurring character in later series of the revived Doctor Who (although the role would be recast to Jemma Redgrave). "]}, {"page": "New Series Adventures", "response": ["| 25 || The Memory of Winter || George Mann || Twelfth || Clara Oswald || Jemma Redgrave || 7 April 2016 || "]}, {"page": "Carlo Gabriel Nero", "response": ["The son of actors Franco Nero and Vanessa Redgrave, his maternal half-sisters are actresses Joely Richardson and Natasha Richardson (1963–2009). He is the nephew of actors Corin (1939–2010) and Lynn Redgrave (1943–2010), and cousin to actress Jemma Redgrave. Carlo Nero directed his mother and half-sister Joely in the 2004 film The Fever."]}, {"page": "Godolphin and Latymer School", "response": ["* Jemma Redgrave, actor"]}, {"page": "Lassie (2005 film)", "response": ["* Jemma Redgrave as Daisy"]}, {"page": "The Acid House (film)", "response": ["* \"The Acid House\": An acid trip and a bolt of lightning result in amiable schemie Coco Brice (Ewen Bremner) exchanging bodies with the baby of a middle-class couple (Martin Clunes and Jemma Redgrave).", "*Jemma Redgrave – Jenny"]}, {"page": "I'll Be There (2003 film)", "response": ["*Jemma Redgrave as Rebecca Edmonds"]}, {"page": "The Grid (TV serial)", "response": ["| Jemma Redgrave"]}, {"page": "Mosley (TV serial)", "response": ["* Jemma Redgrave as  Lady Cimmie Curzon"]}, {"page": "Fish (British TV series)", "response": ["Fish is a British television drama series first broadcast on BBC One in 2000. It features Paul McGann as the title character, alongside Jemma Redgrave and Mick Ford. It was created by Stephen Tredre, written by Tredre and Matthew Bardsley, and co-produced by the BBC and Principal Pictures."]}, {"page": "Mansfield Park (2007 film)", "response": ["* Jemma Redgrave as Lady Bertram"]}, {"page": "Thelma Holt", "response": ["* Three Sisters by Anton Chekhov in a new version by Nikolas Simmonds, directed by Robert Sturua, cast included: Vanessa Redgrave, Lynn Redgrave and Jemma Redgrave, presented at the Queen's Theatre"]}]}}