{"wiki_id": "http://www.wikidata.org/entity/Q271867", "itemLabel": "Janet Suzman", "itemDescription": "South Africa actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Janet_Suzman", "wikipedia_page": {"main": "Dame Janet Suzman,  (born 9 February 1939) is a South African-born British actress who enjoyed a successful early career in the Royal Shakespeare Company, later replaying many Shakespearean roles, among others, on TV. In her first film, Nicholas and Alexandra (1971), her performance as Empress Alexandra Feodorovna earned her several honours, including a nomination for the Academy Award for Best Actress.\nSuzman later starred in a wide range of classical and modern drama as well as directing many productions, both in Britain and South Africa. She is a niece of Helen Suzman, South African politician and anti-apartheid campaigner. Suzman herself appeared in a film that looked closely at the apartheid issue, A Dry White Season (1989).", "link_mentions": [{"page": "February 9", "response": ["*  1939   – Janet Suzman, South African-British actress and director"]}, {"page": "List of South Africans", "response": ["*Janet Suzman, actress (born 1939)"]}, {"page": "Alexandra Feodorovna (Alix of Hesse)", "response": ["* A rather romanticised version of Alexandra's life was dramatized in the 1971 movie Nicholas and Alexandra, based on the book by the same title written by Robert Massie, in which the tsaritsa/Empress was played by Janet Suzman."]}, {"page": "Titus Andronicus", "response": ["In 1972, Trevor Nunn directed an RSC production at the Royal Shakespeare Theatre, as part of a presentation of the four Roman plays, starring Colin Blakely as Titus, Margaret Tyzack as Tamora, Calvin Lockhart as Aaron and Janet Suzman as Lavinia. Colin Blakely and John Wood as a vicious and maniacal Saturninus received particularly positive reviews. This production took the realistic approach and did not shirk from the more specific aspects of the violence; for example, Lavinia has trouble walking after the rape, which, it is implied, was anal rape. Nunn believed the play asked profound questions about the sustainability of Elizabethan society, and as such, he linked the play to the contemporary period to ask the same questions of late twentieth-century England; he was \"less concerned with the condition of ancient Rome than with the morality of contemporary life.\"Massai (2001: lxxx) In his program notes, Nunn famously wrote \"Shakespeare's Elizabethan nightmare has become ours.\" He was especially interested in the theory that decadence had led to the collapse of Rome. At the end of 4.2, for example, there was an on-stage orgy, and throughout the play, supporting actors appeared in the backgrounds dancing, eating, drinking and behaving outrageously. Also in this vein, the play opened with a group of people paying homage to a waxwork of an obese emperor reclining on a couch and clutching a bunch of grapes.An overview of the production can be found in Dessen (1989: 35–40)"]}, {"page": "Antony and Cleopatra", "response": ["* 1972, Janet Suzman and Richard Johnson, with Patrick Stewart as Enobarbus in Trevor Nunn's production for the Royal Shakespeare Company"]}, {"page": "Love's Labour's Lost", "response": ["Notable 20th-century British productions included a 1936 staging at the Old Vic featuring Michael Redgrave as Ferdinand and Alec Clunes as Berowne. In 1949, the play was given at the New Theatre with Redgrave in the role of Berowne.Gave, Freda. \"Who's Who in the Theatre (fourteenth edition), Sir Isaac Pitman and Sons, London, 1967 The cast of a 1965 Royal Shakespeare Company production included Glenda Jackson, Janet Suzman and Timothy West. In 1968, the play was staged by Laurence Olivier for the National Theatre, with Derek Jacobi as the Duke and Jeremy Brett as Berowne. The Royal Shakespeare Company produced the play again in 1994.  The critic Michael Billington wrote in his review of the production: \"The more I see Love's Labour's Lost, the more I think it Shakespeare's most beguiling comedy. It both celebrates and satisfies linguistic exuberance, explores the often painful transition from youth to maturity, and reminds us of our common mortality.\""]}, {"page": "Paul Scofield", "response": ["In 2004, a poll of actors of the Royal Shakespeare Company, including Ian McKellen, Donald Sinden, Janet Suzman, Ian Richardson, Antony Sher and Corin Redgrave, acclaimed Scofield's Lear as the greatest Shakespearean performance ever.Scofield's Lear voted the greatest Shakespeare performance. Telegraph.co.uk. 22 August 2004. Scofield appeared in many radio dramas for BBC Radio 4, including in later years plays by Peter Tinniswood: On the Train to Chemnitz (2001) and Anton in Eastbourne (2002). The latter was Tinniswood's last work and was written especially for Scofield, an admirer of Anton Chekhov. He was awarded the 2002 Sam Wanamaker Prize."]}, {"page": "Nicholas and Alexandra", "response": ["Nicholas and Alexandra is a 1971 British epic historical drama film directed by Franklin J. Schaffner, from a screenplay written by James Goldman and Edward Bond, based on Robert K. Massie's 1967 book of the same name, which is a partial account of the last ruling Russian monarch, Tsar Nicholas II of Russia, and his wife, Tsarina Alexandra. It stars Michael Jayston and Janet Suzman in the titular roles.", "*Janet Suzman as Alexandra, his wife, the Tsarina", "* The film was nominated for Best Picture (Sam Spiegel), Best Actress (Janet Suzman), Best Cinematography (Freddie Young), and Best Music, Original Dramatic Score (Richard Rodney Bennett).", "* Janet Suzman was nominated for Most Promising Newcomer to Leading Film Roles.", "* Janet Suzman was nominated for New Star of the Year – Actress."]}, {"page": "Florence Nightingale", "response": ["* Janet Suzman in the British theatre-style biopic Miss Nightingale (1974)"]}, {"page": "Timothy West", "response": ["West played repertory seasons in Newquay, Hull, Northampton, Worthing and Salisbury before making his London debut at the Piccadilly Theatre in 1959 in the farce Caught Napping. He was a member of the Royal Shakespeare Company for three seasons: the 1962 Arts Theatre Experimental season (Nil Carborundum and Afore Night Come), the 1964 'Dirty Plays' season (Victor, the premiere production of Marat/Sade and the revival of Afore Night Come) and the 1965 season at Stratford and later at the Aldwych Theatre appearing in The Comedy of Errors, Timon of Athens, The Jew of Malta, Love's Labour's Lost and Peter Hall's production of The Government Inspector, in a company which included Paul Scofield, Eric Porter, Janet Suzman, Paul Rogers, Ian Richardson, Glenda Jackson and Peter McEnery.A Moment Towards the End of the Play, p 88", "* Death of a Salesman, as Willy Loman, Dir Janet Suzman, Theatr Clwyd, 1993"]}, {"page": "Royal Shakespeare Company", "response": ["* The Wars of the Roses, adaptation of the Henry VI and Richard III plays, directed by Sir Peter Hall and starring Ian Holm as Richard III, David Warner as Henry VI, Peggy Ashcroft as Margaret of Anjou, Donald Sinden as the Duke of York, Paul Hardwick as the Duke of Gloucester, Janet Suzman as Joan of Arc, Brewster Mason as the Earl of Warwick, Roy Dotrice as Edward IV. (1963)", "* Antony and Cleopatra directed by Trevor Nunn starring Janet Suzman (1973)"]}, {"page": "Nuns on the Run", "response": ["Nuns on the Run is a 1990 British comedy film starring Eric Idle and Robbie Coltrane, also featuring Camille Coduri and Janet Suzman. The film was written and directed by Jonathan Lynn and produced by HandMade Films. Many of the outdoor scenes were shot in Chiswick, White City and Kings Cross. The soundtrack was composed and performed by Yello and also features George Harrison's song \"Blow Away\" in addition to Steve Winwood’s \"Roll With It\". The film was released on 16 March 1990.", "* Janet Suzman as Sister Liz, the Sister Superior of the nunnery"]}, {"page": "1939 in television", "response": ["*February 9 – Janet Suzman, actress"]}, {"page": "1990 in film", "response": ["| Nuns on the Run || 20th Century Fox || Jonathan Lynn (director/screenplay); Eric Idle, Robbie Coltrane, Camille Coduri, Janet Suzman, Robert Patterson, Doris Hare, Lila Kaye, Tom Hickey, Robert Morgan, Winston Dennis, Gary Tang, David Forman, Ozzie Yue || Comedy || Live action"]}, {"page": "1989 in film", "response": ["| A Dry White Season || MGM/UA || Euzhan Palcy (director/screenplay); Colin Welland (screenplay); Donald Sutherland, Janet Suzman, Jürgen Prochnow, Zakes Mokae, Susan Sarandon, Marlon Brando, Susannah Harker, Leonard Maguire, Winston Ntshona, Michael Gambon, John Kani, Gerard Thoolen, David de Keyser, Rowen Elmes, Thoko Ntshinga, Bekhithemba Mpofu || Drama || Live action ", "* A Dry White Season, directed by Euzhan Palcy, starring Donald Sutherland, Janet Suzman, Susan Sarandon and Marlon Brando"]}, {"page": "1982 in film", "response": ["* The Draughtsman's Contract, directed by Peter Greenaway, starring Anthony Higgins and Janet Suzman – (U.K.)", "| The Draughtsman's Contract || Curzon Artificial Eye / British Film Institute / Channel 4 || Peter Greenaway (director/screenplay); Anthony Higgins, Janet Suzman, Dave Hill, Anne-Louise Lambert, Hugh Fraser, Neil Cunningham, David Meyer, Tony Meyer, Nicholas Amer, Suzan Crowley, Lynda La Plante, Michael Feast, David Gant, Alastair Cumming, Steve Ubels || Comedy, Drama, History || Live action"]}, {"page": "1981 in film", "response": ["*Priest of Love, starring Ian McKellen, Janet Suzman, Ava Gardner – (UK)"]}, {"page": "1980 in film", "response": ["| Nijinsky || Paramount Pictures / Hera Productions || Herbert Ross (director); Hugh Wheeler, Romola Nijinsky, Vaslav Nijinsky (screenplay); Alan Bates, Leslie Browne, George de la Peña, Alan Badel, Colin Blakely, Carla Fracci, Ronald Pickup, Vernon Dobtcheff, Frederick Jaeger, Janet Suzman, Siân Phillips, Ronald Lacey, Jeremy Irons, Anton Dolin, Hetty Baynes || Biography || Live action"]}, {"page": "1974 in film", "response": ["*The Black Windmill, starring Michael Caine and Janet Suzman – (U.K.)"]}, {"page": "1971 in film", "response": ["*Nicholas and Alexandra, directed by Franklin J. Schaffner, starring Michael Jayston, Janet Suzman, Laurence Olivier, Jack Hawkins - (U.K.)"]}, {"page": "1939 in film", "response": ["*February 9 – Janet Suzman, South African actress and director"]}, {"page": "University Challenge", "response": ["|Actors (Robert Powell, Samuel West, Janet Suzman, Martin Jarvis)"]}, {"page": "Henry VI, Part 1", "response": ["The production usually credited with establishing the reputation of the play in the modern theatre is John Barton and Peter Hall's 1963/1964 RSC production of the tetralogy, adapted into a three-part series, under the general title The Wars of the Roses, at the Royal Shakespeare Theatre. The first play (entitled simply Henry VI) featured a much shortened version of 1 Henry VI and half of 2 Henry VI (up to the death of Beaufort). The second play (entitled Edward IV) featured the second half of 2 Henry VI and a shortened version of 3 Henry VI, which was followed by a shortened version of Richard III as the third play. In all, 1,450 lines written by Barton were added to 6,000 lines of original Shakespearean material, with a total of 12,350 lines removed.Taylor (2003: 33) The production starred David Warner as Henry, Peggy Ashcroft as Margaret, Derek Smith (later replaced by Clive Swift) as Talbot and Janet Suzman as Joan. Barton and Hall were both especially concerned that the plays reflect the contemporary political environment, with the civil chaos and breakdown of society depicted in the plays mirrored in the contemporary milieu, by events such as the building of the Berlin Wall in 1961, the Cuban Missile Crisis in 1962 and the assassination of John F. Kennedy in 1963. Hall allowed these events to reflect themselves in the production, arguing that \"we live among war, race riots, revolutions, assassinations, and the imminent threat of extinction. The theatre is, therefore, examining fundamentals in staging the Henry VI plays.\"Goodwin (1964: 47) They were also influenced by politically focused literary theory of the time; both had attended the 1956 London visit of Bertolt Brecht's Berliner Ensemble, both were subscribers to Antonin Artaud's theory of \"Theatre of Cruelty\", and Hall had read an English translation of Jan Kott's influential Shakespeare Our Contemporary in 1964 prior to its publication in Britain. Both Barton and Hall were also supporters of E. M. W. Tillyard's 1944 book Shakespeare's History Plays, which was still a hugely influential text in Shakespearian scholarship, especially in terms of its argument that Shakespeare in the tetralogy was advancing the Tudor myth.Ronald Knowles, King Henry VI, Part 2 (London: Arden, 1999), 12–13"]}, {"page": "Hedda Gabler", "response": ["Many prominent actresses have played the role of Hedda: Vera Komissarzhevskaya, Eleonora Duse, Alla Nazimova, Asta Nielsen, Johanne Louise Schmidt, Mrs. Patrick Campbell, Eva Le Gallienne, Elizabeth Robins, Anne Meacham, Ingrid Bergman, Peggy Ashcroft, Fenella Fielding, Jill Bennett, Janet Suzman, Diana Rigg, Isabelle Huppert, Claire Bloom, June Brown, Kate Burton, Geraldine James, Kate Mulgrew, Kelly McGillis, Fiona Shaw, Maggie Smith, Jane Fonda, Annette Bening, Amanda Donohoe, Judy Davis, Emmanuelle Seigner, Mary-Louise Parker, Harriet Walter, Rosamund Pike and Cate Blanchett. ", "The play has been adapted for the screen several times, from the silent film era onwards, in several languages. The BBC screened a television production of the play in 1962, with Ingrid Bergman, Michael Redgrave, Ralph Richardson, and Trevor Howard, while the Corporation's Play of the Month in 1972 featured Janet Suzman and Ian McKellen in the two main leads. A version shown on Britain's commercial ITV network in 1980 featured Diana Rigg in the title role. Glenda Jackson was nominated for an Academy Award as leading actress for her role in the British film adaptation Hedda (1975) directed by Trevor Nunn. A version was produced for Australian television in 1961."]}, {"page": "BBC Television Shakespeare", "response": ["The Prefaces to Shakespeare episode for As You Like It was presented by Janet Suzman, who had played Rosalind in a 1967 RSC production directed by George Rylands. The Shakespeare in Perspective episode was presented by novelist Brigid Brophy."]}, {"page": "Trevor Nunn", "response": ["His first wife, Janet Suzman, appeared in many of his productions, such as the 1974 televised version of his Antony and Cleopatra. Nunn directed the RSC production of Macbeth starring Ian McKellen in the title role and Dame Judi Dench as Lady Macbeth in 1976.\"'Macbeth', 1976, Production Listing\" calm.shakespeare.org.uk, accessed 16 November 2011 Nunn staged the action of the drama with not only the paying audience, but also the audience of all of the actors in the production not in the ongoing scene—they sat on wooden crates just beyond the main playing space.Rowe, Katherine.\"'Macbeth', Trevor Nunn\" Macbeth: Evans Shakespeare Editions (2011), Cengage Learning, , pp. 59–60", "Nunn has been married three times and has five children. He was married to actress Janet Suzman from 17 October 1969 until their divorce in 1986. They have one son, Joshua.(no author). \"Divorce for Janet Suzman\", The Times (London), 19 April 1986\"Janet Suzman Biography-see Companions and Family\" tcm.com, accessed 20 April 2012 From 1986 until their 1991 divorce, he was married to Sharon Lee-Hill, with whom he has two children, Laurie and Amy.(no author). \"Nunn divorce\", The Times, 21 May 1991, Home newsDickson, Andrew. \"Trevor Nunn Life in Theatre\" The Guardian, 18 November 2011"]}, {"page": "Kim Cattrall", "response": ["Cattrall played Cleopatra in a production of Antony and Cleopatra, directed by Janet Suzman, opposite Jeffery Kissoon as Anthony, in Liverpool at the Playhouse in October 2010, with a subsequent revival at Chichester Festival Theatre (with Michael Pennington as Anthony) in September 2012. In 2010, Cattrall was named an Honorary Fellow of Liverpool John Moores University in recognition of her contributions to the dramatic arts. In 2011, Cattrall reprised her role as Amanda in a production of Noël Coward's Private Lives opposite Canadian actor Paul Gross in Toronto and on Broadway.   The New York Times theatre critic raved about Cattrall's performance and she received a Drama League Award nomination.  That year, Cattrall also appeared in Uptown Downstairs Abbey, the Comic Relief parody of the critically acclaimed historical television dramas Downton Abbey and Upstairs, Downstairs. Playing Lady Grantham, she starred alongside Jennifer Saunders, Joanna Lumley, Victoria Wood, Harry Enfield, Patrick Barlow, Dale Winton, Olivia Colman, Tim Vine, Simon Callow, Michael Gambon and Harry Hill."]}, {"page": "Shakespearean history", "response": ["# for the 1965 UK serial The Wars of the Roses, based on the RSC's 1964 staging of the Second Tetralogy, which condensed the Henry VI plays into two plays called Henry VI and Edward IV. adapted by John Barton and Peter Hall; and directed by Hall. Featuring Ian Holm as Richard III, David Warner as Henry VI, Peggy Ashcroft as Margaret, Donald Sinden as York, Roy Dotrice as Edward and Jack Cade, Janet Suzman as Joan and Lady Anne and William Squire as Buckingham and Suffolk."]}, {"page": "Helen Suzman", "response": ["* Janet Suzman, her niece and South African actress and director"]}, {"page": "Les Dennis", "response": ["Dennis' stage work includes Amos Hart in Chicago and Bill Snibson in Me and My Girl in the West End. He has starred in Skylight at the Water Mill Theatre in Newbury, Mr Wonderful at the Gateway Theatre in Chester, and Misery at the Coliseum Theatre in Oldham. He also appeared in Just Between Ourselves and co-starred alongside Janet Suzman in Cherished Disappointments in Love at London's Soho Theatre. He co-starred with Christopher Cazenove and John Duttine in a national tour of 'Art' and as Norman Bartholomew in Anthony Shaffer's dark comedy Murderer at London's Menier Chocolate Factory. He later starred in a hit season of Neville's Island at the Birmingham Repertory Theatre."]}]}}