{"wiki_id": "http://www.wikidata.org/entity/Q272224", "itemLabel": "Norman Angell", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Angell", "wikipedia_page": {"main": "Sir Ralph Norman Angell (26 December 1872 – 7 October 1967) was an English Nobel Peace Prize winner. He was a lecturer, journalist, author and Member of Parliament for the Labour Party.\nAngell was one of the principal founders of the Union of Democratic Control. He served on the Council of the Royal Institute of International Affairs, was an executive for the World Committee against War and Fascism, a member of the executive committee of the League of Nations Union, and the president of the Abyssinia Association. He was made a Knight Bachelor in 1931 and awarded the Nobel Peace Prize in 1933.", "link_mentions": [{"page": "Classical liberalism", "response": ["Several liberals, including Smith and Cobden, argued that the free exchange of goods between nations could lead to world peace. Erik Gartzke states: \"Scholars like Montesquieu, Adam Smith, Richard Cobden, Norman Angell, and Richard Rosecrance have long speculated that free markets have the potential to free states from the looming prospect of recurrent warfare\".Erik Gartzke, \"Economic Freedom and Peace,\" in Economic Freedom of the World: 2005 Annual Report (Vancouver: Fraser Institute, 2005). American political scientists John R. Oneal and Bruce M. Russett, well known for their work on the democratic peace theory, state: ", "Cobden believed that military expenditures worsened the welfare of the state and benefited a small, but concentrated elite minority, summing up British imperialism, which he believed was the result of the economic restrictions of mercantilist policies. To Cobden and many classical liberals, those who advocated peace must also advocate free markets. The belief that free trade would promote peace was widely shared by English liberals of the 19th and early 20th century, leading the economist John Maynard Keynes (1883–1946), who was a classical liberal in his early life, to say that this was a doctrine on which he was \"brought up\" and which he held unquestioned only until the 1920s.Donald Markwell, John Maynard Keynes and International Relations: Economic Paths to War and Peace, Oxford University Press, 2006, ch. 1. In his review of a book on Keynes, Michael S. Lawlor argues that it may be in large part due to Keynes' contributions in economics and politics, as in the implementation of the Marshall Plan and the way economies have been managed since his work, \"that we have the luxury of not facing his unpalatable choice between free trade and full employment\".John Maynard Keynes and International Relations: Economic Paths to War and Peace  Donald Markwell (2006), reviewed by M S Lawlor (February 2008). A related manifestation of this idea was the argument of Norman Angell (1872–1967), most famously before World War I in The Great Illusion (1909), that the interdependence of the economies of the major powers was now so great that war between them was futile and irrational; and therefore unlikely."]}, {"page": "December 26", "response": ["*1872 – Norman Angell, English journalist, academic, and politician, Nobel Prize laureate (d. 1967)"]}, {"page": "Herbert A. Simon", "response": ["Simon attended Milwaukee Public Schools, where he developed an interest in science and established himself as an atheist. While attending middle school, Simon wrote a letter to \"the editor of the Milwaukee Journal defending the civil liberties of atheists\". Unlike most children, Simon's family introduced him to the idea that human behavior could be studied scientifically; his mother's younger brother, Harold Merkel (1892-1922), who studied economics at the University of Wisconsin–Madison under John R. Commons, became one of his earliest influences. Through Harold's books on economics and psychology, Simon discovered social science. Among his earliest influences, Simon cited Norman Angell for his book The Great Illusion and Henry George for his book Progress and Poverty. While attending high school, Simon joined the debate team, where he argued \"from conviction, rather than cussedness\" in favor of George's single tax.Velupillai, Kumaraswamy. Computable Economics: The Arne Ryde Memorial Lectures. New York: Oxford University Press, 2000."]}, {"page": "Imperialism", "response": ["Historians and political theorists have long debated the correlation between capitalism, class and imperialism. Much of the debate was pioneered by such theorists as J. A. Hobson (1858–1940), Joseph Schumpeter (1883–1950), Thorstein Veblen (1857–1929), and Norman Angell (1872–1967). While these non-Marxist writers were at their most prolific before World War I, they remained active in the interwar years. Their combined work informed the study of imperialism and its impact on Europe, as well as contributing to reflections on the rise of the military-political complex in the United States from the 1950s. Hobson argued that domestic social reforms could cure the international disease of imperialism by removing its economic foundation. Hobson theorized that state intervention through taxation could boost broader consumption, create wealth, and encourage a peaceful, tolerant, multipolar world order."]}, {"page": "List of agnostics", "response": ["* Norman Angell (1872–1967): English lecturer, journalist, author, and politician; member of parliament for the Labour Party in England; awarded the Nobel Peace Prize in 1933\"However, by the time he composed his memoirs Angell had come to realize how inappropriate it had been for 'an agnostic, a heretic, a revolutionary' like himself 'to preach his heretical and revolutionary doctrines' to a readership that was not only 'bourgeois' but 'churchy'.\" Martin Ceadel, Living the great illusion: Sir Norman Angell, 1872–1967 (2009), p. 38."]}, {"page": "October 7", "response": ["*1967 – Norman Angell, English journalist and politician, Nobel Prize laureate (b. 1872)"]}, {"page": "Peace", "response": ["It was a central tenet of classical liberalism, for example among English liberal thinkers of the late 19th and early 20th century, that free trade promoted peace. For example, the Cambridge economist John Maynard Keynes (1883–1946) said that he was \"brought up\" on this idea and held it unquestioned until at least the 1920s.Quoted from Donald Markwell, John Maynard Keynes and International Relations: Economic Paths to War and Peace. Oxford: Oxford University Press, 2006, chapter 2. During the economic globalization in the decades leading up to World War I, writers such as Norman Angell argued that the growth of economic interdependence between the great powers made war between them futile and therefore unlikely. He made this argument in 1913. A year later Europe's economically interconnected states were embroiled in what would later become known as the First World War.", "*Sir Norman Angell. The Great Illusion. 1909"]}, {"page": "1967", "response": ["* October 7 – Sir Norman Angell, British politician, recipient of the Nobel Peace Prize (b. 1872)"]}, {"page": "1872", "response": ["* December 26 – Norman Angell, English politician, recipient of the Nobel Peace Prize (d. 1967)"]}, {"page": "1933", "response": ["* Peace – Sir Norman Angell (Ralph Lane)"]}, {"page": "La Grande Illusion", "response": ["La Grande Illusion (also known as The Grand Illusion) is a 1937 French war film directed by Jean Renoir, who co-wrote the screenplay with Charles Spaak. The story concerns class relationships among a small group of French officers who are prisoners of war during World War I and are plotting an escape. The title of the film comes from the 1909 book The Great Illusion by British journalist Norman Angell, which argued that war is futile because of the common economic interests of all European nations. The perspective of the film is generously humanistic to its characters of various nationalities."]}]}}