{"wiki_id": "http://www.wikidata.org/entity/Q272748", "itemLabel": "Joy Chant", "itemDescription": "English writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Joy_Chant", "wikipedia_page": {"main": "Joy Chant (born 13 January 1945) is a British fantasy writer. She is best known for the three House of Kendreth novels, published 1970 to 1983. Her legal name is Eileen Joyce Rutter.", "link_mentions": [{"page": "Joanna Russ", "response": ["Russ's reviewing style was characterized by logic. She was attacked by readers because of her harsh reviews of Stephen R. Donaldson's Lord Foul's Bane (1977) and Joy Chant's The Grey Mane of Morning (1977).The Magazine of Fantasy and Science Fiction, february 1979 She organized attacks into these seven categories, taken directly from the cited article:"]}, {"page": "List of fantasy authors", "response": ["* Joy Chant, (born 1945) author of Red Moon and Black Mountain"]}, {"page": "Lin Carter", "response": ["His greatest influence in the field may have been as an editor for Ballantine Books from 1969 to 1974, when Carter brought several then obscure yet important books of fantasy back into print under the \"Adult Fantasy\" line. Authors whose works he revived included Dunsany, Morris, Smith, James Branch Cabell, Hope Mirrlees, and Evangeline Walton. David G. Hartwell praised the series, saying it brought \"into mass editions nearly all the adult fantasy stories and novels worth reading.\"\"The Making of the American Fantasy Genre\", in The Secret History of Fantasy, Peter S. Beagle (ed), Tachyon Publications 2010.  He also helped new authors break into the field, such as Katherine Kurtz, Joy Chant, and Sanders Anne Laubenthal."]}, {"page": "Mythopoeic Awards", "response": ["|Joy Chant*", "|Joy Chant", "|Joy Chant*", "|Joy Chant"]}, {"page": "Betty Ballantine", "response": ["Ian and Betty Ballantine won one special World Fantasy Award for professional work in 1975 and another one shared with Joy Chant and other creators of The High Kings (Bantam, 1983), a reference book on the Matter of Britain that incorporates retellings. (It was also a runner-up in nonfiction Hugo and Locus Award categories.) Betty Ballantine received a Special Committee Award from the annual World Science Fiction Convention in 2006 and a World Fantasy Award for Life Achievement from the World Fantasy Convention in 2007. The Ballantines were both inducted by the Science Fiction Hall of Fame in 2008, with a shared citation."]}, {"page": "Ian Ballantine", "response": ["After Ballantine Books was acquired by Random House in 1973, the Ballantines became freelance consulting editors and publishers during the 1970s. Ian and Betty Ballantine won one special World Fantasy Award for professional work in 1975 and another one shared with Joy Chant and other creators of The High Kings (Bantam, 1983), a reference book on the Matter of Britain that incorporates retellings. (It was also a runner-up in nonfiction Hugo and Locus Award categories.) Their son Richard Ballantine was an author and journalist specializing in cycling topics."]}, {"page": "Ballantine Adult Fantasy series", "response": ["# Red Moon and Black Mountain, Joy Chant (March 1971) (#02178-9)"]}, {"page": "List of high fantasy fiction", "response": ["* Joy Chant's Red Moon and Black Mountain"]}, {"page": "Eileen Joyce Rutter", "response": ["#REDIRECT Joy Chant"]}, {"page": "Rutter (name)", "response": ["* Eileen Joyce (Joy) Rutter (born 1945), English fantasy writer known by pen name Joy Chant "]}, {"page": "Chant (disambiguation)", "response": ["*Joy Chant (born 1945), British fantasy author"]}, {"page": "Fantacollana", "response": [":65 - La grigia criniera del mattino, Joy Chant, 1986 (novel) "]}]}}