{"wiki_id": "http://www.wikidata.org/entity/Q2723975", "itemLabel": "David Dein", "itemDescription": "British football executive", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Dein", "wikipedia_page": {"main": "David Barry Dein  (born 7 September 1943) is the Ambassador for the Premier League and International Ambassador for the Football Association. He is the former co-owner and vice-chairman of Arsenal Football Club and former vice-chairman of the Football Association. Dein is also the founder of The Twinning Project.[1]. He spends much of his free time giving motivational speeches to schools and prisons in the UK and at football conferences globally.He was also the President of the G-14 group of European football clubs between October 2006, and May 2007, and has sat on various committees within FIFA and UEFA including UEFA's Club Competition Committee and Executive Committee. In August 2007 he sold his shares in Arsenal F.C. to London-based, Russian-owned business company, Red and White Holdings. He was also the International President of England's failed 2018 World Cup bid.", "link_mentions": [{"page": "Arsenal F.C.", "response": ["The largest shareholder on the Arsenal board is American sports tycoon Stan Kroenke. Kroenke first launched a bid for the club in April 2007, and faced competition for shares from Red and White Securities, which acquired its first shares from David Dein in August 2007. Red & White Securities was co-owned by Russian billionaire Alisher Usmanov and Iranian London-based financier Farhad Moshiri, though Usmanov bought Moshiri's stake in 2016. Kroenke came close to the 30% takeover threshold in November 2009, when he increased his holding to 18,594 shares (29.9%). In April 2011, Kroenke achieved a full takeover by purchasing the shareholdings of Nina Bracewell-Smith and Danny Fiszman, taking his shareholding to 62.89%. In May 2017, Kroenke owned 41,721 shares (67.05%) and Red & White Securities owned 18,695 shares (30.04%). In January 2018, Kroenke expanded his ownership by buying twenty-two more shares, taking his total ownership to 67.09%. In August 2018, Kroenke bought out Usmanov for £550m. Now owning more than 90% of the shares, he had the required stake to complete the buyout of the remaining shares and become the sole owner. There has been criticism of Arsenal's poor performance since Kroenke took over, which has been attributed to his ownership. Ivan Gazidis was the club's Chief executive from 2009 to 2018."]}, {"page": "Premier League", "response": ["During the 1980s, major English clubs had begun to transform into business ventures, applying commercial principles to club administration to maximise revenue. Martin Edwards of Manchester United, Irving Scholar of Tottenham Hotspur, and David Dein of Arsenal were among the leaders in this transformation. The commercial imperative led to the top clubs seeking to increase their power and revenue: the clubs in Division One threatened to break away from the Football League, and in so doing they managed to increase their voting power and gain a more favourable financial arrangement, taking a 50% share of all television and sponsorship income in 1986. They demanded that television companies should pay more for their coverage of football matches, and revenue from television grew in importance. The Football League received £6.3 million for a two-year agreement in 1986, but by 1988, in a deal agreed with ITV, the price rose to £44 million over four years with the leading clubs taking 75% of the cash. According to Scholar, who was involved in the negotiations of television deals, each of the First Division clubs received only around £25,000 per year from television rights before 1986, this increased to around £50,000 in the 1986 negotiation, then to £600,000 in 1988. The 1988 negotiations were conducted under the threat of ten clubs leaving to form a \"super league\", but they were eventually persuaded to stay, with the top clubs taking the lion's share of the deal. The negotiations also convinced the bigger clubs that in order to receive enough votes, they needed to take the whole of First Division with them instead of a smaller \"super league\". By the beginning of the 1990s, the big clubs again considered breaking away, especially now that they had to fund the cost of stadium upgrade as proposed by the Taylor Report.", "In 1990, the managing director of London Weekend Television (LWT), Greg Dyke, met with the representatives of the \"big five\" football clubs in England (Manchester United, Liverpool, Tottenham Hotspur, Everton and Arsenal) over a dinner. The meeting was to pave the way for a breakaway from The Football League. Dyke believed that it would be more lucrative for LWT if only the larger clubs in the country were featured on national television and wanted to establish whether the clubs would be interested in a larger share of television rights money. The five clubs agreed with the suggestion and decided to press ahead with it; however, the league would have no credibility without the backing of The Football Association, and so David Dein of Arsenal held talks to see whether the FA were receptive to the idea. The FA did not enjoy an amicable relationship with the Football League at the time and considered it as a way to weaken the Football League's position. The FA released a report in June 1991, Blueprint for the Future of Football, that supported the plan for Premier League with FA the ultimate authority that would oversee the breakaway league."]}, {"page": "Totteridge", "response": ["Totteridge has many spacious detached properties in a green setting that are highly valued; some of them are among the most expensive houses in London. Its past and present residents have included the rich and famous, including Arsène Wenger, Frankie Vaughan, Des O'Connor, Cliff Richard, Mickie Most, Hank Marvin, David Dein, Mike Ashley, Bruce Forsyth, David Ginola, Lord Levy and other dignitaries. More modest housing, much of it semi-detached, predominates at the eastern end of Totteridge. That part was developed following the conversion of railway station into an underground station between the two world wars. ", "*David Dein, Former Vice-Chairman of Arsenal FC, Premier League Ambassador"]}, {"page": "Thierry Henry", "response": ["Nevertheless, Arsenal failed to win the Premier League title again, but hopes of a trophy were revived when Arsenal reached the 2006 UEFA Champions League Final. The Gunners eventually lost 2–1 to Barcelona, with Henry assisting the team's only goal from a free kick, and Arsenal's inability to win the league title for two consecutive seasons combined with the relative inexperience of the Arsenal squad caused much speculation that Henry would leave for another club. However, he declared his love for the club and accepted a four-year contract, and said he would stay at Arsenal for life.\"Henry to stay a Gunner until 2010\". BBC Sport. 19 May 2006. Retrieved 1 January 2012. Arsenal vice-chairman David Dein later claimed the club had turned down two bids of £50 million from Spanish clubs for Henry before the signing of the new contract.\"Arsenal rejected 50 million-pound bids for Henry, says Dein\". China Daily. 22 May 2006. Retrieved 26 March 2007. Had the transfer materialised, it would have surpassed the then-world record £47 million paid for Zinedine Zidane."]}, {"page": "Patrick Vieira", "response": ["In May 2001, The Daily Telegraph reported that Manchester United was planning an \"audacious\" attempt to sign Vieira; manager Sir Alex Ferguson, a long-term admirer of the player, was given the green light by his board to make a bid. In the summer period, Vieira disparaged Arsenal's transfer activity and was adamant the club would not finish \"in the top five in the league – and forget the Champions League,\" saying about his future: \"As far as I'm concerned, the matter is resolved. I am leaving Arsenal and I have made that perfectly clear.\" The club refused to respond to his comments, but vice-chairman David Dein was privately irked at Vieira's agent, Marc Roger, for letting the situation become unsettling. Wenger attributed the saga at the hands of Manchester United: \"[They] made an approach to Patrick without contacting us, and that does not really respect the rules.\" Vieira turned up for pre-season training in July 2001 as normal and was later named the club vice-captain, to ensure he would succeed Tony Adams as captain. Success finally came for Vieira in the 2001–02 season; Arsenal regained the league and beat Chelsea in the 2002 FA Cup Final to complete a second double."]}, {"page": "George Graham (footballer, born 1944)", "response": ["Graham's achievements at Millwall attracted attention from First Division clubs, and with the resignation of Don Howe as Arsenal manager in March 1986, their directors first offered the job to FC Barcelona coach Terry Venables, but he rejected their offer and Arsenal switched their attention to Alex Ferguson, the Aberdeen manager, as their new manager with Graham as his assistant. However, Ferguson (then in temporary charge of the Scotland national football team following the death of Jock Stein the previous September, and still in charge of Aberdeen) had decided to wait until after the World Cup that summer before deciding on his future. Graham himself never even applied for the Arsenal position<Ref>https://www.youtube.com/watch?v=uGlkGC8lLsU&t=10s</ref> but on 12 May 1986 his chairman at Millwall told him that Arsenal wanted to speak to him about the manager's job. After an interview with Peter Hill-Wood, David Dein and Ken Friar the Arsenal directors appointed Graham as their new manager on 14 May 1986.\"Sir Alex Ferguson turned down Arsenal job back in 1986\". Mirror Football.10 June 2009. Retrieved 1 June 2012. A month after arriving at Highbury, Graham was himself linked with the Scotland national team, possibly combining it with the Arsenal manager's job,\"Fergie Steps down\". Evening Times. 16 June 1986. Retrieved 1 June 2012. but that role went to Andy Roxburgh instead."]}, {"page": "G-14", "response": ["The last president of the group was Olympique Lyonnais chairman Jean-Michel Aulas, who replaced David Dein, who stepped down after six months of a two-year presidency after leaving Arsenal. Aulas was elected president on 16 May 2007, after securing unanimous agreement from member clubs to the principle of expanding the G-14's membership. Aulas announced his intention to consider inviting a further 16 teams to join, stating that he wanted the G14 \"to expand geographically and be strengthened by other clubs\". In October 2007, 22 additional European clubs were invited to participate in talks towards expansion."]}, {"page": "Emirates Stadium", "response": ["In November 1999, Arsenal examined the feasibility of building a new stadium in Ashburton Grove. Anthony Spencer, estate agent and club property adviser, recommended the area to director Danny Fiszman and vice-chairman David Dein having scoured over North London for potential areas. The land,  from Highbury was composed of a rubbish processing plant and industrial estate, 80% owned to varying levels by Islington Council, Railtrack and Sainsbury's. After passing the first significant milestone at Islington Council's planning committee, Arsenal submitted a planning application for a new-build 60,000 seater stadium in November 2000. This included a redevelopment project at Drayton Park, converting the existing ground Highbury to flats and building a new waste station in Lough Road. As part of the scheme, Arsenal intended to create 1,800 new jobs for the community and 2,300 new homes. Improvements to three railway stations, Holloway Road, Drayton Park and Finsbury Park, were included to cope with the increased capacity requirements from matchday crowds."]}, {"page": "Ashley Cole", "response": ["On 28 July 2006, Arsenal vice-chairman David Dein confirmed that Arsenal and Chelsea had been in \"civil talks\" about the player. Chelsea insisted they would not raise their £16million bid for Cole, but Arsenal held out for at a higher valuation of £25 million. Negotiations continued throughout August and looked to be heading for deadlock, but eventually Cole signed for Chelsea on 31 August for a fee of £5 million, with William Gallas being transferred from Chelsea to Arsenal as part of the same deal. The deal was closed after the transfer window had officially ended, and was not confirmed until an hour and a half after the deadline had passed. The move angered Arsenal fans, who dubbed him \"Cashley\" and waved fake £20 notes with Cole's face on them at him when the two clubs faced each other on 10 December 2006."]}, {"page": "Cesc Fàbregas", "response": ["The 2007–08 season began with much uncertainty for Arsenal. First, David Dein, the club's vice-chairman, left amidst allegations of internal strife, followed by the departure of the club's all-time top goalscorer and captain, Thierry Henry, who signed for Barcelona. There was also speculation over Wenger's future with the club.Wenger signs new three-year Gunners deal, ESPNsoccernet, 7 September 2007, accessed 16 September 2007. Fàbregas knew that he would become the most important player for Arsenal, but stated he was ready for the challenge.How Fabregas plans to save Arsenal, The Guardian, 25 August 2007, accessed 17 September 2007. He started the season well, chalking up goals and assists, and website soccernet attributed the early success of Arsenal to the young Spaniard.Burying the ghost of Henry. ESPNsoccernet, 15 September 2007, accessed 17 September 2007. His start to the season also earned him the O2 Player of the Month award from Arsenal fans for August, September and October,Fabregas scoops O2 Player of the Month award , Arsenal F.C., 5 October 2007, accessed 6 October 2007. as well as the Premier League Player of the Month for September.GUNNERS DUO CELEBRATE AWARDS DOUBLE , Premier League, 19 October 2007, accessed 5 March 2008. With Arsenal leading the league table until March, Fàbregas was equally instrumental in the club's 2007–08 Champions League campaign; in the return leg against Milan, the midfielder scored late in the game to send Arsenal into the quarter-finals.AC Milan 0 – Arsenal 2, BBC Sport, 5 March 2008, accessed 5 March 2008. Though Arsenal ended the season trophyless,Season Review Week: The highlights and the lowlights, Arsenal F.C., accessed 24 May 2008. Fàbregas amassed several personal awards. On 11 April 2008, Fàbregas was nominated for the PFA Player of the Year and PFA Young Player of the Year awards for the second year running;Ronaldo heads shortlist for players' awards, ESPNsoccernet, 11 April 2008, accessed 12 April 2008. he was later crowned the winner of the latter, and named in the PFA Team of the Year. He was also named the 2007–08 Arsenal.com Player of the Season.Fabregas is O2/Arsenal.com Player of the Season, Arsenal F.C., accessed 8 July 2008."]}, {"page": "Gilberto Silva", "response": ["In June 2005, football agent Jacques Lichtenstein took Atlético Mineiro to court over Gilberto's transfer in 2002. Lichtenstein's lawyer argued that he and his informal partner, Ronny Rosenthal, never received an allegedly agreed 10% commission from Gilberto's £4.5 million transfer to Arsenal from Atlético Mineiro in July 2002.Jacques Lichtenstein vs. Clube Atletico Mineiro, Neutral Citation Number: 2005 EWHC 1300 (QB). Case No: HQ02X03806. ElDial.com. June 2006. Retrieved 25 September 2006. Arsène Wenger and Arsenal vice-chairman David Dein both gave evidence in court, saying that Arsenal dealt directly with Atlético Mineiro and that no agent was involved in the deal. The case was conducted before The Hon. Mr Justice Jack, who on 29 June ruled against Lichtenstein, and ordered the claimants pay Atletico Minéiro £94,000 in legal costs.\"Arsenal evidence sinks agent case\". BBC Sport. 29 June 2005. Retrieved 19 March 2012. A year later, the case could have caused problems for Arsenal, when former player Ashley Cole criticised the club for \"hypocrisy and double standards\" in the way they approached Gilberto.\"Cole puts Chelsea in dock over tapping-up inquiry\". The Times' (London). 12 September 2006. Retrieved 25 September 2006."]}, {"page": "Peter Hill-Wood", "response": ["He was the third generation of his family to serve as chairman of Arsenal, following his father, Denis Hill-Wood (in office 1962–1982), and his grandfather, Samuel Hill-Wood (1929–1936 and 1946–1949) from Glossop, Derbyshire. Peter Hill-Wood succeeded his father after the latter's death in 1982. He was not in charge of any day-to-day business at the club, which was generally run by David Dein and a succession of first team managers.", "Hill-Wood sold much of his family holdings in the club to former vice-chairman David Dein in the 1980s and 1990s and the rest to Stan Kroenke."]}, {"page": "DAVID DEIN", "response": ["#REDIRECT David Dein "]}, {"page": "Gavin Dein", "response": ["Gavin Dein is the son of David Dein MBE and Barbara Dein. David Dein is best known for co-owning Arsenal Football Club and founding the Premier League Gavin has an older brother Darren, who is a football agent operating in Europe and a younger sister Sasha. Gavin attended Haberdashers' Aske's Boys' School, The American School in London and graduated with honours in entrepreneurship at Babson College in Boston, Massachusetts."]}, {"page": "Mill Hill County High School", "response": ["* David Dein, former Arsenal FC vice-chairman"]}, {"page": "John Hampden Grammar School", "response": ["In May 2019, a planning application was submitted for the construction of a new three storey classroom block on the front of the site. The project was initially announced in December 2018, when the school received around £3m of funding from the Department for Education's selective school expansion fund, which proved controversial. The new building, named the \"Innovation Hub\", was opened in October 2021 by football executives David Dein and Karren Brady."]}, {"page": "Rémi Garde", "response": ["After a period working as a pundit on French television, he rejoined his old club Lyon as a coach in 2003, and helped the club to win Ligue 1 titles in 2003–04 and 2004–05. After the departure of Paul Le Guen as manager in the summer of 2005, Garde became assistant to his replacement Gérard Houllier. In May 2007, with his contract due to expire, Garde was linked to a return to Arsenal as director of football, a new role created to replace that of the recently departed vice-chairman David Dein."]}, {"page": "David Bernstein (executive)", "response": ["The nomination was met with surprise, with many expecting David Dein to be promoted as chairman. However some analysts see Bernstein as a \"safe pair of hands\", and point to business revivals with ailing companies such as French Connection, Manchester City and Wembley Stadium Limited that have given weight to his appointment."]}, {"page": "Nina Bracewell-Smith", "response": ["As of September 2007, Lady Bracewell-Smith owned a 15.9% stake in the club and was the third largest shareholder in the club following Danny Fiszman, with 24.11%, and Red and White Holdings, which is co-owned by Farhad Moshiri and Alisher Usmanov, which owns 24.0% of the equity. In April 2007, she joined with the other board members, her husband’s cousins, as well as Danny Fiszman and the chairman, Peter Hill-Wood, in resisting a take-over by Usmanov, which was believed to have the support of former vice-chairman David Dein. On 17 December 2008 Arsenal Holdings PLC made this announcement: \"Lady Nina Bracewell-Smith will be leaving the Boards of the Company and the Club with immediate effect.\""]}, {"page": "Danny Fiszman", "response": ["Fiszman bought into Arsenal Football Club and became a board member through his purchase of an 8% stake from his friend David Dein, starting with 10,000 shares in 1991. Fiszman slowly increased his stake to 24%, the largest shareholder as at 27 September 2007, at which point he led the building of the new Ashburton Grove stadium."]}, {"page": "Keith Edelman", "response": ["In 2007 Keith became club President of the Arsenal Ladies team, a position previously held by David Dein until he left Arsenal FC in April of that year. Edelman was always pragmatic about the club's future and did not rule out the club eventually going public or the major shareholders eventually deciding to sell their stakes.Arsenal set to score with full listing – Times Online He resigned as a Director at Arsenal Holdings plc on 1 May 2008 and continued until May 2009 as a consultant.PLUS Markets Group"]}, {"page": "David Gill (football executive)", "response": ["On 2 June 2006, Gill was elected onto the board of The Football Association, replacing Arsenal F.C. vice-chairman David Dein. Gill said he was delighted to be working with the other board members of the Football Association. One of the first issues he had to deal with was the \"club-vs.-country\" row over Wayne Rooney's foot at the 2006 FIFA World Cup."]}, {"page": "Noel White", "response": ["During his Chairmanship of Liverpool F.C, Noel White, along with Martin Edwards, David Dein, Irving Scholar and Philip Carter became one of the five founding architects of the F.A. Premier League. In June 2011, on the twentieth anniversary of the \"Founder Members Agreement\" of the F.A. Premier League, the architects were presented with a framed testimonial containing the crests of the forty-five clubs that have played in the competition since its inception in 1992."]}, {"page": "2007–08 Arsenal F.C. season", "response": ["At the end of the 2006–07 season, Arsenal transferred Fabrice Muamba to Birmingham City and released Mart Poom, who subsequently joined Watford on a free transfer. Jérémie Aliadière moved to Middlesbrough in a £2 million deal while club captain and record goalscorer Thierry Henry left to join Barcelona for a reported fee of £16 million.  Henry commented that his decision to leave Arsenal was because of the departure of chairman David Dein and the uncertainty over Wenger's future. Midfielder Freddie Ljungberg and striker José Antonio Reyes departed the club in July 2007, moving to West Ham United and Atlético Madrid respectively. Other players, Arturo Lupoli, Ryan Garry and Joe O'Cearuill, left on free transfers. Defender Matthew Connolly, who joined Colchester United on loan for a six-month period, later signed for Queens Park Rangers."]}, {"page": "Alisher Usmanov", "response": ["Usmanov moved into the football arena in August 2007 by acquiring a 14.58-percent stake in the English football team Arsenal. He and his business partner Farhad Moshiri bought the stake in the club owned by former Arsenal vice-chairman David Dein for £75 million. David Dein was appointed as head of their investment vehicle, Red and White Holdings, which became the largest shareholder in the club outside of members of the board of directors."]}, {"page": "Farhad Moshiri", "response": ["Moshiri and longstanding business partner Alisher Usmanov were co-owners of Red & White Holdings, which bought 14.65% of the shares in Arsenal F.C. from former club vice-chairman David Dein in August 2007.  On 18 September 2007, Red and White Holdings increased their stake in Arsenal to 21%, and on 28 September 2007 to 23%, a week after Moshiri announced that he wanted at least a 25% holding in the football club. As of June 2012, Red and White Holdings have acquired at least 29.72%.  Arsenal managing director Keith Edelman told BBC Radio 5 Live, \"They've said previously they are not going to make a bid for the company and they want to be long-term shareholders.\""]}, {"page": "England national football team manager", "response": ["The process of appointing a new England manager is undertaken by an FA committee, comprising board members and other high-ranking FA officials. For example, the members of the selection panel which appointed Sven-Göran Eriksson in 2001 were: chief executive Adam Crozier, chairman Geoff Thompson, vice-chairman Dave Richards, club chairmen and FA board members David Dein and Peter Ridsdale, and technical director Howard Wilkinson.p24"]}, {"page": "List of Arsenal F.C. managers", "response": ["Graham was dismissed in February 1995, for bringing the club into disrepute over his transfer misconduct. He was found guilty of financial impropriety by a league investigation, leaving the board with no other choice but to terminate his contract. Stewart Houston came in as caretaker and revitalised the squad, taking Arsenal to the 1995 UEFA Cup Winners' Cup Final. The Arsenal board subsequently hired Bruce Rioch, on a three-year deal in June 1995. Rioch's tenure lasted just 61 weeks and in his only season at the club, he guided Arsenal to fifth position, which came with a UEFA Cup spot. Rioch was sacked in August 1996, amid reports of disagreements with vice-chairman David Dein."]}, {"page": "2003–04 Arsenal F.C. season", "response": ["In the close season, Chelsea was sold to Russian billionaire Roman Abramovich for £140 million, the biggest takeover in British football history at the time. Arsenal vice-chairman David Dein however was displeased, and quipped that Abramovich had \"parked his Russian tanks on our lawn and is firing £50 notes at us\", Abramovich was said to have placed a bid for Arsenal striker Thierry Henry, which was turned down at once."]}, {"page": "Ownership of Arsenal F.C. & W.F.C.", "response": ["After his death, the shareholding of Sir Bracewell Smith was divided between his son and daughter and ended up in the hands of his grandchildren, Sir Charles Bracewell-Smith, Clive Carr (Life-President), Richard Carr (still a director) and Sarah Carr, now Lady Phipps-Bagge. Samuel Hill-Wood's shares passed first to his son Denis and then his grandson and former Arsenal chairman Peter Hill-Wood; he sold much of his family's shareholdings in the 1980s to David Dein, who sold some of them on to Danny Fiszman (a London diamond dealer). In the early 2000s the club sold a 9.9% stake to Granada Holdings Ltd, a subsidiary of ITV plc, and a significant stake was also bought by hedge fund Lansdowne Partners.", "A rival bid for the club came from Red & White Holdings, which was co-owned by Russian billionaire Alisher Usmanov and London-based financier Farhad Moshiri. Red & White bought the stake held by former Arsenal vice-chairman David Dein, as well as stakes owned by Lansdowne and many other minor shareholders, and as of September 2011 own 18,204 shares (29.25%) of the club. This is the largest single stake owned by a non-board member. This led to press speculation of a bidding war between Kroenke and Usmanov. However, Kroenke agreed not to purchase more than 29.9% of the club until at least September 2009, while the rest of the board agreed not to consider a sale of their shares to \"non-permitted persons\" until at least April 2009, and had first option on each other's shares until October 2012."]}, {"page": "Rachel Stevens", "response": ["In her earlier years in S Club, Stevens dated property developer Daniel Cohen for about two years. Following the split, Cohen stated he met Stevens socially a few times after their relationship ended, adding \"she's an absolute darling, someone I haven't a bad word to say about\". On Valentine's Day in 2002 Stevens became engaged to actor Jeremy Edwards. The couple broke up in early 2004. After the break-up she dated Gavin Dein, son of former Arsenal vice-chairman David Dein. The relationship did not last long, with the couple splitting up in August 2005. In September and October 2006 Stevens was linked to American-based British singer Oliver Trevena, known professionally as Oli T."]}, {"page": "Ivan Gazidis", "response": ["In November 2008 Gazidis accepted the post of chief executive of Arsenal, a post he formally took up from 1 January 2009. He succeeded former managing director Keith Edelman and was expected to take over many of the roles formerly undertaken by ex-vice-chairman David Dein."]}, {"page": "Foundation of the Premier League", "response": ["The foundation of the Premier League in English football occurred in the early 1990s. The first major step to its formation occurred in October 1990, when the managing director of London Weekend Television (LWT), Greg Dyke, met with the representatives of the \"big five\" clubs - David Dein of Arsenal, Philip Carter of Everton, Noel White of Liverpool, Martin Edwards of Manchester United and Irving Scholar of Tottenham Hotspur. The meeting was to pave the way for a breakaway from the Football League. Dyke believed that it would be more lucrative for ITV if only the larger clubs in the country were featured on national television and wanted to establish whether the clubs would be interested in a larger share of television rights money.", "The five clubs decided it was a good idea and decided to press ahead with it, however the league would have no credibility without the backing of The Football Association and so David Dein of Arsenal F.C. held talks to see whether the FA were receptive to the idea. The FA did not enjoy an amicable relationship with the Football League at the time and considered it as a way to weaken the Football League's position. Football League president Bill Fox even described the FA's plans to form a breakaway league as an attempt to \"hijack\" the First Division."]}, {"page": "Arsène Wenger", "response": ["Wenger's methods had the desired effect – Nagoya won 17 of their following 27 games to finish runners-up in 1995. He shortly received the J. League Manager of the Year award for 1995, while Stojković claimed the player's honour. In January 1996, Wenger guided the club to their first piece of silverware as Nagoya defeated Sanfrecce Hiroshima to win the Emperor's Cup. Two months later they triumphed in the Super Cup, beating Yokohama Marinos 2–0. The success bolstered Nagoya's status in Japanese football, as well as Wenger's reputation; he was somewhat startled by the praise and idolisation that came his way. Midway through the 1996 league season, Wenger's former club Strasbourg enquired about the possibility of him returning to manage them. He turned down the offer as he was earlier approached by Arsenal. David Dein had remained in contact with Wenger after their first meeting, and frequently sent him video tapes of matches to garner his opinions; \"He was my personal pundit,\" the vice-chairman recalled. The Arsenal board rebuffed Dein's suggestion to appoint Wenger as early as 1995, but concerns over George Graham's successor Bruce Rioch meant they were more open-minded about hiring him since his stint in Japan."]}]}}