{"wiki_id": "http://www.wikidata.org/entity/Q2729480", "itemLabel": "Mrs. John Wood", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Mrs._John_Wood", "wikipedia_page": {"main": "Mrs. John Wood (6 November 1831 (bap. 28 November), Liverpool – 11 January 1915, Birchington-on-Sea), born Matilda Charlotte Vining, was an English actress and theatre manager.", "link_mentions": [{"page": "Weedon Grossmith", "response": ["Grossmith went on to appear in plays by playwrights such as Henry Arthur Jones and Jerome K. Jerome, opposite actors such as Herbert Beerbohm Tree at the Haymarket Theatre and with Mrs. John Wood at the Court Theatre.  In 1892, he played in W. S. Gilbert's Rosencrantz and Guildenstern, a parody of Hamlet, at the Royal Court Theatre.  He became known for playing comedy character roles, noting, \"I am almost invariably cast for cowards, cads and snobs\", and he was particularly good at portraying harassed, misunderstood little men as, like his brother George, he was small in stature. The Times wrote that the \"Weedon Grossmith\" part had become a recognised feature of current drama."]}, {"page": "John Wood", "response": ["* Mrs. John Wood (1831–1915), British actor"]}, {"page": "Royal Court Theatre", "response": ["Cecil and Clayton yielded management of the theatre to Mrs. John Wood and Arthur Chudleigh in 1887, although Cecil continued acting in their company (and others) until 1895. The first production in the new building was a play by Sydney Grundy titled Mamma, starring Mrs. John Wood and John Hare, with Arthur Cecil and Eric Lewis. By the end of the century, the theatre was again called the \"Royal Court Theatre\".\"The Royal Court Theatre, Sloane Square, London: The New Court Theatre\", ArthurLloyd.co.uk, accessed 19 December 2017"]}, {"page": "Dixie (song)", "response": ["The Rumsey and Newcomb Minstrels brought \"Dixie\" to New Orleans in March 1860; the walkaround became the hit of their show. That April, Mrs. John Wood sang \"Dixie\" in a John Brougham burlesque called Po-ca-hon-tas, or The Gentle Savage, increasing the song's popularity in New Orleans. On the surface \"Dixie\" seems an unlikely candidate for a Southern hit; it has a Northern composer, stars a black protagonist, is intended as a dance song, and lacks any of the patriotic bluster of most national hymns and marches. Had it not been for the atmosphere of sectionalism in which \"Dixie\" debuted, it might have faded into obscurity.Silber 50. Nevertheless, the refrain \"In Dixie Land I'll took my stand / To lib an die in Dixie\", coupled with the first verse and its sanguine picture of the South, hit a chord.Crawford 264-6. Woods's New Orleans audience demanded no fewer than seven encores.", "New Orleans publisher P. P. Werlein took advantage and published \"Dixie\" in New Orleans. He credited music to J. C. Viereck and Newcomb for lyrics. When the minstrel denied authorship, Werlein changed the credit to W. H. Peters. Werlein's version, subtitled \"Sung by Mrs. John Wood,\" was the first \"Dixie\" to do away with the faux black dialect and misspellings. The publication did not go unnoticed, and Firth Pond & Co. threatened to sue. The date on Werlein's sheet music precedes that of Firth, Pond & Co.'s version, but Emmett later recalled that Werlein had sent him a letter offering to buy the rights for $5.Nathan 267 note 42. In a New York musical publishers' convention, Firth, Pond & Co. succeeded in convincing those present that Emmett was the composer. In future editions of Werlein's arrangement, Viereck is merely credited as \"arranger.\" Whether ironically or sincerely, Emmett dedicated a sequel called \"I'm Going Home to Dixie\" to Werlein in 1861."]}, {"page": "Po-ca-hon-tas, or The Gentle Savage", "response": ["Theatre companies and orchestra leaders took great liberties with the music, often substituting popular songs with little or no connection to the plot. For an 1860 staging in New Orleans, for example, Mrs. John Wood performed \"Dixie\" for a concluding scene featuring a Zouave march."]}, {"page": "Matilda Vining", "response": ["#REDIRECT Mrs. John Wood"]}, {"page": "Mrs John Wood", "response": ["#REDIRECT Mrs. John Wood"]}, {"page": "Matilda Vining Wood", "response": ["#REDIRECT Mrs. John Wood"]}, {"page": "Matilda Charlotte Vining", "response": ["#REDIRECT Mrs. John Wood"]}, {"page": "Matilda Charlotte Vining Wood", "response": ["#REDIRECT Mrs. John Wood"]}, {"page": "Mrs. Matilda Charlotte Vining Wood", "response": ["#REDIRECT Mrs. John Wood"]}, {"page": "James Lewis (actor)", "response": ["James Lewis was born in Troy, New York in October 1840. There, he made his first stage appearance in 1858, playing Farmer Gammon in The Writing on the Wall.James Lewis: North American Theatre Online At the outbreak of the Civil War he was in the South, and narrowly escaped being detained there by the blockade.  Subsequently he traveled much in the Middle West.  His first appearance in New York City was in 1866, in the farce Your Life's in Danger, presented at the Olympic Theatre by Mrs. John Wood's company.  Afterward he was very successful in Boston in the role of Dick Swiveller.  In 1869 he became the leading comedian in Augustin Daly's company in New York City, and he retained this position during the remainder of his life.  He was highly successful in almost every comedy part that he played. "]}, {"page": "Victorian burlesque", "response": ["In his 1859 Longfellow burlesque Hi-A-Wa-Tha, the American playwright Charles Walcot encapsulated the character of burlesque in the epilogue, addressed to the audience by Mrs. John Wood as Minnehaha:", ":This disgraceful Hiawatha, Mongrel, doggerel Hiawatha!Quoted in Hewitt, Barnard.  \"Mrs. John Wood and the Lost Art of Burlesque Acting\", Educational Theatre Journal, Vol. 13, No. 2 (May, 1961), pp. 82–85, Johns Hopkins University Press, accessed 2 February 2011 "]}, {"page": "Harriett Everard", "response": ["In early 1869, she played a season at the Royal Alfred Theatre in 1869 as Hectae in Macbeth and Bleuzabella in The Invisible Prince. She then joined Mrs. John Wood's company, in which Brough also appeared, at the St James's Theatre and on tour.\"St. James's Theatre, The Era, 5 December 1869, p. 14 Among various other roles, Evarard made an impression there in a burlesque, La Belle Sauvage, as the over-the-top schoolmistress Kros-as-can-be. In 1870 she played one of the undergraduates in Gilbert's play The Princess.The London Theatres, The Era, 13 February 1870, p. 10 She returned to the Queen's Theatre in an adaptation of The Last Days of Pompeii and was at the Royalty Theatre in Bohemia and Belgravia and as Mme Deschapelles in The Lady of Lyons. She also appeared with Brough in James Planché's Babil and Bijou at The Royal Opera House in Covent Garden. At the Princess's Theatre in 1873, she appeared as the Spirit of Memory in Undine, among various other roles, and as Queen of Catland in Little Puss in Boots, where she was called \"one of the best things in the pantomime\". After this, she received enthusiastic reviews as Aurore in Giroflé-Girofla and played Mrs Bundle in The Waterman. In 1875, she appeared at the Charing Cross Theatre in a season of comedies and played Mrs O'Kelly at the Theatre Royal, Drury Lane in the London premiere of The Shaughraun. The following year, she was in Gilbert's Pygmalion and Galatea at the Alexandra Palace and later at the Charing Cross played Mrs Winkle in Young Rip van Winkle and Mrs Grimley in 20 Pounds a Year. She also toured with Joseph Eldred and played in the company of the Strand Theatre."]}, {"page": "Eliza Newton", "response": ["Newton worked with English theatrical producer Mrs. John Wood at the Olympic Theater, and was with the company of John Brougham when the Fifth Avenue Theatre opened in 1869. She left the Fifth Avenue Theatre and said goodbye to America at New York’s French Theater, at a benefit in May 1869. However, decline in her health kept Newton from leaving America; instead, she toured in the United States, especially in the west. In 1873, for example, she performed in a burlesque titled Nymph of the Lurleyberg in Salt Lake City; and in winter 1879–1880, she appeared at the Sawtelle Theatre in Helena, Montana, in several shows, including The Hidden Hand (based on the Southworth novel), By Stealth, The Danicheffs, Kathleen Mavourneen, Leah, the Forsaken, The Swiss Cottage, The Returned Soldier, and Sketches in India. \"It is only justice to say that the lady fully justified the greatest expectations,\" according to a Helena newspaper account."]}, {"page": "Winter Garden Theatre (1850)", "response": ["During the summer of 1859, the daring actor–playwright–manager Dion Boucicault, called \"the most conspicuous English dramatist of the 19th century\",The New York Times, September 19, 1890. tried his hand at management, took over the theatre, and gave the theatre its final name of The Winter Garden Theatre with the opening of his original burlesque Chamooni III on October 19, 1859.  The theatre was aptly named The Winter Garden because Boucicault remodeled the theatre extensively, surprisingly cutting the auditorium in half and installing \"artificial tropical plants after a Parisian prototype.\"Henderson, p. 95.  Boucicault effectively turned the theatre into a \"winter garden\" in the fall of the year. Among Boucicault's stable of first-rung actors were Joseph Jefferson, Agnes Robertson, and Mrs. John Wood.  Boucicault's dramatization of Charles Dickens's Christmas story Cricket on the Hearth was his opening production, starring Jefferson as Caleb Plummer and Robertson as Dot; this immensely popular production eventually toured, as one critic has said, to \"every possible playhouse in English-speaking America.\"Dickensian 48: 21."]}, {"page": "Arthur Cecil", "response": ["Beginning in 1881, Cecil joined the company at the Royal Court Theatre. From 1883, he was co-manager, with John Clayton, of that theatre. There, he played in a number of farces by A. W. Pinero, including The Rector, as Connor Hennessy; The Magistrate (1885), as Mr. Posket; The Schoolmistress (1886), as Vere Queckett; Dandy Dick (1887), as Blore, the butler;Adams, p. 374 and in the title role of The Cabinet Minister (1890)Adams, p. 238 He also appeared there in G. W. Godfrey's The Millionaire, as Mr. Guyon, and created the role of Miles Henniker in Sydney Grundy's Mamma (1888). Cecil and Clayton yielded management at the Court to Mrs. John Wood and Arthur Chudleigh when the theatre closed in 1887, although Cecil continued acting at the theatre after it was rebuilt."]}, {"page": "Foggerty's Fairy", "response": ["* Miss De Vere (a romantic lady) – Mrs. John Wood"]}, {"page": "Eric Lewis (actor)", "response": ["Lewis was soon performing in the West End of London at the Royalty Theatre in April 1887 in Ivy, and in May in a comedy entitled A Tragedy.The Observer, 1 May 1887, p. 2 In June 1887, Lewis performed in a comedietta by Andrew Longmuir called Cleverly Managed.\"Church Temperance Bazaar\", The Times, 29 June 1887, p. 9 In July 1888, he starred in another comedietta, entitled Caught Out, by Florence Bright at St George's HallThe Times, 18 July 1888, p. 12 In September of that year, he helped open the relocated New Court Theatre with a play by Sydney Grundy called Mamma, starring Mrs. John Wood and also featuring Arthur Cecil.\"New Court Theatre\", The Times, 25 September 1888, p. 9 In January 1889, he starred in The Begum's Diamonds by J. P. Hurst at the Avenue Theatre.\"Avenue Theatre\", The Times, 23 January 1889, p. 8 In July of that year, he was back at the Court Theatre starring with Mrs. John Wood, Cecil and Weedon Grossmith in Aunt Jack, a farce by Ralph Lumley.\"Court Theatre\", The Times, 15 July 1889, p. 7 The next year, he had his first big musical comedy success as the foppish Duke of Fayensburg in the successful operetta La Cigale, composed by Edmond Audran, at the Lyric Theatre.\"Lyric Theatre\", The Times, 10 October 1890, p. 7 This ran from October 1890 to December 1891. The Duke was one of his finest roles, and the success of the piece owed much to his performance.", "In 1892, he starred in A. G. Bagot's comedy The Widow at the Comedy Theatre.\"Comedy Theatre\", The Times, 22 April 1892. p. 4 Later that year, he was well received in the role of the Duke in the early George Edwardes musical comedy In Town.\"Prince of Wales's Theatre\", The Times, 17 October 1892, p. 13 Beginning in the next year, he starred as the ridiculed judge in the hit musical A Gaiety Girl.\"Prince of Wales's Theatre\", The Times, 16 October 1893, p. 14 After the long run of that piece, in 1885 he was featured in another hit Edwardes musical, An Artist's Model.\"Daly's Theatre\", The Times, 4 February 1895, p. 8 In 1896, he was in F. C. Burnand's Mrs Ponderbury at the Court Theatre with Mrs. John Wood, Charles Hawtrey and Brandon Thomas.The Observer, 1 March 1896, p. 4 Later in that year he appeared in A White Elephant, a farce by R. C. Carton at the Comedy Theatre\"Comedy Theatre\", The Times, 20 November 1896, p. 6 and another musical, Monte Carlo, at the Avenue Theatre.  In 1897, he received praise in another long-running musical role in A French Maid.\"Terry's Theatre\", The Times, 26 April 1897, p. 13 The same year, during the run of A French Maid at Terry's Theatre, he played in a series of matinees consisting of short musicals for children by Basil Hood and Walter Slaughter.\"'The Happy Life,' by Louis N. Parker, to be Produced at the Duke of York's Theatre\", The New York Times, 5 December 1897\"Terry's Theatre\", The Times, 24 December 1897, p. 6 After this, Lewis devoted himself to the legitimate stage for nearly the remainder of his long career."]}, {"page": "Lionel Brough", "response": ["In 1870, Brough was the title character in Paul Pry at the St. James's Theatre.Who's Who in the Theatre: A Biographical Record of the Contemporary Stage, John Parker (ed.), Sir Isaac Pitman & Sons, Ltd (1951)  In 1871, with Mrs. John Wood, he performed in Milky White and Poll and Partner Joe.  In 1872, he acted as stage manager for Dion Boucicault at the Covent Garden.  Though not trained as a singer, Brough was recruited in 1872 to join Joseph Fell's company at the Holborn Theatre in leading roles in popular musical works including F. C. Burnand's English version of La Vie parisienne.The Observer, 21 April 1872, p. 4 In August of the same year he appeared at Covent Garden in Dion Boucicault's fairy drama Babil and Bijou.The Times, 31 August 1872, p. 8 and The Observer, 1 September 1872, p. 3 During the 1870s, Brough was resident comic lead at the Gaiety, Globe, Charing Cross and Imperial theatres. In the 1870s and 1880s he increasingly augmented his popular parts in modern works with more revivals of classic comic roles, including Tony Lumpkin again, Croaker in Oliver Goldsmith's The Good-Natured Man, Dromio of Ephesus in The Comedy of Errors and Bob Acres in The Rivals.  In 1878, he played opposite Lydia Thompson in burlesques at the Folly Theatre, including as King Jingo in Stars and Garters.Footnote Lights 23 November 2002 , accessed 21 May 2009  He appeared as Valentine in Mefistofele (1880) with Lizzie St Quentin in the title role, Fred Leslie  as Faust and Constance Loseby as Marguerite.Mefistofele, Operetta Research Center, accessed July 30, 2014; and Mefistofele, Theatre Collection of the University of Kent, accessed July 30, 2014"]}, {"page": "The Magistrate (play)", "response": ["*Agatha Poskett, late Farringdon, née Verrinder  – Mrs. John Wood"]}, {"page": "Lotty Hough", "response": ["Charlotte Hough (c. 1833 – January 17, 1896), known as Lotty Hough, sometimes spelled Lottie Hough, was a 19th-century actress and comedian.  She played roles for the companies of Laura Keene and Mrs. John Wood.(9 September 1861). Amusements, The New York Times(4 December 1862). Return of A Popular Actress, Daily National Republican, p. 2, col. 5"]}, {"page": "The White Heather (play)", "response": ["The primary cast included Mrs. John Wood, Henry Neville, Beatrice Lamb, Patti Browne, Kate Rorke, Dawson Milward, and Robert Loraine.", "*Lady Janet MacLintock by Mrs. John Wood"]}, {"page": "Olympic Theatre, New York", "response": ["After Keene left in 1863 the theatre was renamed the Olympic and was managed by a number of actresses, including Mrs. John Wood (c. 1866). The theatre closed in 1880 and was demolished in the same year."]}, {"page": "Osmond Tearle", "response": ["After six years appearing in the provinces he made his first appearance in London at the Gaiety Theatre in March 1875 as George de Buissy in Campbell Clarke's unsuccessful adaptation of Rose Michel, subsequently playing there Charles Courtly in London Assurance. Beginning in May of that year, he played Hamlet at the Rotunda Theatre, Liverpool, for eighteen successive nights. Afterwards he toured with Mrs. John Wood's old comedy company as Charles Surface in The School for Scandal and Young Marlow in She Stoops to Conquer."]}, {"page": "Sybil Carlisle", "response": ["Carlisle's first dramatic appearance was in January 1891 playing Emily Pettibone in All the Comforts of Home. The performance took place at the Globe under the management of Norman Forbes. She then was an understudy at the Royal Court Theatre with Mrs. John Wood until July 1891 when she began her engagement with Charles Wyndham. Wyndham appointed her as the understudy of Mary Moore in all of her parts at the Criterion Theatre for at least two years. Wyndham also assigned Carlisle the title role in Miss Decima during the absence of lead actress Juliette Nesville, and Carlisle went on to tour the play with the Criterion company for three months. She served under Wyndham for nearly two years."]}, {"page": "George Fawcett Rowe", "response": ["He then continued to New York where, on 26 February 1866 he appeared at the Olympic Theatre, under the management of Mrs. John Wood, playing Sir Charles Coldstream in Used Up, adapted by Charles Mathews from Boucicault's translation of the French comédie en vaudeville L'homme blasé by Duvert and Vauxroussel. Whereas he had appeared as George Fawcett in Australia, he now used his surname, Rowe, on stage. His play Fifth Avenue was a success, starring George Rignold, and another original drama, The Geneva Cross was also a success. It was later played at the Theatre Royal, Melbourne, on 22 April 1874. Fifth Avenue later became New Babylon."]}]}}