{"wiki_id": "http://www.wikidata.org/entity/Q272643", "itemLabel": "Stephen Metcalfe", "itemDescription": "British politician (born 1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Metcalfe_(politician)", "wikipedia_page": {"main": "Stephen James Metcalfe (born 9 January 1966) is a Conservative Party politician in the United Kingdom, who was first elected as the Member of Parliament (MP) for South Basildon and East Thurrock in 2010. He has served as the chairman of the Science and Technology Select Committee.", "link_mentions": [{"page": "Basildon", "response": ["Boundary changes which came into force from the 2010 general election mean that the area is politically represented by two MPs, from the constituencies of Basildon and Billericay and South Basildon and East Thurrock. The current MPs are John Baron and Stephen Metcalfe, both of the Conservative party."]}, {"page": "Angela Smith, Baroness Smith of Basildon", "response": ["The old Basildon seat was abolished in the 2010 general election, and she stood for and lost the contest to the new South Basildon and East Thurrock constituency, which predominantly covered much of the area she represented in Parliament, to the Conservative candidate Stephen Metcalfe. Adverse boundary changes contributed to her defeat, as some of her voters were moved into the new Basildon and Billericay seat, whilst the new South Basildon seat took in strong Conservative wards in East Thurrock. Labour would have possibly held the old Basildon seat, and Smith herself said in a 2011 House of Lords debate: “Prior to my election to the other place in 1997, the constituency boundaries in my constituency were redrawn. For the 2010 election, the constituency boundaries were redrawn again, which may explain why I am in your Lordships' House and not in the other place”."]}, {"page": "Stephen Metcalf", "response": ["*Stephen Metcalfe (politician) (born 1966), British politician", "*Stephen Metcalfe (screenwriter) (fl. 2002–2015), American film director and screenwriter"]}, {"page": "Stanford-le-Hope", "response": ["The serving Member of Parliament is Stephen Metcalfe from the Conservative Party, who was re-elected for the fourth time at the 2019 UK general election."]}, {"page": "South Basildon and East Thurrock (UK Parliament constituency)", "response": ["South Basildon and East Thurrock is a constituency represented in the House of Commons of the UK Parliament since its 2010 creation by Stephen Metcalfe, a Conservative.", "| Stephen Metcalfe"]}, {"page": "1966 in the United Kingdom", "response": ["*9 January – Stephen Metcalfe, English politician"]}, {"page": "Basildon and Thurrock University Hospitals NHS Foundation Trust", "response": ["In 2014 they celebrated their 40th anniversary with the hospital departments being involved in the celebrations, local press coverage covered the birthday weekend and local MP Stephen Metcalfe (politician) joined the celebrations."]}, {"page": "Education Select Committee", "response": ["| Stephen Metcalfe"]}, {"page": "Ian Luder", "response": ["In December 2014, Luder was one of five people on the shortlist to become United Kingdom Independence Party candidate for the constituency of South Basildon and East Thurrock at the 2015 general election. At the initial selection meeting he was not chosen as the candidate.\"UKIP'S Neil Hamilton withdrew from standing for South Basildon and East Thurrock MP...and deselected Kerry Smith was reselected instead!\", Echo, 11 December 2014 Shortly afterwards, the successful candidate, Kerry Smith, resigned as UKIP's nominee for the seat after he was recorded making offensive remarks about fellow party members in a telephone conversation. A new selection was held in January 2015, which Luder won. Luder contested the general election and came second, polling 12,097 votes (26.5% of the total), 7,692 votes behind the incumbent Conservative candidate, Stephen Metcalfe. Smith polled 401 votes and finished in fifth place."]}, {"page": "Science and Technology Select Committee", "response": ["The Right Honourable Greg Clark was elected as the new chair in the 58th parliament in January 2020. He defeated fellow Conservative MP Stephen Metcalfe.", "| Stephen Metcalfe MP", "| Stephen Metcalfe MP"]}]}}