{"wiki_id": "http://www.wikidata.org/entity/Q272288", "itemLabel": "Justin Tomlinson", "itemDescription": "British politician (born 1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Justin_Tomlinson", "wikipedia_page": {"main": "Justin Paul Tomlinson (born 5 November 1976) is a Conservative Party politician and former marketing executive who served as Minister of State for Disabled People, Work and Health from 2019 to 2021. He has been the Member of Parliament (MP) for North Swindon since 2010.\nA former Conservative Councillor on Swindon Borough Council, he previously served as Parliamentary Private Secretary to Ed Vaizey. He served in David Cameron’s government as Parliamentary Under-Secretary of State for Disabled People from 2015 to 2016. He was a junior minister during the second May ministry at the Department for Work and Pensions, as Parliamentary Under-Secretary for Family Support, Housing and Child Maintenance from 2018 to 2019.", "link_mentions": [{"page": "Swindon", "response": ["Swindon is represented in the national parliament by two MPs. Robert Buckland (Conservative) was elected for the South Swindon seat in May 2010 with a 5.5% swing from Labour and Justin Tomlinson, also Conservative, represents North Swindon after a 10.1% swing at the same election. Both retained their seats at the 2015 and 2017 elections. Prior to 1997 there was a single seat for Swindon, although much of what is now in Swindon was then part of the Devizes seat."]}, {"page": "Chairman of the Conservative Party", "response": ["When the Conservatives are in government, the officeholder is usually a member of the Cabinet holding a sinecure position such as Minister without Portfolio. Deputy or Vice Chairmen of the Conservative Party may also be appointed, with responsibility for specific aspects of the party (most notably local government, women or youth). The Conservative Party is currently co-chaired by Oliver Dowden, who was appointed in a cabinet reshuffle on 15 September 2021, and Ben Elliot, who has been Co-Chairman since July 2019. Justin Tomlinson MP is Deputy Chairman."]}, {"page": "Conservative Future", "response": ["* Justin Tomlinson (2002–2003)"]}, {"page": "North Swindon (UK Parliament constituency)", "response": ["North Swindon is a constituency represented in the House of Commons of the UK Parliament since 2010 by Justin Tomlinson, a Conservative.", "| Justin Tomlinson"]}, {"page": "List of Parliamentary constituencies in Wiltshire", "response": ["|Justin Tomlinson†"]}, {"page": "Work and Pensions Select Committee", "response": ["| Justin Tomlinson MP (Conservative)", "|Justin Tomlinson MP (Conservative)"]}, {"page": "Peter Heaton-Jones", "response": ["In 2010, he served as agent and campaign director for the Conservative candidates in the North Swindon and South Swindon parliamentary constituencies, both of which were gained from the Labour Party at the general election on 6 May. On the same day he was elected to Swindon Borough Council as councillor for the Abbey Meads ward. Following the election, he was appointed Senior Parliamentary Assistant to MPs Robert Buckland and Justin Tomlinson. He was also appointed to a number of committees on Swindon Borough Council, including the Planning and Scrutiny committees. In May 2012, Heaton-Jones was re-elected to Swindon Borough Council for the new St Andrews ward. He was appointed Chair of the Economic Scrutiny Committee and Vice-Chair of Scrutiny, and also served on the Licensing Committee."]}, {"page": "List of constituencies in South West England", "response": ["|Justin Tomlinson†"]}, {"page": "List of alumni of Oxford Brookes University", "response": ["*Justin Tomlinson - Conservative Member of Parliament for North Swindon"]}, {"page": "Baxter College", "response": ["Justin Tomlinson, Member of Parliament for North Swindon"]}, {"page": "Suspension from the UK parliament", "response": ["|Justin Tomlinson"]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| North Swindon||style=\"background-color: \"| ||Labour||style=\"background-color: \"| ||Justin Tomlinson (C)||Gain"]}, {"page": "Chris Kelly (British politician)", "response": ["Kelly and his friend Justin Tomlinson placed a bet while at university that either would be Prime Minister of the United Kingdom before the year 2038, at the odds of 10,000 to 1. They stand to win £500,000 should this happen. Tomlinson and Kelly were both subsequently elected as members of parliament for the Conservative Party."]}]}}