{"wiki_id": "http://www.wikidata.org/entity/Q2730498", "itemLabel": "John Wood", "itemDescription": "English cricketer, born 1970", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Wood_(cricketer,_born_1970)", "wikipedia_page": {"main": "For the 18th century Surrey cricketer, please see John Wood (Surrey cricketer, born 1744)For the 18th century Kent cricketer, please see John Wood (Kent cricketer, born 1745)\n\nJohn Wood (born 22 July 1970) is an English cricketer. He was a right-handed batsman and a right-arm medium-fast bowler who played for Griqualand West, Durham and Lancashire in a twelve-year career.\nWood began his cricketing career in 1990, when he played various cup competitions in South Africa, before he made his County Championship debut in England during the 1992 season. Playing in the lower-order, Wood took five wickets in his first bowling spell. He  was only an intermittent starter during the following season, after some expensive bowling, though he hit his first half-century, in the first innings of the first Championship match he took part in, against Nottinghamshire. However, Durham found themselves at the bottom of the table come the end of the season, with just two wins in seventeen matches.\nWood spent most of the 1995 season out of the game, making just three County Championship appearances, and did not reclaim a first-team place until 1998, during which he took two five-wicket innings, despite not performing at his peak with the bat.\nWhen the league split into two after the 1999 season, Durham qualified for the First Division, having placed eighth during the season, and consolidated their position in the first division in 2000. At the end of the 2000 season, Wood moved to Lancashire, having seen Durham relegated to the Second Division. This would prove a masterful transfer for Wood, as Durham without him would struggle to perform in the 2001 County Championship, finishing second-last with only Derbyshire below them, while Lancashire, with Wood's assistance, consolidated their position in Division One.\nOver his final three years in first-class cricket, and, by this time, in his early-thirties, Wood played only infrequently. Following a couple of expensive bowling spells, he found himself out of the first-class team.\nIn nearly twelve years in first-class cricket, Wood remained a lower-order batsman, with frequently devastating spells of bowling to counter his low batting average.\nSince 2006, Wood has been the Captain of Cleckheaton's Cricket Club, a club in the Bradford Premier League which is generally regarded as being one of the best leagues in the country in terms of the quality of cricket. Under his captaincy Cleckheaton won the league in 2013, for the first time in the club's history and in 2014 which was the club's 150th anniversary.", "link_mentions": [{"page": "John Wood", "response": ["John Wood may refer to:", "* John Wood, the Elder (1704–1754), English architect", "* John Wood, the Younger (1728–1782) architect", "* John Wood (professor) (c.1775–1822), American professor of mathematics", "* John Wood (design theorist) (born 1945), British professor of design ", "* John Wood (activist) (born 1964), education activist, marketing director at Microsoft", "* Sir John Wood (professor of law) (1932 - 2014) Sheffield University Law School, and member of ACAS & the ILO", "* John Wood (actor, born 1909), Australian actor", "* John Wood (actor, born 1946), Australian actor who appeared in the police drama Blue Heelers", "* John Wood (English actor) (1930–2011), Shakespearean actor", "* Mrs. John Wood (1831–1915), British actor", "* John Wood, birth name of actor John Fortune", "* John Wood (artist) (1922–2012), American artist", "* John Wood (director) (1925–2015), pseudonym of Spanish director Juan Bosch", "* John Wood (poet) (born 1947), American poet and historian of photography", "* John Wood (record producer), English record producer", "* John Wood (painter) (1801–1870), English history and portrait painter, see Thomas Stothard", "* John Atwood (colonial administrator) (1576–1644), also known as John Wood, Assistant Governor of the Plymouth Colony", "* John Wood (congressman) (1816–1898), U.S. Representative from Pennsylvania", "* John Wood (Florida politician) (born 1952), member of the Florida House of Representatives", "* John Wood (governor) (1798–1880), governor of Illinois", "* John Wood (MP for Ipswich), English MP for Ipswich in 1420", "* John Wood (died 1458), English MP for Worcester and Worcestershire", "* John Wood I of Keele, English MP for Newcastle-under-Lyme", "* John Wood II of Keele, English MP for Newcastle-under-Lyme", "* Sir John Wood (speaker) (died 1484), English MP and Speaker of the House of Commons", "* John Wood (Scottish courtier) (died 1570), Secretary to Regent Moray", "* John Wood (MP for Bossiney) (died 1623), English MP for Bossiney", "* John Wood (Isle of Man governor), Governor of the Isle of Man, 1761–1777", "* John Wood (MP for Preston) (1789–1856), British MP for Preston", "* John Wood (civil servant, born 1790) (1790–1856), British civil servant", "* Sir John Wood, 1st Baronet (1857–1951), British Member of Parliament", "* Sir John Wood (civil servant, born 1870) (1870–1933), civil servant in the Indian Civil Service", "* John Wood (Australian politician) (1829–1914), Victorian and Tasmanian Legislative Assemblies", "* John Wood (diplomat) (born 1944), New Zealand diplomat", "* John Wood (surgeon) (1825–1891), British surgeon at King's College Hospital", "* John Wood (Surrey cricketer, born 1744) (1744–1793), English cricketer", "* John Wood (Kent cricketer, born 1745) (1745–1816), English cricketer", "* John Wood (New Zealand cricketer) (1839–1909), New Zealand cricketer", "* John Wood (Australian cricketer) (1865–1928), Australian cricketer", "* John Wood (civil servant, born 1870) (1870–1933), English cricketer", "* John Wood (cricketer, born 1970), English cricketer", "* John Wood (footballer, born 1880) (1880–1916), English footballer", "* John Wood (footballer, born 1884) (1884–1959), English footballer", "* John Wood (footballer, born 1948), English footballer", "* John Wood (Scottish footballer) (1894–1971), Scottish forward", "* John Wood (American football) (born 1951), American football player", "* Jackie Wood (1919–1993), real name Edward John Wood, footballer", "* John Wood (baseball) (1872–1929), baseball player", "* John Wood (canoeist) (1950–2013), Canadian Olympic flatwater canoer", "* John Wood (racing driver) (born 1952), CART driver", "* John Wood (rugby league) (born 1956), Great Britain, and Leigh", "* John Wood (millowner) (1758–?), created the Howard Town Mills complex in Glossop, England", "* John Wood (Bradford manufacturer) (1793–1871), English industrialist and factory reformer", "* John Wood (explorer) (1812–1871), Scottish explorer of central Asia", "* John Wood (photographer) (dates unknown), Civil War photographer for Union Army", "* John Wood, subject of Finders Keepers (2015 film)", "*John Woods (disambiguation)"]}, {"page": "John Wood (Kent cricketer, born 1745)", "response": ["John Wood (1745 – July 1816 at Seal, Kent) was an English cricketer who played for Kent.  His career began in the 1760s before first-class statistics began to be recorded and his known first-class career spans the 1772 to 1783 seasons.", "He has often been confused with his namesake who played for Surrey at the same time.  Although Wood is credited with 12 first-class appearances by CricketArchive, there are only 10 which can definitely be attributed to him.  Using the data in Scores and Biographies, there were 12 matches in which a player known only as \"Wood\" took part, with Wood of Surrey specifically recorded in 13.Haygarth, pp.3–46.CricketArchive – John Wood.  Retrieved on 16 January 2011.", "The first time a John Wood is mentioned in the sources is when one plays for Caterham against Hambledon in 1769.  This was probably the Surrey-based player.  In the same season, a player called Wood played for the Duke of Dorset's XI against Wrotham in the minor match that featured John Minshull's century.  Given Dorset's strong Kent connection, this was probably John Wood of Kent."]}, {"page": "Jason Searle", "response": ["Searle made his first-class debut for Durham during the 1994 season, having had a solid Second XI season the previous year. His debut appearance saw a ten-wicket loss at the hands of Lancashire, though Searle finished not-out in both innings, a fate which probably would not have befallen him but for John Wood's second half-century of his career."]}, {"page": "List of Durham County Cricket Club seasons", "response": ["|align=left|John Wood"]}, {"page": "John Wood (Surrey cricketer, born 1744)", "response": ["For the 18th century Kent cricketer, please see John Wood (Kent cricketer, born 1745)", "For the former Durham County Cricket Club cricketer, please see John Wood (cricketer, born 1970)", "John Wood aka Thomas Wood (born October 1744 and died March 1793 at Coulsdon, Surrey) was an English cricketer who played for Chertsey Cricket Club and Surrey.  His career began in the 1760s before first-class statistics began to be recorded and his known first-class career spans the 1773 to 1780 seasons.", "He has often been confused with his namesake who played for Kent at the same time.  Although Wood is credited with 23 first-class appearances by CricketArchive, there are only 13 which can definitely be attributed to him.  Using the data in Scores and Biographies, there were 12 matches in which a player known only as \"Wood\" took part, with Wood of Kent specifically recorded in 10.Haygarth, pp.3–46.CricketArchive – John Wood.  Retrieved on 16 January 2011.", "In addition to confusion about Wood's namesake, there is uncertainty about his forename as he is called Thomas Wood in Scores and Biographies, where he is described as \"Thomas Wood, a miller, living in Pirbright, Surrey\".Haygarth, p.4.  This is almost certainly incorrect and CricketArchive believes that his name was John Wood.  It seems that Scores and Biographies has equated him with Thomas Woods who played as a given man for Chertsey against Dartford in 1761 when John Wood was only 16.Buckley, p.39.", "The first time a John Wood is mentioned in the sources is when one plays for Caterham against Hambledon in 1769.  This was probably the Surrey-based player.  In the same season, a player called Wood played for the Duke of Dorset's XI against Wrotham in the minor match that featured John Minshull's century.  Given Dorset's strong Kent connection, this was probably John Wood of Kent.", "Both John Woods are found in 1773 scorecards and are usually differentiated in Scores & Biographies by the Surrey one being called Thomas.  Wood of Surrey had a very good season in 1773 and was one of the leading wicket takers that year.Haygarth, pp.6–16."]}, {"page": "List of Durham County Cricket Club players", "response": ["* John Wood (1991–2000) : J. Wood"]}]}}