{"wiki_id": "http://www.wikidata.org/entity/Q27369", "itemLabel": "Charles Samuel Franklin", "itemDescription": "British radio pioneer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Samuel_Franklin", "wikipedia_page": {"main": "Charles Samuel Franklin (1879 – 10 December 1964), who published as C. S. Franklin, was a noted British radio pioneer.", "link_mentions": [{"page": "Shortwave radio", "response": ["Guglielmo Marconi, pioneer of radio, commissioned his assistant Charles Samuel Franklin to carry out a large-scale study into the transmission characteristics of short-wavelength waves and to determine their suitability for long-distance transmissions. Franklin rigged up a large antenna at Poldhu Wireless Station, Cornwall, running on 25 kW of power. In June and July 1923, wireless transmissions were completed during nights on 97 meters (about 3 MHz) from Poldhu to Marconi's yacht Elettra in the Cape Verde Islands."]}, {"page": "International broadcasting", "response": ["Guglielmo Marconi pioneered the use of short wave radio for long-distance transmissions in the early 1920s. Using a system of parabolic reflector antennae, Marconi's assistant, Charles Samuel Franklin, rigged up a large antenna at Poldhu Wireless Station, Cornwall, running on 25 kW of power. In June and July 1923, wireless transmissions were completed during nights on 97 meters from Poldhu to Marconi's yacht Elettra in the Cape Verde Islands. High speed shortwave telegraphy circuits were then installed from London to Australia, India, South Africa and Canada as the main element of the Imperial Wireless Chain from 1926."]}, {"page": "Alexandra Palace", "response": ["In 1935, the trustees leased part of the palace to the BBC for use as the production and transmission centre for their new BBC Television service. The antenna was designed by Charles Samuel Franklin of the Marconi Company. The world's first public broadcasts of (then) \"high-definition\" television were made from Alexandra Palace in November 1936, an event which is alluded to by the rays in the modern coat of arms of the London Borough of Haringey. Two competing systems, Marconi-EMI's 405-line system and John Logie Baird's 240-line system, were installed, each with its own broadcast studio and were transmitted on alternate weeks until the 405-line system was chosen in 1937. After the BBC leased the eastern part of the palace the theatre was only used for props storage space."]}, {"page": "Poldhu", "response": ["Marconi later used the site for his shortwave experiments, with transmissions by Charles Samuel Franklin to Marconi on the yacht  in the Cape Verde Islands in 1923 and in Beirut in 1924. The groundbreaking results of these experiments took the world by surprise and quickly resulted in his development of the Beam Wireless Service for the British General Post Office. The service opened from the Bodmin Beam Station to Canada on 25 October 1926, from the  to Australia on 8 April 1927, from the  to South Africa on 5 July 1927, to India on 6 September 1927 and shortly afterwards to Argentina, Brazil and the United States."]}, {"page": "History of radar", "response": ["Radio pioneer Guglielmo Marconi noticed radio waves were being reflected back to the transmitter by objects in radio beacon experiments he conducted on March 3, 1899 on Salisbury Plain. In 1916 he and British engineer Charles Samuel Franklin used short-waves in their experiments, critical to the practical development of radar. He would relate his findings 6 years later in a 1922 paper delivered before the Institution of Electrical Engineers in London:"]}, {"page": "Marconi Research Centre", "response": ["Marconi Company chose to establish itself in Chelmsford shortly after the company was founded in 1897. It first acquired the former silk-works on Hall Street before expanding to a new factory, the New Street Works, in 1912. At the same time a formal Research Department was founded under the auspices of Charles Samuel Franklin near the original Hall Street works."]}]}}