{"wiki_id": "http://www.wikidata.org/entity/Q2737983", "itemLabel": "Lord Arthur Somerset", "itemDescription": "British Noble", "wikipedia_url": "https://en.wikipedia.org/wiki/Lord_Henry_Arthur_George_Somerset", "wikipedia_page": {"main": "Major Lord Henry Arthur George Somerset DL (17 November 1851 – 26 May 1926) was the third son of the 8th Duke of Beaufort and his wife, the former Lady Georgiana Curzon. He was head of the stables of the future King Edward VII (then Prince of Wales) and a Major in the Royal Horse Guards.\n\nLord Arthur Somerset was linked with the Cleveland Street scandal, in which he was identified and named by several male prostitutes as a customer of their services. He was interviewed by the police on 7 August 1889, and although the record of the interview has not survived, it resulted in a report being made by the Attorney-General, Solicitor-General and Director of Prosecutions urging that proceedings should be taken against him under section 11 of the Criminal Law Amendment Act 1885. A piece of paper was pasted over Somerset's name in the report, as it was deemed so sensitive. It is believed that he gave the police the initials of a member of the Royal family \"P. A. V.\", which stood for Prince Albert Victor, Duke of Clarence and Avondale, his employer and the second in line to the throne, who – he alleged – also frequented the brothel. After that, the Director was told that the Home Secretary wished him to take no action for the moment. The police obtained a further statement implicating Somerset, while Somerset arranged for his solicitor to act in the defence of the boys arrested over the scandal. After the police saw him for a second time on 22 August, Somerset obtained leave from his regiment and permission to go abroad.Lord Arthur went to Bad Homburg in Germany, although he returned to England. When tipped off in September that charges were imminent, he fled to France to avoid them. From there he travelled through Constantinople, Budapest, Vienna, and back to France, where he settled, living with an Englishman, James Neale, until his death in 1926, aged 74.\n\n", "link_mentions": {}}}