{"wiki_id": "http://www.wikidata.org/entity/Q273453", "itemLabel": "Elizabeth Chadwick", "itemDescription": "British writer of historical fiction primarily set in medieval Europe", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Chadwick", "wikipedia_page": {"main": "Elizabeth Chadwick is an author of historical fictions. She is a member of Regia Anglorum, a medieval reenactment organisation.", "link_mentions": [{"page": "Eleanor of Aquitaine", "response": ["Historical fiction author Elizabeth Chadwick wrote a three-volume series about Eleanor: The Summer Queen (2013), The Winter Crown (2014) and The Autumn Throne (2016)."]}, {"page": "Louis VII of France", "response": ["Louis is a character in Jean Anouilh's 1959 play Becket. In the 1964 film adaptation he was portrayed by John Gielgud, who was nominated for the Academy Award for Best Supporting Actor. He was also portrayed by Charles Kay in the 1978 BBC TV drama series The Devil's Crown. He has a role in Sharon Kay Penman's novels When Christ and His Saints Slept and Devil's Brood. The early part of Norah Lofts' biography of Eleanor of Aquitaine deals considerably with Louis VII, seen through Eleanor's eyes and giving her side in their problematic relationship. Louis is one of the main characters in Elizabeth Chadwick's novel The Summer Queen."]}, {"page": "Berengaria of Navarre", "response": ["*The Autumn Throne by Elizabeth Chadwick"]}, {"page": "Rosamund Clifford", "response": ["* Rosamund is mentioned as past mistress of Henry II in the novel The Time of Singing (2008) by Elizabeth Chadwick.", "* Rosamund is featured in the novel The Winter Crown (2014) by Elizabeth Chadwick, which covers the marriage between Eleanor of Aquitaine and Henry II."]}, {"page": "Guy of Lusignan", "response": ["Guy has also appeared in various numbers of historical novels, notable examples from among them including in \"The Knights Templar Trilogy\" by the Swedish author Jan Guillou which depicts him as a scheming, incompetent and selfish as well as religiously fanatical villain accelerating the loss of the Holy Land to Salāḥ ad-Din; in \"The Sir Balian d'Ibelin Trilogy\" by Helena P. Schrader; in \"Templar Silks\" by Elizabeth Chadwick, Zofia Kossak-Szczucka's \"Król trędowaty\" (\"The Leper King\"), Graham Shelby's \"The Knights of Dark Renown\", Cecelia Holland's \"Jerusalem\", \"Knight Crusader\" by Ronald Welch, \"The Heart of the Lion\" by Jean Plaidy (Eleanor Hibbert) and also Sharon Kay Penman's \"The Land Beyond The Sea\", each of which are among examples of historical fiction genre works generally which depict him as a good-looking young man who in spite of such qualities still is weak and foolish young man with at the least a partially arrogant personality, with the seventh, eighth and ninth examples as being whichever art what do depict him sympathetically as likable and chivalrous in personality. Yet the sixth and seventh examples also give the misleading impression that he was younger than King Richard: he was at least some years older than the latter. In the eighth example, Guy first meets Sibylla (her name spelled here as \"Sybilla\" like with the third example) after the latter leaves the scene of a verbal confrontation with her in-book-depicted-as-bitter-and-foul-tempered-and-verbal-lashing-and-verbal-and-emotional-outburst-prone mother Lady Agnes de Courtenay, with said verbal confrontation over whether or not Sibylla's younger half-sister Princess Isabella is a threat to her."]}, {"page": "Blanche of Castile", "response": ["Blanche of Castile is mentioned in François Villon's 15th century poem Ballade des Dames du Temps Jadis (Ballad of Ladies of Times Past), together with other famous women of history and mythology.  Blanche's selection as bride for Louis and travel to France is noted in Elizabeth Chadwick's The Autumn Throne."]}, {"page": "Roger Bigod, 2nd Earl of Norfolk", "response": ["Roger Bigod and his wife Ida de Tosny are the main characters in Elizabeth Chadwick's The Time of Singing (Sphere, 2008), published in the USA as For the King's Favor.   They appear as minor characters in other of her books set at the same time, notably To Defy a King, which concerns the marriage of their son Hugh to Maud, a daughter of William Marshal. As Bigot, Bigod also appears as a character in the play King John by William Shakespeare."]}, {"page": "Waltheof, Earl of Northumbria", "response": ["* Waltheof is a major character in Elizabeth Chadwick's 2002 historical novel The Winter Mantle"]}, {"page": "Maud, Countess of Huntingdon", "response": ["Maud of Huntingdon appears as a character in Elizabeth Chadwick's novel The Winter Mantle (2003), as well as Alan Moore's novel Voice of the Fire (1995) and Nigel Tranter's novel David the Prince (1980)."]}, {"page": "Robert of Bellême, 3rd Earl of Shrewsbury", "response": ["He is also portrayed in The Wild Hunt (1990) by Elizabeth Chadwick."]}, {"page": "Petronilla of Aquitaine", "response": ["*Elizabeth Chadwick - The Summer Queen (2014) "]}, {"page": "Fulk FitzWarin", "response": ["* Elizabeth Chadwick, The Outlaw Knight (Sourcebooks); formerly published as Lords of the White Castle (Little, Brown, 2000)."]}, {"page": "Betty Trask Award", "response": ["* Elizabeth Chadwick for The Wild Hunt - £3,000"]}, {"page": "John Marshal (Marshal of England)", "response": ["*John fitz Gilbert the Marshal is the subject of Elizabeth Chadwick's novel A Place beyond Courage (2007)."]}, {"page": "Cultural depictions of John, King of England", "response": ["* John is featured in several books by Elizabeth Chadwick, including Lords of the White Castle, The Champion, and The Scarlet Lion."]}, {"page": "Cultural depictions of Henry II of England", "response": ["* Elizabeth Chadwick has written a series mainly concerned with Eleanor of Acquitaine in which Henry II is a major character"]}, {"page": "Knights Templar in popular culture", "response": ["*Elizabeth Chadwick's novel,Templar Silks (2018), focuses on a servant of the elderly William Marshal attempting to retrieve the titular silks from the Holy Land, so Marshall can fulfill a vow to the Templars.\"Review: Templar Silks by Elizabeth Chadwick Review"]}, {"page": "Maud de Braose", "response": ["A book entitled Lady of Hay was written by author Barbara Erskine. It is a highly fictional account of Maud's life simultaneously set in the past and in 20th century England where she was fictitiously reincarnated as a modern Englishwoman. Maud is also mentioned in the novel Here Be Dragons by Sharon Penman, and in the novels To Defy A King and The Scarlet Lion by Elizabeth Chadwick, and in Jean Plaidy's novel The Prince of Darkness about King John. The incident of Maud's starvation and death at the hands of King John is fictionalized in Pamela Kaufman's The Prince of Poison."]}, {"page": "Maud Marshal", "response": ["Maud Marshal is the subject of a novel by Elizabeth Chadwick, titled To Defy a King. In the book she is called Mahelt rather than Maud.   She and her first husband Hugh Bigod appear as secondary characters in books chronicling their parents's lives: The Time of Singing (UK: Sphere, 2008) published in the US as For the King's Favor; The Greatest Knight; and The Scarlet Lion."]}, {"page": "Ida de Tosny", "response": ["Ida de Tosny and her husband Roger are the main characters in Elizabeth Chadwick's The Time of Singing (Sphere, 2008), published in the US as For the King's Favor. They appear as minor characters in other of her books set at the same time, notably To Defy a King, which concerns the marriage of their son Hugh to Maud, a daughter of William Marshal."]}, {"page": "Cultural depictions of the Anarchy", "response": ["* Elizabeth Chadwick's A Place Beyond Courage (published 2008, Sphere) is set during the Anarchy, focusing on the life of John FitzGilbert the Marshal. Her most recent novel The Lady of the English focuses on Matilda and on Henry's young wife Adeliza."]}, {"page": "Cultural depictions of Empress Matilda", "response": ["* Elizabeth Chadwick, Lady of the English (2012)"]}, {"page": "Historical Novel Society", "response": ["The awards are judged by eminent authors (e.g., Dame Hilary Mantel and Elizabeth Chadwick) and top industry professionals (e.g., the late Carole Blake, agent to Barbara Erskine, and Juliet Mushens agent to Jessie Burton). Past award winners who have gone on to publication include Michel Faber, Hilary Green, and Ruth Downie."]}, {"page": "Cultural depictions of William Marshal, 1st Earl of Pembroke", "response": ["* A new novel about William Marshal, The Greatest Knight by Elizabeth Chadwick, based on primary sources and the main secondary source biographies of professors Painter, Duby and Crouch was published by Time Warner Books on 3 November 2005.  A sequel, The Scarlet Lion followed in 2006.  As one of the prominent historical figures of the period, Marshal also appears as a minor character in several of her other novels set around the same time."]}, {"page": "Chadwick, Elizabeth", "response": ["#redirectElizabeth Chadwick"]}]}}