{"wiki_id": "http://www.wikidata.org/entity/Q2736567", "itemLabel": "Joseph Chatt", "itemDescription": "British chemist", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Chatt", "wikipedia_page": {"main": "Joseph Chatt  (6 November 1914 – 19 May 1994) was a renowned British researcher in the area of inorganic and organometallic chemistry.  His name is associated with the description of the pi-bond between transition metals and alkenes, the Dewar–Chatt–Duncanson model.\nChatt received his Ph.D. at the University of Cambridge under the direction of F. G. Mann for research on organoarsenic and organophosphorus compounds and their complexes with transition metals.  He was employed at Imperial Chemical Industries from 1949 to 1962, during which time he, often in collaboration with Bernard L. Shaw, published influential work on the metal hydrides and metal alkene complexes. During this period, he reported the first example of C-H bond activation by a transition metal  and one of the first examples of a transition metal hydride.In the 1960s, Chatt moved to a professorship at the University of Sussex and subsequently assumed directorship of the Nitrogen Fixation Unit under the Agricultural Research Council.  Using the transition metal dinitrogen complex W(N2)2(dppe)2, his group first demonstrated the conversion of a dinitrogen ligand into ammonia.  This work provided some of the first molecular models for nitrogen fixation. Chatt authored or co-authored over 300 peer-reviewed publications.Among his many awards, he was recognized with the 1981 Wolf Prize \"for pioneering and fundamental contributions to synthetic transition metal chemistry, particularly transition metal hydrides and dinitrogen complexes.\" He was elected a Fellow of the Royal Society in 1961 and was made a Commander of the Order of the British Empire.In 1995, a year after his death, the Unit of Nitrogen Fixation moved to Norwich and became part of the John Innes Centre. The new building, as well as an annual lecture at the Centre, were named in his honour.", "link_mentions": [{"page": "Wolf Prize in Chemistry", "response": ["| Joseph Chatt"]}, {"page": "Robert H. Crabtree", "response": ["Robert Howard Crabtree studied at Brighton College (1959–1966), and earned a Bachelor of Arts degree from the University of Oxford where he was a student at New College, Oxford in 1970, studying under Malcolm Green. He received his PhD from the University of Sussex in 1973, supervised by Joseph Chatt."]}, {"page": "Carbon–hydrogen bond activation", "response": ["The first C–H activation reaction is often attributed to Otto Dimroth, who in 1902, reported that benzene reacted with mercury(II) acetate (See: organomercury).  Many electrophilic metal centers undergo this Friedel-Crafts-like reaction. Joseph Chatt observed the addition of C-H bonds of naphthalene by Ru(0) complexes.  "]}, {"page": "Dewar–Chatt–Duncanson model", "response": ["The Dewar–Chatt–Duncanson model is a model in organometallic chemistry that explains the chemical bonding in transition metal alkene complexes. The model is named after Michael J. S. Dewar,Dewar, M. Bulletin de la Société Chimique de France 1951, 1 8, C79 Joseph Chatt and L. A. Duncanson.\"Olefin Co-ordination Compounds. Part III. Infra-Red Spectra and Structure: Attempted Preparation of Acetylene Complexes\" J. Chatt and L. A. Duncanson, Journal of the Chemical Society, 1953, 2939 Directing effects in inorganic substitution reactions. Part I. A hypothesis to explain the trans-effect J. Chatt, L. A. Duncanson, L. M. Venanzi, Journal of the Chemical Society, 1955, 4456-4460 "]}]}}