{"wiki_id": "http://www.wikidata.org/entity/Q2748908", "itemLabel": "Lucien Bull", "itemDescription": "French chronophotographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Lucien_Bull", "wikipedia_page": {"main": "Lucien Bull (January 5, 1876 – August 25, 1972) was a pioneer in chronophotography. Chronophotography is defined as \"a set of photographs of a moving object, taken for the purpose of recording and exhibiting successive phases of motion.\"", "link_mentions": [{"page": "List of Irish people", "response": ["* Lucien Bull (1876–1972) – high speed photography, modern electrocardiogram (ECG)"]}, {"page": "1904 in science", "response": ["* Lucien Bull produces the first successful chronophotography (of insect flight), working in France.Reported by him in \"Motional mechanism of the insect wing\", Comptes rendus de l'Académie des sciences 138:590–592 (29 February); \"Application of the electric spark to the chrono-photography of rapid motions\", Comptes rendus 138:155–157 (21 March); \"Chronophotography of rapid motions\", Bulletin de la Société Philomathiclue (Paris) (June 11); Synthesis in chronophotography, Bulletin de la Société Philomathiclue (November 12)."]}, {"page": "1876 in science", "response": ["* January 5 – Lucien Bull (died 1972), Irish-born pioneer in chronophotography."]}, {"page": "1972 in science", "response": ["* August 25 – Lucien Bull (b. 1876), Irish-born French pioneer in chronophotography."]}, {"page": "Artillery sound ranging", "response": ["The French had made an important development.  They had taken the string galvanometer and adapted it to record signals from microphones onto photographic film.  This work had been done by Lucien Bull and  Charles Nordmann (an astronomer at the Paris observatory). Processing the film took some minutes but this was not a significant drawback because artillery batteries did not move very frequently.  However, the apparatus could not run continuously because of the expenditure of film.  This meant that it had to be switched on when enemy guns fired, which necessitated the deployment of Advanced Posts (AP) in front of the microphones which could switch on the recording apparatus remotely via field cable. These Advanced Posts were connected back to a centrally located Flash Board, and this device enabled the observers to be sure they were all observing the same muzzle flash.  When this had been established they could switch on the recording apparatus."]}, {"page": "1876 in Ireland", "response": ["*5 January – Lucien Bull, pioneer in chronophotography (died 1972 in France)."]}, {"page": "Bull (surname)", "response": ["* Lucien Bull (1876–1972), a pioneer in chronophotography"]}]}}