{"wiki_id": "http://www.wikidata.org/entity/Q2749927", "itemLabel": "KatieJane Garside", "itemDescription": "English singer", "wikipedia_url": "https://en.wikipedia.org/wiki/KatieJane_Garside", "wikipedia_page": {"main": "Katrina Jane Garside (born 8 July 1968) is an English singer, songwriter, visual artist, and poet. She is known for her dynamic musical projects, which have ranged in style from noise rock to acoustic folk-influenced, and featured vocals ranging from childlike whispers to harsh scream singing. The daughter of a father in the British Army, Garside had an itinerant childhood, growing up in several places in England, and spending a significant portion of her adolescence aboard a yacht. She rose to prominence as the lead vocalist of the indie noise rock band Daisy Chainsaw, which she formed in 1989 in London with guitarist Crispin Gray. \nAfter quitting Daisy Chainsaw in 1993, Garside went into seclusion for several years before reuniting with Gray in 1999 to form the rock band Queenadreena, with whom she released four studio albums between 2000 and 2008. In both Daisy Chainsaw and Queenadreena, Garside received critical attention for her alternately harsh and childlike vocals, manic onstage behaviour, and raucous live concerts. \nGarside self-released a solo album, Lullabies in a Glass Wilderness, in 2007. The same year, she began writing and releasing material with her project Ruby Throat, an acoustic collaboration with her partner, American guitarist Chris Whittingham. In late 2007, Ruby Throat released their debut album, The Ventriloquist. Garside concurrently held a mixed media art exhibition, Darling, they've found the body, which was shown at Woom gallery in Birmingham. Ruby Throat self-released their subsequent albums Out of a Black Cloud Came a Bird and O' Doubt O' Stars in 2009 and 2012, respectively. During this period, Garside and Whittingham resided on a yacht with their children. \nRuby Throat released their fourth album, Baby Darling Taporo, in 2017. Garside and Whittingham subsequently formed a new musical project called Liar, Flower, under which they released the album Geiger Counter in April 2020. Garside discusses this album at length in a career spanning interview on Conan Neutron's Protonic Reversal.", "link_mentions": [{"page": "Autoharp", "response": ["In 2020, KatieJane Garside released the Liar, Flower album Geiger Counter, in which she is featured on autoharp."]}, {"page": "Einar Örn Benediktsson", "response": ["In 2005 Ghostigital signed with the California-based label Ipecac Recordings co-founded by Faith No More singer Mike Patton. Their first Ipecac release, In Cod We Trust, was released in March 2006.Ipecac Recordings – Ghostigital (accessed 24 January 2012) On this record Einar's son Kaktus (currently frontman of Fufanu) plays trumpet. It also features contributions from Mark E Smith, Sensational, Ásgerður Júníusdóttir and KatieJane Garside."]}, {"page": "Bill Rieflin", "response": ["Rieflin formed an experimental ensemble under the name Slow Music in 2005 (including Fripp and Buck) in which he played synthesizers rather than drums. The group played a small handful of live dates in 2005 and 2006 and became inactive for several years.  He was also involved in a music collaboration project entitled The Humans, which consisted of him, Chris Wong, Fripp and Toyah Willcox. The band performed a series of live dates in Estonia in Autumn 2007 and 2009, and released their debut album We are the Humans in 2009. Hector Zazou's 2010 album Corps Electriques featured Rieflin, as well as KatieJane Garside, Lone Kent and nu-jazz trumpeter Nils Petter Molvær."]}, {"page": "Kinderwhore", "response": ["Love has claimed that she took the style from Divinyls frontwoman Christine Amphlett, and was also inspired by KatieJane Garside of Daisy Chainsaw who toured with Hole during 1991. The look became very popular in 1994."]}, {"page": "Suede (album)", "response": ["Suede's breakthrough single in the UK was \"Metal Mickey\". According to Anderson, the song was inspired by Daisy Chainsaw vocalist KatieJane Garside.Barnett, p. 96 Butler has noted that its musical inspiration was \"The Shoop Shoop Song\", famously remade by Cher. Anderson wrote \"Sleeping Pills\" whilst doing voluntary work at a local community centre in Highgate. It was inspired by the daily drama of the British housewives and their dependence on valium as a means of escapism.Barnett, p. 68 At the time he felt that the song's lyrics were more sophisticated than \"Animal Nitrate\", which he thought were \"a bit throw-away.\"Barnett, p. 94–95 The band were determined to release \"Sleeping Pills\" as the third single, but were soon over-ruled by Nude Records' owner Saul Galpern, who suggested the former instead.Barnett, p. 109"]}, {"page": "Nils Petter Molvær", "response": ["* 2008: Corps Electriques, with Hector Zazou/KatieJane Garside, Bill Rieflin, Lone Kent"]}, {"page": "Metal Mickey (song)", "response": ["The song is an up-tempo rock song; considerably different than the slower \"Drowners\". Guitarist Bernard Butler has said that its musical inspiration was \"The Shoop Shoop Song\", famously remade by Cher for the 1990 film Mermaids. The guitar solo, according to Butler was inspired by The Kinks' \"You Really Got Me\". Other than its nod to the robot from the 80s children's sitcom of the same name, singer Brett Anderson has said the song was inspired by Daisy Chainsaw vocalist KatieJane Garside. Charting in the top-twenty in the UK, the single earned the band their first appearance on Top of the Pops."]}, {"page": "Queenadreena", "response": ["Queenadreena was an English alternative rock band that formed in London, England in 1999 by vocalist KatieJane Garside and guitarist Crispin Gray, who had previously collaborated in the celebrated but short-lived band Daisy Chainsaw. Garside and Gray, who had earned a reputation for their abrasive songwriting with Daisy Chainsaw, incorporated elements of blues rock and other genres with Queenadreena, in addition to their predominant noise rock influences.", "Queenadreena formed in 1999 after guitarist Crispin Gray came in contact with KatieJane Garside, with whom he had collaborated with in 1989 when they formed the band Daisy Chainsaw. Garside left Daisy Chainsaw after completing two years with the band, and went into seclusion in the Lake District, where she lived in the historic Rigg Beck, a retreat for artists and bohemians. Returning to London in 1998, Garside moved to Belsize Park, where Gray had also been living, and the two reconnected to form the group.<Ref name=rd/>", "Billy Freedom was replaced in 2002 by drummer Pete Howard, formerly of The Clash. The band signed with Rough Trade for their second album, 2002's Drink Me. The record spawned the single \"Pretty Like Drugs,\" which garnered the band attention from rock press. The album was well received by such publications as Drowned in Sound, who gave it a 7/10 rating, writing: \"KatieJane Garside is the kind of woman who makes ordinarily rational grown guys go weak at the knees. \"Pretty Like Drugs\" will show you why. As her cutesy lost girl Tori Amos/Björk-isms erupt into fearsome hollers that would have piss dribbling down Courtney Love’s surgically enhanced thighs, it’ll all make sense.\" The French publication Les inrockuptibles described the record as \"Gothic, dark, and threatening.\"", "*KatieJane Garsidevocals (1999–2009)"]}, {"page": "Drink Me (Queenadreena album)", "response": ["*KatieJane Garsidevocals"]}, {"page": "Taxidermy (Queenadreena album)", "response": ["*KatieJane Garsidevocals, arrangement "]}, {"page": "Katie jane garside", "response": ["#redirect KatieJane Garside"]}, {"page": "The Butcher and the Butterfly", "response": ["The Butcher and the Butterfly is the third studio album by English alternative rock band Queenadreena, released in May 2005 though One Little Indian and Imperial Records. The album features writing from frontwoman KatieJane Garside, guitarist Crispin Gray, and drummer Pete Howard, as well as contributions from Garside's sister, Melanie Garside, who also plays bass on the album. Richard Adams, the bassist of Garside and Gray's former band, Daisy Chainsaw, also has a co-writing credit on one track.", "* KatieJane Garsidevocals"]}, {"page": "Indigo Vertigo", "response": ["Indigo Vertigo is a 48-page graphic novella, written by KatieJane Garside and illustrated by Dogwitch creator, Daniel Schaffer. It was published by Image Comics in 2005.", "According to Schaffer, who acknowledges a heavy influence from Lynch (and also Japanese auteur, Shinya Tsukamoto), the book is an experiment in subjective storytelling, and came about as the result of an unconventional, intuitive creative process developed by himself and KatieJane Garside (best known as the former vocalist of London noise punk band Daisy Chainsaw and Noise Rock band Queenadreena, and current vocalist of neo-folk duo Ruby Throat.)", "* katiejanegarside.com KatieJane Garside website"]}, {"page": "Aaron Detroit", "response": ["Now living and working in Los Angeles, CA, Aaron Detroit has since collaborated with Dame Darcy in the Dark Wave band Death By Doll (whose CD entitled Gasoline featuring Detroit was released by Emperor Penguin Recordings on October 31, 2006 ) and toured the US with the project in the Fall of 2006. Detroit is currently running The Lovers' Will Records & Press, a boutique record label and chapbook press. In April 2010, The Lovers' Will released a deluxe vinyl LP edition of The Ventriloquist by KatieJane Garside's Folk Noir band, Ruby Throat."]}, {"page": "Daisy Chainsaw", "response": ["Daisy Chainsaw were an English alternative rock group who were active between 1989 and 1994 started by guitarist and songwriter Crispin Gray. The group's original lead vocalist  KatieJane Garside appeared on the band's early EPs and 1992 debut album, Eleventeen, before departing in 1993. Lead vocalist Belinda Leith replaced Garside for the group's final album, released in 1994.", "The band formed in 1989 after KatieJane Garside answered an advertisement placed by guitarist Crispin Gray in the music press.  Their gigs included grapevines and rag dolls strewn across the stage, and Garside thrashing around in soiled gowns drinking juice from a baby bottle.Daisy Chainsaw segment, Rapido — YouTube", "In support of Eleventeen, the band toured extensively in the United Kingdom with grunge band Mudhoney, who were supporting their new release, Every Good Boy Deserves Fudge (1991), and alternative rock band Hole, who were also supporting their debut, Pretty on the Inside (1991). Hole frontwoman Courtney Love cited KatieJane Garside as one of the \"first true riot grrls\" alongside herself and Kat Bjelland of Babes in Toyland, although none of these bands were directly associated with the riot grrl movement."]}, {"page": "Katiejane Garside", "response": ["#REDIRECT KatieJane Garside "]}, {"page": "Live at the ICA", "response": ["*KatieJane Garsidevocals"]}, {"page": "Test Dept", "response": ["The group formed in the London suburb of New Cross in 1981. The core members of the group were Graham Cunnington, Paul Jamrozy, Jonathan Toby Burdon, Paul Hines and Angus Farquhar. Other members who played with the group at various times included Alistair Adams, Neil Starr, John Eacott, Andy Cowton, Tony Cudlip, David Coulter, Liz Ranken, Gus Ferguson, Martin King, Simon Hyde, Russell MacDonald and KatieJane Garside. Comedian Vic Reeves played bass in an early incarnation of the band. The band signed to Some Bizzare Records, a label connected to acts like Depeche Mode, Soft Cell, The The, Cabaret Voltaire, PTV, Foetus, and Swans. The slides and film for Test Dept multi-media events were made by visual director Brett Turnbull."]}, {"page": "List of female rock singers", "response": ["* KatieJane Garside (Daisy Chainsaw, Queenadreena)"]}, {"page": "Hector Zazou", "response": ["Zazou's last projects are documented on the Music Operator interactive multimedia web site, which graphically documents his collaborations while in the background his music plays. In January 2008 Hector Zazou released his Corps électriques album, featuring \"one of the original riot grrrls\" KatieJane Garside, Bill Rieflin, Lone Kent and nu-jazz trumpeter Nils Petter Molvær.", "* 2008 Hector Zazou / KatieJane Garside – Corps électriques (Signature)"]}, {"page": "Lullabies in a Glass Wilderness", "response": ["Lullabies in a Glass Wilderness is an experimental self-released album by English artist KatieJane Garside, using the stage name Lalleshwari. She is also the frontwoman of Ruby Throat, and formerly of Queenadreena and Daisy Chainsaw. The name \"Lalleshwari\" is derived from an ancient Hindu poet.", "Jen Dan of the independent music website Delusions of Adequacy wrote: \"This album is neither sweepingly angelic or devilishly tormentedit’s more of a creep through the wild weeds, but it’s worth it for fans of KatieJane Garside’s work.\"", "*KatieJane Garsidevocals, guitar, programming, production", "Category:KatieJane Garside albums"]}, {"page": "Ride a Cock Horse (album)", "response": ["*KatieJane Garsidevocals"]}, {"page": "Ruby Throat", "response": ["Ruby Throat is a British neofolk musical duo formed in 2007 by English vocalist KatieJane Garside and American guitarist Chris Whittingham. The duo were formed during the dissolution of Garside's former band, Queenadreena, and have recorded four studio albums. In 2020, Garside and Whittingham  released music together under the name \"Liar, Flower\".https://www.popmatters.com/liar-flower-geiger-counter-2645863552.html", "Ruby Throat formed in 2007 during the time in which KatieJane Garside's band Queenadreena was in stages of dissolution. Garside met Whittingham, an American from Hawaii while he was busking at a train platform in the London Underground, and asked him to collaborate with her on a musical project.", "*KatieJane Garside - vocals"]}, {"page": "Djin (album)", "response": ["* KatieJane Garsidevocals"]}, {"page": "List of autoharp players", "response": ["*KatieJane Garside of Ruby Throat, Queenadreena, Daisy Chainsaw"]}, {"page": "Katie Jane Garside", "response": ["#REDIRECT KatieJane Garside"]}, {"page": "Mediæval Bæbes", "response": ["Member Maple Bee (aka Melanie Garside) is the singer in electronic duo Huski and the younger sister of KatieJane Garside, singer of London-based rock band Queenadreena."]}, {"page": "Garside", "response": ["* KatieJane Garside (born 1968), English singer and writer"]}, {"page": "The Wicked + The Divine", "response": ["* The Morrígan – Formerly Marian. Out of her love for her former boyfriend, she requests Ananke turn him into Baphomet. She appears in three incarnations, which have so far been named as \"Badb\", \"Gentle Annie\" (possibly Anand), and simply \"Morrígan\" (The Morrígan). Her personality depends on which incarnation she is in: Gentle Annie is more kind, while Badb is overly aggressive. Her powers include summoning crows as a weapon and, as Gentle Annie, she can heal. If a person tries to capture The Morrígan on camera, they will see a vision of a loved one dying. Gentle Annie sacrifices their life to bring back Nergal after Badb kills him. Two of the twelve being as close as Marian and Cameron were before discovering their abilities is rare, but Ananke/Minerva used that to her advantage. Visually, the Morrigan is based on PJ Harvey, Kate Bush, Patti Smith, Siouxsie Sioux and KatieJane Garside."]}, {"page": "FM Doll", "response": ["According to vocalist KatieJane Garside, the song was inspired by JonBenét Ramsey. In a 2002 interview, she stated: \"I know because of the lyrical content it won’t get on [the radio]. It’s about child murder. Do you remember the JonBenét case in America? The child beauty queen who was supposedly murdered by her mother and father? It’s about that and the endemic infection in the female psyche.\"", "#\"FM Doll\" (KatieJane Garside, Crispin Gray, Pete Howard) – 3:11", "*KatieJane Garside – vocals"]}, {"page": "Pretty Like Drugs", "response": ["Nigel Messenger of Phase9 called the single: \"an excellent, heavy track with a pounding beat saturated with the sexy tones of lead singer KatieJane Garside.\" Rock Feedback said of the single: \"Snarly riffs and the sound of a girl in desperation, panting away like an exhausted farmyard animal, marks \"Pretty Like Drugs,\" the shockingly post-glam stomper new single from Queen Adreena.\"", "*KatieJane Garsidevocals"]}, {"page": "Baby Darling Taporo", "response": ["The album was recorded by vocalist KatieJane Garside and guitarist Chris Whittingham during a voyage around the Marquesas Islands, Niue, Kingdom of Tonga, New Zealand, Saint Helena, and the Azores."]}, {"page": "I Adore You (song)", "response": ["*KatieJane Garsidevocals"]}, {"page": "X-ing Off the Days", "response": ["*KatieJane Garsidevocals"]}]}}