{"wiki_id": "http://www.wikidata.org/entity/Q274500", "itemLabel": "Sarah Dunant", "itemDescription": "English writer, broadcaster and critic", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Dunant", "wikipedia_page": {"main": "Sarah Dunant (born 8 August 1950) is a British novelist, journalist, broadcaster, and critic. She is married with two daughters, and lives in London and Florence.\n\n", "link_mentions": [{"page": "Herstory", "response": ["The herstory movement has spawned women-centered presses, such as Virago Press in 1973, which publishes fiction and non-fiction by noted women authors like Janet Frame and Sarah Dunant."]}, {"page": "Lucrezia Borgia", "response": ["* Blood And Beauty  by Sarah Dunant; ; ; Harper Collins Publishers Ltd | 8 July 2013 |", "* In the Name of the Family by Sarah Dunant; ; Virago Press 2017"]}, {"page": "Courtesan", "response": ["* In Sarah Dunant's In the Company of the Courtesan, Fiammetta Bianchini, a renowned courtesan of Rome, and her sharp-witted dwarf rise to success among the intrigue and secrets of Renaissance Venice."]}, {"page": "Ferrara", "response": ["The Ferrara Bible was a 1553 publication of the Ladino version of the Tanakh used by Sephardi Jews. It was paid for and made by Yom-Tob ben Levi Athias (the Spanish Marrano Jerónimo de Vargas, as typographer) and Abraham ben Salomon Usque (the Portuguese Jew Duarte Pinhel, as translator), and was dedicated to Ercole II d'Este. In the 20th century, Ferrara was the home and workplace of writer Giorgio Bassani, well known for his novels that were often adapted for cinema (The Garden of the Finzi-Continis, Long Night in 1943). In historical fiction, British author Sarah Dunant set her 2009 novel Sacred Hearts in a convent in Ferrara."]}, {"page": "Girolamo Savonarola", "response": ["* The novel The Birth of Venus (2003 ) by Sarah Dunant makes extensive references to Savonarola."]}, {"page": "Patricia Highsmith", "response": ["Highsmith's second novel, The Price of Salt, was published in 1952 under the nom de plume Claire Morgan.  Highsmith mined her personal life for the novel's content.  Its groundbreaking happy ending and departure from stereotypical conceptions about lesbians made it stand out in lesbian fiction.  In what BBC 2's The Late Show presenter Sarah Dunant described as a \"literary coming out\" after 38 years of disaffirmation, Highsmith finally acknowledged authorship of the novel publicly when she agreed to the 1990 publication by Bloomsbury retitled Carol. Highsmith wrote in the \"Afterword\" to the new edition: "]}, {"page": "List of historical novels", "response": ["*The Birth of Venus by Sarah Dunant (Florence, Savonarola period)"]}, {"page": "Newnham College, Cambridge", "response": ["|Sarah Dunant"]}, {"page": "Edge of Darkness", "response": ["Edge of Darkness was promoted on the cover of the listings magazine Radio Times and was broadcast on Monday nights on BBC2 at 9:30pm, beginning 4 November 1985.Pixley, Into The Shadows, p. 51. The serial averaged an audience of 4 million viewers over its run.Cooke, British Television Drama: A History, p. 147. The critical response was generally positive with most commentators concentrating their praise on Peck's performance as Craven and the scale of the programme's political themes. \"A good television thriller is very hard to find but Edge of Darkness promises to be one of the best\", wrote Celia Brayfield in The Times, \"The central character is played by Bob Peck, who has the gift of looking tragic and intelligent simultaneously. [...] There was humour to lift the gloom and superb characterisation to flesh out the stock situation\". Ruth Baumgarten, in The Listener, praised the serial as \"a grandiosely ambitious and compelling piece of fiction\". Speaking on the BBC's review programme Did You See...?, the writer Sarah Dunant said, \"this is a very classy piece of television drama, on all levels, I think on the plot level, I think on the level of emotion and I think stylistically [...] it looks absolutely wonderful, it's shot like a feature film\". Not so impressed was Byron Rogers, television critic of The Sunday Times, who initially hailed the series as one that \"stayed in the mind and will stay there long [...] because of its portrayal of human grief\" but later felt he was \"beginning to find Edge of Darkness slightly irritating\" and decried the final episode as \"an insult to its considerable following\"."]}, {"page": "Venetian Ghetto", "response": ["* Sarah Dunant's novel In the Company of the Courtesan, written in 2006, has some scenes which take place in a Jewish pawnshop in the Ghetto"]}, {"page": "Caterina Sforza", "response": ["* A fictionalised account of Caterina Sforza's capture by Cesare Borgia features in Sarah Dunant's 2013 novel Blood & Beauty.Sarah Dunant - \"Blood & Beauty\" Kindle Edition in: Amazon.com [retrieved 13 September 2020]"]}, {"page": "The Price of Salt", "response": ["Because of the new title and her acknowledged authorship, the novel received another round of reviews, thoroughly favorable, 38 years after its initial publication. Highsmith submitted to publicity interviews as well, though she resented questions about her sexuality and personal relationships. When BBC 2's The Late Show presenter Sarah Dunant asked her in 1990 if Carol constituted a \"literary coming out\", she replied looking irked: \"I'll pass that one to Mrs. Grundy\", referencing the character who embodies conventional propriety."]}, {"page": "Tom Hollander", "response": ["| Sarah Dunant"]}, {"page": "List of female detective characters", "response": ["* Hannah Wolfe is a private investigator in a trilogy of novels – Birth Marks, Fatlands, and Under My Skin – by English novelist Sarah Dunant (debuted 1991)."]}, {"page": "Gold Dagger", "response": ["* Silver Dagger: Sarah Dunant, Fatlands"]}, {"page": "The Late Show (British TV programme)", "response": ["*Sarah Dunant", "*Sarah Dunant interviewing Salman Rushdie whilst he was still officially in hiding following the fatwa condemning him to death."]}, {"page": "The Birth of Venus (novel)", "response": ["The Birth of Venus: A Novel is a 2003 novel by Sarah Dunant, a bestselling British author.  The story is set in the late 15th century in Florence, Italy. It was first published by Little, Brown in 2003 with the title The Birth of Venus: love and death in Florence."]}, {"page": "The Book Club", "response": ["* In the Company of the Courtesan by Sarah Dunant – April 2007"]}, {"page": "List of unmade Doctor Who serials and films", "response": ["Written by Alistair Beaton & Sarah Dunant, this four-part story. was commissioned on 12 December 1978. The scripts were delivered on 5 January 1979 and rejected four days later as unacceptable."]}, {"page": "Linda Dunant", "response": ["#REDIRECT Sarah Dunant"]}, {"page": "1950", "response": ["** Sarah Dunant, English novelist"]}, {"page": "Indies Choice Book Awards", "response": ["|Sarah Dunant "]}, {"page": "1989 in British television", "response": ["**The Late Show, Britain's first daily television arts programme, which is presented by Sarah Dunant debuts on BBC 2 directly after Newsnight."]}, {"page": "Little, Brown Book Group", "response": ["Virago’s contemporary fiction list includes award-winners and bestsellers including Margaret Atwood,  Marilynne Robinson, Sarah Waters, Linda Grant, Sarah Dunant, Gillian Slovo, Shirley Hazzard; from the Man Booker to the Orange Prize for Fiction."]}, {"page": "Did You See...?", "response": ["Did You See...? was a long-running British television review programme that began on the BBC2 in 1980. The programme took a look back at the week's television with a discussion between the presenter and three guests. In the first run there was also a pre-filmed last segment on an aspect of TV by an independent reporter. The presenters of Did You See...? were the journalist and broadcaster Sir Ludovic Kennedy, who fronted the programme from 1980 to 1988,David Steel Obituary: Sir Ludovic Kennedy, The Guardian, 19 October 2009 and Jeremy Paxman, who fronted the programme from 1991 to 1993. Sarah Dunant hosted the show while Kennedy was absent due to ill health. The format was to review the week's TV highlights, followed by an in depth review and critique of three selected shows with a panel of three public figures (not necessarily 'celebrities')."]}, {"page": "Walter Scott Prize", "response": ["*Sarah Dunant for Sacred Hearts — 16th-century Italian convent"]}, {"page": "Bristol Festival of Ideas", "response": ["The 2009 festival focused on three themes – Thirty years of Thatcherism; Darwin and Darwinism; and Arts and Science, fifty years after scientist C. P. Snow's influential lecture, The Two Cultures. Bristol Evening Post, Bristol Festival of ideas is all in the mind, 4 July 2009 Events during the main Festival featured speakers Aravind Adiga, Tariq Modood, Peter Singer, James Lovelock, A. C. Grayling, Christopher Caldwell, John Gray, Richard Holmes, Paddy Ashdown, Nick Cohen, Wayne Hemingway, Susan Blackmore, Christopher Brookmyre, James Harkin, Tariq Ramadan, David Aaronovitch, Bruce Hood, Geoff Dyer, Tristram Hunt, Marcus du Sautoy, Ben Goldacre, Ruth Padel, Richard Fortey, and Gillian Beer. A programme of events was also held throughout the rest of year. Speakers included Clay Shirky, Michael Shermer, Ken Robinson, Leonard Susskind, Steve Jones, Misha Glenny, Daniel Dennett, John Armstrong, Chris Anderson, Edward de Bono, Karen Armstrong, Amartya Sen, Margaret Atwood, Richard Dawkins, Sarah Dunant, John Kampfner, Hugh Fearnley-Whittingstall, Simon Schama, Tristram Stuart, Rose George, Zac Goldsmith, Gillian Tett, Neal Lawson, Michael Mansfield, Vic Reeves, Shappi Khorsandi, Alan Davies, Bruce Hood, John Micklethwait, Madeleine Bunting, David Attenborough, David Puttnam, William Waldegrave, Raj Patel, Vince Cable, Virginia Ironside, and Suzanne Moore.Bristol NUJ: Suzanne Moore to give 2010 Benn Lecture, 13 November 2010"]}, {"page": "Micheletto Corella", "response": ["*Blood & Beauty: The Borgias, a novel by Sarah Dunant"]}]}}