{"wiki_id": "http://www.wikidata.org/entity/Q2748528", "itemLabel": "Emily Davies", "itemDescription": "British suffragist & educator", "wikipedia_url": "https://en.wikipedia.org/wiki/Emily_Davies", "wikipedia_page": {"main": "Sarah Emily Davies (22 April 1830 – 13 July 1921) was an English feminist and suffragist, and a pioneering campaigner for women's rights to university access. She is remembered above all as a co-founder and an early Mistress of Girton College, Cambridge University, the first university college in England to educate women.", "link_mentions": [{"page": "April 22", "response": ["*1830 – Emily Davies, British suffragist and educator, co-founder and an early Mistress of Girton College, Cambridge University"]}, {"page": "Elizabeth Garrett Anderson", "response": ["After this formal education, Garrett spent the next nine years tending to domestic duties, but she continued to study Latin and arithmetic in the mornings and also read widely. Her sister Millicent recalled Garrett's weekly lectures, \"Talks on Things in General\", when her younger siblings would gather while she discussed politics and current affairs from Garibaldi to Macaulay's History of England.Manton, p. 44 In 1854, when she was eighteen, Garrett and her sister went on a long visit to their school friends, Jane and Anne Crow, in Gateshead where she met Emily Davies, the early feminist and future co-founder of Girton College, Cambridge. Davies was to be a lifelong friend and confidante, always ready to give sound advice during the important decisions of Garrett's career. It may have been in the English Woman's Journal, first issued in 1858, that Garrett first read of Elizabeth Blackwell, who had become the first female doctor in the United States in 1849. When Blackwell visited London in 1859, Garrett travelled to the capital. By then, her sister Louie was married and living in London. Garrett joined the Society for Promoting the Employment of Women, which organised Blackwell's lectures on \"Medicine as a Profession for Ladies\" and set up a private meeting between Garrett and the doctor.Manton, pp. 50–52 It is said that during a visit to Alde House around 1860, one evening while sitting by the fireside, Garrett and Davies selected careers for advancing the frontiers of women's rights; Garrett was to open the medical profession to women, Davies the doors to a university education for women, while 13-year-old Millicent was allocated politics and votes for women.Manton, p. 72 At first Newson was opposed to the radical idea of his daughter becoming a physician but came round and agreed to do all in his power, both financially and otherwise, to support Garrett.Manton, pp. 73–76"]}, {"page": "1869", "response": ["* October 16 – England's first residential university-level women's college, the College for Women (predecessor of Girton College, Cambridge), is founded at Hitchin, by Emily Davies and Barbara Bodichon."]}, {"page": "Millicent Fawcett", "response": ["As a child, Fawcett's elder sister Elizabeth Garrett Anderson, who became Britain's first female doctor, introduced her to Emily Davies, an English suffragist. In her mother's biography, Louisa Garrett Anderson quotes Davies as saying to her mother, to Elizabeth and to Fawcett, \"It is quite clear what has to be done. I must devote myself to securing higher education, while you open the medical profession to women. After these things are done, we must see about getting the vote.\" She then turned to Millicent: \"You are younger than we are, Millie, so you must attend to that.\"", "Aged 12 in 1858, Fawcett was sent to London with her sister Elizabeth to attend a private boarding school in Blackheath. Their sister Louise took her to the sermons of Frederick Denison Maurice, a socially aware and less traditional Anglican priest, whose opinions influenced her view of religion. In 1865, she attended a lecture by John Stuart Mill. The following year, she and a friend, Emily Davies, supported the Kensington Society by collecting signatures for a petition asking Parliament to enfranchise women householders."]}, {"page": "1910 in literature", "response": ["*Emily Davies – Thoughts on Some Questions Relating to Women"]}, {"page": "Gateshead", "response": ["*Emily Davies – educational reformer and feminist, founder of Girton College, Cambridge"]}, {"page": "Alfred Waterhouse", "response": ["He was commissioned by Emily Davies to design his only new college at either of the ancient universities, the Women's college Girton College, Cambridge. Gothic of red brick and terracotta.", "The first phase dates from 1871–75 and consisted of 18 sets of undergraduate rooms, Fellows' rooms and Hall forming the north side of what became Emily Davies Court. In 1875-77 he added more undergraduate sets, classroom, laboratory and gymnasium. In 1878 he designed additional college rooms. In 1883-85 he designed additional rooms and service areas, extended the Hall, built Stanley Library named after Henrietta Stanley, Baroness Stanley of Alderley and the Mistress's flat, In 1886-89 the gate tower and new ranges of college rooms forming Cloisters Court and the garden layout. Finally in 1898-1902 came the Chapel, two new ranges of rooms, a new Hall and Kitchens and an indoor swimming pool. A unique facility in a Cambridge College.Cunningham & Waterhouse, pp. 70-71 Unlike most colleges at Cambridge, Waterhouse choose to access the rooms via corridors rather than the normal sets of rooms off staircases.p. 99, The Buildings of England: Cambridge, Simon Bradley & Nicholas Pevsner, 2014, Yale University Press"]}, {"page": "Margaret Forster", "response": ["Forster also wrote fictionalised biographies of the novelist William Makepeace Thackeray (1978) and the artist Gwen John (2006). Significant Sisters (1984) chronicled the growing feminist movement through the lives of eight pioneering British and American women: Caroline Norton, Elizabeth Blackwell, Florence Nightingale, Emily Davies, Josephine Butler, Elizabeth Cady Stanton, Margaret Sanger and Emma Goldman. Good Wives (2001) surveyed contemporary and historical women married to famous men, including Mary Livingstone, Fanny Stevenson, Jennie Lee and herself. Her other historical writings include Rich Desserts and Captain's Thin (1997), an account of the Carr's biscuit factory in Carlisle."]}, {"page": "Girton College, Cambridge", "response": ["Girton College is one of the 31 constituent colleges of the University of Cambridge. The college was established in 1869 by Emily Davies and Barbara Bodichon as the first women's college in Cambridge. In 1948, it was granted full college status by the university, marking the official admittance of women to the university. In 1976, it was the first Cambridge women's college to become coeducational.", "The early feminist movement began to argue for the improvement of women's education in the 1860s: Emily Davies and Barbara Bodichon met through their activism at the Society for the Employment of Women and the Englishwoman's Review.Stephen 1933, p.6 They shared the aim of securing women's admission to university.Stephen 1933, p.7 In particular, they wanted to determine whether girls could be admitted at Oxford or Cambridge to sit the Senior and Junior Local Examinations.Megson and Lindsay 1961, pp.1–2 Davies and Bodichon set up a committee to that effect in 1862. In 1865, with the help of Henry Tomkinson, Trinity College alumnus and owner of an insurance company with good contacts within the University,Bradbrook 1969, p.7 91 female students entered the Cambridge Local Examination.Megson and Lindsay 1961, p.2 This first concession to women's educational rights met relatively little resistance, as admission to the examination did not imply residence of women at the university site.Stephen 1933, p.10", "At that time, students had the option of doing a Pass degree, which consisted of \"a disorderly collection of fragmented learning\",Brooke p.209 or an Honours degree, which at that time meant the Mathematics Tripos, classics, natural or moral sciences. An Honours degree was considered more challenging than the Pass degree. In 1869, Henry Sidgwick helped institute the Examinations for Women, which was designed to be of intermediate difficulty.Winstanley 1977 p.154 This idea was heavily opposed by Emily Davies, as she demanded admittance to the Tripos examinations.Stephen 1933, p.23", "In 1876, Old Wing was completed, and Taylor's Knob, the college laboratory and half of the Hospital Wing was built. In the following year, Caroline Croom Robertson joined the management team as secretary to reduce the load on Emily Davies. In 1884, Hospital Wing was completed, and Orchard Wing, Stanley Library and the Old Kitchens added. At that time, Girton had 80 students. By 1902, Tower Wing, Chapel Wing and Woodlands Wing as well as the Chapel and the Hall were finished, which allowed the college to accommodate 180 students.", "Emily Davies first mooted plans for a chapel in Girton college in 1890; however, building only started in 1899,Bradbrook 1952 four years after the death of Henrietta Stanley, Baroness Stanley of Alderley, who had opposed the idea and instead favoured improving staff salaries and equipment. The chapel, which was designed by Alfred and Paul Waterhouse, was completed in 1901, and inaugurated on 23 May 1902. It seats about 200 people and the interior is held very simply with the exception of oak carvings at the Chancel end and on two long desks in front of the choir seats, which were crafted by the mathematician Margaret Meyer, along with students and friends of the college.Jones 1913 In 1910 came a fine Harrison & Harrison organ, the purchase of which was made possible through donations from students and friends of the college.Jones 1913, p.46 The organ was rebuilt in 1974 and can still be found in the college chapel. A second organ was acquired in 2002.", "The college applied for a coat-of-arms derived from the arms of its founders and benefactors: H.R. Tomkinson, Madame Bodichon (née Leigh Smith), Henrietta Stanley, Baroness Stanley of Alderley (daughter of the 13th Viscount Dillon), and Emily Davies who did not have arms and was instead represented by the Welsh colours, vert and argent. Edward Earle Dorling submitted a variety of designs to the council, however the task was not easy. \"A patch-work of elaborate charges and many colours was to be avoided. Mr Tomkinson's fascinating martlets and Lady Stanley's lion had to be abandoned with regret, as was also a design of green and silver chequers which would have given more prominence to Miss Davies.\"Girton Review, Michaelmas 1928, pp. 2–4"]}, {"page": "Newnham College, Cambridge", "response": ["In tailoring the curriculum to the students, Newnham found itself at odds with the other Cambridge college for women, Girton, founded at the same time. Emily Davies, Girton's founder, believed passionately that equality could only be expressed by women doing the same courses as the men, on the same time-table. This meant that Girton attracted a much smaller intake in its early years. But the Newnham Council held its ground, reinforced by the commitment of many of its members to educational reform generally and a wish to change some of the courses Cambridge was offering to its men."]}, {"page": "London School Board", "response": ["The LSB, at the time of its creation had one of the broadest mandates of any elected body in Britain. Unusually, women were permitted to vote on the same terms as men for the school boards and also to stand for election. Three women stood in the first board election in 1870: Elizabeth Garrett, who topped the poll, Emily Davies, who also won election, and Maria Georgina Grey.  When the second elections were held, in 1873, Garrett and Davies stood down, to be replaced by Jane Agnes Chessar and Alice Cowell, while in 1876, Florence Fenwick Miller, Elizabeth Surr, Helen Taylor and Alice Westlake all won election.Patricia Hollis, Ladies Elect: Women in English Local Government 1865-1914, pp.75-90"]}, {"page": "History of feminism", "response": ["Emily Davies also encountered the Langham group, and with Elizabeth Garrett created SPEW branches outside London."]}, {"page": "1921 in the United Kingdom", "response": ["* 13 July – Emily Davies, pioneer of women's rights and education (born 1830)"]}, {"page": "Davies", "response": ["* Emily Davies, English feminist"]}, {"page": "Anne Clough", "response": ["Keenly interested in the education of women, she made friends with Emily Davies, Barbara Bodichon, Frances Buss and others. She gave evidence to a Royal Commission on secondary schooling, based on her own teaching experience. After helping to found the North of England Council for Promoting the Higher Education of Women, she acted as its secretary from 1867 to 1870 and as its president from 1873 to 1874. Her scheme for peripatetic lecturers was the germ of the University Extension Movement."]}, {"page": "List of University of Cambridge people", "response": ["*Emily Davies (Girton), founder of Girton College, the first residential higher education institution for women"]}, {"page": "List of feminist literature", "response": ["*The Higher Education of Women, Emily Davies (1866)"]}, {"page": "List of suffragists and suffragettes", "response": ["* Emily Davies (1830–1921) – co-founder of Kensington Society and Britain's first women's college, Girton College, Cambridge University"]}, {"page": "Sarah Emily Davies", "response": ["#REDIRECTEmily Davies"]}, {"page": "1830 in the United Kingdom", "response": ["* 22 April – Emily Davies, pioneer of women's rights and education (died 1921)"]}, {"page": "Elizabeth Clarke Wolstenholme Elmy", "response": ["thumb|right|Emily Davies, Head of Girton College", "Wolstenholme, dismayed with the woeful standard of elementary education for girls, joined the College of Preceptors in 1862 and through this organisation met Emily Davies. They campaigned together for girls to be given the same access to higher education as boys. Wolstenholme founded the Manchester Schoolmistresses Association in 1865 and in 1866 gave evidence to the Taunton Commission, charged with restructuring endowed grammar schools, making her one of the first women to give evidence at a Parliamentary select committee. In 1867 Wolstenholme represented Manchester on the newly formed North of England Council for Promoting the Higher Education of Women. Davies and Wolstenholme quarrelled over how women should be examined at a Higher Level as Wolstenholme, who had formed the Manchester branch of the Society for Promoting the Employment of Women in 1865, was keen for a curriculum aimed at developing skills for employment, whereas Davies wished for women to be taught the same syllabus as men."]}, {"page": "Mud March (suffragists)", "response": ["The task of organising the event, scheduled for Saturday, 9 February 1907, was delegated to Pippa Strachey of the Central Society for Women's Suffrage. Her mother, Lady Jane Strachey, a friend of Fawcett, was a long-standing suffragist, but Pippa Strachey had shown little interest in the issue before a meeting with Emily Davies, who quickly converted her to the cause. She took on the organisation of the London march with no experience of doing anything similar, but carried out the task so effectively that she was given responsibility for the planning of all future large processions of the NUWSS. On 29 January the executive committee of the London Society determined the order of the procession and arranged for advertisements to be placed in the Tribune and The Morning Post.", "On the morning of 9 February, large numbers of women converged on the march's starting point, the statue of Achilles near Hyde Park Corner. Between three and four thousand women were assembled, from all ages and strata of society, in appalling weather with incessant rain; \"mud, mud, mud\" was the dominant feature of the day, wrote Fawcett. The marchers included Lady Frances Balfour, sister-in-law of Arthur Balfour, the former Conservative prime minister; Rosalind Howard, the Countess of Carlisle, of the Women's Liberal Federation; the poet and trade unionist Eva Gore-Booth; and the veteran campaigner Emily Davies. The march's aristocratic representation was matched by numbers of professional women – doctors, schoolmistresses, artists – and large contingents of working women from northern and other provincial cities, marching under banners that proclaimed their varied trades: bank-and-bobbin winders, cigar makers, clay-pipe finishers, power-loom weavers, shirt makers."]}, {"page": "English Woman's Journal", "response": ["The Journal was established in 1858 by Barbara Bodichon, Matilda Mary Hays and Bessie Rayner Parkes, with others, Bodichon being the major shareholder and Samuel Courtauld also held shares. Parkes was the chief editor with Hays. Emily Davies (1830–1921) was editor of the Journal in 1863."]}, {"page": "Emily Faithfull", "response": ["Faithfull joined the Langham Place Circle, composed of fellow like-minded women Barbara Leigh Smith Bodichon, Bessie Rayner Parkes, Jessie Boucherett, Emily Davies, and Helen Blackburn. The Langham Place Circle advocated for legal reform in women's status (including suffrage), women's employment, and improved educational opportunities for girls and women. Although Faithfull identified with all three aspects of the group's aims, her primary areas of interest centered on advancing women's employment opportunities. The Circle was responsible for forming the Society for Promoting the Employment of Women in 1859."]}, {"page": "Barbara Bodichon", "response": ["In 1866, cooperating with Emily Davies, Bodichon produced a scheme to extend university education to women. The first small experiment in this, at Hitchin, developed into Girton College, Cambridge, to which Bodichon gave liberally of her time and money.", "In 1854, Bodichon published the Brief Summary in Plain Language of the Most Important Laws Concerning Women, which was crucial in the passage of the Married Women's Property Act. In 1866, in collaboration with Emily Davies, she presented the idea of university education for women, being able to conduct the first experiment at a college in Hitchin, which developed into Girton College and of which Bodichon became a dedicated patron. She studied under the English artist William Henry Hunt to develop her skill in watercolours.", "On 30 June 2019, a Blue Plaque jointly commemorating the founders, Barbara Bodichon and Emily Davies, was unveiled at Girton College by Baroness Hale, President of the Supreme Court, as part of the college's 150th anniversary celebrations. The plaque is sited on the main tower at the entrance to Girton, off Huntingdon Road."]}, {"page": "List of people from Gateshead", "response": ["*Emily Davies – Educational reformer and feminist. Founder of Girton College Cambridge"]}, {"page": "Lisson Grove", "response": ["* Blue Plaque: Emily Davies, founder of Girton College, Cambridge lived at 17, Cunningham Place   from 1863 to 1875 with her mother."]}, {"page": "List of founders of English schools and colleges", "response": ["|Emily DaviesBarbara BodichonLady Stanley of Alderley"]}, {"page": "Noson Lawen (film)", "response": ["Ifan (Meredydd Evans), a farmer's son living in the Welsh hills, dreams of an academic career. His father (Ieuan Rhys Williams) his mother (Nellie Hodgkins) and his wife, Gwen, (Meriel Jones) use nearly all of their money to pay for him to go to a university and are terrified that he may fail his exam, and it will all have been for nothing. As Ifan's father counts the money left for the umpteenth time, the postmistress (Emily Davies) appears with startling news: Ifan has passed with flying colours.", "* Emily Davies as Postmistress"]}, {"page": "Southampton", "response": ["Novelist Jane Austen lived in Southampton for a number of years and the city has also been home to a number of artists, including Edward John Gregory, Hubert von Herkomer and John Everett Millais. The feminist and suffragist Emily Davies was born there in 1830. Sir Leon Simon, President of the Hebrew University of Jerusalem, was born in Southampton."]}, {"page": "Category talk:Academics of the University of Cambridge", "response": ["Emily Daviesnot yet classified"]}, {"page": "1921 in Wales", "response": ["*13 July - Emily Davies, educationist, 90"]}, {"page": "Women's suffrage in the United Kingdom", "response": ["Emily Davies became an editor of a feminist publication, Englishwoman's Journal. She expressed her feminist ideas on paper and was also a major supporter and influential figure during the twentieth century. In addition to suffrage, she supported more rights for women such as access to education. She wrote works and had power with words. She wrote texts such as Thoughts on Some Questions Relating to Women in 1910 and Higher Education for Women in 1866. She was a large supporter in the times where organisations were trying to reach people for a change.Jone Johnson Lewis, \"Emily Davies\", ThoughtCo.com. With her was a friend named Barbara Bodichon who also published articles and books such as Women and Work (1857), Enfranchisement of Women (1866), and Objections to the Enfranchisement of Women (1866), and American Diary in 1872.Jone Johnson Lewis, \"Barbara Bodichon\", ThoughtCo.com."]}, {"page": "Female education", "response": ["Actual progress in institutional terms, for secular education of women, began in the West in the 19th century, with the founding of colleges offering single-sex education to young women. These appeared in the middle of the century. The Princess: A Medley, a narrative poem by Alfred Lord Tennyson, is a satire of women's education, still a controversial subject in 1848, when Queen's College first opened in London. Emily Davies campaigned for women's education in the 1860s, and founded Girton College in 1869, as did Anne Clough found Newnham College in 1875. Progress was gradual, and often depended on individual efforts - for example, those of Frances Lupton, which led to the founding of the Leeds Girls' High School in 1876. W. S. Gilbert parodied Tennyson's poem and treated the themes of women's higher education and feminism in general with The Princess in (1870) and Princess Ida in 1883.", "Slowly the efforts of women like Emily Davies and the Langham group (under Barbara Leigh Smith Bodichon) started to make inroads. Queen's College (1848) and Bedford College (1849) in London started to offer some education to women, and by 1862 Davies was establishing a committee to persuade the universities to allow women to sit for the recently established (1858) Cambridge Local Examinations, with partial success (1865). A year later she published The Higher Education of Women. She and Bodichon founded the first higher educational institution for women, with five students, which became Girton College, Cambridge in 1873, followed by Somerville College and Lady Margaret Hall at Oxford in 1879. Bedford had started awarding degrees the previous year. Despite these measurable advances, few could take advantage of them and life for women students was very difficult."]}]}}