{"wiki_id": "http://www.wikidata.org/entity/Q274080", "itemLabel": "Chrissie White", "itemDescription": "actress (1895-1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chrissie_White", "wikipedia_page": {"main": "Chrissie White (23 May 1895 – 18 August 1989) was a British film actress of the silent era. She appeared in more than 180 films between 1908 and 1933. White married actor and film director Henry Edwards in 1922, and in the 1920s the two were regarded as one of Britain's most newsworthy celebrity couples. Edwards directed more than 20 of his wife's films. The couple had two children, a son and a daughter, Henryetta Edwards. White starred in the 1920 film The Amazing Quest of Mr. Ernest Bliss, which as of August 2010 is missing from the BFI National Archive, and is listed as one of the British Film Institute's \"75 Most Wanted\" lost films.", "link_mentions": [{"page": "Pierce Brothers Westwood Village Memorial Park and Mortuary", "response": ["* Chrissie White (1895–1989), silent film actress"]}, {"page": "List of female movie actors by name: W–Z", "response": ["*Chrissie White (1894–1989)"]}, {"page": "List of British films before 1920", "response": ["| Kissing Cup || Jack Hulcup || Harry Gilbey, Chrissie White, Cecil Mannering || Sports ||", "| One Fair Daughter || Warwick Buckland || Alice De Winton, Chrissie White, Jamie Darling || Drama ||", "| The Vicar of Wakefield || Frank Wilson || Chrissie White, Violet Hopson, Harry Royston || Drama ||", "| The Girl Who Lived in Straight Street || Warwick Buckland || Stewart Rome, Alma Taylor, Chrissie White || Drama || ", "| The Man with the Scar || Frank Wilson || Stewart Rome, Chrissie White, Lionelle Howard || Crime ||", "| The Nightbirds of London || Frank Wilson || Chrissie White, Violet Hopson, Stewart Rome || Crime ||", "| Sweet Lavender || Cecil M. Hepworth || Henry Ainley, Chrissie White, Alma Taylor || Romance ||", "| A Bunch of Violets || Frank Wilson || Chrissie White, Gerald Lawrence, Violet Hopson || Drama ||", "| The Blindness of Fortune || Frank Wilson || Chrissie White, Lionelle Howard, Violet Hopson || Drama ||", "| Broken Threads || Henry Edwards || Chrissie White, A.V. Bramble || Drama ||", "| The Eternal Triangle || Frank Wilson || Chrissie White, Lionelle Howard, Stewart Rome || Romance ||", "| Her Marriage Lines || Frank Wilson || Chrissie White, Lionelle Howard, Stewart Rome || Crime ||", "| The Man Behind 'The Times' || Frank Wilson || Chrissie White, Lionelle Howard, Stewart Rome || Drama ||", "| The Hanging Judge || Henry Edwards || Chrissie White, Randle Ayrton || Drama ||", "| Towards the Light || Henry Edwards || Henry Edwards, Chrissie White || Drama ||", "| Broken in the Wars || Cecil Hepworth || Henry Edwards, Chrissie White, Alma Taylor || Drama ||", "|City of Beautiful Nonsense||Henry Edwards||Chrissie White, Henry Edwards||Drama||", "| His Dearest Possession || Henry Edwards || Henry Edwards, Chrissie White, John MacAndrews || Drama ||", "|Possession||Henry Edwards||Henry Edwards, Chrissie White||Romance||"]}, {"page": "List of British films of 1933", "response": ["|General John Regan || Henry Edwards || Henry Edwards, Chrissie White || Comedy ||"]}, {"page": "List of British films of 1930", "response": ["|Call of the Sea||Leslie S. Hiscott||Chrissie White, Henry Edwards, Chili Bouchier||Drama||"]}, {"page": "Henry Edwards (actor)", "response": ["Henry Edwards (18 September 1882 – 2 November 1952) was an English actor and film director. He appeared in 81 films between 1915 and 1952. He also directed 67 films between 1915 and 1937. Edwards was married to actress Chrissie White, who appeared in 20 of his films. The couple's daughter, Henryetta Edwards, also appeared in his films. He was born in Weston-super-Mare, Somerset and died in Chobham, Surrey."]}, {"page": "List of English people", "response": ["* Chrissie White (1895–1989)"]}, {"page": "Call of the Sea", "response": ["*Chrissie White as Iris Tares"]}, {"page": "Wild Heather", "response": ["Wild Heather is a 1921 British drama film directed by Cecil Hepworth and starring Chrissie White, Gerald Ames, James Carew and George Dewhurst.https://www.imdb.com/title/tt0327249/ It was based on the 1917 play Wild Heather by Dorothy Brandon.BFI.org", "*Chrissie White as \"Wild Heather\" Boyd"]}, {"page": "The Amazing Quest of Mr. Ernest Bliss", "response": ["* Chrissie White as Frances Clayton"]}, {"page": "The City of Beautiful Nonsense (1919 film)", "response": ["City of Beautiful Nonsense is a 1919 British silent film drama directed by Henry Edwards, who also starred in the film with Chrissie White.  The film is based on the best-selling 1909 novel of the same name by E. Temple Thurston and is a tale of a woman intending to marry for financial gain and security, who realises at the last minute that to be true to herself and to have the prospect of a happy future she must instead marry for love.  A sound version of the same story was made in 1935 by Adrian Brunel.", "* Chrissie White as Jill Dealtry"]}, {"page": "Lily of the Alley", "response": ["Lily of the Alley is a 1924 British silent film drama directed by Henry Edwards, who also starred in the film with his wife Chrissie White.  Lily of the Alley was filmed in 1922 and given trade showings in early 1923, but its general release to cinemas was delayed until February 1924 due to various problems within the British film industry at the time.", "* Chrissie White as Lily"]}, {"page": "Barnaby Rudge (film)", "response": ["* Chrissie White as Dolly Varden"]}, {"page": "General John Regan (1933 film)", "response": ["General John Regan is a 1933 British comedy film directed by Henry Edwards and starring Edwards, Chrissie White and Ben Welden.BFI.org It is an adaptation of the 1913 play General John Regan by George A. Birmingham. It was a quota film made at British and Dominion Studios, Elstree, for release by Paramount.Chibnall p.272", "* Chrissie White as Moya Kent"]}, {"page": "General John Regan (play)", "response": ["The play has been adapted to film several times. In 1921 a silent version General John Regan was made. In 1933 a sound version General John Regan was made starring Henry Edwards and Chrissie White."]}, {"page": "Violet Hopson", "response": ["Her first British film was Mr Tubby's Triumph made in 1910. From 1912 she worked for Cecil Hepworth, along with Alma Taylor, Chrissie White, James Carew, Gerald Ames and John MacAndrews. Hepworth famously promoted her as a \"Dear Delightful Villaness.\"Brian McFarlane(2003) The Encyclopedia of British Film p. 318, BFI Methuen, "]}, {"page": "The Hanging Judge (film)", "response": ["The Hanging Judge is a 1918 British silent drama film directed by Henry Edwards and starring Edwards, Chrissie White and Hamilton Stewart.BFI.org Its plot concerns the son of a notorious judge, who is put on trial for murder. It was based on a play by Tom Gallon and Leon M. Lion.", "* Chrissie White - Molly"]}, {"page": "His Dearest Possession", "response": ["His Dearest Possession is a 1919 British drama film directed by Henry Edwards and starring Edwards, Chrissie White and John MacAndrews. It was based on a story by E. Temple Thurston. The film follows an artist who falls in love with a woman and gives up painting in order to get a more secure job.", "* Chrissie White - Red Emma Lobb"]}, {"page": "A Temporary Vagabond", "response": ["A Temporary Vagabond is a 1920 British silent comedy film directed by Henry Edwards and starring Edwards, Chrissie White and Stephen Ewart.", "* Chrissie White - Peggie Hurst"]}, {"page": "Aylwin (film)", "response": ["Aylwin is a 1920 British silent drama film directed by Henry Edwards and starring Henry Edwards, Chrissie White and Gerald Ames.  It is based on Theodore Watts-Dunton's 1898 novel of the same name.BFI.org", "* Chrissie White - Winifred Wynne"]}, {"page": "The Lunatic at Large", "response": ["The Lunatic at Large is a 1921 British silent comedy film directed by Henry Edwards and starring Edwards, Chrissie White and Gwynne Herbert.BFI.org The screenplay concerns an aristocratic matron who attempts to arrange a suitable marriage for her daughter. It is based on the novel of the same title by J. Storer Clouston. It was remade as a 1927 American film of the same title.Low p.405", "* Chrissie White as Lady Irene"]}, {"page": "John Forrest Finds Himself", "response": ["John Forrest Finds Himself is a 1920 British silent romance film directed by Henry Edwards and starring Edwards, Chrissie White and Gerald Ames.BFI.org", "* Chrissie White - Joan Grey "]}, {"page": "The Kinsman", "response": ["The Kinsman is a 1919 British silent comedy film directed by Henry Edwards and starring Edwards, James Carew and Chrissie White.The Kinsman (1920) BFI", "* Chrissie White - Pamela Blois"]}, {"page": "Possession (1919 film)", "response": ["Possession is a 1919 British silent romance film directed by Henry Edwards and starring Edwards, Chrissie White and Gerald Ames. It is an adaptation of the 1897 novel Phroso: A Romance by Anthony Hope.", "* Chrissie White - Valerie Sarton "]}, {"page": "Boden's Boy", "response": ["Boden's Boy is a 1923 British romance film directed by Henry Edwards and starring Edwards, Chrissie White, and Francis Lister.BFI.org It was based on a novel by Tom Gallon.", "* Chrissie White as Barbara Pilgrim "]}, {"page": "Simple Simon (1922 film)", "response": ["Simple Simon is a 1922 British romance film directed by Henry Edwards and starring Edwards, Chrissie White and Mary Dibley. A cynical journalist attempts to seclude a naive monk, but he is rescued by a beautiful village girl.", "* Chrissie White - Rosemary Ruth "]}, {"page": "Broken Threads", "response": ["Broken Threads is a 1917 British silent drama film directed by Henry Edwards and starring Edwards, Chrissie White and A.V. Bramble.BFI.org", "* Chrissie White - Helen Desmond"]}, {"page": "The Failure (1917 film)", "response": ["The Failure is a 1917 British silent crime film directed by Henry Edwards and starring Edwards, Chrissie White and Lionelle Howard.BFI.org", "* Chrissie White - Margaret Gilder"]}, {"page": "Towards the Light (1918 film)", "response": ["Towards the Light is a 1918 British silent drama film directed by Henry Edwards and starring Edwards, Chrissie White and A.V. Bramble.BFI.org", "* Chrissie White - Annie Wilton"]}, {"page": "The Poet's Windfall", "response": ["The Poet's Windfall is a 1918 British silent drama film directed by Henry Edwards and starring Edwards, John MacAndrews, and Chrissie White.BFI.org", "* Chrissie White as The Girl"]}, {"page": "The World of Wonderful Reality", "response": ["The World of Wonderful Reality is a 1924 British silent romance film directed by Henry Edwards and starring Edwards, Chrissie White, and James Lindsay.BFI Database entry It was based on a story by E. Temple Thurston.", "* Chrissie White as Jill Dealtry "]}, {"page": "The Bargain (1921 film)", "response": ["The Bargain is a 1921 British silent crime film directed by Henry Edwards and starring Edwards, Chrissie White and Rex McDougall.BFI.org It was based on a play by Edward Irwin.", "* Chrissie White – Mary "]}, {"page": "Broken in the Wars", "response": ["Broken in the Wars is a 1919 British silent drama film directed by Cecil Hepworth and starring Henry Edwards, Chrissie White and Alma Taylor.BFI.org The Pensions Minister John Hodge appeared in the film to promote the King's Fund, which supported recently demobilised ex-servicemen. The fund had been criticized by veterans' organisations on the grounds that it was a government backed charity providing relief that should have been provided by the state. The film attempts to assure audiences that the King's Fund is not a charity. A cobbler returning from the First World War is persuaded by his aristocratic former employer and the Pensions Minister to receive a grant that will enable him to open his own shop.Bamford p.5-6 It was made by Hepworth Picture Plays. The film is available to view online in the UK via the BFI Player", "* Chrissie White - Mrs. Joe"]}, {"page": "List of Elstree Studios productions", "response": ["| General John Regan || Comedy || Henry Edwards || Henry Edwards, Chrissie White, Ben Welden"]}, {"page": "What's the Use of Grumbling", "response": ["What's the Use of Grumbling is a 1918 British silent drama film directed by Henry Edwards and starring Basil Gill, Gwynne Herbert and Chrissie White.BFI.org It was produced by Cecil Hepworth for the British Ministry of Information as propaganda during the First World War.", "* Chrissie White as The Girl"]}, {"page": "Hepworth Pictures", "response": ["Around the time of the First World War, the company gradually switched from traditional short films to the feature films that increasingly dominated the world market.  It also developed many early stars of British cinema, including Alma Taylor, Stewart Rome, Violet Hopson, Chrissie White, Henry Edwards and Gerald Ames."]}, {"page": "Published work on cinema by Denis Gifford", "response": ["* Chrissie White interview (1968) - audio recorded interview."]}, {"page": "The City of Beautiful Nonsense (novel)", "response": ["The first film based on the novel was The City of Beautiful Nonsense, a silent movie released in 1919, which featured Henry Edwards, Chrissie White and Henry Vibart"]}, {"page": "List of lost silent films (1920–1924)", "response": ["| The Amazing Quest of Mr. Ernest Bliss || Henry Edwards || Henry Edwards, Chrissie White || On the BFI \"75 Most Wanted\" lost film list. The last copy is thought to have been destroyed in a bonfire during World War II by Edwards and White as storing it posed a fire hazard. || ", "|| Lily of the Alley || Henry Edwards || Henry Edwards, Chrissie White || On the BFI 75 Most Wanted missing films. || ", "| The City of Beautiful Nonsense || Henry Edwards || Henry Edwards, Chrissie White, James Lindsay || The last copy is thought to have been destroyed in a bonfire during World War II by Edwards and White as storing it posed a fire hazard. || ", "| The World of Wonderful Reality || Henry Edwards || Henry Edwards, Chrissie White, James Lindsay, Henry Vibart || Last copy is thought to have been destroyed in a bonfire during World War II by Edwards and White as storing it posed a fire hazard. || "]}, {"page": "List of British films of 1920", "response": ["|The Amazing Quest of Mr. Ernest Bliss||Henry Edwards||Henry Edwards, Chrissie White||Comedy||", "|Aylwin||Henry Edwards||Henry Edwards, Chrissie White||Drama||", "|John Forrest Finds Himself||Henry Edwards||Henry Edwards, Chrissie White||Romance||", "|A Temporary Vagabond||Henry Edwards||Henry Edwards, Chrissie White||Comedy||"]}, {"page": "List of British films of 1921", "response": ["|The Bargain||Henry Edwards|| Henry Edwards, Chrissie White|| Comedy||", "|The Lunatic at Large||Henry Edwards||Henry Edwards, Chrissie White||Comedy||", "|Tit for Tat||Henry Edwards||Henry Edwards, Chrissie White||Comedy||", "|Wild Heather||Cecil Hepworth ||Chrissie White, Gerald Ames ||Drama ||"]}]}}