{"wiki_id": "http://www.wikidata.org/entity/Q274046", "itemLabel": "Victoria Hamilton", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Victoria_Hamilton", "wikipedia_page": {"main": "Victoria Hamilton (born 5 April 1971) is an English actress.  \nAfter training at the London Academy of Music and Dramatic Art, Hamilton began her career in classical theatre, appearing in productions with the Royal Shakespeare Company and the National Theatre. In 2002, she appeared in the London stage play A Day in the Death of Joe Egg alongside Clive Owen and later Eddie Izzard.\nShe made her Broadway debut in 2003 when the production moved to New York, where she earned a Tony Award nomination. She won the Critics' Circle Theatre Award and Evening Standard Theatre Award for her performance in the play Suddenly, Last Summer, held in 2004 at the Lyceum Theatre.\nHamilton has often worked in the costume drama genre. During the 1990s, she had supporting roles in three Jane Austen adaptations: the 1995 serial Pride and Prejudice, the 1995 film Persuasion, and the 1999 film Mansfield Park.\nHamilton won the role of Queen Victoria in the 2001 television production, Victoria & Albert, portraying the monarch in her early years. From 2008 to 2011, Hamilton was a cast member in the BBC1 series Lark Rise to Candleford. From 2016-17, she portrayed Queen Elizabeth The Queen Mother in the Netflix historical drama series The Crown.", "link_mentions": [{"page": "April 5", "response": ["*  1971   – Victoria Hamilton, English actress"]}, {"page": "The Importance of Being Earnest", "response": ["On 13 December 2000, BBC Radio 3 broadcast a new adaptation directed by Howard Davies starring Geraldine McEwan as Lady Bracknell, Simon Russell Beale as Jack Worthing, Julian Wadham as Algernon Moncrieff, Geoffrey Palmer as Canon Chasuble, Celia Imrie as Miss Prism, Victoria Hamilton as Gwendolen and Emma Fielding as Cecily, with music composed by Dominic Muldowney. The production was released on audio cassette."]}, {"page": "Queen Elizabeth The Queen Mother", "response": ["Her habits were parodied by the satirical 1980s television programme Spitting Image. This was the first satirical depiction on television; the makers initially demurred from featuring her, fearing that it would be considered off-limits by most of the viewing public. In the end, she was portrayed as a perpetually tipsy Beryl Reid soundalike. She was portrayed by Juliet Aubrey in Bertie and Elizabeth, Sylvia Syms in The Queen, Natalie Dormer in W.E., Olivia Colman in Hyde Park on Hudson, Victoria Hamilton (Seasons 1 and 2) and Marion Bailey (Seasons 3 and 4) in The Crown, and in The King's Speech by Helena Bonham Carter, who was nominated for an Academy Award for Best Supporting Actress and won a BAFTA Award for Best Actress in a Supporting Role for her portrayal."]}, {"page": "Goodbye, Mr. Chips", "response": ["A television film adaptation was produced by STV Studios (then known as \"SMG TV Productions\") in 2002. It aired on the ITV Network in Britain and on PBS's Masterpiece Theatre in the United States. It starred Martin Clunes and Victoria Hamilton with Henry Cavill, William Moseley, Oliver Rokison and Harry Lloyd.. Retrieved 11 April 2011"]}, {"page": "A Severed Head", "response": ["A five-part adaptation of A Severed Head by Stephen Wakelam appeared on the BBC Radio 4 series 15 Minute Drama in August 2015. The actors included Julian Rhind-Tutt as Martin Lynch-Gibbon, Helen Schlesinger as Honor Klein, and Victoria Hamilton as Antonia Lynch-Gibbon."]}, {"page": "Wimbledon, London", "response": ["*Victoria Hamilton (born 1971), actress"]}, {"page": "Eddie Izzard", "response": ["She portrayed comedian Lenny Bruce in the 1999 production of Julian Barry's 1971 play Lenny. In 2001, she replaced Clive Owen in Peter Nichols' 1967 play A Day in the Death of Joe Egg at the Comedy Theatre. Izzard and Victoria Hamilton repeated their lead roles when the show was brought to Broadway in 2003 in the Roundabout Theatre Company production. The revival received four Tony Award nominations, including Best Revival of a Play, Best Leading Actor, and Best Leading Actress for its stars Izzard and Hamilton in their Broadway debuts, and Best Direction for Laurence Boswell. In June 2010, she replaced James Spader in the role of Jack Lawson in David Mamet's play Race on Broadway."]}, {"page": "1995 in film", "response": ["| Persuasion || Sony Pictures Classics || Roger Michell (director); Nick Dear (screenplay); Amanda Root, Ciaran Hinds, Susan Fleetwood, Corin Redgrave, Fiona Shaw, John Woodvine, Phoebe Nicholls, Samuel West, Sophie Thompson, Judy Cornwell, Simon Russell Beale, Felicity Dean, Roger Hammond, Emma Roberts, Victoria Hamilton, Robert Glenister, Richard McCabe, Helen Schlesinger, Jane Wood, David Collings, Darlene Johnson, Cinnamon Faye, Isaac Maxwell-Hunt, Roger Llewellyn, Sally George || Period, Drama || Live action"]}, {"page": "1999 in film", "response": ["| Mansfield Park || Miramax Films || Patricia Rozema (director/screenplay); Frances O'Connor, Jonny Lee Miller, Embeth Davidtz, James Purefoy, Alessandro Nivola, Harold Pinter, Lindsay Duncan, Victoria Hamilton, Justine Waddell, Hugh Bonneville, Sheila Gish, Charles Edwards, Hilton McRae, Sophia Myles, Anna Popplewell, Hannah Taylor-Gordon || Comedy, Drama || Live action"]}, {"page": "Suddenly Last Summer", "response": ["Michael Grandage directed a 2004 stage production at the Lyceum Theatre, Sheffield, featuring Diana Rigg as Mrs. Venable and Victoria Hamilton as Catharine. The production toured nationally before transferring to the Albery Theatre, London. The production received enthusiastic reviews, and Hamilton won the Evening Standard Award for Best Actress in a Play for her performance."]}, {"page": "Pride and Prejudice (1995 TV series)", "response": ["* Victoria Hamilton as Mrs Forster"]}, {"page": "Almeida Theatre", "response": ["* Albion by Mike Bartlett, directed by Rupert Goold, starring Victoria Hamilton (2017) "]}, {"page": "Evening Standard Theatre Awards", "response": ["* 2004 – Victoria Hamilton for Suddenly, Last Summer"]}, {"page": "Critics' Circle Theatre Award", "response": ["|Victoria Hamilton", "|Victoria Hamilton", "|Victoria Hamilton", "|Victoria Hamilton"]}, {"page": "A Day in the Death of Joe Egg", "response": ["A revival in the West End opened in October 2001 at the New Ambassadors Theatre, starring Clive Owen and Victoria Hamilton and was directed by Laurence Boswell. This production transferred to the Comedy Theatre in December 2001, with Eddie Izzard replacing Owen.Loveridge, Lizzie. \"review. 'A Day in the Death of Joe Egg' \" curtainup.com, October 3, 2001 The same production opened on Broadway, produced by Roundabout Theatre, in March 2003 at the American Airlines Theatre and played for 69 performances. Directed by Lawrence Boswell, the play starred Eddie Izzard and Victoria Hamilton.Hernandez, Ernio. Dressed to Kill Broadway: \"Eddie Izzard Begins 'A Day in the Death of Joe Egg', March 14\" playbill.com, March 13, 2003", "Nichols adapted A Day in the Death of Joe Egg for two films, first in 1970, and again in 2002. The 1970 adaptation, which was not released until 1972, was directed by Peter Medak, starring Alan Bates, Janet Suzman, Joan Hickson, Peter Bowles and Elizabeth Robillard. A 2002 television version was directed by Robin Lough, with stars Eddie Izzard, Victoria Hamilton, Prunella Scales, and Robin Weaver."]}, {"page": "Theatre World Award", "response": ["*Victoria Hamilton –  A Day in the Death of Joe Egg"]}]}}