{"wiki_id": "http://www.wikidata.org/entity/Q27453296", "itemLabel": "Seonaid McIntosh", "itemDescription": "sport shooter", "wikipedia_url": "https://en.wikipedia.org/wiki/Seonaid_McIntosh", "wikipedia_page": {"main": "Seonaid McIntosh (born 15 March 1996) is a British sports shooter who became the World Champion at the 2018 ISSF World Shooting Championships in the 50m Prone Rifle event. In 2019 she became Britain's most successful female Rifle Shooter of all time, winning three World Cup medals (including the first World Cup Gold to be won by a British Woman), becoming the first British Woman to rank World #1 for the 50m Rifle Three Position event and becoming European Champion in the 300m Rifle Prone event with an equal World Record score. McIntosh is the daughter of four-times Commonwealth Games medalist Shirley McIntosh and Donald McIntosh, and younger sister of British Olympic Shooter Jennifer McIntosh. In 2017 she won the Women's 3x20 Rifle event at the 2017 European Shooting Championships in Baku, becoming European Champion. Sister Jennifer had also won the Women's 50m Prone Rifle earlier in the week, becoming European Champion in that event.", "link_mentions": [{"page": "March 15", "response": ["*1996 – Seonaid McIntosh, Scottish sports shooter"]}, {"page": "Dollar Academy", "response": ["*Seonaid McIntosh, Rifle shooter, double Commonwealth Games Medallist and double European Champion"]}, {"page": "Meadowbank Stadium", "response": ["Meadowbank housed both a 10metre airgun range and a 50metre indoor range for smallbore rifle shooting in the 1970s and 1980s. The range was closed in 1990 but refurbished in 2014 ahead of the 2014 Commonwealth Games in Glasgow for use as a training venue by Scottish Target Shooting's High Performance Squad. The range remained in use until the site's closure in 2017. The new Meadowbank plans do not include facilities for target sports despite Edinburgh athlete Seonaid McIntosh having earned one of TeamGB's first quota places to the 2020 Summer Olympics."]}, {"page": "List of professional sports families", "response": ["|Jennifer McIntosh, Seonaid McIntosh"]}, {"page": "ISSF 50 meter rifle prone", "response": ["| Great BritainSeonaid McIntoshJennifer McIntoshZoe Anne Bruce"]}, {"page": "2019 in sports", "response": ["** 50m Rifle Three Positions winners:  Petar Gorša (m) /  Seonaid McIntosh (f)"]}, {"page": "1996 in Scotland", "response": ["* 15 March – Seonaid McIntosh, sport shooter"]}, {"page": "Jennifer McIntosh", "response": ["Jennifer McIntosh (born 17 June 1991) is a Scottish sports shooter and fantasy author. McIntosh is the daughter of four-times Commonwealth Games medalist Shirley McIntosh and Donald McIntosh, and the elder sister of British shooter Seonaid McIntosh.", "In 2017 at the 48th Grand Prix of Liberation in Plzeň, McIntosh took Individual Bronze in the Women's 3x20 rifle with a qualification score of 589, one point off her PB and the British Record. Together with sister Seonaid McIntosh and Katie Gleeson the team won Silver as well as setting a new British Team Record of 1759ex1800. In the Prone 50m Rifle she won another Team Silver whilst setting another British Team Record of 1866.7 with Katie Gleeson and Lina Jones.", "Plzeň marked the start of a winning streak for McIntosh and the GB Women's Rifle Team. At the International Shooting Competition of Hannover in May, McIntosh won individual Gold in the 10M Air Rifle, as well winning Team Golds in all three Women's Rifle Events with Seonaid McIntosh (who won her first Senior Gold medal in the Women's 3x20 50m Rifle) and Katie Gleeson (who took Bronze in the Prone 50m Rifle).", "In July 2018 McIntosh was selected as a member of the GB Team to the 2018 ISSF World Shooting Championships, where she won a bronze medal in the Women's 50m Prone Rifle Team event with teammates Zoe Bruce and Seonaid McIntosh.50 m team rifle prone results In the Individual Women's Prone Rifle event, Jen placed 26th. Her sister Seonaid won the event, becoming World Champion."]}, {"page": "Great Britain at the 2015 European Games", "response": ["|align=left|Seonaid McIntosh"]}, {"page": "Scotland at the 2014 Commonwealth Games", "response": ["|align=left|Seonaid McIntosh"]}, {"page": "Shirley McIntosh", "response": ["McIntosh is the mother of five-times Scottish Commonwealth Games medalist Jennifer McIntosh and 2014 Commonwealth Games competitor Seonaid McIntosh."]}, {"page": "2019 ISSF World Cup", "response": ["|/ Seonaid McIntosh/Yu Haonan(GBR/CHN)"]}, {"page": "2017 European Shooting Championships", "response": ["|Seonaid McIntoshJennifer McIntoshKatie Gleeson"]}, {"page": "Scotland at the 2018 Commonwealth Games", "response": ["| Seonaid McIntosh", "| Seonaid McIntosh", "|align=left|Seonaid McIntosh", "|align=left|Seonaid McIntosh", "|align=left|Seonaid McIntosh"]}, {"page": "2017 Commonwealth Shooting Championships", "response": ["|Seonaid McIntosh", "|Seonaid McIntosh"]}, {"page": "Shooting at the 2020 Summer Olympics – Qualification", "response": ["|  || Seonaid McIntosh || Seonaid McIntosh", "|  ||  || Seonaid McIntosh"]}, {"page": "Shooting at the 2020 Summer Olympics – Women's 50 metre rifle three positions", "response": ["| 14 || align=left|Seonaid McIntosh || align=left| || 390 || 391 || 386 || 1167-55x ||"]}, {"page": "Shooting at the 2020 Summer Olympics – Women's 10 metre air rifle", "response": ["| 12 || align=left|Seonaid McIntosh || align=left| || 104.3 || 104.4 || 104.2 || 105.6 || 105.2 || 103.5 || 627.2 ||"]}, {"page": "Shooting at the 2018 Commonwealth Games – Women's 50 metre rifle three positions", "response": ["| 6 ||align=left|Seonaid McIntosh ||align=left|  || 95 || 97 || 192 || 99 || 98 || 197 || 289 || 93 || 94 || 187 || 576-21x ", "|  ||align=left|Seonaid McIntosh ||align=left|  || 50.4 || 49.3 || 99.7 || 50.5 || 150.2 || 50.7 || 51.8 || 102.5 || 52.0 || 154.5 || 304.7 || 50.3 || 50.4 || 100.7 || 405.4 || 9.6 || 110.3 || 415.0 || 9.7 || 120.0 || 424.7 || 9.4 || 129.4 || 434.1 || 10.5 || 139.9 || 444.6 || - || 139.9 || 444.6"]}, {"page": "Great Britain at the 2020 Summer Olympics", "response": ["|align=left rowspan=2|Seonaid McIntosh"]}, {"page": "2018 ISSF World Shooting Championships", "response": ["|Seonaid McIntoshJennifer McIntoshZoe Bruce || 1850.6"]}, {"page": "Zoe Bruce", "response": ["In May 2017, Bruce won the Women's 50m prone rifle at the International Shooting Competition of Hannover, setting a new British and English Record of 624.3.-  The British record was broken less than a month later by the Scot Seonaid McIntosh, but Bruce retains the English record. In July 2018, she was selected as a member of the Great Britain team to the 2018 ISSF World Shooting Championships where she won a bronze medal in the Women's 50m prone rifle team event with her teammates Jennifer McIntosh and Seonaid McIntosh.- 50 m team rifle prone results- - - -  This was the first Senior World Championship medal won by Great Britain in a 50 metre rifle event since 1982."]}, {"page": "Shooting at the 2019 European Games – Women's 50 metre rifle three positions", "response": ["| 6 || align=left|Seonaid McIntosh || align=left| || 390 || 390 || 383 || 1163-60x || Q"]}, {"page": "Shooting at the 2019 European Games – Women's 10 metre air rifle", "response": ["| 17 || align=left|Seonaid McIntosh || align=left| || 105.8 || 104.6 || 104.1 || 104.3 || 102.3 || 103.4 || 624.5 ||"]}, {"page": "Donald McIntosh (sport shooter)", "response": ["Donald McIntosh is a Scottish rifle shooter and coach from Elgin, born July 1966. He represented Scotland for the first time in 1989 at the Commonwealth Shooting Federation Championships in Wales. He has been capped 59 times, making him the seventh most capped Scottish shooter. He represented Scotland in the 2002 Manchester Commonwealth Games where he was unable to replicate his previous gold medal success in the Commonwealth Shooting Federation Championships. Donald began his international coaching career at the 2003 World University Shooting Championships and continues to coach his younger daughter Seonaid McIntosh and coached his older daughter Jennifer McIntosh until her retirement in 2018. He is the owner of Edinkillie Sports Services. "]}, {"page": "Issy Bailey", "response": ["When the teams were announced for the postponed 2020 Summer Paralympics in Tokyo, Bailey was included after her ninth-place finish in Sydney at the 2019 World Championships. The other British women shooters bound for Tokyo are Olympians Kirsty Hegarty (women’s Olympic trap) and Seonaid McIntosh and Paralympians Lorraine Lambert and Lesley Stewart, but Bailey will be the only British pistol shooter. She competed in the 10m air pistol SH1 and mixed 25m pistol SH1. She narrowly missed out on making the finals despite a personalbest performance."]}]}}