{"wiki_id": "http://www.wikidata.org/entity/Q2744810", "itemLabel": "James Esdaile", "itemDescription": "British hypnotist", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Esdaile", "wikipedia_page": {"main": "James Esdaile, M.D., E.I.C.S., Bengal (1808–1859), an Edinburgh trained Scottish surgeon, who served for twenty years with the East India Company, is a notable figure in the history of “animal magnetism\" and, in particular, in the history of general anaesthesia.", "link_mentions": [{"page": "Hypnosis", "response": ["Before long, hypnotism started finding its way into the world of modern medicine. The use of hypnotism in the medical field was made popular by surgeons and physicians like Elliotson and James Esdaile and researchers like James Braid who helped to reveal the biological and physical benefits of hypnotism.Book: Hypnosis Beginners Guide: Learn How To Use Hypnosis To Relieve Stress, Anxiety, Depression And Become Happier According to his writings, Braid began to hear reports concerning various Oriental meditative practices soon after the release of his first publication on hypnotism, Neurypnology (1843). He first discussed some of these oriental practices in a series of articles entitled Magic, Mesmerism, Hypnotism, etc., Historically & Physiologically Considered. He drew analogies between his own practice of hypnotism and various forms of Hindu yoga meditation and other ancient spiritual practices, especially those involving voluntary burial and apparent human hibernation. Braid's interest in these practices stems from his studies of the Dabistān-i Mazāhib, the \"School of Religions\", an ancient Persian text describing a wide variety of Oriental religious rituals, beliefs, and practices."]}, {"page": "James Braid (surgeon)", "response": ["Braid was apprenticed to the Leith surgeons ThomasThomas Anderson (1743—1813), M.D. (Edinburgh, 1773), F.R.C.S. (Edin.), surgeon, of Quality Street, Leith; also a Founding Member of the Royal Society of Edinburgh. One of his grandsons, also Thomas Anderson (1819—1874), was an eminent chemist. and Charles AndersonCharles Anderson (1772—1855), M.D. (Edinburgh 1793), F.R.C.S. (Edin.), surgeon, of Quality Street, Leith; also, a Founding Member of the Wernerian Natural History Society; the father of Thomas Anderson (chemist). (i.e., both father and son). As part of that apprenticeship, Braid also attended the University of Edinburgh from 1812 to 1814,The medical faculty of University of Edinburgh was also the alma mater of Thomas Brown (1778—1820), John Elliotson (1791—1868), James Esdaile (1808—1859), William Benjamin Carpenter (1813—1885), and John Milne Bramwell (1852—1925). where he was also influenced by Thomas Brown, M.D. (1778—1820), who held the chair of Moral Philosophy at Edinburgh from 1808 to 1820.Yeates (2018a), pp,21–22."]}, {"page": "History of psychology", "response": ["Although disputed, the \"magnetic\" tradition continued among Mesmer's students and others, resurfacing in England in the 19th century in the work of the physician John Elliotson (1791–1868), and the surgeons James Esdaile (1808–1859), and James Braid (1795–1860) (who reconceptualized it as property of the subject's mind rather than a \"power\" of the Mesmerist's, and relabeled it \"hypnotism\"). Mesmerism also continued to have a strong social (if not medical) following in England through the 19th century (see Winter, 1998). Faria's approach was significantly extended by the clinical and theoretical work of Ambroise-Auguste Liébeault and Hippolyte Bernheim of the Nancy School. Faria's theoretical position, and the subsequent experiences of those in the Nancy School made significant contributions to the later autosuggestion techniques of Émile Coué.See Yeates, Lindsay B. (2016a), \"Émile Coué and his Method (I): The Chemist of Thought and Human Action\", Australian Journal of Clinical Hypnotherapy & Hypnosis, Volume 38, No.1, (Autumn 2016), pp.3-27; (2016b), \"Émile Coué and his Method (II): Hypnotism, Suggestion, Ego-Strengthening, and Autosuggestion\", Australian Journal of Clinical Hypnotherapy & Hypnosis, Volume 38, No.1, (Autumn 2016), pp.28-54; and (2016c), \"Émile Coué and his Method (III): Every Day in Every Way\", Australian Journal of Clinical Hypnotherapy & Hypnosis, Volume 38, No.1, (Autumn 2016), pp.55-79. It was adopted for the treatment of hysteria by the director of Paris's Salpêtrière Hospital, Jean-Martin Charcot (1825–1893)."]}, {"page": "James Esdale", "response": ["#REDIRECT James Esdaile"]}, {"page": "Esdale", "response": ["#REDIRECT James Esdaile"]}, {"page": "John Elliotson", "response": ["He was a private pupil of the rector of St Saviours, Southwark, and went on to study medicine at the University of Edinburgh,The University of Edinburgh was also the alma mater of James Braid and James Esdaile. from 1805 to 1810 — where he was influenced by Thomas Brown, M.D. (1778–1820) — and then at Jesus College, Cambridge, from 1810 to 1821), from both of which institutions he took the degree of M.D., and subsequently in London at St Thomas' and Guy's hospitals. In 1831 he was elected professor of the principles and practice of physic in London University (now University College London), and in 1834 he became physician to University College Hospital.For a detailed and comprehensive description of his rather unusual medical education, see the transcript of the evidence that Elliotson gave to the House of Commons' Select Committee on Medical Education chaired by Henry Warburton on 24 March 1834: at Warburton (1834), pp. 104–117."]}, {"page": "History of hypnosis", "response": ["=== James Esdaile ===", "James Esdaile (1805–1859) reported on 345 major operations performed using mesmeric sleep as the sole anesthetic in British India. The development of chemical anesthetics soon saw the replacement of hypnotism in this role.", "He placed great stress on what he called \"the Esdaile state\" or the \"hypnotic coma,\" which, according to Elman, had not been deliberately induced since Scottish surgeon James Esdaile last attained it. This was an unfortunate and historically inaccurate choice of terminology on Elman's part. Esdaile never used what we now call hypnosis even on a single occasion; he used something loosely resembling mesmerism (also known as animal magnetism)."]}, {"page": "John Milne Bramwell", "response": ["His father had seen James Esdaile (1808–1859) at work and, as a child, Bramwell had seen his father replicate Esdaile's mesmeric experiments."]}, {"page": "Stage hypnosis", "response": ["Such arguments originate in the work of James Esdaile at a medical mission in India, recounted in his book of 1847. This was before the concept of \"hypnotism\" (only recently promoted by Braid in 1843) had spread and Esdailes's work was still referred to as \"Mesmerism\". Whilst Esdaile claimed his patients felt no pain observers on behalf of an independent commission of enquiry for the Bengal government reported scenes of those undergoing such operations writhing in agony. Regarding more recent claims of painless surgery, Barber, among others, has pointed out that detail in accounts of such surgery admit that patients are, even though not unconscious, rendered stuporous by cocktails of anxiolytics. Moreover, the proportion of patients capable of undergoing such procedures (attaining sufficiently \"deep\" \"hypnosis\") is as small as the percentage of the population who are capable of undergoing surgery with neither chemical nor hypnotic assistance, inviting the suspicion that these groups of \"special\" patients overlap. Moreover, Barber also points out that invariably, cases of hypnotic surgery do use local anaesthetic at the area of incision, whilst internal organs are not capable of registering pain in response to a skilled cut rendering many such operations feasible without general anaesthetic, the role of hypnotic influence being essentially at an emotional or anxiolytic level. Furthermore, far from there being \"thousands\" of such cases of hypno-anaesthesia in surgery it remains sufficiently rare as to warrant the attention of news reports when it occurs. As rare, indeed, as the exceptional individuals able to undergo such surgery."]}, {"page": "Oriental hypnosis", "response": ["In the early 19th century Abbe Faria, Indo-Portuguese priest, and a contemporary of Mesmer introduced oriental hypnosis to Paris.History of hypnotherapy Later Dr. James Esdaile learned some trance techniques from Bengali Hindu fakirs and developed it as mesmeric anesthesia. Famous historian Will Durant writes in his book “The Story of civilizations”:", "* Mesmerism in India- James Esdaile "]}]}}