{"wiki_id": "http://www.wikidata.org/entity/Q274339", "itemLabel": "Gwen John", "itemDescription": "Welsh painter (1876-1939)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gwen_John", "wikipedia_page": {"main": "Gwendolen Mary John (22 June 1876 – 18 September 1939) was a Welsh artist who worked in France for most of her career. Her paintings, mainly portraits of anonymous female sitters, are rendered in a range of closely related tones. Although she was overshadowed during her lifetime by her brother Augustus John and her lover Auguste Rodin, her reputation has grown steadily since her death.\n\n", "link_mentions": [{"page": "D. H. Lawrence", "response": ["D. H. Lawrence had a lifelong interest in painting, which became one of his main forms of expression in his last years. His paintings were exhibited at the Warren Gallery in London's Mayfair in 1929. The exhibition was extremely controversial, with many of the 13,000 people visiting mainly to gawk. The Daily Express claimed, \"Fight with an Amazon represents a hideous, bearded man holding a fair-haired woman in his lascivious grip while wolves with dripping jaws look on expectantly, [this] is frankly indecent\". However, several artists and art experts praised the paintings. Gwen John, reviewing the exhibition in Everyman, spoke of Lawrence's \"stupendous gift of self-expression\" and singled out The Finding of Moses, Red Willow Trees and Boccaccio Story as \"pictures of real beauty and great vitality\". Others singled out Contadini for special praise. After a complaint, the police seized thirteen of the twenty-five paintings (including Boccaccio Story and Contadini). Despite declarations of support from many writers, artists and Members of Parliament, Lawrence was able to recover his paintings only by agreeing never to exhibit them in England again. The largest collection of the paintings is now at La Fonda de Taos hotel in Taos, New Mexico. Several others, including Boccaccio Story and Resurrection, are at the Humanities Research Centre of the University of Texas at Austin."]}, {"page": "List of Welsh people", "response": ["*Gwen John (1876–1939), painter"]}, {"page": "Augustus John", "response": ["Augustus Edwin John  (4 January 1878 – 31 October 1961) was a Welsh painter, draughtsman, and etcher. For a time he was considered the most important artist at work in Britain: Virginia Woolf remarked that by 1908 the era of John Singer Sargent and Charles Wellington Furse \"was over. The age of Augustus John was dawning.\"Virginia Woolf, Moments of Being: Autobiographical Writings, edited by Jeanne Schulkind, London: Pimlico (2002), p. 56. He was the younger brother of the painter Gwen John.", "Michael Holroyd published a biography of John in 1975 and it is a mark of the public's continued interest in the painter that Holroyd published a new version of the biography in 1996. A major exhibition, 'Gwen John and Augustus John,' was held at Tate Britain over the winter of 2004/5. According to the gallery's publicity, this exhibition revealed 'that although Augustus described himself and his sister as \"the same thing, really,\" their art developed in different directions. Augustus' work seems wildly exuberant against Gwen's more introverted approach, but both artists indicate a similar flight from the modern world into a realm of fantasy. The exhibition went on to the National Museum of Wales in Cardiff later in 2005. In 2018 Poole Museum in Dorset hosted the exhibition 'Augustus John: Drawn from Life,' which then went on to Salisbury Museum in 2019."]}, {"page": "Wales", "response": ["Welsh painters gravitated towards the art capitals of Europe. Augustus John and his sister Gwen John lived mostly in London and Paris. However, the landscapists Sir Kyffin Williams and Peter Prendergast lived in Wales for most of their lives, while remaining in touch with the wider art world. Ceri Richards was very engaged in the Welsh art scene as a teacher in Cardiff and even after moving to London. He was a figurative painter in international styles including Surrealism. Various artists have moved to Wales, including Eric Gill, the London-Welshman David Jones and the sculptor Jonah Jones. The Kardomah Gang was an intellectual circle centred on the poet Dylan Thomas and poet and artist Vernon Watkins in Swansea, which also included the painter Alfred Janes."]}, {"page": "Haverfordwest", "response": ["* Gwen John, artist, was born in Haverfordwest; her younger brother Augustus John, also an artist, was born in nearby Tenby and lived in Haverfordwest."]}, {"page": "Culture of Wales", "response": ["Perhaps the most famous Welsh painters, Augustus John and his sister Gwen John, mostly lived in London and Paris; however the landscapists Sir Kyffin Williams and Peter Prendergast remained living in Wales for most of their lives, though well in touch with the wider art world. Ceri Richards was very engaged in the Welsh art scene as a teacher in Cardiff, and even after moving to London; he was a figurative painter in international styles including Surrealism. Various artists have moved to Wales, including Eric Gill, the London-born Welshman David Jones, and the sculptor Jonah Jones. The Kardomah Gang was an intellectual circle centred on the poet Dylan Thomas and poet and artist Vernon Watkins in Swansea, which also included the painter Alfred Janes."]}, {"page": "List of British painters", "response": ["*Gwen John (1876–1939)"]}, {"page": "1906 in art", "response": ["* Gwen John begins modelling for Auguste Rodin."]}, {"page": "1904 in art", "response": ["* Gwen John – Dorelia in a Black Dress"]}, {"page": "Thérèse of Lisieux", "response": ["*Gwen John - \"Some of her final paintings were in fact of religious subjects [including] countless (over 700) tiny ink copies after a photograph of Thérèse of Lisieux and the saint's elder sister\" Alison Thomas, Portraits of Women, Gwen John and her Forgotten Contemporaries, Polity Press 1996, p.184"]}, {"page": "Margaret Forster", "response": ["Forster also wrote fictionalised biographies of the novelist William Makepeace Thackeray (1978) and the artist Gwen John (2006). Significant Sisters (1984) chronicled the growing feminist movement through the lives of eight pioneering British and American women: Caroline Norton, Elizabeth Blackwell, Florence Nightingale, Emily Davies, Josephine Butler, Elizabeth Cady Stanton, Margaret Sanger and Emma Goldman. Good Wives (2001) surveyed contemporary and historical women married to famous men, including Mary Livingstone, Fanny Stevenson, Jennie Lee and herself. Her other historical writings include Rich Desserts and Captain's Thin (1997), an account of the Carr's biscuit factory in Carlisle."]}, {"page": "Armory Show", "response": ["* Gwen John"]}, {"page": "Meudon", "response": ["* The painter Gwen John lived in Meudon from 1911 until just before her death in 1939."]}, {"page": "Anna Massey", "response": ["|Journey into the Shadows: Portrait of Gwen John", "|Gwen John"]}, {"page": "Tenby", "response": ["*Gwen John, artist"]}, {"page": "Barber Institute of Fine Arts", "response": ["The institute is located 5 km southwest of the city centre at the East Gate of the university campus and has one of the outstanding collections of art assembled in Britain in the 20th century, including works by Gwen John, André Derain, Fernand Léger, René Magritte and Egon Schiele. It was set up by Martha Constance Hattie Barber in memory of her husband Henry Barber, a wealthy property developer who made his fortune expanding Birmingham's sprawling suburbs. Lady Barber was a descendant of the old Worcestershire Onions family of bellows-makers and was an heiress in her own right."]}, {"page": "National Library of Wales", "response": ["The National Library of Wales has published a series of books about its history and collections, including manuscript catalogues, a bibliography of Welsh publications, Parish Registers of Wales, and academic studies of Gwen John, Kyffin Williams and others. The Library also publishes the National Library of Wales Journal."]}, {"page": "National Museum Cardiff", "response": ["The art gallery has works by all of the notable Welsh artists, including landscapes by Richard Wilson and the pioneering Thomas Jones. There is a considerable body of work by John Gibson, Queen Victoria's favourite sculptor, and major paintings by Augustus John and his sister Gwen John, including the former's famous image of Dylan Thomas. Ceri Richards is well represented. The artistic output of David Jones is well represented, but seldom on display owing to the fragile nature of his works on paper. Wales's most prominent contemporary painter, Sir Kyffin Williams (1918–2006), also features in the collection."]}, {"page": "List of converts to Catholicism", "response": ["* Gwen John: artist; Auguste Rodin's lover; after the relationship she had a religious conversion and did portraits of nuns"]}, {"page": "Art of the United Kingdom", "response": ["In many respects, the Victorian era continued until the outbreak of World War I in 1914, and the Royal Academy became increasingly ossified; the unmistakably late Victorian figure of Frank Dicksee was appointed President in 1924. In photography Pictorialism aimed to achieve artistic indeed painterly effects; The Linked Ring contained the leading practitioners.  The American John Singer Sargent was the most successful London portraitist at the start of the 20th century, with John Lavery, Augustus John and William Orpen rising figures.  John's sister Gwen John lived in France, and her intimate portraits were relatively little appreciated until decades after her death.  British attitudes to modern art were \"polarized\" at the end of the 19th century.. Modernist movements were both cherished and vilified by artists and critics; Impressionism was initially regarded by \"many conservative critics\" as a \"subversive foreign influence\", but became \"fully assimilated\" into British art during the early-20th century. The Irish artist Jack Butler Yeats (1871–1957), was based in Dublin, at once a romantic painter, a symbolist and an expressionist."]}, {"page": "List of British artists", "response": ["* Gwen John (1876–1939) – Welsh artist"]}, {"page": "Middlesbrough Institute of Modern Art", "response": ["Works include; Frank Auerbach, Elizabeth Blackadder, David Bomberg, Ken Currie, Jeremy Deller, Tracey Emin, Sir Jacob Epstein, Dame Elisabeth Frink, David Hockney, Peter Howson, Gwen John, Panayiotis Kalorkoti, L.S. Lowry, Ben Nicholson, Eduardo Paolozzi, Adrian Piper, Katherine Pleydell-Bouverie, Anne Redpath, Paula Rego, David Remfry, Lucie Rie, Stanley Spencer, Nancy Spero and Kara Walker."]}, {"page": "Thérèse (film)", "response": ["The film was first shown on British television in 1987 on a nun-themed film evening, with Black Narcissus, and was introduced by Marina Warner. \"I think Thérèse is a rare and beautiful film... No film has ever before transmitted so involvingly the bliss the mystics describe of communion with God, the intense pleasure a saint like Thérèse felt at her intimacy with Jesus, the deprivation she experienced when He seemed to be absent, and the comfort and affection of young women sequestered together... Cavalier's visual style, the film's restrained spectrum, its dove greys, bistres, waxy whites, recall the quiet images Gwen John painted in Normandy of nuns reading, praying... Cavalier scans the properties of convent life... He has learned from Robert Bresson how to linger on an image, how to give symbolic intensity to humdrum objects, by isolating them in the frame, and gentle repetition.\""]}, {"page": "Yale Center for British Art", "response": ["The collection of 20,000 drawings and watercolors and 31,000 prints features British sporting art and figure drawings. It includes works by Hogarth, Paul Sandby, Thomas Rowlandson, William Blake, John Constable, Samuel Palmer, Richard Parkes Bonington, John Ruskin, J. M. W. Turner, Walter Sickert, Duncan Grant, Paul Nash, Edward Burra, Stanley Spencer, Augustus John, Gwen John, and the Pre-Raphaelites."]}, {"page": "List of Catholic artists", "response": ["*Gwen John, Welsh artist; after converting, did religious art for a convent'God's Little Artist' Gwen John at the BBC"]}, {"page": "1939 in art", "response": ["** Gwen John, Welsh painter, sister of Augustus John (b. 1876)"]}, {"page": "John, Gwen", "response": ["#redirectGwen John"]}, {"page": "New English Art Club", "response": ["Historic NEAC members and exhibitors include: Thomas Kennington (founder member and first secretary), Prof Fred Brown (founder member), Frank Bramley (foundation member), Walter Sickert, William Orpen, Augustus John, Gwen John, Ambrose McEvoy, Philip Wilson Steer, Henry Tonks, James Whitelaw Hamilton, Alfred William Rich, James Dickson Innes, Margaret Preston, Charles Wellington Furse, Katie Edith Gliddon, William Rothenstein, Lindsay Bernard Hall, Thomas Cooper Gotch, Mary Sargant Florence, Henry Strachey, Clare Atwood, Evelyn Dunbar, Eve Garnett, Frank McEwen, James Jebusa Shannon, Cecil Mary Leslie, Mary Elizabeth Atkins, William Brown Macdougall, Neville Bulwer-Lytton, 3rd Earl of Lytton, Muirhead Bone, Robert Polhill Bevan, Dugald Sutherland MacColl, Neville Lewis, Charles Holmes, Carron O Lodge, Geoffrey Tibble, Alexander Mann, Hercules Brabazon Brabazon, Thomas Esmond Lowinsky, Frank Hughes, Albert Julius Olsson, Helen Margaret Spanton,Suffolk Painters: Suffolk Painters, accessdate: March 9, 2016 Margaret Green and Leslie Donovan Gibson."]}, {"page": "1902 in art", "response": ["* Gwen John – Self-Portrait"]}, {"page": "Women artists", "response": ["File:Gwen John - The Convalescent.jpg|Gwen John, The Convalescent (ca. 1923–24), one of ten versions of this composition", "Hannelore Baron, Vanessa Bell, Lee Bontecou, Louise Bourgeois, Romaine Brooks, Emily Carr, Leonora Carrington, Mary Cassatt, Elizabeth Catlett, Camille Claudel, Sonia Delaunay, Marthe Donas, Joan Eardley, Marisol Escobar, Dulah Marie Evans, Audrey Flack, Mary Frank, Helen Frankenthaler, Elisabeth Frink, Wilhelmina Weber Furlong, Françoise Gilot, Natalia Goncharova, Nancy Graves, Grace Hartigan, Barbara Hepworth, Eva Hesse, Sigrid Hjertén, Hannah Höch, Frances Hodgkins, Malvina Hoffman, Irma Hünerfauth, Margaret Ponce Israel, Gwen John, Elaine de Kooning, Käthe Kollwitz, Lee Krasner, Frida Kahlo, Hilma af Klint, Laura Knight, Barbara Kruger, Marie Laurencin, Tamara de Lempicka, Séraphine Louis, Dora Maar, Margaret Macdonald Mackintosh, Maruja Mallo, Agnes Martin, Ana Mendieta, Joan Mitchell, Paula Modersohn-Becker, Gabriele Münter, Alice Neel, Louise Nevelson, Georgia O'Keeffe, Betty Parsons, Aniela Pawlikowska, Orovida Camille Pissarro, Irene Rice Pereira, Paula Rego, Bridget Riley, Verónica Ruiz de Velasco, Anne Ryan, Charlotte Salomon, Augusta Savage, Zofia Stryjeńska, Zinaida Serebriakova, Sarai Sherman, Henrietta Shore, Sr. Maria Stanisia, Marjorie Strider, Carrie Sweetser, Annie Louisa Swynnerton, Franciszka Themerson, Suzanne Valadon, Remedios Varo, Maria Helena Vieira da Silva, Nellie Walker, Marianne von Werefkin and Ogura Yuki.Women Artists of the 20th & 21st Centuries, retrieved on June 14, 2007."]}, {"page": "Ida Nettleship", "response": ["At the age of 15, she became a student at the Slade School of Art, where she studied until 1898 under Fred Brown, Henry Tonks, and Wilson Steer. Among her fellow students, she befriended Gwen Salmond, Edna Waugh, Gwen John, and Bessie and Dorothy Salaman.  She became engaged to their brother Clement Salaman but broke it off in 1897 and traveled to Italy. She followed up with a trip to Paris in 1898, where she shared a flat with Gwen John and Gwen Salmond and studied under James Whistler at the Académie Carmen."]}, {"page": "Glynn Vivian Art Gallery", "response": ["The paintings include work by Richard Wilson, Claude Monet, Thomas Jones, Mark Gertler, Augustus John, Gwen John, Stanley Spencer, Lucien Pissarro, Paul Nash, Guido Reni, Cedric Morris, Ben Nicholson, Alfred Janes, Ceri Richards, Ivon Hitchens, Thomas Lawrence, H. Scott Tuke, Ryszard Zajac, Evan Walters and Kyffin Williams.", "Watercolours and drawings include work by Richard Wilson, Thomas Gainsborough, John Sell Cotman, Thomas Rowlandson, Richard Parkes Bonington, Gwen John and Ceri Richards.", "File:Gwen John, The Nun (Glynn Vivian).jpg|The Nun by Gwen John"]}, {"page": "John (surname)", "response": ["* Gwen John (1876–1939), Welsh artist, sister of Augustus John"]}, {"page": "1939 in the United Kingdom", "response": ["* 18 September - Gwen John, artist (born 1876)"]}, {"page": "1939 in Wales", "response": ["*18 September - Gwen John, artist, 63"]}, {"page": "Graves Art Gallery", "response": ["The gallery's first director was John Rothenstein, who became director of the Tate Gallery. The painter, George Hamilton Constantine followed from 1938 until the 1950s. Rothenstein and Constantine were key figures in broadening the 20th century British collection which Graves had begun. The search for individual pieces of outstanding significance and quality characterised their vision with works by Walter Sickert, Harold Gilman, Gwen John, C R W Nevinson, Jacob Epstein, Stanley Spencer, William Roberts, Paul Nash, Christopher Wood, David Bomberg, L S Lowry, John Minton, Henry Moore, Keith Vaughan, Prunella Clough and Frank Auerbach purchased for the city."]}, {"page": "Self-portrait", "response": ["Image:Gwen John - Self-Portrait.jpg|Gwen John (1902) also mostly painted women and children.\t"]}, {"page": "1904 in Wales", "response": ["*February - Gwen John arrives in Paris, in the company of Dorelia McNeill."]}, {"page": "1870s in Wales", "response": ["**22 June – Gwen John, artist (died 1939)"]}, {"page": "1876 in Wales", "response": ["*22 June – Gwen John, artist (died 1939)"]}]}}