{"wiki_id": "http://www.wikidata.org/entity/Q27443411", "itemLabel": "Dion Conroy", "itemDescription": "association football player (born 1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dion_Conroy", "wikipedia_page": {"main": "Dion John Conroy (born 11 December 1995) is an English professional footballer who plays as a defender for Swindon Town.", "link_mentions": [{"page": "Gabriel Zakuani", "response": ["On 4 October 2019 Zakuani signed a short-term contract with Swindon Town following a long-term injury to club captain Dion Conroy. He made his first appearance the following day in a 2–1 defeat at Bradford City. Zakuani was released in January 2020 after his short-term deal expired."]}, {"page": "2016–17 Chelsea F.C. season", "response": ["On the last day of the transfer window, Chelsea completed a total of thirteen transfers, with 11 loan deals and two additions. Youngsters, Dion Conroy and Nathan Baxter, both joined up with semi-professional clubs, while Jake Clarke-Salter and Charlie Colkett both joined League One side Bristol Rovers. Lucas Piazon joined Tomáš Kalas at Fulham until 15 January 2017 while Christian Atsu joined Newcastle United on a season loan. Kenneth Omeruo returned to the Turkish league, joining newly promoted side Alanyaspor after signing a new contract until 2019. Cristián Cuevas returned to Sint-Truiden for a second season while Islam Feruz joined fellow loanee Matej Delač at Mouscron-Péruwelz. Matt Miazga joined up with the Dutch side Vitesse after his move to Espanyol fell through due to paperwork."]}, {"page": "2016–17 Swindon Town F.C. season", "response": ["| Dion Conroy", "| 27 January 2017 || CB ||  || Dion Conroy || Chelsea || Undisclosed || ", "|align=\"left\"| Dion Conroy"]}, {"page": "Jay Conroy", "response": ["Conroy is the older brother of footballer Dion Conroy. Following the success of his modelling career, he has over 100,000 followers on social networking application Instagram. Conroy was named Surrey National Golf Champion between 2001 and 2004, and also won the  South England Brighton Open Swimming Champion 100m Breaststroke in 2003. He completed the UK London Triathlon in 2013."]}, {"page": "2017–18 Swindon Town F.C. season", "response": ["| Dion Conroy", "|align=\"left\"| Dion Conroy"]}, {"page": "2018–19 Swindon Town F.C. season", "response": ["| Dion Conroy", "|align=\"left\"| Dion Conroy"]}, {"page": "2019–20 Swindon Town F.C. season", "response": ["| Dion Conroy"]}]}}