{"wiki_id": "http://www.wikidata.org/entity/Q27560621", "itemLabel": "Dafne Keen", "itemDescription": "British-Spanish actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Dafne_Keen", "wikipedia_page": {"main": "Dafne María Keen Fernández (born 4 January 2005) is a British-Spanish actress. She made her debut starring as Ana \"Ani\" Cruz Oliver on the television series The Refugees  from 2014 to 2015, before her breakthrough starring as Laura in the 2017 superhero film Logan, in which she received widespread critical acclaim for her acting. She received several awards, including an Empire Award for Best Newcomer, and nominations for a Critics' Choice Award and a Saturn Award. In 2019, she began starring as Lyra Belacqua in the television series His Dark Materials, for which she was nominated for a BAFTA Cymru.", "link_mentions": [{"page": "2005", "response": ["* January 4 – Dafne Keen, British and Spanish actressDebrett's Peerage and Baronetage, 148th edition, Debrett's Peerage Ltd, 2011, p. 799"]}, {"page": "His Dark Materials", "response": ["In November 2015, the BBC announced that it had commissioned a television adaptation of His Dark Materials. The eight-part adaptation had a planned premiere date in 2017. In April 2017, writer Jack Thorne told the Radio Times that the series was still in pre-production. \"It's at an exciting point where we're just … trying to work out what works,\" and that he wanted to ensure that they were being loyal to the books. By July 2018, Dafne Keen had been provisionally cast as Lyra Belacqua, Ruth Wilson as Marisa Coulter, James McAvoy as Lord Asriel, Lin-Manuel Miranda as Lee Scoresby and Clarke Peters as the Master of Jordan College. The series received its premiere in London on 15 October 2019. Broadcast began on BBC One in the United Kingdom and in Ireland on 3 November and on HBO in the United States on 4 November 2019. In 2020 the second series of His Dark Materials began streaming on BBC One in the United Kingdom on 8 November and on HBO Max in the United States on 16 November."]}, {"page": "2005 in film", "response": ["* January 4 – Dafne Keen, Spanish-English actress"]}, {"page": "Lyra Belacqua", "response": ["Dafne Keen plays Lyra in the BBC television adaptation."]}, {"page": "Saturn Award for Best Performance by a Younger Actor", "response": ["| Dafne Keen"]}, {"page": "Northern Lights (Pullman novel)", "response": ["On 3 November 2019, BBC One began broadcast of their TV adaptation of His Dark Materials. This first series mainly covers events from Northern Lights. It premiered on HBO on 4 November 2019 in the United States. The series was produced by Bad Wolf and New Line Cinema and directed by Tom Hooper. Cast members included Dafne Keen, James McAvoy, Ruth Wilson, Lin-Manuel Miranda, Ian Gelder, and Ruta Gedmintas."]}, {"page": "X-23", "response": ["The character has appeared in adaptations, including animated film and TV series and video games. She was portrayed by Dafne Keen in the 2017 film Logan.", "* Laura/X-23 is portrayed by Dafne Keen in the X-Men film franchise's tenth entry Logan, directed by James Mangold. In February 2017, producer Simon Kinberg stated that the post-credits scene of X-Men: Apocalypse, in which Essex Corporation acquires James \"Logan\" Howlett / Wolverine's blood, correlates with how Alkali-Transigen eventually acquires DNA and begins creating clones for use as weapons. Depicted as an 11-year-old girl who was created from Logan's DNA and thus; is Wolverine's biological daughter; instead of his clone, she has inherited her father's bone claws and advanced healing powers. Laura was one of several mutant children who had been slated for termination when Transigen created X-24, an adult double of Wolverine that has been programmed to be loyal to Transigen. However, a Transigen nurse named Gabriela Lopez helped her escape. Even at her young age, she was already a very formidable combatant; on several occasions, she singlehandedly faced off a whole detachment of Reavers. With Logan's help, she eventually made her way to a remote location on the border between the United States (via North Dakota) and Canada escaping across the border, although Logan is killed in battle with X-24 when he deliberately overdoses on a drug designed to stimulate his weakening healing factor so that he can fight one last time, subsequently dying in Laura's arms."]}, {"page": "2005 in the United Kingdom", "response": ["* 4 January – Dafne Keen, British and Spanish actressDebrett's Peerage and Baronetage, 148th edition, Debrett's Peerage Ltd, 2011, p. 799"]}, {"page": "JoBlo.com", "response": ["|Dafne Keen"]}, {"page": "Critics' Choice Movie Award for Best Young Performer", "response": ["** Dafne Keen as Laura Kinney / X-23 – Logan"]}, {"page": "Galicians", "response": ["File:Dafne Keen by Gage Skidmore.jpg|Child actress Dafne Keen"]}, {"page": "List of breakout characters", "response": ["|X-23 first appeared in the self-titled tenth episode of the third season of the animated television series X-Men: Evolution, and is a clone and later adoptive daughter of Wolverine. X-Men: Evolution ended six episodes after X-23's second appearance, but she quickly developed a following and later made her first comic book appearance in the NYX comic series in 2004, followed by multiple comic book and video game appearances. In 2015, the character succeeded the original Wolverine and adopted his name and costume in the series All-New Wolverine, and is later portrayed by actress Dafne Keen in the 2017 film Logan in a scene-stealing performance."]}]}}