{"wiki_id": "http://www.wikidata.org/entity/Q275465", "itemLabel": "George Wyndham", "itemDescription": "British politician (1863-1913)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Wyndham", "wikipedia_page": {"main": "George Wyndham, PC (29 August 1863 – 8 June 1913) was a British Conservative politician, statesman, man of letters, and one of The Souls.", "link_mentions": [{"page": "Auguste Rodin", "response": ["Later, with his reputation established, Rodin made busts of prominent contemporaries such as English politician George Wyndham (1905), Irish playwright George Bernard Shaw (1906), socialist (and former mistress of the Prince of Wales who became King Edward VII) Countess of Warwick (1908), Austrian composer Gustav Mahler (1909), former Argentine president Domingo Faustino Sarmiento and French statesman Georges Clemenceau (1911)."]}, {"page": "Ouida", "response": ["Although successful, she did not manage her money well. A civil list pension of £150 a year was offered to her by the prime minister, Sir Henry Campbell-Bannerman, on the application of Alfred Austin, George Wyndham, and Walburga, Lady Paget, which she reluctantly accepted after request by her friend, Lady Howard of Glossop, on 16 July 1906."]}, {"page": "The Red Badge of Courage", "response": ["While it eventually became a bestseller in the United States, The Red Badge of Courage was more popular and sold more rapidly in England when it was published in late 1895. Crane was delighted with his novel's success overseas, writing to a friend: \"I have only one pride and that is that the English edition of The Red Badge of Courage has been received with great praise by the English reviewers. I am proud of this simply because the remoter people would seem more just and harder to win.\" Critic, veteran and Member of Parliament George Wyndham called the novel a \"masterpiece\", applauding Crane's ability to \"stage the drama of man, so to speak, within the mind of one man, and then admits you as to a theatre.\"Monteiro (2009), p. 42 Harold Frederic wrote in his own review that \"If there were in existence any books of a similar character, one could start confidently by saying that it was the best of its kind. But it has no fellows. It is a book outside of all classification. So unlike anything else is it that the temptation rises to deny that it is a book at all\". Frederic, who would later befriend Crane when the latter relocated to England in 1897, juxtaposed the novel's treatment of war to those by Leo Tolstoy, Émile Zola and Victor Hugo, all of whose works he believed to be \"positively... cold and ineffectual\" when compared to The Red Badge of Courage."]}, {"page": "Arthur Balfour", "response": ["In Parliament he resisted overtures to the Irish Parliamentary Party on Home Rule, which he saw as an expression of superficial or false Irish nationalism. Allied with Joseph Chamberlain's Liberal Unionists, he encouraged Unionist activism in Ireland. Balfour also helped the poor by creating the Congested Districts Board for Ireland in 1890. Balfour downplayed the factor of Irish nationalism, arguing that the real issues were economic. Regarding ownership and control of the land, he believed that once violence was suppressed and land was sold to the tenants, Irish nationalism would no longer threaten the unity of the United Kingdom. The slogan \"to kill home rule with kindness\" characterized Balfour's new policy toward Ireland.Catherine B. Shannon, Arthur J. Balfour and Ireland, 1874–1922 (1988) pp 281–288. The Liberals had begun land sales to Irish tenants with the Land Law (Ireland) Act 1881 and this was expanded by the Conservatives in the land purchase scheme of 1885.  However the depression in agriculture kept prices low. Balfour's solution was to keep selling land and in 1887 lowering rents to match the lower prices, and protected more tenants against eviction by their landlords.Zebel, 60-77. Balfour greatly expanded the land sales. They culminated in the final Unionist land purchase programme of 1903,  when Balfour was prime minister and George Wyndham was the Irish secretary.  It encouraged landlords the sell by means of a 12% cash bonus. Tenants were encouraged to buy with a low interest rate, and payments drawn out over 68 years. In 1909, Liberal legislation required compulsory sales in certain cases. As the landlords sold out, they relocated to Britain, giving up their political power in Ireland. Tensions in the countryside dramatically declined as some 200,000 peasant proprietors owned about half the land in Ireland. After 1890 violence declined sharply, and as Balfour had hoped, Irish nationalism was a relatively minor factor. The situation suddenly was transformed when the Easter rebellion of 1916 radicalized Ireland.Lawrence J. McCaffrey, The Irish Question 1800–1922 (1968) pp 129–133, 167.L. P. Curtis, Jr., Coercion and Conciliation in Ireland 1880-1892 (1963) pp 424-434. online"]}, {"page": "Joachim du Bellay", "response": ["* George Wyndham, Ronsard and La Pléiade (1906)"]}, {"page": "Irish Parliamentary Party", "response": ["The UIL, explicitly designed to reconcile the fragmented party, was accepted as the parliamentary nationalists' main support organisation, with which O'Brien intensified his campaign of agrarian agitation. Encouraged by the Chief Secretary George Wyndham and initiated by moderate landlords led by Lord Dunraven the December 1902 Land Reform Conference followed, which successfully aimed at a settlement by conciliatory agreement between landlord and tenant. O'Brien, Redmond, T. W. Russell (who spoke for Ulster tenant-farmers) and Timothy Harrington represented the tenant side.Miller, David W.: Church, State and Nation in Ireland 1898–1921 Land for the People pp. 77–94, Gill & Macmillan Dublin (1973)  Its outcome became the basis for O'Brien orchestrating the unprecedented Wyndham Land Purchase (Ireland) Act 1903 through parliament, which enabled tenant farmers to buy out their landlord's land at favourable annuities, while giving the landlords a premium price.  The last landlords sold out in the 1920s, thus ending the age-old Irish land question."]}, {"page": "William Ward, 2nd Earl of Dudley", "response": ["After Arthur Balfour succeeded as Prime Minister, Lord Dudley was on 11 August 1902 sworn a member of the Privy Council, and appointed Lord Lieutenant of Ireland. He was sworn in and formally installed as such in a ceremony at Dublin Castle on 16 August 1902, and was also appointed Grand Master of the Order of St. Patrick, as was customary for the Lord Lieutenant of Ireland. Through his years in Ireland, he displayed great extravagance but also some political and administrative ability. The Land Purchase (Ireland) Act 1903 and his cooperation with George Wyndham on a devolution scheme to deal with the Home Rule question were among important milestones. He is immortalized in Joyce's description of his Vice-Regal progress through Dublin in Ulysses. During his first visit to Belfast, in November 1902, he laid the foundation stone of the Belfast Municipal Technical Institute."]}, {"page": "Thomas North", "response": ["North's Plutarch was reprinted for the Tudor Translations (1895), with an introduction by George Wyndham."]}, {"page": "Chief Secretary for Ireland", "response": ["This list includes holders of a key political office in the British administration in Ireland.  Nominally subordinate to the Lord Lieutenant, from the late 18th century until the end of British rule he was effectively the government minister with responsibility for governing Ireland; usually it was the Chief Secretary, rather than the Lord Lieutenant, who sat in the British Cabinet. Exceptions were the periods from 29 June 1895 to 8 August 1902, when the Lord Lieutenant Lord Cadogan sat in the Cabinet and the Chief Secretaries Gerald Balfour until 9 November 1900 did not sit there and George Wyndham from that date also sat there,Chris Cook and Brendan Keith, British Historical Facts 1830–1900, Macmillan, 1975, pages 45–46 and from 28 October 1918 to 2 April 1921, when both the Lord Lieutenant Lord French and the Chief Secretaries Edward Shortt, Ian Macpherson and Sir Hamar Greenwood sat in the Cabinet.British Political Facts 1900–1994, by David Butler and Gareth Butler (Macmillan Press, 7th edition 1994) Page7.", "| George Wyndham"]}, {"page": "Irish National Land League", "response": ["Within decades of the league's foundation, through the efforts of William O'Brien and George Wyndham (a descendant of Lord Edward FitzGerald), the 1902 Land Conference produced the Land Purchase (Ireland) Act 1903 which allowed Irish tenant farmers to buy out their freeholds with UK government loans over 68 years through the Land Commission (an arrangement that has never been possible in Britain itself). For agricultural labourers, D.D. Sheehan and the Irish Land and Labour Association secured their demands from the Liberal government elected in 1905 to pass the Labourers (Ireland) Act 1906, and the Labourers (Ireland) Act 1911, which paid County Councils to build over 40,000 new rural cottages, each on an acre of land. By 1914, 75% of occupiers were buying out their landlords, mostly under the two Acts. In all, under the pre-UK Land Acts over 316,000 tenants purchased their holdings amounting to  out of a total of  in the country.Ferriter, Diarmaid: \"The Transformation of Ireland, 1900–2000\", Profile Books, London (2004), pp. 62–63, 159 () Sometimes the holdings were described as \"uneconomic\", but the overall sense of social justice was manifest."]}, {"page": "Earl of Dunraven and Mount-Earl", "response": ["He was succeeded by his son, the fourth Earl, who  served in the Conservative government of Lord Salisbury as Under-Secretary of State for the Colonies from 1885 to 1886. A member of the Irish Unionist Party, he was also Lord Lieutenant of County Limerick from 1894 to 1926. When the Chief Secretary for Ireland, George Wyndham, called a Land Conference in 1902, Lord Dunraven was chairman representing the landlord side and together with William O'Brien played a decisive role in attaining agreement on the enactment of the Wyndham Land Purchase (Ireland) Act 1903 which enabled tenants to purchase lands from their landlords under favourable financial provisions. He was a Senator of the Irish Free State from 1922 to 1926. He had no male heirs and on his death the barony of Kenry became extinct. The Fourth Earl published his memoir Past Times and Pastimes in 1922 (Hodder and Stoughton). He was succeeded in the other titles by his cousin, the fifth Earl. He had previously represented South Glamorganshire in Parliament as a Conservative from 1895 to 1906. The titles became extinct when the seventh Earl died on 25 March 2011 at his residence, Kilgobbin House."]}, {"page": "Territorial Force", "response": ["The war placed a significant strain on the regular forces. Against a background of invasion scares in the press, George Wyndham, Under-Secretary of State for War, conceded in Parliament in February 1900 that instead of augmenting the regular army's defence of the British coast, the auxiliary forces were the main defence.Beckett 2011 p. 205Beckett 2008 pp. 20, 26 The questionable performance of the volunteers, caused by poor standards of efficiency and training, led to doubts in both government and the regular army about the auxiliary's ability to meet such a challenge.Beckett 2008 p. 27Beckett 2011 pp. 206–207 The war also exposed the difficulty in relying on auxiliary forces which were not liable for service overseas as a source of reinforcements for the regular army in times of crisis. In 1903, the Director of General Mobilisation and Military Intelligence reported an excess of home defence forces which could not be relied upon to expand the army in foreign campaigns.Hay pp. 220–221 The utility of such forces was brought further into question by British military planning; the Royal Navy formed the primary defence against invasion, and studies in 1903 and 1908 concluded that the threat of invasion was negligible, despite popular perceptions to the contrary.Mitchinson 2005 pp. 3–4, 7"]}, {"page": "Baron Leconfield", "response": ["Baron Leconfield, of Leconfield in the East Riding of the County of York, is a title in the Peerage of the United Kingdom. It was created in 1859 for Col. George Wyndham (1787–1869). He was the eldest illegitimate son and adopted heir of George Wyndham, 3rd Earl of Egremont (1751–1837) (see Earl of Egremont for earlier history of the family), from whom he inherited Petworth House in Sussex, Egremont Castle and Cockermouth Castle in Cumbria and Leconfield Castle in Yorkshire, all formerly lands of Josceline Percy, 11th Earl of Northumberland (1644–1670), inherited by Charles Seymour, 6th Duke of Somerset (1662–1748) on his marriage to the Percy heiress Elizabeth Percy (1667–1722) and inherited as one of the co-heirs of his son Algernon Seymour, 7th Duke of Somerset, 1st Earl of Egremont (1684–1750) by the latter's nephew Sir Charles Wyndham, 4th Baronet (1710–1763) of Orchard Wyndham in Somerset, who inherited by special remainder the Earldom of Egremont. The 1st Baron's eldest son, the second Baron, represented West Sussex in the House of Commons as a Conservative. He was succeeded by his eldest son, the third Baron, who served as Lord Lieutenant of Sussex from 1917 to 1949. The latter's nephew, the sixth Baron, served as Private Secretary to Prime Minister Harold Macmillan from 1957 to 1963. In 1963, four years before he succeeded his father in the barony of Leconfield, the Egremont title held by his ancestors was revived when he was raised to the peerage as Baron Egremont, of Petworth in the County of Sussex.  the titles are held by his son, the seventh Baron. Known as Max Egremont, he is a biographer and novelist.", "The Hon. Percy Wyndham, younger son of the first Baron, was a Conservative politician and member of The Souls. He was the father of the Conservative politician and man of letters George Wyndham and of the soldier Guy Wyndham.", "*George Wyndham, 1st Baron Leconfield (1787–1869)", "* 15px George Wyndham, 1st Baron Leconfield (1787—1869)"]}, {"page": "List of Privy Counsellors (1901–1910)", "response": ["*George Wyndham (1863–1913)"]}, {"page": "Carlton Club", "response": ["*George Wyndham"]}, {"page": "Harry Cust", "response": ["Cust was one of The Souls and was attached to Pamela Wyndham, who later married Edward Tennant, 1st Baron Glenconner. Others in the same clique were Margot Asquith, Arthur Balfour, George Curzon, 1st Marquess Curzon, Alfred Lyttelton, Godfrey Webb, and George Wyndham. Considered a brilliant conversationalist by his contemporaries, he had a reputation as a womaniser and was the natural father of the socialite and philanthropist Lady Diana Cooper, by his mistress the Duchess of Rutland, although this was not acknowledged until much later. Cust was also rumoured to be a natural grandfather of prime minister Margaret Thatcher, through his supposed illegitimate begetting of her mother Beatrice Ethel Stephenson (born  1889), who on 28 May 1917 at the Wesleyan Chapel in Grantham (firmly within the orbit of Belton House), married Alfred Roberts, a shop-keeper in that town, the father of the prime minister. Although there was no solid proof of this connection, Lady Diana Cooper often jokingly referred to Mrs Thatcher as her niece.John Campbell The Grocer's Daughter"]}, {"page": "The Souls", "response": ["*George Wyndham, (1863–1913), the Wyndham's elder son, served in the Coldstream Guards, became private secretary to Arthur Balfour and in 1889, was elected unopposed to a seat in the House of Commons that he held until his death in 1913. He served as Under-Secretary of State for War, Chief Secretary for Ireland, and then was taken into the Cabinet and sworn a member of the Privy Council in 1902. He furthered the 1902 Land Conference and saw the transformative Land Purchase (Ireland) Act 1903 into law. Within years of the Acts, former tenants owned most of the land, thanks to support from government subsidies."]}, {"page": "1903 in Ireland", "response": ["* 26 March – The Chief Secretary for Ireland, George Wyndham, introduced his Irish Land Bill in the House of Commons of the United Kingdom.", "* 15 May – The Chief Secretary for Ireland, George Wyndham, asked for support for his Irish Land Bill."]}, {"page": "Parallel Lives", "response": ["Of the biographies in Parallel Lives, that of Antonius has been cited by multiple scholars as one of the masterpieces of the series. In 1895, George Wyndham wrote that the first rank consists of the biographies of Themistocles, Alcibiades, Marius, Cato the Elder, Alexander, Demetrius, Antonius, and Pompey. Peter D'Epiro praised Plutarch's depiction of Alcibiades as \"a masterpiece of characterization.\" Academic Philip A. Stadter singled out Pompey and Caesar as the greatest figures in the Roman biographies. In a review of the 1859 A. W. Clough translation, Plutarch’s depictions of Antony, Coriolanus, Alcibiades, and the Cato the Elder were praised as deeply drawn. The reviewer found the sayings of Themistocles to be “snowy and splendid”, those of Phocion to be “curt and sharp”, and those of Cato “grave and shrewdly humorous”. Carl Rollyson lauded the biography of Caesar as proof Plutarch is “loaded with perception” and stated that no biographer “has surpassed him in summing up the essence of a life – perhaps because no modern biographer has believed so intensely as Plutarch did in ‘the soul of men’."]}, {"page": "Unionist government, 1895–1905", "response": ["**Walter Hume Long succeeds George Wyndham as Irish Secretary.", "! scope=row |George Wyndham", "! scope=row style=\"font-weight:bold;\" | George Wyndham"]}, {"page": "Antony MacDonnell, 1st Baron MacDonnell", "response": ["MacDonnell was sworn of the Privy Council of the United Kingdom on 11 August 1902, following an announcement of the King's intention to make this appointment in the 1902 Coronation Honours list published in June that year. He was also appointed a member of the Council of India in October October 1902. It was expected that he would be appointed Governor of Bombay in that year, but instead he opted to accept an offer from George Wyndham, Chief Secretary for Ireland, to become Permanent Under-Secretary of State for Ireland, the administrative head of the Irish Government.", "MacDonnell entered into lengthy negotiations with Lansdowne and the Chief Secretary, George Wyndham, regarding the terms under which he would accept the position; he was not content to occupy the traditional role of an administrative civil servant, with little input into the formulation of policy. He eventually accepted the office of Under-Secretary, on the explicit understanding that he would be given \"adequate opportunities of influencing the policy and acts of the administration\"."]}, {"page": "Under-Secretary of State for War", "response": ["|George Wyndham || 1898–1900"]}, {"page": "Augustine Birrell", "response": ["Birrell's first Under-Secretary and head of Irish Civil Service at Dublin Castle administration was Sir Antony MacDonnell, who had worked successfully with a previous Chief Secretary, George Wyndham, on the Land Purchase (Ireland) Act 1903. MacDonnell was a well known advocate for Home Rule. MacDonnell's proposals for what was called \"devolution\" – the transfer of local powers to Ireland under a central authority – adopted by the Irish Reform Association's - had encountered strong opposition from Unionists, leading eventually to Wyndham's resignation. This proposal ultimately passed from Sir James Bryce with Birrell inheriting the bill. Birrell modified MacDonnell's proposal and on 7 May 1907 introduced the Irish Council Bill. The bill was initially welcomed by Nationalist leaders John Redmond and John Dillon, and opposed, for different reasons, by unionists and by more radical nationalists who wanted nothing less than Home Rule for Ireland. At a convention of the United Irish League, opposition was so strong that Redmond changed his position; the convention rejected the bill and the government was unable to proceed with it.Ó Broin, The Chief Secretary, pp. 11–15 Birrell suffered further embarrassment when he sought to discontinue the use of the Irish Crimes Act 1887, a coercive measure introduced by Arthur Balfour to deal with agrarian crime, only to be faced with an increase in cattle-driving.Ó Broin, The Chief Secretary, pp. 18–19 Another affair, in which Birrell was not directly involved but for which he had to take part of the blame, was the theft of the Irish Crown Jewels from Dublin Castle (where the Chief Secretary had his offices) in July 1907.Ó Broin, The Chief Secretary, pp. 25–26"]}, {"page": "Walter Long, 1st Viscount Long", "response": ["Long was offered the position of First Lord of the Admiralty in Lord Selborne's place, as the latter was appointed to the Governor-Generalship of South Africa.  But he refused the promotion, advising the appointment of Lord Cawdor.  Really what Long wanted was to remain at Local Government, but when George Wyndham resigned as Chief Secretary for Ireland, Balfour was faced with a crisis.  Wyndham resigned on 5 March 1905, over what became known as the \"Wyndham-MacDonnell Imbroglio\"."]}, {"page": "Land Acts (Ireland)", "response": ["Under pressure from both government, UIL and IPP, the Chief Secretary for Ireland –  George Wyndham gave his backing to a Land Conference in December 1902, comprising four moderate landlord representatives led by Lord Dunraven and four tenant representatives led by William O'Brien, the others John Redmond, T. W. Russell (who spoke for Ulster tenant-farmers) and T. C. Harrington. They worked out a new scheme for tenant land purchase, sale was to be made not compulsory, but attractive to both parties, based on the government paying the difference between the price offered by tenants and that demanded by landlords. This was the basis of the \"Wyndham Act\" – the Land Purchase (Ireland) Act (1903) – which O'Brien orchestrated through parliament.Miller, David W.: Church, State and Nation in Ireland 1898–1921 Land for the People pp.77–94, Gill & Macmillan (1973) "]}, {"page": "Rector of the University of Glasgow", "response": ["|1902–1905 || George Wyndham ||  || Chief Secretary for Ireland"]}, {"page": "Rector of the University of Edinburgh", "response": ["*1908 George Wyndham "]}, {"page": "Dover (UK Parliament constituency)", "response": ["| George Wyndham"]}, {"page": "Imperial Yeomanry", "response": ["On 18 December, Lords Lonsdale and Chesham, who both commanded yeomanry regiments, offered to recruit 2,300 volunteers from the domestic yeomanry for service in South Africa. Although Lord Wolseley, Commander-in-Chief of the Forces opposed it, George Wyndham, Under-Secretary of State for War and himself a yeoman, established an imperial yeoman committee with Chesham and two other yeomanry commanders. The result, announced on 24 December, was the Imperial Yeomanry, which was duly established on 2 January 1900. By the end of the war, just under 35,000 men were recruited in three separate contingents. Its structure, companies and battalions rather than the squadrons and regiments of the domestic yeomanry, reflected its role as mounted infantry.Hay pp. 45, 175–176 & 217Beckett 2011 pp. 202–203 The existing yeomanry was invited to provide volunteers for the new force, thus forming a relatively trained nucleus on which it was built. It was, however, a distinct body in its own right, separate from the home force, and the domestic yeomanry provided only around 18 per cent of the first contingent of over 10,000 men.Mileham 2003 p.27Hay pp. 173 & 205 Volunteers also came from the yeomanry's infantry counterpart, the Volunteer Force, but the majority were newly recruited from the yeomanry's traditional demographics of the middle class and the farming community, although some 30 per cent were working class.Hay p. 181 The first contingent recruits were able to build on the experience many of them already had with horsemanship and firearms courtesy of two or three months drilling in domestic yeomanry regiments before they were shipped to South Africa.Hay p. 194"]}, {"page": "Hewell Grange", "response": ["Windsor-Clive and his wife pursued a wide range of artistic interests. He was a Trustee of the National Gallery, a long-serving chairman of the National Trust and author of what was the standard work on John Constable. Lady Windsor established an Arts and Crafts workshop at Hewell, decorated some of the rooms in partnership with her mother, and enjoyed a long friendship with Edward Burne-Jones, who painted her portrait, a \"masterpiece of symbolist art\" which hung on the stairway at Hewell. The Windsor-Clives were members of The Souls, a grouping of intellectual aristocrats, with Gay Windsor-Clive conducting a long, and acknowledged, affair with George Wyndham, the group's most prominent member. The Souls held relaxed attitudes to extra-marital liaisons. The novelist Elinor Glyn, herself a long-term lover of another Soul, George Curzon, recorded her impressions of their country house weekends; \"the good-looking unattached men had a wonderful time...while many husbands were the lovers of their friends' wives\"."]}, {"page": "Swinford", "response": ["John Dillon was a long-serving Member of Parliament for East Mayo at Westminster. His major policy issue was the resolution of the Land Question. Dillon took an uncompromising position in favour of the smallholders (small farmers) who sought to gain ownership of the land which they held as tenants from the largely Anglo-Irish landlords. From the middle of the 19th century, ongoing attempts were made at Westminster by the Liberal Party under William Ewart Gladstone to resolve the issue by passing the Irish Land Acts. Irish opinion, while welcoming of the initiative to resolve the injustice, was divided between the moderates, led by William O'Brien, who favoured a conciliatory approach (known as the doctrine of conciliation) and the hardliners. The hardliners supported an aggressive agrarian struggle and sought to advance simultaneously the struggle for Home Rule. On 25 August 1903, Dillon, addressing a meeting of his constituents at the Swinford Workhouse, spoke vehemently against the doctrine of conciliation. This divided the Party and led to the departure of William O’Brien. It became known as the \"Swinford Revolt\". Despite the turmoil, the Chief Secretary for Ireland, George Wyndham's Land Purchase (Ireland) Act 1903 passed at Westminster, resolving the Irish Land Question."]}, {"page": "Irish Land Commission", "response": ["The Commission eventually transferred 13.5 million acres (55,000 km²) by 1920. Following the Land Conference of December 1902 arranged by the Chief Secretary for Ireland George Wyndham, the Land Purchase (Ireland) Act 1903 was steered through Parliament by William O'Brien, which provided government finance to buy out freeholds, with the former tenant farmers paying back the capital over 68 years. This was managed by the Land Commission, along with ancillary work such as compiling statistics. Valuations were reckoned on a years purchase (Y.P.) basis, the price being a multiple of (perhaps 16 times) the annual rent, instead of the discounted cash flow method used today. The Commission had to supervise the haggling process and find the fairest multiple for every transfer. The loans issued by government were resold in the capital markets as Land Bonds."]}, {"page": "Ronald Collet Norman", "response": ["In March 1900, he was appointed an assistant private secretary (unpaid) to the (Conservative) Under-Secretary of State for War, George Wyndham."]}, {"page": "Earl of Egremont", "response": ["The second Earl's eldest son and successor, the third Earl, was known as a patron of art. He also sponsored the Petworth Emigration Scheme, which sent thousands of working-class people from the south of England to Upper Canada between 1832 and 1837. On his death the titles passed to his nephew, the fourth Earl. When he died in 1845 the barony of Cockermouth and earldom of Egremont became extinct. The large Wyndham estates, including Petworth House in Sussex had already passed to Colonel George Wyndham. He was the natural son and adopted heir of the third Earl. In 1859 he was raised to the peerage in his own right as Baron Leconfield. Moreover, in 1963 the Egremont title was revived for his great-great-grandson John Wyndham, who was created Baron Egremont, of Petworth in the County of Sussex. In 1967 he succeeded his father as sixth Baron Leconfield.", "*George Wyndham"]}, {"page": "G. Wyndham", "response": ["#REDIRECT George Wyndham"]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["| George Wyndham"]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| George Wyndham "]}]}}