{"wiki_id": "http://www.wikidata.org/entity/Q275616", "itemLabel": "Marian McPartland", "itemDescription": "British pianist, composer, writer and radio host", "wikipedia_url": "https://en.wikipedia.org/wiki/Marian_McPartland", "wikipedia_page": {"main": "Margaret Marian McPartland OBE (née Turner; 20 March 1918 – 20 August 2013), was an English-American jazz pianist, composer and writer. She was the host of Marian McPartland's Piano Jazz on National Public Radio from 1978 to 2011.After her marriage to trumpeter Jimmy McPartland in February 1945, she resided in the United States when not travelling throughout the world to perform. In 1969, she founded Halcyon Records, a recording company that issued albums for 10 years. In 2000, she was named a National Endowment for the Arts Jazz Master. In 2004, she was given a Grammy Award for lifetime achievement. In 2007, she was inducted into the National Radio Hall of Fame. Although known mostly for jazz, she composed other types of music as well, performing her own symphonic work A Portrait of Rachel Carson with the University of South Carolina Symphony Orchestra in 2007. In 2010, she was named a member of the Order of the British Empire.", "link_mentions": [{"page": "Dave Brubeck", "response": ["Early bassists for the group included Ron Crotty, Bob Bates and his brother Norman Bates; Lloyd Davis and Joe Dodge held the drum chair. In 1956 Brubeck hired drummer Joe Morello, who had been working with Marian McPartland; Morello's presence made possible the rhythmic experiments that were to come. In 1958 African-American bassist Eugene Wright joined for the group's U.S. Department of State tour of Europe and Asia. The group visited Poland, Turkey, India, Ceylon, Pakistan, Iran and Iraq on behalf of the U.S. Government. They spent two weeks in Poland, giving thirteen concerts and visiting with Polish musicians and citizens as part of the People-to-People program. Wright became a permanent member in 1959, making the \"classic\" Quartet's personnel complete. During the late 1950s and early 1960s Brubeck canceled several concerts when the club owners or hall managers objected to presenting an integrated band. He also canceled a television appearance when he found out that the producers intended to keep Wright off-camera.", "|Marian McPartland's Piano Jazz with guest: Dave Brubeck"]}, {"page": "Elvis Costello", "response": ["A CD recording of a collaboration with Marian McPartland on her show Piano Jazz was released in 2005. It featured Costello singing six jazz standards and two of his own songs, accompanied by McPartland on piano. In November, Costello started recording a new album with Allen Toussaint and producer Joe Henry. The River in Reverse was released in the UK on the Verve label the following year in May.", "*Piano Jazz (2005, with Marian McPartland)"]}, {"page": "Paul Desmond", "response": ["Desmond had met Dave Brubeck in 1944 while still in the military. Brubeck was trying out for the 253rd Army band, which Desmond belonged to. After making the cut he—unlike Desmond—was sent overseas in 1944, to Europe. Desmond once told Marian McPartland of National Public Radio's Piano Jazz that he was taken aback by the chord changes Brubeck introduced during that 1944 audition. After Desmond convinced Brubeck to hire him following his stint with Jack Fina, the two had a contract drafted (of which Brubeck was the sole signatory); the language forbade Brubeck from firing him, ensured Brubeck's status as group leader, and gave Desmond twenty percent of all profits generated from the quartet. That is how the Dave Brubeck Quartet had its start, a group that began in 1951 and ended in December 1967. The quartet became especially popular with college-age audiences, often performing in college settings like on their ground-breaking 1953 album Jazz at Oberlin at Oberlin College, or on their recordings on the campuses of Ohio University and the University of Michigan, among others. The success of the quartet led to a Time magazine piece on them in 1954, with the famous cover featuring Brubeck's face. The group played until 1967, when Brubeck switched his musical focus from performance to composition and broke the unit up. During the 1970s Desmond joined Brubeck for several reunion tours, including \"Two Generations of Brubeck\". Accompanying them were Brubeck's sons Chris Brubeck, Dan Brubeck and Darius Brubeck. In 1976 Desmond played 25 shows in 25 nights with Brubeck, touring the United States in several cities by bus."]}, {"page": "Peggy Lee", "response": ["In 2003, \"There'll Be Another Spring: A Tribute to Miss Peggy Lee\" was held at Carnegie Hall.  Produced by recording artist Richard Barone, the sold-out event included performances by Cy Coleman, Debbie Harry, Nancy Sinatra, Rita Moreno, Marian McPartland, Chris Connor, Petula Clark, Maria Muldaur, Dee Dee Bridgewater, Quincy Jones, Shirley Horn, and others. In 2004, Barone brought the event to a sold-out Hollywood Bowl, and then to Chicago's Ravinia Festival, with expanded casts including Maureen McGovern, Jack Jones, and Bea Arthur. The Carnegie Hall concert was broadcast on NPR's JazzSet.", "Over the years, her songwriting collaborators included David Barbour, Laurindo Almeida, Harold Arlen, Sonny Burke, Cy Coleman, Duke Ellington, Dave Grusin, Quincy Jones, Francis Lai, Jack Marshall, Johnny Mandel, Marian McPartland, Willard Robison, Lalo Schifrin, and Victor Young."]}, {"page": "Bix Beiderbecke", "response": ["During an engagement at the Cinderella Ballroom in New York during September–October 1924, Bix tendered his resignation with the Wolverines,Beiderbecke's replacement in the Wolverines was the 17-year-old Chicagoan Jimmy McPartland, who emulated but generally did not copy Beiderbecke's style. During World War II, McPartland married the English pianist Marian Turner in Germany; Marian McPartland went on to become a jazz great in her own right. leaving to join Jean Goldkette and his Orchestra in Detroit, but Beiderbecke's tenure with the band proved to be short-lived. Goldkette recorded for the Victor Talking Machine Company, whose musical director, Eddie King, objected to Beiderbecke's modernistic style of jazz playing.Sudhalter and Evans, p. 188. Moreover, despite the fact that Beiderbecke's position within the Goldkette band was \"third trumpet\", a less taxing role than 1st or 2nd trumpet, he struggled with the complex ensemble passages due to his limited reading abilities. After a few weeks, Beiderbecke and Goldkette agreed to part company, but to keep in touch, with Goldkette advising Beiderbecke to brush up on his reading and learn more about music.Sudhalter and Evans, p. 127. Some six weeks after leaving the band, Bix arranged a Gennett recording session back in Richmond with some of the Goldkette band members, under the name Bix and His Rhythm Jugglers. On January 26, 1925, they set two tunes to wax: \"Toddlin' Blues\", another number by LaRocca and Shields, and Beiderbecke's own composition, \"Davenport Blues\", which subsequently became a classic jazz number, recorded by musicians ranging from Bunny Berigan to Ry Cooder and Geoff Muldaur.Lion, pp. 338–339. An arrangement of \"Davenport Blues\" as a piano solo was published by Robbins Music in 1927."]}, {"page": "Duke Ellington", "response": ["Ellington continued listening to, watching, and imitating ragtime pianists, not only in Washington, D.C. but in Philadelphia and Atlantic City, where he vacationed with his mother during the summer.  He would sometimes hear strange music played by those who could not afford much sheet music, so for variations, they played the sheets upside down.Mercer Ellington to Marian McPartland, on Piano Jazz, rebroadcast on Hot Jazz Saturday Night, WAMU, 2018 April 28. Henry Lee Grant, a Dunbar High School music teacher, gave him private lessons in harmony. With the additional guidance of Washington pianist and band leader Oliver \"Doc\" Perry, Ellington learned to read sheet music, project a professional style, and improve his technique. Ellington was also inspired by his first encounters with stride pianists James P. Johnson and Luckey Roberts. Later in New York, he took advice from Will Marion Cook, Fats Waller and Sidney Bechet. He started to play gigs in cafés and clubs in and around Washington, D.C. His attachment to music was so strong that in 1916 he turned down an art scholarship to the Pratt Institute in Brooklyn. Three months before graduating, he dropped out of Armstrong Manual Training School, where he was studying commercial art."]}, {"page": "2013", "response": ["** Marian McPartland, British-born pianist (b. 1918)"]}, {"page": "Halcyon", "response": ["* Halcyon Records, a record label founded by Marian McPartland"]}, {"page": "Ornette Coleman", "response": ["Jazz pianist Joanne Brackeen stated in an interview with Marian McPartland that Coleman mentored her and gave her music lessons."]}, {"page": "Billy Mayerl", "response": ["In the 1930s Mayerl composed several works for the musical theatre including three connected with horse racing, Sporting Love, opening at the Gaiety Theatre, London in 1934, Twenty to One (Coliseum 1935), and Over She Goes (Saville 1936). In 1938, jazz pianist Marian McPartland joined his group \"Mayerl's Claviers\" under the name Marian Page."]}, {"page": "Bill Evans", "response": ["During a 1978 interview, Marian McPartland asked:", "Evans has left his mark on such players as Chick Corea, Diana Krall, Ralph Towner, Herbie Hancock, John McLaughlin, John Taylor, Steve Kuhn, Vince Guaraldi, Don Friedman, Marian McPartland, Denny Zeitlin, Paul Bley, Bobo Stenson, Warren Bernhardt, Michel Petrucciani, Lenny Breau, Keith Jarrett, Vicente Inti Jones Alvarado, and Rick Wright of Pink Floyd, as well as many other musicians worldwide. The music of Bill Evans continues to inspire younger pianists including Fred Hersch, Bill Charlap, Lyle Mays, and Eliane Elias and arguably Brad Mehldau early in his career."]}, {"page": "1918 in music", "response": ["*March 20 – Marian McPartland, British jazz pianist (d. 2013)"]}, {"page": "Sarah Vaughan", "response": ["Vaughan was frequently accompanied by a friend, Doris Robinson, on her trips into New York City. In the fall of 1942, by which time she was 18 years old, Vaughan suggested that Robinson enter the Apollo Theater Amateur Night contest. Vaughan played piano accompaniment for Robinson, who won second prize. Vaughan later decided to go back and compete as a singer herself. She sang \"Body and Soul\", and won—although the date of this victorious performance is uncertain. The prize, as Vaughan recalled to Marian McPartland, was $10 and the promise of a week's engagement at the Apollo. On November 20, 1942, she returned to the Apollo to open for Ella Fitzgerald."]}, {"page": "Joe Williams (jazz singer)", "response": ["* Marian McPartland, Piano Jazz with Joe Williams (Jazz Alliance, 1991)"]}, {"page": "Hazel Scott", "response": ["* Hazel Scott on Marian McPartland's Piano Jazz on NPR"]}, {"page": "Benny Golson", "response": ["Golson made a cameo appearance in the 2004 movie The Terminal, related to his appearance in \"A Great Day in Harlem\", a group photograph of prominent jazz musicians. Main character Viktor Navorski (Tom Hanks) travels to the US from Europe to obtain Golson's signature; Golson was one of seven musicians then surviving from the photo, the others being Johnny Griffin (died 2008), Eddie Locke (died 2009), Hank Jones (died 2010), Marian McPartland (died 2013), Horace Silver (died 2014), and Sonny Rollins. Golson's song \"Something in B Flat\" (from the album Benny Golson's New York Scene) can be heard during a scene where Viktor is painting and redecorating part of an airport terminal; in a later scene, Golson's band performs \"Killer Joe\"."]}, {"page": "William F. Buckley Jr.", "response": ["In his youth, Buckley developed many musical talents. He played the harpsichord very well, later calling it \"the instrument I love beyond all others\", although he admitted he was not \"proficient enough to develop [his] own style\". He was close friends with harpsichordist Fernando Valenti, who offered to sell Buckley his sixteen-foot pitch harpsichord. Buckley was also an accomplished pianist and appeared once on Marian McPartland's National Public Radio show Piano Jazz. A great admirer of Johann Sebastian Bach,\"Once Again, Buckley Takes on Bach\"; The New York Times; October 25, 1992. Buckley wanted Bach's music played at his funeral."]}, {"page": "Gerry Mulligan", "response": ["Mulligan also performed as a soloist or sideman (often in festival settings) with a variety of late-1950s jazz artists: Paul Desmond, Duke Ellington, Ben Webster, Johnny Hodges, Jimmy Witherspoon, André Previn, Billie Holiday, Marian McPartland, Louis Armstrong, Count Basie, Stan Getz, Thelonious Monk, Fletcher Henderson, Manny Albam, Quincy Jones, Kai Winding, Miles Davis, and Dave Brubeck. Mulligan appeared in Art Kane's A Great Day in Harlem portrait of 57 major jazz musicians taken in August 1958."]}, {"page": "John Lewis (pianist)", "response": ["The MJQ disbanded in 1974 because Jackson felt that the band was not getting enough money for the level of prestige the quartet had in the music scene.Lyons, pp. 81–82. During this break, Lewis taught at the City College of New York and at Harvard University. Lewis was also able to travel to Japan, where CBS commissioned his first solo piano album.Lyons, p. 80. While in Japan, Lewis also collaborated with Hank Jones and Marian McPartland,He met Marian McPartland while teaching at Harvard (Lyons, p. 80). with whom he performed piano recitals on various occasions."]}, {"page": "Four Brothers (jazz standard)", "response": ["Marian McPartland also recorded a live version on piano in 1959."]}, {"page": "Savoy Records", "response": ["| 12016|| /George Shearing || Great Britain's Marian McPartland & George Shearing"]}, {"page": "Earl Hines", "response": ["From then until his death twenty years later, Hines recorded endlessly, both solo and with contemporaries like Cat Anderson, Harold Ashby, Barney Bigard, Lawrence Brown, Dave Brubeck (they recorded duets in 1975), Jaki Byard (duets in 1972), Benny Carter, Buck Clayton, Cozy Cole, Wallace Davenport, Eddie \"Lockjaw\" Davis, Vic Dickenson, Roy Eldridge, Duke Ellington (duets in 1966), Ella Fitzgerald, Panama Francis, Bud Freeman, Stan Getz, Dizzy Gillespie, Paul Gonsalves, Stephane Grappelli, Sonny Greer, Lionel Hampton, Coleman Hawkins, Milt Hinton, Johnny Hodges, Peanuts Hucko, Helen Humes, Budd Johnson, Jonah Jones, Max Kaminsky, Gene Krupa, Ellis Larkins, Shelly Manne, Marian McPartland (duets in 1970), Gerry Mulligan, Ray Nance, Oscar Peterson (duets in 1968), Russell Procope, Pee Wee Russell, Jimmy Rushing, Stuff Smith, Rex Stewart, Maxine Sullivan, Buddy Tate, Jack Teagarden, Clark Terry, Sarah Vaughan, Joe Venuti, Earle Warren, Ben Webster, Teddy Wilson (duets in 1965 and 1970), Jimmy Witherspoon, Jimmy Woode and Lester Young. Possibly more surprising were Alvin Batiste, Tony Bennett, Art Blakey, Teresa Brewer, Barbara Dane, Richard Davis, Elvin Jones, Etta Jones, the Ink Spots, Peggy Lee, Helen Merrill, Charles Mingus, Oscar Pettiford, Vi Redd, Betty Roché, Caterina Valente, Dinah Washington, and Ry Cooder (on the song \"Ditty Wah Ditty\")."]}, {"page": "46th Annual Grammy Awards", "response": ["*Marian McPartland"]}, {"page": "Michel Camilo", "response": ["Other musicians he has played with include Tito Puente, Paquito D'Rivera, Dizzy Gillespie, Katia Labèque, Toots Thielemans, Airto Moreira, Chuck Mangione, Stanley Turrentine, Claudio Roditi, Nancy Alvarez, Mongo Santamaría, George Benson, Eddie Palmieri, Jon Faddis, Gonzalo Rubalcaba, Lew Soloff, Tania Maria, Jaco Pastorius, Patato, Randy Brecker, Michael Brecker, Chuck Loeb, Giovanni Hidalgo, Guarionex Aquino, Wynton Marsalis, Dave Valentin, Flora Purim, Delfeayo Marsalis, Chucho Valdés, Joe Lovano, Herbie Hancock, Tomatito, John Patitucci, David Sanchez, Hiromi Uehara, Cachao, Marcus Roberts, Steve Gadd, Danilo Perez, Gary Burton, Billy Taylor, Dave Weckl, Hilton Ruiz, Roy Hargrove, Romero Lubambo, Niels-Henning Ørsted Pedersen, Leny Andrade, Bireli Lagrene, Marian McPartland,  Leonard Slatkin, Arturo Sandoval, Aisha Syed Castro, Béla Fleck, Lou Marini, Cliff Almond, Mark Walker."]}, {"page": "Lyle Mays", "response": ["While growing up in rural Wisconsin, Mays had a lot of curiosity but had to learn many things all by himself due to a lack of available resources and information. He had four main interests: chess, mathematics, architecture, and music. His mother Doris played piano and organ, and his father Cecil, a truck driver, taught himself to play guitar by ear.  His teacher allowed him to practice improvisation after the structured elements of the lesson were completed. At the age of nine, he played the organ at a family member's wedding, and fourteen he began to play in church. In summer national stage band camp in Normal, Illinois, he was introduced to jazz pianist Marian McPartland in his senior year of high school."]}, {"page": "Joe Morello", "response": ["After moving to New York City, Morello worked with numerous notable jazz musicians including Johnny Smith, Tal Farlow, Stan Kenton, Phil Woods, Sal Salvador, Marian McPartland, Jay McShann, Art Pepper, and Howard McGhee. After a period of playing in McPartland's trio, Morello declined invitations to join both Benny Goodman and Tommy Dorsey's bands, favoring a temporary two-month tour with the Dave Brubeck Quartet in 1955. Morello remained with Brubeck for well over a decade, departing in 1967. Morello later became an in-demand clinician, teacher and bandleader, whose former students include Danny Gottlieb, TigerBill Meligari, Bruce Springsteen E Street Band drummer Max Weinberg, Rich Galichon, Phish drummer Jon Fishman, Gary Feldman, Patrick Wante, Tony Woo, Frankie Valli and the Four Seasons drummer Gerry Polci, Jerry Granelli, RIOT drummer Sandy Slavin, retired Army Blues drummer Steve Fidyk, Glenn Johnson, Pittsburgh drummer Bennett Carlise, Level System author and professional drummer Jeff W. Johnson, and Bon Jovi drummer Tico Torres.", "With Marian McPartland", "* 1955 Marian McPartland in Concert", "* 1957 The Marian McPartland Trio"]}, {"page": "Arthur Godfrey's Talent Scouts", "response": ["Contestants on the show included Pat Boone, The Chordettes, The McGuire Sisters and Carmel Quinn, all of whom went on to perform on Arthur Godfrey and His Friends. Other contestants included Tony Bennett, The Blackwood Brothers, Lenny Bruce, Roy Clark, Rosemary Clooney, Ken Berry, Florian ZaBach, Wally Cox, Vic Damone, The Diamonds, Eddie Fisher, Connie Francis, Don Knotts, Steve Lawrence, Al Martino, Barbara McNair, Marian McPartland, Johnny Nash, Leslie Uggams, Lorraine Donahue (who later appeared on The Voice of Firestone), Joe Negri, Roger Williams (pianist), and Jonathan Winters. Swedish singer Kjerstin Dellert won a contest in 1948 with Someone to Watch Over Me, beginning her career as a vocalist there.Kjerstin Dellert i förtroende  p. 84 Patsy Cline first gained national attention with a winning performance of Walkin' After Midnight on the January 21, 1957, broadcast. Among those who auditioned but were not chosen to appear on the broadcast were Buddy Holly, The Four Freshmen, and Elvis Presley."]}, {"page": "Ahmad Jamal", "response": ["Jamal, speaking about his own work, says, \"I like doing ballads. They're hard to play. It takes years of living, really, to read them properly.\" From an early age, Jamal developed an appreciation for the lyrics of the songs he learned: \"I once heard Ben Webster playing his heart out on a ballad. All of a sudden he stopped. I asked him, 'Why did you stop, Ben?' He said, 'I forgot the lyrics.'\" Jamal attributes the variety in his musical taste to the fact that he grew up in several eras: the big band era, the bebop years, and the electronic age.Early, p. 81. He says his style evolved from drawing on the techniques and music produced in these three eras. In 1985, Jamal agreed to do an interview and recording session with his fellow jazz pianist, Marian McPartland on her NPR show Piano Jazz. Jamal, who said he rarely plays \"But Not For Me\" due to its popularity since his 1958 recording, played an improvised version of the tune – though only after noting that he has moved on to making ninety percent of his repertoire his own compositions. He said that when he grew in popularity from the Live at the Pershing album, he was severely criticized afterwards for not playing any of his own compositions.\"Ahmad Jamal On Piano Jazz 1985\". Piano Jazz. NPR. August 29, 2008. Radio."]}]}}