{"wiki_id": "http://www.wikidata.org/entity/Q275360", "itemLabel": "Natasha Little", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Natasha_Little", "wikipedia_page": {"main": "Natasha Emma Little (born 2 October 1969) is an English actress. She is best known for her roles as Edith Thompson in the film Another Life, Lady Caroline Langbourne in the BBC miniseries The Night Manager, and Christina Moxam in the BBC miniseries Thirteen.", "link_mentions": [{"page": "Vanity Fair (novel)", "response": ["*Vanity Fair (2004), directed by Mira Nair and starring Reese Witherspoon as Becky Sharp and Natasha Little, who had played Becky Sharp in the earlier television miniseries of Vanity Fair, as Lady Jane Sheepshanks", "*Vanity Fair (1998), a BBC miniseries starring Natasha Little as Becky Sharp"]}, {"page": "Leytonstone", "response": ["*Natasha Little (born 1969), actor"]}, {"page": "Bond girl", "response": ["|Honor Blackman (likeness), Natasha Little (voice)"]}, {"page": "William Boyd (writer)", "response": ["Boyd adapted two Anton Chekhov short stories – \"A Visit to Friends\" and \"My Life (The Story of a Provincial)\" – to create the play Longing. The play, directed by Nina Raine and performed at London's Hampstead Theatre, starred Jonathan Bailey, Tamsin Greig, Natasha Little, Eve Ponsonby, John Sessions and Catrin Stewart. Previews began on 28 February 2013; the press night was 7 March 2013. Boyd, who was theatre critic for the University of Glasgow in the 1970s and has many actor friends, refers to his ambition to write a play as finally getting \"this monkey off my back\". A further play by Boyd, The Argument, described as a Strindberg-like take on human dynamics, was performed at Hampstead Theatre Downstairs in March 2016. Both plays have been published."]}, {"page": "Ai Orikasa", "response": ["*Absentia as Julianne Gunnarsen (Natasha Little)"]}, {"page": "Natasha", "response": ["* Natasha Little (born 1969), British actress"]}, {"page": "Rachael Stirling", "response": ["Other film appearances include Maybe Baby, Redemption Road (2001), Complicity (with her Tipping the Velvet co-star Keeley Hawes), Another Life (with Vanity Fair actress Natasha Little), The Triumph of Love (with Mira Sorvino), as Mary Jones in Salmon Fishing in the Yemen, and as Anna in Snow White and the Huntsman."]}, {"page": "Edith Thompson and Frederick Bywaters", "response": ["Weis' biography, with a new preface about the case and his letter of appeal to the Home Secretary, appeared in 2001, as did the film Another Life, which told their story, and in which Natasha Little played Edith Thompson, Nick Moran played Percy Thompson and Ioan Gruffudd played Frederick Bywaters."]}, {"page": "Vanity Fair (2004 film)", "response": ["*Natasha Little as Lady Jane Sheepshanks Crawley"]}, {"page": "This Life (1996 TV series)", "response": ["During the second series, storylines were expanded to include other connected characters. These included Ferdy (Ramon Tikaram), briefly Warren's boyfriend; Rachel (Natasha Little) a new junior trainee at Milly's law firm; and Francesca, Miles's girlfriend and later fiancée. Previously secondary characters Jo (Steve John Shepherd) and Warren's cousin, Kira (Luisa Bradshaw-White) feature more heavily as they embarked upon a relationship. Moore  Spencer Wright receptionist Kelly (Sacha Craise) also became much more prominent. Ferdy was a bisexual character, seen as a replacement for Warren when Jason Hughes decided to leave the show (he did return for the final scene). Finding a relationship with Anna impossible, Miles began a relationship with Francesca, a woman nearly a decade older than he was. Miles proposed to Francesca, but still harboured feelings for Anna.", "* Natasha Little as Rachel"]}, {"page": "Anna Acton", "response": ["From 2015 to 2016, Acton appeared in the BBC One medical soap Casualty as Nikki Chisom. In 2018, she appeared in Birches, a UK-based feature based on the novel Silver Birches published in 2009 by Adrian Plass. Birches was turned into a film directed by Randall Stevens, with screenplay by Mark Freiburger. It starred Natasha Little and Todd Carty. In May 2021, she appeared in an episode of the BBC soap opera Doctors as Vicki."]}, {"page": "Cat Among the Pigeons", "response": ["An adaptation of the novel was made for the series Agatha Christie's Poirot on 28 September 2008, starring David Suchet as Hercule Poirot. The cast included Dame Harriet Walter as Miss Bulstrode, Natasha Little as Ann Shapland, Claire Skinner as Miss Rich, Susan Wooldridge as Miss Chadwick, Miranda Raison as Mlle Blanche, Elizabeth Berrington as Miss Springer, Katie Leung as Hsui Tai Wan, Raji James as Prince Ali Yusuf, and Adam Croasdell as Adam Goodman. Written by Mark Gatiss, the adaptation featured a change in setting to the 1930s, matching that for the TV series, which meant that many of the novel's scenes set in Egypt and the Middle East, as well as those related to the British secret service had to be rewritten or eliminated. As such, the adaptation features a significant number of plot changes:"]}, {"page": "Kevin & Perry Go Large", "response": ["|Natasha Little"]}, {"page": "Greenfingers", "response": ["* Natasha Little – Primrose Woodhouse"]}, {"page": "1999 British Academy Television Awards", "response": ["** Natasha Little — Vanity Fair (BBC One)"]}, {"page": "Tom Quinn (Spooks)", "response": ["Later in the second series, Tom starts a brief relationship with Vicky Westbrook (Natasha Little), which he ends due to her behaviour after an EERIE (Extreme Emergency Response Initiative Exercise) in the fifth episode. In the following episode, Vicky retaliates by posting his phone number in Soho telephone boxes and clubs, garnering him unwanted attention. While Tom has Sam Buxton (Shauna Macdonald) find and destroy every leaflet, CIA liaison Christine Dale (Megan Dodds) makes Vicky stop the harassment. At the end of the episode, he starts a relationship with Dale, which superior Harry Pearce (Peter Firth) disapproves of, demanding that he end it. In later episodes, a shift in consciousness starts to interfere with Tom's work, such as when he goes undercover to stop a renegade British Army major. In the series two finale, he learns from Dale that an American assassin, Mickey Karharias, is visiting the UK. It is later revealed Karharias was actually killed, and the entire operation was orchestrated by supposedly dead CIA agent Herman Joyce (Tomas Arana), who is seeking revenge on Tom for ruining his daughter's life when Tom recruited her. Joyce frames Tom for assassinating the Chief of the Defence Staff. While Tom attempts to prove his innocence, Harry corners him, forcing Tom to wound Harry and escape into the North Sea. At the end of the episode, the team assumes he drowned."]}, {"page": "Foyle's War (series 5)", "response": ["|colspan=\"6\"|Guests: Nicholas Woodeson, Graham Crowden, Duncan Bell, Phyllida Law, Natasha Little, Joseph Mawle, Roger Sloman, Jay Simpson, Jesse Birdsall"]}, {"page": "The Queen of Sheba's Pearls", "response": ["* Natasha Little ...  Peggy Pretty"]}, {"page": "Vanity Fair (1998 TV serial)", "response": ["* Natasha Little as Becky Sharp", "*1999: Biarritz International Festival of Audiovisual Programming -  Best TV Series and Serials, Best Actress (Natasha Little), Screenplay"]}, {"page": "Another Life (2001 film)", "response": ["Another Life is a 2001 British crime film written and directed by Philip Goodhew. It stars Ioan Gruffudd, Natasha Little, Nick Moran, Imelda Staunton, Rachael Stirling and Tom Wilkinson.", "*Natasha Little as Edith Graydon (later Thompson)"]}, {"page": "Becky Sharp", "response": ["Vanity Fair has also been produced numerous times for television. It was first serialised by the BBC in 1956, and starred Joyce Redman. The second BBC version in 1967, starred Susan Hampshire. This was followed twenty years later, also by the BBC at the Pebble Mill studios, with Eve Matheson as Sharp. Andrew Davies wrote the screenplay of a BBC television drama of Vanity Fair which was screened in 1998; Natasha Little played Becky Sharp. Little won the Best Actress in a Drama Series category in the following year's Biarritz International Television Festival as well as a BAFTA nomination for Best Actress in a Leading Role for her portrayal of Sharp. Olivia Cooke played Sharp in a 2018 television series, screened on ITV over seven episodes."]}, {"page": "List of American films of 2004", "response": ["| Vanity Fair || Focus Features || Mira Nair (director); Matthew Faulk, Mark Skeet, Julian Fellowes (screenplay); Reese Witherspoon, Eileen Atkins, Jim Broadbent, Gabriel Byrne, Romola Garai, Bob Hoskins, Rhys Ifans, James Purefoy, Jonathan Rhys Meyers, Sophie Hunter, Geraldine McEwan, Douglas Hodge, Natasha Little, John Woodvine, Barbara Leigh-Hunt, Nicholas Jones, Sian Thomas, Trevor Cooper, Kelly Hunter, Camilla Rutherford, Alexandra Staden, Tony Maudsley, John Franklyn-Robbins, Deborah Findlay, Daniel Hay, Tom Sturridge, Kathryn Drysdale, Ruth Sheen, Richard McCabe, Gledis Cinque, William Melling || Drama ||"]}, {"page": "List of Spooks characters", "response": ["*Vicki Westbrook (Natasha Little) (2003) - Tom Quinn's ex-girlfriend."]}, {"page": "Mr. Nobody (film)", "response": ["Mr. Nobody is a 2009 science fiction drama film written and directed by Jaco Van Dormael and starring Jared Leto, Sarah Polley, Diane Kruger, Linh Dan Pham, Rhys Ifans, Natasha Little, Toby Regbo and Juno Temple. The film tells the life story of Nemo Nobody, a 118-year-old man who is the last mortal on Earth after the human race has achieved quasi-immortality. Nemo, memory fading, refers to his three main loves and to his parents' divorce and subsequent hardships endured at three critical junctions in his life: at age nine, fifteen, and thirty-four. Alternate life paths branching out from each of those critical junctions are examined. The speculative narrative often changes course with the flick of a different possible decision at each of those ages. The film uses nonlinear narrative and the multiverse hypothesis style.", "* Natasha Little as Nemo's mother. Little was suggested by the casting director in London. Van Dormael said that \"her role was decisive for the film: it was necessary that the mother should destroy the childhood happiness but that one would feel the need to go with her at the same time. That's what Natasha managed to achieve.\""]}, {"page": "Mark Freiburger", "response": ["* Writer of Birches UK based feature. Based on the novel 'Silver Birches' (published in 2009 by Adrian Plass), was turned into a film starring Natasha Little, Anna Acton and Todd Carty. "]}, {"page": "List of British films of 1999", "response": ["|The Criminal|| Julian Simpson|| Steven Mackintosh, Eddie Izzard, Natasha Little || Thriller ||"]}, {"page": "List of British films of 2001", "response": ["|Another Life||Philip Goodhew||Ioan Gruffudd, Natasha Little||Drama||"]}, {"page": "List of people from the London Borough of Waltham Forest", "response": ["* Natasha Little"]}, {"page": "Mistresses (British TV series)", "response": ["Series two begins with Katie taking a junior post in a hospital department working alongside an old lover from medical school, Jack Hudson (Steven Brand), now married to Megan (Natasha Little) but still holds a torch for Katie. Katie also meets Jack and Megan's friend, fellow surgeon Dan Tate (Mark Umbers), with whom she strikes up a relationship. All goes well until Jack decides to act on his feelings for Katie and they embark on a brief affair. Katie ends the affair before she is discovered but Dan witnesses a final kiss between the pair and decides to move to Australia to take up a medical post he's been offered. Katie leaves a heartfelt note of apology for Dan, which he reads before asking her to go with him to Australia."]}, {"page": "Cultural depictions of Anne Boleyn", "response": ["* In a dream sequence at the start of Kevin & Perry Go Large, the teenage character Kevin is reading a book on Anne Boleyn for his homework, but instead his mind wanders to a sexual fantasy in which Anne (played by Natasha Little and speaking in 20th-century teenage slang) convinces her executioner (Kevin) that to kill her would be a waste of her beautiful body and in return gives him oral sex."]}, {"page": "British Academy Television Award for Best Actress", "response": ["|Natasha Little "]}, {"page": "The Nearly Complete and Utter History of Everything", "response": ["*Natasha Little – Lady Lionbrain"]}, {"page": "List of British actors", "response": ["* Natasha Little (born 1969)"]}, {"page": "List of American films of 2009", "response": ["| Mr. Nobody || Wild Bunch Distribution || Jaco Van Dormael (director); Jared Leto, Sarah Polley, Diane Kruger, Linh Dan Pham, Rhys Ifans, Natasha Little, Toby Regbo, Juno Temple"]}, {"page": "The Boys Are Back (film)", "response": ["* Natasha Little as Flick"]}, {"page": "1969 in British television", "response": ["* 2 October – Natasha Little, actress"]}, {"page": "Public Property", "response": ["It also featured on-screen cameos by Stephen Fry, Elize du Toit and Natasha Little."]}, {"page": "Adrian Plass", "response": ["His novel 'Silver Birches' (published in 2009), was turned into a film directed by Randall Stevens, with screenplay by Mark Freiburger and starred Natasha Little, Anna Acton and Todd Carty."]}, {"page": "Spooks (series 2)", "response": ["The second series of the British spy drama television series Spooks (known as MI-5 in the United States) began broadcasting on 2 June 2003 on BBC One, ending on 11 August 2003. It consists of ten episodes. Spooks centres on the actions of Section D, a counter-terrorism division of the British Security Services (MI5). Matthew Macfadyen, Keeley Hawes, David Oyelowo, Peter Firth, Hugh Simon, Shauna Macdonald, Rory MacGregor, Natasha Little, Nicola Walker, Megan Dodds, Jenny Agutter and Enzo Cilenti are listed as the main cast.", "* Natasha Little as Vicki Westbrook"]}]}}