{"wiki_id": "http://www.wikidata.org/entity/Q2753575", "itemLabel": "George Taylor", "itemDescription": "British botanist (1904-1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Taylor_(botanist)", "wikipedia_page": {"main": "Sir George Taylor, FRS FRSE FLS LLD (15 February 1904, in Edinburgh – 13 November 1993, in Dunbar) was a Scottish botanist.", "link_mentions": [{"page": "Sissinghurst Castle Garden", "response": ["Nigel Nicolson had always been devoted to his father, and admiring of his more distant mother. Preserving Sissinghurst was \"an act of intense filial duty\". He had first raised the possibility of giving the house and garden to the National Trust in 1954, but Sackville-West was adamantly opposed. After her death in 1962, which saw the castle pass to him although Benedict was the elder son, he began lengthy negotiations to bring about the handover. The Trust was cautious: it felt that an endowment beyond the Nicolsons' means would be required, and it was also unsure that the garden was of sufficient importance to warrant acceptance. Sir George Taylor, Chairman of the National Trust's Gardens Committee doubted it was \"one of the great gardens of England\", and had to be persuaded of its merits by Sackville-West's close friend and one-time lover, the gardener Alvilde Lees-Milne. Discussions continued until, in April 1967, the castle, garden, and Sissinghurst Farm were finally accepted."]}, {"page": "Royal Botanic Garden Edinburgh", "response": ["*George Taylor, director"]}, {"page": "George Heriot's School", "response": ["* Sir George Taylor (botanist) (1904 - 1993) "]}, {"page": "George Taylor", "response": ["George Taylor may refer to:", "*George Taylor (Alamo defender) (c. 1816–1836), soldier in Texas army, died in the Battle of the Alamo", "*George Taylor (British Army officer) (1905–1994), served in World War II, the Korean War, and the Mau Mau campaign", "*George Taylor (Medal of Honor) (1830–1893), American Civil War sailor and Medal of Honor recipient", "*George Taylor (Canadian politician) (1840–1919), Canadian House of Commons member", "*George Taylor (Pennsylvania politician) (c. 1716–1781), signer of the U.S. Declaration of Independence", "*George Taylor (New York Representative) (1820–1894), American Congressman from New York", "*George Taylor (Connecticut politician) (1802–1881), politician and physician", "*George Taylor (Australian politician) (1861–1935), Australian labour leader and member of the Legislative Assembly of Western Australia", "*George Taylor (Australian rules footballer) (1876–1953), Australian rules footballer who played with South Melbourne", "*George Taylor (manager) (1853–1911), American baseball manager", "*George Taylor (cricketer) (1909–1986), English cricket player", "*George Taylor (footballer, born 1900) (1900–1982), played in the Football League for Brentford and Millwall", "*George Taylor (footballer, born 1907) (1907–?), English football outside right, who played for Coventry City F.C. in the 1930s", "*George Taylor (footballer, born 1909) (1909–?), English football left half", "*George Taylor (footballer, born 1915) (1915–1982), Scottish footballer, played for Aberdeen and Plymouth Argyle", "*George Taylor (footballer, born 1920) (1920–1983), English football goalkeeper, played for West Ham United", "*George Taylor (footballer, born 1948), Scottish footballer, played for Grimsby Town", "*George Taylor (Negro leagues) (1869–?), Negro leagues first baseman", "*George Taylor (rugby league), rugby league footballer of the 1900s, 1910s and 1920s", "*George Taylor (DC Comics), fictional character in the DC Comics universe, chief editor of the Daily Star", "*George Taylor (artist) (1914–1996), English commercial artist", "*Sir George Taylor (botanist) (1904–1993), British botanist, from 1956 to 1971 director of the Royal Botanic Gardens, Kew", "*George Taylor (gardener) (1803–1891), introduced celery to the United States", "*George Taylor (priest) (died 1811), Anglican priest", "*Taylor (Planet of the Apes), Colonel George Taylor, fictional hero of the first two films of the original Planet of the Apes series played by Charlton Heston"]}, {"page": "Meconopsis villosa", "response": ["Meconopsis villosa, the Himalayan woodland-poppy, is an ornamental poppy, which is native of Nepal. The species was placed in the genus Cathcartia erected by J.D. Hooker to honour J.F. Cathcart, an Indian civil servant and amateur botanist who collected and hired native artists to illustrate the flowers of the Himalayas. It was transferred to Meconopsis by George Taylor in 1934. In 2017, it was suggested that the genus Cathcartia should be revived, and this species again treated as Cathcartia villosa."]}, {"page": "Boroughmuir High School", "response": ["*Sir George Taylor (botanist and Director of the Botanic Gardens)"]}, {"page": "List of authors of South African botanical taxa", "response": ["*George Taylor (1904-1993) S ........ G.Taylor"]}, {"page": "Ledermanniella keayi", "response": ["It was first described in 1953 as Inversodicraea keayi by George Taylor, but the genus was revised to Ledermanniella by Colette Cusset in 1974"]}, {"page": "List of people with surname Taylor", "response": ["* George Taylor (botanist) (1904–1993), Scottish botanist", "* John George Taylor (), British official of the Foreign Office, an archaeologist investigating the antiquities of the Middle East", "* George Taylor (Alamo defender) (c. 1816 – 1836), soldier in Texas army, died in the Battle of the Alamo", "* George Taylor (delegate) (c. 1716–1781), signer of the U.S. Declaration of Independence", "* George Taylor (Leeds South) (1840–1919), Canadian House of Commons member", "* George Taylor (New York Representative) (1820–1894), American Congressman from New York", "* George Taylor (manager) (1853–1911), American Brooklyn Dodgers manager", "* George Taylor (disambiguation)", "* George Taylor, main character in the film Planet of the Apes"]}, {"page": "Paeonia delavayi", "response": ["Paeonia delavayi with maroon-red and P. lutea with yellow flowers, both from Northwest Yunnan were described respectively by Adrien René Franchet and Delavay, on the same page of the same scientific article in 1886. In 1904 Finet and Gagnepain thought these should both be regarded varieties of P. delavayi. Komarov described P. potaninii from West Sichuan in 1921, with smaller, deep maroon-red flowers and narrower leaf segments. In 1931 Stern adds P.  trollioides from Northwest Yunnan with yellow flowers shaped like those of Trollius, growing more erect and having larger fruits, which he reduces to P. potaninii var. trollioides in 1946, in addition to recognizing P. potaninii, P. delavayi and P. lutea. In 1953 Stern in cooperation with George Taylor described one more taxon, P. lutea var. ludlowii, discovered in southeastern Tibet. Fang in 1958 agreed with Stern but ignored P. lutea var. ludlowii. Wu renamed P. potaninii to P. delavayi var. angustiloba and distinguished P. lutea from P. delavayi in 1984. In 1990 Gong recognized P. delavayi, P. lutea, P. potaninii, P. potaninii var. trollioides, and added P. potaninii forma alba with white petals. Pan (1979, 1993) on the other hand only recognized P. delavayi including var. lutea and var. angustiloba, but did not mention P. lutea var. ludlowii."]}, {"page": "Paeonia ludlowii", "response": ["|right|seedsIn 1886 P. delavayi with maroon-red and P. lutea with yellow flowers, both from Northwest Yunnan, were described respectively by Franchet and Delavay, on the same page of the same scientific article. In 1904 Finet and Gagnepain thought these should both be regarded varieties of P. delavayi. In 1953 F.C. Stern and George Taylor described one more taxon, P. lutea var. ludlowii, discovered in southeastern Tibet. In their description of Paeonia lutea var. ludlowii, these authors indicate that it is distinctly different from variety lutea. Recent analysis shows that these differences between ludlowii and the other described taxa in the P. delavayi-group are consistent whilst the character states within the other taxa occur in any combination. Therefore Hong concludes that ludlowii should be acknowledged as a distinct species, while the other taxa cannot be upheld and should be synonymized with P. delavayi."]}, {"page": "James Macdonald (ornithologist)", "response": ["In 1962 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were D. A. Bannerman, Sir Landsborough Thomson, Sir George Taylor, Edward Hindle and V. C. Wynne-Edwards. He resigned from the Society in 1987."]}, {"page": "Paeonia sterniana", "response": ["Paeonia sterniana resulted from hybridisation between P. lactiflora and P. mairei which in the past probably were sympatric in the Himalayas, but are no longer present in the same area where P. sterniana occurs. P. sterniana was discovered for western science in 1938, by Frank Ludlow and George Taylor. Seeds were brought to the West in 1947, and subsequently cultivation started at Kew Gardens. Harold Roy Fletcher described the species in 1959. In 1997 Joseph Halda thought this taxon not worthy of full species status and reduced it to P. emodi subsp. sterniana. This view however is not supported in the most recent literature."]}, {"page": "List of fellows of the Royal Society S, T, U, V", "response": ["|George Taylor||21/03/1968||15 February 1904 – 13 November 1993"]}, {"page": "Keeper of Botany, Natural History Museum", "response": ["*George Taylor 1950–1956"]}, {"page": "G.Taylor", "response": ["#REDIRECT George Taylor (botanist)"]}, {"page": "List of botanists by author abbreviation (G)", "response": ["* G.Taylor – Sir George Taylor (1904–1993)"]}, {"page": "1962 New Year Honours", "response": ["* George Taylor, Director, Royal Botanic Gardens, Kew."]}, {"page": "List of fellows of the Royal Society elected in 1968", "response": ["#Sir George Taylor"]}, {"page": "Frederick Smith, 2nd Baron Colwyn", "response": ["He married three times: firstly, in 1940, to Miriam Gwendoline Ferguson. They divorced in 1951. Secondly, in 1952, to Hermoine Sophia O'Bryen Hoare. They divorced in 1954. Thirdly, in 1955 to Beryl Reddington. His last wife Beryl remarried in 1969 to the botanist, George Taylor. "]}]}}