{"wiki_id": "http://www.wikidata.org/entity/Q27548139", "itemLabel": "Henrietta Amelia Leeson", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Henrietta_Amelia_Leeson", "wikipedia_page": {"main": "Henrietta Amelia Leeson (1751 – 6 December 1826) was an English actress of the 18th-century. Known as Mrs Lewis after her marriage to the actor William Thomas Lewis In 1780, she appeared regularly with him at the Theatre Royal, Drury Lane. She made over 100 appearances on the London stage between 1775 and 1791.\nBorn in London, Leeson developed an early interest in the theatre through the encouragement and support of her friends exacerbated by the frequent absence of her father from the family home owing to the long hours he worked in his printer's business. The Irish actor Charles Macklin took her on  as an apprentice and in 1771 she accompanied him to Ireland where she made her début at the Crow Street Theatre in Dublin. Leeson played a number of roles on her tour of Ireland with Macklin's company including Portia in The Merchant of Venice and Desdemona in Othello. On their return to Dublin Leeson continued to act in Macklin's company but he had become \"deeply but fruitlessly infatuated with her\" and he released her from her apprenticeship, following which she joined the Dawson Company at the Capel Street Theatre. She began to live with the actor William Thomas Lewis and went with him to England in 1775 where they married in about 1780. She appeared with Lewis at the Theatre Royal, Drury Lane, at first as Mrs Leeson and later as Mrs Lewis. She joined her husband on his tours of the provinces.The quality of her acting was debated: Joseph Haslewood claimed her occasional appearances on the London stage (103 appearances between 1775 and 1791) were largely owing to her wanting to provide for her large family rather than through a desire to display her talent. However, another critic said of her first appearance at Covent Garden that 'there was an ease and nature in her deportment and dialogue that entitles her to encouragement', while Tate Wilkinson described her as 'an amiable handsome woman, and a pleasing actress'.With her husband she had five sons and three daughters: Harry Lewis (1780-); Thomas Lewis (1782-); Edward George Lewis (1783–); Henry Lewis (1784-); Rosa Frances Lewis (1784–1862); Thomas Denison Lewis (1787–1849); Henrietta Lenthal Lewis (1788–1842), and Frances Lewis (1789–1809). Her son Henry appeared at Covent Garden and played a few parts, with little success. He was then on the Dublin stage.\nIn her later years Leeson lived in Liverpool and here she died on 6 December 1826 aged 75.", "link_mentions": [{"page": "Henrietta (given name)", "response": ["* Henrietta Amelia Leeson (1751–1826), English actress "]}, {"page": "List of British actors", "response": ["* Henrietta Amelia Leeson (1751–1826)"]}, {"page": "William Thomas Lewis", "response": ["A member of his first Dublin company, Henrietta Amelia Leeson, who was a pupil of Charles Macklin, subsequently became Lewis's wife. They had three sons and two daughters. One son, Henry Lewis, appeared at Covent Garden, and played a few parts, with little success. He was then on the Dublin stage."]}, {"page": "Henrietta Amelia Lewis", "response": ["#REDIRECTHenrietta Amelia Leeson"]}, {"page": "Mrs Lewis", "response": ["#REDIRECTHenrietta Amelia Leeson"]}, {"page": "Capel Street Theatre", "response": ["Among the actors to appear here were: Charles Macklin, Elizabeth Younge,Robert Farquharson Sharp (1909) A Short History of the English Stage: From Its Beginnings to the Summer of the Year 1908 p.312, Walter Scott Publishing Company, London and New York William Thomas Lewis,On 26 February 1770 he was Sir Harry Newburgh in Hugh Kelly's False Delicacy. Hastings in The Tragedy of Jane Shore by Nicholas Rowe followed. and Henrietta Amelia Leeson. The dramatist Robert Houlton wrote works for the theatre for a season, sharing the honours with Walley Chamberlain Oulton."]}]}}