{"wiki_id": "http://www.wikidata.org/entity/Q2756017", "itemLabel": "Douglas P.", "itemDescription": "British singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Douglas_P.", "wikipedia_page": {"main": "Douglas P. (born Douglas Pearce, 27 April 1956), is an English folk musician, record label owner, photographer and actor who records under the name Death in June. He was born in Sheerwater in Woking, Surrey, and resides in Australia.", "link_mentions": [{"page": "Current 93", "response": ["Tibet has been the only constant member in the group, though Steven Stapleton (of Nurse with Wound) has appeared on nearly every Current 93 release. Michael Cashmore has also been a constant contributor since Thunder Perfect Mind. Douglas P. of Death in June has played on well over a dozen Current 93 releases, and Steve Ignorant of Crass (using the name Stephen Intelligent), Boyd Rice, runologist Freya Aswynn, Nick Cave, Björk, Andrew W.K., Anohni, Baby Dee, Will Oldham, Ben Chasny, Rose McDowall, have also lent their talents over the years."]}, {"page": "Boyd Rice", "response": ["| Scorpion Wind (w/ Douglas P. & John Murphy)", "* Live in Osaka (DVD) Features a concert performance from Osaka, Japan, in 1989, with Michael Moynihan, Tony Wakeford, Douglas P., and Rose McDowall. Also includes Rice's films Invocation (One) and Black Sun."]}, {"page": "Michael J. Moynihan", "response": ["Experimental musician Boyd Rice invited Moynihan to go to Japan and collaborate with him on three NON performances there in 1989. Moynihan performed in concert with the various musical groups rotating around Tony Wakeford, Douglas P., and Rose McDowall who were also performing. His performance in Japan with NON was later released as the \"Live in Osaka\" DVD. That year, an album entitled Music, Martinis, and Misanthropy grew out of these collaborations. Moynihan also took the cover photo and did the graphic design work for the album, which was loosely based on the 1954 easy listening release by Jackie Gleason, Music, Martinis and Memories."]}, {"page": "Douglas Pearce", "response": ["#REDIRECT Douglas P."]}, {"page": "Douglas P", "response": ["#REDIRECT Douglas P."]}, {"page": "Music, Martinis and Misanthropy", "response": ["Music, Martinis and Misanthropy is an album by Boyd Rice, released in 1990 by New European Recordings. It was recorded in Tokyo, Japan and Denver, Colorado between July 1989 and March 1990 and features several notable neofolk artists - Douglas P. (of Death in June), Tony Wakeford (of Sol Invictus), Rose McDowall (of Strawberry Switchblade) and Michael Moynihan and Bob Ferbrache of Blood Axis. Most of the music was arranged by Douglas P. in collaboration with Rice and Ferbrache.", "*Douglas P. - guitar, backing vocals", "* Live in Osaka (DVD) --Features a concert performance from Osaka, Japan, in 1989, with Michael Moynihan, Tony Wakeford, Douglas P., and Rose McDowell. Also includes films Invocation (One) and Black Sun."]}, {"page": "The World That Summer", "response": ["Douglas P. is accompanied  on this album by David Tibet (as Christ'777') and Andrea James (part of the duo 'Somewhere in Europe')."]}, {"page": "Brown Book (album)", "response": ["The sale of Brown Book has been prohibited in Germany since 2005 due to the title track's sampling of the \"Horst-Wessel-Lied\", the anthem of the Sturmabteilung. In response to the proposed ban, Douglas P. submitted statements to the German authorities explaining large passages of his work, including noting that the sample of \"Horst-Wessel-Lied\" was juxtaposed against samples from the film The World that Summer. The samples in question included that of a Jewish grandmother describing her \"suicidal fatalism\", and homophobic statements from her lover, an SA officer.", "* Performer: Douglas P."]}, {"page": "Rose Clouds of Holocaust", "response": ["* Douglas P. – all instrumentation, vocals, lyrics, engineering, production"]}, {"page": "Take Care & Control", "response": ["Take Care & Control is an album by Death In June, released in 1998. This album is a collaboration with Albin Julius (Der Blutharsch), with whom Douglas P. would return to collaborate on the Operation Hummingbird album."]}, {"page": "The Wall of Sacrifice", "response": ["#* An atmospheric folk song featuring Douglas P.'s cryptic lyrics relating to the ruins of Europa.  Background vocals by Rose McDowall", "#* Traditional folk arrangement, distorted guitar intro,  with vocal and lyric by Douglas P. Instrumentation contributed by David Tibet.", "#* Also Recorded for the Current 93 album, Swastikas for Noddy.  Vocal by Douglas P.", "*Douglas P."]}, {"page": "The Corn Years", "response": ["The first Death in June material to be (officially) released in CD format, this album compiles and reinterprets output from 1985 through 1987.  Personnel involved on the compilation include Douglas P., David Tibet, Rose McDowall, Andrea James, Gary Carey, Bee, John Balance, Jan O', David Tiffen, and J.R.P."]}, {"page": "All Pigs Must Die (album)", "response": ["* Musician: Douglas P."]}, {"page": "David Tibet", "response": ["David Bunting was born in Batu Gajah, Perak, Malaysia. Early in his career, he collaborated with Psychic TV and 23 Skidoo. Tibet left Psychic TV in 1983 and founded Current 93 the same year. He has worked with Steven Stapleton of Nurse With Wound (of which band he is a member), Michael Cashmore, Douglas P. (of Death in June, on whose albums he has appeared several times), Steve Ignorant of Crass (using the name \"Stephen Intelligent\"), Boyd Rice, Little Annie, Björk, Nick Cave, Rose McDowall, Tiny Tim, Annabella Lwin (of Bow Wow Wow) and Ian Read of Fire and Ice. "]}, {"page": "Easy Listening for Iron Youth", "response": ["Boyd Rice wrote all tracks except \"Predator/Prey\" (by Rice and Coil) and \"Cleanliness And Order\" (by Rice and Daniel Miller). Percussion was provided by Michael Moynihan, Tony Wakeford, Douglas P., and Rose McDowall on \"Conflagration\", \"Scorched Earth\", and \"Sunset\"."]}, {"page": "Martial industrial", "response": ["Laibach were one of the first bands to incorporate military marches in their industrial music and display politically provocative aesthetics. Boyd Rice and Douglas P., the noise and neofolk pioneers, respectively, adopted such attitude at several occasions to its extreme. Allerseelen, either through ritual hymns or alchemical folklore followed in the same vein. Similarly militant but less provocative and more esoteric were the heroic choral outputs of ACTUS. Les Joyaux de la Princesse developed the genre further, offering a particularly mesmerizing style of dark ambient intermingled with historical samples, speeches and interbellum chansons. The Moon Lay Hidden Beneath a Cloud / Der Blutharsch enriched this tradition, adding darkwave medieval melodies to the mix. Finally, In Slaughter Natives and Puissance expanded the genre towards orchestral and neoclassical paths, respectively."]}, {"page": "Thunder Perfect Mind (Current 93 album)", "response": ["*Douglas P. – guitars, hand percussions"]}, {"page": "New European Recordings", "response": ["#REDIRECT Douglas P.#New European Recordings"]}, {"page": "God & Beast", "response": ["Boyd Rice wrote all tracks and provided vocals and sound construction.  Douglas P. provided vocals, played chimes and E-bow.  Rose McDowall provided vocals.  Dave Simmons played keyboards."]}, {"page": "Heaven Sent (Scorpion Wind album)", "response": ["Heaven Sent is a collaboration between Boyd Rice, Douglas P. (of Death in June) and John Murphy (of The Associates), recording under the name Scorpion Wind, released in 1996 on NER. The album consists of Boyd Rice's spoken-word lyrics on subjects ranging from Social Darwinism to alcohol with backing music in various styles, including lounge and neofolk."]}, {"page": "Swastikas for Noddy", "response": ["*Douglas P. - guitar, drums, lead vocals (track 14), production, mixing"]}, {"page": "List of gay, lesbian or bisexual people: P–Q", "response": ["| Douglas P."]}, {"page": "Matthew 7:6", "response": ["The phrase \"pearls before swine\" has become a common expression in English. A film was made in 1999, Pearls Before Swine, starring Boyd Rice and Douglas P., directed by Richard Wolstencroft. There is a Pearls Before Swine comic strip, a Pearls Before Swine American psychedelic folk band, and Pearls Before Swine is an alternate title for Kurt Vonnegut's novel God Bless You, Mr. Rosewater."]}, {"page": "Dawn (Current 93 album)", "response": ["*Douglas P."]}]}}