{"wiki_id": "http://www.wikidata.org/entity/Q2752971", "itemLabel": "David Mountbatten, 3rd Marquess of Milford Haven", "itemDescription": "British noble", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Mountbatten,_3rd_Marquess_of_Milford_Haven", "wikipedia_page": {"main": "Lieutenant David Michael Mountbatten, 3rd Marquess of Milford Haven,  (12 May 1919 – 14 April 1970), styled Viscount Alderney before 1921 and Earl of Medina between 1921 and 1938, was the son of the George Mountbatten, 2nd Marquess of Milford Haven and Countess Nadejda Mikhailovna of Torby.", "link_mentions": [{"page": "John A. Dahlgren", "response": ["In 1865, Dahlgren married his second wife, Sarah Madeleine Vinton, daughter of Congressman Samuel Finley Vinton and Romaine Madeleine Bureau, and the widow of Daniel Convers Goddard, first assistant secretary of the newly created U.S. Department of the Interior. Madeleine was a well-known author in her own right. Their children were John Vinton Dahlgren, who married Elizabeth Wharton Drexel; Eric Bernard Dahlgren, Sr., who married Lucy Wharton Drexel; and Ulrica Dahlgren, who married Josiah Pierce,\"Josiah Pierce, Boston, 1887\", contributed by Pierce Family Collection through Maine Historical Society, Maine Memory Network. Retrieved 30 July 2021. and was the grandmother of Romaine Dahlgren Pierce, wife of David Mountbatten, 3rd Marquess of Milford Haven."]}, {"page": "Marquess of Milford Haven", "response": ["***15px David Mountbatten, 3rd Marquess of Milford Haven (1919–1970)"]}, {"page": "Mountbatten family", "response": ["*** David Mountbatten, 3rd Marquess of Milford Haven (1919–1970) m. Romaine Dahlgren Pierce div. 1954, m. Janet Mercedes Bryce"]}, {"page": "Manuel Candamo", "response": ["He was the brother-in-law of Anglo-Peruvian guano millionaire John Pablo Bryce, and thus a great-great uncle Alexandra Hamilton, Duchess of Abercorn, and Natalia Grosvenor, Duchess of Westminster, as well as a great uncle of Janet Mercedes Bryce, Marchioness of Milford Haven, wife of David Mountbatten, 3rd Marquess of Milford Haven."]}, {"page": "Lord Ivar Mountbatten", "response": ["Mountbatten was born in London, to David Mountbatten, 3rd Marquess of Milford Haven, and the former Janet Mercedes Bryce. His elder brother is George Mountbatten, 4th Marquess of Milford Haven. Queen Victoria was his great-great-great grandmother, and he is a descendant of Alexander Pushkin. He is also a second cousin of Prince Charles through both of their fathers.  His paternal grandfather was Prince George of Battenberg, through whom he is a descendant of the House of Hesse-Darmstadt."]}, {"page": "Grand Duke Michael Mikhailovich of Russia", "response": ["* Nadejda de Torby (Nada) (28 March 1896 –  22 January 1963); married London 15 November 1916 George, 2nd Marquess of Milford Haven, born Prince von Battenberg (1892–1938). They had one daughter Lady Tatiana Elizabeth Mountbatten, and one son David Mountbatten, 3rd Marquess of Milford Haven"]}, {"page": "James Orthwein", "response": ["One of Orthwein's wives was Romaine Dahlgren Pierce, who had previously married and divorced William Simpson and David Mountbatten, 3rd Marquess of Milford Haven. Orthwein's third wife was Ruth Orthwein; they divorced in the late 1990s. Orthwein died of cancer at his home in Huntleigh, Missouri in 2008."]}, {"page": "List of Middlebury College alumni", "response": ["* Lord Ivar Mountbatten – Deputy Lieutenant of Devon; younger son of the David Mountbatten, 3rd Marquess of Milford Haven"]}, {"page": "David Mountbatten", "response": ["#REDIRECT David Mountbatten, 3rd Marquess of Milford Haven"]}]}}