{"wiki_id": "http://www.wikidata.org/entity/Q276005", "itemLabel": "Charlotte Gainsbourg", "itemDescription": "British-French actor and singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlotte_Gainsbourg", "wikipedia_page": {"main": "Charlotte Lucy Gainsbourg (French pronunciation: [ʃaʁlɔt ɡɛ̃zbuʁ] (listen); born 21 July 1971) is an English-French actress and singer-songwriter. She is the daughter of English actress Jane Birkin and French singer and songwriter Serge Gainsbourg. After making her musical debut with her father on the song \"Lemon Incest\" at the age of 12, she released an album with her father at the age of 15. More than 20 years passed before she released albums as an adult (5:55, IRM, Stage Whisper and Rest) to commercial and critical success. Gainsbourg has also appeared in many films, including several directed by Lars von Trier, and has received a César Award and the Cannes Film Festival Best Actress Award.", "link_mentions": [{"page": "List of French people", "response": ["*Charlotte Gainsbourg"]}, {"page": "Cinema of France", "response": ["At the 2008 Cannes Film Festival, Entre les murs (The Class) won the Palme d'Or, the 6th French victory at the festival. The 2000s also saw an increase in the number of individual competitive awards won by French artists at the Cannes Festival, for direction (Tony Gatlif, Exils, 2004), screenplay (Agnès Jaoui and Jean-Pierre Bacri, Look at Me, 2004), female acting (Isabelle Huppert, The Piano Teacher, 2001; Charlotte Gainsbourg, Antichrist, 2009) and male acting (Jamel Debbouze, Samy Naceri, Roschdy Zem, Sami Bouajila and Bernard Blancan, Days of Glory, 2006)."]}, {"page": "July 21", "response": ["*  1971   – Charlotte Gainsbourg, English-French actress and singer"]}, {"page": "Kirsten Dunst", "response": ["In 2011, Dunst co-starred opposite Charlotte Gainsbourg, Kiefer Sutherland and Charlotte Rampling in Lars von Trier's drama film Melancholia as a woman suffering depression as the world ends. It premiered at the 2011 Cannes Film Festival and received positive reviews, in particular for Dunst's performance. Steven Loeb of Southampton Patch wrote \"This film has brought the best out of von Trier, as well as his star. Dunst is so good in this film, playing a character unlike any other she has ever attempted... Even if the film itself were not the incredible work of art that it is, Dunst's performance alone would be incentive enough to recommend it\". Sukhdev Sandhu of The Daily Telegraph wrote \"Dunst is exceptional, so utterly convincing in the lead role – trouble, serene, a fierce savant – that it feels like a career breakthrough. Dunst won several awards for her performance, including the Best Actress Award at the Cannes Film FestivalChang, Justin and Debruge, Peter. \"'Tree of Life' wins Palme d'Or\" , Variety, May 22, 2011. Retrieved May 25, 2011.Kilday, Gregg. \"Best Actress Kirsten Dunst Thanks Cannes for Allowing Lars von Trier's 'Melancholia' 'To Still Be in Competition'\" , The Hollywood Reporter, May 22, 2011. Retrieved May 25, 2011. and the Best Actress Award from the U.S. National Society of Film Critics."]}, {"page": "Lars von Trier", "response": ["The Depression trilogy consists of Antichrist, Melancholia, and Nymphomaniac. The three films star Charlotte Gainsbourg, and deal with characters who suffer depression or grief in different ways. This trilogy is said to represent the depression that Trier himself experiences.", "Von Trier's next feature film was Antichrist, a film about \"a grieving couple who retreat to their cabin in the woods, hoping a return to Eden will repair their broken hearts and troubled marriage; but nature takes its course and things go from bad to worse\". The film stars Willem Dafoe and Charlotte Gainsbourg. It premiered in competition at the 2009 Cannes Film Festival, where the festival's jury honoured the movie by giving the Best Actress award to Gainsbourg.", "Following Melancholia, von Trier began the production of Nymphomaniac, a film about the sexual awakening of a woman played by Charlotte Gainsbourg. In early December 2013, a four-hour version of the five-and-a-half-hour film was shown to the press in a private preview session. The cast also included Stellan Skarsgård (in his sixth film for von Trier), Shia LaBeouf, Willem Dafoe, Jamie Bell, Christian Slater, and Uma Thurman. In response to claims that he had merely created a \"porn film\", Skarsgård stated \"... if you look at this film, it's actually a really bad porn movie, even if you fast forward. And after a while you find you don't even react to the explicit scenes. They become as natural as seeing someone eating a bowl of cereal.\" VonTrier refused to attend the private screening due to the negative response to Nazi-related remarks he had made at the 2011 Cannes Film Festival, which had led to his expulsion from it. In the director's defense, Skarsgård stated at the screening, \"Everyone knows he's not a Nazi, and it was disgraceful the way the press had these headlines saying he was.\" For its public release in the United Kingdom, the four-hour version of Nymphomaniac was divided into two \"volumes\"VolumeI and VolumeIIand the film's British premiere was on 22February 2014. In interviews prior to the release date, Gainsbourg and co-star Stacy Martin revealed that prosthetic vaginas, body doubles, and special effects were used for the production of the film. Martin also stated that the film's characters were a reflection of the director himself and referred to the experience as an \"honour\" that she enjoyed. The film was also released in two \"volumes\" for the Australian release on 20 March 2014, with an interval separating the back-to-back sections. In his review of the film for 3RRR's film criticism program, Plato's Cave, presenter Josh Nelson stated that, since the production of Breaking the Waves, the filmmaker von Trier is most akin to is Alfred Hitchcock, due to his portrayal of feminine issues. Nelson also mentioned filmmaker Andrei Tarkovsky as another influence whom Trier himself has also cited. In February 2014, an uncensored version of Volume I was shown at the Berlin Film Festival, with no announcement of when or if the complete five-and-a-half-hour Nymphomaniac would be made available to the public. The complete version premiered at the 2014 Venice Film Festival and was shortly afterward released in a limited theatrical run worldwide that fall.", "Von Trier has occasionally courted controversy by his treatment of his leading ladies. He and Björk famously fell out during the shooting of Dancer in the Dark, to the point where Björk would abscond from filming for days at a time. She stated about Trier, who among other things shattered a monitor while it was next to her, \"...you can take quite sexist film directors like Woody Allen or Stanley Kubrick and still they are the one that provide the soul to their movies. In Lars von Trier's case it is not so and he knows it. He needs a female to provide his work soul. And he envies them and hates them for it. So he has to destroy them during the filming. And hide the evidence.\" Despite this, other actresses such as Kirsten Dunst and Charlotte Gainsbourg have spoken out in defence of von Trier's approach. Nymphomaniac star Stacy Martin has stated that he never forced her to do anything that was outside her comfort zone. She said \"I don't think he's a misogynist. The fact that he sometimes depicts women as troubled or dangerous or dark or even evil; that doesn't automatically make him anti-feminist. It's a very dated argument. I think that Lars loves women.\"", "! Charlotte Gainsbourg"]}, {"page": "1971", "response": ["* July 21 – Charlotte Gainsbourg, French actress and singer-songwriter"]}, {"page": "Serge Gainsbourg", "response": ["|\"Lemon Incest\" (with Charlotte Gainsbourg)", "|\"Charlotte Forever\" (with Charlotte Gainsbourg)", "* 1986: Charlotte for Ever – Charlotte Gainsbourg"]}, {"page": "Jane Birkin", "response": ["Birkin has lived mainly in France since the 1970s. She is the mother of photographer Kate Barry, with her first husband John Barry; actress and singer Charlotte Gainsbourg, with Serge Gainsbourg; and musician Lou Doillon, with Jacques Doillon. In addition to her acting and musical credits, she lent her name to the Hermès Birkin handbag.", "Birkin recorded the song \"Beauty\" on French producer Hector Zazou's album Strong Currents (2003). The cover art of Have You Fed the Fish? (2002) by singer-songwriter Badly Drawn Boy features her image and backing vocals by her daughter, Charlotte Gainsbourg. In 2006 she recorded and released the album Fictions, and in 2010, recorded a duet with Brazilian singer Sérgio Dias, which appeared on We Are the Lilies, an album by Dias and French band Tahiti Boy and the Palmtree Family; the album also featured contributions from Iggy Pop and others.", "She had a passionate and creative relationship with her mentor Serge Gainsbourg, whom she met on the set of Slogan in 1968, a relationship that lasted 12 years. They never married, despite rumours and misreporting to the contrary. In 1971, they had a daughter,  actress and singer Charlotte Gainsbourg. They separated in 1980.", "Her grandchildren are Roman de Kermadec (born 1987) from Kate Barry, Ben (born 1997), Alice (born 2002), and Jo (born 2011) from Charlotte Gainsbourg, and Marlowe (born 2002) from Lou Doillon."]}, {"page": "César Awards", "response": ["|Charlotte Gainsbourg", "| Charlotte Gainsbourg  || 7 || 2"]}, {"page": "Beck", "response": ["Modern Guilt was the final release in Beck's contract with Geffen Records. Beck, then 38, had held the contract since his early 20s. Released from his label contract and going independent, Beck began working more heavily on his own seven-year-old label, which went through a variety of names. His focus on smaller, more quixotic projects, Beck moonlighted as a producer, working with artists such as Charlotte Gainsbourg, Thurston Moore and Stephen Malkmus. Beck worked for five or six days a week at the small studio on his property in Malibu, and founded Record Club, a project whereby an entire classic album—by The Velvet Underground, Leonard Cohen, INXS, Yanni—would be covered by another singer in the span of a single day. Beck provided four songs for the film Scott Pilgrim vs. the World (2010), each attributed to the title character's fictional band, Sex Bob-Omb. Beck also collaborated with Philip Glass, Jack White, Tobacco of Black Moth Super Rainbow, Jamie Lidell, Seu Jorge, Childish Gambino, and The Lonely Island.", "On June 19, 2009, Beck announced Planned Obsolescence, a weekly DJ set put together by Beck or guest DJs. Soon after, on July 7, Beck announced that his website would be featuring \"extended informal conversations with musicians, artists, filmmakers, and other various persons\" in a section called Irrelevant Topics. Then, on July 12, he added a section called Videotheque, which he said would contain \"promotional videos from each album, as well as live clips, TV show appearances and other rarities\". Also in 2009, Beck collaborated with Charlotte Gainsbourg on her album IRM, which was released in January 2010. Beck wrote the music, co-wrote the lyrics, and produced and mixed the album. The lead single, \"Heaven Can Wait\", is a duet by Beck and Gainsbourg."]}, {"page": "1986 in music", "response": ["*Charlotte for Ever – Charlotte Gainsbourg"]}, {"page": "Maiden's Prayer", "response": ["In the 2013 television serial The Tunnel, Anglo-French actor and singer Charlotte Gainsbourg performs a voice-over to the tune of the Maiden's Prayer, singing a mixture of French and English:"]}, {"page": "2000 in film", "response": ["| Nuremberg || TNT / Warner Bros. Television / Alliance Atlantis Communications / CTV / British American Entertainment / Cypress Films / Les Productions La Fête || Yves Simoneau (director); David W. Rintels (screenplay); Alec Baldwin, Brian Cox, Christopher Plummer, Jill Hennessy, Max von Sydow, Michael Ironside, Colm Feore, Charlotte Gainsbourg, Len Cariou, Matt Craven, Robert Joy, Christopher Heyerdahl, Rebecca Jenkins, David McIlwraith, Christopher Shyer, Hrothgar Mathews, Herbert Knaup, Frank Moore, Tom Rack, Dennis St John, Gabriel Gascon, Julien Poulin, Paul Hébert, Paul Hopkins, Susan Glover, Roger Dunn, Frank Fontaine, Raymond Cloutier, Bill Corday, Ken Kramer, Mark Walker, Sam Stone, Douglas O'Keeffe, Benoit Girard, James Bradford, Frank Burns, Erwin Potitt, Roc LaFortune, Griffith Brewer, Alain Fournier, René Gagnon, David Francis, Len Doncheff, Geoffrey Pounsett, Steve Adams, Scott Gibson || Drama, History, War || Live action"]}, {"page": "2003 in film", "response": ["| 21 Grams || Focus Features || Alejandro González Iñárritu (director); Guillermo Arriaga (screenplay); Sean Penn, Naomi Watts, Benicio del Toro, Charlotte Gainsbourg, Danny Huston, John Rubinstein, Clea DuVall, Eddie Marsan, Melissa Leo, Marc Thomas Musso, Paul Calderón, Denis O'Hare, Kevin Chapman, Lew Temple, Carly Nahon || Crime, Drama || || Live Action"]}, {"page": "1996 in film", "response": ["| Jane Eyre || Miramax Films || Franco Zeffirelli (director/screenplay); Hugh Whitemore (screenplay); William Hurt, Charlotte Gainsbourg, Joan Plowright, Anna Paquin, Geraldine Chaplin, Billie Whitelaw, Maria Schneider, Fiona Shaw, John Wood, Amanda Root, Leanne Rowe, Richard Warwick, Judith Parker, Josephine Serre, Elle Macpherson, Julian Fellowes, Edward de Souza, Peter Woodthorpe, Ralph Nossek, Samuel West, Charlotte Attenborough || Romance, Drama || Live action", "* Jane Eyre, directed by Franco Zeffirelli, starring Charlotte Gainsbourg, William Hurt – (Italy/US/UK)"]}, {"page": "1988 in film", "response": ["*Kung-Fu Master (a.k.a. Le Petit Amour), directed by Agnès Varda, starring Jane Birkin and Charlotte Gainsbourg – (France)"]}, {"page": "1993 in film", "response": ["*The Cement Garden, starring Charlotte Gainsbourg – (U.K.)"]}, {"page": "1971 in film", "response": ["*July 21 - Charlotte Gainsbourg, French actress"]}, {"page": "Neil Hannon", "response": ["The same year Hannon added his writing and vocal talents to the Air album Pocket Symphony, released in the United States on 6 March 2007. He is featured on the track \"Somewhere Between Waking and Sleeping\", for which he wrote the lyrics. This song had been originally written for and sung by Charlotte Gainsbourg on her album, 5:55. Though it was not included in its 2006 European release, it was added as a bonus track for its American release on 24 April 2007.5:55#Release history"]}, {"page": "Katrin Cartlidge", "response": ["Her work on Manchevski's Before the Rain and on No Man's Land made her well known in Bosnia and Herzegovina and the Balkans. Sophie, in Mike Leigh's Naked, was her first leading role. Cartlidge worked in two more Leigh films: in Career Girls she played one of the lead roles, Hannah, at the ages of both 20 and 30, and in Topsy Turvy she was a madam in a Paris brothel. She was due to play the lead role in Polish director Lech Majewski's 2004 film The Garden of Earthly Delights—that of an art historian dying of cancer—but she left shortly before production began.Lech Majewski, DVD commentary, The Garden of Earthly Delights, Kino International, New York, 2008. Cartlidge was replaced by actress Claudine Spiteri. Cartlidge won a role in 21 Grams but was replaced by Charlotte Gainsbourg due to her death."]}]}}