{"wiki_id": "http://www.wikidata.org/entity/Q27671066", "itemLabel": "Laurence Maguire", "itemDescription": "association football player (1997-)", "wikipedia_url": "https://en.wikipedia.org/wiki/Laurence_Maguire", "wikipedia_page": {"main": "Laurence Henry Maguire (born 8 February 1997) is an English professional footballer who plays as a defender for Chesterfield. \n\n", "link_mentions": [{"page": "St Mary's Catholic High School, Chesterfield", "response": ["The school adopted the song \"Let Us Build A School\" as their official school hymn in 2006. This was then replaced with 'Live Love and Learn In the Light of Christ', the current hymn which was written by Music teachers, Mr A Breedon and Mrs F Fletcher (who also wrote several hymns for the school's bi-annual masses, including the Holy Holy). In January 2018, former pupils Harry and Laurence Maguire visited the school.", "*Laurence Maguire, footballer for Chesterfield F.C."]}, {"page": "2016–17 Chesterfield F.C. season", "response": ["|Laurence Maguire"]}, {"page": "2016–17 Luton Town F.C. season", "response": ["Luton's first result of 2017 was a 1–0 defeat away to Portsmouth, whose goal came in the 31st minute when Christian Burgess converted Carl Baker's cross with a header. O'Brien left the club by mutual consent, while midfielder Lawson D'Ath was signed from Northampton Town on a one-and-a-half-year contract, with the option of a one-year extension. Luton were knocked out of the FA Cup after losing 2–1 away to Accrington Stanley in the third round, in which the home team took the lead through Sean McConville in first half stoppage time. Gray equalised on 54 minutes after goalkeeper Aaron Chapman saved an attempt on goal from Marriott, before Omar Beckles scored the winner for Accrington three minutes later with a header from eight yards. Luton progressed to the quarter-finals of the EFL Trophy after a 4–0 win at home to Chesterfield in the third round. Mackail-Smith opened the scoring for Luton with a 23rd-minute penalty after he was fouled by Laurence Maguire in the penalty area, before Marriott doubled the lead two minutes later from a tight angle. During the second half, Marriott scored his second goal of the match on 51 minutes with a shot into the bottom corner, before substitute Vassell finished the scoring for Luton with a shot into the roof of the net in the 86th minute. Luton won 2–1 away to Crewe Alexandra, in which the home team took the lead in the 28th minute through Ryan Lowe. Marriott equalised before half-time from a tight angle, before Gray scored the winner for Luton with a side-footed shot on 69 minutes. Luke Gambin, a Malta international, was signed from Barnet on a two-and-a-half-year contract, with the option of a one-year extension, for an undisclosed fee, while McQuoid joined Stevenage on loan until the end of the season."]}, {"page": "List of English association football families", "response": ["* Harry Maguire, Laurence Maguire (brother)"]}]}}