{"wiki_id": "http://www.wikidata.org/entity/Q276440", "itemLabel": "Iris Tree", "itemDescription": "artists' model, poet (1897-1968)", "wikipedia_url": "https://en.wikipedia.org/wiki/Iris_Tree", "wikipedia_page": {"main": "Iris Tree (27 January 1897 – 13 April 1968) was an English poet, actress and artists' model, described as a bohemian, an eccentric, a wit and an adventurer.", "link_mentions": [{"page": "Amedeo Modigliani", "response": ["File:Amedeo Modigliani 060.jpg|Iris Tree, c. 1916, Courtauld Institute of Art"]}, {"page": "Herbert Beerbohm Tree", "response": ["Tree married actress Helen Maud Holt (1863–1937) in 1882; she often played opposite him and assisted him with management of the theatres.  Her charm also assisted the couple's entry into prominent social and élite artistic and intellectual circles.  Their daughters were actresses Viola Tree (who married theatre critic Alan Parsons) and Felicity Tree (who married Sir Geoffrey Cory-Wright, third baronet) and poet Iris Tree (who married Curtis Moffat, becoming Countess Ledebur). Tree also fathered several illegitimate children (six with Beatrice May Pinney), including film director Carol Reed and Peter Reed, father of the British actor Oliver Reed.Portrait of the Actor Herbert Beerbohm Tree, the Cyranos film website. Retrieved 23 September 2009 He was also the grandfather of Hollywood screenwriter and producer Ivan Moffat.\"Ivan Moffat\", obituary in The Telegraph, 3 August 2002. Retrieved 18 April 2012Ivan Moffat on the 'Genealogy of the Moffat Family' website"]}, {"page": "Max Beerbohm", "response": ["Beerbohm was close to four half-siblings, one of whom, Herbert Beerbohm Tree, was already a renowned stage actor when Max was a child.. Other older half-siblings were the author and explorer Julius Beerbohm. and the author Constance Beerbohm. His nieces were Viola, Felicity and Iris Tree."]}, {"page": "1897 in literature", "response": ["*January 27 – Iris Tree, English poet (died 1968)"]}, {"page": "The Coterie", "response": ["Its members included Lady Diana Manners, then considered a famous beauty in England; Duff Cooper, who became a Conservative politician and a diplomat; Raymond Asquith, son of the Prime Minister H. H. Asquith and a famed barrister; Maurice Baring; Patrick Shaw-Stewart, a managing director of Barings Bank and war poet; Nancy Cunard and her friend Iris Tree; Edward Horner and Sir Denis Anson.Duff Cooper: Old Men Forget, 1953 Also included in the group were Hugo Francis Charteris, Lord Elcho and Yvo Alan Charteris, sons of the Earl and Countess of Wemyss of Stanway House."]}, {"page": "Roy Campbell (poet)", "response": ["Although Mary was already intimately involved with the Dutch composer Bernard van Dieren, Roy Campbell caught her attention immediately when she first saw him. Mary later wrote, \"My sister Kathleen... and I were riding on the top of a bus in Tottenham Court Road... When we saw Roy for the first time. He got off the bus when we did and made for the Eiffel Tower Restaurant in Charlotte Street. We were quite intrigued, he was so good-looking, so foreign, who could he be? Once inside the restaurant he went straight to a table where a golden-haired girl, Iris Tree, was sitting alone, evidently waiting for him.\"Joseph Pearce (2004), Unafraid of Virginia Woolf: The Friends and Enemies of Roy Campbell, ISI Books. Page 47."]}, {"page": "Nancy Cunard", "response": ["At this time she was also on the edge of the influential group The Coterie, associating in particular with Iris Tree."]}, {"page": "The Sitwells", "response": ["*Iris Tree", "*Iris Tree", "*Iris Tree", "*Iris Tree"]}, {"page": "1920 in poetry", "response": ["* Iris Tree, Poems"]}, {"page": "Betty Harford", "response": ["Harford appeared in numerous John Houseman theatrical productions and in the High Valley Theater of Iris Tree."]}, {"page": "Daphne Fielding", "response": ["* The Rainbow Picnic: a portrait of Iris Tree. London: Eyre Methuen (1974) "]}, {"page": "1927 in poetry", "response": ["* Iris Tree, The Traveller and other Poems"]}, {"page": "List of British people with German ancestry", "response": ["* Iris Tree, actress, poet and artists' model; daughter of Herbert Beerbohm Tree"]}, {"page": "Iris (given name)", "response": ["*Iris Tree (1897–1968), English poet, actress and artists' model"]}, {"page": "Curtis Moffat", "response": ["Moffat studied painting in New York and in Paris before exhibiting his work in New York during World War I.  He married the actress and poet Iris Tree, and the couple moved to London after the war, where Moffat took up abstract photography.  He collaborated with Man Ray and Cecil Beaton on numerous occasions throughout his career.  He opened a photographic studio in London in 1925.  Four years later, he opened an interior design showroom and gallery, displaying a combination of modern, antique and African tribal furnishings.  His home became a popular salon for artists, intellectuals and gourmands.", "After a brief diplomatic career early in the new century, he studied painting in New York and was part of a group of artists including George Bellows, Robert Henri and John French Sloan.  In 1913–1914, he studied at the Beaux arts in Paris.  One man shows of his work were held in New York in 1916 and 1919.  In 1916, he married actress-poet Iris Tree, the daughter of actor-manager Sir Herbert Beerbohm Tree, in New York.  A son, Ivan, born in Cuba in 1918, became a screenwriter.Ivan Moffat biography at the Internet Movie Database", "Moffat continued to live and work at Fitzroy Square.  He and Iris Tree had been divorced in 1932. He returned to portrait photography and also undertook commercial colour photography. He began experimenting with the complex and delicate carbro three colour process.  A one-man show of his colour photographs, \"Still Lifes and Compositions with Light\", was held at the Mayor Gallery in 1925.  His work was included in the Museum of Modern Art exhibition \"Photography 1839–1937\". On 16 April 1936 in London, he married Kathleen Allan, who had worked with him for some years in his studio.  The couple had a daughter, Penelope, in 1938."]}, {"page": "Alexander, Count of Hoyos", "response": ["* Alice von Hoyos (b. 1918), who in 1955 married actor Friedrich von Ledebur, who was divorced from Iris Tree."]}, {"page": "Viola Tree", "response": ["Tree was born in London, the eldest of three daughters of Herbert Beerbohm Tree and his wife, the actress Helen Maud Tree, née Holt.The Times, obituary, 16 November 1938, p. 9. Her aunt was author Constance Beerbohm and an uncle was Max Beerbohm.  She was educated privately in London and in Europe.  Her sisters were Felicity Tree and Iris Tree.  She also had seven illegitimate half-siblings, the products of her father's many infidelities, among them the director Carol Reed and Peter Reed, whose son became the actor Oliver Reed.Portrait of the Actor Herbert Beerbohm Tree, the Cyranos film website, accessed 23 September 2009"]}, {"page": "Julius Beerbohm", "response": ["He was the son of Julius Ewald Edward Beerbohm (1811–1892),Internet Archive listing Max Beerbohm: a Biography, by David Cecil – Houghton Mifflin, 1965 of Dutch, Lithuanian, and German origin, who had come to England in about 1830 and set up as a prosperous corn merchant. He married an Englishwoman, Constantia Draper, and the couple had four children. Julius Beerbohm's older brother was the renowned actor-manager Herbert Beerbohm Tree; his sister was author Constance Beerbohm. A younger half-brother was the caricaturist and parodist Max Beerbohm. His half-sister Agnes Mary Beerbohm (1865–1949), who became Mrs Ralph Neville in 1884, was a friend of the artist Walter Sickert and modelled for him in his 1906 painting Fancy Dress.Google Books Listing Baron, Wendy 'Sickert: Paintings and Drawings' Published by Yale University Press (206) pg 315  His nieces were Viola, Felicity and Iris Tree."]}, {"page": "Felicity Tree", "response": ["Born in Chelsea, London, in 1894,Felicity Tree, England & Wales, Free BMD Birth Index, 1837–1915, Ancestry.com (pay to view) Tree was the middle daughter of the actor Sir Herbert Beerbohm Tree and his wife, the actress Helen Maud Holt. She was the sister of Viola Tree and Iris Tree, and the niece of the author Constance Beerbohm, the caricaturist and parodist Max Beerbohm, and the engineer and explorer Julius Beerbohm. Her grandson is Richard Cory-Wright, 4th Baronet Cory-Wright.Charles Mosley, editor, Burke's Peerage, Baronetage & Knightage, 107th edition, 3 volumes (Wilmington, Delaware, U.S.A.: Burke's Peerage (Genealogical Books) Ltd, 2003), Vol. 1, pp. 906–907"]}, {"page": "Beerbohm family", "response": ["::::* Iris Tree (1897-1968) married firstly Curtis Moffat.", "::::: Iris Tree's second marriage was to the actor and ex-officer of the Austrian cavalry, Count Friedrich von Ledebur-Wicheln."]}, {"page": "Ivan Moffat", "response": ["Ivan Moffat was born in Havana, Cuba, the son of the British actress and poet Iris Tree and her American husband, artist and photographer Curtis Moffat.Curtis Moffat: biography  on the Victoria & Albert Museum website He was the grandson of actor-manager Sir Herbert Beerbohm Tree.\"Ivan Moffat\", obituary in The Telegraph, 3 August 2002, accessed 18 April 2012Ivan Moffat on the 'Genealogy of the Moffat Family' website The family lived, among other places, in America and Australia, and moved to London when Moffat was 8 years old.  There, Moffat attended Dartington Hall School, in Totnes, Devon, befriending Michael Young. Moffat then studied at the London School of Economics. As an undergraduate, he joined the Communist Party, which caused him later to be blacklisted for a time in Hollywood.  Jessica Mitford once described Moffat as \"spanning the gap between Left-wing politics and the deb dance scene\"."]}, {"page": "Bright young things", "response": ["|Iris Tree (1897–1978)"]}, {"page": "Helen Maud Holt", "response": ["Helen Maud Holt (5 October 1863The Who's Who entry for \"Lady Tree\", and the obituary notice in The Observer give the year as 1864; the obituaries in The Times, The Manchester Guardian and the Oxford Dictionary of National Biography give her year of birth as 1863. FreeBMD gives the year as 1858 – 7 August 1937), professionally known as Mrs Beerbohm Tree and later Lady Tree, was an English actress. She was the wife of the actor Sir Herbert Beerbohm Tree and the mother of Viola Tree, Felicity Tree and Iris Tree."]}, {"page": "Betty May", "response": ["She met the painter Augustus John and the sculptor Jacob Epstein. It was Epstein in particular who introduced her to other members of the Bohemian set, which including the \"Queen of Bohemia\" Nina Hamnett, prankster Horace de Vere Cole, heiress Nancy Cunard, painter William Orpen, Anna Wickham, Iris Tree and poet Ezra Pound, many of whom May knew."]}, {"page": "Tree (surname)", "response": ["*Iris Tree (1897–1968), English poet and actress, daughter of Herbert"]}, {"page": "Peggy Feury", "response": ["| Feb 26, 1949 || Feb 26, 1949 || Cock-a-Doodle-Do Brooks Atkinson. \"The Theatre: Experiment in Disaster\". The New York Times. Feb 28, 1949. ||  Iris Tree Music – Ned Rorem  ||  Lenox Hill Playhouse  ||  Margaret Barker  || Norah (as Margaret Feury)"]}]}}