{"wiki_id": "http://www.wikidata.org/entity/Q276306", "itemLabel": "Andrew Johnson", "itemDescription": "English association football player (born 1981)", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Johnson_(footballer,_born_1981)", "wikipedia_page": {"main": "Andrew Johnson (born 10 February 1981) is an English former professional footballer who played as a striker. He played for Birmingham City, Crystal Palace, Everton, Fulham and Queens Park Rangers. He was capped eight times for England. As of March 2016, Johnson was working at Crystal Palace as a club ambassador.", "link_mentions": [{"page": "Ashley Cole", "response": ["Cole has played for England at youth and senior levels. He was capped for the England U-20 team at the 1999 FIFA World Youth Championship alongside Stuart Taylor, Peter Crouch, Andrew Johnson and Matthew Etherington. However, the team finished bottom of their group, suffering three defeats without scoring any goals. He also made four appearances for England under-21s, scoring once."]}, {"page": "Sander Westerveld", "response": ["He played a key role in the treble season of 2000–01 for Liverpool, emerging as the hero of the League Cup final victory over Birmingham City, making the winning save from Andrew Johnson in the penalty shoot-out."]}, {"page": "Andrew Johnson (soccer player)", "response": ["#REDIRECT Andrew Johnson (footballer, born 1981)"]}, {"page": "Jimmy Davis (footballer)", "response": ["Davis made his debut for the England under-20s in November 2001; he started the win against Portugal at St Mary's Stadium before being replaced by Andrew Johnson. On 13 March 2002, he scored two goals in the win against Finland at the Reebok Stadium. He was a part of the squad that participated in the Toulon Tournament in May 2002; he featured in four games, scoring the winning goal in the group game against Portugal, as England finished in fourth place. He received the \"Le joueur le + courtois\" award, translated as being the most courteous player in the tournament. These were his last appearances for the U20s. Overall, Davis earned seven caps and scored three goals."]}, {"page": "Andrew Johnson (disambiguation)", "response": ["Andrew Johnson (1808–1875) was the 17th president of the United States.", "*Andrew Johnson (Michigan politician) (1889–?), member of the Michigan House of Representatives", "*Andrew Johnson (Minnesota politician) (born 1983 or 1984), Minneapolis City Councilmember", "*Andrew Johnson (footballer, born 1981), English footballer for Birmingham City, Crystal Palace, Everton, Fulham, and QPR", "*Andrew Johnson (golfer) (born 1972), American professional golfer", "*Andrew Johnson (rugby league), rugby league footballer of the 1960s", "*Andrew Johnson (skier), American cross-country skier", "*Andrew Johnson (soldier) (1833–1912), American Civil War Medal of Honor recipient", "*Andrew Johnson (architect) (1844–1921), American architect", "*Andrew Johnson (actor) (born 1955), British-Asian actor", "*USRC Andrew Johnson, various revenue cutters"]}, {"page": "Darren Bent", "response": ["Despite having played for the senior team, Bent was recalled to the under-21 squad for their October 2006 qualification play-offs against Germany. Later that month, he was recalled to the senior squad due to an injury to Andrew Johnson shortly after the squad's announcement. He was called to the England squad for a UEFA Euro 2008 qualifier against Croatia in November 2007. He came on as an 80th-minute substitute as England lost 3–2 and failed to qualify for the tournament. He was called up to the team for a 2010 FIFA World Cup qualifier against Ukraine in March 2009 following an injury to striker Carlton Cole. He made his second start for England in a 1–0 friendly defeat to Brazil on 14 November 2009. Bent was named in England's preliminary 30-man squad for the 2010 World Cup on 11 May 2010, although he was eventually omitted from the final 23-man squad on 1 June."]}]}}