{"wiki_id": "http://www.wikidata.org/entity/Q2771202", "itemLabel": "Robert Dinwiddie", "itemDescription": "English professional golfer", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Dinwiddie_(golfer)", "wikipedia_page": {"main": "Robert Maitland Dinwiddie (born 29 December 1982) is an English professional golfer.", "link_mentions": [{"page": "Dumfries", "response": ["Dumfries is also the hometown of three-times 24 Hours of Le Mans winner, Allan McNish, as it was to fellow racing driver David Leslie. Scotland rugby union internationalists Duncan Hodge, Nick De Luca, Craig Hamilton and Alex Dunbar were born in Dumfries as were professional golfers Andrew Coltart and Robert Dinwiddie. Curling world champions David Murdoch, Euan Byers and Craig Wilson were all born in Dumfries. Former darts champion Rab Smith is another Doonhamer."]}, {"page": "Robert Dinwiddie", "response": ["Robert Dinwiddie (1692 – 27 July 1770) was a British colonial administrator who served as lieutenant governor of colonial Virginia from 1751 to 1758, first under Governor Willem Anne van Keppel, 2nd Earl of Albemarle, and then, from July 1756 to January 1758, as deputy for John Campbell, 4th Earl of Loudoun. Since the governors at that time were largely absentee, he was the de facto head of the colony for much of the time. Dinwiddie is credited for starting the military career of George Washington.", "Dinwiddie was born at Glasgow before 2 October 1692, the son of Robert Dinwiddie of Germiston and Elizabeth Cumming. His younger brother Lawrence Dinwiddie was later Lord Provost of Glasgow.", "In early spring 1754, Dinwiddie sent Washington to build a road to the Monongahela. After having attacked the French at the Battle of Jumonville Glen, Washington retreated and built a small stockade, Fort Necessity, at a spot then called \"Great Meadows\", by the Youghiogheny River, eleven miles southeast of present-day Uniontown. Here he encountered the French in a skirmish on 3 July 1754 and was forced to surrender. Dinwiddie was subsequently active in rallying other colonies in defense against France and ultimately prevailed upon the British to send General Edward Braddock to Virginia with two regiments of regular troops, in part with a letter to Lord Halifax on 25 October 1754 containing these words:wvculture.org: \"Governor Robert Dinwiddie to the Earl of Halifax, October 25, 1754\", extracted from The Official Records of Robert Dinwiddie, Volume I, R. A. Brock, editor (Richmond: Virginia Historical Society, 1883), pp. 366–369.", "thumb|Robert Dinwiddie, governor of Virginia (NYPL NYPG94-F42-419805)", "Dinwiddie County, Virginia, which lies 30 miles south of Richmond, is named in honor of Robert Dinwiddie. Dinwiddie Hall, since 1972 a dormitory at the College of William & Mary, is also named in honor of Robert Dinwiddie.", "Robert Dinwiddie died on 27 July 1770. He married some time before 1738 Rebecca Auchinleck (or Afflick); together they had two children Rebecca Dinwiddie and Elizabeth Dinwiddie.", "His official records, which were compiled by the Virginia Historical Society in 1883, are left in five volumes.  They cover the years of his administration of the Virginia colony, from 1751 to 1758. His archival material resides at several places, and some related to the French and Indian War is visible to web browsers. He was the subject of the book Robert Dinwiddie: Servant of the Crown.John Richard Alden: Robert Dinwiddie: Servant of the Crown (Colonial Williamsburg: January 1973, 126pp)"]}, {"page": "Saint-Omer Open", "response": ["| 2010 || CHA, EUR ||  Martin Wiegele || align=center|277 || align=center|−7 || 2 strokes ||  Robert Dinwiddie Pelle Edberg Jamie Elson Matt Haines Raphaël Jacquelin"]}, {"page": "Barnard Castle School", "response": ["* Robert Dinwiddie, professional golfer."]}, {"page": "St Andrews Trophy", "response": ["*  Robert Dinwiddie 2006"]}, {"page": "2007 Challenge Tour", "response": ["| Robert Dinwiddie (1)", "| Robert Dinwiddie (2)", "|align=center|8 || Robert Dinwiddie || || align=center|91,257"]}, {"page": "Kenya Open", "response": ["| 2010 || CHA ||  Robert Dinwiddie || align=center|272 || align=center|−12 || 3 strokes ||  Julio Zapata || Muthaiga || "]}, {"page": "Scottish Challenge", "response": ["| 2007 ||  Robert Dinwiddie || align=center|268 || align=center|−20 || 4 strokes ||  Jamie McLeary || Macdonald Cardrona Hotel"]}, {"page": "Rolex Trophy", "response": ["| 2007 ||  Robert Dinwiddie || align=center|270 || align=center|−18 || 3 strokes ||  Ross McGowan"]}, {"page": "Open de Bretagne", "response": ["| 2013 || CHA ||  Andrea Pavan || align=center|269 || align=center|−11 || 4 strokes ||  Rhys Davies Robert Dinwiddie"]}, {"page": "2005 Walker Cup", "response": ["* Robert Dinwiddie", "|Robert Dinwiddie"]}, {"page": "List of male golfers", "response": ["| Robert Dinwiddie||1982–"]}, {"page": "2008 U.S. Open (golf)", "response": ["*England: Phillip Archer, Robert Dinwiddie, Johan Edfors, Ross Fisher, Alastair Forsyth, Thomas Levet, Ross McGowan"]}, {"page": "Brabazon Trophy", "response": ["| 2006 || Ganton Golf Club ||  Robert Dinwiddie || 282"]}, {"page": "François Calmels", "response": ["| Robert Dinwiddie,  Adam Gee, Sam Walker"]}, {"page": "2010 Challenge Tour", "response": ["| Robert Dinwiddie (3)"]}, {"page": "Martin Wiegele", "response": ["| Robert Dinwiddie,  Pelle Edberg, Jamie Elson,  Matt Haines, Raphaël Jacquelin", "| Robert Dinwiddie,  Pelle Edberg, Jamie Elson,  Matt Haines, Raphaël Jacquelin"]}, {"page": "2011 U.S. Open (golf)", "response": ["*England: Nicolas Colsaerts, Robert Dinwiddie, Johan Edfors, Stephen Gallacher, Andreas Hartø, David Howell, Maarten Lafeber, Thomas Levet, Shane Lowry, Alex Norén, Robert Rock, Marcel Siem"]}, {"page": "2010 Challenge Tour graduates", "response": ["|align=left| Robert Dinwiddie || 8 || 95,650 || 30 || 14 ||  || 141 || 170,707"]}, {"page": "Andrea Pavan", "response": ["| Rhys Davies,  Robert Dinwiddie"]}, {"page": "2007 Challenge Tour graduates", "response": ["|align=left| Robert Dinwiddie* || 8 || 91,257 || 30 || 16 ||  || 72 || 426,811"]}, {"page": "D+D Real Czech Challenge", "response": ["| 2013 ||  François Calmels || align=center|266 || align=center|−22 || 3 strokes ||  Robert Dinwiddie Adam Gee Sam Walker"]}, {"page": "List of Great Britain and Ireland Walker Cup golfers", "response": ["|  Robert Dinwiddie || 2005"]}, {"page": "Tennessee State Tigers and Lady Tigers", "response": ["In 2014, From the Rough was released which is a movie based on a true story about the successes and challenges of the first African-American woman (Dr. Catana Starks) to coach a Division I college men's golf team.  Starks helped develop several noteworthy golfers at Tennessee State such as Sean Foley and Robert Dinwiddie."]}, {"page": "2013 Challenge Tour graduates", "response": ["|align=left| Robert Dinwiddie || 12 || 86,489 || 11 || 5 ||  || n/a || 45,733"]}, {"page": "2015 Open Championship", "response": [":Woburn – Robert Dinwiddie, Paul Dunne (a), Retief Goosen", "|Robert Dinwiddie ||  || 73-77=150"]}, {"page": "2016 BMW PGA Championship", "response": ["| Robert Dinwiddie ||  || 70-69=139"]}, {"page": "2017 Open Championship", "response": [":Royal Cinque Ports – Austin Connelly, Robert Dinwiddie, Matthew Southgate", "|Robert Dinwiddie ||  || 77-79=156 || rowspan=2 align=center|+16"]}, {"page": "Dinwiddie (surname)", "response": ["* Robert Dinwiddie (1693–1770), British lieutenant governor of colonial Virginia", "* Robert Dinwiddie (golfer) (born 1982), English golfer"]}]}}