{"wiki_id": "http://www.wikidata.org/entity/Q27811407", "itemLabel": "Helen Greaves", "itemDescription": "British TV producer and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Helen_Greaves", "wikipedia_page": {"main": "Helen Greaves is an English television script editor, producer and writer. She was born in Winscombe Somerset and grew up near Wigton in Cumbria and in Oxfordshire.\nGreaves studied Drama at Manchester University and she later went on to work at Contact Theatre and then the BBC in London.  \nGreaves began as working as a Floor Assistant at BBC TV centre on various shows including Top of the Pops, Saturday Superstore and later as a script editor in BBC Drama where she worked with writers including Penelope Mortimer,  John Mortimer,  John Harvey, Peter Flannery, Ian La Frenais, Jimmy Nail and Sandy Welch  on the series Casualty, Summer’s Lease, Portrait of a Marriage, A Fatal Inversion and Spender. She later worked as a producer on EastEnders, O Mary This London and  Life With Eliza. She also wrote for Casualty, Bramwell and Holby City.\nIn 2009 she wrote and co-produced the short film \"Perfect Day\" and in 2012 she wrote Walking the Dogs which starred Emma Thompson and Eddie Marsan.\nShe is currently working as a screenwriter on film projects. She lives in Dartmouth Park in north London.", "link_mentions": [{"page": "EastEnders", "response": ["A new era began in 1990 with the introduction of Phil Mitchell (Steve McFadden) and Grant Mitchell (Ross Kemp)—the Mitchell brothers—successful characters who would go on to dominate the soap thereafter. As the new production team cleared the way for new characters and a new direction, all of the characters introduced under Gibbon were axed from the show at the start of the year. Ferguson introduced other characters and was responsible for storylines including HIV, Alzheimer's disease and murder. After a successful revamp of the soap, Ferguson decided to leave EastEnders in July 1991. Ferguson was succeeded by both Leonard Lewis and Helen Greaves who initially shared the role as Executive Producer for EastEnders. Lewis and Greaves formulated a new regime for EastEnders, giving the writers of the serial more authority in storyline progression, with the script department providing \"guidance rather than prescriptive episode storylines\". By the end of 1992, Greaves left and Lewis became executive and series producer. He left EastEnders in 1994 after the BBC controllers demanded an extra episode a week, taking its weekly airtime from 60 to 90 minutes. Lewis felt that producing an hour of \"reasonable quality drama\" a week was the maximum that any broadcasting system could generate without loss of integrity. Having set up the transition to the new schedule, the first trio of episodes—dubbed The Vic siege—marked Lewis's departure from the programme. Barbara Emile then became the Executive Producer of EastEnders,\"EASTENDERS\", BBC. Retrieved 11 November 2007.\"John Yorke – The New EE Boss \", Walford Gazette. Retrieved 11 November 2007. remaining with EastEnders until early 1995. She was succeeded by Corinne Hollingworth."]}, {"page": "List of EastEnders crew members", "response": ["* Helen Greaves (1991–1992)"]}]}}