{"wiki_id": "http://www.wikidata.org/entity/Q2789496", "itemLabel": "Jimmy Adams", "itemDescription": "professional golfer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmy_Adams_(golfer)", "wikipedia_page": {"main": "James Adams (21 October 1910 – 9 January 1986) was a Scottish professional golfer who was chosen for five Ryder Cup sides and achieved high finishes in The Open Championship on several occasions (five top-10s including two seconds).Born in Troon, Adams turned professional when 14, and won the Irish Professional Championship, in 1933. In 1936, he won the Penfold Tournament on the British Tour, and came very close to winning The Open Championship at Hoylake. Adams shared the third-round lead with Henry Cotton, but despite beating Cotton (and Gene Sarazen, also in the field that year) in the final round, Adams finished a single shot behind Alf Padgham. Two years later, at Royal St George's, Adams' final two rounds of 78-78 put him in second place, this time behind Reg Whitcombe. When the Championship resumed after World War II, he was fourth in 1951, and in 1954, Adams was the only player to break 70 in both the final two rounds at Royal Birkdale with a pair of 69s, but his effort was not quite enough to catch Peter Thomson, and Adams finished fifth, three shots behind.\nIn 1937 Adams was runner-up in the British PGA Matchplay championship, the first of three occasions he would reach the final of that event without winning it. He won the British Masters in 1946 (tie with Bobby Locke), the Silver King tournament in 1948 (tie with Charlie Ward), the Dutch Open and Belgian Open in 1949, the Italian Open in 1951 and the Lakes Open, an event on the Australian circuit, in 1952.Adams was selected for the 1939 Ryder Cup team, although the matches did not take place, then again in 1947, 1949, 1951 and 1953. He won both his matches in 1949. In 1951, the British team all played in the North and South Open in America in preparation for the Ryder Cup matches, and Adams finished fourth in a field that contained the entire U.S. Ryder Cup team.\nAdams was at Royal Liverpool before moving to Beaconsfield Golf Club in 1946. He was then head pro at the Wentworth Club from 1949 to 1952. In early 1952 he became the professional at Royal Sydney Golf Club but later in the year returned to England as professional at Royal Mid-Surrey Golf Club, where he stayed until 1969. During his brief spell in Australia he won the Lakes Open.", "link_mentions": {}}}