{"wiki_id": "http://www.wikidata.org/entity/Q27854163", "itemLabel": "William Bartley", "itemDescription": "Australian lawyer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Bartley_(politician)", "wikipedia_page": {"main": "William Bartley (4 January 1801 – 3 September 1885) was a lawyer in South Australia who was appointed an acting member of the Legislative Council of South Australia, serving in 1849.", "link_mentions": [{"page": "William Bartley", "response": ["William Bartley may refer to:", "* William Bartley (politician) (1801–1885), Australian lawyer and politician"]}, {"page": "Charles Cooper (judge)", "response": ["His sister Sarah Ann Cooper (c. 1804 – 31 May 1895) married William Bartley (1801–1885), Senior Solicitor to the Lands Titles Office on 23 September 1852."]}, {"page": "Bartley", "response": ["*William Bartley (politician) (1801–1885), lawyer in South Australia"]}, {"page": "John Bristow Hughes", "response": ["On 6 January 1847, at Trinity Church, Adelaide, Hughes married Margaret Bartley ( – 29 June 1881), daughter of solicitor William Bartley. Their children included:"]}, {"page": "William Bakewell (politician)", "response": ["William was born at Whichton Lodge, near Shirleywich, in the parish of Weston-on-Trent, Staffordshire. As a boy he was employed by solicitors Christian & Co. of Liverpool, and emigrated in the Fairfield, to Adelaide arriving in April 1839. He carried letters of recommendation from solicitor William Bartley, through which he obtained employment as a clerk in the office of Mann & Gwynne, to whom he was later articled. He was admitted to the Bar in 1848 and taken into partnership with his former employer as Bartley & Bakewell, whose business as solicitors became one of the largest and best-conducted in the city. They were joined for a time by R. I. Stow, then W. D. Scott, son of the Hon. W. Scott, later to become Master of the Supreme Court. Bakewell's first foray into public activity was in opposition to State aid to religion, acting as Secretary of the Australasian National League."]}, {"page": "William Smillie", "response": ["Smillie was plagued with poor health. In 1849 he took three months' leave of absence in Tasmania, in the hope of some improvement. William Bartley acted in his absence. "]}]}}