{"wiki_id": "http://www.wikidata.org/entity/Q278986", "itemLabel": "A. O. L. Atkin", "itemDescription": "British mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/A._O._L._Atkin", "wikipedia_page": {"main": "Arthur Oliver Lonsdale Atkin (31 July 1925 – 28 December 2008), who published under the name A. O. L. Atkin, was a British mathematician.\nAs an undergraduate during World War II, Atkin worked at Bletchley Park cracking German codes. He received his Ph.D. in 1952 from the University of Cambridge, where he was one of John Littlewood's research students. During 1964–1970, he worked at the Atlas Computer Laboratory at Chilton, computing modular functions. Toward the end of his life, he was Professor Emeritus of mathematics at the University of Illinois at Chicago.\nAtkin, along with Noam Elkies, extended Schoof's algorithm to create the Schoof–Elkies–Atkin algorithm. Together with Daniel J. Bernstein, he developed the sieve of Atkin.\nAtkin is also known for his work on properties of the integer partition function and the monster module. He was a vocal fan of using computers in mathematics, so long as the end goal was theoretical advance: \"Each new generation of machines makes feasible a whole new range of computations; provided mathematicians pursue these rather than merely break old records for old sports, computation will have a significant part to play in the development of mathematics.\"\nAtkin died of nosocomial pneumonia on 28 December 2008, in Maywood, Illinois.", "link_mentions": [{"page": "Partition function (number theory)", "response": ["Since 5, 7, and 11 are consecutive primes, one might think that there would be an analogous congruence for the next prime 13, p(13k + a) \\equiv 0 \\pmod{13} for some a. However, there is no congruence of the form p(bk + a) \\equiv 0 \\pmod{b} for any prime b other than 5, 7, or 11. Instead, to obtain a congruence, the argument of p should take the form cbk+a for some c>1. In the 1960s, A. O. L. Atkin of the University of Illinois at Chicago discovered additional congruences of this form for small prime moduli. For example:"]}, {"page": "Noam Elkies", "response": ["In 1987, he proved that an elliptic curve over the rational numbers is supersingular at infinitely many primes.  In 1988, he found a counterexample to Euler's sum of powers conjecture for fourth powers. His work on these and other problems won him recognition and a position as an associate professor at Harvard in 1990. In 1993, he was made a full, tenured professor at the age of 26. This made him the youngest full professor in the history of Harvard. Along with A. O. L. Atkin he extended Schoof's algorithm to create the Schoof–Elkies–Atkin algorithm."]}, {"page": "Sieve of Atkin", "response": ["In mathematics, the sieve of Atkin is a modern algorithm for finding all prime numbers up to a specified integer.  Compared with the ancient sieve of Eratosthenes, which marks off multiples of  primes, the sieve of Atkin does some preliminary work and then marks off multiples of squares of primes, thus achieving a better theoretical asymptotic complexity. It was created in 2003 by A. O. L. Atkin and Daniel J. Bernstein.A.O.L. Atkin, D.J. Bernstein, Prime sieves using binary quadratic forms, Math. Comp. 73 (2004), 1023-1030."]}, {"page": "Schoof's algorithm", "response": ["In the 1990s, Noam Elkies, followed by A. O. L. Atkin, devised improvements to Schoof's basic algorithm by restricting the set of primes S =  \\{l_1, \\ldots, l_s\\} considered before to primes of a certain kind. These came to be called Elkies primes and Atkin primes respectively. A prime l is called an Elkies prime if the characteristic equation: \\phi^2-t\\phi+ q = 0 splits over \\mathbb{F}_l, while an Atkin prime is a prime that is not an Elkies prime. Atkin showed how to combine information obtained from the Atkin primes with the information obtained from Elkies primes to produce an efficient algorithm, which came to be known as the Schoof–Elkies–Atkin algorithm. The first problem to address is to determine whether a given prime is Elkies or Atkin. In order to do so, we make use of modular polynomials, which come from the study of modular forms and an interpretation of elliptic curves over the complex numbers as lattices. Once we have determined which case we are in, instead of using division polynomials, we are able to work with a polynomial that has lower degree than the corresponding division polynomial: O(l) rather than O(l^2).  For efficient implementation, probabilistic root-finding algorithms are used, which makes this a Las Vegas algorithm rather than a deterministic algorithm."]}, {"page": "Primality certificate", "response": ["To address the problem of efficient certificate generation for larger numbers, in 1986 Shafi Goldwasser and Joe Kilian described a new type of certificate based on the theory of elliptic curves.Goldwasser, S. and Kilian, J. \"Almost All Primes Can Be Quickly Certified\". Proc. 18th STOC. pp. 316–329, 1986. Full text. This was in turn used by A. O. L. Atkin and François Morain as the basis for Atkin-Goldwasser-Kilian-Morain certificates, which are the type of certificates generated and verified by elliptic curve primality proving systems. Just as Pratt certificates are based on Lucas's theorem, Atkin–Goldwasser–Kilian–Morain certificates are based on the following theorem of Goldwasser and Kilian (lemma 2 of \"Almost All Primes Can Be Quickly Certified\"):"]}, {"page": "Schoof–Elkies–Atkin algorithm", "response": ["The Schoof–Elkies–Atkin algorithm (SEA) is an algorithm used for finding the order of or calculating the number of points on an elliptic curve over a finite field. Its primary application is in elliptic curve cryptography. The algorithm is an extension of Schoof's algorithm by Noam Elkies and A. O. L. Atkin to significantly improve its efficiency (under heuristic assumptions)."]}, {"page": "AOL Atkin", "response": ["#REDIRECT A. O. L. Atkin"]}, {"page": "A.O.L. Atkin", "response": ["#REDIRECT A. O. L. Atkin"]}, {"page": "A. O. L. Atkins", "response": ["#REDIRECT A. O. L. Atkin"]}, {"page": "Atkin", "response": ["* A. O. L. Atkin (1925–2008), British mathematician"]}, {"page": "AOL Atkins", "response": ["#REDIRECT A. O. L. Atkin"]}, {"page": "A. Oliver L. Atkin", "response": ["#REDIRECT A. O. L. Atkin"]}, {"page": "Ramanujan's congruences", "response": ["In the 1960s, A. O. L. Atkin of the University of Illinois at Chicago discovered additional congruences for small prime moduli. For example:"]}, {"page": "Atlas Computer Laboratory", "response": ["Throughout its life it was headed by Jack Howlett. Early staff or visitors included A. O. L. Atkin (1964–1970), I. J. Good (1964–1967), and Donald Michie who had worked together at Bletchley Park during the Second World War."]}, {"page": "List of people by Erdős number", "response": ["* A. O. L. Atkin"]}, {"page": "A O L Atkin", "response": ["#REDIRECT A. O. L. Atkin "]}, {"page": "Deaths in December 2008", "response": ["*A. O. L. Atkin, 83, American mathematician, complications from a fall."]}, {"page": "A. Atkin", "response": ["#redirectA. O. L. Atkin"]}, {"page": "Oliver Atkin", "response": ["#redirectA. O. L. Atkin"]}, {"page": "Counting points on elliptic curves", "response": ["In the 1990s, Noam Elkies, followed by A. O. L. Atkin devised improvements to Schoof's basic algorithm by making a distinction among the primes \\ell_1, \\ldots, \\ell_s that are used.  A prime \\ell is called an Elkies prime if the characteristic equation of the Frobenius endomorphism, \\phi^2-t\\phi+ q = 0, splits over \\mathbb{F}_\\ell.  Otherwise \\ell is called an Atkin prime.  Elkies primes are the key to improving the asymptotic complexity of Schoof's algorithm.  Information obtained from the Atkin primes permits a further improvement which is asymptotically negligible but can be quite important in practice.  The modification of Schoof's algorithm to use Elkies and Atkin primes is known as the Schoof–Elkies–Atkin (SEA) algorithm."]}, {"page": "A. O.L. Atkin", "response": ["#Redirect A. O. L. Atkin"]}, {"page": "Elliptic curve primality", "response": ["In mathematics, elliptic curve primality testing techniques, or elliptic curve primality proving (ECPP), are among the quickest and most widely used methods in primality proving. It is an idea put forward by Shafi Goldwasser and Joe Kilian in 1986 and turned into an algorithm by A. O. L. Atkin the same year.  The algorithm was altered and improved by several collaborators subsequently, and notably by Atkin and , in 1993.Top, Jaap, Elliptic Curve Primality Proving, http://www.math.rug.nl/~top/atkin.pdf  The concept of using elliptic curves in factorization had been developed by H. W. Lenstra in 1985, and the implications for its use in primality testing (and proving) followed quickly."]}, {"page": "List of people from Oak Park, Illinois", "response": ["* A. O. L. Atkin, mathematician"]}, {"page": "René Schoof", "response": ["In 1985, Schoof discovered an algorithm which enabled him to count points on elliptic curves over finite fields in polynomial time.René Schoof: Elliptic curves over finite fields and the calculation of square roots mod p, Mathematics of Computation,  No. 44, 1985, 483–494. This was important for the use of elliptic curves in cryptography, and represented a theoretical breakthrough, as it was the first deterministic polynomial time algorithm for counting points on elliptic curves. The algorithms known before (e.g. the baby-step giant-step algorithm) were of exponential running time. His algorithm was improved by A. O. L. Atkin (1992) and Noam Elkies (1990)."]}, {"page": "Multipartition", "response": ["An r-component multipartition of an integer n is an r-tuple of partitions λ(1),...,λ(r) where each λ(i) is a partition of some ai and the  ai sum to n.  The number of r-component multipartitions of n is denoted Pr(n).  Congruences for the function Pr(n) have been studied by A. O. L. Atkin."]}, {"page": "Margaret Millington", "response": ["She was born Margaret Hilary Ashworth in Halifax, Yorkshire, the daughter of the local assistant head postmaster, and was educated there. She continued her studies at St Mary's College, Durham and went on to Oxford University, where she earned a PhD in 1968 with A. O. L. Atkin as her advisor. Also, in 1968, she married Lieutenant A.H. Millington. She was awarded a two-year Science Research Council Fellowship which allowed her to pursue research at any university. During her husband's two-year posting in Germany, she taught mathematics at an Army Education Centre there."]}]}}