{"wiki_id": "http://www.wikidata.org/entity/Q27957333", "itemLabel": "Seán Quigley", "itemDescription": "Northern Irish Gaelic footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Se%C3%A1n_Quigley", "wikipedia_page": {"main": "Seán Quigley (born 1992) is a Gaelic footballer whose league and championship career at senior level with the Fermanagh county team has spanned six seasons since making his debut in 2011. He is from Roslea, County Fermanagh, Northern Ireland.", "link_mentions": [{"page": "Cillian O'Connor", "response": ["In 2015, O'Connor was in the running for the Golden Boot and initially finished tied for top with Fermanagh's Seán Quigley. However, following a review of Mayo's championship winning DVD, the Gaelic Athletic Association realised they had incorrectly noted O'Connor's score as they had recorded him as having scored 1-6 but he had actually scored 1–7. As a result, O'Connor's tally was increased by 1 which allowed him to claim the Golden Boot."]}, {"page": "2015 All-Ireland Senior Football Championship", "response": ["|Seán Quigley", "|Seán Quigley", "|Seán Quigley"]}, {"page": "2016 Christy Ring Cup Final", "response": ["Meath were right back in contention when Neil Heffernan smashed home a brilliant goal five minutes into the second half. In the 70th minute, Kevin Keena squared the ball to fellow sub Seán Quigley, who smashed home a goal from 20 metres. Quigley added a stoppage-time point, and Meath had secured what appeared to be a sensational 2–18 to 1–20 victory."]}, {"page": "Roslea Shamrocks GFC", "response": ["*Seán Quigley"]}, {"page": "Mark Anthony McGinley", "response": ["McGinley's Championship debut came in the 2016 Ulster Senior Football Championship quarter-final victory over Fermanagh; in goal from the start, he notably saved a Seán Quigley penalty which Neil McGee conceded during first half stoppage time. McGinley retained his place in goal for the semi-final against Monaghan — which Donegal won after a replay, also featuring McGinley in goal. McGinley played in the Ulster final, a narrow two-point loss to Tyrone, the subsequent All-Ireland qualifier defeat of Cork at Croke Park, and the All-Ireland quarter-final loss to Dublin at Croke Park."]}, {"page": "Fermanagh county football team", "response": ["* Seán Quigley - Roslea Shamrocks", "*In 2015, Cillian O'Connor was in the running for the Golden Boot and initially finished tied for top with Fermanagh's Seán Quigley. However, following a review of Mayo's championship winning DVD, the Gaelic Athletic Association realised they had incorrectly noted O'Connor's score as they had recorded him as having scored 1-6 but he had actually scored 1–7. As a result, O'Connor's tally was increased by 1 which allowed him to claim the Golden Boot."]}]}}