{"wiki_id": "http://www.wikidata.org/entity/Q27909845", "itemLabel": "Frank Donovan", "itemDescription": "politician (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Donovan_(politician)", "wikipedia_page": {"main": "Francis Anthony \"Frank\" Donovan (born 28 January 1947) is a former Australian politician who was a member of the Legislative Assembly of Western Australia from 1987 to 1993. A Vietnam veteran, Donovan worked as a social worker before entering politics. He was a member of the Labor Party until 1991, when he resigned to sit as an independent.", "link_mentions": [{"page": "1993 Western Australian state election", "response": ["| Frank Donovan"]}, {"page": "Kim Hames", "response": ["Hames first stood for parliament at the 1987 by-election for the seat of Morley-Swan, but was defeated by the Labor candidate, Frank Donovan. At the 1989 state election, he contested the seat of Perth, but lost by a narrow margin to Labor's Ian Alexander. Hames was successful in his third attempt to enter parliament, winning the seat of Dianella from Labor's Keith Wilson at the 1993 election. He transferred to the new seat of Yokine at the 1996 election, after Dianella was abolished in a redistribution. Hames was elevated to the ministry in January 1997, becoming Minister for Housing, Minister for Aboriginal Affairs, and Minister for Water Resources in the government of Richard Court.Hon. Dr Kim Desmond Hames MLA MBBS, JP – Parliament of Western Australia. Retrieved 12 July 2016. During his time as minister responsible for the Department of Aboriginal Affairs, he was involved in the repatriation from England of the head of Yagan, a 19th-century Noongar warrior.\"Minister to join delegation to retrieve Yagan's head from Britain\", Media Statements, Government of Western Australia, 20 August 1997. Retrieved 12 July 2016. Hames remained in the ministry until the 2001 state election, when he was defeated in his own seat by Labor's Bob Kucera. The Court government was also defeated."]}, {"page": "Members of the Western Australian Legislative Assembly, 1989–1993", "response": ["|| Frank Donovan || Labor/Independent || Morley || 1987–1993", ": Three members left the Labor Party in 1991 for differing reasons to sit as independents—Pam Buchanan (Ashburton) on 1 February 1991 due to anger over Premier Carmen Lawrence's handling of a cabinet reshuffle, Dr Ian Alexander (Perth) on 4 March 1991 due to his views on the WA Inc scandal, and Frank Donovan (Morley) on 9 October 1991 due to Bob Hawke's role in supporting the Gulf War."]}, {"page": "1989 Western Australian state election", "response": ["| align=\"left\" bgcolor=\"FF6B6B\" |Frank Donovan"]}, {"page": "Members of the Western Australian Legislative Assembly, 1986–1989", "response": ["|| Frank Donovan || Labor || Morley-Swan || 1987–1993", ": On 18 March 1987, the Labor member for Morley-Swan, Hon Arthur Tonkin, resigned. Labor candidate Frank Donovan won the resulting by-election on 9 May 1987."]}, {"page": "Electoral district of Morley", "response": ["The district was held by Labor at all times, with the exception of the period between 1991 and 1993, when former Labor MP Frank Donovan sat as an independent. The member at the time of Morley's abolition, Labor MP Clive Brown, went on to represent the newly created seat of Bassendean from 1996 to 2005.", "| Frank Donovan", "|rowspan=\"2\"| Frank Donovan"]}, {"page": "List of Western Australian state by-elections", "response": ["|Frank Donovan"]}, {"page": "Electoral results for the district of Morley", "response": ["| Frank Donovan", "|rowspan=\"2\"| Frank Donovan"]}, {"page": "Independent politicians in Australia", "response": ["|Frank Donovan || Morley || 1991–1993 || Resigned from the Labor Party in October 1991 over policy differences."]}, {"page": "Candidates of the 1993 Western Australian state election", "response": ["*Frank Donovan MLA (Morley) – elected as Labor"]}, {"page": "Frank Donovan", "response": ["Frank Donovan may refer to:", "* Frank Donovan (footballer) (1919–2003), Welsh Olympic footballer", "* Frank Donovan (politician) (born 1947), Australian politician"]}, {"page": "Francis Donovan", "response": ["*Frank Donovan (footballer) (Francis James Donovan, 1919–2003), Welsh Olympic footballer", "*Frank Donovan (politician) (Francis Anthony Donovan, born 1947), Australian politician", "*Frank Donovan (disambiguation)"]}, {"page": "1987 Morley-Swan state by-election", "response": ["A by-election for the seat of Morley-Swan in the Legislative Assembly of Western Australia was held on 9 May 1987. It was triggered by the resignation of Arthur Tonkin (the sitting Labor member) on 18 March 1987. The election was won by Labor's Frank Donovan, with the party suffering a small swing against it from the 1986 state election.", "Morley-Swan was abolished at the 1989 state election, where Frank Donovan won the re-created seat of Morley. Donovan left the Labor Party to sit as an independent in October 1991, but did not recontest the seat at the 1993 state election.Francis Anthony Donovan, Biographical Register of Members of the Parliament of Western Australia. Retrieved 10 January 2017. Kim Hames, his chief opponent at the by-election, ran in the seat of Perth in 1989, but was narrowly defeated by a Labor candidate. He entered parliament at his third attempt, in 1993, and eventually became deputy premier under Colin Barnett from 2008 to 2016.Kim Desmond Hames, Biographical Register of Members of the Parliament of Western Australia. Retrieved 10 January 2017."]}, {"page": "Candidates of the 1989 Western Australian state election", "response": ["|Morley || Labor ||| Frank Donovan || David MacGregor || || || "]}, {"page": "Candidates of the 1983 Western Australian state election", "response": ["|Murchison-Eyre || Liberal || Frank Donovan || |Peter Coyne (Lib) || Kevin Seivwright (Ind)"]}]}}