{"wiki_id": "http://www.wikidata.org/entity/Q2793517", "itemLabel": "Peter Rouw", "itemDescription": "British sculptor", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Rouw", "wikipedia_page": {"main": "Peter Rouw II (17 April 1771– 9 December 1852) was a London-based sculptor specialising in bas-reliefs in marble, often in the form of mural church monuments, and in wax miniature portraits, often of a pink hue on black glass. He designed medals, including one of William Wilberforce, and also made a few marble busts. He exhibited at the Royal Academy of Arts. In 1807 Rouw was appointed modeller of cameos and gems to the Prince Regent.", "link_mentions": [{"page": "William Shield", "response": ["John 'Mad Jack' Fuller commissioned sculptor Peter Rouw (1771–1852), of Portland Lane, London, to create a memorial to mark the grave of his friend William Shield in Westminster Abbey. Dr Ireland, Dean of the Abbey, is said to have refused permission for the tablet to be installed as he took objection to the word \"gentleman\" being used in its text.  Fuller subsequently had the tablet installed at his home church, St Thomas à  Becket, Brightling, Sussex where it remains.  A medallion portrait of William Shield in profile is accompanied by this inscription: "]}, {"page": "Elijah Impey", "response": ["In 1790 Impey was returned to Parliament as the member for New Romney constituency and spent the next seven years as an MP before retiring to Newick Park near Brighton. He died there in 1809 and was buried in the family vault at St Paul's, Hammersmith, London. With his wife he is commemorated in the church with a wall monument by Peter Rouw. He had married on 18 January 1768 Mary, daughter of Sir John Reade, 5th Baronet, of Shipton Court, Oxfordshire; they had five sons."]}, {"page": "Francis Egerton, 3rd Duke of Bridgewater", "response": ["A 1788 portrait drawing of the Duke of Bridgewater by William Marshall Craig was engraved by Edward Scriven in 1835; prints are held in the National Portrait Gallery, London and the Scottish National Gallery in Edinburgh. Two Wax medallion portraits of the Duke by Peter Rouw dating from 1803 are held at the National Portrait Gallery and at Tatton Hall in Cheshire."]}, {"page": "Herbert Taylor (British Army officer)", "response": ["Taylor became a Major-General in 1813, and a Lieutenant-General in 1825. He was Master of St Katherine's Hospital, Regent's Park, and Master Surveyor and Surveyor-General of the Ordnance from 1828. He died in 1839. The monument to him at St. Katherine's is by the sculptor Peter Rouw."]}, {"page": "St Elphin's Church, Warrington", "response": ["* The monuments include tablets to Dr Thomas Percival, who died in 1804, by H. Rouw (brother of Peter Rouw), and to Thomas Lyon, who died in 1818, by Webster of Kendal. "]}, {"page": "Moses Haughton the Elder", "response": ["Haughton was said to be of a \"quiet and retiring disposition\" and was not much known outside Birmingham during his lifetime. He lived for many years at Ashted, outside the city. He died there on 24 December 1804 and was buried in Wednesbury; a marble monument with his portrait, sculpted by Peter Rouw was erected in his memory at St Philip's Church, Birmingham."]}, {"page": "Sir John de la Pole, 6th Baronet", "response": ["A marble mural monument in his memory exists in Shute Church, signed \"P.Rouw sculp. London\", by Peter Rouw. It consists of an inscribed tablet flanked on either side by a fasces supporting an entablature on top of which, above his coat of arms, is a classical oil-lamp with flame:"]}, {"page": "John Farquhar (gunpowder dealer)", "response": ["Farquhar died suddenly of apoplexy on 6 July 1826. His wealth amounted to about £1.5 million. He left no will, and it was divided among his seven nephews and nieces. He was buried in St John's Wood Church, London with a monument to him by Peter Rouw."]}, {"page": "Samuel Joseph (sculptor)", "response": ["He was a pupil of Peter Rouw, and attended the Royal Academy Schools in 1811, gaining the silver medal there in both 1811 and 1812. In 1815 he won the gold medal for \"Eve Supplicating Forgiveness\". In 1823 he went to Edinburgh, becoming a founding member of the Royal Scottish Academy in 1826. During this time he taught Alexander Handyside Ritchie."]}, {"page": "New Shute House", "response": ["Parlby married in 1748 Lydia Martyn. He resided at Stone Hall, Stonehouse, in Plymouth,Heraldic Visitation of England and Wales, Notes (1896–1921), Howard, Joseph Jackson, (14 volumes. [London]: Frederick Arthur Crisp, 1896–1921), FHL book 942 D23hn., vol. 13 p. 92 (quoted in \"Thomas Parlby\", Community Trees, Family Search) \"the big house overlooking Stonehouse Pool\".Gill; Plymouth, A New history, p. 91 He rebuilt the old chapel at Stonehouse in 1787 and his 1802 monument, by Peter Rouw of London (who also made the monuments to Sir John Pole and his wife Lady Anne in Shute Church), was situated in the new church,Lysons, Magna Britannia, 1822, vol.6, Parishes: Slapton – South Sydenham, pp. 451–468 apparently destroyed by World War II bombing.  Templer and Parlby were the government contractors who rebuilt Plymouth Dockyard in 1763, and nearly doubled it in size by levelling the hill to the south and replacing all the buildings except the officers' accommodation.Pevsner, pp. 650–1 One of these docks is still known as \"Parlby Dock\". The same partnership also built between 1779 and 1785 in the classical style the Royal Marine Barracks on Durnford Street, Stonehouse, Plymouth, which still survive on three sides of a courtyard now closed by 19th-century additions, described by Copper Plate Magazine as \" a fine pile of buildings\".Pevsner, p. 655 Parlby also in a smaller commission rebuilt the kitchens at Saltram House after the fire of 1778, \"a fine lofty room with a coved ceiling\".Pevsner, p. 90 Parlby had the following progeny:"]}, {"page": "Mary Impey", "response": ["Between 1775 and 1783, Impey bore four more children, three of whom survived to return with them to England when her husband was impeached.  She bore one more child back in England. Her husband died in 1809 and she died in 1818 at Newick Park, near Lewes, East Sussex, and both were buried in a family vault at St Paul's, Hammersmith, London. They are commemorated in the church with a wall monument by Peter Rouw."]}, {"page": "Robert Graves (engraver)", "response": ["Among Graves's earliest works were some of the plates in James Caulfield's Portraits, Memoirs, and Characters of Remarkable Persons from the Revolution in 1688 to the end of the Reign of George II, London, 1819–20. These were followed by portraits and vignettes for J. F. Dove's English Classics and other works. His first exhibited work, a medallion portrait of Sir Mark Masterman Sykes, after Peter Rouw, appeared in 1824 in the first exhibition of the Society of British Artists, where other small plates by him appeared until 1830. He engraved some of the portraits of the deans of Westminster for John Preston Neale's History and Antiquities of the Abbey Church of St. Peter, Westminster, 1818–23, and the portraits for Gilbert Burnet's History of the Reformation, 1838 edition. "]}, {"page": "Thomas Parlby", "response": ["He rebuilt the old chapel at Stonehouse in 1787 and his 1802 monument, by Peter Rouw of London (who also made the monuments to Sir John Pole and his wife Lady Anne in Shute Church), was situated in the new church.Lysons, Magna Britannia, 1822, vol.6, Parishes: Slapton – South Sydenham,  pp. 451–468"]}, {"page": "Rouw, Peter", "response": ["#redirectPeter Rouw"]}]}}