{"wiki_id": "http://www.wikidata.org/entity/Q27978991", "itemLabel": "Jane Plant", "itemDescription": "British geochemist, scientist, author, engineer (1945-2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_Plant", "wikipedia_page": {"main": "Jane Anne Plant CBE, FREng, FRSE, FRSA was a leading geochemist, scientist, and author. Plant was a pioneer in the field of geochemical surveys and environmental surveys. She was Chief Scientist at the British Geological Survey and was a Professor of Geochemistry at Imperial College London.  Plant was also highly involved in the Institution of Mining & Metallurgy (now Institute of Materials, Minerals and Mining) where she was involved in many aspects including a role on the Council, and was the first female President of the Institution of Mining & Metallurgy, a post she held from 2001 to 2002.  This gave her an extensive network of key connections with government, industry and academia.\nPlant was diagnosed with cancer six times and studied the link between dairy and breast cancer. She published several books on the subject.Plant was appointed a CBE in 1997 in recognition of her contribution to Earth science and industry. She was a British Geological Survey scientist until her retirement from the role of Chief Scientist in 2005. Plant was Emeritus Professor of Geochemistry at Imperial College until her death on 4 March 2016.", "link_mentions": [{"page": "Ashby School", "response": ["* Jane Plant, geochemist, scientist, and author"]}, {"page": "Women in geology", "response": ["* 1995: Jane Plant became the first female Deputy Director of the British Geological Survey."]}, {"page": "Woodville, Derbyshire", "response": ["*Jane Plant (1943-2016), pioneer in the field of geochemical surveys and environmental surveys, was born in Woodville and lived there until she attended university. Her parents were the village shopkeepers. "]}, {"page": "Deaths in March 2016", "response": ["*Jane Plant, 71, British geochemist.Professor Jane Plant CBE 1945-2016"]}, {"page": "Timeline of women in science", "response": ["* 1995: Jane Plant became the first female Deputy Director of the British Geological Survey."]}, {"page": "Jane Anne Plant", "response": ["#REDIRECT Jane Plant"]}, {"page": "List of honorary graduates of the University of Exeter", "response": ["* Jane Plant CBE (DSc)"]}]}}