{"wiki_id": "http://www.wikidata.org/entity/Q2796723", "itemLabel": "Martin Turner", "itemDescription": "English rock musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Turner", "wikipedia_page": {"main": "Martin Robert Turner (born 1 October 1947) is an English musician best known for his time as the bass guitarist, lead vocalist and a founding member of the rock band, Wishbone Ash.", "link_mentions": [{"page": "October 1", "response": ["*  1947   – Martin Turner, English singer-songwriter and bass player "]}, {"page": "Torquay", "response": ["| Martin Turner, Wishbone Ash founder"]}, {"page": "Wishbone Ash", "response": ["Formed in Torquay, Devon, in 1969, out of the ashes of trio The Empty Vessels (originally known as The Torinoes, later briefly being renamed Tanglewood in 1969), which had been formed by Wishbone Ash's founding member Martin Turner (bass & vocals) in 1963 and complemented by Steve Upton (drums and percussion) in 1966. The original Wishbone Ash line-up was completed by guitarists/vocalists Andy Powell and Ted Turner. In 1974, Ted Turner left the band, and was replaced by Laurie Wisefield. The band continued on with strong critical and commercial success until 1980. There followed line-ups featuring former bass players from King Crimson (John Wetton), Uriah Heep (Trevor Bolder), and Trapeze (Mervyn Spence), Wisefield left in 1985. In 1987, however, the original line-up reunited for several albums – Nouveau Calls, Here to Hear and Strange Affair – until 1990, when Upton quit the band. After Martin Turner was replaced in 1991, the band recorded The Ash Live in Chicago, before Ted Turner left in 1993. This left Andy Powell as the sole remaining original founding member of Wishbone Ash to continue the band on into the future.", "Wishbone Ash were formed in October 1969 by bass guitarist Martin Turner and drummer Steve Upton. When Tanglewood's original guitarist, Martin's brother Glenn Turner left the trio and returned to his native Devon, their manager, Miles Copeland III advertised for a guitar player and also for a keyboard player. After an extensive search for a guitarist, the band could not decide between the final two candidates, Andy Powell and Ted Turner (no relation to Martin). It was suggested that they try both guitar players \"just to see what it sounds like\". Differing from the twin lead sound of Southern rock pioneer The Allman Brothers Band, Wishbone Ash included strong elements of progressive rock, and also of folk and classical music. After the band members wrote several suggested band names on two sheets of paper, Martin Turner picked one word from each list – 'Wishbone' and 'Ash'.", "1976's New England returned to the traditional Wishbone Ash style. Front Page News (1977) was the band's last album of this period that was recorded in the US. In 1978, after years of experimental albums, the band decided to return to its roots with No Smoke Without Fire, the first to be produced by Derek Lawrence since Argus in 1972. The album contained mainly songs written by Laurie Wisefield and Martin Turner. The band spent six months making the next album, Just Testing which was released in February 1980. Pressured by MCA to make more commercial music, Andy Powell, Laurie Wisefield and Steve Upton expressed to bassist/vocalist Martin Turner that they planned to recruit a lead singer / frontman, thus restricting Martin Turner's duties to bass guitar only. Turner felt unable to support such plans and described the position he was being put in as \"untenable\". Following a band meeting at his house, Martin Turner parted company with the band. Ironically, the band never recruited the proposed frontman and Turner, in his 2012 autobiography, described the situation as \"constructive dismissal\". However this was not a view held by the rest of the remaining band members or the then management.", "In 1987, I.R.S. Records founder and original Wishbone manager Miles Copeland III began a series of albums entitled No Speak, which featured all instrumental music. To launch the label successfully, Copeland needed a big name band that would bring publicity to the project. Copeland approached the four founding members of Wishbone Ash about having the original line-up record an all-instrumental album. For the first time in fourteen years, Andy Powell and Steve Upton joined forces with Martin Turner and Ted Turner to record the album Nouveau Calls, released in February 1988. The original line-up's tour of 1988 was a huge success, as the band played large venues for the first time since the late 1970s. In August 1989, the band released a reunion album with vocals entitled Here to Hear, featuring mainly songs written by Ted and Martin Turner.", "In 1990 the band went back into the studio to record the follow-up to Here to Hear. The band were shocked when founding member Upton, the band's drummer for their entire career, announced his retirement from the music industry. They enlisted drummer Robbie France, but replaced him with Ray Weston when it was determined that personal conflicts between France and Martin Turner could not be resolved. Strange Affair was released in May 1991, featuring mainly songs written by Andy Powell and Ted Turner.", "Later in 1991, the band decided to continue without founding member Martin Turner, with the bassist/vocalist being replaced by returnee Andy Pyle, who had been in the band years earlier. The band toured throughout 1992/93, releasing the live album The Ash Live in Chicago. 1994 saw the second and final departure of Ted Turner. Following Turner's departure, Pyle and Weston also left the band.", "At this stage Andy Powell was the only original member left in Wishbone Ash. Powell enlisted guitarist/songwriter Roger Filgate, bassist/vocalist Tony Kishman, and drummer Mike Sturgis. The new line-up debuted on a short UK/European tour in spring 1995. By the time of the band's 25th anniversary tour in late 1995, Tony Kishman was finding touring difficult due to other performing engagements in the United States. Founding member Martin Turner replaced him on bass and vocals for the duration of the tour, before Kishman returned to record lead vocals for the band's next album. Illuminations was released in 1996 and featured the Powell, Filgate, Kishman, Sturgis line-up. Powell relied on fan donations and outside assistance to help finance the album.", "On 25 November 2011 Wishbone Ash released their 23rd album, the well received Elegant Stealth, which is also the first album to be recorded by the same line up as the predecessor since 1989. In 2013 a court case relating to a trade mark infringement and the use of the name 'Martin Turner's Wishbone Ash' was decided. The court ruled in favour of Andy Powell with the comprehensive judgement forming a clear history of the band since its inception. On 19 February 2014 the 24th studio album Blue Horizon was released. The reviews for this album were generally very positive indeed. As of 2014 this line-up of the band, having been together since 2007, became the longest-lasting line-up of Wishbone Ash in the group's history. On 16 May 2015, Wishbone Ash recorded a live to vinyl album at Metropolis Studios.", "==Martin Turner - (Ex Wishbone Ash)==", "Martin Turner began touring in 2004 with \"Martin Turner's Wishbone Ash\", performing material by the classic line ups of the band. Occasionally Ted Turner and Laurie Wisefield have joined his group on stage as guests. He published his autobiography in 2012.", "In 2013 Andy Powell took legal action to protect the Wishbone Ash registered trademark and prevent Martin Turner from using his chosen group name. The court ruled in favour of Andy Powell and Martin Turner's application to appeal was refused. Since then he has toured and recorded with his band as \"Martin Turner - (Ex Wishbone Ash)\".", "* Martin Turner – bass, vocals, keyboards (1969–1980; 1987–1991; 1995–1996)"]}, {"page": "Jay's Grave", "response": ["Jay's Grave was the inspiration for John Galsworthy's short story The Apple Tree, written in 1916. In the 1970s, knowledge of the legend prompted Martin Turner of British rock band Wishbone Ash to write the lyrics to a song called \"Lady Jay\" which appears on the band's 1974 album There's the Rub. David Rudkin wrote an episode inspired by the tale entitled The Living Grave for the BBC 2 TV anthology series Leap in the Dark, broadcast in 1980. It also inspired Seth Lakeman to write his 2004 song and album, both called Kitty Jay.  Sir Arthur Conan Doyle visited the nearby house, Heatree, and he is said to have been inspired by the location of the house and its proximity to Jay's Grave, Bowerman's nose, Hound Tor and Grimspound to write The Hound of the Baskervilles."]}, {"page": "John Wetton", "response": [";With Martin Turner's Wishbone Ash"]}, {"page": "List of bass guitarists", "response": ["* Martin Turner (Wishbone Ash)"]}, {"page": "Andy Powell", "response": ["In 1969, Powell answered a Melody Maker classified in which Martin Turner and Steve Upton advertised for a guitar player.  Being unable to choose between Powell and another applicant (Ted Turner), Wishbone Ash was formed with two lead guitarists."]}, {"page": "Bill Szymczyk", "response": ["For the Elvin Bishop hit \"Fooled Around and Fell in Love,\" it was Szymczyk who suggested the inclusion of the song on Bishop's Struttin' My Stuff album, feeling the blues-oriented album lacked a pop single. The song would go on to become Bishop's biggest hit.  Such a pattern was repeated throughout his career. The Eagles brought him in to refine and improve their \"rock\" sound, and all of their biggest selling albums and songs were Szymczyk-produced. Martin Turner of Wishbone Ash has called him \"my all time favourite producer\". While the two did not always get along during recording, usually over Turner's bass-playing style, Turner does credit Szymczyk with giving the band a more commercial sound on one of their most successful albums, 1974's There's the Rub."]}, {"page": "Pete Overend Watts", "response": ["Watts's bass of choice was a white Gibson Thunderbird, one of which was later sold to Wishbone Ash bassist Martin Turner.  "]}, {"page": "Robbie France", "response": ["After E.B.H., in 1990 France joined Wishbone Ash, with whom he toured and commenced the recording of the album Strange Affair. However, friction occurred between France and Wishbone Ash bassist Martin Turner, resulting in France's dismissal from the band. He was replaced by Ray Weston, who was one of his students.  He then joined Anxious Records' band, Pleasure, touring as support act to the Eurythmics. By this time, however, France felt too drained to commit to any more touring or recording work."]}, {"page": "Wishbone Ash (album)", "response": ["*Martin Turner - bass, vocals"]}, {"page": "Pilgrimage (Wishbone Ash album)", "response": ["All songs composed by Martin Turner, Steve Upton, Ted Turner and Andy Powell, except where noted.", "*Martin Turner – bass, vocals"]}, {"page": "Argus (album)", "response": ["Although not intended as a concept album, the album is medieval-themed to a degree, particularly on the second side. The album features a blend of progressive rock, folk, and hard rock, and is considered a landmark album in the progression of twin-lead guitar harmonisation, later adopted by bands such as Thin Lizzy and Iron Maiden. The sound engineer on Argus was Martin Birch, who also worked with Deep Purple, later with Black Sabbath, Iron Maiden and other hard rock bands. The bulk of the lyrics were provided by bassist/lead vocalist Martin Turner, although all members are credited with the music and arrangements. The album was produced by Derek Lawrence.", "Argus was released on vinyl record in May 1972. It was later released on CD in 2002, featuring a remix (by Martin Turner) of the original album as well as the three live tracks from the EP Live from Memphis promotional EP, recorded in the studios of WMC-FM.", "In 2008, Martin Turner released a new studio recording of Argus entitled Argus Through the Looking Glass. Wishbone Ash released a live version of the album, Argus \"Then Again\" Live.", "Music by Wishbone Ash, lyrics by Martin Turner, except \"Time Was\" by Ted Turner and Martin Turner, and \"Leaf and Stream\" by Steve Upton.", "Lyrics by Martin Turner.", "* Martin Turner – bass guitar, vocals"]}, {"page": "Wishbone Four", "response": ["Lyrics by Martin Turner, except \"Rock 'n Roll Widow\" by Steve Upton.", "*Martin Turner – bass guitar, vocals"]}, {"page": "There's the Rub", "response": ["*Martin Turner – bass, lead vocals"]}, {"page": "Locked In (album)", "response": ["#\"She Was My Best Friend\" (Martin Turner) – 3:52", "*Martin Turner – bass, vocals"]}, {"page": "New England (Wishbone Ash album)", "response": ["All songs written and composed by Martin Turner/Andy Powell/Laurie Wisefield/Steve Upton, except \"Candlelight\" by Martin Turner/Andy Powell/Laurie Wisefield/Steve Upton/Ted Turner.", "*Martin Turner – bass, lead vocals"]}, {"page": "Front Page News", "response": ["All songs written and composed by Martin Turner/Andy Powell/Laurie Wisefield/Steve Upton except where noted.", "*Martin Turner – bass guitar, lead vocals except \"Goodbye Baby Hello Friend\""]}, {"page": "No Smoke Without Fire", "response": ["#\"Baby the Angels Are Here\" (Martin Turner) – 4:44", "*Martin Turner – bass guitar, vocals"]}, {"page": "Just Testing", "response": ["Just Testing is the tenth studio album by the British rock band Wishbone Ash, released on 18 January 1980 by MCA Records. Recorded primarily at Surrey Sound Studios in England, it was the last to feature the original lead vocalist and bass guitarist Martin Turner until the release of Nouveau Calls (1987). The track \"Helpless\" is only the second cover version released by the band on a studio album, the previous one being \"Vas Dis\" on Pilgrimage.", "*Martin Turner – lead vocals, bass guitar, acoustic guitar, back vocals; co-producer"]}, {"page": "Live Dates 2", "response": ["*Martin Turner -  bass, vocals"]}, {"page": "Number the Brave", "response": ["Number the Brave is the 11th studio album by rock band Wishbone Ash. It is the first album in the band's history recorded without founding bassist/vocalist Martin Turner. Turner was replaced (for this album only) by John Wetton, formerly of King Crimson and Uriah Heep. Also featured on Number the Brave was singer Claire Hamill as backing vocalist, who would join Wishbone Ash on the 1981 tour to promote the album.  Following \"Vas Dis\" on Pilgrimage and \"Helpless\" on Just Testing, the album featured only the third cover version released by the band on a studio album, Smokey Robinson's \"Get Ready\", previously a hit for The Temptations."]}, {"page": "Live from Memphis (album)", "response": ["* Martin Turner – bass guitar, vocals"]}, {"page": "Andy Pyle", "response": ["In 1991, Pyle joined Wishbone Ash following the second split of Martin Turner with the band. A two-year period of touring followed, as evidenced by the 1992 film The Ash Live in Chicago. In 1994, he met Mick Abrahams and Blodwyn Pig when he appeared on the I Wonder Who song on the album Lies."]}, {"page": "Martin Turner (actor)", "response": ["Martin Turner (born in Hong Kong, September 1950) is an English stage and television actor."]}, {"page": "Ted Turner (guitarist)", "response": ["Turner continued to tour and record with Wishbone Ash recording “Here to Hear” in 1989, “Strange Affair”in 1991, and “Live in Chicago” in 1992, until 1994 when he once again decided to depart. In that same year, he suffered – and witnessed – the loss of his son Kipp, who was killed by a drunk driver in Scottsdale, Arizona. He now has a daughter Sloane. He has also made guest appearances with Martin Turner's band. Martin Turner (no relation) was also a founding original member of Wishbone Ash, bassist/vocalist. This included a performance at the High Voltage Festival in London's Victoria Park in July 2010. Other festival appearances in Japan and Mexico. Also an appearance with Andy Powell’s band at Ashcon.", "* 'Martin Turner's Wishbone Ash' official site."]}, {"page": "Rickenbacker 4001", "response": ["* Martin Turner of Wishbone Ash"]}, {"page": "Dagenham Roundhouse", "response": ["Reunion VI in May 2015 starred Martin Turner, playing the music of Wishbone Ash."]}]}}