{"wiki_id": "http://www.wikidata.org/entity/Q27973713", "itemLabel": "Joanne Mitchell", "itemDescription": "English film, stage and TV actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Joanne_Mitchell", "wikipedia_page": {"main": "Joanne Mitchell (born 30 July 1971) is an English film, stage and TV actress. In 2011 she co-founded Mitchell Brunt Films with husband and Emmerdale colleague Dominic Brunt and has worked as producer/writer on several of the company's films.", "link_mentions": [{"page": "Aaron Livesy", "response": ["Robert helps Aaron track down his stepmother, Sandra (Joanne Mitchell) and his younger half-sister, Liv Flaherty (Isobel Steele). Aaron pleads for Sandra's help, but she is adamant that she knows nothing. When Sandra says she changed her surname to keep Liv safe, Aaron works out that she knows what happened. He tells Liv what kind of person their father is and returns home. A second person had come forward to say Gordon abused him. The police inform Aaron that, because of the second statement, they are pressing charges against Gordon. Aaron later spots Robert and Ryan Harred (George Sampson) together and learns Robert paid Ryan to give a false statement. Aaron asks Ryan to retract his statement and he agrees. Liv is convinced Aaron is lying about their dad abusing him. Chas convinces Sandra to give a statement to the police and Liv comes to stay with Aaron for a while. Gordon is found guilty and Liv moves into The Woolpack, after she refuses to move to Dublin with Sandra. Gordon is sentenced to 18 years in prison. Aaron changes his surname to Dingle. Gordon later takes his own life in prison. Aaron, Liv, Robert and Chas attend Gordon's funeral."]}, {"page": "Dominic Brunt", "response": ["Dominic Adam Brunt (born 15 April 1970) is an English actor, director and producer, known for portraying the role of Paddy Kirk in the ITV soap opera Emmerdale. For his role as Paddy, Brunt has been nominated in various categories at the British Soap Awards, Inside Soap Awards and the National Television Awards. As well as acting, Brunt also produces and directs horror films alongside Joanne Mitchell; he also co-hosts an annual zombie film festival with Emmerdale co-star Mark Charnock.", "Brunt was born on 15 April 1970 in Macclesfield, Cheshire. He was educated at Accrington Moorhead Sports College and the Bristol Old Vic Theatre School, where he met his wife Joanne Mitchell. Brunt and Mitchell have two children together; when their son Danny was eight months old, he underwent an operation after being diagnosed with a heart condition."]}, {"page": "List of former Emmerdale characters", "response": ["| Joanne Mitchell", "|DS Karen Barnborough || Joanne Mitchell || 2003"]}, {"page": "List of former Coronation Street characters", "response": ["|Marsha Westbrook || Joanne Mitchell || 2018"]}, {"page": "List of Emmerdale characters (2006)", "response": ["Sandra Flaherty (also Livesy) made her first screen appearance on 3 February 2006. She was initially played by Christine Brennan and then Janet Bamford in 2008. She is the ex-wife of Gordon Livesy (Gerard Fletcher) and mother of Liv Flaherty (Isobel Steele) and stepmother of Aaron Livesy (Danny Webb/Danny Miller). When the character was re-introduced in 2016, the part was recast to Joanne Mitchell."]}, {"page": "Bad Girls (series 3)", "response": ["* Joanne Mitchell as Jude Longley"]}, {"page": "2011 Aotearoa Film & Television Awards", "response": ["* Amanda Millar & Joanne Mitchell,  Sunday \"Innocent\" (TV One)"]}, {"page": "2010 Qantas Film and Television Awards", "response": ["* Janet McIntyre & Joanne Mitchell, Sunday, \"Discourse with a Dictator\" (TV One)"]}, {"page": "Waterloo Road (series 5)", "response": ["* Joanne Mitchell as Mrs. Turner; Cassie's mother (1 episode)"]}, {"page": "List of British films of 2014", "response": ["|| Director: Simeon Halligan   Cast: Pollyanna McIntosh, Lee Williams, Joanne Mitchell"]}, {"page": "White Settlers", "response": ["Married couple Ed (Lee Williams) and Sarah (Pollyanna McIntosh) have decided that they want to get away from their busy, stressful lives in London and move somewhere more peaceful. They believe that they've found the perfect place in a bucolic farmhouse in Scotland; however, their real estate agent Flo (Joanne Mitchell) informs them that the land is the site of a gruesome battle between the English and the Scottish. Despite this knowledge and Flo's chilly story, Ed and Sarah choose to purchase the farmhouse and restore the property. Initially all seems well, but on their first night they hear strange sounds in the nearby area and discover that they are not at all welcome in the area.  Later that night while Sarah is downstairs she witnesses the key coming out of the door, implying someone is entering.  Quickly, she hides under a table as three men wearing pig masks enter.  Sarah moves to a different room and attempts to climb out of the window, breaking a glass and cutting her hand.  She later escapes the house and enters the woods.  Sarah runs through the woods before finding a car in front of an old farmhouse that holds Ed hostage.  Sarah beats in his captor's face and when a second man comes in, she knocks him down, but as more come, she cuts her Achilles heel.  She and Ed escape the house. Ed tells her to hide while he distracts them so that she can make a run for the road.  Ed knocks one to the ground and escapes, but is later caught in a bear trap.  The captor Ed knocked down wanted to kill him, but another captor stops him, mentioning \"a plan\" they had for Ed and Sarah.", "* Joanne Mitchell as Flo"]}, {"page": "List of Emmerdale characters (2016)", "response": ["Liv Flaherty, played by Isobel Steele, made her first screen appearance on 25 February 2016. The character and casting was announced on 16 February. Liv is the daughter of Sandra Flaherty (Joanne Mitchell) and Gordon Livesy (Gary Mavers) and the half-sister of Aaron Dingle (Danny Miller). She was introduced as part of Aaron's child sex abuse storyline.", "| The detective who investigates the historic sex abuse allegations brought by Aaron Livesy (Danny Miller) against his father Gordon Livesy (Gary Mavers). Couple of weeks later, DS Wise lets Aaron's mother Chas Dingle (Lucy Pargeter) off with a warning after she vandalises Gordon's car and tells his neighbours that Gordon abuses children. A few days later, Robert Sugden (Ryan Hawley) gives DS Wise Gordon's ex-wife Sandra Flaherty's (Joanne Mitchell) address. Sandra denies knowing anything and refuses to be a witness for the defence or prosecution. DS Wise informs Aaron that another victim has come forward and that they now have enough evidence to charge Gordon. However, he later informs Chas and Robert that the witness has retracted his statement, but Gordon will still be charged. DS Wise attends Gordon's plea hearing, where Chas asks him why he did not say anything about Gordon faking the side effects of his cancer treatment. Gordon later tells DS Wise that the other witness was paid to give evidence against him and sends him after his daughter Liv Flaherty (Isobel Steele). Gordon is found guilty on all charges. Before Gordon's sentence hearing, DS Wise takes Liv home after she is caught shoplifting and he lets slip about the hearing. Days later, DS Wise breaks the news to Aaron and Liv that Gordon has died in prison. The following day, Liv texts DS Wise from Chas' phone asking him to come round quickly. When he arrives, Liv tells him Robert is responsible for Gordon's death, but DS Wise explains Gordon committed suicide. A few weeks later, DS Wise asks Chas out for a drink and she accepts. After their date, Chas invites him up to her room, but when DS Wise knocks over a box of old photos, she orders him to leave. He later return to arrest Robert. DS Wise questions Dawn Taylor (Olivia Bromley) when DI Mark Malone (Mark Womack) does not show up to work after she had filed a complaint about him."]}, {"page": "Liv Flaherty", "response": ["Liv first appears when Aaron hunts for evidence on Gordon Livesy (Gary Mavers), Liv and Aaron's father, since he sexually abused Aaron. Aaron and his boyfriend Robert Sugden (Ryan Hawley) arrive at Liv's house to confront her mother Sandra Flaherty (Joanne Mitchell), and while they are standing outside, Liv steals Aaron's wallet. Miller stated that his character's introduction to Liv \"isn't a great start\", but noted that viewers would be able to see an instant bond form between the pair. He described Liv as \"cheeky and a bit naughty\", and likened the character to his own at his age. Aaron does not tell Sandra about Liv stealing his wallet, as he \"instantly loves her\" and wants to protect her. Liv sees Aaron confronting Sandra and pinning her against a wall, which \"breaks her heart\". Sandra refuses to stand in court for Aaron, and although Liv does not initially believe Aaron, she soon realises that Gordon is lying. Sandra states that she will be moving to Dublin with Liv. It becomes \"increasingly clear\" that Liv wants to stay in Emmerdale, Aaron offers to become her full-time guardian. Sandra accepts and allows Liv to live with Aaron. Executive producer Iain MacLeod stated that Liv will challenge Aaron and Robert's relationship, accrediting this to Liv not getting on with Robert and wanting Aaron's attention."]}]}}