{"wiki_id": "http://www.wikidata.org/entity/Q27980202", "itemLabel": "John Chadwick", "itemDescription": "British judge", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Chadwick_(judge)", "wikipedia_page": {"main": "Sir John Murray Chadwick PC (born 20 January 1941) is a retired English Lord Justice of Appeal. He also served as the President of the Court of Appeal of the Cayman Islands, and as a judge of the Dubai International Financial Centre court.  Sir John was also standing Counsel to the DTI, and sat as a Judge of the Courts of Appeal of Jersey and Guernsey.  He also works as an arbitrator.", "link_mentions": [{"page": "List of current members of the British Privy Council", "response": ["| Sir John Chadwick"]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*Sir John Chadwick (b. 1941)"]}, {"page": "The Equitable Life Assurance Society", "response": ["In January 2009 the Government issued their response and appointed retired judge Sir John Chadwick as an independent advisor to design an ex-gratia scheme for some policyholders \"who have suffered a disproportionate impact as a result of the relevant maladministration\".", "In the Queen's Speech following the formation of a Conservative-LibDem coalition government in 2010, the Equitable Life (Payments) Bill was announced. The bill sought to secure compensation for nearly a million policyholders (UK-wide) hit by the near-collapse of the insurer. The Government also announced that the final report from Sir John Chadwick in relation to Equitable Life would be received by mid-July. A statement on the HM Treasury website confirmed two elements of the design of the scheme: that there should be no means testing, and that the dependents of deceased policyholders should be included in the scheme.", "*The Office of Sir John Chadwick"]}, {"page": "John Chadwick", "response": ["John Chadwick,  (21 May 1920 – 24 November 1998) was an English linguist and classical scholar who was most notable for the decipherment, with Michael Ventris, of Linear B.", "Chadwick volunteered for the Royal Navy in 1940 after completing the first year of his classics course at Cambridge. At first he served in the Mediterranean as an ordinary seaman aboard the light cruiser HMS Coventry and saw action when his ship was torpedoed by an Italian submarine and dive-bombed. In 1942 he was sent ashore at Alexandria for an interview by the Chief of Naval Intelligence and was immediately assigned to intelligence duties in Egypt and promoted to Temporary Sub Lieutenant in the RNVR. Thereafter he worked on Italian codes.\"John Chadwick, 1920–1998\", The Guardian, 1998-12-03, page 22.Peter Kornicki, Eavesdropping on the Emperor: Interrogators and Codebreakers in Britain's War with Japan (London: Hurst & Co., 2021), pp. 87-88.\"Life of John Chadwick : 1920 – 1998 : Classical Philologist, Lexicographer and Co-decipherer of Linear B\" , Faculty of Classics, Cambridge University Chadwick deduced from some R/T traffic meant to be handled at Bletchley Park that a British submarine had been sunk near Taranto.John Chadwick A Biographical Fragment; 1942-5 in Action this Day edited by Michael Smith and Ralph Erskine (2001, Bantam Press, London) pp 110–126. ."]}, {"page": "Clergy Support Trust", "response": ["* 2004 to 2016: Sir John Chadwick, Lord Justice of Appeal from 1997 to 2007"]}, {"page": "List of members of the judiciary of Jersey", "response": ["* Rt Hon Sir John Chadwick (1986–93), subsequently a judge of the High Court and Court of Appeal in England and Wales"]}, {"page": "Chadwick (surname)", "response": ["*John Chadwick (1920–1998), English linguist and classical scholar, co-decipherer of the Linear B script", "*Sir John Chadwick (judge) (born 1941), British judge"]}, {"page": "Chadwick LJ", "response": ["#REDIRECT John Chadwick (judge)"]}, {"page": "List of college visitors of the University of Oxford", "response": ["|Sir John Chadwick"]}, {"page": "Sir John Chadwick", "response": ["#REDIRECTJohn Chadwick (judge)"]}]}}