{"wiki_id": "http://www.wikidata.org/entity/Q27956846", "itemLabel": "George Morison Robertson", "itemDescription": "American judge", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Morison_Robertson", "wikipedia_page": {"main": "George Morison Robertson (February 26, 1821 – March 12, 1867) was an early politician and judge in the Kingdom of Hawaii. Born in Scotland, he settled in Hawaii in 1844 during the whaling era. During his career in Hawaii, he served in many political and judicial posts including circuit judge and police court judge, member of the Board of Commissioners to Quiet Land Titles, a multiple-term representative in the Hawaiian legislature, Speaker of the House of Representatives, Associate Justice of the Supreme Court of Hawaii and Minister of the Interior.", "link_mentions": [{"page": "Royal Order of Kamehameha I", "response": ["* George Morison Robertson"]}, {"page": "George Robertson", "response": ["*George Morison Robertson (1821–1867), Hawaiian politician"]}, {"page": "Legislature of the Hawaiian Kingdom", "response": ["* George Morison Robertson (1852–1853)", "* George Morison Robertson (1855–1856)", "* George Morison Robertson (1858–1859)"]}, {"page": "Robertson (surname)", "response": ["*Alexander George Morison Robertson (1867–1947), Chief Justice of the Supreme Court of Hawaii", "*George Morison Robertson (1821–1867), Hawaiian politician"]}, {"page": "Ministry of the Interior (Hawaii)", "response": ["| George Morison Robertson"]}, {"page": "Robert Grimes Davis", "response": ["In 1852, he began studying law and shortly after became a well read lawyer. He also was appointed to succeed John Papa ʻĪʻī as the Second Associate Justice of the Supreme Court of Hawaii from February 16, 1864 until his resignation on July 8, 1868. Serving alongside Chief Justice Elisha Hunt Allen and First Associate Justice George Morison Robertson, the effectiveness of the three men's terms in office were considered highly by their contemporaries. In 1873, a writer in the Hawaiian newspaper The Advertiser stated:"]}, {"page": "Alexander George Morison Robertson", "response": ["Alexander George Morison Robertson (September 3, 1867 – August 21, 1947) was Chief Justice of the Supreme Court of Hawaii from March 9, 1911 to January 1, 1918.", "Robertson was the son of George Morison Robertson, \"a distinguished associate justice of the Hawaii Supreme Court\", and Robertson \"maintained family tradition as an outstanding jurist\". On February 9, 1888, Robertson became a second lieutenant in the Honolulu Rifles division, later becoming a captain of the Hawaiian Volunteers, First Battalion."]}, {"page": "George Morrison Robertson", "response": ["#REDIRECT George Morison Robertson"]}, {"page": "George M. Robertson", "response": ["#REDIRECT George Morison Robertson"]}, {"page": "Justice Robertson", "response": ["*Alexander George Morison Robertson, Associate Justice of the Supreme Court of Hawaii", "*George Morison Robertson, Associate Justice of the Supreme Court of Hawaii"]}]}}