{"wiki_id": "http://www.wikidata.org/entity/Q27983493", "itemLabel": "Steve Schneider", "itemDescription": "researcher", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Schneider_(computer_scientist)", "wikipedia_page": {"main": "Prof. Steve Schneider FBCS, CITP is an English computer scientist and Professor of Security. He is Director of the Surrey Centre for Cyber Security and Associate Dean (Research and Enterprise) at the University of Surrey.", "link_mentions": [{"page": "List of computer scientists", "response": ["* Steve Schneider – formal methods, security"]}, {"page": "BCS-FACS", "response": ["From 2002–2008 and since 2013 again, the Chair of BCS-FACS has been Jonathan Bowen. Jawed Siddiqi was Chair during 2008–2013. In December 2002, BCS-FACS organized a conference on the Formal Aspects of Security (FASec'02) at Royal Holloway, University of London.Ali E. Abdallah, Peter Ryan and Steve Schneider (editors), Formal Aspects of Security. Springer, Lecture Notes in Computer Science, Volume 2629, 2003. . In 2004, FACS organized a major event at London South Bank University to celebrate its own 25th anniversary and also 25 Years of CSP (CSP25), attended by the originator of CSP, Sir Tony Hoare, and others in the field.Ali E. Abdallah, Cliff B. Jones and Jeff W. Sanders (editors), Communicating Sequential Processes: The First 25 Years. Springer, Lecture Notes in Computer Science, Volume 3525, 2005. .", "In recent years, a series of evening seminars have been held, mainly at the BCS London office. Speakers have included leading computer scientists, mainly from the United Kingdom but some from abroad, including Samson Abramsky FRS, Jean-Raymond Abrial (France/Switzerland), Farhad Arbab, Troy Astarte, Dines Bjørner (Denmark), Robin Bloomfield, Richard Bornat (twice), Egon Börger (Italy), Jonathan Bowen, Jan Broenink (Netherlands), Michael Butler, Muffy Calder OBE (twice), Jack Copeland (New Zealand), Tim Denvir, Cedric Fournet (France), Mike Gordon FRS, Anthony Hall, Mark Harman, Martin Henson, Rob Hierons, Jane Hillston, Mike Hinchey, Sir Tony Hoare FRS, Mike Holcombe, Michael Jackson, Cliff Jones, Marta Kwiatkowska (twice), Zhiming Liu, Tom Maibaum, Ursula Martin CBE, Peter Mosses, Ben Moszkowski, Peter O'Hearn FRS, Steve Reeves (New Zealand), John Reynolds (USA), Peter Ryan, Steve Schneider, Joe Stoy, David Turner, John Tucker, Phil Wadler, among others."]}, {"page": "Schneider (surname)", "response": ["*Steve Schneider (computer scientist), British computer scientist"]}, {"page": "Steve A. Schneider", "response": ["#REDIRECT Steve Schneider (computer scientist)"]}, {"page": "Stephen Schneider (disambiguation)", "response": ["Stephen Schneider  or Steve Schneider may also refer to:", "* Steve Schneider (American football), American college football coach and athletic director", "* Steve Schneider (computer scientist), English computer scientist"]}]}}