{"wiki_id": "http://www.wikidata.org/entity/Q27998980", "itemLabel": "Gavin Whyte", "itemDescription": "Northern Irish association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Gavin_Whyte", "wikipedia_page": {"main": "Gavin Whyte (born 31 January 1996) is a Northern Irish professional footballer who plays as a midfielder for Oxford United on loan from Cardiff City and the Northern Ireland national team.", "link_mentions": [{"page": "Crusaders F.C.", "response": ["However, the Hatchetmen bounced back in the 2017–18 season, regaining the Gibson Cup in a title race that went to the final day of the season. In the end, it was a 2–1 victory at the Ballymena Showgrounds on 28 April 2018 that brought the league title back to Seaview for the 3rd time in 4 years, thanks to goals from Philip Lowry and David Cushley, after Cathair Friel opened the scoring for Ballymena United and threatened to send the title to eventual runners-up Coleraine. Crusaders also won the County Antrim Shield at the Ballymena Showgrounds after a 4-2 victory over Ballymena United on 23 January 2018. Crusaders finished the season having scored an incredible 106 league goals, with over half of this tally coming from the attacking trio of Paul Heatley, Gavin Whyte and Jordan Owens."]}, {"page": "Ulster Footballer of the Year", "response": ["|  2017–18 || ||align=left| Gavin Whyte || align=left| Crusaders||"]}, {"page": "Will Vaulks", "response": ["On 27 June 2019, Vaulks signed for Cardiff City for an undisclosed fee on a three-year deal, in a record sale for Rotherham. He made his debut on 10 August in a 2–1 victory over Luton Town as a second-half substitute in place of Gavin Whyte, and scored his first goal on New Year's Day at the end of a 6–1 loss at Queens Park Rangers."]}, {"page": "Daniel Crowley (footballer)", "response": ["Crowley joined League One club Hull City on 18 January 2021, on loan for the remainder of the 2020–21 season. He made his debut the next day as a substitute for  Gavin Whyte in the 3–0 home win against Accrington Stanley, and went on make 23 appearances, mainly from the bench, as Hull City won the 2020–21 League One title."]}, {"page": "2016–17 NIFL Premiership", "response": ["|align=\"left\"| Gavin Whyte"]}, {"page": "2017–18 NIFL Premiership", "response": ["|align=\"left\"| Gavin Whyte"]}, {"page": "2017–18 Scottish Challenge Cup", "response": ["| Gavin Whyte"]}, {"page": "2018–19 EFL League One", "response": ["| Gavin Whyte"]}, {"page": "2018–19 Oxford United F.C. season", "response": ["| 13 July 2018 || RW ||  || Gavin Whyte ||  Crusaders || Undisclosed || ", "||MF || ||16 ||Gavin Whyte                                                    || 7 || 0 || 2 || 0 || 9", "|16 || ||MF ||Gavin Whyte                                     || 3 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 3 || 0"]}]}}