{"wiki_id": "http://www.wikidata.org/entity/Q27942399", "itemLabel": "Sarah Olney", "itemDescription": "British politician (born 1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Olney", "wikipedia_page": {"main": "Sarah Jane Olney (née McGibbon; born 11 January 1977) is a British Liberal Democrat politician and former accountant who has served as Member of Parliament (MP) for Richmond Park since 2019, and previously from 2016 to 2017. Olney has served as the Liberal Democrat Spokesperson for Transport and for Business and Industrial Strategy since January 2020. She has also served as the Liberal Democrat Spokesperson for Energy and Climate Change under Sir Ed Davey since September 2020.\nShe was the constituency's MP for six months, from a by-election in December 2016 to the general election in June 2017, and then two years later, she regained the seat at the 2019 general election, facing off against Zac Goldsmith of the Conservative Party in all three elections.  She was the Liberal Democrat Spokesperson for International Trade from January 2020 to September 2020, and was Spokesperson for Education from May 2017 to June 2017. Whilst out of Parliament, she was a financial accountant for Historic Royal Palaces, from 2018 to 2019.", "link_mentions": [{"page": "Kingston upon Thames", "response": ["Kingston straddles two Parliamentary constituencies: the area north of the railway line is part of Richmond Park, which is represented by Sarah Olney of the Liberal Democrats, and the area south of the railway line (including the ancient town centre) is part of Kingston and Surbiton which is represented by Ed Davey of the Liberal Democrats."]}, {"page": "Olney", "response": ["* Sarah Olney (born 1977), British Liberal Democrat politician and an accountant"]}, {"page": "Royal Borough of Kingston upon Thames", "response": ["In 1997 the Liberal Democrats won both seats. Dr Jenny Tonge took Richmond Park constituency and in 2005 Susan Kramer became its Liberal Democrat MP with a majority of 3,731 but she was beaten in the May 2010 election by Conservative Zac Goldsmith with a majority of 4,091. Goldsmith retained his seat at the 2015 general election, with a greatly increased majority of 23,015. Goldsmith stood as an Independent candidate in the by-election held on 1 December 2016, but was defeated by Sarah Olney, a Liberal Democrat, after the Conservative Party decided not to put forward its own candidate. Goldsmith regained the seat for the Conservatives in the 2017 general election with a significantly reduced majority of 45 votes. Sarah Olney then regained the seat during the 2019 General Election."]}, {"page": "Kew", "response": ["Kew forms part of the Richmond Park UK Parliament constituency; the Member of Parliament is Sarah Olney. For elections to the London Assembly it is part of the South West London Assembly constituency, which is represented by Nicholas Rogers."]}, {"page": "Mortlake", "response": ["During the 2016 United Kingdom European Union membership referendum, Richmond Park voted 69.3% for Remain, with a turnout of 82%. Zac Goldsmith's pro-Brexit position was hypothesised to have damaged his support in the constituency. The seat was won in the 2019 general election by Sarah Olney for the Liberal Democrats with a majority of 7,766."]}, {"page": "London Borough of Richmond upon Thames", "response": ["| Sarah Olney"]}, {"page": "King's College London", "response": ["Notable King's alumni to have held senior positions in British politics include two Speakers of the House of Commons (Lord Maybray-King and Lord Ullswater) and the former Cabinet ministers Lord Watkinson, Lord Passfield and Lord Wilmot. As of the current Parliament there are 20 King's graduates in the House of Commons, namely Alex Burghart, Nic Dakin,‘DAKIN, Nicholas’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Mark Francois,‘FRANCOIS, Rt Hon. Mark (Gino)’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 John Glen, Dan Jarvis, Phillip Lee,‘LEE, Phillip James’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Brandon Lewis,‘LEWIS, Brandon’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Sarah Newton,‘NEWTON, Sarah’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Matthew Offord, Sarah Olney, Dan Poulter,‘POULTER, Dr Daniel Leonard James’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Lucy Powell,‘POWELL, Lucy Maria’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Bob Seely, Tulip Siddiq,‘SIDDIQ, Tulip, (Mrs C. W. St J. Percy)’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Keith Simpson, Sir Gary Streeter,‘STREETER, Gary Nicholas’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Gareth Thomas,‘THOMAS, Gareth Richard’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Michael Tomlinson, David Warburton,‘WARBURTON, David John’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 and Sarah Wollaston.‘WOLLASTON, Sarah’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 As of the current Parliament there are 17 King's graduates in the House of Lords including Lord Carlile, Lord Clinton-Davis, Lord Dunlop,‘DUNLOP’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Lord Kakkar,‘KAKKAR’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Lord MacGregor, Baroness Morgan, Baroness O'Loan,‘O’LOAN’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Lord Owen, Lord Plant,‘PLANT OF HIGHFIELD’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Lord Rowlands,‘ROWLANDS’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Baroness Watkins, and the Lords Spiritual Tim Dakin,‘WINCHESTER, Bishop of’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Nick Holtam,‘SALISBURY, Bishop of’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 and Tim Thornton.TRURO, Bishop of’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016"]}, {"page": "Bob Geldof", "response": ["Geldof was a vocal supporter of the unsuccessful campaign for the UK to vote \"Remain\" in the 2016 referendum on the UK's membership of the European Union. Shortly before the vote, in what was described as the \"most surreal day in British politics ever\", Geldof led a flotilla on the River Thames to attack an opposition flotilla led by Eurosceptic politician Nigel Farage. Later that year, Geldof campaigned for the Liberal Democrat candidate Sarah Olney at the Richmond Park by-election. He described Brexit as \"the greatest act of national self-harm\" in British history and vowed to \"undermine\" Theresa May every step of the way. He said the EU was \"a mess\" but warned Britain's young people had their futures \"taken from them\" as a result of the referendum."]}, {"page": "Richmond, London", "response": ["Richmond town forms part of the Richmond Park constituency for the UK Parliament. The Member of Parliament, since 2019, is Sarah Olney from the Liberal Democrats. Richmond is also part of the South West constituency for the London Assembly, which has been represented by Nicholas Rogers from the Conservative Party since 2021."]}, {"page": "East Sheen", "response": ["East Sheen is in the Richmond Park constituency. The Member of Parliament is Sarah Olney of the Liberal Democrats."]}, {"page": "Hammersmith Bridge", "response": ["In July 2021, Stephen Cowan, leader of the Hammersmith and Fulham London Borough Council announced that the bridge would partially re-open to pedestrians and cyclists until 2027, but Sarah Olney said there is still a lot of work to be done to the bridge."]}, {"page": "Richmond Park (UK Parliament constituency)", "response": ["Richmond Park is a parliamentary constituency in the House of Commons of the United Kingdom. Sarah Olney of the Liberal Democrats won the seat at a by-election in 2016 after Zac Goldsmith of the Conservative Party stood down in protest over expansion of Heathrow Airport. Goldsmith stood as an independent at the by-election, but the Conservative nomination was restored to him for the 2017 general election, at which he regained the seat with a slim majority. Olney won the seat from Goldsmith a second time at the 2019 general election.", "In October 2016, Goldsmith announced his resignation as an MP in protest against the Conservative government's decision to allow a third runway to be built at Heathrow Airport. Goldsmith stood as an independent in the by-election held on 1 December; he was defeated by Sarah Olney, a Liberal Democrat, despite the Conservatives fielding no candidate. It was the first by-election in the constituency since its creation in 1997.", "| Sarah Olney", "| Sarah Olney"]}, {"page": "List of Parliamentary constituencies in London", "response": ["|Sarah Olney¤"]}, {"page": "Public Accounts Committee (United Kingdom)", "response": ["|Sarah Olney MP"]}, {"page": "List of United Kingdom MPs: O", "response": ["*Sarah Olney (2016–2017) ON"]}, {"page": "Zac Goldsmith", "response": ["At the 2015 general election, Goldsmith was returned to the Commons with a majority of 23,015, an increase of almost 19,000 votes since 2010, against his nearest opponent. He was chosen as the Conservative candidate for the 2016 election for mayor of London, which he subsequently lost to Sadiq Khan of the Labour Party. Goldsmith announced his resignation as an MP following the government's decision in October 2016 to approve construction of a third runway at Heathrow Airport. His resignation triggered a by-election in the Richmond Park constituency in which Goldsmith stood as an independent candidate. He was defeated by Sarah Olney of the Liberal Democrats with a majority of 1,872 votes. After Theresa May called the 2017 general election, Goldsmith was reselected as the Conservative Party candidate for Richmond Park and won with a narrow majority of 45 votes.", "Goldsmith was made Parliamentary Under-Secretary of State for Environment and International Development on 27 July 2019 and was promoted to Minister of State with the right to attend Cabinet on 10 September 2019. He was defeated at the 2019 general election, again by Sarah Olney, with a majority of 7,766 votes. After the election, Boris Johnson awarded Goldsmith with a life peerage, making him a member of the House of Lords and allowing him to retain his ministerial position. On 13 February 2020, he acquired the additional role of Minister of State for Foreign Affairs with responsibility for the Pacific.", "Goldsmith had promised, as far back as a June 2012 edition of the BBC's Sunday Politics programme, he would not stand as a Conservative candidate at the next election if the Conservative Party backed the expansion of Heathrow Airport, an issue to which he was strongly opposed.10 June 2012 BBC News – Zac Goldsmith 'would quit as MP over Heathrow runway'  In December 2016, he lost a by-election in Richmond Park he had initiated by the act of resigning his seat. He stood as an independent instead of as a Conservative but was endorsed by UKIP who did not stand a candidate. He lost to Sarah Olney of the Liberal Democrats, who overturned his majority of 23,000.", "Liberal Democrat Sarah Olney defeated Goldsmith by 7,766 votes in the 12 December 2019 snap general election (despite the election providing the Conservative Party's largest share of votes since 1979) and won back the Richmond Park seat. Shortly after his electoral defeat, it was announced he would continue to serve as a minister in the government by being awarded a life peerage and sitting as a member of the House of Lords."]}, {"page": "List of Liberal Democrat MPs", "response": ["* Sarah Olney, Richmond Park, 2016–2017; 2019–present"]}, {"page": "All Hallows Catholic School", "response": ["* Sarah Olney, MP for Richmond Park 2016-2017 and 2019 to date "]}, {"page": "Christian Wolmar", "response": ["Wolmar came third in the by-election, polling 1,515 votes, with 4% of the total vote, losing his deposit as the Liberal Democrat candidate Sarah Olney persuaded Labour voters to support her campaign to keep out the incumbent MP Zac Goldsmith."]}, {"page": "United Kingdom by-election records", "response": ["|Sarah Olney", "*2016 Richmond Park by-election: Zac Goldsmith resigned to force a by-election on the issue of the expansion of Heathrow Airport, and contested as an Independent. He was defeated by Sarah Olney of the Liberal Democrats. Goldsmith later regained his seat the following year at the 2017 general election."]}, {"page": "United Kingdom general election records", "response": ["* 2019: Caroline Ansell, James Davies, Flick Drummond, Margaret Ferrier, Richard Fuller, Jason McCartney, Karl McCartney, Anne McLaughlin, John Nicolson, Sarah Olney, Kirsten Oswald, Amanda Solloway, Owen Thompson, Edward Timpson, Craig Williams"]}, {"page": "List of alumni of King's College London", "response": ["*Sarah Olney – Liberal Democrat MP"]}, {"page": "Liberal Democrats (UK)", "response": ["|Sarah Olney || Richmond Park "]}, {"page": "English Liberal Democrats", "response": ["* Sarah Olney - Richmond Park"]}, {"page": "UK Parliamentary by-elections", "response": ["|The incumbent Conservative MP, Zac Goldsmith, resigned his seat, and the Conservative whip, in protest at the government's proposal to build a third runway at Heathrow airport. This was less than six months after the referendum on the UK's membership of the European Union, in which Goldsmith had campaigned for a Leave vote, despite his constituents voting heavily in favour of Remain. In the election, his opponents were able to nullify the Heathrow issue and focus voters' attention on the government's handling of Brexit. Despite both the Conservatives and UKIP choosing not to nominate candidates and instead backing Goldsmith, the Liberal Democrat candidate Sarah Olney won the seat with a 21.7% swing. Goldsmith later won the seat back in the 2017 general election by a narrow margin, a majority of 45, before losing it to Olney once again in the 2019 election by 7,766 votes."]}, {"page": "2016 London mayoral election", "response": ["Khan formally resigned from his position as MP for Tooting on 9 May, triggering a by-election, which was held on 16 June. On 16 June, Rosena Allin-Khan won the by-election in Tooting, with an increased majority. A few months after the election, Goldsmith also pledged to resign as an MP if the government were to announce plans to build a third runway at Heathrow Airport. Following the decision to build the runway, Goldsmith stood-down as MP for Richmond Park, triggering a by-election, in which Goldsmith stood as an independent candidate. On 1 December 2016, Goldsmith saw his 23,000 majority overturned in the by-election by Sarah Olney of the Liberal Democrats, who achieved a 30% swing. Goldsmith's loss put down to his stance in favour of Britain's exit from the European Union where his constituency voted to remain."]}, {"page": "Grosvenor Light Opera Company", "response": ["Notable alumni include Sarah Olney former MP for Richmond Park."]}, {"page": "List of MPs elected in the 2015 United Kingdom general election", "response": ["|7||Richmond Park||Zac Goldsmith||||25 October 2016||Resignation||1 December 2016||Sarah Olney||||Details"]}, {"page": "List of United Kingdom MPs by seniority (2015–2017)", "response": ["|...||Sarah Olney||style=\"background-color: \"|LD||Richmond Park|| 1 December 2016 ||00/00/1977"]}, {"page": "Frontbench Team of Tim Farron", "response": ["|Sarah Olney "]}, {"page": "London Liberal Democrats", "response": ["* Sarah Olney  Richmond Park and North Kingston"]}, {"page": "List of United Kingdom by-elections (2010–present)", "response": ["|Sarah Olney"]}]}}