{"wiki_id": "http://www.wikidata.org/entity/Q27919443", "itemLabel": "Jill Morris", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/Jill_Morris", "wikipedia_page": {"main": "Jill Morris  (born 14 August 1967) is a British diplomat who is currently the British Ambassador to Italy and non-resident British Ambassador to San Marino, succeeding Christopher Prentice. She is the first female to hold this post.", "link_mentions": [{"page": "Jill", "response": ["*Jill Morris (born 1967), British diplomat"]}, {"page": "List of people from Chester", "response": ["*Jill Morris, diplomat"]}, {"page": "List of ambassadors of the United Kingdom to Italy", "response": ["* 2016–: Jill Morris"]}, {"page": "Italy–United Kingdom relations", "response": ["The Italian ambassador to the United Kingdom is Raffaele Trombetta since January 2018; the British ambassador to Italy is Jill Morris since July 2016."]}, {"page": "Morris (surname)", "response": ["* Jill Morris, British Ambassador to Italy (from 2016)"]}, {"page": "Stuff You Should Know", "response": ["During the 4th of July weekend in 2011, there was a Stuff You Should Know About America marathon on Sirius XM radio. It featured previous episodes, as well as a live segment with Wyatt Cenac and Hallie Haglund of The Daily Show as well as Joe Randazzo, Joe Garden and Jill Morris of The Onion. Their 420th episode was on medical marijuana, although this was reportedly a coincidence."]}, {"page": "Edward Llewellyn, Baron Llewellyn of Steep", "response": ["On 18 January 2022, it was announced that in February he would succeed Jill Morris as Ambassador to Italy.", "On 18 January 2022 it was announced that Llewelyn would succeed Jill Morris as Her Majesty’s Ambassador to the Italian Republic and Non-Resident Ambassador to San Marino."]}, {"page": "Embassy of the United Kingdom, Rome", "response": ["The Embassy of the United Kingdom in Rome is the chief diplomatic mission of the United Kingdom in Italy, San Marino and the Holy See. It is located on Via XX Settembre in Municipio I. The current British Ambassador to Italy is Jill Morris.  The British Embassy to the Holy See is located in a separate building within the same compound. The current British Ambassador to the Holy See is Chris Trott."]}, {"page": "2015 Birthday Honours", "response": ["*Jill Morris – Director Europe, Foreign and Commonwealth Office. For services to British foreign policy."]}]}}