{"wiki_id": "http://www.wikidata.org/entity/Q27917116", "itemLabel": "John Service", "itemDescription": "British swimmer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Service_(swimmer)", "wikipedia_page": {"main": "John Service (4 December 1930 – 1996) was a British swimmer. He competed in the men's 200 metre breaststroke at the 1948 Summer Olympics.", "link_mentions": [{"page": "1954 British Empire and Commonwealth Games", "response": ["|Jack WardropJohn ServiceRobert Wardrop ||3:27.3"]}, {"page": "John S. Service", "response": ["John Service was born on August 3, 1909, in the city of Chengdu in the Sichuan province of China, the son of Grace Josephine (Boggs) and Robert Roy Service, missionaries working for the Y.M.C.A. Service spent his childhood in the Chinese province.Biography of Service by Oberlin College via John Service Papers.   By the age of eleven, Service had mastered the local Chinese dialect, and then attended the Shanghai American School for high school.  The Service family moved to California, where John graduated from Berkeley High School in Berkeley, California at the age of fifteen.  Those who knew him say he always went by \"Jack\" and he never used his middle name.", "Because the invasion of Japan was planned to launch from China, there was great interest in enlisting support from all Chinese factions. The U.S. Army Observation Group, also known as the Dixie Mission, was formed to travel the headquarters of the Communist Party of China in Yan'an and establish contact with the Communists as a power in North China. Davies selected John Service represent the State Department, the  first to visit the Communist headquarters.", "John Service returned to Washington in 1945, and was soon arrested as a suspect in the Amerasia Case.  He was accused of passing confidential U.S. materials from his time in China to the editors of the Amerasia magazine. However, a grand jury declined to indict Service, finding that the materials were not sensitive and were of a kind commonly released to journalists. Five years later, he was dismissed from the State Department after Joseph McCarthy accused him of being a Communist. The former Foreign Service officer challenged the dismissal in court. Ultimately, the U.S. Supreme Court ruled in his favor, and he was reinstated at the State Department.  In between his initial legal success in the Amerasia matter in 1945 and his dismissal in 1950, Service had three overseas assignments.  He was briefly posted to Douglas MacArthur's staff in Tokyo.  He served in New Zealand from October 1946 through early 1949. Finally, he was assigned to India, but he never made it to the post with his family.  In March 1950, he was ordered from his ship docked in Yokohama to return to Washington, where he would answer charges leveled against him.", "The two main themes of Service's reporting were that (1) the nationalists were incompetent and likely to lose in a power struggle with the CPC, and that (2) the CPC seemed to be worthy successors with whom the U.S. should try to establish relations. Prior to the outbreak of the Chinese Civil War in 1946, Service had predicted that the CPC would prevail, thanks to their ability to stamp out corruption, gain popular support, and to organize grass root organizations.John Service, Report No. 1, 7/28/1944., to Commanding General Fwd. Ech., USAF – CBI, APO 879. \"First Formal Impressions of Northern Shensi Communist Base\". State Department, NARA, RG 59. Page One, Two, Three, and Four. The scenarios that Service envisioned in his reports from Dixie Mission about CPC's future management of China were rose–colored, or incomplete. Mao's implementation of his economic plans was harsh, and undemocratic. Service hoped that the CPC would adopt free market and democratic reforms if they were pushed in the right direction, with U.S. support.  Later, Service wrote that he believed an American relationship with the CPC might have prevented the Korean War and Vietnam War, or lessened their gravity.", "In 2013, the story of the Dixie Mission served as the historical basis for a new World War II novel called Two Sons of China, by Andrew Lam (author). John Service is portrayed as a prominent historical figure in the book. It was released by Bondfire Books in December 2013.Lam, Andrew. Two Sons of China (978-1629213736) Colorado Springs, CO; Bondfire Books, 2014.", "* An obituary for John Service", "* Oberlin College biography of John Service and spouse.", "* Interview of John Service by CNN."]}, {"page": "Great Britain at the 1948 Summer Olympics", "response": ["|align=left|John Service"]}, {"page": "Swimming at the 1948 Summer Olympics – Men's 200 metre breaststroke", "response": ["| 25 ||  John Service ||align=left|  ||3:00.4 || "]}, {"page": "List of Commonwealth Games medallists in swimming (men)", "response": ["|valign=top|Jack WardropJohn ServiceBert Wardrop"]}]}}