{"wiki_id": "http://www.wikidata.org/entity/Q28018080", "itemLabel": "Willie Ross", "itemDescription": "Scottish bagpipe player", "wikipedia_url": "https://en.wikipedia.org/wiki/Willie_Ross_(piper)", "wikipedia_page": {"main": "Pipe Major William Collie Ross  (1878 - 1966) was a Scottish bagpipe player.", "link_mentions": [{"page": "Army School of Bagpipe Music and Highland Drumming", "response": ["* P/M Willie Ross (Scots Guards), 1919–1957"]}, {"page": "Willie Ross", "response": ["Willie Ross may refer to:", "* Willie Ross, Baron Ross of Marnock (1911–1988), Scottish Labour Party politician, Secretary of State for Scotland 1964–1970 1974–1976", "* Willie Ross (footballer, born 1919) (1919–1990), Scottish football player", "* Willie Ross (football manager) (died 1985), Scottish football player and manager (Derry City)", "* Willie Ross (piper) (1878–1966), Scottish bagpipe player", "* Willie Ross (American football) (born 1941), American football player"]}, {"page": "Donald MacLeod (piper)", "response": ["Donald MacLeod (\"Wee Donald\") was born in Stornoway on the Isle of Lewis on 14 August 1916. Macleod was mentored and tutored by John Morrison, who took him to his first Northern Meeting. He was also tutored by Willie Ross, and every week for 27 years by John MacDonald of Inverness."]}, {"page": "John D. Burgess", "response": ["The family moved to Edinburgh when the elder John took up a lecturing position at the Veterinary School. John D. was educated Edinburgh Academy, and tutored by Pipe major Willie Ross of the Army School of Bagpipe Music and Highland Drumming at Edinburgh Castle. He did not play in the school band, for fear that it would damage his technique.", "In 1950 he became the youngest ever winner of the gold medals for piobaireachd at both the Argyllshire Gathering in Oban and the Northern Meeting in Inverness, at the age of 16. He initially intended to pursue piping as a hobby, and pursue a career training horses, but he went on a tour of Canada and the United States with Willie Ross in 1952. Burgess was persuaded by Brigadier Alistair MacLean at the Castle to join the Queen's Own Cameron Highlanders as a piper, and spent three years there, reaching the rank of corporal. His choice of regiment did not please Ross, who wanted him to join the Scots Guards."]}, {"page": "Willie Ross (pipe major)", "response": ["#redirect Willie Ross (piper)"]}, {"page": "G. S. McLennan", "response": ["McLennan was successful in solo competitions, and won the Gold Medal at the Argyllshire Gathering in Oban in 1904 and at the Northern Meeting in Inverness in 1905, and the Clasp at Inverness for former winners of the Gold Medal in 1909, 1920 and 1921. McLennan had a close friendship and competitive rivalry with Willie Ross, and he travelled to competitions and shared prize money with William Lawrie."]}, {"page": "List of winners of the Gold Medal, Senior Piobaireachd and Former Winners' MSR at the Argyllshire Gathering", "response": ["| Pipe Major Willie Ross, 2nd Scots Guards"]}]}}