{"wiki_id": "http://www.wikidata.org/entity/Q28054", "itemLabel": "Judi Dench", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Judi_Dench", "wikipedia_page": {"main": "Dame Judith Olivia Dench,  (born 9 December 1934) is an English actress. Regarded as one of Britain's best actresses, she is noted for her versatile work in various films and television programs encompassing several genres, as well as for her numerous roles on the stage. Dench has garnered multiple accolades throughout her career spanning over six decades, including an Academy Award, a Tony Award, two Golden Globe Awards, four British Academy Television Awards, six British Academy Film Awards and seven Olivier Awards.\nDench made her professional debut in 1957 with the Old Vic Company. Over the following few years, she performed in several of Shakespeare's plays, in such roles as Ophelia in Hamlet, Juliet in Romeo and Juliet and Lady Macbeth in Macbeth. Although most of Dench's work during this period was in theatre, she also branched into film work and won a BAFTA Award as Most Promising Newcomer. In 1968, she drew excellent reviews for her leading role of Sally Bowles in the musical Cabaret.\nOver the next two decades, Dench established herself as one of the most significant British theatre performers, working for the National Theatre Company and the Royal Shakespeare Company. She received critical acclaim for her work on television during this period, in the series A Fine Romance (1981–1984) and As Time Goes By (1992–2005), in both of which she held starring roles. Her film appearances were infrequent, and included supporting roles in major films, such as James Ivory's A Room with a View (1985), before she rose to international fame as M in GoldenEye (1995), a role she continued to play in eight James Bond films, until her final cameo appearance in Spectre (2015).\nA seven-time Academy Award nominee, Dench won the Academy Award for Best Supporting Actress for her performance as Queen Elizabeth I in Shakespeare in Love (1998); her other Oscar-nominated roles were for Mrs Brown (1997), Chocolat (2000), Iris (2001), Mrs Henderson Presents (2005), Notes on a Scandal (2006) and Philomena (2013). She is also the recipient of several honorary awards, including the BAFTA Fellowship Award, the Society of London Theatre Special Award and the British Film Institute Fellowship Award.", "link_mentions": [{"page": "Anthony Hopkins", "response": ["In 1983, Hopkins also became a company member of The Mirror Theater Ltd's Repertory Company. In 1985, Hopkins starred opposite Colin Firth in the Arthur Schnitzler play The Lonely Road at The Old Vic. That same year, he featured in the National Theatre production of Pravda as Lambert Le Roux by David Hare and Howard Brenton.Gussow, Mel. \"\"THEATER: MIRROR REP, IN A REVIVAL OF 'RAIN'.\" The New York Times, 10 March 1984. Web. 10 January 2017. Frank Rich, in his New York Times review, praised the performance writing, \"Mr. Hopkins creates a memorable image of a perversely brilliant modern-day barbarian.\" In 1986 he starred in David Hare’s production of King Lear, Hopkins's favourite Shakespeare play, at the National Theatre. The next year, he starred as Antony in the National Theatre production of Antony and Cleopatra opposite Judi Dench, and in 1989, Hopkins made his last appearance on stage in a West End production of M. Butterfly. \"It was a torment\", he claimed in a later interview. Of a matinee where nobody laughed, there was, he said \"not a titter”. When the lights came up, the cast realised the entire audience was Japanese. \"Oh God,\" he recalled, \"You’d go to your dressing room and someone would pop their head round the door and say, ‘Coffee? Tea?’ And I’d think, ‘An open razor, please.’\""]}, {"page": "A Wizard of Earthsea", "response": ["A condensed, illustrated version of the first chapter was printed by World Book in the third volume of Childcraft in 1989. Multiple audio versions of the book have been released. BBC Radio produced a radioplay version in 1996 narrated by Judi Dench, and a six-part series adapting the Earthsea novels in 2015, broadcast on Radio 4 Extra. In 2011, the work was produced as an unabridged recording performed by Robert Inglis."]}, {"page": "A Little Night Music", "response": ["A revival by the Royal National Theatre opened at the Olivier Theatre on September 26, 1995. It was directed by Sean Mathias, with set design by Stephen Brimson Lewis, costumes by Nicky Gillibrand, lighting by Mark Henderson and choreography by Wayne McGregor. It starred Judi Dench (Desiree), Siân Phillips (Madame Armfeldt), Joanna Riding (Anne Egerman), Laurence Guittard (Fredrik Egerman), Patricia Hodge (Countess Charlotte) and Issy van Randwyck (Petra). The production closed on August 31, 1996. Dench received the Olivier Award for Best Actress in a Musical., OfficialLondonTheatre.com", "thumb|Cast recording of 1995 National Theatre revival starring Judi Dench", "In addition to the original Broadway and London cast recordings, and the motion picture soundtrack (no longer available), there are recordings of the 1990 studio cast, the 1995 Royal National Theatre revival (starring Judi Dench), and the 2001 Barcelona cast recording sung in Catalan. In 1997 an all-jazz version of the score was recorded by Terry Trotter.\"Recordings, 'A Little Night Music'\"  sondheimguide.com, retrieved June 8, 2010", "The Independent review of the 1995 National Theatre revival praised the production, writing \"For three hours of gloriously barbed bliss and bewitchment, Sean Mathias's production establishes the show as a minor miracle of astringent worldly wisdom and one that is haunted by less earthy intimations.\" The review went on to state that \"The heart of the production, in both senses, is Judi Dench's superb Desiree Armfeldt...Her husky-voiced rendering of \"Send in the Clowns\" is the most moving I've ever heard.\"Taylor, Paul and Seckerson, Edward.\"Double Take: Reviews: 'A Little Night Music'\" Independent', September 1995", "| Judi Dench"]}, {"page": "December 9", "response": ["*1934 – Judi Dench, English actress "]}, {"page": "Dubbing (filmmaking)", "response": ["| Gisela Fritsch || Judi Dench || "]}, {"page": "Cinema of the United Kingdom", "response": ["The United Kingdom has had a significant film industry for over a century. While film production reached an all-time high in 1936, the \"golden age\" of British cinema is usually thought to have occurred in the 1940s, during which the directors David Lean, Michael Powell, (with Emeric Pressburger) and Carol Reed produced their most critically acclaimed works. Many British actors have accrued critical success and worldwide recognition, such as Audrey Hepburn, Maggie Smith, Roger Moore, Michael Caine, Sean Connery, Joan Collins, Judi Dench, Julie Andrews, Daniel Day-Lewis, Gary Oldman, Emma Thompson, Hugh Grant and Kate Winslet. Some of the films with the largest ever box office returns have been made in the United Kingdom, including the third and sixth highest-grossing film franchises (Harry Potter and James Bond)."]}, {"page": "Isle of Wight", "response": ["* Mrs. Brown (1997), with Dame Judi Dench and Billy Connolly, was filmed at Osborne House and Chale;", "* Victoria and Abdul (2017) starring Dame Judi Dench and Ali Fazal began shooting principal photography at Osborne House in September 2016."]}, {"page": "Ian McKellen", "response": ["In 1976, he played the title role in William Shakespeare's Macbeth (which he had first played for Trevor Nunn in a \"gripping...out of the ordinary\" production, with Judi Dench, at Stratford in 1976 and Iago in Othello, in award-winning productions directed by Nunn. Both of these productions were adapted into television films, also directed by Nunn. In 1978 through 1979 he toured in a double feature production of Shakespeare's Twelfth Night, and Anton Chekov's Three Sisters portraying Sir Toby Belch and Andrei, respectively.", "In 1995, McKellen made his screenwriting debut with Richard III, an ambitious adaptation of William Shakespeare's play of the same name, directed by Richard Loncraine. The film reimagines the play's story and characters to a setting based on 1930s Britain, with Richard depicted as a fascist plotting to usurp the throne. McKellen stars in the title role alongside an ensemble cast including Annette Bening, Robert Downey Jr., Jim Broadbent, Kristen Scott Thomas, Nigel Hawthorne and Dame Maggie Smith. As executive producer he returned his £50,000 fee to complete the filming of the final battle.Empire, May 2006 In his review of the film, The Washington Post film critic Hal Hinson called McKellen's performance a \"lethally flamboyant incarnation\" and said his \"florid mastery ... dominates everything\". Film critic Roger Ebert of the Chicago Sun-Times praised McKellen's adaptation and his performance in his four star review writing, \"McKellen has a deep sympathy for the playwright...Here he brings to Shakespeare's most tortured villain a malevolence we are moved to pity. No man should be so evil, and know it. Hitler and others were more evil, but denied out to themselves. There is no escape for Richard. He is one of the first self-aware characters in the theater, and for that distinction he must pay the price.\" His performance in the title role garnered BAFTA and Golden Globe nominations for Best Actor and won the European Film Award for Best Actor. His screenplay was nominated for the BAFTA Award for Best Adapted Screenplay. That same year, he appeared in the historical drama Restoration (1995) also starring Downey Jr., as well as Meg Ryan, Hugh Grant, and David Thewlis. He also appeared in the British romantic comedy Jack and Sarah (1995) starring Richard E. Grant, Samantha Mathis, and Dame Judi Dench.", "In 2017, McKellen portrayed in a supporting role as Cogsworth (originally voiced by David Ogden Stiers in the 1991 animated film) in the live-action adaptation of Disney's Beauty and the Beast, directed by Bill Condon (which marked the third collaboration between Condon and McKellen, after Gods and Monsters and Mr. Holmes) and co-starred alongside Emma Watson and Dan Stevens. The film was released to positive reviews and grossed $1.2billion worldwide, making it the highest-grossing live-action musical film, the second highest-grossing film of 2017, and the 17th highest-grossing film of all time. The following year, he appeared in Kenneth Branagh's historical drama All is True (2018) portraying Henry Wriothesley, 3rd Earl of Southampton, opposite Branagh and Judi Dench.", "In 2019, he reunited with Condon for a fourth time in the mystery thriller The Good Liar opposite Helen Mirren, who received praise for their onscreen chemistry. That same year, he appeared as Gus the Theatre Cat in the ill fated movie musical adaptation of Cats directed by Tom Hooper. The film featured performances from Jennifer Hudson, James Corden, Rebel Wilson, Idris Elba, and Judi Dench. The film was widely panned for its poor visual effects, editing, performances, screenplay, and was a box office disaster."]}, {"page": "Into the Woods", "response": ["The 2002 Broadway revival, directed by James Lapine and choreographed by John Carrafa, began previews on April 13, 2002 and opened April 30, 2002 at the Broadhurst Theatre, closing on December 29 after a run of 18 previews and 279 regular performances. It starred Vanessa Williams as the Witch, John McMartin as the Narrator, Stephen DeRosa as the Baker, Kerry O'Malley as the Baker's Wife, Gregg Edelman as Cinderella's Prince/Wolf, Christopher Sieber as Rapunzel's Prince/Wolf, Molly Ephraim as Little Red Ridinghood, Adam Wylie as Jack, and Laura Benanti as Cinderella. Judi Dench provided the pre-recorded voice of the Giant.", "The Olivier Award-winning Regent's Park Open Air Theatre production, directed by Timothy Sheader and choreographed by Liam Steel, ran for a six-week limited season from 6 August to 11 September 2010. The cast included Hannah Waddingham as the Witch, Mark Hadfield as the Baker, Jenna Russell as the Baker's wife, Helen Dallimore as Cinderella, and Judi Dench as the recorded voice of the Giant. Gareth Valentine was the Musical Director.Waddingham, Russel Lead Open Air Theatre's Into the Woods, 8/6-9/11 Broadway World, Retrieved July 27, 2013Shenton, Mark.\"New London Production of Into the Woods Opens at Open Air Theatre, Regent's Park Aug. 16\"  Playbill.com, August 16, 2010 The musical was performed outdoors in a wooded area. Whilst the book remained mostly unchanged, the subtext of the plot was dramatically altered by casting the role of the Narrator as a young school boy lost in the woods following a family argument – a device used to further illustrate the musical's themes of parenting and adolescence.", "| Judi Dench  (Pre-recorded)", "| Judi Dench  (Pre-recorded)Stenton, Mark. \"Judi Dench to Provide Voice of Giant in New London Production of 'Into the Woods'\",  Playbill, June 18, 2010"]}, {"page": "James Bond", "response": ["In 1999, Electronic Arts acquired the licence and released Tomorrow Never Dies on 16 December 1999. In October 2000, they released The World Is Not Enough for the Nintendo 64 followed by 007 Racing for the PlayStation on 21 November 2000. In 2003, the company released James Bond 007: Everything or Nothing, which included the likenesses and voices of Pierce Brosnan, Willem Dafoe, Heidi Klum, Judi Dench and John Cleese, amongst others. In November 2005, Electronic Arts released a video game adaptation of 007: From Russia with Love, which involved Sean Connery's image and voice-over for Bond. In 2006, Electronic Arts announced a game based on then-upcoming film Casino Royale: the game was cancelled because it would not be ready by the film's release in November of that year. With MGM losing revenue from lost licensing fees, the franchise was removed from EA to Activision. Activision subsequently released the 007: Quantum of Solace game on 31 October 2008, based on the film of the same name."]}, {"page": "Kevin Spacey", "response": ["In February 2003, Spacey announced that he was returning to London to become the artistic director of the Old Vic, one of the city's oldest theatres. Appearing at a press conference with Judi Dench and Elton John, Spacey promised both to appear on stage and to bring in big-name talent. He undertook to remain in the post for a full ten years. The Old Vic Theatre Company staged shows eight months out of the year. Spacey's first season started in September 2004, and opened with the British premiere of the play Cloaca by Maria Goos, directed by Spacey, which opened to mixed reviews. In the 2005 season, Spacey made his UK Shakespearean debut, to good notices, in the title role of Richard II directed by Trevor Nunn."]}, {"page": "Knight", "response": ["In the British honours system the knightly style of Sir and its female equivalent Dame are followed by the given name only when addressing the holder. Thus, Sir Elton John should be addressed as Sir Elton, not Sir John or Mr John. Similarly, actress Dame Judi Dench should be addressed as Dame Judi, not Dame Dench or Ms Dench."]}, {"page": "Leslie Caron", "response": ["Caron returned to France in the early 1970s, which she later said was a mistake. \"They adore someone who's really British or really American\", Caron said, \"but somebody who's French and has made it in Hollywood – and I was the only one who had really made it in a big way – they can't forgive\". During the 1980s, she appeared in several episodes of the soap opera Falcon Crest as Nicole Sauguet. Caron is one of the few actresses from the classic era of MGM musicals who are still active in film — a group that includes Rita Moreno, Margaret O'Brien and June Lockhart. Caron's later credits include Funny Bones (1995) with Jerry Lewis and Oliver Platt; The Last of the Blonde Bombshells (2000) with Judi Dench and Cleo Laine; Chocolat (2000) and Le Divorce (2003), directed by James Ivory, with Kate Hudson and Naomi Watts."]}, {"page": "Macbeth", "response": ["But Nunn achieved success for the RSC in his 1976 production at the intimate Other Place, with Ian McKellen and Judi Dench in the central roles. A small cast worked within a simple circle, and McKellen's Macbeth had nothing noble or likeable about him, being a manipulator in a world of manipulative characters. They were a young couple, physically passionate, \"not monsters but recognisable human beings\", but their relationship atrophied as the action progressed."]}, {"page": "Nicole Kidman", "response": ["In 2008, she reunited with Moulin Rouge! director Baz Luhrmann for the Australian period film Australia, set in the remote Northern Territory during the Japanese attack on Darwin during World War II, starring opposite Hugh Jackman as an Englishwoman feeling overwhelmed by the continent. The acting was praised and the film was a box office success worldwide. In 2009, Kidman appeared in the Rob Marshall musical Nine, portraying the Federico Fellini-like character's muse, Claudia Jenssen, alongside an ensemble cast consisting of Daniel Day-Lewis, Marion Cotillard, Penélope Cruz, Judi Dench, Fergie, Kate Hudson and Sophia Loren. Kidman, whose screen time was brief in comparison to the other actresses, performed the musical number \"Unusual Way\" alongside Day-Lewis. The film received several Golden Globe Award and Academy Award nominations, with Kidman earning her fourth Screen Actors Guild Award nomination, as part of the Outstanding Performance by a Cast in a Motion Picture award."]}, {"page": "Oscar Wilde", "response": ["On 14 February 1995, Wilde was commemorated with a stained-glass window at Poets' Corner in Westminster Abbey. The memorial, above the monument to Geoffrey Chaucer, was unveiled by his grandson Merlin Holland, while Sir John Gielgud read from the final part of De Profundis and Dame Judi Dench read an extract from The Importance of Being Earnest."]}, {"page": "Romeo and Juliet", "response": ["Throughout the century, audiences, influenced by the cinema, became less willing to accept actors distinctly older than the teenage characters they were playing. A significant example of more youthful casting was in Franco Zeffirelli's Old Vic production in 1960, with John Stride and Judi Dench, which would serve as the basis for his 1968 film. Zeffirelli borrowed from Brook's ideas, altogether removing around a third of the play's text to make it more accessible. In an interview with The Times, he stated that the play's \"twin themes of love and the total breakdown of understanding between two generations\" had contemporary relevance."]}]}}