{"wiki_id": "http://www.wikidata.org/entity/Q28092601", "itemLabel": "George Smart", "itemDescription": "English inventor and engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Smart_(inventor)", "wikipedia_page": {"main": "George Smart (1757/8–1834) was a British inventor, known for the invention of a device to clean chimneys, called the \"scandiscope\". He was awarded the Royal Society of Arts gold medal in 1805 for his invention, due to its potential for stopping the practice of making small children climb inside chimneys to clean them.\n\n", "link_mentions": [{"page": "Chimney sweep", "response": ["The first mechanical sweeper was invented by George Smart in 1803 but was resisted in the UK and the US. Joseph Glass marketed an improved sweeping machine in 1828; he is credited with being the inventor of the modern chimney sweep's brush. In the northern US, whites gave up the trade and employed black sweep-boys from the South. After regulation finally took hold in 1875 in the UK and the turn of the century in the US, the occupation became romanticized in popular media.", "In 1803, it was thought by some that a mechanical brush could replace a climbing boy (the Human brush), and members of the 1796 society formed The London Society for Superseding the Necessity for Employing Climbing Boys; they ascertained that children had now cleaned flues as small as 7in by 7in, and promoted a competition for a mechanical brush. The prize was claimed by George Smart for what, in effect, was a brush head on a long segmented cane, made rigid by an adjustable cord that passed through the canes."]}, {"page": "Benjamin Meggot Forster", "response": ["Around 1802 Forster was a founder of the Society for the Suppression of Climbing Chimney-Sweepers (properly from 1803 the SSNCB, Society for Superseding the Necessity of Climbing Boys), and took an interest in the inventions in the field of chimney sweeping, by George Smart and Joseph Glass. In 1819 he reported to its committee on the case of two small girls as sweeps, working at Windsor Castle. In fact four other members of the committee were from the Forster family.Others involved on the committee were John Julius Angerstein, Thomas Charles Bunbury, Thomas Everett, Stephen Lushington, Matthew Montagu, John Russell, 6th Duke of Bedford, and Henry Thornton. See Niels van Manen, The Climbing Boy Campaigns in Britain c. 1770-1840 (Ph.D. dissertation) p. 75 note 84. He framed the Child Stealing Act 1814. It was introduced as a bill in parliament on 17 May 1814, by William Smith."]}, {"page": "Henry Robinson Palmer", "response": ["There was an earlier monorail in Russia, of which Palmer was unaware. By 1823 George Smart had set up a trial version of Palmer's monorail."]}, {"page": "George Smart", "response": ["George Smart may refer to:", "*George Smart (footballer) (1890–1941), English footballer", "*George Smart (tailor) (1774–1846), English tailor and artist", "*George Smart (inventor) (died 1834), British inventor of a device for cleaning chimneys"]}, {"page": "Joseph Glass (inventor)", "response": ["During this period there was a movement to prevent boys being employed in cleaning chimneys. The Society for Superseding the Necessity of Climbing Boys (SSNCB) was founded in 1803 under the patronage of the Duchess of Gloucester. The SSNCB and the Royal Society for the Encouragement of Arts, Manufactures and Commerce promoted a competition for an effective apparatus for cleaning chimneys. Several systems were invented; one invented by George Smart was awarded a gold medal by the Society of Arts in 1805. However it had little effect on the campaign.Jackson, Lee (2014). Dirty Old London: The Victorian Fight Against Filth Yale University Press, p. 218."]}, {"page": "Society for the Encouragement of Arts, Manufactures and Commerce", "response": ["| George Smart"]}]}}