{"wiki_id": "http://www.wikidata.org/entity/Q28095305", "itemLabel": "Dan Willis", "itemDescription": "Australia-based English comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Dan_Willis_(comedian)", "wikipedia_page": {"main": "Dan Willis (born Dan Hull; 11 March 1973) is an Australia-based English comedian, originally studying and then working in information technology for over 12 years before moving into live stand-up comedy after the IT crash of 2002.\nSince then, Willis has performed over 2,000 times at comedy venues and festivals throughout the world, as well as live stand-up. He also performs 2 specialist computer comedy shows \"Control-Alt-Delete\" and \"PC Mac and me\".", "link_mentions": [{"page": "Ferris Bueller's Day Off", "response": ["In 2010, English comedian Dan Willis performed his show \"Ferris Bueller's Way Of...\" at the Edinburgh Festival, delving into the philosophy of the movie and looking for life answers within."]}, {"page": "Melbourne Fringe Festival", "response": ["* Control Alt Delete (2014) by Dan Willis, proving you can move smoothly from a career in Computers to Stand-Up Comedy."]}, {"page": "Gosforth Academy", "response": ["| Dan Willis"]}, {"page": "The Walking Dead (TV series)", "response": ["Due to its popularity, The Walking Dead has inspired dozens of parodies and spoofs featured on YouTube channels like Bad Lip Reading and television series such as Saturday Night Live and Mad TV. Bad Lip Reading made a widely viewed parody involving Rick and the Governor, entitled \"La-Bibbida-Bibba-Dum\". The series's cast was shown the parody at the San Diego Comic-Con in 2013, and David Morrisseywho portrays the Governor reacted by saying he now understood why so many people would walk up to him on the street and blurt, \"Hey, La-Bibbida-Bibba-Dum!\" Until seeing the video, he had wondered, \"what's wrong with these people?\" The Walking Dead has also been represented as a live comedy performance by English comedian Dan Willis at the Edinburgh Festival. A parody film called The Walking Deceased was released in 2015."]}, {"page": "Dan Willis Comedian And Computer Expert", "response": ["#REDIRECT Dan Willis (comedian)"]}, {"page": "Dan Willis", "response": ["Dan Willis may refer to:", "*Dan Willis (author) (born 1967), American fantasy and science-fiction author", "*Dan Willis (comedian) (born 1973), British comedian based in Australia"]}]}}