{"wiki_id": "http://www.wikidata.org/entity/Q28017179", "itemLabel": "Jayne Christie", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Jayne_Christie", "wikipedia_page": {"main": "Jayne Christie (née Smith) is an English international lawn bowler.\nChristie made her international debut in 2000 and later captained England. She was runner-up in the 1999 & 2002 National Championships singles. In 2003 she was part of the England team that won Team gold medal at the  European Bowls Team Championships in Vilamoura.\nIn 2004, she won the gold medal in the fours with Jean Baker, Amy Monkhouse and Ellen Falkner at the 2004 World Outdoor Bowls Championship.She went on to win National Mixed Fours title in 2013\nShe is also a member of the selection committee for Bowls England.", "link_mentions": [{"page": "Ellen Falkner", "response": ["In 2004, she won the gold medal in the fours with Jayne Christie, Jean Baker and Amy Monkhouse at the 2004 World Outdoor Bowls Championship. In 2016, she was part of the fours team with Rebecca Wigfield, Wendy King and Jamie-Lea Winch who won the silver medal at the 2016 World Outdoor Bowls Championship in Christchurch. She then won a bronze medal in the pairs with Sophie Tolchard. In 2020 she was selected for the 2020 World Outdoor Bowls Championship in Australia."]}, {"page": "Amy Gowshall", "response": ["In 2004, she won the gold medal in the fours with Jayne Christie, Jean Baker and Ellen Falkner at the 2004 World Outdoor Bowls Championship."]}, {"page": "2004 World Outdoor Bowls Championship", "response": ["||   Jayne Christie  Jean Baker Amy Monkhouse Ellen Falkner         "]}, {"page": "World Bowls Championship", "response": ["| align=center| Amy Monkhouse Jean Baker,  Ellen Falkner, Jayne Christie"]}, {"page": "Jean Baker (bowls)", "response": ["Baker won bronze medals at the 1992 World Outdoor Bowls Championship, 1996 World Outdoor Bowls Championship and 2000 World Outdoor Bowls Championship. In 2004, she won the gold medal in the fours with Jayne Christie, Amy Monkhouse and Ellen Falkner at the 2004 World Outdoor Bowls Championship."]}, {"page": "2004 World Outdoor Bowls Championship – Women's triples", "response": ["|1 || align=\"left\"| Jayne Christie, Jean Baker, Shirley Page    || 6 || 6 || 0 || 0 || 12 || +79"]}, {"page": "2004 World Outdoor Bowls Championship – Women's fours", "response": ["Jayne Christie, Jean Baker, Amy Monkhouse and Ellen Falkner of England won the fours gold medal.", "|1 || align=\"left\"| Jayne Christie, Jean Baker, Amy Monkhouse, Ellen Falkner    || 6 || 6 || 0 || 0 || 12 || +85"]}, {"page": "Bowls England National Championships (women's singles four wood)", "response": ["| align=center|2002 || Helen Wall ||Derbyshire ||Jayne Christie ||Bedfordshire"]}, {"page": "Bowls England National Championships (women's pairs)", "response": ["| align=center|2009||Lynne Bowen & Jean Baker ||Derbyshire ||Rosemary Addison & Jayne Christie ||Cambridgeshire"]}, {"page": "Bowls England National Championships (mixed fours)", "response": ["|align=center|2013|| CambridgeshireHuntingdonshire || Ellen Falkner, Jayne ChristieChris Falkner, Nick Brett || Devon || Sophie Tolchard, Lorraine Hackett Phil Hackett, Sam Tolchard                  || 22-5"]}]}}