{"wiki_id": "http://www.wikidata.org/entity/Q28052663", "itemLabel": "Fanny Dango", "itemDescription": "English actress (1878-1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Fanny_Dango", "wikipedia_page": {"main": "Fanny Mackay (née Rudge; 20 October 1878 – 15 July 1972), better known as Fanny Dango, was a British comedienne, singer and actress who found fame in both the UK and Australia. She was one of the Rudge Sisters. She married a rich Australian grazier and died in Australia.", "link_mentions": [{"page": "Fandango (disambiguation)", "response": ["* Fanny Dango (1878–1972), British comedienne, singer and actress"]}, {"page": "Letty Lind", "response": ["Lind spent the rest of her life in Slough, England, living a peaceful life on the farm.O'Connor, T. P., MP, \"Personal Recollections\" in The Daily Telegraph, 28 August 1923. Lind was the best known of the five Rudge Sisters.Cruickshank, pp. 5–6 Sarah Rudge, professionally known as \"Millie Hylton\" (1870–1920), worked in the theatre and the music halls making a name for herself as a male impersonator.  Elizabeth Rudge, a West End actress professionally known as \"Adelaide Astor\" (1873–1951), married George Grossmith, Jr. in 1895.  Lydia Rudge, professionally known as \"Lydia Flopp\" (1877–1963), appeared in pantomimes.  The youngest Rudge Sister, Fanny Rudge, had a long and successful career in Australia under the name \"Fanny Dango\" (1878–1972)."]}, {"page": "Rudge Sisters", "response": ["* Fanny Rudge – Fanny Dango (1878–1972 who married Samuel Peter Mackay in 1911)", "Letty Lind became a famous skirt dancer and musical comedy star. Millie Hylton worked in the theatre and the music halls, eventually making a career in variety as a male impersonator and was the mother of actress Millie Sim (b. 1895). Adelaide Astor, a West End actress, and her husband George Grossmith Jr. had three children, Ena Sylvia Victoria (1896–1944), who became a stage and film actress; George (1906–c.2000), who became a theatrical manager; and Rosa Mary (1907–1988).Gänzl, Kurt. \"Grossmith, George (1874-1935)\" in the Oxford Dictionary of National Biography, Oxford University Press (2004) accessed 21 Oct 2007 Lydia Flopp appeared in pantomime. Fanny Dango worked in theatre in London and then had a long and successful career in Australia. While touring Australia, she made an astute property purchase, married a wealthy sheep farmer\"Personal\", The Argus, 1 December 1910, p. 7, accessed 16 November 2020 and settled there.Buckle, Liz. \"Stories found within the major shipping list project: 1852–1923\", Public Record Office, Victoria, Australia, 6 December 2012."]}, {"page": "Elsie Mackay (actress)", "response": ["Mackay's education was completed at a finishing school in Switzerland. In 1910 her father remarried and her new step-mother Fanny Dango was a noted actress. According to Hal Porter, she made her first appearance on stage in a minor role in Pygmalion in 1914 at His Majesty's Theatre, London. She took over the role of Virginia Bullivant from Margery Maude in the play Grumpy later the same year. Her success was such that she became a leading player in the Cyril Maude Company, touring the United States in 1915. In 1916, she joined Herbert Beerbohm Tree's company on its tour of the United States, consistently taking the role of leading ladies and acting under the direction of the likes of David Belasco.", "In 1920  Mackay became the second wife of actor Lionel Atwill, but they divorced in March 1928, after he had detectives raid an apartment on Manhattan's 68th Street in 1925, where Mackay was found with actor Max Montesole. Mackay and Montesole married in 1933 and moved to Australia in late 1934 where they worked together, often on radio. Montesole died in Perth in 1942. Mackay died in Hawthorn, Victoria in 1963. Her parents had divorced in 1910. She was buried with her father and, in time, her step mother Fanny Dango."]}, {"page": "W. S. Percy", "response": ["He made his reputation appearing in productions for J. C. Williamson Ltd. He co-starred in \"The Girls of Gottenburg\" and \"The Dairymaids\" with Reginald Roberts, Fanny Dango and George Lauri in Melbourne."]}, {"page": "Samuel Peter Mackay", "response": ["In 1911 Mackay had divorced his first wife, Florence Gertrude Taylor, when he married Fanny Rudge who used the stage name of Fanny Dango. They married in London."]}, {"page": "Fanny Rudge", "response": ["#REDIRECT Fanny Dango"]}]}}