{"wiki_id": "http://www.wikidata.org/entity/Q2804827", "itemLabel": "Simon Maginn", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Maginn", "wikipedia_page": {"main": "Simon Maginn (born 1961 in Wallasey, Merseyside) is a British writer who has published five novels under his own name: Sheep (Corgi 1994), Virgins and Martyrs (Corgi, 1995), A Sickness of the Soul (Corgi 1995), Methods of Confinement (Black Swan 1996) and Rattus (Pendragon Press 2010) which was published alongside a novella by Gary Fry entitled The Invisible Architect of Psychopathy. The novels are horror/psychological thrillers. A film version of Sheep was released as The Dark in 2005.Maginn has written satirical comedies using the pseudonym Simon Nolan: As Good as it Gets (Quartet Books, 1999), The Vending Machine of Justice (Quartet Books, 2001) and Whitehawk (Revenge Ink, 2010). In 1993, Maginn was one of six authors chosen by W. H. Smith for a campaign involving a purchase of 20,000 paperback books. At the time, Maginn was a music teacher.In 2018, Maginn was accused of antisemitism over tweets criticising accusations of antisemitism in the Labour Party. He was investigated by the Labour Party over antisemitism claims. Maginn cancelled his membership of the Labour Party while under investigation.", "link_mentions": [{"page": "Annwn", "response": ["The Dark, a 2005 film directed by John Fawcett and based on the novel Sheep by Simon Maginn, involves the legend, though set in contemporary times."]}, {"page": "The Dark (2005 film)", "response": ["The Dark is a 2005 folk horror film starring Sean Bean and Maria Bello and directed by John Fawcett. It is based on the 1994 novel Sheep by Simon Maginn.  The film was shot on the Isle of Man."]}, {"page": "Sheep (novel)", "response": ["Sheep is a horror novel by British author Simon Maginn, originally published in 1994 and reissued in 1997. It is now out of print. The book provided the basis for the 2005 film The Dark, although the plot changed drastically in the conversion from book to film. It was Maginn's debut novel."]}, {"page": "Simon maginn", "response": ["#REDIRECT Simon Maginn "]}, {"page": "Maginn", "response": ["*Simon Maginn (born 1961), British writer"]}, {"page": "List of fiction works made into feature films (S–Z)", "response": ["| Sheep (2004), Simon Maginn"]}, {"page": "Simon Magginn", "response": ["#REDIRECT Simon Maginn"]}, {"page": "Simon Maggin", "response": ["#REDIRECT Simon Maginn"]}, {"page": "Simon Magin", "response": ["#REDIRECT Simon Maginn"]}]}}