{"wiki_id": "http://www.wikidata.org/entity/Q28052427", "itemLabel": "George Jefferson", "itemDescription": "English engineer and business executive", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Jefferson_(engineer)", "wikipedia_page": {"main": "Sir George Jefferson  (26 March 1921 – 1 September 2012) was a British aeronautical engineer, and the first chairman of British Telecom (BT); he was largely responsible for its privatisation in 1984.", "link_mentions": [{"page": "George Jefferson", "response": ["George Jefferson is a fictional character played by Sherman Hemsley on the American television sitcoms All in the Family (1973-1975) and its spin-off The Jeffersons (1975–1985), in which he serves as the program's protagonist. He has appeared in all 253 episodes of The Jeffersons.", "George Jefferson was born in Harlem in 1929, an ambitious African-American entrepreneur who started and managed a successful chain of seven dry cleaning stores in New York City. The only background on the Jefferson family is that they were Alabama sharecroppers. In a very early episode, George's wife Louise makes mention of a conversation she had with George's father after she and George were married about the Jeffersons family roots.  However, the show's writers later applied a retroactive change in the continuity of George's father, such that he had died when George was 10 years old.  This left George to take care of his mother; therefore, George was unable to complete high school. He was a cook in the US Navy during the Korean War. He began dating Louise when they were teenagers and married her upon his discharge from the navy in 1951; by 1979 they had been married 28 years.", "Like his neighbor Archie Bunker, George Jefferson was frequently opinionated, rude, bigoted, prone to scheming and not particularly intelligent in a scholastic sense, but still a loving, hard-working father and husband. Unlike Archie, however, George was quicker thinking, and usually cleverer. Frequently, plots in The Jeffersons revolved around George's usually dishonest schemes, which always ended in comedic failure. In the Season 3 episode \"A Case of Black and White\", George schemes to obtain a new client (a mixed-race couple) by inviting them and the Willises (also a mixed-race couple) to dinner. When the Willises realize that George is using them, they leave before the new client shows up. This makes George bribe Florence the maid and Ralph the doorman into pretending to be the Willises. Eventually the Willises return, and by pretending to be Florence and Ralph, they help George land the client, while trapping George into throwing them an extravagant anniversary party. In the episode \"George and Jimmy\" George's big-mouthed attempts to invite US President Jimmy Carter to his home as a publicity stunt backfires with George almost being arrested by the US Secret Service. In another episode \"George and the Manager\" George's refusal to hire any woman to be the manager of his cleaning store results in 1] A qualified African American woman refusing to work for George under any circumstances 2] a qualified white woman employee quits so she can work at George's biggest competitor, Cunningham Cleaners 3] Louise and Mother Jefferson allied with one another against George's sexist attitude. In the last episode of the series \"Red Robins\", George's dishonest \"business advice\" to his granddaughter Jessica Jefferson and her \"Red Robins\" girl scout troop about selling their uneatable candy results in the girls losing a chance at a scout Jamboree and Louise Jefferson scolding George soundly.", "Like Archie Bunker, George Jefferson's personality softened as years passed. By The Jeffersons series finale in 1985, the frequent racism and interracial marriage plot-lines of early seasons were replaced with plots involving the Jeffersons' family life, as well as interactions with maid Florence (played by Marla Gibbs) and neighbors.  George would form a grudging friendship with Tom Willis and this was primarily what prompted Hemsley to ask for the aforementioned changes, feeling George would no longer make such jokes if he and Tom were truly becoming friends.", "The following is a list of All in the Family episodes featuring George Jefferson before and during The Jeffersons.", "The lingering cultural impact of the George Jefferson character is such that Michelle Obama, the wife of then-presidential candidate Barack Obama, referenced George Jefferson in a June 8 interview with the New York Times. Referring to an unfounded rumor discussed by a blogger that she had once used the word \"whitey\" in a speech, Michelle Obama told the Times: \"You are amazed sometimes at how deep the lies can be . . . I mean, ‘whitey’? That's something that George Jefferson would say.\""]}]}}