{"wiki_id": "http://www.wikidata.org/entity/Q28016752", "itemLabel": "Emilius Bayley", "itemDescription": "cricketer (1823-1917)", "wikipedia_url": "https://en.wikipedia.org/wiki/Emilius_Bayley", "wikipedia_page": {"main": "Sir John Robert Laurie Emilius Bayley, 3rd Baronet (16 May 1823 – 4 December 1917), later Sir Emilius Laurie, was an English clergyman, baronet and amateur cricketer. He was generally known by his middle-name Emilius and changed his surname to Laurie in 1887.\n\n", "link_mentions": [{"page": "Sir Robert Laurie, 6th Baronet", "response": ["Laurie was promoted to Rear-Admiral of the Blue on 19 July 1821, Rear-Admiral of the White 27 May 1825, Rear-Admiral of the Red 22 July 1830, Vice-Admiral of the White 10 January 1837, Vice-Admiral of the Red (date unknown) and a full Admiral of the Blue on 9 November 1846. He was nominated a Knight Commander of the Bath in 1836. He died unmarried with the rank of Admiral of the White on 7 January 1848 at his seat of Maxwelton House, Dumfriesshire. He had no issue, and the baronetcy became extinct upon his death. Maxwelton House later passed to his grand-nephew Emilius Bayley, 3rd Baronet Bayley who changed his name to Laurie and the name of the Baronetcy to Laurie."]}, {"page": "Sir John Bayley, 1st Baronet", "response": ["By his wife Elizabeth, the daughter of John Markett of Meopham Court Lodge, co. Kent, he had three sons and three daughters. His eldest son, Sir John Bayley, 2nd Baronet, was a noted cricketer. The 3rd baronet, the Rev. Sir John Laurie Emilius Bayley, was his grandson."]}, {"page": "Lyttleton Bayley", "response": ["Bayley was the  second son of Sir John Edward George Bayley, 2nd Baronet (1793–1871), and brother of Sir John Robert Laurie Emilius Bayley, 3rd Baronet. He was educated at Eton and Trinity College, Cambridge.He is not, however, listed in Venn's Alumni Cantabrigienses. Bayley captained the 1844 cricket team at Eton and played first-class cricket from 1846 to 1848. He played eight matches for Marylebone Cricket Club (MCC), of whom his father was president in 1844, and four times for Kent County Cricket Club and the Gentlemen of Kent.First-class batting and fielding for each team by Lyttelton Bayley, CricketArchive. Retrieved 26 March 2017."]}, {"page": "List of English cricketers (1841–1850)", "response": ["|Emilius Bayley", "|Played in 16 first-class matches for MCC and Kent sides. Brother of Emilius Bayley."]}, {"page": "Emilius", "response": ["* Emilius Bayley (1823–1917), English clergyman and cricketer"]}, {"page": "Emilius Laurie", "response": ["#REDIRECT Emilius Bayley"]}, {"page": "List of Marylebone Cricket Club players (1827–1863)", "response": ["* Emilius Bayley (1842–1843) : J. R. L. E. Bayley (Kent)"]}, {"page": "John Minet Fector", "response": ["Fector married in 1841 Isabella Murray, daughter of General Augustus William Murray. There were no children of the marriage. His sister Charlotte married Sir John Edward George Bayley, 2nd Baronet and was mother of Emilius Bayley. The Fector family survived in this line."]}, {"page": "Emilius Bayley, 3rd Baronet", "response": ["#REDIRECT Emilius Bayley"]}]}}