{"wiki_id": "http://www.wikidata.org/entity/Q28078237", "itemLabel": "Nigel Williams", "itemDescription": "British conservator and expert on the restoration of ceramics and glass (1944–1992)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Williams_(conservator)", "wikipedia_page": {"main": "Nigel Reuben Rook Williams (15 July 1944 – 21 April 1992) was an English conservator and expert on the restoration of ceramics and glass. From 1961 until his death he worked at the British Museum, where he became the Chief Conservator of Ceramics and Glass in 1983. There his work included the successful restorations of the Sutton Hoo helmet and the Portland Vase.\nJoining as an assistant at age 16, Williams spent his entire career, and most of his life, at the British Museum. He was one of the first people to study conservation, not yet recognised as a profession, and from an early age was given responsibility over high-profile objects. In the 1960s he assisted with the re-excavation of the Sutton Hoo ship-burial, and in his early- to mid-twenties he conserved many of the objects found therein: most notably the Sutton Hoo helmet, which occupied a year of his time. He likewise reconstructed other objects from the find, including the shield, drinking horns, and maplewood bottles.\nThe \"abiding passion of his life\" was ceramics, and the 1970s and 1980s gave Williams ample opportunities in that field. After nearly 31,000 fragments of shattered Greek vases were found in 1974 amidst the wreck of HMS Colossus, Williams set to work piecing them together. The process was televised, and turned him into a television personality. A decade later, in 1988 and 1989, Williams's crowning achievement came when he took to pieces the Portland Vase, one of the most famous glass objects in the world, and put it back together. The reconstruction was again televised for a BBC programme, and as with the Sutton Hoo helmet, took nearly a year to complete.\nWilliams died at age 47 of a heart attack while in Aqaba, Jordan, where he was working on a British Museum excavation. The Ceramics & Glass group of the Institute of Conservation awards a biennial prize in his honour, recognising his significant contributions in the field of conservation.", "link_mentions": [{"page": "Portland Vase", "response": ["By the late 1980s, the adhesive was again yellowing and brittle. Although the vase was shown at the British Museum as part of the Glass of the Caesars exhibition (November 1987 – March 1988), it was too fragile to travel to other locations afterwards. Instead, another reconstruction was performed between 1 June 1988 and 1 October 1989 by Nigel Williams and Sandra Smith. The pair was overseen by David Akehurst (CCO of Glass and Ceramics) who had assessed the vase's condition during the Glass of the Caesars exhibition and decided to go ahead with reconstruction and stabilization. The treatment had scholarly attention and press coverage. The vase was photographed and drawn to record the position of fragments before dismantling; the BBC filmed the conservation process. Conservation scientists at the museum tested many adhesives for long-term stability, choosing an epoxy resin with excellent ageing properties. Reassembly revealed some fragments had been filed down during the restorations, complicating the process. All but a few small splinters were integrated. Gaps were filled with blue or white resin. "]}, {"page": "William Hamilton (diplomat)", "response": ["In 1798, as Hamilton was about to leave Naples, he packed up his art collection and a second vase collection and sent them back to England. A small part of the second vase collection went down with  off the Scilly Isles.In 1974, the site of the wreck was located, and some fragments of Sir William's vases were retrieved; they were reassembled by Nigel Williams, conservator at the British Museum. The surviving part of the second collection was catalogued for sale at auction at Christie's when at the eleventh hour Thomas Hope stepped in and purchased the collection of mostly South Italian vases."]}, {"page": "1944 in archaeology", "response": ["* 15 July - Nigel Williams, British conservator (d. 1992)"]}, {"page": "1992 in archaeology", "response": ["* 21 April: Nigel Williams, English conservator (b. 1944)"]}, {"page": "Nigel Williams", "response": ["Nigel Williams may refer to:", "*Nigel Williams (footballer) (born 1954), English former professional footballer", "*Nigel Williams (American football), NFL Player", "*Nigel Williams (karate), represented Bermuda at the 1995 Pan American Games", "*Nigel Williams (rugby union), Welsh rugby union referee in 2004–05 Heineken Cup", "*Nigel Williams (author) (born 1948), British novelist, screenwriter and playwright", "*Nigel Williams (broadcaster), British broadcaster and voice over artist", "*Nigel Williams (conservator) (1944–1992), British conservator and restorer", "*Nigel Williams (children's rights activist), Northern Ireland Commissioner for Children and Young People (2003–2006)", "*Nigel Williams (priest) (born 1963), Welsh, Church of England clergyman", "*Nigel Williams-Goss"]}, {"page": "Rupert Bruce-Mitford", "response": ["Bruce-Mitford was married three times, and had three children by his first wife. In 1941 he married Kathleen Dent, with whom he fathered Myrtle (b. 1943), Michael (b. 1946), and Miranda (b. 1951). A professional cellist, Myrtle Bruce-Mitford would herself contribute to the Sutton Hoo finds, being employed by the British Museum to work on the remnants of the lyre and co-authoring a paper with her father. She was also the longtime partner of Nigel Williams, who from 1970 to 1971 reconstructed the Sutton Hoo helmet."]}, {"page": "Sutton Hoo helmet", "response": ["The current reconstruction of the Sutton Hoo helmet was completed in 1971, following eighteen months of work by Nigel Williams. Williams had joined the British Museum in his teens after studying at the same Central School of Arts and Crafts as Maryon, yet in contrast to Maryon, who completed the first restoration in his 70s and \"with the use of only one eye,\" Williams reconstructed the helmet while in his mid-20s.", "The finished replica was unveiled before an address at the Sachsensymposion in September 1973 with theatrical flair: the lights were dimmed; down the aisle came Nigel Williams holding a replica of the Sutton Hoo whetstone; and behind him followed Rupert Bruce-Mitford, wearing a carriage rug and with hands hieratically crossed, wearing the Royal Armouries helmet and reciting the opening lines of Beowulf."]}, {"page": "List of alumni of the Central School of Art and Design", "response": ["* Nigel Williams"]}, {"page": "Internationales Sachsensymposion", "response": ["The 24th rendition, held in London in September 1973, was the occasion for the \"theatrical\" unveiling of the Royal Armouries replica of the Anglo-Saxon Sutton Hoo helmet. Preceding an evening address, the lights were dimmed; down the aisle came Nigel Williams holding a replica of the Sutton Hoo whetstone; and behind him followed Rupert Bruce-Mitford, wearing a carriage rug and with hands hieratically crossed, wearing the Royal Armouries helmet and reciting the opening lines of Beowulf."]}, {"page": "Herbert Maryon", "response": ["Maryon's work was celebrated, and both academically and culturally influential. The helmet stayed on display for over twenty years, with photographs making their way into television programmes, newspapers, and \"every book on Anglo-Saxon art and archaeology\"; in 1951 a young Larry Burrows was dispatched to the British Museum by Life, which published a full page photograph of the helmet alongside a photo of Maryon. Over the succeeding quarter century conservation techniques advanced, knowledge of contemporaneous helmets grew, and more helmet fragments were discovered during the 1965–69 re-excavation of Sutton Hoo; accordingly, inaccuracies in Maryon's reconstruction—notably its diminished size, gaps in afforded protection, and lack of a moveable neck guard—became apparent. In 1971 a second reconstruction was completed, following eighteen months' work by Nigel Williams. Yet \"[m]uch of Maryon's work is valid,\" Bruce-Mitford wrote. \"The general character of the helmet was made plain.\" \"It was only because there was a first restoration that could be constructively criticized,\" noted the conservation scholar Chris Caple, \"that there was the impetus and improved ideas available for a second restoration;\" similarly, minor errors in the second reconstruction were discovered while forging the 1973 Royal Armouries replica. In executing a first reconstruction that was reversible and retained evidence by being only lightly cleaned, Maryon's true contribution to the Sutton Hoo helmet was in creating a credible first rendering that allowed for the critical examination leading to the second, current, reconstruction."]}, {"page": "Peter van Geersdaele", "response": ["From 1954 to 1976 van Geersdaele worked at the British Museum. He began in the moulders’ shop, creating replicas of classical sculpture, and rose to become a senior conservation officer in the British and Medieval department. There he notably led the team tasked with making a mould, and later a fibreglass replica, of the Sutton Hoo ship, a process he repeated in October 1970 with the Graveney boat. Other work at the museum included the 1964 removal of a thirteenth-century tile kiln from Clarendon Palace, a project in which, as with the Sutton Hoo ship, he was assisted by Nigel Williams, and the 1973 restoration of fourteenth-century wallpaintings from St Stephen's Chapel in Westminster Palace. He also helped with excavations of the Longton Hall porcelain factory and the Broadstairs Anglo-Saxon cemetery. During his time at the museum he also studied part-time towards a conservation diploma at University College London's Institute of Archaeology, which helped equip him to publish several articles on his work.", "The making of the plaster cast took three weeks. Van Geersdaele led the operation, with help from Jack Langhorn, senior technician at the British Museum's plasterers' shop, A. Prescott, Nigel Williams, G. Adamsom, Y. Crossman, and G. Joysmith. Plaster of Paris was used for its fast setting time and cost efficiency, and five experiments were conducted to find an appropriate method. In the first experiment, using soil dumps from the excavation, plaster was applied directly to earth, but when removed pulled the earth away with it. Two attempts to chemically consolidate the surface were then unsuccessfully tried, before an attempt was made to lay polyethylene directly over the impression to act as a barrier. This produced too many wrinkles, and so in a final, successful, experiment, wet paper towels were instead used as barriers. The method was repeated across the entire ship. The ship was moulded in 85 sections, and weighed an estimated ."]}, {"page": "Chris Caple", "response": ["Caple has authored two books: Conservation Skills: Judgement, Method and Decision Making in 2000, and Objects: Reluctant Witnesses to the Past in 2006. Both are used as textbooks in courses on conservation, and museum studies. Conservation Skills was reviewed as a broad assessment of the conservation field, and as a \"well-balanced\" book that \"achieves a detached approach without preaching to the audience\", using case studies to illustrate the underlying issues of, and philosophy of approach to, conservation. A case study on the \"re-reconstruction\" of the Sutton Hoo helmet, which became an icon of Anglo-Saxon England after it was reconstructed by Herbert Maryon in the 1940s, yet was then reconstructed again by Nigel Williams in the 1970s, focuses on the concepts of reversibility and truthfulness."]}, {"page": "Andrew Oddy", "response": ["Oddy has contributed numerous obituaries to the national press and to various journals, newsletters, magazines and online sites. Harold James Plenderleith, He has also contributed to numerous biographical articles in Amplius Vetusta Servare, such as those relating to John Doubleday, Nigel Williams and David Baynes-Cope."]}, {"page": "John Doubleday (restorer)", "response": ["At the time the restoration was termed \"masterly\" and Doubleday was lauded by The Gentleman's Magazine for demonstrating \"skilful ingenuity\" and \"cleverness ... sufficient to establish his immortality as the prince of restorers\". In 2006 William Andrew Oddy, a former keeper of conservation at the museum, noted that the achievement \"must rank him in the forefront of the craftsmen-restorers of his time.\" Doubleday's restoration would remain for more than 100 years until the adhesive grew increasingly discoloured. The vase was next restored by J. W. R. Axtell in 1948–1949, and then by Nigel Williams in 1988–1989."]}]}}