{"wiki_id": "http://www.wikidata.org/entity/Q280300", "itemLabel": "Danny Pugh", "itemDescription": "English footballer (born 1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Danny_Pugh", "wikipedia_page": {"main": "Daniel Adam Pugh (born 19 October 1982) is an English professional football coach and former player.\nA versatile player, he could play in midfield or at left-back. He began his career with Manchester United, and made a handful of first team appearances before being transferred to Leeds United in May 2004. He spent two seasons at Elland Road before joining Preston North End for a fee of £250,000 in June 2006. Another two-year spell followed until he joined Stoke City for £500,000 in January after a short loan period. He became a regular under Tony Pulis and helped the club to gain promotion out of the Championship in 2007–08. He appeared in the 2011 FA Cup Final, however he struggled to hold down a regular place in the Premier League and had loan spells back at Preston and then Leeds, before joining Leeds permanently for a second time in January 2012.\nHe made 62 appearances in his second spell at Leeds and also played on loan at Sheffield Wednesday in the 2012–13 season. He left Leeds and went on to spend the 2014–15 season with Coventry City, the 2015–16 campaign at Bury, before moving on to Blackpool in July 2016. He signed with Port Vale in January 2017 and was appointed as a first-team coach in September 2018. He stepped up to become Vale's caretaker-manager in January 2019 and January 2021.", "link_mentions": [{"page": "SuperCupNI", "response": ["* Danny Pugh (Manchester United) 1997 (U14), 1999 (U16)"]}, {"page": "Vincent Péricard", "response": ["Péricard made his first Premier League appearance in 0–0 draw with Fulham on 13 December 2008, coming on as a substitute for Danny Pugh. His first start in the Premier League came against Blackburn Rovers. Péricard, after seeing his first team opportunities disappear at Stoke following their promotion to the Premier League, signed a 93-day loan on 20 February 2009 with Millwall. Following the 2008–09 season, Péricard was released from his contract at Stoke.Stoke offer new contract to Diao BBC Sport, 2 June 2009"]}, {"page": "Frank Sinclair", "response": ["Sinclair began working as Stoke City's under-23 assistant manager in December 2016. He joined Radcliffe as assistant to manager Jon Macken in September 2017. He began coaching at Port Vale in March 2020, following an invite from assistant manager Dave Kevan. He was appointed as the club's head of coaching development five months later, saying that \"I see a key part of my role as bridging the gap between the younger players and the first team\". Interim manager Danny Pugh had to start self-isolation after testing positive for COVID-19 on 18 January 2021, leaving Sinclair, Billy Paynter and Anthony Griffith to take over first-team duties in his absence. The team lost both games in Pugh's absence, much to Sinclair's frustration. Sinclair left Vale Park at the end of the 2020–21 season. He joined Doncaster Rovers as an academy coach in October 2021."]}, {"page": "Michael Brown (footballer, born 1977)", "response": ["Bruno Ribeiro resigned as manager of Port Vale on 26 December 2016, and Brown was placed in temporary charge. Four days later Vale recorded a 1–0 home victory over Chesterfield in Brown's first match in charge. In the January transfer window he was forced to sell goalkeeper Jak Alnwick and reigning Player of the Year Anthony Grant, whilst top-scorer Alex Jones's loan deal expired and six other players left the club; Brown brought in youngsters Callum Guy, Tyler Walker, Olamide Shodipo, Axel Prohouly and Leo Fasan on loan, and signed Scott Tanser, Chris Eagles and Danny Pugh on free transfers. However his team were dogged by injury problems, and Brown told the media that if he could keep the Vale out of the relegation zone that would be an achievement \"off the scale\". Having scored just one goal in their final seven games, Vale were relegated at the end of the campaign after drawing their final game 0-0 with Fleetwood, finishing one point short of safety."]}, {"page": "Frazer Richardson", "response": ["Richardson scored his first Leeds goal on his second start for the club, the goal turning out to be the winner against Derby County in the opening game of the 2004–05 campaign (because the game was a 12:15 kick-off on Sky Sports, this was actually the first ever goal in the newly rebranded \"Football League Championship\"). Richardson was then replaced on the right of midfield by John Oster. However, an injury to Stephen Crainey meant Richardson was given a chance to establish himself at left full-back. However, his spell was short lived after Manager Kevin Blackwell chose to play the likes of Danny Pugh and Matthew Kilgallon in that position."]}, {"page": "Michael Tonge", "response": ["On 1 September 2008, Tonge signed for Premier League side Stoke City for a fee of £2 million. He made his \"Potters\" debut in a 3–2 defeat to Everton at the Britannia Stadium on 14 September. Tonge failed to establish himself in the Stoke squad and only made a further nine appearances in the 2008–09 season, of which only one was as a starter in the league. Having been limited to just three League Cup appearances at the start of the 2009–10 season, he joined Championship side Preston North End on loan on 19 November 2009. Manager Alan Irvine attempted to extend the loan deal, but was unsuccessful as Tonge played seven games for the \"Lilywhites\" before he was recalled from his loan spell at Deepdale on 31 December by Stoke manager Tony Pulis. On 1 February 2010, Tonge signed for Derby County on loan until end of the 2009–10 season, with manager Nigel Clough saying Tonge had \"proven pedigree\". Tonge scored his first goal for the \"Rams\" in a 2–0 win over Watford on 6 March. His loan spell proved successful, and after Tonge scored twice in 19 starts, Clough attempted to secure his services on loan for the following campaign. Still struggling for first team appearances at Stoke, Tonge returned to Preston North End on a month long loan on 17 November 2010, along with fellow Stoke teammate Danny Pugh. This was extended until 16 January 2011 after he impressed manager Darren Ferguson with his consistency. He scored his first goal for Preston in a 1–1 draw with Cardiff on 4 December."]}, {"page": "Antony Kay", "response": ["On 28 June 2017, Kay secured his release from Bury and signed a two-year contract with League Two club Port Vale, who had been relegated after finishing two places and one point behind Bury the previous season. He was appointed as club captain by manager Michael Brown. He scored a headed goal on his debut for the \"Valiants\" in a 3–1 win at Crawley Town on 5 August. However he was dropped by new manager Neil Aspin in October, who also gave the captaincy to Danny Pugh. Kay did though make a quick return to the first team playing out-of-position in midfield. On 12 December, he scored the \"goal of his life\" with a stunning long-range lob in a 3–2 defeat at Yeovil Town in the FA Cup. He maintained his new position as a holding central midfield player until the end of February, when he was both suspended for picking up ten yellow cards over the campaign and also ruled out of action for a month after undergoing a hernia operation. He marked his return from injury on 2 April by scoring what would go on to win him the club's goal of the season award, his long-range strike helping to secure a 2–2 draw at local rivals Crewe Alexandra. Two weeks later he was named on the EFL team of the week for scoring the only goal of a 1–0 win over Lincoln City."]}, {"page": "Ryan Shawcross", "response": ["He scored from a header in Stoke's first match of the 2009–10 season, helping them to a 2–0 win over Burnley. On 12 December 2009, he scored his second goal in the 2009–10 season for Stoke against Wigan Athletic in a 2–2 draw. Shawcross was again involved in an incident with Emmanuel Adebayor in a FA Cup fifth-round replay against Manchester City, Adebayor struck Shawcross in the face and was sent-off. Shawcross went on to score Stoke's second goal in a 3–1 win. On 27 February 2010, in a match against Arsenal, Shawcross was sent off after his tackle left Arsenal midfielder Aaron Ramsey with a broken leg. Shawcross himself wept when he saw the extent of the injury to Ramsey, who had to be stretchered off and taken to hospital. Shawcross, who apologised via text message, was defended by his teammates Danny Pugh and Rory Delap after the match, On the same day, Shawcross received a call-up to the England national team."]}, {"page": "Darren Ferguson", "response": ["Following his sacking by Preston, his father Sir Alex Ferguson immediately recalled all three Manchester United players on loan at Preston; Joshua King, Ritchie De Laet, and Matty James. In addition, the Stoke City manager Tony Pulis recalled the two Stoke players on loan at Preston; Danny Pugh and Michael Tonge. This meant that in a single week, Preston had lost five key first-team players, effectively sealing the team's relegation."]}, {"page": "Theo Robinson", "response": ["On 24 August 2020, Robinson rejoined Port Vale on a two-year deal, where he faced competition from Tom Pope, Mark Cullen and Devante Rodney for a place in the starting eleven. He stated that \"when I was here before it wasn’t really a good time personally but now I am here to put things right\". It was reported that Grimsby manager Ian Holloway had tried to sign him but lost out due to his club insisting on a clause to reduce pay if the league was postponed or cancelled again due to a second wave of Coronavirus disease 2019 cases; Vale reportedly had no such clause in their contract offer. On 5 September, he scored on his second debut for the Vale, coming on as a substitute to score a late winner in a 2–1 victory over Scunthorpe United in the first round of the EFL Cup, manager John Askey said that \"It's nice when you have someone like Theo who can come on and has goals in him\". Robinson set a personal target of 10 goals for the campaign but said the main aim was promotion. Having started the 2020–21 season on the bench, he claimed a place in the starting eleven by mid-October after becoming the club's leading scorer. He soon dropped out of the starting eleven however and was transfer-listed in December. Caretaker-manager Danny Pugh deregistered Robinson from the club's 22-man squad the following month in order to make room for new signing Kurtis Guthrie. He was re-registered at the end of the January transfer window and went on to earn praise for his work-rate from new manager Darrell Clarke but was still transfer-listed in May 2021. He left the club by mutual consent on 31 August 2021."]}, {"page": "Billy Paynter", "response": ["Paynter was appointed as an academy football coach at Everton in February 2018 and also spent six months as a coach at RIASA. He returned to former club Port Vale as the academy's professional development phase lead coach in October 2020. Interim manager Danny Pugh had to start self-isolation after testing positive for COVID-19 on 18 January 2021, leaving Paynter, Frank Sinclair and Anthony Griffith to take over first-team duties in his absence. New manager Darrell Clarke kept Paynter on as an assistant in the first-team."]}, {"page": "Pugh", "response": ["* Danny Pugh (born 1982), English footballer"]}, {"page": "Tom Pope", "response": ["On 12 January 2021, Pope broke his arm after landing awkwardly following a clash of heads in an EFL Trophy tie with Sunderland and played on for the remaining 19 minutes until the full-time whistle as caretaker-manager Danny Pugh had already used his allocation of substitutions. He was limited to 23 appearances in the 2020–21 campaign and was released by new manager Darrell Clarke in May 2021, leaving his final tally for the club to stand at 115 goals in 343 first-team appearances."]}, {"page": "Robbie Rogers", "response": ["Ahead of the 2012–13 season, manager Neil Warnock stated that he was hopeful Rogers would be able to get a full pre-season under his belt. In June 2012, Rogers returned to the United States to take part in a rehabilitation program, as well as spending two weeks training with the Los Angeles Galaxy squad. He returned to Leeds at the beginning of July 2012, and featured in a number of the club's pre-season friendlies; scoring in comprehensive victories over Farsley and Tavistock respectively. Shortly before the start of the new season, on August 9, manager Neil Warnock revealed that Rogers, along with teammate Danny Pugh, had been placed on the transfer list in order to generate funds for a new striker."]}, {"page": "Anthony Griffith (footballer)", "response": ["In September 2018, Griffith began coaching the under-14s at the Port Vale Academy. He was also appointed as first-team coach at Congleton Town two months later. On 7 November 2019, he was appointed as Congleton Town's joint-manager, alongside Phil Hadland. The duo were replaced by Ryan Austin on 29 April 2020, with Griffith remaining as a player-coach. He was appointed as a professional development phase lead coach at Port Vale in October 2020. Interim manager Danny Pugh had to start self-isolation after testing positive for COVID-19 on 18 January 2021, leaving Griffith, Frank Sinclair and Billy Paynter to take over first-team duties in his absence."]}, {"page": "2003–04 Manchester United F.C. season", "response": ["|26||MF|| Danny Pugh", "Leaving in the winter transfer window was Alan Tate, who joined Swansea City. First-choice goalkeeper Fabien Barthez rejoined Marseille in April, while Danny Pugh joined Leeds United in late May, in exchange for Alan Smith.", "Arriving in the winter transfer window was Louis Saha, who signed from Fulham on 23 January for a fee of £12.82 million. Alan Smith joined United on 26 May from Leeds United in exchange for Danny Pugh (see above). Gabriel Heinze joined United on 11 June from Paris Saint-Germain for a fee of £6.9 million.", "| Danny Pugh"]}, {"page": "2002–03 Manchester United F.C. season", "response": ["|align=\"left\"|26||align=\"left\"|MF||align=\"left\"| Danny Pugh"]}]}}