{"wiki_id": "http://www.wikidata.org/entity/Q281962", "itemLabel": "Ernest Torrence", "itemDescription": "actor (1878-1933)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernest_Torrence", "wikipedia_page": {"main": "Ernest Torrence (born Ernest Torrance-Thomson, 26 June 1878 – 15 May 1933) was a Scottish film character actor who appeared in many Hollywood films, including Broken Chains (1922) with Colleen Moore, Mantrap (1926) with Clara Bow and Fighting Caravans (1931) with Gary Cooper and Lili Damita. A towering (6' 4\") figure, Torrence frequently played cold-eyed and imposing villains.", "link_mentions": [{"page": "1933", "response": ["* May 13 – Ernest Torrence, British actor (b. 1878)"]}, {"page": "Captain Hook", "response": ["In Peter Pan, Captain Hook is portrayed by Ernest Torrence."]}, {"page": "Hollywood Walk of Fame", "response": ["While Joanne Woodward is often singled out as the first person to receive a star on the Walk of Fame—possibly because she was the first to be photographed with it—the original stars were installed as a continuous project, with no individual ceremonies. Woodward's name was one of eight drawn at random from the original 1,558 and inscribed on eight prototype stars that were built while litigation was holding up permanent construction. (, p.2)  (text verif.) (Google news archive) The eight prototypes were installed temporarily on the northwest corner of Hollywood Boulevard and Highland Avenue in August 1958 to generate publicity and to demonstrate how the Walk would eventually look. The other seven names were Olive Borden, Ronald Colman, Louise Fazenda, Preston Foster, Burt Lancaster, Edward Sedgwick, and Ernest Torrence. Official groundbreaking took place on February 8, 1960. On March 28, 1960, the first permanent star, director Stanley Kramer's, was completed on the easternmost end of the new Walk near the intersection of Hollywood and Gower."]}, {"page": "Clara Bow", "response": ["On April 12, 1926, Bow signed her first contract with Paramount: \"to retain your services as an actress for the period of six months from June 6, 1926 to December 6, 1926, at a salary of $750.00 per week\".April 12, 1926, Contract Copy, Famous Players-Lasky – Clara Bow agreement In Victor Fleming's comedy-triangle Mantrap Bow, as Alverna the manicurist, cures lonely hearts Joe Easter (Ernest Torrence) of the great northern, as well as pill-popping New York divorce attorney runaway Ralph Prescott (Percy Marmont). Bow commented: \"(Alverna] ... was bad in the book, but—darn it!—of course, they couldn't make her that way in the picture. So I played her as a flirt.\"Los Angeles Times, July 15, 1926 The film was released on July 24, 1926, to rave reviews. Variety said that \"Clara Bow just walks away with the picture from the moment she walks into camera range\",Variety, July 1, 1926 while Photoplay told readers that \"When she is on the screen nothing else matters. When she is off, the same is true.\"Photoplay, August 1926. Carl Sandburg wrote that it was \"The smartest and swiftest work as yet seen from Miss Clara Bow.\" and Sam Carver of the Newman Theater was quoted in The Reel Journal as saying that \"Clara Bow is taking the place of Gloria Swanson...(and)...filling a long need for a popular taste movie actress.\"\"Sam Carver, manager of 'first run' theater 'Newman' in Kansas City to industrial journal,\" The Reel Journal, p. 13, August 7, 1926."]}, {"page": "1928 in film", "response": ["*The Cossacks starring John Gilbert, Renée Adorée and Ernest Torrence"]}, {"page": "1923 in film", "response": ["*The Brass Bottle, directed by Maurice Tourneur; starring Harry Myers, Ernest Torrence, Tully Marshall, Ford Sterling, Aggie Herring"]}, {"page": "Clopin Trouillefou", "response": ["| Ernest Torrence || 1923 film"]}, {"page": "Steamboat Bill, Jr.", "response": ["Charles Reisner directed the film, and the credited story writer was Carl Harbaugh. The film, named after Arthur Collins's popular 1911 recording of the 1910 song \"Steamboat Bill\", also featured Ernest Torrence, Marion Byron, and Tom Lewis. In 2016, the film was selected for preservation in the United States National Film Registry by the Library of Congress. The film is known for what may be Keaton's most famous film stunt: The facade of an entire house falls all around him while he stands in the perfect spot to pass through the open attic window instead of being flattened.", "* Ernest Torrence as William \"Steamboat Bill\" Canfield, Sr."]}, {"page": "Peter Pan (1953 film)", "response": ["The job of animating Captain Hook was assigned to Frank Thomas, who faced conflicting visions of the character. Story artist Ed Penner viewed Hook as \"a very foppish, not strong, dandy-type, who loved all the finery. Kind of a con man. [Co-director Gerry] Geronimi saw him as an Ernest Torrence: a mean, heavy sort of character who used his hook menacingly.\" When Walt Disney saw Thomas' first test scenes, he said, \"Well, that last scene has something I like I think you're beginning to get him. I think we better wait and let Frank go on a little further.\" Because Thomas could not animate every scene of Hook, certain sequences were given to Wolfgang Reitherman, such as that showing Hook trying to escape Tick-Tock the crocodile."]}, {"page": "The King of Kings (1927 film)", "response": ["*Ernest Torrence as Peter", "In June 1927, Photoplay named the film one of \"The Best Pictures of the Month\". For their work in The King of Kings, H. B. Warner, Victor Varconi, Rudolph Schildkraut, and Ernest Torrence were included among \"The Best Performances of the Month\"."]}, {"page": "List of stars on the Hollywood Walk of Fame", "response": ["| Ernest Torrence || Motion pictures || 6801 Hollywood Boulevard"]}, {"page": "Edmund Goulding", "response": ["|1921 || Tol'able David || First National|| Richard Barthelmess, Gladys Hulette, Ernest Torrence || Screenwriter"]}, {"page": "Peter Pan (1924 film)", "response": ["Peter Pan is a 1924 American silent adventure film released by Paramount Pictures, the first film adaptation of the 1904 play by J. M. Barrie. It was directed by Herbert Brenon and starred Betty Bronson as Peter Pan, Ernest Torrence as Captain Hook, Mary Brian as Wendy, Virginia Browne Faire as Tinker Bell, Esther Ralston as Mrs. Darling, and Anna May Wong as the American Indian princess Tiger Lily.Progressive Silent Film List: Peter Pan at silentera.comThe AFI Catalog of Feature Films: Peter Pan", "*Ernest Torrence as Captain Hook"]}, {"page": "Tol'able David", "response": ["* Ernest Torrence as Luke Hatburn"]}, {"page": "Untamed (1929 film)", "response": ["Untamed is a 1929 American pre-Code Metro-Goldwyn-Mayer drama/comedy/romance film directed by Jack Conway and starring Joan Crawford, Robert Montgomery, Ernest Torrence, Holmes Herbert, Gwen Lee, and Lloyd Ingraham.Untamed at silentera.com The script was adapted by Sylvia Thalberg and Frank Butler, with dialogue by Willard Mack, from a story by Charles E. Scoggins.", "An oil prospector, Henry \"Hank\" Dowling (Lloyd Ingraham), has raised his free-spirited daughter, Alice \"Bingo\" Dowling (Joan Crawford), in the jungle of South America. He asks his friend, Ben Murchison (Ernest Torrence), to come work with him on oil wells that have made him rich. Just as Ben arrives with his friend, Howard Presley (Holmes Herbert), Hank is killed by a transient oil worker who has designs on Bingo."]}, {"page": "1929 Indianapolis 500", "response": ["The race began at 10 a.m. with George Hunt driving the Studebaker President Roadster pace car. Theodore \"Pop\" Meyers rode as a passenger in the pace car. Among the notable guests and celebrities in attendance were Governor Harry G. Leslie, Glenn Curtiss, Horace E. Dodge, Harvey S. Firestone, William S. Knudsen, and Ray Harroun. In addition, former Speedway president Carl G. Fisher was on hand. William Haines, Anita Page, Ernest Torrence, and Karl Dane were on hand, as filming continued on the film Speedway."]}, {"page": "The Bridge of San Luis Rey (1929 film)", "response": ["*Ernest Torrence as Uncle Pio "]}, {"page": "Raquel Torres", "response": ["The next year she was third-billed behind Lili Damita and Ernest Torrence in The Bridge of San Luis Rey (1929), the first film version of the classic Thornton Wilder novel, which was a part-talkie. This Oscar winner (for Art Direction) was an early disaster movie that bonded a group of strangers who see their lives flash before their eyes while trapped on a collapsing bridge. Torres' other 1929 film was The Desert Rider (1929), a standard western in which she provided spicy diversion opposite cowboy star Tim McCoy."]}, {"page": "The Blind Goddess", "response": ["*Ernest Torrence as 'Big Bill' Devens"]}, {"page": "Mantrap (1926 film)", "response": ["Mantrap is a 1926 American silent comedy film based on the novel of the same name by Sinclair Lewis. Mantrap stars Clara Bow, Percy Marmont, Ernest Torrence, Ford Sterling, and Eugene Pallette, and was directed by Victor Fleming.", "*Ernest Torrence as Joe Easter"]}, {"page": "List of pirate films and television series", "response": ["|Betty Bronson, Ernest Torrence, George Ali"]}, {"page": "Sherlock Holmes (1932 film)", "response": ["Reginald Owen plays Dr. Watson, and Ernest Torrence is Holmes's arch-rival, Professor Moriarty. Reginald Owen played Sherlock Holmes the following year in A Study in Scarlet. Owen is one of a small number of actors to play both Holmes and Watson. Examples of other such actors include Jeremy Brett, who played Watson on stage in the United States and, most famously, Holmes on British television, Carleton Hobbs, who played both roles in British radio adaptations, and Patrick Macnee, who played both roles in US television movies.", "* Ernest Torrence\t... \tMoriarty"]}, {"page": "Mississippi (film)", "response": ["There were two previous Paramount film versions of Booth Tarkington's play, Magnolia. The first in 1924 filmed as a silent under the title The Fighting Coward starred Cullen Landis, Phyllis Haver, Mary Astor, Ernest Torrence and Noah Beery, Sr.. The second version released in 1929, as River of Romance;River of Romance at silentera.com; 1929 film version of Tarkington's play Magnolia in early talkie and in silent editions, starred Buddy Rogers, Wallace Beery, Fred Kohler, Mary Brian, June Collyer and Henry B. Walthall. Fred Kohler reprises his Captain Blackie here from the 1929 film."]}, {"page": "State University of Music and Performing Arts Stuttgart", "response": ["* Ernest Torrence"]}, {"page": "Fighting Caravans", "response": ["Fighting Caravans is a 1931 American pre-Code Western film directed by Otto Brower and David Burton and starring Gary Cooper, Lili Damita, and Ernest Torrence. Based on the 1929 novel Fighting Caravans by Zane Grey, the film is about a young frontier scout who helps guide a freight wagon train across the country, fighting off Indians and evil traders, while his two crusty companions try to save him from falling in love. Although billed as being based on the Zane Grey novel, the stories have little in common. The film was actually written by Agnes Brand Leahy, Edward E. Paramore, Jr., and Keene Thompson.", "Clint Belmet (Gary Cooper) is a bit of a firebrand and is sentenced to at least 30 days in jail, but his partners, Bill Jackson (Ernest Torrence) and Jim Bridger (Tully Marshall) talk a sympathetic Frenchwoman named Felice (Lili Damita) into telling the bumbling, drunken marshal that Clint had married her the previous night. Clint is released so he can accompany Felice on the wagon train heading west to California.", "* Ernest Torrence as Bill Jackson"]}, {"page": "Sweet Kitty Bellairs", "response": ["Sweet Kitty Bellairs is a 1930 American historical musical comedy film directed by Alfred E. Green. The film is based on the 1900 novel, The Bath Comedy by Agnes Castle and Egerton Castle. Shot entirely in Technicolor,Variety film review; September 10, 1930, page 17.Harrison's Reports film review; September 13, 1930, page 146. the film stars Claudia Dell, Ernest Torrence and, Walter Pidgeon and is set in Bath, England in 1793.", "Nevertheless, Lord Varney declares his love for her and decides to write a love poem to Kitty. The film then proceeds to the next day and we see Kitty being tended to by her maid while chatting with her hairdresser about her three lovers. She describes them and asks his opinion on whom she should choose. The film then proceeds to the house of Lady Julia Standish (June Collyer) on whom Kitty is paying a call. Lady Julia's husband is neglecting her and Kitty gives her advice on how to make her husband interested once again. Her husband, Sir Jasper Standish (Ernest Torrence) arrives from a trip to find her dressed elegantly as if expecting a caller. Meanwhile, Kitty places a love note addressed to her in a conspicuous place with a lock of red hair and leaves the house. Through a welter of songs into which the principals break at short intervals she at length decides on a lord instead of a highwayman.", "* Ernest Torrence as Sir Jasper Standish", "* \"Drunk Song\" (Sung by Ernest Torrence, Lionel Belmore, Edgar Norton)", "* \"Duelling Song\" (Sung by Ernest Torrence, Perry Askam, Lionel Belmore, Edgar Norton, Douglas Gerrard)", "* \"Peggy's Leg\" (Sung by Ernest Torrence, Perry Askam, Lionel Belmore, Edgar Norton, Douglas Gerrard, Arthur Edmund Carewe)"]}, {"page": "I Cover the Waterfront", "response": ["I Cover the Waterfront is a 1933 American Pre-Code romantic drama film directed by James Cruze and starring Ben Lyon, Claudette Colbert, Ernest Torrence, and Hobart Cavanaugh.", "San Diego Standard reporter H. Joseph Miller (Ben Lyon) has been covering the city's waterfront for the past five years and is fed up with the work. He longs to escape the waterfront life and land a newspaper job back East so he can marry his Vermont sweetheart. Miller is frustrated by the lack of progress of his current assignment investigating the smuggling of Chinese into the country by a fisherman named Eli Kirk (Ernest Torrence). One morning after wasting a night tracking down bad leads, his editor at the Standard orders him to investigate a report of a girl swimming naked at the beach. There he meets Julie Kirk (Claudette Colbert), the daughter of the man he's been investigating.", "* Ernest Torrence as Eli Kirk, Julie's father ", "In his review for The New York Times, film critic Mordaunt Hall called the film \"a stolid and often grim picture\". While Hall felt the drama was not as good as some of director James Cruze's previous work, the \"clever acting of the principals\"—especially that of Ernest Torrence—offset some of the film's shortcomings. Hall found some of the scenes \"more shocking than suspenseful\" and felt a broader adaptation of Max Miller's book may have been more interesting than the focus on the melodramatic series of incidents related to a sinister fisherman. While acknowledging that \"Colbert does well as Julie\", Hall did not find her convincing as a fisherman's daughter because she does not look the type. Hall reserved his highest praise for Ernest Torrence in his final screen performance. Torrence died on May 15, 1933, shortly after the film was completed.", "John Mosher of The New Yorker described the adaptation as a \"commonplace screen romance,\" but also praised the performance of the late Torrence, writing that he \"was at the height of his power ... One can foresee that many pictures will be empty things for lack of him.\" Variety called it \"a moderately entertaining picture ... The late Ernest Torrence has the meat part and his performance is in keeping with the standard he had set for himself. A pretty tough assignment they gave him, one in which it was necessary to capture sympathy in face of the worst sort of opposition from the script. He'll be sorely missed on the screen.\""]}, {"page": "Across to Singapore", "response": ["In 1857, Joel Shore (Ramon Novarro), the carefree youngest son of a seafaring family, has a flirtatious friendship with Priscilla Crowninshield (Joan Crawford), and he eventually falls in love with her.  However, unbeknownst to him, Priscilla has been betrothed to Joel's much older brother, Mark (Ernest Torrence). The wedding is announced in church as a surprise, and Joel and Priscilla are both shocked, with Priscilla refusing to kiss her new husband after the ceremony.", "*Ernest Torrence - Captain Mark Shore"]}, {"page": "List of American films of 1930", "response": ["|Call of the Flesh||Charles Brabin||Ramón Novarro, Dorothy Jordan, Ernest Torrence||Musical/Romance/Drama||MGM. In partial Technicolor. ", "| Officer O'Brien || Tay Garnett || William Boyd, Ernest Torrence, Dorothy Sebastian || Crime || Pathe Exchange", "|Sweet Kitty Bellairs||Alfred E. Green||Claudia Dell, Walter Pidgeon, Ernest Torrence||Musical drama||Warner Bros."]}, {"page": "List of American films of 1931", "response": ["|Fighting Caravans || Otto Brower, David Burton || Gary Cooper, Lili Damita, Ernest Torrence || Western || Paramount", "|Sporting Blood || Charles Brabin || Clark Gable, Madge Evans, Ernest Torrence || Sports || MGM"]}, {"page": "List of American films of 1932", "response": ["| Hypnotized || Mack Sennett || Charles Murray, Ernest Torrence, Wallace Ford || Comedy || Sono Art"]}, {"page": "List of American films of 1933", "response": ["|I Cover the Waterfront||James Cruze||Claudette Colbert, Ben Lyon, Ernest Torrence||Drama|| United Artists"]}, {"page": "List of American films of 1921", "response": ["|Tol'able David||Henry King || Richard Barthelmess, Gladys Hulette, Ernest Torrence||Drama || First National"]}, {"page": "List of American films of 1922", "response": ["|Broken Chains || Allen Holubar || Colleen Moore, Malcolm McGregor, Ernest Torrence || Drama || Goldwyn"]}, {"page": "List of American films of 1923", "response": ["| The Brass Bottle || Maurice Tourneur || Harry Myers, Ernest Torrence || Comedy || First National", "| Ruggles of Red Gap || James Cruze || Edward Everett Horton, Ernest Torrence, Lois Wilson || Western || Paramount", "| West of the Water Tower || Rollin S. Sturgeon || Glenn Hunter, May McAvoy, Ernest Torrence || Comedy || Paramount"]}, {"page": "List of American films of 1924", "response": ["|The Fighting Coward || James Cruze || Ernest Torrence, Mary Astor || Comedy || Paramount", "|The Heritage of the Desert || Irvin Willat || Bebe Daniels, Ernest Torrence, Noah Beery || Western || Paramount", "|North of 36 || Irvin Willat || Jack Holt, Ernest Torrence, Lois Wilson || Western || Paramount", "|Peter Pan||Herbert Brenon, Glen Castle||Betty Bronson, Ernest Torrence, Virginia Browne Faire ||Fantasy, Family || Paramount", "|The Side Show of Life || Herbert Brenon || Ernest Torrence, Anna Q. Nilsson || Drama || Paramount"]}, {"page": "List of American films of 1925", "response": ["|The Dressmaker from Paris|| Paul Bern || Leatrice Joy, Ernest Torrence || Romantic comedy || Paramount"]}, {"page": "List of American films of 1926", "response": ["|The Lady of the Harem || Raoul Walsh || Ernest Torrence, Greta Nissen, Louise Fazenda || Adventure || Paramount", "|Mantrap|| Victor Fleming || Clara Bow, Percy Marmont, Ernest Torrence || Romantic comedy ||Paramount", "|The Rainmaker||Clarence G. Badger|| William Collier Jr., Georgia Hale, Ernest Torrence||Drama|| Paramount"]}, {"page": "List of American films of 1929", "response": ["| The Bridge of San Luis Rey || Charles Brabin || Lili Damita, Ernest Torrence || Historical || MGM", "| Desert Nights || William Nigh || John Gilbert, Ernest Torrence || Melodrama || MGM"]}, {"page": "Twelve Miles Out", "response": ["* Ernest Torrence as Red McCue"]}, {"page": "Sporting Blood (1931 film)", "response": ["Sporting Blood is a 1931 American MGM sports drama film directed by Charles Brabin. The film stars Clark Gable (in his first starring role), Ernest Torrence, and Madge Evans. Two other pictures bore this same title, one released in 1916 by Fox and another by MGM in Sporting Blood (1940). Although they, too, centered on horse racing, none of the plots had any direct connection with the others.", "* Ernest Torrence as Mr. Jim Rellence"]}]}}