{"wiki_id": "http://www.wikidata.org/entity/Q281661", "itemLabel": "Robert Morison", "itemDescription": "British botanist (1620-1683)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Morison", "wikipedia_page": {"main": "Robert Morison (1620 – 10 November 1683) was a Scottish botanist and taxonomist. A forerunner of John Ray, he elucidated and developed the first systematic classification of plants.\n\n", "link_mentions": [{"page": "Apiaceae", "response": ["Apiaceae was first described by John Lindley in 1836.Lindley, J. (1836) An Introduction to the Natural System of Botany, 2nd Edition. Longman, London. The name is derived from the type genus Apium, which was originally used by Pliny the Elder circa 50 AD for a celery-like plant. The alternative name for the family, Umbelliferae, derives from the inflorescence being generally in the form of a compound umbel. The family was one of the first to be recognized as a distinct group in Jacques Daleschamps' 1586 Historia generalis plantarum. With Robert Morison's 1672 Plantarum umbelliferarum distribution nova it became the first group of plants for which a systematic study was published."]}, {"page": "Aberdeen", "response": ["* Robert Morison (1620 – 1683), a Scottish botanist and taxonomist. He elucidated and developed the first systematic classification of plants. Gained his Master of Arts from the University of Aberdeen at the age of eighteen. For ten years Director of Louis XIV's royal gardens at Blois, France, then physician, botanist & superintendent of all royal gardens for Charles II of Scotland."]}, {"page": "1620", "response": ["** Robert Morison, Scottish botanist and taxonomist (d. 1683)"]}, {"page": "1683", "response": ["** Robert Morison, Scottish botanist and taxonomist (b. 1620)"]}, {"page": "List of botanists", "response": ["*Robert Morison"]}, {"page": "Historia Plantarum", "response": ["* Historia Plantarum Universalis Oxoniensis, unfinished work by Robert Morison, first volume published in 1680, second volume completed by Jacob Bobart the Younger and published in 1699"]}, {"page": "An Essay Towards a Real Character, and a Philosophical Language", "response": ["Robert Morison's criticism of Ray's work began a prolonged dispute between the two men."]}, {"page": "1683 in science", "response": ["** Robert Morison, Scottish botanist (born 1620)"]}, {"page": "1680 in science", "response": ["* Robert Morison publishes Plantarum Historiae Universalis Oxoniensis, Pars Secunda, seu Herbarum Distributio Nova per Tabulas Cognationis et Affinitatis ex Libro Naturae observata et detecta, utilising his method of taxonomy."]}, {"page": "1620 in science", "response": ["* Robert Morison, Scottish botanist and taxonomist (died 1683)"]}, {"page": "1672 in science", "response": ["* Robert Morison publishes Plantarum Umbelliferarum Distributio Nova, per Tabulas Cognationis et Affinitatis, ex Libra Naturae observata et detecta, the first monograph devoted to a specific group of plants, the Umbelliferae."]}, {"page": "1669 in science", "response": ["* Robert Morison publishes Praeludia Botanica, emphasising use of the structure of a plant's fruits for its classification."]}, {"page": "Monograph", "response": ["The first-ever monograph of a plant taxon was Robert Morison's 1672 Plantarum Umbelliferarum Distributio Nova, a treatment of the Apiaceae."]}, {"page": "Scolymus", "response": ["In 1576 Carolus Clusius describes Scolimus Theophrasti (= S. hispanicus). In 1601 he extends the genus to three taxa, Scolymus Theophrasti Hispan. (= S. hispanicus subsp. hispanicus), S. Theophrasti Narbonensis (= S. maculatus), and Scolymus Dioscor. Castos Theophrasti (= S. grandiflorus). Rembert Dodoens in 1583 and Francesco Cupani  in 1713 introduce the name Carduus Chrysanthemus (for S. maculatus),  while in Johann Bauhin’s posthumously published great work, Historia plantarum universalis (1650-51), it is called Spina lutea,  and Robert Morison in 1699 referred to S. hispanicus as Cichorium luteum. Since all of these names predate the start of the Linnean nomenclature in 1753, neither of these were valid. In 1753 Carl Linnaeus referred to the description Joseph Pitton de Tournefort made in 1700, providing the valid scientific name Scolymus."]}, {"page": "John Banister (naturalist)", "response": ["John Baptist Banister (1654 – May 1692) was an English clergyman and one of the first university-trained naturalists in North America. His primary focus was botany but he also studied insects and molluscs. He was sent out as a missionary chaplain by the garden-loving Bishop Henry Compton,Banister's letter to Dr Robert Morison, 6 April 1679, dated from The Falls, a palisadoed place of William Byrd's on the James River, gratefully mentions Bishop Compton as having recommended Banister to \"Lord Culpeper\", Governor of Virginia. (Leighton 1976:84).  with whom he soon established a correspondence. Banister was first in Barbados in the West Indies and then by April 1679His letter to Morison, 6 April 1679. in Virginia, where, while serving a rector of the parish of Charles City he became one of Bishop Compton's most energetic plant collectors, \"the first Virginia botanist of any note\".C.R. Williams, \"Dr. John Dunn as a Virginia Botanist\", William and Mary College Quarterly Historical Magazine, 15.2 (April 1935); biographical accounts of Banister are in Ann Leighton, American Gardens in the Eighteenth Century: 'For Use or for Delight'  (1986:79ff) and Ronald H. Petersen New World Botany: Columbus to Darwin (2001:208ff).", "Banister matriculated at Magdalen College, Oxford, where he could see and study the American plants grown from seed in the Oxford Physic Garden under the care of Dr. Robert Morison.Petersen 2001:208) From Virginia, his first letter to Dr Morison at the Oxford Physic Garden was dated 1679: in it he listed the bounty of American oaks that would supplement Britain's impoverished flora:The only oaks native to Britain are the pedunculate oak, Quercus robur, and the sessile oak, Q. petraea dwarf, black, white, red, Spanish, chestnut, live or willow, shrubby.List in Ann Leighton, American Gardens in the Eighteenth Century: 'For Use or for Delight'  (1986:81). The historian of American gardens Ann Leighton surmises that Banister's list of Virginian timber trees provided some of the material for John Evelyn's list of desirable plants of Virginia and New England, intended to be given to a captain sailing for New England.Ann Leighton 1976:79 gives Evelyn's list; she notes (p.80) that Evelyn employs Banister's spelling of both \"Piekhickeries\" and \"Maple tree bearing keys of crimson color\". Once settled in Virginia, where he purchased a tract of  on the Appomattox River in 1689/90, he established a close friendship with William Byrd of Westover, an influential Virginia planter with botanical connections in London.Byrd had sent seeds and plants to a certain Mr Methwold in London, according to Ronald Petersen 2001:209. By 1692 Banister had become a substantial figure in Virginia, one of the founders of the College of William & Mary in Williamsburg that year; Bishop Compton was on the college's board of overseers."]}, {"page": "Robert Morrison", "response": ["* Robert Morison (1620–1683), Scottish botanist"]}, {"page": "Morison", "response": ["* Robert Morison (1620–1683), Scottish botanist"]}, {"page": "List of Aberdonians", "response": ["*Robert Morison (1620–1683), botanist and taxonomist"]}, {"page": "Nerine", "response": ["The first description was in 1635 by French botanist Jacques-Philippe Cornut, who examined Narcissus japonicus rutilo flor (N. sarniensis), a plant he found in the garden of the Paris nurseryman, Jean Morin in October 1634. In 1680 Scottish botanist Robert Morison gave an account of a shipment from Japan being washed ashore. In 1725 James Douglas FRS published an account in his A Description of the Guernsey Lilly, as it was known then. Douglas gave it the Latin name Lilio-Narcissus Sarniensis Autumno florens. Linnaeus called this Amaryllis sarniensis in 1753, after Douglas' usage, one of nine species he assigned to this genus."]}, {"page": "Francis Wall Oliver", "response": ["He edited a book titled Makers of British Botany which contained biographies of British botanists Robert Morison, John Ray, Nehemiah Grew, Stephen Hales, John Hill, Robert Brown, William Hooker, John Stevens Henslow, John Lindley, William Griffith, Arthur Henfrey, William Henry Harvey, Miles Joseph Berkeley, Joseph Henry Gilbert, William Crawford Williamson, Harry Marshall Ward and Joseph Dalton Hooker."]}, {"page": "Morrison (surname)", "response": ["*Robert Morison (1620–1683), Scottish botanist"]}, {"page": "Nicolas Robert", "response": ["* Robert Morison a Scottish botanist by whom it is believed that Robert was first prompted to take an interest in scientific botanic illustration."]}, {"page": "List of florilegia and botanical codices", "response": ["* 1669 London Hortus Regius Blesensis Robert Morison (1620–1683)", "* 1672 Oxford Plantarum Umbelliferum Robert Morison (1620–1683)", "* 1680 Oxford Historia plantarum universalis Oxoniensis Robert Morison (1620–1683)"]}, {"page": "1620s in Scotland", "response": ["* January 1 – Robert Morison, botanist and taxonomist (died 1683)"]}, {"page": "Robert Morison (botanist)", "response": ["#REDIRECT Robert Morison"]}, {"page": "George Wheler (travel writer)", "response": ["In October 1673 he set out for a tour in France, Switzerland, and Italy, and was at first accompanied by George Hickes, his tutor at Lincoln College. While in Italy he received some instruction in antiquities from Jean-Foy Vaillant; and at Venice, in June 1675, met Jacob Spon, with whom he travelled in Greece and the Levant in 1675 and 1676. Spon published a separate account of the journey in 1678 Voyage d'Italie, de Dalmatie, de Grèce, &c., Lyons. Wheler's account, A Journey into Greece, was published in 1682. Among the places visited and described by Wheler were Zante, Delos, Constantinople, Prusa ad Olympum, Thyatira, Ephesus, Delphi, Corinth, and Attica. He brought home marbles and inscriptions from Athens, which he donated to the University of Oxford in 1683 and are now kept in the Ashmolean Museum. He made considerable use of coins in his book, and paid attention to botany. He brought home plants that had not been cultivated in Britain, including a Hypericum. The botanists John Ray, Robert Morison, and Leonard Plukenet received rare plants from Wheler."]}, {"page": "Jacob Bobart the Younger", "response": ["Bobart was the younger son of Jacob Bobart. He was born at Oxford, and succeeded his father as superintendent of the Physic Garden, and on the death of Dr. Robert Morison in 1683, lectured as botanical professor. In 1699 he brought out the third part of Morison's Historia Plantarum, the second having been issued during the writer's life in 1680, whilst the first was never printed. In Zachary Grey's Notes on Hudibras occurs the following:"]}, {"page": "John Savage (engraver)", "response": ["Savage etched plates of Marcellus Laroon's Cries of London for the publisher Pierce Tempest. Only two – The Merry Fiddler and The London Quaker – bear Savage's signature but Antony Griffiths, the former Keeper of the Department of Prints and Drawings at the British Museum, attributes all 72 of the series to him. He also engraved illustrations to Thomas Guidott's De Thermis Britannicis, 1691, John Strype's Memorials of Cranmer, 1694, Leonard Plukenet's Phytographia, vol. ii. 1696, John Evelyn's Numismata, 1697, and Robert Morison's Plantarum Historia, vol. iii. 1699.  A pack of mathematical playing cards, published by Thomas Tuttell, was engraved by him from designs by François Boitard."]}, {"page": "List of botanists by author abbreviation (M)", "response": ["* Morison – Robert Morison (1620–1683)"]}, {"page": "Fielding-Druce Herbarium", "response": ["It was established in 1621, they include the oldest herbarium in the United Kingdom and the fourth oldest herbarium in the world. Collectively, they hold approximately 1,000,000 botanical specimens (including at least 35,000 types) from across all taxonomic groups and geographic regions. Four of the more significant pre-19th century herbaria are those of Robert Morison, William Sherard, Johannus Dillenius and John Sibthorp. The earliest collected plant specimens dates back to around 1606.", "* Robert Morison (1620-83); who became the first professor of botany in 1669, a post that he held until 1683. He had written several books on Botany."]}, {"page": "1683 in Scotland", "response": ["* 10 November – Robert Morison, botanist and taxonomist (born 1620)"]}, {"page": "Les Vélins du Roi", "response": ["In 1645 Nicolas Robert was invited to the Chateau de Blois by Gaston, Duke of Orléans, brother of King Louis XIII. Gaston founded a botanic garden at Blois and cultivated a wealth of rare plants. The director of the gardens, Scottish botanist Robert Morison, is believed to have inspired Robert to illustrate the resident plants. Following Gaston's death in 1660, the collection of vellums was left to his nephew, Louis XIV, who lodged them at the Jardin des Plantes in Paris. Robert carried on in the service of the King and continued his plant illustrations. The collection was further enlarged during the eighteenth and nineteenth centuries with works by other renowned artists, such as Pierre-Joseph Redouté. After the French Revolution of 1789, additions to the collection focused largely on wildlife. "]}]}}