{"wiki_id": "http://www.wikidata.org/entity/Q28155259", "itemLabel": "Sara Vickers", "itemDescription": "actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Sara_Vickers", "wikipedia_page": {"main": "Sara Louise Vickers (born 1985) is a British theatre, television and film actress best known for playing Joan Thursday in the British television detective drama series Endeavour.", "link_mentions": [{"page": "List of Watchmen characters", "response": ["| Sara Vickers", "| Sara Vickers", "Mrs. Crookshanks (portrayed by Sara Vickers) is a series of female clones that serve Adrian Veidt on Europa. They were cloned from the original Mrs. Crookshanks that knew a younger Jon Osterman. When one clone dies, their bodies would be made use of by Veidt and a new clone will be grown in their place."]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Sara Vickers (BA Acting 2010)"]}, {"page": "Curtis Brown (agency)", "response": ["*Sara Vickers, Theatre, TV and film actress and voiceover artist, best known for playing Joan Thursday in the British television detective drama series Endeavour\"Sara Vickers\", Curtis Brown. Retrieved 2 January 2019 "]}, {"page": "Ian Charleson Awards", "response": ["*Sara Vickers, for Annabella in 'Tis Pity She's a Whore (West Yorkshire Playhouse)"]}, {"page": "Endeavour (TV series)", "response": ["| Sara Vickers"]}, {"page": "Privates (TV series)", "response": ["* Sara Vickers as Connie Charles"]}, {"page": "Shetland (TV series)", "response": ["*Sara Vickers as Leanne Randall"]}, {"page": "Sunshine on Leith (film)", "response": ["* Sara Vickers as Eilidh"]}, {"page": "Dark Road (play)", "response": ["| align=\"center\" colspan=\"1\"|Sara Vickers"]}, {"page": "Vickers (surname)", "response": ["*Sara Vickers (born 1985), Scottish actress "]}, {"page": "List of Endeavour characters", "response": ["Joan Thursday is Inspector Thursday's daughter. She is in her early to mid-twenties and works at a bank in Oxford. She is portrayed by Sara Vickers."]}, {"page": "Watchmen (TV series)", "response": ["Watchmen is an American superhero drama limited series based on the 1986 DC Comics series of the same title, created by Alan Moore and Dave Gibbons. The TV series was created for HBO by Damon Lindelof, who also served as an executive producer and writer. Its ensemble cast includes Regina King, Don Johnson, Tim Blake Nelson, Yahya Abdul-Mateen II, Andrew Howard, Jacob Ming-Trent, Tom Mison, Sara Vickers, Dylan Schombing, Louis Gossett Jr. and Jeremy Irons. Jean Smart and Hong Chau joined the cast in later episodes.", "* Sara Vickers as Ms. Crookshanks, a series of female clones of the original Mrs. Crookshanks created by Doctor Manhattan to serve as Veidt's servants.", "On May 23, 2018, it was announced that Regina King, Don Johnson, Tim Blake Nelson, Louis Gossett Jr., Adelaide Clemens, and Andrew Howard had joined the cast of the pilot. At least one of the actors was expected to have been cast in a potentially recurring role. In June 2018, it was reported that Jeremy Irons, Tom Mison, Frances Fisher, Jacob Ming-Trent, Yahya Abdul-Mateen II, and Sara Vickers had been cast in the pilot. On August 7, 2018, it was announced that Dylan Schombing, Adelynn Spoon, and Lily Rose Smith had joined the pilot's cast. In November 2018, it was reported that Jean Smart had been cast in a starring role and that James Wolk would appear in a recurring capacity. Additionally, it was confirmed that Irons would portray Adrian Veidt / Ozymandias, that Nelson would portray a newly devised character named Looking Glass, and that Vickers and Mison would join the cast. In January 2019, it was announced that Hong Chau and Dustin Ingram had been cast in recurring roles."]}, {"page": "Martial Feats of Comanche Horsemanship", "response": ["The episode includes a full-frontal nude shot of one of the Phillips clones playing Doctor Manhattan, who was frequently shown nude in the limited series comic as well as with the film adaption. A body double was used for this shot instead of actor Tom Mison who plays Phillips. Showrunner Damon Lindelof said that he had expected to show a fully nude Doctor Manhattan at some point during the series. He said that the showing of Doctor Manhattan's blue penis was an iconic part of the limited series and film, and said that when his friends and associates heard he got the showrunner role, they had all asked him \"Are we going to see a blue penis?\" However, Lindelof considered to himself \"Was there a way to do this with some degree of absurdity and comedy, while at the same time acknowledging the source material?\", and came onto the idea of using the fictional play, The Watchmaker's Son, as an appropriate vehicle for this shot. The play itself was designed to be like a high-school play similar to the one in Rushmore, but using directing elements similar to a Wes Anderson film. According to Mison, he and Sara Vickers who plays Ms. Crookshanks purposely acted poorly for their on-stage roles in the play to keep up the element of poor quality."]}, {"page": "Guilt (British TV series)", "response": ["* Sara Vickers as Erin", "* Sara Vickers as Erin", "A second series of Guilt was confirmed by the BBC in July 2020, and filming began in Scotland in November 2020.  New cast members included Phyllis Logan, Sara Vickers, Stuart Bowman and Iain Pirie. The second series was directed by Patrick Harkins."]}, {"page": "Connect (film)", "response": ["* Sara Vickers as Debbie"]}]}}