{"wiki_id": "http://www.wikidata.org/entity/Q281306", "itemLabel": "H. Briggs", "itemDescription": "British tennis player", "wikipedia_url": "https://en.wikipedia.org/wiki/H._Briggs", "wikipedia_page": {"main": "H. Briggs (given name unknown) was a British tennis player residing in Paris, France.\nBriggs won the singles event of the inaugural Amateur French Championships in 1891 which took place on the grounds of the Cercle des Sport de l'Île de Puteaux. In the final he defeated P. Baigneres in straight sets. As a member of the Club Stade Français, he was entitled to participate in the tournament, which until 1925 was open only to tennis players who were members of French clubs.", "link_mentions": [{"page": "French Open", "response": ["In 1891 the Championnat de France, which is commonly referred to in English as the French Championships, began. This was only open to tennis players who were members of French clubs. The first winner was H. Briggs, a Briton who resided in Paris and was a member of the Club Stade Français. In the final he defeated P. Baigneres in straight sets. The first women's singles tournament, with four entries, was held in 1897. The mixed doubles event was added in 1902 and the women's doubles in 1907. In the period of 1915–1919, no tournament was organized due to World War I. This tournament was played until 1924, using four venues:"]}, {"page": "1891 in sports", "response": ["* French Men's Singles Championship – H. Briggs (GB) defeats P. Baigneres 6–3 6–2"]}, {"page": "List of French Open men's singles champions", "response": ["The French Open was established in 1891 and was originally known as the French Championships. The tournament was only open to French players or foreign players who were a member of a French club during the first 34 years of its existence. The first winner of the Championship was the British player H. Briggs, a member of Club Stade Français which entitled him to compete. Records show matches were played as the best-of-three sets format until 1902 or 1903, when best-of-five sets was adopted. French players were dominant in the early stages of the tournament, in particular Max Decugis, who won eight titles before the outbreak of the First World War. "]}]}}