{"wiki_id": "http://www.wikidata.org/entity/Q282340", "itemLabel": "Cassie Jackman", "itemDescription": "British squash player", "wikipedia_url": "https://en.wikipedia.org/wiki/Cassie_Jackman", "wikipedia_page": {"main": "Cassie Jackman (born 22 December 1972 and competing in some years as Cassie Campion) is a former English squash player who won the World Open in 1999. She was England's leading player throughout much of the 1990s and early 21st century. She retired due to a recurring back injury in December 2004.", "link_mentions": [{"page": "Carol Owens (squash player)", "response": ["| bgcolor=\"98FB98\" | Winner || 2003 Women's World Open Squash Championship || Hong Kong ||  Cassie Jackman || 3–9, 9–2, 9–7, 9–3"]}, {"page": "Sarah Fitz-Gerald", "response": ["She won numerous titles in the early 1990s, but 1996 proved to be her breakthrough year. She beat England's Cassie Jackman in the World Open Final. The next two years she beat the resurgent Michelle Martin in successive finals.", "|  Cassie Jackman", "|  Cassie Jackman", "|  Cassie Jackman"]}, {"page": "Michelle Martin", "response": ["She spent 44 months as the best women's squash player in the world from March 1993 to October 1996 before Cassie Jackman of England broke her dominance; she was also ranked number one in the world in 1998 and 1999. She won three consecutive World Open championships from 1993 to 1995, and was a finalist in all the World Opens from 1992 to 1999 except 1996; she also won six consecutive British Opens from 1993 to 1998. She represented her country at the 1996 and 1999 Squash World Cups, and won gold medals in the sport at the 1998 Kuala Lumpur Commonwealth Games in the women's singles and mixed doubles. She also won the Australian Open in 1991, 1993, 1994, 1995, 1996, 1998, and 1999. At the end of 1999 she announced her retirement, saying she had achieved all her goals in the sport. She worked as a manager and coach of the Australian women's junior and senior teams from 2003 to 2010.", "| bgcolor=\"98FB98\" | Winner || 1994 Women's World Open Squash Championship || Saint Peter Port, Guernsey ||  Cassie Jackman || 9–1, 9–0, 9–6"]}, {"page": "World Squash Championships", "response": ["|  Martine Le Moignan Cassie Jackman", "|  Cassie Jackman", "|  Cassie Jackman Fiona Geaves", "|  Cassie Jackman", "|  Cassie Jackman", "* Cassie Jackman was also known as Cassie Campion"]}, {"page": "Prince Sports", "response": ["*  Cassie Jackman"]}, {"page": "Nicol David", "response": ["David was the losing finalist twice in 2003, losing to the more experienced Cassie Jackman on her home ground and then to Linda Elriani in the Monte Carlo Classic in November. She reached the semi-final of the World Open in Hong Kong, losing to Cassie Jackman with a score of 9–6, 9–3, 9–4 in the final. David did not perform well in the other major WISPA events; she was eliminated in the first round of the Carol Weymuller US Open, in the British Open and in the Texas Open. In the Qatar Classic Open, David lost in the second round to Natalie Grinham with a score of 9–2, 7–9, 9–0 and 9–4.", "|  Cassie Jackman", "|  Cassie Jackman", "|   bgcolor=\"ffa07a\" | Runner-up || 2003 ||    Cassie Jackman   || 5–9, 9–1, 4–9, 7–9"]}, {"page": "Rachael Grinham", "response": ["The first half of 2002 did not go well for Rachael until she beat England's Tania Bailey for the Singapore Open. One month later she took the Credit Suisse Privilege Ladies Open, one of the finest squash tournaments in the world beating Natalie Grainger. Rachael and Natalie had won a women's doubles bronze medal at the 2002 Commonwealth Games. She climbed to No. 6 in the world by the end of the year. At the beginning of 2003, she claimed the Vassar College Class of 1932 beating Vicky Botwright. She reached two finals in Helioplis Open and Hurghada International in Egypt but lost both to former world No. 1 and retired player, Carol Owens. Arguably, the 2003 British Open was the turning point for the 29-year-old, who pulled off a semi-final upset over the top seed, Carol Owens, then the World No. 1, before beating Cassie Jackman in the final to claim the title for the first time. She ended the year ranked No. 3 in the world.", "2004 was far the best year in Rachael's career. She has based herself in Cairo for a few years and it had proved to be a great place to hone her game. She may be slight in stature, but there is no doubting her tenaciousness, which saw her become world number one in August 2004. She started the year by claiming the Kuwait Open, the richest squash event in the world, by beating top seed Cassie Jackman. Later on, she beat Cassie Jackman again, then the World No. 1, for the Texas Open title. Three months later, she claimed the Hurghada International in Egypt which she lost last year beating local favourite, Omneya Abdel Kawy. She reached the final of Brunei International but lost to Vanessa Atkinson. After a series of successful tournament wins, Rachael became the world No. 1 in August after dethroning Cassie Jackman. She continued her run by beating Cassie Jackman again for the Bahrain Classic Title. She retained her British Open title by beating Natalie Grainger. She lost again to Vanessa Atkinson in the final of the Qatar Classic Open. At the World Doubles Squash Championships, Rachael won the women's doubles title in 2004 (partnering Natalie), and the mixed doubles title in 2004 (partnering David Palmer). She ended the year ranked No. 1.", "|  Cassie Jackman", "|  Cassie Jackman", "|  Cassie Jackman", "|  Cassie Jackman"]}, {"page": "England at the 2002 Commonwealth Games", "response": [":Tania Bailey & Cassie Jackman, women's doubles", ":Cassie Jackman, women's singles"]}, {"page": "England at the 1998 Commonwealth Games", "response": ["|Cassie Jackman                              ||singles, doubles||1 x gold, 1 x bronze"]}, {"page": "Campion (surname)", "response": ["* Cassie Jackman (born 1972), English squash player, also known as Cassie Campion"]}, {"page": "United States Open (squash)", "response": ["| 2003 || Cassie Jackman || Carol Owens", "| 1999 || Cassie Jackman || Michelle Martin", "| 1997 || Cassie Jackman || Sabine Schöne", "| 1993 || Cassie Jackman || Suzanne Horner"]}, {"page": "Squash in Ireland", "response": ["| 2003 || Vanessa Atkinson || Cassie Jackman || 3–9, 9–4, 9–5, 4–9, 9–7", "2003 marked the first Women's Irish Open since 1991, where Cassie Jackman - the 2003 losing finalist - reached the semi-finals."]}, {"page": "Cassie", "response": ["* Cassie Jackman (born 1972), English squash player"]}, {"page": "Official Women's Squash World Ranking", "response": ["|6|| Cassie Jackman || January 2000 || 16", "|February|| Leilani Rorani|| Sarah Fitz-Gerald|| Sarah Fitz-Gerald|| Cassie Jackman", "|March|| Leilani Rorani|| Sarah Fitz-Gerald|| Carol Owens|| Cassie Jackman", "|April|| Leilani Rorani|| Sarah Fitz-Gerald|| Carol Owens|| Cassie Jackman", "|May|| Leilani Rorani|| Sarah Fitz-Gerald|| Carol Owens|| Cassie Jackman", "|June|| Leilani Rorani|| Sarah Fitz-Gerald|| Natalie Grainger|| Cassie Jackman", "|July|| Leilani Rorani|| Sarah Fitz-Gerald|| Carol Owens|| Cassie Jackman", "|January|| Sarah Fitz-Gerald|| Sarah Fitz-Gerald|| Michelle Martin|| Cassie Jackman", "|March|| Sarah Fitz-Gerald|| Sarah Fitz-Gerald|| Michelle Martin|| Cassie Jackman", "|May|| Sarah Fitz-Gerald|| Sarah Fitz-Gerald|| Michelle Martin|| Cassie Jackman", "|July|| Sarah Fitz-Gerald|| Sarah Fitz-Gerald|| Michelle Martin|| Cassie Jackman", "|September|| Sarah Fitz-Gerald|| Sarah Fitz-Gerald|| Michelle Martin|| Cassie Jackman", "|2|| Cassie Jackman||955.026|| Cassie Jackman||1783.053|| Rachael Grinham||1817.368", "|4|| Sarah Fitz-Gerald||912.500|| Cassie Jackman||913.688|| Linda Elriani||972.688", "|8|| Cassie Jackman||741.250|| Rachael Grinham||693.222|| Cassie Jackman||848.750", "|3|| Cassie Jackman|| Cassie Jackman||1128.750|| Linda Elriani||988.111", "|8|| Liz Irving|| Carol Owens||544.722|| Cassie Jackman||741.250", "|3|| Cassie Jackman|| Liz Irving|| Cassie Jackman", "|6|| Carol Owens|| Cassie Jackman|| Liz Irving"]}, {"page": "British Junior Open Squash", "response": ["| 1988 || style=\"background: #ececec; color: grey; text-align: center\" class=\"table-na\" | tournament not created ||  Cassie Jackman ||  Donna Vardy", "| 1990 || style=\"background: #ececec; color: grey; text-align: center\" class=\"table-na\" | tournament not created ||  Sabine Schoene ||  Cassie Jackman", "| 1991 ||  Stephanie Brind ||  Jenny Tranfield ||  Cassie Jackman"]}]}}