{"wiki_id": "http://www.wikidata.org/entity/Q282397", "itemLabel": "Kenney Jones", "itemDescription": "drummer", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenney_Jones", "wikipedia_page": {"main": "Kenneth Thomas Jones (born 16 September 1948) is an English drummer best known for his work in the groups Small Faces, Faces, and the Who. Jones was inducted into the Rock and Roll Hall of Fame in 2012 as a member of Small Faces/Faces.\n\n", "link_mentions": [{"page": "Keith Moon", "response": ["Townshend persuaded Daltrey and Entwistle to carry on touring as The Who, although he later said that it was his means of coping with Moon's death and \"completely irrational, bordering on insane\". AllMusic's Bruce Eder said, \"When Keith Moon died, the Who carried on and were far more competent and reliable musically, but that wasn't what sold rock records.\" In November 1978, Faces drummer Kenney Jones joined the Who. Townshend later said that Jones \"was one of the few British drummers who could fill Keith's shoes\"; Daltrey was less enthusiastic, saying that Jones \"wasn't the right style\". Keyboardist John \"Rabbit\" Bundrick, who had rehearsed with Moon earlier in the year, joined the live band as an unofficial member."]}, {"page": "September 16", "response": ["*  1948   – Kenney Jones, English drummer"]}, {"page": "The Who", "response": ["Kenney Jones replaced Moon and the group resumed touring, and released a film adaptation of Quadrophenia and the retrospective documentary The Kids Are Alright. After Townshend became weary of the group, they split in 1983. The Who occasionally re-formed for live appearances such as Live Aid in 1985, a 25th anniversary tour in 1989 and a tour of Quadrophenia in 1996–1997. A full reunion began in 1999, with drummer Zak Starkey. After Entwistle's death in 2002, plans for a new album were delayed until 2006, with Endless Wire.  Since Entwistle's death, the Who have continued to perform and tour, most commonly with Starkey on drums, Pino Palladino on bass, and Pete's brother Simon Townshend on second guitar and backing vocals. In 2019, the group released the album Who and toured with a symphony orchestra.", "By 1974, work had begun in earnest on a Tommy film. Stigwood suggested Ken Russell as director, whose previous work Townshend had admired. The film featured a star-studded cast, including the band members. David Essex auditioned for the title role, but the band persuaded Daltrey to take it. The cast included Ann-Margret, Oliver Reed, Eric Clapton, Tina Turner, Elton John and Jack Nicholson. Townshend and Entwistle worked on the soundtrack for most of the year, handling the bulk of the instrumentation. Moon had moved to Los Angeles, so they used session drummers, including Kenney Jones (who would later join the Who). Elton John used his own band for \"Pinball Wizard\". Filming was from April until August. 1500 extras appeared in the \"Pinball Wizard\" sequence.", "The day after Moon's death, Townshend issued the statement: \"We are more determined than ever to carry on, and we want the spirit of the group to which Keith contributed so much to go on, although no human being can ever take his place.\" Drummer Phil Collins, having a temporary break from Genesis after his first marriage had failed, was at a loose end and asked to replace Moon, but Townshend had already asked Kenney Jones, who had previously played with the Small Faces and Faces. Jones officially joined the band in November 1978. John \"Rabbit\" Bundrick joined the live band as an unofficial keyboardist. On 2 May 1979, the Who returned to the stage with a concert at the Rainbow Theatre, followed by the Cannes Film Festival in France and dates at Madison Square Garden in New York.", "* Kenney Jones – drums (1978–1983, 1985, 1988, 2014)"]}, {"page": "Stepney", "response": ["Others born in Stepney are entertainer Des O'Connor, actor Steven Berkoff, Steven Berkoff: The real East Enders, The Independent 4 January 2007 accessed 10 May 2007 playwright Arnold Wesker, gardener Rachel De Thame, television executive Alan Yentob, artist Frank Paton, drummer Kenney Jones, musician and writer Jah Wobble,Jah Wobble, Memoirs of a Geezer, p. 1. singer Kenny Lynch and his sister Maxine Daniels, singer Charles Coborn, footballers Ledley King, Ashley Cole, Mark Lazarus and Darren Purse, Heavyweight boxer \"Bombardier\" Billy Wells, former armed robber and businessman Roy Shaw, former British featherweight boxing champion Sammy McCarthy, sportswriter Norman Giller, and Labour politician Wes Streeting."]}, {"page": "Whitechapel", "response": ["* Kenney Jones, drummer"]}, {"page": "Jerry Lee Lewis", "response": ["Lewis returned to the pop charts with \"Me and Bobby McGee\" in 1971 and \"Chantilly Lace\" in 1972, and this turn of events, coupled with a revitalized public interest in vintage rock and roll, inspired Mercury to fly Lewis to London in 1973 to record with a cadre of gifted British and Irish musicians, including Rory Gallagher, Kenney Jones, and Albert Lee. By all accounts the sessions were tense. The remake of Lewis's old Sun cut \"Drinking Wine Spo-Dee-O-Dee\" would be the album's hit single, reaching number 20 on the Billboard country chart and peaking at number 41 on the pop chart. The Session would be Lewis's highest pop charting album since 1964's Golden Hits of Jerry Lee Lewis, hitting number 37. It did far better on the country albums chart, rising to number 4. Later that same year, he went to Memphis and recorded Southern Roots: Back Home to Memphis, a soul-infused rock album produced by Huey Meaux. According to Rick Bragg's authorized 2014 biography, \"the Killer\" was in a foul mood when he showed up at Trans Maximus Studios in Memphis to record: \"During these sessions, he insulted the producer, threatened to kill a photographer, and drank and medicated his way into but not out of a fog.\" During one exchange that can be heard on the 2013 reissue Southern Roots: The Original Sessions, Meaux asks Lewis, \"Do you wanna try one?\", meaning a take, to which Lewis replies, \"If you got enough fuckin' sense to cut it.\" Lewis was still pumping out country albums, although the hits were beginning to dry up. His last big hit with Mercury was \"Middle Age Crazy,\" which made it to number 4 in 1977."]}, {"page": "List of Rock and Roll Hall of Fame inductees", "response": ["|Kenney Jones, Ronnie Lane, Ian McLagan, Steve Marriott, Rod Stewart, and Ronnie Wood."]}, {"page": "Rod Stewart", "response": ["Mercury Records A&R man Lou Reizner had seen Stewart perform with Beck, and on 8 October 1968 signed him to a solo contract; but contractual complexities delayed Stewart's recording for him until July 1969.Nelson and Bangs, Rod Stewart, pp. 96–97, 100. Meanwhile, in May 1969, guitarist and singer Steve Marriott left English band The Small Faces. Ron Wood replaced him as guitarist in June and on 18 October 1969, Stewart followed his friend and became the band's new singer. The two joined existing members Ronnie Lane, Ian McLagan, and Kenney Jones, who soon decided to call the new line-up Faces."]}, {"page": "Live Aid", "response": ["The transatlantic broadcast from Wembley suffered technical problems and failed during The Who's performance of their opening song \"My Generation\", immediately after Roger Daltrey sang \"Why don't you all fade ...\" (the last word \"away\" was cut off when a blown fuse caused the Wembley stage TV feed to temporarily fail). The broadcast returned as the last verse of \"Pinball Wizard\" was played. John Entwistle's bass wouldn't work at the start, causing an awkward delay of over a minute before they could start playing. The band played with Kenney Jones on drums and it was their first performance since disbanding after a 1982 'farewell' tour. The Who's performance was described as \"rough but right\" by Rolling Stone, but they would not perform together again for another three years.Wilkerson, Mark (2006) Amazing Journey: The Life of Pete Townshend p.408. Retrieved 22 May 2011 At 32 minutes Elton John had the longest set on the day; his setlist included the first performance of \"Don't Let the Sun Go Down on Me\" with George Michael."]}, {"page": "Robin Gibb", "response": ["In January 2005, Gibb joined his brother Barry and several other artists under the name One World Project to record a charity single in aid of Asian tsunami relief, titled \"Grief Never Grows Old\". Other artists who performed on the single included Boy George, Steve Winwood, Jon Anderson, Rick Wakeman, Sir Cliff Richard, Bill Wyman, America, Kenney Jones, Chicago, Brian Wilson of The Beach Boys, Russell Watson and Davy Spillane. In June 2005, Gibb joined The X Factor runner up band G4 at a sell-out concert at the Royal Albert Hall in London, singing the Bee Gees song \"First of May\". In December 2005, a recordings of this performance was released as part of double A side single, credited as \"G4 feat Robin Gibb\" together with G4's cover version of the Johnny Mathis song \"When a Child is Born\". \"First of May\" also appeared on the platinum selling album G4 & Friends, which reached number 6 in the UK album charts. In the same year, Gibb presented master classes at Paul McCartney's Liverpool Institute for Performing Arts and oversaw the selection for release of thesis works by music graduates for the next two terms. On 20 February 2006, Gibb and Barry performed at a concert for Diabetes Research Institute of the University of Miami in Hollywood, Florida. This was their first joint performance since Maurice's death. In March 2006, Gibb announced plans for more solo concerts in Shanghai, China and Portugal."]}, {"page": "Roger Daltrey", "response": ["The Who continued after the death of their drummer Keith Moon in 1978, but tension continued to rise as Daltrey felt that new drummer Kenney Jones was the wrong choice. The Who broke up in 1983 when Townshend felt that he was no longer able to write for the band.", "McVicar was billed as a soundtrack album for the film of the same name, in which Daltrey starred and also co-produced. It featured all the other members of the Who at the time (Townshend, Entwistle, and Kenney Jones). McVicar included two hit singles, \"Free Me\", and \"Without Your Love\", which is Daltrey's best-selling solo recording."]}, {"page": "Tommy (The Who album)", "response": ["Townshend also oversaw the production of a soundtrack album, on which the unrecorded orchestral arrangements Kit Lambert had envisaged for the original Tommy LP were realised by the extensive use of synthesizer. He started work on the soundtrack album immediately after the Who's 1973 US tour in December, and worked on it almost continuously for the next four months. As well as the Who, the film's music track and the original soundtrack LP also employed several session musicians including Caleb Quaye, Ronnie Wood, Nicky Hopkins, Chris Stainton, and longtime Who associate John \"Rabbit\" Bundrick. Due to Keith Moon's commitments with the filming of Stardust, Kenney Jones (who would take over as the Who's drummer after Moon's death in 1978) played drums on much of the soundtrack album."]}, {"page": "Quadrophenia", "response": ["Quadrophenia was revived for a film version in 1979, directed by Franc Roddam. The film attempted to portray an accurate visual interpretation of Townshend's vision of Jimmy and his surroundings, and included Phil Daniels as Jimmy and Sting as the Ace Face. Unlike the Tommy film, the music was largely relegated to the background, and was not performed by the cast as in a rock opera. The film soundtrack included three additional songs written by Townshend, which were Kenney Jones' first recordings as an official member of the Who. The film was a commercial and critical success, as it conveniently coincided with the mod revival movement of the late 1970s."]}, {"page": "1979 in music", "response": ["* May 2 – The Who play their first concert following the death of drummer Keith Moon. The band performs with new drummer Kenney Jones at London's Rainbow Theatre."]}, {"page": "1988 in music", "response": ["*February 8 – Kenney Jones would last perform as the drummer for The Who at the British Phonographic Industry awards ceremony, where the band received the Lifetime Achievement Award."]}, {"page": "1948 in music", "response": ["*September 16 – Kenney Jones, drummer (The Faces, The Who)"]}, {"page": "Sabian Cymbals", "response": ["* Kenney Jones of The Faces and The Who"]}, {"page": "Faces (band)", "response": ["Faces are an English rock band formed in 1969 by members of Small Faces after lead singer/guitarist Steve Marriott left that group to form Humble Pie. The remaining Small Faces—Ian McLagan (keyboards), Ronnie Lane (bass guitar, vocals), and Kenney Jones (drums and percussion)—were joined by Ronnie Wood (guitar) and Rod Stewart (lead vocals), both from the Jeff Beck Group, and the new line-up was renamed Faces.", "A greatest hits collection, Snakes and Ladders / The Best of Faces, appeared in 1976, and additional retrospective albums would appear over the subsequent decades.  Stewart would continue his successful solo career, while Ronnie Wood would formally join the Rolling Stones as a permanent member in 1975.  Kenney Jones joined The Who as a replacement for the deceased Keith Moon in 1978.  Ian McLagan would go on to work as a session and touring musician with a number of acts (including his own bands) throughout the 1970s until his death in 2014, while Ronnie Lane's activities in the music business (which included 1977's critically-lauded Rough Mix collaboration with Pete Townshend) were severely curtailed by 1980 due to the onset of multiple sclerosis which forced his eventual retirement by the early 1990s. ", "In 2004 a 4-disc Faces box set entitled Five Guys Walk into a Bar... was released by Rhino Records, featuring many of the band's most popular tracks as well as several previously unreleased songs. Drummer Kenney Jones formed a group called the Jones Gang, together with singer Robert Hart (formerly of Bad Company), Patrick Walford and bassist Rick Wills (formerly of Foreigner); in 2005 their first single \"Angel\" reached number 1 on the US Billboard \"hot singles sales\" list.", "During 2004 and early 2005 the surviving Faces had several near-reunions, none of which featured more than three members at the same time: In May 2004 Kenney Jones and Ronnie Wood joined Ian McLagan on stage at his concert at The Mean Fiddler in London. In August 2004 Wood and McLagan joined Stewart at the Hollywood Bowl; Wood also appeared at several other of Stewart's 2004 gigs, including New York's Madison Square Garden, the Royal Albert Hall and a street performance in London for an audience of 80,000. In March 2005 McLagan joined Ronnie Wood's band at a London show, which also featured Kenney Jones on drums for the final encore; and in December 2005 Wood joined Ian McLagan & the Bump Band for three numbers at a concert in Houston, Texas.", "On 11 June 2008, Rod Stewart announced that the surviving Faces were discussing a possible reunion, envisioning making a recording and/or performing at least one or two concerts. On 18 November Rod Stewart, Ron Wood, Ian McLagan and Kenney Jones reunited along with Rod Stewart's touring bassist Conrad Korsch for a rehearsal \"just to check if they can remember the songs\"; the band's official reunion website was launched earlier the same month. However, on 23 January 2009, a spokesman for Rod Stewart denied there were any plans for a 2009 Faces reunion tour.", "On 24 September 2009, it was announced that the Faces, minus Rod Stewart, would reunite for a one-off charity show for the Performing Rights Society's Music Members' Benevolent Fund, at the Royal Albert Hall in London. \"This will be so special for us, staging a reunion for such a wonderful and prestigious event,\" said Ronnie Wood when the announcement of the concert was made. \"Sadly Ronnie Lane can't be with us, but I'm sure he will be there in spirit, God bless him.\" Lane's ex-wife, Katy, is one of many to receive assistance from the charity. The event was held on 25 October. Ronnie Wood, Kenney Jones and Ian McLagan all took part, with various vocalists, including Mick Hucknall, replacing Stewart, and Bill Wyman filling in for the late Ronnie Lane on bass guitar.", "The Small Faces/Faces were inducted into the Rock and Roll Hall of Fame in 2012. On 23 March, the Faces announced that they would reunite with Rod Stewart to play at the induction ceremony for the first time in 19 years. However, on the eve of the ceremony, Stewart bowed out owing to a bout of influenza and Hucknall was asked to sing in his place.  In June 2013, speaking in an interview on YouTube, Kenney Jones confirmed the band's intention to reunite with Stewart for a tour in 2014. However, Ian McLagan died on 3 December 2014, putting this reunion in doubt.", "Rod Stewart, Ronnie Wood and Kenney Jones performed a short set at Hurtwood Polo Club on 5 September 2015 for charity, following their brief reunion at Rod Stewart's private party for his 70th birthday in January of that year. The reunion show was critically acclaimed, with The Telegraph newspaper reviewing the performance as \"5 star,\" under the headline of \"worth the 40-year wait.\"", "A further reunion occurred in 2019 at a Private event. In 2020 Rod Stewart reunited with Ronnie Wood and Kenney Jones to perform Stay With Me as the finale of that years Brit Awards Ceremony.", "*Kenney Jones – drums, percussion (1969–1975, 1986, 1993, 2009–2012, 2015, 2019, 2020, 2021-present)"]}, {"page": "Small Faces", "response": ["Small Faces were an English rock band from London, founded in 1965. The group originally consisted of Steve Marriott, Ronnie Lane, Kenney Jones and Jimmy Winston, with Ian McLagan replacing Winston as the band's keyboardist in 1966. The band was one of the most acclaimed and influential mod groups of the 1960s, recording hit songs such as \"Itchycoo Park\", \"Lazy Sunday\", \"All or Nothing\", and \"Tin Soldier\", as well as their concept album Ogdens' Nut Gone Flake. They evolved into one of the UK's most successful psychedelic bands until 1969.", "Lane and Marriott met in 1965 while Marriott was working at the J60 Music Bar in Manor Park, London. Lane came in with his father Stan to buy a bass guitar, struck up a conversation with Marriott, bought the bass and went back to Marriott's house after work to listen to records. They recruited friends Kenney Jones and Jimmy Winston who switched from guitar to the organ. They rapidly progressed from rehearsals at The Ruskin Arms public house (which was owned by Winston's parents) in Manor Park, London, to ramshackle pub gigs, to semi-professional club dates. The group chose the name, Small Faces, because of the members' small physical stature and a \"Face\" was somebody special, more than just a snappy dresser, he was someone in Mod circles as a leader, someone to look up to. A Face had the sharpest clothes, the best records and always was seen with the prettiest girl on his arm.\"", "Shortly thereafter, Jimmy Winston left the band for an acting and music solo career. He went on to succeed as an actor in TV, film and became a successful business man. In a 2000 interview, Kenney Jones said the reason Winston was fired from the band was because \"He (Winston) got above his station and tried to compete with Steve Marriott.\" Winston subsequently said he left the group over conflicts between Arden and Winston's brother.", "Marriott officially quit the band at the end of 1968, walking off stage during a live New Year's Eve gig yelling \"I quit\". Citing frustration at their failure to break out of their pop image and their inability to reproduce the more sophisticated material properly on stage, Marriott was already looking ahead to a new band, Humble Pie, with Peter Frampton. On the subject of the group's breakup, Kenney Jones, in an interview with John Hellier (2001), said:", "Kenney Jones became the drummer of The Who after Keith Moon's death in 1978 and continued to work with The Who through the late 1980s. His most recent work includes a band he formed and named The Jones Gang.", "Rick Wills of the reunited Small Faces played on David Gilmour's 1978 album, David Gilmour, then joined Foreigner later that year. He stayed with Foreigner for 14 years, until 1992. Subsequently, Wills was a member of Bad Company from 1993 to 1999 and again, briefly in 2001. Currently, he lives in Cambridge, England, and works with Kenney Jones in \"The Jones Gang\".", "Jimmy McCulloch's stint with Small Faces only lasted for a few months in late 1977. Shortly after leaving, he started a band called Wild Horses with Brian Robertson, Jimmy Bain and Kenney Jones. He and Jones both left the band before they issued any recordings. McCulloch then became a member of The Dukes, who issued one album in 1979. That same year, McCulloch died at the age of twenty-six from a heroin overdose in his flat in Maida Vale.", "On 4 September 2007, a Small Faces and Don Arden commemorative plaque, issued by the London Borough of Westminster, was unveiled in their memory in Carnaby Street. Kenney Jones, who attended the ceremony, said in a BBC television interview, \"To honour Small Faces after all these years is a terrific achievement. I only wish that Steve Marriott, Ronnie Lane and the late Don Arden were here to enjoy this moment with me\".", "*Kenney Jones – drums, percussion, vocals (1965–1969, 1975–1978)"]}, {"page": "Procol Harum", "response": ["In 2014, the band toured again in France, Switzerland, Germany, Canada (Ottawa with orchestra) and the Eastern U.S. The band also played a five-song set at Kenney Jones' Rock'n'Horsepower charity event at Ewhurst, Surrey in June, on a bill including Alvin Stardust, John Lodge, Nick Kershaw, Mike Rutherford, Judie Tzuke and The Who. A twin CD, Inside & Outside, was issued with studio tracks from the Chrysalis years and a live CD including new material and performances of tracks from their first four Zonophone albums. On Monday 24 November Procol Harum appeared at the Dominion Theatre in London with the BBC Concert Orchestra and the Crouch End Festival Chorus in an event recorded for broadcast on BBC Radio 2's Friday Night is Music Night on 28 November. Guitarist Geoff Whitehorn was hospitalised during rehearsals and at short notice Rick Wakeman's guitarist Dave Colquhoun deputised (on crutches, after a broken ankle). He played a guitar solo in the first extended, orchestrated version of Keith Reid's 9/11 tribute song \"Blink of an Eye\", dedicated by Gary Brooker to the brave firefighters of the 8th Avenue station who the band often talked with after gigs in New York."]}, {"page": "Steve Winwood", "response": ["In May 2007, Winwood performed in support of the Countryside Alliance, an organisation opposed to the Hunting Act 2004, in a concert at Highclere Castle, joining fellow rock artists Bryan Ferry, Eric Clapton, Steve Harley, and Kenney Jones."]}, {"page": "Ronnie Lane", "response": ["After leaving school at the age of 16, Lane met Kenney Jones at a local pub, and they formed a group they named The Outcasts. Initially playing lead guitar, Lane quickly switched to bass. When shopping for a Harmony bass guitar, Lane visited the J60 Music Bar in Manor Park, London, where he met employee Steve Marriott. Lane bought his bass, and went to Marriott's house after work, where Marriott introduced him to his Motown and Stax record collection. Lane and Marriott set out to form a band, recruiting friends Jimmy Winston, who switched from guitar to organ, and Jones. Marriott was chosen to be the frontman and singer.", "After initial success he toured the UK with \"The Passing Show\", a circus-type carnival complete with tents and barkers. Viv Stanshall, from the Bonzo Dog Doo Dah Band, served briefly as ringmaster (of sorts). Gallagher & Lyle were replaced with Scottish duo Lucas & McCulloch who provided accordion, mandolin, guitars and banjo. They also acted as support act along with fiddle player Kenny Slaven who multi tracked all the string parts on \"The Poacher.\" Lane moved to Island Records and issued Ronnie Lane's Slim Chance and One for the Road. In late 1976 he joined a short-lived reformation of Small Faces but quit after two rehearsals, to be replaced by Rick Wills (who later played alongside former Small Faces drummer Kenney Jones in the Jones Gang). However, Lane had signed a contract with Atlantic Records as part of the Small Faces, and was informed that he owed the company an album. His ensuing album with Pete Townshend, Rough Mix, produced by Glyn Johns, which was released in 1977, was lauded as contender for best album of the year by many critics, but the label did not promote it and sales were lacklustre.", "In 1983 his girlfriend Boo Oldfield contacted Glyn Johns with a view to organising a concert to help fund Action for Research into Multiple Sclerosis. Johns was already arranging Clapton's Command Performance for Prince Charles so they decided to book the Royal Albert Hall for a further two nights and host a benefit concert. The resulting ARMS Charity Concerts. featured Eric Clapton, Jimmy Page, Jeff Beck, Bill Wyman, Charlie Watts, Ronnie Wood, Kenney Jones, Andy Fairweather Low, Steve Winwood, Ray Cooper, James Hooker, Fernando Saunders, Chris Stainton, Tony Hymas, Simon Phillips and others. With the addition of Joe Cocker and Paul Rodgers they toured the US.", "In 1994 Ronnie and his wife Susan moved to the small town of Trinidad, Colorado. Jimmy Page, Rod Stewart and Ronnie Wood funded his medical care as no royalties from the Small Faces work were forthcoming - until Kenney Jones and Ian McLagan were eventually able to secure payments, by which time Steve Marriott had died in a house fire and Lane had also died."]}, {"page": "List of drummers", "response": ["* Kenney Jones (Small Faces, Faces, The Who)"]}, {"page": "Ronnie Wood", "response": ["The group split in 1969 and Wood departed along with lead vocalist Rod Stewart to join former Small Faces members Ronnie Lane, Ian McLagan, and Kenney Jones in a new group named Faces. The group found great success in the UK and mainland Europe, though achieved only cult status in the US. Wood sang and co-wrote the popular title track from their final LP, Ooh La La, released in 1973.", "In 1972, Wood and Faces bassist Ronnie Lane composed the soundtrack to the film Mahoney's Last Stand; the soundtrack, which was released as an LP in 1976, also features Faces bandmates Ian McLagan and Kenney Jones, along with contributions from Pete Townshend and Ric Grech. Wood also performed with Townshend, Grech, Steve Winwood, Jim Capaldi and Eric Clapton at Clapton's Rainbow Concert in 1973.", "On 25 October 2009, Wood, Ian McLagan and Kenney Jones joined forces for a Faces performance at London's Royal Albert Hall on behalf of the Performing Rights Society's Music Members' Benevolent Fund. Bill Wyman played bass and lead vocals were shared by several performers, notably Mick Hucknall. Rod Stewart, who had earlier denied rumours of plans for a Faces reunion in 2009, was not present."]}, {"page": "Zak Starkey", "response": ["Starkey subsequently began teaching himself to play the drums. His father gave him only one lesson, but discouraged his growing interest because of the desire not to see him in the same business. Although Starr has praised his son's abilities, he had always regarded him as a future lawyer or doctor. Starr's close friend, Kenney Jones, drummer for The Faces and Moon's replacement in The Who, stated that he \"virtually taught\" the young Starkey to play drums.Devon Ivie. \"Kenney Jones on the 'Fondness and Sadness' of His Who Era \"As I'm concerned there's only one drummer for the Who, and that's Keith Moon.\"\" Vulture. Jul 8, 2021.  By the age of twelve, Starkey was performing in pubs as a member of the garage band The Next. After Moon's death, Jones gifted the teenage Starkey a white drum kit formerly owned by Moon, which had been kept in storage by The Who."]}, {"page": "Charlie Watts", "response": ["Watts died at a London hospital on 24 August 2021, at the age of 80, with his family around him. Watts's bandmates Jagger, Richards and Wood paid tribute to him, along with former bandmate Wyman. Several other celebrities and rock musicians paid tribute to Watts following his death, including Paul McCartney, Ringo Starr, Elton John, Brian Wilson, Pete Townshend, Nick Mason, Roger Daltrey, the members of U2, Bryan Adams, Liam Gallagher, Brian May, Roger Taylor, Kenney Jones, Chad Smith, Questlove and Max Weinberg. For 10 days, the contents of the Rolling Stones' official website were replaced with a single picture of Watts in his memory."]}, {"page": "Paul Rodgers", "response": ["The Law, Rodgers' 1991 musical venture with former The Who and Faces drummer Kenney Jones, produced Billboard's number one AOR chart hit \"Laying Down the Law\" written by Rodgers, but the album peaked at number 126 on the Billboard 200 chart. A second album can be found on the bootleg market, which is often referred to as The Law II.  It is believed that this collection of songs were leftovers from the first album."]}, {"page": "Immediate Records", "response": ["According to Small Faces drummer Kenney Jones, most of Immediate Records' assets and income were embezzled by one of the company's senior partners, who allegedly channelled the funds to offshore bank accounts. Paul Korda, who wrote songs such as \"The Time Has Come\" for P.P. Arnold, was never paid for work done for Immediate Records."]}, {"page": "Steve Marriott", "response": ["On 28 July 1964, Marriott first saw his future Small Faces partners, Ronnie Lane and 16-year-old drummer Kenney Jones. They were all performing at the Albion in Rainham, with their bands.", " held on 30 April 1991, at the Harlow crematorium. Amongst the mourners, noted attendees included ex-Small Faces drummer Kenney Jones, as well as Peter Frampton, Joe Brown, PP Arnold, Terence Stamp, Jerry Shirley and Greg Ridley. Among those who sent wreaths were David Gilmour (of Pink Floyd) and Rod Stewart and his then-wife Rachel Hunter. Nothing was heard from ex-Small Faces members Ian McLagan or Ronnie Lane.", " Other guest appearances included two original members of the Small Faces, Kenney Jones and Ian McLagan, Paul Weller, Noel Gallagher and Bobby Tench from Marriott's 1980's Humble Pie line-up and John's Children. Other musicians such as Alan White, Gem Archer, Midge Ure, Zak Starkey, Rabbit Bundrick, Steve Ellis and Tony Rivers appeared in band line-ups during the two and half-hour concert, released on DVD as the Stevie Marriott Astoria Memorial concert.", " set up by Kenney Jones in memory of Steve Marriott and Ronnie Lane.", "*Paolo Hewitt/Kenney Jones (1995) The Small Faces: The Young Mods' Forgotten Story. Acid Jazz, "]}]}}