{"wiki_id": "http://www.wikidata.org/entity/Q2824721", "itemLabel": "Adolfo Canepa", "itemDescription": "Chief Minister of Gibraltar (born 1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Adolfo_Canepa", "wikipedia_page": {"main": "Adolfo John Canepa, CMG, OBE, GMH (born 17 December 1940)  is a Gibraltarian politician. He has dedicated most of his life to politics and the development of Gibraltar, having served both as Leader of the Opposition and as Chief Minister of Gibraltar from 8 December 1987 to 25 March 1988. During this period he was also the leader of the Association for the Advancement of Civil Rights (AACR). He is a former Speaker of the Gibraltar Parliament.", "link_mentions": [{"page": "Timeline of the history of Gibraltar", "response": ["*1987 2 December – A proposal for joint control of Gibraltar Airport with Spain met with widespread local opposition which was expressed in a protest march to The Convent. Chief Minister Sir Joshua Hassan resigned at the end of the year and was succeeded by Adolfo Canepa."]}, {"page": "Chief Minister of Gibraltar", "response": ["| 80px|Adolfo Canepa", "| Adolfo Canepa"]}, {"page": "Joe Bossano", "response": ["He has always kept a hard line stance against any sovereignty deal with Spain without the consent of the Gibraltarians. In 1980 he led a demonstrations of about 2,000 Gibraltarians protesting at the opening of negotiations between Spain and the United Kingdom agreed on the Lisbon Agreement. In 1987 he supported the position of the Government of Gibraltar and the Assembly against any agreement between Spain and the United Kingdom with regard to the joint use of the Airport of Gibraltar. On 10 November, Bossano and Joshua Hassan, then Chief Minister, led a demonstration of about 12,000 Gibraltarians, one of the largest ever held in the territory. In February 1988, Bossano and Adolfo Canepa, the leader of the Association for the Advancement of Civil Rights, stated that the Gibraltar House of Assembly would not approve the agreement reached by Spain and UK in December 1987 on the joint use of the Airport unless Spain accepted the British sovereignty over the isthmus.", "In the key 1988 election, Bossano's party called for the self-determination, expressed its opposition to the negotiations over the sovereignty and future of Gibraltar between Spain and the United Kingdom, and opposed to any transfer of sovereignty to Spain. It also asked for the withdrawal of the negotiations on the Brussels Declaration and opposed to the Airport agreement. The GSLP got 8 seats and a 58.2% of the popular vote. Bossano received a personal vote of 8,1128, about 4,000 more than his contender, Adolfo Canepa. Therefore, Bossano was the new Chief Minister."]}, {"page": "Association for the Advancement of Civil Rights", "response": ["After victory in the 1984 elections Hassan resigned without completing his term as Chief Minister in 1987 after an agreement on the shared use of Gibraltar Airport was signed by Spain and the United Kingdom, citing personal reasons. He was succeeded by the then Deputy Chief Minister, Adolfo Canepa. However, Canepa lost the 1988 election to Joe Bossano of the Gibraltar Socialist Labour Party (GSLP), winning only seven seats and forming the opposition in 1988. In 1992 they failed to return to power and were effectively dissolved thereafter. The last election with an AACR candidate was the 1998 by-election following the death of Robert Mor of the GLSP. The AACR candidate John Piris received only 337 votes and was defeated by Joseph Garcia of the Liberal Party of Gibraltar (LPG), backed by the GSLP.", "On 10 December 2007 the Self Determination for Gibraltar Group awarded the founding fathers of the AACR with the Gibraltar Award in recognition of their contribution to the political development, democratisation and emancipation of Gibraltar. The award was presented to Adolfo Canepa, the last AACR Chief Minister to hold office, in John Mackintosh Square on the 59th anniversary of the Universal Declaration of Human Rights.The Gibraltar Chronicle - Fourth SDGG Gibraltar Award for the Founding Fathers of the AACR"]}, {"page": "Joshua Hassan", "response": ["Further terms in office lasted from 11 August 1964 to 6 August 1969, and from 25 June 1972 to 8 December 1987. During the 1960s, Hassan addressed the United Nations Special Committee on Decolonization twice, opposing Spain's claim for Gibraltar and insisting that the vast majority of Gibraltarians wanted to remain British. He was one of the members of the 1968 Constitutional Conference chaired by Malcolm Shepherd, 2nd Baron Shepherd, which drafted the Gibraltar's first Constitution.The Gibraltar Constitution – 1969  Hassan only lost one election, the 1969 election, when the AACR failed to win a majority by just one seat, as it only obtained seven of the fifteen seats of the House. The Integration with Britain Party (IWBP, supporter of the integration of Gibraltar into the United Kingdom) gained support from the independent members of the House of Assembly and its leader Robert Peliza became Chief Minister and remained so for three years. Hassan was returned to office in 1972. He resigned without completing his term as Chief Minister in 1987 after an agreement on the shared use of Gibraltar Airport was signed by Spain and the United Kingdom, citing personal reasons. He was succeeded by the then Deputy Chief Minister, Adolfo Canepa. However, Canepa lost the 1988 election to Joe Bossano of the Gibraltar Socialist Labour Party (GSLP) and the AACR disbanded shortly afterwards. Bossano was one of Hassan's main critics, accusing him of being too conciliatory towards the British Government."]}, {"page": "Gibraltar", "response": ["On 24 September 2015, the Freedom of the City of Gibraltar was conferred upon the RGP by the Mayor, Adolfo Canepa.", "* Adolfo Canepa CMG OBE GMH: 25 May 2021."]}, {"page": "Gibraltar National Day", "response": ["* Adolfo Canepa – for public services and services to politics;"]}, {"page": "List of Gibraltarians", "response": ["* Adolfo Canepa (b. 1940), third Chief Minister of Gibraltar"]}, {"page": "Gibraltarians", "response": ["File:Adolfo Canepa 2013.jpg|Adolfo Canepa"]}, {"page": "Speaker of the Gibraltar Parliament", "response": ["The Speaker of the Gibraltar Parliament is the presiding officer of the Gibraltar Parliament, the legislature of the British Overseas Territory of Gibraltar. The current Speaker is Melvyn Farrell, who succeeded Adolfo Canepa on the 19th of November 2019"]}]}}