{"wiki_id": "http://www.wikidata.org/entity/Q2830615", "itemLabel": "Alan Webb", "itemDescription": "actor (1906-1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Webb_(actor)", "wikipedia_page": {"main": "Alan Norton Fletcher Webb (2 July 1906 – 22 June 1982) was an English actor. He was principally known as a stage performer, but made several film and television appearances. He seldom played leading roles, but was frequently cast in important character parts. He created roles in plays by A. A. Milne, Noël Coward, T. S. Eliot and other contemporary playwrights.", "link_mentions": [{"page": "Return of the Jedi", "response": ["* Ian McDiarmid as The Emperor, the founder and supreme ruler of the Galactic Empire, and Darth Vader's Sith master. Alan Webb was originally cast in the role but he dropped out due to illness. Lindsay Anderson was offered the role but he declined due to scheduling conflicts with Britannia Hospital. Ben Kingsley and David Suchet were also considered."]}, {"page": "Toad of Toad Hall", "response": ["| Alan Webb"]}, {"page": "Nicholas and Alexandra", "response": ["*Alan Webb as Yurovsky"]}, {"page": "Royal Shakespeare Company", "response": ["*  King Lear, directed by Peter Brook and starring Paul Scofield as Lear, Irene Worth as Goneril, Patience Collier as Regan, Diana Rigg as Cordelia, Peter Jeffrey as the Duke of Albany, Tony Church as the Duke of Cornwall, Alan Webb as the Earl of Gloucester, Tom Fleming as the Earl of Kent, Brian Murray as Edgar, James Booth as Edmund, Clive Swift as Oswald, and Alec McCowen as the Fool. (1962)"]}, {"page": "1980 in film", "response": ["| Rough Cut || Paramount Pictures || Don Siegel (director); Larry Gelbart (screenplay); Burt Reynolds, Lesley-Anne Down, David Niven, Timothy West, Patrick Magee, Al Matthews, Susan Littler, Joss Ackland, Isabel Dean, Wolf Kahler, Andrew Ray, Julian Holloway, Douglas Wilmer, Geoffrey Russell, Ronald Hines, David Howey, Frank Mills, Roland Culver, Alan Webb, Cassandra Harris, Sue Lloyd, Cyril Appleton || Heist || Live action"]}, {"page": "1979 in film", "response": ["| The First Great Train Robbery || United Artists / Dino De Laurentiis Company / Starling Films || Michael Crichton (director/screenplay); Sean Connery, Donald Sutherland, Lesley-Anne Down, Alan Webb, Malcolm Terris, Robert Lang, Michael Elphick, Wayne Sleep, Pamela Salem, Gabrielle Lloyd, George Downing, James Cossins, André Morell, Peter Benson, Janine Duvitski, Peter Butterworth || Heist, Neo-Noir, Crime || Live Action"]}, {"page": "1977 in film", "response": ["| The Duellists || Paramount Pictures / Enigma Productions / National Film Finance Consortium || Ridley Scott (director); Gerald Vaughan-Hughes (screenplay); Keith Carradine, Harvey Keitel, Albert Finney, Tom Conti, Edward Fox, Cristina Raines, Robert Stephens, John McEnery, Arthur Dignam, Diana Quick, Alun Armstrong, Maurice Colbourne, Gay Hamilton, Meg Wynn Owen, Jenny Runacre, Alan Webb, Matthew Guinness, Dave Hill, William Hobbs, W. Morgan Sheppard, Liz Smith, Hugh Fraser, Michael Irving, Tony Matthews, Pete Postlethwaite, Stacy Keach || Historical, Drama || Live Action"]}, {"page": "The Pumpkin Eater", "response": ["* Alan Webb - Mr Armitage, Jake's father"]}, {"page": "An Unearthly Child", "response": ["In Webber's original production documents, the character of the Doctor (referred to as \"Dr. Who\") was a suspicious and malign character who hated scientists and inventors, and had a secret intention to destroy or nullify the future; Newman rejected this idea, wanting the character to be a father figure. Tucker offered the role of the Doctor to Hugh David; having spent a year working on Knight Errant Limited and not wanting to be tied to another series, David turned down the role. Tucker envisioned a young actor to play the Doctor with aged make-up; however, Lambert favoured an older actor to avoid preparation time and add authenticity to the role. The part was turned down by actors Leslie French, Cyril Cusack, Alan Webb and Geoffrey Bayldon; Cusack and Webb were reluctant to work for a year on a series, while Bayldon wished to avoid another \"old man\" role. Lambert and director Waris Hussein invited William Hartnell to play the role; after several discussions, Hartnell accepted, viewing it as an opportunity to take his career in a new direction."]}, {"page": "The Pardoner's Tale", "response": ["*The tale is adapted in Pasolini's film The Canterbury Tales. Robin Askwith plays Rufus, Martin Whelar plays Jack the Justice, John McLaren plays Johnny the Grace, Edward Monteith plays Dick the Sparrow and Alan Webb plays the old man who sends them to Death."]}, {"page": "The Winslow Boy", "response": ["The play's Broadway premiere in 1947 featured Frank Allenby as Sir Robert, Alan Webb as Arthur Winslow, and Valerie White as Catherine Winslow.", "The Winslow Boy was presented on Theatre Guild on the Air 23 November 1952. The one-hour adaptation starred Basil Rathbone, Alan Webb, and Margaret Phillips. "]}, {"page": "Entertaining Mr Sloane", "response": ["Clive Exton wrote the screenplay for a 1970 feature film directed by Douglas Hickox and starring Beryl Reid, Peter McEnery, Harry Andrews and Alan Webb."]}, {"page": "The Night of the Iguana", "response": ["Maxine, Davis's role, is a lusty life-force of a woman, with some good comic lines, who is offstage for a significant part of the play, while Hannah is on. The  play featured Louis Guss, Bruce Glover, James Farentino, and Alan Webb as the dying grandfather to whom Hannah is devoted. The production was directed by Frank Corsaro. (In her memoir, Dark Victory, Davis wrote that she banned Corsaro from rehearsals shortly before opening). The play was nominated for a Tony Award for Best Play. Leighton, as Hannah, won the Tony Award for Best Actress in a Play."]}, {"page": "King Rat (film)", "response": ["| Alan Webb || Brant, a British Colonel"]}, {"page": "Play of the Month", "response": ["|Ian Holm,Sheila Allen,Alan Webb,Anthony Bate,Sydney Tafler,George Coulouris,Edward Kelsey,Alan Rowe,Ahmed Khalil,Philip Ryan,Sidney Kean", "|Stanley Baker,Helen Mirren,Brian Cox,Alan Webb,T.P. McKenna,Frances Tomelty,Tony Selby,Susan Penhaligon,Christopher Saul", "|Anthony Bate,Zoe Caldwell,Michael Gambon,Georgina Hale,Stephen Rea,Julia Schofield,Alan Webb,John Kane,Allan Surtees"]}, {"page": "The Canterbury Tales (film)", "response": ["* Alan Webb as Old Man"]}, {"page": "Patricia Maynard", "response": ["Her first five years were spent in rep and the theatre. One of her first theatrical engagements was in a play Collapse of a Stout Party, written by Trevor Peacock; in 1965, she appeared in The Philanderer in Manchester. In 1966 she joined the RSC, the same year as Trevor Nunn and Terry Hands, with appearances as Katharine to Ian Holm’s Henry V and also Castiza in Revengers’ Tragedy. She was at the Bristol Old Vic from 1967-69, where her plays included Blithe Spirit, Comedy of Errors, Venice Preserved (with Alan Bates, Bernard Hepton and Alan Webb), Vote, Vote, Vote for Nigel Barton by Dennis Potter, and a musical of Nancy Mitford’s book The Pursuit of Love written by Julian Slade. She returned to Bristol in 1982, playing Lady India in Anouilh’s Ring Round the Moon."]}, {"page": "Tony Award for Best Actor in a Play", "response": ["| Alan Webb"]}, {"page": "Chimes at Midnight", "response": ["*Alan Webb as Justice Shallow, a country justice and old friend of Falstaff"]}, {"page": "The Duellists", "response": ["* Alan Webb as the Chevalier du Rivarol, Adele's uncle"]}, {"page": "The Sea (play)", "response": ["*Evens - Alan Webb"]}, {"page": "The First Great Train Robbery", "response": ["In 1855 Edward Pierce (Sean Connery), seemingly a charismatic member of London's high society, is secretly a master thief. He plans to steal a monthly shipment of gold from the London to Folkestone train which is meant as payment for British troops fighting in the Crimean War. The gold is heavily guarded in two heavy safes in the baggage car, each of which has two locks, requiring a total of four keys. Pierce recruits Robert Agar (Donald Sutherland), a pickpocket and screwsman. Pierce's mistress Miriam (Lesley-Anne Down) and his chauffeur Barlow (George Downing) join the plot, and a train guard, Burgess, is bribed into participation. The executives of the bank who arrange the gold transport, the manager Mr. Henry Fowler (Malcolm Terris) and the president Mr. Edgar Trent (Alan Webb), each possess a key; the other two are locked in a cabinet at the offices of the South Eastern Railway at the London Bridge train station. In order to hide the robbers' intentions, wax impressions are to be made of each of the keys."]}, {"page": "The Signal-Man", "response": ["The American television program Suspense adapted \"The Signal Man\" in 1953, starring Boris Karloff and Alan Webb. The same story was also adapted in the radio format of the same franchise."]}, {"page": "1971 New York Film Critics Circle Awards", "response": ["**Runners-up: Warren Oates - The Hired Hand and Two-Lane Blacktop and Alan Webb - King Lear"]}, {"page": "Rough Cut (1980 film)", "response": ["* Alan Webb as Sir Samuel Sacks "]}, {"page": "Royal Naval College, Osborne", "response": ["*Alan Webb (actor)"]}, {"page": "South Sea Bubble (play)", "response": ["*Punalo Alani – Alan Webb"]}, {"page": "The Silent Enemy (1958 film)", "response": ["* Alan Webb as British Consul "]}, {"page": "1982 in the United Kingdom", "response": ["* 22 June – Alan Webb, actor (born 1906)"]}, {"page": "Interlude (1968 film)", "response": ["* Alan Webb as Andrew"]}, {"page": "Alan Webb", "response": ["Alan Webb may refer to:", "* Alan Webb (actor) (1906–1982), English actor", "* Alan Webb (runner) (born 1983), American track athlete", "* Alan Webb (footballer) (born 1963), retired English association football player"]}, {"page": "Entertaining Mr Sloane (film)", "response": ["*Alan Webb: Kemp"]}, {"page": "The Confidential Clerk", "response": ["| Alan Webb"]}, {"page": "The Scapegoat (1959 film)", "response": ["* Alan Webb as Inspector  "]}, {"page": "Challenge to Lassie", "response": ["* Alan Webb as James Brown"]}, {"page": "List of French films of 1972", "response": ["|The Canterbury Tales||Pier Paolo Pasolini||Adrian Street, Alan Webb, Albert King||Comedy||Italian-French co-production"]}, {"page": "List of actors considered for the part of the Doctor", "response": ["Alan Webb was then offered the role but declined, as did Cyril Cusack."]}, {"page": "Peace in Our Time (play)", "response": ["The play was given a pre-London tryout in Brighton and first performed in the West End at the Lyric Theatre in 1947. The production was directed by Alan Webb under Coward's supervision; it starred performers who became well known including  Kenneth More, Bernard Lee, Elspeth March, and Maureen Pryor. Later in the year the play moved to the Aldwych Theatre to complete its run."]}, {"page": "22nd Tony Awards", "response": ["** Alan Webb – I Never Sang for My Father as Tom Garrison"]}, {"page": "Noël Coward", "response": ["Coward's most important relationship, which began in the mid-1940s and lasted until his death, was with the South African stage and film actor Graham Payn.Payn, passim Coward featured Payn in several of his London productions. Payn later co-edited with Sheridan Morley a collection of Coward's diaries, published in 1982. Coward's other relationships included the playwright Keith Winter, actors Louis Hayward and Alan Webb, his manager Jack Wilson and the composer Ned Rorem, who published details of their relationship in his diaries.Hoare, pp. 162–63, 258, 261–62, 275, 273–74, and 469–70 Coward had a 19-year friendship with Prince George, Duke of Kent, but biographers differ on whether it was platonic.Hoare, p. 122 Payn believed that it was, although Coward reportedly admitted to the historian Michael Thornton that there had been \"a little dalliance\".\"Upstairs life of a royal rogue\", The Daily Express, 26 February 2012 Coward said, on the duke's death, \"I suddenly find that I loved him more than I knew.\"Lesley, p. 231"]}, {"page": "Ways and Means (play)", "response": ["*Lord Chapworth – Alan Webb"]}, {"page": "King Lear (1971 British film)", "response": ["* Alan Webb as Gloucester"]}, {"page": "List of British actors", "response": ["* Alan Webb (1906–1982)"]}]}}