{"wiki_id": "http://www.wikidata.org/entity/Q2833232", "itemLabel": "Alexander Young", "itemDescription": "English tenor", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Young_(tenor)", "wikipedia_page": {"main": "Alexander Basil Young (London, 18 October 1920 – Macclesfield, 5 March 2000) was an English tenor who had an active career performing in concerts and operas from the late 1940s through the early 1970s. He was particularly admired for his performances in the operas of Handel, Mozart, and Rossini and of choral works of the 18th century.\n\n", "link_mentions": [{"page": "2000 in music", "response": ["*March 5 – Alexander Young (79), operatic tenor"]}, {"page": "Alceste (Gluck)", "response": ["*Alceste (Original Italian version edited by Geraint Jones), Kirsten Flagstad, Raoul Jobin, Alexander Young, Marion Lowe, Thomas Hemsley, Joan Clark, Rosemary Thayer, Geraint Jones Orchestra and singers, Geraint Jones (Decca LP LXT 5273–5276;. c. 1952)"]}, {"page": "Samson (Handel)", "response": ["|1968 || Alexander Young,Martina Arroyo, Norma Procter, Ezio Flagello,Thomas Stewart,Helen Donath,Jerry J. Jennings"]}, {"page": "The Curlew", "response": ["* Alexander Young (tenor), Lionel Solomon (flute), Peter Graeme (English horn), Sebastian String Quartet (Argo LP RG 26) (January 1954)Argo listings."]}, {"page": "The Rake's Progress", "response": ["|Alexander Young,Judith Raskin,John Reardon,Regina Sarfaty"]}, {"page": "Kirsten Flagstad", "response": ["*The Alceste (original Italian version edited by Geraint Jones) in which she also made a farewell was recorded with Raoul Jobin, Alexander Young, Marion Lowe, Thomas Hemsley, Joan Clark, Rosemary Thayer, Geraint Jones Orchestra and singers, Geraint Jones (Decca LP LXT 5273–5276). (Her part was recorded April 28, April 30, and May 1, 1956.)"]}, {"page": "Das Liebesverbot", "response": ["* Edward Downes conducting the BBC Northern Symphony Orchestra, with April Cantelo (Isabella), Alexander Young (Luzio), Raimund Herincx (Friedrich), BBC Northern Singers. Live, complete and uncut, concert recording 23 May 1976, with bonus tracks from a 1971 Sadler's Wells Opera performance of Lohengrin, sung in English and conducted by Nicholas Braithwaite with a cast led by Margaret Curphy as Elsa, Clifford Grant as Heinrich der Vogler, Raimund Herincx as Telramund, and Judith Turner as Ortrud (Ponto POCD1055)"]}, {"page": "Frederica von Stade", "response": ["She gave her final performance as a comprimario on June 23, 1972, singing the role of Preziosilla in, aptly, Verdi's La forza del destino. In the summer of that year, she returned to Santa Fe for her first Zerlina in Mozart's Don Giovanni and her first portrayal of the traumatized heroine of Debussy's Pelléas et Mélisande (\"At the point where Pelléas was coming toward me singing 'Je t'aime, je t'aime', I was trying to decide whether to go to a certain pizza parlor after the show\").  After recording her first LP in February 1973Joseph Haydn's Harmoniemesse, conducted by Leonard BernsteinHaydn, Joseph: Die Schöpfung and Harmoniemesse, with Judith Raskin, John Reardon, Alexander Young, the Camerata Singers, Judith Blegen, Simon Estes, Kenneth Riegel. von Stade and the Westminster Choir, conducted by Leonard Bernstein; Leonard Bernstein: The Royal Edition, No. 36; Sony CD, SM2K 47560, 1992 she crossed the Atlantic to begin preparations for her Paris Figaro. Both the production and her contribution to it were widely acclaimeda French critic wrote that she had the voice of an angelRosenwald, Peter J.: Cinderella of the opera: the fabled slipper fits Frederica von Stade... perfectly, Horizon, September 1979, p. 22and she was soon receiving offers from many of the world's greatest opera houses. She made her British theatrical debut on July 1 at Glyndebourne under John Pritchard in another staging of Figaro, singing with her modesty intact despite the wish of her producer, Peter Hall, that she should perform part of the boudoir scene topless. In the autumn, she returned to San Francisco as Dorabella in Mozart's Così fan tutte; and at Christmas, she came back to the Met eighteen months after leaving it, debuting her Rosina in Rossini's Il barbiere di Siviglia as an acknowledged international star. Meeting Marcia Baldwin in later years, she joked that her colleague's night of illness back in 1970 had been singularly serendipitous. \"Without you, honey, I would not have had a career.\""]}, {"page": "Oh... Rosalinda!!", "response": ["*Alexander Young as Captain Alfred"]}, {"page": "Dalibor (opera)", "response": ["*1955, Vilém Tauský (conductor), BBC Philharmonia Orchestra and Chorus; Joan Hammond (soprano), Richard Lewis (tenor), Suzanne Danco (soprano), Alexander Young (tenor), Dennis Noble (baritone), Ian Blair (baritone), Stanley Clarkson (bass)."]}, {"page": "Tamerlano", "response": ["||Gwendolyn Killebrew,Alexander Young,Carole Bogard,Sophia Steffan,Joanna Simon,Marius Rintzler"]}, {"page": "Fritz Busch", "response": ["*1951: Mozart, Idomeneo excerpts, with the Glyndebourne Festival Opera, Sena Jurinac, Richard Lewis, Alexander Young"]}, {"page": "Hercules (Handel)", "response": ["||Louis Quilico,Maureen Forrester,Teresa Stich-Randall,Alexander Young,Norma Lerer"]}, {"page": "Gurre-Lieder", "response": ["* János Ferencsik, Danish State Radio Symphony and Concert Orchestra, with Alexander Young (Waldemar), Martina Arroyo (Tove), Janet Baker (Wood Dove), Odd Wolstad (Peasant), Niels Møller (Klaus the Jeaster), Julius Patzak (Narrator), Chorus of Danish Radio. EMI 7243 5 74194 2 (1968; CD issue 2000)."]}, {"page": "Solomon (Handel)", "response": ["|John CameronElsie MorisonAlexander YoungLois Marshall", "|Saramae EndichPatricia BrooksAlexander YoungJohn Shirley-Quirk"]}, {"page": "Te Deum (Berlioz)", "response": ["| Alexander Young"]}, {"page": "Saul og David", "response": ["* Unicorn RHS 343/5: Boris Christoff, Willy Hartmann, Elisabeth Söderström, Alexander Young, Michael Langdon, Kim Borg, Bodil Gobel, Sylvia Fisher, Mogens Berg, Kirsten Buhl-Moller; Danish Radio Symphony Orchestra and Chorus; John Alldis Choir; Jascha Horenstein, conductor (sung in English)"]}, {"page": "Richard Austin (conductor)", "response": ["Austin recorded a selection of works by Balfour Gardiner in May 1955 for Argo, with Alexander Young, the Goldsmiths’ Choral Union and the London Symphony Orchestra (Overture to a Comedy, Shepherd Fennel’s Dance, April, Philomela). Later that year with cellist André Navarra he set down recordings of Bloch's Schelomo and Tchaikovsky's Variations on a Rococo Theme Op.30 for Parlophone. A recording of The Beggar's Opera featured Dennis Noble, Carmen Prietto, Martha Lipton, Roderick Jones, Marjorie Westbury, John Cameron and William McAlpine."]}, {"page": "Alexander Young", "response": ["Alexander Young may refer to:", "*Alexander Young (bishop) (died 1684), 17th century Scottish prelate", "*Alexander Young (engineer) (1833–1910), Scottish engineer and businessman who became a citizen of the Kingdom of Hawaii", "*Alexander Young (musician) (1938–1997), Scottish guitarist and session musician", "*Alexander Young (New Zealand politician) (1875–1956)", "*Alexander Young (tenor) (1920–2000), English tenor", "*Alexander Young (VC) (1873–1916), Victoria Cross recipient", "**Alexander Young Building, a former building in Honolulu, demolished in 1981"]}, {"page": "Am Abend aber desselbigen Sabbats, BWV 42", "response": ["* J. S. Bach: Cantatas No. 42, No. 35, Hermann Scherchen, Wiener Akademie-Kammerchor, Vienna Radio Orchestra, Teresa Stich-Randall, Maureen Forrester, Alexander Young, John Boyden, Westminster/Baroque Music Club 1964"]}, {"page": "Willy Clément", "response": ["Clément sang in the French premieres of The Rape of Lucretia (Mulhouse, 1948) and The Love for Three Oranges (Monte Carlo, 1952). He also took part in the first opera programme on French television in April 1946 in the Barber of Seville, and followed this with more TV appearances. For the B.B.C. Third Programme he sang in a studio performance of Le Docteur Miracle, alongside Nadine Renaux, Marjorie Westbury and Alexander Young, conducted by Stanford Robinson.Porter, Andrew. B.B.C. Third Programme, January 18. Opera, March 1953, p184. He sang in the premiere of Marcel Landowski's L'Opéra de Poussière, the first 'world premiere' in the history of the Avignon Opera in 1962,France – report from Avignon. Opera, December 1962, p815. "]}, {"page": "Betty Allen", "response": ["In 1961 Allen sang Teresa to the Amina of Joan Sutherland in the American Opera Society's production of La sonnambula at Carnegie Hall. She performed with the AOS again the following year as Baba the Turk in Stravinsky's The Rake's Progress with Alexander Young as Tom Rakewell, John Reardon as Nick Shadow, and Judith Raskin as Anne Trulove. She sang the role of Armando di Gondì in Gaetano Donizetti's Maria di Rohan with the AOS in February 1963 with Ilvo Ligabue in the title role and Lino Puglisi as Enrico. In March 1963 she sang Juno in Handel's Semele with conductor Johannes Somary and the Amor Artis choir and orchestra. Soprano Helen Boatwright was in the title role, Donald Gramm sang Cadmus and Somnus, and Blake Stern was Jupiter. She returned to AOS again in 1965 to sing Zaida in Rossini's Il turco in Italia with Giorgio Tadeo as Selim, Judith Raskin as Fiorilla, Elfego Esparza as Don Geronio, Jerold Siena as Narciso, and Sherrill Milnes as Prosdocimo. That year she also portrayed Clitemnestre in Gluck's Iphigénie en Aulide at the AOS with Christa Ludwig in the title role, Richard Cassilly as Achille, and Walter Berry as Agamemnon."]}, {"page": "List of operas performed at the Wexford Festival", "response": ["|1969 || L'infedeltà delusa ||  Haydn || Italian || 1773 ||  David Lloyd-Jones ||  John Copley ||  John Fraser ||  Eugenia Ratti,Jill Gomez, Ugo Benelli, Alexander Young"]}, {"page": "Malcolm Sargent discography", "response": ["***Elizabeth Harwood, Norma Procter, Alexander Young, John Shirley-Quirk, Royal Choral Society, RPO, Reader's Digest, 1964", "**The Beggar's Opera: Elsie Morison, Zena Walker, John Cameron, John Neville, Monica Sinclair, Rachel Roberts, Ian Wallace, Eric Porter, Owen Brannigan, Paul Rogers, Constance Shacklock, Daphne Heard, Alexander Young, Robert Hardy, Pro Arte Chorus and Orchestra, HMV, 1955", "*** Geraint Evans, Alexander Young, Owen Brannigan, Richard Lewis, John Cameron, James Milligan, Monica Sinclair, Edna Graham, Elsie Morison, Marjorie Thomas, Stella Hitchens, Lavinia Renton, Helen Watts, Pro Arte Orchestra, Glyndebourne Festival Chorus, HMV, 1957", "*** George Baker, Ian Wallace, Alexander Young, Owen Brannigan, John Cameron, Monica Sinclair, Marjorie Thomas, April Cantelo, Heather Harper, Elsie Morison, Pro Arte Orchestra, Glyndebourne Festival Chorus, HMV, 1959", "*** John Shaw, Trevor Anthony, Alexander Young, George Baker, John Cameron, Marjorie Thomas, Elizabeth Harwood, Heather Harper, Monica Sinclair, Elsie Morison, Glyndebourne Festival Chorus, Pro Arte Orchestra, HMV, 1962", "*** Denis Dowling, Richard Lewis, John Cameron, Alexander Young, Geraint Evans, Owen Brannigan, John Carol Case, Elsie Morison, Marjorie Thomas, Monica Sinclair, Doreen Hume, Pro Arte Orchestra, Glyndebourne Festival Chorus, HMV, 1958 "]}, {"page": "Monica Sinclair", "response": ["*Mozart: Requiem (with Elsie Morison, Alexander Young, Marian Nowakowski, BBC Chorus, Royal Philharmonic Orchestra, under Beecham)"]}, {"page": "Warum betrübst du dich, mein Herz, BWV 138", "response": ["* J. S. Bach: Cantatas BWV 136 & BWV 138, Diethard Hellmann, choir and orchestra of the Christuskirche, Mainz, Agnes Giebel, Marie-Luise Gilles, Alexander Young, Carl-Heinz Müller, Cantate 1960"]}, {"page": "Verdi Requiem discography", "response": ["|1970 || Residentie Orchestra,Nederlandse Omroep Stichting ChorusWillem van Otterloo || Martina ArroyoCarol SmithAlexander YoungMartti Talvela || Claves Records, CD: CD 50-9911 || Live recording made on 11 and 12 December in The Hague (venue not mentioned)"]}, {"page": "Handel Society of New York", "response": ["|Saramae EndichPatricia BrooksAlexander YoungJohn Shirley-Quirk"]}, {"page": "The Lodger (opera)", "response": ["After the premiere at the Royal Academy of Music, the opera was broadcast on the BBC Third Programme on 2 February 1964, with Johanna Peters (Emma), Joseph Ward (the Lodger), Alexander Young (Joel Chandler), Owen Brannigan (George), conducted by Charles Groves.The Musical Times, Vol 105, No. 1451, January 1964, p. 20Peters's obituary in The Daily Telegraph, 30 May, 2000 The broadcast was recorded at home on professional equipment by Richard Itter of Lyrita Records for his private archive, and released on CD in 2015."]}, {"page": "Oxford Harmonic Choir", "response": ["*Tenor – John Mark Ainsley, John Elwes, Gerald English, Philip Langridge, Peter Pears, Steuart Wilson, Alexander Young."]}, {"page": "Alfred Orda", "response": ["In 1948 he attended auditions at the Metropolitan Opera House but was immediately recruited by Georges Hirsch, the Director of the Paris Opera (who was in New York the time) to appear as Valentin in 'Faust'. The French press published glowing reviews on his début. In 1953 Orda joined the Sadler's Wells Opera Company which he remained with for four years. In 1955 he shared a BBC studio concert with Dame Joan Sutherland in a Hugo Wolf programme, accompanied by the London Symphony Orchestra under Walter Goehr. In 1956 he sang in two broadcast studio performances of 'Alceste' by Gluck, under Geraint Jones, among other soloists such as Flagstad, Raoul Jobin, Alexander Young, Thomas Hemsley and Marion Lowe. Further major engagements that year took him to the Royal Festival Hall in a programme conducted by Sir Malcolm Sargent."]}, {"page": "Glyndebourne Festival Opera: history and repertoire, 1952–63", "response": ["|1953 || Così fan tutte  ||   Mozart ||  Sena Jurinac/Rita McKerrow (Fiordiligi), Anna Pollak (Dorabella), Juan Oncina/Alexander Young (Ferrando), Geraint Evans (Guglielmo), Alda Noni (Despina), Sesto Bruscantini (Don Alfonso) ||   John Pritchard || colspan=\"2\"|  Revival of 1948 production", "|1957 || Der Schauspieldirektor ||  Mozart ||  Joan Sutherland (Mme Herz), Naida Labay (Mme Silberklang), Alexander Young (Herr Herz), Gwyn Griffiths (Herr Buff) ||  Bryan Balkwill ||  Anthony Besch ||  Peter Rice"]}, {"page": "Emelie Hooke", "response": ["On 17 June 1954, she created a role in the world premiere of Lennox Berkeley's opera A Dinner Engagement, at the Jubilee Hall Aldeburgh, with April Cantelo, Alexander Young and other singers, under conductor Vilém Tauský.Britten Pears FoundationThe Glasgow Herald, 21 June 1954"]}, {"page": "Gordon Watson (pianist)", "response": ["* Benjamin Britten: The Holy Sonnets of John Donne, with Alexander Young, tenor", "* Ralph Vaughan Williams: On Wenlock Edge with Alexander Young and the Sebastian String Quartet.allmusic", "* Peter Warlock: (1954) song cycle The Curlew with Alexander Young, tenor; Lionel Solomon, flute; Peter Graeme, English horn; and the Sebastian String Quartet. It may be heard ."]}, {"page": "Nadine Renaux", "response": ["For the B.B.C. Third Programme she sang Laurette in a studio performance of Le Docteur Miracle, alongside Willy Clément, Marjorie Westbury and Alexander Young, conducted by Stanford Robinson.Porter, Andrew. B.B.C. Third Programme, January 18. Opera, March 1953, p184."]}, {"page": "Deaths in March 2000", "response": ["*Alexander Young, 79, British operatic tenor."]}, {"page": "The Diary of a Madman (opera)", "response": ["The New Opera Company gave the first British performance of the opera in 1960 at Sadler's Wells Theatre, London, when the role of Popritschin was taken by Alexander Young. A recording of this production made by the BBC, directed by Barbara Bray, won the radio critics prize at the UNESCO International Rostrum of Composers in the same year."]}, {"page": "A Dinner Engagement", "response": ["|Alexander Young"]}]}}