{"wiki_id": "http://www.wikidata.org/entity/Q2836676", "itemLabel": "Alice Thomas Ellis", "itemDescription": "British writer and essayist", "wikipedia_url": "https://en.wikipedia.org/wiki/Alice_Thomas_Ellis", "wikipedia_page": {"main": "Alice Thomas Ellis (born Ann Margaret Lindholm, 9 September 1932 – 8 March 2005) was an English writer and essayist born in Liverpool. She\nwrote numerous novels and some non-fiction, including cookery books.", "link_mentions": [{"page": "List of winners and shortlisted authors of the Booker Prize", "response": ["|Alice Thomas Ellis || The 27th Kingdom || Duckworth"]}, {"page": "1932 in literature", "response": ["*September 9 – Alice Thomas Ellis, English novelist, essayist and cookery book author (died 2005)"]}, {"page": "Sin-eater", "response": ["Published in 1977 by Duckworth Books, The Sin Eater was the first of British writer Alice Thomas Ellis's many novels. It \"exposed the hidden rancours of Irish, Welsh and English,\" in the words of journalist and writer Clare Colvin. Writing for the Los Angeles Review of Books, Abby Geni comments, \"The story orbits around the Captain, a failing patriarch, and the family who have gathered at his bedside. There are no ghosts or disembodied voices here. Instead, lovely Rose organizes meals and cricket matches. Angela, visiting from out of town, vies with Rose for control of the proceedings. Awkward Ermyn searches for her place in the group. Servants lurk on the sidelines. The story is ripe with shadows and terror. An unclassifiable menace seeps through the book like a fog.\""]}, {"page": "Anna Haycraft", "response": ["#REDIRECT Alice Thomas Ellis"]}, {"page": "2005 in literature", "response": ["**Alice Thomas Ellis, English novelist, essayist and cookery book author (born 1932)"]}, {"page": "2005 in Wales", "response": ["*8 March - Alice Thomas Ellis, novelist, 72"]}, {"page": "Charles Dance", "response": ["Dance's debut film as a screenwriter and director was Ladies in Lavender (2004), which starred Judi Dench and Maggie Smith. In 2009, he directed his own adaptation of Alice Thomas Ellis's The Inn at the Edge of the World."]}, {"page": "2005 in the United Kingdom", "response": ["** Alice Thomas Ellis, writer (born 1932)"]}, {"page": "List of Catholic authors", "response": ["*Alice Thomas Ellis – novelist and convert from Positivism; became a conservative Roman Catholic critic of the Second Vatican Council and a regular columnist at The Catholic Herald newspaper"]}, {"page": "A Common Reader", "response": ["A Common Reader's in-house publishing imprint, the Akadine Press, initiated in 1996, republished over 60 out-of-print books by authors such as Lillian Beckwith, Alice Thomas Ellis, Barbara Holland, Reynolds Price, and John Ciardi. "]}, {"page": "1996 in Wales", "response": ["*Alice Thomas Ellis is dismissed as a columnist on the Catholic Herald newspaper because of her attack on the reputation of the late Archbishop Derek Worlock."]}, {"page": "1985 in Wales", "response": ["*Alice Thomas Ellis – Unexplained Laughter"]}, {"page": "1983 in Wales", "response": ["*Alice Thomas Ellis - The 27th Kingdom"]}, {"page": "1982 in Wales", "response": ["*Alice Thomas Ellis is shortlisted for the Booker Prize for The 27th Kingdom."]}, {"page": "1977 in Wales", "response": ["*Alice Thomas Ellis - The Sin Eater"]}, {"page": "James Mustich Jr.", "response": ["In 1986, Mustich co-founded the mail-order book catalog A Common Reader': Books for Readers with Imagination', and served as its president and publisher until the business was closed in 2006. During its two-decade run, the catalog was published up to 17 times each year and listed hundreds of titles in each issue, each with its own write-up.  A Common Reader circulated to hundreds of thousands of readers and at its peak sold over 300,000 books a year.  Its in-house imprint, Akadine Press, republished over 60 out-of-print books by such authors as Lillian Beckwith, Alice Thomas Ellis, Barbara Holland, Reynolds Price, and John Ciardi."]}, {"page": "1932 in Wales", "response": ["*9 September – Alice Thomas Ellis, born Ann Margaret Lindholm in Liverpool, novelist (died 2005)Alice Thomas Ellis: obituary by Clare Colvin at The Guardian, 10 March 2005"]}, {"page": "1932 in the United Kingdom", "response": ["* 9 September – Alice Thomas Ellis, writer (died 2005)"]}, {"page": "Duckworth Books", "response": ["In 1968 Gerard Duckworth & Co. was purchased by Colin Haycraft and a friend Tim Simon.\"Colin Haycraft: A Passionate Publisher\", The Guardian, 1 October 1994, p. 32. Haycraft would run the company until his death in 1994. In this period Haycraft was described as a \"one man university press\" publishing at Duckworth a \"body of works on Greek and Roman literature, philosophy and society\" whose scholarship and originality \"equalled the output of the large university houses\". Meanwhile his wife, the writer Alice Thomas Ellis, was Duckworth's fiction editor and was responsible for publishing \"Duckworth's best-selling author\", Beryl Bainbridge.", "In the period from the 1970s to the 1990s authors published by the company including John Bayley, Beryl Bainbridge, Jeffrey Bernard, Alice Thomas Ellis, Penelope Fitzgerald, Ogden Nash, Dorothy Parker and Oliver Sacks."]}, {"page": "Fly in the Ointment", "response": ["* The Fly in the Ointment, a book by Alice Thomas Ellis"]}, {"page": "Bloomsbury Classics", "response": ["*The Birds of the Air by Alice Thomas Ellis"]}, {"page": "List of Desert Island Discs episodes (1991–2000)", "response": ["|||Alice Thomas Ellis||Come Hither – An Anthology by Walter de la Mare||Very comfortable sofa|| more"]}, {"page": "Agnès Desarthe", "response": ["* Alice Thomas Ellis: Les habits neufs de Margaret. Éditions de l'Olivier. 1993", "* Alice Thomas Ellis: Les ivresses de Madame Monro. Éditions de l'Olivier. 1993", "* Alice Thomas Ellis: Les égarements de Lili. Éditions de l'Olivier. 1994", "* Alice Thomas Ellis: Les oiseaux du ciel. Éditions de l'Olivier. 1995"]}, {"page": "List of converts to Christianity from nontheism", "response": ["*Alice Thomas Ellis – born Anna Haycraft, raised in Auguste Comte's atheistic \"church of humanity\", but became a conservative Catholic in adulthood known as Alice Thomas EllisTelegraph  \"She reacted strongly against her parents' beliefs and became a Catholic at 19, because she 'no longer found it possible to disbelieve in God.'\" (pg 2)"]}, {"page": "Alice Thomas", "response": ["*Alice Thomas Ellis, writer"]}, {"page": "Gloucester Crescent, Camden", "response": ["Gloucester Crescent is an 1840s Victorian residential crescent in Camden Town in London which from the early 1960s gained a bohemian reputation as “the trendiest street in London” and \"Britain's cleverest street\" when it became home for many British writers, artists and intellectuals including Jonathan Miller,George Melly ,Alan Bennett and Alice Thomas Ellis.", "*No 22: the writer and essayist Alice Thomas Ellis lived here from 1960 to 2001 with her husband the publisher Colin Haycraft until his death.The remarkable story of the cleverest street in Britain – The Oldie 1 February 2018Jonathan Miller says farewell to Britain’s cleverest street – The Oldie 28 November 2019 Since 2001 the house has belonged to photographer and film director Malcolm Venville."]}, {"page": "The Play on One", "response": ["| style=\"border-top:2px solid #E18B6B\"|  || Unexplained LaughterBBC – Radio Times – The Play on One: Unexplained Laughter ||  from the novel by Alice Thomas Ellis ||  || "]}, {"page": "List of women writers (A–L)", "response": ["*Alice Thomas Ellis (Anna Haycraft, 1932–3005, England), fiction & non-f. wr.", "*Anna Haycraft (Alice Thomas Ellis, 1932–2005, Wales), wr. & es."]}, {"page": "Anna Margaret Haycraft", "response": ["#REDIRECT Alice Thomas Ellis"]}, {"page": "Alice Haycraft", "response": ["#REDIRECT Alice Thomas Ellis"]}, {"page": "Anna Margaret Lindholm", "response": ["#REDIRECT Alice Thomas Ellis"]}, {"page": "Brenda O'Casey", "response": ["#REDIRECT Alice Thomas Ellis"]}]}}