{"wiki_id": "http://www.wikidata.org/entity/Q283400", "itemLabel": "Thomas George Montgomerie", "itemDescription": "English surveyor who worked in India", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_George_Montgomerie", "wikipedia_page": {"main": "Lieutenant-Colonel Thomas George Montgomerie FRS  (1830–1878) was a British surveyor who participated in the Great Trigonometric Survey of India as a lieutenant in the 1850s. He was the person to label K2, the second highest mountain in the world, the K standing for Karakoram. \nDespite being often denied close range access, the 19th-century survey work carried out by Montgomerie and the survey of India has been shown to be accurate. The elevations of major summits which they calculated are very close to the elevations which are accepted today.\nHe was subsequently involved in attempts to extend the survey of India into Tibet. Tibet was not part of the British Empire and was closed to foreigners, so he employed and trained Indians, who entered Tibet disguised as travelling Tibetans, and became known as pundits.\nIn 1867 Major Montgomerie was assigned to Peshawar where he was tasked with recruiting native agents to explore Central Asia. Montgomerie recruited a number of individuals to survey Chitral and Badakhshan, including Hyder Shah, who in 1870 travelled through the princely states of Swat and Dir and Badakhshan.", "link_mentions": [{"page": "Gasherbrum II", "response": ["In 1856, Thomas George Montgomerie, a member of the British Royal Engineers and part of the Great Trigonometric Survey, sighted the mountain and named it \"K4\", meaning the fourth mountain of Karakoram. The name \"Gasherbrum\" comes from the Balti words rgasha (\"beautiful\") and brum (\"mountain\"); it does not, contrary to popular belief, mean \"shining wall\", how Sir William Martin Conway described nearby Gasherbrum IV on an 1892 exploration."]}, {"page": "Gasherbrum", "response": ["In 1856, Thomas George Montgomerie, a British Royal Engineers lieutenant and a member of the Great Trigonometric Survey of India, sighted a group of high peaks in the Karakoram from more than 200 km away. He named five of these peaks K1, K2, K3, K4 and K5, where the \"K\" denotes Karakoram. Today, K1 is known as Masherbrum, K3 as Gasherbrum IV, K4 as Gasherbrum II and K5 as Gasherbrum I. Only K2, the second highest mountain in the world, has retained Montgomerie's name.  Broad Peak was thought to miss out on a K-number as it was hidden from Montgomerie's view by the Gasherbrum group."]}, {"page": "Cartography of India", "response": ["Thomas George Montgomerie organized several cartographic expeditions to map Tibet, as well as China.Nagendra (1999) Mohamed-i-Hameed, Nain Singh and Mani Singh were among the agents employed by the British for their cartographic operations. Nain Singh, in particular, became famous for his geographical knowledge of Asia, and was awarded several honors for his expeditions.In 1876, his achievements were announced in the Geographical Magazine. The awards and recognition soon started flowing in. On his retirement, the Indian Government honoured him with the grant of a village, and 1000 rupees in revenue. The crowning achievement came in 1876, when the Royal Geographical Society honoured him with a gold medal as the ‘man who has added a greater amount of positive knowledge to the map of Asia than any individual of our time—Nagendra 1999."]}, {"page": "Addiscombe Military Seminary", "response": ["* Thomas George Montgomerie"]}, {"page": "Thomas Montgomerie", "response": ["#REDIRECT Thomas George Montgomerie"]}, {"page": "Montgomery (name)", "response": ["* Thomas George Montgomerie (1830–1878), British Army officer and geographer"]}, {"page": "List of fellows of the Royal Society M, N, O", "response": ["| Thomas George Montgomerie||06/06/1872||23 April 1830 – 31 January 1878"]}, {"page": "Thomas Montgomery", "response": ["*Thomas George Montgomerie (1830–1878), British surveyor"]}, {"page": "Hyder Shah", "response": ["Hyder Shah was a Pashtun Muslim from the town of Kohat south of Peshawar. Hyder Shah was known in British literature as \"the Havildar\", an alias derived from his rank, havildar, or sepoy noncommissioned officer in the Bengal Sappers and Miners. He was recruited for a mission to explore Central Asia by a Major Pollock, the Commissioner of Peshawar, while he was in the services of Lieutenant-Colonel Frederick Maunsell, commandant of the Sappers and Miners. Hyder Shah's direct commander during the mission was Thomas George Montgomerie, who was in charge of recruiting and sending spies into Xinjiang, Bukhara, and Badakhshan. Montgomerie ordered Hyder Shah to travel north from Peshawar through Swat and Dir to Chitral and then cross the Hindu Kush into Badakhshan. From Badakhshan he was to attempt to pass over the Oxus River and explore Bukhara and Kokand. On 12 August 1870 Hyder Shah and several assistants left Peshawar. They passed through Swat, Dir and Chitral and passed into Badakhshan. But at Faizabad they learned poor weather would not permit passage over the Oxus and therefore the plans to travel to Bukhara and Kokand were scuttled. Hyder Shah and his party retraced their route and on 13 December 1870 they returned to Peshawar.Derek J. Waller. The Pundits : British exploration of Tibet and Central Asia. Lexington, Kentucky: University Press of Kentucky, 1990.pp. 84-94"]}, {"page": "Abdul Hamid (surveyor)", "response": ["Abdul Hamid, also known as Mohamed-i-Hameed, was an Indian surveyor from the Punjab. He was employed by Thomas George Montgomerie, as part of the Kashmir Survey project of the Survey of India, to explore and survey areas of Central Asia beyond the Indian frontier to which the British were not allowed access."]}, {"page": "William Johnson (surveyor)", "response": ["In 1855, he joined the newly formed Kashmir Survey party to survey the princely state of Jammu and Kashmir (created in 1846 under British suzerainty). He was second-in-command to Thomas George Montgomerie but in fact took a leading role on account of Montgomerie being busy in Srinagar. He led the survey of the Pir Panjal range, Kishenganga valley, Chandrabhaga valley, and later the Indus and Shyok river valleys. He ascended some of the tallest peaks in the line of this work. He also connected the Kashmir triangulation with that of the North-West Himalaya."]}, {"page": "T. G. Montgomerie", "response": ["#RedirectThomas George Montgomerie"]}]}}