{"wiki_id": "http://www.wikidata.org/entity/Q2832995", "itemLabel": "Alex Murphy", "itemDescription": "English rugby union footballer, and rugby league footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Alex_Murphy_(rugby_league)", "wikipedia_page": {"main": "Alexander James Murphy OBE (born 22 April 1939) is an English former professional rugby league footballer, and coach of the mid to late 20th century. Known as 'Murphy the Mouth' (or \"Yapper\" by some referees) and regarded as one of the greatest halfbacks in the history of the British game, he represented Great Britain in 27 Tests and his club career was played at three clubs, St. Helens, Leigh and Warrington. Murphy assumed a player-coach role of the last two clubs and expanded his coaching role toward the end of his playing career to include clubs such as Wigan, Salford and Huddersfield. He later returned to both Warrington and Leigh respectively as a football manager. He was the first player to captain three different clubs to victory in the Challenge Cup Final .", "link_mentions": [{"page": "1960 Rugby League World Cup", "response": ["*  Alex Murphy"]}, {"page": "Huddersfield Giants", "response": ["Shortly after the 1991–92 season had begun, Alex Murphy took over as coach in 1991. Huddersfield were the first-ever champions of the newly formed third division in 1991–92. Promotion to the Second Division had been achieved, and there was pride once again in the famous claret and gold jersey. The expense of this achievement cost the club dearly and a new financial crisis arrived. However, along came a bright new consortium who began to shape the future of the club once again. The club left Fartown and moved to Huddersfield Town's home ground at Leeds Road in 1992.", "* Alex Murphy 1991–94"]}, {"page": "Eddie Waring", "response": ["The split in opinion regarding his contribution to the game, plus illness, led to a decline in Waring's popularity. A petition was organised by some hardcore supporters asking the BBC to remove him from commentary as he was perceived to be portraying a poor image of the game and its northern roots.Rugby league's TV 'visionary' Eddie Waring remembered BBC Bradford & West Yorkshire, 7 September 2010 The BBC stuck with him as their main commentator, though in the late 1970s they also brought in former Great Britain halfback Alex Murphy to work alongside him."]}, {"page": "Warrington Wolves", "response": ["After a disastrous start to the 1970–71 season, coach Joe Egan decided to stand down. He was replaced by Peter Harvey. The change made little difference as the club won only 11 out of 24 matches. The club also had debts of around £33,000. The club was saved by a take-over bid from new chairman Ossie Davies and as part of the rescue package on May 20, 1971, Alex Murphy was appointed the new player-coach of the club.", "===The Alex Murphy era: 1971–1978===", "In 1978, Warrington appointed Billy Benyon as Alex Murphy's successor. A solid year-round performance saw Warrington finish second in the league, losing only 8 matches all year. A major highlight of the season was the controversial 15–12 victory over the Ashes-winning 1978 Kangaroo tourists. For the second year running the club reached the John Player Trophy final, but were unable to repeat the previous year's victory, the match going to Widnes by 16–4.", "| Alex Murphy \t|| 1971-1978\t|| 308\t|| 176\t|| 14\t|| 118\t|| 57%"]}, {"page": "Mal Meninga", "response": ["Post season he toured Europe with the undefeated 1982 Kangaroos, playing in all six tests on tour against Papua New Guinea, Great Britain and France. Meninga was the Kangaroos top point scorer on tour, scoring 166 from 10 tries (worth 3 points) and 68 goals, including a personal haul of 19 points (1 try, 8 goals) in the first Ashes series test against Great Britain at Boothferry Park in Hull. He then backed that up with 15 points (1 try, 6 goals) in the second test at Wigan's Central Park, before adding a further 14 points (7 goals) to his Ashes tally in the third test at Headingley in Leeds. The 1982 Kangaroos, the first touring team to go through Great Britain and France undefeated, earned the Frank Stanton coached team the nickname \"The Invinvibles\". Mal's size, strength, and at that stage of his career his speed (in the early 1980s he was once reportedly timed at 11.9 seconds over 100 metres ) saw him wreak havoc with the weaker English club side defences, as well as the Lions test side. According to BBC commentators Ray French and former Great Britain halfback Alex Murphy, the Lions players simply could not handle the 'Manu Mountain' Meninga. "]}, {"page": "England national rugby league team", "response": ["England played at the World Cup in 1975 coached by Alex Murphy, which was played over several months in both hemispheres on a league basis. Normally Great Britain would represent England in the World Cup, but the RLIF wanted to capitalise on the large number of Welsh players in the game at the time, and so England and Wales fielded separate teams.", "* Alex Murphy"]}, {"page": "Wigan Warriors", "response": ["In 1980, Wigan were relegated from the top flight for the first time in their history and Coslett was replaced by George Fairbairn as player-coach. During the second division season they recorded a record average attendance for the division of 8,198. Wigan won promotion back to the top flight the following season but Fairbairn lasted no longer than May 1981 before moving to Hull Kingston Rovers. Maurice Bamford took over as coach of Wigan before being sacked in May 1982 and was replaced by Alex Murphy.", "|Alex Murphy"]}, {"page": "St Helens R.F.C.", "response": ["Ex—St Helens captain and prop-forward Alan Prescott took over from Jim Sullivan as head coach in 1959. Perhaps the golden era of the club came in the 1960s, as well as more lately in the Super League era. With a galaxy of stars including Tom van Vollenhoven, Alex Murphy, Dick Huddart, Cliff Watson, Ray French and Vince Karalius, the 1960s was a decade of great success for the Saints. In Prescott's first season as coach he lifted the Lancashire League in the 1959–60 season. During this decade, the recognisable 'red vee' strip first appeared in 1961 for the final against Wigan. St Helens won this epic 12–6, and the kit has since become synonymous with the club. Mick Sullivan joined Saints for £11,000, then a record transfer fee. They won the Lancashire Cup in the 1961–62 season, with a 25–9 success over Swinton (at Central Park, Wigan) seeing yet more silverware come St Helens' way under the management of Prescott. After his departure in 1962, Stan McCormick led the club to retaining the Lancashire Cup in his first year, again beating Swinton; and St Helens made it a quadruplet of Lancashire Cup successes with wins against Leigh in 1964, and once more Swinton in 1965, the latter success under coach Joe Coan. St Helens won the Western Division Championship under McCormick's rule, beating Swinton 10–7. St Helens, under coach Joe Coan, lost the 1964–65 Championship final to Halifax at Station Road, Swinton. The 1965 New Zealand tourists appeared at Knowsley Road on Wednesday 15 September. Saints inflicted a 28–7 defeat on their visitors, their biggest loss of the tour. A League and Cup double was achieved under Coan in the 1965–66 season, whilst they lost the Floodlit Trophy final against Castleford. St Helens were beaten by Wakefield Trinity in the 1967 Rugby Football League Championship Final at Station Road, Swinton on 10 May 1967 by 20 points to 9 in a replay, after a 7–7 draw 4 days earlier. This would be Coan's last year in charge at St Helens after a highly successful period as boss. He was replaced by Cliff Evans.", "The arrival of Alex Murphy as coach in 1986 produced some colourful displays from a team that was widely regarded as an entertaining team to watch, but seemed to be constant runners-up. This was illustrated by the defeat by Halifax in the Challenge Cup final at Wembley, 19–18, in 1987. Success was achieved in 1988 when St Helens lifted their one and only John Player Trophy with a 15–14 victory over Leeds in January 1988, at Central Park, Wigan. Neil Holding with the crucial, match-winning drop-goal. They, however, lost to Widnes in the Premiership Final at Old Trafford at the end of the season, further showing this team's ability to get to finals and not be able to compete on the best stage. Nothing was achieved in the next two seasons, including a defeat in the 1989 Challenge Cup Final and Murphy stood down as coach."]}, {"page": "Salford Red Devils", "response": ["In May 1978, Alex Murphy was a surprise appointment as Salford coach. Years earlier he had famously referred to Salford's expensively built team as the 'Quality Street Gang'.", "Salford's home league fixture with Widnes was designated as the club's 'Centenary Match' in October 1979. Watched by 11,982, the result was 16–16, Salford playing in their original jersey colours of red, amber and black hoops. In fact Salford was founded in 1873 as Cavendish, changing their name to Salford in 1879. Alex Murphy left in November 1980, he was replaced by Kevin Ashcroft."]}, {"page": "Leigh Centurions", "response": ["===1971–1980: Alex Murphy era===", "Alex Murphy joined Leigh as player-coach in 1966. In 1971, Leigh reached the Rugby League Challenge Cup Final and defeated Leeds, 24–7. Murphy left Leigh on 20 May 1971 to become player-coach at Warrington.", "In 1978, John Woods played and scored in every game as Leigh secured the Second Division. In 1982, Leigh were Champions for the second time, as Alex Murphy guided them to a tense 13–4 victory at Whitehaven, after Leigh trailed 4–1 at half time.", "In January 1991, the club tried to sell its ground to ease cash problems. A consortium offered £200,000 to take over Leigh but the club ended up in administration. Swinton offered to ground share, Station Road, to help Leigh but this offer was refused. Tony Cottrell heads a consortium that takes over the club in 1991 and Alex Murphy is sacked on the eve of the new season."]}, {"page": "List of Royal Air Force personnel", "response": ["* Alex Murphy (rugby league) Great Britain rugby league player"]}, {"page": "Martin Offiah", "response": ["Offiah was spotted by Widnes coach Doug Laughton playing in the Middlesex Sevens, and was signed by the club to play rugby league for the 1987–88 season. Alex Murphy had been interested in acquiring Offiah from rugby union, but the board of directors at St. Helens infamously referred to Offiah as an \"uncoordinated clown\" and the interest was not followed up with action. Within months, he became the most talked about winger since Billy Boston for his lightning speed and try scoring, and it was at Widnes where he forged his reputation as a devastating winger, helping the team win both the Championship and Premiership. He ended his début season with 42 tries, making him the league's top try scorer, and also breaking the club record held by Frank Myler for most tries scored in a season. He received the Man of Steel award for his efforts."]}, {"page": "Swinton Lions", "response": ["Swinton made it to the final of the Lancashire County Cup in three consecutive seasons 1960–61, 1961–62 and 1962–63 plus 1964–65 but lost to St. Helens on each occasion at Central Park, Wigan. However, by the end of the 1960s they finally lifted the trophy after overcoming a strong Leigh side 11-2 led by Alex Murphy. Their victorious captain that early November day in 1969 at Central Park, Wigan was long serving dependable right-centre Bob Fleet."]}, {"page": "Quality Street Gang", "response": ["Alex Murphy referred to Salford's successful rugby league team of the 1960s and 1970s as the Quality Street Gang."]}, {"page": "Lance Todd Trophy", "response": ["| Alex Murphy"]}, {"page": "Rugby League Writers' Association", "response": ["|1995||Alex Murphy||Player and coach"]}, {"page": "Paul Vautin", "response": ["Vautin and Manly teammate Michael O'Connor both signed to play for the Alex Murphy coached St. Helens during the 1988–89 Rugby Football League season on 2 August 1988. Fatty would go on to captain St. Helens in his last match for them, a 27–0 loss to Wigan in the 1989 Challenge Cup Final played on 29 April 1989 at Wembley Stadium in front of 78,000 fans. It was the first time since 1952 that a team had been held scoreless.Paul Vautin. saints.org.uk Vautin played 21 games for St. Helens in 1988–89 and made his début in English club football on 9 October 1988 in a 30–22 win over Hull Kingston Rovers at Craven Park in Hull."]}, {"page": "Rugby Football League Hall of Fame", "response": ["|align=left| Alex Murphy"]}]}}