{"wiki_id": "http://www.wikidata.org/entity/Q28325198", "itemLabel": "John Challens", "itemDescription": "British scientist and civil servant that received the American Medal of Freedom for his work on the V-1 flying bomb and the V-2 rocket", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Challens", "wikipedia_page": {"main": "Wallace John Challens,  (14 May 1915 – 1 March 2002) was a British scientist and civil servant. A graduate of University College, Nottingham, he began working at the Royal Arsenal in Woolwich in 1936. In 1939, he was transferred to the rocket department. After the defeat of Germany, he was sent to the United States as part of the British Scientific Mission to work on the V-1 flying bomb and the V-2 rocket. On returning to the United Kingdom in 1947, he was recruited by William Penney for the British atomic bomb project. He led the team that developed the firing circuits for the bomb used in Operation Hurricane, the first British nuclear test. He later developed a neutron generator. He took part in most of the British nuclear tests at Maralinga, and was the scientific director of the Operation Grapple tests in 1957. He subsequently became the AWRE's Assistant Director in 1965, Deputy Director in 1972, and Director from 1976 until his retirement in 1978.", "link_mentions": [{"page": "Polaris Sales Agreement", "response": ["The choice of the A3 created a problem for the Atomic Weapons Research Establishment (AWRE) at Aldermaston, for the Skybolt warhead that had recently been tested in the Tendrac nuclear test at the Nevada Test Site in the United States would require a redesigned Re-Entry System (RES) in order to be fitted to a Polaris missile, at an estimated cost of between £30 million and £40 million. The alternative was to make a British copy of the W58. While the AWRE was familiar with the W47 warhead used in the A2, it knew nothing of the W58. A presidential determination was required to release information on the W58 under the MDA, but with this in hand, a mission led by John Challens, the Chief of Warhead Development at the AWRE, visited the Lawrence Livermore Laboratory from 22 to 24 January 1963, and was shown details of the W58."]}, {"page": "Operation Grapple", "response": ["Having decided on a location and date, there remained the matter of determining what would be tested. John Challens, whose weapons electronics group at Aldermaston had to produce the bomb assembly, wanted to know the configuration of Green Granite. Cook ruled that it would use a Red Beard Tom, and would fit inside a Blue Danube casing for air dropping. The design was frozen in April 1956. There were two versions of Orange Herald, large and small. They had similar cores, but the large version contained more explosive. Both designs were frozen in July. The Green Bamboo design was also nominally frozen, but minor adjustments continued. On 3 September, John Corner suggested that Green Granite could be made smaller by moving the Tom and Dick closer together. This design became known as Short Granite."]}, {"page": "2002 in the United Kingdom", "response": ["**John Challens, scientist and civil servant (born 1915)"]}, {"page": "1915 in the United Kingdom", "response": ["* 14 May – John Challens, scientist (died 2002)"]}, {"page": "Deacon's School", "response": ["* John Challens CBE, Director of the Atomic Weapons Establishment (AWE) from 1976 to 1978, designed the electrical circuits for Britain's first nuclear bomb test"]}, {"page": "British nuclear testing in the United States", "response": ["The Polaris Sales Agreement, which was signed in Washington, DC, on 6 April 1963, meant that a new warhead was required. The Skybolt warhead tested in Tendrac had to be redesigned with a Re-Entry System (RES) that could be fitted to a Polaris missile, at an estimated cost of between £30 million and £40 million. The alternative was to make a British copy of the W58. While the AWRE was familiar with the W47 warhead used in the A2 Polaris missile, it knew nothing of the W58 used in the A3 which the British government had decided to buy. A presidential determination was required to release information on the W58 under the MDA, but with this in hand, a mission led by John Challens, the Chief of Warhead Development at the AWRE, visited the LLNL from 22 to 24 January 1963, and was shown details of the W58. However a carbon copy of the American design was not possible, as the British used a different conventional explosive, and British fissile material was of a different composition of isotopes of plutonium. A new warhead had to be designed. It was given a fission primary codenamed Katie and fusion secondary codenamed Reggie. The whole warhead was given the designation ET.317."]}, {"page": "Deaths in March 2002", "response": ["*John Challens, 86, British scientist and civil servant, helped develop Britain's first atomic bomb."]}, {"page": "British hydrogen bomb programme", "response": ["Having decided on a location and date, there still remained the matter of what would be tested. John Challens, whose weapons electronics group would have to produce the assembly, wanted to know the configuration of Green Granite. Cook ruled that it would use a Red Beard Tom, and would fit inside a Blue Danube casing for dropping. The design was frozen in April 1956. There were two versions of Orange Herald, large and small. They had similar cores, but the large version contained more explosive. The designs were frozen in July. Green Bamboo was also nominally frozen, but tinkering with the design continued. On 3 September, Corner suggested that Green Granite could be made smaller by moving the Tom and Dick closer together. This design became known as Short Granite. By January 1957, with the tests just months away, a tentative schedule had emerged. Short Granite would be fired first. Green Bamboo would follow if Short Granite was unsuccessful, but be omitted as unnecessary otherwise. Orange Herald (small) would be fired next. Because Short Granite was too large to fit into a missile or guided bomb, this would occur whether or not Short Granite was a success. Finally, Green Granite would be tested. In December 1956, Cook had proposed another design, known as Green Granite II. This was smaller than Green Granite I, and could fit into a Yellow Sun casing that could be used by the Blue Steel guided missile then under development; but it could not be made ready to reach Christmas Island before 26 June 1957, and extending Operation Grapple would have cost another £1.5 million."]}, {"page": "High Explosive Research", "response": ["Key staff recruited to work at Fort Halstead included John Challens, who commenced on 1 January 1948. By mid-1948, it became clear that Penney's initial estimate that he would require 220 staff was wide of the mark, and that he would need nearly 500. This meant not only taking personnel from other projects, but scrapping some entirely. In October 1948, Penney submitted a request for developing a new, separate site for HER on grounds of safety, security and economy. This was approved, but it took another six months to locate a suitable site. An airbase, RAF South Cerney in Gloucestershire was chosen, but the RAF refused to relinquish the site. A former airbase, RAF Aldermaston, was then selected. At the same time, it was decided to separate HER from the Armaments Research Establishment (ARE). This resulted in a painful bureaucratic battle over personnel like Challens, whose expertise was wanted for research on both nuclear weapons and guided missiles. In the end, HER kept 25 of the 30 key personnel that ARE wanted, including Challens. The site was taken over on 1 April 1950. Penney became Chief Superintendent High Explosive Research (CSHER). The first stage of work at Aldermaston was completed in December 1951, but the plutonium processing building was only handed over in April 1952, the month that the first plutonium was due to arrive from Windscale. At the peak of construction in 1953, over 4,000 personnel were working on the site."]}, {"page": "Wallace John Challens", "response": ["#REDIRECT John Challens"]}, {"page": "Challens, John", "response": ["#redirectJohn Challens"]}]}}