{"wiki_id": "http://www.wikidata.org/entity/Q283905", "itemLabel": "Peter Durand", "itemDescription": "British merchant", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Durand", "wikipedia_page": {"main": "Peter Durand (21 October 1766 – 23 July 1822) was an English merchant who is widely credited with receiving the first patent for the idea of preserving food using tin cans. The patent (No 3372) was granted on August 25, 1810 by King George III of the United Kingdom.\nThe patent specifies that it was issued to Peter Durand, a merchant of Hoxton Square, Middlesex, United Kingdom, for a method of preserving animal food, vegetable food and other perishable articles using various vessels made of glass, pottery, tin or other suitable metals. The preservation procedure was to fill up a vessel with food and cap it. Vegetables were to be put in raw, whereas animal substances might either be raw or half-cooked. Then the whole item was to be heated by any means, such as an oven, stove or a steam bath, but most conveniently by immersing in water and boiling it. The boiling time was not specified, and was said to depend on the food and vessel size. Neither was the patent clear on the preservation time, which was merely said to be \"long\". The cap was to be partly open during the whole heating and cooling procedure, but right after that, the vessel should be sealed airtight by any means, such as a cork plug, a screw-cap with a rubber seal, cementing, etc.In his patent, Durand clearly mentions that the idea of the invention was communicated to him more than a year ago by a friend abroad. Extensive research in 19th century archives has revealed that he was French inventor Philippe de Girard. The relation between Durand and Girard has not been advertised, and the credit for the first canned food patent remains with Durand.The patent itself consists of two distinct parts: first, the description of the original idea, and second, observations by Durand himself. Durand was clearly suspicious of the invention. However, having a curious mind, he performed a thorough test of it by himself, sealing meat, soups and milk, and boiling them as described. The original inventor had only experimented with small food volumes, whereas Durand envisioned future large scale production and therefore preserved up to 30 pounds (13.6 kg) of meat in one can. For unknown reasons, Durand used only tin cans rather than glass vessels. He arranged for the cans to sail with the Royal Navy for a period of four to six months. Several members of the Royal Society and the Royal Institution examined the food upon its arrival, and found that it was perfectly preserved.Durand's patent was dedicated to the preservation technique rather than to the vessel. The technique itself was developed previously by a Frenchman, Nicolas Appert. However, Appert used exclusively glass vessels whereas Durand was the first to mention in a patent use of tin cans.After receiving the patent, Durand did not pursue canning food himself. He sold his patent in 1812 to two other Englishmen, Bryan Donkin and John Hall, for £1,000. Donkin was involved with tinning of iron from 1808 and was keen to expand it to the food industry. Donkin and Hall set up a commercial canning factory and by 1813 were producing their first canned goods for the British army. In 1818, Durand introduced tin cans in the United States by re-patenting his British patent in the US. By 1820, canned food was a recognized article in Britain and France and by 1822 in the United States.", "link_mentions": [{"page": "Pasteurization", "response": ["Appert's method was so simple and workable that it quickly became widespread. In 1810, British inventor and merchant Peter Durand, also of French origin, patented his own method, but this time in a tin can, so creating the modern-day process of canning foods. In 1812, Englishmen Bryan Donkin and John Hall purchased both patents and began producing preserves. Just a decade later, Appert's method of canning had made its way to America.Alvin Toffler, \"Future Shock\". Tin can production was not common until the beginning of the 20th century, partly because a hammer and chisel were needed to open cans until the invention of a can opener by Robert Yeates in 1855."]}, {"page": "List of inventors", "response": ["*Nicolas Appert (1749–1841), France – canning (food preservation) using glass bottles, see also Peter Durand"]}, {"page": "Canning", "response": ["Based on Appert's methods of food preservation, the tin can process was allegedly developed by Frenchman Philippe de Girard, who came to London and used British merchant Peter Durand as an agent to patent his own idea in 1810. Durand did not pursue food canning himself, selling his patent in 1811 to Bryan Donkin and John Hall, who were in business as Donkin Hall and Gamble, of Bermondsey.A brief account of Bryan Donkin FRS and the company he founded 150 years ago. Bryan Donkin Company, Chesterfield, 1953 Bryan Donkin developed the process of packaging food in sealed airtight cans, made of tinned wrought iron. Initially, the canning process was slow and labour-intensive, as each large can had to be hand-made, and took up to six hours to cook, making canned food too expensive for ordinary people.", "The original fragile and heavy glass containers presented challenges for transportation, and glass jars were largely replaced in commercial canneries with cylindrical tin can or wrought-iron canisters (later shortened to \"cans\") following the work of Peter Durand (1810). Cans are cheaper and quicker to make, and much less fragile than glass jars. Glass jars have remained popular for some high-value products and in home canning. Can openers were not invented for another thirty years – at first, soldiers had to cut the cans open with bayonets or smash them open with rocks. Today, tin-coated steel is the material most commonly used. Laminate vacuum pouches are also used for canning, such as used in MREs and Capri Sun drinks."]}, {"page": "Steel and tin cans", "response": ["The tin canning process was conceived by the Frenchman Philippe de Girard, who got a British merchant Peter Durand to patent the idea in 1810.  The canning concept was based on experimental food preservation work in glass containers the year before by the French inventor Nicholas Appert. Durand did not pursue food canning, but, in 1812, sold his patent to two Englishmen, Bryan Donkin and John Hall, who refined the process and product, and set up the world's first commercial canning factory on Southwark Park Road, London.  By 1813 they were producing their first tin canned goods for the Royal Navy. By 1820, tin canisters or cans were being used for gunpowder, seeds, and turpentine."]}, {"page": "Can opener", "response": ["Food preserved in tin cans was in use by the Dutch Navy from at least 1772. Before 1800, there was already a small industry of canned salmon in the Netherlands. Freshly caught salmon were cleaned, boiled in brine, smoked and placed in tin-plated iron boxes. This canned salmon was known outside the Netherlands, and in 1797 a British company supplied one of their clients with 13 cans. Preservation of food in tin cans was patented by Peter Durand in 1810. The patent was acquired in 1812 by Bryan Donkin, who soon set up the world's first canning factory in London in 1813. "]}, {"page": "Packaging and labeling", "response": ["With the discovery of the importance of airtight containers for food preservation by French inventor Nicholas Appert, the tin canning process was patented by British merchant Peter Durand in 1810. After receiving the patent, Durand did not himself follow up with canning food. He sold his patent in 1812 to two other Englishmen, Bryan Donkin and John Hall, who refined the process and product and set up the world's first commercial canning factory on Southwark Park Road, London. By 1813, they were producing the first canned goods for the Royal Navy."]}, {"page": "List of English inventions and discoveries", "response": ["* 1810: Tin can for food preservation patented by merchant Peter Durand (dates not known)."]}, {"page": "Pierre Durand", "response": ["* Peter Durand, British merchant who patented the tin can"]}, {"page": "Bryan Donkin", "response": ["Donkin became interested in canning food in metal containers. John Hall acquired Peter Durand's patent in 1812 for the sum of £1000 and after various experiments, and in association with Hall and Gamble Donkin set up a canning factory in Bermondsey, the first cannery to use tinned iron containers. By late spring 1813 they were appointing agents on the south coast to sell the preserved food to outbound ships. Soon the British Admiralty were placing sizeable orders with the firm of Donkin, Hall and Gamble for meat preserved in tinned iron canisters. The firm of Donkin, Hall and Gamble was later merged into Crosse & Blackwells. The Science Museum, London has an early Donkin tin can."]}, {"page": "Hoxton Square", "response": ["The Christian theologian John Thomas, founder of the Christadelphian movement, was born at Hoxton Square in 1805,Biographical Notes  from Thomas' Elpis Israel and in 1810 the square was home to Peter Durand, who filed the first patent nationally for tinning food.  "]}, {"page": "List of British innovations and discoveries", "response": ["*Tin can – Peter Durand"]}, {"page": "Salmon cannery", "response": ["The \"father of canning\" is the Frenchman Nicolas Appert. In 1795, he began experimenting with ways to preserve food by placing it in sealed glass jars and then placing the jars in boiling water. During the first years of the Napoleonic Wars, the French government offered a 12,000-franc prize to anyone who could devise a cheap and effective method of preserving large amounts of food. The larger armies of the period required increased and regular supplies of quality food. Appert submitted his invention and won the prize in January 1810. The reason for lack of spoilage was unknown at the time, since Louis Pasteur did not demonstrate the role of microbes in food spoilage for another 50 years. However, glass containers presented challenges for transportation. Shortly after, the British inventor and merchant Peter Durand patented his own method, this time in a tin can, creating the modern-day process of canning foods.Klooster, John W (2009) Icons of invention: the makers of the modern world from Gutenberg to Gates p. 103, ABC-CLIO. .", "* 1810: Peter Durand patented his more robust method of using tin cans, instead of breakable jars."]}, {"page": "Durand (surname)", "response": ["* Peter Durand (1766–1822), British inventor of the tin can"]}, {"page": "Canned fish", "response": ["The \"father of canning\" is the Frenchman Nicolas Appert. In 1795, he began experimenting with ways to preserve fish in jars. He placed jars of fish in boiling water. During the first years of the Napoleonic Wars, the French government offered a 12,000 franc prize to anyone who could devise a cheap and effective method of preserving large amounts of food. The larger armies of the period required increased and regular supplies of quality food. Appert submitted his invention and won the prize in January 1810. The reason for lack of spoilage was unknown at the time, since it would be another 50 years before Louis Pasteur demonstrated the role of microbes in food spoilage. However, glass containers presented problems for transportation. Shortly after, the British inventor and merchant Peter Durand patented his own method, this time in a tin can, creating the modern-day process of canning foods.Klooster, John W (2009) Icons of invention: the makers of the modern world from Gutenberg to Gates p. 103, ABC-CLIO. ."]}, {"page": "Nicolas Appert", "response": ["Although Appert never truly understood why his method worked (this being years before the science of bacteriology was developed), it was so simple that it quickly became widespread. In 1810, British inventor and merchant Peter Durand patented his own method, but this time in a tin can, so creating the modern-day process of canning foods. In 1812 Englishmen Bryan Donkin and John Hall purchased both patents and began producing preserves."]}, {"page": "Container", "response": ["In 1810, Frenchman Philippe de Girard came to London and used British merchant Peter Durand as an agent to patent his own idea for a process for making tin cans.  The canning concept was based on experimental food preservation work in glass containers the year before by the French inventor Nicholas Appert. Durand did not pursue food canning, but, in 1812, sold his patent to two Englishmen, Bryan Donkin and John Hall, who refined the process and product, and set up the world's first commercial canning factory on Southwark Park Road, London.  By 1813 they were producing their first tin canned goods for the Royal Navy."]}, {"page": "J & E Hall", "response": ["Bryan Donkin was one of the firm's earliest apprentices. Around 1800, the firm moved to larger premises in Waterside (now Hythe Street) on land which had once formed part of Dartford Priory, where its association with Donkin, now involved in the area's papermaking industry, helped it expand in partnership with the Fourdrinier brothers and John Gamble, to make paper machines. Donkin, Hall and Gamble also collaborated on canning food in metal containers. Hall acquired Peter Durand's patent in 1812 and after various experiments, Donkin, Hall and Gamble set up a canning factory in Blue Anchor Lane in Bermondsey, the first cannery to use tinned iron containers. By late spring 1813 they were appointing agents on the south coast to sell the preserved food to outbound ships, and the British Admiralty placed large orders with the firm of Donkin, Hall and Gamble for tinned meat. The firm later merged into Crosse & Blackwells."]}, {"page": "John Hall (engineer)", "response": ["Donkin, Hall and Gamble also collaborated on canning food in metal containers. Hall acquired Peter Durand's patent in 1812 and after various experiments, Donkin, Hall and Gamble set up a canning factory in Blue Anchor Lane in Bermondsey, the first cannery to use tinned iron containers. By late spring 1813 they were appointing agents on the south coast to sell the preserved food to outbound ships, and the British Admiralty placed large orders with the firm of Donkin, Hall and Gamble for tinned meat. Hall left the canning firm partnership in 1819, and the firm later merged into Crosse & Blackwell."]}, {"page": "Durand, Peter", "response": ["#redirectPeter Durand"]}]}}