{"wiki_id": "http://www.wikidata.org/entity/Q2837145", "itemLabel": "Alison Armitage", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Alison_Armitage", "wikipedia_page": {"main": "Alison Armitage  (born February 26, 1965) is a former swimmer, actress and Playboy Playmate.", "link_mentions": [{"page": "Jerry Maguire", "response": ["* Lucy Liu, Justina Vail Evans, Samantha Smith, Ivana Miličević, Lisa Stahl, Emily Procter, Stacey Williams, Lisa Ann Hadley, Alison Armitage and Rebecca Rigg as Former Girlfriends"]}, {"page": "1996 in film", "response": ["| Jerry Maguire || TriStar Pictures || Cameron Crowe (director/screenplay); Tom Cruise, Cuba Gooding Jr., Renée Zellweger, Kelly Preston, Jerry O'Connell, Jay Mohr, Regina King, Bonnie Hunt, Jonathan Lipnicki, Lisa Stahl Sullivan, Todd Louiso, Jeremy Suarez, Aries Spears, Toby Huss, Eric Stoltz, Beau Bridges, Glenn Frey, Drake Bell, Jared Jussim, Jeffrey Lurie, Mel Kiper Jr., Drew Bledsoe, Troy Aikman, Warren Moon, Katarina Witt, Barry Switzer, Wayne Fontes, Tim McDonald, Johnnie Morton, Rick Mirer, Rob Moore, Ki-Jana Carter, Herman Moore, Art Monk, Kerry Collins, Dean Biasucci, Al Michaels, Frank Gifford, Roy Firestone, Mike Tirico, Dan Dierdorf, Brent Barry, Lucy Liu, Samantha Smith, Ivana Milicevic, Alison Armitage, Emily Procter, Stacey Williams, Reagan Gomez-Preston, Jerry Cantrell, Jim Irsay, Jann Wenner || Sports, Comedy, Drama || Live action"]}, {"page": "List of game show hosts", "response": ["| David Hirsch || United States || Beach Clash (co-hosted with Alison Armitage) (1994–95)"]}, {"page": "University of San Diego", "response": ["*Alison Armitage, former swimmer, actress and Playboy Playmate"]}, {"page": "Acapulco H.E.A.T.", "response": ["The team's members are: Catherine \"Cat\" Avery Pascal (Alison Armitage), a former cat-burglar who had to choose between life imprisonment and working in H.E.A.T. for a year in order to have a \"clean-slate\"; Tommy Chase (Michael Worth), a martial arts expert with a deep understanding of human psychology; Brett Richardson (Spencer Rochfort), a former Navy SEAL with a vast knowledge of explosives; Krissie Valentine (Holly Floria), a computer genius who can do anything with computers, no matter the situation and, who eventually becomes romantically involved with teammate, Marcos Chavez (Randy Vasquez), a member of Mexico's Los Federales, and whose local contacts in their base-of-operations prove very helpful; Arthur Small (Graham Heywood), owner of Acapulco H.E.A.T. Beach Fashion who manages both the team's logistics and its members' false identities in the \"Beach Fashion Enterprise\" and, Claudio Divanti (Fabio), owner of the hotel where the team is headquartered.", "*Catherine (Cat) Avery Pascal (Alison Armitage) – A French ex-cat burglar, who was required to join the team after being arrested for her crimes. She had to stay with the team for a year in order to avoid prison sentence. She eventually accepted that being on the side of justice was far better. She poses as one of the models of the agency and her codename is \"High Dive\".", "*Catherine (Cat) Avery Pascal (Alison Armitage) – Between the first and second seasons, she became a beach-fashion photographer. As one of the original members of the H.E.A.T. team, she now had to deal with the responsibility of being her own boss. Her new cover was of one of the owners of a small boutique called \"Acapulco HEAT Beach Fashions\"."]}, {"page": "Armitage (surname)", "response": ["* Alison Armitage (born 1965), British actress"]}, {"page": "Black Scorpion (TV series)", "response": ["*Stunner: (Alison Armitage) Deputy Mayor Edwina Watts is the bemoaned right hand woman of the sleazy Mayor Arthur Worth. Often made the butt of the joke due to having been scapegoated by her inept boss for every one of his failed political bankrolling schemes. She's near fatally electrocuted when a prisoner execution goes awry, having gained the power to absorb and redistribute energy. Ms. Watts takes on a new guise with the codename Stunner and wreaks electric havoc on the city of angels in an attempt to usurp Mayor Worth's position. She was eventually defeated by Black Scorpion who used her stun ring to siphon her electrical energies then stun her into unconsciousness."]}, {"page": "1965 in the United Kingdom", "response": ["*26 February – Alison Armitage, English model and actress"]}, {"page": "1965 in British television", "response": ["*26 February – Alison Armitage, English model and actress"]}, {"page": "Beach Clash", "response": ["Beach Clash is a game show that aired in syndication from September 19, 1994, through September 17, 1995.  The show was hosted by David Hirsch and Alison Armitage. Teams of one male player, one female player, and two \"hardbodies\" competed in beach-themed events in an attempt to win the season's grand prize of $10,000 and a Hawaiian vacation."]}, {"page": "List of Playboy Playmates of 1990", "response": ["Alison Armitage (born 26 February 1965 in London, England) is a British actress. Under the pseudonym Brittany York, she was Playboy's Playmate of the Month for October 1990."]}, {"page": "Brittany York", "response": ["*Brittany York, pseudonym of Alison Armitage, an October 1990 Playboy Playmate"]}, {"page": "Secret Games", "response": ["* Alison Armitage as Nun"]}]}}