{"wiki_id": "http://www.wikidata.org/entity/Q2833165", "itemLabel": "Alexander Macleay", "itemDescription": "British entomologist and public servant in the colony of New South Wales", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Macleay", "wikipedia_page": {"main": "Alexander Macleay (also spelt McLeay) MLC FLS FRS  (24 June 1767 – 18 July 1848) was a leading member of the Linnean Society, a fellow of the Royal Society and member of the New South Wales Legislative Council.\n\n", "link_mentions": [{"page": "University of Sydney", "response": ["* The Macleay Collection is named after Alexander Macleay, whose collection of insects begun in the late 18th century was the basis upon which the Macleay Museum was founded in 1887. It is the oldest collection of natural history in Australia and has developed into a major collection of natural history specimens, ethnographic artefacts, scientific instruments and historic photographs. The Macleay Museum closed to the public in 2016 ahead of the opening of the Chau Chak Wing Museum."]}, {"page": "Rabbits in Australia", "response": ["Rabbits were first introduced to Australia by the First Fleet in 1788. They were bred as food animals, probably in cages. In the first decades, they do not appear to have been numerous, judging from their absence from archaeological collections of early colonial food remains. However, by 1827 in Tasmania, a newspaper article noted \"...the common rabbit is becoming so numerous throughout the colony, that they are running about on some large estates by thousands. We understand, that there are no rabbits whatever in the elder colony\" i.e., New South Wales (NSW).Colonial Times and Tasmanian Advertiser 22 May 1827 This clearly shows a localised rabbit population explosion was underway in Tasmania in the early 19th century. At the same time in NSW, Cunningham noted, \"... rabbits are bred around houses, but we have yet no wild ones in enclosures...\" He also noted the scrubby, sandy rubble between Sydney and Botany Bay would be ideal for farming rabbits.Cunningham P. [1827] Two years in New South Wales, vol. 1, p. 304 Enclosures appear to mean more extensive rabbit-farming warrens, rather than cages. The first of these, in Sydney at least, was one built by Alexander Macleay at Elizabeth Bay House, \"a preserve or rabbit-warren, surrounded by a substantial stone wall, and well stocked with that choice game.\"Sydney Gazette 28 May 1831 In the 1840s, rabbit-keeping became even more common, with examples of the theft of rabbits from ordinary peoples' houses appearing in court records and rabbits entering the diets of ordinary people."]}, {"page": "History of Sydney", "response": ["The first Sydney Royal Easter Show, an agricultural exhibition, began in 1823. Alexander Macleay started collecting the exhibits of Australia's oldest museum–Sydney's Australian Museum–in 1826 and the current building opened to the public in 1857.australianmuseum.net.au The University of Sydney was established in 1850. The Royal National Park, south of the city opened in 1879 (second only to Yellowstone National Park in the USA)."]}, {"page": "Macleay River", "response": ["Variously known as Wright River, Trail River, New and McLeay rivers, it was named the Macleay River in honour of Innes’s father-in-law, Alexander Macleay, Scottish-born scientist and colonial secretary of New South Wales."]}, {"page": "Richard Bourke", "response": ["Bourke was an avowed Whig. In November 1830, the Whigs won government in a climate of reform. Major-General Bourke was appointed to succeed Sir Ralph Darling, who was also Irish-born, as Governor of New South Wales in 1831. Bourke proved to be an able, if controversial, governor. In most of his efforts, he faced entrenched opposition from the local conservatives: the 'exclusive' faction in the New South Wales Legislative Council, and the Colonial Secretary Alexander Macleay and the Colonial Treasurer Campbell Riddell. The newspaper The Sydney Morning Herald always opposed him. (The exclusives were hostile to the participation of ex-convicts ('emancipists') in civil life, hence were opposed to changes which moved the colony from military to civil governance.) Bourke described himself as being \"pretty much in the situation that Earl Grey would find himself in if all members of his Cabinet were Ultra Tories and he could neither turn them out nor leave them\"."]}, {"page": "Australian Museum", "response": ["The establishment of a museum had first been planned in 1821 by the Philosophical Society of Australasia, and although specimens were collected, the Society folded in 1822. An entomologist and fellow of the Linnean Society of London, Alexander Macleay, arrived in 1826. After being appointed New South Wales Colonial Secretary, he began lobbying for a museum."]}, {"page": "William Kirby (entomologist)", "response": ["This, the first scientific treatise on English bees, brought him to the notice of leading entomologists in Britain and abroad. Extensive correspondence followed with scientists including Alexander Macleay, Walkenaer, Johan Christian Fabricius and Adam Afzelius. 153 of the bee species, including Lasioglossum malachurum, came from Kirby's own parish."]}, {"page": "Potts Point, New South Wales", "response": ["Much of the area that today comprises Potts Point and the adjacent suburb of Elizabeth Bay, originally constituted part of a land grant to Alexander Macleay, who was the New South Wales Colonial Secretary from 1826–37, and for whom Macleay Street is named. NSW Judge Advocate, John Wylde (for whom Wylde Street is named) was another 19th-century public servant who owned land in the area.Book of Sydney Suburbs, Frances Pollon (Angus and Robertson) 1990, page 208. Potts Point is mentioned in the poem William Street by notable Australian poet Henry Lawson."]}, {"page": "State Library of New South Wales", "response": ["In December 1827 operations began in rented premises in Pitt Street and in the two years following, the library led a peripatetic existence having been located a few years in George Street, Bridge Street, Macquarie Street and Macquarie Place. The library had financial problems and required more space to house its growing collections but negotiations in 1838 to construct a new library building broke down over member unwillingness to broaden access to the library. Fortunately for the members later negotiations with the government were more successful and construction of a new library building began in 1843. The foundation stone for this new building, on the corner of Bent and Macquarie Streets, was laid by Alexander Macleay and the library was opened in 1845."]}, {"page": "Edward Donovan", "response": ["He was a well-connected and respected member of the gentleman naturalist community. Evidence includes that his successful nomination for election as a Fellow of the Linnean Society in 1799 was supported by six members (Alexander Macleay, James Sowerby, William Lewis, Thomas Marsham, George Milne and Frederick Kanmacher), rather than the more usual three. ", "For Insects of India Donovan described and figured specimens in his own cabinet, that were originally collected by the late Duchess of Portland, Marmaduke Tunstall, a Governor Holford (many years resident in India), a Mr. Ellis, George Keate, a Mr. Yeats, and a Mr. Bailey. He also studied the collections of John Francillon, Dru Drury and Alexander Macleay. His patron was Joseph Banks. It is the first illustrated publication dealing with the entomology of India. The exact publication date, stated on the title page as being 1800, is also unclear as most plates are later; for example, the plate for Cicada indica is dated 1 February 1804. Many of the butterflies figured are from the Americas. In the works of Johan Christian Fabricius on which the Epitome was based \"Indiis\" confusingly refers to the West Indies or northern South America."]}, {"page": "Camellia japonica", "response": ["The first records of camellias in Australia pertain to a consignment to Alexander Macleay of Sydney that arrived in 1826 and were planted in Sydney at Elizabeth Bay House."]}, {"page": "John Verge", "response": ["In the 1830s Verge produced a number of fine houses in Sydney's eastern suburbs, notably several of the 'Villas of Woolloomooloo Hill', the spine of elegant villas largely built by the senior civil servants of the colony on a series of land grants that stretched from Darlinghurst Hill to Potts Point. These villas included Rockwall, built for surveyor John Busby, Tusculum for merchant Alexander Brodie Spark for whom Verge also designed Tempe House, and Goderich Lodge, for Thomas Macquoid. Others including Barham and Rose Bank have been attributed to his hand. Further east he built Rose Bay Lodge for James Holt. To the west of the town he built Lyndhurst, for Dr James Bowman, and Toxteth Park for George Allen, in Glebe.  Verge is also credited with Elizabeth Bay House, built at adjacent Elizabeth Bay for Alexander Macleay, the Colonial Secretary. It is theorised that Verge largely worked on a plan provided by Macleay, as his business ledger does not denote amounts that would reflect a full commission.  John Bibb, an accomplished draftsman employed by Verge, also worked on the project and James Hume from Scotland supervised the building.  The relative contributions of Verge, Bibb and Hume are unknown.  The house's beautiful oval saloon, with its geometric stair and domed lantern, is likely the most celebrated interior in early Australian architecture."]}, {"page": "Elizabeth Bay, New South Wales", "response": ["Alexander Macleay (1767–1848), the Colonial Secretary of New South Wales, was granted  here in 1828. He commissioned architect John Verge (1788–1861) to build Elizabeth Bay House, a Regency style home that was completed in 1837."]}, {"page": "Joseph Arnold", "response": ["Born in Beccles, Suffolk, the fourth son of Edward Arnold, a tanner and Hannah (d. 1786). He was schooled at John Leman's Free School and at the age of sixteen apprenticed to apothecary William Crowfoot. Arnold learned surgery in Edinburgh and received an MD in 1806. with a thesis on De Hydrothorace also known as dropsy of the chest. He joined the Royal Navy and was posted assistant surgeon on HMS Victory from April 1808 to February 1809. After recovering from typhus at Portsmouth, he was posted as surgeon on HMS Hindostan. This sailed to Sydney via the Cape of Good Hope and returned Cape Horn and Rio de Janeiro, commanded by William Bligh who offered to introduce Arnold to Sir Joseph Banks in London. In 1811, he was posted to Haslar Hospital in Portsmouth to handle patients with malignant fever. He then served aboard HMS Alcmene, HMS Hibernia, and HMS America around the Mediterranean, during which period he made a visit to the crater of Vesuvius. A meeting with Alexander Macleay made him interested in South American insects and he chose an appointment in 1814 as surgeon superintendent aboard the female convict vessel HMS Northumberland and went collecting insects on reaching Rio de Janeiro. He reached Sydney in 1815. After 1815, he unsuccessfully tried to work as surgeon in Sydney, and upon his return trip to England aboard the Indefatigable he was stranded in Batavia and the ship caught fire with Arnold losing most of his possessions. He was aided by Charles Assey, also from Beccles, and stayed at Bogor and collected some specimens. He returned to England in May 1816 during which time he met Dawson Turner. In 1818, he worked with Sir Stamford Raffles sailing with him in November 1817 from Falmouth aboard the Lady Raffles and assisted Lady Raffles en route in giving birth to her first child. They reached Benkulen on 19 March 1818. Arnold then travelled on to Passemah Ulu Manna. It is thought that he may have contracted malaria on this journey. Despite being ill, he helped the wife of Captain Thomas Otho Travers and then returned to Benkulen on 8 July 1818. He then recovered and set out to the Menangkabau highlands. It was only when Stamford Raffles visited Padang on 30 July that they learned of Arnold's death four days earlier. His burial site was never documented and has never been located."]}, {"page": "William Sharp Macleay", "response": ["Macleay was born in London, eldest son of Alexander Macleay, who named him for his then business partner, fellow wine merchant William Sharp. He attended Westminster School and Trinity College, Cambridge, graduating with honours in 1814. He was then appointed attaché to the British embassy at Paris, and secretary to the board for liquidating British claims on the French government, and following his father in taking an interest in natural history, became friendly with Georges Cuvier, and other celebrated men of science."]}, {"page": "Thomas Marsham", "response": ["He was a friend of James Francis Stephens, William Kirby and Alexander Macleay ."]}, {"page": "History of New South Wales", "response": ["In the course of the 19th century the increasingly ambitious colony established many of its major cultural institutions. The first Sydney Royal Easter Show, an agricultural exhibition and New South Wales cultural institution, began in 1823. Alexander Macleay started collecting the exhibits of Australia's oldest museum—Sydney's Australian Museum—in 1826 and the current building opened to the public in 1857.australianmuseum.net.au The Sydney Morning Herald newspaper began printing in 1831. The University of Sydney commenced in 1850. The Royal National Park, south of Sydney opened in 1879 (second only to Yellowstone National Park in the USA). An academy of art formed in 1870 and the present Art Gallery of New South Wales building began construction in 1896."]}, {"page": "Macleay Museum", "response": ["The building in which the museum is housed was built off Science Lane within the Camperdown campus in 1887. The collections of the Macleay Museum are based largely on the efforts and acquisitions of the Macleay family, one of the pre-eminent families in colonial Sydney including Alexander Macleay, William Sharp Macleay and William John Macleay. The zoologist and collector George Masters served as curator until 1912."]}, {"page": "William John Macleay", "response": ["He is noted as the last of the naturalists in a family that active in this field; his uncle was Alexander Macleay,  Colonial Secretary of New South Wales from 1826 to 1836, and a member and fellow of societies concerned with the flora and fauna of the empire's colonies."]}, {"page": "Australian Club", "response": ["# Hon Alexander Macleay MLC FLS FRS 1838 - 1848"]}, {"page": "James Macarthur-Onslow", "response": ["* Alexander Macleay (1767–1848) – Rosa Roberta's father – Arthur Alexander's grandfather. Fathered 17 children, including:", "* Sir William John Macleay (1820–1891)Michael Hoare, Martha Rutledge, 'Macleay, Sir William John (1820–1891)', Australian Dictionary of Biography, Volume 5, Melbourne University Press, 1974, pp. 185–187. – Alexander Macleay's nephew"]}, {"page": "Banksia menziesii", "response": ["Specimens of B. menziesii were first collected by the botanist Charles Fraser during Captain (later Admiral Sir) James Stirling's March 1827 exploration of the Swan River. The following year, Alexander Macleay sent some of Fraser's specimens to Robert Brown. Brown formally published the species in his 1830 Supplementum Primum Prodromi Florae Novae Hollandiae, giving it the specific epithet in honor of Archibald Menzies, surgeon-naturalist on  under George Vancouver, who discovered King George Sound in 1791. Thus the species' full name is Banksia menziesii R.Br. Neither Brown nor Menzies ever saw the plant growing."]}, {"page": "Macleaya", "response": ["Macleaya is named after the Scottish entomologist Alexander Macleay (1767-1848)."]}, {"page": "Leverian collection", "response": ["The contents of the museum are well recorded, from a catalogue of the museum created in 1784, and the sale catalogue in 1806, with a contemporary series of watercolours of its contents by Sarah Stone.A collection of drawings by Sarah Stone There are also sale catalogue annotations allowing, for example, the counting of 37 lots bought by Alexander Macleay.Palma, R.L. 1991. Two bird lice (Insecta: Phthiraptera) collected during Captain Cook's 2nd voyage around the world. Archives of Natural History, London, 18 (2): 237-247; PDF at p. 244. The Royal College of Surgeons bought 79 lots, and notes by William Clift survive.RCS page, List Of Specimens Purchased By The Royal College Of Surgeons At The Sale Of The Leverian Museum In 1806. Purchases from the sale founded the collection of Richard Cuming. In all 7,879 lots were sold over 65 days."]}, {"page": "British Entomology", "response": ["*Volume 1 – Coleoptera (Part 1) dedicated to William Kirby and Alexander Macleay"]}, {"page": "Vaucluse House", "response": ["Colonial Secretary, Alexander Macleay received the Yulan magnolia (M.denudata), a small tree from south-eastern China, at Elizabeth Bay, in 1836. From the 1850s onwards it is listed for sale in nurseries such as the Darling Nursery, Sydney and Guilfoyle's Exotic Nursery in Double Bay. This tree is currently in bloom in the Vaucluse House pleasure garden.Holliday, 2017 Vaucluse House and its furnishings were clearly intended to provide the correct social surroundings for Wentworth and his wife's immediate family of seven daughters and three sons. Sir Henry Browne Hayes' modest structure disappeared within the building fabric of the Wentworth's gothic mansion. The public areas were designed for effect and the Drawing and Dining Rooms, long hall and sweeping staircase was as fashionable as the Wentworth's taste would allow. Vaucluse House was never completed due to factors which included the 1840s depression and Wentworth's intentions for a full facade, bedroom additions and formal entrance are unknown.", "Plants from Asia, and especially China, have had some of the greatest impact on the character of Sydney gardens. At Vaucluse House a significant collection of 19th century Camellia cultivars is the most obvious Chinese inheritance. China's horticultural treasures were largely unfamiliar to Western gardeners until the Treaty of Nanjing of 1842 opened official trade channels. Despite difficulties of access, well-connected NSW gardeners were able to introduce Chinese plants early - either from England or directly from trading ports of Canton (Guangzhou), where foreign merchants were permitted from the mid-18th century, and the Portuguese outpost of Macao. Chinese plants in the garden include shell ginger (Alpinia zerumbet), plume poppy, Macleaya cordata (named after Alexander Macleay, colonial secretary of New South Wales from the 1820s-30s, and gardener at Elizabeth Bay House),Read, Stuart, pers.comm., 14 January 2017 Camellia japonica cv.s, azaleas (Rhododendron indicum cv's), Cherokee rose (Rosa laevigata), Wisteria sinensis, (introduced into Sydney by Alexander Macleay at Elizabeth Bay) orange jessamine / sweet box (Murraya paniculata), confederate rose (Hibiscus mutabilis), butterfly bush (Buddleja davidii), fried egg plant (Gordonia axillaris) and \"Safrano\" rose, (R. 'Safrano')."]}, {"page": "Elizabeth Bay House", "response": ["===Alexander Macleay===", "Alexander Macleay (1767-1848), public servant and entomologist, was born at Wick, a fishing village in Ross-shire, Scotland. He moved to London in 1786, marrying Elizabeth Barclay there in 1791. Macleay, who was employed in the civil service (1795-1825) was well known in British and European natural history circles, having amassed by 1805 one of the most significant insect collections in Britain. He was elected a fellow of the Linnean Society of London in 1794 commemorating the great Swedish naturalist Carl Linnaeus, whose Species Plantarum (1753) became the internationally accepted starting point for all botanical nomenclature and served as its secretary from 1798 to 1825. He was elected a fellow of the Royal Society in 1809. Botanist Robert Brown, Macleay's close friend and suitor of his eldest daughter Fanny, a competent botanical artist, named the plant genus Macleaya in his honour.", "In 1825 Robert Henderson had been recruited at the Cape of Good Hope by Alexander Macleay. Henderson's obituary records that he superintended the laying out of the gardens of Elizabeth Bay and Brownlow Hill. In February 1829 Fanny wrote \"we have now some beautiful walks thro' the bush.  Mr (Edward) Deas-Thompson who is possessed of an infinity of good taste is the Engineer and takes an astonishing degree of interest in the improvement of the place.\"", "Alexander Macleay had a great passion for bulbous plants, particularly those from the Cape of Good Hope. The explorer Charles Sturt, contributed many bulbs collected on his journey to South Australia in 1838, having been presented with four bulbs of Calostemma album from the Royal Botanic Gardens at Kew during his visit to Elizabeth Bay in February 1831. Bulbs featured in the large collection of plants which William Sharp Macleay brought with him to Australia in 1839. 88 varieties of bulbs were forwarded to him in 1839-40 by his scientific correspondent, Dr Nathaniel Wallich, Superintendent of the botanical garden in Calcutta.", "An attempt was made to subdivide the land in 1841 but the blocks did not sell. While others were forced to declare bankruptcy, Macleay was saved by his eldest son William Sharp Macleay, also Alexander Macleay's largest creditor. In 1845 W. S. Macleay insisted his family move out of the house and then took it over the payment of the debts himself. Macleay's library and the drawing room furniture were sold to pay creditors. William Sharp Macleay (1792-1865), public servant, scholar and naturalist, and eldest son, inherited his father's insect collection, and stayed alone at the house until his death in 1865. Alexander and Eliza moved, bitterly, to Brownlow Hill. He was elected Speaker of the Legislative Council (1843–46). Injured in a carriage accident in 1846, and still suffering the effects, he died at Tivoli, Rose Bay, the home of one of his daughters. George Macleay (1809-1891) pastoralist and explorer and third surviving son, inherited his father's debts.", "Elizabeth Bay House and the estate are significant for their association with the history of intellectual life in NSW and their association with three generations of Macleay owners as well as members of the extended Macleay family. The house's association with Alexander Macleay reflects the exploration and settlement of Australia concurrently with the extraordinary growth in scholarly interest in the natural sciences at the end of the 18th century. Elizabeth Bay House and its garden were visited by prominent Australian, British, American and European scientists and intellectuals throughout most of the 19th century, being a focus for Australia's role in an international scientific community. The Macleay family and Macleay family collections provided key endowments for the Australian Museum, the Macleay Museum at Sydney University and the Linnean Society of NSW.", "Elizabeth Bay House is one of the finest domestic buildings erected in Australia in the early 19th century. The Saloon is arguably the finest interior in 19th century Australian architecture. The quality of the Greek Revival styling of the house marks a transition in John Verge's career from relatively restrained commissions such as Lyndhurst, Glebe, to more sophisticated designs such as Camden Park. The Greek Revival joinery is particularly fine. The siting of Elizabeth Bay House and surviving elements of Elizabeth Bay Estate provide rare examples of sophisticated Landscape design in early 19th century NSW. The estate, possibly laid out with advice from Landscape gardener Thomas Shepherd adapted design principles from the English 18th century Landscape movement to a Sydney harbourside setting with the retention of indigenous trees. Elizabeth Bay House's relationship with the villas Tusculum and Rockwall, Potts Point provides a rare key precedent for town planning in Australia. The 1826 grant of Elizabeth Bay House estate to Alexander Macleay was followed by the granting of a series of allotments along Macleay Street Potts Point to the colony's principal civil servants and one respectable merchant, under a series of villa conditions, which specified the quality and elements of the design of these houses. It is believed that both Alexander Macleay and Mrs Darling, wife of the Governor, took a key role in establishing the parameters for this development of Sydney's first suburb.", "As at 22 September 2003, the grotto and associated stairs, balustrade and retaining walls are ornamental structures created between 1832 and 1835 to embellish the then  garden of Elizabeth Bay House, built between 1835 and 1839 by Alexander Macleay (1767-1848), Colonial Secretary of New South Wales (1826-1837). They are surviving remnants of arguably the most sophisticated landscape design of the 1820s and 1830s in New South Wales, which adapted late 18th Century English Landscape and Picturesque Movement ideals (as interpreted by the early 19th century Gardenesque Movement) for the Sydney Harbour topography."]}, {"page": "1848 in Australia", "response": ["*Alexander Macleay"]}, {"page": "Alexander Onslow", "response": ["Onslow was the fourth son of Arthur Pooley Onslow, of Send Grove, Ripley, Surrey, by his wife, Rosa Roberta, daughter of Alexander Macleay, F.R.S., Speaker of the first New South Wales Legislative Council. Onslow was educated at Westminster and Trinity College, Cambridge, where he graduated B.A. in 1864. He entered at the Inner Temple on 15 January 1862, was called to the bar on 17 November 1868, and went the Home Circuit. On 4 February 1878, he married Madeline Emma Loftus, daughter of Rev. Robert Loftus Tottenham, of Florence, and granddaughter of the Bishop of Clogher."]}, {"page": "Camden Park Estate", "response": ["The Australian Dictionary of Biography entry for Sir William Macarthur 1800–1882 mentions that William \"grew many fruit trees, vegetables and flowers and that later he built a hothouse and imported valuable orchids\". Although there is no evidence of any breeding of ornamental garden plants in the early days of the colony, botanical records dating from 1831 reveal a growing interest in plant hybridisation and colonial botanical assignments. Early botanical records held at the Royal Botanical Gardens Sydney, show that William Macarthur of Camden Park collected native plant specimens from all over NSW, and was donating oleanders and cape bulbs to the gardens from 1827. He also imported Australia's second consignment of camellias from England on the ship Sovereign in 1831, the first being imported from England by Alexander Macleay of Elizabeth Bay House and Brownlow Hill in 1826.Spencer, 322–323, A camellia japonica \"Anemoniflora\" or \"Red waratah\" bush still survives at Camden Park House garden today and is possibly the oldest surviving camellia plant in Australia. With the publication of Catalogue of Plants Cultivated at Camden, 1845, it is apparent that the introduction, hybridization, distribution and export of ornamental garden plants was becoming a growing industry. Of particular interest to the colony's growing plant industry was mention of new varieties of hibiscus and camellia being hybridised at Camden Park.Australian Garden History, Vol 3 No 4.  p10"]}, {"page": "Macleay Island", "response": ["For some time in the 1800s the island was called Tim Shea's Island after a convict who lived on the island for more than a decade. The current name was given by surveyor James Warner who named the island after Alexander Macleay who was the Colonial Secretary of New South Wales from 1825 to 1837.  The island has a rich history of the Aboriginal/indigenous peoples presence with middens and stone fish traps still found on the island."]}, {"page": "George Macleay", "response": ["Macleay was born in London, the third son of Alexander Macleay and educated at Westminster School. He came to Australia in 1826."]}, {"page": "Forest kingfisher", "response": ["The forest kingfisher was first described by the naturalists Sir William Jardine and Prideaux John Selby in 1830. It was known for many years by its old scientific name of Halcyon macleayi before being transferred to the genus Todiramphus. The generic name is derived from the genus Todus (Brisson, 1760), 'tody' (a West Indian insectivorous bird) and Ancient Greek rhamphos, 'bill'. The specific epithet honours the Scottish entomologist and Colonial Secretary to New South Wales Alexander Macleay (1767-1848)."]}, {"page": "Graphium macleayanus", "response": ["Graphium macleayanus, the Macleay's swallowtail, is a butterfly belonging to the family Papilionidae.  The species was named after Alexander Macleay."]}]}}