{"wiki_id": "http://www.wikidata.org/entity/Q2831542", "itemLabel": "Albert Sammons", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Albert_Sammons", "wikipedia_page": {"main": "Albert Edward Sammons CBE (23 February 1886 – 24 August 1957) was an English violinist, composer and later violin teacher. Almost self-taught on the violin, he had a wide repertoire as both chamber musician and soloist, although his reputation rests mainly on his association with British composers, especially Elgar. He made a number of recordings over 40 years, many of which have been re-issued on CD.", "link_mentions": [{"page": "Lionel Tertis", "response": ["Along with William Murdoch (piano), Albert Sammons, and Lauri Kennedy, Tertis formed the Chamber Music Players. He also encouraged and coached Sidney Griller as he worked to found the Griller Quartet in 1928, and influenced the Griller's enthusiasm for the first Viennese School.Obituary, Sidney Griller. The Independent, 23 November, 1993 ", "* Vocalion D-02019 Robert Fuchs: Duet; Handel (arr. Halvorsen): Passacaglia with Albert Sammons"]}, {"page": "Thomas Beecham", "response": ["In 1909, Beecham founded the Beecham Symphony Orchestra.Reid, p. 71 He did not poach from established symphony orchestras, but instead he recruited from theatre bandrooms, local symphony societies, the palm courts of hotels, and music colleges.Reid, pp. 70–71 The result was a youthful team – the average age of his players was 25. They included names that would become celebrated in their fields, such as Albert Sammons, Lionel Tertis, Eric Coates and Eugene Cruft."]}, {"page": "BBC Symphony Orchestra", "response": ["By the time Adrian Boult succeeded Pitt as director of music for the BBC, the violinist Albert Sammons and the violist Lionel Tertis had scouted for new talent around the country on behalf of the corporation. Twenty-seven players had been offered positions in the new orchestra. Among those who joined were Aubrey Brain, Arthur Catterall, Eugene Cruft, Sidonie Goossens, Lauri Kennedy and Frederick Thurston. Although many of the principals were stars recruited from the LSO, the Hallé and other orchestras, a high proportion of the rank and file members were fresh from music colleges.Morrison, p. 73 Boult wrote, \"a brilliant group of young and inexperienced players came to sit behind the well-known old stagers.\"Boult, p. 97"]}, {"page": "Henry Wood", "response": ["Wood's recording career began in 1908, when he accompanied his wife Olga in \"Farewell, forests\" by Tchaikovsky, for the Gramophone and Typewriter Company, better known as His Master's Voice or HMV. They made eight other records together for HMV over the next two years.Jacobs, p. 425 After Olga's death, Wood signed a contract with HMV's rival, Columbia, for whom he made a series of discs between 1915 and 1917 with the singer Clara Butt, including excerpts from Elgar's The Dream of Gerontius.Jacobs, p. 426 Between 1915 and 1925 he conducted 65 recordings for Columbia using the early acoustic recording process, including many discs of Wagner excerpts and a truncated version of Elgar's Violin Concerto with Albert Sammons as soloist.Jacobs, pp. 426–28 When the microphone and electrical recording were introduced in 1925, Wood re-recorded the Elgar concerto, with Sammons, and made 36 other discs for Columbia over the next nine years.Jacobs, pp. 428–29 The 1929 recording of the Elgar concerto has been reissued on compact disc and is well regarded by some critics."]}, {"page": "John Ireland (composer)", "response": ["Ireland began to make his name in the early 1900s as a composer of songs and chamber music. His Violin Sonata No. 1 of 1909 won first prize in an international competition organised by the well-known patron of chamber music W. W. Cobbett. Even more successful was his Violin Sonata No. 2: completed in January 1917, he submitted this to a competition organised to assist musicians in wartime. The jury included the violinist Albert Sammons and the pianist William Murdoch, who together gave the work its first performance at Aeolian Hall in New Bond Street on 6 March that year. As Ireland recalled, \"It was probably the first and only occasion when a British composer was lifted from relative obscurity in a single night by a work cast in a chamber-music medium.\" The work was enthusiastically reviewed, and the publisher Winthrop Rogers offered immediate publication (the first edition was sold out even before it had been processed by the printers). A subsequent performance of the Violin Sonata by Ireland and the violinist Désiré Defauw drew a packed audience to the Wigmore Hall in London.Phillips, Bruce. \"John Ireland's Chamber Music\" in Foreman (2011): p. 227"]}, {"page": "Granville Bantock", "response": ["*Violin Sonata No. 1 in G major (1929, dedicated to Albert Sammons)"]}, {"page": "Malcolm Sargent", "response": ["During the Second World War, Sargent and the Liverpool Philharmonic accompanied Albert Sammons, the dedicatee, in his 1944 recording of the Delius Violin Concerto. Later, in 1965, with Jacqueline du Pré, in her début recording, Sargent recorded Delius's Cello Concerto, coupled with the Songs of Farewell (1965). At the end of the war, Sargent turned to recording Elgar. The first of Sargent's two versions of Elgar's The Dream of Gerontius with Heddle Nash as tenor and the familiar Sargent pairing of the Huddersfield Choral Society and the Liverpool Philharmonic Orchestra was recorded in 1945, and six decades later was still regarded as a classic.BBC CD Review recommendations, p. 196. Retrieved 15 March 2021 Sargent was the conductor for Heifetz's 1949 recording of Elgar's Violin Concerto and Paul Tortelier's first recording of the Cello Concerto in 1954. He also recorded Elgar's Wand of Youth Suite No. 2, with the BBC; the Pomp and Circumstance Marches 1 and 4 with the LSO; and the Enigma Variations with the Philharmonia. He made two recordings of Holst's The Planets: a monaural version with the LSO for Decca (1950) and a stereo version with the BBC for EMI (1960). He also recorded shorter Holst pieces: The Perfect Fool ballet music and the Beni Mora suite."]}, {"page": "Violin Concerto (Elgar)", "response": [" The first complete recording was made in 1929 for Columbia by Albert Sammons with the New Queen's Hall Orchestra conducted by Sir Henry Wood. HMV hoped to record the work with Kreisler, but he proved elusive (believing Elgar to be a poor conductor)Sanders, Alan \"Historic Recordings\", Gramophone, November 1989, p. 196 and HMV's producer, Fred Gaisberg, turned instead to the young Yehudi Menuhin. The recording was made at EMI's Abbey Road Studio 1 in June 1932 and has remained in print on 78, LP and CD ever since. These two recordings typify the two contrasting approaches to the work that have existed ever since: Sammons and Wood, in a brisk performance, take just over 43 minutes to play the work; Menuhin and Elgar, in a more overtly expressive reading take almost 50 minutes.  Other recordings of the monaural era include those by Jascha Heifetz (1949) and Alfredo Campoli (1954). Both these performances are in the Sammons/Wood tradition, taking, respectively, approximately 42 and 45 minutes."]}, {"page": "William Henry Squire", "response": ["For nine successive years in the early 20th century Squire made frequent concert tours of the provinces as a soloist with the contralto singer Clara Butt and her husband, the baritone Kennerley Rumford. During this same period Squire was also associated with the music festivals held at Leeds and Norwich, and Hereford, Worcester and Gloucester (the Three Choirs Festival). He played in trios with William Murdoch (piano) and Albert Sammons (violin) – the \"London Chamber Music Players\", and Frederick Sewell (piano) and Johannes Wolff (violin).", "In 1926 Squire recorded the Saint-Saëns cello concerto No.1 in A minor Op. 33 for Columbia with the Hallé orchestra conducted by Hamilton Harty. He recorded the Elgar cello concerto in c.1930 also for Columbia with the Hallé and Harty – this recording being made at the Free Trade Hall in Manchester.  He also recorded chamber music, for example the Brahms Trio op. 114, in its first recording, with clarinettist Haydn Draper and Hamilton Harty at the piano, and the Beethoven Piano Trio No. 6 in B-flat major Op. 97 \"Archduke\" with William Murdoch (piano) and Albert Sammons (violin) in 1926."]}, {"page": "George Lloyd (composer)", "response": ["George Lloyd showed his talent as a composer early; he began composing at the age of 9, and began serious study at the age of 14. He was mainly educated at home because of rheumatic fever. He was trained in the dramatic aspects of opera by his father, who would regularly give him scenes from English plays to set to music, and he later studied violin with Albert Sammons and composition with Frank Kitson and Harry Farjeon. He was a student at Trinity College London.  His first symphony, written at the age of 19, was premiered in 1932 by the Penzance Orchestral SocietyReport and review in The Cornishman and Cornish Telegraph, Thursday 1 December 1932Grove Music Online (subscription required) and was performed again in 1933 by the Bournemouth Municipal Orchestra, with the composer conducting on both occasions.Lloyd's obituary in The Times mistakenly gave the Bournemouth performance as the premier.  The obituary is reproduced (uncorrected) on www.georgelloyd.com, and the error has been much copied around the web. A second symphony had its premiere in 1935 and was soon followed by a third. George Lloyd and his father William, formed The New English Opera Company in 1935, with the intention of establishing a school of English opera. George Lloyd's first opera, Iernin, with a libretto by his father, was performed in 1934 in Penzance, before being transferred to the Lyceum Theatre, London, where it had an unusually long run. His second opera, The Serf, was staged by Vladimir Rosing at Covent Garden in 1938."]}, {"page": "Piano Quintet (Elgar)", "response": ["The Quintet was first performed on 21 May 1919, by the pianist William Murdoch, the violinists Albert Sammons and W. H. Reed, the violist Raymond Jeremy and the cellist Felix Salmond. These players included some of the composer's musical confidantes – Reed worked with him on the Violin Concerto and the Third Symphony, and Salmond worked on the Cello Concerto with him. Albert Sammons later made the first complete recording of the Violin Concerto."]}, {"page": "Sammons", "response": ["* Albert Sammons, English violinist"]}, {"page": "Hugh Bean", "response": ["He was born in Beckenham.  After lessons from his father from the age of five, he became a pupil of Albert Sammons (and Ken Piper) when he was nine years old.  Later, he attended the Royal College of Music (RCM), where at age 17 he was awarded the principal prize for violin.  A further year's study with André Gertler at the Brussels Conservatory on a Boise Foundation travelling award brought him a double first prize for solo and chamber music playing, and with two other prizewinners he formed the Boise Trio. In 1951, he was awarded second place in the Carl Flesch International Violin Competition."]}, {"page": "William Murdoch (pianist)", "response": ["Murdoch gave recitals in Scandinavia in 1918 and in the following year began his long association with the violinist Albert Sammons, which developed into the formation of the \"Chamber Music Players\". These two with Lionel Tertis and Lauri Kennedy did some remarkable ensemble playing. In 1919 he participated in the premieres of Sir Edward Elgar's Violin Sonata in E minor and Piano Quintet in A minor."]}, {"page": "Concert Artist Recordings", "response": ["Wilhelm Backhaus, William Bennett, Alexander Brailowsky, Wolfgang Böhm, Ferruccio Busoni, Philip Challis, Leonard Cassini, Alfred Cortot, Adrian Creighton, Aeolian String Quartet, John Denman, Arthur Dennington, Ernst von Dohnányi, D’Oyly Carte Opera Company, English National Opera Orchestra, Sir Edward Elgar, Paula Fan, Albert Ferber, Sergio Fiorentino, Paul Freeman, Walter Gieseking, Grigory Ginsburg,  Guildford Philharmonic Orchestra, Vernon Handley, Beatrice Harrison, Sir Hamilton Harty, Joyce Hatto, Henry Holst, Vladimir Horowitz, Edward Kilenyi, René Köhler (long suspected by many to be a fictitious conductor used for the misattributed Hatto recordings and now proven to be), London Mozart Ensemble, London Philharmonic Orchestra, Alan Loveday, Witold Malcuzynski, Mark Manning, Ozan Marsh, Frank Merrick, Benno Moiseiwitsch, Ignace Jan Paderewski, Sergei Rachmaninov, Royal Philharmonic Orchestra, Artur Rubinstein, Artur Schnabel, Albert Sammons, Oda Slobodskaya, Siegfried Schubert-Weber, Lionel Tertis, Rosemary Tuck, Nicholas Zumbro"]}, {"page": "Frances Mason", "response": ["While a child, she studied with violinist Albert Sammons. She subsequently studied under Alan Loveday at the Royal College of Music, London. While there, she was awarded the Violin Prize and both the Tagore and the Worshipful Company of Musicians Medals. Later, she won awards in the Carl Flesch International Violin Competition and in the BBC Violin Competition, and won the National Federation of Music Societies Award for Young Concert Artists."]}, {"page": "Marie Novello", "response": ["Novello evidently had some interest in the mechanical reproduction of sound, as, on 14 June 1924, she participated as a judge in a public competition between gramophones sponsored by The Gramophone magazine. Her fellow judges included Alfred Kalisch, Percy Scholes, Peter Latham, Alec Robertson, and Francis Brett Young. Over the course of the evening, the judges and the audience of 400 marked ballots comparing the performance of some 15 different machines divided into two price classes, nearly all bearing names now long forgotten. She joined her compatriots in unanimous preference for a machine called The Three Muses reproducing the Adagio from Beethoven's Spring Sonata performed by Albert Sammons and William Murdoch; that vote was the sole instance of a unanimous panel, and her other opinions are not recorded. During the interval, the audience was treated to a demonstration of a reproducing piano, but on the Welte-Mignon system, not the Duo Art for which Novello cut a few rolls.\"The Gramophone Tests at the Steinway Hall\", The Gramophone, Vol. II no. 2, July 1924, accessed 19 August 2009]"]}, {"page": "Beatrice Harrison", "response": ["Beatrice was the first performer of Delius's Cello Sonata (Wigmore Hall, 31 Oct 1918): on 11 November, May gave the first performance of the Delius Violin Sonata No. 1, which she later recorded with Arnold Bax at the piano. Roger Quilter attended both performances, for they were also playing his music in concerts at that time. The Violin Concerto, written at Grez-sur-Loing in 1919, had its first performance at Queen's Hall with Albert Sammons (the dedicatee) under Adrian Boult in the same year. Beatrice and her sister gave the first performance of Delius's Double Concerto (which he had completed in 1915 and dedicated to themArthur Hutchings in \"The Concerto\" (Penguin Books, 1952), article on Delius's concertos, page 267.) in his presence at a Queen's Hall Symphony Concert in January 1920. After this Delius returned to Grez and, at Beatrice Harrison's request, began work on his Cello Concerto. She performed the Cello Sonata at a concert in Paris on 8 June. After two months' uninterrupted work in his Hampstead flat, Delius finished the concerto in the spring of 1921, and it was performed by the cellist whom Sir Thomas Beecham called 'this talented lady.' When Delius's remains were re-buried according to his wishes in a southern English country churchyard, on 24 May 1935, the village chosen was Limpsfield near the Harrison home at Oxted in Surrey: Beatrice Harrison played after the service, at which Thomas Beecham gave the oration."]}, {"page": "World Record Club", "response": ["It was during the mid to late 1970s that the Retrospect series came to prominence under the WRC label. These records were dedicated to re-issues of material mostly from 78rpm records, mainly old Columbia and His Master's Voice material from the 1920s to 1940s. There were several major projects, including the reissue of the early Thomas Beecham Delius Society recordings, and welcome returns such as the Albert Sammons/Henry Wood Elgar concerto recording of 1929, or the Gerhard Hüsch lieder recordings. However, the series was wide-ranging and included a large amount of show music and dance music of the 1920s and 1930s."]}, {"page": "London String Quartet", "response": ["*Albert Sammons (1908–1917)", "In 1908 Warwick-Evans was leader of the Queen's Hall violoncellos and Waldo Warner was first viola in the New Symphony Orchestra. Warwick-Evans formed the idea of a string quartet worked up to the standard of a solo virtuoso, and approached Waldo Warner.The primary source for this section is the lengthy and useful article 'British Players and Singers – vii: The London String Quartet, Musical Times 1 August 1922. (See external link). He was enthusiastic, and then Petre was found and finally Albert Sammons, the new Concertmaster of Thomas Beecham's orchestra, to lead the quartet.", "At the outbreak of war, 1914, Warwick-Evans and Waldo Warner could not serve for health reasons. Petre served in France and his place was taken successively by Wynn Reeves, Herbert Kinsey, and Edwin Virgo. Albert Sammons, meanwhile, was building a solo career and had less time for essential rehearsals. In May 1915 the quartet began to give chamber music 'Pops', much liked in wartime London. By May 1917 they had given 50, and at about that time Sammons left and was replaced (July 1917) by James Levey, a pupil of Ferdinand Hill's. The last of these concerts, the 117th, was on 14 July 1919."]}, {"page": "Ethel Hobday", "response": ["Following marriage to Alfred Hobday, she became known as Ethel Hobday, and took part in early recordings of full-length chamber-works (Brahms and Elgar Quintets) with the London Quartet and the Spencer Dyke Quartet. She is the accompanist to violinist Albert Sammons and violist Lionel Tertis in many early recordings."]}, {"page": "Frederick B. Kiddle", "response": ["Kiddle's association with Elwes naturally brought him closely into the world of Roger Quilter's music, which he played with great verve and rhythmical insight. Quilter dedicated one of his Nora Hopper songs, 'Blossom-time', to Kiddle in 1914.V. Langfield 2002, 190. Kiddle's playing as accompanist is heard on most of the recordings of Gervase Elwes, including the Vaughan Williams song cycle On Wenlock Edge with the London String Quartet in 1917. He can also be heard in recordings with Lionel Tertis, Albert Sammons or the tenor Hubert Eisdell, another Quilter dedicatee.Twenty-four tracks of Eisdell accompaniments can be heard on the 'Canadian Historical Sound Recordings' webpage of Library and Archives Canada (Search term: Kiddle)."]}, {"page": "List of classical violinists", "response": ["* Albert Sammons (1886–1957)"]}, {"page": "Stratton Quartet", "response": ["The quartet was named after its leader George Stratton, who was also leader of the London Symphony Orchestra. Watson Forbes studied at the Royal Academy of Music under Editha Knocker and Raymond Jeremy, and played in the Academy quartet as second violin: but, opportunities arising to take on the viola desk he made the transition and viola became his primary instrument. He studied in Pisek, Czechoslovakia with Otakar Ševčík, and in England received lessons from Albert Sammons. Around 1930 he joined the Stratton Quartet and remained with it through the 1930s.", "In 1933 they made their famous recording of the Edward Elgar piano quintet with Harriet Cohen. This was recorded as a present for the composer who was then in his last illness. Albert Sammons and Raymond Jeremy, both of whom had taught Watson Forbes, had taken part in the work's original performance of 1919."]}, {"page": "Arthur Catterall", "response": ["In addition to his orchestral and teaching work, Catterall was active in chamber music throughout his career. In 1915 Frederick Delius wrote a Sonata for violin and piano for Catterall and the pianist R.J. Forbes.T. Beecham, Frederick Delius (Hutchinson, London 1959), 173. He led the Catterall Players, an ensemble for chamber performance, which performed the Elgar quintet in 1921.Obituary of Thomas Facer, Musical Times 62 (no 946), 1 December 1921, p. 872. He had connections with the London Chamber Music Players (led by Albert Sammons), with the pianist William Murdoch (pianist) and 'cellist W. H. Squire, and founded and in 1910 founded and led a string quartet under his own name as the Catterall Quartet. In this John S. Bridge played 2nd violin,Bridge left the quartet in 1925 to succeed Catterall as leader of the Halle (Manchester Guardian 1925) and was replaced at the second violin desk by Leonard Hirsch, see Walter Willson Cobbett, Cyclopedic Guide to Chamber Music, 2nd edn., 3 vols. (London: Oxford University Press, 1963) (1st edn., 1936). Frank S. Park (viola) and Johan C. Hock (cello). Hans Keller described their work as 'imaginative'.H. Keller, The Great Haydn Quartets, p. 238 From 1926 to 1931 Laurance Turner was second violin in the quartet.Who's Who in Music", "In 1932, Granville Bantock dedicated his second violin sonata to Catterall (the first having been to Albert Sammons).Rob Barnett, Insert to CD. DUTTON EPOCH CDLX 7119. Catterall retired from his position with the BBC Orchestra in 1936, to devote his time to solo work and teaching. He formed another chamber orchestra for young string players, The Catterall String Orchestra, led from 1940 to 1943 by Audrey Catterall (b. 1917).Peter Mountain, Scraping a Living (AuthorHouse 2007), pp 123, 264. ]. Mountain asserts that Catterall was a pupil of Joseph Joachim's, though this is not stated in earlier sources used here. For Audrey Catterall, see Who's Who in Music"]}, {"page": "Jean Pougnet", "response": ["His career uninterrupted, Pougnet took an important part in post-war music in Britain. Setting off on his solo career in December 1945, he made an impression with the Ernest Bloch violin concerto in a concert at Covent Garden, and gave the English premiere of a concerto by Richard Arnell. Other composers dedicated works to him. During the winter of 1946–1947 he perfected his interpretation of the Delius concerto with Sir Thomas Beecham, their performances at Croydon (27 October 1946) and at the Delius Festival, Royal Albert Hall (8 November 1946), and at the People's Palace in April 1947, spanning the Abbey Road Studios recording sessions of 31 October and 1 November 1946. The wartime recording of this work by Albert Sammons (said to have \"the dumbfounding splendour of a sunset\"E. Sackville-West and D. Shawe-Taylor, The Record Guide (Collins, London 1951), p. 200.), although preferred by some, was deleted when Pougnet's account was published and this became the standard recording for many years.Delius, Concerto for violin, Royal Philharmonic Orchestra cond. Beecham, HMV DB 6369-71 (78rpm), ALP 1890 (LP) (Delius Centenary vol. 2), rec. 1946. He performed the concerto at a Prom concert in August 1951 with the LSO.BBC Promenade Concerts, Prospectus, 57th Season 1951, p.28."]}, {"page": "Lauri Kennedy", "response": ["In the US during the 1920s, he became principal cellist with the New York Philharmonic at the personal invitation of Arturo Toscanini. He played chamber music with performers such as Arthur Rubinstein and Jascha Heifetz.Myspace: Debbie Kennedy  In the United Kingdom he played in a noted piano quartet called the Chamber Music Players with Albert Sammons, Lionel Tertis and William Murdoch. John White, Lionel Tertisbach cantatas: William Murdoch He also appeared with the tenor John McCormack for a number of years, and appears on record accompanying McCormack.Mick, Joe, John and Maggie"]}, {"page": "William Henry Reed", "response": ["Elgar continued to turn to Reed for advice on technical problems involving the violin, such as the Violin Sonata in E minor, Op. 82 (1918).  The sonata was premiered in 1919 at the Aeolian Hall, London, by Billy Reed, with Landon Ronald at the piano.  Reed also gave the second performance, but the work's main players then became Albert Sammons and William Murdoch.  Reed also participated in the first performances of the String Quartet in E minor, Op. 83 and the Piano Quintet in A minor, Op. 84.   These three works were written concurrently, when Elgar was living at Brinkwells, near Fittleworth in Sussex, and Reed often stayed at his house and went walking with him during this time."]}, {"page": "Kathleen Long", "response": ["Strode, Rosamund. \"Holst, Imogen Clare (1907–1984)\", Oxford Dictionary of National Biography, Oxford University Press, 2004; online edition, January 2011, accessed 3 April 2012  She was a regular performer at the CEMA concerts during World War II, often with the violinist Eda Kersey. Others with whom she frequently appeared were Pablo Casals, Albert Sammons and Guilhermina Suggia, but her longest working partnership was with the violinist Antonio Brosa with whom she collaborated between 1948 and 1966. Her tours included Europe, North America and South Africa."]}, {"page": "Watson Forbes", "response": ["In 1930, he went to Pisek in Czechoslovakia to study with Otakar Ševčík, whose intricate system of exercises revolutionised string playing; he felt he had benefited enormously from this period: \"Sevcik taught me how to practise and how to tackle difficult passages.\" Following this concentration on technique, Forbes had lessons from Albert Sammons. \"He was marvellous. He taught me how to perform—how to put music across to an audience.\""]}, {"page": "Caroline Alice Elgar", "response": ["She died of lung cancer, aged 71, on 7 April, in their home Severn House at 42 Netherhall Gardens in Hampstead.Moore, pp. 750–1. Her funeral was held at St Wulstan's Roman Catholic Church in Little Malvern three days later. Edward was supported by their daughter Carice. Among the mourners was Alice's brother Napier Roberts. There were Elgar's friends Frank Schuster, Billy Reed and Dr. Charles Buck. Sir Charles Stanford arrived but could only speak to Reed before walking away in tears.Reed, p. 67. In the gallery of the church the slow movement from Elgar's String Quartet was played by Reed, Albert Sammons, Lionel Tertis and Felix Salmond.Moore, p. 754."]}, {"page": "Malcolm Sargent discography", "response": ["As a concerto accompanist, Sargent recorded with, among many others, Fritz Kreisler, Artur Schnabel, Jascha Heifetz, Albert Sammons, Clifford Curzon, David Oistrakh, Mstislav Rostropovich, Paul Tortelier, and Jacqueline du Pré. His pre-war recordings with Schnabel of the Beethoven piano concertos have been reissued on compact disc. His association with Heifetz spanned the 78 r.p.m., mono LP and stereo LP eras, and many of their recordings are also available in CD transfers.", "**Violin Concerto: Albert Sammons, Liverpool Philharmonic, Columbia, 1945"]}, {"page": "String Quartet (Elgar)", "response": ["The slow middle movement was a favourite of Elgar's wife Lady Elgar, who described it as \"captured sunshine\". \"At its reprise Elgar seamlessly quotes from his Chanson de matin ... His wife likened the movement to 'captured sunshine' ... He finished [the Quartet] on Christmas Eve 1918.\" It was played at her funeral in 1920, by Albert Sammons, W. H Reed, Lionel Tertis and Felix Salmond. It contains a quotation from Elgar's Chanson de Matin.", "The String Quartet in E minor was dedicated to the Brodsky Quartet,No relation to the Brodsky Quartet formed in 1972. led by Adolph Brodsky, in honour of the promise Elgar had made years earlier to write a work for them. However, the members of the Brodsky Quartet were now around 70 years of age. The Quartet's public premiere was given by Albert Sammons and W. H. Reed, violins; Raymond Jeremy, viola; and Felix Salmond, cello on 21 May 1919, at the Wigmore Hall, London, the Piano Quintet in A minor also receiving its premiere on this occasion. The group was billed as the \"British String Quartet\". (Some sources say the London String Quartet gave the premiere, but Albert Sammons was the only member common to both groups.)"]}, {"page": "List of Minder episodes", "response": ["|colspan=\"3\"|Marty 'Brains' Goldblum, serving a sentence at an open prison, escapes and turns to Arthur for help. Knowing Marty's vast knowledge, Arthur decides to use him as a team member in a pub quiz. But Marty has a minor nervous breakdown and can't go through with the quiz. Ray persuades him to give himself up to police, which he does. The quiz is under way with only Dave and Arthur competing and they're losing heavily. Almost at the last moment, Ray turns up with DC Field (who owes him a favour) and their combined knowledge puts them equal with the opposition. With one tiebreaker to go, Arthur has the answer – identifying a piece of music played by Albert Sammons – and wins for the Winchester. (The episode title spoofs the 1967 film I'll never forget What's 'Isname.)"]}, {"page": "Elgar Violin Concerto discography", "response": ["Edward Elgar's Violin Concerto was first recorded complete in 1929. Truncated versions had been recorded in 1916 using the acoustic recording process, the technical limitations of which necessitated drastic rearrangement of the score. Electrical recording, introduced in the 1920s, gave a greatly improved dynamic range and realism, and the two leading English record companies, Columbia and His Master's Voice (HMV) both made recordings of the concerto that remain in the catalogue. The first was made for Columbia by Albert Sammons with the New Queen's Hall Orchestra conducted by Sir Henry Wood. Elgar's own recording with the young Yehudi Menuhin followed three years later. Since then there have been more than twenty-five further recordings, featuring British and international performers.", "|Albert Sammons", "|Albert Sammons", "**Albert Sammons, New Queen's Hall Orchestra, Sir Henry WoodSammons \"Building a Library\" BBC Radio 3, accessed 24 October 2010"]}, {"page": "Eda Kersey", "response": ["She became friendly with Albert Sammons, who encouraged her to overcome her dislike of the Elgar concerto and include it in her repertoire.  She preferred works such as the violin sonatas of John Ireland, which she played with Kathleen Long.  Her repertoire also included the Violin Concerto by Ernest Bloch."]}, {"page": "Violin Sonata (Elgar)", "response": ["The Violin Sonata in E minor was completed on 15 September 1918, and first performed on 13 March 1919 at a semi-public meeting of the British Music Society by Elgar's friend W. H. Reed with Anthony Bernard on piano. With Elgar present, it received its first public performance on 21 March 1919 in Aeolian Hall, with Reed and Landon Ronald.Jerrold N. Moore, Edward Elgar. A Creative Life, Oxford 1984, pp. 738-9. Albert Sammons and William Murdoch were the sonata's greatest champions in the early years,Classical Archives and they made a recording on 2 February 1935.The Music Parlour ~ Historical (It was also Sammons who made the first complete recording of Elgar's Violin Concerto in B minor.) Earlier, in 1919, a recording was made by Marjorie Hayward and Una Bourne."]}, {"page": "Kutcher String Quartet", "response": ["There were plans for Samuel to join Albert Sammons and Lionel Tertis in a String Quartet to tour the UK, but it did not go ahead because the provinces could or would not pay the fees Sammons was asking. However, with encouragement from Albert Sammons and Giovanni Barbirolli,Biography of John Barbirolli by Charles Reid P40:  Samuel went on to form his own Quartet."]}, {"page": "List of fellows of the Royal College of Music", "response": ["* Albert Sammons, 1944"]}, {"page": "Igor Ozim", "response": ["In 1949 he was awarded a British Council scholarship to study in the United Kingdom.  He spent three months at the Royal College of Music learning the Elgar Violin Concerto in B minor under one of its greatest exponents, Albert Sammons, followed by two years study with Max Rostal."]}, {"page": "Frederick Rosse", "response": ["Five Movements from The Merchant of Venice suite in a 1921 reduction for violin and piano by Albert Sammons are included on the 2002 CD \"Trails of Creativity 1918-1938\" featuring violinist David Frühwirth accompanied by pianist Henri Sigfridsson; AVIE CD0009; UPC 8 22252 0009 2 4. The \"Doge's March\" movement from the same suite in its orchestral form can be heard performed by The New London Orchestra conducted by Ronald Corp on a Hyperion Records CD (British Light Music Classics 4) from 2002. His music had some representation on acetate and LP, including an appearance in a Folkways Records compilation of \"The theatre lyrics of P. G. Wodehouse\" released in 1961.but sung in 1905, with Billy Murray singing \"Put me in my little cell\" from \"Sergeant Brue\", the 1905 London musical that contained Wodehouse's earliest lyrics."]}, {"page": "British Symphony Orchestra", "response": ["The conductors of the orchestra's first incarnation from 1905 included William Sewell, Julian Clifford senior and Hamilton Harty. After WW1 Raymond Roze reformed the orchestra as a properly-constituted, full-time body of musicians. Roze died unexpectedly in 1920 and was succeeded as chief conductor by Adrian Boult, who gave numerous public concerts over several years. Other musicians conducting the orchestras at the time included Samuel Coleridge-Taylor, Franco Leoni, Ralph Vaughan Williams, and Edward Elgar. Members of the orchestra during this period included Albert Sammons and § Frederick Holding as leaders, and Eugene Cruft on bass.", "According to John Lucas, the British Symphony Orchestra was \"formed in 1908 by the Amalgamated Musicians' Union to provide work for its members on Sundays.\" Albert Sammons, the leader, also played in the restaurant band at the Waldorf Hotel, where Thomas Beecham recruited the 23 year-old for his new Beecham Symphony Orchestra.", "Two more Musicians' Union Sunday evening concerts took place on 4 and 18 April 1909 at the Coliseum. The British Symphony Orchestra, led by Albert Sammons, was conducted by Alick Maclean and Joseph Skuse. Held at British Library, Collections.", "Raymond Roze was too ill to conduct a BSO concert on 10 February 1920, and Frank Bridge stepped in. Albert Sammons played Roze's Poem of Victory for violin, and Josef Holbrooke conducted his own early work, The Viking.", "* Albert Sammons - leader in 1909"]}]}}