{"wiki_id": "http://www.wikidata.org/entity/Q2849124", "itemLabel": "Andy Hornby", "itemDescription": "English businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Andy_Hornby", "wikipedia_page": {"main": "Andy Hornby (born 21 January 1967) is an English businessman, currently chief executive of The Restaurant Group, a British chain of restaurants and public houses.", "link_mentions": [{"page": "St Peter's College, Oxford", "response": ["* Andy Hornby, chief executive of Coral, former chief executive of HBOS"]}, {"page": "Dennis Stevenson, Baron Stevenson of Coddenham", "response": ["Stevenson became chairman of Halifax plc in 1999 and when they merged with Bank of Scotland in May 2001 he became chairman of the merged group, HBOS plc. After the collapse of Lehman Brothers in September 2008 and the subsequent forced rescue-merger between HBOS and Lloyds TSB, Stevenson and Andy Hornby resigned, waiving their rights to any \"pay-offs\". At a meeting of the Treasury Select Committee of the House of Commons on 10 February 2009, Stevenson apologised for the near-collapse of HBOS.Sean Farrell, Treasury Select Committee: Bonfire of the bankers The Independent. In April 2013, the Parliamentary Commission on Banking Standards assigned the primary responsibility for the collapse of HBOS to Stevenson along with former chief executives Sir James Crosby and Andy Hornby. The commission urged the regulator to ban all three men from the industry. Their report said: \"Lord Stevenson has shown himself incapable of facing the realities of what placed the bank in jeopardy from that time until now\". And: \"The corporate governance of HBOS at board level serves as a model for the future, but not in the way in which Lord Stevenson and other board members appear to see it. It represents a model of self-delusion, of the triumph of process over purpose\". (Parliament's Banking Standards Commission report, issued in April 2013)"]}, {"page": "Peter Burt", "response": ["By September 2008 HBOS was revealed to be in a poor financial condition and word broke of advanced merger talks with Lloyds TSB, the reports were later confirmed. In light of this development, news surfaced on 8 November of a letter from Burt and his contemporary Sir George Mathewson to HBOS Chairman Lord Stevenson. The letter recommended the immediate resignation of Lord Stevenson and HBOS Chief Executive Andy Hornby. The letter explained that the roles of Chairman and Chief Executive would be filled by Mathewson and Burt respectively and that HBOS would continue to trade as an independent bank majority owned by The Treasury. However the proposal was rejected by the bank in a swift response by Lord Stevenson and failed to win the endorsement of the UK Government The proposal was withdrawn on 20 November 2008."]}, {"page": "James Crosby (banker)", "response": ["Crosby joined the Halifax bank in 1994 as Managing Director of Halifax Life. Five years later, he became the chief executive of Halifax plc, and in 2001 Crosby became the first chief executive of the newly formed HBOS Group after overseeing the merger between Halifax plc and the Bank of Scotland. In early 2006 Crosby retired after seven years as chief executive leaving HBOS as the fourth largest bank in the United Kingdom in terms of market capitalisation. His position was taken by \"his young protégé\" Andy Hornby in July 2006. In April 2013, the Parliamentary Commission on Banking Standards assigned some responsibility for the collapse of HBOS to Crosby, along with primary responsibility to Dennis Stevenson and Andy Hornby.", "The former HBOS manager also said he did not think he would be granted permission to run a bank again. His successor Andy Hornby, who was at the helm of HBOS when it nearly collapsed in 2008, reiterated in a separate testimony at the commission his 'heartfelt apologies for what had happened at HBOS'.", "*Andy Hornby"]}, {"page": "List of Old Cliftonians", "response": ["* Andy Hornby, former Chief Executive of HBOS"]}, {"page": "HBOS", "response": ["Lloyds Banking Group said Edinburgh-based HBOS, which it had absorbed in January, made a pre-tax loss of £10.8 billion in 2008. Andy Hornby, the former chief executive of HBOS, and Lord Stevenson of Coddenham, its former chairman, appeared before the Commons Treasury Committee to answer questions about the near-collapse of the bank. Hornby said: \"I'm very sorry what happened at HBOS. It has affected shareholders, many of whom are colleagues, it's affected the communities in which we live and serve, it's clearly affected taxpayers, and we are extremely sorry for the turn of events that has brought it about.\""]}, {"page": "2009 in the United Kingdom", "response": ["*10 February – The former chief executives of the two British banks hit hardest by the recent banking crisis, Fred Goodwin of Royal Bank of Scotland and Andy Hornby of HBOS, apologise \"profoundly and unreservedly\" for their respective banks' failure in an evidence session with the Treasury Select Committee."]}, {"page": "Hornby (surname)", "response": ["*Andy Hornby (born 1967), English businessman, chief executive of Alliance Boots"]}]}}