{"wiki_id": "http://www.wikidata.org/entity/Q2846736", "itemLabel": "Andrew Simpson", "itemDescription": "British competitive sailor", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Simpson_(sailor)", "wikipedia_page": {"main": "Andrew James \"Bart\" Simpson, MBE (17 December 1976 – 9 May 2013), was an English sailor who won a gold medal at the 2008 Summer Olympics in Beijing, as crew for skipper Iain Percy in the Star class representing Great Britain. Simpson died in the capsize of the catamaran he was crewing on 9 May 2013, while training for the America's Cup in San Francisco Bay.", "link_mentions": [{"page": "December 17", "response": ["*  1976   – Andrew Simpson, English sailor (d. 2013)"]}, {"page": "University College London", "response": ["* Sports people including David Gower (former captain of the England cricket team), Patrick Head (co-founder of the Williams Formula One team), Andrew Simpson (sailor and Olympic gold medalist), and Christine Ohuruogu (Olympic and World 400 metres gold medalist);"]}, {"page": "List of philanthropists", "response": ["* Iain Percy – co-founder of the Andrew Simpson Sailing Foundation which was set up after the death of his best friend Andrew Simpson to facilitate children's access to sailing"]}, {"page": "Sherborne", "response": ["* Olympic sailor Andrew Simpson (1976–2013) lived here."]}, {"page": "List of people associated with University College London", "response": ["* Andrew Simpson (Economics), British Olympic Games Men's Star sailing gold medalist (2008)"]}, {"page": "1976 in the United Kingdom", "response": ["* 17 December – Andrew Simpson, competition sailor (died 2013)"]}, {"page": "Sailing at the 2008 Summer Olympics", "response": ["  |style=\"vertical-align:top;\"|22x20px|border|alt=|link=|Great Britain Great Britain (GBR)Iain PercyAndrew Simpson"]}, {"page": "2007 Louis Vuitton Cup", "response": ["The rest of the crew was navigator Bruno Zirilli; afterguard Andrew Simpson; traveller Gabriele Bruni; runner Anthony Nossiter; trimmers Stefano Rizzi and Christian Scherrer; grinders Michele Gnutti, Chris Brittle and Pawel Bielecki; mast Alejandro Colla; mast/pitman Massimo Galli; sewerman Piero Romeo; mid-bowman Corrado Rossignoli; Andy Fethers; and bowman Jacek Wisoski."]}, {"page": "Sailing at the 2008 Summer Olympics – Qualification", "response": ["|  ||  || 2007 Worlds || 3 || Iain PercyAndrew Simpson || Iain PercyAndrew Simpson"]}, {"page": "Great Britain at the 2008 Summer Olympics", "response": ["|align=left|Iain Percy Andrew Simpson"]}, {"page": "Iain Percy", "response": ["Percy won World Bronze in the Star Class with Andrew Simpson in 2007 and European Championship Gold in 2009.\"Iain Percy Sailing Greats\"  – olympics30.com (Retrieved 11 February 2012) The duo won Gold in the same class of boat at the 2010 World Championships which took place in Brazil. With previous partner, Steve Mitchell, Percy won the 2002 Star World Championships in Los Angeles, and medalled in the next three world championships, winning the bronze medal in each of them.", "At the 2008 Olympics in Beijing he again won a gold medal, this time in the Star class, teaming up with Andrew Simpson.", "At the 2012 Olympics in London he and Andrew Simpson won the silver medal, after a tight race against Swedish duo Fredrik Lööf and Max Salminen."]}, {"page": "Simpson (name)", "response": ["* Andrew Simpson (disambiguation), several people", "** Andrew Simpson (animal trainer) (born 1966/1967), Scottish animal trainer", "** Andrew Simpson (sailor) (1976–2013), British sailor", "** Andrew Simpson (actor) (born 1989), Irish actor", "* Andrew Simpson (Neighbors), from the soap opera Neighbours"]}]}}