{"wiki_id": "http://www.wikidata.org/entity/Q284196", "itemLabel": "Sam Brown", "itemDescription": "English singer and songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Sam_Brown_(singer)", "wikipedia_page": {"main": "Samantha Brown (born 7 October 1964) is an English singer-songwriter, composer, multi-instrumentalist, arranger and record producer.\nBrown is a ukulele player and was a blue-eyed soul and jazz singer. She came to prominence in the late 1980s as a solo artist, and released six singles that entered the UK Singles Chart during the 1980s and 1990s. Her solo singles, sometimes dealing with lost love, include \"Stop!\", \"This Feeling\", \"Can I Get a Witness\", \"Kissing Gate\", \"With a Little Love\" and \"Just Good Friends\". She worked as a session backing vocalist, working with artists such as Gary Moore, George Harrison, Small Faces, Spandau Ballet, Adam Ant, Jon Lord (of Deep Purple), Pink Floyd (also David Gilmour), The Firm, Dodgy and Nick Cave.\nBrown released her debut album Stop! in 1988. Since then, she has released five studio albums, one EP, one live album, and three compilation albums, as well as three albums as part of the group Homespun, but she lost her singing voice in 2007. \n\n", "link_mentions": [{"page": "October 7", "response": ["*1964 – Sam Brown, English singer-songwriter, musician, and record producer"]}, {"page": "Fish (singer)", "response": ["* 1995: \"Just Good Friends\" (feat. Sam Brown)[Single Edit] / \"Somebody Special\" [Radio Edit] / \"State Of Mind\"", "* 1995: \"Just Good Friends\" (feat. Sam Brown) / \"Roadhouse Blues\" [Live Version] / \"Raw Meat\" [Live Version]"]}, {"page": "Nick Cave", "response": ["* Kiss of Love (duet with Sam Brown) from Jools Holland's 2003 album Small World Big Band Friends 3 – Jack o the Green."]}, {"page": "1964 in music", "response": ["*October 7 – Sam Brown, singer, daughter of Joe Brown"]}, {"page": "David Gilmour", "response": ["Taking time off from Pink Floyd's schedule, Gilmour also took up various roles as a record producer, sideman and sound engineer for acts including former bandmate Syd Barrett, Unicorn, Paul McCartney, Arcadia, Berlin, John Martyn, Grace Jones, Tom Jones, Elton John, Eric Clapton, B.B. King, Seal, Sam Brown, Jools Holland, Kirsty MacColl, The Who, Pete Townshend, Supertramp, Levon Helm, Robbie Robertson, Alan Parsons, Peter Cetera and various charity groups among others."]}, {"page": "Concert for George", "response": ["The remainder of the concert featured \"George's Band\" and included the surviving members of the Beatles (Paul McCartney and Ringo Starr), Harrison's son Dhani Harrison, as well as musicians Eric Clapton, Jeff Lynne, Tom Petty and the Heartbreakers, Billy Preston, Jools Holland, Albert Lee, Sam Brown, Gary Brooker, Joe Brown, Ray Cooper, Andy Fairweather-Low, Marc Mann, Dave Bronze, Klaus Voormann,  Jim Keltner and several other musicians who had appeared on Harrison's recordings over the years.", "The event was filmed and a motion picture version, directed by David Leland and photographed by Academy Award-winning cinematographer Chris Menges, was released on DVD on 17 November 2003. A compact disc version was also released on the same date although the Monty Python and Sam Brown tracks were not included on the CD. A Blu-ray version was released by Rhino Records on 22 March 2011.", "#*Sam Brown: lead vocals; Jools Holland: piano; Jim Capaldi: drums", "*Katie Kissoon, Tessa Niles, Sam Brown– backing vocals"]}, {"page": "Joe Brown (singer)", "response": ["In 2008, Brown's 50th anniversary celebrations included a UK gold album for sales over 100,000 copies of Joe Brown - The Very Best Of, a 37-date spring tour, an all-star concert at the Royal Albert Hall with Mark Knopfler, Jools Holland, Dennis Locorriere, Dave Edmunds, Sam Brown, Chas & Dave and others, and a 36-date autumn-winter tour.", "Brown married Victoria Mary Haseman, a singer with both the Vernons Girls and the Breakaways, who then became known as Vicki Brown.  Latterly a session singer, she died of cancer in 1991. Their daughter, Sam Brown, is also a singer, and their son, Pete Brown, is a record producer, who produced all but one of Brown's nine most recent albums, and also tours with him. In 2000, Joe Brown married Manon Pearcey, former partner of the former Small Faces singer Steve Marriott."]}, {"page": "Jon Lord", "response": ["During his tenure in Whitesnake, Lord had the opportunity to record two distinctly different solo albums. 1982s Before I Forget featured a largely conventional eight-song line-up, no orchestra and with the bulk of the songs being either mainstream rock tracks (\"Hollywood Rock And Roll\", \"Chance on a Feeling\"), or – specifically on side two – a series of very English classical piano ballads sung by the mother and daughter duo Vicki Brown and Sam Brown (wife and daughter of entertainer Joe Brown) and vocalist Elmer Gantry as well as piano and synthesiser instrumentals such as Burntwood, named after Lord's stately Oxfordshire home at the time. The album also boasted the cream of British rock talent, including the session drummer (and National Youth Jazz Orchestra alumnus) Simon Phillips, Cozy Powell, Neil Murray, Simon Kirke, Boz Burrell and Mick Ralphs.", "Pictured Within and Beyond the Notes provide the most personal work by Lord. He collaborated with former ABBA superstar and family friend Frida (Anni-Frid Lyngstad) on the 2004 track, \"The Sun Will Shine Again\" (with lyrics by Sam Brown), and performed with her across Europe. He subsequently also performed European concerts to première the 2007-scheduled orchestral piece Boom of the Tingling Strings.", "*1990 April Moon (Sam Brown, \"Contradictions\")"]}, {"page": "The Firm (album)", "response": ["*Sam Brown, Helen Chappelle & Joy Yates – backing vocals on \"You've Lost That Lovin' Feeling\" & \"Midnight Moonlight\""]}, {"page": "All Things Must Pass", "response": ["Titled All Things Must Pass: 30th Anniversary Edition, the new album contained five bonus tracks, including \"I Live for You\",Ingham, p. 133. two of the songs performed for Spector at EMI Studios in May 1970 (\"Beware of Darkness\" and \"Let It Down\") and \"My Sweet Lord (2000)\", a partial re-recording of Harrison's biggest solo hit.Leng, pp. 284–85. In addition, Harrison resequenced the content of Apple Jam so that the album closed with \"Out of the Blue\", as he had originally intended. Assisting Harrison with overdubs on the bonus tracks were his son, Dhani Harrison, singer Sam Brown and percussionist Ray Cooper, all of whom contributed to the recording of Brainwashed around this time.Leng, pp. 299, 304. According to Scott, Harrison had suggested they include a bonus disc containing recollections from some of the album's contributors, starting with Ringo Starr. The idea was abandoned since Starr could not remember playing on the sessions at all.", "* Sam Brown – vocals, backing vocals (2001 reissue only)"]}, {"page": "The Division Bell", "response": ["Keyboardist Jon Carin, percussionist Gary Wallis, and backing vocalists including Sam Brown and Momentary Lapse tour singer Durga McBroom were brought in before recording began. The band moved to Olympic Studios and recorded most of the tracks over the space of a week. After a summer break, they returned to Astoria to record more backing tracks. Ezrin worked on the drum sounds, and Pink Floyd collaborator Michael Kamen provided the string arrangements, which were recorded at Abbey Road Studio Two by Steve McLaughlin. Dick Parry played saxophone on his first Pink Floyd album for almost 20 years, on \"Wearing the Inside Out\", and Chris Thomas created the final mix. Between September and December recording and mixing sessions were held at Metropolis Studios in Chiswick and the Creek Recording Studios in London. In September, Pink Floyd performed at a celebrity charity concert at Cowdray House, in Midhurst. The album was mastered at the Mastering Lab in Los Angeles, by Doug Sax and James Guthrie.", "With the aid of Gilmour's guitar technician, Phil Taylor, Carin located some of Pink Floyd's older keyboards from storage, including a Farfisa organ. Sounds sampled from these instruments were used on \"Take It Back\" and \"Marooned\". Additional keyboards were played by Carin, along with Bob Ezrin. Durga McBroom supplied backing vocals alongside Sam Brown, Carol Kenyon, Jackie Sheridan, and Rebecca Leigh-White.", "Two days after the album's release, the Division Bell Tour began at Joe Robbie Stadium, in suburban Miami. The set list began with 1967's \"Astronomy Domine\", before moving to tracks from 1987's A Momentary Lapse of Reason, and The Division Bell. Songs from Wish You Were Here and The Wall were featured, as well as the whole Dark Side of the Moon. Backing musicians included Sam Brown, Jon Carin, Claudia Fontaine, Durga McBroom, Dick Parry, Guy Pratt, Tim Renwick, and Gary Wallis. The tour continued in the US through April, May and mid-June, before moving to Canada, and then returning to the US in July. As the tour reached Europe in late July, Waters declined an invitation to join the band, and later expressed his annoyance that Pink Floyd songs were being performed again in large venues. On the first night of the UK leg of the tour on 12 October, a 1,200-capacity stand collapsed, but with no serious injuries; the performance was rescheduled.", "*Sam Brown – backing vocals"]}, {"page": "Echoes: The Best of Pink Floyd", "response": ["*Sam Brown – backing vocals on \"Keep Talking\""]}, {"page": "Delicate Sound of Thunder", "response": ["Although David Gilmour stated around the time of its release and on a radio interview in 1992 that the album contained no studio overdubbing whatsoever, he embellished the tracks during mixing with some extra acoustic guitar on \"Comfortably Numb\", according to engineer Buford Jones. In addition, some harmonies were replaced by studio re-takes: Richard Wright re-did his vocal on \"Time\" and Sam Brown replaced Rachel Fury's part in \"Comfortably Numb\"The Live Albums but the rest of the album is as performed at the shows."]}, {"page": "Jamelia", "response": ["In mid-2004, Jamelia collaborated with Italian singer Tiziano Ferro on \"Universal Prayer\" for the 2004 Olympic Games soundtrack. It became her first Number 1 single in Italy and Spain and was added to non-UK editions of Thank You. In late 2004, Jamelia was asked to contribute to the Band Aid 20 charity single \"Do They Know It's Christmas?\", on which she sang with Will Young. The single topped the UK Singles Chart and was certified platinum. Around the same time, Jamelia released the lead single from the soundtrack of the film Bridget Jones: The Edge of Reason, a cover of Sam Brown's 1988 single \"Stop!\"; it was released as double A-side in the UK with the aforementioned \"DJ\", and peaked at number nine. "]}, {"page": "Kane Gang", "response": ["Their debut album, The Bad and Lowdown World of the Kane Gang (released in the US as Lowdown), was released the following year. It spawned two UK hit singles: \"Closest Thing to Heaven\" (No. 12) and a cover of The Staples Singers' \"Respect Yourself\" (No. 21). The latter was also a hit in Australia, reaching No. 19. The album was produced by Pete Wingfield, and featured P. P. Arnold and Sam Brown as backing vocalists."]}, {"page": "The Great Gig in the Sky", "response": ["The 1994 live album P•U•L•S•E features a version sung by Sam Brown, Durga McBroom and Claudia Fontaine. When the Floyd's manager, Steve O'Rourke, died in 2003, Gilmour, Wright, and Mason played \"Fat Old Sun\" and \"The Great Gig in the Sky\" at O'Rourke's funeral. According to Durga McBroom, Richard Wright liked her version the best. As per his wishes, she sang the song at Wright's funeral."]}, {"page": "Pulse (Pink Floyd album)", "response": ["*Sam Brown – backing vocals, first vocalist on \"The Great Gig in the Sky\""]}, {"page": "Holland–Dozier–Holland", "response": ["|  style=\"text-align:left; vertical-align:top;\"|Dusty Springfield, The Rolling Stones, Sam Brown, The Steampacket, Lee Michaels, The Temptations, The Supremes, Z. Z. Hill"]}, {"page": "David Gilmour in Concert", "response": ["*Gospel Choir – Sam Brown (choir leader), Chris Ballin, Pete Brown, Margo Buchanan, Claudia Fontaine, Michelle John Douglas, Sonia Jones, Carol Kenyon, David Laudat, Durga McBroom, Aitch McRobbie (solo on Smile), Beverly Skeete"]}, {"page": "Afrodiziak", "response": ["Afrodiziak was a British singing group composed of Caron Wheeler, Claudia Fontaine, and later Naomi Thompson, that was active in the 1980s. As a duo, Wheeler and Fontaine were best known for performing backing vocals on the Jam's final single \"Beat Surrender\" in 1982 (on whose final tour they performed) and Elvis Costello's 1983 album Punch the Clock, especially its lead single, the international hit \"Everyday I Write the Book\". After the addition of Naomi Thompson as a third member, Afrodiziak performed backing vocals on the hit single \"Free Nelson Mandela\", including the a cappella intro, staging it on Channel 4's music show The Tube in March 1984. Heaven 17's 1984 album How Men Are featured them prominently, especially on the singles \"Sunset Now\" and \"And That's No Lie\". Afrodiziak performed on Madness's albums Keep Moving and Mad Not Mad in 1984 and 1985, appearing in the video for that group's single \"Sweetest Girl\". Also in 1985 they performed backing vocals on the first two songs on Howard Jones' second album, Dream Into Action, both of which (\"Things Can Only Get Better\" and \"Life in One Day\") became worldwide hit singles; later that year, they went on tour as part of Jones's band. Other acts the group sang backup for include Japan, Ian Gillan, Aztec Camera, Maxi Priest, Aswad, Sam Brown, and Julia Fordham. Besides The Tube, Afrodiziak also appeared on Top of the Pops, The Old Grey Whistle Test, Solid Gold, and American Bandstand. They performed live at the Montreux Jazz Festival, Live Aid Japan, Red Nose Day of Charity, and the first Free Nelson Mandela Concert."]}, {"page": "Brainwashed (George Harrison album)", "response": ["*Sam Brown – backing vocals (12)"]}, {"page": "About Face (album)", "response": ["Gilmour said he wanted to take his time and make \"a really good album\" and \"get the best musicians in the world that I could get hold of to play with me.\" Musicians on the album include drummer Jeff Porcaro, bass guitarist Pino Palladino, Deep Purple keyboardist Jon Lord, backing vocalists Roy Harper, and Sam Brown, orchestral arranger Michael Kamen (who had also worked on The Pros and Cons of Hitch Hiking and The Wall), and keyboardist Steve Winwood.", "*Sam Brown – backing vocals"]}, {"page": "Sam Brown", "response": ["Sam Brown may refer to:", "* Sam Brown (frontiersman) (1845–1925), American frontiersman, educator, civic leader, advocate for Native Americans, and historian", "* Sam Brown (outlaw) (1831–1861), American gunfighter in the Wild West", "* Sam Brown (activist) (born 1943), organized the Moratorium to End the War in Vietnam", "* Sam Brown (Rastafari) (1925–1998), Jamaican Rastafarian elder and roots reggae singer and poet", "* Sam Brown (guitarist) (1939–1977), American jazz guitarist with Thad Jones/Mel Lewis Big Band", "* Sam Brown (singer) (born 1964), English singer/songwriter, daughter of singer Joe Brown", "* Sam Brown III (born 1947), AKA Samm Brown, American songwriter, record producer, arranger and composer worked a lot with African American artists", "* Sam Brown (comedian) (born 1981), American comedian, founding member of sketch troupe Whitest Kids U Know", "* Sam Brown (artist), American artist and author, noted for his exploding dog web site", "* Sam Brown (baseball) (1878–1931), Major League Baseball player", "* Sam Brown (soccer) (born 1996), American soccer player", "* Sam Browne (disambiguation)", "* Sam Brown House, an 1857 historic house built by the above-named senator"]}, {"page": "Concerto for Group and Orchestra", "response": ["**Sam Brown", "#\"Wait A While\", performed by Jon Lord and Sam Brown"]}, {"page": "My Sweet Lord", "response": ["In January 2001, Harrison included a new version of the song as a bonus track on the remastered All Things Must Pass album. \"My Sweet Lord (2000)\" featured Harrison sharing vocals with Sam Brown, daughter of his friend Joe Brown,Clayson, George Harrison, pp. 446, 457. backed by mostly new instrumentation, including acoustic guitar by his son Dhani and tambourine by Ray Cooper.George Harrison's liner notes, booklet accompanying All Things Must Pass reissue (Gnome Records, 2001; produced by George Harrison & Phil Spector). The track opens with a \"snippet\" of sitar, to \"emphasize its spiritual roots\", Leng suggests.Leng, p. 285. On release, Harrison explained that his motivation for remaking the song was partly to \"play a better slide guitar solo\". He also cited the \"spiritual response\" that the song had traditionally received, together with his interest in reworking the tune to avoid the contentious musical notes, as further reasons.Interview with Chris Carter (recorded Hollywood, CA, 15 February 2001) on A Conversation with George Harrison, Discussing the 30th Anniversary Reissue of \"All Things Must Pass\", Capitol Records, DPRO-7087-6-15950-2-4; event occurs between 5:28 and 7:05. Of the extended slide-guitar break on \"My Sweet Lord (2000)\", Leng writes: \"[Harrison] had never made so clear a musical statement that his signature bottleneck sound was as much his tool for self-expression as his vocal cords.\" Elliot Huntley opines that Harrison's vocal was more \"gospel inflected\" and perhaps even more sincere than on the original recording, \"given his deteriorating health\" during the final year of his life.Huntley, pp. 306–07."]}, {"page": "You Gotta Sin to Get Saved", "response": ["#\"I Forgive You\" (Sam Brown, McKee) – 5:06"]}, {"page": "Donmar Warehouse", "response": ["*Divas at the Donmar with Patti LuPone, Audra McDonald and Sam Brown (9 August–4 September 1999)"]}, {"page": "Herbie Flowers", "response": ["With Sam Brown"]}, {"page": "List of number-one singles in Australia during the 1980s", "response": ["Other major hits (with peak positions noted) included \"Baby I Don't Care\" (3) by Transvision Vamp, \"Poison\" (3) by Alice Cooper, \"Stop!\" (4) by Sam Brown, \"Talk It Over\" (4) by Grayson Hugh, \"Dressed for Success\" (3) by Roxette, \"You Got It\" (3) by Roy Orbison, \"The Best\" (4) by Tina Turner, and \"I Don't Want a Lover\" (4) by Texas."]}, {"page": "Can I Get a Witness", "response": ["English singer Sam Brown included the song on her Stop! album in 1988."]}, {"page": "Edyta Górniak", "response": ["After taking singing lessons, in 1989, aged 16, she gave her first public appearance on a Polish television talent show where she won with Sam Brown's hit song \"Stop!\". In 1990 she performed on the Opole Polish Song Festival in a contest for debuting singers with an honourable mention. During the next three years she performed in music theatres. She was the star of the musical Metro (\"Subway\") – the most popular and longest running homegrown musical in Polish history, which brought her to Broadway. In New York she was also offered a job by the Elite model agency, but she rejected it preferring to continue her career as a singer. Later she sang in next three musicals in Poland: Do grającej szafy grosik wrzuć (\"Put a Dime in the Jukebox\") with classic Polish pop songs from the pre-rock'n'roll era, Blues Minus with songs of Polish author Jonasz Kofta and Brel with Polish versions of songs sang by the Belgian singer-songwriter Jacques Brel. In 1993 Górniak took part in the Baltic Song Contest in Sweden and finished in third place."]}, {"page": "David Rotheray", "response": ["Homespun originally featured Rotheray and Sam Brown. The band released three albums. Brown was replaced by Helen 'Aitch' McRobbie as lead vocalist before Homespun split up in 2008. Rotheray concentrated on a solo project involving different singers from the contemporary scene.", "*\"Void\"  (Brown/Rotheray) - appeared on the Sam Brown EP, Ukulele and Voice (2006)"]}, {"page": "Caron Wheeler", "response": ["In 1982, Wheeler met Claudia Fontaine, an English backing vocalist from Bethnal Green, London, England. They formed a duo known as Afrodiziak. The duo only performed as session vocalists for other singers, most notably for Elvis Costello on his album Punch the Clock in 1983. Afrodiziak later toured as backing vocalists for Elvis Costello during his UK tour in 1983. After the tour, they became a group by adding singer Naomi Thompson. The group would go on to contribute background vocals for many artists including Heaven 17, Special AKA, Howard Jones, Japan, Aswad, Sam Brown, and Julia Fordham. In 1988, Wheeler withdraw from the group."]}, {"page": "After the War (Gary Moore album)", "response": ["*Sam Brown, Miriam Stockley – backing vocals on \"Ready for Love\""]}, {"page": "Todd Sharpville", "response": ["Between 2005 and 2007, Sharpville was the European opening act for Pink, Joe Cocker, and B.B. King. He is still due to release his singer/songwriter album, Diary of a Drowning Man. This is a \"confessional\" album, inspired by his divorce. It features a duet with British vocalist Sam Brown (\"Sweet Redemption\"), and was co-produced by ex-Stone Roses record producer Dave Hyatt and Robbie Williams producer Steve Power. His new blues double album, Porchlight, was released on 29 October 2010 by the MiG Music record label. This was produced in Rhode Island by Duke Robillard and features contributions by Robillard, Joe Louis Walker and Kim Wilson of the Fabulous Thunderbirds."]}, {"page": "Jeff Stewart (actor)", "response": ["| Sam Brown"]}, {"page": "New Art Riot", "response": ["New Art Riot was recorded in March 1990 at Workshop Studios in Redditch, Worcestershire, England. It was produced by Robin Wynn Evans of The View, Sam Brown and Dodgy fame. When Edwards asked for the sound of a guitar smashing to be added to one of the tracks, Evans replied \"smash your guitar then!\" The dismembered neck of the guitar was then signed by the band and Evans, and was used as a doorstop at his Perthshire T Pot studio."]}, {"page": "Concert for George (album)", "response": ["In 2005, the Concert for George DVD won the Best Long Form Video Grammy. Directed by David Leland, it contains material not found on the album, including \"Sit on My Face\" and \"The Lumberjack Song\" by Monty Python, and \"Horse to the Water\", featuring Jools Holland with vocals by Sam Brown, daughter of English singer Joe Brown.", "In 2018, Concert for George was released in several packages and formats, including 180-gram vinyl LP records, to celebrate Harrison's 75th birthday. The new vinyl and digital edition included additional tracks not present on both the original and 2018 reissue CD editions: \"Sit on My Face\" and \"The Lumberjack Song\" by Monty Python, and \"Horse to the Water\" by Sam Brown."]}, {"page": "Too-Rye-Ay", "response": ["* Sam Brown – vocals"]}, {"page": "Danny Thompson", "response": ["*Sam Brown: Stop! (1988)"]}, {"page": "Samantha", "response": ["* Sam Brown (born 1964), English singer"]}, {"page": "High Hopes (Pink Floyd song)", "response": ["*Sam Brown – backing vocals"]}, {"page": "À la Recherche de la Nouvelle Star", "response": ["|\"Stop!\" (Sam Brown)"]}, {"page": "Idool 2003", "response": ["|\"Stop!\" (Sam Brown)"]}, {"page": "Idol 2005 (Sweden)", "response": ["|\"Stop!\" (Sam Brown)"]}, {"page": "Cveta Majtanović", "response": ["*Top 3: \"Stop!\" by Sam Brown"]}]}}