{"wiki_id": "http://www.wikidata.org/entity/Q28421904", "itemLabel": "Willie McQueen", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Willie_McQueen_(bowls)", "wikipedia_page": {"main": "Willie McQueen was a Scottish international lawn and indoor and indoor bowler.", "link_mentions": [{"page": "Willie McQueen", "response": ["Willie McQueen (1986) is a double amputee from Flint, Michigan who gained substantial renown by starting for his school's football team.", "Willie McQueen was born on September 6, 1986 in Selma, Alabama. ", "In an article published by the Associated Press, McQueen cited the San Francisco 49ers as his favorite team, and stated the goals of playing for the 49ers and becoming a coach after graduation. After reading about McQueen's story, Ray Carolin, a former United States Secret Service Special agent living in Palm Springs, CA was motivated to touch McQueen's life in a positive way. Carolin reached out to 49er head coach Steve Mariucci, a graduate of Northern Michigan University where Carolin had played football, and together the former Secret Service agent and 49er head coach flew Willie McQueen and his mother to San Francisco as their a guest for the weekend. McQueen met with team players on December 16, 2000, then attended the team's game against the Chicago Bears the next day. Calling McQueen an \"inspiration\", wide receiver Terrell Owens promised to catch a touchdown for his visitor, then did so and delivered the ball to McQueen after the game. Four years later, former 49ers coach Steve Mariucci brought McQueen as a guest to the practice facility of his new team, the Detroit Lions.\"Lions Host Special Guests At Practice Facility\", David Studley, DetroitLions.com, posted December 31, 2004, accessed August 18, 2006.      "]}, {"page": "1980 World Outdoor Bowls Championship", "response": ["||  John Summers David McGill  Willie McQueen ", "||  John Summers Willie McQueen Alex McIntosh  Willie Wood  ", "|2 || align=\"left\"| John Summers, David McGill & Willie McQueen       || 19 || 16 || 1 || 2 || 33", "|2 || align=\"left\"| John Summers, Willie McQueen, Alex McIntosh & Willie Wood    || 19 || 14 || 1 || 4 || 29"]}, {"page": "David McGill (bowls)", "response": ["McGill won a silver medal in the triples with John Summers and Willie McQueen  and two bronze medals in the singles and team event (Leonard Trophy) at the 1980 World Outdoor Bowls Championship in Melbourne."]}]}}