{"wiki_id": "http://www.wikidata.org/entity/Q2846576", "itemLabel": "Andrew Burt", "itemDescription": "British actor (1945-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Burt", "wikipedia_page": {"main": "Andrew Thomas Hutchison Burt (23 May 1945 – 16 November 2018) was a British actor, voiceover artist, and counsellor.", "link_mentions": [{"page": "Inspector Morse", "response": ["An adaptation by Melville Jones of Last Bus to Woodstock featured in BBC Radio 4's Saturday Night Theatre series in June 1985, with Andrew Burt as Morse and Christopher Douglas as Lewis."]}, {"page": "Jackanory", "response": ["* The Lightkeepers (1983), read by Andrew Burt", "*The Dangerous Journey (1983), read by Andrew Burt", "*Andrew Burt"]}, {"page": "Robert FitzRoy", "response": ["The BBC made a BAFTA award-winning television series in 1978 titled The Voyage of Charles Darwin where Captain Robert Fitzroy was played by actor Andrew Burt with Malcolm Stoddard as Darwin with a storyline that followed the historic interaction between Darwin and FitzRoy before and after their time together on HMS Beagle."]}, {"page": "Albert Campion", "response": ["In 1989 and 1990, the first eight of the novels (excluding The Crime at Black Dudley) were adapted over two seasons, with each story shown in two hour-long episodes. Peter Davison played Campion, Brian Glover was Lugg and Andrew Burt was Oates."]}, {"page": "Chocky", "response": ["BBC Radio 4 presented a reading by Andrew Burt of the novel in seven 15-minute episodes, abridged by Neville Teller, produced by David Johnson, and broadcast daily between 19 and 27 May 1975."]}, {"page": "Look Around You", "response": ["* Andrew Burt: \"Sebastian Jackson\" and two of his clones, \"Provastian Jackson\" and \"Ninastian Jackson\", designers of special footballs including \"invisiball\", \"footcube\", \"meat-ball\", \"piggy ball\" and \"the world's roundest ball\"."]}, {"page": "List of James Bond villains", "response": ["| Jonathan Pryce (likeness)Andrew Burt (voice)"]}, {"page": "Jack Sugden", "response": ["Jack Sugden is a fictional character from the British ITV soap opera Emmerdale. The character was originally played by Andrew Burt from 1972 to 1973 with a brief return in 1976, when the actor left for Italy to write a book. On his return in 1980 he was played by Clive Hornby. Hornby remained in the role until 2008 when he was forced to take a break from Emmerdale due to illness. His last on-screen appearance was on 21 February 2008, and his absence was explained by the character visiting his mother, Annie Sugden (Sheila Mercier) in Spain. Although Hornby was intended to return, he died from his illness in July 2008 without returning to the programme. Jack was written out following Hornby's death, dying off-screen of a heart attack in February 2009."]}, {"page": "Juliet Bravo", "response": ["A number of famous names, either of the time or of the future, appeared in the show. They included David Ryall, Kevin Whately, Eric Richard, Jeff Rawle, Jean Boht, Patricia Hayes, Peter Jeffrey, Peter Martin, Brenda Fricker, David Daker, Andrew Burt, Frances White, Malcolm Terris, Joe Gladwin, Sara Sugarman, Tenniel Evans, Nadim Sawalha, Jack Smethurst, John Savident, William Gaunt, Colin Baker, Kenneth Waller, Rita May, Stephen Yardley, John Woodvine, Stephen McGann, Leslie Schofield, Alan Parnaby, Shirley Stelfox, Maggie Ollerenshaw, John Quarmby, Neil Morrissey, Del Henney, Iain Cuthbertson, Leslie Sands, Hilda Braid, Melanie Hill, John Challis, Paul Chapman, Simon Williams, Christopher Ettridge, George Irving, Bill Wallis, Carolyn Pickles, Jonathan Newth, Kenneth Cope, Sally Whittaker, Karl Howman, Diana Coupland, Martin Jarvis, Rosalind Ayres, Yvette Fielding, Bert Parnaby, Robert Glenister, Mona Hammond, Steve Hodson, Danny O'Dea and Bernard Kay."]}, {"page": "Play of the Month", "response": ["|Michael Pennington,Laura Davenport,Nigel Havers,Charles Keating,John Shrapnel,Charles Kay,Gordon Gostelow,Michael Graham Cox,Michael N. Harbour,Martin Clunes,Glen Murphy,John Ringham,Oliver Smith,Walter Sparrow,John Abineri,Andrew Burt,Geoffrey Beevers"]}, {"page": "4.50 from Paddington", "response": ["**Andrew Burt – Dr Quimper"]}, {"page": "Campion (1989 TV series)", "response": ["Campion is a British television mystery drama first broadcast on the BBC on 22 January 1989. Each of the eight stories featured across the two series, broadcast in 1989 and 1990 respectively, are adapted from the Albert Campion mystery novels written by Margery Allingham. The series starred Peter Davison as Albert Campion, Brian Glover as his manservant Magersfontein Lugg and Andrew Burt as his policeman friend Stanislaus Oates.http://www.tv.com/shows/campion/ ", "* Andrew Burt as Stanislaus Oates"]}, {"page": "List of Bergerac episodes", "response": ["| Reece Dinsdale, Constance Chapman, Andrew Burt", "| Andrew Burt, Alec Sabin"]}, {"page": "The Case of the Late Pig", "response": ["In two series of BBC adaptations of Allingham's stories entitled Campion (shown in the United States by PBS), Campion was played by Peter Davison, Lugg by Brian Glover and Oates by Andrew Burt. In the first series, Peter Davison sang the title music himself."]}, {"page": "Warship (1973 TV series)", "response": ["* Andrew Burt as Lieutenant Paul Peek, navigating officer (series 3-4)"]}, {"page": "Death of a Ghost", "response": ["The story was again adapted for television by the BBC, the fourth of eight Campion stories starring Peter Davison as Campion and Andrew Burt as Oates. Originally broadcast as two separate hour-long episodes, the original UK air date was 5 March 1989. The series was shown in the United States by PBS."]}, {"page": "List of works based on Arthurian legends", "response": ["* The 1979 mini series The Legend of King Arthur is a BBC adaption of the story produced by Ken Riddington and starring Andrew Burt as Arthur. "]}, {"page": "Annie Sugden", "response": ["The character of Annie Sugden has been described as a firm favourite with viewers, from the opening scene of Emmerdale Farm with Annie standing in the farmhouse kitchen, to the day she left. As peacekeeper between her sons, Joe (Frazer Hines) and Jack (Andrew Burt/Clive Hornby), Annie was soon placed at the centre of the soap's action. The character was involved in numerous storylines, including marriages, bereavements, tragedies and family problems. Commenting on her \"most gripping\" storylines, Mercier has said, \"Annie's daughter, Peggy Skilbeck's (Jo Kendall) death, Peggy's twins' deaths and Annie's father, Sam Pearson's (Toke Townley) death, which all called for lots of tears.\""]}, {"page": "Matt Skilbeck", "response": ["Emmerdale originally centred on the Sudgen family, who ran Emmerdale Farm just outside Beckindale village, with the initial episodes focusing on the death of patriarch Jacob and the return of his eldest son Jack (Andrew Burt), who has been left the farm by his father. Jo Kendall was cast as Matt's wife, Peggy, who resents her brother inheriting the farm as she feels it belongs to the rest of the family. Pyne immediately identified with his character and the Sugden family, explaining: \"When they described Matt and Peggy to me as an ordinary farming couple, with Peggy being the daughter of the Sugdens, I said, 'I know these people.'\" Matt was initially billed as \"a content countryman\" who does not hold the same ambitions as his wife, who had hoped that selling their share of the farm would lead to a move to suburbia. Matt is happiest when he is enjoying his job on the farm and he feels he has done \"a fair day's work\", however, his love for his wife means he will allow her to win and he will break away from the farm for Peggy's happiness."]}, {"page": "Silcoates School", "response": ["* Andrew Burt (1945-2018), Actor"]}, {"page": "Miss Marple (TV series)", "response": ["|Maurice Denham, Joanna David, Jill Meager, Andrew Burt, Jean Boht, John Hallam, David Waller"]}, {"page": "List of Bergerac cast members", "response": ["*Andrew Burt"]}, {"page": "List of University of Kent people", "response": ["*Andrew Burt - actor -  the original Jack Sugden in Emmerdale"]}, {"page": "List of EastEnders characters (1990)", "response": ["| The daughter of Ch. Supt Dave Penton (Andrew Burt). "]}, {"page": "List of former Emmerdale characters", "response": ["|Andrew Burt"]}, {"page": "Last Bus to Woodstock", "response": ["In 1984, a BBC Radio 4 adaptation was released that was dramatised by Melvyn Jones and directed by Brian Miller. The radio play featured  Andrew Burt as Inspector Morse and Christopher Douglas as Sergeant Lewis."]}, {"page": "Ray Gun Revival", "response": ["This incident was one of the issues that caused the future President of SFWA, John Scalzi, to endorse winning candidate Russell Davis over Andrew Burt, head of the ePiracy committee at that time, for President of the organization.John Scalzi, A Gut Check Moment for SFWA, Whatever, \"\""]}, {"page": "List of Emmerdale Farm characters (1972–1973)", "response": ["Marian Rosetti (also Wilks) was first played by Gail Harrison from 1972 to 1978, then by Debbie Blythe for two stints in 1987 and 1988. She first appeared on the show's first ever episode and was the first character to be seen on screen, riding on horseback. She was the daughter of wealthy retired factory owner Henry Wilks (Arthur Pentelow) who later ran the Woolpack with long standing landlord Amos Brearly (Ronald Magill). Marian embarked on a brief affair with Jack Sugden (Andrew Burt) in the first few months of the show."]}, {"page": "List of people from Wakefield", "response": ["* Andrew Burt, actor"]}]}}