{"wiki_id": "http://www.wikidata.org/entity/Q28474453", "itemLabel": "Fady Elsayed", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Fady_Elsayed", "wikipedia_page": {"main": "Fady Elsayed (born 15 September 1993) is a British-Egyptian actor, best known for his role as Ram Singh in the BBC's Doctor Who spin-off Class.", "link_mentions": [{"page": "Black Adam", "response": ["* However, due to the COVID-19 pandemic, filming has since been delayed to April 2021 and its release being pushed back to July 29, 2022. The film will also introduce the Justice Society of America, with Noah Centineo as Atom Smasher, Aldis Hodge as Hawkman, Quintessa Swindell as Cyclone and Pierce Brosnan as Doctor Fate. It was revealed that Rory Haines and Sohrab Noshirvani had written a new draft of the screenplay and that Sarah Shahi had been cast as Isis and Marwan Kenzari had been cast in an undisclosed role. Fady Elsayed was originally cast in the film, but due to COVID-19 his role had to be recast."]}, {"page": "1993 in the United Kingdom", "response": ["* 15 September – Fady Elsayed, actor "]}, {"page": "British Arabs", "response": ["* Fady Elsayed, (British-Egyptian), actor. "]}, {"page": "Egyptians in the United Kingdom", "response": ["*Fady Elsayed: actor, best known for his role as Ram Singh in the BBC's Doctor Who spin-off Class. "]}, {"page": "List of British actors", "response": ["* Fady Elsayed (born 1993)"]}, {"page": "Sally El Hosaini", "response": ["Her debut feature film My Brother the Devil won international awards, including at the 2013 Evening Standard Film Awards, 2012 Sundance Film Festival, 2012 Berlin International Film Festival and 2012 BFI London Film Festival Awards, amongst others. It stars Fady Elsayed, BIFA Award winning James Floyd and César Award nominated actor Saïd Taghmaoui. It was filmed on location in Hackney, London."]}, {"page": "Fady", "response": ["*Fady Elsayed (born 1993), British actor"]}, {"page": "List of British films of 2012", "response": ["|| Director: Sally El Hosaini   Cast: James Floyd, Fady Elsayed, Saïd Taghmaoui"]}, {"page": "My Brother the Devil", "response": ["It stars James Floyd, Fady Elsayed and Saïd Taghmaoui. It tells the story of two sons of Egyptian immigrants coming of age in east London. It was released in UK on 9 November 2012 and was in US cinemas from 22 March 2013. Further releases in Canada, Germany, Australia and New Zealand.", "Mo (Fady Elsayed) and Rashid \"Rash\" (James Floyd) are teenage brothers of Egyptian descent living with their parents in Hackney. Elder brother Rash is fiercely protective of Mo, giving him a TV when he does well and encouraging him to stay in school. However Mo begins to want to emulate Rash who works as a low level drug dealer, and is able to use money from his job to pay for small luxuries to make their lives more comfortable.", "*Fady Elsayed as Mo", "* Nominated Best Newcomer - Fady Elsayed at BFI London Film Festival"]}, {"page": "Ashley Chin", "response": ["Ashley Chin released an autobiography titled Faith in October 2019. Chin stated that he learnt more from travelling the world than he did from school. Saying that \"I spoke about my life and changed peoples lives. Yesterday I was born, today I live, tomorrow I die. I put it all in a book for them to remember me by\". The following month in November 2019, Chin announced that he is directing and writing a movie based on the book. It is a coming of age story about a South London boy who finds faith in Islam to escape gang life. He travels to Egypt to find his faith in life again but he must return to keep a commitment to his best friend's, fatherless daughter and face the past.  It's a feature film based on the true story of Ashley Chins life. It follows the life of a young South London boy Ash, and his journey to finding the meaning in life and discovering the religion of Islam. It stars Hope Ikpoku, Keira Chansa and Fady Elsayed and is set to be released early 2020."]}, {"page": "List of LGBT-related films of 2012", "response": ["| My Brother the Devil || Sally El Hosaini || United Kingdom || Drama || James Floyd, Fady Elsayed, Saïd Taghmaoui||"]}, {"page": "2012 BFI London Film Festival Awards", "response": ["*Fady Elsayed for My Brother the Devil (actor)"]}, {"page": "Little Simz", "response": ["Ajikawo lives in London. She is a childhood friend of actor Fady Elsayed. In 2018 her friend, model Harry Uzoka, was murdered, inspiring her to write her song \"Wounds\". Ajikawo is a supporter of Arsenal F.C."]}, {"page": "Sixteen (2013 British film)", "response": ["SIXTEEN is the debut feature from award-winning director Rob Brown starring Roger Nsengiyumva, Rosie Day, Rachael Stirling, Fady Elsayed, Sam Spruell, and Deon Williams. Sixteen was first premiered at the 2013 BFI London Film Festival. It was nominated for The Sutherland Award for Best Debut Feature, and director Rob Brown was nominated for Best British Newcomer."]}, {"page": "Doctor Who (series 10)", "response": ["In June 2016, it was announced that Stephanie Hyam would be joining the tenth series. In July 2016, actors Mina Anwar, Ralf Little, and Kaizer Akhtar had been added to the cast and portrayed Goodthing, Steadfast, and Praiseworthy respectively in the second episode. On 16 August 2016, it was announced that David Suchet, famous for his role in Agatha Christie's Poirot, would appear as a character known as \"The Landlord\" in the fourth episode, \"Knock Knock\". Tate Pitchie-Cooper portrayed a child version of The Landlord. Fady Elsayed, who stars in the Doctor Who spin-off Class, was originally set to guest star in an episode of Doctor Who. "]}, {"page": "Class (2016 TV series)", "response": ["* Fady Elsayed as Ram Singh, a tough, antisocial student and gifted football player. After losing his right leg in the first episode, he is given a prosthetic one by the Doctor.", "On 4 April 2016, the main cast of the programme was unveiled. Greg Austin, Fady Elsayed, Sophie Hopkins and Vivian Oparah star as four Sixth Formers, with Austin playing a character named Charlie, while Katherine Kelly portrays Miss Quill, a Coal Hill Academy teacher. Nigel Betts reprises his role as Mr. Armitage from \"Into the Dalek\", \"The Caretaker\" and \"Dark Water\" from the eighth series of Doctor Who. Paul Marc Davis appears in a recurring role in the programme. Anna Shaffer portrays a character named Rachel in the programme."]}, {"page": "Brotherhood (2016 film)", "response": ["* Fady Elsayed as Wino"]}, {"page": "For Tonight We Might Die", "response": ["April (Sophie Hopkins), a student at Coal Hill Academy, asks Tanya (Vivian Oparah) to help with the decorating for the prom. Tanya has to decline, so April asks Charlie (Greg Austin) to be her date. He rejects her, to the amusement of Ram (Fady Elsayed). The four all attend class with Miss Quill (Katherine Kelly), a blunt and sharp woman. April hands out fliers after school for help with the decorating the prom hall; after speaking to April, Charlie decides that he will ask a male student, Matteusz, to the prom.", "The Guardian gave the show a positive reception, with Phil Harrison writing: \"Ever since the sad demise of Torchwood, Doctor Who fans have been looking for something to fill those fallow months when the Tardis is away in another part of the galaxy and Who is missing from our screens. Now they might finally have it.\" Digital Spy enjoyed the writing style of the episode: \"Ness's script zips all over the place, demanding a huge emotional range from Greg Austin (Charlie), Sophie Hopkins (April), Fady Elsayed (Ram) and Vivian Oparah (Tanya) and these kids knock it out of the park, nailing every single beat.\"", "Den of Geek recommended the series and critic Louisa Mellor summed it up as: \"Witty, energetic Doctor Who spin-off Class wears its influences well and gets a great deal right for its target audience.\" WalesOnline gave the series first couple episodes a rating of five starts out of five, with writer David Prince summarizing the show as: \"It's a bit like a British Buffy and Cardiff looks amazing - but it's not for kids\". CNET really liked the acting from those portraying the young characters in the new series: \"The standout is smouldering Fady Elsayed as the cocky but conflicted Ram. Meanwhile, Katherine Kelly chews the scenery as vampy teacher Miss Quill\"."]}, {"page": "Brave-ish Heart", "response": ["Class follows four students of Coal Hill Academy and their alien teacher, as they deal with various alien threats. Following the events of the previous episode, April (Sophie Hopkins), accompagned by Ram (Fady Elsayed), is now on the planet of the Shadow Kin, hunting for their king Corakinus (Paul Marc Davis). Meanwhile, their friends and families work together to try to stop flesh-eating petals to take over the city, and Charlie (Greg Austin) is faced with the possibility of using the Cabinet of Souls, thus destroying the souls of his entire race, to either destroy the petals and save earth, or wipe out the Shadow Kin to avenge his and Miss Quill (Katherine Kelly)'s races, thus committing genocide."]}, {"page": "Young Actors Theatre Islington", "response": ["* Fady Elsayed - (Class, My Brother the Devil)"]}, {"page": "Elsayed", "response": ["*Fady Elsayed (born 1993), British actor"]}, {"page": "A Private War", "response": ["*Fady Elsayed as Mourad"]}, {"page": "Gangs of London (TV series)", "response": ["Additionally, Fady Elsayed, Waleed Zuaiter, Jasmine Armando, Salem Kali and Aymen Hamdouchi have all been cast in Season 2."]}, {"page": "Little Birds (TV series)", "response": ["* Fady Elsayed as Aziz"]}, {"page": "Baghdad Central (TV series)", "response": ["* Fady Elsayed as Ibrahim Jabani"]}]}}