{"wiki_id": "http://www.wikidata.org/entity/Q2851050", "itemLabel": "Anne Crawford", "itemDescription": "British actress (1920-1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Anne_Crawford", "wikipedia_page": {"main": "Imelda Anne Crawford (22 November 1920 – 17 October 1956) was a British film actress, born in Palestine of a Scottish father and an English mother, and brought up in Edinburgh.\n\n", "link_mentions": [{"page": "November 22", "response": ["*  1920   – Anne Crawford, Israeli-English actress (d. 1956)"]}, {"page": "October 17", "response": ["*1956 – Anne Crawford, Israeli-English actress (b. 1920)"]}, {"page": "1956", "response": ["* October 17 – Anne Crawford, British actress (b. 1920)"]}, {"page": "1920", "response": ["**Anne Crawford, British actress (d. 1956)"]}, {"page": "Kensal Green Cemetery", "response": ["*Anne Crawford (1920–1956), actress "]}, {"page": "1956 in film", "response": ["* October 17 – Anne Crawford, 35, British actress, Knights of the Round Table, Night Beat"]}, {"page": "Hubert Gregg", "response": ["After the war, he co-starred with Anne Crawford in Western Wind (1949) at the Manchester Opera House, and also directed Agatha Christie stage plays, including The Hollow (1951) and  The Mousetrap (for seven years, beginning in 1953). The period was the subject of his 1980 memoir, Agatha Christie and All That Mousetrap. He called Christie \"a mean old bitch\"."]}, {"page": "1920 in the United Kingdom", "response": ["* 22 November – Anne Crawford, film actress, in Mandatory Palestine (died 1956)"]}, {"page": "St Mary's Catholic Cemetery, Kensal Green", "response": ["*Anne Crawford (1920-1956), actress of stage, radio and film"]}, {"page": "Imelda", "response": ["* Imelda Crawford, birth name of Anne Crawford, British actress"]}, {"page": "List of female movie actors by name: C", "response": ["*Anne Crawford (1920–1956)"]}, {"page": "Knights of the Round Table (film)", "response": ["The film was the second in an unofficial trilogy made by the same director and producer and starring Robert Taylor, coming between Ivanhoe (1952) and The Adventures of Quentin Durward (1955). All three were made at MGM's British studios at Borehamwood, near London and partly filmed on location. The cast included Robert Taylor as Sir Lancelot, Ava Gardner as Queen Guinevere, Mel Ferrer as King Arthur, Anne Crawford as Morgan Le Fay, Stanley Baker as Modred and Felix Aylmer as Merlin. The film uses the Welsh spelling for Arthur's nemesis, Modred, rather than the more common Mordred.", "With the land in anarchy, warring overlords, Arthur Pendragon (Mel Ferrer) and his half-sister Morgan LeFay (Anne Crawford) meet as arranged by the sorcerer Merlin (Felix Aylmer) to discuss how to end the bloodshed. Morgan maintains that as she is the only legitimate offspring of the late king, the throne belongs to her, but Merlin puts the adversaries to a test to determine England's rightful ruler. Merlin leads them to Excalibur, a sword embedded in an anvil, and says that according to legend, whoever can remove the sword shall be England's true sovereign. Morgan's knight champion and lover Modred (Stanley Baker) tries in vain to extract the sword, but Arthur removes it easily. Modred accuses Merlin of witchcraft, and a hearing is arranged with the Council of Kings at the ring of stones (Stonehenge). After advising Arthur that he must prove himself worthy of the throne by his deeds, Merlin instructs him to return the sword to the anvil.", "* Anne Crawford as Morgan Le Fay "]}, {"page": "1956 in the United Kingdom", "response": ["* 17 October – Anne Crawford, film actress (leukemia) (born 1920)"]}, {"page": "Thunder on the Hill", "response": ["* Anne Crawford as Isabel Jeffreys "]}, {"page": "List of American films of 1951", "response": ["|Thunder on the Hill||Douglas Sirk ||Claudette Colbert, Ann Blyth, Anne Crawford ||Film noir || Universal"]}, {"page": "Bedelia (novel)", "response": ["The black-and-white movie, which was one of the few independent productions ever made at Ealing Studios, was released in 1946. It starred Margaret Lockwood as Bedelia Carrington,At the time Lockwood had already embarked on her career as on-screen villainess with The Wicked Lady (1945), so the role of Bedelia fitted in nicely. Ian Hunter as Charlie Carrington, Barry K. Barnes as Ben Chaney, and Anne Crawford as Ellen. The film was directed by Lance Comfort."]}, {"page": "Millions Like Us", "response": ["Millions Like Us is a 1943 British propaganda film, showing life in a wartime aircraft factory in documentary detail. It starred Patricia Roc, Eric Portman, Megs Jenkins, Gordon Jackson and Anne Crawford, was written and directed by Sidney Gilliat and Frank Launder. According to the British Film Institute database, this film is the first in an \"unofficial trilogy\", along with Two Thousand Women (1944) and Waterloo Road (1945).", "Fearing her father's disapproval if she moves away from home, Celia hesitates about joining up but eventually her call-up papers arrive. Hoping to join the WAAF or one of the other services, Celia instead gets posted to a factory making aircraft components, where she meets her co-workers, including her Welsh room-mate Gwen Price (Megs Jenkins) and the vain upper middle class Jennifer Knowles (Anne Crawford). Knowles dislikes the work they have to do at the factory, causing friction with their supervisor Charlie Forbes (Eric Portman) which eventually blossoms into a verbally combative romance.", "*Anne Crawford – Jennifer Knowles"]}, {"page": "List of British films of 1942", "response": ["|The Peterville Diamond||Walter Forde ||Anne Crawford, Donald Stewart||Comedy||"]}, {"page": "List of British films of 1943", "response": ["|The Dark Tower||John Harlow||Ben Lyon, Anne Crawford||Thriller||", "|The Night Invader||Herbert Mason||David Farrar, Anne Crawford||World War II||"]}, {"page": "List of British films of 1944", "response": ["|Headline||John Harlow||David Farrar, Anne Crawford||Thriller||", "|The Hundred Pound Window||Brian Desmond Hurst||Anne Crawford, David Farrar||Crime||"]}, {"page": "List of British films of 1947", "response": ["|Master of Bankdam||Walter Forde||Anne Crawford, Dennis Price||Drama||", "|Night Beat||Harold Huth ||Anne Crawford, Maxwell Reed||Crime/drama ||"]}, {"page": "List of British films of 1948", "response": ["|The Blind Goddess||Harold French||Eric Portman, Anne Crawford||Drama||", "|Daughter of Darkness||Lance Comfort||Anne Crawford, Maxwell Reed || Crime|| ", "| It's Hard to Be Good ||  Jeffrey Dell || Jimmy Hanley, Anne Crawford || Comedy ||"]}, {"page": "List of British films of 1950", "response": ["|Tony Draws a Horse || John Paddy Carstairs || Cecil Parker, Anne Crawford || Comedy ||"]}, {"page": "Trio (film)", "response": ["* Anne Crawford as Mrs Ramsay"]}, {"page": "The Dark Tower (1943 film)", "response": ["The Dark Tower is a 1943 British thriller film starring Ben Lyon, Anne Crawford, David Farrar and Herbert Lom. The film marked Herbert Lom's first major film role.", "* Anne Crawford as Mary"]}, {"page": "Caravan (1946 film)", "response": ["Bidding farewell to Oriana (Anne Crawford), Richard sets out.  On the way, he meets Wycroft (Robert Helpmann), who assaults, robs and nearly kills Richard on behalf of his dastardly master, Sir Francis Castleton (Dennis Price). Oriana thinks Richard is dead and, with her father recently dead, marries Francis, whilst Richard loses his memory as a result of the assault and marries a gypsy girl named Rosal (Jean Kent). However, everyone meets again...", "*Anne Crawford as Oriana", "The film's four leads were all under contract to Gainsborough and were well known for appearing in melodramas at the studio. Stewart Granger and Jean Kent had previously appeared together in Fanny By Gaslight and Madonna of the Seven Moons, and Anne Crawford who had been in They Were Sisters. Kent had normally played support roles but Maurice Ostrer, then head of Gainsborough, offered Kent a new contract just before filming which promoted her to star billing. Dennis Price had been in A Place of One's Own (1945) and was used by Gainsborough in the sort of villainous roles that James Mason used to play.Brian MacFarlane  \"Price, Dennis (1915-1973)\", BFI screenonline, reprinted from MacFarlane (ed.) Encyclopaedia of British Cinema, London: Methuen/BFI, 2003, p.534"]}, {"page": "Gainsborough melodramas", "response": ["A large number of actors appeared in the films, but they are particularly associated with James Mason,The Wicked Lady - The Criterion Channel Margaret Lockwood,Odd man out|Film|The Guardian Phyllis Calvert,Madonna of the Seven Moons - The Criterion Channel Stewart Granger, Patricia Roc, Jean Kent,Jean Kent: Suffolk Gainborsough melodramas actress dies - BBC News Anne Crawford, Dennis Price and Dulcie Gray. Leslie Arliss directed several of the most successful films. Other directors included Arthur Crabtree, Anthony Asquith and Bernard Knowles."]}, {"page": "Mad About Men", "response": ["* Anne Crawford as Barbara Davenport"]}, {"page": "Master of Bankdam", "response": ["Master of Bankdam is a 1947 British historical film directed by Walter Forde and based on the 1940 novel The Crowthers of Bankdam  by Thomas Armstrong.The Crowthers of Bankdam by Thomas Armstrong (), published by Collins It stars Anne Crawford, Dennis Price, Tom Walls, Stephen Murray, Linden Travers and David Tomlinson. The story concerns two generations of brothers who struggle for control of the family business in 19th century Yorkshire.", "*Anne Crawford as Annie Pickersgill"]}, {"page": "Street Corner (1953 film)", "response": ["* Anne Crawford as Susan"]}, {"page": "Two Thousand Women", "response": ["During the 1940 Battle of France, Rosemary Brown (Patricia Roc), an English novice nun, is apprehended by French soldiers who have mistaken her for a fifth columnist. She is sentenced to face a firing squad, but the Germans arrive and she is sent (without her habit, which is being cleaned) to an internment camp in a grand hotel at the spa town of Marneville. She journeys there in the back of a lorry with journalist Freda (Phyllis Calvert), stripper Bridie (Jean Kent), and posh Muriel (Flora Robson) and her travelling companion, Miss Meredith (Muriel Aked). At the camp, they meet Maud (Renée Houston), Margaret (Anne Crawford), Nellie (Dulcie Gray), Mrs Burtshaw (Thora Hird) and Teresa King (Betty Jardine). While two women are allocated to each room, Bridie uses her charms with Sergeant Hentzner (Carl Jaffe) to obtain a room to herself. Although the hotel is very luxurious, not all the baths have a water supply. The hotel proprietor, Monsieur Boper (Guy Le Feuvre), is believed to be collaborating with the Germans. ", "* Anne Crawford as Margaret Long"]}, {"page": "Crawford (name)", "response": ["*Anne Crawford (1920–1956), British actress"]}, {"page": "The Peterville Diamond", "response": ["The Peterville Diamond is a 1942 British comedy film directed by Walter Forde and starring Anne Crawford, Donald Stewart and Renee Houston. It is also known by the alternative title Jewel Robbery. - from the 1931 play of the same title; previously filmed in Hollywood in 1932."]}, {"page": "Night Beat (1947 film)", "response": ["Night Beat is a 1947 British Brit-noir, crime thriller drama film directed by Harold Huth and starring Anne Crawford, Maxwell Reed, Ronald Howard, Christine Norden and Sid James. Following the Second World War, two comrades go their separate ways; one joins the Metropolitan Police while the other begins a police career but becomes a racketeer in post-war London.Sky Movies described the film as a \"British thriller that examines a challenging issue of its times: the problems encountered by servicemen when trying to adjust to civilian life.\"", "*Anne Crawford as Julie Kendall"]}, {"page": "Alvin Rakoff", "response": ["A BBC adaptation in 1953 of the Irwin Shaw novel The Troubled Air was his first major writing assignment for television. In 1954 his production of Waiting For Gillian won the Daily Mails National TV Award with actors Patrick Barr and Anne Crawford also honoured. He subsequently recreated this production in French for transmission throughout France. In 1955 on the night commercial TV first appeared in the UK he was asked by the BBC to offer the main opposition, The Hole In The Wall with Mervyn Johns and Sidney Tafler, of which The Times wrote: \"Mr Rakoff who seems to be a master of this medium\". ", "| Patrick Barr, Anne Crawford (National Television Award)"]}, {"page": "List of Desert Island Discs episodes (1951–1960)", "response": ["|||Anne Crawford||No book||No item"]}, {"page": "Daughter of Darkness (1948 film)", "response": ["Daughter of Darkness is a 1948 British film, with macabre overtones, directed by Lance Comfort and starring Anne Crawford, Maxwell Reed and – in the central role – Siobhán McKenna. Released in January 1948, it was based on a then ten-year-old play by Max Catto called They Walk Alone. An expensive film for its day, it was shot at Riverside Studios, Hammersmith, London, (known at that time as Alliance Studios) and on location. McKenna was offered a Hollywood contract following her memorable performance, but heeded the counsel of Laurence Olivier to remain in theatre work.", "* Anne Crawford as Bess Stanforth"]}, {"page": "They Were Sisters", "response": ["The film focuses on the lives of three sisters; Lucy (Phyllis Calvert), Vera (Anne Crawford) and Charlotte (Dulcie Gray). It opens at a dance in 1919, establishing their personalities and following them through courtship and marriage. While the sisters remain close to one another, their characters and paths through life are very different.", "* Anne Crawford as Vera Sargeant"]}, {"page": "Tony Draws a Horse", "response": ["Tony Draws a Horse is a 1950 British comedy film directed by John Paddy Carstairs and starring Cecil Parker, Anne Crawford and Derek Bond. It was adapted from a 1939 play of the same name by Lesley Storm.", "When their eight-year-old son Tony (Anthony Lang) draws a horse on his father's office wall, complete with reproductive organs, surgeon father (Cecil Parker) and psychiatrist mother (Anne Crawford) come to blows over how to deal with the boy's behaviour. The father favours discipline and a beating for the child, the mother wants to spare the rod and reward Tony for so freely expressing himself. The resulting marital bust up causes the wife to leave for her parents home, and from thence to Dieppe.", "* Anne Crawford as Clare Fleming", "In The New York Times, Bosley Crowther wrote, \"To spank or not to spank, that is the question which gayly precipitates a clash of parental personalities and a consequent explosion of domestic strife in the Park Avenue Theatre's new attraction, the British comedy, \"Tony Draws a Horse\"....It is out of this cozy situation that Mr. Williams (from Mr. Storm) has propelled a tempest of family complications that rocks with hilarity...it is a toss-up as to which is more fun—Cecil Parker as the pompous father or Anne Crawford as the mother with new ideas. Mr. Parker does a richly amusing characterization of a righteous fuddy-dud and Miss Crawford is blithe and beguiling as a lady who is a little light in the head. Barbara Everest fumes and fusses like a school-marm as the matron who worships routine, Mervyn Johns is gentle as her husband and Edward Rigby is a card as grandpa. Dandy Nichols, David Hurst and Marjorie Gresley are amusing in other character roles; Derek Bond and Barbara Murray are good as love-birds and Anthony Lang is fit to slaughter as the kid. Under the facile direction of John Paddy Carstairs, the whole lot turn out a rollicking little picture that is loaded with chuckles and guffaws\"; while Leonard Maltin called the film an \"Occasionally funny but overly talky (not to mention outdated) satire\": and more recently, the Radio Times wrote, \"Prolific comedy director John Paddy Carstairs here turns in a workmanlike, but nevertheless likeable, adaptation of Lesley Storm's stage play.\""]}, {"page": "Headline (film)", "response": ["Headline is a 1944 British thriller film directed by John Harlow and starring David Farrar, Anne Crawford, William Hartnell and John Stuart. It was based on the 1933 novel Reporter! by Ken Attiwill.Goble p.18 Its plot involves a crime reporter who searches for a mystery woman who has witnessed a murder. It was shot at the Riverside Studios in Hammersmith. The film's sets were designed by the art director James Carter."]}, {"page": "The Hundred Pound Window", "response": ["The Hundred Pound Window is a 1944 British crime film directed by Brian Desmond Hurst and starring Anne Crawford, David Farrar, Frederick Leister and Richard Attenborough.BFI.org The film follows an accountant who has to take a second job working at a racetrack, where he soon becomes mixed up with a shady crowd.", "* Anne Crawford as Joan Draper"]}, {"page": "Bedelia (film)", "response": ["* Anne Crawford as Ellen"]}, {"page": "The Night Invader", "response": ["The Night Invader is a 1943 British, black-and-white, drama, thriller, war film, directed by Herbert Mason, produced by Max Milder for Warner Bros. - First National Productions Ltd. the British subsidiary of Warner Bros. and starring Ronald Shiner as Witsen, Anne Crawford and David Farrar.", "* Anne Crawford as Karen Lindley"]}, {"page": "It's Hard to Be Good", "response": ["It's Hard to Be Good is a 1948 British comedy film directed by Jeffrey Dell and starring Jimmy Hanley, Anne Crawford and Raymond Huntley. In the film, an ex-army officer finds his altruistic attempts to improve the world are unsuccessful.Gillett p.23", "On leaving the army, officer and war hero Captain James Gladstone Wedge (Jimmy Hanley) is full of idealism about bettering the world. He falls in love with Mary Leighton (Anne Crawford), who nursed him whilst he was recovering from his wartime injuries. He bungles a proposal to her at a railway station after being demobed, (Demobilization), but his good-nature had already convinced her that she should marry him.", "* Anne Crawford as Mary Leighton"]}, {"page": "The Blind Goddess (1948 film)", "response": ["The Blind Goddess is a 1948 British courtroom drama film directed by Harold French and starring Eric Portman, Anne Crawford and Hugh Williams. The screenplay concerns a secretary who sets out to his expose his boss, Lord Brasted, for embezzlement. It was based on a popular play of the same title by noted barrister Patrick Hastings."]}]}}