{"wiki_id": "http://www.wikidata.org/entity/Q2850248", "itemLabel": "Anjli Mohindra", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Anjli_Mohindra", "wikipedia_page": {"main": "Anjli Mohindra is a British actress known for her television roles in The Sarah Jane Adventures as Rani Chandra, as Nadia in the BBC One series Bodyguard, and as Josie Chancellor in the ITV series Dark Heart. In 2018, she played Tara Lohia opposite Simon Callow in the original ghost story The Dead Room written by Mark Gatiss. In 2021, she played Surgeon Lieutenant Tiffany Docherty in the BBC One drama Vigil.", "link_mentions": [{"page": "Sontaran", "response": ["The Sontarans are mentioned in the audio book Wraith World, when Clyde Langer (Daniel Anthony) remarks he cannot understand why Luke Smith (Tommy Knight) and Rani Chandra (Anjli Mohindra) would want to read about made up adventures, when they have faced Sontarans."]}, {"page": "1990 in American television", "response": ["|Anjli Mohindra"]}, {"page": "Sarah Jane Smith", "response": ["Sarah Jane then reappears in Doctor Who in the two-part fourth series finale episodes \"The Stolen Earth\" and \"Journey's End\" (2008), which crosses over from Torchwood and The Sarah Jane Adventures. When Daleks invade Earth, Sarah Jane is summoned along with UNIT officer Martha Jones (Freema Agyeman) and Torchwood leader Captain Jack Harkness (John Barrowman) by former PM Harriet Jones (Penelope Wilton) to help The Doctor save the universe. On the Dalek ship Davros (Julian Bleach) recognises Sarah Jane from their encounter in the classic series' episode Genesis of the Daleks. In The Sarah Jane Adventures second series (2008), Maria moves away to America in The Last Sontaran, and Sarah Jane befriends new neighbour Rani Chandra (Anjli Mohindra) in The Day of the Clown; the same episode features flashbacks to Sarah Jane's (Jessica Mogridge) childhood in her Aunt Lavinia's home. In The Temptation of Sarah Jane Smith, Sarah Jane saves the lives of her parents, Eddie (Christopher Pizzey) and Barbara (Rosanna Lavelle) in 1951; by doing so she plays into The Trickster's hands, creating a post-apocalyptic alternative universe in the present day. Learning of this however, her parents choose to die, becoming heroes to restore the timeline. In series two finale Enemy of the Bane, Sarah Jane's old friend Brigadier Lethbridge-Stewart (Nicholas Courtney) from UNIT assists her against united adversaries Mrs Wormwood and Sontaran Commander Kaagh (Anthony O'Donnell). Sarah Jane feels threatened on a personal level by Mrs Wormwood's claim to be Luke's mother as his creator. Sladen has relatively scarce screen-time in 'Sarah-lite' serial The Mark of the Berserker due to back-to-back filming. Though K9 makes no appearances in series two, he appears to assist Sarah Jane against Ambassador Ranius (Ronnie Corbett) in a mini-episode for Comic Relief (2009)."]}, {"page": "West Bridgford School", "response": ["*Anjli Mohindra, British actor, as seen in The Sarah Jane Adventures"]}, {"page": "1990 in the United Kingdom", "response": ["* 20 February – Anjli Mohindra, actress"]}, {"page": "The Sarah Jane Adventures", "response": ["For the tenth anniversary of the show, an event was held 29 July 2017 at Cardiff University Students' Union, with proceeds going to Ty Hafan Hospice for Children. A total of £6643.35 was raised by the sale of tickets to the event and merchandise. Members of the cast and crew that took part in the event were Tommy Knight, Anjli Mohindra, Yasmin Paige, Sinead Michael, Mina Anwar, Katy Manning, Paul Marc Davis, Phil Ford, Gary Russell, Joe Lidster, Sam Watts, Richard Wisker, Cheryl Rowlands, Scott Handcock, Brian Miller, John Leeson, Mat Irvine and Chris Johnson. The event was recorded and was released onto DVD and Blu-ray and could be bought exclusively through the event's website.", "In addition to Sladen, the first series of the programme stars Yasmin Paige as Maria Jackson, Sarah Jane's 13-year-old neighbour in Ealing, west London, and Tommy Knight as a boy named Luke, who is adopted by Sarah Jane at the conclusion of the introductory story. The third member of Sarah Jane's young entourage is 14-year-old called Clyde Langer, played by Daniel Anthony, who is introduced in the first episode of the proper series. Actress Porsha Lawrence Mavour briefly played Maria's friend, Kelsey Harper, in the 2007 New Year's Day special Invasion of the Bane which was created before the start of the series. Maria and her family are written out of the series in the first story of the second series, The Last Sontaran, but Maria and her father return briefly in the second part of The Mark of the Berserker. In the second story of that series, The Day of the Clown, several new regular cast members are introduced: Rani Chandra and her parents, Haresh, and Gita (played by Anjli Mohindra, Ace Bhatti, and Mina Anwar, respectively).", "| Anjli Mohindra || Rani Chandra || colspan=\"1\"  || colspan=4 ", "The story acted as an epilogue to the series narrated by Jacob Dudman and featured Tommy Knight, Daniel Anthony, Anjli Mohindra, Katy Manning, Mina Anwar all in their respective roles from the series and also included Sophie Aldred, who portrayed Ace, a companion to the Seventh Doctor. The episode's credits thanked Sacha Dhawan, Scott Handcock and Stuart Humphryes.", "Ten audiobooks have been released on CD, all but the last two read by the series lead, Elisabeth Sladen, who read them in the first person in character as Sarah Jane. The final two books, released in November 2011 after Sladen's death, were read by Daniel Anthony and Anjli Mohindra, respectively, though not as their characters.", "A 20-minute mini-episode in two parts called \"The Monster Hunt\" written by Trevor Baxendale and read by Anjli Mohindra was made especially for the Monster Hunt game on the Sarah Jane Adventures website. Two more comics were released \"Return of the Krulius\" and  \"Defending Bannerman Road\". All comics were available as a pdf and a free mp3 download on the official Sarah Jane Adventures website.", "| Judgement Day || Scott Gray|| Anjli Mohindra", "| The Sarah Jane Adventures Collection(Complete Audio Collection) || Stephen Cole Justin RichardsGary RussellCavan ScottMark Wright Peter AnghelidesJason ArnoppMartin DayScott Gray ||24 November 2011|| Elisabeth SladenDaniel AnthonyAnjli Mohindra", "Five The Sarah Jane Adventures comics were released on the official Sarah Jane Adventures website. Four of them were comic adventures with audio narration by Anjli Mohindra. A pdf document and a MP3 audio track was available to download of the comics. An online version of The Silver Bullet, presented, in full, a comic written and drawn by Clyde and briefly seen in, the episode The Curse of Clyde Langer.", "|Anjli Mohindra", "|Anjli Mohindra", "|Anjli Mohindra", "|Anjli Mohindra"]}, {"page": "Judoon", "response": ["In The Sarah Jane Adventures Series 3-story, Prisoner of the Judoon (2009), Captain Tybo, a Judoon, crashes on Earth while his prisoner, Androvax the Annihilator, escapes, leaving Tybo hunting for him. He is knocked unconscious by Androvax and saved by Sarah Jane Smith (Elisabeth Sladen) and her companions, who helped him find Androvax who, as a veil form, has the ability to possess people; he uses this to possess Sarah Jane. Captain Tybo commandeers a London Metropolitan Police car and goes to Bannerman Road where he receives a call that more Judoon are coming. When Tybo and the gang go in they find that Sarah Jane has ordered her supercomputer Mr Smith (voiced by Alexander Armstrong) to explode in 60 seconds, but her adoptive son Luke Smith (Tommy Knight) stops him by reminding him that he is programmed to protect the planet. Tybo goes to the genetic system and regroups with the rest of the Judoon, finds Androvax and takes him back to the Shadow Proclamation. Despite the Judoon's nominal lack of jurisdiction on Earth, Tybo aggressively enforces English car radio volume limits and once points his machine gun at the driver of a nearby car whose music was too loud. Additionally, he and his colleagues summarily sentence Clyde Langer (Daniel Anthony) and Rani Chandra (Anjli Mohindra) to restriction to Earth as punishment for their interference."]}, {"page": "Luke Smith (The Sarah Jane Adventures)", "response": ["Following this, Series 2 of The Sarah Jane Adventures (2008) sees Luke part ways with Maria when she moves to America in The Last Sontaran, and befriend investigative new girl Rani Chandra (Anjli Mohindra) who comes to discover the extraterrestrial activities that he, Clyde and his mother are involved with in The Day of the Clown. In the Series 2 serial, The Temptation of Sarah Jane Smith, Luke meets his grandparents in a time travel plot set up by the Trickster. In Series 3's The Mad Woman in the Attic (2009), an alien shows Luke a vision of the future in which he appears to be graduating from university at a young age. He meets the Doctor in person for the first time in The Wedding of Sarah Jane Smith and assists him in defeating the Trickster for a third time. Luke is entirely absent from the two-parter The Eternity Trap due to Tommy Knight's real-life school exams. In the series finale The Gift, Luke and Sarah's relationship becomes at times strained by the difficulties of parenting a teenager. Due to infectious alien spores, Luke becomes sick for the first time and nearly dies, spurring Sarah Jane to take up arms against their enemy."]}, {"page": "List of people from Nottingham", "response": ["*(Born 1990) Anjli Mohindra, actress best known as Rani Chandra in The Sarah Jane Adventures, was born in West Bridgford."]}, {"page": "The Day of the Clown", "response": ["The Day of the Clown is the second story of Series 2 of The Sarah Jane Adventures The two-part serial was broadcast on 6 and 13 October 2008; \"Part One\" on the CBBC Channel at 5.15 p.m. on 6 October; \"Part Two\" on the CBBC Channel at 5.15 p.m. on 13 October. The Day of the Clown introduces main character Rani Chandra (Anjli Mohindra) and her parents, Haresh (Ace Bhatti) and Gita Chandra (Mina Anwar), and they would stay for the rest of the series."]}, {"page": "Rani Chandra (The Sarah Jane Adventures)", "response": ["Rani Chandra is a fictional character played by Anjli Mohindra in the British children's science fiction television programme The Sarah Jane Adventures, a spin-off from the long-running series Doctor Who. She first appeared in The Day of the Clown.", "Reviewing the second series of The Sarah Jane Adventures for Digital Spy, Ben Rawson-Jones writes that: \"As Rani, Anjli Mohindra was fine with dialogue, but painfully self-conscious on a physical acting level when compared to the effortless ease with which Daniel Anthony and Tommy Knight portray Clyde and Luke. It was almost as if someone was stood slightly off set operating her with strings. That theory at least fits into the whole 'body possession' procession of the second season.\""]}, {"page": "Red Nose Day 2009", "response": ["| The Sarah Jane Adventures || \"From Raxacoricofallapatorius with Love\", a special episode of the show. || Elisabeth Sladen, Ronnie Corbett, Thomas Knight, Daniel Anthony, Anjli Mohindra", "* Anjli Mohindra"]}, {"page": "Gallifrey One", "response": ["|colspan=\"3\"|Freema Agyeman, Sylvester McCoy, Philip Hinchcliffe, Mark Strickson, Peter Purves, Deborah Watling, Ben Browder, Frances Barber, Michael Jayston, Neve McIntosh, Frazer Hines, Nicholas Pegg, Dan Starkey, Neve McIntosh, Ian McNeice, Finn Jones, Ashley Eckstein, Paul Marc Davis, Anjli Mohindra, Gary Russell, Ed Stradling, Richard Dinnick", "| colspan=\"3\" |Christopher Eccleston, Peter Davison, Pearl Mackie, Tosin Cole, Michelle Ryan, Janet Fielding, Sarah Sutton, Mark Strickson, Frazer Hines, Joy Wilkinson, Vinay Patel, Pete McTighe, Michael E. Briant, Margot Hayhoe, Sallie Aprahamian, Steffan Morris, Anjli Mohindra, Geoffrey Beevers, Tilly Steele, Mark Dexter, Anna-Louise Plowman, Tracie Simpson, Michael Collins, James DeHaviland, Mark McQuoid, Mark Corden, Scott Gray, Una McCormack, Emma Reeves, Gary Russell, Rhianne Starbuck, Gigi Edgley, Peter Anghelides, Vaughn Armstrong, Richard Ashton, Keith Barnfather, Julie Benson, Shawna Benson, Hayden Black, Bill Blair, Nicole De Boer, Brannon Braga, Matty Cardarople, Cherry Chevapravatdumrong, Jessie Christiansen, Jeffrey Combs, Paul Cornell, Sue Cowley, Jon Davey, Richard Dinnick, Matt Fitton, David Gerrold, Marcus Gilbert, Shari Goodhartz, David A. Goodman, Jason Haigh-Ellery, Barbara Hambly, Philip Hopkins, Gillian Horvath, Jody Houser, David J Howe, Samantha Howe, Christopher Jones, Collin Kelly, Jackson Lanzing, Tony Lee, Erin Maher, Chase Masterson, Sarah Milkovich, Bob Miller, Craig Miller, Russell Minton, Anthony Montgomery, Daniel Keys Moran, Robert Napton, Larry Nemecek, Robert O'Reilly, Dan Peck, Wendi Pini, Suzie Plakson, Trina Ray, Kay Reindl, Matt Rohman, Arthur Sellers, Dr. Anita Sengupta, Blair Shedd, Richard Starkings, Arne Starr, Kim Steadman, David Tipton, Denton Tipton, Scott Tipton, Connor Trinneer, Sam Watts, Marv Wolfman, JK Woodward."]}, {"page": "Anjili Mohindra", "response": ["#REDIRECT Anjli Mohindra"]}]}}