{"wiki_id": "http://www.wikidata.org/entity/Q2852874", "itemLabel": "Anthony Hinds", "itemDescription": "British film producer, screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Hinds", "wikipedia_page": {"main": "Anthony Frank Hinds (19 September 1922 – 30 September 2013), also known as Tony Hinds and John Elder, was an English screenwriter and producer.", "link_mentions": [{"page": "Doctor Syn", "response": ["Captain Clegg (1962), known as Night Creatures in the U. S., was produced by Hammer Film Productions with actor Peter Cushing in the lead role, directed by Peter Graham Scott. In the screenplay by Anthony Hinds, the main character's name was changed from Doctor Syn to Parson Blyss to avoid rights problems with Disney's forthcoming version, and Captain Clegg's screenplay follows the novel Doctor Syn and the screenplay of the 1937 film closely with the exception of a tightening of the plot. In the Arliss movie Doctor Syn, Syn escapes to sea with Mipps and the rest of the Dymchurch smugglers, whereas Captain Clegg ends more faithfully to the novel, with Parson Blyss being killed by the mulatto (who is then killed by Mipps) and then being carried to and buried in Captain Clegg's empty grave by Mipps. Captain Clegg was released in the UK on DVD and Blu-ray in 2014; Night Creatures was never released on videotape in the United States, but is included in the 2014 two-disc DVD collection The Hammer Horror Series."]}, {"page": "Peter Cushing", "response": ["Around the same time, he portrayed the detective Sherlock Holmes in the Hammer production of The Hound of the Baskervilles (also 1959), an adaptation of Sir Arthur Conan Doyle's novel of the same name. He once again co-starred opposite Lee, who portrayed the aristocratic Sir Henry Baskerville. A huge fan of Sherlock Holmes, Cushing was highly anxious to play the character,Earnshaw, p. 1 and reread the novels in anticipation of the role.Wogan (19 December 1987). Cushing, Peter. White City, London: BBC One. Hammer decided to heighten the source novel's horror elements, which upset the estate of Conan Doyle, but Cushing himself voiced no objection to the creative licence because he felt the character of Holmes himself remained intact. However, when producer Anthony Hinds proposed removing the character's deerstalker, Cushing insisted they remain because audiences associated Holmes with his headgear and pipes.Earnshaw, p. 10 Cushing prepared extensively for the role, studying the novel and taking notes in his script. He scrutinised the costumes and screenwriter Peter Bryan's script, often altering words or phrases.Earnshaw, p. 11—12 Lee later claimed to be awestruck by Cushing's ability to incorporate many different props and actions into his performance simultaneously, whether reading, smoking a pipe, drinking whiskey, filing through papers or other things while portraying Holmes.Lee, Christopher (actor). (2002). Actor's Notebook: Christopher Lee. [Documentary, from The Hound of the Baskervilles DVD]. Greg Carson: MGM Home Entertainment. Retrieved 19 September 2010. In later years, Cushing considered his Holmes performance one of the finest accomplishments of his career. Cushing drew generally mixed reviews: Film Daily called it a \"tantalising performance\" and Time Out David Pirie called it \"one of his very best performances\",Earnshaw, p. 23 while the Monthly Film Bulletin called him \"tiresomely mannered and too lightweight\" and BBC Television's Barry Norman said he \"didn't quite capture the air of know-all arrogance that was the great detective's hallmark\".Earnshaw, p. 24 The Hound of the Baskervilles was originally conceived as the first in a series of Sherlock Holmes films, but eventually no sequels were made.", "Peter Cushing was known among his colleagues for his gentle and gentlemanly demeanour, as well as his professionalism and rigorous preparation as an actor. Cushing once said he learned his parts \"from cover to cover\" before filming began.Meikle, p. 71 His co-stars and colleagues often spoke of his politeness, charm, old-fashioned manners and sense of humour. While working, he actively provided feedback and suggestions on other elements beyond his performance, such as dialogue and wardrobe. At times, this put him at odds with writers and producers; Hammer Studios producer Anthony Hinds once declared him a \"fusspot [and] terrible fusser about his wardrobe and everything, but never a difficult man.\""]}, {"page": "Hammer Film Productions", "response": ["James Carreras joined Exclusive in 1938, closely followed by William Hinds' son, Anthony. At the outbreak of World War II, James Carreras and Anthony Hinds left to join the armed forces and Exclusive continued to operate in a limited capacity. In 1946, James Carreras rejoined the company after demobilisation. He resurrected Hammer as the film production arm of Exclusive with a view to supplying 'quota-quickies', cheaply made domestic films designed to fill gaps in cinema schedules and support more expensive features. He convinced Anthony Hinds to rejoin the company, and a revived Hammer Film Productions set to work on Death in High Heels, The Dark Road, and Crime Reporter. Not able to afford top stars, Hammer acquired the film rights to BBC radio series such as The Adventures of PC 49 and Dick Barton: Special Agent (an adaptation of the successful Dick Barton radio show). All were filmed at Marylebone Studios during 1947. During the production of Dick Barton Strikes Back (1948), it became apparent that the company could save money by shooting in country houses instead of studios. For the next production, Dr Morelle - The Case of the Missing Heiress (another radio adaptation), Hammer rented Dial Close, a 23 bedroom mansion beside the River Thames, at Cookham Dean, Maidenhead.", "* Anthony Hinds, a.k.a. John Elder, writer of The Curse of the Werewolf, Frankenstein Created Woman and others", "Although the novel by Mary Shelley was long since in the public domain, Anthony Hinds was unsure about the story, as Subotsky's script adhered closely to the plot of the 1939 Universal film Son of Frankenstein, featuring a second-generation Baron Frankenstein emulating his father, the original monster-maker. This put the project at risk of a copyright infringement lawsuit by Universal. In addition a great deal of polishing and additional material was needed, as the short script had an estimated running time of just 55 minutes, far less than the minimum of 90 minutes needed for distribution in the U.K. Accordingly, comments on the script from Hammer's Michael Carreras (who had joined his father James as producer in the early 1950s) were less than complimentary:", "In 1969 Tony Hinds resigned from the Hammer board and retired from the industry.\"Obituary: Anthony Hinds,\" The Guardian (7 October 2013). Hammer was not the same without him; it responded to the new reality by bringing in new writers and directors, testing new characters, and attempting to rejuvenate their vampire and Frankenstein films with new approaches to familiar material. (1974's Frankenstein and the Monster from Hell, for example, features a scene where the Baron treads on a discarded human brain.) "]}, {"page": "Dracula (1958 film)", "response": ["According to producer Anthony Hinds when it came to casting Dracula \"it never occurred to any of us to use anyone else but Chris Lee\". For his role in Horror of Dracula Lee earned £750. Speaking of filming and doing his take on the character, Lee recalled that he \"tried to make the character all that he was in the book—heroic, romantic, erotic, fascinating, and dynamic.\"", "Dracula was well received by critics and fans of Stoker's works. The trade journal reviews from 1958 were very positive. Film Bulletin noted, \"As produced by Anthony Hinds in somber mid-Victorian backgrounds... and directed by Terence Fisher with an immense flair for the blood-curdling shot, this Technicolor nightmare should prove a real treat. The James Bernard score is monumentally sinister and the Jack Asher photography full of foreboding atmosphere.\" Variety called Peter Cushing's performance impressive and wrote that the \"serious approach to the macabre theme...adds up to lotsa tension and suspense.\""]}, {"page": "Nigel Kneale", "response": ["The same year that he left the BBC, Kneale wrote his first feature film screenplay, adapting Quatermass II for Hammer Film Productions along with producer Anthony Hinds and director Val Guest. Hinds and Guest had overseen the first Quatermass film, upon which Kneale had been unable to work due to his BBC staff contract. Kneale was disappointed that Brian Donlevy also returned in the role of Quatermass. The film premiered at the end of May 1957, and was reviewed positively in The Times: \"The writer of the original story, Mr Nigel Kneale, and the director, Mr Val Guest, between them keep things moving at the right speed, without digressions. The film has an air of respect for the issues touched on, and this impression is confirmed by the acting generally.\" 1957 also saw the release of another cinematic collaboration between Kneale and Guest, when Kneale adapted his 1955 BBC play The Creature into The Abominable Snowman; in this case, Hammer retained the star of the BBC version, Peter Cushing."]}, {"page": "The Quatermass Xperiment", "response": ["The Quatermass Xperiment (a.k.a. The Creeping Unknown in the United States) is a 1955 British science fiction horror film drama from Hammer Film Productions, based on the 1953 BBC Television serial The Quatermass Experiment written by Nigel Kneale. The film was produced by Anthony Hinds, directed by Val Guest, and stars Brian Donlevy as the eponymous Professor Bernard Quatermass and Richard Wordsworth as the tormented Carroon. Jack Warner, David King-Wood, and Margia Dean appear in co-starring roles.", "The Quatermass Experiment was originally a six-part TV serial broadcast by BBC Television in 1953. Written by Nigel Kneale, it was an enormous success with critics and audiences alike, later described by film historian Robert Simpson as \"event television, emptying the streets and pubs\". Among its viewers was Hammer Films producer Anthony Hinds, who was immediately keen to buy the rights for a film version. Incorporated in 1934, Hammer had developed a niche for itself making second features, many of which were adaptations of successful BBC Radio productions. Hammer contacted the BBC on 24 August 1953, two days after the transmission of the final episode, to inquire about the film rights. Nigel Kneale also saw the potential for a film adaptation and, at his urging, the BBC touted the scripts around a number of producers, including the Boulting Brothers and Frank Launder and Sidney Gilliat. Kneale met with Sidney Gilliat to discuss the scripts but Gilliat was reluctant to buy the rights as he felt any film adaptation would inevitably receive an ‘X’ Certificate from the British Board of Film Censors (BBFC), restricting admission to persons over the age of sixteen. Hammer was not so reticent, deciding from the outset that they would deliberately pursue an ‘X’ Certificate. Hammer's offer met some resistance within the BBC, with one executive expressing reservations that The Quatermass Experiment was not suitable material for the company, but the rights were nevertheless sold for an advance of £500.", "The work of makeup artist Phil Leakey in transforming Richard Wordsworth's Carroon into the mutating creature was a key contribution to the effectiveness of the film. Val Guest, Anthony Hinds, and Leakey all agreed that the makeup should make Carroon appear pitiful rather than ugly. Leakey placed a light above the actor in the makeup chair and then worked on accentuating the shadows cast by his eyebrows, nose, chin and cheekbones. The makeup was a liquid rubber solution mixed with glycerine to give the impression of sweat. Leakey's job was made easier by Wordsworth's natural high cheekbones and hollow temples and he also worked closely with cinematographer Walter J. Harvey to ensure the lighting in each shot emphasised Wordsworth's features. Leakey also created Carroon's mutating arm. The hand was created from a cast of the hand of an arthritis victim, enlarged and exaggerated by Leakey. The rest of the arm was built up using latex and rubber and, inside, had a series of plastic tubes through which fluid was pumped to give the effect of the arm swelling. A large sponge-rubber prosthetic was used for a brief scene in the zoo showing Carroon's mutation had advanced further. The shrivelled corpses of Carroon's victims, glimpsed from time to time in the film, were also made by Leakey.", "John Hotchkis was originally hired to compose the music but, when he fell ill, Anthony Hinds asked conductor John Hollingsworth to recommend a replacement. Hollingsworth suggested James Bernard, with whom he had worked on a number of BBC radio productions. Bernard sent Hinds a tape of the score of one of these productions, an adaptation of The Duchess of Malfi, and was duly hired. Bernard watched the film a number of times, stopping after each reel to make notes and discuss where the music would be needed. Val Guest was not involved in any of the music sessions; Anthony Hinds supervised Bernard and made the final decisions as to where the music should occur. Bernard composed the music at his piano and then worked out the orchestration, which was performed by the Royal Opera House Orchestra. Hollingsworth restricted the arrangement of the score to just the string and percussion sections: Bernard recalled, \"I had not written for film before and had only used strings for the BBC scores, so I think that John thought it would be better to see how I got on with these two sections before letting me loose with a full orchestra\". The score runs to 20 minutes and uses a rising and falling three-note semitone throughout. Bernard's biographer, David Huckvale, argues that Bernard's use of atonal strings to create a sense of menace predates Bernard Herrmann's score for Psycho (1960), which is usually cited as the first film to employ the technique.  Remarking on the effectiveness of the score, the film critic John Brosnan said, \"Of prime importance, is the contribution of the soundtrack, in this case supplied by James Bernard who never wrote a more unnerving, jangly score\". Bernard went on to become Hammer's most prolific composer, scoring 23 Hammer films between 1955 and 1974. Several cues from The Quatermass Xperiment were released on CD in 1999 by GDI Records on a compilation titled The Quatermass Film Music Collection."]}, {"page": "Quatermass 2", "response": ["Quatermass 2 (a.k.a. Enemy From Space in the United States and Canada) is a 1957 black-and-white British science fiction horror film drama from Hammer Film Productions, produced by Anthony Hinds, directed by Val Guest, that stars Brian Donlevy, and co-stars John Longden, Sidney James, Bryan Forbes, Vera Day, and William Franklyn. Quatermass 2 is a sequel to Hammer's earlier film The Quatermass Xperiment (1955). It was originally shown in the UK as Quatermass II. Like its predecessor, it is based on the BBC Television serial Quatermass II written by Nigel Kneale. Brian Donlevy reprises his role as the eponymous Professor Bernard Quatermass, making him the only actor to play the character twice in a film. It is considered as the first film sequel to use the ‘2’ / ‘II’  suffix within the title.", "Nigel Kneale had been unhappy with Hammer's adaptation of The Quatermass Experiment, partly because he received no extra remuneration from the sale of the film rights and partly because of the changes made in the film to his original television script. In the wake of his dissatisfaction, Kneale exerted pressure on the BBC to allow him to be more involved in the sale of the rights to his work. Despite being in the final months of his BBC contract, Kneale was allowed to collaborate with Hammer on the adaptation of Quatermass II. The first draft of the screenplay was written by Kneale with input from producer Anthony Hinds. Subsequent drafts were worked on by director Val Guest, as he had done before on The Quatermass Xperiment. Guest recalled of Kneale's script that there was “lots of philosophising and very down-to-earth thinking but it was too long, it would not have held screenwise. So, again, I had to tailor it and sharpen it and hopefully not ruin it”. The script was submitted to the British Board of Film Censors (BBFC) in April 1956. BBFC reader Audrey Field commented, “There should be the customary general caution that the sky is not the limit, either in sights or sounds”. The BBFC's main objection was to a scene in which a guard from the Winnerden Flats complex murders a family having a picnic. This scene was omitted from the final film, although it is present in the original television presentation."]}, {"page": "Quatermass and the Pit (film)", "response": ["Professor Bernard Quatermass was introduced to audiences in two BBC television serials, The Quatermass Experiment (1953) and Quatermass II (1955), written by Nigel Kneale. The rights to both these serials were acquired by Hammer Film Productions, and the film adaptations—The Quatermass Xperiment and Quatermass 2, both directed by Val Guest and starring Brian Donlevy as Quatermass—were released in 1955 and 1957, respectively.Hearn & Barnes, passim. Kneale went on to write a third Quatermass serial—Quatermass and the Pit—for the BBC, which was broadcast in December 1958 and January 1959. Once again interested in making a film adaptation, Hammer and Kneale, who had by then left the BBC and was working as a freelance screenwriter, completed a script in 1961. It was intended that Val Guest would once again direct and Brian Donlevy would reprise his role of Quatermass, with production to commence in 1963.Murray, p. 76. Securing financing for the new Quatermass film proved difficult. In 1957 Hammer had struck a deal with Columbia Pictures to distribute their pictures, and the companies collaborated on thirty films between 1957 and 1964.Hearn & Barnes, p. 13. Columbia, which was not interested in Quatermass, passed on the script, and the production went into limbo for several years.Kinsey, p. 18. In 1964 Kneale and Anthony Hinds submitted a revised, lower-budget script to Columbia, but the relationship between Hammer and Columbia had begun to sour and the script was again rejected.Hearn & Barnes, p. 116. In 1966 Hammer entered into a new distribution deal with Seven Arts, ABPC, and Twentieth Century Fox; Quatermass and the Pit finally entered production."]}, {"page": "X the Unknown", "response": ["Norman was borrowed from Ealing. He had just made his directorial debut with The Night My Number Came Up. He later said \"I hated working at Hammer... because I never got on with Anthony Hinds.\"Brian McFarlane, An Autobiography of British Cinema, Metheun 1997 p441"]}, {"page": "The Evil of Frankenstein", "response": ["The script for the film by Anthony Hinds was based on a story synopsis that Peter Bryan submitted in May 1958 for the aborted Tales of Frankenstein television series. The film breaks continuity from the preceding film, The Revenge of Frankenstein. Denis Meikle described the break: \"Any pretext of a connection to The Revenge of Frankenstein is dispensed with in a brazen display of contempt for continuity. A flashback creates a prior history that is wholly unrelated to the last Sangster script and is instead plundered from Universal's Frankenstein Meets the Wolfman.\""]}, {"page": "The Kiss of the Vampire", "response": ["The Kiss of the Vampire (also known as Kiss of Evil on American television) is a 1963 British vampire film made by the film studio Hammer Film Productions. The film was directed by Don Sharp and was written by producer Anthony Hinds, credited under his writing pseudonym John Elder.", "Originally intended to be the third movie in Hammer's Dracula series (which began with 1958's Dracula with Christopher Lee and Peter Cushing, and was followed by 1960's The Brides of Dracula with Cushing alone), it was another attempt by Hammer to make a Dracula sequel without Christopher Lee. The final script by Anthony Hinds makes no reference to Dracula and expands on the directions taken in Brides by portraying vampirism as a social disease afflicting those who choose a decadent lifestyle."]}, {"page": "The Brides of Dracula", "response": ["*\"My own personal involvement in a film like Brides was always 100 percent, not because I felt it to be my duty but because I felt very strongly that the pictures were mine. No doubt Terry [Fisher] thought they were his and Jimmy Sangster thought they belonged to him. And Peter C knew they were his.\" — Producer Anthony HindsLittle Shoppe of Horrors #14, 1999"]}, {"page": "Taste the Blood of Dracula", "response": ["Taste the Blood of Dracula is a 1970 British supernatural horror film produced by Hammer Film Productions. Directed by Peter Sasdy from a script by Anthony Hinds, it is the fifth installment in Hammer's Dracula series, and the fourth to star Christopher Lee as Count Dracula, the titular vampire. The film also features Geoffrey Keen and Gwen Watford."]}, {"page": "The Last Man on Earth (1964 film)", "response": ["Producer Anthony Hinds purchased the rights to Matheson's novel for Hammer Film Productions. Matheson wrote a script, and Hammer announced in 1958 that they would make it. However, British censors would not allow the film to be produced, so Hinds resold the script to American producer Robert L. Lippert."]}, {"page": "The Phantom of the Opera (1962 film)", "response": ["Over the next two years, the project fell on and off the charts.  In 1960, the project was connected with Kathryn Grayson, although she had not been in pictures for some years.Boxoffice Barometer.  29 February 1960.  Page 159. According to author Wayne Kinsey's interpretation of a quote from producer Anthony Hinds, the romantic lead (Harry Hunter) was written for Cary Grant .Wayne A. Kinsey Hammer Films: The Bray Studio Years, Reynolds & Hearn, 2002 Grant had expressed his interest in doing a Hammer horror film, at a time when it was common for American actors to be featured in British films. Actually, what Hinds said repeatedly in interviews was, \"I wrote the script for Cary Grant,\" which makes it far more likely Grant was to play the title role, not a subordinate leading man."]}, {"page": "The Reptile", "response": ["The Hammer Story: The Authorised History of Hammer Films called the film \"classic sixties Hammer\"; while Allmovie wrote, \"there are some inconsistencies in Anthony Hinds' script, but the film is handsomely mounted and delivers its share of shocks\" ; Time Out wrote, \"it's slower and moodier than its companion-piece (Plague of the Zombies), but strikingly Conan Doyleish in its stately costume horrors. Jacqueline Pearce is terrific\"; and British Horror Films said simply, \"it's superb\". The Monthly Film Bulletin wrote that it \"has an unusually controlled dignity for a Hammer production; instead of the customary blood-lettings, we are invited to observe with nervous curiosity the slow self-destruction of a proud but superstitious man incapable of rescuing his daughter from the fate half-wished upon her by himself ... Altogether, a film of quite some merit.\" Kevin Thomas of the Los Angeles Times panned the film, writing that \"the script is too silly for all but the most uncritical.\"Thomas, Kevin (June 3, 1966). \"Horror Double Bill Feeble\". Los Angeles Times. Part V, p. 11."]}, {"page": "She (1965 film)", "response": ["The re-filming of the H. Rider Haggard novel – which had been filmed previously in 1908, 1911, 1916, 1917, 1925 and 1935 – was the idea of Kenneth Hyman of Seven Arts Productions, who had a long-running relationship with Hammer Film Productions. Anthony Hinds commissioned a script from John Temple-Smith, and the lead role was assigned to Ursula Andress, known at that time for her role in the James Bond film Dr. No. She would thus become the first Hammer film to be built around a female star."]}, {"page": "Legend of the Werewolf", "response": ["The film was produced by Tyburn Film Productions, a short-lived company that attempted to make films in the style of Hammer Horrors. The film was shot at Pinewood Studios from 19 August 1974.Jonathan Rigby, English Gothic: A Century of Horror Cinema, Reynolds & Hearn 2000 The screenplay was written by Anthony Hinds under his pseudonym John Elder.  Hinds was also the writer of Hammer's only werewolf film The Curse of the Werewolf (1961), in which Michael Ripper also appeared. The film's sets were designed by the art director Jack Shampan."]}, {"page": "N. J. Crisp", "response": ["*Television film (co-written with Anthony Hinds, 1984)"]}, {"page": "The Masks of Death", "response": ["While funding for the proposed film collapsed, it led to Francis discussing an original tale with writer Anthony Hinds."]}, {"page": "Hinds (surname)", "response": ["*Anthony Hinds (1922–2013), film producer and scriptwriter"]}, {"page": "List of Old Paulines", "response": ["*Anthony Hinds (1922–2013); film producer and scriptwriter, known for Hammer Films"]}]}}