{"wiki_id": "http://www.wikidata.org/entity/Q2852823", "itemLabel": "Anthony Bushell", "itemDescription": "actor (1904-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Bushell", "wikipedia_page": {"main": "Anthony Arnatt Bushell (19 May 1904 – 2 April 1997) was an English film actor and director, who appeared in 56 films between 1929 and 1961. He played Colonel Breen in the BBC serial Quatermass and the Pit (1958–59), and also appeared in and directed various British TV series such as Danger Man.", "link_mentions": [{"page": "Five Star Final", "response": ["* Anthony Bushell as Phillip Weeks"]}, {"page": "Disraeli (1929 film)", "response": ["*Anthony Bushell as Charles"]}, {"page": "Jean Anouilh", "response": ["* Fading Mansion (Roméo et Jeanette). Duchess Theatre, London: 31 August 1949. Directed by Anthony Bushell. With Siobhan McKenna, George Relph, Michael Gough."]}, {"page": "Oskar Werner", "response": ["In 1950, Werner journeyed to the United Kingdom to reprise the role he had played in Der Engel mit der Posaune in its English-language version The Angel with the Trumpet, directed by Anthony Bushell. He and his wife divorced at about this time but remained friends. He appeared in a few more German-Austrian films before going to Hollywood for a lead role in the 20th Century Fox war film Decision Before Dawn."]}, {"page": "1997 in film", "response": ["| style=\"text-align:center;\"| 2 || Anthony Bushell || style=\"text-align:center;\"| 92 || style=\"text-align:center;\"|UK || style=\"text-align:center;\"| Actor || "]}, {"page": "The Battle of the River Plate (film)", "response": ["* Anthony Bushell as Eugen Millington-Drake, the British Minister in Uruguay"]}, {"page": "Quatermass and the Pit", "response": ["Colonel Breen was played by Anthony Bushell, who was known for various similar military roles – including another bomb disposal officer in The Small Back Room (1949) – and preferred to be addressed as \"Major Bushell\", the rank he held during the Second World War. Roney was played by Canadian actor Cec Linder, John Stratton played Captain Potter, and Christine Finn played the other main character, Barbara Judd. Finn went on to provide the voices for various characters in the popular 1960s children's television series Thunderbirds."]}, {"page": "Vanity Fair (1932 film)", "response": ["Vanity Fair is a 1932 American pre-Code drama film directed by Chester M. Franklin and starring Myrna Loy, Conway Tearle and Anthony Bushell. The film is modernized adaptation of William Makepeace Thackeray's 1848 novel of the same name with the original Regency-era story reset in Twentieth Century Britain. Three years later Thackeray's novel was adapted again as Becky Sharp, the first three-strip technicolor film.", "*Anthony Bushell as Dobbin"]}, {"page": "The Small Back Room", "response": ["* Anthony Bushell as Colonel Strang (Royal Engineers OC)"]}, {"page": "The Arsenal Stadium Mystery", "response": ["*Anthony Bushell as John Doyce "]}, {"page": "Charles Lloyd-Pack", "response": ["| 1961 || The Terror of the Tongs || Dr. Fu Chao, tong member || Anthony Bushell ||"]}, {"page": "Arthur Rostron", "response": ["He has been portrayed in various Titanic films by several actors. In the 1958 A Night to Remember he is played by Anthony Bushell. In 1979's SOS Titanic he is portrayed by Philip Stone. In the 1996 TV drama Titanic he is portrayed by Terence Kelly. Finally, in the 1999 TV documentary The Titanic Chronicles (about the U.S. Senate inquiry), he was portrayed (in voice) by John Cunningham."]}, {"page": "E. M. Delafield", "response": ["*Film script with Vera Allinson: Crime on the Hill (1933), which starred Sally Blane, Anthony Bushell, Lewis Casson and Nigel Playfair."]}, {"page": "High Treason (1951 film)", "response": ["*Anthony Bushell as Major Elliott"]}, {"page": "The Sacred Flame (play)", "response": ["* Anthony Bushell as Colin Tabret"]}, {"page": "The Ghoul (1933 film)", "response": ["* Anthony Bushell as Ralph Morlant, the Professor's nephew and one of his two heirs"]}, {"page": "Sir Francis Drake (TV series)", "response": ["*Anthony Bushell as Tom Doughty"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Anthony Bushell (Acting Diploma 1926)"]}, {"page": "The Lion Has Wings", "response": ["*Anthony Bushell as Pilot"]}, {"page": "Ernst Lothar", "response": ["*The Angel with the Trumpet, directed by Anthony Bushell (UK, 1950, based on the novel Der Engel mit der Posaune)"]}, {"page": "The Show of Shows", "response": ["* Anthony Bushell"]}, {"page": "Eugen Millington-Drake", "response": ["In 1936 he was the Honorary President of Uruguayan Delegation to the 1936 Summer Olympics. In 1939 he played a pivotal, behind-the scenes role in the Battle of the River Plate. (In the 1956 British war film The Battle of the River Plate he is played by the actor Anthony Bushell, and is portrayed as a well dressed and accomplished diplomat.)"]}, {"page": "A Night to Remember (1958 film)", "response": ["* Anthony Bushell as Captain Arthur Rostron"]}, {"page": "The Black Knight (film)", "response": ["The blacksmith and swordsmith John (Alan Ladd) is tutored at the court of King Arthur (Anthony Bushell), but as a commoner he can't hope to win the hand of Lady Linet (Patricia Medina), daughter of the Earl of Yeonil (Harry Andrews). The Earl's castle is attacked by Saracens and Cornishmen — disguised as Vikings — and his wife is killed, making him lose his memory. The attack was part of a plot by the Saracen Sir Palamides (Peter Cushing) and the pagan Cornish King Mark (Patrick Troughton) to overthrow Arthur and Christianity and take over the country, whilst pretending to be Arthur's friends and allies  - Palamides is a knight of the round table and Mark has faked his own baptism.TCM", "*Anthony Bushell as King Arthur"]}, {"page": "The Scales of Justice", "response": ["|| Anthony Bushell || B&W || On a cruise to cheer herself up after a broken romance, Shirley Fawsett meets Joe Ashton. The result is a court case where he sues her for breach of promise."]}, {"page": "The Miniver Story", "response": ["* Anthony Bushell as Dr. Kaneslaey"]}, {"page": "The Scarlet Pimpernel (1934 film)", "response": ["* Anthony Bushell as Sir Andrew Foulkes"]}, {"page": "Heather Thatcher", "response": ["In 1931, she visited Hollywood while attending the wedding of James Gleason. As a star of English comedy, she was being compared to Marilyn Miller, Thatcher wore a monocle to the marriage ceremony. In the autumn of 1931, she was invited to a reception following the premiere of Strictly Dishonorable (1931), at the Carthay Circle Theatre. Among her friends in films were Anthony Bushell and Zelma O'Neal."]}, {"page": "List of American films of 1931", "response": ["|Chances|| Allan Dwan || Douglas Fairbanks Jr., Rose Hobart, Anthony Bushell || War || Warner Bros.", "|The Royal Bed || Lowell Sherman || Mary Astor, Anthony Bushell || Comedy || RKO"]}, {"page": "James Carreras", "response": ["* The Terror of the Tongs (Anthony Bushell) a.k.a. Terror of the Hatchet Men (US) (1961)"]}, {"page": "List of horror films of the 1930s", "response": ["| T. Hayes Hunter || Boris Karloff, Cedric Hardwicke, Ernest Thesiger, Dorothy Hyson, Anthony Bushell || United Kingdom || "]}, {"page": "List of comedy films of the 1930s", "response": ["|The Royal Bed|| Lowell Sherman||Lowell Sherman, Mary Astor, Anthony Bushell|| United States ||"]}, {"page": "Yvonne Monlaur", "response": ["|Anthony Bushell"]}, {"page": "List of British films of 1950", "response": ["|The Angel with the Trumpet||Anthony Bushell||Eileen Herlie, Basil Sydney, Norman Wooland, Maria Schell||Drama||"]}, {"page": "List of British films of 1951", "response": ["|The Long Dark Hall||Reginald Beck, Anthony Bushell||Rex Harrison, Lilli Palmer||Crime||"]}, {"page": "The Red Beret", "response": ["* Anthony Bushell as Major General Whiting"]}, {"page": "The Rebel Son", "response": ["The Rebel Son is a 1938 British historical adventure film directed by Adrian Brunel and starring Harry Baur, Anthony Bushell and Roger Livesey. Patricia Roc also appears in her first screen role. It is a re-working by Alexander Korda of Granowski's 1936 French film adaptation of the Russian novel Taras Bulba by Russian classic writer Nikolai Gogol, set in the 17th century Ukraine.", "* Anthony Bushell as Andrei Bulba "]}, {"page": "List of British films of 1933", "response": ["|Red Wagon || Paul L. Stein || Charles Bickford, Anthony Bushell || Drama ||"]}, {"page": "List of British films of 1932", "response": ["|The Silver Greyhound||William C. McGann||Percy Marmont, Anthony Bushell||Crime||"]}, {"page": "List of British films of 1938", "response": ["|The Rebel Son||Adrian Brunel, Albert de Courville, Alexis Granowsky|| Harry Baur, Anthony Bushell||Historical||"]}, {"page": "List of British films of 1937", "response": ["|The Angelus||Thomas Bentley||Anthony Bushell, Nancy O'Neil||Crime||"]}, {"page": "List of British films of 1936", "response": ["|Dusty Ermine||Bernard Vorhaus||Anthony Bushell, Jane Baxter||Crime||"]}, {"page": "Dark Journey (film)", "response": ["Soon after, a German war veteran named Baron Karl Von Marwitz (Conrad Veidt) enters Sweden. He claims to have left the German Navy because of war injuries, but some of his former colleagues believe he is a deserter. One night, Madeleine goes to a nightclub accompanied by her friend, English secret service agent Bob Carter (Anthony Bushell). She notices Von Marwitz playing a bar room game predicting what girls will say after he kisses them. After she exposes the trick, Von Marwitz becomes intrigued by Madeleine's beauty and cool demeanor. The next day he visits her shop with Lupita (Joan Gardner), the Brazilian socialite he tricked the previous evening. After the temperamental Lupita leaves, Von Marwitz begins asking Madeleine to go out with him. In the coming days, she continues to refuse his requests, even after he offers to purchase all the stock in her shop. When he finally gives up, she gives in and agrees to date him.", "* Anthony Bushell as Bob Carter"]}]}}