{"wiki_id": "http://www.wikidata.org/entity/Q28563479", "itemLabel": "Ralph Mason", "itemDescription": "British opera singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ralph_Mason", "wikipedia_page": {"main": "John Francis Mason (1 September 1938 – 10 August 2016), known by his stage name Ralph Mason, was an English singer best remembered for his performances in leading tenor roles with the D'Oyly Carte Opera Company in the 1960s and 1970s.  \nAfter service in the British army, ultimately as the personal secretary to Field Marshal Montgomery, Mason began a professional singing career in 1959, joining D'Oyly Carte later that year. From 1963 to 1965, he appeared in My Fair Lady, sometimes in the role of Freddie. He rejoined D'Oyly Carte from 1965 to 1973, becoming principal tenor. He then played Major Mark Blake in Coronation Street, returned briefly to D'Oyly Carte as a guest artist, and sang in concerts. In 1977 Mason joined Welsh National Opera as a chorister and small part player, where he remained until his retirement in 2003.", "link_mentions": [{"page": "The Sorcerer", "response": ["|Alexis||Derek Oldham||Charles Goulding||John Dean||Ralph Mason||Meston Reid"]}, {"page": "Princess Ida", "response": ["|Cyril||Charles Goulding||John Dean||Leonard Osborn||David Palmer||Ralph Mason"]}, {"page": "The Gondoliers", "response": ["|Marco||Thomas Round||Ralph Mason||Meston Reid||Meston Reid"]}, {"page": "Destiny (Janáček)", "response": ["* Chandos CHAN3029 (sung in English): Helen Field, Philip Langridge, Kathryn Harries, Peter Bronder, Stuart Kale, Barry Mora, Christine Teare, Elizabeth Gaskell, Dorothy Hood, Catroina Bell, Mark Holland, Rebecca Moseley-Morgan, Samuel Linay, Michael Preston-Roberts, Yolande Jones, Cheryl Edwards, Mary Davies, Gaynor Keeble, Gareth Rhys-Davies, Philip Lloyd-Evans, Ralph Mason, Timothy German, Frances Manning; Welsh National Opera Orchestra and Chorus; Sir Charles Mackerras, conductor (recorded 1989)"]}, {"page": "John Mason", "response": ["* Ralph Mason (John Francis Mason, 1938–2016), English tenor"]}, {"page": "Come In from the Rain (Andi Deris album)", "response": ["*Ralph Mason – drums, backing vocals"]}, {"page": "Done by Mirrors", "response": ["*Ralph Mason – drums, backing vocals, co-lead vocals on \"Do You Really Wanna Know\""]}, {"page": "John Ralph Mason", "response": ["#REDIRECT Ralph Mason"]}]}}