{"wiki_id": "http://www.wikidata.org/entity/Q285197", "itemLabel": "Dan Cruickshank", "itemDescription": "Architectural historian, presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Dan_Cruickshank", "wikipedia_page": {"main": "Daniel Gordon Raffan Cruickshank (born 26 August 1949) is a British art historian and BBC television presenter, with a special interest in the history of architecture.", "link_mentions": [{"page": "Joshua Reynolds", "response": ["Biographer Ian McIntyre discusses the possibility of Reynolds having enjoyed sexual rendezvous with certain clients, such as Nelly O'Brien (or \"My Lady O'Brien\", as he playfully dubbed her) and Kitty Fisher, who visited his house for more sittings than were strictly necessary. Dan Cruickshank in his book London's Sinful Secret summarized Reynolds as having visited and re-visited various reputed red light districts in London after his return from Italy as a possible contributor to his medical condition and appearance due to commonly contracted disease in those areas of London.Dan Cruickshank, London's Sinful Secret, p.92. St. Martin's Press, New York (2009)."]}, {"page": "Palace of Westminster", "response": ["Architectural historian Dan Cruickshank selected the Palace as one of his five choices for the 2006 BBC television documentary series Britain's Best Buildings."]}, {"page": "Tower Bridge", "response": ["Benjamin Crisler, the New York Times film critic, wrote in 1938: \"Three unique and valuable institutions the British have that we in America have not: Magna Carta, the Tower Bridge and Alfred Hitchcock.\" Architectural historian Dan Cruickshank selected Tower Bridge as one of his four choices for the 2002 BBC television documentary series Britain's Best Buildings."]}, {"page": "William Friese-Greene", "response": ["In 2006 the BBC ran a series of programmes called The Lost World of Friese-Greene, presented by Dan Cruickshank about Claude Friese-Greene's road trip from Land's End to John o' Groats, entitled The Open Road, which he filmed from 1924 to 1926 using The Friese-Greene Natural Colour Process process.The Open Road (2007) British Universities Film & Video Council Modern television production techniques meant they were able to remove the issues of flickering and colour fringing around moving objects, which Kinemacolor and this process had when projected. The result was a unique view of Britain in colour in the mid-1920s.The Lost World of Friese-Greene (2006) British Universities Film & Video Council, ."]}, {"page": "List of historians", "response": ["*Dan Cruickshank (born 1949), Britain, architecture"]}, {"page": "Sedlec Ossuary", "response": ["In the documentary Long Way Round, Ewan McGregor and Charley Boorman stop to see this church. Dan Cruickshank also views the church in his Adventures in Architecture."]}, {"page": "Durham Cathedral", "response": ["Architectural historian Dan Cruickshank selected the cathedral as one of his four choices for the 2002 BBC television documentary Britain's Best Buildings."]}, {"page": "Philip Hardwick", "response": ["Despite the efforts of John Betjeman and other conservationists, the Euston Arch was demolished in the early 1960s. The gates of the arch are stored at the National Railway Museum in York. In 1994, the historian Dan Cruickshank discovered 4,000 tons, or about 60%, of the arch's stones buried in the bed of the River Lea in the East End of London, including the architrave stones with the gilded EUSTON lettering. This discovery has opened the possibility of a reconstruction of the arch."]}, {"page": "Hessell-Tiltman Prize", "response": ["*Dan Cruickshank, Spitalfields: The History of a Nation in a Handful of Streets"]}, {"page": "Spitalfields", "response": ["Amongst the many well known artists living in Spitalfields are Gilbert and George, Ricardo Cinalli, Tracey Emin and Stuart Brisley. TV presenter, architecture expert and Georgian fanatic Dan Cruickshank was an active campaigner for Spitalfields, and continues to live in the area. Writer Jeanette Winterson turned a derelict Georgian house into an organic food shop, Verde's, as part of the Slow Food movement.", "*Dan Cruickshank (1949–), art and architectural historian"]}, {"page": "Down Street tube station", "response": ["The station features in Billy Connolly's World Tour Of England, Ireland and Wales, Dan Cruickshank's National Geographic Channel series Great Railway Adventures and the 2012 TV Series The Tube."]}, {"page": "Sheerness", "response": ["The annual arts and heritage Sheerness Promenade Festival opened in September 2011 with appearances by Michael Palin and Dan Cruickshank. It takes place in late July at the Sheppey Little Theatre, the Heritage Centre in Blue Town and various other venues in Sheerness."]}, {"page": "The Circus, Bath", "response": ["Architectural historian Dan Cruickshank selected the Circus as one of his five choices for the 2006 BBC television documentary series Britain's Best Buildings."]}, {"page": "1949 in architecture", "response": ["* August 26 – Dan Cruickshank, British architectural historian"]}, {"page": "Libertine", "response": ["One or two positive reviews appeared, such as the one in the Globe, 7 June 1823: \"The Liber Amoris is unique in the English language; and as, possibly, the first book in its fervour, its vehemency, and its careless exposure of passion and weakness—of sentiments and sensations which the common race of mankind seek most studiously to mystify or conceal—that exhibits a portion of the most distinguishing characteristics of Rousseau, it ought to be generally praised\".Quoted by Jones, p. 338. Dan Cruickshank in his book London's Sinful Secret summarized Hazlitt's infatuation stating: \"Decades after her death Batsy (Careless) still haunted the imagination of the essayist William Hazlitt, a man who lodged near Covent Garden during the 1820s, where he became unpleasantly intimate with the social consequences of unconventional sexual obsession that he revealed in his Liber Amoris of 1823, in which he candidly confessed to his infatuation with his landlord's young daughter.\"Dan Cruickshank, London's Sinful Secret, p.92. St. Martin's Press, New York (2009)."]}, {"page": "Francis Greenway", "response": ["Greenway’s works include Hyde Park Barracks, extensions to First Government House, the stables for a projected new Government House (condemned for their ‘useless magnificence’ by a visiting British official, the building is now home to the Sydney Conservatorium of Music), and St James' Church, Sydney, which was chosen as one of Australia’s only two man-made ‘treasures’ by Dan Cruickshank in the BBC series Around the World in 80 Treasures."]}, {"page": "Tyntesfield", "response": ["In 2002, after its purchase by the National Trust but before its opening to the public, the house and its contents were explored in the Oxford Films documentary, The Lost World of Tyntesfield, hosted by art historian Dan Cruickshank.The Lost World of Tyntesfield, Oxford Films, https://oftv.co.uk/work/lost-world-tyntesfield/ The house was featured in the 2017 film Crooked House, an adaptation of the Agatha Christie novel of the same name starring Glenn Close, Terence Stamp, Max Irons and Christina Hendricks. It also featured in the BBC television series Sherlock in the episode \"The Abominable Bride\" and Doctor Who in the episode \"Hide\"."]}, {"page": "Wendy Beckett", "response": ["* The Art of Dying (2009) (Dan Cruickshank interviews Sister Wendy on the helpfulness of art in the face of death)"]}, {"page": "Mitchell and Kenyon", "response": ["A prime-time three-part series The Lost World of Mitchell & Kenyon was shown on the BBC in January 2005 with enthusiastic commentary by historian Dan Cruickshank and interviews with descendants of people shown in the films, and is available on DVD from the BBC or the BFI."]}, {"page": "Easton Neston house", "response": ["In May 2011 a television programme featuring Easton Neston, by the British architectural historian Dan Cruickshank, in the series The Country House Revealed, was broadcast by the BBC.BBC i-player accessed 26 May 2011 This raised the question of whether Wren or Hawksmoor designed the building. Cruickshank obtained samples of wood from the building's roof and date tests revealed them as having originated from trees which were cut down between 1700 and 1701, which was proposed as proof that Hawksmoor was the architect, not Wren.", "Some years after completion of the house in 1702, Hawksmoor drew-up further plans for a huge entrance court. These designs, never fully executed but published in Vitruvius Britannicus, would have flanked the existing rectangular house with two wings, one containing stables and the other service rooms. The fourth (entrance) side of the courtyard was to have been an elaborate colonnade. No substantial part of this later scheme was built, except for two large and now decayed Ozymandian entrance piers, marooned in the park. The two pre-existing red-brick wings (themselves perhaps owing something to Christopher Wren) remained, although the western (stable) wing was later demolished after the new stables were built. Some architectural commentators, including Dan Cruickshank feel that Hawksmoor's mansion might have been spoilt by this new scheme, which owed more to Sir John Vanbrugh's architectural concepts than to Hawksmoor's. The whole proposed new design was depicted in Colen Campbell's 1715 work Vitruvius Britannicus,Vitruvius Britannicus,  vol. i, 1715, pls 98 – 100 as though it had in fact been built.", "*Easton Neston on the May 2011 BBC2 programme The Country House Revealed with Dan Cruickshank"]}, {"page": "Timewatch", "response": ["| Dan Cruickshank"]}, {"page": "Banister Fletcher (junior)", "response": ["A centenary 20th edition edited by Dan Cruickshank was produced in 1996.Cruickshank, Dan (editor), Banister Fletcher's A History of Architecture], Architectural Press, 20th edition, 1996.  "]}, {"page": "Minaret of Jam", "response": ["*Interlaced bands consisting of surat Maryam XIX.Meeting with a minaret Dan Cruickshank relives his epic journey to a threatened wonder in Afghanistan, Dan Cruickshank, The Guardian, Wednesday 23 April 2008, https://www.theguardian.com/artanddesign/2008/apr/23/heritage.architecture", "* Dan Cruickshank (ed.), Sir Banister Fletcher's A History of Architecture, Twentieth edition, Architectural Press 1996, "]}, {"page": "Hardwick Hall", "response": ["Dan Cruickshank, an historian specialising in architecture, selected the Hall in 2006 as one of his five choices for Britain's Best Buildings, a documentary series made by the BBC for television. Innovative in its own time, it would serve, three centuries later, as a source of inspiration for the enormous Main Exhibition Building at the Philadelphia Centennial Exhibition of 1876. Hardwick Hall was an ideal model for a building which was intended to merge historicism with the large expanses of glass that had become de rigueur for the main exhibition halls at international expositions and fairs in the wake of the success of The Crystal Palace constructed for the 1851 London Exhibition.Nikolaus Pevsner, A History of Building Types. London: Thames and Hudson, 1976, p. 248."]}, {"page": "St James' Church, Sydney", "response": ["One of Greenway's finest works, St James' is listed on the (now defunct) Register of the National Estate. It has been called an \"architectural gem\" and was featured by Dan Cruickshank in the BBC television series Around the World in 80 Treasures.2005, Episode 3. From 1966 to 1993 the spire of St James' appeared on the Australian Australian ten-dollar note among other Greenway buildings. In 1973, the church appeared on a 50 cent postage stamp, one of four in a series illustrating Australian architecture issued to commemorate the opening of the Sydney Opera House. The Old Supreme Court building, also designed by Greenway with alternations by others, located next to the church is of the same date. Across the square is Greenway's \"masterpiece\", the UNESCO World Heritage listed-Hyde Park Barracks, designed to align with the church. Beside the barracks stands Sydney's oldest public building, part of the General Hospital built in 1811 and now known as the Mint Building. Separated from the Mint by the present-day Sydney Hospital is Parliament House, Sydney, of which the central section is a further part of the early hospital, and is now home to the New South Wales State Parliament. In the mid-twentieth century St. James' was one of several historic buildings in the precinct that were threatened with demolition."]}, {"page": "The Lost World of Mitchell & Kenyon", "response": ["Dan Cruickshank presents and narrates the series; in addition, descendants of some of the people featured in the original films provide commentaries upon them; and (in what many critics considered the series' weakest feature) scenes from the life and work of filmmakers Sagar Mitchell and James Kenyon are dramatized in speeded-up form like incorrectly screened silent movies (although the actual film excerpts are shown at the correct speed)."]}, {"page": "Dennis Severs' House", "response": ["Dennis Severs' House in Folgate Street, London is a \"still-life drama\" created by Dennis Severs, who owned and lived in it until his death, as a \"historical imagination\" of what life would have been like inside for a family of Huguenot silk weavers. It is a Grade II listed Georgian terraced house in Spitalfields in the East End, Central London, England. From 1979 to 1999 it was lived in by Dennis Severs, who gradually recreated the rooms as a time capsule in the style of former centuries. Severs' friend Dan Cruickshank said: \"It was never meant to be an accurate historical creation of a specific moment – it was an evocation of a world. It was essentially a theatre set.\""]}, {"page": "Around the World in 80 Treasures", "response": ["Around the World in 80 Treasures is a 10-episode art and travel documentary series by the BBC, presented by Dan Cruickshank, and originally aired in February, March, and April 2005. The title is a reference to Around the World in Eighty Days, the classic adventure novel by Jules Verne."]}, {"page": "Juliet Morris", "response": ["She was also the presenter of BBC's The House Detectives (1997–2000) where she and a team of experts, led by Dan Cruickshank, investigated the histories of houses belonging to members of the public. She presented the BBC overseas property show, Uncharted Territory (2006 and 2007) and she was formerly a reporter on Countryfile."]}, {"page": "Euston Arch", "response": ["In 1994 the historian Dan Cruickshank discovered that at least 60% of the stone from the Arch was buried in the bed of the River Lea at the Prescott Channel in the East End of London. The location of the stones, for which he had been searching for 15 years, had been revealed by Bob Cotton, a British Waterways engineer, who had acquired the material in 1962 to fill a chasm in the bed of the channel.", "In 1996 Dan Cruickshank launched the Euston Arch Trust, an organisation dedicated to the rebuilding of the arch, which counted among its members the modernist architects Peter Smithson (who with his wife Alison had written a history of the arch) and Piers Gough. The trustees saw the opportunity to put right a historical wrong whilst at the same time addressing the fragmented townscape around Euston, including possibly the restoration of Euston Square which was laid out in the early nineteenth century but fell victim to the re-development of Euston Station in 1968. Railtrack were reported to be 'keen' on the idea of reconstructing the arch and the London Borough of Camden were said to have 'no case against revival'. The estimated cost of rebuilding in 1996 was said to be £5 million."]}, {"page": "Don McCullin", "response": ["Filmed in February 2018 and broadcast in May, the BBC Four documentary The Road To Palmyra saw McCullin visit Syria with historian Dan Cruickshank to see the devastation left by the conflict on the UNESCO listed site of Palmyra. Discussing his trip with the Radio Times he spoke of his approach to entering war zones: \"I have risked my life endless times, and ended up in hospital with all kinds of burns and shell wounds. I have those reptile eyes that see behind and in front of me. I’m constantly trying to stay alive. I’m aware of warfare, of hidden mines.\""]}, {"page": "Under Fire", "response": ["* Under Fire (TV series), 2003 documentary TV series, written and presented by Dan Cruickshank"]}, {"page": "Avebury Manor and Garden", "response": ["In 2011, Avebury Manor was the subject of the BBC One television series The Manor Reborn, in which the house was refurbished by a group of experts in collaboration with the National Trust. The four-part series was presented by actress Penelope Keith (the title of the series refers to her earlier television work, To the Manor Born) and former antiques trader Paul Martin, with contributions from experts including Dan Cruickshank (on architecture)."]}, {"page": "Egypt (TV series)", "response": ["A companion series Egyptian Journeys with Dan Cruickshank, in which architectural historian Cruickshank travels the country to explore some of the intriguing stories that have emerged from ancient Egypt, was broadcast concurrently on BBC Two.", "David Liddiment writing in The Guardian complimented the cleverly twinning of this docudrama with the more cerebral Egyptian Journeys with Dan Cruickshank on BBC Two but he points out that this was done during the final stages of the BBC's charter renewal review and insists that the corporation should keep up standards after this process is completed."]}, {"page": "Villa Barbaro", "response": ["More recently the villa has attracted the attention of the British TV presenter Dan Cruickshank who featured the building in a BBC series (Dan Cruickshank's Adventures in Architecture). It also appeared in Episode 3, \"Picturing Paradise\", of the BBC series Civilisations, presented by Simon Schama and first broadcast in 2018."]}, {"page": "Manchester Arndale", "response": ["A backlash against comprehensive development was underway before the centre opened. Amery and Dan Cruickshank's The Rape of Britain, with a foreword by John Betjeman, was published to mark European Architectural Heritage Year in 1975. The book describes the redevelopment of about 20 towns under the heading \"scenes of rape\" and uses the Arndale as an example of \"brutal obliteration\" undertaken by \"the mind that seriously believes that the centre of Manchester should look like a futuristic vision or a barbaric new city borrowed from Le Corbusier\". In the same year the pressure group Save Britain's Heritage was formed, in part to discourage the wholesale demolition of unremarkable industrial buildings in the north of England.Amery and Cruickshank (1975) pp. 12, 14; Parkinson-Bailey (2000) pp. 204–5. Several factors, including the property slump of 1974–6, changes to local government in 1974, and changes in the law after the Poulson affair, in which developers corrupted politicians to expedite schemes against the wider public interest, acted against further developments of the size and type of the Arndale.Guy (1994), pp. 83–6  Built Environment commented that while Arndales are \"an asset to any town\", this scheme \"smacks of opportunism beyond the general interest of the city as a whole\"."]}, {"page": "Claude Friese-Greene", "response": ["In 2006, the BBC ran a series of programmes called The Lost World of Friese-Greene. The series, presented by Dan Cruickshank, included The Open Road, Claude Friese-Greene's film of his 1920s road trip from Land's End to John o' Groats. The Open Road was filmed using the Spectrum Colour Film process, and the British Film Institute used computer processing of the images to minimise the red and green fringes around rapidly moving objects."]}, {"page": "British anti-invasion preparations of the Second World War", "response": ["* The German Threat to Britain in World War Two. By Dan Cruickshank BBC"]}, {"page": "Brno chair", "response": ["The Brno chair was selected by Dan Cruickshank as one of his 80 man-made \"treasures\" in the 2005 BBC series, Around the World in 80 Treasures."]}]}}