{"wiki_id": "http://www.wikidata.org/entity/Q285871", "itemLabel": "Jack Laugher", "itemDescription": "British diver", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Laugher", "wikipedia_page": {"main": "Jack David Laugher  ( LOR; born 30 January 1995) is a British diver competing for Great Britain and England. A specialist on springboard, he competes in individual springboard events, and in synchronised events with Chris Mears and later Daniel Goodfellow. Laugher and Mears became Britain's first diving Olympic champions by winning a gold medal in the men's synchronised 3m springboard event at the 2016 Summer Olympics in Rio, an achievement many had expected double world 10m champion Tom Daley would achieve first. A week later, Laugher won a silver in the men's individual 3m springboard at the same Games, becoming the first British diver to win multiple Olympic diving medals at the same Games.Laugher was a double Commonwealth Games champion for England at the 2014 Games in Glasgow, a triple champion in 2018, and the first British diver to win two medals at the same World Championships, the 2015 World Championships. In 2015, Laugher won the overall title in the FINA Diving World Series for 3-metre springboard.", "link_mentions": [{"page": "January 30", "response": ["*1995 – Jack Laugher, English diver"]}, {"page": "Harrogate", "response": ["*Jack Laugher (born 1995), Olympic Diver."]}, {"page": "Ripon Grammar School", "response": ["Olympic diver and gold medalist Jack Laugher attended RGS from Year 7 to the end of his sixth form in 2014. Team GB and World Championships cyclist Abi Smith joined sixth form in 2018 as a boarding student.", "In 2012, pupil and Olympic diver Jack Laugher, then aged 17, backed the campaign to save the school's swimming pool from council cuts.", "* Jack Laugher, British Olympic Diver (Gold Medallist at Rio 2016) & Travian expert"]}, {"page": "Great Britain at the Olympics", "response": ["Great Britain made its Olympic diving debut in 1908. Jack Laugher with one gold, one silver and one bronze medal is the most successful British Olympic diver in history. Tom Daley, with one gold and three bronze medals, is the most decorated."]}, {"page": "Sport in Leeds", "response": ["Leeds has some of the best diving facilities in the UK. The main club, City of Leeds Diving Club, who train at John Charles Centre for Sport, have produced some of the best divers in Britain, with many going on to be selected for Team GB and competing at an international and Olympic level. Leeds is also responsible for Great Britain's first ever diving Olympic champions: Jack Laugher and Chris Mears, who won the gold medal at the 2016 Rio Olympics. Other successful Leeds-trained divers include Rebecca Gallantree, Dan Goodfellow, Matty Lee, Lois Toulson, Alicia Blagg and Jamaican diver Yona Knight-Wisdom."]}, {"page": "1995 in the United Kingdom", "response": ["* 30 January – Jack Laugher, diver"]}, {"page": "Leeds", "response": ["Leeds is well known for its divers and features some of the best diving facilities in the UK. City of Leeds Diving Club, who train at the John Charles Centre for Sport, has trained many athletes who have competed at international and Olympic level, with Jack Laugher and Chris Mears making history by becoming the first ever divers from Great Britain to win an Olympic gold medal, a feat they accomplished at the 2016 Rio Olympics."]}, {"page": "Tom Daley", "response": ["For the 2011 season, Daley was paired in the synchronized competitions with 2004 Athens Olympic silver medallist Peter Waterfield in British Swimming's continuing efforts to find the best synchro pairing for the 2012 Olympics. At the 2011 National Cup, the British Championship was held in the new Southend Swimming and Diving Centre on 28–30 January and Daley came second in the 3m springboard competition behind Jack Laugher. With Waterfield, he won the 10m platform synchronized competition. The following day, Waterfield beat Daley to the individual 10m platform title for the second successive year, by 494.25 points to 472.35, with Max Brick third with 399.80.", "At the 19th FINA World Junior Diving Championships, held in October 2012 in Adelaide, Australia, Daley led a strong British team and rather unexpectedly won the Boys \"A\" 3m synchronized springboard competition together with Jack Laugher, who had won the individual 3m competition, they had had little practice together. Daley and Laugher scored 338.85 points, over 30 points ahead of Ilia Kuzmin and Maxim Popkov.", "? with Jack Laugher"]}, {"page": "John Charles Centre for Sport", "response": ["The centre is the primary training facility for the City of Leeds Diving Club and is responsible for producing some of the best divers in the country who have been chosen to compete at an international and Olympic level. The club has trained a number of successful athletes including Rebecca Gallantree, Alicia Blag, Dan Goodfellow and Matty Lee as well as Great Britain's first ever diving gold medallists Jack Laugher and Chris Mears."]}, {"page": "Edwin Jongejans", "response": ["He coached Team GB's Hannah Starling at the 3 metre springboard and has coached her as far as the semi finals of the woman's 3 metre springboard during the London 2012 Olympics. His pupils Jack Laugher and Chris Mears won gold at the Rio de Janeiro 2016 Olympics. In 2018 Jongejans returned to Holland and became coach of the Dutch diving team."]}, {"page": "Michael Hixon", "response": ["In the men's synchronized 3-meter springboard event, Hixon along with his diving partner Sam Dorman placed second and won the silver medal with a score of 450.21, behind Jack Laugher and Chris Mears of Great Britain (454.32) but in front of the Chinese pair Qin Kai and Cao Yuan (443.70)."]}, {"page": "Great Britain at the 2012 Summer Olympics", "response": ["| style=\"text-align:left;\" | Jack Laugher"]}, {"page": "Diving at the 2010 Commonwealth Games – Men's synchronised 3 metre springboard", "response": ["|Oliver Dingley, Jack Laugher"]}, {"page": "2010 FINA Diving World Cup – Men's 3 m springboard", "response": ["| 31 ||align=left| Jack Laugher ||align=left||| 322.60 || 31 ||  ||  || ||"]}, {"page": "Great Britain at the 2011 World Aquatics Championships", "response": ["|rowspan=\"2\"| Jack Laugher"]}, {"page": "Diving at the 2011 World Aquatics Championships – Men's 1 metre springboard", "response": ["|align=left| Jack Laugher"]}, {"page": "Diving at the 2012 Summer Olympics – Qualification", "response": [" (Jack Laugher)"]}, {"page": "Diving at the 2011 World Aquatics Championships – Men's 3 metre springboard", "response": ["|align=left| Jack Laugher"]}]}}