{"wiki_id": "http://www.wikidata.org/entity/Q2861476", "itemLabel": "Arjun Mathur", "itemDescription": "Indian actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Arjun_Mathur", "wikipedia_page": {"main": "Arjun Mathur (born 18 October 1981) is a British-Indian actor working predominantly in Bollywood films, web series and television serials. He was seen internationally in the British drama series, 'Indian Summers' and plays the lead character in the Amazon Original series, 'Made in Heaven', which earned him an International Emmy award nomination for 'Best Performance by an Actor'.", "link_mentions": [{"page": "List of Indian male film actors", "response": ["* Arjun Mathur"]}, {"page": "Farhan Akhtar", "response": ["In the same year, Akhtar directed Positive, a film produced by Shernaz Italia and Frenzy Kodaiji, starring Boman Irani and Shabana Azmi. It was a short film running for 12 minutes. Dealing with a family's attitude towards a person suffering from HIV-AIDS, the film was shot in Mumbai and aimed at creating awareness about the problem. It also introduced Arjun Mathur in the film industry. Speaking about the purpose of the project, Akhtar stated that \"Just as a social stigma, many people believe that an HIV patient should be isolated. They also have certain misconceptions about dealing with the disease. And since India has a lot of joint families, it becomes very important for them to understand the value of support to the person who has acquired this disease. This is exactly what Positive talks about.\" The film had its background score composed by Ram Sampath but had no soundtrack. It was a part of the \"AIDS JaaGo\" (\"AIDS Awake\"), a series of four short films, directed by Mira Nair, Santosh Sivan, Vishal Bhardwaj and himself, in a joint initiative of Mira Nair's Mirabai Films, voluntary organisations Avahan and the Bill & Melinda Gates Foundation."]}, {"page": "St. Columba's School, Delhi", "response": ["* Arjun Mathur, actor "]}, {"page": "Mathur (name)", "response": ["* Arjun Mathur (born 1981), British-Indian actor"]}, {"page": "Luck by Chance", "response": ["Young actor Vikram Jaisingh (Farhan Akhtar) arrives in Mumbai to make it as a Bollywood film star with the help of Abhimanyu (Arjun Mathur), an actor friend from his hometown, and their mutual friend Sameer, who works in a studio props department.", "* Arjun Mathur as Abhimanyu 'Abhi' Gupta "]}, {"page": "St. Mary's School, Mumbai", "response": ["* Arjun Mathur – Bollywood actor"]}, {"page": "Excel Entertainment", "response": ["The TV series Made In Heaven (2019) released in March. The show was created by Zoya Akhtar and Reema Kagti  starring Sobhita Dhulipala, Arjun Mathur, Kalki Koechlin, Jim Sarbh among others. The web-series was appreciated heavily by several critics and multiple positive online reviews. The web-series received an award at the ITA awards for the category Best Series Jury Award and prize for the Best Direction.", "| Arjun Mathur, Shabana Azmi and Boman Irani"]}, {"page": "Positive (2007 film)", "response": ["Positive was a part of AIDS JaaGo (AIDS Awake), a series of four short films, directed by Mira Nair (Migration), Santosh Sivan (Prarambha), Vishal Bhardwaj (Blood Brothers) and Farhan Akhtar, in a joint initiative of Mira Nair's Mirabai Films, voluntary organisations Avahan and Bill & Melinda Gates Foundation.Mira Nair, Farhan Akhtar to make films on AIDS Rediff.com, Movies', 22 January 2007. The film stars Boman Irani, Shabana Azmi and a debutant actor, Arjun Mathur.", "Boman Irani plays an AIDS patient, Shabana Azmi as his wife and Arjun Mathur as their son.", "* Arjun Mathur - Abhijit Soni"]}, {"page": "My Name Is Khan", "response": ["* Arjun Mathur as Raj Burman"]}, {"page": "Barah Aana", "response": ["Barah Aana is a 2009 Indian black-comedy drama film written and directed by Raja Menon. The title refers to Barah (12) in Hindustani  (or ), 3/4 Rupees (75 paise), which was a unit of Indian currency before decimalisation. Barah Aana stars Naseeruddin Shah, Vijay Raaz, Arjun Mathur, and Tannishtha Chatterjee. The film depicts the lives of working-class Indians in a globalized milieu and how events spiral out of control when the characters try their hands at crime.  ", "| Arjun Mathur || Aman"]}, {"page": "List of Bollywood films of 2010", "response": ["| My Name Is Khan || Karan Johar || Shah Rukh Khan, Kajol, Vinay Pathak, Jimmy Shergill, Parvin Dabas, Sonya Jehan, Sugandha Garg, Arjun Mathur, Arif Zakaria, Sumeet Raghavan || Thriller, Adventure, Drama, Romance, Comedy"]}, {"page": "I Am (2010 Indian film)", "response": ["*\"Omar\" - Jay Gowda, from Bangalore, (Rahul Bose) meets Omar, a struggling actor in Mumbai, (Arjun Mathur). They flirt and have dinner together and then have sex at a public place. A policeman (Abhimanyu Singh) comes and manhandles them both and threatens Jay to turn him in under Section 377 of the Indian Penal Code and blackmails into giving 100,000 Rupees as bribe. Omar goes with Jay's ATM card to draw money, meanwhile the policeman rapes Jay. Omar returns with 50,000 Rupees, which the policeman takes along with both Jay and Omar's cellphones. Then he takes Omar along with him against protests of Jay (A hint of the policeman intenting to rape Omar). Later on Jay meets Omar again in a hotel and tell him that later that night, Jay had gone and woke up a big lawyer and went with him to the police station to get Omar released only to find that Omar was never there and then he realized that Omar was a part of setup to extort money from Jay. \"Omar\" is inspired by stories and research material provided by the online portal Gay Bombay.", "* Arjun Mathur as Omar"]}, {"page": "Shaitan (film)", "response": ["Gulshan Devaiah made his feature film debut with this film by playing Karan Chaudhary (KC). In an interview with Cinestaan, Nambiar said that \"his character is mostly modelled on a 1980s rock-and-roll guy, not the way he dress but how his attitude\". Initially, Gulshan was auditioned for Rajeev's character Arvind Mathur, a Police Inspector and made a test shoot featuring him as a cop. But as he was too young to play the cop, the role was later given to Rajeev and Gulshan was offered the role of KC, though Nambiar initially wanted Arjun Mathur and Namit Das to play that role. Rajkummar Rao, played the role of Malvankar, a corrupt-police officer, who had a screen presence of 15 minutes. Nambiar convinced Rajkummar to take the role as he did not want to appear in a role that is of a short duration."]}, {"page": "List of Bollywood films of 2011", "response": ["| I Am || Social/Drama || Onir || Sanjay Suri, Radhika Apte, Shernaz Patel, Anurag Kashyap, Pooja Gandhi, Rahul Bose, Arjun Mathur, Abhimanyu Shekhar Singh, Nandita Das, Juhi Chawla, Manisha Koirala, Purab Kohli||  ", "| My Friend Pinto || Romance/Comedy/Crime || Raghav Dar || Prateik Babbar, Kalki Koechlin, Arjun Mathur, Shruti Seth, Makarand Deshpande, Rajendranath Zutshi, Divya Dutta|| "]}, {"page": "My Friend Pinto", "response": ["My Friend Pinto is a 2011 Indian Hindi-language musical comedy film written and directed by Raaghav Dar, in his feature-length directorial debut. It stars Prateik Babbar as Michael Pinto, a well intentioned simpleton and follows his misadventures over the course of a New Year's Eve in Mumbai. Produced by Sanjay Leela Bhansali and Ronnie Screwvala, and distributed by UTV Motion Pictures, it has elements of picaresque, slapstick comedy and multiple musical sequences. The film features Kalki Koechlin, Arjun Mathur, Shruti Seth, Makarand Deshpande, Rajendranath Zutshi and Divya Dutta in supporting roles.", "* Arjun Mathur as Sameer", "Arjun Mathur and Shruti Seth co-starred as the unwilling hosts for the title character in the film. Seth said that she played a \"superficial and disgruntled\" character, who despite a successful career seemed to have lost faith in human relationships. Divya Dutta, who played the role of a failed actress, said that she signed up for the project because of its \"lovely script\". As most of the main cast members were oblivious to slapstick, they attended workshops where they worked on their comic timing, body language, and speech mannerism required for the roles. Makrand Deshpande, Raj Zutshi, Shakeel Khan, and Shikha Talsania play supporting roles in the film."]}, {"page": "List of Bollywood films of 2013", "response": ["| Ankur Arora Murder Case || Suhail Tatari || Kay Kay Menon, Paoli Dam, Arjun Mathur, Vishakha Singh, Harsh Chhaya  || Thriller || style=\"text-align:center;\" |"]}, {"page": "Ankur Arora Murder Case", "response": ["Ankur Arora Murder Case is a 2013 Indian Hindi medical thriller film directed by Suhail Tatari and written and produced by Vikram Bhatt. The film stars Arjun Mathur, Tisca Chopra, Kay Kay Menon, Paoli Dam. The film takes up an urgent and disturbing issue of death during surgery and is based on a real-life incident where a boy dies on the  operation table due to medical negligence. The shooting of the film started after nearly one year of research and similarities to real life are in this case, not coincidental.", "Dr. Romesh Sharma (Arjun Mathur) is a young medical intern who dares to dream. He is in awe of Dr. V. Asthana (Kay Kay Menon), the Chief Surgeon of the Shekhawat General Hospital. All he wants is to be like him. He lives with Dr. Riya Srivastava (Vishakha Singh), his co-intern and the love of his life.", "* Arjun Mathur as Dr. Romesh Sharma"]}, {"page": "List of Bollywood films of 2014", "response": ["|  Fireflies || Sabal Singh Sheikhawat || Rahul Khanna, Monica Dogra, Arjun Mathur, Shivani Ghai, Aadya Bedi || Drama || "]}, {"page": "Indian Summers", "response": ["* Arjun Mathur as Naresh Banerjee"]}, {"page": "Bring On the Night (TV series)", "response": ["Bring On the Night is an Indian television mini-series that premiered on MTV India on 22 September 2012, starring Arjun Mathur, Patrick Graham, Hussain Dalal and Sarang Sathaye. The show follows Kabir \"KD\" Dalal, an entrepreneur in his late 20s, as he and his friends turn a 200-year-old heritage building in Mumbai into an all-night club. The series was written, conceptualized and directed by Vishwesh Krishnamoorthy.", "The show revolves around Kabir \"KD\" DalalJoshi, Samata. \"Serial scan: Bring On The Night\", Mumbai, 19 October 2012. Retrieved on 19 October 2012. (Arjun Mathur) and his motley group of friends: Patrick Graham Fairbottom (Patrick Graham), Devang Oza (Hussain Dalal) and Maakad (Sarang Sathaye). Together with Patrick's ex-girlfriend Sheila Sethi (Dilkhush Reporter) and her friend Piyali Chaudhry (Geetika Tyagi), the Mistry brothers - the uptight Xerxes Mistry (Afshad Kelawala) and the dim-witted Hoshang Mistry (Kashyap Kapoor) - and their best friend Darius Dorabjee (Danesh Irani), the group converts a dilapidated 200-year-old building into a club.", "* Arjun Mathur as Kabir \"KD\" Dalal"]}, {"page": "International Emmy Award for Best Actor", "response": ["|Arjun Mathur as Karan Mehra"]}, {"page": "List of Bollywood films of 2015", "response": ["|Coffee Bloom || Manu Warrier || Arjun Mathur, Sugandha Garg, Mohan Kapur || Romance, Drama ||", "| Waiting ||Anu Menon || Naseeruddin Shah, Kalki Koechlin, Arjun Mathur, Rajat Kapoor, Suhasini Maniratnam|| Drama||"]}, {"page": "Fireflies (film)", "response": ["Fireflies is a 2014 Bollywood drama film directed and produced by Sabal Singh Shekhawat. The film has an ensemble cast, which includes Rahul Khanna, Arjun Mathur, Shivani Ghai, Monica Dogra and Aadya Bedi.", "* Arjun Mathur as Rana Rathore"]}, {"page": "Coffee Bloom", "response": ["Coffee Bloom is a 2014 Indian romantic drama film directed by debutant director Manu Warrier. It stars Arjun Mathur and Sugandha Garg in lead roles. The film is produced by Speaking Tree Productions. It tells the story of a young man Dev, who sells his family coffee estate as a statement underlining his renunciation of the world.", "Dev Arjun Mathur, though a self-proclaimed wise man finds comfort in being a loser, having given up on life as a result of a love gone wrong. A life-changing event takes him on a journey to a coffee plantation. There he meets Anika Sugandha Garg, once the love of his life, now his boss. Love blooms in an idyllic setting, bringing Dev out of his self-imposed funk and Dev finds a new reason to live.  A terrible misunderstanding pushes him into taking drastic measures. Much is at stake as the yearly bloom is round the corner. And Dev is confronted with his past, present, and future – all at once. ", "*Arjun Mathur"]}, {"page": "Angry Indian Goddesses", "response": ["*Arjun Mathur as Zain, Madhurita's boyfriend"]}, {"page": "The Local Train", "response": ["The Local Train released Khudi in 2017, a single from their second album. Its music video starred Arjun Mathur, was directed by Vijesh Rajan and produced by Jungle Book Entertainment.  It won Platinum Film of The Year at the 2017 India Film Project Awards. The second album Vaaqif was released in January 2018, with mixing and mastering done by Erich Talaba. The band toured extensively in 21 cities before the album launch. In 2018, they released Mizaaj's music video, their first foray into animation that was conceptualised and animated by Ekabhuya Animation. The cyber-punk animated video for Gustaakh soon followed, produced by Plexus studios  and edited by Shreyas Beltangdy. It was selected for the 18th Miami International Science Fiction Film Festival, and chosen as one of Rolling Stone’s 11 best Indian music videos for 2019."]}, {"page": "Waiting (2015 film)", "response": ["Waiting is a 2015 Indian Hindi-language drama film directed by Anu Menon. Produced by Priti Gupta and Manish Mundra under the banner of Ishka Films and Drishyam Films respectively, the film was co-written by Menon and James Ruzicka, and stars Naseeruddin Shah and Kalki Koechlin. Waiting focuses on the relationship between two people from different walks of life who befriend each other in a hospital, while nursing their respective comatose spouses. Rajat Kapoor, Suhasini Maniratnam, Arjun Mathur, Ratnabali Bhattacharjee and Rajeev Ravindranathan play supporting roles in the film.", "Shiv Natraj (Naseeruddin Shah), an elderly psychology professor, arrives at a hospital in Kochi to visit his comatose wife Pankaja (Suhasini Maniratnam). Tara Kapoor Desphande (Kalki Koechlin), a young advertising agent, also arrives at the hospital during the night after being delivered news of a car accident involving her husband, Rajat Deshpande (Arjun Mathur). She is consoled by Rajat's eccentric co-worker Girish (Rajeev Ravindranathan), but dismisses him abruptly. Tara is deeply disturbed to see Rajat breathing on a ventilator, and leaves immediately.", "*Arjun Mathur as Rajat Deshpande", "South Indian actress and director Suhasini Maniratnam made her debut in Hindi cinema with Waiting; she was cast in the role of Pankaja, Shah's character's wife. Menon talked about her experience working with Suhasini saying, \"With her experience, she also helped me with a few difficult scenes behind the camera.\" Arjun Mathur played the role of Rajat Deshpande, Tara's husband, who is involved in a car accident; Rajat Kapoor played Nirupam Malhotra, a doctor at the Kochi Hospital. Ratnabali Bhatachajee, Rajeev Ravindranathan and Marin Babu played supporting roles in the film. The rest of the film's supporting cast consisted mainly of Malayali actors, including Dinesh Nair and Krishna Sankar, who were signed up with assistance from Gautam Pisharody, a local casting agent."]}, {"page": "Voot", "response": ["|Sanjay Kapoor, Shweta Tripathi, Arjun Mathur, Shriya Pilgaonkar, Dibyendu Bhattacharya", "|Sanjay Kapoor, Shweta Tripathi, Arjun Mathur, Shriya Pilgaonkar, Dibyendu Bhattacharya"]}, {"page": "Nitya Mehra", "response": ["In 2019, she showran, executive produced and directed a web series Made in Heaven aired on Amazon Prime Video, starring Arjun Mathur, Sobhita Dhulipala and Kalki Koechlin."]}]}}