{"wiki_id": "http://www.wikidata.org/entity/Q2865326", "itemLabel": "Arthur Rubbra", "itemDescription": "British aerospace engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Rubbra", "wikipedia_page": {"main": "Arthur Alexander Cecil Rubbra CBE (29 October 1903 – 24 November 1982) was an English engineer who designed many of Rolls-Royce's successful aero engines.", "link_mentions": [{"page": "Rolls-Royce RB211", "response": ["Hugh Conway (managing director RR Gas Turbines), persuaded Stanley Hooker to come out of retirement and return to Rolls Royce. As technical director he led a team of other retirees - including Cyril Lovesey and Arthur Rubbra - to fix the remaining problems on the RB211-22. The engine was finally certified on 14 April 1972, about a year later than originally planned, and the first TriStar entered service with Eastern Air Lines on 26 April 1972. Hooker was knighted for his role in 1974."]}, {"page": "Edmund Rubbra", "response": ["Edmund Rubbra (; 23 May 190114 February 1986) was a British composer. He composed both instrumental and vocal works for soloists, chamber groups and full choruses and orchestras. He was greatly esteemed by fellow musicians and was at the peak of his fame in the mid-20th century. The most famous of his pieces are his eleven symphonies.  Although he was active at a time when many people wrote twelve-tone music, he decided not to write in this idiom himself. Instead he devised his own distinctive style. His later works were not as popular with the concert-going public as his previous ones had been, although he never lost the respect of his colleagues. Therefore, his output as a whole is less celebrated today than would have been expected from its early popularity. He was the brother of the engineer Arthur Rubbra."]}, {"page": "Timeline of jet power", "response": ["* January 1: Rolls takes over the Rover plants, although the official date is several months later. Stanley Hooker leads a team including Fred Morley, Arthur Rubbra and Harry Pearson. Several Rover engineers decide to stay on as well, including Adrian Lombard, leader of Rover's \"offshoot\" design team. They focus on making the W.2B production quality as soon as possible."]}, {"page": "Rolls-Royce Griffon", "response": ["According to Arthur Rubbra's memoirs, a de-rated version of the \"R\" engine, known by the name Griffon at that time, was tested in 1933. This engine, R11,Eves 2001, p. 228. which was never flown, was used for \"Moderately Supercharged Buzzard development\" (which was not proceeded with until much later), and bore no direct relationship to the volume-produced Griffon of the 1940s."]}, {"page": "Rolls-Royce R", "response": ["The introduction of articulated connecting rods was regarded as a \"nuisance\" by Arthur Rubbra, a Rolls-Royce engine designer, as there were inherent problems with the arrangement. The complicated geometry meant that a pair of rods had different effective lengths, giving a longer stroke on the articulated side; consequently the cylinder liners on that side had to be lengthened to prevent the lower piston ring from running out of the cylinder skirt. Articulated rods were used in the Goshawk engine, but were not embodied in the later Rolls-Royce Merlin, for which Arthur Rowledge had designed a revised blade and fork system.Rubbra 1990, p. 60.", "According to Arthur Rubbra's memoirs, a de-rated version of the R engine, known by the name Griffon at that time, was tested in 1933. This engine, R11, was used for \"Moderately Supercharged Buzzard development\" (which was not proceeded with until much later), and bore no direct relationship to the volume-produced Griffon of the 1940s."]}, {"page": "Northampton School for Boys", "response": ["*Arthur Rubbra CBE, engineer who designed Rolls Royce aero engines, including the Merlin and Griffon"]}]}}