{"wiki_id": "http://www.wikidata.org/entity/Q2860158", "itemLabel": "Archie Norman", "itemDescription": "British politician (born 1954)", "wikipedia_url": "https://en.wikipedia.org/wiki/Archie_Norman", "wikipedia_page": {"main": "Archibald John Norman (born 1 May 1954) is a British businessman and politician. He is the only person to have been chairman of an FTSE 100 company and a Member of the House of Commons (MP) at the same time. From January 2010 to January 2016, Norman was the chairman of ITV plc. He succeeded Robert Swannell as chairman of Marks & Spencer in September 2017.", "link_mentions": [{"page": "Marks & Spencer", "response": ["* 2017–present: Archie Norman"]}, {"page": "John Redwood", "response": ["Redwood was subsequently appointed Shadow Secretary of State for Trade and Industry by the victorious William Hague. He was appointed Shadow Secretary of State for the Environment, Transport and the Regions in June 1999,The Hutchinson Almanac (Helicon Publishing, 2000), p. 63 but was dropped in a mini reshuffle in February 2000, being succeeded by Archie Norman."]}, {"page": "Archibald John Norman", "response": ["#REDIRECT Archie Norman"]}, {"page": "List of Old Carthusians", "response": ["*Archie Norman (born 1954), businessman, chairman of ITV plc and former Conservative MP for Tunbridge Wells", "*Archie Norman (1912–2016), British paediatrician"]}, {"page": "Norman (name)", "response": ["*Archie Norman (born 1954), British businessman and politician"]}, {"page": "Archie", "response": ["* Archie Norman (born 1954), British businessman and politician"]}, {"page": "List of British politicians who have acknowledged cannabis use", "response": ["| data-sort-value=\"Norman\" | Archie Norman"]}, {"page": "Death and funeral of Margaret Thatcher", "response": ["Whilst business leaders, including Alan Sugar, Richard Branson, Archie Norman and CBI chief John Cridland, credited her for creating a climate favourable to business in Britain, and lifting the UK \"out of the economic relegation zone\", the Premier League and the Football League rejected having a minute's silence around the country's football grounds, a move backed by the Football Supporters' Federation and the Hillsborough Family Support Group, the latter in reaction to her perceived lack of interest in uncovering abuse committed by the police during the 1989 disaster. However, Saracens and Exeter Chiefs held a minute's silence for her before their Premiership rugby union games."]}, {"page": "Greg Clark", "response": ["Clark was selected as the Conservative prospective parliamentary candidate for Tunbridge Wells in December 2004. Clark was elected at the 2005 general election for the parliamentary constituency of Tunbridge Wells, after Archie Norman stood down as the MP.", "Clark was appointed Secretary of State for Business, Energy and Industrial Strategy on 14 July 2016, in Theresa May's first cabinet. In October 2016, he appointed his predecessor as MP, Archie Norman, as Lead Non Executive Board Member for the Department for Business, Energy and Industrial Strategy."]}, {"page": "Archie Norman (businessman)", "response": ["#REDIRECT Archie Norman"]}, {"page": "Archibald Norman", "response": ["#REDIRECT Archie Norman"]}]}}