{"wiki_id": "http://www.wikidata.org/entity/Q28600232", "itemLabel": "Zak Jules", "itemDescription": "English association football player (born 1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/Zak_Jules", "wikipedia_page": {"main": "Zak Kennedy Jules (born 2 July 1997) is a Scottish professional footballer who plays as a defender for EFL League One club Fleetwood Town, on loan from EFL League One club Milton Keynes Dons. He was born in Islington, England, but has represented Scotland at all levels from U17 to U21.\nHe began his career at Reading, from where he was loaned out to Hemel Hempstead Town, Braintree Town and Motherwell. He signed with Shrewsbury Town in June 2017, and spent the 2017–18 season on loan at Chesterfield and Port Vale. He joined Barnet on loan in September 2018, before joining Macclesfield Town after leaving Shrewsbury by mutual consent in January 2019. He signed with Walsall in July 2019, where he stayed for 18 months before being sold on to Milton Keynes Dons.", "link_mentions": [{"page": "Russell Martin (footballer)", "response": ["Martin, alongside assistant Luke Williams, installed a possession-based style of play at the club which received widespread plaudits. On 2 March 2021, Martin's side scored after a 56-pass move, a new British record at the time. At the culmination of the 2020–21 season, only Manchester City and Barcelona had a higher average possession percentage in Europe than Martin's MK Dons. His team also had the most touches in the opposition box in League One. Defender Zak Jules commented on Martin's style of play, stating: \"The way we play, we almost demoralise teams. We keep the ball so much that when teams do get the chance to keep possession – they’ve got no legs and, within no time, we’ve got the ball back and they don’t see the ball again for a while.\""]}, {"page": "Neil Aspin", "response": ["In the January transfer window Aspin allowed two departures, plus Gavin Gunning left the club after rejecting a contract offer and centre-back Tom Anderson was recalled from his loan; incoming were non-league players Dior Angus, Luke Hannant and Callum Howe, as well as loanees Donovan Wilson, Zak Jules, Charlie Raglan and Kyle Howkins. Aspin remarked that the four centre-backs brought in did not cost the club much financially, and that he would have liked to have strengthened in other areas \"but for one reason or another it just hasn't happened\". However he managed to convert Cristian Montaño from a winger to a left-back and Antony Kay from a centre-half to a central midfielder, and guided the club to safety with two games to spare. Vale ended the campaign in 20th-place – the joint-lowest finish in the club's history – with just one point above the relegation zone, having been out of the relegation zone on goal difference upon Aspin's arrival at the club."]}, {"page": "List of Motherwell F.C. players", "response": ["|Zak Jules||||2017||9||1||On loan from Reading"]}, {"page": "Reading F.C. Under-23s and Academy", "response": ["* Zak Jules"]}, {"page": "2015–16 Reading F.C. season", "response": ["In early January, Bosnian U-17 international Seid Behram, who had been with the academy for a few months, signed permanently for the club from Željezničar, whilst Andrija Novakovich, Tariqe Fosu, Sean Long, Rob Dickie, Dominic Hyam, Lewis Collins, Bogdan Vaštšuk, Jake Sheppard, Noor Husin and Zak Jules all returned from their respective loan spells.", "On 9 May, it was confirmed that Reading would not be renewing the contracts of Anton Ferdinand, Hal Robson-Kanu, Simon Cox, Nana Owusu, Pierce Sweeney, Lewis Collins, Noor Husin, Hammad Lawal, Samúel Friðjónsson, Conor Shaughnessy and Bogdan Vaštšuk. It was also confirmed that Dominic Hyam, Robert Dickie, Shane Griffin, Sean Long, Aaron Kuhl, Liam Kelly, Zak Jules, George Legg had all been offered new contacts, alongside Under-18 players Omar Richards, Harrison Bennett, Ryan East, Sam Smith, Luke Southwood, Billy Collings and Joe Tupper.", "| Zak Jules"]}, {"page": "2016–17 Reading F.C. season", "response": ["Also on 9 May 2016, Reading offered new contracts to Dominic Hyam, Robert Dickie, Shane Griffin, Sean Long, Aaron Kuhl, Liam Kelly, Zak Jules and George Legg, as well as Under-18 players Omar Richards, Harrison Bennett, Ryan East, Sam Smith, Luke Southwood, Billy Collings and Joe Tupper.", "As well as the transfers of Gravenberch and van den Berg being completed on 1 July, Reading announced that youngsters Lewis Ward, Zak Jules, George Legg, Sean Long, Shane Griffin, Liam Kelly, Aaron Kuhl, Robert Dickie, Dominic Hyam, Ryan East, Harrison Bennett, Joe Tupper, Billy Collings, Omar Richards, Luke Southward and Thomas McIntyre had all signed deals to stay with the club.", "On 2 December, young Scottish defender Zak Jules joined Braintree Town on a month-long loan deal. Reading's winning run ended on 3 December with a 5–0 away loss to Fulham, during which Danny Williams received a red card; Reading however remained at third place. On 10 December Reading returned to winning form with a 2–1 home win against Sheffield Wednesday, although this was short-lived with a 2–0 away loss at Leeds United three days later.", "On 21 January, Scottish youth international forward, Harry Cardwell, joined Brighton & Hove Albion on loan for the rest of the season, with Jack Stacey extending his loan-deal with Exeter City until the end of the season on 23 January. The following day Niall Keown joined Scottish Premiership side Partick Thistle on loan for the remainder of the season, whilst Zak Jules also headed north of the border on 27 January, joining Motherwell on loan until the end of the season.", "On 12 May, Reading announced that they had offered new contracts to Jake Sheppard, Tarique Fosu, Zak Jules, Lewis Ward, Ryan East. Andy Rinomhota, Andrija Novakovich, Sam Smith and Luke Southwood, whilst George Legg and Axel Andrésson had already signed new deals. On the same day, Ethan Coleman, Tom Holmes, Danny Loader and Kosta Sparta signed their first professional deals with the club whilst Liam Driscoll, Ben House, Joel Rollinson and Ade Shokunbi were all also offered professional contracts.", "|2 December 2016||DF||||Zak Jules||Braintree Town||2 January 2017||", "|27 January 2017||DF||||Zak Jules||Motherwell||End of season||", "| Zak Jules", "| Zak Jules"]}, {"page": "Cammy Ballantyne", "response": ["Ballantyne was given his first call up for the Scotland under-17 squad in March 2014. He was added to the Scotland under-21 squad in March 2017, after Zak Jules withdrew."]}, {"page": "2016–17 Motherwell F.C. season", "response": ["On 26 January, Motherwell signed midfielder Elliott Frear from Forest Green Rovers, with Russell Griffiths joining the club on loan for the remainder of the season from Everton the following day. Also on the 27th, Luka Belić loan came to an end, Dean Brill was released by the club, Dylan Mackin joined Alloa Athletic on loan for the remainder of the season, and Zak Jules joined until the end of the season from Reading.", "| Zak Jules", "| Zak Jules", "||DF||||21||Zak Jules||1||0||0||1"]}, {"page": "Tennai Watson", "response": ["After Reading, Watson signed for the League One club Milton Keynes Dons on 28 July 2021 after a successful trial period, having been recommended to the club by his former Reading teammate, Zak Jules. He made his league debut for the club on 7 August 2021, in a 3–3 draw away to Bolton Wanderers. On 8 December 2021, Watson scored his first career professional goal in a 1–1 draw at home to Plymouth Argyle."]}, {"page": "2017–18 Port Vale F.C. season", "response": ["Vale opened the New Year with a 1–0 defeat at second-placed Notts County, and though Aspin was pleased with his players he was highly critical of the referee for his award of a late penalty, calling it \"a really bad decision\". Earlier in the day he made his second signing as manager, bringing in striker Dior Angus from non-league Redditch United. Meanwhile, Gavin Gunning left the club on the expiry of his contract, whilst Jack Stobbs, Rekeil Pyke and Tyler Denton returned to their parent clubs. In contrast, Whitfield's loan was extended until the end of the season. Gunning made his debut for Forest Green on 6 January, and kept a clean sheet as Rovers beat the Vale 1–0 with a goal from fellow débutante Reuben Reid; Aspin apologized to supporters after the match for the team's performance. Aspin went on to allow Lawrie Wilson to join National League side Ebbsfleet United after the full-back failed to make the first-team under his tenure. He also agreed to terminate the contract of French midfielder Anthony de Freitas, whilst bringing in striker Donovan Wilson on loan from Wolverhampton Wanderers. Vale put in a poor performance at home to Yeovil, though did claim a 1–1 draw after Pope converted a late penalty. Aspin went on to sign midfielder Luke Hannant from Gateshead for an undisclosed fee, having previously signed the 24-year old from Team Northumbria in 2016. He also boosted the defensive numbers by bringing in centre-back Zak Jules on loan from Shrewsbury Town. Hannant made his debut at Accrington Stanley on 20 January, a game in which Vale led 2–0 at half-time only to lose 3–2; Aspin went on to criticise both the referee for failing to spot a handball for Accrington's equaliser and also his team for poor defending. Jules made his debut and Lainton returned to the starting eleven for the visit of Colchester on 27 January, and Vale managed to secure a 2–2 draw despite a poor performance thanks to a brace from Worrall. A surprise departure was then announced, as Anderson was recalled early from his loan spell by Burnley. Aspin responded quickly by signing former youth-team centre-back Charlie Raglan on loan from Oxford United, 21-year old defender Kyle Howkins on loan from West Bromwich Albion and 23-year old defender Callum Howe for an undisclosed fee from Lincoln City.", "|align=\"left\"|DF||3||align=\"left\"| Zak Jules", "| 19 January 2018 || CB ||  || Zak Jules || Shrewsbury Town || 30 June 2018 || "]}, {"page": "2017–18 Chesterfield F.C. season", "response": ["| 31 August 2017 || CB ||  || Zak Jules || Shrewsbury Town || 26 September 2017 || "]}, {"page": "2017–18 Shrewsbury Town F.C. season", "response": ["| 1 July 2017 || CB ||  || Zak Jules || Reading || Undisclosed || 2 years || ", "| 31 August 2017 || CB ||  || Zak Jules || Chesterfield || January 2018 || ", "| 19 January 2018 || CB ||  || Zak Jules || Port Vale || End of season || "]}, {"page": "2017–18 Reading F.C. season", "response": ["On 26 June, Reading announced that two academy players would be leaving the club. Zak Jules had turned down a new contract with the club and had signed for Shrewsbury Town, while Jack Stacey had moved to Luton Town on a permanent deal. Additionally, two players left the club on loan on the same day. Deniss Rakels completed his move to Lech Poznań for the season and Jonathan Bond transferred to Peterborough United until 3 January 2018."]}, {"page": "2018–19 Macclesfield Town F.C. season", "response": ["| 28 January 2019 || CB ||  || Zak Jules || Shrewsbury Town || Free transfer || "]}, {"page": "2018–19 Shrewsbury Town F.C. season", "response": ["| 3 January 2019 || CB ||  || Zak Jules || Macclesfield Town || Mutual consent || ", "| 21 September 2018 || CB ||  || Zak Jules || Barnet || 2 January 2019 || "]}, {"page": "2019–20 Walsall F.C. season", "response": ["| 26 July 2019 || CB ||  || Zak Jules ||  Macclesfield Town || Undisclosed || "]}, {"page": "2019–20 Macclesfield Town F.C. season", "response": ["| 26 July 2019 || CB ||  || Zak Jules ||  Walsall || Undisclosed || "]}, {"page": "2020–21 Walsall F.C. season", "response": ["| 1 February 2021 || CB ||  || Zak Jules ||  Milton Keynes Dons || Undisclosed || "]}, {"page": "2020–21 Milton Keynes Dons F.C. season", "response": ["| 1 February 2021 || CB ||  Zak Jules || Walsall || Undisclosed ||"]}, {"page": "2021–22 Fleetwood Town F.C. season", "response": ["| 15 January 2022 ||  CB ||  || Zak Jules ||  Milton Keynes Dons || End of season || "]}, {"page": "2021–22 Milton Keynes Dons F.C. season", "response": ["| 15 January 2022 ||  CB ||  Zak Jules || Fleetwood Town || End of season || "]}]}}