{"wiki_id": "http://www.wikidata.org/entity/Q2878898", "itemLabel": "Steven Robb", "itemDescription": "British footballer (born 1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steven_Robb", "wikipedia_page": {"main": "Steven Robb (born 8 March 1982 in Perth, Scotland) is a Scottish retired footballer, who played as a left winger. He began his career with Dundee in 2001 before joining Dundee United and then St Mirren. After playing in Thailand for Thai Port, he returned to Scotland with Brechin City and then Montrose. He retired in 2015 at the age of 32, due to injury problems.", "link_mentions": [{"page": "2006–07 Dundee United F.C. season", "response": ["United signed Craig Conway, Noel Hunt and Steven Robb in pre-season, with Derek McInnes, Jim McIntyre and Grant Brebner departing on free transfers after being released by the club. United started pre-season with a 4–1 win at Raith Rovers before a week in Denmark with matches against Herfølge BK and FC Nordsjælland. Back in Scotland, United played Forfar at Station Park before the Evening Telegraph Challenge Cup resulted in a disappointing 1–0 defeat to rivals Dundee at Dens. The round of pre-season friendlies meant none were played at Tannadice."]}, {"page": "Johnny Russell (footballer)", "response": ["Russell, who had featured just five times for Dundee United's under-19 side in 2006–07, made his professional debut in the Scottish Premier League on 12 May 2007 in the 2–0 defeat at Falkirk, coming on as an 80th-minute substitute for Steven Robb."]}, {"page": "David Barron (footballer)", "response": ["Following an injury to Mo Camara before the start of the 2009–10 season in a friendly against Wigan Athletic, Barron secured a first team starting spot at left back. Naturally right footed, Barron's preferred position is to the right of defence however he settled in well at left back and secured his place in St Mirren's team. His versatility in being able to play as a defensive midfielder, left and right full back as well as centre back means he has become an important defender in St Mirren's squad. He returned to his natural right back position towards the end of the season as Steven Robb returned from injury. At the end of the 2009–10 season, Barron picked up four club awards, including Young Player of the Year."]}, {"page": "Dundee derby", "response": ["* Steven Robb"]}, {"page": "Robb", "response": ["* Steven Robb (born 1982), Scottish footballer"]}, {"page": "2008–09 St Mirren F.C. season", "response": ["|30 June 2008 ||  Steven Robb ||  Dundee United || Free Transfer || BBC"]}, {"page": "2010 Scottish League Cup Final", "response": ["|DF ||15 || Steven Robb"]}, {"page": "2010–11 Dundee F.C. season", "response": ["|MF||||Steven Robb"]}, {"page": "2012 Thai Premier League", "response": ["|  Steven Robb"]}, {"page": "List of foreign Thai League 1 players", "response": ["* Steven Robb – Thai Port – 2011–13"]}, {"page": "Robb, Steven", "response": ["#redirectSteven Robb"]}]}}