{"wiki_id": "http://www.wikidata.org/entity/Q288210", "itemLabel": "Isabella Bird", "itemDescription": "British explorer (1831-1904)", "wikipedia_url": "https://en.wikipedia.org/wiki/Isabella_Bird", "wikipedia_page": {"main": "Isabella Lucy Bird, married name Bishop  (15 October 1831 – 7 October 1904), was a nineteenth-century British explorer, writer, photographer, and naturalist. With Fanny Jane Butler she founded the John Bishop Memorial hospital in Srinagar. She was the first woman to be elected Fellow of the Royal Geographical Society.", "link_mentions": [{"page": "Ainu people", "response": ["*Isabella Bird (Mrs Bishop), Korea and her Neighbours (1898)"]}, {"page": "October 7", "response": ["*1904 – Isabella Bird, English historian and explorer (b. 1831)"]}, {"page": "List of explorers", "response": ["| Isabella Bird"]}, {"page": "Estes Park, Colorado", "response": ["In 1873, Englishwoman Isabella Bird, the daughter of an Anglican minister, came to the United States. Landing at San Francisco, she came overland to Colorado, where she borrowed a horse and set out to explore the Rocky Mountains with a guide, the notorious James Nugent, aka 'Rocky Mountain Jim'. She wrote A Lady's Life in the Rocky Mountains, a memoir of their travels, including the breathtaking ascent of Longs Peak, where she was literally hauled up the steep pitches \"like a bale of goods.\"Isabella Bird, A Lady's Life in the Rocky Mountains (Sausalito, Calif.: Comstock, 1980), Letter 7, p. 87."]}, {"page": "Dean Cemetery", "response": ["* Isabella Bird married name Bishop (1831–1904), celebrated traveller, writer and photographer. First female Fellow of the Royal Geographical Society"]}, {"page": "List of climbers and mountaineers", "response": ["* Isabella Bird (1831–1904) UK, traveller, writer and natural historian"]}, {"page": "Hakodate", "response": ["In 1878, Isabella Bird reported of the city in her travelogue: "]}, {"page": "Tourism in Hawaii", "response": ["Prominent 19th-century travelers to Hawaii included journalist Isabella Bird, along with a number of American and British authors. Tourist visits remained around 2,000 per year from 1872 to 1898. American writers include Mark Twain aboard the Ajax as a travel journalist with the Sacramento Daily Union in 1866, and Herman Melville, who deserted from his whaler in 1843 and later found passage back to the mainland that summer aboard . Twain's unfinished novel of Hawaii was incorporated into his A Connecticut Yankee in King Arthur's Court, with King Arthur bearing striking similarities to Kamehameha V, the first reigning monarch Twain was to meet. The \"modernizing\" potential offered by the Connecticut Yankee from the future is a satire of the potentially negative Protestant Missionary influence on Hawaiian life. Melville's writing of the Pacific includes Typee and Omoo (considered factual travel accounts when published) and his Pacific experiences would develop into the portrayal of Queequeg in Moby-Dick."]}, {"page": "Nan'yō, Yamagata", "response": ["The city of Nan'yo was established on April 1, 1967 by the merger of the former towns of Miyauchi and Akayu with the village of Wagō. Akayu is famous for its hot springs, cherries and hang gliding and includes the former village of Nakagawa. Miyauchi is famous for its chrysanthemum festival and the Kumano-taisha Shrine, and includes the former villages of Urushiyama, Yoshino, and Kaneyama. The village of Wago was created in 1955 by the merger of the villages of Okigō and Ringō.  The English travel-writer Isabella Bird visited Akayu in 1878 and wrote about the town in Unbeaten Tracks in Japan.Isabella Lucy Bird, Unbeaten tracks in Japan: An account of travels in the interior including visits to the aborigines of Yezo and the shrine of Nikko (1888) online.Andrew Elliott,  \"'A perspective close to our own': footsteps travel and the Japanese reception of Isabella Bird’s Unbeaten Tracks in Japan, 1996–2016.\" Studies in Travel Writing (2017) 21#1: 1-16. The city is named after Nanyang, China, where according to legend a  chrysanthemum spring can make drinkers immortal."]}, {"page": "1904 in science", "response": ["* October 7 – Isabella Bird (born 1831), British explorer, writer, photographer and naturalist."]}, {"page": "Tobermory, Mull", "response": ["Isabella Bird, the Victorian traveller and writer, frequently stayed in the town, where her sister Henrietta had a house. She often assisted the local doctor and, on at least one occasion, served as anaesthetist when he removed a tumour from a local woman. When Henrietta died, she funded the building of the clock tower as a memorial to her sister."]}, {"page": "Empress Myeongseong", "response": ["Isabella Bird Bishop, a British woman who was a member of the Royal Geographical Society, had described the Empress' appearance to be that of \"...a very nice-looking slender woman, with glossy raven-black hair and a very pale skin, the pallor enhanced by the use of pearl powder\" while meeting with her when Bishop traveled to Korea. Bishop had also mentioned Empress Myeongseong in her book, Korea and Her Neighbours, in detail:", "Bishop described Jayeong as \"clever and educated\", and Gojong to be \"kind\" during the time she visited the palace.Isabella Bird Bishop talked about serving dinner with a Western-style dining table. It was said that he was so meticulous enough to let the Sanggung attend the service. When visiting Gyeonghoeru, the court ladies and the guards followed, and he wrote that he was impressed by saying that England and Joseon were neighbors.“The Queen spoke of Queen Victoria, and said, “She has everything she can wish—greatness, wealth, and power. Her sons and grandsons are kings and emperors, and her daughters empresses. Does she ever in her glory think of poor Korea? She does so much good in the world, her life is good. We wish her long life and prosperity”; to which the king added, “England is our best friend”. It was really touching to hear the occupants of that ancient but shaky throne peaking in this fashion.” “The king and queen rose when I took my leave, and the Queen shook hands. They both spoke most kindly, and expressed the wish that I should return and see more of Korea.” Pg. 48-49"]}, {"page": "1831 in science", "response": ["* October 15 – Isabella Bird (died 1904), English explorer, writer, photographer and naturalist."]}, {"page": "1892 in science", "response": ["* November – Traveller Isabella Bird becomes the first woman inducted as a Fellow of the Royal Geographical Society in Britain."]}, {"page": "Barra Head", "response": ["The travel writer Isabella Bird arrived in 1863 aboard the Shamrock receiving an \"outrageous welcome\"Buxton (1995) pp. 143-44. from the islanders, despite the fact that amongst the Gaelic-speaking locals only a few had \"some very lame sentences in English\". She wrote approvingly that her hosts were \"well-dressed, cleanly and healthy looking\" and of the \"delicious cream, in large clean, wooden bowls.\" Duncan Sinclair, the only Protestant on the island purchased a Bible and there was much bartering and bargaining with the islanders paying for their purchases in dried fish. Bird concluded that the island was:"]}, {"page": "Lyman House Memorial Museum", "response": ["Reverend David Belden Lyman and his wife, Sarah Joiner Lyman, arrived in 1832, missionaries from the American Board of Commissioners for Foreign Missions. It was one of the first houses on the island to be built in the style of their native New England, using native koa and ohia woods. Guests included Mark Twain and Isabella Bird. In 1854 - 1859 the new Haili Church was built across the street, replacing the thatched structures that served previously for the congregation."]}, {"page": "Kaneyama, Yamagata", "response": ["===Isabella Bird Memorial===", "British explorer Isabella Bird mentioned Kaneyama favourably in her account of her 1878 travels in Japan, Unbeaten Tracks in Japan:", "A monument commemorating Isabella Bird can be seen in the town centre.http://www.town.kaneyama.yamagata.jp/kanko/best-view/entry-476.html"]}, {"page": "Kawanishi, Yamagata", "response": ["The nineteenth-century English traveler, Isabella Bird, stayed in the town, and noted the Yonezawa Basin area \"as a 'Garden of Eden,' ground that smiles fruitfully, and Arcadia in Asia.\"http://www.tohokukanko.jp/english/feature/nature.html"]}, {"page": "Much Wenlock", "response": ["In the 19th century the town and much of the surrounding land came into the possession of James Milnes Gaskell, from his wife's family the Williams-Wynns. James was MP for Wenlock for many years. His son Charles Milnes Gaskell restored the Priory lodging as a home with his wife Lady Catherine, daughter of the Earl of Portsmouth. There they entertained many famous people of the day, writers, politicians, artists and explorers, among them Thomas Hardy, Henry Adams, Henry James, Thomas Woolner, Henry Morton Stanley, Isabella Bird and Phillip Webb.Gamble, Cynthia, 2015   Wenlock Abbey 1857–1919: A Shropshire Country House and the Milnes Gaskell Family, Ellingham Press."]}, {"page": "Mary Kingsley", "response": ["After a preliminary visit to the Canary Islands, Kingsley decided to travel to the west coast of Africa. Generally, the only non-African women who embarked on (often dangerous) journeys to Africa were the wives of missionaries, government officials, or explorers. Exploration and adventure had not been seen as fitting roles for English women, though this was changing under the influence of figures such as Isabella Bird and Marianne North. African women were surprised that a woman of Kingsley's age was travelling without a man, as she was frequently asked why her husband was not accompanying her."]}, {"page": "History of Hong Kong (1800s–1930s)", "response": ["A British traveller, Isabella Bird, described Hong Kong in the 1870s as a colony filled with comforts and entertainment only a Victorian society would be able to enjoy. Other descriptions mentioned courts, hotels, post offices, shops, city hall complexes, museums, libraries and structures in impressive manner for the era. Many European businessmen went to Hong Kong to do business. They were referred to as tai-pans or \"bigshot\". One of the more notable Tai-pan hangout spots was the Hong Kong Club at Queen's Road."]}, {"page": "Top Girls", "response": ["The play is famous for its dreamlike opening sequence in which Marlene meets famous women from history, including Pope Joan, who, disguised as a man, is said to have been pope between 854 and 856; the explorer Isabella Bird; Dull Gret the harrower of Hell; Lady Nijo, the Japanese mistress of an emperor and later a Buddhist nun; and Patient Griselda, the patient wife from The Clerk's Tale in Geoffrey Chaucer's Canterbury Tales. All of these characters behave like a gang of city career women out on the town and get increasingly drunk and maudlin, as it is revealed that each has suffered in similar ways.", "===Isabella Bird===", "Isabella Bird is the first dinner guest to arrive at Marlene's celebration. In real life, as discussed in the first act, Bird was a world traveler. The play does not mention that she wrote several books, including An English Woman In America, A Lady's Life in the Rocky Mountains, and Among the Tibetans. Her adventures took her around the world. At dinner, Bird tells everyone that she was first instructed to travel by a doctor who thought it would improve her poor health. Following this advice, she took her first trip, a sea voyage to America at age 23. For a long time, she lived with her mother and her younger sister, Henrietta Bird, whom she talks about with great affection during the dinner party. She also mentions Jim Nugent, a one-eyed mountain man who was her guide in the Rocky Mountains. In life, Nugent was in love with Bird but she ignored his advances. She once wrote in a letter to her sister \"He is a man any woman might love, but no sane woman would marry.\" Nugent would later be found murdered."]}, {"page": "Japan–United Kingdom relations", "response": ["*Isabella Bird - Victorian Traveller and Author"]}, {"page": "Women in the Victorian era", "response": ["The advent of colonialism and world travel presented new obstacles for women. Travel on horseback (or on donkeys, or even camels) was often impossible to do sidesaddle because the animal had not been \"broken\" (trained) for sidesaddle riding. Riding costumes for women were introduced that used breeches or zouave trousers beneath long coats in some countries, while jodhpurs breeches used by men in India were adopted by women. These concessions were made so that women could ride astride a horse when necessary, but they were still exceptions to the rule of riding sidesaddle until after World War I. Travel writer Isabella Bird (1831–1904) was instrumental in challenging this taboo. At age 42, she travelled abroad on a doctor's recommendation. In Hawaii, she determined that seeing the islands riding sidesaddle was impractical, and switched to riding astride. She was an ambitious traveller, going to the American West, the Rocky Mountains, Japan, China, Baghdad, Tehran, and the Black Sea. Her written accounts sold briskly."]}, {"page": "Constance Gordon-Cumming", "response": ["Constance Frederica “Eka” Gordon-Cumming (26 May 1837 – 4 September 1924) was a noted Scottish travel writer and painter. Born in a wealthy family, she travelled around the world and painted described scenes and life as she saw them. She was a friend and influencer of the travel writers and artists  Marianne North and Isabella Bird."]}, {"page": "Isabella Lucy Bird", "response": ["#REDIRECT Isabella Bird"]}, {"page": "Lomilomi massage", "response": ["After American missionaries arrived in 1820 and converted many in the Kingdom of Hawaii to Christianity, various laws prohibited \"heathen\" worship and any related Native Hawaiian healing practices.  Lomilomi as part of medical practice went underground.  But lomilomi as restorative massage remained popular not only among the Hawaiians, but among foreign residents and visitors as well. Charles Wilkes describes it being offered after his ascent of Mokuaweoweo in 1841 on the United States Exploring Expedition. For Robert Louis Stevenson it was \"disagreeable\", but English adventurer Isabella Bird found it delightful. Not only did non-Hawaiians receive lomilomi, they also gave it. According to William Brigham the first Director of the Bishop Museum, writing in 1908, one of the most skilled practitioners was Sanford Dole, one of the leaders of the overthrow of the Kingdom."]}]}}