{"wiki_id": "http://www.wikidata.org/entity/Q28870780", "itemLabel": "Hannah Black", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Hannah_Black", "wikipedia_page": {"main": "Hannah Black is a visual artist, critic, and writer. Her work spans video, text and performance and draws on communism, feminist, and Afro-pessimist theory, autobiographical fragments and pop music. She is best known for her open letter written with Ciarán Finlayson and Tobi Haslett, The Tear Gas Biennial, criticizing co-chair of the board of the Whitney Museum, Warren Kanders, and his toxic philanthropy which comes from selling tear gas and other weapons via Safariland. The letter prompted artists to withdraw works from the 2019 Whitney Biennial.  \n\n", "link_mentions": [{"page": "Whitney Museum", "response": ["On July 17, 2019, calls for Kanders's resignation were renewed following Artforum's publication of an essay, \"The Tear Gas Biennial\", by Hannah Black, Ciarán Finlayson, and Tobi Haslett. On July 19, four artists (Korakrit Arunanondchai, Meriem Bennani, Nicole Eisenman, and Nicholas Galanin) published a letter, also in Artforum, asking their work to be withdrawn from the exhibition. (The first artist to withdraw was Michael Rakowitz, who withdrew his work before the Biennial opened.) A day later, a second wave of artists (Eddie Arroyo, Christine Sun Kim, Agustina Woodgate, and Forensic Architecture) also withdrew."]}, {"page": "Whitney Biennial", "response": ["The 2019 Whitney Biennial was boycotted by a group of artists, in protest of the museum’s vice chairman, Warren Kanders. Warrren Kanders' companies sell military supplies (teargas and bullets) via Safariland. These bullets were used by Israeli forces and snipers during the 2018–2019 Gaza border protests. The United Nations released a report that claimed Israeli security forces may have committed war crimes and should be held individually and collectively accountable for the deaths of 189 Palestinian protesters in Gaza. As such, the 2019 Whitney Biennial was labelled as the \"THE TEAR GAS BIENNIAL\" by Hannah Black, Ciarán Finlayson, and Tobi Haslett in an open letter on ArtForum.https://www.artforum.com/slant/hannah-black-ciaran-finlayson-and-tobi-haslett-on-the-2019-whitney-biennial-80328 The artists who withdrew from include: Korakrit Arunanondchai, Meriem Bennani, Nicole Eisenman, Nicholas Galanin, Eddie Arroyo, Christine Sun Kim, Agustina Woodgate, and Forensic Architecture. The Forensic Architecture biennial submission, “Triple-Chaser” (2019), collected evidence, ammunition rounds, and eyewitness testimony that links Warrren Kanders to the killings and maiming of Palestinians. It is a collaboration with documentary filmmaker Laura Poitras.https://hyperallergic.com/500887/forensic-architecture-says-warren-kanders-is-one-part-of-a-web-of-possible-war-crimes-in-gaza/"]}, {"page": "Artforum", "response": ["In 2019, Hannah Black, Ciarán Finlayson, and Tobi Haslett released an essay in Artforum titled The Tear Gas Biennial, decrying the involvement of Warren Kanders, co-chair of the board of the Whitney Museum, and his \"toxic philanthropy.\" Although Kanders has donated an estimated $10 million to the museum, the source of his fortune comes from Safariland LLC, a company that manufactures riot gear, tear gas, and other chemical weapons used by the police and the military to enforce violent order. As of 1925, the Geneva Convention has outlawed the use of tear gas in all international military conflict, however, the tear gas fired at peaceful protesters and civilians by the police and military during the George Floyd protests as well as migrants on the US-Mexico border is the same brand of tear gas manufactured by Defense Technology, a subsidy of Safariland. A wave of artists from the Biennial, including Korakrit Arunanondchai, Meriem Bennani, Nicole Eisenman and Nicholas Galanin, demanded immediate  removal of their work from the Biennial within hours after the essay was published. After mounting pressure from additional artists, critics, and gallerists urging the public to boycott the show, Kanders stepped down from his leadership position at the museum. The essay was instrumental in Kanders resignation as well as the museum cutting ties with Kanders financial endowments that are directly connected to the promotion and use of military weaponry and violence during peaceful social unrest.", "*Hannah Black"]}, {"page": "Dana Schutz", "response": ["Some objected to the painting's inclusion in the 2017 Whitney Biennial,Boucher, Brian (March 24, 2017). \"Social Media Erupts as the Art World Splits in Two Over Dana Schutz Controversy\". Artnet News. news.artnet.com. Retrieved 2 April 2017, there were debates online, and protesters physically blocked the work from view. Artist and Whitney ISP graduate Hannah Black posted an open letter on Facebook, writing that \"it is not acceptable for a white person to transmute Black suffering into profit and fun, though the practice has been normalized for a long time. Although Schutz's intention may be to present white shame, this shame is not correctly represented as a painting of a dead Black boy by a white artist ... The painting must go.\"Quoted in Muñoz-Alonso (March 21, 2017)."]}, {"page": "Berlin Biennale", "response": ["Other critics lauded the Biennale; in the September 2016 Issue of Artforum, British artist Hannah Black wrote that “…They [DIS] have been greeted, just like the modernist avant-gardes were in their time, with accusations of bad politics and even worse taste. Perhaps these critics haven’t noticed: The world is a ruin, but we go on living in it…”"]}, {"page": "Chisenhale Gallery", "response": ["Artists who have exhibited at Chisenhale Gallery include Rachel Whiteread,Rachel Whiteread interview with Michael Archer ; Tate transcript; published in Audio Arts Volume 12, Number 1, 1992; retrieved 3 January 2014 Cornelia Parker,Cornelia Parker's practice debated by Simon Morrissey; First published in a-n Magazine June 2002; retrieved 3 January 2014 Gillian Wearing, Sam Taylor Wood, Wolfgang Tillmans,Wolfgang Tillmans biography; Tate collection text by Elizabeth Manchester; published January 2003; retrieved 3 January 2014 Paul Noble, Yoko Terauchi, Pipilotti Rist,Interview with Pipilotti Rist by Art Monthly editor Patricia Bickers ; published 6 June 2009; retrieved 3 January 2014 and Thomas Hirschhorn. In the past decade under the directorship of Polly Staple the gallery has produced solo commissions with a new generation of artists including Florian Hecker, Duncan Campbell, Melanie Gilligan, Hito Steyerl, Janice Kerbel, Josephine Pryde,About Josephine Pryde's exhibition at Chisenhale Gallery; published 2011; retrieved 3 January 2014 James Richards, Linder, Lynette Yiadom-Boakye,Lynette Yiadom-Boakye's Chisenhale Gallery exhibition review ; published 8 May 2012; retrieved 3 January 2014 Amalia Pica,The Guardian: Artist of the week 196: Amalia Pica; published 28 June 2012;  retrieved 3 January 2014 Helen Marten,The Guardian review of Helen Marten's exhibition at Chisenhale Gallery, by Adrian Searle; published 2012; retrieved 3 January 2014 Ed Atkins,Review of Ed Atkins' exhibition at Chisenhale Gallery; published 11 November 2012; retrieved 3 January 2014  Jordan Wolfson, Camille Henrot, Céline Condorelli, Ed Fornieles, Ahmet Ögüt,  Park McArthur, Maria Eichhorn,  Luke Willis Thompson, Hannah Black,  Banu Cennetoğlu, and Lawrence Abu Hamdan,"]}, {"page": "United States at the 2015 Pan American Games", "response": ["|align=left|Hannah Black"]}, {"page": "Juliana Huxtable", "response": ["Huxtable's second book, Life, was co-written with artist Hannah Black. The novel is a work of science-fiction and is written in both English and German. It was released in 2017 by König.", "* Life: a novel, co-written with Hannah Black (König, 2017). OCLC 988257749"]}, {"page": "Shooting at the 2015 Pan American Games – Women's 50 metre rifle three positions", "response": ["| 7 || align=left|Hannah Black || align=left|  || 189  || 196  || 186 || 571-18x || Q", "| 5 || align=left|Hannah Black || align=left| || 149.650.250.3 49.1||  \t299.6 51.850.248.0 ||396.849.647.6   || 406.6 9.8 || 415.7 9.1 ||  ||  ||  ||  415.7||"]}, {"page": "Open Casket", "response": ["Soon after the opening of the 2017 Whitney Biennial, African-American artist Parker Bright began to silently protest Open Casket by standing in front of the painting wearing a T-shirt with \"Black Death Spectacle\" on the back. Artist and writer Hannah Black posted an open letter to the museum's curators and staff to Facebook calling for the painting's removal and recommending its destruction:", "\"The subject matter is not Schutz's,\" Hannah Black wrote, in an open letter about the painting. \"White free speech and white creative freedom have been founded on the constraint of others, and are not natural rights. The painting must go.\" She added that \"contemporary art is a fundamentally white supremacist institution despite all our nice friends.\""]}, {"page": "List of black British writers", "response": ["* Hannah Black (living)"]}, {"page": "Carolyn Lazard", "response": ["In March 2017, Lazard co-signed an open letter written by Hannah Black demanding the Whitney Biennial remove the Open Casket painting by Dana Schutz. In 2021, the Pew Center for Arts asked Lazard to cite a queer work that shaped their practice, Lazard named Artist Panteha Abareshi's video work, For Medical Use Only (2019). "]}, {"page": "Jason Hirata", "response": ["Hirata was included in an exhibition at Artists' Space in 2020 where his work was unfavorably reviewed as a \"slacker gesture\". He had a solo show at 80WSE gallery in New York City in 2020 that consisted of work by Hannah Black, Adjua Greaves, Trajal Harrell, New Red Order & Jim Fletcherm Carissa Rodriguez and Hito Steyerl that Hirata had worked on and documentation of those artworks. Hirata considers the conveyance of the experience of being in the exhibition the work itself. Hirata has also shown at Svetlana, New York (2019); Veronica Project Space, Seattle (2019); Kunstverein Nuremberg (2019); Henry Art Gallery, Seattle (2016); and Muscle Beach, Portland (2016). He has also shown at Calicoon Fine Arts.", "Hirata frequently works collaboratively with other artists. These artists include Levi Easterbrooks, Carissa Rodriguez, Hannah Black, Hito Steyerl, New Red Order."]}, {"page": "Precious Okoyomon", "response": ["Taking its title from a Youraba word meaning \"spoiled rich kid,\" Okoyomon's first book of poetry, published by Bottlecap Press in 2016, explores the complexities of their identity as a black queer immigrant inhabiting a specific class position. The book which often makes use of internet shorthand and text abbreviation, frequently steals from the work of other poets, and ends with a poem composed of screenshots of a text conversation engages the challenges of writing and reading poetry in the digital age. The book which has been interpreted as a response to Alt Lit, cites Dana Ward, Hannah Black, Juliana Huxtable, Bhanu Kapil, Simone White, and Fred Moten among its many influences.", "For Okoyomon's first art exhibition, they collaborated with Hannah Black at the New York Gallery Real Fine Arts on a sequel to Black's 2017  show \"Some Context\" commissioned by the Chisenhale Gallery in London, where Black filled the exhibition space with 20,000 copies of a book they produced entitled \"The Situation\" composed of interviews Black conducted with friends about a situation but where each explicit mention of what the situation is was redacted. In \"I Need Help,\" as in \"Some Context,\" many of the copies of the book were shredded. For Okoyomon's contribution to the show, they made a series of dolls consisting of raw wool bound by yarn. In a press release written by Okoyomon and Black, they propose that the exhibition \"gestures towards a politics or aesthetics based on the underlying and frankly disgusting processes of rot and collapse that have produced the dirt from which everything grows. ", "Curated by Susanne Pfeffer, at the MMK in Frankfurt, Earthseed is Okoyomon's first institutional solo exhibition in Germany and their largest show to date. The exhibition's title is the name of a fictional religion in Octavia E. Butler’s books Parable of the Sower and Parable of the Talents, that proposes \"the Earth’s seed can be transplanted anywhere and, through adaptation, will survive.\" Like the imagined religion, Okoyomon's exhibition envisions a \"theology of mutation, flux, and motion.\"In a piece called \"resistance is an atmospheric condition,\" Okoyomon filled the gallery space with the Japanese vine Kudzu. Responding to the gallery building's history as a passport office, Okoyomon used the invasive plant as an artwork to comment on ideas about immigration, invasion, race, and what is allowed to be considered natural. The show's press release recounts how Kudzu was first imported to the American South in 1876 with the intention that when planted its roots would strengthen the ecosystem's soil which as result of the excessive over cultivation of cotton by chattel slaves during the period was threatened by wide spread erosion. While the vine in some respects served its intended purpose and remains even today a foundational and necessary bulwark against the dissolution of the region's soil, the speed at which the vine was able to grow, when removed from its original planting and its natural predators, allowed it to consume massive tracts of land earning it the name \"the vine that ate the south.\" Soon, growing or planting of Kudzu was made a criminal offense in many states. Okoyomon suggests that despite the fact that vine's \"specific history as a failed remedy for the monumental toll slavery took on the ecological system of the American South has been largely forgotten,\" Kudzu might serve as a metaphor for Blackness itself, which like the plant, became monstrous when removed from its home in Africa and was taken to the states, where it functioned simultaneously as \"indispensable to and irreconcilable with Western civilization.\" The show also includes six large scale sculptures, made out of raw wool, modeled after the dolls Okoyomon first exhibited in their first collaborative exhibition \"I NEED HELP\" with Hannah Black. Hannah Black wrote an essay for the exhibition's accompanying booklet."]}, {"page": "BOFFO", "response": ["*Hannah Black"]}, {"page": "Tobi Haslett", "response": ["In 2019, Hannah Black, Ciarán Finlayson, and Haslett released a statement in Artforum titled The Tear Gas Biennial, decrying the involvement of Warren Kanders, co-chair of the board of the Whitney Museum, and his \"toxic philanthropy.\" Although Kanders has donated an estimated $10 million to the museum, the source of his fortune is derived from Safariland LLC, a company that manufactures riot gear, tear gas, and other chemical weapons used by the police and the military to enforce violent order. As of 1925, the Geneva Convention has outlawed the use of tear gas in all international military conflict, however, the tear gas fired at peaceful protesters and civilians by the police and military during the George Floyd protests as well as migrants on the US-Mexico border is the same brand of tear gas manufactured by Defense Technology, a subsidy of Safariland. A wave of artists from the Biennial, including Korakrit Arunanondchai, Meriem Bennani, Nicole Eisenman and Nicholas Galanin, demanded immediate removal of their work from the Biennial within hours after the essay was published. After mounting pressure from additional artists, critics, and patrons urging the public to boycott the show, Kanders stepped down from his leadership position at the museum. The essay was instrumental in Kanders resignation as well as the museum cutting ties with Kanders financial endowments that are directly connected to the promotion and use of military weaponry and violence during peaceful social unrest."]}]}}