{"wiki_id": "http://www.wikidata.org/entity/Q28824727", "itemLabel": "Chris Neal", "itemDescription": "English footballer (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Neal_(footballer,_born_1947)", "wikipedia_page": {"main": "Christopher Neal (born 27 June 1947) is an English former footballer who played as a winger in the Football League for Darlington.\nNeal was born in Kirkby-in-Ashfield, Nottinghamshire. He joined Darlington as an amateur from Crook Town in June 1967, and made five first-team appearances for the club, all in the Fourth Division. He made his debut on 4 March 1968, in a 2–0 home win against Swansea Town, and started four of the next six league fixtures. He then returned to non-league football.", "link_mentions": [{"page": "Chris Neal", "response": ["Neal signed a two-year contract with League One club Fleetwood Town in May 2016, and joined the club shortly after the departure of Chris Maxwell. He was named in the EFL team of the week after keeping a second successive clean sheet in a 2–0 win over Coventry City on 3 September. However he lost his first team place to Alex Cairns in November; manager Uwe Rösler admitted that the situation was a \"little bit harsh on Chris Neal because Chris Neal did nothing wrong\" and it was Cairns's strong form that made him undroppable. On 6 January 2018, he kept a clean sheet in a 0–0 draw with Leicester City in the Third Round of the FA Cup, and was rewarded with a year's supply of pizza from sponsors Papa John's Pizza. He was released by manager John Sheridan upon the expiry of his contract at Highbury Stadium at the end of the 2017–18 season."]}, {"page": "Chris Neal (disambiguation)", "response": ["*Chris Neal (footballer, born 1947), English winger who played for Darlington", "*Chris Neal (born 1985), English footballer who plays for Salford City", "*Chris Neal (songwriter) (born 1946), Australian musician", "*Chris Neal, pseudonym of Daniel Knauf, American television and comic book writer"]}]}}