{"wiki_id": "http://www.wikidata.org/entity/Q28813081", "itemLabel": "Dorothy Lamb", "itemDescription": "British archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Dorothy_Lamb", "wikipedia_page": {"main": "Lady Dorothy Brooke Nicholson,  (1887–1967), better known by her maiden name Dorothy Lamb, was a British archaeologist and writer known for her catalogue of terracotta in the Acropolis Museum, Athens and her work in Mediterranean field archaeology.\n\n", "link_mentions": [{"page": "List of archaeologists", "response": ["*Dorothy Lamb (1887–1967) British; classical archaeology"]}, {"page": "Wycombe Abbey", "response": ["*Dorothy Lamb, archaeologist"]}, {"page": "Manchester High School for Girls", "response": ["* Dorothy Lamb, archaeologist"]}, {"page": "Winifred Lamb", "response": ["Lamb's archaeological work on Lesbos had focused on links between Thermi and Troy; after this, she turned her attention to ancient Anatolia (modern Turkey), following in the footsteps of other women archaeologists, including Gertrude Bell, Margaret Hardie, and Dorothy Lamb (no relation), who had excavated there before the war. Lamb selected the site of Kusura, conducting a trial excavation in 1935 with Elinor W. Gardner and full excavations in 1936 and 1937 with James Rivers Barrington Stewart, Eleanor Mary Barrington Stewart, Rachel Maxwell-Hyslop, R.H. Macartney, and Nine Six; as well as excavating the cemetery, finds included a cult site and pottery relating to Troy VI. Lamb presented her findings in a lecture to the Society of Antiquaries in London on 'Recent developments in the prehistory of Anatolia' in 1937, pointing out Kusura's location on a major Bronze Age route between central Anatolia and the Aegean. A second lecture to the Society of Antiquaries in 1938 similarly emphasized Kusura's relationships with both of these areas. Lamb also published the Anatolian material held by the Fitzwilliam Museum. She felt that more excavation was required in Anatolia, but her work was interrupted by the outbreak of World War II."]}, {"page": "Hilda Lorimer", "response": ["She was a skilled Latin linguist, but at Oxford her interests turned toward archaeology. She took a sabbatical to attend the British School at Athens in 1901 and 1902. There she began focusing on Homeric archaeology, the study of ancient civilisations known through the poems of Homer.Helen Waterhouse, Breaking Ground: Women in Old World Archaeology, Brown University. In 1911, she participated in excavations at Phylakopi on Melos. Dorothy Lamb, Lillian Tenant and  Lorimer were the first women to participate in an excavation conducted by the British School at Athens. The excavation, led by Richard MacGillivray Dawkins, the director of the British School, was conducted from March to May 1911. The project was a supplementary excavation of a site that had been explored from 1896 to 1899."]}]}}