{"wiki_id": "http://www.wikidata.org/entity/Q28860100", "itemLabel": "Percy Northcote", "itemDescription": "British cricketer (1866-1934)", "wikipedia_url": "https://en.wikipedia.org/wiki/Percy_Northcote", "wikipedia_page": {"main": "Dr Percy Northcote (18 September 1866 – 3 March 1934) was an English doctor and amateur cricketer who played in seven first-class cricket matches between 1888 and 1903 for Middlesex and Kent County Cricket Clubs and for MCC.Northcote was born in Islington in London, the son of Gilbert and Elizabeth Northcote (née Edwards). His father was a wholesale warehouseman and Northcote was educated at Cranbrook School in Kent. He studied medicine at St Thomas' Hospital in London and made his first-class debut for Middlesex in 1888 whilst a student. He played twice for the county that season as well as for the Gentlemen of Kent in a non-first-class match. The following season, after an innings of 201 not out for the hospital side, he was selected to play for the Kent county side against MCC at Lord's.He was a \"highly regarded\" club cricketer for Beckenham Cricket Club, as well as for sides such as Band of Brothers, West Kent and United Hospitals, but only played two further first-class matches for the county side, one against Yorkshire in 1892 and one as a last minute replacement against Gloucestershire in 1895. In 1894 Northcote played for Chatham Cricket Club against the touring South Africans. His final two first-class matches were for MCC. His Wisden obituary described him as a \"good free right-handed batsman\" who \"bowled slow left arm\".Northcote qualified as a doctor in 1893 and spent much of his career working in London. He married Edith Reynolds in 1921 and died in March 1934 at Marylebone in London aged 67.", "link_mentions": [{"page": "Northcote", "response": ["* Percy Northcote (1866–1934), English cricketer"]}, {"page": "List of Marylebone Cricket Club players (1895–1914)", "response": ["* Percy Northcote (1895–1903) : P. Northcote (Middlesex)"]}]}}