{"wiki_id": "http://www.wikidata.org/entity/Q28839635", "itemLabel": "Marty McKenna", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Marty_McKenna", "wikipedia_page": {"main": "Martin \"Marty\" McKenna  (born 1995/1996) from Newcastle upon Tyne, is a British reality television personality known for his roles in two notable television shows, Geordie Shore and Ex on the Beach.", "link_mentions": [{"page": "Geordie Shore", "response": ["Series 12 was filmed in October and November 2015 and began airing on 15 March 2016. It was the first series to include new cast members Chantelle Connelly and Marty McKenna, who had previously appeared on the third series of Ex on the Beach. Marnie Simpson would also rejoin for the twelfth series having left at the end of the previous series.", "The fifteenth series was confirmed on 8 August 2017 when a teaser video was released. The series began on 29 August 2017, and concluded after nine episodes on 17 October 2017. This was the final series to include Scotty T and Marty McKenna after they were both axed from the show, as well as original cast member Gaz Beadle following his decision to quit. The series also featured the brief return of Elettra Lamborghini, when the cast jetted off to Rome. It also features Aaron taking part in his debut MMA fight in Birmingham. Former cast member James Tindale made a one-off return during the eighth episode of the series.", "The twenty second series of the show entitled Geordie Shore: Hot Single Summer, began filming in Newcastle upon Tyne in June 2021, and ended in the same month. The announcement of this series replaced the planned tenth anniversary reunion series to be set in Colombia after it was delayed from November 2020 to January 2021 before being axed altogether due to travel restrictions. Due to the Covid-19 and continued UK restrictions, the cast had to quarantine for ten days before filming began. The series marks the return of former cast-member Marty McKenna who was axed during fifteenth series as part of the shows new format which sees current cast members attempt to find love from a group of singletons and choose matches to join them in the house.", "| Marty McKenna"]}, {"page": "SHAFTA Awards (adult video)", "response": ["The first SHAFTA ceremony was held in 2010 and it was organised by Television X. The 2011 SHAFTAs were held in London on 9 March at the For Your Eyes Only club. Celebrities attending the event included Billi Bhatti, Dane Bowers and Tim Westwood. The 2012 SHAFTAs were held on 15 March at Platinum Lace, which is a strip club on Coventry Street in London. The event was hosted by Tanya Tate, who won the MILF of the Year award for the third year in a row. A minor controversy was caused when transsexual star Holly Harlow was nominated for Best New Starlet, but Television X defended the choice stating that \"the term starlet fits her perfectly, she is feminine, sexy and a great performer\". Award presenters included Danny Dyer, Lethal Bizzle and Terry Coldwell from East 17. ICM Registry co-sponsored the event along with Television X, and the event was streamed live on the awards' official website. Ben Dover was presented with an honorary award, entitled The Palm Phwoar for \"endeavours in adult entertainment\" over his 33 years in the industry. The 2013 SHAFTAs were held on 5 December at the Rise Superclub in Leicester Square. The 2016 SHAFTAs were held at The Rah Rah Room on London's Piccadilly and hosted by Benedict Garrett. The 1920s themed event was attended by the UK press, porn industry and celebrity guests including Big Brother housemate Marco Pierre White Jr and Geordie Shore's Marty McKenna and David Hawley."]}, {"page": "Ex on the Beach (British TV series)", "response": ["The seventh series of the show began on 20 June 2017. This series was filmed on location on the island of Bali in Indonesia. The cast members for the series were confirmed on 23 May 2017 which include Geordie Shore stars Chloe Ferry and Marty McKenna, Love Island contestants Max Morley and Josh Ritchie, as well as Beauty School Cop Outs cast member Savannah Kemplay. Marty and Josh had previously appeared in the third and sixth series of the show respectively."]}, {"page": "List of Geordie Shore cast members", "response": ["| Marty McKenna", "! scope=\"row\" | Marty McKenna", "In 2015, during the eleventh series, Kyle Christie made his final appearance after his turbulent relationship with Holly broke down. In November 2015 it was confirmed that Chantelle Connelly and Marty McKenna had joined the cast for the twelfth series. Marty had previously appeared during the third series of Ex on the Beach. Marnie also left at the end of the eleventh series because of the engagement proposal to former The Only Way Is Essex star Ricky Rayment, however her circumstances changed and rejoined for the twelfth series. In the Big Birthday Battle, former cast mates returned. These were Dan, Jay, James, Ricci, Sophie and Kyle (not in a certain order).", "In November 2016, the cast announced via Twitter that filming for the fourteenth series had commenced and Sophie Kasaei had made yet another comeback, however she had permanently rejoined the main cast since her departure in the seventh series. Abbie Holborn was selected to become permanent. Season fifteenth featured the departure of Marty McKenna and Scott Timlin after they were both fired from the show, it was also the last season to feature original cast member Gaz Beadle following his decision to resign. Elettra Lamborghini visits the cast while they were in Rome.", "In the twentieth season it was confirmed that former cast members Abbie Holborn and James Tindale returned. Sam Gowland and Tahlia Chung left the show after that season. For the twenty-first season, new cast members Amelia Lily, Anthony Kennedy, and Louis Shaw joined the cast. Nathalie Phillips left the program. Beau Brennan did not return to the show after the twenty-first season. The twenty-second season switched to a dating format and featured a group of rookies acting as dates for the cast members, Marty McKenna returned to the show after being fired in the fifteenth season."]}, {"page": "Ex on the Beach (British series 3)", "response": ["Jordan Davies and Megan McKenna later returned during the fourth series entering as a couple. Jordan made a third appearance during the fifth \"All star\" series, this time as main cast along with Bear and Jemma, and Holly returning as an ex again. Shortly after this series, in 2016 it was announced that Marty McKenna had joined the cast of Geordie Shore for the twelfth series. Megan McKenna also went on to appear in the seventeenth series of Celebrity Big Brother before later joining the cast of The Only Way Is Essex, where as Stephen Bear also entered the house during the eighteenth series and went on to win. A year later in August 2017, both Jemma Lucy and Jordan Davies took part in the twentieth series.", "All original cast members arrived on the beach during the first episode where they were instantly told that they would soon be joined by their exes. Laura's ex-fling Jemma Lucy arrived at the villa during the first episode. This is the first time a same-sex ex has featured in the show. Also arriving in the first episode was Jordan Davies, an ex-boyfriend of Amy wanting to cause some trouble. Marty McKenna arrived during the next episode as the ex-romance of Jemma, then his ex-girlfriend Sarah Goodhart showed up during the third episode desperate to win back his affection. After much anticipation Cami-Li arrived at the beach during the fourth episode and instantly erupted at ex-fiancée Kirk. Soon after this, Kirk and Jemma's brief romance in the villa came to an end and they were added to each other's ex-list. The fifth episode featured the Tablet of Terrors new twist, which allowed Jordan to choose to send somebody home between Jayden and Megan M. He chose Jayden. As well as this, Jordan's ex-girlfriend Ali Drew made her first appearance at the beach, and Griff's ex Holly Rickwood arrived seeking his attention. Star of first series and Geordie Shore, Vicky Pattison arrived during the sixth episode as the ex-girlfriend of Kirk, but due to his ongoing arguments in the house, he voluntarily decided to leave the villa. Megan R's ex-boyfriend Stephen Cochrane made his debut during the seventh episode unsure of his intentions, and Marty was forced to leave the villa due to illness. The villa was left in shock during the eighth episode when the Tablet of Terror ordered Ali to send one of the exes home; she chose Vicky. Following this, Cami-Li decided to leave the beach having completed her mission to make Kirk's life a misery. Star of the second series, Rogan O'Connor also turned up on the beach as Jemma's ex. The ninth episode featured the arrival of Bear's ex-girlfriend and Megan M's ex-best friend Connie Wiltshire who intended to stir things up in the villa.", "| nowrap|Kirk Norcross, Laura Summers, Marty McKenna, Rogan O'Connor", "| Marty McKenna", "| Marty McKenna"]}, {"page": "Geordie Shore (series 12)", "response": ["The twelfth series of Geordie Shore, a British television programme based in Newcastle upon Tyne was confirmed on 23 May 2015 when it was confirmed that MTV had renewed the series for a further three series taking it up to the thirteenth series. The series was filmed in October and November 2015 and began airing on 15 March 2016. This was the first series not to include Kyle Christie since he made his exit during the previous series, and was the first to feature new cast members Chantelle Connelly and Marty McKenna, who had previously appeared during the third series of Ex on the Beach.", "*Marty McKenna"]}, {"page": "Geordie Shore: Big Birthday Battle", "response": ["*Marty McKenna"]}, {"page": "Geordie Shore (series 13)", "response": ["* Marty McKenna"]}, {"page": "Celebs Go Dating", "response": ["| Marty McKenna"]}, {"page": "List of Ex on the Beach cast members", "response": ["| Marty McKenna", "| Marty McKenna", "| Marty McKenna", "| Marty McKenna, Sam Scott"]}, {"page": "Geordie Shore (series 14)", "response": ["The fourteenth series of Geordie Shore, a British television programme based in Newcastle upon Tyne, was confirmed on 31 October 2016 when cast member Scotty T announced that he would be taking a break from the series to focus on other commitments. The series was filmed in November 2016, and began airing on 28 March 2017. Ahead of the series, it was also confirmed that original cast member Holly Hagan had quit the show, following her exit in the previous series. On 28 February 2017, it was announced that eight new cast members had joined for this series. Zahida Allen, Chelsea Barber, Sam Bentham, Sarah Goodhart, Abbie Holborn, Elettra Lamborghini, Billy Phillips and Eve Shannon all appeared throughout the series hoping to become permanent members of the cast, and in the series finale, Holborn was chosen. Goodhart and Allen both previously appeared on Ex on the Beach, with the former appearing on the third series of the show as the ex-girlfriend of current Geordie Shore cast member Marty McKenna (before he joined the cast). Lamborghini has also appeared on Super Shore and participated in the fifth season of Gran Hermano VIP, the Spanish version of Celebrity Big Brother. It was also confirmed that Scotty T would return later in the series.", "* Marty McKenna"]}, {"page": "Chloe Ferry", "response": ["| Ex of Marty McKenna"]}, {"page": "Martin McKenna", "response": ["* Marty McKenna, British reality television personality"]}, {"page": "Martin McKenna (TV personality)", "response": ["#REDIRECT Marty McKenna"]}, {"page": "Ex on the Beach (British series 7)", "response": ["The seventh series of Ex on the Beach, a British television programme that aired on 20 June 2017 on MTV. The group of cast for this series include Geordie Shore stars Chloe Ferry and Marty McKenna, Love Island contestants Max Morley and Josh Ritchie, as well as Beauty School Cop Outs cast member Savannah Kemplay. Star of series five David Hawley also featured in this series. Marty and Josh had also previously appeared in the third and sixth series of the show respectively.", "The official list of cast members were released on 23 May 2017. They include four boys; Dean Ralph, Jordan Wright, Marty McKenna and Max Morley, and four girls: Che McSorley, Fatima Rull, Nicole Dutt and Savannah Kemplay. Marty has previously appeared in the third series of the show as well as featuring as a cast member on Geordie Shore, whereas Max won the first series of Love Island. Savannah also previously appeared in Beauty School Cop Outs. With the announcement of the line-up it was also confirmed that Marty's fellow Geordie Shore star Chloe Ferry would be arriving on the beach as an ex as well as Josh Ritchie, who is returning from the sixth series of the show. He also appeared alongside Max on Love Island. Star of the fifth series David Hawley will also be returning to the series.", "| Marty McKenna", "| Marty McKenna, Sam Scott"]}, {"page": "Geordie Shore (series 15)", "response": ["The fifteenth series of Geordie Shore, a British television programme based in Newcastle upon Tyne, was confirmed on 8 August 2017 when a teaser video was released. The series began on 29 August 2017, and concluded after nine episodes on 17 October 2017. This was the final series to include Scotty T and Marty McKenna after they were both axed from the show, as well as original cast member Gaz Beadle following his decision to quit. The series also featured the brief return of Elettra Lamborghini, when the cast jetted off to Rome. The series included further twists in Aaron and Marnie's turbulent relationship, a newly single Gaz getting cosy with Abbie, as well as Chloe and Nathan's friendship facing its biggest strain to date. It also features the group visiting Rome, and Aaron taking part in his debut MMA fight in Birmingham.", "*Marty McKenna"]}, {"page": "Geordie Shore: Hot Single Summer", "response": ["The twenty-second season of Geordie Shore, a British television show based in Newcastle upon Tyne, began airing on 5 October 2021. The announcement of this series replaced the show's tenth anniversary reunion series that was due to be set in Colombia, but was delayed in November 2020, and again in January 2021, before being postponed entirely due to travel restrictions thanks to the COVID-19 pandemic and continued UK restrictions. Before filming began in June 2021, the cast had to be quarantined for ten days. This season features a dating show format, where the current cast were joined by a number of new single cast members and sent on dates with them, with an added twist of eliminations for those who fail to make romantic connections. It also includes the return of Marty McKenna, who made his last appearance in the fifteenth season.", "* Marty McKenna"]}]}}