{"wiki_id": "http://www.wikidata.org/entity/Q2885821", "itemLabel": "Barré Lyndon", "itemDescription": "English playwright and screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Barr%C3%A9_Lyndon", "wikipedia_page": {"main": "Barré Lyndon (pseudonym of Alfred Edgar) (12 August 1896 – 23 October 1972) was a British playwright and screenwriter. The pseudonym was presumably taken from the title character of Thackeray's 1844 novel.\nBorn in London, he may be best remembered for his stage play The Man in Half Moon Street, which opened at London's New Theatre on 22 March 1939 and ran for 172 performances, starring Leslie Banks, Malcolm Keen and Ann Todd, as well as for three screenplays from the 1940s: The Lodger (1944), Hangover Square (1945) and The Man in Half Moon Street (1945). The last was remade by Hammer Film Productions in 1959 as The Man Who Could Cheat Death.\nLyndon began his writing career as a journalist, particularly about motor-racing, and short-story writer before becoming a playwright. His first play, The Amazing Dr. Clitterhouse, was made into an Edward G. Robinson film in 1939.  After that success, Lyndon moved to Los Angeles, California, in 1941 to concentrate on writing for films full-time. He was naturalised as a United States citizen in the United States District Court in Los Angeles as Alfred Edgar Barre Lyndon in 1952.\nAlfred Edgar had two sons, Roger Alvin Edgar (b. England, 1924) and Barry Davis Edgar (b. England, 1929) .\n\n", "link_mentions": [{"page": "Robert Bloch", "response": ["Bloch gradually evolved away from Lovecraftian imitations towards a unique style of his own. One of the first distinctly \"Blochian\" stories was \"Yours Truly, Jack the Ripper\", (Weird Tales, July 1943). The story was Bloch's take on the Jack the Ripper legend, and was filled out with more genuine factual details of the case than many other fictional treatments. It cast the Ripper as an eternal being who must make human sacrifices to extend his immortality.Meikle, p. 110 It was adapted for both radio (in Stay Tuned for Terror) and television (as an episode of Thriller in 1961 adapted by Barré Lyndon).Woods and Baddeley, p. 68 Bloch followed up this story with a number of others in a similar vein dealing with half-historic, half-legendary figures such as the Man in the Iron Mask (\"Iron Mask\", 1944), the Marquis de Sade (\"The Skull of the Marquis de Sade\", 1945) and Lizzie Borden (\"Lizzie Borden Took an Axe ...\", 1946)."]}, {"page": "Ralph Richardson", "response": ["In 1936 London Films released Things to Come, in which Richardson played the swaggering warlord \"The Boss\". His performance parodied the Italian dictator Benito Mussolini so effectively that the film was immediately banned in Italy.Kulik, p. 153 The producer was Alexander Korda; the two men formed a long and mutually beneficial friendship. Richardson later said of Korda, \"Though not so very much older than I am, I regarded him in a way as a father, and to me he was as generous as a prince.\"Kulik, p. 163 In May 1936 Richardson and Olivier jointly directed and starred in a new piece by Priestley, Bees on the Boatdeck. Both actors won excellent notices, but the play, an allegory of Britain's decline, did not attract the public.Hobson, p. 51 It closed after four weeks, the last in a succession of West End productions in which Richardson appeared to much acclaim but which were box-office failures.O'Connor, p. 80; and Morley, p. 328 In August of the same year he finally had a long-running star part, the title role in Barré Lyndon's comedy thriller, The Amazing Dr Clitterhouse, which played for 492 performances, closing in October 1937.\"Theatres\", The Times, 16 October 1937, p. 10"]}, {"page": "1977 in film", "response": ["| The War of the Worlds (re-release) || Paramount Pictures || Byron Haskin (director); Barré Lyndon (screenplay); Gene Barry, Ann Robinson, Les Tremayne, Bob Cornthwaite, Sandro Giglio, Lewis Martin, Housely Stevenson Jr., Paul Frees, William Phipps, Vernon Rich, Henry Brandon, Jack Kruschen, Sir Cedric Hardwicke || Sci-Fi || Live Action"]}, {"page": "1936 in literature", "response": ["*Barré Lyndon – The Amazing Dr. Clitterhouse"]}, {"page": "1939 in literature", "response": ["*Barré Lyndon – The Man in Half Moon Street"]}, {"page": "Hugo Award for Best Dramatic Presentation", "response": ["| data-sort-value=\"War of the Worlds, The (1953)\" | The War of the Worlds* || Byron Haskin (director), Barré Lyndon (screenplay), H. G. Wells (original novel) || Paramount Pictures"]}, {"page": "Conquest of Space", "response": ["Had George Pal followed any or all of these nonfiction books as written, he would have produced a speculative futuristic documentary, much like of the trio of Tomorrowland-set (Walt Disney's) Disneyland television episodes: Man in Space (March 1955), Man and the Moon (December 1955), and Mars and Beyond (December 1957). The final screenplay by James O'Hanlon, from an adaptation by Philip Yordan, Barré Lyndon, and George Worthing Yates, instead creates a fictional story from whole cloth.Warren 1982 pp. 208-214"]}, {"page": "Night Has a Thousand Eyes", "response": ["Night Has a Thousand Eyes is a 1948 film noir, starring Edward G. Robinson and directed by John Farrow. The screenplay was written by Barré Lyndon and Jonathan Latimer. The film is based on the novel of the same name by Cornell Woolrich, originally published under the pseudonym George Hopley.."]}, {"page": "Jack the Ripper in fiction", "response": ["Robert Bloch's short story \"Yours Truly, Jack the Ripper\" (published in Weird Tales in 1943) cast the Ripper as an eternal who must make human sacrifices to extend his immortality.Meikle, p. 110 It was adapted for both radio (in Stay Tuned for Terror) and television (as an episode of Thriller in 1961 written by Barré Lyndon).Woods and Baddeley, p. 68 The science-fiction anthology Dangerous Visions (1967) featured an unrelated Ripper story by Bloch, \"A Toy for Juliette\", and a sequel by Harlan Ellison, \"The Prowler in the City at the Edge of the World\", written with Bloch's permission. Bloch's work also includes The Will to Kill (1954) and Night of the Ripper (1984).Whitehead and Rivett, pp. 133, 135–136"]}, {"page": "Barre Lyndon", "response": ["#REDIRECT Barré Lyndon"]}, {"page": "Dark Intruder", "response": ["Dark Intruder is a 1965 horror film made for TV that was released theatrically, and starring Leslie Nielsen, Mark Richman and Judi Meredith. The film is set in San Francisco in 1890 concerning playboy sleuth and occult expert Brett Kingsford (Nielsen). This atmospheric black-and-white film is only 59 minutes long, was directed by Harvey Hart, and was the pilot for a failed television series called The Black Cloak and was written by Barré Lyndon."]}, {"page": "The Amazing Dr. Clitterhouse", "response": ["The Amazing Dr. Clitterhouse is a 1938 American crime film directed by Anatole Litvak and starring Edward G. Robinson, Claire Trevor and Humphrey Bogart. It was distributed by Warner Bros. and written by John Wexley and John Huston, based on the 1936 play The Amazing Dr. Clitterhouse, the first play written by short-story writer Barré Lyndon, which ran for three months on Broadway with Cedric HardwickeIBDB The Amazing Dr. Clittterhouse after playing in London.", "Barré Lyndon's play, The Amazing Dr. Clitterhouse, had been a success in London, and was produced on Broadway – where it opened on March 2, 1937 with Cedric Hardwicke in the lead, and ran for 80 performances, closing in May\"The Amazing Dr. Clitterhouse\" Internet Broadway Database  – in association with Warner Bros., but the studio had difficulty obtaining the movie rights even so, since Lyndon retained control of them.  Carl Laemmle Jr., Paramount and MGM all bid for the rights, and Laemmle bought them for over $50,000.  He then turned them around and sold them to Warners in return for the loan of Paul Muni for another adaptation of The Hunchback of Notre Dame, a film that was never made. Producer Robert Lord originally wanted Ronald Colman to play the part of Dr. Clitterhouse.Staff (ndg) \"Notes\" TCM.com"]}, {"page": "Houdini (1953 film)", "response": ["Barré Lyndon wrote the first screenplay then Philip Yordan wrote another version.Filming 'Houdini' Story: Hollywood Letter By Richard Dyer MacCann. The Christian Science Monitor 4 Dec 1952: 9.   The distinguished magician, escapologist, and mentalist Joseph Dunninger, credited as \"Dunninger\", was technical adviser on the film. Dunninger was a good friend to many notables in the magic community including Houdini himself, Francis Martinka, and Tony Slydini.The Magical World of Slydini (text), Fulves, Karl; Lou Tannen, Inc., New York, NY, 1979 pp. 1-17 "]}, {"page": "The Man Who Could Cheat Death", "response": ["The Man Who Could Cheat Death is a 1959 British horror film, directed by Terence Fisher and starring Anton Diffring, Hazel Court, and Christopher Lee. Jimmy Sangster adapted the screenplay from the play The Man in Half Moon Street by Barré Lyndon, which had been previously filmed in 1945. The Man Who Could Cheat Death was produced by Michael Carreras and Anthony Nelson Keys for Hammer Film Productions. It was released in the US on 19 August 1959 and in the UK on 30 November 1959."]}, {"page": "The Man in Half Moon Street", "response": ["The Man in Half Moon Street is a 1945 science fiction romantic melodrama dealing with a man who retains his youth and cannot die, living throughout the ages. The plot is similar to Oscar Wilde's Picture of Dorian Gray, except that there are more logical explanations for the eternal youth of the main character. The film is based on a 1939 West End play of the same title by Barré Lyndon, and stars Nils Asther and Helen Walker with direction by Ralph Murphy."]}, {"page": "Hangover Square (film)", "response": ["Hangover Square is a 1945 American film noir directed by John Brahm, based on the 1941 novel Hangover Square by Patrick Hamilton. The screenplay was written by Barré Lyndon who made a number of changes to the novel, including the change of George Harvey Bone into a classical composer-pianist and filming the story as an early 20th-century period piece.Mank, Gregory William (1994). Hollywood Cauldron: Thirteen Horror Films from the Genre's Golden Age. McFarland & Company, pp. 327-28 ."]}, {"page": "The Lodger (1944 film)", "response": ["The Lodger is a 1944 American horror film about Jack the Ripper, based on the 1913 novel of the same name by Marie Belloc Lowndes. It stars Merle Oberon, George Sanders, and Laird Cregar, features Sir Cedric Hardwicke, and was directed by John Brahm from a screenplay by Barré Lyndon."]}, {"page": "Jack Laird", "response": ["* From The 1950's to the 1960s, Laird wrote several spec scripts, which included, \"Red Wolf Crossing\", which was an adaptation of the Will Henry novel \"To Follow a Flag\", \"A God In A Garden\", which was based on an original story by Theodore Sturgeon, \"An Extenuating Circumstance\", a screenplay Laird co-wrote with Charles F. Haas, that was adapted from the story \"A Coward\" By Guy de Maupassant, \"The Steel Trap\", which was based on a story by William T. Orr, \"Three Marked Pennies\", which was based on a story By Mary Elizabeth Counselman, \"Four Cornered Triangle\" an original screenplay Laird wrote, \"A Day Off\", which was based on a story By Walter Gilkyson, he was also set to produce five projects, \"Crime! Pleasant Dreams Sweet Celia\", a screenplay written by Gene R. Kearney, \"Out Of The Darkness\", a screenplay written by Barré Lyndon and Alvin Sapinsley, \"Fires, Bombs, and Patriots\", a screenplay written by Abby Mann, \"The Invisible Man\", based on the H.G. Wells novel of the same name that was adapted by Howard Rodman, and \"The Other Place\", a screenplay written by Theodore Sturgeon."]}, {"page": "The War of the Worlds (1953 film)", "response": ["In The New York Times, A. H. Weiler's review of The War of the Worlds commented: \"[The film is] an imaginatively conceived, professionally turned adventure, which makes excellent use of Technicolor, special effects by a crew of experts, and impressively drawn backgrounds ... Director Byron Haskin, working from a tight script by Barré Lyndon, has made this excursion suspenseful, fast and, on occasion, properly chilling\".Weiler, A. H. (as A. W.), \"The Screen in Review: New Martian Invasion Is Seen in War of the Worlds, Which Bows at Mayfair.\" The New York Times, August 14, 1953. Retrieved: January 11, 2015. \"Brog\" in Variety felt, \"[It is] a socko science-fiction feature, as fearsome as a film as was the Orson Welles 1938 radio interpretation ... what starring honors there are go strictly to the special effects, which create an atmosphere of soul-chilling apprehension so effectively [that] audiences will actually take alarm at the danger posed in the picture. It can't be recommended for the weak-hearted, but to the many who delight in an occasional good scare, it's socko entertainment of hackle-raising quality\".\"Brog\".Variety, April 6, 1953.Willis 1985  The Monthly Film Bulletin of the UK called it \"the best of the postwar American science-fiction films; the Martian machines have a quality of real terror, their sinister apparitions, prowlings and pulverisings are spectacularly well done, and the scenes of panic and destruction are staged with real flair\". Richard L. Coe of The Washington Post called it \"to put it gently, terrific\", and \"for my money, the King Kong of its day\"."]}, {"page": "Frederick Piper", "response": ["Born in London in 1902, Piper worked as a tea merchant before starting his acting career on the stage in the 1920s, playing in London productions and also touring as far afield as Canada. He continued to appear in theatrical productions in the West End alongside his screen roles. These included appearances in the original runs of Barré Lyndon's The Man in Half Moon Street, Vernon Sylvaine's Nap Hand, N.C. Hunter's A Day by the Sea, Robert Bolt's Flowering Cherry and Home at Seven and The White Carnation by R.C. Sheriff."]}, {"page": "Barre (name)", "response": ["* Barré Lyndon (1896–1972), British playwright and screenwriter"]}, {"page": "Alfred Edgar", "response": ["#Redirect Barré Lyndon"]}, {"page": "The Amazing Dr. Clitterhouse (play)", "response": ["The Amazing Dr. Clitterhouse is a 1936 thriller play by the British writer Barré Lyndon. The lead character's name is a play on the term for the female sexual organ the clitoris - a name characterised by the \"yearning, untrammelled nature\"Kabatchnik p.162 of Clitterhouse himself; an extremely daring pun for 1936,Kabatchnik p.163 yet seemingly anticipated by Lyndon to escape the notice of the contemporary censor. \"My view was that he was no more likely to locate the pun in my title as to locate the source of it on his beloved bedfellow\", Lyndon 'Fragment of Autobiography'.Kabatchnik p.162", "Category:Plays by Barré Lyndon"]}]}}