{"wiki_id": "http://www.wikidata.org/entity/Q28869083", "itemLabel": "Thomas Fry", "itemDescription": "English cleric 1775-1860", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Fry_(priest,_born_1775)", "wikipedia_page": {"main": "Thomas Fry (1775–1860) was an English cleric and academic.", "link_mentions": [{"page": "Legh Richmond", "response": ["Richmond died on 8 May 1827. His funeral sermon was preached by the Rev. Thomas Fry of Emberton, a close friend.", "Numerous lives of Richmond have been published. Domestic Portraiture (1833) by his close friend Thomas Fry related to the Richmond household, and in particular the two oldest sons. The Rev. Legh Richmond's letters and counsels to his children (1848),Selected from his memoir and \"Domestic portraiture\"; with an account of the closing scene of his life. edited by his daughter Fanny Richmond, , drew on Domestic Portraiture. A life by John Ayre was included in editions of Annals of the Poor."]}, {"page": "Bible translations into Hebrew", "response": ["* 1813-1817, New Testament, Thomas Fry and William Bengo' Collyer, LondonScanned versions of this translation can be found here (1813 - this scan contains only the gospels of Matthew and Mark) , here (1817), here (1821) and here (1828) Robert Lisle Lindsey A Hebrew translation of the Gospel of Mark - 1969 p159 \"The Hebrew Text The history of Hebrew translations of the New Testament is much longer than is commonly known. ... The London Jews' Society published a quite new translation by T. Fry and others in 1817 the original proofsheets of which \""]}, {"page": "William Bengo' Collyer", "response": ["The University of Edinburgh awarded Collyer the degree of D.D. in 1808. In 1812 he succeeded Joseph Fox as joint secretary of the London Society for Promoting Christianity Amongst the Jews, retiring with his Anglican colleague Thomas Fry in 1814.R. H. Martin, United Conversionist Activities among the Jews in Great Britain 1795-1815: Pan-Evangelicalism and the London Society for Promoting Christianity amongst the Jews, Church History Vol. 46, No. 4 (Dec., 1977), pp. 437–452, at p. 445. Published by: Cambridge University Press on behalf of the American Society of Church History.  Collyer and Fry's translations into Hebrew of the Gospels of Matthew and Mark, carried out with the help of Judah D'Allemand, were published in 1813 and 1815 respectively."]}, {"page": "Joseph Fox (dental surgeon)", "response": ["From 1809 and its founding, to 1812, Fox was Secretary of the London Society for Promoting Christianity Amongst the Jews. He had Thomas Fry as colleague from 1810."]}, {"page": "Thomas Fry", "response": ["Thomas Fry may refer to:", "* Thomas Fry (priest, born 1718) (1718–1772), English priest and academic", "* Thomas Fry (priest, born 1775) (1775–1860), English cleric and academic", "* Thomas Fry (priest, born 1846) (1846–1930), English Anglican clergyman, Dean of Lincoln", "* Thomas Frye (disambiguation)"]}]}}