{"wiki_id": "http://www.wikidata.org/entity/Q2884066", "itemLabel": "Barbara Ward", "itemDescription": "British economist; life peer (1914-1981)", "wikipedia_url": "https://en.wikipedia.org/wiki/Barbara_Ward,_Baroness_Jackson_of_Lodsworth", "wikipedia_page": {"main": "Barbara Mary Ward, Baroness Jackson of Lodsworth,  (23 May 1914 – 31 May 1981) was a British economist and writer interested in the problems of developing countries. She urged Western governments to share their prosperity with the rest of the world and in the 1960s turned her attention to environmental questions as well. She was an early advocate of sustainable development before this term became familiar and was well known as a journalist, lecturer and broadcaster. Ward was adviser to policy-makers in the UK, United States and elsewhere.", "link_mentions": [{"page": "George Orwell", "response": ["Animal Farm had particular resonance in the post-war climate and its worldwide success made Orwell a sought-after figure. For the next four years, Orwell mixed journalistic work—mainly for Tribune, The Observer and the Manchester Evening News, though he also contributed to many small-circulation political and literary magazines—with writing his best-known work, Nineteen Eighty-Four, which was published in 1949. He was a leading figure in the so-called Shanghai Club (named after a restaurant in Soho) of left-leaning and émigré journalists, among them E. H. Carr, Sebastian Haffner, Isaac Deutscher, Barbara Ward and Jon Kimche."]}, {"page": "May 31", "response": ["*1981 – Barbara Ward, Baroness Jackson of Lodsworth, English economist and journalist (b. 1914)"]}, {"page": "May 23", "response": ["*  1914   – Barbara Ward, Baroness Jackson of Lodsworth, English economist, journalist, and prominent Catholic layperson (d. 1981)"]}, {"page": "1981", "response": ["** Barbara Ward, Baroness Jackson of Lodsworth, British economist (b. 1914)"]}, {"page": "Isaac Deutscher", "response": ["Germany invaded Poland in September 1939 and Deutscher's connection with his newspaper was severed. He taught himself English and began writing for English magazines. He was soon a regular correspondent for the leading weekly The Economist. He joined the Trotskyist Revolutionary Workers League. In 1940, he joined the Polish Army in Scotland, but was interned as a dangerous subversive. Released in 1942, he joined the staff of The Economist and became its expert on Soviet affairs and military issues, and its chief European correspondent. He also wrote for The Observer as a roving European correspondent under the pen-name \"Peregrine\". He was one of the so-called Shanghai Club (named after a restaurant in Soho) of left-leaning and emigre journalists that included Sebastian Haffner (also on The Observer),  E. H. Carr, George Orwell, Barbara Ward and Jon Kimche."]}, {"page": "Audubon", "response": ["* 1973 Barbara Ward (Lady Jackson, D.B.E.)"]}, {"page": "David Astor", "response": ["With Haffner, in the late 1940s Astor was one of the so-called Shanghai Club (named after a restaurant in Soho) of liberal/left-leaning and emigre journalists that included Orwell, Isaac Deutscher (who as a roving European correspondent also wrote for the Observer), E. H. Carr, Barbara Ward, and Jon Kimche."]}, {"page": "Sebastian Haffner", "response": ["In 1941 David Astor invited Haffner to join The Observer as political correspondent, while Edward Hulton recruited him as contributor to the popular Picture Post. The Observer's foreign editor and an influential opinion former in England, in 1948 Haffner became a naturalised British citizen. Through the so-called Shanghai Club (named after a restaurant in Soho), he associated with left-leaning and emigre journalists, among them E. H. Carr, George Orwell, Isaac Deutscher,  Barbara Ward and Jon Kimche"]}, {"page": "Barbara Ward (economist)", "response": ["#REDIRECT Barbara Ward, Baroness Jackson of Lodsworth"]}, {"page": "Baroness Jackson of Lodsworth", "response": ["#REDIRECT Barbara Ward, Baroness Jackson of Lodsworth"]}, {"page": "Dublin Review (Catholic periodical)", "response": ["Later contributors to the magazine included Don Luigi Sturzo,Farrell-Vinay, G. (2004), \"The London exile of Don Luigi Sturzo (1924–1940\"). The Heythrop Journal, 45: 158–177. E. I. Watkin, and Barbara Ward.Paul T. Phillips, Contesting the Moral High Ground: Popular Moralists in Mid-Twentieth-Century Britain McGill-Queen's Press  2013.  (p. 194). In 1961, the name was changed to the Wiseman Review to avoid the confusion that it was published in Dublin, but the publication reverted to the original name in 1965. It ceased publication in 1969, and was incorporated into The Month."]}, {"page": "Assumption University (Windsor, Ontario)", "response": ["*Barbara Ward, Baroness Jackson of Lodsworth"]}, {"page": "Ward (surname)", "response": ["* Barbara Ward (1914–1981), British economist and writer"]}, {"page": "Barbara M. Ward", "response": ["#REDIRECT Barbara Ward, Baroness Jackson of Lodsworth"]}, {"page": "Habitat I", "response": ["* Barbara Ward, Baroness Jackson of Lodsworth"]}, {"page": "Barbara Mary Ward", "response": ["#REDIRECT Barbara Ward, Baroness Jackson of Lodsworth"]}, {"page": "Barbara Mary Jackson", "response": ["#REDIRECT Barbara Ward, Baroness Jackson of Lodsworth"]}, {"page": "Barbara Mary Ward Jackson", "response": ["#REDIRECT Barbara Ward, Baroness Jackson of Lodsworth"]}, {"page": "Barbara Ward Jackson", "response": ["#REDIRECT Barbara Ward, Baroness Jackson of Lodsworth"]}, {"page": "Lady Jackson", "response": ["#REDIRECT Barbara Ward, Baroness Jackson of Lodsworth"]}, {"page": "Barbara Ward", "response": ["#REDIRECT Barbara Ward, Baroness Jackson of Lodsworth"]}, {"page": "May 1914", "response": ["* Born: Barbara Ward, British economist, early advocate for sustainable development, in Heworth, York, England (d. 1981)"]}, {"page": "Fatima Denton", "response": ["Denton was the 2015 Barbara Ward Lecturer, challenging policy-makers, researchers, and academics in London to reexamine Africa and its relationship to climate change. She is a speaker at the 2016 Borlaug Dialogue International Symposium, one of several \"Women Leaders Driving Agricultural Transformation in Africa\"."]}, {"page": "The British Way and Purpose", "response": ["There were a variety of contributors including Denis Brogan on the United States, Barbara Ward on citizenship and Hilary Marquand on people at work."]}, {"page": "List of Somerville College, Oxford, people", "response": ["*Dame Barbara Ward, Baroness Jackson of Lodsworth DBE (1914–1981), economist and writer interested in the problems of developing countries; winner of the Jawaharlal Nehru Award"]}, {"page": "National Institute of Social Sciences", "response": ["* Barbara Ward, Baroness Jackson of Lodsworth"]}]}}