{"wiki_id": "http://www.wikidata.org/entity/Q28868062", "itemLabel": "Colin Matthews", "itemDescription": "British cricketer (1931-1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Matthews_(cricketer)", "wikipedia_page": {"main": "Colin Stuart Matthews (17 October 1931 – 15 March 1990) was an English first-class cricketer active 1950–59 who played for Nottinghamshire. He was born and died in Worksop.\n\n", "link_mentions": [{"page": "Colin Matthews", "response": ["Colin Matthews, OBE (born 13 February 1946) is an English composer of contemporary classical music. Noted for his large-scale orchestral compositions, Matthews is also a prolific arranger of other composer's music, including works by Berlioz, Britten, Dowland, Mahler, Purcell and Schubert. Other arrangements include orchestrations of all Debussy's 24 Préludes, both books of Debussy's Images, and two movements—Oiseaux tristes and La vallée des cloches—from Ravel's Miroirs. Having received a doctorate from University of Sussex on the works of Mahler, from 1964–1975 Matthews worked with his brother David Matthews and musicologist Deryck Cooke on completing a performance version of Mahler's Tenth Symphony.", "Colin Matthews' chamber music includes five string quartets, two oboe quartets, a Divertimento for double string quartet (1982), and a substantial body of piano music. Between 1985 and 1994 he completed six major works for ensemble: Suns Dance for the London Sinfonietta (1985, reworked for the Royal Ballet as Pursuit), Two Part Invention (1987), The Great Journey (1981–88)—re-released on NMC—Contraflow, commissioned by the London Sinfonietta for the 1992 Huddersfield Festival, and two commissions for the Birmingham Contemporary Music Group, Hidden Variables (1989) and ...through the glass (1994), the latter given its first performance under Simon Rattle, who also conducted it in 1998 at the Proms and in Salzburg. Matthews' music was featured at the Almeida Festival in 1988, at the Bath Festival in 1990, at Tanglewood where he has been visiting composer many times since 1998, at the 1998 Suntory Summer Festival in Tokyo, at the 2003 Avanti! Festival in Finland, and the 2004 Berlin Festival.", "Colin Matthews' 60th birthday was marked by 5 performances given at the 2006 BBC Proms. Recent works have included Berceuse for Dresden, written for the rebuilt Frauenkirche in Dresden and first performed there in November 2005 with the cellist Jan Vogler and the New York Philharmonic under Lorin Maazel; and Turning Point, commissioned by the Concertgebouw Orchestra and given by them under Markus Stenz in January 2007. His Violin Concerto was given by Leila Josefowicz and the City of Birmingham Symphony Orchestra under Oliver Knussen in September 2009.", "In 1998 Colin Matthews was awarded an honorary doctorate by the University of Nottingham, where he has been honorary professor since 2005. He is currently Prince Consort Professor of Music at the Royal College of Music, where he was made FRCM in 2007, and distinguished visiting fellow in composition at the University of Manchester. He was a governor of the Royal Northern College of Music (where he is FRNCM) from 2001 to 2008. In 2010 he was made an Honorary Member of the Royal Academy of Music. He was presented with the Royal Philharmonic Society/Performing Right Society Leslie Boosey Award in 2005, honouring an individual who has made an outstanding contribution to the furtherance of contemporary music in Britain; and the Gramophone 2017 Special Achievement Award in recognition of his work for NMC.", "* Thomas, Christopher (2004). \"Recording of the Month: Colin Matthews (b. 1946): Sonata No. 5, Landscape; Cello Concerto No. 1; Hidden Variables; Memorial; Quatrain; Machines and Dreams\". MusicWeb International. (Retrieved on 27 December 2007.)", "*Colin Matthews official website", "* The Living Composers Project: Colin Matthews"]}]}}