{"wiki_id": "http://www.wikidata.org/entity/Q28870726", "itemLabel": "Billy Reeves", "itemDescription": "association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Billy_Reeves_(footballer)", "wikipedia_page": {"main": "William David Reeves (born 18 December 1996) is a Welsh professional footballer who plays as a midfielder for Northern Premier League Division One West side Leek Town.\nHe began his career at Port Vale in April 2015, and later went out on loan to Witton Albion, Hyde United and Stafford Rangers. He was released by Port Vale in May 2018 and joined Leek Town via Stafford Rangers later in the year.", "link_mentions": [{"page": "Billy Reeves", "response": ["Billy Reeves (born 7 June 1965) is an English songwriter, musician, record producer and broadcaster."]}, {"page": "William Reeves", "response": ["William, Bill or Billy Reeves may refer to:", "*Billy Reeves (born 1965), British songwriter and broadcaster", "*Billy Reeves (footballer) (born 1996), English soccer player"]}, {"page": "Reeves (surname)", "response": ["* Billy Reeves (footballer)"]}, {"page": "2015–16 Port Vale F.C. season", "response": ["Five youth team players were given professional contracts for the 2015–16 season: defender Lewis Bergin, midfielders Chekaine Steele, Billy Reeves and Omar Haughton, and striker Jonathon Kapend. Manager Rob Page signed a new two-year contract in May 2015. However he needed to avoid a poor start to the season as chairman Norman Smurthwaite warned he was prepared to make \"ruthless decisions\" if the club were struggling by September. The first signings of the season were powerful former loanee defender Remie Streete from Newcastle United, and former Norwich City youth player Sam Kelly. Midfielder Sam Foley also joined the \"Valiants\" on a two-year contract, choosing to leave relegated Yeovil Town just after picking up Yeovil's Player of the Year award. Page further strengthened the defence and midfield by signing Walsall right-back Ben Purkiss and Crewe Alexandra defensive midfielder Anthony Grant. Page needed to find a cost-effective forward with the club both short on strikers following the departure of Tom Pope and Ben Williamson and with little funds available due to a large cut to the wage bill, and so brought in young Watford striker Uche Ikpeazu on loan, having been impressed by Ikpeazu's performances for Crewe last season. Another former Crewe favourite, A-Jay Leitch-Smith, was also signed after impressing Page during pre-season. The eighth and final summer signing was Ryan Inniss, who was confirmed as joining on a season long loan from Crystal Palace after being linked with a return to Vale Park for many weeks. On 6 August, Vale signed goalkeeper Jak Alnwick on a short-term deal; he was signed to compete with Sam Johnson for a first team place as Chris Neal was out injured at the start of the season.", "|align=\"left\"|MF||31||align=\"left\"| Billy Reeves", "| 6 November 2015 || MF ||  || Billy Reeves || Witton Albion || 6 February 2016 || ", "| 12 February 2016 || MF ||  || Billy Reeves || Hyde United || 12 March 2016 || "]}, {"page": "2016–17 Port Vale F.C. season", "response": ["Brown signed Vale's eighth goalkeeper of the season on 1 March after former Turkey youth international Deniz Mehmet agreed to a short-term contract. Vale then travelled to play-off chasing Southend United, and picked up a useful point after grinding out a 1–1 draw despite losing Pugh and Thomas to injury and having to hand a debut to youth team graduate Billy Reeves. Vale came from one goal down to record an important 3–2 victory at home to relegation rivals Swindon Town on 11 March. However they went on to lose 2–1 at Northampton Town three days later – a damaging defeat as the two teams directly above the relegation zone (Bury and Oldham) both won to leave Vale five points short of safety. Brown acted on 17 March by bringing in former Cameroon international defender André Bikey and re-signing Ryan Taylor on contracts running until the end of the season. Later that evening Taylor provided an assist and scored a goal as Vale claimed a crucial 2–1 home win over relegation rivals Shrewsbury Town. Vale had the chance to exit the relegation zone on 21 March, but put in a poor performance at the Ricoh Arena and conspired to become the only team to lose home and away to bottom club Coventry City that season. They missed another opportunity to overtake Shrewsbury in 20th-place four days later after playing out a 0–0 draw at home to MK Dons in front of a crowd of just 3,877.", "|align=\"left\"|MF||31||align=\"left\"| Billy Reeves", "|31||||MF||Billy Reeves||2||0||0||0||0||0||0||0||2||0", "| 16 September 2016 || CM ||  || Billy Reeves || Witton Albion || 24 October 2016 || ", "| 18 November 2016 || CM ||  || Billy Reeves || Witton Albion || December 2016 || ", "| 3 February 2017 || CM ||  || Billy Reeves || Stafford Rangers || 3 March 2017 || "]}, {"page": "2017–18 Port Vale F.C. season", "response": ["Vale ended their league campaign with a 5–0 defeat at Cambridge United, leaving them in 20th-place – the joint-lowest finish in the club's history (the other being the 1979–80 season). At the end of the season Aspin released ten players – Chris Regis, Ryan Boot, Luke Dennis, Anton Forrester, Graham Kelly, Kjell Knops, Harry Middleton, Billy Reeves, Joe Slinn and Charlie Walford – and transfer-listed Tyrone Barnett, Joe Davis, Callum Howe and Rob Lainton, as he attempted to build his own squad for the 2018–19 season.", "|align=\"left\"|MF||18||align=\"left\"| Billy Reeves", "|–||MF||||18||Billy Reeves||0||0||0||1||1", "|18||||MF||Billy Reeves||1||0||0||0||0||0||0||0||1||0", "| 8 May 2018 || CM ||  ||  Billy Reeves || Stafford Rangers || Released || "]}]}}