{"wiki_id": "http://www.wikidata.org/entity/Q28872951", "itemLabel": "John Tonge", "itemDescription": "British cricketer (1865-1903)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Tonge", "wikipedia_page": {"main": "John Norton Tonge (9 July 1865 – 8 July 1903) was an English amateur cricketer who played for Kent County Cricket Club in the late 19th century.\nTonge was born at Otford in Kent in 1884, the son of William and Anna Tonge (née Bird). He grew up at Southam in Warwickshire and attended nearby Cheltenham College as a day boy. He did not play cricket for the school XI and worked in the London Stock Exchange after leaving Cheltenham. He played club cricket for teams such as Bickley Park, and an innings of 110 for the Kent Second XI against Gravesend saw him selected for the county First XI in 1884. He made his first-class cricket debut against Derbyshire at Gravesend.He made four appearances for the county in 1885 and went on to play for Kent each season until end of the decade, being aware his county cap in 1887. Unusually for an amateur, he played more frequently on grounds away from Kent. He made a total of 36 first-class appearances for the side, although his batting for Kent never lived up to the form he showed at club level – he made several large scores for Bickley Park as well as for sides such as Blackheath and Band of Brothers, an amateur side closely associated with Kent.After playing twice for Kent in 1895 and four times in 1897 before touring North America with Plum Warner's XI and making his final two first-class appearances against the Gentlemen of Philadelphia.He inherited Morants Court at Chevening in Kent after the death of his father in 1891 and in 1892 married Edith Boosey. The couple had one daughter, but Edith died in 1893 and Tonge did not remarry.  After suffering from tuberculosis for some time, Tonge died in 1903 aged 37. His estate passed to his mother and his brother William, a British Army officer who played two first-class matches for Gloucestershire.", "link_mentions": [{"page": "Walter Brooks (cricketer)", "response": ["Brooks served in the First World War with The Duke of Cornwall's Light Infantry, in the early month of which he was promoted to the rank of captain in December 1914. In January 1916 he was awarded the Military Cross, before he was seconded to the general staff in February 1917. He was made a brevet major in December 1917, and while serving on the general staff in October 1918 he was made a temporary lieutenant colonel. He was later made a brevet lieutenant colonel. Over a decade later, he was promoted to the rank of colonel in March 1932, with seniority antedated to February 1928. Brooks retired from active service in October 1939, one month into the Second World War, holding the temporary rank of brigadier. Up until that point he had served as an aide-de-camp to George VI. He was made an honorary brigadier in March 1941. He died at Tunbridge Wells in June 1965. His father-in-law, John Tonge, was also a first-class cricketer."]}, {"page": "Tonge, John", "response": ["#redirectJohn Tonge"]}, {"page": "John Tonge (disambiguation)", "response": ["John Tonge (1865–1903) was an English cricketer.", "John Tonge may also refer to:", "*John Tonge Centre", "*John Tonge (MP) for Leicester"]}]}}