{"wiki_id": "http://www.wikidata.org/entity/Q28816862", "itemLabel": "Sean Raggett", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Sean_Raggett", "wikipedia_page": {"main": "Sean Aidan Raggett (born  25 January 1994) is an English and Irish professional footballer who plays as a centre-back for League One club Portsmouth.\n\n", "link_mentions": [{"page": "Robert Dickie (footballer)", "response": ["On 1 August 2017, Dickie joined Lincoln City on loan until January 2018. Dickie made his debut 5 days later in a 2–2 draw against Wycombe Wanderers. During his short time at the club, Dickie kept captain Luke Waterfall out of the team and he claimed that his partnership with Sean Raggett helped him improved his game."]}, {"page": "Raggett", "response": ["* Sean Raggett (born 1994), English footballer"]}, {"page": "Burnley F.C. 0–1 Lincoln City F.C. (2017)", "response": ["As a National League team, Lincoln City started in the Fourth Qualifying Round, where they were drawn with fellow National League team, Guiseley at home. After a 0–0 draw at Sincil Bank, they won the replay 2–1 at Nethermoor Park due to goals from  Adam Boyes and Theo Robinson. In the First Round Proper, they drew National League North side Altrincham at home, where they won 2–1 due to goals from Sean Raggett and Alan Power. In the Second Round they drew Football League One team Oldham Athletic. At Sincil Bank, Lincoln City progressed after a 3–2 win due to two goals from Robinson and one from Terry Hawkridge. In the Third Round, they drew Football League Championship Ipswich Town away. After a 2–2 draw at Portman Road they won the replay at Sincil Bank 1–0 due to a goal from Nathan Arnold. In the Fourth Round they played Football League Championship team Brighton & Hove Albion at Sincil Bank. Lincoln City won 3–1 due to goals from Power, Robinson and an own goal from Fikayo Tomori to set up the match with Premier League Burnley.", "Burnley went into the match with only three home defeats in their last 29 games. Lincoln approached the game using their players in numbers to Burnley's tactics. In the first half, both rams had chances with Lincoln's Jack Muldoon shooting over the crossbar and Burnley's Andre Gray getting a shot on target but it was saved by Lincoln goalkeeper Paul Farman. The first half finished 0–0. During the second half, there was a contest between Burnley's Joey Barton and Lincoln's Matt Rhead which eventually ended up in a brawl inside Lincoln's penalty area when Rhead claimed Barton had stamped on him and then Barton pushed Terry Hawkridge in the face and received a yellow card for it. Lincoln then started putting crosses into Burnley's penalty area. Eventually Lincoln scored on 89 minutes with their first and only shot on target of the game due to a header from Sean Raggett, which was confirmed via goal-line technology. Burnley responded with a number of attacks during five minutes of stoppage time, forcing Lincoln to defend a number of shots and corner kicks however Lincoln held on for the win becoming the first non-league side in 103 years to reach the FA Cup quarter-finals. ", "|CB ||25 || Sean Raggett"]}, {"page": "2017–18 Norwich City F.C. season", "response": ["| 18 August 2017 || CB ||  || Sean Raggett ||  Lincoln City || Undisclosed || ", "| 18 August 2017 || CB ||  || Sean Raggett ||  Lincoln City || January 2018 || ", "| 20 || DF || style=\"text-align:left;\" | Sean Raggett"]}, {"page": "2017–18 Lincoln City F.C. season", "response": ["| 18 August 2017 || CB ||  || Sean Raggett || Norwich City || Undisclosed || ", "| 18 August 2017 || CB ||  || Sean Raggett || Norwich City || 2 January 2018 || "]}]}}