{"wiki_id": "http://www.wikidata.org/entity/Q28924241", "itemLabel": "Sidney Boucher", "itemDescription": "cricketer (1899-1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sidney_Boucher", "wikipedia_page": {"main": "Captain Sidney Boucher  (17 September 1899 – 4 August 1963), also known as Sam Boucher, was an English Royal Navy officer who fought in both World War I and World War II. He played first-class cricket for Royal Navy Cricket Club between 1923 and 1929 as well as playing one match for Kent County Cricket Club in 1922.", "link_mentions": [{"page": "Royal Naval College, Osborne", "response": ["*Sidney Boucher (1899–1963), later Captain Sidney Boucher Lewis, P. (2014) For Kent and Country, pp.119–121. Brighton: Reveille Press. "]}, {"page": "Dumpton School", "response": ["*Sidney Boucher, (1899–1963) Royal Naval officer and first-class cricketerLewis P (2014) For Kent and Country, pp.116–117. Brighton: Reveille Press."]}, {"page": "HMS Lowestoft (U59)", "response": ["Following commissioning, Lowestoft joined the China Station, reaching Hong Kong on 15 February 1935. She had suffered boiler problems on the passage from England, and was under repair from arrival at Hong Kong until May 1935. Lowestofts duties included patrols along the coast of China and regular port visits. In April 1937, Lowestoft exchanged her crew with a fresh crew sent out from the United Kingdom, recommissioning at Singapore before returning to Hong Kong commanded by Commander Sidney Boucher. In January 1938, Lowestoft landed sailors at Chefoo (now known as Yantai) to protect Western interests during a Chinese offensive in the region with the aim of retaking Hangzhou during the Second Sino-Japanese War.  Between September and November 1938, Lowestoft was refitted at Singapore. In June 1939, Japan blockaded the British concession in Tientsin (now known as Tianjin) when four Chinese wanted by the Japanese occupation forces took refuge in the British concession. Lowestoft stood by at Tientsin during the stand-off, ready to evacuate British residents if the situation further deteriorated. In July 1939, Lowestoft was refitted at Hong Kong, and was re-armed with 4-inch guns to increase its anti-aircraft capability."]}]}}