{"wiki_id": "http://www.wikidata.org/entity/Q28924261", "itemLabel": "William Dutnall", "itemDescription": "cricketer (1888-1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Dutnall", "wikipedia_page": {"main": "William Dutnall (29 August 1888 – 18 March 1960) was an English professional cricketer. \nBorn at Canterbury in Kent in 1888, Dutnall was the oldest son of pub landlord William Dutnall and his wife Amy. He worked as a clerk at the Canterbury Gas and Water Company.Dutnall began playing Second XI cricket for Kent County Cricket Club in 1906, initially as an amateur before being taken on by the club as a professional. He opened the batting for the Second XI, although he did not play as regularly as his brother Frank who was the leading run-scorer for the Second XI in 1914.During World War I Dutnall was conscripted in 1917 but found unfit for overseas service due to hammer toes on both feet. He served in the Royal Garrison Artillery in an anti-aircraft brigade based at Abbey Wood as a clerk. He was promoted to Lance Sergeant by 1919 when he made his first-class cricket debut, playing for the Army against Cambridge University.Dutnall was demobilised in December 1919 and joined the General Post Office telephones department in Canterbury. He was a regular in Kent's Second XI during the 1920 and 1921 seasons playing alongside his brother. He played occasionally after 1921, playing his only Kent First XI match and his second first-class appearance in 1923 against the touring West Indians at Canterbury.Dutnall married Edith East in 1917. He lived in Canterbury throughout his life and died in the city in March 1960 aged 71.", "link_mentions": [{"page": "Frank Dutnall", "response": ["Born at Canterbury in Kent in 1895, Dutnall was the youngest son of pub landlord William Dutnall and his wife Amy. He worked as a clerk in a coal merchant's business.Lewis P (2014) For Kent and Country, pp.156–157. Brighton: Reveille Press. Dutnall first played for Kent County Cricket Club's Second XI in the Minor Counties Championship in 1912 and was soon a regular in the side. He was the leading run-scorer for the Second XI in 1914, scoring a century against Surrey Second XI.Frank Dutnall, Lancashire League. Retrieved 2017-06-01.Frank Dutnall, CricketArchive. Retrieved 2017-06-01.", "Dutnall married Emily Jones in Canterbury in 1925 and ran an athletic outfitters business in Burnley. He died in Burnley in 1971 aged 76. His brother, William Dutnall, also played for Kent.Dutnall, Frank, Obituaries in 1971, Wisden Cricketers' Almanack 1972. Retrieved 2017-06-01."]}, {"page": "Dutnall, William", "response": ["#redirectWilliam Dutnall"]}]}}