{"wiki_id": "http://www.wikidata.org/entity/Q28957339", "itemLabel": "Ernest Tennant", "itemDescription": "British banker and soldier", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernest_Tennant", "wikipedia_page": {"main": "Ernest William Dalrymple Tennant OBE (5 May 1887 – 31 July 1962) was an English merchant banker and industrialist. An advocate of closer links between the UK and Germany, he was a prominent voice for co-operation between the countries in the years before the Second World War. He was made an Officer of the Order of the British Empire in 1919.\n\n", "link_mentions": [{"page": "Anglo-German Fellowship", "response": ["In a 1935 speech, the Prince of Wales (later Edward VIII) had called for a closer understanding of Germany in order to safeguard peace in Europe, and in response Sir Thomas Moore, a Conservative Member of Parliament, suggested setting up a study group of pro-German MPs. From that idea emerged the AGF, established in September 1935 with Lord Mount Temple as chairman, and historian Philip Conwell-Evans and merchant banker Ernest Tennant as secretaries.Martin Pugh, \"Hurrah For the Blackshirts!\" Fascists and Fascism in Britain Between the War, Pimlico, 2006, p. 269 Tennant was a friend of Joachim von Ribbentrop, German Ambassador to Britain. The group's stated aims were to foster political, professional, commercial and sporting links with Germany, but Mount Temple stated publicly that membership of the society did not assume support for Nazism or anti-Semitism.", "At the time of the Munich Crisis in 1938 Ernest Tennant recorded that the feeling in the organisation was that they should close. However, they approached the UK Foreign Office for advice. Tennant reported that Lord Vansittart recommended their staying active, which they did until the outbreak of the Second World War."]}, {"page": "Eleonora Tennant", "response": ["Eleonora Elisa Fiaschi Tennant (19 December 1893 – 11 September 1963) was an Australian political activist best known for her involvement with far-right politics in England. She and her husband Ernest Tennant had links with Nazi Germany and she was an outspoken anti-Semite. She stood for the House of Commons on two occasions, as a Conservative in 1931 and as an Independent Conservative in 1945. She returned to Australia in 1952 and was a Democratic Labor candidate for the Senate in 1961.", "Tennant was born in SydneyCharles Mosley (ed.), Burke's Peerage, Baronetage & Knightage, 107th edition, 3 volumes. Wilmington, Delaware, U.S.A.: Burke's Peerage (Genealogical Books) Ltd, 2003. p. 1568 to Italian-Australian military surgeon Thomas Fiaschi and his first wife Catherine Ann (), who was born in Ireland and was a former nun. she was sent to school in England.\"The Returning Officer: Eleonora Tennant\", New Statesman, 23 September 2016 In 1911, while in Australia, she met Ernest Tennant, a British merchant banker who did a lot of business with Germany.Judith Keene, Fighting For Franco, pp.252–253 They married soon afterwards, while she was still seventeen, and settled in the UK, living at the Tennant family home of Orford House.Anne Deveson, \"Tennant, Eleonora Elisa (1893–1963)\", Australian Women's Weekly, 12 February 1964, p.5 They had four children together The two came to know Joachim von Ribbentrop and were supportive of Nazism.Paola Bacchetta and Margaret Power, Right-wing Women: From Conservatives to Extremists Around the World, pp.186–187 Ernest Tennant was a leading figure in the Anglo-German Fellowship, an organisation he helped to establish in 1935 which advocated closer relations between the UK and Nazi Germany.Richard Griffiths, Fellow Travellers of the Right: British Enthusiasts for Nazi Germany 1933–1939, Oxford University Press, 1933, pp. 182–186"]}, {"page": "E.W.D. Tennant", "response": ["#REDIRECT Ernest Tennant"]}]}}