{"wiki_id": "http://www.wikidata.org/entity/Q28940941", "itemLabel": "Richard Seddon", "itemDescription": "British cricketer (1825-1884)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Seddon_(cricketer)", "wikipedia_page": {"main": "Richard Seddon (11 February 1825 – 13 July 1884) was an English cricketer who played in first-class cricket matches for Nottinghamshire, Cambridge University and amateur sides between 1845 and 1847. He was born in Leicester and died in Bournemouth, then in Hampshire, now Dorset.", "link_mentions": [{"page": "Richard Seddon", "response": ["Seddon moved to New Zealand's West Coast in 1866. Initially, he worked the goldfields in Waimea. He is believed to have prospered here, and he returned briefly to Melbourne to marry Louisa. He established a store, and then expanded his business to include the sale of alcohol, becoming a publican. He was followed to the West Coast by his older sister Phoebe, younger brothers Edward and Jim and younger sister Mary. Phoebe married William Cunliffe on 9 May 1863 at Holy Trinity Church Eccleston. Their son Bill was Labour MP David Cunliffe's grandfather, making Richard Seddon David Cunliffe's great-great-uncle.", "Although Chinese immigrants were invited to New Zealand by the Dunedin Chamber of Commerce, prejudice against them quickly led to calls for restrictions on immigration. Following the example of anti-Chinese poll taxes enacted by California in 1852 and by Australian states in the 1850s, 1860s and 1870s, John Hall's government passed the Chinese Immigration Act 1881. This imposed a £10 tax per Chinese person entering New Zealand, and permitted only one Chinese immigrant for every 10 tons of cargo. Richard Seddon's government increased the tax to £100 per head in 1896 ($20,990 in modern New Zealand dollars), and tightened the other restriction to only one Chinese immigrant for every 200 tons of cargo.", "Richard Seddon was an Anglican.", "A statue of Seddon is located outside Parliament Buildings in Wellington, and another has a prominent position in the West Coast town of Hokitika. A town in New Zealand and a suburb of Melbourne, Australia are named after him. Wellington Zoo was originally created when a young lion was presented to Prime Minister Richard Seddon by the Bostock and Wombwell Circus. Seddon created the Zoo from this single specimen and the lion was later named King Dick in the Prime Minister's honour. The stuffed body of King Dick (the lion) is displayed on the ground floor of the Museum of Wellington City & Sea. St Mary's Church in Addington, Christchurch also has a memorial bell tower to Richard Seddon.", "*Sketch of Richard Seddon asleep in Parliament during an all-night sitting, 1898"]}, {"page": "List of English cricketers (1841–1850)", "response": ["|Richard Seddon"]}]}}