{"wiki_id": "http://www.wikidata.org/entity/Q2898341", "itemLabel": "Bernard Moffatt", "itemDescription": "Manx politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernard_Moffatt", "wikipedia_page": {"main": "Bernard Moffatt (born April 1946) is a Manx nationalist who was born in Peel, Isle of Man. Both his mother (Millie Cashin) and father (James Moffatt) were Manx. He was educated at Peel Clothworkers School, where Manx dancing classes at the School were organised by Mona Douglas, an icon of the Manx cultural revival. Moffatt was enrolled in one of those teams.\n\n\"I'm now a fully committed Manx Nationalist\" he said, and the start of this was the emphasis placed at school on Manx history art and culture. \"We used to have Mona Douglas round to talk to us – and I was in the Manx folk dancing team\".\nIn his youth Moffatt came to know several significant figures (all from the west of the island) on the Manx nationalist and language scene (the brothers Walter and Leslie Quirk, Jack Irving and Alfie Cooil), although at that time there was no official Nationalist Party.", "link_mentions": [{"page": "Peel, Isle of Man", "response": ["* Bernard Moffatt (born in Peel 1946) Founder member of Mec Vannin, the Manx Nationalist Party and Trade Union official."]}, {"page": "Mec Vannin", "response": ["* President: Bernard Moffatt"]}, {"page": "Celtic League", "response": [":Bernard Moffatt: (1984–88), M"]}, {"page": "Moffat (surname)", "response": ["* Bernard Moffatt, Manx political campaigner and trade unionist"]}, {"page": "J. Bernard Moffat", "response": ["#REDIRECT Bernard Moffatt"]}, {"page": "Bernard Moffat", "response": ["#REDIRECT Bernard Moffatt"]}, {"page": "Doug Fargher", "response": ["In 1962, along with fellow Manx speakers Lewis Crellin and Bernard Moffatt, Fargher was one of the first members of Mec Vannin, a small political party aimed at gaining full independence and establishing the Isle of Man as an independent sovereign state.Kermitt, Markys y (January 2017). \"Laa Cooinaghtyn Illiam Dhone Oraid Ghaelgagh 2017\" (PDF). Yn Pabyr Seyr. No. 55. p. 5. Retrieved 19 July 2020. He described the early 1960s as a period of \"great reawakening of national consciousness\" and he believed that the language should be the basis of this new nationalist movement. He believed that the Manx people (like the other Celtic nations) had an \"inferiority complex about their own nationality and their language\" and noted that the greatest enthusiasts for Manx Independence were Manx speakers."]}]}}