{"wiki_id": "http://www.wikidata.org/entity/Q28946006", "itemLabel": "Clement Cottrell", "itemDescription": "British cricketer (1854-1897)", "wikipedia_url": "https://en.wikipedia.org/wiki/Clement_Cottrell", "wikipedia_page": {"main": "Clement Edward Cottrell (28 May 1854 – 21 January 1897) was an English first-class cricketer active – who played for Middlesex. He was born in Westminster; worked in the London Stock Exchange; died in Brighton.", "link_mentions": [{"page": "List of diplomats of the United Kingdom to the Grand Duchy of Tuscany", "response": ["*:1670: Clement Cottrell Special Ambassador"]}, {"page": "Clement Cotterell", "response": ["* Clement Cottrell-Dormer (1686–1758), English courtier and antiquary", "* Clement Cottrell (1854–1897), English cricketer"]}, {"page": "List of Marylebone Cricket Club players (1864–1894)", "response": ["* Clement Cottrell (1877–1883) : C. E. Cottrell (Middlesex)"]}, {"page": "William Heale", "response": ["Heale was born at Hemel Hempstead in April 1859. He was educated at Harrow School, before going up to Balliol College, Oxford. While studying at Oxford, he made a single appearance in first-class cricket for Oxford University against Middlesex at Lord's in 1881. Batting twice in the match, he was dismissed for a single run by George Burton in the Oxford first-innings, while in their second-innings he was dismissed for 9 runs by Clement Cottrell. After graduating in 1883, he was ordained in the Church of England. He was the curate of Gamlingay from 1884–87 and the curate of a church at Walsall from 1887–92. His first role as a vicar was at the Holy Trinity Church in North Kensington from 1892–95. Heale played minor counties cricket for Hertfordshire in 1895, making three appearances in the Minor Counties Championship. He returned to being a curate at Hartshill, Staffordshire from 1891–1900, before serving as the vicar of Wolstanton from 1900–06 and Penn from 1906 until his death at Lambeth in April 1907."]}]}}