{"wiki_id": "http://www.wikidata.org/entity/Q28963706", "itemLabel": "Robert Awdry", "itemDescription": "English cricketer and councillor (1881-1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Awdry", "wikipedia_page": {"main": "Robert Awdry  (20 May 1881 – 3 February 1949) was an English cricketer who later became chairman of Wiltshire County Council. He played nine first-class matches for Oxford University Cricket Club between 1902 and 1904.The third son of Charles Awdry of Shaw Hill House, Melksham, and afterwards of the Manor, Littleton Panell, he was educated at Winchester College and New College, Oxford. He served in the Royal Wiltshire Yeomanry through World War I, and after the war rose to the rank of lieutenant colonel commanding the regiment.He was High Sheriff of Wiltshire in 1928. He was a member of Wiltshire County Council 1919–49 and its chairman 1946–49. He was appointed CBE in the 1946 New Year Honours in recognition of his role as chairman of the council's Emergency Committee.Awdry was captain of Wiltshire County Cricket Club for several years, and served as President and later Chairman of Wiltshire Archaeological and Natural History Society from 1939 until his death.Awdrey married Olive Muriel Tosswill in 1913 and they had one daughter. In 1920, Olive was appointed MBE for services to Wiltshire Women's County Agricultural Committee. Awdry had Hawkswell House built at Little Cheverell, Wiltshire around 1914–1920, and lived there until 1941.", "link_mentions": [{"page": "Awdry", "response": ["*Robert Awdry (1881–1949), English cricketer, British Army officer, High Sheriff of Wiltshire"]}, {"page": "Little Cheverell", "response": ["Hawkswell House, south of the church, was built in brick in 1914–1920 for Robert Awdry, to designs of Arthur Campbell Martin (who also designed additions to Dauntsey's School, West Lavington). Awdry, a cricketer and county councillor who was chairman of Wiltshire County Council from 1946 to 1949, lived here until the house was commandeered by the War Office in 1941."]}, {"page": "Wiltshire County Council", "response": ["*Robert Awdry, Chairman 1946–1949"]}, {"page": "West Lavington, Wiltshire", "response": ["Littleton Pannell manor passed through many hands, including the 1st Earl of Abingdon in 1688 and William, Earl of Radnor in 1771. By 1903, the principal landowner in the area was Charles Awdry, a partner in W. H. Smith & Son, and the father of Robert Awdry who was chairman of Wiltshire County Council in the 1940s."]}, {"page": "Wiltshire County Cricket Club", "response": ["Miller was succeeded as captain by Robert Awdry, who had played first-class cricket for Oxford University through 1902–04.  Awdry led the side until 1934 and the next captain from 1935 to 1939 was William Lovell-Hewitt, who made 3 first-class appearances for the Minor Counties through 1938–39."]}, {"page": "Wiltshire Archaeological and Natural History Society", "response": ["* Robert Awdry – President 1936–1946, Chairman until his death in 1949"]}, {"page": "John Moberly", "response": ["Moberly's nephew Robert Awdry played first-class cricket for Oxford University."]}, {"page": "William Lovell-Hewitt", "response": ["Lovell-Hewitt made his debut in minor counties cricket for Wiltshire against Glamorgan in the 1920 Minor Counties Championship. He was a regular feature in the Wiltshire team throughout the 1920s, and by 1935 he had assumed the captaincy from Robert Awdry. Lovell-Hewitt captained the county until 1939, by which point he had appeared in 98 Minor Counties Championship matches. Lovell-Hewitt made three appearances in first-class cricket, all for a combined Minor Counties team, debuting against Oxford University in 1938, before making a second appearance against the same opposition in 1939, as well as appearing against the touring West Indians in that season. Lovell-Hewitt scored 175 runs in his three first-class appearances, averaging 35.00, and top-scoring with 92. This score came against Oxford University in 1939, with him also making a second half century in the match with 69. He captained the Minor Counties in all three of his matches."]}, {"page": "Awdry, Robert", "response": ["#redirectRobert Awdry"]}]}}