{"wiki_id": "http://www.wikidata.org/entity/Q28924292", "itemLabel": "George Field", "itemDescription": "British cricketer (1834-1901)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Field_(Kent_cricketer)", "wikipedia_page": {"main": "George Hanbury Field (1 March 1834 – 24 July 1901) was an English cricketer. He played five first-class matches between 1856 and 1859.\n\n", "link_mentions": [{"page": "George Field", "response": ["George Field or Fields may refer to:", "* George Field (chemist) (1777–1854), English chemist", "* George Field (actor) (1877–1925), American silent film actor", "* George Field (Kent cricketer) (1834–1901), English cricketer", "* George Field (Oxford University cricketer) (1871–1942), English cricketer", "* George Fields (baseball) (1852–1933), American professional baseball player", "* George Fields (American football) (born 1935/36), American football player", "* George Field, Illinois, a World War II United States Army Air Forces training base"]}, {"page": "George Field (cricketer, born 1834)", "response": ["#REDIRECTGeorge Field (Kent cricketer)"]}, {"page": "Barclay Field", "response": ["The son of George Field, he was born at Clapham in April 1835. He was educated at Eton College, before going up to University College, Oxford. Field played first-class cricket for the Marylebone Cricket Club (MCC) against Cambridge University at Fenner's in 1861. Batting twice in the match, he was unbeaten without scoring in the MCC first innings, while in their second innings he was dismissed for 17 runs by Herbert Salter. By profession he was in business in London and was a justice of the peace for Kent.The funeral of the late Mr Barclay Field. J P., of Lees, Otford. Kent and Sussex Courier. 18 November 1892. p. 6 Field died following a stroke and subsequent short illness in November 1892, at his lodge in Otford, Kent.Deaths. Canterbury Journal, Kentish Times and Farmers' Gazette. 12 November 1892. p. 8Death of Mr Barclay Field. Field. 12 November 1892. p. 46 His brother, George, was also a first-class cricketer."]}]}}