{"wiki_id": "http://www.wikidata.org/entity/Q2898210", "itemLabel": "Bernard Leach", "itemDescription": "absolute half sender (1887-1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernard_Leach", "wikipedia_page": {"main": "Bernard Howell Leach  (5 January 1887 – 6 May 1979), was a British studio potter and art teacher. He is regarded as the \"Father of British studio pottery\".", "link_mentions": [{"page": "British Museum", "response": ["* Moon jar from the Joseon Dynasty collected by the potter Bernard Leach, Korea, (18th century AD)"]}, {"page": "Cornwall", "response": ["Since the 19th century, Cornwall, with its unspoilt maritime scenery and strong light, has sustained a vibrant visual art scene of international renown. Artistic activity within Cornwall was initially centred on the art-colony of Newlyn, most active at the turn of the 20th century. This Newlyn School is associated with the names of Stanhope Forbes, Elizabeth Forbes, Norman Garstin and Lamorna Birch. Modernist writers such as D. H. Lawrence and Virginia Woolf lived in Cornwall between the wars, and Ben Nicholson, the painter, having visited in the 1920s came to live in St Ives with his then wife, the sculptor Barbara Hepworth, at the outbreak of the Second World War. They were later joined by the Russian emigrant Naum Gabo, and other artists. These included Peter Lanyon, Terry Frost, Patrick Heron, Bryan Wynter and Roger Hilton. St Ives also houses the Leach Pottery, where Bernard Leach, and his followers championed Japanese inspired studio pottery. Much of this modernist work can be seen in Tate St Ives. The Newlyn Society and Penwith Society of Arts continue to be active, and contemporary visual art is documented in a dedicated online journal."]}, {"page": "Raku ware", "response": ["Bernard Leach is credited with bringing Raku to the west. In 1911 he attended a garden party in Tokyo which included a traditional tea ceremony and Raku firing. This was his first experience of ceramics. Although he continued to experiment with Raku firing for a few years following his return to England in 1920 - the technique was largely forgotten after the 1930s. "]}, {"page": "Arts and Crafts movement", "response": ["The British artist potter Bernard Leach brought to England many ideas he had developed in Japan with the social critic Yanagi Soetsu about the moral and social value of simple crafts; both were enthusiastic readers of Ruskin. Leach was an active propagandist for these ideas, which struck a chord with practitioners of the crafts in the inter-war years, and he expounded them in A Potter's Book, published in 1940, which denounced industrial society in terms as vehement as those of Ruskin and Morris. Thus the Arts and Crafts philosophy was perpetuated among British craft workers in the 1950s and 1960s, long after the demise of the Arts and Crafts movement and at the high tide of Modernism. British Utility furniture of the 1940s also derived from Arts and Crafts principles.Designing Britain  One of its main promoters, Gordon Russell, chairman of the Utility Furniture Design Panel, was imbued with Arts and Crafts ideas. He manufactured furniture in the Cotswold Hills, a region of Arts and Crafts furniture-making since Ashbee, and he was a member of the Arts and Crafts Exhibition Society. William Morris's biographer, Fiona MacCarthy, detected the Arts and Crafts philosophy even behind the Festival of Britain (1951), the work of the designer Terence Conran (b. 1931) and the founding of the British Crafts Council in the 1970s."]}, {"page": "Victoria and Albert Museum", "response": ["Many famous potters, such as Josiah Wedgwood, William De Morgan and Bernard Leach as well as Mintons & Royal Doulton are represented in the collection. There is an extensive collection of Delftware produced in both Britain and Holland, which includes a circa 1695 flower pyramid over a metre in height. Bernard Palissy has several examples of his work in the collection including dishes, jugs and candlesticks. The largest objects in the collection are a series of elaborately ornamented ceramic stoves from the 16th and 17th centuries, made in Germany and Switzerland. There is an unrivalled collection of Italian maiolica and lustreware from Spain. The collection of Iznik pottery from Turkey is the largest in the world."]}, {"page": "St Ives, Cornwall", "response": ["J. M. W. Turner arrived in St. Ives in 1811. Bernard Leach and Shōji Hamada set up the Leach Pottery in 1920. Leach who, was a studio potter and art teacherCortazzi, Hugh. \"Review of Emmanuel Cooper's Bernard Leach Life & Work.  Japan Society (UK). and is known as the \"Father of British studio pottery\", learned pottery under the direction of Shigekichi Urano (Kenzan VI) in Japan where he also met Shōji Hamada. They promoted pottery from the point of view of Western and Eastern arts and philosophies. Leach produced work until 1972, and the Victoria and Albert Museum held an exhibition of his work in 1977. The Leach Pottery remains operational and houses a small museum showcasing work by Leach and his students.Leach Pottery website, http://www.leachpottery.com/, last examined Aug 2011"]}, {"page": "Barbara Hepworth", "response": ["Hepworth lived in Trewyn Studios in St Ives from 1949 until her death in 1975. Trewyn Studios had once been an outbuilding of Trewyn House, later purchased by her pupil and assistant John Milne in 1956.\"John Milne. Credo 1974. The Tate Gallery\" She said that \"Finding Trewyn Studio was sort of magic. Here was a studio, a yard, and garden where I could work in open air and space.\" St Ives had become a refuge for many artists during the war. On 8 February 1949, Hepworth and Nicholson co-founded the Penwith Society of Arts at the Castle Inn; 19 artists were founding members, including Peter Lanyon and Bernard Leach."]}, {"page": "Wabi-sabi", "response": [" concepts historically had extreme importance in the development of Western studio pottery; Bernard Leach (1887–1979) was deeply influenced by Japanese aesthetics and techniques, which is evident in his foundational book \"A Potter's Book\"."]}, {"page": "1940 in literature", "response": ["*Bernard Leach – A Potter's Book"]}, {"page": "List of Baháʼís", "response": ["* Bernard LeachWeinberg, Robert (ed.) (1999). Spinning the Clay into Stars: Bernard Leach and the Baháʼí Faith, pp. 21 & 29. George Ronald, Oxford.  - potter"]}, {"page": "Ogata Kenzan", "response": ["Bernard Leach, the British studio potter, wrote a book about Ogata Kenzan in 1966 entitled Kenzan and his Tradition, published by Faber & Faber in London."]}, {"page": "Abiko, Chiba", "response": ["The area around Abiko has been inhabited since Japanese Paleolithic times, and archaeologists have found stone tools dated from 30,000 years ago. During the Edo period, Abiko was a river port on the Tone River and a post station on the Mito Kaidō, a highway connecting Edo with Mito. After the Meiji Restoration, Abiko Town was created in Minamisoma District, Chiba Prefecture on April 1, 1889, along with the town of Fusa and village of Kohoku with the establishment of the modern municipalities system. Abiko was transferred to Higashikatsushika District in 1897. From the Taisho period to the early Showa period, Abiko was sometimes called \"Kamakura in the north\" as many prominent cultural figures such as Naoya Shiga, Saneatsu Mushanokoji, Soetsu Yanagi, and Bernard Leach had villas in the town, which became a center for the Shirakabaha literary coterie. On November 1, 1954, it annexed neighboring Tomise village from the same district. On April 29, 1955, Abiko annexed Fusa Town and Kohoku Village. Abiko achieved city status on July 1, 1970. In 2003, a proposal to merge Abiko with neighboring city of Kashiwa and the town of Shōnan was defeated by a public referendum.  Parts of the city were damaged by soil liquefaction due to the 2011 Tōhoku earthquake and tsunami."]}, {"page": "Mark Tobey", "response": ["In 1929, he participated in a show that marked a change in his life: a solo exhibition at Romany Marie's Cafe Gallery in New York.  Alfred H. Barr, Jr., then a curator at the Museum of Modern Art (MoMA), saw the show and selected several pictures from it for inclusion in MoMA's 1930 exhibition: Painting and Sculpture by Living Americans. In 1931, Tobey became a resident artist of the Elmhurst Progressive School while teaching at Dartington Hall in Devon and painting frescoes for the school. He became a close friend of Bernard Leach, who was also on the faculty. Introduced by Tobey to the Baháʼí Faith, Leach  became a convert. During his stay in Devon, Tobey found time to travel to Mexico (1931), Europe, and Palestine (1932). In 1934, Tobey and Leach traveled together through France and Italy, then sailed from Naples to Hong Kong and Shanghai, where they parted company. Leach went on to Japan, while Tobey remained in Shanghai visiting his old friend, Teng Kuei, before departing for Japan. Japanese authorities confiscated and destroyed an edition of 31 drawings on wet paper that Tobey had brought with him from England to be published in Japan. No explanation for their destruction has been noted; possibly they considered his sketches of nude men pornographic. In early summer, he studied Hai-Ku poetry and calligraphy at a Zen monastery outside Kyoto before returning to Seattle in autumn."]}, {"page": "Japanese pottery and porcelain", "response": ["Japanese pottery strongly influenced British studio potter Bernard Leach (1887–1979), who is regarded as the \"Father of British studio pottery\". He lived in Japan from 1909 to 1920 during the Taishō era and became the leading western interpreter of Japanese pottery and in turn influenced a number of artists abroad.", "British artist Lucie Rie (1902–1995) was influenced by Japanese pottery and Bernard Leach, and was also appreciated in Japan with a number of exhibitions. British artist Edmund de Waal (b. 1964) studied Leach and spent a number of years in Japan studying mingei style. Brother Thomas Bezanson from Canada was influenced by it.https://metmuseum.org/art/collection/search/485959"]}, {"page": "Alfred Wallis", "response": ["Through Nicholson and Wood, Wallis was introduced to Jim Ede who promoted his work in London. Despite this attention, Wallis sold few paintings and continued to live in poverty until he died in the Madron workhouse near Penzance. He is buried in Barnoon cemetery, overlooking St Ives Porthmeor beach and the Tate St Ives gallery. An elaborate gravestone, made from tiles by the potter Bernard Leach and depicting a tiny mariner at the foot of a huge lighthouse – a popular motif in Wallis's paintings – covers the tomb."]}, {"page": "Ethical pot", "response": ["The term \"ethical pot\" was coined by Oliver Watson in his book Studio Pottery: Twentieth Century British Ceramics in the Victoria and Albert Museum to describe a 20th-century trend in studio pottery that favoured plain, utilitarian ceramics. Watson said that the ethical pot,\"lovingly made in the correct way and with the correct attitude, would contain a spiritual and moral dimension.\" Its leading proponents were Bernard Leach and a more controversial group of post-war British studio potters.Collecting Ceramics They were theoretically opposed to the expressive pots or fine art pots of potters such as William Staite Murray, Lucie Rie and Hans Coper. ", "The ethical pot theory and style was popularized by Bernard Leach in A Potter's Book (1940).Adelaide Review He expanded the theories that ethical pots should be utilitarian, \"naturally shaped\" and originally as conceived should derive from \"Oriental forms that transcended mere good looks.\" Leach had previously spent considerable time in Japan studying eastern crafts and mingei. His ethical pot idea was a rough interpretation of mingei for the western world; he advocated simplicity (ideally the best pots are so quick to make that they could be \"thrown before breakfast\"), and pots made to look natural and hand crafted. Soetsu Yanagi, a leading figure in the mingei movement, said that a craft object \"must be made by an anonymous craftsman or woman and therefore unsigned; it must be functional, simple, and have no excess ornamentation; it must be one of many similar pieces and must be inexpensive; it must be unsophisticated; it must reflect the region it was made in; and it must be made by hand.\"Transcript of Yanagi's talk at the first International Conference of Potters and Weavers, Darlington Hall, Devon, England, 1952", "The potters apprenticed to Bernard Leach include: Michael Cardew, Katherine Pleydell-Bouverie, Norah Braden, David Leach and Michael Leach (his sons), William Marshall, Kenneth Quick and Richard Batterham. His American apprentices included: Warren MacKenzie, Byron Temple, Clary Illian and Jeff Oestrich. He was a major influence on the leading New Zealand potter Len Castle, and they had worked together in the mid-1950s. Through his son David, Bernard was the main influence on the work of the Australian potter Ian Sprague."]}, {"page": "Television South West", "response": ["TSW also specialised in making relatively highbrow programmes for the region; in the arts world, it produced documentaries showcasing amongst others, leading concert pianist Moura Lympany, potter Bernard Leach, and sculptor Barbara Hepworth."]}, {"page": "Mashiko, Tochigi", "response": ["*  St Ives, Cornwall, UK (since 2012, in recognition of the Leach Pottery in St Ives of Bernard Leach and Shoji Hamada)"]}, {"page": "List of people from Cornwall", "response": ["*Bernard Leach, potter who set up a studio pottery in St Ives in the 1920s", "* Janet Leach, potter, wife of Bernard Leach", "* William Marshall, potter for Bernard Leach "]}, {"page": "Slade School of Fine Art", "response": ["* Bernard Leach (1887–1879), ceramic artist, \"Father of British studio pottery\""]}, {"page": "1920 in art", "response": ["** Bernard Leach and Shoji Hamada set up the Leach Pottery in St Ives, Cornwall."]}, {"page": "Japan–United Kingdom relations", "response": ["*Bernard Leach - An influential Potter whose formative years were spent in Japan"]}, {"page": "Troika Pottery", "response": ["Troika was set up in February 1962 by Leslie Illsley, Jan Thompson and Benny Sirota who took over the Powell and Wells Pottery at Wheal Dream, St Ives, Cornwall, where Benny Sirota had previously worked. They wanted to pursue their vision of pottery as art, without regard to function. This ran counter to the aims of much of the studio pottery movement at the time, as epitomised by the work of Bernard Leach. They initially relied on the ceramics of Leslie's wife, Caroline (Kingston School of Art). This included the novel double egg cup.Photograph shows sign at 1 Island Road St Ives where Caroline's mother lived"]}, {"page": "Order of the Sacred Treasure", "response": ["* Bernard Leach (1887–1979) "]}, {"page": "Ethel Mairet", "response": ["In 1921 Bernard Leach and Shoji Hamada visited Mairet at Gospels."]}, {"page": "Salt glaze pottery", "response": ["During the 20th century, the technique was promoted for studio pottery use by Bernard Leach. In the 1950s, it was introduced into Japanese craft pottery through Leach's association with Shōji Hamada. Don Reitz introduced salt glazing into the curriculum at Alfred University in New York in 1959, and it subsequently spread to other American universities with ceramic art programs."]}, {"page": "Slipware", "response": ["Later potters mostly combined or replaced the use of slip with ceramic glazes and pigments offering a tougher finish and a wider range of colours.  But a variety of slipware techniques were revived by various studio pottery movements from the 19th century on. In England Bernard Leach and in America Mary Louise McLaughlin were among the leaders of these revivals.Osborne, 747"]}, {"page": "Lotherton Hall", "response": ["Lotherton Hall houses a small collection of modern craft studio pottery, including works by significant potters such as Alison Britton, Michael Cardew, Michael Casson, Joanna Constantinidis, Hans Coper, Elizabeth Fritsch, T.S. Haile, Bernard Leach, Janet Leach, Lucy Rie and Sutton Taylor.Wells-Cole, A. 1980. Fifty years of new ceramics in Leeds. Leeds Arts Calendar, No.87, pp.21–30. https://leedsartfund.org/files/calendar/No%20-%20%2087%201980.pdf. Retrieved 9 July 2020."]}, {"page": "Warren MacKenzie", "response": ["MacKenzie and his first wife, Alix, studied with Bernard Leach from 1949 to 1952.  His simple, wheel-thrown functional pottery is heavily influenced by the aesthetic of Shoji Hamada and Korean ceramics.  He is credited with bringing the Japanese Mingei style of pottery to Minnesota, fondly referred to as the \"Mingei-sota style.\""]}, {"page": "Patrick Heron", "response": ["Registered as a conscientious objector in World War II, Heron worked as an agricultural labourer in Cambridgeshire before he was signed off for ill health. He returned to Cornwall to work for Bernard Leach at the Leach Pottery, St Ives, in 1944–45. During this time, he met many leading artists of the St Ives School, including Barbara Hepworth and Ben Nicholson. Reacquainted with Cornwall, Heron spent each summer there until it became his permanent home in 1956 after his purchase and refurbishment of Eagles Nest the year before from Mark Arnold-Forster, a house Heron had lived in during his childhood. He spent the rest of his life here, until he died at home in March 1999."]}, {"page": "Cornish people", "response": ["Celtic crosses, many dating from between the 7th and 15th centuries, are found in Cornwall and have been used as inspiration in modern and contemporary Cornish visual arts. In the 1780s, John Opie was the first Cornish-born painter to gain widespread attention; his work was exhibited at the Royal Academy and he was described by Joshua Reynolds as \"like Caravaggio and Velázquez in one\". Artists who appreciated the quality of Cornwall's natural light, such as J. M. W. Turner, began to visit, with more following after the opening of the Great Western Railway, including Whistler and Sickert. Stanhope Forbes and Frank Bramley settled in Cornwall in the 1880s, establishing the Newlyn School of painting en plein air. By the 1920s, the ceramicist Bernard Leach was established at St Ives, and the St Ives School for abstract artists formed there, influenced by naive painters such as Alfred Wallis, and involving the work of Ben Nicholson, his wife Barbara Hepworth, Naum Gabo and Patrick Heron."]}, {"page": "Bernard Howell Leach", "response": ["#redirectBernard Leach"]}, {"page": "Leach, Bernard Howell", "response": ["#REDIRECTBernard Leach"]}, {"page": "Len Castle", "response": ["Castle's first experience of pottery was as a 10-year-old, seeing Olive Jones demonstrating at the Auckland Easter Show. Castle began making his first pottery in 1947 and took night classes with Robert Nettleton Field at Avondale College, Auckland. In 1956, he moved to St Ives, Cornwall for a year to work with Bernard Leach and became a full-time potter in 1963. The same year he helped establish the New Zealand Society of Potters."]}, {"page": "Shōji Hamada", "response": ["Hamada was deeply impressed by a Tokyo exhibition of ceramic art by Bernard Leach, who was then staying with Yanagi Sōetsu, and wrote to Leach seeking an introduction. The two found much in common and became good friends, so much so that Hamada asked and was granted permission to accompany Leach to England in 1920 when the latter decided to return and establish a pottery there.", "Having spent three years in St Ives with Bernard Leach, he returned to Japan in 1923 and traveled to potteries and stayed at Tsuboya in Okinawa Prefecture for weeks, then eventually established his workshop in Mashiko, about  north-east of Tokyo. Here, he built his own pottery and committed himself to using only locally sourced materials, not only in the clay he used, but also the glazes he created and  the brushes he manufactured himself from dog hair and bamboo.", "*Held between 17 January-25 April 1993. Works exhibited also included by Howard Kottler, Bernard Leach, Harrison McIntosh, Paul Soldner, Peter Voulkos, Beatrice Wood, Robert Arneson, and F. Carlton Ball. ", "*Exhibition lasted between 15 September-14 October 1995, with works of  Bernard Leach, Shoji Hamada, Warren MacKenzie, Shimaoka Tatsuzō, Randy Johnston, and Matsuzaki Ken.", "* The art of the potter. [Motion picture] / Sidney Reichman and David Outerbridge. New York : Phoenix Films, 1977. 2 reels, 50 mins: sd., col.; 16 mm.Presents the work of English potter Bernard Leach and Japanese potter Shōji Hamada. Shows each potter demonstrating and discussing his craft, beginning with the digging of clay through its firing in a kiln."]}, {"page": "Studio pottery", "response": ["Leading trends in British studio pottery in the 20th century are represented by Bernard Leach, William Staite Murray, Waistel Cooper, Dora Billington, Lucie Rie and Hans Coper.", "Originally trained as a fine artist, Bernard Leach (1887–1979) established a style of pottery, the ethical pot, strongly influenced by Chinese, Korean, Japanese and medieval English forms. After briefly experimenting with earthenware, he turned to stoneware fired to high temperatures in large oil- or wood-burning kilns. This style dominated British studio pottery in the mid-20th century. Leach's influence was disseminated by his writings, in particular A Potter's BookLeach, Bernard. A Potter's Book, Faber and Faber, 1988.  and the apprentice system he ran at his pottery in St Ives, Cornwall, through which many notable studio potters passed. A Potter's Book espoused an anti-industrial, Arts and Crafts ethos, which persists in British studio pottery. Leach taught intermittently at Dartington Hall, Devon from the 1930s."]}, {"page": "Ohara Museum of Art", "response": ["In 1961 a wing was added for acquired Japanese paintings of the first half of the 20th century: Fujishima Takeji, Aoki Shigeru, Kishida Ryūsei, Koide Tarushige and others. In the same year, a wing for potteries of Kawai Kanjirō, Bernard Leach, Hamada Shōji, Tomimoto Kenkichi and others was opened. 1963 a wing was added for the woodcuts of Munakata Shikō and dyeings of Serisawa Keisuke. Today the last two wings are combined as Crafts Wing (Kōgei-kan). 1972 the Kojima Torajirō Memorial Hall was opened at the Ivory Square of Kurashiki."]}, {"page": "Women artists", "response": ["Leading trends in British studio pottery in the 20th century are represented by both men and women: Bernard Leach, William Staite Murray, Dora Billington, Lucie Rie and Hans Coper. Leach (1887–1979) established a style of pottery, the ethical pot, strongly influenced by Chinese, Korean, Japanese and medieval English forms. His style dominated British studio pottery in the mid-20th century. Leach's influence was disseminated in particular by his A Potter's BookLeach, Bernard. A Potter’s Book, Faber and Faber, 1988.  and the apprentice system he ran at his pottery in St Ives, Cornwall."]}, {"page": "Lucie Rie", "response": ["Rie was a friend of Bernard Leach, one of the leading figures in British studio pottery in the mid-20th century, and she was impressed by his views, especially concerning the \"completeness\" of a pot. But despite his transient influence, her brightly coloured, delicate, modernist pottery stands apart from Leach's subdued, rustic, oriental work. She taught at Camberwell College of Arts from 1960 until 1972."]}, {"page": "Wilhelmina Barns-Graham", "response": ["After her education Barns-Graham made study trips to Paris, London and St Tropez before moving to St Ives, Cornwall in 1940 at the suggestion of the Edinburgh College of Art's Principal Hubert Wellington. Barns-Graham moved near to where a group of modernist artists had settled, at Carbis Bay. This was a pivotal moment in her life. On one of her first evenings there she met the sculptor Barbara Hepworth who made an immediate and lasting impression on her she then went on to meet Borlase Smart, Alfred Wallis and Bernard Leach, as well as the painter Ben Nicholson and the sculptors Naum Gabo and Margaret Mellis. After two weeks in St Ives, Barns-Graham acquired her first studio, directly below the Porthmeor Gallery which was the administrative headquarters of the St Ives Society of Artists. Her paintings at the time were heavily influenced by the Cornish landscapes and the St Ives harbour. During 1940 and 1941 Barns-Graham contributed to the war effort by volunteering in a factory making camouflage nets however using the rough materials gave her dermatitis so she had to give up the work, instead knitting string vests and socks."]}, {"page": "Falmouth University", "response": ["Encouragement came to try again from Dame Barbara Hepworth, Bernard Leach, Patrick Heron and Bryan Wynter in 1964. In 1965, the momentous day arrived when the NACAE overturned its earlier verdict, following a reassessment of the School by the chairman and Vice Chancellor of the NACAE, and the Principal of the Royal College of Art (RCA). The School was now recognized as a centre for the Diploma in Art & Design, with Painting as a main course. Recognition for sculpture was to follow shortly. There were now 40 full-time students at the School, with a remit to expand to at least 100 students, but such expansion could only come about with a major building programme and the purchase of yet more land.", "At this time, the School offered a pre-diploma (the precursor of our modern-day Foundation programme), a Diploma in Art & Design (DipAD) which superseded the National Design Diploma (NDD), and entrance examinations for postgraduate art and design institutions such as the RCA and the Slade. Design became an important aspect of the School's curricula, with Patrick Heron teaching two-dimensional design, and Dame Barbara Hepworth and Bernard Leach teaching three-dimensional design. Photography appeared in the college's academic portfolio for the first time in 1963. The number of teaching staff at the School had risen from six in the 1940s to 25 in the 1960s."]}, {"page": "Bennett Bean", "response": ["Bean's influences have included Japanese pottery, Native American pottery, English pottery in the tradition of Bernard Leach, and modern American pottery, including the work of George Ohr.  "]}, {"page": "Kōtarō Takamura", "response": ["Takamura was the eldest son of Japanese sculptor Takamura Kōun. He graduated from the Tokyo School of Fine Arts in 1902, where he studied sculpture and oil painting. He studied in New York, at the Art Students League of New York City in 1906. While in New York, Takamura studied under the well known sculptor Gutzon Borglum. Takamura's time spent in America was difficult, and had great impact on his sculpture work and literary work. Takamura additionally studied in London in 1907, where he met his best friend Bernard Leach. After finishing his studies in Paris in 1908, he returned to Japan in 1909A Brief History of Imbecility, Hiroaki Sato, University of Hawaii Press, 1992, xv-xvi and lived there for the rest of his life. His sculptural work shows strong influence both from Western work (especially Auguste Rodin, whom he idolized) and from the Shirakabaha society. Takamura dedicated his artwork style to separating itself from the traditional Japanese style of art. Takamura and other artist were seen as leaders of a revolution in Japanese artwork. "]}, {"page": "Leach Pottery", "response": ["The Leach Pottery was founded in 1920 by Bernard Leach and Shoji Hamada in St Ives, Cornwall, in the United Kingdom.", "The site was renovated and restored in 2005-08 before being reopened to the public in March 2008 as a working studio pottery, museum and gallery. The restoration cost £1.7 million which preserved the original buildings whilst adding an exhibition space and shop. It is now managed by the Bernard Leach (St Ives) Trust Limited, a registered UK charity founded in 2005.", "There are two exhibition areas, the Entrance Gallery with work by Bernard Leach, Janet Leach, David Leach, Shoji Hamada, William Marshall, Michael Cardew, and Kenneth Quick and the Cube Gallery with a changing exhibition."]}]}}