{"wiki_id": "http://www.wikidata.org/entity/Q2907874", "itemLabel": "Bob Willis", "itemDescription": "English cricketer (1949-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bob_Willis", "wikipedia_page": {"main": "Robert George Dylan Willis  (born Robert George Willis; 30 May 1949 – 4 December 2019) was an English cricketer, who represented England between 1971 to 1984. A right-handed fast bowler Willis is regarded as one of the greatest fast bowler of all time.He is England's fourth-highest wicket-taker as of 2019, behind James Anderson, Stuart Broad and Ian Botham. Willis took 899 first-class wickets overall, although from 1975 onwards he bowled with constant pain, having had surgery on both knees. He nevertheless continued to find success, taking a Test career-best eight wickets for 43 runs in the 1981 Ashes series against Australia, one of the all-time best Test bowling performances. He was a Wisden Cricketer of the Year for 1978.In addition to the Test arena, Willis played 64 One Day International matches for his country, taking 80 wickets, and was a prolific List-A (one-day) cricketer with 421 wickets overall at 20.18. As a tail-ender, Willis made little impression with the bat, with a top Test score of 28 not-out (*); however, he managed two half-centuries at first-class level, and for a time held a record number of Test not-outs. Willis captained the England team in 18 Tests and 28 ODI matches between June 1982 and March 1984. Under Willis's captaincy England won seven, lost five and drew six Tests, and won 16 of the ODIs. Botham recalled Willis as \"a tremendous trier.. a great team-man and an inspiration\", as well as the \"only world-class fast bowler in my time as an England player\". The editor of Wisden wrote of him in similar terms: \"His indomitable service to England is handsomely reflected in his great collection of Test wickets. Although often beset with aches and pains, he never spared himself when bowling for his country.\"Retiring in 1984 during a Test series against the West Indies, Willis found later work as a commentator with Sky Sports. He formed a noted commentary partnership with Botham; however, Willis' relatively low-key style, in contrast to Botham's ebullience, meant that from 2006 onwards Willis tended to be used as a second-string commentator. He remained an often-heard broadcaster, a published writer and an occasional critic of the modern game. On the occasion of England's 1000th Test in August 2018, he was named in the country's greatest Test XI by the ECB. The Bob Willis Trophy was established in the 2020 English cricket season in his honour. In June 2021, he was inducted into the ICC Cricket Hall of Fame as one of the special inductees to mark the inaugural edition of the ICC World Test Championship final.", "link_mentions": [{"page": "The Ashes", "response": ["Brearley retired from Test cricket in 1980 and was succeeded by Ian Botham, who started the 1981 series as England captain, by which time the WSC split had ended. After Australia took a 1–0 lead in the first two Tests, Botham was forced to resign or was sacked (depending on the source). Brearley surprisingly agreed to be reappointed before the Third Test at Headingley. This was a remarkable match in which Australia looked certain to take a 2–0 series lead after it had forced England to follow-on 227 runs behind. England, despite being 135 for 7, produced a second innings total of 356, Botham scoring 149*. Chasing just 130, Australia were sensationally dismissed for 111, Bob Willis taking 8–43. It was the first time since 1894–95 that a team following on had won a Test match. Under Brearley's leadership, England went on to win the next two matches before a drawn final match at The Oval.Harte, pp. 627–628."]}, {"page": "Ian Botham", "response": ["Botham made his Test début at Trent Bridge on 28 July 1977 in the third Test against Australia. His début was somewhat overshadowed by the return from self-imposed Test exile of Geoffrey Boycott. England went into the match with a 1–0 series lead having won the second Test after the first had been drawn. The series was played against the background of the so-called \"Packer Affair\" which resulted in the establishment of World Series Cricket in the next Australian season. Because of Tony Greig's involvement, he had been stripped of the England captaincy but remained in the team under new captain Mike Brearley. England had three all-rounders at Trent Bridge with Greig, Geoff Miller and Botham all playing. Australian captain Greg Chappell won the toss and decided to bat first. Australia scored 243 and were all out shortly before the close on day one. Botham, aged 21, made an immediate impact and took five for 74, the highlight being the wicket of Chappell, bowled for just 19. England batted all through day two and into day three as Boycott, in his first Test innings since 1974, and Knott both made centuries. Botham came in at number eight on day three and scored 25 before he was bowled by Max Walker. England were all out not long afterwards for 364, a first innings lead of 121. Botham had no joy in Australia's second innings with none for 60. A century by Rick McCosker enabled Australia to score 309 before they were all out in the evening session on day four. Bob Willis took five for 88. England needed 189 to win and completed the job, by seven wickets, well into the final day with Brearley scoring 81 and Boycott, who batted on all five days, 80 not out. Botham didn't get a second innings.", "England were in Pakistan from November 1977 to January 1978, playing three Tests and three LOIs. Botham was almost fully recovered from his foot injury but did not play in any of the Tests. He took part in all three LOIs and in some of the first-class matches against club teams. From January to March, England were in New Zealand for a three-match Test series under the captaincy of Geoff Boycott. Botham impressed in a first-class match against Canterbury at Lancaster Park, scoring 126 not out in the second innings against an attack including Richard Hadlee and was selected for the first Test at Basin Reserve. Botham had an indifferent game there and England, twice bowled out by Hadlee, lost by 72 runs. In the next match at Carisbrook against Otago, Botham achieved a 10wM with seven for 58 (his career best return to date) in the second innings, enabling the England XI to win by six wickets. England won the second Test at Lancaster Park by 174 runs after an outstanding all-round performance by Botham who scored 103 and 30 not out and took five for 73 and three for 38. He also held three catches. In the second innings, promoted up the order to get quick runs before an overnight declaration, he was responsible for calling for a risky run that led to the run-out dismissal of acting-captain Geoff Boycott: Botham's own published autobiography alleges that this was deliberately done, on the orders of acting vice-captain Bob Willis, because Boycott was scoring too slowly. The final Test was played at Eden Park and was drawn, the series ending 1–1. New Zealand batted first and totalled 315 with Geoff Howarth scoring 122. Botham took five for 109 in 34 overs. England replied with 429 all out (Clive Radley 158, Botham 53). New Zealand then chose to bat out time and Howarth scored his second century of the match (Botham none for 51). Botham's form in New Zealand cemented his place in the England team.", "Botham's first tour of Australia was in 1978–79. England, defending the Ashes they had regained in 1977, played six Tests under Mike Brearley's leadership. Australia had what was effectively \"a reserve team\" because their leading players were contracted to World Series Cricket for the season.Birley, p. 320. The difference in standard was evident on the first day of the first Test at the Gabba as Botham, Chris Old and Bob Willis bowled them out for only 116 in just 38 overs, England going on to win easily enough by seven wickets. Apart from a surprise defeat in the third Test, England were never troubled and won the series 5–1. Botham's performance in the series was satisfactory but there were no headlines and only modest averages. He took 23 wickets at 24.65 with a best return of four for 42. He scored 291 runs with a highest of 74 at 29.10. He held 11 catches.", "Botham continued to play for England under Brearley and achieved the highpoint of his career in the next three Tests as England recovered to win The Ashes. In the third Test at Headingley, Australia opened with 401 for 9 declared, despite good bowling by Botham who took 6 for 95. England responded poorly and were dismissed for 174. Botham was the only batsman to perform at all well and scored 50, which was his first Test half-century since he had been awarded the captaincy thirteen Tests earlier. Having been forced to follow-on, England collapsed again and at 135 for 7 on the afternoon of the fourth day, an innings defeat looked certain. Bookmakers had reportedly been offering odds of 500/1 against an England win after the follow-on was enforced. Botham, himself not long at the wicket, was the sole remaining recognised batsman as he was joined by the fast bowler Graham Dilley, number nine in the batting order, with only Chris Old and Bob Willis to come. With able support from Dilley (56) and Old (29), Botham hit out and by the close of play was 145 not out with Willis hanging on at the other end on 1 not out. England's lead was just 124 but there remained a glimmer of hope. On the final day's play, Botham reached 149 not out before Willis's wicket fell. Australia, with plenty of time remaining, needed 130 to win and were generally expected to get them; but after Botham took the first wicket, Willis took 8 for 43 to dismiss Australia for only 111. England had won by 18 runs; it was only the second time in history that a team following on had won a Test match.", "Botham's career and ability level has been oft-debated.  For example, when naming him as a Cricketer of the Year in its 1978 edition, Wisden described Botham as \"a determined character who knows where he is aiming, and who will, quite naturally and fiercely, address himself to the interesting view that he is overrated\". Denis Compton would dismiss Botham as \"overrated\" and said he \"only did well because all the best players had joined Packer\": i.e., for World Series Cricket (WSC).Birley, p. 324.  Despite such conjecture on his talent level, Botham does not appear to have been a self-promoter; rather, he would readily give praise to his colleagues, for instance, his batting partners Hallam Moseley and Bob Clapp after the 1974 Benson and Hedges quarter-final against Hampshire; and to Bob Willis, the man whose bowling spell won the test match at Headingley in 1981."]}, {"page": "May 30", "response": ["*  1949   – Bob Willis, English cricketer and sportscaster (d. 2019)"]}, {"page": "1949", "response": ["* May 30 – Bob Willis, English cricketer (d. 2019)"]}, {"page": "2019", "response": ["** Bob Willis, English cricketer (b. 1949)"]}, {"page": "Colin Cowdrey", "response": ["Bill O'Reilly, not an easy man to impress, said it was the best Test innings he had ever seen and aged only 22 Cowdrey was the youngest Englishman to make an Ashes century since Jack Hearne on the same ground in 1912. Although Cowdrey would make 22 Test centuries they would all be measured against the yardstick of his Melbourne hundred; \"his driving, concentration and command were all faultless ... a tribute to his wonderful ability\".Bob Willis and Patrick Murphy, Starting With Grace, Stanley Paul Publishing, 1986, pp. 94–95. As Frank Tyson recalled, \"Runs did not flow; they were grafted from a pitch which kept the batsman hopping around as delivery after delivery tickled their ribs. Colin was icily superb. For four hours his concentration never wavered...he stroked the ball through the cover and mid-wicket gaps in the field. Shooters became more frequent, but Colin dug them out. When I joined him at the wicket he was a run short of his maiden Test century: a goal he achieved with a scampered single. If he ever scored a better hundred I hope that I am there to see it\".Tyson, p. 149. Cowdrey made 102 of England's first innings of 191 and once again this was enough for Tyson to bowl his team to victory as the tourists took a 2–1 lead in the series."]}, {"page": "John Snow (cricketer)", "response": ["John Augustine Snow (born 13 October 1941) is a retired English cricketer. He played for Sussex and England in the 1960s and 1970s. Snow was England's most formidable fast bowler between Fred Trueman and Bob Willisp231, Swanton, 1986. and played Test Matches with both of them at either end of his career. He is known for bowling England to victory against the West Indies in 1967–68 and Australia in 1970–71 and was a Wisden Cricketer of the Year in 1973.", "Unlike Trueman and Statham, Snow had no regular new-ball partner, teaming up with David Brown, Jeff Jones, Alan Ward, Chris Old, Ken Shuttleworth, Peter Lever, Bob Willis, Geoff Arnold and others. Though his career overlapped that of Willis in 1971–76, injuries and selection problems prevented them from forming the impressive duo that they might have been.", "There was no England tour in 1975–76, but Snow toured Rhodesia with the International Cavaliers, taking 4–36 and hitting 36 not out in the second match at Salisbury.  The West Indies toured England in 1976, and their captain Clive Lloyd took offence at Grieg's claim that he would make them \"grovel\" and the West Indies won the series 3–0 in the Guyanan's first great series victory. Viv Richards made an imperial 829 runs (118.32) and three centuries, but Snow still managed a haul of 15 wickets (28.20). Only Derek Underwood took more wickets for England – 17 wickets (37.11) - and only Bob Willis averaged less – 7 wickets (26.00). He was punished in the first innings at ", "* Bob Willis, Lasting the Pace, Collins, 1985"]}, {"page": "List of sports announcers", "response": ["* Bob Willis – BBC Sport 1985–1987, Sky Sports 1990–2019"]}, {"page": "Warwickshire", "response": ["Warwickshire County Cricket Club play at Edgbaston Cricket Ground, Birmingham (historically part of Warwickshire). Notable English players for the side have been Eric Hollies, M.J.K. Smith, Bob Willis, Dennis Amiss, Jonathan Trott, Ian Bell, Moeen Ali and Chris Woakes. Overseas players have included Alvin Kallicharran, Rohan Kanhai, Brian Lara, Allan Donald and Shaun Pollock. In 2014 the club partly severed its links to the county by renaming its Twenty20 side the Birmingham Bears, much to the chagrin of many supporters."]}, {"page": "Geoffrey Boycott", "response": ["Following Pakistan, Boycott and the England team travelled to New Zealand. In the opening Test match, New Zealand defeated England for the first time in 48 years. Boycott took seven hours and 22 minutes to score 77 runs in the first innings, and in the second innings England were bowled out for 64 when chasing 137 to win.McKinstry p. 170. In the second match, Botham's first Test century took England to 418, but by the end of the match England needed to score quickly to force a win. Boycott, however, told his team that he would play the way he always had, and proceeded to accumulate runs very slowly. Derek Randall was run out, and Botham went out to bat with his captain, informing the dressing room that \"Boycs will be back in here before the end of the over.\" Botham then ran Boycott out, later claiming in his autobiography that he had done it deliberately.Armstrong, p. 99. Indeed, some have suggested that this was a team order. Boycott disputes the suggestion that the run-out was deliberate in his autobiography, referring to Botham's account as \"a story that gets bigger and more fanciful with every telling\". The tale does nevertheless remain a renowned story.Whannel, p. 139. Boycott then delayed his declaration, much to the frustration of England bowler Bob Willis. England did eventually declare, and Willis took 4/14. New Zealand were bowled out for 105 and England won by 174 runs. Boycott suffered a scratch on his cornea and missed the last two days of the final match,McKinstry, p. 171. and by the start of the 1978 season, Brearley had taken the captaincy back from Boycott.McKinstry, p. 173."]}, {"page": "Ted Dexter", "response": ["Dexter retired from cricket to concentrate on other interests in 1968, remaining a journalist, becoming a broadcaster and founding a PR company. In the late 1980s he joined Bob Willis to find new fast bowlers for English cricket. Sponsored by a brewery, application forms were sent to pubs to encourage young men, but most were filled in by jokers and drunks and only a few potential candidates were discovered. These were trained with javelin throwing and other exercises to strengthen their back and arm muscles, but the only bowler in the scheme who played first-class cricket had been signed up by Warwickshire before its inception. The plan therefore failed even though it generated much publicity and showed a certain amount of imagination and initiative."]}, {"page": "Kim Hughes", "response": ["The third Test of the series was played at Headingley in Leeds. Hughes' Australians had the better of the early part of the match. Batting first, Australia made 401 runs; with Hughes contributing 89 of them. In response England only scored 174 runs and Hughes enforced the follow-on (forced to take its second batting innings immediately after its first). England were reduced to 135/7 in their second innings and the on-ground bookmakers decided to offer odds of 500–1 on an England victory.Smith, pp. 176–182. Ian Botham and Bob Willis turned the match on its head. In an extraordinary innings Botham made 149 runs, allowing England to set a target of 130 runs for Australia to win. Willis then took eight wickets for only 43 runs as Australia were all out for 111. Hughes and his Australian team had lost the match from what should have been an unbeatable position. Later, explaining what had happened, Hughes said \"Botham rode his luck and we couldn't get him out. [...] In the first innings they missed catches—even Botham and [David] Gower missed them—but in the second they held everything. I'd seen Bob Willis bowl just as well at other times and not take nearly as many wickets.\" Australia lost the fourth Test at Edgbaston in Birmingham. This time, requiring only 151 runs to win the match, Australia reached 105/4 and seemed certain to win the match. Again, it was Botham who turned the match around, capturing 5 wickets in the space of 28 deliveries while only conceding one run. In the final Test of the series, Hughes chose to shepherd the strike to protect his partner Yallop, who was a specialist batsman. This action, something normally only done for poor, tail-end batsmen, humiliated Yallop.Ryan (2009), p. 30. England won the series three Tests to one and retained the Ashes. The series was later known as \"Botham's summer.\""]}]}}