{"wiki_id": "http://www.wikidata.org/entity/Q2902621", "itemLabel": "Michael Lewis", "itemDescription": "Royal Marines officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Lewis_(naval_historian)", "wikipedia_page": {"main": "Michael Arthur Lewis (3 January 1890 – 27 February 1970) was a British naval historian, as well as a fiction writer, who was Professor of History and English at the Royal Naval College, Greenwich between 1934 and 1955.", "link_mentions": [{"page": "List of historians by area of study", "response": ["* Michael Lewis (1890–1970)"]}, {"page": "Michael Lewis (disambiguation)", "response": ["Michael Lewis (born 1960) is an American non-fiction author and financial journalist.", "Michael Lewis may also refer to:", "* Michael Lewis (archaeologist), British archaeologist", "* Michael Lewis (bishop) (born 1952), bishop of the Anglican Diocese of Cyprus and the Gulf", "* Michael Lewis (businessman) (born 1959), South African-born British businessman", "* Michael Lewis (cyclist) (born 1967), Belizean racing cyclist", "* Michael Lewis (model) (born 1987), Israeli basketball player, actor and fashion model", "* Michael Lewis (MP) (born c. 1500s) for Stamford", "* Michael Lewis (musician), American saxophonist ", "* Michael Lewis (naval historian) (1890–1970), British naval historian", "* Michael Lewis (philosopher) (born 1977), British philosopher", "* Michael Lewis (psychologist) (born 1937), American developmental psychologist", "* Michael Lewis (safety) (born 1980), American football strong safety", "* Michael Lewis (wide receiver) (born 1971), American football wide receiver and punt returner", "* Michael Lewis (NDP), party official in the New Democratic Party, see Stephen Lewis"]}, {"page": "Lewis (surname)", "response": ["*Michael Lewis (born 1960), American non-fiction author", "*Michael Lewis (naval historian) (1890–1970), Professor at the Royal Naval College, Greenwich", "*Michael Lewis (philosopher) (born 1977), British philosopher", "*Michael Lewis (safety) (born 1980), American Football player for the San Francisco 49ers", "*Michael Lewis (wide receiver) (born 1971), American Football player for the New Orleans Saints"]}, {"page": "Royal Naval College, Osborne", "response": ["The schoolmasters who in 1921 were left without teaching posts when the college closed were offered employment at the Royal Naval College, Greenwich. In this way, Charles Godfrey became the head of Mathematics at Greenwich, with the title of Professor, having been headmaster at Osborne, while Michael Lewis and Geoffrey Callender, two other masters from Osborne, also became heads of departments at Greenwich. William Mansfield Poole, the head of modern languages at Osborne, proceeded with his boys to the Royal Naval College, Dartmouth, and continued to teach there.\"William Mansfield Poole\", obituary in The Eagle, magazine of Bedford Modern School, Volume XXVI, No.2 (Easter term, 1947)"]}, {"page": "Geoffrey Callender", "response": ["In 1920 he became the Society for Nautical Research's honorary secretary and treasurer, and remained so until his death.  He then moved  to head Dartmouth Royal Naval College's history department in 1921, but after only a year moved to be the first Professor of History at the Royal Naval College, Greenwich during the addition of a staff college and a war college to the institution.  This was part of a move to incorporate study of naval history into naval education, a need for which had been shown by the recent First World War, and it was in this job that Callender wrote The Naval Side of British History (1924) and headed up the SNR's successful campaigns to save  for the nation and to found a naval and maritime museum for the United Kingdom.  He retained the chair from 1922 to 1934, when he was succeeded by Michael Lewis."]}, {"page": "The New Cambridge Modern History", "response": ["* Michael Lewis, 'Armed Forces and the Art of War, 1830-1870'"]}, {"page": "Talavera Vernon Anson", "response": ["Anson joined the Royal Navy on 16 June 1824, when he went aboard HMS Britomart, then under the command of his second cousin Captain Octavius Venables Vernon. He stayed with Vernon in Primrose, and went on to serve as a junior officer in Rattlesnake and Belvidera on the West India and Mediterranean stations. In his book The Navy in Transition, 1814–1864, Michael Lewis mentions Talavera Vernon Anson as \"a peculiarly well-placed young man\" and comments \"What a name for an ambitious young officer in the first half of the nineteenth century!\"Michael Arthur Lewis, The Navy in Transition, 1814–1864: A Social History (London: Hodder and Stoughton, 1965), p. 30"]}, {"page": "Michael Arthur Lewis", "response": ["#redirectMichael Lewis (naval historian)"]}]}}