{"wiki_id": "http://www.wikidata.org/entity/Q2903375", "itemLabel": "Bill Tidy", "itemDescription": "cartoonist", "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_Tidy", "wikipedia_page": {"main": "William Edward \"Bill\" Tidy, MBE (born 9 October 1933), is a British cartoonist, writer and television personality, known chiefly for his comic strips. Tidy was appointed MBE in 2000 for \"Services to Journalism\". He is noted for his charitable work, particularly for the Lord's Taverners, which he has supported for over 30 years. Deeply proud of his working-class roots in Northern England, his most abiding cartoon strips, such as The Cloggies and The Fosdyke Saga, have been set in an exaggerated version of that environment.", "link_mentions": [{"page": "October 9", "response": ["*  1933   – Bill Tidy, English soldier and cartoonist"]}, {"page": "New Scientist", "response": ["Throughout most of its history, New Scientist has published cartoons as light relief and comment on the news, with contributions from regulars such as Mike Peyton and David Austin. The Grimbledon Down comic strip, by cartoonist Bill Tidy, appeared from 1970 to 1994. The Ariadne pages in New Scientist commented on the lighter side of science and technology and included contributions from David E. H. Jones, Daedalus. The fictitious inventor devised plausible but impractical and humorous inventions, often developed by the (fictitious) DREADCO corporation. Daedalus later moved to Nature."]}, {"page": "The Archers", "response": ["The subtitle was parodied by Bill Tidy in his long-running cartoon of The Cloggies, \"an Everyday Saga in the Life of Clog Dancing Folk\", which ran in the satirical magazine Private Eye, and later in The Listener."]}, {"page": "I'm Sorry I Haven't a Clue", "response": ["* Bill Tidy (1985, 1989, replacement for Tim Brooke-Taylor for one series in 1991)", "*18th Series (Summer 1991) – 22 June–27 July [6 episodes] (Bill Tidy replaces Tim and Humph asks 'what do points mean?' for the first time.)"]}, {"page": "List of British comedians", "response": ["*Bill Tidy (born 1933)"]}, {"page": "Clement Freud", "response": ["* 1981 – The Book of Hangovers – 1982 paperback version illustrated by Bill Tidy"]}, {"page": "Birkenhead", "response": ["Some notable artists were born in the town, such as Philip Wilson Steer, Robert Talbot Kelly, Tom Palin, Bessie Bamber, Annie R. Merrylees Arnold, the workers at the Della Robbia Pottery and two cartoonists: Norman Thelwell and Bill Tidy.https://www.pressreader.com/uk/cheshire-life/20181001/283025465549093"]}, {"page": "Kegworth", "response": ["Cartoonist Bill Tidy was a long-term resident of Kegworth in the 1980s and 1990s."]}, {"page": "Grimbledon Down", "response": ["Grimbledon Down is a comic strip by British cartoonist Bill Tidy. It ran in New Scientist magazine from 26 March 1970 until 26 March 1994."]}, {"page": "Porton Down", "response": ["* Grimbledon Down was a comic strip by British cartoonist Bill Tidy, published for many years by New Scientist. The strip was set in an ostensibly fictitious UK government research lab, referring to the controversial Porton Down bio-chemical research facility."]}, {"page": "The Cloggies", "response": ["The Cloggies, an Everyday Saga in the Life of Clog Dancing Folk, was a long-running cartoon by Bill Tidy that ran in the satirical magazine Private Eye from 1967 to 1981, and later in The Listener from 1985 to 1986. It gently satirised northern English male culture, and introduced a shocked nation to the scurrilous delights of Lancashire clog-dancing.  This particular variation of the art involved two teams dancing towards each other in formation, followed by each attempting to cripple their opponents with gracefully executed knee and foot moves.  Thus the Forward Sir Percy, a synchronized low-level knee attack, the Double Arkwright wi' Ankle Lever, the Heckmondwycke with Reverse Spin and the ever controversial Triple Arkwright. Other routines included the Half Arkwright with Groin Action, the Erotic Elbow Drive and the match-winning Flying Arkwright, performed to cries of, “Keep them knees stylish!” ", "Bill Tidy's inspiration for this series may have grown out of one of his cartoons in Punch in the mid 1960s, where he parodied the funding objectives and credibility of the Arts Council of Great Britain by illustrating a group of morris dancers in full costume, gathered around a table outside a pub, behind an enormous pile of empties, with one of them asking \"Well lads, what are we going to do wi' rest of Arts Council grant ?\"", "Although other dancers have more recently appropriated the name, The Cloggies originally took on a real life of their own in 1968 when a group of students at University Hall, Buckland in Oxfordshire, became so inspired by the cartoon characters’ pub-oriented career that they formed their own squad. Photographs from the period show the team in the following order:  Stan (Pete Metcalfe), Wally (Gwyn Ellis), Neville (John Barton), Arnold (Iain Murray), Ted (Andy Carr) and Albert (Al Guyver). The shady-looking character is the manager, Morris (Mike Fernie). Arthur (Nigel Brewis), was later named as reserve boot in case of injury or hangover. Bill Tidy personally wrote to the team to officially endorse and encourage them, delighted that “all those years spent labouring on Spam have produced a debased art form”.", "*Bill Tidy"]}, {"page": "Very Short Introductions", "response": ["| 010 || Archaeology || Paul Bahn (illustrator: Bill Tidy) ||    (2nd ed.) || 1996 || archaeology"]}, {"page": "The Utterly Utterly Merry Comic Relief Christmas Book", "response": ["Douglas Adams, Rowan Atkinson, Glen Baxter, Michael Bywater, Graham Chapman, Nobby Clarke, Ron Cobb, Richard Curtis, Angus Deayton, Adrian Edmonson, Michael Fishwick, Michael Foreman, Stephen Fry, Kim Fuller, George Harrison, Michael Heath, Lenny Henry, Ian Hislop, Caroline Holden, Richard Ingrams, Antony Jay, Guy Jenkin, Gray Jolliffe, Terry Jones, Trevor Leighton, John Lloyd, Jonathan Lynn, Thomas Mann, Rik Mayall, Lise Mayer, Michael Palin, Geoffrey Perkins, Stephen Pile, Nigel Planer, Christopher Ryan, Griff Rhys Jones, Posy Simmonds, Mel Smith, The Spitting Image Workshop, Sue Townsend, Bill Tidy, John Wells."]}, {"page": "Jake Thackray", "response": ["After Bantam Cock Thackray's television appearances continued, but his recording career stalled. A compilation album, The Very Best of Jake Thackray, was released in 1975. His final studio album, On Again! On Again!, appeared in 1977. Its title track, a long-winded tirade about women who talk too much, would see Thackray accused of misogyny, but the album also included \"The Hair of the Widow of Bridlington\", a song of female self-determination in the face of social disapproval. It also featured two more Brassens adaptations, \"Isabella\" (based on Brassens' \"Marinette\") and \"Over to Isobel\" (based on \"Je rejoindrai ma belle\"). The same year he published a book of lyrics, Jake's Progress, illustrated by Bill Tidy.", "In May 2002, a group of fans formed the Jake Thackray Project with the intention of making more of Thackray's work available to the public. With Thackray's cooperation, the project team, led by record producer David Harris, received permission from EMI to produce a double CD of 42 songs not on any then-available release, limited to 200 copies, which was released in November 2002 with cover art by Bill Tidy. After Thackray's death the following month, EMI consented to a further edition of 100 copies. This revival of interest led to the release of two mass market CDs the following year: The Very Best of Jake Thackray on EMI, and The Jake Thackray Collection on HMV. The Jake Thackray Project went on to release a remastered live recording (the CD Live in Germany), and two DVDs: the privately recorded Live at the Unicorn (2009) and the BBC-licensed Jake Thackray and Songs (2014). A musical written by Barnsley-born poet Ian McMillan based on Thackray's songs and their characters, Sister Josephine Kicks the Habit, premiered in 2005 and toured the north of England. A rewrite by Alan Plater was due to tour the UK in 2007, but was put on hold following the death of executive producer Ian Watson., In 2004 Jake Thackray was featured on the BBC Radio Four 'Great Lives' Series."]}, {"page": "List of people from Merseyside", "response": ["* Bill Tidy: Cartoonist."]}, {"page": "Vole (magazine)", "response": ["* Bill Tidy"]}, {"page": "Crudgington", "response": ["In Bill Tidy's long-running cartoon published in the monthly Campaign for Real Ale newsletter, a fictional Crudgington Brewery is a regular feature, as the beer of choice (\"Crudgington's\") of the strip's main character. It is a regional family brewery, with a similar presentation as the non-fictional Boddington's brand.OVGuide  Crudginton Brewery"]}, {"page": "Lord's Taverners", "response": ["* Bill Tidy (2007–2009)"]}, {"page": "You Bet!", "response": ["|Bill Tidy"]}, {"page": "Boylestone", "response": ["The cartoonist Bill Tidy formerly lived in the village."]}, {"page": "Denis Gifford", "response": ["Gifford wrote the first television series of comedy stars Morecambe and Wise, Running Wild (1954), having been brought in with fellow cartoonist, comic enthusiast and film buff Tony Hawes to save a series which was initially panned by critics. He also provided material for the opening night of ITV (1955) and co-wrote the first comedy show to be screened by BBC2, the TV movie Alberts' Channel Too (1964) for the launch of the channel, although the whole evening's broadcasting was lost due to a power blackout. He wrote for Junior Showtime (1973), devised the nostalgia panel show Looks Familiar (1970–87) for Thames TV, presented by Denis Norden, its radio counterpart Sounds Familiar and the Thames quiz show Quick on the Draw (1974–1979) featuring drawings by cartoonists and celebrities, with presenters including Bob Monkhouse, Rolf Harris and Bill Tidy. He also wrote scripts for the ITV children's puppet shows Witches' Brew (1973) and The Laughing Policeman (1974). Gifford also designed stunts for the popular BBC1 game show The Generation Game."]}, {"page": "The Cartoon Museum", "response": ["Every year the trustees of the Cartoon Art Trust host the Cartoon Art Trust Awards, giving a number of awards, including a Lifetime Achievement Award to an artist who has made a significant contribution to British cartooning. Past winners have included Ronald Searle, David Levine, Trog, Fluck and Law, Norman Thelwell, Frank Dickens, David Langdon, Gerald Scarfe, Leo Baxendale and Bill Tidy. The CAT also give the \"Pont Award\" to a cartoonist whose drawings reflect \"The British Character\". Past winners include Norman Thelwell, \"Mac\", Michael Heath, Sue McCartney-Snape and Tony Husband. The Museum also hosts the Young Cartoonist of the Year Award which receives around 1,000 submissions every year.Nick Newman, The Spectator, 25 July 2020 Retrieved 27 August 2021"]}, {"page": "Rob Buckman", "response": ["* Out of Practice, illustrations by Bill Tidy. Deutsch. 1978."]}, {"page": "List of newspaper comic strips G–O", "response": ["*Grimbledon Down (1970–1994) by Bill Tidy (UK)"]}, {"page": "List of newspaper comic strips A–F", "response": ["* The Cloggies by Bill Tidy (UK)", "* The Fosdyke Saga (1971–1985) by Bill Tidy (UK)"]}, {"page": "The Fosdyke Saga", "response": ["The Fosdyke Saga was a British comic strip by cartoonist Bill Tidy, published in the Daily Mirror newspaper from March 1971 - February 1985. Described as \"a classic tale of struggle, power, personalities and tripe\", the strip was a parody of John Galsworthy's classic novel series The Forsyte Saga. However, the slightly bizarre and strange antics of the characters and those around them had a Lancashire/Cheshire lean, with mangles, chimneys and soot ever-present.", "Created by well-known cartoonist Bill Tidy, who also produced cartoons for the satirical magazine Private Eye and created The Cloggies, the wry humour in this classic 1970s comic strip was very popular, if often unintelligible to those outside of the mid-north-west of England.", "*Autobiography of Bill Tidy"]}, {"page": "Late Night Line-Up", "response": ["*Bill Tidy Interview – The Fosdyke Saga 11 September 1972"]}, {"page": "Private Eye books", "response": ["In former years, the magazine published collections of their strip cartoons.  In particular, The Adventures of Barry McKenzie, the exploits of an uncouth Australian expatriate in Sixties London, written by Barry Humphries and illustrated by Nicholas Garland, was published in three collections, long since out of print and now collectors' items.  The Bill Tidy strip The Cloggies was also issued in this form."]}, {"page": "Bruce Bairnsfather", "response": ["A plaque commemorating Bruce Bairnsfather was unveiled at his former home, Victoria Spa Lodge, Bishopton, Stratford upon Avon () on 10 September 2005 by cartoonist Bill Tidy. The plaque was instigated by Mark Warby, Editor of The Old Bill Newsletter, the official journal for Bairnsfather enthusiasts and collectors."]}, {"page": "1971 in comics", "response": ["* Bill Tidy's The Fosdyke Saga (1971-1985) makes its debut."]}, {"page": "Gren", "response": ["Fellow cartoonist Bill Tidy paid tribute to Gren: \"I was a great admirer of Gren. To me he was a Max Boyce on paper and a Harry Secombe in humour. He raised a large amount of money for charity, he was crazy on rugby and was the only Welshman I'd ever met who sang out of tune deliberately. He had his finger on the pulse of Wales.\""]}, {"page": "Bibliography of Charles, Prince of Wales", "response": ["*Airborne Free: Red Devils & Other Rare Breeds. Mark Bryant, ed. London: Leo Cooper, Octopus Books (1990).  .   Description: observations on airborne forces and wildlife management by more than fifty cartoonists: George Worsley Adamson, Barry Fantoni, Alex Graham, Martin Honeysett, Peter Maddocks, Gerald Scarfe, Bill Tidy, Kevin Woodcock et al.   Royalties to the Airborne Forces Charities Development Trust and the David Shepherd Conservation Foundation."]}, {"page": "St Margaret's Church of England Academy", "response": ["* Bill Tidy, cartoonist (at the Anfield site)"]}, {"page": "Sunday Dispatch", "response": ["*Bill Tidy – cartoonistTidy, Bill"]}, {"page": "Larry (cartoonist)", "response": ["Parkes's cartooning style was extremely minimalist.  No speech bubbles or captions were used, and he often used a few lines to suggest the outline of some feature, such as an arm or a leg, preferring to concentrate on the main idea of the drawing.  Especially in the early part of his career, when cartoonists were expected to produce polished work, he was frequently admonished by his editors to \"fill in\" his drawings before they would be published.  As styles changed in the 1960s and 1970s, his more fluid, off-the-cuff style became his trademark.  He was compared to Bill Tidy, both for his particular way of drawing people, and for the speed at which he could work."]}, {"page": "List of people from Wirral", "response": ["*Bill Tidy (cartoonist)"]}, {"page": "Farnham Beer Exhibition", "response": ["Special half-pint glasses have been issued each year, and limited edition pint glasses for the 10th and 21st Exhibitions; these are very collectable and some reach high values. Since 1978 the Souvenir Programme has carried a front-cover cartoon by Bill Tidy and a booklet of these cartoons was published in 2006."]}]}}