{"wiki_id": "http://www.wikidata.org/entity/Q29014707", "itemLabel": "Thomas Jeckyll", "itemDescription": "English architect and designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Jeckyll", "wikipedia_page": {"main": "Thomas Jeckyll (1827 Wymondham, Norfolk - 1881 Norwich) (baptised on 20 June 1827)  was an English architect who excelled in the creation of metalwork and furniture strongly influenced by Japanese design, and is best known for his planning in 1876 of the ‘Peacock Room’ at 49 Princes Gate, London.\n\n", "link_mentions": [{"page": "James Abbott McNeill Whistler", "response": ["Harmony in Blue and Gold: The Peacock Room is Whistler's masterpiece of interior decorative mural art. He painted over the original paneled room designed by Thomas Jeckyll (1827–1881), in a unified palette of brilliant blue-greens with over-glazing and metallic gold leaf. Painted in 1876–1877, it is now considered a high example of the Anglo-Japanese style. Frederick Leyland left the room in Whistler's care to make minor changes, \"to harmonize\" the room whose primary purpose was to display Leyland's china collection. Whistler let his imagination run wild, however: \"Well, you know, I just painted on. I went on—without design or sketch—putting in every touch with such freedom ... And the harmony in blue and gold developing, you know, I forgot everything in my joy of it.\" He completely painted over 16th-century Cordoba leather wall coverings first brought to Britain by Catherine of Aragon that Leyland had paid £1,000 for."]}, {"page": "Wymondham", "response": ["*Thomas Jeckyll (1827-1881), architect and pioneer Japonaiserie interior designer"]}, {"page": "Sandringham House", "response": ["The 20,000 acre (8,100 ha) Sandringham estate has some of the finest shoots in England, and is used for royal shooting parties. Covering seven villages, the estate's other main activities, aside from tourism, are arable crops and forestry. The grounds provided room for Queen Alexandra's menagerie of horses, dogs, cats, and other animals. In 1886 a racing pigeon loft was constructed for birds given to the Duke of York by King Leopold II of Belgium and one or more lofts for pigeons have been maintained ever since. The Norwich Gates, designed by Thomas Jeckyll and made by the local firm of Barnard, Bishop and Barnard, were a wedding present for Edward and Alexandra from \"the gentry of Norfolk\"."]}, {"page": "Newport railway station (Essex)", "response": ["The station design is similar to others on the same line- particularly Great Chesterford and March with only slight variants in construction and detailing. The waiting rooms still retain two distinctive painted Victorian Arts & Crafts cast iron fire surrounds designed by Thomas Jeckyll (1827–1881) and produced by Barnard, Bishop and Barnard in Norwich for the Great Eastern Railway. Thomas Jeckyll was a trained architect and started working at the foundry in 1859 and is best known for his metal work design in particular fireplace and fireplace grates."]}, {"page": "Anglo-Japanese style", "response": ["In 1873, George Ashdown Audsley gave a lecture on Japanese Ceramic artworks at Liverpool.Art and Art Industries in Japan, Rutherford Alcock, 1878, p.5, London Thomas Jeckyll designed a number of his 'mon' fireplaces, used by architects like Dresser and Norman Shaw, becoming extremely popular in 1873. Jeckyll also designed the Philadelphia Centennial Exposition's 1876 Japanese Pavilion in wrought iron, the decorative motif here of the sunflower was heavily employed in the structures ornament, which although used before as a motif by Jeckyll, popularised the association of the sunflower as a floral motif in the Anglo-Japanese style.https://www.vam.ac.uk/articles/furnishing-the-aesthetic-home (Accessed 1 November 2020)", "In 1877, Godwin designed the white house for Whistler in Chelsea. He also made his William Watt Anglo Japanese Style furniture, and his Japanese Mon inspired wallpapers. Thomas Jeckyll also then designed the Peacock Room for the shipping magnate Frederick Richards Leyland; and these types of Japanese ornamentation can also be found in the design of his fireplaces. The Grosvenor Gallery opens; showcasing Whistler's Black Nocturne leading to the infamous dispute with Ruskin over the worth of an artwork.", "Thomas Jeckyll Sunflower 1876 Japanese Pavilion.jpg|Jeckyll, Sunflower railing for the Japanese Pavilion (1876)", "Thomas Jeckyll01.jpg|Jeckyll, Butterfly motif (c.1880-1881)", "File:The Peacock Room.jpg|The Peacock Room, designed by Thomas Jeckyll (1873–76), repainted by James McNeill Whistler (1876–77)"]}, {"page": "The Peacock Room", "response": ["Harmony in Blue and Gold: The Peacock Room (better known as The Peacock Room) is a masterpiece of interior decorative art created by James McNeill Whistler and Thomas Jeckyll, translocated to the Freer Gallery of Art in Washington, DC. Whistler painted the paneled room in a rich and unified palette of brilliant blue-greens with over-glazing and metallic gold leaf. Painted between 1876–77, it now is considered one of the greatest surviving Aesthetic interiors, and best examples of the Anglo-Japanese style."]}, {"page": "Alexander Constantine Ionides", "response": ["In 1834 Ionides and his family moved to London, where they lived at 9 Finsbury Circus  from 1834 to 1839). In 1837 he became a naturalised British citizen. Afterwards they moved to Tulse Hill (1838–1864) and finally to 1 Holland Park (1864 onwards), during which time began to gather an artistic salon at his home. Acting as Greek consul-general in 1854–1866, he held directorships of the Crystal Palace (1855) and of many banks. His son Alexander introduced him in 1860 to artists whom he had met in Paris, such as James Abbott McNeill Whistler, Edward Poynter, Thomas Armstrong, and George du Maurier; later Dante Gabriel Rossetti and Edward Burne-Jones also joined Ionides's circle. He commissioned the designers Philip Webb and Thomas Jeckyll to redecorate 1 Holland Park. In 1875, he finally moved to a house called \"Windycroft\" in Hastings, leaving Alexander to complete the Aesthetic redecoration at 1 Holland Park by commissioning William Morris and Walter Crane)."]}, {"page": "The Princess from the Land of Porcelain", "response": ["Several years later, the portrait was bought by Leyland He displayed Princess in a dining room filled with Kangxi ceramics, but was displeased how it had been decorated by a previous artist, Thomas Jeckyll. Whistler suggested that Leyland modify the coloring of the room to better accent his new acquisition; the redesign was later handled by Whistler himself, as Jeckyll was ill. The result was The Peacock Room. However, Whistler's modifications were more in-depth than those wished for by Leyland, resulting in a quarrel between the two."]}, {"page": "Modern Gothic style", "response": ["Other designers who worked in the Modern Gothic style include Bruce James Talbert, Edward William Godwin,  and Thomas Jeckyll in England; and Kimbel and Cabus, Frank Furness, and Daniel Pabst in the United States. The style's parting zenith was the Modern Gothic furniture exhibited at the 1876 Centennial Exposition in Philadelphia.", "File:Wolfsonian-FIU Museum - IMG 8238.JPG|Sideboard (1868), designed by Thomas Jeckyll, Wolfsonian-FIU Museum, Miami Beach, Florida."]}]}}