{"wiki_id": "http://www.wikidata.org/entity/Q2903678", "itemLabel": "William McCutcheon", "itemDescription": "Welsh rugby union and rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_McCutcheon", "wikipedia_page": {"main": "William 'Billy' McCutcheon (second ¼ 1870 – 3 July 1949) was a Welsh international rugby wing who played club rugby in the union code for Swansea, and represented Oldham (Heritage No. 23) under the league code. McCutcheon was capped for the Wales national rugby union team seven times between 1891 and 1894. In 1893 he was a member of the first Welsh Triple Crown winning team.\n\n", "link_mentions": [{"page": "Arthur Gould (rugby union)", "response": ["Gould continued to captain the Wales team through victory over Scotland, with tries coming from Bert Gould, Biggs and William McCutcheon; all the result of precision handling from the backs. This left the final encounter with Ireland, played at Stradey Park in Llanelli, as the deciding match for a Welsh Triple Crown. Despite an unconvincing Welsh display, an enthusiastic crowd of 20,000 watched their country win the game and with it the title, decided by a single try from Bert Gould."]}, {"page": "Swansea RFC", "response": ["*  William McCutcheon"]}, {"page": "1949 in Wales", "response": ["*3 July - William McCutcheon, Wales international rugby player, 78/79"]}, {"page": "McCutcheon", "response": ["* William McCutcheon (1870–1949), Wales international rugby player"]}, {"page": "1891 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea), William McCutcheon (Swansea), Dickie Garrett (Penarth), David Gwynn (Swansea), George Thomas (Newport), Ralph Sweet-Escott (Cardiff), Hugh Ingledew (Cardiff), Percy Bennett (Cardiff Harlequins), Sydney Nicholls (Cardiff), Tom Graham (Newport), William Bowen (Swansea), Walter Rice Evans (Swansea), David Daniel (Llanelli), Rowley Thomas (London Welsh), Willie Thomas (Llanelli) capt."]}, {"page": "1892 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea), Tom Pearson (Cardiff), William McCutcheon (Swansea), Arthur Gould (Newport) capt., Dickie Garrett (Penarth), Percy Phillips (Newport), George Rowles (Penarth), Frank Mills (Swansea), Charles Nicholl (Llanelli), Tom Graham (Newport), Jim Hannan (Newport), Tom Deacon (Swansea), Arthur Boucher (Newport), Rowley Thomas (London Welsh), Wallace Watts (Newport)", "Wales: Billy Bancroft (Swansea), Tom Pearson (Cardiff), William McCutcheon (Swansea), Arthur Gould (Newport) capt., Conway Rees (Llanelli), Evan James (Swansea), David James (Swansea), Frank Mills (Swansea), Charles Nicholl (Llanelli), Tom Graham (Newport), Jim Hannan (Newport), Tom Deacon (Swansea), Arthur Boucher (Newport), Percy Bennett (Cardiff Harlequins), Wallace Watts (Newport)"]}, {"page": "1893 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea), Norman Biggs (Cardiff), William McCutcheon (Swansea), Arthur Gould (Newport) capt., Conway Rees (Llanelli), Percy Phillips (Newport), Fred Parfitt (Newport), Frank Mills (Swansea), Charles Nicholl (Llanelli), Harry Day (Newport), Jim Hannan (Newport), Frank Hill (Cardiff), Arthur Boucher (Newport), Tom Graham (Newport), Wallace Watts (Newport)", "Wales: Billy Bancroft (Swansea), Norman Biggs (Cardiff), William McCutcheon (Swansea), Arthur Gould (Newport) capt., Bert Gould (Newport), Percy Phillips (Newport), Fred Parfitt (Newport), Frank Mills (Swansea), Charles Nicholl (Llanelli), Harry Day (Newport), Jim Hannan (Newport), Frank Hill (Cardiff), Arthur Boucher (Newport), Tom Graham (Newport), Wallace Watts (Newport)", "Wales: Billy Bancroft (Swansea), Norman Biggs (Cardiff), William McCutcheon (Swansea), Arthur Gould (Newport) capt., Bert Gould (Newport), Percy Phillips (Newport), Fred Parfitt (Newport), Frank Mills (Swansea), Charles Nicholl (Llanelli), David Samuel (Newport), Jim Hannan (Newport), Frank Hill (Cardiff), Arthur Boucher (Newport), Tom Graham (Newport), Wallace Watts (Newport)"]}, {"page": "1894 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea), Norman Biggs (Cardiff), William McCutcheon (Oldham), Arthur Gould (Newport) capt., Conway Rees (Llanelli), Percy Phillips (Newport), Fred Parfitt (Newport), Frank Mills (Swansea), Charles Nicholl (Llanelli), David Daniel (Llanelli), Jim Hannan (Newport), Frank Hill (Cardiff), Arthur Boucher (Newport), Tom Graham (Newport), Wallace Watts (Newport)"]}, {"page": "David Gwynn", "response": ["Gwynn played two final games for Wales, the Scotland and Ireland matches of the 1891 Championship. Gwynn moved north and played for Oldham during this period, though continued to turn out for Swansea when he could. He was joined at Oldham by William McCutcheon who not only played for Swansea, but also represented Lancashire with Gwynn at county level.Marshall, Francis Football; the Rugby union game (1892) Cassell and company Ltd. pg 367 When Gwynn left the sport of rugby, he became heavily associated with Swansea Cricket Club and umpired for the club."]}, {"page": "Frederick Nicholls", "response": ["Nicholls was born in London in 1868, but moved to Wales where he settled in the capital city Cardiff. He played rugby on the wing for second tier team Cardiff Harlequins. The Harlequins at the time were an emerging club that showed promise in cup competitions and tour events, but had only just produced their first international player, forward Percy Bennett. Nicholls was first chosen to represent Wales in the final game of the 1892 Home Nations Championship, an away game at Lansdowne Road against Ireland. Under the captaincy of Welsh rugby legend Arthur 'Monkey' Gould, Nicholls came in at threequarters on the opposite wing to Cardiff RFC, stalwart Norman Biggs as a replacement for William McCutcheon. Despite a wealth of talent the Welsh team had lost the opening two games of the Championship and the Irish and Welsh teams faced each other in an attempt to avoid bottom place. Wales lost the game 9-0 and Nicholls was replaced in the next game by a returning McCutcheon, and never represented Wales again."]}, {"page": "1905 Yorkshire Cup", "response": ["|Referee||||William McCutcheon (Oldham)"]}, {"page": "1906 Yorkshire Cup", "response": ["|Referee||||William McCutcheon (Oldham)"]}, {"page": "McCutcheon, William", "response": ["#redirectWilliam McCutcheon"]}, {"page": "1890–91 Rugby Union County Championship", "response": ["* William McCutcheon (Oldham)"]}]}}