{"wiki_id": "http://www.wikidata.org/entity/Q2900778", "itemLabel": "Sylvestra Le Touzel", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Sylvestra_Le_Touzel", "wikipedia_page": {"main": "Sylvestra Le Touzel (born 1958) is a British television, film and stage actor. She was born and raised in Kensington, London, to a prominent family from Saint Helier, Jersey, Channel Islands. She attended school in East Acton.", "link_mentions": [{"page": "My Family", "response": ["* Sylvestra Le Touzel"]}, {"page": "Hay Fever (play)", "response": ["The 1992 revival cast at London's Albery Theatre included Abigail Cruttenden as Sorel, Maria Charles as Clara, Maria Aitken as Judith, John Standing as David, Carmen du Sautoy as Myra, Christopher Godwin as Richard, and Sara Crowe as Jackie. The 1999 Savoy Theatre cast included Monica Dolan as Sorel, Stephen Mangan as Simon, Geraldine McEwan as Judith, Peter Blythe as David, Sylvestra Le Touzel as Myra, Malcolm Sinclair as Richard, and Cathryn Bradshaw as Jackie.  The 2006 Haymarket Theatre casts included Kim Medcalf as Sorel, Dan Stevens as Simon, Judi Dench as Judith, Peter Bowles as David, Charles Edwards as Sandy, and Belinda Lang as Myra. The following UK tour, in 2007, cast Stephanie Beacham as Judith, Christopher Timothy as David, William Ellis as Simon, Christopher Naylor as Sandy, and Andrew Hall as Richard."]}, {"page": "The Uninvited (TV series)", "response": ["* Sylvestra Le Touzel as Joanna Ball "]}, {"page": "Lucy, Lady Duff-Gordon", "response": ["The Titanic episode is one of the most prominent aspects of Lucy Duff-Gordon's life, thanks partly to motion pictures. The films, however, portrayed her without great attention to accuracy. She has been portrayed by Harriette Johns in A Night to Remember (1958); by Rosalind Ayres in James Cameron's epic Titanic (1997); and by Sylvestra Le Touzel in the British miniseries Titanic (2012). She is also a key character in the novel The Dressmaker, by Kate Alcott, which portrays both the sinking of the Titanic and the negative publicity that followed for the Duff-Gordons."]}, {"page": "Between the Lines (TV series)", "response": ["Guest stars in the series included many well-known British actors who have gone on to star in other major television dramas and/or movies, including Daniel Craig, James Nesbitt, Jerome Flynn, Bernard Hill, David Morrissey, Jaye Griffiths, Paul Brooke, Francesca Annis, Sylvestra Le Touzel, John Hannah, Michael Kitchen, David Hayman, Hermione Norris, Edward Tudor-Pole, Ray Winstone, Larry Lamb, Hugh Bonneville, Marc Warren and Jonny Lee Miller. Most of them were unknown or less known, prior to their appearances in this series."]}, {"page": "Westway (TV series)", "response": ["*Sylvestra Le Touzel as Samantha Ryder"]}, {"page": "Shakespeare: The Animated Tales", "response": ["* Sylvestra Le Touzel as Rosalind"]}, {"page": "Mansfield Park", "response": ["*1983: Mansfield Park, BBC series directed by David Giles, starring Sylvestra Le Touzel as Fanny Price, Nicholas Farrell as Edmund Bertram and Anna Massey as Mrs Norris."]}, {"page": "Cosmo Duff-Gordon", "response": ["Sir Cosmo and Lady Duff-Gordon were portrayed by the actors Martin Jarvis and Rosalind Ayres, themselves a married couple, in the 1997 film Titanic. In that film there is also an indirect reference to the alleged bribe that Sir Cosmo gave to officer Murdoch, when Cal Hockley gives Murdoch some money for a place on a lifeboat, although it was to be in vain; Murdoch later threw Hockley's money back at him and rejected the bribe, and Hockley eventually escapes aboard a Collapsible lifeboat with a lost child. In the 2012 ITV mini-series Titanic the couple was portrayed by Simon Paisley Day and Sylvestra Le Touzel."]}, {"page": "Bryan Pringle", "response": ["In 1980 he played Albert Case, leader of a group of villains in The Professionals episode Weekend in the Country. Other notable appearances were as landlord Arthur Pringle in Series 2 of Auf Wiedersehen, Pet (1986), as Barker in the Inspector Morse episode Deceived by Flight (1989) and as pathologist Felix Norman in Prime Suspect (1991). He played the part of the farmer Mr. Grimsdale in the second series of \"All Creatures Great and Small\". Pringle also appeared in 1985 in a well-known TV commercial advertising Heineken beer, playing a cockney elocutionist attempting to teach an upper-class woman (Sylvestra Le Touzel) how to say \"The wa'er in Major'a don' taste like wot id ough' 'a\" (\"The water in Majorca don't taste like what it ought to\")."]}, {"page": "Fiona Gillies", "response": ["Gillies produced Some Sweet Oblivious Antidote, a short film starring Lenny Henry, Colin Salmon, Wunmi Mosaku and Sylvestra Le Touzel. The film was nominated for Best Family Film at the Sydney Indie Film Festival."]}, {"page": "Ed Reardon's Week", "response": ["|Ed is enjoying the best years of his life as a mature student sleeping in all day and watching \"Homes Under The Hammer\". But an encounter with Professor Antonia Sandham gives him the motive to be more sociable. Starring Sylvestra Le Touzel as Antonia Sandham."]}, {"page": "Debby Bishop", "response": ["Debby Bishop has supported charitable community theatre. She has been a patron of Montage Theatre Arts in London since 2005 with fellow actress Sylvestra Le Touzel."]}, {"page": "Beast (TV series)", "response": ["*Sylvestra Le Touzel as Briony, another vet in the practice"]}, {"page": "List of The Professionals episodes", "response": ["| Celia Gregory, Sylvestra Le Touzel, David John, Nigel Pegram"]}, {"page": "Patricia Hornsby-Smith, Baroness Hornsby-Smith", "response": ["Lady Hornsby Smith was portrayed in the 2008 drama The Long Walk to Finchley (by actress Sylvestra Le Touzel)."]}, {"page": "The Rain in Spain", "response": ["*A 1985 British television commercial for Heineken parodies the scene. Sylvestra Le Touzel plays a woman who speaks posh, and after a drink of Heineken a cockney accent appears. It was ranked at number 9 in Campaign Live's 2008 list of the \"Top 10 Funniest TV Ads of All Time\", and at number 29 in Channel 4's list of the \"100 Greatest TV Ads\" in 2000."]}, {"page": "Mansfield Park (1983 TV serial)", "response": ["* Sylvestra Le Touzel – Fanny Price"]}, {"page": "Owen Teale", "response": ["Teale was born in North Cornelly, south Wales, and attended Cynffig Comprehensive School in Kenfig Hill. He was suspended from the school for disciplinary offences and credits one of the teachers with awakening his interest in acting. He has been married twice: first to Dilys Watling and then to Sylvestra Le Touzel. He has three children."]}, {"page": "Maurice Leitch", "response": ["| Alex Jennings, Clive Panto, Eileen Tully, Timothy Bateson, Ian McElhinney, Jim Norton, Liam Neeson, Timothy Spall and Sylvestra Le Touzel"]}, {"page": "List of films featuring the Irish Republican Army", "response": ["|Sylvestra Le Touzel"]}, {"page": "Vanity Fair (1998 TV serial)", "response": ["* Sylvestra Le Touzel as Lady Jane Crawley"]}, {"page": "List of American films of 2007", "response": ["| Amazing Grace || Samuel Goldwyn Films || Michael Apted (director); Steven Knight (screenplay); Ioan Gruffudd, Romola Garai, Youssou N'Dour, Albert Finney, Benedict Cumberbatch, Michael Gambon, Rufus Sewell, Ciarán Hinds, Toby Jones, Nicholas Farrell, Sylvestra Le Touzel, Jeremy Swift, Stephen Campbell Moore, Bill Paterson, Nicholas Day, Georgie Glen || Biography, Drama"]}, {"page": "List of American films of 2008", "response": ["| Happy-Go-Lucky || Miramax Films || Mike Leigh (director/screenplay); Sally Hawkins, Eddie Marsan, Alexis Zegerman, Andrea Riseborough, Sinead Matthews, Sylvestra Le Touzel, Joseph Kloska, Samuel Roukin. Caroline Martin, Oliver Maltman, Nonso Anozie, Karina Fernandez || Comedy, Drama"]}, {"page": "Play for Tomorrow", "response": ["|1||Crimes|| 13 April 1982||Stuart Burge||Caryl Churchill ||Sylvestra Le Touzel (Jane)  Peter Whitbread (Ron) <Br> Rufus Collins (Elliot)  T. P. McKenna (Melvyn) <Br> Julia Foster (Veronica) <Br> Donald Gee (Larry) <Br> Glen Murphy (Student)"]}, {"page": "Happy-Go-Lucky (2008 film)", "response": ["* Sylvestra Le Touzel as Heather"]}, {"page": "Jane Austen in popular culture", "response": ["| style=\"width:13%;\"|Sylvestra Le Touzel"]}, {"page": "Mark Hadfield", "response": ["He also appeared in the Heinekin Adverts with Sylvestra Le Touzel. (Water in Majorca)."]}, {"page": "The Long Walk to Finchley", "response": ["*Sylvestra Le Touzel - Patricia Hornsby-Smith"]}, {"page": "Rosalind (As You Like It)", "response": ["Helen Mirren played Rosalind in the 1978 BBC Television Shakespeare version of the play directed by Basil Coleman.As You Like It (1978) at the Internet Movie Database, https://www.imdb.com/title/tt0077180/ In Shakespeare: The Animated Tales' 1994 adaptation of As You Like It, Sylvestra Le Touzel voiced Rosalind."]}, {"page": "Matthew James Thomas", "response": ["In 2010, Thomas appeared in an episode of the ITV series, Midsomer Murders alongside John Nettles, Sylvestra Le Touzel, Lydia Wilson, and Richard Fleeshman. Also in 2010, Thomas ventured to New York City and Broadway where he earned a role as the alternate lead in Julie Taymor's Spider-Man: Turn Off the Dark. Thomas played Peter Parker/Spider-Man for two performances each week while Reeve Carney took on the role 6 times per week. The play was staged at the Lyric Theatre, which, at the time, was known as the Foxwoods Theatre. In November 2011, Thomas was injured backstage during a Wednesday matinee performance. The injury was not considered serious."]}, {"page": "Arkangel Shakespeare", "response": ["* Sylvestra Le Touzel - Mistress Ford"]}, {"page": "Sylvestra la Touzel", "response": ["#REDIRECT Sylvestra Le Touzel"]}, {"page": "Accidental Farmer", "response": ["*Sylvestra Le Touzel as Judith"]}, {"page": "The Short and Curlies", "response": ["The Short & Curlies is a 1987 short film written and directed by Mike Leigh. It stars Alison Steadman, Wendy Nottingham, Sylvestra Le Touzel and David Thewlis.Michael Coveney, The World according to Mike Leigh, p. 187"]}, {"page": "Dirk Gently (TV series)", "response": ["The programme pilot featured appearances from Doreen Mantle, Anthony Howell, Miles Richardson, Billy Boyle. Episode one saw guest appearances by Paul Ritter, Cosima Shaw, Ken Collard, Colin McFarlane and Miranda Raison. Episode two featured roles for Bill Paterson, Sylvestra Le Touzel, Lydia Wilson, Andrew Leung, Will Sharpe and Bethan Hanks. Episode three features Lisa Dillon and Tony Pitts."]}]}}