{"wiki_id": "http://www.wikidata.org/entity/Q2905741", "itemLabel": "Blair Dunlop", "itemDescription": "British actor and musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Blair_Dunlop", "wikipedia_page": {"main": "Blair Dunlop (born 11 February 1992) is an English folk musician and actor.", "link_mentions": [{"page": "Chesterfield, Derbyshire", "response": ["*Blair Dunlop (born 1992), musician and actor"]}, {"page": "1992 in film", "response": ["**Blair Dunlop, English folk musician and actor"]}, {"page": "Sandy Denny", "response": ["The band was, once again, composed of members of Bellowhead. Other acts performing included the aforementioned Thea Gilmore and up-and-coming folk acts Lavinia Blackwall of Trembling Bells, Blair Dunlop and Sam Carter, alongside more established folk stars Maddy Prior, Dave Swarbrick and Jerry Donahue. The line-up was completed with performers not normally associated with the folk scene; Green Gartside, Joan Wasser (also known as Joan As Police Woman), and PP Arnold. The tour was well received, obtaining a four-star review in The Times. The London concert at the Barbican was filmed for BBC4, and broadcast in a 90-minute programme titled The Songs of Sandy Denny in November 2012."]}, {"page": "Repton School", "response": ["* Blair Dunlop, musician"]}, {"page": "Willy Wonka", "response": ["Willy Wonka (portrayed by Johnny Depp as an adult and by Blair Dunlop in his youth) is once again the owner of a famous chocolate factory. Due to problems concerning industrial espionage, he has fired all his employees, among them Charlie's Grandpa Joe, and barred all public access to his factory for years. Wonka announces a contest in which five Golden tickets have been hidden under the wrappers of Wonka Bars throughout the world. The finders will each receive a tour of the factory and a lifetime supply of chocolate; in addition, one winner will receive a special prize at the end of the tour. Charlie is the last to find a ticket."]}, {"page": "Ashley Hutchings", "response": ["He and Judy Dunlop have a son, Blair Dunlop, born on 11 February 1992."]}, {"page": "Towersey Festival", "response": ["2018: The Shires, The Proclaimers, Richard Thompson Electric Trio, Beth Orton, Big Country, Sharon Shannon Band, Fisherman's Friends, Blair Dunlop, Brighouse and Rastrick Brass Band, Peter Knight and John SpiersOxford Mail, Proclaimers, Beth Orton and Fisherman's Friends announced for Towersey Festival 2018 (7 Feb 2018) – http://www.oxfordmail.co.uk/news/15925102.Proclaimers_among_headliners_for_Towersey_Festival_2018/Oxford Mail, Final Headline Act Announced, 13 March 2018, http://www.oxfordmail.co.uk/news/16083958.Final_headline_act_announced_for_Towersey_Festival/"]}, {"page": "BBC Radio 2 Folk Awards", "response": ["* Horizon Award: Blair Dunlop"]}, {"page": "Topic Records", "response": ["The label's 75th anniversary was marked on 23 August 2014 with a special concert at the 50th Towersey Village Festival, near Thame in Oxfordshire. Artists performed songs from the Topic catalogue, and included Norma Waterson, Eliza Carthy & the Gift Band, Lau, Fay Hield, Martin Carthy, Saul Rose, Blair Dunlop, Josienne Clarke and Ben Walker."]}, {"page": "Blair", "response": ["*Blair Dunlop (born 1992), English musician and actor"]}, {"page": "Charlie and the Chocolate Factory (film)", "response": ["** Blair Dunlop as Young Willy Wonka"]}, {"page": "The Albion Band", "response": ["The one constant in the band's history has been the band leader Ashley Hutchings, founding member of two other English folk rock groupings Fairport Convention and Steeleye Span, and it has been the home for most of the projects of his long career, though in the 2011 incarnation of the band he has handed over the reins to his son Blair Dunlop.", "In July 2011, Hutchings announced that the Albion Band would be forming again, and for the first time he himself would not be a member. Instead he passed the baton to his son – the guitarist and singer Blair Dunlop. This new line-up also features a number of other current folk performers from a range of backgrounds reflecting earlier versions of the Albion Band. These members include Folk Award nominee Katriona Gilmore (Tiny Tin Lady, Gilmore/Roberts) on fiddle and vocals, vocalist, concertina player and guitarist Gavin Davenport (Crucible, Glorystrokes, Hekety), drummer Tom Wright (Eliza Carthy projects/Glorystrokes), and Tim Yates (Blackbeard's Tea Party/The QP) on bass - only the second bass player in the band's history, and lead guitarist and relative newcomer Benjamin Trott. This line-up released an own label EP Fighting Room in 2011 and their first studio album Vice of the People in 2012."]}, {"page": "1992 in the United Kingdom", "response": ["** Blair Dunlop, actor and musician"]}, {"page": "List of characters played by multiple actors in the same film", "response": ["* Blair Dunlop and Johnny Depp as Willy Wonka in Charlie and the Chocolate Factory (2005)"]}, {"page": "Fairport's Cropredy Convention appearances", "response": ["*Blair Dunlop"]}]}}