{"wiki_id": "http://www.wikidata.org/entity/Q29079782", "itemLabel": "James Rebanks", "itemDescription": "English writer and farmer", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Rebanks", "wikipedia_page": {"main": "James Rebanks (born 1974) is an English sheep farmer and author, from Matterdale in Cumbria. His first book, The Shepherd's Life, was published in 2015, and he published English Pastoral  in 2020. He also published The Illustrated Herdwick Shepherd in 2015 and The Shepherd's View: Modern Photographs from an Ancient Landscape in 2016.", "link_mentions": [{"page": "Lake District", "response": ["Memoirist and nature writer James Rebanks has published several books about the Lake District, including two acclaimed books that detail his life as a sheep farmer: The Shepherd's Life: A Tale of the Lake District (2015) and English Pastoral: An Inheritance (2020)."]}, {"page": "William Henry Hudson", "response": ["James Rebanks' 2015 book The Shepherd's Life about a Lake District farmer was inspired by Hudson's work of the same name: \"But even more than Orwell or Hemingway, W.H. Hudson turned me into a book obsessive ...\" (p. 115), and: \"One day, I pulled A Shepherd's Life by W.H. Hudson from the bookcase ...and the sudden life-changing realization it gave me that we could be in books – great books.\" (p. 114)"]}, {"page": "Robin Page (journalist)", "response": ["Recent projects involving the CRT include an attempt in 2020 to buy a farm in the Lake District. This would have been a community-based project involving the Friends of the Lake District and the author and farmer James Rebanks."]}, {"page": "List of Today programme guest editors", "response": ["*James Rebanks"]}, {"page": "The Shepherd's Life", "response": ["The Shepherd's Life: A Tale of the Lake District is an autobiographical book by James Rebanks, a sheep farmer from Matterdale, Cumbria, England, published by Allen Lane in 2015. "]}, {"page": "List of books featured on Book of the Week in 2015", "response": ["* The Shepherd's Life – James Rebanks"]}, {"page": "English Pastoral (book)", "response": ["#REDIRECT James Rebanks"]}, {"page": "Herdwick Shepherd", "response": ["#REDIRECT James Rebanks"]}, {"page": "Clarkson's Farm", "response": ["Other farmers were also reported to have reacted \"overwhelmingly favourable\" to Clarkson's Farm. The sheep farmer James Rebanks said that the farming community \"all loved that programme\", and that Clarkson had done more for farming in one series than 30 years of the BBC's long-running farming programme Countryfile. Viewers have found the programme educational and entertaining, and that \"they now feel much better informed about farming\". The National Farmer's Union has awarded Clarkson 2021 Farming Champion of the Year as \"a vocal champion for the British farming industry\", and producing that year a show that showcased the realities of farming and one that \"has really resonated with the public\". Clarkson and his farm assistant Kaleb Cooper won the Flying the Flag for British Agriculture award at the British Farming Awards."]}, {"page": "Pastoral Song", "response": ["#REDIRECT James Rebanks"]}]}}