{"wiki_id": "http://www.wikidata.org/entity/Q2903244", "itemLabel": "Bill Haydon", "itemDescription": "character by John le Carré", "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_Haydon", "wikipedia_page": {"main": "Bill Haydon is a fictional character created by John le Carré who features in le Carré's 1974 novel Tinker Tailor Soldier Spy. He is a senior officer in the British Secret Intelligence Service who serves as a Soviet mole. The novel follows aging spymaster George Smiley's endeavours to uncover the mole. The character is partly modelled after the real-life double agent Kim Philby, part of the notorious Cambridge Five spy ring in Britain, who defected to the USSR in 1963.", "link_mentions": [{"page": "Colin Firth", "response": ["In 2009, Firth received international acclaim for his performance in Tom Ford's A Single Man, for which he gained the BAFTA Award and his first Academy Award nomination. He subsequently appeared as MI6 agent Bill Haydon in Tinker Tailor Soldier Spy (2011), and as secret agent Harry Hart in Kingsman: The Secret Service (2014) and its sequel Kingsman: The Golden Circle (2017). In 2018 he co-starred in the musical fantasy Mary Poppins Returns, and the following year, he appeared in the Sam Mendes' war film 1917. In 2012, he founded the production company Raindog Films, where he served as a producer for Eye in the Sky (2015) and Loving (2016). His films have grossed more than $3 billion from 42 releases worldwide. In 2011, he received a star on the Hollywood Walk of Fame, and was selected as one of the Time 100.\"Full List – The 2011 Time 100\", Time, 21 April 2011. Retrieved 8 October 2012.", "Firth appeared as senior British secret agent Bill Haydon in the 2011 adaptation of the John le Carré novel Tinker Tailor Soldier Spy, directed by Tomas Alfredson and co-starring Gary Oldman, Benedict Cumberbatch, Tom Hardy, Mark Strong and John Hurt. It gathered mostly excellent reviews. The Independent described Firth's performance as \"suavely arrogant\" and praised the film. Deborah Young in The Hollywood Reporter thought Firth got \"all the best dialogue\", which he delivered \"sardonically\". Leslie Felperin in Variety wrote that all the actors brought their \"A game\" and Firth was in \"particularly choleric, amusing form.\""]}, {"page": "Tinker Tailor Soldier Spy", "response": ["David Cornwell, who wrote under the pseudonym John le Carré, worked as an intelligence officer for MI5 and MI6 (SIS) in the 1950s and early 1960s. Senior SIS officer Kim Philby's defection to the USSR in 1963, and the consequent compromising of British agents, was a factor in the 1964 termination of Cornwell's intelligence career. In the novel, the character of Bill Haydon, with his easy charm and strong social connections, bears a close resemblance to Philby.", "The failure resulted in the dismissal of Control, Smiley, and allies such as Connie Sachs and Gerald Westerby, and their replacement by a new guard consisting of Percy Alleline, Toby Esterhase, Bill Haydon, and Roy Bland. Control has since died, and Smiley's former protege, Peter Guillam, has been demoted to the \"scalphunters\".", "Smiley visits Sachs, discovering that she confronted Alleline about her discovery that Polyakov was actually a Soviet Colonel called Gregor Viktorov, but he ordered her to drop the subject. She also mentions rumours of a secret Soviet facility for training moles, and makes allusions to Prideaux and Bill Haydon's relationship being more than just platonic friendship.", "Smiley suspects a link between Merlin and the botched Operation Testify. Sam Collins, who was duty officer that night, tells Smiley that Control ordered him to relay the report of the Czech operation only to him, but that when he did so, Control froze up, and that Bill Haydon's sudden arrival was the only reason the hierarchy didn't fall apart that night. Smiley then visits Max, a Czech operative who served as a legman for Jim on the operation, who tells Smiley that Prideaux gave him instructions to leave Czechoslovakia any way he could if Jim didn't surface at the rendezvous at the appointed time. Next, Smiley pays a visit to Jerry Westerby, who tells Smiley of his trip to Prague where he picked up a story about Jim by a young army conscript, who insisted that the Russians were in the woods waiting a full day before the ambush.", "* Roy Bland: Second in command of London Station to Bill Haydon. Recruited by Smiley at Oxford, he was the top specialist in Soviet satellite states and spent several years under cover as a left-wing academic in the Balkans before being instated in the Circus.", "* Bill Haydon: Commander of London Station, he has worked with the Circus since the war. A polymath, he was recruited at Oxford where he was a close companion of Prideaux. One of Ann Smiley's cousins, he has an affair with her, and this knowledge subsequently becomes widely known. One of the four who ran the double agent codenamed Merlin.", "* Jim Prideaux: His Circus codename was Jim Ellis. Raised abroad partially, he is first identified as a prospective recruit by fellow student Bill Haydon at Oxford. He was shot in Czechoslovakia during the collapse of Operation Testify. Former head of the scalphunters. Now teaches at a boys' prep school.", "A TV adaptation of the Tinker Tailor Soldier Spy was made by the BBC in 1979. It was a seven-part serial and was released in September of that year. The series was directed by John Irvin, produced by Jonathan Powell, and starred Alec Guinness as George Smiley, with Ian Richardson as Bill Haydon. Ricki Tarr was played by Hywel Bennett. In the US, syndicated broadcasts and DVD releases compressed the seven-part UK episodes into six, by shortening scenes and altering the narrative sequence.", "Swedish director Tomas Alfredson made a film adaptation in 2011, based on a screenplay by Bridget O'Connor and Peter Straughan. The film was released in the UK and Ireland on 16 September 2011, and in the United States on 9 December 2011. It included a cameo appearance by John le Carré in the Christmas party scene as the older man in the grey suit who stands suddenly to sing the Soviet anthem. The film received numerous Academy Award nominations including a nomination for Best Actor for Gary Oldman for his role as George Smiley. The film also starred Colin Firth as Bill Haydon, Benedict Cumberbatch as Peter Guillam, Tom Hardy as Ricki Tarr, and Mark Strong as Jim Prideaux."]}, {"page": "George Smiley", "response": ["Several years pass between Smiley's appearance in The Looking Glass War, set circa 1964, and Tinker Tailor Soldier Spy, which takes place in 1973. During this period, Smiley's position in the Circus comes to be threatened by his contemporary Bill Haydon, proteges Toby Esterhase and Roy Bland, and ambitious newcomer Percy Alleline. Alleline develops a personal feud with Control due to the latter's class and ethnic prejudice against Percy's Scottish heritage, prompting factions to form within the Circus, with Control, Smiley, and Peter Guillam on one side and Alleline, Haydon, Esterhase, and Bland on the other. When Control is eased out of the Circus in late 1972 after the capture of agent Jim Prideaux in Czechoslovakia, Smiley too is forced out. The Circus is taken over by Alleline, with Haydon running \"London Station\", a branch overseeing all of the service's spy networks. Guillam remains in the Circus as Smiley's sole resource/ally, albeit in a greatly diminished position."]}, {"page": "The Honourable Schoolboy", "response": ["In 1974 George Smiley, the chief of the British secret intelligence service referred to as The Circus, is repairing the damage done to their operations by double agent Bill Haydon and looking for opportunities to target Karla, the Moscow Centre spymaster. Smiley and analysts Connie Sachs and Doc di Salis look into investigations suppressed by the outed mole and find that a historic investigation of a money laundering operation in Laos by Sam Collins could indicate a Moscow intelligence operation."]}, {"page": "Ian Richardson", "response": ["His first major role was his appearance as Bill Haydon (\"Tailor\") in the BBC adaptation of Tinker Tailor Soldier Spy (1979). He again played the part of Field Marshal Montgomery in Churchill and the Generals in 1979, a BBC television videotaped play concerning the relationship between Winston Churchill and generals of the Allied forces between 1940 and 1945.", "* Tinker, Tailor, Soldier, Spy (1979) - Bill Haydon"]}, {"page": "Savile Club", "response": ["Fictitious members of the Savile Club include Bill Haydon, the aristocratic polymath and British intelligence agent at the heart of John le Carré's novel Tinker Tailor Soldier Spy, and William French, wine merchant and Master of Wine (failed), in Alexander McCall Smith’s The Dog Who Came in from the Cold."]}, {"page": "List of LGBT characters in modern written fiction", "response": ["| Bill Haydon"]}, {"page": "Toby Esterhase", "response": ["Esterhase is exceptionally short; he's called \"Tiny Tobe\" by colleague Connie SachsTinker Tailor Soldier Spy, 91-92. and known around The Circus as \"Snow White\" for his meticulously maintained white hair,Tinker Tailor Soldier Spy, 178. which he covers with a net when he sleeps.Tinker Tailor Soldier Spy, 179. He further gained the nickname \"Our shadow foreign secretary\" from Bill Haydon.Tinker Tailor Soldier Spy, 178. Esterhase is known for multiple eccentricities, including \"dressing like a male model,\" washing his own clothes rather than having them laundered,Tinker Tailor Soldier Spy, 179. never smiling,Tinker Tailor Soldier Spy, 91-92. and sending all of his coworkers bottles of alcohol for Christmas. He has a unique manner of speech which vacillates between ultra-correct English and unusual syntax. Esterhase's former espionage partner, Peter Guillam, indicates that he's something of a polyglot, musing \"Toby spoke no known language perfectly, but he spoke them all.\" In The Secret Pilgrim, though, he is seen to speak fluent Hungarian to a pair of fellow expatriates, during which the narrator Ned notes that he becomes more animate and expressive than when speaking any other language.The Secret Pilgrim, 144-145. Guillam further recounts that Esterhase appears impervious to fear, recalling an incident in which he stopped to tip hotel employees while fleeing would-be captors. ", "When the Circus became polarised between supporters of the ailing Chief, \"Control\", and his rival, Percy Alleline, Esterhase gravitated towards Alleline out of ambition, forgetting his past loyalty to Smiley, who was Control's supporter. During Smiley's attempt to salvage Control's career and maintain control of the Circus, Esterhase is one of the first people Smiley appeals to, citing their past friendship; Esterhase demurs, citing Control's habit of allowing younger personnel to mistreat him. After Control is ousted and Alleline installed as the new chief of the Circus, Esterhase, along with Bill Haydon and Roy Bland, forms part of the \"magic circle,\" an elite group of spies with access to the Soviet intelligence operation code-named \"Witchcraft,\" which receives Soviet intelligence from the mysterious spy \"Merlin.\"Tinker Tailor Soldier Spy, 137-145, 314-315.", "After patient investigation, Smiley decides to interview Esterhase in private, in a safe house meeting to which he has been lured on a pretext by Peter Guillam. After realizing that he's been taken advantage of, and that Smiley has the official backing of Whitehall, Esterhase helps Smiley entrap the real mole, Bill Haydon."]}, {"page": "The Secret Pilgrim", "response": ["In the course of their operations, Brandt reveals his new girlfriend, Bella, who is said to be the daughter of a friend of Brandt's. Head of London Station, Bill Haydon orders Ned to inquire about Bella's credentials due to the fact that her sudden appearance in the network's inner circle appears suspicious. Ned eventually seduces (or rather, is seduced by) Bella and they begin an affair during Brandt's absence.", "Ned reflects that every employee of the Circus of a certain generation can recall where he or she was at the time of \"The Fall\" – Bill Haydon's exposure as a KGB mole. Ned himself was in Rome, in the middle of a celebratory dinner after installing a wiretap against a Roman Catholic cardinal suspected of involvement with arms dealers, when he received the telex from London with the shocking news.", "Toby Esterhase: Hungarian-born former head of Lamplighter Section (which deals with surveillance). Later Ned's desk officer and subsequently Head of Station in Vienna. Toby is said to have an infinite capacity for survival, which explains his tenure even after his cohorts were disgraced after Bill Haydon's betrayal."]}, {"page": "Karla (character)", "response": ["During his years as a field agent, Karla traveled in several countries, recruiting agents who would later become highly placed in their respective national regimes. He traveled to England in 1936 and 1941 and recruited Bill Haydon, code-named \"Gerald\", who eventually became the number-two man in the \"Circus\" (the British Secret Intelligence Service). At another time he recruited Nelson Ko, a high-ranking technocrat in the People's Republic of China (according to Connie Sachs, Karla was one of the few Soviets to predict the souring of Sino-Soviet relations).", "Karla is first mentioned in Tinker Tailor Soldier Spy as the spymaster who recruited and controls \"Gerald\", a mole inside the Circus. By the time of the novel, the mole—Bill Haydon—has become The Circus' number-two man; Karla uses his handler, Alexei Polyakov, to deliver fabricated intelligence that appears highly valuable. This allows the Circus (and, thus Karla) to gain access to highly valuable intelligence from the American CIA and also creates a perfect cover for Gerald's activities: Polyakov must pretend to his superiors that he is running a mole inside the Circus to meet with the Circus officials, so the Circus itself ignores and suppresses any indications that there is a mole, not realising that there really is.", "As Smiley drives to break the news to his cheating spouse, he reflects that Haydon's self-justifying \"confession\" was an inadequate explanation for becoming a traitor in the first place, and only Karla discerned the quality in Haydon that allowed him to be turned. In Smiley's words, only Karla saw \"the last little doll inside Bill Haydon.\""]}, {"page": "List of fictional double agents", "response": ["* Bill Haydon (Portrayed by Colin Firth) (Tinker Tailor Soldier Spy)", "* Bill Haydon (Tinker, Tailor, Soldier, Spy)", "* Bill Haydon"]}, {"page": "Tinker Tailor Soldier Spy (film)", "response": ["In 1973 \"Control\", head of British intelligence (\"The Circus\"), sends Jim Prideaux to Budapest to meet a Hungarian general who has the name of a mole at the top of British Intelligence. Prideaux, realising the meeting is a trap, is shot as he tries to leave. Control and his right-hand man George Smiley are forced to retire, and Control dies soon after. Percy Alleline becomes the new Chief, Bill Haydon his deputy, and Roy Bland and Toby Esterhase his lieutenants. They had already begun receiving Soviet Intelligence from a secret source (Operation \"Witchcraft\")."]}]}}