{"wiki_id": "http://www.wikidata.org/entity/Q2906438", "itemLabel": "George Leveson-Gower", "itemDescription": "British politician (1858-1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Leveson-Gower", "wikipedia_page": {"main": "Sir George Granville Leveson-Gower KBE (19 May 1858 – 18 July 1951), was a British civil servant and Liberal politician from the Leveson-Gower family. He held political office as Comptroller of the Household between 1892 and 1895 and later served as a Commissioner of Woods and Forests from 1908 to 1924. In 1921 he was knighted.", "link_mentions": [{"page": "Earl Granville", "response": ["The Hon. Frederick Leveson-Gower, younger son of the first Earl, was Member of Parliament for Derby, Stoke-upon-Trent and Bodmin. His son George Leveson-Gower was also a Member of Parliament.", "*Granville George Leveson-Gower, 2nd Earl Granville (1815–1891)", "*Granville George Leveson-Gower, 3rd Earl Granville (1872–1939)"]}, {"page": "Hannah Primrose, Countess of Rosebery", "response": ["There were times when Lady Rosebery's devotion to her husband was tested. Rosebery may have not been antisemitic before his marriage; however, the acerbic wit for which he was famous led him to make remarks that could have been taken in such a way, once his marriage had secured the Rothschild fortune. Rosebery seems to have disliked his first son, who he claimed looked \"Jewish.\" On seeing his son for the first time he remarked \"Le Jew est fait, rien ne vas plus,\"An untranslatable bilingual pun on the French Rouge et Noir phrase \"Le jeu est fait, rien ne va plus\"; literally, \"the game [or in this case, the Jew] has been made, nothing more can be done.\" In the game, the dealer invites the players to stake with the formula, 'Messieurs, faites vos jeux!' After a pause he exclaims 'Le jeu est fait, rien ne va plus!' after which no stake can be made. which must have been disconcerting for the child's Jewish mother. Rosebery, who has been described as febrile and supercilious,Young, p. 15. replied in a letter of congratulations on the birth of his heir from Mary Gladstone: \"I cannot pretend to be much excited by an event which occurs to almost every human being and which may cause me a great deal of annoyance.\" Rosebery then left his newborn child and wife (who was again pregnant) for a year-long tour of Australia. On another occasion, when the Roseberys were travelling in India, Rosebery is reported to have announced \"I will travel ahead, Hannah and the rest of the heavy baggage will follow the next day.\"McKinstry, p. 76, attributes the remark to Sir George Leveson-Gower's account of a conversation between himself and Rosebery."]}, {"page": "Comptroller of the Household", "response": ["* 1892–1895: George Leveson-Gower"]}, {"page": "Third Gladstone ministry", "response": ["| George Leveson-Gower"]}, {"page": "Liberal government, 1892–1895", "response": ["| George Leveson-Gower"]}, {"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| George Leveson-Gower"]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| George Leveson-Gower"]}, {"page": "North West Staffordshire (UK Parliament constituency)", "response": ["| George Leveson-Gower"]}, {"page": "Commissioners of Woods, Forests and Land Revenues", "response": ["*1908\tGeorge Leveson-Gower & Stafford Howard"]}, {"page": "Stoke-upon-Trent (UK Parliament constituency)", "response": ["| George Leveson-Gower"]}, {"page": "George Granville Leveson-Gower", "response": ["#REDIRECT George Leveson-Gower"]}, {"page": "List of United Kingdom by-elections (1885–1900)", "response": ["|George Leveson-Gower", "|George Leveson-Gower", "|George Leveson-Gower", "|George Leveson-Gower", "|George Leveson-Gower"]}, {"page": "Leveson-Gower family", "response": ["*George Leveson-Gower (1858–1951), politician"]}, {"page": "List of compositions by York Bowen", "response": ["* Cordovan Love Song, Op. 68 No. 4; words by George Leveson-Gower", "* The Hidden Treasure; words by George Leveson-Gower", "* If You Should Frown; words by George Leveson-Gower", "* In June; words by George Leveson-Gower", "* Love's Reckoning; words by George Leveson-Gower", "* Love and Death; words by George Leveson-Gower", "* Storm Song; words by George Leveson-Gower"]}, {"page": "Golden Grove, Carmarthenshire", "response": ["Wyatville was simultaneously occupied in the extensive remodelling of Windsor Castle for King George IV, and subsequently King William lV, as well as the building of a remarkably similar property, Lilleshall Hall in Shropshire, for Cawdor's cousin, George Leveson-Gower, nephew of the Duke of Sutherland. Correspondence exists between the two families relating to the huge costs of construction of both Golden Grove and Lilleshall, and the problems in bringing them to completion created by Wyatville's preoccupation with the complexities and demands of his new schemes for the king."]}, {"page": "Wedding of Prince George, Duke of York, and Princess Mary of Teck", "response": ["*George Leveson-Gower, Comptroller of the Household"]}, {"page": "List of ministerial by-elections to the Parliament of the United Kingdom", "response": ["|George Leveson-Gower", "|George Leveson-Gower", "|George Leveson-Gower", "|George Leveson-Gower"]}, {"page": "Leveson-Gower, George", "response": ["#redirectGeorge Leveson-Gower"]}]}}