{"wiki_id": "http://www.wikidata.org/entity/Q2903181", "itemLabel": "Bill Cuthbertson", "itemDescription": "Scottish rugby union footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_Cuthbertson", "wikipedia_page": {"main": "William Cuthbertson (born 6 December 1949) is a former Scotland international rugby union player. He won twenty one caps for Scotland playing as a lock.", "link_mentions": [{"page": "Seaford College", "response": ["*Bill Cuthbertson – Housemaster"]}, {"page": "Kilmarnock RFC", "response": ["Kilmarnock players to have been capped for  whilst at the club include hooker Andrew Ross and Bill Cuthbertson. Andrew toured with the British Lions in 1924 to South Africa while Bill was part of the 1984 Grand Slam winning team. Bill also played for Barbarian F.C. while at Killie. Other players of note to have played for Killie include;", "*  Bill Cuthbertson"]}, {"page": "1983 Five Nations Championship", "response": ["|LL ||4 ||Bill Cuthbertson", "|LL ||4 ||Bill Cuthbertson", "|LL ||4 ||Bill Cuthbertson"]}, {"page": "1984 Australia rugby union tour of Britain and Ireland", "response": ["SCOTLAND: Peter Dods, Peter Steven, Alexander Kennedy, Keith Robertson, Roger Baird, Douglas Wyllie, Roy Laidlaw (c), Alexander MacKenzie, Colin Deans, Iain Milne, Bill Cuthbertson, Alan Tomes, Jim Calder, John Beattie John Jeffrey. Res: Gerry McGuinness, Gary Callander, Tom Smith, Iain Hunter, Andrew Ker, Jim Renwick"]}, {"page": "1981–82 Australia rugby union tour of Britain and Ireland", "response": ["Tour captain was Tony Shaw, the first Queenslander since Bill McLean in 1947–48 to captain Australia in the UK. Shaw would later marry McLean's daughter and made the 81–82 tour alongside Bill's son Peter and nephew Paul. Mark Loane would captain the side in the Test against England when Shaw was dropped from the team following the Scottish Test. Shaw had retaliated recklessly to niggling from Scots player Bill Cuthbertson with a king-hit right in front of the referee. Shaw was to pay dearly for this as it would mark the end of his Test captaincy career.Howell p207", "Disaster struck in the Scotland Test for Wallaby captain Tony Shaw. He was questioning referee Quittenton when the Scottish lock Bill Cuthbertson kept niggling him. Shaw turned and hit Cuthbertson with a right, flooring him in front of the referee and the TV cameras. That moment marked the end of his Wallaby captaincy.", "SCOTLAND:  Andy Irvine (c), Keith Robertson, Jim Renwick, David Johnston, Roger Baird, John Rutherford, Roy Laidlaw, Jim Aitken, Colin Deans, Iain Milne, Bill Cuthbertson, Alan Tomes, Jim Calder, David Leslie, Iain Paxton"]}, {"page": "List of Scotland national rugby union players", "response": ["|816||CuthbertsonBill Cuthbertson||style=\"text-align:center; background:#A0D1F9;\"|lock||1980-02-02||v Ireland at Lansdowne Road"]}, {"page": "1981 Scotland rugby union tour of New Zealand", "response": ["*Bill Cuthbertson"]}, {"page": "1982 Scotland rugby union tour of Australia", "response": ["*Bill Cuthbertson"]}, {"page": "1984 Five Nations Championship squads", "response": ["# Bill Cuthbertson"]}, {"page": "1983 Five Nations Championship squads", "response": ["# Bill Cuthbertson"]}, {"page": "1982 Five Nations Championship squads", "response": ["# Bill Cuthbertson"]}, {"page": "1981 Five Nations Championship squads", "response": ["# Bill Cuthbertson"]}, {"page": "1980 Five Nations Championship squads", "response": ["# Bill Cuthbertson"]}]}}