{"wiki_id": "http://www.wikidata.org/entity/Q291300", "itemLabel": "Cerys Matthews", "itemDescription": "Welsh singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Cerys_Matthews", "wikipedia_page": {"main": "Cerys Matthews  (; born 11 April 1969) is a Welsh singer, songwriter, author, and broadcaster. She was a founding member of Welsh rock band Catatonia and a leading figure in the \"Cool Cymru\" movement of the late 1990s.Matthews programmes and hosts a weekly music show on BBC Radio 6 Music, a weekly blues show on BBC Radio 2, and a monthly show on the BBC World Service. She also makes documentaries for television and radio and is a roving reporter for The One Show. She founded 'The Good Life Experience', a festival of culture and the great outdoors in Flintshire in 2014, with Charlie and Caroline Gladstone and is author of Hook, Line and  Singer published by Penguin Books and children's stories Tales from the Deep and Gelert, A Man's Best Friend, published by Gomer.", "link_mentions": [{"page": "April 11", "response": ["*1969 – Cerys Matthews, Welsh singer-songwriter"]}, {"page": "Cardiff", "response": ["A large number of concerts are held in the city, the larger ones at St David's Hall, the Motorpoint Arena (previously known as the Cardiff International Arena) and occasionally the Principality Stadium. A number of festivals are also held in Cardiff, the largest being the Cardiff Big Weekend Festival, held annually in the city centre in the summer and playing host to free musical performances (from artists such as Ash, Jimmy Cliff, Cerys Matthews, the Fun Loving Criminals, Soul II Soul and the Magic Numbers), fairground rides and cultural events such as a Children's Festival that takes place in the grounds of Cardiff Castle. The annual festival claims to be the UK's largest free outdoor festival, attracting over 250,000 visitors in 2007."]}, {"page": "1969", "response": ["** Cerys Matthews, Welsh singer"]}, {"page": "Tom Jones (singer)", "response": ["In 1999, Jones released the album Reload, a collection of cover duets with artists such as the Cardigans, Natalie Imbruglia, Cerys Matthews, Van Morrison, Mousse T, Portishead, Stereophonics and Robbie Williams. The album went to No. 1 in the UK and sold over 4 million copies worldwide. Five singles from Reload charted in the UK top 40. The single \"Sex Bomb\" was released in early 2000 and became the album's biggest single, reaching No. 3 on the UK Singles Chart.", "Space and Cerys Matthews released \"The Ballad of Tom Jones\", a song about a fighting couple who are calmed down by listening to Jones's music on the radio. The song reached No. 4 in the UK in 1998."]}, {"page": "List of Welsh people", "response": ["*Cerys Matthews (born 1969), singer, songwriter, documentary maker, broadcaster, author"]}, {"page": "Catatonia (band)", "response": ["Catatonia were an alternative rock band from Wales who gained popularity in the mid-to-late 1990s. The band formed in 1992 after Mark Roberts met Cerys Matthews. The first major lineup featured Dafydd Ieuan on drums, Paul Jones on bass, and Clancy Pegg on keyboards. With this line-up the band recorded two EPs, For Tinkerbell and Hooked.", "The story that Catatonia were formed after Mark Roberts spotted Cerys Matthews busking in Cardiff in 1992 was an invention for the media in order to give the band a newsworthy biography. While the duo did go busking, they didn't meet this way. Matthews had been a fan of Roberts' previous band Y Cyrff. They began dating as well as writing songs together at the end of 1991. For four years after this they remained in the relationship, many aspects of this being played out publicly in their lyrics. They took the name of the band from Matthews' experience working in a mental health facility as well as the novel The Doors of Perception by Aldous Huxley. They believed it to mean a sense of extreme pleasure and sleep, and wrote the song \"Sweet Catatonia\", subsequently naming the band after the song. As Sweet Catatonia, Matthews and Roberts recorded a series of demos at the city centre youth project in Cardiff, nicknamed \"Grassroots\".", "thumb|right|Cerys Matthews (pictured in 2006) and Mark Roberts broke up after the release of Way Beyond Blue", "* Cerys Matthews – vocals (1992-2001)", "* Cerys Matthews – vocals", "* Cerys Matthews – vocals", "* Cerys Matthews – vocals", "* Cerys Matthews – vocals", "* Cerys Matthews – vocals", "* Cerys Matthews – vocals", "* Cerys Matthews – vocals"]}, {"page": "Paper Scissors Stone (album)", "response": ["The band were unable to promote the album, albeit with the exception of an appearance on Later...with Jools Holland and a few performances of \"Stone by Stone\", as Cerys Matthews was being treated for alcohol addiction and nervous exhaustion. The band had to cancel their upcoming eight venue UK tour which was due to take place during September due to ongoing concerns with Matthews' recovery. A statement by the record label Warners said that Matthews would not have \"recovered sufficiently\" from her treatment for \"anxiety and exhaustion.\"", "In 2006, Iain Forrester of Stylus Magazine said the album \"certainly doesn’t deserve any of the hatred it received in the press at the time. It has a fire to match their debut and a much wider musical scope, taking in the string-laden melodrama of 'Godspeed' (which certainly suits Cerys Matthews' bellowing vocals) and flirtations with dance on 'What It Is,' as well as rock blasts like 'Immediate Circle'.\"", "* Cerys Matthews – vocals"]}, {"page": "Fishguard", "response": ["* Cerys Matthews, lead singer of Catatonia went to Ysgol Bro Gwaun."]}, {"page": "Llangollen", "response": ["The Llangollen Fringe Festival is an independent arts festival, usually held in mid July in the town hall. The Fringe includes music, comedy, theatre, dance and workshops. Artists who have taken part in the Llangollen Fringe include Clement Freud, Rhys Ifans, the Damned, Cerys Matthews, Tracey Emin, Damien Hirst, Juan Martín, the Black Seeds, John Cooper Clarke, Will Self, Gang of Four, Lee Scratch Perry, Victoria Coren Mitchell and Gruff Rhys.Llangollen Fringe Festival"]}, {"page": "Ankst", "response": ["Between 1988 and 1997, the label put out some 80 releases before splitting in 1997 into two separate companies. Ankst Management (run by Llwyd and Jones and responsible for Melys, Super Furry Animals, Gorky's Zygotic Mynci, Los Campesinos!, The Longcut, and, for a time, Cerys Matthews) and Ankstmusik, the label (which is now based in Pentraeth on Anglesey and run by Williams), featuring such bands as Tystion, Ectogram, Zabrinski, Rheinallt H Rowlands, MC Mabon and Wendykurk."]}, {"page": "1969 in music", "response": ["*April 11 – Cerys Matthews, Welsh singer, songwriter, author and broadcaster"]}, {"page": "The Adam and Joe Show", "response": ["Dressed as policemen, Adam and Joe would raid rock stars' homes, then examine their record collections for embarrassing or surprising items. The star would then be forced to dance to the shameful discoveries. Victims included Frank Black, Gary Numan, Alexis Arquette, Tim Gane and Lætitia Sadier, Symposium, Dave Navarro, Cerys Matthews, Nick Heyward, Thomas Dolby, Ray Manzarek of The Doors and Mark E. Smith of The Fall. In 2009, Adam revealed on their BBC 6 Music show that some of the stars' 'homes' were not actually their own."]}, {"page": "All My Trials", "response": ["*Pop and rock artists have also released interpretations of the song, including Paul McCartney (1990 ; issued as a single and included on the British \"Highlights\" version of the Tripping the Live Fantastic live album), Dick and Dee Dee, Ray Stevens, and Cerys Matthews"]}, {"page": "BBC Radio 6 Music", "response": ["BBC Radio 6 Music (formerly known as BBC 6 Music between 2002 and 2011BBC, \"BBC Radio 6 Music Programmes – Radcliffe and Maconie, With Guy Garvey, Cerys Matthews and Jarvis Cocker\", 4 April 2011. Retrieved 15 December 2011.) is a British digital radio station run by the BBC, specialising primarily in alternative music. BBC 6 Music was the first national music radio station to be launched by the BBC in 32 years.BBC 6 Music pre-release website – archived website from 15 February 2002. \"Stand by for the BBC's first new national music radio station in 32 years\" It is available only on digital media: DAB radio, the Internet, digital television, and throughout northern and western Europe through the Astra 2B satellite.", "* Cerys Matthews"]}, {"page": "A470 road", "response": ["In 2014, Cerys Matthews presented a documentary on the A470 on BBC Radio 4, journeying from the north of the country to Cardiff Bay. The programme described the road as \"the M1 motorway of Wales\", despite most of the road being rural single-carriageway, with Matthews stopping off at places like Llanrwst and Rhayader."]}, {"page": "Lytham St Annes", "response": ["The headline act for the 2014 event was Tom Jones, with support from Cerys Matthews. The opening night, on Friday 1 August, was billed as \"The '80s versus the '90s\", and featured ABC, Blue, Hue and Cry, Atomic Kitten, the Christians, Captain Sensible, Heather Small, Howard Jones, B*Witched, China Crisis and Brother Beyond. The final day featured the Halle Orchestra, Michael Ball, Lesley Garrett and Rhydian Roberts.Lytham Proms Magazine (2014), published by www.lythamproms.co.uk, p.9"]}, {"page": "Aled Jones", "response": ["*\"Some Kind of Wonderful\" (duet with Cerys Matthews) (10 October 2007)"]}, {"page": "Flag of Wales", "response": ["Other musicians to have used the flag, include Nicky Wire of Manic Street Preachers, who will often drape the Welsh flag over amps when playing live, and Cerys Matthews who has worn the image on her clothes, while classical singer Katherine Jenkins has taken the flag on stage during live performances."]}, {"page": "NME Awards", "response": ["The 2008 award nominations were criticised in The Guardian for a lack of diversity and not including any female artists. Also in 2008, the ceremony was followed by the NME Big Gig at the adjacent O2 Arena, where The Cribs performed with Johnny Marr, followed by Klaxons, Bloc Party, Kaiser Chiefs, and Manic Street Preachers, who also performed with Tom Clarke of The Enemy and Cerys Matthews."]}, {"page": "Dolores O'Riordan", "response": ["Among those honouring O'Riordan were the Cranberries, Olé Koretsky, Andy Rourke (former bassist of the Smiths), Stephen Street, U2, Duran Duran, Julian Lennon, Liz Phair, James Corden, Josh Groban, Roger Bennett, Hozier, Foster the People, Elijah Wood, Chris Cornell's brother Peter, Mark Lanegan, Pearl Jam, Bryan Adams, Halsey, Kodaline, the The, Michael Stipe and R.E.M., Dave Davies of the Kinks, Adele, Garbage, Annie Lennox, Cerys Matthews, Lisa Stansfield, Michelle Branch, Dan Brodbeck, Slash, Graham Hopkins, Benjamin Kowalewicz, Vic Fuentes, actors Luke Evans and Francois Arnaud, Questlove, Kiesza, Diplo, Gao Xiaosong, Colin Parry, The Tim Parry Johnathan Ball Foundation for Peace, Ali Hewson, Adi Roche and Chernobyl Children International."]}, {"page": "Paul Jones (singer)", "response": ["In January 2018 it was announced that he would be replaced as presenter of BBC Radio 2's Blues Show by Cerys Matthews in mid-May. His last broadcast as presenter was on 23 April 2018; his live guest was Eric Bibb and his last song played was Sonny Boy Williamson's \"Mighty Long Time\" (1951) which he described as \"one of my handful of most favourite blues records.\""]}, {"page": "Reload (Tom Jones album)", "response": ["Reload is the 34th album by Tom Jones, released in 1999. It contains fifteen duets with a range of artists including Van Morrison, Cerys Matthews, Stereophonics, Robbie Williams and Portishead, recorded with their usual record producers and in their usual studios. The tracks are mainly cover versions, with a new version of one of Jones' own songs, \"Looking Out My Window\" (1968), and one original track, \"Sex Bomb\"."]}, {"page": "Dolgellau", "response": ["Since 1992 Dolgellau has held  (\"Big Session\"), an annual world music festival. Originally free and held in the streets of the town, it has now grown too big for the centre of Dolgellau. Since 2002 it has been held on the outskirts of the town and admission is charged, which has allowed the organisers in recent years to book such acts as Bob Geldof, Genod droog, Cerys Matthews, , Meic Stevens, Super Furry Animals and Goldie Looking Chain. It attracts crowds of up to 5,000 every year and claims to be one of Europe's biggest and best world music festivals. Since 1995 it has been broadcast live on BBC Radio Cymru and since 1997 on S4C. In March 2009 it was announced that there would be no  in 2009, owing to debts of over £50,000, mostly the result of a wet event in 2007. Smaller musical events took place in pubs, etc., but the future format of the festival was put under review. The festival returned on a smaller scale in 2011, and has been organised annually since then."]}, {"page": "Porth", "response": ["The town is also the home of The Pop Factory, opened in 2000 with an opening ceremony attended by Tom Jones, Cerys Matthews and Kelly Jones.  It is both a television studio and recording studio.  The owners of the building also contribute to the local area, and organised the Tom Jones homecoming concert at Ynysangharad Park, Pontypridd, in May 2005."]}, {"page": "WaterAid", "response": ["WaterAid has been associated with the Glastonbury Festival since 1994. In 2006 the festival's founder Michael Eavis and his daughter Emily visited WaterAid's work in Mozambique and by 2007 130 WaterAid volunteers helped at the festival. In 2011, there were around 200 WaterAid volunteers present.. In 2016, by which time there were over 500 Wateraid volunteers at Glastonbury, the charity introduced Talking Toilets which gave out information voiced by celebrities such as Cerys Matthews and Brian Blessed."]}, {"page": "Radio Academy Awards", "response": ["|Cerys Matthews"]}, {"page": "Space (English band)", "response": ["Space are a British band from Liverpool, who formed in 1993 initially as a trio of Tommy Scott (vocals, bass, guitar), Jamie Murphy (vocals, guitar) and Jamie Island (drums), who was later replaced by Andy Parle. Keyboard player Franny Griffiths joined the line-up a year later, and the band rose to prominence throughout the mid-1990s with hit singles such as \"Female of the Species\", \"Me and You Versus the World\", \"Neighbourhood\", \"Avenging Angels\" and \"The Ballad of Tom Jones\", the latter a duet with Cerys Matthews of Catatonia."]}, {"page": "Heavenly Recordings", "response": ["In 2007, Barrett set up Caught By The River with Robin Turner and Andrew Walsh. CBTR commissions writers with a focus on the natural world and our relationships with it, and is currently run by Diva Harris. It has supported several new authors in the early stages of their careers, including Amy Liptrot and Luke Turner of The Quietus, who both wrote regular columns for Caught By The River that later became critically acclaimed books. CBTR also releases music on the Rivertones label and hosts stages at UK festivals including Port Eliot and Cerys Matthews' The Good Life Experience."]}, {"page": "Tin Planet", "response": ["Tin Planet peaked at #3 in the UK charts,  two places higher than Spiders. It was their first album to enter the Australian ARIA top 100 albums chart, debuting on 24 May 1998 and peaking at #74 the following week. The album peaked at #11 in New Zealand in May 1998. The songs \"Avenging Angels\", \"The Ballad of Tom Jones\" (a duet with Cerys Matthews of the band Catatonia), \"Begin Again\" and \"Bad Days\" were released as singles, all hitting the UK top 40.", "For \"The Ballad of Tom Jones\", Cerys Matthews of the Welsh band Catatonia, who Space had supported live back in 1996, was brought in to duet with Scott, which fueled rumours in the press that the two were linked romantically, when in fact they were just good friends. Yorkie provided the scratch-track for Matthews' vocals in the song's demo."]}, {"page": "Triple J Hottest 100, 1998", "response": ["| 92 || The Ballad of Tom Jones || Space with Cerys Matthews || "]}]}}