{"wiki_id": "http://www.wikidata.org/entity/Q291002", "itemLabel": "Barry Foster", "itemDescription": "British film and television actor (1927-2002)", "wikipedia_url": "https://en.wikipedia.org/wiki/Barry_Foster_(actor)", "wikipedia_page": {"main": "John Barry Foster (21 August 1931 – 11 February 2002) was an English actor who had an extensive career in film, radio, stage and television over almost 50 years. He was best known for portraying the title character in the British crime series Van der Valk (1972–1992) and Bob Rusk in Alfred Hitchcock's Frenzy (1972).", "link_mentions": [{"page": "Alfred Hitchcock", "response": ["Hitchcock returned to Britain to make his penultimate film, Frenzy (1972), based on the novel Goodbye Piccadilly, Farewell Leicester Square (1966). After two espionage films, the plot marked a return to the murder-thriller genre. Richard Blaney (Jon Finch), a volatile barman with a history of explosive anger, becomes the prime suspect in the investigation into the \"Necktie Murders\", which are actually committed by his friend Bob Rusk (Barry Foster). This time, Hitchcock makes the victim and villain kindreds, rather than opposites as in Strangers on a Train."]}, {"page": "February 11", "response": ["*  2002   – Barry Foster, English actor (b. 1931)"]}, {"page": "Wilhelm II, German Emperor", "response": ["* Barry Foster played the adult Wilhelm II in several episodes of the 1974 BBC TV series Fall of Eagles."]}, {"page": "Hayes, Hillingdon", "response": ["* Actor Barry Foster (1927–2002), best known as 1970s TV detective Van der Valk, grew up in Hayes."]}, {"page": "Beeston, Nottinghamshire", "response": ["*Barry Foster (1931–2002): actor famous as the Dutch detective Van Der Valk"]}, {"page": "2002 in film", "response": ["| style=\"text-align:center;\"| 11 || Barry Foster || style=\"text-align:center;\"| 74 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "1987 in film", "response": ["| Maurice || Cinecom Pictures / Merchant Ivory Productions || James Ivory (director/screenplay); Kit Hesketh-Harvey (screenplay); James Wilby, Hugh Grant, Rupert Graves, Denholm Elliott, Simon Callow, Billie Whitelaw, Barry Foster, Judy Parfitt, Phoebe Nicholls, Ben Kingsley, Patrick Godfrey, Mark Tandy, Kitty Aldridge, Helena Michell, Catherine Rabett, Peter Eyre, Julian Wadham, Orlando Wells, Richard Warner, Helena Bonham Carter || Romance, Drama || Live action"]}, {"page": "1983 in film", "response": ["| Heat and Dust || Universal Studios / Curzon Film Distributors / Merchant Ivory Productions || James Ivory (director); Ruth Prawer Jhabvala (screenplay); Greta Scacchi, Shashi Kapoor, Julie Christie, Christopher Cazenove, Nickolas Grace, Zakir Hussain, Julian Glover, Susan Fleetwood, Patrick Godfrey, Jennifer Kendal, Charles McCaughan, Madhur Jaffrey, Barry Foster || Historical, Romantic, Drama || Live action"]}, {"page": "1972 in film", "response": ["*Frenzy, directed by Alfred Hitchcock, starring Jon Finch, Alec McCowen, Barry Foster, Anna Massey – (U.K.)"]}, {"page": "The Battle of the River Plate (film)", "response": ["* Barry Foster as Able Seaman Roper, HMS Exeter (uncredited)", "* Anthony Newley has a small part as a radio operator. Donald Moffat and Barry Foster, both uncredited, were making their film debuts, as was Jack Gwillim."]}, {"page": "Ryan's Daughter", "response": ["* Barry Foster as Tim O'Leary"]}, {"page": "Battle of Britain (film)", "response": ["* Barry Foster as Squadron Leader Edwards"]}, {"page": "Struwwelpeter", "response": ["In a 1991 edition of the Thames Television detective series Van der Valk, entitled \"Doctor Hoffman's Children,\" the detective, played by Barry Foster, solves a series of murders after finding the book in the bedroom of his house, when his wife relates the tale of the scissorman to their granddaughter. The murders were all done in the style of events in the book.\"Doctor Hoffman's Children,\" Van Der Valk season 4 episode 1 (1991), where the book is used to solve the murders."]}, {"page": "The Adventure of Silver Blaze", "response": ["A 1962 dramatisation of \"Silver Blaze\" aired on the BBC Light Programme, as part of the 1952–1969 radio series starring Carleton Hobbs as Holmes and Norman Shelley as Watson. Another adaptation aired on British radio in 1978, starring Barry Foster as Holmes and David Buck as Watson."]}, {"page": "The Sweeney", "response": ["In Sweeney!, Regan and Carter become involved in a plot which shares similarities to the 1963 Profumo affair and British actor Barry Foster features as an American socialite loosely based on Stephen Ward. Made in 1976, and released in 1977, the film appears to be set in 1979. On screen and in-film references include the line \"The same damned speech you made in 1978\" and a large banner at the OPEC delegates meeting features the convention's logo and the year \"1979\".Sweeney! (1977) David Wickes [film]. EMI Films. This suggests that the events of the film occur after the end of the television series chronologically, assuming series 4 is set in 1978 as broadcast."]}, {"page": "Orde Wingate", "response": ["*In 1976, the BBC produced a three-part drama called Orde Wingate, based on his life, in which he was played by Barry Foster. The programme was made on a limited budget with reduced or stylized settings. It did not attempt to tell the complete story of his life, but presented key episodes in a non-linear way, mainly his time in Palestine but including Burma. Foster reprised his role as Wingate in a 1982 TV movie A Woman Called Golda."]}, {"page": "The Red-Headed League", "response": ["An adaptation aired on BBC radio in June 1978, starring Barry Foster as Holmes and David Buck as Watson. It was adapted by Michael Bakewell."]}, {"page": "Frenzy", "response": ["Frenzy is a 1972 British thriller film directed by Alfred Hitchcock. It is the penultimate feature film of his extensive career. The screenplay by Anthony Shaffer was based on the 1966 novel Goodbye Piccadilly, Farewell Leicester Square by Arthur La Bern. The film stars Jon Finch, Alec McCowen, and Barry Foster and features Billie Whitelaw, Anna Massey, Barbara Leigh-Hunt, Bernard Cribbins and Vivien Merchant. The original music score was composed by Ron Goodwin.", "The plot centres on a serial killer in contemporary London and the ex-RAF serviceman he implicates. In a very early scene there is dialogue that mentions two actual London serial murder cases: the Christie murders in the early 1950s, and the Jack the Ripper murders in 1888. Barry Foster has said that, in order to prepare for his role, he was asked by Hitchcock to study two books about Neville Heath, an English serial killer who would often pass himself off as an officer in the RAF.", "* Barry Foster as Robert \"Bob\" Rusk"]}, {"page": "List of South African television series", "response": ["|British television series, dubbed into Afrikaans, produced by Thames Television for the ITV network. It starred Barry Foster in the title role as Dutch detective Commissaris Piet, real name Simon van der Valk."]}, {"page": "Gielgud Theatre", "response": ["*1978: The Rear Column by Simon Gray, starring Jeremy Irons, Barry Foster, Simon Ward and Clive Francis"]}, {"page": "A Fall of Moondust", "response": ["and Barry Foster as Chief Engineer Lawrence. In 2008, the production was released on BBC Compact Disc ().https://www.youtube.com/watch?v=kPXz99NAODM"]}, {"page": "The Adventure of the Musgrave Ritual", "response": ["An adaptation aired on BBC radio in June 1978, starring Barry Foster as Holmes and David Buck as Watson. It was adapted by Michael Bakewell."]}, {"page": "Doomwatch", "response": ["Cast: John Paul as Dr Spencer Quist, Simon Oates as Dr John Ridge, John Nolan as Geoff Hardcastle, Jean Trend as Dr Fay Chantry, Joby Blanshard as Colin Bradley, Vivien Sherrard as Barbara Mason, James Maxwell as Dr Whittaker, Barry Foster as Dr Carson, Harold Bennett as George, Frederick Schiller as Mr. Faber, Gloria Connell as Duty Nurse, Keith Grenville as Dr Godfrey, Amanda Walker as Sister Trewin, Frank Littlewood as Mr. Kemp, Raymond Young as Mr. Tearson, Jeanie James as Second Nurse, Paul Nemeer as Doctor, Michael Ely, Clive Rogers and Joyce Freeman as Visitors."]}, {"page": "The Wednesday Play", "response": ["| Barry FosterErnest ClarkPhilip LockeDora ReisserAntony CarrickArthur MullardMichael BarringtonMichael Brennan", "| Barry FosterJeremy KempDavid BauerJerry StovinRobert ArdenThomasine HeinerGeorge RoubicekDavid Garth", "| Barry FosterJane Arden"]}, {"page": "Edmund Musgrave Barttelot", "response": ["He appears as a character in Simon Gray's 1978 play The Rear Column, which tells the story of the men of the rear column left by Stanley to wait for Tippu Tip. He is portrayed as weak and unstable. Barttelot was played by Barry Foster in the original production and in the 1980 BBC television version."]}, {"page": "The Adventure of the Blue Carbuncle", "response": ["A radio production adapted by Bill Morrison aired on 23 July 1978, with Barry Foster as Holmes and David Buck as Watson, as one of 13 Holmes stories adapted for BBC Radio 4. VV341 – The Valley of Fear\t"]}, {"page": "The Adventure of the Copper Beeches", "response": ["An adaptation aired on BBC radio in 1978, starring Barry Foster as Holmes and David Buck as Watson. It was adapted by Michael Bakewell."]}, {"page": "Grand Hotel (musical)", "response": ["| colspan=1 align=center| Barry Foster"]}, {"page": "Dunkirk (1958 film)", "response": ["* Barry Foster as the despatch rider who directs Tubby to the artillery battery"]}, {"page": "The Adventure of the Six Napoleons", "response": ["An adaptation of the story aired on BBC radio in 1978, starring Barry Foster as Holmes and David Buck as Watson."]}, {"page": "The Adventure of the Reigate Squire", "response": ["An adaptation titled \"The Reigate Squires\" aired on BBC radio in 1978, starring Barry Foster as Holmes and David Buck as Watson."]}, {"page": "The Adventure of the Naval Treaty", "response": ["An adaptation of the story aired on BBC radio in 1978, starring Barry Foster as Holmes and David Buck as Watson."]}, {"page": "The Adventure of the Solitary Cyclist", "response": ["An adaptation of the story aired on BBC radio in 1978, starring Barry Foster as Holmes and David Buck as Watson. It was adapted by Michael Bakewell."]}, {"page": "The Adventure of the Priory School", "response": ["An adaptation aired on BBC radio in 1978, starring Barry Foster as Holmes and David Buck as Watson. The production was adapted by Michael Bakewell."]}, {"page": "The Adventure of Charles Augustus Milverton", "response": ["An adaptation of the story aired on BBC radio in 1978, starring Barry Foster as Holmes and David Buck as Watson."]}, {"page": "The Adventure of the Abbey Grange", "response": ["An adaptation of the story aired on BBC radio in 1978, starring Barry Foster as Holmes and David Buck as Watson. It was adapted by Michael Bakewell."]}, {"page": "In the Red (novel)", "response": ["The seven-part radio adaptation of the same name (BBC Radio Four, 1995) by Tavener and Peter Baynham, starring Michael Williams and Barry Foster in the lead roles, was followed by three six-part sequels (BBC Radio Four, 1997-1999)."]}, {"page": "After Pilkington", "response": ["After Pilkington is a BBC television drama film (a black comedy) written by Simon Gray, starring Miranda Richardson, Bob Peck and Barry Foster. It was first broadcast as part of BBC Two's Screen Two series, in 1987.", "The quiet life of Oxford professor James Westgate (Bob Peck) is shattered when he is introduced to Penny (Miranda Richardson), the wife of his crass new colleague (Barry Foster). Westgate recognises her as his childhood sweetheart \"Patch\", and the two resume their friendship.  Westgate is bored with his mundane college life, including his German friend Boris who experiments on animals in the lab, and his lady friend Amanda, as well as the attentions of a shy male student who claims to be in love with him.  He is only too happy to be diverted into joining Penny in her search for missing archaeologist Pilkington (a fellow Oxford colleague). As Westgate's obsession with his childhood friend grows, he is drawn into a tangle of misunderstanding, intrigue, and murder.  Bob Peck imbues his character with comic ineptitude.", "*Barry Foster as Derek"]}, {"page": "Richard Hannay", "response": ["The 1973 BBC documentary Omnibus: The British Hero had Christopher Cazenove playing Hannay in a scene from Mr. Standfast, as well as a number of other such heroic characters, including Beau Geste, Bulldog Drummond and James Bond. Barry Foster played Hannay in a 1977 television adaptation of The Three Hostages."]}, {"page": "Caroline John", "response": ["After leaving Doctor Who and the birth of her first child, John appeared in the BBC drama series The Doctors playing the recurring role of Marilyn Lane for four episodes in 1971. In 1972, she appeared in the one-off BBC1 drama for the Omnibus strand, Actor, I said starring Barry Foster and Martin Jarvis, just a few weeks before appearing in the Z-Cars episode Operation Ascalon. For the next several years, John became a regular performer in BBC Radio dramas, which included appearances in Radio 4 series Afternoon Theatre, Five Morning Plays, The Monday Play, Saturday Night Theatre, Story Time and being a regular story teller on Woman's Hour. Various BBC radio productions covered in these strands were Thérèse with Vivien Merchant, Jane Eyre with Patrick Allen, How To Get Away With Murder, The Concert, New Grub Street with Robert Powell, Observations on a Jesting Man, Mr. Campion's Falcon, An Infinity of Changes and Jane Austen's Lady Susan amongst many others.  John played the role of Laura Lyons in the BBC adaptation of the Sherlock Holmes story The Hound of the Baskervilles, opposite Tom Baker. The four part adventure was produced by Barry Letts. She returned to radio for Radio 3's Light in Distant Rooms."]}, {"page": "Van der Valk", "response": ["Van der Valk is a British television crime drama series about a detective in Amsterdam, based on the novels of Nicolas Freeling. The main character, Simon \"Piet\" van der Valk, was played by Barry Foster from 1972 to 1992, and by Marc Warren since 2020.", "* Barry Foster as Commissaris Simon \"Piet\" Van der Valk "]}, {"page": "The Wild Geese", "response": ["* Barry Foster as Thomas Balfour"]}, {"page": "List of actors who have played Sherlock Holmes", "response": ["| Barry Foster"]}, {"page": "Twisted Nerve", "response": ["* Barry Foster as Gerry Henderson"]}, {"page": "The Three Hostages", "response": ["The story was adapted for television by the BBC in 1977. Written by John Prebble and directed by Clive Donner, the 85-minute television film The Three Hostages starred Barry Foster as Hannay, Diana Quick as Mary, Alexander Mackay as Hannay's son Peter John, Peter Blythe as Sandy Arbuthnot and John Castle as Medina. It was shown in the United States by PBS."]}, {"page": "Fall of Eagles", "response": ["*Barry Foster – older Kaiser Wilhelm II", "*Barry Foster – older Kaiser Wilhelm II"]}, {"page": "The Troubleshooters", "response": ["*Robert Driscoll (Barry Foster 1965), Mogul's head of public relations."]}, {"page": "Jeremy Gilley", "response": ["*Succubus (1987) TV film with Barry Foster, Lynsey Baxter, and Pamela Salem."]}, {"page": "Inspector Clouseau (film)", "response": ["In London, Sir Charles Braithwaite (Patrick Cargill), Commissioner for Scotland Yard, is struggling to solve an organized crime case. A gang has been performing robberies across Europe and the case has gone cold. England's Prime Minister, decides to request outside help to solve the case, which the press view as an insult. French Inspector Jacques Clouseau (Alan Arkin) is the one sent to assist. Sir Charles meets with Clouseau and briefs him on the case. Three suspects were in custody, but two, Frenchie LeBec (Tutte Lemkow) and Steven Frey (Michael Ripper) escaped. The only suspect still in custody is Addison Steele (Barry Foster). ", "* Barry Foster as Addison Steele"]}]}}