{"wiki_id": "http://www.wikidata.org/entity/Q292791", "itemLabel": "Beatrice Lillie", "itemDescription": "Canadian actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Beatrice_Lillie", "wikipedia_page": {"main": "Beatrice Gladys Lillie (29 May 1894 – 20 January 1989), known as Bea Lillie, was a Canadian-born British actress, singer and comedic performer.\nShe began to perform as a child with her mother and sister. She made her West End debut in 1914 and soon gained notice in revues and light comedies, becoming known for her parodies of old-fashioned, flowery performing styles and absurd songs and sketches. She debuted in New York in 1924 and two years later starred in her first film, continuing to perform in both the US and UK. She was associated with revues staged by André Charlot and works of Noël Coward and Cole Porter, and frequently was paired with Gertrude Lawrence, Bert Lahr and Jack Haley.\nDuring World War II, Lillie was an inveterate entertainer of the troops. She won a Tony Award in 1953 for her revue An Evening with Beatrice Lillie.", "link_mentions": [{"page": "Lesbian", "response": ["No location saw more visitors for its possibilities of homosexual nightlife than Harlem, the predominantly African American section of New York City. White \"slummers\" enjoyed jazz, nightclubs, and anything else they wished. Blues singers Ma Rainey, Bessie Smith, Ethel Waters, and Gladys Bentley sang about affairs with women to visitors such as Tallulah Bankhead, Beatrice Lillie, and the soon-to-be-named Joan Crawford.Faderman (1991), p. 71.Zimmerman, p. 354. Homosexuals began to draw comparisons between their newly recognized minority status and that of African Americans.Faderman (1991), p. 68. Among African American residents of Harlem, lesbian relationships were common and tolerated, though not overtly embraced. Some women staged lavish wedding ceremonies, even filing licenses using masculine names with New York City.Faderman (1991), p. 73. Most homosexual women, however, were married to men and participated in affairs with women regularly.Zimmerman, p. 355."]}, {"page": "May 29", "response": ["*1894 – Beatrice Lillie, Canadian-English actress, singer and writer (d. 1989)"]}, {"page": "Tom Lehrer", "response": ["Lehrer had a breakthrough in the United Kingdom on December 4, 1957, when the University of London awarded a doctor of music degree honoris causa to Princess Margaret, and the public orator, Professor J. R. Sutherland, said it was \"in the full knowledge that the Princess is a connoisseur of music and a performer of skill and distinction, her taste being catholic, ranging from Mozart to the calypso and from opera to the songs of Miss Beatrice Lillie and Tom Lehrer.\" This prompted significant interest in Lehrer's works and helped to secure distribution for his five-year-old debut album in Britain. It was there that his music achieved real sales popularity, as a result of the proliferation of university newspapers referring to the material, and inadvertently due to the BBC, which in 1958 banned from broadcast 10 of the 12 songs on the album. By the end of the 1950s, Lehrer had sold 370,000 records."]}, {"page": "1989", "response": ["** Beatrice Lillie, Canadian actress (b. 1894)"]}, {"page": "Drag queen", "response": ["* 1967 – Thoroughly Modern Millie, an American musical starring Julie Andrews, James Fox, Mary Tyler Moore, Carol Channing, John Gavin, and Beatrice Lillie, notable where Fox's character dresses in drag in order to find out what happened to Tyler Moore's character."]}, {"page": "The King and I", "response": ["Holtzmann initially wanted Cole Porter to write the score, but he declined. She was going to approach Noël Coward next, but happened to meet Dorothy Hammerstein (Oscar's wife) in Manhattan. Holtzmann told Dorothy Hammerstein that she wanted Rodgers and Hammerstein to create a show for Lawrence, and asked her to see that her husband read a book that Holtzmann would send over. In fact, both Dorothy Rodgers and Dorothy Hammerstein had read the novel in 1944 and had urged their husbands to consider it as a possible subject for a musical. Dorothy Hammerstein had known Gertrude Lawrence since 1925, when they had both appeared in André Charlot's London Revue of 1924 on Broadway and on tour in North America.Dorothy Hammerstein was Beatrice Lillie's understudy in that production. See Los Angeles Times, August 5, 1987. Retrieved November 17, 2013"]}, {"page": "Auntie Mame", "response": ["The novel was adapted for the stage by Jerome Lawrence and Robert E. Lee. Running from October 31, 1956, to June 28, 1958, at the Broadhurst Theatre, the original Broadway production starred Rosalind Russell in the title role.Beatrice Lillie was the replacement for Greer Garson (Broadway and London)Beatrice Lillie – Broadway Cast & Staff - IBDBGreer Garson – Broadway Cast & Staff - IBDB The original Broadway cast also included Robert Allen as Mr. Babcock, Yuki Shimoda as Ito, Robert Smith as Beau, Polly Rowles as Vera Charles, Jan Handzlik as young Patrick and Peggy Cass as Agnes Gooch.Auntie Mame at the Internet Broadway Database. Retrieved 2014-03-15. In 1957, both Russell and Cass were nominated for Tony Awards, and Cass won the award.", "The British production of the play opened at the Adelphi Theatre in London on Sept 10, 1958, and ran for 301 performances, closing on 30 May, 1959. Beatrice Lillie played the title role, with Florence Desmond as Vera Charles (later replaced by Joan Peart). Dinsdale Landen played Patrick Dennis (as a man), Agnes Gooch was Rosamund Greenwood and Jill Melford played Pegeen Ryan."]}, {"page": "Lyme, Connecticut", "response": ["* Beatrice Lillie (1894–1989), lived on Grassy Hill Rd, Lyme in the 1970s; Canadian-born actress."]}]}}