{"wiki_id": "http://www.wikidata.org/entity/Q2923499", "itemLabel": "Bradley McIntosh", "itemDescription": "English-Jamaican singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bradley_McIntosh", "wikipedia_page": {"main": "Bradley John McIntosh (born 8 August 1981), also known as City Boy, is an English singer, rapper, record producer and actor. He was a member of the pop group S Club 7 where he enjoyed five years of hit singles, arena tours and awards. Since 2008, he has been a member of spin-off group S Club 3.\n\n", "link_mentions": [{"page": "Brixton", "response": ["*Bradley McIntosh, member of pop group S Club 7."]}, {"page": "London Borough of Sutton", "response": ["* Bradley McIntosh, member of former chart topping band S Club 7, attended Greenshaw High School."]}, {"page": "S Club 7", "response": ["S Club 7 were a British pop group from London, created by former Spice Girls manager Simon Fuller and consisting of members Bradley McIntosh, Hannah Spearritt, Jo O'Meara, Jon Lee, Paul Cattermole, Rachel Stevens and Tina Barrett. The group was formed in 1998 and quickly rose to fame by starring in their own BBC television series, Miami 7. In their five years together, S Club 7 had four UK number-one singles, one UK number-one album, and a string of hits throughout Europe as well as a Top 10 hit on the US Hot 100, with their 2000 single \"Never Had a Dream Come True\". They recorded four studio albums, released 11 singles and went on to sell over 10 million albums worldwide.", "Simon Fuller has commented that he came upon the concept of S Club 7 the day after he was fired by the Spice Girls in November 1997, with the new group meant as a \"continuation\" of the latter. He selected the members for the group after auditioning from over 10,000 hopefuls; Rachel Stevens was the only member of the group who did not audition to gain admittance into the group. Instead, two producers from 19 Management approached her and asked her to go into the studio to record a demo tape for Fuller. Both Jo O'Meara and Paul Cattermole were spotted by producers from 19 and asked to audition. After the auditions had been advertised in The Stage, Jon Lee, Hannah Spearritt, Tina Barrett and Bradley McIntosh auditioned. After some final adjustments, including the removal of three original members, S Club 7 was formed."]}, {"page": "1981 in music", "response": ["**Bradley McIntosh, English pop singer (S Club 7)"]}, {"page": "Bradley", "response": ["* Bradley McIntosh (born 1981), member of S Club 7"]}, {"page": "Jack Osbourne", "response": ["In 2005, Osbourne started to show more of an interest in fitness through co-hosting the ITV2 show, Celebrity Wrestling: Bring It On!. In February that year, he appeared in Extreme Celebrity Detox in which he took part in t'ai chi and climbing exercises, which possibly inspired himJack's Diary about Extreme Celebrity Detox (Feb 2005),  Retrieved 21 April 2007. to appear in his own programme, Jack Osbourne: Adrenaline Junkie produced by the same production company (Ginger Productions) as Extreme Celebrity Detox. Osbourne lost (50Lb) 23 kgMen's Fitness (February 2006), Rebourne. Retrieved 21 April 2007. in Thailand at a Muay Thai martial arts camp in Pattaya in order to be fit enough to climb El Capitan (which he achieved) whilst filming the first series of Jack Osbourne: Adrenaline Junkie. It aired on ITV2 in the UK, the Travel Channel in the United States, The LifeStyle Channel in Australia, GOtv in South Africa and on MuchMusic in Canada. Adrenaline Junkie focuses on Osbourne's training for sports like rock climbing, mountaineering and a jungle trek in Belize from the Chiquibul Chamber through dense jungle ending at Caracol ruins (guided by the UK extreme conservation organisation Trekforce). He showcased the effects of his weight loss with the two semi-naked photo shoots for Cosmopolitan magazine in 2005 to raise awareness of testicular cancer. The first, taken in June 2005, shows him sitting on a motorbike; the second appeared in the December 2005 issue.TV Squad (16 Nov 2005), Jack Osbourne goes nude for Cosmo. Retrieved 18 April 2007. After the first series of Adrenaline Junkie he began filling in for Stephen Mulhern on CITV's Saturday morning kids' show Holly & Stephen's Saturday Showdown (the show has now ended). Osbourne took part in Sport Relief and faced former singer in the band S Club 7, Bradley McIntosh, in a boxing match of three one-minute rounds to raise money for the charity. Osbourne won by a unanimous decision."]}, {"page": "Sutton, London", "response": ["*Bradley McIntosh, member of former chart topping band S Club 7, attended Greenshaw High School."]}, {"page": "Tina Barrett", "response": ["Barrett became a member of S Club 7 after a series of auditions, along with members Paul Cattermole, Jon Lee, Bradley McIntosh, Jo O'Meara, Hannah Spearritt and Rachel Stevens in 1999. During five years they released four number one singles and one number one album. They also had a series of TV shows, which were: Miami 7, L.A. 7, Hollywood 7 and Viva S Club, and they also starred in a film, Seeing Double. Barrett led some of the tracks on the groups' albums, such as \"I'll Be There\" and \"Stronger\", which was set to be a single, but was canceled when Paul Cattermole left the group. Barrett co-wrote two other songs that she also led: \"Discotek\" (the B-side to the single \"Alive\") and \"Secret Love\", a song from the group's final album Seeing Double. The six remaining members stayed together as S Club until 2003, when they split after releasing their greatest hits album."]}, {"page": "The Sunday Night Project", "response": ["| Bradley McIntosh"]}, {"page": "Paul Cattermole", "response": ["Cattermole became a member of S Club 7 after a series of auditions, along with members Tina Barrett, Jon Lee, Bradley McIntosh, Jo O'Meara, Hannah Spearritt and Rachel Stevens in 1999. During five years they released four number one singles and one number one album. They also had a series of TV shows, which were: Miami 7, L.A. 7, Hollywood 7 and Viva S Club. The group rose to fame by starring in their own BBC television series, Miami 7, in 1999. Over the five years they were together, S Club 7 had four UK No.1 singles, one UK No.1 album, a string of hits throughout Europe, including a top-ten single in the United States, Asia, Latin America and Africa."]}, {"page": "Boyfriends & Birthdays", "response": ["* Bradley McIntosh"]}, {"page": "Jo O'Meara", "response": ["In November 2008, O'Meara, Bradley McIntosh, and Paul Cattermole formed the spin-off group S Club 3 and have been performing in nightclubs, universities and Butlins holiday camps around the United Kingdom. On 12 November 2008 a bottle was thrown during their performance in Bradford. It struck O'Meara, leaving her with a cut to the head requiring hospital treatment. A 20-year-old man was arrested and it was suggested the attack was linked to her Celebrity Big Brother appearance. ", "Following the S Club reunion Jo continued to tour with Tina Barrett and Bradley McIntosh performing as S Club 3. In 2017, the trio released a single titled \"Family\" for charity but failed to chart in the UK. "]}, {"page": "Dane Bowers", "response": ["Bowers appeared in the follow-up TV show to Totally Scott-Lee, called Totally Boyband, in which five boyband members from past groups were modelled into a new singing act called Upper Street.Totally Boyband (2006– ). IMBb.comTotally Boyband! And the Members Are.... Mtv.co.uk (1 August 2006). Retrieved on 2012-04-11. The group featured him alongside Lee Latchford-Evans of Steps, Jimmy Constable of 911, New Kids on the Block's Danny Wood, and S Club's Bradley McIntosh. The series commenced on MTV in the UK in September 2006, but their first single only charted at No. 35 and the group subsequently disbanded.Dave Parrack Boyband Upper Street Split? Pop Buzz UK (13 November 2006)"]}, {"page": "Bring It All Back", "response": ["\"Bring It All Back\" is notable for being the only S Club 7 single on which all four female members share lead vocals. The first verse is shared by Jo O'Meara and Rachel Stevens, while the second verse is split between Tina Barrett and Hannah Spearritt. Bradley McIntosh, Jon Lee and Paul Cattermole provide backing vocals and additional vocals on the final chorus. The single contains an extended version of the track with an additional refrain and chorus, as well as a club remix by K-Klass, which appears on all international versions of the single."]}, {"page": "Jonny L", "response": ["* 2005: \"Back to Your Roots\" (feat. Bradley McIntosh)"]}, {"page": "1981 in the United Kingdom", "response": ["* 8 August – Bradley McIntosh, pop singer (S Club 7)"]}, {"page": "Sport Relief", "response": ["The second half was back on BBC One from 22.30 to 01.00. It included golf legend Nick Faldo competing against Lineker and Evans in a comedy pitching competition on the roof of the studio where they had to get their balls into the mouths of giant cut outs of Bruce Forsyth and Jimmy Tarbuck, the second part of A Question of Sport Relief, Jon Culshaw's live performance as George W. Bush, Catherine Tate in a new football sketch as \"Nan\" from The Catherine Tate Show and Sir Steve Redgrave and Colin Jackson taking part in a live power pint competition. There was also the last ever edition of Footballer's Wives which had been transferred from ITV for the night and included a guest appearance by Graham Norton as Brendan Spunk, José González performed in the studio, several members of the Sport Relief Red Socks cricket team were there to talk about their tour to India, including Harry Judd, Nick Hancock, Nick Knowles, Jack Russell and Phil Tufnell whilst Derek Acorah starred in a new sketch based in the Match of the Day studio. The third Sport Relief Celebrity Boxing bout was won by Jack Osbourne who defeated the formed S Club 7 singer Bradley McIntosh. It was presented by Mark Durden-Smith with Dave Spikey as ringmaster."]}, {"page": "Seeing Double (2003 film)", "response": ["*Bradley McIntosh as Bradley"]}, {"page": "British African-Caribbean people", "response": ["With multiple UK number-one achievements between 1999 and 2001, S Club 7 had two members of African-Caribbean heritage. Bradley McIntosh was born to Afro-Jamaican parents, who had been members of funk group The Cool Notes, and Tina Barrett, who has Afro-Guyanese and English ancestry."]}, {"page": "Don't Stop Movin' (S Club 7 song)", "response": ["\"Don't Stop Movin'\" is a song by British pop group S Club 7, released as a single on 23 April 2001. The song was written by the group, along with their regular songwriter Simon Ellis, together with Sheppard Solomon. Solomon had worked on hits in the 1990s by Eternal and Michelle Gayle. The song features lead vocals by Bradley McIntosh and Jo O'Meara and has a disco style with violins and other stringed instruments. It was the lead single from S Club 7's third studio album, Sunshine (2001)."]}, {"page": "Reach (S Club 7 song)", "response": ["The single was notable for not being released in neither Australia nor the United States, both of whom had received releases of the band's first three singles from their debut album. The reason for this was not given, so in both countries, \"Natural\" served as the lead single from 7. The single contains an additional remix by Eiffel 65, while a limited edition 3-inch CD available with cans of Pepsi contains a further remix by Steve Anderson. This version has Jo O'Meara and Bradley McIntosh dividing Jon Lee's verse between them, and O'Meara also takes Paul Cattermole's middle-eight section. The cassette format of \"Reach\" features an exclusive track, a karaoke version of \"Reach\". Also included on the single are two B-sides, \"I'll Be There\" and \"Someday, Someway\", and a remix of \"S Club Party\" by Cattermole and McIntosh. The Almighty remix of \"Reach\", featuring on the \"Never Had a Dream Come True\", contains an alternate vocal take with Lee singing O'Meara's first verse. \"I'll Be There\" was later included on 7, while \"Someday, Someway\" remained as a B-side. It was later performed during episode ten of L.A. 7, \"Making Movies\"."]}, {"page": "You're My Number One", "response": ["The music video for the song was shot in New York City. Throughout, S Club 7 are performing a dance routine in front of a white background. Halfway through the video, the group partake in a foam fight. Towards the end, the band are joined by many more dancers who perform the same hand jive-esque routine until the end of the music video. In an interview, Bradley McIntosh recalls that each member was brought a selection of outfits to choose from to wear in the video, but he was only brought one outfit to wear, which he hated. The video has gained over one million views on YouTube as of 11 September 2014."]}, {"page": "You (S Club 7 song)", "response": ["The first part of the video stars Rachel Stevens as a wife who cooks food for her husband portrayed by Paul Cattermole as he arrives home. But a mistress played by Jo O'Meara appears out of nowhere, distracts Cattermole and they start dancing. Then they enter another room through a curtain, revealing the other band members. The part ends with Hannah Spearritt dancing. The second part shows Stevens mowing the lawn. Jon Lee joins her, but soon goes to O'Meara, who is having a barbecue. The smoke from the grill shows the other six members dancing under umbrellas. Stevens looks while using a hose, which turns off then sprays her in the face. The third part takes place in the garage. Bradley McIntosh is repairing the car. Stevens looks at him, McIntosh does likewise. Then O'Meara appears in the car dancing with McIntosh. The others come in. Stevens is sad until the others sing to her. They all sing together and they drive off."]}, {"page": "Alive (S Club song)", "response": ["There were several changes made to the Seeing Double album following Jo O'Meara's debilitating back condition, which meant she had to take time out of the heavy promo campaigns and gruelling schedules and dance routines. On \"Alive\", \"Love Ain't Gonna Wait for You\" and \"Dance\", the band re-recorded O'Meara's lead vocals to be performed by Rachel Stevens during live promotions. The release was originally planned to have CD1 with O'Meara, and CD2 with Stevens, but, the idea was later scrapped in favour of O'Meara's vocals. The song was the poorest charting and selling S Club single in the band's history, peaking at #5 in the UK. Another note of interest regarding \"Alive\" was revealed on CD:UK's behind the scenes footage of the making of the video where Bradley McIntosh revealed that the original version of the song showcased Paul Cattermole on lead vocals rather than himself."]}, {"page": "Upper Street (group)", "response": ["Upper Street were a UK boy band formed in 2006 from the MTV-produced reality television series Totally Boyband. The members of the band were all ex-members of other groups. They were Dane Bowers of Another Level, Jimmy Constable of 911, Bradley McIntosh of S Club 7, and Danny Wood of New Kids on the Block. Lee Latchford-Evans of Steps was also originally in the line-up, but left due to conflict within the group. Their only single, \"The One\" was released in the United Kingdom on 23 October 2006 by Concept Records."]}, {"page": "Totally Boyband", "response": ["* Bradley McIntosh of S Club 7"]}, {"page": "Miami 7", "response": ["* Bradley McIntosh as Bradley"]}, {"page": "Viva S Club", "response": ["* Bradley McIntosh as Bradley"]}, {"page": "L.A. 7", "response": ["* Bradley McIntosh as Bradley"]}, {"page": "Hollywood 7", "response": ["* Bradley McIntosh as Bradley"]}]}}