{"wiki_id": "http://www.wikidata.org/entity/Q2924934", "itemLabel": "Brian Keenan", "itemDescription": "Irish writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Keenan_(writer)", "wikipedia_page": {"main": "Brian Keenan  (born 28 September 1950) is a Northern Irish writer whose work includes the book An Evil Cradling, an account of the four and a half years he spent as a hostage in Beirut, Lebanon from 11 April 1986 to 24 August 1990.", "link_mentions": [{"page": "1990", "response": ["** Northern Ireland writer Brian Keenan is released from Lebanon after being held hostage for nearly 5 years."]}, {"page": "Simple Minds", "response": ["Simple Minds were the first band to sign up for Mandela Day, a concert held at Wembley Stadium, London, as an expression of solidarity with the then-imprisoned Nelson Mandela. Bands involved were asked to produce a song especially for the event – Simple Minds were the only act which produced one. This was \"Mandela Day\", which the band played live on the day (alongside cover versions of \"Sun City\" with Little Steven and a cover version of Peter Gabriel's \"Biko\" on which Gabriel himself took on lead vocals). \"Mandela Day\" was released on the Ballad of the Streets EP, which reached No. 1 in the UK Singles Chart (the only time the band did so).\"Belfast Child\" No. 1 in UK Singles Chart . Retrieved 19 August 2007. Another EP track, \"Belfast Child\", was a rewrite of the Celtic folk song \"She Moved Through the Fair\" (which had been introduced to Kerr by John Giblin) with new lyrics written about the ongoing war in Northern Ireland). The single was also an expression by Simple Minds of their support for the campaign for the release of Beirut-held hostage Brian Keenan, kidnapped by the Islamic Jihad."]}, {"page": "David Andrews (politician)", "response": ["Andrews paid for backing Colley in the leadership bid, being confined to the backbenches during Haughey's thirteen-year period as leader. During this period he maintained his legal practice and campaigned for the Guildford Four, the Birmingham Six, and Brian Keenan. He remained a vocal critic of Haughey during this period. After the Progressive Democrats were founded in 1985 Andrews considered joining the new party. In 1992, Albert Reynolds replaced Haughey as Taoiseach and Andrews was briefly appointed Minister for Foreign Affairs, vacating this position to Dick Spring, Tánaiste and Labour Party leader, after a subsequent election. Andrews was then appointed Minister for Defence and the Marine. In 1997, subsequent to a general election, Fianna Fáil were back in coalition with the Progressive Democrats, with Bertie Ahern as Taoiseach. Andrews was first appointed Minister for Defence, subsequently, after the resignation of Ray Burke becoming Minister for Foreign Affairs."]}, {"page": "Christopher Ewart-Biggs Memorial Prize", "response": ["*1991–92: Brian Keenan, An Evil Cradling"]}, {"page": "Ulster University", "response": ["Ulster has a large body of notable alumni, including MPs Kate Hoey, Gregory Campbell, Michelle Gildernew, Roberta Blackman-Woods and former deputy First Minister of Northern Ireland Mark Durkan, MLAs Alban Maginness, Basil McCrea and Seán Neeson, writers and authors including Anne Devlin, Dinah Jefferies, Colin Duriez, Calum Neill and Aodán Mac Póilin, poets including Gerald Dawe and Brendan Hamill, and artists including Jack Coulter, Colin Davidson, Oliver Jeffers, Freddie Freeburn, Victor Sloan, Andre Stitt, John Luke and John Kindness. Other alumni include composer Brian Irvine, musician David Lyttle, comedian Omid Djalili, former hostage and writer Brian Keenan, historian Simon Kitson, biomedical scientist and former Vice-Chancellor Gerry McKenna, visual artist Willie Doherty, photographer Mary Fitzpatrick, film producer Michael Riley, rugby player Brian Robinson, radio and television personality Gerry Anderson, nursing academic Alison Kitson, CEO of Cognizant Brian Humphries and senior police officer Barbara Gray."]}, {"page": "John McCarthy (journalist)", "response": ["McCarthy was a journalist working for United Press International Television News at the time of his kidnap by Islamic Jihad terrorists in Lebanon in April 1986, and was held in captivity until his release on 8 August 1991. He shared a cell with the Irish hostage Brian Keenan for several years. While a prisoner, he learned that his girlfriend, Jill Morrell, was actively campaigning for his release, launching a group called \"Friends of John McCarthy\".", "*An Evil Cradling; by Brian Keenan (McCarthy is a main character) Penguin Books "]}, {"page": "Simon Cumbers", "response": ["While a student at St Patrick's, he was editor of the school magazine, Tuairim; features writer for Drogheda Independent, Ipswich Evening and Meath Chronicle; and hosted a radio show for Royal County Radio, a local pirate radio station. He started reporting for The Weekender. Around the age of 20, he started as a rookie and advanced to chief reporter for Capitol Radio (now called FM104) in Dublin, Ireland. In 1990, Cumbers moved to the United Kingdom to work with a variety of British broadcasters, including ITN's Channel 4 News, Channel 4 Daily, Sky News, APTN, and the BBC. Cumbers worked both as a journalist and a producer. In the late 1990s, he retrained and became a cameraman as well, establishing Locum Productions with his wife and BBC journalist Louise Bevan, to supply camera crews to broadcasters. Among the stories Cumbers reported on were the 1989 death of Nicolae Ceaușescu during the Romanian Revolution; the 1990 release of Brian Keenan in Beirut, Lebanon; the late 1990s Drumcree conflict; the Good Friday Agreement and Omagh bombing in 1998, the Kursk submarine disaster in 2000, and the 2004 Madrid train bombings. He had also interviewed Muammar Gaddafi in Libya."]}, {"page": "1990 in Ireland", "response": ["* 24 August – Brian Keenan was released after 1,574 days in captivity in Beirut."]}, {"page": "Laid (album)", "response": ["\"One of the Three\" is inspired by the experiences of John McCarthy, Brian Keenan, and Terry Waite, who were taken as hostages in Lebanon, and by a scene in Waiting for Godot (1953) in which three characters are on crosses. The band subdued the sound of the pop-leaning \"Say Something\" because they felt it would be distasteful to put too much emotion behind it. The song, which was written by Booth after an argument, discusses first love and is indebted to the work of U2. "]}, {"page": "Brian Keenan", "response": ["Brian Keenan may refer to:", "*Brian Keenan (writer) (born 1950), Belfast writer held as a hostage in Lebanon from 1986 to 1990", "*Brian Keenan (Irish republican) (1942–2008), Provisional Irish Republican Army member", "*Brian Keenan (musician, born 1943) (1943–1985), American  musician", "*Brian Keenan (musician, born 1982), American musician"]}, {"page": "An Evil Cradling", "response": ["#REDIRECT Brian Keenan (writer)"]}, {"page": "Ciarán Hinds", "response": ["Hinds was featured in two notable television docudramas: Granada Television's docudrama Who Bombed Birmingham? (1990) in which Hinds portrayed Richard McIlkenny, a Belfastman falsely imprisoned for an IRA bombing; and HBO's docudrama Hostages (1993), where he portrayed Irish writer and former hostage Brian Keenan. Hinds starred opposite Kelly Reilly in Above Suspicion, a TV adaptation of Lynda La Plante's detective story, which was broadcast in the United Kingdom in January 2009; he returned for the sequels The Red Dahlia (2010), Deadly Intent (2011) and Silent Scream (2012). Hinds has performed in audiobook and radio productions as well. He performed as Valmont in the BBC Radio production of Les Liaisons Dangereuses, and also narrated the Penguin Audiobook Ivanhoe. He also performed in Antony and Cleopatra and The Winter's Tale as part of The Complete Arkangel Shakespeare, an audio production of Shakespeare's plays which won the 2004 Audie Award for Best Audio Drama. He read the short story \"A Painful Case\" for the Caedmon Audio version of James Joyce's Dubliners.", "| Hostages || Brian Keenan ||Television film"]}, {"page": "Brian Keenan (writer/hostage)", "response": ["#redirect Brian Keenan (writer)"]}, {"page": "Charlie Bird", "response": ["On the international front, Bird reported on both Gulf Wars and was in Syria for the release of Brian Keenan. "]}, {"page": "Keenan", "response": ["* Brian Keenan (Irish republican), Provisional IRA member", "* Brian Keenan (musician born 1943), American musician", "* Brian Keenan (writer), Irish journalist and hostage"]}, {"page": "Belfast Metropolitan College", "response": ["* Brian Keenan, writer"]}, {"page": "Denis Donaldson", "response": ["In 1981, he was arrested by French authorities at Orly airport along with fellow IRA volunteer William \"Blue\" Kelly; the duo were using false passports and Donaldson said that they were returning from a guerrilla training camp in Lebanon. At the 1983 general election, Donaldson was the Sinn Féin candidate in Belfast East, but only polled 682 votes.\"East Belfast\", ARK Northern Ireland; accessed 4 September 2017. In the late 1980s, he travelled to Lebanon again and held talks with both Lebanese Shia militias, Hezbollah and Amal, in an effort to secure the freedom of Irish hostage Brian Keenan."]}, {"page": "List of writers from Northern Ireland", "response": ["*Brian Keenan (born 1950)"]}, {"page": "John King (author)", "response": ["The one novel of King's to be set entirely outside England – The Prison House – is considered his most mature work to date. Brian Keenan wrote: “With a brutal imagination The Prison House takes you to a place where angels fear to tread. Go there and be redeemed.” Boyd Tonkin, writing in The Independent, said: “In this literary jail, the ghost of Kafka shares a cell with the shade of Burroughs.” An album based on the novel, written by King and Ruts DC guitarist Leigh Heggarty, has been reported."]}, {"page": "Blind Flight", "response": ["Blind Flight is a 2003 British film directed by John Furse and starring Ian Hart and Linus Roache. It is based on the true-life story of the kidnapping and imprisonment of the Irish academic Brian Keenan and the English journalist John McCarthy, two of the hostages in the Lebanon hostage crisis. The film is based on Keenan's memoir, An Evil Cradling and Some Other Rainbow by John McCarthy who was a screenplay consultant. The film received widespread critical acclaim, being nominated for six awards, and winning a BAFTA.", "Brian Keenan, a humourless bearded Irish academic, has moved to Beirut in the mid 1980s and works as an English teacher. As he leaves for work one day, four armed men in a car kidnap him and he is incarcerated. Keenan wakes up, almost naked, alone in an iron-clad room. Initially he refuses to eat until he is told why he is being held prisoner. He is kept on his own but eventually he is moved into a cell in a deserted house, where he is joined by another hostage, the English journalist John McCarthy, who had been reporting on Keenan’s kidnapping not long before he himself was abducted. The grumpy Brit-hating Irishman and the more pliable British journalist are forced to share their small prison cell.", "*Ian Hart as Brian Keenan"]}, {"page": "1991 in the United Kingdom", "response": ["* Brian Keenan's autobiographical account of more than four years as a hostage in Lebanon An Evil Cradling"]}, {"page": "1990 in the United Kingdom", "response": ["* 24 August – Irish hostage Brian Keenan is released in Beirut, Lebanon, after being held a hostage there for more than four years."]}, {"page": "List of biographical films", "response": ["||Brian Keenan"]}, {"page": "Brendan Hamill (writer)", "response": ["He then returned to Northern Ireland to study for a degree in English at the New University of Ulster. One of his lecturers was the critic Walter Allen. His fellow students included the poet Gerald Dawe and the writer Brian Keenan. After he graduated he subsequently worked for several years as a teacher in Kilcullen, County Kildare and later in Belfast."]}, {"page": "History of Hezbollah", "response": ["*kidnapped around 30 other Westerners between 1982 and 1992, including U.S. journalist Terry Anderson, British journalist John McCarthy, the Archbishop of Canterbury's special envoy Terry Waite and Irish citizen Brian Keenan."]}, {"page": "People of the Year Awards", "response": ["* Brian Keenan"]}, {"page": "Great Lives", "response": ["|Brian Keenan, writer"]}, {"page": "Orangefield High School", "response": ["Notable alumni of the Boys' School include Van Morrison,Turner, p20. Brian Keenan, David Ervine, Gerald Dawe, Walter Ellis and Ronnie Bunting."]}, {"page": "1991 in Northern Ireland", "response": ["*Brian Keenan publishes An Evil Cradling, an autobiographical account of more than four years as a hostage in Beirut."]}, {"page": "1990 in Northern Ireland", "response": ["*24 August - Brian Keenan is released after 1574 days in captivity in Beirut."]}, {"page": "1950 in Northern Ireland", "response": ["*28 September – Brian Keenan, writer and hostage in Lebanon."]}, {"page": "Denis Alexander", "response": ["He spent 15 years in various university departments and laboratories outside the United Kingdom (1971-1986), including a post at Hacettepe University (1972-1974) and the Middle East Technical University (1974-1980) in Ankara, Turkey, where he set up a neurochemistry laboratory in the newly formed Biological Sciences Department. From 1981-1986 he held the post of Associate Professor of Biochemistry at the American University of Beirut Medical Centre, Lebanon, where he helped to establish the National Unit of Human Genetics. This entailed establishing a new research laboratory in medical genetics and the first prenatal diagnostic clinic in the Arab World. Discoveries during this era included a novel mutation which affected lysosomal enzyme processing and the identification and characterisation of several rare genetic diseases. At a symposium at the American University of Beirut Medical Center on ‘Genetic Diseases in Lebanon’ held in April 1985, Alexander reported that “over 50 highly specialised tests are performed in the unit’s laboratories, making them the leading laboratories in the whole Arab World”. Alexander and his family were evacuated three times from West Beirut, the first time following the Israeli invasion of the Lebanon in June 1982, the second time following intensive fighting that broke out amongst armed factions in March 1984, and the third and final time following Reagan’s bombing of Libya in April 1986 which led to retaliation against the few westerners still residing in West Beirut. The Alexander family left West Beirut the same week that John McCarthy and Brian Keenan were kidnapped."]}, {"page": "Brian Ervine", "response": ["He was educated at Grosvenor Grammar School, Belfast, a contemporary of future soccer legend George Best. He studied at Stranmillis University College, graduating with a degree in education, and then at Queen's University, Belfast, graduating with a degree in Theology (BD). He subsequently taught English and Religion at Orangefield High School in east Belfast. Alumni of Orangefield include Van Morrison, Brian Keenan and Ervine's brother, David."]}, {"page": "Icarus (magazine)", "response": ["Notable contributors have included John Montague, Seamus Heaney, Paul Durcan, Louis MacNeice, Matthew Sweeney, E. A. Markham, Donald Davie, Dermot Bolger, John F. Deane, Thomas Kinsella, W. R. Rodgers, Frank O’Connor, Edward Lucie-Smith, Eavan Boland, Seamus Deane, Gerald Dawe, Caitriona O'Reilly, Sinéad Morrissey, Justin Quinn, Thom Gunn, Colm Tóibín, Vona Groarke, Brian Keenan, Eilis Ni Dhuibhne, Desmond Hogan, Monk Gibbon, Arland Ussher, Ciaran Carson, Kevin Barry, Cyrus Cassells."]}, {"page": "Lebanon hostage crisis", "response": ["* 1986 April – Abduction: British citizens Brian Keenan (April 11) and John McCarthy (April 17th) Motivation: reprisal for the American raid on Libya.Ranstorp, Hizb'allah in Lebanon, (1997), p. 98 Suggested motivation for keeping them: demands for the release by Israel of 260 Shiites held in Al-Khiam prison in South Lebanon and the release of the three Iranian hostages taken in 1982.", "* 1990 August 24 – Release: Brian Keenan, Irish teacher of English", "* An Evil Cradling, Brian Keenan's memoir of his ordeal"]}, {"page": "List of autobiographies", "response": ["|Brian Keenan||An Evil Calling||1991"]}, {"page": "The Right Size", "response": ["Their major 1997 success Do You Come Here Often? was about two strangers stuck in a bathroom for 25 years.  The show was inspired by the experiences of Beirut hostages Brian Keenan and John McCarthy.Lyn Gardner, \"Adventures in Wonderland\", The Guardian, 25 April 2001. Retrieved 2012-10-21."]}, {"page": "List of Rehab People of the Year Award winners", "response": ["* Brian Keenan"]}, {"page": "Jackie Mann", "response": ["Mann was eventually released on 24 September 1991, following 865 days in captivity, after negotiations by the British and US governments succeeded in bringing about the release of several Western hostages. He had been held at the same time as other UK and Irish hostages in Lebanon, notably journalist John McCarthy, church envoy Terry Waite and author Brian Keenan."]}, {"page": "Brian Keenan (hostage)", "response": ["#REDIRECT Brian Keenan (writer)"]}, {"page": "Julian Colbeck", "response": ["In 1991, Colbeck released a solo album Back to Bach, [EG/Virgin] collaborating with concert pianist Jonathan Cohen, plus Steve Hackett, Milton McDonald, John Keeble, Mary Hopkin, and the Irish poet Brian Keenan."]}, {"page": "Kidnapping of Sharon Commins and Hilda Kawuki", "response": ["GOAL CEO John O'Shea was not present. The President said Commins had \"lifted the spirits of the nation\" and compared her safe return to that of Brian Keenan, the Irish writer who spent four years as a hostage in Beirut in the 1980s and 1990s."]}, {"page": "Anthony Grey", "response": ["In the late 1980s, Grey's experience as a political hostage led him to found Hostage Action Worldwide, which worked for the release of other political hostages, in particular John McCarthy, Brian Keenan, Terry Waite and others held by Islamic groups in the Middle East."]}, {"page": "List of Ulster University people", "response": ["*Brian Keenan, former hostage; writer"]}, {"page": "List of Desert Island Discs episodes (2001–2010)", "response": ["|||Piers Morgan||An Evil Cradling by Brian Keenan||||more"]}]}}