{"wiki_id": "http://www.wikidata.org/entity/Q2924417", "itemLabel": "Brendan Barber", "itemDescription": "Trade unionist; General Secretary of the TUC", "wikipedia_url": "https://en.wikipedia.org/wiki/Brendan_Barber", "wikipedia_page": {"main": "Sir Brendan Paul Barber (born 3 April 1951) is a British trade union official. He served as chair of the Advisory, Conciliation and Arbitration Service (ACAS) Council until 2020. He is a former general secretary of the United Kingdom's Trades Union Congress (TUC); a post he held from June 2003 until his retirement at the end of 2012. He was appointed Acas Chair in 2014, replacing Ed Sweeney, who had been in the post since 2007.  He also serves on the board of the Banking Standards Board (2015–), the Board of Transport for London (2013–), the board of Britain Stronger in Europe (2015–), the Council of City University, London and the board of Mountview Academy of Theatre Arts (2014–).", "link_mentions": [{"page": "April 3", "response": ["*1951 – Brendan Barber, English trade union leader"]}, {"page": "Carnival Cruise Line", "response": ["In 2012, the company was reportedly paying cruise ship staff basic salaries equivalent to  per hour. For example, a junior waiter would earn a basic salary of  a month for shifts lasting at least 11 hours, seven days a week. In response to this controversy, the general secretary of the Trades Union Congress, Brendan Barber, commented: \"It's high time the disgraceful practice of allowing the shipping industry to pay poverty wages to workers who don't live in the UK was stopped. Exploitative rates of pay for those working on British ships have no place in a modern society.\" In October 2013, Carnival revoked retirement benefits for cruise staff. In May of 2012, Carnival dismissed 150 crew members from India for protesting low wages.Walker, Jim (July 2, 2012). \"Carnival fires 150 crew members from India for protesting Low Cruise Ship Wages\". Cruise Law news. Walker & O'Neill Maritime Lawyers. Retrieved November 13, 2021."]}, {"page": "General Secretary of the Trades Union Congress", "response": ["*Brendan Barber (29 May 2003 – 31 December 2012)", ":1993: Brendan Barber"]}, {"page": "City, University of London", "response": ["* Brendan Barber – General Secretary of the Trades Union Congress"]}, {"page": "Ron Todd (trade unionist)", "response": ["Tributes were paid to him from leading figures across the labour movement, led by the then Prime Minister Tony Blair who said: \"He was a greatly respected trade union leader and a good friend. Despite leading his union at a difficult time he was always a strong supporter of the Labour Party. I have always been grateful for the support he gave me in difficult circumstances when I was employment spokesman when we were changing the party’s position on employment law. He will be sadly missed\". Tony Woodley remarked: \"\"Ron carried the trade union flame throughout the darkest days of Thatcherism, leading the T&G in very difficult years with decency, integrity and commitment. Ron always put the members' interests first and remained rock solid to the union in his loyalty to the enduring values of the Labour movement. His passing will be mourned not just by his family and by trade unionists throughout Britain but also in South Africa where his campaigning commitment against apartheid will always be remembered. So too will be his unwavering commitment to nuclear disarmament\". Brendan Barber, the then general secretary of the TUC said: \"Ron Todd was a trade unionist of total integrity, passion and commitment to fairness for working people as well as having a deep commitment to the cause of peace\". Ken Livingstone the then Mayor of London remarked: \"Ron Todd was one of the most decent men I have ever met in public life. He was a man of absolute integrity, a giant of the trade union movement and everyone will miss him and his advice immensely. \"Ron was a great ally in the London Labour Party and it was only because of his key role over many years that London Labour had such a radical agenda when we won the GLC elections in 1981. He was both a powerful advocate of the interests of working people and a kind and generous man\". While Tony Benn said: 'He was a great campaigner for peace, a very principled man and a very likable man.'"]}, {"page": "Brendon Barber", "response": ["#redirect Brendan Barber"]}, {"page": "St Mary's College, Crosby", "response": ["* Sir Brendan Barber, General Secretary of the TUC"]}, {"page": "Great Lives", "response": ["|Brendan Barber, trade unionist"]}, {"page": "East London Mosque", "response": ["Other visitors include Prince Charles, Prince William, Abdullah Ahmad Badawi (former Prime Minister of Malaysia), Dzulkefly Ahmad, (Health Minister of Malaysia), Brendan Barber (Secretary General of TUC),TUC wants Muslim 'poverty' ended BBC Louis Susman (United States Ambassador to the United Kingdom),U.S. Diplomat Visits Controversial Mosque Sarah Mullally (Church of England, Bishop of London)."]}, {"page": "Associated Society of Locomotive Engineers and Firemen v United Kingdom", "response": ["Brendan Barber, general secretary of the Trades Union Congress, described the European court's decision as an \"important and welcome judgment\", saying that it was \"common sense\" that unions \"should not be forced to accept into membership people opposed to the basic principles of trade unionism.\" He added, \"Every union will welcome this clear decision that they can now expel BNP members.\" The ASLEF General Secretary, Keith Norman, thanked the 18 unions who gave ASLEF financial assistance to allow them to go to the European courts: NUM, CYWU, PFA, UCATT, NATFHE, NAPO, USDAW, EIS, RMT, UNISON, PCS, NUMAST, Community, CWU, CSP, GMB, FBU and NUJ."]}, {"page": "Martin Durkin (director)", "response": ["In 2010 Durkin made a programme called Britain's Trillion Pound Horror Story for Channel 4. Ostensibly about Britain's national debt, the film makes a case for lower taxes, a smaller public sector and a free-market economy.Last night's TV: Britain's Trillion Pound Horror Story and Misfits, The Guardian, 12 November 2010 The film argues that Hong Kong's social and economic success is attributable to the positive non-interventionism implemented in 1961 by John James Cowperthwaite.Rallying cry, James Delingpole, The Spectator, 13 November 2010 In the film, Durkin argued that increasing public spending would stunt the economy instead of reviving it. The film featured Nigel Lawson, Geoffrey Howe, Brendan Barber and Alastair Darling."]}, {"page": "Islamic Forum of Europe", "response": ["IFE and the mosque have hosted many notable persons and religious leaders including Prince Charles,bbc.co.uk: \"Prince joins Ramadan ceremony\", 23 November 2001 Abdullah Ahmad Badawi,British Prime Minister Blair praises Malaysia The Star, 24 July 2004 Fiona MacTaggart,Makkah imam leads prayers in London DAWN.com Brendan Barber,TUC wants Muslim 'poverty' ended BBC Dr Yasir Qadhi, Abdul Rahman Al-Sudais, Saud Al-Shuraim, Salah Al Budair, Bakir Izetbegović, Jamal Badawi, Allama Delwar Hossain Sayeedi and many others.Al-Sudais launches second expansion of London mosque  Saudi Gazette. Retrieved on 13 September 2010."]}, {"page": "Redwatch", "response": ["The website has been heavily criticised by the Trades Union Congress and many  affiliated unions. Following the TUC's annual Congress in September 2004, where an anti-Redwatch resolution was passed, the TUC General Secretary Brendan Barber wrote to Home Secretary David Blunkett, requesting a meeting to discuss the issue. Further discussions and correspondence with government members ensued, and in March 2005, a meeting took place with Home Secretary Charles Clarke. The TUC have promised to provide the Home Secretary with examples of experiences that trade unionists and other left-wing campaigners have had as a result of having their details published on Redwatch, whilst the Home Secretary promised to hold discussions with the police about what could be done to stop the activities of the website."]}, {"page": "2009 G20 London summit protests", "response": ["On 28 March 2009, 35,000 people marched through London. At a rally in Hyde Park, they were addressed by Global Call to Action Against Poverty co-chair Kumi Naidoo, TUC General Secretary Brendan Barber, environmentalist Tony Juniper, activist comedian Mark Thomas, and global justice author Susan George amongst others. They heard calls for international action to deliver tax justice, trade justice and a Green New Deal in both rich and poor countries.http://www.putpeoplefirst.org.uk/2009/03/35000-thanks-a-strong-signal-to-the-g20-from-the-london-put-people-first-march/ . Retrieved 2009-06-12.  Archived 2009-06-22."]}, {"page": "2009 Royal Mail industrial disputes", "response": ["New talks were announced on 24 October, which would be brokered by the TUC and chaired by its general secretary Brendan Barber. Peter Mandelson welcomed the talks, describing them as \"an opportunity to break the deadlock\". Further strikes were also announced for the last three days of October, which would involve mail centre staff on 29 and 30 October and delivery staff on 31 October. Three days of negotiations aimed at ending the dispute began on 26 October, but although they were described by Barber as having been useful, they ended without agreement and the second wave of strikes went ahead. Royal Mail later blamed a hard core element of London postal union leaders for refusing to endorse a proposal that both sides had agreed to.", "Discussions were held during the second wave of strikes, when Brendan Barber announced on the afternoon of Friday 30 October that proposals had been put to both Royal Mail and the CWU for them to consider over the weekend. Talks resumed on the Monday, however this news was overshadowed by the announcement that a further two days of strikes would be held on Friday 6 November and Monday 9 November. It was also announced that these would be all out strikes with everybody walking out at the same time rather than the rolling strike action that had been adopted previously, thus leading to a complete stoppage throughout the course of the action. These were later called off in order for further talks to take place.", "On 5 November, the eve of the first planned all out strike it was announced that strike action had been called off until at least the New Year to allow for what Brendan Barber described as \"a period of calm\" in which both Royal Mail and the CWU could reach a long term agreement. But he added that although the postal service would be free from disruption over the Christmas period, a long term deal was still some distance away. The CWU also announced on the same day that it would not press ahead with a legal challenge to Royal Mail's employment of temporary workers to clear the backlog, which had been due to begin at the High Court the following day."]}, {"page": "Big Society", "response": ["TUC general secretary Brendan Barber concluded that \"the logic of this is that [Cameron's] ideal society is Somalia where the state barely exists\". Cameron's response was that the Big Society ideology pre-dated the implementation of cuts to public services, that the reduction in the size of the state had become inevitable, and that Big Society projects are worthwhile whatever the state of the economy."]}, {"page": "2011 United Kingdom budget", "response": ["However, speaking for the Trades Union Congress, Brendan Barber welcomed some measures including help for apprenticeship and the cut in fuel duty, but said that overall it had been a \"no change Budget\"."]}, {"page": "2011 London anti-cuts protest", "response": ["Demonstrators marched from the Thames Embankment, via the Houses of Parliament, to Hyde Park where a rally took place with speakers including the TUC general secretary Brendan Barber and leader of the opposition Ed Miliband, who addressed the assembled crowds.", "The march concluded at a rally in Hyde Park, where TUC general secretary Brendan Barber told demonstrators: \"We are here to send a message to the government that we are strong and united... We will fight the savage cuts and we will not let them destroy peoples' services, jobs and lives.\""]}, {"page": "Essential National Industries (Employment) Decree 2011", "response": ["The same month, Brendan Barber, General Secretary of the British TUC, wrote again to the Fiji High Commissioner in London, to express"]}, {"page": "Barber (surname)", "response": ["* Sir Brendan Barber (born 1951), General Secretary of the Trades Union Congress, United Kingdom"]}, {"page": "Employment Relations Act 2004", "response": ["According to the Trades Union Congress (TUC), the Act contains 'significant union victories'. The TUC's then general secretary, Brendan Barber welcomed the law, noting that \"Staff will have to be given information and be consulted over major changes to the business, as they currently are in Britain’s best companies. Trade unions will be able to recruit members in an environment free of underhand, US-style union-busting activities and will find it easier the exclude and expel far-right activists in breach of union rules. The union modernisation fund the [Act] establishes will enable unions to modernise in the same way the government has helped businesses adapt to grow in the modern economy.\""]}, {"page": "The Agenda with Tom Bradby", "response": ["|1 || Boris Johnson, Jenny Agutter, Allison Pearson and Brendan Barber || "]}, {"page": "Institute for Employment Studies", "response": ["Other notable former Council members include Brendan Barber."]}, {"page": "Frances O'Grady", "response": ["She became TUC General Secretary in January 2013, succeeding Brendan Barber."]}, {"page": "Britannia Unchained", "response": ["The book caused controversy in August 2012 after a short quotation appeared in London's Evening Standard which accused British workers of laziness and lagging behind their Asian counterparts. The comments were criticised by union leaders, among them the General Secretary of the Trades Union Congress Brendan Barber: \"The problem with the UK economy is not its workers, but a severe lack of jobs\". The Labour Party urged British Prime Minister and Conservative leader David Cameron to distance himself from the views and the Shadow Secretary of State for Business Chuka Umunna commented: \"First they blame British businesses for their economic failures and now they blame the people who work within them, showing how out of touch the Tory party has become\"."]}, {"page": "2013 Birthday Honours", "response": ["* Brendan Barber – Lately General Secretary, Trades Union Congress. For services to Employment Relations."]}, {"page": "Sir Brendan Barber", "response": ["#REDIRECT Brendan Barber"]}, {"page": "Britain Stronger in Europe", "response": ["* Sir Brendan Barber"]}]}}