{"wiki_id": "http://www.wikidata.org/entity/Q293270", "itemLabel": "Sarah Cracknell", "itemDescription": "English singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Cracknell", "wikipedia_page": {"main": "Sarah Cracknell (born 12 April 1967) is an English singer-songwriter and lead singer of the electronic music band Saint Etienne.", "link_mentions": [{"page": "April 12", "response": ["*1967 – Sarah Cracknell, English singer-songwriter "]}, {"page": "1967 in music", "response": ["* April 12 – Sarah Cracknell (Saint Etienne)"]}, {"page": "Republica", "response": ["* Male co-wrote tracks for Lipslide, the 1997 solo album by Sarah Cracknell of Saint Etienne. He has also featured in cult band Go Kart Mozart."]}, {"page": "Chelmsford", "response": ["* Sarah Cracknell (born 1967), singer, Saint Etienne."]}, {"page": "The 6ths", "response": ["Some of the more notable artists appearing on Hyacinths and Thistles are Bob Mould, Sally Timms (The Mekons), Sarah Cracknell (Saint Etienne), Neil Hannon (The Divine Comedy), Gary Numan, Marc Almond, Momus, Clare Grogan (Altered Images), Melanie, Miss Lily Banquette (Combustible Edison), Katharine Whalen (Squirrel Nut Zippers) and the accomplished toy piano player Margaret Leng Tan. The album also features an improbable duet of singer Odetta accompanied by Lemony Snicket author Daniel Handler on accordion.House of Tomorrow Hyacinths and Thistles Track List "]}, {"page": "Laura Nyro", "response": ["Nyro's influence on popular musicians has also been acknowledged by such artists as Joni Mitchell, Carole King, Tori Amos, Patti Smith, Kate Bush, Diamanda Galas, Bette Midler, Rickie Lee Jones, Elton John, Jackson Browne, Alice Cooper, Elvis Costello, Cyndi Lauper, Todd Rundgren, Steely Dan, Sarah Cracknell, Melissa Manchester, Lisa Germano, and Rosanne Cash."]}, {"page": "Saint Etienne (band)", "response": ["Saint Etienne are an English band from London, formed in 1990. The band consists of Sarah Cracknell, Bob Stanley and Pete Wiggs. They became associated with the UK's indie dance scene in the 1990s, beginning with the release of their debut album Foxbase Alpha in 1991. Their work has been described as uniting 1990s club culture with 1960s pop and other disparate influences. The name of the band comes from the French football club of AS Saint-Étienne.", "Bob Stanley and Pete Wiggs were childhood friends and former music journalists, who once had a fanzine called Caff which had developed into a record label by 1989. They originally planned that Saint Etienne would use a variety of different lead singers, and their 1991 debut album, Foxbase Alpha – influenced by sources such as club culture, 1960s pop, and Orchestral Manoeuvres in the Dark's Dazzle Ships – features several vocalists, including Moira Lambert and Donna Savage. However, after working with Sarah Cracknell on \"Nothing Can Stop Us\", they decided to make her the permanent vocalist, and Cracknell has written or co-written many of the band's songs.", "Sarah Cracknell has collaborated with Marc Almond on his single \"I Close My Eyes and Count to Ten\" for his album Stardom Road."]}, {"page": "Siouxsie Sioux", "response": ["Charli XCX, Hayley Williams of Paramore, Dolores O'Riordan of the Cranberries, Jennifer Charles of Elysian Fields, Ebony Bones, Toni Halliday of Curve, Kathleen Hanna of Bikini Kill, Chan Marshall a.k.a. Cat Power, Gillian Gilbert of New Order, Alison Goldfrapp, Sarah Cracknell of Saint Etienne, Florence Welch of Florence + the Machine,{ Chelsea Wolfe, Brody Dalle of the Distillers, Dee Dee of Dum Dum Girls, Joan As Police Woman, Lou Doillon, Emel Mathlouthi, Girlpool, Liz Phair, Billie Ray Martin, An Pierlé, Lauren Mayberry of Chvrches, Meshell Ndegeocello, St. Vincent,  Jehnny Beth of Savages, Wolf Alice, and Jenny Lee Lindberg of Warpaint. Santigold said: \"I keep a Rolodex of the women that vocally inspire me. There aren't that many, but she's definitely one of them. I remember one of the first times I heard \"Red Light\" it was at a party, and I remember going up to the DJ and being like, \"Who's this?\". It was that good. I kind of stopped and was like ... wow. There's not a tremendous amount of women who are bold and forward thinking as artists. I feel like her music, at the time especially, was pretty unique in the way that it sort of matched her style. The freedom of experimenting with this dark place that doesn't have a place often in modern music\"."]}, {"page": "But I'm a Cheerleader", "response": ["# \"We're in the City\" (Sarah Cracknell, Bob Stanley, Pete Wiggs) performed by Saint Etienne"]}, {"page": "Étienne Daho", "response": ["Daho's 1996 album Eden displayed a diverse array of electronic-oriented songs that included downtempo ballads, drum and bass-influenced tracks, and Hi-NRG dance. He duetted with Astrud Gilberto (\"Les bords de Seine\") and was accompanied by The Swingle Singers on \"Timide intimité\". Backing vocals on several songs were provided by Lyn Byrd of the Comateens, Sarah Cracknell (who co-wrote \"Les passagers\"), and Elli Medeiros.", "*Daho's 1998 single \"Le Premier Jour du reste de ta vie\" is an adaptation of Sarah Cracknell (Saint Etienne's lead singer)'s \"Ready or Not\" from her first solo album Lipslide (1997)."]}, {"page": "Lloyd Cole and the Commotions", "response": ["*Irvine joined former bandmate Clark in Bloomsday, and as a session musician worked with Del Amitri, Étienne Daho and Sarah Cracknell. He is also managing artists and bands."]}, {"page": "Downtown (Petula Clark song)", "response": ["| • Sarah Cracknell on her single \"Desert Baby\" also on Japanese release of her album Lipslide"]}, {"page": "Tales from Turnpike House", "response": ["The exact setting of the stories told by the album's setting is somewhat amorphous. The real Turnpike House is a high-rise block of flats in Goswell Road, EC1, an area of ex-council blocks between Clerkenwell and Upper Street. The band had spent a lot of time in Turnpike House, as filmmaker Paul Kelly lived there during the period in which they were collaborating on What Have You Done Today, Mervyn Day?. However, Sarah Cracknell has said that the building imagined in the album is \"not nearly as smart\" as the real Turnpike House. Bob Stanley has said that he imagined the album's setting to be more suburban, \"probably somewhere like Croydon or possibly Ponders End\". Pete Wiggs has said that his experience of living in Croydon was the inspiration for \"Side Streets\" and \"Slow Down at the Castle\" (the Castle is a water tower in Park Hill Recreation Ground). However, the title of \"The Birdman of EC1\" refers to the postal district in which the real Turnpike House is located.", "Tales from Turnpike House was very well-received from critics, holding an aggregate 79 out of 100 from Metacritic based on 22 reviews. The album's most favorable reviews, including a five-star review from Dorlan Lynskey of The Guardian, called it the group's best album yet, with praise going towards the album's songwriting, production, arrangements, sound, vocal harmonies and Sarah Cracknell's vocals. Ernesto Lechner wrote in his review for the Los Angeles Times that \"If it's pop craftsmanship you are after, few can equal this melancholy concept album and the sheer virtuosity of its hooks\", while Stylus Magazine's Edward Oculicz called it an \"overwhelmingly forward, ambitious album for a group fifteen years into their career and long past their commercial prime who could have quite happily introduced no new ideas—musical or thematical—and not challenged their dwindling but loyal fan-base.\"", "* Sarah Cracknell"]}, {"page": "Travel Edition 1990–2005", "response": ["* Sarah Cracknell"]}, {"page": "Stephen Hague", "response": ["| Sarah Cracknell"]}, {"page": "Sound of Water", "response": ["*Sarah Cracknell"]}, {"page": "The Misadventures of Saint Etienne", "response": ["The soundtrack was recorded during winter 1997 just before the period when the band were starting to promote the Good Humor album, Sarah Cracknell said in an interview with Melody Maker that \"Saturday\" was being remixed by Trouser Enthusiasts as a possible single release. The single and remix never appeared, and the film itself was only released in Spanish cinemas."]}, {"page": "Foxbase Alpha", "response": ["The album was recorded in a style which drew on the club culture and house music of the time, but also incorporates the group's characteristic love of 1960s pop, with tracks also bridged by samples from films or by short songs. At the time of recording, Sarah Cracknell was not fully part of the group, and as a result she does not sing on \"Only Love Can Break Your Heart\", which is sung by Moira Lambert.", "* Sarah Cracknell – vocals"]}, {"page": "So Tough", "response": ["So Tough is the first Saint Etienne album to feature Sarah Cracknell as an official member of the band. It was originally intended as a concept album which starts at \"Mario's Cafe\" in London then travels around the world, but it ultimately came to be viewed as a solely London album.", "The album cover features a picture of lead singer Sarah Cracknell aged 6, taken by her father Derek Cracknell.", "* Sarah Cracknell – vocals, \"Sri Lanka\", \"Macca keyring\""]}, {"page": "Good Humor (album)", "response": ["Good Humor is the fourth studio album by English alternative dance band Saint Etienne. It was released on 4 May 1998 by Creation Records. The American spelling of humor is used in the title as the band were, according to Sarah Cracknell, \"fed up with the 'quintessentially English' tag, so there was a bit of a backlash against that.\"O'Hara, Gail (2010). \"How is it your least 'English' album?\". In Good Humor, deluxe edition [CD booklet]. Universal Music.", "Good Humor was recorded in two weeks at Tambourine Studios, Malmö, Sweden. The album was produced by Tore Johansson, who had produced all of The Cardigans' previous studio albums. Most of the B-sides were also recorded and produced during the two-week sessions. Sarah Cracknell cut short the promotion of her solo album Lipslide and single \"Goldie\" to record the album.", "* Sarah Cracknell – vocals, cowbells, Flying A"]}, {"page": "Places to Visit", "response": ["\"Sadie's Anniversary\" and \"Half Timbered\" are tracks omitted from the Misadventures Of Margaret soundtrack. Sadie is incidentally the name of the band's longtime backing singer's daughter. Debsey, the backing singer, has been with the band since the early days of them performing live. She is also Sarah Cracknell's sister-in-law.", "* Sarah Cracknell - Vocals, Wurlitzer, Beetle Bailey"]}, {"page": "Tiger Bay (album)", "response": ["* Sarah Cracknell – vocals, snowboard, scaremonger"]}, {"page": "Smash the System: Singles and More", "response": ["* Sarah Cracknell (Aries, super, #9 iron)"]}, {"page": "Kid Loco", "response": ["* The Man I Love (performed with Sarah Cracknell) – Red Hot + Rhapsody (1998)"]}, {"page": "Baby D (dance group)", "response": ["Jones also co-wrote \"I Feel You\" for Peter Andre, which peaked at number 1 on the UK charts, and remixed and produced for Eternal and the Backstreet Boys, as well as St. Etienne vocalist Sarah Cracknell."]}, {"page": "Pete Wiggs", "response": ["Pete Wiggs is a member of the pop/dance group Saint Etienne (alongside Bob Stanley and Sarah Cracknell) for which he co-writes songs, produces and plays keyboards on stage. With the advent of computer based digital recording in the early 2000s, Wiggs set up his home studio \"Needham Sound\" (named after Chris Needham from the BBC documentary In Bed With Chris Needham)"]}, {"page": "Cyrus Chestnut", "response": ["|with Cassandra Wilson, Bugge Wesseltoft, Roy Nathanson, Sylk 130, Elvis Costello, dZihan & Kamien, Sarah Cracknell, et al."]}, {"page": "Gerard Johnson (musician)", "response": ["In 1991 he became a freelance engineer/producer, working with Timo Blunk (of Palais Schaumburg), Freaky Realistic, TV Smith (of The Adverts) and Denim. Through Denim he met Bob Stanley, Pete Wiggs and Sarah Cracknell of Saint Etienne. Since Saint Etienne re-united in the mid 1990s, Johnson has worked with the band at various times as engineer, arranger, producer and live keyboard player."]}, {"page": "Ian Catt", "response": ["Ian Catt is a British record producer and multi-instrumentalist associated with several popular indie groups, including Saint Etienne, with whom he has been a touring member. He has also collaborated with Saint Etienne's vocalist Sarah Cracknell on her solo album, Lipslide.  Catt also produced several albums for Heavenly and is a long-standing collaborator of Bobby Wratten, working with his groups The Field Mice, Northern Picture Library, Trembling Blue Stars and Occasional Keepers. He was also an official member of the latter group for a short time. His solo project, Katmandu, released a single and album on the Vinyl Japan label in 1994."]}, {"page": "Akasha (band)", "response": ["Vocal guests on Hail the Sun include St Etienne's Sarah Cracknell, Heidi Vogel and Polish singer Anita Lipnicka."]}, {"page": "Red Hot + Rhapsody: The Gershwin Groove", "response": ["#\"The Man I Love\", performed by Sarah Cracknell + Kid Loco"]}, {"page": "List of female rock singers", "response": ["* Sarah Cracknell (Saint Etienne)"]}, {"page": "List of Never Mind the Buzzcocks episodes", "response": ["|Billy Bragg and Sarah Cracknell (Saint Etienne) [21]", "|Jonathan Ross and Sarah Cracknell (St. Etienne) [16]"]}, {"page": "Lipslide", "response": ["Lipslide is the debut solo album from Saint Etienne lead singer Sarah Cracknell.  The album was co-produced by Cracknell and a variety of producers and released in the UK by Gut Records in 1997.  Upon its release Lipslide earned favorable reviews from music critics, although it was not a commercial success.  Musically the album does not stray too far from Cracknell's work with Saint Etienne, as it contains electronic and indie-styled pop music.", "Category:Sarah Cracknell albums"]}, {"page": "Kelly's Locker", "response": ["Kelly's Locker is an EP released by Saint Etienne lead singer Sarah Cracknell.  Issued by Instinct Records in 2000, the EP served as a companion piece to Cracknell's debut album Lipslide.  Four tracks which were on the UK version of Lipslide (but removed for the U.S. release three years later) were included here, as well as the original mix of \"Home\", shown on Kelly's Locker as the \"Armchair Mix\".  Two previously unreleased songs were also included, as well as a remix of \"Anymore\" which originally appeared on the 1996 UK single release.", "All tracks written by Sarah Cracknell, Jonny Male and Guy Batson; except where indicated.", "Category:Sarah Cracknell albums"]}, {"page": "Tell Me Why (The Riddle)", "response": ["\"Tell Me Why (The Riddle)\" is a song released by Paul van Dyk in collaboration with English indie dance band Saint Etienne, with Sarah Cracknell of the group on vocals. A music video (filmed 28 May 2000) was made along with the song that can be found on the Global DVD.", "Category:Songs written by Sarah Cracknell"]}, {"page": "Sam Littlemore", "response": ["| Mark Brown Ft. Sarah Cracknell"]}, {"page": "Too Young to Die: Singles 1990–1995", "response": ["* Sarah Cracknell – vocals (all tracks except \"Only Love Can Break Your Heart\" and \"Kiss and Make Up\")"]}, {"page": "Only Love Can Break Your Heart", "response": ["In 1990, English band Saint Etienne recorded a cover version of \"Only Love Can Break Your Heart\", which was included on their debut album, Foxbase Alpha. The vocals are by Moira Lambert (Sarah Cracknell had not yet joined the band as a permanent member). The band recorded the song in producer Ian Catt's bedroom studio in Pollards Hill. The recording, made in under two hours, got them a record deal, their first single, and their first hit. Andrew Weatherall later remixed the song, further emphasising its dub bassline: this remix, subtitled \"A Mix of Two Halves\" (duration 8:49), was featured on both releases of the single and on the compilation Casino Classics. The U.S. and European releases contained a different extended mix by Flowered Up (duration 6:19), issued in the UK only on a flexidisc, though it was mistakenly listed as the \"Mix of Two Halves\". Weatherall had no involvement with this mix."]}, {"page": "Hyacinths and Thistles", "response": ["| Sarah Cracknell"]}]}}