{"wiki_id": "http://www.wikidata.org/entity/Q2930472", "itemLabel": "C. Brian Haselgrove", "itemDescription": "British mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/C._Brian_Haselgrove", "wikipedia_page": {"main": "Colin Brian Haselgrove (26 September 1926 – 27 May 1964) was an English mathematician who is best known for his disproof of the Pólya conjecture in 1958.\nHaselgrove was educated at Blundell's School and from there won a scholarship to King's College, University of Cambridge. He obtained his Ph.D., which was supervised by Albert Ingham, from Cambridge in 1956.", "link_mentions": [{"page": "Pólya conjecture", "response": ["In number theory, the Pólya conjecture stated that \"most\" (i.e., 50% or more) of the natural numbers less than any given number have an odd number of prime factors. The conjecture was posited by the Hungarian mathematician George Pólya in 1919, and proved false in 1958 by C. Brian Haselgrove. ", "The Pólya conjecture was disproved by C. Brian Haselgrove in 1958. He showed that the conjecture has a counterexample, which he estimated to be around 1.845 × 10361."]}, {"page": "Albert Ingham", "response": ["Ingham supervised the Ph.D.s of C. Brian Haselgrove, Wolfgang Fuchs and Christopher Hooley."]}, {"page": "Jenifer Haselgrove", "response": ["Haselgrove was married to British mathematician C. Brian Haselgrove and published several highly cited, technical articles with him (e.g.,C. B. Haselgrove and Jenifer Haselgrove,  Twisted Ray Paths in the Ionosphere, Proc. Phys. Soc. 75 No 3 (1 March 1960) 357-363.). They are also credited for first  solving the 6×10 Pentomino. Brian Haselgrove died in 1964, and Jenifer remarried to another British mathematician, John Leech, and took his surname. She worked at the University of Glasgow until 1982. She resided in England until her death on 13 March 2015."]}, {"page": "C. B. Haselgrove", "response": ["#REDIRECT C. Brian Haselgrove"]}, {"page": "Colin Brian Haselgrove", "response": ["#redirect C. Brian Haselgrove"]}, {"page": "Brian Haselgrove", "response": ["#redirect C. Brian Haselgrove"]}, {"page": "Haselgrove", "response": ["*C. Brian Haselgrove (1926–1964), English mathematician"]}]}}