{"wiki_id": "http://www.wikidata.org/entity/Q293109", "itemLabel": "Ann Granger", "itemDescription": "British Author", "wikipedia_url": "https://en.wikipedia.org/wiki/Ann_Granger", "wikipedia_page": {"main": "Patricia Ann Granger (born 1939) is a British crime writer.\nGranger was born in Portsmouth, England.  She took a Modern Languages degree at the University of London, taught English for a year in France, but eventually went to work in the visa sections of British consulates and embassies in Yugoslavia, Czechoslovakia and Austria. She married a colleague in the foreign service and went with him to Zambia and Germany before returning to live in England with their two children.\nHer first novels were historical romances published under the nom de plume Ann Hulme. After her return to England, her first crime novel, Say It with Poison, was published in 1991.", "link_mentions": [{"page": "1992 in literature", "response": ["*Ann Granger – Cold in the Earth"]}, {"page": "1991 in literature", "response": ["*Ann Granger – Say It With Poison"]}, {"page": "List of crime writers", "response": ["*Ann Granger (born 1939, E)"]}, {"page": "Ann Hulme", "response": ["#REDIRECT Ann Granger"]}, {"page": "Say It with Poison", "response": ["Say It With Poison (1991) is a whodunnit or mystery novel by Ann Granger. It is the first in a series of 15 (as of 2004) Mitchell and Markby Mysteries.", "Category:Novels by Ann Granger"]}, {"page": "Lists of poisonings", "response": ["* Ann Granger: Say It With Poison"]}, {"page": "Running Scared", "response": ["* Running Scared, a 1998 novel by Ann Granger"]}, {"page": "List of female detective characters", "response": ["* Lizzy Martin is a doctor's daughter in Victorian England who becomes a lady's companion after her father dies with large debts. She investigates crimes with the help of policeman Ben Ross, in a series commenced 2006 by Ann Granger."]}, {"page": "List of people associated with the University of London", "response": ["* Ann Granger"]}, {"page": "Dead in the Water", "response": ["* Dead in the Water, a novel by Ann Granger"]}, {"page": "Granger (name)", "response": ["*Ann Granger, British author"]}, {"page": "Bamford (disambiguation)", "response": ["*Bamford, Cotswolds, a fictional place in Ann Granger's Markby and Mitchell mysteries"]}, {"page": "Cold in the Earth", "response": ["Cold in the Earth (1992) is Ann Granger's third Mitchell and Markby Mystery. Set in rural England, it is about three seemingly unconnected deaths which occur in quick succession in the fictitious town of Bamford in the Cotswolds. Chief Inspector Alan Markby and his team are unofficially joined in their investigations by Meredith Mitchell—who is introduced in Say It with Poison—, who leaves her London job to spend Holy Week in the country.", "Category:Novels by Ann Granger"]}, {"page": "Varrak", "response": ["*Ann Granger"]}]}}