{"wiki_id": "http://www.wikidata.org/entity/Q2943680", "itemLabel": "Cecil Chesterton", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Cecil_Chesterton", "wikipedia_page": {"main": "Cecil Edward Chesterton (12 November 1879 – 6 December 1918) was an English journalist and political commentator, known particularly for his role as editor of The New Witness from 1912 to 1916, and in relation to its coverage of the Marconi scandal.", "link_mentions": [{"page": "Distributism", "response": ["* Cecil Chesterton"]}, {"page": "G. K. Chesterton", "response": ["Chesterton is often associated with his close friend, the poet and essayist Hilaire Belloc.Mccarthy, John P. (1982). \"The Historical Vision of Chesterbelloc\",  Modern Age, Vol. XXVI, No. 2, pp. 175–182.McInerny, Ralph. \"Chesterbelloc\",  Catholic Dossier, May/June 1998. George Bernard Shaw coined the name \"Chesterbelloc\"Shaw, George Bernard (1918). \"Belloc and Chesterton\",  The New Age, South Africa Vol. II, No. 16, pp. 309–311. for their partnership,Lynd, Robert (1919). \"Mr. G. K. Chesterton and Mr. Hilaire Belloc\". In: Old and New Masters. London: T. Fisher Unwin Ltd., pp. 25–41. and this stuck. Though they were very different men, they shared many beliefs;McInerny, Ralph. \"The Chesterbelloc Thing\" , The Catholic Thing, 30 September 2008. in 1922, Chesterton joined Belloc in the Catholic faith, and both voiced criticisms of capitalism and socialism.Wells, H. G. (1908). \"About Chesterton and Belloc\",  The New Age, South Africa Vol. II, No. 11, pp. 209–210 (Rep. in Social Forces in England and America,  1914). They instead espoused a third way: distributism.\"Belloc and the Distributists\",  The American Review, November 1933. G. K.'s Weekly, which occupied much of Chesterton's energy in the last 15 years of his life, was the successor to Belloc's New Witness, taken over from Cecil Chesterton, Gilbert's brother, who died in World War I."]}, {"page": "Ezra Pound", "response": ["Pound contributed to the New Age from 30 November 1911 to 13 January 1921, attending editorial meetings in the basement of a grimy ABC tearoom in Chancery Lane.Hutchins (1965), 107, citing Pound's letter to her of August 1953; Wilhelm (1990), 83; Redman (1991), 17 There and at other meetings he met Arnold Bennett, Cecil Chesterton, Beatrice Hastings, S. G. Hobson, T. E. Hulme, Katherine Mansfield, and H. G. Wells. In the New Age office in 1918, he also met C. H. Douglas, a British engineer who was developing his economic theory of social credit, which Pound found attractive. Douglas reportedly believed that Jews were a problem and needed to abandon a Messianic view of themselves as the \"dominating race\".Holmes (2015), 209, citing Douglas, C. H. (26 August 1938). \"The Jews\". Social Credit, 8. Holmes also cites Finlay, J. L. (1972). Social Credit: The English Origins. Montreal: McGill-Queens University Press. According to Colin Holmes, the New Age itself published antisemitic material.Holmes (2015), 210 It was within this environment, not in Italy, according to Tim Redman, that Pound first encountered antisemitic ideas about \"usury\".Redman (1991), 17 \"In Douglas's program,\" Christopher Hitchens wrote in 2008, \"Pound had found his true muse: a blend of folkloric Celtic twilight with a paranoid hatred of the money economy and a dire suspicion about an ancient faith.\"Hitchens (2008)"]}, {"page": "Chesterton", "response": ["**Cecil Chesterton"]}, {"page": "A. K. Chesterton", "response": ["Arthur Kenneth Chesterton was born on 1 May 1899 in Krugersdorp, South African Republic, the son of Arthur George Chesterton (1871–1900), a secretary at the local gold mine, and Harriet Ethel Chesterton (née Down). He was the first cousin once removed of the author and poet G. K. Chesterton and the journalist Cecil Chesterton, his paternal grandfather being an older brother of G. K. and Cecil's father Edward.;  The young A. K. held his two cousins in high regard, seeing Cecil as his \"exemplar\"."]}, {"page": "Hilaire Belloc", "response": ["Belloc wrote over 150 books,Michael H. Markel, Hilaire Belloc, Twayne Publishers (1975), p. 34David Perkins, A History of Modern Poetry: From the 1890s to the High Modernist Mode, Harvard University Press (1976), p. 192 The subjects ranged from warfare to poetry to the many current topics of his day. He has been called one of the Big Four of Edwardian Letters, along with H. G. Wells, George Bernard Shaw, and G. K. Chesterton, all of whom debated with each other into the 1930s. Belloc was closely associated with Chesterton, and Shaw coined the term \"Chesterbelloc\" for their partnership. Belloc was co-editor with Cecil Chesterton of the literary periodical the Eye-Witness,", "With others (G. K. Chesterton, Cecil Chesterton, Arthur Penty) Belloc had envisioned the socioeconomic system of distributism. In The Servile State, written after his party-political career had come to an end, and other works, he criticised the modern economic order and parliamentary system, advocating distributism in opposition to both capitalism and socialism. Belloc made the historical argument that distributism was not a fresh perspective or program of economics but rather a proposed return to the economics that prevailed in Europe for the thousand years when it was Catholic. He called for the dissolution of Parliament and its replacement with committees of representatives for the various sectors of society, an idea that was also popular among Fascists, under the name of corporatism."]}, {"page": "The Mystery of Edwin Drood", "response": ["G. K. Chesterton, best known for the Father Brown mystery stories, was the Judge. Author of The Complete Edwin Drood, J. Cuming Walters, led the prosecution, while W. Walter Crotch and Cecil Chesterton acted for the defence, with the latter’s future wife, Ada Elizabeth Chesterton (appearing under her pseudonym Miss J. K. Prothero) as Princess Puffer. Bransby Williams, well known for his stage monologues as Dickens characters, was Anthony Durdles. Authors and scholars Arthur Waugh, C. Sheridan Jones and Mrs Laurence Clay, played Crisparkle, Bazzard and Helena Landless respectively, while the part of John Jasper was taken by amateur actor Frederick T. Harry.Programme, The Trial of John Jasper for the Murder of Edwin Drood, at King's Hall, Covent Garden, January 7th 1914. (A copy in a private collection, annotated by the original owner.)"]}, {"page": "Marconi scandal", "response": ["Historians have explored anti-Semitism in the allegations. The allegations, whether true or not, were well-founded and serious enough to be brought to public attention. Particularly active in the attack was the New Witness, edited by Cecil Chesterton. This was a distributist publication founded in 1911 by Hilaire Belloc as Eye-Witness, with Cecil's brother G. K. Chesterton on the editorial staff. It had a Catholic perspective and was accused of anti-Semitism.Dean Rapp, \"The Jewish response to GK Chesterton's antisemitism, 1911–33.\" Patterns of Prejudice 24#2–4, (1990): 75-86. online", "Cecil Chesterton expected to be sued by the government ministers under the libel laws, which put the burden of proof on the defendant. Instead, Godfrey Isaacs, Marconi's director, brought a criminal libel action against him. The New Age (12 June 1913) described the trial", "The events were satirised by George Bernard Shaw as the \"macaroni shares\" scandal in his play The Music Cure, which was written to accompany G.K. Chesterton's play Magic, an attack on deceptive mediums which also referred to the scandal.Langford, David, \"Introduction\" to G.K. Chesterton, Magic, English Language Society, 1987. In 1919, Cecil Chesterton's A History of the United States was published, posthumously. In the introduction, his brother G. K. Chesterton wrote this about him", "In her biography of G. K. Chesterton, Maisie Ward devotes a chapter to the scandal and notes, \"Four days after the verdict against Cecil Chesterton, the Parliamentary Committee produced its report\". She goes on to describe that report: \"By the usual party vote of 8 to 6, it adopted a report prepared by Mr. Falconer (one of the two whom Rufus Isaacs had approached privately) which simply took the line that the Ministers had acted in good faith and refrained from criticizing them\". She concludes the chapter with these words, which suggest that, at the very best, the ministers involved lacked judgment,"]}, {"page": "Cecil Edward Chesterton", "response": ["#REDIRECT Cecil Chesterton"]}, {"page": "C. E. Chesterton", "response": ["#REDIRECT Cecil Chesterton"]}, {"page": "Cecil E. Chesterton", "response": ["#REDIRECT Cecil Chesterton"]}, {"page": "Hilaire Belloc bibliography", "response": ["* The Party System (1911) non-fiction (with Cecil Chesterton)", "* One Hundred and one Ballades (1931) with E. C. Bentley G. K. Chesterton C.K. Scott-Moncrieff, Winifred Agar, Sidney Allnutt, Maurice Baring, Cecil Chesterton, Geoffrey Howard, Diggory King, H. S. Mackintosh"]}, {"page": "Holbrook Jackson", "response": ["Initially Jackson and Orage co-edited, with Jackson setting the editorial line with Cecil Chesterton and Clifford Sharp (later the editor of the New Statesman). In 1908 Jackson left and Orage continued as sole editor. Around this time, Orage's wife left him for Jackson, but refused to divorce Orage.John Carswell, Lives and Letters, London, 1978, , p 31"]}, {"page": "Brocard Sewell", "response": ["*Cecil Chesterton, 1975"]}, {"page": "G. K.'s Weekly", "response": ["G.K.'s Weekly was a British publication founded in 1925 (with its pilot edition surfacing in late 1924) by writer G. K. Chesterton, continuing until his death in 1936. Its articles typically discussed topical cultural, political, and socio-economic issues yet the publication also ran poems, cartoons, and other such material that piqued Chesterton's interest. It contained much of his journalistic work done in the latter part of his life, and extracts from it were published as the book The Outline of Sanity. Precursor publications existed by the names of The Eye-Witness and The New Witness, the former being a weekly newspaper started by Hilaire Belloc in 1911, the latter Belloc took over from Cecil Chesterton, Gilbert's brother, who died in World War I: and a revamped version of G. K.'s Weekly continued some years after Chesterton's death by the name of The Weekly Review.", "In terms of criticism, the publication has garnered condemnation for alleged anti-Semitic prejudice to be found in the views of Gilbert and Cecil Chesterton as well as of Hilaire Belloc. The controversy has involved sorting out the distinct differences in the opinions of the three men versus that of others within the publication, as essentially everyone featured had their own nuances to their viewpoints and would disagree among themselves. Critics have alleged that the writers often featured false stereotypes and made ignorant arguments about British capitalistic society while defenders have viewed the accusations as biased and misleading.", "Hilaire Belloc founded a weekly newspaper in 1911 that he titled The Eye-Witness. The publication lasted only a year, though it gained notoriety for publishing articles on the Marconi scandal. It was the first place in which Gilbert Chesterton released the famous poem Lepanto. Belloc focused his energies on anti-capitalist and anti-communist articles fighting against what he saw as the collusion of the many British government members with corrupt forces, writing in a brash style. Belloc would relinquish the editorship to Cecil Chesterton but continued writing for it.", "The essential continuity under the main editorial figures (those mentioned above, and W. R. Titterton who was Gilbert's sub-editor), is a manifestation of the political and economic doctrine of distributism. This was mainly the work of Belloc, Gilbert and Cecil Chesterton, and Arthur Penty, and had its origins in an Edwardian-era split of Fabian socialism in London circles, around A. R. Orage and his prominent publication The New Age.Titterton put it this way in his biography G. K. Chesterton (pp. 62–3):", "There is a continuing debate about the extent of anti-Semitic prejudice to be found in the views of Gilbert and Cecil Chesterton as well as of Belloc. Complicating matters is that the discussion involves three people who were very different in character, though having largely similar political views, and allegations been put in the frame of guilt by association in the past. Cecil Chesterton was the most combative of the three,: Even as a youth, however, Chesterton was intent on conducting arguments and not just receiving them; he would grow up into a man whose talent and contentious spirit earned J. Chesterton Squire's high praise: \"there was no better arguer, no abler journalist, in England\". and his work is probably the most theoretical as well. Looking at them together acknowledges that the publication's history pieced together does represent a continuity of thought given the many different, distinct writers involved.Cheyette, p. 197: After 1925, the political agenda of The New Witness circle continued with the formation of G. K.'s Weekly, [...] and the Distributist League which helped fund this journal.", "The journalism of Cecil Chesterton for the Eye-Witness at the time of the Marconi scandal, is a substantive though flawed reason why Belloc, Cecil Chesterton and G. K. Chesterton have often been considered an anti-semitic clique. This can justly be called guilt by association; which was certainly the precise tactic and fallacy Cecil himself used. One Jewish member of the government, Herbert Samuel, was accused and no evidence was ever shown of his involvement. Godfrey Isaacs sued successfully; he was the brother of the politician Rufus Isaacs, who was cleared by Parliament, but had a case to answer."]}, {"page": "The New Age", "response": ["* Cecil Chesterton"]}, {"page": "Category talk:British journalists", "response": ["Cecil Chestertonnot yet classified"]}, {"page": "Edmund von Mach", "response": ["He came to America in 1891, and was educated at Harvard University (A.B., 1895; A.M., 1896; Ph.D., 1900), where he was an instructor in fine arts from 1899 to 1903.  He was also an instructor in the history of art at Wellesley College from 1899 to 1902, and thereafter lectured on the same subject at Bradford Academy.  He is the author of Greek Sculpture:  Its Spirit and Principles (1903);  A Handbook of Greek and Roman Sculpture (1904);  Outlines of the History of Painting (1905);  The Art of Painting in the Nineteenth Century (1908).  Of the Allgemeines Lexikon der bildenden Künstler he became American editor.  After the outbreak (1914) of the World War I he endeavored to foster a pro-German sentiment among Americans, and with this object in view wrote What Germany Wants (1914) and translated Paul Rohrbach's Der Deutsche Gedanke in der Welt as German World Politics (1915).  In March, 1915, he debated questions of the war with Cecil Chesterton at Carnegie Hall, New York."]}, {"page": "Ron Paul bibliography", "response": ["* Foreword to The Party System, with Hilaire Belloc and Cecil Chesterton. Norfolk, VA: IHS Press (2007). [1911]."]}, {"page": "Rigby Swift", "response": ["In 1913 he defended Cecil Chesterton in the libel trial over his coverage of the Marconi scandal, along with Ernest Wild KC. In opposition was \"as formidable a team as ever conducted a prosecution\" - Edward Carson, later Baron Carson, F. E. Smith, later the Earl of Birkenhead and Richard Muir.Fay (1938) p.28 The allegations by Chesterton were so extreme that a criminal libel case was launched. Chesterton lost, but the case brought Swift's name to the attention of London solicitors.Fay (1938) p.29"]}]}}