{"wiki_id": "http://www.wikidata.org/entity/Q294454", "itemLabel": "Peter Finch", "itemDescription": "British-born Australian actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Finch", "wikipedia_page": {"main": "Frederick George Peter Ingle Finch (28 September 1916 – 14 January 1977) was an English-born Australian actor. He is best remembered for his role as crazed television anchorman Howard Beale in the 1976 film Network, which earned him a posthumous Academy Award for Best Actor, his fifth Best Actor award from the British Academy of Film and Television Arts, and a Best Actor award from the Golden Globes.\nFinch was the first person to win a posthumous Academy Award in an acting category. As of 2021, the only other person to have done so was fellow Australian Heath Ledger.", "link_mentions": [{"page": "Food and Agriculture Organization", "response": ["The original 1billionhungry campaign borrowed as its slogan the line \"I'm as mad as hell, and I'm not going to take this anymore!\", used by Peter Finch in the 1976 film, Network. Meanwhile, the yellow whistle has been the campaign symbol from the start, from 1billionhungry to Ending Hunger. (The creative concept was provided by the McCann Erickson Italy Communication Agency.) It symbolizes the fact that we are \"blowing the whistle\" on the silent disaster of hunger. It is both a symbol and – at many live events taking place around the world – a physical means of expressing frustration and making some noise about the hunger situation."]}, {"page": "Isle of Wight", "response": ["* The film Something to Hide (1972; US title  Shattered), starring Peter Finch, was filmed near Cowes, including a scene on the Red Funnel ferry;"]}, {"page": "January 14", "response": ["*  1977   – Peter Finch, English-Australian actor (b. 1916)"]}, {"page": "September 28", "response": ["*1916 – Peter Finch, English-Australian actor (d. 1977)"]}, {"page": "Battle of the River Plate", "response": ["In 1956, the film The Battle of the River Plate (US title: Pursuit of the Graf Spee) was made of the battle and Admiral Graf Spees end, with Peter Finch as Langsdorff and Anthony Quayle as Harwood. Finch portrays Langsdorff sympathetically as a gentleman. The Achilles, which had been recommissioned in 1948 as HMIS Delhi, flagship of the Royal Indian Navy, played herself in the film.  HMS Ajax (twin turrets) was \"played\" by HMS Sheffield (triple turrets), HMS Exeter (twin turrets) by HMS Jamaica (triple turrets) and HMS Cumberland by herself (although de-gunned as a trials platform). Admiral Graf Spee (two turrets) was portrayed by the U.S. heavy cruiser  (three turrets)."]}, {"page": "Vivien Leigh", "response": ["In January 1953, Leigh travelled to Ceylon to film Elephant Walk with Peter Finch. Shortly after filming commenced, she had a nervous breakdown and Paramount Pictures replaced her with Elizabeth Taylor.Taylor 1984, pp. 93–94. Olivier returned her to their home in Britain, where, between periods of incoherence, Leigh told him she was in love with Finch and had been having an affair with him.Walker 1987, p. 213. Over a period of several months, she gradually recovered. As a result of this episode, many of the Oliviers' friends learned of her problems. David Niven said she had been \"quite, quite mad\". Noël Coward expressed surprise in his diary that \"things had been bad and getting worse since 1948 or thereabouts\".Coleman 2005, pp. 254–263. Leigh's romantic relationship with Finch began in 1948, and waxed and waned for several years, ultimately flickering out as her mental condition deteriorated.Brooks, Richard. \"Olivier Worn Out by Love and Lust of Vivien Leigh\". The Sunday Times, 7 August 2005. (Password required) Retrieved: 27 July 2008."]}, {"page": "1960s", "response": ["* Peter Finch"]}, {"page": "1977", "response": ["** Peter Finch, English-born actor (b. 1916)"]}, {"page": "1950s", "response": ["* Peter Finch"]}, {"page": "1916", "response": ["* September 28 – Peter Finch, English-born Australian actor (d. 1977)"]}, {"page": "History of Australia", "response": ["Menzies presided over a period of sustained economic boom and the beginnings of sweeping social change—with the arrivals of rock and roll music and television in the 1950s. In 1958, Australian country music singer Slim Dusty, who would become the musical embodiment of rural Australia, had Australia's first international music chart hit with his bush ballad \"Pub With No Beer\", while rock and roller Johnny O'Keefe's \"Wild One\" became the first local recording to reach the national charts, peaking at No. 20. Australian cinema produced little of its own content in the 1950s, but British and Hollywood studios produced a string of successful epics from Australian literature, featuring home grown stars Chips Rafferty and Peter Finch."]}, {"page": "Laurence Olivier", "response": ["By the end of the Australian tour, both Leigh and Olivier were exhausted and ill, and he told a journalist, \"You may not know it, but you are talking to a couple of walking corpses.\" Later he would comment that he \"lost Vivien\" in Australia, a reference to Leigh's affair with the Australian actor Peter Finch, whom the couple met during the tour. Shortly afterwards Finch moved to London, where Olivier auditioned him and put him under a long-term contract with Laurence Olivier Productions. Finch and Leigh's affair continued on and off for several years.", "In January 1953 Leigh travelled to Ceylon (now Sri Lanka) to film Elephant Walk with Peter Finch. Shortly after filming started she suffered a breakdown, and returned to Britain where, between periods of incoherence, she told Olivier that she was in love with Finch, and had been having an affair with him; she gradually recovered over a period of several months. As a result of the breakdown, many of the Oliviers' friends learned of her problems. Niven said she had been \"quite, quite mad\", and in his diary, Coward expressed the view that \"things had been bad and getting worse since 1948 or thereabouts.\""]}]}}