{"wiki_id": "http://www.wikidata.org/entity/Q29452199", "itemLabel": "Jorja Smith", "itemDescription": "English singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jorja_Smith", "wikipedia_page": {"main": "Jorja Alice Smith (born 11 June 1997) is an English singer-songwriter. Born and raised in Walsall, West Midlands, she has been writing songs since the age of 11. In 2012, Smith's friend uploaded her cover to YouTube, which led to her discovery by record producer Guy Moot. After her first two singles received broader recognition, she signed with Sony/ATV in 2016, releasing two EPs throughout 2016 and 2017.\nHer debut studio album, Lost & Found, was released in 2018 to critical acclaim, and peaked at number three on the UK Albums Chart. The same year, Smith won the Brit Critics' Choice Award. In 2019, she was named Best British Female Artist at the Brit Awards and was also nominated for the Grammy Award for Best New Artist. Her third EP Be Right Back, which was released in May 2021 received favorable reviews.", "link_mentions": [{"page": "Alicia Keys", "response": ["Keys has been credited with inspiring and influencing many artists, including a younger generation of artists like Adele, Rihanna, Janelle Monáe, H.E.R., Jessie Ware, James Bay, Ella Mai, Wyvern Lingo, Anuhea Jenkins, Jorja Smith, Lauren Jauregui, Normani, Alessia Cara, Ruth-Anne Cunningham, Lianne La Havas, Heather Russell, Grimes, and Sophie Delila."]}, {"page": "Glastonbury Festival", "response": ["|Kylie Minogue, Johnny Marr, Janet Jackson, George Ezra, Liam Gallagher, Vampire Weekend, Lauryn Hill, Miley Cyrus, Bastille, Hozier, Sheryl Crow, Anne-Marie, Years & Years, Tom Odell, Carrie Underwood, Mavis Staples, Björn Again, The Proclaimers, Tame Impala, The Chemical Brothers, Christine and the Queens, Jon Hopkins, Wu-Tang Clan, Janelle Monáe, Interpol, Sean Paul, The Streets, Cat Power, Hot Chip, Rex Orange County, Two Door Cinema Club, The Charlatans, The Lumineers, The BlundaBus, The Blue Aeroplanes The Courteeners, Sigrid, Dave, Billie Eilish, Jorja Smith, Jungle, Kamasi Washington, Pale Waves, Bugzy Malone, Friendly Fires, Babymetal, Lewis Capaldi, Pet Shop Boys, Keane, Mac DeMarco, Lizzo, Bananarama, Jeff Goldblum, Basil Brush", "|Haim, Jorja Smith, Idles, Kano, Wolf Alice, Michael Kiwanuka, Damon Albarn, The Smile, George Ezra, Roisin Murphy"]}, {"page": "Mercury Prize", "response": ["* Jorja Smith – Lost & Found"]}, {"page": "1997 in music", "response": ["**Jorja Smith, British singer"]}, {"page": "List of soul musicians", "response": ["*Jorja Smith"]}, {"page": "Grammy Award for Best New Artist", "response": ["* Jorja Smith"]}, {"page": "Toyota Center", "response": ["| October 24, 2017 || Bruno Mars || Jorja Smith || 24K Magic World Tour || 13,529 / 13,529 || $1,805,759 || "]}, {"page": "Brit Awards", "response": ["| 2018 || Justin Timberlake, Chris Stapleton, Rag'n'Bone Man, Jorja Smith, Dua Lipa, Ed Sheeran, Foo Fighters, Liam Gallagher, Sam Smith, Kendrick Lamar, Rita Ora, Liam Payne and Stormzy", "| 2019 || Hugh Jackman, George Ezra, Little Mix, Ms Banks, Jorja Smith, Calvin Harris, Rag'n'Bone Man, Sam Smith, Dua Lipa, Jess Glynne, H.E.R., The 1975, Pink and Dan Smith"]}, {"page": "PNC Arena", "response": ["|Jorja Smith"]}, {"page": "Rock Werchter", "response": ["*Jorja Smith"]}, {"page": "Amy Winehouse", "response": ["Other artists that have credited Winehouse as an influence and/or for paving the way for them include Bruno Mars, Tove Lo, Jessie J, Emeli Sandé, Victoria Justice, Paloma Faith, Lana Del Rey, Sam Smith, Florence Welch, Halsey, Alessia Cara, Estelle, Daya, Jorja Smith, Lauren Jauregui and Billie Eilish."]}, {"page": "High Contrast", "response": ["High Contrast's remix of \"The One\" by Jorja Smith was Nominated for a Grammy at the 62nd Annual Grammy Awards", "*”The One” by Jorja Smith"]}, {"page": "Charity record", "response": ["|\"Artists for Grenfell\": Angel, Anne-Marie, Bastille, Brian May, Carl Barât, Craig David, Deno, Donae'o, Dua Lipa, Ella Eyre, Ella Henderson, Emeli Sandé, Fleur East, Gareth Malone's All Star Choir, Geri Halliwell, Gregory Porter, James Arthur, James Blunt, Jessie J, Jessie Ware, John Newman, Jon McClure, Jorja Smith, Kelly Jones, Labrinth, Leona Lewis, Liam Payne, London Community Gospel Choir, Louis Tomlinson, Louisa Johnson, Matt Goss, Matt Terry, Mr Eazi, Nathan Skyes, Nile Rodgers, Omar, Paloma Faith, Pixie Lott, Ray BLK, RAYE, Rita Ora, Robbie Williams, Shakka, Stormzy, The Who, Tokio Myers, Tom Grennan, Tony Hadley, Tulisa, WSTRN"]}, {"page": "Wireless Festival", "response": ["Wireless Festival 2016 was held on the weekend of 8–10 July at Finsbury Park. The lineup was announced on 9 March, with conformation that Calvin Harris would be Headlining Friday, Chase & Status & J. Cole co-headling Saturday and Kygo & Boy Better Know co-headlining Sunday. Tickets were on sale 2 Days Later. On 16 March, Dua Lipa was announced for Friday. 3 days later Lady Leshurr was announced for Saturday. On 11 May, Wizkid and 99 Souls were announced for Friday, Natalie La Rose, Angel, Shakka, Rude Kid, KStewart, The Manor, Jorja Smith, and A2 were announced for Saturday, Fergie, Big Sean, Metro Boomin, Jay Sean, Ghetts, Thomas Jack, Fekky, Elf Kid, Sonny Digital and Father were announced for Sunday. On the same day, Lady Leshurr was moved to Friday. On 21 May Kyla was announced for Saturday. Wizkid had pulled out due to Visa Problems.", "Jorja Smith"]}, {"page": "Nitin Sawhney", "response": ["Sawhney has scored for and performed with orchestras, and collaborated with and written for Paul McCartney, Sting, The London Symphony Orchestra, A.R. Rahman, Brian Eno, Sinead O’Connor, Jacob Golden, Anoushka Shankar, Jeff Beck, Shakira, Will Young, Joss Stone, Taio Cruz, Ellie Goulding, Horace Andy, Cirque du Soleil, Akram Khan, Deepa Mehta, Mira Nair, Nelson Mandela, Ojos de Brujo, Hélène Grimaud, Natacha Atlas, Jools Holland, Jorja Smith and John Hurt. Performing extensively around the world, he has achieved an international reputation across multiple artistic mediums."]}, {"page": "Black British people", "response": ["Marsha Ambrosius, Joan Armatrading, Pato Banton, Dame Shirley Bassey, Mel B, Alexandra Burke, Celeste, Diane Charlemagne, Taio Cruz, Craig David, Des'ree, Fleur East, Estelle, Gabrielle, Roland Gift, Jaki Graham, David Grant, Eddy Grant, Pauline Henry, Dev Hynes, Jamelia, KSI, Leona Lewis, Shaznay Lewis, Mahalia, Ella Mai, MNEK, Maxine Nightingale, Billy Ocean, Leigh-Anne Pinnock, Maxi Priest, Corinne Bailey Rae, Andrew Roachford, Sade, Emeli Sande, Seal, Skepta, Heather Small, Jorja Smith, 21 Savage, Benji Webbe, Simon Webbe, Caron Wheeler, and Young MC are among the popular singers not mentioned in the music section above."]}, {"page": "Paul Epworth", "response": ["| Jorja Smith"]}, {"page": "Summer Sonic Festival", "response": ["* Jorja Smith"]}, {"page": "KCPR", "response": ["Occasionally, KCPR hosts concerts at SLO Brew in downtown San Luis Obispo. Some notable artists have performed at these shows, including Jorja Smith and The Strokes."]}, {"page": "Amanda Ghost", "response": ["Amanda left her position as president of Epic Records in 2010. and became CEO of her own record label, Outsiders, a joint venture with The Universal Music Group. In 2011, she was executive producer for the Scissor Sisters album Magic Hour, and co-wrote the smash hit \"Only The Horses\", co-produced by Calvin Harris. She co-wrote two songs for the Florence and The Machine album Ceremonials, and has more recently collaborated with John Legend, Sub Focus, Jorja Smith and ASAP Rocky.", "| Jorja Smith", "| Jorja Smith, Joel Compass, Ed Thomas, Kito"]}, {"page": "Glastonbury Festival line-ups", "response": ["* Jorja Smith", "* Jorja Smith"]}, {"page": "1997 in the United Kingdom", "response": ["* 11 June – Jorja Smith, singer"]}, {"page": "BBC Radio 1's Big Weekend", "response": ["| BastilleWolf AliceCHVRCHESMØMabelNot3sSigridJorja SmithSteel Banglez", "| Stormzy (2017)  Alicia Keys (2010)  J Hus (2018)  Snoop Dogg (2015)  Koffee  Dave (2019)  Pharrell Williams (2014)  Nas (2012)  Ms Banks  Dizzee Rascal (2013)  Mahalia  AJ Tracey (2019)  ASAP Rocky (2013)  Afro B  Aitch (2019)  Stefflon Don (2018)  Jorja Smith (2018)", "|style=\"text-align:center;\"| Ed Sheeran  Coldplay  Jorja Smith  AJ Tracey  Royal Blood  Mabel  Wolf Alice  Celeste  London Grammar  Anne-Marie"]}, {"page": "Music in Leeds", "response": ["The Bellgrave Music Hall is a music venue and eatery on Cross Bellgrave Street. Its first floor venue room has a capacity of 300 and has hosted performances from acts such as Royal Blood, the Fall and Jorja Smith."]}, {"page": "Rock en Seine", "response": ["| - Catastrophe- Louis Cole Big Band- Alpha Wann- Jorja Smith- Major Lazer"]}, {"page": "List of Live Lounge cover versions", "response": ["|James Arthur ||\"Why'd You Only Call Me When You're High?\" by Arctic Monkeys \"Hurts\" by Emeli Sande\"How to Save a Life\" by The Fray\"Silent Night\" by Joseph Mohr & Franz Xaver Gruber\"Blue Lights\" by Jorja Smith ||24 October 201325 October 201621 December 201721 December 20173 July 2018", "|Jorja Smith ||\"Man Down\" by Rhianna\"All the Stars\" by Kendrick Lamar and SZA\"Guns in the Distance\" by Maverick Sabre|| 7 June 2018YouTube5 November 201817 September 2020"]}, {"page": "Soul Train Music Award for Best New Artist", "response": ["| Jorja Smith"]}, {"page": "Amway Center", "response": ["*Bruno Mars – October 14, 2017, with Jorja Smith"]}, {"page": "Primavera Sound", "response": ["The lineup for the 2021 edition, which would run from June 2 to June 6 and be presented under the slogan #BestFestivalForever, was announced a year before its celebration. The lineup included most artists that were scheduled to play there in 2020. New additions to it included Gorillaz, Doja Cat, FKA Twigs, Rina Sawayama and Charli XCX among many others. In March 2021, the festival was rescheduled once again for the summer of 2022. In May 2021, the definitive lineup for the 20th anniversary was presented as \"the best one in the festival's history\". New headliners include Dua Lipa, Lorde, Nick Cave & the Bad Seeds, Megan Thee Stallion and Jorja Smith. From 2022 on, the festival will consist of two weekends, similarly like Coachella. Local artists include Alizzz, Amaia, Bad Gyal, La Zowi, Manel, María del Mar Bonet, Renaldo & Clara, Rigoberta Bandini, Sen Senra and Triángulo de Amor Bizarro, among others. Balearic group Antònia Font is scheduled to make its reunion concert after their split in 2013. The lineup was completed on December 13, featuring additional bookings of Phoenix, Tokischa, Jhay Cortez, Grimes and PinkPantheress among others. The twentieth anniversary of Primavera Sound has been considered an Event of Exceptional Public Interest by the Government's Ministry of Culture and Sports. It is the first international music festival in Spain with this cultural distinctive.", "|Beck · Dua Lipa · Gorillaz · Interpol · Jorja Smith · Lorde · Massive Attack · Megan Thee Stallion · Nick Cave & the Bad Seeds · Pavement · Phoenix · Tame Impala · The National · The Strokes · Tyler, the Creator · Yeah Yeah Yeahs"]}, {"page": "List of performances on Top of the Pops", "response": ["* AJ Tracey with Jorja Smith – \"Ladbroke Grove\"", "During the broadcast, footage of The Big Night In and One World Together at Home were shown and demonstrated artists including Neil Diamond, Brandon Flowers, Liam Gallagher, Stefflon Don, Little Mix, Michael Ball and Captain Tom Moore, Ariana Grande and Justin Bieber, John Legend, Charli XCX, Miley Cyrus, Liam Payne, Haim, Dizzee Rascal and Sophie Ellis-Bextor and made music and connected with their fans during the COVID-19 pandemic which put a halt to touring. The show also touched on how artists such as Jorja Smith, H.E.R. and Stormzy responded to the murder of George Floyd and supported the Black Lives Matter movement through their music and celebrated chart achievements by Ariana Grande, BTS, Michael Kiwanuka, Billie Eilish, Dame Shirley Bassey, The Rolling Stones, Kylie Minogue and Taylor Swift."]}]}}