{"wiki_id": "http://www.wikidata.org/entity/Q29546291", "itemLabel": "Eric Shanes", "itemDescription": "British painter (1944-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eric_Shanes", "wikipedia_page": {"main": "Eric Victor Shanes (21 October 1944 – 19 March 2017) was an English painter and art historian who specialised in the art of J. M. W. Turner.", "link_mentions": [{"page": "Chichester Cathedral", "response": ["The cathedral has been the subject of a number of depictions in art, literature, and television media. Its spire and towers are visible in the 1828 painting, Chichester Canal, by J. M. W. Turner. It is also speculated, by Eric Shanes, that Chichester Cathedral is the subject of one of Turner's colour studies for Picturesque Views in England and Wales. In 1833, Joseph Francis Gilbert produced an oil painting of the cathedral, showing the surrounding cityscape. It was collected by Paul Mellon and gifted to the Yale Center for British Art, which he established, in 1966. John Constable completed his own watercolour of the cathedral in 1824, now located in the Victoria and Albert Museum in London."]}, {"page": "Deaths in March 2017", "response": ["*Eric Shanes, 72, English painter and art historian.Eric Shanes Remembered"]}, {"page": "Eric Victor Shanes", "response": ["#REDIRECT Eric Shanes"]}, {"page": "Shanes (surname)", "response": ["* Eric Shanes (1944–2017), English painter and art historian"]}, {"page": "The Colossus of Rhodes (Dalí)", "response": ["The painting shows the Colossus of Rhodes standing on a base of unworked ashlar. The perspective is from below the statue's base, suggesting that the viewer is on a boat approaching the city, and emphasising the statue's extreme height and size. A piece of drapery wraps around the waist of Helios and hangs from his left arm, falling down to touch the ground behind him. The statue appears to be made of bronze, and has a segmented construction entirely composed of numerous individual plates. Helios raises his right hand to shield his eyes from the sun over which he reigns, giving what the art historian Eric Shanes terms \"a vaguely Surrealist touch\" to Dalí's work. In the lower right Dalí signed and dated the work \"Salvador Dalí / 1954\"."]}, {"page": "Shanes, Eric", "response": ["#redirectEric Shanes"]}]}}