{"wiki_id": "http://www.wikidata.org/entity/Q2958462", "itemLabel": "Charles Austen", "itemDescription": "British Royal Navy admiral (1779-1852)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Austen", "wikipedia_page": {"main": "Rear Admiral Charles John Austen CB (23 June 1779 – 7 October 1852) was an officer in the Royal Navy and the youngest brother of novelist Jane Austen. He served during the French Revolutionary and Napoleonic Wars, and beyond, eventually rising to the rank of rear-admiral.", "link_mentions": [{"page": "Persuasion (novel)", "response": ["Canadian scholar Sheila Johnson Kindred states that parts of Persuasion were inspired by the career of Austen's brother Charles Austen, a Royal Navy officer as there are some similarities between the career of the real-life Captain Austen and the fictional Captain Wentworth: both began their careers in command of sloops in the North America station at about the same age; both were popular with their crews; both progressed to the command of frigates; both were keen to share their prize money with their crews, though Captain Wentworth ended up considerably richer as a result of his prize money than did Captain Austen."]}, {"page": "Trincomalee", "response": ["With the turn of the modern era, English authors and poets used Trincomalee as inspiration for literature and poetry and became connected with the city. Arthur C. Clarke, who discovered the temple's underwater ruins with photographer Mike Wilson, described the city and the ruins in Reefs of Taprobane and would go on to write 2001: A Space Odyssey based on his experiences in the city. Trincomalee's Bhadrakali Amman temple provides a setting in Wilbur Smith's novel Birds of Prey. Arthur Conan Doyle's Sherlock Holmes stories feature multiple settings in the city, including in A Scandal in Bohemia and A Singular Affair at Trincomalee. Jane Austen's younger brother Charles Austen of the British Royal Navy is buried in Trincomalee."]}, {"page": "Royal Indian Navy", "response": ["In 1848, an Indian Navy contingent of 100 ratings and seven officers took part in the Siege of Multan during the Anglo-Sikh War.Rear Admiral Satyindra Singh AVSM, Under Two Ensigns: The Indian Navy 1945-1950 (1986), p. 42 In 1852, at the outset of the Second Anglo-Burmese War, ships of Her Majesty's Indian Navy joined a Royal Navy force under the command of Admiral Charles Austen to assist General Godwin in the capture of Martaban and Rangoon.Edmund Burke, ed., The Annual Register of the Year 1852 (Longmans, Green, 1853), p. 283"]}, {"page": "Deceased Wife's Sister's Marriage Act 1907", "response": ["Under ecclesiastical law, a marriage within the prohibited degrees was not absolutely void but it was voidable at the suit of any interested party. Matthew Boulton married his deceased wife's sister in 1760. He advised silence, secrecy and Scotland, although they married in London; the marriage was opposed by her brother. Similarly Charles Austen, the younger brother of Jane Austen, married his deceased wife's sister in 1820 and remained married to her until he died in 1852. "]}, {"page": "Austen (surname)", "response": ["*Charles Austen (1779–1852), English admiral"]}, {"page": "Francis Austen", "response": ["In July 1806 Austen married Mary Gibson (eldest daughter of John Gibson); they had ten children. Following the death of his first wife, he married Martha Lloyd (eldest daughter of the Reverend Noyes Lloyd) in July 1828; they had no children. Austen's siblings included Jane Austen, the novelist, Cassandra Austen, the watercolor painter, and Charles Austen, a naval officer."]}, {"page": "James Hanway Plumridge", "response": ["Plumridge returned to sea duty in August 1847, commanding the frigate  on the East Indies and China Station, and serving as second-in-command with the rank of commodore. Following the death of the Commander-in-Chief, Francis Augustus Collier, on 28 October 1849, Plumridge served as C-in-C pro tem until the arrival of Charles Austen in January 1850. He was raised to the rank of rear admiral on 8 October 1852."]}, {"page": "Mansfield Park", "response": ["Austen knew Portsmouth from personal experience. She records that Admiral Foote, then Second-in-Command at Portsmouth, was \"surprised that I had the power of drawing the Portsmouth-Scenes so well\". Her brother, Charles Austen served as a Royal Navy officer during the Napoleonic Wars. In the novel, Fanny's brother William joins the Royal Navy as an officer, whose ship, HMS Thrush, is sited right next to  at Spithead.Kindred, Shelia Johnson \"The Influence of Naval Captain Charles Austen’s North American Experiences on Persuasion and Mansfield Park\" pages 115–129 from Persuasions: The Jane Austen Journal Issue, Issue 31, June 2009 page 125. Captain Austen commanded HMS Cleopatra during her cruise in North American waters to hunt French ships from September 1810 to June 1811. If the novel refers to the ship in its historical context, this would date the main events of the novel as 1810–1811. William's tales of his life as a midshipman recounted to the Bertrams would have indicated to early readers that he had sailed with Nelson to the Caribbean. Lady Bertram requests two shawls if he goes to the East Indies.", "William gives Fanny the gift of an amber cross. This echoes the gift of topaz crosses given by Charles Austen to his sisters before he set sail to the Royal Navy's North America stations in Halifax and Bermuda. In Fanny's East room, Edmund speculates from her reading that she will be 'taking a trip into China' in the footsteps of Lord Macartney's pioneering cultural mission.Austen, Jane. Mansfield Park, ch. 16 (Kindle Location 2095)."]}, {"page": "HMS Endymion (1797)", "response": ["* Privateer ship Scipio, armed with eighteen brass 9-pounders and carrying a crew of 149 men. She was from Bordeux, three days out of St. Andero, but had taken nothing. Williams described her as \"quite new, very complete, and sails extremely fast.\" Scipio led Endymion on an \"arduous Chace\". Finally, then Lieutenant Charles Austen set off in a small boat in a gale with only four other men, and succeeded in boarding and taking possession her; he kept control of Scipio until the following day when Endymion could complete the capture."]}, {"page": "Template talk:Jane Austen", "response": ["== Charles Austen ==", "I added Charles Austen to the template, since he now has an article in his own right. Like Francis he's been suggested as a possible inspiration, particularly for some of her seafaring characters, but if people feel that he's at too much of a tangent to feature I don't particularly mind him being taken out again. Benea (talk) 12:34, 3 November 2008 (UTC)"]}, {"page": "Timeline of Jane Austen", "response": ["*23 June – Charles Austen (Jane's brother) born at Steventon", "*Charles Austen enters the Royal Naval Academy", "*September – Charles Austen leaves the Royal Naval Academy and goes to sea", "*Summer – Charles Austen joins the Austens for the holidays", "*19 May – Charles Austen marries Fanny Palmer in Bermuda", "*August – Charles Austen and family return to England"]}, {"page": "HMS Phoenix (1783)", "response": ["Captain William Webley assumed command of Phoenix in 1813 and held the post until September 1814. From 14 September 1814 on, her last captain was Charles Austen, brother of the novelist Jane Austen. In 1815, following Napoleon's escape from Elba, the Admiralty sent Phoenix, , and  to the Adriatic to co-operate with the Austrians and to prevent the escape of some Neapolitan warships. Phoenix and Garland watched two large frigates at Brindisi, while Undaunted searched the coast to the northward. After the surrender of Naples, following the Treaty of Casalanza, Austen persuaded the captains of the two Neapolitan frigates to switch their allegiance to the restored monarch, Ferdinand IV of Naples.Marshall (1828), Supplement, Part 2, pp.75-6.", "Austen was able to procure a storehouse for the crew where they were provided with fires, bread and wine. Mr. Curotavich of Chisme took in Austen and his officers, supplying them with clothes, food, and beds.Charles Austen's log-book entry, quoted in Myer (1997), 223. While the crew was in Smyrna Austen had to have several members flogged for drunkenness and thieving."]}, {"page": "HMS Garland (1807)", "response": ["In 1814 Garland was off the north coast of Spain, still under Davies. In 1815, following Napoleon's escape from Elba, the Admiralty sent Garland and Undaunted to the Adriatic, under the orders of Captain Charles Austen, brother of the novelist Jane Austen, in . Austen's mission was to co-operate with the Austrians and to intercept some Neapolitan warships. Phoenix and Garland watched two large frigates at Brindisi, while Undaunted cruised northwards along the coast. After the surrender of Naples, following the military convention of Casalanza, Austen persuaded the captains of the two Neapolitan frigates to switch their allegiance to the restored monarch, Ferdinand IV of Naples."]}, {"page": "HMS Namur (1756)", "response": ["* One of Namurs captains was Charles Austen, a brother of Jane Austen."]}]}}