{"wiki_id": "http://www.wikidata.org/entity/Q29586884", "itemLabel": "Victor Beigel", "itemDescription": "pianist", "wikipedia_url": "https://en.wikipedia.org/wiki/Victor_Beigel", "wikipedia_page": {"main": "Victor Beigel (19 May 1870 – 7 November 1930) was an English pianist and singing teacher of Hungarian descent.\nBeigel was an internationally renowned vocal pedagogue. Friendships connected him with the painter John Singer Sargent, the interior designer Sybil Colefax and the composers John Ireland and Percy Grainger, whose choir rehearsals he accompanied on the piano for years. He was also a friend of his student Gervase Elwes, after whose death in 1921 he founded the Gervase Elwes Memorial Fund (later the Musicians Benevolent Fund) to support young musicians. His students included Lauritz Melchior, Anita Patti Brown, John Goss and Monica Harrison. During the First World War, he gave and organised benefit concerts in support of the Wounded Soldiers Concert Fund\".\nBeigel died in Elstead at the age of 60.\n\n", "link_mentions": [{"page": "Lauritz Melchior", "response": ["In September 1920, when he was singing the Steersman's Song, from Wagner's Der fliegende Holländer at a Prom Concert, he met the popular novelist and passionate Wagnerite Hugh Walpole and the two quickly became firm friends, travelling together and staying in each other's houses. On a visit to Walpole's cottage in Polperro Melchior \"caused a sensation by singing at a concert in the village\", and later on a visit to Helston he and Walpole both took part in the Floral Dance. In December 1921 on a visit with Walpole to his (Walpole's) parents in Edinburgh, Melchior gave a concert in the Usher Hall. Walpole provided the fledgling Heldentenor with financial aid in February 1922, paying in advance two-thirds of the fees for his studies under Victor Beigel. In 1923, Walpole gave Melchior a further £800, enabling him to continue his studies with Ernst Grenzebach and the legendary dramatic soprano of the Vienna Court Opera, Anna Bahr von Mildenburg."]}, {"page": "Help Musicians", "response": ["It was created by Victor Beigel in 1921 as the Gervase Elwes Memorial Fund, following the death of English tenor Gervase Elwes. It was renamed as the Musicians Benevolent Fund in 1926 and became a registered charity. Until his death in 1934, Edward Elgar was the fund's president."]}, {"page": "Raimund von zur-Mühlen", "response": ["In his younger days he usually appeared with his habitual accompanist and kindred spirit Hans Schmidt. Among his later accompanists were Victor BeigelElwes 1935, 129. and Coenraad V. Bos. Bos mentions him in his book: the singer gave his young accompanist no encouragement, but criticized him severely. After their fifth concert together he was told 'You must have played well today, for I did not notice you.'Cited in G. Moore, Am I Too Loud (Harmondsworth 1966, 40). He was the teacher of Lula Mysz-Gmeiner (who taught Elisabeth Schwarzkopf), of Mark Raphael, Hans Lissman, Eva Jekelius-Lissman, Rose Walter, Eidé Norena, Martha Lipton, Georg A. Walter, Fanny Opfer, Naima Wifstrand, and Hermann Weißenborn, among many others."]}, {"page": "Ivor Newton", "response": ["Newton was born in Limehouse, London.  His studies were with York Bowen, Isidor Snook in Amsterdam, Raimund von zur-Mühlen, Conraad van Bos in Berlin, and Victor Beigel in London.Grove's Dictionary of Music and Musicians, 5th ed., 1954, Vol. VI, pp. 75, 76"]}, {"page": "Monica Harrison", "response": ["A childhood accident also reportedly limited her educational and performing opportunities.“Monica Harrison,” in famous musician burials. Limpsfield, United Kingdom: The Limpsfield Net, retrieved online June 12, 2018. As a result, when her parents determined that she was ready to pursue more advanced vocal training, Monica Harrison entered into studies with Victor Beigel.Victor Beigel; Noted Teacher of Singing Dies in Sussex, England, at 59.” New York: The New York Times, January 8, 1930."]}, {"page": "Anita Patti Brown", "response": ["Patsie Bush or Patsie Dean was born in Georgia, and raised in Chattanooga, Tennessee. She trained as a singer in Chicago, and later studied in Europe with Victor Beigel."]}]}}