{"wiki_id": "http://www.wikidata.org/entity/Q2951068", "itemLabel": "Franciscus Junius", "itemDescription": "philologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Franciscus_Junius_(the_younger)", "wikipedia_page": {"main": "Franciscus Junius (29 January 1591 – 1677),[1] also known as François du Jon, was a pioneer of Germanic philology.  As a collector of ancient manuscripts, he published the first modern editions of a number of important texts. In addition, he wrote the first comprehensive overview of ancient writings on the visual arts, which became a cornerstone of classical art theories throughout Europe.", "link_mentions": [{"page": "Beowulf", "response": ["The earliest extant reference to the first foliation of the Nowell Codex was made sometime between 1628 and 1650 by Franciscus Junius (the younger). The ownership of the codex before Nowell remains a mystery."]}, {"page": "January 29", "response": ["*1591 – Franciscus Junius, pioneer of Germanic philology (d. 1677)"]}, {"page": "1591", "response": ["* January 29 – Franciscus Junius, pioneer of Germanic philology (d. 1677)"]}, {"page": "Leiden", "response": ["* Franciscus Junius (1591–1677) a pioneer of Germanic philology   "]}, {"page": "Woodstock, Oxfordshire", "response": ["The name Woodstock is Old English in origin, meaning a \"clearing in the woods\". The Domesday Book of 1086 describes Woodstock (Wodestock, Wodestok, Wodestole) as a royal forest. Æthelred the Unready, king of England, is said to have held an assembly at Woodstock at which he issued a legal code now known as IX Æthelred.See Prosophography of Anglo-Saxon England . In the 17th century Robert Plot wrote that King Alfred stayed at Woodstock about the year 890 when he translated Boethius' Consolations of Philosophy. . The source cited by him was a \"Cotton Otho A\" manuscript, but no such manuscript has produced evidence of this. It may have been Cotton Otho A.x, destroyed in the Ashburnham House fire of October 1731, though the catalogues by Humfrey Wanley and Franciscus Junius make no mention of this.   King Henry I may have kept a menagerie in the park. Woodstock was the scene of King Henry II's courtship of Rosamund Clifford (Fair Rosamund). The market of the town was established when King Henry II gave Woodstock a Royal charter in 1179. The Bear Hotel in Park Street opposite The Oxfordshire Museum dates from the 13th century."]}, {"page": "Junius manuscript", "response": ["The manuscript owes its current designation to the Anglo-Dutch scholar Franciscus Junius, who was the first to edit its contents and who bequeathed it to Oxford University. It is kept in the Bodleian Library under shelfmark MS Junius 11.", "The codex now referred to as the \"Junius manuscript\" was formerly called the \"Cædmon manuscript\" after an early theory that the poems it contains were the work of Cædmon; the theory is no longer considered credible, therefore the manuscript it is commonly referred to either by its Bodleian Library shelf mark \"MS Junius 11\", or more casually as \"the Junius manuscript\" or \"Codex Junius\". 'Junius' in these is Franciscus Junius, who published the first edition of its contents in 1655."]}, {"page": "Franciscus Junius", "response": ["Franciscus Junius may refer to:", "* Franciscus Junius (the elder) (1545–1602), theologian and Hebrew scholar", "* Franciscus Junius (the younger) (1591–1677), theologian, art theorist and Germanic philologist, son of the above"]}, {"page": "Ormulum", "response": ["The provenance of the manuscript before the seventeenth century is unclear. From a signature on the flyleaf we know that it was in van Vliet's collection in 1659. It was auctioned in 1666, after his death, and probably was purchased by Franciscus Junius, from whose library it came to the Bodleian as part of the Junius donation.Holt 1878, pp. liv–lvi"]}, {"page": "Junicode", "response": ["The designs of the Junicode roman characters are based on a 17th-century typeface design used at the Oxford University Press, also known as Clarendon Press. Peter Baker based the Junicode roman design on those used in George Hickes' Linguarum Vett. Septentrionalium Thesaurus (1703–1705), naming the typeface Junicode (\"Junius Unicode\") after Franciscus Junius, who had commissioned the original typeface used for the Anglo-Saxon texts in that volume, \"Pica Saxon\". The designs represent an intermediate stage between earlier 16th century typefaces (such as Garamond) and later 18th century typefaces (such as Caslon). The Junicode roman character design shares a number of features with these earlier and later typefaces."]}, {"page": "Heliand", "response": ["The poem must have been relatively popular and widespread because it exists in two manuscript versions and four fragmentary versions. It takes up about 6,000 lines. A praefatio exists, which could have been commissioned by either Louis the Pious (king from 814 to 840) or Louis the German (806–876). This praefatio was first printed by Matthias Flacius in 1562, and while it has no authority in the manuscripts it is generally deemed to be authentic. The first mention of the poem itself in modern times occurred when Franciscus Junius (the younger) transcribed a fragment in 1587.Kees Dekker, 'Francis Junius (1591-1677): Copyist or Editor?', Anglo-Saxon England, 29 (2000), 279-96 (p. 289). It was not printed until 1705, by George Hickes. The first modern edition of the poem was published in 1830 by Johann Andreas Schmeller."]}, {"page": "Franciscus, the Younger Junius", "response": ["#REDIRECT Franciscus Junius (the younger)"]}, {"page": "Nowell Codex", "response": ["The damage to the Nowell Codex can be overcome to different degrees. The three pages in bad shape mentioned above have been studied under ultraviolet light, and the resulting information has been published.Beowulf and Judith, p. xx Three modern transcriptions of parts of this portion of this manuscript are known. Two of these transcriptions, known as A and B, were made under the direction of the first editor of Beowulf, Grimur Jonsson Thorkelin in the years 1786-1787 after the Cottonian fire yet before the manuscript had deteriorated as far as it presently has. Transcript A was made by an unidentified professional copyist, while B was made by Thorkelin himself.Beowulf and Judith, pp. xxf The third transcript (MS Junius 105, currently in the Bodleian Library) is of the Judith poem and was made by Franciscus Junius between 1621 and 1651. A careful copy of the poem with only occasional errors, Junius' transcription preserves the text of the poem before it suffered fire damage.Beowulf and Judith, pp. xxiif"]}, {"page": "Jan van Vliet", "response": ["It was in 1659 that he began to correspond regularly with his more famous contemporary Franciscus Junius, who was then resident in England, but visiting the Netherlands frequently.  Their common interest in the study and collection of manuscripts led them to become firm friends, and Van Vliet appears to have made considerable use of Junius' library in his studies in his final years."]}, {"page": "Junius", "response": ["* Franciscus Junius (the elder) (1545–1602), Huguenot theologian", "* Franciscus Junius (the younger) (1591–1677), Germanic philologist"]}, {"page": "Franciscus Junius (the elder)", "response": ["Franciscus Junius the Elder (born François du Jon, 1 May 1545 – 23 October 1602) was a Reformed scholar, Protestant reformer and theologian. Born in Bourges in central France, he initially studied law, but later decided to study theology in Geneva under John Calvin and Theodore Beza. He became a minister in Antwerp, but was forced to flee to Heidelberg in 1567. He wrote a translation of the Bible into Latin with Emmanuel Tremellius, and his Treatise on True Theology (De Vera Theologia) was an often used text in Reformed scholasticism.", "Franciscus Junius was born in Bourges, and beginning at age twelve studied law at the university there under François Douaren and Hugo Donellus. On account of his abilities in Greek and law, he was given the position of aide to the French ambassador at the court of Suleiman I in Constantinople, but before he reached Lyon, whence he was to travel by boat, the ambassador had departed.", "From 1573 till 1578 he was at Heidelberg, assisting Emmanuel Tremellius, whose daughter he married; their child, also called Franciscus Junius, became an early scholar of Germanic philology. The Tremellius-Junius Bible, a distinctively Reformed Latin translation, was first published in 1579. It received thirty-three printings between 1579 and 1764 and was very influential on Reformed dogmatics, shaping Protestant theology into the late eighteenth century. The Tremellius-Junius Old Testament was often paired with Theodore Beza's translation of the New Testament. Frederick III was succeeded by Louis IV, a Lutheran, in 1576, and the Reformed in Heidelberg who refused to sign the Formula of Concord were forced out. In 1579, German prince and friend of the Reformed John Casimir formed the Casimirianum Neustadt. Junius, along with author of the Heidelberg Catechism Zacharias Ursinus, was one of the first faculty members. Junius became a friend of Ursinus, and delivered his funeral oration when he died in 1583. In 1583, John Casimir became regent, and Junius was invited back to become professor of theology at the University of Heidelberg."]}, {"page": "Franz Junius (the younger)", "response": ["#REDIRECT Franciscus Junius (the younger)"]}, {"page": "Alethea Howard, Countess of Arundel", "response": ["She lived in Antwerp, but moved to Alkmaar, after her husband died. She invited Franciscus Junius, for thirty years in their service, to rearrange the collection of books. Then she moved to Amersfoort (1649), and rented a pied-a-terre in Amsterdam at Singel 292, an elegant house, with a courtyard facing Herengracht.S.A.C. Dudok van Heel (1991) De graaf en graven van Arundel in ballingschap in de Nederlanden en in Italie. In: Maandblad Amstelodamum, p. 31-34."]}, {"page": "Gysbert Japiks", "response": ["Japiks started writing from an early age. He wrote in Dutch, Frisian and Latin. He admired the Latin poets Horace and Ovid, but was also an enthusiast for his own West Frisian memmetaal, or mother tongue. His first known poetry in dates back from 1639. In his early works Japiks portrayed the life of rural Friesland, and was characterised by excessive alliteration. Much of his work were translations and reworkings of Latin poets, but also the Dutch poets Vondel and Constantijn Huygens featured prominently in his work. His first published work in book form was Friessche Tjerne (1640). In 1644, Franciscus Junius was researching Old German languages, and visited Japiks for work and information about the West Frisian language. Around 1650, Japiks and Abbe Freerks Gabbema started a letter exchange most of which still exists in which Gabbema encouraged Japiks to publish and avoid Dutch orthography in his Frisian writings. His publisher Rintjus however was reluctant to publish in Frisian."]}, {"page": "Genesis B", "response": ["Genesis B makes Satan a central character, giving him a monologue which provides an extensive opportunity for character development. This literary approach is similar to that of John Milton's seventeenth-century epic Paradise Lost. Since Milton was acquainted with Franciscus Junius (the younger), who owned Julius 11 and made some attempt to read it, it has been speculated that Genesis B was one inspiration for Paradise Lost."]}, {"page": "Franconian (linguistics)", "response": ["Earlier use of \"Franconian/Frankish\" as a linguistic category can be found.e.g.: Friedrich Adelung: Uebersicht aller bekannten Sprachen und ihrer Dialekte. St. Petersburg, 1820, p. 45 (\"Fränkisch\" (Bavarian) besides \"Gothisch\" and \"Alemannisch\" as \"Oberdeutsch\") and p. 51 (\"Mittel-Deutsch. (Ost-Fränkisch.)\" including \"Fränkisch\" (East Franconian) between \"Hessisch\" and \"Nürnbergisch\") For example, Dutch linguist Jan van Vliet (1622–1666) used Francica or Francks. According to van Vliet, Francks descended from oud Teuts (ancient Germanic).. Similarly, the scholar Franciscus Junius was said to have collected fragments of vetere Francica ad illustrandam linguam patriam (in Old Frankish, for the elucidation of the mother tongue) in 1694."]}, {"page": "Franciscus", "response": ["*Franciscus Junius (the elder) (François du Jon; 1545–1602), Huguenot scholar and theologian", "*Franciscus Junius (the younger) (1591–1677), Huguenot philologist and art historian"]}, {"page": "Michael Burghers", "response": ["*Franciscus Junius; after the same."]}, {"page": "Raina Fehl", "response": ["Franciscus Junius (the younger), The Literature of Classical Art", "The literature of classical art / Franciscus Junius ; edited by Keith Aldrich, Philipp Fehl, Raina Fehl"]}, {"page": "Thomas Marshall (Dean of Gloucester)", "response": ["His reputation rests on his philological learning, especially in early Teutonic languages. Franciscus Junius, his former teacher, moved to Oxford in 1676, and lived opposite Lincoln College, in order to be near him."]}, {"page": "Rolf Bremmer", "response": ["Bremmer has published and edited books on a variety of topics in Old English language and literature, Middle English language and literature, and Frisian language and literature. He has published on the seventeenth-century scholar and collector Franciscus Junius, he has translated the work on Beowulf by Dutch Anglo-Saxon scholar P. J. Cosijn, and has lectured on J.R.R. Tolkien. His Introduction to Old Frisian (2009) (a book for the beginning student), according to E.G. Stanley, is \"a book for the twenty-first century...a book of essentials, from which nothing essential has", "*Franciscus Junius F.F. and His Circle. Amsterdam and Atlanta: Rodopi, 1998."]}, {"page": "Franciscus Junius the Younger", "response": ["#REDIRECT Franciscus Junius (the younger)"]}, {"page": "Durham (poem)", "response": ["The poem is known from a copy in a late 12th-century manuscript, Cambridge, University Library, Ff. 1. 27, believed to have been compiled at Durham Cathedral Priory and now held by the Cambridge University Library. In 1705, George Hickes published a copy made by G. Nicolson from London, British Library, Cotton Vitellius D. xx, a 12th-century manuscript, which was lost in a 1731 house fire.Rollason 1998, pp. 278–79 A further transcription, discovered in 1992, was made in 1640 by Franciscus Junius the younger, possibly from an otherwise unknown manuscript. The poem is here accompanied by a Latin translation in the right-hand column. Some variation among these three versions exists.", "*De situ Dunelmi : manuscript poem – the copy by Franciscus Junius"]}, {"page": "The Old English Boethius", "response": ["* Oxford, Bodleian Library, Junius 12 (known as MS J). Produced around 1658–59 by Franciscus Junius. Amongst other things, it contains a transcription of MS B, with marginal variants from the prose passages of MS C, along with a transcription of the verses of MS C. It is now a primary, albeit not altogether reliable, witness to parts of C that have been lost to damage."]}, {"page": "Murbach hymns", "response": ["Later in the 17th century it was owned by Isaac Vossius. Franciscus Junius copied the text of the hymns from the ms. while it was in Vossius' possession. The ms. passed into possession of Junius at an unknown date, "]}, {"page": "Johannes Smetius", "response": ["During the 1620s, the excavation of tuff foundations around Nijmegen revealed many Roman era antiques. This abundance of Roman finds enabled Smetius to lay an important foundation for his archaeological collection, known thereafter as the Smetius Collection. The residents of Nijmegen knew of his interest in antique objects and offered him finds found during excavations and construction work. His collection grew to contain 10,000 Roman coins, thousands of which had been previously undocumented, and around 4,500 miscellaneous artifacts. Smetius opened his collection for public viewing, attracting many distinguished visitors such as Johannes Gronovius, Nicolaas Heinsius, Constantijn Huygen, Franciscus Junius, Johannes Pontanus, and Claudius Salmasius.Hendrik Brunsting (2003) Johannes Smetius als provinciaal-Romeins archeoloog  (= Museumstukken 1). Vereniging van Vrienden van het Museum Kam, Nijmegen 1989."]}, {"page": "Thomas Wood (sculptor)", "response": ["*Memorial to Franciscus Junius in St George's Chapel, Windsor (1680)"]}]}}