{"wiki_id": "http://www.wikidata.org/entity/Q2958851", "itemLabel": "Charles Davies Sherborn", "itemDescription": "British taxonomist", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Davies_Sherborn", "wikipedia_page": {"main": "Charles Davies Sherborn (30 June 1861 – 22 June 1942) was an English bibliographer, paleontologist and geologist. His magnum opus was the compilation of the Index Animalium, an 11-volume, 9,000-page work that catalogued the 444,000 names of every living and extinct animal discovered between 1758 and 1850. This work is considered the bibliographic foundation for zoological nomenclature. In addition, Sherborn authored almost 200 books, papers, and catalogs on a wide variety topics in natural history. He made important contributions to the study of microfossils and was a founding member and first president of the Society for the Bibliography of Natural History. In recognition of his endeavours he was awarded an Honorary Doctorate from Oxford University.\n\n", "link_mentions": [{"page": "Megalodon", "response": ["Swiss naturalist Louis Agassiz gave this shark its initial scientific name, Carcharodon megalodon, in his 1843 work Recherches sur les poissons fossiles, based on tooth remains. English paleontologist Edward Charlesworth in his 1837 paper used the name Carcharias megalodon, while citing Agassiz as the author, indicating that Agassiz described the species prior to 1843. English paleontologist Charles Davies Sherborn in 1928 listed an 1835 series of articles by Agassiz as the first scientific description of the shark. The specific name megalodon translates to \"big tooth\", from  and ὀδούς (odoús), \"tooth\". The teeth of megalodon are morphologically similar to those of the great white shark (Carcharodon carcharias), and on the basis of this observation, Agassiz assigned megalodon to the genus Carcharodon. Though \"megalodon\" is an informal name for the shark, it is also often informally dubbed the \"giant white shark\", the \"megatooth shark\", the \"big tooth shark\", or \"Meg\"."]}, {"page": "Sherborn", "response": ["* Charles Davies Sherborn (1861–1942), British bibliographer, paleontologist and geologist"]}, {"page": "AnimalBase", "response": ["Zoological names of generic and specific taxa that were established in early zoological publications have been entered manually into the database, including original and corrected spellings of names, type localities and page numbers where these names were originally established in the publications. Furthermore, the names have been compared to the entries in Charles Davies Sherborn's Index Animalium (1902, 1922–1933) and the Nomenclator Zoologicus by Neave (1939/1940, updated). The nomenclatural status of names has been verified under the current edition of the International Code of Zoological Nomenclature (ICZN). Possible discrepancies between older databases and the findings from AnimalBase name research (i.e. nomenclatural priority or incorrect spellings) have occasionally been discussed in the comments provided for each taxon. The entire process has followed the established AnimalBase standard."]}, {"page": "Society for the History of Natural History", "response": ["Originally named the Society for the Bibliography of Natural History, SHNH was founded in 1936 by a small group of distinguished scientists, librarians and bibliographers whose appreciation and love of books inspired the formation of the Society in London.  The Society's first President was Charles Davies Sherborn (1861–1942), who compiled the Index Animalium single-handedly over 43 years (1758–1850). This 11 volume, 9,000 page work, that catalogued 444,000 names of every living and extinct animal discovered between 1758 and 1850 is considered to be the bibliographic foundation for zoological nomenclature.", "* Charles Davies Sherborn 1936–1942"]}, {"page": "Charles Sherborn", "response": ["* Charles Davies Sherborn (1861–1942), English bibliographer, paleontologist and geologist"]}, {"page": "Index Animalium", "response": ["#REDIRECT Charles Davies Sherborn"]}, {"page": "William Devonshire Saull", "response": ["Saull's collections passed to the Metropolitan Institution, located in Cleveland Street, London, and managed by the trustees of his estate. They were never unpacked there, however. In the end the British Museum purchased around 200 objects, in 1863.Sharpe, p. 217; Google Books. The bulk of the collection was taken, questionably, by John Calvert.Charles Davies Sherborn, Where is the – collection? (1940), p. 29; Google Books."]}, {"page": "Derek Sherborn", "response": ["Fawns Manor in Bedfont ('in the unlikely depths of suburban Middlesex'), in the ownership of the Sherborns since the 15th century, was inherited by Sherborn's uncle, the taxonomist Charles Davies Sherborn on the death of his kinsman William Sherborn in 1912. When Charles Davies Sherborn died in 1942, the Manor came to Ronald Thorne Sherborn; the family took up residence in the restored house in 1950.Country Life, vol. 195, 2001, pg. 154 Sherborn lived there after his father's death until 1983, when, following several burglaries, he sold the manor to the British Airways Housing Association and moved to a seafront villa in Brighton. He died in 2004, having published his memoirs, An Inspector Recalls, the previous year. In his Spectator review of the book, Hugh Massingberd noted Sherborn to be 'one of the unsung heroes of conservation' in Britain, and observed that 'the so-called \"national heritage\" thus owes Sherborn an immeasurable debt' in light of his efforts."]}, {"page": "List of paleontologists", "response": ["* Charles Davies Sherborn (England, 1861-1942)"]}, {"page": "Charles William Sherborn", "response": ["*A History of the Family of Sherborn, written by Charles Davies Sherborn, who dedicated it to his father"]}, {"page": "C. D. Sherborn", "response": ["#redirectCharles Davies Sherborn"]}]}}