{"wiki_id": "http://www.wikidata.org/entity/Q2959647", "itemLabel": "Charles Lennox Richardson", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Lennox_Richardson", "wikipedia_page": {"main": "Charles Lennox Richardson (16 April 1834 – 14 September 1862) was an English merchant based in Shanghai who was killed in Japan during the Namamugi Incident. His middle name is spelled Lenox in census and family documents.", "link_mentions": [{"page": "April 16", "response": ["*1834 – Charles Lennox Richardson, English merchant (d. 1862)"]}, {"page": "Kagoshima", "response": ["Kagoshima was bombarded by the British Royal Navy in 1863 to punish the daimyō of Satsuma for the murder of Charles Lennox Richardson on the Tōkaidō highway the previous year and its refusal to pay an indemnity in compensation."]}, {"page": "September 14", "response": ["*  1862   – Charles Lennox Richardson, English-Chinese merchant (b. 1834)"]}, {"page": "1862", "response": ["* September 14 – Charles Lennox Richardson, English merchant murdered in Japan (b. 1834)"]}, {"page": "Tōgō Heihachirō", "response": ["Tōgō's first experience at war was during the Bombardment of Kagoshima in August 1863, in which Kagoshima was shelled by the Royal Navy to punish the Satsuma daimyō for the death of Charles Lennox Richardson on the Tōkaidō highway the previous year (the Namamugi Incident), and the Japanese refusal to pay an indemnity in compensation. Tōgō, who was aged 15 at the time, was part of a gun crew manning one of the cannons defending the port."]}, {"page": "Empire of Japan", "response": ["In March 1863, the Emperor issued the \"order to expel barbarians.\" Although the shogunate had no intention of enforcing the order, it nevertheless inspired attacks against the shogunate itself and against foreigners in Japan. The Namamugi Incident during 1862 led to the murder of an Englishman, Charles Lennox Richardson, by a party of samurai from Satsuma. The British demanded reparations but were denied. While attempting to exact payment, the Royal Navy was fired on from coastal batteries near the town of Kagoshima. They responded by bombarding the port of Kagoshima in 1863. The Tokugawa government agreed to pay an indemnity for Richardson's death. Shelling of foreign shipping in Shimonoseki and attacks against foreign property led to the bombardment of Shimonoseki by a multinational force in 1864.Hagiwara, p. 35. The Chōshū clan also launched the failed coup known as the Kinmon incident. The Satsuma-Chōshū alliance was established in 1866 to combine their efforts to overthrow the Tokugawa bakufu. In early 1867, Emperor Kōmei died of smallpox and was replaced by his son, Crown Prince Mutsuhito (Meiji)."]}, {"page": "Emperor Kōmei", "response": ["Emperor Kōmei was infuriated with nearly every development during his reign as Emperor, and during his lifetime he never saw any foreigners nor did he know much about them. Unequal trade treaties with the Western powers, such as the Treaty of Kanagawa and the Harris Treaty were signed without Imperial sanction and in spite of the Emperor's refusal to approve them. He twice expressed his will to resign from his position in protest. During his reign he started to gain more power as the Tokugawa shogunate declined, though this was limited to consultation and other forms of deference according to protocol. Emperor Kōmei generally agreed with anti-Western sentiments, and, breaking with centuries of imperial tradition, began to take an active role in matters of state. As opportunities arose, he fulminated against the treaties and attempted to interfere in the shogunal succession. His efforts culminated in 1863 with his \"Order to expel barbarians\". Although the Shogunate had no intention of enforcing the order, it nevertheless inspired attacks against the Shogunate itself and against foreigners in Japan: the most famous incident was the killing of British trader Charles Lennox Richardson, for which the Tokugawa government paid an indemnity of 100,000 pound sterling.Jansen, pp. 314–315 Other incidents included the bombardments of Shimonoseki and Kagoshima, and the destruction of Japanese warships, coastal guns, and assorted military infrastructure throughout the country. These incidents showed that Japan could not match the military might of the Westerner powers at the time, and that military confrontation could not prove to be a diplomatic solution.Keene (2002)"]}, {"page": "Sonnō jōi", "response": ["The philosophy was thus adopted as a battle cry of the rebellious regions of Chōshū Domain and Satsuma Province. The Imperial court in Kyoto sympathized with the movement. Emperor Kōmei personally agreed with such sentiments, and – breaking with centuries of imperial tradition – personally began to take an active role in matters of state: as opportunities arose, he fulminated against the treaties and attempted to interfere in the shogunal succession. His efforts culminated in March 1863 with his \"Order to Expel Barbarians\" (). Although the Shogunate had no intention of enforcing the order, it nevertheless inspired attacks against the Shogunate itself and against foreigners in Japan, the most notable incident being the killing of the trader Charles Lennox Richardson. Other attacks included the shelling of foreign shipping in Shimonoseki.Hagiwara, p. 35. Rōnins (masterless samurai) also rallied to the cause, assassinating Shogunate officials and Westerners."]}, {"page": "Boshin War", "response": ["Emperor Kōmei agreed with such sentiments and, breaking with centuries of imperial tradition, began to take an active role in matters of state: as opportunities arose, he vehemently protested against the treaties and attempted to interfere in the shogunal succession. His efforts culminated in March 1863 with his \"order to expel barbarians\". Although the shogunate had no intention of enforcing it, the order nevertheless inspired attacks against the shogunate itself and against foreigners in Japan: the most famous incident was that of the English trader Charles Lennox Richardson, for whose death the Tokugawa government had to pay an indemnity of one hundred thousand British pounds.Jansen, pp. 314–315. Other attacks included the shelling of foreign shipping in the port of Shimonoseki.Hagiwara, p. 35."]}, {"page": "Ernest Mason Satow", "response": ["Ernest Satow is probably best known as the author of the book A Diplomat in Japan (based mainly on his diaries) which describes the years 1862–1869 when Japan was changing from rule by the Tokugawa shogunate to the restoration of Imperial rule. He was recruited by the Foreign Office straight out of university in London. Within a week of his arrival by way of China as a young student interpreter in the British Japan Consular Service, at age 19, the Namamugi Incident (Namamugi Jiken), in which a British merchant was killed on the Tōkaidō, took place on 21 August 1862. Satow was on board one of the British ships which sailed to Kagoshima in August 1863 to obtain the compensation demanded from the Satsuma clan's daimyō, Shimazu Hisamitsu, for the slaying of Charles Lennox Richardson.  They were fired on by the Satsuma shore batteries and retaliated by bombarding Kagoshima."]}, {"page": "Gai-Jin", "response": ["*John Canterbury – based on the real-life Charles Lennox Richardson, murdered by Satsuma samurai"]}, {"page": "Namamugi Incident", "response": ["Charles Lennox Richardson, a British merchant, was killed by the armed retinue of Shimazu Hisamitsu, the regent of the Satsuma Domain, on a road in Namamugi near Kawasaki. Richardson's murder sparked outrage among Europeans for violating their extraterritoriality in Japan, while the Japanese argued Richardson had disrespected Shimazu and was justifiably killed under the Kiri-sute gomen rule. British demands for compensation and failure by the Satsuma to respond resulted in the Bombardment of Kagoshima (or Anglo-Satsuma War) in August 1863.", "On 14 September 1862, four British subjects – the Shanghai-based merchant Charles Lennox Richardson, two Yokohama-based merchants Woodthorpe Charles Clark and William Marshall, and Marshall's sister-in-law Margaret Watson Borradaile – were travelling on the Tōkaidō road in Japan en route to visit the Kawasaki Daishi temple near Kawasaki. Richardson had recently announced his retirement, and was visiting the temple with his friends en route back to England. The party had departed the treaty port of Yokohama at 2:30 pm by boat, crossing Yokohama harbour to Kanagawa village, to join their horses which had been sent ahead. They were travelling north through the nearby village of Namamugi (now part of Tsurumi Ward, Yokohama) when they encountered the large, armed retinue of Shimazu Hisamitsu, the regent and father of Shimazu Tadayoshi, the daimyō of the Satsuma Domain."]}, {"page": "Bombardment of Kagoshima", "response": ["On 14 September 1862, the Namamugi Incident occurred when a British merchant, Charles Lennox Richardson broke into Daimyo Procession, disregarding the warnings and eventually was killed by the armed retinue of Shimazu Hisamitsu, the father and regent of Shimazu Tadayoshi, the daimyō of the Satsuma Domain.  Reportedly, Richardson had failed to yield for Shimazu's entourage while travelling on a road near Kawasaki, Kanagawa, and was subsequently killed under Kiri-sute gomen – the right for samurai to kill people of lower class for perceived disrespect. Richardson's death sparked outrage from Europeans for violating the extraterritoriality they enjoyed under terms of the Unequal treaties. Lieutenant-Colonel Edward St. John Neale, the British Chargé d'Affaires, demanded from the Bakufu (the central government of the Tokugawa Shogunate) an apology and a indemnity of £100,000, representing roughly 1/3 of the total revenues of the Bakufu for one year.Totman, pp.68–69 Neale kept threatening a naval bombardment of Edo, the Tokugawa capital city, if the payment was not made.Totman, p. 71 Britain also demanded the Satsuma Domain arrest and put on trial the perpetrators of Richardson's death, and £25,000 compensation for the surviving victims and the relatives of Richardson. "]}, {"page": "Japan–United Kingdom relations", "response": ["*Charles Lennox Richardson - slain in the Namamugi Incident"]}, {"page": "William Willis (physician)", "response": ["Willis was born in Maguiresbridge, County Fermanagh, Ireland in 1837. In 1855 he was enrolled at the faculty of medicine in the University of Glasgow (Scotland), where he completed his pre-medical and pre-clinical studies. He then transferred to the University of Edinburgh. After his graduation in May 1859 with the thesis \"Theory of ulceration\"  he became a member of the Royal College of Surgeons of Edinburgh and received the degree of Doctor of Medicine of the University with a thesis on the \"Theory of Ulceration\". He then worked at the Middlesex Hospital in London. In 1861 he was accepted for a medical post with the British legation in Japan. He reached Edo in May 1862 to begin his duties as medical officer and clerk under Sir Harry Smith Parkes. Between 1862 and 1867 he worked mainly in Yokohama. Being there on the day of Charles Lennox Richardson's death at the hands of retainers of daimyō Shimazu Hisamitsu (otherwise Shimazu Saburō), Willis performed the autopsy.Respect and Consideration: Britain in Japan 1853-1868 and Beyond, John W. Denney, Radiance Press, 2011, pp. 116, 443"]}, {"page": "Charles Richardson", "response": ["*Charles Lennox Richardson (1834–1862), British merchant"]}, {"page": "Foreign cemeteries in Japan", "response": ["The Yokohama Foreign General Cemetery, located in Yamate Naka-ku, Yokohama, includes among many others the grave of Charles Lennox Richardson, murdered in the Namamugi Incident in September 1862, John Wilson, and that of Charles Wirgman, Ludovicus Stornebrink, and John Carey Hall. The French military advisors of the Boshin War, François Bouffier, Jean Marlin, and Auguste Pradier are also buried there."]}, {"page": "Kiri-sute gomen", "response": ["The Namamugi Incident (sometimes known as the \"Kanagawa incident\" or \"Richardson affair\") was a political crisis that followed the 1862 murder of British merchant Charles Lennox Richardson, who was killed by the armed retinue of Shimazu Hisamitsu, regent of the Satsuma Domain, on a road in Namamugi near Kawasaki. Europeans protested that the incident violated their extraterritoriality in Japan, while the Japanese argued Richardson had disrespected Shimazu and was justifiably killed under the kiri-sute gomen rule. British demands for compensation and failure by the Satsuma to respond resulted in the Bombardment of Kagoshima (or Anglo-Satsuma War) in August 1863.Denney, John. Respect and Consideration: Britain in Japan 1853–1868 and beyond. Radiance Press (2011). "]}, {"page": "Bunkyū", "response": ["* September 14, 1862 (Bunkyū 2, 21st day of the 8th month): Namamugi Incident. Satsuma retainers kill English merchant Charles Lennox Richardson at Namamugi on the Tōkaidō road."]}, {"page": "Order to expel barbarians", "response": ["The Shogunate had no intention of enforcing the order, and the Edict inspired attacks against the Shogunate itself as well as against foreigners in Japan. The most famous incident was the firing on foreign shipping in the Shimonoseki Strait off Chōshū Province as soon as the deadline was reached.Hagiwara, p. 35. Masterless samurai (rōnin) rallied to the cause, assassinating Shogunate officials and Westerners. The killing of the English trader Charles Lennox Richardson is sometimes considered as a result of this policy. The Tokugawa government was required to pay an indemnity of a hundred thousand British pounds for Richardson's death.Jansen, pp. 314–315.", "But this turned out to be the zenith of the sonnō jōi movement, since the Western powers responded to Japanese attacks on western shipping with the Bombardment of Shimonoseki. Heavy reparations had earlier been demanded from Satsuma for the murder of Charles Lennox Richardson – the Namamugi Incident. When these were not forthcoming, a squadron of Royal Navy vessels went to the Satsuma port of Kagoshima to coerce the daimyō into paying. Instead, he opened fire on the ships from his shore batteries, and the squadron retaliated.  This was later referred to, inaccurately, as the Bombardment of Kagoshima. These incidents clearly showed that Japan was no match for Western military might, and that brutal confrontation could not be the solution. "]}, {"page": "Timeline of Japanese history", "response": ["|1862 || 14 September || Namamugi Incident: Four British subjects were attacked by guards on the Tōkaidō for failing to pay proper respect to a daimyō. One, a merchant named Charles Lennox Richardson, was killed."]}, {"page": "Edward St. John Neale", "response": ["Following the murder of Charles Lennox Richardson in September 1862, Neale exercised great caution in his response to the Japanese authorities, earning the furious opprobrium of the Western community in Yokohama, who called for immediate retribution.  He was eventually vindicated by the British Government and appointed CB in 1863 for his coolness.Denney, p.415ff et al In March 1863, the Emperor of Japan issued the Order to expel barbarians, which led Neale to issue an ultimatum to the Japanese government, which was on the brink of starting a war with foreign powers in order to return to the isolation policy.New York Times, 19 May 1863 Neale was extremely vocal when the Bakufu, under pressure from the Emperor, was finally forced to issue a declaration promulgating the end of relations with foreigners. The order was forwarded to foreign legations by Ogasawara Zusho no Kami on 24 June 1863.\"The orders of the Tycoon, received from Kyoto, are to the effect that the ports are to be closed and the foreigners driven out, because the people of the country do not desire intercourse with foreign countries.\"|Missive of Ogasawara Dzusho no Kami, 24 June 1863. Quoted in A Diplomat in Japan, Ernest Satow, p75 Lieutenant-Colonel Neale, responded in very strong terms, equating the move with a declaration of war:"]}, {"page": "Charles Lenox Richardson", "response": ["#REDIRECT Charles Lennox Richardson "]}, {"page": "List of Westerners who visited Japan before 1868", "response": ["*Charles Lennox Richardson (1862, United Kingdom) A British merchant who was murdered by samurai in the Namamugi Incident which later led to the Bombardment of Kagoshima.\"The Anglo-Japanese War\". November 15, 1863, New York Times. "]}, {"page": "Segodon", "response": ["*Noam Katz as Charles Lennox Richardson"]}, {"page": "List of last words (19th century)", "response": [":— Charles Lennox Richardson, English merchant (14 September 1862), prior to death in the Namamugi Incident"]}]}}