{"wiki_id": "http://www.wikidata.org/entity/Q2966629", "itemLabel": "Christopher Newbury", "itemDescription": "British politician (born 1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Newbury", "wikipedia_page": {"main": "Christopher Newbury (born 1956) is a British Conservative politician. He was a member of the Congress of the Council of Europe from 1998 to 2010 and since 2009 has been a member of the new Wiltshire Council created that year.", "link_mentions": [{"page": "Guy Hands", "response": ["Hands was born in London, to South African parents, by way of Southern Rhodesia. He was educated at Holy Trinity School, Cookham, where he was diagnosed as severely dyslexic. Subsequently, he was sent to Ravenscroft Preparatory School, a special needs school, aged 9 and The Judd School, Tonbridge.Kennedy, Siobhan, Business big shot: Guy Hands dated 30 July 2007, online at timesonline.co.uk More recently, Hands contributed the funds for the construction of the Guy Hands Library at the Judd School.  In a Ravenscroft production of Macbeth in 1970, he played the part of Lady Macbeth opposite Christopher Newbury as Macbeth."]}, {"page": "Wiltshire County Council", "response": ["*Christopher Newbury 1997–2009 (also member of Council of Europe)"]}, {"page": "Elections in Palestine", "response": ["Local elections in 2005 were held in four stages, but were never completed. The last stage was on December 23, 2005, with elections in 26 municipalities that had over 140,000 registered voters in Jericho and 25 villages in the West Bank. The elections were observed by the Congress of the Council of Europe, with the head of mission, Christopher Newbury, commenting \"Inside the polling stations, the Congress observed a free and fair election. Outside them, further improvements remain to be made.\"Palestinian local elections: marked improvement over previous rounds but major challenges remain, say Congress observers, un.org, December 2005, accessed 23 May 2021"]}, {"page": "Imber", "response": ["The civil parish of Imber has been incorporated into the adjoining parish of Heytesbury. A parish council known as \"Heytesbury, Imber and Knook\" covers this parish and the neighbouring parish of Knook. Although it has no electors, Imber is represented in parliament by the member for South West Wiltshire, Andrew Murrison; and on Wiltshire Council by Christopher Newbury."]}, {"page": "Sherrington", "response": ["Boundary changes in 2010 created a new constituency of South West Wiltshire which incorporates the parish. Sherrington's current Member of Parliament is Andrew Murrison, while its representative in the Wiltshire Council unitary authority is Christopher Newbury. Both are Conservatives."]}, {"page": "Bishopstrow", "response": ["The parish is considered too small to support a parish council, so instead it has a parish meeting, a body in which all electors for the parish are voting members. Almost all local government functions are carried out by Wiltshire Council, a unitary authority created in 2009. The village is represented in parliament by Andrew Murrison, and in Wiltshire Council by Christopher Newbury, both Conservatives."]}, {"page": "Boyton, Wiltshire", "response": ["The village is represented in Parliament by the MP for South West Wiltshire, Andrew Murrison, and its representative in Wiltshire Council is Christopher Newbury."]}, {"page": "Upton Lovell", "response": ["Upton Lovell has its own parish council but almost all local government functions are carried out by Wiltshire Council, a unitary authority created in 2009, with its principal offices at County Hall in Trowbridge. The village is represented in parliament by Andrew Murrison and in Wiltshire Council by Christopher Newbury, both Conservatives."]}, {"page": "Ravenscroft School, Somerset", "response": ["* Christopher Newbury, Council of Europe"]}, {"page": "Wiltshire Victoria County History", "response": ["* Christopher Newbury (2002–2014)Wiltshire Victoria County History Committee as at 28 February 2002 from A History of the County of Wiltshire: Volume 17 (2002), pp. 14–15"]}, {"page": "Newbury (surname)", "response": ["* Christopher Newbury (born 1956), British politician"]}, {"page": "List of Old Greshamians", "response": ["*Christopher Newbury – Council of EuropeBiography at westwilts-communityweb.com (accessed 5 September 2007)"]}, {"page": "Norton Bavant", "response": ["Norton Bavant is considered to be too small to elect a parish council, and instead has a Parish Meeting, at which all electors for the parish are able to speak and vote. Local government services are provided by Wiltshire Council, which has its offices in Trowbridge. The village is represented in Parliament by the MP for South West Wiltshire, Andrew Murrison, and in Wiltshire Council by Christopher Newbury."]}, {"page": "Stockton, Wiltshire", "response": ["The village is represented in Parliament by the member of parliament for South West Wiltshire, Andrew Murrison, and in Wiltshire Council by Christopher Newbury."]}, {"page": "List of University of Oxford people in British public life", "response": ["| Christopher Newbury"]}, {"page": "Odd Arild Kvaløy", "response": ["For some years Kvaløy represented Norway in the Congress of Local and Regional Authorities of the Council of Europe. In 2005 he was rapporteur for a monitoring report on the situation of Local and Regional Democracy in the Netherlands, with Kathryn Smith,Local and Regional Democracy in Netherlands, Coe.int, 31 May – 2 June 2005 and in 2011 was rapporteur for a report on local and regional democracy in Serbia with Christopher Newbury."]}, {"page": "List of alumni of Keble College, Oxford", "response": ["* Christopher Newbury, politician, member of the Council of Europe"]}, {"page": "Newbury, Christopher", "response": ["#redirectChristopher Newbury"]}]}}