{"wiki_id": "http://www.wikidata.org/entity/Q2961011", "itemLabel": "Charlotte Rhead", "itemDescription": "British potter", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlotte_Rhead", "wikipedia_page": {"main": "Charlotte Rhead (19 October 1885 in Burslem – 6 November 1947) was an English ceramics designer active in the 1920s and the 1930s in the Potteries area of Staffordshire.\nCharlotte Rhead was born into an artistic family.  Her father Frederick Alfred Rhead began his career as an apprentice at Mintons where he learnt the art of pâte-sur-pâte ceramic decoration from Marc-Louis Solon.  Frederick A. Rhead went on to work at a number of potteries including a failed venture of his own. Charlotte's mother Adolphine (née Hurten) also came from an artistic family. Charlotte's elder brother, Frederick Hurten Rhead, became a well-known pottery designer in the USA.", "link_mentions": [{"page": "Stoke-on-Trent", "response": ["Other production centres in Britain, Europe and worldwide had a considerable lead in the production of high-quality wares. Methodical and highly detailed research and experimentation, carried out over many years, nurtured the development of artistic talent throughout the local community and raised the profile of Staffordshire Potteries. This was spearheaded by one man, Josiah Wedgwood, who cut the first sod for the canal in 1766 and erected his Etruria Works that year. Wedgwood built upon the successes of earlier local potters such as his mentor Thomas Whieldon and along with scientists and engineers, raised the pottery business to a new level. Josiah Spode introduced bone china at Trent in 1796, and Thomas Minton opened his manufactory. With the industry came a large number of notable 20th-century ceramic artists including Clarice Cliff, Susie Cooper, Charlotte Rhead, Frederick Hurten Rhead and Jabez Vodrey."]}, {"page": "Clarice Cliff", "response": ["* Charlotte Rhead"]}, {"page": "Susie Cooper", "response": ["At the age of 80 she retired to live on the Isle of Man, and died there in 1995. Like the Potteries-based ceramic designers Clarice Cliff and Charlotte Rhead, her work has become highly sought after and valued by some pottery collectors."]}, {"page": "Staffordshire University", "response": ["The on-campus en-suite accommodation is contained within Clarice Cliff Court, comprising seven halls, each of about 30 students over three floors, each hall named after female ceramicists: Rachel Bishop, Eve Midwinter, Jessie van Hallen, Charlotte Rhead, Jessie Tait, Millicent Taplin and Star Wedgwood. Along with the halls and en-suite, the university also offers 32 houses, known as the Leek Road Houses, each of which accommodates up to 6 people each. ", "**Charlotte Rhead, Ceramic artist"]}, {"page": "Keith Murray (ceramic artist)", "response": ["*Charlotte Rhead", "*Helen Cunningham, Clarice Cliff and Her Contemporaries: Susie Cooper, Keith Murray, Charlotte Rhead, and the Carlton Ware Designers, Schiffer (1999), "]}, {"page": "Frederick Hurten Rhead", "response": ["Rhead was born in Hanley, Staffordshire, into a family of potters. His father Frederick Alfred Rhead began his career as an apprentice at Mintons Ltd, where he learned to be a pâte-sur-pâte artist.  He went on to work in a number of other potteries, including a business of his own which failed.  Young Frederick's mother Adolphine (née Hurten) also came from an artistic family.  Frederick Hurten's siblings included Charlotte Rhead, a talented designer who remained in England; and Harry Rhead, who followed his brother to work in the United States."]}, {"page": "Burleigh Pottery", "response": ["The years between the wars are often regarded as the company's \"golden age\", with a number of extremely talented designers and artists such as Harold Bennett, Charles Wilkes and Ernest Baily. Perhaps the best known was Charlotte Rhead, who worked here between 1926 and 1931, noted particularly for her work in tubelining. By 1939, the factory was employing over 500 people."]}, {"page": "Tubelining", "response": ["*Charlotte Rhead"]}, {"page": "Jessie Tait", "response": ["Born in Stoke-on-Trent, Tait studied at the Burslem School of Art. She first worked as a junior designer to Charlotte Rhead, and then as designer for the Midwinter Pottery between 1946 and 1974. The Midwinter Pottery was taken over by J. & G. Meakin in 1968, and again by Wedgwood in 1970. Jessie Tait moved from Midwinter to Johnson Brothers, another part of the Wedgwood group, and retired in the early 1990s.", "Like other Potteries-based ceramic designers such as Clarice Cliff, Susie Cooper and Charlotte Rhead, her work has become highly sought after and valued by pottery collectors."]}, {"page": "Frederick Alfred Rhead", "response": ["Frederick Alfred Rhead (1856–1933) was a potter working in North Staffordshire, England.  He is not to be confused with his son Frederick Hurten Rhead (1880–1942) who was also a potter, and who worked mainly in the USA. His other children included the pottery designer Charlotte Rhead."]}, {"page": "Louis Rhead", "response": ["Louis and all his siblings attended their father's art classes and worked in the potteries as children. His brothers Frederick Alfred Rhead and George Woolliscroft Rhead Jr. (1855–1920) were also artistic, and Louis, later in his career, sometimes collaborated with them, for example in book-illustration projects.  Louis was also the uncle of the potters Charlotte Rhead and Frederick Hurten Rhead."]}, {"page": "Charlotte (given name)", "response": ["*Charlotte Rhead, ceramics artist"]}, {"page": "Rhead", "response": ["* Charlotte Rhead (1885–1947), English ceramics designer"]}, {"page": "Gordon Forsyth", "response": ["Forsyth was the tutor of a number of notable students at the Burslem School of Art including Susie Cooper,Andrew Casey, Elegance with Utility: The work of Susie Cooper (1902-1995) Glyn Colledge, Clarice Cliff, Charlotte Rhead, Arthur Berry, and Mabel Leigh. At that time, Forsyth was described as a \"pottery designer, educator and writer...and one of the main spokespersons on industrial pottery design.\"Jerry Palmer & Mo Dodson, Design and Aesthetics: a Reader, London: Routledge, 1995, p.210 And the pivotal role he played in British ceramic design has inspired some to call him \"the magus of the mid-twentieth century pottery industry.\"S. Beddoe, Potters and Paintresses: Women Designers in the Pottery Industry 1870–1955, Jnl Design History (1990) 3 (2-3): 197-198"]}, {"page": "List of people from Stoke-on-Trent", "response": ["*Charlotte Rhead (1885–1947), ceramics designer."]}, {"page": "Chell, Staffordshire", "response": ["*Charlotte Rhead (1885–1947), the famous pottery designer, lived in Chell during the 1930s, a contemporary of Susie Cooper and Clarice Cliff, their collected art deco inspired works are highly sought after."]}, {"page": "Truda Carter", "response": ["* Charlotte Rhead"]}, {"page": "Middleport Pottery", "response": ["Middleport Pottery had many pre-eminent designers over the years. Charlotte Rhead worked there from 1926-1931 producing her exquisite tube-lined designs, and David Copeland worked at the pottery in the 60s, bringing new modern designs while still using traditional copperplate engraving skills."]}, {"page": "Ceramic art", "response": ["Stoke-on-Trent's supremacy in pottery manufacture nurtured and attracted a large number of ceramic artists including Clarice Cliff, Susie Cooper, Lorna Bailey, Charlotte Rhead, Frederick Hurten Rhead and Jabez Vodrey."]}]}}