{"wiki_id": "http://www.wikidata.org/entity/Q296666", "itemLabel": "Glenn Hoddle", "itemDescription": "English footballer and manager (born 1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Glenn_Hoddle", "wikipedia_page": {"main": "Glenn Hoddle (born 27 October 1957) is an English former football player and manager. He currently works as a television pundit and commentator for ITV Sport and BT Sport.\nHe played as a midfielder for Tottenham Hotspur, Monaco, Chelsea and Swindon Town and at international level for England. In 2007, he was inducted into the National Football Museum Hall of Fame, which cited him as one of the most gifted and creative English footballers of his generation, exhibiting \"sublime balance and close control, unrivalled passing and vision and extraordinary shooting ability, both from open play and set pieces\". He was also known for his tactical intelligence and work-rate.He has been manager of Swindon Town (earning promotion to the Premier League), Chelsea (taking them to the FA Cup final), Southampton, Tottenham Hotspur (reaching a League Cup final) and Wolverhampton Wanderers. He managed England to the second round of the 1998 FIFA World Cup, where they lost to Argentina on penalties. He was dismissed from the England job in 1999 for a newspaper interview in which he was widely interpreted as saying that disabled people are affected by karma from past lives. He said that his words were \"misconstrued, misunderstood and misinterpreted\" and that disabled people had his \"overwhelming support, care, consideration and dedication\".", "link_mentions": [{"page": "Diego Maradona", "response": ["Maradona was famous for his cunning personality.\"El maestro Maradona: football legend to be Argentina manager\". The Guardian. Retrieved 19 May 2014 Some critics view his controversial \"Hand of God\" goal at the 1986 World Cup as a clever manoeuvre, with one of the opposition players, Glenn Hoddle, admitting that Maradona had disguised it by flicking his head at the same time as palming the ball.Geoff Tibballs (2003). \"Great Sporting Scandals\". p. 227. Robson, 2003 The goal itself has been viewed as an embodiment of the Buenos Aires shanty town Maradona was brought up in and its concept of viveza criolla—\"cunning of the criollos\".\"Maradona scores $1800-a-seat ticket sales, proving the bad boys of sport are hard to match\". Sydney Morning Herald. Retrieved 19 May 2014 Although critical of the illegitimate first goal, England striker Gary Lineker conceded, \"When Diego scored that second goal against us, I felt like applauding. It was impossible to score such a beautiful goal. He's the greatest player of all time, by a long way. A genuine phenomenon.\" Maradona used his hand in the 1990 World Cup, again without punishment, and this time on his own goal line, to prevent the Soviet Union from scoring.\"13 June 1990: Diego Maradona's other World Cup handball\". The Guardian. Retrieved 3 February 2015 A number of publications have referred to Maradona as the Artful Dodger, the urchin pickpocket from Charles Dickens' Oliver Twist.\"World Cup Legends #1: Diego Maradona\" . Esquire. Retrieved 3 February 2015\"Argentina coach Diego Maradona writes another chapter in a turbulent life\". The Telegraph. Retrieved 3 February 2015Taylor, Chris (9 November 2005). \"A Big Hand\". The Guardian. Retrieved 3 February 2015Jimmy Burns (2011). \"Maradona: The Hand of God\". p. 17. A&C Black"]}, {"page": "David Beckham", "response": ["Beckham had played in all of England's qualifying matches for the 1998 World Cup and was part of the England squad at the World Cup finals in France, but the team's manager Glenn Hoddle publicly accused him of not concentrating on the tournament, and he did not start in either of England's first two games. He was picked for the third game against Colombia and scored with a bending 30-yard free kick in a 2–0 victory, which was his first goal for England.\"England wins 2–0 to gain 2nd-round match with Argentina\". Sports Illustrated. Retrieved 25 May 2014 "]}, {"page": "England national football team", "response": ["===Graham Taylor, Terry Venables, Glenn Hoddle and Kevin Keegan===", "Venables' successor, Glenn Hoddle, took the team to the 1998 FIFA World Cup — in which England were eliminated in the second round, again by Argentina and again on penalties (after a 2–2 draw). In February 1999, Hoddle was sacked by the FA due to controversial comments he had made about disabled people to a newspaper. Howard Wilkinson took over as caretaker manager for two matches. Kevin Keegan was then appointed as the new permanent manager and took England to UEFA Euro 2000, but the team exited in the group stage and he unexpectedly resigned shortly afterwards."]}, {"page": "October 27", "response": ["*1957 – Glenn Hoddle, English footballer and manager"]}, {"page": "Dennis Bergkamp", "response": ["Born in Amsterdam, Bergkamp was the last of Wim and Tonnie Bergkamp's four sons. He was brought up in a working-class suburb, in a family aspiring to reach middle-class status. His father, an electrician and amateur footballer in the lower leagues, named him in honour of Scottish striker Denis Law.  To comply with Dutch given name customs, an extra \"n\" was inserted in Bergkamp's first name by his father after it was not accepted by the registrar. Bergkamp was raised as a Roman Catholic by his family and regularly attended church during his childhood.  Although in later years he said visits to church did not appeal to him, Bergkamp still maintains his faith. According to Bergkamp, his childhood footballing heroes were Glenn Hoddle, whom he admired for his soft precise touch, and Johan Cruyff, who once coached him when he was twelve."]}, {"page": "Osvaldo Ardiles", "response": ["A competitive and skilled midfielder, Ardiles became a cult hero in England, along with Glenn Hoddle and compatriot Ricardo Villa, as a player for Tottenham Hotspur. He left England for a period on loan as a result of the outbreak of the Falklands War in 1982, thus missing most of the 1982–83 English season."]}, {"page": "Alan Shearer", "response": ["The new England manager Glenn Hoddle appointed Shearer captain for the 1998 FIFA World Cup qualifier against Moldova on 1 September 1996, and the player held onto the captaincy after scoring once in that match and twice in the following game against Poland. He scored a total of five goals in England's successful qualification campaign for the World Cup, adding strikes against Georgia and away to Poland to his tally. Shearer was sidelined for much of the 1997–98 season, but recovered to play in the World Cup finals. With Michael Owen replacing Teddy Sheringham as Shearer's strike partner, Shearer's return saw him score England's first goal of the tournament, in a 2–0 win over Tunisia, his only goal in the three group matches. England faced long-time rivals Argentina in the second round. Shearer scored a first-half equaliser from the penalty-spot before David Beckham was sent off early in the second half. In the final minutes of the game Sol Campbell headed in what could have been the winning goal only for the referee to disallow it due to Shearer having elbowed goalkeeper Carlos Roa. The scores tied 2–2, the game went to penalties. Shearer scored again, but England were eliminated after David Batty's shot was saved by the Argentina goalkeeper. This defeat ended England's participation in what was to be Shearer's only World Cup tournament."]}, {"page": "Ruud Gullit", "response": ["In July 1995, Gullit signed for Chelsea on a free transfer. Initially played as sweeper by manager Glenn Hoddle with limited success, Gullit was moved to his more familiar role in midfield, where he scored six goals. The signing of Gullit, alongside the likes of Mark Hughes and Dan Petrescu, propelled Chelsea to the semi-final of the FA Cup but their league form was disappointing.", "In the summer of 1996, when Glenn Hoddle left Chelsea to become manager of the England national team, Gullit was appointed as a player-manager becoming the first Dutch manager in the Premier League. Gullit made a promising start to his managerial career when in the first season as a player-manager he guided Chelsea to an FA Cup triumph in 1997, the club's first major trophy in 26 years. In doing so he became the first manager from outside the British Isles and the first black manager to win a major British football trophy. The club also finished at a creditable sixth place in the Premiership.", "Gullit also appeared as a pundit for ITV during the 2006 World Cup and works as an analyst for Champions League games on Sky Sports and Al Jazeera Sports. During the 2010 FIFA World Cup, Gullit worked as a studio analyst alongside former players Jürgen Klinsmann and Steve McManaman for ESPN. He subsequently worked as an analyst for Al Jazeera Sports during Euro 2012 alongside Glenn Hoddle and Terry Venables, among others."]}, {"page": "Tottenham Hotspur F.C.", "response": ["Spurs went into a period of decline after the successes of the early 1970s, and Nicholson resigned after a poor start to the 1974–75 season.  The team was then relegated at the end of the 1976–77 season with Keith Burkinshaw as manager. Burkinshaw quickly returned the club to the top flight, building a team that included Glenn Hoddle, as well as two Argentinians, Osvaldo Ardiles and Ricardo Villa, which was unusual as players from outside the British Isles were rare at that time. The team that Burkinshaw rebuilt went on to win the FA Cup in 1981 and 1982 and the UEFA Cup in 1984.", "* 2001  Glenn Hoddle", "*  Glenn Hoddle"]}, {"page": "Swindon Town F.C.", "response": ["Swindon won the Fourth Division title in 1985–86 and secured a second successive promotion the following season under the stewardship of Lou Macari. They went on to claim victory in the 1990 Second Division play-off final, but were denied promotion into the top-flight after admitting to breaching Football League regulations. Glenn Hoddle coached the team to victory in the 1993 play-off final to finally secure a place in the top-flight for the first time in the club's history. However they were relegated out of the Premier League at the end of the 1993–94 season and dropped into the third tier with a second consecutive relegation. Promoted again as champions to avoid an FA expulsion and a hat-trick of relegations in 1995–96, they remained in the second tier for four seasons until relegation in 2000. They dropped into the fourth tier League Two in 2006 for the first time since 1986. Though managed to secure promotion the next season; they repeated this feat following relegation in 2011, winning the League Two title in 2011–12 to earn promotion to League One. After relegation back to League Two at the end of the 2016–17 season, they won their third League Two title in the 2019–20 season. However, amid financial and ownership issues, were immediately relegated the following season, returning to the fourth tier for a fifth time.", "Ardiles remained in charge until March 1991, when he departed for Newcastle United and was succeeded by new player-manager Glenn Hoddle. Swindon progressed well during the 1991–92 season, Hoddle's first full season as manager, and just missed out on the Second Division play-offs, having briefly led the table in the autumn. A year later they beat Leicester City 4–3 in the new Division One play-off final to achieve promotion to the Premier League — bringing top-division football to the club for the first time.", "* Glenn Hoddle 1991–1993 (player-manager) ", "*  Glenn Hoddle"]}, {"page": "Southampton F.C.", "response": ["During the 1999–2000 season, Dave Jones quit as Southampton manager to concentrate on a court case after he was accused of abusing children at the children's home where he had worked during the 1980s. The accusations were later proved to be groundless, but it was too late to save Jones' career as Southampton manager and he was succeeded by ex-England manager Glenn Hoddle. Hoddle helped keep Southampton well clear of the Premier League drop zone but having received an offer he moved to Tottenham Hotspur just before the end of the 2000–01 season. He was replaced by first-team coach Stuart Gray, who oversaw the relocation to the St Mary's Stadium for the 2001–02 season. At the end of the 2000–01 season, in the last competitive match at The Dell, Matthew Le Tissier came on late to score the last ever league goal at the old stadium with a half volley on the turn in a 3–2 win against Arsenal. Gray was sacked after a poor start to the following season, and he was replaced by ex-Coventry City manager Gordon Strachan, who steered Southampton to safety and a secure 11th-place finish."]}, {"page": "Tony Adams", "response": ["When England manager Glenn Hoddle took the captain's armband from Adams and gave it to Alan Shearer, it was a bitter pill for Adams to swallow. Speaking at a fans' forum in 2008, Adams remarked, \"I have some resentment over the way Glenn Hoddle gave the captaincy to Alan Shearer instead of me but I can let that go. I reacted positively. I disagreed with him [Hoddle] and he thought Alan could get more penalties being a centre forward. People know my reaction to that\"."]}, {"page": "Hayes, Hillingdon", "response": ["* England footballer Glenn Hoddle (1957-) was born in Hayes."]}, {"page": "Chris Waddle", "response": ["In 1987, Waddle recorded the song \"Diamond Lights\" in a duet with Spurs and England teammate Glenn Hoddle. The song reached number 12 in the UK Singles Chart in May of that year and the pair appeared on Top Of The Pops. Whilst at Marseille he joined teammate Basile Boli in recording a song entitled We've Got a Feeling."]}, {"page": "Rio Ferdinand", "response": ["At the age of 19 years and 8 days, Ferdinand earned his first full England cap as a substitute in a friendly against Cameroon on 15 November 1997, making him the youngest defender to play for England at the time (a record broken in 2006 by Micah Richards). Ferdinand would have made an even earlier debut in September had he not been charged with drink-driving in the build-up to England's 1998 World Cup qualifier against Moldova. Ferdinand was named in the squad for this game and was a likely starter; however, the public mourning for Princess Diana – whose chauffeur had been suspected of drink-driving – left Glenn Hoddle with little choice but to drop the teenager from the squad. After an impressive 1997–98 season he was selected for the 1998 FIFA World Cup squad as a back-up defender. However, he was not selected in Kevin Keegan's 22-man squad for UEFA Euro 2000.", "In September 1997, Ferdinand was convicted of drink-driving and given a one-year driving ban. He had been breathalysed after driving on the morning after a night out, and was found to be one point over the limit. As a result, England manager Glenn Hoddle dropped Ferdinand from the squad to face Moldova in a World Cup qualification match on 10 September, meaning Ferdinand lost out on the chance, at 18 years and 10 months of age, of becoming the youngest England international since Duncan Edwards."]}, {"page": "Ambidexterity", "response": ["In association football, being able to kick with either foot provides more options for both passing and scoring, as well as the ability to play on either side of the pitch. Therefore, players with the ability to use their weaker foot with proficiency are valuable in any team. Examples of ambidextrous footballers include Johan Cruyff, Obafemi Martins, Santi Cazorla, Adam Lallana, Adriano Correia, Pedro Rodriguez, Glenn Hoddle, Alfredo Di Stéfano, Sócrates, Paolo Maldini, George Best, Michael Laudrup, Pelé, Marc Overmars, Michel Platini, Roberto Baggio, Carlos Valderrama, Bobby Charlton, Zico, Tom Finney, John Barnes, John Charles, Ousmane Dembélé, Mason Greenwood, Ronaldo Nazário, Cristiano Ronaldo, Zidane, Wayne Rooney."]}, {"page": "Mick McCarthy", "response": ["On 21 July 2006, McCarthy was appointed manager at Championship side Wolverhampton Wanderers, replacing Glenn Hoddle who had resigned a fortnight earlier. He signed a 12-month rolling contract The team managed to make the promotion play-offs in his first season, where they lost out to local rivals West Bromwich Albion over two legs, losing 3–2 at Molineux and 1–0 at The Hawthorns."]}, {"page": "Michael Owen", "response": ["Owen was selected for the World Cup squad by manager Glenn Hoddle, becoming England's youngest ever player at a World Cup when he came on as a substitute in the opening match against Tunisia. In the following match, a 2–1 defeat to Romania, Owen again appeared as a substitute. His equalising goal made him England's youngest ever goalscorer in the tournament at the age of 18 years and 190 days. In stoppage time, he hit the post with a long range shot, almost salvaging a point from the game. Because of his impact against Romania, Hoddle selected Owen in the starting line-up for England's decisive group match against Colombia. England won the match and Owen retained his place for the second round match against Argentina."]}, {"page": "Wolverhampton Wanderers F.C.", "response": ["After former England manager Glenn Hoddle failed to bring a swift return to the Premier League, the rebuilding of the squad by Mick McCarthy rejuvenated the club with an unexpected play-off finish. The club was bought from Sir Jack Hayward by Steve Morgan in 2007 and two years later the team returned to the Premier League as 2008–09 Football League Championship title winners. Wolves successfully battled relegation for two seasons before McCarthy's dismissal in the 2011–12 season, which precipitated relegation under his former assistant Terry Connor, who was promoted to replace McCarthy.", "Wolves have also been managed by two former England national team managers in Graham Taylor and Glenn Hoddle."]}, {"page": "AS Monaco FC", "response": ["In 1986, former Ajax manager Ștefan Kovács, who succeeded Rinus Michels and honed his Total Football ideals with the Dutch champions, came out of a three-year \"retirement\" to manage Monaco, but even he could not bring them success. With the club facing a second barren spell, they signed Arsène Wenger, who had hitherto been relatively unknown, managing Nancy without much success. Wenger's reign saw the club enjoy one of its most successful periods, with several inspired signings, including George Weah, Glenn Hoddle, Jürgen Klinsmann, and Youri Djorkaeff. Youth team policies produced future World Cup winners Emmanuel Petit, Lilian Thuram and Thierry Henry. Under Wenger, they won the league in his first season in charge (1988) and the Coupe de France in 1991, with the club consistently competing in the latter stages of the European Cup and regularly challenging for the league title. The club could have had even greater success in this period, as it emerged in 1993 that bitter rivals Marseille had indulged in match fixing and numerous improprieties, a view that Wenger had long held. In 1994, after being blocked by the Monaco board from opening discussions with German powerhouse Bayern Munich for their vacant managerial post after being shortlisted for the role, Wenger was released from the club, several weeks after the post had already been filled.Arsène Wenger The Biography by Xavier Rivoire"]}, {"page": "2002–03 FA Premier League", "response": ["| Glenn Hoddle", "|Glenn Hoddle"]}, {"page": "2001–02 FA Premier League", "response": ["| Glenn Hoddle", "| Glenn Hoddle"]}, {"page": "David Seaman", "response": ["Seaman remained the first choice under the management of Glenn Hoddle for the 1998 FIFA World Cup in France. Seaman kept two clean sheets in the group stage as England finished second behind Romania. In the round of 16 England faced Argentina. Seaman conceded a penalty as the game finished 2–2, before England lost on penalties. Kevin Keegan selected him for UEFA Euro 2000, where he started against both Portugal and Germany but sustained an injury in his warm-up exercises for the third game against Romania and was replaced by Nigel Martyn. England lost the match and went out in the first round."]}, {"page": "2003–04 FA Premier League", "response": ["| Glenn Hoddle"]}, {"page": "Ian Wright", "response": ["Terry Venables replaced Taylor as manager after the unsuccessful 1994 World Cup qualifying campaign but Wright's appearances in the side became even more limited. Despite featuring in four of the first five matches under Venables, albeit three times as a substitute, Wright never played under his management again. Ultimately, it cost Wright a place in the squad for Euro 1996, where England reached the semi-finals as the host nation. Venables vacated his position as England manager after the tournament and was replaced by Glenn Hoddle."]}, {"page": "Emma Bunton", "response": ["Their performance was the most tweeted moment of Olympics closing ceremony with over 116,000 tweets on Twitter per minute. Bunton also worked with fellow Spice Girl Melanie C on her 2012 album, Stages for the album track \"I Know Him So Well\". The song was released as a single on 11 November 2012. In March 2013, Bunton was named the Foxy Bingo Celebrity Mum of the Year. In March 2014, Bunton, along with Melanie C, took part in recording England's 2014 World Cup song. She collaborated with fellow pop stars Eliza Doolittle, Katy B, Conor Maynard, Kimberley Walsh and Pixie Lott on \"Greatest Day\", a track originally performed by British band Take That. The track was produced by Gary Barlow and recorded at Sarm Studios in London. The track also featured past footballers such as Gary Lineker, Michael Owen, Geoff Hurst, David Seaman, Peter Shilton, Glenn Hoddle and Dion Dublin on backing vocals."]}]}}