{"wiki_id": "http://www.wikidata.org/entity/Q2966664", "itemLabel": "Christopher Wood", "itemDescription": "English painter (1901-1930)", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Wood_(painter)", "wikipedia_page": {"main": "John Christopher \"Kit\" Wood (7 April 1901 – 21 August 1930), was an English painter born in Knowsley, near Liverpool.", "link_mentions": [{"page": "Zebra", "response": ["Zebras have been popular subjects for abstract, modernist and surrealist artists. Such art includes Christopher Wood's Zebra and Parachute, Lucian Freud's The Painter's Room and Quince on a Blue Table and the various paintings of Mary Fedden and Sidney Nolan. Victor Vasarely  depicted zebras as mere bands of black and white and joined in a jigsaw puzzle fashion. Carel Weight's Escape of the Zebra from the Zoo during an Air Raid was based on a real life incident of a zebra escaping during the bombing of London Zoo and consists of four panels like a comic book. Zebras have lent themselves to products and advertisements, notably for 'Zebra Grate Polish' cleaning supplies by British manufacturer Reckitt and Sons and Japanese pen manufacturer Zebra Co., Ltd.."]}, {"page": "List of British artists", "response": ["* Christopher Wood (1901–1930)"]}, {"page": "Kit Wood", "response": ["#REDIRECT Christopher Wood (painter)"]}, {"page": "Winifred Nicholson", "response": ["* Jovan Nicholson (2013). Ben Nicholson, Winifred Nicholson, Christopher Wood, Alfred Wallis, William Staite Murray - Art and Life 1920 - 1931. London: Philip Wilson Publishers. ", "* Christopher Wood, Anne L. Goodchild (2013). Dear Winifred: Christopher Wood, letters to Winifred and Ben Nicholson, 1926-1930. Bristol: Sansom & Company. ."]}, {"page": "1901 in art", "response": ["* 7 April – Christopher Wood, English painter (suicide 1930)."]}, {"page": "Christopher Wood (artist)", "response": ["#REDIRECT Christopher Wood (painter)"]}, {"page": "1901 in the United Kingdom", "response": ["* 7 April – Christopher Wood, painter (suicide 1930)"]}, {"page": "1930 in the United Kingdom", "response": ["* 22 August – Christopher Wood, painter, suicide (born 1901)"]}, {"page": "List of people with surname Wood", "response": ["*Christopher Wood (disambiguation), several people", ":*Christopher Wood (art historian) (born 1961), professor at New York University", ":*Christopher Wood (biologist), professor of biology at McMaster University", ":*Christopher Wood (composer), Welsh composer", ":*Christopher Wood (cricketer, born 1934) (1934–2006), English cricketer", ":*Christopher Wood (financial analyst), managing director of the broking firm CLSA", ":*Christopher Wood (painter) \"Kit Wood\" (1901–1930), English painter", ":*Christopher Wood (socialite) (1900–1976), partner of Gerald Heard", ":*Christopher Wood (writer) (1935–2015), English screenwriter and novelist", ":*Christopher Wood, who killed his wife, children, and himself in 2009, followed by that of William Parente"]}, {"page": "Towner Gallery", "response": ["It boasts in excess of 5,000 works of art by historic, modern and contemporary artists including: Lawrence Alma-Tadema, John Gascoigne Lake, Vanessa Bell, David Bomberg, Alan Davie, Tacita Dean, Olafur Eliasson, Anya Gallaccio, Thomas Jones, Peter Liversidge, Henry Moore, Cedric Morris, William Nicholson, Julian Opie, Ian Potts, Victor Pasmore, Pablo Picasso, Eric Ravilious, Eric Slater, Wolfgang Tillmans, Alfred Wallis, Christopher Wood, Joseph Wright of Derby and Carol Wyatt."]}, {"page": "José Antonio Gandarillas", "response": ["* José Antonio \"Tony\" Gandarillas Huici (1885–1970), also a diplomat who married Juana Edwards Mac-Clure, a daughter of the President of the Senate of Chile Agustín Edwards Ross; a bisexual, he was also the partner of painter Christopher Wood."]}, {"page": "Christopher Wood (English painter)", "response": ["#REDIRECT Christopher Wood (painter)"]}, {"page": "Frank Coombs (artist)", "response": ["Coombs was responsible for the progressive turn of the Storran Gallery. Originally selling woodcuts and greeting cards, when Coombs joined the gallery in 1935 he organized his first show, a show that completely changed the future of the business. After that first show, Coombs, together with Eardley Knollys and Ala Story, exhibited works by Pavel Tchelitchew, Ivon Hitchens, Frances Hodgkins, Christopher Wood and Victor Pasmore. When Story sold her share to Knollys, Knollys and Coombs started to exhibit works by Pablo Picasso, Amedeo Modigliani, Maurice Utrillo, Glyn Philpot (Philpot painted Coombs' portrait), Claude Monet, Pierre-Auguste Renoir, Paul Gauguin, Maurice de Vlaminck, André Derain and Amedeo Modigliani. Under Coombs' and Knollys' direction, the Storran Gallery became one of the most notable galleries of its time promoting Modernist art."]}, {"page": "Gwyneth Johnstone", "response": ["Gwyneth Johnstone was born on 18 June 1915 in the Norfolk village of Coltishall; she always concealed her actual birth date. Johnstone was the illegitimate daughter of the musician Nora Brownsford and the artist Augustus John. Her mother gave her daughter the allusive surname of Johnstone from a tutor at Alderney and raised her with a distance relationship with her father in Norwich and London. Johnstone was resented by her half-sisters and was ridiculed by society for being an illegitimate child. She was educated at the Saint Felix School in Southwold, where she saw the paintings of Christopher Wood and other modernists of the era, which were purchased by Lucy Mary Silcox, the school's headteacher."]}, {"page": "Lucy Mary Silcox", "response": ["She was able to bring leading thinkers and artists to the school and money was found to buy sculpture and paintings. The modernist paintings she bought inspired pupils like the artist Gwyneth Johnstone who remembered seeing work by Christopher Wood. She directed the girls in ancient Greek plays and she was a role model for demanding change. She was President of the local National Union of Women's Suffrage Societies and she gave talks in surrounding villages in support of women gaining the vote."]}, {"page": "Christopher Wood", "response": ["Christopher Wood may refer to:", "*Christopher Wood (socialite) (1900–1976), partner of Gerald Heard", "*Christopher Wood (painter) (1901–1930), English painter", "*Christopher Wood (cricketer, born 1934) (1934–2006), English cricketer", "*Christopher Wood (writer) (1935–2015), English screenwriter and novelist", "*Christopher Wood (art historian) (born 1961), professor at New York University", "*Christopher Wood (composer), Welsh composer", "*Christopher Wood (biologist), professor of biology at McMaster University", "*Christopher Wood (financial analyst), managing director of the broking firm CLSA", "*Christopher Wood, who killed his wife, children, and himself in April 2009, around the time of the William Parente familicide"]}]}}