{"wiki_id": "http://www.wikidata.org/entity/Q29642631", "itemLabel": "Alan Emery", "itemDescription": "medical geneticist (born 1928)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Emery", "wikipedia_page": {"main": "Alan Eglin Heathcote Emery  (born 1928) is a British medical geneticist, known for his study of muscular dystrophy.\nEmery began his working life in the King's Hussars, and graduated in biological sciences from University of Manchester. In 1960 he obtained his medical degree there.His PhD in human genetics was earned at Johns Hopkins University.In 1968 he became a foundation professor of human genetics at the University of Edinburgh.Having established the European Neuromuscular Centre, he was its chief scientific advisor from 1999.He was the first president of the Royal Society of Medicine’s Section of Medical Genetics, which he established, from 2001 to 2004.He was a research fellow and subsequently an honorary fellow of Green Templeton College from 1985.He was elected a Fellow of the Royal College of Physicians (FRCP), Fellow of the Royal College of Physicians of Edinburgh (FRCPE), a Fellow of the American College of Medical Genetics (FACMG), a Fellow of the Linnean Society (FLS), a Fellow of the Royal Society of Arts (FRSA) and a Fellow of the Royal Society of Edinburgh (FRSE).Both Emery–Dreifuss muscular dystrophy and its defective protein product, emerin, are named after him (the former jointly with Fritz E. Dreifuss)).", "link_mentions": [{"page": "University of Chester", "response": ["* Alan Emery, geneticist (CertEd, 1945–1947)"]}, {"page": "List of geneticists", "response": ["*Alan Emery (born 1928), British neuromuscular geneticist, Emery–Dreifuss muscular dystrophy"]}, {"page": "Not in Our Genes", "response": ["Not in Our Genes received positive reviews from the biologist Peter Medawar in Nature, the geneticist Alan Emery in Trends in Neurosciences, and T. Benton in The Sociological Review, the biologist Franz M. Wuketits in the Journal of Social and Biological Structures, and a mixed review from the anthropologist Vernon Reynolds in Ethnic and Racial Studies. The book was also reviewed by Howard L. Kaye in Society."]}, {"page": "Emerin", "response": ["It is named after Alan Emery."]}, {"page": "Template talk:Post-nominals/Archive 1", "response": ["On Alan Emery, the markup: "]}, {"page": "Alan Eglin H. Emery", "response": ["#REDIRECT Alan Emery"]}]}}