{"wiki_id": "http://www.wikidata.org/entity/Q2964697", "itemLabel": "Chris Dean", "itemDescription": "English rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Dean", "wikipedia_page": {"main": "Christopher David Dean (born 17 January 1988) is an English former professional rugby league footballer who played as a centre, second-row forward or on the wing in the 2000s and 2010s.\nHe played for St Helens in the Super League, and on loan from St. Helens at the Widnes Vikings in the Championship. Dean also played for the Wakefield Trinity Wildcats in the top flight, as well as Widnes in the top flight and the second tier.", "link_mentions": [{"page": "Edinburgh Rugby", "response": ["During his tenure, several Edinburgh players have made their international debuts for Scotland, including props Simon Berghan, Darryl Marfo and Murray McCallum, lock Lewis Carmichael, wing Darcy Graham, full-back Blair Kinghorn, hooker David Cherry, flankers Luke Hamilton and Jamie Ritchie, and former Edinburgh players Phil Burleigh, Cornell du Preez and George Turner, flanker Luke Crosbie, centres Chris Dean and James Johnstone, and scrum-halves Nathan Fowles, Sean Kennedy and Charlie Shiel were named in Scotland squads. ", "*  Chris Dean"]}, {"page": "2009 St Helens RLFC season", "response": ["|Chris Dean"]}, {"page": "2010 St Helens RLFC season", "response": ["St Helens offset the loss of Jason Cayless, Lee Gilmour and Sean Long with the signings of prop forward Nick Fozzard (returning to the club after a year at Hull Kingston Rovers), centre Iosia Soliola from Sydney Roosters and hooker Scott Moore returning from loan spells at Castleford Tigers in 2008 and Huddersfield Giants in 2009. The club also promoted youngsters Jack Bradbury, a centre, and stand-off Lee Gaskell. Matty Smith and Steve Tyrer are again let out on loan, this time both players leaving for Salford City Reds for the season, whilst Chris Dean was \"dual-registered\" with Widnes Vikings. St Helens saw no coaching change despite finishing trophy-less for the first time in 4 years and some fans calling for the sacking of head coach Mick Potter. The club's pre-season went well, defeating Widnes and Halifax convincingly before the Under 21s fell to a 44-0 loss to Keighley Cougars.", "|Chris Dean || Widnes Vikings (dual registration) || December 2009"]}, {"page": "2010 Widnes Vikings season", "response": ["|Chris Dean||St. Helens||Dual Registration||Full Season|| December 2009", "Saints followed up with tries from Gary Wheeler and dual registered Chris Dean.", "| NRC Pool One || Gateshead || 50-6 || Won || H || 2,200 || 2 February || Thackeray (4), Ford (11,16,27,48), Pickersgill (19), Gardner (22), Dean (33,68), Grady (34), Allen (76) || Yates 1/5, Grady 2/6 || N/A || James Ford, Scott Yates, Chris Dean, Shane Grady, Mat Gardner, Anthony Thackeray, James Webster, Steve Pickersgill, Mark Smith, Jim Gannon, Lee Doran, Dave Allen, Chris Gerrard || Thomas Coyle, Ben Kavanagh, Matt Strong, Dave Houghton ||-", "|Chris Dean || 17/1/88 || 1 || 2 || 0 || 0 || 8 "]}, {"page": "2011 St Helens RLFC season", "response": ["|Chris Dean || Wakefield Trinity Wildcats || December 2010", "St Helens produced their most dominant game of the season, with a resounding 9-try-to-1 win over Wakefield. The game started off in tight fashion, with Saints' pressure being cancelled out by some rugged if plucky Wildcats defence. However, the deadlock was broken on 17 minutes, with Paul Wellens' long ball finding the in-form Jamie Foster out wide who crossed and scored a goal. Jonny Lomax jinked his way through before Jon Wilkin found a gaping hole in the Wakefield defence to set up Foster, who cantered over for his second, and the floodgates were well and truly open. Michael Shenton crossed before half time, before Chris Dean, a former Saints player sped 60 meters on an intercept to give Wakefield a glimmer of hope. However, Ade Gardner went over 7 minutes later, and tries from Gary Wheeler, Wellens, Tony Puletua and Tom Makinson completed the rout."]}, {"page": "2012 Widnes Vikings season", "response": ["The Vikings signed New Zealand winger Patrick Ah Van from the Bradford Bulls on a two-year deal. Other new signings include Frank Winterstein on a 2-year deal from Crusaders, also his teammate Lloyd White joins Widnes on a 3-year deal. Wakefield Trinity Wildcats centre Chris Dean was announced on a 2-year deal while Wigan Warriors prop Ben Davies also signs for 2 years. Widnes have also promoted youngsters Jack Owens, Danny Craven and Tom Gilmore to full-time contracts with the Vikings.", "March did not start well for the Vikings as they lost 36–0 to Hull Kingston Rovers. However the week after the Vikings recorded their first win of the season and what a shock it was, trailing 36–18 with 30 minutes to go Widnes came back and beat Wigan Warriors 37–36 with Paddy Flynn, Stefan Marsh, Shaun Briscoe (2), Lloyd White and Frank Winterstein all scoring tries, on loan Gareth O'Brien kicked all 6 goals and White finished the scoring with a drop-goal. This victory was short lived after Hull F.C. dominated the Vikings the very next week, the game finished 58–10 in Hull's favour and Widnes got over through Fylnn twice, O'Brien added a goal. The Vikings recorded their 2nd win of the season by beating London Broncos 38–30 with White scoring 2 tries, Chris Dean, Rhys Hanbury, Ben Davies and Cameron Phelps all scoring and O'Brien added 7 goals. Widnes were losers in France when Catalans Dragons beat them 76–6 with Sione Kite scoring for the Vikings and O'Brien converting.", "Widnes started the Easter period with a 46–12 loss to local rivals Warrington Wolves, Chris Dean and David Allen both crossed for the Vikings with Patrick Ah Van converting both. The Vikings were outplayed by the Bradford Bulls and lost 38–4 with Rhys Hanbury crossing for their sole try. Widnes bowed out of the Challenge Cup but not before giving St Helens R.F.C. a massive scare by coming from 40–16 to just lose 40–38. Ah Van scored 2 tries and Lloyd White also crossed for 2, Kurt Haggerty, Hanbury and Hep Cahill also scored for the Vikings. Ah Van kicked 5 goals from 7 attempts. Wigan Warriors youngster Joe Mellor joined the Vikings on a months loan whilst hooker Scott Moore is sacked by Widnes and was snapped up by Huddersfield Giants. Widnes lost to St Helens R.F.C. for the 2nd time in 2 weeks but this time didn't get anywhere close to the Saints as they lost 62–0.", "Widnes kicked off May with the announcement that Anthony Watts signed a 1-year extension keeping him at the Vikings until the end of 2013 also prop/second rower Anthony Mullally rejects a contract extension. Meanwhile, Paddy Flynn signs a 2-year extension with the Vikings keeping him at the Stobart Stadium until the end of 2014. Widnes lost yet another game, this time they lost 36–12 to fellow strugglers Castleford Tigers, Flynn and Stefan Marsh both scored tries and Rhys Hanbury kicked 2 goals. Widnes lost a close game 42–34 to Catalans Dragons, Marsh, Joe Mellor, Hanbury, Chris Dean, David Allen and Patrick Ah Van all scored tries whilst Hanbury kicked 5 goals. Widnes announce that Huddersfield Giants captain Kevin Brown will be playing for them in 2013. Leeds Rhinos hooker Paul McShane signs with the Vikings on a months loan.", "Widnes announce the immediate signing of Hull F.C. prop Eamon O'Carroll on a 2 and a half-year deal. The Vikings had their best victory of the season when they beat Castleford Tigers 40–10. Stefan Marsh, Frank Winterstein, Ben Davies, Paul McShane, Joe Mellor, Eamon O'Carroll and Patrick Ah Van all scored a try each whilst Ah Van kicked 5 goals and Rhys Hanbury also kicked a goal. Widnes pushed St. Helens very close but due to a last minute try the Vikings lost 24–23. Ah Van scored a hat-trick whilst Chris Dean and Cameron Phelps also crossed. Hanbury kicked 1 goal and slotted a drop goal. Widnes recorded their 5th win of the season against Salford City Reds winning 46–8, Phelps, Ah Van and Hanbury all scored 2 tries each whilst McShane and Danny Craven scored a try. Hanbury kicked 7 goals. Widnes wrapped up July with a 32–26 loss to Hull Kingston Rovers, tries came from Joe Mellor, Stefan Marsh, Kurt Haggerty, Danny Craven and Rhys Hanbury. Hanbury also kicked 3 goals.", "| Chris Dean", "|3|| Chris Dean ||align=center|x||align=center|x||align=center|B", "|3|| Chris Dean ||align=center|W||align=center|C||align=center|x||align=center|x||align=center|x||align=center|x||align=center|x||align=center|C||align=center|C||align=center|C||align=center|C||align=center|x||align=center|C||align=center|C||align=center|C||align=center|C||align=center|C||align=center|C||align=center|C||align=center|C||align=center|C||align=center|C||align=center|C||align=center|C||align=center|x||align=center|x||align=center|C", "|3|| Chris Dean ||align=center|C", "|Chris Dean"]}, {"page": "Super League XIX", "response": ["|Chris Dean  || Widnes Vikings "]}, {"page": "List of Widnes Vikings players", "response": ["* Chris Dean 2012–Present"]}, {"page": "2015 Widnes Vikings season", "response": ["|14|| Chris Dean ||B ||C ||C ||C ||C ||12px ||SR ||C ||12px ||SR ||SR ||C ||C ||C ||12px ||12px ||12px ||C ||C ||C ||C ||C ||C ||C ||C ||C ||C ||C ||C ||C", "|14|| Chris Dean ||B ||C ", "|Chris Dean"]}, {"page": "2016 Widnes Vikings season", "response": ["|7/2/16|| Super League XXI || 1 ||Wakefield Trinity || A || Belle Vue Stadium || W || 24-16 || Sa (2), Hanbury, White || Hanbury 4/4 || N/A || 5,240 || Rhys Hanbury, Corey Thompson, Chris Bridge, Charly Runciman, Patrick Ah Van, Kevin Brown (C), Joe Mellor, Eamon O'Carroll, Lloyd White, Gil Dudson, Setaimata Sa, Connor Farrell, Hep Cahill || Chris Dean, Manase Manuokafoa, Chris Houston, Aaron Heremaia ||-", "|14/2/16|| Super League XXI || 2 || Leeds || H || Halton Stadium || W || 56-12 || Marsh (2), Sa, Thompson (3), White, Runciman, Mellor, Farrell || Hanbury 7/9, Sa 1/1 || N/A || 6,596 || Rhys Hanbury, Corey Thompson, Chris Bridge, Charly Runciman, Stefan Marsh, Kevin Brown (C), Joe Mellor, Eamon O'Carroll, Lloyd White, Gil Dudson, Setaimata Sa, Connor Farrell, Chris Houston || Chris Dean, Aaron Heremaia, Manase Manuokafoa, Hep Cahill ||-", "|28/2/16|| Super League XXI || 3 || Huddersfield || A || Galpharm Stadium || W || 36-18 || Dean, Marsh (2), Runciman, Leuluai, Thompson (2) || Hanbury 4/7 || N/A || 5,183 || Rhys Hanbury, Corey Thompson, Chris Bridge, Charly Runciman, Stefan Marsh, Joe Mellor, Kevin Brown (C), Eamon O'Carroll, Lloyd White, Gil Dudson, Chris Dean, Chris Houston, Hep Cahill || Matt Whitley, Manase Manuokafoa, Macgraff Leuluai, Aaron Heremaia ||-", "|4/3/16|| Super League XXI || 4 || Hull Kingston Rovers || H || Halton Stadium || W || 30-16 || Hanbury, Mellor (2), Thompson (2) || Hanbury 5/5 || N/A || 5,013 || Rhys Hanbury, Corey Thompson, Chris Bridge, Charly Runciman, Stefan Marsh, Kevin Brown (C), Joe Mellor, Eamon O'Carroll, Lloyd White, Gil Dudson, Chris Dean, Chris Houston, Hep Cahill || Connor Farrell, Macgraff Leuluai, Manase Manuokafoa, Matt Whitley ||-", "|10/3/16|| Super League XXI || 5 || Hull F.C. || H || Halton Stadium || W || 46-6 || Mellor, Thompson (2), Marsh (3), Hanbury, Brown, Whitley || Hanbury 5/9 || N/A || 4,735 || Rhys Hanbury, Corey Thompson, Chris Bridge, Charly Runciman, Stefan Marsh, Kevin Brown (C), Joe Mellor, Eamon O'Carroll, Lloyd White, Manase Manuokafoa, Chris Dean, Chris Houston, Hep Cahill || Macgraff Leuluai, Alex Gerrard, Matt Whitley, Aaron Heremaia ||-", "|17/3/16|| Super League XXI || 6 || Wigan || A || DW Stadium || W || 18-12 || Whitley, Marsh, Runciman || Hanbury 3/3 || N/A || 11,773 || Rhys Hanbury, Corey Thompson, Chris Dean, Charly Runciman, Stefan Marsh, Joe Mellor, Kevin Brown (C), Eamon O'Carroll, Aaron Heremaia, Gil Dudson, Setaimata Sa, Chris Houston, Hep Cahill || Manase Manuokafoa, Macgraff Leuluai, Alex Gerrard, Matt Whitley ||-", "|25/3/16|| Super League XXI || 7 || Warrington || A || Halliwell Jones Stadium || L || 10-28 || Gilmore, Hanbury || Hanbury 1/2 || N/A || 15,008 || Rhys Hanbury, Corey Thompson, Chris Dean, Stefan Marsh, Patrick Ah Van, Joe Mellor (C), Tom Gilmore, Eamon O'Carroll, Lloyd White, Gil Dudson, Setaimata Sa, Chris Houston, Macgraff Leuluai || Manase Manuokafoa, Alex Gerrard, Aaron Heremaia, Matt Whitley ||-", "|28/3/16|| Super League XXI || 8 || St. Helens || H || Halton Stadium || L || 12-20 || Hanbury (2) || Hanbury 2/2 || N/A || 9,076 || Rhys Hanbury, Corey Thompson, Chris Dean, Ed Chamberlain, Patrick Ah Van, Joe Mellor (C), Tom Gilmore, Eamon O'Carroll, Aaron Heremaia, Gil Dudson, Setaimata Sa, Chris Houston, Hep Cahill || Manase Manoukafoa, Alex Gerrard, Macgraff Leuluai, Matt Whitley ||-", "|2/4/16|| Super League XXI || 9 || Catalans Dragons || A || Stade Gilbert Brutus || L || 8-21 || Thompson || Hanbury 2/2 || N/A || 8,642 || Rhys Hanbury, Corey Thompson, Chris Dean, Charly Runciman, Patrick Ah Van, Joe Mellor (C), Tom Gilmore, Eamon O'Carroll, Aaron Heremaia, Gil Dudson, Matt Whitley, Chris Houston, Macgraff Leuluai || Manase Manuokafoa, Ed Chamberlain, Sam Brooks, Jordan Johnstone ||-", "|10/4/16|| Super League XXI || 10 || Castleford || H || Halton Stadium || L || 24-34 || Ah Van, Leuluai, Thompson, White || Bridge 4/4 || N/A || 5,081 || Rhys Hanbury, Corey Thompson, Chris Bridge, Chris Dean, Patrick Ah Van, Kevin Brown (C), Joe Mellor, Eamon O'Carroll, Aaron Heremaia, Gil Dudson, Setaimata, Chris Houston, Macgraff Leuluai || Lloyd White, Alex Gerrard, Matt Whitley, Sam Brooks ||-", "|22/4/16|| Super League XXI || 12 || Warrington || H || Halton Stadium || L || 16-48 || Mellor, Thompson, Marsh || Hanbury 2/3 || N/A || 7,441 || Rhys Hanbury, Corey Thompson, Chris Bridge, Charly Runciman, Stefan Marsh, Joe Mellor, Kevin Brown (C), Eamon O'Carroll, Lloyd White, Gil Dudson, Chris Dean, Chris Houston, Hep Cahill || Aaron Heremaia, Manase Manuokafoa, Setaimata Sa, Macgraff Leuluai ||-", "|29/4/16|| Super League XXI || 13 || Wakefield Trinity || H || Halton Stadium || L || 16-18 || Runciman, O'Carroll. Hanbury || Hanbury 2/3 || N/A || 4,398 || Rhys Hanbury, Corey Thompson, Patrick Ah Van, Charly Runciman, Stefan Marsh, Joe Mellor, Aaron Heremaia, Gil Dudson, Lloyd White, Eamon O'Carroll, Chris Dean, Chris Houston, Hep Cahill || Manase Manuokafoa, Setaimata Sa, Macgraff Leuluai, Matt Whitley ||-", "|15/5/16 || Super League XXI || 14 || Hull KR || A || Craven Park || L || 24-10 || Dudson, Thompson || Hanbury 1/2 || N/A || 7,506 || Rhys Hanbury, Corey Thompson, Charly Runciman, Chris Dean, Ed Chamberlain, Joe Mellor, Aaron Heremaia, Eamon O'Carroll, Lloyd White, Gil Dudson, Chris Houston, Matt Whitley, Hep Cahill || Jordan Johnstone, Manase Manuokafoa, Setaimata Sa, Macgraff Leuluai ||-", "|21/5/16 || Super League XXI || 15 || Salford || N || St James' Park || L || 18-12 || Hanbury, Bridge || Hanbury 2/3 || N/A || 39,331 || Rhys Hanbury, Corey Thompson, Charly Runciman, Chris Bridge, Stefan Marsh, Joe Mellor, Kevin Brown, Eamon O'Carroll, Lloyd White, Gil Dudson, Chris Houston, Chris Dean, Hep Cahill || Aaron Heremaia, Manase Manuokafoa, Matt Whitley, Macgraff Leuluai ||-", "|29/5/16 || Super League XXI || 16 || Huddersfield || H || Halton Stadium || W || 24-20 || Thompson (2), Mellor (2), Marsh || Hanbury 2/5 || N/A || 4,683 || Rhys Hanbury, Corey Thompson, Chris Bridge, Charly Runciman, Stefan Marsh, Joe Mellor, Kevin Brown, Gil Dudson, Lloyd White, Hep Cahill, Chris Dean, Chris Houston, Macgraff Leuluai || Setaimata Sa, Jack Buchanan, Manase Manuokafoa, Matt Whitley ||-", "|3/6/16 || Super League XXI || 17 || Hull F.C. || A || KC Stadium || L || 30-10 || Hanbury (9), Dean || Hanbury 1/2 || N/A || 10,259 || Rhys Hanbury, Corey Thompson, Charly Runciman, Chris Bridge, Stefan Marsh, Joe Mellor, Kevin Brown, Hep Cahill, Lloyd White, Gil Dudson, Chris Houston, Chris Dean, Macgraff Leuluai || Jack Buchanan, Manase Manuokafoa, Setaimata Sa, Matt Whitley ||-", "|9/6/16 || Super League XXI || 18 || Castleford || A || The Jungle || W || 28-38 || Leuluai, Ah Van (2), Bridge, White (2), Mellor || Hanbury 5/7 || N/A || 4,968 || Rhys Hanbury, Corey Thompson, Charly Runciman, Chris Bridge, Patrick Ah Van, Kevin Brown, Joe Mellor, Hep Cahill, Lloyd White, Jack Buchanan, Matt Whitley, Chris Dean, Macgraff Leuluai || Jay Chapelhow, Manase Manuokafoa, Brad Walker, Aaron Heremaia ||-", "|16/6/16 || Super League XXI || 19 || Wigan || H || Halton Stadium || L || 0-7 || N/A || N/A || N/A || 6,219 || Rhys Hanbury, Corey Thompson, Charly Runciman, Chris Bridge, Patrick Ah Van, Joe Mellor, Kevin Brown, Hep Cahill, Lloyd White, Jack Buchanan, Matt Whitley, Chris Dean, Macgraff Leuluai || Jay Chapelhow (Not Used), Manase Manuokafoa, Gil Dudson, Aaron Heremaia ||-", "|3/7/16 || Super League XXI || 20 || Leeds || A || Headingley || W || 22-23 || Thompson, Mellor, Ah Van, Hanbury || Hanbury 3/4 || Mellor || 16,130 || Rhys Hanbury, Corey Thompson, Charly Runciman, Stefan Marsh, Patrick Ah Van, Joe Mellor, Kevin Brown, Hep Cahill, Lloyd White, Jack Buchanan, Chris Houston, Chris Dean, Macgraff Leuluai || Gil Dudson, Aaron Heremaia, Manase Manuokafoa, Matt Whitley ||-", "|8/7/16 || Super League XXI || 21 || St Helens || A || Langtree Park || L || 12-10 || Thompson, Ah Van || Hanbury 1/2 || N/A || 11,566 || Rhys Hanbury, Corey Thompson, Charly Runciman, Stefan Marsh, Patrick Ah Van, Joe Mellor, Kevin Brown, Hep Cahill, Lloyd White, Jack Buchanan, Chris Houston, Chris Dean, Macgraff Leuluai || Gil Dudson, Manase Manuokafoa, Matt Whitley, Greg Burke ||-", "|15/7/16 || Super League XXI || 22 || Salford || H || Halton Stadium || L || 24-32 || Whitley (2), Ah Van, Thompson ||White 3/3, Thompson 1/1 || N/A || 4,636 || Rhys Hanbury, Corey Thompson, Charly Runciman, Stefan Marsh, Patrick Ah Van, Joe Mellor, Kevin Brown, Greg Burke, Lloyd White, Jack Buchanan, Matt Whitley, Chris Dean, Chris Houston || Hep Cahill, Aaron Heremaia, Manase Manuokafoa, Connor Farrell ||-", "|24/7/16 || Super League XXI || 23 || Catalans Dragons || H || Halton Stadium || W || 32-4 || Thompson, Ah Van, Mellor, Heremaia, Marsh || Thompson 3/5, Marsh 3/3 || N/A || 4,195 || Corey Thompson, Stefan Marsh, Charly Runciman, Chris Dean, Patrick Ah Van, Joe Mellor, Kevin Brown, Greg Burke, Lloyd White, Jack Buchanan, Matt Whitley, Chris Houston, Hep Cahill || Macgraff Leuluai, Aaron Heremaia, Manase Manuokafoa, Connor Farrell ||-", "|6/8/16|| Super League XXI || S1 || Catalans Dragons || A || Stade Gilbert Brutus || L || 26-10 || Whitley, Ah Van || White 1/2 || N/A || 8,562 || Rhys Hanbury, Corey Thompson, Charly Runciman, Stefan Marsh, Patrick Ah Van, Kevin Brown, Joe Mellor, Greg Burke, Lloyd White, Jack Buchanan, Chris Dean, Chris Houston, Hep Cahill || Manase Manuokafoa, Macgraff Leuluai, Matt Whitley, Aaron Heremaia ||-", "|21/8/16|| Super League XXI || S3 || Wakefield Trinity || H || Halton Stadium || W || 40-8 || Ah Van (2), Hanbury, Whitley, Thompson, Marsh, White || White 5/7, Thompson 1/1 || N/A || 4,010 || Rhys Hanbury, Corey Thompson, Chris Dean, Stefan Marsh, Patrick Ah Van, Joe Mellor, Kevin Brown, Jack Buchanan, Lloyd White, Greg Burke, Chris Houston, Matt Whitley, Hep Cahill || Gil Dudson, Aaron Heremaia, Jay Chapelhow, Connor Farrell ||-", "|1/9/16|| Super League XXI || S4 || Wigan || A || DW Stadium || W || 6-8 || Thompson (2) || White 0/2 || N/A || 11,495 || Rhys Hanbury, Corey Thompson, Chris Dean, Charly Runciman, Stefan Marsh, Joe Mellor, Kevin Brown, Jack Buchanan, Lloyd White, Greg Burke, Chris Houston, Matt Whitley, Hep Cahill || Gil Dudson, Aaron Heremaia, Jay Chapelhow, Connor Farrell ||-", "|9/9/16|| Super League XXI || S5 || Warrington || A || Halliwell Jones Stadium || L || 30-12 || Mellor, Thompson || Thompson 1/1, White 1/1 || N/A || 10,488 || Rhys Hanbury, Corey Thompson, Chris Dean, Charly Runciman, Patrick Ah Van, Joe Mellor, Kevin Brown, Greg Burke, Lloyd White, Jack Buchanan, Matt Whitley, Chris Houston, Hep Cahill || Jay Chapelhow, Gil Dudson, Aaron Heremaia, Connor Farrell ||-", "|18/9/16|| Super League XXI || S6 || St Helens || H || Halton Stadium || L || 8-21 || Ah Van, Thompson || White 0/1, Thompson 0/1 || N/A || 6,128 || Rhys Hanbury, Corey Thompson, Chris Dean, Charly Runciman, Patrick Ah Van, Joe Mellor, Kevin Brown, Greg Burke, Lloyd White, Jack Buchanan, Matt Whitley, Chris Houston, Macgraff Leuluai || Jay Chapelhow, Manase Manuokafoa, Aaron Heremaia, Connor Farrell ||-", "|25/9/16|| Super League XXI || S7 || Castleford || A || The Jungle || L || 40-26 || Farrell (2), Thompson (2), Ah Van || White 3/5 || N/A || 7,103|| Rhys Hanbury, Corey Thompson, Chris Dean, Charly Runciman, Patrick Ah Van, Joe Mellor, Tom Gilmore, Jay Chapelhow, Lloyd White, Gil Dudson, Matt Whitley, Connor Farrell, Hep Cahill || Ted Chapelhow, Macgraff Leuluai, Aaron Heremaia, Manase Manuokafoa ||-", "|8/5/16 || 2016 Challenge Cup || 5 || Halifax || A || The Shay || W || 18-28 || Heremaia, White, Houston, Runciman, Chapelhow || Hanbury 4/5 || N/A || 2,032 || Rhys Hanbury, Corey Thompson, Charly Runciman, Chris Dean, Ed Chamberlain, Joe Mellor, Aaron Heremaia, Hep Cahill, Lloyd White, Gil Dudson, Chris Houston, Setaimata Sa, Macgraff Leuluai || Manase Manuokafoa, Matt Whitley, Jay Chapelhow, Jordan Johnstone ||-", "|24/6/16 || 2016 Challenge Cup || Quarter Finals || Warrington || A || Halliwell Jones Stadium || L || 20-18 || Mellor, Whitley, Runciman || Hanbury 3/3 || N/A || 7,773 || Rhys Hanbury, Corey Thompson, Charly Runciman, Chris Bridge, Patrick Ah Van, Joe Mellor, Kevin Brown, Hep Cahill, Lloyd White, Jack Buchanan, Chris Houston, Chris Dean, Macgraff Leuluai || Manase Manuokafoa, Gil Dudson, Matt Whitley, Aaron Heremaia ||-", "|14|| Chris Dean ||B ||B ||12px ||SR ||SR ||SR ||C ||C ||C ||C ||C ||SR ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x", "|14|| Chris Dean ||SR ||x ||x ||x ", "|Chris Dean"]}, {"page": "2008 Widnes Vikings season", "response": ["|8/6/08|| National League One|| Halifax R.L.F.C. || H || L || 30-40 || Hardman (2), Dean (2), Paterson || Fletcher 5/6 || N/A || 3,971 || Scott Yates, Dean Gaskell, Ian Hardman, Chris Dean, Gavin Dodd, Lee Paterson, John Duffy, Iain Morrison, Mark Smith, Adel Fellous, Richard Fletcher, Paul Noone, Bob Beswick || Steve Roper, Jim Gannon, Danny Hill, Ben Kavanagh ||", "|19/6/08|| National League One|| Salford City Reds  || H || W || 20-18 || Tyrer (2), Crookes || Fletcher 2/2, Tyrer 2/2 || N/A || 8,149 || Ian Hardman, Dean Gaskell, Steve Tyrer, Chris Dean, Gavin Dodd, John Duffy, Matty Smith, Iain Morrison, Bob Beswick, Jim Gannon, Richard Fletcher, Paul Noone, Lee Paterson || Steve Roper, Adel Fellous, Jason Crookes, Ben Kavanagh ||", "|26/6/08|| National League One|| Celtic Crusaders || A || L || 38-6 || Gannon || Tyrer 1/1 || N/A || 3,595 || Ian Hardman, Dean Gaskell, Steve Tyrer, Chris Dean, Gavin Dodd, John Duffy, Matty Smith, Iain Morrison, Bob Beswick, Jim Gannon, Richard Fletcher, Paul Noone, Lee Paterson || Steve Roper, Danny Hill, Jason Crookes, Ben Kavanagh ||", "|11/7/08|| National League One|| Batley Bulldogs  || H || W || 34-22 || Duffy, Beswick, Paterson, Tyrer, Kavanagh, Dean || Tyrer 4/5, Fletcher 1/1 || N/A || 4,079 || Ian Hardman, Dean Gaskell, Steve Tyrer, Chris Dean, Paddy Flynn, John Duffy, Matty Smith, Iain Morrison, Bob Beswick, Jim Gannon, Richard Fletcher, Ben Kavanagh, Lee Paterson || Steve Roper, Adel Fellous, Gavin Dodd, Paul Noone ||", "|20/7/08|| National League One|| Halifax R.L.F.C. || A || D || 26-26 || Flynn, Matty Smith, Strong, Noone || Tyrer 5/5 || N/A || 2,561 || Ian Hardman, Dean Gaskell, Steve Tyrer, Chris Dean, Paddy Flynn, John Duffy, Matty Smith, Adel Fellous, Bob Beswick, Jim Gannon, Matt Strong, Paul Noone, Lee Paterson || Steve Roper, Iain Morrison, Gavin Dodd, Ben Kavanagh ||", "|27/7/08|| National League One|| Dewsbury Rams  || H || W || 40-0 || Gaskell, Morrison, Fletcher, Tyrer, Flynn, Gannon, Dodd || Tyrer 6/7 || N/A || 4,082 || Ian Hardman, Dean Gaskell, Steve Tyrer, Chris Dean, Paddy Flynn, John Duffy, Matty Smith, Iain Morrison, Bob Beswick, Jim Gannon, Matt Strong, Paul Noone, Lee Paterson || Gavin Dodd, Richard Fletcher, Gareth Morton, Michael Ostick ||", "|3/8/08|| National League One|| Leigh Centurions || A || L || 33-24 || Gaskell, Fletcher, Tyrer, Matty Smith || Tyrer 4/5 || N/A || 3,089 || Ian Hardman, Dean Gaskell, Steve Tyrer, Chris Dean, Gavin Dodd, John Duffy, Matty Smith, Iain Morrison, Bob Beswick, Jim Gannon, Matt Strong, Paul Noone, Lee Paterson || Josh Simm, Richard Fletcher, Gareth Morton, Sam Barlow ||", "|14/8/08|| National League One|| Sheffield Eagles  || A || W || 20-26 || Mark Smith, Gaskell, Tyrer, Dean || Tyrer 5/5 || N/A || 1,823 || Ian Hardman, Dean Gaskell, Steve Tyrer, Chris Dean, Gavin Dodd, John Duffy, Matty Smith, Iain Morrison, Mark Smith, Jim Gannon, Lee Paterson, Richard Fletcher, Bob Beswick || Tim Hartley, Sam Barlow, Gareth Morton, Michael Ostick ||", "|24/8/08|| National League One|| Whitehaven R.L.F.C. || A || L || 20-16 || Dodd, Gaskell, Morton || Tyrer 2/3 || N/A || 2,104 || Ian Hardman, Dean Gaskell, Steve Tyrer, Chris Dean, Gavin Dodd, John Duffy, Matty Smith, Iain Morrison, Mark Smith, Jim Gannon, Lee Paterson, Richard Fletcher, Bob Beswick || Tim Hartley, Martin McLoughlin, Gareth Morton, Michael Ostick ||", "|4/9/08|| National League One - Elimination Play-Offs|| Halifax R.L.F.C. || A || L || 32-16 || Dodd (2), Tyrer || Tyrer 2/3 || N/A || 1,931 || Ian Hardman, Dean Gaskell, Steve Tyrer, Tim Hartley, Gavin Dodd, John Duffy, Matty Smith, Iain Morrison, Mark Smith, Jim Gannon, Chris Dean, Richard Fletcher, Bob Beswick || Paul Noone, Martin McLoughlin, Gareth Morton, Adel Fellous ||", "|Chris Dean || 17/1/88 || 10 || 4 || 0 || 0 || 16 "]}]}}