{"wiki_id": "http://www.wikidata.org/entity/Q296635", "itemLabel": "Jonathan Woodgate", "itemDescription": "English footballer and manager (born 1980)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Woodgate", "wikipedia_page": {"main": "Jonathan Simon Woodgate (born 22 January 1980) is an English football manager and former player. He was most recently the manager of AFC Bournemouth.\nWoodgate started his career at Leeds United. He was sold to Newcastle United for £9 million in 2003, where he impressed despite injury problems. His performances in Europe for Newcastle led to Real Madrid signing him for £13.4 million in 2004. Injuries blighted his time in Madrid and he failed to make a single appearance in the entire 2004–05 season. On his debut for Real Madrid, he scored an own goal and was sent off for two bookable offences.\nHe went on to play 14 times for them before joining his hometown club Middlesbrough on loan, then permanently for a fee of £7 million. He joined Tottenham Hotspur for £8 million in 2008. He scored the winning goal for Spurs in the League Cup Final against Chelsea and went on to play 44 times in the 2008–09 season. After more injury problems, he only made four appearances in the next two seasons and was released in 2011 and signed a pay-as-you-play deal with Stoke City. He spent the 2011–12 season at Stoke and after his contract expired re-signed for Middlesbrough, remaining there until his retirement in 2016.\nFollowing retirement, Woodgate took up various coaching roles at Middlesbrough until June 2019 when he was appointed manager of the club, following the departure of Tony Pulis. He remained in the role for just over a year before he was dismissed in June 2020. He joined the coaching staff at AFC Bournemouth on 1 February 2021 before being appointed as caretaker manager two days later, following the sacking of Jason Tindall. On 21 February, he was given the role until the end of the season, but left in June after failing to lead the club back to the Premier League via the playoffs.", "link_mentions": [{"page": "January 22", "response": ["*1980 – Jonathan Woodgate, English footballer"]}, {"page": "Middlesbrough F.C.", "response": ["Pulis was replaced by former Middlesbrough defender and first team coach, Jonathan Woodgate on 14 June 2019 on a three-year contract. From March to June 2020 the 2019–20 season was suspended due to the COVID-19 pandemic. After a run of only one win in 12 games, which saw the team drop as low as 21st in the table, Woodgate was sacked on 23 June 2020, after a 3–0 defeat to Swansea City on the first game after the restart. Former Cardiff manager Neil Warnock was appointed as his replacement on the same day, who ensured survival from relegation with a 17th-place finish.", "|2007|| Jonathan Woodgate", "| 2019–2020 || Jonathan Woodgate"]}, {"page": "AFC Bournemouth", "response": ["On 8 August, Jason Tindall, a former Bournemouth player and Howe's longtime assistant, was appointed as manager. Nathan Aké also left the club, signing for Manchester City for a reported club-record £41 million fee. Despite sitting second in mid-December, Tindall was sacked on 3 February 2021 after a run of only 1 win in 8 games, which saw the team fall to 6th in the table. He was replaced by first team coach Jonathan Woodgate, initially as caretaker. The club finished the season in 6th and entered the playoffs, but lost 3–2 to Brentford on aggregate in the semi-final. On 28 June, former Fulham manager Scott Parker was appointed as manager ahead of the new season.", "*  Jonathan Woodgate "]}, {"page": "Neil Warnock", "response": ["On 23 June 2020, Warnock was appointed manager of Championship club Middlesbrough, with the club only outside the Championship relegation zone on goal difference after 38 games. He replaced Jonathan Woodgate who was sacked from his first job in management after less than a year in charge. In his first game in charge, on 27 June, Middlesbrough beat Stoke City 2–0 to climb to 19th in the league. Having been 21st in the table when Warnock took over, they finished 17th in the league. Although initially on a short-term contract, Warnock confirmed that he would continue as manager for the 2020–21 season."]}, {"page": "Gareth Southgate", "response": ["Upon his appointment, Southgate was tasked with rebuilding a side that had sold several players at the end of the previous league campaign, including key players such as Jimmy Floyd Hasselbaink and Doriva. His first signing as a manager came on 12 July, when Herold Goulon signed from Lyon for an undisclosed fee. He brought in four defensive additions to the squad, with Julio Arca arriving from local rivals Sunderland, Robert Huth from Chelsea and Jason Euell from Charlton Athletic on permanent deals, whereas Jonathan Woodgate joined on a season-long loan from Real Madrid. After playing eleven games in their pre-season campaign, Southgate's managerial reign kicked off on 19 August 2006, the first day of the Premier League season, where his side lost 3–2 away at Reading. Despite a disappointing start, they redeemed themselves when hosting reigning champions Chelsea at the Riverside Stadium, the game ending in a 2–1 victory.", "Middlesbrough were very active during both transfer windows, with Jonathan Woodgate being the first signing during the summer, arriving from Real Madrid for a £7 million transfer fee; Woodgate had previously played for the club during the previous league campaign on loan. The club went on to break their personal transfer record, for the first time since 2002, when Afonso Alves arrived from Heerenveen for €20 million."]}, {"page": "Robbie Keane", "response": ["After announcing his retirement from playing, Keane began his coaching career with the Ireland senior team as assistant manager under Mick McCarthy's management setup in November 2018. He also took on the role of assistant manager at Championship club Middlesbrough in 2019, with his former teammate Jonathan Woodgate as manager. Keane signed a 1-year contract with Middlesbrough, which came to an end during the COVID pandemic and left the club on his own terms in June 2020. During both jobs Keane studied for his UEFA Pro Licence He received the license in 2020.", "In June 2019, he accepted the dual roles of assistant manager of Middlesbrough in the Championship and the Republic of Ireland national team. His former teammate Jonathan Woodgate, who had been appointed the manager of the Teesside-based club, offered him the role as part of a refurbished coaching team. On 23 June 2020, Keane left his role as assistant manager after his one-year contract came to an end during the COVID pandemic."]}, {"page": "FA Youth Cup", "response": ["| Jonathan Woodgate"]}, {"page": "Eddie Gray (footballer, born 1948)", "response": ["Gray continued his long standing association with Leeds United by joining the club as a Youth Team coach. His work with the youth set-up nurtured a terrific generation of Leeds players such as Harry Kewell, Ian Harte, Alan Smith and Jonathan Woodgate, who all went on to become first-team regulars. In 1997, Gray was promoted to Reserve Team Manager and the following year was made new manager David O'Leary's assistant."]}, {"page": "2002–03 in English football", "response": ["*31 January 2003 – January draws to a close with Arsenal still top of the Premier League, two points above second placed Manchester United and within a game in hand. Newcastle United, Chelsea and Everton complete the top five. Liverpool's decline continues as they occupy eighth place, deepening fears that a side looking all set for title glory three months ago might now not even qualify for the UEFA Cup. Meanwhile, West Bromwich Albion's dismal form continues as they and West Ham United prop up the rest of the top flight on goal difference. Sunderland occupy the last relegation place. Middlesbrough boost their bid for a UEFA Cup place by spending a total of £8.5million on new signings Chris Riggott, Malcolm Christie and Michael Ricketts. The true extent of Leeds United's financial difficulties becomes public knowledge during a press conference to announce the sale of Jonathan Woodgate to Newcastle United for £9million, during which Terry Venables states that he had been assured players wouldn't need to be sold. Portsmouth and Leicester City remain in pole position at the top of Division One, and apart from Coventry City edging Reading out of the playoff zone the top six of the division is unchanged from last month.", "*Jonathan Woodgate from Leeds United to Newcastle United, £9m"]}, {"page": "2004–05 in English football", "response": ["*20 August 2004 – Newcastle United sell Jonathan Woodgate to Real Madrid for £13.4 million."]}, {"page": "Sol Campbell", "response": ["After injuries to Ledley King, Jonathan Woodgate and Michael Dawson, along with Jamie Carragher retiring from international football, Campbell was recalled to the national team. He played four matches under McClaren as England's qualification campaign failed."]}, {"page": "Terry Venables", "response": ["Leeds were further weakened in January 2003, when Jonathan Woodgate was sold to Newcastle United without Venables being informed, in an attempt to pay off mounting debts. Venables threatened to leave if Woodgate was sold, but was persuaded to stay by Peter Ridsdale. With the club spiralling towards relegation, and amid later substantiated rumours of further player sales by the board Venables was sacked in March 2003."]}, {"page": "August 2004 in sports", "response": ["* English football player Jonathan Woodgate makes a surprise move from Newcastle United to Spanish side Real Madrid, for a transfer fee of £15 million. Woodgate is the second English footballer in the space of a week to sign for Real, following Michael Owen's transfer from Liverpool. They join fellow Englishman David Beckham, who has been a player at the club for a year."]}, {"page": "Graeme Souness", "response": ["In the report of the Stevens inquiry into football corruption published in June 2007, Souness was criticised for an apparent lack of consistency:Souness issued a statement denying any wrongdoing:The Stevens inquiry then issued a clarification:In July 2007, Newcastle United was raided by the City of London Police, who were investigating transfer deals involving Newcastle, Rangers and Portsmouth. Two Souness transfers, Jean-Alain Boumsong and Amdy Faye, were among a list of 17 transfers not cleared by Quest. The Boumsong deal in particular was so odd that it was widely commented upon at the time. Four months after succeeding Sir Bobby Robson as manager, Souness was in his first transfer window as Newcastle manager. At £8.2 million, Boumsong was his first big signing and Souness said he would replace Jonathan Woodgate in the Newcastle defence, which had conceded several leads earlier in the season. "]}, {"page": "Association football culture", "response": ["There have been incidents in England of players being accused of violence and misconduct off the pitch. Although on many occasions, players have been found not guilty, such cases are highly controversial. In 2001, two Leeds United players, Jonathan Woodgate and Lee Bowyer, appeared in court over the assault of a student outside a nightclub. Woodgate was found guilty of affray. In 2002, three players (two from Chelsea, John Terry and Jody Morris; and one from Wimbledon, Des Byrne) appeared in court on charges of affray. All were acquitted. On 20 May 2008, Joey Barton was sentenced to six months in jail after pleading guilty for his part in an assault in December 2007. Barton was captured on CCTV punching a man 20 times."]}, {"page": "Harry Redknapp", "response": ["On 8 February 2021, Redknapp returned to Bournemouth to assist caretaker manager Jonathan Woodgate."]}, {"page": "Peter Crouch", "response": ["On 31 August 2011, Stoke City signed Crouch from Tottenham for a then club record fee of £10 million, that would rise to £12 million, on a four-year contract. Speaking after sealing his move to the Britannia Stadium, Crouch revealed that his former Tottenham teammate Jonathan Woodgate was a major influence upon his decision to join Stoke. Crouch made his debut for Stoke City in a 1–0 win against former club Liverpool on 10 September 2011. He scored his first goal for the Potters in a 1–1 draw against Manchester United, making Stoke the sixth Premier League club he has scored for. He scored his second goal in the following match against Beşiktaş in the 2011–12 UEFA Europa League campaign. Crouch went on to score against Arsenal, Maccabi Tel Aviv, Blackburn Rovers and Wolverhampton Wanderers before missing out on the Christmas period matches after suffering from a virus."]}, {"page": "Petr Čech", "response": ["Chelsea suffered their first major blow when they lost the League Cup final to Tottenham Hotspur, with Čech parrying the ball onto Jonathan Woodgate's head for the winner. He played in several games until injuring his ankle in training on the eve of Chelsea's home Champions League tie with Greek champions Olympiacos. In the weeks that followed, Čech missed key games of Chelsea's campaign, including the derby with Arsenal and both legs of the Champions League quarter-final."]}, {"page": "Tony Pulis", "response": ["In the Europa League, Stoke were drawn against Croatian giants Hajduk Split, where Stoke won both legs 1–0 to become the first Stoke side to win a two-legged European tie. Pulis signed former England internationals Jonathan Woodgate and Matthew Upson on free transfers to strengthen his centre backs following the departure of Abdoulaye Faye. He took charge of his 800th competitive match in August 2011. On transfer deadline day, Pulis signed Cameron Jerome from Birmingham City as well as Tottenham Hotspur duo Peter Crouch and Wilson Palacios; Crouch, at a fee of £10 million, broke the club's transfer record for the fourth successive season. In the group stages of the Europa League, Stoke were drawn against Beşiktaş, Dynamo Kyiv and Maccabi Tel Aviv, and after a 1–1 draw against Kyiv in December, Stoke qualified for the knock-out stages. Pulis described the achievement as a \"milestone\" in the club's history. Stoke were handed a glamour tie against Spanish giants Valencia in the round of 32. He reached 400 matches as Stoke manager in January 2012. Stoke lost both legs against Valencia 1–0 and exited the Europa League. In the second leg in Valencia, Stoke took a largely reserve side and named just four substitutes which included academy captain Lucas Dawson. This attracted much criticism of Pulis by supporters but he defended his choice. Stoke finished the 2011–12 season in 14th position."]}, {"page": "Marton, Middlesbrough", "response": ["Marton is also the base for a junior football club, Marton F.C., which was founded in 1982 and for which Jonathan Woodgate, David Wheater and Stewart Downing, subsequent Middlesbrough F.C. professional footballers, once played."]}, {"page": "David O'Leary", "response": ["This period was thrown into turmoil by the involvement of four players, including first-teamers Jonathan Woodgate and Lee Bowyer, in an incident in Leeds city centre that ended in the assault and injury of an Asian student in January 2000, with the second trial ending in December 2001. O'Leary, to some extent, alienated the fans and also Ridsdale, by writing a book, Leeds United on Trial.", "O'Leary's fame at Leeds rests upon his promotion of a series of younger players, Jonathan Woodgate, Lee Bowyer, Alan Smith, Harry Kewell, Stephen McPhail, Eirik Bakke, Ian Harte, and Danny Mills (signed for £4 million from Charlton Athletic). He promoted several members of the youth team into an exciting Leeds side that played a pressing game relying on youthful enthusiasm."]}, {"page": "Gary O'Neil", "response": ["Following the appointment of Jonathan Woodgate as manager of Championship side Bournemouth until the end of the 2020-21 season, O’Neil joined Bournemouth as senior first team coach on 23 February 2021."]}, {"page": "Paul Hart", "response": ["Hart then moved into youth coaching firstly at Nottingham Forest, and then subsequently took charge of Leeds United's fledgling academy. Hart's proteges won the FA Youth Cup in 1993 and 1997 and formed the backbone of the Leeds side that reached the Champions League semi-finals in 2000–01. With International players such as Harry Kewell, Jonathan Woodgate, Ian Harte, Alan Smith, Gary Kelly, Paul Robinson, Matt Jones and Stephen McPhail.", "Hart then returned to take charge of Nottingham Forest's academy after a high-profile fall-out with Leeds manager George Graham over the promise of Jonathan Woodgate. Forest's Under-19 side became immensely successful winning the Under-19 title in 1999–2000. As the first team were faltering, and the club spiralling further into debt, players such as David Prutton, Jermaine Jenas, Keith Foy, Chris Doig, David Freeman, Kevin Dawson, Gareth Williams, Richard Cooper and Gareth Edds were blooded, with a further line of players including Barry Roche, Andy Reid, Brian Cash, Eugen Bopp, John Thompson and Michael Dawson following subsequently."]}, {"page": "Steven Caldwell", "response": ["It wasn't until on 15 October 2003 when Caldwell made his first appearance of the 2003–04 season, coming on as a 78th-minute substitute, in a 1–0 win against NAC Breda in the UEFA Cup, a win that saw Newcastle United through to the next round of the tournament following a 6–0 win on aggregate. He then made three more appearances for the club in the first half of the season. Manager Robson praised his performance in the last two matches. However, Caldwell continued to found his first team opportunities limited, due to competitions and his own injury concern. Because of this, Caldwell wanted to leave Newcastle United if he was not given first team football at the club. At one point, Caldwell was expected to leave Newcastle United on loan but Manager Robson blocked any attempts following an injury of Jonathan Woodgate. After Newcastle United recalled him due to an injury of Woodgate and Griffin, he made his appearances for the club since leaving, coming against Wolverhampton Wanderers on 9 May 2004. Caldwell appeared in the last two matches of the 2003–04 season, as Newcastle United failed to qualify for the UEFA Champions League next season. In total at the club, he made a total of seven appearances in all competitions."]}, {"page": "Matthew Upson", "response": ["Upson joined Stoke City on a two-year contract on 9 August 2011. He said that playing in the UEFA Europa League was one of the main reasons he decided to join Stoke. Upson made his debut for Stoke in a 1–0 victory over FC Thun in the Europa League, and scored his first goal for the club in the second leg in a 4–1 victory at the Britannia Stadium. After joining Stoke, Upson and fellow summer signing Jonathan Woodgate were used as backup to first-choice centre backs Robert Huth and Ryan Shawcross. He was a regular in the Europa League, appearing in all six group matches, but was sent off in the last as Stoke qualified for the round of 32. He scored his first league goal for Stoke in a 2–0 home win against Swansea City on 26 February 2012 in a man-of-the-match performance. With Shawcross suspended, Upson made his first League appearance of the 2012–13 season on 29 December 2012 against Southampton; he scored Stoke's second goal in a 3–3 draw."]}, {"page": "Scott Parker", "response": ["The same day his departure from Fulham was finalized, Parker was appointed as head coach of AFC Bournemouth, replacing Jonathan Woodgate. Parker signed a three-year contract with the club. After guiding the club to 13 points from a possible 15, Parker was awarded the league's Manager of the Month award for September 2021.  Parker won the award again in October after leading Bournemouth to five wins in five matches, conceding just one goal in the process. "]}, {"page": "Kieron Dyer", "response": ["After representing England at Youth, Under 21 and \"B\" level, Dyer's debut for the senior team came on 4 September 1999 when he started in England's 6–0 win against Luxembourg. He was deployed out of position at right back, and was replaced by Gary Neville at half-time after injuring himself while setting up Alan Shearer's third goal of the match. The injury was not serious and he was able to make his second England appearance four days later, coming on as a late substitute for Steve McManaman in a 0–0 draw with Poland. England qualified for the Euro 2000 competition but Dyer was not selected for the squad for the tournament, though he had recovered from injury and taken part in pre-tournament friendlies against Argentina and Ukraine. Along with a number of other young players who failed to make the squad – including Rio Ferdinand, Frank Lampard, Michael Duberry, Jody Morris and Jonathan Woodgate – Dyer took a drunken holiday to the Cypriot resort of Ayia Napa. The holiday hit the headlines when a video of Dyer, Ferdinand and Lampard having sex with a number of women was leaked to The News of the World. Shortly after the story broke, it was revealed that Dyer had spent a night in hospital after being glassed in the face during a fight in an Ipswich night club."]}]}}