{"wiki_id": "http://www.wikidata.org/entity/Q2979063", "itemLabel": "Cliff Pritchard", "itemDescription": "Welsh rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Cliff_Pritchard", "wikipedia_page": {"main": "Cliff Pritchard (1881–1954) was a Welsh international centre who played club rugby for Newport RFC and Pontypool RFC. Pritchard was capped on five occasions and scored two tries for his country. He is best known as one of the Welsh squad that beat the 1905 touring All Blacks.\n\n", "link_mentions": [{"page": "Pontypool RFC", "response": ["Pontypool's first international player to be capped directly from the club was Cliff Pritchard, who after playing his first games for Wales as a Newport player, joined Pontypool in 1905 and was capped as part of the 1906 Home Nations Championship. Closely following Pritchard were the Jones brothers, David (known as 'Ponty' Jones), Jack and 'Tuan'. All three were capped for the Wales team, representing their country over the period 1907–1921. As well as representing Wales, Jack and 'Tuan' both played for the British Isles team, making them the first British Lions to be selected from Pontypool. In season 1913/14 Pontypool became the unofficial Welsh Club Champions for the first time.", "*  Cliff Pritchard"]}, {"page": "1954 in Wales", "response": ["*14 December – Cliff Pritchard, Welsh international rugby player, 73"]}, {"page": "The Original All Blacks", "response": ["The All Blacks' first-half play was generally considered poor—with aimless kicking to Welsh fullback Winfield who returned much better kicks into touch. The first ten minutes saw New Zealand's Roberts break the line twice only, to be caught by Winfield without support. Eventually Wales had a scrum-feed 25 yards out from the All Blacks' try-line. From this Wales executed a planned move—Owen got the Wales scrum-ball and dummied on his right to Bush. He then turned left and passed to Cliff Pritchard. Pritchard then passed to Gabe, who passed to Bush, who eventually passed to Morgan. Morgan then raced 25 yards down the touchline, eluding Gillett, to score for Wales. Winfield missed the resulting conversion—leaving the score at 3–0. In the final stages of the first half the All Blacks began to assert themselves and were attacking strongly when half-time was sounded. Dixon claimed half-time was called two minutes early, and Wallace that it was three minutes early.", "The All Blacks kicked off for the second half and the two teams were evenly matched. The All Blacks first five-eighth Mynott was having a poor game—dropping the ball frequently. Eventually Roberts stopped passing to him, and would instead run the ball himself. The Welsh had try-scoring opportunities, but drop-goal attempts and dropped passes prevented them scoring. Some time during the second half (various accounts are given—all identifying different times in the match) the All Blacks got their best attacking opportunity of the match. The Welsh won a line-out on the All Blacks side of half-way and, with the resulting ball, kicked diagonally across-field which was fielded by New Zealand's Wallace. Wallace then ran and broke through the Welsh line before confronting their fullback Winfield. Wallace then passed to Deans who was tackled either on, or near the Welsh line. The referee Dallas awarded a scrum to Wales five yards from their line. A contemporary report states \"Morgan sprinted across from the left wing, and helped Winfield to save what otherwise would have been a try by tackling Deans before he grounded the ball, and, though a splendid effort was made by the centre threequarter to straggle over, timely reinforcements came to Morgan, and the ball was grounded between two and three feet from the line, though Deans considers he grounded the ball in goal.Wales v. New Zealand. A Welsh Triumph. Report by \"Old Stager\", Cardiff Times and South Wales Weekly News, 23 December 1905, at National Library of Wales. The incident was later the subject of different accounts, with Cliff Pritchard, Rhys Gabe and Welsh captain Gwyn Nicholls claiming to have been among the tacklers and in a good position to see that the ball was grounded short of the line, while Morgan believed a try should have been awarded.Davis J. C. Old Welsh Rugby Heroes Foregather at the Microphone The Referee, Sydney, 13 February 1936, at TroveThomas (1979), pg39.Parry-Jones (1999), pg 156. The All Blacks had further opportunities to score during the match, with Mynott held up over the line, Deans nearly scoring before being tackled by the Welsh, and McGregor nearly scoring except for a forward pass."]}, {"page": "1881 in Wales", "response": ["*1 October – Cliff Pritchard, Wales international rugby player (died 1954)"]}, {"page": "1910 Five Nations Championship", "response": ["Wales: Jack Bancroft (Swansea), Phil Hopkins (Swansea), Hopkin Maddock (London Welsh), Jack Jones (Newport), Billy Trew (Swansea) capt., Dick Jones (Swansea), Reggie Gibbs (Cardiff), Joe Pullman (Neath), Ben Gronow (Bridgend), Cliff Pritchard (Newport), Phil Waller (Newport), Jim Webb (Abertillery), Tom Evans (Llanelli), Ivor Morgan (Swansea), Dick Thomas (Newport)", "Wales: Jack Bancroft (Swansea), Phil Hopkins (Swansea), Reggie Gibbs (Cardiff), Jack Jones (Pontypool), Billy Trew (Swansea) capt., Dick Jones (Swansea), Dicky Owen (Swansea), Harry Jarman (Newport), Ben Gronow (Bridgend), Cliff Pritchard (Newport), David John Thomas (Swansea), Jim Webb (Abertillery), Tom Evans (Llanelli), Ivor Morgan (Swansea), Joseph Pugsley (Cardiff)"]}, {"page": "1904 Home Nations Championship", "response": ["Wales: Bert Winfield (Cardiff), Teddy Morgan (London Welsh), Cliff Pritchard (Newport), Rhys Gabe (Llanelli), Willie Llewellyn (Newport) capt., Dicky Owen (Swansea), Dick Jones (Swansea), Jehoida Hodges (Newport), Will Joseph (Swansea), Billy O'Neill (Cardiff), Arthur Harding (London Welsh), Alfred Brice (Aberavon), Harry Vaughan Watkins (Llanelli), Edwin Thomas Maynard (Newport), David Harris Davies (Neath)", "Wales: Bert Winfield (Cardiff), Teddy Morgan (London Welsh), Cliff Pritchard (Newport), Rhys Gabe (Llanelli), Willie Llewellyn (Newport) capt., Dicky Owen (Swansea), Dick Jones (Swansea), Sid Bevan (Swansea), Howell Jones (Neath), Billy O'Neill (Cardiff), Arthur Harding (London Welsh), Alfred Brice (Aberavon), Harry Vaughan Watkins (Llanelli), Edwin Thomas Maynard (Newport), Charlie Pritchard (Newport)"]}, {"page": "1906 Home Nations Championship", "response": [";Wales: Bert Winfield (Cardiff), Teddy Morgan (London Welsh), Gwyn Nicholls (Cardiff), Rhys Gabe (Cardiff), Hopkin Maddock (London Welsh), Percy Bush (Cardiff), Dicky Owen (Swansea), Cliff Pritchard (Pontypool), Jehoida Hodges (Newport), George Travers (Pill Harriers) capt., Charlie Pritchard (Newport), Arthur Harding (London Welsh), David Jones (Treherbert), Harry Vaughan Watkins (Llanelli), Will Joseph (Swansea)", ";Wales: Bert Winfield (Cardiff), Teddy Morgan (London Welsh), Gwyn Nicholls (Cardiff), Cliff Pritchard (Pontypool), Hopkin Maddock (London Welsh), Reggie Gibbs (Cardiff), Dicky Owen (Swansea), Billy Trew (Swansea), Jehoida Hodges (Newport), George Travers (Pill Harriers) capt., Charlie Pritchard (Newport), Arthur Harding (London Welsh), David Jones (Treherbert), Jack Williams (London Welsh), Will Joseph (Swansea)"]}, {"page": "Teddy Morgan", "response": ["Morgan moved to London from Newport in 1902 to take up a post at Guy's Hospital, and played with London Welsh. It was while playing in London that Morgan earned his first international cap, for Wales against England. Morgan's career with Wales saw him score 14 tries from the wing, but his best-remembered was that against the Original All Blacks at Cardiff Arms Park on 16 December 1905. In the monumental match between the unbeaten All Blacks and the Triple Crown-winning Welsh team, Morgan is believed to have led his team in singing the Welsh national anthem in response to the New Zealanders' haka. This was the first time a national anthem had been sung at a sporting event. The strongly contested game was decided by a single score. In the twenty-fifth minute, Welsh scrum half Dicky Owen released the ball to Cliff Pritchard, who received the ball at ankle level before darting forward. Having run past Bob Dean, Pritchard released to Rhys Gabe who in turn found Morgan. Morgan dummied George Gillett and touched the ball down in the corner.Parry-Jones (1999), pg 152.", "After the match Morgan expressed disagreement with the referee's controversial decision to disallow a try claimed by New Zealand player Bob Deans. A contemporary reporter stated \"Morgan sprinted across from the left wing, and helped Winfield to save what otherwise would have been a try by tackling Deans before be grounded the ball, and, though a splendid effort was made by the centre threequarter to straggle over, timely reinforcements came to Morgan, and the ball was grounded between two and three feet from the line, though Deans considers he grounded the ball in goal.Wales v. New Zealand. A Welsh Triumph. Report by \"Old Stager\", Cardiff Times and South Wales Weekly News, 23 December 1905, at National Library of Wales. But the incident has been the subject of different accounts, with Cliff Pritchard, Rhys Gabe and Welsh captain Gwyn Nicholls claiming to have been among the tacklers and in a good position to see that the ball was grounded short of the line.Davis J. C. Old Welsh Rugby Heroes Foregather at the Microphone The Referee, Sydney, 13 February 1936, at TroveThomas (1979), pg39.Parry-Jones (1999), pg 156."]}, {"page": "Johnny Williams (rugby union, born 1882)", "response": ["Having played association football at school, Williams switched to playing rugby with the Whitchurch Village rugby club. From the start of his career, he played on the left wing. In 1899, Williams was invited to play at Newport RFC under the newly appointed captain, Llewellyn Lloyd. Several players had departed, leaving gaps in the backline, and Williams was brought in, alongside Cliff Pritchard and W. Isaacs, while the effective pairing of Lloyd and Lou Phillips at halfback continued. In Williams' first season at Newport, the team scored a total of 416 points compared with the previous season's 192. The following season was Newport's third best on record. However, Williams was injured during the course of the year. Nevertheless, his contributions were noted: against Moseley, despite an early error, he scored a try in the first quarter \"after a grand run\", and at the beginning of the second half, managed to touch down a second try, just before Yates \"grassed him\"."]}, {"page": "Harry Vaughan Watkins", "response": ["The opening game of the series was against England, played at the Cardiff Arms Park. Wales dominated from the start of the match and scored seven tries, two of which were scored by Welsh forwards, Arthur Harding and Watkins himself. This try was Watkins only international points. The next two matches saw an away victory over Scotland and a home win over Ireland. The 1905 winning team is still recognised as one of the strongest Welsh teams in history, centred on a formidable pack. With Wales dominating the Home Nations, the next game was to be the historic encounter with the Original All Blacks, New Zealand's first touring team. Despite being available for the opening game of the 1906 Home Nations Championship less than a month later, Watkins was not selected for the 'Match of the Century', which saw Wales narrowly beat the All Blacks. Wales changed their pack formation to counter the New Zealand tactics, and the Welsh selectors brought in Charlie and Cliff Pritchard at the expense of Watkins and Cardiff's Billy O'Neill. Watkins played his final Wales international against England in January 1906."]}, {"page": "Match of the Century (rugby union)", "response": ["A scrum was called and Dicky Owen saw a chance to call the move he devised in training. As Wales won the ball, Owen ran it down the blindside, with the backline of Bush, Nicholls & Llewellyn following him in support. This initial move drew Gallaher, Hunter and most of the New Zealand backs in that direction. Owen then switched the play, throwing a long pass back to the openside, with Cliff Pritchard having to take the ball at his feet. The long pass gave Pritchard time to draw the covering tackle of Deans before passing to Gabe who similarly drew Duncan McGregor. Finally Gabe passed to Morgan who sprinted more then twenty metres past the covering full-back Gillett to touch down in the left corner on 23 minutes. Wales failed to kick the conversion and this was the only score of the match and the first time that the All Blacks had conceded without first scoring themselves.", "Wales: Bert Winfield (Cardiff), Teddy Morgan (London Welsh), Gwyn Nicholls (Cardiff) capt., Rhys Gabe (Llanelli), Willie Llewellyn (Newport), Percy Bush (Cardiff), Dicky Owen (Swansea), Cliff Pritchard (Newport), Dai \"Tarw\" Jones (Treherbert), Arthur Harding (London Welsh), Jehoida Hodges (Newport), Will Joseph (Swansea), Jack Williams (London Welsh), George Travers (Pill Harriers), Charlie Pritchard (Newport)"]}, {"page": "Pritchard (surname)", "response": ["*Cliff Pritchard (1881–1954), Welsh international rugby player"]}]}}