{"wiki_id": "http://www.wikidata.org/entity/Q297271", "itemLabel": "Jimmy Greaves", "itemDescription": "English football player (1940-2021)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmy_Greaves", "wikipedia_page": {"main": "James Peter Greaves  (20 February 1940 – 19 September 2021) was an English professional footballer who played as a forward. He is England's fifth-highest international goalscorer (44 goals), Tottenham Hotspur's highest ever goalscorer (266 goals), the highest goalscorer in the history of English top-flight football (357 goals), and also scored more hat-tricks (six) for England than anyone else. He finished as the First Division's top scorer in six seasons. He is also a member of the English Football Hall of Fame.\nGreaves began his professional career at Chelsea in 1957, and played in the following year's FA Youth Cup final. He scored 124 First Division goals in just four seasons before being sold on to Italian club A.C. Milan for £80,000 in April 1961. His stay in Italy was not a happy one and he returned to England with Tottenham Hotspur for a fee of £99,999 in December 1961. Whilst with Spurs he won the FA Cup in 1961–62 and 1966–67, the Charity Shield in 1962 and 1967, and the European Cup Winners' Cup in 1962–63; he never won a league title but did help Spurs to a second-place finish in 1962–63. He moved to West Ham United in a player-exchange in March 1970 and retired the following year. After a four-year absence he returned to football at the non-league level, despite suffering from alcoholism. In a five-year spell he played for Brentwood, Chelmsford City, Barnet, and Woodford Town before retiring for good in 1980.\nGreaves scored 13 goals in 12 England under-23 internationals and scored 44 goals in 57 full England internationals between 1959 and 1967. He played in the 1962 and 1966 FIFA World Cup, but was injured in the group stage of the 1966 World Cup and lost his first team place to Geoff Hurst, who kept Greaves out of the first team in the final. England won the World Cup, but Greaves was not given his medal until a change of FIFA rules in 2009. He was also part of the squad that finished third in UEFA Euro 1968, although he did not play any minute in the finals.\nAfter retiring as a player Greaves went on to enjoy a successful career in broadcasting, most notably working alongside Ian St John on Saint and Greavsie from 1985 to 1992. During this period, he also made regular appearances on TV-am. He worked on a number of other sport programmes on ITV during this period, including Sporting Triangles (1987–1990).", "link_mentions": [{"page": "Bobby Charlton", "response": ["His goals became a little less frequent, and indeed Jimmy Greaves, playing purely as a striker, overtook his England tally in October 1964. Nevertheless, Charlton was still scoring and creating freely, and as the tournament was about to start he was expected to become one of its stars and galvanise his established reputation as one of the world's best footballers.", "Weeks later he scored his 45th England goal in a friendly against Sweden, breaking the record of 44 set the previous year by Jimmy Greaves. He was then in the England team which made it to the semi-finals of the 1968 European Championships where they were knocked out by Yugoslavia in Florence. During the match Charlton struck a Yugoslav post. England defeated the Soviet Union 2–0 in the third place match."]}, {"page": "Chelsea F.C.", "response": ["Lampard is Chelsea's all-time top goalscorer, having scored 211 goals in 648 games (2001–2014); he passed Bobby Tambling's longstanding record of 202 in May 2013. Eight other players have also scored over 100 goals for Chelsea: George Hilsdon (1906–1912), George Mills (1929–1939), Roy Bentley (1948–1956), Jimmy Greaves (1957–1961), Peter Osgood (1964–1974 and 1978–1979), Kerry Dixon (1983–1992), Didier Drogba (2004–2012 and 2014–2015), and Eden Hazard (2012–2019). Greaves holds the club record for the most goals scored in one season (43 in 1960–61). While a Chelsea player, Greaves also became the youngest ever player to score 100 goals in the English top-flight, at 20 years and 290 days."]}, {"page": "England national football team", "response": ["|style=\"text-align:left\"|Jimmy Greaves"]}, {"page": "February 20", "response": ["*1940 – Jimmy Greaves, English international footballer and TV pundit (d. 2021)"]}, {"page": "Geoff Hurst", "response": ["Hurst made his senior England debut against West Germany on 23 February 1966. He played well, and further performances against Scotland and Yugoslavia secured him a place in the squad for the 1966 FIFA World Cup. However, he put in mediocre performances in warm-up games against Finland and Denmark, and so Jimmy Greaves and Roger Hunt were instead picked for the final friendly game against Poland. Greaves and Hunt were indeed picked for the three group games against Uruguay, Mexico and France, but in the latter game, Greaves suffered a deep gash to his leg which required stitches, and Hurst was called up to take his place in the quarter final against Argentina."]}, {"page": "September 19", "response": ["*  2021   – Jimmy Greaves, English footballer (Chelsea, Tottenham Hotspur, national team), world champion (1966 FIFA World Cup) (b. 1940)"]}, {"page": "1940", "response": ["* February 20 – Jimmy Greaves, English footballer (d. 2021)"]}, {"page": "2021", "response": ["** Jimmy Greaves, English footballer (b. 1940)"]}, {"page": "Alan Shearer", "response": ["Alan Shearer CBE DL (born 13 August 1970) is an English football pundit and retired football player and manager who played as a striker. Widely regarded as one of the best strikers of his generation and one of the greatest players in Premier League history, he is the Premier League's record goalscorer.Whilst Shearer holds the record for goals scored in the Premier League, formed in 1992, the record for goals scored in the top flight in English football is 357, held by Jimmy Greaves. Shearer has scored 283 top flight goals, including 23 in the Football League First Division. -  He was named Football Writers' Association Player of the Year in 1994 and won the PFA Player of the Year award in 1995. In 1996, he came third in both Ballon d'Or and FIFA World Player of the Year awards. In 2004, he was named by Pelé in the FIFA 100 list of the world's greatest living players. Shearer was one of the first two players inducted into the Premier League Hall of Fame in 2021.", "Shearer was promoted to the first team after spending two years with the youth squad. He made his professional debut for Southampton on 26 March 1988, coming on as a substitute in a First Division fixture at Chelsea, before prompting national headlines in his full debut at The Dell two weeks later. He scored a hat-trick, helping the team to a 4–2 victory against Arsenal, thus becoming the youngest player – at 17 years, 240 days – to score a hat-trick in the top division, breaking Jimmy Greaves' 30-year–old record. Shearer ended the 1987–88 season with three goals in five games, and was rewarded with his first professional contract."]}, {"page": "1962 FIFA World Cup", "response": ["* Jimmy Greaves"]}, {"page": "Tottenham Hotspur F.C.", "response": ["Bill Nicholson took over as manager in October 1958. He became the club's most successful manager, guiding the team to major trophy success three seasons in a row in the early 1960s: the Double in 1961, the FA Cup in 1962 and the Cup Winners' Cup in 1963. Nicholson signed Dave Mackay and John White in 1959, two influential players of the Double-winning team, and Jimmy Greaves in 1961, the most prolific goal-scorer in the history of the top tier of English football.", "Steve Perryman holds the appearance record for Spurs, having played 854 games for the club between 1969 and 1986, of which 655 were league matches. Jimmy Greaves holds the club goal scoring record with 266 goals in 380 league, cup and European appearances.", "The following players are noted as \"greats\" for their contributions to the club or have been inducted into the club's Hall of Fame: The most recent additions to the club's Hall of Fame are Steve Perryman and Jimmy Greaves on 20 April 2016.", "*  Jimmy Greaves"]}, {"page": "Crewe Alexandra F.C.", "response": ["All-time records were set against First Division Tottenham Hotspur in the FA Cup fourth round in 1960. A new record Gresty Road attendance of 20,000 saw Crewe hold Spurs to a 2–2 draw on 30 January.Crisp, pp.9, 91. On 3 February, Tottenham convincingly won the replay 13–2, Crewe's record defeat.Crisp, pp.9, 12, 91. The following year, however, Jimmy McGuigan's Crewe side defeated another First Division club, Chelsea, 2–1 in the FA Cup at Stamford Bridge on 7 January 1961. Chelsea's side included former Crewe player Frank Blunstone—who scored Chelsea's goal—as well as England internationals Peter Bonetti, Jimmy Greaves and Terry Venables. Crewe were then again drawn against the eventual double-winning Spurs side, who won 5–1 in the fourth round at White Hart Lane."]}, {"page": "Total Football", "response": ["Also in the 1940s, English manager Jack Reynolds, implemented a Total Football style while at Dutch club Ajax. In the late 1950s and early 1960s, Burnley were playing a renewed system in English football \"where every player could play in every position\" under manager Harry Potts. This Total Football system led the club to the 1959–60 First Division title and won many plaudits, including admiration from all-time English First Division top scorer Jimmy Greaves.Quelch (2015), p. 11 Another pioneer was Vic Buckingham, manager of West Bromwich Albion, Ajax and Barcelona in the 1950s and 1960s, as his philosophy was later further developed by Rinus Michels and Johan Cruyff, a player who was introduced into the Ajax first team by Buckingham."]}, {"page": "Torquay United F.C.", "response": ["The first attempt at a replay in London was cancelled, with the majority of United's travelling fans having already arrived in the capital. A week later though, in front of 55,000-strong crowd at White Hart Lane, the match went ahead. Jimmy Greaves scored a hat trick as Tottenham showed their class to win 5–1, Stubbs hitting Torquay's lone consolation goal."]}, {"page": "Michael Owen", "response": ["Owen was capped 89 times for England and scored 40 goals. He is sixth in the list of all-time top scorers for the England team, behind Wayne Rooney (53), Bobby Charlton (49), Gary Lineker (48), Harry Kane (48) and Jimmy Greaves (44). He is also England's second-highest goalscorer in competitive international matches, behind Rooney. His 89 caps also place him as England's eleventh most capped player."]}, {"page": "Ian Hamilton (footballer, born 1950)", "response": ["Hamilton joined Chelsea as a junior and became the Stamford Bridge club's youngest ever player and goalscorer at 16 years, 138 days when he scored against Tottenham Hotspur on his debut, on 18 March 1967, a feat which earned comparisons with another famous Chelsea striker who also scored on his debut against Spurs – Jimmy Greaves. Thereafter he played only four more first-team games for Chelsea, spending the 1968–69 season with Southend United before moving to Aston Villa in 1968."]}, {"page": "List of sports announcers", "response": ["* Jimmy Greaves – ITV Sport 1981–1995, Setanta Sports 2009"]}]}}