{"wiki_id": "http://www.wikidata.org/entity/Q2975143", "itemLabel": "Claire Wright", "itemDescription": "English trampolinist", "wikipedia_url": "https://en.wikipedia.org/wiki/Claire_Wright_(gymnast)", "wikipedia_page": {"main": "Claire Louise Wright (born 5 August 1979 in Camberley, England) is a British trampoline gymnast. Her parents, Bernie and Colin Wright are gymnastics coaches and they run the Rushmoor Gymnastics Academy. She attended sixth form at Farnham College before doing a Sports Science degree at University of Wales Institute, Cardiff.Wright received FIG pin for achievement at World Championships in 2000.\nWright retired after representing Great Britain at the 2008 Summer OlympicsClaire is currently performing in Cirque du Soleil's La Nouba, in the trampolining and track act.", "link_mentions": [{"page": "Farnham College", "response": ["*Claire Wright, World Cup champion and Olympic trampolinist.Official Team GB Website for Beijing 2008 Olympic Games > Athlete profile > Claire Wright"]}, {"page": "Brian Phelps (diver)", "response": ["Phelps then went on to found the OLGA trampoline club along with his wife, Monica Rutherford, an Olympic artistic gymnast. The club, based in the South of England, has generated many international performers since its opening. These include current coach Nigel Rendell whose son, Luke Rendell, is a current international performer and Tom and Hannah Lewis, both of whom have won major titles, Hannah's being the 2003 European championships with Tom's the 2005 World Age Championship win. Brian Camp, one of Phelps's main prodigies performs regularly with the world's best. Another club member has been Claire Wright. Other OLGA performers include Danielle Pietruszka, Melissa Eryilmaz and Katy Ianson."]}, {"page": "Jaime Halsey", "response": ["On 25 November 2005, Moore and Claire Wright won the British Championship title in synchronised trampolining.", "In 2006, she missed out on obtaining the British senior title by just a tenth of a point to compatriot Claire Wright. She did, however, break her own record for difficulty, with a 13.1 total.", "After winning Britain's place at the Beijing Olympics, Moore finished below Claire Wright in the European Championships and travelled to China as the reserve.\"Moore heads to Beijing as reserve\". BBC Sport, 8 May 2008"]}, {"page": "Great Britain at the 2008 Summer Olympics", "response": ["* Claire Wright was the only British competitor on the trampoline.", "|align=left|Claire Wright"]}, {"page": "Gymnastics at the World Games", "response": ["| Kirstin LawtonClaire Wright"]}, {"page": "Gymnastics at the 2008 Summer Olympics – Women's trampoline", "response": ["| align=left| Claire Wright || "]}, {"page": "2007 Trampoline World Championships", "response": ["| Claire WrightKatherine Driscoll"]}, {"page": "2005 Trampoline World Championships", "response": ["| Claire WrightJaime Moore"]}, {"page": "2003 Trampoline World Championships", "response": ["| Claire Wright  Kirsten Lawton  Aurora Necco  Natalia O'Connor", "| Claire WrightKirsten Lawton"]}, {"page": "1999 Trampoline World Championships", "response": ["| Claire Wright  Kirsten Lawton  Jaime Moore  Vicky Pollard", "| Claire Wright  Kirsten Lawton"]}, {"page": "2001 Trampoline World Championships", "response": ["| Claire Wright", "| Claire Wright  Kirsten Lawton  Victoria Pollard  Aurora Necco", "| Claire Wright  Kirsten Lawton"]}, {"page": "1998 Trampoline World Championships", "response": ["| Claire Wright", "| Claire Wright  Kirsten Lawton  Jaime Moore  Ellie Dixon-Jackson"]}, {"page": "1996 Trampoline World Championships", "response": ["| Claire Wright  Kirsten Lawton  Sue Challis  Ellie Dixon-Jackson", "| Claire Wright  Sue Challis"]}, {"page": "1994 Trampoline World Championships", "response": ["| Andrea Holmes  Sue Challis  Claire Wright  Lorraine Lyon"]}, {"page": "List of 2001 World Games medal winners", "response": ["| Kirsten LawtonClaire Wright"]}, {"page": "Claire Wright", "response": ["Claire Wright may refer to:", "* Claire Wright (gymnast) (born 1979), British trampoline gymnast", "* Claire Wright (politician), independent candidate in the 2019 United Kingdom General Election"]}, {"page": "Trampoline gymnastics at the 2001 World Games", "response": ["| Kirsten LawtonClaire Wright"]}, {"page": "Trampoline gymnastics at the 2001 World Games – Women's synchronized trampoline", "response": ["|4||align=left|Kirsten LawtonClaire Wright||align=left|  Great Britain||37.50||45.70||83.20||Q", "|||align=left|Kirsten LawtonClaire Wright||align=left|  Great Britain ||48.40"]}]}}