{"wiki_id": "http://www.wikidata.org/entity/Q2979449", "itemLabel": "Clive Williams", "itemDescription": "Welsh rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Clive_Williams_(rugby_union)", "wikipedia_page": {"main": "Clive Williams (born 2 November 1948) is a former Wales international rugby union player. He toured twice with the British & Irish Lions, to New Zealand in 1977 and to South Africa in 1980.Williams came to prominence playing for Aberavon RFC where he became a formidable scrummager under the coaching of the ex-Welsh International prop – Phil Morgan.\nHe was selected for the 1977 Lions tour but remarkably on his return to his club, he lost his place to the then un-capped John Richardson.\nWilliams left the club and joined Swansea RFC and was again selected to play for the 1980 Lions.", "link_mentions": [{"page": "Clive", "response": ["* Clive Williams (rugby union) (born 1948), Welsh rugby union player", "* Clive Williams (professor) (born 1945), British-born former Australian Army Military Intelligence officer and academic"]}, {"page": "Swansea RFC", "response": ["*  Clive Williams 1980"]}, {"page": "Aberavon RFC", "response": ["*  Clive Williams"]}, {"page": "1980 British Lions tour to South Africa", "response": ["Of the 30 players originally selected, ten had previous Lions tour experience. Derek Quinnell had toured New Zealand in 1971 and 1977; Andy Irvine and Fran Cotton had toured South Africa in 1974 and New Zealand in 1977 while Bruce Hay, Bill Beaumont, Allan Martin, Graham Price, Jeff Squire, Peter Wheeler and Clive Williams had all toured New Zealand in 1977. Elgan Rees, added to the party before it left the UK, and Phil Orr, a replacement during the tour, had also toured in 1977. Quinnell was selected despite not playing in the 1980 Five Nations Championship; he had also toured in 1971 when yet to be capped by Wales.", "* Clive Williams (Swansea and Wales)"]}, {"page": "1980 in Wales", "response": ["**Fifteen Welsh players are included in the squad of 38 for the 1980 British Lions tour to South Africa: Elgan Rees, Ray Gravell, David Richards, Peter Morgan, Gareth Davies, Terry Holmes, Clive Williams, Ian Stephens, Graham Price, Alan Phillips, Allan Martin, Jeff Squire, Stuart Lane, Derek Quinnell and Gareth Powell Williams."]}, {"page": "Allan Martin (rugby union)", "response": ["In 1977 he toured New Zealand one of three players from Aberavon – outside half John Bevan and prop Clive Williams being the others. In 1980 he toured South Africa with the British Lions."]}, {"page": "John Bevan (rugby union)", "response": ["Bevan, a schoolteacher at Dyffryn Comprehensive at Port Talbot toured New Zealand with the British Lions on their 1977 tour but did not play in any of the internationals against the All Blacks, although, following a dip in form of the tour captain Phil Bennett, many thought he should have been picked for the final test. Bevan was one of three Aberavon players to make the 1977 tour, Allan Martin lock and Clive Williams prop being the others."]}, {"page": "1983 Five Nations Championship", "response": ["|LP ||1 ||Clive Williams"]}, {"page": "1977 British Lions tour to New Zealand", "response": ["* Clive Williams (Aberavon and Wales)"]}]}}