{"wiki_id": "http://www.wikidata.org/entity/Q2979437", "itemLabel": "Clive Platt", "itemDescription": "English footballer (born 1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/Clive_Platt", "wikipedia_page": {"main": "Clive Linton Platt (born 27 October 1977) is an English former professional footballer. A forward, he has made 618 appearances in the Football League, including 164 for Rochdale.\nIn his 19-year-long playing career, Platt had played for Walsall, Notts County, Peterborough United, Milton Keynes Dons, Colchester United, Coventry City, Northampton Town and Bury.", "link_mentions": [{"page": "Rochdale A.F.C.", "response": ["Steve Parkin was appointed as manager in 1998, a period in which the success of the club improved significantly with the emergence of talented players such as Gary Jones, Clive Platt, Grant Holt and Kevin Townson."]}, {"page": "Milton Keynes Dons F.C.", "response": ["|2007|| Clive Platt"]}, {"page": "Platt (surname)", "response": ["*Clive Platt (born 1977), footballer"]}, {"page": "Steve Parkin", "response": ["Parkin's first spell at Rochdale was a great success, and he lifted the Lancashire club from the depths of the league to an 8th-place finish in his first season. The team's success paved the way for big money signings like Paul Connor and Clive Platt."]}, {"page": "2006–07 Football League", "response": ["|=||align=left| Clive Platt ||align=left| Milton Keynes Dons ||18"]}, {"page": "Lee McEvilly", "response": ["McEvilly started his career at Burscough rising through the youth ranks, making his senior debut against Southport in the Liverpool Senior Cup final in August 1999. He went on to play 49 Northern Premier League games for Burscough, scoring 28 goals over two seasons. Rochdale manager John Hollins signed McEvilly in December 2001, for the Third Division club for a fee believed to be around £15,000 plus a sell-on clause. He made his debut for Rochdale in the Third Division against Kidderminster Harriers on 26 December in the 4–1 away defeat, replacing Clive Platt as a substitute in the 69th minute. McEvilly scored his first Football League goal, and his first for Rochdale against York City in their 5–4 home win on 5 February 2002.  During McEvilly's first season with Rochdale, 2001–02, they reached the playoffs finishing fifth place. Rochdale were defeated by Rushden & Diamonds in the playoff semi-finals 4–3 on aggregate over two legs. During the first leg away at Nene Park, McEvilly scored in the 2–2 draw. He made a total of 18 appearances in the Third Division, scoring four goals. The following season, 2002–03, McEvilly played 37 games in the Third Division scoring 15 goals."]}, {"page": "List of people from Wolverhampton", "response": ["* Clive Platt (born 1977) – footballer, striker"]}, {"page": "2008–09 Huddersfield Town A.F.C. season", "response": ["On 27 May, Stan Ternent made his first signing as Huddersfield Town manager. He signed Scottish striker Keigan Parker on a free transfer from Championship side Blackpool. On 5 June, Irish international Jim Goodwin joined Town on a 3-year deal from recently relegated Scunthorpe United. On 13 June, Huddersfield were drawn at home to rivals Bradford City in the first round of the League Cup. 3 days later, the new Football League fixtures were announced, Town's first game would be a home tie against recently promoted Stockport County. On 2 July, Town signed the ex-Scunthorpe United defender Andy Butler on a 3-year deal. Two days later, Chris Lucketti was brought back to Huddersfield from Sheffield United on a two-year contract, 7 years after leaving the Galpharm Stadium. On 23 July, Ternent made his fifth signing by bringing in Welshman Michael Flynn from Blackpool. Six days later, Gary Roberts joined from Ipswich Town for £250,000. On 8 August, just one day before the new season began, ex-Everton & West Ham United defender David Unsworth signed from Burnley, becoming Stan Ternent's 7th signing since becoming manager at the Galpharm. Also that day, Town were given a bye into the second round of the Football League Trophy. On 15 August, young striker Tom Denton was signed for £60,000 from Wakefield. Stan Ternent signed attacking midfielder Ian Craney for an undisclosed fee from Football League Two side Accrington Stanley on 18 August. The following day, striker Liam Dickinson was signed on loan from Championship side Derby County. That loan was extended by another month on 22 September. He eventually stayed until 17 November, when the 93-day limit expired. Stan Ternent also revealed on 5 September, that Town had failed to capture 3 strikers during the summer. They failed on bid of £850,000 for Town hero Jon Stead, who joined Ipswich Town in September, a £400,000 bid for Colchester United's Clive Platt and a £600,000 bid for Ipswich Town's Alan Lee, who subsequently moved to Championship side Crystal Palace. On 17 October, Town signed Steve Jones on loan from Burnley as cover for Andy Booth, who is out until the New Year with a back injury. He returned to Turf Moor on 26 November. On 20 January, Lee Clark made his first signing as manager by signing German left-back Dominik Werling on a free transfer. On 23 January, manager Clark made a double signing with the capture of winger Anthony Pilkington from Stockport County and striker Lionel Ainsworth from Watford. As the transfer deadline closed, Clark made three more signings, Lee Novak from Gateshead, who was then immediately sent back to Gateshead for the rest of the season. Jonathan Téhoué was signed on a free transfer from Turkish side Konyaspor. On 13 February, 11 days after the deal was originally agreed, Polish striker Lukas Jutkiewicz joined Town on loan from Premier League side Everton until the end of the season. Young Liverpool defender Martin Kelly was brought in on loan on 26 March, as the loan window shut."]}, {"page": "2009–10 Colchester United F.C. season", "response": ["|9||Clive Platt||FW||||Wolverhampton||||90||18|| Milton Keynes Dons||3 July 2007||£300,000", "|align=\"left\"|Clive Platt", "|align=\"left\"|Clive Platt", "|align=\"left\"|Clive Platt"]}, {"page": "2010–11 Coventry City F.C. season", "response": ["*8 – Striker Clive Platt has a one-year contract extension activated, running until June 2012.", "| Clive Platt", "| Clive Platt || Colchester United || 28 July 2010 || Nominal"]}, {"page": "2010–11 Colchester United F.C. season", "response": ["Key players from last season left the club over the summer including David Fox, Kevin Lisbie, Clive Platt and David Prutton, while Danny Batth and Kevin Lisbie returned to their parent clubs on the expiry of their loan deals. John Ward made several free transfers to replace them, including free agents Lloyd James and Brian Wilson, non-League players Andy Bond and Ben Coker, while Dave Mooney was signed on a season-long loan from Reading.", "|Clive Platt"]}, {"page": "List of Coventry City F.C. seasons", "response": ["|align=left| Carl Baker Clive Platt Richard Wood"]}, {"page": "2008–09 Colchester United F.C. season", "response": ["|9||Clive Platt||FW||||Wolverhampton||||42||8|| Milton Keynes Dons||3 July 2007||£300,000", "|align=\"left\"|Clive Platt", "|align=\"left\"|Clive Platt"]}, {"page": "2007–08 Colchester United F.C. season", "response": ["Ahead of Colchester's largely unexpected second season in the Championship, their star performers Wayne Brown, Jamie Cureton, Richard Garcia, and Chris Iwelumo all left the club citing a \"lack of ambition\" as their reason for wanting to leave. Cureton left for Norwich City for £750,000, prompting manager Geraint Williams to break the club's record transfer fee twice on the same day by signing Mark Yeates from Tottenham Hotspur and then spending £300,000 on Milton Keynes Dons' forward Clive Platt. The following day, England legend Teddy Sheringham also signed for the club.", "|9||Clive Platt||FW||||Wolverhampton||||0||0|| Milton Keynes Dons||3 July 2007||£300,000", "|Clive Platt", "|align=\"left\"|Clive Platt", "|align=\"left\"|Clive Platt", "|Clive Platt"]}, {"page": "2011–12 Coventry City F.C. season", "response": ["| Clive Platt"]}]}}