{"wiki_id": "http://www.wikidata.org/entity/Q2978879", "itemLabel": "Clement Cazalet", "itemDescription": "British tennis player", "wikipedia_url": "https://en.wikipedia.org/wiki/Clement_Cazalet", "wikipedia_page": {"main": "Clement Haughton Langston Cazalet   (16 July 1869 – 23 March 1950) was a British tennis player who competed in the 1908 Summer Olympics.He was the son of William Clement Cazalet (brother of Edward Cazalet) and Emmeline Agnes Cazalet (nee Fawcett). Cazalet was educated at Rugby School and Trinity College, Cambridge.In 1908 he won the bronze medal in the men's doubles competition together with his partner Charles Dixon.While serving in the First World War, Cazalet was awarded the Distinguished Service Order in the 1917 Birthday Honours.", "link_mentions": [{"page": "Tennis at the 1908 Summer Olympics", "response": ["| Clement Cazalet  Charles Dixon"]}, {"page": "Reginald Doherty", "response": ["Doherty played in his first Wimbledon Championships in 1894 and lost in the first round to Clement Cazalet in four sets. In 1897 Doherty won his first singles Wimbledon title after beating reigning champion Harold Mahony in three straight sets (6–4, 6–4, 6–3). He successfully defended his title for the next three years (1898, 1899, 1900). In 1898 he did so by beating his brother in the Challenge Round in five sets (6–3, 6–3, 2–6, 5–7, 6–1). In 1901 he finally lost his Wimbledon crown when he was defeated in the Challenge Round by Arthur Gore in four sets (6–4, 5–7, 4–6, 4–6). He was also a runner-up at the US Championships in 1902 where he was beaten by the defending American champion William Larned in four sets (6–4, 2–6, 4–6, 6–8). Together with his brother Laurie he won eight Wimbledon Championships doubles titles and two US Championship doubles titles."]}, {"page": "Harold Kitson", "response": ["Kitson competed in the singles and doubles events at the 1908 Summer Olympics in London. In the singles event he had a bye in the first round and lost in straight sets to George Caridia in the second round. In the doubles he was partnered by Victor Gauntlett and reached the quarterfinals where Clement Cazalet and Charles P. Dixon proved too strong.  Kitson was more successful at the 1912 Summer Olympics in Stockholm winning two medals. He won the gold medal in the men's doubles event together with Charles Lindhurst Winslow, defeating the Austrian team Arthur Zborzil / Fritz Pipes  in the final. In the men's singles tournament he won a silver medal after losing in the final to his doubles partner in four sets."]}, {"page": "Tennis at the 1908 Summer Olympics – Men's outdoor doubles", "response": ["The men's outdoor doubles' was one of six lawn tennis events on the Tennis at the 1908 Summer Olympics programme. Nations could enter up to 6 pairs (12 players).Official Report, p. 35. The event was plagued by withdrawals, with only 12 teams competing of the 21 that entered. There were 24 players from 8 nations. The event was won by Reginald Doherty and George Hillyard after defeating James Cecil Parke and Major Ritchie in the final. Clement Cazalet and Charles P. Dixon took the bronze medal without a bronze medal match due to the withdrawal of an entire quadrant of the bracket. All three medal pairs were British. It was the second medal sweep in the men's doubles, after the United States did it in 1904, and it was also the last time that the men's doubles gold medal match was contested by pairs representing the same nation until Tokyo 2021. Doherty became the first man to win multiple men's doubles medals and gold medals, having earned gold with his brother Laurence Doherty in 1900."]}, {"page": "Great Britain at the 1908 Summer Olympics", "response": ["|bgcolor=cc9966| 3rd ||align=left| Clement Cazalet  Charles Dixon || Bye || Defeated  C. van Lennep/R. van Lennep || Defeated  Gauntlett/Kitson || Lost to  Hillyard/Doherty ||bgcolor=lightgray| Did not advance"]}, {"page": "Charles Cazalet", "response": ["#REDIRECT Clement Cazalet"]}, {"page": "Arthur J. Stanley", "response": ["As a tennis player he entered Wimbledon Championships from 1881 through 1885, and as a doubles player from 1885 to 1891, making a final comeback in doubles after a 9-year absence in 1901. His doubles partners were Claude Farrer 1885–1887, Clement Cazalet in 1888, A. Walker 1889, Herbert Wilberforce in 1890, Wilfred Milne in 1891, and H. Wilson in 1901."]}, {"page": "Cazalet", "response": ["* Clement Cazalet (1869–1950), British tennis player"]}, {"page": "Victor Gauntlett (tennis)", "response": ["He competed for the South Africa in the tennis event at the 1908 Summer Olympics where he took part in the men's singles and doubles event. In the singles competition he was beaten in the first round by Josiah Ritchie in straight sets. In the doubles he paired up with Harold Kitson and reached the quarterfinals which they lost in five sets to the British team of Clement Cazalet and Charles Dixon."]}, {"page": "1897 Wimbledon Championships – Men's doubles", "response": ["Laurence Doherty and Reginald Doherty defeated Clement Cazalet and Sydney Smith 6–2 7–5 2–6 6–2 in the All Comers' Final, and then defeated the reigning champions Herbert Baddeley and Wilfred Baddeley 6–4, 4–6, 8–6, 6–4 in the Challenge Round to win the Gentlemen' Doubles tennis title at the 1897 Wimbledon Championships.100 Years of Wimbledon by Lance Tingay, Guinness Superlatives Ltd. 1977"]}, {"page": "1902 Wimbledon Championships – Men's doubles", "response": ["Frank Riseley and Sydney Smith defeated Clement Cazalet and George Hillyard  7–5, 2–6, 3–6, 6–3, 6–1 in the All Comers' Final, and then defeated the reigning champions Laurence Doherty and Reginald Doherty  4–6, 8–6, 6–3, 4–6, 11–9 in the Challenge Round to win the Gentlemen' Doubles tennis title at the 1902 Wimbledon Championships.100 Years of Wimbledon by Lance Tingay, Guinness Superlatives Ltd. 1977"]}, {"page": "1906 Wimbledon Championships – Men's Doubles", "response": ["Frank Riseley and Sydney Smith defeated Clement Cazalet and George Simond 6–2, 6–2, 5–7, 6–4 in the All Comers' Final, and then defeated the reigning champions Laurence Doherty and Reginald Doherty 6–8, 6–4, 5–7, 6–3, 6–3 in the Challenge Round to win the Gentlemen' Doubles tennis title at the 1906 Wimbledon Championships.100 Years of Wimbledon by Lance Tingay, Guinness Superlatives Ltd. 1977"]}, {"page": "Tom Chaytor", "response": ["Tom Chaytor (1869 – 30 January 1951) was an Irish tennis player.  Two of his brothers also played tennis, including 1890 Wimbledon quarter finalist David Grainger Chaytor. Tom played at Wimbledon once in 1894, where he beat Horace Chapman, Clement Cazalet and Ernest George Meers, before handing a walkover to Wilfred Baddeley in the semi finals (he couldn't play because of badly blistered feet). In 1894, Chaytor reached the final of the Irish Open, where he faced Joshua Pim. Chaytor hit great passing shots and his backhand was winning him a lot of points. Pim won, but only by the score of 9–7 in the fifth set."]}, {"page": "South of England Championships", "response": ["| 1902 ||  Sydney Howard Smith  (4)  ||  Clement Cazalet * || 6–1, 3–6, 7–5, 6–4"]}, {"page": "Match of the Century (tennis)", "response": ["Tournament referee George Simond chose the match officials, all of whom were agreed upon by Lenglen and Wills. The chair umpire was George Hillyard. The six linesmen were Cyril Tolley, Clement Cazalet, Roman Najuch, Francis Towle, Charles Hope, and Reginald Dunkerley. All of the officials were British. Simond, Hillyard, Tolley, Najuch, Cazalet, and Dunkerley were tennis players themselves. Tolley was also a British Amateur golf champion, while Towle was a hotel magnate. There was no foot fault judge, possibly as a result of a series of foot faults being called against Lenglen in her semifinal match."]}, {"page": "Portuguese International Championships", "response": ["The first edition was won by George Hillyard, who beat Clement Cazalet in the semifinals and Harold Mahony in the final. The first official international edition took place in 1902, and was won by George Gordon Dagge. In the next editions also less known players started to participate. The prestigious newspaper Tiro e Sport opened its pages to announce the third edition of the tournament, reporting: \"It was with great anxiety that the results of these Championships were awaited, as, in addition to the old players, whose credits are already established, there were some relatively modern players and whose value was not at all known.\" The third international edition men's single tournament was won by the English R. Frazer, who defeated Dr. José Correia in the final. The same newspaper reported the next year that the competition was attended by the best Portuguese players and renowned foreign players. In 1905 the men's single tournament was won by Mr Lourdain (Jourdain). The first Portuguese to win the tournament was João de Sousa Macedo (Vila Franca) in 1907."]}]}}