{"wiki_id": "http://www.wikidata.org/entity/Q2972222", "itemLabel": "Ciaran Madden", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Ciaran_Madden", "wikipedia_page": {"main": "Ciaran Anne Magdalene Madden (born 27 December 1942) is a retired English stage, film, and television actress, who was professionally active from the late 1960s through the late 1990s.\nShe is a graduate of the Royal Academy of Dramatic Arts (RADA), and is an Associate Member of the academy.Madden is best known internationally for her multiple leading Agatha Christie, Shakespeare, and Tom Stoppard roles filmed for television, and for her performance as Marianne Dashwood in the 1971 BBC miniseries adaption of Jane Austen's Sense and Sensibility. She appeared in more than 30 television series, teleplays, made-for-television movies, and television miniseries, including a starring performance in the miniseries A Married Man (1984) opposite Anthony Hopkins. She also had major roles in five feature films, including Gawain and the Green Knight (1973), the cult horror film The Beast Must Die (1974), Spy Story (1976) and Swing Kids (1993).She had originally trained at the Ruskin School of Art at the University of Oxford prior to enrolling at RADA. In the late 1990s she gave up acting and returned to painting, focusing on portraits, and received a diploma from the Heatherley School of Fine Art in London. In 2001 she moved to Dorset with her second husband, Christian Tyler, whom she had married in 1987. Her previous husband, whom she had married in 1972, was John Patrick Scrivenor; they had a son born in late 1972.", "link_mentions": [{"page": "Return of the Saint", "response": ["| 1–12 || 26 November 1978 || \"Signal Stop\" || Ciaran Madden, Frederick Jaeger, Ian Cullen, Brian Glover, Sabina Franklyn, Ralph Arliss, Heather Wright, Royston Tickner, George Sweeney, Renu Setna, Graham Ashley, Kevin Selway"]}, {"page": "Ciarán", "response": ["* Ciaran Madden (born 1942), English actress"]}, {"page": "Play of the Month", "response": ["|Celia Johnson,Philip Latham,Richard Vernon,David Griffin,Ciaran Madden,Nigel Terry,Wensley Pithey", "|James Hazeldine,Ciaran Madden,Neil Daglish,Chrissy Iddon,Thorley Walters", "|Helen Mirren,Bernard Cribbins,Anthony Andrews,Amanda Barrie,Adrienne Corri,Ciaran Madden,John Nettleton,Michael Cochrane,Phil Daniels"]}, {"page": "Nikki van der Zyl", "response": ["*Gawain and the Green Knight (1973, revoiced Ciaran Madden)"]}, {"page": "The Dog It Was That Died", "response": [":Pamela Blair:  Ciaran Madden"]}, {"page": "The Beast Must Die (1974 film)", "response": ["The Beast Must Die is a British horror film directed by Paul Annett. The screenplay was written by Michael Winder, based on the short story \"There Shall Be No Darkness\" by James Blish, which was originally published in Thrilling Wonder Stories. The film stars Calvin Lockhart, Peter Cushing, Marlene Clark, Charles Gray, Anton Diffring, Ciaran Madden, Tom Chadbon, and Michael Gambon.Ed. Allan Bryce, Amicus: The Studio That Dripped Blood, Stray Cat Publishing, 2000 p 138-143", "Millionaire Tom Newcliffe (Calvin Lockhart) invites a group of people, along with his wife Caroline (Marlene Clark), to spend some time in his rural English mansion, where he reveals that one of them is a werewolf and therefore must be killed. The group is composed of disgraced diplomat Arthur Bennington (Charles Gray); Jan and Davina Gilmore (Michael Gambon and Ciaran Madden), a pianist and his ex-student, now his wife; Paul Foote (Tom Chadbon), an artist recently released from prison; and Professor Lundgren (Peter Cushing), an archaeologist and a lycanthropy enthusiast.", "*Ciaran Madden as Davina "]}, {"page": "Murder in the Mews", "response": ["Ciaran Madden as Lady Mayfield"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Ciaran Madden (Acting)"]}, {"page": "On the Razzle (play)", "response": ["Other cast members included Dinsdale Landen as Herr Zangler, Michael Kitchen as Melchior, Ciaran Madden as Mme. Knorr, Meg Wynne Owen as Frau Fischer, and Alfred Lynch as Weinberl. Peter Wood won the Laurence Olivier Award for Best Director."]}, {"page": "Miss Marple (TV series)", "response": ["|Gwen Watford, Moray Watson, Trudie Styler, Jess Conrad, Ciaran Madden, Keith Drinkel, Debbie Arnold, Frederick Jaeger, Valentine Dyall, Raymond Francis, David Horovitch, Anthony Smee, Andrew Cruickshank, Hugh Walters, Arthur Bostrom, Stephen Churchett, John Moffatt"]}, {"page": "Hamlet on screen", "response": ["|Michael Redgrave as PoloniusJohn Gielgud as the Ghost Margaret Leighton as GertrudeRichard Johnson as ClaudiusCiaran Madden as Ophelia"]}, {"page": "Jane Austen in popular culture", "response": ["| style=\"width:13%;\"|Ciaran Madden"]}, {"page": "List of British films of 1973", "response": ["|Gawain and the Green Knight||Stephen Weeks||Murray Head, Ciaran Madden, Nigel Green||Adventure||"]}, {"page": "Marianne Dashwood", "response": ["* Ciaran Madden in the 1971 British television serial."]}, {"page": "Gawain and the Green Knight (film)", "response": ["* Ciaran Madden as Linet  "]}, {"page": "Maigret (1992 TV series)", "response": ["* Ciaran Madden – Madame Maigret (series 1)"]}, {"page": "Bedtime Stories (1974 TV series)", "response": ["*Ciaran Madden as Clare Rawley"]}, {"page": "Oxbridge Blues", "response": ["*Ciaran Madden – Laura (\"Cheap Day\"); Rachel (\"Similar Triangles\")"]}, {"page": "Wolfshead: The Legend of Robin Hood", "response": ["Wolfshead: The Legend of Robin Hood is an adventure film directed by John Hough and starring David Warbeck, Ciaran Madden, Kathleen Byron, David Butler and Kenneth Gilbert. The film was the debut movie of actor David Warbeck as Robin Hood. The film was originally a 1969 television series pilot but was released in movie theatres in 1973, as a support feature to the musical Take Me High.  The film was also released on VHS under the title The Legend of Young Robin Hood.", "*Ciaran Madden as Lady Marian Fitzwalter"]}, {"page": "Ivanhoe (1997 TV series)", "response": ["* Ciaran Madden as Urfried"]}, {"page": "Spy Story (film)", "response": ["* Ciaran Madden ...  Marjorie "]}, {"page": "The Body in the Library (film)", "response": ["*Ciaran Madden as Adelaide Jefferson "]}, {"page": "Madadhan", "response": ["*Ciaran Madden (born 1942), English actress"]}, {"page": "Sense and Sensibility (1971 TV series)", "response": ["* Ciaran Madden – Marianne Dashwood (4 episodes, 1971)"]}, {"page": "My Son, My Son (TV series)", "response": ["* Ciaran Madden as Livia Vaynol"]}, {"page": "The Play on One", "response": ["Cast: James Fox, Lindsay Duncan, Ciaran Madden, Michael Keating, Anthony Dutton, Tom Knight, Alex Kingston, Nina Cowan, Eva Lohman, Chloe Salaman, Charlotte Attenborough, Michael Howe, Andrew Seear, Katherine Fahy, Frannie Parkes, Michael Fitzgerald, Andrew Barr and Edmund Dehn"]}, {"page": "Hero (Much Ado About Nothing)", "response": ["The first episode of the BBC Television Shakespeare, then known as the BBC Complete Works, was set to be a production of Much Ado About Nothing featuring Ciaran Madden as Hero. This 1978 episode was scrapped for unconfirmed reasons, though it was filmed and edited in its entirety. Much Ado About Nothing was reshot for the seventh series of the BBC Television Shakespeare with Katharine Levy as Hero."]}]}}