{"wiki_id": "http://www.wikidata.org/entity/Q2975534", "itemLabel": "Clare Peploe", "itemDescription": "Tanzanian British screenwriter and film director", "wikipedia_url": "https://en.wikipedia.org/wiki/Clare_Peploe", "wikipedia_page": {"main": "Clare Peploe (20 October 1941 – 23 June 2021) was a British-Italian screenwriter, producer, and film director.", "link_mentions": [{"page": "1987 in film", "response": ["* High Season, directed by Clare Peploe, starring Jacqueline Bisset, James Fox, Irene Papas, Kenneth Branagh, Lesley Manville, Robert Stephens, and Sebastian Shaw"]}, {"page": "1979 in film", "response": ["| La Luna || 20th Century Fox / Fiction Cinematografica || Bernando Bertolucci (director/screenplay); Giuseppe Bertolucci, Clare Peploe (screenplay); Jill Clayburgh, Matthew Barry, Veronica Lazar, Tomas Milian, Renato Salvatori, Fred Gwynne, Alida Valli, Elisabetta Campeti, Franco Citti, Roberto Benigni, Carlo Verdone, Peter Eyre || Drama || Live Action"]}, {"page": "1941 in film", "response": ["*October 20 – Clare Peploe, English-Italian screenwriter and director (died 2021)"]}, {"page": "Rik Mayall", "response": ["|Directed by Clare Peploe, nominated for an Oscar."]}, {"page": "Zabriskie Point (film)", "response": ["While in the United States for the 1966 premiere of his film Blowup, which had been a surprising box-office hit, Antonioni saw a short newspaper article about a young man who had stolen an aircraft and was killed when he tried to return it in Phoenix, Arizona. Antonioni took this as a thread, with which he could tie together the plot of his next film. After writing many drafts, he hired playwright Sam Shepard to write the script. Shepard, Antonioni, Italian filmmaker Franco Rossetti, Antonioni's frequent collaborator screenwriter Tonino Guerra and Clare Peploe (later to become the wife of Bernardo Bertolucci), worked on the screenplay."]}, {"page": "La Luna (1979 film)", "response": ["La Luna (released as in the United States as Luna) is a 1979 drama film directed by Bernardo Bertolucci from a screenplay co-written with his brother Giuseppe and Clare Peploe. The film concerns the troubled life of a teenage boy and his relationship with his parents, including an incestuous relationship with his opera singer mother. It stars Jill Clayburgh, Matthew Barry, Tomas Milian, Fred Gwynne, Veronica Lazăr, and Alida Valli."]}, {"page": "Besieged (film)", "response": ["Clare Peploe first suggested adapting James Lasdun's short story \"The Siege\", which first appeared in the author's 1985 book The Silver Age (published in the United States as Delirium Eclipse and Other Stories). Bertolucci conceived the project as a one-hour television movie, but expanded it for theatrical release after seeing the rushes projected on a large screen.  It nonetheless remained a low-budget film with a small crew and a brisk shooting schedule of 20-25 scenes each day, roughly four times the director's usual pace. By Peploe's and Bertolucci's own account, the project, Bertolucci's first love story, was a particularly apt one for them as a married couple. Peploe served as both screenwriter and, informally, as co-director."]}, {"page": "The Triumph of Love (2001 film)", "response": ["Triumph of Love is a 2001 romantic comedy film, based on Marivaux's 1732 play of the same name. It was directed by Clare Peploe, produced by her husband Bernardo Bertolucci, and stars Mira Sorvino and Ben Kingsley."]}, {"page": "Recorded Picture Company", "response": ["* Rough Magic (1995, directed by Clare Peploe) ", "* Triumph of Love (2002, directed by Clare Peploe) "]}, {"page": "2001 Toronto International Film Festival", "response": ["* The Triumph of Love by Clare Peploe"]}, {"page": "BAFTA Award for Best Short Film", "response": ["|Couples and Robbers || Clare Peploe "]}, {"page": "List of fantasy films of the 1990s", "response": ["|Rough Magic||Clare Peploe||Bridget Fonda, Russell Crowe, Jim Broadbent ||FranceUnited Kingdom||"]}, {"page": "List of British films of 1987", "response": ["|High Season||Clare Peploe ||Jacqueline Bisset, James Fox ||Romance/comedy||"]}, {"page": "List of British films of 1995", "response": ["|Rough Magic||Clare Peploe||Bridget Fonda, Russell Crowe||Comedy/drama||Co-production with France and the US"]}, {"page": "List of British films of 2001", "response": ["|The Triumph of Love||Clare Peploe||Mira Sorvino, Ben Kingsley||Comedy||Co-production with Italy and Germany"]}, {"page": "35th British Academy Film Awards", "response": ["* Couples and Robbers – Clare Peploe"]}, {"page": "58th Venice International Film Festival", "response": ["| colspan=2 data-sort-value=\"Triumph\"| The Triumph of Love || data-sort-value=\"Peploe\"| Clare Peploe || Italy, UK, Germany"]}, {"page": "54th Venice International Film Festival", "response": ["* Clare Peploe (UK) (short films)"]}, {"page": "High Season (film)", "response": ["High Season is a 1987 British romantic comedy film directed by Clare Peploe. It is a comedy about tourism, set on the Greek island of Rhodes; vacationers from rich countries taking over the most spectacular scenery at the most desirable times of the year. There are nine principal characters, a mixture of English, Greek, and a Greek-American. It was written by director Clare Peploe with her brother Mark."]}, {"page": "Rough Magic", "response": ["Rough Magic is a 1995 comedy film directed by Clare Peploe, starring Bridget Fonda and Russell Crowe. The screenplay was written by Robert Mundi, William Brookfield, and Clare Peploe. Rough Magic is based on the 1944 novel Miss Shumway Waves a Wand by British novelist James Hadley Chase; that novel had previously been adapted as the 1962 French-Argentine film Une blonde comme ça."]}, {"page": "Mark Peploe", "response": ["Mark Peploe (born 3 March 1943) is an English screenwriter and film director. He was the brother of Clare Peploe, and the brother-in-law of director Bernardo Bertolucci."]}, {"page": "Peploe", "response": ["*Clare Peploe (1941–2021), director, screenwriter and wife of Bernardo Bertolucci"]}, {"page": "Russell Crowe filmography", "response": ["| Clare Peploe"]}, {"page": "Nastro d'Argento for Best Screenplay", "response": ["** Bernardo Bertolucci & Clare Peploe – L'assedio"]}, {"page": "2021 in film", "response": ["| style=\"text-align:center;\"| 23 || Clare Peploe || style=\"text-align:center;\"| 79 || style=\"text-align:center;\"| English-Italian || style=\"text-align:center;\" | Screenwriter, Director || "]}, {"page": "2021 in the United Kingdom", "response": ["**Clare Peploe, Italian-born film director (High Season, The Triumph of Love) and screenwriter (Zabriskie Point) (b. 1942)."]}, {"page": "Christine Oestreicher", "response": ["Her 1987 production, High Season, featured a script by Mark Peploe and his sister Clare Peploe and starred Jacqueline Bisset, Kenneth Branagh and Irene Pappas. "]}, {"page": "Deaths in June 2021", "response": ["*Clare Peploe, 79, British-Italian film director (High Season, The Triumph of Love) and screenwriter (Zabriskie Point).Morta Clare Peploe, regista e moglie di Bernardo Bertolucci "]}]}}