{"wiki_id": "http://www.wikidata.org/entity/Q298846", "itemLabel": "Ann Widdecombe", "itemDescription": "British politician (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ann_Widdecombe", "wikipedia_page": {"main": "Ann Noreen Widdecombe  (born 4 October 1947) is a British politician, author and television personality. She was Member of Parliament (MP) for Maidstone and The Weald, and the former Maidstone constituency, from 1987 to 2010 and Member of the European Parliament (MEP) for South West England from 2019 to 2020. Originally a member of the Conservative Party, she joined the Brexit Party, later renamed Reform UK, in 2019.\nBorn in Bath, Somerset, Widdecombe read Latin at the University of Birmingham and later studied philosophy, politics and economics at Lady Margaret Hall, Oxford. She is a convert from Anglicanism to Roman Catholicism and was a member of the Conservative Christian Fellowship. She served as Minister of State for Employment from 1994 to 1995 and Minister of State for Prisons from 1995 to 1997. She later served in the Shadow Cabinet of William Hague as Shadow Secretary of State for Health from 1998 to 1999 and Shadow Home Secretary from 1999 to 2001. She was appointed to the Privy Council in 1997.\nWiddecombe stood down from the House of Commons at the 2010 general election. Since 2002, she has made numerous television and radio appearances, including as a television presenter. A prominent Eurosceptic, in 2016 she supported the Vote Leave campaign to withdraw the United Kingdom from the European Union (EU). Widdecombe returned to politics as the lead candidate for the Brexit Party in South West England at the 2019 European Parliament election, winning the seat in line with results nationally, serving until the country left the EU on 31 January 2020. In the general election of December 2019 – as with all other candidates for the Commons fielded by the Brexit Party – she did not win Plymouth Sutton and Devonport, but retained her deposit and came third.\nIdeologically, Widdecombe identifies herself as social conservative and stresses the importance of traditional values and conservatism. As a member of the House of Commons, she was known for opposing the legality of abortion, her opposition to LGBT legal rights such as an equal age of consent and the repeal of Section 28, her support for the retention of blasphemy laws and re-introduction of the death penalty, albeit applicable to a narrower class of murders than previously applied. She has a history of supporting rigorous laws on animal protection and opposition to fox hunting.", "link_mentions": [{"page": "And did those feet in ancient time", "response": ["In 2005 BBC Four produced Jerusalem: An Anthem For England highlighting the usages of the song/poem and a case was made for its adoption as the national anthem of England. Varied contributions come from Howard Goodall, Billy Bragg, Garry Bushell, Lord Hattersley, Ann Widdecombe and David Mellor, war proponents, war opponents, suffragettes, trade unionists, public schoolboys, the Conservatives, the Labour Party, football supporters, the British National Party, the Women's Institute, a gay choir, a gospel choir, Fat Les and naturists."]}, {"page": "October 4", "response": ["*  1947   – Ann Widdecombe, English politician, Shadow Secretary of State for Health"]}, {"page": "1947", "response": ["* October 4 – Ann Widdecombe, British politician"]}, {"page": "Anglo-Catholicism", "response": ["Some traditionalist Anglo-Catholics have left official Anglicanism to form \"continuing Anglican churches\" such as those in the Anglican Catholic Church and Traditional Anglican Communion. Others such as Ann Widdecombe have left Anglicanism altogether for the Roman Catholic or Eastern Orthodox churches, in the belief that liberal doctrinal changes in the Anglican churches have gone too far."]}, {"page": "Christian right", "response": ["In Northern Ireland, Ian Paisley led a Protestant fundamentalist party, the Democratic Unionist Party, which had a considerable influence on the province's culture.Andrew Vincent, Modern Political Ideologies. John Wiley & Sons, 2009.  (p. 325).Richard P. Davis, Mirror Hate: the Convergent Ideology of Northern Ireland paramilitaries, 1966–1992. Dartmouth, 1994.  . (p.80) For a time after the 2017 United Kingdom general election, the DUP provided confidence and supply to the governing Conservative Party, although this agreement provoked concern from socially liberal elements of the party about possible DUP influence on social policy. Although there is no evidence this occurred. Karen Armstrong has mentioned British evangelical leader Colin Urquhart as advocating positions similar to the Christian Right.Karen Armstrong, A History of God: the 4000-year quest of Judaism, Christianity, and Islam. Ballantine Books, 1994 p. 390. Some members of the Conservative Party and the Brexit Party including Ann Widdecombe, Jacob Rees-Mogg, Nadine Dorries, Matthew Offord and Peter Bone also support some of the values of the Christian right."]}, {"page": "Stephen Fry", "response": ["In 2009, The Guardian published a letter from Fry addressing his younger self, explaining how his future is soon to unfold, reflecting on the positive progression towards gay acceptance and openness around him, and yet not everywhere, while warning on how \"the cruel, hypocritical and loveless hand of religion and absolutism has fallen on the world once more.\" Later that year, he and Christopher Hitchens participated in an \"Intelligence Squared\" debate in which they argued against Ann Widdecombe and Archbishop John Onaiyekan, who supported the view that the Catholic Church was a force for good. Fry and Hitchens argued that the church did more harm than good, and were declared the victors after an audience vote. Fry attacked the Catholic Church's teachings on sexuality and denounced its wealth."]}, {"page": "If... (comic)", "response": ["* Michael Howard, portrayed as a vampire owing to comments about his apparent sinister personality by Tory Member of Parliament (MP) Ann Widdecombe and his ancestors being from Romania."]}, {"page": "Ms.", "response": ["Some etiquette writers and famous figures do not support the use of Ms, including Charles Kidd, the editor of Debrett's Peerage and Baronetage, who claims the usage is \"not very helpful\" and that he had been \"brought up to address a married woman as Mrs John Smith, for example\". Debrett's itself, concerning the case of a married woman who chooses not to take her husband's name, states, \"The ugly-sounding Ms is problematic. Although many women have assumed this bland epithet, it remains incorrect to use it when addressing a social letter.\" The former British Conservative Party Member of Parliament (MP) Ann Widdecombe has stated, \"I can't see the point of Ms and I don't see it as an issue\", whilst author and journalist Jessica Fellowes describes the title Ms as \"ghastly\". The Queen's English Society has criticised the use of Ms as \"an abbreviation that is not short for anything\", describing it as a \"linguistic misfit [that] came about because certain women suddenly became sensitive about revealing their marital status\"."]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Ann Widdecombe", "| Ann Widdecombe"]}, {"page": "Lady Margaret Hall, Oxford", "response": ["The interim principal of the college for the period from October 2021 to September 2022 is Christine Gerrard. Notable alumni and students of Lady Margaret Hall include Benazir Bhutto, Michael Gove, Nigella Lawson, Josie Long, Ann Widdecombe and Malala Yousafzai.", "File:Widdebookclub (cropped).jpg|Ann Widdecombe, politician ", "* Ann Widdecombe, politician"]}, {"page": "Have I Got News for You", "response": ["* In November 2007, Ann Widdecombe criticised the programme for the involvement of Jimmy Carr as Hislop's teammate, vowing not to appear again after admitting she nearly \"walked out\" because of the comedian's risqué material during recording. "]}, {"page": "Michael Howard", "response": ["Shortly after the 1997 Newsnight interview, Ann Widdecombe, his former minister of state at the Home Office, made a statement in the House of Commons about the dismissal of then-Director of the Prison Service, Derek Lewis, and remarked of Howard that there is \"something of the night\" about him. This much quoted comment is thought to have contributed to the failure of his 1997 bid for the Conservative Party leadership, including by Howard and Widdecombe, Extract from Crick's book In search of Michael Howard. and led to him being caricatured as a vampire, in part due to his Romanian ancestry. Such characterisations caused discontent among members of Britain's Jewish community."]}, {"page": "Maidstone", "response": ["The town is divided between the constituencies of Maidstone and the Weald and Faversham and Mid Kent. Before 1997 Maidstone was in the county constituency of Maidstone. The Member of Parliament (MP) for Maidstone and the Weald is Conservative Helen Grant. Previous MPs include Ann Widdecombe, Sir John Wells, Sir Alfred Bossom and Benjamin Disraeli. Since 2015 the MP for Faversham and Mid Kent has been Conservative Helen Whately. Prior to the 2015 election, the MP was Conservative Sir Hugh Robertson."]}, {"page": "University of Birmingham", "response": ["The university's alumni in the sphere of British government and politics include: British Prime Ministers Stanley Baldwin and Neville Chamberlain; Chief Minister of Gibraltar Joe Bossano; British cabinet minister and UN Under-Secretary-General Baroness Amos; Cabinet Ministers Julian Smith and Hilary Armstrong; British ministers of state Ann Widdecombe, Richard Tracey, Derek Fatchett, and Anna Soubry; British High Commissioner to New Zealand and Ambassador to South Africa Sir David Aubrey Scott; Governor of the Turks and Caicos Islands Nigel Dakin; Welsh Assembly Government minister Jane Davidson; and UN weapons inspector David Kelly."]}, {"page": "Right Now! (magazine)", "response": ["Prominent Conservative politicians who contributed to, or were interviewed by, Right Now! include Norman Tebbit, Ann Widdecombe, John Redwood, Teddy Taylor, Teresa Gorman and Bill Cash."]}, {"page": "Christopher Hitchens", "response": ["That year, Hitchens began a series of written debates on the question \"Is Christianity Good for the World?\" with Christian theologian and pastor Douglas Wilson, published in Christianity Today magazine. This exchange eventually became a book with the same title published in 2008. During their promotional tour of the book, they were accompanied by the producer Darren Doane's film crew. Thence Doane produced the film Collision: Is Christianity GOOD for the World?, which was released on 27 October 2009.http://www.collisionmovie.com/  On 4 April 2009, Hitchens debated William Lane Craig on the existence of God at Biola University. On 19 October 2009, Intelligence Squared explored the question \"Is the Catholic Church a force for good in the world?\". John Onaiyekan and Ann Widdecombe argued that it was, while Hitchens joined Stephen Fry in arguing that it was not. The latter side won the debate according to an audience poll. On 26 November 2010, Hitchens appeared in Toronto, Ontario, at the Munk Debates, where he debated religion with former British Prime Minister Tony Blair, a convert to Roman Catholicism. Blair argued religion is a force for good, while Hitchens argued against that. Hitchens also debated with Larry Taunton, an evangelical Christian friend of his, on \"God or no God,\" and Larry wrote a book about his friendship with Hitchens."]}, {"page": "Peter Tatchell", "response": ["Channel 4 indicated in June 2010 that Tatchell would be the presenter of a documentary film examining \"the current Pope's teachings throughout the world\". The plans sparked criticism from some prominent British Catholics including Conservative politician Ann Widdecombe, who accused Channel 4 of trying to \"stir up controversy\". Tatchell asserted that the documentary \"will not be an anti-Catholic programme\"."]}, {"page": "Jan Ravens", "response": ["Ravens has regularly imitated Newsnight host Kirsty Wark, Charlotte Green formerly of BBC Radio 4 (with double entendres), Ellen MacArthur (who regularly bursts into tears), Nigella Lawson (with double entendres), Ann Widdecombe (narrating fanciful racy storylines in her novels), Patricia Routledge's Hyacinth Bucket, Queen Elizabeth II, a chirpy Sandi Toksvig, a stern-faced Gillian McKeith, Sophie Raworth (with a bemused school-girl grin) and Fiona Bruce (with barely concealed filthy invitations) of BBC News, Anne Robinson of The Weakest Link, Lesley Garrett (often referring to her generous cleavage), Hillary Clinton, Theresa May and the Geordie-accented Ruth Archer from the BBC Radio 4 series The Archers.  She also appeared as the then Prime Minister Margaret Thatcher in an episode of Are You Being Served? although only her voice is heard."]}, {"page": "David Bellotti", "response": ["Bellotti first contested the Eastbourne seat at the 1979 general election, subsequently fighting Lewes in the 1983 and 1987 general elections under the Liberal banner. He then won the parliamentary seat of Eastbourne for the Liberal Democrats in the 1990 by-election following the assassination of Conservative MP Ian Gow by the Provisional Irish Republican Army (IRA). He became the first person to be elected as a Liberal Democrat MP after the party was formed in 1988 by a merger of the Liberal Party and the SDP. Bellotti's win was both unexpected and controversial, with Conservative MP Ann Widdecombe noting: \"Bellotti is the innocent beneficiary of murder. I suspect as last night as the Liberal Democrats were toasting their success, in its hideouts the IRA were doing the same thing\".The Guardian, 20 October 1990 After Bellotti's win, future by-elections resulting from assassinations of MPs saw most parties decline to contest the seat.  The shock defeat contributed to the end of Margaret Thatcher's premiership in November 1990 as Conservative MPs worried if they could hold their seats at a general election if she remained prime minister."]}, {"page": "2DTV", "response": ["* Jan Ravens – Cherie Blair, Ann Widdecombe, Queen Elizabeth, Camilla Parker Bowles, Princess Anne, Fergie, Geri Halliwell, Victoria Beckham, Anne Robinson, Jordan, Heather Graham, Natasha Kaplinsky, Erin Brockovich, Amy Adams, Björk, Wendy Wilson, Carol \"Smiley\" Smillie, Natasha Richardson, Jennifer Lopez, Lindsay Lohan, Rita Wilson, Kate Middleton, Madonna, Davina McCall, Kylie Minogue, Sharon Osbourne, Kelly Osbourne, Jade Goody, Andie MacDowell, Kim Woodburn, Aggie MacKenzie, Nigella Lawson, Dina Lohan, Jamie Lee Curtis, Queen Mother, Judy Finnigan, Angelina Jolie, Sandra Bullock, Daryl Hannah, Sally Field, Diane Keaton"]}, {"page": "Stafford", "response": ["Stafford Gatehouse Theatre is the town's main entertainment and cultural venue. Its Met Studio is a dedicated to stand-up comedy and alternative live music. There is an art gallery in the Shire Hall. Staffordshire County Showground, just outside the town, holds many national and local events. The annual Shakespeare Festival at Stafford Castle has attracted many notable people, including Frank Sidebottom and Ann Widdecombe."]}, {"page": "Virginia Bottomley", "response": ["Bottomley and Ann Widdecombe have been listed as co-founders of the pro-nuclear Women and Families for Defence group."]}, {"page": "Daily Express", "response": ["* Ann Widdecombe, Writer."]}, {"page": "David Amess", "response": ["A procession and memorial service took place in Southend on 22 November 2021. The private service, attended by family, was held at St Mary's Church, the Church of England parish church in Prittlewell. The service was led by the Reverend Paul Mackay and Monsignor Kevin William Hale. A family statement was read by the former Conservative MP Ann Widdecombe. Afterwards his casket processed through the streets in a horse-drawn hearse. The following day a funeral service was held at Westminster Cathedral. Prime Minister Boris Johnson joined former prime ministers, the Speaker of the House Lindsay Hoyle and the Labour leader Sir Keir Starmer at the service. A message from Pope Francis was delivered by Archbishop Claudio Gugerotti, the Apostolic Nuncio to Great Britain."]}, {"page": "List of current members of the British Privy Council", "response": ["| Ann Widdecombe"]}, {"page": "John Bercow", "response": ["In November 2003, the new Conservative leader Michael Howard appointed Bercow as Shadow Secretary of State for International Development. However, he went on to clash with Howard over taxes, immigration and Iraq,Bercow Says He's Relieved to Quit U.K. Conservatives Bloomberg L.P., 26 June 2009 and was sacked from the front bench in September 2004 after telling Howard that Ann Widdecombe was right to have said that there was \"something of the night about him\".Profile: Commons Speaker, John Bercow , The Guardian, 22 June 2009 Bercow has a long-standing interest in Burma and frequently raised issues of democracy and genocide in the country. In 2006 he was made a patron of the Tory Reform Group.About People page , Tory Reform Group In 2001, he supported the ban on MPs becoming members of the Monday Club."]}]}}