{"wiki_id": "http://www.wikidata.org/entity/Q2982426", "itemLabel": "Coleen Nolan", "itemDescription": "English singer, author, beauty queen and television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Coleen_Nolan", "wikipedia_page": {"main": "Coleen Patricia Nolan (born 12 March 1965) is an English singer, television personality, and author. She was a member of the girl group The Nolans from 1980 to 1994, in which she sang with her sisters. Since 2000, Nolan has been a regular panellist on the ITV talk show Loose Women.\nFrom 2001 to 2002, Nolan co-presented the ITV daytime show This Morning, and later returned to the show from 2010 to 2012 as a presenter of the interactive hub segments. In 2009, she competed in the fourth series of the ITV show Dancing on Ice, in which she finished in fourth place. In 2012, Nolan appeared in the tenth series of the Channel 5 reality series Celebrity Big Brother, finishing as runner-up. She returned to Celebrity Big Brother in 2017 and won the nineteenth series.", "link_mentions": [{"page": "Blackpool", "response": ["* Coleen Nolan – singer and television presenter"]}, {"page": "Jason Donovan", "response": ["In 2009, Donovan performed as Tick (Mitzi) in the London stage musical production of Priscilla Queen of the Desert at the Palace Theatre. Also in 2009, Donovan began appearing in television commercials (with Kerry Katona and Coleen Nolan) for the frozen food supermarket chain Iceland in the UK."]}, {"page": "Lynda Bellingham", "response": ["Bellingham joined Loose Women on 10 April 2007, appearing alongside Carol McGiffin and Coleen Nolan, and continued as a regular on the show until 2011. In all, Bellingham made more than 300 appearances on the show, including a special appearance in 2014 shortly before her death. Two editions of Loose Women were dedicated to Bellingham after her death."]}, {"page": "Iceland (supermarket)", "response": ["Iceland Foods historically advertised with the slogan \"Mums Love It\", which was changed to \"Are we doing a deal or are we doing a deal?\" and \"Feel the deal\" in the early 2000s. From the mid-2000s ads featuring Kerry Katona saw a return to a slogan more traditionally associated with Iceland Foods – \"So that's why mums go to Iceland!\" Katona was dropped as the face of Iceland Foods in 2009, after a tabloid newspaper published pictures allegedly showing her taking cocaine. She was succeeded by Coleen Nolan, Ellie Taylor, Stacey Solomon and Jason Donovan, who has also frequently appeared in the company's Christmas advertisement campaigns. Peter Andre is the current face of the firm. The current main tagline is the truncated \"That's why mums go to Iceland\". Store fronts also bear the tagline \"food you can trust\", and carrier bags in stores bear the tagline \"the frozen food experts\". Since May 2015, the TV adverts have used the tagline and hashtag of \"Power Of Frozen\" and are fronted and voiced over by Peter Andre."]}, {"page": "List of sibling pairs", "response": ["* Linda, Bernie and Coleen Nolan; singers"]}, {"page": "John Leslie (TV presenter)", "response": ["From series 11 in 1999 Leslie, alongside Fern Britton, was a regular presenter of the Friday edition. When Richard Madeley and Judy Finnigan departed the show in 2001, they were replaced by Coleen Nolan and Twiggy, with Britton and Leslie remaining on Fridays. However, Nolan and Twiggy proved less popular with viewers, so Britton and Leslie took on the full job of presenting the show, bringing the ratings back up to around one million. In 2002, after allegations of sexual offences were made in the press against Leslie, he was dismissed from the programme and replaced by Phillip Schofield from Mondays to Thursdays and by Eamonn Holmes on Fridays (with Ruth Langsford)."]}, {"page": "McFly", "response": ["When UK pop/R&B group Rixton were asked which bands they had looked up to when they were younger, Jake Roche said, \"I listened to a lot of McFly when I was growing up. I was a part of that era.\" He continued \"these guys came out with instruments and they played and wrote all their own stuff and I was like, that's great – I want to do that.\" Band member Charley Bagnall agreed, saying, \"McFly was a huge part of my life.\" Roche's mother, English singer and TV presenter Coleen Nolan, said, \"To me he's still that little boy I watched singing and dancing around to McFly records...I took him to their show in Manchester when he was nine or 10 and he said to me, 'Mum, one day that will be me up there.'\""]}, {"page": "Shane Richie", "response": ["Richie married Coleen Nolan in 1990 and together they had two sons, Shane Roche Jr. (born 1988) and Jake Roche (born 1992). They divorced in 1999. He has three children with wife Christie."]}, {"page": "The Nolans", "response": ["The reunion however sparked a split in the family as Anne has appeared in the press stating that she was excluded from the tour, and also issued a statement on her official website, which includes the comment: \"they are not my sisters anymore\". Denise also issued a statement in support of Anne, claiming that the real reason for the reunion was due to some of the sisters being in financial difficulty.  Bernie and Maureen later made amends with Anne and Denise, but Bernie stated there would not be a reconciliation with Coleen and Linda.Bernie and Coleen Nolan on Lorraine ITV1 28 March 2011", "*Coleen Nolan (1980–94, 2009, 2020–present)"]}, {"page": "Charity record", "response": ["|\"NHS Voices\": Alexandra Burke, Ali Campbell, Astro, Aston Merrygold, Ben Willis, Beverley Knight, Blue, Chris Difford, Coleen Nolan, Danny Jones, Dennis Greaves, Engelbert Humperdinck, Gabrielle, Gary Stringer, Glenn Tilbrook, Guy Garvey, HRVY, Jack and Tim, Lewisham and Greenwich NHS Choir, Louisa Johnson, Marina and the Diamonds, Mark Feltham, Mark King, Myleene Klass, Nile Rodgers, Rick Astley, Seal, Simon Hanson, Tom Smith, Tony Hadley, Una Healy"]}, {"page": "Celebrity Fit Club", "response": ["*Coleen Nolan (singer and presenter)"]}, {"page": "Tubridy Tonight", "response": ["| 10 March 2007 || Louis Walsh, Cleo Rocos, Dáithí Ó Sé, Aoife Ní Thuraisc and Sinéad Ní Loideáin, Coleen Nolan || || The Divine Comedy || \"A Lady of a Certain Age\" || Details "]}, {"page": "The Wright Stuff", "response": ["Matthew Wright hosted the show from when it began in 2000 until he left in 2018. When he went on holiday or was ill, others filled in for him. Many of the regular panel members hosted the show in its early stages such as James O'Brien, Janet Ellis, Kate Silverton, Henry Bonsu, Anne Diamond, Vanessa Feltz, Lowri Turner, Matt Allwright, Kaye Adams, Nihal Arthenayke, Hardeep Singh Kohli, Christopher Biggins and Andrew Castle. Occasionally new guest hosts were drafted in, Simon Hardeman, Jane Moore, Anneka Rice, Piers Morgan, Simon Mayo, Richard Bacon, Stephen Nolan, Coleen Nolan, Fiona Phillips, Donal MacIntyre, Penny Smith and Claudia-Liza Vanderpuije have hosted."]}, {"page": "This Morning (TV programme)", "response": ["The 'Hub' interactive segment was heavily featured from 2010 until 2014. Presenters included Jeff Brazier (2013–14), Jenni Falconer (2013–14), Stephen Mulhern (2011–2014) Rylan Clark (2013–14), Emma Willis (2012–2014), Coleen Nolan (2010–2012), Samanthi Jayawardena (2010–2012) and Matt Johnson (2010–2013).ITV expands cross-platform offering for This Morning  New Media Age, 2 September 2010", "From October 1988 to July 2001, This Morning was presented by husband and wife Richard Madeley and Judy Finnigan. From 1998 onwards, they hosted only the Monday to Thursday editions, with regular guest presenters hosting on Fridays: during the tenth series Caron Keating and Ross Kelly presided, and from series 11 in 1999 Fern Britton and John Leslie were regular presenters of the Friday show. When Madeley and Finnigan left the show in 2001, they were replaced by Coleen Nolan and Twiggy, with Fern Britton and John Leslie remaining on Fridays. However, Nolan and Twiggy proved less popular with viewers: Twiggy was later axed, whilst Nolan presented until the end of 2001 with Leslie, and was subsequently replaced by Britton."]}, {"page": "June Sarpong", "response": ["After appearing alongside Ruth Langsford, Coleen Nolan and Janet Street-Porter on 23 March 2015, as a guest panellist, Sarpong later appeared as a guest panellist a further three times on 16 April, 17 April and 1 May. Since appearing on the programme again on 15 May, she became a regular panellist, initially as cover for Sherrie Hewson, while Hewson was filming Benidorm, later on 21 July 2015, Sarpong became a regular.  She left the show in December 2016 and made 46 appearances in total."]}, {"page": "Loose Women", "response": ["Coleen Nolan, Sawalha and Moore returned as panellists during 2013, whilst Adams returned as presenter. Langsford also rejoined the programme as a presenter in 2014.", "| style=\"text-align:center\" |Coleen Nolan"]}, {"page": "Have I Been Here Before?", "response": ["|Coleen Nolan"]}]}}