{"wiki_id": "http://www.wikidata.org/entity/Q2981095", "itemLabel": "William Jackson Bean", "itemDescription": "British botanist (1863-1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Jackson_Bean", "wikipedia_page": {"main": "William Jackson Bean (26 May 1863 in Yorkshire – 19 April 1947 in Kew, Surrey) was a British botanist and plantsman, who was curator of Kew Gardens from 1922 to 1929. He was responsible for some of the present collections of trees and woody plants there.\nBean began his career at Kew Gardens as a trainee gardener. He remained at Kew for over 45 years, reaching the position of curator in 1922. Bean wrote a history of Kew Gardens, which was published in 1908.He wrote the first two-volume edition of the reference work Trees and Shrubs Hardy in the British Isles, which was published in 1914. A revised four-volume edition of this work remains a standard reference work for woody plants grown in Britain today.Bean retired from Kew in 1929. In his retirement Bean wrote three other books: Shrubs for Amateurs in 1924, Ornamental Trees for Amateurs in 1925, and Wall Shrubs and Hardy Climbers in 1939. He also revised and expanded Trees and Shrubs several times.\nBean was awarded the Victoria Medal of Honour in 1917 and the Veitch Memorial Medal of the Royal Horticultural Society in 1922. He was awarded the Royal Victorian Order in 1936.His son George Ewart Bean (1903-1977) was a leading authority on the classical heritage of Turkey.", "link_mentions": [{"page": "Victoria Medal of Honour", "response": ["** William Jackson Bean (1863–1947)"]}, {"page": "Veitch Memorial Medal", "response": ["* 1922 : William Jackson Bean (1863–1947)"]}, {"page": "Bean (name)", "response": ["* William Jackson Bean, botanist"]}, {"page": "W. J. Bean", "response": ["#redirect William Jackson Bean"]}, {"page": "W J Bean", "response": ["#redirect William Jackson Bean"]}, {"page": "Pierre-Paul Saunier", "response": ["To Michaux, and a much lesser extent Saunier, is attributed the first introduction of trees and shrubs from eastern North America. To Saunier in particular is attributed the introduction to cultivation of the Chinquapin, Castanea pumila, and Bean Tree Catalpa bignonioides  although William Jackson Bean in his Trees and Shrubs Hardy in the British Isles refers to its introduction to cultivation, at least in the British Isles, in 1729. In Volume One of the same work Bean notes that, at that time of his writing, some of the trees raised from the seed of Michaux's collections in America could still be seen in the gardens of Petit Trianon and Arboretum de Balaine."]}, {"page": "George Ewart Bean", "response": ["George Ewart Bean (1903 – 7 December 1977) was an English archaeologist and writer who specialized in classical Turkey. His father William Jackson Bean was a botanist, author, and curator of Kew Gardens. Bean was educated at St Paul's School, London from 1916 to 1921. He attended Pembroke College, Cambridge and won the Schoolbred Scholarship and the John Stewart of Rannoch Scholarship for Classics."]}, {"page": "1936 Birthday Honours", "response": ["* William Jackson Bean, ."]}, {"page": "List of botanists by author abbreviation (B)", "response": ["* Bean – William Jackson Bean (1863–1947)"]}, {"page": "William Bean (disambiguation)", "response": ["*William Jackson Bean (1863–1947), British botanist"]}]}}