{"wiki_id": "http://www.wikidata.org/entity/Q29843583", "itemLabel": "Jack Boles", "itemDescription": "British civil servant and colonial administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Boles", "wikipedia_page": {"main": "Sir John Dennis Boles  (25 June 1925 – 1 July 2013), was a British Colonial Service officer in North Borneo, and later in England worked for the National Trust, serving as its Director-General from 1975 to 1983.", "link_mentions": [{"page": "List of political families in the United Kingdom", "response": ["***Jack Boles (1925–2013), High Sheriff of Devon 1993–1994."]}, {"page": "Nick Boles", "response": ["Boles was born on 2 November 1965, the son of Sir Jack Boles, who was later Director-General of the National Trust from 1975 to 1983. He is the great-nephew of Conservative MP Dennis Boles.MPs related to other current or former Members in the 2017 Parliament, House of Commons Library, 26 September 2017."]}, {"page": "Dudley Fishburn", "response": ["Educated at Eton and Harvard College, from which he graduated in American history and literature and was a member of the Harvard Lampoon, he has an honorary Doctorate from the Open University and the University of Reading. He was married to Victoria Boles, who served as High Sheriff of Berkshire in 2016, a daughter of Sir Jack Boles and sister of one-time Conservative MP Nick Boles, by whom he has four children. Alice, the eldest, works as a journalist on the Financial Times; Honor was an assistant at Downing Street, having been David Cameron's diary secretary."]}, {"page": "Geoffrey Waldegrave, 12th Earl Waldegrave", "response": ["*Lady Anne Waldegrave (b. 24 December 1937) she married Sir Jack Boles (25 June 1925 – 1 July 2013) in 1971. "]}, {"page": "West Downs School", "response": ["*Sir Jack Boles, MBE, director-general of National TrustSir Jack Boles (obituary) in The Daily Telegraph dated 1 July 2013. Retrieved 2 April 2019"]}, {"page": "List of Old Wykehamists", "response": ["*  Jack Boles, Director-General of the National Trust"]}, {"page": "Talaton", "response": ["*Sir Jack Boles (1925–2013), a Colonial Service officer in North Borneo and later Director-General of the National Trust, lived at Talaton as a child and returned in his retirement.Sir Jack Boles (obituary) in The Daily Telegraph dated 1 July 2013"]}, {"page": "Boles (surname)", "response": ["*Jack Boles (1913–2013), British Colonial civil servant and administrator"]}, {"page": "Deaths in July 2013", "response": ["*Jack Boles, 88, British Colonial Service officer.[Sir Jack Boles (obituary) in The Daily Telegraph dated 1 July 2013, accessed 2 April 2019]"]}, {"page": "District officer", "response": ["*Sir Jack Boles (1925–2013), a District Officer and District Commissioner in North Borneo,  later Director-General of the National Trust"]}]}}