{"wiki_id": "http://www.wikidata.org/entity/Q299938", "itemLabel": "Halford Mackinder", "itemDescription": "English geographer, academic, and politician (1861-1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Halford_Mackinder", "wikipedia_page": {"main": "Sir Halford John Mackinder (15 February 1861 – 6 March 1947) was an English geographer, academic and politician, who is regarded as one of the founding fathers of both geopolitics and geostrategy. He was the first Principal of University Extension College, Reading (which became the University of Reading) from 1892 to 1903, and Director of the London School of Economics from 1903 to 1908. While continuing his academic career part-time, he was also the Member of Parliament for Glasgow Camlachie from 1910 to 1922. From 1923, he was Professor of Geography at the London School of Economics.", "link_mentions": [{"page": "Central Asia", "response": ["The region, along with Russia, is also part of \"the great pivot\" as per the Heartland Theory of Halford Mackinder, which says that the power which controls Central Asia—richly endowed with natural resources—shall ultimately be the \"empire of the world\".For an analysis of Mackinder's approach from the perspective of \"Critical Geopolitics\" look: "]}, {"page": "Europe", "response": ["Four years later, in 1725, Philip Johan von Strahlenberg was the first to depart from the classical Don boundary by proposing that mountain ranges could be included as boundaries between continents whenever there were deemed to be no suitable waterways, the Ob and Irtysh rivers notwithstanding. He drew a new line along the Volga, following the Volga north until the Samara Bend, along Obshchy Syrt (the drainage divide between Volga and Ural), and then north along Ural Mountains. This was endorsed by the Russian Empire and introduced the convention that would eventually become commonly accepted, but not without criticism by many modern analytical geographers like Halford Mackinder who saw little validity in the Ural Mountains as a boundary between continents."]}, {"page": "Empire", "response": ["The imperial expansion filled the world circa 1900. Two famous contemporary observers—Frederick Turner and Halford Mackinder described the event and drew implications, the former predicting American overseas expansion and the latter stressing that the world empire is now in sight.Halford J. Mackinder, The Geographical Pivot of History, J. Murray, London, 1904."]}, {"page": "Imperialism", "response": ["A controversial aspect of imperialism is the defense and justification of empire-building based on seemingly rational grounds. In ancient China, Tianxia denoted the lands, space, and area divinely appointed to the Emperor by universal and well-defined principles of order. The center of this land was directly apportioned to the Imperial court, forming the center of a world view that centered on the Imperial court and went concentrically outward to major and minor officials and then the common citizens, tributary states, and finally ending with the fringe \"barbarians\". Tianxia's idea of hierarchy gave Chinese a privileged position and was justified through the promise of order and peace. J. A. Hobson identifies this justification on general grounds as: \"It is desirable that the earth should be peopled, governed, and developed, as far as possible, by the races which can do this work best, i.e. by the races of highest 'social efficiency'\".Hobson, J.A. \"Imperialism: a study.\" Cosimo, Inc., 2005. p. 154 Many others argued that imperialism is justified for several different reasons. Friedrich Ratzel believed that in order for a state to survive, imperialism was needed. Halford Mackinder felt that Great Britain needed to be one of the greatest imperialists and therefore justified imperialism. The purportedly scientific nature of \"Social Darwinism\" and a theory of races formed a supposedly rational justification for imperialism. Under this doctrine, the French politician Jules Ferry could declare in 1883 that \"Superior races have a right, because they have a duty. They have the duty to civilize the inferior races.\" The rhetoric of colonizers being racially superior appears to have achieved its purpose, for example throughout Latin America \"whiteness\" is still prized today and various forms of blanqueamiento (whitening) are common.", "The Royal Geographical Society of London and other geographical societies in Europe had great influence and were able to fund travelers who would come back with tales of their discoveries. These societies also served as a space for travellers to share these stories. Political geographers such as Friedrich Ratzel of Germany and Halford Mackinder of Britain also supported imperialism. Ratzel believed expansion was necessary for a state's survival while Mackinder supported Britain's imperial expansion; these two arguments dominated the discipline for decades."]}, {"page": "Mountaineering", "response": ["   In 1879–1880 the exploration of the highest Andes in South America began when English mountaineer Edward Whymper climbed Chimborazo () and explored the mountains of Ecuador. It took until the late 19th century for European explorers to penetrate Africa. Mount Kilimanjaro in Africa was climbed in 1889 by Austrian mountaineer Ludwig Purtscheller and German geologist Hans Meyer, Mount Kenya in 1899 by Halford Mackinder."]}, {"page": "1904", "response": ["* January 25 – Halford Mackinder presents a paper on \"The Geographical Pivot of History\" to the Royal Geographical Society of London in which he formulates the Heartland Theory, originating the study of geopolitics., cited in "]}, {"page": "Lincolnshire", "response": ["* Halford Mackinder (1861–1947), geographer"]}, {"page": "Zbigniew Brzezinski", "response": ["Zbigniew Kazimierz Brzezinski ( , ; March 28, 1928 – May 26, 2017), or Zbig, was a Polish-American diplomat and political scientist. He served as a counselor to President Lyndon B. Johnson from 1966 to 1968 and was President Jimmy Carter's National Security Advisor from 1977 to 1981. As a scholar, Brzezinski belonged to the realist school of international relations, standing in the geopolitical tradition of Halford Mackinder and Nicholas J. Spykman,Sabine Feiner: Weltordnung durch US-Leadership? Die Konzeption Zbigniew K. Brzezinskis. Westdeutscher Verlag, Wiesbaden 2001 while elements of liberal idealism have also been identified in his outlook. Brzezinski was the primary organizer of The Trilateral Commission.Sklar, Holly. \"Founding the Trilateral Commission: Chronology 1970-1977\". Trilateralism: The Trilateral Commission and Elite Planning for World Management. Boston: South End Press, 1980.    604 pages. Excerpts available."]}, {"page": "London School of Economics", "response": ["|1903–1908|| Sir Halford Mackinder "]}, {"page": "Bush Doctrine", "response": ["Experts on geopolitical strategy note that Halford Mackinder's theories in \"The Geographical Pivot of History\" about the \"Heartland\" and world resource control are still as valid today as when they were formulated.", "In his 2007 book In the Defense of the Bush Doctrine, Robert G. Kaufman wrote: \"No one grasped the logics or implications of this transformation better than Halford Mackinder. His prescient theories, first set forth in Geographical Pivot of History, published in 1904, have rightly shaped American grand strategy since World War II. Mackinder warned that any single power dominating Eurasia, \"the World Island\", as he called it, would have the potential to dominate the world, including the United States.\" Kaufman is a political scientist, public policy professor and member of The Shadow Financial Regulatory Committee. He said in an interview about the book: \"I wrote this book because of my conviction that the Bush Doctrine has a more compelling logic and historical pedigree than people realize.\""]}, {"page": "Mount Kilimanjaro", "response": ["The German missionaries Johannes Rebmann of Mombasa and Krapf were the first Europeans known to have attempted to reach the mountain. According to English geographer Halford Mackinder and English explorer Harry Johnston, Rebmann in 1848 was the first European to report the existence of Kilimanjaro. Hans Meyer has claimed that Rebmann first arrived in Africa in 1846 and quotes Rebmann's diary entry of 11 May 1848 as saying, "]}, {"page": "Karl Haushofer", "response": ["Beyond being an economic concept, pan-regions were a strategic concept as well. Haushofer acknowledges the strategic concept of the Heartland Theory put forward by the British geopolitician Halford Mackinder.Dorpalen, p.218 If Germany could control Eastern Europe and subsequently Russian territory, it could control a strategic area to which hostile seapower could be denied.Mackinder, p.78 Allying with Italy and Japan would further augment German strategic control of Eurasia, with those states becoming the naval arms protecting Germany's insular position.Walsh (1949), p.9", "* Halford Mackinder, Democratic Ideals and Reality, Washington, DC: National Defence University Press, 1996."]}, {"page": "Gainsborough, Lincolnshire", "response": ["*Sir Halford Mackinder (1861–1947), geographer and explorerplaque at birthplace"]}, {"page": "Halford John, Sir Mackinder", "response": ["#REDIRECT Halford Mackinder"]}, {"page": "Sir Halford John Mackinder", "response": ["#redirect Halford Mackinder"]}, {"page": "Sir Halford Mackinder", "response": ["#REDIRECT Halford Mackinder"]}, {"page": "List of Privy Counsellors (1910–1936)", "response": ["*Sir Halford Mackinder (1861–1947)"]}, {"page": "Japanese nationalism", "response": ["The Japanese theorists, such as Saneshige Komaki, concerned with Mainland Asia, knew the geostrategic theory of Halford Mackinder, expressed in the book Democratic Ideas and Reality. He discussed why the 'World Island' of Eurasia and Africa was dominant, and why the key to this was the 'Central Land' in Central Asia. This is protected from sea attack, by deserts and mountains, and is vulnerable only on its west side, and to advanced technology from Europe."]}, {"page": "Nicholas J. Spykman", "response": ["He could be considered as a disciple and critic of both geostrategists Alfred Mahan, of the United States Navy, and Halford Mackinder, the British geographer.  Spykman's work is based on assumptions similar to Mackinder, the unity of world politics and the unity of the world sea, but extends it to include the unity of the air.  The exploration of the entire world means that the foreign policy of any nation will affect more than its immediate neighbors; it will affect the alignment of nations throughout the world's regions.  Maritime mobility opened up the possibility of a new geopolitical structure: the overseas empire."]}, {"page": "Halford J. Mackinder", "response": ["#REDIRECT Halford Mackinder"]}, {"page": "Robert D. Kaplan", "response": ["Additionally, Kaplan draws on the classical realism of Hans Morgenthau. He also frequently refers to the geographer Halford Mackinder and his once-influential Heartland theory, along with the theories of Nicholas Spykman and Alfred Thayer Mahan.", "Political geographer Nick Megoran argues that \"for geographers, Kaplan's article [The Revenge of Geography] makes dismal reading\".https://www.staff.ncl.ac.uk/nick.megoran/pdf/neoclassical_geopolitics.pdf The article, in Megoran's view, takes theories of classical geopolitical scholars like Halford Mackinder out of their socio-historical context. Kaplan's writing contributes to an \"unwelcome return\" to what Megoran loosely perceives as militarist-imperialist discourses in traditional geopolitics. This study and approach, due to its historical associations, is considered a discredited field amongst academic geographers, but Megoran objects to its influence on Kaplan and on the foreign policy of states. However, this view fails to take into account the role that the study of classical geopolitics and military geography may play in the prevention and mitigation of conflict over territorial space."]}, {"page": "Political geography", "response": ["The British geographer Halford Mackinder was also heavily influenced by environmental determinism and in developing his concept of the 'geographical pivot of history'  or the Heartland Theory (in 1904) he argued that the era of sea power was coming to an end and that land based powers were in the ascendant, and, in particular, that whoever controlled the heartland of 'Euro-Asia' would control the world.  This theory involved concepts diametrically opposed to the ideas of Alfred Thayer Mahan about the significance of sea power in world conflict.  The heartland theory hypothesized the possibility of a huge empire being created which didn't need to use coastal or transoceanic transport to supply its military–industrial complex, and that this empire could not be defeated by the rest of the world allied against it.  This perspective proved influential throughout the period of the Cold War, underpinning military thinking about the creation of buffer states between East and West in central Europe.", "* Halford Mackinder"]}, {"page": "Halford", "response": ["* Halford Mackinder (1861–1947), geographer, a founder of the study of geopolitics"]}, {"page": "Rimland", "response": ["The Rimland, Halford Mackinder's \"Inner or Marginal Crescent\", was divided into three sections:"]}, {"page": "Glasgow Camlachie (UK Parliament constituency)", "response": ["|rowspan=2| Halford Mackinder", "*Unionist: Halford Mackinder"]}, {"page": "Sir Halford John MacKinder", "response": ["#REDIRECTHalford Mackinder"]}, {"page": "MacKinder, Sir Halford John", "response": ["#REDIRECTHalford Mackinder"]}, {"page": "Mackinder", "response": ["* Halford Mackinder (1861–1947), English geographer", "** Halford Mackinder Professor of Geography, Oxford university chair"]}, {"page": "List of United Kingdom MPs: M", "response": ["*Halford Mackinder"]}, {"page": "The Nazis Strike", "response": ["Hitler's plan for world domination is described in terms of Halford Mackinder's Heartland Theory, which starts about three minutes into the film:"]}, {"page": "Imagined geographies", "response": ["This theory has also been used to critique several geographies created; both historically and contemporarily—an example is Maria Todorova's work Imagining the Balkans. Samuel P. Huntington's Clash of Civilizations has also been criticized as showing a whole set of imagined geographies. Halford Mackinder's theories have also been argued by scholars to be an imagined geography that emphasised the important of Europe over non-European countries, and asserted the view of the geographical \"expert\" with the \"God's eye view\".", "Imagined geographies were mostly based on myth and legend, often depicting monstrous \"others\". Edward Said elaborates that: “Europe is powerful and articulate; Asia is defeated and distant.\"Said, Edward.  “Imaginative Geography and Its Representations: Orientalizing the Oriental.”  Orientalism.  New York: Vintage, 1979. Further writers to have been heavily influenced by the concept of imagined geographies including Derek Gregory and Gearóid Ó Tuathail. Gregory argues that the War on Terror shows a continuation of the same imagined geographies that Said uncovered. He claims that the Islamic world is portrayed as uncivilized; it is labeled as backward and failing. This justifies, in the view of those imagining, the military intervention that has been seen in Afghanistan and Iraq. Edward Said mentions that when Islam appeared in Europe in the Middle Ages, the response was conservative and defensive. Ó' Tuathail has argued that geopolitical knowledges are forms of imagined geography. Using the example of Halford Mackinder's heartland theory, he has shown how the presentation of Eastern Europe / Western Russia as a key geopolitical region after the First World War influenced actions such as the recreation of Poland and the Polish Corridor in the 1918 Treaty of Versailles."]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["|Halford Mackinder "]}, {"page": "List of first ascents", "response": ["|  || Batian || 5199 || Mount Kenya ||  ||  and Joseph Brocherel guiding Halford Mackinder ||   || Mackinder, Ollier and Brocherel make the first ascent of Batian"]}, {"page": "1947 in the United Kingdom", "response": ["* 6 March – Sir Halford Mackinder, geographer (born 1861)"]}, {"page": "Henry Nottidge Moseley", "response": ["Moseley exerted  significant influences on his noted students Halford MackinderSir Halford Mackinder, 1861 - 1947: Some New Perspectives, by Brian Blouet, Research Paper 13, School of Geography, University of Oxford 1975 and Walter Garstang, who changed his career choice from medicine to zoology under Moseley's supervision. Moseley was awarded the Royal Society's Royal Medal in 1887."]}, {"page": "List of MPs elected in the January 1910 United Kingdom general election", "response": ["| Halford Mackinder"]}]}}