{"wiki_id": "http://www.wikidata.org/entity/Q299302", "itemLabel": "Michael Gough", "itemDescription": "English actor (1916-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Gough", "wikipedia_page": {"main": "Francis Michael Gough ( GOF; 23 November 1916 – 17 March 2011) was a British character actor who made over 150 film and television appearances. He is known for his roles in the Hammer Horror Films from 1958, with his first role as Sir Arthur Holmwood in Dracula, and for his recurring role as Alfred Pennyworth in all four films of the Batman films from 1989 to 1997. He would appear in three more Burton films: in Sleepy Hollow, voicing Elder Gutknecht in Corpse Bride and the Dodo in Alice in Wonderland.\nGough also appeared in popular British television shows, including Doctor Who, as the titular villain in The Celestial Toymaker (1966) and as Councillor Hedin in Arc of Infinity (1983), and in a memorable episode of The Avengers as the automation-obsessed wheelchair user Dr. Armstrong in \"The Cybernauts\" (1965). In 1956 he received a British Academy Television Award for Best Actor.At the National Theatre in London Gough excelled as a comedian, playing a resigned and rueful parent in Alan Ayckbourn's Bedroom Farce (1977). When the comedy transferred to Broadway in 1978 he won a Tony Award. One of Gough's most well-received West End roles was as Baron von Epp in the 1983 revival of John Osborne's A Patriot for Me.", "link_mentions": [{"page": "Dodo (Alice's Adventures in Wonderland)", "response": ["In Tim Burton's adaptation of Alice in Wonderland, the Dodo's appearance retains the subtle apparent nature from John Tenniel's illustration. He bears a down of brilliant blue and wears a navy blue waistcoat and white spats along with glasses and a cane. He is one of Alice's good-willed advisers, taking first note of her abilities as the true Alice. He is also one of the oldest inhabitants. His name is Uilleam, and he is portrayed by Michael Gough. He goes with the White Rabbit, Tweedledee and Tweedledum, and Dormouse to take Alice to Caterpillar to decide whether Alice is the real one. He is later captured by the Red Queen's forces. When Alice came to the Red Queen's castle, he was seen at the Red Queen's castle yard as a caddy for the Queen's croquet game. After the Red Queen orders the release of the Jubjub bird to kill all her subjects from rebelling, he is then seen briefly running from it when the Tweedles went to hide from it and escaped but was snatched by the Jubjub and was never seen again throughout the film.", "His name may be based on a lecture on William the Conqueror from Chapter Three of the original novel. The character is voiced by Michael Gough in his final feature film role before his death in 2011. Gough came out of retirement to appear in the film but the character only speaks three lines, so Gough managed to record in one day."]}, {"page": "BBC Radio 1", "response": ["In 1994, Radio 1 broadcast a radio adaptation of the Batman comic book storyline Knightfall, as part of the Marc Goodier show, featuring Michael Gough recreating his movie role as Alfred. Later that same year, Radio 1 also broadcast a re-edited version of the Radio 4 Superman radio drama."]}, {"page": "Batman (1989 film)", "response": ["Batman is a 1989 American superhero film directed by Tim Burton and produced by Jon Peters and Peter Guber, based on the DC Comics character of the same name. It is the first installment of Warner Bros.' initial Batman film series. The film stars Jack Nicholson as the Joker and Michael Keaton as Bruce Wayne / Batman, alongside Kim Basinger, Robert Wuhl, Pat Hingle, Billy Dee Williams, Michael Gough, and Jack Palance. The film takes place early in the title character's war on crime, and depicts his conflict with the Joker.", "*Michael Gough as Alfred Pennyworth", "Sean Young was originally cast as Vicki Vale, but was injured in a horse-riding accident prior to commencement of filming.Shadows of the Bat: The Cinematic Saga of the Dark Knight, \"Part 2: The Gathering Storm\", DVD documentary, 2005 Young's departure necessitated an urgent search for an actress who, besides being right for the part, could commit to the film at very short notice. Peters suggested Kim Basinger: she was able to join the production immediately and was cast. As a fan of Michael Gough's work in various Hammer Film Productions, Burton cast Gough as Bruce Wayne's mysterious butler, Alfred.Tim Burton, DVD audio commentary, 2005, Warner Home Video Robert Wuhl was cast as reporter Alexander Knox. His character was originally supposed to die by the Joker's poison gas in the climax, but the filmmakers \"liked [my] character so much,\" Wuhl said, \"that they decided to let me live.\"Robert Wuhl, Billy Dee Williams, Pat Hingle, Batman: The Heroes, 2005, Warner Home Video Burton chose Billy Dee Williams as Harvey Dent because he wanted to include the villain Two-Face in a future film using the concept of an African-American Two-Face for the black and white concept,Batman Special Edition DVD/Blu-ray, Tim Burton Commentary but Tommy Lee Jones was later cast in the role for Batman Forever, which disappointed Williams. Nicholson convinced the filmmakers to cast his close friend Tracey Walter as the Joker's henchman, Bob.Jack Nicholson, Tracey Walter, Batman: The Villains, 2005, Warner Home Video Irish child actor Ricky Addison Reed was cast as Dick Grayson before the character was removed by Warren Skarren for the revised shooting script.Comics Scene magazine, #14, August 1990, page 51 The rest of the cast included Pat Hingle as Commissioner Gordon, Jerry Hall as Alicia, Lee Wallace as Mayor Borg, William Hootkins as Lt. Eckhardt, and Jack Palance as crime boss Carl Grissom."]}, {"page": "Batman Returns", "response": ["Batman Returns is a 1992 American superhero film directed by Tim Burton and produced by Denise Di Novi and Burton, based on the DC Comics character Batman. The sequel to the 1989 film Batman, it is the second installment of Warner Bros.' initial Batman film series, and stars Michael Keaton as Bruce Wayne / Batman, alongside  Danny DeVito, Michelle Pfeiffer, Christopher Walken, Michael Gough, Pat Hingle, Michael Murphy, and Vincent Schiavelli. In Batman Returns, Batman faces the Penguin, who plots to kill all of Gotham City's firstborn sons, while dealing with Max Shreck, a corrupt tycoon who allies with the Penguin to bring Gotham City under his control, and Catwoman, who seeks vengeance against Shreck.", "* Michael Gough as Alfred Pennyworth: The Wayne family's butler and Batman's accomplice, who has helped and raised him since his parents' death. Along with Pat Hingle, Gough was one of the few actors who appeared in all four films of the initial Batman film series.", "* Pat Hingle as Commissioner James Gordon: Commissioner of the Police Department of Gotham City. Along with Michael Gough, Hingle was one of the few actors who appeared in all four films of the initial Batman film series."]}, {"page": "Batman & Robin (film)", "response": ["Batman & Robin is a 1997 American superhero film based on the DC Comics characters Batman and Robin. It is the fourth and final installment of Warner Bros.'s initial Batman film series, a sequel to Batman Forever and the only film in the series made without the involvement of Tim Burton in any capacity. Directed by Joel Schumacher and written by Akiva Goldsman, it stars George Clooney as Bruce Wayne / Batman, replacing Val Kilmer, Arnold Schwarzenegger as Victor Fries / Mr. Freeze, and Chris O'Donnell reprising his role as Dick Grayson / Robin, alongside Uma Thurman, Alicia Silverstone, Michael Gough, Pat Hingle, and Elle Macpherson. The film follows the titular characters as they attempt to prevent Mr. Freeze and Poison Ivy from taking over the world, while at the same time struggling to keep their partnership together. It is also to date the only live-action film appearance of Batgirl, portrayed by Silverstone, who helps the title characters fight the villains.", "* Michael Gough as Alfred Pennyworth:  The trusted butler for Bruce Wayne and Dick Grayson. Alfred is dying of a rare disease from which Mr. Freeze's wife also suffers."]}, {"page": "Batman Forever", "response": ["Batman Forever is a 1995 American superhero film directed by Joel Schumacher and produced by Tim Burton, based on the DC Comics character Batman. The third installment of Warner Bros.' initial Batman film series, it is a sequel to the 1992 film Batman Returns, starring Val Kilmer replacing Michael Keaton as Bruce Wayne / Batman, alongside Tommy Lee Jones, Jim Carrey, Nicole Kidman, Chris O'Donnell, Michael Gough, and Pat Hingle. The plot focuses on Batman trying to stop Two-Face and the Riddler in their villainous scheme to extract confidential information from all the minds in Gotham City and use it to learn Batman's identity and bring the city under their control. In the process, he gains allegiance from a young, orphaned circus acrobat named Dick Grayson, who becomes his sidekick Robin, and meets and develops feelings for psychologist Dr. Chase Meridian, which brings him to the point to decide if he will lead a normal life or if he is destined to fight crime as Batman forever.", "* Michael Gough as Alfred Pennyworth: The Wayne family's faithful butler and Bruce's confidant. Alfred also befriends the young Dick Grayson."]}, {"page": "March 17", "response": ["*2011  – Michael Gough, English actor (b. 1916)"]}, {"page": "November 23", "response": ["*1916 – Michael Gough, Malaysian-English actor (d. 2011)"]}, {"page": "Tim Burton", "response": ["Despite Burton's intention to still lead the Batman franchise, Warner Bros. considered Batman Returns too dark and unsafe for children. To attract the young audience, it was decided that Joel Schumacher, who had directed films like The Client, would lead the third film, while Burton would only produce it in conjunction with Peter MacGregor-Scott. Following this change and the changes made by the new director, Michael Keaton resigned from the lead role and was replaced by Val Kilmer. Filming for Batman Forever began in late 1994 with new actors: Tommy Lee Jones as Harvey Dent/Two-Face, Nicole Kidman as Dr. Chase Meridian, Chris O'Donnell as Dick Grayson/Robin and Jim Carrey as Edward Nygma/The Riddler; the only two actors who returned after Batman Returns were Pat Hingle as Commissioner Gordon and Michael Gough as Alfred Pennyworth. The film, a combination of the darkness that characterized the saga and colors and neon signs proposed by Schumacher, was a huge box office success, earning $336 million. Warner Bros. demanded that Schumacher delete some scenes so the film did not have the same tone as its predecessor, Batman Returns (later they were added as deleted scenes on the 2005 DVD release).", "Sleepy Hollow, released in late 1999, had a supernatural setting and starred Johnny Depp as Ichabod Crane, a detective with an interest in forensic science rather than the schoolteacher of Washington Irving's original tale. With Sleepy Hollow, Burton paid homage to the horror films of the English company Hammer Films. Christopher Lee, one of Hammer's stars, was given a cameo role. A host of Burton regulars appeared in supporting roles (Michael Gough, Jeffrey Jones, and Christopher Walken, among others), and Christina Ricci was cast as Katrina van Tassel. A well-regarded supporting cast was headed by Miranda Richardson, Michael Gambon, Richard Griffiths and Ian McDiarmid. Mostly well received by critics, and with a special mention to Elfman's gothic score, the film won an Academy Award for Best Art Direction, as well as two BAFTAs for Best Costume Design and Best Production Design. A box office success, Sleepy Hollow was also a turning point for Burton. Along with change in his personal life (separation from actress Lisa Marie), Burton changed radically in style for his next project, leaving the haunted forests and colorful outcasts behind to go on to directing Planet of the Apes which, as Burton had repeatedly noted, was \"not a remake\" of the earlier film."]}, {"page": "1916", "response": ["** Michael Gough, Malayan-born English actor (d. 2011)"]}, {"page": "2011", "response": ["* March 17 – Michael Gough, British actor (b. 1916)"]}, {"page": "Sleepy Hollow (film)", "response": ["* Michael Gough as Notary James Hardenbrook: The wizened, cowardly town banker.", "While Johnny Depp was Burton's first choice for the role of Ichabod Crane, Paramount required him to consider Brad Pitt, Liam Neeson and Daniel Day-Lewis. Depp was cast in July 1998 for his third collaboration with Burton. The actor wanted Ichabod to parallel Irving's description of the character in the short story. This included a long prosthetic snipe nose, huge ears, and elongated fingers. Paramount turned down his suggestions, and after Depp read Tom Stoppard's rewrite of the script, he was inspired to take the character even further. \"I always thought of Ichabod as a very delicate, fragile person who was maybe a little too in touch with his feminine side, like a frightened little girl,\" Depp explained. He did not wish to portray the character as a typical action star would have, and instead took inspiration by Angela Lansbury's performance in Death on the Nile. \"It's good,\" Burton reasoned, \"because I'm not the greatest action director, or the greatest director in any genre, and he's not the greatest action star, or the greatest star in any genre.\" Depp modeled Ichabod's detective personality from Basil Rathbone in the 1939 Sherlock Holmes film series. He also studied Roddy McDowall's acting for additional influence. Burton added that \"the idea was to try to find an elegance in action of the kind that Christopher Lee or Peter Cushing or Vincent Price had.\" Sleepy Hollow also reunited Burton with Jeffrey Jones (from Beetlejuice and Ed Wood) as Reverend Steenwyck, Christopher Walken (Max Shreck in Batman Returns) as the Hessian Horseman, Martin Landau (Ed Wood) in a cameo role, and Hammer veteran Michael Gough (Alfred in Burton's Batman films), whom Burton tempted out of retirement. The Hammer influence was further confirmed by the casting of Christopher Lee in a small role as the Burgomaster who sends Crane to Sleepy Hollow."]}, {"page": "Jean Anouilh", "response": ["* Fading Mansion (Roméo et Jeanette). Duchess Theatre, London: 31 August 1949. Directed by Anthony Bushell. With Siobhan McKenna, George Relph, Michael Gough.", "* Colombe. New Theatre, London: 13 December 1951. Directed by Peter Brook. With Yvonne Arnaud, Joyce Redman, Michael Gough, John Stratton.", "* The Fighting Cock (L'Hurluberlu ou le Réactionnaire amoureux). ANTA Playhouse, New York City: 8 December 1959. Directed by Peter Brook. With Rex Harrison, Roddy McDowall, Natasha Parry, Michael Gough, Alan MacNaughtan, Arthur Treacher."]}, {"page": "Jules Maigret", "response": ["Maurice Denham played Chief Inspector Maigret in a series of three-quarter-hour dramatizations of the novels on BBC Radio 4 beginning in 1976, with Michael Gough playing Georges Simenon. The format of each play would begin with Maigret and Simenon sitting together discussing some fact or event which would then lead into Maigret's recounting a particular case, with Simenon asking questions or commenting from time to time. After Denham's death, the series was continued in 2003 with Nicholas Le Prevost playing a gruffer, more earthy Maigret and Julian Barnes playing Simenon."]}, {"page": "Out of Africa (film)", "response": ["The book was adapted into a screenplay by the writer Kurt Luedtke, and filmed in 1984. Streep played Karen Blixen, Redford played Denys Finch Hatton, and Klaus Maria Brandauer played Baron Bror Blixen. Others in the film include Michael Kitchen as Berkeley Cole, Malick Bowens as Farah, Stephen Kinyanjui as the Chief, Michael Gough as Lord Delamere, Suzanna Hamilton as Felicity, and the model and actress Iman as Mariammo. Despite mixed reviews from critics, Out of Africa was a commercial success and won seven Academy Awards including Best Picture and Best Director for Pollack.", "* Michael Gough as Hugh Cholmondeley, Lord Delamere"]}, {"page": "The Dresser (1983 film)", "response": ["The Dresser is a 1983 British drama film directed by Peter Yates and adapted by Ronald Harwood from his 1980 play The Dresser. It tells the story of an aging actor's personal assistant struggling to keep his employer's life together. The film stars Albert Finney, Tom Courtenay, Zena Walker, Eileen Atkins, Michael Gough, and Edward Fox."]}, {"page": "The Boys from Brazil (film)", "response": ["* Michael Gough as Mr Harrington"]}, {"page": "2001 in film", "response": ["| Lady and the Tramp II: Scamp's Adventure || Walt Disney Home Video || Darrell Rooney, Jeannine Roussel (directors); Bill Motz, Bob Roth (screenplay); Scott Wolf, Alyssa Milano, Chazz Palminteri, Jeff Bennett, Jodi Benson, Bill Fagerbakke, Mickey Rooney, Bronson Pinchot, Cathy Moriarty, Mary Kay Bergman, Debi Derryberry, Barbara Goodson, Nick Jameson, Tress MacNeille, Rob Paulsen, Kath Soucie, Frank Welker, April Winchell, Jim Cummings, Michael Gough, Dee Bradley Baker, Roger Bart, Susan Egan, Jess Harnell, Andrew McDonough || Musical, Comedy, Family || Animation", "| Mickey's Magical Christmas: Snowed in at the House of Mouse || Walt Disney Home Entertainment || Tony Craig, Roberts Gannaway (directors); Kevin Campbell (screenplay); Wayne Allwine, Russi Taylor, Tony Anselmo, Tress MacNeille, Bill Farmer, Carlos Alazraqui, Jeff Bennett, Jodi Benson, Robby Benson, Corey Burton, Eddie Carroll, Pat Carroll, John Cleese, Peter Cullen, Edan Gross, Jonathan Freeman, Jennifer Hale, Maurice LaMarche, James Woods, Aries Spears, J.P. Manoux, Mr. T, Mark Moseley, Paige O'Hara, Michael Gough, Patricia Parris, Rob Paulsen, Ernie Sabella, Cree Summer, Samuel E. Wright, Gilbert Gottfried, Kevin Schon, Michael Welch, April Winchell, Sally Dworsky, Andre Stojka, Nikita Hopkins, Ken Sansom, Kath Soucie, David Ogden Stiers, Blayne Weaver, Joseph Williams, Alan Young, Jim Cummings, James Earl Jones, Jack Angel, Frank Welker, Alvin Chea, Colin Davis, Joe Pizzulo, Hal Smith, Will Ryan, Clarence Nash, David Tomlinson, Pinto Colvig, James MacDonald, Carolyn Gardner, Rick Logan, Bobbi Page, Randy Crenshaw, Colin Davis, Niki Harris, Jon Robert Hall, Susan Stevens Logan, Meagan Moore, Lori Perry, Laurie Schillinger, Terry Wood, Dick Billingsley, Dessie Flynn || Adventure, Comedy || Animation"]}, {"page": "1995 in film", "response": ["| Batman Forever || Warner Bros. Pictures || Joel Schumacher (director); Lee Batchler, Janet Scott-Batchler, Akiva Goldsman (screenplay); Val Kilmer, Tommy Lee Jones, Jim Carrey, Nicole Kidman, Chris O'Donnell, Michael Gough, Pat Hingle, Drew Barrymore, Debi Mazar, Ed Begley Jr., Ofer Samra, Elizabeth Sanders, René Auberjonois, Joe Grifasi, Philip Moon, Jessica Tuck, Kimberly Scott, Michael Paul Chan, Jon Favreau, Greg Lauren, George Wallace, Bob Zmuda, Rebecca Budig, Don 'The Dragon' Wilson, George Cheung, United States Senator Patrick Leahy || Action || Live action"]}, {"page": "1997 in film", "response": ["| Batman & Robin || Warner Bros. Pictures || Joel Schumacher (director); Akiva Goldsman (screenplay); Arnold Schwarzenegger, George Clooney, Chris O'Donnell, Uma Thurman, Alicia Silverstone, Michael Gough, Pat Hingle, John Glover, Elle Macpherson, Vivica A. Fox, Vendela Kirsebom, Elizabeth Sanders, Jeep Swenson, John Fink, Michael Reid MacKay, Eric Lloyd, Jon Simmons, Joe Sabatino, Michael Paul Chan, Kimberly Scott, Peter \"Navy\" Tuiasosopo, Harry Van Gorkum, Jack Betts, Jim McMullan, United States Senator Patrick Leahy, Jesse Ventura, Ralf Moeller, Doug Hutchison, Tobias Jelinek, Greg Lauren, Dean Cochran, Coolio, Nicky Katt, John Ingle || Action, Comedy || Live action"]}, {"page": "1999 in film", "response": ["| Sleepy Hollow || Paramount Pictures / Mandalay Pictures || Tim Burton (director); Andrew Kevin Walker (screenplay); Johnny Depp, Christina Ricci, Miranda Richardson, Michael Gambon, Casper Van Dien, Jeffrey Jones, Christopher Lee, Richard Griffiths, Ian McDiarmid, Michael Gough, Christopher Walken, Marc Pickering, Lisa Marie, Steven Waddington, Claire Skinner, Alun Armstrong, Mark Spalding, Jessica Oyelowo, Tony Maudsley, Peter Guinness, Nicholas Hewetson, Orlando Seale, Sean Stephens, Gabrielle Lloyd, Robert Sella || Horror || Live action"]}]}}