{"wiki_id": "http://www.wikidata.org/entity/Q299959", "itemLabel": "Eileen Bennett Whittingstall", "itemDescription": "British tennis player", "wikipedia_url": "https://en.wikipedia.org/wiki/Eileen_Bennett_Whittingstall", "wikipedia_page": {"main": "Eileen Bennett Whittingstall (née Bennett; 16 July 1907 – c. 18 August 1979, full name Eileen Viviyen Bennett Fearnley-Whittingstall) was a tennis player from the United Kingdom who won six Grand Slam doubles titles from 1927 to 1931.", "link_mentions": [{"page": "1931 in sports", "response": ["* American Women's Singles Championship – Helen Wills Moody (USA) defeats Eileen Bennett Whittingstall (Great Britain) 6–4 6–1 "]}, {"page": "1928 in sports", "response": ["* French Women's Singles Championship – Helen Wills Moody (USA) defeats Eileen Bennett Whittingstall (Great Britain) 6–1 6–2"]}, {"page": "Henri Cochet", "response": ["In May at the 34th French Championships the men's doubles tournament took place first. With Lacoste – Borotra's victory over Tilden – Hunter and Cochet – Brugnon's easy win over Gregory – Collins in the semi-finals secured the Four Musketeers their third doubles face-to-face final. Unfortunately for Cochet in the fifth set they were serving for the match and had thirty-love in the game, when Brugnon missed an easy ball when three match points were at stake. Lacoste and Borotra revived from that moment on and closed out the final set 8–6. In singles he was put out of the contest by Borotra in the semi-finals and thus was unable to retain his title. However, Cochet did not leave without a trophy as the mixed championship was earned by him and Eileen Bennett Whittingstall.", "Cochet was seeded first at the 1929 Wimbledon Championships. He marched through the earlier rounds, having only one five-set match against Irish champion George Lyttleton-Rogers. In the quarterfinals he beat Hendrik Timmer in straights, then Bill Tilden in the semi-finals also in straights and second seeded compatriot Jean Borotra for the championship in his third straight sets victory in a row. Despite this he lost 63 games throughout the tournament, which was the most among the seeded players (third-seeded semi-finalist Tilden only lost 27). In doubles he reached the quarterfinals with Jacques Brugnon but was beaten by Wilmer Allison and John Van Ryn, who later became champions. In the mixed doubles draw the titleholders Cochet and Eileen Bennett Whittingstall lost to eventual runners-up Joan Fry and Ian Collins in three sets. The singles victory marked the sixth straight time that a French player won Wimbledon and the fifth time that the final was contested between two Frenchmen, counting from the first French victory in 1924. A couple of days later in the Regent's Park the top Wimbledon players participated in an exhibition event to raise funds for children of the British war cripples.", "In early 1930 Cochet decided to rest and only compete in doubles contests. He won at Gallia L.T.C., Carlton L.T.C. (also in mixed doubles with Elizabeth Ryan), Biarritz, La Baule mixed doubles with Ryan. His only singles loss came at the Belgian International Championship to Jean Borotra. His most successful French Championships came in this year when he was close to winning a triple crown after being victorious in singles over Bill Tilden, in doubles with Jacques Brugnon over Harry Hopman and James Willard and was a finalist in the mixed tournament as well. At the 1930 Wimbledon Championships he was seeded first but made an early exit after his straight-set loss to Wilmer Allison in the quarterfinals. In the doubles Cochet—Brugnon lost in the semi-finals as well as in mixed doubles with Eileen Bennett Whittingstall.", "In 1931 Cochet retained the Carlton L.T.C. doubles with Brugnon. In March he defeated George Lyttleton-Rogers for his third Monaco Cup crown. With Eileen Bennett Whittingstall they were crowned the mixed victors. Cochet became the Danish Covered Courts champion for the first time after defeating Danish national champion Einer Ulrich in Copenhagen. He won the mixed contest as well with Simone Barbier. He was invited by his hometown club F.C. Lyon to an interclub match with German Uhlenhorster Klipper. Cochet won all three of his matches. In the Moncean Club of Paris he partnered Paul Féret and Colette Rosambert and swept the doubles and mixed doubles respectively.", "After these losses Cochet took two weeks off to recover. Despite the rest in the 1931 Wimbledon Championships he shocked the tennis world by losing in the very first round to Nigel Sharpe. In the mixed doubles Cochet and Eileen Bennett Whittingstall were not more successful, falling in the fourth round. The doubles final remained unconquered for Brugnon and Cochet as the team of George Lott and John Van Ryn came back from 3–2 down in the fifth set to win the match. In July the Four Musketeers were ready to be challenged for the fifth time in the Davis Cup final. This time the opponent was the British Davis Cup team. In the first rubber Cochet was facing two set points for a two sets-love lead by Bunny Austin but fought back to claim the second set and won the next two for the match. Fred Perry battled through Borotra while the doubles were won by Cochet and Brugnon. Austin brought back the British hopes after a four set victory over the exhausted Borotra. The match was suspended multiple times due to rain, which made the court almost unsuitable for playing, which left its mark on the deciding rubber between Cochet and Perry. The recurring slight rain in the first set led Perry to drop the set from a 4–1 advantage. The second set went to Perry after he utilized passing shots as a counter for Cochet's net play. The third and fourth set however were taken by Cochet which gave the French team its fifth successive Davis Cup.", "| style=\"background:#ffa07a;\"|Loss || 1930 || French Championships || Clay ||  Eileen Bennett Whittingstall ||  Cilly Aussem   Bill Tilden||4–6, 4–6"]}, {"page": "Helen Wills", "response": ["In 1931 Wills did no travel to Europe to defend her French and Wimbledon titles and only played in tournaments in the United States. Her first tournament was in July at the Essex Country Club Invitation in Massachusetts where she defeated McCune Harper in the final, losing just one game. In early August Wills won the Seabright Invitational title for the first time after a double-bagel victory in the final against Helen Jacobs. At the 1931 Wightman Cup in August in Forest Hills, she won both her singles matches but lost the doubles with McCune Harper. At the U.S. National Championships she won her seventh (and last) singles title via a win in a 35-minute final against the British player Eileen Bennett Whittingstall. In the fall she and her husband travelled to Japan, China and the Philippines and Wills played exhibition matches in Tokyo, Kobe and Yokohama. For the fifth time in succession in she was ranked the No. 1 player in the world.", "Due to the economic depression in the United States Wills and her husband decided to travel to several European countries. Wills departed New York in late April and said she wanted to compete in Europe every other year. She entered all three events of the French Championships, which was held from May 22 through June 6, without having played any warm-up tournaments. In the quarterfinal and semifinal of the singles event she survived setpoints but nevertheless won the title without losing a set when she beat Simonne Mathieu in the final. Her level of play was not quite as dominant as in previous years. She teamed up with Elizabeth Ryan  to win the doubles title against Betty Nuthall and Eileen Bennett Whittingstall and in the mixed doubles she lost the final with Sidney Wood to Nuthall and Fred Perry. It was her last appearance at the French Championships. The day after the singles final she traveled to London to prepare for the Wightman Cup which was held on June 10 and 11 at the All England Club. The United States won the cup and Wills contributed with singles victories over Bennett Whittingstall and Dorothy Round but lost the doubles match with Sarah Palfrey.", "| style=\"background:#98fb98;\"|Win || 1931 || U.S. Championships (7) ||Grass||  Eileen Bennett Whittingstall || 6–4, 6–1||", "| style=\"background:#98fb98;\"|Win || 1932 || French Championships (2) || Clay ||  Elizabeth Ryan ||  Eileen Bennett Whittingstall Betty Nuthall || 6–1, 6–3 ||"]}]}}