{"wiki_id": "http://www.wikidata.org/entity/Q2993721", "itemLabel": "Frederick Cuming", "itemDescription": "British cricketer (1875-1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Cuming", "wikipedia_page": {"main": "Frederick William Cuming (27 May 1875 in Tiverton, Devon – 22 March 1942 in London) was a British cricket player. He was educated at Blundell's School and was a member of the gold medal winning Great Britain cricket team at the 1900 Summer Olympics, the only time to date that cricket has featured in the Olympics. In the only game played against France he top scored with 38 in Great Britain's first innings, and scored 18 in the second. He also took a catch in the French first innings. Little is known of his cricket career outside of the Olympics, except that he played for Exeter and for Bradnich in 1900.", "link_mentions": [{"page": "May 27", "response": ["*1875 – Frederick Cuming, English cricketer (d. 1942)"]}, {"page": "March 22", "response": ["*1942 – Frederick Cuming, English cricketer (b. 1875)"]}, {"page": "Cricket at the 1900 Summer Olympics", "response": ["Play commenced at 11:00AM on Sunday, 19 August, with the touring Wanderers batting first. They were bowled out for 117, with only four members of the team reaching double figures.  Frederick Cuming, one of the four Old Blundellians, top-scored for the side with 38, followed by their captain, and Exeter Cricket Club opening batsman, C. B. K. Beachcroft with 23.  The French were then bowled out for 78, the bowling led by Frederick Christian who claimed seven wickets. Play closed at 5:00PM after both sides had completed their first innings, and the Wanderers had a lead of 39 runs. The Wanderers batting improved the following morning, and they added 145 runs for the second innings, declaring their innings closed with five wickets down.  Beachcroft was again successful, reaching a half-century, a feat also achieved by Bowerman, who top-scored with 59 runs. ", "| Frederick Cuming || c Browning b MacEvoy || 38 || c Attrill b MacEvoy || 18", "Frederick Cuming"]}, {"page": "Index of World War II articles (F)", "response": ["# Frederick Cuming"]}, {"page": "Cuming", "response": ["* Frederick Cuming, English cricketer", "* Frederick Cuming (artist), British painter"]}, {"page": "List of 1900 Summer Olympics medal winners", "response": ["Frederick Cuming"]}]}}