{"wiki_id": "http://www.wikidata.org/entity/Q29913236", "itemLabel": "Ibrahim Dogus", "itemDescription": "British restaurateur", "wikipedia_url": "https://en.wikipedia.org/wiki/Ibrahim_Dogus", "wikipedia_page": {"main": "Ibrahim Dogus (born July 1980) is an entrepreneur and restaurateur. He is founder of the Centre for Turkey Studies and Centre for Kurdish Progress, and an active organiser for the Turkish and Kurdish community in London and the UK. He is also a British Labour Party politician, serving as a Lambeth Borough councillor. Dogus was the unsuccessful parliamentary candidate for the Labour Party for the Cities of London and Westminster constituency in the June 2017 UK general election and for West Bromwich East at the 2019 general election.", "link_mentions": [{"page": "List of Parliamentary constituencies in the West Midlands (county)", "response": ["|Ibrahim Dogus ‡"]}, {"page": "Kurds in the United Kingdom", "response": ["*Ibrahim Dogus, Labour politician, businessman and acting Mayor of Lambeth since April 2019."]}, {"page": "Lambeth London Borough Council", "response": ["* Ibrahim Dogus, Councillor for Bishop's ward since 2018 and entrepreneur and restaurateur. "]}, {"page": "2019 United Kingdom general election", "response": ["|data-sort-value=\"Dogus, Ibrahim\"|Ibrahim Dogus"]}, {"page": "Nubian Jak Community Trust", "response": ["* Cecile Nobrega plaque, 1 June 2019.\"Blue Plaque for Cecile Nobrega\", The Brixton Society, 28 May 2019.\"Blue Plaque Unveiling For Cecile Nobrega\", Lambeth Life.Ibrahim Dogus, \"Blue Plaque Unveiling to Cecile Nobrega\", 2 June 2019."]}, {"page": "British Kebab Awards", "response": ["The British Kebab Awards are an annual event to celebrate local kebab restaurants across the UK. The awards were founded by Ibrahim Dogus, an entrepreneur, restaurateur and founder of the Centre for Turkey Studies (CEFTUS), in 2013.", "Founder Ibrahim Dogus is a former waiter, owner of Troia restaurant in Waterloo, London, and the son of Kurdish refugees from Turkey who arrived in the UK in 1994. Dogus became a community activist in the early 2000s, and was shot while trying to combat drug crime in Hackney, where he lived.thumb|Ibrahim Dogus with a sample of his beer for drinking with kebabs at Troia restaurant, Waterloo"]}, {"page": "Centre for Turkey Studies", "response": ["The Centre for Turkey Studies (CEFTUS) is a UK-based thinktank which organises discussion events on issues relating to Turkey. CEFTUS, established in 2011 and run by Ibrahim Dogus, also organises events promoting the Turkish, Kurdish and Cypriot communities in the UK, including the Turkish, Kurdish, Cypriot Community Achievement Awards and the British Kebab Awards."]}, {"page": "Centre for Kurdish Progress", "response": ["The Centre for Kurdish Progress is a platform for discussing issues affecting Kurdish-speakers in the UK and Kurdish regions in the Middle East.  It was founded in 2014 by Ibrahim Dogus, who has also founded the Centre for Turkey Studies think tank.  The Centre for Kurdish Progress holds regular discussion events, some of which are held within the UK Parliament buildings.  The centre also organises an annual celebration of the Kurdish New Year, Newroz,  in conjunction with the Most Successful Kurds in Britain Awards ceremony."]}, {"page": "List of Parliamentary constituencies in the West Midlands (region)", "response": ["|Ibrahim Dogus†"]}, {"page": "İbrahim Doğuş", "response": ["#REDIRECT Ibrahim Dogus"]}, {"page": "List of MPs who lost their seat in the 2019 United Kingdom general election", "response": ["|data-sort-value=\"Dogus, Ibrahim\"|Ibrahim Dogus"]}, {"page": "Results breakdown of the 2019 United Kingdom general election", "response": ["|data-sort-value=\"Dogus, Ibrahim\"|Ibrahim Dogus"]}]}}