{"wiki_id": "http://www.wikidata.org/entity/Q29933100", "itemLabel": "Moet Abebe", "itemDescription": "Media Personality and an Entertainer", "wikipedia_url": "https://en.wikipedia.org/wiki/Moet_Abebe", "wikipedia_page": {"main": "Laura Monyeazo Abebe (born 29 July 1989), popularly known as Moet Abebe, is a Nigerian video jockey, television presenter, actress, catering exec. Her journey into limelight came after she decided to move back to Nigeria in pursuit of a career as a TV Presenter. Three months after moving back to Lagos, Nigeria, she attended  an audition for Soundcity TV, she sailed through the auditions and started working for Soundcity TV as a TV Presenter and Producer. She became a very popular face on Soundcity TV as a host of the One On One show, Body & Soul and Global Countdown show. While working at Soundcity she had the opportunity of getting a few Movie and TV series script such as Red Card, Oasis and Living Arrangement.\nIn 2016, she began her career on Soundcity Radio 98.5fm where she handles the afternoon popular show called “The Takeover” from 2-6pm Monday to Friday. \nShe opened her Event Management and Catering Company with her mother called LM Occasions.", "link_mentions": [{"page": "Woldingham School", "response": ["* Moet Abebe, Nigerian VJ"]}, {"page": "Abebe", "response": ["*Moet Abebe (Laura Monyeazo Abebe; born 1989), Nigerian television presenter, video jockey, and actress"]}, {"page": "List of Nigerian media personalities", "response": ["*Moet Abebe"]}, {"page": "Dowen College", "response": ["*Moet Abebe, video jockey, television presenter, actress, and catering exec"]}, {"page": "Soundcity Radio Network", "response": ["* Moet Abebe (The TakeOver)"]}, {"page": "ELOY Awards", "response": ["* On Air Personality - Moet Abebe, Sound City Fm; Adeyinka, R2 Fm Ibadan"]}, {"page": "2020 African Entertainment Awards USA", "response": ["** Moet Abebe"]}, {"page": "Moët (disambiguation)", "response": ["* Moet Abebe (born 1989), Nigerian entertainer"]}, {"page": "The Beatz Awards 2016", "response": ["** Moet Abebe"]}, {"page": "Laura Monyeazo Abebe", "response": ["#REDIRECT Moet Abebe"]}]}}