{"wiki_id": "http://www.wikidata.org/entity/Q300069", "itemLabel": "John Denham", "itemDescription": "British Labour Party politician (born 1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Denham_(politician)", "wikipedia_page": {"main": "John Yorke Denham  (born 15 July 1953) is an English politician who served as Secretary of State for Innovation, Universities and Skills from 2007 to 2009 and Secretary of State for Communities and Local Government from 2009 to 2010. A member of the Labour Party, he was Member of Parliament (MP) for Southampton Itchen from 1992 to 2015.Denham served in government under Prime Minister Tony Blair from 1997 to 2003, as a Parliamentary Under-Secretary of State from 1997 to 1998 and a Minister of State from 1998 to 2003. He resigned from government over the Iraq War in 2003, and subsequently became Chair of the Home Affairs Select Committee. Denham returned to government in 2007 as a Member of Prime Minister Gordon Brown's Cabinet, which he served in until Labour's election defeat in 2010.\nHe was briefly Shadow Secretary of State for Communities and Local Government in 2010, and appointed by opposition leader Ed Miliband as Shadow Secretary of State for Business, Innovation and Skills later in the same year. Denham announced in 2011 that he would be standing down from Parliament at the next election, and held his final front bench position as Parliamentary Private Secretary to Miliband from 2011 to 2013.", "link_mentions": [{"page": "London Stansted Airport", "response": ["On 10 February 2010, Secretary of State John Denham, in an open letter, concluded that the inquiry could not reasonably start until after the general election. In addition, he commented that the planning application documents were nearly two years old and would require updating. Eventually, BAA realised the futility of pursuing its G2 application in the context of the new government policy and withdrew it on 24 May 2010."]}, {"page": "Greater Manchester", "response": ["Following a bid from AGMA highlighting the potential benefits in combatting the financial crisis of 2007–2008, it was announced in the 2009 United Kingdom Budget that Greater Manchester and the Leeds City Region would be awarded Statutory City Region Pilot status, allowing (if they desired) for their constituent district councils to pool resources and become statutory Combined Authorities with powers comparable to the Greater London Authority. The stated aim of the pilot was to evaluate the contributions to economic growth and sustainable development by Combined Authorities. The Local Democracy, Economic Development and Construction Act 2009 enabled the creation of a Combined Authority for Greater Manchester with devolved powers on public transport, skills, housing, regeneration, waste management, carbon neutrality and planning permission, pending approval from the ten councils. Such strategic matters would be decided on via an enhanced majority rule voting system involving ten members appointed from among the councillors of the metropolitan boroughs (one representing each borough with each council nominating one substitute) without the input of central government. The ten district councils of Greater Manchester approved the creation of the Greater Manchester Combined Authority (GMCA) on 29 March 2010, and submitted final recommendations for a constitution to the Department for Communities and Local Government and the Department for Transport. On 31 March 2010 the Communities Secretary John Denham approved the constitution and launched a 15-week public consultation on the draft bill together with the approved constitution. Following requests by the Association of Greater Manchester Authorities, which was superseded by the GMCA, the new authority came into being on 1 April 2011. On the same day, the Transport for Greater Manchester Committee was also formed from a pool of 33 councillors allocated by council population (roughly one councillor per 75,000 residents) to scrutinise the running of Greater Manchester's transport bodies and their finances, approve the decisions and policies of said bodies and form strategic policy recommendations or projects for the approval of the Combined Authority."]}, {"page": "1992 United Kingdom general election", "response": ["|John Denham"]}, {"page": "Islamophobia", "response": ["Similarly, John Denham has drawn parallels between modern Islamophobia and the antisemitism of the 1930s, so have Maud Olofsson, and Jan Hjärpe, among others."]}, {"page": "2003 invasion of Iraq", "response": ["The UK House of Commons held a debate on going to war on 18 March 2003 where the government motion was approved 412 to 149. The vote was a key moment in the history of the Blair administration, as the number of government MPs who rebelled against the vote was the greatest since the repeal of the Corn Laws in 1846. Three government ministers resigned in protest at the war, John Denham, Lord Hunt of Kings Heath, and the then Leader of the House of Commons Robin Cook. In a passionate speech to the House of Commons after his resignation, he said, \"What has come to trouble me is the suspicion that if the 'hanging chads' of Florida had gone the other way and Al Gore had been elected, we would not now be about to commit British troops to action in Iraq.\" During the debate, it was stated that the Attorney General had advised that the war was legal under previous UN Resolutions."]}, {"page": "Ben Bradshaw", "response": ["In the Commons, Bradshaw introduced the Pesticides Act in 1998, which gave more powers to inspectors. He became a Parliamentary Private Secretary to the Minister of State at the Department of Health John Denham in 2000."]}, {"page": "Hampshire County Council", "response": ["*John Denham, member 1981 to 1989, later a member of parliament"]}, {"page": "Twyford Down", "response": ["Protesters demonstrated their opposition to the road's construction by blocking the path of construction equipment. They were met by security officers from Group 4. In December 1992, in view of a film crew from The Observer, a protester was manhandled by five officers. Another protester, according to a report by local MP John Denham, was strangled by officers and left unconscious on top of the Down for 30 minutes. Maggie Lambert, then a mature photography student, took numerous photographs of the protest, and challenged an injunction which suggested she had been involved with direct action. While Lord Justice Mann admitted there was no evidence to suggest she had done anything more than take photographs, the injunction was upheld. Protester Rebecca Lush of the Donga Tribe, who had stayed on the down from September to the night of eviction, later claimed \"It was a horrific experience and very violent. We were dragged through thorns and we were being kicked and punched and someone pulled out a clump of my hair.\" In March 1993, Kenneth Carlisle, then Minister for Roads and Traffic, refused to order an inquiry into any wrongdoing or excessive force by security officers, stating it was a matter for the police."]}, {"page": "Dunsfold", "response": ["An appeal in 2009 was rejected by the then Secretary of State John Denham. Inquiry conclusions included remarks on the sustainability of the site including at paragraph 37 of the report dated 24 September 2009 \"The Secretary of State has concluded that the development would generate a considerable amount of additional road traffic and he considers that this would have a severe and unacceptable impact on an overstretched local road network, and that the scheme would be unsustainable in transport terms.\""]}, {"page": "Keith Vaz", "response": ["In July 2007, Vaz was elected as the chair of the Home Affairs Select Committee. Select committee members are usually proposed by the Committee of Selection which, under the Standing Orders of the House, nominates members to select committees, but unusually Vaz was the only nomination made by Harriet Harman, Leader of the House of Commons and Lord Privy Seal. Harman argued that this was because there was not sufficient time to go through the usual procedure before the impending summer recess. The Chairman of the Committee of Selection told the House that the Committee had been ready to meet earlier that week, but had been advised by the Government that there was no business for it to transact. Vaz replaced John Denham on 26 July 2007. Vaz was re-elected to the Committee's chairmanship in June 2015."]}, {"page": "Barking, London", "response": ["The regeneration aims to achieve a more sustainable economy by investing in new quality retail outlets and creating a business centre; and to widen employment prospects, mainly by creating new \"retail and business accommodation\", to increase the income of both existing and new residents. The regeneration also aims to improve people's skills. This is mainly achieved through the Barking Learning Centre, which aims to improve literacy, numeracy and other basic skills people may be lacking due to a previous lack of educational development. It currently acts as a borough-based learning facility. It was officially opened on 10 June 2008 by John Denham, Secretary of State for Innovation, Universities and Skills."]}, {"page": "John Denham", "response": ["John Denham may refer to:", "* John Denham (politician) (born 1953), British Member of Parliament for Southampton Itchen, 1992–2015, subsequently an academic", "* John Denham (died 1556 or later), English MP for Shaftesbury", "* John Denham (poet) (1615–1669), English poet", "* John Denham (judge), (1559–1639), father of the above poet, and one of the Ship Money judges"]}, {"page": "List of current members of the British Privy Council", "response": ["| John Denham"]}]}}