{"wiki_id": "http://www.wikidata.org/entity/Q3001992", "itemLabel": "Craig Chalmers", "itemDescription": "Scottish rugby union footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Craig_Chalmers", "wikipedia_page": {"main": "Craig Minto Chalmers (born 15 October 1968) is a former Scotland international rugby union player. He was also a rugby union coach, but now has a business career.", "link_mentions": [{"page": "Melrose, Scottish Borders", "response": ["* Craig Chalmers, rugby union footballer, capped 60 times for Scotland"]}, {"page": "Galashiels", "response": ["*Craig Chalmers (born 1968), rugby player"]}, {"page": "Scotland national rugby union team", "response": ["|align=\"left\"| Craig Chalmers"]}, {"page": "Glasgow Warriors", "response": ["* Craig Chalmers"]}, {"page": "Hiroaki Shukuzawa", "response": ["On May 28, 1989 his team beat a weakened Scotland team shorn of nine British Lions then on tour in Australia (Gary Armstrong, Finlay Calder, Craig Chalmers, Peter Dods, John Jeffrey, Gavin Hastings, Scott Hastings, David Sole and Derek White) by 28-24 at Chichibunomiya Stadium in Tokyo. It was the first time Japan had beaten a top-tier IRB nation."]}, {"page": "Finlay Calder", "response": ["* Fin Calder's Lions - including nine Scottish players (Gary Armstrong, Craig Chalmers, Peter Dods, John Jeffrey, Gavin Hastings, Scott Hastings, David Sole, Derek White and Finlay Calder himself)"]}, {"page": "David Campese", "response": ["Randwick then defeated Melrose in the semi-final 16–15. Campese opened the scoring of the semi-final with a try that he converted to give Randwick a 6–0 lead. The scores were level at halftime 6-6. Campese scored first for Randwick in the second half with a try that he again converted to make the score 12–6. However, Melrose leveled the scores again, and with two minutes remaining Melrose captain Craig Chalmers kicked a penalty goal for a 15–12 lead. The Sydney Morning Herald wrote that, \"Randwick looked briefly flustered but Campese, skipping through on a 30m run, rescued the game with 60 seconds remaining, to send the Australians through 16-15.\" Graham Law in The Scotsman reported on the final moments of the semi-final and wrote that, \"Randwick secured ball from the kick-off and when Melrose infringed at a ruck full-time had been reached but, correctly, referee Jim Fleming allowed play to continue and Walker released Campese from nearly halfway. Chalmers, with the first engagement, and Purves both made tackles but Campese, now domiciled in Italy, seemed to expand and aquaplaned to the goal-line. It was no-side and Keith Robertson's men were out. The Sunday Herald of Scotland wrote that, \"No-one else in the tournament would have had the pace and verve to squeeze in at the right corner to deny the hosts...\" Following the tournament Campese admitted that, \"\"If it had not been wet, I would not have made that try against Melrose.\""]}, {"page": "James McLaren", "response": ["Whilst playing for Stirling against Melrose, McLaren was given a 26-week ban by the Scottish Rugby Union for being found to have kicked Craig Chalmers in the head, in a ruck. Stirling County had claimed that slow-motion video evidence proved that while Chalmers had, indeed, been kicked, the act had not been deliberate. The SRU stated that it was their intent for a 26-week ban for kicking to the head to be mandatory. At the rugby union ban, McLaren once again took up rugby league."]}, {"page": "1989 British Lions tour to Australia", "response": ["The Lions suffered a 30–12 defeat in the first test in Sydney on 1 July, then their heaviest defeat by Australia. In this first test, Australia scored four tries, and flyhalf Michael Lynagh kicked 5 from 6. For the second and third tests, changes included Mike Teague, recovered from injury, at blindside flanker; Rob Andrew replacing Craig Chalmers at fly-half; and Jeremy Guscott and Scott Hastings coming into the centre positions. The team became the only Lions team ever to come from 1–0 down to win a series, winning the second test in Brisbane 19–12 and the third test in Sydney 19–18. The Lions completed their tour with a victory of a combined Anzac team. Teague was named player of the series.", "|Craig Chalmers "]}, {"page": "Melrose RFC", "response": ["*  Craig Chalmers"]}, {"page": "Craigmount High School", "response": ["* Craig Chalmers - - Singer and stage performer who appeared on BBC TV's Any Dream Will Do and subsequently starred in Bill Kenwright's production of Joseph and the Amazing Technicolor Dreamcoat"]}, {"page": "Duncan Hodge", "response": ["Hodge won his first full cap as a replacement for Craig Chalmers against France in Paris in 1997, having already booked a place in Scottish rugby lore when his drop goal in the dying seconds secured Scotland A's victory over the 1994 Springboks. He has made 13 appearances for Scotland A, captaining them to their 40–35 win over Argentina in November 2001."]}, {"page": "Birmingham & Solihull R.F.C.", "response": ["*  Craig Chalmers"]}]}}