{"wiki_id": "http://www.wikidata.org/entity/Q30009738", "itemLabel": "Barney Norris", "itemDescription": "British playwright", "wikipedia_url": "https://en.wikipedia.org/wiki/Barney_Norris", "wikipedia_page": {"main": "Barney Norris,  (born 1987) is a British writer.", "link_mentions": [{"page": "Royal Society of Literature", "response": ["| Barney Norris"]}, {"page": "Claire Skinner", "response": ["*Nightfall by Barney Norris, Bridge Theatre Productions, Bridge Theatre (2018)"]}, {"page": "Critics' Circle Theatre Award", "response": ["|Barney Norris"]}, {"page": "Bishop Wordsworth's School", "response": ["*Barney Norris, novelist and playwright"]}, {"page": "Betty Trask Award", "response": ["* Barney Norris for Five Rivers Met on a Wooded Plain - £3,000"]}, {"page": "Up in Arms Theatre Company", "response": ["The company was founded by the director Alice Hamilton and the writer Barney Norris, who first began working together when they met in their local youth theatre in Salisbury. They have presented work in theatres, woods and village halls across the UK, in co-production or in association with Arcola Theatre, The Bush Theatre, Orange Tree Theatre, Out of Joint Theatre Company, The North Wall Arts Centre and Reading Rep.", "*2020 - Lorca's Blood Wedding retold by Barney Norris (a co-production with Wiltshire Creative)", "*2019 - Needletail by Barney Norris (a short film produced by Kate Moore)", "*2017 - While We're Here by Barney Norris (a co-production with the Bush Theatre and Farnham Maltings)", "*2015 - Eventide by Barney Norris (a co-production with Arcola Theatre in association with the North Wall)", "*2014-15 - Visitors by Barney Norris (Arcola, Bush and tour)", "*2012-13 - Fear Of Music by Barney Norris (tour with Out of Joint)", "*2011 - At First Sight by Barney Norris (tour and Latitude Festival)"]}, {"page": "National Theatre Connections", "response": ["*Want by Barney Norris"]}, {"page": "Visitors (play)", "response": ["Visitors is a play by the English playwright Barney Norris. The play premiered at the Arcola Theatre in London in March 2014, in a production directed by Alice Hamilton. It was produced by Norris and Hamilton's company Up In Arms. The cast included Linda Bassett, Robin Soans, Eleanor Wyld and Simon Muller. "]}, {"page": "Bridge Theatre", "response": ["* Nightfall by Barney Norris, starring Ophelia Lovibond, Ukweli Roach, Clare Skinner and Sion Daniel Young, directed by Laurie Sansom (28 April–3 June 2018)"]}, {"page": "Here We Are (novel)", "response": ["*Barney Norris writing in The Guardian praises the novel \"The book wonderfully captures the experience of evacuation during the second world war, which offers a lens through which to study the relationship between growing up and displacement...the thing about this novel: it has an archetypal quality, reminiscent of a folktale, that encourages the reader to think of the vanished stories their own family histories might reveal. I don't know quite how Swift does it – the book is light, perhaps slight, and the story is all told at one or two removes so that it reads as though it's happening in the next room. And yet it's a magical piece of writing: the work of a novelist on scintillating form.\"From the blitz to Brighton’s end-of-the-pier shows, this is a dreamlike story of England’s suburban underbelly Retrieved 5/6/21."]}]}}