{"wiki_id": "http://www.wikidata.org/entity/Q30060045", "itemLabel": "Amar Virdi", "itemDescription": "cricketer (born 1998)", "wikipedia_url": "https://en.wikipedia.org/wiki/Amar_Virdi", "wikipedia_page": {"main": "Guramar Singh Virdi (born 19 July 1998), known as Amar Virdi, is an English cricketer. An off-spin bowler, Virdi played in two Under-19 internationals for England against Sri Lanka in 2016. He made his first-class debut for Surrey in the 2017 County Championship on 26 May 2017.", "link_mentions": [{"page": "Surrey County Cricket Club", "response": ["|style=\"text-align:center\"|19|| Amar Virdi ||  ||  || Right-handed || Right-arm off break ||"]}, {"page": "1998 in the United Kingdom", "response": ["**Amar Virdi, cricketer"]}, {"page": "List of Surrey County Cricket Club players", "response": ["* Amar Virdi (2017–2020) : G. S. Virdi"]}, {"page": "Guramar Singh Virdi", "response": ["#REDIRECTAmar Virdi"]}, {"page": "Guramar Virdi", "response": ["#REDIRECTAmar Virdi"]}, {"page": "India A cricket team and West Indies A cricket team in England in 2018", "response": ["* Amar Virdi"]}, {"page": "England Lions cricket team against Pakistan A in the UAE in 2018–19", "response": ["* Amar Virdi"]}, {"page": "England Lions cricket team in India in 2018–19", "response": ["* Amar Virdi"]}, {"page": "English cricket team in India in 2020–21", "response": ["On 19 January 2021, the BCCI named India's squad for the first two Test matches. They also named K. S. Bharat, Abhimanyu Easwaran, Shahbaz Nadeem, Rahul Chahar and Priyank Panchal as standby players, and Ankit Rajpoot, Avesh Khan, Sandeep Warrier, Krishnappa Gowtham and Saurabh Kumar as net bowlers. Two days later, the ECB announced England's squad for the first two Test matches, with James Bracey, Mason Crane, Saqib Mahmood, Matt Parkinson, Ollie Robinson and Amar Virdi named as reserve players. Ollie Pope was not originally named in England's Test squad after sustaining an injury against Pakistan, but was added to the squad on 3 February 2021, after the England medical team were satisfied he had recovered sufficiently. The following day, Zak Crawley was ruled out of England's squad for the first two Tests with a wrist sprain. Ahead of the first Test, both Shahbaz Nadeem and Rahul Chahar were added to India's squad, after Axar Patel was ruled out of the match with a knee injury. England's Jos Buttler was rested for the last three Tests. Jofra Archer was ruled out of England's squad for the second Test due to an elbow injury. Ahead of the second Test, both Shahbaz Nadeem and Rahul Chahar were withdrawn from India's squad, returning to the reserves."]}, {"page": "English cricket team in Sri Lanka in 2020–21", "response": ["England also named James Bracey, Mason Crane, Saqib Mahmood, Craig Overton, Matt Parkinson, Ollie Robinson and Amar Virdi as reserve players for the tour. Upon arrival in Hambantota, England's Moeen Ali tested positive for COVID-19, and was placed into isolation for ten days. Chris Woakes was identified as a close contact to Ali, and so was forced to self-isolate for seven days."]}, {"page": "Virdi", "response": ["* Amar Virdi, English cricket player"]}]}}