{"wiki_id": "http://www.wikidata.org/entity/Q300030", "itemLabel": "Nick de Bois", "itemDescription": "British politician (born 1959)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nick_de_Bois", "wikipedia_page": {"main": "Geoffrey Nicholas de Bois (born 23 February 1959) is a British Conservative Party politician, who served as Special Adviser and Chief of Staff to Dominic Raab during his brief tenure as Secretary of State for Exiting the European Union. He was elected at the 2010 general election as the Member of Parliament for Enfield North, defeating the Labour incumbent MP Joan Ryan.\nde Bois then went on to lose the seat to Ryan at the next general election, in May 2015.\n\n", "link_mentions": [{"page": "February 23", "response": ["*  1959   – Nick de Bois, English politician"]}, {"page": "Bishop's Stortford", "response": ["*Nick de Bois, former Conservative MP for Enfield North, lives in the town."]}, {"page": "Joan Ryan (politician)", "response": ["Ryan was defeated by Conservative candidate Nick de Bois by 1,692 votes in the 2010 general election. After losing her seat, she was appointed Chief Executive of the Global Tamil Forum, and later became deputy director of the successful NOtoAV campaign.", "During the 2017 general election campaign, Ryan urged constituents in her election literature to vote for her because she was \"independent-minded\" in the context of the perceived unpopularity of Corbyn. She wrote in her election letter that constituents she had spoken to had more faith in Theresa May as PM, than in Corbyn as May's potential successor. Ryan, arguing in line with most opinion polls, said she expected May's government to return with a much larger number of MPs, but that she was well placed to combat such a Conservative majority. It was the fifth time Ryan and Nick de Bois had stood against each other."]}, {"page": "Enfield North (UK Parliament constituency)", "response": ["Boundary alterations based on an increased population within the existing area made the seat notionally Conservative before the 6 May 2010 election, and Nick de Bois won the seat. However, the former Labour MP Joan Ryan, who sat for the constituency from 1997 to 2010, regained it in 2015.  The 2015 result gave the seat the 13th most marginal majority of Labour's 232 seats by percentage of majority.List of Labour MPs elected in 2015 by % majority   UK Political.info.  Retrieved 2017-01-29 De Bois and Ryan stood against each other in this seat over five general elections, between 2001 and 2017, with Ryan winning four of those five.", "| Nick de Bois"]}, {"page": "Culford School", "response": ["*Nick de Bois (Conservative MP 2010- )"]}, {"page": "Public Administration and Constitutional Affairs Select Committee", "response": ["| Nick de Bois MP (Conservative)"]}, {"page": "Blair Babe", "response": ["| 85. || Joan Ryan || Enfield North || 1997/2015 || 2010/2019 || Lost seat to Conservative Nick de Bois. Regained seat in 2015. Resigned from the Labour Party and joined Change UK. Retired"]}, {"page": "Justice Select Committee", "response": ["| Nick de Bois MP (Conservative)"]}, {"page": "British Bangladeshis", "response": ["In March 2015, Nick de Bois, MP for Enfield North, persuaded the British government to stop plans by the exam boards to drop Bengali GCSE and A Level qualifications."]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| Enfield North||style=\"background-color: \"| ||Labour||style=\"background-color: \"| ||Nick de Bois (C)||Gain.  Defeated incumbent Joan Ryan"]}, {"page": "People's Pledge", "response": ["David Amess, Steve Baker, John Baron, Guto Bebb, Andrew Bingham, Brian Binley, Bob Blackman, Peter Bone, Andrew Bridgen, Steve Brine, Conor Burns, Gregory Campbell, Douglas Carswell, William Cash, Christopher Chope, James Clappison, Rosie Cooper, David Crausby, Tracey Crouch, Jon Cruddas, John Cryer, David TC Davies, Philip Davies, Nick de Bois, Caroline Dinenage, Nigel Dodds, Jeffrey Donaldson, Nadine Dorries, Richard Drax, Natascha Engel, Mark Field, Jim Fitzpatrick, Mike Freer, Roger Godsiff, Zac Goldsmith, James Gray, Mike Hancock, Tom Harris, Gordon Henderson, Kate Hoey, Lindsay Hoyle, Philip Hollobone, Adam Holloway, Kelvin Hopkins, George Howarth, Stewart Jackson, Edward Leigh, Julian Lewis, Caroline Lucas, Anne Main, Jason McCartney, Karl McCartney, William McCrea, Iain McKenzie, Patrick Mercer, Nigel Mills, Austin Mitchell, Anne-Marie Morris, Caroline Nokes, David Nuttall, Matthew Offord, Ian Paisley, Neil Parish, Priti Patel, Andrew Percy, Mark Reckless, John Redwood, Simon Reevell, Laurence Robertson, Andrew Rosindell, Jim Shannon, Richard Shepherd, David Simpson, Henry Smith, John Stevenson, Bob Stewart, Graham Stringer, Gerry Sutcliffe, Justin Tomlinson, Andrew Turner, Derek Twigg, Keith Vaz, Martin Vickers, Mike Weatherly, Heather Wheeler, Sammy Wilson."]}, {"page": "List of United Kingdom MPs by seniority (2010–2015)", "response": ["|474||Nick de Bois||style=\"background-color: \"|C||Enfield North"]}, {"page": "List of United Kingdom Conservative MPs (2010–2015)", "response": ["* Nick de Bois"]}, {"page": "Kingsmead School, Enfield", "response": ["In 2012, the Lord Hill of Oareford, Leader of the House of Lords visited the school, stating he was impressed with the \"vibrant teaching and learning environment\".http://www.kingsmeadschool.org/download/May%202012%20newsletter.pdf  Later, Nick de Bois also visited the school after it became one of the first schools in the United Kingdom to achieve academy status. "]}, {"page": "MPs first elected in 2010 to the 55th UK Parliament", "response": ["| Enfield North||style=\"background-color: \"| ||Labour||style=\"background-color: \"| ||Nick de Bois (C)||managing director for Rapier Design Ltd||1959"]}, {"page": "List of MPs elected in the 2015 United Kingdom general election", "response": ["| Enfield North||style=\"background-color: \"| ||Conservative||style=\"background-color: \"| || (L)||Seat gain, defeated incumbent Nick de Bois"]}, {"page": "James Heappey", "response": ["In October 2015, Heappey succeeded Nick de Bois as the Chair of the All Party Parliamentary Group for the UK Events Industry. He also serves as Vice Chairman of the All Party Parliamentary Group for Rural Business, a group which seeks to secure policy outcomes that promote the sustainable growth of the rural economy."]}, {"page": "List of MPs who lost their seat in the 2015 United Kingdom general election", "response": ["|data-sort-value=\"De Bois, Nick\"|Nick de Bois"]}, {"page": "Talkradio", "response": ["* Nick de Bois "]}, {"page": "2021 London mayoral election", "response": ["*Nick de Bois, MP for Enfield North from 2010 to 2015"]}, {"page": "List of British political memoirs", "response": ["* Confessions of a Recovering MP by Nick de Bois (2017)"]}, {"page": "List of MPs who lost their seat in the 2010 United Kingdom general election", "response": ["|Nick de Bois"]}, {"page": "RAF Hospital Ely", "response": ["*Nick de Bois, born at the hospital in 1962"]}]}}