{"wiki_id": "http://www.wikidata.org/entity/Q30014803", "itemLabel": "Elaine Matthews", "itemDescription": "Greek scholar (1942-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Elaine_Matthews", "wikipedia_page": {"main": "Elaine Matthews BA BPhil (19 August 1942 - 26 June 2011) was a British classical scholar at the University of Oxford and one of the principal contributors to the Lexicon of Greek Personal Names.", "link_mentions": [{"page": "Ancient Macedonian language", "response": ["M. Hatzopoulos summarizes the Macedonian anthroponymy (that is names borne by people from Macedonia before the expansion beyond the Axios or people undoubtedly hailing from this area after the expansion) as follows:Greek Personal Names: Their Value as Evidence, Elaine Matthews, Simon Hornblower, Peter Marshall Fraser, British Academy, Oxford University Press (2000), p. 103", "Macedonian onomastics: the earliest epigraphical documents attesting substantial numbers of Macedonian proper names are the second Athenian alliance decree with Perdiccas II (~417–413 BC), the decree of Kalindoia (~335–300 BC) and seven curse tablets of the 4th century BC bearing mostly names.Athens, bottom-IG I³ 89 – Kalindoia-Meletemata 11 K31 – Pydna-SEG 52:617,I (6) till SEG 52:617,VI – Mygdonia-SEG 49:750Greek Personal Names: Their Value as Evidence  by Simon Hornblower, Elaine Matthews"]}, {"page": "Simon Hornblower", "response": ["Since 1979, he has been involved with the Lexicon of Greek Personal Names and co-edited Greek Personal Names: Their Value as Evidence (Oxford University Press, 2000), a role in which he co-operated closely with Elaine Matthews."]}, {"page": "Graea", "response": ["Graea is listed under Boeotia in Homer's Catalogue of Ships in the Iliad. It seems to have included the city of Oropus, though by the fifth century BCE it was probably a kome (district) of that city.G. S. Kirk, The Iliad: A Commentary: Volume 1, Books 1-4. Cambridge University Press, 1985, , p. 191. According to Pausanias the name was a shortcut of the original name Tanagraia, who was daughter of the river-god Asopos. Graea was a greater area including Aulis, Mycalessus, Harma etc.Pausanias: Boeotica 20–24 It is also described by some sources as a city; Fossey argues for its identification with the hill of Dhrámesi 8 km from Tanagra,John M. Fossey, \"The Identification of Graia,\" Euphrosyne 4 (1970), pp. 3–22. while others suggest it is identical with Oropus itself.Simon Hornblower and Elaine Matthews, Greek Personal Names: Their Value as Evidence. Oxford University Press, 2000, , p. 95; similarly Maria Stamatopoulou and Marina Yeroulanou, Excavating Classical Culture: Recent Archaeological Discoveries in Greece. Archaeopress, 2002, , p. 151. "]}, {"page": "List of ancient Macedonians in epigraphy", "response": ["==Atheno-Macedonian decreesDie Staatsverträge des Altertums by Hermann Bengtson, Robert Werner, Deutsches Archäologisches Institut. Kommission für Alte Geschichte und Epigraphik pag. 109- 113 Greek personal names By Elaine Matthews, Simon Hornblower, Peter Marshall Fraser, British Academy pages 99-119 =="]}]}}