{"wiki_id": "http://www.wikidata.org/entity/Q3017697", "itemLabel": "David Collings", "itemDescription": "British actor (1940-2020)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Collings", "wikipedia_page": {"main": "David Collings (4 June 1940 – 23 March 2020) was an English actor. In an extensive career he appeared in many roles on stage, television, film and radio, as well as various audio books, voiceovers, concert readings and other work. He garnered a following through his numerous appearances in cult sci-fi series such as Doctor Who, Sapphire & Steel and Blake's 7, as well as voicing the titular character in the series Monkey and Legolas in the classic BBC Radio 4 adaptation of Tolkien's The Lord of the Rings.", "link_mentions": [{"page": "M. R. James", "response": ["In Spring 2007 UK-based Craftsman Audio Books released the first complete set of audio recordings of James's stories on CD, spread across two volumes and read by David Collings. The ghost story author Reggie Oliver acted as consultant on the project."]}, {"page": "Robot series", "response": ["* This was followed by a 1964 dramatision of The Caves of Steel for the BBC series Story Parade and then four episodes of the BBC television series Out of the Unknown, based on \"Satisfaction Guaranteed\" (1966), \"Reason (in an episode titled \"The Prophet\", 1967), \"Liar!\" (1969), and The Naked Sun (1969). In these adaptations, Elijah Baley was portrayed by Peter Cushing (The Caves of Steel) and Paul Maxwell (The Naked Sun), R. Daneel Olivaw by John Carson (The Caves of Steel) and David Collings (The Naked Sun), and Susan Calvin by Beatrix Lehmann (\"The Prophet\") and Wendy Gifford (\"Liar!\"). In \"Satisfaction Guaranteed\", the character of Susan Calvin was renamed Dr Inge Jensen and portrayed by Ann Firbank."]}, {"page": "John Ruskin", "response": ["* The Love School (1975) a BBC TV series about the Pre-Raphaelites, starring David Collings (Ruskin), Anne Kidd (Effie), Peter Egan (Millais)."]}, {"page": "Elizabeth R", "response": ["* David Collings as Anthony Babington"]}, {"page": "Effie Gray", "response": ["*The Love School (1975), a BBC series about the Pre-Raphaelites, starring Anne Kidd (Gray), David Collings (Ruskin), and Peter Egan (Millais)."]}, {"page": "1995 in film", "response": ["| Persuasion || Sony Pictures Classics || Roger Michell (director); Nick Dear (screenplay); Amanda Root, Ciaran Hinds, Susan Fleetwood, Corin Redgrave, Fiona Shaw, John Woodvine, Phoebe Nicholls, Samuel West, Sophie Thompson, Judy Cornwell, Simon Russell Beale, Felicity Dean, Roger Hammond, Emma Roberts, Victoria Hamilton, Robert Glenister, Richard McCabe, Helen Schlesinger, Jane Wood, David Collings, Darlene Johnson, Cinnamon Faye, Isaac Maxwell-Hunt, Roger Llewellyn, Sally George || Period, Drama || Live action"]}, {"page": "All Gas and Gaiters", "response": ["In April 2016 the radio drama based on the story behind the making of the series, All Mouth and Trousers by Mark Burgess, was aired by BBC Radio 4. The production featured John Sessions as Frank Muir, Nicholas Boulton as Stuart Allen, Gareth Williams as William Mervyn, Trevor Littledale as Robertson Hare, Zeb Soanes as Derek Nimmo and David Collings as John Barron."]}, {"page": "Monkey (TV series)", "response": ["|David Collings"]}, {"page": "R. Daneel Olivaw", "response": ["*In the 1969 British television adaptation of The Naked Sun (an episode of the BBC2 series Out of the Unknown), Daneel was played by David Collings."]}, {"page": "The Robots of Death", "response": ["Russell Hunter was allegedly cast against the intention of the script, which implied that Commander Uvanov should be a physically imposing man, much in the mould of an eighteenth-century sailing master. David Collings, who plays Poul, previously appeared as Vorus in Revenge of the Cybermen and would later appear as Mawdryn in Mawdryn Undead as well as an alternative incarnation of the Doctor in the Big Finish Productions' Doctor Who Unbound audio drama Full Fathom Five. Pamela Salem, who plays Toos, had provided voice work in the preceding story The Face of Evil and would later appear as Professor Rachel Jensen in Remembrance of the Daleks. Salem had been one of the actresses considered for the part of Leela.Doctor Who: The Face of Evil. BBC DVD/2Entertain.  David Bailie went on to play the Celestial Toymaker in the audio plays The Nightmare Fair and Solitaire."]}, {"page": "John Thurloe", "response": ["* He is a recurring character in the BBC television series By the Sword Divided, portrayed by actor David Collings"]}, {"page": "Sapphire & Steel", "response": ["The programme centres on a pair of interdimensional operatives, the eponymous Sapphire and Steel. Very little is revealed about their purposes or backgrounds in the course of the series but they appear to be engaged in guarding the continuing flow of time. They are two of multiple elements that assume human form and are sent to investigate strange events; others include Lead (Val Pringle), who takes the aspect of a jovial, friendly giant, and Silver (David Collings), a technician who can melt metals in his hands.", "Other operatives that appear also have special powers. Silver (played by David Collings), a Specialist who is designated as a Technician, is good with electronics and gadgets, is able to transform one small object into another, and is even able to replicate small objects out of nothing. He can also create long-lasting visual images of objects too large to replicate, although the exact parameters for such images are never revealed. Lead (played by Val Pringle), on the other hand, possesses superhuman strength and can act as needed insulation for Steel when he freezes himself to extreme temperatures.", "The final television story ends on a cliffhanger. Apparently resentful of Sapphire and Steel's independence, a higher authority sends entities known as Transient Beings (similar to the operatives but until now trapped in the past), set a trap for them in a motorway café. The serial concludes with Silver dispatched to an unknown fate – and Sapphire and Steel being trapped in the café, floating through space, apparently for eternity. The cliffhanger has never been resolved, although Hammond has stated that vague plans existed for further adventures. This was also stated by Joanna Lumley in her autobiography,Stare Back and Smile by Joanna Lumley, page 157, Viking Penguin books, 1989.  who remembered that they were told that this was merely an end-of-series cliffhanger, and that Sapphire and Steel would be freed at the start of the next series. However, in an interview with Doctor Who Magazine (#329, cover date: 30 April 2003), David Collings recalled that although another series was planned, Joanna Lumley and David McCallum both decided that they'd had enough and didn't wish to do any more.", "The character of Gold (played by Mark Gatiss) appears in the first adventure The Passenger and returns in Perfect Day and Zero. He is portrayed as impatient and inexperienced when dealing with both humans and the various manifestations of Time, even more detached and clinical in many ways than Steel, almost as if he is still in training. The character of Ruby (played by Lisa Bowerman) appears in the second series story Water Like a Stone, reappearing in Cruel Immortality and Second Sight. Her character has an understanding and affinity to Time within the rhythms of music, and also comes across as rather dry and sardonic, especially when interacting with Steel. David Collings reprises his role as Silver in the third and fifth stories of the first series of audio plays and then again in the third story of the third series. During the production of each series, Nigel Fairs has had to step in at late notice to write a replacement script (writing Dead Man Walking from John Ainsworth's outline in series one, replacing Gary Russell's Big Fun with Cruel Immortality in series two and replacing Joseph Lidster's Reborn with Second Sight in series three)."]}, {"page": "Big Finish Productions", "response": ["Big Finish produced and sold three seasons of Sapphire & Steel audios until their licence expired. Unusually their production included none of the TV actors, instead Susannah Harker played Sapphire (replacing Joanna Lumley) and David Warner played Steel (replacing David McCallum), although David Collings did reprise his role of Silver from the TV series in several releases."]}, {"page": "The Naked Sun", "response": ["The novel was adapted for television as an episode of the British anthology series Out of the Unknown, with Baley being portrayed by Paul Maxwell and Daneel  by David Collings. Broadcast on BBC2 on 18 February 1969, the story was dramatised by Robert Muller and directed by Rudolph Cartier and the music and sound effects were created by Delia Derbyshire of the BBC Radiophonic Workshop.", "* David Collings as R Daneel Olivaw"]}, {"page": "The Lord of the Rings (1981 radio series)", "response": ["* Legolas: David Collings"]}, {"page": "Mawdryn Undead", "response": ["The serial is set in an English boarding school and a spaceship above the Earth in 1977 and 1983. In the serial, the scientist Mawdryn (David Collings), whose people on board the ship have been afflicted by a mutation that constantly causes their bodies to renew themselves, seeks to die using the regenerative abilities of the alien time traveller the Fifth Doctor (Peter Davison) to stop this process and allow them to die.", "David Collings, who played Mawdryn, also appeared in the Fourth Doctor serials Revenge of the Cybermen (1975) as Vorus and The Robots of Death (1977) as Poul, and would himself play an alternate Doctor in Big Finish Productions' Doctor Who Unbound audio play, Full Fathom Five. Angus MacKay previously played Borusa in The Deadly Assassin (1976). John Nathan-Turner felt that Mark Strickson's blond hair didn't stand out well enough from Peter Davison's blond hair. He initially asked Strickson to shave his head, but when Strickson declined, Turner decided that Strickson's hair should be dyed red."]}, {"page": "The Wednesday Play", "response": ["| Peter JeffreyDavid CollingsGodfrey QuigleyJack WatsonEric ThompsonKenneth ThornettTony WallJames ApplebyDavid BrewsterPeter Diamond"]}, {"page": "Theatre 625", "response": ["|Diana Coupland,John Stratton,David Collings,Keith Bell,Angela Crow,Edmond Bennett,Mike Pratt,Catherine Howe,Miriam Raymond,Kenneth Ives,Eric Francis,Keith Anderson"]}, {"page": "Scrooge (1970 film)", "response": ["* David Collings as Bob Cratchit", "# \"Christmas Children\" – David Collings, Richard Beaumont, & Karen Scargill"]}, {"page": "Bob Cratchit", "response": ["* David Collings in the 1970 film Scrooge"]}, {"page": "Kaldor City", "response": ["The plays feature a cast principally drawn from actors who had appeared on television in Doctor Who or Blake's Seven, headed by Paul Darrow, Scott Fredericks and Russell Hunter, with, amongst others, David Baillie, David Collings, Philip Madoc, Peter Miles and Gregory de Polnay. They feature sound design, effects and music by Alistair Lock, and are co-directed by both Stevens and Lock.", "Hidden Persuaders by Jim Smith and Fiona Moore is the third play in the series, and follows the attempts of a terrorist group called \"The Church of Taren Capel\" to commit an act of terrorism to further their cause. The Church has been infiltrated by Blayes, who is working for Chairholder Uvanov, and Kaston Iago is dispatched in an attempt to save her. Iago has also begun acting on his own suspicions, and is attempting to move against Carnell. The title of the play is derived from The Hidden Persuaders by media theorist Vance Packard and is partially an attempt to introduce some of the themes of his work into the series. The play reintroduces the character of Poul/Paullus from The Robots of Death, again played by David Collings.Hidden Persuaders"]}, {"page": "Anthony Babington", "response": ["* David Collings played Babington in the 1971 BBC miniseries Elizabeth R."]}, {"page": "Full Fathom Five (audio drama)", "response": ["*The Doctor — David Collings\t", "*David Collings previously appeared as Vorus in Revenge of the Cybermen (1975), Poul in The Robots of Death (1977) and Mawdryn in Mawdryn Undead (1983). In the last of these, Mawdryn masquerades as a newly regenerated Doctor."]}, {"page": "Revenge of the Cybermen", "response": ["The masks for the principal actors playing the Vogans were specially moulded to their faces, but for the non-speaking artists the BBC had to cut costs. According to actor David Collings on the DVD commentary, who played Vorus, the masks for the extras were made using a facial mould of Dad's Army star Arnold Ridley. Originally, Cyber-costumes from the 1968 serial The Invasion were to have been used, but only two had survived, and in poor condition. This necessitated entirely new outfits, which included chest panels constructed from the innards of old television sets and trousers which, for the first time since The Moonbase, were not tucked into the Cyber-boots. Director Michael E. Briant opted to put the characters on the Nerva Beacon into contemporary clothing and have them use modern machine guns rather than attempt to depict the future through fashion.", "Kevin Stoney appeared in The Daleks' Master Plan and The Invasion (1968). Michael Wisher was in The Ambassadors of Death, Terror of the Autons, Carnival of Monsters, Frontier in Space, Planet of the Daleks, Death to the Daleks, Genesis of the Daleks and Planet of Evil. Ronald Leigh-Hunt previously appeared in The Seeds of Death. William Marlowe appeared in The Mind of Evil. David Collings would later return in Mawdryn Undead and The Robots of Death."]}, {"page": "List of actors who have played the Doctor", "response": ["|David Collings|| rowspan=\"2\" |Full Fathom Five|| rowspan=\"2\" |August 2003||Alternative Doctor"]}, {"page": "Fall of Eagles", "response": ["*David Collings – Paul Miliukov"]}, {"page": "List of companions in Doctor Who spin-offs", "response": ["This Doctor (played by David Collings) had raised Ruth since 2039, when her father, Dr Vollmer, was lost in the destruction of the Deep-sea Energy Exploration Project (DEEP) undersea naval base. When the DEEP was rediscovered in 2066, the Doctor hired a mini-sub to get to the base before the naval recovery team. However, Ruth stowed away on board the mini-sub against the Doctor's wishes."]}, {"page": "Persuasion (1995 film)", "response": ["* David Collings as Mr. Shepherd"]}, {"page": "Doomed Megalopolis", "response": ["|David Collings|| Edward Mannix"]}, {"page": "By the Sword Divided", "response": ["* David Collings – John Thurloe"]}, {"page": "List of people from Brighton and Hove", "response": ["*David Collings, actor (Crime and Punishment, Doctor Who), born in Brighton in 1940"]}, {"page": "The Thirty Nine Steps (1978 film)", "response": ["* David Collings as Tillotson"]}, {"page": "List of The Professionals episodes", "response": ["| David Collings, Pamela Stephenson, Barry Jackson, Tony Osoba, Ronald Leigh-Hunt, Brian Hawksley, Barry Stokes, Trevor Adams"]}]}}