{"wiki_id": "http://www.wikidata.org/entity/Q30164280", "itemLabel": "Wera Hobhouse", "itemDescription": "politician (born 1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Wera_Hobhouse", "wikipedia_page": {"main": "Wera Benedicta Hobhouse (née von Reden; born 8 February 1960) is a British Liberal Democrat politician who has served as Member of Parliament (MP) for Bath since 2017. She has served as the Liberal Democrat Shadow Leader of the House of Commons and the Liberal Democrat Spokesperson for Justice and Women and Equalities under Sir Ed Davey since 2020.\nHobhouse served under Tim Farron and Sir Vince Cable as Spokesperson for Communities and Local Government from 2017 to 2019. She served under Jo Swinson as Liberal Democrat Spokesperson for Environment, Food and Rural Affairs and Transport from 2019 to 2020. She was the Liberal Democrat Spokesperson for Energy and Climate Change from February 2019 to August 2019 and again from January 2020 to September 2020.\n\n", "link_mentions": [{"page": "Bath, Somerset", "response": ["Historically the constituency covered only the city of Bath, however it was enlarged into some outlying areas between 1997 and 2010. The constituency since 2010 once again covers exactly the city of Bath (it is co-extensive with the unparished area), and is currently represented by Liberal Democrat Wera Hobhouse who beat Conservative Ben Howlett at the 2017 general election and retained her seat at the 2019 general election. Howlett had replaced the retiring Liberal Democrat Don Foster at the 2015 general election. Foster's election was a notable result of the 1992 general election, as Chris Patten, the previous Member (and Cabinet Minister) played a major part, as Chairman of the Conservative Party, in re-electing the government of John Major, but failed to defend his marginal seat."]}, {"page": "Somerset", "response": ["The county is divided into nine constituencies, each returning one Member of Parliament (MP) to the House of Commons. In the June 2017 general election, eight constituencies of the county elected Conservative MPs, while Bath elected a Liberal Democrat.BBC  Election 2015: Constituencies The ceremonial county of Somerset contains the constituencies Bridgwater and West Somerset, North East Somerset, North Somerset, Bath, Somerton and Frome, Taunton Deane, Wells, Yeovil, and Weston-super-Mare.  Traditionally several of these have been relatively strong constituencies for the Liberal Democrats, with Labour often getting few votes, even in larger towns such as Yeovil. In the 2019 general election, all nine seats were held, with Jacob Rees-Mogg increasing his majority in North East Somerset, as well as Wera Hobhouse doubling her majority in the Liberal Democrat Bath seat."]}, {"page": "University of Bath", "response": ["On 5 March 2018, at 13:30, a group of 10 Bath students supporting the UCU strike action occupied the vice chancellor's suite in protest of the university's support for UUK's proposed pension reforms. The occupation was endorsed by Bath MP Wera Hobhouse. The university was criticised for its initial response to the protesters, blocking the entrance to the only freely accessible toilets in the occupied area for the first 21 hours of the occupation. The University's response was criticised by local councillor Joe Rayment, alumnus Marcus Sedgwick, NUS Black Students' officer, and prompted the resignation of an external examiner."]}, {"page": "Bath and North East Somerset", "response": ["Before the Reform Act of 1832 Bath elected two members to the unreformed House of Commons. Bath now has a single parliamentary constituency, with Liberal Democrat Wera Hobhouse as Member of Parliament. The rest of the area falls within the North East Somerset constituency. Previously most of the area was in the Wansdyke constituency, which covers the part of B&NES that is not in the Bath constituency. It also contained four wards or parts of wards from South Gloucestershire Council. It was named after the former Wansdyke district."]}, {"page": "Green liberalism", "response": ["Wera Hobhouse MP updated the Green approach to Air pollution and Sir Vince Cable MP, leader of the Liberal Democrats, and Honorary Professor of Economics at Nottingham University, the venue for the 2018 GLD conference, had the task of reviewing how the concept of Sustainable Development withstood the ravages of time. Cable was one of the co-authors of the Brundtland Commission report in 1987 which first introduced the sustainable development concept, championed by Gro Harlem Brundtland, the Commission`s Chair (and three-time Prime Minister of Norway)."]}, {"page": "Hobhouse", "response": ["*Wera Hobhouse, a German-born Liberal Democrat Member of Parliament"]}, {"page": "Bath (UK Parliament constituency)", "response": ["Bath is a constituency in the House of Commons of the Parliament of the United Kingdom represented by Wera Hobhouse of the Liberal Democrats.", "In the 2017 general election, the constituency was regained by the Liberal Democrats' Wera Hobhouse, with the second-highest Liberal Democrat vote share increase nationally (after Richmond Park).", "The current Member of Parliament is Wera Hobhouse of the Liberal Democrats.", "|Wera Hobhouse"]}, {"page": "List of Parliamentary constituencies in Avon", "response": ["|Wera Hobhouse¤"]}, {"page": "Bath and North East Somerset Council", "response": ["Before the Reform Act of 1832, Bath elected two members to the unreformed House of Commons. Bath now has a single parliamentary constituency, with a Liberal Democrat, Wera Hobhouse, as Member of Parliament since 2017. The rest of the council's area falls within the North East Somerset constituency. Previously, most of the area was in the Wansdyke constituency."]}, {"page": "List of Liberal Democrat MPs", "response": ["* Wera Hobhouse, Bath, 2017–present"]}, {"page": "Bath Half Marathon", "response": ["The 2020 event faced criticism after it went ahead despite the 2019-20 coronavirus pandemic. A number of organisations pulled out, and local MP Wera Hobhouse called for it to be cancelled, saying \"protecting the most vulnerable in our city from a further spread of the infection must be the priority.\" Organisers denied accusations they were irresponsible, and the event took place with half the usual number of participants.  Bath MP Wera Hobhouse later said lives probably would have been saved had the event been cancelled, but the \"organiser had no guidance from Government to stop the event.\" Bath Half race director said \"We are not aware of any data or evidence linking outdoor participation events such as the Bath Half with the spread of COVID-19, or with any fatalities from COVID-19 ... In the absence of any such data this type of discussion could be regarded as speculation, even scaremongering.\""]}, {"page": "United Kingdom general election records", "response": ["*Wera Hobhouse, elected for Bath in 2017, after standing in North East Somerset in 2015 and Heywood and Middleton in 2010."]}, {"page": "List of constituencies in South West England", "response": ["|Wera Hobhouse¤"]}, {"page": "List of British people with German ancestry", "response": ["*Wera Hobhouse, ( née von Reden) Liberal Democrat and Member of Parliament for Bath"]}, {"page": "Liberal Democrats (UK)", "response": ["|Wera Hobhouse || Bath"]}, {"page": "English Liberal Democrats", "response": ["* Wera Hobhouse – Bath"]}, {"page": "Wera", "response": ["*Wera Hobhouse, British politician"]}, {"page": "Wendy Chamberlain", "response": ["Chamberlain was one of three Liberal Democrat MPs (alongside Jamie Stone and Wera Hobhouse) to endorse Layla Moran in her ultimately unsuccessful campaign to become leader of the party."]}, {"page": "2012 Rochdale Metropolitan Borough Council election", "response": ["These results also led to the resignation of local Liberal Democrat leader Wera Hobhouse."]}, {"page": "Ben Howlett (politician)", "response": ["He lost Bath to the Liberal Democrat Wera Hobhouse in the 2017 general election."]}, {"page": "2019 United Kingdom general election", "response": ["Successful Liberal Democrat MPs were critical in private of how the party had decided to advocate revoking the exercise of Article 50, and the communication of that policy. Some criticised the election campaign for being \"hubristic\" with its initial defining message that Swinson could be the country's next Prime Minister. Ed Davey, the party's co-acting leader after the election, argued that the unpopularity of Corbyn lost the Liberal Democrats votes to the Conservatives. On the other hand, Wera Hobhouse, who was re-elected by a majority of 12,322, argued that the party had been wrong to pursue a policy of equidistance between Labour and the Conservatives in the general election campaign. Instead, she argued that the party should have concentrated more on campaigning against the Conservatives."]}, {"page": "Frontbench Team of Tim Farron", "response": ["|Wera Hobhouse ", "|Wera Hobhouse "]}]}}