{"wiki_id": "http://www.wikidata.org/entity/Q3018998", "itemLabel": "David Williams", "itemDescription": "Welsh philosopher of the Enlightenment period", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Williams_(philosopher)", "wikipedia_page": {"main": "David Williams (1738 – 29 June 1816) was a Welsh philosopher of the Enlightenment period. He was an ordained minister, theologian and political polemicist, and was the founder in 1788 of the Royal Literary Fund, of which he had been a proponent since 1773.", "link_mentions": [{"page": "Kensal Green Cemetery", "response": ["*NORTH FACE: Joseph Priestley, Thomas Paine, William Hone, John Stuart Mill, Major Cartwright, Richard Carlile, William Lovett, William Carpenter, Henry Hetherington, John Frost, William Cobbett, W. J. Fox, Richard Moore, William Howitt, Samuel Bamford, Henry Hunt, George Thompson, David Williams, Thomas Wooller, Ebenezer Elliott, Ernest Jones, Alex Macdonald, Richard Cobden, Robert Cooper."]}, {"page": "1790 in literature", "response": ["*June 1 – The Royal Literary Fund is founded in Britain by David Williams."]}, {"page": "1772 in literature", "response": ["*David Williams – Letter to David Garrick"]}, {"page": "James Tilly Matthews", "response": ["In the early 1790s, concerned at the likelihood of war between Britain and France, Matthews travelled to France with the radical David Williams who was acquainted with such Girondists as Jacques Pierre Brissot and Le Brun. Williams made efforts at mediation which failed, whereupon Matthews took the lead. He gained the trust of the French government for a short time.", "* Williams, D.,  \"The Missions of David Williams and James Tilly Matthews to England (1793)\", The English Historical Review, Vol.53, No.212, (October 1938), pp. 651–668."]}, {"page": "Index of philosophy articles (D–H)", "response": ["* David Williams (philosopher)"]}, {"page": "List of people granted honorary French citizenship during the French Revolution", "response": ["*David Williams"]}, {"page": "Louis Marie de La Révellière-Lépeaux", "response": ["Of his colleagues he was in alliance with Jean-François Rewbell and to a lesser degree with Barras, but the greatest of his fellow-directors, Lazare Carnot, was the object of his undying hatred. His policy was marked by a bitter hostility to the Christian religion, which he proposed to supplant as a civilizing agent by theophilanthropy, a new religion invented by the English deist David Williams. The credit of the coup d'état of 18 Fructidor (4 September 1797), by which the allied directors made themselves supreme, La Révellière-Lépeaux arrogated to himself in his Mémoires, which in this as in other matters must be read with caution."]}, {"page": "David Williams", "response": ["*David Williams (screenwriter), British television screenwriter", "*David Williams (film distributor), Australian 1984 winner of the Raymond Longford Award", "*David Williams (producer), American film director and producer for ADV Films", "*David Williams (English judge) (died 1613), Justice of the King's Bench", "*Sir David Williams (British legal scholar) (1930–2009), Vice-Chancellor of the University of Cambridge, 1989–1996", "*David Williams (pirate) (fl. 1698-1708), Welsh pirate active near Madagascar", "*David Williams (soldier) (1754–1831), one of the captors of British spy John Andre in the American Revolutionary War", "*Sir David Williams (Royal Navy officer) (1921–2012), British Royal Navy admiral, Second Sea Lord, 1974–1977", "*David Williams (guitarist) (1950–2009), American session guitarist", "*David Williams (Australian indigenous musician) (born 1983), Aboriginal musician and artist", "*David Williams (Welsh guitarist) (born 1986), Welsh guitarist and bassist in Son of Dork", "*David Williams (Australian musician), member of Augie March", "*David Williams (music entrepreneur), head of Shock Records", "*David Williams (Brecon MP) (died 1613), MP for Brecon", "*David Williams (Liberal politician) (1799–1869), British Member of Parliament for Merioneth, 1868–1870", "*David Williams (Swansea East MP) (1865–1941), Labour Member of Parliament for Swansea East, 1922–1940", "*David Williams (trade unionist) (born 1926), Welsh trade unionist", "*Sir David Williams (Richmond upon Thames politician) (born 1939), Leader of Richmond upon Thames Council, 1983–2001", "*David Williams (Australian politician) (born 1941), Australian politician", "*David Williams (minister, born 1709) (1709–1784), Welsh independent minister and schoolmaster", "*David Williams (philosopher) (1738–1816), Welsh minister, theologian and political polemicist", "*David Williams (Oxford academic) (1786–1860), Vice-Chancellor of Oxford University, 1856–1858", "*David Williams (priest, born 1841) (1841–1929), Archdeacon of Cardigan, 1903–1928", "*David Williams (archbishop of Huron) (1853–1931), Welsh-born Anglican Bishop of Huron and later Metropolitan of Ontario", "*David Williams (priest, born 1862) (1862–1936), Archdeacon of Cardigan, 1928–1936", "*David Williams (Methodist minister, born 1877) (1877–1927), Welsh theologian and minister", "*David Williams (bishop of Basingstoke) (born 1961), Anglican Bishop of Basingstoke", "*David Williams (geologist, born 1792) (1792–1850), English geologist and priest", "*David Williams (geologist, born 1898) (1898–1984), British professor of geology", "*David Williams (astrochemist) (born 1937), British astrochemist", "*David Williams (space administrator) (born 1951), Chief Executive of the UK Space Agency", "*David Williams (mathematician), Welsh mathematician in probability theory", "*David Williams (Canadian physician), Canadian physician, Ontario's Chief Medical Officer of Health", "*David Williams (footballer, born 1931), English footballer", "*David Williams (footballer, born 1955), Welsh football coach and player for Bristol Rovers", "*David Williams (footballer, born 1968), English football goalkeeper", "*David Williams (Australian soccer) (born 1988), Australian soccer player", "*David Williams (running back) (born 1994), American football running back", "*David Williams (defensive back), American football player, see Atlanta Falcons draft history", "*David Williams (wide receiver) (born 1963), American football player at the University of Illinois", "*David Williams (offensive lineman) (born 1966), American football offensive lineman", "*David Williams (Australian rules footballer) (born 1961), former Australian rules footballer", "*David Williams (2000s pitcher) (born 1979), American baseball pitcher", "*David Williams (cricketer, born 1948), English cricketer", "*David Williams (cricketer, born 1963), West Indian cricketer", "*David Williams (rugby league) (born 1986), Australian rugby league player", "*David Williams (rugby union, born 1894) (1894–1959), Australian rugby union player", "*David Williams (rugby union, born 1995), English rugby union player", "*Tiger Williams (David Williams, born 1954), Canadian ice hockey player", "*David Williams (judoka) (born 1965), American judoka", "*David Williams (ice hockey) (born 1967), American ice hockey player", "*David Williams (born 1972), American wrestler better known by the ring name David Young", "*David Williams (card game player) (born 1980), American poker player", "*David Williams (American cyclist) (born 1988), American cyclist", "*David Williams (Canadian cyclist) (born 1994), Canadian cyclist", "*David Williams (darts player), see 2011 PDC Under-21 World Championship", "*David Williams (golfer), see Atlantic Open", "*David Williams (racing driver), see 1982 British Formula One season", "*David Williams (sailor) (born 1966), British Olympic sailor", "*David Williams (tennis), see 1929 Wimbledon Championships – Men's Singles", "*David Williams (historian) (1900–1978), Welsh historian", "*David Williams (crime writer) (1926–2003), British advertising executive and crime writer", "*David Williams (medievalist) (1939–2015), Canadian medieval literature scholar", "*David Williams (journalist), Australian author and journalist", "*David Williams (natural history writer), American natural history writer", "*David Williams (coal owner) (1809–1863), Welsh industrialist", "*David Williams (businessman, born 1969), British entrepreneur and founder of Avanti Communications Group plc", "*David Williams (Alaska architect), architect and community planner in Alaska", "*David Williams, character in Another Man, Another Chance", "*David Williams-Thomas, High Sheriff of the West Midlands, 1980–1981"]}, {"page": "St Anne's Church, Soho", "response": ["The tower, however, became unstable by 1800 and, after 41 meetings of a \"Tower Rebuilding Committee\" came no closer to solving the problem, the architect Samuel Pepys Cockerell was commissioned to design a replacement. The original tower was demolished (though the 1 ton clock bell, cast in 1691 and still in use, was retained) and the new tower's brickwork was completed by 1801, its bell chamber's Portland stonework by March 1803, and its copper cupola by May 1803. The new tower's ground floor room became the parish's vestry room, and later (in the 20th century) a robing room for the clergy, and in the  deep brick chamber beneath it are interred the ashes of the novelist Dorothy L Sayers, who was a longtime Churchwarden of the parish and member of the St. Anne's Society. 19th century burials in the churchyard included David Williams (1816) and William Hazlitt (1830). Also placed in the crypt was the body of Thomas Pitt, 2nd Baron Camelford in 1804."]}, {"page": "William Frend (reformer)", "response": ["Frend was one of the group of reformers who supported at this time the early activities of the Literary Fund set up by David Williams. There he worked alongside Thomas Christie, Alexander Jardine, James Martin, and John Hurford Stone. Their views, however, did not have it all their own way."]}, {"page": "List of names in A Biographical Dictionary of Modern Rationalists", "response": ["*David Williams"]}, {"page": "1810s in Wales", "response": ["**29 June - David Williams, Enlightenment philosopher (b. 1738) "]}, {"page": "David Williams (minister, born 1709)", "response": ["David Williams (1709 – 5 April 1784) was an Independent minister and schoolmaster.  His pupils included the philosopher David Williams, with whom he is sometimes confused."]}, {"page": "David Williams (minister)", "response": ["#REDIRECT David Williams (philosopher)"]}, {"page": "David Williams (1738-1816)", "response": ["#REDIRECT David Williams (philosopher)"]}, {"page": "1730s in Wales", "response": ["*date unknown - David Williams, philosopher (d. 1816)"]}, {"page": "1816 in Wales", "response": ["*29 June - David Williams, Enlightenment philosopher, 78"]}, {"page": "1796 in Wales", "response": ["*David Williams - The History of Monmouthshire"]}, {"page": "1790 in Wales", "response": ["*18 May - The first meeting of the Literary Fund, founded by David Williams (\"to assist indigent authors\") takes place in London.", "*David Williams - Lessons to a Young Prince (published anonymously)"]}, {"page": "1773 in Wales", "response": ["**David Williams, having resigned from the ministry, opens a school in Chelsea."]}, {"page": "1771 in Wales", "response": ["*David Williams - The Philosopher, in Three Conversations"]}, {"page": "Cavendish Square", "response": ["A blue plaque unveiled in 1951 commemorates H.H. Asquith,  the Liberal Prime Minister of the United Kingdom from 1908 to 1916, having long lived at №20. Another is to Quintin Hogg, founder of what is now the University of Westminster and the flagship building of the university backs on to his former family home.  The square hosts the Royal College of Nursing headquarters and the West London Synagogue. Near to Harley Street, some of the grand townhouses accommodate medical practices such as those of James Paget.  Artist Robert William Sievier lived on the square, and David Williams, founder of the Royal Literary Fund, ran a chapel.  Frances Fanshawe, wife of  Abraham Blackborne, grandson of Richard Levett, Lord Mayor of London, died at her home on Margaret Street, an approach way, in 1795 and was buried at Kew.Visitation of England and Wales,  Joseph J. Howard Frederick A. Crisp, Reissued by Heritage Books, 1997  Tombs in the Church at Kew, Frances Fanshaw (relict of Rev. Abraham Blackborne), The Environs of London: Counties of Herts, Essex and Kent, Vol. 4, pp. 577-617, Daniel Lysons, 1796, British History Online"]}, {"page": "Theophilanthropy", "response": ["The first idea of the sect really belongs to David Williams, a Welsh minister who exercised considerable influence in Paris during the Revolution. Chemin consulted the Calvinists before launching his Manuel."]}, {"page": "Club of Thirteen", "response": ["The Club of Thirteen or Wednesday Society was a Radical intellectual club in London founded by David Williams in the 1770s."]}, {"page": "1738 in Wales", "response": ["*date unknown - David Williams, philosopher (died 1816)"]}, {"page": "List of dissenting academies (1660–1800)", "response": ["|John Conder under Ridgley and Eames at Moorfields; John Howard, David Jennings, Samuel Pike, David Williams, all under Eames.", "|Euros Bowen, David Davis, John Jenkins (Ifor Ceri), Thomas Rees, David Williams, David Williams (1709–1784)."]}, {"page": "Octagon Chapel, Liverpool", "response": ["Although it was adopted by a prominent minister, David Williams, for his congregation at Exeter, the liturgy proved controversial and even divisive. Seddon and Holland were founders of the nearby Warrington Academy: John Taylor, who was a tutor there, opposed the liturgy from before the time of its publication.. Seddon and Taylor had in fact a profound disagreement on the suitability of the philosophy of Francis Hutcheson for the teaching at the academy;Geoffrey Thackray Eddy, Dr Taylor of Norwich: Wesley's Arch-Heretic (2003), pp. 134–5. while the liturgy was Hutchesonian in intent.McCarthy, pp. 67, 152."]}, {"page": "John Gardnor", "response": ["In 1782 Gardnor exhibited again, this time at the Royal Academy, sending two landscapes, and continued to be a frequent contributor of landscapes and views up to 1796. On 16 May 1787 Gardnor started with his nephew Richard on a tour to Paris, Geneva, Lausanne, Basle, Strasburg, and back down the Rhine. He made numerous drawings of the scenery on the Rhine, which he published in folio parts, the first of which appeared in 1788 entitled Views taken on and near the River Rhine, at Aix-la-Chapelle, and on the River Maese. These views were engraved in aquatint by Elizabeth and William Ellis, Robert Dodd, Samuel Alken, J. S. Robinson and by Gardnor himself. A smaller edition was published in 1792, in which the aquatints were executed by Gardnor and his nephew. Gardnor also executed a series of views in Monmouthshire for David Williams's History of Monmouthshire, published in 1796; they were engraved in aquatint by Gardnor himself and J. Hill. In 1798 a sermon was printed which he preached before the armed association of Battersea."]}, {"page": "Eglwysilan", "response": ["* David Williams (1738–1816) - theologian and founder of the Royal Literary Fund."]}, {"page": "Thomas Morris (British Army officer)", "response": ["* A Life of the Rev. D. Williams, 1792. This was a biography of David Williams, founder of the Royal Literary Fund."]}, {"page": "Grade I listed buildings in Monmouthshire", "response": ["The architecture of the county was first systematically covered by William Coxe in his two-volume, An Historical Tour in Monmouthshire, published in 1801.An earlier history, authored by David Williams, a Welsh minister, was published in 1796. Coxe's Preface explains the Tour's genesis; \"The present work owes its origin to an accidental excursion in Monmouthshire, in company with my friend Sir Richard Hoare, during the autumn of 1798. I was struck with the picturesque ruins of ancient castles, and I was animated with the view of mansions distinguished by the residence of illustrious persons\". A detailed county history was undertaken by Sir Joseph Bradney, in his A History of Monmouthshire from the Coming of the Normans into Wales down to the Present Time; published in the early 20th century. More recent studies include those of the architectural historian John Newman, in his Gwent/Monmouthshire volume of the Pevsner Buildings of Wales series; and, most exhaustively, by Sir Cyril Fox and Lord Raglan, in their three-volume study, Monmouthshire Houses. The last was described by the architectural historian Peter Smith as \"one of the most remarkable studies of vernacular architecture yet made in the British Isles, a landmark, in its own field, as significant as Darwin's Origin of Species\"."]}, {"page": "William Hamilton Reid", "response": ["Rise and Dissolution purported to trace the connections, dating from the 17th century, between religious enthusiasm and secular reform organisations. Reid associated Priestley's rational dissent with the opinions of David Williams, supporter of the Octagon Chapel liturgy and \"unconditional philosophical liberty\". He tended to blur distinctions between reformers, unbelievers, deists and millenarians, all of whom were accorded a hearing in the Unitarian tradition of unbounded debate. He characterized the \"Society of Ancient Deists\", who met near Hoxton in the period 1770 to 1790, as \"infidel mystics\"."]}, {"page": "Alexander Jardine (British Army officer)", "response": ["Politically, he identified as a Foxite critic of Lord North, an admirer of the theories on liberty of David Williams (philosopher), and his Letters were praised by Ralph Griffiths. He was personally acquainted with the reformer Francisco de Miranda. By the 1790s he was a regular of William Godwin's circle, to which he introduced James Glenie, and was familiar with some of the radical authors of the period, including William Ogilvie of Pittensear. He met Gaspar Melchor de Jovellanos in 1793, and they corresponded, but without finding much common ground."]}]}}