{"wiki_id": "http://www.wikidata.org/entity/Q3017842", "itemLabel": "William Bundey", "itemDescription": "Australian politician and judge", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Henry_Bundey", "wikipedia_page": {"main": "Sir William Henry Bundey (30 January 1838 – 6 December 1909) was an Australian politician and judge, Attorney-General of South Australia from 27 September 1878 to 10 March 1881.", "link_mentions": [{"page": "Robert Richard Torrens", "response": ["He was created Knight Commander of the Order of St Michael and St George (KCMG) on 1 August 1872 and Knight Grand Cross of the Order of St Michael and St George (GCMG) on 24 May 1884, for his services \"in connection with the Registration of Titles to Land Act\". The Queensland, New South Wales, Victorian and Tasmanian Parliaments all gave him votes of thanks, but   when in 1880 the attorney-general Sir William Bundey moved in the South Australian House of Assembly to grant Torrens a pension of £500, it was bitterly shouted down and the proposal had to be withdrawn, such was the animosity Torrens had aroused in some quarters."]}, {"page": "William Bundey (mayor)", "response": ["William Bundey (26 January 1826 – 2 April 1889) was Mayor of Adelaide, South Australia from 1883 to 1886."]}, {"page": "Members of the South Australian House of Assembly, 1871–1875", "response": ["|| William Bundey || Onkaparinga || 1871–1875, 1878–1881"]}, {"page": "List of judges of the Supreme Court of South Australia", "response": ["Of the judges of the Supreme Court of South Australia, , 14 had previously served in the Parliament of South Australia Edward Gwynne, Sir Richard Hanson, Randolph Stow, Sir Samuel Way, Sir James Boucaut, Richard Andrews, Sir William Bundey, Sir John Gordon, Robert Homburg, Sir Angas Parsons, Sir Charles Abbott, Leo Travers, Len King and Robin Millhouse. In addition, Sir John Jeffcott served as a member of the South Australian Legislative Council concurrent with his brief tenure as a judge in South Australia.", "| data-sort-value=\"Bundey, William\" | Sir William Bundey ||  ||  ||  ||  || "]}, {"page": "Attorney-General of South Australia", "response": ["| 14 || data-sort-value=\"Bundey\" | William Bundey || || 27 September 1878 || 10 March 1881 ||"]}, {"page": "Electoral district of Onkaparinga", "response": ["| William Bundey ", "| William Bundey "]}, {"page": "William Bundey", "response": ["William Bundey may refer to:", "*William Bundey (mayor) (1826–1889), mayor of Adelaide, South Australia 1883 to 1886"]}, {"page": "Bundey", "response": ["* William Bundey (mayor) (1826–1889), Mayor of Adelaide, South Australia from 1883 to 1886"]}]}}