{"wiki_id": "http://www.wikidata.org/entity/Q30122543", "itemLabel": "Callum Smith", "itemDescription": "Scottish footballer (born 1999)", "wikipedia_url": "https://en.wikipedia.org/wiki/Callum_Smith_(footballer)", "wikipedia_page": {"main": "Callum Smith (born 13 November 1999) is a Scottish footballer who plays as a forward for Airdrieonians. Smith has previously played for Alloa Athletic, Arbroath, Hamilton Academical and  Dunfermline Athletic.", "link_mentions": [{"page": "David Price (boxer)", "response": ["On 7 August 2017, it was announced that Price would fight again on the undercard of Callum Smith vs. Erik Skoglund at the Echo Arena in Liverpool on 16 September 2017. Price last fought at the Echo Arena in July 2013, where he lost his second consecutive fight to American veteran Tony Thompson. It was revealed that Price had parted ways with trainer Dave Coldwell and would now train with George Vaughan, Derry Mathews and Joe McNally. Price called this fight a 'make or break' for career. A day later, it was announced that he would fight journeyman Raphael Zumbano Love. Former trainer Coldwell stated based on his last conversation with Price, he had decided to retire. Coldwell wished Price well in his return. Following a hand injury suffered in training, the fight was called off. Price would next fight UK based Polish journeyman Kamil Sokolowski on 2 December 2017 at the Brentwood Centre Arena in Brentford, having last fought there in 2010. Price put on a muted performance, beating Sokolowski after six rounds. The referee scored the fight 60–54 in favour of Price. He stated he intentionally went the full six rounds. In the post-fight interview, Price said, ”He’d be a good sparring partner. I thought that was a good performance tonight. I landed most of my jabs. I want to do an 8 rounder. I must have thrown 4 punches all night with spite in it. I was boxing his face off.” When asked who he would fight next, Price gave no names."]}, {"page": "List of Hamilton Academical F.C. players", "response": ["|Callum Smith||||2020–2021||24||2||"]}, {"page": "2016–17 Dunfermline Athletic F.C. season", "response": ["| Callum Smith"]}, {"page": "2017–18 Dunfermline Athletic F.C. season", "response": ["*5 May 2017: After finishing fifth at the end of the 2016–17 season, manager Allan Johnston opted to offer new deals to the majority of the playing squad. Three first team players who were not offered new deals were Lewis Spence, Euan Spark, and Ben Richards-Everton, the last of which had struggled with injury during the 2016–17 season. Additionally, the club decided that they would not enter a youth side into the 2017–18 SPFL Development League with four youth players being subsequently released. Cammy Gill, Stuart Morrison, Scott Lochhead, Brandon Luke and Callum Smith were all promoted to the first-team.", "| Callum Smith", "|8 ||FW||||Callum Smith||3||2||||1||||", "| style=\"width:250px;\"|  Callum Smith", "| style=\"width:200px;\"|  Callum Smith", "| Callum Smith", "| Callum Smith"]}, {"page": "Callum Smith (disambiguation)", "response": ["Callum Smith may refer to:", "*Callum Smith (born 1990), British professional boxer", "*Callum Smith (skier) (born 1992), British cross-country skier", "*Callum Smith (footballer) (born 1999), Scottish footballer for Dunfermline Athletic"]}, {"page": "2018–19 Dunfermline Athletic F.C. season", "response": ["| Callum Smith", "||FW||||Callum Smith||1||||||||1", "|23||FW||||Callum Smith||1||||1||||||||||||||", "| Callum Smith"]}, {"page": "2019–20 Dunfermline Athletic F.C. season", "response": ["| Callum Smith", "| Callum Smith"]}, {"page": "2020–21 Dunfermline Athletic F.C. season", "response": ["| Callum Smith"]}, {"page": "2020–21 Hamilton Academical F.C. season", "response": ["| 2 July 2020 || CF ||  || Callum Smith ||  Dunfermline Athletic || Free transfer || "]}]}}