{"wiki_id": "http://www.wikidata.org/entity/Q30122082", "itemLabel": "Charles Smith", "itemDescription": "Australian politician (born 1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Smith_(Western_Australian_politician)", "wikipedia_page": {"main": "Charles Leonard Smith (born 4 October 1970) is an Australian politician. He was elected at the 2017 Western Australian election to represent the East Metropolitan Region in the Western Australian Legislative Council from 22 May 2017 for Pauline Hanson's One Nation. In June 2019, Smith resigned from One Nation to sit as an independent. In May 2020 he joined the Western Australia Party, and stood as their candidate at the 2021 state election, but was defeated.During the election campaign, the Pauline Hanson's One Nation party arranged a preference deal with the Liberal Party. Smith was one of a number of One Nation candidates who did not agree with the deal, and encouraged voters to make up their own minds.Prior to entering Western Australian state politics, Smith served as a police officer in Kalgoorlie, specialising in domestic violence and child protection work. He also worked for a period with the Western Australian Department of Mines and Petroleum as a prospector approvals facilitator.\nIn 2016, Smith unsuccessfully sought Nationals pre-selection for the federal seat of O'Connor. He subsequently left the Nationals, stating to the Kalgoorlie Miner: \"My politics is probably different from the National Party; it was more conservative anyway, hence the interest in what One Nation were doing.\"\nIn his inaugural speech in the Western Australian Legislative Council, Smith called for tougher law and order measures to tackle crime and a state population policy to reduce growth pressures on Perth. He also warned that community cohesion was in decline:A growing chunk of the body politic lacks drive and common purpose. Many people feel that their country is at risk of losing the values that made it strong and had it being looked upon with jealous eyes from overseas. Many people feel that their country is slipping away, socially and culturally. They notice the decline in community-mindedness and watch as reminders of our Western Judeo-Christian and British heritage are erased from school curricula and the public sphere. They see the growing entrenchment of asymmetrical multiculturalism, consumerism and hyper-individualism.\nSmith lives in Gingin with his wife, Helen and his two sons, Tristan and George.\nOn 11 June 2019, Smith informed the President of the Legislative Council that he had resigned from One Nation, citing a \"long line of frustrations\" with the party.On 12 May 2020, Smith joined the Western Australia Party and urged fellow independents to join the party.", "link_mentions": [{"page": "Pauline Hanson's One Nation", "response": ["* Charles Smith MLC (East Metropolitan, 2017–2019, became an independent in 2019 then joined the Western Australia Party, continuing his service as MLC until 2021)."]}, {"page": "Charles Smith", "response": ["*Charles Smith (topographer) (1715–1763), Irish topographer and writer", "*Charles Smith (mathematician) (1844–1916), British academic", "*Charles Smith (actor) (1920–1988), American actor", "*Charles Smith (artist) (1749–1824), Scottish artist", "*Charles Smith (singer) (1786–1856), English tenor and bass, organist and composer", "*Charles Smith (songwriter), American record producer and songwriter", "*Charles Smith (playwright), American playwright and educator", "*Dr. Charles Smith (born 1940), artist and activist", "*Charles Smith (Victorian politician) (1833–1903), member of the Victorian Legislative Assembly 1883–1892", "*Charles Smith (Western Australian politician) (born 1970), member of the Western Australian Legislative Council from 2017", "*Charles Smith (MP) (1756–1814), British politician, Member of Parliament", "*Charles Smith (pathologist), Canadian forensic pathologist reprimanded for his evidence in shaken baby cases since 1992", "*Charles Smith (American football) (1924–2013), American football player", "*Chino Smith (Charles Smith, 1903–1932), Negro league baseball player", "*Red Smith (pitcher) (Charles Smith), American Negro league baseball player", "*Charles Smith (basketball, born 1965), University of Pittsburgh and New York Knicks", "*Charles Smith (basketball, born 1967), Georgetown University and Boston Celtics", "*Charles Smith (basketball, born 1975), University of New Mexico and Portland Trail Blazers", "*Charles Smith (basketball, born October 1975) (born 1975), American-English basketball player", "*Charles Smith (cricketer, born 1879) (1879–1949), English cricketer", "*Charles Smith (cricketer, born 1861) (1861–1925), English cricketer", "*Charles Smith (cricketer, born 1864) (1864–1920), New Zealand cricketer and administrator", "*Charles Smith (cricketer, born 1849) (1849–1930), English cricketer", "*Charles Smith (South African cricketer) (1905–1967), South African cricketer", "*Charles Smith (cricketer, born 1838) (1838–1909), English cricketer", "*Charles Smith (cricketer, born 1898) (1898–1955), English cricketer", "*Charles Smith (sailor) (1889–1969), American sailor who competed in the 1932 Summer Olympics", "*Charles Smith (polo) (active 1972–1981), American polo player", "*Charles Smith (rugby) (1909–1976), New Zealand rugby football player", "*Charles Smith (Australian footballer) (1901–1968), Australian footballer", "*Charles Smith Jr., rugby league footballer of the 1910s", "*Charles Smith (cowboy) (\"Hairlip\" Charlie Smith; 1844–1907), frontiersman and lawman in the Old West, member of Wyatt Earp's posse", "*Charles Smith (developer) (1901–1995), American real estate developer and philanthropist in the Washington DC area"]}, {"page": "East Metropolitan Region", "response": ["| rowspan=\"3\"|Charles Smith"]}, {"page": "Candidates of the 2017 Western Australian state election", "response": ["#Charles Smith*"]}, {"page": "Western Australia Party", "response": ["On 12 May 2020, the party gained its first member of parliament when former One Nation MP and Legislative Council member for East Metropolitan, Charles Smith, joined the party."]}, {"page": "Members of the Western Australian Legislative Council, 2017–2021", "response": ["|| Hon Charles Smith || One Nation/Independent/Western Australia Party  || East Metropolitan || 2017–2021", ": East Metropolitan One Nation MLC Charles Smith resigned from the party on 11 June 2019."]}, {"page": "Charles Smith (Victorian politician)", "response": ["Charles Smith (5 August 1833 – 25 September 1903) was a member of the Legislative Assembly of Victoria from 1883 until 1892."]}, {"page": "Charles Leonard Smith", "response": ["#REDIRECT Charles Smith (Western Australian politician)"]}, {"page": "Candidates of the 2021 Western Australian state election", "response": ["The Labor Party was defending three seats. The Liberal Party was defending one seat. The Greens were defending one seat. One Nation was defending one seat, although sitting MLC Charles Smith defected to the Western Australia Party.", "#Charles Smith"]}]}}