{"wiki_id": "http://www.wikidata.org/entity/Q30161661", "itemLabel": "Finn Cole", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Finn_Cole", "wikipedia_page": {"main": "Finlay Lewis J. Cole (born 9 November 1995) is an English actor from Kingston, London. He is known for his role in the BBC series Peaky Blinders as Michael Gray. He is currently starring as Joshua \"J\" Cody in TNT's Animal Kingdom, and played young Jakob Toretto in the film F9.\n\n", "link_mentions": [{"page": "An Inspector Calls", "response": ["In 2015, an 86-minute An Inspector Calls film was screened on BBC One. Adapted by Helen Edmundson and directed by Aisling Walsh for Drama Republic,BBC One announces ambitious season of classic 20th-century literature, BBC Media Centre, 24 April 2014, Retrieved 28 June 2015 it stars David Thewlis as Inspector Goole,, Evening Standard, 28 August 2015, Retrieved 20 October 2015 Chloe Pirrie as Sheila Birling, Sophie Rundle as Eva Smith/Daisy Renton, Ken Stott as Arthur Birling, Kyle Soller as Gerald Croft, Miranda Richardson as Sybil Birling and Finn Cole as Eric Birling."]}, {"page": "1995 in film", "response": ["* November 9 - Finn Cole, English actor"]}, {"page": "Noriaki Sugiyama", "response": ["* Slaughterhouse Rulez (Don Wallace) (Finn Cole)"]}, {"page": "Esher Sixth Form College", "response": ["* Finn Cole, actor"]}, {"page": "Cole (surname)", "response": ["*Finn Cole (born 1995), English actor"]}, {"page": "1995 in the United Kingdom", "response": ["* 9 November – Finn Cole, actor"]}, {"page": "List of Fast & Furious characters", "response": ["*Vinnie Bennett, Finn Cole, Cered, Ozuna, Azia Dinea Hale, Siena Agudong, Karson Kern, and Igby Rigney portray young versions of Dominic, Jakob, Leo, Santos, Letty, Mia, Vince and Jesse respectively in F9.", "Jakob Toretto is the estranged brother of Dom and Mia, son of Jack, brother-in-law of Brian O'Conner and Letty Ortiz, uncle of Jack, Brian, and Gisele. He works as a master thief, assassin and a high performance driver. He was Mr. Nobody's subordinate but went rogue prior to the series. It is revealed that Dom banished Jakob from the family after he accused him of causing their father's death, which was due to Jakob leaving an oil patch on the racetrack where their father ultimately died. Soon after, Jakob is taken in by Buddy, one of the member of their father's pit crew. Due to this, Jakob holds a personal grudge against Dom, who he claims to have \"turned his back\" on him, despite Dom's \"never turn your back on family\" motto, therefore wanting him to either \"live under his shadow\" or get killed. Because of this reason, he and his personal associate Otto capture the cyber-terrorist Cipher (although Jakob refuses to work with her as he \"doesn't work for the competition\") and force her to give them the remaining pieces to Project Aries, a device that can hack into any computer weapons system. Towards the end of F9, however, Otto double-crosses Jakob and begins to work with Cipher, leading the brothers to reconcile and work together in the movie's final battle to defeat Cipher, even though she escapes once more. At the end of the film, Dom finally forgives Jakob for his role in their father's death by helping him escape his enemies by giving him the keys to his Dodge Charger, similar to what Brian O'Conner did with Dom in the first film. Jakob Toretto portrayed by John Cena. Young Jakob is portrayed by Finn Cole."]}, {"page": "List of people from the Royal Borough of Kingston upon Thames", "response": ["* Finn Cole, actor (1995)"]}, {"page": "Peaky Blinders (TV series)", "response": ["| Finn Cole", "* Finn Cole as Michael Gray (series 2–present), Polly's biological son."]}, {"page": "Joe Cole (actor)", "response": ["Cole was born in November 1988, one of the oldest of five boys. His younger brother Finn Cole is also an actor and co-stars alongside him in Peaky Blinders."]}, {"page": "Dean-Charles Chapman", "response": ["In 2019, he was cast, alongside George MacKay, as one of the two leads in the Sam Mendes-directed war film 1917.  The film went on to receive ten Academy Award nominations, winning three. Subsequently, he played the lead role of Matthew in the Eoin Macken's drama Here Are the Young Men, supported by Finn Cole, Anya Taylor-Joy, and Ferdia Walsh-Peelo."]}, {"page": "F9 (film)", "response": ["* John Cena as Jakob Toretto, Dom and Mia's estranged brother who is working as a master thief, assassin, and high-performance driver; also Mr. Nobody's rogue agent. Finn Cole portrays a young Jakob.", "In June 2019, John Cena was officially cast in the film, after an initial announcement from Diesel in April. In July 2019, Finn Cole, Anna Sawai, and Vinnie Bennett joined the cast of the film. That same month, it was announced Helen Mirren and Charlize Theron would reprise their roles, with Michelle Rodriguez also confirmed to return. Michael Rooker and MMA Fighter Francis Ngannou were added to the cast in August. In October 2019, Ozuna and Cardi B joined the cast of the film."]}, {"page": "An Inspector Calls (2015 TV film)", "response": ["* Finn Cole as Eric Birling"]}, {"page": "List of American films of 2020", "response": ["| Dreamland || Vertical Entertainment || Miles Joris-Peyrafitte (director); Nicolaas Zwart (screenplay); Finn Cole, Margot Robbie, Travis Fimmel, Kerry Condon, Darby Camp, Garrett Hedlund, Lola Kirke || "]}, {"page": "Animal Kingdom (TV series)", "response": ["* Finn Cole as Joshua \"J\" Cody, Smurf's grandson who moves in with her and his uncles following the death of his mother, Julia, who was Pope's twin sister. J is the only one who will challenge Smurf and wants to take power over her and her life."]}, {"page": "List of Animal Kingdom episodes", "response": ["Animal Kingdom is an American drama television series developed by Jonathan Lisco, based on the 2010 Australian film by David Michôd. The series follows a 17-year-old boy (Finn Cole), who, after the death of his mother, moves in with the Codys, a criminal family clan governed by matriarch Janine \"Smurf\" Cody (Ellen Barkin). Animal Kingdom debuted on TNT on June 14, 2016."]}, {"page": "Hermione Corfield", "response": ["She starred in the 2017 film Bees Make Honey, and in the 2018 British comedy film Slaughterhouse Rulez, along with Asa Butterfield, Finn Cole, Michael Sheen, Nick Frost, and Simon Pegg."]}, {"page": "Slaughterhouse Rulez", "response": ["Slaughterhouse Rulez is a 2018 comedy horror film directed by Crispian Mills. Written by Mills and Henry Fitzherbert, the film's cast features Asa Butterfield, Finn Cole, Hermione Corfield, Michael Sheen, with Nick Frost and Simon Pegg.", "After his father dies, Donald Wallace (Finn Cole), a teenager from a working-class family, enrolls in an exclusive public school called Slaughterhouse, where he struggles to fit in. The school houses a few secrets, such as the recent suicide of a pupil last term, mysterious disappearances, an overzealous house prefect who descends from a long line of war criminals, and an enigmatic new sinkhole, caused by the Headmaster’s (Michael Sheen) money-making scheme: fracking. Aggressive subterranean creatures emerge from the sinkhole and start attacking members of the faculty. Wallace then rallies a group of pupils to fight the monsters. The film ends with the monsters' defeat, the explosive of the school, and the remaining students walking away. Meanwhile, the Headmaster's dog, and Meredith, who survived the attack, witness the school's destruction."]}, {"page": "List of British films of 2018", "response": ["|| Director: Crispian Mills  Cast: Simon Pegg, Asa Butterfield, Nick Frost, Michael Sheen, Finn Cole, Hermione Corfield"]}, {"page": "Here Are the Young Men", "response": ["Here Are the Young Men is a 2020 drama film written and directed by Eoin Macken, based on the novel of the same name by Rob Doyle. It stars Dean-Charles Chapman, Finn Cole, Anya Taylor-Joy, Ferdia Walsh-Peelo, Travis Fimmel and Conleth Hill.", "* Finn Cole as Joseph Kearney", "In August 2018, it was announced Dean-Charles Chapman, Finn Cole, Anya Taylor-Joy, Ferdia Walsh-Peelo, Conleth Hill and Lola Petticrew joined the cast of the film, with Eoin Macken directing from a screenplay by Macken and Rob Doyle, based upon the novel of the same name, written by Doyle. Richard Bolger, Noah Haeussner, Edwina Casey will serve as producers on the film, while Paul W.S. Anderson, Andrew Davies Gans, Conor Barry and Michael Raimondi will serve as executive producers under their Hail Mary Pictures and Union Entertainment Group banners, respectively. In September 2018, Ralph Ineson and Susan Lynch joined the cast of the film. In November 2019, it was announced Travis Fimmel had joined the cast of the film."]}, {"page": "Dreamland (2019 American film)", "response": ["Dreamland is a 2019 American thriller film directed by Miles Joris-Peyrafitte from a screenplay by Nicolaas Zwart. The film stars Finn Cole, Margot Robbie, Travis Fimmel, Garrett Hedlund, Kerry Condon, Darby Camp and Lola Kirke.", "* Finn Cole as Eugene Evans", "In May 2017, Margot Robbie joined the cast of the film, with Miles Joris-Peyrafitte directing from a screenplay by Nicolaas Zwart. Robbie will also serve as a producer on the film, alongside Tom Ackerley, Josey McNamara, Brian Kavanaugh-Jones and Rian Cahill, under their LuckyChap Entertainment and Automatik banners.In 2017 Romulus Entertainment came on to produce and finance with Brad Feinstein producing.  In October 2017, Finn Cole, Travis Fimmel, Darby Camp and Kerry Condon joined the cast of the film."]}, {"page": "List of Animal Kingdom characters", "response": ["| Finn Cole", "* Finn Cole as Joshua \"J\" Cody, Smurf's grandson who moves in with her and his uncles following the death of his mother, Julia, who was Pope's twin sister. J is the only one who will challenge Smurf and wants to take power over her and her life. He slowly becomes more connected in the criminal world, operating numerous side businesses to launder money and works with criminals outside the family. "]}]}}