{"wiki_id": "http://www.wikidata.org/entity/Q3012202", "itemLabel": "Daisy Martey", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Daisy_Martey", "wikipedia_page": {"main": "Daisy Martey is a British singer, songwriter, playwright and screenwriter. She is the lead vocalist for Noonday Underground.  Late in 2004, Martey left the band to become the lead singer of Morcheeba, replacing their former singer, Skye Edwards. Martey recorded the vocals for Morcheeba's fifth studio album, The Antidote, which was released in May 2005.\nIn 2007, she was named in Sonia Boyce's Devotional series  celebrating iconic Black British singers alongside distinguished artists such as Sade and Shirley Bassey in an exhibition by the National Portrait Gallery.\nIn time Martey was also fired by Morcheeba. Skye Edwards returned after the band tried other singers.", "link_mentions": [{"page": "Morcheeba", "response": ["The two brothers reunited the year after, leaving Paul to explain that \"Ross and I realised that Morcheeba was kind of our family company, and that we wanted very much to keep it going, hence the change\".\"OMH Interview with Paul Godfrey\" Ben Hogwood 'Interview - Morcheeba' music OMH, 3 August 2005 In 2005, Morcheeba released their fifth studio (and first post-Edwards) album, The Antidote. Daisy Martey (formerly of the band Noonday Underground) was recruited to replace Edwards as the album vocalist. However, Martey's period with the band was brief and she was sacked in the middle of the promotional tour, to be replaced by Jody Sternberg. Martey subsequently sued the band for breach of contract and defamation.\"Gigwise newsitem\" Daniel Melia, 'Former Morcheeba singer sues Bandmate for assault' Gigwise, 5 January 2006 Sternberg's own tenure with the band was similarly brief, and she only appeared to have been part of the band to fulfil tour dates. According to Ross, the entire episode \"was difficult to say the least. It left us in near-ruin\".\"Dive Deep interview\" Jack Foley, 'Morcheeba discuss the journey to Dive Deep', IndieLondon, Accessed 21 March 2014."]}, {"page": "The Antidote (Morcheeba album)", "response": ["The Antidote is the fifth album by Morcheeba, released in 2005. It featured Daisy Martey on vocals, who replaced Skye Edwards. It was the band's first album with Echo Records.Listing for The Antidote album on Discogs.com (accessed 23 March 2015). The album reached 17 in the UK album charts.Chart listing for The Antidote (accessed 23 March 2015).", "Pitchfork gave the album a 2.7 out of ten, remarking that Daisy Martey replacing singer Skye Edwards was like \"an Angela Lansbury replacing a Marilyn Monroe.\""]}, {"page": "The Unfairground", "response": ["* Daisy Martey – backing vocals"]}, {"page": "Noonday Underground", "response": ["Noonday Underground are a British band consisting of DJ Simon Dine and singer Daisy Martey. Dine had previously been a member of Adventures in Stereo. Martey was for a time the singer in Morcheeba. The band name came from a book about The Who."]}, {"page": "Daisy (given name)", "response": ["*Daisy Martey, British singer, songwriter, playwright, and screenwriter"]}, {"page": "Martey", "response": ["*Daisy Martey, British singer-songwriter"]}]}}