{"wiki_id": "http://www.wikidata.org/entity/Q30122822", "itemLabel": "Eric Welsh", "itemDescription": "association football player from Northern Ireland (born 1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eric_Welsh_(footballer)", "wikipedia_page": {"main": "Eric Welsh (born 1 May 1942) is a Northern Irish former professional footballer who played as a right winger.", "link_mentions": [{"page": "Peter Murphy (footballer, born 1980)", "response": ["Murphy is a former Ireland under-19 and under-21 international, playing in the UEFA Under-19 Championships in 1999. In May 2007, Murphy received his first call up to the senior Republic of Ireland squad for the two-game American tour against Ecuador and Bolivia. Murphy's international début came against Bolivia when he started the match before being substituted at half time. This appearance meant he became first Carlisle United player to win full international honours while with the Brunton Park club since Eric Welsh, who won four caps for Northern Ireland in the 1960s."]}, {"page": "Ľubomír Michalík", "response": ["On 11 October 2011, Michalík became the first Carlisle United player to play in a competitive international match since Eric Welsh who represented Northern Ireland team in 1967 (although teammate Peter Murphy did play in a friendly match for the Republic of Ireland in 2007). Michalík then played the full 90 minutes in a 1–1 draw with Macedonia in a Euro 2012 qualifier, Michalík was denied an 89th-minute winner by a Martin Bogatinov save."]}, {"page": "1942 in Northern Ireland", "response": ["*1 May – Eric Welsh, footballer."]}, {"page": "Eric Welsh", "response": ["Eric Welsh (born 1897) was a British chemist and naval intelligence officer during the Second World War. Between 1919 and 1940 he worked for the Bergen branch of the company International Paint Ltd. From 1941 he headed the Norwegian branch of Secret Intelligence Service (SIS). Welsh is fleetingly referred to in the Norwegian television series The Heavy Water War and, based on the comments by Stephen Dorril of Welsh as a \"...ladies' man who drank and smoked to excess\" and a \"master of dirty tricks\"  alluded to as one of the models to James Bond"]}]}}