{"wiki_id": "http://www.wikidata.org/entity/Q30165536", "itemLabel": "Tonia Antoniazzi", "itemDescription": "Welsh politician, Labour Party MP for Gower (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tonia_Antoniazzi", "wikipedia_page": {"main": "Antonia Louise Antoniazzi (born 5 October 1971) is a British Labour Party politician. She was elected as the Member of Parliament (MP) for Gower at the 2017 general election.\n\n", "link_mentions": [{"page": "October 5", "response": ["*1971 – Tonia Antoniazzi, British politician"]}, {"page": "Swansea", "response": ["*Gower, current MP is Tonia Antoniazzi, Labour since 2017"]}, {"page": "List of United Kingdom MPs: A", "response": ["|Tonia Antoniazzi"]}, {"page": "Gower (UK Parliament constituency)", "response": ["Gower () is a constituency created in 1885 and represented in the House of Commons of the UK Parliament by one Member of Parliament (MP).  Tonia Antoniazzi of the Labour Party became its MP after winning it from a Conservative in the 2017 UK general election. Her party had previously represented the seat from 1909 until 2015.", "|Tonia Antoniazzi"]}, {"page": "List of Parliamentary constituencies in West Glamorgan", "response": ["|Tonia Antoniazzi ‡"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Tonia Antoniazzi, Gower, 2017–present"]}, {"page": "Official Opposition frontbench", "response": ["| colspan=\"2\" |Tonia Antoniazzi", "| colspan=\"2\" |Tonia Antoniazzi", "| colspan=\"2\" |Tonia Antoniazzi", "| colspan=\"2\" |Tonia Antoniazzi", "After voting against the Labour whip for the European Union future relationship bill on 30 December, Shadow Work & Pensions and Scotland PPS Tonia Antoniazzi, Opposition Whip Florence Eshalomi and Shadow Cabinet Office Minister Helen Hayes resigned from the front bench.", "Tonia Antoniazzi announced her appointment as PPS to Shadow Chancellor of the Exchequer Rachel Reeves on 23 June."]}, {"page": "List of sportsperson-politicians", "response": ["|data-sort-value=\"Antoniazzi,Tonia\"| Tonia Antoniazzi || Rugby (international player) || MP for Gower (2017-)"]}, {"page": "Welsh Affairs Select Committee", "response": ["| Tonia Antoniazzi MP", "| Tonia Antoniazzi MP", "Following criticism of both an unfilled committee and an all-male lineup, Tonia Antoniazzi, Anna McMorrin, Simon Hoare, Liz Saville Roberts and Stephen Kinnock joined the committee in October 2017. Thelma Walker replaced Stephen Kinnock on 8 January 2018. Walker was then replaced by Susan Elan Jones on 5 February 2018 following criticism of Labour allowing an MP for an English seat to sit on the committee. Guto Bebb joined the committee on 22 October 2018, replacing Glyn Davies. Jack Lopresti joined the committee in November 2018, replacing Simon Hoare."]}, {"page": "List of Parliamentary constituencies in Wales", "response": ["|Tonia Antoniazzi‡"]}, {"page": "List of University of Exeter people", "response": ["* Tonia Antoniazzi - Labour MP"]}, {"page": "Welsh Italians", "response": ["* Member of Parliament for Gower, Tonia Antoniazzi"]}, {"page": "List of British Italians", "response": ["* Tonia Antoniazzi"]}, {"page": "Chris Williamson (politician)", "response": ["Baroness Maggie JonesRushanara AliDebbie AbrahamsDaniel ZeichnerLilian GreenwoodGraham JonesToby PerkinsLord George RobertsonBaroness Mary GoudieBarry SheermanTonia AntoniazziIan LucasLord George FoulkesLord Wood of AnfieldCat McKinnellBen BradshawLord HaskelLisa NandyGareth ThomasLord BrookeSharon HodgsonLord Kennedy of Southwark"]}, {"page": "2016 National Assembly for Wales election", "response": ["| Tonia Antoniazzi"]}, {"page": "Arron Banks", "response": ["In August 2019 Banks was criticised by Labour MPs Tonia Antoniazzi and David Lammy after a tweet about the climate change activist Greta Thunberg as she set off on a two-week voyage in a zero carbon yacht. Banks tweeted: \"Freak yachting accidents do happen in August\". Tanja Bueltmann, founder of the EU Citizens' Champion campaign, also strongly criticised the tweet. Banks responded that he produced the tweet because he enjoys watching outrage, later stating: \"Obviously I don't hope she encounters a freak yachting accident. I just enjoy watching the ludicrous tweeter mob following the next outrage.\""]}, {"page": "Rishi Sunak", "response": ["In November 2020, Sunak was reported by The Guardian to have not declared a significant amount of his wife and family's financial interests on the register of ministers' interests, including a combined £1.7billion shareholding in the Indian company Infosys. Sunak is required under the ministerial code to declare interests that are \"relevant\" to his responsibilities and \"which might be thought to give rise to a conflict\" with his public duties. A Treasury spokesperson said that Sunak \"followed the ministerial code to the letter in his declaration of interests\". The Labour MP Tonia Antoniazzi wrote to Lord Evans, chair of the Committee on Standards in Public Life, to assess whether the ministerial code was breached by Sunak."]}, {"page": "More United", "response": ["| Tonia Antoniazzi"]}, {"page": "Endorsements in the 2017 United Kingdom general election", "response": ["For Tonia Antoniazzi (Labour):"]}, {"page": "List of MPs elected in the 2017 United Kingdom general election", "response": ["| data-sort-value=\"Antoniazzi Tonia\" | frameless|100pxTonia Antoniazzi"]}, {"page": "List of MPs who lost their seat in the 2017 United Kingdom general election", "response": ["|data-sort-value=\"Antoniazzi, Tonia\"|Tonia Antoniazzi"]}]}}