{"wiki_id": "http://www.wikidata.org/entity/Q3017790", "itemLabel": "David Donachie", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Donachie", "wikipedia_page": {"main": "David Donachie (born 1944) is a Scottish nautical historical novelist. He also writes under the pen-names Tom Connery and Jack Ludlow as well as, from 2019, \"Jack Cole.\nHe was elected to the Management Committee of the Society of Authors in 2014 and became Chair in March 2016.", "link_mentions": [{"page": "Napoleonic Wars", "response": ["* David Donachie's John Pearce series about a pressed seaman who becomes a British naval officer during the French Revolution wars and Napoleonic Wars."]}, {"page": "Bohemond I of Antioch", "response": ["The Crusades series by David Donachie (writing as Jack Ludlow) casts Bohemund as the main protagonist."]}, {"page": "Deal, Kent", "response": ["* It is the setting for David Donachie's book A Hanging Matter, a murder and nautical mystery."]}, {"page": "Liberty of the Savoy", "response": ["In 1351 Henry of Grosmont, a great-grandson of Henry III, was created the 1st Duke of Lancaster for services in the Hundred Years War. The seat of Lancaster in Lancashire was raised to a county palatine.Palatine (which has primary syllable stress) is the relevant adjective; Palatinate (which has stress on the second syllable) is the noun, used alone.Collins Dictionary This meant the area was ruled by hereditary noblemen possessing special authority and autonomy from the rest of the Kingdom of England. Although the noblemen swore allegiance to the king, they had the power to rule the county and its contiguous land largely independently of the king. All other properties attached to the Duchy of Lancaster, including the Savoy  became subject to the laws of the duke. As a consequence, someone being pursued for a debt in London could reside in the Savoy without fear of arrest by people acting under the authority of The Crown. Royal writs were not enforceable within the County of Lancashire until the 19th century. Lancaster had its own Court of Chancery until the 1970s. These circumstances have been used in historical fiction, such as the Aubrey-Maturin novels by Patrick O'Brian or John Pearce series by David Donachie."]}, {"page": "Charles Lock", "response": ["Scottish historical novelist David Donachie argues that \"without much wealth, Charles Lock was a man in a hurry who made no secret that he had designs on Sir William's position as ambassador.\""]}, {"page": "Jack Ludlow", "response": ["#REDIRECT David Donachie"]}, {"page": "Donachie", "response": ["* David Donachie (born 1944), Scottish novelist"]}, {"page": "Napoleonic Wars in fiction", "response": ["*David Donachie's John Pearce series about a pressed seaman who becomes a British naval officer during the French Revolution wars and Napoleonic Wars."]}, {"page": "Game of Bones", "response": ["* A Game of Bones, novel by David Donachie, part of The Privateersman Mysteries series"]}, {"page": "Donachie, David", "response": ["#redirectDavid Donachie"]}]}}