{"wiki_id": "http://www.wikidata.org/entity/Q30164380", "itemLabel": "Rosie Duffield", "itemDescription": "British politician (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Rosie_Duffield", "wikipedia_page": {"main": "Rosemary Clare Duffield (born 1 July 1971) is a British Labour Party politician who has served as Member of Parliament (MP) for Canterbury since 2017.\n\n", "link_mentions": [{"page": "Kent", "response": ["At the national level, Kent is represented in Parliament by 17 MPs, all of whom were Conservative until the general election of June 2017. At that election Canterbury elected Rosie Duffield, the first ever Labour MP to hold the seat since the constituency was formed in 1918. At the 2019 general election, she increased her majority from 187 to 1836."]}, {"page": "Canterbury", "response": ["The Member of Parliament for the Canterbury constituency, which includes Whitstable, is Rosie Duffield of the Labour Party."]}, {"page": "Whitstable", "response": ["Since 1918, Whitstable has been in the constituency of Canterbury. The Member of Parliament for the constituency is Rosie Duffield of the Labour Party, who was first elected in the 2017 general election after unseating long-serving Conservative MP Julian Brazier."]}, {"page": "Julian Brazier", "response": ["Brazier was knighted in the 2017 New Year Honours. At the general election 2017, he narrowly lost his seat to Labour's Rosie Duffield."]}, {"page": "Rod Liddle", "response": ["The column was criticised by senior political figures including Chancellor of the Exchequer Sajid Javid and former Conservative Deputy Prime Minister David Lidington.  Liddle defended the content as being humorous.  The article  also criticised the Labour MP Rosie Duffield's recent speech about her experience of trying to exit an abusive relationship; Duffield described the article as \"racist and misogynistic\"."]}, {"page": "Soft left", "response": ["In 2015, Neal Lawson, the chair of the think tank Compass, identified the organisation as a successor to the soft left. Compass disaffiliated from Labour in 2011 in order to open up their membership to people belonging to other political parties. The activist group Open Labour was launched in 2015 with the aim of developing a new forum for the soft left political tradition within the party, which it hopes to recast as the \"Open Left\". In the 2017 general election, several Open Labour activists were elected to Parliament including Open Labour Treasurer Alex Sobel, Emma Hardy and Rosie Duffield. "]}, {"page": "Canterbury (UK Parliament constituency)", "response": ["Canterbury is a constituency represented in the House of Commons of the UK Parliament since 2017 by Rosie Duffield of the Labour Party.", "From 1835 (where a Conservative was elected on petition) until 2017, the local electorate elected mostly candidates of the Conservative Party (with the exceptions of the elections of Independent Unionist Francis Bennett-Goldney, MP from 1910 to 1918, and of a few Whigs or Liberals when Canterbury had two seats); the seat was recognised in the Guinness Book of World Records as the longest uninterrupted period of one party holding a Parliamentary seat. The election of Labour's Rosie Duffield, who won the seat by just 187 votes in the 2017 election, marked the end of a 185-year period of Canterbury almost always electing Conservative-allied MPs, the longest recorded unbroken record of party representation in British political history. Her victory in this election was largely credited to the strategies of electoral strategist Jack Wilson, who at the time was the youngest senior political adviser in British history. She kept the seat, increasing her majority in 2019.", "| Rosie Duffield"]}, {"page": "Canterbury West railway station", "response": ["The former rivalry between the SER and LCDR meant there is no easy way to change between Canterbury East and West. A proposal for a Canterbury Parkway station, at the place the two lines cross, has been intermittently suggested since the 1980s. In 2018, local MP Rosie Duffield suggested the new station would be a better alternative to a new multi-story car park for Canterbury West, which opened in June 2020."]}, {"page": "List of Parliamentary constituencies in Kent", "response": ["|Rosie Duffield ‡"]}, {"page": "Chartham", "response": ["At the national level Chartham is in the parliamentary constituency of Canterbury for which Rosie Duffield (Labour) has been MP since 2017. Prior to Brexit in 2020 for European elections Chartham was in the South East England constituency."]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Rosie Duffield, Canterbury, 2017–present"]}, {"page": "Official Opposition frontbench", "response": ["| colspan=\"2\" |Rosie Duffield", "Rosie Duffield resigned as an opposition whip on 31 May after being found to have broken coronavirus lockdown rules."]}, {"page": "Work and Pensions Select Committee", "response": ["|Rosie Duffield MP", "| Rosie Duffield MP (Labour)"]}, {"page": "Environment, Food and Rural Affairs Select Committee", "response": ["|Rosie Duffield MP"]}, {"page": "Duffield (surname)", "response": ["* Rosie Duffield (born 1971), British politician"]}, {"page": "List of Question Time episodes", "response": ["|Bernard Jenkin, Rosie Duffield, Geoff Norcott, Ayesha Hazarika, Xand van Tulleken"]}, {"page": "Jewish Labour Movement", "response": ["In September 2019, the JLM held a rally at the Middle Street Synagogue in Brighton during the Labour Party Conference. Speakers included MPs, Ruth Smeeth, Margaret Hodge, Alex Sobel, Louise Ellman, Stella Creasy and Rosie Duffield, Seb Dance MEP, the Mayor of London, Sadiq Khan, Luke Akehurst, director of We Believe in Israel and secretary of Labour First, Nathan Yeowell, director of Progress, Miriam Mirwitch, chair of Young Labour and Rania Ramli, chairperson of the recently disbanded Labour Students. Smeeth said that \"This isn’t a fight for Jews (or) equality in the party – this is a fight for the Labour Party.\" Hodge drew loud cheers when she promised that \"I’m not going to give up until Jeremy Corbyn ceases to be leader of the Labour Party.\""]}, {"page": "Chris Williamson (politician)", "response": ["Tom WatsonHolly LynchStella CreasyAnna TurleyRosie DuffieldLouise EllmanRuth SmeethJenny ChapmanRoberta Blackman-WoodsStephen DoughtyKarin SmythBaroness ThorntonLord McNicolBaroness Morgan of HuytonLord TurnbergGloria De PieroBaroness Royall of BlaisdonYvette CooperBaroness Massey of DarwenBaroness KingsmillLord SoleyMadeleine Moon"]}, {"page": "Lily Madigan", "response": ["Following Madigan's election as Women's Officer and around the time of Madigan's application to the Jo Cox Women in Leadership Programme, five critical articles were written about Madigan in The Times. Madigan was rejected from the programme, but the articles in The Times were condemned by 55 activists involved in the programme who applauded the party for \"supporting the principle that every woman\" should get the chance to participate. Signatories included Labour MPs Rosie Duffield and Preet Gill. These incidents led to Madigan receiving online abuse."]}, {"page": "More United", "response": ["| Rosie Duffield"]}, {"page": "List of MPs elected in the 2017 United Kingdom general election", "response": ["| data-sort-value=\"Duffield Rosie\" | frameless|100pxRosie Duffield"]}, {"page": "2017 United Kingdom general election in England", "response": ["Labour gained Canterbury, with former teaching assistant Rosie Duffield defeating Sir Julian Brazier. This ended the monopoly which the Conservatives had enjoyed across Kent since 2010. The rest of the seats held, with work & pensions secretary Damian Green securing re-election alongside sport minister Tracey Crouch, defence secretary Sir Michael Fallon and business secretary Greg Clark."]}, {"page": "List of MPs who lost their seat in the 2017 United Kingdom general election", "response": ["|data-sort-value=\"Duffield, Rosie\"|Rosie Duffield"]}, {"page": "List of Parliamentary constituencies in the South East (region)", "response": ["|Rosie Duffield‡"]}, {"page": "Parliamentary votes on Brexit", "response": ["* Rosie Duffield, Canterbury", "* Rosie Duffield, Canterbury", "* Rosie Duffield, Canterbury"]}]}}