{"wiki_id": "http://www.wikidata.org/entity/Q302036", "itemLabel": "Jackie Doyle-Price", "itemDescription": "British politician (born 1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jackie_Doyle-Price", "wikipedia_page": {"main": "Jacqueline Doyle-Price (born 5 August 1969) is a British Conservative Party politician and former civil servant. She was first elected as the Member of Parliament (MP) for Thurrock in the 2010 general election.", "link_mentions": [{"page": "August 5", "response": ["*1969 – Jackie Doyle-Price, English politician"]}, {"page": "In vitro fertilisation", "response": ["IVF increasingly appears on NHS treatments blacklists.  In August 2017 five of the 208 CCGs had stopped funding IVF completely and others were considering doing so.  By October 2017 only 25 CCGs were delivering the three recommended NHS IVF cycles to eligible people under 40.  Policies could fall foul of discrimination laws if they treat same sex couples differently from heterosexual ones.  In July 2019 Jackie Doyle-Price said that women were registering with surgeries further away from their own home in order to get around CCG rationing policies."]}, {"page": "University College, Durham", "response": ["File:Jackie Doyle Price.JPG|Jackie Doyle-Price, Conservative MP for Thurrock.", "| Jackie Doyle-Price"]}, {"page": "David Amess", "response": ["In March 2018, Amess launched an all-party parliamentary group on endometriosis to raise awareness of the condition, and to investigate how those who suffer from endometriosis can get the support that they need. The group was chaired by Amess, with Emma Hardy, Jackie Doyle-Price and Hannah Bardell as vice-chairs."]}, {"page": "Eric Joyce", "response": ["Joyce was arrested at 22:50 on 22 February 2012 in the Palace of Westminster by the Metropolitan Police on suspicion of committing assault. He was reported to have attacked as many as six politicians, including a Labour whip, after having gone \"berserk\" following a dispute with a group of Tory MPs sitting nearby. He headbutted and punched the Conservative MP, Stuart Andrew, after striking Labour Assistant Whip Phil Wilson, while Wilson was attempting to restrain him. He also headbutted Thurrock Conservative councillor Ben Maney, and punched Basildon Conservative Councillor, Luke Mackenzie, both of whom were attempting to break up the incident. Two more Conservative MPs, Alec Shelbrooke and Jackie Doyle-Price, were also caught up in the fracas while attempting to intervene and calm Joyce down. A door window was smashed as Joyce attempted to resist arrest before being removed by police and taken to Belgravia police station. The disturbance occurred at the Strangers' Bar (reserved for MPs and their guests)."]}, {"page": "Tilbury", "response": ["Until 1903, the marshland area was part of the traditional parish and civil parish of Chadwell St Mary, which reached south to the River Thames. The parish of Tilbury Docks was established in 1903 and the Tilbury Urban District Council (UDC) in 1912; it merged with Thurrock UDC in 1936. This in turn became a borough in 1984 and then the Thurrock Unitary Authority in 1998. There are two wards covering the town, each served by two councillors: Tilbury Riverside and Thurrock Park for the southern part and Tilbury St Chad's in the north. As of May 2016 there are 3 Labour and 1 UKIP councillors. The Member of Parliament for Thurrock is Jackie Doyle-Price."]}, {"page": "Eltham (UK Parliament constituency)", "response": ["In 2006, the Eltham Conservative Association became the first in London to select a prospective parliamentary candidate by means of an open primary election, where any voter on the electoral roll was entitled to attend and vote. David Gold (PPC Brighton Pavilion 2001) defeated Jackie Doyle-Price (PPC Sheffield Hillsborough 2005) and Eric Ollerenshaw (former London Assembly member), by winning more than 50% of the ballot in the first round at a meeting chaired by Michael Portillo on 31 July 2006 at the Bob Hope Theatre. Approximately 140 people attended the open primary.\"Final three for Eltham\"  Conservative Home (blog)\"David Gold selected for Eltham\"  Conservative Home (blog)"]}, {"page": "Thurrock (UK Parliament constituency)", "response": ["Thurrock is a constituency represented in the House of Commons of the UK Parliament since 2010 by Jackie Doyle-Price, a Conservative.", "In the 2010 general election, a Conservative gained the seat, with Jackie Doyle-Price being elected as the MP on a majority of 92 votes, the third most marginal in that election.The 2010 marginality of the result placed the seat immediately behind the majorities of Dan Byles (Con), 54 votes and Michelle Gildernew (SF), 2 votes The 2015 result gave the seat the 8th most marginal majority of the Conservative Party's 331 seats by percentage of majority.List of Conservative MPs elected in 2015 by % majority  UK Political.info.  Retrieved 2017-01-29 In that 2015 election fewer than 1,000 votes separated the top three parties: Conservative, Labour and UKIP. The seat has had bellwether outcome status since 1997.", "| Jackie Doyle-Price"]}, {"page": "List of Parliamentary constituencies in Essex", "response": ["|Jackie Doyle-Price †"]}, {"page": "World Mental Health Day", "response": ["On World Mental Health Day 2018, Prime Minister Theresa May appointed Jackie Doyle-Price as the UK's first suicide prevention minister. This occurred while as the government hosted the first ever global mental health summit."]}, {"page": "Notre Dame High School, Sheffield", "response": ["* Jackie Doyle-Price, Conservative MP for Thurrock"]}, {"page": "Public Administration and Constitutional Affairs Select Committee", "response": ["| Jackie Doyle-Price MP"]}, {"page": "Hathaway Academy", "response": ["*Jackie Doyle-Price"]}, {"page": "Regulatory Reform Committee", "response": ["| Jackie Doyle-Price MP"]}, {"page": "William Edwards School", "response": ["*Jackie Doyle-Price"]}, {"page": "The Gateway Academy", "response": ["The Gateway Primary Free School is currently situated on The Gateway Academy's campus, albeit in a separate building, and is sponsored by the Ormiston Trust and is part of the GLC. It opened in 2012 and the first permanent head of school was Thom Martin who was replaced by Daniel George, who in turn became executive head and was replaced as head of school by Emma Pattison. The school's current building began construction in 2013 and is located on Gateway Academy's site. The building's opening was attended by GLC CEO Kevin Sadler and Thurrock MP Jackie Doyle-Price. The school serves 4-11 year olds and has an Ofsted rating of good."]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| Thurrock||style=\"background-color: \"| ||Labour||style=\"background-color: \"| ||Jackie Doyle-Price (C)||Seat held.  Incumbent Andrew MacKinlay (L) stood down"]}]}}