{"wiki_id": "http://www.wikidata.org/entity/Q302534", "itemLabel": "Mister Sinister", "itemDescription": "Marvel Comics supervillain", "wikipedia_url": "https://en.wikipedia.org/wiki/Mister_Sinister", "wikipedia_page": {"main": "Mister Sinister (Nathaniel Essex) is a supervillain appearing in American comic books published by Marvel Comics. Created by writer Chris Claremont, the character was first mentioned as the employer behind the team of assassins known as the Marauders in The Uncanny X-Men #212 (December 1986), later seen in silhouette in The Uncanny X-Men #213, with both issues serving as chapters of the 1986 \"Mutant Massacre\" crossover. Mr. Sinister then made his first full appearance in The Uncanny X-Men #221 (September 1987). His appearance was designed by artist Marc Silvestri.A villain who usually prefers to act through agents and manipulation, Mr. Sinister is born Nathaniel Essex in Victorian London. A human scientist, Essex is inspired by the work of his contemporary Charles Darwin and becomes obsessed with engineering humanity into a perfect race of superhumans. As he learns about mutants (superhuman beings born with the X-gene), Essex encounters the mutant villain Apocalypse. The two become allies and Apocalypse uses alien Celestial technology to transform the British scientist into Mr. Sinister, an ageless man with super-powers. Later on, Sinister increases his power through self-experimentation. In the modern-day, Sinister develops a great interest and protective attitude towards the mutant heroes Cyclops and Jean Grey, believing their DNA can create the ultimate mutant. This and other factors lead him to have repeated clashes with the X-Men (a group Cyclops and Jean Grey helped found) and related teams. Sinister's body has been destroyed more than once, but he survives due to regenerative abilities and/or by transferring his mind into new host bodies or clones. Several co-existing Mr. Sinister clones (all sharing the original's memories and basic personality) later formed a community. This community was later destroyed, but one clone that was born with an X-gene (making him a mutant) survived and continues to operate to this day. Mr. Sinister is often associated with the characters Apocalypse, Cable, and Madelyne Pryor, and is leader of the team of trackers and assassins known as the Marauders.\nMaking frequent appearances in the X-Men comics and related spin-off titles, Mr. Sinister has also featured in associated Marvel merchandise including animated television series, toys, trading cards, and video games. IGN's list of the \"Top 100 Comic Book Villains of All Time\" ranked Sinister as #29. In 1993, Mr. Sinister made his television debut on the animated series X-Men in the first two episodes of season 2, voiced by Christopher Britton, exposing the character to a wider audience. Mister Sinister appears in the 2009 animated series Wolverine and the X-Men, voiced by Clancy Brown.", "link_mentions": [{"page": "Professor X", "response": ["The first person Charles visits is Carter Ryking, who had gone insane after losing his powers. Charles reads Carter's memories and discovers that when the two were children they were used as test subjects by Nathan Milbury of the Black Womb Project, with the approval of Charles' father, Doctor Brian Xavier. Xavier makes the connection Milbury and X-Men villain, Mister Sinister, who has apparently long been manipulating Charles' life in addition to other X-Men. Afterwards, he discovers he has been targeted by assassins.X-Men Legacy #211", "Charles eventually discovers Mister Sinister had set up Charles, Sebastian Shaw, Juggernaut, and Ryking (Hazard) as potential new hosts for Sinister's mind. Bleeding slowly to death, he apparently gives in to Sinister becoming the new Mister Sinister. But in reality, Xavier is still battling Sinister for control of his body. As Sebastian Shaw and Gambit destroy Sinister's Cronus Machine, the device that he used to transfer his consciousness into new hosts, Xavier drives Sinister out of his body permanently. Xavier thanks Shaw and Gambit for their help and declares he must go and see Cyclops immediately.X-Men Legacy #214 Professor X returns to the X-Mansion to find it destroyed after recent events. Afterwards, Xavier leaves the ruins of the X-Mansion to secretly meet up Cyclops by psychically coercing his former student for the visit. Xavier explains to Cyclops about the recent events with Mr. Sinister and tries to explain to Cyclops how Sinister has been manipulating Scott's and Jean's lives since when they were children. Xavier attempts to have Scott give him permission to scan Scott's mind for traces of Sinister's influences, but instead, Scott turns the tables on Xavier by revealing that he has secretly invited Emma Frost into their entire meeting and also into Xavier's mind.\"X-Men Legacy\" #215", "Xavier is revealed to have upgraded Cerebro with the help of Forge, which is now able to copy and store the minds of mutants in a database. After the Five (Hope Summers, Goldballs, Elixir, Proteus, and Tempus) are able to grow the bodies of deceased mutants, Xavier is able to copy the minds back in these empty shells. Thus, he is able to resurrect Cyclops's team, thanking them for what they did. At the U.N., Xavier, Beast, and Emma celebrate with other ambassadors for the recognition of Krakoa as a sovereign nation. Xavier telepathically converses with Emma, revealing that he knows that she manipulated the Russian ambassador to abstain from the vote, before thanking her for her service. Two days after the U.N. vote, Xavier, Magneto, and Wolverine are in Krakoa waiting besides several portals. While Wolverine expresses his misgivings about the upcoming event, Xavier and Magneto assure him all will be alright. Soon after, several villainous mutants, including Mister Sinister, Sebastian Shaw, Exodus, Selene (comics) and Apocalypse arrive through the portals. Apocalypse in particular expresses satisfaction at arriving and Krakoa responds in the same way. Magneto and Xavier reveal that they have invited all mutants, even those who have fought against them in the past, to Krakoa, to form a society. The assembled villainous mutants agree to their terms, and Xavier shakes Apocalypse's hand, welcoming him and the others to their home.\"Powers of X #5"]}, {"page": "Genosha", "response": ["* Genosha is the main setting in Deadpool. Here, Genosha is in a state of ruins from the Sentinel attacks and Mister Sinister has made his base of operations here, harvesting the vast amount of mutant genetic material for his experiments. Deadpool travels to Genosha with the X-Men (who are knocked out when Deadpool crashes their jet) with the intention of killing Mister Sinister as revenge for killing one of Deadpool's marks."]}, {"page": "Iceman (Marvel Comics)", "response": ["As the team recovers from Hecatomb attack in Rogue's childhood home, it appears that Mystique and Iceman begin a romantic relationship.X-Men vol. 2 #200 This was a front, as Mystique was using Iceman and the X-Men as a Marauder spy for Mister Sinister.X-Men #201 Marauders soon infiltrated the house; they attempt to gain access to Destiny's Diaries on the order of Mr. Sinister (who has been gathering information about the future from anybody and anything that could foretell the future). Bobby and Cannonball escape from the Marauders in the X-Jet, with help from Emma Frost. They are pursued by Sunfire; they manage to get the better of him and take him prisoner, but not before he manages to cripple the jet. While Sunfire is unconscious, Iceman and Sam discuss the Mauraders' plan to eliminate all precognitive mutants and anyone with knowledge of the future as well as retrieving Destiny's Diaries before the Marauders can. During this time, Bobby displayed sub-atomic control of energy transfers when he prevented Sunfire from using his fire-based powers.X-Men #202", "Cannonball and Bobby, telepathically prompted by Emma Frost, attempt to recover the diaries which are hidden in a dilapidated brewery. Mr. Sinister uses the reverse-engineered version of Xavier's Cerebro to track the pair of X-Men to the brewery. The Marauders attack Cannonball and Iceman and overtake them. Bobby, while in his ice form, suffers a gunshot wound from Mystique, which severs one of his arms above the elbow. Mister Sinister, who takes Cannonball prisoner, attempts to telepathically erase his mind so that the X-Men will find him as an empty shell. Iceman attacks Sinister, distracting him, which allows both of the X-Men to escape.X-Men #203", "After teaming with Bishop to help the Morlocks who came under threat by Mister Sinister, Bobby finds himself approached by Emma Frost who asks him for his help. Ignoring Kitty's protests, he agrees and Emma explains that her Father, who subjected her brother Christian to conversion therapy before having him institutionalized, has recently let him out and reinstalled him as the new heir to the Frost business empire. When they arrive, they discover that Christian has murdered their Father and is exhibiting his own powers. Bobby and Emma help to free Christian from his mental breakdown and Emma decides to stay with him.Iceman vol. 4 #1–2 Joining with his friends Spider-Man and Firestar, Bobby discovers that Sinister was behind the attack on the Morlocks and confronts him in his safehouse. Sinister, intent on trying to unlock the secrets of Iceman's DNA by dissecting him, sends forth an army of experimental ice creatures but Bobby's Omega Level powers absorb them all into him and he fires Mister Sinister into space.Iceman vol. 4 #3–5 Celebrating his birthday, Bobby is confronted by Ice Wizard, a future version of himself from an alternate timeline. Ice Wizard warns Bobby that he must quit the X-Men and stop using his powers to avoid a world-destroying series of events happening. He explains that Daken seduces him and manipulates him into sacrificing the other X-Men before betraying him and gaining Thanos-level powers. Bobby is adamant that this won't happen and the two engage in battle. Jean Grey arrives and Bobby finally confronts her for the actions of her younger self when she outed him. Bobby explains to Ice Wizard that he is going to live life on his terms and that nobody, not even his future self, is going to decide for him. Bobby returns to his birthday celebration where Christian arrives and hands him a large sum of money which Bobby gives to the Morlocks. A content Bobby messages Judah, asking if he would like to meet up as friends.Uncanny X-Men: Winter's End", "When Iceman was injected with Mister Sinister's neuro-inhibiter by Mystique, he was able to save himself by drawing in all of the ambient moisture around him, rapidly replacing his poisoned cells with healthy material before the injection could kill him.X-Men: Manifest Destiny #3"]}, {"page": "Jean Grey", "response": ["Upon its suicide by way of a disintegration ray, the Phoenix Force disperses into its original form and a fragment locates the still-healing Jean at the bottom of Jamaica Bay. In trying to bond with her, Jean senses its memories of death and destruction as Dark Phoenix and rejects it, causing it to bond with and animate a lifeless clone of Jean Grey created by the villain Mister Sinister. Sinister created the clone to mate with Cyclops to create genetically superior mutants. Named \"Madelyne Pryor\", the unaware clone meets Cyclops in a situation engineered by Sinister and the two fall in love, marry, and have a child, Nathan Christopher Summers. Meanwhile, the cocoon is discovered and retrieved by the Avengers and the Fantastic Four. Jean emerges with no memory of the actions of the Phoenix/Dark Phoenix. The Avengers and Fantastic Four tell her of what happened and that she was believed dead until now. She is reunited with the original X-Men and convinces them to form the new superhero team X-Factor, reusing her \"Marvel Girl\" codename. Madelyne is angered over Cyclops's decision to lead X-Factor and neglect his family. Though Jean encourages Cyclops to return to Madelyne, he finds their house abandoned and assumes that Madelyne has left him and taken their infant son. Cyclops returns to X-Factor and he and Jean continue their relationship, but the Phoenix Force's impersonation, and his marrying Madelyne, damaged their mutual trust.X-Factor #18X-Factor Annual #2 The team's adventures continue throughout the series, culminating in the line-wide \"Inferno\" crossover. Madelyne reappears, now nearly insane and with powers awakened by a demonic pact, calling herself the Goblyn Queen.", "Learning of her true identity and purpose as a clone created by Mister Sinister drove her completely insane and she plans to sacrifice Nathan Christopher to achieve greater power and unleash literal Hell on Earth. While attempting to stop her, Jean is reunited with the other X-Men, who are happy to learn that she is alive, particularly Wolverine, reminding Jean of her unaddressed feelings for him. Jean and Madelyne confront each other, and Madelyne attempts to kill them both. Jean manages to survive only by absorbing the remnant of the Phoenix Force housed within Madelyne, giving her both Madelyne's memories and the Phoenix's memories from \"The Dark Phoenix Saga\"."]}, {"page": "Savage Land", "response": ["* The Savage Land appeared in some episodes of the X-Men TV series. It served as the location of Mister Sinister's base. A prominent feature about it was a device designed by Sinister that negated the powers of any mutant in the Savage Land save for Sinister's own forces, rendering the X-Men powerless while fighting him (with the exception of Wolverine's claws as they were a 'bonus' of the Weapon X process, although they would thus cause damage to his hands when used) until the machinery was destroyed. Magneto and Professor X spent much of the show's second season trapped in the Savage Land (Xavier's legs having fortunately been restored as a result of the loss of his powers) until Mister Sinister used them as bait to lure the X-Men into a trap in the season finale, Sinister's forces subsequently being defeated when Wolverine escaped capture and teamed up with Ka-Zar to infiltrate the base and destroy the equipment keeping the other X-Men powerless. In \"Savage Land, Savage Heart\", the X-Men return to the Savage Land to help Ka-Zar and Shanna fight the threat of Garokk.", "* The Savage Land appears in Marvel: Avengers Alliance. It is the setting of Special Operations 21 which details a power struggle in the Savage Land between Sauron, Stegron, Mister Sinister, the High Evolutionary, and A.I.M. The S.H.I.E.L.D. Agent and the superheroes had to fight Iso-Saurs (a race of dinosaurs evolved by the Iso-8) which were created by the High Evolutionary."]}, {"page": "X-Factor (comics)", "response": ["In the 1989 crossover Inferno, Madelyne Pryor is revealed to be a clone of Jean Grey created by the mutant geneticist Mister Sinister. Manipulated by demons and tormented by Scott's rejection of her, Madelyne kills herself in a suicide attack on X-Factor."]}, {"page": "X-Men", "response": ["Throughout the decade, Uncanny X-Men was written solely by Chris Claremont, and illustrated for long runs by John Byrne, Dave Cockrum, Paul Smith, John Romita Jr., and Marc Silvestri. Additions to the X-Men during this time were Kitty Pryde/Shadowcat, Rogue, Jean Grey/Phoenix, Psylocke, Dazzler, Longshot, Jubilee, Forge and Gambit. In a controversial move, Professor X relocated to outer space to be with Lilandra Neramani, Majestrix of the Shi'ar Empire, in 1986. Magneto then joined the X-Men in Xavier's place and became the director of the New Mutants. This period also included the emergence of the Hellfire Club, the arrival of the mysterious Madelyne Pryor, and the villains Apocalypse, Mister Sinister, Mojo, and Sabretooth.", "** Hellions – a team of mutant troublemakers given an outlet for their gene-given desires with initial cast consisting of Empath, Havok, Mister Sinister, Nanny, Orphan-Maker, Psylocke, Scalphunter, and Wild Child.", "* Genocide: Genocide and its psychological after-effects, primarily survivor guilt, are recurring elements in some of the most significant X-Men story arcs. Magneto was a survivor of The Holocaust and witnessed the genocide of his people, severely scarring him emotionally and leaving him with a strong distrust of humanity. Because of this he constantly toes the line between ally and enemy of the X-Men. The iconic Days of Future Past story line saw an alternate future where Sentinels committed genocide on most of the world's mutants.Uncanny X-Men Vol. 1, #141-142 In Rachel Summers' original timeline, she was captured by humans and turned into a 'hound' used to hunt down other mutants in order to capture and kill them, leaving her extremely traumatized by the experience and knowledge that she unwittingly assisted in the genocide of her own people. Bishop's childhood consisted of him being trapped in a mutant concentration camp, leaving him so emotionally scarred as an adult that upon returning to the past he was prepared to kill a baby who might have caused his future. When Cassandra Nova committed genocide on Genosha, the event left both Emma FrostNew X-Men #114-116  and PolarisNew X-Men'\" #132Uncanny X-Men #429-434 traumatized by survivor's guilt as they were amongst the limited few survivors. While taking some time off in Germany, Nightcrawler witnessed the genocide of numerous mutants. The event left him as an emotional shell of who he used to be because of the trauma of what he witnessed until he had psychic therapy with Jean to help him cope.Extraordinary X-Men #5 Other characters who have either committed or have survived genocide include Mystique, Callisto, Apocalypse, Onslaught, Bastion, Mister Sinister, Hope Summers, Cable, and the Phoenix Force."]}, {"page": "Phoenix Force (comics)", "response": ["* Madelyne Pryor: A clone of Jean Grey that is brought to life by a fraction of the Phoenix Force.Uncanny X-Men #241 Sinister later creates six clones to take the energies from the Phoenix Five (Cyclops, Emma Frost, Colossus, Namor, and Magik), and while they manage to siphon some of the energy from the Phoenix, the entity burns away the Madelyne clones and frees the Phoenix Five, who then incinerate Mister Sinister and his city.The Uncanny X-Men vol. 2 #17", "** Emma Frost: Possesses a fragment of the Phoenix Force, who refers to Frost as its \"beloved child\" after she alerts it to Mister Sinister's plot. Her half of the Phoenix Force is later stolen by Cyclops to increase his power during the final battle with the Avengers and X-Men."]}, {"page": "Northstar (character)", "response": ["Soon after, Mister Sinister, a deranged man who is apparently under orders of Apocalypse to kill ten mutants, shoots Northstar.  Thanks to his quick reflexes, Northstar manages to survive the attack but is left in a coma. After being hospitalized, he is awakened from his coma by the X-Man Jean Grey. Upon being told that Colossus had watched over him all night to protect him from any further attacks, Northstar asks if Colossus is single, startling Colossus so much that his body involuntarily turns to steel.Ultimate X-Men #47"]}, {"page": "Chris Claremont", "response": ["During his tenure at Marvel, Claremont co-created numerous X-Men characters, such as Rogue, Psylocke (Betsy Braddock), Kitty Pryde/Shadowcat, Phoenix, The Brood, Lockheed, Shi'ar, Shi'ar Imperial Guard, Mystique, Destiny, Selene, Reverend William Stryker, Lady Mastermind, Emma Frost, Tessa, Siryn, Jubilee, Rachel Summers, Madelyne Pryor, Moira MacTaggert, Lilandra, Shadow King, Cannonball, Warpath, Mirage, Wolfsbane, Karma, Cypher, Sabretooth, Empath, Sebastian Shaw, Donald Pierce, Avalanche, Pyro, Legion, Nimrod,   Gateway, Strong Guy, Proteus, Mister Sinister, Marauders, Purifiers, Captain Britain, Sunspot, Forge and Gambit.  Claremont scripted many classic stories, including \"The Dark Phoenix Saga\" and \"Days of Future Past\", on which he collaborated with John Byrne. He developed the character of Wolverine into a fan favorite. X-Men #1, the 1991 spinoff series premiere that Claremont co-wrote with Jim Lee, remains the best-selling comic book of all time, according to Guinness World Records. In 2015, Claremont and his X-Men collaborator John Byrne were entered into the Will Eisner Award Hall of Fame.", "Claremont co-created numerous other important female X-Men characters, including Rogue,DeFalco \"1980s\" in Gilbert (2008), p. 203: \"[Rogue's] first published appearance occurred in The Avengers Annual #10 by Chris Claremont and Michael Golden.\" Betsy Braddock,Sanderson \"1970s\" in Gilbert (2008), p. 177 Mariko Yashida,Sanderson \"1970s\" in Gilbert (2008), p. 188: \"In this issue [#118], by Chris Claremont and John Byrne, the X-Men arrived in Japan, where Wolverine met and fell in love with a shy, quiet woman named Mariko Yashida.\" Kitty Pryde/Shadowcat, Phoenix, Mystique, Lady Mastermind, Emma Frost, Siryn, Rachel Summers, Madelyne Pryor,DeFalco \"1980s\" in Gilbert (2008) and Jubilee. He co-created such notable male characters as Sabretooth, Pyro, Avalanche, Strong Guy, Captain Britain,Sanderson \"1970s\" in Gilbert (2008), p. 176: \"British-born writer Chris Claremont and artist Herb Trimpe created a new super hero specifically for Marvel's readers in the United Kingdom.\" Forge, Mister Sinister, and Gambit."]}, {"page": "Cyclops (Marvel Comics)", "response": ["For a time Scott had prolonged amnesia about his childhood. Parts of his memory returned when he was unexpectedly attacked by the demon D'Spayre while on a leave of absence after Jean Grey's perceived first death. Scott spent most of his childhood at the State Home for the Foundlings in Omaha, Nebraska and was subjected to batteries of tests and experiments by the orphanage's owner, Mr. Milbury, an alias for the geneticist Mister Sinister, who also placed mental blocks on Scott.revealed in Classic X-Men #41–42", "In The Further Adventures of Cyclops and Phoenix limited series, both Scott and Jean were sent back in time to 19th century England by Madame Sanctity, a surviving member of the Askani sisterhood.  In 1860, prior to the epilogue of the story, a young English orphan named Daniel (who was freed, one year ago, from the clutches of Nathaniel Essex by Scott and Jean) is shown arriving in New York Harbor from London. As a form of reverence toward the couple who recently showed him great kindness, when urged by his apparent guardian to adopt a new surname at the immigration station, Daniel chooses Summers. Although Scott does not make the familial connection between Daniel and himself, he suspects that his presence in this time (along with Jean's) did something else to affect the course of history, aside from stopping Mister Sinister and Apocalypse.revealed in The Further Adventures of Cyclops and Phoenix #4", "The demons S'ym and N'astirh corrupt Madelyne's feelings of self-despair, transforming her into the Goblin Queen.  Madelyne seeks revenge on Scott for leaving her. When it is revealed that she is a clone created by geneticist Mister Sinister, essentially for the purpose of becoming a brood mare, Madelyne can't take it any more and kills herself.  Scott seemingly kills Sinister with an optic blast, and pursues a romance with Jean, reclaiming his son.X-Factor #36 Scott soon learns that Mister Sinister ran the orphanage in which Scott was raised, and battled Sinister over this.X-Factor #39", "Scott Summers and Jean Grey finally marry.X-Men vol. 2 #30 (March 1994). During their honeymoon, they are brought into the future where they raise Cable for the first 12 years of his life during The Adventures of Cyclops and Phoenix miniseries. After helping Cable defeat the future version of Apocalypse, they are sent back to the past.  At the request of Rachel Summers, Jean assumes the Phoenix identity. Mister Sinister, involved with the machinations of Apocalypse and Stryfe and still alive, tells Cyclops that there is another Summers brother, and leaves him wondering.", "In What If Mister Sinister formed the X-Men, Cyclops and Havok were raised both by Sinister who formed a team consisting of Cyclops, Havok, Sauron, Sabretooth and Madelyne Pryor (possessed by Malice). Believing the team to be heroes, Cyclops eventually came in conflict with the X-Men and Cyclops and the other team's leader, Marvel Girl, instantly grew attracted to each other. Sensing that he was about to lose Scott, Sinister faked his death at the hands of the Brotherhood of Evil Mutants and asked Cyclops, with his \"dying\" words, to hold onto Sinister's dream. Scott respected his surrogate father's last wish and rejected Jean's affection, but he and Havok joined the X-Men to secretly undermine them from within."]}, {"page": "Rogue (Marvel Comics)", "response": ["The team moved to Rogue's hometown of Caldecott for Rogue to recover. As Cyclops and Emma Frost arrived to help Rogue cope with the immensity of the voices in her mind, Marauders arrived, seeking Destiny's diaries. As part of the attack, it was revealed that Mystique was working with the Marauders and for Mister Sinister. Mystique shot Rogue and took her back to Mister Sinister's base, who only kept Rogue alive because she held all the information of Destiny's diaries within her mind.X-Men (vol. 2) #200 (August 2007). Marvel Comics Gambit, who had joined the Marauders and Mister Sinister again, was protective of Rogue, accusing Mystique of being too careless in how she captured her. Standing over Rogue, trying to get her to wake up (after she had fallen into a trance, overcome by the minds she absorbed), Gambit expressed his apologies for what he had done before rejoining Sinister. While in her coma-like state, Rogue had dream-like flashes of memories, seeing her relationship with Gambit, and the millions of minds she absorbed, before she briefly woke up and recognized Gambit. She told him she had a nightmare, before spouting incoherent words and mysterious coordinates.X-Men (vol. 2) #204 (December 2007). Marvel Comics", "Mister Sinister, now in possession of the mutant baby, relocated the Marauders to Muir Island. While standing by Rogue's bedside, Mystique was visited by Mister Sinister, who told her that there will be no cure for Rogue and she will eventually die. Without warning, Mystique ambushed Sinister and shoved his face onto Rogue's. The instant contact seemingly killed Sinister.New X-Men (vol. 2) #46. Marvel Comics.", "In an alternative future featured in the series X-Men: The End, Rogue and Gambit are married and have two children named Olivier and Rebecca \"Becca\" LeBeau. Rogue has also gained complete control over her abilities in this timeline. This Rogue defeats Shaitan and rescues her children from the Neverland Camp, but was ultimately killed by Mister Sinister when he was disguised as Gambit."]}, {"page": "Deadpool", "response": ["* Deadpool appears in a self-titled video game, with Nolan North reprising the role once again. The game's plot revolves around Deadpool attempting to stop Mister Sinister and his army of cloned mutants."]}, {"page": "Colossus (character)", "response": ["During the Colossus: Bloodline limited series, Colossus made a trip to Russia in response to a call for help from his cousin, journalist Larisa Mishchenko. Her research had established that their family descended from Grigori Rasputin, and that their relatives were being systematically murdered. Rasputin is established as having been a powerful mutant, whose power and life essence had been passed down to his descendants. As his descendants are murdered, his great power is invested in greater measure in the remaining descendants. When there is only one descendant left, Rasputin will be reborn within that individual. Mister Sinister, an old ally of Rasputin, is revealed as the man behind the murders.", "In Earth X, Colossus has become Tsar Piotr of Russia. His country's massive grain supply, protected by an army of Crimson Dynamos, provides one of the greatest food sources for the world. Occasionally, he is attacked by Life Model Decoys of Nick Fury, who seem to think that Piotr is a stereotypical Communist. It is mentioned in passing that at some point in the future, he will travel back in time and become Mister Sinister.Paradise X #3"]}, {"page": "Gambit (comics)", "response": ["He was part of a thieves' guild before becoming a member of the X-Men. Given his history, few X-Men trusted Gambit when he joined the group. There was consistently a source of stress between him and his on-again, off-again love interest and eventual wife Rogue. This was exacerbated when Gambit's connections to villain Mister Sinister were revealed, although some of his team members accept that Gambit honestly seeks redemption. Often portrayed as a \"ladies' man,\" Gambit has shown a more vulnerable side of himself over the years, especially when it comes to Rogue. Gambit remains fiercely proud of his Louisiana heritage and speaks in a Cajun accent.", "Later during his teen years, Remy was first hired by Mister Sinister, then in the disguise of Dr. Nathaniel Essex. Essex wanted his stolen diaries back from the Weapon X program. Remy and the Thieves' Guild accepted the mission and sent out Remy to retrieve said diaries. Standing in the cold, scouting the Weapon X facility, Remy couldn't bear the cold and swore he would steal a long, stylish jacket in New Orleans after the mission, which he did. Upon entering the facility, Remy witnessed Wolverine escaping from his adamantium procedure and found the diaries. However, deeming them to be too dangerous for Essex to have them, as Remy didn't fully trust him, Remy burned the diaries. He headed back home, only to find a disappointed Thieves' Guild and Essex.Weapon X: First Class #3. Marvel Comics.", "After his exile from New Orleans, he wandered the world and became a master professional thief, making many contacts (and quite a few enemies). During this period, Gambit found he had an uncontrollable amount of energy flowing through him, to the point that he could not withstand it. Desperate, Gambit went to Mister Sinister for help. Sinister modified Gambit's power by removing a portion of Gambit's brain stem, making him significantly less powerful, but able to control the still considerably large amount of power in him.X-Men Origins: Gambit #2. Marvel Comics. Years later, a much younger version of Mister Sinister surgically returned it, upon Gambit's request, when Gambit time-traveled to the 19th century.Gambit vol. 3 #12–14. Marvel Comics.", "However, Sinister wanted the favor returned, so Gambit carried out various missions for him. For the last of these operations, Gambit gathered together a group of mercenaries which Sinister named the Marauders. Mister Sinister then ordered Gambit to lead Sabretooth, Blockbuster, Prism, and Riptide into the tunnels under New York City — while unknown to Gambit however — Mister Sinister had also ordered Scalphunter, Arclight, Harpoon, Malice, Scrambler and Vertigo into the tunnels. The group of Scalphunter followed the Morlock Tommy and their goal was to wipe out the Morlocks. Gambit was unable to prevent the Marauders from killing a considerable number of Morlocks, but he was able to save a single child named Sarah, who would grow up to be Marrow, the leader of the mutant terrorist group Gene Nation. Gambit long kept his involvement with Mister Sinister and his mission in the massacre a secret from his fellow X-Men, much to their eventual displeasure.The Uncanny X-Men #350. Marvel Comics.", "During the story arc with Golgotha, Gambit revealed some deep insecurities he had about his romantic relationship with Rogue, saying that \"Maybe dis no-touching thing is getting to me... more den I thought\".X-Men #167. Marvel Comics. He also told Rogue that she should just get together with Logan, thinking that there was a hidden attraction between the two. As a result of the accusation, Logan kissed Rogue, but she broke it off before it caused any major damage. Gambit then began to realize what he was saying, questioning his romantic love for Rogue, but soon after began to suffer from hallucinations that he was fighting Mister Sinister.X-Men #169. Marvel Comics. However, Rogue and Gambit soon realized that Golgotha made them say things they did not mean and before the final battle, they \"kissed\" through their spacesuit helmets.X-Men #170. Marvel Comics.", "After the X-Men defeated Apocalypse, Sunfire left with Gambit to help him clear Apocalypse's brainwashing and live as entirely new beings, only to then be approached by Mister Sinister.", "During the 2007–2008 \"Messiah Complex\" storyline, Gambit is personally targeted by Wolverine during the X-Men's assault on Mister Sinister's Antarctic base.X-Men #205 After being tortured by the Canadian mutant, Gambit reveals that Cable has the baby before Sinister manages to regain the advantage and drive the X-Men off with Gambit later revealed not to be harmed. Later, as Bishop attempts to kill the baby (after immobilizing Cable), Gambit and several of the Marauders quickly stop him with Gambit bringing a section of the ceiling down on Bishop. Knowing the X-Men will arrive in moments, the Marauders depart with the baby, but not before Gambit ponders what could make Bishop turn on the X-Men.The Uncanny X-Men #494. Marvel Comics.", "Gambit and Xavier then drive out to the Nuclear Research Facility at Alamogordo, the place where the fathers of Xavier, Juggernaut, and Ryking all worked at some point in their lives and is most likely where Mister Sinister was running his genetic operations on the X-gene. However, Xavier begins to suffer terrible headaches, and he and Gambit decide to wait it out in the desert for a few hours, where they are once again attacked by the Assassins Guild.X-Men: Legacy #212. Marvel Comics.", "Charles Xavier is abducted and taken to the Almagordo facility, where it is revealed that the employer of the assassins was Amanda Mueller, the head of the Black Womb Project, a former lover and protégée of Mister Sinister (as well as direct ancestress of the Summers' line), who plans to use Charles to activate Sinister's Cronus machine, so as to be able to revive herself with Essex's own superpowered essence. Meanwhile, Gambit manages to defeat the rest of the assassins with the assistance of Sebastian Shaw, and they form a temporary alliance of convenience to destroy the Cronus machine, which threatens Shaw as well and rescue Xavier. They ultimately manage to succeed with a desperate last-minute life-or-death gamble when Gambit directly charges Shaw with biokinetic energy, giving him enough power to utterly shatter the otherwise indestructible machine.", "In the miniseries X-Men: The End: Heroes and Martyrs, Gambit was revealed to be the clone of Mister Sinister, created from Sinister's own pre-mutated DNA. Sinister wished to destroy his master, Apocalypse, and to do so he needed a body that had not been subject to Apocalypse's altering. He then engineered mutant powers for the clone, using the DNA of Cyclops. This technically makes him the third Summers brother; in that alternative reality. However, Apocalypse learned of Sinister's plan and had the child stolen and left it in the care of the Thieves Guild."]}, {"page": "Bishop (Marvel Comics)", "response": ["In Messiah Complex, an event revitalized Bishop's timeline as a viable future: the birth of the first mutant child since M-Day. As the Marauders, on Mister Sinister's orders, try to gather anyone and anything with knowledge of the future, Bishop is the only target they were unable to locate and terminate. It is revealed that he had betrayed the X-Men and he attempted to kill the baby. Before he could succeed, he was thwarted by the Marauders, who escaped with the baby.The Uncanny X-Men #494 As X-Men arrive on the scene, Bishop pretends to have attempted to retrieve the baby. As Multiple Man's duplicate and Layla Miller find out in their mission to one of the planet's possible futures (80 years in the future) that the birth of the child created, the child apparently kills a million people in an event dubbed the Six-Minute War, and the U.S. government incarcerates all the mutants into concentration camps, where Bishop is born, grows up, and sees his parents killed. As Multiple Man's dupe and Layla find out, Bishop wishes at a young age to have had the opportunity to kill the baby, so that while he would not be born, he would also not have to see his parents die, and to endure the horrors of life in the concentration camps. Layla kills the dupe so that the information conveyed to them by young Bishop can return to the present, to the Multiple Man prime, who conveys Bishop's treachery to the X-Men.X-Factor #27 The X-Men then attempted to alert X-Force of Bishop's betrayal, but he managed to block all of their communication channels. After arriving on Muir Island and fighting past the Marauders, Bishop found Cable attempting to escape with the baby and the two fight. Both mutants are then attacked by Predator X, who viciously rips off Bishop's right arm. Bishop cauterizes his torn shoulder on an unconscious Sunfire and in an attempt to shoot down a teleporting Cable, he misses and hits Professor X instead.X-Men #207", "* Bishop appears in Marvel Heroes as an NPC voiced again by Emerson Brooks. The version who is being used by Doctor Doom to empower himself with a Cosmic Cube on the mutant is actually a clone created by Mister Sinister."]}, {"page": "Mystique (character)", "response": ["Mystique remains with the Marauders during the hunt for the first new mutant baby, but is revealed to have murdered Mister Sinister in a plot involving the baby and Rogue's killing touch. She also appears to be working with Gambit, who, like her, has ulterior motives to want to betray Mister Sinister. When Sinister approaches Mystique as she is with the comatose Rogue, Mystique shoves Sinister onto Rogue, killing him through fatal skin-to-skin contact. Then, in keeping with the words of the Destiny Diaries, she touches the baby's face to Rogue's. The baby's touch purges her of the Strain 88 virus and all the residual psyches she had absorbed over her life, including Hecatomb. Rogue is sickened by Mystique's manipulations, and leaves.", "Mystique shows up again, posing as Bobby Drake's ex-girlfriend Opal Tanaka. She sets off a bomb inside of Bobby's Blackbird before shooting him and kicking him out of the plane.X-Men: Manifest Destiny #1 Later, she follows Iceman to the hospital and injects him with a fatal dose of a toxin created by Mister Sinister. Hospital staff try to get to Iceman, but they are held back by Mystique while Iceman expels the toxin from his system. Afterward, Mystique attacks Iceman in a truck and sets the truck ablaze with Iceman in it. Iceman steps out of the fire unharmed and disarms and immobilizes Mystique, but she escapes after turning her body into her child form. Mystique impersonates Iceman and stands on top of the Golden Gate bridge threatening to blow it up. Iceman arrives and discovers the reason for Mystique doing this is Wolverine telling her that she will die alone. After a heated conversation, Iceman freezes the bomb. Mystique jumps off the bridge into the water. Iceman tells Cyclops and Hank McCoy that he knows that she is not dead and thanks her for what she did for him.X-Men: Manifest Destiny #5", "In the trilogy book series X-Men: The End Mystique is posing as Dark Beast and pretending to work with Mister Sinister. When Sinister murders Rogue she kills him. Gambit later asks her to look after his and Rogue's children when he goes off into space.X-Men: The End (book two) #6", "* Mystique was a recurring character in the 1990s X-Men animated series, voiced by Randall Carpenter (seasons one and two), and by Jennifer Dale (subsequent appearances). This version was the Brotherhood of Mutants' leader and a close ally of Apocalypse (who in this version gave her powers and adopted the identity of a mutant cure doctor to lure into servitude), Mister Sinister and Magneto. She is also the birth mother of Graydon Creed Jr., Nightcrawler (Kurt Wagner) and the adoptive mother of Rogue, whom she's been trying to return her to her villainous ways."]}, {"page": "List of fictional scientists and engineers", "response": ["* Mister Sinister"]}, {"page": "Wolverine (character)", "response": ["The aftermath of Wolverine's death is explored in the series Wolverines.Beard, Jim (April 28, 2014). \"C2E2 2014: Death of Wolverine\". Marvel.com. Sharp, Skel, Neuro, Endo, Junk, and the \"Wolverines\" (a team formed from the fallout of his death by Daken, Lady Deathstrike, Mystique, Sabretooth, and X-23) try to find Logan's adamantium-covered body, which is taken by Mister Sinister. The group infiltrate Mister Sinister's fortress to retrieve the body, but it is taken by the X-Men after a battle.Wolverines (vol 5) #6. Marvel Comics.", "As one of his last requests, Wolverine arranged for Spider-Man to become a member of the Jean Grey School for Higher Learning's staff, wanting Spider-Man to investigate a suspected double agent.Spider-Man and the X-Men #1. Marvel Comics. Despite the initial hostility he faced from the rest of the team, Spider-Man soon exposed a plan by Mister Sinister to acquire genetic samples from the X-Men and create a new clone army. Storm even noted after Sinister's defeat that Spider-Man's unconventional attitude made him more like Wolverine than she had acknowledged.Spider-Man and the X-Men #6. Marvel Comics.", "* In Adamantium Agenda, Tony Stark tries to buy a superhero genetic code (possibly Logan's) from an underground secret auction, helped by Spider-Man, Luke Cage, Jessica Jones, and X-23's Wolverine appearance when they infiltrate an auction involving superhuman DNA that is crashed by Mister Sinister. While Soteira was revealed to have stolen some of Mister Sinister's work, Iron Man discovers that Sarah Kinney is X-23's biological mother and that one of the X-Men members is not a mutant meaning that there is a genetically-altered sleeper agent among them.Hunt for Wolverine: Adamantium Agenda #1-4. Marvel Comics."]}, {"page": "Jamie Madrox", "response": ["In the first day of the team, one of his duplicates is shot and killed, and Madrox learns for the first time that he cannot absorb a deceased duplicate. This makes him realize for the first time how independent his duplicates actually are.X-Factor #71 This becomes clearer to him when a duplicate, working for Mister Sinister, decides that it wants to absorb the original, which it does for a short time, until Jamie's dominant personality breaks free and reabsorbs the wayward dupe.X-Factor #72–75", "* Multiple Man appears in the Wolverine and the X-Men animated series episode \"eXcessive Force\", voiced by Crispin Freeman. This version is a member of Mister Sinister's Marauders. When Cyclops attacks Sinister, believing he is holding Jean Grey hostage, Sinister has Multiple Man fight Cyclops in his place. The Marauder initially overpowers the X-Man until Iceman intervenes, freezing Multiple Man and all of his duplicates.", "* The Madri appear in X-Men Legends II: Rise of Apocalypse. This version is a group of cultists of Apocalypse unconnected to Jaime Madrox, Mister Sinister, and Dark Beast."]}, {"page": "Strong Guy", "response": ["Mister Sinister manipulates Strong Guy into destroying the Washington Monument while fighting Slab.X-Factor #74 With X-Factor, he aids the American-supported Trans-Sabal government in a war against rebels, and fights the Hulk,Incredible Hulk #290-292; X-Factor #76 then clashes with the Mutant Liberation Front.X-Factor #77-78 He also fights the Brotherhood of Evil Mutants.X-Factor #82"]}, {"page": "Warren Worthington III", "response": ["Angel is part of the team that investigates the new mutant birth in Alaska.X-Men Messiah Complex (2007) He is later part of the team who is looking for former Acolytes.The Uncanny X-Men #492 (2008) He is next seen part of the same team, but attacking the Marauders.New X-Men vol. 2 #44 (2008) Warren goes against Mister Sinister, but is easily defeated once Sinister recovers from Emma Frost's mental attack.X-Men vol. 2 #205 (2008) Angel is knocked out, but recovers and is present with the X-teams for the final battle over the fate of the baby.X-Men vol. 2 #207 (2008)", "Warren becomes close friends with Nightcrawler, initially due to the fact that they both have physical mutations. Warren gets over his initial attraction to Storm, and after the events in Genosha, engages in a relationship with Dazzler. After Bishop recruits Dazzler in his new team of X-Men, she makes Angel part of the team (despite Bishop's protests). While trying to protect the Morlocks he is shot to death by Mister Sinister.Ultimate X-Men #90 Thanks to Jean Grey, he later returns to life.Ultimate X-Men #93 He is seen as a member of Colossus' enhanced team, his appearance drastically altered through the use of Banshee, the Ultimate version of Mutant Growth Hormone (MGH), resulting in Warren having an eagle-like head and feathered upper torso.Ultimate X-Men #94 The mutation seems to have progressed, as he is now completely feathered and has talons and double-jointed knees. During the Ultimatum event, Warren is brutally killed by Sabertooth.", "* Dave Wittenberg voices Angel in X-Men Legends II: Rise of Apocalypse. Angel shows up as the scout for the different areas that are visited until he is captured by Apocalypse and turned into Archangel. After fighting him as Archangel, the player follows Apocalypse to Egypt for the game's climax. In stage 5, it is mentioned that his mind and body are changed by Mister Sinister's drugs. Though Professor X says that Angel will recover from the mind-control drugs, it is unknown if Angel will recover from the body-altering drugs and turn back to his natural form. Archangel has special dialogue with Jean Grey."]}, {"page": "Moira MacTaggert", "response": ["The European superhero team Excalibur took up residence on Muir Island after assisting Moira.Excalibur #71 She had been attacked by agents of Mister Sinister who was seeking the genetic information on her son. Moira became an official member of the group, acting as their medic, team mother, and morale officer. An information leak revealed her to be the only human infected by the Legacy Virus—a bizarre turn of events possibly caused by her long exposure to the infected on Genosha, her autopsy of Illyana, or some susceptibility because she gave birth to a mutant.Excalibur #80 Despite these events, she maintained a strong outlook on life, helping to maintain discipline, reduce tension, and increase the team's effectiveness throughout Europe. She convinced the team to stay behind when Onslaught emerged, telling them they might be needed if other heroes fell.Excalibur #101"]}, {"page": "Sabretooth (character)", "response": ["Claremont has stated in an interview that in X-Men Forever the original true Sabretooth makes his reappearance after a long time, and that most of the previous appearances of Sabretooth prior to X-Men Forever #2, that follows directly after X-Men vol. 2 #3, were that of a weaker Sabretooth clone created by Mister Sinister. The original true Sabretooth reappears dressed in the Jim Lee costume in X-Men Forever, which would make the weaker clone the one dressed in the John Byrne costume. Claremont claims he always meant for the Sabretooth dressed in the Byrne costume to be later outed as a clone of the original true Sabretooth. Claremont stated: \"Speaking specifically of the cast of X-Men Forever, one character who's becoming more enticing is Sabretooth, in part because (at least as it relates to my conception of him) very little is actually known. They then filled his skeleton with adamantium. At this specific point of his life, readers haven't really seen that much of him over the years, since the Sabes that's shown up most over the time is a less-endowed copy cloned from spare cells by Mr. Sinister.\"", "Sabretooth eventually encounters a thief by the name of Gambit and the two fight, but find they aren't exactly enemies.X-Men vol. 2 #33. Marvel Comics. Later while recruiting for Mister Sinister, Gambit gathers a group of mutant criminals he has associated with who form the Marauders.Uncanny X-Men #350. Marvel Comics. Sinister clones several of the Marauders so that he has a loyal group of lackeys after the originals die.X-Men #37. Marvel Comics."]}, {"page": "Kraven the Hunter", "response": ["It was revealed during 2009's X-Men/Spider-Man crossover miniseries that years earlier, Kraven made a deal with Mister Sinister. He and the Blob tracked down the X-Men, and they fought the united forces of Spider-Man and the original X-Men. Kraven fled after a short battle, but not before wounding each member of the X-Men. Kraven returned to Sinister, with genetic samples from Cyclops, Marvel Girl, Iceman, Angel, and Beast. Furthermore, Sinister requested from Kraven a sample of his DNA.X-Men/Spider-Man #1. Marvel Comics. Mister Sinister later cut a deal with Carnage in order to obtain a sample of the Carnage symbiote. After removing the sentience from the Carnage symbiote sample, Mister Sinister combined it with the DNA of the original X-Men and Kraven the Hunter, where he would use this creation at a later date.X-Men/Spider-Man #3. Marvel Comics. Years later after the death of Kraven, an ex-Morlock who had kept his powers post M-Day named Joe Buggs was murdered by a mysterious mutant hunter. His friend Ed (who had lost his powers) went to the X-Men for help. He claimed that the man who killed Buggs was Kraven the Hunter. Although they were skeptical about Kraven's apparent resurrection, the X-Men called on the help of Spider-Man, who had battled Kraven many times over the years. After discussing the battle that they had with Kraven years ago and the fact that he had given samples of the X-Men's DNA to Sinister for cloning, the lights went out on the wing where they were located. The hunter attacked and quickly dispatched Colossus, but was held at bay by Spider-Man's webbing. He broke free, claiming his name is Xraven. The X-Men quickly realize that Xraven has all of the powers of the original X-Men, while also sporting claws, big feet, and wings that have a very flexible skeletal structure enough for him to press them to the back of his torso and legs with only the slightest bulge visible under his clothing. He was able to defeat Cyclops and Shadowcat, holding her hostage, giving the ultimatum that he would kill her if they did not surrender. Spider-Man insulted Xraven, claiming that Kraven would never threaten a helpless girl. Xraven was momentarily fazed by his comment, but attacked again, claiming that he is the \"favored one\". Cyclops realizes Xraven's weakness and tells him that Mister Sinister sees him as nothing but a pawn. He tells Xraven to read his mind, in order for him to see the kind of a man Sinister really is. After Xraven sees Cyclops's memories, he flees, but the X-Men become aware of the fact that he was able to get DNA samples from Shadowcat, Colossus, Nightcrawler, and Wolverine. Returning to Mister Sinister with the samples, Mister Sinister tells him that he planned to clone a new generation of mutants, and that he would unite all mutantkind. After seeing what Sinister's real intentions were in Cyclops's memories, Xraven destroys the samples, claiming that Mister Sinister would breed slaves as opposed to warriors, and Xraven attacks him. Although it is clear that Mister Sinister survived his confrontation with Xraven, it is currently unknown whether Xraven survived.X-Men/Spider-Man #4. Marvel Comics."]}, {"page": "Nathaniel", "response": ["* Nathaniel Essex, alter ego of Mister Sinister, a Marvel Comics supervillain"]}, {"page": "Xorn", "response": ["During her time with the team, Xorn never removed her helmet causing some to believe it contained her energy powers while others in the X-Men whispered that the helmet truly concealed hideous scars from her time in the Core.Age of Apocalypse #3 However the truth was that Xorn was actually the thought deceased Husk who had been manipulated by Mister Sinister and assumed the identity of Xorn and used her husking abilities to enable herself to demonstrate many different powers, in order to infiltrate the X-Men and kill Magneto and Rogue's son, Charles.Age of Apocalypse #4"]}]}}