{"wiki_id": "http://www.wikidata.org/entity/Q3023772", "itemLabel": "Derek Townsley", "itemDescription": "English footballer (born 1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Townsley", "wikipedia_page": {"main": "Derek Johnstone Townsley (born 21 January 1973, in Carlisle) is an English former professional footballer. His clubs included Gretna, Queen of the South, Motherwell, Hibernian and Oxford United. Townsley was normally a midfielder, although he was a versatile player and also played in attack and defence.", "link_mentions": [{"page": "Workington A.F.C.", "response": ["Ian McDonald resigned as manager at the end of the 2013/14 season. Gavin Skelton was appointed as his replacement in May 2014. Derek Townsley joined the club as Skelton's assistant.", "Skelton led the Borough Park side to the Northern Premier League Play-offs in his first full season in charge, finally falling to Ilkeston Town in front of 1,391 supporters at Borough Park. Skelton left Workington in June 2015 to take a coaching role with the Dumfries club Queen of the South. Derek Townsley was appointed as his replacement a couple of weeks later.", "*Derek Townsley – May 2015  – Jun 2016"]}, {"page": "Craig Gordon", "response": ["Gordon had become a Scotland regular by 2005 and his consistent displays during the 2005–06 season helped Hearts to a second-place finish in the Scottish Premier League and victory in the Scottish Cup. The trophy was won in a penalty shootout against Gretna following a 1–1 draw, with Gordon saving opponent Derek Townsley's penalty. He kept a clean-sheet in a 4–0 win against Edinburgh derby rivals Hibernian in the semi-final. Hearts owner Vladimir Romanov rejected an approach from Serie A side Palermo for Gordon earlier in the season.  That season he was voted Scottish Football Writers' Association Player of the Year, becoming the first Hearts player to win the award since Sandy Jardine in 1986 and also the first goalkeeper since Rangers' Andy Goram in 1993."]}, {"page": "Jamie McAllister", "response": ["In 1997 the club reached the Scottish Challenge Cup final for the first time. Second division Queen of the South lost 1–0 to First division Falkirk despite a rousing Queens display at Motherwell's Fir Park Stadium; a performance that included the man of the match award going to Queens veteran central midfield playmaker Tommy Bryce and an early career appearance for McAllister as substitute. A late chance for a Derek Townsley equaliser went agonisingly over for Queens.McALLISTER WANTS TO EXORCISE GHOSTS"]}, {"page": "Jim Thomson (footballer, born 1971)", "response": ["Thomson first joined Dumfries club Queen of the South as the club were rebuilding in 1997 in the post Harkness era. New chairman Norman Blount was getting the wheels moving on the club's revival. In 1997 the club reached the Scottish Challenge Cup Final for the first time. Second Division Queens lost 1–0 to First Division Falkirk, despite a rousing Queens display at Motherwell's Fir Park, a performance that included the man of the match award going to Queens veteran central midfield playmaker Tommy Bryce and an early career appearance for Jamie McAllister. A late effort from Derek Townsley denied Queens an equaliser, as his gilt-edged chance went over the bar."]}, {"page": "David Mathieson", "response": ["In 1997 Queen of the South reached the Scottish Challenge Cup final for the first time. Second Division Queens lost 1-0 to 1st Division Falkirk despite a rousing Queens display at Motherwell's Fir Park; a performance that included the man of the match award going to Queens veteran central midfield playmaker Tommy Bryce and an early career appearance for Jamie McAllister. A late chance for a Derek Townsley equaliser went agonisingly over for Queens. David Mathieson played in goals for Queens."]}, {"page": "Andy Aitken (footballer, born 1978)", "response": ["Aitken joined a Queen of the South in 1996 with new chairman Norman Blount getting the wheels moving on the club's revival. In 1997 Queen of the South reached the Scottish Challenge Cup final for the first time. Second Division Queens lost 1–0 to 1st Division Falkirk despite a rousing Queens display at Motherwell's Fir Park; a performance that included the man of the match award going to Queens veteran central midfield playmaker Tommy Bryce and an early career appearance for Jamie McAllister. A late chance for a Derek Townsley equaliser went agonisingly over for Queens.Andy Aitken career profile on 'Queens Legends' www.qosfc.com", "Aitken joined Ayr United in the 2009 close season. His time there was impacted by an injury that was to keep him out for nine weeks ironically sustained against QoS at Palmerston. At the end of the 2009-10 season rejoined Annan Athletic who had by now joined the Scottish Football League. He became Assistant Manager after the departure of Derek Townsley, Aitken's ex teammate from the '97 Challenge Cup Final team.."]}, {"page": "Craig Barr", "response": ["Just after signing, Barr said \"I'm really looking forward to the move. Queens are coming off the back of a fantastic season and I'm excited at the prospect of playing for the Scottish Cup finalists. I know big Neilly MacFarlane, Jamie McQuilken and 'Tosher' from my time at Gretna and also have a lot of respect for ex-Queens player, big Derek Townsley, who I also know well\"."]}, {"page": "2006 Scottish Cup Final", "response": ["|DF ||5 || Derek Townsley"]}, {"page": "Norman Blount", "response": ["Players to have signed for Queens during the Blount regime include Jamie McAllister,Jamie McAllister interview on www.qosfc.com  Derek Townsley, Jim Thomson, David Lilley, David Mathieson and Andy Aitken. In a later interview for the club website reflecting on his time at Queens McAllister said, \"Norman Blount, the chairman at the time was different class\"."]}, {"page": "Ronnie Bradford (football chairman)", "response": ["Players to have signed for Queens during the Blount regime include Jamie McAllister, Derek Townsley, Jim Thomson, David Lilley, David Mathieson and Andy Aitken."]}, {"page": "Townsley", "response": ["*Derek Townsley (born 1973), English professional footballer"]}, {"page": "2003–04 Hibernian F.C. season", "response": ["| Derek Townsley"]}, {"page": "2002–03 Hibernian F.C. season", "response": ["As one of the SPL clubs who had not automatically qualified for European competition, Hibs entered at the last 32 stage (second round) of the competition, in which they defeated Alloa Athletic 2–0. Hibs were then drawn against Rangers, managed by former Hibs boss Alex McLeish, at home in the last 16.Hibernian 2 Rangers 3, Sporting Life. The match proved to be a \"miserable night\" for Hibs, as the tie was lost 3–2 despite taking an early lead. The lead was quickly turned into a deficit by an own goal and a defensive error by Derek Townsley. Despite Garry O'Connor's goal levelling the score midway through the second half, Rangers scored what proved to be the winning goal soon afterwards. Gary Smith was sent off late on, reducing Hibs to ten men. To top things off, midfielder Alen Orman suffered what appeared to be an epileptic fit during the first half and had to be substituted."]}, {"page": "2001–02 Hibernian F.C. season", "response": ["| Derek Townsley"]}, {"page": "George Rowe (footballer)", "response": ["Rowe then signed for Queen of the South in Dumfries at the start of the 1992-93 season where he remained for the next 8 years. In his final season at Palmerston Park, Rowe was appointed joint player-manager alongside Ken Eadie and towards the end of that season Hamilton Academical were deducted 15 points for failing to play a match because of a players' strike. This resulted in Queens escaping relegation to the bottom tier of Scottish football by 4 points, as the club had 29 points to the Accies 25 points. With Queens chairman Norman Blount injecting much needed capital into Queens revival, some of Rowe's team-mates included Tommy Bryce, Jim Thomson and Andy Aitken, as the Doonhamers reached the 1997–98 Scottish Challenge Cup Final, narrowly defeated 1-0 by Falkirk in a battling performance. Most notably, Derek Townsley, who  moved on to play for Motherwell, Hibernian and Gretna, missed a gilt-edged chance to equalise in the closing minutes of the match. Jamie McAllister, who went on to play for Aberdeen, Livingston and Hearts in Scotland and also Bristol City, Yeovil Town and Exeter City in England was also a used substitute in the closing minutes of the match."]}, {"page": "List of people from Carlisle", "response": ["*Derek Townsley, professional footballer"]}, {"page": "1997 Scottish Challenge Cup Final", "response": ["Queens performed creditably against the Falkirk side who at the time were playing in a higher division of the Scottish football set up, cheered on noisily by the QoS supporters witnessing their team in their first national cup final since the Scottish Qualifying Cup win of 1923/24.\"Club History\" www.qosfc.com The decisive moment of the game was when Falkirk's David Hagen scored in the sixty fifth minute. Queens' had a late opportunity to equalise when Tommy Bryce teed up Derek Townsley in a good shooting position just outside the Falkirk penalty area. Townsley's shot however failed to trouble Paul Mathers in the Falkirk goal as the ball went over the cross bar. Hagen's goal was enough to separate the sides with Bryce taking the man of the match award.", "|MF ||6|| Derek Townsley "]}]}}