{"wiki_id": "http://www.wikidata.org/entity/Q302433", "itemLabel": "Richard Hughes", "itemDescription": "British writer (1900-1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Hughes_(British_writer)", "wikipedia_page": {"main": "Richard Arthur Warren Hughes  (19 April 1900 – 28 April 1976) was a British writer of poems, short stories, novels and plays.He was born in Weybridge, Surrey.  His father was Arthur Hughes, a civil servant, and his mother Louisa Grace Warren who had been brought up in the West Indies in Jamaica.  He was educated first at Charterhouse School and graduated from Oriel College, Oxford in 1922.\nA Charterhouse schoolmaster had sent Hughes's first published work to the magazine The Spectator in 1917. The article, written as a school essay, was an unfavourable criticism of The Loom of Youth, by Alec Waugh, a recently published novel which caused a furore for its account of homosexual passions between British schoolboys in a public school. At Oxford he met Robert Graves, also an Old Carthusian, and they co-edited a poetry publication, Oxford Poetry, in 1921. Hughes's short play The Sisters' Tragedy was being staged in the West End of London at the Royal Court Theatre by 1922. He was the author of the world's first radio play, Danger, commissioned from him for the BBC by Nigel Playfair and broadcast on 15 January 1924.\nHughes was employed as a journalist and travelled widely before he married the painter Frances Bazley (1905-1985) in 1932. They settled for a period in Norfolk and then in 1934 at Castle House, Laugharne in South Wales. Dylan Thomas stayed with Hughes and wrote his book Portrait of the Artist as a Young Dog whilst living at Castle House. Hughes was instrumental in Thomas relocating permanently to the area.He wrote only four novels, the most famous of which is The Innocent Voyage (1929), or A High Wind in Jamaica, as Hughes renamed it soon after its initial publication. Set in the 19th century, it explores the events which follow the accidental capture of a group of English children by pirates: the children are revealed as considerably more amoral than the pirates (it was in this novel that Hughes first described the cocktail Hangman's Blood). In 1938, he wrote an allegorical novel, In Hazard, based on the true story of the S.S. Phemius that was caught in the 1932 Cuba hurricane for four days during its maximum intensity. He wrote volumes of children's stories, including The Spider's Palace.\nDuring World War II, Hughes had a desk job in the Admiralty. He met the architects Jane Drew and Maxwell Fry, whose children stayed with the Hughes family for much of that time. After the end of the war, he spent ten years writing scripts for Ealing Studios, and published no more novels until 1961. Of the trilogy The Human Predicament, only the first two volumes, The Fox in the Attic (1961) and The Wooden Shepherdess (1973), were complete when he died; twelve chapters, less than 50 pages, of the final volume are now published. In these he describes the course of European history from the 1920s through World War II, including real characters and events—such as Hitler's escape after the abortive Munich putsch—as well as fictional.\nLater in life Hughes relocated to Ynys in Gwynedd.\nHe was churchwarden of Llanfihangel-y-traethau, the village church, where he was buried when he died at home in 1976.Hughes was a Fellow of the Royal Society of Literature and, in the United States, an honorary member of both the National Institute of Arts and Letters and the American Academy of Arts and Letters. He was awarded the OBE (Officer of the Order of the British Empire) in 1946.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Richard Hughes (1900–1976, E/W)"]}, {"page": "Martin Amis", "response": ["In 1965, at the age of 15, Amis played John Thornton in the film version of Richard Hughes' A High Wind in Jamaica."]}, {"page": "Under Milk Wood", "response": ["In 1938, Thomas suggested that a group of Welsh writers should prepare a verse-report of their \"own particular town, village, or district.\"Letter to Meurig Walters, written in Blashford, Hampshire, 28 March 1938 in Collected Letters. A few months later, in May 1938, the Thomas family moved to Laugharne, and lived there intermittently for just under two years until July 1941; they did not return to live in Laugharne until 1949.Thomas’ Collected Letters show that the family lived for eighteen months in Gosport Street and Sea View, Laugharne, between May 1938 and July 1940, and for three months in the Castle in 1941. They did not return to live in Laugharne until May 1949.  The author Richard Hughes, who lived in Laugharne, has recalled that Thomas spoke with him in 1939 about writing a play about Laugharne, in which the villagers would play themselves. Four years later, in 1943, Thomas met again with Hughes, and this time outlined a play about a Welsh village certified as mad by government inspectors.Richard Hughes in Thomas D.N. (2004) Dylan Remembered 1935-1953 p75 Seren, and also Hughes' review of Under Milk Wood in the Sunday Times, 7 March 1954."]}, {"page": "Prix Femina", "response": ["|1931|| A High Wind in Jamaica || Richard Hughes"]}, {"page": "Laugharne", "response": ["*Richard Hughes (1900–1976), writer, lived at Castle House, instrumental in Dylan Thomas moving to Laugharne"]}, {"page": "Richard Hughes", "response": ["Richard Hughes may refer to:", "* Sir Richard Hughes, 1st Baronet (c. 1708–1779), British naval commander, first of the Hughes baronets of East Bergholt in the County of Suffolk", "* Sir Richard Hughes, 2nd Baronet (c. 1729–1812), British naval officer and Lieutenant-governor of Nova Scotia", "* Richard Hughes (cricketer) (1926–2020), English cricketer", "* Richard Hughes (footballer) (born 1979), Scottish footballer", "* Richard Hughes (jockey) (born 1973), Irish jockey", "* Richard Hughes (journalist) (1906–1984), Australian journalist", "* Richard Hughes (musician) (born 1975), drummer with Keane", "* Richard Hughes (British writer) (1900–1976), British writer", "* Richard Hughes (Archdeacon of Bangor) (1881–1962)"]}, {"page": "Naomi Mitchison", "response": ["In 1932, Mitchison was commissioned by Victor Gollancz to edit a guide to the modern world for children. Mitchison's book, An Outline for Boys and Girls and Their Parents, included several distinguished contributors, including W. H. Auden, Richard Hughes, Gerald Heard, and Olaf Stapledon. On publication, An Outline was praised by The Times Literary Supplement, the New Statesman and the London Mercury. However, several clergymen, including the Archbishop of York, were angered by the book's lack of emphasis on Christianity, while other right-wing authors objected to a perceived sympathy with the Soviet Union. The Conservative writer Arnold Lunn wrote a lengthy attack on the book in the English Review, which contributed to its commercial failure."]}, {"page": "Duppy", "response": [" A High Wind in Jamaica (1929) by Richard Hughes makes several references to duppy."]}, {"page": "List of Old Carthusians", "response": ["*Richard Hughes (1900–1976), novelist and dramatist"]}, {"page": "Laugharne Castle", "response": ["The author Richard Hughes leased Castle House in the 1930s and 1940s, and wrote his novel In Hazard (1938) working in the garden gazebo overlooking the river. Dylan Thomas stayed with Hughes and also worked in the gazebo on his Portrait of the Artist as a Young Dog (1940)."]}, {"page": "1976 in poetry", "response": ["* April 28 – Richard Hughes, 76 (born 1900), English poet, fiction writer and screenwriter"]}, {"page": "1954 in Wales", "response": ["*25 January – Under Milk Wood is performed for the first time on BBC radio with an all-Welsh cast led by Richard Burton and including Hugh Griffith, Rachel Thomas and Philip Burton.Richard Hughes in Thomas, D. N. (2004), Dylan Remembered 1935-1953, Seren, p.75; and also Hughes' review of Under Milk Wood in The Sunday Times, March 7 1954."]}, {"page": "Richard Arthur Warren Hughes", "response": ["#REDIRECT Richard Hughes (British writer)"]}, {"page": "1932 Cuba hurricane", "response": ["A novel based on the Cuba hurricane named In hazard was later written by Richard Hughes."]}, {"page": "A High Wind in Jamaica (film)", "response": ["A High Wind in Jamaica is a 1965 DeLuxe Color film, based on the 1929 novel of the same name by Richard Hughes, and directed by Alexander Mackendrick for the 20th Century-Fox studio. It stars Anthony Quinn and James Coburn as the pirates who capture five children. Other cast members include Deborah Baxter, Nigel Davenport, Isabel Dean, Lila Kedrova, Kenneth J. Warren, and Gert Frobe. One of the child actors is the author Martin Amis.", "Reviews were mixed to positive, with some critics expressing disappointment that aspects of the novel were lost in the transition to film. A. H. Weiler of The New York Times wrote, \"Although hands involved are either experienced or willing, a good deal of the nuance, philosophy and insight into the human condition for which the book was lauded, appear to be missing on the screen. This is simply a voyage full of sound and fury but one without much conviction or meaning.\" Richard L. Coe of The Washington Post called it \"an absorbing, unusual and fit-for-the-family film, though it will not satisfy those who treasure the Richard Hughes novel ... By shifting the focus onto the pirate-captain, the film all but buries the role the children play.\" Philip K. Scheuer of the Los Angeles Times wrote, \"it is a good movie, an entertaining movie, but it lacks the dirk-sharp bite of the author's prose, and the antic madness that made it such an astonishing delight now cuts through only fitfully.\"Scheuer, Philip K. (23 May 1965) \"'Rolls' Purrs Smoothly—'Wind' Blows Hot and Cold\". Los Angeles Times. Calendar, p. 17. Variety was generally positive, noting a \"warm screenplay\" and \"often spectacular treatment\" given to the color photography. A review in The Monthly Film Bulletin stated that although Hughes' novel had \"undergone a softening process,\" it was \"surprising how well the film manages to suggest the feeling that the children are living in a world of their own as they play happily throughout their ordeal ... Equally good is the atmosphere of superstitious terror among the native crew, fed by the children's innocent teasing.\""]}, {"page": "Lilly Library", "response": ["* Richard Hughes, author of A High Wind in Jamaica."]}, {"page": "Castle House, Laugharne", "response": ["Until recently Castle House was in the ownership of the Starke family, who had held it since the early 19th century, although it is now the private residence of David Thomas and Abi Thomas, daughter of the local artist David Petersen. The house has long had artistic links, as Richard Hughes wrote In Hazard (1938) while living there, and  Dylan Thomas wrote Portrait of the Artist as a Young Dog (1940) while staying with Hughes.Lloyd, Orbach, and Scourfield (2006). pp. 222–223. Retrieved 29 August 2009."]}, {"page": "Richard Arthur Warren Hughes OBE", "response": ["#REDIRECT Richard Hughes (British writer)"]}, {"page": "Richard Hughes (academic)", "response": ["#REDIRECT Richard Hughes (British writer)"]}, {"page": "Llanfihangel-y-traethau", "response": ["In 1927 and again in 1936 the tide overflowed the sea wall and flooded the farmland around Talsarnau. Many animals were drowned and the railway and buildings were badly damaged. The writer and academic Richard Hughes (1900 - 1976) was church warden, and is buried in the churchyard.", "Many seamen and ship's captains are buried there. Other graves include those of Lewis Holland Thomas, who started as a seafarer and made his fortune as a trader; the author Ann Harriet Hughes (Gwyneth Vaughan, 1852–1910); the diplomat David Ormsby-Gore, 5th Baron Harlech (1918–85); and the author Richard Hughes (1900–76). Hughes spent holidays near Talsarnau as a child and lived near Talsarnau from 1947 until his death. He was churchwarden of Llanfihangel-y-traethau."]}, {"page": "Richard Hughes (writer)", "response": ["#REDIRECT Richard Hughes (British writer)"]}, {"page": "Timescapes: Stories of Time Travel", "response": ["*\"She Caught Hold of the Toe\" (Richard Hughes)"]}, {"page": "Arthur Reade", "response": ["In 1921, Reade joined the Communist Party of Great Britain (CPGB), and he launched The Free Oxford, an influential communist journal. Contributors to Free Oxford included Edward Carpenter, Louis Golding, A. E. Coppard, Edgell Rickword and Richard Hughes. Reade was expelled from the university in December, by the Vice-Chancellor Doctor Lewis Farnell. Farnell objected to Reade's publishing of Free Oxford, and he accused Reade of \"advocating the methods of the Red Terror.\"Don Chapman, Oxford Playhouse: High and Low Drama in a University City.Hatfield, University of Hertfordshire Press, 2008 , (p.34) Reade received widespread sympathy in the press, but was not readmitted, and focused on journalism, especially for the Workers' Weekly and Labour Monthly, working closely with Rajani Palme Dutt.  In 1924, he became business manager of the Labour Monthly, and also served on the London District Committee of the CPGB."]}, {"page": "List of Jackanory episodes", "response": ["|51|| The Spider's Palace || Richard Hughes || Gordon Rollings || 21-Feb-66", "|52|| The Dark Child || Richard Hughes || Gordon Rollings || 22-Feb-66", "|53|| Living in W'ales || Richard Hughes || Gordon Rollings || 23-Feb-66", "|54|| The Magic Glass || Richard Hughes || Gordon Rollings || 24-Feb-66", "|55|| The Invitation || Richard Hughes || Gordon Rollings || 25-Feb-66", "|333|| The Spider's Palace || Richard Hughes || Bernard Cribbins || 29-May-67", "|334|| The Dark Child || Richard Hughes || Bernard Cribbins || 30-May-67", "|335|| Living in W'ales || Richard Hughes || Bernard Cribbins || 31-May-67", "|336|| The Magic Glass || Richard Hughes || Bernard Cribbins || 01-Jun-67", "|337|| The Invitation || Richard Hughes || Bernard Cribbins || 02-Jun-67"]}, {"page": "Dinah Hinz", "response": ["* 1962: Richard Hughes: Gefahr – directed by Fritz Schröder-Jahn (Original-Hörspiel – NDR)"]}]}}