{"wiki_id": "http://www.wikidata.org/entity/Q3023093", "itemLabel": "Denise Riley", "itemDescription": "English poet and philosopher", "wikipedia_url": "https://en.wikipedia.org/wiki/Denise_Riley", "wikipedia_page": {"main": "Denise Riley (born 1948, Carlisle) is an English poet and philosopher.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Denise Riley (born 1948, E)"]}, {"page": "English poetry", "response": ["The British Poetry Revival was a wide-reaching collection of groupings and subgroupings that embraces performance, sound and concrete poetry as well as the legacy of Pound, Jones, MacDiarmid, Loy and Bunting, the Objectivist poets, the Beats and the Black Mountain poets, among others. Leading poets associated with this movement include J. H. Prynne, Eric Mottram, Tom Raworth, Denise Riley and Lee Harwood.", "There has been recent activity focused on poets in Bloodaxe Books' The New Poetry, including Simon Armitage, Kathleen Jamie, Glyn Maxwell, Selima Hill, Maggie Hannan, Michael Hofmann and Peter Reading. The New Generation movement flowered in the 1990s and early 2000s, producing poets such as Don Paterson, Julia Copus, John Stammers, Jacob Polley, David Morley and Alice Oswald.  A new generation of innovative poets has also sprung up in the wake of the Revival grouping, notably Caroline Bergvall, Tony Lopez, Allen Fisher and Denise Riley.Don Paterson, \"The Dark Art of Poetry\": T.S. Eliot Lecture, 9 November 2004: \"Geniune talents such as, say, Tony Lopez and Denise Riley, working recognisably within the English and European lyric traditions, are drowned by the chorus of articulate but fundamentally talentless poet-commentators\". Major independent and experimental poetry pamphlet publishers include Barque, Flarestack, Knives, Forks and Spoons Press, Penned in the Margins, Heaventree (founded in 2002 but no longer publishing) and Perdika Press.British Poetry Magazines 1914-2000: A History and Bibliography of \"Little Magazines\", David Miller and Richard Price (British Library UK & Oak Knoll Press USA, 2006). Throughout this period, publishing initiatives such as Salt Publishing and Shearsman Books promoted poetic diversity, while independent poetry presses such as Cinnamon press and Enitharmon Press have made available original work from (among others) Dannie Abse, Martyn Crucefix, Jane Duran, U. A. Fanthorpe, Mario Petrucci and Kathleen Raine."]}, {"page": "Griffin Poetry Prize", "response": ["*Denise Riley, Say Something Back"]}, {"page": "British literature", "response": ["In the 1960s and 1970s Martian poetry aimed to break the grip of 'the familiar', by describing ordinary things in unfamiliar ways, as though, for example, through the eyes of a Martian. Poets most closely associated with it are Craig Raine and Christopher Reid. Martin Amis, an important novelist in the late twentieth and twentieth centuries, carried into fiction this drive to make the familiar strange.The poet James Fenton was the first to use the term in an article entitled 'Of the Martian School', New Statesman, 20 October 1978, p.520. Another literary movement in this period was the British Poetry Revival, a wide-reaching collection of groupings and subgroupings that embraces performance, sound and concrete poetry. Leading poets associated with this movement include J. H. Prynne, Eric Mottram, Tom Raworth, Denise Riley and Lee Harwood. It reacted to the more conservative group called \"The Movement\"."]}, {"page": "British Poetry Revival", "response": ["\"The British Poetry Revival\" is the general name given to a loose poetry movement in Britain that took place in the 1960s and 1970s. The revival was a modernist-inspired reaction to the Movement's more conservative approach to British poetry. The poets included an older generation - Bob Cobbing, Paula Claire, Tom Raworth, Eric Mottram, Jeff Nuttall, Andrew Crozier, Lee Harwood, Allen Fisher, Iain Sinclair—and a younger generation: Paul Buck, Bill Griffiths, John Hall, John James, Gilbert Adair, Lawrence Upton, Peter Finch, Ulli Freer, Ken Edwards, Robert Gavin Hampson, Gavin Selerie, Frances Presley, Elaine Randell, Robert Sheppard, Adrian Clarke, Clive Fencott, Maggie O'Sullivan, Cris Cheek, Tony Lopez and Denise Riley.Eric Mottram, 'The British Poetry Revival', Robert Hampson & Peter Barry (eds), New British poetries: The scope of the possible (Manchester University Press, 1993).", "Thanks in no small part to Cobbing's Writers Forum and its associated writers' workshop, London was a hub for many young poets, including Bill Griffiths, Paula Claire, Allen Fisher, Iain Sinclair, Gilbert Adair, Lawrence Upton, Peter Finch, Ulli Freer, Gavin Selerie, Frances Presley, Elaine Randell, Robert Sheppard, Adrian Clarke, Clive Fencott, Maggie O'Sullivan, cris cheek, Tony Lopez and Denise Riley. Some sense of the atmosphere of this period is provided by the series of reminiscences included in CLASP: late modernist poetry in London (Shearsman, 2016), edited by Robert Hampson and Ken Edwards,Robert Hampson & Ken Edwards (eds), CLASP: late modernist poetry in London (Shearsman, 2016) and in Ken Edwards's memoir, Wild Metrics.Ken Edwards, Wild Metrics (Grand Iota, 2019).", "A number of younger poets, many of whom who first found an outlet in Poetry Review under Mottram, began to emerge around the end of the 1970s. In London, Bill Griffiths, Ulli Freer, cris cheek, Lawrence Upton, Robert Gavin Hampson, Robert Sheppard, and Ken Edwards were among those who were to the fore. These, and others, met regularly at Gilbert Adair's Subvoicive reading series, which also regularly featured poets from North America, as well as visiting poets such as Caroline Bergvall, Paul Buck, Andrew Duncan, D. S. Marriott, Maggie O'Sullivan and Denise Riley. Edwards ran Reality Studios, a magazine that grew out of Alembic (UK poetry magazine), the magazine he had co-edited through the 1970s with Peter Barry and Robert Hampson. Through Reality Studios, he helped introduce the L=A=N=G=U=A=G=E poets to a British readership. He also ran Reality Street Editions with Cambridge-based Wendy Mulford, which continued to be a major publisher of contemporary poetry until 2018 and an important bridge between US and UK poetries. The London-based Angel Exhaust magazine brought many of the younger poets together - in particular, Adrian Clarke, Robert Sheppard and Andrew Duncan. In the Midlands, Tony Baker's Figs magazine focused more on the Objectivist and Bunting-inspired poetry of the Northumbrian school while introducing a number of new poets."]}, {"page": "Royal Society of Literature", "response": ["| Denise Riley"]}, {"page": "Other: British and Irish Poetry since 1970", "response": ["John Agard - Tony Baker - Anthony Barnett  - Richard Caddel - Cris Cheek - Thomas A. Clark - Bob Cobbing- Brian Coffey - Kelvin Corcoran - Andrew Crozier - Fred D'Aguiar - Ken Edwards - Peter Finch - Allen Fisher - Roy Fisher - Veronica Forrest-Thomson - Ulli Freer - Harry Gilonis - Jonathan Griffin - Bill Griffiths - Alan Halsey - Lee Harwood - Michael Haslam - Randolph Healy - John James - Amryl Johnson - Linton Kwesi Johnson - Tom Leonard - Tony Lopez - Rob MacKenzie - Barry MacSweeney - Billy Mills - Geraldine Monk - Eric Mottram - Wendy Mulford - Grace Nichols -Douglas Oliver - Maggie O'Sullivan - Tom Pickard - Elaine Randell - Tom Raworth - Carlyle Reedy - Denise Riley - John Riley - Peter Riley - Maurice Scully - John Seed - Gavin Selerie - Robert Sheppard - Colin Simms - Iain Sinclair - Chris Torrance - Gael Turnbull - Catherine Walsh - Benjamin Zephaniah"]}, {"page": "Anthology of Twentieth-Century British and Irish Poetry", "response": ["* Denise Riley"]}, {"page": "Penguin Modern Poets", "response": ["#Douglas Oliver, Denise Riley, Iain Sinclair", "#Maggie Nelson, Denise Riley, Claudia Rankine (Die Deeper into Life, 2017)"]}, {"page": "T. S. Eliot Prize", "response": ["* Say Something Back by Denise Riley"]}, {"page": "Forward Prizes for Poetry", "response": ["* 2012: Denise Riley, \"A Part Song\""]}, {"page": "Cholmondeley Award", "response": ["* Denise Riley"]}, {"page": "List of philosophers born in the 20th century", "response": ["* Denise Riley (born 1948)"]}, {"page": "John Kerrigan (literary scholar)", "response": ["Over the last couple of decades John Kerrigan has published numerous essays on contemporary poetry, including Seamus Heaney, Roy Fisher, Geoffrey Hill, Denise Riley, Eiléan Ní Chuilleanáin and Paul Muldoon.  "]}, {"page": "1948 in poetry", "response": ["** Denise Riley, English poet"]}, {"page": "Riley (surname)", "response": ["*Denise Riley (born 1948), English professor"]}, {"page": "Veronica Forrest-Thomson", "response": ["She studied at the University of Liverpool (BA, 1967) and Girton College, Cambridge (PhD, 1971) where her first supervisor was the poet J. H. Prynne.The Biographical Dictionary of Scottish Women, Elizabeth L. Ewan et al, 2006, Edinburgh University Press, p. 125. Her Cambridge friends included the poets Wendy Mulford and Denise Riley.Virginia Blane, Patricia Clements and Isobel Grundy, eds, The Feminist Companion to Literature in English (London: Batsford, 1990), p. 387, "]}, {"page": "John Muckle", "response": ["Muckle has published further novels, poetry collections and a critical work on British fiction in the 1950s and 1960s, also essays and reviews on poetry and poets, including Allen Ginsberg, Ed Dorn, Bill Griffiths, Tom Raworth, Denise Riley and Lee Harwood."]}, {"page": "List of philosophers of language", "response": ["* Denise Riley"]}, {"page": "Wendy Mulford", "response": ["* No Fee (with Denise Riley; 1979)", "* Some Poems 1968-1978 (with Denise Riley; 1982)"]}, {"page": "2012 in poetry", "response": ["**Best Poem: Denise Riley, \"A Part Song\""]}, {"page": "Ted Hughes Award", "response": ["The 2012 award, selected by judges Cornelia Parker, Ian Duhig and Maura Dooley, went to Kate Tempest for her work Brand New Ancients.\"Kate Tempest wins Ted Hughes poetry prize for 'spoken story'\", Guardian, 27 March 2013 Shortlisted were Colette Bryce, Roy Fisher, Ruth Padel, Mario Petrucci, Denise Riley and Tamar Yoseloff.Poetry Society 2013 Award detail "]}, {"page": "2014 in poetry", "response": ["* Cholmondeley Award: W. N. Herbert, Jeremy Hooker, John James, Glyn Maxwell, Denise Riley"]}, {"page": "2016 in poetry", "response": ["*Denise Riley, Say Something Back", "** Shortlist: Melissa Lee-Houghton, Sunshine; Alice Oswald, Falling Awake; Denise Riley, Say Something Back; Kate Tempest, Let Them Eat Chaos"]}, {"page": "Twentieth-century English literature", "response": ["Another literary movement in this period was the British Poetry Revival, a wide-reaching collection of groupings and subgroupings which embraces performance, sound and concrete poetry. Leading poets associated with this movement include J. H. Prynne, Eric Mottram, Tom Raworth, Denise Riley and Lee Harwood. The Mersey Beat poets were Adrian Henri, Brian Patten and Roger McGough. Their work was a self-conscious attempt at creating an English equivalent to the Beats. Many of their poems were written in protest against the established social order and, particularly, the threat of nuclear war. "]}, {"page": "List of Somerville College, Oxford, people", "response": ["*Denise Riley (1948), poet and philosopher; winner of the Forward Poetry Prize"]}, {"page": "Decline in insect populations", "response": ["In April 2019, in response to the studies about insect decline, Carol Ann Duffy released several poems, by herself and others, to mark the end of her tenure as Britain's poet laureate and to coincide with protests that month by the environmentalist movement Extinction Rebellion. The poets included Fiona Benson, Imtiaz Dharker, Matthew Hollis, Michael Longley, Daljit Nagra, Alice Oswald, and Denise Riley. Duffy's contribution was \"The Human Bee\"."]}, {"page": "Max Porter (writer)", "response": ["*Introduction to Time Lived, Without Its Flow by Denise Riley (Picador, 2019)"]}]}}