{"wiki_id": "http://www.wikidata.org/entity/Q302763", "itemLabel": "Angela Eagle", "itemDescription": "British politician; Labour MP for Wallasey (born 1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Angela_Eagle", "wikipedia_page": {"main": "Dame Angela Eagle DBE (born 17 February 1961) is a British Labour Party politician serving as the Member of Parliament (MP) for Wallasey since 1992. Eagle was born in Yorkshire and studied PPE at the University of Oxford, before working for the CBI and then a trade union.\nEagle served as the Minister of State for Pensions and Ageing Society from June 2009 until May 2010. Eagle was elected to the Shadow Cabinet in October 2010 and was appointed by Ed Miliband to be Shadow Chief Secretary to the Treasury.In October 2011, she was appointed Shadow Leader of the House of Commons when Miliband reshuffled his Shadow Cabinet. She was appointed as both Shadow First Secretary of State and Shadow Secretary of State for Business, Innovation and Skills in September 2015 in Jeremy Corbyn's first Shadow Cabinet. She resigned from the Shadow Cabinet in June 2016. Eagle announced a leadership challenge to Labour Party leader Jeremy Corbyn on 11 July 2016, but eight days later she withdrew leaving Owen Smith to challenge Corbyn for the leadership. Eagle is the twin sister of fellow Labour MP Maria Eagle.", "link_mentions": [{"page": "February 17", "response": ["*1961 – Angela Eagle, English politician, Shadow Leader of the House of Commons"]}, {"page": "Politics of the United Kingdom", "response": ["In addition, the EU referendum campaign plunged the Labour Party into crisis and resulted in a motion of no confidence in the party leader Jeremy Corbyn being passed by the party's MPs in a 172–40 vote, which followed a significant number of resignations from the Shadow Cabinet. This led to a leadership election which began with Angela Eagle, the former Shadow First Secretary of State and Shadow Secretary of State for Business, Innovation and Skills who eight days later withdrew from the leadership race, to support Owen Smith, the former Shadow Secretary of State for Work and Pensions. This was won by Jeremy Corbyn with an increased majority."]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Angela Eagle", "| Angela Eagle"]}, {"page": "1992 United Kingdom general election", "response": ["|Angela Eagle"]}, {"page": "Leasowe", "response": ["Leasowe is part of the Wallasey parliamentary constituency and represented by Angela Eagle MP."]}, {"page": "Prime Minister's Questions", "response": ["During the Cameron–Clegg coalition, Nick Clegg answered 15 PMQs and William Hague twice, all opposite Harriet Harman. During the Second Cameron ministry, George Osborne answered three times, opposite Angela Eagle. In the Second May ministry, Damian Green replied twice, opposite Emily Thornberry, while David Lidington did so six times, opposite Thornberry and Rebecca Long-Bailey. On 2 October 2019, Diane Abbott became the first Black MP to stand for PMQS and ask the six main questions when she challenged the Foreign Secretary, Dominic Raab, in his capacity as First Secretary of State."]}, {"page": "National Secular Society", "response": ["*Angela Eagle MP"]}, {"page": "Metropolitan Borough of Wirral", "response": ["| Angela Eagle"]}, {"page": "Hilary Benn", "response": ["In September 2016, Benn announced his intention to stand for chairman of the new Exiting the European Union Select Committee, a House of Commons select committee. He stated that his intention was to \"get the best deal for the British people\". His bid was supported by former Labour leader Ed Miliband, as well as other senior Labour Party figures including Angela Eagle, Dan Jarvis, and Andy Burnham. His opponent in the bid was Kate Hoey, a fellow Labour MP and a Leave vote supporter. The result, announced on 19 October, was 330 votes to Benn, and 209 to Hoey, so Benn became the new chairman."]}, {"page": "Formby", "response": ["*Angela Eagle, Labour MP and former minister"]}, {"page": "National Executive Committee of the Labour Party", "response": ["*Angela Eagle MP"]}, {"page": "Bridlington", "response": ["*Angela Eagle and her twin sister Maria Eagle, both Labour politicians, were born in the town on 17 February 1961."]}, {"page": "Alistair Darling", "response": ["On 28 June 2007, the new Prime Minister Gordon Brown appointed Darling Chancellor of the Exchequer, a promotion widely anticipated in the media. Journalists observed that three of Darling's four junior ministers at the Treasury (Angela Eagle, Jane Kennedy and Kitty Ussher) were female and dubbed his team, \"Darling's Darlings\"."]}, {"page": "Jeremy Corbyn", "response": ["On 13 September 2015, Corbyn unveiled his Shadow Cabinet. He appointed his leadership campaign manager and long-standing political ally John McDonnell as Shadow Chancellor, leadership opponent Andy Burnham as Shadow Home Secretary, and Angela Eagle as Shadow First Secretary of State to deputise for him in the House of Commons. Corbyn promoted a number of female backbench MPs to Shadow Cabinet roles, including Diane Abbott, Heidi Alexander and Lisa Nandy, making his the first Shadow Cabinet with more women than men, although the most senior roles went to men. In October 2015, Corbyn appointed the Guardian journalist Seumas Milne as the Labour Party's Executive Director of Strategy and Communications.", "The division between Corbyn and the Labour parliamentary party continued. On 11 July 2016, Angela Eagle, who had recently resigned from his Shadow Cabinet, formally launched her leadership campaign.", "After news reports that Eagle's office had been vandalised, and threats and abuse to other MPs, including death threats to himself, Corbyn said: \"It is extremely concerning that Angela Eagle has been the victim of a threatening act\" and called for \"respect and dignity, even where there is disagreement.\"", "On 13 July, Owen Smith entered the Labour Party leadership race. Subsequently, on 19 July, Angela Eagle withdrew and offered her endorsement to Smith."]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Angela Eagle"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Angela Eagle"]}, {"page": "Maria Eagle", "response": ["The twin sister of Angela Eagle, also a Labour MP, Eagle was born in the East Riding of Yorkshire to a working-class family and raised in Merseyside. She studied Philosophy, Politics and Economics at Pembroke College, Oxford and read Law at the College of Law, London. After graduating with her law degree, she worked as an articled clerk and solicitor in both London and Liverpool. After unsuccessfully contesting Crosby in 1992, she was elected for the Liverpool Garston constituency at the 1997 general election. "]}, {"page": "List of political families in the United Kingdom", "response": ["*Angela Eagle (1961–), Labour MP."]}]}}