{"wiki_id": "http://www.wikidata.org/entity/Q3021324", "itemLabel": "Deirdre Le Faye", "itemDescription": "English writer, literary critic, scholar and expert on Jane Austen (1933-2020)", "wikipedia_url": "https://en.wikipedia.org/wiki/Deirdre_Le_Faye", "wikipedia_page": {"main": "Deirdre Le Faye (26 October 1933 – 16 August 2020) was an English writer and literary critic. She was born in Bournemouth and raised in Farnborough and Reading, during the bombing raids of the Second World War. After her father died of illness, she left school at 16 and began a secretarial course as a scholarship student. She began work as an administrative assistant for the Department of Medieval & Later Antiquities at the British Museum.It was while working there that she began to join archaeological digs on weekends and holidays, as a way to take inexpensive vacations. She became a member of the Camden History Society and began to research graves and inscriptions. An interest in Jane Austen was rekindled, which led to her making contact with Austen family descendants living near Winchester. Using papers in the attic of these Austen-Leigh heirs, over the course of five years of weekends, while working full time at the British Museum, she updated and rewrote Jane Austen: A Family Record (1989). It was expanded, revised, and republished as A Family Record (2003), a factual biography of Austen.\nShe updated R. W. Chapman's published collection of Jane Austen's letters twice, in 1995 and 2011. She completed the massive A Chronology of Jane Austen and her Family, 1600-2000, as well as a cookbook, an edition of Austen's cousin's letters (Jane Austen’s ‘Outlandish Cousin’:  the Life and Letters of Eliza de Feuillide), for a total of 12 monographs and edited books. She also published more than 90 articles between 1975 and 2020, many of them in The Jane Austen Society Report and Notes and Queries. She was a recipient of the Royal Society of Literature's Benson Medal in 2014. She was a member of the editorial board for Cambridge University Press's eight-volume edition of Jane Austen's novels and other manuscripts, 2005–8. She received an honorary DLitt from Southampton University in 2011.\nLe Faye died on 16 August 2020, at the age of 86.", "link_mentions": [{"page": "Benson Medal", "response": ["*Deirdre Le Faye"]}, {"page": "Mr William Collins", "response": ["In another analysis, Deirdre Le Faye wrote \"what does make Mr Collins a figure of fun and rightful mockery is his lack of sense, of taste, and of generosity of spirit contrasted to his own supreme unawareness of his shortcomings in these respects\".  He has also been criticized for taking such a casual view of his own marriage, which is one of the primary concerns of the Church.Reeta Sahney, Jane Austen's heroes and other male characters, Abhinav Publications, 1990  p.76"]}, {"page": "George Wickham", "response": ["Wickham profits from the sympathy enjoyed in the city by Colonel Forster and his regiment choosing Meryton as its winter quarters. It is one of the local militias raised to reinforce the army against the threat of French invasion. The presence of officers, generally young people from good families, disrupts the routine of local social life: they participate in community life, inviting gentlemen to the mess, and being invited themselves to balls, evening socials, and receptions. As some came with their spouses, teas and visits between women increased the occasions for marriageable young ladies to meet these dashing idle officers in red coats. England was at war, the population feared an invasion, the army was recruiting and the prestige of the regimental uniform was therefore total.Deirdre Le Faye 2002, p. 153 It was possible for a new militia officer to make a fresh start in life, as Wickham's rank could be obtained without having to live in the local area. In addition, according to the Cambridge Chronicle of 3 January 1795, the Derbyshire Militia, which Deidre Le Faye suggests inspired Jane Austen, was very well behaved in the two towns of Hertfordshire where it was stationed, as well as in church.Deirdre Le Faye 2003, p. 189", "* Deirdre Le Faye, Jane Austen: The World of Her Novels, London, Frances Lincolv, 2003 ", "* Deirdre Le Faye, Jane Austen's outlandish cousin: the life and letters of Eliza de Feuillide, British Library, 2002, 192 p. "]}, {"page": "Anna Austen Lefroy", "response": ["Known in family tradition as a naughty child,R A Austen-Leigh, Jane Austen: A Family Record (London 1989) p. 161-2 Anna became a lively, outgoing and changeable adolescent - \"quite an Anna with variations\" as her Aunt put it (startled by the unexpected cropping of her niece's hair).Deirdre Le Faye ed., Jane Austen's Letters (Oxford 1995) p. 184 (and p. 170)", "At the age of twenty, Anna became engaged to a family connection, Benjamin Lefroy, and despite family opposition the pair were married in 1814.Deirdre Le Faye ed., Jane Austen's Letters (Oxford 1995) p. 425 and p. 546 The marriage seems to have been a successful one, and by 1817 the pair had two young daughters, and Anna was apparently expecting again: \"Poor Animal, she will be worn out before she is thirty\", wrote her Aunt.Deirdre Le Faye ed., Jane Austen's Letters (Oxford 1995) p. 336 and p. 327  The couple had seven children in all, before Anna lost her husband in 1829.Deirdre Le Faye ed., Jane Austen's Letters (Oxford 1995) p. 546", "Niece and aunt had bonded over a love of 'bad' romantic fiction, such as that by Rachel Hunter; and when during her engagement Anna began writing a novel - known as Enthusiasm or Which is the Heroine? - it was natural for her to share it with her aunt.Deirdre Le Faye ed., Jane Austen's Letters (Oxford 1995) p.443 and p. 267"]}, {"page": "2020 in the United Kingdom", "response": ["**Deirdre Le Faye, 86, English writer and biographer (Jane Austen)."]}, {"page": "Deaths in August 2020", "response": ["*Deirdre Le Faye, 86, English writer and biographer (Jane Austen).Deirdre Le Faye obituary"]}]}}