{"wiki_id": "http://www.wikidata.org/entity/Q3034864", "itemLabel": "Dominic Noonan", "itemDescription": "British mobster", "wikipedia_url": "https://en.wikipedia.org/wiki/Dominic_Noonan", "wikipedia_page": {"main": "Domenyk Lattlay-Fottfoy (born  Dominic James Noonan, 13 June 1964) is an English gangster and sex offender. With his brother Desmond \"Dessie\" Noonan, he headed a criminal organisation or \"crime firm\" in Manchester, England during the 1980s and 1990s and is a member of one of Manchester's most infamous crime families.Noonan has more than 40 convictions for a wide range of offences including armed robbery, police assault, possession of firearms, prison escape, and fraud, and as of 2013 had spent 22 years in prisons across Britain. His most recent conviction was for indecent assault and attempted rape.\n\n", "link_mentions": [{"page": "Alabama 3", "response": ["* A snippet of \"Bulletproof\" appears in A Very British Gangster (2007), Donal MacIntyre's documentary film about Manchester crime boss Dominic Noonan."]}, {"page": "List of gangsters by city", "response": ["*Dominic Noonan (born 1964)"]}, {"page": "Noonan", "response": ["*Desmond Noonan (1951–2005) and Dominic Noonan (born 1966), former Manchester mobsters"]}, {"page": "HM Prison Frankland", "response": ["* Dominic Noonan"]}, {"page": "List of British gangsters", "response": ["|Dominic Noonan"]}, {"page": "Donal MacIntyre", "response": ["The resulting production became a film with the title A Very British Gangster which centred on the life of Manchester-based gangster and hit man Dominic Noonan, whose brother Desmond Noonan was stabbed to death during filming."]}, {"page": "Desmond Noonan", "response": ["Desmond Patrick \"Dessy\" Noonan (8 August 1959 – 19 March 2005) was an English organised crime figure from Manchester, who acted as a political fixer for the Noonan crime family. He and his younger brother, Dominic Noonan, were suspected by police of being responsible for at least 25 murders during their 20-year reign over Manchester's underworld.", "Born in Whalley Range, Manchester into an Irish family, Noonan emerged from poverty and into the criminal scene with his brothers Damian and Dominic Noonan. His criminal career began as a doorman in the early 1980s; his reputation as a fighter and his overall appearance gave him credibility on the club doors of Manchester.", "Noonan then started to put his own men on the doors. By the late 1980s, 80% of the Manchester nightlife security was said to be controlled by the Noonan family. Around this time, Dominic Noonan was jailed for 15 years for his part in an armed robbery at a bank in Cheetham Hill, Manchester. During his imprisonment, still in control of the crime family, Damian and Desmond Noonan were forging links with other notable Manchester gangs including the Cheetham Hill and Salford gangs."]}, {"page": "Lattlay Fottfoy", "response": ["#REDIRECT Dominic Noonan"]}, {"page": "1990 Strangeways Prison riot", "response": ["Prisoners felt their complaints about conditions were being ignored.Carrabine, p. 135. Remand prisoners were only allowed out of their cells for 18 hours per week, and Category A prisoners were locked in their cells for 22 hours a day, and rarely left their cells except for \"slopping out\", a one-hour exercise period each day or a weekly shower.Jameson & Allison, p. 35. In March 1990, Dominic Noonan was transferred from Strangeways to HM Prison Hull.Jameson & Allison, p. 29–32. Noonan was the organiser of the Prisoners' League Association (PLA), an organisation formed in 1989 which campaigned for prisoners' rights. Its aims included initiating legal proceedings against prison staff for mistreatment of prisoners, and picketing outside prisons in which prisoners were mistreated. The PLA were active at Strangeways Prison, and Noonan's transfer demonstrates prison officers were aware of rising tensions inside the prison."]}, {"page": "A Very British Gangster", "response": ["#redirect Dominic Noonan"]}, {"page": "Domenyk Noonan", "response": ["#REDIRECT Dominic Noonan"]}, {"page": "Domenyk Lattlay-Fottfoy", "response": ["#REDIRECT Dominic Noonan"]}]}}