{"wiki_id": "http://www.wikidata.org/entity/Q3038426", "itemLabel": "Liz Shaw", "itemDescription": "fictional character in the TV series Doctor Who", "wikipedia_url": "https://en.wikipedia.org/wiki/Liz_Shaw", "wikipedia_page": {"main": "Elizabeth \"Liz\" Shaw is a fictional character played by Caroline John in the long-running British science fiction television series Doctor Who and its spin-offs.  A civilian member of UNIT, an international organisation that defends Earth from alien threats, she was the  companion of the Third Doctor for the 1970 season. Liz appeared in 4 stories (25 episodes).", "link_mentions": [{"page": "Sonic screwdriver", "response": ["*The Doctor has used other sonic devices similar to the sonic screwdriver, including the \"door handle\" of Inferno (Liz Shaw having one of her own) and a pen-sized white noise generator in Four to Doomsday."]}, {"page": "Bill & Ben Video", "response": ["The Zero Imperative (1994) marked a new departure for BBV. Although stuffed to the gills with ex-Doctor Who guest stars, only one of them was actually playing the same character: the story was built around Caroline John's Liz Shaw, the Doctor's companion in the seventh season of Doctor Who, now depicted as an investigator for PROBE (the \"Preternatural Research Bureau\"). The PROBE series ran for an additional three stories; all four were written by Mark Gatiss, who found more widespread fame as a member of the League of Gentlemen, later going on to write episodes for the revived series. The potentially-confusing mixture of Caroline John reprising her Doctor Who role with other recognisable Who stars playing different characters worked against the series, as did the way that Liz Shaw often seemed to be herself a different character from the Doctor Who original. (The latter problem may have been exacerbated by the fact that, although BBV had obtained permission to use Liz Shaw, they had no rights relating to Doctor Who itself - which meant that no explicit reference could be made to any other aspect of Doctor Who, including the events of the stories in which Liz had appeared.)", "A new PROBE film was released 15 April 2015 with Hazel Burrows taking over from Caroline John as Liz Shaw."]}, {"page": "Remembrance of the Daleks", "response": ["Remembrance of the Daleks, the first story in Doctor Who twenty-fifth anniversary season, contains many intentional references to the series' past, something Aaronovitch felt was fun. The story is set in the same time and place as the programme's first episode, \"An Unearthly Child\", where Coal Hill School employed original companions Ian and Barbara and the Doctor's granddaughter Susan was enrolled. The Totter's Lane junkyard also reappears, as it had in season 22's Attack of the Cybermen, though \"I.M. Foreman\" is misspelled \"I.M. Forman\". It originally read \"L.M.\", though that was changeable in production. In one of the classrooms, Ace picks up a book on the French Revolution just as Susan had in \"An Unearthly Child\"; Aldred studied the original to try to mimic Carole Ann Ford's stature. The Doctor references the events of The Dalek Invasion of Earth (1964), Genesis of the Daleks (1975), Terror of the Zygons (1975), and The Web of Fear (1968), as well as likening a device to something he used in Planet of the Daleks (1973). The Doctor mistakenly calls Captain Gilmore \"Brigadier\", a reference to the character Brigadier Lethbridge-Stewart, who headed UNIT, an organization similar to Gilmore's. Rachel, a scientific advisor from Cambridge, is similar to Liz Shaw, and she shares a conversation with Gilmore that is reminiscent of a conversation between the Brigadier and Liz in Spearhead from Space (1970). Rachel also bears a physical resemblance to Barbara. Remembrance of the Daleks is also notable for containing a meta-reference; a television continuity announcer says, \"This is BBC television, the time is quarter past five and Saturday viewing continues with an adventure in the new science fiction series Doc—\", but is cut off by a scene change before completing the title. Aaronovitch \"couldn't resist\" the reference, and clarified that it was meant as a joke and was not to be taken seriously. Originally, it was intended that the show that was introduced would be called Professor X. In addition, Alison and Rachel make mention of a \"Bernard\" from the \"British Rocket Group\". This is a reference to Bernard Quatermass and his British Experimental Rocket Group, of the Nigel Kneale-penned Quatermass science-fiction television serials."]}, {"page": "Dimensions in Time", "response": ["In 1993, after the Fifth Doctor changed to the Third Doctor in the next time jump, with Liz Shaw, the Rani took control of Liz's mind. As Mandy Salter tries to stop the Rani, Captain Mike Yates of UNIT comes in Bessie to save the Third Doctor and get him to The Brigadier who is waiting for them.", "*This is the last appearance on television of Caroline John as Liz Shaw (John died in 2012) and Deborah Watling as Victoria Waterfield (Watling died in 2017)."]}, {"page": "Brigadier Lethbridge-Stewart", "response": ["*The Blue Tooth (adventure related by the character Liz Shaw)", "*Shadow of the Past (adventure related by the character Liz Shaw)", "*The Last Post (adventure related by the character Liz Shaw)"]}, {"page": "Spearhead from Space", "response": ["In the serial, which is set in Essex and London, the alien time traveller the Third Doctor (Jon Pertwee), now exiled to Earth by the Time Lords, joins Brigadier Lethbridge-Stewart (Nicholas Courtney) of UNIT and the scientist Liz Shaw (Caroline John) to stop the incorporeal intelligence the Nestenes from colonising the planet through their use of the Autons, plastic killers which act as human duplicates and shop-window mannequins."]}, {"page": "List of fictional doctors", "response": ["|Doctor Who&Torchwood || The Doctor - First DoctorSecond DoctorThird DoctorFourth DoctorFifth DoctorSixth DoctorSeventh DoctorEighth DoctorWar DoctorNinth DoctorTenth DoctorEleventh DoctorTwelfth DoctorThirteenth DoctorFugitive DoctorDr. Harry SullivanDr. Liz ShawDr. Grace HollowayDr. Owen HarperDr. Martha JonesDr. Toshiko SatoDr. River Song || William HartnellPatrick TroughtonJon PertweeTom BakerPeter DavisonColin BakerSylvester McCoyPaul McGannJohn HurtChristopher EcclestonDavid TennantMatt SmithPeter CapaldiJodie WhittakerJo MartinIan MarterCaroline JohnDaphne AshbrookBurn GormanFreema AgyemanNaoko MoriAlex Kingston"]}, {"page": "Virgin New Adventures", "response": ["|19 || Blood Heat ||Jim Mortimore || Ace, Bernice, Silurians, Brigadier Lethbridge-Stewart, Liz Shaw, John Benton, Jo Grant || October 1993", "|58 || Eternity Weeps ||Jim Mortimore || Chris, Bernice, Jason, Liz Shaw || January 1997", ":While recovering from Roz's death in 1958 London, the Doctor and Chris encounter Moriah, an alien king who has been creating artificial life-forms in an effort to bring back his dead wife, and the Doctor's former companion Peri, who has been trapped in a loveless marriage to King Yrcanos since she and the Doctor parted.Bad Therapy In 2003, when Benny and Jason join two archaeological teams searching for Noah's Ark, a ruthless Iranian soldier accidentally causes a deadly biological agent to be released in the Earth's atmosphere, killing hundreds of millions, including Liz Shaw. Benny and Jason agree to divorce.Eternity Weeps"]}, {"page": "Terror of the Autons", "response": ["For the new season, producer Barry Letts and script editor Terrance Dicks wanted to add new characters. They thought about how the Brigadier was like Dr. Watson to the Doctor's Sherlock Holmes, and decided to devise a new character, the Master, to emulate Moriarty. The Master was meant to specifically contrast with Pertwee's Doctor; the Doctor was authoritative while the Master was charming, though he used that for an evil purpose. Terror of the Autons also introduced Katy Manning as Jo Grant (as a replacement for departed companion Liz Shaw), and Richard Franklin as Captain Mike Yates."]}, {"page": "Doctor Who and the Silurians", "response": ["A nuclear powered cyclotron facility in some caves under a moorland is experiencing mysterious power drains and mental breakdowns amongst staff. The Third Doctor and Liz Shaw meet Brigadier Lethbridge-Stewart there to investigate. A worker who was potholing in the caves is found dead with giant claw marks on his body, and his companion has been traumatised. Lawrence, the Director, resents UNIT's presence and feels that it will interfere with the working of the plant. Major Baker, the security chief, believes there is a saboteur in the centre, and the Doctor discovers that the logs of the nuclear reactor's operation have been tampered with. When the Doctor makes his way into the caves, he is attacked by a dinosaur-like creature before it is called off by a strange whistling sound."]}, {"page": "Inferno (Doctor Who)", "response": ["Inferno is the fourth and final serial of the seventh season of the British science fiction television series Doctor Who, which was first broadcast in seven weekly parts on BBC1 from 9 May to 20 June 1970. The serial remains the last time a Doctor Who story was transmitted in seven episodes. This serial was also the last regular appearance of Caroline John in the role of Liz Shaw."]}, {"page": "Doctor Who spin-offs", "response": ["Companies who have released videos of this kind include Reeltime Pictures (also known for the long-running Myth Makers series of documentaries) and BBV (who have also released a number of Doctor Who-related audio adventures on the same basis). The first spinoff of this nature was Wartime, a half-hour film produced by Reeltime in the late 1980s and starring John Levene as Benton, a UNIT soldier who appeared on Doctor Who in the early to mid-1970s. In the 1990s, Reeltime distributed P.R.O.B.E., a series of four made-for-video movies featuring Caroline John as her Pertwee-era character Liz Shaw. BBV, on their part, produced and released a trilogy of movies, Auton, Auton 2: Sentinel and Auton 3: Awakening that featured UNIT battling the Nestene Consciousness.  Author Terrance Dicks also wrote and produced Shakedown: Return of the Sontarans in 1994, which not only featured the reappearance of one of the series' most famous monsters, but also starred series alums Carole Ann Ford, Sophie Aldred, and Michael Wisher.  Jan Chappell played Lisa Deranne, captain of the solar racing yacht Tiger Moth, whose shakedown cruise is interrupted by a Sontaran attack squad furiously searching for a Rutan infiltrator.  Another spinoff, Downtime, featured the return of Nicholas Courtney as Brigadier (Ret.) Lethbridge-Stewart and Elisabeth Sladen as Sarah Jane Smith, along with Deborah Watling as Troughton-era companion Victoria Waterfield.  More of a nostalgia trip for fans than anything, Downtime provided a more detailed look at Lethbridge-Stewart's family and legacy than had ever been seen before. Reeltime Pictures also produced three other Doctor Who-universe related videos, Dæmos Rising, Mindgame and Mindgame Trilogy. In November 2016 they want to release White Witch of Devil's End, a Reeltime Pictures independent drama starring Damaris Hayman as Olive Hawthorne, who made her original appearance in Doctor Who in the Jon Pertwee story \"The Dæmons\"."]}, {"page": "Bodyguards (TV series)", "response": ["Bodyguards is a British television crime drama/action series, broadcast on ITV, that focuses on the cases of a specialized bodyguard unit, the Close Protection Group, in service of the British government. The series starred Sean Pertwee and Louise Lombard as protagonists Ian Worrell and Liz Shaw. Pertwee's father, Jon, notably also starred alongside a character called Liz Shaw, played by Caroline John, who was his first companion during his time playing the Third Doctor in Doctor Who. The series was the brainchild of Jeffrey Caine, known as the creator of The Chief and script editor of the James Bond movie GoldenEye.", "* Louise Lombard as Liz Shaw"]}, {"page": "The Five Doctors", "response": ["As Borusa expected, the other three Doctors and their companions have made it to the tomb chamber, bypassing the Yeti and Raston Warrior Robot, as well as phantoms of the Doctor's former companions Jamie McCrimmon, Zoe Heriot, Liz Shaw and Mike Yates. They ponder the meaning of writing in the tomb: \"to lose is to win and he who wins shall lose\". The Master arrives in the Tomb, but the Doctors' companions tie him up, with the Brigadier knocking him out for good measure. The Doctors disable the force field to summon the TARDIS, the Third Doctor using his catchphrase of \"I've reversed the polarity of the neutron flow\", but this action allows Borusa and the Fifth Doctor to arrive via transmat. Borusa uses the Coronet to prevent the Doctors' companions from interfering while he speaks to Rassilon. An image of Rassilon appears above the tomb and offers Borusa his ring as the key to immortality. The other Doctors try to stop Borusa, but the First Doctor tells them to hold off. Borusa dons the Ring, but then shortly disappears, becoming living stone that is part of Rassilon's tomb. The First Doctor realised what fate the tomb's writing foretold: immortality, but at a cost of perpetual incarceration."]}, {"page": "Third Doctor", "response": ["His initial companion is UNIT scientist Liz Shaw (Caroline John), who unceremoniously leaves the Doctor's company between episodes to be replaced by the more wide-eyed Jo Grant (Katy Manning), who then continues to accompany the Doctor after he regains use of his TARDIS. His final companion is intrepid journalist Sarah Jane Smith (Elisabeth Sladen).", "While this incarnation spent most of his time exiled on Earth—grudgingly working as UNIT's scientific advisor—he was occasionally sent on covert missions by the Time Lords, where he would often act as a reluctant mediator. Even though he developed a fondness for Earthlings with whom he worked (such as Liz Shaw and Jo Grant), he jumped at any chance to return to the stars. Though he had a somewhat patrician and authoritarian air, he was quick to criticise authority, and often exclaimed \"Now listen to me!\" when dealing with people seeking to obstruct him."]}, {"page": "Sergeant Benton", "response": ["*The Blue Tooth (adventure related by the character Liz Shaw)"]}, {"page": "Mike Yates", "response": ["* The Blue Tooth (adventure related by the character Liz Shaw) by Nigel Fairs"]}, {"page": "Jo Grant", "response": ["Josephine \"Jo\" Jones is a fictional character played by Katy Manning in the long-running British science fiction television series Doctor Who. Jo was introduced by Barry Letts and Terrance Dicks in the first episode of Doctor Whos eighth season (1971) as a new companion of series protagonist the Doctor, in his third incarnation (Jon Pertwee). After the Doctor's previous companion Liz Shaw (Caroline John), a scientist and intellectual, the production team looked to introduce a less experienced companion to act as an audience surrogate. Jo appeared in 15 stories (77 episodes).", "Jo first appears in the 1971 serial Terror of the Autons, having been assigned to the Doctor (Jon Pertwee) as a replacement for Liz Shaw (Caroline John). Apparently, she gained the assignment to UNIT because her uncle, a high ranking civil servant, had \"pulled some strings\". Brigadier Lethbridge-Stewart (Nicholas Courtney) assigns her to the Doctor, who is initially dismayed when he finds out that she is not a scientist, but accepts her because he does not have the heart to tell her otherwise. An enthusiastic, bubbly and sometimes scatter-brained blonde, Jo soon endears herself to the other members of UNIT, especially Captain Mike Yates (Richard Franklin) and Sergeant Benton (John Levene). The Third Doctor is also particularly attached to her, and she is devoted to him, refusing to leave his side even where mortal danger is involved.", "For his first series, producer Barry Letts had primarily worked on stories inherited from the previous production team.  When it came to assessing his and script editor Terrance Dicks' approach to the next series, they identified a need to replace the Doctor's assistant, for the purposes of exposition and audience identification. Previous companion Liz Shaw had been conceived of as a brilliant scientist who could discuss matters with the Doctor on an equal footing; the replacement would be younger and more naive, someone who could ask, \"Doctor, what's all this about?\" An early memo described Grant as \"Not a scientist, though with enough basic background to understand what's going on. Other sources, including Barry Letts, have said there was an initial idea to make the character more 'exotic' with a tougher, sexier edge, but not academically brilliant, so as to give the Doctor the much-wanted (by Pertwee) chance to play the father figure.  Along with the Brigadier's new second in command, Captain Mike Yates, the character of Jo Grant was inspired by the male-female companion pairing of Jamie McCrimmon and Victoria Waterfield, whom Letts had previously directed, with the intention of a possible romantic subplot for the two. Manning stated in a 1998 interview with SFX however, that \"With Jon and I there was no need to put any love interests into the show because there was this closeness between Jo and the Doctor, and there was no room for them to have anything else going.\"", "Fraser McAlpine, reviewing Jo's appearances as companion for BBC America's Anglophenia blog felt to succeed as a foil to the \"aloof\" Third Doctor, having \"the charm of nowadays on her side\". He felt that Manning portrayed Jo's \"mixed up innocence beautifully\" and felt that her departure illustrated the Doctor's innate loneliness. The A.V. Club Christopher Bahn stated that Jo was \"one of [his] favorites\", but that, despite her \"sweet and daffy charm\", she was \"a big step backwards\" from her predecessor Liz Shaw in terms of pairing the Doctor with someone equal. Discussing Jo's return in The Sarah Jane Adventures serial Death of the Doctor, Ian Berriman of SFX magazine thought that \"Davies nails the character the moment she walks through the door – clumsy, babbling, sweet-natured\". He felt that \"It’s really good to have her back\" and stated the interaction between Jo and Sarah Jane to be \"a treat\"."]}, {"page": "Dust Breeding", "response": ["#Caroline John previously played the Third Doctor's companion Liz Shaw in the 1970 season. She was married to Geoffrey Beevers, who had previously played the Master in The Keeper of Traken."]}, {"page": "Caroline John", "response": ["During her final story, Inferno, John also played the part of Section Leader Elizabeth Shaw, an alter ego of her regular character that the Doctor encounters in an alternative time stream. John reprised the role of Shaw, albeit as a phantom, in the anniversary episode The Five Doctors, and also appeared in the special episode Dimensions in Time (1993), part of the BBC's annual Children in Need appeal. In the 1990s she appeared in a series of straight-to-video releases including The Stranger: Breach of the Peace, and as Liz Shaw in the P.R.O.B.E. stories written by Mark Gatiss and featuring numerous actors from the history of Doctor Who – including Jon Pertwee, Peter Davison, Colin Baker and Sylvester McCoy. In these stories made by the production company BBV, a pipe-smoking Shaw works as an investigator (for the P.R.O.B.E. organisation); John is seen opposite Linda Lusardi in the former model's first acting role.", "John later appeared in two Big Finish Productions' audio dramas based on Doctor Who; Dust Breeding (2001), although playing a character other than Liz Shaw, and The Blue Tooth (2007) where, as Liz, she recounts in narrative form an adventure she once had with the Doctor and UNIT. After The Blue Tooth she played Liz in four more Companion Chronicle audio plays; Binary, The Sentinels of the New Dawn and Shadow of the Past. Her final audio play, The Last Post, which she recorded on 26 January 2012, was released after her death.", "| Liz Shaw", "| Liz Shaw", "| Liz Shaw"]}, {"page": "Virgin Missing Adventures", "response": ["|21 || The Eye of the Giant||Christopher Bulis||Third||Liz Shaw, UNIT||April 1996", "|24 || The Scales of Injustice||Gary Russell||Third||Liz Shaw, UNIT||July 1996"]}, {"page": "Past Doctor Adventures", "response": ["|1 || The Devil Goblins from Neptune|| Martin Day and Keith Topping || 3rd || Liz Shaw, UNIT || June 1997"]}, {"page": "The Ambassadors of Death", "response": ["By the time Carrington takes the Doctor to meet the astronauts, an intelligent but ruthless criminal named Reegan has organised their abduction, killing the soldiers and scientists guarding them. When the Doctor and Liz examine the site, they realise that human tissue could not have withstood the degree of radiation being emitted by the mysteriously irradiated astronauts. The Doctor believes the real astronauts are still in orbit, and that the three space suits contain alien beings. Reegan engineers the kidnapping of Liz Shaw to aid his own scientist, Lennox, in keeping the alien astronauts alive. Reegan sends the creatures to the Space Centre to kill Quinlan. It now becomes clear to UNIT that the aliens are emitting radiation, and that to touch them brings instant death. It is also evident, to Liz, that Reegan is taking orders from someone else. She helps Lennox escape, and he tries to reach the Brigadier, but his bid for freedom is cut short by Reegan finding and killing him."]}, {"page": "Chris Cwej", "response": ["Chris and Roz travelled with the Doctor for many adventures. In this eventful period, Chris fathered two daughters: Jasmine Surprise Cwej-Hutchings with Ishtar Hutchings, and iKrissi with Dep of the People. After Roz's death in battle, Chris continued to travel with the Doctor for a short time, but the event had a profound effect on him. During the events of Eternity Weeps, the Doctor's former companion Liz Shaw contracted a deadly virus and begged Chris to kill her, however he was unable to do it. This and the subsequent death of millions of people from the virus caused Chris to question himself and first consider quitting the TARDIS. It took the apparent death of the Doctor in Japan to make him put aside his doubts and help protect the people of the local village from the local warlord, who wanted an alien device in their possession. "]}, {"page": "Liz shaw", "response": ["#REDIRECT Liz Shaw"]}, {"page": "Liz", "response": ["* Liz Shaw, on the British science fiction television series Dr. Who"]}, {"page": "Virgin Decalog", "response": ["|The Straw That Broke the Camel's Back || Vanessa Bishop || Third Doctor, Liz Shaw, UNIT ", "|Prisoners of the Sun || Tim Robins || Third Doctor, Liz Shaw and UNIT "]}, {"page": "Paul Finch", "response": ["* The Sentinels of the New Dawn - a Companions Chronicles audio drama from Big Finish Productions in 2011. This features the Third Doctor and Liz Shaw. This story is a prequel to Leviathan, which was written by his father Brian Finch."]}, {"page": "Grigori Rasputin in popular culture", "response": ["* In the 1999 Doctor Who Past Doctor Adventures novel The Wages of Sin, the Third Doctor and his companions Jo Grant and Liz Shaw meet Rasputin prior to his death and learn that he is actually a more pleasant individual than history records — since all evidence of his villainy was written by his enemies — but the Doctor is nevertheless forced to allow Rasputin to die, in order to preserve history."]}, {"page": "Auton (film series)", "response": ["Several dormant Autons in the Warehouse come back to life and the building becomes a battlefield. They are eventually defeated with the weapon created by the Doctor and Liz Shaw in Spearhead from Space. The Auton Winslet then liquefies and escapes through a ventilation shaft."]}, {"page": "The Devil Goblins from Neptune", "response": ["The Devil Goblins from Neptune is a BBC Books original novel written by Martin Day and Keith Topping (developed from an original idea by Day, Topping and Paul Cornell) and based on the long-running British science fiction television series Doctor Who. It was the first novel published in the Past Doctor Adventures range and features the Third Doctor, UNIT, The Brigadier, and Liz Shaw."]}, {"page": "The Scales of Injustice", "response": ["The Scales of Injustice is a Virgin Missing Adventures original novel written by Gary Russell based on the long-running British science fiction television series Doctor Who. It features the Third Doctor, Liz Shaw and UNIT.", "The Doctor suspects Silurians are afoot when a child goes missing in a seaside community, a policewoman begins drawing cave paintings, and the employees at the mysterious Glasshouse project are desperate to hide something. Meanwhile, his assistant Liz Shaw teams up with a journalist to search for people who don't exist, and Brigadier Lethbridge Stewart copes with personal and UNIT crises. And how does all this link back to the very heart of the British Government?", "This novel provides the departure scene for the companion Liz Shaw. In the television series her final appearance was in the last episode of Inferno, but she is not seen to leave the Doctor. In the Terror of the Autons her departure was announced by the Brigadier."]}, {"page": "The Wages of Sin (novel)", "response": ["The Wages of Sin is a BBC Books original novel written by David A. McIntee and based on the long-running British science fiction television series Doctor Who. It features the Third Doctor, Liz Shaw and Jo Grant.  The events of the novel apparently take place immediately following The Three Doctors."]}, {"page": "The Eye of the Giant", "response": ["The Eye of the Giant is an original novel written by Christopher Bulis and based on the long-running British science fiction television series Doctor Who. It features the Third Doctor, Liz Shaw and UNIT. It takes place prior to the Missing Adventure The Scales of Injustice by Gary Russell.", "The Doctor and Liz Shaw investigate a mysterious artifact, and trace its origin back in time to the island of Salutua, 1934, where an expedition is taking place concerning the island's unusual inhabitants. Meanwhile, Brigadier Lethbridge Stewart faces a major epidemic of UFO sightings and supernatural occurrences that threaten to bring about worldwide panic."]}, {"page": "Blood Heat", "response": ["A mysterious force breaks through the TARDIS exterior, throwing Bernice into the Vortex and forcing the Doctor to make an emergency landing.  At first thinking they've landed in prehistoric times (after a dinosaur knocks the TARDIS into a tar pit), the Doctor soon learns that they have landed on a parallel Earth.  On this Earth, the Silurians killed the Doctor in his third incarnation twenty years ago, then went on to kill most of humanity with a plague, and return Earth to its prehistoric state.  An embittered alternate version of the Brigadier, along with Liz Shaw and the remnants of UNIT, attempts to destroy the Silurians with nuclear missiles.  Ace manages to reactivate the Third Doctor's TARDIS (which had gone into hibernation after his death), which the Doctor then materializes around the entire Earth.  He then uses the Architectural Configuration controls to delete the inbound missiles and prevents the massacre of the Silurians.  The Doctor then manages to convince the Brigadier and the Silurian leader that the two races can and must live in peace.  The happy ending is ruined for Ace and Bernice, however, when the Doctor reveals that this alternate universe cannot survive without destroying the real Universe.  In order to save their Universe, the Doctor time rams his old TARDIS in order to start a chain reaction that will destroy the parallel universe after the current inhabitants have lived out the rest of their lives, vowing simultaneously to find whoever created this timeline and bring them to justice. When Ace and Bernice leave the Doctor alone, he pushes a lever, destroying the Alternate Earth automatically."]}]}}