{"wiki_id": "http://www.wikidata.org/entity/Q3036431", "itemLabel": "Russell Osman", "itemDescription": "English footballer and football manager (born 1959)", "wikipedia_url": "https://en.wikipedia.org/wiki/Russell_Osman", "wikipedia_page": {"main": "Russell Charles Osman (born 14 February 1959) is an English former professional footballer who played as a centre back in the Football League for Ipswich Town, Leicester City, Southampton, Bristol City, Brighton & Hove Albion and Cardiff City. Osman played senior international football for England, for whom he received eleven caps. He is now a football pundit in the Indian Super League.", "link_mentions": [{"page": "Bristol City F.C.", "response": ["Meanwhile, City remained in the new Division One (no longer the Second Division after the creation of the Premier League in 1992) and Smith moved to Oxford United in November 1993. His successor was Russell Osman. In January 1994 Osman led City to a shock 1–0 victory over Liverpool at Anfield in a third round replay in the FA Cup, a result that would cause the Liverpool manager at the time, Graeme Souness, to resign. Osman was sacked within a year of taking charge.", "| Russell Osman"]}, {"page": "1981 in film", "response": ["| Escape to Victory || Paramount Pictures / Lorimar || John Huston (director); Evan Jones, Yabo Yablonsky, Djordje Milićević, Jeff Maguire (screenplay); Sylvester Stallone, Michael Caine, Max von Sydow, Carole Laure, Benoît Ferreux, Clive Merrison, Maurice Roëves, Michael Cochrane, Zoltán Gera, Tim Pigott-Smith, Daniel Massey, Jean-François Stévenin, Julian Curry, Pelé, Bobby Moore, John Wark, Osvaldo Ardiles, Kazimierz Deyna, Søren Lindsted, Paul Van Himst, Mike Summerbee, Hallvar Thoresen, Russell Osman, Kevin O'Callaghan, Co Prins, Amidou, George Mikell, Gary Waldhorn, Werner Roth, Laurie Sivell, Arthur Brauss, Michael Wolf, David Shawyer || Sports, War || Live action"]}, {"page": "Bristol Rovers F.C.", "response": ["* Russell Osman & Kevan Broadhurst 2004 (joint caretakers)"]}, {"page": "Repton", "response": ["*Russell Osman, Ipswich Town & international footballer, was born here in 1959."]}, {"page": "Ipswich Town F.C.", "response": ["A number of Ipswich players appeared alongside Sylvester Stallone and Pelé in the 1981 prisoner of war film Escape to Victory, including John Wark, Russell Osman, Robin Turner, Laurie Sivell, and Kevin O'Callaghan. Other Ipswich Town players stood in for actors in the football scenes—Kevin Beattie for Michael Caine, and Paul Cooper for Sylvester Stallone."]}, {"page": "Denis Smith (footballer, born 1947)", "response": ["Smith rebuilt the defence for 1993–94, signing right-back Brian Mitchell and centre-back David Thompson, and oversaw a mixed start to the season. City won four straight home matches but also lost 5–1 to West Ham, 5–0 at Newcastle, and most significantly 4–0 to local rivals Bristol Rovers at Twerton Park. He found it difficult to control the club's talented and popular players, as Dziekanowski regularly got into trouble in his social life and skilled left-winger Junior Bent was unwilling to deliver crosses as regularly as Smith demanded. He tried to sell Bent but was unable to have the deal sanctioned by the club's directors. His relationship with the board was poor and he found himself regularly undermined and sensitive boardroom discussions were leaked. He also tried to sell Cole in order to provide funds to restructure the first team but again the board refused to sanction the deal. He was dismissed on 21 January 1993 following a run of 10 matches without a victory, and his assistant Russell Osman was appointed as his successor."]}, {"page": "1977–78 in English football", "response": ["3 September 1977: Russell Osman, 18-year-old defender, makes his debut for Ipswich Town in the 1–0 First Division win over Chelsea at Portman Road."]}, {"page": "Dale Roberts (footballer, born 1956)", "response": ["He was on the Ipswich team at the same time as other centre-half players such as Kevin Beattie, Allan Hunter, Russell Osman and Terry Butcher. He played 24 games before he moved on to Hull City making 182 appearances as the club moved up from fourth to the second division, before retiring through injury. He later had spells with non league North Ferriby United and Bridlington Town."]}, {"page": "Escape to Victory", "response": ["The film received great attention upon its theatrical release, as it also starred professional footballers Bobby Moore, Osvaldo Ardiles, Kazimierz Deyna, Paul Van Himst, Mike Summerbee, Hallvar Thoresen, Werner Roth and Pelé. Numerous Ipswich Town players were also in the film, including John Wark, Russell Osman, Laurie Sivell, Robin Turner and Kevin O'Callaghan. Other Ipswich Town players stood in for actors in the football scenes – Kevin Beattie for Michael Caine, and Paul Cooper for Sylvester Stallone. Yabo Yablonsky wrote the script and the film was entered into the 12th Moscow International Film Festival.", "In the end, the POWs can leave the German camp only to play the match; they are to be imprisoned again following the match. The resistance's tunnellers break through to the showers in the dressing room at halftime, in an escape Hatch leads. But the rest of the team (led by Russell Osman saying \"but we can win this\") persuade him to continue the game, despite being behind 4–1 at halftime."]}, {"page": "Stuart Slater", "response": ["He made his first start for West Ham against Southampton in August 1988, when a clash of heads with Russell Osman led to him being taken off in the first minute. He recovered to win the Man of the Match award in his next two games, against Charlton and Newcastle United, and scored his first goal for the club in a F.A. Cup 5th round tie against Charlton in February 1989. Playing in Division Two in 1989–90, he scored nine goals in 50 league and cup appearances as West Ham reached the semi-final of the League Cup, and made three substitute appearances for the England Under 21 team in 1990."]}, {"page": "Gerard Nash (footballer)", "response": ["Upon retiring from playing, Nash joined the Ipswich Town academy as a professional development coach. He took over as manager of the Ipswich Under-18 side after Russell Osman left the club in 2013. In 2016, Nash took over the role as manager of Ipswich's Under-23 side following the departure of current Under-23s manager Mark Kennedy."]}, {"page": "1992–93 in English football", "response": ["12 March 1993 – Russell Osman becomes the Bristol City's new manager. John Ward leaves York City to take over at Bristol Rovers, and is succeeded at Bootham Crescent by Alan Little."]}]}}