{"wiki_id": "http://www.wikidata.org/entity/Q3048661", "itemLabel": "Edward Richard Alston", "itemDescription": "Scottish zoologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Richard_Alston", "wikipedia_page": {"main": "Edward Richard Alston (1 December 1845 – 7 March 1881) was a Scottish zoologist.\nAlston was born at Stockbriggs, near Lesmahagow, 1 December 1845. He was delicate in youth, so chiefly self-educated at home. He very early contributed to the 'Zoologist' and various Scottish magazines, and ultimately became an acknowledged authority on mammalia and birds. His principal papers in the 'Proceedings of the Zoological Society' (1874–80) are upon rodents, especially American squirrels (1878 and 1879). The division Mammalia in Salvin and Godman's 'Biologia Centrali-Americana’ was written by him, though its publication was incomplete at his death.\nIn 1880 he was elected zoological secretary of the Linnean Society, which office he held till his death from acute phthisis on 7 March 1881. In 1874 he largely assisted Prof. T. Bell in the second edition of 'British Quadrupeds.'", "link_mentions": [{"page": "Platacanthomyidae", "response": ["Category:Taxa named by Edward Richard Alston"]}, {"page": "Ghost bat", "response": ["The specimen had previously been described by Gerard Krefft in a communication to the Zoological Society of London, and had been forwarded to the Göttingen museum by Dr. Schuette. The description and illustration were presented to the society in 1879, accompanied by the suggestion that it was an unnamed genus of Phyllostomatidae (New World leaf-nosed bats); a member of the society, Edward Richard Alston, proposed instead it was a species of Megaderma which were unknown in Australia. The type locality is at the Wilson River near Mt Margaret in Queensland, where the collector, also named Wilson, obtained the bat. An earlier observation had been noted by Robert Austin in 1854 at Mount Kenneth while surveying the inland regions of Western Australia."]}, {"page": "Oryzomys couesi", "response": ["Category:Taxa named by Edward Richard Alston"]}, {"page": "Alston (name)", "response": ["*Edward Richard Alston (1845–1881), Scottish zoologist"]}]}}