{"wiki_id": "http://www.wikidata.org/entity/Q3048463", "itemLabel": "Edward Bird", "itemDescription": "British artist (1772-1819)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Bird", "wikipedia_page": {"main": "Edward Bird  (1772 – 2 November 1819) was an English genre painter who spent most of his working life in Bristol, where the Bristol School of artists formed around him. He enjoyed a few years of popularity in London, where he challenged the dominance of Sir David Wilkie in the genre painting field, before moving on to history painting, specialising in battle scenes.\n\n", "link_mentions": [{"page": "List of British painters", "response": ["*Edward Bird (1772–1819)"]}, {"page": "Wolverhampton Art Gallery", "response": ["Selected paintings by the 18th-century artists from the gallery's collection include the 'Portrait of the Lee Family' by Joseph Highmore, 'David Garrick in 'The Provoked Wife' by Johann Zoffany, 'Portrait of Erasmus Darwin' (1792) by Joseph Wright of Derby, 'Apotheosis of Penelope Boothby' by Henry Fuseli, 'Arrival of Louis XVIII at Calais' by Wolverhampton-born Edward Bird. In addition, portrait miniatures, Bilston enamels depicting famous actors of the era, and some examples of the 18th-century Eastern and British ceramics are on display."]}, {"page": "Francis Danby", "response": ["The group had initially formed around Edward Bird, and Danby would eventually succeed Bird as its central figure. Bird's genre painting had a naturalistic style and fresh colours, and his influence has been seen on Danby's style. Examples are Danby's treatment of figures in Boys Sailing a Little Boat (c. 1821) and The Delivery of Israel out of Egypt (1825). Danby was also close to Edward Villiers Rippingille, whose style developed alongside that of Danby under the influence of Bird."]}, {"page": "1772 in art", "response": ["**Edward Bird, painter  (died 1819)"]}, {"page": "1819 in art", "response": ["*November 2 – Edward Bird, English genre painter  (born 1772)"]}, {"page": "Bird (surname)", "response": ["* Edward Bird (1772–1819), English painter", "* Henry Edward Bird (1830–1908), English chess player and writer"]}, {"page": "Wolverhampton", "response": ["From the 18th century, Wolverhampton was well known for production of japanned ware and steel jewellery. The renowned 18th- and 19th-century artists Joseph Barney (1753–1832), Edward Bird (1772–1819), and George Wallis (1811–1891) were all born in Wolverhampton and initially trained as japanned ware painters."]}, {"page": "List of people from Wolverhampton", "response": ["* Edward Bird R.A. (1772–1819) – artist, early member of the Bristol SchoolFrancis Greenacre, \"Bird, Edward (1772–1819)\", Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 1 July 2007"]}, {"page": "Bristol School", "response": ["The school initially formed around Edward Bird some years before his death in 1819. Having arrived in Bristol from Ireland in 1813, Francis Danby was a participant from around 1818–19 and remained connected to the group for around a decade, although he left Bristol for London in 1824. Other artists involved were Edward Villiers Rippingille, Samuel Jackson, James Johnson, Nathan Cooper Branwhite, William West, James Baker Pyne, George Arthur Fripp and Paul Falconer Poole."]}, {"page": "Edward Villiers Rippingille", "response": ["Edward Villiers Rippingille (c. 1790–1859) was an English oil painter and watercolourist who was a member of the informal group of artists which has come to be known as the Bristol School. In that group he was a particularly close associate of both Edward Bird and Francis Danby.", "He moved to Bristol, where he participated in the sketching activities of the Bristol School. Rippingille's Sketching Party in Leigh Woods (c. 1828) depicts a sketching excursion in Leigh Woods typical of those made by the school's members. He worked particularly closely with Edward Bird, and was influenced by Bird's genre painting, which was naturalistic and freshly coloured. In 1814 they both exhibited works at the Royal Academy with the same subject, The Cheat Detected. Rippingille was also a close friend of Francis Danby, and his style developed alongside that of Danby under Bird's influence. In 1819 Rippingille had a success at the Royal Academy with The Post Office. In 1822 the Royal Academy saw The Recruiting Sergeant, a work following the style of Bird, and The Funeral Procession of William Canynge to St Mary Redcliffe, 1474. These works were among Rippingille's finest achievements in the fields of genre and historical painting respectively."]}, {"page": "Nathan Cooper Branwhite", "response": ["Branwhite was born in St Albans, Hertfordshire, the son of a poet, Peregrine Branwhite, and became a pupil of Isaac Taylor. He exhibited 13 miniatures at the Royal Academy between 1802 and 1828. He was also a stipple engraver. By 1810 he was living in Bristol. He participated in the sketching activities of the Bristol School and was a friend of Edward Bird and James Johnson. In 1824 he was one of the organisers of the first exhibition of local artists at the new Bristol Institution. In 1832 he exhibited a number of works at the first exhibition of the newly formed Bristol Society of Artists, also at the Bristol Institution."]}, {"page": "George Cumberland", "response": ["George Cumberland (1754–1848) was an English art collector, writer and poet. He was a lifelong friend and supporter of William Blake, and like him was an experimental printmaker. He was also an amateur watercolourist, and one of the earliest members of the Bristol School of artists. He made use of his wide circle of connections to help its other members, in particular assisting and influencing Edward Bird and Francis Danby.", "Cumberland became a close friend of Edward Bird, and godfather to his son. He did not have the resources to be Bird's patron, but he would lend Bird items from his art collection to study. In 1814 when Bird asked for help in gaining a royal commission, Cumberland introduced him to Charles Long, who then arranged with the Prince Regent for Bird to conduct royal portrait studies aboard the royal yacht. On Bird's death in 1819 Cumberland successfully petitioned the Royal Academy to provide a pension for Bird's widow."]}, {"page": "List of Royal Academicians", "response": ["| Edward Bird   ||align=\"center\" |  1815  || "]}]}}