{"wiki_id": "http://www.wikidata.org/entity/Q3048553", "itemLabel": "Edward Hogg", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Hogg", "wikipedia_page": {"main": "Edward Hogg (born 26 January 1979) is an English actor, known for portraying Jesco White in White Lightnin', Stephen Turnbull in Bunny and the Bull, Eugene Mathers in Indian Summers, Segundus in Jonathan Strange & Mr Norrell, Michael 'Godders' Godfrey in Taboo, and Thomas Haxby in Harlots.", "link_mentions": [{"page": "Robert Cecil, 1st Earl of Salisbury", "response": ["* He is portrayed unsympathetically by Edward Hogg as a malevolent hunchbacked villain in Roland Emmerich's movie Anonymous."]}, {"page": "Martin Clunes", "response": ["In 2011, Clunes voiced the mischievous dog Dudley in the short film Me or the Dog, starring Edward Hogg and directed by Abner Pastoll. Clunes then starred in the 2014 film Nativity 3: Dude, Where's My Donkey?."]}, {"page": "Wales High School", "response": ["*Edward Hogg – English actor"]}, {"page": "Paul King (director)", "response": ["Bunny and the Bull, which King wrote and directed, was released in 2009. The film stars Simon Farnaby and Edward Hogg, with cameos from Noel Fielding, Richard Ayoade and Julian Barratt."]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Edward Hogg (BA Acting 2002)"]}, {"page": "Rock 'n' Roll (play)", "response": ["*Piper, Police Officer 1, Stephen – Edward Hogg"]}, {"page": "Screen International", "response": ["* Edward Hogg"]}, {"page": "Godfrey (name)", "response": ["* Godfrey, a Molly character in the television series Taboo (2017 TV series) played by Edward Hogg"]}, {"page": "The Last Days of Judas Iscariot", "response": ["The original West End/European Premiere was at the Almeida Theatre, and was directed by Rupert Goold, and it ran from 28 March to 10 May 2008. The cast included (in order of appearance) Amanda Boxer (Henrietta Iscariot), Doña Croll (Gloria/Mother Teresa), Corey Johnson (Judge/Saint Peter), John Macmillan (Bailiff/Simon the Zealot), Susan Lynch (Fabiana Aziza Cunningham), Mark Lockyer (Yusef El-Fayoumy), Jessika Williams (St Monica), Poppy Miller (Loretta/Sister Glenna/Mary Magdalene), Ron Cephas Jones (Uncle Pino/Pontius Pilate), Shane Attwooll (Butch Honeywell), Joseph Mawle (Judas Iscariot), Josh Cohen (Matthias of Galilee/Freud/St Thomas), Gawn Grainger (St Matthew/Caiaphas the Elder), Douglas Henshall (Satan) and Edward Hogg (Jesus of Nazareth). It was designed by Anthony Ward.Original West End Program (physical source)"]}, {"page": "List of British films of 2009", "response": ["|Bunny and the Bull||Paul King||Edward Hogg, Simon Farnaby||Comedy||27 November||"]}, {"page": "Ian Charleson Awards", "response": ["*Edward Hogg, for Woyzeck in Woyzeck (Gate Theatre)"]}, {"page": "Filmclub", "response": ["| Edward Hogg"]}, {"page": "Bunny and the Bull", "response": ["Bunny and the Bull is a 2009 British comedy film from writer-director Paul King. It stars Edward Hogg and Simon Farnaby in a surreal recreation of a road trip. King has previously worked on British television comedies The Mighty Boosh and Garth Marenghi's Darkplace; the film is made in a similar style and has guest appearances from stars of those series.", "*Edward Hogg as Stephen Turnbull"]}, {"page": "Shooting Stars Award", "response": ["|2010|| Dragoș Bucur (Romania)Anders Baasmo Christiansen (Norway)Kryštof Hádek (Czech Republic)Edward Hogg (United Kingdom)Michele Riondino (Italy)|| Agata Buzek (Poland)Zrinka Cvitešić (Croatia)Anaïs Demoustier (France)Lotte Verbeek (The Netherlands)Pihla Viitala (Finland) "]}, {"page": "British Independent Film Awards 2009", "response": ["* Edward Hogg – White Lightnin'"]}, {"page": "Anonymous (2011 film)", "response": ["Kirk Honeycutt ranked it as Emmerich's best film, with a superb cast of British actors, and a stunning digitally-enhanced recreation of London in Elizabethan times. The film is \"glorious fun as it grows increasingly implausible\", for the plot \"is all historical rubbish\".. Damon Wise, reviewing the film for The Guardian, appraises Emmerich's \"meticulously crafted\" and \"stunningly designed takedown of the Bard\", as shocking only in that it is rather good. Emmerich's problem, he argues, is that he was so intent on proving his credentials as a serious director that the film ended up \"drowned in exposition\". Orloff's screenplay heavily confuses plotlines; the politics are retrofitted to suit the theory. The lead roles are \"unengaging\" but special mention is given to Edward Hogg's performance as Robert Cecil, and Vanessa Redgrave's role as Elizabeth.."]}]}}