{"wiki_id": "http://www.wikidata.org/entity/Q3048531", "itemLabel": "Edward Glover", "itemDescription": "British psychoanalyst", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Glover_(psychoanalyst)", "wikipedia_page": {"main": "Edward George Glover (13 January 1888 – 16 August 1972) was a British psychoanalyst. He first studied medicine and surgery, and it was his elder brother, James Glover (1882–1926) who attracted him towards psychoanalysis. Both brothers were analysed in Berlin by Karl Abraham; indeed, the \"list of Karl Abraham's analysands reads like a roster of psychoanalytic eminence: the leading English analysts Edward and James Glover\" at the top. He then settled down in London where he became an influential member of the British Psycho-Analytical Society in 1921. He was also close to Ernest Jones.\nAmongst Edward Glover's most lasting achievements in the combined field of psychotherapy and criminology – aside from his clinical work and extensive publications – are his roles as: co-founder of the Psychopathic Clinic (renamed the Portman Clinic in 1937) and the Institute for the Study and Treatment of Delinquency, joint founder of The British Journal of Criminology – he was co-editor until his death – and co-founder of the British Society of Criminology. He was one-time chairman of the medical section of the British Psychological Society. He is publicly remembered in the annual Glover lecture, delivered under the auspices of the Portman Clinic.", "link_mentions": [{"page": "The Blitz", "response": ["According to Anna Freud and Edward Glover, London civilians surprisingly did not suffer from widespread shell shock, unlike the soldiers in the Dunkirk evacuation.Ingersol, 1940, pp. 114, 117–18 The psychoanalysts were correct, and the special network of psychiatric clinics opened to receive mental casualties of the attacks closed due to lack of need. Although the stress of the war resulted in many anxiety attacks, eating disorders, fatigue, weeping, miscarriages, and other physical and mental ailments, society did not collapse. The number of suicides and drunkenness declined, and London recorded only about two cases of \"bomb neurosis\" per week in the first three months of bombing. Many civilians found that the best way to retain mental stability was to be with family, and after the first few weeks of bombing, avoidance of the evacuation programmes grew.Field 2002, pp. 15–20.Titmuss 1950, pp. 340, 349.Mackay 2002, pp. 80–81."]}, {"page": "Lesmahagow", "response": ["* Edward Glover (1888–1972), physician and psychoanalyst, born there."]}, {"page": "Neo-Freudianism", "response": ["In comparable fashion, \"an article…by Mr Edward Glover, entitled Freudian or Neo-Freudian, directed entirely against the constructions of Mr Alexander\"Lacan, Jacques. 1994. The Four Fundamental Concepts of Psychoanalysis. London. p. 174. equally used the term as a form of orthodox reproach."]}, {"page": "British Psychoanalytical Society", "response": ["* Edward Glover – who identified as 'pure Freudian', in opposition to Melanie Klein. Glover resigned from the society in 1944, along with several other Freudian psychoanalysts."]}, {"page": "Karl Abraham", "response": ["Karl Abraham collaborated with Freud on the understanding of manic-depressive illness, leading to Freud's paper on 'Mourning and Melancholia' in 1917.  He was the analyst of Melanie Klein during the years 1924–1925, and of a number of other British psychoanalysts, including Edward Glover, James Glover, and Alix Strachey.  He was a mentor for an influential group of German analysts, including Karen Horney, Helene Deutsch, and Franz Alexander. "]}, {"page": "Franz Alexander", "response": ["The concept provoked much controversy, provoking opposition from figures as disparate as Kurt R. Eissler, Edward Glover, and Jacques Lacan, who later said 'I did not hesitate to attack it myself in the most categorical way ... at the 1950 Congress of Psychiatry, but, it is the construction of a man of great talent'.Jacques Lacan, The Four Fundamental Concepts of Psycho-Analysis (London 1994) p. 174"]}, {"page": "Glover (surname)", "response": ["*Edward Glover (athlete) (1885–1940), American athlete", "*Edward Glover (psychoanalyst) (1888–1972), English psychoanalyst"]}, {"page": "William March", "response": ["Two years later, following a move to London, March finished his third novel, The Tallons, the second in his \"Pearl County\" series. Reviews in the UK were generally positive, more so than in the United States.Simmonds (1984), pp. 132-34. Psychological problems that had already bothered him in Germany worsened in London, and he became a patient of psychoanalyst Edward Glover, who was able to cure March's throat paralysis, diagnosing it as a hysterical condition.Simmonds (1984), p. 114-15. (March dedicated The Tallons to him, \"as a slight recompense for the gray hairs I have put in his head\".Simmonds (1984), p. 120.) While in London March became acquainted with a number of literary characters, leaving more of his Waterman work to his subordinates.Simmonds (1984), p. 135. In 1937, he returned to the US and within two years resigned his position to concentrate more on his writing, which by then was a full-time occupation; he had been paid partly in stock and could live well off the dividends.Simmonds (1988), pp. xvii-xviii. 1937, Simmonds notes, was an important year: it marked the high point of his productivity as a short-story writer, and the magazine The American Mercury took up Company K for a reprinting.Simmonds (1984), pp. 134-35. In 1943, he completed his most ambitious and critically acclaimed novel, The Looking-Glass, the final book in his \"Pearl County\" series;Simmonds (1988), p. xix. Bert Hitchcock, literature professor at Auburn, called it March's \"finest literary achievement\".Hitchcock (2002), p. 28."]}, {"page": "Ego integrity", "response": ["* Edward Glover, \"A Developmental Study of the Obsessional Neurosis\" Int. Jo. of Psychoanalysis XVI 1935"]}, {"page": "Paul Roazen", "response": ["* Oedipus in Britain: Edward Glover and the Struggle over Klein, N.Y., Other Press, 2000"]}, {"page": "List of psychoanalytical theorists", "response": ["* Edward Glover – psychoanalyst"]}, {"page": "August Aichhorn", "response": ["**Contributions: Ernest Jones, Kurt R. Eissler, Paul Federn, Heinrich Meng, Oskar Pfister, Laureta Benda, Joseph B. Cramer, Kata F. Levy, Margaret S. Mahler, Ernst Simmel, Editha Sterba, S. A. Szurek, John M. Dorsey, Willi Hoffer, Hyman S. Lipman, C.P. Oberndorf, Melitta Schmideberg, Anna Freud, Kate Friedländer, Margaret E. Fries, Adelaide M Johnson, Jeanne Lampl-de Groot, Fritz Wittels, M. Woolf, Paul Bergman, Dorothy T. Burlingham, Ruth S. Eissler, Martin Grotjahn, Fritz Redl, Gregory Zilboorg, Edith Jacobson, Paul Reiwald, Hans Zulliger, Dorothy Archibald, G. Bose, Edward Glover, Nelly H. C. Tibout."]}, {"page": "Edward Glover (Forensic Psychiatrist)", "response": ["#REDIRECT Edward Glover (psychoanalyst)"]}, {"page": "Edward Glover", "response": ["Edward Glover may refer to:", "* Edward Glover (athlete) (1885–1940), American pole vaulter", "* Edward Glover (psychoanalyst) (1888–1972), British psychoanalyst"]}, {"page": "Sylvia Payne", "response": ["Payne developed an interest in psychoanalysis during the war and began training with Edward Glover at the Medico-Psychological Clinic on Brunswick Square, London. She went to Berlin, where she underwent analysis with Hans Sachs and got to know Karl Abraham. In 1922, Payne became an Associate Member of the British Psychoanalytical Society. In 1926 she became a psychiatrist at Ernest Jones' London Clinic of Psychoanalysis (later the Institute of Psychoanalysis) and a member of the society. Payne was strong advocate for psychoanalysis and a prolific writer on psychoanalysis and women. Jones put her in charge of administration at the society, where she was very effective. In 1929 she was joint secretary with Joan Riviere in the International Congress in Oxford. Payne was the analyst for Marion Milner and Charles Rycroft, among others.", "Between 1941 and 1945, she played an important part in the controversial discussions as one of the moderators between Melanie Klein and Anna Freud. She organised a stenographer to record the discussion accurately, so members who could not get to London because of war work could be kept in touch. At the same time, there was a constitutional debate within the society centring on Edward Glover. The result was that Glover resigned from the society and Anna Freud resigned from the training committee."]}, {"page": "Centre for Crime and Justice Studies", "response": ["The ISTD initially had a psychoanalytical approach to crime and criminal justice, and its early members included Sigmund Freud, Carl Jung, Otto Rank, and Edward Glover. In 1950 the organisation published the first issue of The British Journal of Delinquency, renamed in 1960 The British Journal of Criminology: An International Review of Crime and Society which reflected, in Glover's view, \"the long distance policy of the ISTD to effect the extension of research into various non-criminal fields of observation\". The organisation had an influential role in the development of criminology in the UK following the Second World War.Faulkner, David (2006). Crime, State, and Citizen: A Field Full of Folk. Waterside Press. p. 107. "]}, {"page": "Ella Freeman Sharpe", "response": ["Sharpe taught at the Hucknall Pupil Teachers Training College 1904-16, before moving to London to undertake analysis with Edward Glover's brother James.  In 1923 she became a member of the British Psycho-Analytical Society, and had a second analysis, postwar, with Hanns Sachs."]}, {"page": "Edward George Glover", "response": ["#redirectEdward Glover (psychoanalyst)"]}, {"page": "Melitta Schmideberg", "response": ["In London, she joined the British Psychoanalytical Society as associate member.  Entering further analysis with Edward Glover,M. Shapira, The War Inside (2013) p. 57 she became a partisan with him in their vocal dispute with her own mother;P. Gay, Freud (1989) p. 466 and later resigned from the Society in 1944 to concentrate on her work with juvenile delinquency. She is sometimes seen as an extreme example of the bitterness that can be instilled by having an analytic parent.J. Pearson, Analyst of the Imagination (2004) p. 49"]}, {"page": "Barbara Low", "response": ["Low attended the Frances Mary Buss School and graduated from University College London, before training as a teacher at the Maria Grey Training College. She later went to Berlin for analysis with Hanns Sachs, and became a founder member of the British Psychoanalytical Society. She remained active in the society, serving as librarian, and encouraging wider public involvement for the society during World War II.B. Maddox, Freud's Wizard (2006) p. 246. Having led the welcoming committee for Austrian analysts in 1938,B. Maddox, Freud's Wizard (2006) p. 238. Low supported Anna Freud and Edward Glover in the wartime controversial discussions.P. King/R. Steiner eds., The Freud/Klein Controversy 1941-45 (1990)."]}, {"page": "Maurice Bevan-Brown", "response": ["He graduated M.B. Ch.B. from Otago University in 1921, and returned to London on a Medical Travelling Scholarship, registering as a medical practitioner on August 10, 1923. From 1926 to 1940 he practised as a psychiatrist in London, and worked with J. A. Hadfield, Ian Dishart Suttie, Crichton Miller, John Macmurray, Edward Glover, Carl Jung, Alfred Adler, Wilhelm Stekel and others. For 17 years he was physician (i.e. psychiatrist) on the staff of the Tavistock Clinic in London.Bevan-Brown, C. M. Mental Health and Personality Disorder, Dunford Publications, Christchurch, NZ, 1961, foreword, page v."]}, {"page": "Mary Chadwick", "response": ["Mary Chadwick (died 1943) was a British nurse and psychoanalyst, characterized by Edward Glover as \"the founder of child-analysis in Britain\". A friend of the poet H. D., she analysed H.D. in 1931.", "Chadwick was introduced to psychotherapy by the Brunswick Square Clinic, receiving her first analysis there from Julia Turner. She delivered a paper on child analysis to the inaugural British Psychoanalytic Society meeting in 1919. In 1920 she accompanied James Strachey, Edward Glover and Ella Freeman Sharpe to Berlin, where she underwent analysis with Hanns Sachs.Lawrence Kubie, 'Edward Glover', The Psychoanalytic Quarterly, Vol. 38, No. 4 (1969), p.523 She started seeing children in therapy in 1922, and became an Associate Member of the BPAS in 1923."]}]}}