{"wiki_id": "http://www.wikidata.org/entity/Q3048577", "itemLabel": "Edward Jones", "itemDescription": "Welsh musician, born 1752", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Jones_(harpist)", "wikipedia_page": {"main": "Edward Jones (March 1752 – 18 April 1824) was a Welsh harpist, bard, performer, composer, arranger, and collector of music.  He was commonly known by the bardic name of \"Bardd y Brenin\", which he took in 1820, when King George IV, his patron, came to the throne.\nJones was born in Llandderfel, near Bala, and is remembered for his three-volume work, the Musical and Poetical Relicks of the Welsh Bards.:\nThe Musical and Poetical Relicks of the Welsh Bards (1784)\nThe Bardic Museum (1802) Musical and Poetical Relics of the Welsh Bards; Preserved by Tradition from very remote antiquity. To the Bardic tunes are added Variations for the Harp, Piano-forte, Violin or Flute... Likewise a general history of the Bards, and Druids, from the earliest period to the present time.\nLyric Airs (1804)  consisting of Specimens of Greek, Albanian, Walachian, Turkish, Arabian, Persian, Chinese, and Moorish National Songs and Melodies (being the first selection of the kind ever yet offered to the public:) to which are added, Basses for the Harp, or Piano-forte. Likewise are subjoined, a few explanatory notes on the figures and movements of the Modern Greek Dances; with a short dissertation on the Origin of the Ancient Greek Music. Most respectfully dedicated to Mrs. Musters by the editor, Edward Jones, Bard to his Royal Highness the Prince of Wales.\nA Selection of most Admired and Original German Waltzes, never before published; adapted for the Harp, or Piano-Forte.  (1806)\nHen Ganiadau Cymru (1820)He first came to London in 1775, and was patronised by prominent Welshmen and by Charles Burney. He played in the Bach-Abel concerts which were London’s first subscription concert series, started in 1765.  He became harp tutor to several wealthy families, and in about 1790 was made Harp-Master to the Prince of Wales. In 1805 he moved into the Office of the Robes, St James's Palace.\nJones suffered significant financial difficulties in his later life and, as well as seeking loans, was forced to sell some of his collection.Three of his published works include frontispieces by Thomas Rowlandson.\nThe remainder of his library was sold at auction the year following his death.", "link_mentions": [{"page": "1824 in music", "response": ["*April 18 – Edward Jones, royal harpist (born 1752)"]}, {"page": "List of Christmas carols", "response": ["|Edward Jones (Composer) / John Ceiriog Hughes (Welsh lyrics) "]}, {"page": "1784 in music", "response": ["*Edward Jones – Musical and Poetical Relicks of the Welsh Bards, including \"Deck the Halls\""]}, {"page": "1752 in music", "response": ["*March 29 – Edward Jones, composer and harpist (died 1824)"]}, {"page": "Edward Jones", "response": ["* Edward Jones (English architect) (born 1939), English architect who designed the Saïd Business School", "* Edward Jones (Welsh architect) (1796–1835), Welsh-born architect and surveyor", "* Edward Jones (harpist) (1752–1824), Welsh harpist and author", "* Edward Jones (statistician) (1856–1920), co-founder of Dow Jones & Company", "* Edward Jones Investments, an investment company (founded 1922, formerly known as Edward D. Jones & Co., L.P.)", "* Edward D. Jones (1893–1982), investment banker, founder of Edward Jones Investments", "* Edward Jones (English politician) (died 1609), English politician", "* Edward Jones (North Carolina politician) (1950–2012), American state legislator", "* Edward Jones (martyr) (died 1590), Catholic martyr", "* Edward Jones (bishop) (1641–1703), Bishop of St Asaph", "* Edward Jones (Methodist preacher) (c. 1741–after 1806), nicknamed \"Ginshop\" Jones, Welsh Calvinistic Methodist preacher in London", "* Edward Jones (missionary) (1807–1865), African American missionary to the colony of Sierra Leone", "* Edward Jones (Canon of Windsor) (1653–1737), Canon of Windsor", "* Edward Jones (football manager), English football manager of the Egypt national team 1949–1952", "* Edward Jones (lacrosse) (1881–1951), British lacrosse player", "* Edward Jones (rugby league), rugby league footballer of the 1910s for Wales, and Broughton Rangers", "* Edward Jones (cricketer) (1896–1978), Welsh cricketer", "* Red Borom (Edward Jones Borom, 1915–2011), American baseball player", "* The Edward Jones Dome (formerly TWA Dome), 1995 opened multi-purpose stadium in St. Louis, once home to the Rams of the NFL", "* \"The boy Jones\" (Edward Jones, 1824–1893), notorious intruder into Buckingham Palace between 1838 and 1841", "* Edward Jones (British Army officer) (1936–2007), British army general"]}, {"page": "Indigenous music of Australia", "response": ["Early visitors and settlers published a number of transcriptions of traditional Aboriginal music. The earliest transcription of Aboriginal music was by Edward Jones in London in 1793, published in Musical Curiosities, 1811. Two Eora men (of the Sydney area in New South Wales), Yemmerrawanne and Bennelong, had travelled to England with Arthur Phillip, and while they were in London gave a recital of a song in the Dharug language."]}, {"page": "Eora", "response": ["An Eora song has survived. It was sung by Bennelong and Yemmerrawanne at a concert in London in 1793. Their words and the music were transcribed by Edward Jones and published in 1811. A modern version of the song was rendered by Clarence Slockee and Matthew Doyle at the State Library of NSW, August 2010, and may be heard online."]}, {"page": "Ar Hyd y Nos", "response": ["\"Ar Hyd y Nos\" () is a Welsh song sung to a tune that was first recorded in Edward Jones' Musical and Poetical Relics of the Welsh Bards (1784). The most commonly sung Welsh lyrics were written by John Ceiriog Hughes (1832-1887), and have been translated into several languages, including English (most famously by Harold Boulton (1859–1935)Krehbiel, Henry Edward, ed. Famous Songs. Cincinnati: John Church Co., 1902.) and Breton. One of the earliest English versions, to different Welsh lyrics by one John Jones, was by Thomas Oliphant in 1862.published in Welsh Melodies, With Welsh And English Poetry, by John Jones (Talhaiarn) & Thomas Oliphant. Author: John Thomas"]}, {"page": "O sanctissima", "response": ["\"O sanctissima\" was published as \"The Prayer of the Sicilian Mariners\", with text and music for voice and harp, in Edward Jones's Miscellaneous Collection of French and Italian Ariettas. His undated publication is sometimes estimated as 1785,. . but his cited position as Bard to His Royal Highness the Prince of Wales did not begin until \"about 1790\". The hymn was published anonymously by European Magazine in 1792 and then by an American magazine in 1794. By the early 1800s, \"O sanctissima\" was spreading widely in multiple languages. J.G. Herder included the song posthumously in his prominent book of traditional folksongs (, 1807), while Haydn (Hob. XXIIIc:F2) and Beethoven (WoO 157:4) each wrote choral arrangements of the Latin hymn. A German-language version (\"O du fröhliche\", c.1816) became a well-known Christmas carol, with original lyrics by J.D. Falk referring not to the Blessed Virgin Mary, but rather to Jesus himself and his day of birth. In English:"]}, {"page": "Mari Lwyd", "response": ["It has been suggested that the Welsh Methodist revival contributed to the decline of both the Mari Lwyd and a number of other Welsh folk customs. In 1802, the harpist Edward Jones of Merionethshire published a book in which he lamented the destructive impact that Christian preachers were having on Welsh folk customs, which they were criticising as sinful. In his view, \"the consequence is, Wales, which was formerly one of the merriest and happiest countries in the World, is now becoming one of the dullest\". Reflecting such a view, in 1852 the Reverend William Roberts, a Baptist minister at Blaenau Gwent, condemned the Mari Lwyd and other related customs as \"a mixture of old Pagan and Popish ceremonies... I wish of this folly, and all similar follies, that they find no place anywhere apart from the museum of the historian and antiquary.\""]}, {"page": "The Ash Grove", "response": ["The first published version of the tune was in 1802 in The Bardic Museum, a book written by the harpist Edward Jones. About four years later a version with words appeared, under the name Llwyn Onn. It tells of a sailor's love for \"Gwen of Llwyn\". At the end of the song, Gwen dies, and in one version of the piece, the writer talks about him mourning and that she is lying neath the shades of the lonely ash grove\". The tune might be much older, as a similar air appears in The Beggar's Opera by John Gay (1728), in the song \"Cease Your Funning\". This was arranged by Beethoven in his Twelve Scottish Songs, WoO 156 No. 5. In 1922, the English folksong collector Frank Kidson claimed that Gay's air derives from the morris dance tune \"Constant Billy\", which is first known in Playford's Dancing Master (1665)."]}, {"page": "Etnika", "response": ["In 1999, researcher Steve Borġ, identified a collection of old Maltese melodies at King's College London. The Welshman Edward Jones, formerly the bard to the Prince of Wales, had published these melodies around 1807. Borġ made the melodies public through Etnika in 2000 at the official launch of an exhibition on traditional Maltese instruments. Jones, born in Bala, North Wales, reportedly collected hundreds of Welsh melodies during his walks around the principality.", "Etnika gave their first public concert during the Evenings on Campus festival on 29 August 2000 at the Atriju Vassalli in the University of Malta, during which the album Nafra was released. The album has eleven instrumental tracks, three of which taken from Edward Jones's publication of circa 1807. It featured Godfrey Mifsud on clarinet, Mario Frendo on violin, David Grech on guitar, Tricia Dawn Williams on piano, Jason Fabri on drums, Joe Camilleri l-Bibi on percussion and Ruben Żahra on żaqq and other traditional instruments. Amongst the most popular tracks were Ragħaj (Shepherd) and l-Għanja tal-Mewġ' (Waves Song). Malta's eminent folklorist Guze Cassar Pullicino was amongst those present."]}, {"page": "1820s in Wales", "response": ["*Edward Jones – Hen Ganiadau Cymru (1820)"]}, {"page": "1820 in Wales", "response": ["*Edward Jones – Hen Ganiadau Cymru"]}, {"page": "1824 in Wales", "response": ["*18 April – Edward Jones, harpist (\"Bardd y Brenin\"), 72"]}, {"page": "1752 in Great Britain", "response": ["*March – Edward Jones (Bardd y Brenin), Welsh harpist (died 1824)"]}, {"page": "1780s in Wales", "response": ["*Edward Jones (Bardd y Brenin) - The Musical and Poetical Relicks of the Welsh Bards"]}, {"page": "1750s in Wales", "response": ["*March - Edward Jones (Bardd y Brenin), harpist (d. 1824)"]}, {"page": "Bardd y Brenin", "response": ["#REDIRECT Edward Jones (harpist) "]}, {"page": "1805 in Wales", "response": ["*Edward Jones (Bardd y Brenin) takes up residence in St James's Palace."]}, {"page": "1804 in Wales", "response": ["*Edward Jones - The Lyric Airs"]}, {"page": "1784 in Wales", "response": ["*Edward Jones (Bardd y Brenin) - The Musical and Poetical Relicks of the Welsh Bards, including first publication of the harp air Dafydd y Garreg Wen"]}, {"page": "1777 in Wales", "response": ["*Harpist Edward Jones performs at Covent Garden."]}, {"page": "1775 in Wales", "response": ["*Edward Jones (Bardd y Brenin) arrives in London."]}, {"page": "Edward Jones (Bardd y Brenin)", "response": ["#REDIRECT Edward Jones (harpist)"]}, {"page": "1752 in Wales", "response": ["* March - Edward Jones (Bardd y Brenin), harpist (died 1824)"]}, {"page": "Llandderfel", "response": ["*Edward Jones (1752–1824), harpist."]}, {"page": "Gwyneddigion Society", "response": ["The Gwyneddigion Society was founded in December 1770 by a group of expatriate Welshmen resident in London, its first formal meeting taking place on 4 February 1771. Foremost of the founders was Owen Jones (known as Owain Myfyr), who became the society's first President. Originally from Llanfihangel Glyn Myfyr, Jones had moved to London as a young man and had earned his fortune as a furrier.Davies 2008, p. 429. Other notable early members included Iolo Morganwg (Edward Williams), William Owen Pughe, Jac Glan-y-gors (John Jones), Siôn Ceiriog (John Edwards), Edward Jones (\"Bardd y Brenin\"), and Twm o'r Nant (Thomas Edwards). Although the society's name (meaning \"Gwynedd scholars\") suggests a particular link with the region of Gwynedd, its affiliations were from the start with the whole of North Wales, and later with all parts of Wales.Leathart 1831, pp. 11–12.Davies 2008, p. 346. "]}, {"page": "List of harpists", "response": ["* Edward Jones"]}, {"page": "Yemmerrawanne", "response": ["While in Mayfair, Yemmerrawanne and Bennelong gave a recital of a native song accompanied by clapsticks. One of their audience, Edward Jones wrote down and published the words and music (in Musical Curiosities, London, 1811), the oldest known published music from Australia."]}, {"page": "Drexel 5611", "response": ["The reprint of Burney auction catalog indicates that the manuscript was purchased for 5s 6d by Edward Jones (1752-1824).A Catalogue of the ... Library of ... Mr. Edward Jones, Bard to the King, Containing an Extremely Rare Collection of Music and Works on Music, Pageants and Archery ... Sold by Auction, by Mr. Sotheby ... Feb. 7th, 1825. [London]: Samuel Sotheby, 1825."]}, {"page": "Drexel 3976", "response": ["thumb|left|Opening inscription On Drexel 3976 by Edward Jones attributing the work to William Hays. \"1373\" is the lot number under which the manuscript was sold at the sale of Edward F. Rimbault's library", "A handwritten statement (now pasted on the initial leaf) by Edward Jones (1752–1824) states: This Book was Purchased from the Collection of the Late Dr. Wm. Hays of Oxford: who caused these Compositions to be fairly transcribed in Score, from various scarce MS. & Ed. Jones, had it thus bound.", "thumb|Second inscription on Drexel 3976 by Edward Jones providing the name \"The Rare Theatrical\" and a brief description of its contents", "Holman observed that the title \"The Rare Theatrical\" was written in Edward Jones's hand and that in this case, Jones's use of the word \"rare\" refers not to scarcity, but to unusually high quality.  He concluded that the title probably originated with the copyist and that Jones's inscription could have preserved that earlier title.", "Upon Jones's passing his collection was sold at auction in 1825.  In the auction catalog of Jones's library, this volume is identified as lot 452.A catalogue of the...library of ... Mr. Edward Jones, Bard to the King, Containing an Extremely Rare Collection of Music and Works on Music, Pageants and Archery...sold by auction, by Mr. Sotheby...Feb. 7th, 1825. [London]: Sotheby, 1825. Musicologist Robert Klakowich hypothesized that it could have been purchased from the Jones's auction by Edward Francis Rimbault's father,  Stephen Francis Rimbault (1773–1837).Robert Klakowich, Keyboard Sources in Mid-Seventeenth-Century England and the French Aspect of English Keyboard Music Ph.D. dissertation (Buffalo, NY: State University of New York at Buffalo, 1985), p. 58. Holman was able to examine Sotheby's copy of the catalogue which contained the names of the buyers.  The buyer for this manuscript is identified only as \"Palmer\" who purchased this volume along with Locke's Cupid and Death and a score for Macbeth (formerly thought to be composed by Locke but now attributed to Richard Leveridge) for four shillings.", "Of the title, the meaning of the word \"theatrical\" refers to a collection music from the theatre, perhaps characteristic of grammatical irregularities sometimes found in the Restoration period. The word \"rare\" was used in the seventeenth century to indicate \"uncommon excellence or merit.\"The third definition provided by Oxford Dictionaries is \"Unusually good or remarkable.\" Oxford Dictionaries, Oxford University Press, accessed 24 March 2016. Holman suggests that if Locke did not designate the collection with that title (not impossible, given his apparently high opinion of himself), it could have derived from an early owner of the collection. Holman states the possibility that Edward Jones might have rescued the original title when he had the collection rebound."]}]}}