{"wiki_id": "http://www.wikidata.org/entity/Q3048547", "itemLabel": "Edward Hawkins", "itemDescription": "Provost of Oriel College, Oxford", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Hawkins", "wikipedia_page": {"main": "Edward Hawkins (27 February 1789 – 18 November 1882) was an English churchman and academic, a long-serving Provost of Oriel College, Oxford known as a committed opponent of the Oxford Movement from its beginnings in his college.", "link_mentions": [{"page": "John Henry Newman", "response": ["In 1828, Newman supported and secured the election of Edward Hawkins as Provost of Oriel over John Keble. This choice, he later commented, produced the Oxford Movement with all its consequences. In the same year Newman was appointed vicar of St Mary's University Church, to which the benefice of Littlemore (to the south of the city of Oxford) was attached, and Pusey was made Regius Professor of Hebrew."]}, {"page": "Oriel College, Oxford", "response": ["DeLaura, David, 'The Oriel Inheritance' (chapter one), Hebrew and Hellene in Victorian England: Newman, Arnold, and Pater (1969) — published by University of Texas Press. Retrieved on 30 September 2006 Tension arose in college since Provost Edward Hawkins was a determined opponent of the Movement.", "The staircases of the interior façade are decorated with cartouches similar to those found in First Quad, and likewise bear the arms of important figures in the college's history; (13) Sir Walter Raleigh who was an undergraduate from 1572 to 1574, (14) John Keble who was a fellow between 1811 and 1835), (archway) Edward Hawkins who was provost from 1828 until 1882 and (15) Gilbert White who was an undergraduate from 1739 until 1743 and a fellow from 1744 until 1793."]}, {"page": "Frederick Scott Archer", "response": ["On the recommendation of Edward Hawkins he trained at the Royal Academy Schools a sculptor and found calotype photography useful as a way of capturing images of his sculptures. "]}, {"page": "Caesar Hawkins", "response": ["He was the son of the Rev. E. Hawkins and grandson of Sir Cæsar Hawkins, 1st Baronet (1711-1786), Serjeant-Surgeon to George II and George III (see Hawkins baronets); and was brother to Edward Hawkins (1789-1882), Provost of Oriel, Oxford. Hawkins was born at Bisley, Gloucestershire. He was educated at Christ's Hospital, and entered St George's Hospital, London, in 1818. He was surgeon to the hospital from 1829 to 1861, and in 1862 was made sergeant-surgeon to Queen Victoria. He was president of the Royal College of Surgeons in 1852 and again in 1861 and delivered the Hunterian oration in 1849. He was also President of the Pathological Society of London in 1853."]}, {"page": "Bampton Lectures", "response": ["* 1840 – Edward Hawkins Connected Principles"]}, {"page": "Robert Wilberforce", "response": ["For a few years he was one of the tutors at Oriel.  The provost Edward Hawkins disliked his religious views, and in 1831 Wilberforce resigned and left Oxford. His release from Oxford gave him the opportunity to study in German areas; his familiarity with German theology and competency as a German scholar being one of the things for which he was most revered among his contemporaries."]}, {"page": "University Church of St Mary the Virgin", "response": ["*1823–1828: Edward Hawkins"]}, {"page": "British Museum Department of Coins and Medals", "response": ["As in other parts of the museum, the department has been able to expand its collection by purchase, donation and bequest. The department has benefited from the munificence of collectors such as Clayton Mordaunt Cracherode, Sarah Banks, Edward Hawkins, Sir Alexander Cunningham and George Bleazby. A significant strength of the collection are British coins from all ages, which have benefited from the ancient law of Treasure Trove.  This has enabled the museum to purchase important hoards of gold and silver coins, many of which were buried during periods of crisis or upheaval. There are approximately 9,000 coins, medals and banknotes on display around the British Museum. More than half of these can be found in the Citi Money Gallery (Gallery 68), while the remainder form part of the permanent displays throughout the museum. Items from the full collection can be seen by the general public in the Study Room by appointment.", "*Edward Hawkins"]}, {"page": "Hawkins (name)", "response": ["*Edward Hawkins (1789–1882), English academic, Provost of Oriel College, Oxford", "*Edward Hawkins (New York politician) (1829–1908), New York politician"]}, {"page": "Henry James Coleridge", "response": ["Gradually various incidents, the secession of Newman, Dr. Renn Hampden's appointment as Regius Professor of Theology, the condemnation and suspension of Edward Bouverie Pusey, the condemnation and deprivation of William George Ward, and the decision in the Gorham case, seriously shook his confidence in the Church of England. In consequence Edward Hawkins, Provost of Oriel, declined to admit him as a college tutor, and he therefore accepted a curacy at Alphington, a parish recently separated from that of Ottery St Mary, the home of his family, where his father had built for him a house and school.  His doubts as to his religious position continued, however, to grow and early in 1852 he determined that he could no longer remain in the Anglican Communion."]}, {"page": "Elmore, Gloucestershire", "response": ["*Edward Hawkins (1789–1882), clergyman and Oxford don, was educated at Elmore Court."]}, {"page": "Dean Ireland's Professor of the Exegesis of Holy Scripture", "response": ["The position of Dean Ireland's Professor of the Exegesis of Holy Scripture was established at the University of Oxford in 1847. This professorship in the critical interpretation or explanation of biblical texts, a field known as exegesis, was instituted by John Ireland, who was Dean of Westminster from 1816 until his death in 1842.  He founded scholarships in his lifetime at the University of Oxford, which are still awarded after an examination to undergraduates \"for the promotion of classical learning and taste\". In his will, he left £10,000 to the university (), with the interest arising to be applied to the professorship.  The first professor, Edward Hawkins, was appointed in 1847. The second Dean Ireland's Professor, Robert Scott, had won an Ireland scholarship in 1833 while studying at Christ Church."]}, {"page": "Oriel Noetics", "response": ["Prominent Noetics who were directly associated with Oriel included the successive Provosts John Eveleigh and Edward Copleston. Others who were Fellows of the College for some period were Thomas Arnold, Joseph Blanco White, Renn Dickson Hampden, Edward Hawkins, and Richard Whately. Baden Powell was an undergraduate at Oriel. John Davison was excluded from the group of Noetics when William Tuckwell wrote about them in the early 20th century, but is counted by Richard Brent in the Oxford Dictionary of National Biography."]}, {"page": "John Davison (priest)", "response": ["In relation to the Oriel Noetics, Davison wrote in support of Edward Copleston's campaign for reform of Oxford teaching, but stood on the conservative side of the group. With Edward Hawkins he was chary of the liberal stance of some Noetics, in particular Richard Whately and Thomas Arnold; but (unlike Hawkins) he was sympathetic to the early moves of John Keble and the Tractarians of the \"Oxford Movement\". Along with Copleston he contributed to the \"liberal Tory\" strand of the debate on the poor laws. Davidson, with Coplestone and Whately, formed a group in the Noetics of political economists in the sense of Robert Malthus."]}, {"page": "Albany James Christie", "response": ["Initially Christie was in favour with the Noetics at Oriel. Over the summer 1838 he was occupied with editorial work on the Library of the Fathers, an Oxford Movement project of E. B. Pusey. This was in a house in St Aldate's, Oxford, shared with James Mozley and Mark Pattison, as well as his brother. As a Fellow Christie worked on the church history of Claude Fleury, with John Henry Newman. Then in 1843 he turned to Ambrose and his work De virginitate, which with other factors aroused suspicion that he had Catholic sympathies. Edward Hawkins, Provost of Oriel, acted on the disquiet of others to put pressure on Christie, often absent from the college. By 1844 it was made clear to Christie that he would not have a recommendation from Hawkins to take Anglican orders. He failed to take deacon's orders from the Bishop of Oxford, for that reason, a decision by Hawkins connected with Tractarian opposition to Renn Hampden. He began to look at a medical career."]}, {"page": "Timeline of Oxford", "response": ["** 14 March: J. H. Newman, Fellow of Oriel, succeeds Edward Hawkins as Anglican vicar of the newly-refitted University Church of St Mary the Virgin, including pastoral care of Littlemore."]}]}}