{"wiki_id": "http://www.wikidata.org/entity/Q3047212", "itemLabel": "Wilfred Rhodes", "itemDescription": "Cricket player of England. (1877-1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/Wilfred_Rhodes", "wikipedia_page": {"main": "Wilfred Rhodes (29 October 1877 – 8 July 1973) was an English professional cricketer who played 58 Test matches for England between 1899 and 1930. In Tests, Rhodes took 127 wickets and scored 2,325 runs, becoming the first Englishman to complete the double of 1,000 runs and 100 wickets in Test matches. He holds the world records both for the most appearances made in first-class cricket (1,110 matches), and for the most wickets taken (4,204). He completed the double of 1,000 runs and 100 wickets in an English cricket season a record 16 times. Rhodes played for Yorkshire and England into his fifties, and in his final Test in 1930 was, at 52 years and 165 days, the oldest player who has appeared in a Test match.\nBeginning his career for Yorkshire in 1898 as a slow left arm bowler who was a useful batsman, Rhodes quickly established a reputation as one of the best slow bowlers in the world. However, by the First World War he had developed  his batting skills to the extent that he was regarded as one of the leading batsmen in England and had established an effective opening partnership with Jack Hobbs. The improvement in Rhodes's batting was accompanied by a temporary decline in his bowling performances, but the loss of key Yorkshire bowlers after the war led to Rhodes resuming his role as a front-line bowler. He played throughout the 1920s as an all-rounder before retiring after the 1930 cricket season. His first appearance for England was in 1899 and he played regularly in Tests until 1921. Recalled to the team in the final Ashes Test of 1926 aged 48, Rhodes played a significant part in winning the match for England who thus regained the Ashes for the first time since 1912. He ended his Test career in the West Indies in April 1930.\nAs a bowler, Rhodes was noted for his great accuracy, variations in flight and, in his early days, sharp spin. Throughout his career he was particularly effective on wet, rain affected pitches where he could bowl sides out for very low scores. His batting was regarded as solid and dependable but unspectacular, and critics accused him of excessive caution at times. However, they considered him to be an  astute cricket thinker. Following his retirement from playing cricket, he coached at Harrow School but was not a great success. His eyesight began to fail from around 1939 to the point where he was completely blind by 1952. He was given honorary membership of the Marylebone Cricket Club (MCC) in 1949 and remained a respected figure within the game until his death in 1973.", "link_mentions": {}}}