{"wiki_id": "http://www.wikidata.org/entity/Q3049434", "itemLabel": "Eille Norwood", "itemDescription": "British actor (1861-1948)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eille_Norwood", "wikipedia_page": {"main": "Eille Norwood (born Anthony Edward Brett, 11 October 1861 – 24 December 1948) was an English stage actor, director, and playwright best known today for playing Sherlock Holmes in a series of silent films.", "link_mentions": [{"page": "Sherlock Holmes", "response": ["Holmes's first screen appearance was in the 1900 Mutoscope film, Sherlock Holmes Baffled. From 1921 to 1923, Eille Norwood played Holmes in forty-seven silent films (45 shorts and two features), in a series of performances that Conan Doyle spoke highly of. 1929's The Return of Sherlock Holmes was the first sound title to feature Holmes. From 1939 to 1946, Basil Rathbone played Holmes and Nigel Bruce played Watson in fourteen U.S. films (two for 20th Century Fox and a dozen for Universal Pictures) and in The New Adventures of Sherlock Holmes radio show. While the Fox films were period pieces, the Universal films abandoned Victorian Britain and moved to a then-contemporary setting in which Holmes occasionally battled Nazis."]}, {"page": "The Hound of the Baskervilles", "response": ["| 1921 ||The Hound of the Baskervilles||  || Maurice Elvey || Eille Norwood || Hubert Willis"]}, {"page": "1921 in film", "response": ["* The Yellow Face (an entry in the British Adventures of Sherlock Holmes film series), directed by William J. Elliott, starring Eille Norwood as Sherlock Holmes (British)"]}, {"page": "The Adventure of the Mazarin Stone", "response": ["A short silent film based on the story was released in 1923 as part of the Sherlock Holmes film series by Stoll Pictures, with Eille Norwood as Holmes and Hubert Willis as Watson."]}, {"page": "The Final Problem", "response": ["\"The Final Problem\" was adapted as a 1923 silent short film as part of the Stoll film series, starring Eille Norwood as Holmes and Hubert Willis as Watson, with Percy Standing as Moriarty."]}, {"page": "The Adventure of the Empty House", "response": ["This story was adapted as a short film released in 1921 as part of the Stoll film series starring Eille Norwood as Holmes."]}, {"page": "The Sign of the Four", "response": ["| 1923 || Film (silent) || The Sign of Four || UK || Maurice Elvey || Eille Norwood || Arthur Cullin"]}, {"page": "A Scandal in Bohemia", "response": ["The story was adapted as a 1921 silent short film as part of the Stoll film series starring Eille Norwood as Holmes."]}, {"page": "The Adventure of Silver Blaze", "response": ["A short film adaptation was released in 1923 starring Eille Norwood in the role of Holmes and Hubert Willis cast as Dr Watson. This was part of the 1921–1923 Sherlock Holmes Stoll film series, specifically the set of films released in 1923 under the series title The Last Adventures of Sherlock Holmes."]}, {"page": "The Adventure of the Bruce-Partington Plans", "response": ["A 1922 entry in the Stoll film series was an adaptation of \"The Adventure of the Bruce-Partington Plans\". It starred Eille Norwood as Sherlock Holmes and Hubert Willis as Dr. Watson, and featured Lewis Gilbert as Mycroft Holmes and Malcolm Tod as Cadogan West."]}, {"page": "The Red-Headed League", "response": ["A 1921 short film was adapted from the story as part of the Stoll film series featuring Eille Norwood as Sherlock Holmes."]}, {"page": "The Adventure of the Greek Interpreter", "response": ["The story was adapted as a 1922 silent short film as part of the Stoll film series. It starred Eille Norwood as Holmes and Hubert Willis as Watson, and featured J. R. Tozer as Harold Latimer and Robert Vallis as Wilson Kemp."]}, {"page": "A Case of Identity", "response": ["This story was the basis for the third Holmes adventure (released in 1921) in the silent Stoll film series starring Eille Norwood."]}, {"page": "The Boscombe Valley Mystery", "response": ["One of the short films in the Sherlock Holmes Éclair film series (1912) was based on the story. In the short film, Georges Tréville played Sherlock Holmes and Mr Moyse played Dr. Watson. Another short film based on the story was released in 1922 as part of the Sherlock Holmes Stoll film series, with Eille Norwood as Sherlock Holmes and Hubert Willis as Dr. Watson."]}, {"page": "The Adventure of Black Peter", "response": ["A silent short film adapted from the story was released in 1922 as part of the Stoll film series starring Eille Norwood as Sherlock Holmes and Hubert Willis as Watson, with Teddy Arundell as Inspector Hopkins, Hugh Buckler as Patrick Cairns, and Fred Paul as Captain Peter Carey."]}, {"page": "The Problem of Thor Bridge", "response": ["\"The Problem of Thor Bridge\" was adapted as a short silent film titled The Mystery of Thor Bridge in 1923 as part of the Sherlock Holmes film series by Stoll Pictures. It starred Eille Norwood as Sherlock Holmes and Hubert Willis as Dr. Watson."]}, {"page": "May Whitty", "response": ["|1892-05-25 ||The Noble Art||Eille Norwood||London||Terry's||Gertie Fullalove"]}, {"page": "Raffles stories and adaptations", "response": ["* The story of A. J. Raffles was first performed on Broadway as Raffles, The Amateur Cracksman on 27 October 1903 at the Princess Theatre. The play moved to the Savoy Theatre in February 1904 and closed out in March of that year racking up 168 performances. It starred Kyrle Bellew as Raffles, a young Clara Blandick as Gwendolyn and E. M. Holland as Captain Bedford. The play was co-written by E. W. Hornung and Eugene Presbrey. It premiered in London on 12 May 1906, with Gerald du Maurier as Raffles. André Brulé starred as Raffles in a production that opened on 14 June 1907 at the Théatre Réjane, Paris. The play opened at the Teatro de la Comedia, Madrid, on 11 February 1908. Eille Norwood played Raffles in a touring version of the play in 1909.\"Eille Norwood\", Who's Who in the Theatre, Volume 3, ed. John Parker, Boston: Small, Maynard, and Co., 1912, p. 372."]}, {"page": "The Man with the Twisted Lip", "response": ["A silent short film version of the story titled The Man with the Twisted Lip was released in 1921. It was made as part of the Stoll film series starring Eille Norwood as Holmes."]}, {"page": "The Adventure of the Blue Carbuncle", "response": ["A silent short film based on the story was released in 1923 as part of the Stoll film series starring Eille Norwood as Sherlock Holmes."]}, {"page": "The Adventure of the Speckled Band", "response": ["*A 1923 silent short film was adapted in the Stoll film series starring Eille Norwood as Holmes."]}, {"page": "The Adventure of the Engineer's Thumb", "response": ["A silent short film adaptation was released in 1923 as part of the Stoll film series starring Eille Norwood as Holmes."]}, {"page": "The Adventure of the Noble Bachelor", "response": ["The story was adapted as a silent short film released in 1921 as part of the Stoll film series starring Eille Norwood as Holmes."]}, {"page": "The Adventure of the Beryl Coronet", "response": ["The story was dramatised as a 1921 silent short film as part of the Stoll film series starring Eille Norwood as Holmes."]}, {"page": "The Adventure of the Copper Beeches", "response": ["Another short film adaptation, The Copper Beeches (1921), was released as part of the Stoll film series starring Eille Norwood."]}, {"page": "Shaftesbury Theatre", "response": ["In September 1919, the Theatre had considerable success with a season of Gilbert and Sullivan operas, presented by the D'Oyly Carte Opera Company. The success of these revivals led to a number of similar seasons over the next few decades, with the Theatre selling out every time. Other productions during this time included The Return of Sherlock Holmes starring Eille Norwood and a season of classical plays, including Medea and Macbeth, starring Sybil Thorndike. In 1928, Fred and Adele Astaire starred in Funny Face with Leslie Henson. The musical was a great success, but was cut short by a gas explosion on High Holborn outside the Theatre."]}, {"page": "The Adventure of the Second Stain", "response": ["A short silent film adapted from the story was released in 1922 as part of the Stoll film series starring Eille Norwood as Sherlock Holmes and Hubert Willis as Watson, and featuring Dorothy Fane as Lady Hope and Wallace Bosco as Eduardo Lucas. Teddy Arundell played Inspector Hopkins in this short film and other films in the series."]}, {"page": "The Adventure of the Gloria Scott", "response": ["The story was adapted as a 1923 short film for the Sherlock Holmes Stoll film series, with Eille Norwood as Sherlock Holmes and Hubert Willis as Dr. Watson."]}, {"page": "The Adventure of the Dying Detective", "response": ["* A 1921 short film adaptation was released in the Stoll film series starring Eille Norwood as Holmes."]}, {"page": "The Adventure of the Cardboard Box", "response": ["The story was adapted as a short silent film titled The Cardboard Box in 1923, as one of the short films in the Sherlock Holmes film series by Stoll Pictures. It starred Eille Norwood as Sherlock Holmes and Hubert Willis as Dr. Watson. Hilda Anthony played Mary Browner and Johnny Butt played James Browner."]}, {"page": "The Adventure of the Six Napoleons", "response": ["The story was adapted as a short silent film titled The Six Napoleons (1922) in the Stoll film series starring Eille Norwood as Sherlock Holmes."]}, {"page": "The Adventure of the Stockbroker's Clerk", "response": ["The story was adapted as a short film as part of the Stoll film series. The film was released in 1922. It featured Eille Norwood as Holmes and Hubert Willis as Watson, with Olaf Hytten as Pycroft and Aubrey Fitzgerald as Pinner."]}, {"page": "The Adventure of the Norwood Builder", "response": ["The story was adapted as a short silent film released in 1922 as part of the Stoll film series starring Eille Norwood as Sherlock Holmes and Hubert Willis as Dr. Watson, with Cyril Raymond as John McFarlane and Teddy Arundell as Inspector Hopkins."]}, {"page": "The Adventure of the Yellow Face", "response": ["The story was adapted as a short film released in 1921 as part of the Stoll film series, featuring Eille Norwood as Holmes."]}, {"page": "The Adventure of the Reigate Squire", "response": ["The story was adapted as a short film, also titled The Reigate Squires, in 1922 as part of the Stoll film series starring Eille Norwood as Holmes."]}, {"page": "The Adventure of the Crooked Man", "response": ["The story was adapted as a 1923 silent short film as part of the Stoll film series. It starred Eille Norwood as Holmes and Hubert Willis as Watson, and featured Gladys Jennings as Mrs Barclay and Dora De Winton as Miss Morrison."]}, {"page": "The Adventure of the Resident Patient", "response": ["The story was adapted as a 1921 silent short film as part of the Stoll film series. It starred Eille Norwood as Holmes and Hubert Willis as Watson, and featured Judd Green as Blessington."]}, {"page": "The Adventure of the Naval Treaty", "response": ["Another short film based on the story was released in 1922 as part of the Sherlock Holmes Stoll film series, with Eille Norwood as Sherlock Holmes and Hubert Willis as Dr. Watson."]}, {"page": "The Adventure of the Dancing Men", "response": ["* Eille Norwood starred as Holmes in a 1923 short film adapted from the story as part of the Stoll film series."]}, {"page": "The Adventure of the Solitary Cyclist", "response": ["The story was adapted as a 1921 short silent film in the Stoll film series starring Eille Norwood as Sherlock Holmes."]}, {"page": "The Adventure of the Priory School", "response": ["A silent short film based on the story was released in 1921 as part of the Sherlock Holmes film series by Stoll Pictures. Eille Norwood played Sherlock Holmes and Hubert Willis played Dr. Watson."]}, {"page": "The Adventure of Charles Augustus Milverton", "response": ["The story was adapted as a short silent film titled Charles Augustus Milverton (1922) in the Stoll film series starring Eille Norwood as Sherlock Holmes."]}, {"page": "The Adventure of the Three Students", "response": ["A silent short film adapted from the story was released in 1923 as part of the Stoll film series starring Eille Norwood as Sherlock Holmes and Hubert Willis as Watson, with William Lugg as Hilton Soames and A. Harding Steerman as Bannister."]}, {"page": "The Adventure of the Golden Pince-Nez", "response": ["A short silent film adapted from the story was released in 1922 as part of the Stoll film series starring Eille Norwood as Sherlock Holmes and Hubert Willis as Watson, with Teddy Arundell as Inspector Hopkins, Norma Whalley as Anna Coram, and Cecil Morton York as Professor Coram."]}, {"page": "The Adventure of the Missing Three-Quarter", "response": ["A short silent film adapted from the story was released in 1923 as part of the Stoll film series starring Eille Norwood as Sherlock Holmes and Hubert Willis as Dr Watson."]}, {"page": "The Adventure of the Abbey Grange", "response": ["The story was adapted as a short silent film titled The Abbey Grange (1922) in the Stoll film series starring Eille Norwood as Sherlock Holmes."]}, {"page": "The Adventure of Wisteria Lodge", "response": ["*A short silent film titled The Tiger of San Pedro (1921) was based on the story. It was one of the short films in the Sherlock Holmes film series by Stoll Pictures, and starred Eille Norwood as Sherlock Holmes and Hubert Willis as Dr. Watson."]}, {"page": "The Adventure of the Red Circle", "response": ["The story was adapted as a short silent film in 1922. It was one of the short films in the Sherlock Holmes film series by Stoll Pictures, and starred Eille Norwood as Sherlock Holmes and Hubert Willis as Dr. Watson."]}, {"page": "The Adventure of the Devil's Foot", "response": ["\"The Devil's Foot\" served as the basis for a 1921 short film starring Eille Norwood as Sherlock Holmes and Hubert Willis as Dr. Watson."]}]}}