{"wiki_id": "http://www.wikidata.org/entity/Q3051023", "itemLabel": "Thomas Heatherwick", "itemDescription": "English designer and architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Heatherwick", "wikipedia_page": {"main": "Thomas Alexander Heatherwick,  (born 17 February 1970) is an English designer and the founder of London-based design practice Heatherwick Studio. He has been described as one of Britain's most significant designers. He works with a team of around 200 architects, designers and makers from a studio and workshop in King's Cross, London.Heatherwick has been involved in the design of many projects, some controversial, including the Olympic Cauldron, the New Routemaster bus, and the UK pavilion at Expo 2010. His other projects have included the renovation of the Hong Kong Pacific Place, the now-cancelled Garden Bridge, a proposed plan for a biomass power station in BEI-Teesside, and the Vessel in New York City.", "link_mentions": [{"page": "Bombay Sapphire", "response": ["Planning permission was granted in February 2012, and the centre opened to the public in the autumn of  2014.A first glimpse of the Bombay Sapphire distillery Gintime 19 September 2014, The visitor centre included a new construction by Thomas Heatherwick of two glasshouses for plants used as botanicals in the production of Bombay Sapphire gin."]}, {"page": "Manchester Metropolitan University", "response": ["* Thomas Heatherwick – designer"]}, {"page": "Nanyang Technological University", "response": [" The Learning Hub building, also called the Hive, featured in \"Times Higher Education\" report, has been designed by a British designer Thomas Heatherwick."]}, {"page": "Joanna Lumley", "response": ["From 2012 to 2016, Lumley supported the proposals for a pedestrian \"Garden Bridge\" across the Thames in London, in collaboration with the designer Thomas Heatherwick and former Mayor of London Boris Johnson. The proposals foundered having already spent over £40 million of public money."]}, {"page": "Paddington", "response": ["The Rolling Bridge at the Paddington Basin was designed by Thomas Heatherwick, who wanted to create a bridge that, instead of breaking apart to let boats through, would \"get out of the way\" instead. Heatherwick's website cites the  \"fluid, coiling tails of the animatronic dinosaurs of Jurassic Park\" as the initial influence behind the Bridge."]}, {"page": "Kings Cross, London", "response": ["Relatively cheap rents and a central London location made the area attractive to artists and designers and both Antony Gormley and Thomas Heatherwick established studios in the area. In late 1980s, a group of musicians, mechanics, and squatters from Hammersmith called Mutoid Waste Company moved into Battlebridge Road warehouse. They built huge industrial sculptures out of scrap metal and held raves. In 1989 they were evicted by police."]}, {"page": "Royal College of Art", "response": ["Alumni from the twentieth and twenty-first centuries include the sculptors Barbara Hepworth and Henry Moore, painters Frank Auerbach, David Hockney, Bridget Riley, Sir Peter Blake, Gavin Turk and Charles Tunnicliffe, artists Jake and Dinos Chapman, Tracey Emin and R. B. Kitaj, fashion designers Ossie Clark and Zandra Rhodes, industrial designers James Dyson, Sir Jonathan Ive and David Mellor, film directors Tony and Ridley Scott, writer Travis Jeppesen, designers Thomas Heatherwick and architect Sir David Adjaye, prominent member of the suffragette movement Sylvia Pankhurst, the musician Ian Dury and the actor Alan Rickman."]}, {"page": "City of Manchester Stadium", "response": ["From 2005 to 2009 a Thomas Heatherwick sculpture, B of the Bang, was situated to the southeast of the stadium at the junction of Ashton New Road and Alan Turing Way. Built after the Commonwealth Games to commemorate them, it was the tallest sculpture in the United Kingdom. However, numerous structural problems led to the 184 ft. sculpture being dismantled in 2009 for safety reasons. In 2014, money recovered by the Manchester City Council as a result of lengthy legal battles consequent to this debacle was used to fund a new £341,000 public sculpture a few hundred yards further south."]}, {"page": "Paternoster Square", "response": ["At the north end of the square is the bronze Paternoster (also known as Shepherd and Sheep) by Dame Elisabeth Frink. The statue was commissioned for the previous Paternoster Square complex in 1975, and was replaced on a new plinth following the redevelopment. Another sculpture in the square is Paternoster Vents by Thomas Heatherwick."]}, {"page": "Sevenoaks School", "response": ["* Thomas Heatherwick, designer"]}, {"page": "B of the Bang", "response": ["B of the Bang was a sculpture by Thomas Heatherwick next to the City of Manchester Stadium in Manchester, England, United Kingdom, which was commissioned to mark the 2002 Commonwealth Games; it was one of the tallest structures in Manchester and the tallest sculpture in the UK until the completion of Aspire in 2008. It was taller and leaned at a greater angle than the Leaning Tower of Pisa. The sculpture took its name from a quotation of British sprinter Linford Christie, in which he said that he started his races not merely at the \"bang\" of the starting pistol, but at \"the B of the Bang\".", "Prior to the construction of Aspire at the University of Nottingham, B of the Bang was Britain's tallest sculpture at well over twice the height of the Angel of the North, which stands at . It was designed to look like an exploding firework and was taller and leaned at a greater angle than the Leaning Tower of Pisa. It was commissioned by New East Manchester Limited to commemorate the 2002 Commonwealth Games. The design was selected by a panel consisting of both local residents and art experts via a competition in 2002 and was designed by Thomas Heatherwick.", "The sculpture was constructed in Sheffield by Thomas Heatherwick Studio, Packman Lucas, Flint and Neill and Westbury Structures. It was approved at the start of 2003, with the central core arriving in Manchester on 13 June 2004. This was the largest load that could be transferred via road from the factory, and required a police escort. This central core was lifted into place in August 2004, after which the 180 spikes could begin being attached. Early estimates had given an optimistic completion date of July 2003, which contributed to the sculpture gaining the nickname G of the Bang.", "It was announced in October 2007 that Manchester City Council were taking legal action against the makers of the sculpture, with the aim of completing the necessary repairs to the sculpture. In November 2008 this culminated in an out-of-court settlement being reached between Manchester City Council, the project's designers Thomas Heatherwick Studio Ltd, and the engineering and construction subcontractors Packman Lucas Ltd, Flint and Neill Partnership and Westbury Structures Ltd. The agreement was to pay the council £1.7m in damages for breach of contract and negligence.", "Category:Thomas Heatherwick"]}, {"page": "St Helens, Merseyside", "response": ["After the 2012 Summer Olympics opening ceremony, Frank Cottrell Boyce the creative writer behind Danny Boyle's opening ceremony revealed that the town motto was a significant influence to the Olympic cauldron designed by Thomas Heatherwick. The cauldron petals, once lit, started on the floor and rose up to form one torch."]}, {"page": "Nasher Sculpture Center", "response": ["Thomas Heatherwick / Anna-Bella Papp / Sarah Thorton / Tony Tasset / David Bates / Not Vital / Bettina Pousttchi / Mark Grotjahn / Tod Lippy / Liz Glynn"]}, {"page": "Terence Conran", "response": ["Sir Terence Orby Conran  (4 October 1931 – 12 September 2020) was an English designer, restaurateur, retailer and writer. He founded the Design Museum in London. The British designer Thomas Heatherwick said that Conran \"moved Britain forward to make it an influence around the world.\" Edward Barber, from the British design team Barber & Osgerby, described Conran as \"the most passionate man in Britain when it comes to design, and his central idea has always been 'Design is there to improve your life.'\" The satirist Craig Brown once joked that before Conran \"there were no chairs and no France.\""]}, {"page": "2012 Summer Olympics", "response": ["The relay focused on National Heritage Sites, locations with sporting significance, key sporting events, schools registered with the Get Set School Network, green spaces and biodiversity, Live Sites (city locations with large screens), and festivals and other events. Dumfries and Galloway was the only Region in the whole of the United Kingdom that had the Olympic Torch pass through it twice. A group of young athletes, nominated by retired Olympic athletes, ran the torch around the stadium. These torchbearers were Callum Airlie, Jordan Duckitt, Desiree Henry, Katie Kirk, Cameron MacRitchie, Aidan Reynolds, and Adelle Tracey. Together the torchbearers each lit a petal which spread the fire to the 204 petals of the cauldron, representing the countries that participated in the Games. The cauldron was designed by Thomas Heatherwick."]}, {"page": "Imagine (TV series)", "response": ["* \"The Ingenious Thomas Heatherwick\""]}, {"page": "Christian Louboutin", "response": ["Louboutin entered the fragrance market in 2016 with the release of three parfums: Bikini Questa Sera, with jasmine and tuberose notes; Tornade Blonde, with rose and cassis notes; and Trouble in Heaven, with patchouli and amber notes. The bottles were designed by Thomas Heatherwick's studio, which was also responsible for designing the 2012 Olympic cauldron."]}, {"page": "Steve Shirley", "response": ["In 2012, Shirley donated the entirety of her art collection, including works by Elisabeth Frink, Maggi Hambling, Thomas Heatherwick, Josef Herman and John Piper to Prior's Court School and the charity Paintings in Hospitals."]}, {"page": "Worth Abbey", "response": ["In 2011, the monastic community undertook a year-long renovation and refurbishment of the church led by the equally renowned English architect Thomas Heatherwick. The renovated church featured new lighting and a sound system that facilitated worship, along with newly constructed woodwork. The pews and monastic choir appointments were made of dark American walnut wood that also used distinctive ash wood embedded in the features."]}, {"page": "Worth School", "response": ["During 2011 extended sports facilities were opened, including the school's first Astroturf. In the same year the Abbey Church, used daily by the school for a wide variety of functions, was extensively refurbished. The Abbey Church (constructed between 1965 and 1975) was designed by the English architect Francis Pollen, and \"is considered by many to be the best example of his style\". The refurbished interior, by Thomas Heatherwick Studios, won the West Sussex County Council Design and Sustainability Scheme Restoration Award for 2011. Judges found that \"Thoughtful design and superb execution make for a wonderful restoration, proving that in the right hands contemporary architecture can be used to create an exceptional place for prayer and contemplation\"."]}, {"page": "Southorn Playground", "response": ["Wan Chai District Council and the British Council invited English designer Thomas Heatherwick and urban renewal specialist Fred Manson to improve the playground in 2005. The proposal aimed to redevelop the space through a public art intervention. It was hoped that the project would serve as a model of community participation in public art in Hong Kong. The project aimed to generally improve and update the playground, and make it an artwork in its own right."]}, {"page": "Broadmarsh", "response": ["In December 2021, the scheme for redevelopment was reported.Nottingham Broad Marsh vision hailed as 'extraordinary' as new plans unveiled for the first time Nottinghamshire Live, 7 December 2021. Retrieved 8 December 2021 The concept, headed by designer Thomas Heatherwick, allows for retention of some structural remains of the centre, as a framework and basis for extensive soft landscaping, provisionally entitled The Frame.Broad Marsh: Vision for shopping centre 'frame' creating truly unique space 'like nothing else in the world' Nottinghamshire Live, 7 December 2021. Retrieved 8 December 2021"]}, {"page": "Hudson Yards, Manhattan", "response": ["The largest of the projects made possible by the rezoning is the  multiuse Hudson Yards real estate development by Related Companies and Oxford Properties, which is being built over the West Side Rail Yard. Construction began in 2012 with the groundbreaking for 10 Hudson Yards, and is projected to be completed by 2024. According to its master plan, created by Kohn Pedersen Fox Associates, the Hudson Yards development would include 16 skyscrapers to be constructed in two phases. Architects including Skidmore, Owings, and Merrill, Thomas Heatherwick, Roche-Dinkeloo, and Diller Scofidio + Renfro contributed designs for individual structures. Major office tenants include or will include fashion company Tapestry, gym chain Equinox Fitness, and financial company BlackRock.", "The platform atop which the Related development was built includes a  public square. In the middle of the square is Vessel, a 16-story structure of freestanding, connected staircases designed by Thomas Heatherwick."]}, {"page": "Pacific Place (Hong Kong)", "response": ["Pacific Place underwent a major renovation that was completed in 2011. It involved interior, exterior, and architectural changes designed by Thomas Heatherwick which cost more than HK$2.1 billion.Swire News, 2008 Autumn, page 4"]}, {"page": "Blue Carpet", "response": ["The Blue Carpet is a piece of public art in Newcastle-Upon-Tyne, England, designed by Thomas Heatherwick. It is an area of public open space in front of the Laing Art Gallery, close to the main shopping and nightclub areas, paved with glass-and-resin slabs which curve up at the space's edges, giving the appearance of a fabric carpet. Although classified as a piece of public art, it is closer to an urban design feature.", "Category:Thomas Heatherwick"]}, {"page": "Garden Bridge", "response": ["The Garden Bridge project was an unsuccessful private proposal for a pedestrian bridge over the River Thames in London, England. Originally an idea of Joanna Lumley, and strongly supported by then-Mayor of London, Boris Johnson, the designer Thomas Heatherwick worked with Arup Group on a proposal by Transport for London (TfL) for a new bridge across the Thames between Waterloo Bridge and Blackfriars Bridge. The proposed concrete, steel, cupronickel clad structure was intended to carry pedestrians, with no cycles or other vehicles. It was to have been located some  from Waterloo Bridge and  from Blackfriars Bridge, and have included some areas of planting. The project was to include a commercial building, built on former green space at the southern end of the bridge. The bridge was intended to be funded by raising over £140 million of private money (including taxpayer funding through charitable gift aid) and £60 million of promised public money, of which £30m was from Transport for London (£20m of this to be repaid over 55 years) and £30m from the Department for Transport, adding up to projected funding of over £200m. In January 2017, the trustees of the prospective owner of the bridge, the Garden Bridge Trust, stated that costs would \"substantially exceed\" an earlier revised total of £185m and, in April 2017, a report by Margaret Hodge MP concluded, on the basis of the Garden Bridge Trust's own evidence, that the cost would be over £200m.", "Writing in The Guardian in February 2016, Ian Jack contrasted the £60m taxpayer support for the project with the closure of five Lancashire museums – two of which are nationally important – and 40 libraries.  Jack described the bridge as unwanted and unnecessary and the closures as \"cultural disembowelment\". He asked whether a meeting between Joanna Lumley, a friend of designer Thomas Heatherwick and Boris Johnson had played a part. Jane Duncan, president of the Royal Institute of British Architects requested the project be put on hold pending an investigation of the tendering process for the appointments of Heatherwick Studio and Arup. Ian Jack followed up in May with another article calling the bridge an oddity born of the \"chumocracy\", and correspondents from outside London were equally scathing.", "On 16 February 2016, Walter Menteth of Project Compass CIC, a procurement intelligence service, published a detailed report on the irregularities in the procurement leading to the appointment of Arup Group and Thomas Heatherwick by Transport for London; the report concluded that an independent investigation would be appropriate before the public made any further financial commitment to the project.", "Category:Thomas Heatherwick"]}, {"page": "Lost artworks", "response": ["| Dismantled || 2005 || B of the Bang || Thomas Heatherwick || || Dismantled and removed; parts remain in storage || 2009"]}, {"page": "Great British Menu", "response": ["| Northern Ireland || Phelim O'Hagan || Gemma Austin || Andy Scollick || Paul Cunningham || Daniel Clifford || Thomas Heatherwick"]}, {"page": "The Rolling Bridge", "response": ["The Rolling Bridge was conceived by Thomas Heatherwick. It consists of eight triangular sections hinged at the walkway level and connected above by two-part links that can be collapsed towards the deck by hydraulic cylinders mounted vertically between the sections. When extended, it resembles a conventional steel and timber footbridge, and is 12 metres long. To allow the passage of boats, the hydraulic pistons are activated and the bridge curls up until its two ends join, to form an octagonal shape measuring one half of the waterway's width at that point.", "Category:Thomas Heatherwick"]}, {"page": "Heatherwick Studio", "response": ["#REDIRECT Thomas Heatherwick"]}, {"page": "Pablo Ganguli", "response": ["Asia Tatler and the Wall Street Journal announced that Ganguli would present Liberatum in Hong Kong in 2012.'Pablo Ganguli Brings Liberatum To Hong Kong', Asia Tatler, 6 February 2012 Participants include Pharrell Williams, Rossy de Palma, Paul Schrader, Thomas Heatherwick, Daniel Wu and Khalil Fong.'Pharrell Williams, V.S. Naipaul, Marianne Faithfull on Liberatum’s Lineup', The Wall Street Journal, 14 March 2012 Vogue China editor in chief said it was one of the very few free cultural events open to the public. The event was reportedly a wild ride with Pharrell Williams as the headliner.'Nobel Laureates Take Hong Kong', Interview"]}, {"page": "London Design Festival", "response": ["Previous winners are Dame Vivienne Westwood, Tom Dixon, Daniel Charny, Ross Atkin, Neri Oxman, Hussein Chalayan, Grace Wales Bonner, Eva Jiricna, Es Devlin, Paul Priestman, Margaret Calvert, Julian Melchiorri, Sir David Adjaye, Kenneth Grange, Bethan Laura Wood, Daan Roosegaard, Edward Barber and Jay Osgerby, Marjan Van Aubel, Peter Brewin and Will Crawford, the Bourellec brothers, Nicolas Roope, Roland Lamb, Lord Richard Rogers, Daniel Rybakken, Dieter Rams, David Constantine, Alexandra Daisy Ginsberg, Jane Ni Dhulchaointigh, Rosario Hurtado and Roberto Feo, Vidal Sassoon, Sir Ken Adam, Peter Saville, Marc Newson, Sir Paul Smith, Dame Zaha Hadid, Thomas Heatherwick, Sir Terence Conran, and Ron Arad."]}, {"page": "Jochen Zeitz", "response": ["In partnership with the Victoria & Alfred Waterfront, Zeitz founded the Zeitz Museum of Contemporary Art Africa (Zeitz MOCAA), located in the historic grain silo in Cape Town's Victoria & Alfred Waterfront. The museum features 9,500 square meters (102,000 square feet) of space over nine floors, including 6,000 square meters (65,000 square feet) for displays. In 2014, Thomas Heatherwick was chosen to design the conversion of the 1920s granary into a museum, including 80 galleries, 18 education rooms, a rooftop sculpture garden as well as storage and conservation areas, a restaurant, a coffee shop, and bookstores. The official public opening of the museum took place in September 2017.http://www.engineeringnews.co.za/article/local-partners-for-va-waterfront-grain-silo-conversion-announced-2014-05-30/rep_id:4136 The opening ceremony was presided over by Archbishop Emeritus Desmond Tutu. In the first year of opening the Zeitz MOCAA was visited by over 300000 people and named one of the best museums in the world by the Time Magazine."]}, {"page": "Mary Portas", "response": ["Her next role brought Portas her first taste of fame and public acclaim, as creative director of Harvey Nichols. Portas is credited with turning Harvey Nichols into a leading modern fashion brand. She created the groundbreaking Harvey Nichols window displays that became part of the guided tours of London — one of her most famous displays was \"Autumn Intrusion\" - a commission by artist Thomas Heatherwick that won a D&AD Gold award in 1997. She then persuaded the store's owners to use younger designers, and gained publicity in the BBC's Absolutely Fabulous series in the 1990s, after promising writer and star of the show Jennifer Saunders the run of the store for research in return for Saunders namechecking the business. By the age of 30, Portas was a member of the company's board."]}, {"page": "Architecture of Manchester", "response": ["Thomas Heatherwick's B of the Bang was a -high metal sculpture commissioned for the 2002 Commonwealth Games. Erected near the City of Manchester Stadium in Eastlands, the sculpture was beset by structural problems and dismantled in 2009."]}, {"page": "Longchamp (company)", "response": ["In 2004, Longchamp began its first collaboration with independent designer, Thomas Heatherwick. Heatherwick first designed the best-selling Zip Bag, a handbag constructed of a long zipper. The success of the Zip Bag led to Heatherwick's designing of the Longchamp's New York City flagship store.", "In 2006, the company opened a flagship store, \"La Maison Unique\" in New York City's SoHo district. This store was the brand's biggest store and was designed by Thomas Heatherwick who also created a handbag called the Zip Bag, which became one of the company's best selling items."]}, {"page": "Haunch of Venison", "response": ["Artists represented by Haunch of Venison include Rina Banerjee, Justin Mortimer, Thomas Heatherwick, Jitish Kallat, Jamie Shovlin, Joana Vasconcelos\"I Will Survive, an exhibition by Joana Vasconcelos at Haunch of Venison Gallery, London\", Daily Telegraph. Retrieved 21 July 2010.  and Turner"]}, {"page": "Bjarke Ingels", "response": ["In Denmark, Ingels became well known after designing two housing complexes in Ørestad: VM Houses and Mountain Dwellings. In 2006 he founded Bjarke Ingels Group, which grew to a staff of 400 by 2015, with noted projects including the 8 House housing complex, VIA 57 West in Manhattan, the Google North Bayshore headquarters (co-designed with Thomas Heatherwick), the Superkilen park, and the Amager Resource Center (ARC) waste-to-energy plant – the latter which incorporates both a ski slope and climbing wall on the building exterior.", "In 2015, Ingels began working on a new headquarters for Google in Mountain View, California with Thomas Heatherwick, the British designer. Bloomberg Businessweek hailed the design as \"The most ambitious project unveiled by Google this year...\" in a feature article on the design and its architects. Later that year, BIG was chosen to take up the design of Two World Trade Center, one of the towers replacing the Twin Towers. The work had initially been entrusted to the British firm Foster and Partners, but was revoked and given back to Foster in 2019.  "]}, {"page": "Prince Philip Designers Prize", "response": ["|data-sort-value=\"Heatherwick, Thomas\"|Thomas Heatherwick RDI"]}, {"page": "Pete Silver & Will McLean", "response": ["*Simon Allford, Will Alsop, Michael Ashby, Philip Ball, Gianni Botsford, Dave Carr-Smith, Andrew Cripps, Alex De Rijke, John Frazer, Thomas Heatherwick, Richard Horden, Eva Jiricna, Patrick Keiller, Tim Macfarlane, Ben Morris, Martin Pawley, Sergio Pellegrino (James Watt International Medal), Cedric Price, Esther Rivas Adrover, Rupert Sheldrake, Julien Vincent, John Zerning."]}]}}