{"wiki_id": "http://www.wikidata.org/entity/Q3057068", "itemLabel": "Walter Citrine, 1st Baron Citrine", "itemDescription": "British trade unionist (1887-1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Citrine,_1st_Baron_Citrine", "wikipedia_page": {"main": "Walter McLennan Citrine, 1st Baron Citrine of Wembley,  (22 August 1887 – 22 January 1983) was one of the leading British and international trade unionists of the twentieth century and a notable public figure.  Yet, apart from his renowned guide to the conduct of meetings, ABC of Chairmanship, he has been little spoken of in the history of the labour movement. More recently, labour historians have begun to re-assess Citrine's role.By redefining the role of the Trades Union Congress (TUC), whose General Secretary he was from 1926 until 1946, he helped create a far more coherent and effective union force. This, in turn, transformed the Labour Party into a substantial social democratic force for government from 1939. Citrine was also President of the then influential International Federation of Trade Unions (IFTU) from 1928 until 1945. He was also joint Secretary of the key TUC/ Labour Party National Joint Council from 1931 and a director of the UK Daily Herald newspaper until 1946 which was then a mass circulation Labour paper with considerable influence. In these important roles, Citrine was highly influential in the industrial and political wings of the labour movement. His prominent involvement helped secure its recovery after the deep crisis and crushing defeat which followed the fall of the British Labour government in 1931. In particular, he played a key role from the mid-1930s in reshaping Labour's foreign policy, especially as regards re-armament and through the all-party Anti-Nazi Council in which he worked with Winston Churchill.Citrine strengthened the TUC's influence over the Labour Party. He opposed plans by the Labour Government in 1931 to cut unemployment benefits. After Ramsay MacDonald formed a coalition with the Conservatives to force his policies through, Citrine led the campaign to have him expelled from the party. Citrine later supported the Attlee government's policy of nationalisation and served on the National Coal Board and served as chairman of the Central Electricity Board 1947–57. He was granted a peerage in 1947.\nCitrine authored ABC of Chairmanship, regarded by many in the labour movement as the \"bible\" of committee chairmanship. His autobiography Men and Work was published in 1964 and the second volume, Two Careers, in 1967. His personal papers are held at the London School of Economics.\n\n", "link_mentions": [{"page": "1983", "response": ["* January 22 – Walter Citrine, 1st Baron Citrine, British trade unionist (b. 1887)"]}, {"page": "1887", "response": ["* August 22 – Walter Citrine, 1st Baron Citrine, British trade unionist (d. 1983)"]}, {"page": "Walter McLennan Citrine", "response": ["#REDIRECT Walter Citrine, 1st Baron Citrine"]}, {"page": "Walter Citrine", "response": ["#REDIRECT Walter Citrine, 1st Baron Citrine"]}, {"page": "Walter Mclennan Citrine, 1st Baron Citrine", "response": ["#REDIRECT Walter Citrine, 1st Baron Citrine"]}, {"page": "Walter McLennan Citrine, 1st Baron Citrine", "response": ["#REDIRECT Walter Citrine, 1st Baron Citrine"]}, {"page": "1983 in the United Kingdom", "response": ["* 22 January – Walter Citrine, 1st Baron Citrine, trade unionist (born 1887)"]}, {"page": "Brunswick Wharf Power Station", "response": ["The first phase of the station was supposed to be commissioned in 1948 but in fact did not start supplying electricity until 1952. The station was officially opened by British Electricity Authority (BEA) chairman Walter Citrine, 1st Baron Citrine in 1954 but was not completed until 1956. In 1957 the alternators were uprated to produce a total of 118 MW.   The final configuration of the station was 4 x 55 MW generators and 2 x 60 MW hydrogen cooled generators. Eleven boilers were installed. The boilers were manufactured by Clarke, Chapman & Co. and by John Brown & Co. The maximum steam capacity of the boilers was 3,520,000 lb/hr (443 kg/s). Steam pressure and temperature at the turbine stop valves was 900 psi (62 bar) and 482°C.CEGB Statistical Yearbook (various dates). CEGB, London."]}, {"page": "Citrine", "response": ["* Walter Citrine, 1st Baron Citrine (1887–1983), British trade unionist and politician"]}, {"page": "Report of West India Royal Commission (Moyne Report)", "response": ["The Royal Commission was chaired by Walter Guinness, 1st Baron Moyne. Its further members were composed of experts who could offer substantial insight into the Caribbean crisis including the former governor of Jamaica from 1926 to 1932, Sir Edward Stubbs; Dr. Mary Blacklock, an expert in tropical medicine; Professor F. Engledow, an expert in the field of agriculture; economist Hubert Henderson; Dame Rachel Crowdy, a distinguished social reformer; Sir Percy MacKinnon, a representative for Parliament's financial interests; Sir Walter Citrine, 1st Baron Citrine, President of the International Federation of Trade Unions; and two members of parliament, Morgan Jones from the Labour Party and Conservative Ralph Assheton. According to Johnson, Blacklock's and Crowdy's appointments are important because the Royal Commission required women who would offer a greater understanding towards the plight of women in the West Indies."]}]}}