{"wiki_id": "http://www.wikidata.org/entity/Q30591593", "itemLabel": "Jez Bond", "itemDescription": "British theatre director", "wikipedia_url": "https://en.wikipedia.org/wiki/Jez_Bond", "wikipedia_page": {"main": "Jez Bond (born 1977) is a British theatre director. One of the cohort of artistic directors born in the 1960s and 70s who are now running significant UK theatres, he opened the Park Theatre in Finsbury Park, London in 2013.", "link_mentions": [{"page": "Charles J. Fourie", "response": ["Big Boys was staged by the LA Ensemble in Los Angeles in 1993 and at the Warehouse Theatre (London) in 2002 directed by British director Jez Bond, and was a Time Out critics' choice. The Lighthouse Keeper's Wife was presented at the John Caird 'New Director's initiative at the Gatehouse theatre and at the Old Vic's 'New Voices' season (London) and has since been adapted for television.", "He has also been actively involved with promoting plays by fellow South African writers abroad and collaborated on 'A Season in South Africa' staged-readings at The Old Vic Theatre with British director Jez Bond; hosted by Antony Sher, John Kani and Janet Suzman."]}, {"page": "Park Theatre (London)", "response": ["In November 2009, Artistic Director Jez Bond and Creative Director Melli Marie acquired a disused three-storey office building at 11-13 Clifton Terrace. Planning permission was granted in October 2010. The theatre was designed by David Hughes. Following a campaign supported by prominent theatre figures such as Sir Ian McKellen and Alan Rickman, the £2.6m cost was met by private donors and by the sale of flats built above the theatre.", "Reflecting the theatre's unsubsidized status as a registered charity, the majority of plays at Park Theatre have been financed by external production companies, with the theatre acting as the host venue. From the beginning, however, Artistic Director Jez Bond's intention was to stage an increasing number of in-house productions as funds become available, leading the theatre to devise innovative fundraising strategies."]}, {"page": "Ian McKellen on Stage: With Tolkien, Shakespeare, Others and YOU", "response": ["McKellen first presented the show as Ian McKellen with Shakespeare, Tolkien, Others & You at the Park Theatre, London from 3 to 9 July 2017, directed by Jez Bond. "]}]}}