{"wiki_id": "http://www.wikidata.org/entity/Q3057301", "itemLabel": "Ernie Copland", "itemDescription": "Scottish footballer (1927-1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernie_Copland", "wikipedia_page": {"main": "Ernie Copland (14 October 1924 - December 1971) was a Scottish footballer who played for Arbroath, Dundee and Raith Rovers. He was selected for Scotland's 1954 FIFA World Cup squad, but did not travel to the finals and never actually played for the national side.\nAlthough selected for the 22 man squad for the 1954 FIFA World Cup, the Scottish Football Association only budgeted to take 13 players (including only one goalkeeper) to the finals in Switzerland.  Copland was one of the players who stayed at home on reserve, with the likes of Bobby Combe and Jimmy Binning.Ernie was chosen as reserve in the Scottish team for the World Cup qualifiers in 1957, and travelled to Basle (Switzerland), Stuttgart (Germany), and Madrid (Spain), but did not play.", "link_mentions": [{"page": "Montrose Roselea F.C.", "response": ["*Ernie Copland"]}, {"page": "Bobby Combe", "response": ["Combe was also a Scotland internationalist, earning three caps in 1948. He made his debut in a 2–0 defeat by England and also appeared against Switzerland and Belgium that year, scoring against the latter. He was selected in Scotland's 22 man squad for the 1954 FIFA World Cup but the Scottish Football Association only budgeted to take 13 players (including only one goalkeeper) to the finals in Switzerland. Combe was one of the nine who did not travel, along with the likes of Ernie Copland and Jimmy Binning. Inside forward George Hamilton was also on reserve, but travelled after Bobby Johnstone withdrew through injury."]}, {"page": "Jimmy Binning", "response": ["Binning was recognised internationally when he was given a Scottish League XI cap in 1954, against the English League at Stamford Bridge. Although selected for the 22 man squad for the 1954 FIFA World Cup, the Scottish Football Association only budgeted to take 13 players (including only one goalkeeper) to the finals in Switzerland. Binning was one of the players who stayed at home on reserve with the likes of Bobby Combe and Ernie Copland. Ex-Queens inside forward George Hamilton did travel after Bobby Johnstone with drew through injury."]}, {"page": "Copland (surname)", "response": ["*Ernie Copland (1924-1971), Scottish footballer"]}]}}