{"wiki_id": "http://www.wikidata.org/entity/Q30607687", "itemLabel": "Robert Kelly", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Kelly_(football)", "wikipedia_page": {"main": "Sir Robert Kelly (1902 – 21 September 1971) was appointed a member of the board of Scottish football club Celtic after the death of his father James Kelly in 1931. He later became chairman in 1947, a position he held until 1971.", "link_mentions": [{"page": "Celtic F.C.", "response": ["From 1945 onwards numbered shirts slowly came into use throughout Scotland, before becoming compulsory in 1960.  By this time Celtic were the last club in Britain to adopt the use of numbers on the team strip to identify players.  The traditionalist and idealistic Celtic chairman, Robert Kelly, baulked at the prospect of the famous green and white hoops being disfigured, and as such Celtic wore their numbers on the players' shorts. This unusual tradition survived until 1994, although numbered shirts were worn in European competition from 1975 onwards.  Celtic's tradition of wearing numbers on their shorts rather than on the back of their shirts was brought to an end when the Scottish Football League instructed Celtic to wear numbers on their shirts from the start of the 1994–95 season. Celtic responded by adding numbers to the top of their sleeves, however within a few weeks the football authorities ordered the club to attach them to the back of their shirts, where they appeared on a large white patch, breaking up the green and white hoops.", "The late 1940s saw Robert Kelly, son of James Kelly, become chairman of the club after having been a director since 1931. Desmond White also joined the board around this time, upon the death of his father Thomas White. By the 1950s, a significant number of shares in the club had passed to Neil and Felicia Grant, who lived in Toomebridge, County Antrim. These shares accounted for more than a sixth of the club's total issue. Club chairman Robert Kelly's own family share-holding was of a similar size, and he used his close relationship with the Toomebridge Grants to ensure his power base at Celtic was unchallengeable. When Neil Grant died in the early 1960s, his shareholding passed to his sister Felicia, leaving her as the largest share-holder in Celtic. This gave rise to the myth among Celtic supporters of the \"old lady in Ireland\" who supposedly had the ultimate say in the running of the club.", "Celtic's board of directors had a reputation of being miserly and authoritarian. In particular they were known for frequently selling their top players and not paying their staff enough; they were also seen as lacking ambition, which caused friction with several managers. Jimmy McGrory's tenure as manager is generally considered a period of underachievement, but with Chairman Robert Kelly's domineering influence. many have questioned how much authority McGrory ever had in team selection. Even Jock Stein's time as manager ended on a sour note when he was offered a place on the Celtic board, but in a role involving ticket sales. Stein felt that this was demeaning, stating he was \"a football man, not a ticket salesman\". He declined this offer and decided to stay in football management, joining Leeds United instead. Billy McNeill won a trophy in each of his five seasons as manager, but was still paid less than the managers of Rangers, Aberdeen and Dundee United. He left the club in June 1983 after his request for a contract and pay rise was publicly rebuffed by the board. McNeill moved on to manage Manchester City, stating that to remain at Celtic would have been humiliating. McNeill's successor, Davie Hay, also had his difficulties with the Celtic board. When trying to sign players in 1987 to strengthen his squad to compete with high-spending Rangers, the board refused to pay for them; chairman Jack McGinn was quoted as saying that if Hay wanted these players, \"he will have to pay for them himself\"."]}, {"page": "Robert Kelly", "response": ["* Robert Kelly (comedian) (born 1970), American standup comedian", "* Robert Kelly (poet) (born 1935), American poet", "* Robert Kelly (comics), a fictional character in the Marvel Comics universe, named for the poet", "* Robert Kelly (composer) (1916–2007), American composer of classical music", "* Robert Kelly (artist) (born 1956), American artist", "* Robert Kelly (cricketer) (born 1936), New Zealand cricketer", "* Robert Kelly (curler), Scottish curler and coach", "* Robert Kelly (rugby league), Irish rugby league footballer who played in the 1950s, and coached in the 1960s", "* Robert Kelly (rugby union) (1907–1975), Scottish rugby union player", "* Robert Kelly (Gaelic footballer), Gaelic football for Kildare", "* Robert Kelly (football) (1902–1971), chairman of Celtic from 1947–71", "* Robert Kelly (political analyst) (born 1972), American political scientist", "* Robert Kelly (naval officer) (1913–1989), executive officer of Motor Torpedo Boat Squadron 3 in World War II", "* Robert Kelly Jr., accused in the Little Rascals day care sexual abuse trial", "* Robert Kelly (politician) (1845–1920), South Australian MHA", "* Robert Kelly (surgeon) (1879–1944), professor of surgery at the University of Liverpool"]}, {"page": "Jock Stein", "response": ["In July 1957, Stein was given the job of coaching the Celtic reserve team. His squad included a number of young players who would later play under him in the first team, including Billy McNeill, Bobby Murdoch and John Clark. In his first season as a coach, Stein won the Reserve Cup with an 8–2 aggregate triumph over Rangers. Despite this success, according to football journalist Archie MacPherson, Stein was told by club chairman Robert Kelly he would not progress further at Celtic due to his Protestant faith; Celtic had only previously appointed Catholics as manager, though one of these, Willie Maley had spent 50 years at the club and Stein was only the fourth person to be appointed Celtic manager, after Maley, Jimmy McStay and Jimmy McGrory, who was manager for 20 years. It was later suggested that Stein was allowed to leave Celtic temporarily with the intention of later appointing him manager, but MacPherson found no evidence for this."]}, {"page": "Jimmy McGrory", "response": ["In March 1947, Tom White died and director Robert Kelly was elected as his successor as chairman. For the next 18 years, Kelly would be the dominant personality at Celtic Park; imposing his will in the running of the club at all levels including having direct involvement in team selection.", "His time as manager, however, is considered largely a period of underachievement, and with chairman Robert Kelly's domineering influence in the running of the club, many questioned how much say McGrory had in team selection. The years that followed the League Cup Final win over Rangers saw Celtic struggle and, despite the emergence of hugely promising players such as Billy McNeill, Paddy Crerand, Bertie Auld and Jimmy Johnstone, Celtic won no more trophies under McGrory."]}, {"page": "History of Celtic F.C. (1887–1994)", "response": ["Ex-player and captain Jimmy McGrory returned to Celtic in the summer of 1945 as manager.  A further significant change occurred in the Boardroom with the death in 1947 of Celtic chairman Tom White who had been in failing health for several years.  Robert Kelly, who had been a director at the club since 1931 and was a stockbroker by profession, became the new Chairman of Celtic in March 1947.  For the next 18 years, Kelly would be the dominant personality at Celtic Park; imposing his will in the running of the club at all levels and having direct involvement in team selection, to the extent that many queried how much say McGrory really had in team matters.", "In the post-war period numbered shirts slowly came into use throughout Scotland, before becoming compulsory in 1960.  By this time Celtic were the last club in Britain to adopt the use of numbers on the team strip to identify players.  The traditionalist and idealistic Celtic chairman, Robert Kelly, baulked at the prospect of the famous green and white hoops being disfigured, and as such Celtic wore their numbers on the players shorts."]}, {"page": "John Fallon (footballer)", "response": ["As a result of winning the European Cup, Celtic entered the Intercontinental Cup later that year, a two-leg match against Racing Club of Argentina. While warming up for the second leg, a brick (Sir Robert Kelly says it was a \"flat iron bar\") thrown or catapulted by a member of the crowd, struck Ronnie Simpson on the head. With Simpson unable to play, Fallon was called on to keep goal in a bad-tempered second leg, and an even more bad-tempered play-off. Although Celtic lost the return leg, and the subsequent play-off in Montevideo, amid accusations of extreme foul play from the Racing players, Fallon distinguished himself with a string of saves which caused one commentator to remark: \"If that's the reserve keeper, what must the other guy be like?\"", "According to Sir Robert Kelly in his book Celtic, when Celtic tried to get the second leg declared void because of the Simpson incident, Racing Club used Fallon's heroic performance as their counter argument, and the result stood. Fallon also played in the team that won the Alfredo di Stefano Trophy, a testimonial for the Real Madrid player.Alfredo Di Stefano Trophy "]}, {"page": "Celtic F.C. in European football", "response": ["The following two seasons in the European Cup were a disappointment for Celtic; going out to Dynamo Kyiv in the first round in their defence of the trophy in the autumn of 1967, then reaching the quarter-finals the following season only to lose their home leg against AC Milan, having achieved a credible no-scoring draw in the first game in Italy. Earlier in the season, Celtic set off a controversy in the wake of the Soviet Union's invasion of Czechoslovakia in August 1968. At chairman Robert Kelly's behest, the club sent UEFA a telegram condemning the military action and expressing concern that any team from Western Europe having to play a tie in an Eastern Bloc country. Celtic's stance received support from several clubs throughout Western Europe, although others such as Leeds United publicly criticised Celtic's intervention. In response, UEFA redid the draw for the first round of the European Cup and European Cup Winners' Cup to avoid pairing Eastern European sides with clubs from the West. This elicited a furious response from clubs and football authorities in the East, the majority of whom withdrew in protest."]}, {"page": "List of Celtic F.C. managers", "response": ["Jimmy McStay, who made over 400 appearances for Celtic as a player and captained the side, was appointed manager in 1940. However, his tenure would be during the war years, a period when Scottish football suffered huge disruption. He also had to contend with increased boardroom interference, which he never managed to quell. The result was stagnation with little tangible success. In the summer of 1945, McStay reluctantly resigned at the behest of the board and was succeeded by another celebrated former player, Jimmy McGrory. The early years of his reign were very poor, and in 1948 the club only narrowly avoided relegation. Matters improved in the early 1950s with the Coronation Cup win in 1953 and a league and cup double in 1954. He also led Celtic to their famous 7–1 Scottish League Cup Final win over Rangers in 1957, still a record score-line in a major British cup final. His time as manager, however, is considered largely a period of underachievement, and with chairman Robert Kelly's domineering influence in the running of the club, many questioned how much say McGrory had in team selection."]}, {"page": "1967 Intercontinental Cup", "response": ["Celtic returned to Scotland, with chairman Robert Kelly referring to the game as \"an ugly, brutal match containing no football.\"  He also expressed disappointment that Celtic \"descended to that level [of Racing Club] to defend themselves.\"  A few days later the Celtic board of directors fined every player £250 for their behaviour in Montevideo.  Reports of the Racing Club players' bonuses only added to the ignominy."]}, {"page": "Berwick Rangers F.C. 1–0 Rangers F.C.", "response": ["Rangers were one of the most successful teams in Scotland, having won the Scottish League several times and the Scottish Cup nineteen times. Berwick Rangers were relative newcomers to the Scottish Football League, having only joined in 1955. In May 1964, Rangers had tried to force league reconstruction, which would have meant Berwick Rangers and four other teams being expelled from the league. The five teams went to court to fight this proposal, but the court found in Rangers favour of league reconstruction. The teams appealed to the Inner House of the Court of Session and with support from Celtic's chairman Robert Kelly, this proposal was eventually dropped. Berwick Rangers had met Rangers three times previously and had lost each time, 4–0 in the Scottish Cup at Ibrox in 1953, 3–1 in the Scottish Cup at Shielfield in 1960 and 3–1 in the semi-final of the 1963–64 Scottish League Cup at Hampden Park in October 1963."]}]}}