{"wiki_id": "http://www.wikidata.org/entity/Q3067879", "itemLabel": "Peter Grant", "itemDescription": "Scottish football manager (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Grant_(footballer,_born_1965)", "wikipedia_page": {"main": "Peter Grant (born 30 August 1965) is a Scottish football player and coach. During his playing career, Grant played for Celtic, Norwich City, Reading and AFC Bournemouth. He was awarded a testimonial match, played against Bayern Munich, by Celtic in 1997. Grant played in two full international matches for Scotland, both in 1989. Since retiring as a player, Grant has since worked as a football coach. He was manager of Norwich City for a year, and also briefly the caretaker manager of Fulham. Grant has also managed Scottish sides Alloa Athletic and Dunfermline Athletic.", "link_mentions": [{"page": "Fulham F.C.", "response": ["* ± Some managers have only had the official description of \"head coach\" rather than \"manager\": René Meulensteen, Slaviša Jokanović, Scott Parker, and Marco Silva, as well as interim head coach Peter Grant.", "*Peter Grant: took charge of Fulham for three games after Kit Symons' dismissal."]}, {"page": "1965", "response": ["* August 30 – Peter Grant, Scottish football player and manager"]}, {"page": "Old Firm", "response": ["|align=left|Peter Grant"]}, {"page": "Norwich City F.C.", "response": ["On 16 October 2006, Norwich announced that former City player Peter Grant had left West Ham United to become the new manager, and in February 2007, Grant replaced assistant Doug Livermore with his fellow Scot, Jim Duffy.", "| style=\"text-align:left;\"|Peter Grant"]}, {"page": "Alloa Athletic F.C.", "response": ["*  Peter Grant (2019–2021)"]}, {"page": "Craig Bellamy", "response": ["As a young player, Bellamy was unafraid to voice his opinion to more senior members of the squad. His approach annoyed some teammates who sought retribution during training sessions; Bellamy later commented, \"one or two of them would try to clean me out with flying tackles. They wanted to bring me down a peg or two.\" One training session left him \"nearly in tears\" after Kevin Scott repeatedly singled him out. Bellamy won support from his midfield partner, the experienced Peter Grant, who struck up a friendship with Bellamy. Bruce Rioch was appointed Norwich manager in 1998 and instantly moved Bellamy from central midfield to attack. The decision reaped rewards immediately; Bellamy scored seven goals in his first eight league appearances of the campaign, including his first career hat-trick on 22 August 1998 in a 4–2 home win over Queens Park Rangers. By November, he was one of the leading goalscorers in the First Division and was rewarded with a new five-year contract."]}, {"page": "Jamie Cureton", "response": ["Colchester initially rejected the transfer request, saying that Cureton was an important part of the club's future and that they wanted to keep him, though Norwich City manager Peter Grant confirmed that he would like to sign Cureton. Cureton moved to Norwich City for £825,000 on 29 June 2007. He was signed as a replacement for Robert Earnshaw, Norwich's top scorer of the 2006–07 season, who left for Derby County in a £3.5 million deal the same day."]}, {"page": "Bellshill", "response": ["*Peter Grant, Scotland international footballer"]}, {"page": "2006–07 in English football", "response": ["*16 October 2006 – Norwich City appoint West Ham United assistant manager Peter Grant as their new manager.", "| Nigel Worthington || Norwich City || 1 October 2006Norwich sack manager Worthington BBC Sport. Retrieved on 2 January 2007 || Peter Grant || 13 October 2006Grant appointed as Norwich boss BBC Norfolk – Sport. Retrieved on 2 January 2007"]}, {"page": "Tony Mowbray", "response": ["On 8 June 2009, it was reported that Celtic had approached West Bromwich Albion for permission to speak to Mowbray about their managerial vacancy. A compensation fee of £2 million was agreed, and Celtic declared Mowbray as their new manager on 16 June 2009. He was unveiled as Celtic manager at a press conference a day later. His coaching team was Neil Lennon, Peter Grant, Mark Venus, and Stevie Woods. On 12 September 2009 was named as the Coach of the Month of August in the Scottish Premier League."]}, {"page": "Jamie Ashdown", "response": ["Ashdown played the first game of a loan spell with Norwich City on 21 October 2006 in a 1–0 win against Cardiff City at Carrow Road, replacing Paul Gallacher in the starting XI. However in a follow–up match against Stoke City, he was sent–off in the 72nd minute for a foul on Luke Chadwick, resulting a penalty and was successfully converted by Danny Higginbotham to score the opposition team's third goal of the game, as the club lost 5–0. Despite the criticism, Manager Peter Grant praised Ashdown, saying: \"Jamie put both hands up and said it's the worst he's played in two years in the two games. I knew that because I know what Jamie Ashdown is all about. He has great qualities and he is going to be a massive keeper.\" Ashdown made two appearances for Norwich City before returning to his parent club."]}, {"page": "Alan Hutton", "response": ["Hutton made his debut for Aston Villa on 10 September in a 2–2 draw away at Everton. Hutton also took part in Villa's 2–1 defeat to local rivals West Brom, where a tackle on Shane Long injured Long's knee keeping him out for six weeks. The tackle received no punishment during the game but later sparked a retrospective debate as to the fairness of the challenge. After the match his tackle was labelled 'vicious' by West Brom manager Roy Hodgson. Hutton was defended by Villa assistant manager Peter Grant, who insisted that Hutton is not a dirty player. McLeish also came out in support of Hutton, as well as expressing sympathy for Long. Later in the season Hutton's fiery reputation continued, as he was shown a second yellow card and sent off in Villa's 2–1 defeat at home to Arsenal on 21 December."]}, {"page": "Adam Drury (footballer, born 1978)", "response": ["In the close season of 2004 Norwich signed competition for Drury in the shape of the experienced Simon Charlton from Bolton Wanderers but Charlton often ended up playing in the centre of defence with Drury retaining his place on the left. Loss of form during the 2004–05 Premier League season did lead to Drury being dropped for a short time and he was relieved of the captaincy (which passed to Craig Fleming) until the start of the 2006–07 season when he was re-instated. Towards the end of the 2004–05 season he found his form again and turned in an outstanding display as part of the Norwich team that beat Manchester United 2–0 at Carrow Road. He continued to be a key member of the Norwich squad on their return to the Championship for season 2005–06. Norwich manager Nigel Worthington named Drury as Norwich City captain for the 2006–07 season, though Worthington's successor Peter Grant awarded the captaincy to Jason Shackell at the beginning of the 2007–08 campaign."]}, {"page": "Luke Chadwick", "response": ["On 13 November 2006, Chadwick signed on loan for Norwich City until 3 January; he was signed by Peter Grant, who had worked with him at Reading and West Ham. On his debut six days later, he opened the scoring in a 3–1 loss at rivals Ipswich Town. He suffered a knee injury in that match, ruling him out until March. After his loan ended, he signed a 2-year deal for a 200,000 fee. He said that his transfer was due to his wife and children returning to Cambridge."]}, {"page": "Youssef Safri", "response": ["Following the 3–1 defeat at Plymouth Argyle in September 2006, Safri and teammate Dickson Etuhu were reported to have traded punches on the team bus during their return journey to East Anglia, although these reports are now thought to have been discredited. After Peter Grant was appointed Norwich manager in October 2006, Safri was not a regular selection. There was speculation that he would leave the club in January 2007, fuelled by his comments in the Eastern Daily Press on 29 December 2006 in which Safri indicated that he would seek a transfer if Grant continued to use him as a substitute. Safri remained at Carrow Road until the end of the 2006–07 season, but after falling out with manager Peter Grant, Grant stated in the press on 1 August that Safri would not play for the club again."]}]}}