{"wiki_id": "http://www.wikidata.org/entity/Q3072339", "itemLabel": "Jonny Quinn", "itemDescription": "British drummer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonny_Quinn", "wikipedia_page": {"main": "Jonathan Graham Quinn (born 26 February 1972) is a Northern Irish musician, best known as the drummer for alternative rock band Snow Patrol, and was previously a member of bands like The Mighty Fall, The New Brontes and Disraeli Gears. As drummer for Snow Patrol, he has played on all releases. He is married to industrial designer Mariane Quinn (née Røkke).", "link_mentions": [{"page": "Bangor, County Down", "response": ["*Jonny Quinn, musician (Snow Patrol)"]}, {"page": "List of show business families", "response": ["* Actor Sir Robert Stephens is the father of actors Chris Larkin and Toby Stephens through his third wife Dame Maggie Smith. He later married actress Patricia Quinn, whose nephew is rock musician Jonny Quinn. Smith later remarried playwright and screenwriter Beverley Cross."]}, {"page": "The Reindeer Section", "response": ["** Jonny Quinn"]}, {"page": "Grammy Award for Best Rock Song", "response": ["* Nathan Connolly, Gary Lightbody, Jonny Quinn, Tom Simpson – \"Chasing Cars\" (Snow Patrol)"]}, {"page": "Snow Patrol", "response": ["Snow Patrol are a Northern Irish–Scottish rock band formed in 1994 in Dundee, Scotland. They consist of Gary Lightbody (vocals, guitar), Nathan Connolly (guitar, backing vocals), Paul Wilson (bass guitar, backing vocals), Jonny Quinn (drums), and Johnny McDaid (piano, guitar, backing vocals). Initially an indie rock band, Snow Patrol rose to prominence in the early– mid-2000s as part of the post-Britpop movement.", "thumb|left|Jonny Quinn (pictured in 2018) joined as the band's drummer in 1997.", "At the 2007 Grammy Awards, \"Chasing Cars\" was nominated for Best Rock Song and at the 2007 Brit Awards, the song was nominated for Best British Single. 1 September 2007 saw Snow Patrol headlining a \"homecoming\" mini-festival in Lightbody and Jonny Quinn's home town of Bangor, County Down. Around 30,000 people came to see the band.", "Snow Patrol founded Polar Music, a publishing company run through Kobalt Music. The venture is independent from the band's publishing deal with Universal Music. Polar Music was planned to sign artists regardless of their genre, as drummer Jonny Quinn explained: \"there is no agenda—if it's good enough and we believe in it 110%, we will sign it.\" Quinn, and his fellow band members Connolly and Lightbody, are acting as A&R. The company's first signing was Johnny McDaid, previously of the Northern Irish band Vega4. Quinn has said that they wish to sign artists to a one-album deal and do not want to put undue pressure on the artists with bigger, multi-year contracts. Polar Music had its initial chart hit in the first week of October 2009.", "* Jonny Quinn – drums, percussion (1997–present)", " bar:Quinn      text:\"Jonny Quinn\""]}, {"page": "Final Straw", "response": ["*Jonny Quinn – drums"]}, {"page": "Songs for Polarbears", "response": ["*Jonny Quinn - drums"]}, {"page": "When It's All Over We Still Have to Clear Up", "response": ["*Jonny Quinn - drums, extra vocals on track 7"]}, {"page": "Campbell College", "response": ["*Jonny Quinn, drummer in Snow Patrol"]}, {"page": "Son of Evil Reindeer", "response": ["|Iain Archer, Norman Blake, William Campbell, Charles Clark, Richard Colburn, Mick Cooke, Ben Dumville, Gary Lightbody, Colin Macpherson, Mark McClelland, Malcolm Middleton, Neil Payne, Jonny Quinn, Jenny Reeve, Sarah Robertson, Gareth Russell, Stacey Sievwright", "|William Campbell, Charles Clark, Ben Dumville, Bob Kildea, Gary Lightbody, Colin Macpherson, Sam Morris, Neil Payne, Jonny Quinn, Jenny Reeve, Gareth Russell, Stacey Sievwright", "|Iain Archer, William Campbell, Charles Clark, Gary Lightbody, Colin Macpherson, Malcolm Middleton, Jonny Quinn, Jenny Reeve, Gareth Russell, Stacey Sievwright", "|Iain Archer, Paul Fox, Bob Kildea, Gary Lightbody, Colin Macpherson, Jonny Quinn, Jenny Reeve, Gareth Russell", "|Iain Archer, William Campbell, Charles Clark, Bob Kildea, Gary Lightbody, Colin Macpherson, Neil Payne, Jonny Quinn, Jenny Reeve, Gareth Russell", "|William Campbell, Charles Clark, Richard Colburn, Mick Cooke, John Cummings, Ben Dumville, Lee Gorton, Gary Lightbody, Neil Payne, Jonny Quinn, Jenny Reeve, Sarah Robertson, Gareth Russell", "|William Campbell, Charles Clark, Ben Dumville, Gary Lightbody, Sam Morris, Jonny Quinn, Jenny Reeve, Gareth Russell, Stacey Sievwright", "|Iain Archer, William Campbell, Charles Clark, Mick Cooke, Ben Dumville, Bob Kildea, Gary Lightbody, Colin Macpherson, Neil Payne, Jonny Quinn, Jenny Reeve, Gareth Russell, Stacey Sievwright", "*Jonny Quinn – drums"]}, {"page": "Y'All Get Scared Now, Ya Hear!", "response": ["The core band throughout the album consists of vocalist/guitarist Gary Lightbody, drummer Jonny Quinn, guitarist/harmony vocalist William Campbell, acoustic guitarist/harmony vocalist Charles Clark, bassist Gareth Russell, and violinist/vocalist Jenny Reeve with various musicians joining in on a number of tracks - with everyone considered a member in keeping with the collective spirit.", "* Jonny Quinn - drums"]}, {"page": "Patricia Quinn (Northern Irish actress)", "response": ["Quinn has a son, Quinn Hawkins, from her first marriage to Don Hawkins. Her nephews, Jonny Quinn and Bradley Quinn, are members of the alternative rock band Snow Patrol."]}, {"page": "Legal Man", "response": ["\"Legal Man\" is the debut single of Scottish indie pop band Belle and Sebastian. The track features Isobel Campbell, Sarah Martin, and Rozanne Suarez (credited as the Maisonettes) on vocals and Snow Patrol drummer Jonny Quinn on congas. The cover artwork—designed by Andrew Symington—features band members Stevie Jackson and Campbell along with Adrienne Payne and Suarez. Two B-sides were released with the single: \"Judy Is a Dick Slap\", an instrumental, and \"Winter Wooskie\", which was the last time bass player Stuart David sang lead vocals before departing the band in 2000.", "* Jonny Quinn – congas"]}, {"page": "John Quinn", "response": ["*Jonny Quinn (born 1972), drummer for Snow Patrol"]}, {"page": "Eyes Open", "response": ["Snow Patrol's primary aim for a fourth album was to create a better one than the previous, Final Straw. They felt the need to become better players of their respective instruments as they thought they had \"barely [gotten] away\" with the success of the last album. Subsequently, keyboardist Tom Simpson and drummer Jonny Quinn took classical piano and drum lessons respectively, during the recording of the album.", "* Jonny Quinn – drums, percussion"]}, {"page": "The Lightning Strike", "response": ["*Jonny Quinn – drums", "Category:Songs written by Jonny Quinn"]}, {"page": "Run (Snow Patrol song)", "response": ["Snow Patrol's frontman, Gary Lightbody, conceived the idea of writing \"Run\" in 2000. In an interview with Michael Odell, from Q magazine, Lightbody explained the song was not written about \"being a child\", as he tended to say. He described: \"I was on a massive bender and one night I was drinking in the bar of the Glasgow School of Art. I fell down a full flight of stairs. Jonny Quinn found me in the stairwell with blood coming out of my head ... I split my head open and my eye was closed and I lost a few teeth ... I wrote Run soon after on this little guitar I'd tried to smash up in my shitty little room near Hillhead. The words 'Light up, light up' gave me this sense of a beacon.\" Besides Lightbody, it was written by Quinn, Nathan Connolly, Mark McClelland and Iain Archer.", "* Drums: Jonny Quinn", "* Musical composition: Iain Archer, Nathan Connolly, Gary Lightbody, Mark McClelland, Lee Potter (\"Post Punk Progression\"/\"PPP\" only), Jonny Quinn", "Category:Songs written by Jonny Quinn"]}, {"page": "Spitting Games", "response": ["Category:Songs written by Jonny Quinn"]}, {"page": "Chocolate (Snow Patrol song)", "response": ["Category:Songs written by Jonny Quinn"]}, {"page": "How to Be Dead", "response": ["Category:Songs written by Jonny Quinn"]}, {"page": "You're All I Have", "response": ["Category:Songs written by Jonny Quinn"]}, {"page": "Gary Lightbody", "response": ["Lightbody formed a band with Mark McClelland and drummer Michael Morrison in 1994, called Shrug. Morrison left the band later, and the band were forced to change the name to Polarbear, as another band had claimed the name. In the band's first seven years of existence, they added drummer Jonny Quinn, released two albums (Songs for Polarbears, and When It's All Over We Still Have to Clear Up), and toured with bands such as Levellers, Ash and Travis. The band stayed in Glasgow during the recording of the first two albums. Lightbody used to hold a job at the Nice n Sleazy's Bar in Sauchiehall Street. Today, Lightbody owns a small place in Glasgow and says he will never leave the country behind, though he resides in Belfast. He feels an attachment to the place, as it gave him his first taste of success."]}, {"page": "Hands Open", "response": ["Category:Songs written by Jonny Quinn"]}, {"page": "Rockport School", "response": ["* Jonny Quinn, musician (Snow Patrol)"]}, {"page": "49th Annual Grammy Awards", "response": ["**Nathan Connolly, Gary Lightbody, Jonny Quinn, Tom Simpson & Paul Wilson songwriters"]}, {"page": "Paul Wilson (musician)", "response": ["His favourite instrument is the guitar, which he played for nineteen years, before switching to bass. He found the transition difficult, as he felt that one could \"get away with more\" playing the guitar. He finds the bass a difficult and challenging instrument to play and \"express\" oneself. But he enjoys playing it and likes the potential of the instrument: \"By changing one note, you can make the whole thing sound a lot better\". Apart from writing bass-lines for the band, Wilson occasionally contributes guitar and piano parts. He writes bass-lines based on the song's rhythm and at times teams up with drummer Jonny Quinn to come up with a basic riff or simple chord changes.  He plays the bass left-handed, and prefers using a pick. On-stage, he generally uses a black Rickenbacker 4000 bass."]}, {"page": "Set the Fire to the Third Bar", "response": ["Category:Songs written by Jonny Quinn"]}, {"page": "Nathan Connolly", "response": ["Connolly lives in Crouch End, London, nearby bandmate Jonny Quinn."]}, {"page": "Mark McClelland", "response": ["Mark McClelland was born on 30 March 1976, and attended Sullivan Upper School as a youngster. In 1994, he started attending the University of Dundee to study Financial economics. During his first year, he founded the band Shrug with Michael Morrison and Gary Lightbody. Morrison left the band in 1995 and with new drummer Jonny Quinn, they became Polar Bear and eventually Snow Patrol. On 9 July 1998, McClelland graduated with first class honours and was one of the only three students to graduate in the course that year. Additionally, he was the only student to graduate in first class for that course that year. A few weeks later, Snow Patrol released their first studio album Songs for Polarbears (a reference to previous band name Polarbear) under Jeepster. In 2001, the band released their second studio album When It's All Over We Still Have to Clear Up. During this time, McClelland was also a member of The Reindeer Section, a Scottish ensemble started by bandmate Lightbody. He also featured on Iain Archer's album Flood The Tanks and Cut La Roc's eponymous debut album, playing the song \"Post Punk Progression\" with Snow Patrol."]}, {"page": "Open Your Eyes (Snow Patrol song)", "response": ["Category:Songs written by Jonny Quinn"]}, {"page": "Signal Fire (song)", "response": ["The band visited Grouse Lodge with producer Jacknife Lee in early 2007 to record the song. Drummer Jonny Quinn, injured at the time because of his snowboarding accident in January, drummed with one hand during the recording sessions.", "*Jonny Quinn – drums"]}, {"page": "Starfighter Pilot (song)", "response": ["\"Starfighter Pilot\" was the fourth single released by Snow Patrol, and the second track on their debut album Songs for Polarbears. The lyrics were written by Snow Patrol frontman Gary Lightbody and the music was composed by Lightbody and the other two members of Snow Patrol at the time, Mark McClelland and Jonny Quinn. The song reached number 161 on the UK Singles Chart.", "\"Starfighter Pilot\" was originally released under Snow Patrol's former name Polarbear in 1997. The song was described by The Times as \"a wonky indie number that is refreshingly rough around the edges\". Irish Central called it a \"dirty glam masterpiece\". Drummer Jonny Quinn remembers it to be the first Snow Patrol song he listened to on the radio, back in 1998 in a cafe in Ireland. He found the experience \"chilling\"."]}, {"page": "2008 in Irish music", "response": ["* A Hundred Million Suns – Snow Patrol (October 24, 2008)    (Before Christmas) According to Tony Fenton, Today FM, April 29, 2008. (October) According to Jonny Quinn in a Belfast Telegraph interview, July 31, 2008.  Music Lessons  Artwork"]}, {"page": "Snow Patrol discography", "response": ["The discography of Snow Patrol, an alternative rock band from Northern Ireland and based in Dundee, Scotland, consists of seven studio albums, thirty-one singles, eight extended plays, three compilation albums and one live DVD. Snow Patrol was formed in 1994 by Gary Lightbody, Michael Morrison and Mark McClelland under the name Shrug. They released an extended play (EP) titled The Yogurt vs. Yogurt Debate. Note: Need to click \"View Snow Patrol bio\". Morrison left in 1995, and the band changed their name to Polarbear. Under this name they released their other EP, Starfighter Pilot, on the Electric Honey label. Drummer Jonny Quinn joined in 1997 and the band signed to Jeepster Records the same year. They then underwent their final name change to Snow Patrol. The band's first two studio albums: Songs for Polarbears and When It's All Over We Still Have to Clear Up were released in 1998 and 2001 respectively, but failed to do well commercially. Subsequently, the band was dropped by the label."]}, {"page": "A Hundred Million Suns", "response": ["The album title was revealed by drummer Jonny Quinn in an interview to The Belfast Telegraph, and was initially reported as \"One Hundred Million Suns\". Lightbody later confirmed the title as \"A Hundred Million Suns\" on the band's official website, and noted that the newspaper had gone on to print the title despite the band's wish to reveal it themselves.", "*Jonny Quinn – drums, percussion"]}]}}