{"wiki_id": "http://www.wikidata.org/entity/Q30719714", "itemLabel": "Martin Stretton", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Stretton", "wikipedia_page": {"main": "Martin Stretton (born 21 June 1959) is one of the most successful racing drivers in International Historic Motorsport.Martin started his career in 1978 and has raced every season since then now having the extraordinary record of driving nearly 350 different racing cars. In the early '90s he got his big break in Historic racing driving a GP Connaught for David Duffy and a Maserati for Simon Bull.  As a result of the successes in tase cars he was (and continues to be) invited to drive a great variety of cars for various owners. In Historic F1 he became the first Historic Champion in 1995 racing the Tyrrell 005 much aided by the guidance of Derek Gardener the car's original designer. In 2000 they won a second Championship in Derek's ultimate design the fabulous P34 six wheeler. As with the Maserati 4CM both cars were owned by Simon Bull a great enthusiast and loyal supporter of Martin's racing career.\nOver this period Martin amongst his numerous wins can count four victories in the Spa Six Hrs, six at Monaco and two on the Nordschleife.\nHe continues to drive a great variety of car for and/or with multiple owners.", "link_mentions": [{"page": "Goodwood Festival of Speed", "response": ["|  Martin Stretton"]}, {"page": "1998 24 Hours of Le Mans", "response": ["|  Larry Schumacher Nick Ham Martin Stretton"]}, {"page": "1999 FIA GT Championship", "response": ["|  Martin Stretton"]}, {"page": "1998 FIA GT Championship", "response": ["|  Martin Stretton", "|align=left|  Martin Stretton"]}, {"page": "1997 FIA GT Championship", "response": ["|  Martin Stretton"]}, {"page": "1995 BPR Global GT Series", "response": ["|  Martin Stretton"]}, {"page": "Historic Formula One Championship", "response": ["|  Martin Stretton", "|  Martin Stretton"]}, {"page": "List of family relations in auto racing", "response": ["|Martin Stretton"]}, {"page": "2006 British GT Championship", "response": ["|align=left|  Martin Stretton"]}, {"page": "Historic Grand Prix of Monaco", "response": ["|  Martin Stretton", "|  Martin Stretton", "|  Martin Stretton", "|  Martin Stretton", "|  Martin Stretton", "|  Martin Stretton"]}, {"page": "1996 North American Touring Car Championship", "response": ["|  Martin Stretton", "|align=left|  Martin Stretton"]}, {"page": "1995 Historic Formula One Championship", "response": ["It was won by Martin Stretton driving a Tyrrell 005 despite not winning any of the five races."]}, {"page": "2017 FIA Masters Historic Formula One Championship", "response": ["|  Martin Stretton", "| Martin Stretton", "| Martin Stretton", "| align=\"left\" |  Martin Stretton"]}, {"page": "2016 FIA Masters Historic Formula One Championship", "response": ["|  Martin Stretton"]}, {"page": "1999 British GT Championship", "response": ["|  Martin Stretton"]}, {"page": "2016 Historic Grand Prix of Monaco", "response": ["|  Martin Stretton", "|  Martin Stretton"]}, {"page": "2008 Historic Grand Prix of Monaco", "response": ["|  Martin Stretton"]}, {"page": "2006 Historic Grand Prix of Monaco", "response": ["In Race G, Martin Stretton hit the wall during first qualifying and damaged the chassis of his Tyrrell P34, but made enough repairs by the second session to secure a place on the front row. In the race, he led at the first corner while Peter Williams collided with a spinning Peter Wuensch behind, triggering a safety car that kept the field bunched together. This created a tense battle for the lead during the final laps. Polesitter Paul Edwards attempted a bold move for the lead around the outside at Loews Hairpin on the final tour, but made contact and brushed the barriers, ending up classified the first car a lap down.", "| align=left|  Martin Stretton", "|  Martin Stretton"]}, {"page": "2004 Historic Grand Prix of Monaco", "response": ["| align=left|  Martin Stretton", "| align=left|  Martin Stretton", "|  Martin Stretton", "|  Martin Stretton"]}, {"page": "2002 Historic Grand Prix of Monaco", "response": ["Race G featured, for the only time in the event's history, two current F1 drivers: Alex Yoong and Takuma Sato, both seeking to gain experience of the unique circuit before their first Monaco Grand Prix. Sato crashed his Lotus 49B during a wet practice session and did not start the race; Yoong took the race lead and seemed destined for victory until his car became stuck in fifth gear during a late safety car period and Martin Stretton passed him on the final lap.", "| align=left|  Martin Stretton", "| align=left|  Martin Stretton", "|  Martin Stretton", "|  Martin Stretton"]}, {"page": "2000 Historic Grand Prix of Monaco", "response": ["Race D featured a tense lead battle between Martin Stretton and Nigel Corner, the latter driving the Maserati 250F with which Juan Manuel Fangio had won the 1957 Monaco Grand Prix. Corner retired with gearbox failure and soon afterward the 250F of Klaus Edel dropped a large amount of oil at Sainte Devote. This caused Gregor Fisken and Spencer Flack to crash out of third and fifth respectively, and the race was red-flagged after seven of the scheduled ten laps. Moss's winning 250F from 1956 also featured in the race.", "| align=left|  Martin Stretton", "| align=left|  Martin Stretton", "|  Martin Stretton", "|  Martin Stretton"]}, {"page": "1997 Historic Grand Prix of Monaco", "response": ["1968 Monaco Grand Prix runner-up Richard Attwood impressed with his performance in Race D and also set the fastest lap. A third former F1 driver was three-time Monaco Grand Prix winner Stirling Moss. He was entered for Race D but suffered a cylinder head failure and did not start. He gave a strong showing in Race E, running third until a somewhat reluctant Martin Stretton passed him.", "| align=left|  Martin Stretton", "| align=left|  Martin Stretton", "| align=left|  Martin Stretton", "|  Martin Stretton", "|  Martin Stretton"]}, {"page": "Stretton, Martin", "response": ["#redirectMartin Stretton"]}]}}