{"wiki_id": "http://www.wikidata.org/entity/Q3070658", "itemLabel": "Hechmi Hamdi", "itemDescription": "Tunisian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Mohamed_Hechmi_Hamdi", "wikipedia_page": {"main": "Mohamed Hechmi Hamdi (Arabic: محمد الهاشمي الحامدي), also spelled Mohamed el Hachmi El-Hamdi, Hechmi Haamdi, or Hachmi Hamdi is a Tunisian journalist, media entrepreneur and politician, who lives in London. He is founder and owner of the oppositional Al Mustakillah TV channel. After the Tunisian Revolution in 2011 he founded the \"Popular Petition\" party later renamed to Current of Love.", "link_mentions": [{"page": "List of political parties in Tunisia", "response": ["|Mohamed Hechmi Hamdi"]}, {"page": "Tunisian people", "response": ["Hatem Ben Arfa (France), Sadek (France), Tunisiano (France), Afef Jnifen (Italy), Sana Hassainia (Canada), Hinda Hicks (England), Mohamed Hechmi Hamdi (England), Hend Sabry (Egypt), Ghassan bin Jiddo (Lebanon), Cyril Hanouna (France), Kev Adams (France) and Sabrine Bentunsi (France)."]}, {"page": "2014 Tunisian presidential election", "response": ["Ennahda announced on 8 September 2014 that it would not put forth a presidential candidate. Beji Caid Essebsi submitted his candidacy on 9 September 2014. Kamel Morjane, a foreign minister under former president Zine El Abidine Ben Ali, announced on 13 September 2014 that he would run for the presidency. Incumbent president Moncef Marzouki announced on 20 September 2014 that he would run for re-election. Other candidates included Mohamed Hechmi Hamdi, Mustapha Kamel Nabli, Ahmed Najib Chebbi, Mustapha Ben Jafar and Mondher Zenaidi. 27 candidates were allowed to run out of the 70 who applied. Five candidates withdrew before the election: Abderraouf Ayadi, Abderrahim Zouari (throwing his support to Essebsi), Mohamed Hamdi, Noureddine Hached and Mustapha Kamel Nabli.", "Hachemi Hamdi.jpg|Hechmi HamdiCurrent of Love"]}, {"page": "2011 Tunisian Constituent Assembly election", "response": ["Aridha Chaabia's surprise success was linked to its populist rhetoric and its party leader Mohamed Hechmi Hamdi being the only prominent politician not from the coastal regions (he was born in Sidi Bouzid). The party opted for campaigning in rural regions of Tunisia (particularly the south), which are often ignored by mainstream politicians."]}, {"page": "Current of Love", "response": ["The Current of Love or Tayar el-Mahaba (, ), before May 2013 known as the Popular Petition for Freedom, Justice and Development (, , ), short Popular Petition, Aridha Chaabia or Al Aridha, is a political movement and electoral list in Tunisia. It was formed after the Tunisian revolution, on 17 March 2011. It has been founded and led by the political writer and media entrepreneur Mohamed Hechmi Hamdi. It is closely linked to the Party of Progressive Conservatives which has been officially registered as a political party.", "Hechmi Hamdi, who is the owner of Al Mustakilla satellite TV channel, is alleged to have close ties with Tunisia's ousted president Ben Ali, but decries such allegations as slander. In the campaign ahead of the Constituent Assembly election on 23 October 2011, the party has promised free health care, and an allowance of 200 dinars for each of the 500,000 jobseekers in Tunisia. Hechmi Hamdi personally has pledged to inject 2 billion dinars of his own wealth into the national budget. Al-Mustakilla channel has fiercely supported the Petition's campaign. Therefore, numerous complaints against Aridha Chaabia have been filed with the electoral commission ISIE, asking for an annulment of the list and its seats.", "To the surprise of both rivals and neutral observers, the party performed very well, initially winning 27 seats in the Constituent Assembly. The unexpected success was partly explained with the Southerner Hechmi Hamdi's appeal to the population of the southern and central governorates, given that representatives from Tunis and the Mediterranean coast have so far dominated Tunisian politics. On 27 October, ISIE disqualified the Petition's lists in six constituencies (with altogether eight elected candidates) for financial irregularities. Thus, the number of seats was brought down to 19, still making Al Aridha the fourth largest in the convention. ISIE's decision to cancel seats triggered violent protests of Popular Petition supporters in Sidi Bouzid. Party leader Hechmi Hamdi asked his successful candidates to resign and boycott the Constituent Assembly, before reversing this decision on 28 October when he announced that the list's representatives would work in the parliamentary opposition. Following Popular Petition's complaint before the Administrative Court, the electoral commission's decision was mostly revoked: seven of the cancelled seats were reinstated by the judge's verdict, giving the populist party 26 seats altogether. However, twelve of its parliament members resigned from the party in the following days and declared themselves independent.Wave of Resignations Shakes Aridha Chaabia , Tunisia Live, Eymen Gamha, 12 November 2011", "The Popular Petition for Freedom, Justice and Development is organised as a popular movement and an electoral list, but is not registered as a political party. It is however closely linked to the Party of Progressive Conservatives (PPC), which was officially licensed on 15 July 2011 and is part of an initiative started by the Popular Petition. The Popular Petition and the PPC have \"exactly the same program\", according to Hechmi Hamdi who leads Aridha Chaabia and PPC in personal union.", "In May 2013 Hechmi Hamdi relaunched the movement under the new name of Tayar al-Mahaba, or \"Current of Love\"."]}, {"page": "Mohammed El-Hachimi", "response": ["#REDIRECT Mohamed Hechmi Hamdi"]}, {"page": "Hechmi Haamdi", "response": ["#REDIRECT Mohamed Hechmi Hamdi"]}, {"page": "Hechmi Hamdi", "response": ["#REDIRECT Mohamed Hechmi Hamdi"]}, {"page": "Hachmi Hamdi", "response": ["#REDIRECT Mohamed Hechmi Hamdi"]}, {"page": "Mohammed al Hachimi Al-Hamidi", "response": ["#REDIRECT Mohamed Hechmi Hamdi"]}, {"page": "Al Mustakillah (TV channel)", "response": ["Al Mustakillah (; or The Independent) is an Arabic language television channel based in London, United Kingdom, aimed towards a Tunisian audience. Founded in 1999 by Mohamed Hechmi Hamdi, it remains owned by his Almustakillah TV Ltd.", "Al-Mustakillah's founder Hechmi Hamdi was alleged to be politically allied with Bin Ali, yet he often interviewed leaders of the Tunisian opposition on his satellite programs. He helped them speak their opinions on 'The Great Maghreb,' widely viewed in Tunisia. In reaction, Bin Ali's Tunisian regime called Hamdi \"a traitor and a spy.\" The government began cracking down on political opposition, and Hamdi fled Tunisia to settle in London."]}, {"page": "Tunisian diaspora", "response": ["Hatem Ben Arfa (France), Sadek (France), Tunisiano (France), Afef Jnifen (Italy), Sana Hassainia (Canada), Hinda Hicks (England), Mohamed Hechmi Hamdi (England), Hend Sabry (Egypt), Ghassan bin Jiddo (Lebanon), Cyril Hanouna (France), Kev Adams (France), Marwan Kenzari (The Netherlands)"]}]}}