{"wiki_id": "http://www.wikidata.org/entity/Q3082743", "itemLabel": "Frank Muir", "itemDescription": "English comedy scriptwriter and radio personality", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Muir", "wikipedia_page": {"main": "Frank Herbert Muir  (5 February 1920 – 2 January 1998) was an English comedy writer, radio and television personality, and raconteur. His writing and performing partnership with Denis Norden endured for most of their careers. Together they wrote BBC Radio's Take It from Here for over 10 years, and then appeared on BBC radio quizzes My Word! and My Music for another 35. Muir became Assistant Head of Light Entertainment at the BBC in the 1960s, and was then London Weekend Television's founding Head of Entertainment. His many writing credits include editorship of The Oxford Book of Humorous Prose.\n\n", "link_mentions": [{"page": "Afghan Hound", "response": ["Because of its distinctive appearance, the Afghan hound has been represented in animated feature films and TV shows, including Universal Pictures' Balto (Sylvie) and Disney's Lady and the Tramp II: Scamp's Adventure (Ruby), an Afghan hound also appeared on 101 Dalmatians as well as in 102 Dalmatians as one of the dogs in Cruella de Vil's party and the television series What-a-Mess (Prince Amir of Kinjan; based on children's books by Frank Muir) and, as Prissy in the 1961 Disney animated film One Hundred and One Dalmatians and 101 Dalmatians II: Patch's London Adventure. Brainy Barker from Krypto the Superdog claims to be an Afghan Hound in the episode \"Meet the Dog Stars\", although her design actually resembles that of a Saluki instead of an Afghan Hound. Malory Archer in the show Archer had an Afghan hound named Duchess at some point during the childhood of her son, Sterling Archer. The dog is a point of contention between the two, due to Malory's apparent preference for it over her son. In the show Road Rovers, Persia, who is the leader of the Space Rovers, is an Afghan Hound. Burt, an Afghan Hound in the show Foofur antagonizes Foofur to win Dolly's love."]}, {"page": "List of comedians", "response": ["* Frank Muir"]}, {"page": "Damon Runyon", "response": ["The English comedy writer Frank Muir commentsThe Oxford Book of Humorous Prose (1990), OUP, p. 621 that Runyon's plots were, in the manner of O. Henry, neatly constructed with professionally wrought endings, but their distinction lay in the manner of their telling, as the author invented a peculiar argot for his characters to speak.  Runyon almost totally avoids the past tense (English humorist E.C. Bentley thought there was only one instance, and was willing to \"lay plenty of 6 to 5 that it is nothing but a misprint\",Runyon on Broadway, Pan Books, 1975, p. 11 but \"was\" appears in the short stories \"The Lily of St Pierre\"Runyon on Broadway, Pan Books, 1975, p. 116 and \"A Piece of Pie\";Runyon on Broadway, Pan Books, 1975, p. 536 \"had\" appears in \"The Lily of St Pierre\", \"Undertaker Song\"Runyon on Broadway, Pan Books, 1975, p. 258 and \"Bloodhounds of Broadway\"Runyon on Broadway, Pan Books, 1975, p. 85), and makes little use of the future tense, using the present for both. He also avoided the conditional, using instead the future indicative in situations that would normally require conditional. An example: \"Now most any doll on Broadway will be very glad indeed to have Handsome Jack Madigan give her a tumble\" (Guys and Dolls, \"Social error\"). BentleyIntroduction to More Than Somewhat, included in omnibus volume Runyon on Broadway (1950), Constable comments that \"there is a sort of ungrammatical purity about it [Runyon's resolute avoidance of the past tense], an almost religious exactitude.\"  There is an homage to Runyon that makes use of this peculiarity (\"Chronic Offender\" by Spider Robinson) which involves a time machine and a man going by the name \"Harry the Horse\"."]}, {"page": "John Cleese", "response": ["Also in 1965, Cleese and Chapman began writing on The Frost Report. The writing staff chosen for The Frost Report consisted of a number of writers and performers who went on to make names for themselves in comedy. They included co-performers from I'm Sorry, I'll Read That Again and future Goodies Bill Oddie and Tim Brooke-Taylor, and also Frank Muir, Barry Cryer, Marty Feldman, Ronnie Barker, Ronnie Corbett, Dick Vosburgh and future Python members Eric Idle, Terry Jones, and Michael Palin. While working on The Frost Report, the future Pythons developed the writing styles that would make their collaboration significant. Cleese's and Chapman's sketches often involved authority figures, some of whom were performed by Cleese, while Jones and Palin were both infatuated with filmed scenes that opened with idyllic countryside panoramas. Idle was one of those charged with writing David Frost's monologue. During this period Cleese met and befriended influential British comedian Peter Cook, eventually collaborating with Cook on several projects and forming a close friendship that lasted until Cook's death in 1995."]}, {"page": "Michael Palin", "response": ["After finishing university in 1965 Palin became a presenter on a comedy pop show called Now! for the television contractor Television Wales and the West. At the same time Palin was contacted by Jones, who had left university a year earlier, for assistance in writing a theatrical documentary about sex through the ages. Although this project was eventually abandoned, it brought Palin and Jones together as a writing duo and led them to write comedy for various BBC programmes, such as The Ken Dodd Show, The Billy Cotton Bandshow, and The Illustrated Weekly Hudd. They collaborated in writing lyrics for an album by Barry Booth called Diversions. They were also in the team of writers working for The Frost Report, whose other members included Frank Muir, Barry Cryer, Marty Feldman, Ronnie Barker, Ronnie Corbett, Dick Vosburgh and future Monty Python members Graham Chapman, John Cleese and Eric Idle."]}, {"page": "1920", "response": ["* February 5 – Frank Muir, British actor, comedy writer and raconteur (d. 1998)"]}, {"page": "Till Death Us Do Part", "response": ["Alf was portrayed as the archetypal working-class Conservative. The subjects that excited him most were football and politics, though his actual knowledge of either was limited. He used language not considered acceptable for television in the 1960s. He often referred to racial minorities as \"coons\" and similar terms. He referred to his Liverpudlian son-in-law as \"Shirley Temple\" or a \"randy Scouse git\" (Randy Scouse Git, as a phrase, caught the ear of Micky Dolenz of the Monkees who heard it while on tour in the UK and used it as the title of the group's next single—though their record label renamed it 'Alternate Title' in the UK market to avoid controversy), and to his wife as a \"silly [old] moo\" (a substitute for 'cow' which was vetoed by the BBC's head of comedy Frank Muir). However, Michael Palin writes in his diary for 16 July 1976 that Warren Mitchell told him that \"silly moo\" was not scripted, \"It came out during a rehearsal when he forgot the line 'Silly old mare'.\" Controversially, the show was one of the earliest mainstream programmes to feature the swear word 'bloody'. The show was one of many held up by Mary Whitehouse as an example of the BBC's moral laxity.See, for example, her responses to an episode referred to as \"Bird Fancier\" (first transmitted on 20 September 1972), which features a discussion of the Virgin birth of Jesus, as detailed in Michael Tracey and David Morrison Whitehouse, London & Basingstoke: Macmillan, 1979, pp. 110–16. The episode is also known as \"Pigeon Fancier\", but the recording as broadcast contains no identifying caption.", "Public outcry over the episode \"The Blood Donor\" as being a particularly distasteful episode and a new Chairman of the BBC Board of Governors - Lord Hill (who had been appointed as Lord Normanbrook's successor when Normanbrook died suddenly in June 1967) - taking a rather different, more conservative approach to the running of the BBC than the liberal and laid-back attitude of his predecessor were two other factors that turned up the heat of criticism against the series. Lord Hill had previously been the chairman of the Independent Television Authority and ensured that that station (ITV) remained relatively controversy-free. He shared many of the same opinions as Mrs Whitehouse and the wider NVLA, which also clashed with the opinions of the then BBC Director General, Hugh Carleton-Greene (he is quoted as having the \"utmost contempt\" for Hill), who had been the series' biggest champion and gleefully ignored Mrs Whitehouse whenever he had to. Many other members of BBC Management also voiced their opinions directly to Hill over his appointment, most notably the then Controller of BBC-2, David Attenborough, who compared Hill being Chairman of the BBC Board of Governors to \"giving Rommel the command of the Eighth Army\". It should be added that neither Hill, nor his predecessor, Normanbrook, had any direct influence over the series itself (as the BBC Charter prohibits this), but their relationship with the Director-General indirectly influenced the programme. Because of his total personality and culture clash with Hill, Greene resigned in July 1968 (soon after the series ended its original run) and, with the series' biggest champion now out of the BBC, it looked like the Garnett family would be making no more new appearances on BBC Television, at least for the time being. Another champion of the series - Head of Comedy output at the BBC, Frank Muir had resigned his post between the second and third series to take up a new, similar, post at David Frost's fledgling new ITV franchise London Weekend Television, which would launch on 2 August 1968. His replacement - Michael Mills - recognised that the series had enormous potential but didn't understand why it had to be so topical, controversial or full of swearing and blasphemy, which hugely irritated Speight.", "Given the problems the series had given the BBC with steep pay increases in them midst of a Government-imposed public sector pay freeze, scripts being delivered in varying degrees of completeness (and sometimes not at all), several court cases (usually libel or blasphemy), hundreds of complaints, several run-ins with Mary Whitehouse and her NVLA, the loss of the series' two biggest champions (first Frank Muir then Hugh Carleton-Greene), the new management having different opinions over the programme and the general stress its production placed on staff (primarily down to the incomplete scripts submitted by Speight), all despite its ratings success over ITV (particularly over Coronation Street) in its first two series and its general popularity as a whole, contributed to the BBC getting cold feet over the programme. A planned fourth series, scheduled for autumn 1968, was scrapped."]}, {"page": "Cadbury", "response": ["The 2007 Gorilla advertisement promoting Cadbury Dairy Milk – featuring Phil Collins \"In the Air Tonight\" – won numerous awards, including Gold at the British Television Advertising Awards in 2008. Four commercials for Cadbury products featured in the top 50 of Channel 4’s 2000 UK poll of the \"100 Greatest Adverts\".  Cadbury Flake, featuring Flake Girl, was ranked 26th, Cadbury Dairy Milk Fruit & Nut, featuring the slogan 'Everyone's a fruit and nutcase' sung by comedian Frank Muir, ranked 36th, Fry's Turkish Delight, with the slogan 'Full of Eastern Promise' accompanied with model Jane Lumb, ranked 37th, and Cadbury Milk Tray (which since 1968 has been advertised by the 'Milk Tray Man', a tough James Bond–style figure who undertakes daunting 'raids' to surreptitiously deliver a box of Milk Tray chocolates to a lady), the \"Avalanche\" advert where he races ahead of it to deliver the chocolates, ranked 48th."]}, {"page": "List of British comedians", "response": ["*Frank Muir, Call My Bluff"]}, {"page": "Rector (academia)", "response": ["The role of the rector is considered by many students to be integral to their ability to shape the universities' agenda, and one of the main functions of the rector is to represent the interests of the student body. To some extent the office of rector has evolved into more of a figurehead role, with a significant number of celebrities and personalities elected as rectors, such as Stephen Fry and Lorraine Kelly at Dundee, Clarissa Dickson Wright at Aberdeen, and John Cleese and Frank Muir at St. Andrews, and political figures, such as Mordechai Vanunu at Glasgow. In many cases, particularly with high-profile rectors, attendance at the university court in person is rare; the Rector nominates an individual (normally a member of the student body) with the title of Rector's Assessor, who sits as a voting member of the University Court."]}, {"page": "Ronnie Barker", "response": ["Speculation began about Wiley's identity, with Tom Stoppard, Frank Muir, Alan Bennett and Noël Coward all rumoured. After the second series of Frost on Sunday, the cast and crew were invited to a Chinese restaurant, while Wiley said that he would reveal himself. Barker, who had told Corbett earlier in the day, stood up and announced he was Wiley, although initially nobody believed him.", "| Frank Muir Goes Into"]}, {"page": "June Whitfield", "response": ["Her big break came in 1953 when she replaced Joy Nichols in the successful Frank Muir and Denis Norden radio comedy Take It from Here, co-starring Jimmy Edwards and Dick Bentley. In the portion of the show known as \"The Glums\" she played Eth, fiancée of the dim Ron Glum (played by Bentley). During the next fifteen years Whitfield had many supporting roles on television, including in Dixon of Dock Green, Arthur's Treasured Volumes, The Arthur Askey Show, Faces of Jim, The Benny Hill Show, Steptoe and Son and Frankie Howerd. She played the nurse in the opening scene of \"The Blood Donor\" (Hancock, 1961). June's daughter Suzy Aitchison would play the same role in the 2009 re-recording  with Paul Merton portraying Tony Hancock."]}, {"page": "That Was the Week That Was", "response": ["Script-writers included John Albery, John Antrobus, John Betjeman, John Bird, Graham Chapman, John Cleese, Peter Cook, Roald Dahl, Robin Grove-White, Richard Ingrams, Lyndon Irving, Gerald Kaufman, Frank Muir, David Nobbs, Denis Norden, Bill Oddie, Dennis Potter, Eric Sykes, Kenneth Tynan, and Keith Waterhouse."]}, {"page": "Yes Minister", "response": ["The pilot was produced in 1979 but not transmitted immediately for fear that it could influence the results of the May 1979 UK General Election. It eventually aired on 25 February 1980. Yes Minister ran for three series, each of seven episodes, between March 1980 and 1982. These were followed by two Christmas specials: one 10-minute sketch as part of an anthology presented by Frank Muir, and then the hour-long \"Party Games\", in 1984. The latter's events led to Hacker's elevation to Prime Minister, dovetailing into the sequel, Yes, Prime Minister. This ran originally for two series, each of eight episodes, from 1986 to 1988. There was a further six-part series, with a new cast, in 2013."]}, {"page": "Balham", "response": ["For many years Balham was held up to mockery because of the comedy sketch \"Balham, Gateway to the South\".  Written by Frank Muir and Denis Norden, with Peter Sellers as the narrator, it satirised the travelogues of the day, with their faraway exotic locations, by highlighting the supposed tourist attractions of Balham in postwar austerity Britain.  The title's origin most probably alludes to a Southern Railway poster \"Gateway to the Continent\" dating from 1928 by T D Kerr. In 1979 Micky Dolenz of the Monkees directed a short film based on the sketch with Robbie Coltrane playing multiple roles. It was released for broadcast in 1981. The mockery ceased as Balham house prices soared."]}, {"page": "Leyton", "response": ["* Frank Muir (1920–1998) – Writer, television and radio personality"]}, {"page": "Simon Brett", "response": ["===Frank Muir Goes into===", "Each book is a compilation of the anecdotes taken from the BBC Radio 4 series 'Frank Muir Goes into', which was produced by Brett and presented by Frank Muir and Alfred Marks.", "*Frank Muir Goes into... (1978)", "*The Second Frank Muir Goes into... (1979)", "*The Third Frank Muir Goes into... (1980)", "*Frank Muir on Children (1980)", "*The Fourth Frank Muir Goes into... (1981)", "*Frank Muir presents the Book of Comedy Sketches (1982)"]}, {"page": "Richard Briers", "response": ["In 1961, Briers was cast in the leading role in Marriage Lines (1961–66) with Prunella Scales playing his wife. In between the pilot and the series itself, Briers appeared in Brothers in Law (from the book by Henry Cecil) as callow barrister Roger Thursby in 1962. He was cast in this role by adaptors Frank Muir and Denis Norden, who had seen him in the West End."]}, {"page": "Shipping Forecast", "response": ["Frank Muir and Denis Norden parodied the Shipping Forecast in a song written for an episode of Take It From Here:"]}, {"page": "Ralph Richardson", "response": ["As a man, Richardson was on the one hand deeply private and on the other flamboyantly unconventional. Frank Muir said of him, \"It's the Ralphdom of Ralph that one has to cling to; he wasn't really quite like other people.\" In Coveney's phrase, \"His oddness was ever startling and never hardened into mere eccentricity.\"  Richardson would introduce colleagues to his ferrets by name, ride at high speed on his powerful motor-bike in his seventies, have a parrot flying round his study eating his pencils, or take a pet mouse out for a stroll, but behind such unorthodox behaviour there was a closely guarded self who remained an enigma to even his closest colleagues.Miller, p. 137; Stokes, John. \"Typecast by his time\", The Guardian, 24 November 1995, p. A22 Tynan wrote in The New Yorker that Richardson \"made me feel that I have known this man all my life and that I have never met anyone who more adroitly buttonholed me while keeping me firmly at arm's length.\"Quoted in Levin, Bernard. \"Tynan, fizzing to the last\", The Times, 22 October 1980, p. 12"]}, {"page": "Dandy Nichols", "response": ["In the original scripts, Alf was to refer to his wife as a \"silly cow\". This was firmly vetoed by BBC Head of Comedy Frank Muir, who thought this was inappropriate. Nichols said that it was \"a lot of silly fuss about a silly moo\" which was overheard by script writer Johnny Speight and became the series' most enduring catchphrase."]}, {"page": "Peter Ustinov", "response": ["Between 1952 and 1955, he starred with Peter Jones in the BBC radio comedy In All Directions. The series featured Ustinov and Jones as themselves in a London car journey perpetually searching for Copthorne Avenue. The comedy derived from the characters they met, whom they often also portrayed. The show was unusual for the time, as it was improvised rather than scripted. Ustinov and Jones improvised on a tape, which was difficult, and then edited for broadcast by Frank Muir and Denis Norden, who also sometimes took part."]}, {"page": "1998 in literature", "response": ["*January 2 – Frank Muir, English comedy writer and broadcaster (born 1920)"]}, {"page": "Only Fools and Horses", "response": ["Several mini-episodes were produced. An eight-minute episode aired on 27 December 1982 as part of a show hosted by Frank Muir, The Funny Side of Christmas, and attracted 7.2 million viewers. A 5-minute spoof BBC documentary was shown on Breakfast Time on 24 December 1985, with Del being investigated by a BBC consumer expert. An educational episode named \"Licensed to Drill\", in which Del, Rodney and Grandad discuss oil drilling, was recorded in 1984 but only shown in schools. A 5-minute 1990–91 Persian Gulf War special (dated 1 December 1990) has Del, Rodney, and Albert convey a message to British troops serving in the conflict. It has never been broadcast commercially, but a copy exists at the Imperial War Museum, London. A Comic Relief special showing Del, Rodney and Albert making an appeal for donations was shown on 14 March 1997, with 10.6 million viewers. A Sport Relief special was aired on 21 March 2014."]}, {"page": "All Gas and Gaiters", "response": ["In April 2016 the radio drama based on the story behind the making of the series, All Mouth and Trousers by Mark Burgess, was aired by BBC Radio 4. The production featured John Sessions as Frank Muir, Nicholas Boulton as Stuart Allen, Gareth Williams as William Mervyn, Trevor Littledale as Robertson Hare, Zeb Soanes as Derek Nimmo and David Collings as John Barron."]}, {"page": "My Word!", "response": ["My Word! is a British radio quiz panel game broadcast by the BBC on the Home Service (1956–67) and Radio 4 (1967–88). It was created by Edward J. Mason and Tony Shryane, and featured the humorous writers Frank Muir and Denis Norden, known in Britain for the series Take It From Here. The show was piloted in June 1956 on the Midland Home Service and broadcast as a series on the national Home Service network from 1 January 1957. The series also ran on BBC Television for one series from July–September 1960.", "In 1956, Edward J. Mason and Tony Shryane, respectively the writer and producer of the popular radio soap opera The Archers, decided that by way of a change they would devise and produce what Frank Muir called \"a new kind of not-very-academic literary quiz\".Muir, p. 209 The Aeolian Hall in London was booked for the recording of a pilot show, but at the last minute two of the four panellists were unexpectedly unavailable. Shryane sought the help of Muir and his writing partner Denis Norden, scriptwriters of the popular BBC comedy series Take It From Here, who were based in a nearby office. They thought of themselves as writers rather than performers, but at Shryane's urgent request they agreed to stand in for the absentees.Muir, pp. 209–210 Muir was partnered by Isobel Barnett – a panel show regular – and Norden by the journalist Nancy Spain. Mason set the questions, and the chairman was the cricket commentator and poet John Arlott, who was billed as \"umpire\". The pilot was well received by the audience in the hall and by listeners to its first transmission. The BBC commissioned a series, which was transmitted in early 1957. Muir and Norden had no intention of becoming regular panellists, but Shyrane persuaded them.", "| Isobel Barnett (pilot and episodes 2, 3 and 4),E. Arnot Robertson (episodes 1 and 5–14),Frank Muir, Denis Norden, Nancy Spain"]}, {"page": "My Music (radio programme)", "response": ["My Music was a radio panel show which premiered on the BBC Home Service on 3 January 1967.  It was a companion programme to My Word!, and like that show featured comic writers Denis Norden and Frank Muir. The show was last recorded in November 1993 and broadcast in January 1994, then rebroadcast until 2011. It was also broadcast via the BBC World Service.  There was also a television version on BBC2 which ran for seven series between 1977 and 1983.", "* 1967–1973: Ian Wallace and Denis Norden versus David Franklin and Frank Muir", "* 1973: Ian Wallace and Denis Norden versus Owen Brannigan and Frank Muir", "* 1974–1994: Ian Wallace and Denis Norden versus John Amis and Frank Muir (these four participants also contested the TV version)", "# Tuesday 21 February 1967 (Lionel Hale stands in for Frank Muir who is indisposed)", "# Monday 27 May 1968 repeated Sunday 2 June 1968  (Michael Flanders stands in for Frank Muir)", "# Monday 24 March 1969 repeated Sunday 30 March 1969  (Barry Took stands in for Frank Muir)", "Monday 25 December 1972  My Word! It’s My Music - A Christmas edition of the two radio panel games with Dilys Powell , David Franklin and Frank Muir who challenge Anne Scott-James , Ian Wallace and Denis Norden. In the chair  Sir Jack Longland and Steve Race who compiled the questions. Broadcast at 7.30pm.", "* You'd Be So Nice to Come Home to (Frank Muir)", "* The Rose of Tralee (Frank Muir)", "* Tiptoe Through the Tulips (Frank Muir)", "* I'm in the Mood for Love (Frank Muir)", "* Why Do I Love You? (Frank Muir)", "* Apple Blossom Time (Frank Muir)", "* I'll Be Your Sweetheart (Frank Muir)", "* Whispering Grass (Frank Muir)", "* Cuddle Up A Little Closer (Frank Muir)", "* Tea for Two (Frank Muir)", "* The Honeysuckle and the Bee (Frank Muir)", "* My Old Dutch (Frank Muir)", "* Darling Je Vous Aime Beaucoup (Frank Muir)", "* All of Me (Frank Muir)", "* Mean to Me (Frank Muir)", "* Paper Doll (Frank Muir)", "* The Hut Sut Song (Frank Muir)", "* Oh, You Beautiful Doll (Frank Muir)", "* The Band Played On (Frank Muir)", "* All Alone (Frank Muir)", "* Wait Till the Sun Shines Nellie (Frank Muir)", "* At Sundown (Frank Muir)", "* I Love My Baby (Frank Muir)", "* Keep Your Sunny Side Up (Frank Muir)", "* The One I Love (Belongs to Somebody Else) (Frank Muir)", "* Pennies from Heaven (Frank Muir)", "* Waiting for the Robert E. Lee (Frank Muir)", "* Hey Look Me Over (Frank Muir)", "* My Melancholy Baby (Frank Muir)", "* Yes Sir, That's My Baby (Frank Muir)", "* Good Morning (Frank Muir)", "* Tea for Two (Frank Muir)", "* It Is Only Paper Moon (Frank Muir)", "* Gilbert the Filbert (Frank Muir)", "* Every Little Moment (Frank Muir)", "* Nice Work if You Can Get It (Frank Muir)", "* That Certain Party (Frank Muir)", "* Hello, Hello Who's Your Lady Friend? (Frank Muir)", "* My Ragtime Gal (Frank Muir)", "* The Nipper's Lullaby (Frank Muir)", "* Easy Street (Frank Muir)", "* Nobody's Using it Now (Frank Muir)", "* Auf Wiedersehen, My Dear (Frank Muir)", "* Hello, Hello Who's Your Lady Friend? (Frank Muir)", "* Tiptoe Through the Tulips (Frank Muir)", "* I'll See You Again (Frank Muir)", "* Get Out & Get Under (Frank Muir)", "* There's A Small Hotel (Frank Muir)", "* Don't Have Any More Mrs Moore (Frank Muir)", "* Did You Ever See A Dream Walking? (Frank Muir)", "* Deep Purple (Frank Muir)", "* Down the Road (Frank Muir)", "* Ramona (Frank Muir)", "* Lily of Laguna (Frank Muir)", "* Boiled Beef & Carrots (Frank Muir)", "* Imagination (Frank Muir)", "* Margie (Frank Muir)", "* · If You Knew Susie (Frank Muir)", "*Race, Steve (1979) My Music;  with the contributions of Frank Muir, Denis Norden, Ian Wallace, John Amis and David Franklin; drawings by John Jensen. London: Robson  (Based on the radio and television programme My Music, \"the panel game originated by Edward J. Mason and Tony Shryane.\")"]}, {"page": "Take It from Here", "response": ["Take It from Here (often referred to as TIFH, pronounced – and sometimes humorously spelt – \"TIFE\") is a British radio comedy programme broadcast by the BBC between 1948 and 1960.  It was written by Frank Muir and Denis Norden, and starred Jimmy Edwards, Dick Bentley and Joy Nichols. When Nichols moved to New York City in 1953, she was replaced by June Whitfield and Alma Cogan. The show is best remembered for introducing The Glums. Through TIFH Muir and Norden reinvented British post-war radio comedy – amongst other influences, it was one of the first shows with a significant segment consisting of parody of film and book styles, later used extensively in programmes such as Round the Horne and in many television comedy series.", "Frank Muir had been writing material for Jimmy Edwards's appearances at the Windmill Theatre, and later wrote material for Edwards's radio character, a seedy public school headmaster; Denis Norden had been staff comedy sketch writer with the Kavanagh agency, and had written material for the Australian comedian Dick Bentley. The radio producer Charles Maxwell had contracted Edwards, together with Joy Nichols and Dick Bentley, for the final series in 1947 of the radio show Navy Mixture for which Muir had provided some scripts, and after this show ended Maxwell received a commission for a new weekly comedy series to star Edwards, Nichols and Bentley. He introduced Muir to Norden, and asked them if they would collaborate to write the scripts.", "While the humour was undoubtedly parochially British, in his autobiography Frank Muir expressed gratification and wonder that the show was so well received in Australia – where TIFHs subtlety, and the show's implied confidence in the listeners' level of intelligence, were commented on in the Australian press as characteristics one would have expected to lead to the show's failure there!", "*  Frank Muir's autobiography."]}, {"page": "Denis Norden", "response": ["Denis Mostyn Norden  (6 February 1922 – 19 September 2018) was an English comedy writer and television presenter. After an early career working in cinemas, he began scriptwriting during the Second World War. From 1948 to 1959, he co-wrote the BBC Radio comedy programme Take it from Here! with Frank Muir. Muir and Norden remained associated for more than 50 years, appearing regularly together on the radio panel programmes My Word! and My Music after they stopped collaborating on scripts. He also wrote scripts for Hollywood films. He presented television programmes on ITV for many years, including the nostalgia quiz Looks Familiar and blooper shows It'll be Alright on the Night and Laughter File.", "After the war, Norden wrote material for comedian Dick Bentley, before meeting Frank Muir (who wrote for comic actor Jimmy Edwards) in 1947; they were brought together by producer Ted Kavanagh. Muir and Norden's first joint venture was a radio show for both performers, Take it from Here!, which they scripted from 1948 to 1959. They went on to write many successful radio and television scripts, including Whack-O! (1956–1960) and three series of Faces of Jim (1961–1963) which were vehicles for Jimmy Edwards. They also wrote the satirical sketch Balham, Gateway to the South for the BBC Third Programme. The sketch, which had originally been broadcast in 1948 as part of a comedy series called The Third Division and which featured actor Robert Beatty, was later performed by Peter Sellers for his LP, The Best of Sellers (1959). In the early 1960s, Muir and Norden wrote the sitcom Brothers in Law, an early series featuring Richard Briers, and its spin-off Mr Justice Duncannon.", "For years, he was resistant to producing an autobiography, saying that much of his life and career had already been well covered by Frank Muir's A Kentish Lad and that a book called The Bits Frank Left Out would be too brief. Nevertheless, in October 2008, a book containing a sequence of autobiographical sketches was published entitled Clips from a Life. He continued to make occasional television and radio appearances. He contributed to a BBC Four season about the history of satire, and he appeared as a guest on The One Show on 2 October 2008 to talk about his life and career as well as his book. He was interviewed in a one-off documentary called Der Sommer 1939 (\"The Summer of 1939\"), which was broadcast on 12 August 2009 on the Franco-German television station Arte. Norden also appeared as part of a contribution of show business friends, writers and performers in the BBC documentary The Secret Life of Bob Monkhouse in January 2011..."]}, {"page": "At Last the 1948 Show", "response": ["* Frank Muir – Saudi entourage in Studio Tour"]}, {"page": "London Weekend Television", "response": ["The London Television Consortium (LTC) was created and led by television presenter David Frost, who, at the time, was working for the London weekday ITV station Rediffusion. The consortium also included three ex-BBC members of staff: Michael Peacock (controller of BBC1), Frank Muir (assistant head of BBC comedy) and Doreen Stephens (head of children's output).  Rediffusion's Controller of Programmes, Cyril Bennett, also joined the consortium, along with Clive Irving, theatre director Peter Hall\"British TV History: The ITV Story: Part 10: The New Franchises\" , Teletronic and, for financial backing, Arnold Weinstock, managing director of GEC.", "Other notable early shows included We Have Ways of Making You Laugh (a sketch show starring Frank Muir which was due to be the first programme scheduled to be aired on LWT, but industrial action blacked it out early in the first show); the children's fantasy Catweazle; and several sitcoms, including the popular No, Honestly, On the Buses, Please Sir!, Me and My Girl and Mind Your Language, and cult favourites such as End of Part One, Whoops Apocalypse and Hot Metal. The channel also created the comedy-clips format with It'll Be Alright on the Night, Clive James on Television and Game for a Laugh; the latter in turn spawned Beadle's About and You've Been Framed!."]}, {"page": "Rose is a rose is a rose is a rose", "response": ["* In the English radio series My Word!, Frank Muir was called on to explain the origin of the sentence. His explanation: Nero and Cicero had rose gardens next to each other. The tender of Nero's garden had a mishap and destroyed a whole row of roses. So he sneaked over to Cicero's garden, stole a row from there and replaced the ones missing in his master's garden. However, they were white, while the ones in Nero's garden were pink or \"rose-colored\". When Nero saw this he wrote a note to the gardener: \"Our roses are rose. Is a row Cicero's?\" He has also rendered it as \"Arrows sees Harrow's Ciceros\" in a spin-off book You Can't Have Your Kayak and Heat It."]}, {"page": "Graham Hill", "response": ["Hill's easy wit and charm helped him become a television personality, notably on the BBC show Call My Bluff with Patrick Campbell and Frank Muir. For a number of years in the early 1970s he appeared as one half of a double act, with Jackie Stewart, as an insert within the BBC Sports Personality of the Year show. In June 1975 he appeared alongside his son, Damon Hill, on the popular television programme Jim'll Fix It. His appearance was later rebroadcast as part of the twentieth anniversary celebrations of the programme in January 1995, with Damon presenting a new segment at the end."]}]}}