{"wiki_id": "http://www.wikidata.org/entity/Q3087170", "itemLabel": "Frederick Stopford", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Stopford", "wikipedia_page": {"main": "Lieutenant General Sir Frederick William Stopford  (2 February 1854 – 4 May 1929) was a British Army officer, best remembered for commanding the landing at Suvla Bay in August 1915, during the Gallipoli Campaign.\n\n", "link_mentions": [{"page": "Gallipoli campaign", "response": ["The landing at Suvla Bay took place on the night of 6 August against light opposition; the British commander, Lieutenant General Frederick Stopford, had limited his early objectives and then failed to forcefully push his demands for an advance inland and little more than the beach was seized. The Ottomans were able to occupy the Anafarta Hills, preventing the British from penetrating inland, which contained the landings and reduced the Suvla front to static trench warfare. The offensive was preceded on the evening of 6 August by diversions, at Helles, where the Battle of Krithia Vineyard became another costly stalemate. At Anzac, the diversionary Battle of Lone Pine, led by the Australian 1st Infantry Brigade, captured the main Ottoman trench line and diverted Ottoman forces but the attacks at Chunuk Bair and  failed."]}, {"page": "New Zealand and Australian Division", "response": ["The plan for the offensive focused upon the capture of the Sari Bair Range, with preliminary objectives being Hill 971 and Chunuk Bair to its south-west. Meanwhile, another landing would be made by predominately British forces at Suvla Bay, to the north of Anzac Cove, under the command of Lieutenant General Frederick Stopford. Godley was placed in overall command of the offensive around Hill 971 and Chunuk Bair. In July, the New Zealand and Australian Division was reinforced by elements of the 29th Indian Infantry Brigade and the British 13th Division in preparation for the coming offensive.  For the initial attack, the division was split into two elements. Johnston's New Zealand Infantry Brigade was to advance on the right up several steep features to capture Chunuk Bair via Rhododendron Ridge, while Monash and the Australian 4th Brigade was assigned to the left column under Cox, along with several British and Indian units, and was tasked with taking Hill 971."]}, {"page": "Battle of Sari Bair", "response": ["The Suvla landing was to be made by the British IX Corps, under the command of Lieutenant-General Sir Frederick Stopford who had retired in 1909 and had never commanded men in battle. His appointment was made based solely on seniority but his hesitancy during the preparations for the landing should have warned Hamilton that he was not a fit choice for the command."]}, {"page": "Battle of Hill 60 (Gallipoli)", "response": ["The Battle of Hill 60 was the last major assault of the Gallipoli Campaign. It was launched on 21 August 1915 to coincide with the attack on Scimitar Hill made from the Suvla front by Major-General H. de B. De Lisle's British IX Corps, Frederick Stopford having been replaced in the few days previous. Hill 60 was a low knoll at the northern end of the Sari Bair range which dominated the Suvla landing. Capturing this hill along with Scimitar Hill would have allowed the Anzac and Suvla landings to be securely linked."]}, {"page": "Battle of Scimitar Hill", "response": ["Paralysis had set in to the British campaign in the Dardanelles after repeated failures to advance at Helles on the tip of the peninsula since the original 25 April landings. In August a new offensive, known as the Battle of Sari Bair, was opened at Suvla in an attempt to regain the initiative from the Ottomans. Two divisions of Lieutenant-General Sir Frederick Stopford's IX Corps were landed at Suvla on the night of 6 August while a simultaneous breakout was made from the long-stagnant Anzac sector to the south of Suvla."]}, {"page": "Battle of Chunuk Bair", "response": ["The failure of the Allies to capture Krithia or make any progress on the Cape Helles front, led General Ian Hamilton, commander of the Mediterranean Expeditionary Force (MEF) to pursue a new plan to secure the Sari Bair Range and capture the high ground of  and Chunuk Bair. Both sides had been reinforced, with Hamilton's original five divisions increased to 15 divisions and the six original Ottoman divisions having grown to a force of 16 divisions. The British planned to land two fresh infantry divisions from IX Corps (Lieutenant-General Frederick Stopford), at Suvla,  north of Anzac, followed by an advance on Sari Bair from the north-west to ."]}, {"page": "Earl of Courtown", "response": ["The Hon. Sir Montagu Stopford, fifth son of the third Earl, was a vice-admiral in the Royal Navy. His youngest son Sir Lionel Stopford was a colonel and honorary major-general in the Derby Regiment and Irish Guards. His eldest son Sir Montagu Stopford was a general in the Rifle Brigade. The Hon. Sir Frederick Stopford, second son from the second marriage of the fourth Earl, was a lieutenant-general in the army. The Hon. Walter George Stopford (1855–1918), third son from the second marriage of the fourth Earl, was a rear-admiral in the Royal Navy. The Hon. Arthur Stopford (1879–1955), second son of the sixth Earl, was a vice-admiral in the Royal Navy. His son, Godfrey Vyvyan, married Marjorie Lupton in 1934. "]}, {"page": "Territorial Force", "response": ["The campaign ended in withdrawal in January 1916. Although Hamilton, appointed to command the Mediterranean Expeditionary Force in March 1915, praised the courage of the territorials, he criticised the performance of the 53rd and 54th Divisions. His comments failed to recognise the difficulties the two divisions had faced with the loss of many of their trained men transferred to other units before their arrival at Gallipoli.Beckett 2008 p. 80 Lieutenant-Colonel E. C. Da Costa, GSO1 of the 54th Division, refuted accusations by Lieutenant-General Sir Frederick Stopford, commander of IX Corps, that the division lacked attacking spirit and was badly led. Da Costa claimed that its poor performance was entirely due to the way it had been \"chucked ashore\" and thrown into a poorly-coordinated and ill-defined attack.Mitchinson 2014 pp. 121–122"]}, {"page": "IX Corps (United Kingdom)", "response": ["The IX Corps was originally formed in England in 1915 in readiness to make a new landing at Suvla during the Battle of Gallipoli. Headquarters was formed at the Tower of LondonThe British Corps of 1914-1918 at Long, Long TrailBecke, pp. 185–91. Command of the corps was given to Lieutenant-General Sir Frederick Stopford.  His handling of the corps during the August Offensive warranted his replacement after only 9 days with Lieutenant-General Julian Byng.", "* Lieutenant General Frederick StopfordFrederick Stopford at First World War Biography (17 June 1915–16 August 1915)"]}, {"page": "Timeline of the Gallipoli Campaign", "response": ["*15 – Suvla: General Sir Frederick Stopford is sacked as commander of IX Corps."]}, {"page": "Edward Unwin", "response": ["In August, when a new landing was to be made by the British IX Corps at Suvla as part of the Battle of Sari Bair, Unwin was given command of the landing boats, known as Beetles. He was the first to report on the landing to the corps commander, Lieutenant General Sir Frederick Stopford, and advised against landing further troops inside Suvla Bay due to the darkness and reefs."]}, {"page": "Page of Honour", "response": ["*1866–1870: Hon. Frederick Stopford"]}, {"page": "Landing at Suvla Bay", "response": ["Although initially successful, against only light opposition, the landing at Suvla was mismanaged from the outset and quickly reached the same stalemate conditions that prevailed on the Anzac and Helles fronts. On 15 August, after a week of indecision and inactivity, the British commander at Suvla, Lieutenant-General Sir Frederick Stopford, was dismissed. His performance in command is often considered one of the most incompetent feats of generalship of the First World War.", "The Suvla landing was to be made by the newly formed British IX Corps, initially comprising two brigades of the 10th (Irish) Division and the entire 11th (Northern) Division. Command of IX Corps was given to Lieutenant-General Sir Frederick Stopford. British military historian J. F. C. Fuller said of Stopford that he had \"no conception of what generalship meant\" and indeed he was appointed not on his experience (he had seen little combat and had never commanded men in battle) or his energy and enthusiasm (he was aged 61 and had retired in 1909) but because of his position on the list of seniority.  Hamilton had requested either Lieutenant-General Julian Byng or Lieutenant-General Henry Rawlinson, both experienced Western Front corps commanders, but both were junior to Lieutenant-General Sir Bryan Mahon, commander of the 10th Division and so, by a process of elimination, Stopford was selected."]}, {"page": "Major-General commanding the Household Division", "response": ["*Major-General Sir Frederick Stopford,  1906–1909 late Grenadier Guards"]}, {"page": "Military history of Australia during World War I", "response": ["However, the main assault aimed at the peaks of Chunuk Bair and Hill 971 was less successful. The force striking for the nearer peak of Chunuk Bair comprised the New Zealand Infantry Brigade. It came within  of the peak by dawn on 7 August but was not able to seize the summit until the following morning. This delay had fatal consequences for another supporting attack on the morning of 7 August, that of the 3rd Light Horse Brigade at the Nek which was to coincide with the New Zealanders attacking back down from Chunuk Bair against the rear of the Turkish defences. The New Zealanders held out on Chunuk Bair for two days before relief was provided by two New Army battalions from the Wiltshire and Loyal North Lancashire Regiments. A massive Turkish counter-attack, led in person by Mustafa Kemal, swept these two battalions from the heights. Meanwhile, the landing at Suvla Bay was only lightly opposed but the British commander, Lieutenant General Sir Frederick Stopford, had so diluted his early objectives that little more than the beach was seized. Again the Turks were able to win the race for the high ground of the Anafarta Hills thereby rendering the Suvla front another case of static trench warfare."]}, {"page": "Frederick William Stopford", "response": ["#redirect Frederick Stopford"]}, {"page": "James Stopford, 4th Earl of Courtown", "response": ["Lord Courtown married, firstly, his first cousin Lady Charlotte Albina, daughter of Charles Montagu-Scott, 4th Duke of Buccleuch, in 1822. They had two sons, James and Edward. After her death in February 1828, aged 28, he married, secondly, Dorothea (Dora), daughter of Edward Pennefather, Lord Chief Justice of Ireland and Susanna Darby. They had three sons, of whom the two youngest gained distinction. The Hon. Sir Frederick Stopford was a lieutenant general in the Army and the Hon. Walter George Stopford (1855–1918) was a Rear-Admiral in the Royal Navy. Lord Courtown died in November 1858, aged 64, and was succeeded in the earldom by his son from his first marriage, James. Lady Courtown survived her husband by just over a year and died in December 1859."]}, {"page": "Isle of Wight Rifles", "response": ["In an effort to re-invigorate the stalled Gallipoli campaign an Allied force under Lieutenant-General Hon Sir Frederick Stopford had landed at Suvla Bay on 7–8 August 1915. The beach led to a plain overlooked by a range of hills. Stopford (who set up his command post in a sloop – HMS Jonquil – anchored offshore) took the beaches but waited whilst stores were landed before occupying the empty hills. By the time he decided to move upon them the Turks had filled them full of artillery and infantry. 163rd Brigade, consisting of the 1/5th Suffolks, 1/4th & 1/5th Norfolk Regiment, and 1/8th Hampshires (IoW Rifles), was landed on 10 August 1915 in order to attack the Turkish positions on Anafurta Ridge. Stopford delayed the attack, wishing to make good losses in his lines, until pressured by the overall commander, General Sir Ian Hamilton, to order the attack. This delay gave the Turks full warning of the impending attack.Aspinall-Oglander, pp. 312–5.North, pp. 174–6."]}, {"page": "Royal Australian Naval Bridging Train", "response": ["Come March, the Train was in high demand. Admiral Wemyss, now in command of East Indies & Egyptian Squadron,Heathcote, p. 251 who wanted to use the Train to operate river transports and work as gun crews supporting the Mesopotamian campaign. General Sir Julian Byng, who had taken command of IX Corps at Suvla Bay when the elderly General Frederick Stopford was relieved for incompetence, wanted to bring the Train south to No. 4 Section, Suez Canal, which included all of the Canal south of Small Bitter Lake. Also in March, Lieutenant Bond was transferred to the Naval Intelligence detachment in Alexandria, with Lt Clarence Read taking his place as First Lieutenant."]}, {"page": "Stopford", "response": ["* Frederick Stopford, British general at Gallipoli"]}, {"page": "List of commanders in the Middle Eastern theatre of World War I", "response": ["| Frederick Stopford"]}, {"page": "Edward Pennefather", "response": ["In 1806 he married Susannah Darby,  eldest daughter of John Darby of Leap Castle, County Offaly,   and his wife Anne Vaughan,  and sister of John Nelson Darby, one of the most influential of the early Plymouth Brethren.Norgate p.325  They had ten children, including Edward, the eldest son and heir; Richard, Auditor General of Ceylon;   Ellen, who married James Thomas O'Brien, Bishop of Ossory, Ferns and Leighlin,  and Dorothea,  (Dora)  (1825-1859), who married in 1850, as his second wife, James Stopford, 4th Earl of Courtown, and had three sons.  Two of Dora's sons, General Sir Frederick Stopford, commander at the Landing at Suvla Bay, and Admiral Walter Stopford, became famous.Norgate p.325"]}, {"page": "August 1915", "response": ["* Landing at Suvla Bay — Reinforcement divisions from the British IX Corps under command of General Frederick Stopford landed at Suvla as part of a new offensive on the Gallipoli peninsula.", "* Landing at Suvla Bay — General Ian Hamilton, commander of the Mediterranean Expeditionary Force during the Gallipoli campaign, met with General Frederick Stopford and noted the landing was going too slowly, allowing Ottoman forces to reorganize their defenses. He pushed Stopford to order a march on Ottoman defenses 12 hours sooner than planned.Steel 1994, pp. 214–217", "* Landing at Suvla Bay — Frustrated by General Frederick Stopford's indecisiveness to act quickly as casualties mounted by aggressive Ottoman defense maneuvers, Gallipoli campaign commander General Ian Hamilton cabled Field Marshal Herbert Kitchener and requested a change of command.Steel 1994, pp. 214–217", "* Landing at Suvla Bay — Lieutenant-general Frederick Stopford, commander of the landing at Sulva, was sacked and replaced with Lieutenant-general Julian Byng (with Major-General Beauvoir De Lisle as interim commander while Byng was traveling from his previous post in France.Steel 1994, pp. 214–217"]}, {"page": "Order of battle for the Gallipoli campaign", "response": ["** IX Corps (Lieutenant General Frederick Stopford)"]}, {"page": "Second Army (Home Forces)", "response": ["Second Army was formed on 5 August 1914 under the command of Central Force. It was based at Aldershot and Sir Frederick Stopford was the Army Commander. Units attached to the Army were the 1st London Division, the Home Counties Division and the South Eastern Mounted Brigade. By November 1914 Army HQ had moved to Tunbridge Wells."]}, {"page": "Cheshire Brigade", "response": ["159th Brigade completed its landing at C Beach in the morning and its four battalions were immediately placed under the command of Brig-Gen W.H. Sitwell of 34th Brigade, 11th (Northern) Division, who was in charge of scattered units that were 'in a desperate condition' after a failed attack on Scimitar Hill and the W Hills. 159th Brigade arrived in time to see the troops of 33rd Brigade retreating to the beach from Scimitar Hill 'like a crowd streaming away from a football match'. The staff of 159th Brigade had neither maps nor any information on the situation, but were ordered to send two battalions to reinforce Sitwell, who was 'somewhere over there in the bush'. The staff therefore spread out in a line on a front of nearly half a mile before finding him. Next morning the brigade was ordered to capture Scimitar Hill, but most of its other two battalions could not be found and it started without them. The advance by 1/4th Cheshires, 1/5th Welsh and 1  companies of 1/7th Cheshires began from trenches north of Sulajik at 06.00 on the morning of 10 August with no cohesion. Fire from skirmishers and unconfirmed rumours of a Turkish counter-attack 'threw back the leading troops in disorder, despite acts of individual gallantry'. 158th (North Wales) Brigade, coming up in support but equally ignorant of the terrain or the situation, met parties of 159th Brigade coming back in full retreat, and the whole advance came to nothing. A further attack was called off. Afterwards the corps commander, Lt-Gen Sir Frederick Stopford, complained that 53rd (W) Division was a 'sucked orange', with its best-trained battalions having gone to the Western Front. After the failed attack on Scimitar Hill, Stopford said, the division was 'merely losing heart from ignorance of the situation and lack of intelligent orders', as a result it was 'only a danger' and might 'bolt at any minute'. But the front line at Suvla Bay was now quiet: a staff officer found men of 53rd (W) Division in a line of lightly dug trenches with men standing about on the parapet and even cooking in front of the trenches, with no Turks in sight. One final fruitless attack on the W Hills was made by 11th (N) Division and 2nd Mounted Division, with 53rd (W) Division instructed to 'take advantage of any opportunity to gain ground'.North, pp. 170–83.Ward, pp. 34–41."]}, {"page": "1st Flintshire Rifle Volunteers", "response": ["The corps commander, Lt-Gen Sir Frederick Stopford, had lost confidence in 53rd (W) Division, and would not use it in the subsequent phases of the battle.Aspinall-Oglander, pp. 314–20. Over the following days the battalion was engaged in reorganising and improving the trenches facing Scimitar Hill, taking casualties from Turkish rifle fire. It also had 160 sick men evacuated to hospital by the end of the month, another 180 by the end of September.Aspinall-Oglander, pp. 338, 389.Ward, pp. 41–6."]}, {"page": "6th (Caernarvonshire and Anglesey) Battalion, Royal Welch Fusiliers", "response": ["The corps commander, Lt-Gen Sir Frederick Stopford, had lost confidence in 53rd (W) Division, and would not use it in the subsequent phases of the battle.Aspinall-Oglander, pp. 314–20. Over the following days the division was engaged in reorganising and improving the trenches facing Scimitar Hill, taking casualties from Turkish rifle fire. It also began to suffer badly from sickness.Aspinall-Oglander, pp. 338, 389.Ward, pp. 41–6."]}, {"page": "7th (Merionethshire and Montgomeryshire) Battalion, Royal Welch Fusiliers", "response": ["The corps commander, Lt-Gen Sir Frederick Stopford, had lost confidence in 53rd (W) Division, and would not use it in the subsequent phases of the battle.Aspinall-Oglander, pp. 314–20. On 14 August the 1/7th RWF was sent down to 'C' Beach and re-embarked for Mudros, where it spent the next two months unloading stores and guarding Turkish prisoners. During its five days on the Gallipoli peninsula it had suffered 9 officers and 13 other ranks (ORs) killed or died or wounds, 7 officers and 138 ORs wounded and 74 ORs missing.Ward, p. 44."]}]}}