{"wiki_id": "http://www.wikidata.org/entity/Q3081694", "itemLabel": "Francis Sparks", "itemDescription": "English footballer (1855-1934)", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Sparks", "wikipedia_page": {"main": "Francis John Sparks (4 July 1855 – 13 February 1934) was an English amateur footballer, who played as a forward. He won the FA Cup in 1880 with Clapham Rovers and made three appearances for England, scoring three goals and being appointed captain.", "link_mentions": [{"page": "Wanderers F.C.", "response": ["*Francis Sparks (3 caps)"]}, {"page": "1879–80 in English football", "response": ["|Billy Mosforth (The Wednesday) (8 mins), Charles Bambridge (Swifts) (42 & 87 mins) & Francis Sparks (Clapham Rovers) (89 mins)", "|Francis Sparks (Clapham Rovers) (50 & 70 mins) & Tom Brindle (Darwen) (55 mins)"]}, {"page": "Clapham Rovers F.C.", "response": [": Reginald Birkett, Robert Ogilvie, Edgar Field, Vincent Weston, Norman Bailey, Arthur Stanley, Harold Brougham, Francis Sparks, Felix Barry, Edward Ram, Clopton Lloyd-Jones.", "*Francis Sparks (2 caps)"]}, {"page": "1850s in association football", "response": ["* 4 July – Francis Sparks (d. 1934), England international forward in three matches (1879–1880), scoring three goals."]}, {"page": "1880 FA Cup Final", "response": ["In the second half, six minutes before the close of time, the deadlock was broken when Francis Sparks conducted the ball to within \"about six yards of the University goal\".  Although Oxford's Charles King attempted to stop the ball with a weak mis-kick, Lloyd-Jones, \"who had followed well up shot it between the posts. This feat quite 'brought down the house.'\" According to The Field magazine's report, there was \"vociferous cheering, throwing up of hats, and other demonstrations of delight from their supporters.\"  At the game's end, Lloyd-Jones, and his team captain Robert Ogilvie, were specially cheered by the crowd. At 21 years and 150 days Lloyd-Jones was the 'baby' of his team and the youngest Cup Final scorer to date.Lloyd-Jones surpassed Charles Clerke (Old Etonians), who was 21 years 173 days at the 1879 Cup Final, and then surpassed in turn by Teddy Wynyard (Old Carthusians), who was aged 20 years 8 days at the 1881 Cup Final.", "|FW ||   || Francis Sparks "]}, {"page": "Hertfordshire Rangers F.C.", "response": ["* Francis Sparks (1879)"]}, {"page": "John Sands (footballer)", "response": ["Shortly before the 1880 semi-final (played on 27 March 1880), Sands was selected for his only appearance for England away to Wales on 15 March. Sands was one of six players who made their England debut in this match which England won 3–2 with two goals scored by Francis Sparks of Clapham Rovers. Thomas Brindle had to leave the game in the second half due to injury, and England played on with ten men.Wales 2 England 3, 15 March 1880 (Match summary)"]}, {"page": "William Brindle", "response": ["Two days later, he played his second (and last) England match, when they met Wales at the Racecourse Ground, Wrexham. Six players made their England debut in this match which England won 3–2 with two goals scored by Francis Sparks of Clapham Rovers. Brindle scored the opening goal in the 50th minute, but had to leave the game 15 minutes later due to injury, and England played on with ten men.Wales 2 England 3, 15 March 1880 (Match summary) He was the first full-back to score a goal for England from open play, which caused a small sensation at the time, as defenders rarely ventured into the opponents' half of the field. Doubt has been cast on the attribution of the goal to Brindle; a Welsh newspaper report of the time claims that this was an own goal by goalkeeper, Harry Hibbott."]}, {"page": "Claude Wilson", "response": ["In 1880, he was part of the Oxford University team that reached the FA Cup Final, where they met the previous year's losing finalists, Clapham Rovers. This was the university's fourth appearance in the Cup Final since the Cup was inaugurated in 1872, and, having \"conquered much-fancied Nottingham Forest in the semi-final\" were favourites to take the trophy.Report on 1880 FA Cup final  In the event, the Rovers defence were able to keep the university forwards at bay, and with Wilson and his fellow full-back Robert King tiring towards the end of the second half, and the prospect of extra time imminent, Francis Sparks \"made a clever run down the wing, crossed to the waiting Clopton Lloyd-Jones who had the simple task of slotting the ball between the Oxford goalposts to secure a one-goal lead.\" This was the last appearance in an FA Cup Final for both teams."]}, {"page": "Clopton Lloyd-Jones", "response": ["He returned to the Oval on 10 April, when as the inside-forward or winger he scored the only goal when Clapham Rovers won the Cup Final against Oxford University to deserve fully his description in the Football Annual for that year as 'A very neat dribbler and dangerous shot at goal; was invaluable in the Cup Ties.' In the first half, he attempted to score twice, with a shot from the left which glanced off a goalpost, and a centre kick downfield which was saved by the Oxford goalkeeper Percival Parr. In the second half, six minutes before the close of time, the deadlock was broken when his teammate Francis Sparks conducted the ball to within \"about six yards of the University goal\". Although Oxford's Charles King attempted to stop the ball with a weak mis-kick, Lloyd-Jones, \"who had followed well up shot it between the posts. This feat quite 'brought down the house.'\" According to The Field magazine's report, there was \"vociferous cheering, throwing up of hats, and other demonstrations of delight from their supporters.\"  At the game's end, Lloyd-Jones, and his team captain Robert Ogilvie, were specially cheered by the crowd. At 21 years and 150 days Lloyd-Jones was the 'baby' of his team and the youngest Cup Final scorer in the event's then history.He superseded Charles Clerke (Old Etonians), who was 21 years 173 days at the 1879 Cup Final, and then superseded in turn by Teddy Wynyard (Old Carthusians), who was aged 20 years 8 days at the 1881 Cup Final."]}, {"page": "Thomas Marshall (footballer, born 1858)", "response": ["Marshall was born in the village of Withnell, approximately midway between Chorley, Blackburn and Darwen. After playing junior football in Lancashire, he joined Darwen in 1878. Described as \"a speedy winger with an accurate passing ability\",  he was selected for the second international match against Wales, played at Wrexham's Racecourse Ground on 15 March 1880. The match ended in a 3–2 victory for the English, with two goals from Francis Sparks and the other from Marshall's Darwen teammate, Thomas Brindle (although some sources credit this as an own goal by the Welsh goalkeeper, Harry Hibbott)."]}, {"page": "List of footballers with more goals than caps", "response": ["|align=\"left\" | Francis Sparks ||1889–92"]}]}}