{"wiki_id": "http://www.wikidata.org/entity/Q3087098", "itemLabel": "Frederick Christian Lewis", "itemDescription": "English engraver and painter (1779-1856)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Christian_Lewis", "wikipedia_page": {"main": "Frederick Christian Lewis (1779–1856) was an English etcher, aquatint and stipple engraver, landscape and portrait painter and the brother of Charles Lewis (1786–1836).", "link_mentions": [{"page": "Holne", "response": ["Several paintings of the Wrey estate were made by Frederick Christian Lewis (1779–1856) published in London, 1821 as \"Scenery of the River Dart\", as follows:"]}, {"page": "John Frederick Lewis", "response": ["He was the son of Frederick Christian Lewis (1779–1856), an engraver and landscape painter, whose German father had moved to England and changed his name from Ludwig. The leading bookbinder Charles Lewis was John Frederick's uncle, and his younger brothers, another Frederick Christian and Charles George Lewis, were also artists, the latter mainly in reproductive engraving, especially after Edwin Landseer (1802-1873), a childhood neighbour and friend of John Frederick."]}, {"page": "Frederick Lewis", "response": ["*Frederick Christian Lewis (1779–1856), English etcher, engraver and painter"]}, {"page": "List of portraits in the Centre Block", "response": ["| Frederick Christian Lewis"]}, {"page": "Charles George Lewis", "response": ["The second son of Frederick Christian Lewis, and brother of John Frederick Lewis, he was born in Enfield, Middlesex. He was instructed in drawing and engraving by his father."]}, {"page": "John Hayes (painter)", "response": ["Hayes first exhibited in the Royal Academy in 1814. He continued to show there to 1851; his contributions were chiefly portraits, though he occasionally sent a subject picture. Hayes had a good practice as a portrait-painter. His portrait of Agnes Strickland was engraved by Frederick Christian Lewis, as frontispiece to her Lives of the Queens of England (1851)."]}, {"page": "George Robert Lewis", "response": ["The younger brother of Frederick Christian Lewis and of Charles Lewis the bookbinder, he was born in London on 27 March 1782. He studied under Henry Fuseli in the schools of the Royal Academy, and worked on both nature and antiquities."]}, {"page": "Charles Lewis (bookbinder)", "response": ["Born in London, Lewis was fourth son of Johann Ludwig, a political refugee from Hanover, and brother of Frederick Christian Lewis and of George Robert Lewis. In 1800, he was apprenticed to the leading bookbinder Henry Walther. After he had spent five years in the forwarding department, Walther refused his request to enter the finishing shop, and so Lewis practised fine work on his own account, into the small hours."]}, {"page": "Sir James Milles Riddell, 2nd Baronet", "response": ["His portrait by Joseph Slater, Jr. was later engraved by Frederick Christian Lewis.https://www.npg.org.uk/collections/search/person/mp72250/sir-james-milles-riddell-bt"]}]}}