{"wiki_id": "http://www.wikidata.org/entity/Q3089963", "itemLabel": "Ian McHarg", "itemDescription": "Scottish landscape architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_McHarg", "wikipedia_page": {"main": "Ian L. McHarg (20 November 1920 – 5 March 2001) was a Scottish landscape architect and writer on regional planning using natural systems. McHarg was one of the most influential persons in the environmental movement who brought environmental concerns into broad public awareness and ecological planning methods into the mainstream of landscape architecture, city planning and public policy. He was the founder of the department of landscape architecture at the University of Pennsylvania in the United States. His 1969 book Design with Nature pioneered the concept of ecological planning. It continues to be one of the most widely celebrated books on landscape architecture and land-use planning. In this book, he set forth the basic concepts that were to develop later in geographic information systems.\n\n", "link_mentions": [{"page": "Dayton, Ohio", "response": ["In the federal government's National Urban Policy and New Community Development Act of 1970, funding was provided for thirteen \"new towns\" or planned cities throughout the country. One location was set to become a suburb of Dayton and was known variously as Brookwood or Newfields. The goal was to have an entirely new suburb that would eventually house about 35,000 residents. The new town was to be located between Trotwood and Brookville, and modeled on the ideas of Ian McHarg. The project was abandoned in 1978 and most of the land became Sycamore State Park.Urban Ohio, \"Brookwood/Newfields New Town\", June 8, 2006"]}, {"page": "List of landscape architects", "response": ["* Ian McHarg"]}, {"page": "Landscape architecture", "response": ["Ian McHarg was known for introducing environmental concerns in landscape architecture. He popularized a system of analyzing the layers of a site in order to compile a complete understanding of the qualitative attributes of a place. This system became the foundation of today's Geographic Information Systems (GIS). McHarg would give every qualitative aspect of the site a layer, such as the history, hydrology, topography, vegetation, etc.  GIS software is ubiquitously used in the landscape architecture profession today to analyze materials in and on the Earth's surface and is similarly used by urban planners, geographers, forestry and natural resources professionals, etc."]}, {"page": "The Woodlands, Texas", "response": ["The land was previously occupied by the Grogan-Cochran Lumber Mill,With Grogan at Bivins and Magnolia (Gulf Coast Lumberman, 1939). Texas Transportation Archive. http://www.ttarchive.com/Library/Companies/GroganAtBivins-Magnolia.html  hence Grogan's Mill and Cochran's Crossing neighborhoods, called \"villages\". The original planning utilized many of the planning concepts and design consultants employed in other well-regarded new communities of that era such as Columbia, Maryland, Irvine Ranch, California and Reston, Virginia. The original development plan included environmental design principles espoused by Ian McHarg, a distinguished landscape architect, teacher and author of the seminal work Design With Nature."]}]}}