{"wiki_id": "http://www.wikidata.org/entity/Q309160", "itemLabel": "Alan Bates", "itemDescription": "English actor (1934-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Bates", "wikipedia_page": {"main": "Sir Alan Arthur Bates  (17 February 1934 – 27 December 2003) was an English actor who came to prominence in the 1960s, when he appeared in films ranging from the popular children's story Whistle Down the Wind to the \"kitchen sink\" drama A Kind of Loving.\nHe is also known for his performance with Anthony Quinn in Zorba the Greek, as well as his roles in King of Hearts, Georgy Girl, Far From the Madding Crowd and The Fixer, for which he received an Academy Award nomination for Best Actor. In 1969, he starred in the Ken Russell film Women in Love with Oliver Reed and Glenda Jackson.\nBates went on to star in The Go-Between, An Unmarried Woman, Nijinsky and in The Rose with Bette Midler, as well as many television dramas, including The Mayor of Casterbridge, Harold Pinter's The Collection, A Voyage Round My Father, An Englishman Abroad (as Guy Burgess) and Pack of Lies. He also appeared on the stage, notably in the plays of Simon Gray, such as Butley and Otherwise Engaged.", "link_mentions": [{"page": "December 27", "response": ["*2003 – Alan Bates, English actor (b. 1934)"]}, {"page": "February 17", "response": ["*1934 – Sir Alan Bates, English actor (d. 2003)"]}, {"page": "Gene Hackman", "response": ["* Poor Richard by Jean Kerr with Alan Bates and Shirley Knight at the Helen Hayes Theatre (1964–1965)"]}, {"page": "John Frankenheimer", "response": ["The Fixer was widely praised by movie critics for Frankenhiemer’s success in eliciting outstanding performances from Alan Bates as the brutalized Yakov Shepsovitch Bok, Dirk Bogarde as Boris Bibikov, his humane court appointed defense attorney, and  David Warner as Count Odoevsky. Minister of Justice.Ebert, 1968: “...played with great sensitivity by Alan Bates…”Adler, 1968 NYT: “The acting, from Alan Bates...through Dirk Bogarde as the cerebral, sympathetically homosexual prosecutor, and David Warner as an effete, pragmatic Count, is very fine.” Bates received his only Academy Award nomination for Best Actor in this role.Toole, 2003 TCM: Bates plays “a Russian Jew falsely accused of murder [and] remarkably, his only Oscar nomination.” Renata Adler of the New York Times observed “the direction, by John Frankenheimer, is powerful and discreet. It averts its eyes at the easy, ugly consummations of violence...and gives you credit for imagining the result.”Adler, 1968 NYT This, despite Frankenheimer's admission that “there is a very violent scene in The Fixer”: ", "*Adler, Renata. 1968. Screen: 'The Fixer' Put Through Hollywood Mill: Frankenheimer Directs From Malamud Novel, Alan Bates Plays Lead -- Bogarde in Cast. The New York Times. https://www.nytimes.com/1968/12/09/archives/screen-the-fixer-put-through-hollywood-millfrankenheimer-directs.html  Retrieved 15 August, 2021", "*Toole, Michael T. 2003. Sir Alan Bates (1934-2003). Turner Classic Movies.  https://www.tcm.com/tcmdb/title/1881/the-fixer/#articles-reviews?articleId=64876  Retrieved 15 August, 2021."]}, {"page": "1960s", "response": ["* Alan Bates"]}, {"page": "1934", "response": ["** Sir Alan Bates, British actor (d. 2003)"]}, {"page": "2003", "response": ["* December 27 – Alan Bates, English actor (b. 1934)"]}, {"page": "Six Degrees of Kevin Bacon", "response": ["Gotts wrote to 300 actors asking to take their pictures, and received permission only from Joss Ackland. Ackland then suggested that Gotts photograph Greta Scacchi, with whom he had appeared in the film White Mischief. Gotts proceeded from there, asking each actor to refer him to one or more friends or colleagues. Eventually, Christian Slater referred him to Bacon. Gotts' photograph of Bacon completed the project, eight years after it began. Gotts published the photos in a book, Degrees (), with text by Alan Bates, Pierce Brosnan, and Bacon."]}, {"page": "Laurence Olivier", "response": ["The opening production of the National Theatre was Hamlet in October 1963, starring Peter O'Toole and directed by Olivier. O'Toole was a guest star, one of occasional exceptions to Olivier's policy of casting productions from a regular company. Among those who made a mark during Olivier's directorship were Michael Gambon, Maggie Smith, Alan Bates, Derek Jacobi and Anthony Hopkins. It was widely remarked that Olivier seemed reluctant to recruit his peers to perform with his company. Evans, Gielgud and Paul Scofield guested only briefly, and Ashcroft and Richardson never appeared at the National during Olivier's time. Robert Stephens, a member of the company, observed, \"Olivier's one great fault was a paranoid jealousy of anyone who he thought was a rival\"."]}, {"page": "Albert Finney", "response": ["Finney's first film appearance was in Tony Richardson's The Entertainer (1960), with Laurence Olivier. Finney and Alan Bates played Olivier's sons. He made his film breakthrough in the same year with his portrayal of a disillusioned factory worker in Karel Reisz's film version of Alan Sillitoe's Saturday Night and Sunday Morning (1960), produced by Richardson. The film was a box-office success, being the third most popular film in Britain that year. It earned over half a million pounds in profit.Tino Balio, United Artists: The Company That Changed the Film Industry, University of Wisconsin Press, 1987 p. 239 Finney then did Billy Liar (1960) on stage and for British television.Finney: A Star Who Hides His Magnitude: Albert Finney, Marks, Sally K. Los Angeles Times 23 Apr 1967: c11."]}, {"page": "Mel Gibson", "response": ["Gibson made the unusual transition from action to classical drama, playing William Shakespeare's Danish prince in Franco Zeffirelli's Hamlet. Gibson was cast alongside experienced Shakespearean actors Ian Holm, Alan Bates, and Paul Scofield. He compared working with Scofield to being \"thrown into the ring with Mike Tyson\". Scofield said of Gibson \"Not the sort of actor you'd think would make an ideal Hamlet, but he had enormous integrity and intelligence.\""]}, {"page": "Zorba the Greek (film)", "response": ["Zorba the Greek (, Alexis Zorbas) is a 1964 Greek comedy-drama movie written, produced, edited, and directed by Greek Cypriot Michael Cacoyannis and featuring Anthony Quinn as the titular character. Based on the 1946 novel The Life And Times Of Alexis Zorba by Nikos Kazantzakis, the movie's cast includes Alan Bates, Lila Kedrova, Irene Papas, and Sotiris Moustakas.", "* Alan Bates as Basil"]}, {"page": "Vaslav Nijinsky", "response": ["* Nijinsky (1980), directed by Herbert Ross, starring professional dancers George de la Peña as Nijinsky and Leslie Browne as Romola, with actors Alan Bates as Diaghilev and Jeremy Irons as Fokine. Romola Nijinsky had a writing credit for the film."]}, {"page": "Peter O'Toole", "response": ["Upon leaving school, O'Toole obtained employment as a trainee journalist and photographer on the Yorkshire Evening Post, until he was called up for national service as a signaller in the Royal Navy. As reported in a radio interview in 2006 on NPR, he was asked by an officer whether he had something he had always wanted to do. His reply was that he had always wanted to try being either a poet or an actor. He attended the Royal Academy of Dramatic Art (RADA) from 1952 to 1954 on a scholarship. This came after being rejected by the Abbey Theatre's drama school in Dublin by the director Ernest Blythe, because he could not speak the Irish language.Is Ireland Dying?: Culture and the Church in Modern Ireland, Michael Sheehy, Taplinger Publishing Company, 1969, page 141 At RADA, he was in the same class as Albert Finney, Alan Bates and Brian Bedford. O'Toole described this as \"the most remarkable class the academy ever had, though we weren't reckoned for much at the time. We were all considered dotty.\"", "| Alan Arkin – The Heart Is a Lonely HunterAlan Bates – The FixerRon Moody – Oliver!"]}, {"page": "Antony and Cleopatra", "response": ["* 1999, Alan Bates and Frances de la Tour in title roles, Guy Henry as Octavius (also David Oyelowo and Owen Oakeshott) at the Royal Shakespeare Company."]}, {"page": "Maggie Smith", "response": ["In 1981, Smith starred in the Merchant Ivory film Quartet alongside Alan Bates and Isabelle Adjani. The film premiered at the 34th Cannes Film Festival where it received positive reviews. Smith received her sixth BAFTA Award nomination for Best Actress for her performance as Lois Heidler. Smith also played the goddess Thetis in Clash of the Titans (1981)."]}, {"page": "Separate Tables", "response": ["The 1958 film, with a few extra parts, was adapted for the screen by Rattigan. It starred Rita Hayworth, Deborah Kerr, David Niven, Burt Lancaster and Wendy Hiller.\"Separate Tables (1958)\", British Film Institute, retrieved 19 March 2014 John Schlesinger directed a television film version in 1983, with Julie Christie and Alan Bates as the two couples, with Claire Bloom as Miss Cooper and Irene Worth as Mrs Railton-Bell.\"Separate Tables (1983)\", British Film Institute, retrieved 19 March 2014"]}, {"page": "Harold Pinter", "response": ["Pinter began to direct more frequently during the 1970s, becoming an associate director of the National Theatre (NT) in 1973.  He directed almost 50 productions of his own and others' plays for stage, film, and television, including 10 productions of works by Simon Gray: the stage and/or film premières of Butley (stage, 1971; film, 1974), Otherwise Engaged (1975), The Rear Column (stage, 1978; TV, 1980), Close of Play (NT, 1979), Quartermaine's Terms (1981), Life Support (1997), The Late Middle Classes (1999), and The Old Masters (2004).  Several of those productions starred Alan Bates (1934–2003), who originated the stage and screen roles of not only Butley but also Mick in Pinter's first major commercial success, The Caretaker (stage, 1960; film, 1964); and in Pinter's double-bill produced at the Lyric Hammersmith in 1984, he played Nicolas in One for the Road and the cab driver in Victoria Station.  Among over 35 plays that Pinter directed were Next of Kin (1974), by John Hopkins; Blithe Spirit (1976),  by Noël Coward; The Innocents (1976), by William Archibald; Circe and Bravo (1986), by Donald Freed; Taking Sides (1995), by Ronald Harwood; and Twelve Angry Men (1996), by Reginald Rose."]}, {"page": "Thora Hird", "response": ["Initially, Hird made regular appearances in films, including the wartime propaganda film Went the Day Well? (1942, known as 48 Hours in the USA), in which she is shown wielding a rifle to defend a house from German paratroopers. She worked with the British film comedian Will Hay and featured in The Entertainer (1960), which starred Laurence Olivier, as well as A Kind of Loving (1962) with Alan Bates and June Ritchie."]}, {"page": "Hamlet (1990 film)", "response": ["Hamlet is a 1990 drama film based on the Shakespearean tragedy of the same name, directed by Franco Zeffirelli and starring Mel Gibson as the eponymous character. The film also features Glenn Close, Alan Bates, Paul Scofield, Ian Holm, Helena Bonham Carter, Stephen Dillane, and Nathaniel Parker. An international co-production between the United States, the United Kingdom, and Italy, the film was the first produced by Icon Productions, a company co-founded by Gibson.", "* Alan Bates as King Claudius", "The film was nominated for two Academy Awards, for Best Art Direction (Dante Ferretti, Francesca Lo Schiavo) and Best Costume Design (Maurizio Millenotti). Sir Alan Bates received a BAFTA nomination as Best Supporting Actor for playing Claudius."]}]}}