{"wiki_id": "http://www.wikidata.org/entity/Q309589", "itemLabel": "Peter Cushing", "itemDescription": "English actor (1913-1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Cushing", "wikipedia_page": {"main": "Peter Wilton Cushing  (26 May 1913 – 11 August 1994) was an English actor. His acting career spanned over six decades and included appearances in more than 100 films, as well as many television, stage, and radio roles. He achieved recognition in his home country for his leading performances in the Hammer Productions horror films from the 1950s to 1970s, while earning international prominence as Grand Moff Tarkin in the original 1977 Star Wars.\nBorn in Kenley, Surrey, Cushing made his stage debut in 1935 and spent three years at a repertory theatre before moving to Hollywood to pursue a film career. After making his motion picture debut in the film The Man in the Iron Mask (1939), Cushing began to find modest success in American films before returning to England at the outbreak of the Second World War. Despite performing in a string of roles, including one as Osric in Laurence Olivier's film adaptation of Hamlet (1948), Cushing struggled greatly to find work during this period. His career was revitalised once he started to work in live television plays, and he soon became one of the most recognisable faces in British television. He earned particular acclaim for his lead performance in a BBC Television adaptation of George Orwell's Nineteen Eighty-Four (1954).\nCushing gained worldwide fame for his appearances in 22 horror films from the Hammer studio, particularly for his role as Baron Frankenstein in six of their seven Frankenstein films, and Doctor Van Helsing in five Dracula films. Cushing often appeared alongside actor Christopher Lee, who became one of his closest friends, and occasionally with the American horror star Vincent Price. Cushing appeared in several other Hammer films, including The Abominable Snowman (1957), The Mummy and The Hound of the Baskervilles (both 1959), the last of which marked the first of the several occasions he portrayed the detective Sherlock Holmes. Cushing continued to perform in a variety of roles, although he was often typecast as a horror film actor. He played Dr. Who in Dr. Who and the Daleks (1965) and Daleks' Invasion Earth 2150 A.D. (1966) and gained the highest amount of visibility in his career with his part in the original Star Wars film. Cushing continued acting into the early 1990s and wrote two autobiographies.", "link_mentions": [{"page": "August 11", "response": ["*1994 – Peter Cushing, English actor (b. 1913)"]}, {"page": "Carmilla", "response": ["* The British Hammer Film Productions also produced a fairly faithful adaptation of Carmilla titled The Vampire Lovers (1970) with Ingrid Pitt in the lead role, Madeline Smith as her victim/lover, and Hammer's regular Peter Cushing. It is the first installment of the Karnstein Trilogy."]}, {"page": "Doctor Who", "response": ["Doctor Who first appeared on BBC TV at 17:16:20 GMT on Saturday, 23 November 1963; this was eighty seconds later than the scheduled programme time, because of the assassination of John F. Kennedy the previous day.Howe, Stammers, Walker (1994), p. 54 It was to be a regular weekly programme, each episode 25 minutes of transmission length. Discussions and plans for the programme had been in progress for a year. The head of drama Sydney Newman was mainly responsible for developing the programme, with the first format document for the series being written by Newman along with the head of the script department (later head of serials) Donald Wilson and staff writer C. E. Webber. Writer Anthony Coburn, story editor David Whitaker and initial producer Verity Lambert also heavily contributed to the development of the series.Howe, Stammers, Walker (1994), pp. 157–230 (\"Production Diary\")Newman is often given sole creator credit for the series. Some reference works such as The Complete Encyclopedia of Television Programs 1947–1979 by Vincent Terrace erroneously credit Terry Nation with creating Doctor Who, because of the way his name is credited in the two Peter Cushing films.Newman and Lambert's role in originating the series was recognised in the 2007 episode \"Human Nature\", in which the Doctor, in disguise as a human named John Smith, gives his parents' names as Sydney and Verity.", "On rare occasions, other actors have stood in for the lead. In The Five Doctors, Richard Hurndall played the First Doctor due to William Hartnell's death in 1975; 34 years later David Bradley similarly replaced Hartnell in Twice Upon a Time. In Time and the Rani, Sylvester McCoy briefly played the Sixth Doctor during the regeneration sequence, carrying on as the Seventh. For more information, see the list of actors who have played the Doctor. In other media, the Doctor has been played by various other actors, including Peter Cushing in two films.", "In these films, Peter Cushing plays a human scientist named \"Dr. Who\", who travels with his granddaughter, niece and other companions in a time machine he has invented. The Cushing version of the character reappears in both comic strips and a short story, the latter attempting to reconcile the film continuity with that of the series."]}, {"page": "Doctor Syn", "response": ["Captain Clegg (1962), known as Night Creatures in the U. S., was produced by Hammer Film Productions with actor Peter Cushing in the lead role, directed by Peter Graham Scott. In the screenplay by Anthony Hinds, the main character's name was changed from Doctor Syn to Parson Blyss to avoid rights problems with Disney's forthcoming version, and Captain Clegg's screenplay follows the novel Doctor Syn and the screenplay of the 1937 film closely with the exception of a tightening of the plot. In the Arliss movie Doctor Syn, Syn escapes to sea with Mipps and the rest of the Dymchurch smugglers, whereas Captain Clegg ends more faithfully to the novel, with Parson Blyss being killed by the mulatto (who is then killed by Mipps) and then being carried to and buried in Captain Clegg's empty grave by Mipps. Captain Clegg was released in the UK on DVD and Blu-ray in 2014; Night Creatures was never released on videotape in the United States, but is included in the 2014 two-disc DVD collection The Hammer Horror Series."]}, {"page": "Dubbing (filmmaking)", "response": ["|David NivenPeter CushingRex HarrisonMichael CaineGeorge C. ScottFranco NeroHenry Fonda"]}, {"page": "Dalek", "response": ["Two Doctor Who movies starring Peter Cushing featured the Daleks as the main villains: Dr. Who and the Daleks, and Daleks - Invasion Earth 2150 AD, based on the television serials The Daleks and The Dalek Invasion of Earth, respectively. The movies were not direct remakes; for example, the Doctor in the Cushing films was a human inventor called \"Dr. Who\" who built a time-travelling device named Tardis, instead of a mysterious alien who stole a device called \"the TARDIS\".Peel (1988), p. 96; Howe (1992), p. 129"]}, {"page": "Cinema of the United Kingdom", "response": ["Less restrictive censorship towards the end of the 1950s encouraged film producer Hammer Films to embark on their series of commercially successful horror films. Beginning with adaptations of Nigel Kneale's BBC science fiction serials The Quatermass Experiment (1955) and Quatermass II (1957), Hammer quickly graduated to The Curse of Frankenstein (1957) and  Dracula (1958), both deceptively lavish and the first gothic horror films in colour. The studio turned out numerous sequels and variants, with English actors Peter Cushing and Christopher Lee being the most regular leads. Peeping Tom (1960), a now highly regarded thriller, with horror elements, set in the contemporary period, was badly received by the critics at the time, and effectively finished the career of Michael Powell, its director."]}, {"page": "May 26", "response": ["*1913 – Peter Cushing, English actor (d. 1994)"]}, {"page": "Pellucidar", "response": ["Pellucidar has appeared in one movie adaptation. The first novel was filmed as At the Earth's Core (1976), directed by Kevin Connor with Doug McClure as David Innes and Peter Cushing as Abner Perry."]}, {"page": "Robert Bloch", "response": ["| rowspan=\"2\" | 1971 || The House That Dripped Blood || Director: Peter Duffell. 5th of Bloch's Amicus films. Screenplay by Bloch based on four of his stories (except that Russ Jones adapted Waxworks, uncredited). Starring Christopher Lee and Peter Cushing.", "| 1972 || Asylum || Director: Roy Ward Baker. 6th and final of Bloch's Amicus films. Screenplay by Bloch based on four of his stories. The screenplay was novelized by William Johnston (Asylum, Bantam Books, Dec 1972. ; Bantam 9195). Note: Bloch's story \"Lucy Comes to Stay\", one of the four stories incorporated in the film can be found reprinted in Peter Haining (ed) Ghost Movies: Classics of the Supernatural, Severn House, 1995 as \"Asylum\". Starring Peter Cushing and Britt Ekland."]}, {"page": "The Hound of the Baskervilles", "response": ["| 1959 || The Hound of the Baskervilles ||  ||Terence Fisher || Peter Cushing || André Morell", "| 1968 ||Sherlock Holmes - \"The Hound of the Baskervilles\"|| |  || Graham Evans || Peter Cushing || Nigel Stock"]}, {"page": "Hellfire Club", "response": ["* The 1960 film The Hellfire Club starring Keith Michell and Peter Cushing depicts Dashwood's organisation."]}, {"page": "Wargame", "response": ["* Peter Cushing – Actorhttps://www.youtube.com/watch?v=BGag8Qllgnw"]}, {"page": "1960s", "response": ["* Peter Cushing"]}, {"page": "1970s", "response": ["* Peter Cushing"]}, {"page": "1950s", "response": ["* Peter Cushing"]}, {"page": "1913", "response": ["** Peter Cushing, English actor (d. 1994)"]}, {"page": "M. R. James", "response": ["In the UK, the Hallowe'en edition of Radio 4's Forget Tomorrow's Monday (\"a Sunday morning miscellany\") featured Peter Underwood (president of the Ghost Club) talking \"about all things strange, from Alchemy to Zombies\", and Peter Cushing, who gave a reading of \"Lost Hearts\"."]}, {"page": "Princess Leia", "response": ["Introduced in the original 1977 film Star Wars, Princess Leia Organa of Alderaan is a member of the Imperial Senate. She is captured by Darth Vader (portrayed by David Prowse, voiced by James Earl Jones) on board the ship Tantive IV, where she is acting as a spy for the Rebel Alliance. Leia has secretly hidden the blueprints for the Death Star, the Empire's moon-sized battle station, inside the astromech droid R2-D2 (Kenny Baker) and has sent it to find one of the last remaining Jedi, Obi-Wan Kenobi (Alec Guinness), on the nearby planet of Tatooine. Vader arrests Leia and has her tortured, but she resists revealing anything. Death Star commander Grand Moff Tarkin (Peter Cushing) threatens to destroy her home planet Alderaan with the Death Star unless she reveals the location of the hidden Rebel base. She provides the location of an old, abandoned base on the planet Dantooine, but Tarkin orders Alderaan to be destroyed anyway. Leia is rescued by Luke Skywalker (Mark Hamill) and Han Solo (Harrison Ford), and they escape aboard Han's ship, the Millennium Falcon. After analyzing the Death Star's schematics, the Rebels find a tiny weakness in the battle station, which Luke uses to destroy it in his X-wing. In the aftermath of the victory, Leia bestows medals on the heroes at the hidden Rebel base on Yavin 4."]}, {"page": "Star Wars (film)", "response": ["Star Wars (retroactively titled Star Wars: Episode IV – A New Hope) is a 1977 American epic space-opera film written and directed by George Lucas, produced by Lucasfilm and distributed by 20th Century Fox. It stars Mark Hamill, Harrison Ford, Carrie Fisher, Peter Cushing, Alec Guinness, David Prowse, James Earl Jones, Anthony Daniels, Kenny Baker and Peter Mayhew. It is the first installment of the original Star Wars trilogy, the first of the franchise to be produced, and the fourth episode of the \"Skywalker saga\".", "* Peter Cushing as Grand Moff Tarkin: The commander of the Death Star. Lucas originally offered the role to Christopher Lee but he declined.http://www.theforce.net/jedicouncil/interview/lee2003.asp Lucas originally had Cushing in mind for the role of Obi-Wan Kenobi, but Lucas believed that \"his lean features\" would be better employed in the role of Tarkin instead. Lucas commended Cushing's performance, saying \"[He] is a very good actor. Adored and idolized by young people and by people who go to see a certain kind of movie. I feel he will be fondly remembered for the next 350 years at least.\" Cushing, commenting on his role, joked: \"I've often wondered what a 'Grand Moff' was. It sounds like something that flew out of a cupboard.\"", "| Peter Cushing"]}, {"page": "Christopher Lee", "response": ["* \"Depp surprises Sir Christopher Lee with film award\". BBC. Retrieved 14 December 2013 Lee credited three films \"for bringing me to the fore\" as an actor, A Tale of Two Cities (1958), in which he played the villainous marquis, and two horror films, The Curse of Frankenstein (1957), and Dracula (1958). He considered his best performance to be that of Pakistan's founder Muhammad Ali Jinnah in the biopic Jinnah (1998), and his best film to be the British cult film The Wicker Man (1973). He frequently appeared opposite his friend Peter Cushing in many horror films, and late in his career had roles in five Tim Burton films.", "In this early period, he made an uncredited appearance in Laurence Olivier's film version of Hamlet (1948), as a spear carrier (his later co-star and close friend Peter Cushing played Osric). A few years later, he appeared in Captain Horatio Hornblower R.N. (1951) as a Spanish captain. He was cast when the director asked him if he could speak Spanish and fence, which he was able to do. Lee appeared uncredited in the American epic Quo Vadis (1951), which was shot in Rome, playing a chariot driver and was injured when he was thrown from it at one point during the shoot.", "Lee's first film for Hammer was The Curse of Frankenstein (1957), in which he played Frankenstein's monster, with Peter Cushing as Baron Victor Frankenstein. It was the first film to co-star Lee and Cushing, who ultimately appeared together in over twenty films and became close friends. When he arrived at a casting session for the film, \"they asked me if I wanted the part, I said yes and that was that.\" A little later, Lee co-starred with Boris Karloff in the film Corridors of Blood (1958). Lee had previously appeared with Karloff in 1955 in the \"At Night, All Cats are Grey\" episode of the British television series Colonel March of Scotland Yard.Johnson, Tom (2009). \"The Christopher Lee Filmography: All Theatrical Releases, 1948–2003\". p. 79. McFarland.", "Because of his filming schedule in Bangkok, film director Ken Russell was unable to sign Lee to play the Specialist in Tommy (1975). That role was eventually given to Jack Nicholson. In an AMC documentary on Halloween (1978), John Carpenter states that he offered the role of Samuel Loomis to Peter Cushing and Christopher Lee, before Donald Pleasence took the role. Years later, Lee told Carpenter that the biggest regret of his career was not taking the role of Dr. Loomis.", "In 1977, Lee left the UK for the US, concerned at being typecast in horror films, as had happened to his close friends Peter Cushing and Vincent Price. He said in an interview in 2011:", "In addition to more than a dozen feature films together for Hammer Films, Amicus Productions, and other companies, Lee and Peter Cushing both appeared in Hamlet (1948) and Moulin Rouge (1952), albeit in separate scenes; and in separate instalments of the Star Wars films: Cushing as Grand Moff Tarkin in the original film and Lee decades later as Count Dooku. The last project which united them in person was a documentary, Flesh and Blood: The Hammer Heritage of Horror (1994), which they jointly narrated. It was the last time they saw each other, as Cushing died two months later."]}, {"page": "Ray Milland", "response": ["He was top billed in The Attic (1980), but more commonly had support roles in TV films like The Dream Merchants (1980), Our Family Business (1981), The Royal Romance of Charles and Diana (1982), Starflight: The Plane That Couldn't Land (1983), Cave In! (1983), and The Masks of Death (1984), a Sherlock Holmes adventure starring Peter Cushing and John Mills."]}, {"page": "Darth Vader", "response": ["Darth Vader first appears in Star Wars as a ruthless cyborg Sith Lord serving the Galactic Empire. He is tasked, along with Grand Moff Tarkin (Peter Cushing), with recovering the secret plans for the Death Star superweapon, which were stolen by the Rebel Alliance. Vader captures and tortures Princess Leia (Carrie Fisher), who has hidden the plans inside the droid R2-D2 (Kenny Baker) and sent it to find Vader's former Jedi Master Obi-Wan Kenobi (Alec Guinness) on the planet Tatooine. During Leia's rescue by Obi-Wan's allies Luke Skywalker (Mark Hamill) and Han Solo (Harrison Ford), Vader strikes down Obi-Wan in a lightsaber duel. Having placed a tracking device aboard their ship, the Millennium Falcon, Vader is able to track down the Rebel base on the planet Yavin 4. During the Rebel attack on the Death Star, Vader boards his TIE fighter and shoots down Rebel X-wing fighters, but Solo intervenes and sends Vader's ship spiraling off course, allowing Luke to destroy the Death Star."]}, {"page": "Sleepy Hollow (film)", "response": ["While Johnny Depp was Burton's first choice for the role of Ichabod Crane, Paramount required him to consider Brad Pitt, Liam Neeson and Daniel Day-Lewis. Depp was cast in July 1998 for his third collaboration with Burton. The actor wanted Ichabod to parallel Irving's description of the character in the short story. This included a long prosthetic snipe nose, huge ears, and elongated fingers. Paramount turned down his suggestions, and after Depp read Tom Stoppard's rewrite of the script, he was inspired to take the character even further. \"I always thought of Ichabod as a very delicate, fragile person who was maybe a little too in touch with his feminine side, like a frightened little girl,\" Depp explained. He did not wish to portray the character as a typical action star would have, and instead took inspiration by Angela Lansbury's performance in Death on the Nile. \"It's good,\" Burton reasoned, \"because I'm not the greatest action director, or the greatest director in any genre, and he's not the greatest action star, or the greatest star in any genre.\" Depp modeled Ichabod's detective personality from Basil Rathbone in the 1939 Sherlock Holmes film series. He also studied Roddy McDowall's acting for additional influence. Burton added that \"the idea was to try to find an elegance in action of the kind that Christopher Lee or Peter Cushing or Vincent Price had.\" Sleepy Hollow also reunited Burton with Jeffrey Jones (from Beetlejuice and Ed Wood) as Reverend Steenwyck, Christopher Walken (Max Shreck in Batman Returns) as the Hessian Horseman, Martin Landau (Ed Wood) in a cameo role, and Hammer veteran Michael Gough (Alfred in Burton's Batman films), whom Burton tempted out of retirement. The Hammer influence was further confirmed by the casting of Christopher Lee in a small role as the Burgomaster who sends Crane to Sleepy Hollow."]}, {"page": "Laurel and Hardy", "response": ["*Peter Cushing, well before becoming a star in Hammer Horror films, made an appearance in A Chump at Oxford."]}, {"page": "Languages in Star Wars", "response": ["Lucas intended to balance American accents and British accents between the heroes and villains of the original film. He also strove to keep accents \"very neutral\", noting Alec Guinness's and Peter Cushing's mid-Atlantic accents. In critical commentary on Episode I – The Phantom Menace, Patricia Williams of The Nation felt there was a correlation between accent and social class, noting that Jedi speak with \"crisp British accents\" while the \"graceful conquered women of the Naboo\" and \"white slaves\" such as Anakin and Shmi Skywalker \"speak with the brusque, determined innocence of middle-class Americans\"."]}, {"page": "The Caves of Steel", "response": ["An adaptation of The Caves of Steel was made by the BBC and broadcast on BBC2 on 5 June 1964 as part of an anthology strand called Story Parade, which specialized in adaptations of modern novels. It starred Peter Cushing as Elijah Baley and John Carson as R. Daneel Olivaw. The adaptation was the brainchild of Story Parade story editor Irene Shubik, who was an enthusiast of science fiction, once describing him as \"one of the most interesting and amusing men I have ever met\". Shubik had previously devised and story edited the science fiction anthology series Out of This World, which had adapted Asimov's short story \"Little Lost Robot\" in 1962. The adaptation of the novel was handled by Terry Nation, who by now had created the Daleks for Doctor Who.", "* Peter Cushing as Elijah Baley"]}, {"page": "Robot series", "response": ["This was followed by a 1964 dramatision of The Caves of Steel for the BBC series Story Parade and then four episodes of the BBC television series Out of the Unknown, based on \"Satisfaction Guaranteed\" (1966), \"Reason (in an episode titled \"The Prophet\", 1967), \"Liar!\" (1969), and The Naked Sun (1969). In these adaptations, Elijah Baley was portrayed by Peter Cushing (The Caves of Steel) and Paul Maxwell (The Naked Sun), R. Daneel Olivaw by John Carson (The Caves of Steel) and David Collings (The Naked Sun), and Susan Calvin by Beatrix Lehmann (\"The Prophet\") and Wendy Gifford (\"Liar!\"). In \"Satisfaction Guaranteed\", the character of Susan Calvin was renamed Dr Inge Jensen and portrayed by Ann Firbank."]}, {"page": "H. Rider Haggard", "response": [":The 1965 film She was produced by Hammer Film Productions; it starred Ursula Andress as Ayesha and John Richardson as her reincarnated love, with Peter Cushing and Bernard Cribbins as other members of the expedition."]}, {"page": "Grand Moff Tarkin", "response": ["Wilhuff Tarkin is a fictional character in the Star Wars franchise, introduced in the original 1977 Star Wars film (played by Peter Cushing) as one of its two central antagonists, alongside Darth Vader. In the film, Tarkin is depicted as a high-ranking officer of the Galactic Empire, placed in charge of the operations on the Death Star, the Empire's dwarf planet-sized battle station. He orders the destruction of the planet Alderaan by the station's superlaser, and is killed at the end of the film, when Luke Skywalker destroys the Death Star.", "During the production of Star Wars, Peter Cushing found Tarkin's boots, furnished by the wardrobe department, to be very uncomfortable. Director George Lucas agreed to limit shots where Cushing's feet would be visible, allowing him to wear slippers. Cushing admitted many years later to not knowing what a \"Grand Moff\" actually was, joking that it sounded like \"something which infests a clothes closet\" and decided to play him as a \"deeply cross and unpleasant gentleman\".", "In the 2016 anthology film Rogue One, archive footage and a digital scan of Peter Cushing's life mask made for the 1984 film Top Secret! were used to create a 3D CGI mask which was augmented and mapped to actor Guy Henry's face. Henry had studied Cushing's mannerisms many years previously for the lead role in British TV show Young Sherlock, but insisted on a screen test as he was not comfortable that his vocal imitation was accurate, stating he sounded more \"Peter O'Toole than Peter Cushing\". The ILM team searched through hours of footage to find suitable material of Cushing to build from. The footage from A New Hope was lit very differently to the lighting used in Rogue One and had to be digitally changed. The more they manipulated the lighting to match the other actors in the scenes the less like Cushing the character model looked, which meant creating a balancing act between \"a digital figure\" and \"one who looked precisely like Cushing\". The owners of Cushing's estate were heavily involved with the creation and had input right down to \"small, subtle adjustments\". The result, which has been called \"one of the most complex and costly CGI re-creations ever\", received a mixed response, with questions being raised about the morality of using a dead actor's likeness."]}, {"page": "Hamlet (1948 film)", "response": ["* Peter Cushing as Osric. Osric is a foppish courtier who referees the duel between Hamlet and Laertes. (In later film versions of the play, such as the 1969 one with Nicol Williamson, Osric would be made more openly 'swishy'.) An English actor, Cushing joined the Old Vic company in 1948, and he later became famous as a star of Hammer horror films."]}, {"page": "Guildhall School of Music and Drama", "response": ["*Peter Cushing – (Star Wars, Dracula)"]}, {"page": "Purley, London", "response": ["*Peter Cushing OBE, actor, grew up and went to school in Purley."]}, {"page": "Donald Pleasence", "response": ["Pleasence made his television debut in I Want to Be a Doctor (1946). He received positive critical attention for his role as Syme in the BBC version of Nineteen Eighty-Four (1954) from the novel by George Orwell. The adaptation was by Nigel Kneale and featured Peter Cushing in the lead role of Winston Smith.", "Pleasence made his big-screen debut with The Beachcomber (1954). Some notable early roles include Parsons in 1984 (1956), and minor roles opposite Alec Guinness in Barnacle Bill (1957) and Dirk Bogarde in The Wind Cannot Read (1958). In Tony Richardson's film of Look Back in Anger (1959), he plays a vindictive market inspector opposite Richard Burton. In the same year, Pleasence starred in the horror films Circus of Horrors directed by Sidney Hayers, playing the role of Vanet, the owner of a circus, and The Flesh and the Fiends as the real-life murderer William Hare, alongside Peter Cushing, George Rose and Billie Whitelaw."]}, {"page": "Vincent Price", "response": ["In 1982, Price provided the narrator's voice in Vincent, Tim Burton's six-minute film about a young boy who flashes from reality into a fantasy where he is Vincent Price. He appeared as Sir Despard Murgatroyd in a 1982 television production of Gilbert and Sullivan's Ruddigore (with Keith Michell as Robin Oakapple). In 1982, Price provided the spoken-word sequence to the end of the Michael Jackson song \"Thriller\". In 1983, he played the Sinister Man in the British spoof horror film Bloodbath at the House of Death. He appeared in House of the Long Shadows with Christopher Lee, Peter Cushing, and John Carradine. He had worked with each of those actors at least once in previous decades, but this was the first time that all had teamed up. One of his last major roles, and one of his favorites, was as the voice of Professor Ratigan in Walt Disney Pictures' The Great Mouse Detective in 1986."]}, {"page": "Slasher film", "response": ["Psycho was nominated for four Academy Awards, including Best Supporting Actress for Janet Leigh and Anthony Perkins garnering universal acclaim for his role as Norman Bates. This notice drew bankable movie stars to horror films. Joan Crawford starred in William Castle's Strait-Jacket (1964) and in Jim O'Connolly's Berserk! (1967), while Albert Finney starred in MGM's Night Must Fall (1964) (a remake of the 1937 British film) and Peter Cushing starred in Corruption (1968)."]}]}}