{"wiki_id": "http://www.wikidata.org/entity/Q309759", "itemLabel": "Edward Lear", "itemDescription": "British artist, illustrator, author and poet (1812-1888)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Lear", "wikipedia_page": {"main": "Edward Lear (12 May 1812 – 29 January 1888) was an English artist, illustrator, musician, author and poet, now known mostly for his literary nonsense in poetry and prose and especially his limericks, a form he popularised. His principal areas of work as an artist were threefold: as a draughtsman employed to make illustrations of birds and animals; making coloured drawings during his journeys, which he reworked later, sometimes as plates for his travel books; and as a (minor) illustrator of Alfred, Lord Tennyson's poems. As an author, he is known principally for his popular nonsense collections of poems, songs, short stories, botanical drawings, recipes and alphabets. He also composed and published twelve musical settings of Tennyson's poetry.\n\n", "link_mentions": [{"page": "Agatha Christie", "response": ["Christie was a voracious reader from an early age. Among her earliest memories were reading children's books by Mrs Molesworth and Edith Nesbit. When a little older, she moved on to the surreal verse of Edward Lear and Lewis Carroll. As an adolescent, she enjoyed works by Anthony Hope, Walter Scott, Charles Dickens, and Alexandre Dumas. In April 1901, aged 10, she wrote her first poem, \"The Cow Slip\"."]}, {"page": "Beatrix Potter", "response": ["Potter's artistic and literary interests were deeply influenced by fairy tales and fantasy. She was a student of the classic fairy tales of Western Europe. As well as stories from the Old Testament, John Bunyan's The Pilgrim's Progress and Harriet Beecher Stowe's Uncle Tom's Cabin, she grew up with Aesop's Fables, the fairy tales of the Brothers Grimm and Hans Christian Andersen, Charles Kingsley's The Water Babies,Lear 2007, pp. 30–1 the folk tales and mythology of Scotland, the German Romantics, Shakespeare,Lear 2007, p. 95. She liked to memorise his plays by heart. and the romances of Sir Walter Scott.Lear 2007, p. 35. Beatrix said she learnt to read \"on\" Scott As a young child, before the age of eight, Edward Lear's A Book of Nonsense, including the much loved The Owl and the Pussycat, and Lewis Carroll's Alice in Wonderland had made their impression, although she later said of Alice that she was more interested in Tenniel's illustrations than what they were about.Lear 2007, p. 34 The Brer Rabbit stories of Joel Chandler Harris had been family favourites, and she later studied his Uncle Remus stories and illustrated them.Lear 2007, p.131. She began eight Uncle Remus drawings in the same year 1893 she began writing the Peter Rabbit picture letters to Noel Moore, completing the last in 1896. She studied book illustration from a young age and developed her own tastes, but the work of the picture book triumvirate Walter Crane, Kate Greenaway and Randolph Caldecott, the last an illustrator whose work was later collected by her father, was a great influence.Lear 2007, p. 33 When she started to illustrate, she chose first the traditional rhymes and stories, \"Cinderella\", \"Sleeping Beauty\", \"Ali Baba and the Forty Thieves\", \"Puss-in-boots\", and \"Red Riding Hood\".Lear 2007, pp. 127–8 However, most often her illustrations were fantasies featuring her own pets: mice, rabbits, kittens, and guinea pigs.Taylor, et al., The Artist and her World, pp. 49–70;  Potter, Journal, 1884–1897; Humphrey Carpenter (1985), Secret Gardens: The Golden Age of Children's Literature."]}, {"page": "List of English-language poets", "response": ["*Edward Lear (1812–1888, E)"]}, {"page": "January 29", "response": ["*1888 – Edward Lear, English poet and illustrator (b. 1812)"]}, {"page": "Jabberwocky", "response": ["Carroll wrote many poem parodies such as \"Twinkle, twinkle little bat\", \"You Are Old, Father William\" and \"How Doth the Little Crocodile?\" Some have become generally better known than the originals on which they are based, and this is certainly the case with \"Jabberwocky\". The poems' successes do not rely on any recognition or association of the poems that they parody. Lucas suggests that the original poems provide a strong container but Carroll's works are famous precisely because of their random, surreal quality. Carroll's grave playfulness has been compared with that of the poet Edward Lear; there are also parallels with the work of Gerard Manley Hopkins in the frequent use of soundplay, alliteration, created-language and portmanteau. Both writers were Carroll's contemporaries.Parsons, Marnie (1994)  Touch monkeys: nonsense strategies for reading twentieth-century poetry, pp. 67–73. University of Toronto Press. "]}, {"page": "May 12", "response": ["*1812 – Edward Lear, English poet and illustrator (d. 1888)"]}, {"page": "Poetry", "response": ["A limerick is a poem that consists of five lines and is often humorous. Rhythm is very important in limericks for the first, second and fifth lines must have seven to ten syllables. However, the third and fourth lines only need five to seven. All of the lines must rhyme and have the same rhythm.  Practitioners of the limerick included Edward Lear, Lord Alfred Tennyson, Rudyard Kipling, Robert Louis Stevenson. "]}, {"page": "Prague", "response": ["The English spelling of the city's name is borrowed from French. In the 19th and early 20th centuries it was pronounced in English to rhyme with \"vague\": it was so pronounced by Lady Diana Cooper (born 1892) on Desert Island Discs in 1969, and it is written to rhyme with \"vague\" in a verse of The Beleaguered City by Longfellow (1839) and also in the limerick There was an Old Lady of Prague by Edward Lear (1846). "]}, {"page": "Spike Milligan", "response": ["Milligan also wrote verse, considered to be within the genre of literary nonsense. His poetry has been described by comedian Stephen Fry as \"absolutely immortal—greatly in the tradition of Lear.\" One of his poems, \"On the Ning Nang Nong\", was voted the UK's favourite comic poem in 1998 in a nationwide poll, ahead of other nonsense poets including Lewis Carroll and Edward Lear. This nonsense verse, set to music, became a favourite Australia-wide, performed week after week by the ABC children's programme Playschool. Milligan included it on his album No One's Gonna Change Our World in 1969, to aid the World Wildlife Fund. In December 2007 it was reported that, according to OFSTED, it is among the ten most commonly taught poems in primary schools in the UK."]}, {"page": "1888", "response": ["* January 29 – Edward Lear, British artist, writer (b. 1812)"]}, {"page": "1812", "response": ["* May 12 – Edward Lear, English artist, poet (d. 1888)"]}, {"page": "Orientalism", "response": ["Other artists concentrated on landscape painting, often of desert scenes, including Richard Dadd and Edward Lear. David Roberts (1796–1864) produced architectural and landscape views, many of antiquities, and published very successful books of lithographs from them.Tromans, 102–125, covers landscape"]}, {"page": "Reggio Calabria", "response": ["During the course of the 19th century new public gardens were laid out, the piazzas (or squares) were embellished and cafés and a theatre were opened. On the newly opened sea promenade a Civic Museum was inaugurated. In fact, some 60 years after the devastation caused by the 1783 earthquake, the English traveller and painter Edward Lear remarked \"Reggio is indeed one vast garden, and doubtless one of the loveliest spots to be seen on earth. A half-ruined castle, beautiful in colour and picturesque in form, overlooks all the long city, the wide straits, and snow-topped Mongibello beyond.\"Edward Lear, Journals of a landscape painter in Southern Calabria, R. Bentley, London, 1852", "Although Reggio and Calabria in general were less popular destinations than Sicily or Naples for the first Northern European travellers, several famous names such as the Flemish Pieter Bruegel (in c. 1550), the German Johann Hermann von Riedesel (in 1767), the Frenchmen Jean Claude Richard de Saint-Non (in 1778) and Stendhal (in 1817), the British travellers Henry Swinburne (in c. 1775), Richard Keppel Craven (in c. 1820), Craufurd Tait Ramage (in 1828), the Strutt family and Elizabeth Byron (in 1840), Edward Lear (in 1847), Norman Douglas (in 1911), D. H. Lawrence (in c. 1920) and Eric Whelpton (in 1950s) and the Belgian Jules Destrée (in 1915 and in 1930) visited Reggio.AA VV (attualmente a cura di: Carmelina Sicari, Gaetanina Sicari Ruffo, Luciana Polimeni, Sara Polimeni, Cettina Nostro, Antonio Maria Leone; fondata da Giuseppe Polimeni) Calabria Sconosciuta · case editrici varie, redazione in Reggio di Calabria, 1978~2013"]}, {"page": "Slough", "response": ["* 1872: Edward Lear made reference to Slough in More Nonsense Pictures, Rhymes, Botany, etc:"]}, {"page": "Limerick (poetry)", "response": ["From Six North Country Diaries, Publications of the Surtees Society, Vol. CXVIII for the year MCMX, p. 78. Andrews & Co., Durham, etc. 1910. It was popularized by Edward Lear in the 19th century,Brandreth, page 108 although he did not use the term. Gershon Legman, who compiled the largest and most scholarly anthology, held that the true limerick as a folk form is always obscene, and cites similar opinions by Arnold Bennett and George Bernard Shaw,Legman 1988, pp. x-xi. describing the clean limerick as a \"periodic fad and object of magazine contests, rarely rising above mediocrity\". From a folkloric point of view, the form is essentially transgressive; violation of taboo is part of its function.", "==Edward Lear==", "The limerick form was popularized by Edward Lear in his first A Book of Nonsense (1846) and a later work, More Nonsense Pictures, Rhymes, Botany, etc.. (1872). Lear wrote 212 limericks, mostly considered nonsense literature. It was customary at the time for limericks to accompany an absurd illustration of the same subject, and for the final line of the limerick to be a variant of the first line ending in the same word, but with slight differences that create a nonsensical, circular effect. The humour is not in the \"punch line\" ending but rather in the tension between meaning and its lack.Tigges, Wim. \"The Limerick: The Sonnet of Nonsense?\". Explorations in the Field of Nonsense. ed. Wim Tigges. 1987. page 117", "The following is an example of one of Edward Lear's limericks.", "* Edward Lear's A Book of Nonsense from Project Gutenberg", "* \"Aesthetic Realism and Expression\", a lecture by Eli Siegel using Edward Lear's iconic limericks from A Book of Nonsense ."]}, {"page": "The Tomfoolery Show", "response": ["The Tomfoolery Show is a 1970-1971 American animated comedy television series, based on the works of Edward Lear. The animation was done at the Halas and Batchelor Studios in London and Stroud. Though the works of other writers were also used, notably Lewis Carroll and Ogden Nash, Lear's works were the main source, and characters like the Yongy-Bonghy-Bo and the Umbrageous Umbrella Maker were all Lear creations. Other characters included the Enthusiastic Elephant, the Fastidious Fish,  and the Scroobious Snake. Some original material was also written based on characters created by Lear, although much of the material was a straight recital of poems and limericks or songs using Lear's poems set to music. A recurring joke had a delivery boy running around trying to deliver a large plant and shouting, \"Plant for Mrs Discobolus!\""]}, {"page": "List of poets", "response": ["*Edward Lear (1812–1888), English poet, artist and illustrator"]}, {"page": "List of children's literature writers", "response": ["*Edward Lear (1812–1888) – \"The Owl and the Pussycat\", A Book of Nonsense"]}, {"page": "Ronnie Barker", "response": ["In private, he annotated a copy of A Book of Nonsense by Edward Lear, penning punch lines of his own for each limerick. On the title page he wrote, \"There was an old fossil named Lear, Whose verses were boring and drear. His last lines were worst – just the same as the first! So I've tried to improve on them here.\" The annotated copy of Lear's book, signed and dated November 2001, was auctioned in 2012."]}, {"page": "Dream of the Rarebit Fiend", "response": ["Scholars such as Claude Moliterni, Ulrich Merkl, Alfredo Castelli, and others have located possible influences. These include Edward Lear's popular The Book of Nonsense (1870), Gelett Burgess' The Burgess Nonsense Book (1901), Lewis Carroll's Alice's Adventures in Wonderland (1865) (particularly the pool of tears scene, which seems related to the flood of sweat in one early Rarebit Fiend strip), and a variety of dream cartoons and illustrations that appeared in various periodicals McCay was likely familiar with."]}, {"page": "Theatre of the Absurd", "response": ["As an experimental form of theatre, many Theatre of the Absurd playwrights employ techniques borrowed from earlier innovators. Writers and techniques frequently mentioned in relation to the Theatre of the Absurd include the 19th-century nonsense poets, such as Lewis Carroll or Edward Lear;Esslin, pp. 330–331 Polish playwright Stanisław Ignacy Witkiewicz;Esslin, pp. 382–385 the Russians Daniil Kharms,Neil Cornwell. The absurd in literature. Manchester University Press ND, 2006. . p. 143. Nikolai Erdman,John Freedman. The major plays of Nikolai Erdman: The warrant and The suicide. Routledge, 1995.. xvii. and others; Bertolt Brecht's distancing techniques in his \"Epic theatre\";Esslin, pp. 365–368 and the \"dream plays\" of August Strindberg.J. L. Styan. The dark comedy: the development of modern comic tragedy. Cambridge University Press, 1968. . p. 217."]}, {"page": "Edward Gorey", "response": ["Gorey is typically described as an illustrator. His books may be found in the humor and cartoon sections of major bookstores, but books such as The Object Lesson have earned serious critical respect as works of surrealist art. His experimentation—creating books that were wordless, books that were literally matchbox-sized, pop-up books, books entirely populated by inanimate objects—complicates matters still further. As Gorey told Lisa Solod of The Boston Globe, \"Ideally, if anything were any good, it would be indescribable.\" Gorey classified his own work as literary nonsense, the genre made most famous by Lewis Carroll and Edward Lear.", "He also illustrated more than 50 works by other authors, including Samuel Beckett, Edward Lear, John Bellairs, H. G. Wells, Alain-Fournier, Charles Dickens, T. S. Eliot, Hilaire Belloc (where new illustrations to Cautionary Tales for ChildrenA review of third reprint of Hilaire Belloc's Cautionary Tales for Children interpreted using 61 of Edward Gorey's spare pen-and-ink illustrations were published posthumously), Muriel Spark, Florence Parry Heide, John Updike, John Ciardi,  Felicia Lamport and Joan Aiken."]}, {"page": "Nonsense verse", "response": ["Among writers in English noted for nonsense verse are Edward Lear, Lewis Carroll, Mervyn Peake, Edward Gorey, Colin West, Dr. Seuss, and Spike Milligan. The Martian Poets and Ivor Cutler are considered by some to be in the nonsense tradition.", "Other nonsense verse makes use of nonsense words—words without a clear meaning or any meaning at all. Lewis Carroll and Edward Lear both made good use of this type of nonsense in some of their verse. These poems are well formed in terms of grammar and syntax, and each nonsense word is of a clear part of speech. The first verse of Lewis Carroll's \"Jabberwocky\" illustrates this nonsense technique, despite Humpty Dumpty's later clear explanation of some of the unclear words within it:", "However, not all nonsense verse relies on word play.  Some simply illustrate nonsensical situations. For instance, Edward Lear's poem, \"The Jumblies\" has a comprehensible chorus:", "*Nonsense Books by Edward Lear.", "*An Edward Lear website."]}, {"page": "Holloway, London", "response": ["* Edward Lear (12 May 1812 – 29 January 1888), artist, illustrator, writer and poet; born and brought up in Holloway."]}, {"page": "Pinner", "response": ["Edward Lear makes reference to Pinner in More Nonsense Pictures, Rhymes, Botany, etc:"]}, {"page": "Greenwich", "response": ["Edward Lear makes reference to Greenwich in More Nonsense Pictures, Rhymes, Botany, etc:"]}, {"page": "Victoria and Albert Museum", "response": ["The Salting Bequest of 1909 included, among other works, watercolours by J. M. W. Turner. Other watercolourists include: William Gilpin, Thomas Rowlandson, William Blake, John Sell Cotman, Paul Sandby, William Mulready, Edward Lear, James Abbott McNeill Whistler and Paul Cézanne."]}, {"page": "Oamaru", "response": ["Emily Gillies, a 19th-century Oamaru artist, was the daughter of C.H. Street, maternal niece of Edward Lear (1812–1888), the famous English watercolourist and writer of humorous verse. Lear's sister had virtually brought her brother up. When he died childless before her she inherited his residuary collection. The internationally significant group of works came to North Otago, where it remained intact until the early 1970s."]}]}}