{"wiki_id": "http://www.wikidata.org/entity/Q3098099", "itemLabel": "William Allen Miller", "itemDescription": "British scientist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Allen_Miller", "wikipedia_page": {"main": "William Allen Miller FRS (17 December 1817 – 30 September 1870) was a British scientist.", "link_mentions": [{"page": "Fructose", "response": ["Fructose, or fruit sugar, is a ketonic simple sugar found in many plants, where it is often bonded to glucose to form the disaccharide sucrose. It is one of the three dietary monosaccharides, along with glucose and galactose, that are absorbed directly into blood during digestion. Fructose was discovered by French chemist Augustin-Pierre Dubrunfaut in 1847.Dubrunfaut (1847) \"Sur une propriété analytique des fermentations alcoolique et lactique, et sur leur application à l’étude des sucres\"  (On an analytic property of alcoholic and lactic fermentations, and on their application to the study of sugars), Annales de Chimie et de Physique, 21 :  169–178.  On page 174, Dubrunfaut relates the discovery and properties of fructose.  The name \"fructose\" was coined in 1857 by the English chemist William Allen Miller.  Pure, dry fructose is a sweet, white, odorless, crystalline solid, and is the most water-soluble of all the sugars."]}, {"page": "Sucrose", "response": ["The word sucrose was coined in 1857, by the English chemist William MillerWilliam Allen Miller, Elements of Chemistry:  Theoretical and Practical, Part III. Organic Chemistry (London, England:  John W. Parker and son, 1857), pages 52 and 54 . from the French sucre (\"sugar\") and the generic chemical suffix for sugars -ose. The abbreviated term Suc is often used for sucrose in scientific literature."]}, {"page": "Timeline of telescopes, observatories, and observing technology", "response": ["* 1863 – William Allen Miller and Sir William Huggins use the photographic wet collodion plate process to obtain the first ever photographic spectrogram of a star, Sirius and Capella.Spectrometers, ASTROLab of Mont-Mégantic National Park"]}, {"page": "Astrophotography", "response": ["The first photograph of a star was a daguerreotype of the star Vega by astronomer William Cranch Bond and daguerreotype photographer and experimenter John Adams Whipple, on July 16 and 17, 1850 with Harvard College Observatory's 15 inch Great refractor. In 1863 the English chemist William Allen Miller and English amateur astronomer Sir William Huggins used the wet collodion plate process to obtain the first ever photographic spectrogram of a star, Sirius and Capella.Spectrometers, ASTROLab of Mont-Mégantic National Park In 1872 American physician Henry Draper, the son of John William Draper, recorded the first spectrogram of a star (Vega) to show absorption lines."]}, {"page": "William Huggins", "response": ["Huggins was assisted in the analysis of spectra by his neighbour, the chemist William Allen Miller. Huggins was also the first to adopt dry plate photography in imaging astronomical objects.", "Huggins won the Gold Medal of the Royal Astronomical Society in 1867, jointly with William Allen Miller. He later served as President of the Royal Astronomical Society from 1876-78, and received the Gold Medal again (this time alone) in 1885. He served as an officer of the Royal Astronomical Society for a total of 37 years, more than any other person.", "*Gold Medal of the Royal Astronomical Society (jointly with William Allen Miller in 1867, solo in 1885)"]}, {"page": "William Miller", "response": ["*William Allen Miller (1817–1870), British chemist after whom the Miller crater is named"]}, {"page": "Gold Medal of the Royal Astronomical Society", "response": ["| 1867 || colspan=2 | William HugginsWilliam Allen Miller || || "]}, {"page": "Chemical Society", "response": ["* William Allen Miller: 1855–1857", "* William Allen Miller: 1865–1867"]}, {"page": "Miller (crater)", "response": ["Miller is a lunar impact crater that lies amidst the rugged terrain in the southern part of the Moon. It is attached to the northern rim of the smaller crater Nasireddin, and the outer rampart of the latter reaches almost to the central peak formation at the midpoint of Miller's interior floor. Together with Huggins to the southwest and Orontius to the south-southwest, this foursome forms a chain of craters forming an arc that curves towards the north. The northwest rim of Miller in turn is attached to the satellite crater Miller C, forming the end of the arc. To the southeast lies Stöfler.  The crater is named after British chemist William Allen Miller."]}, {"page": "List of craters on the Moon: L–N", "response": ["| Miller ||  || align=right | 61.37 || align=center | 1935 || William Allen Miller (1817–1870) || "]}, {"page": "Ackworth School", "response": ["*William Allen Miller (1817–1870), chemist"]}, {"page": "Rede Lecture", "response": ["*1870 William Allen Miller On some chemical processes of forming organic compounds, with illustrations from the coal tar colours"]}, {"page": "List of people with craters of the Moon named after them", "response": ["* William Allen Miller"]}, {"page": "List of alumni of King's College London", "response": ["*William Allen Miller – astronomer and chemist"]}, {"page": "List of fellows of the Royal Society M, N, O", "response": ["| William Allen Miller||06/02/1845||17 December 1817 – 30 September 1870"]}, {"page": "Royal Commission on Scientific Instruction", "response": ["The Commission was appointed in May 1870 and was chaired by the Duke of Devonshire. It also included Lord Lansdowne, Sir John Lubbock, Sir James Kay-Shuttleworth, Bernhard Samuelson, William Sharpey, Thomas Henry Huxley (Professor of Natural History at the Royal School of Mines), William Allen Miller (Professor of Chemistry at King's College, London), and George Gabriel Stokes (Lucasian Professor of Mathematics at the University of Cambridge).The Times (21 May 1870), p. 5. Norman Lockyer served as Secretary to the Commission.A. J. Meadows, Science and Controversy: A Biography of Sir Norman Lockyer (Cambridge, Mass.: The MIT Press, 1972), pp. 75-112."]}, {"page": "John Eddowes Bowman the Younger", "response": ["Bowman was the son of John Eddowes Bowman the elder, and brother of Sir William Bowman, physiologist and oculist, born at Welchpool on 7 July 1819. He was a pupil of John Frederic Daniell at King's College, London, and in 1845 succeeded William Allen Miller as demonstrator of chemistry there; he became subsequently, in 1851, the first professor of practical chemistry there. He was one of the founders of the Chemical Society of London. He died on 10 February 1854."]}, {"page": "John Millar Thomson", "response": ["He was educated at the Glasgow High School and then studied at the University of Glasgow. He took the  usual curriculum in arts, and then entered the faculty of medicine, but later changed to chemistry. He worked in a chemistry laboratory from 1866 to 1871, being appointed assistant to professor Anderson in 1869. In 1868 he came to London to attend demonstrations by William Allen Miller and Charles Loudon Bloxam at King's College London. He returned to Glasgow in 1870 to assume a position of assistant demonstrator with Bloxam in early 1871. However, as the senior demonstrator was seriously ill in those years, Thomson took over his duties and was promoted to senior demonstrator in 1879. From 1880 until 1887, in addition to his work at King's College, he was also lecturing in chemistry at Queen's College and became professor in that college. During that time, he led the Chemical Department at King's College, and carried out many"]}]}}