{"wiki_id": "http://www.wikidata.org/entity/Q3103919", "itemLabel": "Geraldine Hughes", "itemDescription": "actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Geraldine_Hughes", "wikipedia_page": {"main": "Geraldine Hughes (born 1970) is an actress from Belfast, Northern Ireland.\nBorn in West Belfast, Hughes has appeared in films such as Duplex, Rocky Balboa, and Gran Torino. She also played Mary Todd Lincoln in Killing Lincoln. More recently, she performed a solo play written by herself,  Belfast Blues.", "link_mentions": [{"page": "Rocky V", "response": ["Jodi Letizia, who played street kid Marie in the original Rocky (1976), was supposed to reprise her role. Her character was shown to have ended up as Rocky predicted she would: a prostitute, but the scene ended up on the cutting room floor. She can briefly be seen during the street fight at the end. The character reappears in Rocky Balboa (2006) as a bartender and confidante to the aging Rocky. Actress Geraldine Hughes took over the role."]}, {"page": "Rocky Balboa (film)", "response": ["* Geraldine Hughes as Marie, a woman whom Rocky originally met over 30 years ago.", "The character Marie appeared in the original Rocky; she was portrayed by Jodi Letizia. For the final film, Marie is portrayed by Geraldine Hughes. (Although Letizia did reprise the role for Rocky V, the sole scene in which she appeared was deleted. In it, Marie was homeless on the streets of Philadelphia.) Another recognizable character who appeared in the previous five films, sportscaster Stu Nahan, provided the commentary for the computer-generated fight between Dixon and Balboa. Nahan was part of the ringside commentary team during all the bouts in the first three films and the Apollo Creed-Ivan Drago fight in Rocky IV. He was diagnosed with lymphoma during the Rocky Balboa filming, though, and died on December 26, 2007. Finally, Pedro Lovell, who portrayed Spider Rico in the original film, returns to the role in Rocky Balboa as a guest and later employee at Rocky's restaurant."]}, {"page": "Gara Takashima", "response": ["*Rocky Balboa (Marie (Geraldine Hughes))"]}, {"page": "1970 in Northern Ireland", "response": ["*Geraldine Hughes, actress."]}, {"page": "Rocky (franchise)", "response": ["| Geraldine Hughes"]}, {"page": "Hughes (surname)", "response": ["*Geraldine Hughes (born 1970), Northern Irish actress"]}, {"page": "List of American films of 2006", "response": ["| Rocky Balboa || Metro-Goldwyn-Mayer / Columbia Pictures / Revolution Studios || Sylvester Stallone (director/screenplay); Sylvester Stallone, Burt Young, Antonio Tarver, Milo Ventimiglia, Geraldine Hughes, Tony Burton, Lou DiBella, James Francis Kelly III || Sports, Drama ||"]}, {"page": "List of American films of 2008", "response": ["| Gran Torino ‡ || Warner Bros. Pictures / Village Roadshow Pictures || Clint Eastwood (director); Nick Schenk (screenplay); Clint Eastwood, Christopher Carley, Bee Vang, Ahney Her, Brian Haley, Geraldine Hughes, Dreama Walker, Brian Howe, John Carroll Lynch, Scott Eastwood, Doua Moua, John Johns, Cory Hardrict, William Hill, Brooke Chia Thao, Chee Thao, Choua Kue, Xia Soua Chang, Sonny Vue, Davis Gloff, Tom Mahard, Nana Gbewonyo, Arthur Cartwright, Austin Douglas Smith, Conor Liam Callaghan, Michael E. Kurowski, Julia Ho, Maykao K. Lytongpao || Drama"]}, {"page": "Young Star Search", "response": ["| Geraldine Hughes"]}, {"page": "Irish Repertory Theatre", "response": ["*** Belfast Blues written and performed by Geraldine Hughes, A Performance on Screen"]}, {"page": "Gran Torino", "response": ["* Geraldine Hughes as Karen Kowalski, Mitch's wife"]}, {"page": "List of people from Northern Ireland", "response": ["* Geraldine Hughes actress"]}, {"page": "List of Gran Torino characters", "response": ["* Karen Kowalski (portrayed by Geraldine Hughes) - Mitch's wife, Walt's daughter in law, the mother of Ashley and Josh, and Steve's sister-in-law."]}, {"page": "Killing Lincoln (film)", "response": ["* Geraldine Hughes as Mary Todd Lincoln wife to President Lincoln, thus First Lady. "]}, {"page": "Time Out of Mind (2014 film)", "response": ["* Geraldine Hughes as Maire"]}, {"page": "List of The Blacklist characters", "response": ["* Geraldine Hughes as Dr. Nina, a doctor specializing in virology from which Keen and Ressler seek help when confronted by biological weapons. "]}, {"page": "The Book of Henry", "response": ["* Geraldine Hughes as Mrs. Evans, Henry's and Christina's teacher"]}, {"page": "Harry Potter and the Cursed Child", "response": ["| rowspan=\"2\" style=\"text-align:center;\"| Geraldine Hughes"]}, {"page": "List of Rocky characters", "response": ["Marie is portrayed by Jodi Letizia in Rocky and Geraldine Hughes in Rocky Balboa."]}, {"page": "St Louise's Comprehensive College", "response": ["* Geraldine Hughes (b. 1970) - actor"]}, {"page": "Wizarding World", "response": ["| Geraldine Hughes"]}, {"page": "Nine Days (film)", "response": ["*Geraldine Hughes as Colleen"]}, {"page": "Steven Klein (producer)", "response": ["Steven Klein is an American film, television, and theater actor and producer. He is the founder of Firefly Theater & Films, a Los Angeles-based production company. The company has staged a number of productions, including works by Itamar Moses, Jane Martin, and Geraldine Hughes. Through Firefly, Klein has also produced several films including Finders Keepers, Print the Legend, and Wrestle. As an actor, he has appeared in various stage, film, and television roles including in An Infinite Ache, The Circle, and Burn Notice.", "Also in 2001, Klein co-created with producer Bruce Cohen a short film collective called Catme with film producer, Bruce Cohen. In 2003, Klein was a producer on Geraldine Hughes' one-woman show, Belfast Blues, which premiered at the Black Dahlia Theatre in February of that year. The show went on to stage several other productions including at the Off Broadway Barrow Street Theatre in New York and the Off West End Soho Theatre in London. Klein also had his first television guest role in 2003 on an episode of Star Trek: Enterprise."]}]}}