{"wiki_id": "http://www.wikidata.org/entity/Q3103952", "itemLabel": "Gerard Noel", "itemDescription": "Royal Navy admiral of the fleet", "wikipedia_url": "https://en.wikipedia.org/wiki/Gerard_Noel_(Royal_Navy_officer)", "wikipedia_page": {"main": "Admiral of the Fleet Sir Gerard Henry Uctred Noel,  (5 March 1845 – 23 May 1918) was a Royal Navy officer. As a junior officer he commanded a naval brigade which took part in the capture of Kumasi in February 1874 during the Second Anglo-Ashanti War.\nNoel went on to be Second-in-Command of the Mediterranean Fleet: during this tour, following the murder of the British vice-consul in Heraklion and an attack on the Customs House there, Noel landed a force in Crete to court-martial the terrorists and generally restore order. After that he became Admiral Superintendent of Naval Reserves and was given the additional responsibility of Commander-in-Chief, Home Fleet. He then became Commander-in-Chief, China Station: at the time relations between the United Kingdom and Russia were strained as the United Kingdom expressed its considerable dissatisfaction in relation to Russian aggression at the start of the Russo-Japanese War. His last appointment was as Commander-in-Chief, The Nore.", "link_mentions": [{"page": "Admiral of the Fleet (Royal Navy)", "response": ["|  || 100px || Noel GerardSir Gerard Noel  || 1845 || 1918 ||  ||"]}, {"page": "Home Fleet", "response": ["On 1 October 1902, the Admiral Superintendent Naval Reserves, then Vice-Admiral Gerard Noel, was given the additional appointment of Commander-in-Chief, Home Fleet, and allotted a rear-admiral to serve under him as commander of the Home Squadron.Seligmann 2010. \"... the nucleus of the Home Fleet would consist of the four Port Guard ships, which would be withdrawn from their various scattered dockyards and turned into a unified and permanent sea-going command – the Home Squadron – based on Portland. Also under the direction of the commander-in-chief of the Home Fleet would be the Coast Guard ships, which would continue to be berthed for the most part in their respective district harbours in order to carry out their local duties, but would join the Home Squadron for sea work at least three times per year, at which point the assembled force – the Home Squadron and the Coast Guard vessels – would be known collectively as the Home Fleet.\"Seligmann 2010, drawing upon T.N.A.: P.R.O., ADM 1/7606, docket Coast Guard, 24 March 1902, proposal by Sir Gerard Noel, 14 May 1902, and memorandum by Lord Walter Kerr, 17 May 1902. Rear-Admiral George Atkinson-Willes was Second-in-Command of the Home Fleet, with his flag in the battleship HMS Empress of India, at this time.Seligmann 2009 In May 1903 Noel was succeeded as Commander-in-Chief by Vice-Admiral Sir Arthur Wilson.Heathcote, p. 195", "|1 ||Vice-Admiral || 25px || Sir Gerard Noel ||1 October 1902 – 21 May 1903"]}, {"page": "Bloxham School", "response": ["*Admiral of the Fleet Sir Gerard Noel GCB KCMG, Commander-in-Chief, Home Fleet"]}, {"page": "Fourth Sea Lord", "response": ["*Rear Admiral Sir Gerard Noel 1893-1898"]}, {"page": "Commander-in-Chief, The Nore", "response": ["* Admiral Sir Gerard Noel (1907–1908)"]}, {"page": "HMS Raleigh (1873)", "response": ["* , Francis Alexander Hume, then Gerard Noel (acting captain)"]}, {"page": "Prince Consort-class ironclad", "response": ["* Laughton, John Knox  Essay on Naval Tactics, 1873, published as Part 2 of The Gun, Ram and Torpedo, Manoeuvres and tactics of a Naval Battle of the Present Day, by Gerard Noel, 2nd Edition, pub Griffin 1885."]}, {"page": "HMS Inflexible (1876)", "response": ["She was also equipped with a ram – ramming was considered a practical means of sinking an enemy battleship at that time. The Italian Re d'Italia had been rammed and sunk by the Austrian flagship, Ferdinand Max, at the Battle of Lissa in 1866. This had started a vogue for ramming (which persisted until the 1890s), and many naval experts even believed this was the most effective weapon a ship could have. For example Gerard Noel won the 1874 Royal United Services Institute essay contest with an article that asserted that \"[i]n a general action I do not hold that the guns will be the principal weapon\"."]}, {"page": "HMS Nile (1888)", "response": ["After delivery, she was commissioned at Portsmouth on 30 June 1891 for manoeuvres, following which she was assigned to the Mediterranean Fleet.Parkes, p. 346 When the battleships Victoria and Camperdown collided on 22 June 1893, Nile was next astern and it was only through the skillful manoeuvring of Captain Gerard Noel that his ship was not also involved in the collision.Heathcote, p. 194 Nile had her 4.7-inch guns replaced by QF  guns in 1896. She came home in January 1898 to become the port guardship at Devonport,Parkes, pp. 345–46 and Captain Robert Rolleston was in command in June 1902. She took part in the fleet review held at Spithead on 16 August 1902 for the coronation of King Edward VII. In February 1903, the ship was relegated to the reserve at Devonport, where she remained until she was sold on 9 July 1912 for £34,000 to be broken up at Swansea by Thos W Ward.Phillips, p. 236"]}, {"page": "HMS Revenge (1892)", "response": ["From February 1897 to December 1898, Revenge served in the International Squadron, a multinational force made up of ships of the Austro-Hungarian Navy, French Navy, Imperial German Navy, Italian Royal Navy (Regia Marina), Imperial Russian Navy, and Royal Navy that intervened in the 1897-1898 Greek uprising on Crete against rule by the Ottoman Empire. She served as flagship of the British component of the squadron, initially under Rear-Admiral Robert Harris, and later under Rear-Admiral Gerard Noel, and played a very active role in the International Squadron's operations. Leading a Royal Navy force that reinforced the battleship , the British ship on station at Crete when unrest broke out in early February 1897, Revenge and the battleship  arrived at Canea (now Chania) on 9 February 1897.McTiernan, Mick, \"Spyros Kayales – A different sort of flagpole,\" mickmctiernan.com, 20 November 2012.The British in Crete, 1896 to 1913: British warships off Canea, March 1897McTiernan, p. 14.Clowes, p. 444. She contributed personnel to an international landing force of sailors and marines the squadron put ashore at Canea on 15 February 1897.The British in Crete, 1896 to 1913: Naval Patrol On 21 February 1897, she joined the British torpedo gunboats  and , the Russian battleship Imperator Aleksandr II, the Austro-Hungarian armored cruiser , and the German protected cruiser  in the International Squadron's first direct offensive action, a brief bombardment of Cretan insurgent positions on the heights east of Canea after the insurgents refused the squadron's order to take down a Greek flag they had raised, and she hit the farmstead that served as the insurgents′ base of operations with three 6-inch (152-mm) shells.McTiernan, p. 17. After a bombardment by the British battleship  on 26 and 27 March 1897 forced insurgents to abandon their siege of the Izzeddin Fortress  near the entrance to Suda Bay, Revenge put a contingent of Royal Marines ashore that occupied the fortress.The British in Crete, 1896 to 1913: The battle for the Malaxa blockhouseMcTiernan, p. 23.Clowes, p. 446.", "In 1899, Revenge suffered a cordite explosion in one of her 6-inch (152-mm) magazines due to spontaneous combustion, but the damage was not very severe because only three cartridges detonated.Brown, p. 124 In April 1900, the battleship  replaced her in the Mediterranean and she returned home, paying off into Fleet Reserve at Chatham Dockyard. During this time the ship had a wireless telegraph installed.Burt, pp. 85, 94 On 18 April 1901, Revenge was recommissioned at Chatham by Captain Frederic Fisher to relieve Alexandra as both the coast guard ship at Portland and the flagship of Rear Admiral Sir Gerard Noel, Admiral Superintendent of Naval Reserves. In March 1902, she arrived at Portsmouth for a refit that included the provision of casemates for her upper-deck six-inch guns, and her crew was temporarily transferred to the elderly ironclad , which also took on her duties at Portland. Captain Fisher and his crew were back on board Revenge in early June 1902, following gun trials after the repairs. After the refit, she took part in the fleet review held at Spithead on 16 August 1902 for the coronation of King Edward VII, then commissioned in October 1902 to serve as flagship of the Home Fleet upon its creation.Parkes, p. 362"]}, {"page": "Commander-in-Chief, China (Royal Navy)", "response": ["|1904–1906||Vice-Admiral Sir Gerard Noel"]}, {"page": "HMS Royal Sovereign (1891)", "response": ["On 7 June 1897, Royal Sovereign paid off and her crew was transferred to the battleship  which relieved her in the Channel Squadron. The next day, she recommissioned to relieve the battleship  in the Mediterranean Sea. Before departing for the Mediterranean, she took part in the Fleet Review for the Diamond Jubilee of Queen Victoria at Spithead on 26 June 1897, and from 7–11 July took part in annual manoeuvres off the coast of Ireland. She finally departed England for the Mediterranean in September. Upon arrival, Royal Sovereign joined the Mediterranean Fleet. On 18 January 1899, Rear-Admiral Gerard Noel, Second-in-Command of the Mediterranean Fleet, hoisted his flag aboard the shipAkers, p. 30 and Captain Charles Henry Adair was appointed in command two days later. The following month the ship toured Italian waters, visiting Naples, Genoa, Palermo and Syracuse. On 14 July, she visited Fiume (modern Rijeka), Croatia, in company with four other battleships, departing five days later. On the 28th, one man was killed aboard Royal Sovereign in a gun accident and he was buried at sea that evening.Akers, pp. 50, 52, 54"]}, {"page": "Defensively equipped merchant ship", "response": ["There was more criticism in Britain, where Commander Barry Domvile, Secretary to the Committee of Imperial Defence, warned that the policy undermined Britain's objection to the arming of German merchant ships. Domvile predicted that arming merchant ships would be ineffective, and would lead only to a second maritime arms race alongside the naval one. Gerard Noel, a former Admiral of the Fleet, told Churchill that were a merchant ship ever to fire its guns it could be accused of piracy. Churchill replied by drawing a distinction between merchant ships armed as auxiliary cruisers and those armed only for self-defence."]}, {"page": "Gerard Noel", "response": ["Gerard Noel may refer to:", "* Sir Gerard Noel, 2nd Baronet (1759–1838), British MP", "* Gerard Noel (politician) (1823–1911), British MP", "* Gerard Noel (Royal Navy officer) (1845–1918), Royal Navy admiral of the fleet", "* Gerard Noel (editor) (1926–2016), fellow of the Royal Society of Literature", "* Gerard Noel (Wiccan), co-founder of the Witchcraft Research Association"]}, {"page": "Russian cruiser Gerzog Edinburgski", "response": ["Gerzog Edinburgski was originally to be named Alexander Nevski but was renamed before launching. She was launched in 1875 and served in the Far East from 1879 to 1884 and in the Mediterranean Sea from 1897 until ca. 1900. While in the Mediterranean, she deployed to Crete to serve in the International Squadron, a multinational force made up of ships of the Austro-Hungarian Navy, French Navy, Imperial German Navy, Italian Royal Navy (Regia Marina), Imperial Russian Navy, and Royal Navy that intervened in the 1897-1898 Greek uprising on Crete against rule by the Ottoman Empire. She took part in the squadron's final operations when, as flagship of the commander of the squadron's Russian forces, Rear Admiral Nikolai Skrydlov, she departed Crete along with the British battleship  (flagship of the commander of British forces in the squadron, Rear-Admiral Gerard Noel) and the Italian battleship Francesco Morosini (flagship of the admiral commanding the squadron's Italian ships) in steaming to Milos with the French protected cruiser Bugeaud, flagship of the International Squadron's overall commander, Rear Admiral Édouard Pottier. At Milos, they rendezvoused with Prince George of Greece and Denmark aboard his yacht. After Prince George boarded Bugeaud on 20 December, Gerzog Edinburgski, Francesco Morosini, and Revenge escorted Bugeaud to Crete, where Prince George disembarked on 21 December 1898 to take office as the High Commissioner of an autonomous Cretan State under the suzerainty of the Ottoman Empire, bringing the Cretan uprising to an end.The British in Crete, 1896 to 1913: Escorting a PrinceClowes, p. 448McTiernan, p. 39. The International Squadron then dissolved."]}, {"page": "Gerard Noel (admiral)", "response": ["#REDIRECT Gerard Noel (Royal Navy officer)"]}, {"page": "Ernest Troubridge", "response": ["Troubridge was promoted to the rank of commander in 1895, serving with the Mediterranean Fleet aboard the flagship of the fleet's second in command, , initially Rear-Admiral Sir Robert Harris, and later Rear-Admiral Sir Gerard Noel. He was promoted to captain 17 July 1901 and went on to serve as a naval attaché to several powers, based at first in Vienna, and from 1902 in Madrid. He became a naval attaché in Tokyo later in 1902, and served as such until 1904. With the outbreak of the Russo-Japanese War he went to sea with the Japanese warships and was present at the Battle of Chemulpo Bay and the subsequent operations off Port Arthur. After the conclusion of the war Troubridge was awarded the Order of the Rising Sun by the Japanese, while the British government appointed him a Companion of the Order of St Michael and St George and a Member of the Royal Victorian Order. He took command of the battleship , serving as flag captain to the commander of the Mediterranean Fleet, Admiral Sir Charles Drury."]}, {"page": "Italian ironclad Francesco Morosini", "response": ["Francesco Morosini deployed to Crete to served in the International Squadron, a multinational force made up of ships of the Austro-Hungarian Navy, French Navy, Imperial German Navy, Regia Marina, Imperial Russian Navy, and Royal Navy that intervened in the 1897-1898 Greek uprising on Crete against rule by the Ottoman Empire. She took part in the squadron's final operations when, as flagship the Italian division of the International Squadron, she departed Crete along with the British battleship  (flagship of the commander of British forces in the squadron, Rear-Admiral Gerard Noel) and the Russian armored cruiser Gerzog Edinburgski (flagship of the commander of the squadron's Russian forces, Rear Admiral Nikolai Skrydlov) in steaming to Milos with the French protected cruiser Bugeaud, flagship of the International Squadron's overall commander, Rear Admiral Édouard Pottier. At Milos, they rendezvoused with Prince George of Greece and Denmark aboard his yacht. After Prince George boarded Bugeaud on 20 December, Francesco Morosini, Revenge, and Gerzog Edinburgski escorted Bugeaud to Crete, where Prince George disembarked on 21 December 1898 to take office as the High Commissioner of an autonomous Cretan State under the suzerainty of the Ottoman Empire, bringing the Cretan uprising to an end.Clowes, pp. 444–448"]}, {"page": "Gerard H U Noel", "response": ["#REDIRECT Gerard Noel (Royal Navy officer)"]}, {"page": "International Squadron (Cretan intervention, 1897–1898)", "response": ["Meanwhile, by the spring of 1898, the Powers began to relax the blockade, reduce their presence in the International Squadron, and draw down their occupying forces ashore on Crete; for example, the British presence fell to one British Army battalion ashore and typically one battleship (usually anchored at Suda Bay), one cruiser, and one gunboat on station.McTiernan, p. 30. With the situation on Crete quiet, the British commander of forces on and around Crete, Rear-Admiral Gerard Noel (1845–1918) – who relieved Rear-Admiral Robert Harris (1843–1926) of this duty on 12 January 1898 – withdrew his flag from Crete and delegated his seat on the Admirals Council to whichever officer happened to be the British Senior Naval Officer at Crete at the time of each of the council's meetings, leading to frequent changes in British representation. For its part, the council began to loosen its formerly tight control over affairs on Crete, allowing greater autonomy in the decision-making of lower-ranking officers of the occupation force as they dealt with affairs on Crete. On 25 July 1898, the Admirals Council took the major step of turning over civil administration of Crete, except for the towns under international occupation, to the Christian Assembly, which was intended to become the legislative body of the Cretan State.", "The International Squadron's senior British commander, Rear-Admiral Gerard Noel, arrived at Candia aboard his flagship HMS Revenge – joined soon afterward by two more British warships, the battleship  and the protected cruiser  – on 12 September 1898. He disembarked immediately to inspect the scene of the riot personally, and ordered the Ottoman governor, Edhem Pasha, to meet him aboard Revenge on the morning of 13 September. At the meeting, Noel ordered Edhem Pasha to demolish all buildings from which rioters had fired on the British camp and hospital, disarm the entire Muslim population of the city, pay all customs duties due since 3 May 1898 and continue to pay them daily, and hand over the persons chiefly responsible for instigating the riot so that they could face trial; when Edhem Pasha refused, Camperdown and Revenge conducted a demonstration that overcame his reluctance. Ottoman officials met all of Noel's demands.McTiernan, p. 42.", "Prince George's arrival suffered a last-minute delay when an argument broke out among the four powers over the design of the flag of the new Cretan State. After the new flag's design met with the approval of all four powers, the four flagships of the countries making up the International Squadron – the French protected cruiser Bugeaud with the International Squadron's senior commander, Vice Admiral Édouard Pottier, aboard; the Italian battleship Francesco Morosini, carrying the admiral commanding the squadron's Italian ships; the Russian armored cruiser Gerzog Edinburgski with the senior Russian commander, Rear Admiral Nikolai Skrydlov, aboard; and the British battleship  with the British commander, Rear Admiral Gerard Noel, aboard – finally steamed on 19 December 1898 to Milos, where Prince George awaited them on his yacht. He boarded Bugeaud on 20 December. Escorted by the other three flagships, Bugeaud took him to Suda, where he disembarked on 21 December 1898 to take up duties as High Commissioner of the new Cretan State. His arrival on the island brought 229 years of direct Ottoman rule of Crete – as well as de facto control of the island by the Admirals Council – to an end.McTiernan, p. 39."]}, {"page": "May 1918", "response": ["* Died: Mariano Ponce, Filipino politician, one of the founders of the news organization La solidaridad (b. 1863); Gerard Noel, British naval officer, leading naval commander in the Second Anglo-Ashanti War, recipient of the Order of the Bath and Order of St Michael and St George (b. 1845)"]}, {"page": "Frederic Fisher", "response": ["Born the son of Captain William Fisher and the younger brother of John Fisher, Fisher joined the Royal Navy around 1870. He was given command of the cruiser HMS Grafton in 1898 and the battleship HMS Collingwood in 1899. In early February 1900 it was announced that Fisher would be appointed in command of the battleship HMS Illustrious, but the appointment was cancelled, and he remained in charge of Collingwood for another couple of months. On 18 April 1901, he commissioned at Chatham the pre-dreadnought battleship HMS Revenge, which was to serve both as coast guard ship at Portland and flagship of Rear-Admiral Sir Gerard Noel, Admiral Superintendent of Naval Reserves. He received command of the battleship HMS Canopus in 1904.Captains of Royal Navy Warships  at gulabin.com, Retrieved 12 October 2013 He went on to be Admiral Superintendent of Malta Dockyard in 1907 and President of the Royal Naval College, Greenwich in 1911 before retiring in 1914.Royal Navy Senior Appointments  at gulabin.com, Retrieved 12 October 2013"]}, {"page": "October 1902", "response": ["* The Royal Navy establishes its Home Fleet, under Vice-Admiral Gerard Noel.Matthew S. Seligmann, A prelude to the reforms of Admiral Sir John Fisher: the creation of the Home Fleet, 1902–3, Historical Research, 2009"]}, {"page": "Édouard Pottier", "response": ["Promoted to rear admiral on 10 February 1893, Pottier became 4th Maritime District commander at Rochefort on 7 October 1893. He assumed command of a division of the Mediterranean Squadron in 1896. In 1897, he took command of the French division of the International Squadron, a multinational force that intervened in a Christian uprising against the Ottoman Empire on Crete, operating on and around Crete from February 1897 to December 1898 and managing the island's affairs via an Admirals Council consisting of the admirals commanding the national contingents of the squadron, which included Pottier. In 1898 he relieved Italian Vice Admiral Felice Napoleone Canevaro as commander of the International Squadron and president of the Admirals Council, remaining the squadron's senior officer and president of the council until the squadron's dissolution,Clowes, p. 444. and he was elevated to the Grand Cross of the Legion of Honour on 12 July 1898 and promoted to vice admiral on 11 October 1898. In the International Squadron's final act, Pottier steamed aboard his flagship, the protected cruiser  – accompanied by the squadron's Italian flagship, the battleship , its Russian flagship, the armored cruiser  with the senior Russian commander Rear Admiral Nicholas Skrydloff aboard, and its British flagship, the battleship  with Rear-Admiral Gerard Noel aboard – on 19 December 1898 to Milos in the Aegean Sea, where Prince George of Greece and Denmark left his yacht on 20 December and embarked aboard Bugeaud. Escorted by the other three flagships, Bugeaud took him to Suda, Crete, where Prince George disembarked on 21 December 1898 to take up duties as High Commissioner of the new Cretan State under the suzerainty of the Ottoman sultan. His arrival on the island brought 229 years of direct Ottoman rule of Crete to an end.Clowes, p. 448. Pottier and the other  admirals commanding the national contingents of the International Squadron promptly requested that their governments recall them, and the International Squadron was dissolved."]}, {"page": "Oswald Tuck", "response": ["In June 1904, four years after Tuck had begun learning Japanese on his own initiative and two years after the Anglo-Japanese Alliance had come into force, the Admiralty made special arrangements for the study of Japanese by naval officers, allowing up to a year's residence in Japan. In August Vice-Admiral Sir Gerard Noel, Commander-in-Chief of the China Station, wrote to Sir Claude Maxwell MacDonald, the first British ambassador to Japan, seeking the services of a ‘suitable and reliable Instructor in the Japanese language for service with the British China Squadron’, possibly a ‘suitable retired Japanese Naval Officer, who has perhaps been wounded in the war and would be glad of a little financial assistance’. In February 1905, Macdonald replied to Noel to say that Baron Komura Jutarō, the Minister of Foreign Affairs, had been unable to find a suitable person.The National Archives, ADM 1/7728: Admiralty Circular Letter (printed) of 10 June 1904 (7200/1904); Noel to MacDonald, 5 August 1904; MacDonald to Noel, 11 February 1905. By this time Tuck was living in Japan and studying the language full-time, although he was finding the expenses involved much greater than he had expected.The National Archives, ADM 1/7728: Tuck to Captain Stoppard, 18 January 1905; Gubbins to MacDonald, 10 January 1904 [sic: 1905]. Later in 1905 Sir Claude  MacDonald instructed John Harington Gubbins, who had been Japanese Secretary in the British Legation for many years and had a good command of Japanese, to examine Tuck on his knowledge of Japanese. Gubbins reported in September that Tuck had gained full marks in colloquial and more than 75% for each of the two written papers, and that he had a good knowledge of Chinese characters. ‘A little further study of newspapers, and a course of instruction in what is known as official dispatch style, would, I think, enable Mr. Tuck to attain the standard required for interpreters in the Japan Consular Service', he concluded. In December Tuck received a certificate stating that he had passed the examination for Interpreter in Japanese and a few days later received appointment as Interpreter in Japanese on HMS King Alfred.Tuck Papers 2/5. In February 1906 Vice-Admiral Noel wrote to Tuck and forwarded to him extracts from an Admiralty letter dated 25 October 1905, which stated that ‘it would be a convenience if the services of Mr. Oswald Tuck could be utilized in connection with the instruction in the Japanese language of Naval Officers on the China Station, having regard to his special qualifications for such work’. And in 1907 the Admiralty wrote to express their appreciation for Tuck's translation of a diary by a Russian officer serving  on the Russian battleship Oryol.Tuck Papers 2/5. It was clear that Tuck's command of Japanese was now appreciated by the Admiralty."]}]}}