{"wiki_id": "http://www.wikidata.org/entity/Q3104332", "itemLabel": "Gerry Conlon", "itemDescription": "Northern Irish author and writer, one of the Guildford Four (1954-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gerry_Conlon", "wikipedia_page": {"main": "Gerard \"Gerry\" Conlon (1 March 1954 – 21 June 2014) was an Irish man known for being one of the Guildford Four who spent 15 years in prison after being wrongly convicted of being a Provisional IRA bomber.", "link_mentions": [{"page": "2014", "response": ["* June 21 – Gerry Conlon, Irish man, wrongly convicted of murder (b. 1954)"]}, {"page": "Academy Award for Best Adapted Screenplay", "response": ["| The book Proved Innocent by Gerry Conlon"]}, {"page": "In the Name of the Father (film)", "response": ["In the Name of the Father is a 1993 biographical film co-written and directed by Jim Sheridan. It is based on the true story of the Guildford Four, four people falsely convicted of the 1974 Guildford pub bombings, which killed four off-duty British soldiers and a civilian. The screenplay was adapted by Terry George and Jim Sheridan from the 1990 autobiography Proved Innocent: The Story of Gerry Conlon of the Guildford Four by Gerry Conlon.The Irish Filmography 1896-1996; Red Mountain Press; 1996. Page 59. It is often regarded as one of the greatest films of the 1990's and one of the greatest of all time. ", "In Belfast, Gerry Conlon is mistaken for an IRA sniper by British security forces and pursued until a riot breaks out. Gerry is sent to London by his father Giuseppe to dissuade an IRA reprisal against him. One evening, Gerry burgles a prostitute's flat and steals £700. While he is taking drugs in a park with homeless Irishman Charlie Burke, an explosion in Guildford occurs, killing four off-duty soldiers plus a civilian as well as injuring many others. Having returned to Belfast some time later, Gerry is captured by the British Army and Royal Ulster Constabulary and arrested on terrorism charges.", "*Daniel Day-Lewis as Gerry Conlon", "Model, now actress, Saffron Burrows made her feature film debut in the film, as Gerry Conlon's free love-interest at a commune/squat in London at the time of the bombings.", "To prepare for the role of Gerry Conlon, Day-Lewis lost over 50 pounds in weight. To gain an insight into Conlon's thoughts and feelings at the time, Day-Lewis also spent three days and nights in a jail cell. He was prevented from sleeping by a group of thugs, who would bang on the door every ten minutes with tin cups through the night, then was interrogated by three different teams of real Special Branch officers for nine hours. He would also insist that crew members throw cold water at him and verbally abuse him. He also kept his Belfast accent on and off set."]}, {"page": "Daniel Day-Lewis", "response": ["He returned to work with Jim Sheridan on In the Name of the Father in which he played Gerry Conlon, one of the Guildford Four, who were wrongfully convicted of a bombing carried out by the Provisional IRA. He lost 2st 2 lb (30 lb or 14 kg) for the part, kept his Northern Irish accent on and off the set for the entire shooting schedule, and spent stretches of time in a prison cell. He insisted that crew members throw cold water at him and verbally abuse him. Starring opposite Emma Thompson (who played his lawyer Gareth Peirce), and Pete Postlethwaite, Day-Lewis earned his second Academy Award nomination, third BAFTA nomination, and second Golden Globe nomination.", "| Gerry Conlon"]}, {"page": "Golden Globe Award for Best Actor – Motion Picture Drama", "response": ["| Daniel Day-Lewis || Gerry Conlon || In the Name of the Father "]}, {"page": "Tommy Sheridan", "response": ["A \"Defend Tommy Sheridan\" campaign was launched by sympathetic trade unionists and politicians to demand why Sheridan was being investigated. In December 2007, Sunday Herald columnist Iain MacWhirter said it was \"hard not to conclude that the police's diligence has been inspired by Rupert Murdoch's News International.\" The campaign drew support from the politician George Galloway and leading trade unionist Bob Crow (RMT). At a June 2008 rally organised by the campaign, speakers including FBU secretary Kenny Ross, Paddy Hill, and Gerry Conlon queried the motives for the investigation, questioned the role of the police and Crown Office and verbally attacked the witnesses who had given evidence unhelpful to Sheridan in the original hearing."]}, {"page": "Waldo Peirce", "response": ["Alzira Handforth Boehm was the granddaughter of Vienna-born August Abraham Boehm, the high-flying developer who built an 11-story skyscraper in the Manhattan Diamond District that was one of the first in the world. Known as 14 Maiden Lane or \"The Diamond Exchange,\" it's still there. She studied at the Art Students League in Manhattan and later studied in Paris. Dr. William Gallagher of Bangor, an expert on Waldo Peirce, writes in the Harvard Review that Alzira met Waldo \"at a Matisse show in New York.\" In Paris she delivered the couple's twin boys, Michael and Mellen. They then had daughter Anna. Mellen Chamberlain Peirce is an active poet and playwright who lives in London. His wife is Gareth Peirce, the human rights activist attorney for the Birmingham Six and Gerry Conlon and the Guildford Four. Emma Thompson was nominated for an Oscar playing Gareth in the 1993 movie In The Name of the Father, with Daniel Day-Lewis also nominated for his role as Conlon."]}, {"page": "Guildford Four and Maguire Seven", "response": ["Giuseppe Conlon had travelled from Belfast to help his son, Gerry Conlon, in the Guildford Four trial. Conlon, who had troubles with his lungs for many years, died in prison in January 1980, while the other six served their sentences and were released.", "Gerry Conlon's autobiography Proved Innocent was adapted into the film  In the Name of the Father, with actor Daniel Day-Lewis portraying Conlon. The film depicts Conlon's attempt to rebuild his shattered relationship with his father but is partly fictional, Conlon never shared a cell with his father. He is reported to have settled with the government for a final payment of compensation in the region of £500,000. Conlon gave support to Tommy Sheridan in relation to the charges brought against him.", "Gerry Conlon later joined a campaign to free the \"Craigavon Two\", Brendan McConville and John Paul Wootton, convicted of the murder of a police officer in Northern Ireland. "]}, {"page": "Conlon", "response": ["* Gerry Conlon (1954-2014), a member of the Guildford Four"]}, {"page": "BAFTA Award for Best Actor in a Leading Role", "response": ["| Gerry Conlon "]}, {"page": "Falls Road, Belfast", "response": ["A strong working class community, the Lower Falls has a history of storytelling, music and song which was often enjoyed in the many public houses in the area.  These included such establishments as the Old House, McGeowns, the West End Bar, the Laurel Leaf, the Centre Half and Haughey's. Gerry Conlon, who grew up in Peel Street, recalled in his autobiography Proved Innocent how he could see several pubs just a few yards from his front door:"]}, {"page": "Guildford pub bombings", "response": ["The bombings were at the height of the Troubles in Northern Ireland. The Metropolitan Police were under enormous pressure to apprehend the IRA bombers responsible for the attacks in England. In December 1974 the police arrested three men and a woman, later known as the Guildford Four. One of the four, Gerry Conlon, had been in London at the time of the bombings, and had visited his mother's sister, Annie Maguire. A few days after the Guildford Four were arrested, the Metropolitan Police arrested Annie Maguire and her family, including Conlon's father, Patrick \"Giuseppe\" Conlon – the \"Maguire Seven\"."]}, {"page": "M62 coach bombing", "response": ["Judith Ward initially struggled with life as a free woman following the overturning of her conviction, in part because of the lack of a support structure she received from society after she had been formally exonerated. In 1996, Ward recollected to a reporter that, immediately prior to her release from prison, she was simply \"given £35 and a hand-written note to produce at [the] DSS\" before being released from custody with no individuals to offer advice, therapy, or other forms of support. As had earlier been the case with Gerry Conlon of the Guildford Four, Ward initially resided with solicitor Gareth Peirce until a secure home could be found for her."]}, {"page": "66th Academy Awards", "response": ["** Daniel Day-Lewis – In the Name of the Father as Gerry Conlon", "** In the Name of the Father – Jim Sheridan and Terry George based on the autobiographical book Proved Innocent by Gerry Conlon"]}, {"page": "Saturday Night with Miriam", "response": ["| 30 June 2007 || Al Green, Gerry Conlon & Paddy Hill, Kellie Shirley, Jason Byrne & Pamela Flood, Brendan O'Carroll || "]}, {"page": "List of non-fiction works made into feature films", "response": ["|Proved Innocent: The Story of Gerry Conlon of the Guildford Four (1990), Gerry Conlon"]}, {"page": "47th British Academy Film Awards", "response": ["* Daniel Day-Lewis – In the Name of the Father as Gerry Conlon"]}, {"page": "David Pallister", "response": ["He was the author (with Sarah Stewart and Ian Lepper) of South Africa Inc.: The Oppenheimer Empire (Simon & Schuster, 1987). He helped Gerry Conlon of the Guildford Four with his autobiography, Proved Innocent (Hamish Hamilton, 1990). With Luke Harding and David Leigh, he was an author of The Liar: The Fall of Jonathan Aitken (Penguin, 1997)."]}, {"page": "Face (1997 film)", "response": ["* Gerry Conlon – Vince"]}, {"page": "Tom McGurk", "response": ["McGurk wrote the script for the TV film Dear Sarah based on the letters from Sarah Conlon, campaigning for the release of her husband (Giuseppe Conlon), son (Gerry Conlon) and sister Anne Maguire, caught up in the Guildford Four miscarriage of justice."]}, {"page": "Injustice", "response": ["*In the Name of the Father (1993), about the conviction of Gerry Conlon of the Guildford pub bombings"]}, {"page": "HM Prison Gartree", "response": ["* Gerry Conlon - Member of the Guildford Four, wrongly convicted of being a Provisional IRA bomber."]}, {"page": "Writers Guild of America Award for Best Adapted Screenplay", "response": ["| In the Name of the Father || Terry George and Jim Sheridan || The autobiography Proved Innocent: The Story of Gerry Conlon of the Guildford Four by Gerry Conlon"]}, {"page": "Sarah Conlon", "response": ["The film In the Name of the Father (1993), directed by Jim Sheridan and starring Daniel Day-Lewis, is based on the Conlon family's story. Actress Marie Jones portrayed Sarah Conlon. The film was adapted from Gerry Conlon's autobiography Proved Innocent, later published as In the Name of the Father."]}, {"page": "Anthony Scrivener", "response": ["Scrivener's clients included notable individuals such as Sir Richard Branson, Gerry Conlon of the Guildford Four, Jack Lyons of the Guinness Four, Lee Clegg, Ken Livingstone, Joseph Lyons Asil Nadir, Tony Martin, Peter Godber, Dame Shirley Porter and Winston Silcott. Scrivener was one of the highest earning members of the bar, including the first £1 million brief for one of the members of the Carrian Group fraud trial. Despite this, he was a strong supporter of legal aid, and included pro bono work in his practice."]}, {"page": "Murder of Teresa De Simone", "response": ["Gerry Conlon, who was wrongly imprisoned for 15 years, also warns that after-release support is inadequate. After the imposed routine of prison life, outside prison \"you are lost\". Suicidal thoughts and attempts, panic attacks, nightmares and drug use are common. \"Most people released after miscarriages of justice end up as recluses, their marriages fail, they aren't talking to their children, they become drug addicts and alcoholics, they die premature deaths.\""]}]}}