{"wiki_id": "http://www.wikidata.org/entity/Q310052", "itemLabel": "Joe Strummer", "itemDescription": "British musician, singer, actor and songwriter (1952-2002)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Strummer", "wikipedia_page": {"main": "John Graham Mellor (21 August 1952 – 22 December 2002), better known as Joe Strummer, was a British musician who was the co-founder, lyricist, rhythm guitarist and co-lead vocalist of punk rock band the Clash, formed in 1976. The Clash's second album Give 'Em Enough Rope (1978) reached No. 2 on the UK charts. Soon after, they achieved success in the US, starting with London Calling (1979) and peaking with Combat Rock (1982), which reached No. 7 on the US charts and was certified 2× platinum there. The Clash's explosive political lyrics, musical experimentation, and rebellious attitude had a far-reaching influence on rock music in general, especially alternative rock. Their music incorporated reggae, ska, dub, funk, rap and rockabilly.\nStrummer's other career highlights included stints with the 101ers, Latino Rockabilly War, the Mescaleros, and the Pogues, as well as solo music. His work as a musician allowed him to explore other interests such as acting, scoring television shows and films, hosting radio shows, and as a radio host on the BBC Radio show London Calling. Strummer and the Clash were inducted into the Rock and Roll Hall of Fame in January 2003. In his remembrance, Strummer's friends and family established the Joe Strummer Foundation (initially known as Strummerville), a non-profit organisation which gives opportunities to musicians and support to projects around the world that create empowerment through music.", "link_mentions": [{"page": "August 21", "response": ["*  1952   – Joe Strummer, English singer-songwriter and guitarist (d. 2002)"]}, {"page": "Big Audio Dynamite", "response": ["1986's No. 10, Upping St. reunited Jones for one last album with former Clash lyricist and lead vocalist Joe Strummer, who was credited with co-producing the album and co-writing of five of its nine tracks. BAD supported U2 on their 1987 world tour, then released 1988's Tighten Up Vol. 88 and 1989's Megatop Phoenix. Tighten Up, Vol. 88 contained \"Just Play Music!\", which was the second No. 1 single on Billboard's Modern Rock Tracks chart."]}, {"page": "Courtney Love", "response": ["Deciding to shift her focus to acting, Love enrolled at the San Francisco Art Institute and studied film under experimental director George Kuchar, featuring in one of his short films, Club Vatican. She also took experimental theater courses in Oakland taught by Whoopi Goldberg. In 1985, Love submitted an audition tape for the role of Nancy Spungen in the Sid Vicious biopic Sid and Nancy (1986), and was given a minor supporting role by director Alex Cox. After filming Sid and Nancy in New York City, she worked at a peep show in Times Square and squatted at the ABC No Rio social center and Pyramid Club in the East Village. The same year, Cox cast her in a leading role in his film Straight to Hell (1987), a Spaghetti Western starring Joe Strummer and Grace Jones filmed in Spain in 1986. The film caught the attention of Andy Warhol, who featured Love in an episode of Andy Warhol's Fifteen Minutes. She also had a part in the 1988 Ramones music video for \"I Wanna Be Sedated\", appearing as a bride among dozens of party guests."]}, {"page": "Dave Grohl", "response": ["Also in 2003, Grohl stepped behind the kit to perform on Killing Joke's second self-titled album. The move surprised some Nirvana fans, given that Nirvana had been accused of plagiarizing the opening riff of \"Come as You Are\" from Killing Joke's 1984 song \"Eighties\". However, the controversy failed to create a lasting rift between the bands. Foo Fighters covered Killing Joke's \"Requiem\" during the late 1990s, and were even joined by Killing Joke singer Jaz Coleman for a performance of the song at a show in New Zealand in 2003. Also in 2003, at the 45th Annual Grammy Awards, Grohl performed in an ad hoc supergroup with Bruce Springsteen, Elvis Costello, and Steven Van Zandt for a performance in tribute of then-recently deceased singer/guitarist Joe Strummer."]}, {"page": "December 22", "response": ["*  2002   – Joe Strummer, English singer-songwriter (b. 1952)"]}, {"page": "West Memphis Three", "response": ["Many songs were written about the case, and two albums released in support of the defendants. In 2000, The album Free the West Memphis 3 was released by KOCH Records. Organized by Eddie Spaghetti of the band Supersuckers, the album featured a number of original songs about the case and other recordings by artists such as Steve Earle, Tom Waits, L7, and Joe Strummer. In 2002, Henry Rollins worked with other vocalists from various rock, hip hop, punk and metal groups and members of Black Flag and the Rollins Band on the compilation album Rise Above: 24 Black Flag Songs to Benefit the West Memphis Three. All money raised from sales of the album are donated to the legal funds of the West Memphis Three. Metalcore band Zao's 2002 album Parade of Chaos included a track inspired by the case named \"Free The Three\". On April 28, 2011, the band Disturbed released a song entitled \"3\" as a download on their website. The song is about the West Memphis Three, with 100% of the proceeds going to their benefit foundation for their release."]}, {"page": "Elvis Costello", "response": ["On 23 February 2003, Costello, along with Bruce Springsteen, Steve Van Zandt, and Dave Grohl, performed a version of the Clash's \"London Calling\" at the 45th Grammy Awards ceremony, in honour of Clash frontman Joe Strummer, who had died the previous December. In March, Elvis Costello & the Attractions were inducted into the Rock and Roll Hall of Fame. He announced his engagement in May to Canadian jazz singer and pianist Diana Krall, whom he had seen in concert and then met backstage at the Sydney Opera House in Australia. That September, he released North, an album of piano-based ballads concerning the breakdown of his former marriage, and his falling in love with Krall. Also that year, Costello made an appearance in the television series Frasier as a folk singer in the Cafe Nervosa, sending Frasier and Niles on a search for a new coffee bar.\"Frasier:Farewell, Nervosa\". IMDb.\"Frasier: Farewell, Nervosa (2003)\" . MSN Movies. Retrieved 30 July 2011.", "* 1987 as \"Hives the Butler\" in the Alex Cox film, Straight to Hell, starring Joe Strummer and Courtney Love. Costello's \"Big Nothing\" (AKA \"Town Called Big Nothing\") appears in the film and on its soundtrack album."]}, {"page": "Jim Jarmusch", "response": ["Jarmusch's fascination with music is another characteristic that is readily apparent in his work. Musicians appear frequently in key roles—John Lurie, Tom Waits, Gary Farmer, Youki Kudoh, RZA and Iggy Pop have featured in multiple Jarmusch films, while Joe Strummer and Screamin' Jay Hawkins appear in Mystery Train and GZA, Jack and Meg White feature in Coffee and Cigarettes. Hawkins' song \"I Put a Spell on You\" was central to the plot of Stranger than Paradise, while Mystery Train is inspired by and named after a song popularized by Elvis Presley, who is also the subject of a vignette in Coffee and Cigarettes. In the words of critic Vincent Canby, \"Jarmusch's movies have the tempo and rhythm of blues and jazz, even in their use—or omission—of language. His films work on the senses much the way that some music does, unheard until it's too late to get it out of one's head.\""]}, {"page": "Punk rock", "response": ["British punk rejected contemporary mainstream rock, the broader culture it represented, and their music predecessors: \"No Elvis, Beatles or the Rolling Stones in 1977\", declared the Clash song \"1977\".Harris (2004), p. 202. 1976, when the punk revolution began in Britain, became a musical and a cultural \"Year Zero\".Reynolds (2005), p. 4. As nostalgia was discarded, many in the scene adopted a nihilistic attitude summed up by the Sex Pistols slogan \"No Future\"; in the later words of one observer, amid the unemployment and social unrest in 1977, \"punk's nihilistic swagger was the most thrilling thing in England.\"Jeffries, Stuart. \"A Right Royal Knees-Up\". The Guardian. July 20, 2007. While \"self-imposed alienation\" was common among \"drunk punks\" and \"gutter punks\", there was always a tension between their nihilistic outlook and the \"radical leftist utopianism\"Washburne, Christopher, and Maiken Derno. Bad Music. Routledge, 2004. Page 247. of bands such as Crass, who found positive, liberating meaning in the movement. As a Clash associate describes singer Joe Strummer's outlook, \"Punk rock is meant to be our freedom. We're meant to be able to do what we want to do.\"Kosmo Vinyl, The Last Testament: The Making of London Calling (Sony Music, 2004).", "Bernard Rhodes, an associate of McLaren, similarly aimed to make stars of the band London SS, who became the Clash, which was joined by Joe Strummer.Savage (1992), pp. 124, 171, 172. On 4 June 1976, the Sex Pistols played Manchester's Lesser Free Trade Hall in what became one of the most influential rock shows ever. Among the approximately forty audience members were the two locals who organised the gig—they had formed Buzzcocks after seeing the Sex Pistols in February. Others in the small crowd went on to form Joy Division, the Fall, and—in the 1980s—the Smiths. In July, the Ramones played two London shows that helped spark the nascent UK punk scene.Taylor (2003), p. 56; McNeil and McCain (2006), pp. 230–233; Robb (2006), pp. 198, 201. Quote: Robb (2006), p. 198. Over the next several months, many new punk rock bands formed, often directly inspired by the Sex Pistols.See, e.g., Marcus (1989), pp. 37, 67. In London, women were near the center of the scene—among the initial wave of bands were the female-fronted Siouxsie and the Banshees and X-Ray Spex and the all-female the Slits. There were female bassists Gaye Advert in the Adverts and Shanne Bradley in the Nipple Erectors, while Sex store frontwoman Jordan not only managed Adam and the Ants but also performed screaming vocals on their song \"Lou\". Other groups included Subway Sect, Alternative TV, Wire, The Stranglers, Eater and Generation X. Farther afield, Sham 69 began practicing in the southeastern town of Hersham. In Durham, there was Penetration, with lead singer Pauline Murray. On September 20–21, the 100 Club Punk Festival in London featured the Sex Pistols, Clash, Damned and Buzzcocks, as well as Paris's female-lead Stinky Toys. Siouxsie and the Banshees and Subway Sect debuted on the festival's first night. On the festival's second night, audience member Sid Vicious was arrested having thrown a glass at the Damned that shattered and destroyed a girl's eye. Press coverage of the incident reinforced punk's reputation as a social menace.Colegrave and Sullivan (2005), p. 111; Gimarc (2005), p. 39; Robb (2006), pp. 217, 224–225."]}, {"page": "South Park", "response": ["Rick James, Elton John, Meat Loaf, Joe Strummer, Ozzy Osbourne, Primus, Rancid, and Ween all guest starred and briefly performed in the season two (1998) episode \"Chef Aid\". Korn debuted their single \"Falling Away from Me\" as guest stars on the season three (1999) episode \"Korn's Groovy Pirate Ghost Mystery\"."]}, {"page": "Soweto", "response": ["Singer–songwriter Joe Strummer, formerly of The Clash, referenced Soweto in his solo album Streetcore (song: \"Arms Aloft\"), as well as in The Clash's track, \"Where You Gonna Go (Soweto)\", found on the album London Calling (Legacy Edition)."]}, {"page": "Sex Pistols", "response": ["The Pistols were soon playing other important venues, debuting at Oxford Street's 100 Club on 30 March.Robb, John, Punk Rock, p. 153. On 3 April, they played for the first time at the Nashville, supporting the 101ers. The pub rock group's lead singer, Joe Strummer, saw the Pistols for the first time that night—and recognised punk rock as the future.Robb, John, Punk Rock, p. 155. A return gig at the Nashville on 23 April demonstrated the band's growing musical competence, but by all accounts lacked a spark. Westwood provided that by instigating a fight with another audience member; McLaren and Rotten were soon involved in the melee.Savage, Jon, England's Dreaming, pp. 166–167. See also Matlock, Glen, I Was a Teenage Sex Pistol, p. 107. Cook later said, \"That fight at the Nashville: that's when all the publicity got hold of it and the violence started creeping in.... I think everybody was ready to go and we were the catalyst.\"Savage, Jon, England's Dreaming, p. 168. The Pistols were soon banned from both the Nashville and the Marquee.Savage, Jon, England's Dreaming, p. 172."]}, {"page": "The Clash", "response": ["The Clash were an English rock band formed in London in 1976 who were key players in the original wave of British punk rock. Billed as \"The Only Band That Matters\", they also contributed to the  and new wave movements that emerged in the wake of punk and employed elements of a variety of genres including reggae, dub, funk, ska, and rockabilly. For most of their recording career, the Clash consisted of lead vocalist and rhythm guitarist Joe Strummer, lead guitarist and vocalist Mick Jones, bassist Paul Simonon, and drummer Nicky \"Topper\" Headon. Headon left the group in 1982 due to internal friction surrounding his increasing heroin addiction and it was more internal friction which led to Jones' departure the following year. The group continued with new members, but finally disbanded in early 1986.", "In January 2003, shortly after the death of Joe Strummer, the band—including original drummer Terry Chimes—were inducted into the Rock and Roll Hall of Fame. In 2004, Rolling Stone ranked the Clash number 28 on its list of the \"100 Greatest Artists of All Time\".", "John Graham Mellor sang and played rhythm guitar in the pub rock act The 101ers, which formed in 1974. By the time the Clash came together two years later, he had already abandoned his original stage name, \"Woody\" Mellor, in favour of \"Joe Strummer\", a reference to his rudimentary strumming skills on the ukulele as a busker in the London Underground.", "The Clash were putting forward a radical left-wing message in their songs and interviews. They sang about social problems, such as career opportunities and unemployment, and the need for people to fight back against racism and oppression. \"We’re anti-fascist, we’re anti-violence, we’re anti-racist and we’re pro-creative.\" (Joe Strummer, 1976) However, “I don’t believe in all that anarchy bollocks!” (Joe Strummer, 1976) \"The important thing is to encourage people to do things for themselves, think for themselves and stand up for what their rights are.\" (Mick Jones, 1976)", "The confrontation between Black youth and the Police at the Notting Hill Carnival in 1976, was important in the development of The Clash’s political stance. It directly inspired Joe Strummer to write \"White Riot\". Images of the Notting Hill Carnival riots would appear as The Clash’s stage backdrop, the back cover of their first album and be reprinted on badges and The Clash t-shirts.", "In 1999, Strummer, Jones and Simonon cooperated in compiling of the live album From Here to Eternity and video documentary Westway to the World. On 7 November 2002, the Rock and Roll Hall of Fame announced that the Clash would be inducted the following March. On 15 November, Jones and Strummer shared the stage, performing three Clash songs during a London benefit show by Joe Strummer and the Mescaleros. Strummer, Jones and Headon wanted to play a reunion show to coincide with their induction into the Hall of Fame. Simonon did not want to participate because he believed that playing at the high-priced event would not have been in the spirit of the Clash. Strummer's sudden death from a congenital heart defect on 22 December 2002 ended any possibility of a full reunion. In March 2003, the Hall of Fame induction took place; the band members inducted were Strummer, Jones, Simonon, Chimes and Headon.", "thumb|right|220px|Graffiti in Rijeka, Croatia commemorating Joe Strummer.", "In later years, the Clash's influence can be heard in American political punk bands such as Rancid, Anti-Flag, Bad Religion, NOFX, Green Day, and Rise Against as well as in the political hard rock of early Manic Street Preachers. California's Rancid, in particular, are known as \"incurable Clash zealots\". The title track of the band's album Indestructible proclaims, \"I'll keep listening to that great Joe Strummer!\" Outside of rock music, Chuck D has credited the Clash as an inspiration for Public Enemy, in particular for the way their use of socially and politically conscious lyrics gained attention from the music press: \"They talked about important subjects, so therefore journalists printed what they said, which was very pointed... We took that from the Clash, because we were very similar in that regard. Public Enemy just did it 10 years later\". In 2019 Chuck D narrated Stay Free: The Story of The Clash, an eight-part podcast series produced by Spotify and BBC Studios.", "In June 2009 Bruce Springsteen & the E Street Band opened their concert in Hyde Park, London, with 'London Calling'. The concert was later released on DVD as Bruce Springsteen and the E Street Band: London Calling – Live in Hyde Park. Bruce Springsteen, Little Steven, Dave Grohl and Elvis Costello performed the same song at the Grammys in 2003 as a tribute to Joe Strummer who died the year before. In 2009 Springsteen & the E Street Band even covered Strummer's \"Coma Girl\" while in 2014 and along with Tom Morello, they opened some of their shows on the High Hopes Tour with \"Clampdown\".", "London Town, a film which tells the story of a Clash-obsessed teenager who crosses paths with Joe Strummer by happenstance in 1979 and finds his life changing as a result, was released in 2016. The film received mixed reviews and featured timeline inaccuracies along with wrong song lyrics performed by the actors in the film.", "* Joe Strummer – lead and backing vocals, rhythm guitar (1976–1986; died 2002)"]}, {"page": "The Pogues", "response": ["The Pogues were an English  or Anglo-Irish Celtic punk band fronted by Shane MacGowan and others, founded in Kings Cross, London in 1982, as \"Pogue Mahone\" – the anglicisation of the Irish Gaelic póg mo thóin, meaning \"kiss my arse\". The band reached international prominence in the 1980s and early 1990s, recording several hit albums and singles. MacGowan left the band in 1991 owing to drinking problems, but the band continued – first with Joe Strummer and then with Spider Stacy on vocals – before breaking up in 1996. The Pogues re-formed in late 2001, and played regularly across the UK and Ireland and on the US East Coast, until dissolving again in 2014. The group did not record any new material during this second incarnation.", "The band was at the peak of its commercial success, with both albums making the top 5 in the UK (numbers 3 and 5 respectively), but MacGowan was increasingly unreliable. He failed to turn up for the opening dates of their 1988 tour of America, and prevented the band from promoting their 1990 album Hell's Ditch, so in 1991 the band sacked him. Vocal duties were for a time handled by Joe Strummer. Spider Stacy took over permanently after Strummer left in the winter of 1991. After Strummer's departure, the remaining seven Pogues recorded in 1993 Waiting for Herb, which contained the band's third and final top twenty single, \"Tuesday Morning\", which became their best-selling single internationally. Terry Woods and James Fearnley then left the band and were replaced by David Coulter and James McNally respectively. Within months of their departures, ill health forced Phil Chevron to leave the band; he was replaced by his former guitar technician, Jamie Clarke. This line-up recorded the band's seventh and final studio album, Pogue Mahone. The album was a commercial failure, and, following Jem Finer's decision to leave the band in 1996, the remaining members decided it was time to call it quits. According to Shane MacGowan, among the reasons of the break-up was disagreement concerning the political orientation of his songs, the band not wanting to sing too obvious pro-Republican songsInterview  from The Irish World, 21 November 1997, Tonya Henderson. – though some of their previous songs were already politically engaged: for instance, Streams of Whiskey is about the poet and IRA member Brendan Behan. Soon after the break-up Shane MacGowan recorded a song titled Paddy Public Enemy Number One as a tribute to the Republican leader Dominic McGlinchey, a former leader of the INLA killed a few years before.", "In March 2013, the Pogues released 30:30: The Essential Collection, a 2-disc set featuring 30 songs along with eleven videos. In October 2013, the Pogues released a box set titled Pogues 30 containing remastered versions of all of their studio albums plus a previously unreleased live album featuring Joe Strummer at the London Forum in December 1991.", "* Joe Strummer – vocals, guitar (1991–1992; also replaced an ailing Phil Chevron for a US tour in 1987; died 2002)", "  bar:strummer text:\"Joe Strummer\""]}, {"page": "Tom Waits", "response": ["A number of events have been held for fans of Waits's work, such as \"Waiting for Waits\" in Mallorca and the \"Straydogs Party\" in Denmark. Various cabaret shows have been held devoted to Waits's songs, including Robert Berdahl's Warm Beer, Cold Women and Stewart D'Arrietta's Belly of a Drunken Piano. When the actor Robert Carlyle formed a theatre, he named it the Rain Dog Theatre after Waits' album. Among the celebrities who have described themselves as Waits fans are Johnny Depp, John Oliver, Jordan Peterson, Jerry Hall, Megan Mullally, and Nick Offerman. In Britain, prominent figures who have described themselves as Waits fans include the historian Simon Schama, the writer Raymond Briggs, the presenter Graham Norton, and the actor Colin Firth. Musicians who noted their admiration for Waits' work included Elvis Costello, Bruce Springsteen, Nanci Griffith, Joe Strummer from the punk rock band The Clash, Michael Stipe of R.E.M., Frank Black of Pixies, and James Hetfield from the heavy metal band Metallica. Bob Dylan, who was a major influence on the young Waits, stated that Waits was one of his \"secret heroes\"."]}, {"page": "The Damned (band)", "response": ["Machine Gun Etiquette featured a strong 1960s garage rock influence, with Farfisa organ in several songs. Recording at Wessex Studios at the same time as The Clash were there to record London Calling, Joe Strummer and Mick Jones made an uncredited vocal appearance on the title track. Fans and critics were pleasantly surprised, and Machine Gun Etiquette received largely positive reviews; Ira Robbins and Jay Pattyn described it as \"a great record by a band many had already counted out\"."]}, {"page": "The Slits", "response": ["The group supported the Clash on their 1977 White Riot tour along with Buzzcocks, the Prefects and Subway Sect. Club performances of the Slits during this period are included in The Punk Rock Movie (1978). In November 1978, the Slits toured with the Clash again on the \"Sort it Out Tour\" and were joined by the Innocents who opened the shows.  Joe Strummer said the group would be \"great\" with intense gigging."]}, {"page": "Woody Guthrie", "response": ["Guthrie wrote hundreds of country, folk, and children's songs, along with ballads and improvised works. Dust Bowl Ballads, Guthrie's album of songs about the Dust Bowl period, was included on Mojo magazine's list of 100 Records That Changed The World, and many of his recorded songs are archived in the Library of Congress.Library of Congress. Related Material – Woody Guthrie Sound Recordings at the American Folklife Center. Retrieved on November 27, 2007. Songwriters who have acknowledged Guthrie as a major influence on their work include Bob Dylan, Phil Ochs, Johnny Cash, Bruce Springsteen, Robert Hunter, Harry Chapin, John Mellencamp, Pete Seeger, Andy Irvine, Joe Strummer, Billy Bragg, Jerry Garcia, Bob Weir, Jeff Tweedy, Tom Paxton, Brian Fallon, and Sixto Rodríguez . He frequently performed with the message \"This machine kills fascists\" displayed on his guitar."]}, {"page": "1952", "response": ["** Joe Strummer, British rock musician (The Clash) (d. 2002)"]}, {"page": "2002", "response": ["** Joe Strummer, English musician (The Clash) (b. 1952)"]}, {"page": "Genesis (band)", "response": ["Genesis were targets for criticism throughout the 1970s from those who disliked progressive rock. Influential BBC DJ John Peel championed the band in their early years and they performed three sessions for him between 1970 and 1972, but he \"grew disillusioned with their later excesses\". Some regarded the group as overtly middle-class, paying particular attention to the founder members' private education, and claimed rock music was being taken away from the working class, whom they regarded as its core audience. Likening his background to that of the punk artist Joe Strummer, who had become a \"people's hero\" musician, Gabriel stated in 2013, \"To this day, we've never outgrown the snotty rich-kid thing ... we were always very straight about where we came from, and we were middle-class, not aristocratic.\" Gabriel's theatrics were unpalatable to some of the mainstream rock audience, resulting in a cult following rather than that of a mainstream rock band."]}, {"page": "Alex Cox", "response": ["Continuing his fascination with punk music, Cox's next film was an independent feature shot in London and Los Angeles, following the career and death of bassist Sid Vicious and his girlfriend Nancy Spungen, initially titled Love Kills and later renamed Sid and Nancy. It was met warmly by critics and fans, though heavily criticised by some, including Pistols' frontman John Lydon, for its inaccuracies. The production of this film also sparked a relationship with Joe Strummer of the Clash, who would continue to collaborate with the director on his next two films."]}, {"page": "Bruce Springsteen", "response": ["At the Grammy Awards of 2003, Springsteen performed the Clash's \"London Calling\" along with Elvis Costello, Dave Grohl, and E Street Band member Steven Van Zandt and No Doubt's bassist, Tony Kanal, in tribute to Joe Strummer. In 2004, Springsteen and the E Street Band participated in the Vote for Change tour, along with John Mellencamp, John Fogerty, the Dixie Chicks, Pearl Jam, R.E.M., Bright Eyes, the Dave Matthews Band, Jackson Browne, and other musicians."]}, {"page": "Glastonbury Festival", "response": ["|The Beautiful South, Coldplay, Muse, Hole, Ash, Blondie, Underworld, Fun Lovin' Criminals, Texas, Lenny Kravitz, Bush, The Corrs, Al Green, Joe Strummer, Barenaked Ladies, Eliza Carthy, Bjorn Again, Ian Dury and The Blockheads, Beth Orton, Billy Bragg, Elliott Smith, Travis, Queens of the Stone Age, Lonnie Donegan, Suzanne Vega, Marianne Faithfull, Fatboy Slim", "Various artists have written songs entitled Glastonbury or about the festival including Nizlopi, The Waterboys and Scouting for Girls. Cosmic Rough Riders included \"Glastonbury Revisited\" on their album Enjoy The Melodic Sunshine (Poptones) in 2000. Amy Macdonald, in her song \"Let's Start a Band\" referenced Glastonbury: \"Give me a festival and I'll be your Glastonbury star.\" Robbie Williams, in his song \"The 90s\", refers to his surprise appearance on stage with Oasis in 1995, which ultimately led to him leaving Take That. Joe Strummer wrote the song \"Coma Girl\" about his experiences at Glastonbury,  — in a BBC interview Bruce Springsteen cited the song as inspiring him to play the 2009 festival."]}, {"page": "Cricklewood", "response": ["* Mentioned in the song \"Willesden to Cricklewood\" written in 1999 by Joe Strummer (of the Clash) & the Mescaleros, featured on the album \"Rock Art and the X-ray Style\" and was played at Strummer's funeral in 2002."]}, {"page": "Notting Hill", "response": ["It attracted press attention in 1976 for clashes with the police, which occurred in 1976 at the conclusion of the Notting Hill Carnival after police arrested a pickpocket and a group of black youths came to his defence. The disturbance escalated and more than 100 police officers were injured. Two notable participants in this riot were Joe Strummer and Paul Simonon, who later formed the seminal London punk band The Clash. Their song \"White Riot\" was inspired by their participation in this event. Further incidents continued for a few years, but receded for several decades, until 2008 when approximately 500 youths clashed with police on the Monday."]}, {"page": "Palmers Green", "response": ["* Joe Strummer shared a flat at 18 Ash Grove in 1971 with Tymon Dogg."]}, {"page": "Willesden", "response": ["*Joe Strummer and the Mescaleros sang from \"Willesden to Cricklewood\" on their album Rock Art and the X-ray Style."]}, {"page": "List of Rock and Roll Hall of Fame inductees", "response": ["| Terry Chimes, Topper Headon, Mick Jones, Paul Simonon, and Joe Strummer."]}, {"page": "Pub rock (United Kingdom)", "response": ["In 1974, pub rock was the hottest scene in London.Savage (1991), p. 80. At that point it seemed that nearly every large pub in London was supplying live music, along with hot snacks and the occasional stripper. The figureheads were Essex-based R&B outfit Dr. Feelgood.Savage (1991), p. 587. By Autumn 1975, they were joined by acts such as The Stranglers, Roogalator, Eddie and the Hot Rods, Kilburn and the High Roads, and Joe Strummer's 101ers.Savage (1991), p. 107 & 124.", "Pub rock was rapidly overtaken by the UK punk explosion after spawning what are now seen as several proto-punk bands. Some artists were able to make the transition by jumping ship to new outfits, notably Joe Strummer, Ian Dury and Elvis Costello. A few stalwarts were later able to realise Top 40 chart success, but the moment was gone. Many of the actual pubs themselves survived as punk venues (especially the Nashville and The Hope & Anchor), but a range of notable pubs such as the George Robey and the Pied Bull have since been closed or demolished. The Newlands Tavern survived and is now called The Ivy House."]}, {"page": "Billy Bragg", "response": ["At the NME Awards in 2007, on the fifth anniversary of Joe Strummer's death, Bragg founded Jail Guitar Doors (taking its name from a song by the Clash), an organisation aimed at supplying instruments to prisons and encouraging prisoners to address problems in a non-confrontational way. An American chapter of the organisation was launched in 2009 by MC5's Wayne Kramer."]}, {"page": "Sid Vicious", "response": ["Various bands over the years have recorded songs about Sid Vicious. In 1982, the Exploited included the song \"Sid Vicious Was Innocent\" on their album Troops of Tomorrow. Former frontman for the Clash, Joe Strummer, recorded \"Love Kills\" and \"Dum Dum Club\" for the Sid and Nancy soundtrack. In 1986, the Ramones released \"Love Kills\" on their album Animal Boy, which was a tribute to both Sid and Nancy. In 2017, Foster the People released \"Loyal Like Sid & Nancy\", which references Vicious and Spungen's relationship, as the second single from their album Sacred Hearts Club. Medusa released a music video to their song \"Sid and Nancy\" in 2015 that shows two children resembling Vicious and Spungen."]}, {"page": "1982 in music", "response": ["**Joe Strummer vanishes, forcing The Clash to postpone their U.K. tour.", "*May 18 – Three weeks after disappearing, Joe Strummer and his girlfriend are found living in Paris, two days after they ran the Paris Marathon."]}, {"page": "1983 in music", "response": ["*September 1 – Joe Strummer and Paul Simonon of The Clash issue a press statement announcing Mick Jones has been fired from the group."]}, {"page": "2001 in music", "response": ["| Global a Go-Go || Joe Strummer & The Mescaleros ||-"]}, {"page": "2002 in music", "response": ["* December 22 – Joe Strummer lead singer, guitarist and founder of Punk Rock band The Clash dies of a congenital heart defect at the age of 50.", "* December 22 – Joe Strummer (50), singer and guitarist of The Clash"]}, {"page": "1952 in music", "response": ["*August 21 – Joe Strummer, singer and songwriter (The Clash) (d. 2002)"]}]}}