{"wiki_id": "http://www.wikidata.org/entity/Q310055", "itemLabel": "David Bentley", "itemDescription": "English association football player (born 1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Bentley", "wikipedia_page": {"main": "David Michael Bentley (born 27 August 1984) is an English former professional footballer who played primarily as a winger, but also played as a central midfielder or as a second striker.\nBentley started his career with Arsenal in the Premier League, and despite being earmarked as one for the future, saw his playing opportunities limited by a strong senior squad. He spent two seasons on loan with Norwich City and Blackburn Rovers, and sealed a permanent transfer to Rovers in January 2006. Bentley produced strong performances for his new club, and soon featured regularly for the England under-21 team. He made his senior international debut against Israel in September 2007. In July 2008, Bentley joined Tottenham Hotspur. He spent time on loan with Birmingham City, West Ham United, FC Rostov and a brief return to Blackburn before being released by Tottenham in 2013. After not playing for more than a year, Bentley retired from football in 2014, citing his loss of passion for the sport.", "link_mentions": [{"page": "August 27", "response": ["*1984 – David Bentley, English footballer"]}, {"page": "David Beckham", "response": ["On 11 May 2008, Capello included an in-form Beckham in his 31-man England squad to face the United States at Wembley Stadium on 28 May before the away fixture with Trinidad and Tobago on 1 June. Beckham – who wore a pair of golden boots to mark the occasion – was honoured before the match by receiving an honorary gold cap representing his 100th cap from Bobby Charlton, and was given a standing ovation from the crowd. He played well and assisted John Terry on the match-winning goal. When substituted at half-time for David Bentley, the pro-Beckham crowd booed the decision. In a surprise move, Capello handed Beckham the captaincy for England's friendly against Trinidad and Tobago on 1 June 2008. The match was the first time since the 2006 World Cup that Beckham had skippered England and marked a dramatic turnaround for Beckham. In two years, he had gone from being dropped completely from the England squad to being reinstated (though temporarily) as England captain."]}, {"page": "Peterborough", "response": ["In the sporting world, former Tottenham Hotspur and England footballer, David Bentley, was born in the city,Profile for David Bentley  ESPNsoccernet (Retrieved 27 May 2007). as was Louis Smith, who at the 2008 games became Great Britain's first gymnast to win an individual Olympic medal in a century.\"Smith wins historic bronze for GB\" , BBC News Online, 17 August 2008. Chelsea Football player, currently on loan at Luton Town footballer Isaiah Brown, was born in Peterborough, before joining Leicester City and later West Bromwich Albion, becoming the second youngest player to play in the Premier League."]}, {"page": "Blackburn Rovers F.C.", "response": ["|2006–07|| David Bentley"]}, {"page": "Cheshunt", "response": ["* David Bentley, footballer with Arsenal and later Tottenham Hotspur, attended Goffs School."]}, {"page": "Mark Hughes", "response": ["Hughes then set about creating a formidable side at Ewood Park. He entered the transfer market, bringing in players such as Benni McCarthy (£2 million), David Bentley (£500,000), Ryan Nelsen (free), Stephen Warnock (£1.5 million), Roque Santa Cruz (£3.5 million), and Christopher Samba (£400,000). Rovers finished tenth in the Premier League in 2006–07, and reached the UEFA Cup round of 32, where they were knocked out by Bayer Leverkusen 3–2 on aggregate. Rovers faced Chelsea in the FA Cup semi-final, their third consecutive semi-final since Hughes took charge. The match ended in defeat, 2–1. He won the Premier League Manager of the Month award for October 2007, and eventually led Blackburn to a league finish of seventh in 2007–08, Hughes's final season in charge at Ewood Park."]}, {"page": "Sebastian Larsson", "response": ["Larsson played his part in Birmingham's run to the 2011 League Cup Final. He scored from the penalty spot before Nikola Žigić headed an 84th-minute winner in the quarter-final against local rivals Aston Villa. In the first leg of the semi-final against West Ham United, Liam Ridgewell scored from Larsson's corner before Victor Obinna was sent off for kicking Larsson in the groin in an off-the-ball incident. Despite speculation over his future at Birmingham – with his contract due to expire at the end of the season, his advisor was given permission to talk to Newcastle United about a proposed move during the January transfer window, but personal terms were not agreed, and the player was booed when he came on as a substitute in the previous game, against Manchester United – Larsson returned to the starting eleven in place of the cup-tied David Bentley and played 100 minutes as Birmingham overturned a 2–1 deficit to win the semi-final 4–3 on aggregate. Roger Johnson flicked on Larsson's corner for Žigić to give his team an unexpected lead in the final at Wembley against firm favourites Arsenal. Though Robin van Persie equalised, Obafemi Martins scored an 89th-minute winner to give Birmingham their first trophy since 1963."]}, {"page": "Arturo Lupoli", "response": ["Following the finalisation of his loan move to the Canaries, Arturo told the club's official website \"I am very happy to be here and hope to contribute for a great season for Norwich City and to be successful. I spoke to the Manager and I really feel that he wants me here. I know a lot about Norwich City – I was with Arsenal when they and my teammate David Bentley were in the Premier League and have followed their progress.\""]}, {"page": "Sam Allardyce", "response": ["Allardyce was appointed as manager of then-recently relegated West Ham United on 1 June 2011, signing a two-year contract. He vowed to play \"attractive football\" in getting West Ham back to the Premier League, according to the \"traditions of the club,\" and rejected the claims that he played dull, long-ball football at previous clubs. He signed Abdoulaye Faye, Kevin Nolan, Joey O'Brien and Matt Taylor. Faye, Nolan and O'Brien had all played under Allardyce at his former club Bolton Wanderers while Taylor was a Bolton player who had joined after Allardyce left the club. He made striker John Carew West Ham's fifth signing of the season, on a free transfer, followed by defender George McCartney from Sunderland on a season-long loan, strikers Sam Baldock from Milton Keynes Dons and midfielder Papa Bouba Diop on a free transfer. He concluded his summer transfer window signings on deadline day by bringing in midfielders David Bentley from Tottenham Hotspur and Henri Lansbury from Arsenal, both on season-long loans, as well as utility man Guy Demel from Hamburg for an undisclosed fee. Nicky Maynard, Ricardo Vaz Tê and Ravel Morrison followed in the 2011 winter transfer window. Over the course of the 2011–12 season a total of 25 players left the club while 19 were signed. In March 2012, despite standing in third place in the Championship, Allardyce's style of football was again questioned. Fans called for more passing of the ball and football played on the pitch and not in the air. On 19 May 2012, West Ham were promoted back to the Premier League after only one season in the Championship after beating Blackpool 2–1 in the play-off Final. Allardyce described this promotion as his best ever achievement."]}, {"page": "Cuffley", "response": ["Its most notable current resident is Sir Terry Leahy, former CEO of Tesco, although this did not prevent locals from objecting vehemently to plans to build a  \"Express\" store in the village replacing one of only two remaining village pubs.Daily Telegraph on-line 23 July 2007 Other famous residents include Premier League footballers Ledley King, Jermain Defoe, Niko Kranjcar, David Bentley, Kyle Walker and Armand Traoré; and also former Sugababes singer Keisha Buchanan and Myleene Klass."]}, {"page": "Ben Foster (footballer)", "response": ["Foster was originally selected in Manchester United's squad for the 2008 FIFA Club World Cup, but after suffering a broken finger in training the day before the squad was due to depart for Japan, he was replaced by Ben Amos. On 1 March 2009, Alex Ferguson named Foster in goal for the 2009 League Cup Final at Wembley Stadium. After keeping a clean sheet in normal time, Foster then made a save from Tottenham's Jamie O'Hara in the consequent penalty shoot-out. This, combined with a miss from David Bentley, gave United a 4–1 win in the shootout and the 2009 League Cup title. After the match, Foster was given the Alan Hardaker Trophy for his man of the match performance."]}, {"page": "Aaron Lennon", "response": ["His goals early in the 2009–10 season – against West Ham United at the Boleyn Ground, and Birmingham City – kept Tottenham at the top of the league table with four successive wins, their best start to a league season since the 1960–61 season. On 24 October 2009, Lennon was injured in a match against Stoke City. Tottenham were consequently reduced to ten men as manager Harry Redknapp had used all three available substitutes and they would go on to lose the match 1–0. He returned on 22 November in a 9–1 victory against Wigan Athletic and provided three assists and scored one goal. He was substituted in the 79th minute for David Bentley, receiving a standing ovation from the fans at White Hart Lane."]}, {"page": "North London derby", "response": ["|align=left|David Bentley||MF"]}, {"page": "Damien Comolli", "response": ["Comolli spent three years in the job but with Tottenham performing poorly in 2008–09 and some of Comolli's signings coming in for criticism, he was dismissed in October 2008, shortly after the dismissals of manager Juande Ramos, assistant Gus Poyet and first team coach Marcos Álvarez, as the director of football position was abolished at the insistence of incoming manager Harry Redknapp. During his time at Tottenham, Comolli was responsible for Tottenham's policy of signing young talents. Comolli was also responsible for the signings of former Tottenham first-team squad members Luka Modrić, Benoît Assou-Ekotto, Heurelho Gomes, David Bentley, Vedran Ćorluka and Roman Pavlyuchenko, as well as Dimitar Berbatov."]}, {"page": "February 2006 in sports", "response": ["*Football (soccer): England Under-21s defeat Norway Under-21 3–1 at the Madejski Stadium. Anton Ferdinand had struck the post for England before Peter Whittingham's low free-kick put them ahead on 24 minutes. Borre Steenslid levelled on 52 minutes with a neat header, David Bentley quickly restored the lead with a cool finish. And he soon added another, controlling a mis-hit volley from Tom Huddlestone and firing into the corner of the net."]}, {"page": "2006 FA Cup Final", "response": ["West Ham entered the competition in the third round, where they were drawn against Championship team Norwich City. Before the game Norwich's top scorer, Dean Ashton, was withdrawn from their squad amid speculation that he was about to be sold. Although the sale was denied by manager Nigel Worthington, Ashton joined West Ham soon after for £7.2 million. The match played at Norwich's home ground, Carrow Road, saw West Ham take the lead in the sixth minute through midfielder Hayden Mullins, and double it in the second half from striker Bobby Zamora. Norwich found a consolation with a Paul McVeigh penalty, but they lost 2–1 and West Ham progressed to the fourth round. Fellow Premier League team Blackburn Rovers were the opposition in the fourth round. West Ham went a goal down in the first minute when David Bentley scored, but they subsequently scored four goals from Teddy Sheringham, Matthew Etherington, Bobby Zamora and an own goal from Zurab Khizanishvili to win the match 4–2 and go through to the fifth round."]}, {"page": "Goffs Academy", "response": ["*David Bentley, professional footballer"]}, {"page": "History of West Ham United F.C.", "response": ["Following the dismissal of Grant, on 1 June 2011, West Ham appointed Sam Allardyce as their manager. He quickly reinforced his new side by signing Abdoulaye Faye, Kevin Nolan, Joey O'Brien and Matt Taylor. Faye, Nolan and O'Brien had all played under Allardyce at his former club Bolton, whilst Taylor was a Bolton player just after Allardyce had left the club. Allardyce's first game in charge, on 7 August 2011, was a loss by a late goal to Cardiff City. He then made striker John Carew West Ham's fifth signing of the season, on a free transfer, followed by defender George McCartney from Sunderland on a season-long loan, strikers Sam Baldock from Milton Keynes Dons and midfielder Papa Bouba Diop on a free transfer. He concluded his summer business with late scoops on deadline day for midfielders David Bentley from Tottenham and Henri Lansbury from Arsenal, both on season-long loans, and utility man Guy Demel from Hamburger SV for an undisclosed fee, making him Allardyce's 12th purchase of the 2011 summer transfer window. Nicky Maynard, Ricardo Vaz Tê and Ravel Morrison followed in the 2011 winter transfer window. In March 2012, despite standing in third place in the league, Allardyce's style of football was questioned, as it likewise was at his previous club Newcastle. Fans called for more passing of the ball and football played on the pitch, not in the air. They achieved a club record 13 away wins and finished third in the Championship behind Reading and Southampton, thus entering the play-offs."]}]}}