{"wiki_id": "http://www.wikidata.org/entity/Q3101687", "itemLabel": "George K. Arthur", "itemDescription": "actor", "wikipedia_url": "https://en.wikipedia.org/wiki/George_K._Arthur", "wikipedia_page": {"main": "George K. Arthur (27 January 1899 – 30 May 1985) was an English actor and producer. He appeared in 59 films between 1919 and 1935. After retiring as an actor, he became a producer and distributor of short films. He won an Academy Award for Best Short Film in 1956 for the film The Bespoke Overcoat.He was born in Littlehampton, Sussex and died in New York City. Some of his early success was in the late 1920s when partnered with Karl Dane as part of a comedic duo called 'Dane & Arthur'.", "link_mentions": [{"page": "The Hollywood Revue of 1929", "response": ["Unlike M-G-M's imposing feature films, which always boasted strong story values, The Hollywood Revue of 1929 was a plotless parade of variety acts. Conrad Nagel, interviewed for the book The Real Tinsel, recalled, \"Everybody thought Harry Rapf was crazy for making it.\" Billed as an \"All-Star Musical Extravaganza\", the film includes performances by once and future stars, including Joan Crawford singing and dancing on stage. (She later remarked, \"Revue was one of those let's-throw-everyone-on-the-lot-into-a musical things, but I did a good song-and-dance number.\"). Other segments feature Gus Edwards, John Gilbert, Norma Shearer, Lionel Barrymore, Buster Keaton, Marie Dressler, Bessie Love, Marion Davies, Anita Page, and the comedy team of Karl Dane and George K. Arthur.", "* \"Your Mother and Mine\" played by Jack Benny on his violin with interjections from Karl Dane and George K. Arthur"]}, {"page": "Academy Award for Best Live Action Short Film", "response": ["| George K. Arthur"]}, {"page": "Harry Hay", "response": ["Relocating to Los Angeles, Hay moved back in with his parents. He associated with artistic and theatrical circles, befriending composer John Cage and his lover Don Sample, with the former getting Hay to perform vocals at one of his concerts in November 1932.  Becoming a professional voice actor, he obtained a minor role in a radio adaptation of Charles Dickens' A Tale of Two Cities performed by George K. Arthur's International Group Players for the Hollywood Playhouse. They were impressed with his talent, and gave him a job as a permanent understudy. He supplemented this income as a screen extra, usually as a stunt rider in B movies, and also worked as a freelance dialogue coach for expat aristocrats in Hollywood.Hay/Roscoe, p. 356 Through a friendship with George Oppenheimer he was able to get work screen-writing as a ghost-writer. Immersing himself in the Hollywood gay scene, he claimed to have had brief flings with Willy Wakewell, Philip Ahn, Hans Heinrich von Twardowski, and Richard Cromwell. Having met the Thelemite high priestess Regina Kahl on a play that they were both working on, he agreed to play the organ for the public performances of the Gnostic Mass given by the Agape Lodge, the Hollywood branch of the Ordo Templi Orientis."]}, {"page": "George Arthur (disambiguation)", "response": ["* George K. Arthur (1899–1985), Scottish-American film producer and actor"]}, {"page": "Josef von Sternberg", "response": ["The 30-year-old Sternberg made his debut as a director with The Salvation Hunters, an independent picture produced with actor George K. Arthur.Silver, 2010: \"... in essence an independent film ...\"Baxter, 1971. p. 26-27 "]}, {"page": "Sam Wood", "response": ["Wood's first two assignments for M-G-M, Rookies, with Karl Dane and George K. Arthur, and The Fair Co-Ed with Marion Davies were comedies, both made in 1927, earning him a long-term contract with the studio for whom he would almost exclusively make films for over ten years.Thomas, 1974 p.135"]}, {"page": "Karl Dane", "response": ["After signing with MGM in 1926, he appeared in supporting roles in several popular silent films before teaming up with George K. Arthur to form the successful comedy duo Dane & Arthur. They appeared in a number of silent, short comedy films and toured the vaudeville circuit. At the peak of his career, Dane earned $1500 a week. As the film industry transitioned from silent to sound films in the late 1920s, Dane's thick Danish accent became problematic. By 1930, Dane was relegated to less prominent roles, often with little to no dialogue. Later that year, MGM terminated his contract.  Dane attempted to pursue work in other fields but found no success. Broke and despondent, he died of a self-inflicted gunshot wound in April 1934.", "Soon after signing his MGM contract, Dane began work on the Vidor film, Bardelys the Magnificent. It was on this film that MGM executive Harry Rapf decided to team Dane with English actor George K. Arthur as a comedic duo. Together they were dubbed Dane & Arthur. In May 1927, the duo's first film, Rookies, opened and was an instant success. In June 1927, MGM signed Dane to a long-term contract, making such films as Detectives, Circus Rookies, and The Trail of '98.  In April 1928, Dane broke his shoulder on set.  He developed a serious case of bronchial pneumonia but eventually recovered and went back to work on the duo's films. At the peak of his success and popularity, Dane earned $1500 a week.", "Dane & Arthur's last silent short was Detectives in 1928. On 23 December 1928 their first talkie, Brotherly Love was released. By this time, sound films were rising in popularity and MGM was worried that actors with thick foreign accents would not be ideal for sound films. In his memoirs, George K. Arthur claimed that after MGM tested the duo for sound films, they felt his British accent was \"more desirable\" and thought Dane's thick Danish accent made his English difficult for audiences to understand. As a result, MGM began offering Dane fewer roles.Petersen Balogh 2009 p.149 Dane & Arthur made only six more talkies, ending with China Bound in 1929.", "In 1933, Dane began working as a waiter in a \"tiny cafe\" in Westwood, Los Angeles. According to Dane's biographer, Laura Petersen Balough, oft told accounts that Dane \"bought stake in a hot dog stand outside the gates of MGM Studios\" which was supposedly shunned by his former co-workers are likely false. The \"hot dog stand\" or \"hot dog cart\" that is often referred to was actually similar to a luncheonette, a small, permanent structure that had a counter and seating for patrons. Dane eventually bought a stake in the cafe after the owner thought that having a former film star as a co-owner would drum up business.Petersen Balogh 2009 pp.163-164 Dane's former comedy partner, George K. Arthur, mentioned Dane's final venture in his memoir:"]}, {"page": "Show People", "response": ["* George K. Arthur– at banquet"]}, {"page": "The Salvation Hunters", "response": ["The Salvation Hunters is a 1925 American silent drama film which marked the directorial debut of the 31-year old Josef von Sternberg. The feature stars Georgia Hale and George K. Arthur, and would bring Sternberg, \"a new talent\", to the attention of the major movie studios, including Metro-Goldwyn-Mayer and Paramount Pictures. Film Mercury included The Salvation Hunters in its ten-best list for the films of 1925.Sarris, 1966, p. 10Baxter, 1971. p. 32Weinberg, 1967. p. 22: \"It made several of the 'Ten Best' lists of 1925.\"", "English actor and producer George K. Arthur approached Sternberg to film a comedy entitled “Just Plain Buggs\". Sternberg had recently served as assistant-director and writer on Roy William Neill’s film By Devine Right (1924) and accepted the offer, with the caveat that they substitute his own screenplay, The Salvation Hunters, to which Arthur agreed."]}, {"page": "The Student Prince in Old Heidelberg", "response": ["*George K. Arthur as Drunk Student (uncredited)"]}, {"page": "The Co-Optimists", "response": ["George K. Arthur, Davy Burnaby, Betty Chester, Charles Childerstone, Gilbert Childs, Laddie Cliff, Mimi Crawford, Melville Gideon, Stanley Holloway, Mary Leigh, Elsa MacFarlane, Austin Melford, Phyllis Monkman, Herbert Mundin, Elsie Randolph, Cyril Ritchard, Babs Valerie, Clifford Witley."]}, {"page": "1985 in the United Kingdom", "response": ["* 30 May – George K. Arthur, actor and producer (born 1899)"]}, {"page": "Bardelys the Magnificent", "response": ["* George K. Arthur as Sainte-Eustache"]}, {"page": "Spring Fever (1927 film)", "response": ["Spring Fever is a 1927 American silent comedy film starring William Haines, Joan Crawford, and George K. Arthur, and directed by Edward Sedgwick. Based on the 1925 play of the same name by Vincent Lawrence, this was the second film starring Haines and Crawford, and their first onscreen romantic teaming.", "*George K. Arthur as Eustace Tewksbury"]}, {"page": "Pretty Ladies", "response": ["* George K. Arthur as Roger Van Horn"]}, {"page": "List of American films of 1923", "response": ["| Hollywood || James Cruze || George K. Arthur, Ruby Lafayette || Comedy || Paramount"]}, {"page": "List of American films of 1925", "response": ["|The Salvation Hunters || Josef von Sternberg || Georgia Hale, George K. Arthur || Drama || United Artists"]}, {"page": "List of American films of 1926", "response": ["|Almost a Lady || E. Mason Hopper || Marie Prevost, Harrison Ford, George K. Arthur || Comedy || PDC", "|The Boob || William A. Wellman|| Gertrude Olmstead, George K. Arthur, Joan Crawford || Comedy || MGM", "|Sunny Side Up || Donald Crisp || Vera Reynolds, George K. Arthur || Comedy || PDC", "|When the Wife's Away || Frank R. Strayer || George K. Arthur, Dorothy Revier || Comedy || Columbia"]}, {"page": "List of American films of 1927", "response": ["|The Gingham Girl || David Kirkland || Lois Wilson, George K. Arthur || Comedy || FBO", "|Rookies|| Sam Wood || Karl Dane, George K. Arthur, Marceline Day || Comedy || MGM", "|Tillie the Toiler || Hobart Henley || Marion Davies, Matt Moore, George K. Arthur || Comedy || MGM"]}, {"page": "List of American films of 1928", "response": ["|Baby Mine || Robert Z. Leonard || Karl Dane, George K. Arthur, Charlotte Greenwood || Comedy || MGM", "|Brotherly Love || Charles Reisner || Karl Dane, George K. Arthur || Comedy || MGM", "|Circus Rookies || Edward Sedgwick || Karl Dane, George K. Arthur || Comedy || MGM", "|Detectives || Chester M. Franklin ||Karl Dane, George K. Arthur, Marceline Day ||Comedy|| MGM", "|Wickedness Preferred || Hobart Henley || Lew Cody, Aileen Pringle, George K. Arthur || Comedy || MGM"]}, {"page": "List of American films of 1929", "response": ["| All at Sea || Alfred Goulding || Karl Dane, George K. Arthur || Dramedy || MGM"]}, {"page": "The Boob", "response": ["The Boob (released in the UK as The Yokel) is a 1926 American silent romantic comedy film directed by William A. Wellman, and starring Gertrude Olmstead, Antonio D'Algy, George K. Arthur, and Joan Crawford as a law enforcement agent.The Boob at silentera.comThe American Film Institute Catalog Feature Films:1921-30 by The American Film Institute, c.1971", "Peter (George K. Arthur), a courteous idealist, seeks to win the heart of Amy (Gertrude Olmstead), who in turn fancies urbane Harry (Tony D'Algy). Jane (Joan Crawford) is a Prohibition agent who helps uncover bootlegging activities. The Boob at moviessilently.com", "* George K. Arthur as Peter Good"]}, {"page": "Lady of the Night", "response": ["*George K. Arthur as \"Chunky\" Dunn "]}, {"page": "Spring Fever (1919 film)", "response": ["* George K. Arthur"]}, {"page": "Harry Rapf", "response": ["Born to a Jewish family, Rapf began his career in 1917, and during a 20-year career became a well-known producer of films for Metro-Goldwyn-Mayer. He created the comedic duo Dane & Arthur featuring Karl Dane and George K. Arthur in the late 1920s."]}, {"page": "Oliver Twist (1933 film)", "response": ["*George K. Arthur as Toby Crackit"]}, {"page": "List of American live-action shorts", "response": ["* Paramount Two Reel Acts (1928–1933) shot at the Astoria facilities in New York and featuring Helen Hayes, Humphrey Bogart (one film), Walter Houston, Lorenz Hart, Richard Rodgers, Tom Howard, Billy House, after 1930: George Jessel, Victor Moore, Jack Benny, Karl Dane, George K. Arthur, Al St. John, Ford Sterling and others.", "** Karl Dane and George K. Arthur Comedies (1930–1931)"]}, {"page": "The Last of Mrs. Cheyney (1929 film)", "response": ["* George K. Arthur as George "]}, {"page": "Sun-Up", "response": ["* George K. Arthur - Stranger"]}, {"page": "The Exquisite Sinner", "response": ["* George K. Arthur as Colonel's orderly"]}, {"page": "The Boy Friend (1926 film)", "response": ["* George K. Arthur – Book Agent"]}, {"page": "Tower Theatre (Los Angeles)", "response": ["It opened in 1927 with the silent film The Gingham Girl starring Lois Wilson and George K. Arthur."]}, {"page": "List of British Academy Award nominees and winners", "response": ["| rowspan=\"2\"| George K. Arthur"]}, {"page": "Kiki (1926 film)", "response": ["* George K. Arthur as Adolphe, Renal's valet who becomes Kiki's enemy"]}, {"page": "Irene (1926 film)", "response": ["As reported in the book and documentary film The Celluloid Closet, actor George K. Arthur plays a flamboyant gay man in the film named \"Madame Lucy\".IMDB entry", "* George K. Arthur as Madame Lucy"]}, {"page": "Hollywood (1923 film)", "response": ["* George K. Arthur as Lem Lefferts"]}, {"page": "Looking Forward (1933 film)", "response": ["*George K. Arthur as Mr. Tressitt"]}]}}