{"wiki_id": "http://www.wikidata.org/entity/Q310260", "itemLabel": "Harold Shipman", "itemDescription": "English doctor and serial killer (1947-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Shipman", "wikipedia_page": {"main": "Harold Frederick Shipman   (14 January 1946 – 13 January 2004), known to acquaintances as Fred Shipman, was an English general practitioner who is believed to be one of the most prolific serial killers in modern history. On 31 January 2000, Shipman was found guilty of the murder of fifteen patients under his care. He was sentenced to life imprisonment with the recommendation that he never be released. Shipman killed himself by hanging, in his cell at HM Prison Wakefield, West Yorkshire on 13 January 2004, a day before his 58th birthday.\nThe Shipman Inquiry, a two-year-long investigation of all deaths certified by Shipman, chaired by Dame Janet Smith, examined Shipman's crimes. The inquiry identified 218 victims and estimated his total victim count at 250, about 80 percent of whom were elderly women. Shipman's youngest confirmed victim was a 41-year-old man, although suspicion arose that he had killed patients as young as four. He is the only British doctor to have been found guilty of murdering his patients, although other doctors have been acquitted of similar crimes or convicted on lesser charges.\n\n", "link_mentions": [{"page": "Heroin", "response": ["Large doses of heroin can cause fatal respiratory depression, and the drug has been used for suicide or as a murder weapon. The serial killer Harold Shipman used diamorphine on his victims, and the subsequent Shipman Inquiry led to a tightening of the regulations surrounding the storage, prescribing and destruction of controlled drugs in the UK."]}, {"page": "Inquests in England and Wales", "response": ["Owing in particular to the failures to notice the serial murder committed by Harold Shipman, the Coroners and Justice Act 2009 modernised the system with:"]}, {"page": "Viz (comics)", "response": ["Serial killers Fred West and Harold Shipman have also featured in a strip as rival neighbours trying to kill the old woman next door and foiling each other's plans (Harold and Fred – they make ladies dead!).", "* BBC report about Viz, concerning its cartoon based on Fred West and Harold Shipman"]}, {"page": "2000", "response": ["** Dr. Harold Shipman is found guilty of murdering 15 patients between 1995 and 1998 at Hyde, Greater Manchester, England, and sentenced to life imprisonment. The subsequent enquiry considers him to have killed at least 215."]}, {"page": "1946", "response": ["** Harold Shipman, British serial killer (d. 2004)"]}, {"page": "2004", "response": ["* January 13 – Harold Shipman, British serial killer (b. 1946)"]}, {"page": "Serial killer", "response": ["There are exceptions to these criteria, however. For example, Harold Shipman was a successful professional (a General Practitioner working for the NHS). He was considered a pillar of the local community; he even won a professional award for a children's asthma clinic and was interviewed by Granada Television's World in Action on ITV. Dennis Nilsen was an ex-soldier turned civil servant and trade unionist who had no previous criminal record when arrested. Neither was known to have exhibited many of the tell-tale signs. Vlado Taneski, a crime reporter, was a career journalist who was caught after a series of articles he wrote gave clues that he had murdered people. Russell Williams was a successful and respected career Royal Canadian Air Force Colonel who was convicted of murdering two women, along with fetish burglaries and rapes.", "Some people with a pathological interest in the power of life and death tend to be attracted to medical professions or acquiring such a job., , ,  These kinds of killers are sometimes referred to as \"angels of death\" or angels of mercy. Medical professionals will kill their patients for money, for a sense of sadistic pleasure, for a belief that they are \"easing\" the patient's pain, or simply \"because they can\". Perhaps the most prolific of these was the British doctor Harold Shipman. Another such killer was nurse Jane Toppan, who admitted during her murder trial that she was sexually aroused by death. She would administer a drug mixture to patients she chose as her victims, lie in bed with them and hold them close to her body as they died."]}, {"page": "List of suicides", "response": ["* Harold Shipman (2004), English family doctor and serial killer, hanging\"Harold Shipman found dead in cell\". BBC News. January 13, 2004."]}, {"page": "Pontefract", "response": ["The old Pontefract General Infirmary on Southgate (pictured) was a general hospital; it is the place at which serial killer Harold Shipman began to murder his elderly patients. Beneath this building is an old hermitage, open to the public on certain days. Pontefract Museum, from which the hermitage schedule can be obtained, is in the town centre, housed in the former Carnegie library."]}, {"page": "Todmorden", "response": ["Todmorden featured in the ITV paranormal show \"Strange But True\" which in their pilot episode from May 1993 investigated the UFO claims in the Todmorden area. The programme included a closed surgery in which Harold Shipman worked for a number of years, as well as the town hall (haunted by a grey lady), and Oddfellows Hall (known as Baxter's bar), which is haunted by a builder who died in the construction of the building in 1811.", "Harold Shipman, the General Practitioner who is believed to have killed over 200 patients in the 1970s, 1980s and 1990s, claimed at least one of his victims while working as a doctor at the Abraham Ormerod Medical Centre between March 1974 and September 1975. His first known victim, 70-year-old Eva Lyons, lived at Keswick Close in the town. Shipman had initially been charged with 15 murders committed around Hyde, Greater Manchester, between 1995 and 1998 when he went on trial in late 1999, but Lyons was only identified as a victim of Shipman when the inquiry into his crimes was completed in July 2002 by Dame Janet Smith. Shipman was found guilty on 31 January 2000 and hanged himself at HM Wakefield Prison on 13 January 2004."]}, {"page": "Mottram in Longdendale", "response": ["Famous former residents also include Kathy Staff (aka Nora Batty from the sitcom Last of the Summer Wine) and Harold Shipman, the UK's most prolific serial killer."]}, {"page": "Angel of Death", "response": ["* Harold Shipman (1946–2004), English doctor who murdered up to 250 elderly patients"]}, {"page": "Edward Cavendish, 10th Duke of Devonshire", "response": ["Home Office pathologist Francis Camps linked Adams to 163 suspicious deaths in total, which would make him a precursor to Harold Shipman."]}, {"page": "Marcel Petiot", "response": ["*Harold Shipman"]}, {"page": "2000 in science", "response": ["*January 31 – English doctor Harold Shipman is found guilty of killing fifteen of his elderly patients by lethal injections of diamorphine, the only British physician ever convicted of murdering his patients; he is actually considered to have killed at least 215."]}, {"page": "Licensure", "response": ["In places, licensure may still be a lifelong privilege, but increasingly nowadays, it requires periodic review by peers and renewal. It is very common for license renewal to depend, at least in part, on academia. In the United Kingdom such regular upgrading of skills is often termed continuous professional development, or CPD. In many professions this is fast becoming a standard, mandatory and annual requirement. For example, in the US, educators are subject to state re-certification requirements in order to continue teaching. The No Child Left Behind Act of 2001, enacted to improve performance in US schools, has led to an intensification of license requirements for both beginning and experienced educators.http://www.ed.gov/teachers/nclbguide/nclb-teachers-toolkit.pdf In the case of UK medical practitioners, the government has recently proposed that they should all be legally required to produce formal proof, every five years, that they are upgrading their standard of practise.Doctors facing 'five-year MOTs, BBC News 23 July 2008 This tightening of the UK medical licensing system has largely been a response to public and government unease about a series of recent and well-publicised cases of alleged medical incompetence, including the Harold Shipman case, the Alder Hey organs scandalSteven Alexander, Alder Hey pathologist ordered removal of children's organs, The Guardian, 17 June 2005 and those involving David Southall, Rodney LedwardPatients still not protected, BBC News, 1 June 2000 and Richard Neale.The Richard Neale Scandal, The Clarion, 2006 "]}, {"page": "List of prison deaths", "response": ["| Harold Shipman || 2004 "]}, {"page": "Notts County F.C.", "response": ["Famous supporters include television and theatre writer William Ivory, musician Jake Bugg who sponsored the club in 2017, MP Kenneth ClarkeThe Notts County Miscellany by David Clayton, The History Press, 17 March 2017 (although he supports Forest as well) and infamously mass-murderer serial killer Harold Shipman.Evil Beyond Belief – How and Why Dr Harold Shipman Murdered 357 People by Wensley Clarkson, John Blake Publishing, 4 March 2005 – True Crime"]}, {"page": "Hyde, Greater Manchester", "response": ["Britain's most prolific serial killer, Dr Harold Shipman, had his doctor's surgery in the town where he murdered most of his several hundred victims. The first known victim was 86-year-old Sarah Hannah Marsland of Ashton House in Victoria Street on 7 August 1978 and the last was Kathleen Grundy of Joel Lane on 24 June 1998.", "*Harold Shipman, serial killer"]}, {"page": "Pethidine", "response": ["Harold Shipman once got addicted to pethidine."]}, {"page": "List of physicians", "response": ["* Harold Shipman (1946–2004) – British serial killer"]}, {"page": "Jonathan King", "response": ["He released Earth to King in 2008. One of the new songs on the album, \"The True Story of Harold Shipman\" was about the serial killer Dr. Harold Shipman, in which King suggested that Shipman may have been a victim of the media.\"Families' anger over Shipman song\", BBC News, 12 July 2007. He also produced three films. Vile Pervert: The Musical (2008), available for free download, is a 96-minute film in which King plays all 21 parts and presents his version of events surrounding his prosecution.  He portrays his viewpoint of the events responsible for his troubles. In one scene King, dressed as Oscar Wilde, sings that there is \"nothing wrong with buggering boys\". Rod Liddle in The Spectator called it \"a fantastically berserk, bravado performance\". Me Me Me (2011) was described at the Cannes Film Festival as \"a re-telling of Romeo and Juliet\".Sharp, Rob (12 May 2011). \"Cannes Diary: From disgraced D-listers to ex-drug dealing singers, festival embraces them all\", The Independent. The Pink Marble Egg (2013) is a spy story; for publicity King drove down the Promenade de la Croisette in Cannes with a pink papier-mâché egg on top of his Rolls Royce during the Cannes Film Festival."]}, {"page": "List of serial killers by country", "response": ["*Harold Shipman: known as \"Dr. Death\"; doctor convicted of fifteen murders; a later inquiry stated he had killed at least 215 and possibly up to 457 people over a 25-year period; committed suicide in 2004 in prison."]}, {"page": "2004 in the United Kingdom", "response": ["** 57-year-old Serial killer Dr. Harold Shipman is found dead in his cell one day prior to his fifty-eighth birthday; suicide is suspected.", "**Harold Shipman, serial killer (suicide) (born 1946)"]}, {"page": "Public inquiry", "response": ["| An investigation into the issues surrounding the case of mass murderer Harold Shipman"]}, {"page": "James Bolam", "response": ["In 2002, Bolam played the serial killer Harold Shipman in Shipman, the ITV adaptation of Brian Masters' book on the case, Prescription for Murder b and Father Leonard Tibbings in Dalziel and Pascoe (Ser. 7, Ep. 1 'Sins of the Fathers'). He portrayed Harold Wilson, the former Prime Minister, in the 2006 BBC documentary The Plot Against Harold Wilson. He appeared in Frank Loesser's musical How to Succeed in Business Without Really Trying at the Chichester Festival Theatre during the 2005 summer season. He played the role of Grandpa in the Cbeebies show Grandpa in My Pocket. In 2009 he played Ken Lewis, CEO of the Bank of America, in the television dramatisation The Last Days of Lehman Brothers.", "|Harold Shipman: Doctor Death||Harold Shipman|| 2002||-"]}, {"page": "List of prisoners with whole-life orders", "response": ["!data-sort-value=\"Shipman, Harold\"|Harold Shipman"]}, {"page": "John Bodkin Adams", "response": ["In 2000, Harold Shipman became the only British doctor to be successfully prosecuted for the murder of his patients. He was found guilty on 15 counts and the Shipman Inquiry concluded in 2002 that he had probably murdered a further 200."]}, {"page": "Medical record", "response": ["In general, entities in possession of medical records are required to maintain those records for a given period. In the United Kingdom, medical records are required for the lifetime of a patient and legally for as long as that complaint action can be brought. Generally in the UK, any recorded information should be kept legally for 7 years, but for medical records additional time must be allowed for any child to reach the age of responsibility (20 years). Medical records are required many years after a patient's death to investigate illnesses within a community (e.g., industrial or environmental disease or even deaths at the hands of doctors committing murders, as in the Harold Shipman case)."]}, {"page": "Peter Moore (serial killer)", "response": ["During his time in Wakefield Prison Moore befriended Harold Shipman, the serial killer and former GP who committed suicide in January 2004."]}, {"page": "Julia Davis", "response": ["From 2007 to 2009, she played Dawn Sutcliffe in Gavin & Stacey, a role which she reprised in 2019 for a Christmas special. Dawn and her husband Pete are an unhappily married couple who are friends of Gavin's parents in Billericay. Their cutting comments to each other, sexual frustration, love and hate in equal measure are a welcome side-storey to the show. Their surname is coincidentally that of infamous serial killer Peter Sutcliffe (the Yorkshire Ripper), whereas Gavin and his parents have the surname of serial killer and GP Harold Shipman. Dawn and Pete unsuccessfully tried to organise a MFM or MMF (never entirely clear) threesome to reinvigorate their sex lives. They renewed their vows to Michael Jackson's song \"Ben\" such as \"most people would turn you away, I don't listen to a word they say\"."]}, {"page": "Lists of poisonings", "response": ["*Harold Shipman (d. 2004), English general practitioner and one of the most prolific known serial killers in modern history"]}, {"page": "The Scorpions (Manchester band)", "response": ["Having been diagnosed with stomach cancer, Pete Lewis (the last remaining original band member) died at home in 1985. He was treated by Harold Shipman, nicknamed \"Doctor Death\" and was to be Harold Shipman's youngest victim."]}, {"page": "Primrose Shipman", "response": ["#REDIRECT Harold Shipman"]}, {"page": "William Palmer (murderer)", "response": ["*Harold Shipman (a doctor convicted of 15 murders, but suspected of some 250 murders in total)"]}, {"page": "HM Prison Manchester", "response": ["* Dr Harold Shipman, serial killer, who was held there on remand whilst awaiting trial."]}, {"page": "List of serial killers by number of victims", "response": ["The most prolific modern serial killer is arguably Dr. Harold Shipman, with 218 probable murders and possibly as many as 250 (see \"Medical professionals\", below). However he was actually convicted of a sample of 15 murders. Excluding these \"Medical professionals and pseudo-medical professionals\", with their ability to kill simply and in plain sight, and Serial killer groups and couples (below), this list is a compilation of modern serial killers currently with the highest verifiable murder count.", "| Harold Shipman", "| David Moor ||  || 1970s to 1999 || 300 || || British doctor who was prosecuted for the \"euthanasia\" of a patient. He was found not guilty, but then admitted in a press interview to having \"helped\" 300 people to die. Some press reports referred to him as \"Britain's greatest serial killer\" and \"Doctor Death\". If the 300 victims are accepted as murder victims, he would have killed more than the most prolific serial killer known to the world, fellow British doctor Harold Shipman."]}]}}