{"wiki_id": "http://www.wikidata.org/entity/Q3108729", "itemLabel": "Mike Rann", "itemDescription": "Australian politician (born 1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Rann", "wikipedia_page": {"main": "Michael David Rann, ,  (born 5 January 1953) is an Australian former politician who was the 44th Premier of South Australia from 2002 to 2011. He was later Australian High Commissioner to the United Kingdom from 2013 to 2014, and Australian Ambassador to Italy, Albania, Libya and San Marino from 2014 to 2016.\nRann grew up in the United Kingdom and New Zealand, completing a Bachelor and Master of Arts in Political Science at the University of Auckland. Before entering Parliament, Rann worked as an advisor to South Australian Labor Parliamentarians.\nRann became leader of the South Australian Branch of the Australian Labor Party and South Australian Leader of the Opposition in 1994 and led the party to minority government at the 2002 election. He resigned as Premier in October 2011 and was succeeded by Jay Weatherill. Rann is the third-longest serving Premier of South Australia behind Thomas Playford IV and John Bannon and served a record 17 years as South Australian Labor parliamentary leader from 1994 to 2011. He was a South Australian MP in the House of Assembly from the 1985 election and Father of the House from the 2010 election until his parliamentary resignation on 13 January 2012.", "link_mentions": [{"page": "Adelaide", "response": ["There are three public universities local to Adelaide, as well as one private university and three constituent colleges of foreign universities. Flinders University of South Australia, the University of Adelaide, the University of South Australia and Torrens University Australia—part of the Laureate International Universities are based in Adelaide. The University of Adelaide was ranked in the top 150 universities worldwide. Flinders ranked in the top 250 and Uni SA in the top 300. Torrens University Australia is part of an international network of over 70 higher education institutions in more than 30 countries worldwide. The historic Torrens Building in Victoria SquareThe historic Torrens Building in Victoria Square was beautifully restored at (considerable) taxpayer expense not long before SA Premier Mike Rann announced that it would be used as the core of Adelaide's international university precinct. houses Carnegie Mellon University's Heinz College Australia, and University College London's School of Energy and Resources (Australia), and constitute the city's international university precinct."]}, {"page": "Premier of South Australia", "response": ["| data-sort-value=\"Rann, Mike\"| Mike Rann(born 1953)MHA for Ramsay", "|Mike Rann"]}, {"page": "South Australia", "response": ["Diana Laidlaw did much to further the arts in South Australia during her term as Arts Minister from 1993 to 2002, and after Mike Rann assumed government in 2002, he created a strategic plan in 2004 (updated 2007) which included furthering and promoting the arts in South Australia under the topic heading \"Objective 4:"]}, {"page": "Stephen Schneider", "response": ["Schneider's research included modeling of the atmosphere, climate change, and the effect of global climate change on biological systems. Schneider was the founder and editor of the journal Climatic Change and authored or co-authored over 450 scientific papers and other publications. He was a Coordinating Lead Author in Working Group II Intergovernmental Panel on Climate Change (IPCC) Third Assessment Report and was engaged as a co-anchor of the Key Vulnerabilities Cross-Cutting Theme for the Fourth Assessment Report (AR4) at the time of his death. During the 1980s, Schneider emerged as a leading public advocate of sharp reductions of greenhouse gas emissions to combat global warming. In 2006 Professor Schneider was an Adelaide Thinker in Residence advising the South Australian Government of Premier Mike Rann on climate change and renewable energy policies. In ten years South Australia went from zero to 31% of its electricity generation coming from renewables."]}, {"page": "1953", "response": ["** Mike Rann, Australian politician"]}, {"page": "Carnegie Mellon University", "response": ["On April 15, 1997, Jared L. Cohon, former dean of the Yale School of Forestry & Environmental Studies, was elected president by Carnegie Mellon's board of trustees. During Cohon's presidency, Carnegie Mellon continued its trajectory of innovation and growth. His strategic plan aimed to leverage the university's strengths to benefit society in the areas of biotechnology and life sciences, information and security technology, environmental science and practices, the fine arts and humanities, and business and public policy. In 2006, following negotiations between President Cohon and South Australian Premier Mike Rann, CMU opened a campus of the Heinz College in the historic Torrens Building in Adelaide, Australia. President Cohon's term ended on June 30, 2013, after which he returned to the faculty at Carnegie Mellon."]}, {"page": "Marjorie Jackson-Nelson", "response": ["In late 2001, Jackson-Nelson was appointed Governor of South Australia; she held the post until 31 July 2007. On 15 March 2006, Jackson-Nelson was one of the final four runners who carried the Queen's Baton around the MCG stadium during the 2006 Commonwealth Games Opening Ceremony in Melbourne.  On 6 June 2007, shortly before the end of her tenure, it was announced that the planned replacement for the Royal Adelaide Hospital would be named the \"Marjorie Jackson-Nelson Hospital\". On 18 February 2009, following widespread criticism of the decision, Premier Mike Rann agreed to drop the proposal."]}, {"page": "Sidcup", "response": ["* Mike Rann (1953–), Premier of South Australia, politician, born in Sidcup, lived in Blackfen prior to emigrating to New Zealand with his parents"]}, {"page": "Adelaide Airport", "response": ["The new terminal was opened on 7 October 2005 by the Prime Minister John Howard and South Australian Premier Mike Rann. However, Adelaide Airport Limited announced soon afterwards that only international flights would use the new facility immediately due to problems with the fuel pumps and underground pipes. These problems related initially to the anti-rusting agent applied to the insides of the fuel pumps, then to construction debris in the pipes. Although international and regional (from December 2005) aircraft were refuelled via tankers, a lack of space and safety concerns prevented this action for domestic jet aircraft, which instead continued operations at the old terminal. The re-fueling system was cleared of all debris and the new terminal was used for all flights from 17 February 2006. The new airport terminal is approximately  end to end and is capable of handling 27 aircraft, including an Airbus A380, simultaneously and processing 3,000 passengers per hour. It includes high-amenity public and airline lounges, 14 glass-sided aerobridges, 42 common user check-in desks and 34 shop fronts. Free wireless Internet is also provided throughout the terminal by Internode Systems, a first for an Australian airport."]}, {"page": "Flinders University", "response": ["*Mike Rann – former Premier, appointed as a Flinders University professor"]}, {"page": "Barossa Valley", "response": ["In February 2011, South Australian Premier Mike Rann announced that special legislation would be introduced to protect the unique heritage of the Barossa Valley and McLaren Vale.  Premier Rann said: \"Barossa and McLaren Vale food and wine are key icons of South Australia. We must never allow the Barossa or McLaren Vale to become suburbs of Adelaide.\"891 ABC, 9 Feb 2011:\"No Urban Sprawl into Wine Region\" The Character Preservation (Barossa Valley) Act 2012 was subsequently passed by the South Australian Parliament."]}, {"page": "Coober Pedy", "response": ["In May 2009, South Australian Premier Mike Rann opened the $1.15 billion Prominent Hill Mine,  south east of Coober Pedy. The copper-gold mine is operated by OZ Minerals."]}, {"page": "University of Adelaide", "response": ["In 2004, Premier Mike Rann opened the multimillion-dollar Plant Genomics Centre at the Waite Campus. Then in 2010 Premier Rann opened The Plant Accelerator, a $30 million research facility – the largest and most advanced of its kind in the world.Clare Peddie,\"Green light on plant growth\", Adelaide Advertiser 29 January 2010"]}, {"page": "University of Auckland", "response": ["*Mike Rann, former Premier of South Australia, and future Australian High Commissioner to the United Kingdom"]}, {"page": "Matamata", "response": ["* Hon Mike Rann CNZM"]}, {"page": "Governor of South Australia", "response": ["The current governor is diplomat Frances Adamson who was sworn in at Government House, Adelaide on 7 October 2021,Frances Adamson announced as South Australia's new governor, replacing Hieu Van Le - ABC News, ABC News, 19 May 2021 replacing Hieu Van Le,Former refugee Hieu Van Le sworn in as South Australia's governor during official ceremony, ABC News, 1 September 2014. who held the role from 2014 to 2021.Hieu Van Le to be next SA Governor, from war-torn Vietnam to vice-regal post: ABC 26 June 2014Kevin Scarce appointed SA governor by Premier Mike Rann , Press release, 3 May 2007, www.ministers.sa.gov.au "]}, {"page": "Alexander Downer", "response": ["He resigned in February 2014 to take up the post of Australia's High Commissioner in London where he replaced former South Australian Labor premier, Mike Rann.The Guardian,Alexander Downer will be Australia's next High Commissioner to the UK, 31 March 2014 On 10 May 2016, according to The New York Times, Downer and Erika Thompson met with George Papadopoulos in London and information from this meeting caused the FBI to open a counterintelligence investigation into Russia's attempts to disrupt the 2016 US Presidential election, and whether there was any involvement by Donald Trump's associates. Downer told The Australian in a 28 April 2018 interview that, \"nothing [Papadopoulos] said in their meeting indicated Trump himself had been conspiring with the Russians to collect information on Hillary Clinton\". Downer remained as High Commissioner until 27 April 2018 when he was succeeded by George Brandis."]}, {"page": "University of South Australia", "response": ["The university was founded in its current form in 1991 with the merger of the South Australian Institute of Technology (SAIT, established in 1889 as the South Australian School of Mines and Industries) and the South Australian College of Advanced Education (SACAE, established 1856). The legislation to establish and name the new University of South Australia was introduced by the Hon Mike Rann MP, Minister of Employment and Further Education.News Release, University of South Australia, 17 August 2006 Under the University's Act, its original mission was \"to preserve, extend and disseminate knowledge through teaching, research, scholarship and consultancy, and to provide educational programs that will enhance the diverse cultural life of the wider community\".", "| 2006 || Mr Mike Rann, AC||"]}, {"page": "2002 in politics", "response": ["*March 5- Mike Rann is sworn in as premier of South Australia."]}, {"page": "Union Cycliste Internationale", "response": ["In September 2007 the UCI announced that it had decided to award ProTour status for the first time ever to an event outside of Europe; the Tour Down Under in Adelaide, Australia. The announcement followed negotiations between UCI President Pat McQuaid and South Australian Premier Mike Rann.\"ProTour Heads Down Under\", Cycling News, 28 September 2007"]}, {"page": "Premiers and chief ministers of the Australian states and territories", "response": ["On 21 July 2006, South Australian premier Mike Rann was appointed Chairman of a new Council for the Australian Federation, a council which aims to improve state-federal ties.", "Between 6 March 2002 (when Mike Rann (Labor) succeeded Rob Kerin (Liberal) as Premier of South Australia) and 23 September 2008, when Colin Barnett succeeded Alan Carpenter as Premier of Western Australia, there were Labor Premiers in all six of the Australian states (and Chief Ministers in both territories); this was only the second time a party or coalition has ever achieved this.  A comparable feat was achieved by the Coalition between 26 May 1969 (when the Liberals' Angus Bethune succeeded Labor's Eric Reece as Premier of Tasmania) and 2 June 1970 (when the Liberals' Steele Hall was succeeded by Labor's Don Dunstan as Premier of South Australia)."]}, {"page": "Adelaide Fringe", "response": ["In 2006 South Australian Premier Mike Rann announced that the Adelaide Fringe would receive extra government funding (totalling $2 million) to enable it to become an annual event from 2007 onwards. ALP News Release, 25 February 2006"]}, {"page": "Don Dunstan", "response": ["Together with Mike Rann, his press secretary and speechwriter (and later Premier), who had worked with him in 1978 on a series of speeches on Aboriginal Land Rights, industrial democracy and women's rights, Dunstan made a uranium fact-finding trip to Europe to study safe methods of generating nuclear power and of nuclear waste disposal.George Lewkowicz, Don Dunstan Foundation, Dunstan Oral History Project By the summer that followed, Dunstan became extremely ill.Cockburn, p. 112. When Parliament resumed, he collapsed on the floor of the House and was forced to use a walking stick; his doctor advised him that he required six months of rest to recover. The Liberal Opposition seized on the state of affairs and charged that the Labor Party was \"as ailing as the man who led it\". In a stage-managed press conference on 15 February 1979, Dunstan announced his retirement as premier from his room in Calvary Hospital, clearly shaking and wearing a dressing gown.Dunstan, pp. 313–314.Crocker, p. 116. The book, It's Grossly Improper, by two Adelaide journalists, Des Ryan and Mike McEwen, was published later that year.", "Dunstan was diagnosed with throat cancer in 1993 before contracting an inoperable lung cancer, which led to his death on 6 February 1999. A public memorial service was held on 9 February at the Adelaide Festival Centre as a tribute to Dunstan's love of the arts. In attendance were former Labor Prime Ministers Gough Whitlam and Bob Hawke, Federal Opposition Leader Kim Beazley, Premier John Olsen, and State Opposition Leader Mike Rann. Thousands more gathered outside the centre in Elder Park along the banks of the River Torrens. State flags were flown at half-mast and the memorial service was televised live."]}, {"page": "Lynn Arnold", "response": ["Most commentators did not blame Arnold for the landslide defeat and believed Labor would have been heavily defeated regardless of who was leading the party. Almost a year after the election, Arnold resigned as Labor leader, and left politics. He was succeeded as Labor leader by his deputy, Mike Rann. Arnold's resignation led to a by-election for Taylor on 5 November 1994, at which Trish White retained the seat for Labor."]}, {"page": "Dean Brown", "response": ["In October 2007, Brown was appointed special drought adviser to South Australian Premier Mike Rann.Former Lib premier takes Labor support role, ABC Online, 17 October 2007"]}, {"page": "John Olsen", "response": ["During the ensuing 1997 election campaign, most commentators agreed that Olsen lost the leaders' debate against Labor's Mike Rann.  The election was extremely close; on election night many Liberals feared that Labor had managed the 12-seat swing it needed to take back government (Labor had taken two Liberal seats at by-elections).  Ultimately, the Liberals suffered a 9.4% swing and lost 11 seats, one short of making Rann Premier. Olsen was forced into a minority government supported by National and independent MPs.  It was the first time that the main non-Labor party in South Australia had won a second term since adopting the Liberal Party label in 1974. After one of those crossbenchers, former Liberal Mitch Williams, returned to the party in December 1999, Olsen held a one-seat majority for eight months until he expelled longtime Liberal maverick Peter Lewis in July 2000."]}, {"page": "Rob Kerin", "response": ["However, in a surprise move, Peter Lewis, who had since been elected as an independent after being expelled from the Liberals in 2000, announced that he and his fellow crossbenchers would support the ALP and its leader Mike Rann to form minority government; in return, Lewis himself wanted to be made Speaker of the House of Assembly. When Kerin learned this, he argued that the Liberals still had a mandate to govern since they had won a majority of the two-party vote. He intended to stay in office unless Rann demonstrated he had a working majority on the floor of the Assembly. On paper, Kerin was well within his rights to take this course of action; convention in the Westminster system gives the incumbent first minister the first opportunity to form a government when no party has a clear majority."]}, {"page": "Bob Ellis", "response": ["Ellis wrote speeches for South Australian Premier Mike Rann for a number of years.'Bob Ellis fought release of fee information for fear of sales hit' by Christian Kerr, The Australian 30 November 2011 accessed 16 December 2011"]}, {"page": "Tour Down Under", "response": ["In 2007, South Australian Premier Mike Rann and tourism minister Jane Lomax Smith launched a campaign for the Tour Down Under to become the first race outside of Europe to secure ProTour status from the UCI, thereby guaranteeing the attendance of all the world's top teams.\"ProTour Heads Down Under\", Cycling News,28 September 2007"]}, {"page": "Geoff Mulgan", "response": ["In 2007-2008 Mulgan was an Adelaide Thinker in Residence, advising South Australian Premier Mike Rann on social innovation and social inclusion policies. As a result of Mulgan's recommendations, the Rann Government established The Australian Centre for Social Innovation. From 2016 to 2019, Mulgan was a senior visiting scholar at the Ash Center in the Kennedy School at Harvard University. From 2019 to 2022 he is a World Economic Forum Schwab Fellow. On 19 July 2010, he was awarded an honorary degree of Doctor of Social Science (DSoc Sci) by Nottingham Trent University."]}, {"page": "Native title in Australia", "response": ["In May 2004, following the passage of special legislation, South Australian Premier Mike Rann handed back title to 21,000 square kilometres of land to the Maralinga Tjarutja and Pila Nguru people. The land,  north-west of Adelaide and abutting the Western Australia border, was then called the Unnamed Conservation Park. It is now known as Mamungari Conservation Park. It includes the Serpentine Lakes, and was the largest land return since 1984. At the 2004 ceremony Rann said the return of the land fulfilled a promise he made to Archie Barton in 1991 when he was Aboriginal Affairs Minister, after he passed legislation to return lands including the sacred Ooldea area (which also included the site of Daisy Bates' mission camp) to the Maralinga Tjarutja people.The Age 25 August 2004, \"Maralinga Handover Prompts Celebration\" The Maralinga Tjarutja lands now total 102,863 square kilometres."]}, {"page": "2004 in Australia", "response": ["*Premier of South Australia – Mike Rann"]}, {"page": "Craccum", "response": ["Former Craccum Editor Tim Shadbolt (1972) is Mayor of Invercargill and former Mayor of Waitemata City. Mike Rann (1975) was Premier of South Australia 2002 to 2012.", "* 1975 – Mike Rann"]}, {"page": "Maralinga", "response": ["In 2003 South Australian Premier Mike Rann and Education Minister Trish White opened a new school at Oak Valley, replacing what had been described as the \"worst school in Australia\"."]}, {"page": "Kevin Foley (South Australian politician)", "response": ["Foley announced his resignation from the roles of deputy premier and treasurer in February 2011, although he continued as a member of cabinet with the Defence, Police, Emergency Services and Motor Sports portfolios. In October 2011 he resigned from the cabinet, coinciding with Mike Rann's resignation as premier. Foley's parliamentary resignation took effect on 12 December 2011, creating a 2012 Port Adelaide by-election.", "In February 2012, Foley established his own corporate advisory firm Foley Advisory, and has a \"strategic alignment\" with the lobbyists Bespoke Approach.Former treasurer Kevin Foley and ex-Mike Rann deputy chief of staff Jill Bottrall register as lobbyists The Advertiser, 13 November 2012. Retrieved 14 April 2014. Foley has since worked closely with Bespoke Approach's partners Alexander Downer, Nick Bolkus and Ian Smith. As of 2021, Sky City Casino is one of the companies he lobbies for in South Australia."]}, {"page": "Members of the South Australian House of Assembly, 2002–2006", "response": ["|| Hon Mike Rann || Labor || Ramsay || 1985–2012"]}, {"page": "Southern Expressway (South Australia)", "response": ["On 17 February 2010, during the state election campaign, Premier Mike Rann announced that, if re-elected the expressway would be duplicated in a A$445m project.http://www.adelaidenow.com.au/news/in-depth/southern-expressway-to-be-doubled-announces-sa-premier-mike-rann/story-fn2sdwup-1225831294904  However, the inclusion of a new A$75m interchange at Darlington was later scrapped, after the government planning for a major transport hub at Darlington discovered the need for a $50 million section of road that would have to be destroyed when the expressway was eventually duplicated."]}]}}