{"wiki_id": "http://www.wikidata.org/entity/Q3101892", "itemLabel": "George S. Morrison", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/George_S._Morrison_(diplomat)", "wikipedia_page": {"main": "George Staunton Morrison (1830 – 20 August 1893) was a British diplomat in the 19th century.", "link_mentions": [{"page": "Pierre Rossier", "response": ["By October 1860, Rossier had returned to Nagasaki, where he took photographs of the harbour on behalf of the British Consul, George S. Morrison, for which Rossier was paid $70.In a letter dated 13 October 1860, Morrison wrote, \"... considering that M. Rossier's time is specifically devoted to other purposes, and that he was occupied with them for several days... as he is not a tradesman here for the sale of photographs, [I] was not in a position to bargain...\" (Bennett). Seventy dollars was a substantial sum; to put it in some perspective, fourteen years later Henry Smith Munroe, an American employee of the Japanese government, was considering buying a complete set of 500 photographs by Uchida Kuichi that cost $250 or three-quarters of Munroe's monthly salary as a well-paid foreign advisor (Dobson, 20; Clark, Fraser, and Osman, 137–138). Although Rossier's photographs of Japan were advertised by Negretti and Zambra on at least two occasions in 1860, the firm did not publish them until October or November 1861.In the edition of 28 May 1860 of The Times there appeared an advertisement for a \"full coloured\" stereograph of \"Japanese ladies in full dress\" by Rossier. An advertisement in The Times, 3 October 1860, referred to the \"expected\" arrival of \"photographs from Japan – A case of rare and curious photographs of the scenery of this interesting country, and illustrative of the manners and customs of the Japanese tribes, which have been executed by a special artist sent out for the purpose by the enterprising firm of Negretti and Zambra of London\". Bennett speculates that Negretti and Zambra may have delayed publishing the images because of problems with the quality of the negatives, either because they were damaged in transit or because of Rossier's known difficulties in finding the correct photographic chemicals in Asia (Bennett). Five of Rossier's views of Japan appeared earlier, in George Smith's book, Ten Weeks in Japan, in April 1861, and that July, eight of Rossier's Japan photographs appeared in the form of lithographs in Henry Arthur Tilley's book, Japan, the Amoor, and the Pacific.Bennett PiJ, 49. An 1861 edition of the Illustrated London News included several engravings under the collective title Domestic Life in China, the images having been taken from Rossier's stereographs.Bennett OJP, 119. One of the photographs Negretti and Zambra had advertised in 1860 became the first commercial photograph taken in Japan to be published, and is the earliest known hand-coloured Japanese photograph.This being the photograph titled \"Japanese ladies in full dress\" (Bennett PiJ, 47; 49, fig. 45)."]}, {"page": "George Morrison", "response": ["* George S. Morrison (diplomat) (1830–1893), British diplomat"]}, {"page": "Morrison (surname)", "response": ["*George S. Morrison (diplomat) (c. 1830 – 1893), British diplomat"]}]}}