{"wiki_id": "http://www.wikidata.org/entity/Q3106617", "itemLabel": "Gillian Tindall", "itemDescription": "British writer and historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Gillian_Tindall", "wikipedia_page": {"main": "Gillian Tindall  (born 4 May 1938) is a British writer and historian. Among her books are City of Gold: The Biography of Bombay (1992) and Celestine: Voices from a French Village (1997). Her novel Fly Away Home won the Somerset Maugham Award in 1972. From the 1960s to the early 1990s, Tindall worked as a journalist, writing stories for The Guardian, the Evening Standard, The Times, and The Independent – and for many years she was a regular guest on the BBC Radio 3 arts discussion programme, Critics' Forum. Since 1963 she has lived in Kentish Town, North London.", "link_mentions": [{"page": "May 4", "response": ["*  1938   – Gillian Tindall, English historian and author"]}, {"page": "Kentish Town", "response": ["* Gillian Tindall, writer and historian"]}, {"page": "The Diary of a Nobody", "response": ["At about the time that Waugh was discovering his affection for the Diary another writer, J. B. Priestley, was extolling it as an exemplar of English humour; Jerome K. Jerome, Priestley asserted, never wrote anything as good: \"[P]oor Mr Pooter, with his simplicity, his timidity, his goodness of heart, is not simply a figure of fun but one of those innocent, lovable fools who are dear to the heart\".Priestley, p. 116 In a 1943 essay, George Orwell considered the book an accurate account of English life in the 1880s. In describing Pooter he revived the Don Quixote analogy but saw this English equivalent as a sentimentalised version of the original, one who \"constantly suffers disasters brought upon him by his own folly\".Orwell, p. 787 In the years after the Second World War the book's stock remained high; Osbert Lancaster deemed it \"a great work of art\", and similar enthusiasm was expressed by a new generation of writers and social historians. Gillian Tindall, writing in 1970, thought the Diary \"the best comic novel in the language\", and lauded Pooter as \"the presiding shade\" of his era. This accolade was echoed a further generation on by A. N. Wilson, who wrote in his study of the Victorian era: \"Who is to say that Oscar Wilde and Aubrey Beardsley are more typical of the [1890s] than the lower-middle class Charles and Carrie Pooter?\"Wilson 2003, p. 545 Wilson also observed the extent to which the Pooters had become recognised as \"arbiters of the greatest good taste\", as the late 20th-century English middle classes sought to acquire or preserve authentic Victorian features in their carefully crafted \"period\" homes.Wilson 1989, p. 8 A Spectator article of 2008 remarks on how such houses as \"The Laurels\", the humble habitats of 1890s City clerks, had by the 21st century become desirable £1 million-plus homes in what it terms \"banker land\"."]}, {"page": "George Gissing", "response": ["*Gillian Tindall (1974). The Born Exile: George Gissing. New York: Harcourt Brace Jovanovich, p. 295"]}, {"page": "Royal Society of Literature", "response": ["| Gillian Tindall"]}, {"page": "Anna Lee", "response": ["In the 1930s, Lee occupied a house at 49 Bankside in London; she was later interviewed by writer Gillian Tindall for a book written about the address, The House by the Thames, released in 2006. Since first built in 1710, the house had served as a home for coal merchants, an office, a boarding house, a hangout for derelicts and finally once again a private residence in the 1900s. The house is listed in tour guides as a famous residence and has been variously claimed as possibly being home to Christopher Wren during the construction of St. Paul's Cathedral, and previously claimed residents included Catherine of Aragon and William Shakespeare."]}, {"page": "Somerset Maugham Award", "response": ["* Gillian Tindall for Fly Away Home"]}, {"page": "Wenceslaus Hollar", "response": ["* Gillian Tindall, The Man Who Drew London: Wenceslaus Hollar in reality and imagination (London, 2002)."]}, {"page": "St Pancras Old Church", "response": ["Lee's \"Roman encampment\" was \"Caesar’s Camp at Pancras called the Brill\", identified by the antiquary William Stukeley in the 1750s.Stukeley's original plan of Caesar's Camp in the British Library  However, even Stukeley's contemporaries could see no trace of this camp, and considered that Stukeley had let his imagination run away with him. Gillian Tindall has suggested that the lumps and bumps in the fields to the west of the church that Stukeley interpreted as a Roman camp were actually traces of the original medieval village of St. Pancras, before the centre of the settlement moved north to the area now known as Kentish Town."]}, {"page": "Encounter (magazine)", "response": ["The range of literary figures, some young and others established, whose first contributions to Encounter came during the 1970s included novelists Martin Amis, Italo Calvino, Elias Canetti, Margaret Drabble, Ruth Prawer Jhabvala, Paul Theroux, D.M. Thomas, William Trevor, critics and essayists Clive James, Gabriel Josipovici, Bernard Levin, David Lodge, Jonathan Raban, Wilfrid Sheed, Gillian Tindall, poets Alan Brownjohn, Douglas Dunn, Gavin Ewart, James Fenton, Seamus Heaney, Erica Jong, Michael Longley, John Mole, Blake Morrison, Andrew Motion, Tom Paulin, Peter Porter, Peter Reading, Peter Redgrove, Vernon Scannell, George Szirtes, and R. S. Thomas.", "* Gillian Tindall (13)"]}, {"page": "City of Gold", "response": ["*City of Gold: A biography of Bombay by  Gillian Tindall"]}, {"page": "Rosamond Lehmann", "response": ["*Gillian Tindall, Rosamond Lehmann, 1985"]}, {"page": "Martin Nadaud", "response": ["His story is told in Gillian Tindall's book The Journey of Martin Nadaud – A Life and Turbulent Times (Pimlico, 2000)."]}, {"page": "Tindal", "response": ["* Gillian Tindall (born 1938), British author"]}, {"page": "Norman Lloyd (artist)", "response": ["* Gillian Tindall, Célestine – Voices from a French Village (Minerva, published 1996 by Mandarin Paperbacks)"]}, {"page": "Gillian", "response": ["* Gillian Tindall, British writer"]}, {"page": "The House by The Thames", "response": ["The House by The Thames: and the people who lived there is a 2006 book by British writer Gillian Tindall. A second edition was released in 2007 by Pimlico"]}, {"page": "London and Middlesex Archaeological Society", "response": ["* 2020–  : Gillian Tindall"]}, {"page": "Ursula Orange", "response": ["She married a man named Dennis Tindall with whom she had a daughter, the writer Gillian Tindall. She was for a time the assistant secretary for the British Poetry Society. According to her daughter, who wrote about her in the autobiographical 2009 book Footprints in Paris, her death in 1955 at the age of 46 was by suicide."]}, {"page": "The Fields Beneath", "response": ["#REDIRECT Gillian Tindall"]}]}}