{"wiki_id": "http://www.wikidata.org/entity/Q311652", "itemLabel": "John Davis", "itemDescription": "one of the chief English navigators and explorers under Elizabeth I", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Davis_(explorer)", "wikipedia_page": {"main": "John Davis (c. 1550 – 29 December 1605) was one of the chief navigators of Queen Elizabeth I of England. He led several voyages to discover the Northwest Passage and served as pilot and captain on both Dutch and English voyages to the East Indies. He discovered the Falkland Islands in August 1592.\n\n", "link_mentions": [{"page": "Northwest Passage", "response": ["As part of another expedition, in July 1583 Sir Humphrey Gilbert, who had written a treatise on the discovery of the passage and was a backer of Frobisher, claimed the territory of Newfoundland for the English crown. On August 8, 1585, the English explorer John Davis entered Cumberland Sound, Baffin Island."]}, {"page": "1601", "response": ["* April 22 – The first expedition of the East India Company sets sail from England for the Spice Islands with John Davis as pilot-major."]}, {"page": "1587", "response": ["* May 19 – John Davis sets out from Dartmouth, Devon, for a third attempt to find the Northwest Passage."]}, {"page": "History of Antarctica", "response": ["On 27 January 1820, a Russian expedition led by Fabian Gottlieb von Bellingshausen and Mikhail Lazarev discovered an ice shelf at Princess Martha Coast that later became known as the Fimbul Ice Shelf. Bellingshausen and Lazarev became the first explorers to see and officially discover the land of the continent of Antarctica. Three days later, on 30 January 1820, a British expedition captained by Irishman Edward Bransfield sighted Trinity Peninsula, and ten months later an American sealer Nathaniel Palmer sighted Antarctica on 17 November 1820. The first landing was probably just over a year later when American Captain John Davis, a sealer, set foot on the ice.", "The first landing on the Antarctic mainland is thought to have been made by the American Captain John Davis, a sealer, who claimed to have set foot there on 7 February 1821,Alan Gurney, Below the Convergence: Voyages Toward Antarctica, 1699–1839, Penguin Books, New York, 1998. p. 181 though this is not accepted by all historians."]}, {"page": "William Baffin", "response": ["Baffin again sailed as pilot of Discovery the next year. Leaving Gravesend on 26 March, he passed west of Greenland up the Davis Strait, discovering the large bay to its north which now bears his name, together with a series of sounds which radiate from its head and were named by him after members of the North-West Passage Company: Lancaster, Smith, and Jones. On this voyage, he sailed over  farther north than his predecessor John Davis: since his voyages seemed to preclude hope of an ice-free nautical path to the Orient, the area was not explored again for two centuries and his furthest north (about  remained unsurpassed in North America until the Royal Navy officer Edward Augustus Inglefield reached  in the same area in 1852."]}]}}