{"wiki_id": "http://www.wikidata.org/entity/Q31150741", "itemLabel": "Ally Gilchrist", "itemDescription": "association football player (born 1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ally_Gilchrist", "wikipedia_page": {"main": "Ally Gilchrist (born 3 March 1995) is a Scottish professional footballer who plays as a defender for Cork City. He has previously played for St Johnstone, Elgin City, Peterhead, Shamrock Rovers, Derry City and Shelbourne.", "link_mentions": [{"page": "List of foreign League of Ireland players", "response": ["* Ally Gilchrist – Shamrock Rovers, Derry City, Shelbourne, Cork City"]}, {"page": "PFAI Team of the Year", "response": ["!scope=row|Ally Gilchrist "]}, {"page": "2019 League of Ireland Cup Final", "response": ["|DF ||23 || Ally Gilchrist"]}, {"page": "2021 Shelbourne F.C. season", "response": ["|Ally Gilchrist", "| 1 January 2021 || DF ||   || Ally Gilchrist ||  Derry City || Free ||", "| style=\"text-align:left;\" |Ally Gilchrist", "| style=\"text-align:left;\" |Ally Gilchrist", "| style=\"text-align:left;\" |Ally Gilchrist"]}, {"page": "2022 Shelbourne F.C. season", "response": ["Damien Duff was announced as manager for the 2022 season on 3 November 2021. Defender Ally Gilchrist was announced as a new signing for Cork City on 5 November 2021 on the same day that striker Michael O'Connor was released after one season at Tolka Park. 2021 Player of the Season Ryan Brennan departed the club on 15 November 2021, and Joey O'Brien was announced as a member of Duff's backroom team. The departures of Georgie Poynton and Dayle Rooney were announced on 19 November 2021, while the re-signings of Luke Byrne and JJ Lunney for the new season were announced on 24 November 2021. Brendan Clarke and JR Wilson signed for a further season on 25 November 2021, and Shane Farrell and Stanley Anaebonam re-signed on 26 November 2021 Yoyo Madhy also re-signed for 2022 on 27 November 2021 as Denzil Fernandez announced his departure from the club (subsequently signing for Treaty United).", "| 5 November 2021 ||DF|||| Ally Gilchrist ||  Cork City ||"]}]}}