{"wiki_id": "http://www.wikidata.org/entity/Q3113254", "itemLabel": "Graham Hurley", "itemDescription": "English crime writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Graham_Hurley", "wikipedia_page": {"main": "Graham Hurley, born in 1946 at Clacton on Sea, is an English crime fiction writer.Formerly based in Portsmouth but now relocated in the West Country, he is best known for creating the character of DI Joe Faraday, following several standalone novels. He contributed a column to The Portsmouth News. He received both a BA and an MA in English from the University of Cambridge.\nHe worked as a script-writer with Southern Television before becoming a researcher and later a director.  For TVS He filmed the discovery of the seabed wrecks of the Titanic and the Bismarck (with American oceanographer Robert Ballard) and produced ITV’s account of Richard Branson’s attempt to cross the Atlantic by balloon.", "link_mentions": [{"page": "Portsmouth", "response": ["Crime novels set in Portsmouth and the surrounding area include Graham Hurley's D.I.Faraday/D.C.Winter novels and C. J. Sansom's Tudor crime novel, Heartstone; the latter refers to the warship Mary Rose and describes Tudor life in the town. Portsmouth Fairy Tales for Grown Ups, a collection of short stories, was published in 2014. The collection, set around Portsmouth, includes stories by crime novelists William Sutton and Diana Bretherick."]}, {"page": "Clacton-on-Sea", "response": ["* Graham Hurley (born 1946), English crime fiction writer"]}, {"page": "Exmouth", "response": ["*Graham Hurley (born 1946), author  "]}, {"page": "Hampshire Constabulary", "response": ["The crime fiction writer Graham Hurley draws on his knowledge of Hampshire Constabulary, and in particular Portsmouth CID, for his series of police procedural novels. Set in Portsmouth and revolving around the fictional Detective Inspector Joe Faraday they portray a gritty picture of the city and its crime.Graham Hurley, 2012  Retrieved 2 May 2012"]}, {"page": "List of Bergerac episodes", "response": ["| Graham Hurley"]}, {"page": "Theakston's Old Peculier Crime Novel of the Year Award", "response": ["** Graham Hurley – Blood and Honey", "** Graham Hurley - “One Under” "]}, {"page": "Hurley (surname)", "response": ["*Graham Hurley (born 1946), novelist"]}, {"page": "List of people from Portsmouth", "response": ["*Graham Hurley, whose Joe Faraday crime novels are based in the city."]}]}}