{"wiki_id": "http://www.wikidata.org/entity/Q3113276", "itemLabel": "Graham Rowntree", "itemDescription": "English rugby union footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Graham_Rowntree", "wikipedia_page": {"main": "Graham Christopher Rowntree (born 18 April 1971) is an English rugby union former player and current coach. He played loosehead prop for Leicester Tigers and England.  He was capped 54 times for England, despite having to compete for his position with the world's second most capped forward, Jason Leonard.\nRowntree was born in Stockton-on-Tees. He was educated at John Cleveland College, Hinckley, Leicestershire, which has also produced other rugby union players.", "link_mentions": [{"page": "Tom Smith (rugby union, born 1971)", "response": ["Smith earned his first Scotland cap in 1997 in the Calcutta Cup match versus England at Twickenham. Despite only having a 3 caps to his name at the time he was included by coach Ian McGeechan in the squad for the 1997 British and Irish Lions tour to South Africa. Surprising many, Smith was selected to start all three test matches alongside Paul Wallace and Keith Wood over the other touring props Jason Leonard and Graham Rowntree. His strong scrummaging and good hands alongside many other great team performances ensured that the Lions won over their much more highly fancied hosts and won the series 2–1."]}, {"page": "Leicester Tigers", "response": ["Tigers finished the 1988–89 Courage League in sixth place, their joint-worst ever finish. During the late 1980s and early 1990s several key members of the Leicester pack came through the youth ranks and became key first-team contributors, most notably lock Martin Johnson who debuted in 1989 and later became club captain; flanker Neil Back who joined in 1990; and the front row trio of Graham Rowntree, Richard Cockerill, and Darren Garforth who started 166 games together between 1992 and 2002.", "thumb|right|230px|Martin Johnson and Graham Rowntree in Tigers traditional colours during the friendly match vs. Bath in 2007.", "* Graham Rowntree (1997, 2005)", "| Neil Back, Martin Johnson, Dean Richards, Graham Rowntree, Rory Underwood, Tony Underwood ", "| Neil Back, Richard Cockerill, Martin Corry, Darren Garforth, Will Greenwood, Austin Healey, Martin Johnson, Leon Lloyd, Graham Rowntree, ", "|Loosehad Prop || || Graham Rowntree || 398 games 1990–2007"]}, {"page": "Stockton-on-Tees", "response": ["* Graham Rowntree, England rugby player"]}, {"page": "England national rugby union team", "response": ["In March 2012, the Rugby Football Union appointed Stuart Lancaster, the former Elite Rugby Director at Leeds Carnegie, as England's head coach. He had previously been employed in the position on a short-term basis, assisted by existing forwards coach Graham Rowntree, and Andy Farrell. Lancaster was considered a success in his first campaign as head coach: defending champions England took second place in the 2012 Six Nations Championship after losing 19–12 to Wales at Twickenham, but successfully defended the Calcutta Cup by defeating Scotland 13–6 at Murrayfield. England finished the year on a high when they beat World Cup holders New Zealand 38–21 at Twickenham in the Autumn internationals; the England team dominated the match and completely outplayed the All Blacks, who had been unbeaten in 20 matches."]}, {"page": "Martin Corry (rugby union)", "response": ["He confirmed his selection for Clive Woodward's Rugby World Cup squad in a highly competitive back row area with a strong late run in England's warm-up matches: he performed well in the 43–9 defeat of Wales at the Millennium Stadium in late Summer of 2003 and then again in the September defeat of France at Twickenham. He was part of England's 2003 World Cup-winning squad, chosen ahead of teammate Graham Rowntree. During the 2003 Rugby World Cup, Corry flew home from Australia for the birth of his first child, daughter Eve. He rejoined the squad days later, and played in England's victory over Uruguay.  He was an unused replacement in the 2003 Rugby World Cup Final."]}, {"page": "Richard Cockerill", "response": ["Cockerill was born in Rugby.  Joining Leicester Tigers, he established himself as the B of the \"ABC club\" alongside Graham Rowntree (A) and Darren Garforth (C). Cockerill was an unused replacement for both the 2001 and 2002 Heineken Cup finals."]}, {"page": "1997 British Lions tour to South Africa", "response": ["|Graham Rowntree || Prop || Leicester || ||"]}, {"page": "2005 British & Irish Lions tour to New Zealand", "response": ["|Graham Rowntree"]}, {"page": "Mike Catt", "response": ["In 2012, Catt joined the England national set-up as backs/attack coach for their 2012 tour to South Africa. On 15 December 2015, following the resignation of head coach Stuart Lancaster on 11 November 2015, newly appointed head coach Eddie Jones sacked the whole coaching team.Graham Rowntree, Mike Catt and Andy Farrell leave England roles", "As of November 2021, England's coaching group during the 2015 Rugby World Cup are all employed in Ireland – Andy Farrell (Ireland head coach), Stuart Lancaster (Leinster Rugby senior coach), Graham Rowntree (Munster Rugby forwards coach) and Mike Catt (Ireland attack coach)."]}, {"page": "Julian White", "response": ["He toured North America in the summer of 2001, forming a solid front row with Graham Rowntree and Dorian West."]}, {"page": "Darren Morris", "response": ["Morris was born in Aberdare, and educated at Aberdare Boys School, Neath College and the University of Glamorgan (now the University of South Wales). Played for Neath RFC from 1992 to 1998, and during this period also played in Brisbane for Eastern Suburbs Tigers, where they made it to the Grand Final in 1995. During this time he was also involved with the Queensland Reds. He then moved to Swansea RFC in 1998 where the club won numerous leagues and cups. He captained Swansea RFC their 2002/2003 season. Morris then joined Leicester Tigers with England props Graham Rowntree and Julian White. Morris signed for Worcester Warriors and made 64 appearances for the club. "]}, {"page": "Darren Garforth", "response": ["Garforth was born in Coventry, signed for Leicester Tigers and made his Leicester debut against Northampton Saints in 1991.  He would go on to make over 300 appearances for the club.  Wearing the C shirt, as part of the ABC club with Graham Rowntree (A) and Richard Cockerill (B).  He was an important part of Tigers side which won the English league four times and the Heineken Cup twice."]}, {"page": "Phil Vickery (rugby union)", "response": ["The tour had benefits for some players, bringing through future stars of the England side such as Vickery himself, Jonny Wilkinson, Danny Grewcock, Graham Rowntree, Austin Healey, Matt Dawson and Matt Perry, others effectively had their international careers ended.  Steve Ravenscroft, Rob Fidler, Jos Baxendell, Spencer Brown and Tom Beim each gained two caps on the tour – and have not played for England since.  Richard Pool-Jones, Scott Benton, Dominic Chapman and Stuart Potter only played once for England, on the Tour From Hell."]}, {"page": "Neil Jenkins", "response": ["He was then reappointed as a coach for the lions for their 2013 Tour to Australia alongside Graham Rowntree and head coach Warren Gatland. He was subsequently named in the coaching team for the 2017 and 2021 tour, again alongside Warren Gatland on both, and Rowntree in 2017."]}, {"page": "Croft, Leicestershire", "response": ["Croft Fun Park was opened in 2002 by Graham Rowntree."]}, {"page": "Munster Rugby", "response": ["Backs coach Felix Jones and forwards coach Jerry Flannery left the province when their contracts expired in June 2019. Graham Rowntree joined the province as their new forwards coach after the completion of his duties with Georgia at the 2019 Rugby World Cup. Stephen Larkham, attack coach for the Australian national team, also joined the province as a senior coach ahead of the 2019–20 season.", "| Graham Rowntree"]}]}}