{"wiki_id": "http://www.wikidata.org/entity/Q3126838", "itemLabel": "Hannah Cowley", "itemDescription": "English writer, dramatist, poet (1743-1809)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hannah_Cowley_(writer)", "wikipedia_page": {"main": "Hannah Cowley (14 March 1743 – 11 March 1809) was an English playwright and poet. Although Cowley's plays and poetry did not enjoy wide popularity after the 19th century, critic Melinda Finberg rates her as \"one of the foremost playwrights of the late eighteenth century\" whose \"skill in writing fluid, sparkling dialogue and creating sprightly, memorable comic characters compares favourably with her better-known contemporaries, Goldsmith and Sheridan.\" Cowley's plays were produced frequently in her lifetime. The major themes of her plays – including her first, The Runaway (1776), and her major success, which is being revived, The Belle's Stratagem (1780) – revolve around marriage and how women strive to overcome the injustices imposed by family life and social custom.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Hannah Cowley (1743–1809, E)"]}, {"page": "1743", "response": ["* March 14 – Hannah Cowley, English dramatist and poet (d. 1809)"]}, {"page": "1809", "response": ["* March 11 – Hannah Cowley, English dramatist and poet (b. 1743)"]}, {"page": "1809 in literature", "response": ["*March 11 – Hannah Cowley, English dramatist and poet (born 1743)"]}, {"page": "1794 in literature", "response": ["*Hannah Cowley – The Town Before You"]}, {"page": "1776 in literature", "response": ["*Hannah Cowley – The Runaway"]}, {"page": "1784 in literature", "response": ["*Hannah Cowley"]}, {"page": "1743 in literature", "response": ["*March 14 – Hannah Cowley, English dramatist and poet (died 1809)"]}, {"page": "1779 in literature", "response": ["*Hannah Cowley"]}, {"page": "1780 in literature", "response": ["*Hannah Cowley – The Belle's Stratagem", "*Hannah Cowley – The Maid of Aragon"]}, {"page": "1781 in literature", "response": ["*Hannah Cowley – The World as it Goes"]}, {"page": "1782 in literature", "response": ["*Hannah Cowley – The Belle's Stratagem"]}, {"page": "1783 in literature", "response": ["*Hannah Cowley – Which is the Man?"]}, {"page": "1786 in literature", "response": ["*Hannah Cowley – A School for Greybeards"]}, {"page": "1788 in literature", "response": ["*Hannah Cowley – The Fate of Sparta"]}, {"page": "Charles Kemble", "response": ["His first London appearance was on 21 April 1794, as Malcolm to his brother's Macbeth. Ultimately he won independent fame, especially in such characters as Archer in George Farquhar's Beaux' Stratagem, Dorincourt in Hannah Cowley's Belle's Stratagem, Charles Surface and Ranger in Benjamin Hoadley's Suspicious Husband. His Laërtes and Macduff were as accomplished as his brother's Hamlet and Macbeth. His production of Cymbeline in 1827 inaugurated the trend to historical accuracy in stagings of that play that reached a peak with Henry Irving at the turn of the century."]}, {"page": "Tiverton, Devon", "response": ["*Hannah Cowley (1743–1809), playwright and poet born in Tiverton"]}, {"page": "Squeegee", "response": ["The earliest written references to squeegees date from the mid-19th century and concern deck-cleaning tools, some with leather rather than rubber blades. The name \"squeegee\" may come from the word \"squeege\", meaning press or squeeze, which was first recorded in 1783. The closely related \"squeedging\" was reportedly first used in 1782, in the Covent Garden Theatre, during the performing of the comedy Which is the Man? by Hannah Cowley."]}, {"page": "Elizabeth Inchbald", "response": ["After Joseph Inchbald's sudden death in June 1779, Elizabeth continued to act for several years, in Dublin, London and elsewhere. She quarrelled publicly with Mary Wollstonecraft in 1797, when Wollstonecraft's marriage to William Godwin made it clear that she had not been married to Gilbert Imlay, the father of her elder daughter Fanny. This was deeply resented by Godwin.John Barrell: \"May I come to your house to philosophise? The letters of William Godwin Vol 1...\", London Review of Books 8 September 2011. Her acting career, only moderately successful, spanned 17 years. She appeared in many classical roles and in new plays such as Hannah Cowley's The Belle's Stratagem."]}, {"page": "Oxford period poetry anthologies", "response": ["Miles Peter Andrews – Joanna Baillie – Samuel Bamford – Anna Laetitia Barbauld – Thomas Beck – William Blake – William Lisle Bowles – Robert Burns – George Gordon, Lord Byron – Thomas Campbell – George Canning – John Clare – Samuel Taylor Coleridge – Hannah Cowley – William Cowper – George Crabbe – George Croly – William Crowe – Charlotte Dacre – George Darley – Erasmus Darwin – Ebenezer Elliott – Catherine Maria Fanshawe – John Hookham Frere – William Gifford – Felicia Dorothea Hemans – James Hogg – William Hone – Thomas Hood – Leigh Hunt – Sir William Jones – John Keats – Charles Lamb – Mary Lamb – Laetitia Elizabeth Landon – Walter Savage Landor – Joseph Lees – Matthew Gregory Lewis – Charles Lloyd (poet) – Henry Luttrell – John Herman Merivale – Robert Merry – Mary Russell Mitford – James Montgomery – Thomas Moore – John Moultrie – Caroline Oliphant – Amelia Opie – Sydney Owenson – William Parsons – Thomas Love Peacock – Richard Polwhele – Winthrop Mackworth Praed – William Probert – Bryan Waller Procter – Edward Quillinan – Ann Radcliffe – Mary Robinson – Samuel Rogers – William Roscoe – Thomas Russell – Walter Scott – Anna Seward – Percy Bysshe Shelley – Charlotte Turner Smith – Horace Smith – James Smith – Robert Southey – Thomas Tod Stoddart – Ann Taylor – Jane Taylor – William Taylor – William Tennant – Alfred Tennyson – John Thelwall – Mary Tighe – Helen Maria Williams – John Wolcot – Charles Wolfe – William Wordsworth – Ann Yearsley"]}, {"page": "F. C. Burnand", "response": ["Burnand was born in central London, the only child of Francis Burnand and his first wife Emma, née Cowley, who died when her son was eight days old.Stedman, Jane W. \"Burnand, Sir Francis Cowley (1836–1917)\", Oxford Dictionary of National Biography, Oxford University Press, September 2004, accessed 8 June 2014,   Burnand senior, a stockbroker, was descended from an old Savoyard family, prominent in the silk trade; his wife was a descendant of the poet and dramatist Hannah Cowley."]}, {"page": "Jane Pope", "response": ["* Lady Horatia Horton in The Town Before You by Hannah Cowley (1794)"]}, {"page": "Della Cruscans", "response": ["Robert Merry travelled to Florence where he edited two volumes, The Arno Miscellany (1784) and The Florence Miscellany (1785), the latter of which could be said to have started the Della Cruscan phenomena. It was a collaboration between English and Italian poets and contained poems in English, Italian, and French. The name is taken from the Florentine Accademia della Crusca, an organization founded in 1583 to \"purify\" the Italian language. Bertie Greatheed's \"The Dream\" opens the collection with an indictment of the current deplorable state of poetry and calls for a return to a Miltonic style. The call to the past was made even more clear by the inclusion of translations of poems by Dante and Petrarch. Hester Thrale Piozzi's preface is more modest: \"we wrote [these poems] to divert ourselves, and to say kind things of each other; we collected them that our reciprocal expressions of kindness might not be lost, and we printed them because we had no reason to be ashamed of our mutual partiality.\"English Poetry 1579-1830: Spenser and the Tradition William Parsons, a travelling Briton, was also of the circle. Merry returned to the UK in 1787 and published \"Adieu and Recall to Love\" in The World under the name of \"Della Crusca\". He was answered by Hannah Cowley's \"The Pen,\" published two weeks later under the name of \"Anna Matilda,\" their literary flirtation played out in the pages of the journal, and the Della Cruscan phenomenon spread to England. The highly successful The Poetry of the World (1788), a collection of the poetic dialogue between \"Anna Matilda\" and \"Della Crusca,\" followed shortly and went through several editions. Other members of the English Della Cruscan circle were \"Laura Maria\" (Mary Robinson), \"Benedict\" (Edward Jerningham), \"Reuben\" (Greatheed), Frederick Pilon, and others.", "*The Poetry of the World (John Bell, ed., 1788). The fourth edition was retitled The British Album (2 Vols., 1790) Contributors: Robert Merry, Hannah Cowley", "*\"Anna Matilda\"[Hannah Cowley], \"To Della Crusca\"; \"To Della Crusca. The Pen\"; \"Invocation to Horror\"; \"To Indifference\""]}, {"page": "Colin Blumenau", "response": ["He was Artistic Director of the Theatre Royal, Bury St Edmunds between 1996 and 2012 and spearheaded its restoration project. During this period, under the banner of Restoring the Repertoire, he also led the Theatre Royal's initiative to rediscover and restore the much neglected English Drama repertoire of the 18th and early 19th centuries to the stage. Productions included Black-Eyed Susan by Douglas Jerrold, Wives as they Were and Maids as they Are by Elizabeth Inchbald, The London Merchant by George Lillo and the world premiere of Inchbald's The Massacre two centuries after it was written. In addition there were public readings of some seventy five plays by authors as  diverse as Hannah Cowley and John le Planché,"]}, {"page": "The Beaux' Stratagem", "response": ["A Ladies' response to the play named 'The Belles' Stratagem' was written by Hannah Cowley in 1780. This was adapted and directed by Scottish actor and director, Tony Cownie. It premiered at the Royal Lyceum Theatre in February 2018."]}, {"page": "Production history of the Oregon Shakespeare Festival", "response": ["|Hannah Cowley"]}, {"page": "Mary Ann Duff", "response": ["Her next performance was on 3 January 1811, where she played Lady Anne in Richard III with George Frederick Cooke in the title rôle. She followed it with Lady Rodolpha Lumbercourt to his Sir Pertinax MacSycophant in Charles Macklin's Man of the World; Charlotte to his Sir Archy MacSarcasm in Love a la Mode by the same author; and Lady Percy to his Falstaff in Henry IV, Part 1. Other roles she played at this time were Miranda, with her husband as Marplot, in The Busy Bodie by Susanna Centlivre; and Eliza Ratcliff, with John Bernard as Sheva, in The Jew by Richard Cumberland. She also appeared in the pantomimes Oscar and Malvina by William Reeve, in which she also danced; and Brazen Mask by James Hewitt. On 29 April 1811 the Duffs appeared at a benefit in which Mary danced a solo while her husband performed in The Three and the Deuce by Prince Hoare. The latter was so popular that he would go on to repeat this triple-role performance more than eighty times over the course of his career. Mary's first season in Boston ended with her playing Victoria in Hannah Cowley's A Bold Stroke for a Husband."]}, {"page": "List of early-modern women playwrights (England, Wales, and Great Britain)", "response": ["*Hannah Cowley (1743–1809): playwright and poet"]}, {"page": "1809 in the United Kingdom", "response": ["* 11 March – Hannah Cowley, dramatist, poet and social reformer (born 1743)"]}, {"page": "1809 in poetry", "response": ["* March 11 – Hannah Cowley (born 1743), English playwright and poet"]}, {"page": "1801 in poetry", "response": ["* Hannah Cowley, The Siege of Acre"]}, {"page": "1743 in Great Britain", "response": ["* 14 March – Hannah Cowley, dramatist and poet (died 1809)"]}, {"page": "1780 in poetry", "response": ["* Hannah Cowley, The Maid of Aragon, Part 1 (complete work first published in The Works of mrs Cowley 1813)Cox, Michael, editor, The Concise Oxford Chronology of English Literature, Oxford University Press, 2004, "]}, {"page": "1786 in poetry", "response": ["* Hannah Cowley, The Scottish Village; or, Pitcairn Green"]}, {"page": "1743 in poetry", "response": ["* March 14 – Hannah Cowley (died 1809), English dramatist and poet"]}, {"page": "Gondibert", "response": ["William Thompson's play Gondibert And Birtha: A Tragedy (1751) was based on the poem. Alexander Chalmers wrote of the play that \"although it is not without individual passages of poetical beauty, it has not dramatic form and consistency to entitle it to higher praise.\"Chalmers, Alexander, \"Life of William Thompson\", Works of the English Poets, London , 1819, p.4 Hannah Cowley's play Albina (1779) is much more loosely derived from it. The character of Sir Gondibert also made a brief reappearance in English literature in \"Calidore: A Fragment,\" an early unfinished poem by John Keats heavily influenced by Edmund Spenser."]}, {"page": "Hannah (name)", "response": ["* Hannah Cowley (1743–1809), American dramatist and poet"]}, {"page": "The Belle's Stratagem", "response": ["The Belle's Stratagem is a romantic comedy of manners, the most successful work of its playwright, Hannah Cowley. It received its premiere on 22 February 1780,Winter, William. Preface to \"Two Old Comedies: The Belle's Stratagem and The Wonder. Reduced and Re-arranged by Augustin Daly.\" pp. 11-14. Privately printed from the prompt books at Daly's Theatre, 1893. Accessed at https://books.google.com/books?id=e2CKdMWUb9wC&printsec=frontcover&source=gbs_ge_summary_r&cad=0#v=onepage&q&f=false presented by David Garrick, filling the 2,000-seat Drury Lane theatre.Swale, Jessica. \"The Belle of London: Hannah Cowley.\" Program notes, Southwark Playhouse's 2011 production of \"The Belle's Stratagem.\" The play became a major hit of the season, with Queen Charlotte enjoying it so much that she decreed it be performed for the royal family once a season for several years.Winter Its title comes from George Farquhar's play The Beaux' Stratagem.", "In 1743, Hannah Cowley was born in Tiverton, Devon. Her father, Phillip Parkhouse, was an educated bookseller, which helped develop Cowley’s literary interest and skill. In 1772, she married Thomas Cowley, a bookseller’s son. Most female playwrights of the time period were either unmarried or abandoned playwriting shortly after their marriage. However, Thomas’s small earnings as a writer allowed her to try her hand at playwriting. Cowley’s interest in playwriting was allegedly sparked by a “dull night out at the theatre”; she decided she could write a better play than the one she had just watched, so shortly after, she wrote The Runaway. Cowely’s first play The Runaway debuted in February 1776. With the help of David Garrick, The Runaway became a huge success and earned Cowley over 500 pounds. The Runaway was Garrick’s last production before he retired, and Cowley had “lost the ‘patron’ to whom her ‘heart [was] devoted’”.Hughes, Derek, 1944.  Eighteenth‐Century Women Playwrights, Pickering & Chatto, Brookrield, Vt;London;, 2001. Cowley’s next manager, Richard Sheridan, would not be as kind. While he delayed and rejected her ideas, Cowley saw her rival, Hannah More, become popular with plays that strongly resembled Cowley’s works. The two quickly began a very public “paper war” After the Hannah More scandal, Cowley returned her focus to playwriting, and in February 1780 The Belle’s Stratagem, Cowley’s most popular play premiered.", "The Belle's Stratagem still remains Hannah Cowley's most popular play to date, and is very \"before her time\" in writing strong and intelligent female characters. During its stage life thirty editions were published.Lock, F.B. (1974). \"The Belle's Stratagem: 1708-1903.\" The Book Collector 23 no 4 (winter):537-546."]}, {"page": "Anna Matilda", "response": ["#REDIRECT Hannah Cowley (writer)"]}, {"page": "The Runaway (play)", "response": ["#REDIRECT Hannah Cowley (writer)#The Runaway (1776)"]}, {"page": "Gina Beck", "response": ["In June 2011, she made her debut in the leading role of Maria von Trapp in a new production of the Rodgers and Hammerstein musical The Sound of Music at the 3,000 seat Plenary Hall Convention Centre in Kuala Lumpur, Malaysia. In September 2011 she played Letitia Hardy in Hannah Cowley's restoration comedy The Belle's Stratagem at Southwark Playhouse. This was the first time in over 100 years that this play had been produced in London."]}, {"page": "Washington Gardens (Boston)", "response": ["** August - Exhibition of \"an elegant equestrian statue, painted by Curtis.\" Performance of \"Kotzebue's celebrated play, in 5 acts, called 'The Stranger.' The evening's entertainment will conclude with the humorous and highly popular farce of 'Who's the Dupe'\" by Hannah Cowley.Boston Daily Advertiser; Date: 08-08-1821; p.3."]}, {"page": "Hannah Parkhouse", "response": ["#REDIRECT Hannah Cowley (writer)"]}, {"page": "Cowley (surname)", "response": ["*Hannah Cowley (writer) (1743–1809), English dramatist and poet", "*Hannah Cowley (artist) (born 1984), British actress and director"]}]}}