{"wiki_id": "http://www.wikidata.org/entity/Q312562", "itemLabel": "James Macpherson", "itemDescription": "Scottish writer, poet, translator, and politician (1736-1796)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Macpherson", "wikipedia_page": {"main": "James Macpherson (Gaelic: Seumas MacMhuirich or Seumas Mac a' Phearsain; 27 October 1736 – 17 February 1796) was a Scottish writer, poet, literary collector and politician, known as the \"translator\" of the Ossian cycle of epic poems.", "link_mentions": [{"page": "List of English-language poets", "response": ["*James Macpherson (1736–1796, S)"]}, {"page": "History of Scotland", "response": ["Although Scotland increasingly adopted the English language and wider cultural norms, its literature developed a distinct national identity and began to enjoy an international reputation. Allan Ramsay (1686–1758) laid the foundations of a reawakening of interest in older Scottish literature, as well as leading the trend for pastoral poetry, helping to develop the Habbie stanza as a poetic form.Buchan, Crowded with Genius, p. 311. James Macpherson was the first Scottish poet to gain an international reputation, claiming to have found poetry written by Ossian, he published translations that acquired international popularity, being proclaimed as a Celtic equivalent of the Classical epics. Fingal written in 1762 was speedily translated into many European languages, and its deep appreciation of natural beauty and the melancholy tenderness of its treatment of the ancient legend did more than any single work to bring about the Romantic movement in European, and especially in German, literature, influencing Herder and Goethe.Buchan, Crowded with Genius, p. 163. Eventually it became clear that the poems were not direct translations from the Gaelic, but flowery adaptations made to suit the aesthetic expectations of his audience. Both the major literary figures of the following century, Robert Burns and Walter Scott, would be highly influenced by the Ossian cycle. Burns, an Ayrshire poet and lyricist, is widely regarded as the national poet of Scotland and a major figure in the Romantic movement. As well as making original compositions, Burns also collected folk songs from across Scotland, often revising or adapting them. His poem (and song) \"Auld Lang Syne\" is often sung at Hogmanay (the last day of the year), and \"Scots Wha Hae\" served for a long time as an unofficial national anthem of the country."]}, {"page": "Ossian", "response": ["Ossian (; Irish Gaelic/Scottish Gaelic: Oisean) is the narrator and purported author of a cycle of epic poems published by the Scottish poet James Macpherson, originally as Fingal (1761) and Temora (1763), and later combined under the title The Poems of Ossian. Macpherson claimed to have collected word-of-mouth material in Scottish Gaelic, said to be from ancient sources, and that the work was his translation of that material. Ossian is based on Oisín, son of Finn or Fionn mac Cumhaill, anglicised to Finn McCool, a legendary bard who is a character in Irish mythology.  Contemporary critics were divided in their view of the work's authenticity, but the current consensus is that Macpherson largely composed the poems himself, drawing in part on traditional Gaelic poetry he had collected.", "National Library of Scotland has 327 books and associated materials in its Ossian Collection.  The collection was originally assembled by J. Norman Methven of Perth and includes different editions and translations of James Macpherson's epic poem 'Ossian', some with a map of the 'Kingdom of Connor'. It also contains secondary material relating to Ossianic poetry and the Ossian controversy.  More than 200 items from the collection have been digitised.", "*1888:  Poems of Ossian translated by James Macpherson, a pocket reprint of the 1773 edition omitting the four last poems (London: Walter Scott) ", "*Moore, Dafydd. Enlightenment and Romance in James Macpherson's the Poems of Ossian: Myth, Genre and Cultural Change (Studies in Early Modern English Literature) (2003)", "*Selected Bibliography: James Macpherson and Ossian Excellent online bibliography; compiled by designated experts in the field; covering the most important scholarly monographs and articles on Ossian and Macpherson up to March 2004."]}, {"page": "Romanticism", "response": ["The precursors of Romanticism in English poetry go back to the middle of the 18th century, including figures such as Joseph Warton (headmaster at Winchester College) and his brother Thomas Warton, Professor of Poetry at Oxford University.John Keats. By Sidney Colvin, p. 106. Elibron Classics Joseph maintained that invention and imagination were the chief qualities of a poet. The Scottish poet James Macpherson influenced the early development of Romanticism with the international success of his Ossian cycle of poems published in 1762, inspiring both Goethe and the young Walter Scott. Thomas Chatterton is generally considered the first Romantic poet in English.Thomas Chatterton, Grevel Lindop, 1972, Fyffield Books, p. 11 Both Chatterton and Macpherson's work involved elements of fraud, as what they claimed was earlier literature that they had discovered or compiled was, in fact, entirely their own work. The Gothic novel, beginning with Horace Walpole's The Castle of Otranto (1764), was an important precursor of one strain of Romanticism, with a delight in horror and threat, and exotic picturesque settings, matched in Walpole's case by his role in the early revival of Gothic architecture. Tristram Shandy, a novel by Laurence Sterne (1759–67), introduced a whimsical version of the anti-rational sentimental novel to the English literary public.", "Although after union with England in 1707 Scotland increasingly adopted English language and wider cultural norms, its literature developed a distinct national identity and began to enjoy an international reputation. Allan Ramsay (1686–1758) laid the foundations of a reawakening of interest in older Scottish literature, as well as leading the trend for pastoral poetry, helping to develop the Habbie stanza as a poetic form.J. Buchan, Crowded with Genius (London: Harper Collins, 2003), , p. 311. James Macpherson (1736–96) was the first Scottish poet to gain an international reputation. Claiming to have found poetry written by the ancient bard Ossian, he published translations that acquired international popularity, being proclaimed as a Celtic equivalent of the Classical epics. Fingal, written in 1762, was speedily translated into many European languages, and its appreciation of natural beauty and treatment of the ancient legend has been credited more than any single work with bringing about the Romantic movement in European, and especially in German literature, through its influence on Johann Gottfried von Herder and Johann Wolfgang von Goethe.J. Buchan, Crowded with Genius (London: Harper Collins, 2003), , p. 163. It was also popularised in France by figures that included Napoleon.H. Gaskill, The Reception of Ossian in Europe (Continuum, 2004), , p. 140. Eventually it became clear that the poems were not direct translations from Scottish Gaelic, but flowery adaptations made to suit the aesthetic expectations of his audience.D. Thomson, The Gaelic Sources of Macpherson's \"Ossian\" (Aberdeen: Oliver & Boyd, 1952)."]}, {"page": "River Clyde", "response": ["The Clyde plays an important role in the Para Handy novels of Neil Munro, and subsequent adaptations. It also features in novels by Alasdair Gray, Matthew Fitt, and Robin Jenkins. It is mentioned in the \"Ossian\" poetry of James Macpherson, as well as the works of John Wilson, William McGonagall, Edwin Morgan, Norman McCaig, Douglas Dunn and W.S. Graham. And it features in the work of many visual artists, including, for example, William McTaggart, J.M.W. Turner, Robert Salmon, John Atkinson Grimshaw, Stanley Spencer, and George Wyllie."]}, {"page": "Scotland", "response": ["Scotland has a literary heritage dating back to the early Middle Ages. The earliest extant literature composed in what is now Scotland was in Brythonic speech in the 6th century, but is preserved as part of Welsh literature.R. T. Lambdin and L. C. Lambdin, Encyclopedia of Medieval Literature (London: Greenwood, 2000), , p. 508. Later medieval literature included works in Latin,I. Brown, T. Owen Clancy, M. Pittock, S. Manning, eds, The Edinburgh History of Scottish Literature: From Columba to the Union, until 1707 (Edinburgh: Edinburgh University Press, 2007), , p. 94. Gaelic,J. T. Koch, Celtic Culture: a Historical Encyclopedia (ABC-CLIO, 2006), , p. 999. Old EnglishE. M. Treharne, Old and Middle English c.890-c.1400: an Anthology (Wiley-Blackwell, 2004), , p. 108. and French.M. Fry, Edinburgh (London: Pan Macmillan, 2011), . The first surviving major text in Early Scots is the 14th-century poet John Barbour's epic Brus, focusing on the life of Robert I,N. Jayapalan, History of English Literature (Atlantic, 2001), , p. 23. and was soon followed by a series of vernacular romances and prose works.J. Wormald, Court, Kirk, and Community: Scotland, 1470–1625 (Edinburgh: Edinburgh University Press, 1991), , pp. 60–7. In the 16th century, the crown's patronage helped the development of Scots drama and poetry,I. Brown, T. Owen Clancy, M. Pittock, S. Manning, eds, The Edinburgh History of Scottish Literature: From Columba to the Union, until 1707 (Edinburgh: Edinburgh University Press, 2007), , pp. 256–7. but the accession of James VI to the English throne removed a major centre of literary patronage and Scots was sidelined as a literary language.R. D. S. Jack, \"Poetry under King James VI\", in C. Cairns, ed., The History of Scottish Literature (Aberdeen University Press, 1988), vol. 1, , pp. 137–8. Interest in Scots literature was revived in the 18th century by figures including James Macpherson, whose Ossian Cycle made him the first Scottish poet to gain an international reputation and was a major influence on the European Enlightenment. It was also a major influence on Robert Burns, whom many consider the national poet, and Walter Scott, whose Waverley Novels did much to define Scottish identity in the 19th century. Towards the end of the Victorian era a number of Scottish-born authors achieved international reputations as writers in English, including Robert Louis Stevenson, Arthur Conan Doyle, J. M. Barrie and George MacDonald. In the 20th century the Scottish Renaissance saw a surge of literary activity and attempts to reclaim the Scots language as a medium for serious literature. Members of the movement were followed by a new generation of post-war poets including Edwin Morgan, who would be appointed the first Scots Makar by the inaugural Scottish government in 2004. From the 1980s Scottish literature enjoyed another major revival, particularly associated with a group of writers including Irvine Welsh. Scottish poets who emerged in the same period included Carol Ann Duffy, who, in May 2009, was the first Scot named the monarch's Poet Laureate."]}, {"page": "Walter Scott", "response": ["Scott began studying classics at the University of Edinburgh in November 1783, at the age of 12, a year or so younger than most fellow students. In March 1786, aged 14, he began an apprenticeship in his father's office to become a Writer to the Signet. At school and university Scott had become a friend of Adam Ferguson, whose father Professor Adam Ferguson hosted literary salons.Lockhart, pp. 378–379. Scott met the blind poet Thomas Blacklock, who lent him books and introduced him to the Ossian cycle of poems by James Macpherson. During the winter of 1786–1787, a 15-year-old Scott met the Scots poet Robert Burns at one of these salons, their only meeting. When Burns noticed a print illustrating the poem \"The Justice of the Peace\" and asked who had written it, Scott alone named the author as John Langhorne and was thanked by Burns. Scott describes the event in his memoirs, where he whispers the answer to his friend Adam, who tells Burns;Lockhart, p. 38. another version of the event appears in Literary Beginnings. When it was decided that he would become a lawyer, he returned to the university to study law, first taking classes in moral philosophy (under Dugald Stewart) and universal history (under Alexander Fraser Tytler) in 1789–1790. During this second university spell Scott became prominent in student intellectual activities: he co-founded the Literary Society in 1789 and was elected to the Speculative Society the following year, becoming librarian and secretary-treasurer a year after.Hewitt, David (2004) \"Scott, Sir Walter (1771–1832)\", Oxford Dictionary of National Biography. ", "Nevertheless, Scott's importance as an innovator continued to be recognised. He was acclaimed as the inventor of the genre of the modern historical novel (which others trace to Jane Porter, whose work in the genre predates Scott's) and the inspiration for enormous numbers of imitators and genre writers both in Britain and on the European continent. In the cultural sphere, Scott's Waverley novels played a significant part in the movement (begun with James Macpherson's Ossian cycle) in rehabilitating the public perception of the Scottish Highlands and its culture, which had been formerly been viewed by the southern mind as a barbaric breeding ground of hill bandits, religious fanaticism, and Jacobite risings."]}, {"page": "1796", "response": ["* February 17 – James Macpherson, Scottish writer (b. 1736)"]}, {"page": "1736", "response": ["* October 27 –  James Macpherson, Scottish poet (d. 1796)"]}, {"page": "Deer", "response": ["The common male first name Oscar is taken from the Irish Language, where it is derived from two elements: the first, os, means \"deer\"; the second element, cara, means \"friend\". The name is borne by a famous hero of Irish mythology—Oscar, grandson of Fionn Mac Cumhail. The name was popularised in the 18th century by James Macpherson, creator of 'Ossianic poetry'."]}, {"page": "Fionn mac Cumhaill", "response": ["Finn mac Cumhal was transformed into the character \"Fingal\" in James Macpherson's poem cycle Ossian (1760), which Macpherson claimed was translated out of discovered Ossianic poetry written in the Scottish Gaelic language. \"Fingal\", derived from the Gaelic Fionnghall, was possibly Macpherson's rendering Fionn's name as Fingal based on a misapprehension of the various forms of Fionn. His poems had widespread influence on writers, from the young Walter Scott to Goethe, but there was controversy from the outset about Macpherson's claims to have translated the works from ancient sources. The authenticity of the poems is now generally doubted, though they may have been based on fragments of Gaelic legend, "]}, {"page": "Samuel Johnson", "response": ["On 6 August 1773, eleven years after first meeting Boswell, Johnson set out to visit his friend in Scotland, and to begin \"a journey to the western islands of Scotland\", as Johnson's 1775 account of their travels would put it. The work was intended to discuss the social problems and struggles that affected the Scottish people, but it also praised many of the unique facets of Scottish society, such as a school in Edinburgh for the deaf and mute. Also, Johnson used the work to enter into the dispute over the authenticity of James Macpherson's Ossian poems, claiming they could not have been translations of ancient Scottish literature on the grounds that \"in those times nothing had been written in the Earse [i.e. Scots Gaelic] language\". There were heated exchanges between the two, and according to one of Johnson's letters, MacPherson threatened physical violence. Boswell's account of their journey, The Journal of a Tour to the Hebrides (1786), was a preliminary step toward his later biography, The Life of Samuel Johnson. Included were various quotations and descriptions of events, including anecdotes such as Johnson swinging a broadsword while wearing Scottish garb, or dancing a Highland jig."]}, {"page": "List of poets", "response": ["*James Macpherson (1736–1796), Scottish writer and poet"]}, {"page": "Putney", "response": ["*James Macpherson, translator and author of the Ossian Poems"]}, {"page": "Scottish Enlightenment", "response": ["Blair was one of the figures who first drew attention to the Ossian cycle of James Macpherson to public attention.G. A. Kennedy, Classical Rhetoric and Its Christian and Secular Tradition Form Ancient to Modern Times (University of North Carolina Press, 1999), , p. 282. Macpherson (1736–96) was the first Scottish poet to gain an international reputation. Claiming to have found poetry written by the ancient bard Ossian, he published \"translations\" that were proclaimed as a Celtic equivalent of the Classical epics. Fingal, written in 1762, was speedily translated into many European languages, and its appreciation of natural beauty and treatment of the ancient legend has been credited more than any single work with bringing about the Romantic movement in European, and especially in German literature, through its influence on Johann Gottfried von Herder and Johann Wolfgang von Goethe.J. Buchan, Crowded with Genius (London: Harper Collins, 2003), , p. 163. Eventually it became clear that the poems were not direct translations from the Gaelic, but flowery adaptations made to suit the aesthetic expectations of his audience.D. Thomson, The Gaelic Sources of Macpherson's \"Ossian\" (Aberdeen: Oliver & Boyd, 1952).", "* James Macpherson (1736–1796) writer, author of Ossian"]}, {"page": "Colma, California", "response": ["There are several other proposed origins of Colma. Erwin Gudde's California Place Names states seven possible sources of the town's being called Colma: William T. Coleman (a local landowner), Thomas Coleman (a local resident), misspelling of Colmar in France, misspelling of Colima in Mexico, a re-spelling of an ancient Uralic word meaning death, a reference to James Macpherson's Songs of Selma, and two Ohlone possibilities, one meaning \"moon\" and one meaning \"springs\"."]}, {"page": "Ossian, Indiana", "response": ["Ossian is a town in Jefferson Township, Wells County, in the U.S. state of Indiana. The town was named after Ossian, the narrator of a cycle of epic poems by the Scottish poet James Macpherson. The population was 3,289 at the 2010 census."]}, {"page": "Ossian, New York", "response": ["Ossian is a town in Livingston County, New York, United States. The population was 789 at the 2010 census.  The town was named after Ossian, the blind narrator and purported 3rd Century author of a cycle of extremely popular epic poems published by the Scottish poet James Macpherson in 1761."]}, {"page": "Staffa", "response": ["Staffa's most famous feature is Fingal's Cave, a large sea cave located near the southern tip of the island some 20 m high and 75 m long formed in cliffs of hexagonal basalt columns. This cliff face is called the Colonnade or The Great Face and it was these cliffs and their caves that inspired Felix Mendelssohn's Die Hebriden (English: Hebrides Overture opus 26),FINGAL'S CAVE, OPUS 26, Program Notes by Rita Junker Pickar, 2002, Retrieved 21 October 2010. which was premiered in London in 1832.Program Notes: Mendelssohn: \"Hebrides\" Overture by Geoff Kuenning  ucla.edu. Retrieved 10 December 2006. The original Gaelic name for Fingal's Cave is An Uamh Bhin – \"the melodious cave\" – but it was subsequently renamed after the 3rd-century Irish warrior Fionn MacCool.Keay & Keay (1994) state that the re-naming was done by Banks, although showcaves.com states that Mendelssohn is blamed for the \"misnaming\".Bray (1996) p. 92 notes that James Macpherson's Fingal, an Ancient Epic Poem was a \"runaway bestseller\" in many European countries at the time, and that Banks may later have regretted his choice when it became clear that Macpherson's claims to have translated the work from an ancient Gaelic manuscript proved to be bogus. Mendelssohn was nonetheless inspired by the sound of the waves in the cave and waxed lyrical about his visit, claiming that he arrived in Scotland \"with a rake for folk-songs, an ear for the lovely, fragrant countryside, and a heart for the bare legs of the natives.\"The New Encyclopædia Britannica (1978) Chicago. Encyclopædia Britannica Inc."]}, {"page": "Prose poetry", "response": ["The German Romantics Jean Paul, Novalis, Friedrich Hölderlin, and Heinrich Heine may be seen as precursors of the prose poem.  Earlier, 18th-century European forerunners of prose poetry had included James Macpherson's \"translation\" of Ossian and Évariste de Parny's \"Chansons madécasses\"."]}, {"page": "William Stukeley", "response": ["In June 1747, Stukeley had received a letter from Charles Bertram, an Englishman living in Denmark. In their ensuing correspondence, Bertram claimed to possess a copy of a manuscript allegedly produced by a 14th-century monk from Winchester known as Richard of Cirencester, which in turn contained an account and map of Roman Britain. Stukeley expressed caution regarding Bertram's claims, asking for detailed information regarding the original manuscript's provenance, with Bertram responding that he could not provide any because he had been sworn to secrecy by the man who supplied him with it. Stukeley unsuccessfully attempted to buy the manuscript from Bertram, stating that he would deposit it in the library of the British Museum. In March and again in April 1756, Stukeley read papers on Bertram's manuscript to the Society of Antiquaries of London. He published these in 1757 as An Account of Richard of Cirencester, Monk of Westminster, and of his Works, which reproduced the map but not the text of the original manuscript, instead consisting of Stukeley's own commentary. At the time, many antiquarians regarded it as a genuine text, although a few had suspicions; in 1795, Thomas Reynolds declared that Bertram's document was a forgery, although this would only be widely recognised in the 19th century. This discovery damaged Stukeley's reputation among later scholars, bolstering his reputation for credulity. Stukeley had similarly been taken in by another forgery, James Macpherson's Ossian poems, writing to Macpherson in praise of his alleged discovery."]}, {"page": "1763 in literature", "response": ["*James Macpherson (as Ossian) – Temora"]}, {"page": "University of Aberdeen", "response": ["File:James Macpherson by George Romney.jpg|James Macpherson, writer, poet, politician, and 'translator' of the Ossian cycle of epic poems."]}, {"page": "1796 in literature", "response": ["*February 17 – James Macpherson, Scottish poet (born 1736) "]}, {"page": "1775 in literature", "response": ["*James Macpherson – The History of Great Britain"]}, {"page": "Thomas Chatterton", "response": ["He wrote hopefully to his mother and sister, and spent his first earnings in buying gifts for them. Wilkes had noted his trenchant style \"and expressed a desire to know the author\";Chatterton's letter to his mother dated 6 May 1770 quoted in Meyerstein 360 and Lord Mayor William Beckford graciously acknowledged a political address of his, and greeted him \"as politely as a citizen could.\"Chatterton's letter to his sister dated 30 May 1770 quoted in Meyerstein 372 He was abstemious and extraordinarily diligent. He could assume the style of Junius or Tobias Smollett, reproduce the satiric bitterness of Charles Churchill, parody James Macpherson's Ossian, or write in the manner of Alexander Pope or with the polished grace of Thomas Gray and William Collins.", "* Haywood, Ian. The making of history: a study of the literary forgeries of James Macpherson and Thomas Chatterton in relation to eighteenth-century ideas of history and fiction. Rutherford: Fairleigh Dickinson University Press, c1986."]}, {"page": "David Allan (painter)", "response": ["Returning from Rome in 1777, he lived for a time in London, and occupied himself with portrait-painting. In 1780 he removed to Edinburgh, where, on the death of Alexander Runciman in 1786, he was appointed director and master of the Academy of Arts. He set up at Writers Court next to the City Chambers.Williamson's Edinburgh Street Directory 1784 There he painted and etched in aquatint a variety of works, including those by which he is best known, such as Scotch Wedding, Highland Dance, Repentance Stool and his Illustrations of the Gentle Shepherd (based on Allan Ramsay's poem The Gentle Shepherd). He was sometimes called the \"Scottish Hogarth\", although he lacked Hogarth's satirical qualities. Among his students was Alexander Carse whose early works show Allan's influence.Lucy Dixon, \"Carse, Alexander (bap. 1770, d. 1843)\", Oxford Dictionary of National Biography, Oxford University Press, 2004; online edition, Oct 2006 accessed 12 Oct 2013 He also produced illustrations for a version of James Macpherson's Ossian poems."]}, {"page": "1736 in literature", "response": ["*October 27 – James Macpherson, Scottish writer, poet and politician (died 1796)"]}, {"page": "1758 in literature", "response": ["*James Macpherson – The Highlander"]}, {"page": "1760 in literature", "response": ["*James Macpherson as \"translator\" – Fragments of Ancient Poetry Collected in the Highlands of Scotland"]}, {"page": "1762 in literature", "response": ["*James Macpherson as \"Ossian\" – Fingal"]}, {"page": "1765 in literature", "response": ["*James Macpherson – The Works of Ossian"]}, {"page": "1773 in literature", "response": ["*James Macpherson – The Iliad"]}, {"page": "Hugh Blair", "response": ["* 1760: 'Preface' [Anon.] to James Macpherson, Fragments of Ancient Poetry collected in the Highlands of Scotland and translated from the Galic or Erse Language", "In 1763 Blair published A Critical Dissertation on the Poems of Ossian, his first well known openly authored publication. Blair, having long taken interest in the Celtic poetry of the Scottish Highlands, wrote a laudatory account of the poems of Ossian, the authenticity of which he maintained. Blair serves as the voice of authority on the legitimacy of the poems that he himself had urged friend James Macpherson to publish in Fragments of Ancient Poetry."]}, {"page": "Scottish literature", "response": ["In the early modern era royal patronage supported poetry, prose and drama. James V's court saw works such as Sir David Lindsay of the Mount's The Thrie Estaitis. In the late sixteenth century James VI became patron and member of a circle of Scottish court poets and musicians known as the Castalian Band. When he acceded to the English throne in 1603 many followed him to the new court, but without a centre of royal patronage the tradition of Scots poetry subsided. It was revived after union with England in 1707 by figures including Allan Ramsay and James Macpherson. The latter's Ossian Cycle made him the first Scottish poet to gain an international reputation. He helped inspire Robert Burns, considered by many to be the national poet, and Walter Scott, whose Waverley Novels did much to define Scottish identity in the nineteenth century. Towards the end of the Victorian era a number of Scottish-born authors achieved international reputations, including Robert Louis Stevenson, Arthur Conan Doyle, J. M. Barrie and George MacDonald.", "James Macpherson was the first Scottish poet to gain an international reputation, claiming to have found poetry written by Ossian, he published translations that acquired international popularity, being proclaimed as a Celtic equivalent of the Classical epics. Fingal written in 1762 was speedily translated into many European languages, and its deep appreciation of natural beauty and the melancholy tenderness of its treatment of the ancient legend did more than any single work to bring about the Romantic movement in European, and especially in German, literature, influencing Herder and Goethe. Eventually it became clear that the poems were not direct translations from the Gaelic, but flowery adaptations made to suit the aesthetic expectations of his audience."]}, {"page": "Given name", "response": ["Characters from fiction also seem to influence naming. After the name Kayla was used for a character on the American soap opera Days of Our Lives, the name's popularity increased greatly. The name Tammy, and the related Tamara became popular after the movie Tammy and the Bachelor came out in 1957. Some names were established or spread by being used in literature. Notable examples include Pamela, invented by Sir Philip Sidney for a pivotal character in his epic prose work, The Countess of Pembroke's Arcadia; Jessica, created by William Shakespeare in his play The Merchant of Venice; Vanessa, created by Jonathan Swift; Fiona, a character from James Macpherson's spurious cycle of Ossian poems; Wendy, an obscure name popularised by J. M. Barrie in his play Peter Pan, or The Boy Who Wouldn't Grow Up; and Madison, a character from the movie Splash. Lara and Larissa were rare in America before the appearance of Doctor Zhivago, and have become fairly common since."]}, {"page": "Scottish clan", "response": ["Most of the anti-clan legislation was repealed by the end of the eighteenth century as the Jacobite threat subsided, with the Dress Act restricting kilt wearing being repealed in 1782. There was soon a process of the rehabilitation of highland culture. By the nineteenth century, tartan had largely been abandoned by the ordinary people of the region, although preserved in the Highland regiments in the British army, which poor highlanders joined in large numbers until the end of the Napoleonic Wars in 1815.Roberts (2002) pp. 193-5.Sievers (2007), pp. 22-5. The international craze for tartan, and for idealising a romanticised Highlands, was set off by the Ossian cycle published by James Macpherson (1736–96).Morère (2004), pp. 75-6.Ferguson (1998), p. 227. Macpherson claimed to have found poetry written by the ancient bard Ossian, and published translations that acquired international popularity.Buchan (2003), p. 163. Highland aristocrats set up Highland Societies in Edinburgh (1784) and other centres including London (1788).Calloway (2008), p. 242. The image of the romantic highlands was further popularised by the works of Walter Scott. His \"staging\" of the royal visit of King George IV to Scotland in 1822 and the King's wearing of tartan, resulted in a massive upsurge in demand for kilts and tartans that could not be met by the Scottish linen industry. The designation of individual clan tartans was largely defined in this period and they became a major symbol of Scottish identity.Milne (2010), p. 138. This \"Highlandism\", by which all of Scotland was identified with the culture of the Highlands, was cemented by Queen Victoria's interest in the country, her adoption of Balmoral Castle as a major royal retreat from and her interest in \"tartenry\"."]}, {"page": "Johann Gottfried Herder", "response": ["* Selection from correspondence on Ossian and the songs of ancient peoples (1773) See also: James Macpherson (1736–1796)."]}, {"page": "British literature", "response": ["Other precursors of Romanticism are the poets James Thomson (1700–48) and James Macpherson (1736–96), the Gothic novel and the novel of sensibility.J. A. Cuddon, A Dictionary of Literary Rerms, p. 588; \"Pre-Romanticism.\" Encyclopædia Britannica. Encyclopædia Britannica Online Academic Edition. Encyclopædia Britannica Inc., 2012. Web. 5 October 2012. .", "James Macpherson (1736–96) was the first Scottish poet to gain an international reputation. Claiming to have found poetry written by the ancient bard Ossian, he published translations that acquired international popularity, being proclaimed as a Celtic equivalent of the Classical epics. Both Robert Burns (1759–96) and Walter Scott (1771–1832) were highly influenced by the Ossian cycle."]}, {"page": "Tartan", "response": ["By the 19th century the Highland romantic revival, inspired by James Macpherson's Ossian poems and the writings of Sir Walter Scott, led to wider interest, with clubs like the Celtic Society of Edinburgh welcoming Lowlanders.  The pageantry invented for the 1822 visit of King George IV to Scotland brought a sudden demand for tartan cloth and made it the national dress of the whole of Scotland, rather than just the Highlands and Islands, with the invention of many new clan-specific tartans to suit.Moncreiffe of that Ilk 1967: p. 24."]}, {"page": "William Henry Ireland", "response": ["William Henry also became a collector of books. In many later recollections Ireland described his fascination with the works and the glorious death of the forger Thomas Chatterton, and probably knew the Ossian poems of James Macpherson. He was strongly influenced by the 1780 novel Love and Madness by Herbert Croft, which was often read aloud in the Ireland house, and which contained large sections on Chatterton and Macpherson. When he was apprenticed to a mortgage lawyer, Ireland began to experiment with blank, genuinely old papers and forged signatures on them. Eventually he forged several documents until he was ready to present them to his father."]}, {"page": "1796 in music", "response": ["*February 17 – James Macpherson, librettist and writer (born 1736)"]}, {"page": "The Tale of Igor's Campaign", "response": ["After the only manuscript copy of the Tale was destroyed in the Napoleonic invasion of 1812, questions about its authenticity were raised, mostly because of its language. Suspicion was also fueled by contemporary fabrications (for example, the Songs of Ossian, proved to be written by James Macpherson). Today, majority opinion accepts the authenticity of the text, based on the similarity of its language and imagery with those of other texts discovered after the Tale."]}, {"page": "Byronic hero", "response": ["These lines echo William Wordsworth's treatment of James Macpherson's Ossian in \"Glen-Almain\" (1807):"]}]}}