{"wiki_id": "http://www.wikidata.org/entity/Q3121516", "itemLabel": "Guy Andrews", "itemDescription": "English TV/writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Guy_Andrews", "wikipedia_page": {"main": "Guy Andrews, educated at Cranleigh School (1974–79) and St. Peter's College, Oxford University, is an English television writer who has written for television programmes including \"Lost in Austen\", \"Absolute Power\", \"Agatha Christie's Poirot\", \"Chancer\" and \"Blandings\" (the latter adapting the works of P. G. Wodehouse).", "link_mentions": [{"page": "1995 in film", "response": ["| The Infiltrator || HBO Showcase || John Mackenzie (director); Guy Andrews (screenplay); Oliver Platt, Arliss Howard, Tony Haygarth, Michael Byrne, Julian Glover, George Jackos, Alex Kingston, Jonny Phillips, Peter Riegert, Alan King, Colin Stinton, Anne Reid, Christian Redi, Werner Dissel, Bernd Michael Lade, Sven Martinek, Celia Montague, George Raistrick || Thriller, Drama || Live action "]}, {"page": "Magnum Photos", "response": ["* Magnum Cycling. London: Thames & Hudson, 2016. With text by Guy Andrews. . English."]}, {"page": "Absolute Power (radio and TV series)", "response": ["The television programme was written by Guy Andrews, Mark Lawson and Andrew Rattenbury, and had the tag \"spin is dead, long live PR\". Unlike most radio to TV sitcom transfers, none of the TV episodes was based on a radio episode. There are many differences to the radio version. Prentiss McCabe is a much more powerful and respected organisation than in the radio series. Martin McCabe is much more worldly wise. The secret meetings with government representatives are gone and replaced with more cups of coffee with newspaper editors and private secretaries."]}, {"page": "Appointment with Death", "response": ["The novel was adapted for the eleventh season of the series Agatha Christie's Poirot starring David Suchet as Poirot. The screenplay was written by Guy Andrews and it was filmed in Casablanca (with Mahkama du Pacha acting as Hotel Constantine in the adaptation and Kasbah Boulaouane as the excavation site) and El Jadida, Morocco in May 2008. It was directed by Ashley Pearce, who also directed Mrs McGinty's Dead and Three Act Tragedy. The cast included Christina Cole, Tim Curry, John Hannah, Elizabeth McGovern and Zoe Boyle. The adaptation features a significant number of plot changes:"]}, {"page": "Bouquet of Barbed Wire", "response": ["The novel was adapted for ITV by Mammoth Screen,Media Guardian report 21 September 2009 as a three-part series broadcast by ITV on 6–20 September 2010. Adapted by Guy Andrews and directed by Ashley Pearce, it starred Trevor Eve as Peter Manson, Hermione Norris as Cassie Manson, Tom Riley as Gavin Sorenson and Imogen Poots as Prue Sorenson."]}, {"page": "Lost in Austen", "response": ["Lost in Austen is a four-part 2008 British television series for the ITV network, written by Guy Andrews as a fantasy adaptation of the 1813 novel Pride and Prejudice by Jane Austen. Amanda, a woman from modern London, enters the plot of the novel through a portal in her bathroom, to join the Bennet family and affect events disastrously."]}, {"page": "Tom Mison", "response": ["In 2008 he played Mr. Bingley in Lost in Austen, a fanciful adaptation of Pride and Prejudice. The four-part mini-series, written by Guy Andrews and broadcast on ITV, imagines a modern-day woman who is transported to the world of Pride and Prejudice, her favourite novel. The series was generally well received by critics."]}, {"page": "Guy (given name)", "response": ["* Guy Andrews, American television writer"]}, {"page": "Blandings (TV series)", "response": ["Blandings is a British comedy television series adapted by Guy Andrews from the Blandings Castle stories of P. G. Wodehouse. It was first broadcast on BBC One from 13 January 2013, and stars Timothy Spall, Jennifer Saunders, Jack Farthing, Tim Vine and Mark Williams."]}, {"page": "Ruth Barrett", "response": ["|Guy Andrews"]}]}}