{"wiki_id": "http://www.wikidata.org/entity/Q3129655", "itemLabel": "Helena Barlow", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Helena_Barlow", "wikipedia_page": {"main": "Helena Josephine Barlow (born 5 September 1998) is an English actress. She began her career as a child actress, playing Rose Granger-Weasley in Harry Potter and the Deathly Hallows – Part 2. In 2012, she starred as young Estella in Mike Newell's Great Expectations.", "link_mentions": [{"page": "List of Harry Potter cast members", "response": ["| Helena Barlow"]}, {"page": "List of supporting Harry Potter characters", "response": ["Rose is portrayed by Helena Barlow in Harry Potter and the Deathly Hallows – Part 2.  She also features in Harry Potter and the Cursed Child; she has been played in the West End production by Cherrelle Skeete and Helen Aluko."]}, {"page": "1998 in the United Kingdom", "response": ["* 5 September – Helena Barlow, actress"]}, {"page": "List of Horrid Henry characters", "response": ["Sour Susan is the arch-enemy of Rude Ralph, and the best friend of Moody Margaret. Mostly, Susan is feisty, immature, sassy and annoying. She is very tomboyish in the way she talks. She always has a sour look on her face and often says \"Yeah, Henry.\" when Margaret offends or annoys him. She acts as a budgie and sidekick to Moody Margaret, but often has fallouts with her. She has a baby sister called Vicious Vicky. In TV Series, she has orange hair and wears a lime dress with dark green effects. In Horrid Henry's Stinkbomb, she joins the Purple Hand Gang, and warns Henry about Margaret's stinkbomb. She is voiced by Joanna Ruiz and portrayed by Helena Barlow."]}, {"page": "List of British actors", "response": ["* Helena Barlow (born 1998)"]}, {"page": "Horrid Henry: The Movie", "response": ["* Helena Barlow as Sour Susan"]}, {"page": "Great Expectations (2012 film)", "response": ["** Helena Barlow as young Estella"]}, {"page": "Wizarding World", "response": ["| Helena Barlow"]}]}}