{"wiki_id": "http://www.wikidata.org/entity/Q3122104", "itemLabel": "Guy Richardson", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Guy_Richardson", "wikipedia_page": {"main": "Guy Colquhoun Richardson (8 September 1921 – 27 October 1965) was a British rower who competed in the 1948 Summer Olympics.\nRichardson was born at Guildford, Surrey; he was the son of Alexander Richardson, an army officer and Olympic medalist, and his wife Agnes Thackeray. He attended Cambridge University and in 1947 and 1948, he was a member of the victorious Cambridge crews in the Boat Races. Most of the Cambridge crew of 1948 also rowed for Leander Club at Henley Royal Regatta. The Leander eight were selected to row for Great Britain in the 1948 Summer Olympics and won the silver medal. Richardson died in a plane crash in 1965.", "link_mentions": [{"page": "University of Sussex", "response": ["The University has 15 Fellows of the Royal Society. These include Geoffrey Cloke (Inorganic Chemistry); Michael F. Land (Animal Vision – Frink Medal); Michael Lappert (Inorganic Chemistry); Alan Lehmann (Genetics and Genome Stability); John Murrell (Theoretical Chemistry); John Nixon (Inorganic Chemistry); Laurence Pearl (Structural Biology) and Guy Richardson (Neuroscience). Additionally, two of its faculty have received the Leontief Prize: Michael Lipton and Mariana Mazzucato."]}, {"page": "Great Britain at the 1948 Summer Olympics", "response": ["|  || Paul BircherJack DearloveMichael LapageBrian LloydPaul MasseyAlfred MellowsJohn MeyrickGuy Richardson || Rowing || Men's eight || ", "|align=left|Christopher BartonPaul BircherJack DearloveMichael LapageBrian LloydPaul MasseyAlfred MellowsJohn MeyrickGuy Richardson"]}, {"page": "List of Olympic medalists in rowing (men)", "response": ["|Christopher BartonMichael LapageGuy RichardsonPaul BircherPaul MasseyBrian LloydDavid MeyrickAlfred MellowsJack Dearlove"]}, {"page": "Rowing at the 1948 Summer Olympics", "response": ["|Christopher BartonMichael LapageGuy RichardsonPaul BircherPaul MasseyBrian LloydJohn MeyrickAlfred MellowsJack Dearlove"]}, {"page": "Alexander Richardson (bobsledder)", "response": ["Richardson's son Guy Richardson won a silver medal rowing at the 1948 Summer Olympics."]}, {"page": "Richardson (surname)", "response": ["*Guy Richardson (1921–1965), British rower"]}, {"page": "List of 1948 Summer Olympics medal winners", "response": ["|Chris BartonMichael LapageGuy RichardsonPaul BircherPaul MasseyBrian LloydJohn MeyrickAlfred MellowsJack Dearlove"]}]}}