{"wiki_id": "http://www.wikidata.org/entity/Q312691", "itemLabel": "Steve Howe", "itemDescription": "English guitarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Howe", "wikipedia_page": {"main": "Stephen James Howe (born 8 April 1947) is an English musician, songwriter and producer, best known as the guitarist in the progressive rock band Yes across three stints since 1970. Born in Holloway, North London, Howe developed an interest in the guitar and began to learn the instrument himself at age 12. He embarked on a music career in 1964, first playing in several London-based blues, covers, and psychedelic rock bands for six years, including the Syndicats, Tomorrow, and Bodast.\nUpon joining Yes in 1970, Howe helped to change the band's musical direction, leading to more commercial and critical success. His blend of acoustic and electric guitar helped shape the sound of the band. Many of their best-known songs were co-written by Howe, who remained with the band until they briefly disbanded in 1981. Howe returned to the group in 1990 for two years and has remained a full-time member since 1995.\nHowe achieved further success in the 1980s and beyond as a member of the rock bands Asia, GTR, and Anderson Bruford Wakeman Howe. He also has a prolific solo career, releasing 20 solo albums that reached varied levels of success and collaborated with artists such as Frankie Goes to Hollywood, Martin Taylor, and Queen. He continues to perform with Yes, as a member of his jazz group, the Steve Howe Trio, and as a solo act. In April 2017, Howe was inducted into the Rock and Roll Hall of Fame as a member of Yes.", "link_mentions": [{"page": "The Buggles", "response": ["In early 1980, Horn and Downes began work on a second Buggles album in London, working in a studio next door to that of the progressive rock band Yes, who had lost vocalist Jon Anderson and keyboardist Rick Wakeman following failed recording sessions for a potential new album. Horn, in particular, had been a long-standing fan of Yes. The Buggles offered a song to Yes, \"We Can Fly from Here\", but at the suggestion of Brian Lane, manager of both bands, Yes' bassist Chris Squire invited them to actually replace Anderson and Wakeman as members of Yes. Horn and Downes accepted the offer and joined Squire, Steve Howe and Alan White to record Drama.", "After leaving the Buggles, Downes joined his former Yes bandmate Steve Howe in forming the aforementioned supergroup Asia, together with John Wetton (formerly from King Crimson) and Carl Palmer (formerly from Emerson, Lake & Palmer), which made its name with the 1982 hit, Heat of the Moment. Downes remains a member of Asia today, being the only member to have stayed with the group since its beginning. Parallel to Asia, he also worked on other projects, including several solo albums and production of acts such as GTR. In 2011, Downes rejoined Yes as their keyboardist, working once again alongside Horn on the Fly from Here album and accompanying tour."]}, {"page": "Yes (band)", "response": ["Yes are  an English progressive rock band formed in London in 1968 by lead singer and frontman Jon Anderson, bassist Chris Squire, guitarist Peter Banks, keyboardist Tony Kaye and drummer Bill Bruford. The band has undergone numerous line-up changes throughout its history; 19 musicians have been full-time members. Since June 2015, it has consisted of guitarist Steve Howe, drummer Alan White, keyboardist Geoff Downes, singer Jon Davison, and bassist Billy Sherwood. Yes have explored several musical styles over the years and are most notably regarded as progressive rock pioneers.", "Following a tour of Scandinavia with the Faces, Yes performed a solo concert at the Queen Elizabeth Hall on 21 March 1970. The second half consisted of excerpts from their second album Time and a Word, accompanied by a 20-piece youth orchestra.Welch 2008, p. 77. Banks left the group on 18 April 1970, just three months before the album's release. Having expressed dissatisfaction with the idea of recording with an orchestra as well as the sacking of Flynn earlier in the year,Welch 2008, p. 80. Banks later indicated that he was fired by Anderson and Squire, and that Kaye and Bruford had no prior knowledge that it would be happening. Similar to the first album, Time and a Word features original songs and two new covers–\"Everydays\" by Buffalo Springfield and \"No Opportunity Necessary, No Experience Needed\" by Richie Havens. The album broke into the UK charts, peaking at number 45. Banks' replacement was Tomorrow guitarist Steve Howe, who appears in the photograph of the group on the American issue despite not having played on it.Welch, 2008, p. 89", "In September 2008 the remaining three members, eager to resume touring regardless of Anderson's availability, announced a tour billed as Steve Howe, Chris Squire and Alan White of Yes, with Oliver Wakeman on keyboards and new lead singer Benoît David, a Canadian musician who'd previously played with Mystery and with Yes tribute band Close to the Edge. Anderson expressed his disappointment that his former bandmates had not waited for his recovery, nor handled the situation \"in a more gentlemanly fashion,\" and while he wished them well, he referred to their ongoing endeavours as \"solo work\" and emphasised his view that their band \"is not Yes.\" As Anderson was a co-owner of the Yes trademark, the remaining members agreed not to tour with the Yes name. The In the Present Tour started in November 2008, but it was cut short in the following February when Squire required emergency surgery on an aneurysm in his leg. Touring resumed in June 2009 and continued through 2010, with Asia and Peter Frampton supporting the band at several shows. In October 2009, Squire declared that the new line-up \"is now Yes\" and their 2010 studio sessions would yield material eventually to be released as From a Page.", "In 2016 Yes performed Fragile and Drama in their entirety on their April–June European tour. Trevor Horn was a guest vocalist for two UK shows, singing \"Tempus Fugit\". For the subsequent North American tour between July and September of that year, the set was changed to include Drama and sides one and four of Tales from Topographic Oceans. White missed the latter to recover from back surgery; he was replaced by American drummer Jay Schellen. Dylan Howe, Steve's son, had originally been asked to be White's standby, but was prevented from being involved by visa problems.\"All My Yesterdays\", by Steve Howe, Omnibus Press, 2020, p. 290 White returned on a part-time basis in November for their 2016 Japanese tour; until the following February, Schellen continued to sit in for White on most shows, with White playing on some songs. The live album Topographic Drama – Live Across America, recorded on the 2016 tour, was released in late 2017 and marks Yes's first not to feature Squire. In February 2017, Yes toured the US which included their headline spot at Cruise to the Edge.", "* Steve Howe – guitars, vocals (1970–1981, 1990–1992, 1995–present)", "* 1975: Beginnings, by Steve Howe, with appearances by Bruford, White and Moraz", "* 1979: The Steve Howe Album, by Steve Howe, with appearances by Bruford, White and Moraz"]}, {"page": "Asia (band)", "response": ["Asia are  an English rock supergroup formed in London in 1981. The most commercially successful line-up was its original, which consisted of four members of different progressive rock bands that had enjoyed great success in the 1970s: lead vocalist and bassist John Wetton of King Crimson and U.K., guitarist Steve Howe of Yes, keyboardist Geoff Downes of Yes and The Buggles, and drummer Carl Palmer of Emerson, Lake & Palmer. Their debut album, Asia, released in 1982, remains their best selling album and went to number one in several countries.  The lead single from the album, \"Heat of the Moment\", remains their top charting and best-known song, reaching the top 40 in over a dozen markets and peaking in the U.S. at #4 on the Billboard Hot 100 and #1 on the Billboard Mainstream Rock chart.", "In early January 1981, Wetton and former Yes guitarist Steve Howe were brought together by A&R man John Kalodner and Geffen Records to start writing material for a new album. They were eventually joined by drummer Carl Palmer and finally by Howe's fellow member of Yes, keyboardist Geoff Downes. Two other players auditioned and considered during the band's formation were former The Move and ELO founder Roy Wood and the aforementioned guitarist/singer Trevor Rabin, who would end up replacing Steve Howe in a reformed Yes in 1983. Rabin, in a filmed 1984 interview included in the DVD 9012Live, said that his involvement with Asia never went anywhere because \"there was no chemistry\" among the participants.", "Following Lake's departure, Wetton was asked to return to Asia after his three-month absence; he returned on the condition that Steve Howe was ousted from the band. For a while, the group considered continuing as a three-piece without a permanent guitarist, inviting guest guitarists such as Jeff Beck and David Gilmour into the studio. Geffen Records suggested recruiting Krokus guitarist Mandy Meyer, who got on well with the band and was offered a permanent position: his playing style was more inclined to straightforward hard rock, thus changing the sound of the band.  Meanwhile, Howe went on to brief success with GTR (another supergroup, this one formed with former Genesis guitarist Steve Hackett, and produced by Downes).", "Following Downes' departure, on 9 May 2006, John Payne, Geoff Downes, John Wetton, Carl Palmer and Steve Howe contractually agreed that John Payne could continue his 15-year period with Asia as Asia Featuring John Payne. Asia featuring John Payne debuted in 2007 with Payne on vocals/bass, Guthrie Govan on guitar, Erik Norlander on keyboards and Jay Schellen on drums. Downes, Wetton, Palmer and Howe continued to perform and record as Asia thereafter.", "Downes and the other three original members (Wetton, Palmer and Howe) convened a group meeting in England in early 2006 in anticipation of formally reforming for work that year. And after a slew of rumours, they announced that this original lineup of Asia were planning a CD, DVD and world tour to celebrate the band's 25th anniversary. The band appeared in October 2006 on United States cable channel VH-1 Classic and began a world tour largely focused on the United States The band secured ownership of the Asia name and toured under the description of the Four Original Members of Asia. The set list featured most of the first album as well as a couple of songs from the second, along with one selection each from Yes, ELP, King Crimson and the Buggles to acknowledge the history of each member of the band. In a 2006 interview, guitarist Steve Howe states, \"This is the real Asia. There have been other incarnations of the band, but this is the one that the public truly embraced\".", "On 10 January 2013, Steve Howe announced his retirement from the band to focus on other projects, including Yes, bringing an end to the reunion of the original lineup. Asia in turn announced they would be continuing with new guitarist Sam Coulson, with a new album in the works entitled Gravitas. The new lineup performed live in 2013.", "On 2 April 2019, the band announced it would join Yes, John Lodge, and Carl Palmer's ELP Legacy as part of The Royal Affair Tour, a 26-date Summer 2019 North American joint tour, with founding guitarist Steve Howe rejoining the band for a portion of the set. The band also confirmed that Sam Coulson had amicably left Asia to focus on solo projects and that he'd be replaced as guitarist by Ron \"Bumblefoot\" Thal, specifically for the tour also took over lead vocals, with Sherwood remaining on bass but moving to backing vocals. Coulson confirmed his departure on Twitter the same day.", "The original line-up initially lasted from 1981 until 1983 when John Wetton left. It was reunited on two occasions: first, one year later when Wetton rejoined, but Steve Howe left before the band could work together again, and a second time in 2006, when Downes, then the last original member left, replaced the rest of the band with his original bandmates. This last original reunion lasted until 2013, when Howe left once again. Wetton died from cancer in 2017, making another reunion of the original lineup impossible.", "*Steve Howe – guitar, pedal steel guitar, mandolin, backing vocals (1981–1984, 1992–1993, 2006–2013, guest: 2000, 2019)"]}, {"page": "Rick Wakeman", "response": ["In late 1988, Wakeman received a call from Brian Lane who invited him to form Anderson Bruford Wakeman Howe with former Yes band members Jon Anderson, Bill Bruford and Steve Howe. Anderson wished to make an album that reflected Yes's 1970s sound and wanted to record on the island of Montserrat. The album was released in June 1989 and sold 750,000 copies. The band's world tour ran from July 1989 to March 1990. During the tour, Wakeman released two more solo albums: Black Knights at the Court of Ferdinand IV with Italian musician Mario Fasciano and Sea Airs, a sequel to Country Airs."]}, {"page": "Holloway, London", "response": ["* Steve Howe, (born 8 April 1947), guitarist with Yes and Asia; born and lived in Loraine Mansions, Widdenham Road, through his teen years."]}, {"page": "Who's on First?", "response": ["* The October 19, 2014 strip of the comic Pearls Before Swine sees Rat ask Goat, \"Whose drummer was Keith Moon?\" Goat responds that he is correct, although Rat does not understand that Goat is telling him Moon was the drummer for The Who. It leads to a routine of more confusions, including Charlie Watts of The Rolling Stones, Bob Weir of the Grateful Dead, Steve Howe of Yes, and Pete Townshend – also of The Who. Thinking Goat is asking what band Townshend is the guitarist for, an exasperated Rat screams, \"I don't know!\" Goat replies, \"Third base!\". The final panel sees the still-exasperated Rat threatening to hit the comic's author Stephan Pastis with a baseball bat, asking \"When would you like this hit?\". Pastis responds, \"Winwood's the guitarist for Traffic.\""]}, {"page": "Jon Anderson", "response": ["Despite his initial lack of instrumental skills, Anderson was strongly involved in the selection of successive Yes members chosen for their musicality - guitarist Steve Howe (who replaced Banks in 1970), Kaye's successive replacements Rick Wakeman and Patrick Moraz, and drummer Alan White, who replaced Bruford in 1972.", "In 1997, Anderson released the Celtic-influenced The Promise Ring with his second wife, Jane Luttenburger, sharing vocals. The album is a live recording of music performed by them and members of the Froggin' Peach Orchestra, the name given to a group of 28 musicians based in the Frog & Peach pub in San Luis Obispo. During their honeymoon in 1997, Anderson and Luttenburger recorded Earthmotherearth which was followed by The More You Know in 1998, recorded in Paris with French artist Francis Jocky. It was Anderson's last studio release for 13 years. Anderson appeared on the song \"The Only Thing I Need\"  by act 4Him in 1999; it was recorded for Streams, a multi-group album. Steve Howe's tribute album Portraits of Bob Dylan also featured a cover of the Bob Dylan song \"Sad Eyed Lady of the Lowlands\" with Anderson's vocals. He also recorded with the Fellowship on their album In Elven Lands, inspired by the works of J. R. R. Tolkien."]}, {"page": "Will-o'-the-wisp", "response": ["Several bands have written songs about or referring to wills-o'-the-wisp, such as Magnolia Electric Co., Verdunkeln, Leon Russell and Steve Howe. The will-o'-the-wisp is also referred to during the song \"Maria\" in The Sound of Music."]}, {"page": "Asia (Asia album)", "response": ["Asia's logo and cover artwork were created by Roger Dean, known for his work with Yes (of which guitarist Steve Howe and keyboard player Geoff Downes are currently members) and Uriah Heep (of which bassist/vocalist John Wetton had previously been a member). The debut album's art depicts a sea serpent gazing into a crystal orb. ", "*Steve Howe – guitars, vocals"]}, {"page": "Chris Squire", "response": ["While most of the band's lyrics were written by Anderson, Squire co-wrote much of their music with guitarist Steve Howe (with Anderson occasionally contributing). In addition, Squire and Howe would supply backing vocals in harmony with Anderson on songs such as \"South Side of the Sky\" and \"Close to the Edge\".", "As Squire, along with Alan White and Steve Howe, co-owned the \"Yes\" name at the time, the 1989 ABWH line-up without him (which contained Anderson, Bruford, Wakeman and Howe) could not record under that name.", "* 1973: Rick Wakeman - The Six Wives of Henry VIII (Steve Howe, Bill Bruford & Alan White)", "* 1993: Rick Wakeman - Classical Connections 2 (recorded in 1971 but published in 1991 with Steve Howe & Bill Bruford)"]}, {"page": "Gordon Giltrap", "response": ["1993 brought with it the fulfillment of a project which Giltrap had contemplated for some time. He had a vision of re-recording \"Heartsong\" with many of his well-known friends. These friends were Brian May, Steve Howe, Rick Wakeman, Midge Ure and Neil Murray. When completed, despite the quality of the recording, there was surprisingly little interest from record companies and it was two years before the track surfaced on an album.Perilous Journey. 2018, First edition, Steve Pilkington, p.153"]}, {"page": "Pat Smear", "response": ["Smear lists his influences as Joan Jett, Brian James, Brian May, and Steve Jones. He also stated that \"all the guitar playing\" of John McKay on Siouxsie and the Banshees's first album \"really inspired me\" and that Yes guitarist Steve Howe is \"the best guitarist ever\".NFC (September 2002). \"Interview with Pat Smear\". The Internet Nirvana Fan Club. Retrieved April 17, 2016. As a teenager in 1976, Smear and Darby Crash formed the Germs with bassist Lorna Doom and drummer Dottie Danger (the pseudonym of Belinda Carlisle who went on to front The Go-Go's). Smear was the only band member who had any musical knowledge or proficiency at the time. For most of his time in the Germs, Smear reported that he didn't own a guitar but rather \"just borrowed from whoever we were playing with\".Elias Fulmer (2014). Pat Smear Remembers Auditioning for Nirvana  Alternative Nation, December 8, 2014; accessed September 21, 2017"]}, {"page": "Close to the Edge", "response": ["By 1972, Yes had settled with a line-up of lead vocalist Jon Anderson, bassist Chris Squire, drummer Bill Bruford, guitarist Steve Howe, and keyboardist Rick Wakeman. In March 1972, they wrapped their six-month Fragile Tour of the UK and North America to support their fourth album, Fragile (1971). The album became their biggest commercial and critical hit since their formation, helped by the track \"Roundabout\" receiving considerable airplay on American radio. On 1 and 2 February 1972, during one of the tour's rest periods, the band booked time at Advision Studios in London to put down some tracks for a follow-up record. When touring finished, they took another break before they entered rehearsals at the Una Billings School of Dance in Shepherd's Bush in May 1972. Although some arrangements were worked out and put onto tape during this time, none of the tracks were fully written at this stage, leaving the group to devise the rest of the songs in the studio and learn to play them through afterwards. On several occasions the arrangements that Yes had started to assemble were so complex that they were forgotten by the time the next day's session began. This caused the band to record each rehearsal for future reference. Bruford devised the album's title to reflect the state of the band at the time.", "*Steve Howe – guitar, electric sitar,, page 40 backing vocals"]}, {"page": "Tales from Topographic Oceans", "response": ["After pitching the idea to guitarist Steve Howe, the two developed the album's themes and lyrics that took shape as a double album containing four side-long tracks based on each text. The album was negatively received by keyboardist Rick Wakeman, who disagreed with its structure and elaborate concept and felt unable to contribute to the music that had been written. It is the first Yes studio album to feature drummer Alan White, who had replaced Bill Bruford in the previous year.", "All music by Jon Anderson, Steve Howe, Chris Squire, Rick Wakeman, and Alan White.", "* Steve Howe – guitars, electric sitar, lute, backing vocals"]}, {"page": "Relayer", "response": ["In April 1974, the Yes line-up of singer Jon Anderson, bassist Chris Squire, guitarist Steve Howe, keyboardist Rick Wakeman, and drummer Alan White wrapped their 1973–1974 tour in support of their previous album, Tales from Topographic Oceans (1973). The album had been a success for the band, reaching number one in the UK for two weeks, and became the first to be certified gold by the British Phonographic Industry based solely on pre-orders. Despite the group's success, during recording, Wakeman informed the band of his decision to leave at its conclusion following his disagreements and frustration with the direction the band had taken with the album, with its esoteric concept and its double length which he believed caused the material to suffer as a result. Wakeman confirmed his departure in May 1974, and the news was made public on 8 June.", "*Steve Howe – acoustic and electric guitars, pedal steel, electric sitar, backing vocals"]}, {"page": "Ian Paice", "response": ["*2021 DMX - X Moves (Ft. Bootsy Collins & Steve Howe & Ian Paice)"]}, {"page": "Bill Bruford", "response": ["Bruford put Earthworks on hold in late 1988, after Jon Anderson invited him to play on a new album that also featured past Yes members Rick Wakeman and Steve Howe. Bruford was under the impression that he was performing on an Anderson solo album, but the four went on to become a group and named themselves Anderson Bruford Wakeman Howe (ABWH). Bruford later remarked that while ABWH could have been an interesting group had they been given time to develop instead of being pushed immediately into a recording studio, for him it was primarily a business-motivated arrangement which he took on so that he could pay for Earthworks. Bruford was attracted to the idea of recording on Montserrat, and convinced Anderson to have Tony Levin on bass. Anderson Bruford Wakeman Howe (1989) was supported by a world tour, and in 1990, while recording a second album, ABWH merged with Yes to become an eight-member formation. Union (1991), featuring tracks from both groups, was criticised by almost the entire band; Bruford called it \"the worst record I've ever been on\". He took part in the subsequent Union Tour in 1991 and 1992, and though he enjoyed the enthusiastic audiences in large venues and performing with former band mates, he found the experience \"pretty horrible\". After the tour, Bruford and Howe became involved in an orchestral project that reinterpreted Yes songs with an orchestra, entitled Symphonic Music of Yes (1993).", "Orchestral project with Steve Howe and Jon Anderson", "*Steve Howe – Beginnings (1975)", "*Steve Howe – The Steve Howe Album (1979)", "*Steve Howe – Turbulence (1991)"]}, {"page": "Tony Kaye (musician)", "response": ["During rehearsals for their next album, Fragile (1971), Kaye began to have problems with new guitarist Steve Howe who kept insisting the band expand their sound with electronic keyboards such as the Mellotron and synthesiser. Kaye disagreed with this approach and preferred organ and piano. As he frankly admitted in the 9012LIVE Interviews, Kaye was then 'fired' in August 1971 and replaced by Rick Wakeman who rerecorded some parts originally written by Kaye, including sections on \"Heart of the Sunrise\". Kaye later claimed Yes's manager Brian Lane gave him US$10,000 (approx. $62,000 in 2018 dollars) in exchange for all of his royalties, something Kaye later regretted.Kaye, Tony. 9012Live – Access All Areas from 9012Live [DVD] (2006).", "Kaye is known for his more simple, more supportive style of playing and avoids long and improvised solos. Yes biographer Tim Morse named Kaye a \"'gentleman of rock' for his polite demeanour and his distinguished looks\". Longtime Yes producer and mixer Eddy Offord named Kaye as one of the best Hammond organists. Guitarist Steve Howe named Kaye a \"good group member\" and praised his contributions to Yes. Geoff Downes said he had always admired Kaye's playing and the sound he got from the Hammond."]}, {"page": "Peter Banks", "response": ["Banks started with the Nighthawks in 1963, and played his first concert at the New Barnet Pop Festival before leaving that band to join the Devil's Disciples in 1964. The band consisted of Banks on guitar, John Tite on vocals, Ray Alford on bass and  Malcolm \"Pinnie\" Raye on drums. They recorded two songs on an acetate, Arthur Alexander's \"You Better Move On\" and Graham Gouldman's \"For Your Love\" which would be a hit record for the Yardbirds one year later. These two songs can be found on Banks' archival album Can I Play You Something. According to Chris Welch, The Devil's Disciples used to play the Rolling Stones' first album in its entirety, just for the sake of it. About a year later, Banks joined The Syndicats, replacing their guitarist Ray Fenwick, who himself had replaced Steve Howe, who would later replace Banks in Yes.", "The members searched for an appropriate name, Anderson suggested Life and Squire proposed World but all agreed on Banks' proposition of Yes. Atlantic Records took notice of the band and, in 1969, got them into a studio to record their first album, Yes. The next year another album was in progress (Time and a Word) but Anderson and Squire decided they wanted an orchestra backing the five musicians. The idea was not well received by Banks, and things got worse when the orchestral arrangements left the guitarist, as well as Tony Kaye, with little to do (strings replaced their parts almost note-for-note). Once the album was released, a tour ensued; Banks was asked to leave the group, playing his last concert with Yes on 18 April 1970 at The Luton College of Technology. He was replaced by Steve Howe.", "In Gibson Guitar's Lifestyle e-magazine of 3 February 2009, Banks is listed as one of the \"10 Great Prog Rock Guitarists\". According to the article, \"Before there was Steve Howe, there was Peter Banks. Artistic differences between Banks and singer Jon Anderson prompted Banks's departure from Yes in 1970, but in his little-known '70s band, Flash, Banks used an ES-335 to create several should-have-been prog rock classics. \"Lifetime\", from Flash's In the Can album, is his tour-de-force.\""]}, {"page": "90125", "response": ["In December 1980, the Yes line-up of bassist Chris Squire, guitarist Steve Howe, drummer Alan White, singer Trevor Horn, and keyboardist Geoff Downes, completed their 1980 tour in support of their tenth album, Drama. While the North American leg was largely successful, the subsequent UK leg received a mixed reaction feedback from the fans, many of whom were unaccepting of Horn and Downes as they had replaced Jon Anderson and Rick Wakeman respectively. The group disbanded in early 1981; Horn became a record producer, Howe and Downes co-formed the supergroup Asia, and Squire and White remained together and continued to write material, including their 1981 Christmas single \"Run with the Fox\". Later in 1981, the two entered sessions with Jimmy Page with the aim of forming a new band named XYZ, but the project was shelved over management differences and singer Robert Plant's disliking of the material. According to White, some ideas that the three had rehearsed ended up on 90125."]}, {"page": "Carl Palmer", "response": ["Following the first break-up of ELP in 1980, Palmer formed PM' with Texas blues rock guitarist John Nitzinger for one album before joining John Wetton and Steve Howe in early 1981, who had been brought together to form a new super-group. They were later joined by Geoff Downes to form Asia. The group was nominated at the 25th Annual Grammy Awards for Best New Artist, making them the second and last progressive rock band to achieve this feat. Palmer became only the second artist to be nominated twice for this award, after David Crosby. Palmer left Asia in 1991 to join the ELP reunion. After several personnel changes the four founding members of Asia including Palmer reunited in 2006."]}, {"page": "The Yes Album", "response": ["The Yes Album is the third studio album by English progressive rock band Yes, released on 19 February 1971 by Atlantic Records. It was the band's first album to feature guitarist Steve Howe, who replaced Peter Banks in 1970, as well as their last to feature keyboardist Tony Kaye until 1983's 90125.", "Anderson was worried about the initial response to the album, but after about a month noticed that fans started singing along at concerts, and concluded that this musical style could be developed and still remain popular. Kaye concluded that overall it was \"quite a simple album, considering where Yes went onto from there.\" Rush singer and bassist Geddy Lee included The Yes Album among his favourite albums. Genesis keyboardist Tony Banks has said it is his favourite Yes album and that he preferred the band when Kaye was a member. \"It was the addition of Steve Howe's guitar pyrotechnics that finally allowed Yes to find their true identity. The Yes Album is a giant leap forward,\" wrote J. D. Considine in The New Rolling Stone Album Guide.", "*Steve Howe – electric and acoustic guitars, vachalia, vocal"]}, {"page": "Alan White (Yes drummer)", "response": ["Due to various health problems, White missed a tour with Yes in 2016, with Jay Schellen substituting for him. Schellen and White then toured together into 2017. On summer 2017 touring, White was accompanied by Dylan Howe (son of guitarist Steve Howe), with Schellen returning to the role in early 2018.", "The band has played live (with various keyboardists) in the Seattle area. They were due to join the abortive More Drama Tour, scheduled to begin in North America in August 2005, with three acts: White, The Syn, and Steve Howe, with Yes members Chris Squire, Steve Howe and Geoff Downes playing Yes material at the end of the evening (with Currie handling lead vocals). However, the tour was cancelled shortly before it was due to begin. White later joined The Syn touring band for dates in the first half of 2006.", "*Rick Wakeman: The Six Wives of Henry VIII (1973) With Chris Squire, Bill Bruford & Steve Howe ", "*Steve Howe: Beginnings (1975) With Bill Bruford & Patrick Moraz", "*Steve Howe: The Steve Howe Album (1979) With Bill Bruford & Patrick Moraz", "*Johnny Harris: \"All To Bring You Morning\" (1973) With Jon Anderson & Steve Howe "]}, {"page": "America (Simon & Garfunkel song)", "response": ["The song was rearranged by the progressive rock band Yes in 1970, performing it in concert on the first tour after Steve Howe replaced Peter Banks. Yes added elements typical to progressive rock, such as changes in time signature and long instrumental segments, while dropping the song's original repeat and fade ending. At one point bassist Chris Squire quotes \"America\" from West Side Story in the intro. The Yes studio version clocks in at ten and a half minutes, with live versions on the 1970–1971 tour extended to more than fifteen minutes. The studio recording first appeared in 1972 on the sampler album The New Age of Atlantic and was later included on the compilation album Yesterdays in 1975, the box set In a Word: Yes (1969–) in 2002, and on the 2003 re-issue of their album Fragile. An edited version of this recording lasting 4 minutes was released as a single and hit No. 46 on the U.S. Billboard Hot 100. It also reached No. 20 in New Zealand. It also appeared on the Yesyears boxed set and its condensed version Yesstory, along with The Ultimate Yes: 35th Anniversary Collection. The edited version was also included as a bonus track on the 2003 re-issue of Close to the Edge, while the unedited studio version appears on Steven Wilson's 2013 remix of the same album. A live version of the song was included on 1996's Keys to Ascension as well as a performance from the final show of the 1970–1971 tour (which preceded the studio recording) on 2005's The Word Is Live.", "Guitarist Steve Howe considers Yes's version to be \"a kind of lost recording\" among the band's work, since it has rarely been included on their compilations, and when it is it is usually a shortened version. When he had the chance to meet Simon in person at a disaster-relief concert in 1992, Howe asked him if he liked Yes's version, and Simon said he did."]}, {"page": "Oliver Wakeman", "response": ["Wakeman worked with Steve Howe for several years (originally his father's bandmate in Yes and later as a bandmate when Oliver joined Yes himself). The two lived fairly close to each other in south-west England. Howe guested on Wakeman's solo album The 3 Ages of Magick, while Wakeman is on Howe's 2005 solo album Spectrum and contributed to Howe's recording of \"Australia\" for the US version of the Yes collection The Ultimate Yes: 35th Anniversary Collection.", "In 2008, the official Yes website announced that Oliver Wakeman would tour with Yes in the band's 40th anniversary tour. However, the tour was postponed due to the illness of Yes singer Jon Anderson. A revamped In the Present Tour featuring Steve Howe, Chris Squire and Alan White of Yes plus Oliver Wakeman and Canadian singer Benoît David (filling in for Anderson) began in the fall of 2008, and continued into 2009. The second leg of the tour was cancelled after one date when Squire had to have an urgent leg operation on 11 February.YesWorld: In the Present Tour ", "* The 3 Ages of Magick - Oliver Wakeman with Steve Howe - Resurgence 2001 (re-issue - Esoteric Recordings 2013)", "* Spectrum (Steve Howe) - keys on 4 tracks"]}, {"page": "John Petrucci", "response": ["Petrucci is respected for his variety of guitar styles and skills. One of the most notable of these is his high-speed alternate picking which, as he himself claims, requires a \"strong sense of synchronization between the two [playing] hands.\" He is notable for frequent use of the seven-string electric guitar, which he says he uses as a writing tool, taking advantage of the extended range for heavier riffing and to play extended range runs as part of a solo. Moreover, Petrucci often combines his metal shredding technique with a slower, emotive soloing style. His influences as a guitarist include Jimmy Page, Brian May, Eddie Van Halen, Steve Morse, Al Di Meola, Steve Howe, Allan Holdsworth, Stevie Ray Vaughan, Randy Rhoads, Joe Satriani, Steve Vai, Alex Lifeson, Yngwie Malmsteen and David Gilmour."]}]}}