{"wiki_id": "http://www.wikidata.org/entity/Q3124679", "itemLabel": "H. B. Parkinson", "itemDescription": "Film director, film producer", "wikipedia_url": "https://en.wikipedia.org/wiki/H._B._Parkinson", "wikipedia_page": {"main": "Henry Broughton Parkinson (29 September 1884 – 19 August 1970) was a British film pioneer. He produced 85 films between 1918 and 1930 and directed over 30 titles between 1920 and 1927.", "link_mentions": [{"page": "Mormonism in the 20th century", "response": ["* Trapped by the Mormons (also released as The Mormon Peril), a 1922 silent British anti-Mormon film directed by H. B. Parkinson, is released."]}, {"page": "Maritana", "response": ["Silent film versions of the opera were released in 1922, adapted by Frank Miller and directed by George Wynn,Maritana (1922) at Complete Index to World Film, accessed 27 October 2016; and  and 1927, directed by H. B. Parkinson., accessed 27 October 2016; and "]}, {"page": "Macbeth (1922 film)", "response": ["Macbeth is a black and white 1922 film adaptation of the William Shakespeare play Macbeth. It was the last silent film version of that play produced, and the eighth film adaptation of the play. It was directed by H. B. Parkinson and produced by Frank Miller.", "Category:Films directed by H. B. Parkinson"]}, {"page": "The Law Divine", "response": ["The Law Divine is a 1920 silent British crime film directed by H. B. Parkinson and Challis Sanderson. The film is considered to be lost.", "Category:Films directed by H. B. Parkinson"]}, {"page": "H.B. Parkinson", "response": ["#REDIRECTH. B. Parkinson"]}, {"page": "Married to a Mormon", "response": ["Married to a Mormon is a 1922 silent British drama film directed by H. B. Parkinson and starring Evelyn Brent, Clive Brook and George Wynn. The film is anti-Mormon and involves the taking of young virginal English women to Utah to become wives. It is considered to be a lost film.", "Category:Films directed by H. B. Parkinson"]}, {"page": "Trapped by the Mormons", "response": ["Trapped by the Mormons (also released as The Mormon Peril) is a 1922 silent British drama film directed by H. B. Parkinson and starring Evelyn Brent. This anti-Mormon film involves the taking of young virginal English women to Utah to become wives. The film survives in several archives, and a copy of the film has been released on video.", "Category:Films directed by H. B. Parkinson"]}, {"page": "H.B. Parkinson Films", "response": ["#REDIRECTH. B. Parkinson"]}, {"page": "List of British films of 1920", "response": ["|Law Divine||H. B. Parkinson, Challis Sanderson||Eva Moore, Evelyn Bent||Crime||"]}, {"page": "List of British films of 1922", "response": ["|Married to a Mormon||H. B. Parkinson||Evelyn Brent, Clive Brook||Drama||", "|Trapped by the Mormons || H. B. Parkinson || Evelyn Brent, Louis Willoughby || Drama ||"]}]}}