{"wiki_id": "http://www.wikidata.org/entity/Q312532", "itemLabel": "Ian Kershaw", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Kershaw", "wikipedia_page": {"main": "Sir Ian Kershaw  (born 29 April 1943) is an English historian whose work has chiefly focused on the social history of 20th-century Germany. He is regarded by many as one of the world's leading experts on Adolf Hitler and Nazi Germany, and is particularly noted for his biographies of Hitler.He was the leading disciple of the German historian Martin Broszat, and until his retirement, he was a professor at the University of Sheffield. Kershaw has called Broszat an \"inspirational mentor\" who did much to shape his understanding of Nazi Germany. Kershaw served as historical adviser on numerous BBC documentaries, notably The Nazis: A Warning from History and War of the Century. He taught a module titled \"Germans against Hitler\".", "link_mentions": [{"page": "Fascism", "response": ["Historians, political scientists, and other scholars have long debated the exact nature of fascism. Historian Ian Kershaw once wrote that \"trying to define 'fascism' is like trying to nail jelly to the wall.\" Each different group described as fascist has at least some unique elements, and many definitions of fascism have been criticized as either too broad or too narrow. According to many scholars, fascism—especially once in power—has historically attacked communism, conservatism, and parliamentary liberalism, attracting support primarily from the far right.; ; ; ; ; ; Laclau (1977);  One common definition of the term, frequently cited by reliable sources as a standard definition, is that of historian Stanley G. Payne."]}, {"page": "Kellogg–Briand Pact", "response": ["The popular perception of the Kellogg-Briand Pact was best summarized by Eric Sevareid who, in a nationally televised series on American diplomacy between the two world wars, referred to the pact as a \"worthless piece of paper\". In his history of Europe from 1914 to 1948, historian Ian Kershaw referred to the Pact as \"vacuous\" and said that it was \"a dead letter from the moment it was signed.\""]}, {"page": "Mein Kampf", "response": ["The historian Ian Kershaw points out that several passages in  are undeniably of a genocidal nature.Ian Kershaw, Hitler 1889-1936 Hubris (1999), p. 258 Hitler wrote \"the nationalization of our masses will succeed only when, aside from all the positive struggle for the soul of our people, their international poisoners are exterminated\",Adolf Hitler, Mein Kampf, Volume One - A Reckoning, Chapter XII: The First Period of Development of the National Socialist German Workers' Party and he suggested that, \"If at the beginning of the war and during the war twelve or fifteen thousand of these Hebrew corrupters of the nation had been subjected to poison gas, such as had to be endured in the field by hundreds of thousands of our very best German workers of all classes and professions, then the sacrifice of millions at the front would not have been in vain.\"Adolf Hitler, Mein Kampf, Volume Two - A Reckoning, Chapter XV: The Right of Emergency Defense, p. 984, quoted in "]}, {"page": "White supremacy", "response": ["Nazi Germany promulgated white supremacy based on the belief that the Aryan race, or the Germans, were the master race. It was combined with a eugenics programme that aimed for racial hygiene through compulsory sterilization of sick individuals and extermination of Untermenschen (\"subhumans\"): Slavs, Jews and Romani, which eventually culminated in the Holocaust.Gumkowski, Janusz; Leszczynski, Kazimierz; Robert, Edward (translator) (1961). Hitler's Plans for Eastern Europe (PAPERBACK). Poland Under Nazi Occupation (First ed.) (Polonia Pub. House). p. 219. ASIN B0006BXJZ6. Retrieved March 12, 2014. at Wayback machine.Peter Longerich (April 15, 2010). Holocaust: The Nazi Persecution and Murder of the Jews. Oxford University Press. p. 30. .Ian Kershaw, Hitler: A Profile in Power, Chapter VI, first section (London, 1991, rev. 2001)Snyder, S. & D. Mitchell. Cultural Locations of Disability. University of Michigan Press. 2006."]}, {"page": "Weimar Republic", "response": ["The German peace delegation in France signed the Treaty of Versailles, accepting mass reductions of the German military, the prospect of substantial war reparations payments to the victorious allies, and the controversial \"War Guilt Clause\". Explaining the rise of extreme nationalist movements in Germany shortly after the war, British historian Ian Kershaw points to the \"national disgrace\" that was \"felt throughout Germany at the humiliating terms imposed by the victorious Allies and reflected in the Versailles Treaty...with its confiscation of territory on the eastern border and even more so its 'guilt clause'.\" Adolf Hitler repeatedly blamed the republic and its democracy for accepting the oppressive terms of this treaty. The Republic's first Reichspräsident (\"Reich President\"), Friedrich Ebert of the SPD, signed the new German constitution into law on 11 August 1919."]}, {"page": "1943", "response": ["* April 29 – Sir Ian Kershaw, English historian "]}, {"page": "Axis powers", "response": ["Historian Ian Kershaw suggests that this declaration of war against the United States was a serious blunder made by Germany and Italy, as it allowed the United States to join the war in Europe and North Africa without any limitation. On the other hand, American destroyers escorting convoys had been effectively intervening in the Battle of the Atlantic with German and Italian ships and submarines, and the immediate war declaration made the Second Happy Time possible for U-boats. Franklin D. Roosevelt had said in his Fireside Chat on 9 December 1941 that Germany and Italy considered themselves to be in a state of war with the United States. Plans for Rainbow Five had been published by the press early in December 1941, and Hitler could no longer ignore the amount of economic and military aid the US was giving Britain and the USSR."]}, {"page": "Sacha Baron Cohen", "response": ["Baron Cohen, the grandson of a Holocaust survivor, says he also wishes in particular to expose the role of indifference in that genocide. \"When I was in university, there was this major historian of the Third Reich, Ian Kershaw, who said, 'The path to Auschwitz was paved with indifference.' I know it's not very funny being a comedian talking about the Holocaust, but it's an interesting idea that not everyone in Germany had to be a raving anti-Semite. They just had to be apathetic.\" Regarding the enthusiastic response to his song, \"In My Country There Is Problem\" (also known as \"Throw the Jew Down the Well\"), he says, \"Did it reveal that they were anti-Semitic? Perhaps. But maybe it just revealed that they were indifferent to anti-Semitism.\""]}, {"page": "Seven deadly sins", "response": ["The term has been used to analyse and make sense of the actions of contemporary heads of government by Ian Kershaw (1998), Peter Beinart (2010) and in a much more physiological manner by David Owen (2012). In this context the term has been used to describe how certain leaders, when put to positions of immense power, seem to become irrationally self-confident in their own abilities, increasingly reluctant to listen to the advice of others and progressively more impulsive in their actions.", "The proverb \"pride goeth (goes) before destruction, a haughty spirit before a fall\" (from the biblical Book of Proverbs, 16:18)(or pride goeth before the fall) is thought to sum up the modern use of pride. Pride is also referred to as \"pride that blinds,\" as it often causes a committer of pride to act in foolish ways that belie common sense. In other words, the modern definition may be thought of as, \"that pride that goes just before the fall.\" In his two-volume biography of Adolf Hitler, historian Ian Kershaw uses both 'hubris' and 'nemesis' as titles. The first volume, Hubris, describes Hitler's early life and rise to political power. The second, Nemesis, gives details of Hitler's role in the Second World War, and concludes with his fall and suicide in 1945."]}, {"page": "Denazification", "response": ["British historian Ian Kershaw in his book The \"Hitler Myth\": Image and Reality in the Third Reich writes about the various surveys carried out at the German population:"]}, {"page": "Edith Cavell", "response": ["In 1906 she took a temporary post as matron of the Manchester and Salford Sick and Poor and Private Nursing Institution and worked there for about nine months. While there she worshipped at Sacred Trinity Church on Chapel Street, Salford and her name is included on the church war memorial. On the centenary of her execution, an event funded by the University of Salford took place at Sacred Trinity where historian Sir Ian Kershaw and Christine Hallett of the UK Centre for the History of Nursing and Midwifery, spoke."]}, {"page": "Holocaust denial", "response": ["The British historian Ian Kershaw has argued that Nolte was operating on the borderlines of Holocaust denial with his implied claim that the \"negative myth\" of the Third Reich was created by Jewish historians, his allegations of the domination of Holocaust scholarship by \"biased\" Jewish historians, and his statements that one should withhold judgment on Holocaust deniers, whom Nolte takes considerable pains to stress are not exclusively Germans or fascists.Kershaw, Ian The Nazi Dictatorship: Problems and Perspectives of Interpretations, London: Arnold, 1989 page 176 In Kershaw's opinion, Nolte is attempting to imply that perhaps Holocaust deniers are on to something."]}, {"page": "Werwolf", "response": ["According to Biddiscombe \"the threat of Nazi partisan warfare had a generally unhealthy effect on broad issues of policy among the occupying powers. As well, it prompted the development of draconian reprisal measures that resulted in the destruction of much German property and the deaths of thousands of civilians and soldiers\". Ian Kershaw states that fear of Werwolf activities may have motivated atrocities against German civilians by Allied troops during and immediately after the war.Kershaw, Ian. The End: Hitler's Germany 1944–45, Allen Lane, 2011. "]}, {"page": "Bloody Sunday (1939)", "response": ["Goebbels' Propaganda Ministry heavily exploited the events to try to gain support in Germany for the invasion. Reports from the press and newsreels showed Polish violence against the German minority in Poland. Goebbels had initially estimated that 5,400 Germans had been killed during Bloody Sunday but in 1940 increased the estimate to 58,000 which was subsequently published in the pamphlet \"Polish Atrocities Against the German Minority in Poland\" which convinced most Germans for the invasion and fueled more hatred against the Poles. As British historian Ian Kershaw wrote:"]}]}}