{"wiki_id": "http://www.wikidata.org/entity/Q3129345", "itemLabel": "Tommy Knight", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Tommy_Knight", "wikipedia_page": {"main": "Thomas Lawrence Knight (born 22 January 1993), usually credited as Tommy Knight, is an English actor best known for playing Luke Smith in The Sarah Jane Adventures and Doctor Who, Kevin Chalk in Waterloo Road, murder victim Caleb \"Cal\" Bray in Glue and Brodie in Victoria.", "link_mentions": [{"page": "Sontaran", "response": ["The Sontarans are mentioned in the audio book Wraith World, when Clyde Langer (Daniel Anthony) remarks he cannot understand why Luke Smith (Tommy Knight) and Rani Chandra (Anjli Mohindra) would want to read about made up adventures, when they have faced Sontarans."]}, {"page": "Chatham, Kent", "response": ["*Tommy Knight, actor"]}, {"page": "List of Doctor Who supporting characters", "response": ["*Luke Smith (Tommy Knight)The Sarah Jane Adventures co-starring character Luke Smith appears in the Tenth Doctor episodes \"The Stolen Earth\", \"Journey's End\", and \"The End of Time\". His name is additionally shown on-screen in a newspaper in \"Turn Left\", in which he is reported killed in a Doctor-less version of the events of \"Smith and Jones\"."]}, {"page": "Sarah Jane Smith", "response": ["In The Sarah Jane Adventures, Sarah Jane investigates alien activity covertly from her manor house in Bannerman Road in Ealing, driving an emerald green Nissan Figaro and with the help of her sentient supercomputer Mr Smith (voice of comedian Alexander Armstrong), as well as an alien activity scanner and sonic lipstick device. In the special premiere episode \"Invasion of the Bane\" (2007), Sarah Jane adopts a son: Bane creation, genetic archetype and boy genius Luke Smith (Tommy Knight), and befriends her neighbour Maria Jackson (Yasmin Paige) during her investigation of Bane leader Mrs Wormwood (Samantha Bond). Sarah Jane remarks that since meeting them she is no longer content to live alone; she discloses she never married after parting from the Fourth Doctor, to whom no one could ever compare. Sometime between \"School Reunion\" and \"Invasion of the Bane\", K9 has left Sarah Jane to close off a black hole, occasionally passing close enough to contact her; due to the concurrent development of the K-9 television series, to which creator Bob Baker owns the rights, K9 only appears in two episodes of the first series. In the first series, Sarah Jane learns how to be a mother to Luke, the while strengthening her friendship with teenage neighbour Maria, the person Sarah Jane \"trusts the most\". Along with Luke and his friend Clyde Langer (Daniel Anthony) they defeat and repel various threats to the contemporary Earth. Amongst these threats, series one introduces The Trickster (Paul Marc Davis), a cosmic being who makes alterations to the timeline to cause chaos and destruction; he becomes a recurring adversary for Sarah Jane. Sarah Jane finds a new enemy in the Slitheen, a family of criminal aliens originally seen in Doctor Who, and an ally in alien research scientist Professor Rivers (Floella Benjamin). Time travel scenes also depict 13-year-old Sarah Jane (Jessica Ashworth), for whom the death of her best friend Andrea Yates (Jane Asher) gave Sarah Jane her resolve to fight against loss of life."]}, {"page": "K9 (Doctor Who)", "response": ["After debuting in the final scene of \"School Reunion\" (2006), K9 Mark IV returned in spin-off series The Sarah Jane Adventures' premiere episode \"Invasion of the Bane\", where due to licensing issues with creator Bob Baker it is explained that K9 is sealing a black hole and can only communicate briefly and infrequently with Sarah Jane. The character makes an heroic appearance in the first series finale The Lost Boy, to do battle with rogue alien supercomputer Mr Smith (Alexander Armstrong), demonstrating new CGI teleportation and hovering features.  K9 Mark IV's interfaces include at least one USB port. Subsequently, the character appears briefly in the Doctor Who series four series finale \"Journey's End\" (2008), wherein K9 and Mr Smith assist the Doctor in returning Earth to its proper position. K9 next appears in the comedic Red Nose Day 2009 Sarah Jane mini-episode \"From Raxacoricofallapatorius with Love\". A deal with the creators of K9 having been struck, K9 Mark IV became a regular character in The Sarah Jane Adventures in third series story, The Mad Woman in the Attic (2009), until the series four premiere The Nightmare Man (2010), where he accompanies departing series regular, Sarah Jane's adoptive son Luke Smith (Tommy Knight), to university. He appears again in series four finale, Goodbye, Sarah Jane Smith. Though he doesn't appear in the serial, it is mentioned in The Man Who Never Was (2011) that Luke invented a special dog whistle to summon him with."]}, {"page": "Tenth Doctor", "response": ["In lieu of a 2009 series, Tennant appears as the Tenth Doctor, without a regular companion, in several special episodes over the course of 2008 and 2009, the last of which aired on New Year's Day, 2010.  In the Christmas special \"The Next Doctor\", The Doctor mistakenly believes he has met a later incarnation of himself in an amnesiac Londoner (David Morrissey), with whom he saves Victorian-era London. \"Planet of the Dead\" (Easter 2009) features jewel thief Lady Christina de Souza (Michelle Ryan) as The Doctor's one-off companion, and The Doctor is presented with a prophecy of his imminent death, with a woman telling him 'he will knock four times'. Tennant makes a crossover appearance in a The Sarah Jane Adventures two-parter, \"The Wedding of Sarah Jane Smith\", in which a powerful being known as The Trickster (Paul Marc Davis) also alludes to the Tenth Doctor's impending demise. In \"The Waters of Mars\", The Doctor tries to alter history and avert the death of one-off companion Adelaide Brooke (Lindsay Duncan); when she commits suicide, he begins to feel his mortality weigh down upon him. In the animated serial Dreamland, The Doctor is joined by two one-off companions in 1950s Roswell, New Mexico. In the two-part send-off \"The End of Time\", The Doctor confronts the Ood about their original prophecy and is led to contemporary Earth where, in the second part, the again-resurrected Master restores Gallifrey and the Time Lords to existence, although he redeems himself by assisting The Doctor to defeat Time Lord President Rassilon (Timothy Dalton) before disappearing alongside the other Time Lords. However, Wilfred finds himself trapped in a chamber that is about to be flooded with radiation. He knocks on the glass door four times, fulfilling the prophecy of the Doctor's death. The Doctor sacrifices his life to prevent Wilfred's death, exposing himself to 500,000 rads of deadly radiation and triggering his regeneration. He holds it back and is shown visiting several companions. He gives Donna a winning lottery ticket on her wedding day, buying it with money he borrowed from her late father in the past, saves Martha and Mickey from a Sontaran sniper, saves Sarah Jane's son Luke (Tommy Knight) from a car, introduces Jack to a romantic interest (Russell Tovey), and finally, just before regenerating into the Eleventh Doctor (Matt Smith), he informs Rose in 2005 that she is about to have a \"great year\". As he begins regenerating once in the TARDIS, his last words are \"I don't want to go\"."]}, {"page": "Sir Joseph Williamson's Mathematical School", "response": ["* Tommy Knight, actor, Luke Smith in The Sarah Jane Adventures, Waterloo Road (TV series)"]}, {"page": "1993 in the United Kingdom", "response": ["* 22 January – Tommy Knight, actor"]}, {"page": "The Sarah Jane Adventures", "response": ["For the tenth anniversary of the show, an event was held 29 July 2017 at Cardiff University Students' Union, with proceeds going to Ty Hafan Hospice for Children. A total of £6643.35 was raised by the sale of tickets to the event and merchandise. Members of the cast and crew that took part in the event were Tommy Knight, Anjli Mohindra, Yasmin Paige, Sinead Michael, Mina Anwar, Katy Manning, Paul Marc Davis, Phil Ford, Gary Russell, Joe Lidster, Sam Watts, Richard Wisker, Cheryl Rowlands, Scott Handcock, Brian Miller, John Leeson, Mat Irvine and Chris Johnson. The event was recorded and was released onto DVD and Blu-ray and could be bought exclusively through the event's website.", "In addition to Sladen, the first series of the programme stars Yasmin Paige as Maria Jackson, Sarah Jane's 13-year-old neighbour in Ealing, west London, and Tommy Knight as a boy named Luke, who is adopted by Sarah Jane at the conclusion of the introductory story. The third member of Sarah Jane's young entourage is 14-year-old called Clyde Langer, played by Daniel Anthony, who is introduced in the first episode of the proper series. Actress Porsha Lawrence Mavour briefly played Maria's friend, Kelsey Harper, in the 2007 New Year's Day special Invasion of the Bane which was created before the start of the series. Maria and her family are written out of the series in the first story of the second series, The Last Sontaran, but Maria and her father return briefly in the second part of The Mark of the Berserker. In the second story of that series, The Day of the Clown, several new regular cast members are introduced: Rani Chandra and her parents, Haresh, and Gita (played by Anjli Mohindra, Ace Bhatti, and Mina Anwar, respectively).", "| Tommy Knight || Luke Smith || colspan=3  || colspan=1  || colspan=1 ", "The story acted as an epilogue to the series narrated by Jacob Dudman and featured Tommy Knight, Daniel Anthony, Anjli Mohindra, Katy Manning, Mina Anwar all in their respective roles from the series and also included Sophie Aldred, who portrayed Ace, a companion to the Seventh Doctor. The episode's credits thanked Sacha Dhawan, Scott Handcock and Stuart Humphryes.", "|From Raxacoricofallapatorious with Love (accessed via a quiz), Me & My Movie with Tommy Knight (behind the scenes clips), CBBC trailers, Character, Tools & Alien profiles, Photo galleries."]}, {"page": "Yasmin Paige", "response": ["In 2014, she had the main role in the Jack Thorne drama Glue. The series saw her reunite with her Sarah Jane Adventures co-star Tommy Knight."]}, {"page": "Invasion of the Bane", "response": ["Elisabeth Sladen previously played Sarah Jane between 1973 and 1976. In 1981, she was offered the role again to ease the transition between the Fourth and Fifth Doctors, which she declined, but agreed to star in the pilot (and only episode) for the spin-off series K-9 and Company, which brought her together with K-9, another popular character. After her appearance in The Five Doctors in 1983, she temporarily stopped acting in order to raise her family, but lent her voice to several Big Finish audio productions . She returned to Doctor Who in the aptly titled Tenth Doctor episode, \"School Reunion\". Sladen and Tommy Knight have also appeared as Sarah Jane and Luke Smith in the series 4 finale, \"The Stolen Earth\"/\"Journey's End\", and in the second and final part of David Tennant's swan song as the Tenth Doctor, \"The End of Time\"."]}, {"page": "Judoon", "response": ["In The Sarah Jane Adventures Series 3-story, Prisoner of the Judoon (2009), Captain Tybo, a Judoon, crashes on Earth while his prisoner, Androvax the Annihilator, escapes, leaving Tybo hunting for him. He is knocked unconscious by Androvax and saved by Sarah Jane Smith (Elisabeth Sladen) and her companions, who helped him find Androvax who, as a veil form, has the ability to possess people; he uses this to possess Sarah Jane. Captain Tybo commandeers a London Metropolitan Police car and goes to Bannerman Road where he receives a call that more Judoon are coming. When Tybo and the gang go in they find that Sarah Jane has ordered her supercomputer Mr Smith (voiced by Alexander Armstrong) to explode in 60 seconds, but her adoptive son Luke Smith (Tommy Knight) stops him by reminding him that he is programmed to protect the planet. Tybo goes to the genetic system and regroups with the rest of the Judoon, finds Androvax and takes him back to the Shadow Proclamation. Despite the Judoon's nominal lack of jurisdiction on Earth, Tybo aggressively enforces English car radio volume limits and once points his machine gun at the driver of a nearby car whose music was too loud. Additionally, he and his colleagues summarily sentence Clyde Langer (Daniel Anthony) and Rani Chandra (Anjli Mohindra) to restriction to Earth as punishment for their interference."]}, {"page": "Luke Smith (The Sarah Jane Adventures)", "response": ["Luke Smith is a fictional regular character played by Tommy Knight in the British children's science fiction television series The Sarah Jane Adventures, a spin-off of the long-running series Doctor Who. Luke is a regular character in The Sarah Jane Adventures both in television and audio adventures. He has also appeared in three episodes of Doctor Who: the two-parter \"The Stolen Earth\"/\"Journey's End\" (2008), and the Tenth Doctor's finale episode \"The End of Time, Part Two\" (2010).", "Following this, Series 2 of The Sarah Jane Adventures (2008) sees Luke part ways with Maria when she moves to America in The Last Sontaran, and befriend investigative new girl Rani Chandra (Anjli Mohindra) who comes to discover the extraterrestrial activities that he, Clyde and his mother are involved with in The Day of the Clown. In the Series 2 serial, The Temptation of Sarah Jane Smith, Luke meets his grandparents in a time travel plot set up by the Trickster. In Series 3's The Mad Woman in the Attic (2009), an alien shows Luke a vision of the future in which he appears to be graduating from university at a young age. He meets the Doctor in person for the first time in The Wedding of Sarah Jane Smith and assists him in defeating the Trickster for a third time. Luke is entirely absent from the two-parter The Eternity Trap due to Tommy Knight's real-life school exams. In the series finale The Gift, Luke and Sarah's relationship becomes at times strained by the difficulties of parenting a teenager. Due to infectious alien spores, Luke becomes sick for the first time and nearly dies, spurring Sarah Jane to take up arms against their enemy."]}, {"page": "List of people from Kent", "response": ["*Tommy Knight (born 1993) – actor in TV's The Sarah Jane Adventures"]}, {"page": "Tom Knight", "response": ["* Tommy Knight (footballer) (1865–?), English footballer", "* Tommy Knight (born 1993), child actor, best known for playing Luke Smith in The Sarah Jane Adventures"]}, {"page": "LGBT representation in children's television", "response": ["In 2013, creator of The Sarah Jane Adventures, Russell T. Davies, expressed his desire to implement a coming out scene for Luke Smith (Tommy Knight) if the series had continued past the fifth series. A boyfriend for the character, Sanjay, was written but never seen in the series. The idea was suggested by the CBBC network itself, but due to the death of cast member Elisabeth Sladen, the series ended prematurely."]}, {"page": "Doctor Who (series 4)", "response": ["Recurring guest stars for the series included Bernard Cribbins and Jacqueline King as Donna's grandfather Wilfred Mott and mother Sylvia Noble. Penelope Wilton returned as shamed former prime minister Harriet Jones in \"The Stolen Earth\", her first appearance since \"The Christmas Invasion\". Noel Clarke and Camille Coduri reprised their roles as Mickey Smith and Jackie Tyler in \"Journey's End\". Adjoa Andoh returned as Martha Jones' mother Francine in the finale. Eve Myles, Gareth David-Lloyd and Tommy Knight also starred in the finale in their respective roles of Gwen Cooper, Ianto Jones and Luke Smith from spin-off series Torchwood and The Sarah Jane Adventures. This marked their first appearances in Doctor Who itself, although Eve Myles had previously featured in \"The Unquiet Dead\" as a direct ancestor of Gwen called Gwyneth."]}, {"page": "The Stolen Earth", "response": ["The finale contains nineteen principal cast members, sixteen of whom appear in \"The Stolen Earth\". As a consequence of the episode's crossover nature, the episode is the first appearance of Gareth David-Lloyd as Ianto Jones and Tommy Knight as Luke Smith in Doctor Who. Eve Myles, who previously played Gwyneth in \"The Unquiet Dead\", makes her first appearance as the Torchwood female lead Gwen Cooper. The episode features many returning characters: Billie Piper, Freema Agyeman, Adjoa Andoh, John Barrowman, Nicholas Briggs, Elisabeth Sladen, and Penelope Wilton reprise roles for \"The Stolen Earth\". Evolutionary biologist Richard Dawkins and comedian Paul O'Grady make cameo appearances on Torchwood's television screen; cameos by celebrities such as Davina McCall, Derek Acorah, and Ann Widdecombe had been a part of each penultimate episode since the show's revival. O'Grady was given a cameo after Davies heard that he was a fan of the show; and Dawkins was added to the script by Davies when Cook suggested him to portray the \"elderly professor\" on a Newsnight-style television programme discussing the new planets in the sky. Dawkins accepted because of his pre-existing association with Doctor Who; his wife Lalla Ward portrayed the second incarnation of the Time Lady Romana between 1979 and 1981. Gary Milner was cast as the extra \"Scared Man\" after misreading the callsheet as \"Sacred Man\" and creating a \"priest-like\" portrayal of the character. Andrew Bullivant—who portrayed the Milkman in the episode's cold open—was given a role in The Sarah Jane Adventures serial The Temptation of Sarah Jane Smith as a policeman because of his performance in \"The Stolen Earth\". Michael Brandon later appeared in the audio play Lurkers at Sunlight's Edge. Kelly Hunter made a further appearance as the Shadow Architect in the opening episode of Series 9, \"The Magician's Apprentice\"."]}, {"page": "List of British former child actors", "response": ["*Tommy Knight (born 1993)"]}, {"page": "London Film and Comic Con", "response": ["| 19-21 November 2021. Returns after a 2-year hiatus due to the Covid-19 Pandemic || Olympia || Christopher Eccleston, George Takei,  Robert Englund, Karen Allen, Mark Pellegrino, Ming-Na Wen, Brian Blessed, Julian Kostov, Julius LeFlore, Valene Kane, Beau Gadsdon, Dolly Gadsdon, Daniel Naprous, Mark Rolston, Jemma Redgrave, Jo Martin, Amanda Abbington, Sean Biggerstaff, Andrew Robinson, Rose Reynolds, Hannah Murray, Nick Frost, Ben Browder, Natalia Tena, Tom Skerrit, Riz Ahmed, Sacha Dhawan, Georgia Hirst, Kim Coates, Ray Hassett, Bernard Cribbins, Elizabeth Mitchell, Simon Palsey-Day, Jason O'Mara, Guy Henry, Simon McBurney, Ahsley Walters, Veronica Cartwright, John Wesley Shipp, Jessie T. Usher, Janet Fielding, Suzanne Bertish, Angus Wright, Milton Johns, Andrew Gower, Liam Garrigan, Anji Mohindra, Mark Boone Jr., Quentin Piere, Harry Manfredi, Lee Cornes, Clare Kramer, David Learner, Danielle Nicolet, Joe Gibson, Mat Fraser, Julian Holloway, Sam Humphrey, Mandeep Dhillon, Matthew Devitt, Emmy Raver-Lampman, Steven R. McQueen, Barry Bostwick, Ronn Millkie, Anna-Louise Plowman, Staz Nair, Marc Blucas, PJ Black, Cinta de Oro, Jack McKenzie, Syd Wragg, Richard Brake, Jim Dowdall, Robert Patrick, Emily Kinney, Nick Blood, Maryam d'Abo, Bonnie Langford, Lance Henriksen, Tommy Knight, Lee Stringer, Jonathan Watson, Bernard Hill, Jimmy Vee, Tommy Flanagan, Jenna Coleman, Marina Sirtis, Kristanna Loken, Tim Dry, Sean Crawford, Joey Cramer, Andy Secombe, Sam Spruell, Rochenda Sandall"]}, {"page": "Rani Chandra (The Sarah Jane Adventures)", "response": ["Rani first appears in the second story of Series 2, following Maria's departure. In The Day of the Clown (2008), Rani and her parents move into the Jacksons' old house at 12 Bannerman Road(sometimes 36 Bannerman Road), opposite Sarah Jane (Elisabeth Sladen) and Luke Smith's (Tommy Knight) house, in Ealing, London. Her father is the new headteacher of the school where she, Luke and his best friend Clyde Langer (Daniel Anthony) are pupils; her mother owns the Bloomin' Lovely florist. An aspiring journalist, Rani soon joins Sarah Jane's investigative gang.", "Reviewing the second series of The Sarah Jane Adventures for Digital Spy, Ben Rawson-Jones writes that: \"As Rani, Anjli Mohindra was fine with dialogue, but painfully self-conscious on a physical acting level when compared to the effortless ease with which Daniel Anthony and Tommy Knight portray Clyde and Luke. It was almost as if someone was stood slightly off set operating her with strings. That theory at least fits into the whole 'body possession' procession of the second season.\""]}, {"page": "List of British actors", "response": ["* Tommy Knight (born 1993)"]}]}}