{"wiki_id": "http://www.wikidata.org/entity/Q312564", "itemLabel": "Douglas Haig, 1st Earl Haig", "itemDescription": "British senior officer during the First World War (1861-1928)", "wikipedia_url": "https://en.wikipedia.org/wiki/Douglas_Haig,_1st_Earl_Haig", "wikipedia_page": {"main": "Field Marshal Douglas Haig, 1st Earl Haig,  (; 19 June 1861 – 29 January 1928) was a senior officer of the British Army. During the First World War, he commanded the British Expeditionary Force (BEF) on the Western Front from late 1915 until the end of the war. He was commander during the Battle of the Somme, the Battle of Arras, the Third Battle of Ypres, the German Spring Offensive, and the Hundred Days Offensive.Although he had gained a favourable reputation during the immediate post-war years, with his funeral becoming a day of national mourning, Haig has, since the 1960s, become an object of criticism for his leadership during the First World War. He was nicknamed \"Butcher Haig\" for the two million British casualties endured under his command. The Canadian War Museum comments, \"His epic but costly offensives at the Somme (1916) and Passchendaele (1917) have become nearly synonymous with the carnage and futility of First World War battles.\"Conversely, he led the BEF during the final Hundred Days Offensive when it crossed the Canal du Nord and broke through the Hindenburg line, capturing 195,000 German prisoners. This campaign, in combination with the Kiel mutiny, the Wilhelmshaven mutiny, the proclamation of a republic on 9 November 1918, and civil unrest across Germany, led to the armistice of 11 November 1918. It is considered by some historians to be one of the greatest victories ever achieved by a British-led army.Major-General Sir John Davidson, one of Haig's biographers, praised Haig's leadership, and since the 1980s many historians have argued that the public hatred with which Haig's name had come to be associated failed to recognise the adoption of new tactics and technologies by forces under his command, the important role played by British forces in the allied victory of 1918, and that high casualties were a consequence of the tactical and strategic realities of the time.", "link_mentions": [{"page": "Distinguished Service Medal (U.S. Army)", "response": ["#Field Marshal Douglas Haig, 1st Earl Haig of Britain", "*Douglas Haig, 1st Earl Haig, field marshal, British Army"]}, {"page": "January 29", "response": ["*1928 – Douglas Haig, 1st Earl Haig, Scottish field marshal (b. 1861)"]}, {"page": "June 19", "response": ["*1861 – Douglas Haig, 1st Earl Haig, Scottish-English field marshal (d. 1928)"]}, {"page": "1928", "response": ["* January 29 – Douglas Haig, 1st Earl Haig, British soldier (b. 1861)"]}, {"page": "Brasenose College, Oxford", "response": ["Earlier alumni include Henry Addington, Prime Minister of the United Kingdom, Elias Ashmole, founder of the Ashmolean Museum, John Buchan, author of The Thirty-Nine Steps, John Clavell, highwayman and author, Colin Cowdrey, English Test batsman, William Webb Ellis, often credited with the invention of Rugby football, John Foxe, author of Actes and Monuments popularly abridged as Foxe's Book of Martyrs, William Golding, winner of the Nobel Prize in Literature, John Gorton, Prime Minister of Australia, William Robert Grove, pioneer of fuel cells, Douglas Haig, 1st Earl Haig, soldier, Robert Runcie, Archbishop of Canterbury, and Thomas Traherne, poet and theologian."]}, {"page": "Whitehall", "response": ["Whitehall is also home to six other monuments. From north to south, these are of Prince George, Duke of Cambridge (Commander-in-Chief of the British Army), Liberal Party, Liberal Unionist Party and Unionists leader Spencer Cavendish, 8th Duke of Devonshire, Douglas Haig, 1st Earl Haig (known as the Earl Haig Memorial), Field Marshal Montgomery (commander of the 8th Army, the 21st Army Group and Chief of the Imperial General Staff), William Slim, 1st Viscount Slim, Commander of the 14th Army and Governor-General of Australia, and Alan Brooke, 1st Viscount Alanbrooke, Chief of the Imperial General Staff."]}, {"page": "Butcher Haig", "response": ["#REDIRECT Douglas Haig, 1st Earl Haig"]}, {"page": "Oh! What a Lovely War", "response": ["Category:Cultural depictions of Douglas Haig, 1st Earl Haig"]}]}}