{"wiki_id": "http://www.wikidata.org/entity/Q3128", "itemLabel": "Graham Hill", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Graham_Hill", "wikipedia_page": {"main": "Norman Graham Hill  (15 February 1929 – 29 November 1975) was a British racing driver and team owner, who was the Formula One World Champion twice, winning in 1962 and 1968 as well as being runner up on three occasions (1963, 1964 and 1965). Despite not passing his driving test until 1953 when he was already 24 years of age, and only entering the world of motorsports a year later, Hill would go on to become one of the greatest drivers of his generation. Hill is most celebrated for being the only driver ever to win the Triple Crown of Motorsport, an achievement which he defined as winning the Indianapolis 500, the 24 Hours of Le Mans, and the Formula One World Drivers' Championship. While several of his peers have also espoused this definition, including fellow F1 World Champion Jacques Villeneuve, the achievement is today most commonly defined as including the Monaco Grand Prix rather than the Formula One World Championship. By this newer definition, Hill is still the only driver to have ever won the Triple Crown, winning at Monaco with such frequency in the 1960s (5x; 1963, 1964, 1965, 1968, 1969) that he became known as \"Mr. Monaco\". Hill crashed at the 1969 United States Grand Prix and was seriously injured, breaking both his legs and ending his season. Although he would recover and continue to race until 1975, Hill's career would never again reach the same heights, and the Monaco Grand Prix victory earlier in 1969 would be his last victory in Formula One.\nWins in the most prestigious races of all three of the major disciplines of motor racing cemented Hill's position as one of the most complete drivers in the history of the sport. Hill was also a well liked television personality and was frequently seen on television screens in the 1970s in a non-sporting capacity, appearing on a variety of programmes including panel games.\nUpon leaving Brabham, Hill set up his own team in 1973, operating under the name Embassy Hill. Hill continued to race, however after failing to qualify for the 1975 Monaco Grand Prix he retired from driving to concentrate on the day-to-day operations of the team. That same year Hill and five other members of the Embassy Hill team were killed when the aeroplane Hill was piloting from France crashed in fog at night on Arkley golf course while attempting to land at Elstree Airfield in north London.Hill and his son Damon were the first father and son pair to win Formula One World Championships. Hill's grandson Josh, Damon's son, also raced his way through the ranks until he retired from Formula Three in 2013 at the age of 22.", "link_mentions": [{"page": "Brabham", "response": ["Tauranac signed double world champion Graham Hill and young Australian Tim Schenken to drive for the 1971 season. Tauranac designed the unusual 'lobster claw' BT34, featuring twin radiators mounted ahead of the front wheels, a single example of which was built for Hill. Although Hill, no longer a front-runner since his 1969 accident, took his final Formula One win in the non-championship BRDC International Trophy at Silverstone,Henry (1985) pp. 114–17 the team scored only seven championship points.", "| Graham HillTim SchenkenDave Charlton", "| Graham HillCarlos ReutemannWilson Fittipaldi"]}, {"page": "England", "response": ["The 1950 British Grand Prix at Silverstone was the first race in the newly created Formula One World Championship. Since then, England has produced some of the greatest drivers in the sport, including; John Surtees, Stirling Moss, Graham Hill (only driver to have won the Triple Crown), Nigel Mansell (only man to hold F1 and IndyCar titles at the same time), Damon Hill, Lewis Hamilton and Jenson Button. It has manufactured some of the most technically advanced racing cars, and many of today's racing companies choose England as their base of operations for its engineering knowledge and organisation. McLaren Automotive, Williams F1, Team Lotus, Honda, Brawn GP, Benetton, Renault, and Red Bull Racing are all, or have been, located in the south of England. England also has a rich heritage in Grand Prix motorcycle racing, the premier championship of motorcycle road racing, and produced several World Champions across all the various class of motorcycle: Mike Hailwood, John Surtees, Phil Read, Geoff Duke, and Barry Sheene."]}, {"page": "Formula One", "response": ["An era of British dominance was ushered in by Mike Hawthorn and Vanwall's championship wins in 1958, although Stirling Moss had been at the forefront of the sport without ever securing the world title. Between Hawthorn, Jim Clark, Jackie Stewart, John Surtees and Graham Hill, British drivers won nine Drivers' Championships and British teams won fourteen Constructors' Championship titles between 1958 and 1974. "]}, {"page": "Monaco Grand Prix", "response": ["The first Monaco Grand Prix took place on 14 April 1929, and the race eventually became part of the pre-Second World War European Championship and was included in the first World Championship of Drivers in 1950. It was twice designated the European Grand Prix, in 1955 and 1963, when this title was an honorary designation given each year to one Grand Prix race in Europe. Graham Hill was known as \"Mr. Monaco\" due to his five Monaco wins in the 1960s. Ayrton Senna won the race more times than any other driver, with six victories, winning five races consecutively between 1989 and 1993.", "====Graham Hill's era====", "Britain's Graham Hill won the race five times in the 1960s and became known as \"King of Monaco\"The Complete Encyclopedia of Formula One, p. 262, line 10, Carlton Books Ltd. . and \"Mr. Monaco\". He first won in 1963, and then won the next two years. In the 1965 race he took pole position and led from the start, but went up an escape road on lap 25 to avoid hitting a slow backmarker. Re-joining in fifth place, Hill set several new lap records on the way to winning. The race was also notable for Jim Clark's absence (he was participating in the Indianapolis 500), and for Paul Hawkins's Lotus ending up in the harbour. Hill's teammate, Briton Jackie Stewart, won in 1966 and New Zealander Denny Hulme won in 1967, but Hill won the next two years, the 1969 event being his final Formula One championship victory, by which time he was a double Formula One world champion.", "Senna dominated 1989 while Prost was stuck behind backmarker Rene Arnoux and others; the Brazilian also dominated 1990 and 1991. At the 1992 event Nigel Mansell, who had won all five races held to that point in the season, took pole and dominated the race in his Williams FW14B-Renault. However, with seven laps remaining, Mansell suffered a loose wheel nut and was forced into the pits, emerging behind Ayrton Senna's McLaren-Honda, who was on worn tyres. Mansell, on fresh tyres, set a lap record almost two seconds quicker than Senna's and closed from 5.2 to 1.9 seconds in only two laps. The pair duelled around Monaco for the final four laps but Mansell could find no way past, finishing just two-tenths of a second behind the Brazilian.Autocourse 1992 pp.150, 153 It was Senna's fifth win at Monaco, equalling Graham Hill's record. Senna had a poor start to the 1993 event, crashing in practice and qualifying 3rd behind pole-sitter Prost and the rising German star Michael Schumacher. Both of them beat Senna to the first corner, but Prost had to serve a time penalty for jumping the start and Schumacher retired after suspension problems, so Senna took his sixth win to break Graham Hill's record for most wins at the Monaco Grand Prix. Runner-up Damon Hill commented, \"If my father was around now, he would be the first to congratulate Ayrton.\"Allsop, Derek. Designs on Victory: On The Grand Prix Trail With Benetton. Hutchinson, p. 109, Line 34–35 . ", "Seven-time world champion Schumacher would eventually win the race five times, matching Graham Hill's record. In his appearance at the 2006 event, he attracted criticism when, while provisionally holding pole position and with the qualifying session drawing to a close, he stopped his car at the Rascasse hairpin, blocking the track and obliging competitors to slow down. Although Schumacher claimed it was the unintentional result of a genuine car failure, the FIA disagreed and he was sent to the back of the grid.", "The Monaco Grand Prix is widely considered to be one of the most important and prestigious automobile races in the world alongside the Indianapolis 500 and the 24 Hours of Le Mans. These three races are considered to form a Triple Crown of the three most famous motor races in the world. As of 2020, Graham Hill is the only driver to have won the Triple Crown, by winning all three races. The practice session for Monaco overlaps with that for the Indianapolis 500, and the races themselves sometimes clash. As the two races take place on opposite sides of the Atlantic Ocean and form part of different championships, it is difficult for one driver to compete effectively in both during his career. Juan Pablo Montoya and Fernando Alonso are the only active drivers to have won two of the three events.", "|  Graham Hill", "|  Graham Hill", "|  Graham Hill", "|  Graham Hill", "|  Graham Hill", "|  Graham Hill"]}, {"page": "February 15", "response": ["*1929 – Graham Hill, English racing driver and businessman (d. 1975)"]}, {"page": "Jack Brabham", "response": ["Despite his success with Cooper, Brabham was sure he could do better. He considered buying Cooper in partnership with Roy Salvadori and then in late 1959 he asked his friend Ron Tauranac to come to the UK and work with him, producing upgrade kits for Sunbeam Rapier and Triumph Herald road cars at his car dealership, Jack Brabham Motors, but with the long-term aim of designing racing cars.Lawrence (1999) p. 22-4 & Henry (1985) p.19 Brabham continued to drive for Cooper, but on the long flight back from the 1960 season-opening Argentine Grand Prix, he had a heart-to-heart with John Cooper. John's father Charlie and the designer Owen Maddock had been reluctant to update their car, but although a Cooper had won in Argentina, other cars had been faster before they broke down.Brabham, Nye (2005) pp.112–113 Brabham helped design the more advanced Cooper T53, including advice from Tauranac.Lawrence (1999) pp.11–12 Brabham spun the new car out of the next championship race, the Monaco Grand Prix, but then embarked on a series of five straight victories. He won from the front at the Dutch, French, and Belgian Grands Prix, where title rival Moss was badly injured in a practice accident that put him out for two months. Two other drivers were killed during the race. At the British Grand Prix, Brabham was closing on Graham Hill's BRM before Hill spun off, leaving Brabham the victory. He then came back from eighth place to second at the Portuguese Grand Prix after sliding off on tramlines and won after race leader John Surtees crashed. Brabham's points total was put out of reach when the British teams withdrew from the Italian GP on safety grounds.Brabham, Nye (2005) pp.115–121 Mike Lawrence writes that Brabham's expertise in setting up the cars was a significant factor in Cooper's 1960 drivers' and constructors' titles.Lawrence (1998) p.86"]}, {"page": "November 29", "response": ["*1975 – Graham Hill plane crash", "**                Graham Hill, English race car driver and businessman (b. 1929)"]}, {"page": "Williams Grand Prix Engineering", "response": ["At the next race in Spain, Williams brought in test driver David Coulthard as Hill's new teammate. Hill took the team's first victory of the season, by almost half a minute over Schumacher's Benetton, while Coulthard would retire due to an electrical problem. In Montreal, both Williams cars finished in the points for the first time that season, with Hill finishing second and Coulthard finishing fifth. In France, Nigel Mansell replaced Coulthard (in the first of four appearances), at the behest of Renault. At Silverstone, Damon Hill accomplished what had eluded his father, twice Formula One World Champion Graham Hill, by winning the British Grand Prix. Hill closed the points gap with Schumacher, who was disqualified from first at Spa after the Stewards found floorboard irregularities on his Benetton. He was banned for the next two races, and Hill capitalised on this with wins in Italy and a Williams 1–2 in Portugal."]}, {"page": "1929", "response": ["** Graham Hill, English racing driver (d. 1975)"]}, {"page": "1972", "response": ["* June 11 – Henri Pescarolo (France) and co-driver former World Drivers' Champion Graham Hill (Britain) win the 24 Hours of Le Mans in the Equipe Matra MS670."]}, {"page": "1975", "response": ["* Formula One world champion Graham Hill is killed when the Piper Aztec aeroplane he was piloting crashed in foggy conditions near Arkley golf course in North London.", "** Graham Hill, English race car driver (b. 1929)"]}, {"page": "Riccardo Patrese", "response": ["With Alain Prost, Ayrton Senna and Nigel Mansell all desperately trying to sign for Williams, Patrese's position looked to be under threat and he signed for the Benetton team before the end of the year.  His teammate for  would be young German driver Michael Schumacher. Ironically, only Prost was able to agree terms with Williams for 1993 (Mansell went on to race in the American-based Champ Car series while Prost had a clause in his contract, signed in early 1992, that prevented Senna from being his teammate). This would have left a seat free for Patrese had he remained with the team. Although Williams offered Patrese the opportunity to stay with the team after Mansell announced his retirement from F1 at the Italian Grand Prix, he felt he could not go back on his word to Benetton. The number two seat at Williams went to the team's test driver Damon Hill, the son of the  and  World Champion Graham Hill."]}, {"page": "Jochen Rindt", "response": ["Rindt was highly successful in Formula Two racing, amassing a total of 29 victories. He once again entered the series in partnership with Barry, driving Brabham cars. The engines provided by Cosworth were slower and inconsistent in performance; Rindt responded to his reduced pace by declaring: \"Then I just brake two metres later.\" He entered his first F2 race in April 1964 at the Preis von Wien at Aspern, retiring from both heats. The international motor racing world first took notice of him on 18 May 1964, when Rindt won the London Trophy race at the Crystal Palace circuit in a Brabham BT10 ahead of Graham Hill.", "Prior to , Rindt received offers from every team except Lotus and Honda, and moved to Brabham, who had been world champions in the two previous seasons. Technical problems restricted him that year. Brabham's Repco V8 engine was not competitive against the now widely used Cosworth DFV and Rindt finished just two races, both in third place. At the season opener in South Africa on New Year's Day, Rindt placed third, being elevated by a late retirement from Jackie Stewart and closing on second-placed Graham Hill towards the end. The race was won by Jim Clark, a close friend of Rindt's. It was Clark's final Formula One race; he died three months later at a Formula Two race at Hockenheim. Rindt was deeply affected by his death, telling Austrian journalist Heinz Prüller: \"If Jim Clark is not safe, what can happen to us?\" His second podium finish came in heavy rain and fog at the Nürburgring at the , a race dominated by Stewart, who finished four minutes ahead of Hill in second place. Rindt had closed on Hill in the latter stages of the race after the Englishman spun, and finished just four seconds behind after a close battle during the last lap. His eight points placed him twelfth in the championship at the end of the season.", "For the 1969 season, Rindt signed for the 1968 World Constructors' Champion Lotus, where he joined the defending Drivers' Champion Graham Hill. Rindt felt uncomfortable with the move, owing to the notorious unreliability of the Lotus car; in a twenty-month period between 1967 and 1969, the team was involved in 31 accidents. Hill alone had nine crashes between 1968 and 1970, which led him to joke: \"Every time I am being overtaken by my own wheel, I know I am in a Lotus.\" When Rindt joined Lotus, his friend and de facto manager Bernie Ecclestone, who had negotiated the deal, remarked that they were aware that Brabham may have been a better choice of team but the speed of the Lotus gave Rindt a chance to win the championship. Rindt commented: \"At Lotus, I can either be world champion or die.\" Because of his uncertainty about the wisdom of joining the team, Rindt did not sign the Lotus contract until shortly before the 1969 Spanish Grand Prix.", "For , Rindt's partner at Lotus was John Miles; Graham Hill had left the team to drive for Rob Walker's customer franchise. Rindt became the clear team leader. At the first Grand Prix of the season in South Africa, he qualified fourth, but eventually retired with an engine failure after a first lap incident with Chris Amon and Jack Brabham, the latter of whom went on to win for the final time in his career. At the following race, the , Lotus introduced their revolutionary new car design. Instead of one conventional front radiator, the Lotus 72 featured two, one on each side of the cockpit. Further innovations included torsion bar suspension in place of the widely used coil-springs, and all four brakes mounted inboard to reduce unsprung weight. During its first practice session, the left semi-axle of the car broke, sending Rindt into a spin. The car also proved ineffective in the race; Rindt retired after nine laps.", "The  was originally set to take place at its traditional venue, the Nürburgring. The Grand Prix Drivers' Association (GPDA), represented by Rindt and Graham Hill, demanded changes to the circuit to increase safety, including Armco barriers along the entire  of the Nordschleife. No agreement was reached and the Grand Prix moved to Hockenheim, where Rindt took his fourth victory in succession. The race was another two-way fight, this time between Rindt and Ickx, who exchanged the lead several times. This meant that he could have secured the drivers' title at his home event at the . He set the Lotus 72 on pole position, to the delight of the crowd, but retired from the race with an engine failure. The title decision was therefore postponed to the next race in Monza."]}, {"page": "Gas turbine", "response": ["The first race car (in concept only) fitted with a turbine was in 1955 by a US Air Force group as a hobby project with a turbine loaned them by Boeing and a race car owned by Firestone Tire & Rubber company. The first race car fitted with a turbine for the goal of actual racing was by Rover and the BRM Formula One team joined forces to produce the Rover-BRM, a gas turbine powered coupe, which entered the 1963 24 Hours of Le Mans, driven by Graham Hill and Richie Ginther. It averaged  and had a top speed of . American Ray Heppenstall joined Howmet Corporation and McKee Engineering together to develop their own gas turbine sports car in 1968, the Howmet TX, which ran several American and European events, including two wins, and also participated in the 1968 24 Hours of Le Mans. The cars used Continental gas turbines, which eventually set six FIA land speed records for turbine-powered cars."]}, {"page": "Enzo Ferrari", "response": ["The \"great walkout\" came at an especially difficult time for Ferrari. At the urging of Chiti, the company was developing a new 250-based model. Even if the car would be finished, it was unclear if it could be raced successfully. Ferrari's shakeup, however, proved to be successful. The mid-engined Dino racers laid the foundation for Forghieri's dominant 250-powered 250 P. John Surtees won the world title in 1964 following a tense battle with Jim Clark and Graham Hill. The Dino road cars sold well, and other models like the 275 and Daytona were on the way. Conversely, ATS, following a troubled Formula One 1963 campaign, with both cars retiring four times in five races, folded at the end of the year."]}, {"page": "Dorking", "response": ["Rob Walker's privateer racing team was based at Pippbrook Garage in London Road from 1947 to 1970. The team won nine Grands Prix and their drivers included Stirling Moss (1958–1961) and Graham Hill (1970). Walker's contribution to motorsport and to Dorking was celebrated on the centenary of his birth in October 2018 with a parade of classic cars through the town centre."]}, {"page": "Damon Hill", "response": ["Damon Graham Devereux Hill,  (born 17 September 1960) is a British former racing driver from England and the 1996 Formula One World Champion. He is the son of Graham Hill, and, along with Nico Rosberg, one of two sons of a Formula One World Champion to also win the title. He started racing on motorbikes in 1981, and after minor success moved on to single-seater racing cars.", "Hill was born in Hampstead, London, to Graham and Bette Hill. Graham Hill was a racing driver in the international Formula One series. He won the world Drivers' Championship in 1962 and 1968, and became a well-known personality in the United Kingdom. Graham Hill's career provided a comfortable living. Bette (née Shubrook) was a former rower and medalist at the European Rowing Championships. By 1975 the family lived in a \"25-room country mansion\" in Hertfordshire and Damon attended the independent The Haberdashers' Aske's Boys' School. The death of his father in an aeroplane crash in 1975 left the 15-year-old Hill, his mother, and sisters Samantha and Brigitte in drastically reduced circumstances. Hill worked as a labourer and a motorcycle courier to support his further education.", "Hill started his motorsport career in motorcycle racing in 1981. He used the same simple, easily identifiable helmet design as his father: eight white oar blades arranged vertically around the upper surface of a dark blue helmet. The device and colours represent the London Rowing Club for which Graham Hill rowed in the early 1950s. Although he won a 350 cc clubman's championship at the Brands Hatch circuit, his racing budget came from working as a building labourer and he \"didn't really look destined for great things\" according to Motorcycle News reporter Rob McDonnell. He also worked as a dispatch rider for Special Delivery, a London motorcycle dispatch company and was provided TZ350 racing bikes by them. His mother, who was concerned about the dangers of racing motorcycles, persuaded him to take a racing car course at the Winfield Racing School in France in 1983. Although he showed \"above-average aptitude\", Hill had only sporadic single-seater races until the end of 1984. He graduated through British Formula Ford, winning six races driving a Van Diemen for Manadient Racing in 1985, his first full season in cars, and finishing third and fifth in the two UK national championships. He also took third place in the final of the 1985 Formula Ford Festival, helping the UK to win the team prize."]}, {"page": "Mill Hill", "response": ["The racing driver Graham Hill lived at Mill Hill for much of his adult life, along with his son Damon Hill. Their house in Parkside has a blue plaque. The botanist Peter Collinson and the English traveller Celia Fiennes both lived here. The playwright and novelist Michael Frayn was born in Mill Hill. Actor Patrick McGoohan lived on The Ridgeway with his wife and three daughters.  Fellow actor Patrick Troughton, best known as the second Doctor from Doctor Who, was born in Mill Hill and lived in Shakespeare Road. Other actors John Slater, Ian Carmichael (Nan Clark's Lane) and Graham Crowden (Hammers Lane) also lived locally.   "]}, {"page": "Ayrton Senna", "response": ["In the opening race in South Africa, Senna finished in second place after surviving a collision with Schumacher. Senna won in changing conditions in Brazil and Donington. The latter has often been regarded as one of Senna's greatest victories,Collings and Edworthy (2002), p. 250 in the process setting a record for the fastest lap in an F1 race driving through the then speed-unrestricted pit lane. In cold, wet, rainy conditions typical of England in April he was fifth at the first corner and led the race at the end of the first lap going on to lap all but second place in a race where up to seven pit stops were required by some drivers for rain or slick tyres.Menard and Vassal (2003), p. 134. Senna then scored a second-place finish in Spain and a record-breaking sixth win at Monaco, breaking Graham Hill's record of five. After Monaco, the sixth race of the season, Senna unexpectedly led the championship from Prost in the Williams-Renault.Menard and Vassal (2003), pp. 134–135. As the season progressed, Alain Prost and Damon Hill asserted the superiority of their Williams-Renault cars, while Senna suffered mechanical failures in Imola, Canada, Britain, Hungary, and Portugal, where Prost took his 4th world championship, losing apparently none of the skill he was not able to use during his 1992 sabbatical. Senna won the penultimate race of the season in Japan, which was marked by an incident involving Jordan's rookie Eddie Irvine, twice unlapping himself against Senna. Immediately after the race, Senna angrily stormed into the Jordan team's garage and said to the Irishman \"You're driving like a f***ing idiot! You're not a racing driver, you're a f***ing idiot!” before punching him in the side of the head. Following that incident, the stewards gave Senna a two races ban for 1994. However, after a discussion between Senna and the president of the FIA, a compromise was reached by removing the ban, considering the exemplary attitude of Senna towards his fellow drivers. The decision created some polemic back in the day, both amongst drivers and in the press, considering that during all the 1993 season, Prost was under threat of a four-race ban for using words to criticize the president of the FIA, which means that punching a fellow driver in the face was not as bad as criticizing the FIA."]}, {"page": "Indianapolis 500", "response": ["It was not until the Indianapolis 500 was removed from the World Championship calendar that European entries made their return. In 1963, technical innovator Colin Chapman brought his Team Lotus to Indianapolis for the first time, attracted by the large monetary prizes, far bigger than the usual at a European event. Racing a mid-engined car, Scotsman Jim Clark was second in his first attempt in 1963, dominated in 1964 until suffering suspension failure on lap 47, and completely dominated the race in 1965, a victory which also interrupted the success of the Offy, and giving the 4.2-liter Ford V8 its first success at the race. The following year, 1966, saw another British win, this time Graham Hill in a Lola-Ford."]}, {"page": "Jacky Ickx", "response": ["In 1968 Ickx drove in Formula 1 for Ferrari. He retired from his first two races, but at his home race at Spa-Francorchamps he started from the front row and finished third. At the French Grand Prix at Rouen he took his first win, in heavy rain. Ickx also finished third at Brands Hatch and fourth at the Nürburgring after driving almost the entire race in heavy rain without his helmet visor. At Monza he finished the race in third position. In Canada he crashed and broke his left leg during practice, thus did not start and also missed the subsequent United States Grand Prix. He returned in time for the final race of the season in Mexico. Ickx scored 27 points in the 1968 Formula One season finishing in fourth place behind Graham Hill, Jackie Stewart and Hulme."]}, {"page": "Cosworth", "response": ["*Graham Hill (Lotus) won Drivers' Championship, 2nd and 3rd placed drivers were also Cosworth powered."]}, {"page": "Juan Pablo Montoya", "response": ["The Ganassi team also competed in the 2000 Indianapolis 500 of the rival Indy Racing League series using a G-Force chassis and a Comptech-tuned Oldsmobile Aurora engine. Montoya and his CART teammate Jimmy Vasser were the first CART drivers to \"cross-over\" to drive in the Indy 500 since 1996. In the event, the Colombian led 167 of 200 laps and claimed top honours at the end of the  race, taking an easy victory on his first attempt. He was the first to do so since Formula One World Champion Graham Hill in 1966 and was the first Colombian winner. His compatriot Roberto José Guerrero had previously finished twice as runner up.", "From the Monaco Grand Prix, the FW25 proved to be the class of the field, allowing Montoya to take victory at Circuit de Monaco from Kimi Räikkönen, joining Graham Hill as the only winners of both the Monaco GP and the Indy 500. McLaren announced that they would take on Montoya's racing services from 2005 at an end of season announcement, although it was believed that he had already decided to leave immediately after the French GP."]}, {"page": "Lotus Cars", "response": ["In its early days, the company encouraged its customers to race its cars, and it first entered Formula One through its sister company Team Lotus in 1958. A Lotus Formula One car driven by Stirling Moss won the marque's first Grand Prix in 1960 at Monaco.  Moss drove a Lotus 18 entered by privateer Rob Walker. Major success came in 1963 with the Lotus 25, which – with Jim Clark driving – won Team Lotus its first F1 World Constructors' Championship. Clark's untimely death – he crashed a Formula Two Lotus 48 in April 1968 after his rear tyre failed in a turn in Hockenheim – was a severe blow to the team and to Formula One. He was the dominant driver in the dominant car and remains an inseparable part of Lotus's early years. That year's championship was won by Clark's teammate, Graham Hill.", "Formula One Drivers' Championship winner for Lotus  were Jim Clark in 1963 and 1965, Graham Hill in 1968,  Jochen Rindt in 1970,  Emerson Fittipaldi in 1972 and Mario Andretti in 1978. In 1973 Lotus won  the constructors' championship only; the drivers' title went to Jackie Stewart of Tyrrell."]}, {"page": "Cobham, Surrey", "response": ["In the 1970s residents Mike Chambers ran a business building Huron Formula Fords and a Formula Atlantic car at the Silvermere works and Geoff Uren prepared the BMW team saloon cars and Graham Hill's Jägermeister-sponsored Formula 2 car."]}, {"page": "Jim Clark", "response": ["He had to miss the prestigious Monaco Grand Prix to compete at Indianapolis, but made history by driving the first mid-engined car to win at the fabled \"Brickyard,\" as well as becoming the only driver to date to win both the Indy 500 and the F1 title in the same year. Other drivers, including Graham Hill, Mario Andretti, Emerson Fittipaldi and Jacques Villeneuve have also won both crowns, but not in the same year.", "The FIA decreed from 1966, new 3-litre engine regulations would come into force. Lotus were less competitive. Starting with a 2-litre Coventry-Climax engine in the Lotus 33, Clark did not score points until the British Grand Prix and a third place at the following Dutch Grand Prix. From the Italian Grand Prix onwards Lotus used the highly complex BRM H16 engine in the Lotus 43 car, with which Clark won the U.S. Grand Prix. He also picked up another second place at the Indianapolis 500, this time behind Graham Hill.", "Clark won the 1963 Belgian Grand Prix at Spa-Francorchamps in extremely foggy and rainy conditions. After starting eighth on the grid, he passed all of the cars in front of him, including early leader Graham Hill. About 17 laps into the race, with the rain coming down harder than ever, Clark had lapped the entire field except for Bruce McLaren, and was almost five minutes ahead of McLaren and his Cooper. This would be the first of seven victories for Clark and Team Lotus that year.", "On 7 April 1968, Clark died in a racing accident at the Hockenheimring in West Germany. During the 4-month gap between the first (which Clark won) and second race of the 1968 Formula One season, drivers would compete in other racing formulas. Clark was originally slated to drive in the BOAC 1000 km sportscar race at Brands Hatch, but instead chose to drive in the Deutschland Trophäe, a Formula Two race, for Lotus at the Hockenheimring, primarily due to contractual obligations with Firestone. Although the race has sometimes been characterised as a \"minor race meeting\" the entry list was impressive with top-running Matras for the French drivers Jean-Pierre Beltoise and Henri Pescarolo, Tecnos for Carlo Facetti and Clay Regazzoni, Team Brabhams for Derek Bell and Piers Courage, a Ferrari for Chris Amon and McLarens for Graeme Lawrence and Robin Widdows. Team Lotus drivers Graham Hill and Clark were in Gold Leaf Team Lotuses and a young Max Mosley was also in the race, moving up from the Clubman series. The event was run in two heats.Andrew Marriott, \"Return to Hockenheim: The memorial that matters\", Motor Sport, July 2010 On the fifth lap of the first heat, Clark's Lotus 48 veered off the track and crashed into the trees. He suffered a broken neck and skull fracture, and died before reaching the hospital. The cause of the crash was never definitively identified, but investigators concluded it was most likely due to a deflating rear tyre. Clark's death affected the racing community terribly, with fellow Formula One drivers and close friends Graham Hill, Jackie Stewart, Dan Gurney, John Surtees, Chris Amon and Jack Brabham all being personally affected by the tragedy. People came from all over the world to Clark's funeral. Colin Chapman was devastated and publicly stated that he had lost his best friend. The 1968 F1 Drivers' Championship was subsequently won by his Lotus teammate Graham Hill, who pulled the heartbroken team together and held off Jackie Stewart for the crown, which he later dedicated to Clark."]}, {"page": "List of fatalities from aviation accidents", "response": ["|Embassy Hill|| UK ||1975||six people total, including former F1 world champion Graham Hill, driver Tony Brise, team manager Ray Brimble, two mechanics and designer Andy Smallman.||Piper Aztec||Arkley||crashed on golf course while attempting to land at nearby Elstree Airfield in fog"]}, {"page": "John Bingham, 7th Earl of Lucan", "response": ["Despite these problems, from late October 1974 Lucan's demeanour appeared to change for the better. His best man, John Wilbraham, remarked that Lucan's apparent obsession over regaining his children had diminished. While having dinner with his mother he cast aside talk of his family problems and turned instead to politics. On 6 November he met his uncle John Bevan, apparently in good spirits. Later that day he met 21-year-old Charlotte Andrina Colquhoun, who said that \"he seemed very happy, just his usual self, and there was nothing to suggest that he was worried or depressed\". He also dined at the Clermont with racing driver Graham Hill. "]}, {"page": "Indianapolis Motor Speedway", "response": ["A. J. Foyt, who had won his first 500 in 1961, won the 1964 Indianapolis 500, which was the last ever win for a front-engine car, and since Jim Clark's win driving the rear-engine Lotus 38 in 1965, every winner has driven a rear-engine car. Graham Hill won the following year in his first attempt, eventually becoming the only driver to date to achieve auto racing's \"Triple Crown of Motorsport\" of winning the Monaco Grand Prix, Indianapolis 500, and Le Mans 24 Hours. There were enough Americans to compete with them, with A.J. Foyt, Mario Andretti, and the Unser brothers Bobby and Al leading the charge in the 1960s and 1970s, of whom Foyt and Al Unser would eventually become, respectively, the first two of four drivers, to date, to win four times each, while Bobby Unser won the race three times, with Andretti only ever winning the race once, in 1969. Andretti would go on to race in F1 and win the world championship in  with Team Lotus, who had been the first rear-engine winners at Indy, with Clark, in 1965."]}, {"page": "Keke Rosberg", "response": ["Rosberg later spent a long time managing his countrymen JJ Lehto and future world champion Mika Häkkinen. Until 2008, he also managed his son Nico who entered Formula One in 2006 driving for Williams F1. In 2013 he and Nico became the first father and son to both win at Monaco, 30 years apart from each other. In 2016, he and Nico became the second father son duo to both win Formula One World Championships, after Graham Hill and Damon Hill had won the Championships of 1962 & 1968 and 1996 respectively."]}, {"page": "Emerson Fittipaldi", "response": ["* Jim Clark, Graham Hill, Mario Andretti, and Jacques Villeneuve - Formula One world champions and Indianapolis 500 winners."]}]}}