{"wiki_id": "http://www.wikidata.org/entity/Q312567", "itemLabel": "William Lamb, 2nd Viscount Melbourne", "itemDescription": "British Prime Minister, Whig statesman (1779-1848)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Lamb,_2nd_Viscount_Melbourne", "wikipedia_page": {"main": "William Lamb, 2nd Viscount Melbourne,  (15 March 1779 – 24 November 1848), in some sources called Henry William Lamb, was a British Whig politician who served as Home Secretary (1830–1834) and Prime Minister (1834 and 1835–1841). His first premiership ended when he was dismissed by King William IV in 1834, the last British prime minister to be dismissed by a monarch. Five months later he was re-appointed and served for six more years, into the reign of Queen Victoria. He is best known for coaching the Queen in the ways of politics, acting almost as her private secretary. Historians have concluded that Melbourne does not rank highly as a Prime Minister, for there were no great foreign wars or domestic issues to handle, he lacked major achievements, he enunciated no grand principles, and he was involved in several political scandals in the early years of Victoria's reign.", "link_mentions": [{"page": "Hatfield, Hertfordshire", "response": ["*William Lamb, 2nd Viscount Melbourne (1779–1848), prime minister, was buried at St Etheldreda Church."]}, {"page": "March 15", "response": ["*1779 – William Lamb, 2nd Viscount Melbourne, English politician, Prime Minister of the United Kingdom (d. 1848)"]}, {"page": "November 24", "response": ["*1848 – William Lamb, 2nd Viscount Melbourne, English politician, Prime Minister of the United Kingdom (b. 1779)"]}, {"page": "Trinity College, Cambridge", "response": ["|William Lamb, 2nd Viscount Melbourne"]}, {"page": "1848", "response": ["* November 24 – William Lamb, 2nd Viscount Melbourne, Prime Minister of the United Kingdom (b. 1779)"]}, {"page": "1834", "response": ["* July 16 – William Lamb, 2nd Viscount Melbourne succeeds Earl Grey as Prime Minister of the United Kingdom.", "* November 14 – William Lamb, 2nd Viscount Melbourne becomes the last Prime Minister of the United Kingdom to be dismissed by the British monarch.  King William IV temporarily appoints Arthur Wellesley, 1st Duke of Wellington, to form a caretaker government.Michael S. Patridge, The Duke of Wellington, 1769-1852: A Bibliography (Greenwood Publishing, 1990) p129Rory Muir, Wellington: Waterloo and the Fortunes of Peace 1814-1852 (Yale University Press, 2013) pp439-440"]}, {"page": "1779", "response": ["* March 15 – William Lamb, 2nd Viscount Melbourne, Prime Minister of the United Kingdom (d. 1848)"]}, {"page": "University of Glasgow", "response": ["Many distinguished figures have taught, worked and studied at the University of Glasgow, including seven Nobel laureates and three Prime Ministers, William Lamb, 2nd Viscount Melbourne, Sir Henry Campbell-Bannerman and Bonar Law. Famous names include the physicist Lord Kelvin, his pupil, and later partner of the Carnegie Steel Corporation, George Lauder, 'father of economics' Adam Smith, engineer James Watt, inventors Henry Faulds and John Logie Baird, chemists William Ramsay, Frederick Soddy and Joseph Black, biologist Sir John Boyd Orr, philosophers Francis Hutcheson, Thomas Reid and Dugald Stewart, mathematician Colin Maclaurin, ethnologist James George Frazer, missionary David Livingstone, writers James Boswell, John Buchan, A. J. Cronin, Amy Hoff, Tobias Smollett and Edwin Morgan, and surgeon Joseph Lister. University of Aberdeen founder Bishop William Elphinstone also graduated from Glasgow. In June 1933 Albert Einstein gave the first Gibson Lecture, on his general theory of relativity; he subsequently received an honorary degree from the university. Also John Macintyre, pioneer of radiology and Jocelyn Bell Burnell who discovered radio pulsars. In 1974, professors Graham Teasdale and Bryan Jennett developed the Glasgow Coma Scale."]}, {"page": "William IV", "response": ["For the remainder of his reign, William interfered actively in politics only once, in 1834, when he became the last British sovereign to choose a prime minister contrary to the will of Parliament. In 1834, the ministry was facing increasing unpopularity and Lord Grey retired; the Home Secretary, William Lamb, 2nd Viscount Melbourne, replaced him. Melbourne retained most Cabinet members, and his ministry retained an overwhelming majority in the House of Commons. Some members of the Government, however, were anathema to the King, and increasingly left-wing policies concerned him. The previous year Grey had already pushed through legislation reforming the Protestant Church of Ireland. The Church collected tithes throughout Ireland, supported multiple bishoprics and was wealthy. However, barely an eighth of the Irish population belonged to the Church of Ireland. In some parishes, there were no Church of Ireland members at all, but there was still a priest paid for by tithes collected from the local Catholics and Presbyterians, leading to charges that idle priests were living in luxury at the expense of Irish people living at the level of subsistence. Grey's Act had reduced the number of bishoprics by half, abolished some of the sinecures and overhauled the tithe system. Further measures to appropriate the surplus revenues of the Church of Ireland were mooted by the more radical members of the Government, including Lord John Russell.Ziegler, pp. 242–255. The King had an especial dislike for Russell, calling him \"a dangerous little Radical.\"Molloy, p. 326."]}, {"page": "Monarchy of the United Kingdom", "response": ["From 1811 to 1820, George III suffered a severe bout of what is now believed to be porphyria, an illness rendering him incapable of ruling. His son, the future George IV, ruled in his stead as Prince Regent. During the Regency and his own reign, the power of the monarchy declined, and by the time of his successor, William IV, the monarch was no longer able to effectively interfere with parliamentary power. In 1834, William dismissed the Whig Prime Minister, William Lamb, 2nd Viscount Melbourne, and appointed a Tory, Sir Robert Peel. In the ensuing elections, however, Peel lost. The king had no choice but to recall Lord Melbourne. During William IV's reign, the Reform Act 1832, which reformed parliamentary representation, was passed. Together with others passed later in the century, the Act led to an expansion of the electoral franchise and the rise of the House of Commons as the most important branch of Parliament.Cannon and Griffiths, pp.530–550"]}]}}