{"wiki_id": "http://www.wikidata.org/entity/Q3132763", "itemLabel": "Henry Edwin Barnes", "itemDescription": "British naturalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Edwin_Barnes", "wikipedia_page": {"main": "Lieutenant Henry Edwin Barnes FZS (1848–1896) was born in Oxford and educated at Oxford University School. He worked in the Army stationed at Aden, Afghanistan and India. He wrote a Handbook to the Birds of the Bombay Presidency in 1885 and notes on birds at various places.", "link_mentions": [{"page": "Charles Swinhoe", "response": ["Swinhoe was a keen shikari and had shot 50-60 tigers. He was also a member of the British Ornithologists' Union and contributed papers to The Ibis on the birds of southern Afghanistan and central India, and donated 300 bird skins from each country to the British Museum. While at Mhow he collaborated with Lieutenant Henry Edwin Barnes on the birds of central India. (Ibis 1885: 62–69, 124–138) He collected insects, chiefly Lepidoptera from Bombay, Poona, Mhow and Karachi districts.  He had one of the largest collections of Indian Lepidoptera at the time (40,000 specimens of 7,000 species and 400 new species described by him), and completed the Lepidoptera Indica series after the death of Frederic Moore in 1907. He also published in the Annals and Magazine of Natural History. He also wrote A Revision of the Genera of the Family Liparidae which covered 1130 entries and published a Catalogue of the Moths of India (Calcutta, 1887–89) with Everard Charles Cotes. After retirement he settled at Oxford and received an honorary M.A. for his work in entomology. The Entomological Society of France made him an honorary member. His Lepidoptera collection was purchased by James John Joicey."]}, {"page": "Indian natural history", "response": ["The famous names in the ornithology of the Indian subcontinent during this era include Andrew Leith Adams (1827–1882), Edward Blyth (1810–1873), Edward Arthur Butler (1843–1916), Douglas Dewar (1875–1957), N. F. Frome (1899–1982),Frome, N F. (1922–1969) Notes on birds seen in India, in the British Isles, and elsewhere. Hugh Whistler (1889–1943), H. H. Godwin-Austen (1834–1923), Col. W. H. Sykes(1790–1872), C. M. Inglis (1870–1954), Frank Ludlow (1885–1972), E. C. Stuart Baker (1864–1944), Henry Edwin Barnes (1848–1896), F. N. Betts (1906–1973), H. R. Baker, W. E. Brooks (1828–1899), Margaret Cockburn (1829–1928), James A. Murray, E. W. Oates (1845–1911), Ferdinand Stoliczka (1838–1874), Valentine Ball (1843–1894), W. T. Blanford (1832–1905), J. K. Stanford (1892–1971), Charles Swinhoe (1836–1923), Robert Swinhoe (1836–1877), C. H. T. Marshall (1841–1927), G. F. L. Marshall (1843–1934), R. S. P. Bates, James Franklin (1783–1834), Satya Churn Law, Arthur Edward Osmaston (1885–1961), Bertram Beresford Osmaston (1868–1961), Wardlaw Ramsay (1852–1921) and Samuel Tickell (1811–1875). Several comprehensive works were written by Jerdon, Hume, Marshall and E. C. S. Baker. Popular works were also written by Frank Finn, Douglas Dewar and Hugh Whistler. Those who joined the Indian Civil Services in later years had access to these works and this period was mostly dominated by their short notes in journals published by organisations such as the BNHS, Asiatic Society and the BOU."]}, {"page": "Henry Barnes", "response": ["*Henry Edwin Barnes (1848–1896), English ornithologist"]}, {"page": "1893 in birding and ornithology", "response": ["*Henry Edwin Barnes (1893). \"On the Birds of Aden\". The Ibis."]}]}}