{"wiki_id": "http://www.wikidata.org/entity/Q313145", "itemLabel": "Colin Kazim-Richards", "itemDescription": "Turkish association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Kazim-Richards", "wikipedia_page": {"main": "Colin Kazim-Richards (born 26 August 1986), also known as Colin Kâzım, Kâzım or Kâzım Kâzım, is a professional footballer who plays as a forward for Championship club Derby County. \nBorn and raised in England, he qualified for Turkish nationality through his mother's heritage. An anglicised form of the Turkish given name Kâzım was intended to be a middle name, which would have rendered his full name as Colin Kazim Richards, but due to an error, he was legally registered as Colin Kazim-Richards.Having played as a junior for Queens Park Rangers and Arsenal, Kazim-Richards was handed a professional contract by Bury. He noted Bury as a pinpoint of his career. He found playing under former Manchester United player Chris Casper influential to his development. He also went on to feature in the Football League for Brighton & Hove Albion before transferring to Premier League side Sheffield United where he remained for one season. He has since forged a career in Europe with Fenerbahçe, Toulouse, Galatasaray and Olympiacos. In 2007, he chose to represent Turkey at international level, retiring in 2015. Kazim-Richards earned 37 caps, scoring twice.", "link_mentions": [{"page": "Feyenoord", "response": ["During the summer of the 2014–15 season, Feyenoord lost four of its best players: Daryl Janmaat to Newcastle United, Stefan de Vrij to Lazio, Bruno Martins Indi to Porto and Graziano Pellè to Southampton, with Southampton having just appointed Koeman as its new manager. To replace them, as well as other departed players, Feyenoord signed Warner Hahn from Dordrecht, Luke Wilkshire from Dynamo Moscow, Khalid Boulahrouz from Brøndby, Bilal Başaçıkoğlu from Heerenveen, Colin Kazim-Richards from Bursaspor, Jens Toornstra from Utrecht, Kenneth Vermeer from Ajax and Karim El Ahmadi from Aston Villa, returning to the club after two years in England."]}, {"page": "Walthamstow", "response": ["* Colin Kazim-Richards, footballer, was born in Leytonstone but schooled in Walthamstow"]}, {"page": "Leytonstone", "response": ["*Colin Kazim-Richards (born 1986), footballer"]}, {"page": "List of Eastern Caribbean people", "response": ["* Colin Kazim-Richards - football player (of Antiguan descent)"]}, {"page": "Bury F.C.", "response": ["*Forward Colin Kazim-Richards started his career as a 15-year-old at Bury in 2004, later going on to play for Turkey."]}, {"page": "List of Turkish people", "response": ["*Colin Kazim-Richards"]}, {"page": "Ali Sami Yen Stadium", "response": ["Galatasaray's final game at the stadium was their Turkish Cup match on 11 Jan 2011 against Beypazarı Şekerspor. The team badly wanted to win in order to enter the new stadium, Turk Telekom Arena respectfully. Having been 1-0 behind, goals from captain Arda Turan, defender Servet Çetin and Colin Kazim-Richards made the final score 3-1. The demolition of this stadium began in April 2011."]}, {"page": "Index of Turkey-related articles", "response": ["Cabira – Cabotage Day  – Caddebostan – Cadi – Cafercan Aksu – Cağaloğlu Hamam – Cağ kebab – Cahide Sonku – Cahit Arf – Cahit Arf – Cahit Sıtkı Tarancı – Cales – Callinicus II – Callinicus IV (III) – Callinicus V (IV) – Callipolis – Callistratia – Caloe – Cambodia–Turkey relations – Cameroon–Turkey relations – Campae – Camuliana – Canada–Turkey relations – Canae – Can Akın – Can Altıntığ – Canan Dağdeviren – Canan Tolon – Can Artam – Can Bartu – Candara – Can Dündar – Can Emre Yücel – Caner Erkin – Caner Topaloğlu – Can Korkmaz – Can Maxim Mutaf – Cansel Elçin – Cansu Dere – Can Yaman – Can Yücel – Capes of Turkey – Cape Verde–Turkey relations – Cappadocia  – Algiers (1516) – Peñón of Algiers (1529) – Caradja  – Carambis – Carene – Carissa – Carmylessus – Cartoon Network (Turkey) – Carura – Carussa – Carus Vicus – Caryanda – Castabus – Castle of Kars – Casystes – Cathedral of the Holy Cross, Aghtamar – Cavit Orhan Tütengil – Çeçil cheese – Cedi Osman – Cedreae – Celaenae – Celal Atik – Celaleddin Koçak – Celali rebellions – Celâl Şengör – Cem Adrian – Cemal Çavdarlı – Cemal Erçman – Cemal Hünal – Cemal Kafadar – Cemal Nalga – Cemal Oğuz – Cemal Reşit Rey – Cemal Süreya – Cem Demir – Cemilli Castle – Cemil Turan – Cem Karaca – Cem Kiziltug – Cem Pamiroğlu – Cem Sultan – Cemşir Muratoğlu – Cem Uzan – Cem UzanMehmet Aurélio – Cem Yıldırım – Cem Yılmaz – Cengiz Çandar – Cengiz Küçükayvaz – Cenk Akyol – Cenk İşler – Cenk Renda – Cennet and Cehennem – Central Finance and Contracts Unit (Turkey) – Ceramus – Cerasus – Ceren Sarper – Cevat Şakir Kabaağaçlı – Cevher Özer – Ceyda Aslı Kılıçkıran – Ceyda Ateş – Ceyhun Atuf Kansu – Ceyhun Eriş – Ceyhun Gülselam – Ceyhun Yıldızoğlu – Cezerye – Chadisia – Chad–Turkey relations –Chalcetor – Chamber of Electrical Engineers of Turkey – Chile–Turkey relations – China–Turkey relations – Chiprovtsi uprising – Chora Church  – Choria – Chris Başak – Christian Demirtas – Christos Iakovou – Chrysanthos Mentis Bostantzoglou – Chrysanthus – Chrysaoris – Chrysos Evelpidis – Cevizli sucuk – Church of Saint Mary of the Mongols  – Hatay, St. Pierre Church – Church of St. Anthony of Padua – Church of St. Mary of the Spring (Istanbul)  – Chytrium – Cici Kızlar – Cidramus – Çiğ börek – Ciğdem Balım – Cihan Can – Cihat Arman – Cilicians – Cimiata – Cindye – Cine5 – Cinema of Turkey – Cingöz Recai – Cinna – Cinolis – Circassian cheese – Ciscissus – Cisthene – Cizari – Claneus – Clannuda – Claros – Clement of Constantinople – Cleopatra's gate – Climate in Turkey – CNBC-e – CNN Türk – Colin Kazim-Richards – Colocasia with lamb – Colombia–Turkey relations – Colophon – Colossae – Colussa – Comana in the Pontus – Comitanassus – Communications in Turkey – Comoros–Turkey relations – Complex of Sultan Bayezid II – Congustus – Conium – Tunis – Constantine Anthopoulos – Constantine Levidis – Constantine Mourouzis – Constantine Paparrigopoulos – Constantine VI – Constantine V – Constantine Ypsilantis – Constantius II – Constantius I – Coralla – Cordyle – Corna – Cornelius Castoriadis – Corniaspa – Corn poppy with lamb – Cornucopia – Coropassus – Ancient City of Korykos – Coryphas – Cosmas III – Costa Rica–Turkey relations – Coşkun Birdal – Coşkun Göğen – Coşkun Kırca – Coşkun Özarı – Cotenna – Cratia – Crenides – Cretan Revolt (1866–69) – Cretan Revolt (1866–69) – Cretan Revolt (1878) – Cretan Turks – Cretan War (1645–69) – Croatia–Turkey relations – Cromen – Cromna – Cuba–Turkey relations – Culture of Turkey  – Cumhuriyet Anıtı – Cumhur Oranci – Cüneyt Arkın – Cüneyt Vicil – Cybeleia – Cybistra – Cyllandus – Cyme – Cyprianus – Cyprus dispute – Cyprus  – Cyptasia – Cyril I – Cyril II – Cyril III – Cyril IV – Cyril V – Cyril VI – Cyril VII – Cytorus – Cyzistra – Czech Republic–Turkey relations – CZN Burak – Čifte Hammam – Çağan Irmak – Çağatay Ulusoy – Çağdaş Atan – Çağla Büyükakçay – Çağla Kubat – Çatalhöyük – Çelebi Sultan Mehmed Mosque – Çemberlitaş Hamamı – Çengelköy – Çetin Altan – Çetin İnanç – Çetin Tekindor – Çetin Topçuoğlu – Çiçek Pasajı – Çiğ köfte – Çoban salad – Çolpan İlhan – Çömlek cheese – Çubuk-1 Dam – Çubuklu – Çukurcuma – Çılbır – Çınar Incident – Çırağan Palace"]}, {"page": "Deivid", "response": ["In the 2007–08 UEFA Champions League round of 16 against Sevilla in Spain, Deivid also scored two goals which carried the match to extra time and then penalties. With his goals Fenerbahçe eliminated Sevilla and made it to the quarter final of the tournament for the first time in their history. In the first leg of the quarter final match against Chelsea F.C. Deivid scored an own goal in the thirteenth minute, when an attempted Florent Malouda cross struck his foot and passed his own keeper. He atoned for this mistake when he scored an astonishing 35-yard shot 9 minutes from the finish to give Fenerbahce a 2–1 lead after Colin Kazim-Richards had equalised."]}, {"page": "Afro-Turks", "response": ["* Colin Kazim-Richards"]}, {"page": "Derby County F.C.", "response": ["The following season local businessman Mel Morris assumed ownership of the club. Morris initially oversaw a level of spending unprecedented in Derby's history, breaking the club's transfer record four times in his first three years, but also oversaw an equally unprecedented managerial turnover with nine managers in six years from June 2015. In this period the club endured three unsuccessful play-off campaigns, failing in the semi-finals twice and losing in the 2019 final to Aston Villa; in May 2021, the club, now managed by Wayne Rooney, narrowly avoided relegation to League One. Earlier, in October 2020, it was announced that Morris was intending to sell the club and was actively seeking new owners. A potential deal with a Middle Eastern-backed company was discontinued in March 2021, after which an agreed sale to a Spanish businessman, Erik Alonso, also fell through after doubts about Alonso's funding emerged, alongside possible EFL sanctions regarding breaches of financial fair play regulations (a deduction of nine points remained under consideration in mid-September 2021). On 8 July 2021, the EFL imposed a transfer embargo on the club, leaving Rooney with a squad of just nine contracted senior professionals; however, the EFL later relaxed the embargo but said any deals would have strict wage limits. Following a long-term injury to Colin Kazim-Richards in the early stage of the 2021–22 season, the club were given special dispensation by the EFL to bring in veteran defender Phil Jagielka and striker Sam Baldock."]}, {"page": "August 26", "response": ["*  1986   – Colin Kazim-Richards, Turkish footballer"]}, {"page": "Lee Williamson", "response": ["Williamson signed for Championship side Blackburn Rovers in an 18-month deal on 8 February 2013. He made his debut away at Arsenal in the fifth round of the FA Cup, playing the whole match in gloves alongside Jason Lowe as his new team produced a surprise 1–0 win, courtesy of a late Colin Kazim-Richards goal. On 14 September 2013, Williamson was red-carded in the East Lancashire derby against Burnley after fouling striker Danny Ings in a last man situation during injury time with the scores level at 1–1. This was well received by the fans of Blackburn Rovers as an admirable and selfless piece of good play for the sake of the team, preventing the first local derby defeat for 35 years (11 attempts). Williamson was roundly applauded for stopping Danny Ings being clean through."]}, {"page": "Racism in association football", "response": ["On 24 February 2021, Walsall and Aston Villa released joint statements condemning racist abuse that Tyreik Wright had received on Instagram. The messages were reported to both the social media platform and West Midlands Police's Hate Crime Unit for investigation. On 26 February 2021, Derby County player Colin Kazim-Richards received racist abuse on social media after their 1–1 draw with Nottingham Forest. Derbyshire Police announced an investigation into the abuse. On 6 March 2021, Derby County decided to stop taking the knee before future games as they felt it was a symbolic gesture and therefore not enough."]}, {"page": "Turkish nationality law", "response": ["A child adopted by a Turkish citizen automatically becomes a Turkish citizen if under 18 years old on the date the application for adoption was made.  In some cases (although it is not required), those who have foreign names and are applying for Turkish citizenship change their name to a Turkish  name. Examples of people who have done this include football players Colin Kazim-Richards and Mehmet Aurélio.From Bury to Brazil, the rise of a boy called Colin Kazim-Richards Times Online. Retrieved on 2009-04-13."]}]}}