{"wiki_id": "http://www.wikidata.org/entity/Q3133514", "itemLabel": "Herbert Waddell", "itemDescription": "Scottish rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Waddell", "wikipedia_page": {"main": "Herbert Waddell (19 September 1902 – 5 January 1988) was a Scottish rugby union fly-half who played club rugby for Glasgow Academicals and international rugby for Scotland and the British Isles. Waddell was heavily involved with the invitational tourist team, the Barbarians, not only playing for the club, but also became the fifth president of the club in 1973", "link_mentions": [{"page": "Barbarian F.C.", "response": ["*Herbert Waddell, 1973–1988"]}, {"page": "Justine Waddell", "response": ["Waddell was born in Johannesburg, South Africa. Her father, Gordon Waddell (1937–2012), was a Scottish rugby union player who captained the Scottish national team and played for the British and Irish Lions. He later became a Progressive Party Member of Parliament in South Africa, and a director of Anglo American PLC. Her grandfather, Herbert Waddell (1902–1988), also played rugby for Scotland and the Lions. Waddell moved with her family to Scotland when she was eleven. Four years later they moved to London. Waddell is the only member of her family to take up a career in acting. She read Social and Political Science at Emmanuel College, Cambridge, which allowed her to take time off from her studies to pursue her career."]}, {"page": "1924 British Lions tour to South Africa", "response": ["*Herbert Waddell (Glasgow Academicals and )"]}, {"page": "Glasgow Academicals RFC", "response": ["* 1963-64 Herbert Waddell ", "*   Herbert Waddell (first capped 1924) - 15 caps for Scotland and 3 tests for British Lions (SA 1924). - SRU President 1963-64"]}, {"page": "Gordon Waddell", "response": ["Gordon Herbert Waddell (12 April 1937 – 13 August 2012, in Glasgow) was a Scottish rugby union player, a South African politician, and the son of Herbert Waddell. He played for , the Barbarians and on two British and Irish Lions tours. In fact he is the only Scottish stand off to be a double lion.Massie, p156 He had 18 caps between 1957 and 1962 - this record for a Scotland fly-half was only later broken by John Rutherford. He played 12 times for the Barbarians between 1957 and 1960, scoring in three matches including their 1958 match against East Africa in Nairobi on 28 May 1958.Gordon Waddell  barbarianfc.co.uk In 1962 he was the controlling influence in Scotland's first win in  since the 1930s, a feat not repeated for another twenty years.", "Waddell was selected in his first year out of school while doing National Service, where he became a Royal Marine Commando, to play rugby for Devonport Services and the Royal Navy including the Calcutta Cup game in 1957. Between 1957 and 1962 Waddell won 18 caps for Scotland, 5 of which he won as Captain including the Test Match against South Africa in Port Elizabeth in 1960. In 1962 he was the controlling influence in Scotland's first win in  since the 1930s, a feat not repeated for another twenty years. During his 18 caps he was never dropped, although he had to leave because of injury - this record for a Scotland fly-half was only later broken by John Rutherford. Waddell and his father Herbert Waddell are one of the very few examples of a father and son having played for the same teams in the same position. Both were Fly Halves for Scotland and the British Lions."]}, {"page": "List of Scotland national rugby union players", "response": ["|422||WaddellHerbert Waddell||style=\"text-align:center; background:#A0D1F9;\"|fly-half||1924-01-01||v France at Paris"]}, {"page": "List of people educated at Fettes College", "response": ["* Herbert Waddell, Scottish international."]}, {"page": "The Glasgow Academy", "response": ["*Herbert Waddell Scottish rugby internationalist and president of the Barbarians (1902–1988)"]}, {"page": "Glasgow District (rugby union)", "response": ["*  Herbert Waddell"]}, {"page": "List of international rugby union families", "response": ["*Gordon Waddell and Herbert Waddell; Gordon was Herbert's son"]}, {"page": "Waddell (surname)", "response": ["* Cosslett Herbert Waddell (1858–1918), Irish clergyman and botanist", "* Herbert Waddell (1902–1988), Scottish rugby union footballer"]}, {"page": "List of Scottish Rugby Union Presidents", "response": ["|77||WaddellHerbert Waddell||1963-64"]}, {"page": "Malcolm Allan", "response": ["He was a Scottish Rugby Union committee member from 1931 and in 1950 he was acting as a selector - along with Herbert Waddell - for the Scotland international team."]}]}}