{"wiki_id": "http://www.wikidata.org/entity/Q3132807", "itemLabel": "Henry Goodman", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Goodman", "wikipedia_page": {"main": "Henry Goodman (born 23 April 1950) is a RADA trained English actor. He has appeared on television and radio, in film and in the theatre.", "link_mentions": [{"page": "Follies", "response": ["A production was mounted at London's Royal Festival Hall in a limited engagement. After previews from August 3, 2002, it opened officially on August 6, and closed on August 31, 2002. Paul Kerryson directed, and the cast starred David Durham as Ben, Kathryn Evans as Sally, Louise Gold as Phyllis, Julia Goss as Heidi and Henry Goodman as Buddy. Variety singer and performer Joan Savage sang \"Broadway Baby\".Gans, Andrew. \"Peters Withdraws from London Follies; Casting Almost Complete\" . playbill.com, July 8, 2002Beaumont, Sarah. \"Follies review\" . whatsonstage.com, August 7, 2002Bassett, Kate. \"'Follies', Royal Festival Hall, London\". The Independent, August 18, 2002 This production conducted by Julian Kelly featured the original Broadway score.\"Archive-'Follies, 2002\" . albemarle-london.com. Retrieved on December 31, 2010", "|colspan='1' align=center| Henry Goodman"]}, {"page": "The Resistible Rise of Arturo Ui", "response": ["The role of Ui has been played by such other notable actors as Peter Falk, Griff Rhys Jones, Leonard Rossiter, Antony Sher, Nicol Williamson, Henry Goodman Hugo Weaving, and Jean Vilar, as well as Australian actor John Bell. Simon Callow discussed his interpretation of the role in his autobiography, Being an Actor, while Plummer explains why he felt he failed in the role on Broadway in his autobiography, In Spite of Me."]}, {"page": "Woodstock", "response": ["Taking Woodstock was produced in 2009 by Taiwanese American filmmaker Ang Lee. Lee practically rented out the entire town of New Lebanon, New York, to shoot the film. He was initially concerned with angering the locals, but they ended up being very welcoming and willing to help with the film. The movie is based on Elliot Tiber, played by Demetri Martin, and his role in bringing Woodstock to Bethel, New York. The film also stars Jonathan Groff as Michael Lang, Daniel Eric Gold as Joel Rosenman, and Henry Goodman and Imelda Staunton as Jake and Sonia Teichberg."]}, {"page": "The Merchant of Venice", "response": ["** Set around 1930, Henry Goodman played Shylock."]}, {"page": "Assassins (musical)", "response": ["On October 29, 1992, Assassins opened in London at the Donmar Warehouse with direction by Sam Mendes and a cast that included Henry Goodman as Charles Guiteau and Louise Gold as Sara Jane Moore. The show ran for 76 performances, closing on January 9, 1993.", "| Henry Goodman", "|Henry Goodman"]}, {"page": "Ulysses (novel)", "response": ["BBC Radio 4 aired a new nine-part adaptation dramatised by Robin Brooks and produced/directed by Jeremy Mortimer, and starring Stephen Rea as the Narrator, Henry Goodman as Bloom, Niamh Cusack as Molly and Andrew Scott as Dedalus, for Bloomsday 2012, beginning on 16 June 2012."]}, {"page": "Four Past Midnight", "response": ["A three-episode radio adaptation was broadcast in 2003 on BBC Radio 4 starring Henry Goodman, William Roberts, Barbara Barnes, Lee Montague and Kerry Shale."]}, {"page": "Jonathan Coe", "response": ["In 2008 Coe wrote Say Hi to the Rivers and the Mountains, a 60-minute piece of what he calls \"spoken musical theatre\", with dialogue to be delivered continuously by three actors over a sequence of songs and instrumentals by The High Llamas. The work was premiered at the Analog Festival in Dublin that summer, and subsequently performed at various venues in the UK and Spain. The most recent performance was as part of the Notes and Letters Festival at Kings Place in London in September 2011, with Henry Goodman in the leading role of Bobby. The piece is inspired by the proposed demolition of Robin Hood Gardens, an East London council estate designed by Alison and Peter Smithson."]}, {"page": "Tevye", "response": ["Other noteworthy musical Tevyes have included Luther Adler, Herschel Bernardi, Paul Lipson (original Broadway run, over 2,000 performances), Leonard Nimoy (1971 touring company), Shmuel Rodensky (original Israeli, Yiddish and German productions), Alfred Molina and Harvey Fierstein (2004 Broadway revival), Henry Goodman (2007 London revival), Danny Burstein (2015 Broadway revival), Yehezkel Lazarov (2018 touring company) and Steven Skybell (2018 Off-Broadway revival in Yiddish). Paul Michael Glaser, who played Perchik in the 1971 film version, played Tevye in a 2013–14 touring production in the United Kingdom.."]}, {"page": "Yes Minister", "response": ["In January 2013, a new series of Yes, Prime Minister was launched on the Gold television channel. Jim Hacker is now portrayed as heading a coalition government, while dealing with an economic downturn, his coalition partner having a leadership crisis, and Scottish independence. Like the stage play, on which it was broadly based, it is set at Chequers. Filming took place in September 2012. Both David Haig and Henry Goodman reprised their stage roles as Jim Hacker and Sir Humphrey. Haig's Hacker was rather manic,Notably, \"A Tsar is Born\", episode broadcast 19 February 2013 while Goodman's Sir Humphrey was more aloof and supercilious than Hawthorne's had been. The other main characters were Bernard Woolley (Chris Larkin, reprising his role from The Gielgud Theatre run at London's West End) and Claire Sutton (Zoe Telford), the latter with a more prominent role than Hacker's special advisor in the original series. Critical reaction was largely negative. Jay and Lynn revealed that they had offered the show first to the BBC, but that the corporation had asked for a pilot episode which the writers thought was unnecessary in the light of the earlier series. The revived series ended up being produced by the BBC for Gold.", "Jay and Lynn collaborated again to produce a stage play which ran from 13 May to 5 June 2010, at Chichester Festival Theatre. This production revived at the Gielgud Theatre, in London's West End from 17 September 2010 until 15 January 2011. The principal cast was David Haig as Jim Hacker, Henry Goodman as Sir Humphrey, Jonathan Slinger as Bernard Woolley and Emily Joyce as Claire Sutton, Hacker's special policy advisor. This production, while following the spirit and tone of the original series in many respects, was set contemporaneously at Chequers, the Prime Minister's country residence, with BlackBerrys frequently in evidence,Remarkably, Sir Humphrey was able to show Bernard Woolley how to disable the Prime Minister's BlackBerry. and even included a topical reference to a coalition agreement which Sir Humphrey had drafted (the Conservatives and Liberal Democrats having formed a coalition government in Britain in May 2010).Antony Jay & Jonathan Lynn (2010) Yes, Prime Minister (the play) (Faber & Faber). In reality, during the negotiations that led to the coalition government in 2010, the two parties appear largely to have shunned support available to them from the civil service: see David Laws (2010) 22 Days in May and Rob Wilson (2010) 5 Days To Power, who concluded that, \"probably the influence of the civil service, including the Cabinet Secretary, in pushing the [parties] together to avoid a financial crisis has been overplayed\". The plot was a little more provocative and risqué than most of those seen previously (including a debate about the ethics of procuring a twelve-year-old as a sexual partner for a visiting dignitary,Yes, Prime Minister, act 1, scene 2 (pages 36–40) a proposition which it is suggested might be spun in the national interest as a \"euro-job\")Yes, Prime Minister, act 2, scene 1 (page 61). The suggestion of \"euro-job\" was prompted by Hacker's objection to \"Anglo-Kumranistan Liaison Project\" as \"a bit of a mouthful\": ibid. and included some stronger expletives (reflecting perhaps their widely reported use among New Labour's hierarchy between 1997 and 2010).See, for example, Alastair Campbell (2007) The Blair Years; Andrew Rawnsley (2010) The End of the Party; Anthony Seldon  & Guy Lodge (2010) Brown at 10. There was also a higher element of traditional farce.David Haig interviewed in Country Life, 8 September 2010"]}, {"page": "Fiddler on the Roof", "response": ["| style=\"text-align:center;\" | Henry Goodman", "After a two-month tryout at the Crucible Theatre in Sheffield, England, a London revival opened on May 19, 2007, at the Savoy Theatre starring Henry Goodman as Tevye, Beverley Klein as Golde, Alexandra Silber as Hodel, Damian Humbley as Perchik and Victor McGuire as Lazar Wolf. The production was directed by Lindsay Posner. Robbins' choreography was recreated by Sammy Dallas Bayes (who did the same for the 1990 Broadway revival), with additional choreography by Kate Flatt.Information about the 2007 London production of Fiddler on the Roof"]}, {"page": "Harold Pinter", "response": ["Diane Abbott, the Member of Parliament for Hackney North & Stoke Newington proposed an early day motion in the House of Commons to support a residents' campaign to restore the Clapton Cinematograph Theatre, established in Lower Clapton Road in 1910, and to turn it into a memorial to Pinter \"to honour this Hackney boy turned literary great.\"  On 2 May 2009, a free public memorial tribute was held at The Graduate Center of The City University of New York.  It was part of the 5th Annual PEN World Voices Festival of International Literature, taking place in New York City.  Another memorial celebration, held in the Olivier Theatre, at the Royal National Theatre, in London, on the evening of 7 June 2009, consisted of excerpts and readings from Pinter's writings by nearly three dozen actors, many of whom were his friends and associates, including: Eileen Atkins, David Bradley, Colin Firth, Henry Goodman, Sheila Hancock, Alan Rickman, Penelope Wilton, Susan Wooldridge, and Henry Woolf; and a troupe of students from the London Academy of Music and Dramatic Art, directed by Ian Rickson."]}, {"page": "Royal National Theatre", "response": ["* The Merchant of Venice directed by Trevor Nunn, with Henry Goodman (1999)"]}, {"page": "1996 in film", "response": ["| Mary Reilly || TriStar Pictures || Stephen Frears (director); Christopher Hampton (screenplay); Julia Roberts, John Malkovich, Michael Sheen, George Cole, Michael Gambon, Glenn Close, Kathy Staff, Bronagh Gallagher, Linda Bassett, Henry Goodman, Ciaran Hinds, Tim Barlow, Stephen Boxer, Bob Mason, Isabella Marsh, Richard Leaf, Wendy Nottingham, Ellie Crockett, Robbi Stevens, Kadamba Simmons, Evelyn Doggart, Pui Fan Lee, Mimi Potworowska, Samantha Hones, Julia Hagen || Horror || Live action"]}, {"page": "1997 in film", "response": ["| The Saint || Paramount Pictures / Rysher Entertainment || Phillip Noyce (director); Jonathan Hensleigh, Wesley Strick (screenplay); Val Kilmer, Elisabeth Shue, Rade Šerbedžija, Valery Nikolaev, Henry Goodman, Alun Armstrong, Michael Byrne, Yevgeni Lazarev, Irina Apeksimova, Lucija Šerbedžija, Lev Prygunov, Charlotte Cornwell, Tommy Flanagan, Egor Pazenko, Adam Smith, Roger Moore, David Schneider, William Hope, Emily Mortimer || Thriller || Live action"]}, {"page": "1999 in film", "response": ["| Notting Hill || Universal Pictures || Roger Michell (director); Richard Curtis (screenplay); Julia Roberts, Hugh Grant, Richard McCabe, Rhys Ifans, James Dreyfus, Dylan Moran, Hugh Bonneville, Emma Chambers, Tim McInnerny, Gina McKee, Henry Goodman, Julian Rhind-Tutt, Lorelei King, John Shrapnel, Clarke Peters, Arturo Venegas, Yolanda Vazquez, Mischa Barton, Emily Mortimer, Samuel West, Ann Beach, Alec Baldwin, Simon Callow, Joe Cornish, Matthew Modine || Romance, Comedy, Drama || Live action"]}, {"page": "1989 in film", "response": ["| Murderers Among Us: The Simon Wiesenthal Story || HBO Pictures / Citadel Entertainment || Brian Gibson (director); Abby Mann, Robin Vote, Ron Hutchinson (screenplay); Ben Kingsley, Renée Soutendijk, Craig T. Nelson, Anton Lesser, Jack Shepherd, Paul Freeman, David Threlfall, Anna Cropper, Vernon Dobtcheff, Oliver Ford Davies, Philip Franks, Zoltán Gera, Patrick Godfrey, Henry Goodman, Jack Klaff, Carol MacReady, Miriam Margoyles, Harry Towb, Louisa Milwood-Haigh, Robert Morelli, Sándor Téri || Biography || Live action "]}, {"page": "Notting Hill (film)", "response": ["* Henry Goodman as the Ritz concierge"]}, {"page": "Chicago (musical)", "response": ["| Henry Goodman", "On November 18, 1997, the revival production opened in London's West End.\"Timeline\"  chicagothemusical.com\"Chicago\" listing thisistheatre.com, accessed May 27, 2009  Like the New York revival, it was directed by Walter Bobbie and designed by John Lee Beatty, with choreography by Ann Reinking in the style of Bob Fosse.Bosanquet, Theo. \"Ugly Betty's America Ferrera Leads Chicago at Garrick , WhatsOnStage, October 10, 2011  The show ran at the Adelphi Theatre for nine years until transferring to the Cambridge Theatre in April 2006.\"'Chicago the Musical' at Cambridge Theatre listing\" thisistheatre.com, retrieved January 2, 2011  The original cast of the production included German jazz singer Ute Lemper as Velma, British actress Ruthie Henshall as Roxie Hart, Nigel Planer as Amos Hart, and Henry Goodman as Billy Flynn. The production won the 1998 Olivier Award for Outstanding Musical, and Lemper was awarded Best Actress in a Musical. Both Lemper and Henshall have played the role of Velma on Broadway.", "| Henry Goodman"]}, {"page": "Bloomsday", "response": ["BBC Radio Four devoted most of its broadcasting on 16 June 2012, to a dramatisation of Ulysses, with additional comments from critic Mark Lawson talking to Joyce scholars. In the dramatisation, Molly Bloom was played by Niamh Cusack, Leopold Bloom by Henry Goodman, Stephen Daedalus by Andrew Scott, and the Narrator was Stephen Rea."]}, {"page": "Guys and Dolls", "response": ["Richard Eyre repeated his 1982 success with another National Theatre revival of the show, this time in a limited run. It starred Henry Goodman as Nathan Detroit, Imelda Staunton returning as Adelaide, Clarke Peters returning as Sky and Joanna Riding as Sarah. Clive Rowe played Nicely-Nicely Johnson, and David Toguri returned as choreographer. The production ran from December 17, 1996, through March 29, 1997 and from July 2, 1997, to November 22, 1997.Guys and Dolls at the UK Theatre Web\"\"Guys and Dolls', 1996\" broadwayworld.com, retrieved May 28, 2010 It received three Olivier Award nominations, winning one: Best Supporting Performance in a Musical went to Clive Rowe. \"Olivier Winners 1997\"  officiallondontheatre.co.uk, retrieved May 28, 2010 Richard Eyre won the Critics' Circle Theatre Award for Best Director, and the production won Best Musical."]}, {"page": "Angels in America", "response": ["Millennium Approaches premiered in May 1991 in a production performed by the Eureka Theatre Company of San Francisco, directed by David Esbjornson. In London it premiered in a National Theatre production at the Cottesloe Theatre, directed by Declan Donnellan.From the programme to the RNT's production of Millennium Approaches in 1992. Henry Goodman played Cohn, Nick Reding played Joe, Felicity Montagu played Harper, Marcus D'Amico played Louis, and Sean Chapman played Prior. Opening on January 23, 1992, the London production ran for a year. In November 1992 it visited Düsseldorf as part of the first Union des Théâtres de l'Europe festival.From the programme to the RNT's production of Millennium Approaches and Perestroika in 1993.", "|Henry Goodman"]}, {"page": "A Prayer for Owen Meany", "response": ["In 2009, the BBC aired Linda Marshall Griffiths' adaptation of A Prayer for Owen Meany starring Henry Goodman, Toby Jones, Charlotte Emmerson and Max Baldry as a five-part Afternoon Play on BBC Radio Four."]}, {"page": "Cold Lazarus", "response": ["At a cryonics research institute in London, funded by the pharmaceuticals tycoon Martina Masdon (played by Diane Ladd), a group of scientists led by Dr. Emma Porlock (Frances de la Tour) is working on reviving the mind of the 20th-century writer Daniel Feeld (Albert Finney), whose head was frozen after Feeld's death shortly after the events of Karaoke. Unable to see any profit in the project, Masdon considers discontinuing it, but the media mogul David Siltz (Henry Goodman), who has been spying on Masdon, envisages making a fortune from broadcasting Feeld's memories on TV, and proposes to Porlock that her team work for him.", "*Henry Goodman as David Siltz"]}, {"page": "The Old Vic", "response": ["* The Winslow Boy by Terence Rattigan, directed by Lindsay Posner, starring Henry Goodman"]}, {"page": "Gielgud Theatre", "response": ["*2010: Yes, Prime Minister by Antony Jay and Jonathan Lynn, starring David Haig and Henry Goodman"]}, {"page": "War with the Newts", "response": ["In 2005 a BBC Radio adaption was produced, starring Dermot Crowley, Sally Hawkins, Henry Goodman, Geoffrey Beevers, Tina Gray, and Adrian Scarborough."]}, {"page": "Ronni Ancona", "response": ["She then played the gold-digging temptress Belline in Richard Bean's 2005 production of Molière's The Hypochondriac, alongside Carey Mulligan and Henry Goodman. The play received favourable reviews, with Michael Billington for The Guardian giving it four stars out of five and describing it as a \"hilarious new version\"."]}]}}