{"wiki_id": "http://www.wikidata.org/entity/Q313758", "itemLabel": "Philip Larkin", "itemDescription": "English poet, novelist, jazz critic and librarian", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Larkin", "wikipedia_page": {"main": "Philip Arthur Larkin  (9 August 1922 – 2 December 1985) was an English poet, novelist, and librarian. His first book of poetry, The North Ship, was published in 1945, followed by two novels, Jill (1946) and A Girl in Winter (1947), and he came to prominence in 1955 with the publication of his second collection of poems, The Less Deceived, followed by The Whitsun Weddings (1964) and High Windows (1974). He contributed to The Daily Telegraph as its jazz critic from 1961 to 1971, with his articles gathered in All What Jazz: A Record Diary 1961–71 (1985), and edited The Oxford Book of Twentieth Century English Verse (1973). His many honours include the Queen's Gold Medal for Poetry. He was offered, but declined, the position of Poet Laureate in 1984, following the death of Sir John Betjeman.\nAfter graduating from Oxford University in 1943 with a first in English Language and Literature, Larkin became a librarian. It was during the thirty years he worked with distinction as university librarian at the Brynmor Jones Library at the University of Hull that he produced the greater part of his published work. His poems are marked by what Andrew Motion calls \"a very English, glum accuracy” about emotions, places, and relationships, and what Donald Davie described as \"lowered sights and diminished expectations\". Eric Homberger (echoing Randall Jarrell) called him \"the saddest heart in the post-war supermarket\"—Larkin himself said that deprivation for him was “what daffodils were for Wordsworth”. Influenced by W. H. Auden, W. B. Yeats, and Thomas Hardy, his poems are highly structured but flexible verse forms. They were described by Jean Hartley, the ex-wife of Larkin's publisher George Hartley (the Marvell Press), as a \"piquant mixture of lyricism and discontent\", though anthologist Keith Tuma writes that there is more to Larkin's work than its reputation for dour pessimism suggests.Larkin's public persona was that of the no-nonsense, solitary Englishman who disliked fame and had no patience for the trappings of the public literary life. The posthumous publication by Anthony Thwaite in 1992 of his letters triggered controversy about his personal life and political views, described by John Banville as hair-raising, but also in places hilarious. Lisa Jardine called him a \"casual, habitual racist, and an easy misogynist\", but the academic John Osborne argued in 2008 that \"the worst that anyone has discovered about Larkin are some crass letters and a taste for porn softer than what passes for mainstream entertainment\". Despite the controversy Larkin was chosen in a 2003 Poetry Book Society survey, almost two decades after his death, as Britain's best-loved poet of the previous 50 years, and in 2008 The Times named him Britain's greatest post-war writer.In 1973 a Coventry Evening Telegraph reviewer referred to Larkin as \"the bard of Coventry\", but in 2010, 25 years after his death, it was Larkin's adopted home city, Kingston upon Hull, that commemorated him with the Larkin 25 Festival which culminated in the unveiling of a statue of Larkin by Martin Jennings on 2 December 2010, the 25th anniversary of his death. On 2 December 2016, the 31st anniversary of his death, a floor stone memorial for Larkin was unveiled at Poets' Corner in Westminster Abbey.", "link_mentions": [{"page": "August 9", "response": ["*1922 – Philip Larkin, English poet and novelist (d. 1985)"]}, {"page": "December 2", "response": ["*1985 – Philip Larkin, English poet, author, and librarian (b. 1922)"]}, {"page": "Dylan Thomas", "response": ["Thomas was a teenager when many of the poems for which he became famous were published: \"And death shall have no dominion\", \"Before I Knocked\" and \"The Force That Through the Green Fuse Drives the Flower\". \"And death shall have no dominion\" appeared in the New English Weekly in May 1933. When \"Light breaks where no sun shines\" appeared in The Listener in 1934, it caught the attention of three senior figures in literary London, T. S. Eliot, Geoffrey Grigson and Stephen Spender.Ferris (1989), p. 91Ferris (1989), p. 102 They contacted Thomas and his first poetry volume, 18 Poems, was published in December 1934. 18 Poems was noted for its visionary qualities which led to critic Desmond Hawkins writing that the work was \"the sort of bomb that bursts no more than once in three years\". The volume was critically acclaimed and won a contest run by the Sunday Referee, netting him new admirers from the London poetry world, including Edith Sitwell and Edwin Muir. The anthology was published by Fortune Press, in part a vanity publisher that did not pay its writers and expected them to buy a certain number of copies themselves.  A similar arrangement was used by other new authors including Philip Larkin. In September 1935, Thomas met Vernon Watkins, thus beginning a lifelong friendship. Thomas introduced Watkins, working at Lloyds Bank at the time, to his friends, now known as The Kardomah Gang. In those days, Thomas used to frequent the cinema on Mondays with Tom Warner who, like Watkins, had recently suffered a nervous breakdown. After these trips, Warner would bring Thomas back for supper with his aunt. On one occasion, when she served him a boiled egg, she had to cut its top off for him, as Thomas did not know how to do this. This was because his mother had done it for him all his life, an example of her coddling him. Years later, his wife Caitlin would still have to prepare his eggs for him.", "Many critics have argued that Thomas's work is too narrow and that he suffers from verbal extravagance. Those that have championed his work have found the criticism baffling. Robert Lowell wrote in 1947, \"Nothing could be more wrongheaded than the English disputes about Dylan Thomas's greatness ... He is a dazzling obscure writer who can be enjoyed without understanding.\" Kenneth Rexroth said, on reading Eighteen Poems, \"The reeling excitement of a poetry-intoxicated schoolboy smote the Philistine as hard a blow with one small book as Swinburne had with Poems and Ballads.\" Philip Larkin in a letter to Kingsley Amis in 1948, wrote that \"no one can 'stick words into us like pins'... like he [Thomas] can\", but followed that by stating that he \"doesn't use his words to any advantage\". Amis was far harsher, finding little of merit in his work, and claiming that he was 'frothing at the mouth with piss.' In 1956, the publication of the anthology New Lines featuring works by the British collective The Movement, which included Amis and Larkin amongst its number, set out a vision of modern poetry that was damning towards the poets of the 1940s. Thomas's work in particular was criticised. David Lodge, writing about The Movement in 1981 stated \"Dylan Thomas was made to stand for everything they detest, verbal obscurity, metaphysical pretentiousness, and romantic rhapsodizing\"."]}, {"page": "List of English-language poets", "response": ["*Philip Larkin (1922–1985, E)"]}, {"page": "Kingsley Amis", "response": ["Amis was raised at Norbury – in his later estimation \"not really a place, it's an expression on a map [–] really I should say I came from Norbury station.\"Bookmark, BBC TV, \"Kingsley Amis: The Memoirs\". In 1940, the Amises moved to Berkhamsted, Hertfordshire. He was educated at the City of London School (as his father had been)Memoirs (2004), pp. xvi and 14. on a scholarship, after his first year, and in April 1941 was admitted to St John's College, Oxford, also on a scholarship, where he read English. It was there he met Philip Larkin, with whom he formed the most important friendship of his life. While at Oxford in June 1941, Amis joined the Communist Party of Great Britain,Leader (2006), p. 108, although he broke with communism in 1956, in view of Soviet leader Nikita Khrushchev's denunciation of Joseph Stalin in his speech On the Cult of Personality and Its Consequences.Martin Amis (2002). In July 1942, he was called up for national service and served in the Royal Corps of Signals. He returned to Oxford in October 1945 to complete his degree. Although he worked hard and earned a first in English in 1947, he had decided by then to give much of his time to writing.", "Amis is widely known as a comic novelist of life in mid to late 20th-century Britain, but his literary work covered many genres – poetry, essays, criticism, short stories, food and drink, anthologies, and several novels in genres such as science fiction and mystery. His career initially developed in an inverse pattern to that of his close friend Philip Larkin's. Before becoming known as a poet, Larkin had published two novels; Amis originally sought to be a poet and turned to novels only after publishing several volumes of verse. He continued throughout his career to write poetry, in a straightforward, accessible style that often masks a nuance of thought."]}, {"page": "The Beatles", "response": ["Former Rolling Stone associate editor Robert Greenfield compared the Beatles to Picasso, as \"artists who broke through the constraints of their time period to come up with something that was unique and original ... [I]n the form of popular music, no one will ever be more revolutionary, more creative and more distinctive ...\" The British poet Philip Larkin described their work as \"an enchanting and intoxicating hybrid of Negro rock-and-roll with their own adolescent romanticism\", and \"the first advance in popular music since the War\"."]}, {"page": "Ted Hughes", "response": ["Hughes was appointed Poet Laureate in 1984 following the death of John Betjeman. It was later known that Hughes was second choice for the appointment. Philip Larkin, the preferred nominee, had declined, because of ill health and a loss of creative momentum, dying a year later. Hughes served in this position until his death in 1998. In 1992 Hughes published Shakespeare and the Goddess of Complete Being, a monumental work inspired by Graves's The White Goddess. The book, considered Hughes's key work of prose, had a mixed reception \"divided between those who considered it an important and original appreciation of Shakespeare’s complete works, whilst others dismissed it as a lengthy and idiosyncratic appreciation of Shakespeare refracted by Hughes’s personal belief system\". Hughes himself later suggested that the time spent writing prose was directly responsible for a decline in his health. Also in 1992, Hughes published Rain Charm for the Duchy, collecting together for the first time his Laureate works, including poems celebrating important royal occasions. The book also contained a section of notes throwing light on the context and genesis of each poem.", "In 2010, it was announced that Hughes would be commemorated with a memorial in Poets' Corner in Westminster Abbey.Poets' Corner memorial for Ted Hughes, BBC News, 22 March 2010 On 6 December 2011, a slab of Kirkstone green slate was ceremonially placed at the foot of the memorial commemorating T. S. Eliot.Ted Hughes takes his place in Poets' Corner, BBC News, 2 November 2011 Poet Seamus Heaney and actress Juliet Stevenson gave readings at the ceremony, which was also attended by Hughes's widow Carol and daughter Frieda, and by the poets Simon Armitage, Blake Morrison, Andrew Motion and Michael Morpurgo. Motion paid tribute to Hughes as \"one of the two great poets of the last half of the last century\" (the other being Philip Larkin). Hughes's memorial stone bears lines from \"That Morning\", a poem recollecting the epiphany of a huge shoal of salmon flashing by as he and his son Nicholas waded a stream in Alaska: \"So we found the end of our journey / So we stood alive in the river of light / Among the creatures of light, creatures of light.\""]}, {"page": "University of Oxford", "response": ["Writers associated with Oxford include Vera Brittain, A.S. Byatt, Lewis Carroll, Penelope Fitzgerald, John Fowles, Theodor Geisel, Robert Graves, Graham Greene, Joseph Heller, Christopher Hitchens, Aldous Huxley, Samuel Johnson, Nicole Krauss, C. S. Lewis, Thomas Middleton, Iris Murdoch, V.S. Naipaul, Philip Pullman, Dorothy L. Sayers, Vikram Seth, J. R. R. Tolkien, Evelyn Waugh, Oscar Wilde, the poets Percy Bysshe Shelley, John Donne, A. E. Housman, Gerard Manley Hopkins, W. H. Auden, T. S. Eliot and Philip Larkin, and seven poets laureate: Thomas Warton, Henry James Pye, Robert Southey, Robert Bridges, Cecil Day-Lewis, Sir John Betjeman, and Andrew Motion."]}, {"page": "W. H. Auden", "response": ["In the US, starting in the late 1930s, the detached, ironic tone of Auden's regular stanzas became influential; John Ashbery recalled that in the 1940s Auden \"was the modern poet\". Auden's formal influences were so pervasive in American poetry that the ecstatic style of the Beat Generation was partly a reaction against his influence. From the 1940s through the 1960s, many critics lamented that Auden's work had declined from its earlier promise; Randall Jarrell wrote a series of essays making a case against Auden's later work, and Philip Larkin's \"What's Become of Wystan?\" (1960) had a wide impact.Haffenden, pp. 414–19."]}, {"page": "1960s", "response": ["* Philip Larkin"]}, {"page": "1985", "response": ["* December 2 – Philip Larkin, English poet and novelist (b. 1922)"]}, {"page": "1922", "response": ["* August 9 – Philip Larkin, English poet (d. 1985)"]}, {"page": "Kenneth Williams", "response": ["The first of the programmes said that, towards the end of his life and struggling with depression and ill health, Williams abandoned Christianity following discussions with the poet Philip Larkin. Williams had been brought up a Wesleyan and then a Methodist, though he spent much of his life struggling with Christianity's teachings on homosexuality."]}, {"page": "Aston Villa F.C.", "response": ["Villa have also featured on several occasions in prose. Stanley Woolley, a character in Derek Robinson's Booker shortlisted novel Goshawk Squadron is an Aston Villa fan and names a pre-war starting eleven Villa side. Together with The Oval, Villa Park is referenced by the poet Philip Larkin in his poem about the First World War, MCMXIV.As if they were stretched outside The Oval or Villa Park, Philip Larkin, MCMXIV. Aston Villa are also mentioned in Harold Pinter's play The Dumb Waiter. "]}, {"page": "Thomas Hardy", "response": ["While Hardy wrote poetry throughout his life and regarded himself primarily as a poet, his first collection was not published until 1898. Initially, he gained fame as the author of novels such as Far from the Madding Crowd (1874), The Mayor of Casterbridge (1886), Tess of the d'Urbervilles (1891), and Jude the Obscure (1895). During his lifetime, Hardy's poetry was acclaimed by younger poets (particularly the Georgians) who viewed him as a mentor. After his death his poems were lauded by Ezra Pound, W. H. Auden and Philip Larkin.", "Considered a Victorian realist, Hardy examines the social constraints on the lives of those living in Victorian England, and criticises those beliefs, especially those relating to marriage, education and religion, that limited people's lives and caused unhappiness. Such unhappiness, and the suffering it brings, is seen by poet Philip Larkin as central in Hardy's works:", "Although his poems were initially not as well received as his novels had been, Hardy is now recognised as one of the great poets of the 20th century, and his verse had a profound influence on later writers, including Robert Frost, W. H. Auden, Dylan Thomas, and Philip Larkin. Larkin included 27 poems by Hardy compared with only nine by T. S. Eliot in his edition of the Oxford Book of Twentieth Century English Verse in 1973. There were fewer poems by W. B. Yeats.\"Thomas Hardy\", The Norton Anthology of English Literature, 7th edition, vol.2, p. 1916."]}, {"page": "Coventry", "response": ["* The poet Philip Larkin was born and brought up in Coventry, where his father was the City Treasurer.", "Dame Ellen Terry, one of the greatest Shakespearean actors, was born in Coventry in 1847. Other Coventrians in the arts include the poet Philip Larkin, comedian Guz Khan, actors Charles Kay, Billie Whitelaw, Nigel Hawthorne, Brendan Price and Clive Owen, authors Cyril Connolly, Graham Joyce, Lee Child and Mark Barrowcliffe, and playwrights Chris O'Connell and Alan Pollock and The Inbetweeners actress Tamla Kari."]}, {"page": "Baby boomers", "response": ["In the United Kingdom, the Lady Chatterley trial (1959) and the first long-play of the Beatles, Please Please Me (1963) were to begin the process of altering public perception of human mating, a cause subsequently taken up by young people seeking personal liberation.See this 1974 poem by the poet Philip Larkin."]}, {"page": "Misanthropy", "response": ["Gustave Flaubert once declared that he would \"die of suppressed rage at the folly of [his] fellow men.\" Misanthropy has also been ascribed to a number of writers of satire, such as William S. Gilbert (\"I hate my fellow-man\") and William Shakespeare (Timon of Athens). Jonathan Swift is widely believed to have been misanthropic (see A Tale of a Tub and, most especially, Book IV of Gulliver's Travels). Poet Philip Larkin has been described as a misanthrope."]}, {"page": "Barbara Pym", "response": ["Barbara Mary Crampton Pym FRSL (2 June 1913 – 11 January 1980) was an English novelist. In the 1950s she published a series of social comedies, of which the best known are Excellent Women (1952) and A Glass of Blessings (1958). In 1977 her career was revived when the critic Lord David Cecil and the poet Philip Larkin both nominated her as the most under-rated writer of the century. Her novel Quartet in Autumn (1977) was nominated for the Booker Prize that year, and she was elected as a Fellow of the Royal Society of Literature.", "After some years of submitting stories to women's magazines, Pym heavily revised Some Tame Gazelle which this time was accepted by Jonathan Cape for publication in 1950.Christopher Fowler, \"Invisible Ink: No. 68\", The Independent, 13 March 2011, accessed 30 September 2011 The poet Philip Larkin regarded Some Tame Gazelle as Pym's Pride and Prejudice. The novel follows the lives of two middle-aged spinster sisters in an English village before the War, who are both given the possibility of love. That year, Pym also had a radio play – Something to Remember – accepted by the BBC.Holt 1990, p. 145", "In 1961, Pym began a letter-writing correspondence with Philip Larkin, as he was preparing to write a review article of one of her novels.Pym 1984, p.214 They continued a constant series of letters for 19 years, right up until her death. They met for the first time in April 1975, at the Randolph Hotel, Oxford.", "Philip Larkin said, \"I'd sooner read a new Barbara Pym than a new Jane Austen\". Shirley Hazzard was a fan of Pym's work, which she described as \"penetrating, tender, and... greatly daring\". The novelist Anne Tyler wrote about her work:Holt 1990, p.276"]}, {"page": "Elizabeth Jennings", "response": ["Regarded as traditionalist rather than an innovator, Jennings is known for her lyric poetry and mastery of form. Her work displays a simplicity of metre and rhyme shared with Philip Larkin, Kingsley Amis and Thom Gunn, all members of the group of English poets known as The Movement. She always made it clear that, whilst her life, which included a spell of severe mental illness, contributed to the themes contained within her work, she did not write explicitly autobiographical poetry. Her deeply held Roman Catholicism coloured much of her work."]}, {"page": "Somerville College, Oxford", "response": ["*Somerville is the recognisable model for St Bride's College in Michaelmas Term at St Bride's by Brunette Coleman (Philip Larkin)."]}, {"page": "Betelgeuse", "response": ["The Philip Larkin poem \"The North Ship\", found in the collection of the same name, references the star in the section titled \"Above 80° N\", which reads:\" 'A woman has ten claws,' /"]}, {"page": "Kingston upon Hull", "response": [" Visitors to Hull's Paragon Interchange are now greeted by the new statue of Philip Larkin unveiled on 2 December 2010.", "Philip Larkin set many of his poems in Hull; these include \"The Whitsun Weddings\", \"Toads\", and \"Here\".", "In 2010, Hull marked the 25th anniversary of the death of the poet Philip Larkin with the Larkin 25 Festival. This included the popular Larkin with Toads public art event. The 40 Larkin toads were displayed around Hull and later sold off in a charity auction. A charity appeal raised funds to cast a life-size bronze statue of Philip Larkin, to a design by Martin Jennings, at Hull Paragon Interchange. The statue was unveiled at a ceremony attended by the Lord Mayor of Hull on 2 December 2010, the 25th anniversary of Larkin's death. It bears an inscription drawn from the first line of Larkin's poem, 'The Whitsun Weddings'.", "The astrophysicist Edward Arthur Milne and logician John Venn both hailed from Hull. The poet Philip Larkin lived in Hull for 30 years and wrote much of his mature work in the city. Artist David Remfry RA studied at Hull College of Art before moving to London and New York."]}, {"page": "Evelyn Waugh", "response": ["In 1973, Waugh's diaries were serialised in The Observer prior to publication in book form in 1976. The revelations about his private life, thoughts and attitudes created controversy. Although Waugh had removed embarrassing entries relating to his Oxford years and his first marriage, there was sufficient left on the record to enable enemies to project a negative image of the writer as intolerant, snobbish and sadistic, with pronounced fascist leanings. Some of this picture, it was maintained by Waugh's supporters, arose from poor editing of the diaries, and a desire to transform Waugh from a writer to a \"character\".Review by Geoffrey Wheatcroft of The Letters of Evelyn Waugh, Spectator, 11 October 1980. Reprinted in Stannard: Evelyn Waugh: The Critical Heritage, pp. 504–07 Nevertheless, a popular conception developed of Waugh as a monster.Hastings, p. 627 When, in 1980, a selection of his letters was published, his reputation became the subject of further discussion. Philip Larkin, reviewing the collection in The Guardian, thought that it demonstrated Waugh's elitism; to receive a letter from him, it seemed, \"one would have to have a nursery nickname and be a member of White's, a Roman Catholic, a high-born lady or an Old Etonian novelist\".Review by Philip Larkin of The Letters of Evelyn Waugh, The Guardian, 4 September 1980. Reprinted in Stannard: Evelyn Waugh: The Critical Heritage, pp. 502–04"]}, {"page": "The Spectator", "response": ["*Philip Larkin began to contribute poems and reviews to The Spectator in 1953."]}, {"page": "List of poets", "response": ["*Philip Larkin (1922–1985), English poet and novelist"]}, {"page": "Victor Gollancz", "response": ["Victor married Ruth Gollancz née Lowy, an artist who had studied at the Slade School of Art under Henry Tonks. The couple had five daughtersDudley Edwards, R: Victor Gollancz: A Biography page 25. Victor Gollancz Ltd, 1987. among them Vita Gollancz, an artist; Livia Ruth Gollancz, musician and later head of Victor Gollancz Ltd; and Diana Gollancz, a confidante of poet Philip Larkin."]}, {"page": "List of winners and shortlisted authors of the Booker Prize", "response": ["| rowspan=\"6\"| Philip Larkin"]}, {"page": "School and university in literature", "response": ["* Philip Larkin: Jill "]}, {"page": "Excellent Women", "response": ["In a 14 July 1964 letter, having just re-read Excellent Women, the poet Philip Larkin wrote to Pym saying that the novel was \"better than I remembered it, full of a harsh kind of suffering [-] it's a study of the pain of being single,- time and again one senses not only that Mildred is suffering but that nobody can see why she shouldn't suffer, like a Victorian cabhorse. \" And again in a letter of 1971 he praised the book, - \"what a marvellous set of characters it contains! My only criticism is that Mildred is a tiny bit too humble at times, but perhaps she's satirising herself. I never see any Rockys, but almost every young academic wife ('I'm a shit') has something of Helena.\"Selected letters of Philip Larkin, Faber 1992,  p.368, 442"]}, {"page": "Thelonious Monk", "response": ["Monk's style was not universally appreciated. For example, the poet and jazz critic Philip Larkin described him as \"the elephant on the keyboard\".Larkin, P. All What Jazz: A Record Diary 1961-1971. London: Faber and Faber. "]}, {"page": "Martin Amis", "response": ["In December 2016, Amis announced two new projects. The first, a collection of journalism, titled The Rub of Time: Bellow, Nabokov, Hitchens, Travolta, Trump. Essays and Reportage, 1986–2016, was published in October 2017. The second project, a new untitled novel which Amis is currently working on, is an autobiographical novel about three key literary figures in his life: the poet Philip Larkin, American novelist Saul Bellow, and noted public intellectual Christopher Hitchens. In an interview with livemint.com, Amis said of the novel-in-progress, \"I’m writing an autobiographical novel that I’ve been trying to write for 15 years. It’s not so much about me, it’s about three other writers—a poet, a novelist and an essayist—Philip Larkin, Saul Bellow and Christopher Hitchens, and since I started trying to write it, Larkin died in 1985, Bellow died in 2005, and Hitch died in 2011, and that gives me a theme, death, and it gives me a bit more freedom, and fiction is freedom. It’s hard going but the one benefit is that I have the freedom to invent things. I don’t have them looking over my shoulder anymore.\"", "From October 2007 to July 2011, at Manchester University's Whitworth Hall and Cosmo Rodewald Concert Hall, Amis regularly engaged in public discussions with other experts on literature and various topics (21st-century literature, terrorism, religion, Philip Larkin, science, Britishness, suicide, sex, ageing, his 2010 novel The Pregnant Widow, violence, film, the short story, and America)."]}, {"page": "Chichester Cathedral", "response": ["Among the famous graves are those of the composer Gustav Holst and the Gothic \"Arundel tomb\", showing the recumbent Richard FitzAlan, 10th Earl of Arundel (1313–1376), holding hands with his second wife, Eleanor of Lancaster (1318–1372). The tomb was celebrated in the poem \"An Arundel Tomb\" by Philip Larkin. Also resting there is Joan de Vere, grandmother of Richard FitzAlan, who died in 1293. She, as was her grandson, was first buried at Lewes Priory, but their tombs were relocated to Chichester at the time of the dissolution."]}, {"page": "Robert Conquest", "response": ["Conquest was a major figure in a prominent British literary circle known as \"The Movement\" which also included Philip Larkin and Kingsley Amis. Movement poets, many of whom bristled at being so labelled, rejected the experiments of earlier practitioners such as Ezra Pound.", "Philip Larkin's published letters revealed that Conquest and Larkin shared an enthusiasm for pornography in the 1950s. When Larkin was in Hull, Conquest sent him judicious selections of the latest pornography, and, when he came down to London, Conquest took him on shopping trips to the Soho porn shops. On one occasion in 1957, Conquest wrote a letter to Larkin purporting to come from the Vice Squad which had found the poet's name on a pornographic publisher's list. Larkin panicked and went to see his solicitor, convinced that he was going to lose his job as librarian at Hull University, before Conquest owned up. The true story of the joke became in 2008, Mr Larkin's Awkward Day, a comedy radio play by Chris Harrald."]}, {"page": "Whitsun", "response": ["* 1964: The Whitsun Weddings is a poem and the title of a collection by Philip Larkin."]}, {"page": "Quartet in Autumn", "response": ["At the time, Pym was still working full-time at the International African Institute in London, and recovering from a mastectomy after developing cancer in her left breast. As she transitioned to retirement in late 1973 and 1974, Pym commenced work on the novel. Whereas most of her novels had been written in short time spans, Pym took three years to write Quartet in Autumn. She had not had a novel published since 1961, and had no realistic expectations that this would be either.Pym 1984, p.285 She completed the novel in 1976, under the original title of Four Point Turn. The poet Philip Larkin, who had a long-running correspondence with Pym, read the final draft and found it very strong. He was surprised by the sombre tone, so unlike Pym's earlier comic style, and suggested the title did not suit. Pym submitted the novel to Hamish Hamilton Limited in 1976 but it was rejected.Holt 1990, p.249"]}, {"page": "Some Tame Gazelle", "response": ["It has been considered a remarkable first novel, because of the way in which the youthful Pym — who began the book while still a student — imagined herself into the situation of a middle-aged spinster, living with her sister in the country.Barbara Pym Society The poet Philip Larkin regarded Some Tame Gazelle as Pym's Pride and Prejudice Holt 1990, p.219"]}, {"page": "St John's College, Oxford", "response": ["Fellows and alumni of St John's have included 17th century Archbishops of Canterbury William Laud and William Juxon, the early Fabian intellectual Sidney Ball, Chief Commissioner of Burma Sir Charles Crosthwaite, former Prime Minister of Canada Lester B. Pearson, former Sudanese prime minister Sadiq al-Mahdi, the poets A. E. Housman, Philip Larkin and Robert Graves and the latter's brother, journalist Charles Graves, the novelist Kingsley Amis, the historian Peter Burke, the biochemist Sir John Kendrew, and former Prime Minister of the United Kingdom Tony Blair."]}, {"page": "Arundel", "response": ["*An Arundel Tomb, a poem by Philip Larkin"]}, {"page": "Highway 61 Revisited", "response": ["In the British music press, initial reviews of Highway 61 expressed both bafflement and admiration for the record. New Musical Express critic Allen Evans wrote: \"Another set of message songs and story songs sung in that monotonous and tuneless way by Dylan which becomes quite arresting as you listen.\" The Melody Maker LP review section, by an anonymous critic, commented: \"Bob Dylan's sixth LP, like all others, is fairly incomprehensible but nevertheless an absolute knock-out.\" The English poet Philip Larkin, reviewing the album for The Daily Telegraph, wrote that he found himself \"well rewarded\" by the record: \"Dylan's cawing, derisive voice is probably well suited to his material ... and his guitar adapts itself to rock ('Highway 61') and ballad ('Queen Jane'). There is a marathon 'Desolation Row' which has an enchanting tune and mysterious, possibly half-baked words.\""]}, {"page": "Desolation Row", "response": ["When he reviewed the Highway 61 Revisited album for The Daily Telegraph in 1965, the English poet Philip Larkin described the song as a \"marathon\", with an \"enchanting tune and mysterious, possibly half-baked words\". For Andy Gill the song is \"an 11-minute epic of entropy, which takes the form of a Fellini-esque parade of grotesques and oddities featuring a huge cast of iconic characters, some historical (Albert Einstein, Nero), some biblical (Noah, Cain and Abel), some fictional (Ophelia, Romeo, Cinderella), some literary (T. S. Eliot and Ezra Pound), and some who fit into none of the above categories, notably Dr. Filth and his dubious nurse.\""]}, {"page": "Christina Rossetti", "response": ["Rossetti's popularity in her lifetime did not approach that of her contemporary Elizabeth Barrett Browning, but her standing remained strong after her death. Her popularity faded in the early 20th century in the wake of Modernism, but scholars began to explore Freudian themes in her work, such as religious and sexual repression, reaching for personal, biographical interpretations of her poetry. Academics studying her work in the 1970s saw beyond the lyrical sweetness to her mastery of prosody and versification. Feminists held her as symbol of constrained female genius and a leader among 19th-century poets. Her writings strongly influenced writers such as Ford Madox Ford, Virginia Woolf, Gerard Manley Hopkins, Elizabeth Jennings, and Philip Larkin. The critic Basil de Sélincourt called her \"all but our greatest woman poet... incomparably our greatest craftswoman... probably in the first twelve of the masters of English verse.\"TLS, 4 December 1930."]}, {"page": "Lost literary work", "response": ["* Diaries of Philip Larkin – burnt at his request after his death on 2 December 1985. Other private papers were kept, contrary to his instructions."]}, {"page": "John Betjeman", "response": ["In a 1962 radio interview he told teenage questioners that he could not write about 'abstract things', preferring places, and faces. Philip Larkin wrote of his work, \"how much more interesting & worth writing about Betjeman's subjects are than most other modern poets, I mean, whether so-and-so achieves some metaphysical inner unity is not really so interesting to us as the overbuilding of rural Middlesex\"."]}]}}