{"wiki_id": "http://www.wikidata.org/entity/Q3133595", "itemLabel": "Michael Topping", "itemDescription": "British astronomer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Topping", "wikipedia_page": {"main": "Michael Topping (1747–1796) was the Chief Marine Surveyor of Fort St. George in Chennai (then Madras) responsible for founding the oldest modern technical school outside Europe. The Survey School was completed on 17 May 1794, with an initial intake of eight students. In 1858 it became the Civil Engineering School and the College of Engineering in 1861.\nTopping was also the first full-time modern professional surveyor of India having surveyed the seas off the Coromandel Coast, India's south-east coast. Topping came to Madras in 1785 as a marine surveyor aboard the East India Ship Walpole. On the suggestion of Alexander Dalrymple, he conducted a triangulation survey of the Coromandel Coast from Madras to Masulipatnam in 1788, making us of a sextant. Topping suggested that this triangulation could be done across India, however this approach was only taken up much later by William Lambton. Topping was appointed from 1794 to survey water reservoirs and in order to conduct his \"tank surveys\" he sought to train (in his survey school) youths of mixed, that is, of European-Indian parentage from the Madras orphanage, and deploy them across southern India at a sixth of the allowances needed for military surveyors and without the need for interpreters. Topping persuaded astronomer William Petrie to transfer his private observatory to the government and set up the first modern astronomical observatory, the Madras Observatory, in Nungambakkam. Topping succeeded Petrie as the director of the observatory from 1789 to 1796 when he died. Topping was succeeded by John Goldingham.", "link_mentions": [{"page": "College of Engineering, Guindy", "response": ["Due to the growing need for surveyors by the East India Company, the 'School of Survey' was established in a building near Fort St. George on the suggestion of Michael Topping in 1794. This school was one of the first of its kind in the country and it started out with 8 boys. It became the Civil Engineering School in 1858 and was renamed College of Engineering in 1859, with the inclusion of a mechanical engineering course. The college was shifted for a short period to Kalasa Mahal, Chepauk, before settling at its present location in 1920 as College of Engineering, Guindy.Sridhar, Asha (20 August 2013) College of Engineering, Guindy, a 219-year journey. The Hindu."]}, {"page": "Indian Institute of Astrophysics", "response": ["In 1790, this private observatory was taken over by the East India Company, with Michael Topping (1747–96) as an astronomer. In 1792, the observatory was expanded and shifted to a complex in Nungambakkam area of Chennai. This was the first modern observatory outside Europe."]}, {"page": "John Goldingham", "response": ["John Goldingham FRS (1767 - July 1849) was the first official astronomer of the Madras Observatory, appointed in 1802. Goldingham was also an architect and surveyor who headed the Madras Survey School which later grew into the Guindy Engineering College and then Anna University. Born in London in 1767, Goldingham was first in the service of William Petrie at his private observatory and then hired by astronomer-sailor Michael Topping as his assistant in 1788.", "John Goldingham succeeded Michael Topping as the Astronomer posted in Madras. Goldingham was put in charge of building an observatory in 1792, and later appointed as the Presidency Civil Engineer in 1800. Although a mathematician, he managed to learn both astronomy and engineering.  He worked at around the same time as Colonel Lambton began the Trigonometrical Survey."]}, {"page": "Madras Observatory", "response": ["The observatory was established due to the efforts of William Petrie, an amateur astronomer who had a small private observatory at Egmore in Madras. Petrie's original observatory was established in 1786 and was made of iron and timber. In 1789, Petrie gifted his instruments to the Madras Government before retiring to England. Sir Charles Oakley accepted Petrie's plea to establish an official observatory for the purpose of \"promoting  the knowledge of astronomy, geography and navigation  in  India\". The building was designed by Michael Topping on the bank of the river Cooum at Nungambakkam. The building consisted of a single room 40 feet long and 20 feet wide with a 15-foot ceiling. At the centre a granite pillar of 10 tons supported a 12-inch azimuth transit circle instrument made by Troughton. These were used to make observations on the meridian that began on 9 January 1793. Topping died in 1796 and was succeeded by John Goldingham who was formerly Petrie's assistant, Government Architect and Editor of the Government Gazette apart from serving as first superintendent of the Engineering School. Goldingham determined the longitude as 80° 18' 30\" based on eclipses of Jupiter's moons. This was the value used as a benchmark by William Lambton for the Great Trigonometrical Survey. When Goldingham went on leave between 1805 and 1810, the observatory was maintained by Lt. John Warren (born Jean-Baptiste Francois Joseph de Warren, 21 September 1769 – 9 February 1830, Pondicherry) who recalculated the longitude as 80°17'21\"E. He recorded observations on the comet of September 1807 and computed the declinations of several stars. Goldingham returned in 1812 and served until 1830 when he was replaced by Thomas Glanville Taylor who measured the positions of 11,000 stars which were published in five volumes which came to be known as the \"Madras Catalogue\". Taylor's estimate of the longitude for Madras was 80°14'20\"E. Taylor also made observations on the comet of 1831. "]}, {"page": "William Petrie", "response": ["In 1786, Petrie set up a private observatory as a geographical and navigational aid in his residence in Egmore, Chennai, India,Cited by Raghunathan, M. S. and Rajasakaran, G. in \"Subaltern Science in the South, 1792-1947\", chapter 22 in , pp.669-719. recording the first modern astronomical observations outside Europe on 5 December 1786. His observatory and instruments later contributed to the first modern observatory outside Europe, the Madras Observatory, being established in nearby Nungambakkam; an original instrument (a gridiron astronomical clock made by John Shelton) donated by Petrie to the observatory can be seen at the Kodaikanal Solar Observatory. Petrie's efforts led to Michael Topping (1747–96) being appointed as the astronomer of this observatory by the Company (the observatory later evolved into Indian Institute of Astrophysics). "]}, {"page": "Topping (surname)", "response": ["* Michael Topping (1747–1796), Chief Marine Surveyor of Fort St. George in Chennai, India"]}, {"page": "Regional Meteorological Centre, Chennai", "response": ["For over a century, it was the only astronomical observatory in India that exclusively worked on the stars. Among the astronomers at the observatory were Norman Robert Pogson, Michael Topping and John Goldingham. By 1899, it had been relegated to gathering weather-related data.", "The 15-feet tall granite pillar monument weighing 10 tons, which carried the original transit equipment, is still preserved and carries the name of the architect, Michael Topping Arch, and the year AD MDCCXCII. Inscriptions in Tamil and Telugu were carved on the pillar in order that \"posterity may be informed a thousand years hence of the period when the mathematical sciences were first planted by British liberality in Asia\". J. Goldingham, FRS, became the first astronomer of the observatory, who started recording the meteorological observations in 1796."]}, {"page": "Topping, Michael", "response": ["#redirectMichael Topping"]}]}}