{"wiki_id": "http://www.wikidata.org/entity/Q313885", "itemLabel": "Tom Daley", "itemDescription": "British diver", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Daley", "wikipedia_page": {"main": "Thomas Robert Daley  (born 21 May 1994) is a British diver and television personality. Specialising in multiple events, he is an Olympic gold medallist in the men's synchronized 10-metre platform event at the 2020 Olympics and double world champion in the FINA 10-metre platform event, winning in 2009 at the age of fifteen, and again in 2017. He is an Olympic bronze medallist in the 2012 platform event, the 2016 synchronized event, and the 2020 platform event, making him the first British diver to win four Olympic medals. Daley also competes in team events, winning the inaugural mixed team World title in 2015. He is a 5-time European champion and 4-time Commonwealth champion.\nDaley started diving at the age of seven and is a member of Plymouth Diving Club, where his talent was identified early, and made an impact in national and international competitions from age nine. He represented Great Britain at the 2008 Summer Olympics where he was Britain's youngest competitor, age fourteen, and the youngest from any nation to participate in a final. In 2009, Daley reached a career-best ranking of number one in the FINA World Aquatics Championships Diving Rankings for the 10m platform. He won two gold medals for England at the 2010 Commonwealth Games, in the 10m synchro diving (with Max Brick) and the 10m Individual Platform competition.After the 2012 Summer Olympics and a summer of increased sporting interest amongst the UK public, television network ITV approached Daley to have a role in their new celebrity diving reality TV show Splash! Daley made his debut in the show's premiere on 5 January 2013 as a mentor to the celebrity competitors taking part.", "link_mentions": [{"page": "Devon", "response": ["Swimmer Sharron Davies and diver Tom Daley were born in Plymouth. The Olympic runner Jo Pavey was born in Honiton.  Peter Cook the satirist, writer and comedian was born in Torquay, Devon. Leicester Tigers and British and Irish Lions Rugby player Julian White was born and raised in Devon and now farms a herd of pedigree South Devon beef cattle. The dog breeder John \"Jack\" Russell was also from Devon. Jane McGrath, who married Australian cricketer Glenn McGrath was born in Paignton, her long battle with and subsequent death from breast cancer inspired the formation of the McGrath Foundation, which is one of Australia's leading charities."]}, {"page": "May 21", "response": ["*1994 – Tom Daley, English diver"]}, {"page": "Plymouth", "response": ["Notable athletes include swimmer Sharron Davies, diver Tom Daley, dancer Wayne Sleep, and footballer Trevor Francis. Other past residents include composer journalist and newspaper editor William Henry Wills, Ron Goodwin, and journalist Angela Rippon and comedian Dawn French. Canadian politician and legal scholar Chris Axworthy hails from Plymouth. America based actor Donald Moffat, whose roles include American Vice President Lyndon B. Johnson in the film The Right Stuff, and fictional President Bennett in Clear and Present Danger, was born in Plymouth. Canadian actor Mark Holden was also born in Plymouth. "]}, {"page": "Madame Tussauds", "response": ["|Tom Daley"]}, {"page": "Desert Island Discs", "response": ["After Plomley's death in 1985, the programme was presented first by Michael Parkinson, then from 1988 to 2006 by Sue Lawley and from 2006 to 2018 by Kirsty Young. Young was replaced by 6 Music presenter Lauren Laverne, who interviewed Olympic diver Tom Daley for her first show, broadcast on 30 September 2018. Laverne was initially only drafted in as an interim presenter, while Young took time off due to complications of fibromyalgia, but following her decision not to return in July 2019, it was announced that Laverne would continue for \"the foreseeable future\"."]}, {"page": "Eddie the Eagle", "response": ["In 2013, he won the first series of the British celebrity diving programme Splash!, mentored by Tom Daley."]}, {"page": "Censorship in the United Kingdom", "response": ["* During the 2012 Olympics, diver Tom Daley retweeted a message that said \"You let your dad down i hope you know that\", insulting him for finishing fourth. Its 17-year old author was arrested on suspicion of \"malicious communication\" and given a harassment warning."]}, {"page": "Gabby Logan", "response": ["Gabby co-hosted the celebrity diving show Splash! on ITV, alongside Vernon Kay and Olympic diver Tom Daley from 2013 until 2014."]}, {"page": "Leon Taylor", "response": ["In 2010 Taylor published a book on the subject of mentoring: MENTOR - The most important role you were never trained for. This work built on his experience of mentoring many athletes, most notably Olympic medalist Tom Daley."]}, {"page": "Peter Waterfield", "response": ["For the 2011 season, Waterfield was paired in the synchronised competitions with teenager Tom Daley; Daley had finished 7th in the individual competition at the 2008 Beijing Olympics and was also a British and European champion. During the 2012 London Olympics, Waterfield and Daley achieved an agonising 4th-placed finish in the 10 m synchro diving competition after dropping their 4th dive."]}, {"page": "Linda Barker", "response": ["In 2013, Barker went on to take part in Splash!, ITV's celebrity diving show with Olympic diver Tom Daley as her mentor. She finished in third place."]}, {"page": "The Big Fat Quiz of the Year", "response": ["The in-studio final bonus questions were provided by Team GB and Paralympics GB athletes Nicola Adams, Natasha Baker, Sophie Christiansen, Hannah Cockroft, Helen Glover, Ed McKeever, Etienne Stott, and Peter Wilson. The Great British Bake Off finalists Brendan Lynch, James Morton, and John Whaite provided a live guest question. Recorded guest questions were provided by PSY, Gerard Butler, Usain Bolt, Jessica Ennis, Felix Baumgartner, Kylie Minogue, Cheryl Cole, Simon Callow, Jenson Button, Tom Daley, Warwick Davis, and Charles Dance (doing a dramatic reading from Fifty Shades of Grey). The children of Mitchell Brook Primary School once again made an appearance acting out the Diamond Jubilee Concert. Providing the song lyric as news story segment was Jon Snow, reporting on \"Call Me Maybe\". The mystery guest was Gary Connery, the stunt-double for the Queen, who skydived out of a helicopter during the 2012 Olympics opening ceremony.", "Pre-recorded guest questions came from Michael Palin, Tom Daley, the cast of The Inbetweeners, Game of Thrones actress Natalie Dormer, Lily Allen, Rio Ferdinand, Pixie Lott and Status Quo members Francis Rossi and Rick Parfitt. Paralympic gold medallists Kelly Gallagher and Charlotte Evans provided the in-studio guest question. Charles Dance read from the autobiography of Joey Essex. The children of Mitchell Brook Primary School acted out the Bernie Ecclestone trial. Jon Snow gave his news report about \"All About That Bass\". The mystery guest was Dean Farley, the jogger who ran into David Cameron."]}, {"page": "Richard Littlejohn", "response": ["===Tom Daley===", "On 15 February 2018, Littlejohn, writing for his Daily Mail column, focused on the news that Tom Daley and his husband Dustin Lance Black were expecting their first child. Littlejohn stated that while he supported fostered children being brought up by loving, gay partners, as opposed to living in state institutions, he nonetheless adhered to his belief that children \"benefit most from being raised by a man and a woman\". He also criticised that in many cases of male gay relationships, Daley and Black included, women were being seen as \"mere breeding machines\" (their baby's surrogate mother not having been identified) and that offspring were shown off like \"commodities\"."]}, {"page": "Malicious Communications Act 1988", "response": ["The MCA has been criticised for its misuse as a means to censor free speech. In 2012 an individual was arrested under the Act for saying that Olympic diver Tom Daley let his late father down by not winning a medal at the London Olympics.Gillespie, A. A. (2012). Twitter, Jokes and the Law. The Journal of Criminal Law, 76(5), 364-369."]}, {"page": "Attitude (magazine)", "response": ["Celebrities who have appeared on the cover include Prince William,  Boy George,  Madonna,  David Beckham,  Michael Sam, Lady Gaga,   Tom Daley and Matty Lee , Rupaul, Tom Hardy,  Gareth Thomas, Ian Somerhalder, John Grant,  Mark Wahlberg, Jonathan Groff, Andrew Scott, Tony Blair, Daniel Radcliffe, Heath Ledger, Sacha Baron Cohen as Brüno, David Cameron, Ed Miliband, Robbie Rogers, The Spice Girls, Take That, James Franco, Dominic Cooper, Jimmy Anderson, Nick Jonas,  Jussie Smollett with  Naomi Campbell, Mark Feehily, Kevin McDaid, Kylie Minogue,  Marilyn Manson, Elton John, McFly, Nicola Adams,  Robbie Williams, Rupert Everett, Justin Timberlake, Philip Olivier, Freddie Ljungberg, Marina and the Diamonds, George Michael, Rufus Wainwright, Will Young, Harry Judd of McFly, Christina Aguilera, Dermot O'Leary, John Barrowman, Gary Lucy, Beth Ditto, Cheyenne Jackson, Scissor Sisters, Adam Lambert and Liam Payne. Many of these covers have been world exclusives. Attitude published a cover featuring Alan Turing in October 13 as part of its 'Attitude Awards' edition."]}, {"page": "List of LGBT sportspeople", "response": ["| Tom Daley"]}, {"page": "Lesley Sharp", "response": ["| Tom Daley: Diving for Gold || Narrator || style=\"text-align:center\" | ITV || Documentary"]}, {"page": "Clare Balding", "response": ["Balding currently hosts her own sports chat show called The Clare Balding Show, which airs on BT Sport and BBC Two. Guests so far have included Lewis Hamilton, Tom Daley, Mike Tyson, Martina Navratilova, Frankie Dettori, Judy Murray and Ronnie O'Sullivan."]}, {"page": "London Gay Men's Chorus", "response": ["On 6 May, members of the LGMC performed at the wedding of Tom Daley and Dustin Lance Black."]}, {"page": "Great Britain at the Olympics", "response": ["Great Britain made its Olympic diving debut in 1908. Jack Laugher with one gold, one silver and one bronze medal is the most successful British Olympic diver in history. Tom Daley, with one gold and three bronze medals, is the most decorated."]}, {"page": "Saturday Kitchen", "response": ["* Tom Daley"]}, {"page": "1994 in the United Kingdom", "response": ["* 21 May – Tom Daley, diver"]}, {"page": "Laureus World Sports Award for Breakthrough of the Year", "response": ["| align=left | Mark Cavendish () – cycling  Tom Daley () – diving  Juan Martín del Potro () – tennis  Jiyai Shin () – golf  VfL Wolfsburg () – football"]}, {"page": "Bisexual erasure", "response": ["In 2013, British Olympian diver Tom Daley came out as bisexual. Several media sources supported his decision to tell the world about his sexuality, but they labeled him as \"gay\" instead of bisexual."]}, {"page": "The One Show", "response": ["| colspan=\"1\" style=\"text-align:center;\"| Tom DaleyAlex Jones", "| colspan=\"1\" style=\"text-align:center;\"| Ronan Keating  Tom Daley", "* Tom Daley (2021; 2 episodes)"]}, {"page": "2008 European Aquatics Championships", "response": ["|Tom Daley||491.95 "]}, {"page": "FINA Diving World Cup", "response": ["The FINA Diving World Cup is an international biennial diving competition that was first contested in The Woodlands, Texas in 1979. The 2012 edition served as Diving's test event for the 2012 Olympics, as well as the final qualifying event for Diving at those Games. Tom Daley (UK, b. 21 May 1994) is the youngest medallist at a FINA Diving World Cup. He was aged 13 years 277 days when he won bronze in the 10 m synchro competition in Beijing, China, on 22 February 2008."]}, {"page": "Gemma Merna", "response": ["In January 2014, she was a contestant on the ITV diving show Splash!, fronted by Tom Daley, she was the first contestant to be eliminated from the show in Heat One."]}]}}