{"wiki_id": "http://www.wikidata.org/entity/Q3132212", "itemLabel": "Oliver Jackson-Cohen", "itemDescription": "English actor and model", "wikipedia_url": "https://en.wikipedia.org/wiki/Oliver_Jackson-Cohen", "wikipedia_page": {"main": "Oliver Mansour Jackson-Cohen (born 24 October 1986) is an English actor and model. He is best known for his role as Adrian Griffin in the 2020 adaptation of The Invisible Man and for his roles as Luke Crain and Peter Quint in the Netflix television programmes The Haunting of Hill House (2018) and The Haunting of Bly Manor (2020) respectively. He also had a recurring role in the 2013 television series Dracula.", "link_mentions": [{"page": "Jonathan Pryce", "response": ["In 2015, he joined the cast of the HBO series Game of Thrones in Season 5 as the High Sparrow. Pryce admitted that one of the main reasons he took on the role was because of how influential the character is plot-wise. While initially being quite sceptical about \"sword and sorcery\" shows, Pryce later had a change of heart after his positive experiences on the Thrones sets. In 2015, he also appeared at The Globe Theatre as Shylock in The Merchant of Venice. His real life daughter Phoebe played Shylock's daughter Jessica. In 2015, he joined the cast of The Healer starring with Oliver Jackson-Cohen, Camilla Luddington, and Jorge Garcia."]}, {"page": "Scarecrow (Oz)", "response": ["* In Emerald City, a more modern retelling of the series, the Scarecrow equivalent in the series is \"Lucas\" (portrayed by Oliver Jackson-Cohen) and is an amnesic man who is rescued by Dorothy when she finds him being crucified at the start of her journey. In the course of the film, it is revealed that he is actually Rowan, the husband of Glinda, with his amnesia the result of a spell Glinda casts so that he couldn't betray her secrets if he was captured, but the restoration of his memory puts him and Dorothy at odds, as his devotion to Glinda leaves him incapable of recognizing Dorothy's real objections to Glinda's extreme methods to train younger witches. Psychologically torn between his memories as Rowan and his new relationships as Lucas, he eventually forces Dorothy to stab him to stop himself strangling her, culminating in Dorothy leaving him strung up like a scarecrow to symbolically reflect his desire to have never met her. Despite this, he appears in Kansas in the season finale, accompanied by Toto, to ask Dorothy to return with him to Oz."]}, {"page": "Jonathan Rhys Meyers", "response": ["In 2013, Meyers was cast as Dracula in NBC's television series Dracula alongside Oliver Jackson-Cohen and Jessica De Gouw. It was also announced in May 2013 that Meyers was to participate in the recording of his brothers' album entitled Blossom, which was released on 21 April 2014."]}, {"page": "Jorge Garcia", "response": ["In 2015, he joined the cast of The Healer starring with British actor Oliver Jackson-Cohen, Camilla Luddington and Jonathan Pryce."]}, {"page": "List of Sephardic Jews", "response": ["* Oliver Jackson-Cohen (1986-) English actor, notably played Luke Crain in The Haunting of Hill House."]}, {"page": "The Invisible Man (1933 film)", "response": ["In February 2016, it was announced that Johnny Depp would star in the remake with Ed Solomon writing the film's script, while Alex Kurtzman and Chris Morgan would be the producers. On November 8, 2017, Kurtzman and Morgan moved on to other projects. In 2019, Universal announced and began production on the new The Invisible Man that was written and directed by Leigh Whannell and produced by Jason Blum, starring Elisabeth Moss and Oliver Jackson-Cohen as the titular character."]}, {"page": "Leigh Whannell", "response": ["Whannell was writer-director of the science fiction body horror film Upgrade, which was released by Blumhouse Tilt and OTL Releasing in 2018 to positive reception. Whannell next wrote, directed, and co-executive produced a retooling of H.G. Wells' book The Invisible Man. The film starred Elisabeth Moss and Oliver Jackson-Cohen, and was released in 2020 to universal critical acclaim. In July 2020, it was announced that he's working on a sequel to The Invisible Man. Whannell is currently working on a reboot of Escape from New York. He's also producing and directing a sequel series to Upgrade. He is in talks to direct a remake of The Wolf Man with Blumhouse Productions producing and starring Ryan Gosling."]}, {"page": "Griffin (The Invisible Man)", "response": ["In January 2019, Universal announced that the plan moving forward was to focus on filmmaker-driven films, and less of an interconnection in the Dark Universe. Ultimately, Elisabeth Moss was given a starring role in the film as Cecilia Kass, while Oliver Jackson-Cohen and Michael Dorman were respectively cast as Adrian and Tom Griffin. The Invisible Man re-entered development, written and directed by Leigh Whannell and produced by Jason Blum. Johnny Depp still had option to star in the lead role, though all parties ultimately passed. The Invisible Man was released on February 28, 2020, receiving positive reviews. In this version, Adrian Griffin is a wealthy scientist and pioneer in the field of optics who fakes his death and becomes invisible to torment his ex-girlfriend Cecilia, whom he constantly abused. Unlike the novel and 1933 film, the invisibility is achieved through a suit fixed with hundreds of micro-cameras instead of an invisibility formula. When Adrian's brother Tom was found in the invisibility suit, Adrian used him as a scapegoat, claiming to Cecilia that Tom was holding him prisoner. In an attempt to get Adrian to confess, she meets him at his house to discuss her pregnancy while James listens in on a wire. Adrian insists that he had actually been kidnapped, claiming that his experience has changed his outlook on life and their relationship. Cecilia departs to use the restroom. Moments later, the room's security camera captures Adrian seemingly committing suicide by slicing his throat. Cecilia emerges from the bathroom and \"frantically\" calls the police. Off-camera, she taunts him to reveal that she had retrieved the earlier-hidden second invisibility suit to kill Adrian, regardless of whether he was the invisible figure, just to finally be free of Adrian's abuse forever, and a horrified Adrian then dies, realizing that Cecilia has won and he has ultimately lost. When Detective James Lanier arrives and asks what happened, she confirms what the camera saw. He spots the invisibility suit in her bag, but accepts her story and allows her to leave."]}, {"page": "Lycée Français Charles de Gaulle", "response": ["* Oliver Jackson-Cohen, actor"]}, {"page": "Elisabeth Moss", "response": ["In 2020, Moss starred in Shirley, opposite Michael Stuhlbarg and directed by Josephine Decker, portraying the role of author Shirley Jackson, which premiered at the Sundance Film Festival. She also had the starring role in the horror-thriller film The Invisible Man, alongside Oliver Jackson-Cohen and Storm Reid, which was released on February 28, 2020, to critical acclaim. Moss will appear in The French Dispatch, directed by Wes Anderson, and Next Goal Wins, directed by Taika Waititi.Elisabeth Moss in Talks for Taika Waititi Movie 'Next Goal Wins' (Exclusive)"]}, {"page": "Jonathan Harker", "response": ["* Oliver Jackson-Cohen in Dracula (television series, 2013) - in this version, he is a gauche journalist who is desperate to climb the ranks of aristocracy."]}, {"page": "Kenjiro Tsuda", "response": ["|Oliver Jackson-Cohen"]}, {"page": "Lee Strasberg Theatre and Film Institute", "response": ["*Oliver Jackson-CohenBrooke, Simon. \"Relative Values: Betty Jackson and her son, Oliver Jackson Cohen\". The Sunday Times. October 26, 2008. Retrieved April 24, 2015."]}, {"page": "Lark Rise to Candleford (TV series)", "response": ["| Phillip White || Oliver Jackson-Cohen || colspan=\"1\"  || colspan=\"3\" "]}, {"page": "List of mental disorders in film", "response": ["*The Invisible Man – 2020 – character of Adrian Griffin played by Oliver Jackson-Cohen"]}, {"page": "Shamim Sarif", "response": ["At the Cannes Festival 2013 Enlightenment Productions announced their new film Despite The Falling Snow.Despite the Falling Snow. Retrieved from  The film starring Mission Impossible 5 Swedish actress Rebecca Ferguson, Game of Thrones actor Charles Dance, Oliver Jackson-Cohen, Antje Traue, Sam Reid, Anthony Head and Trudie Styler, was released in UK on 15 April 2016."]}, {"page": "Betty Jackson", "response": ["In 1981, she met her husband David Cohen, and they set up their company, Betty Jackson Ltd. They have worked together ever since. David is from an Egyptian Jewish family that moved to France. They have two children including actor and model Oliver Jackson-Cohen."]}, {"page": "Going the Distance (2010 film)", "response": ["* Oliver Jackson-Cohen as Damon"]}, {"page": "List of American films of 2010", "response": ["| Warner Bros. Pictures / New Line Cinema || Nanette Burstein (director); Geoff LaTulippe (screenplay); Drew Barrymore, Justin Long, Charlie Day, Jason Sudeikis, Christina Applegate, Ron Livingston, Kelli Garner, Natalie Morales, June Diane Raphael, Rob Riggle, Leighton Meester, Kristen Schaal, Jim Gaffigan, Sarah Burns, Matt Servitto, Oliver Jackson-Cohen, Mick Hazen, Mike Birbiglia, Meredith Hagner, Ron Bottitta", "| Faster || CBS Films / Castle Rock Entertainment || George Tillman Jr. (director); Tony Gayton, Joe Gayton (screenplay); Dwayne Johnson, Billy Bob Thornton, Maggie Grace, Carla Gugino, Oliver Jackson-Cohen, Moon Bloodgood, Courtney Gains, Lester Speight, Adewale Akinnuoye-Agbaje, Tom Berenger, Mike Epps, Xander Berkeley, Matt Gerald, Annie Corley, Jennifer Carpenter, Michael Irby"]}, {"page": "Oliver Jackson Cohen", "response": ["#REDIRECT Oliver Jackson-Cohen"]}, {"page": "Faster (2010 film)", "response": ["Faster is a 2010 American action thriller film directed by George Tillman Jr. Dwayne Johnson and Billy Bob Thornton star as a criminal seeking vengeance and the corrupt cop who pursues him, respectively. Tom Berenger, Oliver Jackson-Cohen, Adewale Akinnuoye-Agbaje and Carla Gugino also appear. Faster was released on November 24, 2010, and grossed $35 million against production budget of $24 million.", "* Oliver Jackson-Cohen as Killer, a hit-man hired by Slade to kill Driver."]}, {"page": "Oliver (given name)", "response": ["*Oliver Jackson-Cohen (born 1986), English actor and model"]}, {"page": "What's Your Number?", "response": ["* Oliver Jackson-Cohen as Eddie Vogel"]}, {"page": "Hanan Kattan", "response": ["The film starring Mission Impossible 5 Swedish actress Rebecca Ferguson,6 Sales Takes Rebecca Ferguson-Starrer ‘Snow’. Retrieved from https://variety.com/2015/film/global/six-sales-rebecca-ferguson-despite-the-falling-snow-1201479102/Rebecca Ferguson. Retrieved from https://variety.com/t/rebecca-ferguson/Rebecca Ferguson describes her big leap into 'Mission: Impossible'. Retrieved from http://www.mercurynews.com/movies/ci_28578922/rebecca-ferguson-describes-her-big-leap-into-missionMission: Impossible 5 Has Found Its New Female Lead. Retrieved from http://www.cinemablend.com/new/Mission-Impossible-5-Has-Found-Its-Female-Lead-43820.html Game of Thrones actor Charles Dance, Oliver Jackson-Cohen, Antje Traue, Sam Reid, Anthony Head and Trudie Styler, which was released in 2015."]}, {"page": "AACTA Award for Best Lead Actor in a Television Drama", "response": ["|Oliver Jackson-Cohen"]}, {"page": "The Raven (2012 film)", "response": ["* Oliver Jackson-Cohen as PC John Cantrell"]}, {"page": "List of Jewish actors", "response": ["|Oliver Jackson-Cohen"]}, {"page": "Abraham Lincoln: Vampire Hunter", "response": ["In January 2011, with Bekmambetov attached as director, Walker was cast as Abraham Lincoln. He beat Adrien Brody, Josh Lucas, James D'Arcy, and Oliver Jackson-Cohen for the role. Additional actors were cast in the following February. Filming began in March 2011 in Louisiana. The film had a budget of $99.5 million and was produced in 3D."]}, {"page": "Camilla Luddington", "response": ["Luddington had the lead role of Kate in William & Kate: The Movie (2011), then in 2013 she appeared in the film The Pact II, in which she played a crime scene cleaner. In 2015, she joined the cast of The Healer as Cecilia, starring with Oliver Jackson-Cohen, Jonathan Pryce, and Jorge Garcia."]}, {"page": "List of American films of 2012", "response": ["| The Raven || Relativity Media || James McTeigue (director); Ben Livingston, Hannah Shakespeare (screenplay); John Cusack, Alice Eve, Luke Evans, Brendan Gleeson, Oliver Jackson-Cohen ||"]}, {"page": "Allison Williams (actress)", "response": ["In November 2016, Williams appeared in Past Forward, a short film collaboration between David O. Russell and Prada. Williams wrote a series of Funny or Die sketches, in which she starred as newlywed Kate Middleton, with English actor and model Oliver Jackson-Cohen as Prince William, Duke of Cambridge."]}, {"page": "World Without End (miniseries)", "response": ["* Oliver Jackson-Cohen as Ralph Fitzgerald"]}, {"page": "Dracula (2013 TV series)", "response": ["* Oliver Jackson-Cohen as Jonathan Harker, a gauche journalist who is desperate to climb the ranks of aristocracy."]}, {"page": "Mr Selfridge", "response": ["| style=\"text-align:center;\"| Oliver Jackson-Cohen"]}, {"page": "Jessica De Gouw", "response": ["In 2013, De Gouw was cast in the NBC series Dracula as Mina Murray alongside Jonathan Rhys Meyers and Oliver Jackson-Cohen.  The series lasted only 10 episodes, and NBC announced on 9 May 2014 that the show would not be renewed for another season.  ", "Since 2013, Jessica De Gouw has been in a relationship with Oliver Jackson-Cohen after starring in the short lived NBC Dracula series together."]}, {"page": "Despite the Falling Snow", "response": ["A film adaptation of the novel was announced in early 2013 at the Cannes Festival. The film starring Mission: Impossible – Rogue Nation Swedish actress Rebecca Ferguson, Game of Thrones actor Charles Dance, Oliver Jackson-Cohen, Antje Traue, Sam Reid, Anthony Head, and Danish actor Thure Lindhardt was released in UK on April 15, 2016."]}, {"page": "Enlightenment Productions", "response": ["At Cannes Festival 2013 Enlightenment Productions announced their new film Despite The Falling Snow.Despite the Falling Snow. Retrieved from https://www.imdb.com/title/tt2474932/news The film starring Mission Impossible 5 Swedish actress Rebecca Ferguson,6 Sales Takes Rebecca Ferguson-Starrer ‘Snow’. Retrieved from https://variety.com/2015/film/global/six-sales-rebecca-ferguson-despite-the-falling-snow-1201479102/Rebecca Ferguson. Retrieved from https://variety.com/t/rebecca-ferguson/Rebecca Ferguson describes her big leap into 'Mission: Impossible'. Retrieved from http://www.mercurynews.com/movies/ci_28578922/rebecca-ferguson-describes-her-big-leap-into-missionMission: Impossible 5 Has Found Its New Female Lead. Retrieved from http://www.cinemablend.com/new/Mission-Impossible-5-Has-Found-Its-Female-Lead-43820.html Game of Thrones actor Charles Dance, Oliver Jackson-Cohen, Antje Traue, Sam Reid, Anthony Head and Trudie Styler, was released in UK on 15 April 2016."]}, {"page": "Emerald City (TV series)", "response": ["Emerald City is an American fantasy drama television series developed for NBC by Matthew Arnold and Josh Friedman based on the early 20th century Oz book series written by L. Frank Baum, set in the fictional Land of Oz. Directed by Tarsem Singh and starring Adria Arjona, Oliver Jackson-Cohen, Ana Ularu and Vincent D'Onofrio, Emerald City received a 10-episode order by NBC in April 2015, which premiered on January 6, 2017, with a two-episode debut, and concluded on March 3, 2017. On May 5, 2017, NBC canceled the series after one season.", "*Oliver Jackson-Cohen as Roan / Lucas: an amnesiac who accompanies Dorothy in an attempt to regain his lost memory and quickly finds himself falling in love with her."]}, {"page": "Fuminori Komatsu", "response": ["*Faster (Killer (Oliver Jackson-Cohen))"]}]}}