{"wiki_id": "http://www.wikidata.org/entity/Q3133011", "itemLabel": "Henry Piddington", "itemDescription": "English scientist and merchant captain (1797-1858)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Piddington", "wikipedia_page": {"main": "Henry Piddington (7 January 1797 – 7 April 1858) was an English sea captain who sailed in East India and China and later settled in Bengal where he worked as a curator of a geological museum and worked on scientific problems, and is particularly well known for his pioneering studies in meteorology of tropical storms and hurricanes. He noted the circular winds around a calm centre recorded by ships caught in storms and coined the name cyclone in 1848.", "link_mentions": [{"page": "1797", "response": ["* January 7 – Henry Piddington, English merchant captain sailing in East India and China and later settling in Bengal (d. 1858)"]}, {"page": "Cyclone", "response": ["Henry Piddington published  40 papers dealing with tropical storms from Calcutta between 1836 and 1855 in The Journal of the Asiatic Society. He also coined the term cyclone, meaning the coil of a snake. In 1842, he published his landmark thesis, Laws of the Storms."]}, {"page": "High-pressure area", "response": ["The term cyclone was coined by Henry Piddington of the British East India Company to describe the devastating storm of December 1789 in Coringa, India. A cyclone forms around a low-pressure area. Anticyclone, the term for the kind of weather around a high-pressure area, was coined in 1877 by Francis Galton to indicate an area whose winds revolved in the opposite direction of a cyclone. In British English, the opposite direction of clockwise is referred to as anticlockwise, making the label anticyclones a logical extension."]}, {"page": "Kakinada", "response": ["The British established the site in 1759 as a shipbuilding and ship repair facility. The British knew the area as the Coromandel coast, and Coringa Town (now called Kakinada) on the Coringa River, a branch of the Godavari river. As the principal seaport on this coast, it soon became a large shipbuilding yard of some importance. In 1802 a dock was built for repair of Royal Navy and other vessels, it boasted the only wet dock between Bombay and Calcutta. ‘'Cape Cori, or Hope Island as it was called was known internationally for shipbuilding and repairs. The facilities were destroyed by massive cyclonic storms and tidal waves in 1787 (causing 20,000 fatalities) and again on 9 and 10 May 1832. On 25 November 1839 yet another even greater cyclone finished off the port and it was not to recover. It has been estimated that the storm surge was as much as 40 feet. The harbour city was destroyed as were some 20,000 vessels of various sizes. This was one of the storms cited by Henry Piddington in a speech to the ‘'Asiatic Society of Bengal'’ where he first used the term ‘'cyclone'’ to describe the phenomena. After the 1839 cyclone, homes were relocated further inland."]}, {"page": "India Meteorological Department", "response": ["The Asiatic Society, founded in Calcutta in 1784 and in Bombay in 1804, promoted the study of meteorology in India. Henry Piddington published almost 40 papers dealing with tropical storms from Calcutta between 1835 and 1855 in The Journal of the Asiatic Society. He also coined the term cyclone, meaning the coil of a snake. In 1842, he published his landmark thesis, Laws of the Storms."]}, {"page": "North Indian Ocean tropical cyclone", "response": ["The systematic scientific studies of tropical systems in the Bay of Bengal and Arabian Sea was started during the 19th century by Henry Piddington. Piddington utilised meteorological logs of vessels that navigated the seas and published a series of memoirs, in the Journal of the Asiatic Society of Bengal between 1839 and 1858. These memoirs gave accounts and tracks of individual storms in the Bay of Bengal and the Arabian Sea."]}, {"page": "List of Bangladesh tropical cyclones", "response": ["* Sailors Horn Book for the law of storms. Appendix A. – by Henry Piddington."]}, {"page": "1858 in the United Kingdom", "response": ["* 7 April – Henry Piddington, merchant captain in the East (born 1797)"]}, {"page": "1797 in Great Britain", "response": ["* 7 January – Henry Piddington, merchant captain in the East (died 1858)"]}, {"page": "Canning, South 24 Parganas", "response": ["Lord Canning had wanted to build a port that would be an alternative to Kolkata and a rival to Singapore. What no one heeded were the warnings of a lowly shipping inspector Henry Piddington, who had lived in the Caribbean and knew all about hurricanes and storms. He wanted the mangroves to be left alone, as they were Bengal’s defensive barrier against nature’s fury and absorbed the initial onslaught of cyclonic winds, waves and tidal surges. The settlement was built with a strand, hotels and homes, but in 1867 the Matla River surged and reduced the town to a \"bleached skeleton\"."]}, {"page": "List of British scientists", "response": ["* Henry Piddington (1797–1858), meteorologist"]}, {"page": "Piddington (surname)", "response": ["* Henry Piddington (1797–1858), British-Indian scientist", "* William Henry Piddington (1856–1900). Australian politician "]}, {"page": "1839 Coringa cyclone", "response": ["An official of the British East India Company, Henry Piddington, coined the term cyclone in his reports for the first time while observing the swath of destruction made by the 1789 and 1839 storms. The word itself means the coil of a snake."]}]}}