{"wiki_id": "http://www.wikidata.org/entity/Q3142323", "itemLabel": "Hugh Vyvyan", "itemDescription": "English rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Vyvyan", "wikipedia_page": {"main": "Hugh Donnithorne Vyvyan (born 8 September 1976 in Guildford) is a former rugby union player who played at lock for Newcastle Falcons, Saracens and England. He stands at 6'6\" and weighs around 18 stone.\nThe former England fullback Jon Callard heavily influenced Vyvyan's early career while at Downside School, moving him from fly-half to number 8. Brother Charlie, was a number 8 for Sale Sharks, and was another big influence on his career. He also plays lock.\nVyvyan is youngest of seven brothers. In 1993 the brothers created rugby history by making up an entire team in the Penryn Invitation Sevens tournament, (played on Easter day each year in Penryn, Cornwall). The Seven Vyvyan brothers (Richard, Jonathan, Charles, Simon, Paul, James and Hugh) went on to win the tournament, defeating the host club 19 – 17 in the final. They returned the following year and defended the title, with Hugh flying back from South Africa to make up the numbers. In all the brothers reached the final five times, winning three times and twice being runners up.\nHe opted to take a year out after Downside School and played in South Africa for the Villagers club in Cape Town. Back in England he played briefly for Penryn before starting a successful theology degree at University of Newcastle, where he caught the eye of the Newcastle Falcons and eventually made his debut against Moseley, when the club were in National Division Two.\nIn 2001 he was an important member of Falcons’ Powergen Cup winning side at Twickenham (though he was a replacement for the final), a feat he repeated in 2004 but this time starting as captain and scoring a try in the final.In 2002 he toured with the full England side and was an unused bench replacement against Argentina. Being deemed not good enough for England, in that same 2002–2003 season he played for England A against Scotland A and Ireland A and, in December 2003, also helped an England XV beat the New Zealand Barbarians.As well as leading both Newcastle Falcons and now Saracens, he has captained the England A squad on two Churchill Cup tours. The first in 2003 saw England A take the cup and the second, in 2004, saw England A losing to the New Zealand Māori in extra time.\nHe won a deserved first England cap against Canada in the Investec Challenge match in 2004 and scored a try.In 2004, he joined Saracens where he was made captain before even having played a game.In May 2009, Vyvyan signed a new two-year deal with Saracens.In May 2011, during the Aviva Premiership Final, Vyvyan became the most capped player in the Premiership as he came off the bench to make his 238th appearance as Saracens lifted their first Premiership title.On retirement in 2012, Vyvyan received the Special Merit award from his peers at the Rugby Players Association Awards Dinner.Vyvyan was the Commercial Director at Saracens from 2012 to 2016.Vyvyan formed The Leadership Academy in 2016.Vyvyan became a member of the English Premiership Rugby Hall of Fame in 2016.", "link_mentions": [{"page": "Premiership Rugby", "response": ["| align=left |  Hugh Vyvyan"]}, {"page": "Saracens F.C.", "response": ["2004–05 saw a bold strengthening of the squad, for once eschewing their cosmopolitan recruitment policy and securing mainly English based players, possibly with one eye on the effect that international call-ups had had in previous seasons. In came Kevin Yates, Iain Fullarton, Alex Sanderson, Dan Scarbrough and Hugh Vyvyan, while Matt Cairns returned to the club and Steve Diamond arrived at the club as forwards coach. Another signing who was to become a prominent part of the Saracens' line up was fly half Glen Jackson from New Zealand."]}, {"page": "Rugby Aid", "response": ["|RL ||5 || Hugh Vyvyan (c)"]}, {"page": "Farleigh School", "response": ["* Hugh Vyvyan"]}]}}