{"wiki_id": "http://www.wikidata.org/entity/Q3142244", "itemLabel": "Hugh Felkin", "itemDescription": "British Chemist", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Felkin", "wikipedia_page": {"main": "Hugh Felkin (1922–2001) was a research chemist in France from 1950 to 1990 and a member of the Royal Society of Chemistry.\nIn 1967, he proposed a model to predict the stereochemical outcome of the addition of nucleophiles to carbonylic compounds. This model (now known as the Felkin-Anh model) differs slightly from Cram's rule and it is one of the most accepted rules to predict the outcome of these reactions.\nHe finished his career as Directeur de Recherche at the Institut de Chimie des Substances Naturelles in Gif-sur-Yvette. His laboratory worked on organometallic chemistry, with a special focus on organorhenium chemistry.\nBorn in England on 18 January 1922, he spent the second world war years in Switzerland studying chemistry. At that time the requirements for a degree were \"to show sufficient knowledge in chemistry\".\nAfter completing his studies, he went to France to work for the French National Centre for Scientific Research. In France he met Irène, born Elphimoff, also a research chemist, who became his wife. They had one daughter, Mary, born in 1962.\nHe was a member of the communist party until the communist coup in Prague in 1948. After this disappointment, his sympathies still firmly inclined towards the left, he read Le Monde without which he used to say he didn't know what to think.  Other sayings for which he was noted were \"Je suis anti-sioniste mais je n'arrive pas à être pro-arabe\", and in case of any uncertainty on the part of the presenter in group meetings, \"il ne s'agit pas de croire, il s'agit de savoir\".", "link_mentions": [{"page": "Gif-sur-Yvette", "response": ["* Well-known British chemists who have been working at the Institut de Chimie des Substances Naturelles at Gif include: Derek Barton, Hugh Felkin, Bob Crabtree and Steve Davies."]}, {"page": "Robert H. Crabtree", "response": ["After his PhD, he was a postdoctoral researcher with Hugh Felkin at the Institut de Chimie des Substances Naturelles at Gif-sur-Yvette, near Paris. He was a postdoctoral fellow (1973–1975) and then attaché de recherche (1975–1977). At the end of that time he was chargé de recherche. In 1977 Crabtree took an assistant professorship in Inorganic Chemistry at Yale University. He served as associate professor from 1982 to 1985, and as full professor from 1985 until the present. "]}, {"page": "Asymmetric induction", "response": ["The Felkin model (1968) named after Hugh Felkin also predicts the stereochemistry of nucleophilic addition reactions to carbonyl groups.Torsional strain involving partial bonds. The stereochemistry of the lithium aluminium hydride reduction of some simple open-chain ketones Marc Chérest, Hugh Felkin and Nicole Prudent Tetrahedron Letters Volume 9, Issue 18, 1968, Pages 2199-2204  Felkin argued that the Cram model suffered a major drawback: an eclipsed conformation in the transition state between the carbonyl substituent (the hydrogen atom in aldehydes) and the largest α-carbonyl substituent. He demonstrated that by increasing the steric bulk of the carbonyl substituent from methyl to ethyl to isopropyl to isobutyl, the stereoselectivity also increased, which is not predicted by Cram's rule:"]}, {"page": "Stephen G. Davies", "response": ["After his PhD, Davies subsequently held an ICI Postdoctoral Fellowship working with Malcolm Green (1975-1977) and a NATO Fellowship working with Derek Barton (1977-1978) before joining the Centre national de la recherche scientifique (CNRS) at Gif-sur-Yvette as Attaché de Recherche working with Hugh Felkin."]}, {"page": "January 1922", "response": ["**Hugh Felkin, English-born French chemist who devised the \"Felkin model\" to predict the stereochemistry of nucleophilic addition reactions to carbonyl groups, and modified it with the \"Felkin–Anh model\" based on improvements suggested by chemists Nguyễn Trọng Anh and Odile Eisenstein (d. 2001)"]}, {"page": "Bernard Meunier", "response": ["After a doctorate at the University of Montpellier in November 1971 under the supervision of Robert Corriu,Bernard Meunier, Comportement des organosilanes fonctionnels vis-à-vis des réactifs de Grignard activés par des complexes de nickel, Université Montpellier 2, thèse de troisième cycle en sciences, 1971 he obtained a state doctorate at the University of Paris-Sud in Orsay in June 1977 (with Hugh Felkin as thesis supervisor)."]}, {"page": "Felkin", "response": ["* Hugh Felkin (1922–2001), research chemist "]}]}}