{"wiki_id": "http://www.wikidata.org/entity/Q314301", "itemLabel": "Peter Yates", "itemDescription": "English film director and producer (1929-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Yates", "wikipedia_page": {"main": "Peter James Yates (24 July 1929 – 9 January 2011) was an English film director and producer.", "link_mentions": [{"page": "Cinema of the United Kingdom", "response": ["With the involvement of Channel 4 in film production, talents from television moved into feature films with Stephen Frears (My Beautiful Laundrette) and Mike Newell with Dance with a Stranger (1985). John Boorman, who had been working in the US, was encouraged back to the UK to make Hope and Glory (1987). Channel Four also became a major sponsor of the British Film Institute's Production Board, which backed three of Britain's most critically acclaimed filmmakers: Derek Jarman (The Last of England, 1987), Terence Davies (Distant Voices, Still Lives, 1988), and Peter Greenaway; the latter of whom gained surprising commercial success with The Draughtsman's Contract (1982) and The Cook, the Thief, His Wife & Her Lover (1989). Stephen Woolley's company Palace Pictures also produced some successful films, including Neil Jordan's The Company of Wolves (1984) and Mona Lisa (1986), before collapsing amid a series of unsuccessful films. Amongst the other British films of the decade were Bill Forsyth's Gregory's Girl (1981) and Local Hero (1983), Lewis Gilbert's Educating Rita (1983), Peter Yates' The Dresser (1983) and Kenneth Branagh's directorial debut, Henry V (1989)."]}, {"page": "Mandy Patinkin", "response": ["| The House on Carroll Street || Ray Salwen || Peter Yates ||"]}, {"page": "Morgan Freeman", "response": ["In 1980, he had a small role as Walter in the drama Brubaker, which starred Robert Redford as a prison warden. Freeman next appeared in the television film, Attica (1980), which is about the 1971 Attica Prison riot and its aftermath. A year later, he starred in Peter Yates' Eyewitness with co-stars William Hurt and Sigourney Weaver. From 1982 to 1984, Freeman was a cast member of the soap opera Another World, playing architect Roy Bingham. After several small roles in dramas, he starred in Marie (1985), a film adaptation of Marie: A True Story by Peter Maas, in which he portrayed Charles Traughber, and also appeared in the miniseries The Atlanta Child Murders. Freeman also had a small role in the drama That Was Then... This Is Now, based on the novel of the same name by S. E. Hinton. In the mid-1980s, he began accepting prominent supporting roles in feature films, earning him a reputation for depicting wise, fatherly characters."]}, {"page": "Screwball comedy", "response": ["* For Pete's Sake (1974), d. Peter Yates"]}, {"page": "Steven Soderbergh", "response": ["When asked about the top eleven films he regarded among the best, Soderbergh listed the following, in order: The 5,000 Fingers of Dr. T. (1953), All The President's Men (1976), Annie Hall (1977), Citizen Kane (1941), The Conversation (1974), The Godfather (1972), The Godfather Part II (1974), Jaws (1975), The Last Picture Show (1971), Sunset Boulevard (1950), The Third Man (1949). His directorial debut, Sex, Lies, and Videotape (1989), was influenced by Mike Nichols' 1971 American comedy-drama Carnal Knowledge. He has said that Peter Yates' 1972 crime-comedy The Hot Rock inspired the tone of the Ocean's films."]}, {"page": "1929", "response": ["** Peter Yates, English film director and producer (d. 2011)"]}, {"page": "Dustin Hoffman", "response": ["Also in 1969, Hoffman co-starred with Mia Farrow in the Peter Yates's romantic drama film John and Mary. He received a 1970 British Academy Film Award for Best Actor for his performance in the film, although the film received mixed reviews. He was also nominated for a Golden Globe Award for Best Actor in a Musical or Comedy Motion Picture The film was made fresh off the success of Farrow's performance in Roman Polanski's Rosemary's Baby (1968), and Hoffman's performance in The Graduate which prompted them being hailed on the cover of the February 27, 1969, Time magazine as stars of their generation."]}, {"page": "Albert Finney", "response": ["Finney went into The Dresser (1983), directed by Peter Yates, which earned him a Best Actor Oscar Nomination. He then played the title role in the TV movie Pope John Paul II (1984), his American TV debut.", "He followed it with The Playboys (1992) for Gillies MacKinnon; Rich in Love (1993) for Bruce Beresford; The Browning Version (1994) for Mike Figgis; A Man of No Importance (1994), for Suri Krishnamma; and The Run of the Country (1995) for Peter Yates. In 1994, Finney played a gay bus conductor in early 1960s Dublin in A Man of No Importance."]}, {"page": "Betty Marsden", "response": ["Her other film roles included, Ramsbottom Rides Again (1956), The Big Day (1960), The Boys (1962), The Wild Affair (1964), The Leather Boys (1964), The Best House in London (1969), and Eyewitness (1970). She later played Hermione in the 1982 British film Britannia Hospital, Violet Manning in Peter Yates' 1983 film version of The Dresser, Princess Troubetskaya in the 1986 TV movie Anastasia: The Mystery of Anna, and Mrs. Barnacle in the 1987 film version of Little Dorrit."]}, {"page": "Academy Award for Best Picture", "response": ["| Peter Yates", "| Peter Yates", "* Peter Yates"]}, {"page": "Peter O'Toole", "response": ["In other films he played a man in love with his sister (played by Susannah York) in Country Dance (1970). O'Toole starred in a war film for director Peter Yates, Murphy's War (1971), appearing alongside Sian Phillips. He was reunited with Richard Burton in a film version of Under Milk Wood (1972) by Dylan Thomas, produced by himself and Buck; Elizabeth Taylor co-starred. The film was not a popular success."]}, {"page": "Breaking Away", "response": ["is a 1979 American coming of age comedy-drama film produced and directed by Peter Yates and written by Steve Tesich. It follows a group of four male teenagers in Bloomington, Indiana, who have recently graduated from high school. The film stars Dennis Christopher, Dennis Quaid, Daniel Stern, Jackie Earle Haley, Barbara Barrie, Paul Dooley, and Robyn Douglass.", "The scenes filmed in and around Bloomington, Indiana, were filmed during the summer of 1978. Prior to filming, cyclists Ira Schaffer and Gerry Bretting helped introduce Dennis Christopher and Hart Bochner to the world of bicycle racing after director Peter Yates met Gerry Bretting at Wilshire West Bicycle store. Schaffer and Bretting spent several weeks with Christopher and Bochner.   Many of the scenes in the movie were filmed on the Indiana University campus; glimpses of the Indiana Memorial Union are in the background of Dave's ride through campus. Dave Stoller's house in the film is located at the corner of S. Lincoln St. and E. Dodds St. The pizza restaurant in the film (\"PAGLIAI'S\") is now Opie Taylors on the east side of North Walnut Street, across from the Monroe County Courthouse. Other scenes were filmed outside the Delta Delta Delta sorority house (818 E. 3rd St) and along Jordan Street.", "The film received positive reviews upon its release. Roger Ebert called it \"a wonderfully sunny, funny, goofy, intelligent movie that makes you feel about as good as any movie in a long time. It is, in fact, a treasure ... Movies like this are hardly ever made at all; when they're made this well, they're precious cinematic miracles.\" The New York Timess Janet Maslin wrote that, even though \"the cast is unknown, the director has a spotty history, and the basic premise falls into this year's most hackneyed category ... the finished product is wonderful. Here is a movie so fresh and funny it didn't even need a big budget or a pedigree.\" The Variety magazine review concluded that \"though its plot wins no points for originality, Breaking Away is a thoroughly delightful light comedy, lifted by fine performances from Dennis Christopher and Paul Dooley.\" Critic Dave Kehr, however, gave a later, somewhat dissenting opinion: \"Released at a time when any small-scale film earned critical favor simply by virtue of its unpretentiousness, Breaking Away probably looked better in context than it does now.\" However, he conceded that \"Peter Yates lends the film a fine, unexpected limpidity, and the principals are mostly excellent.\" On review aggregator website Rotten Tomatoes, the film has an approval rating of 95% based on 41 reviews, with a rating average of 8.2/10. The website's critical consensus reads: \"At once a touching, funny coming-of-age story and a compelling sports film, Breaking Away is a delightful treat.\"\"Breaking Away (1979)\". Rotten Tomatoes. Retrieved September 2, 2019.", "| rowspan=\"2\"| Peter Yates", "| Peter Yates", "Category:Films directed by Peter Yates"]}, {"page": "The Dresser (1983 film)", "response": ["The Dresser is a 1983 British drama film directed by Peter Yates and adapted by Ronald Harwood from his 1980 play The Dresser. It tells the story of an aging actor's personal assistant struggling to keep his employer's life together. The film stars Albert Finney, Tom Courtenay, Zena Walker, Eileen Atkins, Michael Gough, and Edward Fox.", "| rowspan=\"2\"| Peter Yates", "| Peter Yates", "| rowspan=\"3\"| Peter Yates", "| Peter Yates", "| Peter Yates", "Category:Films directed by Peter Yates"]}, {"page": "Sewickley, Pennsylvania", "response": ["In 1995, the movie Roommates was filmed in and around Pittsburgh, Pennsylvania including Sewickley. Roommates starred Peter Falk, D. B. Sweeney, and Julianne Moore, and was directed by Peter Yates. The same year, parts of the movie Houseguest was filmed in Sewickley including Sewickley's main streets, Broad Street and Beaver Street. In 2002, parts of The Mothman Prophecies was filmed in the Sewickley area. Scenes from the Netflix show Sweet Magnolias was also filmed at the intersection of Broad Street and Beaver Street. The Bruegger's Bagels on Beaver Street was transformed into a McDonald's during shooting. Scenes from Jack Reacher, starring Tom Cruise, and The Lifeguard, starring Kristen Bell, were filmed in the town near the Sewickley Manor apartments and condominiums. Foxcatcher, starring Steve Carell, Mark Ruffalo, and Channing Tatum, began filming in the Sewickley area in October 2012."]}, {"page": "Great Train Robbery (1963)", "response": ["* The 1967 film, Robbery, is a heavily fictionalised version based on the events of 1963 directed by Peter Yates. The movie launched Yates's Hollywood career after it attracted the interest of Steve McQueen who got the British director to make his next feature, Bullitt. The film featured a gripping car chase (though this was connected to another earlier crime and not the robbery) which included scenes of a policeman being run down. Despite being a fictionalised account Robbery did draw on key details of the real robbery and these were reflected in the film. These included the detailed planning and preparation used, the use of a farmhouse as a base and the intended (but unsuccessful) use of a replacement driver for the train. The film ends with the mastermind of the robbery \"Clifton\", played by Stanley Baker (whose own company Oakhurst Productions had produced the film), evading capture and going on the run overseas by posing as a merchant seaman."]}, {"page": "2000 in film", "response": ["| Don Quixote || TNT / Hallmark Entertainment || Peter Yates (director); John Mortimer (screenplay); John Lithgow, Bob Hoskins, Isabella Rossellini, Vanessa Williams, Lambert Wilson, Amelia Warner, Tony Haygarth, Peter Eyre, Lilo Baur, James Purefoy, Trevor Peacock, Linda Bassett, Barry Stanton, Alun Raglan, Michael Feast, Graham Crowden, Amparo Valle, Alicia Borrachero, Ruth Sheen, Sean Gilder, Francis Magee, Jessica Oyelowo, Michael Culkin, Timothy Bateson, Antonio Gil || Adventure, Comedy, Romance || Live action"]}, {"page": "F. Murray Abraham", "response": ["After the release of The Name of the Rose, Abraham stated in an interview that he had tired of appearing as villains and wanted to return to his background in comedy. Over the next decade or so, Abraham had fewer prominent roles, but he did have substantial supporting roles in Peter Yates' An Innocent Man (1989), Woody Allen's Mighty Aphrodite (1995), Ahdar Ru'afo in Star Trek: Insurrection (1998), and Gus Van Sant's Finding Forrester (2000), where he again played the nemesis to Connery. He had a significant role in Brian De Palma's adaptation of The Bonfire of the Vanities (1990), but chose not to be credited due to a contract dispute. He continued his association with classical music by narrating the plot summaries of the operas of Wagner's Ring Cycle in the 1990 PBS broadcast from the Metropolitan Opera, to the largest viewing audience of the Ring Cycle in history, conducted by James Levine."]}, {"page": "William Hurt", "response": ["| Peter Yates"]}, {"page": "1995 in film", "response": ["| Roommates || Hollywood Pictures / Interscope Communications || Peter Yates (director); Max Apple, Stephen Metcalfe (screenplay); Peter Falk, D. B. Sweeney, Julianne Moore, Jan Rubeš, Ellen Burstyn, Frankie Faison, Ernie Sabella, John Cunningham, Raymond K. Wong, William H. Macy, Mengze Shi || Comedy, Drama || Live action", "| The Run of the Country || Columbia Pictures || Peter Yates (director); Shane Connaughton (screenplay); Albert Finney, Matt Keeslar, Victoria Smurfit, Anthony Brophy, David Kelly, Shaney McPhillips || Romance, Drama || Live action"]}, {"page": "1989 in film", "response": ["| An Innocent Man || Touchstone Pictures / Silver Screen Partners / Interscope Communications || Peter Yates (director); Larry Brothers (screenplay); Tom Selleck, F. Murray Abraham, Laila Robins, David Rasche, Richard Young, Badja Djola, Bruce A. Young, Dennis Burkley, Todd Graff, M. C. Gainey, Tobin Bell, Maggie Baird, Lt. Mike Budge, Peter Van Norden, James T. Morris || Crime, Thriller || Live action"]}, {"page": "1988 in film", "response": ["| The House on Carroll Street || Orion Pictures || Peter Yates (director); Walter Bernstein (screenplay); Kelly McGillis, Jeff Daniels, Mandy Patinkin, Jessica Tandy, Jonathan Hogan, Remak Ramsay, Kenneth Welsh, Christopher Buchholz || Thriller || Live action", "*The House on Carroll Street, directed by Peter Yates, starring Kelly McGillis and Jeff Daniels"]}, {"page": "1987 in film", "response": ["| Suspect || TriStar Pictures || Peter Yates (director); Eric Roth (screenplay); Cher, Dennis Quaid, Liam Neeson, John Mahoney, Joe Mantegna, Philip Bosco, Fred Melamed, Bernie McInerney, Bill Cobbs, Richard Gant, Jim Walton, Michael Beach, Ralph Cosham, Djanet Sears || Mystery, Drama || Live action", "* Suspect, directed by Peter Yates, starring Cher, Dennis Quaid, John Mahoney, Joe Mantegna, Liam Neeson"]}, {"page": "1992 in film", "response": ["| Year of the Comet || Columbia Pictures / Castle Rock Entertainment || Peter Yates (director); William Goldman (screenplay); Tim Daly, Penelope Ann Miller, Louis Jourdan, Ian Richardson, Nick Brimble, Shane Rimmer, Timothy Bentinck || Romance, Comedy || Live action"]}, {"page": "1985 in film", "response": ["*Eleni, directed by Peter Yates, starring John Malkovich, Kate Nelligan, Linda Hunt, Glenne Headly"]}, {"page": "1983 in film", "response": ["*The Dresser, directed by Peter Yates, starring Albert Finney and Tom Courtenay - (U.K.)", "*Krull, directed by Peter Yates, starring Ken Marshall, Lysette Anthony, Francesca Annis, Liam Neeson - (U.K.)", "| Krull || Columbia Pictures / Barclays Mercantile / Industrial Finance || Peter Yates (director); Stanford Sherman (screenplay); Ken Marshall, Lysette Anthony, Freddie Jones, Francesca Annis, Trevor Martin, David Battley, Bernard Bresslaw, Alun Armstrong, Liam Neeson, Robbie Coltrane, Michael Elphick, Dicken Ashworth, Todd Carty, Bronco McLoughlin, Gerard Naprous, Andy Bradford, Bill Weston, John Welsh, Graham McGrath, Tony Church, Clare McIntyre, Belinda Mayne || Sci-Fi, Fantasy || Live action", "| The Dresser || Columbia Pictures || Peter Yates (director); Ronald Harwood (screenplay); Albert Finney, Tom Courtenay, Edward Fox, Zena Walker, Eileen Atkins, Michael Gough, Cathryn Harrison, Betty Marsden, Sheila Reid, Lockwood West, Donald Eccles, Llewellyn Rees, Guy Manning, Anne Mannion, Kevin Stoney, Ann Way, John Sharp, Kathy Staff, Roger Avon || Drama || Live action"]}, {"page": "1981 in film", "response": ["*Eyewitness, directed by Peter Yates, starring William Hurt, Sigourney Weaver, Christopher Plummer, James Woods", "| Eyewitness || 20th Century Fox || Peter Yates (director); Steve Tesich (screenplay); William Hurt, Sigourney Weaver, Christopher Plummer, James Woods, Irene Worth, Kenneth McMillan, Pamela Reed, Steven Hill, Morgan Freeman, Alice Drummond, Keone Young || Neo-Noir, Thriller || Live action"]}, {"page": "1979 in film", "response": ["*Breaking Away, directed by Peter Yates, starring Dennis Christopher, Dennis Quaid, Daniel Stern, Jackie Earle Haley, Paul Dooley", "| Breaking Away || 20th Century Fox || Peter Yates (director); Steve Tesich (screenplay); Dennis Christopher, Dennis Quaid, Daniel Stern, Jackie Earle Haley, Barbara Barrie, Paul Dooley, Robyn Douglass, Hart Bochner, P.J. Soles, Amy Wright, John Ashton || Coming-of-Age, Comedy, Drama || Live Action"]}, {"page": "1977 in film", "response": ["* The Deep, directed by Peter Yates, starring Robert Shaw, Jacqueline Bisset, Nick Nolte, Louis Gossett, Jr.", "| The Deep || Columbia Pictures / Casablanca FilmWorks / EMI Films || Peter Yates (director); Peter Benchley (screenplay); Robert Shaw, Jacqueline Bisset, Nick Nolte, Louis Gossett, Eli Wallach, Dick Anthony Williams, Earl Maynard, Bob Minor, Teddy Tucker, Robert Tessier, Lee McClain, Colin Shaw || Adventure || Live Action "]}, {"page": "1976 in film", "response": ["*Mother, Jugs & Speed, directed by Peter Yates, starring Bill Cosby, Raquel Welch, Harvey Keitel"]}, {"page": "1973 in film", "response": ["*The Friends of Eddie Coyle, directed by Peter Yates, starring Robert Mitchum, Richard Jordan, Steven Keats, Alex Rocco, Peter Boyle"]}, {"page": "1972 in film", "response": ["*The Hot Rock, directed by Peter Yates, starring Robert Redford, George Segal, Ron Leibman, Zero Mostel"]}, {"page": "1968 in film", "response": ["*Bullitt, directed by Peter Yates, starring Steve McQueen, Jacqueline Bisset, Robert Vaughn"]}, {"page": "1967 in film", "response": ["* Robbery, directed by Peter Yates, starring Stanley Baker – (U.K.)"]}, {"page": "1965 in film", "response": ["*One Way Pendulum, directed by Peter Yates – (U.K.)"]}, {"page": "Golden Globe Award for Best Director", "response": ["| Peter Yates", "| Peter Yates", "* Peter Yates (2/0)"]}, {"page": "Golden Globe Award for Best Motion Picture – Musical or Comedy", "response": ["| rowspan=\"5\" style=\"text-align:center;\"| 1979|| style=\"background:#b0c4de; text-align:left;\"| Breaking Away  || style=\"background:#B0C4DE;\" | Peter Yates || style=\"background:#B0C4DE;\" | Steve Tesich"]}, {"page": "John Barry (composer)", "response": ["| Peter Yates", "| Peter Yates"]}, {"page": "American International Pictures", "response": ["| align=\"right\"| March 12, 1964 || Summer Holiday || Beach party || Peter Yates"]}, {"page": "Robert Vaughn", "response": ["| Drama–thriller film directed by Peter Yates and produced by Philip D'Antoni."]}, {"page": "Jackie Earle Haley", "response": ["He played Moocher in Peter Yates's acclaimed 1979 film Breaking Away and later in the short-lived TV series of the same name. Throughout the 1970s, he often played a tough, angry, pimply, long-haired misfit; although in his feature debut, the offbeat 1972 film, The Outside Man, he played Eric, a boy apparently so desperately lonely that he tries to impress the mob assassin holding him and his mother (Georgia Engel) hostage. Haley also shot a pilot for an American version of the popular British comedy The Young Ones titled Oh, No! Not THEM!. In 1974 he played Norm a misfit kid in the 12th episode of the Saturday morning children's show, Shazam! Hollypowellstudios.com"]}, {"page": "Howard Shore", "response": ["|Peter Yates"]}, {"page": "Michael Kamen", "response": ["| Peter Yates"]}, {"page": "Superman (1978 film)", "response": ["Ilya Salkind had first conceived the idea for a Superman film in late 1973. In November 1974, after a long, difficult process with DC Comics, the Superman film rights were purchased by Ilya, his father Alexander Salkind, and their partner Pierre Spengler. DC wanted a list of actors that were to be considered for Superman, and approved the producer's choices of Muhammad Ali, Al Pacino, James Caan, Steve McQueen, Clint Eastwood and Dustin Hoffman.Richard Donner, Tom Mankiewicz, Ilya Salkind, Pierre Spengler, David Prowse, You Will Believe: The Cinematic Saga of Superman, 2006, Warner Home Video The filmmakers felt it was best to film Superman and Superman II back-to-back, and to make a negative pickup deal with Warner Bros. William Goldman was approached to write the screenplay, while Leigh Brackett was considered. Ilya hired Alfred Bester, who began writing a film treatment. Alexander felt, however, that Bester was not famous enough, so he hired Mario Puzo to write the screenplay at a $600,000 salary. Francis Ford Coppola, William Friedkin, Richard Lester (who later directed Superman II and III), Peter Yates, John Guillermin, Ronald Neame and Sam Peckinpah were in negotiations to direct. Peckinpah dropped out when he produced a gun during a meeting with Ilya. George Lucas turned down the offer because of his commitment to Star Wars."]}, {"page": "List of film and television directors", "response": ["*Peter Yates"]}, {"page": "Bullitt", "response": ["Bullitt is a 1968 American neo-noir action thriller film directed by Peter Yates and produced by Philip D'Antoni. The picture stars Steve McQueen, Robert Vaughn, and Jacqueline Bisset. The screenplay by Alan R. Trustman and Harry Kleiner was based on the 1963 novel Mute Witness, by Robert L. Fish, writing under the pseudonym Robert L. Pike. Lalo Schifrin wrote the original jazz-inspired score.  ", "At the time of the film's release, the exciting car chase scenes, featuring McQueen at the wheel in all driver-visual scenes, generated prodigious excitement. Leonard Maltin has called it a \"now-classic car chase, one of the screen's all-time best.\" Emanuel Levy wrote in 2003 that \"Bullitt contains one of the most exciting car chases in film history, a sequence that revolutionized Hollywood's standards.\" In his obituary for Peter Yates, Bruce Weber wrote, \"Mr. Yates' reputation probably rests most securely on Bullitt (1968), his first American film – and indeed, on one particular scene, an extended car chase that instantly became a classic.\"", "The film was nominated for and won several critical awards. Frank P. Keller won the 1969 Academy Award for Best Film Editing, and it was also nominated for Best Sound. Five nominations at the BAFTA Film Awards for 1969 included Best Director for Peter Yates, Best Supporting Actor for Robert Vaughn, Best Cinematography for William A. Fraker, Best Film Editing for Frank P. Keller, and Best Sound Track. Robert Fish, Harry Kleiner, and Alan Trustman won the 1969 Edgar Award for Best Motion Picture. Keller won the American Cinema Editors Eddie Award for Best Edited Feature Film. The film also received the National Society of Film Critics Award for Best Cinematography (William A. Fraker) and the Golden Reel Award for Best Sound Editing – Feature Film. It was successful at the 1970 Laurel Awards, winning Golden Laurel awards for Best Action Drama, Best Action Performance (Steve McQueen) and Best Female New Face (Jacqueline Bisset). In 2000, the Society of Camera Operators awarded Bullitt its \"Historical Shot\" award to David M. Walsh.", "Category:Films directed by Peter Yates"]}, {"page": "James Horner", "response": ["| Peter Yates", "| Peter Yates"]}]}}