{"wiki_id": "http://www.wikidata.org/entity/Q3142269", "itemLabel": "Hugh Iorys Hughes", "itemDescription": "Welsh civil engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Iorys_Hughes", "wikipedia_page": {"main": "Hugh Iorys Hughes (16 April 1902 – 16 August 1977) was a Welsh civil engineer and keen yachtsman who submitted ideas to the War Office for the design of the Mulberry harbours used in Operation Overlord. \nHughes was born in Bangor, where he attended Friars' School, and grew up in the Conwy area, becoming familiar with its waters. He studied engineering at the University of Sheffield. Afterwards he went to work for Owen Williams, a designer of concrete structures, specialising in bridges. On the outbreak of war, he was unable to join the armed services because he was now in a reserved occupation.In 1917 Churchill drafted plans for the capture of the islands of Borkum and Sylt, off the Dutch and Danish coasts. He planned to use sunken caissons filled with sand to form an artificial breakwater on the seabed. The proposal was shelved and forgotten. In 1940 the civil engineer Guy Maunsell wrote to the War Office with a proposal for an artificial harbour, but the idea was not adopted. In 1942 Hughes came up with a similar idea for using caissons as part of a jetty while working as a civil engineer in London.  He also submitted his plans to the War Office, and these were ignored until Hughes' brother, Alain Sior Hughes, who was a Commander in the Royal Naval Volunteer Reserve, drew attention to the documents.\nFollowing Winston Churchill's memo Piers For Use On Beaches, dated 30 May 1942, the Mulberry project gained momentum under the direction of Major General D J McMullen and civil engineer Brigadier Bruce White. An early priority was the construction of trial installations in the Clyde estuary at Gare Loch. Hughes designed and supervised construction of a prototype jetty consisting of 'Hippo' concrete caissons sunk on the sea bed supporting 'Crocodile' steel roadway bridge units which spanned between the Hippos. The prototype was built at Conwy Morfa near Hughes' home town of Conwy and towed to Garlieston, Wigtownshire, in Scotland, where it was installed and tested against two other designs, both of which were floating roadways; the \"Swiss Roll\", designed by R M Hamilton, was made of canvas and steel cables, while the \"Whale\" roadway  designed by Allan Beckett  consisted of flexible bridge spans mounted on pontoons. During the testing a storm washed away the Swiss Roll and created scour of the sea bed around the Hippo units, which in turn led to them tilting, resulting in the failure of the Crocodile spans. The Whale roadway design survived the tests undamaged and was consequently selected for use on the Mulberry harbours. One of Hughes' Hippo units did survive at Rigg Bay off Garlieston until it collapsed in a storm on 16 March 2006.In June 1943 the War Office set up a committee of civil engineers to advise on the design of the artificial harbours and the equipment to be used in them. Despite their early submissions to the War Office, neither Maunsell nor Hughes was appointed to the committee.In 1946, Hughes married Jane Vernon. After competing in several long-distance yachting events, he co-founded the Ocean Cruising Club in 1954. Later in the decade, he was involved in the building of the Blackwall Tunnel. He suffered a heart attack in 1960, and eventually retired to West Mersea.Hughes' ashes were spread in the Menai Straits after his death in Colchester, Essex.  His former family house in Bangor is now let to students of Bangor University, and has a Blue plaque outside it in his honour. There is also a plaque to his memory in the museum at Arromanches.", "link_mentions": [{"page": "Mulberry harbour", "response": ["Churchill issued his memo \"Piers for use on beaches\" on 30 May 1942, apparently in some frustration at the lack of progress being made on finding a solution to the temporary harbour problem. Between 17 June and 6 August 1942, Hugh Iorys Hughes submitted a design concept for artificial harbours to the War Office.", "* Hugh Iorys Hughes (a civil engineer) who developed his \"Hippo\" piers and \"Crocodile\" bridge spans;"]}, {"page": "Conwy", "response": ["Conwy Morfa, a marshy spit of land on the west side of the estuary, was probably the location where golf was first played on Welsh soil. It was also the place where Hugh Iorys Hughes developed, and later built, the floating Mulberry Harbour, used in Operation Overlord in World War II."]}, {"page": "1977 in Wales", "response": ["*16 August - (at Colchester) Hugh Iorys Hughes, engineer, 75"]}, {"page": "Hugh Hughes", "response": ["*Hugh Iorys Hughes (1902–1977), British civil engineer"]}, {"page": "1902 in Wales", "response": ["*16 April – Hugh Iorys Hughes, civil engineer (died 1977 in England)"]}, {"page": "Holloway Brothers (London)", "response": ["Also stemming from experience with the sea forts was the company's involvement in the development of the Mulberry harbour units.Hartcup, p. 94 In October 1942 Holloways were commissioned to build three units on the Hippo design of Hugh Iorys Hughes on shore at Conwy Morfa, no suitable dry dock being available. This was a considerable challenge because the largest unit, the pierhead, consisted of a reinforced concrete pontoon 203 feet long, with a beam of 45 feet and depth of 24 feet, on which was mounted a steel superstructure 62 feet high and itself weighing 350 tons. The total weight of the unit was 3,200 tons and had to be side launched. The solution was to build the unit on keel blocks and when complete transfer the weight to the launching cradle which ran over a curved ramp which increased in gradient from one in 16 to one in six. Although the Hippo design itself was not adopted the build and launching technique was widely used for other Mulberry units."]}, {"page": "Morfa Conwy", "response": ["There is a debate as to who came up with the design for the Mulberry Harbour, but what is known is that North Walian civil engineer Hugh Iorys Hughes was given the task of proving one of the competing designs – the one to which he had most input. The prototypes were constructed at the Morfa, with the area transformed into a huge construction site and over 1000 labourers were drafted in. These included Oleg Kerensky, son of former Russian Prime Minister Alexander Kerensky, who supervised the construction process. Hughes constructed three 'Hippo' caissons, which were towed from the Morfa to the test site at Rigg Bay, on the Solway Firth near Garlieston, Scotland. The site of full production was behind what is now the second green, before the caissons were launched into the River Conwy estuary for their journey south, where they were ultimately to play a key role in the D-Day landings."]}]}}