{"wiki_id": "http://www.wikidata.org/entity/Q3147302", "itemLabel": "Ian Malcolm", "itemDescription": "British politician (1868-1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Malcolm_(politician)", "wikipedia_page": {"main": "Sir Ian Zachary Malcolm, 17th Laird of Poltalloch, KCMG (3 September 1868 – 28 December 1944) was a Conservative Member of Parliament and Chieftain of the Clan Malcolm/MacCallum.", "link_mentions": [{"page": "Benjamin Disraeli", "response": ["Disraeli told the Queen, \"it is settled; you have it, madam!\"Aldous, p. 263 The public saw the venture as a daring statement of British dominance of the seas.  Sir Ian Malcolm described the Suez Canal share purchase as \"the greatest romance of Mr. Disraeli's romantic career\". In the following decades, the security of the Suez Canal, as the pathway to India, became a major concern of British foreign policy. Under Gladstone Britain took control of Egypt in 1882. A later Foreign Secretary, Lord Curzon, described the canal in 1909 as \"the determining influence of every considerable movement of British power to the east and south of the Mediterranean\"."]}, {"page": "Lillie Langtry", "response": ["In 1902, Jeanne Marie married the Scottish politician Sir Ian Malcolm at St Margaret's, Westminster. They had four children, three sons and a daughter. Lady Malcolm died in 1964. Her daughter Mary Malcolm was one of the first two female announcers on the BBC Television Service (now BBC One) from 1948 to 1956. She died on 13 October 2010, aged 92. Jeanne Marie's second son, Victor Neill Malcolm, married English actress Ann Todd. They divorced in the late 1930s. Malcolm remarried in 1942 to an American, Mary Ellery Channing."]}, {"page": "Bonar Law", "response": ["In parliament, Law worked exceedingly hard at pushing for tariff reform, regularly speaking in the House of Commons and defeating legendary debaters such as Winston Churchill, Charles Dilke and H. H. Asquith, former home secretary and later prime minister.Adams (1999) p.26 His speeches at the time were known for their clarity and common sense; Sir Ian Malcolm said that he made \"the involved seem intelligible\", and L.S. Amery said his arguments were \"like the hammering of a skilled riveter, every blow hitting the nail on the head\". Despite Law's efforts to forge consensus within the Conservatives, Balfour was unable to hold the two sides of his party together, and resigned as prime minister in December 1905, allowing the Liberals to form a government.", "By 12 March he had established that, should the Home Rule Bill be passed under the Parliament Act 1911, the Army (Annual) Act should be amended in the Lords to stipulate that the Army could not \"be used in Ulster to prevent or interfere with any step which may thereafter be taken in Ulster to organise resistance to the enforcement of the Home Rule Act in Ulster nor to suppress any such resistance until and unless the present Parliament has been dissolved and a period of three months shall have lapsed after the meeting of a new Parliament\".Adams (1999) p.149 The Shadow Cabinet consulted legal experts, who agreed wholeheartedly with Law's suggestion. Although several members expressed dissent, the Shadow Cabinet decided \"provisionally to agree to amendment of army act. but to leave details and decisions as to the moment of acting to Lansdowne and Law\".Adams (1999) p.150 In the end no amendment to the Army Act was offered, though; many backbenchers and party loyalists became agitated by the scheme and wrote to him that it was unacceptable – Ian Malcolm, a fanatical Ulster supporter, told Law that amending the Army Act would drive him out of the Party."]}, {"page": "List of proposed provinces and territories of Canada", "response": ["In 1905 British M.P. Ian Malcolm suggested in the British House of Commons that the U.K. might benefit from transferring one or some of the West Indies isles to Canada for national defence."]}, {"page": "Sir Ian Malcolm", "response": ["#REDIRECT Ian Malcolm (politician)"]}, {"page": "Croydon South (historic UK Parliament constituency)", "response": ["| Ian Malcolm", "The seat was created in 1918 and the first MP was Ian Malcolm, who had been the MP for all of Croydon. H.T. Muggeridge, father of Malcolm Muggeridge, fought the seat for Labour four times from 1918, later becoming MP for Romford. The seat saw a by-election in 1932, won by Herbert Williams."]}, {"page": "Hughligans", "response": ["The name is a pun on the word hooligan and \"Hugh\", as in Lord Hugh Cecil (later Lord Quickswood), one of the faction's leaders. The Hughligans were a group of backbench Conservative MPs who were dissatisfied with the leadership of Arthur Balfour. Cecil was a younger son of Balfour's predecessor as Conservative Leader, the Marquess of Salisbury. Besides Cecil, other members were F.E. Smith, Earl Percy, Arthur Stanley, Ian Malcolm and Lord George Hamilton. Winston Churchill was also associated with the group before his departure from the Conservative Party in 1904."]}, {"page": "List of United Kingdom MPs: M", "response": ["*Ian Malcolm"]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["| Ian Malcolm"]}, {"page": "List of United Kingdom by-elections (1918–1931)", "response": ["|Ian Malcolm"]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["| Ian Malcolm"]}, {"page": "Hugh Cecil, 1st Baron Quickswood", "response": ["During the early 20th century, Cecil (known to his friends as \"Linky\") was the eponymous leader of the Hughligans, a group of privileged young Tory Members of Parliament critical of their own party's leadership. Modelled after Lord Randolph Churchill's Fourth Party, the Hughligans included Cecil, F. E. Smith, Arthur Stanley, Ian Malcolm and, until 1904, Winston Churchill. Cecil was the best man at Churchill's wedding in 1908 and the latter greatly admired his eloquence in the House of Commons. As Churchill declared to a contemporary, Llewellyn Atherley-Jones,\"How I wish I had his powers; speech is a painful effort to me.\"L.A. Atherley-Jones, Looking Back: Reminiscences of a Political Career (London, 1925), p. 108 Cecil dissented from the beginning from Joseph Chamberlain's policy of tariff reform, pleading in Parliament against any devaluation of the idea of empire to a \"gigantic profit-sharing business\". He took a prominent position among the \"Free Food Unionists\"; consequently he was attacked by the tariff reformers, and lost his seat at Greenwich in 1906."]}, {"page": "List of MPs elected in the 1900 United Kingdom general election", "response": ["| Ian Malcolm"]}, {"page": "Croydon (UK Parliament constituency)", "response": ["||1910 || Ian Malcolm || Conservative", "thumb|120px|Ian Malcolm", "*Unionist: Ian Malcolm"]}, {"page": "Stowmarket (UK Parliament constituency)", "response": ["| Ian Malcolm"]}, {"page": "IZ Malcolm", "response": ["#REDIRECT Ian Malcolm (politician) "]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Sir Ian Malcolm; MP for Stowmarket (1895–1906), Croydon (1910–1918) and Croydon South (1918–1919)"]}, {"page": "John Malcolm, 1st Baron Malcolm of Poltalloch", "response": ["He died at Hyères, France, on 6 March 1902, aged 68, when the barony became extinct. He left his estate to his younger brother Colonel Edward Donald Malcolm (1837–1930), who also succeeded as Laird of Poltalloch. The latter's son was Conservative politician Sir Ian Malcolm (1868–1944)."]}, {"page": "Sir Ian", "response": ["*Sir Ian Malcolm, politician"]}, {"page": "Mary Malcolm", "response": ["The daughter of Sir Ian Malcolm and Jeanne Langtry (1881–1964) and granddaughter of Victorian socialite actress Lillie Langtry, who was the mistress of King Edward VII of the United Kingdom,Anthony Camp, Royal Mistresses and Bastards: Fact and Fiction 1714–1936 (London, 2007) p. 365. Mary was brought up in Poltalloch, Argyll, Scotland. Until the age of 16, she attended the Lycée Français Charles de Gaulle in South Kensington, London. She began her television career in 1948, having gained broadcasting experience on the radio during World War II. As more and more men were called up to fight, women became increasingly in demand to fill posts at the BBC. Mary Malcolm was taken on and worked for the Home Service as a continuity announcer from March 1942. With the relaunch of the BBC's television service after the war, she worked alongside Sylvia Peters and McDonald Hobley, with the trio averaging ten days' work a month each."]}, {"page": "List of Vanity Fair (British magazine) caricatures (1895–1899)", "response": ["|1898-05-1212 May 1898||Malcolm-IanIan Malcolm MP||North West Suffolk||Spy||S 694||25px"]}, {"page": "1919 Croydon South by-election", "response": ["The by-election was caused by the resignation of the sitting Unionist MP, Sir Ian Malcolm on 28 October 1919. He had been the MP for Croydon since December 1910.", "Croydon was a traditionally strong area for the Unionists. The Croydon constituency was created in 1885 and won by the Unionists at every election. In 1918, it was divided into two seats, and its MP, Ian Malcolm, was elected for the new Croydon South seat. He was helped by the absence of a Liberal opponent and the official support of the Coalition government;"]}, {"page": "Balfour Mission", "response": ["* Ian Malcolm"]}, {"page": "Sir Ian Zachary Malcolm", "response": ["#REDIRECT Ian Malcolm (politician)"]}, {"page": "Ian Malcolm (character)", "response": ["Dr. Ian Malcolm is a fictional character from the Jurassic Park franchise created by Michael Crichton and portrayed by Jeff Goldblum. Malcolm is a gifted mathematician who specializes in chaos theory. The character was inspired in part by American historian of science James Gleick and French mathematician Ivar Ekeland.https://study.com/academy/lesson/chaos-effect-in-jurassic-park.html In Crichton's 1990 novel Jurassic Park and its 1993 film adaptation, Malcolm is invited by insurance lawyer Donald Gennaro to notice any problems with John Hammond's dinosaur theme park, Jurassic Park. Malcolm was intended by Crichton to fill in the role of the audience in the scenarios he is put through. Malcolm is a secondary protagonist in the original novel and the main protagonist in the sequel, The Lost World, due to positive fan reception from Goldblum's performance as the character in director Steven Spielberg's film adaptation of the original novel.", "His role as Ian Malcolm in Jurassic Park skyrocketed Goldblum's career. Malcolm has become one of Goldblum's most popular characters and has been depicted in many forms of popular culture. The character's signature line, \"Life finds a way\", has become synonymous with Goldblum and the Jurassic Park franchise, and Malcolm has been recognized as the franchise's most enduring character.", "In Crichton's novel, Dr. Ian Malcolm, along with paleontologist Dr. Alan Grant and paleobotanist Dr. Ellie Sattler are hired as consultants by InGen CEO John Hammond to give their opinions on Jurassic Park, a theme park on the remote island of Isla Nublar that features genetically recreated dinosaurs. Malcolm is the most pessimistic about the idea of the park, and comments on many lapses of judgement throughout. During the tour of the park, disgruntled computer programmer Dennis Nedry shuts down power to the park to gain access to dinosaur embryos to sell to a rival. Nedry's actions cause the electrified fences to shut down as well, allowing the dinosaurs to escape from their paddocks. Malcolm is attacked by a Tyrannosaurus rex, which breaks his leg. Malcolm is found by employee Robert Muldoon and lawyer Donald Gennaro and taken back to one of the lodges to be looked after by park veterinarian Dr. Harding. Harding administers morphine to Malcolm, who spends the rest of the incident ranting about science and philosophy while attempting to assist the other survivors. His condition continues to worsen, and by the time the Costa Rica Air Force arrives to Isla Nublar, Malcolm is said to have died from his injuries.", "The film adaptation of Crichton's novel directed by Steven Spielberg features actor Jeff Goldblum in the role of Ian Malcolm. Unlike in the book, Malcolm is never declared dead in the film adaptation, but is severely injured by the Tyrannosaurus. In the film, Malcolm's injury comes from attempting to lure the T. rex away from the car carrying Tim and Lex Murphy, where as in the novel Malcolm's injury came out of cowardice (more akin to the death of Donald Gennaro in the film). This change was suggested by Goldblum. Goldblum reprised his role for the sequel, The Lost World: Jurassic Park, in Jurassic World: Fallen Kingdom in a minor role and alongside Sam Neill (Alan Grant) and Laura Dern (Ellie Sattler) in Jurassic World: Dominion. Some fans found the personality changes of Malcolm from the first movie to the character seen in The Lost World to be somewhat drastic, and some have speculated that the character suffers from PTSD post-traumatic stress disorder after his trip to Jurassic Park.", "Before Goldblum was cast, comedic actor Jim Carrey had auditioned for the role of Ian Malcolm. The film's casting director, Janet Hirschenson, believed that Goldblum was the perfect actor for the role, and spoke of Carrey's audition saying Carrey, \"was terrific, too, but I think pretty quickly we all loved the idea of Jeff.\" Actor Cameron Thor had initially auditioned for Malcolm, before landing the role of Dodgson. In the novel, Malcolm states that he only ever wears black so he does not have to put much thought towards what he wears. This is a characteristic shared with an earlier Jeff Goldblum character, Seth Brundle from The Fly. Malcolm's line, \"must go faster\", was reused by another Jeff Goldblum character, David Levinson in Independence Day.", "Jeff Goldblum's portrayal as Ian Malcolm was lauded by fans and critics. Malcolm is the most popular character in the franchise. Goldblum was nominated for a Saturn Award for Best Supporting Actor for his portrayal in Jurassic Park alongside Wayne Knight as Dennis Nedry, but both lost to Lance Henriksen in Hard Target. Goldblum was also nominated for a Blockbuster Entertainment Award for Favorite Actor - SciFi for his role in The Lost World: Jurassic Park.", "Goldblum's lack of screen time and over marketing in Jurassic World: Fallen Kingdom was criticized by fans of the franchise, who had felt like the marketing for the film relied too heavily on featuring Goldblum's return as Ian Malcolm, only for the actor to appear in only two short scenes at the start and very end of the film.", "Ian Malcolm has gone on to become one of Jeff Goldblum's most iconic and frequently referenced characters. Malcolm is the most appearing character so far in the series, and will still hold the record in Jurassic World: Dominion, becoming his fourth film in the series (not including a photographic appearance in Jurassic World). Malcolm has been referenced in different dinosaur studies, as well as his line, \"Life finds a way\". The quote has become synonymous with the Jurassic Park franchise as well as with Goldblum himself. The character also reinvigorated an interest in chaos theory, due to a scene where Malcolm flirts with Ellie Sattler while discussing it. A scene from the first film where Malcolm appears with his shirt open has been widely noted by Goldblum as the primary reason the character was established as a sex symbol, with the pose serving as the subject of many tattoos, Internet memes, a Funko toy figure, as well as receiving a statue in Potters Fields Park in London."]}, {"page": "Ian Zachary Malcolm", "response": ["#REDIRECT Ian Malcolm (politician)"]}]}}