{"wiki_id": "http://www.wikidata.org/entity/Q3147225", "itemLabel": "Ian Appleyard", "itemDescription": "Rally car driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Appleyard", "wikipedia_page": {"main": "Ernest Ian Appleyard (10 October 1923 – 2 June 1998) was a British rally driver, alpine skier and ornithologist. Driving a Jaguar XK120, he won the RAC Rally in 1951 and 1953, the Tulip Rally in 1951 and a Coupe d'Or at the Alpine Rally in 1952. In alpine skiing, he competed for Great Britain in the 1948 Winter Olympic Games. After retiring from sports, he became a leading author on the ring ouzel.", "link_mentions": [{"page": "Monte Carlo Rally", "response": ["| style=\"background:#f4f4f4\" | Ian Appleyard (GB)/ Pat Appleyard (GB)"]}, {"page": "Wales Rally GB", "response": ["|  Ian Appleyard Mrs. Pat Appleyard *", "|  Ian Appleyard Mrs. Pat Appleyard"]}, {"page": "Linton, West Yorkshire", "response": ["*Ian Appleyard (1923–1998), brother of Geoffrey, was a rally driver and ornithologist."]}, {"page": "William Lyons", "response": ["Lyons married Greta Brown in 1924. They had three children; Patricia (b. 1927), John Michael (b. 1930, d. 1955), and Mary (b. 1937). Patricia married Leeds Jaguar-distributor and rally driver Ian Appleyard, and was his co-driver in many international rallies from 1951 to '56, mostly in a XK120 registered NUB 120, including the Alpine Rally, which they won three times. There were no children. Patricia remarried in 1962 and has two children by her second husband Norbert Quinn; Michael Quinn, and Jane Quinn.  John Michael served briefly in REME, and then joined Jaguar as an apprentice but was killed in a road accident in France driving to the 1955 Le Mans 24-hours race. Mary married Guy Rimell (son of successful racehorse trainer Fred Rimell) and has three children; Katie, Tom and Mark. Sir William and Lady Lyons had an active and contented retirement with their beloved dogs, Sally, Peppie, Buttons."]}, {"page": "Jaguar XK120", "response": ["In 1950 Jaguar allocated six alloy-bodied XK120s to drivers Leslie Johnson, Peter Walker, Nick Haines, Clemente Biondetti, Ian Appleyard and Tommy Wisdom.", "*Alpine Rally: Ian Appleyard's XK120, road-registered as NUB 120, won the Alpine Rally with his wife Pat, who was the daughter of Sir William Lyons, navigating. They also won a coveted Coupe des Alpes."]}, {"page": "Appleyard", "response": ["* Ian Appleyard, British alpine skier, rally driver and ornithologist"]}, {"page": "Great Britain at the 1948 Winter Olympics", "response": ["|Ian Appleyard", "|Ian Appleyard"]}, {"page": "Jaguar Mark VII", "response": ["Factory-entered Mark VIIs won the Daily Express International Trophy Production Touring Car race at Silverstone five years running, and twice took the top three places. Stirling Moss won in 1952 and 1953; Ian Appleyard in 1954, with Tony Rolt and Stirling Moss 2nd and 3rd; Mike Hawthorn in 1955, from his teammates Jimmy Stewart and Desmond Titterington in 2nd and 3rd; and Ivor Bueb in 1956, with Belgian journalist and racing driver Paul Frère taking 4th."]}, {"page": "Alpine skiing at the 1948 Winter Olympics – Men's downhill", "response": ["|rowspan=2| 92 ||align=left|  Ian Appleyard ||align=left|  || 4:36.2 || +1:41.2"]}, {"page": "Tulip Rally", "response": ["|  Ian Appleyard"]}, {"page": "Alpine Rally", "response": ["The Coupe d'Argent was awarded to five drivers; Maurice Gatsonides (1956), driving for Jaguar and Triumph, René Trautmann of Citroën (1963), Donald Morley of Austin-Healey (1964), Paddy Hopkirk (1965), who drove for Triumph, Sunbeam and Mini-Cooper, and Jean Rolland of Alfa Romeo (1966). Only three drivers won the Coupe d'Or; Jaguar's Ian Appleyard (1952), Sunbeam-Talbot's Stirling Moss (1954) and Alpine's Jean Vinatier (1971)."]}, {"page": "Jean Vinatier", "response": ["Jean Vinatier (born 25 November 1933) is a French former rally and racing driver. He won the Tour de Corse with a Renault 8 Gordini in 1964 and the Alpine Rally with an Alpine-Renault A110 in 1968 and 1969. In the last Alpine Rally in 1971, he finished second to Bernard Darniche and recorded his third consecutive penalty-free run, becoming the third driver after Ian Appleyard and Stirling Moss to achieve the much-coveted Coupe d'Or (Gold Cup)."]}, {"page": "Silverstone race winners", "response": ["|  Ian Appleyard"]}, {"page": "List of European Rally Championship drivers", "response": ["|align=left|  Ian Appleyard"]}, {"page": "1949 Internationale Tulpenrallye", "response": ["|  Ian Appleyard "]}, {"page": "Pat Appleyard", "response": ["Patricia C. Quinn (née Lyons; b. 23 April 1927), best known by her former married name Pat Appleyard, is a British former rally driver and co-driver. She is the daughter of Jaguar Cars founder Sir William Lyons. Co-driving with her then-husband, Ian Appleyard, she won the Alpine Rally's Coupe des Alpes each year from 1950 to 1953, in one of her father's company's Jaguar XK120 cars. On the third of these triumphs, in 1952, the Appleyards were the first crew ever to be awarded the event's Coupe d'Or (Gold Cup), for having won three consecutive Coupes des Alpes. During their competitive career the couple's major event victories also included the 1951 and 1953 RAC Rallies and the 1951 Tulip Rally, and they were runners-up in the 1953 European Rally Championship. Her own driving career was less successful than her husband's, a fact that she herself partly put down to being unable to find suitably qualified female co-drivers, but nevertheless she won a number of ladies' trophies in British events."]}, {"page": "List of British alpine skiers", "response": ["* Ian Appleyard (10 October 1923 – 2 June 1998), competed at the 1948 Winter Olympics."]}]}}