{"wiki_id": "http://www.wikidata.org/entity/Q314504", "itemLabel": "James May", "itemDescription": "English television presenter and journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/James_May", "wikipedia_page": {"main": "James Daniel May (born 16 January 1963) is an English television presenter and journalist. He is best known as a co-presenter of the motoring programme Top Gear alongside Jeremy Clarkson  and Richard Hammond from 2003 until 2015. He also served as a director of the production company W. Chump & Sons, which has since ceased operating. He is a co-presenter of the television series The Grand Tour for Amazon Prime Video, alongside his former Top Gear colleagues, Clarkson and Hammond, as well as Top Gear's former producer Andy Wilman.\nMay has presented other programmes on themes including science and technology, toys, wine culture, and the plight of manliness in modern times. He wrote a weekly column for The Daily Telegraph's motoring section from 2003 to 2011.", "link_mentions": [{"page": "HM Prison Dartmoor", "response": ["*In the first episode of the second series of James May's Man Lab, James May and Oz Clarke were demonstrating map-reading skills by pretending to escape from Dartmoor prison and cross Dartmoor to their escape car (although they had to start their escape from outside the prison grounds as they were not allowed permission inside the prison)."]}, {"page": "English Channel", "response": ["| Jeremy Clarkson, Richard Hammond, James May (UK)"]}, {"page": "January 16", "response": ["*1963 – James May, British journalist/co-host of Top Gear"]}, {"page": "Nürburgring", "response": ["The TV Series Top Gear has also used the Nordschleife for its challenges, often involving Sabine Schmitz. In addition, during series 17 (summer 2011) of Top Gear, James May was very critical of the ride quality of cars whose development processes included testing on the Nordschleife, saying that cars which were tested at Nordschleife got ruined."]}, {"page": "1963", "response": ["* January 16 – James May, English motoring journalist and television show host"]}, {"page": "Alfa Romeo", "response": ["The BBC motoring show Top Gear repeatedly argued the significance of owning an Alfa Romeo car as a car enthusiast, stating that \"You can't be a true petrolhead if you have never owned/or wanted to own an Alfa Romeo\". Presenters Jeremy Clarkson, Richard Hammond and James May continuously praised Alfas for their beauty and driving characteristics even though Italian cars had a long-term bad reputation for unreliability. They argued that you (the owner) build a personal relationship with the car despite all of its mechanical faults. Both Clarkson and May have previously owned Alfas (a GTV6 for Clarkson and an Alfa 164 for May) and both have stated that they regretted selling their Alfas the most."]}, {"page": "Hybrid-propellant rocket", "response": ["In the February 18, 2007, episode of Top Gear, a Reliant Robin was used by Richard Hammond and James May in an attempt to modify a normal K-reg Robin into a reusable space shuttle. Steve Holland, a professional radio-controlled aircraft pilot, helped Hammond to work out how to land a Robin safely. The craft was built by senior members of the United Kingdom Rocketry Association (UKRA) and achieved a successful launch, flew for several seconds into the air and managed to successfully jettison the solid-fuel rocket boosters on time. This was the largest rocket launched by a non-government organisation in Europe. It used  motors by Contrail Rockets giving a maximum thrust of 8 tonnes.  However, the car failed to separate from the large external fuel tank due to faulty explosive bolts between the Robin and the external tank, and the Robin subsequently crashed into the ground and seemed to have exploded soon after. This explosion was added for dramatic effect as neither Reliant Robins nor hybrid rocket motors explode in the way depicted."]}, {"page": "Ortolan bunting", "response": ["*In The Grand Tour special \"Carnage A Trois\", James May is seen eating an ortolan with a napkin draped over his head."]}, {"page": "Richard Branson", "response": ["The cast of Top Gear, Jeremy Clarkson, James May and Richard Hammond, attempted to break this record in an amphibious vehicle which they had constructed and, while successfully crossing the channel, did not break Branson's record. After being intercepted by the Coast Guard and asked what their intentions were, Clarkson remarked \"...our intentions are to go across the Channel faster than 'Beardy' Branson!\". The Coast Guard wished them 'Good luck and Bon Voyage'."]}, {"page": "Comic Relief", "response": ["* James May (2007)"]}, {"page": "Beale Air Force Base", "response": ["* The base hosted James May for the specials James May on the Moon and James May at the Edge of Space, looking at the 40th anniversary of the Moon landing and highlighting the training necessary for flight at 70,000 ft. in the U-2."]}, {"page": "Humber", "response": [" He replicated this achievement on the television programme Top Gear (Series 10 Episode 6) when he beat James May who drove an Alfa Romeo 159 around the inland part of the estuary in a race without using the Humber Bridge."]}, {"page": "Dusty Springfield", "response": ["The beginning of 2017 brought another revival of interest in Springfield's music by the inclusion of the song \"The Windmills of Your Mind\" in Andy Wilman's The Grand Tour, featuring Jeremy Clarkson, James May, and Richard Hammond. The cut version can be heard in the fifth episode of the show."]}, {"page": "Meccano", "response": ["A large model, weighing approximately 500 kg and 23 m long, was built in September 2009 by TV presenter James May and a team of volunteers from the engineering department of the University of Liverpool, who created a Meccano bridge spanning the Leeds and Liverpool Canal in Liverpool. As with other models of this size and weight some non-Meccano parts were used. It was built from \"[about] 100,000 pieces of real Meccano\", taking 1,100 hours, and consisted of a 9-metre (29.5 ft) \"swing bridge\" section, and a 12-metre (39.4 ft) \"drawbridge\" section. See James May's Toy Stories. A contender for the largest model on record was built in 2014 by Graham Shepherd of Grahamstown, South Africa. The fully motorised Krupp 288 Bucket Wheel Excavator (as used on large opencast mining) is complete with auxiliary conveyors. Construction utilised Meccano parts as well as replica and strengthened parts (thickened profile plates and high tensile bolts in areas carrying large loads). Shepherd reports the model as being 1,335 kilograms (2,943 pounds) in mass and 17 ft tall. It required substantial timber support frames to facilitate final assembly.bagger288meccano.blogspot.com, 14 October 2014"]}, {"page": "National Motor Museum, Beaulieu", "response": ["The exhibit \"World of Top Gear\" has cars created by former Top Gear presenters Jeremy Clarkson, Richard Hammond and James May."]}, {"page": "Brooklands", "response": ["In November 2009, Brooklands was featured in an episode of a BBC TV series James May's Toy Stories.James May's Toy Stories#Episode list May undertook the task of recreating the original track using Scalextric.  The show featured May's attempt to lay the plastic track through and around the variety of obstacles that have replaced the original track, including a pond, a four-lane road, several houses, fences, and Sony and Procter & Gamble corporate campuses.", "In 2009, BBC Top Gear presenter James May announced plans to recreate the full length Brooklands using Scalextric track and cars. This was undertaken with a team of 350 volunteers building the track from an uncounted number of pieces of Scalextric track, navigating ponds and roads, closely following the route of the old Brooklands track. This event broke the Guinness World Record for the longest ever Scalextric track in the world, intended to measure the original  of the original Brooklands circuit but in reality recording  in length (due to the need to navigate modern features that block the original course). The episode was shown on BBC2 on 17 November 2009 as part of James May's Toy Stories."]}, {"page": "Caerleon", "response": ["* James May, television presenter"]}, {"page": "1963 in television", "response": ["| James May"]}, {"page": "Steve Redgrave", "response": ["He starred in Top Ground Gear Force for Sport Relief in 2008, where the Top Gear Team (Jeremy Clarkson, James May and Richard Hammond) took on Ground Force with predictable results, and trashed his garden."]}, {"page": "Gerald Scarfe", "response": ["In 2003 Scarfe collaborated with the National Portrait Gallery and BBC Four to make caricatures of a number of famous Britons, to depict (along with guest commentary) their heroic and villainous attributes.  Amongst the over 30 portraits he depicted included caricatures of Henry VIII, Winston Churchill, Queen Elizabeth I, Pete Best, Richard Branson, Adam Smith, William Blake, The Beatles, Agatha Christie and Diana, Princess of Wales. In 2009, he also created a caricature of James May out of Lego which was shown in episode 5 of James May's Toy Stories.  Scarfe and Jane Asher also appeared in the episode. "]}, {"page": "Acrostic", "response": ["James May, presenter on the BBC program Top Gear, was fired from the publication Autocar for spelling out a message using the large red initial at the beginning of each review in the publication's Road Test Yearbook Issue for 1992.  Properly punctuated, the message reads: \"So you think it's really good, yeah? You should try making the bloody thing up; it's a real pain in the arse.\""]}, {"page": "Chelsea Flower Show", "response": ["*2009 James May's Paradise in Plasticine, a garden made entirely of Plasticine. Its concept and creation was documented for James May's Toy Stories."]}, {"page": "Top of the Pops", "response": ["The show was given a one-off revival (of sorts) for Comic Relief 2007 in the form of Top Gear of the Pops, presented by Jeremy Clarkson, Richard Hammond and James May. It was filmed at the Top Gear aerodrome studio in Surrey on Sunday, 11 March 2007, although it bore little resemblance to the usual Top of the Pops format."]}, {"page": "Battle of Britain (film)", "response": ["* A running joke in James May's YouTube cooking show on the FoodTribe channel involves May (or others) quoting the film, particularly the lines \"plenty of it\" (usually also referring to a food item) and \"flood the cowling\".Archived at Ghostarchive and the Wayback Machine: "]}, {"page": "Jeremy Clarkson", "response": ["Jeremy Charles Robert Clarkson (born 11 April 1960) is an English broadcaster, journalist, farmer, game show host and writer who specialises in motoring. He is best known for the motoring programmes Top Gear and The Grand Tour alongside Richard Hammond and James May. He also currently writes weekly columns for The Sunday Times and The Sun. Since 2018, Clarkson has hosted the revived ITV game show Who Wants to Be a Millionaire?, replacing former host Chris Tarrant.", "Clarkson then also presented the show's new format from 20 October 2002 to 8 March 2015. Along with co-presenters James May and Richard Hammond, he is credited with turning Top Gear into the most-watched TV show on BBC Two, rebroadcast to over 100 countries around the world.", "Clarkson received a BAFTA nomination for Best Entertainment Performance in 2006. Jonathan Ross ended up winning the award. He won the National Television Awards Special Recognition Award in 2007, and reportedly earned £1 million that same year for his role as a Top Gear presenter, and a further £1.7 million from books, DVDs and newspaper columns.Pay us the same as Clarkson – or we quit! The Independent (London), 5 July 2008 Clarkson and co-presenter James May were the first people to reach the North Magnetic Pole in a car also in 2007, chronicled in Top Gear: Polar Special.", "On 30 July 2015, it was announced that Clarkson, along with former Top Gear hosts Richard Hammond and James May would present a new show on Amazon Prime Video. The first season was made available worldwide in 2016. On 11 May 2016, Clarkson confirmed on his Twitter feed that the series would be titled The Grand Tour, and air from a different location each week.", "* Mercedes-Benz 600 Grosser LWB (featured in Top Gear Series 11 Episode 5, compared against James May's Rolls Royce Corniche)", "In 2004, the BBC apologised unreservedly and paid £250 in compensation to a Somerset parish council, after Clarkson damaged a 30-year-old horse-chestnut tree by driving into it to test the strength of a Toyota Hilux.BBC News – BBC stumps up for tree stunt, 21 February 2004 In December 2006, the BBC complaints department upheld the complaint of four Top Gear viewers that Clarkson had used the phrase \"ginger beer\" (rhyming slang for \"queer\") in a derogatory manner, when Clarkson picked up on and agreed with an audience member's description of the Daihatsu Copen as being a bit \"gay\". The Top Gear: Polar Special was criticised by the BBC Trust for glamorising drunk driving in a scene showing Clarkson and James May in a vehicle, despite Clarkson saying to the camera, \"And please do not write to us about drinking and driving, because I am not driving I am sailing\" (as they were on top of international, frozen waters).BBC News Top Gear rapped for alcohol use, 2 July 2008 They stated the scene \"was not editorially justified\" despite occurring outside the jurisdiction of any drunk-driving laws.", "In an episode aired after the watershed on 1 August 2010, Clarkson described a Ferrari F430 as \"special needs\". He said the car owned by co-presenter James May looked \"like a simpleton\". Media regulator Ofcom investigated after receiving two complaints, and found that the comments \"were capable of causing offence\" but did not censure the BBC.", "|align=\"left\"|  Ben Collins James May Richard Hammond"]}, {"page": "Chris Evans (presenter)", "response": ["On 16 June 2015, the BBC announced that Evans had signed a three-year deal to be the main presenter on the BBC Two motoring show Top Gear, following the departure of Jeremy Clarkson, Richard Hammond, and James May.", "On his radio show the next morning he confirmed his acceptance and explained the offer came after James May and Richard Hammond had confirmed to the BBC they would not be returning to the show. Before the announcement, he sent texts to May, Hammond and Clarkson and received supportive replies from all three."]}, {"page": "A303 road", "response": ["Prior to the broadcast of Series 15 of Top Gear in 2010, the cast of Jeremy Clarkson, Richard Hammond and James May were spotted and recorded driving along the A303 in what appeared to be house cars. The video was recorded and put on YouTube."]}, {"page": "Oracle Team USA", "response": ["The team also appeared on the Series 20 premiere of Top Gear, emerging victorious in what was called by some a Cat Vs. Car race. Set in New Zealand, it matched Oracle in its AC45 with James May as a passenger against Jeremy Clarkson in a rented Toyota Corolla or Toyota Auris from the northern tip of the Coromandel Peninsula to the northern tip of New Zealand's North Island."]}, {"page": "Jackie Stewart", "response": ["Stewart also featured in a special presentation video of the then all new Ford Mondeo in 1993, the video was given away free on the front cover of What Car? magazine in 1993. He was featured in the video to the 2000 song \"Supreme\" by British singer, Robbie Williams. Stewart appeared in several UPS commercials in 2002 and 2003 as a consultant for Dale Jarrett to convince Jarrett to \"race the Big Brown truck\". He also once appeared on the UK motoring program Top Gear as a driving instructor for host James May."]}, {"page": "Lingotto", "response": ["The building and test track was featured on the first episode of James May's Cars of the People."]}, {"page": "Morris Marina", "response": ["Top Gear vilifies the Morris Marina; a running gag throughout the series involved dropping a piano on a Marina every time the car is featured, generating angry reactions by Morris Marina lovers, dubbed \"Morris Extremists\" whose letters would be read out and mocked in subsequent episodes. In the Top Gear book Crap Cars by Richard Porter, the Marina was named fourth worst car of all time. However, presenter James May stated that at least one Marina should be preserved, as a warning to future generations."]}, {"page": "Saab 9000", "response": ["In 1993, Saab experimented with steer-by-wire technology as part of the pan-European programme \"Prometheus\" (Programme for European Traffic with Highest Efficiency and Unprecedented Safety). Their contribution to the programme consisted of a modified 9000 with the steering wheel replaced with a center-mounted joystick. This setup removed the risk of body and facial injury in the event of an accident. It also provided easier and cheaper airbag installation, as well as improved instrument panel visibility. This prototype was tested by Jeremy Clarkson in an episode of Top Gear; the segment was revisited in Series 18, Episode 5 of the current Top Gear series, where Clarkson and James May paid tribute to the fallen automotive marque.", "Also, motoring presenter James May created a stretch limousine from a Saab 9000 and its Alfa Romeo 164 relative, as part of a challenge for an episode of BBC's Top Gear."]}, {"page": "Lancaster University", "response": ["* James May, Music (1985, Pendle) – Television presenter"]}, {"page": "Tiff Needell", "response": ["Needell is a television presenter and motoring journalist and co-hosted the BBC TV series Top Gear starting in 1987.Tiff Needell profile – Dave television channel In 2001, when the BBC cancelled Top Gear (the show was brought back in 2002), Needell and the whole cast defected and signed with Channel 5 to produce and host a new motoring show named Fifth Gear. Needell has also co-presented 'MPH' at Earls Court in 2003, 2004 and 2005 with Jeremy Clarkson and Richard Hammond and in 2006 with Clarkson and James May (because Hammond was recovering from an on-location accident in a rocket car which rolled over at top speed, leaving him in a coma). He also appeared very briefly in the 2005 Top Gear Comic Relief special, \"Stars in Fast Cars\". In 2009 he appeared on James May's Toy Stories featuring the building of a Scalextric around Brooklands, and also visited James' LEGO house. In 2011, he appeared on Top Gear, driving the Ariel Atom V8 in a race against a BMW S1000RR around the Top Gear Test Track. The segment was done in humour, with May supposedly driving the Atom V8, only for it to actually be Needell."]}, {"page": "Ford Scorpio", "response": ["Described as a 'gopping hideous monstrosity', Jeremy Clarkson wrote in The Times at the time that this car had \"village idiot features\" and a \"loopy face\". He elaborated later on that the Scorpio ended any argument as to which car was the ugliest on the road, that the car \" an extra from Finding Nemo\", and that it had 'a face of such unparalleled awfulness' and would 'make... children cry'. Richard Hammond and James May described it as 'gopping', while May additionally described it as 'not Ford's finest styling', and in Richard Porter's 2004 book Crap Cars the Scorpio Mark II was listed as number 49 (of 50) on looks alone."]}, {"page": "Richard Hammond", "response": ["Richard Mark Hammond (born 19 December 1969) is an English journalist, television presenter, mechanic, and writer. He is best known for co-hosting the BBC Two car programme Top Gear from 2002 until 2015 with Jeremy Clarkson and James May. In 2016, Hammond began presenting The Grand Tour television series. The show is co-presented with his former Top Gear co-hosts, Jeremy Clarkson and James May.", "Following a high-speed dragster crash while filming in September 2006 near York, Hammond returned in the first episode of series 9 (broadcast on 28 January 2007) to a hero's welcome, complete with dancing girls, aeroplane-style stairs and fireworks. The show also contained images of the crash, which had made international headlines, with Hammond talking through the events of the day after which the audience broke into spontaneous applause. Hammond then requested that the crash never be mentioned on the show again, though all three Top Gear presenters have since referred to it in jokes during the news segment of the programme. He told his colleagues, \"The only difference between me now, and before the crash, is that I like celery now and I didn't before\".thumb|Hammond with James May and Jeremy Clarkson at Top Gear Live Italia in 2014Following the BBC's decision not to renew Clarkson's contract with the show on 25 March 2015, Hammond's contract expired on 31 March. In April he ruled out the possibility of continuing to present Top Gear, commenting via Twitter that \"amidst all this talk of us 'quitting' or not: there's nothing for me to 'quit' not about to quit my mates anyway\". On 12 June 2015 the BBC confirmed that Top Gear would return with a 75-minute special, combining two unseen challenges featuring all three presenters from series 22, with studio links from Hammond and May. It aired in the UK on BBC Two on 28 June at 8 p.m, and in the United States on BBC America on 13 July at 9 p.m.", "Hammond was completing a seventh and final run to collect extra footage for the programme when his front-right tyre failed, and, according to witness and paramedic Dave Ogden, \"one of the parachutes had deployed but it went on to the grass and spun over and over before coming to a rest about 100 yards from us.\" The emergency crew quickly arrived at the car, finding it inverted and partially embedded in the grass. During the roll, Hammond's helmet had embedded itself into the ground, flipping the visor up and forcing soil into his mouth and damaging his left eye. Rescuers felt a pulse and heard the unconscious Hammond breathing before the car was turned upright. Hammond was cut free with hydraulic shears, and placed on a backboard. \"He was regaining consciousness at that point and said he had some lower back pain\". He was then transported by the Yorkshire Air Ambulance to the neurological unit of the Leeds General Infirmary. Hammond's family visited him at the hospital along with Top Gear co-presenters James May and Jeremy Clarkson. Clarkson wished Hammond well, saying \"Both James and I are looking forward to getting our 'Hamster' back\", referring to Hammond by his nickname. For five weeks while Hammond was recovering in hospital, Clarkson sent a funny message to Mindy, Hammond's wife, every day to try to keep her going. Hammond thought if everyone found out, Clarkson would \"die of shame\" \"cos it makes him look soppy\".", "During the season finale of The Grand Tour season three, Hammond, James May and Jeremy Clarkson announced the current format was coming to the end and later announced that there would be two more seasons of specials, without the tent or live audience.", "Jeremy Clarkson and James May, fellow presenters on The Grand Tour both witnessed the scene from afar, and, believing Hammond was dead, May recalled feeling a \"blossoming, white-hot ball of pure, sickening horror forming in my heart\" with Clarkson describing his \"knees turning to jelly\" at the sight of the crash.", "*1981 BMW R100RT, which Hammond bought \"when some friends, including James May, started a thing called the Crap Motorcycle Camping Club of GB. [...] It's called Eric, after the previous owner and it's done 105,000 miles\".", "| style=\"text-align:left;\" |Best Presenter (shared with Jeremy Clarkson and James May)", "|align=\"left\"|  Jeremy Clarkson Ben Collins James May"]}, {"page": "David Cameron", "response": ["Cameron made a cameo appearance in the BBC television programme Top Gear's India Special, where he tells the trio of Jeremy Clarkson, James May, and Richard Hammond to \"stay away from India\" after initially denying the group's request to improve economic relations with India in a letter and suggested that they mend fences with Mexico. Cameron later stated through his aides that he did not like the special that he cameoed in, and that he had the \"utmost respect\" for the people of India."]}, {"page": "Conkers", "response": ["In 2000 a survey of British schools by Keele University showed that many were not allowing children to play conkers, as head teachers were afraid of the legal consequences if children were injured while playing the game, or because they thought that the conkers might be used as weapons. The TV programme Top Gear later staged a game of conkers using caravans suspended from cranes. After putting on safety goggles, presenter James May commented \"I now feel perfectly happy about being hit in the face by a caravan.\" Top Gear, along with other media commentators, wrongly stated that the wearing of goggles during the game was due to an official Health and Safety Executive (HSE) edict when it was in fact due to a myth which started when a headmaster bought goggles for children to use as a parody of health and safety regulation and sponsored a Conkers tournament."]}, {"page": "Plasticine", "response": ["thumb|A life-size vegetable plot in James May's Paradise in Plasticine", "Television presenter James May together with Chris Collins, Jane McAdam Freud, Julian Fullalove and around 2000 members of the public created a show garden made entirely of Plasticine for the 2009 Chelsea Flower Show. Called 'Paradise in Plasticine', it took 6 weeks and 2.6 tons of Plasticine in 24 colours to complete. May said, \"This is, to our knowledge, the largest and most complex model of this type ever created.\" It couldn't be considered as part of the standard judging criteria as it contained no real plants, but was awarded an honorary gold award made from Plasticine. The garden was extremely popular with the public and went on to win the Royal Horticultural Society's 'peoples choice' for best small garden."]}, {"page": "Hybrid (British band)", "response": ["* The music of Hybrid has been featured several times in the motoring TV show Top Gear. \"Finished Symphony\" was used when Jeremy Clarkson, in a Bugatti Veyron, raced James May and Richard Hammond, in a light aircraft, across Europe (season 7, episode 5), whilst \"Formula of Fear\" was featured in season 14, in the Maserati/Porsche/Aston Martin segment. \"Mr. Smith\" (aka \"Ultimatum\") was used in the fourth episode of season 5 and in the first episode of season 7, when Clarkson reviews the Aston Martin V8 Vantage on the Isle of Man, and in the tenth episode of season 6, \"Know Your Enemy\" was played in the BMW 5 Series Diesel vs. Petrol review. \"Sea Chase\" was used in the first episode of season 20, in which Jeremy (in a Toyota Corolla) and James (on an America's Cup yacht) conduct a race in New Zealand. \"Just for Today\" was used in the Porsche Boxster S review in season 8, episode 4."]}, {"page": "List of Have I Got News for You episodes", "response": ["|James May", "|James May"]}, {"page": "Jason Dawe (presenter)", "response": ["Initially, Jeremy Clarkson wanted James May to present the rebooted series of Top Gear; however, May declined, with Dawe later agreeing to present the first series alongside Clarkson and Richard Hammond.  "]}, {"page": "Ford Fiesta", "response": ["* Fiesta ECOnetic named 'Least boring green car' of 2009 by Top Gear's James May."]}]}}