{"wiki_id": "http://www.wikidata.org/entity/Q3148089", "itemLabel": "Iffy Onuora", "itemDescription": "Scottish footballer and manager (born 1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Iffy_Onuora", "wikipedia_page": {"main": "Ifem \"Iffy\" Onuora (born 28 July 1967) is a Scottish former professional footballer, manager, and coach for the England U21 national team. He is also the current equalities coach for the Professional Footballers Association.\nAs a player, he was a forward from 1988 until 2004. He notably had spells with Huddersfield Town, Swindon Town and Gillingham and spent his entire career playing in England. He also played in the Football League for Mansfield Town, Sheffield United, Wycombe Wanderers, Grimsby Town, Tranmere Rovers and Walsall. Having moved into coaching with the latter, he moved back to former clubs Swindon and Gillingham before briefly taking over as caretaker manager of Lincoln City before his move to Ethiopia. He now acts as a Match Delegate for referees in the Premier League. Between 2010 and 2011 Onuora coached the Ethiopian national football team.", "link_mentions": [{"page": "Swindon Town F.C.", "response": ["In 2006, caretaker manager (and former player) Iffy Onuora was unable to save Swindon from relegation to League Two meaning they became the first ever former Premier League team to be relegated to the lowest Football League division.", "* Iffy Onuora 2005–2006"]}, {"page": "University of Bradford", "response": ["* Iffy Onuora – former footballer"]}, {"page": "Ron Atkinson", "response": ["It was reported Atkinson was being brought in to support Iffy Onuora at Swindon Town in December 2005, and Atkinson and the club appeared to confirm this. It later transpired that Atkinson's role was as part of a Sky One documentary about the club being filmed at the County Ground. In late January 2006, Atkinson and Swindon Town parted company, with Swindon manager Onuora citing interference as the main reason for stopping the documentary from going ahead. Just a week later the cameras turned up at Peterborough United's ground, London Road, to begin filming for the documentary called Big Ron Manager. Peterborough were paid £100,000 to allow the filming to take place."]}, {"page": "Ethiopia national football team", "response": ["In April 2011, the Ethiopian Football Federation fired national coach Iffy Onuora – just 9 months after he took charge of the Ethiopian national football team. Ethiopian Football Federation cited disciplinary grounds for his dismissal just a month after the team's 4–0 defeat at the hands of the Nigerian Green Eagles in Group B of the 2012 Africa Cup of Nations qualification in Abuja. The Ethiopian national team had played 11 matches during coach Onuora's tenure, winning 4, drawing in 1 and losing 6 matches. The team scored 12 goals and conceded 21 goals in those matches.", "In May 2011, the EFF appointed former Zimbabwe and Namibia manager Tom Saintfiet as coach in place of Iffy Onuora. However, Tom Saintfiet left his job as Ethiopia's national soccer coach after just five months, citing \"broken promises\" as the reason for his departure. Saintfiet had been in charge for three 2012 African Cup of Nations qualification matches, including a 2–2 draw with Nigeria that contributed to the Super Eagles missing out on 2012 Africa Cup of Nations.", "*  Iffy Onuora (July 2010 – April 2011)"]}, {"page": "Tom Heaton", "response": ["Heaton's form for the reserves resulted in him being loaned out to Swindon Town at the start of the 2005–06, initially until 1 January 2006. Heaton made his professional debut in a League Cup tie against Wycombe Wanderers, and in his second appearance against Yeovil Town in the league he saved a penalty from Lee Johnson. During his time at Swindon, he played over 20 matches, and was described as \"one for the future\" by manager Iffy Onuora. He returned to Manchester United, but, after the recall of Ritchie Jones from Royal Antwerp, Heaton was sent there for the rest of the season after United rebuffed an approach from Huddersfield Town."]}, {"page": "Christian Roberts", "response": ["His second season would prove to be less successful. In January 2006, it was announced that Roberts had been admitted to the Sporting Chance clinic, suffering from alcohol dependence. He made 21 appearances in the league that season, scoring 3 goals – but only started four games, as opposed to the seventeen of the previous season. The 2006/07 season started much more brightly, with Roberts winning the League Two Player of the Month award for August, for which he thanked former Swindon manager Iffy Onuora for keeping faith in him. Following Paul Sturrock's decision to convert Roberts into a striker, he had his most successful Swindon season, scoring 13 goals in all competitions, and signing a new two-year contract. This season would prove to be less successful, with Roberts suffering a knee injury that required surgery early in the season, Although recovering from the injury and returning to the team, scoring his fifth league goal of the season in January 2008 against Luton (a goal which took Swindon's unbeaten run to ten games), he was once again forced out with a knee injury in March. He finished the season having played 27 league games, with five goals."]}, {"page": "Peter Jackson (footballer, born 1961)", "response": ["On 30 October 2007, he was appointed as manager of League Two side Lincoln City who were bottom of the Football League. His first game in charge ended in a 1–0 home defeat to former club Chester City three days later, when he had a disagreement with the referee at the final whistle resulting in a touchline ban. In February 2008, he was diagnosed with throat cancer and announced that his treatment would commence in March. Lincoln won five of their six games in February to lift them clear of the relegation places and Jackson was named the League Two manager of the month. He was presented with his award in his final game before beginning treatment, when his side defeated Wycombe Wanderers 1–0 to lift them up to 14th in the table. In his absence, Lincoln were managed by Jackson's assistant Iffy Onuora, with assistance from Youth Team Coach Grant Brown. In June 2008, Jackson's doctors told him the treatment had been a success, but he will need regular check-ups until 2013, to ensure he does not relapse."]}, {"page": "Lee Peacock", "response": ["Having settled his contract at Sheffield Wednesday in January 2006, Swindon Town manager Iffy Onuora persuaded Peacock to sign a two-and-a-half-year deal at Swindon in January 2006, after he had turned down a strong approach from Walsall as he wanted to move south for family reasons. Peacock made his debut as a goalscoring substitute – coming on with fifteen minutes to go in a home match with AFC Bournemouth on 21 January, he scored a last minute goal that wrapped the game up for the Town at 4–2. Despite only scoring one more goal during the rest of the campaign, his honest, hard-working attitude made him a firm favourite with the Town fans almost immediately. Despite a knee injury picked up at Colchester United in mid-March, he attempted to play through the pain barrier – until hobbling off just before half-time in a match against Swansea City on 11 April. By now, it was obvious that Peacock needed surgery, but he decided to take a role described by Onuora as \"super sub\" – making two further cameo appearances in the following two matches. When the Town's relegation to League Two was confirmed, Peacock was rested before going under the knife during the close season. Peacock went under the knife at the end of Swindon relegation season but returned successfully and was the Town's top goalscorer by October, before being switched to a midfield role. On 24 April 2007, Peacock was named the PFA's Fans' Player of the Year in League Two. On 31 January 2008, he signed a new one-and-a-half-year deal."]}, {"page": "Sacred Heart Catholic College", "response": ["*Iffy Onuora, professional football player"]}]}}