{"wiki_id": "http://www.wikidata.org/entity/Q314787", "itemLabel": "Tariq Ali", "itemDescription": "British political activist, writer, and historian (born 1943)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tariq_Ali", "wikipedia_page": {"main": "Tariq Ali (; born 21 October 1943) is a British political activist, writer, journalist, historian, filmmaker, and public intellectual. He is a member of the editorial committee of the New Left Review and Sin Permiso, and contributes to The Guardian, CounterPunch, and the London Review of Books. He read Philosophy, Politics, and Economics at Exeter College, Oxford.\nHe is the author of many books, including Pakistan: Military Rule or People's Power (1970), Can Pakistan Survive? The Death of a State (1983), Clash of Fundamentalisms: Crusades, Jihads and Modernity (2002), Bush in Babylon (2003), Conversations with Edward Said (2005), Pirates of the Caribbean: Axis Of Hope (2006), A Banker for All Seasons (2007), The Duel (2008), The Obama Syndrome (2010), and The Extreme Centre: A Warning (2015).\n\n", "link_mentions": [{"page": "John Lennon", "response": ["In January 1971, Tariq Ali expressed his revolutionary political views when he interviewed Lennon, who immediately responded by writing \"Power to the People\". In his lyrics to the song, Lennon reversed the non-confrontational approach he had espoused in \"Revolution\", although he later disowned \"Power to the People\", saying that it was borne out of guilt and a desire for approval from radicals such as Ali. Lennon became involved with Ali in a protest against the prosecution of Oz magazine for alleged obscenity. Lennon denounced the proceedings as \"disgusting fascism\", and he and Ono (as Elastic Oz Band) released the single \"God Save Us/Do the Oz\" and joined marches in support of the magazine.", "According to FBI surveillance reports, and confirmed by Tariq Ali in 2006, Lennon was sympathetic to the International Marxist Group, a Trotskyist group formed in Britain in 1968. However, the FBI considered Lennon to have limited effectiveness as a revolutionary, as he was \"constantly under the influence of narcotics\"."]}, {"page": "October 21", "response": ["*1943 – Tariq Ali, Pakistani historian and author"]}, {"page": "Pakistan Armed Forces", "response": ["Navy Day is celebrated on 8 September to commemorate its service in the Indo-Pakistani War of 1965. According to author Tariq Ali, the navy lost one-half of its force in the Indo-Pakistani War of 1971. The Navy heavily depended on American-built naval technology and operated a large infrastructure from 1947 to 1971. The Pressler amendment forced an embargo in the 1990s, during which the navy developed air independent propulsion (AIP) technology purchased from France and built the Agosta-class submarines; two of these (as well as one of the new frigates) were built at Pakistan's facilities in Karachi. The navy's surface fleet consists of helicopter carriers, destroyers, frigates, amphibious assault ships, patrol ships, mine-countermeasures, and miscellaneous vessels. Established in 1972, the Naval Air Arm provides fleet air defence, maritime reconnaissance, and anti-submarine warfare capability. Mirage 5 aircraft donated by the PAF are flown by the Navy, equipped with Exocet anti-ship missiles. The Navy's fleet of P-3C Orion turboprop aircraft, equipped with electronic intelligence (ELINT) systems, play a pivotal role in the Navy's gathering of intelligence. Since 2001, the navy has emphasised its role and expanded its operational scope across the country with the establishment of Naval Strategic Forces Command, based in Islamabad."]}, {"page": "Protest song", "response": ["As their fame and prestige increased in the late 1960s, The Beatles—and John Lennon in particular—added their voices to the Anti-war. In the documentary The US Versus John Lennon, Tariq Ali attributes the Beatles' activism to the fact that, in his opinion, \"The whole culture had been radicalized: [Lennon] was engaged with the world, and the world was changing him.\" \"Revolution\", 1968, commemorated the worldwide student uprisings. In 1969, when Lennon and Yoko Ono were married, they staged a week-long \"bed-in for peace\" in the Amsterdam Hilton, attracting worldwide media coverage. At the second \"Bed-in\" in Montreal, in June 1969, they recorded \"Give Peace a Chance\" in their hotel room. The song was sung by over half a million demonstrators in Washington, DC, at the second Vietnam Moratorium Day, on October 15, 1969. In 1972 Lennon's most controversial protest song LP was released, Some Time in New York City, the title of whose lead single \"Woman Is the Nigger of the World\", a phrase coined by Ono in the late 1960s to protest sexism, set off a storm of controversy, and in consequence received little airplay and much banning. The Lennons went to great lengths (including a press conference attended by staff from Jet and Ebony magazines) to explain that they had used the word nigger in a symbolic sense and not as an affront to African Americans. The album also included \"Attica State\", about the Attica Prison riots of September 9, 1971; \"Sunday Bloody Sunday\" and \"The Luck Of The Irish\", about the massacre of demonstrators in Northern Ireland and \"Angela\", in support of black activist Angela Davis. Lennon also performed at the \"Free John Sinclair\" benefit concert in Ann Arbor, Michigan, on December 10, 1971. on behalf of the imprisoned antiwar activist and poet who was serving 10 years in state prison for selling two joints of marijuana to an undercover cop. On this occasion Lennon and Ono appeared on stage with among others singers Phil Ochs and Stevie Wonder, plus antiwar activists Jerry Rubin and Bobby Seale of the Black Panthers party. Lennon's song \"John Sinclair\" (which can be heard on his Some Time in New York City album), calls on the authorities to \"Let him be, set him free, let him be like you and me\". The benefit was attended by some 20,000 people, and three days later the State of Michigan released Sinclair from prison."]}, {"page": "Salman Rushdie", "response": ["Rushdie supported the 1999 NATO bombing of the Federal Republic of Yugoslavia, leading the leftist Tariq Ali to label Rushdie and other \"warrior writers\" as \"the belligerati.\"Mandel, Michael. 2004. How America Gets Away With Murder. Pluto Press. p. 60. He was supportive of the US-led campaign to remove the Taliban in Afghanistan, which began in 2001, but was a vocal critic of the 2003 war in Iraq. He has stated that while there was a \"case to be made for the removal of Saddam Hussein,\" US unilateral military intervention was unjustifiable. Marxist critic Terry Eagleton, a former admirer of Rushdie's work, attacked him, saying he \"cheered on the Pentagon's criminal ventures in Iraq and Afghanistan.\" Eagleton subsequently apologised for having misrepresented Rushdie's views."]}, {"page": "The Angry Brigade", "response": ["In mid-1968 demonstrations took place in London, centred on the US embassy in Grosvenor Square, against US involvement in the Vietnam War. One of the organisers of these demonstrations, Tariq Ali, has said he recalls an approach by someone representing the Angry Brigade who wished to bomb the embassy; he told them it was a terrible idea and no bombing took place."]}, {"page": "Zionism", "response": ["Isaac Deutscher has called Israelis the 'Prussians of the Middle East', who have achieved a 'totsieg', a 'victorious rush into the grave' as a result of dispossessing 1.5 million Palestinians. Israel had become the 'last remaining colonial power' of the twentieth century.Tariq Ali, The Clash of Fundamentalisms: Crusades, Jihad and Modernity, Verso, 2003, p 124", "On the other hand, anti-Zionist writers such as Noam Chomsky, Norman Finkelstein, Michael Marder, and Tariq Ali have argued that the characterization of anti-Zionism as antisemitic is inaccurate, that it sometimes obscures legitimate criticism of Israel's policies and actions, and that it is sometimes used as a political ploy in order to stifle legitimate criticism of Israel."]}, {"page": "List of political theorists", "response": ["* Tariq Ali"]}, {"page": "José Saramago", "response": ["During the 2006 Lebanon War, Saramago joined Tariq Ali, John Berger, Noam Chomsky, and others in condemning what they characterized as \"a long-term military, economic and geographic practice whose political aim is nothing less than the liquidation of the Palestinian nation\"."]}, {"page": "List of novelists by nationality", "response": ["*Tariq Ali (born 1943)"]}, {"page": "Roger II of Sicily", "response": ["Roger is the subject of King Roger, a 1926 opera by Polish composer Karol Szymanowski. The last months of his life are also featured in Tariq Ali's book A Sultan in Palermo. Studiorum Universitas Ruggero II, a private non-traditional university connected to Accademia Normanna was incorporated in the U.S. on April 30, 2001 in his honor."]}, {"page": "Hamid Karzai", "response": ["In 2004, he rejected an international proposal to end poppy production in Afghanistan through aerial spraying of chemical herbicides, fearing that it would harm the economic situation of his countrymen. Moreover, Karzai's younger brother, Ahmed Wali Karzai – who partially helped finance Karzai's presidential campaign – was rumored to be involved in narcotic deals. James Risen of The New York Times and othersTariq Ali, New Left Review 50, March–April 2008. \"Mirage of the Good War\" stated that Ahmed Wali Karzai may have been involved in the Afghan opium and heroin trade. This was denied by Karzai, who called the charges political propaganda and stated he was a \"victim of vicious politics.\""]}]}}