{"wiki_id": "http://www.wikidata.org/entity/Q314773", "itemLabel": "Lord Randolph Churchill", "itemDescription": "British politician, father of Winston Churchill (1849-1895)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lord_Randolph_Churchill", "wikipedia_page": {"main": "Lord Randolph Henry Spencer-Churchill (13 February 1849 – 24 January 1895) was a British statesman. Churchill was a Tory radical and coined the term 'Tory democracy'. He inspired a generation of party managers, created the National Union of the Conservative Party, and broke new ground in modern budgetary presentations, attracting admiration and criticism from across the political spectrum. His most acerbic critics were in his own party, among his closest friends; but his disloyalty to Lord Salisbury was the beginning of the end of what should have been a glittering career.  His elder son was Winston Churchill, who wrote a biography of him in 1906.", "link_mentions": [{"page": "Benjamin Disraeli", "response": ["In the years after Disraeli's death, as Salisbury began his reign of more than twenty years over the Conservatives, the party emphasised the late leader's \"One Nation\" views, that the Conservatives at root shared the beliefs of the working classes, with the Liberals the party of the urban élite. Disraeli had, for example, stressed the need to improve the lot of the urban labourer. The memory of Disraeli was used by the Conservatives to appeal to the working classes, with whom he was said to have had a rapport.Blake (1967), pp. 523–524 This aspect of his policies has been re-evaluated by historians in the 20th and 21st centuries. In 1972 BHAbbott stressed that it was not Disraeli but Lord Randolph Churchill who invented the term \"Tory democracy\", though it was Disraeli who made it an essential part of Conservative policy and philosophy.Abbott, pp. 17–18 In 2007 Parry wrote, \"The tory democrat myth did not survive detailed scrutiny by professional historical writing of the 1960s [which] demonstrated that Disraeli had very little interest in a programme of social legislation and was very flexible in handling parliamentary reform in 1867.\"Parry, p. 122 Despite this, Parry sees Disraeli, rather than Peel, as the founder of the modern Conservative party.Parry, p. 123 The Conservative politician and writer Douglas Hurd wrote in 2013, \"[Disraeli] was not a one-nation Conservative—and this was not simply because he never used the phrase. He rejected the concept in its entirety.\"Hurd, Douglas and Edward Young. \"Disraeli discussed by Douglas Hurd and Edward Young\", The Daily Telegraph, 27 June 2013", "File:Disraell's-ghost-lord-randolph-churchill.jpg|alt=Randolph Churchill stands with a look of pride; behind him a tall, ghostly Disraeli stands, also looking proud|Disraeli's ghost overshadowing Lord Randolph Churchill, 1886"]}, {"page": "February 13", "response": ["*1849 – Lord Randolph Churchill, English lawyer and politician, Chancellor of the Exchequer (d. 1895)"]}, {"page": "January 24", "response": ["*1895 – Lord Randolph Churchill, English lawyer and politician, Chancellor of the Exchequer (b. 1849)"]}, {"page": "January 9", "response": ["*1854 – Jennie Jerome, American-born wife of Lord Randolph Churchill, mother of Sir Winston Churchill (d. 1921)G. H. L. Le May, \"Churchill, Jeanette [Lady Randolph Churchill] (1854–1921)\", rev. Oxford Dictionary of National Biography, Oxford University Press, 2004; online ed., May 2006, accessed 18 September 2010 "]}, {"page": "September 22", "response": ["*1885 – Lord Randolph Churchill makes a speech in Ulster in opposition to the Irish Home Rule movement."]}, {"page": "Winston Churchill", "response": ["Churchill was born on 30 November 1874 at his family's ancestral home, Blenheim Palace in Oxfordshire. On his father's side, he was a member of the British aristocracy as a direct descendant of the 1st Duke of Marlborough. His father, Lord Randolph Churchill, representing the Conservative Party, had been elected Member of Parliament (MP) for Woodstock in 1873. His mother, Jennie, was a daughter of Leonard Jerome, a wealthy American businessman."]}, {"page": "William Ewart Gladstone", "response": ["In 1858, Gladstone took up the hobby of tree felling, mostly of oak trees, an exercise he continued with enthusiasm until he was 81 in 1891. Eventually, he became notorious for this activity, prompting Lord Randolph Churchill to observe: \"For the purposes of recreation he has selected the felling of trees; and we may usefully remark that his amusements, like his politics, are essentially destructive. Every afternoon the whole world is invited to assist at the crashing fall of some beech or elm or oak. The forest laments in order that Mr Gladstone may perspire.\"The Speeches of Lord Randolph Churchill, ed. J.J. Jennings, Longman (1889), pp. 111–12. Less noticed at the time was his practice of replacing the trees felled by planting new saplings."]}, {"page": "1895", "response": ["* January 24 – Lord Randolph Churchill, British statesman (b. 1849)"]}, {"page": "1849", "response": ["* February 13 – Lord Randolph Churchill, British statesman (d. 1895)"]}, {"page": "Ruddigore", "response": ["The first night was not as successful as the other Savoy opera premieres because of controversy over the title and the revivification of the ghosts, and reservations about the plot and music.  According to the St James's Gazette, \"The first act was well received by the audience. Number after number was rapturously encored, and every droll sally of dialogue was received with a shout of appreciative mirth.\"Allen, p. 272Allen, pp. 273–74  The interval was long (a half hour) as the elaborate picture gallery needed to be set up, but D'Oyly Carte had anticipated this and had printed indulgence slips which were distributed.  It was marked by noisy hubbub when Lord Randolph Churchill was spotted in the crowd, but a loud shout of \"No politics!\" brought relative calm.Allen, p. 273  The second act, however, ended badly.  On 23 January 1887, under the heading \"Their First Flat Failure; The First Gilbert and Sullivan Opera Not a Success\", The New York Times reported, \"When the curtain finally fell there was hissing – the first ever heard in the Savoy Theatre.  The audience even voiced sentiments in words and there were shouts and cries such as these: 'Take off this rot!' 'Give us The Mikado!'\"  The paper added, \"(T)he name is decidedly against it.\"The New York Times review"]}, {"page": "Alexandra of Denmark", "response": ["Thomas Longley, the Archbishop of Canterbury, married the couple on 10 March 1863 at St George's Chapel, Windsor Castle.Alexandra's bridesmaids were Ladies Diana Beauclerk, Victoria Montagu-Douglas-Scott, Victoria Howard, Elma Bruce, Agneta Yorke, Emily Villiers, Eleanor Hare and Feodorowna Wellesley. The choice of venue was criticised widely. As the ceremony took place outside London, the press complained that large public crowds would not be able to view the spectacle. Prospective guests thought it awkward to get to and, as the venue was small, some people who had expected invitations were disappointed. The Danes were dismayed because only Alexandra's closest relations were invited. The British court was still in mourning for Prince Albert, so ladies were restricted to wearing grey, lilac or mauve.Duff, pp. 48–50. As the couple left Windsor for their honeymoon at Osborne House on the Isle of Wight, they were cheered by the schoolboys of neighbouring Eton College, including Lord Randolph Churchill.Duff, p. 60.", "For eight months over 1875–76, the Prince of Wales was absent from Britain on a tour of India, but to her dismay Alexandra was left behind. The prince had planned an all-male group and intended to spend much of the time hunting and shooting. During the prince's tour, one of his friends who was travelling with him, Lord Aylesford, was told by his wife that she was going to leave him for another man: Lord Blandford, who was himself married. Aylesford was appalled and decided to seek a divorce. Meanwhile, Lord Blandford's brother, Lord Randolph Churchill, persuaded the lovers against an elopement. Now concerned by the threat of divorce, Lady Aylesford sought to dissuade her husband from proceeding, but Lord Aylesford was adamant and refused to reconsider. In an attempt to pressure Lord Aylesford to drop his divorce suit, Lady Aylesford and Lord Randolph Churchill called on Alexandra and told her that if the divorce was to proceed they would subpoena her husband as a witness and implicate him in the scandal. Distressed at their threats, and following the advice of Sir William Knollys and the Duchess of Teck, Alexandra informed the queen, who then wrote to the Prince of Wales. The prince was incensed. Eventually, the Blandfords and the Aylesfords both separated privately. Although Lord Randolph Churchill later apologised, for years afterwards the Prince of Wales refused to speak to or see him.Battiscombe, pp. 132–135."]}, {"page": "Chancellor of the Exchequer", "response": ["| Lord Randolph Churchill"]}, {"page": "Myrmidons", "response": ["* \"The Myrmidons\" was the name adopted in 1865 by a private dining society in Merton College, Oxford.  It is thought to be the oldest continuously active dining society in the University of Oxford.  Max Beerbohm was a member, and the club called \"The Junta\" that features in his Oxford novel Zuleika Dobson is probably modeled on the Myrmidons.  Other former members include Lord Randolph Churchill and Andrew Irvine."]}, {"page": "Courtesy titles in the United Kingdom", "response": ["Another form of courtesy title is the honorific prefix of \"Lord\" before the name. This non-peerage title is accorded to younger sons of dukes and marquesses. The courtesy title is added before the person's given name and surname, as in the example of Lord Randolph Churchill, although conversational usage drops the surname on secondary reference. The title persists after the death of the holder's father, but is not inherited by any of his children. The wife of the holder is entitled to the feminine form of her husband's title, which takes the form of \"Lady\", followed by her husband's given name and surname, as in the example of Lady Randolph Churchill. The holder is addressed as \"Lord Randolph\" and his wife as \"Lady Randolph\"."]}, {"page": "H. H. Asquith", "response": ["Asquith's university career was distinguished—\"striking without being sensational\" in the words of his biographer, Roy Jenkins. An easy grasp of his studies left him ample time to indulge his liking for debate. In the first month at university he spoke at the Oxford Union. His official biographers, J. A. Spender and Cyril Asquith, commented that in his first months at Oxford \"he voiced the orthodox Liberal view, speaking in support, inter alia, of the disestablishment of the Church of England, and of non-intervention in the Franco-Prussian War\".Spender, J. A. and Cyril Asquith. \"Lord Oxford\", The Times, 12 September 1932, p. 11 He sometimes debated against his Balliol contemporary Alfred Milner, who although then a Liberal was already an advocate of British imperialism. He was elected Treasurer of the Union in 1872 but was defeated at his first attempt at the Presidency. During the General Election in January and February 1874 he spoke against Lord Randolph Churchill, who was not yet a prominent politician, at nearby Woodstock. He eventually became President of the Union in Trinity Term 1874, his last term as an undergraduate."]}, {"page": "Joseph Chamberlain", "response": ["Chamberlain's scope for manoeuvre was restricted between 1880 and 1883 by the Cabinet's preoccupation with Ireland, Transvaal Colony and Egypt, but he was able to introduce the Grain Cargoes Bill, for the safer transportation of grain, an Electric Lighting Bill, enabling municipal corporations to establish electricity supplies, and a Seaman's Wages Bill, which ensured a fairer system of payment for seamen. After 1883, Chamberlain was more productive. A Bankruptcy Bill established a Board of Trade Bankruptcy Department for inquiring into failed business deals. A Patents Bill subjected patenting to Board of Trade supervision. Chamberlain also sought to end the practice of ship owners overinsuring their vessels – 'coffin ships' – while under-manning them, ensuring a healthy profit whether the ship arrived safely or sank. Despite being endorsed by Tory Democrats Lord Randolph Churchill and John Eldon Gorst, the Liberal government was unwilling to grant Chamberlain its full support and the Bill was withdrawn in July 1884.", "Chamberlain did not enter the Unionist government, aware that the hostility to him in the Conservative ranks meant that an agreement with them could extend merely to Ireland and not wishing to alienate his Radical support base. The Liberal mainstream cast Chamberlain as a villain, shouting \"Judas!\" and \"Traitor!\" as he entered the House of Commons chamber. Unable to associate himself decisively with either party, Chamberlain sought concerted action with a kindred spirit from the Conservative Party, Lord Randolph Churchill. In November 1886, Churchill announced his own 'Unauthorised Programme' at Dartford, the content of which had much in common with Chamberlain's own recent manifesto, including smallholdings for rural labourers and greater local government. Next month, Churchill resigned as Chancellor of the Exchequer over military spending, and when the Conservative mainstream rallied around Salisbury, Churchill's career was effectively ended, along with Chamberlain's hope of creating a powerful cross-party union of Radicals. The appointment of Goschen to the Treasury isolated Chamberlain further and symbolised the good relationship between non-Radical Liberal Unionists and the Conservatives.Marsh, Chamberlain (1994) pp 255-80"]}, {"page": "Randolph, Iowa", "response": ["Randolph was platted in 1877, shortly before the completion of the railroad through the territory. The community name was bestowed by agriculturalist Frank Peavy, who named it after Lord Randolph Churchill, father of Winston Churchill.http://www.rlibrary.org/randolph_history_book/02%20Randolphs%20First%20100%20Years.pdf"]}, {"page": "Randolph, Nebraska", "response": ["Randolph got its start in the year 1886, following construction of the railroad through the territory. It was named for Lord Randolph Churchill, a British statesman. Randolph was incorporated on May 7, 1889."]}, {"page": "Merton College, Oxford", "response": ["Founder of the Bodleian Library, Thomas Bodley, was admitted as fellow in 1564. Another significant figure, Henry Savile, was appointed Warden some years later in 1585 (held the position until 1621) and had great influence of the development of the college. William Harvey, who was the first to describe in detail the systemic circulation, was warden from 1645 to 1646. Lord Randolph Churchill, Chancellor of the Exchequer and Leader of the House of Commons (and father of Winston Churchill), matriculated in October 1867, while Max Beerbohm, an English essayist, parodist, and caricaturist studied at Merton in the 1890s and was Secretary of the Myrmidon Club.", "File:Randolph Churchill in18830001.jpg|Lord Randolph Churchill, British statesman, father of Winston Churchill"]}, {"page": "Kaycee, Wyoming", "response": ["The Frewen Ranch was located east of present-day Kaycee at the confluence of the North Fork and the Middle Fork of the Powder River. He was the fifth son of Thomas Frewen, MP for South Leicestershire, and was educated at Trinity College, Cambridge, where he gained his BA in 1877. He emigrated to Wyoming during the cattle boom in the 1870s and 1880s. A charming if financially incompetent adventurer from an English landed gentry family known for reckless financial and political schemes, he managed to marry Clarita \"Clara\" Jerome (1851–1935) in 1881, daughter of the New York City financier Leonard Jerome, and sister to Lord Randolph Churchill's wife Jennie. They settled together on a huge Wyoming ranch, The Prince of Wales Ranch, where Frewen built an enormous log lodge/castle later destroyed by fire and ran up ever increasing debt, earning the sobriquets \"Mortal Ruin\" and \"the splendid pauper\". His laterally descended family, the Martins formerly of Charley Hall, Leicestershire, refer to him to this day however not as \"Mortal Ruin\" but as \"Immortal Ruin\", as he ran through two family fortunes before being granted a remittance and \"encouraged\" by family to emigrate to America."]}, {"page": "Liberal Unionist Party", "response": ["In December 1886, when Lord Randolph Churchill suddenly resigned as Chancellor of the Exchequer, Salisbury offered the position to Goschen, by far the most conservative of the leading Liberal Unionists. After consulting Hartington, Goschen agreed to join the Conservative government and remained Chancellor for the next six years."]}]}}