{"wiki_id": "http://www.wikidata.org/entity/Q314182", "itemLabel": "Henry Allingham", "itemDescription": "British supercentenarian,who lived to age 113", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Allingham", "wikipedia_page": {"main": "Henry William Allingham (6 June 1896 – 18 July 2009) was an English supercentenarian. He is the longest-lived man ever recorded from the United Kingdom, a First World War veteran, and, for one month, the verified oldest living man in the world. He is also the second-oldest military veteran ever, and at the time of his death was the 12th-verified oldest man of all time.\nAllingham was the oldest-ever surviving member of any of the British Armed Forces, and one of the oldest surviving veterans of the First World War. He was the last survivor of the Battle of Jutland, the last-surviving member of the Royal Naval Air Service (RNAS), and the last-surviving founding member of the Royal Air Force (RAF). In 2001, he became the face of the First World War veterans' association, and made frequent public appearances to ensure that awareness of the sacrifices of the First World War was not lost to modern generations. He received many honours and awards for his First World War service and his longevity.", "link_mentions": [{"page": "Battle of Jutland", "response": ["The last surviving veteran of the battle, Henry Allingham, a British RAF (originally RNAS) airman, died on 18 July 2009, aged 113, by which time he was the oldest documented man in the world and one of the last surviving veterans of the whole war. Also among the combatants was the then 20-year-old Prince Albert, serving as a junior officer aboard HMS Collingwood. He was second in the line to the throne, but would become king as George VI following his brother Edward's abdication in 1936.", "* Henry Allingham Last known survivor of the Battle of Jutland"]}, {"page": "June 6", "response": ["*1896 – Henry Allingham, English World War I soldier and supercentenarian (d. 2009)"]}, {"page": "July 18", "response": ["*2009 – Henry Allingham, English soldier (b. 1896)"]}, {"page": "Royal Air Force", "response": ["At its height in 1944 during the Second World War, more than 1,100,000 personnel were serving in the RAF. The longest-lived founding member of the RAF was Henry Allingham, who died on 18 July 2009 aged 113."]}, {"page": "1896", "response": ["**Henry Allingham, British World War I veteran, world's oldest man (d. 2009)"]}, {"page": "Clapham", "response": ["* Henry Allingham – supercentenarian"]}, {"page": "Carol Ann Duffy", "response": ["In her first poem as poet laureate, Duffy tackled the scandal over British MPs' expenses in the format of a sonnet.Politics by Carol Ann Duffy,  The Guardian, 13 June 2009 Her second, \"Last Post\", was commissioned by the BBC to mark the deaths of Henry Allingham and Harry Patch, the last remaining British soldiers to fight in World War I.\"Carol Ann Duffy, Poem for the last of WWI\" , Today Programme, BBC Radio 4, 30 July 2009. Her third, \"The Twelve Days of Christmas 2009\", addresses current events such as species extinction, the climate change conference in Copenhagen, the banking crisis, and the war in Afghanistan.Duffy, Carol Ann. \"The Twelve Days of Christmas 2009\", Radio Times, 6 December 2009. In March 2010, she wrote \"Achilles (for David Beckham)\"  about the Achilles tendon injury that left David Beckham out of the English football team at the 2010 FIFA World Cup;\"The bizzaro history of the poet laureate\" . Toronto Star, 7 July 2016. Bruce Demara. the poem was published in The Daily Mirror and treats modern celebrity culture as a kind of mythicisation.\"Achilles (David Beckham)\" , The Guardian, 16 March 2010. Retrieved 16 March 2010. \"Silver Lining,\" written in April 2010, acknowledges the grounding of flights caused by the ash of the Icelandic volcano Eyjafjallajökull.Duffy, Carol Ann. “Silver Lining | Carol Ann Duffy\" , The Guardian, 20 April 2010. On 30 August 2010 she premièred her poem \"Vigil\" for the Manchester Pride Candlelight Vigil in memory of LGBTQ people who have lost their lives to HIV/AIDS."]}, {"page": "Royal Naval Air Service", "response": ["* Henry Allingham – mechanic – oldest man in the world from June to July 2009 and the last surviving member of the RNAS"]}, {"page": "List of the oldest people by country", "response": ["|Henry Allingham ||  || class=nowrap | 6 Jun 1896 || class=nowrap | 18 Jul 2009 || "]}, {"page": "Johnson Beharry", "response": ["On 11 November 2008 Beharry acted as an escort to 110-year-old Harry Patch, then one of only three remaining British survivors of the First World War, at the Cenotaph in London's Whitehall to commemorate the 90th anniversary of the signing of the armistice which ended that conflict. On 11 November 2009, Beharry, and Mark Donaldson—the first recipient of the Victoria Cross for Australia (though not the first Australian recipient of the Victoria Cross)—handed a wreath to the Queen during a service in Westminster Abbey which marked the deaths in 2009 of the last three veterans of the First World War resident in the United Kingdom, Bill Stone, Henry Allingham and Harry Patch. The wreath was then laid on the Tomb of the Unknown Warrior.Service marks lost WWI generation, BBC, 11 November 2009. Retrieved 11 November 2009."]}, {"page": "Jack Russell (cricketer, born 1963)", "response": ["Russell now has his own gallery in Chipping Sodbury, and exhibits in London, displaying a portfolio of sights and scenes of his home area in Gloucestershire, architecture, classic military battlefields, and wildlife. Russell also undertakes commissions, and has painted comedian Eric Sykes (a fellow wicket keeper), Sir Norman Wisdom, Sir Bobby Charlton, Eric Clapton, Henry Allingham, Harry Patch, HRH Duke of Kent, and HRH Prince Philip, Duke of Edinburgh. He has been greatly influenced by other artists including Rembrant, Turner, Constable, Whistler, John Singer Sargant, Trevor Chanberlain ROI, and David Shepherd OBE.Jack Russell Website"]}, {"page": "List of Royal Air Force personnel", "response": ["* Henry Allingham – World War I veteran and last surviving founder member of the RAF"]}]}}