{"wiki_id": "http://www.wikidata.org/entity/Q3147240", "itemLabel": "Ian Branfoot", "itemDescription": "Footballer; football manager (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Branfoot", "wikipedia_page": {"main": "Ian Grant Branfoot (born Gateshead, 26 January 1947) is an English former footballer and manager.\nHe played as a defender, and after starting at Gateshead joined Sheffield Wednesday, making his Football League debut in 1965. After 42 senior appearances for the club he left in 1969–70 for Doncaster Rovers. He made over 150 League appearances for Rovers, and after moving to Lincoln City in 1973–74, he went on to make over 150 league appearances for the Imps as well.Branfoot was manager of Reading from 31 January 1984 to 23 October 1989,. He must rank as one of Reading's most successful managers, leading Reading to promotion from Division 4 to Division 3 in 1984 based on the good work of Maurice Evans, and then promotion from Division 3 to Division 2 as champions in 1986. This last achievement included a record breaking start to the season of 13 straight wins. The club maintained a 13th position the next season but were relegated in 1988. However, in the same season that they won the Full Members Cup beating Luton Town 4–1 at Wembley.He became manager of Southampton in June 1991, remaining in this position until January 1994. He then managed Fulham between 1994 and 1996. Branfoot later had a spell at Sunderland as academy director and at Leeds United as a scout. He also coached at Winchester College.", "link_mentions": [{"page": "Fulham F.C.", "response": ["In 1992, the foundation of the Premier League, and the resignation of 22 clubs from The Football League, restored Fulham to that league's Second Division. However, the club were relegated to the new Third Division after a poor 1993–94 season, following which Ian Branfoot was appointed as team manager.", "| Ian Branfoot**", "* ** Ian Branfoot continued to be employed by the club after his dismissal as manager."]}, {"page": "Alan Shearer", "response": ["During the middle of 1992, Southampton's manager, Ian Branfoot, became \"the most popular manager in English football\", as he took telephone calls from clubs \"trying to bargain with players they don't want plus cash\". Although Branfoot accepted that a sale was inevitable, he claimed that \"whatever happens, we are in the driving seat\".Quoted in  In July 1992, Shearer was sold to Blackburn Rovers for a fee of £3.6 million, with David Speedie reluctantly moving to The Dell as part of the deal. Despite Branfoot's claim to be \"in the driving seat\", Saints failed to include a \"sell-on clause\" in the contract. Shearer, less than a month off his 22nd birthday, was the most expensive player in British football. In his four years in the Southampton first team, Shearer made a total of 158 appearances in all competitions, scoring 43 goals."]}, {"page": "Southampton F.C.", "response": ["McMenemy left at the end of the 1984–85 season to be succeeded by Chris Nicholl, who was sacked after six years in charge despite preserving the club's top flight status. He was replaced by Ian Branfoot, who until the end of the 1990–91 season had been assistant manager to Steve Coppell at Crystal Palace. By this stage, a key player in the Southampton line-up was Guernsey-born attacking midfielder/striker Matthew Le Tissier, who broke into the first team in the 1986–87 season. He was voted PFA Young Player of the Year in 1990 and later made eight appearances for the England team – he finally retired in 2002 at the age of 33. Another exciting young player to break into the Southampton team just after Le Tissier was Alan Shearer, who at the age of 17 scored a hat-trick against Arsenal in a league match in April 1988. Shearer was a first team regular by 1990, and stayed with Southampton until July 1992, when he was sold to Blackburn Rovers for a national record of more than £3 million. He then became the most expensive footballer in the world when Blackburn sold him to Newcastle for £15 million in 1996. He also scored 30 times for England internationally."]}, {"page": "Reading F.C.", "response": ["When League football resumed after the war, Reading quickly came to prominence once again. The club's record victory, 10–2 versus Crystal Palace, was recorded in September 1946, and Reading twice finished runners-up in the Third (South), in 1948–49 and 1951–52, but they were denied a return to Division Two as only the champions were promoted. The side's moment of cup glory came in 1988 when they won the Simod Cup, beating a number of top-flight sides en route to their Wembley win over Luton Town. Reading were promoted to the Second Division as champions in 1986 under the management of Ian Branfoot, but were relegated back to the Third Division in 1988."]}, {"page": "Peter Reid", "response": ["Following his dismissal by Manchester City, in October 1993 Reid was persuaded by Ian Branfoot to resume his playing career with Southampton who were then in the middle of a crisis: the Saints fans were calling for Branfoot to be sacked with the club having lost eight of their first nine games. Reid brought a touch of guile and stability to the Saints side; despite playing only eight games he made a major contribution to the team's fortunes as Saints' season started to come together. He led them to some important victories, most specially over Newcastle United on 24 October 1993, a game in which Matthew Le Tissier scored two goals. His final game for Saints was a 3–1 victory over Chelsea on 28 December 1993."]}, {"page": "Gateshead", "response": ["*Ian Branfoot – footballer and manager (Sheffield Wednesday and Southampton)"]}, {"page": "Peter Shilton", "response": ["In 1994, he started to concentrate solely on management and Plymouth reached the Division Two play-offs, but lost in the semi finals to Burnley. In January 1994, he had been linked with Southampton for a possible return as manager following the departure of Ian Branfoot, but the job went to Alan Ball instead. The following February, with Plymouth heading for relegation, he left the club and announced his intention to start playing again. He was now 45 years old."]}, {"page": "Alan Ball Jr.", "response": ["In January 1994, Ball left Exeter to take over the reins at Southampton, replacing the unpopular Ian Branfoot. At the time of his appointment, Southampton seemed doomed to relegation, having spent virtually the whole season to that point in the drop zone. Ball's first task as manager was to re-establish Matthew Le Tissier's role in the team and to ensure that the other players recognised that he was the club's greatest asset. Le Tissier responded by scoring 6 goals in Ball's first 4 games in charge, including a hat-trick on 14 February 1994 in a 4–2 victory over Liverpool. In the second half of the 1993–94 season, Le Tissier played 16 games under Ball's management, scoring 15 times."]}, {"page": "Harry Redknapp", "response": ["Just months before being promoted to the manager's seat at Upton Park, Redknapp was linked with the managerial vacancy at Southampton after the departure of previous manager Ian Branfoot, but the job went to Alan Ball instead."]}, {"page": "1992–93 FA Premier League", "response": ["| Ian Branfoot"]}, {"page": "Jimmy Case", "response": ["Case played in midfield alongside Glenn Cockerill and Barry Horne and helped to bring on the careers of exciting young players such as Le Tissier, Alan Shearer, Rod Wallace and Jason Dodd. Ian Branfoot succeeded Nicholl as manager in June 1991, and considered that the club could dispense with Case's services and he was transferred to AFC Bournemouth within a few days of Branfoot's appointment, a decision that proved very unpopular with to Saints fans, especially when Case was replaced by the unsuccessful Terry Hurlock, and was one of the key reasons that Branfoot was an unpopular figure with the club's supporters during his two and a half years in charge."]}, {"page": "1993–94 FA Premier League", "response": ["|  Ian Branfoot"]}]}}