{"wiki_id": "http://www.wikidata.org/entity/Q315511", "itemLabel": "Algernon Charles Swinburne", "itemDescription": "English poet, playwright, novelist, and critic", "wikipedia_url": "https://en.wikipedia.org/wiki/Algernon_Charles_Swinburne", "wikipedia_page": {"main": "Algernon Charles Swinburne (5 April 1837 – 10 April 1909) was an English poet, playwright, novelist, and critic. He wrote several novels and collections of poetry such as Poems and Ballads, and contributed to the famous Eleventh Edition of the Encyclopædia Britannica.\nSwinburne wrote about many taboo topics, such as lesbianism, cannibalism, sado-masochism, and anti-theism. His poems have many common motifs, such as the ocean, time, and death. Several historical people are featured in his poems, such as Sappho (\"Sapphics\"), Anactoria (\"Anactoria\"),  and Catullus (\"To Catullus\").", "link_mentions": [{"page": "Algernon Swinburne", "response": ["#REDIRECT Algernon Charles Swinburne"]}, {"page": "Hymn to Proserpine", "response": ["“Hymn to Proserpine” is a poem by Algernon Charles Swinburne, published in Poems and Ballads in 1866.  The poem is addressed to the goddess Proserpina, the Roman equivalent of Persephone, but laments the rise of Christianity for displacing the pagan goddess and her pantheon."]}, {"page": "The Triumph of Time", "response": ["\"The Triumph of Time\" is a poem by Algernon Charles Swinburne, published in Poems and Ballads in 1866. It is in adapted ottava rima and is full of elaborate use of literary devices, particularly alliteration. The theme, which purports to be autobiographical, is that of rejected love. The speaker deplores the ruin of his life, and in tones at times reminiscent of Hamlet, craves oblivion, for which the sea serves as a constant metaphor."]}, {"page": "April 5", "response": ["*1837 – Algernon Charles Swinburne, English poet, playwright, novelist, and critic (d. 1909)"]}, {"page": "April 10", "response": ["*1909 – Algernon Charles Swinburne, English poet, playwright, novelist, and critic (b. 1837)"]}, {"page": "Dandy", "response": ["The poets Algernon Charles Swinburne and Oscar Wilde, Walter Pater, the American artist James McNeill Whistler, Joris-Karl Huysmans, and Max Beerbohm were dandies of the Belle Époque, as was Robert de Montesquiou — Marcel Proust's inspiration for the Baron de Charlus. In Italy, Gabriele d'Annunzio and Carlo Bugatti exemplified the artistic bohemian dandyism of the fin de siecle. Wilde wrote that, \"One should either be a work of Art, or wear a work of Art.\""]}, {"page": "List of English-language poets", "response": ["*Algernon Charles Swinburne (1837–1909, E)"]}, {"page": "Guy de Maupassant", "response": ["In 1867, as he entered junior high school, Maupassant made acquaintance with Gustave Flaubert at Croisset at the insistence of his mother. Next year, in autumn, he was sent to the Lycée Pierre-Corneille in Rouen where he proved a good scholar indulging in poetry and taking a prominent part in theatricals. In October 1868, at the age of 18, he saved the famous poet Algernon Charles Swinburne from drowning off the coast of Étretat.Clyde K. Hyder, Algernon Swinburne: The Critical Heritage, 1995, p. 185"]}, {"page": "Giordano Bruno", "response": ["Algernon Charles Swinburne wrote a poem honoring Giordano Bruno in 1889, when the statue of Bruno was constructed in Rome."]}, {"page": "Isle of Wight", "response": ["The island has been home to the poets Algernon Charles Swinburne and Alfred, Lord Tennyson and to Queen Victoria, who built her much-loved summer residence and final home Osborne House at East Cowes. It has a maritime and industrial tradition including boat-building, sail-making, the manufacture of flying boats, hovercraft, and Britain's space rockets. The island hosts annual music festivals including the Isle of Wight Festival, which in 1970 was the largest rock music event ever held. It has well-conserved wildlife and some of the richest cliffs and quarries for dinosaur fossils in Europe.", "* Poet Algernon Charles Swinburne"]}, {"page": "Julian (emperor)", "response": ["Considered apocryphal is the report that his dying words were , or  (\"You have won, Galilean\"), supposedly expressing his recognition that, with his death, Christianity would become the Empire's state religion. The phrase introduces the 1866 poem Hymn to Proserpine, which was Algernon Charles Swinburne's elaboration of what a philosophic pagan might have felt at the triumph of Christianity. It also ends the Polish Romantic play The Undivine comedy written in 1833 by Zygmunt Krasiński."]}, {"page": "Lesbian", "response": ["In Algernon Charles Swinburne's 1866 poem Sapphics, the term lesbian appears twice but capitalized both times after twice mentioning the island of Lesbos, and so could be construed to mean 'from the island of Lesbos'. In 1875, George Saintsbury, in writing about Baudelaire's poetry, refers to his \"Lesbian studies\" in which he includes his poem about \"the passion of Delphine\" which is a poem simply about love between two women which does not mention the island of Lesbos, though the other poem alluded to, entitled \"Lesbos\", does. (Document made available by Columbia University Libraries. PDF downloads automatically.) Use of the word lesbianism to describe erotic relationships between women had been documented in 1870.Zimmerman, pp. 776–777. In 1890, the term lesbian was used in a medical dictionary as an adjective to describe tribadism (as \"lesbian love\"). The terms lesbian, invert and homosexual were interchangeable with sapphist and sapphism around the turn of the 20th century. The use of lesbian in medical literature became prominent; by 1925, the word was recorded as a noun to mean the female equivalent of a sodomite.\"Lesbian\", Oxford English Dictionary, Second Edition, 1989. Retrieved on January 7, 2009."]}, {"page": "Lord Dunsany", "response": ["*Algernon Charles Swinburne, who wrote the line \"Time and the Gods are at strife\" in his 1866 poem \"Hymn to Proserpine\": Dunsany later realised this was his unconscious influence for the title Time and the Gods."]}, {"page": "Index of philosophy articles (A–C)", "response": ["* Algernon Charles Swinburne"]}, {"page": "Metre (poetry)", "response": ["The Sapphic stanza was imitated in English by Algernon Charles Swinburne in a poem he simply called Sapphics:"]}, {"page": "Oscar Wilde", "response": ["The University Philosophical Society also provided an education, as members discussed intellectual and artistic subjects such as Dante Gabriel Rossetti and Algernon Charles Swinburne weekly. Wilde quickly became an established member – the members' suggestion book for 1874 contains two pages of banter (sportingly) mocking Wilde's emergent aestheticism. He presented a paper titled \"Aesthetic Morality\". At Trinity, Wilde established himself as an outstanding student: he came first in his class in his first year, won a scholarship by competitive examination in his second and, in his finals, won the Berkeley Gold Medal in Greek, the University's highest academic award. He was encouraged to compete for a demyship (a half-scholarship worth £95 (£ today) per year) to Magdalen College, Oxford – which he won easily."]}, {"page": "Sappho", "response": ["It was not long after the rediscovery of Sappho that her sexuality once again became the focus of critical attention. In the early seventeenth century, John Donne wrote \"Sapho to Philaenis\", returning to the idea of Sappho as a hypersexual lover of women. The modern debate on Sappho's sexuality began in the 19th century, with Welcker publishing, in 1816, an article defending Sappho from charges of prostitution and lesbianism, arguing that she was chaste – a position which would later be taken up by Wilamowitz at the end of the 19th and Henry Thornton Wharton at the beginning of the 20th centuries. In the nineteenth century Sappho was co-opted by the Decadent Movement as a lesbian \"daughter of de Sade\", by Charles Baudelaire in France and later Algernon Charles Swinburne in England. By the late 19th century, lesbian writers such as Michael Field and Amy Levy became interested in Sappho for her sexuality, and by the turn of the twentieth century she was a sort of \"patron saint of lesbians\"."]}, {"page": "Sestina", "response": ["In the 1870s, there was a revival of interest in French forms, led by Andrew Lang, Austin Dobson, Edmund Gosse, W. E. Henley, John Payne, and others.White 1887 p xxxix The earliest sestina of this period is Algernon Charles Swinburne's \"Sestina\".This is the earliest-published sestina reprinted by Gleeson White (White 1887 pp 203–12), and he doesn't mention any earlier ones. It is in iambic pentameter rhyming ABABAB in the first stanza; each stanza begins by repeating the previous end-words 6 then 1, but the following 4 lines repeat the remaining end-words ad lib; the envoi is (1) 4 / (2) 3 / (5) 6. In the same volume (Poems and Ballads, Second Series, 1878) Swinburne introduces a \"double sestina\"Lennard 2006 p. 53 (\"The Complaint of Lisa\") that is unlike Sidney's: it comprises 12 stanzas of 12 iambic pentameter lines each, the first stanza rhyming ABCABDCEFEDF. Similar to his \"Sestina\", each stanza first repeats end-words 12 then 1 of the previous stanza; the rest are ad lib. The envoi is (12) 10 / (8) 9 / (7) 4 / (3) 6 / (2) 1 / (11) 5.", "The sestina has been subject to some variations, with changes being made to both the size and number of stanzas, and also to individual line length. A \"double sestina\" is the name given to either: two sets of six six-line stanzas, with a three-line envoy (for a total of 75 lines), or twelve twelve-line stanzas, with a six-line envoy (for a total of 150 lines). Examples of either variation are rare; \"Ye Goatherd Gods\" by Philip Sidney is a notable example of the former variation, while \"The Complaint of Lisa\" by Algernon Charles Swinburne is a notable example of the latter variation. In the former variation, the original pattern of line-ending words, i.e. that of the first stanza, recurs in the seventh stanza, and thus the entire change of pattern occurs twice throughout. In the second variation, the pattern of line-ending words returns to the starting sequence in the eleventh stanza; thus it does not, unlike the \"single\" sestina, allow for every end-word to occupy each of the stanza ends; end-words 5 and 10 fail to couple between stanzas."]}, {"page": "Thomas Bowdler", "response": ["The Bowdlers were not the first to undertake such a project, but Bowdler's commitment not to augment or add to Shakespeare's text, merely remove sensitive material, contrasted with earlier practice. Nahum Tate as Poet Laureate had rewritten the tragedy of King Lear with a happy ending; in 1807, Charles Lamb and Mary Lamb published Tales from Shakespeare for children with synopses of 20 of the plays, but seldom quoted the original text. Though The Family Shakespeare was seen as a negative example of censorship by the literary establishment and its commitment to \"authentic\" Shakespeare, the Bowdler editions made it more acceptable to teach Shakespeare to wider and younger audiences. According to the poet Algernon Charles Swinburne, \"More nauseous and more foolish cant was never chattered than that which would deride the memory or depreciate the merits of Bowdler. No man ever did better service to Shakespeare than the man who made it possible to put him into the hands of intelligent and imaginative children.\""]}, {"page": "William Blake", "response": ["In the 19th century, poet and free love advocate Algernon Charles Swinburne wrote a book on Blake drawing attention to the above motifs in which Blake praises \"sacred natural love\" that is not bound by another's possessive jealousy, the latter characterised by Blake as a \"creeping skeleton\".Swinburne p. 260 Swinburne notes how Blake's Marriage of Heaven and Hell condemns the hypocrisy of the \"pale religious letchery\" of advocates of traditional norms.Swinburne, p. 249. Another 19th-century free love advocate, Edward Carpenter (1844–1929), was influenced by Blake's mystical emphasis on energy free from external restrictions.Sheila Rowbotham's Edward Carpenter: A Life of Liberty and Love, p. 135.", "Blake's work was neglected for a generation after his death and almost forgotten by the time Alexander Gilchrist began work on his biography in the 1860s. The publication of the Life of William Blake rapidly transformed Blake's reputation, in particular as he was taken up by Pre-Raphaelites and associated figures, in particular Dante Gabriel Rossetti and Algernon Charles Swinburne. In the 20th century, however, Blake's work was fully appreciated and his influence increased. Important early and mid-20th-century scholars involved in enhancing Blake's standing in literary and artistic circles included S. Foster Damon, Geoffrey Keynes, Northrop Frye, David V. Erdman and G. E. Bentley Jr."]}, {"page": "1837", "response": ["* April 5 – Algernon Charles Swinburne, English poet (d. 1909)"]}, {"page": "Lyonesse", "response": ["*Tristram of Lyonesse (1882), an epic poem by Algernon Charles Swinburne"]}, {"page": "Tannhäuser", "response": ["English poet Algernon Charles Swinburne's \"Laus Veneris\" (In Praise of Venus) is a telling of the Tannhauser legend.  Swinburne also composed the medieval French epigraph that purports to be its source."]}, {"page": "Anne Desclos", "response": ["An avid reader of English literature, Desclos either translated or introduced to readers in France such renowned authors as Algernon Charles Swinburne, Evelyn Waugh, Virginia Woolf, T. S. Eliot, F. Scott Fitzgerald, and numerous others. She became a critic and was made a member of the jury for several prominent literary awards."]}, {"page": "Ben Jonson", "response": ["At the same time, Jonson pursued a more prestigious career, writing masques for James's court. The Satyr (1603) and The Masque of Blackness (1605) are two of about two dozen masques which Jonson wrote for James or for Queen Anne, some of them performed at Apethorpe Palace when the King was in residence. The Masque of Blackness was praised by Algernon Charles Swinburne as the consummate example of this now-extinct genre, which mingled speech, dancing and spectacle."]}, {"page": "Northumberland", "response": ["The border ballads of the region have been famous since late mediaeval times. Thomas Percy, whose celebrated Reliques of Ancient English Poetry appeared in 1765, states that most of the minstrels who sang the border ballads in London and elsewhere in the 15th and 16th centuries belonged to the North. The activities of Sir Walter Scott and others in the 19th century gave the ballads an even wider popularity. William Morris considered them to be the greatest poems in the language, while Algernon Charles Swinburne knew virtually all of them by heart.", "*Algernon Charles Swinburne, a poet raised at Capheaton Hall"]}, {"page": "Grace Darling", "response": ["* Algernon Charles Swinburne's poem \"Grace Darling\". A poem of the same name and subject was published in 1910 by Scottish Border poet and Australian bush balladeer Will H. Ogilvie (1869–1963)"]}, {"page": "Joyce Kilmer", "response": ["Kilmer's early works were inspired by, and were imitative of, the poetry of Algernon Charles Swinburne, Gerard Manley Hopkins, Ernest Dowson, Aubrey Beardsley, and William Butler Yeats (and the Celtic Revival). It was later through the influence of works by Coventry Patmore, Francis Thompson, and those of Alice Meynell and her children Viola Meynell and Francis Meynell, that Kilmer seems to have become interested in Catholicism. Kilmer wrote of his influences:"]}, {"page": "Thomas Middleton", "response": ["Middleton's work has long been praised by literary critics, among them Algernon Charles Swinburne and T. S. Eliot. The latter thought Middleton was second only to Shakespeare.\"Thomas Middleton\", The Times Literary Supplement, 30 June 1927, pp. 445–446 (unsigned).", "*Algernon Charles Swinburne. The Age of Shakespeare. New York: Harpers, 1908. Gutenberg e-text"]}, {"page": "The Spectator", "response": ["*Algernon Charles Swinburne reviewed literature and published poetry in the 1860s."]}, {"page": "List of poets", "response": ["*Algernon Charles Swinburne (1837–1909), English poet, playwright and novelist"]}, {"page": "List of biographers", "response": ["*Jean Overton Fuller (En, 1915–2009) – Noor-un-nisa Inayat Khan, Percy Bysshe Shelley, Algernon Charles Swinburne and Sir Francis Bacon"]}, {"page": "Tintagel", "response": ["Tintagel is used as a locus for the Arthurian mythos by the poet Alfred, Lord Tennyson in the poem Idylls of the King and Algernon Charles Swinburne's Tristram of Lyonesse, a literary version of the Tristan and Iseult legend. Thomas Hardy's The Famous Tragedy of the Queen of Cornwall at Tintagel in Lyonnesse, a one-act play which was published in 1923, is another version of the same legend with events set at Tintagel (the book includes an imaginary drawing of Tintagel Castle at the period).Hardy, Thomas (1923) The Famous Tragedy of the Queen of Cornwall at Tintagel in Lyonnesse. London: Macmillan; two drawings by Hardy reproduced as plates. Hardy and his first wife visited Tintagel on various occasions: she drew a sketch of the inside of the church as it was about 1867.Hardy, Emma (1961) Some Recollections. London: Oxford University Press. It is very prominent in the books in Fay Sampson's Daughter of Tintagel series of Arthurian novels (later retitled Morgan le Fay)."]}, {"page": "Encyclopædia Britannica Eleventh Edition", "response": ["The initials of the encyclopaedia's contributors appear at the end of selected articles or at the end of a section in the case of longer articles, such as that on China, and a key is given in each volume to these initials.  Some articles were written by the best-known scholars of the time, such as Edmund Gosse, J. B. Bury, Algernon Charles Swinburne, John Muir, Peter Kropotkin, T. H. Huxley, James Hopwood Jeans and William Michael Rossetti. Among the then lesser-known contributors were some who would later become distinguished, such as Ernest Rutherford and Bertrand Russell. Many articles were carried over from the 9th edition, some with minimal updating. Some of the book-length articles were divided into smaller parts for easier reference, yet others much abridged.  The best-known authors generally contributed only a single article or part of an article. Most of the work was done by journalists, British Museum scholars and other scholars. The 1911 edition was the first edition of the encyclopædia to include more than just a handful of female contributors, with 34 women contributing articles to the edition."]}, {"page": "Bliss Carman", "response": ["Carman was educated at the Fredericton Collegiate School and the University of New Brunswick (UNB), from which he received a B.A. in 1881. At the Collegiate School he came under the influence of headmaster George Robert Parkin, who gave him a love of classical literature and introduced him to the poetry of Dante Gabriel Rossetti and Algernon Charles Swinburne. His first published poem was in the UNB Monthly in 1879. He  then spent a year at Oxford and the University of Edinburgh (1882–1883), but returned home to receive his M.A. from UNB in 1884.Kelsey Allan, \"William Bliss Carman,\" New Brunswick Literary Encyclopedia, STU.ca, Web, Apr. 16, 2011."]}, {"page": "Common nightingale", "response": ["* John Keats' \"Ode to a Nightingale\" (1819) was described by Edmund Clarence Stedman as \"one of our shorter English lyrics that still seems to me... the nearest to perfection, the one I would surrender last of all\" and by Algernon Charles Swinburne as \"one of the final masterpieces of human work in all time and for all ages\".. Reprinted from the Encyclopædia Britannica."]}, {"page": "Phaedra (mythology)", "response": ["* Algernon Charles Swinburne, Phaedra (1866), English lyrical drama"]}]}}