{"wiki_id": "http://www.wikidata.org/entity/Q3157819", "itemLabel": "Jacqueline Winspear", "itemDescription": "English writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jacqueline_Winspear", "wikipedia_page": {"main": "Jacqueline Winspear (born April 30, 1955) is a mystery writer, author of the Maisie Dobbs series of books exploring the aftermath of World War I. She has won several mystery writing awards for books in this popular series.\n\n", "link_mentions": [{"page": "Oswald Mosley", "response": ["* In the sixth book in Jacqueline Winspear's Maisie Dobbs series, Among the Mad, Maisie's investigation takes her to a meeting of Oswald Mosley followers where violence ensues."]}, {"page": "White feather", "response": ["In the children's novel Birds of a Feather (2004) by Jacqueline Winspear, four young girls take it upon themselves to hand out feathers to young men not in uniform in an effort to shame them into enlisting on Britain's side in The Great War."]}, {"page": "Earlene Fowler", "response": ["The Saddlemaker's Wife, not a part of the Benni Harper series, was nominated for the 2006 Agatha Award for Best Novel. Ms. Fowler was nominated along with authors Nancy Pickard (winner), L. C. Hayden, Julia Spencer-Fleming, and Jacqueline Winspear."]}, {"page": "Cranbrook School, Kent", "response": ["* Jacqueline Winspear, author"]}, {"page": "Fitzroy Square", "response": ["Novelist Jacqueline Winspear gives her 1920s detective Maisie Dobbs an office in Fitzroy Square."]}, {"page": "Agatha Award", "response": ["; 2003 – Jacqueline Winspear, Maisie Dobbs (Soho Press Inc.)", "* Jacqueline Winspear, Messenger of Truth", "* Jacqueline Winspear, Pardonable Lies (Henry Holt Books)", "; 2004 – Jacqueline Winspear, Birds of a Feather (Soho Press)", "* Jacqueline Winspear, Elegy for Eddie", "* Jacqueline Winspear, A Lesson in Secrets"]}, {"page": "List of female detective characters", "response": ["* Maisie Dobbs takes over a London private investigation agency after her mentor retires, familiar with psychology from his training and her nursing in WWI 1910–1929 for the Maisie Dobbs (novel) series by Jacqueline Winspear begun in 2003."]}]}}