{"wiki_id": "http://www.wikidata.org/entity/Q315509", "itemLabel": "Philip Sidney", "itemDescription": "English poet, courtier, diplomat (1554-1586)", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Sidney", "wikipedia_page": {"main": "Sir Philip Sidney (30 November 1554 – 17 October 1586) was an English poet, courtier, scholar and soldier who is remembered as one of the most prominent figures of the Elizabethan age. His works include Astrophel and Stella, The Defence of Poesy (also known as The Defence of Poetry or An Apology for Poetry) and The Countess of Pembroke's Arcadia.", "link_mentions": [{"page": "Alternate history", "response": ["Again, in the English Renaissance fantasy Armor of Light by Melissa Scott and Lisa A. Barnett, the magic used in the book, by Dr. John Dee and others, actually was practiced in the Renaissance; positing a secret history of effective magic makes this an alternate history with a point of departure. Sir Philip Sidney survives the Battle of Zutphen in 1586, and shortly thereafter saving the life of Christopher Marlowe."]}, {"page": "Alexandrine", "response": ["Though English alexandrines have occasionally provided the sole metrical line for a poem, for example in lyric poems by Henry Howard, Earl of Surrey and Sir Philip Sidney, and in two notable long poems, Michael Drayton's Poly-Olbion and Robert Browning's Fifine at the Fair, they have more often featured alongside other lines. During the Middle Ages they typically occurred with heptameters (seven-beat lines), both exhibiting metrical looseness. Around the mid-16th century stricter alexandrines were popular as the first line of poulter's measure couplets, fourteeners (strict iambic heptameters) providing the second line."]}, {"page": "List of English-language poets", "response": ["*Philip Sidney (1554–1586, E)"]}, {"page": "Edward de Vere, 17th Earl of Oxford", "response": ["In the summer of 1571, Oxford declared an interest in Cecil's 14 year-old daughter, Anne, and received the queen's consent to the marriage. Anne had been pledged to Philip Sidney two years earlier, but after a year of negotiations Sidney's father, Sir Henry, was declining in the Queen's favour and Cecil suspected financial difficulties. In addition, Cecil had been elevated to the peerage as Lord Burghley in February 1571, thus elevating his daughter's rank, so the negotiations were cancelled. Cecil was displeased with the arrangement, given his daughter's age compared to Oxford’s, and had entertained the idea of marrying her to the Earl of Rutland instead. The marriage was deferred until Anne was fifteen and finally took place at the Palace of Whitehall on 16 December 1571, in a triple wedding with that of Lady Elizabeth Hastings and Edward Somerset, Lord Herbert, and Edward Sutton, 4th Baron Dudley and bride, Mary Howard, with the Queen in attendance. The tying of two young English noblemen of great fortune into Protestant families was not lost on Elizabeth's Catholic enemies. Burghley gave Oxford for his daughter’s dowry land worth £800, and a cash settlement of £3,000. This amount was equal to Oxford’s livery fees and was probably intended to be used as such, but the money vanished without a trace.", "In April 1578, the Spanish ambassador, Bernardino de Mendoza, had written to King Philip II of Spain that it had been proposed that if Anjou were to travel to England to negotiate his marriage to the Queen, Oxford, Surrey, and Windsor should be hostages for his safe return. Anjou himself did not arrive in England until the end of August, but his ambassadors were already in England. Oxford was sympathetic to the proposed marriage; Leicester and his nephew Philip Sidney were adamantly opposed to it. This antagonism may have triggered the famous quarrel between Oxford and Sidney on the tennis court at Whitehall. It is not entirely clear who was playing on the court when the fight erupted; what is undisputed is that Oxford called Sidney a 'puppy', while Sidney responded that \"all the world knows puppies are gotten by dogs, and children by men\". The French ambassadors, whose private galleries overlooked the tennis court, were witness to the display. Whether it was Sidney who next challenged Oxford to a duel or the other way around, the matter was not taken further, and the Queen personally took Sidney to task for not recognizing the difference between his status and Oxford's. Christopher Hatton and Sidney's friend Hubert Languet also tried to dissuade Sidney from pursuing the matter, and it was eventually dropped. The specific cause is not known, but in January 1580 Oxford wrote and challenged Sidney; by the end of the month Oxford was confined by the Queen to his chambers, and was not released until early February."]}, {"page": "Geoffrey Chaucer", "response": ["The poet Thomas Hoccleve, who may have met Chaucer and considered him his role model, hailed Chaucer as \"the firste fyndere of our fair langage\".Thomas Hoccleve, The Regiment of Princes, TEAMS website, University of Rochester, Robbins Library John Lydgate referred to Chaucer within his own text The Fall of Princes as the \"lodesterre … off our language\".As noted by Carolyn Collette in \"Fifteenth Century Chaucer\", an essay published in the book A Companion to Chaucer  Around two centuries later, Sir Philip Sidney greatly praised Troilus and Criseyde in his own Defence of Poesie.\"Chawcer undoubtedly did excellently in his Troilus and Creseid: of whome trulie I knowe not whether to mervaile more, either that hee in that mistie time could see so clearly, or that wee in this cleare age, goe so stumblingly after him.\" The text can be found at uoregon.edu During the nineteenth century and early twentieth century, Chaucer came to be viewed as a symbol of the nation's poetic heritage.Richard Utz, \"Chaucer among the Victorians,\" Oxford Handbook of Victorian Medievalism, ed. Joanna Parker and Corinna Wagner (Oxford: OUP, 2020): pp. 189-201."]}, {"page": "Giordano Bruno", "response": ["In Paris, Bruno enjoyed the protection of his powerful French patrons. During this period, he published several works on mnemonics, including De umbris idearum (On the Shadows of Ideas, 1582),  (Ars Memoriae}, 1582), and Cantus Circaeus (Circe's Song, 1582). All of these were based on his mnemonic models of organized knowledge and experience, as opposed to the simplistic logic-based mnemonic techniques of Petrus Ramus then becoming popular. Bruno also published a comedy summarizing some of his philosophical positions, titled Il Candelaio (The Torchbearer, 1582). In the 16th century dedications were, as a rule, approved beforehand, and hence were a way of placing a work under the protection of an individual. Given that Bruno dedicated various works to the likes of King Henry III, Sir Philip Sidney, Michel de Castelnau (French Ambassador to England), and possibly Pope Pius V, it is apparent that this wanderer had risen sharply in status and moved in powerful circles.", "In April 1583, Bruno went to England with letters of recommendation from Henry III as a guest of the French ambassador, Michel de Castelnau. Bruno lived at the French embassy with the lexicographer John Florio. There he became acquainted with the poet Philip Sidney (to whom he dedicated two books) and other members of the Hermetic circle around John Dee, though there is no evidence that Bruno ever met Dee himself. He also lectured at Oxford, and unsuccessfully sought a teaching position there. His views were controversial, notably with John Underhill, Rector of Lincoln College and subsequently bishop of Oxford, and George Abbot, who later became Archbishop of Canterbury. Abbot mocked Bruno for supporting \"the opinion of Copernicus that the earth did go round, and the heavens did stand still; whereas in truth it was his own head which rather did run round, and his brains did not stand still\", and found Bruno had both plagiarized and misrepresented Ficino's work, leading Bruno to return to the continent.Hannam, James. God's Philosophers: How the Medieval World Laid the Foundations of Modern Science. Icon Books Ltd, 2009, 312, )"]}, {"page": "Lancelot Andrewes", "response": ["Andrewes liked to move among the people, yet found time to join a society of antiquaries, of which Walter Raleigh, Philip Sidney, Burleigh, Arundel, the Herberts, Saville, John Stow and William Camden were members. Elizabeth I had not advanced him further on account of his opposition to the alienation of ecclesiastical revenues. In 1598 he declined the bishoprics of Ely and Salisbury, because of the conditions attached. On 23 November 1600, he preached at Whitehall a controversial sermon on justification. In July 1601 he was appointed Dean of Westminster and gave much attention to the school there."]}, {"page": "November 30", "response": ["*1554 – Philip Sidney, English soldier, courtier, and poet (d. 1586)"]}, {"page": "October 17", "response": ["*1586 – Philip Sidney, English courtier, poet, and general (b. 1554)"]}, {"page": "Oxfordian theory of Shakespeare authorship", "response": ["As with other candidates for authorship of Shakespeare's works, Oxford's advocates have attributed numerous non-Shakespearian works to him. Looney began the process in his 1921 edition of de Vere's poetry. He suggested that de Vere was also responsible for some of the literary works credited to Arthur Golding, Anthony Munday and John Lyly. Streitz credits Oxford with the Authorized King James Version of the Bible.. Two professors of linguistics have claimed that de Vere wrote not only the works of Shakespeare, but most of what is memorable in English literature during his lifetime, with such names as Edmund Spenser, Christopher Marlowe, Philip Sidney, John Lyly, George Peele, George Gascoigne, Raphael Holinshed, Robert Greene, Thomas Phaer, and Arthur Golding being among dozens of further pseudonyms of de Vere.. Ramon Jiménez has credited Oxford with such plays as The True Tragedy of Richard III. and Edmund Ironside..", "Oxfordians argue that at the time of the passage's composition (pre-1589), the writers referenced were not in print, and interpret Puttenham's passage (that the noblemen preferred to 'suppress' their work to avoid the discredit of appearing learned) to mean that they were 'concealed'. They cite Sir Philip Sidney, none of whose poetry was published until after his premature death, as an example. Similarly, by 1589 nothing by Greville was in print, and only one of Walter Raleigh's works had been published.Hannas, Andrew.\"The Rest is Not Silence: On Grammar and Oxford in The Art of English Poesie.\"  Shakespeare Oxford Society.", "However, Don Foster, in his study of Early Modern uses of the phrase \"ever-living\", argues that the phrase most frequently refers to God or other supernatural beings, suggesting that the dedication calls upon God to bless the living begetter (writer) of the sonnets. He states that the initials \"W. H.\" were a misprint for \"W. S.\" or \"W. SH\".. Bate thinks it a misprint as well, but he thinks it \"improbable\" that the phrase refers to God and suggests that the \"ever-living poet\" might be \"a great dead English poet who had written on the great theme of poetic immortality\", such as Sir Philip Sidney or Edmund Spenser.", "Although searching Shakespeare's works for encrypted clues supposedly left by the true author is associated mainly with the Baconian theory, such arguments are often made by Oxfordians as well. Early Oxfordians found many references to Oxford's family name \"Vere\" in the plays and poems, in supposed puns on words such as \"ever\" (E. Vere). In The De Vere Code,Jonathan Bond \"The De Vere Code: Proof of the True Author of SHAKE-SPEARES SONNETS\" (Real Press, 2009) , http://www.deverecode.com  a book by English actor Jonathan Bond, the author believes that Thomas Thorpe's 30-word dedication to the original publication of Shakespeare's Sonnets contains six simple encryptions which conclusively establish de Vere as the author of the poems. He also writes that the alleged encryptions settle the question of the identity of \"the Fair Youth\" as Henry Wriothesley and contain striking references to the sonnets themselves and de Vere's relationship to Sir Philip Sidney and Ben Jonson."]}, {"page": "Richard Lovelace (poet)", "response": ["William Winstanley thought highly of Lovelace's work and compared him to an idol: \"I can compare no Man so like this Colonel Lovelace as Sir Philip Sidney\" of which it is in an Epitaph made of him;"]}, {"page": "Sonnet", "response": ["It was, however, Sir Philip Sidney's sequence Astrophel and Stella (1591) that started the English vogue for sonnet sequences. The next two decades saw sonnet sequences by William Shakespeare, Edmund Spenser, Michael Drayton, Samuel Daniel, Fulke Greville, William Drummond of Hawthornden, and many others. These sonnets were all essentially inspired by the Petrarchan tradition, and generally treat of the poet's love for some woman, with the exception of Shakespeare's sequence of 154 sonnets. The form is often named after Shakespeare, not because he was the first to write in this form but because he became its most famous practitioner. The form consists of fourteen lines structured as three quatrains and a couplet. The third quatrain generally introduces an unexpected sharp thematic or imagistic \"turn\", the volta. In Shakespeare's sonnets, however, the volta usually comes in the couplet, and usually summarizes the theme of the poem or introduces a fresh new look at the theme. With only a rare exception (for example, Shakespeare's Sonnet 145 in iambic tetrameter), the meter is iambic pentameter."]}, {"page": "Sestina", "response": ["Although they appeared in print later, Philip Sidney's three sestinas may have been written earlier, and are often credited as the first in English. The first published (toward the end of Book I of The Countess of Pembroke's Arcadia, 1590Ferguson 1996 pp. 188–90) is the double sestina \"Ye Goatherd Gods\". In this variant the standard end-word pattern is repeated for twelve stanzas, ending with a three-line envoi, resulting in a poem of 75 lines. Two others were published in subsequent editions of the Arcadia. The second, \"Since wailing is a bud of causeful sorrow\", is in the \"standard\" form. Like \"Ye Goatherd Gods\" it is written in unrhymed iambic pentameter and uses exclusively feminine endings, reflecting the Italian endecasillabo. The third, \"Farewell, O sun, Arcadia's clearest light\", is the first rhyming sestina in English: it is in iambic pentameters and follows the standard end-word scheme, but rhymes ABABCC in the first stanza (the rhyme scheme necessarily changes in each subsequent stanza, a consequence of which is that the 6th stanza is in rhyming couplets). Sidney uses the same envoi structure as Spenser. William Drummond of Hawthornden published two sestinas (which he called \"sextains\") in 1616, which copy the form of Sidney's rhyming sestina. After this, there is an absence of notable sestinas for over 250 years,Burt 2007 p. 219 with John Frederick Nims noting that, \"... there is not a single sestina in the three volumes of the Oxford anthologies that cover the seventeenth, eighteenth and nineteenth centuries.\"Caplan 2006 pp. 19–20", "The sestina has been subject to some variations, with changes being made to both the size and number of stanzas, and also to individual line length. A \"double sestina\" is the name given to either: two sets of six six-line stanzas, with a three-line envoy (for a total of 75 lines), or twelve twelve-line stanzas, with a six-line envoy (for a total of 150 lines). Examples of either variation are rare; \"Ye Goatherd Gods\" by Philip Sidney is a notable example of the former variation, while \"The Complaint of Lisa\" by Algernon Charles Swinburne is a notable example of the latter variation. In the former variation, the original pattern of line-ending words, i.e. that of the first stanza, recurs in the seventh stanza, and thus the entire change of pattern occurs twice throughout. In the second variation, the pattern of line-ending words returns to the starting sequence in the eleventh stanza; thus it does not, unlike the \"single\" sestina, allow for every end-word to occupy each of the stanza ends; end-words 5 and 10 fail to couple between stanzas."]}, {"page": "Classical unities", "response": ["The Classical Unities seem to have had less impact in England. It had adherents in Ben Jonson and John Dryden. Examples of plays that followed the theory include: Thomas Otway's Venice Preserv'd (1682), Joseph Addison's Cato, and Samuel Johnson's Irene (1749). Shakespeare's The Tempest (1610) takes place almost entirely on an island, during the course of four hours, and with one major action — that of Prospero reclaiming his role as the Duke of Milan. It is suggested that Prospero's way of regularly checking the time of day during the play might be satirizing the concept of the unities. In An Apology for Poetry (1595), Philip Sidney advocates for the unities, and complains that English plays are ignoring them. In Shakespeare's The Winter's Tale the chorus notes that the story makes a jump of 16 years:"]}, {"page": "University of Sydney", "response": ["According to the university, the Latin motto Sidere mens eadem mutato can be translated to \"the stars change, the mind remains the same.\" Francis Merewether, Vice-Chancellor and later Chancellor, in 1857 proposed \"Coelum non animum mutant\" from Horace (Ep.1.11.27) but after objections changed it to a metrical version including \"Sidus\" (Star), a neat reference to the Southern Cross and perhaps the Sydney family link with Sir Philip Sidney's \"Astrophel (Star-Lover) & Stella (Star)\". Author and university alumnus Clive James quipped in his 1981 autobiography that the motto loosely implies \"Sydney University is really Oxford or Cambridge laterally displaced approximately 12,000 miles.\""]}, {"page": "Western canon", "response": ["The canon of Renaissance English poetry of the 16th and early 17th century has always been in some form of flux and towards the end of the 20th century the established canon was criticised, especially by those who wished to expand it to include, for example, more women writers. However, the central figures of the British renaissance canon remain, Edmund Spenser, Sir Philip Sidney, Christopher Marlowe, William Shakespeare, Ben Jonson, and John Donne. Spenser, Donne, and Jonson were major influences on 17th-century poetry. However, poet John Dryden condemned aspects of the metaphysical poets in his criticism. In the 18th century Metaphysical poetry fell into further disrepute,\"Life of Cowley,\" in Samuel Johnson's Lives of the Poets while the interest in Elizabethan poetry was rekindled through the scholarship of Thomas Warton and others. However, the canon of Renaissance poetry was formed in the Victorian period with anthologies like Palgrave's Golden Treasury.Gary F. Waller, (2013). English Poetry of the Sixteenth Century. London: Routledge. p. 262", "The American critic Yvor Winters suggested in 1939 an alternative canon of Elizabethan poetry,Poetry, LII (1939, pp. 258-72, excerpted in Paul. J. Alpers (ed): Elizabethan Poetry. Modern Essays in Criticism. Oxford: Oxford University Press, 1967. which would exclude the famous representatives of the Petrarchan school of poetry, represented by Sir Philip Sidney and Edmund Spenser. Winters claimed that the Native or Plain Style anti-Petrarchan movement had been undervalued and argued that George Gascoigne (1525–1577) \"deserves to be ranked […] among the six or seven greatest lyric poets of the century, and perhaps higher\".Poetry, LII (1939, pp. 258–72, excerpted in Paul. J. Alpers (ed): Elizabethan Poetry. Modern Essays in Criticism. Oxford: Oxford University Press, 1967: 98"]}, {"page": "1554", "response": ["* November 30 – Sir Philip Sidney, English courtier and poet (d. 1586)"]}, {"page": "Shakespearean tragedy", "response": ["The English Renaissance, when Shakespeare was writing, was fueled by a renewed interest in Roman and Greek classics and neighboring renaissance literature written years earlier in Italy, France, and Spain. Shakespeare wrote the majority of his tragedies under the rule of James I, and their darker contents may reflect the general mood of the country following the death of Elizabeth I, as well as James' theatrical preferences. Shakespeare, as was customary for other playwrights in his day, used history, other plays, and non-dramatic literature as sources for his plays. In Elizabethan England there were no copyright or protections against plagiarism, so characters, plots, and even whole phrases of poetry were considered common property. The majority of Shakespeare's tragedies are based on historical figures, with the exception of Measure for Measure and Othello, which are based on narrative fictions by Giraldi Cintio. The historical basis for Shakespeare's Roman plays comes from The Lives of Noble Grecians and Romans by Plutarch, whereas the source of Shakespeare's Britain based plays and Hamlet (based on the Danish Prince Amleth) derive from Holinshed's Chronicles. Furthermore, the French author Belleforest published The Hystorie of Hamblet, Prince of Denmarke in 1582 which includes specifics from how the prince counterfeited to be mad, to how the prince stabbed and killed the King's counsellor who was eavesdropping on Hamlet and his mother behind the arras in the Queen's chamber. The story of Lear appears in Geoffrey of Monmouth's Historia regium Britanniae , and then in John Higgins' poem The Mirror for Magistrates in 1574, as well as appearing in Holinshed's Chronicles in 1587. Some events that happen in Shakespeare's King Lear were inspired by various episodes of Philip Sidney's Arcadia from 1590, while the nonsensical musings of Edgar's \"poor Tom\" heavily reference Samuel Harsnett's 1603 book, A Declaration of Egregious Popish Impostures."]}, {"page": "1586", "response": ["* September 22 – Battle of Zutphen: Spanish troops defeat the Dutch rebels and their English allies. English poet and courtier Sir Philip Sidney is mortally wounded.", "* October 17 – Philip Sidney, English poet, courtier and soldier (b. 1554)"]}, {"page": "Elizabeth Woodville", "response": ["Edward IV's love for his wife is celebrated in sonnet 75 of Philip Sidney's Astrophel and Stella. (written by 1586, first pub. 1591)."]}, {"page": "Torquato Tasso", "response": ["*Tasso's lyric poetry may have had some influence in late Renaissance France on Desportes and Ronsard (whom Tasso met in Paris). It almost certainly influenced a number of English Elizabethans, including Sir Philip Sidney, Abraham Fraunce and Samuel Daniel."]}, {"page": "Ben Jonson", "response": ["At the beginning of the English reign of James VI and I in 1603 Jonson joined other poets and playwrights in welcoming the new king. Jonson quickly adapted himself to the additional demand for masques and entertainments introduced with the new reign and fostered by both the king and his consort Anne of Denmark. In addition to his popularity on the public stage and in the royal hall, he enjoyed the patronage of aristocrats such as Elizabeth Sidney (daughter of Sir Philip Sidney) and Lady Mary Wroth. This connection with the Sidney family provided the impetus for one of Jonson's most famous lyrics, the country house poem To Penshurst."]}, {"page": "Robert Dudley, 1st Earl of Leicester", "response": ["In 1560 the diplomat Nicholas Throckmorton advocated vehemently against Dudley marrying the Queen, but Dudley won him over in 1562.Doran 1996 p. 59 Throckmorton henceforth became his political advisor and intimate. After Throckmorton's death in 1571 there quickly evolved a political alliance between the Earl of Leicester and Sir Francis Walsingham, soon to be Secretary of State. Together they worked for a militant Protestant foreign policy.Wilson 1981 p. 215; Collinson 1960 pp. xxv–xxvi There also existed a family relationship between them after Walsingham's daughter had married Philip Sidney, Leicester's favourite nephew.Rosenberg 1958 p. 23 Leicester, after some initial jealousy, also became a good friend of Sir Christopher Hatton, himself one of Elizabeth's favourites.Adams 2002 p. 121", "Leicester possessed one of the largest collections of paintings in Elizabethan England, being the first great private collector.Hearn 1995 p. 96; Haynes 1987 p. 199 He was a principal patron of Nicholas Hilliard, as well as interested in all aspects of Italian culture.Hearn 1995 p. 124; Haynes 1992 p. 12 The Earl's circle of scholars and men of letters included, among others, his nephew Philip Sidney, the astrologer and Hermeticist John Dee, his secretaries Edward Dyer and Jean Hotman, as well as John Florio and Gabriel Harvey.Haynes 1987 pp. 76–78, 125–126; Wilson 1981 p. 307 Through Harvey, Edmund Spenser found employment at Leicester House on the Strand, the Earl's palatial town house, where he wrote his first works of poetry.Jenkins 2002 pp. 254–257 Many years after Leicester's death Spenser wistfully recalled this time in his Prothalamion,Jenkins 2002 p. 261 and in 1591 he remembered the late Earl with his poem The Ruins of Time.Adams 2002 p. 149", "In September 1586 there was a skirmish at Zutphen, in which Philip Sidney was wounded. He died a few weeks later. His uncle's grief was great.Haynes 1987 pp. 170–171 In December Leicester returned to England. In his absence, William Stanley and Rowland York, two Catholic officers whom Leicester had placed in command of Deventer and the fort of Zutphen, respectively, went over to Parma, along with their key fortresses—a disaster for the Anglo-Dutch coalition in every respect.Wilson 1981 p. 291 His Dutch friends, as his English critics, pressed for Leicester's return to the Netherlands. Shortly after his arrival in June 1587 the English-held port of Sluis was lost to Parma, Leicester being unable to assert his authority over the Dutch allies, who refused to cooperate in relieving the town.Wilson 1981 pp. 291–294 After this blow Elizabeth, who ascribed it to \"the malice or other foul error of the States\",Wilson 1981 p. 294 was happy to enter into peace negotiations with the Duke of Parma. By December 1587 the differences between Elizabeth and the Dutch politicians, with Leicester in between, had become insurmountable; he asked to be recalled by the Queen and gave up his post.Wilson 1981 pp. 294–295 He was irredeemably in debt because of his personal financing of the war."]}, {"page": "Francis Walsingham", "response": ["The Huguenots and other European Protestant interests supported the nascent revolt in the Spanish Netherlands, which were provinces of Habsburg Spain. When Catholic opposition to this course in France resulted in the death of Huguenot leader Gaspard de Coligny and the St. Bartholomew's Day massacre, Walsingham's house in Paris became a temporary sanctuary for Protestant refugees, including Philip Sidney.Cooper, pp. 77–79; Hutchinson, pp. 48–50 Ursula, who was pregnant, escaped to England with their four-year-old daughter. She gave birth to a second girl, Mary, in January 1573 while Walsingham was still in France.Hutchinson, pp. 33, 51 He returned to England in April 1573,Hutchinson, p. 53 having established himself as a competent official whom the Queen and Cecil could trust.Wilson, pp. 83–84 He cultivated contacts throughout Europe, and a century later his dispatches would be published as The Complete Ambassador.", "Walsingham's younger daughter Mary died aged seven in July 1580;Cooper, p. 46; Hutchinson, p. 347 his elder daughter, Frances, married Sir Philip Sidney on 21 September 1583, despite the Queen's initial objections to the match (for unknown reasons) earlier in the year.Hutchinson, pp. 239–240; Wilson, p. 171 As part of the marriage agreement, Walsingham agreed to pay £1,500 of Sidney's debts and gave his daughter and son-in-law the use of his manor at Barn Elms in Surrey. A granddaughter born in November 1585 was named Elizabeth after the Queen, who was one of two godparents along with Sidney's uncle, Robert Dudley, 1st Earl of Leicester.Hutchinson, p. 240 The following year, Sidney was killed fighting the Spanish in the Netherlands and Walsingham was faced with paying off more of Sidney's extensive debts.Adams et al.; Hutchinson, pp. 241–242; Wilson, pp. 216–217 His widowed daughter gave birth, in a difficult delivery, to a second child shortly afterward, but the baby, a girl, was stillborn.Cooper, p. 321; Hutchinson, pp. 172, 242; Wilson, p. 217", "In his will, dated 12 December 1589, Walsingham complained of \"the greatness of my debts and the mean state [I] shall leave my wife and heirs in\",Hutchinson, p. 253 but the true state of his finances is unclear.Hutchinson, p. 257 He received grants of land from the Queen, grants for the export of cloth and leases of customs in the northern and western ports. His primary residences, apart from the court, were in Seething Lane by the Tower of London (now the site of a Victorian office building called Walsingham House), at Barn Elms in Surrey and at Odiham in Hampshire. Nothing remains of any of his houses.Adams et al. He spent much of his own money on espionage in the service of the Queen and the Protestant cause.Cooper, p. 310; Hutchinson, pp. 47–48, 101, 264; Wilson, pp. 101, 188 In 1586, he funded a lectureship in theology at Oxford University for the Puritan John Rainolds.Hutchinson, pp. 61, 348 He had underwritten the debts of his son-in-law, Sir Philip Sidney,Cooper, p. 310 had pursued the Sidney estate for recompense unsuccessfully and had carried out major land transactions in his later years. After his death, his friends reflected that poor bookkeeping had left him further in the Crown's debt than was fair. In 1611, the Crown's debts to him were calculated at over £48,000, but his debts to the Crown were calculated at over £43,000 and a judge, Sir Julius Caesar, ordered both sets of debts cancelled quid pro quo. Walsingham's surviving daughter Frances received a £300 annuity, and married the Earl of Essex. Ursula, Lady Walsingham, continued to live at Barn Elms with a staff of servants until her death in 1602.Hutchinson, pp. 265–266", "Protestants lauded Walsingham as \"a sound pillar of our commonwealth and chief patron of virtue, learning and chivalry\".Thomas Watson quoted in Hutchinson, p. 261 He was part of a Protestant intelligentsia that included Philip Sidney, Edmund Spenser and John Dee: men who promoted an expansionist and nationalist English Renaissance.Wilson, p. 242 Spenser included a dedicatory sonnet to Walsingham in the Faerie Queene, likening him to Maecenas who introduced Virgil to the Emperor Augustus. After Walsingham's death, Sir John Davies composed an acrostic poem in his memory and Watson wrote an elegy, Meliboeus, in Latin. On the other hand, Jesuit Robert Persons thought Walsingham \"cruel and inhumane\" in his persecution of Catholics.Hutchinson, p. 63 Catholic sources portray a ruthless, devious man driven by religious intolerance and an excessive love for intrigue. Walsingham attracts controversy still.Cooper, pp. 130–131 Although he was ruthless, his opponents on the Catholic side were no less so; the treatment of prisoners and suspects by Tudor authorities was typical of European governments of the time.Hutchinson, pp. 261–264 Walsingham's personal, as opposed to his public, character is elusive; his public papers were seized by the government while many of his private papers, which might have revealed much, were lost. The fragments that do survive demonstrate his personal interest in gardening and falconry.Adams et al.; Cooper, p. 44"]}, {"page": "Literary criticism", "response": ["*Philip Sidney: An Apology for Poetry"]}, {"page": "Shropshire", "response": ["* Sir Philip Sidney, prominent Elizabethan"]}, {"page": "King Lear", "response": ["The source of the subplot involving Gloucester, Edgar, and Edmund is a tale in Philip Sidney's Countess of Pembroke's Arcadia (1580–90), with a blind Paphlagonian king and his two sons, Leonatus and Plexitrus."]}, {"page": "List of poets", "response": ["*Sir Philip Sidney (1554–1586), English poet, courtier and soldier"]}, {"page": "Masque", "response": ["In Scotland, masques were performed at court, particularly at wedding celebrations, and the royal wardrobe provided costumes.Michael Pearce, 'Anna of Denmark: Fashioning a Danish Court in Scotland', The Court Historian, 24:2 (2019) pp. 146, 148-9 After the Union of the Crowns, at the court of James I and Anne of Denmark, narrative elements of the masque became more significant. Plots were often on classical or allegorical themes, glorifying the royal or noble sponsor. At the end, the audience would join with the actors in a final dance. Ben Jonson wrote a number of masques with stage design by Inigo Jones. Their works are usually thought of as the most significant in the form. Samuel Daniel and Sir Philip Sidney also wrote masques."]}, {"page": "The Faerie Queene", "response": ["The poem is dedicated to Elizabeth I who is represented in the poem as the Faerie Queene Gloriana, as well as the character Belphoebe. Spenser prefaces the poem with sonnets additionally dedicated to Sir Christopher Hatton, Lord Burleigh, the Earl of Oxford, the Earl of Northumberland, the Earl of Cumberland, the Earl of Essex, the Earl of Ormond and Ossory, High Admiral Charles Howard, Lord Hunsdon, Lord Grey of Wilton, Lord Buckhurst, Sir Francis Walsingham, Sir John Norris, Sir Walter Raleigh, the Countess of Pembroke (on the subject of her brother Sir Philip Sidney), and Lady Carew."]}, {"page": "Hesperides", "response": ["The Hesperides tend a blissful garden in a far western corner of the world, located near the Atlas mountains in North Africa at the edge of the encircling Oceanus, the world-ocean.A confusion of the Garden of the Hesperides with an equally idyllic Arcadia is a modern one, conflating Sir Philip Sidney's Countess of Pembroke's Arcadia and Robert Herrick's Hesperides: both are viewed by Renaissance poets as oases of bliss, but they were not connected by the Greeks. The development of Arcadia as an imagined setting for pastoral is the contribution of Theocritus to Hellenistic culture: see Arcadia (utopia). According to Pliny the Elder, the garden was located at Lixus, Morocco, which was also the location where Hercules fought against Antaeus."]}, {"page": "Earl of Pembroke", "response": ["His elder son Henry (c. 15341601), who succeeded as 2nd Earl, was president of Wales from 1586 until his death. He married in 1577 Mary Sidney, the famous Countess of Pembroke (c. 1561–1621), third daughter of Sir Henry Sidney and his wife Mary Dudley. Sir Philip Sidney, to whom she was deeply attached through life, was her eldest brother. Sir Philip spent the summer of 1580 with her at Wilton, or at Ivychurch, a favourite retreat of hers close by. Here at her request he began the Countess of Pembroke's Arcadia, which was intended for her pleasure alone, not for publication. The two also worked at a metrical edition of the Psalms. When the great sorrow of her brother's death came upon her she made herself his literary executor, correcting the unauthorized editions of the Arcadia and of his poems, which appeared in 1590 and 1591. She also took under her patronage the poets who had looked to her brother for protection. Spenser dedicated his Ruines of Time to her, and refers to her as \"Urania\" in Colin Clout's come home againe; in Spenser's Astrophel she is \"Clorinda\". In 1599 Queen Elizabeth was her guest at Wilton, and the Countess composed for the occasion a pastoral dialogue in praise of Astraea. After her husband's death she lived chiefly in London at Crosby Hall, where she died."]}, {"page": "Philomela", "response": ["In Sir Philip Sidney's (1554–1586) courtly love poem \"The Nightingale\", the narrator, who is in love with a woman he cannot have, compares his own romantic situation to that of Philomela's plight and claims that he has more reason to be sad. However, recent literary criticism has labelled this claim as sexist and an unfortunate marginalization of the traumatic rape of Philomela. Sidney argues that the rape was an \"excess of love\" and less severe than being deprived of love as attested by the line, \"Since wanting is more woe than too much having.\""]}, {"page": "William Camden", "response": ["Camden was born in London. His father Sampson Camden was a member of The Worshipful Company of Painter-Stainers. He attended Christ's Hospital and St Paul's School, and in 1566 entered Oxford (Magdalen College, Broadgates Hall, and finally Christ Church). At Christ Church, he became acquainted with Philip Sidney, who encouraged Camden's antiquarian interests. He returned to London in 1571 without a degree. In 1575, he became Usher of Westminster School, a position that gave him the freedom to travel and pursue his antiquarian researches during school vacations.", "Camden left his books to his former pupil and friend Sir Robert Cotton, the creator of the Cotton library. His circle of friends and acquaintances included Lord Burghley, Fulke Greville, Philip Sidney, Edmund Spenser, John Stow, John Dee, Jacques de Thou and Ben Jonson, who was Camden's student at Westminster and who dedicated an early edition of Every Man in His Humour to him.Levy 1964.Herendeen 2007, pp. 97, 294–303, 496."]}, {"page": "Tragicomedy", "response": ["In England, where practice ran ahead of theory, the situation was quite different.  In the sixteenth century, \"tragicomedy\" meant the native sort of romantic play that violated the unities of time, place, and action, that glibly mixed high- and low-born characters, and that presented fantastic actions.  These were the features Philip Sidney deplored in his complaint against the \"mungrell Tragy-comedie\" of the 1580s, and of which Shakespeare's Polonius offers famous testimony: \"The best actors in the world, either for tragedy, comedy, history, pastoral, pastoral-comical, historical-pastoral, tragical-historical, tragical-comical-historical-pastoral, scene individuable, or poem unlimited: Seneca cannot be too heavy, nor Plautus too light. For the law of writ and the liberty, these are the only men.\" Some aspects of this romantic impulse remain even in the work of more sophisticated playwrights: Shakespeare's last plays, which may well be called tragicomedies, have often been called romances."]}, {"page": "Sidney, Maine", "response": ["Sidney is a town in Kennebec County, Maine, United States. The population was 4,645 at the 2020 census. Sidney was incorporated as a town on January 30, 1792. The town was named for Sir Philip Sidney, an English author. Sidney is included in the Augusta, Maine micropolitan New England City and Town Area. Since 1937, the town is the home of the New England Music Camp."]}, {"page": "Sidney, Ohio", "response": ["Sidney is a city in Shelby County, Ohio, located approximately 36 mi (58 km) north of Dayton and 100 mi (161 km) south of Toledo. The population was 21,229 at the time of the 2010 census. It is named after English poet Philip Sidney and is the county seat of Shelby County. Many of the city's elementary schools are also named after famous writers, including Ralph Waldo Emerson, Henry Wadsworth Longfellow, and John Greenleaf Whittier. Sidney was the recipient of the 1964 All-America City Award. In 2009, it was the subject of the documentary film 45365.", "The City of Sidney, named after Sir Philip Sidney, a well-known poet and member of British Parliament, was originally a  parcel of land located along the west side of the Great Miami River. This land was donated by Charles Starrett to be used as the site of a new town designated to be the county seat of Shelby County. The area around Sidney was once the richly forested hunting ground of the Shawnee and Miami Indian nations. This fertile area was developed as agricultural lands over time."]}, {"page": "The Tale of Genji", "response": ["Related claims, perhaps in an attempt to sidestep these debates, are that Genji is the \"first psychological novel\" or \"historical novel\", \"the first novel still considered to be a classic\" or other more qualified terms.  However, critics have almost consistently described The Tale of Genji as the oldest, first, and/or greatest novel in Japanese literature,Bryan (1930), 65.Kokusai Bunka Shinkokai (1970), 37. though enthusiastic proponents may have later neglected the qualifying category of in Japanese literature, leading to the debates over the book's place in world literature.  Even in Japan, the Tale of Genji is not universally embraced; the lesser known Ochikubo Monogatari has been proposed as the \"world's first full-length novel\", even though its author is unknown.Kato (1979), pp. 160, 163.  Despite these debates, The Tale of Genji enjoys solid respect among the works of literature, and its influence on Japanese literature has been compared to that of Philip Sidney's Arcadia on English literature."]}, {"page": "Richard Barnfield", "response": ["It is conjectured that he came up to London in 1593, and became acquainted with Watson, Drayton, and perhaps with Edmund Spenser. The death of Sir Philip Sidney had occurred while Barnfield was still a school-boy, but it seems to have strongly affected his imagination and to have inspired some of his earliest verses."]}, {"page": "Jacopo Sannazaro", "response": ["He wrote easily in Latin, in Italian and in Neapolitan, but is best remembered for his humanist classic Arcadia, a masterwork that illustrated the possibilities of poetical prose in Italian, and instituted the theme of Arcadia, representing an idyllic land, in European literature.See the theme Et In Arcadia Ego. Sannazaro's elegant style was the inspiration for much courtly literature of the 16th century, including Sir Philip Sidney's Arcadia."]}, {"page": "John Addington Symonds", "response": ["He practically made his home at Davos, and wrote about it in Our Life in the Swiss Highlands (1891). Symonds became a citizen of the town; he took part in its municipal business, made friends with the peasants, and shared their interests. There he wrote most of his books: biographies of Percy Bysshe Shelley (1878), Philip Sidney (1886), Ben Jonson (1886) and Michelangelo (1893), several volumes of poetry and essays, and a translation of the Autobiography of Benvenuto Cellini (1887)."]}, {"page": "English poetry", "response": ["Among the best known examples of this are Edmund Spenser's The Faerie Queene, which is effectively an extended hymn of praise to the queen, and Philip Sidney's Arcadia. This courtly trend can also be seen in Spenser's Shepheardes Calender. This poem marks the introduction into an English context of the classical pastoral, a mode of poetry that assumes an aristocratic audience with a certain kind of attitude to the land and peasants. The explorations of love found in the sonnets of William Shakespeare and the poetry of Walter Raleigh and others also implies a courtly audience."]}]}}