{"wiki_id": "http://www.wikidata.org/entity/Q3157314", "itemLabel": "Jack Savage", "itemDescription": "English footballer (1929-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Savage_(footballer)", "wikipedia_page": {"main": "John A. Savage (14 December 1929 - January 2009) was an English football goalkeeper who played for Hull City, Halifax Town, Manchester City, Walsall and Wigan Athletic.Savage was signed by Manchester City in November 1953, where he deputised for Bert Trautmann. He was at the club  for more than a year before making his debut, a 2–0 defeat to Newcastle United on 27 December 1954. He also played in the next game against Burnley, but once Trautmann recovered from injury Savage returned to the reserves. His next chance came in April 1956, when he again replaced Trautmann for two matches. Trautmann broke his neck in the 1956 FA Cup Final, giving Savage the opportunity of an extended run in the first team during the 1956–57 season.\nHe was transferred to Walsall in January 1958 for £4,000. In one of his early games for Walsall, an away match at Swindon, he was sent off. He made 51 appearances for Walsall, moving to non-league Wigan in 1959. He spent one season at the club, appearing four times for the club in the Lancashire Combination.", "link_mentions": [{"page": "Bert Trautmann", "response": ["Trautmann's convalescence took several months, resulting in him missing a large part of the 1956–57 season. Jack Savage deputised during his absence.Wallace, Century City – Manchester City Football Club 1957/58, p. 200. At the start of December, Trautmann played two reserve matches, but lacked confidence. He was restored to the first team on 15 December for a match against Wolverhampton Wanderers, but conceded three goals. He struggled to regain his form in the remainder of the season, leading to calls from some fans and media for him to retire. Others criticised the club, believing that Trautmann had been forced to play while still not fully recovered from injury.Rowlands, Trautmann: The Biography, p. 195."]}, {"page": "John Savage", "response": ["* Jack Savage (footballer) (1929–2009), English goalkeeper ", "* Jack Savage (born 1964), baseball player"]}]}}