{"wiki_id": "http://www.wikidata.org/entity/Q3157526", "itemLabel": "Jacob Bright", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Jacob_Bright", "wikipedia_page": {"main": "The Rt Hon. Jacob Bright (26 May 1821 – 7 November 1899) was a British Liberal politician serving as Mayor of Rochdale and later Member of Parliament for Manchester.", "link_mentions": [{"page": "John Bright", "response": ["Bright was born at Greenbank, Rochdale, in Lancashire, England—one of the early centres of the Industrial Revolution. His father, Jacob Bright, was a much-respected Quaker, who had started a cotton mill at Rochdale in 1809. Jacob's father, Abraham, was a Wiltshire yeoman, who, early in the 18th century, moved to Coventry, where his descendants remained. Jacob Bright was educated at the Ackworth School of the Society of Friends, and apprenticed to a fustian manufacturer at New Mills, Derbyshire. John Bright was his son by his second wife, Martha Wood, daughter of a Quaker shopkeeper of Bolton-le-Moors. Educated at Ackworth School, she was a woman of great strength of character and refined taste. There were eleven children of this marriage, of whom John was the eldest surviving son. His younger brother was Jacob Bright, an MP and mayor. His sisters included Priscilla Bright McLaren (whose husband was Duncan McLaren MP) and Margaret Bright Lucas. John was a delicate child, and was sent as a day pupil to a boarding school near his home, kept by William Littlewood. A year at the Ackworth School, two years at Bootham School, York, and a year and a half at Newton, near Clitheroe, completed his education. He learned, he himself said, but little Latin and Greek, but acquired a great love of English literature, which his mother fostered, and a love of outdoor pursuits. In his sixteenth year, he entered his father's mill, and in due time became a partner in the business.", "In Rochdale, Jacob Bright was a leader of the opposition to a local church-rate. Rochdale was also prominent in the movement for parliamentary reform, by which the town successfully claimed to have a member allotted to it under the Reform Bill. John Bright took part in both campaigns. He was an ardent Nonconformist, proud to number among his ancestors John Gratton, a friend of George Fox, and one of the persecuted and imprisoned preachers of the Religious Society of Friends. His political interest was probably first kindled by the Preston election in 1830, in which Edward Stanley, after a long struggle, was defeated by Henry \"Orator\" Hunt."]}, {"page": "List of political families in the United Kingdom", "response": ["*Jacob Bright (1821–1899), MP 1867–1874 1876–1885 1886–1895. Brother of John.Dictionary of National Biography on CD-ROM 1995"]}, {"page": "List of Privy Counsellors (1837–1901)", "response": ["*Jacob Bright (1821–1899)"]}, {"page": "Vaccine hesitancy", "response": ["Because of its greater risks, variolation was banned in England by the 1840 Vaccination Act, which also introduced free voluntary vaccination for infants. Thereafter Parliament passed successive acts to enact and enforce compulsory vaccination. The 1853 act introduced compulsory vaccination, with fines for non-compliance and imprisonment for non-payment. The 1867 act extended the age requirement to 14 years and introduced repeated fines for repeated refusal for the same child. Initially, vaccination regulations were organised by the local Poor Law Guardians, and in towns where there was strong opposition to vaccination, sympathetic Guardians were elected who did not pursue prosecutions. This was changed by the 1871 act, which required Guardians to act. This significantly changed the relationship between the government and the public, and organized protests increased. In Keighley, Yorkshire, in 1876 the Guardians were arrested and briefly imprisoned in York Castle, prompting large demonstrations in support of the \"Keighley Seven\". The protest movements crossed social boundaries. The financial burden of fines fell hardest on the working class, who would provide the largest numbers at public demonstrations. Societies and publications were organized by the middle classes, and support came from celebrities such as George Bernard Shaw and Alfred Russel Wallace, doctors such as Charles Creighton and Edgar Crookshank, and parliamentarians such as Jacob Bright and James Allanson Picton. By 1885, with over 3,000 prosecutions pending in Leicester, a mass rally there was attended by over 20,000 protesters."]}, {"page": "National Liberal Club", "response": ["*Jacob Bright, Liberal MP 1867–74, 1876–85 & 1885–95; founder member."]}, {"page": "Elementary Education Act 1870", "response": ["Firstly, nonconformists objected to their children being taught Anglican doctrine. As a compromise, William Cowper-Temple (pronounced \"Cooper-Temple\"), a Liberal MP, proposed for religious teaching in the new state schools to be non-denominational and so restricted in practice to learning the Bible and a few hymns. The Cabinet accepted that amendment on 14 June 1870, and Gladstone proposed it to the House of Commons two days later. It became the famous Cowper-Temple clause (Section 14 of the Act). HCG Matthew, the editor of Gladstone's diaries, believes that compromise to have hurt Gladstone more deeply than any other that he had to make. However, on 30 June 1870, a stronger amendment by Jacob Bright, a younger brother of John Bright, insisting that religious teaching not be for or against any denomination, was defeated by 251 votes to 130. The supporters of the amendment were all Liberals, and the government won only with Conservative support."]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| Jacob Bright "]}, {"page": "Manchester South West (UK Parliament constituency)", "response": ["| Jacob Bright"]}, {"page": "National Society for Women's Suffrage", "response": ["Jacob Bright suggested in 1871 that it would be useful to create a London based organisation to lobby members of parliament concerning women's suffrage. The Central Committee of the National Society for Women's Suffrage first met on 17 January 1872."]}, {"page": "List of MPs elected in the 1886 United Kingdom general election", "response": ["| Jacob Bright"]}, {"page": "Manchester (UK Parliament constituency)", "response": ["|rowspan=\"2\"| Jacob Bright", "|rowspan=\"3\"| Jacob Bright"]}, {"page": "Records of members of parliament of the United Kingdom", "response": [":Jacob Bright:1876 b, 1886"]}, {"page": "Hugh Birley", "response": ["At the 1868 general election the representation of the Parliamentary Borough of Manchester was increased to three members of parliament. Birley was elected as the first Conservative MP for the town, alongside the two sitting Liberal Party members, Thomas Bazley and Jacob Bright. He retained his seat at the ensuing elections of 1874 and 1880."]}, {"page": "Margaret Bright Lucas", "response": ["Margaret Bright was born on 14 July 1818 at Rochdale, Lancashire. Her father was Jacob Bright (1775–1851), member of the Society of Friends, and a cotton mill proprietor; and her mother, his second wife, Martha Wood (1788–1830).", "A member of a well known Quaker family, several of her ten siblings, including John Bright, Priscilla Bright McLaren and Jacob Bright, became prominent in politics, activism and reform. Her sister in law was Ursual Bright. Educated by the Society of Friends, she commented: ‘I developed slowly for we were strictly brought up and told that \"children should be seen and not heard\"'."]}, {"page": "List of MPs elected in the 1880 United Kingdom general election", "response": ["| Jacob Bright"]}, {"page": "William Romaine Callender", "response": ["He was elected as a member of the first Manchester School Board in 1870, and in 1874 as one of three members of parliament for the Parliamentary Borough of Manchester, defeating the Liberal MP, Jacob Bright."]}, {"page": "List of United Kingdom by-elections (1868–1885)", "response": ["|Jacob Bright"]}, {"page": "Suffragette", "response": ["The Manchester Society for Women's suffrage was formed in January 1867, when Jacob Bright, Rev. S. A. Steinthal, Mrs. Gloyne, Max Kyllman and Elizabeth Wolstenholme met at the house of Dr. Louis Borchardt. Lydia Becker was made Secretary of the Society in February 1867 and Dr. Richard Pankhurst was one of the earliest members of the Executive Committee. An 1874 speaking event in Manchester organised by Becker, was attended by 14-year-old Emmeline Goulden, who was to become an ardent campaigner for women's rights, and later married Dr Pankhurst becoming known as Emmeline Pankhurst."]}, {"page": "List of MPs elected in the 1868 United Kingdom general election", "response": ["| Jacob Bright"]}, {"page": "John Albert Bright", "response": ["J A Bright was the eldest son of the Liberal reformer, orator and statesman,  John Bright. His family were steeped in Radical and reforming politics. His father’s brother, Jacob Bright was Liberal MP for different seats in Manchester between 1867 and 1895. His aunt was Priscilla Bright McLaren (1815-1906) a dedicated campaigner for women’s rights and the wife of Duncan McLaren the Liberal MP for Edinburgh from 1865 to 1881.Edward H Milligan, Priscilla Bright McLaren in Oxford Dictionary of National Biography online; 2004-12 His brother, William Leatham Bright (1851-1910), was Liberal MP for Stoke-on-Trent from 1885 to 1890."]}, {"page": "Sir Joseph Leese, 1st Baronet", "response": ["Leese was a vocal supporter of the unsuccessful Liberal candidate George William Latham in 1873 and 1880, later supporting fellow nonconformist Jacob Bright in his successful re-election bid for Manchester in 1876. "]}, {"page": "Anthony Hailwood", "response": ["Hailwood was born in Rochdale1881 England Census and brought up in Salford, Lancashire, where he worked as a milk boy from the age of four. He also worked as a tier-boy to a block printer for one shilling and sixpence (equal to 7½p) a week. At the age of 8, he worked for Jacob Bright of Rochdale as a half-timer, whereby he spent some time at school, and worked in cotton mills until the age of 15. "]}, {"page": "List of Vanity Fair (British magazine) caricatures (1875–1879)", "response": ["|1877-05-05||Mr Jacob Bright MP||the Apostle to the Women||Spy||S 251||25px"]}, {"page": "List of United Kingdom by-elections (1857–1868)", "response": ["|Jacob Bright"]}, {"page": "Elijah Dixon", "response": ["Elijah Dixon remained politically and socially active into his later years.  In 1871 he was asked to give the address at the dedication of the tomb of noted Chartist Ernest Jones, at whose funeral he had been a pallbearer two years previously alongside Sir Elkanah Armitage and the MPs Thomas Bayley Potter and Jacob Bright.Obituary of Ernest Jones, originally from The Magazine of Biography, reproduced at www.gerald-massey.org.uk He did not arrive in time for the main address, but is recorded as saying that he \"had never known a man whose talents and position were so freely and distinctly sacrificed for the public good\".Ernest Jones at www.chartists-net  He is also said to have remained physically fit into old age, climbing Snaefell at the age of eighty-five and dying the following year after a short illness."]}, {"page": "Agnes Garrett", "response": ["Her younger sister was the leading suffragist Millicent Fawcett. At Jacob Bright's suggestion it was decided to create a London-based organisation to lobby members of parliament concerning women's suffrage. The Central Committee of the National Society for Women's Suffrage first met on 17 January 1872. The first committee included Garrett, as well as Frances Power Cobbe, Priscilla Bright McLaren and Lilias Ashworth Hallett."]}, {"page": "Manchester Society for Women's Suffrage", "response": ["The Manchester Society for Women's Suffrage, whose aim was to obtain the same rights for women to vote for Members of Parliament as those granted to men, was formed at a meeting in Manchester in January 1867. Elizabeth Wolstenholme claimed it had begun in 1865. Lydia Becker was its secretary from February 1867 and Richard Pankhurst was a member of its committee. Founding members of the society were Ursula Mellor Bright and Jacob Bright."]}, {"page": "Priscilla Bright McLaren", "response": ["She was born Priscilla Bright in Rochdale, Lancashire. She came from a Quaker family that believed in educating its women. Her father, Jacob Bright, had risen from weaver to bookkeeper to wealthy cotton manufacturer. His politics remained radical and he passed his activist interest to his children. Her mother, Martha, took an equal part in her husband's business concerns and created essay societies and debating clubs for her children. Skills that they developed in addressing an audience were later put to use by the daughters Margaret and Priscilla, as well as the most famous of the Bright sons, Radical MP John Bright."]}, {"page": "Land Tenure Reform Association", "response": ["Following a launch of a programme by Mill in July 1870, and organisational work in which Thomas Hare and Jacob Bright were involved, the Association held its first public meeting in 1871. A key plank of the Association's programme was taxation of the unearned increment. Mill's advocacy of this measure presaged more radical proposals of the 1880s. His views influenced Arthur Arnold, president of the Free Land League in 1885."]}, {"page": "1894 Birthday Honours", "response": ["*Jacob Bright "]}, {"page": "Lilly Maxwell", "response": ["Maxwell was born around the year 1800 in Scotland, and had originally worked in domestic service before setting up a shop selling crockery. She rented a shop and house at 25 Ludlow Street, Chorlton-upon-Medlock, Manchester which were of high enough monetary value to qualify their occupier under the pre-1867 £10 household borough franchise. Consequently, her name appeared on the list of voters for Manchester in error as the alternate her name, Lilly, was mistaken for that of a man. Her accidental inclusion on the list was discovered by one of the candidates for election, Jacob Bright, a supporter of women's suffrage. Alongside his wife, Ursula Mellor Bright, he was a founder of the Manchester branch of the National Society for Women’s Suffrage, in January 1867. Bright’s election committee alerted Lydia Becker, the society’s secretary, to Maxwell's appearance on the list, and she informed Maxwell of the situation.", "On 26 November 1867, she became the first woman known to have voted at a parliamentary contest since the 1832 Reform Act had specifically limited the franchise to ‘male persons’. The returning officer allowed Maxwell to vote at Chorlton Town Hall in at a by-election. Maxwell cast her vote for Jacob Bright who supported the suffragist cause. At this time, votes had to be spoke out loud and Punch magazine marked this with a ditty \"To the fair Lily Maxwell a bumper, Who in petticoats rushed to the poll, And for Jacob Bright entered her plumper, Mill’s first ‘person’, singular, sole!\" Bright mentioned Maxwell’s vote in his victory speech, describing her as ‘a hardworking honest person, who pays her rates as you do’."]}, {"page": "Ursula Bright", "response": ["Bright was born in 1835 to Joseph and Catherine Mellor. Her father, brother and grandfather, Frederick Pennington M.P., were noted for their support for women's rights. In 1855 she married Jacob Bright who was an M.P. for Manchester. She and her husband were founder members of the Manchester Society for Women's Suffrage in 1867. Alongside Lydia Baker the organisation's Secretary, they encouraged Lilly Maxwell, a widowed shop owner, whose name had mistakenly appeared on the register of voters in Manchester, to cast her vote in a by-election on 26 November 1867, which Bright went on to win.", "Ursula and Jacob Bright had five children, although two sons died very young of diphtheria within a fortnight of each other. Two further sons were born followed by a daughter Esther in 1868."]}, {"page": "Lady Anna Gore-Langton", "response": ["In 1872 she was elected president of the Bath committee of the National Society for Women's Suffrage. She had signed the Mill's petition for universal women's suffrage six years before. In June 1877 she and others were allowed to petition Sir Stafford Northcote, the Chancellor of the Exchequer, concerning a bill to allow women the vote. The bill was presented by Jacob Bright, but it was defeated. Gore-Langton called a meeting to discuss a way forward given the large defeat at her house."]}, {"page": "Anne Ashworth", "response": ["Ashworth grew up in a Quaker family in Bath, Somerset.  Her father, Thomas Ashworth, was a friend of Richard Cobden, while Jacob Bright and John Bright were her uncles, all liberals with an interest in feminism.  Together with her sister, Lilias, Anne signed the 1866 petition for women's suffrage.  A founder member of the London National Society for Women's Suffrage, on the request of Clementia Taylor, Anne and Lilias formed a Bath branch of the group.  Anne served on its executive committee, and when the Central Committee of the National Society for Women's Suffrage was set up in 1872, Anne also sat on its executive.Elizabeth Crawford, The Women's Suffrage Movement: A Reference Guide 1866-1928, pp.20-21"]}, {"page": "Central Committee of the National Society for Women's Suffrage", "response": ["Jacob Bright suggested in 1871 that it would be useful to create a London-based organisation to lobby members of parliament concerning women's suffrage. The Central Committee of the National Society for Women's Suffrage first met on 17 January 1872. The first committee included Frances Power Cobbe, Priscilla Bright McLaren, Lilias Ashworth Hallett and Agnes Garrett. The committee introduced a subscription fee of a shilling per annum. Millicent Fawcett joined the committee in 1874."]}, {"page": "Lilias Ashworth Hallett", "response": ["Ashworth was born in 1844 to Thomas and Sophia (born Bright) Ashworth. Her mother came from an influential Quaker family and her notable siblings included Margaret Bright Lucas, John Bright , Jacob Bright and Priscilla Bright McLaren. Ashworth was rich and had an income from her father's estate. At the time men had to have property to qualify for a vote. Ashworth joked that her property should enable her to have seven votes.", "In 1867 she joined the London Society for Women's Suffrage. Her friends included Lydia Becker and Richard Pankhurst. She was a powerful speaker on the subject of gaining votes for women and she was compared to her uncle Jacob Bright."]}]}}