{"wiki_id": "http://www.wikidata.org/entity/Q3160961", "itemLabel": "James Burke", "itemDescription": "English boxer, born 1809", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Burke_(boxer)", "wikipedia_page": {"main": "James \"Deaf\" Burke (8 December 1809 – 8 January 1845), was one of England's earliest boxing champions. He was also deaf.\n\n", "link_mentions": [{"page": "List of tuberculosis cases", "response": ["*James Burke"]}, {"page": "1839 in sports", "response": ["* 12 February — William \"Bendigo\" Thompson defeats James Burke, who is disqualified for head butting.Cyber Boxing Zone – Bendigo.  Retrieved on 7 November 2009."]}, {"page": "1840 in sports", "response": ["* 22 September — James Burke meets Nicholas Ward at Lillingstone Level for the English Championship title, vacant again following the injury to William \"Bendigo\" Thompson.  In highly controversial circumstances, Ward's backers prevail upon the referee to disqualify Burke in the 17th round for an alleged foul.Cyber Boxing Zone – Nick Ward.  Retrieved on 7 November 2009."]}, {"page": "1836 in sports", "response": ["* James Burke decides to try his luck in America and so the English Championship issue lies unresolved for another three years.Cyber Boxing Zone – James Burke.  Retrieved on 7 November 2009."]}, {"page": "Bare-knuckle boxing", "response": ["The first bare-knuckle champion of England was James Figg, who claimed the title in 1719 and held it until his retirement in 1730. Before Jack Broughton, the first idea of current boxing originated from James Figg, who is viewed as the organizer of cutting edge boxing. In 1719, he set up a 'pugilistic foundation' and charged himself as 'a professional in the Noble Science of Defense' to instruct boxers on the utilization of clench hands, sword, and quarterstaff. Noted champions were Jack Broughton, Elizabeth Wilkinson, Daniel Mendoza, Jem Belcher, Hen Pearce, John Gully, Tom Cribb, Tom Spring, Jem Ward, James Burke, William \"Bendigo\" Thompson, Ben Caunt, William Perry, Tom Sayers and Jem Mace.", "* James Burke (boxer) 1833-1839"]}, {"page": "1838 in sports", "response": ["* Caunt claims the English Championship after defeating Bendigo but is not recognised because of the prior claim of James Burke, who has now returned to England from America; meanwhile, Jem Ward continues his refusal to formally surrender the title even though he has long retired.Cyber Boxing Zone – James Burke.  Retrieved on 7 November 2009."]}, {"page": "1837 in sports", "response": ["* With James Burke now operating in America, attention shifts to the upcoming Ben Caunt and William \"Bendigo\" Thompson who each win two fights in 1837, but there remains no resolution to the English title issue.Cyber Boxing Zone – James Burke.  Retrieved on 7 November 2009."]}, {"page": "1835 in sports", "response": ["* Still trying to resolve the English Championship title issue, James Burke has two scheduled fights but neither can take place.  First, Harry Preston refuses to fight him; and then Young Langan is arrested on the eve of his fight for assaulting a police officer.Cyber Boxing Zone – James Burke.  Retrieved on 7 November 2009."]}, {"page": "1834 in sports", "response": ["* Still trying to fight Jem Ward for the English Championship, James Burke travels from town to town giving boxing exhibitions to raise the money.  Ward, who refuses to fight Burke, keeps raising the stakes to avoid the fight.  The question of the title remains unresolved with Ward officially retired and Burke under a stigma following the death of Simon Byrne in 1833.Cyber Boxing Zone – James Burke.  Retrieved on 7 November 2009."]}, {"page": "James Burke", "response": ["James Burke may refer to:", "*James Burke (Australian politician) (born 1971), member of the Northern Territory Legislative Assembly", "*James Burke (Cork politician) (died 1936), Irish Cumann na nGaedhael politician and barrister ", "*James Burke (Roscommon politician) (died 1964), Irish Fine Gael politician and farmer", "*James Burke (boxer) (1809–1845), English boxer", "*James Burke (cricketer) (born 1991), English cricketer", "*James Burke (19th-century footballer), 19th-century football player", "*James Burke (footballer, born 1994), football player currently playing for Hyde United", "*James Burke (Dublin hurler), inter county senior hurler with Dublin", "*James Burke (Kildare hurler) (born 1999), Irish hurler", "*James Burke (wrestler) (1936-2006), American Olympic wrestler", "*James Burke (baseball), American baseball player for the 1884 Boston Reds", "*James Burke (bishop) (1926–1994), American-born Catholic bishop in Peru", "*James Burke (science historian) (born 1936),  British broadcaster, author, and television producer", "*James Burke (actor) (1886–1968), appeared in The Maltese Falcon and numerous other films ", "*James Burke (gangster) (1931–1996), Irish-American gangster", "*E. James Burke (born 1949), justice of the Wyoming Supreme Court", "*James Burke (space engineer) (born 1925), lunar settlement and exploration expert, known for the Ranger program"]}, {"page": "William Thompson (boxer)", "response": ["William Abednego \"Bendigo\" Thompson (11 October 1811 – 23 August 1880) was an English bare-knuckle boxer who won the heavyweight championship of England from James Burke on 12 February 1839.  He was inducted into The Ring magazine Hall of Fame in 1955, the International Boxing Hall of Fame in 1991, and the Bare Knuckle Boxing Hall of Fame in 2011.", "| James Burke"]}, {"page": "Simon Byrne", "response": ["Byrne fought in an era when English boxing, although illegal, was patronised by many powerful individuals. Its patronage and popularity did not, however, free it from corruption, heavy betting, and staged fights. Byrne fought eight recorded matches, but accounts of his career focus on the last three, against the Scottish champion Alexander McKay, the English champion Jem Ward, and James Burke for the vacant championship of England. The injuries McKay received in his fight with Byrne resulted in his death the following day, and rioting in his home country of Scotland. Byrne went on to lose his next match against Jem Ward, which some commentators believed he was not sufficiently in condition to fight. His final contest in May 1833 was a gruelling 99 rounds against James Burke that lasted for 3 hours and 6 minutes, the longest ever recorded prize fight. Byrne died three days later as the result of damage to his brain caused by the beating he had received.", "Jem Ward announced his retirement from the ring in a letter published in the 29 January edition of Bell's Life in London. He was succeeded as champion of England by James Burke, although some disputed Burke's right to the title as Ward had refused to fight him before retiring. Standing  tall, weighing 200 lb (90 kg), and handicapped by deafness, Burke had assumed the championship after defeating Harry Macone in one of the prolonged and brutal fights for which he was known. Ward, who had faced public criticism for his refusal to fight Burke, felt that Byrne was the better fighter and promised to acknowledge the victor of a fight between Burke and Byrne as the new champion. The match took place on 30 May 1833 on Nomansland, a tract of common land between the villages of Sandridge and Wheathampstead in Hertfordshire, for a prize of £100 to each man. To get himself into condition for the fight, Byrne had reduced his weight from  to , an effort that \"as it was effected by hard work and sweating, somewhat impaired his natural stamina, especially as, his habits being far from abstemious when in Ireland, he was scarcely fitted to undergo the necessary amount of labour\". Despite his hard work Byrne looked \"fleshy\", with \"no special show of muscle\", compared to Burke's \"perfect condition\", although he did have a slight height advantage. Burke weighed in at , and started the contest as the marginal favourite at odds of 5–4."]}, {"page": "Jem Ward", "response": ["His 1831 retirement was forced. Ward had  received criticism for refusing to face the younger challenger, James Burke, and rather than fight he retired and relinquished his title.  However he did not relinquish to Burke his championship belt, when pressed he agreed to hand it over to the victor of Burke's match against his last adversary  Simon Byrne in 1833.  However, Ward refused to hand over the belt when Burke beat Byrne who Ward supported.  Byrne, who had been knocked unconscious died three days later after the fight, Burke was tried and acquitted of his murder, but Ward still refused to part with the championship belt.Cyberboxing He finally handed the belt over to William ‘Bendigo’ Thompson at the Queen’s Theatre in Liverpool following the latter's defeat of Burke in 1839.East Side Boxing."]}, {"page": "Nicholas Ward (boxer)", "response": ["His first recorded fight was in 1835 against Harry John Lockyer. In 1840 he fought his brother's old enemy James Burke; Burke was a feared and dangerous fighter, who had killed one opponent, the champion Simon Byrne.  Following the match Jem Ward had refused to fight Burke, would not hand over the championship belt or acknowledge Burke as the heavyweight champion, even after he was acquitted of murder.  Nick Ward won the bout against Burke when his gang of supporters forced the referee to disqualify Burke for an alleged foul.  This winning pattern was repeated when in February 1841 Ward became heavyweight champion. He beat Ben Caunt, the reigning champion, when Caunt was disqualified, after the referee succumbed to pressure from the crowd claiming Caunt hit Ward while he was down.  In May of the same year Caunt legitimately beat Ward and regained his title. At this time boxing was governed by the less than arduous London Prize Ring rules. The more strict and fair Queensbury rules were not implemented until much later in the century."]}, {"page": "Tom Spring", "response": ["On the second occasion he seconded for Byrne, in 1833, Byrne was fighting James Burke for the heavyweight title. This was the longest fight in boxing history until the famous bout between Andy Bowen and Jack Burke in 1893, which went 111 rounds. It was brutal and bloody, but vast sums were riding on the fight.  In the 99th round Spring had to carry the barely conscious Byrne to the mark to fight.  Byrne was quickly knocked unconscious and died three days later.  The death finally led to a reform in the rules governing English boxing."]}, {"page": "1833 in sports", "response": ["* 30 May — James Burke defeats Simon Byrne in 99 rounds.  There are serious concerns about Byrne's health  in the aftermath of the fight.Cyber Boxing Zone – James Burke.  Retrieved on 7 November 2009."]}, {"page": "1832 in sports", "response": ["* 25 June — Jem Ward announces his retirement when challenged by James Burke for his English title.  Ward nevertheless refuses to concede the title.Cyber Boxing place – Jem Ward.  Retrieved on 7 November 2009."]}, {"page": "List of last words (19th century)", "response": [":— Simon Byrne, Irish bare-knuckle boxer (2 June 1833), dying after fight against James Burke"]}]}}