{"wiki_id": "http://www.wikidata.org/entity/Q3161523", "itemLabel": "Jamie Blackley", "itemDescription": "Manx actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jamie_Blackley", "wikipedia_page": {"main": "Jamie Alexander Blackley (born 8 July 1991) is a British actor. He is known for his role as Adam Wilde in the film If I Stay.", "link_mentions": [{"page": "Woody Allen", "response": ["From July to August 2014 Allen filmed the mystery drama Irrational Man in Newport, Rhode Island, with Joaquin Phoenix, Emma Stone, Parker Posey and Jamie Blackley. Allen said that this film, as well as the next three he had planned, had the financing and full support of Sony Pictures Classics. His next film, Café Society, starred an ensemble cast, including Jesse Eisenberg, Kristen Stewart, and Blake Lively. Bruce Willis was set to co-star, but was replaced by Steve Carell during filming. The film is distributed by Amazon Studios, and opened the 2016 Cannes Film Festival on May 11, 2016, the third time Allen has opened the festival."]}, {"page": "Douglas, Isle of Man", "response": ["* Jamie Blackley (born 1991 in Douglas) a British actor, known for his role as Adam Wilde in the film If I Stay"]}, {"page": "Kenichi Suzumura", "response": ["*If I Stay – Adam Wilde (Jamie Blackley)"]}, {"page": "1991 in the United Kingdom", "response": ["* 8 July – Jamie Blackley, Manx-born Actor"]}, {"page": "Adam Lasus", "response": ["In August 2014, Lasus was the music producer for the film If I Stay, starring Chloë Grace Moretz and Jamie Blackley. Lasus produced six original songs and a cover of the song \"Today\" by Smashing Pumpkins, that were performed by the fictional band, Willamette Stone, in the film led by Jamie Blackley's character, Adam Wilde. The songs were all released on the If I Stay Original Motion Picture Soundtrack on Warner Brothers/ Water Tower Records."]}, {"page": "List of Manx people", "response": ["*Jamie Blackley (born 1991), actor of screen, television and stage"]}, {"page": "Spring Awakening (musical)", "response": ["| Jamie Blackley"]}, {"page": "Screen International", "response": ["* Jamie Blackley"]}, {"page": "List of people from the Isle of Man", "response": ["*Jamie Blackley (8 July 1991)"]}, {"page": "Apparitions (TV series)", "response": ["* Zaid Kopavic: Jamie Blackley"]}, {"page": "Toby Regbo", "response": ["Critical reception for uwantme2killhim? produced by Bryan Singer, typically centered upon Regbo and his co-star Jamie Blackley's acting, with the Screen Daily commenting that the two delivered \"strong performances\". Variety praised his performance commenting \"The impressive Regbo is on surer footing as a meek geek with some surreptitious social skills\". Maitland McDonagh, from Film Journal International, also complimented the duo noting \"Stars Blackley and Regbo are the film's core strength, despite long scenes in which they speak aloud what they're typing into their computers that would tax the skills of many older and more experienced actors\"."]}, {"page": "List of Elstree Studios productions", "response": ["| Uwantme2killhim? || Drama-thriller || Andrew Douglas Company, Anonymous, Bad Hat Harry || Andrew Douglas || Jamie Blackley, Toby Regbo, Joanne Froggatt"]}, {"page": "List of British films of 2013", "response": ["|| Director: Sara Sugarman, Cast: Phil Daniels, Keith Allen, Jamie Blackley", "|| Director: Justin Edgar   Cast: Michael Smiley, Amber Anderson, Jamie Blackley, Rosamund Hanson, Hera Hilmar, Mike Bailey, Sean Teale", "|| Director: Andrew Douglas   Cast: Jamie Blackley, Toby Regbo, Joanne Froggatt, Jaime Winstone, Amy Wren"]}, {"page": "Vinyl (2012 film)", "response": ["The film features a number of past pop and rock stars in cameo roles, such as Steve Diggle (Buzzcocks), Jynine James, Mike Peters and Tim Sanders (The City Zones), along with the actors Phil Daniels, Keith Allen, Perry Benson, Jamie Blackley and Julia Ford."]}, {"page": "If I Stay (film)", "response": ["* Jamie Blackley as Adam Wilde"]}, {"page": "Irrational Man (film)", "response": ["Irrational Man is a 2015 American crime mystery drama film written and directed by Woody Allen, and starring Joaquin Phoenix, Emma Stone, Parker Posey and Jamie Blackley. The film was released on July 17, 2015, by Sony Pictures Classics in a limited release, later expanding wider.", "* Jamie Blackley as Roy", "On May 2, 2014, it was announced that Woody Allen would write and direct an upcoming film in which Joaquin Phoenix would star. On May 6, Emma Stone joined the cast, marking her second film collaboration with Allen, as she previously co-starred in Allen's romantic comedy Magic in the Moonlight in 2014. On July 24, Parker Posey and Jamie Blackley also joined the cast of the film, which Allen produced along with his sister Letty Aronson and Stephen Tenenbaum."]}, {"page": "Uwantme2killhim?", "response": ["uwantme2killhim? (also known as U Want Me 2 Kill Him? and stylised as Uwantme2killhim?) is a 2013 British drama-thriller film directed by Andrew Douglas. The film stars Jamie Blackley and Toby Regbo and premiered at the Edinburgh International Film Festival, where the two actors won the Best performance in a British feature film award. The film is loosely based on a true story and follows two teenage schoolboys who are drawn into a complicated world of online chatrooms, eventually leading to bizarre consequences.", "In 2003, Detective Inspector Sarah Clayton (Joanne Froggatt) tries to establish why British schoolboy Mark (Jamie Blackley) would want to stab John (Toby Regbo). The two were supposed to be friends, yet Mark claims that the crime was necessary. As she looks deeper into the crime and the two teenagers, she discovers that Mark frequented chatrooms and became fascinated with Rachel (Jaime Winstone), a woman he met in one such room. With her prompting he agrees to make friends with her brother John. Mark quickly begins to fall for her, sympathising with her tales of domestic abuse by her boyfriend Kevin (Mingus Johnston) while believing that they cannot meet because she is in a witness protection program.", "*Jamie Blackley as Mark"]}, {"page": "We Are the Freaks", "response": ["We Are the Freaks is a 2013 British film written, produced and directed by Justin Edgar. It is a surreal and anarchic anti-teen film about three misfits having the night of their lives. It stars Jamie Blackley, Michael Smiley, Sean Teale, Amber Anderson, Rosamund Hanson and Adam Gillen. The film premiered at the 2013 Edinburgh International Film Festival in official competition for the Michael Powell Award. It is set in November 1990 against the backdrop of Margaret Thatcher's resignation.", "* Jamie Blackley as Jack"]}, {"page": "Kids in Love (film)", "response": ["Kids in Love is a British coming of age drama directed by Chris Foggin in his feature-length debut from a screenplay by Sebastian de Souza, and Preston Thompson. It stars Will Poulter, Alma Jodorowsky, Jamie Blackley, Sebastian de Souza, Preston Thompson, Cara Delevingne and Gala Gordon. The film is about a group of young friends in London, imitating art and enjoying a fast-paced lifestyle. The film had its world premiere on 22 June 2016, at the Edinburgh International Film Festival. The film was released in a limited release and through video on demand on 26 August 2016, by Signature Entertainment.", "*Jamie Blackley as Tom"]}, {"page": "List of American films of 2015", "response": ["|Woody Allen (director/screenplay); Jamie Blackley, Joaquin Phoenix, Parker Posey, Emma Stone"]}, {"page": "List of British films of 2016", "response": ["|| Director: Chris Foggin  Cast: Will Poulter, Alma Jodorowsky, Jamie Blackley,  Cara Delevingne"]}, {"page": "2014 Teen Choice Awards", "response": ["* Jamie Blackley and Chloë Grace Moretz — presented Choice Movie Actor: Sci-Fi/Fantasy"]}, {"page": "The Last Kingdom (TV series)", "response": ["|Jamie Blackley|| Eardwulf || colspan=\"3\"  || colspan=\"1\" ", "* Jamie Blackley as Eardwulf, the commander of Lord Æthelred's household troops (series 4)"]}, {"page": "And While We Were Here", "response": ["And While We Were Here is a 2012 American romantic drama film written and directed by Kat Coiro and starring Kate Bosworth, Jamie Blackley and Iddo Goldberg. It was filmed on the island of Ischia. The film premiered at the 2012 Tribeca Film Festival and showed at the Locarno Film Festival. It released to Ultra VOD on August 13, 2012, and to theatres on September 13, 2013.", "*Jamie Blackley as Caleb"]}, {"page": "Sigurdur Thordarson", "response": ["The film The Fifth Estate (2013), with Benedict Cumberbatch as Assange, features a character based on Thordarson's played by Jamie Blackley. Thordarson is mentioned in Domscheit-Berg's book, during his time with WikiLeaks he reportedly used the handles PenguinX, Singi201 and \"Q\"."]}, {"page": "The Halcyon", "response": ["* Jamie Blackley as Lord Freddie Hamilton, a newly qualified RAF fighter pilot and owner of The Halcyon"]}, {"page": "Blackley (surname)", "response": ["*Jamie Blackley (born 1991), British actor"]}, {"page": "Traitors (TV series)", "response": ["*Jamie Blackley as Freddie Symonds, Feef's brother, a closeted gay man, and an unsuccessful Conservative Party parliamentary candidate"]}, {"page": "Becoming Elizabeth", "response": ["* Jamie Blackley as Robert Dudley", "In October 2020, Alicia von Rittberg joined the cast of the series. In May 2021, Romola Garai, Jessica Raine, Tom Cullen, Bella Ramsey, Oliver Zetterström, John Heffernan, Jamie Blackley, Jacob Avery, Alexandra Gilbreath, Leo Bill, Ekow Quartey, Alex Macqueen and Oliver Huband joined the cast of the series."]}]}}