{"wiki_id": "http://www.wikidata.org/entity/Q316354", "itemLabel": "Patrick Leahy", "itemDescription": "athletics competitor", "wikipedia_url": "https://en.wikipedia.org/wiki/Patrick_Leahy_(athlete)", "wikipedia_page": {"main": "Patrick Joseph (\"Pat\") Leahy (20 May 1877 – 29 December 1927) was an Irish athlete who won Olympic medals (for Great Britain and Ireland) in the high jump and long jump at the 1900 Summer Olympics.Leahy was born in Creggane, in the Civil parish of Hackmys, in the barony of Coshma near Kilmallock in County Limerick, near the border between County Limerick and County Cork. He was one of seven brothers all of whom were sportsmen. His brother Con won medals in jumping at two Olympic Games. Another brother, Timothy, also jumped competitively. Patrick broke the British high jump record in Dublin in 1898 with a jump of 6 ft. 4in. (1.93m), he went on to win the British AAA high jump title in 1898 and 1899, and also came third in the long jump in 1899. Leahy also competed internationally in the long jump and the hop, step and jump (triple jump).In the 1900 Olympic Games in Paris, Leahy took part in three jump disciplines. He won the silver medal in the high jump behind Irving Baxter of the United States, and the bronze medal in the long jump behind Alvin Kraenzlein and Myer Prinstein, he also finished fourth place in the triple jumps behind Prinstein, James Connolly and Lewis Sheldon.Eight years later, Leahy was back on the Olympic scene when he competed at the 1908 Summer Olympics, held in London, he entered the high jump again, but unfortunately he only finished ninth in the qualifying so didn't advance to the final, unlike his brother Con Leahy who went on to win the silver medal.In 1909 Patrick and Con Leahy emigrated to the United States. Patrick died there in 1927, aged 50.", "link_mentions": [{"page": "Athletics at the 1900 Summer Olympics – Men's high jump", "response": ["The men's high jump was a track & field athletics event at the 1900 Summer Olympics in Paris. It was held on July 15, 1900. Eight athletes from seven nations competed in the high jump. The event was won by Irving Baxter of the United States, the nation's second consecutive victory in the men's high jump. Great Britain (Patrick Leahy's silver) and Hungary (Lajos Gönczy's bronze) each took medals in their first appearance in the event.", "This was the second appearance of the event, which is one of 12 athletics events to have been held at every Summer Olympics. None of the jumpers from 1896 returned. Irving Baxter of the United States was the 1900 AAA champion, while Patrick Leahy of Great Britain had won in 1898 and 1899.", "|  ||align=left| Patrick Leahy ||align=left|  || o || o || o || o || o || x ||colspan=3  || 1.78 || "]}, {"page": "Athletics at the 1900 Summer Olympics – Men's long jump", "response": ["The men's long jump was a track & field athletics event at the 1900 Summer Olympics in Paris. It was held on July 14 and July 15, 1900. 12 athletes from six nations competed in the long jump. The event was won by Alvin Kraenzlein of the United States, the second consecutive victory for the American team. Myer Prinstein, also an American, took silver. Patrick Leahy, an Irish athlete competing for Great Britain, took bronze; it was the first long jump medal for a non-American athlete as the United States had swept the 1896 medals.", "|  ||align=left| Patrick Leahy ||align=left|  || 6.710 || 6.950 || 6.950 || "]}, {"page": "Athletics at the 1900 Summer Olympics – Men's triple jump", "response": ["| 4 ||align=left| Patrick Leahy ||align=left|  || Unknown || "]}, {"page": "List of Limerick people", "response": ["*Patrick Leahy, athlete, Olympic Medallist with Great Britain & Ireland – high jump silver (1900), long jump bronze (1904)"]}, {"page": "Great Britain at the 1900 Summer Olympics", "response": ["|rowspan=3|Patrick Leahy"]}, {"page": "Athletics at the 1908 Summer Olympics – Men's high jump", "response": ["|align=center| 9 || Patrick Leahy ||  ||align=center| 1.78"]}, {"page": "Con Leahy", "response": ["In 1909 Con and Patrick Leahy emigrated to the United States. Con died in Manhattan in 1921. In 2006, to mark the 100th anniversary of his Olympic medal win, a memorial was unveiled in Thomas Street, Limerick.Limerick County Council annual report 2006 "]}, {"page": "Great Britain at the 1908 Summer Olympics", "response": ["| 7th ||align=left| Patrick Leahy || 1.78 metres"]}, {"page": "Lajos Gönczy", "response": ["Between 1900 and 1904, Gönczy held four national high jump records, aged 19 years old Gönczy traveled to Paris for the 1900 Summer Olympics, in the high jump there was no qualification it was straight to the final, Gönczy jumped 1.75 metres to finish third behind Irving Baxter and Patrick Leahy to earn the bronze medal. Four years later he went to St.Louis for the 1904 Summer Olympics, this time in the high jump he missed out on a medal by just 2 centimetres when he jumped 1.75 metres and finished fourth, Gönczy also competed in the standing high jump but only jumped 1.35 metres and finished last out of the competitors, he would compete in the same two events two years later at the 1906 Intercalated Games, in the high jump he finished in silver medal place just behind Con Leahy, he also went on to finish fifth again in the standing high jump."]}, {"page": "Patrick Leahy (disambiguation)", "response": ["Patrick Leahy (born 1940) is an American politician, serving as a United States Senator from Vermont.", "Patrick Leahy may also refer to:", "* Patrick Leahy (bishop) (1806–1875), Roman Catholic Archbishop of Cashel", "* Patrick Leahy (Australian politician) (1860–1927), Queensland politician", "* Patrick Leahy (athlete) (1877–1927), Irish Olympic athlete"]}, {"page": "Index of World War II articles (P)", "response": ["# Patrick Leahy (athlete)"]}, {"page": "List of Olympic competitors from Ireland who represented other countries", "response": ["*Patrick Leahy"]}]}}