{"wiki_id": "http://www.wikidata.org/entity/Q3161420", "itemLabel": "James Stanier Clarke", "itemDescription": "English cleric and naval author", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Stanier_Clarke", "wikipedia_page": {"main": "James Stanier Clarke (1766–1834) was an English cleric, naval author and man of letters. He became librarian in 1799 to George, Prince of Wales (later Prince Regent, then George IV).", "link_mentions": [{"page": "Jane Austen", "response": ["Austen learned that the Prince Regent admired her novels and kept a set at each of his residences. In November 1815, the Prince Regent's librarian James Stanier Clarke invited Austen to visit the Prince's London residence and hinted Austen should dedicate the forthcoming Emma to the Prince. Though Austen disliked the Prince Regent, she could scarcely refuse the request.Austen letter to James Stannier Clarke, 15 November 1815; Clarke letter to Austen, 16 November 1815; Austen letter to John Murray, 23 November 1815, in Le Faye (1995), 296–298. Austen disapproved of the Prince Regent on the account of his womanising, gambling, drinking, spendthrift ways and generally disreputable behaviour.Halperin (1985), 734 She later wrote Plan of a Novel, according to Hints from Various Quarters, a satiric outline of the \"perfect novel\" based on the librarian's many suggestions for a future Austen novel.Litz (1965), 164–165; Honan (1987), 367–369, describes the episode in detail. Austen was greatly annoyed by Clarke's often pompous literary advice, and the Plan of A Novel parodying Clarke was intended as her revenge for all of the unwanted letters she had received from the royal librarian."]}, {"page": "John Lockhart-Ross", "response": ["Lockhart was born on 11 November 1721 at Lockhart Hall, Lanarkshire, the fifth son of Sir James Lockhart, 2nd Baronet.James Stanier Clarke and Stephen Jones, \"The Naval Chronicle\" (Page 44); Published by J. Gold, 1801 His mother, Grizel, was the third daughter of William Ross, 12th Lord Ross.  Lockhart joined the navy in September 1735, serving first aboard the 50-gun  under Captain Henry Osborne. He transferred to the 50-gun  under Captain Charles Knowles in the West Indies between 1737 and 1738, and went on to serve aboard the 54-gun  under Captain Henry Medley in 1739, and the 14-gun sloop  under Captain Frogmere in 1740. Lockhart followed Frogmere to several of his ships, serving under him aboard the 20-gun  and then the 54-gun . He passed his lieutenant's examination on 28 September 1743, and received his commission with a posting on 21 October that year to the 44-gun  in the North Sea, and afterwards on the coast of North America. While serving on the North American station he was moved into the 50-gun  and returned to England with her in late 1746."]}, {"page": "Earl of Dover", "response": ["*James Stanier Clarke, Life of James II, 2 vols. (London, 1816); "]}, {"page": "Henry Jermyn, 1st Baron Dover", "response": ["*James Stanier Clarke, Life of James II, 2 vols. (London, 1816);"]}, {"page": "Deputy Clerk of the Closet", "response": ["* James Stanier Clarke 1816–1817"]}, {"page": "Alexander Murray (linguist)", "response": ["To the Edinburgh Review of 1803 Murray contributed a review of Charles Vallancey's Prospectus of an Irish Dictionary; to the number for January 1804 he furnished an article on James Stanier Clarke's Progress of Maritime Discovery; and in January 1805 he discussed Thomas Maurice's History of Hindostan. His Letters to Charles Stuart, M.D., appeared in 1813. He figures as a lyrist on his \"Native Vale\" in Malcolm McLachlan Harper's Bards of Galloway."]}, {"page": "Joseph Whidbey", "response": ["Whidbey was appointed Master Attendant at Sheerness in 1799. His innovative salvage of the  was the subject of a paper read to the Royal Society in 1803. In 1804 he received the prestigious appointment as Master Attendant at Woolwich, one of the Royal Navy's greatest dockyards. In 1805, Whidbey became a Fellow of the Royal Society, sponsored by a long list of distinguished men of science: Alexander Dalrymple, James Rennell, William Marsden, James Stanier Clarke, Sir Gilbert Blane, Mark Beaufoy, Joseph Huddart, and John Rennie."]}, {"page": "Reception history of Jane Austen", "response": ["Novel-writing was a suspect occupation for women in the early 19th century, because it imperiled their social reputation by bringing them publicity, viewed as unfeminine. Therefore, like many other female writers, Austen published anonymously.Fergus, 13–14. Eventually, though, her novels' authorship became an open secret among the aristocracy.Le Faye, Family Record, 225. During one of her visits to London, the Prince Regent invited her, through his librarian, James Stanier Clarke, to view his library at Carlton House; his librarian mentioned that the Regent admired her novels and that \"if Miss Austen had any other Novel forthcoming, she was quite at liberty to dedicate it to the Prince\".Qtd. in Le Faye, Family Record, 226; also see Jane Austen to J. S. Clarke, 11 December 1815, courtesy of janeausten.co.uk, 17 July 2011. Austen, who disapproved of the prince's extravagant lifestyle, did not want to follow this suggestion, but her friends convinced her otherwise: in short order, Emma was dedicated to him. Austen turned down the librarian's further hint to write a historical romance in honour of the prince's daughter's marriage.Le Faye, Family Record, 227."]}, {"page": "James Clarke", "response": ["*James Stanier Clarke (1766–1834), English cleric, author and librarian to the Prince of Wales"]}, {"page": "Dean and Canons of Windsor", "response": ["*31. James Stanier Clarke 1821–1834"]}, {"page": "Legacy of Horatio Nelson, 1st Viscount Nelson", "response": ["Hastily written tributes appeared across the country immediately after the news arrived, in papers, pamphlets and books.  Samuel Taylor Coleridge, then at Naples, produced an obituary essay on the death of Alexander Ball, one of Nelson's captains whom he had known, and commented on Nelson's qualities. An official biography was written by John McArthur and James Stanier Clarke and published in 1809. This was followed by a work by Robert Southey in 1813, and Lord Byron wrote in his 1819 poem Don Juan that 'Nelson was Britannia's god of war'. In the 1840s Nicholas Harris Nicolas drew up and published Nelson's collected correspondence. Thomas Carlyle's earliest works included a brief biographical sketch of Nelson, and he returned to consider Nelson in his 1839 work Heroes and Hero Worship. Thomas Pettigrew, capitalising on a resurgence of interest in Nelson, produced a new biography in the 1840s. Herman Melville references Nelson many times throughout his works, including Omoo (Chs. 15,29), Mardi (Chs. 24,30), Redburn (Chs. 29, 31, 32, 36, 41), White-Jacket (Chs. 6, 16, 27, 36, 38, 50, 52, 68, 74, 75), Moby-Dick (Chs. 8,35), and Billy Budd (Ch. 4). J. K. Laughton produced several works on Nelson in the late 19th century, and in 1897 Alfred Thayer Mahan published his Life of Nelson, which rapidly became a best seller."]}, {"page": "Horatio Nelson, 1st Viscount Nelson", "response": ["Nelson has been frequently depicted in art and literature; appearing in paintings by Benjamin West and Arthur William Devis, and in books and biographies by John McArthur, James Stanier Clarke and Robert Southey.Lambert 2004, p. 323 Nelson is also celebrated and commemorated in numerous songs, written both during his life and following his death. Nelson's victory in the Battle of the Nile is commemorated in \"The Battle of the Nile: a favourite patriotic song\".Fielding, J. W. \"The Battle of the Nile: a Favorite Patriotic Song.\" New York: Printed & sold at J. Hewitt's Musical Repository, No. 59 Maiden Lane, 1804. Thomas Attwood's \"Nelson's Tomb: A Favourite Song\" commemorates Nelson's death in the Battle of Trafalgar.Attwood, Thomas and Thomas Cory \"Nelson's Tomb : a Favourite Song, Sung by Mr. Incledon\" London: Printed & sold by Goulding & Company. 117 New Bond St. & Westmorland St. Dublin"]}, {"page": "List of fellows of the Royal Society A, B, C", "response": ["| James Stanier Clarke||19/04/1792||? 1765 – 4 October 1834"]}, {"page": "Naval Chronicle", "response": ["The founders were James Stanier Clarke and John McArthur, and the editorial staff included Stephen Jones and his brother John Jones (father of John Winter Jones). Contributors included Francis Gibson, and Charles Vinicombe Penrose under initials as pseudonyms. Nicholas Pocock provided a long series of illustrations."]}, {"page": "Plan of a Novel, according to Hints from Various Quarters", "response": ["In 1815 Austen met the Rev. James Stanier Clarke in London. He had ideas for her fiction, including a novel to be based on a clergyman with a foothold in urban life, as well as the provincial rural settings she had used so far for clerics in her novels.Collins, p. 1. At the time (October 1815) she was staying with her brother in London negotiating the publication of Emma, which was then dedicated to the Prince Regent through the good offices of Clarke, who was the Prince's librarian. Among Clarke's suggestions was a historical novel on the House of Coburg: Austen side-stepped with a disclaimer about her talents.Claire Lamont, Jane Austen and the Old, The Review of English Studies New Series, Vol. 54, No. 217 (Nov., 2003), pp. 661-674, at p. 663. Published by: Oxford University Press. Stable URL: https://www.jstor.org/stable/3661480  Clarke recommended that Austen should dedicate Emma to the Prince Regent.  She did this, although she disapproved of his attitude towards his wife.Austen wrote in a letter to Martha Lloyd on 16 February 1813 of the Prince's infidelities and his wife: \"I am resolved at least always to think that she would have been respectable, if the Prince had behaved only tolerably by her at first.\""]}, {"page": "Stanier Clarke", "response": ["#REDIRECT James Stanier Clarke"]}, {"page": "Edward Clarke (author)", "response": ["In 1763 Clarke married Anne, daughter of Thomas Grenfield of Guildford, Surrey. He left three sons: the Rev. James Stanier Clarke, Edward Daniel Clarke, and George, of the Royal Navy, who drowned in the River Thames in 1806. His only daughter, Anne, was married to Captain William Standway Parkinson, RN (1769–1838), who was with Nelson at the battle of Trafalgar."]}, {"page": "John McArthur (Royal Navy officer)", "response": ["McArthur's major literary work, with James Stanier Clarke, was the Life of Lord Nelson, 1809, 2 vols. In 1799, also with Clarke, he founded the monthly Naval Chronicle, which ran to forty half-yearly volumes; it was mainly devoted to current naval matters, and biographical notes of the leading naval officers of the day, who often supplied material themselves. So far as it treats of contemporary events or persons, it is of very high authority. Other works were:"]}]}}