{"wiki_id": "http://www.wikidata.org/entity/Q3161173", "itemLabel": "Ian Trethowan", "itemDescription": "BBC executive", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Trethowan", "wikipedia_page": {"main": "Sir James Ian Raley Trethowan (20 October 1922 – 12 December 1990) was a British journalist, radio and television broadcaster and administrator who eventually became Director-General of the BBC from 1 October 1977 to 31 July 1982, having previously been managing director of BBC network radio from 1970 to 1976.\n\n", "link_mentions": [{"page": "Roy Jenkins", "response": ["The Director-General of the BBC, Ian Trethowan, invited Jenkins to deliver the Richard Dimbleby Lecture for 1979, which he did on 22 November.Campbell, Roy Jenkins: A Well-Rounded Life, p. 508. The title Jenkins gave to his lecture, \"Home Thoughts from Abroad\", derived from a Robert Browning poem. He delivered it in the Royal Society of Arts and it was broadcast live on television.Campbell, Roy Jenkins: A Well-Rounded Life, pp. 510–511. Jenkins analysed the decline of the two-party system since 1951 and criticised the excessive partisanship of British politics, which he claimed alienated the bulk of voters, who were more centrist.Campbell, Roy Jenkins: A Well-Rounded Life, pp. 511–512. He advocated proportional representation and the acceptance of \"the broad line of division between the public and private sectors\", a middle way between Thatcherism and Bennism.Campbell, Roy Jenkins: A Well-Rounded Life, pp. 512–513. Jenkins said that the private sector should be encouraged without too much interference to create as much wealth as possible \"but use the wealth so created both to give a return for enterprise and to spread the benefits throughout society in a way that avoids the disfigurements of poverty, gives a full priority to public education and health services, and encourages co-operation and not conflict in industry and throughout society\".Campbell, Roy Jenkins: A Well-Rounded Life, pp. 513–514. He then reiterated his long-standing commitment to libertarianism:"]}, {"page": "BBC Radio", "response": ["|1970|| Ian Trethowan"]}, {"page": "BBC Television Shakespeare", "response": ["Almost immediately upon pitching the idea to his colleagues, however, Messina began to encounter problems. He had anticipated that everyone in the BBC would be excited about the concept, but this did not prove so. In particular, the Drama/Plays division felt the series could not possibly be a financial success without international sales, which they did not see as likely. Furthermore, they argued that Shakespeare on television rarely worked, and they were of the opinion that there was simply no need to do all thirty-seven plays, as many were obscure and would not find an audience amongst the general public, even in England. Disappointed with their lack of enthusiasm, Messina went over the departmental heads, forwarding his proposal directly to Director of Programmes, Alasdair Milne and Director-General, Ian Trethowan, both of whom liked the idea.Willis, p. 4. Although there were still reservations within the BBC, and although Messina's decision to bypass the accepted hierarchy would not be forgotten, with the support of Milne and Trethowan, the series was greenlighted, with its daunting scope championed as part of its appeal; \"it was a grand project, no one else could do it, no one else would do it, but it ought to be done.\"Willis, p. 5. Writing several months into production, journalist Henry Fenwick wrote the project was \"gloriously British, gloriously BBC.\"", "Jonathan Miller planned on directing this episode himself, with fairies inspired by the work of Inigo Jones and Hieronymus Bosch, but he directed Timon of Athens instead, after original director Michael Bogdanov quit that production. Elijah Moshinsky based his fairies on the baroque eroticism of Rembrandt and Peter Paul Rubens; in particular Rembrandt's Danaë was used as the inspiration for Titania's bed. Fashioning a darker production than is usual for this play, Moshinsky referred to the style of the adaptation as \"romantic realism.\" He disliked productions which portrayed Puck as a mischievous but harmless and lovable sprite, so he had Phil Daniels play him as if he were an anti-establishment punk.Willis, p. 69. It has long been rumoured, but never confirmed, that in his portrayal of Peter Quince, actor Geoffrey Palmer was imitating the soon-to-retire Director General of the BBC, Ian Trethowan.Willis, p. 72."]}, {"page": "Director-General of the BBC", "response": ["| Sir Ian Trethowan"]}, {"page": "BBC Radio 3", "response": ["In 1969, two hundred members of the BBC staff protested to the director general at changes which would 'emasculate' Radio 3, while managing director of radio Ian Trethowan described the station in a memorandum as \"a private playground for elitists to indulge in cerebral masturbation\". Later, former Radio 3 controller John Drummond complained that the senior ranks of the BBC took no interest in what he was doing.Drummond (2001), p.365"]}, {"page": "1964 United Kingdom general election", "response": ["The election night was broadcast live by the BBC, and was presented for the fifth and final time by Richard Dimbleby, with Robin Day, Ian Trethowan, Cliff Michelmore and David Butler. "]}, {"page": "1966 United Kingdom general election", "response": ["The election night was broadcast live on the BBC, was presented by Cliff Michelmore, Ian Trethowan, Robin Day, Robert McKenzie and David Butler. The election was replayed on the BBC Parliament channel on the 40th anniversary of the event, and again in 2016 to mark the 50th anniversary of the election."]}, {"page": "1959 United Kingdom general election", "response": ["The 1959 general election was the first election to be covered by commercial television in the United Kingdom. The ITV network provided election night coverage from the studios of Independent Television News (ITN) in London, with ITV given permission by the Independent Television Authority to use all of the ITV companies on air in 1959 for election links to the main studio in London. Ian Trethowan was the presenter for the ITV coverage."]}, {"page": "World in Action", "response": ["Soon after she became Conservative Party leader, Margaret Thatcher was said to have told the BBC Director General, Sir Ian Trethowan, that she considered World in Action to consist of \"just a lot of Trots. Panorama, however, are bastards.\""]}, {"page": "Alasdair Milne", "response": ["Before going to university Milne did his National Service as an officer in the Gordon Highlanders. He joined the BBC in September 1954 as a graduate trainee after his wife spotted a BBC advertisement.Philip Purser Obituary: Alasdair Milne, The Guardian, 9 January 2013 He was taken under the wing of Grace Wyndham Goldie who recruited, trained, guided and encouraged many well-known BBC broadcasters and current affairs executives. Milne was one of the so-called \"Goldie Boys\", a group of producers and presenters, which included Huw Wheldon, Robin Day, David Frost, Cliff Michelmore, Ian Trethowan and Richard Dimbleby."]}, {"page": "Panorama (British TV programme)", "response": ["In December 2011, it was revealed that former BBC Director General Sir Ian Trethowan had met with the chiefs of MI5 and the Secret Intelligence Service about an episode of Panorama dealing with the security services in 1981. He showed a video recording of the original programme to Bernard Sheldon, then legal adviser to MI5. The latter suggested cuts to the programme and Trethowan asked the head of BBC News to reduce the programme to half its length."]}, {"page": "Alastair Hetherington", "response": ["Hetherington's time as Controller of BBC Scotland was not a happy one. He did much to invigorate programme output and appointed a number of specialist News correspondents including Helen Liddell and Chris Baur to try to increase Scotland's presence on the BBC networks  . He also sought increased financial freedom from the BBC in London.  Encountering a more bureaucratic organisation than the one he knew at The Guardian, he clashed with the director general of the BBC, Charles Curran. In 1978 he was sacked from the position by Curran's successor, Ian Trethowan and named as Manager of BBC Radio Highland. In 1982 he became research professor in media studies at Stirling University and in 1984 he succeeded Richard Scott as chairman of the Scott Trust. In 1989 he retired to the Isle of Arran, where he wrote and worked on projects before he was forced to give up such activities due to the onset of Alzheimer's disease in the mid-1990s."]}, {"page": "William Davis (journalist)", "response": ["During this time Davis made regular appearances on the BBC's live Budget programmes presented by Ian Trethowan. Davis provided live comment and analysis of the Chancellor of the Exchequer's Budget speech as it was delivered in the House of Commons. There were no microphones or cameras in Parliament at the time, so details were relayed to the BBC studio via a teleprinter."]}, {"page": "List of people educated at Christ's Hospital", "response": ["*Sir Ian Trethowan – Former Director-General of the BBC and journalist"]}, {"page": "Andrew Birkin", "response": ["Having worked on an adaptation of Peter Pan for NBC in 1975, Birkin conceived and wrote The Lost Boys (1978), a 3-part mini-series for the BBC about Peter Pan's creator J.M. Barrie, which won him writing awards from the Writers Guild of Great Britain and the Royal Television Society. The critic Sean Day-Lewis wrote in the Daily Telegraph, 'I doubt if biography has ever been better televised than in this sensitive and beautifully crafted masterpiece, and I am quite sure such excellence is beyond any other television service in the world.'The Daily Telegraph, 30 October 1978 The BBC's Director-General Sir Ian Trethowan called it 'a landmark in television drama'.The Guardian, 6 November 1978 Birkin has also written a biographical account of Barrie's relationship with the Llewelyn Davies family, J. M. Barrie and the Lost Boys (1979; 2nd edition 2003), described by The Oxford Companion to Children's Literature as 'the most candid and perceptive biography to have been written of Barrie'.Humphrey Carpenter & Mari Prichard, The Oxford Companion to Children's Literature, 1984 Birkin also hosts Barrie's official website on behalf of the Great Ormond Street Hospital, to whom he donated his Barrie/Llewelyn Davies/Peter Pan archive in 2004.Sotheby's Catalogue, English Literature, including the Archive of J. M. Barrie and The Lost Boys, 16 December 2004"]}, {"page": "The Lost Boys (miniseries)", "response": ["The film was cited in several annual round-ups, including Benny Green in Punch: 'Best Original Drama: The Lost Boys, which advanced from competence to brilliance to deep compassion and mastery of touch, and which, for intensity of characterization and economy of writing, was a masterpiece of the televisual form.'Punch, 20 December 1978 The BBC’s Director-General Sir Ian Trethowan called it 'a landmark in television drama'.The Guardian, 6 November 1978"]}, {"page": "BBC Persian", "response": ["Mohammad Reza Pahlavi and his supporters became critical of the BBC in creating the environment for the popular upheaval that eventually led to the Iranian Revolution in February 1979. The Shah frequently sent telegrams to the BBC about Persian Service reporting. The Iranian Ambassador in London, Parviz Radji, tried to tone down these complaints recognising the BBC was acting independently, but had many meetings with the top management of the BBC in the late 1970s, including the Director-General Ian Trethowan. In the year before the revolution the Persian Service interviewed the major contenders: one with Ayatollah Khomeini, three or four with Prime Minister Shapur Bakhtiar and two with Karim Sanjabi, leader of the National Front who were seeking a peaceful democratic transition from the Shah's rule."]}, {"page": "1982 in British television", "response": ["*26 July – Alasdair Milne succeeds Ian Trethowan as Director-General of the BBC."]}, {"page": "1977 in British television", "response": ["*1 October – Ian Trethowan succeeds Charles Curran as Director-General of the BBC."]}, {"page": "Kenith Trodd", "response": ["During a short period at Granada Television, he produced Home and Away (1972), written by Julia Jones and directed by Roy Battersby and Donald McWhinnie.  Trodd returned to the BBC, and worked on Play for Today. On an annual freelance contract, it was not renewed in 1976. The BBC's Personnel Department objected to Trodd's political contacts; he had attended meetings in the early 1970s of the Workers' Revolutionary Party, which attracted a small minority in the media, but Trodd had never joined the organisation. A letter signed by Trodd's colleagues was sent to Alasdair Milne, Director of Programmes, Television, and Ian Trethowan, Director General of the BBC. The BBC backed down and Trodd was reappointed. The WRP was the Socialist Labour League until 1973, but the source uses the later form."]}, {"page": "Horserace Betting Levy Board", "response": ["* Sir Ian Trethowan (1980–1991)"]}, {"page": "Gerard Mansell", "response": ["In October 1979, with the Director-General, Ian Trethowan, recovering from a heart attack, Mansell found himself in controversy. A television crew from Panorama had filmed the Provisional IRA manning a makeshift roadblock in Carrickmore. Newly elected Prime Minister Margaret Thatcher, determined to deny the \"oxygen of publicity\" to the IRA, complained to the BBC governors. Managing director of Television Alasdair Milne was on leave, so the governors called in Mansell and ordered him to discipline Panorama editor Roger Bolton. Shocked at the apparently casual manner in which the film unit operated, Mansell fired him. The National Union of Journalists called a strike of BBC members and Milne quickly returned, but Mansell satisfied himself that the film was not meant to be used (and had not even been processed), and reinstated Bolton with a reprimand, to the fury of both the governors and the government."]}, {"page": "Trethowan", "response": ["* Ian Trethowan (1922–1990), British television executive"]}, {"page": "Margaret Elizabeth Douglas", "response": ["Douglas also worked as a director, producer and researcher for the programmes Gallery and 24 Hours, and impressed enough to be given the responsibility of covering the proceedings of party conferences for the BBC in 1972. This entailed working several hours in Blackpool, Brighton and Bournemouth and caused multiple rows between irate politicians about the coverage; Douglas was able to calm their concerns. She picked up on a majority of gossip and ensured more interesting parts of the conferences were broadcast. Douglas arranged tributes for the retiring journalist Ian Trethowan from the leading British politicians of the time. She left the role in 1983, and Alasdair Milne, the Director-General of the BBC, appointed her as his chief assistant in the same year as he knew her from Lime Grove Studios. This made Douglas responsible for the BBC's relations with political parties. In 1984, she negotiated with the House of Lords on how proceedings in the upper house of Parliament should be televised. Douglas felt it should be broadcast in segments in a way that had no interference with proceedings."]}]}}