{"wiki_id": "http://www.wikidata.org/entity/Q3161534", "itemLabel": "Jamie Hamilton", "itemDescription": "rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Jamie_Hamilton_(rugby_union)", "wikipedia_page": {"main": "James Garth Hamilton (born 1 July 1970) was a professional rugby union scrum half who played for Leicester Tigers from 1900 to 2003. During this time, he featured in two Heineken Cup finals in 2001 and 2002 as well as two Pilkington Cup finals at Twickenham. \nHamilton played 184 games for Leicester where he played in five Premiership title winning campaigns.\nHamilton made his Tigers debut against Nuneaton on 29 December 1990 and ended his playing career with Nuneaton in 2004.\nHe was also a keen Sevens player and represented England national rugby sevens team at Hong Kong and during the 2001 World Series.In 2008, he moved to New Zealand to take up a position as a Performance Analyst with the Crusaders in Super Rugby.\nIt was during this time that he worked with the Māori All Blacks travelling to the UK in 2012, USA and Canada in 2013 and Japan in 2014. \nIn 2015, he left the Crusaders to become the All Blacks Performance Analyst.", "link_mentions": [{"page": "2000–01 Heineken Cup", "response": ["Going into the final stages of the game, the scores were level at 27–27. A drop goal from Diego Domínguez then put Stade three points ahead.  Meanwhile, Leicester brought on replacement scrum-half Jamie Hamilton for starting fly-half Andy Goode, with starting scrum-half Austin Healey switching to fly-half. Glenn Gelderbloom was also brought on at outside centre, with Leon Lloyd switching from outside centre to wing."]}, {"page": "Jamie Hamilton", "response": ["Jamie Hamilton may refer to:", "*Jamie Hamilton (publisher) (1900–1988), British book publisher, rower and Olympic medalist", "*Jamie Hamilton (motorcycle racer) (born 1991), Northern Irish motorcycle racer", "*Jamie Hamilton, a character in the television series Galactica 1980", "*Jamie Hamilton (rugby union) (born 1970), an English rugby player for Leicester Tigers who appeared in the 2001 Heineken Cup Final", "*Jamie Hamilton (footballer) (born 2002), Scottish footballer"]}, {"page": "2001 Heineken Cup Final", "response": ["Going into the final stages of the game, the scores were level at 27–27. A drop goal from Diego Domínguez then put Stade three points ahead.  Meanwhile, Leicester brought on replacement scrum-half Jamie Hamilton for starting fly-half Andy Goode, with starting scrum-half Austin Healey switching to fly-half. Glenn Gelderbloom was also brought on at outside centre, with Leon Lloyd switching from outside centre to wing.", "|SH ||17 || Jamie Hamilton || || "]}, {"page": "2002 Heineken Cup Final", "response": ["|SH ||9 || Jamie Hamilton || || "]}, {"page": "Aadel Kardooni", "response": ["Iranian born Aadel left his homeland to avoid national service, and eventually wound up in Leicester where he became Tigers' long-serving scrum half. A very agile scrum half with a bullet pass, Aadel was a regular in the Midlands and England A squads but a full cap eluded him throughout his career. Aadel could always be relied on throughout the early to mid nineties but struggled when the game became professional, and slipped down the pecking order behind Austin Healey and Jamie Hamilton before moving on to pastures new. His last appearance in a Tigers shirt was as a late substitution in the Pilkington Cup final triumph over Sale in 1997.http://www.leicestertigers.com/forum/viewtopic.php?t=11472&sid=059264be53396d67b7842f39866410c5&PHPSESSID=7d02e0d8d1f4315 ..."]}, {"page": "2000–01 Premiership Rugby", "response": ["|17|| Jamie Hamilton"]}, {"page": "1993–94 Pilkington Cup", "response": ["| ||Q|| Jamie Hamilton"]}, {"page": "1995–96 Pilkington Cup", "response": ["| ||Q|| Jamie Hamilton"]}, {"page": "Leicester Tigers in cup finals", "response": ["| ||Q|| Jamie Hamilton", "| ||Q|| Jamie Hamilton", "|SH ||17 || Jamie Hamilton || || ", "|SH ||9 || Jamie Hamilton || || "]}]}}