{"wiki_id": "http://www.wikidata.org/entity/Q3177025", "itemLabel": "Jennifer Bate", "itemDescription": "British concert organist", "wikipedia_url": "https://en.wikipedia.org/wiki/Jennifer_Bate", "wikipedia_page": {"main": "Jennifer Lucy Bate  (11 November 1944 – 25 March 2020) was a British concert organist. She is known for recording the complete organ works by Olivier Messiaen, guided by the composer, but also recorded, among others, English organ music, and the complete organ works of César Franck, Felix Mendelssohn and Peter Dickinson.", "link_mentions": [{"page": "1944 in music", "response": ["*November 11 – Jennifer Bate, concert organist (d. 2020)"]}, {"page": "Fortismere School", "response": ["* Jennifer Bate, concert organist"]}, {"page": "George Thalben-Ball", "response": ["He was twice married: firstly, in 1926, to painter Grace Evelyn Chapman, (1888–1961) with whom he had a daughter (Evelyn Pamela, also a painter, 1927–2012) and a son (John Michael, 1932–2004); secondly, in 1968, to the concert organist Jennifer Bate (1944-2020) (marriage annulled 1972).Rennert, Jonathan (1979).George Thalben-Ball. Newton Abbott: David & Charles. pp. 141, 172."]}, {"page": "List of organists", "response": ["* Jennifer Bate (1944–2020)"]}, {"page": "Thomas Roseingrave", "response": ["* From Voluntarys and Fugues made on Purpose for the Organ or Harpsichord (1728): Voluntary No. 2 in G minor. Recorded by Jennifer Bate (org) on Unicorn-Kanchana DKP 9096 (CD, 1990).", "* [From same] Fugue No. 13 in E minor. Recorded by Jennifer Bate (org) on Unicorn-Kanchana DKP 9104 (CD, 1991)."]}, {"page": "Unicorn-Kanchana", "response": ["The label specialised mainly in classical music and film soundtracks. Artists signed to the label included Andrzej Panufnik, Jascha Horenstein, Jennifer Bate, Henry Herford and Peter Maxwell Davies. The label also released several recordings of lesser-known British composers, including Havergal Brian, George Dyson and Cipriani Potter. Additionally, under licence it released four discs of recordings made in London by the American composer Alan Hovhaness, thereby introducing the composer to a European  audience."]}, {"page": "Manor Hall, Bristol", "response": ["* Dr. Jennifer Bate OBE, concert organist"]}, {"page": "Organ Sonata (Elgar)", "response": ["The Organ Sonata in its original form has been recorded by, among others, Jennifer Bate, Christopher Bowers-Broadbent, Carlo Curley, Harold Darke, Gareth Green, Christopher Herrick, Donald Hunt,on the organ of Worcester Cathedral, for which it was originally written Nicholas Kynaston, James Lancelot, Thomas Murray, Simon Preston, Wolfgang Rübsam, Arturo Sacchetti, John Scott, Herbert Sumsion, Robert Quinney and Thomas Trotter."]}, {"page": "Tollington School", "response": ["* Jennifer Bate OBE, concert organist"]}, {"page": "Jennifer Lucy Bate", "response": ["#Redirect Jennifer Bate"]}, {"page": "David Sonin", "response": ["On 28 February 2009, a memorial concert was given in David's honour at University College School, Hampstead. Performers included Jennifer Bate and Cecilia McDowall."]}, {"page": "Bate (surname)", "response": ["*Jennifer Bate (1944–2020), English organist"]}, {"page": "List of music students by teacher: K to M", "response": ["As well as being a prominent composer, the Frenchman Olivier Messiaen was a noted teacher of musical analysis, harmony and composition at the Paris Conservatoire from the 1940s until he retired in 1978. He also taught classes at the Darmstadt new music summer school in 1949 and 1950. This list of students of Olivier Messiaen contains some of the musicians who (like Pierre Boulez, Yvonne Loriod and George Benjamin) attended his classes, or who (like Peter Hill and Jennifer Bate) studied privately with the composer or collaborated with him in preparation for their performances of his music."]}, {"page": "Willem Tanke", "response": ["In 1984 he sent a recording of Olivier Messiaen's Livre d'orgue to the composer and received an enthusiastic letter from Messiaen's wife, the pianist Yvonne Loriod, assisting him to obtain a scholarship from the Dutch government and the Prins Bernhard Foundation for advanced studies of Messiaen's organ works, which he undertook with Jennifer Bate in London and  in Düsseldorf in the late '80s."]}, {"page": "2020 in the United Kingdom", "response": ["*25 March – Jennifer Bate, 75, concert organist."]}, {"page": "Deaths in March 2020", "response": ["*Jennifer Bate, 75, British concert organist, cancer.The organist Jennifer Bate has died"]}, {"page": "2020 in British music", "response": ["* 25 March – Jennifer Bate, classical organist, 75"]}, {"page": "2020 in classical music", "response": ["* 25 March – Jennifer Bate, British organist, 75"]}, {"page": "Jennifer Bates", "response": ["#redirect Jennifer Bate"]}]}}