{"wiki_id": "http://www.wikidata.org/entity/Q3177701", "itemLabel": "Jessie Pope", "itemDescription": "British poet, writer and journalist (1868-1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jessie_Pope", "wikipedia_page": {"main": "Jessie Pope (18 March 1868 - 14 December 1941) was an English poet, writer, and journalist, who remains best known for her patriotic, motivational poems published during World War I. Wilfred Owen wrote his 1917 poem Dulce et Decorum est to Pope, whose literary reputation has faded into relative obscurity as those of war poets such as Owen and Siegfried Sassoon have grown.\n\n", "link_mentions": [{"page": "Horatius Cocles", "response": ["Horatius figures prominently in Jessie Pope's 1915 poem \"The Longest Odds\" about the exploits of a highlander who single-handedly clears an entire German trench before being killed. His actions are likewise compared to both the Spartans and the Roman defenders."]}, {"page": "1915 in literature", "response": ["*Jessie Pope – Jessie Pope's War Poems and More War Poems"]}, {"page": "World War I in literature", "response": ["From the war itself until the late 1970s, the genre of war poetry was almost exclusively reserved for male poets. This was based on an idea of an exclusive authenticity limited to the works of those who had fought and died in the war. It excluded other forms of experience in the war, such as mourning, nursing and the home front, which were more likely to be experienced by other demographics such as women. There were over 500 women writing and publishing poetry during World War I. Examples of poems by female poets include Teresa Hooley's A War Film, Jessie Pope's War Girls, and Mary H.J. Henderson's An Incident. In addition to giving women greater access to work, the war also gave women greater artistic freedom and space to express their identities as artists."]}, {"page": "Dulce et Decorum est", "response": ["Throughout the poem, and particularly strong in the last stanza, there is a running commentary, a letter to Jessie Pope, a civilian propagandist of World War I, who encouraged—\"with such high zest\"—young men to join the battle, through her poetry, e.g. \"Who's for the game?\""]}, {"page": "War correspondent", "response": ["*Jessie Pope; was a pro war journalist and poet during the first world war."]}, {"page": "Pope (disambiguation)", "response": ["*Jessie Pope, English poet"]}, {"page": "Robert Tressell", "response": ["Kathleen mentioned her father's novel in the presence of a visitor to the house where she worked,  Introduction, p. x . Peter Miles, Oxford World Classics, The Ragged Trousered Philanthropists, writer Jessie Pope, who recommended it to her publisher, Grant Richards. In April 1914, the publisher bought the rights to the book for £25, and it appeared in Britain, Canada and the United States later that year, in the Soviet Union in 1920, and in Germany in 1925. The version as originally published was heavily abridged by Pope, with much of the socialist ideology removed. In retrospect, Richards wrote of the book being 'extraordinarily real' and  'damnably subversive'. Pope's version ended with the novel's hero, Frank Owen, contemplating suicide.  Introduction, p. x . Peter Miles, Oxford World Classics, The Ragged Trousered Philanthropists,"]}, {"page": "North London Collegiate School", "response": ["*Jessie Pope (1868–1941)(poet)"]}, {"page": "Dulce et decorum est pro patria mori", "response": ["*Perhaps the most famous modern use of the phrase is as the title of a poem, \"Dulce et Decorum est\", by British poet Wilfred Owen during World War I. Owen's poem describes a gas attack during World War I and is one of his many anti-war poems that were not published until after the war ended. In the final lines of the poem, the Horatian phrase is described as \"the old lie\". It is believed, and illustrated by the original copy of the poem, that Owen intended to dedicate the poem ironically to Jessie Pope, a popular writer who glorified the war and recruited \"laddies\" who \"longed to charge and shoot\" in simplistically patriotic poems like \"The Call\"."]}, {"page": "The Ragged-Trousered Philanthropists", "response": ["Noonan completed The Ragged-Trousered Philanthropists in 1910, but the 1,600-page hand-written manuscript was rejected by the three publishing houses to which it was submitted. The rejections severely depressed Noonan, and Kathleen Noonan had to save the manuscript from being burnt by keeping it in a metal box under her bed. After her father died of tuberculosis, she showed the manuscript to a friend, the writer Jessie Pope. Pope recommended the book to her own publisher, Grant Richards, who bought the rights in April 1914 for £25 (equal to approximately £2,959.06 in 2021).https://www.measuringworth.com/calculators/ukcompare/ A much-abridged version was published that year in the United Kingdom, and an even-more-abridged version — 90,000 words, from the original 250,000 — in 1918.Oxford World's Classics edition, 2005, edited and with an introduction by Peter Miles. It was also published in Canada and the United States in 1914, in the Soviet Union in 1920, and in Germany in 1925. The publisher removed much of the socialist ideology from the first edition. An unabridged edition with Noonan's original ending was published in 1955, edited by F. C. Ball, who also wrote two biographies of Tressell, Tressell of Mugsborough (1951), and One of the Damned: The Life and Times of Robert Tressell (1973)."]}, {"page": "Vanity Fair (magazines)", "response": ["Bowles wrote much of the magazine himself under various pseudonyms such as \"Jehu Junior\", but contributors included Lewis Carroll, Willie Wilde, P. G. Wodehouse, Jessie Pope and Bertram Fletcher Robinson (editor: June 1904 – October 1906)."]}, {"page": "1916 in poetry", "response": ["* Jessie Pope, Simple Rhymes for Stirring Times"]}, {"page": "1915 in poetry", "response": ["* Jessie Pope, Jessie Pope's War Poems and More War Poems"]}, {"page": "List of people from Leicester and Leicestershire", "response": ["*Jessie Pope (writer and poet)"]}, {"page": "Bertram Fletcher Robinson", "response": ["Obituaries were published in The World, The Times, Daily Express, The Western Guardian, The Western Morning News, The Sphere, The Athenaeum, The Illustrated London News, The Mid-Devon and Newton Times, Vanity Fair, The Book of Blues and the Annual Report of the Jesus College Cambridge Society (1907). The English poet and journalist, Jessie Pope also wrote the following eulogy to Robinson, which was published in the Daily Express newspaper on Saturday 26 January 1907:"]}, {"page": "Who's for the Game?", "response": ["#REDIRECT Jessie Pope#War poetry"]}, {"page": "Vanity Fair (British magazine)", "response": ["Bowles wrote much of the magazine himself under various pseudonyms, such as \"Jehu Junior\", but contributors included Lewis Carroll, Arthur Hervey, Willie Wilde, P. G. Wodehouse, Jessie Pope and Bertram Fletcher Robinson (who was editor from June 1904 to October 1906)."]}, {"page": "British women's literature of World War I", "response": ["*Jessie Pope"]}, {"page": "Jessie (given name)", "response": ["* Jessie Pope (1868–1941), English World War I poet"]}]}}