{"wiki_id": "http://www.wikidata.org/entity/Q3179405", "itemLabel": "Jo Joyner", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Jo_Joyner", "wikipedia_page": {"main": "Joanne Mary Joyner (born 24 May 1977) is an English actress. She is known for her roles as Tanya Branning in the BBC soap opera EastEnders and Mandy Carter in Channel 4 drama Ackley Bridge. Since 2018, she has starred as Luella Shakespeare in the BBC crime drama series Shakespeare & Hathaway: Private Investigators.\n\n", "link_mentions": [{"page": "EastEnders", "response": ["The show often includes strong, brassy, long-suffering women who exhibit diva-like behaviour and stoically battle through an array of tragedy and misfortune. Such characters include Angie Watts (Anita Dobson), Kathy Beale (Gillian Taylforth), Sharon Watts (Letitia Dean), Pat Butcher (Pam St Clement), Kat Slater (Jessie Wallace), Denise Fox (Diane Parish), Tanya Branning (Jo Joyner) and Linda Carter (Kellie Bright). Conversely there are female characters who handle tragedy less well, depicted as eternal victims and endless sufferers, who include Ronnie Mitchell (Samantha Womack), Little Mo Mitchell (Kacey Ainsworth), Laura Beale (Hannah Waterman), Sue Osman (Sandy Ratcliff), Lisa Fowler (Lucy Benjamin) and Mel Owen (Tamzin Outhwaite). The 'tart with a heart' is another recurring character. Often their promiscuity masks a hidden vulnerability and a desire to be loved. Such characters have included Pat Butcher (Pam St Clement) (though in her latter years, this changed), Tiffany Mitchell (Martine McCutcheon), Kat Slater (Jessie Wallace), Stacey Slater (Lacey Turner), Dawn Swann (Kara Tointon), Roxy Mitchell (Rita Simons), Whitney Dean (Shona McGarty) and Lauren Branning (Jacqueline Jossa).", "In March 2008, scenes showing Tanya Branning (Jo Joyner) and boyfriend, Sean Slater (Robert Kazinsky), burying Tanya's husband Max (Jake Wood) alive, attracted many complaints. The UK communications regulator Ofcom later found that the episodes depicting the storyline were in breach of the 2005 Broadcasting Code. They contravened the rules regarding protection of children by appropriate scheduling, appropriate depiction of violence before the 9 p.m. watershed and appropriate depiction of potentially offensive content. In September 2008, EastEnders began a grooming and paedophilia storyline involving characters Tony King (Chris Coghill), Whitney Dean (Shona McGarty), Bianca Jackson (Patsy Palmer), Lauren Branning (Madeline Duggan) and Peter Beale (Thomas Law). The storyline attracted over 200 complaints."]}, {"page": "Banbury", "response": ["* Actress Jo Joyner grew up in Bloxham and studied at the Warriner School. She is best known as Tanya Branning in EastEnders."]}, {"page": "List of Doctor Who supporting characters", "response": ["*Lynda Moss (Jo Joyner)Lynda Moss appears in the Ninth Doctor episodes \"Bad Wolf\" & \"The Parting of the Ways\", a scene from which is shown again as a flashback in the Tenth Doctor episode \"Journey's End\"."]}, {"page": "CAFOD", "response": ["* Jo Joyner"]}, {"page": "Rose d'Or", "response": ["| Comedy || F: Jo Joyner in Swinging || Five || UK"]}, {"page": "Walford", "response": ["The Dagmar at 10 Turpin Road is first mentioned in 1986 and seen in 1987 when James Willmott-Brown (William Boyde) takes over and turns it into a wine bar. After James rapes Kathy Beale (Gillian Taylforth), the bar is burnt down on the orders of Den. The building is then used for several businesses, including Ian Beale's (Adam Woodyatt) Meal Machine, a catering business, and a bric-a-brac shop, also owned by Ian. It also becomes a beauty salon, first called Sophisti-Kate's, run by Kate Mitchell (Jill Halfpenny), then Booty, run by Tanya Branning (Jo Joyner), Roxy's, run by Roxy Mitchell (Rita Simons), and Beauty, run by Sadie Young (Kate Magowan). It returns to being a wine and cocktail bar in 2014 when Sharon Rickman opens The Albert. After Vincent Hubbard (Richard Blackwood) buys half the bar and Sharon later sells her half to Vincent as well, he and his wife, Kim Fox-Hubbard (Tameka Empson), run it until he is forced to sell it to pay people he owes money to and it is left empty in early 2018. Kathy buys the building in 2019, and decides to reopen it as a gay bar called The Prince Albert."]}, {"page": "Mark Benton", "response": ["As of February 2018, Benton is currently starring as Frank Hathaway, alongside actress Jo Joyner in the new BBC daytime comedy drama Shakespeare & Hathaway: Private Investigators."]}, {"page": "Kate Thornton", "response": ["Kate currently hosts Yahoo! podcast White Wine Question Time where she asks three friends, three questions over three bottles of wine. Guests have included Jo Joyner, Nadia Sawalha, Malin Andersson, Leigh Francis, Angela Griffin and Amanda Holden. The podcast first aired in December 2018. During lockdown, she also created and hosted Up Close And Socially Distant, a video series for Yahoo!, where she chatted over the phone to famous faces, front line workers and those leading initiatives to help serve the community during lockdown. The show ran for nine weeks."]}, {"page": "Ian Beale", "response": ["Two months later, Lauren Branning (Jacqueline Jossa), working with homeless people, sees Ian at a tramp shelter. Tanya Cross (Jo Joyner), Max Branning (Jake Wood) and Alfie Moon (Shane Richie) find him and bring him back to the Square but Lucy is unsympathetic, angered by his leaving her and Bobby, and slams the door in his face. Ian refuses to acknowledge anyone. He stays with Tanya and Max until Phil finds out he is back and takes him to his house to ensure he does not tell anybody about Ben murdering Heather. Ian continues to be unresponsive until Phil's partner Shirley Carter (Linda Henry) mentions Heather, and his memory returns. Ben attempts to help Ian by taking him to the café, but Lucy screams and has him physically removed. Ian, extremely miserable, collapses in tears outside, while Phil worries that Ian will remember that Ben murdered Heather. After Sharon returns to Walford, she successfully persuades Lucy to give Ian another chance. Lucy agrees but on the condition that Ian signs all of his businesses over to her so that if Ian abandons her again she can be financially secure.  Ian agrees to this. Ben confesses to murdering Heather and is remanded in custody, leaving Ian shocked. He starts working again at the café and getting back into his old life. Phil then gets Ian to visit Ben in prison to try to get him to retract his confession, but Ian says he cannot tell Ben what is right. Eventually, Zainab Khan (Nina Wadia) persuades Ian to attend counselling in an attempt to recover from his mental breakdown and, after talking to Sharon, Lucy finally makes peace with her father."]}, {"page": "The Queen Victoria", "response": ["*2007: Stacey Slater (Lacey Turner) slaps and attacks Tanya Branning (Jo Joyner) resulting in the two women brawling on Peggys 65th Birthday."]}, {"page": "Digital Spy", "response": ["| 'Most Popular Actress' || Jo Joyner (Tanya Branning in EastEnders)"]}, {"page": "Tanya Franks", "response": ["In July 2007, it was announced that Franks would play the role of Tanya Branning's (Jo Joyner) sister, Rainie Cross in the BBC One soap opera EastEnders for a week-long stint from 2 August 2007. Franks returned to EastEnders as Rainie in January 2008,BBC Programme Information, Network TV Week 2, Tuesday 8 January 2008 accessed 7 December 2007 and again in August 2010. She returned again in April 2011, before departing once more later that year. She made a surprise return to the show on 16 June 2014 and departed on 15 February 2015. EastEnders announced on 18 January 2018 that Franks would make a guest appearance the following day and return permanently later in the year. Franks made her full time return on 24 April 2018."]}, {"page": "Simon Ashdown", "response": ["|Best Storyline (with Charlie Clements, Jo Joyner, Lacey Turner and Jake Wood)"]}, {"page": "Scott Maslen", "response": ["He is married to Estelle Maslen (née Rubio), who is the mother of his son Zak Alexander Maslen (born 25 January 2001). The couple were together for nine years before they were married on 6 September 2008. Several of Maslen's co-stars were in attendance at his wedding, including: Samantha Womack, Rita Simons, Charlie Clements, Jo Joyner, Steve McFadden, Barbara Windsor, Patsy Palmer, Diane Parish and Perry Fenwick.Scott Maslen; Hello!"]}, {"page": "Jane Beale", "response": ["Jane’s storylines have included her relationship and later marriages to Ian Beale (Adam Woodyatt); the first ended due to his affair with Glenda Mitchell (Glynis Barber), an affair with Grant Mitchell (Ross Kemp), accidentally shot by Ian's stepson Steven Beale (Aaron Sidwell) which results her desire to have a child of her own following a hysterectomy, a relationship with Masood Ahmed (Nitin Ganatra), her popular friendship with Tanya Branning (Jo Joyner), covering up her adopted son Bobby's (Eliot Carrington) role in the murder of her stepdaughter Lucy Beale (Hetti Bywater), being paralysed after being brutally attacked with a hockey stick by Bobby, caught up in the fire at Beale's restaurant, which was started by Steven before she was then left in the blaze by Max Branning (Jake Wood) and being forced by Max to leave Walford which led to a second departure.", "Ian asks Jane to renew their wedding vows and she agrees. Days later, Ian admits to having an affair with Glenda Mitchell (Glynis Barber). He hopes she can forgive him but she cannot; they end their relationship but continue to live together, with Ian determined to win her back. She is horrified when Greg Jessop (Stefan Booth) asks Ian to be best man at his wedding to Jane's best friend Tanya Branning (Jo Joyner). During Tanya's hen night, Jane and Tanya get drunk and Tanya accuses Jane of being jealous, so Jane refuses to be Tanya's matron of honour. Returning home, Jane finds Greg bringing Ian home and she goes to kiss Greg, who pushes her away. Filled with guilt, Jane admits what she did to Tanya and they reconcile. Jane and Ian's relationship deteriorates when she meets a man named Martin (Alasdair Harvey) at a pub quiz. They have a brief affair; she ends it, but Ian tries to make Jane jealous by hiring an escort named Jeanette (Georgia Reece). Jane learns that she is an escort and mocks Ian; he calls Jane a prostitute disguised as a wife. She then vows to take everything she can in their divorce. Jane tells Masood she is in love with him and asks him to leave Zainab, but he refuses, telling her he loves her but does not want a divorce. Jane wins the café in her divorce from Ian. Bobby is upset by their arguments, and Jane realises she must leave Walford for his sake, so there are no more arguments. She promises to see Bobby regularly, and leaves after removing her wedding ring. Ian and Jane's divorce is later finalised."]}, {"page": "Peter Beale", "response": ["A budding athlete, who is Peter's PE teacher, tells Ian that Peter could compete in the 2012 Olympics. Keen for Peter to succeed, Ian begins putting pressure on him to train hard and is unhappy when Peter is distracted by  Lauren Branning (Madeline Duggan), who Peter begins dating in December 2007. Lauren's father, Max Branning (Jake Wood), is also unhappy, especially when he catches Peter and Lauren playing truant and drinking alcohol and Max orders Peter to end the relationship in October 2008 but Peter tries standing up to him. Max angrily grabs Peter and throttles him so Peter tells Lauren that Max was behind their breakup, making Lauren so angry that she tries to run Max over. Peter later gave evidence in court, stating that when Lauren left his house, she was upset and angry. When Lauren returns home (after being found not guilty of attempting to murder Max) in April 2009, Peter settles his differences with Max and declares his love for Lauren. Peter tries to look impressive by lying that he and Lauren have had sex in the allotments. Lucy and Jay Brown (Jamie Borthwick) quickly spread this rumour at school and Lauren dumps Peter. Max is furious about what Peter has said and tries to punch him. Peter and Lauren reconcile and Lauren tells Peter she is ready to have sex. However, Lauren's mother, Tanya Branning (Jo Joyner), finds the condoms Peter and Lauren are using and Lauren's older brother, Bradley Branning (Charlie Clements), overhears Peter talking about it. The next day, Peter and Lauren try to see each other in secret but fail. Peter tells Max that he loves Lauren and Max finally accepts it."]}, {"page": "Stacey Slater", "response": ["Despite being initially unimpressed by Walford newcomer Bradley Branning (Charlie Clements), she eventually grows to like him and they start dating. Bradley becomes Stacey's first true love. Stacey is stunned when Sean appears back in her life after seven years, but is happy to have her brother back. Stacey's relationship with Bradley hits a rough patch when Stacey discovers she has been impregnated by Bradley and he urges her to have an abortion. Stacey reluctantly has the abortion and their romance sours. Bradley calls time on his relationship with Stacey when she embarrasses him at a work party. To get back at Bradley, Stacey seduces his father Max Branning (Jake Wood). Subsequently, they begin an affair. Although they agreed that it would only be about sex, Stacey falls in love with Max, but Max rejects her. Eventually, Max also falls for Stacey and agrees to leave his wife, Tanya Branning (Jo Joyner). However, Max has this on a halt as he learns that Tanya is pregnant. While Max and his family are out of town, Stacey reunites with Bradley and accepts his marriage proposal. When Max returns, he declares his love for Stacey and wants to run away with her. Stacey tells Max they are over for good and she is marrying Bradley. Stacey feels overwhelmed on her wedding day and almost does not go through with the ceremony, but Bradley convinces her to marry him. Max propositions Stacey after the wedding ceremony and their kiss is recorded on Max's eldest daughter Lauren's (Madeline Duggan) hidden video camera. Lauren gives a DVD of the recording to Bradley as a Christmas present, revealing the fling to the entire family. Tanya and Bradley are devastated over their spouses' betrayal and both marriages end. Some time later, Bradley decides to give his marriage to Stacey another chance, suggesting that they start a family. Stacey is uncertain and secretly continues taking birth control pills. She has a one-night-stand with Callum Monks (Elliott Jordan). She immediately regrets cheating on Bradley. Stacey attempts to reignite the spark in her marriage, but eventually decides her and Bradley are over. She has a brief relationship with Callum, but they split up over his harsh treatment of her mother."]}, {"page": "Ruby Allen", "response": ["Ruby is left heartbroken following her father's death, and is even more so when Sean lacks comfort and support. On the day of Johnny's funeral, Ruby goes missing and Sean finds her - slumped behind the desk in the Scarlet office - with a bottle of vodka. Later, she speaks to Pat who made her think, by saying that her father was normally right about people, including Jake and Sean. Sean later proposes to Ruby, stating he has genuine feelings for her, and she accepts. Later, Ruby learns from Stacey that Sean had cheated on her with Preeti Choraria (Babita Pohoomull) and she barges into Tanya Branning's (Jo Joyner) salon to threaten her. She makes Sean vow to be true to her, but when she tells his mother, Jean Slater (Gillian Wright), that he is back in Walford, he angrily breaks up with her, throwing her father's ashes in her face. Ruby later leaves Walford in the back of a taxi, having fallen out with Stacey once again."]}, {"page": "Harry Hill's TV Burp", "response": ["* A recurring element from the 2010 series was \"Wagbo\", the 1980s \"love child\" of The X Factor contestants Mary Byrne and Wagner. Wagbo \"escaped\" from his cage while exhibited on the show and ran amok throughout the nation, including rampages at Bluewater, the O2 Arena, and an appearance by Robert Downey Jr.. He was eventually \"recaptured\" after a chase through the sets of This Morning, Lorraine, Dancing on Ice, The Alan Titchmarsh Show and Loose Women. Along the way, he kissed Phillip Schofield, Lorraine Kelly and Pamela Stephenson, was hit by Stephenson, assaulted by Alan Titchmarsh with a baseball bat, and chased from Loose Women by Andrea McLean, Coleen Nolan, Jo Joyner and Lynda Bellingham, as well as  interrupting a warning about his rampage on Daybreak, terrorising hosts Adrian Chiles and Christine Bleakley. Wagbo and his brother, Logbo (son of Mary and Louis Walsh), were eventually shot dead by the Knitted Character after beating up Hill in the studio. From thereon, Wagbo occasionally appeared in the show as part of a scene or end-of-show song."]}, {"page": "List of former EastEnders characters", "response": ["| Tanya Branning || Jo Joyner || 2006–2013, 2015, 2017–2018"]}, {"page": "Carly Wicks", "response": ["Despite Sean's assaults on her brother, Carly briefly resumes a sexual relationship with him, but he has little interest in her as he is besotted with Tanya Branning (Jo Joyner). Carly discovers that Kevin has died in a car accident. She visits his body in the morgue and screams, momentarily asking for support from Shirley, who was with Kevin when he died. The following day, however, Carly is incensed that Shirley had been the last face Kevin had seen before he died; she tells Shirley that she wishes it had been her that died instead. She rejects Shirley's further attempts to comfort her, and after Kevin's funeral, Carly and Kevin's wife Denise (Diane Parish) leave Walford to travel the world and scatter Kevin's ashes. Denise returns and reveals that Carly has decided to stay in Thailand. A month later, Carly sends Denise a postcard asking for Kevin's signet ring and it is revealed that Carly is living in Redfern, a suburb of Sydney, Australia."]}, {"page": "Bradley Branning", "response": ["Bradley was conceived when his parents, Max (Jake Wood) and Rachel (Sukie Smith; Pooky Quesnel), were just 18 years old. The three of them lived happily as a family for nearly six years. However, Max could not cope with being a young husband and father and eventually began an affair with an 18-year-old girl, Tanya Cross (Jo Joyner). When Tanya became pregnant, Max left his wife and son to marry his mistress. Bradley never fully recovered from his father's abandonment."]}, {"page": "Stay Close", "response": ["* Jo Joyner as DC Erin Cartwright, Broome's detective partner and ex-wife.", "The main cast were revealed to be Cush Jumbo, James Nesbitt, Richard Armitage and Sarah Parish. In February 2021, Netflix announced that several new people would be joining the cast, including Eddie Izzard, Andi Osho, Daniel Francis, Jo Joyner, Bethany Antonia and Rachel Andrews."]}, {"page": "Steven Beale", "response": ["Although Abi discovers the truth, she decides not to tell Lauren after Steven tells her he is planning to leave Lauren to be with her. However, Steven tells Lauren he wants to adopt Louie and stuns Abi by proposing marriage to Lauren in The Queen Vic. When Lauren leaves Walford to visit Tanya, conflicted on her relationship with Steven, Max tells him he knows he lied about the brain tumour and gives him an ultimatum: help him move some clients from his property or he will tell Lauren the truth. Max tells Steven to set fire to the flat while making sure the clients safely exit the premises. Steven refuses and tells Max that he will tell Lauren the truth when she returns and tells Abi that their affair was a mistake. However, when Lauren texts to say that she will be staying with Tanya for longer, Steven agrees to Max's plan. However, the plan appears to backfire when the residents hear sirens of fire engines, police cars and ambulances. Max finds Steven in The Vic alleyway and Steven tells him he does not know if the clients exited the flat. Max tells Steven that he is on his own as he drove Ian's car to the flat, while dismissing Steven's claim that if he goes to prison, Max will go down too. Max tells him to find an alibi, so Steven asks Abi. Steven tells Max that he has an alibi and mentions that the clients did exit the flat. Jane later discovers Max's revenge plan and Steven's brain tumour lie and Max convinces Steven that Jane is trying to get rid of him. Steven confronts Jane and blames her for Max's behaviour, but Jane tries to reason with Steven and reveals Abi is pregnant. However, Steven refuses to believe her, and after berating her about framing Max for Lucy's murder, sets fire to the restaurant, and leaves Jane to perish in the flames. Believing Lauren trapped inside, Steven and Max run back into the inferno and Steven saves Abi, who became trapped upon finding, and attempting to save Jane. Max tried to get Steven to kill Jane but he refuses and tries to save her. Max violently shoves him into a countertop, causing Steven to be rushed to hospital where he tells Abi that he loves her and will try to make their relationship work. He then suffers a cardiac arrest and dies from his injuries. When Steven's lies are revealed, it is also revealed that Steven died of injuries to the liver (likely from when Max pushed him) and so only Abi attends his funeral and reads a eulogy dedicated to him. Abi then has Steven cremated and hides his ashes away from Lauren when they visit their mother Tanya Branning (Jo Joyner) in Exeter. However, Lauren eventually discovers the truth after finding Abi in her wedding dress. Horrified by what she has learned, Lauren tries to flush Steven's ashes down the toilet, but Abi stops her, eventually telling her the truth about her pregnancy with his baby. In December 2017, Abi and Lauren learn about their father's scheme before discovering his knowledge over the former's pregnancy with Steven's baby. They eventually find out on Christmas that year the truth about Steven's death when their mother Tanya reveals that Max killed him – causing them to disown their father, who subsequently gets into a fight with Ian when he and his mother Kathy learn the truth as well; the latter then explains this to Phil, who then confronts and attacks Max. Shortly afterwards, Abi and Lauren fall from the Queen Vic roof; both survive and are taken to hospital, where an ultrasound shows Abi and Steven's baby is alive. Fearing that Abi may go into cardiac arrest following her devastating diagnosis of brain stem death, the doctors decide to deliver the baby via cesarean section. Soon after, the doctors switch off Abi's life support when it becomes clear that the chances of reviving her are impossible."]}, {"page": "The British Soap Awards", "response": ["| \"Best Actress\" || Emma Rigby (Hannah Ashworth in Hollyoaks) || Jo Joyner (Tanya Branning in EastEnders) Lacey Turner (Stacey Branning in EastEnders) Charlotte Bellamy (Laurel Thomas in Emmerdale) ", "| \"Best Dramatic Performance\" || Jo Joyner (Tanya Branning in EastEnders) || Jack P. Shepherd (David Platt in Coronation Street)Charlotte Bellamy (Laurel Thomas in Emmerdale)Emma Rigby (Hannah Ashworth in Hollyoaks)", "| \"Best Actress\" || Katherine Kelly (Becky Granger in Coronation Street) || Samantha Janus (Ronnie Mitchell in EastEnders)Jo Joyner (Tanya Branning in EastEnders)Carley Stenson (Steph Cunningham in Hollyoaks)", "| \"Best Actress\" || Alison King (Carla Connor in Coronation Street) || Jo Joyner (Tanya Jessop in EastEnders)Nina Wadia (Zainab Masood in EastEnders)Karen Hassan (Lynsey Nolan in Hollyoaks)", "| \"Best On-Screen Partnership\" || Jake Wood & Jo Joyner (Max Branning & Tanya Jessop in EastEnders) || Matthew Chambers & Elisabeth Dermot Walsh (Daniel Granger & Zara Carmichael in Doctors)Jeff Hordley & Emma Atkins (Cain Dingle & Charity Sharma in Emmerdale)Ashley Taylor Dawson & Jessica Fox (Darren & Nancy Osborne in Hollyoaks)", "| \"Best Dramatic Performance\"Presented by Jerry Hall|| Jo Joyner (Tanya Jessop in EastEnders) || Alison King (Carla Connor in Coronation Street)Owen Brenman (Heston Carter in Doctors)Jeff Hordley (Cain Dingle in Emmerdale)", "| \"Best Dramatic Performance\"Presented by James and Ola Jordan|| Natalie Gumede (Kirsty Soames in Coronation Street) || Dido Miles (Emma Reid in Doctors)Jo Joyner (Tanya Cross in EastEnders)Lucy Pargeter (Chas Spencer in Emmerdale)Claire Cooper (Jacqui McQueen in Hollyoaks)"]}, {"page": "Chelsea Fox", "response": ["Upon Chelsea's arrival, she is seduced by Grant Mitchell (Ross Kemp), unaware he is dating her to make Jane Collins (Laurie Brett) jealous. However, when Denise uncovers the truth, Grant ends the relationship. Chelsea becomes friends with Deano Wicks (Matt Di Angelo) and initially works for Billy Mitchell (Perry Fenwick) at his video shop, but is sacked. She then finds employment at Tanya Branning's (Jo Joyner) salon, Booty, and falls for Sean Slater (Robert Kazinsky). Although, Sean is promiscuous and pursues other women, including Tanya and Carly Wicks (Kellie Shirley), while Chelsea wants a serious relationship. Attempting to keep Sean away from Carly, Chelsea sets her up on a date with Warren Stamp (Will Mellor), who tries to assault Carly. Sean rescues her and animosity between the girls escalates, particularly when Sean dumps Chelsea for Carly. Carly's brother, Deano, is attracted to Chelsea and, using this to her advantage, she and Deano sabotage Carly and Sean's relationship. When Patrick Trueman (Rudolph Walker) is attacked, Chelsea and Deano frame Sean, stealing CCTV evidence that clears Sean but Carly finds it and gives it to the police. Sean is released and the police charge Chelsea and Deano with perverting the course of justice. Sean gets revenge by cutting Chelsea's hair while she sleeps and having Deano beaten by a gang of thugs. She and Deano are sentenced to six months imprisonment and released after three."]}, {"page": "Max Branning", "response": ["Many of Max's storylines focus on his relationships, including his marriages to Tanya Branning (Jo Joyner), Kirsty Branning (Kierston Wareing) and Rainie Cross (Tanya Franks), and relationships with Gemma Clewes (Natalie J. Robb), Stacey Slater (Lacey Turner), Vanessa Gold (Zöe Lucker), Lucy Beale (Hetti Bywater), Emma Summerhayes (Anna Acton), Karin Smart (Denise van Outen), Carmel Kazemi (Bonnie Langford), Fi Browning (Lisa Faulkner), Ruby Allen (Louisa Lytton) and Linda Carter (Kellie Bright), many of which are extramarital affairs. Max has also embarked on feuds with his father Jim Branning (John Bardon), brothers Jack Branning (Scott Maslen) and Derek Branning (Jamie Foreman), as well as Sean Slater (Robert Kazinsky), Harry Gold (Linal Haft), Janine Butcher (Charlie Brooks), Phil Mitchell (Steve McFadden), Cora Cross (Ann Mitchell), Jay Brown (Jamie Borthwick), Carl White (Daniel Coonan), Charlie Cotton (Declan Bennett), Ben Mitchell (Harry Reid/Max Bowden), Ian Beale (Adam Woodyatt), Jane Beale (Laurie Brett), Steven Beale (Aaron Sidwell), Mick Carter (Danny Dyer), Martin Fowler (James Bye), Stuart Highway (Ricky Champ) and Kathy Beale (Gillian Taylforth).", "Max arrives in Walford in June 2006 to confront his father, Jim Branning (John Bardon), after being estranged for 17 years, but Jim throws him out and Max meets his son Bradley Branning (Charlie Clements), and decides to stay to rebuild their relationship. Max's wife Tanya Branning (Jo Joyner) arrives to collect him and a month later, Max, Tanya and their daughters Lauren Branning (Madeline Duggan until June 2010, Jacqueline Jossa thereafter) and Abi Branning (Lorna Fitzgerald) move to Albert Square. Tanya learns about Max's affair with Gemma Clewes (Natalie J. Robb), but she gives their marriage one last try. As an apology, Max buys 10 Turpin Road for Tanya to open as a beauty parlour and begins spending time with Bradley.", "In May 2009, Wood said he hoped his character would get back with his wife, Tanya (Jo Joyner), saying: \"He believes Tanya still loves him. I think she does too.\" Later in 2009 Max gets into debt and tries to con various Walford residents. On conning single mother Heather Trott (Cheryl Fergison), Wood said \"Max has got a conscience but he's thinking about his own survival. He wants to keep his family at all costs.\" On hiding Max's debt problems from Tanya, Wood commented: \"Max thinks he can wriggle out of situations and admitting to debt would be a blow to his manhood. But Tanya would have understood and he'd have kept his family. [...] The problem between Max and Tanya has always been honesty. If Tanya finds out she may never trust Max again.\" When Tanya discovers Max's lies, she leaves him. This storyline facilitated Joyner's temporary departure on maternity leave. The show's executive producer Diederick Santer commented: \"Yet again, Max has messed up, hasn't he? He's learned to keep it in his trousers, but financially, he's corrupt. He's taken his eye off the ball business-wise and like a lot of people in the last year or two, he's found it tough going. His inability to show weakness or to share his problems with Tanya has been his downfall. He has to rebuild his life now and his long-term objective is to get Tanya back. Jo Joyner is of course returning to the Square but whether Max gets Tanya back is another thing. I don't know if he's good enough for her.\" Santer also revealed that some planned storyline material for Max and Tanya was put on hold until Tanya's return from maternity leave."]}, {"page": "Sean Slater", "response": ["Sean Slater's first appears in August 2006, seeking revenge on his old friend Al (Andrew McKay) after the latter ended up causing Sean to be kicked out of the army. Sean breaks into Al's flat and follows him into The Queen Victoria public house, where he ends up seeing his sister Stacey, whom he had lost contact with for seven years. After taking revenge on Al, Sean decides to stay in Walford to look after Stacey. Sean immediately begins pursuing housewife Tanya Branning (Jo Joyner), despite briefly dumping her for Stacey's best-friend Ruby Allen (Louisa Lytton) after learning that she is wealthy. Sean soon begins forging his relationship with Ruby in order to secret exploit control of her financial assets. However, his plan is quickly discovered by Ruby's business partner Jake Moon (Joel Beckett), whom he begins clashing with in the process. Their feud escalates when Ruby confides to Sean that Jake had killed his younger brother Danny (Jake Maskall) to stop him from murdering the \"Mitchell Brothers\", consisting of the square's local hardman Phil Mitchell (Steve McFadden) and his younger brother Grant (Ross Kemp), at the behest of their crime boss and Ruby's father - Johnny Allen (Billy Murray). Later on, Jake informs Johnny of Sean's plan and subsequently tells Sean that Johnny wishes to meet him in person; Johnny has recently been sentenced to life imprisonment for his criminal activities, specifically for the murders of his gangland rival Andy Hunter (Michael Higgs) and his best-friend Dennis Rickman (Nigel Harman). The next day, Sean visits Johnny and attempts to fabricate his story by proclaiming that his intentions are to create goodwill for Ruby and her future. However, Johnny doesn't buy it and threatens to have Sean killed unless he leaves Ruby alone. At first Sean appears to feel intimidated, but he then surprises Johnny by taunting him over his real plans for Ruby before leaving prison. This enrages Johnny, who then attempts to have Sean killed by phoning Jake to carry out the order, but he ends up having a heart attack and dies before Ruby can visit him; Jake then leaves Walford after learning about his boss' death. Following Johnny's funeral, Sean proposes marriage to Ruby. They begin to plan out a wedding until Ruby learns of Sean's plan, and Sean also grows irritated when she attempts to help mend his relationship with Jean. Eventually, they split and Ruby leaves Walford afterwards. Sean then continues to pursue Tanya, only to end up having sex with numerous other women - including Karin Jones (Anna Lauren) and Preeti Choraria (Babita Pohoomull)."]}, {"page": "Bianca Jackson", "response": ["A DNA paternity test confirms that Ricky is Tiffany's father. Bianca slowly realises she is in love with him, but her attempt to rekindle their romance is ruined when Ricky announces his engagement to Sam Mitchell (Danniella Westbrook). Knowing Sam is evading a prison sentence, Bianca reports her whereabouts and Sam is arrested. A rift forms between Bianca and Ricky when the truth is revealed. However, Bianca's discovery that Sam is cheating on Ricky ends the engagement and Bianca and Ricky reunite, when Ricky accepts her marriage proposal. The couple remarry. During the ceremony, Carol arrives and brawls with Bianca but they settle their differences and begin to rebuild their relationship. When Bianca's younger brother, Billie, dies from alcohol poisoning, Carol is distraught. She is comforted by Billie's friend, Connor Stanley (Arinze Kene), and they begin an affair, while Connor is also dating Whitney. Bianca vows to remove Connor from her family's life and attacks Connor, leaving him hospitalised and eventually turns herself in to the police, refusing bail. She is sentenced to six months imprisonment. Bianca is released for Christmas and is devastated when Pat dies from pancreatic cancer. When Bianca discovers Ricky had sex with Mandy Salter (Nicola Stapleton) in her absence, they separate and he leaves Walford. Bianca struggles as a single parent and gets into debt. Owing money, Bianca steals from a market trader in desperation, but she is caught and sent back to prison. In prison, she passes a hair and beauty course and on her release, is offered a trial at Tanya Cross' (Jo Joyner) salon. However, Bianca struggles to cope and breaks down when she is alone."]}, {"page": "No Angels (TV series)", "response": ["The programme centres on the lives of three nurses and a healthcare assistant in the city of Leeds. The four main characters are Kate Oakley (played by Kaye Wragg), Lia Costoya (Louise Delamere), Anji Mittel (Sunetra Sarker), and Beth Nicholls (Jo Joyner). Additional main characters were played by Derek Riddell, James Frost, Francis Magee and Matt Bardock. The show deals with the women's lives both in and out of the hospital.", "* Jo Joyner as Beverly Elizabeth 'Beth' Nicholls - A nurse at the hospital. She openly admits that she'd rather have money than love in the first series and begins an affair with one of the hospital's senior management. However, after he leaves his wife, Beth dumps him, admitting that she needs something more than \"I will love you\". She continues to date men for their money, but clearly doesn't like being treated like a \"trophy wife\". In the final series she begins dating a plumber (ironically as for 3 seasons she stated that she 'didn't do' plumbers).  Beth, like Kate and Lia, has also slept with Jamie. Beth was raised by her aunt and it is implied that she left home for an unknown reason, although it is hinted in the same episode that she was molested/raped by her male cousin in the fourth episode of series one - something that by the end of the episode is suspected by her Aunt."]}, {"page": "Royal Welsh College of Music & Drama", "response": ["* Jo Joyner"]}, {"page": "North & South (TV serial)", "response": ["Margaret's father, a clergyman, has long harbored doubts about the doctrines of the Church of England and resigns his position rather than attest to orthodox beliefs as his bishop requires. To avoid gossip, the family move to the (fictional) industrial town of Milton, Darkshire, in the north of England. Thanks to his friend, Mr. Bell (Brian Protheroe), Mr. Hale is able to find a house. Giving lessons as a private tutor provides him a modest income. One of his pupils is local mill-owner John Thornton (Richard Armitage), who gets off to a bad start with Margaret when she witnesses him beating a worker whom he has caught smoking in the mill, which endangers all the workers. Gradually, Margaret gets used to Thornton, but his mother Hannah (Sinéad Cusack) and sister Fanny (Jo Joyner) disapprove of her, believing her haughty and alien to the customs of the North. In the meantime, Margaret attempts to do charitable work among the mill workers and comes into contact with Nicholas Higgins (Brendan Coyle) and his daughter, Bessy (Anna Maxwell Martin), who suffers from byssinosis from exposure to the cotton fibres in the mills. When Bessy became ill at Hamper's Mill, her father moved her to Marlborough Mills, Thornton's mill, because the working environment is better there. In a meeting with fellow mill owners, Thornton says he had a wheel for ventilation installed in all of the rooms of his factory in order to maintain a healthier workforce, despite the fact that it costs a great deal of money. The other industrialists had refused to install a wheel because of the expense.", "* Jo Joyner – Fanny Thornton"]}, {"page": "Tanya Branning", "response": ["Tanya Cross (also Branning and Jessop) is a fictional character from the BBC soap opera, EastEnders, played by Jo Joyner. She made her first appearance on 27 June 2006. Joyner left the show temporarily on 25 December 2009 for maternity leave. After a guest appearance, Tanya eventually returned on 27 September 2010. On 1 April 2013, it was announced that Joyner would be departing the role and she made her final appearance on 28 June 2013. Tanya returned in February 2015 for two episodes as part of the show's 30th anniversary celebrations. She later reprised the role again in 2017 for four episodes, appearing between 25 December 2017 and 16 February 2018. ", "Jo Joyner said that she will make sure that the storyline will be \"honest and true to life\" as possible. Talking to All About Soap about how she has researched the plot, Joyner said that she has talked to many survivors of cervical cancer through a charity named Jo's Trust and added that they have a great website, which is very informative and has helped her a lot. Joyner said that it is a privilege to be given any sort of serious storyline and a real responsibility. Asked whether it makes Tanya think twice who she wants to be with, Joyner replied: \"Definitely. She remembers her mum looking at her dad with pity [when he was ill] and she'd hate that happening to her. She has some serious thinking to do about her future now.\" Jo's Cervical Cancer Trust has praised EastEnders for helping spread the awareness of cervical cancer. The trust received extra calls following Tanya's diagnosis. Kirkwood said in a news release that EastEnders worked closely with experts to ensure that the issue is accurately portrayed and that viewers will see how Tanya will use her inner determination to deal with what will be one of the toughest challenges of her life."]}, {"page": "Abi Branning", "response": ["Abi Branning is a fictional character from the BBC soap opera EastEnders, played by Lorna Fitzgerald. She was introduced by executive producer Kate Harwood on 3 July 2006 as an extension to the Branning family, along with father Max (Jake Wood), mother Tanya Branning (Jo Joyner) and older sister Lauren Branning (Madeline Duggan/Jacqueline Jossa). Her storylines involve her friendships and relationships with Ben Mitchell (Charlie Jones/Joshua Pascoe/Harry Reid) and Jay Brown (Jamie Borthwick), her toxic friendship with Babe Smith (Annette Badland), faking a pregnancy so that Ben would not leave her for Paul Coker (Jonny Labey), being a suspect in the murder of Lucy Beale (Hetti Bywater), her affair with Lauren's fiancé, Steven Beale (Aaron Sidwell), and falling pregnant by him.", "Abi moves to Albert Square with her parents Max Branning (Jake Wood) and Tanya Branning (Jo Joyner), and sister Lauren Branning (Madeline Duggan), where she befriends Ben Mitchell (Charlie Jones). Abi is hit by Dean Wicks' (Matt Di Angelo) car, suffering a broken wrist, cuts and bruises, but she recovers with no long-term impairment. Abi later learns that Ben's father, Phil Mitchell's (Steve McFadden), girlfriend Stella Crawford (Sophie Thompson) is abusing him, so due to this, Abi and Ben plan to run away, but fail as they are caught by their parents. Abi then stands up to Stella and tells Ben to do the same, leading Stella to kill herself when Ben reveals the abuse. In December 2007, she chooses the name for her newborn baby brother, Oscar. Soon after, when Max's affair with his son Bradley Branning's (Charlie Clements) wife, Stacey Slater (Lacey Turner), is revealed, Max and Tanya separate and eventually divorce. Abi begins to live sporadically with each parent, frequently defending Max to Tanya and Lauren, until Max and Tanya reunite in 2009, however Abi leaves with Tanya after learning of Max's financial problems. In September 2009, Abi and Jordan Johnson (Michael-Joel David Stuart) find Jordan's mother Trina Johnson's (Sharon Duncan Brewster) body in the summerhouse at the allotments having been accidentally killed by Jordan's father, Lucas Johnson (Don Gilet)."]}, {"page": "Clare Bates", "response": ["On 1 February 2008, Clare returns to Albert Square; she is thrown from the back seat of a car. Nigel's former landlady, Dot Branning (June Brown), persuades her to stay. Clare moves in with Dot and gets a job as receptionist at Tanya Branning (Jo Joyner)'s beauty parlour. Preferring rich men, Clare tries to attract the attention of the wealthy men in Albert Square. Jack Branning (Scott Maslen) and his brother Max (Jake Wood) show no interest; however, Ian Beale (Adam Woodyatt) is more susceptible despite being married to Jane (Laurie Brett). Clare flirts with Ian, wears revealing clothes and talks suggestively but she is playing a game and has no intention of taking things further, acting shocked when Ian suggests that she does. She blackmails Ian, threatening to inform Jane of his dishonourable intentions unless he pays to keep quiet but Ian tells Jane himself so she confronts Clare, warning her to stay away from Ian."]}, {"page": "Saturday Kitchen", "response": ["* Jo Joyner", "Kerridge was also joined by a diverse cross-section of celebrity guests, including: Amanda Abbington, Chris Addison, Amanda Byram, Nicki Chapman, Jenny Eclair, Chris Hollins, Alex Jones, Jo Joyner, Nick Knowles, Dominic Littlewood, Craig Revel Horwood, Gaby Roslin, Danny Wallace, and Paul Young."]}, {"page": "Lauren Branning", "response": ["Her storylines have included running over her father Max Branning (Jake Wood), alcoholism, supporting her mother Tanya Branning (Jo Joyner) through cervical cancer, her friendships with Lucy Beale (Hetti Bywater) and Whitney Dean (Shona McGarty), a relationship with her cousin Joey Branning (David Witts), an affair with a married alcoholic Jake Stone (Jamie Lomas), engagement to Peter Beale (Dayle Hudson), struggling to deal with Lucy's murder, giving birth to Peter's son Louie, a relationship with Steven Beale (Aaron Sidwell) following the ending of her relationship with Peter, becoming attracted to Max's boss Josh Hemmings (Eddie Eyre) who also becomes her own boss, having an abortion after becoming pregnant by Steven, dealing with his death, finding out her sister Abi is pregnant by Steven after an affair, working against Weylands plans for development on Albert Square, falling from the Queen Victoria roof alongside Abi, and dealing with Abi's death following the fall.", "The eldest child and daughter of Max Branning (Jake Wood) and Tanya Branning (Jo Joyner), Lauren moves to Walford with her parents and younger sister, Abi Branning (Lorna Fitzgerald) in July 2006. In 2007, Lauren discovers that her father is having an affair with her half-brother Bradley Branning's (Charlie Clements) fiancée, Stacey Slater (Lacey Turner), after accidentally filming them kissing on her video camera. Lauren burns the footage onto a DVD and it is played on Christmas Day, exposing Max and Stacey's affair and resulting in the breakdown of Max and Tanya's marriage. Romantically involved with Peter Beale (Thomas Law), Max disapproves of their relationship and demands Peter end the romance but ends up throttling him when they meet secretly in the café. Shortly after, Max is left comatose, following a hit-and-run. It is revealed that Lauren is responsible but Tanya confesses to the crime and is imprisoned, pleading guilty to attempted murder. This distresses Lauren who confesses to the police and is found guilty of GBH with intent, and is sentenced to two years under supervision.", "Lauren Branning was introduced in 2006 by executive producer Kate Harwood. She and her immediate family—father Max (Jake Wood), mother Tanya (Jo Joyner) and sister Abi (Lorna Fitzgerald)—are an extension of the popular and long-running Jackson/Branning clan, who have appeared in the series since 1993. It was announced in May 2006 that Lauren would be played by actress Madeline Duggan.  Duggan was replaced by Jacqueline Jossa, with Duggan's final scenes airing on 23 June 2010."]}, {"page": "Emma Rigby", "response": ["In 2007, at the age of 17, Rigby was nominated for Best Actress in the British Soap Awards (being one year too old to qualify for Best Dramatic Performance for a Young Actor/Actress), but did not make it to the final four. She was also nominated for Most Popular Actress at the National Television Awards. A year later, she won The British Soap Award for Best Actress and was nominated for Best Dramatic Performance, but lost to Jo Joyner.Hollyoaks triumphs, Metro.co.uk; accessed 7 March 2014."]}, {"page": "List of EastEnders television spin-offs", "response": ["This episode first aired on BBC's Red Button service on 11 January 2013. Abi Branning (Lorna Fitzgerald) tracks down her step grandmother Dot Branning (June Brown), who has been living away from Walford with her granddaughter Dotty Cotton (Molly Conlin), following the revelation that her father Max (Jake Wood) has a secret wife, Kirsty (Kierston Wareing) and the fallout it had caused for her family, including Max's current fiancé/ex-wife and Abi's mother Tanya (Jo Joyner). She convinces Dot to return home to Walford when she recognises how she is lonely, starting the 'next chapter' in Dot's life. It acted as the return of June Brown to the role of Dot after six months away."]}, {"page": "Danny Brocklehurst", "response": ["*Ordinary Lies starring Mackenzie Crook, Max Beesley, Michelle Keegan, Sally Lindsay and Jo Joyner."]}, {"page": "Stefan Booth", "response": ["Booth joined EastEnders in October 2010 as Greg Jessop, the fiancé of Tanya Branning  (Jo Joyner). His character was axed in August 2011, but returned for a single episode on 21 October 2011."]}, {"page": "The Warriner School", "response": ["* Jo Joyner, actress, notably starring in long-running soap opera Eastenders, Ackley Bridge and Shakespeare & Hathaway: Private Investigators"]}, {"page": "List of EastEnders characters (1985)", "response": ["In April 2008, Winston's niece Keisha (Suzie McGrath) arrives in Walford, and leaves a month later with Gus Smith (Mohammed George). Winston wins a Children in Need raffle in The Queen Victoria in November 2008, and in July 2009, Stacey Slater offers him a flower but he refuses. He also appears with Shirley Carter (Linda Henry) getting drunk in Ian's chip shop in June 2009 and is seen drunk again in August 2009. He is seen with Tracey (Jane Slaughter) in August 2009 talking about Max and Tanya Branning (Jo Joyner), and in November 2009 Ian invites him for drinks at The Queen Vic but he refuses."]}]}}