{"wiki_id": "http://www.wikidata.org/entity/Q3179816", "itemLabel": "Jocelin of Glasgow", "itemDescription": "Cistercian monk and cleric", "wikipedia_url": "https://en.wikipedia.org/wiki/Jocelin_of_Glasgow", "wikipedia_page": {"main": "Jocelin (or Jocelyn) (died 1199) was a twelfth-century Cistercian monk and cleric who became the fourth Abbot of Melrose before becoming Bishop of Glasgow, Scotland. He was probably born in the 1130s, and in his teenage years became a monk of Melrose Abbey. He rose in the service of Abbot Waltheof, and by the time of the short abbacy of Waltheof's successor Abbot William, Jocelin had become prior. Then in 1170 Jocelin himself became abbot, a position he held for four years. Jocelin was responsible for promoting the cult of the emerging Saint Waltheof, and in this had the support of Enguerrand, Bishop of Glasgow.\nHis Glasgow connections and political profile were already well-established enough that in 1174 Jocelin succeeded Enguerrand as Glasgow's bishop. As Bishop of Glasgow, he was a royal official. In this capacity he travelled  abroad on several occasions, and performed the marriage ceremony between King William the Lion and Ermengarde de Beaumont, later baptising their son, the future King Alexander II. Among other things, he has been credited by modern historians as \"the founder of the burgh of Glasgow and initiator of the Glasgow fair\", as well as being one of the greatest literary patrons in medieval Scotland, commissioning the Life of St Waltheof, the Life of St Kentigern and the Chronicle of Melrose.", "link_mentions": [{"page": "March 17", "response": ["*1199  – Jocelin of Glasgow, Scottish monk and bishop (b. 1130)"]}, {"page": "1199", "response": ["* March 17 – Jocelin of Glasgow (or Jocelyn), Scottish bishop"]}, {"page": "Earl of Douglas", "response": ["The first Douglas on record in Scotland is William I, Lord of Douglas (c. 1174-1214), where he was witness to a charter of bishop Jocelin of Glasgow in 1198, where he signed \"Will. de Dufglas\" in what can only be a territorial designation.Liber de Calchou, p346"]}, {"page": "Jocelin, Bishop of Glasgow", "response": ["#REDIRECT Jocelin of Glasgow"]}, {"page": "Jocelin of Melrose", "response": ["#REDIRECT Jocelin of Glasgow"]}]}}