{"wiki_id": "http://www.wikidata.org/entity/Q317803", "itemLabel": "Matt Le Tissier", "itemDescription": "English association football player (born 1968)", "wikipedia_url": "https://en.wikipedia.org/wiki/Matt_Le_Tissier", "wikipedia_page": {"main": "Matthew Paul Le Tissier (; born 14 October 1968) is a football television pundit and former professional footballer. Born in Guernsey, he won eight caps for the England national team.\nLe Tissier spent his entire professional club career with Southampton before turning to non-League football in 2002; his loyalty garnered special affection from Southampton's fans who nicknamed him \"Le God\".A creative attacking midfielder with exceptional technical skills, Le Tissier is the second-highest ever scorer for Southampton behind Mick Channon and was voted PFA Young Player of the Year in 1990. He was the first midfielder to score 100 goals in the Premier League. He is notable for his record at scoring penalty kicks – converting from the spot 47 times from 48 attempts – and is considered one of the greatest ever from the 12-yard spot.Following his retirement as a player, Le Tissier became a football pundit, and worked as a panelist on the Sky Sports show Soccer Saturday until August 2020. In 2011, he became honorary president of Guernsey F.C..\nIn 2020, he was voted the Eurosport Best Premier League Player of All Time, ahead of many world-renowned Premier League footballers, such as Cristiano Ronaldo, Wayne Rooney, Alan Shearer and Thierry Henry.", "link_mentions": [{"page": "Guernsey", "response": ["In those sporting events where Guernsey does not have international representation, but the British Home Nations are competing separately, highly skilled islanders may choose to compete for any of the Home Nations. There are, however, restrictions on subsequent transfers to represent other Home Nations. The football player Matt Le Tissier, for example, could have played for the Scottish or Welsh football teams, but opted to play for England instead."]}, {"page": "The Football Association", "response": ["The football associations within the Crown dependencies of Jersey (Jersey Football Association), Guernsey (Guernsey Football Association) and the Isle of Man (Isle of Man Football Association) are affiliated to the FA despite having a separate identity from that of the United Kingdom and by extension England. They are considered county football associations by the FA. Matt Le Tissier and Graeme Le Saux have represented the FA's full national representative team and were born in Guernsey and Jersey respectively."]}, {"page": "Alan Shearer", "response": ["Despite this auspicious start to his career, Shearer was only eased into the first team gradually and made just ten goalless appearances for the club the following season. Throughout his career Shearer was recognised for his strength, which, during his time at Southampton, enabled him to retain the ball and provide opportunities for teammates. Playing as a lone striker between wide men, Rod Wallace and Matt Le Tissier, Shearer scored three goals in 26 appearances in the 1989–90 season, and in the next, four goals in 36 games. His performances in the centre of the Saints attack were soon recognised by the fans, who voted him their Player of the Year for 1991."]}, {"page": "Southampton F.C.", "response": ["| Club Ambassador || Matt Le Tissier"]}, {"page": "Countdown (game show)", "response": ["Contestants who have or had become notable for other reasons include Nuts magazine editor-at-large Pete Cashmore, rugby player Ayoola Erinle, footballers Neil MacKenzie, Clarke Carlisle and Matt Le Tissier, musicians Jon Marsh and Nick Saloman, comedian Alex Horne, noted Irish playwright Peter Sheridan and Professional Darts Referee Kirk Bevins, who won Series 60 and was a quarter-finalist in the 30th Birthday Championship."]}, {"page": "Eric Cantona", "response": ["Cantona left Leeds for Manchester United for £1 million on 26 November 1992. Leeds chairman Bill Fotherby had telephoned Manchester United chairman Martin Edwards to enquire about the availability of Denis Irwin. Edwards was in a meeting with manager Alex Ferguson at the time, and both agreed that Irwin was not for sale. Ferguson had identified that his team was in need of a striker, having recently made unsuccessful bids for David Hirst, Matt Le Tissier and Brian Deane, and instructed his chairman to ask whether Cantona was for sale. Fotherby had to consult with Wilkinson, but within a few days the deal was complete."]}, {"page": "2001–02 FA Premier League", "response": ["| Matt Le Tissier"]}, {"page": "List of sports announcers", "response": ["* Matt Le Tissier – Sky Sports 2003–2020"]}, {"page": "Combined Counties Football League", "response": ["In 2011, the league accepted the membership of newly-founded club Guernsey. The arrival of the team meant that clubs would fly or take a ferry over to the Channel Islands in order to fulfil their fixtures, with Guernsey covering the expenses as part of their membership. Backed by former England international Matt Le Tissier, who made a one-off appearance in the Combined Counties Football League in 2013, they won the Combined Counties Football League Division One and Combined Counties Premier Challenge Cup in their first season."]}]}}