{"wiki_id": "http://www.wikidata.org/entity/Q3179948", "itemLabel": "Jody Fleisch", "itemDescription": "British professional wrestler", "wikipedia_url": "https://en.wikipedia.org/wiki/Jody_Fleisch", "wikipedia_page": {"main": "Jerome Fleisch (born 2 April 1980) is an English professional wrestler, better known by his ring name Jody Fleisch. He is best known for his work with the Frontier Wrestling Alliance, One Pro Wrestling and Real Quality Wrestling. He is currently working for independent promotions all over the world.", "link_mentions": [{"page": "Phoenix", "response": ["* Jody Fleisch (born 1980), professional wrestler nicknamed \"The Phoenix\""]}, {"page": "Walthamstow", "response": ["* Jody Fleisch, English professional wrestler, debuted in 1996, and is still wrestling around the world"]}, {"page": "Frontier Wrestling Alliance", "response": ["*Jody Fleisch", "|Jody Fleisch", "|Jody Fleisch"]}, {"page": "Jonny Storm", "response": ["One of Storm's most enduring feuds has been with his real-life best friend Jody Fleisch, with whom he has wrestled against in American and British promotions. He has also wrestled regularly for One Pro Wrestling, where, with Fleisch, he was the one half of the first 1PW Tag Team Champions, after they defeated A.J. Styles and Christopher Daniels in a tournament final on 27 May 2006. On 1 January 2007, he won the Athletik Club Wrestling Wrestling Challenge Championship from Toby Nathland, but Nathland defeated him to win it back on 15 December 2007. On 23 March 2007, Storm defeated Maddog Maxx to win the Celtic Wrestling Heavyweight Championship, but he lost it to Maxx in July of that year.", "**ACW Tag Team Championship (1 time) - with Jody Fleisch", "**CZW Match of the Year (2002) - vs. Jody Fleisch", "**1PW World Tag Team Championship (1 time) - with Jody Fleisch", "**Wrestlefest Tag Team Championship (1 time) - with Jody Fleisch", "**WSW Tag Team Championship (1 time, current) - with Jody Fleisch"]}, {"page": "Doug Williams (wrestler)", "response": ["During ROH's tour of the United Kingdom in August 2006, Williams teamed with Jody Fleisch as \"Team UK\", defeating \"Team Noah\" (SUWA and Go Shiozaki). The second show of the tour took place in Broxbourne and saw Williams defeat Jimmy Rave."]}, {"page": "AJ Styles", "response": ["In October, Styles traveled to the UK, debuting in the Frontier Wrestling Alliance (FWA) on October 13, suffering a loss to Jonny Storm in his debut match at FWA: British Uprising. On October 15, Styles was defeated in an FWA British Heavyweight Championship number one contender round-robin challenge three-way match by Doug Williams and Jerry Lynn at FWA: Seasons Beatings. Later that night, Styles defeated Jody Fleisch in the same round-robin challenge. On November 1, Styles debuted in IWA: Mid-South, taking part in the promotions annual Ted Petty Invitational tournament, but was defeated by Christopher Daniels in the first round."]}, {"page": "Billy Kidman", "response": ["Following his departure from WWE, Kidman began touring the United Kingdom. During the tour, he competed for the Frontier Wrestling Alliance in a three-way match with Jody Fleisch and Jonny Storm. He also wrestled British wrestling legend Robbie Brookside in a losing effort to determine the inaugural Real Quality Wrestling Heavyweight Champion."]}, {"page": "British Heavyweight Championship (XWA)", "response": ["The first Champion was Mark Sloan, who defeated Paul Glory in a tournament final on 11 July 1999. Jody Fleisch was the first person to win the belt twice after being stripped of it, while American wrestler Christopher Daniels was the first non-British person to win the belt and go on to defend it on foreign soil.", "|Jody Fleisch", "|Jody Fleisch", "|| Jody Fleisch || 2 || 18"]}, {"page": "Tracy Smothers", "response": ["In January 2006 Smothers and Hamrick traveled to 1PW (One Pro Wrestling) in the United Kingdom and defeated The JOB Squad (Al Snow & Blue Meanie) on January 6 at the event 1PW No Turning Back.https://www.cagematch.net/?id=1&nr=5151  Southern Comfort would visit the UK on multiple occasions, where they would also compete in a tag team ladder match for the Tag Team Championship against Team SHAG (Darren Burridge and Colt Cabana) and Jonny Storm and Jody Fleisch, eventually losing to Team SHAG. On July 29, 2006 they won a match against Team Supreme (Dave Moralez & Jack Storm) to become the #1 contenders to the 1PW Tag Team Championship. On October 14 at the 1PW First Anniversary Show in South Yorkshire faced Team SHAG and champions Jody Fleisch & Jonny Storm for the titles, but were unsuccessful."]}, {"page": "Colt Cabana", "response": ["In 2004 and 2005, Colton went on extensive tours of Europe, competing in Scotland, Germany and France, but mainly England. He received the 2004 Match of the Year in a European rounds style bout with World of Sport journeyman, Johnny Kidd. Cabana also did a short tour of Puerto Rico for IWA PR in early 2005. During 2006, Cabana became a popular wrestler in the British promotion 1 Pro Wrestling (1PW), often tag teaming with Darren Burridge as Team SHAG (Street Hooligans Adventure Gang). During 1PW's first anniversary show Team SHAG won the 1PW Tag Team Championship during a three-way ladder match against the defending champions Jonny Storm and Jody Fleisch, and the Southern Comfort team of Tracey Smothers and Chris Hamrick."]}, {"page": "Andrew Simmons", "response": ["After time away in the independent circuit, Simmons returned to the FWA Academy in 2003. During Simmons' time in the academy he wrestled against many of the up-and-coming British stars like James Tighe, Raj Ghosh, Mark Sloan, and Paul Burchill. Simmons also took part in the final TWA tour facing British wrestling superstars \"The Anarchist\" Doug Williams, Jody Fleisch, and Robbie Brookside."]}, {"page": "Alex Shane", "response": ["Alex Spilling began wrestling for the NWA UK Hammerlock promotion in 1995 under the tutelage of owner Andre Baker. After several years with the promotion, Spilling became an assistant trainer under Justin Richards and Doug Williams where he trained many of the Hammerlock roster such as Mad Dog Mcphie, Jonny Storm and Jody Fleisch, among others. Spilling later fell out with Baker and left to work for the brand-new UWA. During his time in the UWA, Spilling formed a tag team with fellow ex-Hammerlock wrestler Guy Thunder and developed much of his in-ring ability and mic skills as well as creating his heel persona, Alex Shane.Capital City Pro Wrestling results (July 5th 2000) Chris Ryan imitates the original UWA Alex Shane gimmick. From Geocities.com. Retrieved 24/11/06. Archived 2009-10-25.", "In 1999, Alex Shane was taken under the wing of Dino Scarlo and Jody Fleisch. During this time, Shane joined the newly revived Frontier Wrestling Alliance promotion. He worked the company's second show and later became the British Heavyweight Champion."]}, {"page": "Matt Cross (wrestler)", "response": ["In March 2005, M-Dogg 20 travelled to Ireland, where he wrestled for the Irish Whip Wrestling promotion, competing against Jonny Storm, Jody Fleisch, Darren Burridge, and Red Vinny. In May 2007, Capiccioni returned to Europe when he was booked by the Queens of Chaos promotion in France. He wrestled in front of 72,000 people, which is the 2007 record for a wrestling show. As Matt Cross, he debuted in German Stampede Wrestling in 2007, and was part of a four-way for the Breakthrough Championship against Germany's Thumbtack Jack, Steve Douglas and X-Dream, who eventually won the match. In April 2010, Cross was a surprise guests (along with Chris Hero, Claudio Castagnoli, Douglas Williams and Ares) for GSW's final show. He lost another Breakthrough Championship match in a three-way against Emil Sitoci and X-Dream on Saturday, and then teamed with X-Dream in a GSW Tag Team Championship scramble match on Sunday, but was again unsuccessful. When GSW reopened with a new structure a few months later, Cross received another match for the Breakthrough Championship, and won by defeating Sitoci. He held the championship through the next three television tapings and successfully defended it against Zack Sabre, Jr.. At the Unstoppable internet pay-per-view, he lost the championship to X-Dream. In 2008, Capiccioni began competing for the Italy-based Nu-Wrestling Evolution as \"Spartan 3000 b.C.\", a Spartan warrior inspired by the popular movie 300. The same year, Capiccioni wrestled in several matches for Pro Wrestling Noah under a mask as \"Raptor\"."]}, {"page": "Pierre Carl Ouellet", "response": ["On June 18, 2018, Ouellet was announced as the first of twenty-four participants for Pro Wrestling Guerrilla's (PWG) annual Battle of Los Angeles tournament. At 2018 Battle of Los Angeles - Stage One on September 15, he made his company debut, losing to Brody King in the Opening Round. Two nights later, at 2018 Battle of Los Angeles - Final Stage, he led a losers' ten-man tag team match, in which Team PCO (Ouellet, Darby Allin, Dan Barry, Jody Fleisch and Puma King) defeated Team DJ Z (DJ Z, Adam Brooks, David Starr, T-Hawk and Timothy Thatcher)."]}, {"page": "Jodie Fleisch", "response": ["#Redirect Jody Fleisch"]}, {"page": "Fleisch", "response": ["* Jody Fleisch (born 1980), British professional wrestler"]}, {"page": "Chri$ Ca$h", "response": ["The start of 2002, however, saw Ca$h and GQ engage in a scripted rivalry, trading victories. Their third match at Out With Old In With The New in March went to a no contest, and afterwards, neither Ca$h nor GQ appeared for CZW for over four months. When they returned on July 13 at Deja Vu, it was as a team, defeating the teams of VD, Ian Knoxx and A.J. Styles, and Hurricane Kid and Towel Boy to earn a match for the CZW World Tag Team Championship later that night, which they lost to the defending champions, H8 Club. They continued teaming over the next few months, facing teams including Sonjay Dutt and Derek Frazier, The Backseat Boyz, and the Softcore Connection. On September 28 at  Sanctioned in Blood, Ca$h defeated Ruckus and Sonjay Dutt in a ladder match. This signalled Ca$h's first major foray into singles competition, taking on Ruckus, Dutt and Jody Fleisch in both singles and three-way matches. At the end of 2002, Ca$h won the CZW award for finishing move of the year."]}, {"page": "CZW Best of the Best", "response": ["|Jody Fleisch"]}, {"page": "Chikara (professional wrestling)", "response": ["* Jody Fleisch"]}, {"page": "Katarina Waters", "response": ["With her rivalry against The Family over, Nikita began a new storyline where an anonymous bounty had been put on her head. As she took on all comers trying to claim the bounty, Nikita went undefeated in the rest of 2003 and 2004. By June 2004 she had faced and defeated most of the company's major wrestlers which led to the return of the World Association of Wrestling's veteran Sweet Saraya who revealed the bounty had been placed on Nikita by the jealous ring announcer, Jane Childs. Saraya claimed the bounty with a non-sanctioned assault on Nikita, delivering a tombstone piledriver at the Carpe Diem event putting Nikita out of action for months and off the FWA roster for over a year. She returned in October 2005 in a losing effort against Simply Luscious. She was victorious on the next show in a six-man tag team match, with her and Luscious on opposing teams. Though Nikita would not wrestle after this point, she realigned herself with former tag team partner Hade Vansen and at New Frontiers 2006 helped him win the FWA British Heavyweight Championship in a five-way event featuring Joe Legend, Alex Shane, Jody Fleisch, and Jonny Storm. She remained at Vansen's side until June's FWA Vs All Star Wrestling event year when she announced her retirement from the company as she had been scouted for World Wrestling Entertainment (WWE) and sent to Ohio Valley Wrestling (OVW) for training."]}, {"page": "Team Britain", "response": [":*Jody Fleisch"]}, {"page": "List of former Impact Wrestling personnel", "response": ["| Jody Fleisch"]}, {"page": "Joel Redman", "response": ["Their first defence took place the next month at Summer Sizzler, defeating Jody Fleisch and Jonny Storm, Jake McCluskey and Kieran Bruce and The Legion of Lords (Gideon Grey and Rishi Ghosh) in a fatal four way to retain. Redman and Garrett successfully defended the championships once again in November, defeating NJPW's Los Ingobernables de Japón (Evil and Bushi) at Global Wars UK. Redman and Garrett (now known as Charlie Sterling) made two successful defences in January 2017, first defeating The London Riots (James Davis and Rob Lynch) at Live at the Cockpit 12, and War Machine (Hanson and Raymond Rowe) at High Stakes."]}, {"page": "2006 TNA World X Cup Tournament", "response": ["Team Mexico and Team Japan were quickly announced as competitors in the 2006 World X Cup, much like they were in the 2004 World X Cup. Team UK was planned, but they were replaced by Team Canada, after two of the members, Doug Williams and Nigel McGuinness were already booked to wrestle in Japan. The other members were to be Jonny Storm and Jody Fleisch."]}, {"page": "British Welterweight Championship", "response": ["|Defeated Jody Fleisch.", "|Jody Fleisch"]}, {"page": "Corey Graves", "response": ["He moved on to feud with Spud, defeating him on May 26 at Know Your Enemy Night One. At Fight Club 2 in July, Keenan defeated Spud in an Iron City Street Fight. Three weeks later, Keenan replaced Matt Hyson in a tag team match, where he and Spud challenged Jody Fleisch and Jonny Storm for the 1PW Tag Team Championship. They were unsuccessful after Keenan attacked Spud during the match. At Invincible in August, a tag team match featuring Keenan and Hyson versus Spud and Teddy Hart ended in a no contest after several other wrestlers interfered, prompting a 10-man elimination tag team match, which Keenan's team won."]}, {"page": "Trent Acid", "response": ["Acid debuted in Combat Zone Wrestling (CZW) in 1999 and competed mostly in singles matches. At the first Cage of Death, he teamed with White Lotus to face the Kashmerinoes (Johnny Kashmere and Robbie Mireno). Acid wrestled many matches against Kashmere before teaming up with him to form The Backseat Boyz. The Backseat Boyz won the CZW Tag Team Championship. While part of this team, Acid still wrestled in the singles division and won the CZW World Junior Heavyweight Championship three times, competing against the likes of Ruckus and Justice Pain for the title. He also became the second Best of the Best winner by defeating Jody Fleisch in the final match at Best of the Best 2. In September 2003, Acid won the vacant CZW Iron Man Championship by defeating Nick Gage and Jimmy Rave in a three-way match."]}, {"page": "Drew McIntyre", "response": ["On 28 August 2006, Galloway finally managed to beat the reigning Irishman and won the IWW International Heavyweight Championship in a singles match.  He successfully defended the belt that evening against Go Shiozaki. In November, Galloway took the championship to London, England in November against Jody Fleisch, However, Galloway was not able to commit to fully defending the title, due to other bookings in his homeland and his academic studies, he was thus forced to relinquish the championship in January 2007."]}, {"page": "King of Europe Cup", "response": ["|Jody Fleisch"]}, {"page": "King of Trios", "response": ["*House Revival (Jody Fleisch, Johnny Moss and Jonny Storm)"]}, {"page": "Pac (wrestler)", "response": ["In January 2007, Pac wrestled as part of Total Nonstop Action Wrestling's Impact! Total tour in Portugal along with fellow British wrestlers Spud, Jonny Storm and Jody Fleisch. Soon after the tour, Pac debuted in Ring of Honor at their 3 and 4 March shows at the Liverpool Olympia in Liverpool, England. On the first night, he lost to Roderick Strong in a match for the FIP World Heavyweight Championship. On the second, he was defeated by Matt Sydal. On 24 August, he returned to ROH in a losing effort against Bryan Danielson. At ROH's Manhattan Mayhem, he lost to Davey Richards. On 21 April, Pac debuted in Chikara at their show Rey De Voladores in a four-way elimination match against Chuck Taylor, Ricochet and Retail Dragon, which was won by Taylor. In August, Pac returned to Chikara at their International Invaders weekend. On the first night, he was defeated by Ricochet. The next night, he was defeated by Claudio Castagnoli. On 23 August, he participated at the eighth Ballpark Brawl, where he lost a six-way elimination match that featured Sterling James Keenan, Trent Acid, El Generico, Xtremo and John McChesney, which was won by Keenan. On 27 May 2012, Pac made his New Japan Pro-Wrestling debut, when he entered the 2012 Best of the Super Juniors tournament, defeating Jushin Thunder Liger in his first match. When the round-robin stage of the tournament concluded on 9 June, PAC finished with five wins out of his eight matches, winning his block and advancing to the semifinals of the tournament. He lost to Ryusuke Taguchi the following day, and was eliminated from the tournament."]}, {"page": "Tohoku Junior Heavyweight Championship", "response": ["!Jody Fleisch||4"]}, {"page": "Mad Dog McPhie", "response": ["McPhie was trained as a professional wrestling at Hammerlock Wrestling in Sittingbourne, Kent under trainers Justin Richards, Alex Shane, Dino Scarlo, and Hammerlock's owner Andre \"The Hammer\" Baker. McPhie competed against many of Hammerlock's wrestlers like \"The Phoenix\" Jody Fleisch, Paul Ashe, Solid Gold, and Scott Parker.Scott Parker on GeoCities In addition, he teamed with \"The Anarchist\" Doug Williams against Gary Steele and Jake \"The Snake\" Roberts on 25 April 1998."]}, {"page": "List of former Ring of Honor personnel", "response": ["|Jody Fleisch"]}, {"page": "1PW Tag Team Championship", "response": ["|Jonny Storm and Jody Fleisch"]}]}}