{"wiki_id": "http://www.wikidata.org/entity/Q3181744", "itemLabel": "John Herety", "itemDescription": "Road racing cyclist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Herety", "wikipedia_page": {"main": "John P Herety (born 8 March 1958) is a former English racing cyclist. He rode for Great Britain in the Olympic Games and won the national road championship as a professional. He is currently manager of the JLT–Condor cycling team, and occasionally provides studio-based analysis of cycle races for British Eurosport.\n\n", "link_mentions": [{"page": "British Cycling", "response": ["In 2003, the first six riders joined British Cycling's new Olympic Academy for junior riders, under the leadership of Rod Ellingworth, with a budget of £100,000 for the first year. Among the first cohort were Ed Clancy and Mark Cavendish, although the latter was almost passed over due to his relatively poor performance in lab tests, with coaches Ellingworth, John Herety and Simon Lillistone lobbying Keen to include him due to his potential. The Academy used a training base in Tuscany from 2006 to 2010, and has since returned to Italy, basing itself in Montichiari since 2016. Other notable riders who participated in the Academy programme include Kennaugh, Geraint Thomas, Ian Stannard, Ben Swift and Simon Yates. That year Keen left his role, whilst continuing to work with British Cycling in a consultancy capacity until the 2004 Summer Olympics: Brailsford was appointed  as his replacement."]}, {"page": "Great Britain at the 1980 Summer Olympics", "response": ["* John Herety"]}, {"page": "Cheadle, Greater Manchester", "response": ["* John Herety (born 1958) former racing cyclist, CycleBase, John HERETY retrieved 3 March 2018 Great Britain in the 1980 Summer Olympics"]}, {"page": "Paul Sherwen", "response": ["Born on 7 June 1956 in Widnes, Lancashire, Sherwen was brought up in Kenya, where his father ran a factory that produced fertiliser, paint and insecticides. He started his sporting life as a swimmer, finishing second in the under-14 Kenyan swimming championship. Upon returning to Britain, he won the regional under-18 championship for Runcorn and District. However, at 16, he turned to cycling and rode for the Weaver Valley CC in Cheshire, receiving guidance from Manchester coach Harold Nelson, and trained regularly with other local riders destined for professional careers, notably Graham Jones, John Herety and Ian Binder."]}, {"page": "List of British cyclists", "response": ["* John Herety"]}, {"page": "Sean Yates", "response": ["As an amateur Yates rode for Athletic Club Boulogne-Billancourt in Paris, Europe's most successful sports club with fellow British riders Kevin Reilly from Southport, John Herety and Jeff Williams. Yates first race for the ACBB was the Grand Prix de Saint-Tropez which he won by riding off the front of the peloton. Yates won fifteen races in total for the ACBB and also finished third in the prestigious individual time trial Grand Prix des Nations which was won by Martial Gayant. Yates had developed a reputation as a strong time trialist and for an incredible turn of speed and power. He turned professional in 1982 for Peugeot riding alongside Graham Jones, Phil Anderson, Robert Millar and Stephen Roche. He stayed with Peugeot for six seasons and became British professional individual pursuit champion in 1982 and 1983."]}, {"page": "Mark Cavendish", "response": ["He gained a place as one of the first six riders selected for British Cycling's Olympic Academy for junior riders in 2003 having almost been rejected because of his relatively poor performance in stationary bike tests. Coaches Rod Ellingworth, John Herety and Simon Lillistone lobbied British Cycling Performance Director Peter Keen to include him because of his potential. Although he initially struggled because of a lack of fitness, he recorded his first win in senior competition in March 2004; in the Girvan Three Day race he managed to latch back onto the lead group after being dropped over a climb before winning the finishing sprint ahead of Julian Winn. Whilst at the academy, he won two gold medals at the 2003 Island Games."]}, {"page": "Harold \"H\" Nelson", "response": ["In the 1970s and 1980s, he coached a number of international road riders, including Alan Kemp, Ian Binder, Brian Pownall, Mike Williams, and Phil Roberts; international riders who were also national champions included multi-national hillclimb champion, Jeff Williams, national road race champions John Herety and Paul Sherwen and national motor-paced champion Ian Donohue. More recently he helped Hamish Haynes (British National Road Race Champion 2006): he joined the training programme as a third-category rider and under Nelson's guidance he became an elite rider within two years before turning professional for a Belgian team. "]}, {"page": "Kristian House", "response": ["Kristian House was born in Britain but moved to the United States as a child, growing up initially in New Jersey and then Austin, Texas, where he began racing as a junior. At 17 he began racing in Belgium, where he stayed for two-and-a-half years. He was selected for the Great Britain Under-23 squad at the UCI Road World Championships in 2000 and 2001, although he did not compete in 2000 after crashing out of Paris-Tours at the same corner as Jan Ullrich. After considering retiring from the sport at the age of 23 due to not securing a professional contract, he joined the Team GB track endurance squad after being introduced to team coach Simon Jones by John Herety, the manager of the British road team."]}, {"page": "AC Boulogne-Billancourt", "response": ["Prior to 1975 the club limited the number of foreign riders who could join.Shay Elliott – The Life and Death of Ireland's First Yellow Jersey However, in 1975, the club changed their policy and started their very own Foreign Legion, which was composed of international cyclists. The club provided the new riders with bikes, clothes, and accommodation and expenses leaving the rider with the job of training and winning races. Notable international cyclists that started with the club include Stephen Roche, Phil Anderson, Robert Millar, Paul Kimmage, Sean Yates, Allan Peiper, Seamus Elliott, Jacques Boyer, Graham Jones, Jaan Kirsipuu, John Herety, and Paul Sherwen ."]}, {"page": "British National Road Race Championships", "response": ["| 1982 || John Herety || Sean Yates || Bill Nickson", "| 1987 || Paul Sherwen || John Herety || Jack Kershaw", "| 1980 || Steve Lawrence || Neil Martin || John Herety", "|John Herety"]}, {"page": "Premier Calendar", "response": ["| align=center|John Herety"]}, {"page": "British National Team Pursuit Championships", "response": ["| AltrinchamMike Williams John HeretyIan Donohue Ian Binder", "| 1980 ||    | VC EuropaPiers Hewitt, Roy CrombieSteve Denton, Gary Sadler || AltrinchamNigel Redmile, John HeretyIan Binder, Ian Donohue || Gemini BCDave Akam, Paul Dennis Steve Homewood, Steve White"]}]}}