{"wiki_id": "http://www.wikidata.org/entity/Q3184779", "itemLabel": "Joseph Connolly", "itemDescription": "British journalist and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Connolly_(author)", "wikipedia_page": {"main": "Joseph Connolly (born March 23 1950) is an English journalist, novelist, non-fiction writer and bibliophile. For many years he owned The Flask Bookshop in Hampstead.", "link_mentions": [{"page": "P. G. Wodehouse", "response": ["On 15 July the journalist William Connor, under his pen name Cassandra, broadcast a postscript to the news programme railing against Wodehouse. According to The Times, the broadcast \"provoked a storm of complaint ... from listeners all over the country\".\"The Government Changes\", The Times, 22 July 1941, p. 4 Wodehouse's biographer, Joseph Connolly, thinks the broadcast \"inaccurate, spiteful and slanderous\";Connolly, p. 92 Phelps calls it \"probably the most vituperative attack on an individual ever heard on British radio\".Phelps, pp. 212–213 The broadcast was made at the direct instruction of Duff Cooper, the Minister of Information, who overruled strong protests made by the BBC against the decision to air the programme. Numerous letters appeared in the British press, both supporting and criticising Wodehouse. The letters page of The Daily Telegraph became a focus for censuring Wodehouse, including one from Wodehouse's friend, ; a reply from their fellow author Compton Mackenzie in defence of Wodehouse was not published because the editor claimed a lack of space.Phelps, pp. 215–216 Most of those defending Wodehouse against accusations of disloyalty, including Sax Rohmer, Dorothy L. Sayers and Gilbert Frankau, conceded that he had acted stupidly.McCrum, p. 315 Some members of the public wrote to the newspapers to say that the full facts were not yet known and a fair judgment could not be made until they were.\"Letters to the Editor\", The Times, 19 July 1941, p. 5 The management of the BBC, who considered Wodehouse's actions no worse than \"ill advised\", pointed out to Cooper that there was no evidence at that point whether Wodehouse had acted voluntarily or under compulsion.Donaldson, p. 242"]}, {"page": "2001 in literature", "response": ["*Joseph Connolly – S.O.S."]}, {"page": "1996 in literature", "response": ["*Joseph Connolly – This Is It"]}, {"page": "Comic novel", "response": ["More contemporary British humorists are George MacDonald Fraser, Tom Sharpe, Kingsley Amis, Terry Pratchett, Richard Gordon, Rob Grant, Douglas Adams, Evelyn Waugh, Anthony Powell, Nick Hornby, Helen Fielding, Eric Sykes, Leslie Thomas, Stephen Fry, Richard Asplin, Mike Harding, Joseph Connolly, and Ben Elton."]}, {"page": "Stuff", "response": ["*Stuff (1997), a novel by Joseph Connolly"]}, {"page": "Berthold Wolpe", "response": ["When World War II was declared Wolpe, along with other German nationals living in England, was sent to an internment camp in Australia. He was permitted to return to England in 1941 and joined the production department at Faber and Faber. His use of Albertus and hand-painted lettering became strongly identified with Faber jackets in the years that followed, and continued from 1958 on the Faber paper covered Editions.James Pardey, 'Wolpe, Albertus and Faber's Classic Covers.'  In: Creative Review, December 2011. He remained at Faber until his retirement in 1975 and is estimated to have designed over 1,500 book covers and dust jackets.Joseph Connolly, 'Berthold Wolpe: An Appreciation.' In: Eighty Years of Book Cover Design. London: Faber and Faber, 2009."]}, {"page": "This Is It (novel)", "response": ["This Is It is a comic novel by Joseph Connolly first published in 1996 about a womanizer who leads a double life, with workdays in London and weekends in the country. When he has an accident and is left partly immobilized for some time, he cannot keep to his sophisticated schedule any longer, and suddenly people who are never meant to meet are in danger of coming face to face with each other and blowing his cover. On top of all that, he is being blackmailed for a criminal activity which is nothing to do with his double life but, with his money having run out, his options are either to be brought to justice or to face serious bodily harm by the hands of the blackmailer.", "*Joseph Connolly: This Is It (Faber and Faber: London, 2006) ()."]}, {"page": "Joe Connolly", "response": ["Joe  or Joseph Connolly may refer to:", "*Joseph Connolly (Irish politician) (1885–1961), Irish Fianna Fáil politician", "*Joseph Connolly (author) (born 1950), British journalist, novelist, non-fiction writer and bibliophile", "*Joseph Connolly (architect) (1840–1904), Irish Canadian architect, born in Limerick, Ireland", "*Joseph Connolly, treasurer of Norfolk County, Massachusetts"]}, {"page": "Bollinger Everyman Wodehouse Prize", "response": ["**Joseph Connolly – England's Lane (Quercus)"]}, {"page": "S.O.S. (novel)", "response": ["S.O.S. is a novel by Joseph Connolly first published in 2001. Set on board a gigantic luxury cruise ship on her way from England to New York, S.O.S. follows the lives and unusual actions of a motley group of people thrown together for six days, the duration of the crossing. They include both passengers and crew, and people wary of sea travel as well as experienced cruise tourists.", "*Joseph Connolly: S.O.S. (Faber and Faber: London, 2007) ()."]}, {"page": "The Write Stuff", "response": ["| Wendy Holden, Joseph Connolly", "| Wendy Holden, Joseph Connolly"]}, {"page": "Eighty Years of Book Cover Design", "response": ["Eighty Years of Book Cover Design is a 2009 book by Joseph Connolly published by Faber and Faber. It illustrates the distinctive cover designs used by Faber over the years."]}, {"page": "Summer Things", "response": ["Summer Things (; ) is a 2002 French-Italian-British romantic comedy-drama film written and directed by Michel Blanc based on the 1998 novel of the same name by Joseph Connolly."]}, {"page": "Alain Defossé", "response": ["Defossé authored nine novels. His first novel,  Les fourmis d'Anvers, was published in 1991. He also translated several books from English into French. For example, he translated Crazy Cock by Henry Miller in 1990. He also translated American Psycho by Bret Easton Ellis in 1993. In 2006, he translated The Night Watch by Sarah Waters. Two years later, in 2008, he translated Rant by Chuck Palahniuk. Other novelists whose work he translated are Irvine Welsh and Joseph Connolly."]}, {"page": "List of Private Passions episodes (2000–2004)", "response": ["|rowspan=\"10\"|Joseph Connolly"]}]}}