{"wiki_id": "http://www.wikidata.org/entity/Q3187232", "itemLabel": "Joyce Lankester Brisley", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Joyce_Lankester_Brisley", "wikipedia_page": {"main": "Joyce Lankester Brisley (6 February 1896 – 1978) was an English writer. She wrote and illustrated the Milly-Molly-Mandy series, which were first printed in 1925 by the Christian Science Monitor.\nThe second of three daughters of George Brisley, a pharmacist, of Bexhill-on-Sea, Sussex, Brisley's sisters- Ethel Constance, the eldest, and Nina Kennard, the youngest- were also illustrators. They studied art firstly at Hastings School of Art, then, following their parents' divorce in 1912 and the subsequent relocation of the girls and their mother to Brixton, at Lambeth School of Art.All three sisters illustrated postcards for the publisher Alfred Vivian Mansell & Co., with Nina (who also illustrated Elinor Brent-Dyer's Chalet School series) and Ethel becoming quite prolific. Brisley died in 1978 at the age of 82.\n\n", "link_mentions": [{"page": "Bexhill-on-Sea", "response": ["* Joyce Lankester Brisley (1896–1978), writer of the Milly-Molly-Mandy stories, etc. – exact place of birth unidentified."]}, {"page": "Victor Ambrus", "response": ["Ambrus was born on 19 August 1935 in Budapest, Hungary. He continued to live in the capital, but spent many childhood holidays in the country, where he learnt to draw horses. As he grew older he became an admirer of the illustrators Mihály Zichy, E. H. Shepard, Joyce Lankester Brisley, and the large historical paintings which he saw in public galleries. He received his secondary education at the St Imre Cistercian College, Budapest (1945–1953), before going on to study at the Hungarian Academy of Fine Arts for three years (1953–56), where he was given a thorough grounding in drawing, anatomy and print-making. His four-year course was interrupted by the unsuccessful 1956 Hungarian Revolution against the Soviet-backed government, during which a building that he and his fellow students held came under fire from the Soviets."]}, {"page": "Milly-Molly-Mandy", "response": ["Milly-Molly-Mandy is a set of children's books written and illustrated by Joyce Lankester Brisley. The books follow a little girl, Milly-Molly-Mandy, who wears a pink-and-white striped dress. The illustrations show Milly-Molly-Mandy growing from about age four through to age eight."]}, {"page": "List of British children's and young adults' authors (1900–1949)", "response": ["* Joyce Lankester Brisley (1896–1978)"]}, {"page": "List of early-20th-century British children's literature illustrators", "response": ["* Joyce Lankester Brisley (1896–1978)"]}, {"page": "List of children's classic books", "response": ["|Joyce Lankester Brisley"]}, {"page": "1928 in the United Kingdom", "response": ["* Joyce Lankester Brisley's children's collection Milly-Molly-Mandy Stories, introducing the title character in book form."]}, {"page": "Adventures of the Little Wooden Horse", "response": ["Adventures of the Little Wooden Horse is a children's novel by Ursula Moray Williams, published by George G. Harrap in 1939 with illustrations by Joyce Lankester Brisley. Early editions of the novel were illustrated by Brisley; later illustrators include Peggy Fortnum and Paul Howard. It was most recently published in 2011 by Macmillan Publishers, who also included it in the Kingfisher Modern Classics series.\"The Adventures of the Little Wooden Horse\" at Fantastic Fiction.    (The title of the novel may be Adventures of the Little Wooden Horse in all editions.)"]}, {"page": "Milly-Molly-Mandy Stories", "response": ["Molly-Molly Mandy Stories is the first of four original books in the Milly-Molly-Mandy series written by Joyce Lankester Brisley. It was published in 1928 in both paperback and hardback copies."]}, {"page": "Mandy (name)", "response": ["Its usage as a popular female name can be traced back to at least the beginning of the 20th century, with the song \"Mandy\" by Irving Berlin in 1919, and the Joyce Lankester Brisley's children's books of Milly-Molly-Mandy in the 1920s. The pop songs \"Mandy\" by Barry Manilow (1974) and the Irish boyband Westlife (2003) and I'm Mandy Fly Me by 10CC (1976) speak to the resurgent popularity of the name in recent times."]}, {"page": "Brisley (surname)", "response": ["* Joyce Lankester Brisley, English writer"]}, {"page": "List of people from Sussex", "response": ["* Joyce Lankester Brisley (1896-1978), writer"]}]}}