{"wiki_id": "http://www.wikidata.org/entity/Q3181058", "itemLabel": "John Bigland", "itemDescription": "Historian and schoolmaster", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Bigland", "wikipedia_page": {"main": "John Bigland (1750 – 22 February 1832) was an English schoolmaster and later a historian.\n\n", "link_mentions": [{"page": "Sable", "response": ["Sable fur has been a highly valued item in the fur trade since the early Middle Ages, and is generally considered to have the most beautiful and richly tinted pelt among martens. Sable fur is unique because it retains its smoothness in every direction it is stroked. The fur of other animals feels rough stroked against the grain.A Natural History of Animals by John Bigland, published by Grigg, Elliot & Co., 1844 A wealthy 17th-century Russian diplomat once described the sable as \"A beast full marvelous and prolific ... a beast that the Ancient Greeks and Romans called the Golden Fleece.\" Russian sables would typically be skinned over the mouth with no incision being made on the body. The feet would be retained, so as to keep as much fur as possible. Byzantine priests would wear sable for their rituals.Furs and Fur Garments by Richard Davey, published by READ BOOKS, 2008, "]}, {"page": "Skirlaugh", "response": ["*John Bigland (1750–1832), schoolmaster and historian"]}, {"page": "Wade's Causeway", "response": ["The first antiquarians to discuss the site in the eighteenth and nineteenth centuries dismissed early folkloric explanations of its origins. Roman roads were of particular interest to eighteenth-century antiquarians, and they sought to explain the Wheeldale structure in the context of Roman activity in the North York Moors area in the first and second centuries AD. Specifically, it was commonly suggested in their writings that the causeway was most probably constructed to connect the Roman Cawthorne Camp to the south with the Roman garrison fort at Lease Rigg near Grosmont to the north.  The excavated section of the structure does lie linearly approximately between these two sites, which Knight et al. believe lend credence to its being of Roman origin. Its average reported width of approximately  plus  wide lateral ditches flanking either side matches closely to the width of other Roman roads in Britain (e.g. Stanegate at ) as well as to the average of  for Roman roads internationally; historian John Bigland, writing in 1812, also states that there is no other plausible alternative for the structure's scale and method of construction than \"Roman industry and labour\"."]}, {"page": "Bigland", "response": ["*John Bigland (1750–1832), English schoolmaster and later an historian"]}, {"page": "The Beauties of England and Wales", "response": ["The Beauties of England and Wales (1801–1815) is a series of books describing the topography and local history of England and Wales. Produced by a variety of London publishers, the work appeared in 18 multi-part volumes arranged by county, individually authored by John Bigland, Edward Wedlake Brayley, J. Norris Brewer, John Britton, John Evans, John Hodgson, Francis Charles Laird, Joseph Nightingale, Thomas Rees, and Frederic Shoberl. Each volume contained engraved illustrations by artists such as Thomas Hearne, J. M. W. Turner, John Varley, Benjamin West. Readers included Charles Dickens."]}, {"page": "Thomas Hinderwell", "response": ["Thomas Hinderwell (1744–1825) was a British, eighteenth-century historian. He is probably best remembered for his History of Scarborough, which was first published in York in 1798. Fellow antiquarian John Bigland described it as \"one of the most accurate and interesting works relating to this or any other part of England\".http://www.scarboroughcivicsociety.org.uk/Thomas-Hinderwell.php"]}, {"page": "Bigland, John", "response": ["#redirectJohn Bigland"]}]}}