{"wiki_id": "http://www.wikidata.org/entity/Q3181957", "itemLabel": "John Lucarotti", "itemDescription": "British television writer and novelist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Lucarotti", "wikipedia_page": {"main": "John Vincent Lucarotti (20 May 1926 – 20 November 1994) was a British-Canadian screenwriter and author who worked on The Avengers, The Troubleshooters and Doctor Who in the 1960s.", "link_mentions": [{"page": "Aldershot", "response": ["* John Lucarotti, screenwriter."]}, {"page": "Robert Holmes (scriptwriter)", "response": ["*The Ark in Space (from a story by John Lucarotti)"]}, {"page": "Marco Polo (Doctor Who)", "response": ["Marco Polo is the fourth serial of the British science fiction television series Doctor Who. It was first broadcast on BBC TV in seven weekly parts from 22 February to 4 April 1964. It was written by John Lucarotti and directed largely by Waris Hussein; John Crockett directed the fourth episode. The story is set in Yuan-era China in the year 1289, where the Doctor (William Hartnell), his granddaughter Susan Foreman (Carole Ann Ford), and her teachers Ian Chesterton (William Russell) and Barbara Wright (Jacqueline Hill) meet the Italian merchant-explorer Marco Polo (Mark Eden) and Mongolian Emperor Kublai Khan (Martin Miller).", "Show creator Sydney Newman suggested writer John Lucarotti, an old colleague from the Canadian Broadcasting Corporation, to the production team during the show's early development. Story editor David Whitaker contacted Lucarotti to write for the programme; Lucarotti, who had recently worked on the 18-part radio serial The Three Journeys of Marco Polo (1955), was commissioned on 9 July 1963 to write a seven-part serial about Italian merchant and explorer Marco Polo, titled Dr Who and a Journey to Cathay. While developing the storyline Lucarotti struggled with the fourth episode, and used anecdotal material from Polo's memoirs, The Travels of Marco Polo, to pad out the plot. The serial was originally placed third in the show's running order, to begin broadcast on 18 January 1964, but was pushed back to fourth to accommodate the two-part \"filler\" serial The Edge of Destruction. Waris Hussein, who worked on the show's first serial, was selected as the director for Marco Polo; John Crockett directed the fourth episode in Hussein's absence.", "Category:Doctor Who serials novelised by John Lucarotti"]}, {"page": "The Aztecs (Doctor Who)", "response": ["The Aztecs is the sixth serial in the British science fiction television series Doctor Who, which was first broadcast on BBC1 in four weekly parts from 23 May to 13 June 1964. It was written by John Lucarotti and directed by John Crockett. In the serial, the First Doctor (William Hartnell), his granddaughter Susan (Carole Ann Ford), and teachers Ian Chesterton (William Russell) and Barbara Wright (Jacqueline Hill) arrive in Mexico during the Aztec empire. Barbara becomes mistaken for the goddess Yetaxa, and accepts the identity in hope of persuading the Aztecs to give up human sacrifice, despite the Doctor's warnings about changing history.", "Writer John Lucarotti was commissioned to write The Aztecs by script editor David Whitaker on 25 February 1964, while another of his stories—the show's fourth serial, Marco Polo—was in production. Having lived in Mexico, Lucarotti was fascinated by the Aztec civilisation. He described them as \"a highly civilised and cultured race\", and was particularly fascinated by their obsession with human sacrifice. Lucarotti wrote the scripts aboard his boat in Majorca, delivering the completed scripts on 18 March 1964. John Crockett was assigned to direct the serial due to his knowledge of history, having previously worked on the fourth episode of Marco Polo. Designer Barry Newbery found the serial difficult for research, due to the limited information on the Aztecs at the time. Researching using books provided by the BBC, he designed the tomb door based on the \"comic book\" style of Aztec design. He had also watched a documentary about Aztec archaeology on ITV, and was concerned that a larger studio would be required for production. Costume designer Daphne Dare used artistic license with her costumes in the serial, since male Aztecs usually only wore brief loincloths and cloaks, while women were often topless.", "A novelisation of this serial, written by John Lucarotti, was published by Target Books on 21 June 1984, with artwork by Nick Spender; for the paperback reissue by Virgin Books in September 1992, the cover was designed by Andrew Skilleter. An audiobook reading of the novelisation, narrated by William Russell, was published by AudioGO in August 2012.", "Category:Doctor Who serials novelised by John Lucarotti"]}, {"page": "Doctor Who spin-offs", "response": ["Not all Target novelisations faithfully followed the scripts. John Lucarotti's The Massacre (1987) completely changed the plot of the source serial, The Massacre of St Bartholomew's Eve. Some guide books (notably 1999's A Critical Guide to Doctor Who on Television by Kenneth Muir) describe the plot of the novel rather than the original serial due to the fact the original serial is one of the many that were lost. Also, when Target launched the novelisation line, there was no inkling that ultimately more than 150 of the show's storylines would be adapted; as a result, there are numerous continuity gaps between early Target books and the scripts and/or later published novelisations; one example is Doctor Who and the Doomsday Weapon (based upon Colony in Space) which as written depicts Jo Grant's first adventure with the Doctor, even though the television series introduced her several serials earlier in Terror of the Autons (which was novelised at a later date and ignored the discrepancy). Authors sometimes added epilogues to their novelisations which were at odds with other material: The Curse of Fenric by Ian Briggs suggested a fate for Ace that differed from later original novels, and Philip Martin's adaptation of the Mindwarp segment of The Trial of a Time Lord included an ending that completely contradicted the scripted ending of the televised serial."]}, {"page": "The Ark in Space", "response": ["The script, written by Robert Holmes, is from a story by John Lucarotti, which was rewritten because it was considered unusable. Holmes rewrote The Ark in Space as a four-part serial as a lead-in to the two part The Sontaran Experiment. Lucarotti does not receive any on-screen credit. Barry Letts had planned the story, originally called Space Station, before Philip Hinchcliffe took over as producer. Letts had also planned to produce the four-part serial alongside the two-part Sontaran Experiment, so it was treated as a single six-part story to save money; The Ark in Space was filmed entirely in-studio, while The Sontaran Experiment was filmed entirely on location."]}, {"page": "The Reign of Terror (Doctor Who)", "response": ["In late 1963, the eighth serial of Doctor Who was set to be titled Doctor Who and the Red Fort, a seven-part story set during the Indian Rebellion of 1857 and written by Terry Nation. However, by January 1964, little work had been done on the serial, and Nation was busy writing The Keys of Marinus. Script editor David Whitaker was later assigned to the episode, possibly about the Spanish Armada, with Gerald Blake to direct; however, this was soon scrapped, and Whitaker asked Dennis Spooner, a friend of Nation, to write an episode instead. Although Spooner was originally interested in writing a science fiction story, Whitaker was seeking a historical serial after John Lucarotti's Marco Polo and The Aztecs. Spooner was given four possible subjects, eventually deciding to focus on the French Revolution, a setting first suggested by actor William Russell. Spooner was officially commissioned by Whitaker on 2 April 1964, following Spooner's submission of a 23-page breakdown for the serial. Hungarian director Henric Hirsch was chosen to direct the serial after producer Verity Lambert saw his work on First Night, while Stanley Myers composed the serial's incidental music. Myers created 28 minutes of music for the serial, taking cues from French music such as the national anthem \"La Marseillaise\"."]}, {"page": "The Massacre of St Bartholomew's Eve", "response": ["Script editor Donald Tosh rewrote much of the script delivered by John Lucarotti. In a monograph on The Massacre, James Cooray Smith argues that the Doctor's similarity with the Abbot of Amboise was inspired by a real historical event, the impersonation in 1562 of the Abbot responsible for Marmoutier Abbey in the commune of Amboise by a man called Chastillon, who was later executed. He suggests that Lucarotti's original script (which no longer exists) involved the Doctor extensively impersonating the Abbot with the audience's connivance, whereas Tosh's preference was for the audience to be left unsure whether or not the Abbot was really the Doctor, leading to the disagreements between the two. There are conflicting accounts as to whether Lucarotti's name was removed from the credits at his request. Tosh is credited with co-writing the final episode, on which incoming script editor Gerry Davis was credited as script editor in his place.", "John Lucarotti's 1987 novelisation of this serial for Target Books, entitled simply The Massacre, returned the story to a previous draft before both a scheduled holiday for Hartnell and technical limitations forced a number of rewrites (allowing Hartnell to not have to be present during recording of the second episode and removing the need for Hartnell to be doubled throughout the story).", "Category:Doctor Who serials novelised by John Lucarotti"]}, {"page": "Moonbase 3", "response": ["  The final two scripts, \"The Dark Side of the Moon\" and \"The Gentle Rain\" (later renamed \"Castor and Pollux\" and \"Achilles Heel\" respectively), were commissioned from John Lucarotti, a prolific writer whose credits included The Avengers, Doctor Who and The Troubleshooters.", "| rowspan=\"2\" style=\"text-align:center;\"|3||\"Achilles Heel\"||John Lucarotti||Christopher Barry|| style=\"text-align:center;\"|23 September 1973|| style=\"text-align:center;\"|7:25pm|| style=\"text-align:center;\"|51’45’’", "| rowspan=\"2\" style=\"text-align:center;\"|5||\"Castor and Pollux\"||John Lucarotti||Christopher Barry|| style=\"text-align:center;\"|7 October 1973|| style=\"text-align:center;\"|7:24pm|| style=\"text-align:center;\"|51’33’’"]}, {"page": "Donald Tosh", "response": ["Tosh was the story editor for the Doctor Who stories between The Time Meddler and The Massacre of St Bartholomew's Eve, working with producers Verity Lambert and John Wiles. On Tosh's final story, The Massacre of St Bartholomew's Eve by John Lucarotti, Tosh performed a substantial rewrite of the scripts, both to align them with historical accuracy and also to accommodate William Hartnell's dual role as both the Doctor and the Abbot of Amboise.http://www.scotlandnow.dailyrecord.co.uk/lifestyle/doctor-who-story-editor-donald-4282399 On the final episode the story editor's credit was given over to his successor Gerry Davis and Tosh was co-credited."]}, {"page": "United!", "response": ["Created by Anthony Cornish, other writers on the programme included Gerry Davis, Brian Hayles, Malcolm Hulke and John Lucarotti. The directors included Innes Lloyd and Derek Martinus. Aside from Cornish, all of these individuals also worked on Doctor Who concurrent with their involvement in United!."]}, {"page": "Into the Labyrinth (TV series)", "response": ["Several scriptwriters for the series had previously worked on Doctor Who, including co-creator Bob Baker, Robert Holmes, Anthony Read and John Lucarotti."]}, {"page": "The Borderers", "response": ["|rowspan=\"2\" align=\"center\"|12||\"Justice\"||John Lucarotti||Peter Graham Scott ||align=\"center\"|18 March 1969||align=\"center\"|Missing"]}, {"page": "List of Doctor Who writers", "response": ["| Bob Holmes was the most prolific writer of the classic era. Holmes co-wrote The Ark in Space with John Lucarotti. He also co-wrote The Talons of Weng-Chiang with Robert Banks Stewart.  Neither, however, received on screen credit for their efforts."]}, {"page": "List of Doctor Who novelisations", "response": ["|006 ||88||The Aztecs ||data-sort-value=\"01\"|1st|| data-sort-value=\"Lucarotti, John\"|John Lucarotti || 21 June 1984 || 20 September 1984|| Unabridged", "|004 ||94||Marco Polo ||data-sort-value=\"01\"|1st|| data-sort-value=\"Lucarotti, John\"|John Lucarotti || 13 December 1984 || 11 April 1985|| Unabridged", "|022 ||122||The Massacre ||data-sort-value=\"01\"|1st|| data-sort-value=\"Lucarotti, John\"|John Lucarotti || 18 June 1987 || 19 November 1987||Unabridged"]}, {"page": "List of The Avengers (TV series) episodes", "response": ["| John Lucarotti, Gerald Verner", "| John Lucarotti", "| John Lucarotti", "| John Lucarotti", "| John Lucarotti"]}, {"page": "List of unmade Doctor Who serials and films", "response": ["Written by John Lucarotti and was planned to be about the 1857 Indian Mutiny.", "Written by John Lucarotti and was planned to be about Leif Eriksson. Story editor Donald Tosh turned down the storyline due to having already recently featured Vikings in The Time Meddler. Lucarotti later penned a short story for issue 184 of Doctor Who Magazine published in 1992, called \"Who Discovered America?\", which reuses the rejected storyline.", "Written by John Lucarotti, this script came about after Space Station was rejected. and Lucarotti was suggested by Terrance Dicks as a replacement writer on the strength of his Moonbase 3 script. The story would use the same space station setting as Space Station,. the setting being dictated by the production office as means of saving money by having it share sets with Revenge of the Cybermen. Commissioned in June 1974, Lucarotti devised the concept of the ark, a space station that housed a huge plot of countryside the size of Kent – a sort of Home Counties in space. His six-part story concerned the invasion of the ark by a species called the Delc, a spore-like fungus with separate heads and bodies. The final episode was to have the Doctor defeating the Delc leader by hitting it out into space with a golf club, and indeed Lucarotti planned to give each episode a frivolous title, citing Puffball as the title of an early episode and Golfball as the title of the final episode. When the draft scripts arrived from his home in Corsica, Holmes and Hinchcliffe felt they were far too ambitious and complicated to realise on the programme's budget and Lucarotti had over-conceptualised the story, which meant that it was inappropriate for the viewers.Archive.org/web/Doctor Who In-Vision 002 The Ark in Space - retrieved 6 June 2014 It was replaced by a different story with the same title by Robert Holmes, which shared only the setting with the previous version. Big Finish Productions has announced an audio adaptation of this story, written by Jonathan Morris for their Lost Stories range for release in March 2023. This adaptation will maintain the original episode titles, as written by Lucarotti."]}, {"page": "List of Onedin Line episodes", "response": ["Written by: John Lucarotti"]}, {"page": "Treasure Island (1977 TV series)", "response": ["Jim Hawkins (Ashley Knight) discovers a treasure map and embarks on a journey to find the treasure, but pirates led by Long John Silver (Alfred Burke) have plans to take the treasure for themselves by way of mutiny.  This four-episode adaptation by John Lucarotti, while particularly faithful to the original, adds an expanded narrative concerning the declining Daniel Hawkins, as well as clarifying Squire Trelawney's naiveté in trusting Blandly and Silver."]}, {"page": "Radisson (TV series)", "response": ["Filming of the 39-episode series began on 20 August 1956 in studios at Montreal and with location shooting in surrounding areas such as the Saint Lawrence River and Île Perrot. The series was produced in English and French with a common cast. Scriptwriter John Lucarotti was paid $300 per episode, based on single airings per CBC station. The French scripts were translations by René Normand. It was among the first significant filmed television dramas produced in Canada.", "The series theme song was sung by Wally Koster, with its music and lyrics written by Johnny Cowell and John Lucarotti respectively."]}, {"page": "Doctor Who (season 12)", "response": ["Robot was written by Dicks, who cited King Kong as an influence for the serial. Dicks incorporated several familiar elements from the Third Doctor's first story Spearhead from Space (1970), which helped the audience transition between actors.Cornell, Day and Topping (2004)  The Ark in Space was written by Robert Holmes from a story by John Lucarotti that was considered unusable.Cornell, Day and Topping (2004) p. 168 Letts and Dicks were eager to have Terry Nation return to write the Daleks, but initially found his script too similar to past Dalek adventures. They suggested that he write a Dalek origin story instead, which became Genesis of the Daleks. However, under Hinchcliffe, the serial gained a darker tone."]}, {"page": "Doctor Who (season 3)", "response": ["|John Lucarotti"]}, {"page": "Doctor Who (season 1)", "response": ["The first eight serials were written by six writers: Whitaker, Anthony Coburn, Terry Nation, John Lucarotti, Peter R. Newman, and Dennis Spooner. Webber also co-wrote the show's first episode. The show was developed with three particular story types envisioned: past history, future technology, and alternative present; Coburn, Lucarotti, and Spooner wrote historical episodes, Nation and Newman penned futuristic stories, and Whitaker wrote a \"filler\" serial set entirely in the TARDIS. The serials were mostly directed by junior directors, such as Waris Hussein, John Gorrie, John Crockett, Henric Hirsch, Richard Martin, Christopher Barry, and Frank Cox; the exception is experienced director Mervyn Pinfield, who directed the first four episodes of The Sensorites. Filming started in September 1963 and lasted for approximately nine months, with weekly recording taking place mostly at Lime Grove Studios or the BBC Television Centre.", "Newman suggested writer John Lucarotti to the production team during the show's early development. Lucarotti, who had recently worked on the 18-part radio serial The Three Journeys of Marco Polo (1955), penned a seven-part serial about the Italian merchant and explorer Marco Polo titled Dr Who and a Journey to Cathay. Later known as Marco Polo, the serial was moved from its placement in the running order to accommodate The Edge of Destruction. Lucarotti was approached to write The Aztecs while Marco Polo was in production. Having lived in Mexico, Lucarotti was fascinated by the Aztec civilisation and their obsession with human sacrifice. The show's eighth serial, The Reign of Terror, is also a historical story, though writer Dennis Spooner was initially interested in writing a science fiction story. Whitaker gave Spooner four possible historical subjects, and he ultimately selected the French Revolution.", "|John Lucarotti", "|John Lucarotti"]}, {"page": "Killer Whale (The Avengers)", "response": ["\"Killer Whale\" is the twenty-sixth episode of the second series of the 1960s cult British spy-fi television series The Avengers, starring Patrick Macnee and Honor Blackman. It originally aired on ABC on 23 March 1963. The episode was directed by Kim Mills and written by John Lucarotti."]}, {"page": "Death a la Carte", "response": ["\"Death a la Carte\" is the thirteenth episode of the third series of the 1960s cult British spy-fi television series The Avengers, starring Patrick Macnee and Honor Blackman. It originally aired on ABC on 21 December 1963. The episode was directed by Kim Mills and written by John Lucarotti."]}, {"page": "The White Elephant", "response": ["\"The White Elephant\" is the fifteenth episode of the third series of the 1960s cult British spy-fi television series The Avengers, starring Patrick Macnee and Honor Blackman. It originally aired on ABC on 4 January 1964. The episode was written by John Lucarotti."]}, {"page": "List of people from Hampshire", "response": ["*John Lucarotti, screenwriter, was born in Aldershot"]}, {"page": "May 1926", "response": ["*Born: John Lucarotti, screenwriter, in Aldershot, England (d. 1994)"]}]}}