{"wiki_id": "http://www.wikidata.org/entity/Q318054", "itemLabel": "Joseph Needham", "itemDescription": "British biochemist, historian and sinologist (1900–1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Needham", "wikipedia_page": {"main": "Noel Joseph Terence Montgomery Needham  (; 9 December 1900 – 24 March 1995) was a British biochemist, historian and sinologist known for his scientific research and writing on the history of Chinese science and technology, initiating publication of the multivolume Science and Civilisation in China. He was elected a fellow of the Royal Society in 1941, and a fellow of the British Academy in 1971. In 1992, Queen Elizabeth II conferred on him the Companionship of Honour, and the Royal Society noted he was the only living person to hold these three titles.", "link_mentions": [{"page": "Army", "response": ["Sun Tzu's The Art of War remains one of China's Seven Military Classics, even though it is two thousand years old.In the twentieth c., Mao Zedong (People's Republic of China), General Võ Nguyên Giáp (Viet Nam), General Douglas MacArthur (United States),  and in medieval Japan, Takeda Shingen (1521–1573) have drawn inspiration from the work Since no political figure could exist without an army, measures were taken to ensure only the most capable leaders could control the armies.\"who wishes to fight must first count the cost\" —Sun Tzu, The Art of War Civil bureaucracies (士大夫) arose to control the productive power of the states, and their military power.\"You conquered the empire on horseback, but from horseback, you will never succeed in ruling it.\" —Lu Chia, as quoted by Joseph Needham, Science and Civilisation in China. vol 7, part II."]}, {"page": "Acupuncture", "response": ["According to historians Lu Gwei-djen and Joseph Needham, there is substantial evidence that acupuncture may have begun around 600 BC. Some hieroglyphs and pictographs from that era suggests acupuncture and moxibustion were practised. However, historians Lu and Needham said it was unlikely a needle could be made out of the materials available in China during this time period. It is possible that bronze was used for early acupuncture needles. Tin, copper, gold and silver are also possibilities, though they are considered less likely, or to have been used in fewer cases. If acupuncture was practised during the Shang dynasty (1766 to 1122 BC), organic materials like thorns, sharpened bones, or bamboo may have been used. Once methods for producing steel were discovered, it would replace all other materials, since it could be used to create a very fine, but sturdy needles. Lu and Needham noted that all the ancient materials that could have been used for acupuncture and which often produce archaeological evidence, such as sharpened bones, bamboo or stones, were also used for other purposes. An article in Rheumatology said that the absence of any mention of acupuncture in documents found in the tomb of Mawangdui from 198 BC suggest that acupuncture was not practised by that time."]}, {"page": "Traditional Chinese medicine", "response": ["Stone and bone needles found in ancient tombs led Joseph Needham to speculate that acupuncture might have been carried out in the Shang dynasty. This being said, most historians now make a distinction between medical lancing (or bloodletting) and acupuncture in the narrower sense of using metal needles to attempt to treat illnesses by stimulating points along circulation channels (\"meridians\") in accordance with beliefs related to the circulation of \"Qi\". The earliest evidence for acupuncture in this sense dates to the second or first century BCE."]}, {"page": "Wuxing (Chinese philosophy)", "response": ["* Joseph Needham, Science and Civilization in China, volume 2, pp. 262–23."]}, {"page": "Cannon", "response": ["Chen Bingying argues there were no guns before 1259, while Dang Shoushan believes the Wuwei gun and other Western Xia era samples point to the appearance of guns by 1220, and Stephen Haw goes even further by stating that guns were developed as early as 1200. Sinologist Joseph Needham and renaissance siege expert Thomas Arnold provide a more conservative estimate of around 1280 for the appearance of the \"true\" cannon. Whether or not any of these are correct, it seems likely that the gun was born sometime during the 13th century.", "According to historian Ahmad Y. al-Hassan, during the Battle of Ain Jalut in 1260, the Mamluks used cannon against the Mongols. He claims that this was \"the first cannon in history\" and used a gunpowder formula almost identical to the ideal composition for explosive gunpowder. He also argues that this was not known in China or Europe until much later. Hassan further claims that the earliest textual evidence of cannon is from the Middle East, based on earlier originals which report hand-held cannons being used by the Mamluks at the Battle of Ain Jalut in 1260. Such an early date is not accepted by some historians, including David Ayalon, Iqtidar Alam Khan, Joseph Needham and Tonio Andrade. Khan argues that it was the Mongols who introduced gunpowder to the Islamic world,. and believes cannon only reached Mamluk Egypt in the 1370s.. Needham argued that the term midfa, dated to textual sources from 1342 to 1352, did not refer to true hand-guns or bombards, and that contemporary accounts of a metal-barrel cannon in the Islamic world did not occur until 1365. Similarly, Andrade dates the textual appearance of cannons in middle eastern sources to the 1360s. Gabor Ágoston and David Ayalon note that the Mamluks had certainly used siege cannons by 1342 or the 1360s, respectively, but earlier uses of cannons in the Islamic World are vague with a possible appearance in the Emirate of Granada by the 1320s and 1330s, though evidence is inconclusive."]}, {"page": "Encyclopedia", "response": ["There were many great encyclopedists throughout Chinese history, including the scientist and statesman Shen Kuo (1031–1095) with his Dream Pool Essays of 1088, the statesman, inventor, and agronomist Wang Zhen (active 1290–1333) with his Nong Shu of 1313, and the written Tiangong Kaiwu of Song Yingxing (1587–1666), the latter of whom was termed the \"Diderot of China\" by British historian Joseph Needham.Needham, Volume 5, Part 7, 102."]}, {"page": "Flat Earth", "response": ["This analogy with a curved egg led some modern historians, notably Joseph Needham, to conjecture that Chinese astronomers were, after all, aware of the Earth's sphericity. The egg reference, however, was rather meant to clarify the relative position of the flat Earth to the heavens:", "As noted in the book Huainanzi,Joseph Needham, p. 225. in the 2nd century BC, Chinese astronomers effectively inverted Eratosthenes' calculation of the curvature of the Earth to calculate the height of the Sun above the Earth. By assuming the Earth was flat, they arrived at a distance of  (approximately ). The Zhoubi Suanjing also discusses how to determine the distance of the Sun by measuring the length of noontime shadows at different latitudes, a method similar to Eratosthenes' measurement of the circumference of the Earth, but the Zhoubi Suanjing assumes that the Earth is flat.", "A spherical terrestrial globe was introduced to Yuan-era Khanbaliq (i.e. Beijing) in 1267 by the Persian astronomer Jamal ad-Din, but it is not known to have made an impact on the traditional Chinese conception of the shape of the Earth.Joseph Needham et al.: \"Heavenly clockwork: the great astronomical clocks of medieval China\", Antiquarian Horological Society, 2nd. ed., Vol. 1, 1986, , p. 138. As late as 1595, an early Jesuit missionary to China, Matteo Ricci, recorded that the Ming-dynasty Chinese say: \"The Earth is flat and square, and the sky is a round canopy; they did not succeed in conceiving the possibility of the antipodes.\""]}, {"page": "History of physics", "response": ["The study of magnetism in Ancient China dates back to the 4th century BCE. (in the Book of the Devil Valley Master),Li Shu-hua, \"Origine de la Boussole 11. Aimant et Boussole\", Isis, Vol. 45, No. 2. (Jul., 1954), p.175 A main contributor to this field was Shen Kuo (1031–1095), a polymath and statesman who was the first to describe the magnetic-needle compass used for navigation, as well as establishing the concept of true north. In optics, Shen Kuo independently developed a camera obscura.Joseph Needham, Volume 4, Part 1, 98."]}, {"page": "History of science", "response": ["The Jesuit China missions of the 16th and 17th centuries \"learned to appreciate the scientific achievements of this ancient culture and made them known in Europe. Through their correspondence European scientists first learned about the Chinese science and culture.\"Agustín Udías, Searching the Heavens and the Earth: The History of Jesuit Observatories. (Dordrecht, The Netherlands: Kluwer Academic Publishers, 2003). p. 53 Western academic thought on the history of Chinese technology and science was galvanized by the work of Joseph Needham and the Needham Research Institute. Among the technological accomplishments of China were, according to the British scholar Needham, early seismological detectors (Zhang Heng in the 2nd century), the water-powered celestial globe (Zhang Heng), matches, the independent invention of the decimal system, dry docks, sliding calipers, the double-action piston pump, cast iron, the blast furnace, the iron plough, the multi-tube seed drill, the wheelbarrow, the suspension bridge, the winnowing machine, the rotary fan, the parachute, natural gas as fuel, the raised-relief map, the propeller, the crossbow, and a solid fuel rocket, the multistage rocket, the horse collar, along with contributions in logic, astronomy, medicine, and other fields."]}, {"page": "Inertia", "response": ["The sinologist Joseph Needham credits The Mozi (a Chinese text from the Warring States period (475–221 BCE) as the first description of inertia.  Before the European Renaissance the prevailing theory of motion in western philosophy  was that of Aristotle (335 BCE to 322 BCE). Aristotle said that all moving objects (on Earth) eventually come to rest unless an external power (force) continued to move them. Extract of page 21 Aristotle explained the continued motion of projectiles, after being separated from their projector, as (an itself unexplained) action of the surrounding medium continuing to move the projectile.Aristotle, Physics, 8.10, 267a1–21; Aristotle, Physics, trans. by R. P. Hardie and R. K. Gaye ."]}, {"page": "Metre", "response": ["As a result of the Lumières and during the French Revolution, the French Academy of Sciences charged a commission with determining a single scale for all measures. On 7 October 1790 that commission advised the adoption of a decimal system, and on 19 March 1791 advised the adoption of the term mètre (\"measure\"), a basic unit of length, which they defined as equal to one ten-millionth of the quarter meridian, the distance between the North Pole and the Equator along the meridian through Paris.('decimalization is not of the essence of the metric system; the real significance of this is that it was the first great attempt to define terrestrial units of measure in terms of an unvarying astronomical or geodetic constant.) The metre was in fact defined as one ten-millionth of one-quarter of the earth's circumference at sea-level.' Joseph Needham, Science and Civilisation in China, Cambridge University Press, 1962 vol.4, pt.1, p.42.: \"Nous proposerons donc de mesurer immédiatement un arc du méridien, depuis Dunkerque jusqu'a Bracelone: ce qui comprend un peu plus de neuf degrés & demi.\" [We propose then to measure directly an arc of the meridian between Dunkirk and Barcelona: this spans a little more than nine-and-a-half degrees.\"] p. 8Paolo Agnoli and Giulio D’Agostini,'Why does the meter beat the second?,' December, 2004 pp.1–29. On 26 March 1791, the French National Constituant Assembly adopted the proposal."]}, {"page": "March 24", "response": ["*1995 – Joseph Needham, English historian and academic (b. 1900)"]}, {"page": "Mercator projection", "response": ["Joseph Needham, a historian of China, wrote that the Chinese developed the Mercator projection hundreds of years before Mercator did, using it in star charts during the Song Dynasty."]}, {"page": "Mohism", "response": ["One of the schools of Mohism that has received some attention is the Logicians school, which was interested in resolving logical puzzles. Not much survives from the writings of this school, since problems of logic were deemed trivial by most subsequent Chinese philosophers. Historians such as Joseph Needham have seen this group as developing a precursor philosophy of science that was never fully developed, but others believe that recognizing the Logicians as proto-scientists reveals too much of a modern bias."]}, {"page": "Science", "response": ["Science in a broad sense existed before the modern era and in many historical civilizations. Modern science is distinct in its approach and successful in its results, so it now defines what science is in the strictest sense of the term. Science in its original sense was a word for a type of knowledge, rather than a specialized word for the pursuit of such knowledge. In particular, it was the type of knowledge that people can communicate to each other and share. For example, knowledge about the working of natural things was gathered long before recorded history and led to the development of complex abstract thought. This is shown by the construction of complex calendars, techniques for making poisonous plants edible, public works at a national scale, such as those which harnessed the floodplain of the Yangtse with reservoirs,Sima Qian (司馬遷, d. 86 BCE) in his Records of the Grand Historian (太史公書) covering some 2500 years of Chinese history, records Sunshu Ao (孫叔敖, fl. c. 630–595 BCE – Zhou dynasty), the first known hydraulic engineer of China, cited in (Joseph Needham et al. (1971) Science and Civilisation in China 4.3 p. 271) as having built a reservoir which has lasted to this day. dams, and dikes, and buildings such as the Pyramids. However, no consistent conscious distinction was made between knowledge of such things, which are true in every community, and other types of communal knowledge, such as mythologies and legal systems. Metallurgy was known in prehistory, and the Vinča culture was the earliest known producer of bronze-like alloys. It is thought that early experimentation with heating and mixing of substances over time developed into alchemy."]}, {"page": "Zheng He", "response": ["In the 1950s, historians such as John Fairbank and Joseph Needham popularized the idea that after Zheng He's voyages China turned away from the seas due to the Haijin edict and was isolated from European technological advancements. Modern historians point out that Chinese maritime commerce did not totally stop after Zheng He, that Chinese ships continued to participate in Southeast Asian commerce until the 19th century, and that active Chinese trading with India and East Africa continued long after the time of Zheng. Moreover, revisionist historians such as Jack Goldstone argue that the Zheng He voyages ended for practical reasons that did not reflect the technological level of China. Although the Ming dynasty prohibited shipping with the Haijin edict, it was a policy of the Hongwu Emperor that long preceded Zheng He and the ban, so obviously disregarded by the Yongle Emperor, was eventually lifted entirely. However, the ban on maritime shipping forced countless numbers of people into smuggling and piracy. Neglect of the imperial navy and Nanjing dockyards after Zheng He's voyages left the coast highly vulnerable to Japanese wokou during the 16th century."]}, {"page": "Zeno's paradoxes", "response": ["Ancient Chinese philosophers from the Mohist School of Names during the Warring States period of China (479-221 BC) developed equivalents to some of Zeno's paradoxes. The scientist and historian Sir Joseph Needham, in his Science and Civilisation in China, describes an ancient Chinese paradox from the surviving Mohist School of Names book of logic which states, in the archaic ancient Chinese script, \"a one-foot stick, every day take away half of it, in a myriad ages it will not be exhausted.\" Several other paradoxes from this philosophical school (more precisely, movement) are known, but their modern interpretation is more speculative."]}, {"page": "Zhang Heng", "response": ["The outflow clepsydra was a timekeeping device used in China as long ago as the Shang Dynasty (c. 1600–c. 1050 BC), and certainly by the Zhou Dynasty (1122–256 BC).Needham (1986), Volume 4, Part 2, 479. The inflow clepsydra with an indicator rod on a float had been known in China since the beginning of the Han Dynasty in 202 BC and had replaced the outflow type. The Han Chinese noted the problem with the falling pressure head in the reservoir, which slowed the timekeeping of the device as the inflow vessel was filled. Zhang Heng was the first to address this problem, indicated in his writings from 117, by adding an extra compensating tank between the reservoir and the inflow vessel. Zhang also mounted two statuettes of a Chinese immortal and a heavenly guard on the top of the inflow clepsydra, the two of which would guide the indicator rod with their left hand and point out the graduations with their right.Needham (1986), Volume 4, Part 2, 164. Joseph Needham states that this was perhaps the ancestor of all clock jacks that would later sound the hours found in mechanical clocks by the 8th century, but he notes that these figures did not actually move like clock jack figurines or sound the hours. Many additional compensation tanks were added to later clepsydras in the tradition of Zhang Heng. In 610 the Sui Dynasty (581–618) engineers Geng Xun and Yuwen Kai crafted an unequal-armed steelyard balance able to make seasonal adjustments in the pressure head of the compensating tank, so that it could control the rate of water flow for different lengths of day and night during the year.Needham (1986), Volume 4, Part 2, 480. Zhang mentioned a \"jade dragon's neck\", which in later times meant a siphon.Needham (1986), Volume 3, 320. He wrote of the floats and indicator-rods of the inflow clepsydra as follows:", "Zhang Heng is the first person known to have applied hydraulic motive power (i.e. by employing a waterwheel and clepsydra) to rotate an armillary sphere, an astronomical instrument representing the celestial sphere.Needham (1986), Volume 4, Part 2, 30.Morton (2005), 70.Loewe (1968), 107. The Greek astronomer Eratosthenes (276–194 BC) invented the first armillary sphere in 255 BC. The Chinese armillary sphere was fully developed by 52 BC, with the astronomer Geng Shouchang's addition of a permanently fixed equatorial ring.Needham (1986), Volume 3, 343. In AD 84  the astronomers Fu An and Jia Kui added the ecliptic ring, and finally Zhang Heng added the horizon and meridian rings. This invention is described and attributed to Zhang in quotations by Hsu Chen and Li Shan, referencing his book Lou Shui Chuan Hun Thien I Chieh (Apparatus for Rotating an Armillary Sphere by Clepsydra Water). It was likely not an actual book by Zhang, but a chapter from his Hun I or Hun I Thu Chu, written in 117 AD.Needham (1965), Volume 4, Part 1, 486 His water-powered armillary influenced the design of later Chinese water clocks and led to the discovery of the escapement mechanism by the 8th century. The historian Joseph Needham (1900–1995) states:", "Zhang Heng's mechanical inventions influenced later Chinese inventors such as Yi Xing, Zhang Sixun, Su Song, and Guo Shoujing. Su Song directly named Zhang's water-powered armillary sphere as the inspiration for his 11th-century clock tower.Needham (1986), Volume 4, Part 2, 466. The cosmic model of nine points of Heaven corresponding with nine regions of earth conceived in the work of the scholar-official Chen Hongmou (1696–1771) followed in the tradition of Zhang's book Spiritual Constitution of the Universe.Rowe (2001), 88. The seismologist John Milne, who created the modern seismograph in 1876 alongside Thomas Gray and James A. Ewing at the Imperial College of Engineering in Tokyo, commented in 1886 on Zhang Heng's contributions to seismology.Needham (1986), Volume 3, 626.Yan (2007), 124. The historian Joseph Needham emphasized his contributions to pre-modern Chinese technology, stating that Zhang was noted even in his day for being able to \"make three wheels rotate as if they were one.\"Needham (1986), Volume 4, 85–86. More than one scholar has described Zhang as a polymath.Krebs (2003), 31.Dillon (1998), 378. However, some scholars also point out that Zhang's writing lacks concrete scientific theories.Jin, Fan, and Liu (1996), 170. Comparing Zhang with his contemporary, Ptolemy (83–161) of Roman Egypt, Jin Guantao, Fan Hongye, and Liu Qingfeng state:"]}, {"page": "1995", "response": ["* March 24 – Joseph Needham, British biochemist, historian, and sinologist (b. 1900)"]}, {"page": "Brave New World", "response": ["Upon publication, Rebecca West praised Brave New World as \"The most accomplished novel Huxley has yet written\",The Daily Telegraph, 5 February 1932. Reprinted in Donald Watt, \"Aldous Huxley: The Critical Heritage. London; Routledge, 2013  (pp. 197–201). Joseph Needham lauded it as \"Mr. Huxley's remarkable book\",Scrutiny, May 1932 . Reprinted in Watt, (pp. 202–205). and Bertrand Russell also praised it, stating, \"Mr. Aldous Huxley has shown his usual masterly skill in Brave New World.\"The New Leader, 11 March 1932. Reprinted in Watt, (pp. 210–13)."]}, {"page": "Cosmos", "response": ["The Chinese had multiple theories of the processes and components of the cosmos. The most popular of these beliefs was the Xuan Ye theory, the astronomical view of the cosmos as an infinite space with floating pieces of condensed vapor. The Chinese believed that the Earth consisted of condensed yin and the heavens of yang; and that these properties coexisted in constant relation to each other, with yin and yang being used together to explain processes on Earth as well of those relating the Earth in conjunction with the heavens. This idea was described by Joseph Needham as a cosmos that functioned similarly to a complex organism, with discernible patterns in an ever-changing structure. There was both a pattern and a randomness to the cosmos. Because of this, the Chinese believed that earthly phenomena could affect heavenly bodies. "]}, {"page": "Chinese food therapy", "response": ["A number of ancient Chinese cookbooks and treatises on food (now lost) display an early Chinese interest in food, but no known focus on its medical value. The literature on \"nourishing life\" () integrated advice on food within broader advice on how to attain immortality. Such books, however, are only precursors of \"dietary therapy\", because they did not systematically describe the effect of individual food items. In the volume on \"Fermentations and Food Science\" of Joseph Needham's Science and Civilization in China, H. T. Huang considers the Recipes for Fifty-Two Ailments (c. 200 BCE) and the Yellow Emperor's Inner Canon as precursors of the \"dietary therapy\" tradition, the former because it recommends food products as remedies for various illnesses, the latter because it discusses the impact of food on health. The materia medica literature, exemplified by the Shennong Bencao Jing (1st century CE), also discussed food products, but without specializing on them."]}, {"page": "Bessemer process", "response": ["A system akin to the Bessemer process has existed since the 11th century in East Asia. Economic historian Robert Hartwell writes that the Chinese of the Song Dynasty (960-1279 CE) innovated a \"partial decarbonization\" method of repeated forging of cast iron under a cold blast. Sinologist Joseph Needham and historian of metallurgy Theodore A. Wertime have described the method as a predecessor to the Bessemer process of making steel. This process was first described by the prolific scholar and polymath government official Shen Kuo (1031–1095) in 1075, when he visited Cizhou. Hartwell states that perhaps the earliest center where this was practiced was the great iron-production district along the Henan–Hebei border during the 11th century."]}]}}