{"wiki_id": "http://www.wikidata.org/entity/Q3182226", "itemLabel": "John Ostell", "itemDescription": "Anglo-Canadian architect, surveyor and manufacturer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Ostell", "wikipedia_page": {"main": "John Ostell (7 August 1813 – 6 April 1892) architect, surveyor and manufacturer, was born in London, England and emigrated to Canada in 1834, where he apprenticed himself to a Montreal surveyor André Trudeau to learn French methods of surveying. In 1837 he married Eleonore Gauvin, a member of a prominent French Catholic family in the city. His marriage ensured entry to French Canadian society, he was appointed diocesan architect for Montreal. In 1849 he formed a partnership with his nephew Henri-Maurice Perrault (1828–1903), this was the formation of one of the first architectural dynasties in Canada.\nHe mostly worked in the Greek Revival style of architecture. His first work in Montreal was the city's original Custom House, completed in 1836. This was followed by the McGill University Arts Building, 1839–1843, the oldest building on the McGill campus, extended 1860-1862 (formerly known as the McGill College Building, today renamed the McCall MacBain Arts Building); Asile des Soeurs de la Providence (aka Asile de la Providence), 1842 (demolished); High School of Montreal, 1845 (demolished); Protestant Orphan Asylum, 1848 (demolished); Palais episcopal (Episcopal Palace) 1849, burnt 1852; Eglise de Notre-Dame-de-Toutes-Graces, 1851; Church of St Anne, 1853 (demolished); Grand séminaire de Montréal, 1854; and the Old Montreal Court House, now known as the Édifice Lucien-Saulnier.1856-1859. Ostell submitted designs for the new St. James Cathedral in Toronto in 1849, placing second in the competition to Frederick William Cumberland. The only residential home left standing built by Ostell is the former home of Louis-Hippolyte LaFontaine in downtown Montreal at 1395 Overdale Ave. The house, which was abandoned for the past 30 years and falling apart, was restored recently (2019) to its original appearance by the real estate developer of the condominium complex now surrounding it.\n\n\t\t\n\t\t\nIn 1859 he largely abandoned architecture having established a successful lumber business in 1852. The factory made doors and windows for export to Upper Canada (Ontario), Australia, the USA and Britain. By 1856 the factory covered 5 acres (20,000 m2) and employed 75 workers and had a turn over of goods worth £18,750 per annum.\nThere are two adjacent streets in Montreal's Cote-des-Neiges burough named after him: Ostell Street and Ostell Crescent.", "link_mentions": {}}}