{"wiki_id": "http://www.wikidata.org/entity/Q3182692", "itemLabel": "John Warrack", "itemDescription": "English music critic", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Warrack", "wikipedia_page": {"main": "John Hamilton Warrack (born 1928, in London) is an English music critic, writer on music, and oboist.\nWarrack is the son of Scottish conductor and composer Guy Warrack. He was educated at Winchester College (1941-6) and then at the Royal College of Music (1949–52). In the early 1950s he was a freelance oboist, playing mostly with the Boyd Neel Orchestra and Sadler's Wells Orchestra. From 1954 until 1961 he was music critic for The Daily Telegraph, and from 1961 until 1972 he was music critic for The Sunday Telegraph. From 1978 until 1983 he served as the Artistic Director of the Leeds Festival. From 1984 until 1993 he taught on the music faculty at the University of Oxford. He is the author of Six Great Composers (1955); Carl Maria von Weber (Hamish Hamilton, 1968, 2nd ed. Cambridge UP, 1976), the standard study of Weber in English; German Opera: From the Beginnings to Wagner (2001) and the co-author of The Concise Oxford Dictionary of Opera (1964, with Harold Rosenthal) and The Oxford Dictionary of Opera (1992, with Ewan West). Warrack lives in York.", "link_mentions": [{"page": "Edward Elgar", "response": ["The two symphonies divide opinion even more sharply. Mason rates the Second poorly for its \"over-obvious rhythmic scheme\", but calls the First \"Elgar's masterpiece. ... It is hard to see how any candid student can deny the greatness of this symphony.\" However, in the 1957 centenary symposium, several leading admirers of Elgar express reservations about one or both symphonies. In the same year, Roger Fiske wrote in The Gramophone, \"For some reason few people seem to like the two Elgar symphonies equally; each has its champions and often they are more than a little bored by the rival work.\"Fiske, Roger, \"Elgar, Symphony No. 2 in E-flat major, Op. 63\", Gramophone, July 1957, p. 9 The critic John Warrack wrote, \"There are no sadder pages in symphonic literature than the close of the First Symphony's Adagio, as horn and trombones twice softly intone a phrase of utter grief\",Warrack, John, \"Three English Masters\", Gramophone, March 1984, p. 21 whereas to Michael Kennedy, the movement is notable for its lack of anguished yearning and angst and is marked instead by a \"benevolent tranquillity.\"Kennedy (1970), p. 56"]}, {"page": "Marietta Alboni", "response": ["Maria Anna Marzia (called Marietta) Alboni (6 March 1826Date stated by both Ciliberti and Pougin; the 1911 Encyclopædia Britannica gives the year as 1823. – 23 June 1894) was a renowned Italian contralto opera singer. She is considered \"one of the greatest contraltos in operatic history\".Entry in Harold Rosenthal & John Warrack (ed.), The Concise Oxford Dictionary of Opera, Oxford UK, Oxford University Press, 1986, p. 6, ."]}, {"page": "Opera", "response": ["* The Oxford Dictionary of Opera, by John Warrack and Ewan West (1992), 782 pages, "]}, {"page": "1988", "response": ["* February 13 – Léon Goossens, British oboist (b. 1897)John Warrack, ‘Goossens, Léon Jean (1897–1988)’, rev. Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, Jan 2008. http://www.oxforddnb.com/view/article/39907, accessed 30 January 2008."]}, {"page": "Gustav Holst", "response": ["The chamber opera Savitri (1908) is written for three solo voices, a small hidden female chorus, and an instrumental combination of two flutes, a cor anglais and a double string quartet.  The music critic John Warrack comments on the \"extraordinary expressive subtlety\" with which Holst deploys the sparse forces: \"... [T]he two unaccompanied vocal lines opening the work skilfully convey the relationship between Death, steadily advancing through the forest, and Savitri, her frightened answers fluttering round him, unable to escape his harmonic pull.\" Head describes the work as unique in its time for its compact intimacy, and considers it Holst's most successful attempt to end the domination of Wagnerian chromaticism in his music. Dickinson considers it a significant step, \"not towards opera, but towards an idiomatic pursuit of [Holst's] vision\".Dickinson (1995), p. 20 Of the Kālidāsa texts, Dickinson dismisses The Cloud Messenger (1910–12) as an \"accumulation of desultory incidents, opportunistic dramatic episodes and ecstatic outpourings\" which illustrate the composer's creative confusion during that period; the Two Eastern Pictures (1911), in Dickinson's view, provide \"a more memorable final impression of Kālidāsa\"."]}, {"page": "Hector Berlioz", "response": ["The songs remain on the whole among the least known of Berlioz's works, and John Warrack suggests that Schumann identified why this might be so: the shape of the melodies is, as usual with Berlioz, not straightforward, and to those used to the regular four-bar phrases of French (or German) song this is an obstacle to appreciation. Warrack also comments that the piano parts, though not lacking in harmonic interest, are discernibly written by a non-pianist. Despite that, Warrack considers up to a dozen songs from the 33 Mélodies well worth exploring – \"Among them are some masterpieces.\"Warrack, pp. 252 and 254"]}, {"page": "Baritone", "response": ["The baryton-Martin baritone (sometimes referred to as light baritone)Tom Huizenga, \"Talk Like An Opera Geek: Breaking Down Baritones\", NPR, 14 December 2011 lacks the lower G2–B2 range a heavier baritone is capable of, and has a lighter, almost tenor-like quality. Its common range is from C3 to the B above middle C (C3 to B4).John Warrack and Ewan West, The Oxford Dictionary of Opera, 2nd edition, 1992.  Generally seen only in French repertoire, this Fach was named after the French singer Jean-Blaise Martin. Associated with the rise of the baritone in the 19th century, Martin was well known for his fondness for falsetto singing, and the designation 'baryton Martin' has been used (Faure, 1886) to separate his voice from the 'Verdi Baritone', which carried the chest register further into the upper range. It is important to note that this voice type shares the primo passaggio and secondo passaggio with the Dramatic Tenor and Heldentenor (C4 and F4 respectively), and hence could be trained as a tenor."]}, {"page": "Marian Anderson", "response": ["*Rosenthal, Harold and John Warrack (1979, 2nd ed.). The Concise Oxford Dictionary of Opera. London, New York and Melbourne: Oxford University Press, p. 11. ."]}, {"page": "Michael Tippett", "response": ["After completing his Piano Sonata No. 3 (1973), \"a formidable piece of abstract composition\" according to Bowen, Tippett returned to the modern vernacular in his fourth opera The Ice Break (1976). Describing the music in an introduction to the published libretto, Tippett identifies \"two archetypal sounds: one relating to the frightening but exhilarating sound of the ice breaking on the great northern rivers in the spring; the other related to the exciting or terrifying sound of the slogan-shouting crowds, which can lift you on your shoulders in triumph, or stamp you to death\".   Although the work was generally regarded as a critical and public failure, aspects of its music have been recognised as among Tippett's best. The critic John Warrack writes that, after the violence of the opening acts, the third act's music has a lyrical warmth comparable to that of The Midsummer Marriage\".  William Mann in The Times was equally enthusiastic, finding the music compelling and worthy of many a rehearing.William Mann, The Times 8 July 1977, quoted in  "]}, {"page": "Master of the Queen's Music", "response": ["Parsons held the post of Master until 1817, when he was succeeded by William Shield, best known as a theatre composer: he composed or arranged music for at least thirty-six operas and seven pantomimes and ballets.Legge, R. H. \"Shield, William (bap. 1748/9, d. 1829)\", Oxford Dictionary of National Biography, Oxford University Press 2004, retrieved 27 May 2015  Shield's tenure is most notable for the abandonment of the traditional provision of court odes. By custom, the Poet Laureate of the day wrote the words for the odes, a task that the then holder, Robert Southey, found uncongenial. After the death of George III in 1820 the odes were discontinued. The post of Master of the King's Musick continued because George IV maintained the traditional small orchestra, which Shield's successor, Christian Kramer, directed. That remained the chief function of the Master through the tenures of Franz Cramer (Master 1834–48), George Frederick Anderson (Master 1848–70), and Sir William Cusins (Master 1870–93). The last of these produced a few works for royal occasions, including a jubilee cantata, \"Grant the Queen a Long Life\" (1887).Edwards, F. G, rev John Warrack. \"Cusins, Sir William George (1833–1893)\", Oxford Dictionary of National Biography, Oxford University Press 2004, retrieved 27 May 2015 "]}, {"page": "Symphony No. 7 (Beethoven)", "response": ["The oft-repeated claim that Carl Maria von Weber considered the chromatic bass line in the coda of the first movement evidence that Beethoven was \"ripe for the madhouse\" seems to have been the invention of Beethoven's first biographer, Anton Schindler. His possessive adulation of Beethoven is well-known, and he was criticised by his contemporaries for his obsessive attacks on Weber. According to John Warrack, Weber's biographer, Schindler was characteristically evasive when defending Beethoven, and there is \"no shred of concrete evidence\" that Weber ever made the remark."]}, {"page": "Angela Gheorghiu", "response": ["Angela Gheorghiu (; ; born 7 September 1965) is a Romanian soprano,John Warrack and Ewan West, 'Gheorghiu, Angela', The Concise Oxford Dictionary of Opera, Oxford University Press, 1996; Nicolas Slonimsky and Laura Diane Kuhn, Baker's Biographical Dictionary of Musicians, Gale Group, 2001, p. 1264; David M. Cummings, \"Gheorghiu, Angela\", International Who's Who in Classical Music, Routledge, 2003, p. 274 especially known for her performances in the operas of Puccini and Verdi, widely recognised by critics and opera lovers as one of the greatest sopranos of all time. "]}, {"page": "Mario Del Monaco", "response": ["* Harold Rosenthal and John Warrack, The Concise Oxford Dictionary of Opera (Second Edition), Oxford University Press, 1980, p. 126."]}, {"page": "Léon Goossens", "response": ["Goossens was born in Liverpool, Lancashire, and studied at Liverpool College of Music and the Royal College of Music. His father was violinist and conductor Eugène Goossens, his brother the conductor and composer Eugene Aynsley Goossens and his sisters the harpists Marie and Sidonie Goossens.John Warrack, \"Goossens, Léon Jean (1897–1988)\", in Oxford Dictionary of National Biography (Oxford University Press, 2004); online edition, accessed 30 January 2008."]}]}}