{"wiki_id": "http://www.wikidata.org/entity/Q3181027", "itemLabel": "John Beddington", "itemDescription": "British biologist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Beddington", "wikipedia_page": {"main": "Sir John Rex Beddington  HonFREng  (born 13 October 1945) is a British population biologist and Senior Adviser at the Oxford Martin School, and was previously Professor of Applied Population Biology at Imperial College London, and the UK Government Chief Scientific Adviser from 2008 until 2013.", "link_mentions": [{"page": "Homeopathy", "response": ["The lack of convincing scientific evidence supporting its efficacy and its use of preparations without active ingredients have led to characterizations of homeopathy as pseudoscience and quackery, or, in the words of a 1998 medical review, \"placebo therapy at best and quackery at worst\". The Russian Academy of Sciences considers homeopathy a \"dangerous 'pseudoscience' that does not work\", and \"urges people to treat homeopathy 'on a par with magic. The Chief Medical Officer for England, Dame Sally Davies, has stated that homeopathic preparations are \"rubbish\" and do not serve as anything more than placebos. In 2013, Mark Walport, the UK Government Chief Scientific Adviser and head of the Government Office for Science said \"homeopathy is nonsense, it is non-science.\" His predecessor, John Beddington, also said that homeopathy \"has no underpinning of scientific basis\" and is being \"fundamentally ignored\" by the Government."]}, {"page": "Zoological Society of London", "response": ["*2007 Professor John Beddington", "*Professor Sir John Beddington, CMG, FRS (2014–present)"]}, {"page": "David Tredinnick (politician)", "response": ["Tredinnick's views have attracted criticism. During the 2010 United Kingdom general election, he was opposed by New Scientist journalist Michael Brooks who objected to \"Tredinnick's outspoken promotion of alternative medicine.\" During a hustings debate called by Brooks to \"highlight the scientific literacy of the UK's elected representatives\", Brooks said that Tredinnick regarded homeopathy as a suitable treatment for malaria and HIV, which Tredinnick did not deny. In March 2013, Tredinnick's opinions were described as \"nonsensical\" by the government's outgoing chief scientist, Sir John Beddington, who said the MP had fallen for the \"Galileo fallacy\" (\"Galileo was laughed at but was right; therefore since I am laughed at I must be right\")."]}, {"page": "Cannabis classification in the United Kingdom", "response": ["Drug policy (including Cannabis classification) has been a contentious subject in UK politics. A number of senior Scientific advisors have objected the transfer back to class B, notably Professor David Nutt and John Beddington considered the move politically motivated rather than scientifically justified."]}, {"page": "Monmouth School for Boys", "response": ["* Sir John Beddington, CMG, (born 1945), scientist and UK Government Chief Scientific Adviser"]}, {"page": "Muir Russell", "response": ["In December 2009 he was appointed to head an independent investigation into allegations concerning the Climatic Research Unit email controversy. The inquiry reported on 7 July 2010, largely clearing the UEA of the allegations. The \"rigour and honesty\" of the scientists at the Climatic Research Unit were found not to be in doubt. However, the panel also concluded the scientists were insufficiently open about their work and unhelpful and defensive in response to freedom of information requests. Notable scholars and experts, including John Beddington and Myles Allen, welcomed the findings of the inquiry and stated that the climate scientists had been cleared of the allegations of misconduct, while Patrick Michaels disagreed."]}, {"page": "List of people associated with the London School of Economics", "response": ["* Sir John Beddington, UK Government Chief Scientific Adviser"]}, {"page": "List of people associated with the University of London", "response": ["* John Beddington (2015), UK Government Chief Scientific Adviser"]}, {"page": "Government Chief Scientific Adviser (United Kingdom)", "response": ["* Sir John Beddington, 2008–2013"]}, {"page": "Marine Biological Association of the United Kingdom", "response": ["* Sir John Beddington FRS (2014 to present)"]}, {"page": "Overshoot (population)", "response": ["David Pimentel, professor of ecology and agriculture at Cornell University, estimates that the sustainable agricultural carrying capacity for the United States is about 200 million people; its population as of 2015 is over 300 million. In 2009, the UK government's chief scientific advisor, Professor John Beddington, warned that growing populations, falling energy reserves and food shortages would create a \"perfect storm\" of shortages of food, water, and energy by 2030. According to a 2009 report by the United Nations Food and Agriculture Organization (FAO), the world will have to produce 70% more food by 2050 to feed a projected extra 2.3 billion people."]}, {"page": "David Nutt", "response": ["John Beddington, the Chief Scientific Adviser to the UK Government stated that he agreed with the views of Professor Nutt on cannabis. When asked if he agreed whether cannabis was less harmful than cigarettes and alcohol, he replied: \"I think the scientific evidence is absolutely clear cut. I would agree with it.\" A few days later, it was revealed that a leaked email from the government's Science Minister Lord Drayson was quoted as saying Mr Johnson's decision to dismiss Nutt without consulting him was a \"big mistake\" that left him \"pretty appalled\".", "A subsequent review of policy drafted by Lord Drayson essentially reaffirmed that the scientific advisers to the government can be dismissed under similar circumstances: \"Government and its scientific advisers should not act to undermine mutual trust.\" This clause was kept despite protest from Sense About Science, Campaign for Science and Engineering, and Liberal Democrat MP Evan Harris; according to Lord Drayson, the clause was requested by John Beddington, the Chief Scientific Adviser to the UK Government.Nick Dusic (24 March 2010) Principles of Scientific Advice, Campaign for Science and Engineering Les Iversen was announced as the successor of Nutt as the chair of the ACMD in January 2010."]}, {"page": "Climatic Research Unit email controversy", "response": ["* \"The disclosure of climate data from the Climatic Research Unit at the University of East Anglia\". Video of House of Commons Select Committee oral evidence session, held on Monday 1 March 2010 at 3 pm. Witnesses are: (1) Rt Hon Lord Lawson of Blaby, Chairman, and Dr Benny Peiser, Director, Global Warming Policy Foundation; (2) Richard Thomas CBE; (3) Professor Edward Acton, Vice-Chancellor, University of East Anglia, and Professor Phil Jones, Director of the Climatic Research Unit; (4) Sir Muir Russell KCB, Head of the Independent Climate Change emails Review; (5) Professor John Beddington, Government Chief Scientific Adviser, Professor Julia Slingo OBE, Chief Scientist, Met Office, and Professor Bob Watson, Chief Scientist, Department for Environment, Food and Rural Affairs."]}, {"page": "Educational neuroscience", "response": ["This suggestion that dyscalculia is caused by a deficits in a core deficit in number sense is analogous to the theory that dyslexia is due to a core deficit in phonological processing. Despite these similarities in terms of the scientific progress, public awareness of dyscalculia is much lower than it is for dyslexia. The UK's Chief Scientific Advisor, John Beddington, notes that, \"developmental dyscalculia is currently the poor relation of dyslexia, with a much lower public profile. But the consequences of dyscalculia are at least as severe as those for dyslexia.\""]}]}}