{"wiki_id": "http://www.wikidata.org/entity/Q3189114", "itemLabel": "Julian White", "itemDescription": "English rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Julian_White", "wikipedia_page": {"main": "Julian Martin White MBE (born 14 May 1973) is an English farmer, best known for his time playing professional rugby union as a prop for Leicester Tigers and England. White was regarded as an aggressive tighthead prop, one of the most powerful forwards in the game, and for his destructive scrummaging.", "link_mentions": [{"page": "Devon", "response": ["Swimmer Sharron Davies and diver Tom Daley were born in Plymouth. The Olympic runner Jo Pavey was born in Honiton.  Peter Cook the satirist, writer and comedian was born in Torquay, Devon. Leicester Tigers and British and Irish Lions Rugby player Julian White was born and raised in Devon and now farms a herd of pedigree South Devon beef cattle. The dog breeder John \"Jack\" Russell was also from Devon. Jane McGrath, who married Australian cricketer Glenn McGrath was born in Paignton, her long battle with and subsequent death from breast cancer inspired the formation of the McGrath Foundation, which is one of Australia's leading charities."]}, {"page": "May 14", "response": ["*  1973   – Julian White, English rugby player"]}, {"page": "Leicester Tigers", "response": ["2005: Julian White, Ben Kay, Lewis Moody, Geordan Murphy, Ollie Smith", "| Neil Back, Martin Corry, Martin Johnson, Ben Kay, Lewis Moody, Julian White, Dorian West, "]}, {"page": "Salcombe", "response": ["* England Rugby prop Julian White who played mini-rugby and Under 16s for Salcombe was born in this area. "]}, {"page": "Saracens F.C.", "response": ["The 1999–2000 season saw more big name players move to Vicarage Road with Mark Mapletoft, Thierry Lacroix, Scott Murray and Dan Luger joining the club along with Darragh O'Mahony and the up-and-coming Julian White. With the squad ravaged by World Cup duty and then injury the club's first attempt at the Heineken Cup was not a happy one. They lost three games by a couple of points in the last seconds of the game and didn't make the quarter finals."]}, {"page": "2005 British & Irish Lions tour to New Zealand", "response": ["|Julian White"]}, {"page": "Darren Morris", "response": ["Morris was born in Aberdare, and educated at Aberdare Boys School, Neath College and the University of Glamorgan (now the University of South Wales). Played for Neath RFC from 1992 to 1998, and during this period also played in Brisbane for Eastern Suburbs Tigers, where they made it to the Grand Final in 1995. During this time he was also involved with the Queensland Reds. He then moved to Swansea RFC in 1998 where the club won numerous leagues and cups. He captained Swansea RFC their 2002/2003 season. Morris then joined Leicester Tigers with England props Graham Rowntree and Julian White. Morris signed for Worcester Warriors and made 64 appearances for the club. "]}, {"page": "Darren Garforth", "response": ["After leaving Leicester in 2003, he moved to second division Nuneaton as player-coach.  Tigers signed England prop Julian White as a replacement."]}, {"page": "White (surname)", "response": ["*Julian White (born 1973), English rugby union footballer"]}]}}