{"wiki_id": "http://www.wikidata.org/entity/Q3181320", "itemLabel": "John Dalton", "itemDescription": "British bass guitar player", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Dalton_(musician)", "wikipedia_page": {"main": "John Dalton (born 21 May 1943, Enfield, Middlesex) is a British bass guitar player, best known as a member of The Kinks in 1966 and between 1969 and 1976, replacing original member Pete Quaife.", "link_mentions": [{"page": "May 21", "response": ["*  1943   – John Dalton, English bass player"]}, {"page": "Face to Face (The Kinks album)", "response": ["\"I'll Remember\" was the earliest track on the album, having been recorded in October 1965 during sessions for The Kink Kontroversy. Two other songs recorded during the Face to Face sessions – \"This Is Where I Belong\" and \"She's Got Everything\" – were eventually released as B-sides to singles released in 1967 and 1968, respectively. Both songs eventually appeared on the 1972 US compilation album The Kink Kronikles. Pete Quaife temporarily quit the band before the June–July 1966 recording sessions; his replacement John Dalton can only be confirmed as playing on the track \"Little Miss Queen of Darkness\". Contractual issues held up the release of the album for several months after recording was completed; Ray Davies was also in conflict with Pye over the final album cover art, whose psychedelic theme he later felt was inappropriate.", "*John Dalton – bass guitar on \"Little Miss Queen of Darkness\", \"Dead End Street\" and \"Big Black Smoke\""]}, {"page": "Muswell Hillbillies", "response": ["* John Dalton – bass guitar, backing vocals"]}, {"page": "Arthur (Or the Decline and Fall of the British Empire)", "response": ["thumb|right|alt=Four men sitting or standing next to each other. The man furthest left gazes upwards; he wears a black leather suit. The man to the right is seated, wears black, and stares towards the left. Behind and to the right of him stands another man, barely visible and staring straight ahead; he wears white. Next to him, and furthest right, stands a man dressed in white; his gaze is turned towards the left of the image, and his face is viewed in profile. All men stand in front of a black background.|The Kinks with a newly hired Dalton in 1969. From left: Dave Davies, Ray Davies, John Dalton, Mick Avory.", "Development of Arthur occurred during a rough period for the band, due to the commercial failure of their previous album The Kinks Are the Village Green Preservation Society and the subsequent single, \"Plastic Man\", as well as the departure of founding member and bassist Pete Quaife. In early 1969, Quaife had told the band he was leaving, though the other members did not take the remark seriously because Quaife had previously left the band in 1966, only to have a change of heart and rejoin shortly afterwards.Doug Hinman (2004). The Kinks: All Day and All of the Night. Hal Leonard Corporation. p. 89. . When an article in the New Musical Express mentioned Maple Oak, the band he had formed without the rest of the Kinks' knowledge, Davies unsuccessfully asked Quaife to return for the upcoming sessions of Arthur. Bassist John Dalton, who had briefly replaced Quaife when the latter had quit three years prior, was asked by drummer Mick Avory to rejoin the band.\"John Dalton: bass player in the Kinks - twice.\" http://www.craigmorrison.com/spip.php?article114 (2015)", "* John Dalton – bass guitar, background vocals"]}, {"page": "Lola Versus Powerman and the Moneygoround, Part One", "response": ["*John Dalton – bass guitar, backing vocals"]}, {"page": "Pete Quaife", "response": ["The Kinks became a top chart act throughout the world beginning with their third single, 1964's \"You Really Got Me\". Quaife was commonly the voice of the band in early press interviews. In June 1966, he was seriously injured in a car crash, which left him unable to perform. He later said that he had enjoyed the time off from the band, as he was sick of the conflict which was constant. John Dalton replaced him, as Quaife resigned from the band as a result of his hospitalisation, but Quaife reconsidered and returned in November 1966."]}, {"page": "Mick Avory", "response": ["In 1996, he started playing with The Kast Off Kinks, along with John Dalton, Dave Clarke (no relation to the Dave Clark of \"The Dave Clark Five\"), John Gosling and Jim Rodford. He has performed with them ever since."]}, {"page": "List of bass guitarists", "response": ["* John Dalton (The Kinks)"]}, {"page": "The Kast Off Kinks", "response": ["*John Dalton – bass, backing vocals, lead vocalist on \"Willesden Green\" (Percy, 1971, the only Kinks song never sung by one of the Davies brothers)  (member of The Kinks 1966, 1969–1976)", "|John Dalton"]}, {"page": "John Dalton (disambiguation)", "response": ["John Dalton (1766–1844) was a scientist who pioneered modern atomic theory.", "John Dalton  may also refer to:", "*John Dalton (American football) (1889–1919), American football player for Navy", "*John Dalton (architect) (1927-2007), Australian architect", "*John Dalton (author), American author", "*John Dalton (bishop) (c. 1821–1869), Roman Catholic bishop", "*John Dalton (divine) (1814–1874), Catholic divine and translator from Latin, Spanish, and German", "*John Dalton (musician) (born 1943), former member of The Kinks", "*John Dalton (soldier) (died 1981), British Army Major-General and father of Richard Dalton", "*John Dalton (MP) (1610–1679), English politician who sat in the House of Commons between 1659 and 1679", "*John Dalton (hurler) (born 1985), Irish hurler", "*John Dalton (poet) (1709–1763), English cleric and poet"]}, {"page": "Lola (song)", "response": ["Initial recordings of the song began in April 1970, but, as the band's bassist John Dalton remembered, recording for \"Lola\" took particularly long, stretching into the next month. During April, four to five versions were attempted, utilizing different keys as well as varying beginnings and styles. In May, new piano parts were added to the backing track by John Gosling, the band's new piano player who had just been auditioned. Vocals were also added at this time. The song was then mixed during that month. Mick Avory remembered the recording sessions for the song positively, saying that it \"was fun, as it was the Baptist's [John Gosling's] first recording with us\".", "* John Dalton – bass"]}, {"page": "Jim Rodford", "response": ["In 2008, Rodford joined the Kast Off Kinks, on the retirement of John Dalton, whom he had followed into the Kinks after Andy Pyle. In 2009, Jim Rodford regularly played in \"The Rodford Files\" along with his sons Steve Rodford (Blunstone/Argent band) on drums and Russ Rodford on guitar, plus Derik Timms (mOOn Dogs) on guitar, lap steel, slide and vocals."]}, {"page": "Soap Opera (album)", "response": ["*John Dalton – bass"]}, {"page": "Ian Gibbons (musician)", "response": ["Gibbons worked with Roger Chapman, Sweet, Suzi Quatro and Ian Hunter (from 1989 onwards), before returning to The Kinks in 1993. He continued to record and perform with Chapman and Hunter, along with Chris Farlowe, Maggie Bell, Andy Scott, The Chicago Blues Brothers and, more recently, on Ray Davies choir and other projects. In 2008, he joined The Kast Off Kinks, a line-up which includes or has included former Kinks members Mick Avory, Jim Rodford, John Dalton and John Gosling, and former Tim Rose sideman, Dave Clarke."]}, {"page": "The Creation (band)", "response": ["Most of the members of what would eventually become Creation were initially members of The Mark Four, a British beat group based in Cheshunt, Hertfordshire.Larkin C 'Virgin Encyclopedia of Sixties Music' (Muze UK Ltd, 1997)  p132 By late 1963 The Mark Four was a quintet consisting of Kenny Pickett (vocals), Eddie Phillips (guitars), Mick \"Spud\" Thompson (rhythm guitars), John Dalton (bass), and Jack Jones (drums). This line-up played regularly in the UK and in Germany before issuing two non-charting singles for Philips’ Mercury Records, \"Rock Around The Clock\" and \"Try It Baby\" in 1964.", "*John Dalton – bass guitar (mid-1980s–1993)"]}, {"page": "The Kinks", "response": ["Ray Davies (rhythm guitar, lead vocals, keyboards) and Dave Davies (lead guitar, vocals) remained members throughout the band's 33-year run. Longest-serving member Mick Avory (drums and percussion) was replaced by Bob Henrit, formerly of Argent, in 1984. Original bass guitarist Pete Quaife was replaced by John Dalton in 1969. After Dalton's 1976 departure, Andy Pyle briefly served as the band's bassist before being replaced by Argent bassist Jim Rodford in 1978. Session keyboardist Nicky Hopkins accompanied the band in the studio for many of their recordings in the mid-to-late 1960s. The band became an official five-piece in 1970, when keyboardist John Gosling joined them. Gosling quit in 1978; he was first replaced by ex-Pretty Things member Gordon Edwards, then more permanently by Ian Gibbons in 1979. The band gave its last public performance in 1996 and broke up in 1997 as a result of creative tension between the Davies brothers.", "The satirical single \"Sunny Afternoon\" was the biggest UK hit of summer 1966, topping the charts and displacing the Beatles' \"Paperback Writer\".Rogan, Johnny (1998). p. 16 Before the release of The Kink Kontroversy, Ray Davies suffered a nervous and physical breakdown, caused by the pressures of touring, writing and ongoing legal squabbles. During his months of recuperation, he wrote several new songs and pondered the band's direction. Quaife was involved in an automobile accident, and after his recovery decided to leave the band. Bassist John Dalton, who was initially hired to fill in for the injured Quaife, subsequently became his official replacement. However, Quaife soon had a change of heart and rejoined the band, and Dalton went back to his previous job as a coalman.", "In early 1969, Quaife again told the band he was leaving. The other members did not take his statement seriously until an article appeared in New Musical Express on 4 April featuring Quaife's new band, Maple Oak, which he had formed without telling the rest of the Kinks. Ray Davies pleaded with him to return for the sessions for their upcoming album, but Quaife refused. Davies immediately called up John Dalton, who had replaced Quaife three years prior, and asked him to rejoin. Dalton remained with the group until the recording of the album Sleepwalker in 1976.", "thumb|left|alt=Five smiling men in a row, diagonal to camera angle. The man on the left (farthest to the back) has very long hair and a full beard; he wears a white T-shirt and tie-dyed pants. Next to him, Dave Davies, also with very long hair, wears reflective sunglasses, a black short-sleeved shirt and jeans. In the middle, Mick Avory wears an unbuttoned leather vest and white pants. The man to his right wears a heavy, probably brown leather jacket with a design that is possibly Native American. On the far right, in front, Ray Davies wears a giant paisley kerchief knotted like a tie, over a white jacket.|The Kinks, c. 1971. From left: John Gosling, Dave Davies, Mick Avory, John Dalton, Ray Davies (the band's line-up 1970–1976, 1977–1978)", "Ray Davies' marital problems during this period began to affect the band adversely, particularly after his wife, Rasa, took their children and left him in June 1973. Davies became depressed; during a July gig at White City Stadium he told the audience he was \"fucking sick of the whole thing\", and was retiring.Hollingsworth, Roy (21 July 1973). \"Thank you for the days, Ray\". Melody Maker.Gilbert, Jerry (21 July 1973). \"Ray Quits Kinks\". Sounds. He subsequently collapsed after a drug overdose and was taken to hospital. With Ray Davies in a seemingly critical condition, plans were discussed for Dave to continue as frontman in a worst-case scenario. Ray recovered from his illness as well as his depression, but throughout the remainder of the Kinks' theatrical incarnation the band's output remained uneven, and their already fading popularity declined even more. John Dalton later commented that when Davies \"decided to work again... I don't think he was totally better, and he's been a different person ever since.\"Marten, Neville; Hudson, Jeff (2001). pp. 128–129", "Following the termination of their contract with RCA, the Kinks signed with Arista Records in 1976. With the encouragement of Arista's management they stripped back down to a five-man core group and were reborn as an arena rock band. John Dalton left the band before finishing the sessions for the debut Arista album. Andy Pyle was brought in to complete the sessions and to play on the subsequent tour. Sleepwalker, released in 1977, marked a return to success for the group as it peaked at number 21 on the Billboard chart. After its release and the recording of the follow-up, Misfits, Andy Pyle and keyboardist John Gosling left the group to work together on a separate project. In May 1978, Misfits, the Kinks' second Arista album, was released. It included the US Top 40 hit \"A Rock 'n' Roll Fantasy\", which helped make the record another success for the band. The non-album single \"Father Christmas\" has remained a popular track. Driven by session drummer Henry Spinetti's drumming and Dave Davies' heavy guitar the song \"Father Christmas\" has become a classic seasonal favorite on mainstream radio. For the following tour, the band recruited ex-Argent bassist Jim Rodford and ex–Pretty Things keyboardist Gordon Edwards. Edwards was soon fired from The Kinks for failing to show up to recordings sessions, and the band recorded 1979's Low Budget as a quartet, with Ray Davies handling keyboard duties. Keyboardist Ian Gibbons was recruited for the subsequent tour, and became a permanent member of the group. Despite the personnel changes, the popularity of the band's records and live shows continued to grow.", "The band members subsequently focused on solo projects, and both Davies brothers released their own studio albums. Talk of a Kinks reunion circulated (including an aborted studio reunion of the original band members in 1999), but neither Ray nor Dave Davies showed much interest in playing together again. Meanwhile, former members John Gosling, John Dalton and Mick Avory had regrouped in 1994 and started performing on the oldies circuit along with guitar-player/singer Dave Clarke as the Kast Off Kinks.", "* John Dalton – bass, backing vocals Doug Hinman (2004). The Kinks: All Day and All of the Night. Hal Leonard Corporation. pp. 217–219. ."]}, {"page": "Gibson EB-3", "response": ["* Pete Quaife of The Kinks sometimes used an EB-3 from May 1966 until his departure from the group in April 1969 along with a Rickenbacker 4001. His replacement, John Dalton also played the EB-3."]}, {"page": "Template talk:The Beach Boys", "response": [":::Your claim that Johnston didn’t become an official member in 1965 is not one that is supported by virtually any source or consensus among the band and fans, and in any case disregards the mere fact that he has been an official, active member longer than anybody else except Love. Johnston didn’t *just* contribute vocals on the band’s most acclaimed albums, but he also provided instrumental work and as early as Wild Honey appeared on the band’s album covers (which he was previously unable to due to contractual reasons. Johnston appeared on the back cover of Wild Honey before making his front cover debut on Friends). He was contributing compositions from ‘’20/20’’ onwards. Of the run of critically acclaimed Beach Boys albums where the band’s artistic legacy today rests on - from Today! to Holland (not counting critically derided outliers such as Party!), Johnston contributed as an official member on every album except Today!, most of Carl And The Passions (he contributed to “Marcella” before leaving the band), and Holland. In what universe does this make Johnston unworthy of top line status? Furthermore, since when has the Rock and Roll Hall of Fame had any credibility when it comes to their choices in which band members are inducted? They failed to induct Bob Welch with Fleetwood Mac; they failed to induct Eric Carr with Kiss; they failed to induct Mark Evans with AC/DC; they failed to induct John Dalton with The Kinks; they failed to induct literally any of the important post-1967 members of The Byrds such as Gram Parsons and Clarence White; they failed to induct Dave Rowberry with The Animals; they failed to induct Doug Yule with The Velvet Underground; among many other examples. Using the RRHOF as a talking point because they failed to induct Johnston (and David Marks) is not one that has any basis in credibility. I’d also like to hear what other users have to say on this topic. Thescrubbythug (talk) 02:53, 8 September 2020 (UTC)"]}, {"page": "Shangri-La (The Kinks song)", "response": ["\"Shangri-La\" was released as the second single from Arthur in the United Kingdom, backed with \"This Man He Weeps Tonight.\" The single was a commercial failure, not reaching the charts in any countries besides the Netherlands. The members of the band, however, thought highly of the song, with both Dave Davies and John Dalton singling it out for praise.", "Bassist John Dalton named the track his favorite Kinks song."]}, {"page": "The Mark Four", "response": ["The Mark Four was an English rock band from Hertfordshire, England that was formed in 1961.  Members included Kenny Pickett (vocals), Eddie Phillips (guitar), John Dalton (bass), Mick Thompson (guitar) and Jack Jones (drums)."]}, {"page": "Everybody's in Show-Biz", "response": ["*John Dalton – bass guitar, backing vocals"]}, {"page": "Preservation Act 1", "response": ["*John Dalton – bass"]}, {"page": "Low Budget (album)", "response": ["However, throughout this period, the band's lineup began to fluctuate, not only with both bassist John Dalton (and his short-term replacement Andy Pyle) and keyboardist John Gosling departing from the band, but founding drummer Mick Avory also considered leaving. Avory eventually agreed to stay, while ex-Argent bass player Jim Rodford, and keyboardist Gordon John Edwards were recruited, the latter having played with the Pretty Things on their album Silk Torpedo. Edwards was shortly afterwards fired from the group for failing to show up to sessions for Low Budget (although he recorded piano on at least one of the album's tracks),Doug Hinman (2004). The Kinks: All Day and All of the Night. Hal Leonard Corporation. pp. 226. . being replaced with Ian Gibbons following the album's release."]}, {"page": "Misfits (The Kinks album)", "response": ["Misfits was the second album the band recorded for Arista Records, the record company the band switched to from RCA Records in 1976. Although the band had spent a good portion of the 1970s releasing concept albums, their previous album, Sleepwalker, signaled a shift toward more rock based material. In addition, the album began the band's commercial comeback in the US, the album reaching #21 and its title track peaking at #48. However, during the recording of Sleepwalker, longtime bassist John Dalton quit the band, being replaced by Andy Pyle.", "*John Dalton - bass guitar on “In A Foreign Land”"]}, {"page": "Percy (soundtrack album)", "response": ["\"Willesden Green\" is the only song released by the Kinks to feature lead vocals by a band member other than a Davies brother. Bassist John Dalton sings lead vocals on the track, doing an impression of Elvis Presley.", "*John Dalton – bass, backing vocals, lead vocals on \"Willesden Green\""]}]}}