{"wiki_id": "http://www.wikidata.org/entity/Q3185914", "itemLabel": "Josephine Veasey", "itemDescription": "singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Josephine_Veasey", "wikipedia_page": {"main": "Josephine Veasey (born 10 July 1930) is a British mezzo-soprano, particularly associated with Wagner and Berlioz\nroles.", "link_mentions": [{"page": "July 10", "response": ["*  1930   – Josephine Veasey, English soprano and actress"]}, {"page": "Luchino Visconti", "response": ["|Sena Jurinac, Josephine Veasey, Michael Langdon.Conductor: Georg SoltiRoyal Opera House performance archive for 21 April 1966 on rohcollections.org.uk "]}, {"page": "1930 in music", "response": ["*July 10 – Josephine Veasey, operatic mezzo-soprano"]}, {"page": "La damnation de Faust", "response": ["Nicolai Gedda, Josephine Veasey, Jules Bastin, Richard Van Allan, Gillian Knight"]}, {"page": "Benvenuto Cellini (opera)", "response": ["* Music & Arts CD-618: Richard Lewis, (Cellini), Joan Carlyle (Teresa), Josephine Veasey, Ascanio, Don Garrard (Balducci), John Cameron (Fieramosca), David Ward (Cardinal Salviati), Richard Lewis, Ranken Bushby (Pompeo), John Kentish, innkeeper; BBC Symphony Orchestra and Chorus, Antal Doráti, live concert performance, Royal Festival Hall, London, 23.1.1963; reviews on 24.1.1963 by The Times, Evening Standard, Daily Express, Daily Telegraph"]}, {"page": "Béatrice et Bénédict", "response": ["* Josephine Veasey (Béatrice), John Mitchinson (Bénédict), April Cantelo (Héro), Helen Watts (Ursule), John Cameron (Claudio), John Shirley-Quirk (Don Pedro), Eric Shilling (Somarone), London Symphony Orchestra conducted by Colin Davis. L'Oiseau-lyre SOL 256-7 (1962)."]}, {"page": "Joan Sutherland", "response": ["* Beatrice di Tenda—Joan Sutherland (Beatrice), Luciano Pavarotti (Orombello), Cornelius Opthof (Filippo), Josephine Veasey (Agnese), Joseph Ward (Anichino/Rizzardo), Ambrosian Opera Chorus, London Symphony Orchestra, Richard Bonynge, recorded 1966 Decca"]}, {"page": "Grace Bumbry", "response": ["In the 1970s, Bumbry, having recorded many soprano arias, began taking on more soprano roles.  Her first official soprano role was Salome in 1970 at Covent Garden. In 1971, she debuted as Tosca at the Metropolitan Opera. She also took on more unusual roles, such as Janáček's Jenůfa (in Italian) at La Scala in 1974 (with Magda Olivero as the Kostelnička), Dukas's Ariane et Barbe-bleue in Paris in 1975, and Sélika in Meyerbeer's L'Africaine at Covent Garden in 1978 (opposite Plácido Domingo as Vasco da Gama). She also began assuming such roles as Norma, Medea, Abigaille and Gioconda.  She first sang Norma in 1977 in Martina Franca, Italy; the following year, she sang both Norma and Adalgisa in the same production at Covent Garden, first as the younger priestess opposite Montserrat Caballé as Norma; later, as Norma, with Josephine Veasey as Adalgisa."]}, {"page": "The Royal Opera", "response": ["Despite Beecham's views, by the mid-1950s the Covent Garden company included many British and Commonwealth singers who were already or were soon to be much sought after by overseas opera houses.Temperley. Nicholas, et al. \"London (i)\", Grove Music Online, Oxford Music Online. Retrieved 28 August 2011  (Evans), and Haltrecht, pp. 131–132 (Sutherland), 229 (Carlyle, Shuard and Vickers), 287 (Langdon), 215 (Morison), 287 (Veasey) and 288 (Collier) Among them were Joan Carlyle, Marie Collier, Geraint Evans, Michael Langdon, Elsie Morison, Amy Shuard, Joan Sutherland, Josephine Veasey and Jon Vickers. Nevertheless, as Lords Goodman and Harewood put it in a 1969 report for the Arts Council, \"[A]s time went on the operatic centre of British life began to take on an international character. This meant that, while continuing to develop the British artists, it was felt impossible to reach the highest international level by using only British artists or singing only in English\".Goodman and Harewood, p. 10 Guest singers from mainland Europe in the 1950s included Maria Callas, Boris Christoff, Victoria de los Ángeles, Tito Gobbi and Birgit Nilsson.Drogheda et al, p. 143 (Callas), Haltrecht, pp. 134–135 (Christoff), \"The Royal Opera – 'Manon'\", The Times, 6 December 1950, p. 8 (de los Ángeles), Haltrecht, pp. 281–282 (Gobbi) and p. 227 (Nilsson) Kubelík introduced Janáček's Jenůfa to British audiences, sung in English by a mostly British cast.Haltrecht, p. 219; and \"Jenůfa – 10 December 1956 Evening\", Royal Opera House Archive, Performance Database. Retrieved 8 February 2011"]}, {"page": "Joan Carlyle", "response": ["Carlyle emerged in the 1950s along with other singers who also became established members of the Covent Garden company such as sopranos Amy Shuard, Joan Sutherland, Elsie Morison, Marie Collier, and Josephine Veasey; tenors Jon Vickers and Peter Pears; and basses Michael Langdon and Geraint Evans, but it was with Jon Vickers that she was often paired."]}, {"page": "King Priam", "response": ["|Josephine Veasey"]}, {"page": "We Come to the River", "response": ["|Josephine Veasey"]}, {"page": "Kerstin Meyer", "response": ["In 1960, Meyer made her debut at the Royal Opera House in London as Didon in Les Troyens, alongside Jon Vickers and Josephine Veasey, and the same year as Ulrica and Bradamante in Alcina during a short residency by the Stockholm company. There she performed the title role of Der Rosenkavalier by Richard Strauss and Klytemnestra in Elektra in 1975 and 1976. In György Ligeti's Le Grand Macabre, she created the roles of Amando and Spermando in 1978."]}, {"page": "Beatrice di Tenda", "response": ["|1966|| Joan Sutherland,Luciano Pavarotti,Josephine Veasey,Cornelius Opthof"]}, {"page": "Pelléas et Mélisande discography", "response": ["| Camille Maurane,Erna Spoorenberg,George London,Guus Hoekman,Rosine Brédy,Josephine Veasey"]}, {"page": "David Webster (opera manager)", "response": ["It was he who gave Sutherland her first big break (in Lucia). It was he who changed Jon Vickers almost overnight from an occasional concert singer into one of the best of present-day dramatic tenors. It was he who carefully nurtured the talents of Sir Geraint Evans, Josephine Veasey, Gwyneth Jones, Peter Glossop and many others. ... He was also proud that productions such as The Trojans, Pelléas et Mélisande and The Midsummer Marriage could be taken straight off his stage and recorded.Blyth, Alan, Obituary notice in The Gramophone, July 1971, p. 171."]}, {"page": "Plácido Domingo discography", "response": ["|Plácido DomingoSherrill MilnesJosephine Veasey et al.", "|Plácido DomingoSherrill MilnesJosephine Veasey et al.", "|Plácido DomingoSherrill MilnesJosephine VeaseyJane Marsh", "|Plácido Domingo Ruggero RaimondiMartina ArroyoJosephine Veasey"]}, {"page": "Roger Soyer", "response": ["Soyer has a beautiful and smoothly produced voice. His numerous recordings (operatic and otherwise) include performances of the following four French operas: Lakmé, opposite Mady Mesplé and Charles Burles, under Alain Lombard; Werther, opposite Victoria de los Angeles and Nicolai Gedda, under Georges Prêtre; Benvenuto Cellini, opposite Gedda and Robert Massard, under Sir Colin Davis; and Les Troyens, opposite Jon Vickers and Josephine Veasey, also under Sir Colin Davis."]}, {"page": "List of people associated with the Royal Academy of Music", "response": ["* Josephine Veasey (1972)"]}, {"page": "Die Walküre discography", "response": ["|Jon Vickers, Gundula Janowitz,Thomas Stewart, Régine Crespin,Martti Talvela, Josephine Veasey"]}, {"page": "Das Rheingold discography", "response": ["|Zoltán Kelemen, Dietrich Fischer-Dieskau, Josephine Veasey, Gerhard Stolze, Simone Mangelsdorff, Martti Talvela, Karl Ridderbusch, Robert Kerns, Donald Grobe, Oralia Domínguez, Erwin Wohlfahrt"]}, {"page": "Dido and Aeneas discography", "response": ["|Josephine VeaseyHelen DonathJohn Shirley-QuirkElizabeth Bainbridge"]}, {"page": "Norma discography", "response": ["| 1974 || Montserrat Caballé,Jon Vickers,Josephine VeaseyAgostino Ferrin || Giuseppe Patanè,Orchestra and Chorus of the Teatro Regio di Torino,(Audio and video recordings of a performance at the Théâtre antique d'Orange for the Orange Festival, 27 July)"]}, {"page": "Opera North: history and repertoire, seasons 1978–79 to 1980–81", "response": ["Most productions during this period were conducted by Lloyd-Jones.  Clive Timms, Opera North's Head of Music, and John Pryce-Jones, Chorus Master, also conducted, with Elgar Howarth, Gabriele Bellini and David Parry as guest conductors.  A stalwart of ENO, Robert Ferguson, sang many of the leading tenor roles, frequently with John Rawnsley and/or Stuart Harling (baritones) and John Tranter (bass).  Guest singers included Josephine Veasey, Ann Murray, Elizabeth Harwood, Della Jones, Elizabeth Vaughan, Joan Carden, Felicity Palmer, Graham Clark, David Hillman, Peter Glossop, Forbes Robinson, Derek Hammond-Stroud and Norman Bailey.  Another special guest, in the non-singing role of Frosch in Die Fledermaus, was Clive Dunn of Dad's Army fame.", "|1980–81 || Oedipus rexPerformed as a double-bill with Les mamelles de Tirésias ||  Stravinsky ||  Robert Ferguson (Oedipus), Josephine Veasey (Jocasta), Hugh-Nigel Sheehan (Creon), John Tranter (Tiresias) ||  David Lloyd-Jones ||  Patrick Libby ||  Stefanos Lazaridis"]}, {"page": "Verdi Requiem discography", "response": ["|1970 || London Symphony Orchestra,London Symphony Chorus,Leonard Bernstein || Martina Arroyo,Josephine Veasey,Plácido Domingo,Ruggero Raimondi || CBS, CD: 77231 || Studio recording made 23, 24, 26 February at the Royal Albert HallMessa da Requiem 23, 24, 26 February 1970 at verdisdisco.de Gramophone (September 1989)", "|1975 || Royal Philharmonic Orchestra,London Philharmonic Choir,Carlos Païta || Heather Harper,Josephine Veasey,Carlo Bini,Hans Sotin || Lodia, CD: LO-CD 772/3 || Studio recording made at the Kingsway Hall, London"]}, {"page": "Veasey", "response": ["*Josephine Veasey (born 1930), British mezzo-soprano, associated with Wagner and Berlioz roles"]}, {"page": "1965 in British music", "response": ["* 11 September – The Last Night of The Proms is conducted by Sir Malcolm Sargent, with Josephine Veasey as soloist for the traditional rendition of \"Rule, Britannia.BBC – Proms – Archive. Accessed 17 April 2013"]}, {"page": "Glyndebourne Festival Opera: history and repertoire, 1952–63", "response": ["|1959 || The Marriage of Figaro ||  Mozart  ||  Carlos Feller/Geraint Evans (Figaro), Elisabeth Söderström (Susanna), Michel Roux (Count), Pilar Lorengar (Countess), Josephine Veasey (Cherubino) ||  Peter Maag || colspan=\"2\"|  Revival of 1955 production"]}, {"page": "1970 New Year Honours", "response": ["* Josephine Veasey, Singer."]}, {"page": "Richard Angas", "response": ["The Angas family were keen amateur musicians, and Richard, who was born in Esher in Greater London, became a chorister at the Royal School of Church Music as well as joining a local choral group.Richard Angas obituary by George Hall; The Guardian, 25 August 2013, accessed 16 February 2014 From 1960 until 1964 he studied at the Royal Academy of Music in London, and in 1965 won both the Kathleen Ferrier Memorial Scholarship and the Richard Tauber Memorial Prize, before continuing his studies in 1965 and 1966 with Ilse Rapf and Erik Werba at the Vienna State Academy, and finally with Josephine Veasey.Adam, Nicky (ed). Angas, Richard. In: Who's Who in British Opera. Scolar Press, Aldershot, 1993."]}, {"page": "1930 in British music", "response": ["*10 July – Josephine Veasey, mezzo-soprano"]}, {"page": "La damnation de Faust (Georg Solti recording)", "response": ["Alan Blyth reviewed the album on LP in Gramophone in May 1982, comparing it with earlier recordings of La damnation de Faust conducted by Colin DavisBerlioz, Hector: La damnation de Faust, cond. Colin Davis, Philips LP 6703 042 and Daniel Barenboim.Berlioz, Hector: La damnation de Faust, cond. Daniel Barenboim, Deutsche Grammophon LP 2709 087 Frederica von Stade's Marguerite, he wrote, was sensibly phrased and sounded plausibly youthful, and her \"Roi de Thule\" was done \"simply [and] sweetly\". In her \"D'amour l'ardente flamme\", though, there was \"a want of vocal warmth and a tendency to sound a shade mannered\". Von Stade was better than Barenboim's Yvonne Minton, who sang with an erratic tone and a lack of emotional engagement. But she was far outclassed by Davis's Josephine Veasey, who had a surer grasp of Berliozian style and was \"almost unbearably moving\".", "The Berlioz specialist John Warrack reviewed the album on CD in Gramophone in March 1990, comparing it to other versions conducted by Colin DavisBerlioz, Hector: La damnation de Faust, cond. Colin Davis, Philips CD 416 395 2 and Sir John Eliot Gardiner.Berlioz, Hector: La damnation de Faust, cond. John Eliot Gardiner, Philips CD 426 199 2 Frederica von Stade's Marguerite he thought \"a touch on the operatic side\" compared with Davis's Josephine Veasey's. Kenneth Riegel was not even within hailing distance of Davis's Nicolai Gedda as Faust. Georg Solti's José van Dam, though, was a better Méphistophélès than Davis's Jules Bastin. Solti's conducting was stimulating - he made the Hungarian March \"a compulsively exhilarating experience\" - but the price of his many thrills was that the score's \"wonderful variety of mood and pace and colour\" was not served as  well as it should have been.Warrack, John: Gramophone, March 1990, p. 1654"]}, {"page": "Les Troyens discography", "response": ["| 1969 || Jon Vickers,Peter Glossop,Anthony Raffell,Roger Soyer,Ian Partridge,Ryland Davies,Anne Howells,Berit Lindholm,Josephine Veasey,Heather Begg"]}]}}