{"wiki_id": "http://www.wikidata.org/entity/Q3182446", "itemLabel": "John Sebastian Marlowe Ward", "itemDescription": "English writer on the subjects of Freemasonry and esotericism", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Sebastian_Marlowe_Ward", "wikipedia_page": {"main": "John Sebastian Marlow Ward (22 December 1885 – 1949) was an English author who published widely on the subject of Freemasonry and esotericism. He was also the leader of a Christian sect, and the founder of the Abbey Folk Park, the earliest example of a folk park in Britain.\nHe was born in what is now Belize. In 1908 he graduated from the University of Cambridge with honours in history, following in the footsteps of his father, Herbert Ward, who also had studied history before entering the priesthood of the Anglican Church.\nJohn Ward became a prolific and sometimes controversial writer on a wide variety of topics. He made contributions to the history of Freemasonry and other secret societies. He was also a psychic medium or spiritualist, a prominent churchman and is still seen by some as a mystic and modern-day prophet.", "link_mentions": [{"page": "New Barnet", "response": ["*John Sebastian Marlowe Ward who founded a folk museum in Park Road."]}, {"page": "John Ward", "response": ["*John Sebastian Marlowe Ward (1885–1949), British historian, Freemason and spiritualist"]}, {"page": "Abbey Arts Centre", "response": ["Around 1930, John Sebastian Marlowe Ward became the owner of the site which a 1930 plan indicates was no longer divided into two houses. In that year, he purchased a circa 13th century tithe barn (grade II listed) and relocated it to the site from Birchington in Kent. He subsequently converted it to a church and founded a religious community. In 1934 he opened the Abbey Folk Park which by 1937 comprised 46 buildings, included historic shop fronts and a 17th-century smithy saved when East Barnet village was redeveloped and five old cottages relocated from Hadley Green. The park closed in 1940 and did not reopen before Ward sold it and moved his community to Cyprus in 1946 following legal difficulties in England."]}, {"page": "JSM Ward", "response": ["#REDIRECT John Sebastian Marlowe Ward"]}, {"page": "J. S. M. Ward", "response": ["#REDIRECT John Sebastian Marlowe Ward"]}, {"page": "Herbert Ward", "response": ["* Herbert Ward (priest), father of John Sebastian Marlowe Ward"]}, {"page": "St Mary's Church, Higham Ferrers", "response": ["Above the main figure in the canopy is a group of figures. Abraham is seated in the middle and holds a globe in his left hand, with his right hand raised in benediction. St. Andrew and St. Peter are to the left of him and the St. Paul and St. Thomas are to the right. Angels, on either side of Abraham, hold St. Maur's soul. In his 1912 book Brasses, John Sebastian Marlowe Ward says: \"Canopies over Mass priests are very rare and this is by far the finest.\"Ward, J.S. M., (2012) Brasses, Cambridge: Cambridge University Press, , (first published 1912), p.89 and p.163"]}, {"page": "John Sebastian Marlow Ward", "response": ["#REDIRECT John Sebastian Marlowe Ward"]}]}}