{"wiki_id": "http://www.wikidata.org/entity/Q3183183", "itemLabel": "Jon Cleary", "itemDescription": "English/American musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Jon_Cleary_(musician)", "wikipedia_page": {"main": "Jon Cleary (born August 11, 1962) is a British-born American funk and R&B musician based in New Orleans, Louisiana, where he has studied the \"musical culture and life of New Orleans\" according to his website. Cleary is an accomplished pianist as well as being a multi-instrumentalist, vocalist and songwriter.Cleary performs with a number of prolific musicians including Bonnie Raitt, Taj Mahal, B.B. King, Ryan Adams, and Eric Burdon. Compositions by Cleary have been recorded by such notable musicians as Taj Mahal, Bonnie Raitt, and John Scofield on his 2009 album Piety Street.Cleary's current band is Jon Cleary & The Absolute Monster Gentlemen, who have released two albums. Their album Go Go Juice won the Grammy Award for Best Regional Roots Music Album in the 58th Annual Grammy Awards.", "link_mentions": [{"page": "Bonnie Raitt", "response": ["Souls Alike was released in September 2005. In the US, it reached the top 20 on the Billboard chart. It contains the singles \"I Will Not Be Broken\" and \"I Don't Want Anything to Change\", which both charted in the top 40 of the US Adult Contemporary chart. In 2006, she released the live DVD/CD Bonnie Raitt and Friends, which was filmed as part of the critically acclaimed VH1 Classic Decades Rock Live! concert series, featuring special guests Keb' Mo', Alison Krauss, Ben Harper, Jon Cleary, and Norah Jones. The DVD was released by Capitol Records on August 15. Bonnie Raitt and Friends, which was recorded live in Atlantic City, NJ on September 30, 2005, features never-before-seen performance and interview footage, including four duets not included in the VH1 Classic broadcast of the concert. The accompanying CD features 11 tracks, including the radio single \"Two Lights in the Nighttime\" (featuring Ben Harper). In 2007, Raitt contributed to Goin' Home: A Tribute to Fats Domino. With Jon Cleary, she sang a medley of \"I'm in Love Again\" and \"All by Myself\" by Fats Domino."]}, {"page": "John Scofield", "response": ["On September 26, 2006 he released Out Louder, his second collaboration with Medeski, Martin & Wood. The group, known collectively as MSMW, toured worldwide in 2006 and 2007. Scofield performed in a duo with John Medeski named The Johns and in a trio with Medeski and drummer Adam Deitch. He recorded music inspired by gospel on the 2009 album Piety Street with Jon Cleary and George Porter Jr."]}, {"page": "Le Show", "response": ["* Jon Cleary", "Jon Cleary,"]}, {"page": "John Porter (musician)", "response": ["* 1999 Moonburn – Jon Cleary and the Absolute Monster Gentlemen", "* 2002 Jon Cleary and the Absolute Monster Gentlemen – Jon Cleary and the Absolute Monster Gentlemen", "* 2004 Pin Your Spin – Jon Cleary and the Absolute Monster Gentlemen"]}, {"page": "Silver Lining (album)", "response": ["#\"Fool's Game\" (Jon Cleary) – 4:08", "#\"Monkey Business\" (Jon Cleary) – 3:36", "* Jon Cleary – keyboards, backing vocals, duet vocals (1)"]}, {"page": "George Winston", "response": ["Many of Winston’s melodic pieces are self-described as \"rural folk piano\" or \"folk piano\", a style he developed in 1971 to complement the uptempo Stride piano he had been inspired to play by Fats Waller’s recordings from the 1920s and 1930s. These melodic pieces evoke the essence of a season and reflect natural landscapes. The third style he plays is New Orleans R&B piano, influenced mainly by James Booker, Professor Longhair, Henry Butler, as well as Dr. John and Jon Cleary."]}, {"page": "Señor Blues (Taj Mahal album)", "response": ["# \"Oh Lord, Things Are Gettin' Crazy Up in Here\" (Jon Cleary)", "# \"21st Century Gypsy Singing Lover Man\" (Taj Mahal, Jon Cleary)", "*Jon Cleary – piano, Wurlitzer piano"]}, {"page": "Cranbrook School, Kent", "response": ["* Jon Cleary, Grammy award-winning musician"]}, {"page": "Jon Cleary", "response": ["\"I realised at 40 I did not have the intellectual depth to be the writer I would like to be, so I determined to be as good a craftsman as I might be\", Cleary said later on.Murray Waldren, 'Jon Cleary: Character Builder' The Weekend Australian 1998", "After Cleary's daughter's death from breast cancer in 1987, and his wife's subsequent ill health he travelled less.Susan Geason, \"Jon Cleary: A Fortunate Life\", The Sydney Morning Herald, 6 December 1992, p. 111 Writing the Scobie Malone series of novels enabled him to tell Australian stories which appealed to an international audience, and he remained popular with readers throughout his career. Malone returned in Dragons at the Party (1987), about the Australian Bicentennial, then was in Now and Then, Amen (1988), Babylon South (1989), Murder Song (1990), Pride's Harvest (1991), Dark Summer (1992), Bleak Spring (1993), Autumn Maze (1994), Winter Chill (1995), Endpeace (1996), A Different Turf (1997), Five Ring Circus (1998), Dilemma (1999), Bear Pit (2000), Yesterday's Shadow (2001), The Easy Sin (2002) and Degrees of Connection (2004). He then wound up the series, feeling he was getting stale.", "Cleary met his wife Joy on his boat trip to England in 1946 and married her five days after they landed. They had two daughters, Catherine and Jane, the latter of whom died of breast cancer at age 37, predeceasing both of her parents. Joy Cleary developed Alzheimer's disease and went to live in a nursing home prior to her death in 2003.\"Jon Cleary\", The Book Show – Radio National, 26 February 2006\"I was very, very lucky\", said Cleary of his marriage. \"We were in love from the day we met to the day we – sorry, I mean she – died.\"", "Cleary once stated that the book which had most influenced him was The Power and the Glory by Graham Greene. \"He caught perfectly the almost heroism of a man who would have been shocked to hear that he was an hero ... I've always said that Greene could say more in one phrase than most writers in a chapter.\"\"Jon Cleary: Interview\" by Dianne Dempsey, Sun Herald, 5 October 1997, p. 43", "*Jon Cleary Papers at the Mitchell Library, Sydney – 1950–1993, 1962–2003", "* 2006 Jon Cleary career interview on Radio National", "* Michael Costigan, 'Jon Cleary: quiet parishioner was a great writer', The Catholic Weekly, 5 September 2010", "* Jon Cleary Theatre credits at AusStage"]}, {"page": "Love Is Hell (Ryan Adams album)", "response": ["*Jon Cleary - piano, Wurlitzer electric piano, rhythm guitar on all except 10, 11, 13"]}, {"page": "Souls Alike", "response": ["#\"Love on One Condition\" (Jon Cleary) – 3:43", "#\"Unnecessarily Mercenary\" (Jon Cleary) – 3:51", "* Jon Cleary – acoustic piano (1-8, 10, 11), Hammond B3 organ, Wurlitzer organ, rhythm guitar (3), backing vocals (3, 4, 7, 9)"]}, {"page": "Maple Leaf Bar", "response": ["In recent history, the bar has weekly hosted residencies from acts such as Tank and the Bangas, The Revivalists, George Porter Jr., Jon Cleary (musician) and Johnny Vidacovich. Porter still holds a weekly, Monday night residency at the bar with his trio, featuring Terrence Houston, and Michael \"Goldenthroat\" Lemmler."]}, {"page": "Ó Cléirigh", "response": ["*Jon Cleary (born 1917), Australian author", "*Jon Cleary (musician) (born 1962), American musician"]}, {"page": "Dynamite (disambiguation)", "response": ["*Dyna-Mite, a 2018 album by Jon Cleary"]}, {"page": "George Porter Jr.", "response": ["Porter joined John Scofield's Piety Street Band in 2008 to tour and to record. Jon Cleary and Ricky Fataar are also members of this band. In 2010, he replaced Reed Mathis in Bill Kreutzmann's newest band, 7 Walkers.Greenhaus, Mike https://jambands.com/features/2011/03/11/it-s-all-just-music-george-porter-jr-and-brian-stoltz-maintain-the-meters-legacy/ Jambands.com  Also in 2010 he performed with Runnin' Pardner at New Orleans' Voodoo Experience.Humphress, Corey. \"Weezer, Drake, Muse, MGMT Lead Voodoo Experience Festival 2010 Lineup.\" Pastemagazine.co. Paste Media Group, July 17, 2010. Web."]}, {"page": "Come to Papa", "response": ["*10. \"Help Me Somebody\" (Jon Cleary) - 5:46"]}, {"page": "Bill Summers (musician)", "response": ["* Jon Cleary, Moonburn (Pointblank, 1999)"]}, {"page": "Jon Cleary & the Absolute Monster Gentlemen", "response": ["#REDIRECT Jon Cleary (musician)"]}, {"page": "House M.D. Original Television Soundtrack", "response": ["# \"Got To Be More Careful\" by Jon Cleary & the Absolute Monster Gentlemen (\"Heavy\")"]}, {"page": "Jon Cleary and the Absolute Monster Gentlemen", "response": ["#REDIRECT Jon Cleary (musician)"]}, {"page": "Soul of a Man (Eric Burdon album)", "response": ["* Jon Cleary - piano"]}, {"page": "My Secret Life (Eric Burdon album)", "response": ["Musicians on this album includes Red Young, Martin Gerschwitz, Terry Wilson and Jon Cleary.", "* Jon Cleary – piano"]}, {"page": "Bonnie Raitt discography", "response": ["! scope=\"row\"| \"I'm in Love Again/All by Myself\" (with Jon Cleary)"]}, {"page": "The Absolute Monster Gentlemen", "response": ["#REDIRECT Jon Cleary (musician)#Jon Cleary & the Absolute Monster Gentlemen"]}, {"page": "Phantom Blues", "response": ["# \"Cheatin' On You\" (Jon Cleary)", "# \"Fanning the Flames\" (Jon Cleary)", "*Jon Cleary - guitar, piano, Wurlitzer, clarinet"]}, {"page": "Piety Street (album)", "response": ["Piety Street is a 2009 studio album by jazz guitarist John Scofield. It was recorded in New Orleans with Meters bassist George Porter Jr. and Jon Cleary. The album features gospel music with Cleary singing most of the songs. John Boutte is the guest vocalist on three tracks.", "* Jon Cleary – organ, piano, vocals"]}, {"page": "Playing for Change", "response": ["● PFC has worked with Bono\"Bono\" , Playing For Change. (from the band U2), Keith Richards\"Keith Richards\" , Playing For Change. (from the band The Rolling Stones), Manu Chao,\"Manu Chao\" , Playing For Change. Toots Hibbert,\"Toots Hibbert\" , Playing For Change. Ziggy Marley,\"Stephen Marley\" , Playing For Change. Keb' Mo', Baaba Maal, Char,\"Char\" , Playing For Change. Tinariwen,\"Tinariwen\" , Playing For Change. Los Lobos, Jackson Browne, Taj Mahal,\"Taj Mahal\" , Playing For Change. Jimmy Buffett,\"Jimmy Buffett\" , Playing For Change. Sara Bareilles,\"Sara Bareilles\" , Playing For Change. Maroon 5, Robert Plant, John Densmore,\"John Densmore\" , Playing For Change. Stephen Marley, Bombino,\"Bombino\" , Playing For Change. Bill Kreutzmann\"Bill Kreutzmann\" , Playing For Change. (from the band Grateful Dead), David Crosby,\"David Crosby\" , Playing For Change. Chad Smith (from the Red Hot Chili Peppers), Jason Mraz, Josh Groban, Jake Shimabukuro, Yo-Yo Ma, Citizen Cope, Bernie Williams, Trombone Shorty, Buddy Guy,\"Buddy Guy\" , Playing For Change. The Doobie Brothers\"The Doobie Brothers\" , Playing For Change. (Tom Johnston, John McFee and Pat Simmons), Jack Johnson,\"Jack Johnson\" , Playing For Change. Ben Harper, Tom Morello,\"Tom Morello\" , Playing For Change. Nattali Rize\"Nattali Rize\" , Playing For Change. Billy Branch\"Billy Branch\" , Playing For Change. James Gadson,\"James Gadson\" , Playing For Change. Pancho Amat, Warren Haynes,\"Warren Haynes\" , Playing For Change. Ivan and Cyril Neville,\"Cyril Neville\" , Playing For Change. Rocky Dawuni,\"Rocky Dawuni\" , Playing For Change. David Guido Pietroni, Jon Cleary, Donald Kinsey,\"Donald Kinsey\" , Playing For Change. Lee Oskar\"Lee Oskar\" , Playing For Change. (from the band War), Robbie Robertson, Dr. John,\"Dr. John\" , Playing For Change. Ringo Starr, Aloe Blacc, Angélique Kidjo, Annie Lennox, Becky G, Brandi Carlile with Mike McCready of Pearl Jam, Carlos Santana and Cindy Blackman Santana, Gabi Melim, Gary Clark Jr., Jim James, Keith Richards, Mavis Staples, Nathaniel Rateliff, Peter Gabriel, Rhiannon Giddens, Robert Randolph, Run The Jewels with Josh Homme, Sheila E., Skip Marley and Cedella Marley, and The War and Treaty."]}, {"page": "I'm in Love Again (song)", "response": ["*In 2007, Bonnie Raitt and Jon Cleary sang a medley of \"I'm in Love Again\" and \"All by Myself\" on the album Goin' Home: A Tribute to Fats Domino."]}, {"page": "Doctors, Professors, Kings & Queens", "response": ["|(Jon Cleary & the Absolute Monster Gentlemen)", "|Jon Cleary & The Absolute Monster Gentlemen"]}, {"page": "Cleary (surname)", "response": ["*Jon Cleary (1917–2010), Australian author", "*Jon Cleary (musician) (born 1962), American musician"]}, {"page": "Clayton Doley", "response": ["He has opened for James Brown, BB King, Buddy Guy and Junior Wells, Albert Collins, Albert King, Georgie Fame, Maceo Parker, Jon Cleary, Bon Jovi, Cheap Trick, Ronan Keating,", "In 2015 Clayton Doley released his second album as a solo artist called Bayou Billabong. The album was recorded in both New Orleans, Louisiana, and Sydney, Australia, with past and present members of Jon Cleary (musician)'s band, The Absolute Monster Gentlemen as the rhythm section. It also features marching band brass from The Treme Funktet with members of Galactic and Trombone Shorty's Orleans Avenue. Australian backing vocalists Mahalia Barnes, Jade MacRae and Juanita Tippins (The Clay-Tones) feature heavily throughout and also appearing is didgeridoo player Ganga Giri and Canadian lap slide guitar player Harry Manx. In the week of its release, Bayou Billabong made it to Number 1 both in the iTunes Blues Charts and the US Roots Music Report Blues Chart and stayed in the Australian Blues and Roots Airplay Charts six months after its release."]}, {"page": "Piety Street Recording", "response": ["Acts who have recorded at Piety Street include: Pretty Lights, Dr. Michael White, Dr. John, Ryan Adams, Dave Matthews Band, Garage A Trois, Dany Brillant, Elvis Costello & Allen Toussaint, Harold Battiste, Terence Blanchard, The Black Eyed Peas, Crowbar, Dirty Dozen Brass Band, Drums and Tuba, Joe Sample, Ed Sanders, 3 Doors Down, Steve Earle, Cassandra Wilson, Sierra Leone's Refugee All Stars, Harry Shearer, Judith Owen, OK GO, Shannon McNally, John Mooney, Nellie McKay, Erin McKeown, Korn, The Knux, Imagination Movers, Charlie Hunter, Hot 8 Brass Band, Happy Talk Band, Mary Flower,  Nicholas Payton, Less Than Jake, James Singleton, Jon Cleary, Bo Kaspers Orkester, Alec Ounsworth, Peter Stampfel, Jay Weigel, and John Scofield who named a CD after the studio.[ allmusic.com], retrieved 7/2/10pietystreet.com, retrieved 7/2/10masterdigital.com, retrieved 7/2/10 Other artists who have used the Piety Street title on their CD's include James Blood Ulmer, Eric Lindell, and Christina Groth.[ allmusic.com], Retrieved 7/5/10[ allmusic.com], Retrieved 7/5/10[ allmusic.com], Retrieved 7/5/10"]}, {"page": "SummerTyne Festival", "response": ["*Jon Cleary"]}, {"page": "Goin' Home: A Tribute to Fats Domino", "response": ["#\"I'm in Love Again/All by Myself\"  (Domino, Bartholomew) Jon Cleary and Bonnie Raitt"]}, {"page": "List of Later... with Jools Holland episodes", "response": ["|Muse / Laurel / Jon Cleary / John Grant / Easy Life / Hamzaa "]}, {"page": "List of people from Cranbrook, Kent", "response": ["*Jon Cleary (born 1962), musician."]}, {"page": "List of RocKwiz episodes", "response": ["| 65 || 5 January 2007 || Lisa Mitchell and Quan Yeomans; with Jon Cleary"]}]}}