{"wiki_id": "http://www.wikidata.org/entity/Q3182519", "itemLabel": "John Stephenson", "itemDescription": "film director and make-up artist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Stephenson_(director)", "wikipedia_page": {"main": "John Stephenson,  (born 28 May 1952) is a British director and a former vice-president and creative supervisor for Jim Henson's Creature Shop. He was nominated for a BAFTA film award in 1985 for Dreamchild and in 1991, he won an Academy Award by the Academy of Motion Picture Arts and Sciences.", "link_mentions": [{"page": "1999 in film", "response": ["| Animal Farm || TNT / Hallmark Entertainment || John Stephenson (director); Alan Janes (screenplay); Martyn Burke (teleplay); Kelsey Grammer, Ian Holm, Julia Louis-Dreyfus, Julia Ormond, Pete Postlethwaite, Paul Scofield, Patrick Stewart, Peter Ustinov, Alan Stanford, Charles Dale, Louise Gold, Paul Mark Elliott, Tim Whitnall, Caroline Gray, Gail Fitzpatrick, Gerard Walsh, Jean Beith, Jean Matt, Amanda Symonds, Nicole Tibbles, Brian Gulland, Hannah King, Tim Merton-Laight, Charlotte Merton-Laight || Comedy, Drama, Family || Live action"]}, {"page": "John Stephenson", "response": ["John Stephenson may refer to:", "*John Stephenson (MP) (c. 1709–1794), British merchant and politician", "*John Stephenson (fl.1571), MP for Hythe", "*John Stephenson (baseball) (born 1941), American baseball catcher", "*John Stephenson (cricketer, born 1903) (1903–1975), English cricketer", "*John Stephenson (cricketer, born 1907) (1907–1982), English cricketer", "*John Stephenson (cricketer, born 1965), English Test cricketer", "*John Stephenson (South African cricketer) (born 1955), South African cricketer", "*John Stephenson (footballer, born 1881) (1881–1940), Australian rules footballer for Carlton", "*John Stephenson (footballer, born 1883) (1883–1963), Australian rules footballer for Essendon", "*John Stephenson (footballer, born 1937) (1937–2014), Australian rules footballer for Carlton", "*John Stephenson (director) (born 1952), British film director", "*John Stephenson (actor) (1923–2015), American voice actor", "*John Stephenson (coachbuilder) (1809–1893), Irish-American coachbuilder who created the street railway ", "*John Stephenson (judge) (1910–1998), English barrister and judge, Lord Justice of Appeal", "*John Stephenson (physician) (1796–1842), Canadian physician and a co-founder of McGill University Faculty of Medicine", "*John Stephenson (zoologist) (1871–1933), British surgeon and zoologist"]}, {"page": "The Witches (1990 film)", "response": ["* Nominated – Saturn Award for Best Make-up (John Stephenson)"]}, {"page": "Animal Farm (1999 film)", "response": ["Animal Farm is a 1999 British-American television movie directed by John Stephenson and written by Alan Janes. Based on the 1945 novel of the same name by George Orwell and serving as an allegory of the Russian Revolution and its aftermath, it features Kelsey Grammer, Ian Holm, Julia Louis-Dreyfus, Patrick Stewart, Julia Ormond, Paul Scofield, Pete Postlethwaite and Peter Ustinov.", "The film's director John Stephenson was nominated for Starboy Award in the 2000s Oulu International Children's and Youth Film Festival."]}, {"page": "Five Children and It (film)", "response": ["Five Children and It is a 2004 family fantasy-comedy-drama adventure film adaptation of the 1902 novel Five Children and It, which features live action and computer animation. It was directed by John Stephenson, produced by Nick Hirschkorn, Lisa Henson and Samuel Hadida, written by E. Nesbit and David Solomons with music by Jane Antonia Cornish and starring Tara FitzGerald, Freddie Highmore, Alex Jennings, Jonathan Bailey, Jessica Claridge, Poppy Rogers, Alec Muggleton, Zak Muggleton, Zoë Wanamaker, Kenneth Branagh, Alexander Pownall, Robert Tygner, Eddie Izzard as the voice of It-Psammead, Georgio Serafini, John Sessions, Kim Fenton, Norman Wisdom and Duncan Preston and Zak. ", "On 3 June 2003, John Stephenson was hired and set to direct Five Children and It based on the book of the same name by E. Nesbit. David Solomons wrote the script for the film. Nick Hirschkorn, Lisa Henson and Samuel Hadida produced the film for release in 2004. On 5 June, it was announced that Tara FitzGerald, Freddie Highmore, Alex Jennings, Jonathan Bailey, Jessica Claridge, Poppy Rogers, Alec Muggleton, Zak Muggleton, Zoë Wanamaker, Kenneth Branagh, Alexander Pownall, Georgio Serafini, John Sessions, Kim Fenton, Norman Wisdom and Duncan Preston joined the film. Eddie Izzard joined the cast on 8 July to voice It-Psammead. On 15 July, it was announced that Jane Antonia Cornish would compose the music for the film. The film uses live action for the humans and computer animation for It-Psammead. Development and animation of the film was completed in England, UK and Isle of Man. The film's soundtrack also contains “Happy Birthday to You” written by Patty S. Hill (as Patty Hill) and Mildred J. Hill (as Mildred Hill) and “Robert's Theme” written and performed by Sean Lennon."]}, {"page": "List of Christian films", "response": ["| John Stephenson"]}, {"page": "The Christmas Candle", "response": ["The Christmas Candle is a 2013 British-American Christmas drama film directed by John Stephenson."]}, {"page": "17th Saturn Awards", "response": ["** John Stephenson (The Creature Shop) – The Witches"]}, {"page": "Interlude in Prague", "response": ["Interlude in Prague is a 2017 film about Wolfgang Amadeus Mozart starring Aneurin Barnard, James Purefoy, Samantha Barks, Morfydd Clark, Adrian Edmondson and Anna Rust. It was directed by John Stephenson, written by Brian Ashby and the screenplay by Brian Ashby, Helen Clare Cromarty and John Stephenson."]}, {"page": "Alan Janes", "response": ["This period saw Janes write for the TV series Minder and pen a film for David Putnam, Winter Flight, directed by Roy Battersby, and a film adaptation with Jim Henson's Creature Shop of George Orwell's Animal Farm, directed by John Stephenson."]}, {"page": "The Lady of Heaven", "response": ["Filming for The Lady of Heaven began in August 2019 and continued through October of the same year in the cities of Tbilisi, Rustavi, and Vaziani. The majority of filming took place in Vaziani and John Stephenson was brought on as a creative consultant. Further filming also took place in London the following months. It took the production team over 2 months to build the sets for Mecca and Medina as imagined in 622 AD. Actors Denise Black, Ray Fearon, and Lucas Bond were brought on to act in the film and Chris Jarman was confirmed as portraying Bilal ibn Rabah, one of the companions of Muhammad. In March 2021, LA based sales agent Hannibal Media acquired worldwide rights to the film."]}]}}