{"wiki_id": "http://www.wikidata.org/entity/Q3181793", "itemLabel": "John Hunter", "itemDescription": "Scottish footballer and manager (1878-1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hunter_(footballer,_born_1878)", "wikipedia_page": {"main": "John Bryson Hunter (6 April 1878 – 12 January 1966), also known as \"Sailor\" Hunter, was a Scottish football player and manager. He is most notable as Motherwell's first and longest-serving manager, who guided the team to their only Scottish league title in the 1931–32 season.", "link_mentions": [{"page": "Motherwell F.C.", "response": ["Motherwell enjoyed a successful period in the aftermath of World War I, managed by John Hunter. The club placed third in the 1919–20 season and, although narrowly avoiding relegation in 1924–25, they steadily climbed the table and enjoyed seven successive seasons finishing in the top three."]}, {"page": "John Hunter", "response": ["John Hunter may refer to:", "*John Hunter (British politician) (1724–1802), British Member of Parliament for Leominster", "*John Hunter (Canadian politician) (1909–1993), Canadian Liberal MP for Parkdale, 1949–1957", "*John Hunter (Consul-General) (died 1816), British Consul-General in Spain", "*John Hunter (Northern Ireland politician), Ulster unionist member of the Northern Ireland Forum", "*John Hunter (Royal Navy officer) (1737–1821), Governor of New South Wales", "*John Hunter (South Carolina politician) (c. 1750–1802), American politician", "*John Hunter (Westchester County, New York) (1778–1852), New York politician", "* Ian Hunter (Scottish footballer) (born John Hunter, fl. 1960s), Scottish footballer (Falkirk)", "*John Hunter (American football), American football player", "*John Hunter (Australian footballer), Scottish-born Australian former footballer and coach", "*John Hunter (Falkirk footballer) (fl. 1920s), Scottish footballer (Falkirk, Reading, Guildford)", "*John Hunter (footballer, born 1878) (1878–1966), known as 'Sailor', Scottish football player and manager (Motherwell)", "*John Hunter (golfer) (1871–1946), Scottish professional golfer", "*John Hunter (rower) (born 1943), New Zealand rower", "*John Hunter (Third Lanark footballer) (died 1891), Scottish football player", "*John Hunter (scientist) (born 1955), projectile researcher", "*John Hunter (screenwriter) (born 1911), American award-winning screenwriter", "*John Hunter (classicist) (1746–1837), joint founder of the Royal Society of Edinburgh", "*John Hunter (surgeon) (1728–1793), surgeon and anatomist", "*John Hunter (physician) (1754–1809), physician", "*John Hunter (bishop) (1897–1965), former bishop of Kimberley and Kuruman", "*Jackie Hunter (John Hunter) (1903–1951), Canadian entertainer", "*John Hunter (performer), New Zealand female impersonator", "*John Hunter (singer), American singer and musician", "*John Hunter Nemechek (born 1997), American racing driver"]}, {"page": "Dundee F.C.", "response": ["* John Hunter (1907)"]}, {"page": "Clyde F.C.", "response": ["The 1910 final was a bitter disappointment. For 83 minutes Clyde (McTurk; Watson & Blair; Walker, McAteer & Robertson; Stirling & McCartney; Chalmers; Jackson & Booth) held a 2–0 lead (Chalmers and Booth both scored). However, Robertson fluffed a clearance off Blair and into his own net. Dundee then netted a last minute equalizer from Langlands. The replay was far more cagey and ended goalless after extra time, but with Dundee looking physically stronger. Chalmers struck after three minutes to give Clyde a 1–0 lead in the third match. Dundee equalized before half time, and as Clyde looked jaded, John Hunter won the cup for Dundee. The 1912 final was a 2–0 defeat to Celtic."]}, {"page": "Fir Park", "response": ["====John Hunter (east) Stand==== ", "thumb|left|The John Hunter (east) Stand", "In 2016, the East Enclosure was renamed in honour of John Hunter, manager of the club's only Scottish Football League title-winning team in 1931–32. This stand's roof suffered from leaks, eventually repaired in 2017.Facilities Award for Motherwell F.C., Scottish Football Partnership, 11 September 2017 Further refurbishments, including the replacement of all seats, took place in early 2021, following the recent club record sale of David Turnbull, and with supporters unable to attend the stadium due to the COVID-19 pandemic in Scotland.Motherwell overhaul Fir Park as club prepares for return of fans, The Scotsman, 10 February 2021 ", "In November 2019, with the club almost free of debt, chief executive Alan Burrows stated that the possibility of leaving Fir Park for a new ground \"probably has to be a debate and a question that is put on the agenda quite high in the not too distant future\" due to the age and standard of some of the facilities;Motherwell virtually debt free – but it's 'just the end of the beginning', BBC Sport, 2 November 2019 however in early 2021, extensive refurbishments were carried out on the John Hunter Stand, with Burrows indicating work would also be carried out on the other stands."]}]}}