{"wiki_id": "http://www.wikidata.org/entity/Q3181859", "itemLabel": "John Kendall-Carpenter", "itemDescription": "English rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Kendall-Carpenter", "wikipedia_page": {"main": "John MacGregor Kendall Kendall-Carpenter  (25 September 1925 – 24 May 1990) was an England rugby union international who won 23 caps as a back row forward between 1949 and 1954. He subsequently served as President of the Rugby Football Union (1980–1981), the England Schools Rugby Football Union (1985–90) and Cornwall RFU (1984–87). He was also Chairman of the committee that organised the first Rugby World Cup in 1987.\nHe was one of only five Cornishmen to captain the England Rugby team – the others were E K Scott, Vic Roberts, Richard Sharp and Phil Vickery.", "link_mentions": [{"page": "England national rugby union team", "response": ["Seven former England internationals are also members of the IRB Hall of Fame. Four of them – Johnson, Alan Rotherham, Harry Vassall and Robert Seddon – were inducted for their accomplishments as players. Two other former England players, John Kendall-Carpenter and Clive Woodward, were inducted into the IRB Hall for non-playing accomplishments in the sport. Another former England player, Alfred St. George Hamersley, was inducted for achievements as both a player and a rugby administrator.", "Two other England internationals, John Kendall-Carpenter and Clive Woodward, were inducted into the IRB Hall alongside Johnson at the 2011 IRB Awards. Although both had notable careers for England, they were recognised for accomplishments in other roles in the sport. Kendall-Carpenter was cited as one of four key figures in the creation of the Rugby World Cup, whilst Woodward was inducted as coach of the 2003 World Cup winners, alongside all other World Cup-winning coaches from 1987 to 2007."]}, {"page": "Wellington School, Somerset", "response": ["* 1973 – 1990 John Kendall-Carpenter", "John Kendall-Carpenter was headmaster of the school from 1973 to 1990. Kendall-Carpenter was President of the Rugby Football Union from 1980 to 1981, the England Schools Rugby Football Union from 1985 to 1990 and the Cornish Rugby Football Union from 1984 to 1987. He was also chairman of the committee that organised the first Rugby World Cup in 1987."]}, {"page": "Truro School", "response": ["* England international rugby union captain John Kendall-Carpenter"]}, {"page": "Eastbourne College", "response": ["* John Kendall-Carpenter"]}, {"page": "Webb Ellis Cup", "response": ["John Kendall-Carpenter, former England forward and the organizer of the first Rugby World Cup, and Bob Weighill, the secretary of the International Rugby Board and also a former England forward, visited Garrard & Co, the crown jeweller in Regent Street, London. Director Richard Jarvis, brought the particular cup down from the vault and showed it to both of them."]}]}}