{"wiki_id": "http://www.wikidata.org/entity/Q3182021", "itemLabel": "John Maybury", "itemDescription": "British film director", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Maybury", "wikipedia_page": {"main": "John Maybury (born 25 March 1958) is an English filmmaker and artist. In 2005 he was named as one of the 100 most influential gay and lesbian people in Britain.", "link_mentions": [{"page": "Ryuichi Sakamoto", "response": ["Other films scored by Sakamoto include Pedro Almodóvar's Tacones lejanos (High Heels) (1991); Bertolucci's The Little Buddha (1993); Oliver Stone's Wild Palms (1993); John Maybury's Love Is the Devil: Study for a Portrait of Francis Bacon (1998); Brian De Palma's Snake Eyes (1998) and Femme Fatale (2002); Oshima's Gohatto (1999); and Jun Ichikawa's (director of the Mitsui ReHouse commercial from 1997 to 1999 starring Chizuru Ikewaki and Mao Inoue) Tony Takitani (2005)."]}, {"page": "Derek Jacobi", "response": ["He was appointed the joint artistic director of the Chichester Festival Theatre, with the West End impresario Duncan Weldon in 1995 for a three-year tenure. As an actor at Chichester he also starred in four plays, including his first Uncle Vanya in 1996 (he played it again in 2000, bringing the Chekhov play to Broadway for a limited run). Jacobi's work during the 1990s included the 13-episode series TV adaptation of the novels by Ellis Peters, Cadfael (1994–1998) and a televised version of Breaking the Code (1996). Film appearances of the era included performances in Kenneth Branagh's Dead Again (1991), Branagh's full-text rendition of Hamlet (1996) as King Claudius, John Maybury's Love is the Devil (1998), a portrait of painter Francis Bacon, as Senator Gracchus in Gladiator (2000) with Russell Crowe, and as \"The Duke\" opposite Christopher Eccleston and Eddie Izzard in a post-apocalyptic version of Thomas Middleton's The Revenger's Tragedy (2002)."]}, {"page": "1998 in film", "response": ["* Love Is the Devil: Study for a Portrait of Francis Bacon, directed by John Maybury, starring Derek Jacobi, Daniel Craig and Tilda Swinton – (UK)"]}, {"page": "I Do Not Want What I Haven't Got", "response": ["*John Maybury – cover design"]}, {"page": "Keira Knightley", "response": ["Knightley appeared alongside Sienna Miller, Cillian Murphy, and Matthew Rhys in John Maybury's 2008 wartime drama The Edge of Love. The film had her play the role of Vera Phillips, a childhood friend of Welsh poet Dylan Thomas and his wife Caitlin Macnamara. Knightley wrote the script with her mother, Sharman Macdonald, with Macnamara in mind. After Knightley signed on, her character's role was increased with the film focusing on her romance with a British soldier. Knightley connected to Vera's quietness, and described her as \"tragic and beautiful\".  She based her performance on Marlene Dietrich, and was to mime to her prerecorded voice, before being told by Maybury to sing live. Knightley initially felt embarrassed to do so, saying she \"[shook] like a leaf\" but eventually went through with the plan. Upon release, the film became a moderate critical and commercial success.-  Knightley's performance and singing abilities were praised;The Independent noted that Knightley \"gives Vera an independence and complexity that's aeons ahead\", while the Los Angeles Times wrote \"the film belongs to the women, with Knightley going from strength to strength (and showing she can sing!)\".- "]}, {"page": "Blitz Kids", "response": ["In 2017 The National Portrait Gallery acquired portraits of Blitz Kids Stephen Linard, David Holah, John Maybury and Cerith Wyn Evans by photographer David Gwinnutt, which were displayed in the exhibition Before We Were Men "]}, {"page": "Lisa Stansfield", "response": ["In September 2007, Stansfield appeared in another television series, Agatha Christie's Marple. She played Mary Durrant in the episode titled Ordeal by Innocence. Stansfield dubbed one of the characters (Millie, an elf) for the English version of the Finnish animated film Quest for a Heart, released in December 2007. She also recorded the title song, written by Charlie Mole and Lee Hall. Stansfield joined the cast of the 2008 film The Edge of Love, directed by John Maybury, playing the role of Ruth Williams."]}, {"page": "2929 Entertainment", "response": ["|John Maybury"]}, {"page": "The Jacket", "response": ["The Jacket is a 2005 American science fantasy psychological thriller/horror film directed by John Maybury and starring Adrien Brody, Keira Knightley, Kris Kristofferson and Jennifer Jason Leigh. It is partly based on the 1915 Jack London novel The Star Rover, published in the United Kingdom as The Jacket. Quotes director Maybury: \"'I know you think it is a load of Hollywood nonsense,' he says amiably, 'but it is in fact loosely based a true story that became a Jack London story.'\" Massy Tadjedin wrote the screenplay based on a story by Tom Bleecker and Marc Rocco. The original music score is composed by Brian Eno and the cinematography is by Peter Deming.", "Category:Films directed by John Maybury"]}, {"page": "Join Hands", "response": ["Initially, the group wanted to release an album cover using an edited image from a Holy Communion card, showing children joining hands. The image had been photocopied several times, so it had become distorted. The art direction was by John Maybury, a college friend of Morris. Their manager, Stevenson, was unable to determine who owned the copyright and advised that the band would be bankrupted if they were sued as a result. Polydor also became nervous about copyright infringement, so the artwork was pulled at the last minute; the record company's executives also disliked its religious nature. A UK tour had already been scheduled to coincide with the release of the album, so there was no possibility of delaying the release.", "* John Maybury – sleeve illustration"]}, {"page": "Nothing Compares 2 U", "response": ["In 1989, Irish singer Sinéad O'Connor recorded a version of the song for her second studio album, I Do Not Want What I Haven't Got. It was released as the album's second single in early 1990 and became a worldwide hit. O'Connor co-produced the record with Nellee Hooper, and its music video, directed by John Maybury, received heavy rotation on MTV. In December 1990, Billboard named \"Nothing Compares 2 U\" as the \"#1 World Single\" of 1990 at its first Billboard Music Awards. This version is written and composed in the key of F major.", "Directed by John Maybury, the video consists mostly of a closeup on Sinéad O'Connor's face as she goes through stages of sadness and anger while singing the lyrics; the rest consists of her walking through the Parc de Saint-Cloud in Paris. Toward the end of the video, two tears roll down her face, one on each cheek. O'Connor has said that her tears were real. She did not intend to cry but then thought, \"I should let this happen.\" She explained that the tears were triggered by thoughts of her mother, who died in a car accident in 1985. She said she learned to channel her emotions with the \"bel canto\" singing style, which she compared to extreme acting methods. In the middle and at the very end of the video there is a shot from O'Connor's photo session for the I Do Not Want What I Haven't Got album cover."]}, {"page": "The Lion and the Cobra", "response": ["* John Maybury – art direction, cover art"]}, {"page": "Darklands (album)", "response": ["* John Maybury – photography"]}, {"page": "The Colony Room Club", "response": ["* 1998: Bacon, Belcher and the club were featured in John Maybury's film Love Is the Devil: Study for a Portrait of Francis Bacon, in which Belcher was played by Tilda Swinton.", "* John Maybury"]}, {"page": "Norman Rosenthal", "response": ["Rosenthal made cameo appearances in the British film director Derek Jarman's Sebastiane (1976) and Caravaggio (1986). He was interviewed by the filmmaker John Maybury in Love is the Devil: Study for a Portrait of Francis Bacon, and played a donkey-riding Ludwig Wittgenstein in Otto Muehl's Back to Fucking Cambridge."]}, {"page": "Morrissey discography", "response": ["| John Maybury"]}, {"page": "List of gay, lesbian or bisexual people: M", "response": ["| John Maybury"]}, {"page": "1994 Los Angeles Film Critics Association Awards", "response": ["**John Maybury – Remembrance of Things Fast: True Stories Visual Lies "]}, {"page": "Erasure discography", "response": ["| John Maybury"]}, {"page": "Section Eight Productions", "response": ["|John Maybury"]}, {"page": "Our Frank", "response": ["The promo video was filmed by John Maybury and featured footage of Morrissey miming to the song, intercut with scenes of skinheads running through the streets around London's Kings Cross. Morrissey was unhappy with the video and later misremembered the director's name in a 2006 interview in which he said, \"I made a video years ago for the song \"Our Frank\" with the director James Maybury [sic] that was so awful that we tried to hide it.\""]}, {"page": "Love Is the Devil: Study for a Portrait of Francis Bacon", "response": ["Love Is the Devil: Study for a Portrait of Francis Bacon is a 1998 film made for television by the BBC. It was written and directed by John Maybury and stars Derek Jacobi, Daniel Craig and Tilda Swinton.", "The film won three awards at the Edinburgh International Film Festival: Best New British Feature (director John Maybury) and two Best British Performance awards, one for Jacobi and, the other for future James Bond actor, Craig. The film was also screened in the Un Certain Regard section at the 1998 Cannes Film Festival. Craig's performance was well received by critics, acknowledging it as his breakthrough role.", "Category:Films directed by John Maybury"]}, {"page": "Cyndi Lauper discography", "response": ["| John Maybury"]}, {"page": "John Deakin", "response": ["Deakin was the basis for the photographer Carl Castering in Colin Wilson's novel Ritual in the Dark. Deakin was played by actor Karl Johnson in John Maybury's biographical film about Francis Bacon, Love Is the Devil: Study for a Portrait of Francis Bacon."]}, {"page": "Frances-Anne Solomon", "response": ["Solomon returned to television as a Script Editor for ScreenPlay, a strand of mostly studio-based TV dramas. Between 1992 and 1998 she worked as a script editor and then as a producer and executive producer for BBC Single Drama and Films under George S. J. Faber. For the BBC she produced and executive-produced feature films, including Speak Like a Child, director John Akomfrah's narrative debut, and Love Is The Devil, John Maybury's award-winning first feature. She credits her time at the BBC as providing her with a grounding, and vision of the importance and creative power of public service broadcasting."]}, {"page": "The Edge of Love", "response": ["The Edge of Love is a 2008 British biographical romantic drama film directed by John Maybury and starring Keira Knightley, Sienna Miller, Cillian Murphy and Matthew Rhys. The script was written by Knightley's mother, Sharman Macdonald. Originally titled The Best Time of Our Lives, the fictional story concerns Welsh poet Dylan Thomas (played by Rhys), his wife Caitlin Macnamara (played by Miller) and their married friends, the Killicks (played by Knightley and Murphy). The film premiered at the Edinburgh International Film Festival.", "Category:Films directed by John Maybury"]}, {"page": "Cultural depictions of Dylan Thomas", "response": ["*2008: The Edge of Love starring Matthew Rhys as the poet, directed by John Maybury, written by Sharman Macdonald, and drawing on David N. Thomas' book Dylan Thomas: A Farm, Two Mansions and a Bungalow."]}, {"page": "Home Movies (album)", "response": ["# \"Native Land\" – video directed by John Maybury"]}, {"page": "John Mathieson (cinematographer)", "response": ["Mathieson was born on Isle of Purbeck, Dorset, England. Beginning his career in the British film industry as camera assistant to Gabriel Beristain, Mathieson worked his way through the ranks. In 1988 he garnered recognition for the ground breaking video \"Peek-a-Boo\"https://www.youtube.com/watch?v=p9415tgSlPo for Siouxsie and the Banshees, directed by Peter Scammell. He collaborated with John Maybury, director of the Sinéad O'Connor video \"Nothing Compares 2 U\", going on to photograph Maybury's award-winning film Love Is the Devil: Study for a Portrait of Francis Bacon. Mathieson honed his craft through the 1990s shooting numerous television commercials and music videos for artists including Madonna, Prince and Massive Attack.", "|John Maybury"]}, {"page": "List of time travel works of fiction", "response": ["| John Maybury"]}, {"page": "Vincent Regan", "response": ["Regan is also a screenwriter and director, developing projects for his own film company. His script, Come Like Shadows, is an accessible but classic interpretation of Macbeth headlining Sean Bean and Tilda Swinton and will be directed by John Maybury. He also appeared briefly as a sexually confused character in British series The Street."]}, {"page": "1998 Toronto International Film Festival", "response": ["* Love Is the Devil by John Maybury"]}, {"page": "Portobello Film Festival", "response": ["The Portobello Film Festival is an independent international film festival based in London, which annually premiers over 700 new films, including features, shorts, documentaries, music films, and animation. Additionally, workshops and talks with top film directors (such as Stephen Frears and John Maybury) are also featured.The Independent  Admission to the three-week-long festival is free of charge.\"From a Woody Allen premiere to Banksy-influenced graffiti, Ben Walters rounds up the panoply of pleasures at the Portobello Film Festival\", Time Out"]}, {"page": "Peter Deming", "response": ["| John Maybury"]}, {"page": "List of American films of 2005", "response": ["| The Jacket || Warner Independent Pictures / Mandalay Pictures || John Maybury (director); Massy Tadjedin (screenplay); Adrien Brody, Keira Knightley, Kris Kristofferson, Jennifer Jason Leigh, Kelly Lynch, Brad Renfro, Daniel Craig, Steven Mackintosh, Brendan Coyle, Mackenzie Phillips, Jason Lewis, Richard Dillane, Jonah Lotan, Angel Coulby, Paul Birchard, Nigel Whitmey, Ian Porter, Anthony Edridge, Kerry Shale, Angus MacInnes, Richard Durden, Tristan Gemmill, Colin Stinton, Tara Summers, Angelo Andreou, Teresa Gallagher, Charneh Demir, Garrick Hagon, Fish || Horror, Thriller ||"]}, {"page": "List of directors associated with art film", "response": ["* John Maybury"]}, {"page": "List of thriller films of the 2000s", "response": ["|The Jacket||John Maybury||Adrien Brody, Keira Knightley, Kris Kristofferson ||United StatesUnited Kingdom||"]}, {"page": "Sophie Parkin", "response": ["Sophie starred in many commercials as a child, as varied as Wall's sausages, Comfort fabric conditioner and as the Dulux girl. She also modelled in Nova magazine and The Sunday Times and appeared in Andrew Logan’s Alternative Miss World in 1979 film. She has appeared in film recently, such as the Dylan Thomas biopic The Edge of Love, directed by John Maybury and starring Keira Knightley, Sienna Miller and Matthew Rhys."]}, {"page": "List of science fiction films of the 2000s", "response": ["|The Jacket||John Maybury||Adrien Brody, Keira Knightley, Kris Kristofferson, Jennifer Jason Leigh||United States||Psychological thriller"]}, {"page": "List of Welsh films", "response": ["2008: The Edge of Love starred Matthew Rhys as Dylan Thomas, Keira Knightley, Sienna Miller (as Dylan's wife, Caitlin Macnamara) and Cillian Murphy. Directed by John Maybury, this film is about part of Thomas' life in Swansea during World War II."]}, {"page": "List of avant-garde films of the 1990s", "response": ["|John Maybury"]}, {"page": "List of British films of 1998", "response": ["|Love is the Devil||John Maybury||Derek Jacobi, Daniel Craig||Biopic||"]}]}}