{"wiki_id": "http://www.wikidata.org/entity/Q3183684", "itemLabel": "Jordan Crane", "itemDescription": "English rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jordan_Crane_(rugby_union)", "wikipedia_page": {"main": "Jordan Stephen Crane (born 3 June 1986 in Bromsgrove) is a former professional rugby union player, who recently played for Bristol Bears in the Premiership Rugby. Crane has also played internationally for England.\nCrane is renowned for his impressive physique and powerful runs from the base of the scrum. He consistently ranks as one of the most frequent carriers of the ball in English club rugby.He switched to playing rugby union relatively late after playing football for a number of professional clubs' junior sides.", "link_mentions": [{"page": "Martin Corry (rugby union)", "response": ["Following the 2007 Rugby World Cup, Corry returned to Leicester as captain. His regular position switched to blindside flanker to accommodate Jordan Crane who had come into the side in Corry's absence.  Corry started the 2008 Anglo-Welsh Cup Final, which ended in defeat to the Ospreys, and the 2008 Premiership final, where Wasps were once again winners in a Twickenham showpiece final. In April 2008, Corry signed a one-year contract extension with Leicester."]}, {"page": "Bristol Bears", "response": ["In  Europe , Bristol were drawn in Pool 4 of the Challenge Cup with the other teams being Stade Rochelais, Zebre and Yenisey-STM Krasnoyarsk. On 15 December 2018, Bristol recorded a surprise win over Stade Rochelais in a 3–13 at the Stade Marcel-Deflandre through a try by forward Jordan Crane and a dogged defensive display.https://www.bbc.co.uk/sport/rugby-union/46526258 They finished second in their group before losing 39–15 to Stade Rochelais in the quarter finals, ending their run in the tournament.", "*Academy transition coach – Jordan Crane"]}, {"page": "Colston's School", "response": ["* Jordan Crane, rugby union footballer and current Bristol player"]}, {"page": "Martyn Williams", "response": ["In the Heineken Cup semi-final match against Leicester Tigers on 3 May 2009, Williams missed a crucial kick in the penalty shootout after the game had finished level after extra time, allowing Jordan Crane to step up and score the winning kick. It was the first time that a professional rugby union match had been decided by a shootout."]}, {"page": "Crane (surname)", "response": ["* Jordan Crane (comics) (b. 1973), American comics creator", "* Jordan Crane (rugby union) (b. 1986), English rugby union player"]}, {"page": "Jordan Crane (Rugby Player)", "response": ["#REDIRECT Jordan Crane (rugby union) "]}, {"page": "South Bromsgrove High School", "response": ["*Jordan Crane, rugby player, Leicester Tigers"]}, {"page": "2007–08 Premiership Rugby", "response": ["|N8 ||8 || Jordan Crane"]}, {"page": "2007–08 EDF Energy Cup", "response": ["|N8 ||8 || Jordan Crane"]}, {"page": "2008–09 Premiership Rugby", "response": ["|N8 ||8 || Jordan Crane"]}, {"page": "2009 Heineken Cup Final", "response": ["The Blues were the only team to come through the pool stage unbeaten and, going into the quarter-finals, they were the joint-top try scorers in the competition, along with Leicester themselves. Ben Blair gave Cardiff the lead with a penalty before the 15-minute mark, but Leicester responded with a converted try from Scott Hamilton and a Julien Dupuy penalty to take the score to 10–3. Cardiff hit back with three penalties of their own before Dupuy slotted over to give Leicester a 13–12 half-time lead. After half-time, Leicester increased their lead with a converted try from Geordan Murphy and two more penalties from Dupuy; however, only a few minutes later, the Tigers were hit with two quick-fire sin-binnings, and the Blues took full advantage by scoring two converted tries from Jamie Roberts and Tom James to tie the scores at 26–26 and send the game into extra time. Aside from two missed drop goal attempts from Johne Murphy and Aaron Mauger, extra time was largely uneventful and the match went to the first penalty shootout in Heineken Cup history. The first seven kicks in the shootout were all successful, giving Cardiff a 4–3 lead before Johne Murphy stepped up; however, the Irish winger missed the target, giving Tom James a chance to win the shootout for the Blues, only for the Welshman to miss his kick, allowing Scott Hamilton to convert and take the shootout to sudden death. Both teams successfully converted two more kicks before Martyn Williams wildly hooked his attempt wide and Jordan Crane slotted over to send Leicester into the final.", "|N8 ||8 || Jordan Crane"]}, {"page": "Jordan Crane (rugby player)", "response": ["#REDIRECT Jordan Crane (rugby union)"]}, {"page": "2009 June rugby union tests", "response": ["| ||19||Jordan Crane"]}, {"page": "2009 end-of-year rugby union internationals", "response": ["|N8 ||8 ||Jordan Crane"]}, {"page": "List of England national rugby union players", "response": ["|1309||Jordan Crane||(no. 8) ||2008-11-22||v South Africa at Twickenham"]}, {"page": "2009–10 Premiership Rugby", "response": ["|N8 ||8 || Jordan Crane"]}, {"page": "2010 end-of-year rugby union internationals", "response": ["|OF ||G ||Jordan Crane"]}, {"page": "2010–11 Premiership Rugby", "response": ["|N8 ||8 || Jordan Crane ||  || "]}, {"page": "2011 Churchill Cup", "response": ["|N8 ||8 ||Jordan Crane (c)", "|N8 ||8 ||Jordan Crane (c)"]}, {"page": "2012 end-of-year rugby union internationals", "response": ["|N8 ||G|| Jordan Crane || || "]}, {"page": "2012–13 Premiership Rugby", "response": ["|N8 ||8 || Jordan Crane "]}, {"page": "2009 Australia national rugby union team tour", "response": ["|N8 ||8 ||Jordan Crane || || "]}, {"page": "Jordan Crane", "response": ["Jordan Crane may refer to:", "* Jordan Crane (cartoonist) (born 1973), American comics creator", "* Jordan Crane (rugby union) (born 1986), English rugby union player", "* Senator Jordan Crane, fictional Illinois senator on the AMC series Hell on Wheels"]}, {"page": "2012 Māori All Blacks tour of England", "response": ["|N8 ||G|| Jordan Crane || || "]}, {"page": "2008 South Africa rugby union tour of Europe", "response": ["|align=right|  Jordan Crane||align=right|N8||align=center|20||N8||Heinrich Brüssow "]}, {"page": "Cardiff Blues vs Leicester Tigers (2008–09 Heineken Cup)", "response": ["The second semi-final of the 2008–09 Heineken Cup, the premier European club rugby union competition, saw Cardiff Blues take on Leicester Tigers at the Millennium Stadium in Cardiff on 3 May 2009. The scores were level after regular time and neither team was able to score during extra time, resulting in the first ever penalty shoot-out in a professional rugby union match. Both teams missed one of their first five kicks, taking the shoot-out to sudden death. Both teams were successful with their kicks in the first two rounds of sudden death, before Martyn Williams missed Cardiff's eighth kick allowing Jordan Crane to win the game for Leicester with his successful kick.", "Cardiff won the coin toss and elected to kick first. Ben Blair and Julien Dupuy, the goal-kickers used during the match were the first to attempt kicks for their respective sides, were both successful. The teams then nominated other players on their team who had experience at goal-kicking, both teams being successful with their second and third kicks. Cardiff's fourth player Ceri Sweeney, was also an experienced goal-kicker and was successful; however, Leicester selected Johne Murphy, who was not a regular kicker, and he missed to make the score 4–3 after four of the five rounds. This meant if Cardiff were successful with their next kick, they would have an unassailable lead and would win the match. With no more experienced goal kickers to choose from, winger Tom James stepped up to take the kick, but missed, allowing Leicester the chance to draw level. Scott Hamilton scored with his kick to bring the scores to 4–4 after five kicks and take the shoot-out to sudden death. The teams were both successful with their next two kicks, including Craig Newby for Leicester who was the first forward to take a kick in the shoot-out. With all seven backs having already attempted a kick, Cardiff were required to select a forward player for their eighth kick, and chose flanker Martyn Williams. He missed, giving Leicester the chance to win the match if they were successful with their eighth kick. Number 8 Jordan Crane was selected for the attempt and was successful, resulting in Leicester winning the shoot-out 7–6 and advancing to the 2009 Heineken Cup Final.", "| ||8 || Jordan Crane", "Martyn Williams remained in the dressing room for 90 minutes after the game, and when he emerged opted not to speak to the media. He later did give his reaction, expressing his opinion that the format was a bit of a lottery and observed \"somebody was going to miss – I've just got to live with the fact that it was me.\" He also credited several of the victorious Leicester players who had commiserated with him after the game and others who had sent messages of support to him. Jordan Crane said after the match that he had felt calm prior to taking his kick, as Williams' miss meant that in the event Crane also missed, the scores would remain level and sudden death would continue. Tom James, who had missed a kick earlier in the shoot-out that would have won the match for Cardiff, said that \"'gutted' is the only word that properly describes how I am feeling\"."]}, {"page": "List of 2016–17 Premiership Rugby transfers", "response": ["* Jordan Crane from  Leicester Tigers", "* Jordan Crane to  Bristol Rugby"]}, {"page": "List of Leicester Tigers players selected for international rugby", "response": ["|112||Jordan Crane||(No. 8)||||2008-11-22||"]}, {"page": "History of Leicester Tigers", "response": ["Over the summer of 2006 the core of a new pack was recruited especially Jordan Crane, the Number 8, who arrived from Leeds; Martin Castrogiovanni joined from Calvisano and Marcos Ayerza joined from domestic rugby in his native Argentina.  Tom Croft also made his debut this season after coming through the club's academy system."]}, {"page": "Leicester Tigers in cup finals", "response": ["|N8 ||8 || Jordan Crane", "|N8 ||8 || Jordan Crane", "|N8 ||8 || Jordan Crane", "|N8 ||8 || Jordan Crane", "|N8 ||8 || Jordan Crane ||  || ", "|N8 ||8 || Jordan Crane ", "|N8 ||8 || Jordan Crane"]}, {"page": "List of 2020–21 Premiership Rugby transfers", "response": ["* Jordan Crane retired"]}, {"page": "2019–20 Bristol Bears season", "response": ["* Jordan Crane retired"]}]}}