{"wiki_id": "http://www.wikidata.org/entity/Q319362", "itemLabel": "George Cayley", "itemDescription": "British aeronautics engineer (1773-1857)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Cayley", "wikipedia_page": {"main": "Sir George Cayley, 6th Baronet (27 December 1773 – 15 December 1857) was an English engineer, inventor, and aviator. He is one of the most important people in the history of aeronautics. Many consider him to be the first true scientific aerial investigator and the first person to understand the underlying principles and forces of flight.In 1799, he set forth the concept of the modern aeroplane as a fixed-wing flying machine with separate systems for lift, propulsion, and control.\nHe was a pioneer of aeronautical engineering and is sometimes referred to as \"the father of aviation.\" He discovered and identified the four forces which act on a heavier-than-air flying vehicle: weight, lift, drag and thrust. Modern aeroplane design is based on those discoveries and on the importance of cambered wings, also identified by Cayley. He constructed the first flying model aeroplane and also diagrammed the elements of vertical flight.\nHe also designed the first glider reliably reported to carry a human aloft. He correctly predicted that sustained flight would not occur until a lightweight engine was developed to provide adequate thrust and lift. The Wright brothers acknowledged his importance to the development of aviation.Cayley represented the Whig party as Member of Parliament for Scarborough from 1832 to 1835, and in 1838, helped found the UK's first Polytechnic Institute, the Royal Polytechnic Institution (now University of Westminster) and served as its chairman for many years. He was a founding member of the British Association for the Advancement of Science and was a distant cousin of the mathematician Arthur Cayley.\n\n", "link_mentions": [{"page": "Aircraft", "response": ["The first heavier-than-air craft capable of controlled free-flight were gliders. A glider designed by George Cayley carried out the first true manned, controlled flight in 1853.", "Gliders are heavier-than-air aircraft that do not employ propulsion once airborne. Take-off may be by launching forward and downward from a high location, or by pulling into the air on a tow-line, either by a ground-based winch or vehicle, or by a powered \"tug\" aircraft. For a glider to maintain its forward air speed and lift, it must descend in relation to the air (but not necessarily in relation to the ground). Many gliders can \"soar\", i.e., gain height from updrafts such as thermal currents. The first practical, controllable example was designed and built by the British scientist and pioneer George Cayley, whom many recognise as the first aeronautical engineer. Common examples of gliders are sailplanes, hang gliders and paragliders."]}, {"page": "Aeronautics", "response": ["In the late fifteenth century, Leonardo da Vinci followed up his study of birds with designs for some of the earliest flying machines, including the flapping-wing ornithopter and the rotating-wing helicopter. Although his designs were rational, they were not based on particularly good science. Many of his designs, such as a four-person screw-type helicopter, have severe flaws. He did at least understand that \"An object offers as much resistance to the air as the air does to the object.\" (Newton would not publish the Third law of motion until 1687.) His analysis led to the realisation that manpower alone was not sufficient for sustained flight, and his later designs included a mechanical power source such as a spring. Da Vinci's work was lost after his death and did not reappear until it had been overtaken by the work of George Cayley.", "Sir George Cayley (1773–1857) is widely acknowledged as the founder of modern aeronautics. He was first called the \"father of the aeroplane\" in 1846 and Henson called him the \"father of aerial navigation.\" He was the first true scientific aerial investigator to publish his work, which included for the first time the underlying principles and forces of flight."]}, {"page": "Aerodynamics", "response": ["In 1799, Sir George Cayley became the first person to identify the four aerodynamic forces of flight (weight, lift, drag, and thrust), as well as the relationships between them,Cayley, George. \"On Aerial Navigation\" Part 1 , Part 2 , Part 3  Nicholson's Journal of Natural Philosophy, 1809–1810. (Via NASA). Raw text. Retrieved: 30 May 2010. and in doing so outlined the path toward achieving heavier-than-air flight for the next century.  In 1871, Francis Herbert Wenham constructed the first wind tunnel, allowing precise measurements of aerodynamic forces.  Drag theories were developed by Jean le Rond d'Alembert, Gustav Kirchhoff, and Lord Rayleigh. In 1889, Charles Renard, a French aeronautical engineer, became the first person to reasonably predict the power needed for sustained flight. Otto Lilienthal, the first person to become highly successful with glider flights, was also the first to propose thin, curved airfoils that would produce high lift and low drag.  Building on these developments as well as research carried out in their own wind tunnel, the Wright brothers flew the first powered airplane on December 17, 1903."]}, {"page": "December 27", "response": ["*1773 – George Cayley, English engineer and politician (d. 1857)"]}, {"page": "Hang gliding", "response": ["In 1853, George Cayley invented a slope-launched, piloted glider."]}, {"page": "Wheel", "response": ["Wire wheels are used on most bicycles and still used on many motorcycles. They were invented by aeronautical engineer George Cayley and first used in bicycles by James Starley. A process of assembling wire wheels is described as wheelbuilding."]}, {"page": "Unpowered aircraft", "response": ["The first practical, controllable glider was designed and built by the British scientist and pioneer George Cayley who many recognise as the first aeronautical engineer. It flew in 1849."]}, {"page": "Seat belt", "response": ["Seatbelts were invented by English engineer George Cayley to use on his glider, in the mid-19th century."]}, {"page": "Timeline of transportation technology", "response": ["*1849 - Sir George Cayley's gliders achieved brief wing-borne hops from around 1849.Flight magazine 1954", "*1853 – Sir George Cayley built and demonstrated the first heavier-than-air aircraft (a glider)."]}, {"page": "Wright brothers", "response": ["Wilbur said, \"Lilienthal was without question the greatest of the precursors, and the world owes to him a great debt.\" In May 1899 Wilbur wrote a letter\"Wilbur Wright May 30, 1899 Letter to Smithsonian.\" Smithsonian Scrapbook: Letters from the Archives. Retrieved: September 21, 2010. to the Smithsonian Institution requesting information and publications about aeronautics.Howard 1988, p. 30. Drawing on the work of Sir George Cayley, Chanute, Lilienthal, Leonardo da Vinci, and Langley, they began their mechanical aeronautical experimentation that year.", "The brothers did not discover this principle, but took advantage of it. The better lift of a cambered surface compared to a flat one was first discussed scientifically by Sir George Cayley. Lilienthal, whose work the Wrights carefully studied, used cambered wings in his gliders, proving in flight the advantage over flat surfaces."]}, {"page": "Aviation", "response": ["In 1799, Sir George Cayley set forth the concept of the modern airplane as a fixed-wing flying machine with separate systems for lift, propulsion, and control. Early dirigible developments included machine-powered propulsion (Henri Giffard, 1852), rigid frames (David Schwarz, 1896) and improved speed and maneuverability (Alberto Santos-Dumont, 1901)"]}, {"page": "List of inventors", "response": ["*George Cayley (1773–1857), UK – tension-spoke wheels"]}, {"page": "Sir George Cayley's coachman", "response": ["#REDIRECT George Cayley"]}, {"page": "Model aircraft", "response": ["Baronet Sir George Cayley built, and flew, internal and external combustion gunpowder-fueled model aircraft engines in 1807, 1819, and 1850. These had no crank, working ornithopter-like flappers instead of a propeller. He speculated that the fuel might be too dangerous for manned aircraft."]}, {"page": "Continuous track", "response": ["The British polymath Sir George Cayley patented a continuous track, which he called a \"universal railway\" in 1825. In 1832 a steam ploughing engine using continuous tracks was built by a British textile manufacturer called John Heathcote which apparently was somewhat successful but was lost when it sank into a swamp by accident and was then abandoned as the inventor did not have the funds to continue development. In 1837, Russian army captain Dmitry Andreevich Zagryazhsky (1807 – after 1860) designed a \"carriage with mobile tracks\" which he patented the same year, but due to a lack of funds and interest from manufacturers he was unable to build a working prototype, and his patent was voided in 1839."]}, {"page": "Alberto Santos-Dumont", "response": ["Having already accumulated technical knowledge, mainly concerning engines, in early 1905, Santos Dumont built a model glider, the N-11, inspired by a self-stabilizing prototype made 100 years earlier by English scientist George Cayley, considered to be the first airplane in history: the model, 1.5 metres long by 1.2 metres wide, had fixed wings, a cruciform tail and a movable weight to adjust the center of gravity. Dumont's glider differed from Cayley's in size, wing profile, and the fact that it had no movable weight. The project was abandoned due to poor stability."]}, {"page": "Aerospace", "response": ["Modern aerospace began with Engineer George Cayley in 1799. Cayley proposed an aircraft with a \"fixed wing and a horizontal and vertical tail,\" defining characteristics of the modern airplane."]}, {"page": "Regency era", "response": ["* George Cayley"]}, {"page": "Flight", "response": ["George Cayley studied flight scientifically in the first half of the 19th century, and in the second half of the 19th century Otto Lilienthal made over 200 gliding flights and was also one of the first to understand flight scientifically. His work was replicated and extended by the Wright brothers who made gliding flights and finally the first controlled and extended, manned powered flights.\"Orville Wright's Personal Letters on Aviation.\" Shapell Manuscript Foundation, (Chicago), 2012."]}, {"page": "Stirling engine", "response": ["Stirling came up with a first air engine in 1816. The principle of the Stirling Air Engine differs from that of Sir George Cayley (1807), in which the air is forced through the furnace and exhausted, whereas in Stirling's engine the air works in a closed circuit. It was to it that the inventor devoted most of his attention."]}, {"page": "Bicycle wheel", "response": ["The first wheel to use the tension in metal spokes was invented by Sir George Cayley to achieve lightness in his 1853 glider.In his notebook, dated March 19, 1808, Cayley proposed that in order to produce \"the lightest possible wheel for aerial navigation cars,\" one should \"do away with wooden spokes altogether and refer the whole firmness of the wheel to the strength of the rim only, by the intervention of tight strong cording … \"  See:  J.A.D. Ackroyd (2011) \"Sir George Cayley:  The invention of the aeroplane near Scarborough at the time of Trafalgar,\"  Journal of Aeronautical History [Internet publication], paper no. 6, pages 130–181.  Cayley's tension-spoke wheel appears on page 152, \"3.7  The Tension  Wheel, 1808\". "]}, {"page": "List of mechanical engineers", "response": ["* George Cayley (1773–1857) – aerodynamics pioneer and founding member of the British Association for the Advancement of Science"]}, {"page": "Robert Stirling", "response": ["Amonton was followed in 1807 by George Cayley whose engine was of those in which the fire is enclosed, and fed by air pumped in beneath the grate in sufficient quantity to maintain combustion, while by far the largest portion of the air enters above the fire, to be heated and expanded; the whole, together with the products of combustion, then acts on the piston, and passes through the working cylinder; and the operation being one of simple mixture only, no heating surface of metal is required, the air to be heated being brought into immediate contact with the fire."]}, {"page": "Regent Street", "response": ["The University of Westminster's main campus at No. 309 Regent Street was founded in 1838 under George Cayley and rebuilt under Quintin Hogg in 1911. It is one of the oldest educational institutions in Central London. Historically, the university was once also titled as the Royal Polytechnic Institution (after a royal charter had been formally received in August 1839 and Prince Albert became a patron to the institution). It has also been called \"The Polytechnic at Regent Street\" and the Polytechnic of Central London (PCL). The university houses the Regent Street Cinema which acted as a platform for major scientists, artists and authors such as Charles Dickens, John Henry Pepper, and The Lumière Brothers (Auguste and Louis Lumière) where public and private screenings of Cinématographe were shown to an audience. The cinema was restored and reopened to the public in May 2015."]}, {"page": "Arthur Cayley", "response": ["Arthur Cayley was born in Richmond, London, England, on 16 August 1821. His father, Henry Cayley, was a distant cousin of Sir George Cayley, the aeronautics engineer innovator, and descended from an ancient Yorkshire family. He settled in Saint Petersburg, Russia, as a merchant. His mother was Maria Antonia Doughty, daughter of William Doughty. According to some writers she was Russian, but her father's name indicates an English origin. His brother was the linguist Charles Bagot Cayley. Arthur spent his first eight years in Saint Petersburg. In 1829 his parents were settled permanently at Blackheath, near London. Arthur was sent to a private school. At age 14 he was sent to King's College School. The school's master observed indications of mathematical genius and advised the father to educate his son not for his own business, as he had intended, but at the University of Cambridge."]}, {"page": "Otto Lilienthal", "response": ["* George Cayley"]}, {"page": "1773 in science", "response": ["* December 27 – George Cayley, English pioneer of heavier-than-air flight (died 1857)"]}, {"page": "1857 in science", "response": ["* December 15 – George Cayley (born 1773), English aviation pioneer."]}, {"page": "John Joseph Montgomery", "response": ["In the 1880s Montgomery, a native of Yuba City, California made manned flight experiments in a series of gliders in the United States in Otay Mesa near San Diego, California.The Montgomery Evergreen Smithsonian National Air and Space MuseumBerriman, Algernon E. Aviation. An Introduction to the Elements of Flight, Methuen & Co., London, 1912. pp. 213-214.\"Montgomery's Gliding Experiments\", in Hayward, Charles B. Practical Aeronautics: An Understandable Presentation of Interesting and Essential Facts in Aeronautical Science.' Chicago: American School of Correspondence, 1912. Although not publicized in the 1880s, these early flights were first described by Montgomery as part of a lecture delivered at the International Conference on Aerial Navigation at Chicago, 1893.Zahm, Albert F. (1923) \"Catholic Contributions in the Field of Aeronautics\" in Benson, William Shepherd, James J. Walsh, Edward J. Hanna, and Constantine E. McGuire. Catholic Builders of the Nation: A Symposium on the Catholic Contribution to the Civilization of the United States. Boston: Continental Press. These independent advances came after gliding flights by European pioneers such as George Cayley's coachman in England (1853) and Jean-Marie Le Bris in France (1856).The Journal of San Diego History, July 1968, Vol. 14, No. 3. Although Montgomery never claimed firsts, his gliding experiments of the 1880s are considered by some historians and organizations to have been the first controlled flights of a heavier-than-air flying machine in AmericaNational Cyclopedia of American Biography: Being the History of the United States as Illustrated in the Lives of the Founders, Builders, & Defenders of the Republic, etc..., Edited by Distinguished Biographers, James T. White & Co. Volume XVI, 1916.Mark D. Ardema and Joseph Mach, Santa Clara University School of Engineering, and William J. Adams, Jr., \"John Joseph Montgomery, 1883 Glider: An International Historic Mechanical Engineering Landmark, Designated by the American Society of Mechanical Engineers, May 11, 1996, at Hiller Aircraft Museum and Santa Clara University\" (brochure, 11 pp.) or in the Western Hemisphere,\"Montgomery First to Conquer the Air: Austrian Officials after Inquiry Give Palm to California Inventor,\" San Francisco Examiner, May 16, 1909. See also \"Conquering the Air,\" San Francisco Monitor, June 12, 1909.Jacobs, James W. \"John Joseph Montgomery.\" In James W. Jacobs, Enshrinee Album: The First Twenty-One Years, 13435. Dayton, Ohio: National Aviation Hall of Fame, 1984.L'Écho Des Ailes: Revue Indépendante pour la Défense des Intérêts Aéronautiques, Vol. 17, No. 2, January 23, 1948. By Fédération des Clubs Belges d'Aviation de Tourisme, Brussels, Belgium.\"Flug-Revue\" (\"Flight Review\"), 1968, Vereinigte Motor-Verlage, p. 155.Hearings, Reports and Prints of the House Committee on Science and Astronautics, United States Congress. House Committee on Science and Astronautics, U.S. Govt. Printing Office, Washington D.C., 1972.Histoire de l'Aéronautique et de l'Espace, 2001.Davy, Maurice J.B. (1935) Aeronautics, Science Museum. depending on the source."]}, {"page": "Rubber band", "response": ["One of the first to use this method was pioneer aerodynamicist George Cayley, who used rubber band-driven motors for powering his small experimental models. These 'rubber motors' have also been used for powering small model boats."]}, {"page": "William Nicholson (chemist)", "response": ["In 1797 he founded, published, and wrote part of the Journal of Natural Philosophy, Chemistry and the Arts, generally known as Nicholson's Journal, the earliest monthly scientific work of its kind in Great Britain. The journal published the first known aerodynamic analysis of gliders and heavier-than-air fixed-wing flying machines designs, by George Cayley in 1809–1810.Cayley, George. \"On Aerial Navigation\" Part 1 , Part 2 , Part 3  Nicholson's Journal of Natural Philosophy, 1809–1810. (Via NASA). The publication continued until 1814."]}, {"page": "Triplane", "response": ["The first heavier-than-air machine to carry a human on a free, untethered flight was a triplane glider constructed by George Cayley and flown in 1848. It was modern in form, having three stacked wings above the fuselage and a separate stabilising tail with both fin and tailplane. The wings were of typical Cayley kite-like planform having a low aspect ratio. The craft was not large enough to carry an adult so a local boy was chosen as the passenger, but his name is not known.Wragg, D.; Flight before flying, Osprey, 1974, Page 60"]}, {"page": "Timeline of aviation – 18th century", "response": ["**Englishman Sir George Cayley (1773–1857) sketches a glider with a rudder unit and an elevator unit. His manuscript is considered to be the starting point of the scientific research on heavier than air flying machines. It is Cayley who helps to sort out the confusion of the time. ...\"He knew more than any of his predecessors ... and successors up to the end of the 19th century.\" – Orville Wright. Even so, his ideas do not affect further development very much."]}, {"page": "Timeline of aviation – 19th century", "response": ["** Sir George Cayley builds a model glider with a main wing and separate, adjustable vertical and horizontal tail surfaces.Gibbs-Smith 2003, p. 35.", "** September – Sir George Cayley publishes the first part of his seminal paper On Aerial Navigation, setting out for the first time the scientific principles of heavier-than-air flight.", "** Sir George Cayley launches a 10-year-old boy in a small glider being towed by a team of people running down a hill. This is the first known flight by a person in a heavier-than-air machine.Lewis 1962, p.178.", "** Late June or early July – Sir George Cayley's coachman successfully flies a glider, designed by his employer, some proportion of the distance across Brompton Dale in Yorkshire, becoming the world's first adult aeroplane pilot.Lewis 1962, p. 178. Unimpressed with this honour, the coachman promptly resigns his employment."]}, {"page": "Paper plane", "response": ["For over a thousand years after this, paper aircraft were the dominant man-made heavier-than-air craft whose principles could be readily appreciated, though thanks to their high drag coefficients, not of an exceptional performance when gliding over long distances. The pioneers of powered flight have all studied paper model aircraft in order to design larger machines. Leonardo wrote of the building of a model plane out of parchment, and of testing some of his early ornithopter, an aircraft that flies by flapping wings, and parachute designs using paper models. Thereafter, Sir George Cayley explored the performance of paper gliders in the late 19th century. Other pioneers, such as Clément Ader, Prof. Charles Langley, and Alberto Santos-Dumont often tested ideas with paper as well as balsa models to confirm (in scale) their theories before putting them into practice."]}, {"page": "Airplane", "response": ["The Wright brothers invented and flew the first airplane in 1903, recognized as \"the first sustained and controlled heavier-than-air powered flight\".FAI News: 100 Years Ago, the Dream of Icarus Became Reality  posted 17 December 2003. Retrieved: 5 January 2007. They built on the works of George Cayley dating from 1799, when he set forth the concept of the modern airplane (and later built and flew models and successful passenger-carrying gliders).\"Cayley, Sir George: Encyclopædia Britannica 2007.\" Encyclopædia Britannica Online, 25 August 2007. Between 1867 and 1896, the German pioneer of human aviation Otto Lilienthal also studied heavier-than-air flight. Following its limited use in World War I, aircraft technology continued to develop. Airplanes had a presence in all the major battles of World War II. The first jet aircraft was the German Heinkel He 178 in 1939. The first jet airliner, the de Havilland Comet, was introduced in 1952. The Boeing 707, the first widely successful commercial jet, was in commercial service for more than 50 years, from 1958 to at least 2013.", "In 1799, George Cayley set forth the concept of the modern airplane as a fixed-wing flying machine with separate systems for lift, propulsion, and control. Cayley was building and flying models of fixed-wing aircraft as early as 1803, and he built a successful passenger-carrying glider in 1853. In 1856, Frenchman Jean-Marie Le Bris made the first powered flight, by having his glider \"L'Albatros artificiel\" pulled by a horse on a beach. Then the Russian Alexander F. Mozhaisky also made some innovative designs. In 1883, the American John J. Montgomery made a controlled flight in a glider.The Journal of San Diego History, July 1968, Vol. 14, No. 3 Other aviators who made similar flights at that time were Otto Lilienthal, Percy Pilcher, and Octave Chanute."]}, {"page": "Hot air engine", "response": ["A hot air engine (historically called an air engine or caloric engine) is any heat engine that uses the expansion and contraction of air under the influence of a temperature change to convert thermal energy into mechanical work.  These engines may be based on a number of thermodynamic cycles encompassing both open cycle devices such as those of Sir George Cayley and John Ericsson and the closed cycle engine of Robert Stirling. Hot air engines are distinct from the better known internal combustion based engine and steam engine.", "*  For an account of Amontons' fire-powered wheel in English, see:  Robert Stuart, Historical and Descriptive Anecdotes of Steam-engines and of Their Inventors and Improvers (London, England:  Wightman and Cramp, 1829), vol. 1, pages 130-132 ; an illustration of the machine appears on page 351. around the time when the laws of gasses were first set out, and early patents include those of Henry Wood, Vicar of High Ercall near Coalbrookdale Shropshire (English patent 739 of 1759) and  Thomas Mead, an engineer from Sculcoats Yorkshire (English patent 979 of 1791), the latter in particular containing the essential elements of a displacer type engine (Mead termed it the transferrer). It is unlikely that either of these patents resulted in an actual engine and the earliest workable example was probably the open cycle furnace gas engine of the English inventor Sir George Cayley Detailed contents of the book Hot air caloric and stirling engines. Vol.1, A history"]}]}}