{"wiki_id": "http://www.wikidata.org/entity/Q3196460", "itemLabel": "Kieran Prendergast", "itemDescription": "British diplomat (born 1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kieran_Prendergast", "wikipedia_page": {"main": "Sir Walter Kieran Prendergast  (born 2 July 1942) is a British retired diplomat who was Under-Secretary-General for Political Affairs at the United Nations.\nPrendergast was born in Campbeltown, Scotland, and received his education at St Patrick's College, Strathfield in Sydney, Australia. He later went to England and attended Salesian College in Chertsey and then St Edmund Hall, Oxford.After graduation, Prendergast was a Turkish language student with the FCO in Istanbul 1964-65, after which he joined the British Embassy in Ankara, Turkey for two years, until 1967, when he was posted to the NATO Department at the British Foreign Office. He later worked with the foreign service in Nicosia, Cyprus, and The Hague. In 1976, he returned to London as Assistant Private Secretary to Anthony Crosland and David Owen, Secretaries of State for Foreign and Commonwealth Affairs. From 1979 to 1982, Prendergast worked in New York with Anthony Parsons as part of the United Kingdom Mission to the United Nations. In 1982, he was appointed Head of Chancery and Consul-General in Tel Aviv, Israel and worked there for four years, later serving as High Commissioner to Zimbabwe and Kenya, before returning to Ankara, this time as Ambassador to Turkey.In March 1997, United Nations Secretary General Kofi Annan appointed Prendergast Under-Secretary-General for Political Affairs at the United Nations and Prendergast served in that position until July 2005. He helped call attention to human rights violations and \"ethnic cleansing\" resulting from the War in Darfur, and was deeply involved in Cyprus reunification negotiations in 2004, following the Cypriot Annan Plan referendum. He was determined that a solution could be found to problems in Somalia. When he retired in 2005, following pressure from the Bush administration for the removal of key UN Secretariat officials who had opposed the Iraq war and the many subsequent errors of  policy, Kofi Annan thanked him for his \"outstanding service\" and \"invaluable advice.\" He was succeeded by Ibrahim Gambari.\nSince his retirement from the United Nations, Prendergast has conducted research at the Belfer Center for Science and International Affairs and is a member of the Advisory Council of Independent Diplomat. He speaks both French and Turkish fluently, and is married with four children.\nPrendergast is Chairman of the Anglo-Turkish Society, a Trustee of the Beit Trust, and Senior Adviser at the Geneva-based Centre for Humanitarian Dialogue, as well as being Counsellor at Melbourne-based Dragoman Global. He is also on the Advisory Board of Albany Associates, providing comprehensive communication strategies and solutions in challenging and transitional environments. Prendergast is the president of The British Association of Former United Nations Civil Servants.", "link_mentions": [{"page": "Campbeltown", "response": ["*Kieran Prendergast, diplomat and a former Under-Secretary-General for Political Affairs at the United Nations"]}, {"page": "Ciarán", "response": ["* Sir Kieran Prendergast (born 1942), English diplomat and former United Nations officer"]}, {"page": "Prendergast (surname)", "response": ["* Kieran Prendergast (born 1942), British diplomat and former Under-Secretary-General for Political Affairs at the United Nations"]}, {"page": "United Nations Department of Political and Peacebuilding Affairs", "response": ["|Kieran Prendergast"]}, {"page": "List of ambassadors of the United Kingdom to Turkey", "response": ["*1995–1997: Sir Kieran Prendergast"]}, {"page": "Independent Diplomat", "response": ["In 2009, Independent Diplomat’s staff included Carne Ross (Executive Director) and Thomas J. Miller (head of its Washington office). Its Advisory Council included Alyson Bailes, Edward Mortimer, Eva Nowotny, and Sir Kieran Prendergast. Former members include Ian Martin and Danilo Türk. Its board of directors includes Parag Khanna, Victor Navasky, and David Rieff. It was funded for approximately $1.8 million per year by foundation and government donations, as well as fees from their clients. Poorer organisations charged nominal fees only."]}, {"page": "Sir Kieran Prendergast", "response": ["#REDIRECT Kieran Prendergast"]}, {"page": "List of Beefsteak Club (London) members", "response": ["*Sir Kieran Prendergast, KCVO, CMG (1942)"]}, {"page": "List of High Commissioners of the United Kingdom to Kenya", "response": ["*1992–1995: Sir Kieran Prendergast"]}, {"page": "London International Model United Nations", "response": ["*Kieran Prendergast, former UN Under-Secretary-General for Political Affairs."]}, {"page": "List of Knights and Dames Commander of the Royal Victorian Order appointed by Elizabeth II (1978–2002)", "response": ["|Walter Kieran Prendergast, CMG"]}, {"page": "List of Old Boys of St Patrick's College, Strathfield", "response": ["* Kieran Prendergast former British diplomat (High Commissioner to Zimbabwe, Kenya, Ambassador to Turkey) and UN Under-Secretary-General 1997-2005"]}, {"page": "1991 Special Honours", "response": ["*Walter Kieran Prendergast, C.M.G."]}]}}