{"wiki_id": "http://www.wikidata.org/entity/Q3195663", "itemLabel": "Kevin Bowyer", "itemDescription": "English organist", "wikipedia_url": "https://en.wikipedia.org/wiki/Kevin_Bowyer", "wikipedia_page": {"main": "Kevin John Bowyer (; born 9 January 1961) is an English organist, known for his prolific recording and recital career and his performances of modern and extremely difficult compositions.", "link_mentions": [{"page": "St Mary Redcliffe", "response": ["Kevin Bowyer recorded Kaikhosru Sorabji's First Organ Symphony on it in 1988, for which the organ was an \"ideal choice\"; the notes to the recording describe the church as \"acoustically ideal, with a reverberation period of 3½ seconds\", and notes that the organ has \"a luxuriousness of tone\" and \"a range of volume from practically inaudible to fiendishly loud\". William McVicker, organist at the Royal Festival Hall, has called the organ \"the finest high-Romantic organ ever constructed\"."]}, {"page": "Southend-on-Sea", "response": ["* Kevin Bowyer, concert organist"]}, {"page": "The Art of Fugue", "response": ["* Kevin Bowyer (2001) on the Marcussen organ of Saint Hans Church, Odense, Denmark"]}, {"page": "Priory Records", "response": ["The collection of CDs \"Great European Organs\" is dedicated to the discovery of European organs with the participation of the following organists: Kevin Bowyer, Daniel Roth, Nicolas Kynaston, Graham Barber, David Briggs, John Scott, Gerard Brooks, Jane Watts, Roger Sayer, Colin Walsh, Christopher Herrick, Stephen Farr, John Scott Whiteley, Stephen Cleobury, Stefan Engels, Daniel Cook, Marco Lo Muscio, Nicholas Jackson, Naji Hakim, Dame Gillian Weir, etc."]}, {"page": "Julius Reubke", "response": ["*Michael Gailit: Julius Reubke (1834-1858), notes to Kevin Bowyer's recording of The 94th Psalm, Nimbus Records, NI 5361 (1993)"]}, {"page": "Kaikhosru Shapurji Sorabji", "response": ["In recent times, this divided reception has persisted to an extent. While some compare Sorabji to composers such as Bach, Beethoven, Chopin and Messiaen,\"John Ogdon, pianist\". The Sorabji Archive. Retrieved 22 November 2012.Anon. (27 February 2012). \"New Music New College Crossroads 4: The Meeting of the Minds Festival, March 2 & 3\" . AnythingArts.com. Retrieved 22 November 2012.Ingram, Paul (31 December 2008). \"Feature Concert Review – Sorabji's Sequentia cyclica sopra Dies irae ex Missa pro defunctis/Jonathan Powell\". The Classical Source. Retrieved 22 November 2012. others dismiss him altogether.Page, Tim (8 January 2003). Classical Music Forum with Post music critic Tim Page. Interview with Anons. The Washington Post. Retrieved 22 November 2012.Clements, Andrew (18 September 2003). \"Jonathan Powell, Purcell Room, London\". The Guardian. Retrieved 22 November 2012. The pianist and composer Jonathan Powell writes of Sorabji's \"unusual ability to combine the disparate and create surprising coherence\".Powell (2003b), p. [9] Abrahams finds that Sorabji's musical production exhibits enormous \"variety and imagination\" and calls him \"one of the few composers of the time to be able to develop a unique personal style and employ it freely at any scale he chose\".Abrahams, pp. 225, 227 The organist Kevin Bowyer counts Sorabji's organ works, together with those of Messiaen, among the \"Twentieth-Century Works of Genius\".Bowyer, Kevin John; Kleber, Wolfgang (tr.) (2003; in German). \"Sorabji's Organ Symphony No. 1 (9/9)\". The Sorabji Archive. Retrieved 22 November 2012. Others have expressed more negative sentiments. The music critic Andrew Clements calls Sorabji \"just another 20th-century English eccentric ... whose talent never matched [his] musical ambition\".Clements, Andrew (18 July 2011). \"Prom 4: Gothic Symphony – review\". The Guardian. Retrieved 22 November 2012. The pianist John Bell Young described Sorabji's music as \"glib repertoire\" for \"glib\" performers.Anon. (2016), p. 14 The musicologist and critic Max Harrison, in his review of Rapoport's book Sorabji: A Critical Celebration, wrote unfavourably about Sorabji's compositions, piano playing, writings and personal conduct and implied that \"nobody cared except a few close friends\".Harrison (1994a), pp. 61–62 Another assessment was offered by the music critic Peter J. Rabinowitz, who, reviewing the 2015 reissue of Habermann's early Sorabji recordings, wrote that they \"may provide a clue about why—even with the advocacy of some of the most ferociously talented pianists of the age—Sorabji's music has remained arcane\". While saying that \"it's hard not to be captivated, even hypnotized, by the sheer luxury of [his] nocturnes\" and praising the \"angular, dramatic, electrically crackling gestures\" of some of his works, he claims that their tendency to \"ostentatiously avoid the traditional Western rhetoric ... that marks out beginning, middle, and end or that sets up strong patterns of expectation and resolution\" makes them hard to approach.Rabinowitz, p. 101"]}, {"page": "Passacaglia and Fugue in C minor, BWV 582", "response": ["* Kevin Bowyer, Marcussen organ Saint Hans Church, Odense, Nimbus (1998)"]}, {"page": "Peter Hurford", "response": ["Hurford was appointed organist of Holy Trinity Church, Leamington Spa from 1956 to 1957. For the same period, he was Music Master at Bablake School, Coventry, and Musical Director of the Royal Leamington Spa Bach Choir. He was then appointed organist and choirmaster of St Albans Cathedral in 1958, serving in this post for twenty years. He conceived the idea of an organ competition in 1963, partly to celebrate the new Harrison & Harrison organ designed by Ralph Downes and himself. This venture was successful mainly because of the young Hurford's rapidly growing stature in Britain and overseas as a result of his refreshing notions of the \"authentic performance style\". This has grown into the biennial St Albans International Organ Festival, a world-renowned festival of organ music with competitions whose past winners include many of the great names in modern organ music including Dame Gillian Weir, David Sanger, Thomas Trotter and Kevin Bowyer."]}, {"page": "Eight Short Preludes and Fugues", "response": ["* Kevin Bowyer, Skt. Hans Kirke, Odense, 1991, Nimbus Records."]}, {"page": "St Albans International Organ Festival", "response": ["*1983\tKevin Bowyer, UK"]}, {"page": "Collegiate Church of St Mary, Warwick", "response": ["*Kevin Bowyer 1989"]}, {"page": "List of organists", "response": ["* Kevin Bowyer (born 1961)"]}, {"page": "Altarus Records", "response": ["* Kevin Bowyer, organ"]}, {"page": "Bowyer (surname)", "response": ["* Kevin Bowyer, English organist"]}, {"page": "Pedal piano", "response": ["Louis Schone made a pedalflügel for Robert Schumann in 1843, when he was in Dresden. Schumann preferred an upright pedal piano, and his pedal keyboard had 29 notes and was connected with an action placed at the back of the piano where a special soundboard, covered with 29 strings, was built into the case. Schumann wrote much music for the pedal piano and was so enthusiastic about the instrument that he convinced Felix Mendelssohn, who owned a grand pedal piano, to form a class devoted to it in the Leipzig Conservatory. Charles-Valentin Alkan owned an Erard pedal piano made in 1853 and now in the Musée de la Musique, the historic instrument collection of the Conservatoire de Paris. Alkan composed a number of works for it, in the virtuoso style to be found in his other piano music. Kevin Bowyer has revived some of this music in recent years, though he plays it on the organ."]}, {"page": "Ernest Austin", "response": ["One of his best-known works is The Pilgrim's Progress, a 12-section narrative tone poem setting for a solo organ of the work by John Bunyan; it takes about 2¾ hours to perform. There is a text which explains what is happening at each stage of the music which can be read by a narrator, and in the 12th movement, there are optional parts for choir (SSATTB), bells, and a solo violin.Kevin Bowyer: 20th Century European Organ Music: A Toast, in The IAO Millennium Book, ed. P. Hale,  It was revived in November 1988 at St. Michael's, Cornhill, London, by organist Kevin Bowyer, who continues to perform it on occasion.Kevin Bowyer's performance  of 'The Pilgrim's Progress' in Glasgow, 16 June 2007Glasgow International Organ Festival : he performed the complete Pilgrim's Progress at the 2007 festival"]}, {"page": "Dennis Báthory-Kitsz", "response": ["We Will, We Will Nonpop You by Kyle Gann, Village Voice, September 11, 2001 and the performance of contemporary classical music (new music) in preference to the music of composers of past eras. He offers his compositions to be downloaded and played for free, but does not release them into the public domain and takes royalties for public performance as usual. His organ work Yer Attention, Please has been performed by Kevin Bowyer. His Dashuki Music Theatre has performed at Charlotte Moorman's Annual Avant Garde Festival of New York."]}, {"page": "Sonata on the 94th Psalm", "response": ["The 94th Psalm sonata is in the repertoire of most concert organists, and has been recorded by many well-known players such as E. Power Biggs, Catherine Crozier, Michael Schönheit, Simon Preston, Alan Morrison, Virgil Fox, Christopher Herrick, Gillian Weir, Jeremy Filsell, Daniel Roth, Kevin Bowyer, David Briggs and Jean Guillou.  There is also a variation of the piece compiled and performed by Timothy Howard as part of his organ soundtrack score for the 1922 film, \"Nosferatu.\"", "*Michael Gailit: Julius Reubke (1834-1858), notes to Kevin Bowyer's recording of The 94th Psalm, Nimbus Records, NI 5361 (1993)"]}, {"page": "Christopher Bowers-Broadbent", "response": ["He was a chorister in the Choir of King's College, Cambridge, and went on to study organ and composition at the Royal Academy of Music, where he was taught by Arnold Richardson and Richard Rodney Bennett. His made his debut at the Camden Festival in 1966; his first major recitals were at the St Albans International Organ Festival in 1969 and the Royal Festival Hall in 1971. His first appearance as a soloist was at the Proms in 1972. He was a Fellow and Professor of Organ at the Royal Academy of Music from 1973 to 1992, where his students included Kevin Bowyer.", "*1996 Duets and canons - a sequence of short pieces (recorded by Kevin Bowyer)"]}, {"page": "Saint Hans Church", "response": ["The church has a three manual Marcussen organ used by Kevin Bowyer to record the complete organ works of Bach for Nimbus Records."]}, {"page": "Peter McGarr", "response": ["Tempest Flute Trio, Kevin Bowyer, Ruth Morley, Sarah Brooke, Emily Andrews, Sarah Field, Brodsky Quartet, Tubalate, Black Dyke Band."]}, {"page": "University of Glasgow Memorial Chapel", "response": ["The Chapel's organ was constructed by Henry Willis & Sons in 1927 and refurbished by Harrison & Harrison in 2005. It was a gift to the University from Joseph Paton Maclay, Lord Maclay, in memory of two of his sons, who had died in the war. The Organist is Kevin Bowyer, an acclaimed performer and prolific recorder, who is Artistic Director of the Glasgow International Organ Festival, which is held in the Chapel and has been running annually since June 2006."]}, {"page": "List of people associated with the Royal Academy of Music", "response": ["* Kevin Bowyer (organist)"]}, {"page": "The Art of Fugue discography", "response": ["| Kevin Bowyer || 2001 || || organ (on the Marcussen organ of Saint Hans Church, Odense, Denmark)"]}, {"page": "Your Feet's Too Big", "response": ["* Kevin Bowyer"]}, {"page": "Marco Lo Muscio", "response": ["Since 2004, he has been the art director of the International Organ Summer Festival in Rome,http://www.organfestivals.org/festivals.php Italy, where internationally acclaimed organists and musicians performed such as Jean Guillou, Thomas Trotter, Stephen Tharp, Roger Sayer, Roger Fisher, Martin Baker, Pauli Pietiläinen, Aivars Kalējs, John Hackett, Pär Lindh, Jakob Lorentzen, Kevin Bowyer, David Briggs, Christopher Herrick, David Jackson, John Scott, Colin Walsh, Carson Cooman, Andrew Nethsingha, Martin Setchell, Alessandro Bianchi, Jean-Paul Imbert, Gail Archer.", "Vatican Radio, TV2000, RAI 3, and performed worldwide from renowned musicians such as Kevin Bowyer, Thomas Trotter, Roger Sayer, Carol Anne Williams, John Hackett, Christopher Herrick, Stephen Farr, David Briggs, John Scott, Patrick Ayrton, Andrea Padova, Chris Jarrett, Stephen Tharp.", "* “The Organ Works of Marco Lo Muscio - Kevin Bowyer plays the Willis Organ of Glasgow University Memorial Chapel” (2017) ", "*Appears On \"Organ Party Vol.III\" - Kevin Bowyer (2017) \"In Memoriam of Messiaen\" "]}, {"page": "Sonata in G major for two flutes and basso continuo, BWV 1039", "response": ["* Kevin Bowyer (organ), four movements, Vol. 8, Complete Organ Works of J. S. Bach, Nimbus Records"]}, {"page": "Jeremy Nicholas (writer)", "response": ["He has composed the scores for many stage plays – among them the British premiere of Tennessee Williams’s Vieux Carré, and Sarah B. Divine, a musical about Sarah Bernhardt. His songs are published by Novello in two albums, Sarah’s EncoresPlace Settings – Jeremy Nicholas, Wise Music Classical website and Funny You Should Sing ThatFunny You Should Sing That – Jeremy Nicholas, Wise Music Classical website and which have been recorded by Sarah Walker and Roger Vignoles, and Jody Appelbaum and Marc-André Hamelin. His instrumental works include Quiet Peace No. 1 which was recorded by duo-pianists Nettle & Markham); Blaythorne SuiteBlaythorne Suite, Just Music – Brass Band website and Lendalfoot for brass band were recorded by the Grimethorpe Colliery Band; Toccata giubiloso (recorded by organist Kevin Bowyer) and Toccata festiva were premiered by Thomas Trotter in Birmingham Town Hall in March 2013.Six of the best pipe organs in the world, BBC Music Magazine, 15 October 2020", "*Toccata Giubiloso. Kevin Bowyer, organ. (NPC007, Alto ALC1187, Forum 8103)"]}, {"page": "Alistair Hinton", "response": ["Among those who have performed and recorded Hinton's works are Donna Amato, Jonathan Powell, Yonty Solomon and Kevin Bowyer. Information on his works, together with a listing and discography, may be found at http://www.sorabji-archive.co.uk/hinton/scores.php. "]}, {"page": "Thierry Pallesco", "response": ["Pallesco uses a personal musical language, often atonal (“Christ a vaincu la mort”, the first 3 “Caprices poétiques”,…), sometimes bitonal (\"Harmonies en Paradis\") or even modal (the \"Fugue\" of the \"Toccata et Fugue en Ut#\"). His music, though it is very original, is also certainly inspired by the compositions of the three great \"D\" of the French contemporary organ music: Marcel Dupré, Maurice Duruflé and Jeanne Demessieux. Many pieces require a great virtuosity (the \"Toccata en Ut#\" is the best example). Among the most played works include: “Le salut messianique”, \"Christ a vaincu la mort\", “Rhapsodie”, and the very dreaded \"Toccata et fugue en Ut#\" (only recorded by Kevin Bowyer to date).", "*\"The Organ Works of Thierry Pallesco\" (Priory records, UK, 2014): 13 organ pieces by Kevin Bowyer (organ of Glasgow Cathedral)."]}, {"page": "Francesca Massey", "response": ["At the age of 19, Massey gained all of the top prizes in the Fellowship of the Royal College of Organists’ diploma and was subsequently awarded the WT Best Memorial Scholarship and Silver Medal of the Worshipful Company of Musicians, and the Musicians Benevolent Fund’s Ian Fleming Award. Her many teachers and mentors included Jeremy Filsell, Kevin Bowyer, David Goode, Darius Battiwalla and Andrew Fletcher, and she also participated in masterclasses with many other well known Concert Organists including Dame Gillian Weir, Harald Vogel, David Briggs, Peter Hurford and Naji Hakim. She was the repetiteur for the Windsor and Eton Choral Society under Ralph Allwood, and the Birmingham Bach Choir under Paul Spicer, and also taught for Cambridge University Faculty of Music as a Supervisor in Keyboard Skills, Harmony, Counterpoint, Fugue and Tonal Composition."]}, {"page": "Janet Owen Thomas", "response": ["Her music was commissioned and performed by ensembles including the Goldberg Ensemble, the Allegri String Quartet, the Bingham String Quartet, Gemini, Lontano, and Boccherini String Trio, the soprano Mary Wiegold and organist Kevin Bowyer. "]}]}}