{"wiki_id": "http://www.wikidata.org/entity/Q320827", "itemLabel": "I. E. S. Edwards", "itemDescription": "British egyptologist", "wikipedia_url": "https://en.wikipedia.org/wiki/I._E._S._Edwards", "wikipedia_page": {"main": "Iorwerth Eiddon Stephen Edwards,  (21 July 1909 – 24 September 1996) — known as I. E. S. Edwards— was an English Egyptologist and curator, considered to be a leading expert on the pyramids.\n\n", "link_mentions": [{"page": "Great Pyramid of Giza", "response": ["I. E. S. Edwards discusses Strabo's mention that the pyramid \"a little way up one side has a stone that may be taken out, which being raised up there is a sloping passage to the foundations\". Edwards suggested that the pyramid was entered by robbers after the end of the Old Kingdom and sealed and then reopened more than once until Strabo's door was added. He adds: \"If this highly speculative surmise be correct, it is also necessary to assume either that the existence of the door was forgotten or that the entrance was again blocked with facing stones\", in order to explain why al-Ma'mun could not find the entrance. Scholars such as Gaston Maspero and Flinders Petrie have noted that evidence for a similar door has been found at the Bent Pyramid of Dashur."]}, {"page": "Trade route", "response": ["Ptolemy II Philadelphus, emperor of Ptolemaic Egypt, may have forged an alliance with the Lihyanites in order to secure the incense route at Dedan, thereby rerouting the incense trade from Dedan to the coast along the Red Sea to Egypt.Kitchen 1994: 46. I. E. S. Edwards connects the Syro-Ephraimite War to the desire of the Israelites and the Aramaeans to control the northern end of the Incense route, which ran up from Southern Arabia and could be tapped by commanding Transjordan.Edwards 1969: 329."]}, {"page": "Semerkhet", "response": ["Today this theory has little support. Egyptologists such as Toby Wilkinson, I. E. S. Edwards, and Winifred Needler deny the 'usurping theory', because Semerkhet's name is mentioned on stone vessel inscriptions along with those of Den, Adjib, and Qa'a. The objects were found in the underground galleries beneath the Pyramid of Djoser at Saqqara. The inscriptions show that king Qa'a, immediate successor of Semerkhet and sponsor of the vessels, accepted Semerkhet as a rightful ancestor and heir to the throne. Furthermore, the Egyptologists point out that nearly every king of First Dynasty had the habit of taking special vessels (so-called 'anniversary vessels') from their predecessor's tomb and then replacing their predecessor's name with their own. Semerkhet not only confiscated Adjib's vessels, in his tomb several artefacts from the necropolis of queen Meritneith and king Den also were found. The lack of any high official's tomb at Saqqara might be explained by the rather short reign of Semerkhet. It seems that the only known official of Semerkhet, Henu-Ka, had survived his king: His name appears on ivory tags from Semerkhet's and Qaa's tomb."]}, {"page": "I.e.s edwards", "response": ["#REDIRECT I. E. S. Edwards"]}, {"page": "I.E.S. EDWARDS", "response": ["#REDIRECT I. E. S. Edwards"]}, {"page": "Ies edwards", "response": ["#REDIRECT I. E. S. Edwards"]}, {"page": "1996 in Wales", "response": ["*24 September - I. E. S. Edwards, Egyptologist, 87"]}, {"page": "I.E.S. Edwards", "response": ["#REDIRECT I. E. S. Edwards"]}, {"page": "I E S Edwards", "response": ["#REDIRECT I. E. S. Edwards "]}, {"page": "IES Edwards", "response": ["#REDIRECT I. E. S. Edwards "]}, {"page": "Kirtland Egyptian papers", "response": ["Egyptologist I. E. S. Edwards stated that the Egyptian Alphabet and Grammar was \"largely a piece of imagination and lacking in any kind of scientific value.\"Letter of I. E. Edwards, Keeper of the Department of Egyptian Antiquities, dated June 9, 1966, as quoted in Charles M. Larson, By His Own Hand Upon Papyrus, rev. ed. (Grand Rapids, Mich.: Institute for Religious Research, 1992), 43.  Hugh Nibley commented that the Grammar was \"of no practical value whatever.\"Nibley, \"Meaning of the Kirtland Egyptian Papers,\" 357."]}]}}