{"wiki_id": "http://www.wikidata.org/entity/Q3208153", "itemLabel": "Alan Mcilwraith", "itemDescription": "Wikipedia hoaxer from Scotland", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Mcilwraith", "wikipedia_page": {"main": "Alan Mcilwraith (born 3 March 1978) is a Scottish former call centre worker from Glasgow who was exposed as a military impostor by a tabloid newspaper after he passed himself off as a much-decorated British Army officer.\nHe convinced a number of charities and media outlets that he was \"Captain Sir Alan Mcilwraith, KBE, DSO, MC\". The National Children's Home charity invited him to the Women of Influence Awards at the Barony Halls. Celebrity magazine No1 carried a picture of him which was captioned \"Lady Shona [McLaughlan] and Sir Alan McIlwraith\", showing him wearing the dress uniform of the Parachute Regiment with medals.", "link_mentions": [{"page": "History of Wikipedia", "response": ["* October 2005: Alan Mcilwraith was exposed as a fake war hero through a Wikipedia page."]}, {"page": "List of impostors", "response": ["* Alan Mcilwraith (b. 1978), a call centre worker from Glasgow who, among other things, claimed that he was a decorated captain in the British Army. Mcilwraith had never served in the military."]}, {"page": "Walter Mitty", "response": ["Individuals who impersonate serving or retired members of the armed forces are known as \"Walts\" in the British Armed Forces, a shortened form of \"Walter Mitty\". In the United Kingdom, it is an offence under the Armed Forces Act 2006 to wear real or replica military decorations  to pretend to be a member of the armed forces. Such an example of this is Alan Mcilwraith, who falsely claimed to be a highly decorated British Army officer."]}, {"page": "Criticism of Wikipedia", "response": ["Attempts to perpetrate hoaxes may not be confined to editing existing Wikipedia articles, but can also include creating new articles. In October 2005, Alan Mcilwraith, a call center worker from Scotland, created a Wikipedia article in which he wrote that he was a highly decorated war hero.  The article was quickly identified as a hoax by other users and deleted."]}, {"page": "Alan McIlwraith", "response": ["#REDIRECT Alan Mcilwraith "]}, {"page": "Reliability of Wikipedia", "response": ["Attempts to perpetrate hoaxes may not be confined to editing Wikipedia articles. In October 2005 Alan Mcilwraith, a former call center worker from Scotland created a Wikipedia article in which he claimed to be a highly decorated war hero. The article was quickly identified by other users as unreliable (see Wikipedia Signpost article April 17, 2006); however, Mcilwraith had also succeeded in convincing a number of charities and media organizations that he was who he claimed to be: \"The 28-year-old, who calls himself Captain Sir Alan McIlwraith, KBE, DSO, MC, has mixed with celebrities for at least one fundraising event. But last night, an Army spokesman said: 'I can confirm he is a fraud. He has never been an officer, soldier or Army cadet."]}, {"page": "Military Pro", "response": ["#REDIRECT Alan Mcilwraith"]}, {"page": "Sir Alan McIlwraith", "response": ["#REDIRECT Alan Mcilwraith"]}, {"page": "Captain Sir Alan Mcilwraith", "response": ["#REDIRECT Alan Mcilwraith"]}, {"page": "Captain Sir Alan", "response": ["#REDIRECT Alan Mcilwraith"]}, {"page": "Captain Alan Mcilwraith", "response": ["#REDIRECT Alan Mcilwraith"]}, {"page": "McIlwraith", "response": ["*Alan Mcilwraith (born 1978), Scottish fraudster"]}]}}