{"wiki_id": "http://www.wikidata.org/entity/Q3219889", "itemLabel": "Lawrence Clarke", "itemDescription": "British hurdler", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_Lawrence_Clarke,_7th_Baronet", "wikipedia_page": {"main": "Sir Charles Lawrence Somerset Clarke, 7th Baronet OLY (born 12 March 1990), commonly known as Lawrence Clarke, is a former professional 110 m hurdler who finished fourth in the London Olympic Games 110 m hurdles final. He is the son of Sir Toby Clarke, 6th Baronet and succeeded to the baronetcy on his father's death in 2019. He served as Captain of the Great Britain Athletics Team at the 2015 European Athletics Indoor Championships and was coached in Bath by Malcolm Arnold. He was coached in Paris by Giscard Samba Koundys for the 2016 Summer Olympics in Rio de Janeiro. He currently works for Citigroup in London.", "link_mentions": [{"page": "List of Old Etonians born in the 20th century", "response": ["*Lawrence Clarke (born 1990), 110m hurdler"]}, {"page": "Charles Clarke (disambiguation)", "response": ["*Sir Lawrence Clarke, 7th Baronet (Charles Lawrence Somerset Clarke, born 1990), English athlete"]}, {"page": "Jacob Rees-Mogg", "response": ["Rees-Mogg is the uncle of both Olympic athlete Lawrence Clarke and fellow Conservative MP Theo Clarke."]}, {"page": "Charles lawrence somerset clarke", "response": ["#REDIRECT Sir Lawrence Clarke, 7th Baronet"]}, {"page": "Charles Lawrence Somerset Clarke", "response": ["#REDIRECT Sir Lawrence Clarke, 7th Baronet"]}, {"page": "William Sharman", "response": ["A wrist injury ruled Sharman out of competition at the start of 2010,Broadbent, Rick (22 January 2010). Injury condemns William Sharman to face series of hurdles before Barcelona. The Times. Retrieved on 27 January 2011. but he returned in time for the national championships and defeated Andrew Turner to lift his first outdoor title.Meagher, Gerard (27 June 2010). Sharman denies Turner fifth national hurdles title. More Than The Games. Retrieved on 27 January 2011. Their fortunes were reversed at the 2010 European Athletics Championships as Sharman was disqualified in the semi-finals while Turner won the competition. The pair duelled again at the Commonwealth Games in New Delhi. A stomach bug affected him during the event but he managed to complete and English podium sweep alongside Turner and Lawrence Clarke, taking home the silver medal – his first at a major international competition."]}, {"page": "Laurence Somerset Clarke", "response": ["#REDIRECT Sir Lawrence Clarke, 7th Baronet"]}, {"page": "Lawrence Somerset Clarke", "response": ["#REDIRECT Sir Lawrence Clarke, 7th Baronet"]}, {"page": "Lawrence Clarke (athlete)", "response": ["#REDIRECT Sir Lawrence Clarke, 7th Baronet"]}]}}