{"wiki_id": "http://www.wikidata.org/entity/Q321720", "itemLabel": "Aylmer Hunter-Weston", "itemDescription": "British Army general (1864-1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Aylmer_Hunter-Weston", "wikipedia_page": {"main": "Lieutenant-General Sir Aylmer Gould Hunter-Weston  (23 September 1864 – 18 March 1940) was a British Army general who served in World War I at Gallipoli and in the very early stages of the Somme Offensive. He was also a Scottish Unionist MP.\nNicknamed \"Hunter-Bunter\", Hunter-Weston has been seen as a classic example of a \"donkey\" general; he was described by his superior Sir Douglas Haig as a \"rank amateur\", and has been referred to by one modern writer as \"one of the Great War's spectacular incompetents\". However, another historian writes that although his poor performance at the battles of Krithia earned his reputation \"as one of the most brutal and incompetent commanders of the First World War\" \"in his later battles (at Gallipoli) he seemed to hit upon a formula for success ...(but) these small achievements were largely forgotten\".", "link_mentions": [{"page": "1940", "response": ["* March 18 – Sir Aylmer Hunter-Weston, British army general (b. 1864)"]}, {"page": "Douglas Haig, 1st Earl Haig", "response": ["Australian historian Les Carlyon wrote that while Haig was slow to adapt to the correct use of artillery in sufficient quantities to support infantry attacks and was generally sceptical that the science of such doctrine had much place in military theory, he was fully supportive of excellent corps and field commanders such as Herbert Plumer, Arthur Currie and John Monash, who seem to best grasp and exercise these concepts, especially later in the war. Carlyon also wrote out that there was a case to answer, for his support of more dubious commanders such as Ian Hamilton, Aylmer Hunter-Weston and Hubert Gough.Carlyon, Les. 2006. The Great War, Pan MacMillan."]}, {"page": "Gallipoli campaign", "response": ["The Helles landing was made by the 29th Division (Major General Aylmer Hunter-Weston). The division landed on five beaches in an arc about the tip of the peninsula, named 'S', 'V', 'W', 'X' and 'Y' Beaches from east to west. On 1 May, the 29th Indian Brigade (including 1/6th Gurkha Rifles) landed, took and secured Sari Bair above the landing beaches and was joined by 1/5th Gurkha Rifles and 2/10th Gurkha Rifles; the Zion Mule Corps landed at Helles on 27 April. At 'Y' Beach, during the first engagement, the First Battle of Krithia, the Allies landed unopposed and advanced inland. There were only a small number of defenders in the village but lacking orders to exploit the position, the 'Y' Beach commander withdrew his force to the beach. It was as close as the Allies ever came to capturing the village as the Ottomans brought up a battalion of the 25th Regiment, checking any further movement."]}, {"page": "29th Division (United Kingdom)", "response": ["The 29th Division, known as the Incomparable Division, was an infantry division of the British Army, formed in early 1915 by combining various Regular Army units that had been acting as garrisons around the British Empire. Under the command of Major-General Aylmer Hunter-Weston, the division fought throughout the Gallipoli Campaign, including the original landing at Cape Helles. From 1916 to the end of the war the division fought on the Western Front in Belgium and France.", "The 29th Division served on the Gallipoli peninsula, a point in the strategic Dardanelles straits between the Black Sea and the Aegean Sea (and thus the Mediterranean). The division was there for the duration of the ill-fated campaign. It made the first landings as part of the Mediterranean Expeditionary Force in April 1915. On the morning of 25 April 1915 the Battle of Gallipoli began when battalions from the division's 86th and 87th Brigades landed at five beaches around Cape Helles at the tip of the peninsula under the command of Major-General Aylmer Hunter-Weston. Three of the landings faced little or no opposition but were not exploited.  The two main landings, at V and W Beaches on either side of the cape, met with fierce Turkish resistance and the landing battalions were decimated.Steel & Hart 1994, p. 80", "* Major-General Aylmer Hunter-Weston (10 March – 24 May 1915)"]}, {"page": "52nd (Lowland) Infantry Division", "response": ["During the First World War, the division first saw action at Gallipoli. The division began landing at the Helles front, on the Gallipoli peninsula, in June 1915 as part of VIII Corps. The 156th Brigade was landed in time to take part in the Battle of Gully Ravine, where it was mauled, under the notorious Lieutenant-General Aylmer Hunter-Weston. Advancing along Fir Tree Spur, to the right of the ravine, the brigade had little artillery support and no experience of the Gallipoli battlefield. The brigade suffered heavy casualties."]}, {"page": "First Battle of Krithia", "response": ["On the morning of 25 April 1915, the 29th Division (Major General Aylmer Hunter-Weston), landed on five beaches around Cape Helles at the southern tip of the Gallipoli peninsula in the Ottoman Empire. The main landings at 'V' and 'W' Beaches were hotly contested and the British suffered heavy casualties. A supporting landing made at 'Y' Beach on the Aegean coast to the north was made without opposition but the troops were without instructions and made no attempt to either advance or dig in. The first-day objectives of the village of Krithia and the nearby hill of Achi Baba were virtually undefended. The British forfeited an opportunity for an early success when they were forced retreat from 'Y' Beach when the Ottoman reinforcements arrived."]}, {"page": "Second Battle of Krithia", "response": ["Other British reinforcements included brigades from the Royal Naval Division and the 125th Brigade from the British 42nd (East Lancashire) Division. The 87th and 88th Brigades of the 29th Division would once again be at the forefront of the attack. The Anzac brigades and General Herbert Cox's 29th Indian Brigade (Indian Expeditionary Force G) would be in reserve. The commander at Helles, Major General Aylmer Hunter-Weston, was woefully lacking in shells for his artillery and those he did have were shrapnel shells which was ineffective against entrenched positions. The navy were somewhat ambitiously still hoarding shells for the anticipated assault on Constantinople."]}, {"page": "Third Battle of Krithia", "response": ["By late May, the British contingent on the Cape Helles front at Gallipoli had been expanded to three division and a brigade: the 29th Division (which had made the original landing), the Royal Naval Division (now reinforced to 12 battalions), the 42nd (East Lancashire) Division and the 29th Indian Brigade. On 24 May, the commander of the 29th Division, Major General Aylmer Hunter-Weston, was promoted to lieutenant general and given command of the British VIII Corps containing all British units at Helles. Major General Beauvoir De Lisle took over command of the 29th Division."]}, {"page": "Battle of Gully Ravine", "response": ["The third battle of Krithia on 4 June had made some progress in the centre of the line at Helles but had failed on the left flank (west) along Gully Spur and Gully Ravine and on the right flank (east) where the French contingent were confronted by a number of strong Ottoman redoubts on Kereves Spur. As a prelude to a new offensive the commander at Helles, Lieutenant General Aylmer Hunter-Weston ordered separate limited attacks to advance the flanks."]}, {"page": "Battle of Krithia Vineyard", "response": ["The original commander of the British VIII Corps at Helles, Lieutenant General Aylmer Hunter-Weston, had departed the peninsula in July, following the last Helles offensive—the Battle of Gully Ravine.  His replacement, Lieutenant General Francis Davies, arrived in early August but had not yet assumed command of the corps when a series of diversions were due to be launched from Anzac and Helles to divert Ottoman attention from the planned landing at Suvla and the break out from Anzac.  Consequently, the Helles diversion was planned and conducted by the VIII Corps' chief of staff, Brigadier General H.E. Street, who proved himself an able student of Hunter-Weston's battle strategy."]}, {"page": "VIII Corps (United Kingdom)", "response": ["VIII Corps was first formed at Gallipoli during the First World War. The main British battle front was at Cape Helles on the tip of the Gallipoli peninsula. As the battle became protracted, more British divisions arrived as reinforcements. In May 1915, these divisions were arranged as the British Army Corps, which was then redesignated as VIII Corps in June. The corps commander was Lieutenant-General Aylmer Hunter-Weston. When Hunter-Weston relinquished command due to illness, the corps was commanded on a temporary basis by General Francis Davies.", "* 1915–1918 Lieutenant-General Sir Aylmer Hunter-WestonFirst World War Biographies"]}, {"page": "Landing at Cape Helles", "response": ["The Helles landing was mismanaged by the British commander, Major General Aylmer Hunter-Weston. V and W beaches became bloodbaths, despite the meagre defences, while the landings at other sites were not exploited. Although the British managed to gain a foothold ashore, their plans were in disarray. For two months the British fought several costly battles to reach the first day objectives but were defeated by the Ottoman army."]}, {"page": "First day on the Somme", "response": ["The northern flank of the Fourth Army was held by VIII Corps (Lieutenant-General Aylmer Hunter-Weston). Three divisions were to attack on the first day, with the 48th (South Midland) Division in reserve, except for two battalions that held a  stretch between the Third and Fourth armies and two battalions that were attached to the 4th Division."]}, {"page": "Fourth Army (United Kingdom)", "response": ["*VIII Corps, commanded by Lieutenant-General Aylmer Hunter-Weston. (transferred to Reserve Army on 4 July)"]}, {"page": "Battle of Bazentin Ridge", "response": ["During the night of  the Reserve Army (Lieutenant-General Hubert Gough) divisions of X Corps (Lieutenant-General Thomas Morland), either side of the Albert–Bapaume road, continued attacks at Ovillers. The 3rd Worcestershire, 7th Brigade, 25th Division moved up a trench across the road to try to close in from the north-east. From the south-east, the 10th Cheshire (7th Brigade) was repulsed but the 8th Border (75th Brigade) on the left managed a small advance and the 1st Dorset (14th Brigade 32nd Division) also managed to get forward on the west side. To the north-west, battalions of the 96th and 97th brigades of the division, attacked with hand-grenades and took a small amount of ground and the 49th (West Riding) Division, attacked at the Leipzig Salient. At  just before the Fourth Army attacked, the 4th Division and the 48th (South Midland) Division, in VIII Corps (Lieutenant-General Aylmer Hunter-Weston) north of the Ancre, made a smoke-screen and fired a bombardment beyond the 4th Division front, from  as a diversion and succeeded in simulating an attack."]}, {"page": "Hawthorn Ridge Redoubt", "response": ["Hawthorn Ridge Redoubt was a German front-line fortification, west of the village of Beaumont Hamel on the Somme. The redoubt was built after the end of the Battle of Albert (25–29 September 1914), and as French and later British attacks on the Western Front became more formidable, the Germans added fortifications and trench positions near the original lines around Hawthorn Ridge. At  on 1 July 1916, the British fired a huge mine beneath the Hawthorn Ridge Redoubt. Sprung ten minutes before zero hour, it was one of 19 mines detonated on the first day of the Battle of the Somme; the detonation of this mine was filmed by Geoffrey Malins. The attack on the redoubt by part of the 29th Division of VIII Corps (Lieutenant-General Sir Aylmer Hunter-Weston) was a costly failure.", "The 252nd Tunnelling Company placed mine H3 north of First Avenue and Mary, beneath the German stronghold on the ridge. The miners had dug a gallery for about  from the British lines about  underground beneath Hawthorn Ridge Redoubt on the crest of the ridge and charged it with  of Ammonal. The VIII Corps commander, Lieutenant-General Aylmer Hunter-Weston, wanted the mine to be sprung four hours before the offensive began, so that the crater could be captured and consolidated in time for the alarm on the German side to have died down. On 15 June, the Fourth Army headquarters, ruled that all the mines on 1 July should be blown no later than eight minutes before zero; an unsatisfactory compromise was reached with Hunter-Weston to detonate the Hawthorn Redoubt mine ten minutes before zero hour."]}, {"page": "Walter Potter Ritchie", "response": ["Ritchie was presented with his VC by King George V on 25 November 1916 in a ceremony at Buckingham Palace. After the VC investiture, he went to Glasgow for a period of leave but declined to talk to friends about his experiences during the VC action. He later received the French Croix de Guerre, which was presented to him by Lieutenant General Sir Aylmer Hunter-Weston in December 1916."]}, {"page": "List of MPs elected in the 1924 United Kingdom general election", "response": ["|Sir Aylmer Hunter-Weston"]}, {"page": "North Ayrshire and Arran (UK Parliament constituency)", "response": ["The constituency of North Ayrshire was created in 1868 and was much larger than the present constituency, as it also included the towns of Irvine and Kilmarnock. It returned various Liberal, Liberal Unionist and Conservative MP's, the most well known of whom being Sir Aylmer Hunter-Weston, a general in the First World War who served as MP from 1916 to 1935 first for North Ayrshire and then for Bute and Northern Ayrshire which was created in 1918. Another well-known MP was Sir Fitzroy Maclean, a major-general in the Second World War who was rumoured to be one of Ian Fleming's inspirations for James Bond."]}, {"page": "West Kilbride", "response": ["* Lt Gen Sir Aylmer Hunter-Weston, World War I military leader, and MP"]}, {"page": "Bute and Northern Ayrshire (UK Parliament constituency)", "response": ["| Sir Aylmer Hunter-Weston"]}, {"page": "Aylmer Gould Hunter-Weston", "response": ["#REDIRECT Aylmer Hunter-Weston"]}, {"page": "List of MPs elected in the 1931 United Kingdom general election", "response": ["|Sir Aylmer Hunter-Weston "]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|Sir Aylmer Hunter-Weston"]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["|Sir Aylmer Hunter-Weston"]}, {"page": "Weston (surname)", "response": ["* Aylmer Hunter-Weston (1864–1940), British general and politician"]}, {"page": "Battle of Polygon Wood", "response": ["The Second Army altered its corps frontages soon after the attack of 20 September so that each attacking division could be concentrated on a  front. Roads and light railways were built behind the new front line to move artillery and ammunition forward, beginning on 20 September; in fine weather this was finished in four days. As before Menin road, bombardment and counter-battery fire began immediately, with practice barrages fired daily as a minimum. Artillery from the VIII Corps (Lieutenant-General Sir Aylmer Hunter-Weston) and IX Corps (Lieutenant General Alexander Hamilton-Gordon) in the south conducted bombardments to simulate attack preparations on Zandvoorde and Warneton. Haig intended that later operations would capture the rest of the ridge from Broodseinde, giving the Fifth Army scope to advance beyond the ridge north-eastwards and allow the commencement of Operation Hush."]}, {"page": "Clan Hunter", "response": ["thumb|right|250px|Sir Aylmer Hunter-Weston", "Jane Hunter-Weston died in 1911 and was succeeded by her son, Lieutenant General Sir Aylmer Hunter-Weston who served on Kitchener's staff during the Egyptian War of 1896. He also served in the Boer Wars and also as a divisional officer of the British Expeditionary Force in World War I. Also during that war he served during the Gallipoli landings and later commanded the 8th Army on the Western Front."]}, {"page": "11th Security Force Assistance Brigade", "response": ["* Brigadier-General Aylmer Hunter-Weston: 1914–1915"]}, {"page": "List of MPs elected in the 1923 United Kingdom general election", "response": ["| Aylmer Hunter-Weston"]}, {"page": "List of MPs elected in the 1922 United Kingdom general election", "response": ["| Aylmer Hunter-Weston"]}, {"page": "List of United Kingdom by-elections (1900–1918)", "response": ["|Aylmer Hunter-Weston"]}, {"page": "List of military figures by nickname", "response": ["*\"Hunter-Bunter\" – Aylmer Hunter-Weston, British general"]}, {"page": "North Ayrshire (UK Parliament constituency)", "response": ["|  Aylmer Hunter-Weston"]}, {"page": "Operation Hush", "response": ["The German occupation of the Belgian coast in 1914 caused the Admiralty swiftly to advocate their removal. On 26 October 1914 the First Lord, Winston Churchill wrote to Sir John French, commander of the British Expeditionary Force (BEF) \"We must have him off the Belgian coast\". Churchill offered naval fire support for an army operation and French adopted the idea for the main effort of 1915; the army would advance between Dixmude and the sea while the navy provided bombardments and a surprise landing near Zeebrugge. Eventually the plan was cancelled by the British government in favour of the Gallipoli Campaign. In early 1916 the idea of a coastal attack was revived and talks began between Sir Douglas Haig the new BEF commander-in-chief, and Rear Admiral Reginald Bacon, commander of the Dover Patrol. Haig appointed Lieutenant-General Aylmer Hunter-Weston, who had commanded the 29th Division and then VIII Corps at Gallipoli, to work with Bacon on the plan. An offensive from Ypres and the landing operation in support of it, superseded an offensive on the coast. Bacon proposed to land  from six monitors and  in Ostend harbour, with decoys towards Zeebrugge and Middelkirke as a coastal assault began from Nieuport."]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["|Lieutenant-General Sir||Aylmer Hunter-Weston||1864||1940 (fall from turret at home)||Unionist||North Ayrshire (1916–18), Bute and Northern Ayrshire (1918–35)||KCB DSO"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Aylmer Hunter-Weston"]}, {"page": "A. G. Hunter-Weston", "response": ["#REDIRECT Aylmer Hunter-Weston"]}, {"page": "Beaumont-Hamel Newfoundland Memorial", "response": ["The memorial is one of seven identical memorials erected following the First World War. Six were erected in France, Belgium, and at Bowring Park in St. John's, Newfoundland; the seventh was erected in Turkey.Busch p. 151 The sixth memorial was not a national war memorial but rather a gift of Major William Howe Greene who donated it to Bowring Park. The memorial is a bronze caribou, the emblem of the Royal Newfoundland Regiment, standing atop a cairn of Newfoundland granite facing the former foe with head thrown high in defiance. At the Beaumont-Hamel Newfoundland Memorial site the mound rises approximately  from ground level.Nicholson p. 517 The mounds are also surrounded by native Newfoundland plants. At the base of the Beaumont-Hamel Newfoundland Memorial mound, three bronze tablets carry the names of 820 members of the Royal Newfoundland Regiment, the Newfoundland Royal Naval Reserve, and the Mercantile Marines who gave their lives in the First World War and have no known grave. The memorial is situated close to the headquarters dugout of the 88th Brigade, the brigade of which the Newfoundland Regiment was a part. Sixteen memorial designs were submitted to Nangle for review. He recommended that the government accept British sculptor Basil Gotto’s plan to erect five identical caribou statues in memory of the regiment.Nicholson p. 516 Gotto was already well known in Newfoundland as he had been previously commissioned to execute the statue of the Fighting Newfoundlander located in Bowring Park. The landscape architect who designed the sites and supervised their construction, was Rudolph Cochius, a native of the Netherlands living in St. John's. It was decided to plant many of Newfoundland’s native tree species, such as spruce, dogberry and juniper, along the boundaries of the site. In total, over 5,000 trees were transplanted before the project was completed in 1925. The memorial was unveiled at the official opening of the site by Field Marshal Earl Haig on 7 June 1925. Those that participated or were present included Chief of the French General Staff, Marshal of France Marie Émile Fayolle, Newfoundland Colonial Secretary John Bennett, Lieutenant Generals Aylmer Hunter-Weston and Beauvoir De Lisle, Major-General D. E. Cayley and former regimental commanding officers Lieutenant-Colonel Arthur Lovell and Adolph Ernest Bernard."]}, {"page": "List of commanders in the Middle Eastern theatre of World War I", "response": ["| Aylmer Hunter-Weston"]}, {"page": "Order of battle for the Battle of the Somme", "response": ["* VIII Corps. Corps Commander: Lieutenant-General Aylmer Hunter-WestonHart p.132"]}]}}