{"wiki_id": "http://www.wikidata.org/entity/Q3215421", "itemLabel": "Charles Bell Birch", "itemDescription": "sculptor", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Bell_Birch", "wikipedia_page": {"main": "Charles Bell Birch  (28 September 1832 – 16 October 1893) was a British sculptor.", "link_mentions": [{"page": "Queen's Park (Toronto)", "response": ["| George Brown || 65px || 65px || Created by Charles Bell Birch, it was unveiled in 1884. It is the first statue erected at the park that honours a historic figure. "]}, {"page": "Temple Bar, London", "response": ["The elaborate pedestal in a neo-Renaissance style serves as the base for a sculpture by Charles Bell Birch of a dragon supporter (sometimes erroneously referred to as a griffin) bearing a shield of the arms of the City of London. The pedestal is decorated with statues by Joseph Boehm of Queen Victoria and her son the Prince of Wales, the last royals to have entered the City through Wren's gate, which event is depicted in one of the reliefs which also decorate the structure.Details and photos at Victorian Web."]}, {"page": "Horace Jones (architect)", "response": ["*Temple Bar Memorial, 1880. The elaborate pedestal in a Neo-Renaissance style, decorated with some reliefs as well as statues of Queen Victoria and The Prince of Wales, serves as the base for Charles Bell Birch's Griffin (but really a dragon), the symbol of the City of London.Details and photos at Victorian Web."]}, {"page": "St George's Hall, Liverpool", "response": ["The main entrance is in the centre of the east façade and is approached by a wide flight of steps.  On the steps is a statue of Benjamin Disraeli by Charles Bell Birch, moved here to make way for Liverpool's cenotaph.  At the south-east corner is a bronze statue of Major-General William Earle by the same sculptor. This front has a central portico of 16 Corinthian columns flanked on each side by series of square, unfluted columns, between which are reliefs that were added between 1882 and 1901 by Thomas Stirling Lee, C. J. Allen and Conrad Dressler.  The west front has a projecting central part with square columns supporting a large entablature. The north front has a semicircular apse with columns and three doorways that are flanked by statues of nereids or tritons bearing a cornucopia with lamps attached, the central doors on the south and east fronts have similar statues, and were sculpted by William Nicholl. thumb|right|Cockerell's design of the southern sculptured pediment of St George's Hall The south front has an octastyle portico (eight columns wide), two columns deep, on steps above a rusticated podium. On the south portico entablature is a classical Latin inscription using V where U would now be used, that reads ‘ARTIBVS LEGIBVS CONSILIIS LOCVM MVNICIPES CONSTITVERVNT ANNO DOMINI MDCCCXLI’ (For Arts, Law and Counsel the townspeople built this place in 1841). The tympanum in the pediment above the south portico once contained sculptures of Britannia enthroned at the centre protecting agriculture and the arts and offering an olive branch to the four quarters of the globe, carved by William Nicholl, this was removed for safety's sake in 1950, the sculptures had become unsafe due to erosion by atmospheric pollution, and subsequently lost, reputedly turned into hardcore.Liverpool Daily Post 15 December 2005 (from the FreeLibrary)"]}, {"page": "Walter Hamilton (VC)", "response": ["A slightly over-life-size statue of Hamilton striding over an Afghan threatening him with a knife was produced in bronze-painted plaster by Charles Bell Birch in Dublin in around 1880. It is now on display in the National Army Museum, Chelsea, as is a plaque to him (set up in the Punjab Frontier Force Chapel, then in the sanctum crypt of St. Lukes Chapel, Chelsea)."]}, {"page": "Alfred Stevens (painter)", "response": ["Despite earning a considerable income through the sale of his paintings, Stevens found that a combination of bad investments and excessive spending caused him great financial difficulties during the 1880s.  An additional expense came from summers by the sea, which a doctor told Stevens in 1880 were essential for his health.  Thus the artist was glad to agree when the Paris dealer Georges Petit offered him 50,000 francs to finance his vacation in exchange for the paintings Stevens produced during that time. This deal, which lasted for three years, resulted in the sea becoming an important subject for him, and over the rest of his career, he painted hundreds of views of popular resorts along the Normandy coast and the Midi in the south.  Many of them are painted in a sketchy style that shows the influence of the Impressionists.  Stevens also began to take private students, including Sarah Bernhardt, who became a close personal friend, and William Merritt Chase. Other students were Berthe Art, Charles Bell Birch, Jules Cayron, Marie Collart-Henrotin, Louise De Hem, Harriet Campbell Foss, Georgette Meunier, Lilla Cabot Perry, Jean-Paul Sinibaldi, and Fernand Toussaint.Alfred Stevens in the RKD"]}, {"page": "John Henry Foley", "response": ["Foley's pupil Thomas Brock brought several of Foley's works to completion after his death, including his statue of Prince Albert for the Albert Memorial. Foley's articled pupil and later studio assistant Francis John Williamson became a successful sculptor in his own right, reputed to have been Queen Victoria's favourite. Other pupils and assistants were Charles Bell Birch, Samuel Ferris Lynn, Charles Lawes, and Richard Belt."]}, {"page": "Alfred Seale Haslam", "response": ["In 1896 he funded a statue of Queen Victoria by Charles Bell Birch at the north end of Blackfriars Bridge in London. Haslam made a similar donation to create a statue in his constituency of Newcastle under Lyme in 1903. Haslam had a third erected in Derby. There were seven other casts, all of which were based on a marble original which was erected in India."]}, {"page": "Grade II listed buildings in Liverpool-L1", "response": ["| The statue is attached to the southeast angle of St George's Hall.  It is in bronze, by Charles Bell Birch, and shows Major General William Earle standing over an African shield."]}, {"page": "William Earle (British Army officer)", "response": ["There is a bronze statue of him outside St George's Hall, Liverpool, by sculptor Charles Bell Birch. There is also a stone bust of General Earle at St Mark's Anglican Church in Alexandria, Egypt.  This bust is mentioned by E. M. Forster in his Alexandria: A History and a Guide, and by Lawrence Durrell in his novel Justine, the first volume of The Alexandria Quartet."]}, {"page": "Birch (surname)", "response": ["* Charles Bell Birch (1832–1893), English sculptor"]}, {"page": "C.B. Birch", "response": ["#redirectCharles Bell Birch"]}, {"page": "C. B. Birch", "response": ["#redirectCharles Bell Birch"]}, {"page": "List of public art in Liverpool", "response": ["The city of Liverpool has a greater number of public sculptures than any other location in the United Kingdom aside from Westminster. Early examples include works by George Frampton, Goscombe John, Thomas Thornycroft, Charles Bell Birch, Richard Westmacott, Francis Chantrey, John Gibson, Thomas Brock and F.W. Pomeroy, while Barbara Hepworth, Jacob Epstein, Mitzi Cunliffe and Elisabeth Frink provide some of the modern offerings. More recently, local artist Tom Murphy has created a dozen sculptures in Liverpool."]}, {"page": "List of public art in the City of Sydney", "response": ["|Charles Bell Birch"]}, {"page": "Lewis Levy", "response": ["An elaborate drinking fountain was built in the Sydney Botanic Gardens in his memory by his family in 1889. It is made of polished red and white granite and features a bronze figure by sculptor Charles Bell Birch. It was unveiled by the Premier of New South Wales, Sir Henry Parkes, during a ceremony on 17 December 1889."]}, {"page": "Listed buildings in Bolton", "response": ["|The statue by Charles Bell Birch commemorates Samuel Taylor Chadwick, a doctor who practised locally. It consists of a bronze figure standing on a stone plinth. On the plinth is a bronze table depicting in low relief a seated woman with poor children."]}, {"page": "Listed buildings in Newcastle-under-Lyme", "response": ["|The statue, by Charles Bell Birch, is in bronze, and depicts Queen Victoria standing and holding the orb and sceptre.  It stands on a plinth of polished granite, with inscriptions on the front and the rear.  The statue was moved to its present location in 2001."]}, {"page": "Scarborough Town Hall", "response": ["An official opening ceremony took place on 28 July 1903, during which Queen Victoria's youngest daughter, Princess Beatrice, formally opened the Town Hall – the ceremonial key used is displayed in a cabinet inside the building – and unveiled a new bronze statue of Victoria by Charles Bell Birch in gardens outside. The memorial statue, which is separately grade II listed, is the only statue of a public figure in Scarborough."]}, {"page": "Jonathan Birch (translator)", "response": ["In 1823 Birch married Esther Brooke, of Lancaster. They had five children, of whom a son Charles Bell Birch A.R.A. and a daughter survived him."]}]}}