{"wiki_id": "http://www.wikidata.org/entity/Q322565", "itemLabel": "Ian Donald", "itemDescription": "Scottish physician", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Donald", "wikipedia_page": {"main": "Ian Donald  (27 December 1910 in Liskeard – 19 June 1987) was an English physician who was most notable for pioneering the diagnostic use of ultrasound in obstetrics, enabling the visual discovery of abnormalities in pregnancy. Donald was Regius Professor of Obstetrics and Gynaecology at the University of Glasgow. Donald's work was characterised by a series of collaborations between clinicians and engineers that led to the designing and building of a series of instruments that enabled the examination of the unborn and that eventually enabled him to build the world's first obstetric ultrasound machine, the Diasonograph in 1963. His other great achievement was to secure the construction of the Queen Mother's Maternity Hospital that was built next to the Royal Hospital for Children in Glasgow.", "link_mentions": [{"page": "List of Scots", "response": ["* Ian Donald (1910–1987), physician, pioneer of the use of diagnostic ultrasound in medicine"]}, {"page": "Medical ultrasound", "response": ["Obstetrical sonography was originally developed in the late 1950s and 1960s by Sir Ian DonaldHellman LM, Duffus GM, Donald I, Sundén B. Safety of diagnostic ultrasound in obstetrics. Lancet. 1970 May 30;1(7657):1133-4. doi: 10.1016/s0140-6736(70)91212-2. PMID 4192094.Campbell S. A short history of sonography in obstetrics and gynaecology. Facts Views Vis Obgyn. 2013;5(3):213-29. PMID 24753947; PMCID: PMC3987368. and is commonly used during pregnancy to check the development and presentation of the fetus. It can be used to identify many conditions that could be potentially harmful to the mother and/or baby possibly remaining undiagnosed or with delayed diagnosis in the absence of sonography. It is currently believed that the risk of delayed diagnosis is greater than the small risk, if any, associated with undergoing an ultrasound scan. However, its use for non-medical purposes such as fetal \"keepsake\" videos and photos is discouraged.", "Parallel developments in Glasgow, Scotland by Professor Ian Donald and colleagues at the Glasgow Royal Maternity Hospital (GRMH) led to the first diagnostic applications of the technique. Donald was an obstetrician with a self-confessed \"childish interest in machines, electronic and otherwise\", who, having treated the wife of one of the company's directors, was invited to visit the Research Department of boilermakers Babcock & Wilcox at Renfrew. He adapted their industrial ultrasound equipment to conduct experiments on various morbid anatomical specimens and assess their ultrasonic characteristics. Together with the medical physicist . and fellow obstetrician Dr John MacVicar, Donald refined the equipment to enable differentiation of pathology in live volunteer patients. These findings were reported in The Lancet on 7 June 1958 as \"Investigation of Abdominal Masses by Pulsed Ultrasound\" – possibly one of the most important papers published in the field of diagnostic medical imaging."]}, {"page": "Obstetric ultrasonography", "response": ["Scottish physician Ian Donald was one of the pioneers of medical use of ultrasound. His article \"Investigation of Abdominal Masses by Pulsed Ultrasound\" was published in The Lancet in 1958. Donald was Regius Professor of Midwifery at the University of Glasgow.Ian Donald's paper in the Lancet in 1958 by Joseph Woo"]}, {"page": "1958 in science", "response": ["* June 7 – Ian Donald publishes an article in The Lancet which describes the diagnostic use of ultrasound in obstetrics."]}, {"page": "Sonicaid", "response": ["Sonicaid Ltd was involved in an early venture in the development of a 3D multiplanar scanner in the mid 1970s, building on the pioneering obstetric ultrasonography work by Prof Ian Donald and colleagues. They also developed the Sonicaid RTS5200 Real Time Scanner which was used in hospitals for obstetric applications."]}, {"page": "List of University of Glasgow people", "response": ["* Ian Donald, pioneer of diagnostic and obstetric medical ultrasound"]}, {"page": "Scottish inventions and discoveries", "response": ["* First diagnostic applications of an ultrasound scanner: Ian Donald (1910–1987)Ian Donald's Practical Obstetric Problem, 6/e By Renu Misra"]}, {"page": "Glasgow Royal Infirmary", "response": ["In the 1950s Professor Ian Donald, working in the field of obstetrics and gynaecology, was one of the pioneers of diagnostic ultrasound."]}, {"page": "Regius Professor of Obstetrics and Gynaecology (Glasgow)", "response": ["* Ian Donald CBE BA MD (1955)"]}, {"page": "University of Glasgow Medical School", "response": ["The University of Glasgow School of Medicine has a history dating back to its seventeenth-century beginnings. Achievements in medical science include contributions from renowned physicians such as Joseph Lister (antisepsis), George Beatson (breast cancer), John Macintyre (X-rays and radiology), William Hunter (anatomy and obstetrics) and Ian Donald (ultrasound). In addition to achievements in medical science, the school has produced distinguished literary figures such as Tobias Smollett and AJ Cronin.", "* Ian Donald (1910–1987) - obstetrician and pioneer of medical ultrasound."]}, {"page": "The Silent Scream", "response": ["Additional medical opinions on the film, some critical and some supportive, were presented before a U.S. Senate subcommittee that was examining the question of fetal pain.Hearing Before the Subcommittee on the Constitution of the Committee on the Judiciary, United States Senate, Ninety-Ninth Congress. (May 21, 1985). First session on: The medical evidence concerning fetal pain. S. Hrg. 99–429; Serial No. J-99-28. Among the opinions expressed were those of Dr. Richard Berkowitz, whose criticism of the film was already mentioned above, and Dr. Ian Donald, an English physician and pioneer of diagnostic ultrasound. Dr. Donald's affidavit said that the fetal activities shown in the film “are not faked nor the result of artefact intentional or otherwise.”ibid.: p. 5. Nathanson himself appeared before the subcommittee and said that the film had portions that were shown in freeze frame or slow motion for clarification purposes but that it reverted to normal speed without any intention to deceive.ibid.: pp. 7–9. On the issue of fetal pain, Nathanson said that the fetal reactions in the film imply that it is in pain, albeit at a “primitive level.”ibid.: pp. 10–12. He also conceded that at this stage of development there would be no cognition of pain in the cerebral cortex.ibid.: p. 19."]}, {"page": "Kypros Nicolaides", "response": ["* Ian Donald Gold Medal for Highest Contribution in Ultrasound, International Society of Ultrasound in Obstetrics and Gynecology, 1999"]}, {"page": "1958 in the United Kingdom", "response": ["* 7 June – Ian Donald publishes an article in The Lancet which describes the diagnostic use of ultrasound in obstetrics as pioneered in Glasgow."]}, {"page": "Stuart Campbell (obstetrician)", "response": ["Stuart Campbell DSc FRCPEd FRCOG FACOG, was born in Glasgow, Scotland, and graduated from the medical school of Glasgow University. During his training he worked with Ian Donald, who had published some of the first papers on the use of ultrasound in obstetrics.", "In 1992 he was awarded the Ian Donald Gold Medal of ISUOG in recognition of his contribution to ultrasound in obstetrics & gynecology, with over 400 peer-reviewed publications to his name at the time.", "* Presentation of the 1992 Ian Donald Gold Medal to Stuart Campbell. Ultrasound Obstet Gynecol 2 (1992) 379–380"]}, {"page": "Outline of medicine", "response": ["*Ian Donald pioneered the use of the ultrasound scan, which led to its use as a diagnostic tool."]}, {"page": "List of British innovations and discoveries", "response": ["* The ultrasound scanner – Ian Donald (1910–1987) Ian Donald's Practical Obstetric Problem, 6/e By Renu Misra"]}, {"page": "Peter Richardson (politician)", "response": ["Richardson was born in Perth, Western Australia, and graduated from the University of Western Australia in 1963. He trained at King Edward Memorial Hospital for Women, Fremantle Hospital, and the Royal Hospital for Women, qualifying as a member of the Royal College of Obstetricians and Gynaecologists. From 1968 to 1970 he worked in England as a senior registrar at St. Luke's Hospital, Guildford, and as a consultant to the Welsh Hospital Board. He also undertook further training in laparoscopy and ultrasound, under Patrick Steptoe and Ian Donald respectively. Richardson worked in New York from 1970 to 1972 before returning to Perth in 1973."]}, {"page": "List of people educated at Fettes College", "response": ["* Ian Donald, medical pioneer in ultrasound."]}, {"page": "Ultrasonography of chronic venous insufficiency of the legs", "response": ["The use of ultrasonography in medicine soon followed in different locations around the world. In the mid-1950s more research was undertaken by Professor Ian Donald et al., in Glasgow, which advanced the practical technology and applications of ultrasound. In 1963, in France, Léandre Pourcelot started on his thesis, which was presented in 1964, and used pulsed Doppler for blood flow calculation as its subject. This was followed up by Peronneau in 1969. Dr. Gene Strandness and the bio-engineering group at the University of Washington who conducted research on Doppler ultrasound as a diagnostic tool for vascular disease, published their first work in 1967. The first report published about the venous system appeared around 1967–1968. A few years later in 1977, Claude Franceschi published the very first book about vascular ultrasonography, L’investigation vasculaire par ultrasonographie Doppler."]}, {"page": "1958 in Scotland", "response": ["* 7 June – Ian Donald publishes an article in The Lancet describing the diagnostic use of ultrasound in obstetrics as pioneered in Glasgow"]}, {"page": "1910 in Scotland", "response": ["* December – Ian Donald, physician, pioneer in the use of Medical ultrasonography (died 1987)"]}, {"page": "1973 New Year Honours", "response": ["*Ian Donald, M.B.E., Regius Professor of Midwifery, University of Glasgow."]}, {"page": "Alastair MacLennan (obstetrician)", "response": ["MacLennan was born in Glasgow, Scotland, on 28 March 1945. In an interview, he said that he wanted to be a doctor since he was four years old. At age 16, he began studying at the University of Glasgow Medical School, mentored by Ian Donald, who pioneered obstetric ultrasound. He graduated in 1968 with a MB ChB, choosing to specialise in obstetrics and gynaecology because it incorporates being both a physician and a surgeon, with a variety of sub-specialities and research opportunities."]}, {"page": "Alison Munro", "response": ["Munro was born in Liskeard in Cornwall but she was brought up in South Africa. Her father was a doctor and her mother was a concert pianist. It was her father's health that took the family to South Africa but following his wife's death he died months later. The four surviving children were left money and trustees to look after them. The children used the former to pay for their education and to manage the latter.  Her brother was Professor Sir Ian Donald one of the pioneers of medical and obstetric ultrasound.  In England she went to St Hilda's College to take mathematics, but she switched subjects and emerged with a first degree in PPE."]}, {"page": "Warriston School", "response": ["*Professor Ian Donald (1910-1997), Scottish physician who pioneered the use of diagnostic ultrasound in medicine."]}, {"page": "Charles Richard Whitfield", "response": ["In 1964 he was granted an honorary attachment to the department of Ian Donald, the medical ultrasound pioneer from Glasgow, whom he would later succeed. Whitfield was then awarded the United States Public Health Service Research Fellowship under Edward H. Hon at Yale University, New Haven, Connecticut, and Stanley T. Lee at the Loma Linda University Medical Centre, California 1964–1965. He returned to Belfast where he was the first to practice Hon's electronic fetal heart rate monitoring methods.", "After a short spell as Professor of Obstetrics and Gynaecology at the University of Manchester and Honorary Consultant at the University Hospital of South Manchester 1974–1976, Whitfield took up his final position as Regius Professor of Midwifery at the University of Glasgow and Honorary Consultant at the Queen Mother's Hospital and Western Infirmary 1976, succeeding Ian Donald with whom he had first worked 12 years previously. He was made FRCS(G) in 1977 and retired Emeritus Regius Professor of Midwifery (Glasgow) in 1992."]}, {"page": "Tom Brown (engineer)", "response": ["Thomas Graham Brown (10 April 1933 in Glasgow – 13 December 2019) was a Scottish engineer who was most notable for collaborating in the design of the first medical ultrasound machine along with the obstetrician and designer Ian Donald, who would later be the Regius Professor of Obstetrics and Gynaecology at the University of Glasgow and industrial designer and obstetrician John MacVicar.", "It was in late 1956 when Brown first met Ian Donald. Brown although relatively young at twenty-three, had previously worked on an automatic flaw detector for testing of industrial products. It was while working in the Western Infirmary installing a bulb in an operating theatre that Brown found out that Donald was experimenting with the flaw detector.Brown, Tom (Unpublished article) Development of ultrasonic scanning techniques in Scotland 1956-1979, 1994 Brown immediately looked up Donald in the Infirmary directory, phoned him and arranged a meeting. When they met, Brown noticed that the Mark IIb wasn't manufactured by Kelvin & Hughes but instead had been manufactured under contract. He also noticed that the machine had been converted from using a double probe, one to produce pulses and one to receive the pulses to a single probe. Not wanting to insult Donald by explaining why the machine was not working correctly, Brown offered to try and source another machine from somewhere. Brown phoned Alex Rankin, the man who collaborated with Brown on the automatic flaw detector for help Rankin offered to gift the latest Mk IV Flaw Detector which was subsequently forwarded to Glasgow Central station from the Barkingside Labs location of Kelvin & Hughes, for delivery to Brown.", "In 1982, Brown along with Donald were elected as the first honorary life members of the British Medical Ultrasound Society. In 1996 he was awarded the Ian Donald Gold medal Award for Technical Merit. In 2007, Brown was awarded an honorary fellowship ad eundem of the Royal College of Obstetricians and Gynaecologists. In 2014 Brown was inducted into the Scottish Engineering Hall of Fame and awarded an honorary fellowship of the Institution of Engineers and Shipbuilders in Scotland. "]}]}}