{"wiki_id": "http://www.wikidata.org/entity/Q3229597", "itemLabel": "Leo Sheffield", "itemDescription": "British opera singer and actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Leo_Sheffield", "wikipedia_page": {"main": "Leo Sheffield (15 November 1873 – 3 September 1951), born Arthur Leo Wilson, was an English singer and actor best known for his performances in baritone roles of the Savoy Operas with the D'Oyly Carte Opera Company. \nHe made his first stage appearances under the direction of W. S. Gilbert in 1906, remaining with the D'Oyly Carte company for three years.  After touring in musical theatre for the next five years with other managements, he rejoined D'Oyly Carte from 1915 to 1928 in the principal baritone roles, appearing in London seasons and on tour in Britain and, in one of his last seasons, Canada.  He recorded many of these roles.\nAfter leaving D'Oyly Carte, Sheffield worked in a wide variety of theatre, including musical comedy, straight plays, pantomime, and in radio and films.  He continued to tour during the Second World War while in his seventies.", "link_mentions": [{"page": "The Pirates of Penzance", "response": ["|Samuel||Leo Sheffield||Frederick Hobbs||Joseph Griffin||Richard Walker||Hilton Layland", "|Sergeant||Rutland Barrington||Fred Billington||Leo Sheffield||Sydney Granville||Richard Walker"]}, {"page": "The Mikado", "response": ["|Pooh-Bah||Fred Billington||Leo Sheffield||Sydney Granville||Richard Walker||Richard Watson", "In 1926, the D'Oyly Carte Opera Company made a brief promotional film of excerpts from The Mikado. Some of the most famous Savoyards of the day are seen in this film, including Darrell Fancourt as The Mikado, Henry Lytton as Ko-Ko, Leo Sheffield as Pooh-Bah, Elsie Griffin as Yum-Yum, and Bertha Lewis as Katisha.Shepherd, Marc. \"The 1926 D'Oyly Carte Mikado Film\" , The Gilbert & Sullivan Discography, 15 April 2009, accessed 31 July 2016The first phonoscènes in the UK were presented at Buckingham Palace in 1907 and included Tit-Willow, sung by George Thorne.Schmitt, Thomas. The Genealogy of Clip Culture, in Henry Keazor and Thorsten Wübbena (eds.) Rewind, Play, Fast Forward: The Past, Present and Future of the Music Video, transcript Verlag (2010), pp. 45 et seq., "]}, {"page": "Iolanthe", "response": ["|Private Willis||Charles Manners||Lithgow James||Reginald Crompton||Overton Moyle||Leo Sheffield", "|Private Willis||Leo Sheffield||Leo Sheffield||Sydney Granville||L. Radley Flynn||Richard Watson"]}, {"page": "Ruddigore", "response": ["|Sir Despard||Rutland Barrington||Fred Billington||Leo Sheffield||Sydney Granville||Sydney Granville"]}, {"page": "H.M.S. Pinafore", "response": ["In 1911, H. L. Mencken wrote: \"No other comic opera ever written – no other stage play, indeed, of any sort – was ever so popular. ... Pinafore ... has been given, and with great success, wherever there are theaters – from Moscow to Buenos Aires, from Cape Town to Shanghai; in Madrid, Ottawa and Melbourne; even in Paris, Rome, Vienna and Berlin.\"Mencken, H. L. \"Pinafore at 33\", Baltimore Evening Sun, 1911, reproduced at The Gilbert and Sullivan Archive, accessed 10 March 2009 After the deaths of Gilbert and Sullivan, the D'Oyly Carte Opera Company retained exclusive rights to perform their operas in Great Britain until 1962, touring throughout Britain for most of the year and, beginning in 1919, often performing in London for a season of about four months. The Times gave the company's 1920 London production an enthusiastic review, saying that the audience was \"enraptured\", and regretting that Pinafore would be played for only two weeks. It praised the cast, singling out Leo Sheffield as the Captain, Henry Lytton as Sir Joseph, Elsie Griffin as Josephine, James Hay as Ralph, Bertha Lewis as Little Buttercup and the \"splendid\" choral tone. It concluded that the opera made a \"rollicking climax to the season\".\"H.M.S. Pinafore. Revival at Princes Theatre\", The Times, 21 January 1920, p. 10 Two years later, it gave an even more glowing report of that season's performances, calling Derek Oldham an \"ideal hero\" as Ralph, noting that Sydney Granville \"fairly brought down the house\" with his song, that Darrell Fancourt's Deadeye was \"an admirably sustained piece of caricature\" and that it was a \"great pleasure\" to hear the returning principals.\"H.M.S. Pinafore. Sullivan Opera Season Nearing The End\", The Times, 3 January 1922, p. 8 A 1961 review of the company's Pinafore is much the same.\"Novelty and Tradition in Savoy Operettas\", The Times, 12 December 1961, p. 5", "|Captain Corcoran||Leicester Tunks||Leo Sheffield||Leslie Rands||Richard Watson", "|Dick Deadeye||Leo Sheffield||Darrell Fancourt||Darrell Fancourt||Darrell Fancourt"]}, {"page": "The Yeomen of the Guard", "response": ["|Lieutenant||Wallace Brownlow||George Broderick||Jones Hewson||Alec Johnstone||Leo Sheffield", "|2nd Yeoman||A. Medcalf||J. Priest||H. G. Gordon||Leo Sheffield||Fred Hewett", "|Wilfred||Leo Sheffield||Sydney Granville||Sydney Granville||Richard Walker||Richard Watson"]}, {"page": "1951 in music", "response": ["*September 3 – Leo Sheffield, d'Oyly Carte star, 77"]}, {"page": "The Sorcerer", "response": ["|Dr Daly||Leo Sheffield||Leslie Rands||Leslie Rands||Kenneth Sandford||Kenneth Sandford"]}, {"page": "Princess Ida", "response": ["|King Hildebrand||Rutland Barrington||Sgr Brocolini||Sgr Brocolini||Fred Billington||Leo Sheffield"]}, {"page": "The Gondoliers", "response": ["|Luiz||Wallace Brownlow||Arthur Marcel||Jones Hewson||Alec Johnstone||Leo Sheffield", "|Annibale||J. Wilbraham||Percy Charles||Charles Childerstone||Leo Sheffield||A. Laurence Legge", "|Don Alhambra||Leo Sheffield||Sydney Granville||Sydney Granville||Richard Walker||Richard Watson"]}, {"page": "Cicely Courtneidge", "response": ["During this period, Courtneidge and Hulbert made gramophone records for Columbia and HMV. Both made solo recordings, and Courtneidge recorded songs and sketches with other artists, including Leo Sheffield,\"Mrs. Bartholomew\", HMV B4475 and Ivor McLaren and Lawrence Green, with whom she recorded \"Double Damask\" in 1932.HMV B4134 With Hulbert, she recorded such numbers as \"Why has a cow got four legs\".HMV B4475 on reverse of \"Mrs Bartholomew\" She also recorded Noel Gay's \"There's Something About a Soldier\", which she sang in Soldiers of the King (1933).\"Cicely Courtneidge & Jack Hulbert Archive\", Theatre Collection, University of Bristol, accessed 13 June 2018; and \"Cicely Courtneidge – 'The Moment I Saw You' / 'There's Something About a Soldier'\", Discogs.com, accessed 13 June 2018 Courtneidge's solo discs include another of her most celebrated sketches, \"Laughing Gas\" (1931).HMV B3993"]}, {"page": "Peter Pratt", "response": ["Pratt was married to D'Oyly Carte soubrette Joyce Wright during his days with that company. He later married Patience Sheffield, a BBC drama Studio Manager and daughter of former D'Oyly Carte baritone Leo Sheffield."]}, {"page": "D'Oyly Carte Opera Company", "response": ["After Grossmith left the company, the most notable players of his roles during the rest of Gilbert's lifetime were Walter Passmore (principal comedian from 1894 to 1903) and Charles H. Workman, who played the roles on tour with the company from 1897 and took over as principal comedian at the Savoy between 1906 and 1909.Wilson and Lloyd, pp. 59–87 Both of these performers made recordings of songs from the Savoy operas. During the Passmore era, principal players of the company included Brandram and Barrington, as well as tenor Robert Evett, soprano Isabel Jay, sopranos Ruth Vincent and Florence St. John, tenor Courtice Pounds and his sister, mezzo-soprano Louie Pounds. During Workman's tenure, principal players included contralto Louie René, soprano Clara Dow, Leo Sheffield, and a young Henry Lytton. No complete recordings of the operas were made that included active members of the company until the 1920s. Workman and W. S. Gilbert quarrelled over their production of Fallen Fairies in 1909, and Gilbert banned Workman from appearing in his works in Britain. It is likely that, otherwise, Workman would have continued as principal comedian of the company.Murray, Roderick. \"A review of Lytton – Gilbert and Sullivan's Jester by Brian Jones\" in The Gaiety (Summer, 2006) Rupert D'Oyly Carte wrote to Workman in 1919 asking him to return to the company as principal comedian, but Workman declined.Howarth, Paul. Fallen Fairies cast information at The Gilbert and Sullivan Archive, 19 March 2005, accessed 4 November 2009", "From 1909 to 1934, the principal comedian was Henry Lytton, who had been playing a variety of roles with the company steadily since 1887. He received a knighthood for his performances during his long tenure with the company.Wilson and Lloyd, p. 125 Lytton's voice deteriorated during his later career, and when HMV embarked on a series of complete recordings of the operas after World War I, he was not invited to record most of his roles. Instead, the concert singer George Baker was brought in to substitute. Other performers from this period include the mezzo-soprano Nellie Briercliffe, bass-baritone Darrell Fancourt, who is estimated to have portrayed the Mikado of Japan more than 3,000 times, contralto Bertha Lewis, tenor Derek Oldham, soprano Elsie Griffin and baritones Leo Sheffield and Sydney Granville.Wilson and Lloyd, pp. 90–112"]}, {"page": "Isidore Godfrey", "response": ["Godfrey conducted most of the company's performances during his four decades as musical director, except for a few London seasons, when Malcolm Sargent was guest conductor, and brief periods in the summers of 1947 and 1948, when Boyd Neel was guest conductor. Godfrey's assistant musical directors included Alan E. Ward (1930–49), William Cox-Ife (1951–61) and James Walker (1961–68).Rollins and Witts, Appendix pp. II-VI During Godfrey's long reign as musical director, he conducted artists who had worked under the direction of W. S. Gilbert, such as Henry Lytton, Leo Sheffield and Sydney Granville, and those who were performing at the last night of the D'Oyly Carte Opera Company in 1982, such as John Reed and Kenneth Sandford.Rollins and Witts, pp. 152–53Wilson and Lloyd, p. 213 In his early years in charge, Godfrey, with Rupert D'Oyly Carte's backing, gradually cut down the number of encores routinely given at the company's performances.Joseph, p. 222 The stars and the audiences both resisted, but Godfrey eventually made progress, particularly after the outbreak of World War II, when it was important to keep running times down to a reasonable length.Joseph, p. 258"]}, {"page": "Fallen Fairies", "response": ["Charles Herbert Workman, who had made a name playing the comic baritone parts in the Gilbert and Sullivan operas, assembled a production syndicate in 1909 to produce comic operas (starring himself) at the Savoy Theatre, beginning with The Mountaineers, followed by Fallen Fairies, in which he appeared in the comic role of Lutin. The piece opened on 15 December 1909, and the cast also starred Leo Sheffield as Phyllon, Percy Anderson designed the costumes. John D'Auban choreographed. Had Fallen Fairies been a success, it was intended that Gilbert would revive (with revisions) earlier operas of his that were not in the D'Oyly Carte Opera Company repertoire, and that it would be followed by at least one more new work by Gilbert and German.Shepherd, p. xxviiStedman, pp. 334–35", "* The Fairy Phyllon (bass-baritone) – Leo Sheffield", "* Sir Phyllon, a Hunnish Knight (bass-baritone) – Leo Sheffield"]}, {"page": "Sydney Granville", "response": ["In March 1914, Granville left the company.Rollins and Witts, p. 130 He played in pantomime as the Demon Killjoy in Cinderella at the London Palladium.The Observer, 26 December 1915, p. 7 He rejoined D'Oyly Carte, during its 1915–16 tour, playing only Strephon and Luiz in a nine-opera repertoire.Rollins and Witts, p. 132 The Manchester Guardian commented on his neglect, \"Mr. Sydney Granville, who has been heard too little, was a delightful Strephon.\"The Manchester Guardian, 4 April 1916, p. 4 In the next season, he lost the role of Strephon to Leo Sheffield when the latter rejoined the company. Granville left D'Oyly Carte for the second time in 1917.Rollins and Witts, p. 133", "Granville rejoined the D'Oyly Carte company in 1928, replacing the retiring Leo Sheffield in the bass-baritone roles. Except during Sheffield's return for the 22-week London Season in 1929–30, Granville performed these \"heavy\" baritone roles until his retirement in December 1942. He played the Learned Judge in Trial, the Sergeant of Police in Pirates, Private Willis in Iolanthe, Pooh-Bah in The Mikado, Sir Despard Murgatroyd in Ruddigore, and Don Alhambra in The Gondoliers. He added Wilfred Shadbolt in Yeomen in 1929 and King Hildebrand in Princess Ida in 1931.Rollins and Witts, pp. 153–66 In 1938, The Observer wrote that Granville \"has worked up from stripling parts like Strephon to become, after twenty-five odd years, one of the great Savoy veterans.\"Lejeune, C. A. \"Gentlemen of Japan\", The Observer, 3 July 1938, p. 14 By 1939, he had given up the Judge and Willis."]}, {"page": "Ivan Menzies", "response": ["During these early seasons, Menzies understudied Henry Lytton, Leo Sheffield and other principal comedians of the company and appeared occasionally in the leading comedy roles of the Learned Judge in Trial, Major General Stanley in The Pirates of Penzance, the Lord Chancellor in Iolanthe, Jack Point in Yeomen, and the Duke of Plaza-Toro in The Gondoliers. Menzies related that \"The first time I played the Duke of Plaza-Toro, I started by catching my spurs and falling into the canal.  It was decidedly not traditional.\"Ayre, p. 213"]}, {"page": "A Welsh Sunset", "response": ["*Owen Rhys – Leo Sheffield"]}, {"page": "Cultural influence of Gilbert and Sullivan", "response": ["Film adaptations of the operas have included a 1926 D'Oyly Carte Opera Company short promotional film of The Mikado that featured some of the most famous Savoyards, including Darrell Fancourt, Henry Lytton, Leo Sheffield, Elsie Griffin, and Bertha Lewis.Shepherd, Marc. 1926 Mikado  at A Gilbert and Sullivan Discography In 1939, Universal Pictures released a ninety-minute technicolor film adaptation of The Mikado. The film stars Martyn Green as Ko-Ko and Sydney Granville as Pooh-Bah.  The music was conducted by Geoffrey Toye, who was credited with the adaptation.  William V. Skall received an Academy Award nomination for Best Cinematography.  Similarly, in 1966, the D'Oyly Carte produced a film version of The Mikado, which showed much of their traditional staging at the time, although there are some minor cuts.  It stars John Reed (Ko-Ko), Kenneth Sandford (Pooh-Bah), Valerie Masterson (Yum-Yum), Donald Adams (the Mikado), Peggy Ann Jones (Pitti-Sing), and Philip Potter (Nanki-Poo).Sullivan, Dan. \"The Mikado (1967)\". The New York Times, 15 March 1967, accessed 22 March 2010"]}, {"page": "Winifred Lawson", "response": ["In 1944 Lawson was elected vice-president of the Gilbert and Sullivan Society and frequently joined Society meetings and events. Her autobiography, A Song to Sing-O!, with foreword by Sir Malcolm Sargent, was published by Michael Joseph in 1955.WorldCat  The Times said that the book \"gives a delightful picture of those happy days in the operas, with Henry Lytton, Bertha Lewis, Leo Sheffield and Darrell Fancourt\"."]}, {"page": "Rodney Steps In", "response": ["Rodney Steps In is a 1931 British comedy film directed by Guy Newall and starring Richard Cooper, Elizabeth Allan, Walter Piers and Leo Sheffield. A carefree aristocrat becomes involved with a woman suspected of murder - and assists her in proving her innocence.BFI.org"]}, {"page": "Trial by Jury", "response": ["|Learned Judge||Charles H. Workman||Leo Sheffield||Leo Sheffield||Sydney Granville"]}, {"page": "Falling for You (film)", "response": ["*Leo Sheffield as The Butler"]}, {"page": "Compromising Daphne", "response": ["*Leo Sheffield as Mr Bannister"]}, {"page": "Lord Richard in the Pantry", "response": ["* Leo Sheffield as Carter"]}, {"page": "The Valley of Ghosts (film)", "response": ["The Valley of Ghosts is a 1928 British silent mystery film directed by G. B. Samuelson and starring Miriam Seegar, Ian Hunter and Leo Sheffield.BFI.org It was an adaptation of the 1922 novel The Valley of Ghosts by Edgar Wallace. It was made at Beaconsfield Studios. It is currently a lost film.", "* Leo Sheffield - Kenneth Nelson "]}, {"page": "Kentucky Minstrels (film)", "response": ["* Leo Sheffield "]}, {"page": "A Wife or Two", "response": ["* Leo Sheffield"]}, {"page": "High Society (1932 film)", "response": ["* Leo Sheffield as \tLord Halkirk"]}]}}