{"wiki_id": "http://www.wikidata.org/entity/Q322761", "itemLabel": "John Dupré", "itemDescription": "British philosopher", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Dupr%C3%A9", "wikipedia_page": {"main": "John A. Dupré (born 3 July 1952) is a British philosopher of science. He is the director of Egenis, the Centre for the Study of Life Sciences, and professor of philosophy at the University of Exeter. Dupré's chief work area lies in philosophy of biology, philosophy of the social sciences, and general philosophy of science. Dupré, together with Nancy Cartwright, Ian Hacking, Patrick Suppes and Peter Galison, are often grouped together as the \"Stanford School\" of philosophy of science.", "link_mentions": [{"page": "Reductionism", "response": ["* John Dupré: The Disunity of Science—an interview at the Galilean Library covering criticisms of reductionism."]}, {"page": "Twin Earth thought experiment", "response": ["John Dupré, in a number of papers and mainly in his paper \"Natural Kinds and Biological Taxa\",Reprinted in John Dupre (2002): Humans and Other Animals. has demonstrated that the theory of natural kinds, which many have taken to be established and/or supported by Putnam's Twin Earth thought experiment does not find support in the practice of scientific classification. Avrum Stroll has produced probably the most comprehensive critique of the program of natural kind semantics (both Putnam's and Kripke's) in his book Sketches of Landscapes.Avrum Stroll (1998): Sketches of Landscapes. Putnam, who is well known for changing his philosophical positions on a variety of issues, criticized the experiment later in life because it is anti-functionalist."]}, {"page": "Ian Hacking", "response": ["Influenced by debates involving Thomas Kuhn, Imre Lakatos, Paul Feyerabend and others, Hacking is known for bringing a historical approach to the philosophy of science. The fourth edition (2010) of Feyerabend's 1975 book Against Method, and the 50th anniversary edition (2012) of Kuhn's The Structure of Scientific Revolutions include an Introduction by Hacking. He is sometimes described as a member of the \"Stanford School\" in philosophy of science, a group that also includes John Dupré, Nancy Cartwright and Peter Galison. Hacking himself still identifies as a Cambridge analytic philosopher. Hacking has been a main proponent of a realism about science called \"entity realism.\" This form of realism encourages a realistic stance towards answers to the scientific unknowns hypothesized by mature sciences, but skepticism towards scientific theories. Hacking has also been influential in directing attention to the experimental and even engineering practices of science, and their relative autonomy from theory. Because of this, Hacking moved philosophical thinking a step further than the initial historical, but heavily theory-focused, turn of Kuhn and others."]}]}}