{"wiki_id": "http://www.wikidata.org/entity/Q323710", "itemLabel": "John Seymour", "itemDescription": "author, influential figure in the self-sufficiency movement", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Seymour_(author)", "wikipedia_page": {"main": "John Seymour (12 June 1914 – 14 September 2004) was a British author and pioneer in the self-sufficiency movement. In 1976, he wrote The Complete Book of Self-Sufficiency.\nHe had multiple roles as a writer, broadcaster, environmentalist, agrarian, smallholder and activist; a rebel against: consumerism, industrialisation, genetically modified organisms, cities, motor cars; an advocate for: self-reliance, personal responsibility, self-sufficiency, conviviality (food, drink, dancing and singing), gardening, caring for the Earth and for the soil.", "link_mentions": [{"page": "Homesteading", "response": ["The attractiveness of back-to-the-land movements dates from the Roman era, and has been noted in Asian poetry and philosophy tracts as well (Agriculturalism). In the 1700s philosophy of physiocracy developed in France and by the 1800s and early 1900s the philosophy of Agrarianism had taken hold in many places around the world. The ideas of modern homesteading proponents, such as Ralph Borsodi, gained in popularity in the 1960s in the United States. Self-sufficiency movements in the 1990s and 2000s began to apply the concept to urban and suburban settings, known as urban homesteading. According to author John Seymour, \"urban homesteading\" incorporates small-scale, sustainable agriculture and homemaking."]}, {"page": "King's African Rifles", "response": ["* John Seymour (author)"]}, {"page": "Richard Body", "response": ["In his later years as an MP, Body clearly distanced himself from an increasingly economic-rationalist and internationalist Tory party by associating himself with a number of environmentalist groups who disapproved of large national or free trade groupings and supported smaller, more \"natural\" and \"organic\" communities. He has been associated with such long-standing figures of the green movement such as Edward Goldsmith, John Seymour, and John Papworth. Unlike the vast majority of Conservative MPs, Body voted in favour of the equalisation of sexuality activity to apply equally to homosexuals from the age of 16, and also supported the legalisation of cannabis. He called for an English Parliament in his book England for the English, published in April 2001."]}, {"page": "Newport, Pembrokeshire", "response": ["* John Seymour, (12 June 1914 – 14 September 2004), author, lived at a farm near Newport between 1963 and 1980. "]}, {"page": "Wendell Berry", "response": ["*John Seymour (author)"]}, {"page": "2004 in the United Kingdom", "response": ["* 14 September – John Seymour, author and self-sufficiency campaigner (born 1914)"]}, {"page": "Wye College", "response": ["* John Seymour, alumnus. Widely published exponent of self-sufficiency and small scale farming."]}, {"page": "John Seymour", "response": ["John Seymour may refer to:", "* John Seymour (MP for Bristol) (fl. 1351, Member of Parliament for Bristol, U.K.", "* John Seymour (1425–1463), British landowner and Member of Parliament", "* John Seymour (died 1464), British knight and Member of Parliament", "* John Seymour (died 1491) (1450s–1491), member of the British landed gentry and grandfather of Queen Jane Seymour", "* Sir John Seymour (1474–1536), father of Queen Jane Seymour, third wife of Henry VIII of England", "*John Seymour (died 1567), Member of Parliament for Great Bedwyn, U.K.", "*John Seymour (died 1552), Member of Parliament for Wootton Bassett, U.K.", "* John Seymour (died 1618), Member of Parliament for Great Bedwyn, U.K.", "* John Seymour, 4th Duke of Somerset (before 1646–1675), British peer and Member of Parliament", "* John Seymour (Maryland governor) (1649–1709), royal governor of the Maryland colony in the Americas, then part of England", "* John Seymour (Gloucestershire MP) (died 1663), British of Parliament", "* John Seymour, 19th Duke of Somerset (born 1952), British peer and Member of Parliament", "* John Seymour (priest) (died 1501), Canon of Windsor", "* John Seymour (cricketer) (1881–1967), British cricketer", "* John Seymour (author) (1914–2004), author and influential figure in the self-sufficiency movement"]}, {"page": "John Seymour (Author)", "response": ["#REDIRECT John Seymour (author) "]}, {"page": "John Seymour (Author and smallholder)", "response": ["#REDIRECT John Seymour (author) "]}, {"page": "Albert Angus Turbayne", "response": ["Turbayne married in London on two occasions. The first in 1906, to Christine Owens and the second, to Millicent Tavener (b. 1884), in 1921. Turbayne and Owens had two sons, William Turbayne (later name change to William Seymour) and John Turbayne, born in 1914, who changed his name to John Seymour."]}, {"page": "The Complete Guide to Insufficiency", "response": ["The Complete Guide to Insufficiency is the debut album by David Thomas Broughton, released in 2005. The entire album was recorded in a single continuous take at a church in Leeds - the church bells can be heard during the record. It was originally released by small indie label Birdwar in the UK before being licensed by Plug Research for US release. The title is a play on the name of John Seymour's book The Complete Guide to Self-Sufficiency."]}, {"page": "John Seymour (author and smallholder)", "response": ["#REDIRECT John Seymour (author)"]}, {"page": "1914 in the United Kingdom", "response": ["* 12 June – John Seymour, author and self-sufficiency campaigner (died 2004)"]}, {"page": "I'm a Stranger Here Myself", "response": ["* the book I'm a Stranger Here Myself: The Story of a Welsh Farm by author John Seymour (author)"]}, {"page": "Runcorn and Weston Canal", "response": ["With the coming of the Manchester Ship Canal, its function continued, as the large shipping using that canal was also a hazard to the smaller canal boats. The canal remained navigable until the early 1960s: the author John Seymour, in his book Voyage into England, described a difficult 1963 journey up the almost-dry canal at which time a Manchester Ship Canal official commented that it had been \"physically, as well as officially\" closed for a year. The flights of locks from the Bridgewater Canal down to Runcorn Docks were filled in when the Runcorn-Widnes road bridge was constructed in 1966. About half of the Runcorn and Weston Canal was filled in at the same time. The southern half remains in water, but is in a derelict state."]}, {"page": "List of Desert Island Discs episodes (1971–1980)", "response": ["|||||Self Sufficiency by John Seymour||Inflatable woman||more"]}, {"page": "List of Desert Island Discs episodes (1991–2000)", "response": ["|||Michael Crawford||The complete book of self-sufficiency by John Seymour|||| more"]}, {"page": "Deaths in September 2004", "response": ["*John Seymour, 90, British self-sufficiency advocate."]}]}}