{"wiki_id": "http://www.wikidata.org/entity/Q323503", "itemLabel": "Hamilton Camp", "itemDescription": "British actor, folk singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Hamilton_Camp", "wikipedia_page": {"main": "Hamilton Camp (30 October 1934 – 2 October 2005) was a British actor and singer.", "link_mentions": [{"page": "H. G. Wells", "response": ["* The character of Wells also appeared in several episodes of Lois & Clark: The New Adventures of Superman (1993–1997), usually pitted against the time-travelling villain known as Tempus (Lane Davies). Wells's younger self was played by Terry Kiser, and the older Wells was played by Hamilton Camp."]}, {"page": "Full Throttle (1995 video game)", "response": ["Full Throttle was LucasArts' eleventh adventure game overall and the tenth to use the company's in-house game engine, SCUMM. It featured full-motion video and action sequences, using LucasArts' INSANE animation engine, which was previously utilized in Star Wars: Rebel Assault II: The Hidden Empire. It was the first LucasArts game to be released for Microsoft Windows and the first to be distributed only on CD-ROM. It also introduced a contextual pie menu through which the player controls interactions with objects and characters. In contrast to other computer games of the era, which mostly relied on in-house talent for their voice acting, Full Throttle used mostly professional voice actors, including Roy Conrad as Ben, Mark Hamill as the villainous Adrian Ripburger, Hamilton Camp as the elderly Malcolm Corley, and Kath Soucie as Ben's ally Maureen. It was one of the few LucasArts games to use licensed music, featuring songs by San Francisco-area rock band The Gone Jackals.", "The last domestic motorcycle manufacturer in the country is Corley Motors, whose founder and CEO, the elderly Malcolm Corley (Hamilton Camp), is en route to a shareholders meeting at the Corley factory, accompanied by his vice president, Adrian Ripburger (Mark Hamill). Malcolm suspects that Ripburger is scheming to take over the company, and is suspicious of Ripburger's plan to recruit a biker gang to ride with them to the meeting. Malcolm's limousine is overtaken by one such gang, the Polecats, and he is immediately impressed with them. Catching up to them at a biker bar, he quickly befriends their leader, Ben (Roy Conrad). Ripburger offers to hire the Polecats to escort Malcolm to the meeting, but when Ben declines, he is knocked out by Ripburger's flunkies, Bolus (Jack Angel) and Nestor (Maurice LaMarche).", "With the Polecats jailed for Malcolm's murder, Ben is a fugitive. Miranda tells him about her film, and Ben convinces semi-trailer truck driver Emmet to sneak him and his motorcycle past a police roadblock and to an abandoned mink farm where Maureen is hiding. He is stranded there when Emmet steals his motorcycle's fuel line and Maureen steals his booster fuel. Emmet's truck is blown up by a biker gang called the Cavefish, destroying the bridge over Poyahoga Gorge, which Ben needs to cross. Having replaced his fuel line and gotten advice from the Polecats' former leader, Father Torque (Hamilton Camp), Ben outwits Nestor and Bolus and does battle with members of rival biker gangs in order to acquire hover equipment, booster fuel, and a ramp, with which he is able to jump his motorcycle over the gorge.", "Full Throttle employed several skilled voice acting professionals, such as Roy Conrad, Kath Soucie, Maurice LaMarche, Tress MacNeille, Hamilton Camp, Steven Jay Blum and Mark Hamill. Full Throttle was the first computer game to employ mostly SAG-registered professional voice actors instead of relying on in-house talent, and also featured a few pieces of licensed music. Schafer stated that Conrad's voice was a \"huge part of making Ben Throttle a charming character.\" It was one of the few LucasArts games to use externally recorded music, courtesy of The Gone Jackals. Certain tracks from their album, Bone to Pick, were featured in the game."]}, {"page": "Heaven Can Wait (1978 film)", "response": ["* Hamilton Camp as Bentley"]}, {"page": "2001 in film", "response": ["| Joe Dirt || Columbia Pictures || Dennie Gordon (director); David Spade, Fred Wolf (screenplay); David Spade, Brittany Daniel, Dennis Miller, Adam Beach, Christopher Walken, Jaime Pressly, Kid Rock, Fred Ward, Rosanna Arquette, Joe Don Baker, Megan Harvey, Caroline Aaron, Brian Thompson, Blake Clark, Hamilton Camp, Mitzi Martin, Tyler Mane, Kevin Farley, John P. Farley, Rance Howard, Steven Brill, Richard Riehle, Bree Turner, Erik Per Sullivan, Hal Fishman, Eddie Money, Carson Daly, Kevin Nealon || Adventure, Comedy || Live action"]}, {"page": "1995 in film", "response": ["| The Pebble and the Penguin || Metro-Goldwyn-Mayer / Don Bluth Entertainment || Don Bluth, Gary Goldman (directors); Rachel Koretsky, Steven Whitestone (screenplay); Martin Short, James Belushi, Tim Curry, Annie Golden, Alissa King, Louise Vallance, Will Ryan, Neil Ross, Stan Jones, S. Scott Bullock, Philip L. Clarke, Shani Wallis, B. J. Ward, Hamilton Camp, Angeline Ball, Kendall Cunningham, Pat Musick, Michael Nunes, Maggie Roswell || Musical, Family || Animation", "| Gordy || Miramax Films / RAS Entertainment Ltd. / Robson Entertainment || Mark Lewis (director); Leslie Stevens (screenplay); Doug Stone, Tom Lester, Afemo Omilami, Hamilton Camp, Frank Welker, Tress MacNeille, Earl Boen, Blake McIver Ewing, Jim Meskimen, Kristy Young, Deborah Hobart, Michael Roescher, James Donadio, Ted Manson, Tom Key, Jon Kohler, Justin Garms, Jocelyn Blue, Frank Soronow, Billy Bodine, Julianna Harris, Sabrina Weiner, Heather Bahler || Family, Comedy, Drama || Live action"]}, {"page": "1996 in film", "response": ["| All Dogs Go to Heaven 2 || Metro-Goldwyn-Mayer || Paul Sabella (director); Arne Olsen, Kelly Ward, Mark Young (screenplays); Charlie Sheen, Sheena Easton, Ernest Borgnine, Dom DeLuise, George Hearn, Bebe Neuwirth, Adam Wylie, Jesse Corti, Wallace Shawn, Hamilton Camp, Dan Castellaneta, Pat Corley, Jim Cummings, Bobby Di Cicco, Tony Jay, Maurice LaMarche, Steve Mackall, Kevin Michael Richardson, Annette Helde, Marabina James || Musical, Romance, Comedy, Drama || Animation"]}, {"page": "1997 in film", "response": ["| The Little Mermaid (re-release) || Walt Disney Pictures || Ron Clements, John Musker (directors/screenplay); Jodi Benson, Christopher Daniel Barnes, Pat Carroll, Samuel E. Wright, Jason Marin, Kenneth Mars, Buddy Hackett, Paddi Edwards, Ben Wright, Edie McClurg, Kimmy Robertson, Caroline Vasicek, Will Ryan, Rene Auberjonois, Gerrit Graham, J.D. Daniels, Rod McKuen, Malachi Pearson, Frank Welker, Jim Cummings, Hamilton Camp, Debbie Shapiro, Ed Gilbert, Charlie Adler, Jack Angel, Steve Bulen, Nancy Cartwright, Philip L. Clarke, Jennifer Darling, Gail Farrell, Donny Gerrard, Phillip Ingram, Anne Lockhart, Sherry Lynn, Patrick Pinney, Sally Stevens, Jackie Ward, Robert Weil, Susan Boyd, Allan Davies, Mitch Gordon, Willie Greene Jr., Linda Harmon, Walter S. Harrah, Luana Jackman, William A. Kanady, Edie Lehmann, Melissa MacKay, Guy Maeda, Lynn Dolin Mann, Arne B. Markussen, Mickie T. McGowan, Gene J. Merlino, Lewis Morford, Kathleen O'Connor, Marilyn Powell, Gloria G. Prosper, Michael Redman Jr., Robert Tebow, Rob Trow, Joe Turano, Bobbi White, Robert S. Zwirn || Family, Musical || Animation"]}, {"page": "1998 in film", "response": ["| Almost Heroes || Warner Bros. Pictures / Turner Pictures || Christopher Guest (director); Mark Nutter, Tom Wolfe, Boyd Hale (screenplay); Chris Farley, Matthew Perry, Eugene Levy, Kevin Dunn, Lisa Barbuscia, Bokeem Woodbine, David Packer, Hamilton Camp, Patrick Cranshaw, Steven M. Porter, Christian Clemenson, Franklin Cover, Jonathan Joss, George Aguilar,  Lewis Arquette, Don Lake, John Farley, Tim DeKay, Brent Hinkley, David Barrera, Jay Lacopo, Frank Salsedo, Rusty Schwimmer, Harry Shearer || Adventure, Comedy || Live action", "| Dr. Dolittle || 20th Century Fox / Davis Entertainment || Betty Thomas (director); Hugh Lofting, Nat Mauldin, Larry Levin (screenplay); Eddie Murphy, Ossie Davis, Oliver Platt, Peter Boyle, Kristen Wilson, Norm Macdonald, Kyla Pratt, Raven-Symoné, Richard Schiff, Jeffrey Tambor, Royce D. Applegate, Albert Brooks, Hamilton Camp, Ellen DeGeneres, Jeff Doucette, Brian Doyle-Murray, Jenna Elfman, Eddie Frierson, Gilbert Gottfried, Archie Hahn, Julie Kavner, John Leguizamo, Jonathan Lipnicki, Kerrigan Mahan, Phil Proctor, Paul Reubens, Chris Rock, Reni Santoni, Garry Shandling, Tom Towles, Jim Dean, Chad Einbinder, Phyllis Katz || Comedy, Family || Live action"]}, {"page": "List of folk musicians", "response": ["*Hamilton Camp"]}, {"page": "1990 in film", "response": ["| Dick Tracy || Touchstone Pictures || Warren Beatty (director); Jim Cash, Jack Epps Jr. (screenplay); Warren Beatty, Madonna, Al Pacino, Glenne Headly, Charlie Korsmo, James Keane, Seymour Cassel, Michael J. Pollard, Charles Durning, Dick Van Dyke, Frank Campanella, Kathy Bates, Dustin Hoffman, William Forsythe, Ed O'Ross, James Tolkan, Mandy Patinkin, R. G. Armstrong, Henry Silva, Paul Sorvino, James Caan, Catherine O'Hara, Mike Hagerty, Arthur Malet, Bert Remsen, Jack Kehoe, Mary Woronov, Estelle Parsons, Hamilton Camp, Bing Russell, Robert Costanzo, Marshall Bell, Allen Garfield, John Schuck, Charles Fleischer, Walker Edmiston, John Moschitta Jr., Neil Ross, Colm Meaney, Mike Mazurki, Ian Wolfe, Chuck Hicks, Neil Summers, Stig Eldred, Lawrence Steven Meyers, Robert Beecher, Rita Bland, Lada Boder, Dee Hengstler, Liz Imperio, Michelle Johnston, Karyne Ortega, Karen Russell, Lew Horn, Michael Donovan O'Donnell, Jim Wilkey || Action || Live action"]}, {"page": "1989 in film", "response": ["| The Little Mermaid || Walt Disney Pictures || Ron Clements, John Musker (directors/screenplay); Jodi Benson, Christopher Daniel Barnes, Pat Carroll, Samuel E. Wright, Jason Marin, Kenneth Mars, Buddy Hackett, Paddi Edwards, Ben Wright, Edie McClurg, Kimmy Robertson, Caroline Vasicek, Will Ryan, René Auberjonois, Gerrit Graham, J. D. Daniels, Rod McKuen, Malachi Pearson, Frank Welker, Jim Cummings, Hamilton Camp, Debbie Shapiro, Ed Gilbert, Charlie Adler, Jack Angel, Steve Bulen, Nancy Cartwright, Philip L. Clarke, Jennifer Darling, Gail Farrell, Donny Gerrard, Phillip Ingram, Anne Lockhart, Sherry Lynn, Patrick Pinney, Sally Stevens, Jackie Ward, Robert Weil, Susan Boyd, Allan Davies, Mitch Gordon, Willie Greene Jr., Linda Harmon, Walter S. Harrah, Luana Jackman, William A. Kanady, Edie Lehmann, Melissa MacKay, Guy Maeda, Lynn Dolin Mann, Arne B. Markussen, Mickie T. McGowan, Gene J. Merlino, Lewis Morford, Kathleen O'Connor, Marilyn Powell, Gloria G. Prosper, Michael Redman Jr., Robert Tebow, Rob Trow, Joe Turano, Bobbi White, Robert S. Zwirn || Musical, Fantasy, Family || Animation"]}, {"page": "1988 in film", "response": ["| Rockin' with Judy Jetson || Worldvision Enterprises / Hanna-Barbera Productions || Paul Sommer, Ray Patterson (directors); Charles M. Howell IV, Kevin Hopps (screenplay); Janet Waldo, George O'Hanlon, Daws Butler, Penny Singleton, Don Messick, Jean Vander Pyl, Mel Blanc, Rob Paulsen, Ruth Buzzi, Pat Musick, Charlie Adler, Pat Fraley, Michael Bell, Steve Bulen, Hamilton Camp, Peter Cullen, B.J. Ward, Beau Weaver, Cindy McGee, Selette Cole, P. L. Brown, Eric Suter || Adventure, Comedy || Animation", "| Scooby-Doo and the Ghoul School || Worldvision Enterprises / Hanna-Barbera Productions / Wang Film Productions || Charles A. Nichols, Ray Patterson (directors); Glenn Leopold (screenplay); Don Messick, Casey Kasem, Glynis Johns, Susan Blu, Pat Musick, Russi Taylor, Marilyn Schreffler, Patty Maloney, Frank Welker, Ronnie Schell, Ruta Lee, Remy Auberjonois, Hamilton Camp, Jeff B. Cohen, Aaron Lohr, Scott Menville, Bumper Robinson, Andre Stojka, Zale Kessler || Comedy, Mystery || Animation", "| Scooby-Doo and the Reluctant Werewolf || Worldvision Enterprises / Hanna-Barbera Productions || Ray Patterson (director); Jim Ryan (screenplay); Don Messick, Casey Kasem, Hamilton Camp, B.J. Ward, Rob Paulsen, Frank Welker, Alan Oppenheimer, Pat Musick, Ed Gilbert, Jim Cummings, Joan Gerber, Brian Stokes Mitchell || Comedy, Mystery || Animation "]}, {"page": "1987 in film", "response": ["| Scooby-Doo Meets the Boo Brothers || Worldvision Enterprises / Hanna-Barbera Productions || Paul Sommer, Carl Urbano, Ray Patterson (directors); Jim Ryan (screenplay); Don Messick, Casey Kasem, Sorrell Booke, Rob Paulsen, Ronnie Schell, Jerry Houser, Arte Johnson, Victoria Carroll, William Callaway, Michael Rye, Hamilton Camp, June Foray || Comedy, Mystery || Animation", "| The Jetsons Meet the Flintstones || Worldvision Enterprises / Hanna-Barbera Productions || Don Lusk, Ray Patterson (directors); Don Nelson, Arthur Alsberg (screenplay); George O'Hanlon, Henry Corden, Penny Singleton, Jean Vander Pyl, Don Messick, Mel Blanc, Julie McWhirter, Janet Waldo, Daws Butler, John Stephenson, Jon Bauman, Hamilton Camp, Frank Welker, Brenda Vaccaro, Patric Zimmerman, Howard Morris, Catherine Thompson || Comedy || Animation"]}, {"page": "1993 in film", "response": ["| Attack of the 50 Ft. Woman || HBO Pictures || Christopher Guest (director); Joseph Dougherty, Mark Hanna (screenplay); Daryl Hannah, Daniel Baldwin, William Windom, Christi Conaway, Paul Benedict, O'Neal Compton, Victoria Haas, Frances Fisher, Lewis Arquette, Xander Berkeley, Hamilton Camp, Richard Edson, Hilary Shepard Turner, Barry Watson || Comedy, Sci-Fi || Live action"]}, {"page": "1985 in film", "response": ["| Copacabana || CBS / Dick Clark Productions || Waris Hussein (director); James Lipton (screenplay); Barry Manilow, Annette O'Toole, Estelle Getty, James T. Callahan, Andra Akers, Silvana Gallardo, Joseph Bologna, Ernie Sabella, Cliff Osmond, Dwier Brown, Hamilton Camp, Stanley Brock, Clarence Felder, Lonnie Burr, Whitney Rydbeck, Robert Broyles, Carole Meyers, Artie Butler || Musical || Live action"]}, {"page": "1984 in film", "response": ["| Meatballs Part II || Tri-Star Pictures || Ken Wiederhorn (director); Bruce Franklin Singer (screenplay); Richard Mulligan, Hamilton Camp, John Mengatti, Kim Richards, Archie Hahn, Misty Rowe, John Larroquette, Paul Reubens, Joe Nipote, Jason Hervey, Elayne Boosler, Nancy Glass, Felix Silla, Joaquin Martinez, Donald Gibb, Blackie Dammett, Jason Luque || Comedy || Live action", "| No Small Affair || Columbia Pictures || Jerry Schatzberg (director); Craig Bolotin (screenplay); Jon Cryer, Demi Moore, George Wendt, Peter Frechette, E. G. Daily, Ann Wedgeworth, Jeffrey Tambor, Tim Robbins, Hamilton Camp, Scott Getlin, Judith Baldwin, Jennifer Tilly, Kene Holliday, Tate Donovan, Thomas Adams, Myles Berkowitz, Arthur Taxier || Comedy, Drama || Live action", "| City Heat || Warner Bros. / The Malpaso Company || Richard Benjamin (director); Blake Edwards (\"Sam O. Brown\"), Joseph C. Stinson (screenplay); Clint Eastwood, Burt Reynolds, Jane Alexander, Madeline Kahn, Rip Torn, Irene Cara, Richard Roundtree, Tony Lo Bianco, William Sanderson, Nicholas Worth, Robert Davi, Art LaFleur, Jack Nance, Tab Thacker, John Hancock, Jack Thibeau, Gerald S. O'Loughlin, Bruce M. Fischer, Ernie Sabella, Carey Loftin, Hamilton Camp, Gene LeBell, Nick Dimitri, Arthur Malet, Beau Starr, Wiley Harker || Action, Crime, Comedy || Live action", "*Meatballs Part II, starring Richard Mulligan, Hamilton Camp, John Mengatti, Kim Richards, Archie Hahn, Misty Rowe, John Larroquette, Paul Reubens, Joe Nipote, Jason Hervey, Elayne Boosler, Nancy Glass, Felix Silla, Donald Gibb"]}, {"page": "1983 in film", "response": ["| Twice Upon a Time || Warner Bros. / Korty Films / Lucasfilm / The Ladd Company || John Korty, Charles Swenson (directors/screenplay); Suella Kennedy, Bill Couturié (screenplay); Lorenzo Music, Julie Payne, James Cranna, Hamilton Camp, Marshall Efron, Paul Frees, Judith Kahan Kampmann || Fantasy, Comedy || Animation", "| Under Fire || Orion Pictures || Roger Spottiswoode (director); Ron Shelton, Clayton Frohman (screenplay); Nick Nolte, Gene Hackman, Joanna Cassidy, Jean-Louis Trintignant, Richard Masur, Ed Harris, René Enriquez, Hamilton Camp, Eloy Casados, Jenny Gago, Alma Martínez, Jorge Zepeda || Thriller || Live action"]}, {"page": "1982 in film", "response": ["| Evilspeak || Moreno Films / Warner Bros. / Leisure Investment Company / Coronet Film || Eric Weston (director/screenplay); Joseph Garofalo (screenplay); Clint Howard, R.G. Armstrong, Joseph Cortese, Claude Earl Jones, Haywood Nelson, Don Stark, Charles Tyner, Hamilton Camp, Loren Lester, Lenny Montana, Richard Moll, Louie Gravance, Jim Greenleaf, Lynn Hancock, Leonard D'John || Horror || Live action", "| Eating Raoul || 20th Century Fox International Classics / Quartet/Films Inc. || Paul Bartel (director/screenplay); Richard Blackburn (screenplay); Paul Bartel, Mary Woronov, Robert Beltran, Susan Saiger, Ed Begley Jr., Buck Henry, Edie McClurg, Richard Paul, Hamilton Camp, John Paragon, John Shearin || Black Comedy || Live action"]}, {"page": "1981 in film", "response": ["| All Night Long || Universal Pictures || Jean-Claude Tramont (director); W.D. Richter (screenplay); Gene Hackman, Barbra Streisand, Dennis Quaid, Diane Ladd, Kevin Dobson, William Daniels, Hamilton Camp, Terry Kiser, Charles Siebert, Vernee Watson, Annie Girardot, Ann Doran, Raleigh Bond, Jim Nolan, Judy Kerr, Marlyn Gates || Romance, Comedy || Live action", "| S.O.B. || Paramount Pictures / Lorimar Productions || Blake Edwards (director/screenplay); Julie Andrews, William Holden, Richard Mulligan, Stuart Margolin, Larry Hagman, Robert Vaughn, Marisa Berenson, Robert Webber, Shelley Winters, Robert Preston, Loretta Swit, Craig Stevens, Robert Loggia, Jennifer Edwards, Rosanna Arquette, John Lawlor, John Pleshette, Ken Swofford, Hamilton Camp, Paul Stewart, Benson Fong, Larry Storch, Virginia Gregg, Joe Penny, Erica Yohn, Colleen Brennan, Charles Lampkin, Gene Nelson, Mimi Davis, David Young, Byron Kane, Herb Tanney, Bert Rosario || Comedy || Live action"]}, {"page": "James Bond Jr.", "response": ["* Hamilton Camp — "]}, {"page": "Soap (TV series)", "response": ["* Elmore Tibbs (Hamilton Camp)—Mid-level mobster who runs a prostitution ring in town, blackmails Burt and Danny to force them to stop from shutting him down."]}, {"page": "DuckTales", "response": ["* Hamilton Camp as Fenton Crackshell/Gizmoduck (seasons 2–4). Additional voices in season 1"]}, {"page": "Dr. Johnny Fever", "response": ["Johnny also has a college-age daughter, Laurie (Patrie Allen), who visits him in season two's \"The Doctor's Daughter\" and briefly moves in with him.WKRP in Cincinnati episode   He later (season three's \"Three Days of the Condo\") gives his daughter the majority of his legal settlement – roughly one year's salary – from the Los Angeles station that fired him for saying \"booger\". There is some suggestion in one episode that he might still be in love with Laurie's mother, his first wife, Paula (Ruth Silveira), though they agree that their relationship is over, and Paula marries another man (Hamilton Camp) (season three's \"Till Debt Do Us Part\"). Johnny's second wife never makes an appearance. Their parting was not as amicable: she tried to kill Johnny with a Ronco Veg-O-Matic. At the end of an episode of The New WKRP in Cincinnati, Johnny implies to a stoner employee that he may be his illegitimate father, having met his mother at a Grateful Dead concert near the speakers."]}, {"page": "2005 in film", "response": ["| style=\"text-align:center;\"| 2 || Hamilton Camp || style=\"text-align:center;\"| 70 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "Felix Pappalardi", "response": ["*1967: Hamilton Camp – Here's to You"]}, {"page": "Adventures of the Gummi Bears", "response": ["*King Jean-Claude (voiced by Hamilton Camp) - The father of Princess Marie and the ruler of a fictionalized French kingdom allied to Dunwyn. His kingdom was once besieged by the Marquis de Bouillabaisse in \"May the Best Princess Win\"."]}, {"page": "S.O.B. (film)", "response": ["At first the studio executives are keen to unload the film onto Felix and recoup their investment, but when Sally goes through with the topless scene and the film seems a likely success, they plot to regain control. Using California's community property laws, they persuade Sally to sign a  distribution deal which also gives the studio the right to cut the film. An angry and deranged Felix tries to steal the film negatives from the studio's color lab vault. Armed with his son's water pistol, Felix takes the lab's manager (Hamilton Camp) hostage. Hysterical, Felix points the water pistol at police; the police shoot and kill Felix, believing the toy gun to be real.", "* Hamilton Camp as Lipschitz, an executive at Capitol Color Lab, where the negative of Night Wind is stored."]}, {"page": "Lois & Clark: The New Adventures of Superman", "response": ["Lex Luthor returned in one episode and other villains from the comics, such as The Prankster, Metallo, the Toyman and the criminal group known as Intergang, began to appear. This season also featured the debut of fan-favorite villain Tempus (Lane Davies) and H. G. Wells appeared as a time-traveler. Wells's younger self was played by Terry Kiser, and the older Wells was played by Hamilton Camp."]}, {"page": "Newport Folk Festival", "response": ["* 1965: Bob Dylan, The Paul Butterfield Blues Band, Joan Baez with Donovan, Peter, Paul & Mary, Gordon Lightfoot, Maybelle Carter, Pete Seeger, Memphis Slim and Willie Dixon, Oscar Brand, Richard and Mimi Fariña, Reverend Gary Davis, Son House, The New Lost City Ramblers, Theodore Bikel, Lightnin' Hopkins, Jean Ritchie, The Chambers Brothers, Hamilton Camp, Ian & Sylvia, Bill Monroe."]}, {"page": "Dick Tracy (1990 film)", "response": ["Estelle Parsons portrays Tess Trueheart's mother. Tony Epper plays Steve the Tramp. Hamilton Camp appears as a store owner and Bing Russell plays a Club Ritz patron. Robert Costanzo cameos as Lips Manlis' bodyguard, and Marshall Bell briefly appears as a goon of Big Boy Caprice who poses as an arresting officer to ensnare Lips. Allen Garfield, John Schuck, and Charles Fleischer make cameos as reporters. Walker Edmiston, John Moschitta Jr., and Neil Ross provide the voices of each radio announcer. Colm Meaney appears as a police officer at Tess Trueheart's home. Mike Mazurki (who played Splitface in the original Dick Tracy film) appears in a small cameo, as Old Man at Hotel. 93-year-old veteran character actor Ian Wolfe plays his last film role as \"Munger\"."]}, {"page": "Mighty Max (TV series)", "response": ["* Hamilton Camp –"]}, {"page": "Yōsuke Akimoto", "response": ["*Star Trek: Deep Space Nine (Leck (Hamilton Camp))"]}, {"page": "Foofur", "response": ["* Hamilton Camp "]}, {"page": "List of The Smurfs characters", "response": ["| Hamilton Camp (1981 series)Kenan Thompson (Movie 1 and 2)Ilse La Monaca (2021 series)", "|Hamilton Camp (1981 series)Davis Freeman (2021 series)", "| Hamilton Camp"]}, {"page": "2005 in music", "response": ["*October 2 – Hamilton Camp, singer, songwriter and actor, 70"]}, {"page": "Eating Raoul", "response": ["* Hamilton Camp as John Peck - Dishonest Wine Buyer"]}, {"page": "List of Halo characters", "response": ["High Prophets, or Hierarchs, are the supreme leaders of the theocratic Covenant. Upon assuming office, each Hierarch picks a new regnal name from a list of names of former Hierarchs, similar to the practice of some Orthodox Patriarchs.Staten, Joseph. Halo: Contact Harvest, pg 384. In Halo 2, there are shown to be only three; the Prophets of Truth, Mercy, and Regret (voiced by Michael Wincott, Hamilton Camp and Robin Atkin Downes in Halo 2, respectively; in Halo 3, Truth is voiced by Terence Stamp). The novel Halo: Contact Harvest reveals that these three Prophets, originally known as the Minister of Fortitude, the Vice-Minister of Tranquility, and the Philologist,Staten, Joseph. Halo: Contact Harvest, pg 383. plotted to usurp the throne of the Hierarchs; in the process, they hide the truth that humanity is descended from the Covenant gods, the Forerunners, believing that the revelation could shatter the Covenant. During the course of Halo 2, Regret attacks Earth, and then retreats to Delta Halo. There, he calls for reinforcements, but is killed by the Master Chief. Later, Mercy is attacked by the Flood on High Charity; Truth could have saved him, but left him to die so he could have full control over the Covenant. In Halo 3: ODST, Truth is seen inspecting some Engineers around the Forerunner construct near New Mombasa. In Halo 3, Truth also meets his demise at the hands of the Arbiter when the Prophet attempts to activate all the Halo rings from the Ark. His death becomes the culmination of the Covenant's downfall."]}, {"page": "Turn-On", "response": ["Turn-On's sole broadcast episode was shown on Wednesday, February 5, 1969, at 8:30 pm ET. Among the cast were Teresa Graves (who would join the Laugh-In cast that fall), Hamilton Camp, and Chuck McCann. The writing staff included Albert Brooks. The guest host for the first episode was Tim Conway, who also participated in certain sketches."]}, {"page": "Titus (TV series)", "response": ["| Christopher's girlfriend and later fiancé, with a dysfunctional family of her own. Both her parents – Nora (Susan Barnes) and Merritt (Hamilton Camp) — are alcoholics; her sister, Kim, is a sexually promiscuous drug addict with a wild teenage daughter [Amy] whom she hardly cares for; and her brother, Michael, is a criminal who is constantly beaten by his father. Erin put herself in denial when it comes to dysfunctionality, often convincing herself that everything is fine. She often puts herself in over her head and Christopher usually comes to her rescue. She often tries to mend the relationship between Christopher and Ken, but rarely gets far. She is the only girl that Ken likes and often is willing to do things for her. She is loving and caring but often is taken advantage of, causing her to sometimes do the exact opposite of what she really feels. She is based on Christopher Titus's then-wife Erin Carden."]}, {"page": "Pink Panther and Sons", "response": ["* Hamilton Camp"]}, {"page": "Teenage Mutant Ninja Turtles (1987 TV series)", "response": ["* Professor Cycloid (voiced by Hamilton Camp) – A crazed professor who stole Donatello's \"time stopper\" machine in an effort to take over the world."]}, {"page": "Barney Rubble", "response": ["Mel Blanc was the principal voice of Barney Rubble, although Daws Butler (who previously voiced Ned Morton, a mouse version of Ed Norton — the inspiration for Barney Rubble — in the Looney Tunes short The Honey-Mousers) briefly assumed the role while Blanc recovered from a car wreck.Mel Blanc  Butler also occasionally voiced Barney on records throughout the 1960s and 1970s. John Stephenson also voiced Barney on two occasions.FLINTSTONES FILMSTRIP SOUNDTRACK Barney Borrows a Book ALAN REED MEL BLANC and SALLY STRUTHERSThe Flintstones Driving Guide 1978 Filmstrip Audio Since Blanc's death, Frank Welker, Jeff Bergman, Joe Alaskey, Keith Scott, Stephen Stanton, Kevin Michael Richardson, Brad Abrell, Scott Innes, and Wally Wingert have all performed the role. Hamilton Camp voiced Barney in The Flintstone Kids."]}, {"page": "Aladdin (animated TV series)", "response": ["*Ayam Aghoul (voiced by Hamilton Camp)"]}, {"page": "Almost Heroes", "response": ["* Hamilton Camp as Pratt"]}, {"page": "Tom & Jerry Kids", "response": ["*Hamilton Camp"]}, {"page": "The Flintstone Kids", "response": ["* Hamilton Camp as Barney Rubble, Flab Slab"]}]}}