{"wiki_id": "http://www.wikidata.org/entity/Q323101", "itemLabel": "Mark Broom", "itemDescription": "British techno musician and DJ", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Broom", "wikipedia_page": {"main": "Mark Broom (born 6 May 1971) is a British techno DJ and music producer.", "link_mentions": [{"page": "Preaching to the Perverted (film)", "response": ["# Mark Broom – The Alien Spoke"]}, {"page": "Atomic Jam", "response": ["Atomic Jam has introduced many of the major and minor players on the techno scene to its clubbers, and is renowned for the quality of its resident DJs.  The current residents are Chris Finke and Mark Broom."]}, {"page": "Psychick Warriors ov Gaia", "response": ["*Mark Broom - Funked Up (PWoG remix)", "In 1993, The Drum Club remixed Exit 23 three times. The third one first appears on the Ov Biospheres and Sacred Grooves 1993 edition (released by Restless Records) and all of them were edited in the single Exit 23 (The Drum Club Remixes) The group had their track Kraak remixed by Plastikman, Coil and Mark Broom on PWOG Rejammed: Kraak Remixes."]}, {"page": "Baby Ford", "response": ["Peter Ford, better known as Baby Ford, is a British electronic music record producer, known particularly for his contributions to the birth of acid house. He has also released material under aliases with Mark Broom (Casino Classix, El Mal, Solcyc, & Perbec), Thomas Melchior (Soul Capsule & Sunpeople), and Eon (Minimal Man).", "Baby Ford, Eon, and Mark Broom continued their explorations into minimal electronic music throughout the 1990s and well into the next decade through the iFach, Pal-SL and Trelik Record labels. iFach Vol. 1 contained the first five releases on the iFach label."]}, {"page": "Steve Pickton", "response": ["Beside his solo work, he also collaborates with Mark Broom and Dave Hill as Kapé I'llmusier or Ted Howler Rhythm Combo."]}, {"page": "Fabric 53", "response": ["#  Mark Broom & James Ruskin - Hostage - Blueprint", "#  Mark Broom & James Ruskin - No Time Soon - Blueprint"]}, {"page": "Ibadan Records", "response": ["* Mark Broom"]}, {"page": "Motech Records", "response": ["Juncaj founded Motech Records \"in 2002 with my best friend Shawn Snell because we saw that electronic music, not only coming out of Detroit, but in general, was getting formulaic and somewhat predictable. We wanted to take the influences we had been exposed to and create something that was our own.\" Juncaj said he discovered that there were others producing music that was \"atypical\" to the Detroit sound. From there, Motech Records became an outlet to push boundaries without having to prove anything.Introducing... DJ3000 And His 10 Years Of Motech X Fabric Mix, 12 March 2012 Since the initial releases primarily focused on Juncaj's productions under the DJ 3000 moniker, the Motech Records roster has grown internationally to include artists such as Robert Hood, Ken Ishii, Samuel L Session and Mark Broom.", "* Mark Broom"]}, {"page": "Autechre discography", "response": ["| Mark Broom||Any No. Between 1 & 17 (Autechre remix)||1997||Angie Is a Shoplifter (EP)", "| Mark Broom||Any Number Between 1 & 17 (Autechre alt mix)||2005||Angie Revisited"]}, {"page": "Broom (surname)", "response": ["*Mark Broom (born 1971), British techno musician and DJ"]}, {"page": "Future Beat Alliance", "response": ["In 2011 Future Beat Alliance signed to Tresor and started performing live with various techno musicians, including Juan Atkins, Octave One, Mark Broom, Ivan Smagghe, Steve Rachmad, RedShape, and Vince Watson."]}, {"page": "Broom, Mark", "response": ["#redirectMark Broom"]}, {"page": "Eamonn Doyle", "response": ["Doyle worked in the independent music business for 15 years. Around 1993 he and others set up a recording studio in the basement of the building he lived in at 147 Parnell Street in Dublin's north inner city. Some of that music was released on the Dead Elvis indie record label he co-founded and ran. Doyle became a DJ, then founded the techno record label D1 Recordings (named after the postcode it was located in) in 1994 which released music by artists from Dublin and elsewhere. D1 Recordings also ran a recording studio (d1), record shop and, eventually, a distribution company (Dublin Distribution) all in the same Parnell Street building. D1 also ran a weekly club night on Saturday nights for over a decade. The label resurfaced in 2018 in preparation for their 25th anniversary vinyl boxset release. Ian Maleney wrote in The Irish Times in 2015 that \"D1 is considered one of the most important chapters in recent Irish music history\". Doyle also set up two subsidiary labels called D1aspora [Distributed via Submerge in Detroit] and DublinLondon with UK electronic music producer Mark Broom.  "]}, {"page": "D1 Recordings", "response": ["Doyle also set up two subsidiary labels called D1aspora [Distributed via Submerge in Detroit] and DublinLondon with UK electronic music producer Mark Broom.  ", "*Mark Broom (AKA Visitor)"]}, {"page": "Nic Fanciulli", "response": ["Fanciulli also secured a year-long residency on Radio 1 in 2005, hosting his own regular show throughout the year. In 2005, Nic launched a second record label, with Andy Chatterley, called Saved. The outlet launched with ‘Chancer/Drop The Beat’ under his alias Skylark presents Buick Project. Across over 100 releases the label has signed music from artists such as James Talk, Mark Broom, Mat Playford, Joel Mull, Andrea Oliva, Uner, Steve Rachmad, Yousef, Spencer Parker, Oxia and more. The label celebrated 100 releases in 2014 with a world tour including dates in Tel Aviv, Glasgow, Hollywood and Washington D.C.. Fanciulli now runs the label with his brother, Mark."]}, {"page": "Moon Boots (music producer)", "response": ["In 2020, remixes of Moon Boots' track \"Tied Up\" were released, including mixes from Kenny Dope and Mat Zo. Remixes of \"Clear,\" by Wookie and Garrett David were released March 24th. On May 13th, remixes of \"Juanita\" by Mark Broom and Bawrut were released. On June 19th, Moon Boots releases the EP Pure Moons Vol.1, and launched his label imprint Pure Moons. On July 29th, Moon Boots released Bimini Road Remixed, featuring remixes of all of the songs from his sophomore album from the likes of DJ Holographic, Oceans1985 (Tyler from Classixx), Dark Arts Club, DJ Clea, Crackazat, Soela, Tinlicker, and more. "]}]}}