{"wiki_id": "http://www.wikidata.org/entity/Q32308031", "itemLabel": "Hywel Davies", "itemDescription": "Jockey", "wikipedia_url": "https://en.wikipedia.org/wiki/Hywel_Davies_(jockey)", "wikipedia_page": {"main": "Hywel Davies is a retired Welsh professional National Hunt jockey. He rode for 16 years with 761 wins in the UK and he ended his riding career in 1994.", "link_mentions": [{"page": "Ladbrokes Trophy", "response": ["| Hywel Davies"]}, {"page": "Queen Mother Champion Chase", "response": ["| Hywel Davies"]}, {"page": "1985 in Wales", "response": ["*Horse racing – Hywel Davies wins the Grand National on \"Last Suspect\"."]}, {"page": "Bet365 Gold Cup", "response": ["| Hywel Davies"]}, {"page": "Finale Juvenile Hurdle", "response": ["|1982 || Primrolla  || Hywel Davies || David Nicholson"]}, {"page": "Close Brothers Handicap Chase", "response": ["|1983||Manton Castle||9||11-07||Hywel Davies||Josh Gifford"]}, {"page": "Betway Bowl", "response": ["| Hywel Davies"]}, {"page": "Reynoldstown Novices' Chase", "response": ["| Hywel Davies"]}, {"page": "Adonis Juvenile Novices' Hurdle", "response": ["| Hywel Davies"]}, {"page": "Liverpool Hurdle", "response": ["| Hywel Davies", "| Hywel Davies"]}, {"page": "1993 Cheltenham Gold Cup", "response": ["| Hywel Davies"]}, {"page": "Peterborough Chase", "response": ["| Hywel Davies"]}, {"page": "Wayward Lad Novices' Chase", "response": ["| Hywel Davies"]}, {"page": "Heroes Handicap Hurdle", "response": ["| Hywel Davies"]}, {"page": "Silver Trophy Chase", "response": ["| Hywel Davies"]}, {"page": "Johnny Henderson Grand Annual Chase", "response": ["| Hywel Davies"]}, {"page": "Topham Chase", "response": ["|1983||Tiepolino||11||10-04||Hywel Davies||Kevin Bishop"]}, {"page": "Horse racing in Wales", "response": ["Wales has produced several jockeys of note, including Jack Anthony who won the Grand National on three occasions (1911, 1915 and 1920), Hywel Davies who won it in 1985 and Carl Llewellyn who won the race in 1992 and again in 1998. Another notable Welsh jockey was Dick Francis, who was British jump racing Champion Jockey in the 1953-54 season and was famous for riding Devon Loch when the horse slipped close to the winning post when leading the 1956 Grand National. In retirement Francis became a best-selling author of crime novels set in the racing world."]}, {"page": "List of Grand National winners", "response": ["| Hywel Davies"]}, {"page": "1992 Grand National", "response": ["|Hywel Davies"]}, {"page": "1981 Grand National", "response": ["|Hywel Davies"]}, {"page": "1990 Grand National", "response": ["|Hywel Davies"]}, {"page": "1991 Grand National", "response": ["Bonanza Boy was sent off as favourite despite having finished well beaten in his two previous attempts at the race. Under Peter Scudamore the horse had previously won the Welsh Grand National at Chepstow in 1988 and '89 but had pulled up in the most recent renewal when partnered by Hywel Davies. When reunited with Scudamore, Bonanza Boy bounced back by winning the Ansell's National Handicap Chase at Uttoxeter three weeks before the National. Scudamore took the ride at Aintree and was, jointly with Chris Grant, the most experienced rider in the race, both taking their eleventh National mounts. The favourite was never in contention, being well to the rear on the first circuit and always just out of reach of the leaders on the second. He picked his way through tired horses to earn fifth place. Bonanza Boy returned for a fourth attempt at the National in 1992 but his best days were behind him and he failed to complete the course for the first time. He also lined up for a fifth and final time in the void race of 1993 and retired from racing in 1994 spending his days opening fetes and local events before dying in 2011 at the age of 30.", "|Hywel Davies"]}, {"page": "1989 Grand National", "response": ["|Hywel Davies"]}, {"page": "1988 Grand National", "response": ["|Hywel Davies"]}, {"page": "1986 Grand National", "response": ["|Hywel Davies"]}, {"page": "1985 Grand National", "response": ["The race was won by eleven-year-old, 50/1 outsider, Last Suspect, ridden by Hywel Davies in a time of 9 minutes 42.7 seconds for a prize of £54,314. The winner was owned by Anne, Duchess of Westminster and trained by Captain Tim Forster in Letcombe Bassett, Oxfordshire.A Race Apart, Reg Green, 1987, Page 366", "The majority of the betting public put their faith in last year's champion Hallo Dandy at 14/1, Fethard Friend at 16/1, and Classified at 20/1 with Hill of Slain, Kumbi, Scot Lane, Broomy Bank, Rupertino, Tacroy and Talon considered the only others in the field capable of winning the race. Last Suspect was among those largely unconsidered at 50/1. In the company of Welsh jockey Hywel Davies he had developed a reputation as a stubborn horse and had pulled himself up in his last race. His owner, Anne, Duchess of Westminster, instantly decided to scratch her horse from the race, having never really wanted to run him in the first place, and when her decision was supported by trainer, Captain Tim Forster it took all of Davies' persuasive powers to convince them to give the horse his chance. The jockey was convinced that Aintree would suit the horse whose jumping and stamina were unquestioned.", "|Hywel Davies", "Twenty-five years after jockey Hywel Davies' win, his hometown of Cardigan in Mid Wales held a commemorative dinner to celebrate the anniversary of his Grand National victory. Champion jockey Peter Scudamore, who finished the race third on Corbiere, and Neale Doughty, who won the race in 1984, were among the guests at the dinner in February 2010. Davies said of the horse \"In the last race before the National, at Warwick, we went about halfway round and he just pulled up and as a result his owner nearly didn't run him at the National. He was a careful jumper and had never fallen. He got his blood up the day of the National and just went. I kept him out of traffic on the first circuit and just rode him home on the second circuit.\""]}, {"page": "1983 Grand National", "response": ["Spartan Missile had broken down badly after finishing second in the 1981 Grand National but impressed his backers when winning at Newbury earlier in the year. His former partner, John Thorne had died in a riding accident in 1982 so Hywel Davies took the ride. They were middle to rear throughout the race but still in a position capable of mounting a challenge when falling at Becher's second time.", "|Hywel Davies"]}, {"page": "1982 Grand National", "response": ["|Hywel Davies"]}, {"page": "Hywel Davies", "response": ["Hywel Davies may refer to:", "* Hywel Davies (broadcaster) (1919–1965), Welsh radio broadcaster and television interviewer", "* Hywel Davies (doctor) (1924–2016) cardiologist and writer", "* Hywel Davies (journalist), British fashion writer", "* Hywel Davies (rugby league) (born 1981), Welsh rugby league footballer and coach", "* Hywel Davies (jockey) (born 1957), Welsh jockey", "* Hywel Davies (footballer) (born 1902), Welsh international footballer"]}, {"page": "Planteur At Chapel Stud Handicap Chase", "response": ["| Hywel Davies"]}, {"page": "New Year's Day Hurdle", "response": ["|1981 || Celtic Ryde || 6 || Hywel Davies || Peter Cundell", "|1982 || Celtic Ryde || 7 || Hywel Davies || Peter Cundell"]}, {"page": "Sidney Banks Memorial Novices' Hurdle", "response": ["|1984||The Pawn||5||Hywel Davies||Mick Ryan"]}, {"page": "Jim Ford Challenge Cup", "response": ["|1982||Henry Bishop||9||11-11||Hywel Davies||Josh Gifford"]}, {"page": "Beaufort Hurdle", "response": ["|1979||Applalto||Hywel Davies||Roddy Armytage"]}, {"page": "Tim Forster", "response": ["Forster's third and final Grand National winner was Last Suspect, who was owned by the Duchess of Westminster. She had also owned Foinavon (winner of the 1967 Grand National, although she had sold Foinavon prior to his winning the Aintree Grand National] and Arkle (winner of the Cheltenham Gold Cup (1964, 1965, 1966). Last Suspect was said to be \"moody, unreliable, disinterested\". During the race at Warwick prior to the 1985 Grand National, the 11-year-old gelding pulled himself up. Forster and the Duchess of Westminster only ran him in the race at the insistence of his jockey Hywel Davies. Last Suspect won by 1 lengths in front of Mr Snugfit and the 1983 Grand National winner Corbiere coming in third.", "| Hywel Davies"]}, {"page": "Last Suspect", "response": ["During the race at Warwick prior to the 1985 Grand National, the 11-year-old gelding showed his stubborness as he pulled himself up. Forster and the Duchess of Westminster only ran him in the National at the insistence of his jockey Hywel Davies who was convinced Aintree would suit the horse whose jumping and stamina were very good. It proved to be the correct decision as Last Suspect won by 1 lengths in front of Mr Snugfit and the 1983 Grand National winner Corbiere coming in third.", "|Hywel Davies", "|Hywel Davies"]}]}}