{"wiki_id": "http://www.wikidata.org/entity/Q323773", "itemLabel": "Charles Beresford", "itemDescription": "Royal Navy admiral (1846-1919)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lord_Charles_Beresford", "wikipedia_page": {"main": "Charles William de la Poer Beresford, 1st Baron Beresford,  (10 February 1846 – 6 September 1919), styled Lord Charles Beresford between 1859 and 1916, was a British admiral and Member of Parliament.\nBeresford was the second son of John Beresford, 4th Marquess of Waterford, thus despite his courtesy title as the younger son of a Marquess, he was still eligible to enter the House of Commons. He combined the two careers of the navy and a member of parliament, making a reputation as a hero in battle and champion of the navy in the House of Commons. He was a well-known and popular figure who courted publicity, widely known to the British public as \"Charlie B\". He was considered by many to be a personification of John Bull, indeed was normally accompanied by his trademark, a bulldog.\nHis later career was marked by a longstanding dispute with Admiral of the Fleet Sir John Fisher, over reforms championed by Fisher introducing new technology and sweeping away traditional practices. Fisher, slightly senior to Beresford and more successful, became a barrier to Beresford's rise to the highest office in the navy. Beresford rose to occupy the most senior sea commands, the Mediterranean and Channel fleets, but failed in his ambition to become First Sea Lord.", "link_mentions": [{"page": "David Beatty, 1st Earl Beatty", "response": ["Beatty was given orders to join the China Station in January 1886, but the posting did not appeal to his mother, who wrote to Lord Charles Beresford, then a senior naval officer, member of parliament and personal friend, to use his influence to obtain something better.Beatty (1980), p. 14 Beatty was, in February 1886, instead appointed to , flagship of Admiral the Duke of Edinburgh, Queen Victoria's second son, who was Commander-in-Chief of the Mediterranean Squadron.Roskill, p. 22 This proved an excellent social opening for Beatty, who established a longstanding relationship with the Duke's eldest daughter, Marie, and with other members of the court. Alexandra was a three-masted sailing ship with auxiliary steam power, nonetheless, remaining flagship in a navy which was steadily transitioning from sail to steam. Life in the Mediterranean fleet was considerably easier than cadet life, with visits to friendly ports all around the Mediterranean, but Beatty was concerned to work diligently towards naval examinations, which would determine seniority and future promotion prospects.Beatty (1980), pp. 15, 21 Beatty was promoted to midshipman on 15 May 1886 and assigned to assist Lieutenant Stanley Colville on watchkeeping duties: Colville was to play an important part in Beatty's future career.Chalmers, p. 12"]}, {"page": "February 10", "response": ["*1846 – Lord Charles Beresford, Irish admiral and politician (d. 1919)"]}, {"page": "September 6", "response": ["*1919 – Lord Charles Beresford, English admiral and politician (b. 1846)"]}, {"page": "Edward VII", "response": ["In 1891 Edward was embroiled in the royal baccarat scandal, when it was revealed he had played an illegal card game for money the previous year. The Prince was forced to appear as a witness in court for a second time when one of the participants unsuccessfully sued his fellow players for slander after being accused of cheating.Hattersley, pp. 23–25; Ridley, pp. 280–290 In the same year Edward was involved in a personal conflict, when Lord Charles Beresford threatened to reveal details of Edward's private life to the press, as a protest against Edward interfering with Beresford's affair with Daisy Greville, Countess of Warwick. The friendship between the two men was irreversibly damaged, and their bitterness would last for the remainder of their lives.Middlemas, p. 86; Ridley, pp. 265–268 Usually, Edward's outbursts of temper were short-lived, and \"after he had let himself go ... [he would] smooth matters by being especially nice\".Sir Frederick Ponsonby, 1st Baron Sysonby, quoted in Middlemas, p. 188", "Edward involved himself heavily in discussions over army reform, the need for which had become apparent with the failings of the Second Boer War.Lee, vol. II, pp. 91–93; Ridley, p. 389 He supported the redesign of army command, the creation of the Territorial Force, and the decision to provide an Expeditionary Force supporting France in the event of war with Germany.Middlemas, pp. 130–134 Reform of the Royal Navy was also suggested, partly due to the ever-increasing Naval Estimates, and because of the emergence of the Imperial German Navy as a new strategic threat. Ultimately a dispute arose between Admiral Lord Charles Beresford, who favoured increased spending and a broad deployment, and the First Sea Lord Admiral Sir John Fisher, who favoured efficiency savings, scrapping obsolete vessels, and a strategic realignment of the Royal Navy relying on torpedo craft for home defence backed by the new dreadnoughts.See, principally,  For a much shorter summary of Fisher's reforms, see "]}, {"page": "Wentworth Woodhouse", "response": ["King George V and Queen Mary visited South Yorkshire from 8 to 12 July 1912, and stayed at Wentworth Woodhouse for four days. The house party consisted of a large number of guests, including: Dr Cosmo Gordon Lang, the then-Archbishop of York; The 5th Earl of Harewood and The Countess of Harewood; The Marchioness of Londonderry; The 1st Marquess of Zetland and Lady Zetland; The 10th Earl of Scarborough and Lady Scarborough; The 5th Earl of Rosse and Lady Rosse; Admiral Lord Charles Beresford and Lady Mina Beresford; Mr Walter Long and Lady Doreen Long; and Lord Helmsley and Lady Helmsley."]}, {"page": "Alfred, Duke of Saxe-Coburg and Gotha", "response": ["Prince Alfred remained in the navy, and was promoted to lieutenant on 24 February 1863, serving under Count Gleichen on the corvette .Heathcote, p. 9. He was promoted to captain on 23 February 1866 and was appointed to the command of the frigate  in January 1867. Lord Charles Beresford described him as having \"a great natural ability for handling a fleet\" and noted that he \"would have made a first-class fighting admiral.\"Julia P. Gelardi, From Splendor to Revolution, p.32"]}, {"page": "Naval Intelligence Division (United Kingdom)", "response": ["The NID staff were originally responsible for fleet mobilisation and war plans as well as foreign intelligence collection; thus in the beginning there were originally two divisions: (1) intelligence (Foreign) and (2) Mobilisation. In 1900 another division, War, was added to deal with issues of strategy and defence, and in 1902 a fourth division, Trade, was created for matters related to the protection of merchant shipping. The Trade Division was abolished in October 1909 in the wake of the Committee of Imperial Defence inquiry into the feud between the First Sea Lord, Admiral Sir John Fisher and former Commander-in-Chief Channel Fleet, Admiral Lord Charles Beresford, when it was discovered that the captain heading the Trade Division had been supplying the latter with confidential information during the inquiry."]}, {"page": "Prince Louis of Battenberg", "response": ["After less than six months in post his flag was transferred to the battleship  in August 1907. The following year, he was promoted to vice-admiral, and appointed as Commander-in-Chief, Atlantic Fleet. Historian Andrew Lambert described Battenberg as a sea-going admiral as \"more cerebral than the average, although somewhat lazy. The [fleet] exercises had a greater sense of realism, reflecting the latest thinking on weapons and strategy.\" In 1909, he published a translation of Commander Vladimir Semenoff's Rasplata (The Reckoning), a memoir of the Russo-Japanese War of 1904–05, and witnessed the first crossing of the English Channel by air by Louis Blériot.Kerr, pp. 230–231 He was appointed as commander of the newly constituted Third and Fourth Divisions of the Home Fleet two years later. The years immediately preceding this appointment were marred by disagreements between Admirals Sir John Fisher and Lord Charles Beresford over the direction of the navy and the imposition of reforms. Louis largely supported Fisher's modernising efforts, although he disapproved of his methods, and as a result Fisher's opponents attempted to prevent Louis's promotions.Hough, pp. 237–239", "Anti-German sentiment rose among the British public, in newspapers, and in elite gentlemen's clubs, where resentment was inflamed by Admiral Lord Charles Beresford despite Churchill's remonstrances.Hough, pp. 302–303 Driven by public opinion, Churchill asked Prince Louis to resign as First Sea Lord on 27 October 1914.Hough, p. 307 When acceptance of Battenberg's resignation was delayed by the King's opposition to the appointment of Fisher in his place, Louis wrote to Churchill, \"I beg of you to release me. I am on the verge of breaking down & I cannot use my brain for anything\".Hattendorf, p. 87 On 13 November he wrote to Churchill's Naval Secretary, Rear-Admiral Horace Hood, \"It was an awful wrench, but I had no choice from the moment it was made clear to me that the Government did not feel themselves strong enough to support me by some public pronouncement.\"Quoted in Goldrick, p. 155"]}, {"page": "John Fisher, 1st Baron Fisher", "response": ["Lord Hankey, then a marine serving under Fisher, later commented, \"It is difficult for anyone who had not lived under the previous regime to realize what a change Fisher brought about in the Mediterranean fleet. ... Before his arrival, the topics and arguments of the officers messes ... were mainly confined to such matters as the cleaning of paint and brasswork. ... These were forgotten and replaced by incessant controversies on tactics, strategy, gunnery, torpedo warfare, blockade, etc. It was a veritable renaissance and affected every officer in the navy.\" Charles Beresford, later to become a severe critic of Fisher, gave up a plan to return to Britain and enter parliament, because he had \"learnt more in the last week than in the last forty years.\"", "He was a driving force behind the development of the fast, all-big-gun battleship, and chaired the Committee on Designs which produced the outline design for the first modern battleship, . His committee also produced a new type of cruiser in a similar style to Dreadnought with a high speed achieved at the expense of armour protection. This became the battlecruiser, the first being . He also encouraged the introduction of submarines into the Royal Navy, and the conversion from a largely coal-fuelled navy to an oil-fuelled one. He had a long-running public feud with another admiral, Charles Beresford."]}, {"page": "Marquess of Waterford", "response": ["Several other members of the Beresford family have also gained distinction. John Beresford, fifth son of the first Earl, was an influential statesman. Marcus Beresford, eldest son of John Beresford, represented Dungarvan in the Irish Parliament. His second son was the Conservative politician William Beresford, who was the father of Mostyn Beresford (1835–1911), a Lieutenant-General in the Army, and of Edward Marcus Beresford (1836–1896), a Major-General in the Army. The Right Reverend George Beresford, second son of John Beresford, was Bishop of Kilmore. His son the Most Reverend Marcus Beresford was Archbishop of Armagh. He was the father of George Beresford, a politician, and of Major Henry Marcus Beresford, who was the father of the photographer George Charles Beresford. John Claudius Beresford, third son of John Beresford, was a politician. William Beresford, seventh son of the first Earl, was Archbishop of Tuam and was created Baron Decies in 1812. Lord John Beresford, second surviving son of the first Marquess, was Archbishop of Armagh. Lord George Beresford, younger son of the first Marquess, was a politician. William Beresford, illegitimate son of the first Marquess, was a Field Marshal in the British Army and was created Viscount Beresford in 1823. John Beresford, illegitimate son of the first Marquess, was a soldier and politician and was created a baronet in 1814 (see Beresford-Peirse baronets). Lord Charles Beresford, second son of the fourth Marquess, was a naval commander and politician and was created Baron Beresford in 1916. Lord William Beresford, third son of the fourth Marquess, was a soldier and recipient of the Victoria Cross. Lord Marcus Beresford, fourth son of the fourth Marquess, was a courtier."]}, {"page": "List of United Kingdom MPs: B", "response": ["* Lord Charles Beresford (1874–1880), (1885–1889), (1898–1900), (1902–1903), (1910–1916)"]}, {"page": "HMS King Edward VII", "response": ["On 5 March, King Edward VII was recommissioned as flagship of Admiral Lord Charles Beresford, Commander-in-Chief, Channel Fleet. She underwent another refit at Portsmouth in 1907–1908. During this refit, her 12-pounders returned to their original locations, and the 3-pounders on her bridge were removed. Under a fleet reorganisation on 24 March 1909, the Channel Fleet became the 2nd Division, Home Fleet. Accordingly, King Edward VII was recommissioned as the Flagship, Vice Admiral, Home Fleet on 27 March. She underwent a refit at Portsmouth from December to February 1910. She was recommissioned at Portsmouth on 1 August 1911 as the Flagship, Vice Admiral, Third and Fourth Divisions, Home Fleet."]}, {"page": "Warington Baden-Powell", "response": ["Robert Baden-Powell had founded the Scout Movement in 1907 with an experimental camp on Brownsea Island which had included boating activities. In 1909, a further experimental Scout camp was held at Buckler's Hard in Hampshire which included extended experience aboard the training ship TS Mercury, and in October 1910 The Boy Scouts Association authorised the establishment of a Sea Scout Branch. Robert asked his brother Warington to write a manual for Sea Scouts; this included the details of the new training scheme which Warington devised jointly with Lord Charles Beresford who had been appointed Chief Sea Scout. In June 1912, Sea Scouting and Seamanship for Boys was published. Warington himself admitted in his preface that the book could provide only an overview of boating skills required and perhaps for that reason, the Association published Seamanship for Scouts by Stuart Garnett shortly afterwards. However, Warington's book remained in print until 1949. The time pressures of Warington's legal career, and later the tuberculosis which led to his death in 1921, prevented Warington from taking a more active role in Sea Scouting."]}, {"page": "Stuyvesant Fish", "response": ["When Grand Duke Boris of Russia visited Newport, Mrs. Fish issued invitations for a dinner and ball in his honor; the night of the ball the Duke was detained by Mrs. Ogden Goelet, Mrs. Fish's rival as social leader, at whose home he was staying.\"Many women will rise up to fill my place, but I hope my influence will be felt in one thing, and that is, in discountenancing the undignified methods employed by certain women to attract a following.\" (Caroline Schermerhorn Astor). About 200 guests had assembled in the hall at Crossways, and when the hour for dinner approached and there was no sign of the Duke, Mrs. Fish  announced that the Duke was unable to come, but the Czar of Russia had agreed to be her guest. Suddenly the doors of the room were flung open and in walked His Imperial Majesty, dressed in his royal robes, wearing the Imperial Crown and carrying a scepter. The guests, including Senator Chauncey Depew, Pierpont Morgan, and Lord Charles Beresford, sank in a court curtsy, only to recover themselves with shrieks of laughter when they realized they were paying homage to Harry Lehr.Rhode Island: a Guide to the Smallest State, 1937. The anecdote is derived from Lady Decies, King Lehr and the Gilded Age. With Extracts from the Locked Diaries of Harry Lehr. (Philadelphia: Lippincott) 1935"]}, {"page": "Horace Hood", "response": ["During the Second Boer War, Hood was given command of transport ships taking supplies to South Africa. He was later transferred to Admiral Lord Charles Beresford's flagship  in the Mediterranean from 9 September 1901. In July 1903, Hood was given promotion to full captain and placed in command of , flagship of Admiral George Atkinson-Willes on the East Indies Station. In April 1904, Hood was given his first independent command as he led a force of 754 sailors, marines and soldiers of the Hampshire Regiment against the Ilig Dervishes of Somaliland. Landing his men on an opposed beach in the dark, Hood led from the front, personally engaging in hand-to-hand combat and driving the dervishes into the hinterland, for which he was awarded the Distinguished Service Order."]}, {"page": "Margot Asquith", "response": ["The two girls were inseparable, entering society together in London in 1881. She and Laura became the central female figures of an aristocratic group of intellectuals called \"The Souls\" (\"You are always talking about your souls,\" complained Lord Charles Beresford, thereby providing them with a suitable label). Laura married Alfred Lyttelton in 1885 and died in 1888, and Margot's life was strongly impacted by these events."]}, {"page": "HMS Prince of Wales (1902)", "response": ["The Director of Naval Construction, Sir William White, proposed a further pair of Londons to round out a tactical squadron of eight ships for the 1900 Naval Programme. After some hesitation, the Admiralty agreed, despite the ongoing construction of the smaller and faster . A controversy engendered by Rear-Admiral Lord Charles Beresford, second-in-command of the Mediterranean Fleet, about the retention of obsolete ironclads in the fleet in mid-1900 was largely responsible for the decision.Burt, pp. 215, 217 The two ships were virtually identical to the preceding London sub-class of the Formidables and are generally considered part of the FormidableGibbons, p. 151 or London class,Chesneau & Kolesnik, p. 37Parkes, p. 408 but the difference in the distribution of their 12-pounder  guns, their lower displacement, and their later construction than the Duncans lead some authors to view them as constituting a Queen class separate from the Formidable and London classes.Burt, pp. 215–228"]}, {"page": "Edward Walter Eberle", "response": ["Eberle next served as gunnery officer on the battleship  in 1901 and 1902. In September 1902, Eberle became aide to the commandant of the New York Navy Yard, Rear Admiral Barker. In his short time in New York, he was temporarily detailed to serve as aide to British Admiral Lord Charles Beresford during his visits to New York in September and January. In October, he served in like capacity for the Crown Prince of Siam's visit there. In April 1903, Rear Admiral Barker became Commander in Chief of the Atlantic Fleet, and brought Eberle along to again serve as his flag lieutenant. During this two-year assignment, Eberle assisted in installing the first wireless telegraphs on naval vessels, and developed the early procedures and practical uses of the new communication equipment."]}, {"page": "Mediterranean Fleet", "response": ["| align = left | Admiral Lord Charles BeresfordNavy List July Dec 1906"]}, {"page": "The Souls", "response": ["The name reportedly came from Lord Charles Beresford, who said: \"You all sit and talk about each other's souls—I shall call you the 'Souls'\"."]}, {"page": "HMS Bulwark (1899)", "response": ["Bulwark was recommissioned on 3 January 1905 with Commander Edward Philpotts as the acting fleet captain and departed on 5 January for Malta where she arrived on the 12th where Domville rehoisted his flag. On 9 June, the ship arrived at Genoa, Italy, where Domville hauled his flag down again and Captain Osmond Brock relieved Philpotts. Two days later, she arrived in Malta where Admiral Lord Charles Beresford hoisted his flag aboard as Commander-in-Chief of the Mediterranean Fleet. Bulwark began a lengthy refit at Malta on 30 October that lasted until 5 February 1906; the work included the addition of spotting tops equipped with  Barr & Stroud coincidence rangefinders.Ball, pp. 354, 369; Friedman, p. 276 On 10 February, the ship departed for Lagos, Portugal, to rendezvous with the Channel and Atlantic Fleets for manoeuvres that lasted the rest of the month. The annual manoeuvres that began on 24 June were designed to evaluate the effectiveness of a strategy of commerce raiding as Bulwark was the flagship of the fleet blockading Lagos before the general fleet action began three days later.Ball, pp. 369–370 In 1906–1907, all the main-deck 12-pounders were repositioned on the superstructure.Burt, p. 219; Friedman, p. 276"]}, {"page": "Hugh Evan-Thomas", "response": ["In November 1900, Evan-Thomas was appointed to his first independent command, the cruiser HMS Pioneer, which was part of the Mediterranean fleet, at age 38. The fleet was now commanded by Admiral John Fisher. After two years he was promoted to captain on 26 June 1902, and again transferred to  for service at the Admiralty. The following year he was chosen as flag captain for Vice-Admiral Lord Charles Beresford in the channel squadron, commanding  1903–1904 and  1904–1905. Beresford was acquainted with Evan-Thomas before the appointment, having sought advice from him on the new signal book when himself appointed second in command of the Mediterranean squadron in January 1900. Evan-Thomas was his second choice when he could not get Captain Percy Scott.Gordon, pp. 321–322."]}, {"page": "Lord William Beresford", "response": ["Beresford was born on 20 July 1847.  He was the third son of the Church of Ireland minister John Beresford, 4th Marquess of Waterford and his wife, the former Christiana Leslie. His eldest brother, John Beresford, became the 5th Marquess of Waterford and his second brother, Admiral Charles Beresford, became the 1st Baron Beresford. His younger brother, Lord Marcus Beresford, was a prominent equerry and racing manager."]}, {"page": "HMS Victoria (1887)", "response": ["It was established that the ship would have been in no danger had her watertight doors been closed in time. Bourke was found blameless, since the collision was due to Admiral Tryon's explicit order but the judgement carried an implied criticism of Rear-Admiral Markham. Winsloe complained afterwards that he had not been permitted to properly make his case, and that there was more than enough evidence to convict Markham and others of his crew of negligence. Back in England, confusion reigned in the press as to whether the findings about Markham were an indictment or not, and whether or not it was the duty of an officer to disobey a dangerous order. The Saturday Review commented, \"the court has evaded the real point with a slipperiness (for we cannot say dexterity) not wholly worthy of the candour we expect from officers and gentlemen.\" Captain Gerald Noel of Nile, who had given evidence critical of Camperdowns actions, wrote to Markham observing that things might have turned out better had he been on any ship other than Camperdown, and that in his opinion Captain Johnstone was incompetent. Charles Beresford and Admiral of the Fleet Sir Geoffrey Phipps Hornby published a joint letter in the United Service Gazette that: \"Admiral Markham might have refused to perform the evolution ordered, and the Victoria might have been saved. Admiral Markham, however, would have been tried by court-martial, and no one would have sympathised with him as it would not have been realized that he had averted a catastrophe. Unconditional obedience is, in brief, the only principle on which those in service must act.\" This contrasted with a statement contained in the official signal book; \"Although it is the duty of every ship to preserve as correctly as possible the station assigned to her, this duty is not to be held as freeing the captain from the responsibility of taking such steps as may be necessary to avoid any danger to which she is exposed, when immediate action is imperative and time or circumstance do not admit of the Admiral's permission being obtained.\"Gordon pp. 275–283.", "The first is that Tryon was mistaken in the orders which he gave. It has variously been suggested that he might have been ill or indisposed in some way, supported by his curt comments to officers who queried him at the time, and his apparent inattention to the results when the manoeuvre commenced. Alternatively, that he was of sound mind, but mistook the turning circle of the ships involved. It has been suggested that a much more frequent manoeuvre was a turn of 90°, for which a space allowance of two cables per ship would have been correct. On this basis, the ships would have completed their turns inwards at a spacing of two cables, then re-traced their course to the correct point to turn to their final anchor positions. Whatever the possible reason for the initial mistake, some confirmation of this explanation comes from the reported statement of Lieutenant Charles Collins, who had been officer of the watch on Victoria at the time of the incident. Memoirs written by Mark Kerr related that Collins had confirmed to him that Tryon had admitted on the bridge that this was the mistake he had made.Gordon pp. 270–271. One historian has gone so far as to suggest that Tryon's incomprehensible letters to Lord Charles Beresford indicate that he \"was suffering from some deterioration of the brain; that his fatal error was no mental aberration such as is to be expected of the young and inexperienced, but the consequence of a disease which at times clouded and confused his judgement and ideas.\"Bennett. Charlie B.  p. 188."]}, {"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| Lord Charles Beresford"]}, {"page": "Charles Beresford", "response": ["#redirect Lord Charles Beresford"]}, {"page": "George Tryon", "response": ["Tryon claimed that he had first heard of the idea from Admiral Hopkins. Having become convinced of its importance he wrote an article explaining the idea in the 'United Service Magazine' of May 1890 as well as having pamphlets printed which he distributed to those likely to be interested.  The idea gave rise to an immense amount of discussion nationally. The Times came out against the idea of government intervention in commerce, arguing the important issue was not who paid for sunk ships, but having a navy capable of preventing them being sunk. It argued that the scheme was a diversion from this main objective and would simply provide a false sense of security.The Times, 5 September 1890 Many smaller papers took the same line, as did a number of naval officers including Lord Charles Beresford. Their concern was chiefly that a government might see the scheme as an alternative to a larger navy.Fitzgerald pp. 296–302"]}, {"page": "List of Lords Commissioners of the Admiralty", "response": ["**Lord Charles Beresford, Junior Naval Lord"]}, {"page": "Henry Chaplin, 1st Viscount Chaplin", "response": ["After losing his seat at Sleaford in the Liberal landslide of 1906, Chaplin was returned to the House of Commons at a by-election in May 1907 as member for Wimbledon. His opponent was the Independent Liberal candidate, Bertrand Russell, who stood on a platform of women's suffrage. Chaplin was opposed to this, saying \"he might be very old-fashioned, but he drew the line at that\".Londonderry, Henry Chaplin, p. 178. His own campaign focused on Tariff Reform and Imperial Preference, imperial union and opposition to Irish Home Rule. In his election address for the January 1910 general election, Chaplin supported the proposals of Lord Roberts and Lord Charles Beresford on national defence, and reiterated his support for Tariff Reform.Londonderry, Henry Chaplin, p. 179."]}, {"page": "Battle of Abu Klea", "response": ["The Desert Column arrived on the salient overlooking the wadi of Abu Klea not long before sunset, and Stewart decided not to attack that night. The British built a defensive position (or zariba), but were sniped at from the high ground around them by Mahdist rifle-units - mainly soldiers from southern Sudan - all night. They took several casualties. At first light Stewart ordered them to form a square, which they achieved with perfect discipline, though still under fire from enemy snipers. The square moved slowly towards the wells along the side of the wadi, over very difficult, undulating, rocky ground. Suddenly the square was ambushed by a huge Mahdist force that had been concealing itself in the wadi. The British guns were on the leading face of the square, and the Naval Brigade, with their Gardner machine gun, at the rear left hand corner, nearest the wadi. Several officers and men of HMS Alexandra were killed at the battle. As the British halted to repel the Mahdist force, a gap opened up towards the rear left corner of the square. This was caused when Captain Lord Charles Beresford RN, commanding the Naval Brigade, ordered the Gardner gun to be run out on the left flank of the infantry square to provide covering fire. Colonel Frederick Gustavus Burnaby then gave an impromptu order for the Heavy Camel Regiment to wheel out of the square in support of the Gardner gun. The gun had been tested and found very reliable in Britain, but had not been tested in a desert with loose sand getting into its mechanism. It fired seventy rounds and then jammed, and as the crew tried to clear it they were cut down in a rush by the Dervishes. Out of the forty men in the Naval contingent, Lieutenants Alfred Piggott and Rudolph de Lisle were killed along with Chief Boatswain's Mate Bill (Billy) Rhodes and five other seamen and seven more were wounded. Beresford was 'scratched' on the left hand by a spear as he managed to duck under the gun. The weight of the rush pushed the sailors back into the face of the square. Several Dervishes got inside the square, but found the interior full of camels and could not proceed. The troops in the rear ranks faced about and opened fire into the press of men and camels behind them, and were able to drive the Dervishes out of the square and compel them to retreat from the field."]}, {"page": "Trafalgar-class ironclad", "response": ["When they were built, many observers overestimated the vulnerability of large ships to torpedoes and the perceived inability to avoid them, which made them believe that large warships would inevitably be replaced by smaller, less vulnerable, and less valuable, vessels.Hansard HC Deb 10 June 1886 vol 306 cc1322-425George Shaw-Lefevre said in Parliament on 10 June 1886: \"Admiral Sir Cooper Key, writing to The Times a few days ago in reference to these ships, said— 'I believe the time is approaching, indeed, is already arrived, when no more iron-clad ships will be laid down.' During the last two years other Naval Powers of Europe have, with one exception, ceased to build ships with their sides protected with armour; and even the noble and gallant Lord the Member for Marylebone (Lord Charles Beresford)... said, a few nights ago, that— 'He would not urge that the country should invest any more money in heavy iron-clads, because France had left off building any more—she had even left off building the two large iron-clads which had been begun [the Brennus and Charles Martel].' At the same time, there is a general consensus of opinion amongst naval men, and amongst men who are acquainted with the state of the Navy, that the chief want of the Navy at the present moment lies in fast vessels which are fit and proper for the protection of our commerce.\" For example, John Hibbert, the parliamentary secretary of the Admiralty, told Parliament in March 1886: \"I think I may safely say that these two large iron-clads will probably be the last iron-clads of this type that will ever be built in this or any other country. In France they are ceasing to go on with the construction of large iron-clads.\"Hansard HC Deb 18 March 1886 vol 303 cc1184-286 In fact it took the development of effective naval aircraft able to carry bombs and torpedoes in the years immediately preceding the Second World War nearly fifty years later to finally make this true."]}, {"page": "Littleton Waller", "response": ["The timely arrival of the ships of the European Squadron and their landing force gave protection to the American consulate and to American citizens and interests caught up in the fighting, and also afforded a refuge for the citizens of other nations, who had been displaced from their homes or businesses.  Advancing cautiously through the burning and rubble strewn streets, the Americans reached the Grand Square of Mehmet Ali, at the heart of the city. The American Consulate was there, and it became the headquarters of the force. Although the French troops had abandoned the city and cautiously returned to their ships, the Marines secured the Grand Square and began to patrol the streets of the European Quarter, as the international business and consular area was named.  Cochrane, Waller and their Marines were assigned to Lord Charles Beresford's British force for the protection of the European Quarter. The anticipated rebel counterattack never came, and a ten-day standoff ended with the arrival of the four thousand-man British relief force. According to the Times of London:", "Lord Charles Beresford states that without the assistance of the American Marines he would have been unable to discharge the numerous duties of suppressing fires, preventing looting, burying the dead, and clearing the streets."]}, {"page": "City of York (UK Parliament constituency)", "response": ["|Admiral Lord Charles Beresford ||Conservative"]}, {"page": "Charles Beresford, 1st Baron Beresford", "response": ["#Redirect Lord Charles Beresford"]}, {"page": "Daingean", "response": ["* Lord Charles Beresford (1846-1919), British admiral and politician; son of the 4th Marquess of Waterton, born in Philipstown."]}, {"page": "Daisy Greville, Countess of Warwick", "response": ["Lord Brooke succeeded to the earldom in 1893, and the family moved to Warwick Castle. The first and probably only legitimate child to the marriage was Leopold Guy (1882–1928), who later became the sixth earl of Warwick. Marjorie Blanche (1884–1964), born three years after the marriage, was Daisy's second child. Daisy, in a 1923 conversation with Basil Dean, the husband of Mercy, stated that Marjorie was fathered by Lord Charles Beresford. The third, Charles Algernon (1885–1887), died aged 16 months, and may too have been fathered by Charles Beresford.Anand, pp.38-39", "Lady Warwick had a passionate affair with Lord Charles Beresford and was outraged to learn of Lady Charles Beresford's pregnancy during this time. Questioning Lord Charles's loyalty to her, she dispatched a letter to him over the matter. Daisy was unaware that Lord Charles had instructed his wife to open his mail whilst he was away on campaign and thus Lady Charles became only too aware of what was going on. "]}, {"page": "Edward Linley Sambourne", "response": ["Lord Charles Beresford,"]}, {"page": "Charles William de la Poer Beresford, 1st Baron Beresford", "response": ["#redirectLord Charles Beresford"]}]}}