{"wiki_id": "http://www.wikidata.org/entity/Q3246292", "itemLabel": "Netherwood Hughes", "itemDescription": "British Army veteran", "wikipedia_url": "https://en.wikipedia.org/wiki/Netherwood_Hughes", "wikipedia_page": {"main": "Netherwood \"Ned\" Hughes (12 June 1900 – 4 April 2009) was one of the last two Tommies who served the United Kingdom during the First World War, along with Harry Patch, although Patch was the only one to have seen action. Hughes was also one of three British veterans still living in the country, with Patch and Henry Allingham being the other two. The Ministry of Defence has not confirmed his war service, but many First World War service records were destroyed in the Blitz during the Second World War. However the World War I Veterans Association invited him to the Cenotaph for the 90th Anniversary of the Armistice. He did not attend as his family felt that the journey would be too much for him.He was born in Great Harwood, the middle child of seven siblings to John, who worked as an optician, and Robina. He had three brothers: Charlie, Henry, and Sidney, who served in the Royal Navy on HMS Albion. Hughes spent most of his working life as a mechanic and driver and, in June 1918, he was called up, like every other driver in Great Britain, to perform that role in the British Army. While he was still in training the war ended, and he returned home to drive in a mill. He later became a bus driver. Hughes married twice, but never had any children, although he was frequently visited by his nephews at his care home, Woodlands Home for the Elderly in Clayton-le-Moors, where he spent most of his time in the grounds, smoking his pipe.When receiving a birthday card from the Queen each year since his 100th birthday, he commented: \"She has the same frock on\".In his final few weeks, Ned's health deteriorated and he had difficulty speaking for a week before his death, according to his niece, Ann Hutton. He died of natural causes on 4 April 2009, aged 108, at Woodlands. Speaking to the Accrington Observer, Mrs Hutton said, \"It’s not the family’s wishes for a military funeral. We don’t want bugles and whistles, we just want a simple family affair. He couldn’t stand any fuss on his birthdays.\"\n\n", "link_mentions": [{"page": "Accrington", "response": ["*Netherwood Hughes, World War I veteran, died in 2009, aged 108"]}, {"page": "1900", "response": ["* June 12 – Netherwood Hughes, British soldier and centenarian (d. 2009)"]}, {"page": "Manchester Regiment", "response": ["On the outbreak of war, the 1st battalion was part of the 8th (Jullundur) Brigade of the 3rd (Lahore) Indian Division, while the 2nd battalion was part of the 14th Brigade, 5th Division. One of the last surviving First World War veterans, Netherwood Hughes, served in the 51st Manchesters. Ned Hughes died 4 April 2009 aged 108.Report on Ned Hughes' death "]}, {"page": "Clayton-le-Moors", "response": ["* Netherwood Hughes (1900-2009), originally from Great Harwood, one of the last surviving veterans of World War I, died at the Woodlands Home for the Elderly in 2009, aged 108."]}, {"page": "Great Harwood", "response": ["* Netherwood Hughes (1900–2009), World War I veteran, was born in Lord Street."]}, {"page": "Harry Patch", "response": ["On 18 July 2009, with the death of Henry Allingham, Patch became the oldest surviving veteran and also the oldest man in the United Kingdom. Patch was the last trench veteran of World War I. The penultimate Western Front veteran, the 108-year-old Fernand Goux of France, who died on 9 November 2008, fought for 8 days. He came out unscathed, unlike Patch and the last Alpine Front veteran, 110-year-old Delfino Borroni of Italy, who died on 26 October 2008. Patch was also the last surviving Tommy, since the death on 4 April 2009 of Netherwood Hughes, who was still in training when the war ended. The last-but-one fighting Tommy, Harold Lawton, died on 24 December 2005. Claude Choules, the last remaining First World War naval veteran, died on 5 May 2011."]}, {"page": "Syd Lucas", "response": ["Sydney \"Syd\" Maurice Lucas (21 September 1900 – 4 November 2008) was, at age 108, one of three remaining British Tommies of World War I (along with Harry Patch and Netherwood Hughes), although the war ended before he was sent to fight."]}, {"page": "Deaths in April 2009", "response": ["*Netherwood Hughes, 108, British fourth-to-last veteran of World War I."]}]}}