{"wiki_id": "http://www.wikidata.org/entity/Q324098", "itemLabel": "Peter Taaffe", "itemDescription": "British activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Taaffe", "wikipedia_page": {"main": "Peter Taaffe (born April 1942) is a British Marxist (Trotskyist) political activist and journalist. He was the general secretary of the Socialist Party of England and Wales from its founding until 2020 and was a member of the International Executive Committee of the Committee for a Workers' International (CWI).Taaffe was the founding editor of the Trotskyist Militant newspaper in 1964, and became known as a leading member of the entryist Militant group. Taaffe was expelled from the Labour Party in 1983, along with four other members of Militant's editorial board\nTaaffe was influential in the policy decisions of Liverpool City Council of 1983–1987, according to the council's deputy leader Derek Hatton, in the formation of the Militant tendency's policy regarding the Poll Tax in 1988–1991, and the Militant tendency's \"open turn\" from the Labour Party in the late 1980s, becoming general secretary of Militant's eventual successor, the Socialist Party in 1997. He retired as general secretary after the party's February 2020 congress but remains on the party's executive committee as political secretary.", "link_mentions": [{"page": "1983 Bermondsey by-election", "response": ["Labour Party leader Michael Foot responded to Wellbeloved by denouncing Tatchell's article and declared \"the individual concerned is not an endorsed member of the Labour Party and as far as I'm concerned never will be\". Tony Benn wrote in his diary that many people, including himself, thought that Foot had confused Peter Tatchell with Peter Taaffe, then the leader of the Trotskyist Militant tendency, and Michael Crick in his book on Militant agrees that the fact that Tatchell and Taaffe have similar names contributed to public confusion between the two, despite the fact that Militant opposed Tatchell's candidacy due to anti-gay feeling and political differences between the old left (Militant) and new left (Tatchell) of the party. As to whether Tatchell was a member of the Labour Party itself, Foot later clarified that he meant to say \"endorsed candidate\" instead of \"endorsed member\" in his response to Wellbeloved.\"It must be clear from the context that what I wished to say was 'not an endorsed candidate' ...\". House of Commons Debates, 6th ser., vol. 14, col. 389, 3 May 1981. Quoted in Thomas-Symonds, 2005. At the next meeting of the Labour Party National Executive Committee, Tatchell was narrowly rejected as a candidate. Mellish was not reassured about the future direction of the Labour Party and resigned from it on 2 August 1982, a clear preliminary to resigning his seat, which he did by taking the Chiltern Hundreds on 1 November that year. The left wing of the Labour Party agreed Tatchell would be eligible for selection, and Tatchell was duly selected again in January 1983."]}, {"page": "Taaffe", "response": ["*Peter Taaffe (born 1942), British politician"]}, {"page": "Jimmy Deane", "response": ["After attempting to bring about an unsuccessful fusion between the RSL and the International Group as well as joint work with the International Socialists in the magazine Young Guard, Jimmy Deane suggested Peter Taaffe as his successor as General Secretary and editor of the soon to be launched Militant newspaper. He left Britain for India in 1965 and subsequently spent a few years in Fiji."]}, {"page": "Peter Taffe", "response": ["#redirect Peter Taaffe"]}, {"page": "Socialist Alternative (United States)", "response": ["* Trotsky's Relevance Today – by Peter Taaffe, Laurence Coates and Lynn Walsh (2000)", "* Peter Taaffe"]}, {"page": "Peter taffe", "response": ["#REDIRECT Peter Taaffe"]}, {"page": "Hannah Sell", "response": ["Hannah Sell (born 1971) is a British Marxist political activist. She is general secretary of the Socialist Party having been a member of the party and its predecessor, Militant, since the 1980s. Sell succeeded Peter Taaffe as general secretary in 2020. She was a member of the National Executive Committee of the Labour Party in 1988 and 1989, representing the Labour Party Young Socialists. She was national secretary of Youth against Racism in Europe (YRE) between 1992 and 1996."]}, {"page": "New Socialist Alternative (India)", "response": ["The CWI gained its first Indian supporters after their discussions with the group's executive committee member Peter Taaffe in 1977.Taaffe, P. (2004) A Socialist World Is Possible, CWI Publications: London"]}]}}