{"wiki_id": "http://www.wikidata.org/entity/Q325070", "itemLabel": "Simon Jones", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Jones_(actor)", "wikipedia_page": {"main": "Simon Jones (born 27 July 1950) is an English actor. He portrayed Arthur Dent, protagonist of Douglas Adams’s The Hitchhiker's Guide to the Galaxy on radio in 1978 and again on television in 1981. Jones also appeared in the film The Hitchhiker's Guide to the Galaxy (2005) in a cameo role. He also played the role of Donald Shellhammer in Miracle on 34th Street (1994), appeared in Brideshead Revisited as Lord Brideshead, and as King George V in the film Downton Abbey.", "link_mentions": [{"page": "Blackadder", "response": ["More established actors, some at the veteran stage of their careers, were also recruited for roles. These included Peter Cook, John Grillo, Simon Jones, Tom Baker, Jim Broadbent, Hugh Paddick, Frank Finlay, Kenneth Connor, Bill Wallis, Ronald Lacey, Roger Blake, Denis Lill, Warren Clarke and Geoffrey Palmer, who played Field Marshal Sir Douglas Haig in \"Goodbyeee\", the final episode of Blackadder Goes Forth. Miriam Margolyes played three different guest roles: The Spanish Infanta in The Queen of Spain's Beard, Lady Whiteadder in Beer, and Queen Victoria in Blackadder's Christmas Carol."]}, {"page": "Douglas Adams", "response": ["* The Salmon of Doubt (2002), unfinished novel manuscript (11 chapters), short stories, essays, and interviews (also available as an audiobook, read by Simon Jones)"]}, {"page": "July 27", "response": ["*1950 – Simon Jones, English actor"]}, {"page": "The Hitchhiker's Guide to the Galaxy", "response": ["In December 2011 a new stage production was announced to begin touring in June 2012. This included members of the original radio and TV casts such as Simon Jones, Geoff McGivern, Susan Sheridan, Mark Wing-Davey and Stephen Moore with VIP guests playing the role of the Book. It was produced in the form of a radio show which could be downloaded when the tour was completed. This production was based on the first four Fits in the first act, with the second act covering material from the rest of the series. The show also featured a band, who performed the songs \"Share and Enjoy\", the Krikkit song \"Under the Ink Black Sky\", Marvin's song \"How I Hate The Night\", and \"Marvin\", which was a minor hit in 1981.", " On Saturday 29 March 2014, Radio 4 broadcast an adaptation in front of a live audience, featuring many members of the original cast including Stephen Moore, Susan Sheridan, Mark Wing-Davey, Simon Jones and Geoff McGivern, with John Lloyd as the book.", "The 2004 series was produced by Above The Title Productions and the scripts were published in July 2005, with production notes for each episode. This second radio script book is entitled The Hitchhiker's Guide to the Galaxy Radio Scripts: The Tertiary, Quandary and Quintessential Phases. Douglas Adams gets the primary writer's credit (as he wrote the original novels), and there is a foreword by Simon Jones, introductions by the producer and the director, and other introductory notes from other members of the cast."]}, {"page": "Amadeus (play)", "response": ["In July 2006, the Los Angeles Philharmonic presented a production of portions from the latest revision of the play at the Hollywood Bowl. Neil Patrick Harris starred as Mozart, Kimberly Williams-Paisley as Constanze Mozart, and Michael York as Salieri. Leonard Slatkin conducted the Philharmonic Orchestra. Rupert Everett played Salieri in a production at the refurbished Chichester Festival Theatre from 12 July through 2 August 2014. The cast included Joshua McGuire as Mozart, Jessie Buckley as Constanze and John Standing as Count Orsini-Rosenberg. Simon Jones played Joseph II. Peter Shaffer attended the play at the closing performance."]}, {"page": "The Salmon of Doubt", "response": ["The UK edition includes an introduction by Stephen Fry, while the US edition includes one by Christopher Cerf. The audiobook edition consists of seven CDs, mostly read by Simon Jones, but also includes both of the introductions, read by their respective authors, as well as the tributes written and read by Richard Dawkins. US paperback editions have yet another introduction, written by Terry Jones, and omit some material due to issues with copyright."]}, {"page": "The Hitchhiker's Guide to the Galaxy: The Original Radio Scripts", "response": ["The book was reprinted in a 10th-year edition in 1995, and a 25th anniversary edition in 2003. The 25th anniversary edition contains a new introduction by Geoffrey Perkins, and newly researched material by M. J. Simpson, including a transcript of The Lost Hitchhiker Sketch. The sketch was an interview with Simon Jones in character as Arthur Dent, conducted by Sheila Steafel on her show Steafel Plus in 1982, written entirely by Adams. The sketch can be heard in the Douglas Adams at the BBC CD collection. The book now contains transcripts of all Hitchhikers radio sketches, barring a sketch for Marvin that Adams wrote for the BBC Radio 1 show Studio B15 to promote the television version of the serial, which was broadcast in 1982."]}, {"page": "Miracle on 34th Street", "response": ["A 1994 feature film starred Richard Attenborough, Elizabeth Perkins, Dylan McDermott, J. T. Walsh, Timothy Shea, James Remar, Jane Leeves, Simon Jones, William Windom and Mara Wilson. It was adapted by John Hughes from the Seaton script, and directed by Les Mayfield. Due to Macy's refusal to give permission to use its name, it was replaced by the fictitious \"Cole's\". \"We feel the original stands on its own and could not be improved upon,\" said Laura Melillo, a spokeswoman for Macy's. Gimbels no longer existed by 1994 so its name was replaced by the name of the fictional \"Shopper's Express\". Alvin Greenman (Alfred in the original version) played a doorman. The 1994 remake of the film had a more serious tone than the original 1947 film had and a large portion of the plot was rewritten, although the majority of both the plot and the characters remained intact. The 1994 film also added a subtext which described concerns about religious faith."]}, {"page": "Arthur Dent", "response": ["In the radio, LP and television versions of the story, Arthur is played by Simon Jones (not to be confused with Peter Jones, the voice of the Guide). In Ken Campbell's 1979 stage production, Chris Langham took the part. In the 2005 film adaptation, he is played by Martin Freeman. In The Illustrated Hitchhiker's Guide to the Galaxy, he is portrayed by Jonathan Lermit."]}, {"page": "Sam Waterston", "response": ["In 1977, he starred in an Off-Broadway production of William Shakespeare's Measure for Measure as Duke Vincentio alongside Meryl Streep and John Cazale at the Delacorte Theatre.  In 1980, he starred in Benefactors alongside Glenn Close, Mary Beth Hurt, and Simon Jones at The Brooks Atkinson Theatre on Broadway. In 1993, he portrayed Abraham Lincoln onstage in Abe Lincoln in Illinois where he received Tony Award, Drama Desk Award, and Outer Critics Circle Award nominations for his performance."]}, {"page": "1995 in film", "response": ["| 12 Monkeys || Universal Pictures || Terry Gilliam (director); David Peoples, Janet Peoples (screenplay); Bruce Willis, Madeleine Stowe, Brad Pitt, Christopher Plummer, David Morse, Jon Seda, Christopher Meloni, Frank Gorshin, Vernon Campbell, Lisa Gay Hamilton, Bob Adrian, Simon Jones, Carol Florence, Bill Raymond, Annie Golden, Thomas Roy, Joseph Melito || Sci-Fi || Live action"]}, {"page": "1996 in film", "response": ["| 12 Monkeys || Universal Pictures || Terry Gilliam (director); David Peoples, Janet Peoples (screenplay); Bruce Willis, Madeleine Stowe, Brad Pitt, Christopher Plummer, David Morse, Jon Seda, Christopher Meloni, Frank Gorshin, Vernon Campbell, LisaGay Hamilton, Bob Adrian, Simon Jones, Carol Florence, Bill Raymond, Annie Golden, Thomas Roy, Joseph Melito || Sci-Fi || Live action"]}, {"page": "1997 in film", "response": ["| The Devil's Own || Columbia Pictures || Alan J. Pakula (director); David Aaron Cohen, Vincent Patrick, Kevin Jarre (screenplay); Harrison Ford, Brad Pitt, Margaret Colin, Rubén Blades, Treat Williams, George Hearn, Mitchell Ryan, Natascha McElhone, Paul Ronan, David O'Hara, Simon Jones, Julia Stiles, Ashley Carin, Kelly Singer, Martin Dunne, Malachy McCourt || Action, Thriller || Live action"]}, {"page": "1994 in film", "response": ["| Miracle on 34th Street || 20th Century Fox / Hughes Entertainment || Les Mayfield (director); George Seaton, John Hughes (screenplay); Richard Attenborough, Elizabeth Perkins, Mara Wilson, Dylan McDermott, J.T. Walsh, Simon Jones, James Remar, Jane Leeves, William Windom, Robert Prosky, Allison Janney, Jack McGee || Fantasy || Live action"]}, {"page": "1986 in film", "response": ["| Club Paradise || Warner Bros. Pictures || Harold Ramis (director/screenplay); Brian Doyle-Murray (screenplay); Robin Williams, Peter O'Toole, Rick Moranis, Jimmy Cliff, Twiggy, Adolph Caesar, Eugene Levy, Joanna Cassidy, Andrea Martin, Brian Doyle-Murray, Joe Flaherty, Steven Kampmann, Robin Duke, Mary Gross, Simon Jones, Louise Bennett, Ansell \"Double Barrel\" Cousins, Earl \"Chinna\" Smith, Carey Lowell, Louis Zorich, Bruce McGill, Anne Ramis || Comedy || Live action"]}, {"page": "1985 in film", "response": ["| Brazil || 20th Century Fox (International) / Universal Pictures (United States) || Terry Gilliam (director/screenplay); Tom Stoppard, Charles McKeown (screenplay); Jonathan Pryce, Robert De Niro, Katherine Helmond, Ian Holm, Bob Hoskins, Michael Palin, Ian Richardson, Peter Vaughan, Kim Greist, Jim Broadbent, Brian Miller, Sheila Reid, Simon Nash, Barbara Hicks, Kathryn Pogson, Bryan Pringle, Derrick O'Connor, Elizabeth Spender, Derek Deadman, Nigel Planer, Charles McKeown, Ray Cooper, Gorden Kaye, John Pierce Jones, Ann Way, Myrtle Devenish, Simon Jones, Bill Wallis, Don Henderson, Howard Lew Lewis, Oscar Quitak, Harold Innocent, John Grillo, Patrick Connor, Roger Ashton-Griffiths, Jack Purvis, Andre Gregory, Terry Gilliam, Sue Hodge || Sci-Fi || Live action"]}, {"page": "1983 in film", "response": ["| Monty Python's The Meaning of Life || Universal Pictures || Terry Jones (director); Monty Python (screenplay); Graham Chapman, John Cleese, Terry Gilliam, Eric Idle, Terry Jones, Michael Palin, Carol Cleveland, Simon Jones, Patricia Quinn, Judy Loe, Matt Frewer, John Scott Martin, Andrew Bicknell, Mark Holmes, Valerie Whittington || Musical, Comedy || Live action"]}, {"page": "Monty Python's The Meaning of Life", "response": ["* Simon Jones"]}, {"page": "List of The Hitchhiker's Guide to the Galaxy characters", "response": ["In , Douglas Adams plays Agrajag, having recorded the part for an audiobook version of . Producer Dirk Maggs added a suitable voice treatment, and Simon Jones as Arthur Dent recorded his lines opposite the pre-recorded Adams. Adams was thus able to \"reincarnate\" to participate in the new series.", "Adams wrote this segment specifically for Steafel's show, and Simon Jones appeared in character as Arthur Dent. Steafel can be regarded as a canonical Hitchhiker's character."]}, {"page": "Sexton Blake", "response": ["* On 6 March 2006, after discussions between noted British radio producer Dirk Maggs and IPC publishing director Andrew Sumner, Maggs recorded a half-hour Adventures of Sexton Blake pilot show for his newly formed Perfectly Normal Productions. This humorous satire of Blake's adventures featured Simon Jones as Blake, Wayne Forester as Tinker, and a returning William Franklyn, in one of his final performances, as the elderly Blake (who narrates the adventure). As a result of the success of this pilot, Maggs directed a new series of Blake adventures for BBC Radio 2. The Adventures of Sexton Blake again featured Jones and Forester, joined by June Whitfield as Mrs Bardell, and Graham Hoadly as Professor Kew. The series was written by Jonathan Nash and Mil Millington and broadcast, in six weekly 15 minute instalments, during late summer 2009. An extended version of the complete series was released on CD by BBC Audiobooks on 10 September 2009. David Quantick's accompanying Blake documentary, The Hunt For Sexton Blake (also produced by Perfectly Normal Productions) was broadcast on BBC Radio 2 before the series started."]}, {"page": "Blackadder II", "response": ["The series also featured at least one significant cameo role per episode. Notable appearances include Rik Mayall as the debonair Lord Flashheart in \"Bells\"; Tom Baker and Simon Jones as Captain Redbeard Rum and Sir Walter Raleigh, respectively, in \"Potato\"; Ronald Lacey as the Baby-Eating Bishop of Bath and Wells in \"Money\"; Miriam Margolyes, who had appeared in the previous series, as the puritanical Lady Whiteadder in \"Beer\"; and Stephen Fry's comedy partner Hugh Laurie, who appears twice, first as the drunken Simon Partridge in \"Beer\" and in the final episode as the evil Prince Ludwig. Laurie was later given a larger role as George in the next two series. Also Bob, played by Gabrielle Glaister, a former classmate of Ben Elton's, made her first appearance. Several of the characters were seen in similar guises in later series."]}, {"page": "Private Lives", "response": ["In 1990, a revival at London's Aldwych Theatre, starring Keith Baxter and Joan Collins, directed by Tim Luscombe, was not well received,Billington, Michael. \"A looker lost for laughs\", The Guardian, 20 September 1990, p. 29  although Sara Crowe won an Olivier Award, Actress in a Supporting Role, as Sibyl.\"Olivier Winners, 1991\" .  Olivierawards.com, accessed 6 March 2011 Arvin Brown directed Collins as Amanda and Simon Jones as Elyot in a 1992 Broadway productionRich, Frank. \"Theater: Private Lives; For the Ardent Fans of Collins and Coward\". The New York Times, 21 February 1992 that closed after only 11 previews and 37 performances at the Broadhurst Theatre.\"Private Lives Closing Early\". The New York Times, 17 March 2011  The last West End production of the 20th century was at the National Theatre, running from May to September 1999, with Anton Lesser as Elyot and Juliet Stevenson as Amanda, directed by Philip Franks.Billington, Michael. \"Love and Violence: Private Lives\", The Guardian, 14 May 1999, p. 18\"Private Lives, 1999\"  albemarle-london.com, accessed 6 March 2011"]}, {"page": "Blithe Spirit (play)", "response": ["A Broadway revival played in 2009 at the Shubert Theatre.Gans, Andrew. \"Simon Jones Joins Cast of Blithe Spirit; Revival to Play the Shubert\" , playbill.com, 4 November 2008 Michael Blakemore directed, with Rupert Everett as Charles, Jayne Atkinson as Ruth, Christine Ebersole as Elvira, Angela Lansbury as Madame Arcati and Simon Jones as Dr Bradman.Gans, Andrew. \"Atkinson Joins Starry Cast of Broadway's Blithe Spirit Revival\" , playbill.com, 17 November 2008 The New York Times found the revival somewhat uneven, calling the opening performance \"bumpy\", but praised Lansbury's performance."]}, {"page": "Rock Follies", "response": ["*Simon Jones ... Juan (pretentious waiter in restaurant/club, series 1)", "David Dixon also appears in the first series as a record company A&R man, but is uncredited. However, this may have been amended with the release of the DVD, where he is credited. Dixon, Simon Jones, Stephen Moore and Beth Porter all later had roles in the TV adaptation of The Hitchhiker's Guide to the Galaxy."]}, {"page": "The Devil's Own", "response": ["* Simon Jones as Harry Sloan"]}, {"page": "Doctor Who spin-offs", "response": ["The Daleks also play a major role in the first produced stageplay to feature the Doctor. Doctor Who and the Daleks in the Seven Keys to Doomsday was written by Terrance Dicks and directed by Mick Hughes and ran at London's Adelphi Theatre over the 1974-75 Christmas season and was expected to tour England until April 1975. However the tour was cancelled at the 11th hour. Trevor Martin played an alternate version of the Fourth Doctor in this play, which takes place immediately after the Third Doctor's regeneration in Planet of the Spiders (the play was staged before Tom Baker's official debut as the Fourth Doctor in early 1975 although Baker had appeared at the close of Planet of the Spiders). The play co-starred former Doctor Who companion Wendy Padbury (playing a different character named Jenny). Also in the cast was Simon Jones as the \"Master of Karn\", several years before he worked with Doctor Who writer Douglas Adams on The Hitchhiker's Guide to the Galaxy. The play was not well-attended by audiences as it debuted during an upswing of IRA violence in London.Peel, John and Terry Nation: (1988). The Official Doctor Who & the Daleks Book. New York: St. Martin's Press. , pp. 102-105."]}, {"page": "The Hitchhiker's Guide to the Galaxy (film)", "response": ["Richard Griffiths voices Prostetnic Vogon Jeltz, the leader of the Vogons. Thomas Lennon voices Eddie the shipboard computer. Simon Jones, who portrayed Arthur Dent in both the BBC radio and television adaptations of Hitchhiker's, makes a cameo appearance as the \"Ghostly Image\" (the Magrathean defense system's recorded announcement). British film director, Edgar Wright (of Shaun of the Dead and Hot Fuzz fame) cameos as a Deep Thought technician. Kelly Macdonald plays a TV reporter."]}, {"page": "Simon Jones", "response": ["Simon Jones may refer to:", "*Simon Jones (actor) (born 1950), English actor", "*Simon Jones (cricketer) (born 1978), Welsh cricketer who plays for England", "*Simon Jones (footballer) (born 1945), former Rochdale and Chester City player", "*Simon Jones (musician) (born 1972), British musician, member of The Verve"]}, {"page": "The Real Thing (play)", "response": ["Felicity Kendal originated the role of Annie and Roger Rees originated the role of Henry. Glenn Close played Annie and Jeremy Irons played Henry in the Broadway production, with Mike Nichols directing. Close and Irons both won Tonys for their roles, as did Christine Baranski for her featured performance as Charlotte. Supporting players during the play's run on Broadway included Peter Gallagher, Simon Jones, D.W. Moffett, Steven Weber, Cynthia Nixon, and Yeardley Smith. In his review for The New York Times, Frank Rich wrote that \"The Broadway version of The Real Thing – a substantial revision of the original London production – is not only Mr. Stoppard's most moving play, but also the most bracing play that anyone has written about love and marriage in years.\" The production was recorded and released by Nonesuch Records."]}, {"page": "Audie Awards", "response": ["|  || May 19, 2006 || The Hitchhiker's Guide to the Galaxy: Tertiary Phase(narr. Simon Jones and full cast) || Grover GardnerGardner replaced Tony Roberts, who had originally been scheduled.  || National Press Club"]}, {"page": "Remember WENN", "response": ["*Simon Jones"]}, {"page": "Gregory Jbara", "response": ["* \"Kevin Cartwright\" in Privates On Parade (1989) with Jim Dale and Simon Jones"]}, {"page": "Sandra Dickinson", "response": ["In 2014, she understudied Angela Lansbury in the West End production of Blithe Spirit – co-starring Simon Jones, with whom she worked on The Hitchhiker's Guide to the Galaxy – but she never got to perform Madame Arcati, other than in the public understudy run, as Lansbury did not miss a single performance."]}, {"page": "The Hitchhiker's Guide to the Galaxy (radio series)", "response": ["Adams wrote the main parts of Arthur Dent and Ford Prefect with actors Simon Jones and Geoffrey McGivern in mind.Simpson, Hitchhiker, 97 According to Jones, Adams telephoned him when he was writing the pilot to ask whether he would essentially play himself; Adams later stated that although Dent was not a portrayal of Jones, he wrote the part to play to Jones's strengths as an actor.", "The series was first broadcast on BBC Radio 4 at 10.30pm on Wednesday 8 March 1978. Simon Jones recalled that Adams was initially disappointed at the scheduling as the timeslot was allegedly guaranteed to turn a programme into a \"cult\" (i.e. a small but dedicated listenership).Simpson, Hitchhiker, 114–115 As it happened, the programme gained listeners through the lack of any competition elsewhere on television or radio, but primarily through word of mouth; several Sunday newspapers included reviews and it was mentioned in Radio 4's Pick of the Week. As a result of its exposure through these reviews, the BBC received numerous requests for a repeat from people who had missed the initial episodes. A repeat of the series was broadcast on 23 April, only two weeks after the last episode had aired.", "For the CD and cassette releases of the Tertiary Phase in the United States, and all CD and cassette releases of the Quandary and Quintessential Phases, the instrumental title theme, \"Journey of the Sorcerer\", composed by Bernie Leadon and originally recorded by US rock band the Eagles, was re-interpreted by The Illegal Eagles, a tribute band, using an arrangement by Philip Pope. This was done for licensing reasons (though the original track was used for the original radio transmissions and the on-demand downloads).BBC Radio 4 Hitchhiker's Production Diary entry by Dirk Maggs. Retrieved 3 August 2006 In a 2005 interview with Simon Jones, the use of this song was mentioned as a major cause for the delay in releasing recordings of the new series in the United States.Interview with  Simon Jones at the Friends of Old Time Radio convention, 21 October 2005. Retrieved 9 August 2006.Hitchhiker's Guide production diary entry for 22 October (towards the end of the web page). Retrieved 13 August 2006."]}, {"page": "The Hitchhiker's Guide to the Galaxy (TV series)", "response": ["The series stars Simon Jones as Arthur Dent, David Dixon as Ford Prefect, Mark Wing-Davey as Zaphod Beeblebrox, Sandra Dickinson as Trillian and Stephen Moore as the voice of Marvin. The voice of the guide is by Peter Jones. Simon Jones, Peter Jones, Stephen Moore and Mark Wing-Davey had already provided the voices for their characters in the original radio series in 1978/80. In addition, the series features a number of notable cameo roles, including Adams himself on several occasions.", "The gap in production made for some continuity problems between the pilot episode and the remainder. Notably, Simon Jones's hair was cut short for another role and he wears a noticeable hairpiece in later episodes. Conversely, David Dixon's hair appears longer.", "* Arthur Dent: Simon Jones", "* Arthur Dent: Simon Jones", "* Arthur Dent: Simon Jones", "* Arthur Dent: Simon Jones", "* Arthur Dent: Simon Jones", "* Arthur Dent: Simon Jones", "In 1992, Kevin Davies wrote and directed a documentary entitled The Making of the Hitchhiker's Guide to the Galaxy. Davies had previously worked on the stage show at the Rainbow Theatre, and, while working for Pierce Animation Studios in 1980, had introduced Alan Bell to Rod Lord, leading to the animation for the TV series. For the documentary, Davies used many photographs and home movies he shot during the 1980 production of the series and recorded new interviews in October 1992 with the cast and crew. New footage of Simon Jones, David Dixon and Michael Cule, in character, were shot at the farm in Sussex used as Arthur Dent's house, and incorporated into the documentary with some references to So Long, and Thanks for All the Fish, such as Arthur finding his home intact, and placing his (animated) Babel fish into a goldfish bowl. BBC video released the sixty-minute documentary on VHS in 1993. Footage not included in the original documentary was included in the 2002 DVD release of the series. The documentary itself has not (as of 2005) been transmitted on TV."]}, {"page": "The Hitchhiker's Guide to the Galaxy Primary and Secondary Phases", "response": [":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", "As the first episode was originally commissioned as a pilot, much of the casting was done by Adams and Simon Brett, his original radio producer. Brett departed the BBC after the pilot episode was recorded, and so casting suggestions and decisions were made by Adams and Geoffrey Perkins for the remainder of both series. Perkins, using Brett's original notes, remarks that three or four people were auditioned for the part of the narrator, in search of a \"Peter Jones-y sort of voice\" before Peter Jones himself was actually contacted.Adams. Perkins (ed.) Additional material by M.J. Simpson. Page 32. Perkins also describes the casting of Simon Jones, Geoffrey McGivern, Jo Kendall, Bill Wallis and many others throughout the book containing the original radio series scripts."]}, {"page": "The Hitchhiker's Guide to the Galaxy Tertiary to Hexagonal Phases", "response": [":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", "While these were treated as the fourth and fifth Hitchhiker's Guide radio series, they were broadcast in one eight-week stretch in May and June 2005. The tradition of \"Fits\" continues; these were known as Fit the Nineteenth through Fit the Twenty-Sixth. The manner of broadcasting these episodes carries over from the Tertiary Phase: the original broadcast was on Tuesday, with a Thursday repeat (with the exception of Fit the Nineteenth, which was not repeated due to election coverage).BBC Radio 4 episode guide page. After the initial Tuesday broadcast, audio streams of the episode were available until the following Tuesday. For these final phases, the core cast (Simon Jones, Geoffrey McGivern, Mark Wing-Davey, Susan Sheridan and Stephen Moore) returned, along with William Franklyn as the new voice of The Book (assisted by Rula Lenska). In addition, David Dixon, Sandra Dickinson, Bill Paterson, Roy Hudd and Jonathan Pryce, who had roles in the TV adaptation or the original radio series, all returned, though Dixon and Paterson both play new roles.", "The \"Quandary Phase\" was released in a 2-CD set in late May 2005. The CDs contain material not present in the original transmissions, due to time constraints. The enclosed booklet contains notes from Dirk Maggs, Simon Jones, Bruce Hyman and Helen Chattwell. A 2-CD release of the \"Quintessential Phase\" was released in mid-June 2005, with similar material left out of the original transmissions, and notes in the booklet by the same four individuals.", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":* Arthur Dent: Simon Jones", ":*Arthur Dent: Simon Jones", ":*Arthur Dent: Simon Jones", ":*Arthur Dent: Simon Jones", ":*Arthur Dent: Simon Jones", ":*Arthur Dent: Simon Jones", ":*Arthur Dent: Simon Jones"]}, {"page": "Douglas Adams at the BBC", "response": ["Douglas Adams at the BBC is a three CD set released by BBC Audio in 2004 (). By using extracts from many radio and TV productions, the three discs cover Douglas Adams's association with BBC Radio and TV from 1974 to 2001, and also include tributes to Adams that were transmitted between 2001 and 2003. Subjects are covered in an A-Z format (thus becoming an \"A-Z of Douglas Adams\"). Linking narration on all three discs is provided by Simon Jones. Several of the sketches, many of which are included for the first time since their original transmissions, had been discussed in biographies of Adams (e.g. Don't Panic by Neil Gaiman and Wish You Were Here by Nick Webb). In addition, the complete script for \"The Lost Hitchhiker Sketch\" appears in the 25th anniversary edition of The Hitchhiker's Guide to the Galaxy: The Original Radio Scripts. Disc one covers subjects A to G, disc two covers subjects H to P, and disc three covers subjects Q to Z.", "* L: \"The Lost Hitchhiker Sketch\" - Sheila Steafel interviewing Simon Jones, in character as Arthur Dent from the radio show Steafel Plus, written by Adams."]}, {"page": "Out of the Trees", "response": ["Out of the Trees is a 1975 television sketch show pilot written by Graham Chapman, Douglas Adams and Bernard McKenna that was broadcast on BBC 2 in 1976. The show shared some of the stream-of-consciousness style of Monty Python's Flying Circus, of which Chapman was a member. Actors included Mark Wing-Davey and Simon Jones."]}, {"page": "Mike Walker (radio dramatist)", "response": ["| Timothy West, Lesley Manville, Daniel Weyman, Philip Jackson, Simon Jones and William Hope"]}, {"page": "Megan Hilty", "response": ["In May 2012, Hilty appeared in Gentlemen Prefer Blondes as a part of the Encores! staged concert series. She appeared as Lorelei Lee alongside Brennan Brown, Simon Jones, and Rachel York. Hilty received rave reviews for her performance, with The New York Times rating her performance on par with those of Carol Channing and Marilyn Monroe."]}, {"page": "The Thomas Crown Affair (1999 film)", "response": ["* Simon Jones as Accountant on phone (uncredited)"]}, {"page": "Doctor Who and the Daleks in the Seven Keys to Doomsday", "response": ["Appearing as the Doctor's companions were Wendy Padbury as Jenny, and James Matthews as Jimmy. Padbury had previously played the Doctor's companion Zoe Herriot in the television series. Future The Hitchhiker's Guide to the Galaxy star Simon Jones appeared as the Master of Karn as well as Dalek extra.", "*Simon Jones as Master of Karn"]}, {"page": "King's College, Taunton", "response": ["* Simon Jones, film, stage TV & radio actor, narrator"]}, {"page": "28 Acts in 28 Minutes", "response": ["* Simon Jones"]}, {"page": "Stephen Wyatt", "response": ["Wyatt's first work for television was Claws, filmed by the BBC in 1987, starring Simon Jones and Brenda Blethyn. He was then commissioned by Andrew Cartmel to write two scripts for the science-fiction series Doctor Who, which were called Paradise Towers and The Greatest Show in the Galaxy, both starring Sylvester McCoy as the Seventh Doctor. His other television credits include scripts for The House of Eliott and Casualty."]}]}}