{"wiki_id": "http://www.wikidata.org/entity/Q3258902", "itemLabel": "Lon Satton", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Lon_Satton", "wikipedia_page": {"main": "Lon Satton (born Lonnie Staton; 1929) is an American singer and actor based in the United Kingdom. He is widely-known for originating the role of Poppa in the Andrew Lloyd Webber's musical Starlight Express, for which he received a 1984 Olivier Award nomination for an Best Actor in a Musical. He is sometimes credited as Lonnie Sattin.", "link_mentions": [{"page": "Starlight Express", "response": ["| Lon Satton"]}, {"page": "List of James Bond allies", "response": ["| Harold Strutter || Lon Satton || CIA || Deceased"]}, {"page": "Alan O'Day", "response": ["*\"Caress Me Pretty Music\", 1971 (recorded by David Clayton-Thomas, Susan Hart, Dewey Martin, Anne Murray , Patrick Norman, Tony Orlando & Dawn, Lon Satton, Bobby Sherman, & Foster Sylvers,)"]}, {"page": "Adelaide Hall", "response": ["Adelaide Hall died in the early hours of 7 November 1993, aged 92, at London's Charing Cross Hospital of natural causes (old age).\"Died, Adelaide Hall\" , Time Inc., 22 November 1993. Honouring her wish, her funeral took place in New York at the Cathedral of the Incarnation (Garden City, New York) and she was laid to rest beside her mother at the Cemetery of the Evergreens in Brooklyn.Adelaide Hall grave at the Cemetery of the Evergreens, Brooklyn. In London, a memorial service was held for her at St Paul's, Covent Garden (known as the \"actors' church\"), which was attended by many stars including Elaine Paige, Elisabeth Welch, Lon Satton and Elaine Delmar. One of the participants, TV presenter and broadcaster Michael Parkinson, remarked rather fittingly during his eulogy: \"Adelaide lived to be ninety-two and never grew old.\"\"On This Day in History\" , Brooklyn Eagle."]}, {"page": "Breakaway (Space: 1999)", "response": ["* Lon Satton — Benjamin Ouma", "* Lon Satton's character Benjamin Ouma was originally intended to remain as a series regular, but other members of the cast found him difficult to work with, and he was replaced by the character David Kano, portrayed by Clifton Jones, by the next episode."]}, {"page": "Andrew Lloyd Webber: The Premiere Collection Encore", "response": ["# \"I Am the Starlight\" - Lon Satton and Ray Shell (from Starlight Express)"]}, {"page": "Live and Let Die (film)", "response": ["* Lon Satton as Harry Strutter, a CIA agent who assists Bond in New York. "]}, {"page": "Steptoe and Son (film)", "response": ["* Lon Satton as Pianist"]}, {"page": "For Love of Ivy", "response": ["* Lon Satton as Harry"]}, {"page": "Andrew Lloyd Webber discography", "response": ["|Original London Cast including Lon Satton as Papa, Ray Shell as Rusty and Stephanie Lawrence as Pearl", "|1992 revised London production cast including Lon Satton as Papa, Greg Ellis as Rusty and Reva Rice as Pearl"]}, {"page": "Success!", "response": ["Success! is a musical by Bernard J. Taylor that was first recorded in 1993 as a studio concept album featuring various West End performers including Lon Satton (who created the role of Poppa in Andrew Lloyd Webber's Starlight Express), Claire Moore,  Kathryn Evans, Jessica Martin and Maurice Clarke.  It had its world premiere stage production in Rotherham, Yorkshire, in 1995. "]}, {"page": "Laurence Olivier Award for Best Actor in a Musical", "response": ["| Lon Satton"]}, {"page": "Light at the End of the Tunnel (musical number)", "response": ["*Lon Satton, P.P. Arnold and Company", "*Lon Satton and Company", "*Lon Satton and Company"]}, {"page": "Quiller (TV series)", "response": ["* Lon Satton (2 episodes)", "| Valerie Murray, Stefan Kalipha, Clifton Jones, Lon Satton, Tommy Eytle, Meredith Edwards, Colin McCormack, Allister Bain, Mark Heath, Clarence Miller, Bruce Callender, Frank Singuineau, Roy Stewart, Sam Mansaray and James Fuller.", "| Lee Montague, Lon Satton, Paul Maxwell, James Berwick, Lalla Ward, Bob Sherman, Ray Jewers, Shane Rimmer, John Rhys-Davies, Frances Pidgeon and George Baizley."]}, {"page": "The Invincible Six", "response": ["* Lon Satton as Mike"]}, {"page": "Sylvia McNeill", "response": ["In 1971 she acted in Emil Dean Zoghby and Ray Pohlman's musical, Catch My Soul, at the Prince of Wales Theatre in London, England with Lance LeGault, Lon Satton, Sharon Gurney, and Malcolm Rennie in the cast. This rock musical was produced by Jack Good and directed by Braham Murray and Michael Elliott."]}, {"page": "1984 Laurence Olivier Awards", "response": ["** Lon Satton as Rambling Poppa McCoy in Starlight Express – Apollo Victoria"]}, {"page": "What Am I Living For", "response": ["*Lon Satton released a version of the song as the B-side to his 1970 single \"Someone is Standing Outside\"."]}, {"page": "Andrew Lloyd Webber: Now & Forever", "response": ["|Lon Satton / Ray Shell"]}, {"page": "Welcome to the Club (film)", "response": ["*Lon Satton as Marshall Bowles"]}]}}