{"wiki_id": "http://www.wikidata.org/entity/Q325142", "itemLabel": "Hamish Fulton", "itemDescription": "British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Hamish_Fulton", "wikipedia_page": {"main": "Hamish Fulton (born 1946) is an English walking artist. Since 1972 he has only made works based on the experience of walks. He translates his walks into a variety of media, including photography, illustrations, and wall texts. His work is contained in major museums collections, such as the Tate Britain and MoMA. Since 1994 he has begun practicing group walks. Fulton argues that 'walking is an artform in its own right' and argues for wider acknowledgement of walking art.", "link_mentions": [{"page": "Land art", "response": ["* Hamish Fulton (born 1946)"]}, {"page": "Richard Long (artist)", "response": ["Long was born in Bristol, in south-west England. Between 1962 and 1965 he studied at the West of England College of Art, and then, from 1966 to 1968, at Saint Martin's School of Art in London,Richard Long Official Website http://www.richardlong.org/ where he studied under Anthony Caro and Phillip King and became closely associated with fellow student Hamish Fulton."]}, {"page": "Huntly", "response": ["Huntly is home to Deveron Projects, an arts organisation that invites artists from all over the world to come and live and work in the town. Since 1995 it has worked with a 'town is the venue' methodology, connecting artists, communities and places. It hosts artists and projects that explore local, regional and global topics, such as forestry, geology, botany, foraging, anthropology, history, politics and art. Over 100 renowned artists have spent time in the town, including Roman Signer, Hamish Fulton, and Christine Borland. "]}, {"page": "Documenta 5", "response": ["|Howard Fried || |Hamish Fulton || || || ||"]}, {"page": "Environmental art", "response": ["Leading environmental artists such British artist and poet, Hamish Fulton, Dutch sculptor Herman de Vries, the Australian sculptor John Davis and the British sculptor Andy Goldsworthy similarly leave the landscape they have worked with unharmed; in some cases they have revegetated damaged land with appropriate indigenous flora in the process of making their work. In this way the work of art arises out of a sensitivity towards habitat."]}, {"page": "AA Bronson", "response": ["Bronson has been deeply involved with publishing, promoting publishing activity as a primary artistic form.  In 1979 he co-edited Performance by Artists with Peggy Gale for Art Metropole, Toronto.  In 1983 they co-edited another resource publication, Museums by Artists,  Art Metropole. In 1987 the Power Plant catalogue Sea to Shining Sea attempted to construct a history since the post-war period of artist-initiated activity in Canada, including the formation of the artist-run centers.  He also published artists' books for Art Metropole by Jeff Wall, Colin Campbell, Lisa Steele, Hamish Fulton, Hans Haacke, and others, as well as conceiving the series Little Cockroach Press, of which he edited the first few issues. As director and president of Printed Matter, he has published many books, including titles by Scott Treleaven, Terence Koh, Tauba Auerbach, Martha Rosler and Temporary Services (Chicago)."]}, {"page": "AV Festival", "response": ["Highlights of AV Festival 2012 included: new commissions by Yoshi Wada, Susan Stenger, Phill Niblock, Jonathan Schipper and Torsten Lauschmann; the closing Festival Slowalk by Hamish Fulton; a tribute concert to John Cage; Kenneth Goldsmith in Morden Tower; and public readings of On Kawara’s One Million Years."]}, {"page": "Chris Drury (artist)", "response": ["After being introduced to him by his dentist, in October 1975 he was invited to accompany walking artist Hamish Fulton on a journey through the Canadian Rockies which he describes as seminal in his transition from traditional sculpture and portraiture to environmental or land art."]}, {"page": "Metronome (artists' and writers' organ)", "response": ["Artists & Writers: Unai Goieaskoetxea Arronategi; Axford, Dale, Löwenstein & Young; Miriam Bajtala; Yassine Balbzioui; Thomas Baumann; Thomas Bayrle; Stefan Beck; Lutz Braun; Ernst Caramelle; Hsia-Fei Chang; Sunah Choi; Arnaud Dejeammes; Clémentine Deliss; Jean-:Luc Desmond; P.K. Dick; John Douglas; Irene Düring; Steve Duval; Gardar Eide Einarsson; Ewa Einhorn; Charles Esche; Andreas Exner; Roman Fehr; Dirk Fleischmann; Parastou Forouhar; Sophie Fougy; Luca Frei; Hamish Fulton; Gerhard Geiger; Yann Géraud; Simon Girault; Marcus Graf & A.T. Kelemen; Tamara Grcic; Gerald Gerstenberger; Fritz Grohs; Steffi Hartel; Kathrin Höhne; Laura Horelli; Sergei Jensen; Alan Johnston; Franz Kapfer; Anne Kaminsky; Kan-Si; Phyllis Kiehl; Udo Koch; Peter Kogler; Kasper König; Timo Kopomaa; Suwan Laimanee; Elanit Leder; Marko Lehanka; Achim Lengerer; Kerstin Lichtblau; Karen Loughridge; Lyn Löwenstein; Fiona Macalister; Jan Machacek & Radostina Patulova; Pierre Molinier; Joshua Moon; Claudia & Julia Müller; Olaf Nicolai; Angelika Nollert; Christos Papoulias; Andrew Patrizio; Edith Payer; Manfred Peckl; Michael Pfrommer; Kiersten Pieroth; Lisa Pock; Stephan Potengowski; Alan Rankin; Anna Ray; Tobias Rehberger; Mandla Reuter; Michael S. Riedel; Tanja Ristovski; Monika Ruckstuhl; Nicole Schatt; Eva Schlegel; Christian C. Schweitzer; Thomas Seidemann; Anya Sheade; Constant Siméon-Reinhard; Sean Snyder; Andreas Spiegl; Wolfgang Stengel; Misha Stroj; Superflex; Markus Szikszay; Jean-Paul Thibeau; Armin B. Wagner; Mark Aerial Waller; Naomi West; Alexander Wolff; Ekrem Yalcindag; Haegue Yang."]}, {"page": "Adriaan van Ravesteijn", "response": ["In 2013 Van Ravesteijn donated a significant part of the Art & Project collection to the Kröller-Müller Museum. This donation contained over 200 works of art, mostly sculptural works by Dutch artists such as Ger van Elk, Jos Kruit, Carel Visser and Leo Vroegindeweij, and international artists as Carl Andre, Adam Colton, Tony Cragg, Barry Flanagan, Hamish Fulton,  Richard Long, Andrew Lord, Juan Muñoz, Willy Ørskov and Nicholas Pope. "]}, {"page": "Giuseppe Panza", "response": ["In 2008, the Hirshhorn Museum and Sculpture Garden made an acquisition of thirty-nine works from the Panza collection including multiple pieces by Joseph Kosuth, Robert Irwin, Robert Barry, Hamish Fulton, and On Kawara, among others.Hirshhorn Museum and Sculpture Garden, The Panza Collection  Accessed 1 February 2011. That same year, the Albright-Knox Art Gallery acquired 71 artworks by 15 artists, partly as a gift from the Panza family and through funds from the museum's special endowment for art acquisitions.Albright-Knox Art Gallery Acquires 71 Works from the Panza Collection Art Daily."]}, {"page": "Hamish Fulton (artist)", "response": ["#REDIRECT Hamish Fulton"]}, {"page": "Deveron Projects", "response": ["Deveron Projects arranges residencies which result in the creation of public art based on research into topical issues – economic, social, political – that affect both the local community and the wider world.Jennifer Thatcher, \"ARTocracy and Parade\", Art Monthly, September 2011 Drawing inspiration from Sir Patrick Geddes, the Aberdeenshire born father of town planning who viewed society as a bio-diverse, interconnected system, Deveron Projects adopt the Geddes' model PLACE / WORK / FOLK to inform how we look at our home. This model informs DP's future project themes. Deveron Residences have explored the history, context and identity of Huntly with the town acting as studio, gallery and stage for the artists. Most residencies last three months; others have been over a more extended period.  About 80 artists from 23 countries have undertaken a Town is the Venue Residency since 1995. They include David Blyth, Clare Qualmann, Baudouin Mouanda, Böller und Brot, Celia - Yunior, Dalziel + Scullion, Emily White, Gayle Chong Kwan,  Gemuce - Pompílio Hilário, Hamish Fulton, Jacqueline Donachie, Kenny Hunter, Mihret Kebede, Nancy Mteki, Paul Shepheard, Paul Anderson, Peter Liversidge Priya Ravish Mehra, Roderick Buchanan, Ross Sinclair, Stéfanie Bourne and Utopia Group. Each artist leaves at least one work at the end of their residency, so over time Huntly has amassed a large collection of contemporary art: The Town Collection, which is dispersed about the town.Phil Miller, North-east town of Huntly puts art on the map, The Herald, 15 March 2010", "In 2010, Deveron Projects commissioned Hamish Fulton to create a new walking work for Huntly. The resulting piece 21 Days in the Cairngorms (2010) featured two group slow-walks, as well as a group of walkers to see Fulton off on the first day of his twenty-day journey, and new and unusual experience for Fulton.Emily Rodway, A Life’s A Walk, TGO December 2010 This project inspired the development of the Walking Institute and a further focus on walking as an artistic medium. In 2012 Ethiopian artist Mihret Kebede developed Slow Marathon, an artistic project in response to her inability to walk from her hometown of Addis Ababa to Huntly. The project consisted of an accumulative marathon that included miles donated remotely by international participants, as well as two twenty-six mile walks in Huntly and Addis Ababa. Ultimately, over five-hundred individuals participated in the project and donated 14172.4 miles, a total of 540 marathons. The project has since become an annual event, created in conjunction with artists working with Devon ProjectsWalkers take part in Slow Marathon, BBC News website, 12 May 2014 The 2013 Slow Marathon, Cabrach to Huntly, was held on John Muir Day and served as the official launch of the Institute.  The 2014 event started at the Glenkindie on the edge of the Cairngorms National Park. Other Walking Institute projects have included: In the Footsteps of Nan Shepherd: a long distance walk by Simone Kenyon looking at issues, plights and pleasures of women walking in wilderness; Huntly Perambulator, a series of walks by Clare Qualmann looking at walking with prams; Hielan’ Ways, a programme that included poetry (Alec Finlay), music (Paul Anderson) and art (Simone Kenyon, Gillian Russel).  Hielan’ Ways explored the old drover routes that cross north-east Scotland and culminated in a symposium with contributions from mountaineer Doug Scott , Turner Prize-winning artist Richard Long and the Cloud Appreciation Society.\"Artist reaches end of Huntly-Venice pilgrimage\". Press and Journal, 3 October 2015 by Stephen Walsh In 2015 Anthony Schrag completed The Lure of the Lost: A Contemporary Pilgrimage, a 2500 km walk from Huntly to the Venice Biennale in Italy."]}, {"page": "List of alumni of Saint Martin's School of Art", "response": ["* Hamish Fulton"]}, {"page": "Kesler Woodward", "response": ["Kesler Edward Woodward was born in Aiken, South Carolina in 1951. After high school, Woodward enrolled as a chemistry major at Davidson College in Davidson, North Carolina. Following an introductory painting course and visit to the National Gallery in Washington, he developed an interest in contemporary abstract art. At Davidson, he studied painting under Herb JacksonDecker, Julie. Icebreakers: Alaska's Most Innovative Artists. Anchorage: International Gallery of Contemporary Art. 2001: 318. Print.  and graduated with a Bachelor of Arts (Art) in 1973.Gause, Randi Jo. \"Artist Profile, Kesler Woodward.\" Alaska Home. Spring 2009. Web.  He continued his studies in painting and printmaking and graduated in 1977 with a Master of Fine Art from Idaho State University, (Pocatello). Woodward then moved to Juneau, Alaska, and began to incorporate landscape into his art. His work was influenced by artists Richard Long (artist), Andy Goldsworthy, and Hamish Fulton, and by 1982 landscape was his dominant genre."]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Hamish Fulton"]}, {"page": "Documenta 6", "response": ["| Hamish Fulton"]}, {"page": "Documenta 7", "response": ["| Hamish Fulton"]}, {"page": "Folkestone Triennial", "response": ["In 2011, the theme highlighted an outward-looking facet of Folkestone and the town’s place as “a gateway to other cultures, politics, environmental warnings and the fundamental notion of how our shores contribute to our sense of place and belonging”. Notable highlights included Cornelia Parker’s Folkestone Mermaid - her own version of Copenhagen’s ‘Little Mermaid’, with a local woman acting as a model for the sculpture. Parker’s piece can still be viewed overlooking Folkestone’s Sunny Sands as part of the permanent Creative Folkestone Artworks collection dotted across the town, along with works by Richard Wentworth, Hamish Fulton, Tonica Lemos Auad, A K Dolven, Paloma Varga Weisz, Ruth Ewan, Spencer Finch and Christina Iglesias. "]}, {"page": "Creative Folkestone Artworks", "response": ["|Hamish Fulton"]}]}}