{"wiki_id": "http://www.wikidata.org/entity/Q325841", "itemLabel": "Glen Berry", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Glen_Berry", "wikipedia_page": {"main": "Glen Berry (born 21 April 1978) is a retired British actor.", "link_mentions": [{"page": "List of feature films with LGBT characters", "response": ["| Glen Berry"]}, {"page": "Scott Neal", "response": ["He is widely recognised for having appeared in the 1996 gay drama film Beautiful Thing, where he played an abused teenager who falls for the unpopular boy next door played by Glen Berry, also a student at Anna Scher Theatre School. Scott Neal is featured in Isolation and portrays Charlie, the lead male character in The Wonderland Experience, a feature film directed by Ben Hardyment and shot on location in southern India. In addition, he has participated in the plays Yours Fondly, Zekk Baxter and Morning Glory (2001) as well as in the musical Last Song of the Nightingale (2001)."]}, {"page": "April 1978", "response": ["**Glen Berry, British actor; in Romford, England"]}, {"page": "List of British films of 1996", "response": ["|Beautiful Thing||Hettie Macdonald ||Scott Neal, Glen Berry, Linda Henry ||Romance/comedy/drama ||"]}, {"page": "Beautiful Thing (film)", "response": ["The main character, Jamie (Glen Berry), is a teenager who is in love with his classmate, Ste. Jamie's single mother, Sandra (Linda Henry), is pre-occupied with ambitious plans to run her own pub and has an ever-changing string of lovers; the latest of these is Tony (Ben Daniels), a neo-hippie.", "| Glen Berry || Jamie Gangel"]}, {"page": "List of LGBT-related films of 1996", "response": ["|Beautiful Thing ||  || United Kingdom || Romance, comedy, drama || Glen Berry, Scott Neal, Linda Henry, Ben Daniels, Tameka Empson, Jeillo Edwards, Anna Karen, Sophie Stanton, Julie Smith, Terry Duggan, Garry Cooper, Daniel Bowers, Meera Syal, Martin Walsh, Steven Martin, Andrew Fraser, John Savage, Ozdemir Mamodeally, John Benfield, Davyd Harries, Beth Goddard, Marlene Sidaway, Liane Ware, Catherine Sanderson and Dave Lynn || Screenplay by Jonathan Harvey, based on his stage play of the same name"]}]}}