{"wiki_id": "http://www.wikidata.org/entity/Q326845", "itemLabel": "Robbie McIntosh", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Robbie_McIntosh", "wikipedia_page": {"main": "Robbie McIntosh (born 25 October 1957) is an English guitarist. McIntosh is well known as a session guitarist and member of The Pretenders from 1982 until 1987. In 1988 he began doing session guitar work for Paul McCartney joining his band full-time until early 1994. He continues to do session work and has performed both as a sideman with John Mayer and with his own band, The Robbie McIntosh Band.\nMcIntosh has done session guitar work for many artists throughout his career including: Winter Mountain, Aynsley Lister, Kevin Ayers, Boyzone, Cher, Diane Tell, Eric Bibb, George Martin, Gordon Haskell, Heather Small,Joe Cocker, Daryl Hall, John Mayer, Kirsty McColl, Luz Casal, Mike + The Mechanics, Nine Below Zero, Paul Carrack, Paul Young, Mark Knopfler, John Illsley, Roger Daltrey, Russell Watson, Mark Hollis, Talk Talk, Tasmin Archer, Tears for Fears, Eros Ramazzotti, Thea Gilmore, Tina Arena, Tori Amos, Vin Garbutt, and Norah Jones.", "link_mentions": [{"page": "October 25", "response": ["*  1957   – Robbie McIntosh, English guitarist"]}, {"page": "Scarlet's Walk", "response": ["*David Torn, Mac Aladdin, Robbie McIntosh - guitar"]}, {"page": "The Pretenders", "response": ["Hynde then set up a more permanent lineup for the band, keeping Chambers and adding Robbie McIntosh on guitar and Malcolm Foster on bass. \"Middle of the Road\" was this line-up's first single, released in the US in November 1983 and reaching the Top 20 there. The US B-side, \"2000 Miles\", was released as a single in the UK. The third Pretenders album, Learning to Crawl was produced by \"fifth Pretender\" Chris Thomas and released in January 1984."]}, {"page": "John Mayer", "response": ["On December 7, 2006, Mayer was nominated for five Grammy Awards, including Album of the Year. The Trio received a nomination for Try!. He won two: Best Pop Song with Vocal for \"Waiting on the World to Change\" and Best Pop Album for Continuum. Mayer remixed an acoustic version of his single \"Waiting on the World to Change\" with vocal additions from fellow musician Ben Harper. In preparation for Continuum, Mayer had booked the Village Recorder in Los Angeles to record five acoustic versions of his songs with veteran musician Robbie McIntosh. These recordings became The Village Sessions, an EP released on December 12, 2006. As usual, Mayer oversaw the artwork.\"'The Village Sessions' Released Today\". JohnMayer.com. Retrieved June 8, 2007.  The initial North American Continuum tour ended on February 28, 2007, with a show at Madison Square Garden that the New York Post described as \"career-defining\".Aquilante, Dan (2007). \"Mayer: A Player On Big Stage\"  New York Post. Retrieved March 25, 2015."]}, {"page": "Pino Palladino", "response": ["* 1999 Robbie McIntosh, Emotional Bends"]}, {"page": "Chrissie Hynde", "response": ["The band released an EP album, titled Extended Play, then Pretenders II later in the summer. \"Talk of the Town\" and \"Message of Love\" were on both. The Pretenders lineup would change repeatedly over the next decade. Honeyman-Scott died of a drug overdose on June 16, 1982, just days after Farndon had been fired from the band. Farndon himself would also die of a drug overdose the following year. After reforming with a caretaker line-up for their next single, \"Back on the Chain Gang\", the band settled down with Robbie McIntosh (guitar) and Malcolm Foster (bass) during the recording of their next album, the worldwide hit Learning to Crawl.  Chambers left the band in the mid-1980s before the Get Close album was released in 1986. The album included the hits \"Don't Get Me Wrong\" and \"My Baby\". Amidst the ever-changing lineup, Hynde endured as the sole original Pretender until Chambers' return in the mid-1990s.  Hynde was the only stable member of the band during this period. In 1994, the band had another hit: The ballad \"I'll Stand by You\"."]}, {"page": "It's My Life (album)", "response": ["*Robbie McIntosh – guitars"]}, {"page": "The Colour of Spring", "response": ["* Robbie McIntosh — guitar (tracks 1, 2, 5 and 8), Dobro (tracks 4 and 6)"]}, {"page": "Spirit of Eden", "response": ["* Robbie McIntosh – dobro, twelve-string guitar"]}, {"page": "Thea Gilmore", "response": ["In 2002 Gilmore shared lead vocals with Kellie While, beside musicians Maartin Allcock; John Kirkpatrick, Robbie McIntosh, Michael McGoldrick and Simon Swarbrick in the Reel and Soul Association. The project mixed American soul and British Folk music. The group's eponymously titled album gained considerable mainstream attention which resulted in numerous TV appearances and radio broadcasts including the BBC's Top of the Pops 2."]}, {"page": "This Is Where I Came In", "response": ["*Robbie McIntosh – guitar on track 6"]}, {"page": "Sutton, London", "response": ["*Robbie McIntosh, air guitarist first strummed his tennis racket in Sutton High Street."]}, {"page": "The Seeds of Love", "response": ["* Robbie McIntosh – lead guitar (2, 7), slide guitar (2)"]}, {"page": "Looking for Jack", "response": ["*Robbie McIntosh - guitar, electric guitar"]}, {"page": "Gary Brooker", "response": ["A new incarnation of Procol Harum, led by Brooker, has continued touring the world, celebrating its 40th anniversary in July 2007 with two days of musical revels at St John's Smith Square in London. Brooker also toured with Ringo Starr's All-Starr Band in 1997 and 1999, and he was also a member of Bill Wyman's Rhythm Kings for several years, appearing on three of their albums and touring with the band. On 28 September 1996, as the Gary Brooker Ensemble, he organized a charity concert to raise funds for his local church, St Mary and All Saints, in Surrey. The resulting live CD of the concert, Within Our House, originally released on a fan club CD in a limited run of 1000 units, has since become a collectable recording. His guests and supporting artists included Dave Bronze,  Michael Bywater,  Mark Brzezicki and Robbie McIntosh."]}, {"page": "Kite (Kirsty MacColl album)", "response": ["*Robbie McIntosh – acoustic guitar (2, 6, 7), electric guitar (3)"]}, {"page": "Mark Hollis (album)", "response": ["* Robbie McIntosh – guitar"]}]}}