{"wiki_id": "http://www.wikidata.org/entity/Q3267099", "itemLabel": "Luke Narraway", "itemDescription": "English rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Luke_Narraway", "wikipedia_page": {"main": "Luke Narraway (born 7 September 1983 in Worcester) is a rugby union coach and former player, he played for London Irish until the end of the 2016–2017 season before joining Coventry as a player—coach for the 2017–2018 season. He is currently forwards coach at Dragons.", "link_mentions": [{"page": "Luke (given name)", "response": ["*Luke Narraway (born 1983), English rugby union coach"]}, {"page": "King's School, Worcester", "response": ["| Luke Narraway || (1983–) || Rugby union player for Gloucester Rugby, USA Perpignan, London Irish, Coventry R.F.C. and England"]}, {"page": "USA Perpignan", "response": ["*  Luke Narraway"]}, {"page": "Coventry R.F.C.", "response": ["Ahead of his second campaign Winter retained the core of the squad adding quality and experience including the All Black centre Sam Tuitupou from Sale Sharks, Phil Nilsen from Leeds, England International Luke Narraway from London Irish, Tonga's Latu Makaafi from Doncaster, Jack Preece, Scotland's Alex Grove, Dave Brazier and George Oram (all from local rivals Moseley) and Nile Dacres from fellow promotion chasers Plymouth Albion.  In September it was announced club legend (record league points scorer and player to record most league wins as captain) Cliffie Hodgson was being released to join Broadstreet as a Player Coach.http://www.coventrytelegraph.net/sport/rugby/broadstreet-arrival-ex-coventry-rugby-13675884 On 21 October, Coventry beat Loughborough to record 8 consecutive wins at the start of the new season.  In doing so, they equalled the 16-game run of the 2014–15 season.://www.coventrytelegraph.net/sport/rugby/coventry-rfc-v-loughborough-students-13800911 A week later the run was extended to 17 with a win against Cambridge that saw Cov come within 2 minutes of keeping a 3rd consecutive clean sheet. A win away at Moseley on 23 December completed a perfect first half of the season, 15 victories in 15 matches."]}, {"page": "Franklin's Gardens", "response": ["|N8 ||8 || Luke Narraway (c)"]}, {"page": "2006–07 Premiership Rugby", "response": ["|N8 ||8 || Luke Narraway  "]}, {"page": "Adam Balding", "response": ["After some impressive performances in his debut season, he was made club captain towards the back end of the season. In Gloucester's first game of the 2005/06 season at Worcester, Balding was injured only a few minutes into the game. Balding returned from injury in early November, coming off the bench against Newcastle Falcons. He went on to make 16 appearances during the season; however he missed Gloucester's European Challenge Cup victory against London Irish at the end of the season. During the next 2 seasons Balding did not play regularly with stiff competition from James Forrester, Luke Narraway and Gareth Delve. During those two seasons he was loaned out to both Moseley and Leeds Carnegie.Balding moves to Leeds on loan   "]}, {"page": "2008 Six Nations Championship squads", "response": ["Squad announced on 9 January 2008, accessed from BBC. Caps updated 10 January 2008 from RFU. On 19 January 2008, Peter Richards was injured playing in a match for London Irish and ruled out of the Six Nations. Due to more injuries in the squad London Irish scrum-half Paul Hodgson, Bath flanker Michael Lipman and Gloucester number eight Luke Narraway were all called up to the squad. On 2 February 2008, in England's opening match, Mike Tindall and Tom Rees were injured and ruled out of the rest of the tournament, while David Strettle is out for four to eight weeks. Because of this Newcastle scrum-half Lee Dickson, London Irish fly-half Shane Geraghty and Sale flanker Magnus Lund were added to the squad. Andrew Sheridan and Phil Vickery were forced to withdraw from England's game against Italy, Bristol's Jason Hobson was called up to the bench as a reserve."]}, {"page": "2008 England rugby union tour of New Zealand", "response": ["|align=right|  Jerome Kaino||align=right|N8||align=center|8||N8||Luke Narraway", "|align=right|Rodney So'oialo||align=right|N8||align=center|8||N8||Luke Narraway "]}, {"page": "2008–09 EDF Energy Cup", "response": ["|BF ||6 || Luke Narraway"]}, {"page": "The Chantry School", "response": ["* Luke Narraway (b. 1983), rugby player. He only attended Chantry High School from 1995 to 1998 before leaving to attend King's School, Worcester."]}, {"page": "List of England national rugby union players", "response": ["|1294||Luke Narraway||no. 8 ||2008-02-02||v Wales at Twickenham"]}, {"page": "2010–11 LV Cup", "response": ["|N8 ||8 || Luke Narraway (c)"]}, {"page": "2011 June rugby union tests", "response": ["|N8 ||8 ||Luke Narraway (c)"]}, {"page": "List of Top 14 foreign players", "response": ["| Luke Narraway ||  || USA Perpignan"]}, {"page": "List of 2014–15 Premiership Rugby transfers", "response": ["* Luke Narraway from  USA Perpignan"]}, {"page": "2016–17 RFU Championship", "response": ["| Luke Narraway"]}, {"page": "List of 2017–18 Premiership Rugby transfers", "response": ["* Luke Narraway to  Coventry"]}, {"page": "Leicester Tigers in cup finals", "response": ["|N8 ||8 || Luke Narraway"]}, {"page": "List of 2018–19 RFU Championship transfers", "response": ["* Luke Narraway retired"]}, {"page": "Narraway, Luke", "response": ["#redirectLuke Narraway"]}]}}