{"wiki_id": "http://www.wikidata.org/entity/Q3267074", "itemLabel": "Luke Haines", "itemDescription": "English musician and songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Luke_Haines", "wikipedia_page": {"main": "Luke Michael Haines (born 7 October 1967) is an English musician, songwriter and author. He has recorded music under various names and with various bands, including The Auteurs, Baader Meinhof and Black Box Recorder.", "link_mentions": [{"page": "Luke (given name)", "response": ["*Luke Haines (born 1967), English musician"]}, {"page": "Red Army Faction", "response": ["* In 1996, British singer songwriter Luke Haines released a 9-track album under the Baader Meinhof moniker. In this concept album, all songs are a romanticized retelling of the RAF actions."]}, {"page": "Jack Parsons (rocket engineer)", "response": ["Parsons is the subject of musical tributes by Johan Johannson (Fordlandia, 2008), Six Organs of Admittance (Parsons' Blues, 2012), The Claypool Lennon Delirium (South of Reality, 2019), and Luke Haines and Peter Buck (Beat Poetry for Survivalists, 2020). "]}, {"page": "Mitford family", "response": ["*The daughters were the subject of a 1981 musical, The Mitford Girls, by Caryl Brahms and Ned Sherrin, and of a song, \"The Mitford Sisters\", by Luke Haines."]}, {"page": "Shirley Crabtree", "response": ["Big Daddy features on Luke Haines' 2011 album 9½ Psychedelic Meditations on British Wrestling of the 1970s, and early '80s as the owner of a Casio VL-Tone synthesizer."]}, {"page": "Neoism", "response": ["Neoist \"play\" such as multiple names, plagiarism and pranks were adopted, frequently mistaken for Neoism proper and by mixing in situationist concepts, by other subcultures such as the Plagiarism and Art Strike 1990-1993 campaigns of the late 1980s (triggered largely by Stewart Home after he had left the Neoist network), Plunderphonics music, the refounded London Psychogeographical Association, the Association of Autonomous Astronauts, the Luther Blissett project, the Michael K Project, the German Communication Guerilla, and, since the late 1990s, by some net artists such as 0100101110101101.org. Other artists who explicitly if vaguely credit Neoism are The KLF, Luther Blissett, Alexander Brener/Barbara Schurz, Lee Wells and Luke Haines (of The Auteurs and Black Box Recorder). The contemporary Dutch Artist Thomas Raat created a series of artworks based on Neoist manifestos and photographic documents."]}, {"page": "Bekonscot", "response": ["The 2007 song Country Life, by Luke Haines, mentions Bekonscot in its liner notes, and the lyrics use the village as an extended metaphor."]}, {"page": "The Auteurs", "response": ["The Auteurs were a British alternative rock band of the 1990s, and a vehicle for songwriter Luke Haines (guitar, piano and vocals).  Several bands influenced by the Auteurs have taken their names from the band's songs.  The Polish band Lenny Valentino took its name from the Auteurs' song on their album Now I'm a Cowboy and the Minneapolis based band, Valet, took its name from the song \"Valet Parking\" from New Wave.", "Category:Luke Haines"]}, {"page": "Momus (musician)", "response": ["Momus' 1980s albums were a great influence on Jarvis Cocker, who wrote to Currie asking him to produce future Pulp albums.  Those same albums were a huge influence on Brett Anderson,Brett Anderson 'Lost Albums', NME, 12 February 2012 Currie's championing of Suede following his friendship with Anderson and particularly bass player Justine Frischmann got them early attention, before she left to form Elastica.  Momus also features in Bad Vibes the memoir of Luke Haines's whom Currie dubbed 'The Hitler of Britpop'."]}, {"page": "Black Box Recorder", "response": ["Black Box Recorder consisted of Sarah Nixey, Luke Haines (of The Auteurs), and John Moore (formerly of The Jesus and Mary Chain). Moore and Nixey married in 2001, and had one child. They divorced in 2006. ", "*Luke Haines' official website", "Category:Luke Haines"]}, {"page": "Peter Buck", "response": ["Arthur Buck, a side project with singer-songwriter Joseph Arthur in which Buck and Arthur share songwriting duties, released their eponymous debut album in June 2018. The following year, the Luke Haines collaboration Beat Poetry for Survivalists was released."]}, {"page": "Microdisney", "response": ["After their 1988 breakup, O'Hagan and Coughlan formed separate bands, the High Llamas and the Fatima Mansions, respectively, with Coughlan also going on to work with Sean Hughes in Bubonique and Luke Haines as part of The North Sea Scrolls project. In 2017, a radio documentary was made about the band called Iron Fist in Velvet Glove - The Story of Microdisney by producer Paul McDermott, which was re-broadcast by Newstalk 106-108fm as part of their Documentary on Newstalk season.", "* The Auteurs (Luke Haines' 1990s band, signed to Virgin's Hut Records label)"]}, {"page": "Walton-on-Thames", "response": ["*Luke Haines, pop musician in 1967. ", "The Walton Hop was a teen disco started by Deniz Corday in 1958. It is reputed to have been the first disco in the UK. During the 1970s and 1980s, it was frequented by now-convicted child sex offenders such as former Radio 1 DJ Chris Denning, Tam Paton (manager of the Bay City Rollers) and Jonathan King. It closed in 1990. Musician Luke Haines, born in Walton, released a record titled \"The Walton Hop\" in 2006."]}, {"page": "Höfner", "response": ["* The Auteurs' Luke Haines uses a Committee."]}, {"page": "Hut Records", "response": ["* Luke Haines"]}, {"page": "Haines (surname)", "response": ["*Luke Haines (born 1967), English musician"]}, {"page": "Cathal Coughlan (musician)", "response": ["In 2011, Coughlan began a collaboration with the British singer-songwriter Luke Haines and writer Andrew Mueller, resulting in the live song/speech show The North Sea Scrolls, premiering at the Edinburgh Fringe Festival in August 2011. The studio recording of The North Sea Scrolls was released November 2012.", "In 2020, Coughlan completed work on the album Song Of Co-Aklan, featuring collaborators old and new - including Nick Allum, Aindrias O'Gruama, Jon Fell, Luke Haines, Audrey Riley, James Woodrow and  Rhodri Marsden. The album was preceded by the single \"Song of Co-Aklan\", then released in March 2021 on Dimple Discs.", "* The North Sea Scrolls – as The North Sea Scrolls (with Luke Haines and Andrew Mueller) – 2012"]}, {"page": "Summer Sundae", "response": ["*Luke Haines"]}, {"page": "Totale's Turns", "response": ["The album was chosen by Luke Haines in 2011 as one of his favourite thirteen albums.Turner, Luke (2011) \"\"Rock & Roll Has Nothing To Do With Lists\": Luke Haines' Favourite Albums\", The Quietus, 5 November 2011. Retrieved 6 March 2018"]}, {"page": "Baader Meinhof (band)", "response": ["#REDIRECT Luke Haines"]}, {"page": "How I Learned to Love the Bootboys", "response": ["All songs written by Luke Haines, except where noted.", "#\"The Rubettes\" (Luke Haines, John Moore, Bickerton, Waddington) - 3:27", "* Luke Haines – vocal, guitar, keyboards ", "* Luke Haines – producer"]}, {"page": "Hidrogenesse", "response": ["According to them, their most significant influences are Sparks, Kraftwerk, Deee-Lite, The Associates (the Mac in Eres PC eres Mac stands for their lead singer, Billy Mackenzie), The Smiths and Morrissey, The Magnetic Fields, Saint Etienne, Pet Shop Boys and British eccentrics like Lawrence, Jarvis Cocker and Luke Haines. They are also influenced by 70's music like German bands La Düsseldorf, Neu! and Harmonia and UK glam acts as Gary Glitter and The Glitter Band."]}, {"page": "Meltdown (festival)", "response": ["| Asian Dub Foundation, Baby Zizanie, Badly Drawn Boy, Bobby Conn, Coldplay, Daniel Johnston, David Kitt, Fischerspooner, Gonzales, Harry Hill, Kimmo Pohjonen, Luke Haines, Mercury Rev, Peaches, Pete Yorn, Philip Glass, Senor Coconut Y Su Conjunto, Six by Seven, Stew, Suede, Supergrass, Television, The Dandy Warhols, The Divine Comedy, The International Noise Conspiracy, The Legendary Stardust Cowboy, The Lonesome Organist, The Polyphonic Spree, The The, The Waterboys, The Yeah Yeah Yeahs"]}, {"page": "Casio VL-1", "response": ["* Luke Haines' 2011 album 9½ Psychedelic Meditations on British Wrestling of the 1970s and early '80s includes the track \"Big Daddy Got A Casio VL-Tone\", which features the Casio's distinctive beats."]}, {"page": "David Westlake", "response": ["The Servants appeared on 1986’s NME-associated C86 compilation, and the band was from 1986 to 1991 the original home of Luke Haines.", "Haines describes David Westlake's first solo album, 1987's Westlake, as \"a minor classic\".Luke Haines, sleeve-notes to the Servants compilation Reserved (Cherry Red Records CDMRED 297, 2006)", "* Luke Haines, Bad Vibes (London: William Heinemann, 2009), 5-10.", "* Luke Haines, sleevenotes to the Servants' compilation Reserved (Cherry Red Records CDMRED 297, 2006)", "* Luke Haines, sleevenotes to the Servants' album Small Time (Cherry Red Records CDB RED 535, 2012)"]}, {"page": "New Wave (The Auteurs album)", "response": ["All songs written by Luke Haines.", "* Luke Haines – guitar, piano, vocals", "* Luke Haines – producer"]}, {"page": "Now I'm a Cowboy", "response": ["Now I'm a Cowboy is the 1994 second album by British alternative rock band The Auteurs. On 2 June 2014 Now I'm a Cowboy was reissued alongside After Murder Park and How I Learned to Love the Bootboys. The reissue features unreleased songs and liner notes written by Luke Haines. It was released through 3 Loop Music.", "All songs written by Luke Haines.", "* Luke Haines – guitar, piano, vocals", "* Luke Haines – producer"]}, {"page": "After Murder Park", "response": ["After Murder Park was recorded in less than two weeks at Abbey Road Studios, following a year during which front man Luke Haines had spent most of his time in a wheelchair after jumping off a wall.", "All songs written by Luke Haines.", "* Luke Haines – guitar, Harmonium, vocals"]}, {"page": "Unicorn (Tyrannosaurus Rex album)", "response": ["Songwriter and music Luke Haines of the Auteurs dubbed it a \"genius\" album and praised Took for his contributions on the record.Haines, Luke \"Auteur to Author\". Recordcollectormag.com. 28 February 2017. Retrieved 28 February 2017"]}, {"page": "Fantastic Plastic Records", "response": ["The company also set up a publishing wing and signed Luke Haines; they currently represent the majority of The Auteurs back catalogue.", "* Luke Haines", "* [FPS092D] Luke Haines - \"Love Letter To London\"", "* [FPCD025] Luke Haines - 21st Century Man", "* [FPCD030] Luke Haines - 9 1/2 Psychedelic Meditations On British Wrestling Of The 1970's and Early '80s", "* [FPCD033] Luke Haines - Leeds United EP", "* [FPCD034] Luke Haines - Off My Rocker At The Art School Bop"]}, {"page": "The Oliver Twist Manifesto", "response": ["The Oliver Twist Manifesto is a 2001 album by Luke Haines. It is subtitled (Or) What's Wrong With Popular Culture.", "Category:Luke Haines albums"]}, {"page": "Christie Malry's Own Double Entry OST", "response": ["Christie Malry's Own Double Entry by Luke Haines is the soundtrack to the film of the same name, based on a novel by B. S. Johnson and directed by Paul Tickell. The album includes a cover of the Nick Lowe song \"I Love the Sound of Breaking Glass\" from Lowe's Jesus of Cool album.", "*Luke Haines – Vocals, Multi Instruments, Producer", "Category:Luke Haines albums"]}, {"page": "Baader Meinhof (album)", "response": ["Baader Meinhof is a 1996 album by Luke Haines, under the pseudonym Baader Meinhof. The name is taken from two of the main members of the Red Army Faction, Andreas Baader and Ulrike Meinhof, and the album, composed of 10 tracks, tells the history of group, since the ideas that might have inspired the group (in the first track, there's a quote from the student movement leader Rudi Dutschke: \"Rudi said 'we got to be wise and we got to get armed'\"), their first actions (\"Burn Warehouse Burn\"), their travel to Jordan (\"Meet Me at the Airport\"), their capture, the hijacking of a Lufthansa airplane by the members of the \"second generation\" of the RAF, in 1977 (one of the events that marked the German Autumn) (\"Mogadishu\").", "Category:Luke Haines albums"]}, {"page": "England Made Me (album)", "response": ["England Made Me is the debut studio album by English indie rock band Black Box Recorder, whose members include Luke Haines, Sarah Nixey and John Moore, released in July 1998 via Chrysalis Records.", "All songs written by Luke Haines and John Moore, except for where noted."]}, {"page": "The Facts of Life (album)", "response": ["All songs written by Luke Haines and John Moore."]}, {"page": "Passionoia", "response": ["All songs written by Luke Haines and John Moore.", "* Luke Haines – instruments"]}, {"page": "The Worst of Black Box Recorder", "response": ["The Worst of Black Box Recorder is a 2001 album by Black Box Recorder, whose members include Luke Haines, Sarah Nixey and John Moore. It is a compilation of B-sides from the singles of England Made Me and The Facts Of Life.", "Category:Luke Haines albums"]}, {"page": "Latitude Festival", "response": ["The poetry arena included performances from Andrew Motion, Brian Patten, Roger Lloyd-Pack (performing T. S. Eliot's The Waste Land), Jackie Kay, Simon Armitage and Jeffrey Lewis; The Comedy Arena featured Jo Brand, Ed Byrne, Mark Thomas, Sean Lock, Adam Hills, Sean Hughes and Dave Gorman; The Theatre Arena showcased Royal Shakespeare Company, National Theatre, Bush Theatre and Paines Plough; The Literary Arena presented Blake Morrison, Jonathan Coe, Mark Steel, Vivienne Westwood, Sir Peter Blake, Frank Skinner and Luke Haines."]}, {"page": "List of songs about or referencing serial killers", "response": ["*\"Leeds United\" – Luke Haines"]}]}}