{"wiki_id": "http://www.wikidata.org/entity/Q326229", "itemLabel": "William Waldorf Astor, 1st Viscount Astor", "itemDescription": "American politician (1848-1919)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Waldorf_Astor", "wikipedia_page": {"main": "William Waldorf \"Willy\" Astor, 1st Viscount Astor (March 31, 1848 – October 18, 1919) was an American-British attorney, politician, businessman (hotels and newspapers), and  philanthropist. Astor was a scion of the very wealthy Astor family of New York City. He moved to Britain in 1891, became a British subject in 1899, and was made a peer as Baron Astor in 1916 and Viscount Astor in 1917 for his contributions to war charities.", "link_mentions": [{"page": "Viscount Astor", "response": ["*William Waldorf Astor, 1st Viscount Astor (1848–1919)"]}, {"page": "Astor family", "response": ["* 15px The Right Hon. William Waldorf Astor, 1st Viscount Astor (1848 - 1919)"]}, {"page": "Waldorf Astor, 2nd Viscount Astor", "response": ["Astor was born in New York City. He was the eldest son of William Waldorf Astor, 1st Viscount Astor, and Mary Dahlgren Paul. His younger brothers were John Rudolph Astor (who died young) and John Jacob Astor V, Baron Astor of Hever. He spent much of his life traveling and living in Europe before his family settled in Great Britain in 1889. There Waldorf attended Eton College and New College, Oxford, where he did not distinguish himself academically but excelled as a sportsman, earning accolades for both fencing and polo.R. J. Q. Adams, \"Astor, Waldorf, second Viscount Astor\", in The Oxford Dictionary of National Biography, H. C. G. Matthew and Brian Harrison, eds. (Oxford: Oxford University Press, 2004), vol. 2, p. 801. For the Oxford University Polo Club he played side on side with Devereux Milburn in successive Varsity Matches, winning by a margin of 14 goals on both occasions."]}, {"page": "John Jacob Astor, 1st Baron Astor of Hever", "response": ["Astor was born in Manhattan, New York City, in 1886, the fourth child of William Waldorf Astor, 1st Viscount Astor (1848–1919), and Mary Dahlgren Paul (1858–1894). He was five years old when his family left New York to live in England. He was raised on an estate purchased by his father at Cliveden-on-Thames in Buckinghamshire and was educated at Eton College and at New College, Oxford.Article by Derek Wilson. Upon his father's death in 1919, Astor inherited Hever Castle, near Edenbridge, Kent, where he lived the life of an English country gentleman."]}, {"page": "Sancy", "response": ["The Sancy next surfaced in 1906 when bought by William Waldorf Astor, 1st Viscount Astor, from famous Russian collector A.K. Rudanovsky. The prominent Astor family possessed it for 72 years until the 4th Viscount Astor sold it to the Louvre for $1 million in 1978. The Sancy now rests in the Apollo Gallery, together with the likes of the Regent Diamond and the Hortensia Diamond."]}, {"page": "Carlton House Terrace", "response": ["* William Waldorf Astor, 1st Viscount Astor (American-born businessman): at Number 18 during at least 1906–1909."]}]}}