{"wiki_id": "http://www.wikidata.org/entity/Q326769", "itemLabel": "John de Mowbray, 3rd Duke of Norfolk", "itemDescription": "English noble (1415-1461)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Mowbray,_3rd_Duke_of_Norfolk", "wikipedia_page": {"main": "John Mowbray, 3rd Duke of Norfolk, KG, Earl Marshal (12 September 1415 – 6 November 1461) was a fifteenth-century English magnate who, despite having a relatively short political career, played a significant role in the early years of the Wars of the Roses. Mowbray was born in 1415, the only son and heir of John de Mowbray, 2nd Duke of Norfolk, and Katherine Neville. He inherited his titles upon his father's death in 1432. As a minor he became a ward of King Henry VI and was placed under the protection of Humphrey, Duke of Gloucester, alongside whom Mowbray would later campaign in France. He seems to have had an unruly and rebellious youth. Although the details of his misconducts are unknown, they were severe enough for the King to place strictures upon him and separate him from his followers. Mowbray's early career was spent in the military, where he held the wartime office of Earl Marshal. Later he led the defence of England's possessions in Normandy during the Hundred Years' War. He fought in Calais in 1436, and during 1437–38 served as warden of the east march on the Anglo-Scottish border, before returning to Calais.\nMowbray's marriage to Eleanor Bourchier in the early 1430s drew him into the highly partisan and complex politics of East Anglia, and he became the bitter rival of William de la Pole, Earl (later Duke) of Suffolk. Mowbray prosecuted his feuds with vigour, often taking the law into his own hands. This often violent approach drew the disapproving attention of the Crown, and he was bound over for massive sums and imprisoned twice in the Tower of London. His enemies, particularly de la Pole, also resorted to violent tactics. As a result, local gentry looked to Mowbray for leadership, but often in vain; De la Pole was a powerful local force and favourite of the King, while Mowbray was neither.\nAs law and order collapsed in eastern England, national politics became increasingly factional, with popular revolts against the King's councillors. Richard, Duke of York, who by the 1450s felt excluded from government, grew belligerent. He rebelled twice, and both times Mowbray defended King Henry. Eventually Mowbray drifted towards York, with whom he shared an enmity towards de la Pole. For much of the decade, Mowbray was able to evade direct involvement in the fractious political climate, and aligned with York early in 1460 until York's death later that year. In March 1461, Mowbray was instrumental in Edward's victory at the Battle of Towton, bringing reinforcements late in the combat. He was rewarded by the new regime but did not live to enjoy it. He died in November 1461, and was succeeded as Duke of Norfolk by his only son, John.", "link_mentions": []}}