{"wiki_id": "http://www.wikidata.org/entity/Q326419", "itemLabel": "Frederick Bakewell", "itemDescription": "British inventor", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Bakewell", "wikipedia_page": {"main": "Frederick Collier Bakewell (29 September 1800 – 26 September 1869) was an English physicist who improved on the concept of the facsimile machine introduced by Alexander Bain in 1842 and demonstrated a working laboratory version at the 1851 World's Fair in London.", "link_mentions": [{"page": "Fax", "response": ["Frederick Bakewell made several improvements on Bain's design and demonstrated a telefax machine.Bakewell, Frederick Collier \"Electric telegraphs\"  English patent no. 12,352 (filed:  2 December 1848 ; issued:  2 June 1849).1851 Great Exhibition: Official Catalogue: Class X.: Frederick Collier Bakewell  The Pantelegraph was invented by the Italian physicist Giovanni Caselli.Caselli, Giovanni \"Improved pantographic telegraph\" U.S. patent no. 20,698 (June 29, 1858).  He introduced the first commercial telefax service between Paris and Lyon in 1865, some 11 years before the invention of the telephone.The Hebrew University of Jerusalem – Giovanni Caselli biography "]}, {"page": "Television", "response": ["Facsimile transmission systems for still photographs pioneered methods of mechanical scanning of images in the early 19th century. Alexander Bain introduced the facsimile machine between 1843 and 1846. Frederick Bakewell demonstrated a working laboratory version in 1851. Willoughby Smith discovered the photoconductivity of the element selenium in 1873. As a 23-year-old German university student, Paul Julius Gottlieb Nipkow proposed and patented the Nipkow disk in 1884.Shiers, George and May (1997), Early Television: A Bibliographic Guide to 1940. Taylor & Francis, pp. 13, 22. . This was a spinning disk with a spiral pattern of holes in it, so each hole scanned a line of the image. Although he never built a working model of the system, variations of Nipkow's spinning-disk \"image rasterizer\" became exceedingly common.Shiers & Shiers, p. 13, 22. Constantin Perskyi had coined the word television in a paper read to the International Electricity Congress at the International World Fair in Paris on 24 August 1900. Perskyi's paper reviewed the existing electromechanical technologies, mentioning the work of Nipkow and others. However, it was not until 1907 that developments in amplification tube technology by Lee de Forest and Arthur Korn, among others, made the design practical.\"Sending Photographs by Telegraph\", The New York Times, Sunday Magazine, 20 September 1907, p. 7."]}, {"page": "Telegraphy", "response": ["In 1843, Scottish inventor Alexander Bain invented a device that could be considered the first facsimile machine. He called his invention a \"recording telegraph\". Bain's telegraph was able to transmit images by electrical wires. Frederick Bakewell made several improvements on Bain's design and demonstrated a telefax machine. In 1855, an Italian abbot, Giovanni Caselli, also created an electric telegraph that could transmit images. Caselli called his invention \"Pantelegraph\". Pantelegraph was successfully tested and approved for a telegraph line between Paris and Lyon."]}, {"page": "Great Exhibition", "response": ["*Frederick Bakewell demonstrated a precursor to today's fax machine."]}, {"page": "Alexander Bain (inventor)", "response": ["Bain's British patent 9745 description dated 27 May 1843 for improvements in electric printing claimed that a copy of any other surface can be taken. The transmitter and receiver were connected by five wires. In 1850 he applied for an improved version but was too late, as Frederick Bakewell had obtained a patent for his superior \"image telegraph\" that is sometimes known as a \"copying telegraph\" that was an major improvement over Bain's."]}, {"page": "Mechanical television", "response": ["The first mechanical raster scanning techniques were developed in the 19th century for facsimile, the transmission of still images by wire. Alexander Bain introduced the facsimile machine in 1843 to 1846. Frederick Bakewell demonstrated a working laboratory version in 1851. The first practical facsimile system, working on telegraph lines, was developed and put into service by Giovanni Caselli from 1856 onward.Huurdeman, p. 149 The first telefax machine to be used in practical operation was invented by an Italian priest and professor of physics, Giovanni Caselli (1815–1891).Beyer, p. 100 The telegraph was the hot new technology of the moment, and Caselli wondered if it was possible to send pictures over telegraph wires. He went to work in 1855, and over the course of six years perfected what he called the \"pantelegraph.\" It was the world's first practical fax machine."]}, {"page": "History of television", "response": ["Facsimile transmission systems pioneered methods of mechanically scanning graphics in the early 19th century. The Scottish inventor Alexander Bain introduced the facsimile machine between 1843 and 1846. The English physicist Frederick Bakewell demonstrated a working laboratory version in 1851. The first practical facsimile system, working on telegraph lines, was developed and put into service by the Italian priest Giovanni Caselli from 1856 onward. The first telefax machine to be used in practical operation was invented by an Italian priest and professor of physics, Giovanni Caselli (1815–1891). The telegraph was the hot new technology of the moment, and Caselli wondered if it was possible to send pictures over telegraph wires. He went to work in 1855, and over the course of six years perfected what he called the \"pantelegraph.\" It was the world's first practical fax machine."]}, {"page": "Bakewell (disambiguation)", "response": ["*Frederick Bakewell (1800–1869), English physicist"]}, {"page": "Wirephoto", "response": ["*Frederick Bakewell"]}, {"page": "Giovanni Caselli", "response": ["Pantèlègraph is a portmanteau from pantograph, an instrument that copies handwritten words and sketches, plus \"telegraph\", an electrical system that sends messages through a normal wire over long distances and that can be mechanically synced. When he was teaching at the University of Florence, Caselli devoted much of his research to the technology of telegraphic transmission of sketches as well as handwritten words. Inventor Alexander Bain was working on this technology as was physicist Frederick Bakewell. The major problem of the time was to get perfect synchronization between the transmitting and receiving parts so they would work together correctly. Caselli developed an electrochemical technology with a \"synchronizing apparatus\" (regulating clock) to make the sending and receiving mechanisms work together that was far superior to any technology Bain or Bakewell had."]}, {"page": "Shelford Bidwell", "response": ["In the late 1870s, he carried out a number of experiments with selenium photocells.  In one experiment, he duplicated the \"photophone\" originally created by Alexander Graham Bell.  This device used sound to vibrate a mirror.  Variations in light intensity reflected from the vibrating mirror were detected using  a selenium photocell which was then connected to a telephone. This showed that voice communication could be transmitted using light beams with a photocell used to convert it to an electrical signal. In another experiment, Bidwell placed a selenium photocell inside a rotating cylinder. A small hole in the cylinder allowed the photocell to scan an image on a brightly illuminated glass slide. Another rotating cylinder was covered with a paper treated with potassium iodide. The electrical signal from the photosignal was sent to a platinum wire that darkened the paper when current was applied. Bidwell's device did not solve the problem of synchronizing the transmitter and receiver. Both cylinders were on the same shaft. Similar devices for transmitting images had previously been demonstrated by Alexander Bain and Frederick Bakewell, but Bidwell was the first to use a photocell to scan the image.  Bidwell reported his results in an article entitled \"Tele-Photography\" in the February 10, 1881 issue of Nature. His device is displayed in the London Science Museum. In 1886, he was elected a Fellow of the Royal Society. He was president of the Physical Society from 1897 to 1899."]}, {"page": "Frederick Collier Bakewell", "response": ["#REDIRECT Frederick Bakewell"]}, {"page": "Jacob Hopewell", "response": ["Hopewell was born in 1831, and beyond that date most information regarding his early life is speculative at best. Some scholars, notably Arthur McCallister, describe him as a lonely child without siblings; others believe him to have been the eldest of as many as seven brothers and sisters.Arthur McCallister Myth and Invention: Fantastical Inventions of the Nineteenth Century (New York: Maritime Press, 1994). It is however certain that by 1850 he was the only remaining Hopewell child. The profession of his father prior to the 1840s is unknown. However, based on several letters and daguerreotypes it is relatively certain that his father, Richard D. Hopewell, was excited by the prospect of photography—so much so that he became a traveling photographer who circulated primarily through New York and New Jersey taking portraits in the towns he visited. While Jacob Hopewell's adolescence is shrouded in uncertainty, it can be sure that he attended the Great Exhibition of 1851 in London. It was there that he saw Frederick Bakewell's demonstration of the facsimile machine (an early precursor to the modern fax machine). In a letter dated November 15, 1851, Hopewell writes to his fiancé, Margaret Beecher, about some of what he saw at the exhibition:"]}, {"page": "Frederick C. Bakewell", "response": ["#REDIRECT Frederick Bakewell"]}, {"page": "List of British innovations and discoveries", "response": ["* Improvements to the facsimile machine are demonstrated by Frederick Bakewell at the 1851 World's Fair in London."]}]}}