{"wiki_id": "http://www.wikidata.org/entity/Q3266290", "itemLabel": "Luella Bartley", "itemDescription": "British fashion designer and journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Luella_Bartley", "wikipedia_page": {"main": "Luella Dayrell Bartley  (born 1974) is an English fashion designer, magazine editor and former journalist based in the UK.", "link_mentions": [{"page": "Preppy", "response": ["Though traditional interest in the preppy style generally fell in the 1990s, some of the newer outfitters such as Ralph Lauren, J. Crew, Tommy Hilfiger, Vineyard Vines, Gant, and Elizabeth McKay are often perceived as having preppy styles, with designers such as Marc Jacobs and Luella Bartley adding the preppy style into their clothes in the 1990s."]}, {"page": "List of fashion designers", "response": ["* Luella Bartley"]}, {"page": "Elle Style Awards", "response": ["*Contemporary Brand: MARC by Marc Jacobs, Katie Hillier and Luella Bartley", "*International Designer of the Year: Luella Bartley", "*Best British Designer: Luella Bartley"]}, {"page": "WCG (college)", "response": ["* Hussein Chalayan and Luella Bartley both studied for a National Diploma in Fashion and Clothing at WCG. Both went on to study at Central Saint Martins, and both have won British Fashion Designer of the year."]}, {"page": "Trinity Catholic School", "response": ["* Luella Bartley, fashion designer"]}, {"page": "Go International", "response": ["*Luella Bartley (January 2006)"]}, {"page": "Bartley", "response": ["*Luella Bartley (born 1974), English fashion designer and editor"]}, {"page": "Stuart Vevers", "response": ["Stuart Vevers (born 17 November 1973) is a British fashion designer. He graduated from the University of Westminster in 1996. His first job was at Calvin Klein, followed by Bottega Veneta, Givenchy and Louis Vuitton, where he worked with Marc Jacobs. He joined Mulberry as creative director in 2005 and was instrumental in the company's success, transforming their leather goods into the must-have bags. He has also collaborated with Luella Bartley and Designer of the Year, Giles Deacon. In 2006, he won the British Fashion Council's Accessory Designer of the Year award. In July 2007 it was announced that he had been appointed creative director of Loewe, and, on  25 June 2013, Vevers was announced to be the executive creative director at American label Coach."]}, {"page": "Luella", "response": ["* Luella, a fashion label started by Luella Bartley", "*Luella Bartley (born 1974), an English fashion designer, magazine editor and former journalist "]}, {"page": "Giles Deacon", "response": ["Deacon was born in Darlington, County Durham, but grew up near Ullswater in the Lake District. Deacon is the youngest child of David, an agricultural salesman, and Judith, a housewife. He has one older sister. He attended Barnard Castle School in County Durham which he credits with instilling in him \"the mindset of aesthetics\". Alongside schoolmate and friend Glenn Hugill, now a major television executive, he pursued interests in music and film as \"portal to other things that we didn't really know about\" Deacon initially wanted to become a marine biologist, but he failed his chemistry A-level. He later joined Harrogate College of Arts, where he completed an art foundation course. After completing his course he went on to study at Central St Martins and was in the same class as fashion designers Alexander McQueen and Luella Bartley. He graduated in 1992 and began collaborating on the label 'Doran Deacon' with his friend, Fi Doran as well as contributing illustrations to Dazed & Confused."]}, {"page": "M.I.A. (rapper)", "response": ["M.I.A. cites guerrilla art and fashion as major influences. Her mother works as a seamstress in London. An early interest in fashion and textiles–designing confections of \"bright fluorescent fishnet fabrics\"—was a hallmark of her time at Central Saint Martins College. M.I.A. was a roommate of fashion designer Luella Bartley and is a long-time friend of designer Carri Mundane. Clothes from her limited-edition \"Okley Run\" line—Mexican and Afrika line jackets and leggings, Islamic-inspired and water melon-print hoodies, and tour-inspired designs–were sold in 2008 during New York fashion week. She commented, \"I wanted to tie all my work together. When I make an album, I make a number of artworks that go with it, and now I make some clothes that go with it too. So this Okley run was an extension of my Kala album and artwork.\" Spin described her designs as \"1000 watt Malcolm McLaren-meets-Basquiat\", that complimented her personal style that could \"run from futurist aerobic instructor to new wave pirate to queenly candy raver\"."]}, {"page": "Shannan Click", "response": ["Click's first major modeling gig was with GUESS?. A year later, she began her international runway career, walking for designers like Miu Miu, Prada, Alexander McQueen, and Luella Bartley. She has walked in other seasons for many fashion houses, such as Yves Saint Laurent, Dior Cosmetics, Chanel, and Louis Vuitton."]}, {"page": "Katie Grand", "response": ["Soon after this, Grand was made Editor-in-Chief of POP, a bi-annual fashion magazine. This position brought Grand many friendships, including with celebrities Madonna and Agyness Deyn, and designers Stella McCartney, Luella Bartley, Miuccia Prada and Giles Deacon. She infamously convinced actress Elizabeth Hurley to pose nude on the cover of POP, just six weeks after giving birth."]}, {"page": "Luella Dayrell Bartley", "response": ["#REDIRECT Luella Bartley"]}, {"page": "MediaWiki talk:Spam-whitelist/Archives/2010/09", "response": ["Please whitelist Nirali Magazine as it contains an early interview with M.I.A. that would then be able to be retrieved directly on wiki. It's a reliable third party source. It was present for a few years before being blocked. It is used as a reference twice in the article, and is a useful resource on the articles M.I.A. and Luella Bartley.Lifebonzza (talk) 09:37, 28 August 2010 (UTC)"]}, {"page": "David Sims (photographer)", "response": ["Sims once lived in Cornwall with his partner, the fashion designer Luella Bartley. They now live in London."]}, {"page": "List of alumni of Central Saint Martins", "response": ["* Luella Bartley"]}, {"page": "Katie Hillier", "response": ["In 2015, she launched Hillier Bartley with fellow designer Luella Bartley."]}]}}