{"wiki_id": "http://www.wikidata.org/entity/Q3269503", "itemLabel": "Lynda Gratton", "itemDescription": "Business theorist", "wikipedia_url": "https://en.wikipedia.org/wiki/Lynda_Gratton", "wikipedia_page": {"main": "Lynda Gratton (born February 1955) a British organizational theorist, consultant, and Professor of Management Practice at London Business School and the founder of HSM Advisory, known for her work on organisational behaviour.", "link_mentions": [{"page": "2000 in literature", "response": ["*Lynda Gratton – Living Strategy: Putting People at the Heart of Corporate Purpose"]}, {"page": "List of business theorists", "response": ["* Lynda Gratton"]}, {"page": "World Business Forum", "response": ["*Lynda Gratton"]}, {"page": "Lynda", "response": ["* Lynda Gratton (born 1955), British organizational theorist, consultant and professor"]}, {"page": "Financial Times and McKinsey Business Book of the Year Award", "response": ["*Lynda Gratton and Andrew Scott, The 100-Year Life: Living and Working in an Age of Longevity"]}, {"page": "Nordic Business Forum", "response": ["*Lynda Gratton"]}, {"page": "History of organizations", "response": ["In 1776 the political economist Adam Smith wrote on how specialization can boost human productivity enormously.Smith, A. (1776). An Inquiry into the Nature and Causes of the Wealth of Nations. By specializing, people can use their talents, or acquire skill. And they can employ labour-saving machinery to boost production.http://www.adamsmith.org/wealth-of-nations. (n.d.). Retrieved October 2013, 2013, from www.adamsmith.org. Smith's view was borne out by the effects of mass industrialization in the late 18th century which caused great change in how people worked and how work was organized. On this topic Lynda Gratton, the organizational theorist, describes the \"fundamental and irreversible shift which changed the experiences of every worker.\" She states that prior to the Industrial Revolution, work was an \"artisan activity engaged largely in the home, using long held and meticulously developed craft skills.\" According to Gratton these skills \"began to be transformed as the manufacturing sector was developed and began to transcend the limits of artisanal production\".Gratton, L. (2011). The Shift-The future of work is already here. London: Collins"]}, {"page": "Gratton (surname)", "response": ["* Lynda Gratton (born 1953), British psychologist and management academic"]}, {"page": "Indigo Era", "response": ["In November 2016 LetterOne launched a journal, Global Perspectives, as a platform to explore \"the new emerging economic era, the Indigo era, from different perspectives, including education, religion, politics, economics, history and business\" and to examine \"global issues through the eyes of leading commentators and business people around the world\".\"The Global Perspectives Journal examines global issues through the eyes of leading commentators and business people around the world\". LetterOne. Retrieved 14 October 2017. The inaugural issue contained articles by Fridman, Dominic Barton, Michael Bloomberg, Stan Greenberg, Carl Bildt, Vince Cable, Ken Robinson, Brent Hoberman, Alex Klein, Deirdre McCloskey, Yuri Milner, Nick D'Aloisio, Lynda Gratton, Parag Khanna, Ian Goldin, George Freeman, Ian Bremmer, and others.\"Articles\". Global Perspectives. Volume 1. November 2016.\"Contributors\". Global Perspectives. Volume 1. November 2016.", "*Lynda Gratton, author and professor of Management Practice at the London Business School"]}, {"page": "The 100-Year Life", "response": ["The 100-Year Life is a 2016 self-help book by Lynda Gratton, professor of management practice at London Business School, and Andrew Scott, professor of economics at the same institution."]}]}}