{"wiki_id": "http://www.wikidata.org/entity/Q327716", "itemLabel": "Hugo Swire", "itemDescription": "British politician (born 1959)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugo_Swire", "wikipedia_page": {"main": "Sir Hugo George William Swire  (born 30 November 1959) is a British politician who served as the Member of Parliament (MP) for East Devon from 2001 until 2019. A member of the Conservative Party, he has had several ministerial roles, most recently as Minister of State for the Foreign and Commonwealth Office, a role he held until July 2016. Swire is currently the Deputy Chairman of the Commonwealth Enterprise and Investment Council. He retired at the 2019 general election.", "link_mentions": [{"page": "Foreign relations of Cambodia", "response": ["* British Minister of State Hugo Swire visited Cambodia on 29 January 2014 to discuss solutions for political deadlock with the ruling and opposition parties."]}, {"page": "November 30", "response": ["*  1959   – Hugo Swire, English soldier and politician, Minister of State for Foreign Affairs"]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Hugo Swire"]}, {"page": "Damien Hirst", "response": ["In December 2004, The Physical Impossibility of Death in the Mind of Someone Living was sold by Saatchi to American collector Steve Cohen, for $8 million, in a deal negotiated by Hirst's New York agent, Gagosian. Cohen, a Greenwich hedge fund manager, then donated the work to The Metropolitan Museum of Art, New York. Sir Nicholas Serota had wanted to acquire it for the Tate Gallery, and Hugo Swire, Shadow Minister for the Arts, tabled a question to ask if the government would ensure it stayed in the country."]}, {"page": "Exmouth", "response": ["Rolle College was opened in 1946 and later became the Exmouth campus of the University of Plymouth. In 2008 the University of Plymouth decided to close the College. East Devon MP Hugo Swire discussed the College's closure in Parliament. "]}, {"page": "List of current members of the British Privy Council", "response": ["| Sir Hugo Swire"]}, {"page": "List of political families in the United Kingdom", "response": ["**Hugo Swire, Conservative politician; son-in-law of John"]}, {"page": "Ulster Defence Regiment", "response": ["On Saturday, 28 April 2012 a memorial to the UDR was unveiled at the National Memorial Arboretum by Colonel Sir Dennis Faulkner CBE (Patron of the Regimental Association) along with Memorial Trees in memory of those UDR Soldiers who were murdered after having left the Regiment. Memorial Trees in memory of all those who were killed while serving had already been planted some years ago.  The memorial takes the form of a 6-foot Mourne granite monument.  The event was attended by around 100 UDR families, joined by the Northern Ireland Minister of State, Hugo Swire, DUP Junior Minister Jonathan Bell and UUP deputy leader John McCallister.  A parade to the monument was led by the band of the 1st Battalion Royal Irish Regiment."]}, {"page": "K-pop", "response": ["In November 2012, the British Minister of State for the Foreign Office, Hugo Swire, addressed a group of South Korean diplomats at the House of Lords, where he emphasized the close ties and mutual cooperation shaping South Korea–United Kingdom relations and added: \"As 'Gangnam Style' has demonstrated, your music is global too.\" In February 2013, the Vice President of Peru, Marisol Espinoza, gave an interview with South Korea's Yonhap News Agency, where she voiced her desire for more South Korean companies to invest in her country and named K-pop as \"one of the main factors that made Peruvian people wanting to get to know South Korea more.\""]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["* Hugo Swire (b. 1959)"]}, {"page": "List of Old Etonians born in the 20th century", "response": ["*Hugo Swire (born 1959), Minister of State, Northern Ireland"]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| East Devon || Hugo Swire || Conservative || Hugo Swire || Conservative"]}, {"page": "East Devon (UK Parliament constituency)", "response": ["At the 1997 general election a new constituency of East Devon was established. Sir Peter Emery, MP for Honiton since a 1967 by-election, represented the new East Devon seat until standing down in 2001, when Hugo Swire was elected.", "| Sir Hugo Swire"]}, {"page": "Korean wave", "response": ["In November 2012, the British Minister of State for the Foreign Office, Hugo Swire, held a meeting with South Korean diplomats at the House of Lords, where he affirmed that Korean music had gone \"global\". Hallyu became so common in UK, that in September 2021 update of Oxford English Disctionary (OED) it included 26 popular Korean origin words into standard English vocabulary such as bulgogi, galbi, gimbap, kimchi, hanbok, taekwondo and Hangul. OED also revised the 11 existing Korean words."]}, {"page": "George Townshend, 7th Marquess Townshend", "response": ["Lord Townshend married, thirdly, in 2004, Philippa Sophia Swire (born 28 April 1935), former wife of Humphrey Roger Swire (1934–2004), and daughter of George Jardine Kidston-Montgomerie of Southannan. She is the mother of the Conservative MP Hugo Swire and Sophia Swire."]}, {"page": "List of United Kingdom MPs: S", "response": ["*Hugo Swire"]}, {"page": "Swire (surname)", "response": ["* Hugo Swire - English politician and Member of the British Parliament"]}, {"page": "Equality Act (Sexual Orientation) Regulations 2007", "response": ["In the House of Commons, the regulations  were adopted by 309 votes to 99.The Public Whip division analysis, 19 March 2007  The dissenters were mostly Conservative MPs, although twenty-nine Tories did support the measures (Desmond Swayne, James Duddridge, David Cameron, George Osborne, Crispin Blunt, Andrew Tyrie, Andrew Mackay, Nick Herbert, Hugo Swire, Francis Maude, Oliver Letwin, Patrick McLoughlin, Chris Grayling, Michael Gove, Andrew Mitchell, Alan Duncan, Michael Fabricant, Theresa Villiers, Graham Stuart, Andrew Lansley, Bill Wiggin, Peter Ainsworth, Robert Key, Tony Baldry, David Willetts, Nigel Evans, Jeremy Hunt, John Bercow and Eleanor Laing). However ten Labour Members (Joe Benton, Tom Clarke, Frank Cook, Jim Dobbin, David Drew, Peter Kilfoyle, Jim McGovern, Alan Meale, Geraldine Smith and David Taylor) voted against, along with four Liberal Democrats (Alan Beith, Colin Breed, Tim Farron and Bob Russell)."]}, {"page": "Minister of State for Foreign Affairs (United Kingdom)", "response": ["| rowspan=\"2\" |Hugo Swire"]}, {"page": "Raymond's Hill", "response": ["In 2002 the local MP Hugo Swire presented a 2,225 signature petition to Parliament on behalf of the residents, calling for a roundabout to be constructed at the accident blackspot at the junction of the A35 road and the B3165 at the Hunters Lodge Inn, Raymond's Hill which has claimed many lives."]}, {"page": "Jang Song-thaek", "response": ["*  – Prime minister David Cameron's official spokesman told reporters at a daily press briefing: \"If this is confirmed, it is another example of the extreme brutality of the North Korean regime.\" Hugo Swire, minister of state at the Foreign Office, said: \"We are deeply concerned to learn of the execution. This is another example of the brutality of the North Korean government, and we have consistently raised concerns about severe and systematic human rights abuses. The UN is currently running a commission of inquiry and it is quite right that we do everything we can to investigate North Korea's appalling human rights record. More broadly, we remain deeply concerned about the impact of this unpredictable regime on stability in the region. Our embassy in Pyongyang is monitoring the situation closely and we will continue to maintain close contact with our allies on this.\" Lord Alton of Liverpool, chair of the North Korea All-Party Parliamentary Group, said Jang \"represented for many the real hope for reform in North Korea\" and stated that Jang's execution was a \"bloody and vivid and brutal reminder of the inherent and cruel nature of a regime that has always modelled itself on Stalin's USSR\" and its gulag system.Execution 'shows extreme brutality', The Belfast Telegraph, 13 December 2013. Retrieved 4 January 2014."]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Sir Hugo Swire; MP for East Devon (2001–2019)"]}, {"page": "Kamalesh Sharma", "response": ["On Sharma's tenure, The Rt Hon Hugo Swire, UK Minister of State, Foreign and Commonwealth Office commented that Sharma \"helped to guide the Commonwealth through a period of significant challenges and he can be rightly proud of the important developments that have taken place under his leadership, such as the introduction of the Commonwealth Charter\"."]}, {"page": "Kennaway House", "response": ["It was reopened on 4 July 2009 by the Rt Hon Hugo Swire, Member of Parliament for East Devon as a Gallery and Arts Centre and a facility for private and community events. It is licensed for civil weddings and partnerships. It is owned and managed by the Kennaway House Trust, which is a Registered Charity No 1122667."]}]}}