{"wiki_id": "http://www.wikidata.org/entity/Q327032", "itemLabel": "Beverley Cross", "itemDescription": "British screenwriter (1931-1998)", "wikipedia_url": "https://en.wikipedia.org/wiki/Beverley_Cross", "wikipedia_page": {"main": "Alan Beverley Cross (13 April 1931 – 20 March 1998) was an English playwright, librettist, and screenwriter.", "link_mentions": [{"page": "Kenneth Williams", "response": ["Williams often publicly said that he was asexual and celibate and his diaries appear to substantiate his claims—at least from his early forties onwards. He lived alone all his adult life and had few close companions apart from his mother, and no significant romantic relationships. His diaries contain references to unconsummated or barely consummated homosexual dalliances, which he describes as \"traditional matters\" or \"tradiola\". He befriended gay playwright Joe Orton, who wrote the role of Inspector Truscott in Loot (1965) for him, and had holidays with Orton and his lover, Kenneth Halliwell, in Morocco. Other close friends included Stanley Baxter, Gordon Jackson and his wife Rona Anderson, Sheila Hancock and Maggie Smith and her playwright husband, Beverley Cross. Williams was also fond of fellow Carry On regulars Barbara Windsor, Bernard Bresslaw, Peter Butterworth, Kenneth Connor, Hattie Jacques and Joan Sims."]}, {"page": "Lawrence of Arabia (film)", "response": ["The film's production was frequently delayed because shooting commenced without a finished script. Wilson quit early in the production, and playwright Beverley Cross worked on the script in the interim before Bolt took over, although none of Cross's material made it to the final film. A further mishap occurred when Bolt was arrested for taking part in an anti-nuclear weapons demonstration, and Spiegel had to persuade him to sign a recognizance of good behaviour to be released from jail and continue working on the script."]}, {"page": "Toad of Toad Hall", "response": ["In the 1960s and 1970s there were annual West End revivals during the Christmas season, with Goolden returning to the part of Mole in every year except one.Herbert, pp. 482–483 Among the actors appearing in the play in London and elsewhere were, in the title role Michael Bates,Herbert, p. 391 Hywel Bennett,Herbert, p. 403 Derek Godfrey,Herbert, p. 658 Nicky Henson,Herbert, p. 723 Michael Hordern,Herbert, p. 745 Paul Scofield,Trewin, p. 8 Ian Wallace,\"Theatres\", The Times, 23 December 1964, p. 11 Michael Williams,Herbert, p. 1257 Peter WoodthorpeHerbert, p. 1269 and Patrick Wymark.\"Toad of Toad Hall\", Royal Shakespeare Company. Retrieved 23 April 2021   Alan Badel and Clive Revill were among those seen as Rat;Herbert, p. 374 and 1059 Badgers included Michael Blakemore, Mark Dignam, John Justin and John Woodvine.Herbert, pp. 420, 553, 794 and 1269 Performers seen in other roles in the play included Beverley Cross, Judi Dench, Ian McKellen, Rita Tushingham and Brett Usher.Herbert, pp. 521, 545, 1199 and 27; and \"Toad of Toad Hall\", Ian McKellen. Retrieved 23 April 2021"]}, {"page": "Maggie Smith", "response": ["Smith married actor Robert Stephens on 29 June 1967. They had two sons, actors Chris Larkin (born 1967) and Toby Stephens (born 1969), and were divorced on 6 April 1975. Smith married playwright Beverley Cross on 23 June 1975, at the Guildford Register Office, and they remained married until his death on 20 March 1998. When asked in 2013 if she was lonely, she replied, \"it seems a bit pointless, going on one's own, and not having someone to share it with\". Smith has five grandchildren."]}, {"page": "Story within a story", "response": ["The opera Pagliacci is about a troupe of actors who perform a play about marital infidelity that mirrors their own lives, and composer Richard Rodney Bennett and playwright-librettist Beverley Cross's The Mines of Sulphur features a ghostly troupe of actors who perform a play about murder that similarly mirrors the lives of their hosts, from whom they depart, leaving them with the plague as nemesis. John Adams' Nixon in China (1985-7) features a surreal version of Madam Mao's Red Detachment of Women, illuminating the ascendance of human values over the disillusionment of high politics in the meeting."]}, {"page": "1981 in film", "response": ["| Clash of the Titans || United Artists || Desmond Davis (director); Beverley Cross (screenplay); Harry Hamlin, Laurence Olivier, Judi Bowker, Maggie Smith, Burgess Meredith, Ursula Andress, Siân Phillips, Claire Bloom, Pat Roach, Susan Fleetwood, Tim Pigott-Smith, Jack Gwillim, Neil McCarthy, Vida Taylor, Donald Houston, Flora Robson, Anna Manahan, Freda Jackson || Fantasy, Monster, Adventure || Live action"]}, {"page": "1977 in film", "response": ["| Sinbad and the Eye of the Tiger || Columbia Pictures / Andor Films || Sam Wanamaker (director); Ray Harryhausen, Beverley Cross (screenplay); Patrick Wayne, Taryn Power, Margaret Whiting, Jane Seymour, Patrick Troughton, Kurt Christian, Nadim Sawalha, Damien Thomas, Bruno Barnabe, Bernard Kay, Salami Coker, David Sterne, Peter Mayhew || Fantasy || Live Action"]}, {"page": "1959 in literature", "response": ["*Beverley Cross – One More River"]}, {"page": "1960 in literature", "response": ["*Beverley Cross – Strip the Willow"]}, {"page": "Jason and the Argonauts (1963 film)", "response": ["Category:Films with screenplays by Beverley Cross"]}, {"page": "Tony Award for Best Musical", "response": ["| Beverley Cross"]}, {"page": "List of musicals: A to L", "response": ["| Beverley Cross"]}, {"page": "List of show business families", "response": ["* Actor Sir Robert Stephens is the father of actors Chris Larkin and Toby Stephens through his third wife Dame Maggie Smith. He later married actress Patricia Quinn, whose nephew is rock musician Jonny Quinn. Smith later remarried playwright and screenwriter Beverley Cross."]}, {"page": "Marti Webb", "response": ["Webb first came to prominence as Ann Pornick in the original London production of Half a Sixpence opposite Tommy Steele, citing her first leading role as a career highlight.Shenton, Mark. \"20 Questions With... Marti Webb\", \"What's on Stage\", 9 February 2004. The playwright Beverley Cross's father George was the company manager on the production of Stop the World, I Want to Get Off and recommended his son audition Webb for the role. She was offered the role after thirteen auditions and later dubbed the singing voice of Julia Foster, her replacement for the film adaptation. Webb later commented of Foster, \"She has quite a notable voice, so it's not too hard to pick it up.\""]}, {"page": "Richard Rodney Bennett", "response": ["*The Mines of Sulphur (libretto by Beverley Cross) – 1965", "*All the King's Men (libretto by Beverley Cross) – 1968", "*Victory (libretto by Beverley Cross) – 1970"]}, {"page": "Clash of the Titans (1981 film)", "response": ["Clash of the Titans is a 1981 fantasy adventure film directed by Desmond Davis and written by Beverley Cross which is loosely based on the Greek myth of Perseus. It stars Harry Hamlin, Judi Bowker, Burgess Meredith, Maggie Smith and Laurence Olivier. The film features the final work of stop-motion visual effects artist Ray Harryhausen. It was released on June 12, 1981 and grossed $41 million at the North American box office,Clash of the Titans (1981) – BoxOfficeMojo.com . which made it the 11th-highest-grossing film of the year. A novelization of the film by Alan Dean Foster was published in 1981.", "The film was the idea of writer Beverley Cross.Ray Harryhausen Talks About His Cinematic Magic. Tasker, Ann. American Cinematographer; Hollywood Vol. 62, Iss. 6,  (Jun 1981): 556–558, 600–615. In 1978, Andor Films submitted a copy of the script to the British Board of Film Classification, seeking advice on how to secure either a \"U\" or an \"A\" certificate. The draft script included scenes which the BBFC considered would be unacceptable under those certificates, including the Kraken tearing Pegasus to pieces and Andromeda appearing naked during the climax of the film. Changes to the script and, on submission, some cuts to Perseus's final battle with Calibos were made and the film secured the \"A\" certificate: \"Those aged 5 and older admitted, but not recommended for children under 14 years of age\".From the Archive….we look back at Clash of the Titans, BBFC, retrieved 2012-03-13", "The film's screenwriter, Beverley Cross, was married to Maggie Smith, who played Thetis, until his death in 1998. Cross worked with producer Charles H. Schneer before, writing the screenplay for Schneer's production of Jason and the Argonauts.", "Category:Films with screenplays by Beverley Cross"]}, {"page": "Pangbourne College", "response": ["*Beverley Cross, playwright of Half a Sixpence, starring Tommy Steele, among many other productions, and late husband to actress Dame Maggie Smith."]}, {"page": "Tony Award for Best Book of a Musical", "response": ["| Beverley Cross"]}, {"page": "Half a Sixpence", "response": ["Half a Sixpence is a musical comedy based on the 1905 novel Kipps by H. G. Wells, with music and lyrics by David Heneker and a book by Beverley Cross. It was written as a vehicle for British pop star Tommy Steele.", "| Beverley Cross"]}, {"page": "The Long Ships (film)", "response": ["Category:Films with screenplays by Beverley Cross"]}, {"page": "Sinbad and the Eye of the Tiger", "response": ["Category:Films with screenplays by Beverley Cross"]}, {"page": "Kipps", "response": ["* The stage musical Half a Sixpence by David Heneker and Beverley Cross, based on Kipps, was originally mounted on London's West End as a star vehicle for Tommy Steele and transferred to Broadway (with Steele) in the 1965–1966 season. It was filmed in 1967, again with Steele in the starring role."]}, {"page": "Bryan Pringle", "response": ["Pringle started as a member of the Old Vic company between 1955 and 1957, appearing with Coral Browne, John Neville, Claire Bloom and others in several Shakespeare plays and touring with four of them - Romeo and Juliet, Richard II, Troilus and Cressida and Macbeth - in the USA. He then moved to Nottingham Playhouse, where he appeared in the Willis Hall drama Boys It's All Hell and was the only cast member to travel with the play to London. There, Lindsay Anderson remounted it as The Long and the Short and the Tall at the Royal Court Theatre in January 1959; also starring Peter O'Toole and Robert Shaw, the play transferred to the New Theatre in April.Frances Stephens, Theatre World Annual (London) Number 10, Barrie & Rockliff, London 1959, pages 99-101 Later that year, in October, Pringle appeared opposite Robert Shaw again in Guy Hamilton's production of the Beverley Cross play One More River at the Duke of York's Theatre.Frances Stephens, Theatre World Annual (London) Number 11, Barrie & Rockliff, London 1960, page 27"]}, {"page": "List of Sundance Film Festival selections", "response": ["|Beverley Cross, Jan Read"]}, {"page": "Robert Drivas", "response": ["He made his Broadway debut in the role of Ramses in 1958 in the play The Firstborn, directed by and starring Anthony Quayle as Moses. He continued to perform on stage, as Jacko in the Beverley Cross play One More River (1960), with George C. Scott in the Warsaw Ghetto play The Wall (1960), as Alfred Drake's son Giorgio in the Italian Renaissance set Lorenzo (1963), as the British beatnik son of Cyril Ritchard in The Irregular Verb to Love (1963), and in And Things That Go Bump in the Night (1965), which he also directed. In 1963 he won a Theatre World Award for his performance in Mrs. Dally Has a Lover (opposite Estelle Parsons)."]}, {"page": "The Mines of Sulphur", "response": ["The Mines of Sulphur is an opera in three acts by Richard Rodney Bennett, his first full-length opera, composed in 1963.  Beverley Cross wrote the libretto, based on his play Scarlet Ribbons, at the suggestion of Colin Graham, who eventually directed the first production in 1965.Obituary for Colin Graham, Elizabeth Forbes, The Independent, 11 April 2007.   The opera is dedicated to Benjamin Britten, whose Aldeburgh Festival had originally commissioned the opera.  "]}, {"page": "Boeing-Boeing (play)", "response": ["Boeing-Boeing is a farce written by the French playwright Marc Camoletti. The English-language adaptation, translated by Beverley Cross, was first staged in London at the Apollo Theatre in 1962 and transferred to the Duchess Theatre in 1965, running for seven years. In 1991, the play was listed in the Guinness Book of Records as the most performed French play throughout the world."]}, {"page": "Marc Camoletti (playwright)", "response": ["Boeing-Boeing (1960) was an even greater success, and remains Camoletti's signature hit. The original 1962 London production, in an adaptation by Beverley Cross, opened at the Apollo Theatre, transferred to the Duchess, and ran for seven years, racking up more than 2,000 performances."]}, {"page": "Charles H. Schneer", "response": ["Schneer had one of his biggest successes with Jason and the Argonauts (1963), again with Harryhausen; the screenwriter was Beverley Cross who work with  Schneer on many future projects."]}, {"page": "Genghis Khan (1965 film)", "response": ["Category:Films with screenplays by Beverley Cross"]}, {"page": "Beverly Cross", "response": ["#REDIRECT Beverley Cross"]}, {"page": "Half a Sixpence (film)", "response": ["Half a Sixpence is a 1967 British musical film directed by George Sidney and choreographed by Gillian Lynne. The screenplay by Beverley Cross is adapted from his book for the 1963 stage musical of the same name, which was based on Kipps: The Story of a Simple Soul, a 1905 novel by H. G. Wells. The music and lyrics are by David Heneker.", "Category:Films with screenplays by Beverley Cross"]}, {"page": "Chichester Festival production history", "response": ["*The Scarlet Pimpernel by Baroness Orczy, revised by Beverley Cross, directed by Nicholas Hytner", "*Miranda by Beverley Cross, after Carlo Goldoni, directed by Wendy Toye"]}, {"page": "Tony Award for Best Author", "response": ["| Beverley Cross"]}, {"page": "19th Tony Awards", "response": ["** Beverley Cross – Half a Sixpence"]}, {"page": "The Rising of the Moon (opera)", "response": ["The Rising of the Moon is an operatic comedy in three acts composed by Nicholas Maw to a libretto by Beverley Cross. It premiered on 19 July 1970 at the Glyndebourne Festival conducted by Raymond Leppard and directed by Colin Graham. The title comes from the Irish patriotic song of the same name."]}, {"page": "Asolo Repertory Theatre production history", "response": ["* Boeing Boeing by Marc Camoletti, translated by Beverley Cross & Francis Evans, directed by Greg Leaming; January 21, 2011 – April 23, 2011"]}, {"page": "Clash of the Titans (film series)", "response": ["| Beverley Cross"]}, {"page": "1966 in British music", "response": ["*Jorrocks (the Happiest Man Alive) – music and lyrics by David Heneker and book by Beverley Cross (premièred on 22 September, starring Joss Ackland and Cheryl Kennedy)Over The Footlights"]}]}}