{"wiki_id": "http://www.wikidata.org/entity/Q327167", "itemLabel": "Kurt Mahler", "itemDescription": "German mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/Kurt_Mahler", "wikipedia_page": {"main": "Kurt Mahler FRS (26 July 1903, Krefeld, Germany – 25 February 1988, Canberra, Australia) was a German mathematician who worked in the fields of transcendental number theory, diophantine approximation, p-adic analysis, and the geometry of numbers.", "link_mentions": [{"page": "Transcendental number", "response": ["Using the explicit continued fraction expansion of , one can show that  is not a Liouville number (although the partial quotients in its continued fraction expansion are unbounded). Kurt Mahler showed in 1953 that  is also not a Liouville number. It is conjectured that all infinite continued fractions with bounded terms that are not eventually periodic are transcendental (eventually periodic continued fractions correspond to quadratic irrationals).."]}, {"page": "P-adic analysis", "response": ["Mahler's theorem, introduced by Kurt Mahler,"]}, {"page": "D. H. Lehmer", "response": ["The year 1938-1939 was spent in England on a Guggenheim Fellowship visiting both the University of Cambridge and the University of Manchester, meeting G. H. Hardy, John Edensor Littlewood, Harold Davenport, Kurt Mahler, Louis Mordell, and Paul Erdős. The Lehmers returned to America by ship with second child Donald just before the beginning of the Battle of the Atlantic."]}, {"page": "J-invariant", "response": ["The  function has numerous other transcendental properties.  Kurt Mahler conjectured a particular transcendence result that is often referred to as Mahler's conjecture, though it was proved as a corollary of results by Yu. V. Nesterenko and Patrice Phillipon in the 1990s.  Mahler's conjecture was that if  was in the upper half plane then  and  were never both simultaneously algebraic. Stronger results are now known, for example if  is algebraic then the following three numbers are algebraically independent, and thus at least two of them transcendental:"]}, {"page": "Scientific phenomena named after people", "response": ["* Mahler measure, Mahler's theorem – Kurt Mahler"]}, {"page": "Champernowne constant", "response": ["The simple continued fraction expansion of Champernowne's constant has been studied as well. Kurt Mahler showed that the constant is transcendental;K. Mahler, Arithmetische Eigenschaften einer Klasse von Dezimalbrüchen, Proc. Konin. Neder. Akad. Wet. Ser. A. 40 (1937), p. 421–428. therefore its continued fraction does not terminate (because it is not rational) and is aperiodic (because it is not an irreducible quadratic)."]}, {"page": "1929 in science", "response": ["* Kurt Mahler shows that the Prouhet–Thue–Morse constant is a transcendental number."]}, {"page": "Gelfond–Schneider theorem", "response": ["* Kurt Mahler proved the p-adic analogue of the theorem: if a and b are in Cp, the completion of the algebraic closure of Qp, and they are algebraic over Q, and if |a-1|_p<1 and |b-1|_p<1, then (\\log_p a)/(\\log_p b) is either rational or transcendental, where logp is the p-adic logarithm function."]}, {"page": "Carl Ludwig Siegel", "response": ["Siegel was born in Berlin, where he enrolled at the Humboldt University in Berlin in 1915 as a student in mathematics, astronomy, and physics. Amongst his teachers were Max Planck and Ferdinand Georg Frobenius, whose influence made the young Siegel abandon astronomy and turn towards number theory instead. His best student was Jürgen Moser, one of the founders of KAM theory (Kolmogorov–Arnold–Moser), which lies at the foundations of chaos theory. Another notable student was Kurt Mahler, the number theorist."]}, {"page": "Prouhet–Thue–Morse constant", "response": ["The Prouhet–Thue–Morse constant was shown to be transcendental by Kurt Mahler in 1929."]}, {"page": "List of Oceanian Jews", "response": ["*Kurt Mahler, mathematician"]}, {"page": "List of German Jews", "response": ["* Kurt Mahler, mathematician"]}, {"page": "Louis J. Mordell", "response": ["He took British citizenship in 1929. In Manchester he also built up the department, offering posts to a number of outstanding mathematicians who had been forced from posts on the continent of Europe. He brought in Reinhold Baer, G. Billing, Paul Erdős, Chao Ko, Kurt Mahler, and Beniamino Segre. He also recruited J. A. Todd, Patrick du Val, Harold Davenport and Laurence Chisholm Young, and invited distinguished visitors."]}, {"page": "Mahler measure", "response": ["The Mahler measure is named after the German-born Australian mathematician Kurt Mahler."]}, {"page": "Transcendental number theory", "response": ["Kurt Mahler in 1932 partitioned the transcendental numbers into 3 classes, called S, T, and U..  Definition of these classes draws on an extension of the idea of a Liouville number (cited above)."]}]}}