{"wiki_id": "http://www.wikidata.org/entity/Q327370", "itemLabel": "George Bellas Greenough", "itemDescription": "English geologist (1778–1855)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Bellas_Greenough", "wikipedia_page": {"main": "George Bellas Greenough FRS FGS (18 January 1778 – 2 April 1855) was a pioneering English geologist. He is best known as a synthesizer of geology rather than as an original researcher. \nTrained as a lawyer, he was a talented speaker and his annual addresses as founding president of the Geological Society of London were influential in identifying and guiding contemporary geological research. Greenough advocated an empirical approach to the early science; his scepticism of theoretical thinking courted controversy amongst some contemporaries, especially his doubts of the usefulness of fossils in correlating strata. He compiled a geological map of England and Wales, published in 1820 and in the penultimate year of his life used similar methods to produce the first geological map of British India. Greenough characterised himself as follows:\nbright eyes, silver hair, large mouth, ears and feet; fondness for generalisation, for system and clearliness; great diligence, patience and zeal; goodnature but hasty; firmness of principle;\nhand for gardening.", "link_mentions": [{"page": "Devonian", "response": ["The period is named after Devon, a county in southwestern England, where a controversial argument in the 1830s over the age and structure of the rocks found distributed throughout the county was eventually resolved by the definition of the Devonian Period in the geological timescale. The Great Devonian Controversy was a long period of vigorous argument and counter-argument between the main protagonists of Roderick Murchison with Adam Sedgwick against Henry De la Beche supported by George Bellas Greenough. Murchison and Sedgwick won the debate and named the period they proposed as the Devonian System."]}, {"page": "1778", "response": ["* January 18 – George Bellas Greenough, British geologist (d. 1855)"]}, {"page": "List of geologists", "response": ["* George Bellas Greenough (1778–1855), English, gentlemanly geologist, founding member and first President of the Geological Society"]}, {"page": "William Smith (geologist)", "response": ["A common narrative in some recent accounts of Smith’s life and his map asserts that rivalry built up between Smith and the first President of the Geological Society, George Bellas Greenough, who was also engaged in producing a geological map of England and Wales. However original sources point to this narrative not being the case and indicate Smith was used by John Farey Sr., another 'practical man' (i.e. mineral surveyor), to prosecute Farey's own grievances against the Geological Society in an article in The Philosophical Magazine by which he both started and fuelled the story that Smith was disrespected and there was ill-feeling towards him by the Geological Society men and Greenough in particular. In the following issue Greenough replied, publicly declaring his view as being non-antagonistic by stating:", "* George Bellas Greenough"]}, {"page": "John Nash (architect)", "response": ["Nash was a vehement advocate of the neoclassical revival endorsed by Soane, although he had lost interest in the plain stone edifices typical of the Georgian style, and instead advocated the use of stucco. Decimus Burton entered the office of Nash in 1815, where he worked alongside Augustus Charles Pugin, who detested the neoclassical style. Decimus established his own architectural practice in 1821. In 1821, Nash invited Decimus to design Cornwall Terrace in Regent's Park, and Decimus was also invited by George Bellas Greenough, a close friend of the Prince Regent, Humphry Davy, and Nash, to design Grove House in Regent's Park."]}, {"page": "Kensal Green Cemetery", "response": ["*George Bellas Greenough (1778–1855), geologist"]}, {"page": "James Parkinson", "response": ["Parkinson also contributed several papers to William Nicholson's \"A Journal of Natural Philosophy, Chemistry and the Arts\", and in the first, second, and fifth volumes of the \"Geological Society's Transactions\". He wrote a single volume Outlines of Oryctology in 1822, a more popular work. On 13 November 1807, Parkinson and other distinguished gentlemen met at the Freemasons' Tavern in London. The gathering included such great names as Sir Humphry Davy, Arthur Aikin, and George Bellas Greenough. This was to be the first meeting of the Geological Society of London.History of the Geological Society, UK."]}, {"page": "1807 in science", "response": ["*  The Geological Society is founded in London; among the more prominent founders are William Babington, James Parkinson, Humphry Davy and George Bellas Greenough."]}, {"page": "Ethnological Society of London", "response": ["In 1850 the Society was based at 17 Savile Row. It saw a period of decline in the middle of the decade. Among active members on the Council was William Devonshire Saull, who died in 1855. George Bellas Greenough was a vice-president.RAI page: Archive Contents 44 . Richard Cull's 1852 report mentioned Singapore connections, in particular James Richardson Logan.Journal of the Ethnological Society of London vol. III (1854), p. 171;archive.org."]}, {"page": "Geological Society of London", "response": ["The Society was founded on 13 November 1807 at the Freemasons' Tavern, Great Queen Street, in the Covent Garden district of London. Herries Davies, G.L. (2007) Whatever is Under the Earth: The Geological Society of London 1807 to 2007, London: Geological Society  It was partly the outcome of a previous club known as the Askesian Society. There were 13 founder members: William Babington, James Parkinson, Humphry Davy, George Bellas Greenough, Arthur Aikin, William Allen, Jacques Louis, Comte de Bournon, Richard Knight, James Laird, James Franck, William Haseldine Pepys, Richard Phillips, and William Phillips. It received its Royal Charter on 23 April 1825 from George IV."]}, {"page": "Etheldred Benett", "response": ["Benett's contribution to the early history of Wiltshire geology is significant as she felt at ease with, and corresponded extensively with, fellow geologists such as George Bellas Greenough (the first president of the Geological Society), Gideon Mantell, William Buckland, and Samuel Woodward. She freely gave her ideas and items from her fossil collection to worthy causes such as museums, sending one to St. Petersburg. Through exchanging numerous fossils with Mantell, a thorough understanding of the Lower Cretaceous sedimentary rocks of Southern England was reached.", "Contribution to geology and palaeontology Benett corresponded extensively with fellow geologists such as George Bellas Greenough, first president of the Geological Society, Gideon Mantell, William Buckland, and Samuel Woodward. On exchanging numerous fossils with Mantell, a thorough understanding of the Lower Cretaceous sedimentary rocks of Southern England was reached. Her work was recognised and appreciated by notable individuals of the time. Gideon Mantell described her as 'A lady of great talent and indefatigable research,' whilst the Sowerbys note her 'labours in the pursuit of geological information have been as useful as they have been incessant.' ", "In 1825, her painting of the meteorite which fell on County Limerick in September 1813 was deposited in Geological Society of London archives, presented in the University of Oxford by Reverend John Griffiths of Bishopstrow. The meteorite is 19 pounds in weight, and the streaked and dotted part represents the fracture. Because of her extensive collection, she wrote and privately published a monograph in 1831, which contains many of her drawings and sketches of mollusca and sponges such as her sketches of fossil Alcyonia (1816) from the Green Sand Formation at Warminster Common and the immediate vicinity of Warminster in Wiltshire. The Society holds two copies: one was given to George Bellas Greenough, and another to her friend Gideon Mantell. This work established her as a true, pioneering biostratigrapher, following but not always agreeing with the work of William Smith."]}, {"page": "Decimus Burton", "response": ["Whereas Decimus's father James Burton was vigorously industrious, and had become 'most gratifyingly rich', John Nash's early years in private practice, and his first speculative developments, which failed either to sell or let, were unsuccessful, and his consequent financial shortage was exacerbated by the 'crazily extravagant' wife whom he had married before he had completed his training, until he was declared bankrupt in 1783. To resolve his financial shortage, Nash cultivated the acquaintance of James Burton, who consented to patronize him. James Burton was responsible for the social and financial patronage of the majority of Nash's London designs, in addition to for their construction, and Decimus became acquainted with Nash through his father. Architectural scholar Guy Williams has written, 'John Nash relied on James Burton for moral and financial support in his great enterprises. Decimus had showed precocious talent as a draughtsman and as an exponent of the classical style... John Nash needed the son's aid, as well as the father's'. Subsequent to the Crown Estate's refusal to finance them, James Burton agreed to personally finance the construction projects of John Nash at Regent's Park, which he had already been commissioned to construct. In return, Nash agreed to promote the career of Decimus Burton. Nash was a vehement advocate of the neoclassical revival endorsed by Soane, although he had lost interest in the plain stone edifices typical of the Georgian style, and instead advocated the use of stucco. Decimus Burton entered the office of Nash in 1815, where he worked alongside Augustus Charles Pugin, who detested the neoclassical style. Decimus established his own architectural practice in 1821. In 1821, Nash invited Decimus to design Cornwall Terrace in Regent's Park, and Decimus was also invited by George Bellas Greenough, a close friend of the Prince Regent, Humphry Davy, and Nash, to design Grove House in Regent's Park. Greenough's invitation to Decimus Burton was 'virtually a family affair', for Greenhough had dined frequently with Decimus's parents and Decimus's brothers, including the physician Henry Burton. Greenough and Decimus finalized their designs during numerous meetings at the opera. Decimus's design, when the villa had been completed, was described in The Proceedings of the Royal Society as, 'One of the most elegant and successful adaptations of the Grecian style to purposes of modern domestic architecture to be found in this or any country'. Subsequently, Nash invited Burton to design Clarence Terrace, Regent's Park. Nash was appointed architectural 'overseer' for Decimus's Regent's Park projects: Cornwall Terrace, York Terrace, Chester Terrace, Clarence Terrace, the villas along the Inner Circle, including The Holme and the London Colosseum attraction, to Thomas Hornor's specifications. However, to Nash's great annoyance, Decimus disregarded the latter's advice and developed the terraces according to his own style. As a result, Nash sought, unsuccessfully, to demolish and completely rebuild Chester Terrace. Decimus subsequently eclipsed his master and emerged as the dominant force in the design of Carlton House Terrace, where he exclusively designed No. 3 and No.4. Decimus also designed some of the villas of the Inner Circle: his villa for the Marquess of Hertford has been described as, 'decorated simplicity, such as the hand of taste, aided by the purse of wealth can alone execute'.", "The Burtons' social circle included Princess Victoria; the Duchess of Kent; William Cavendish, 6th Duke of Devonshire; John Wilson Croker; John Nash; Sir Humphry Davy; George Bellas Greenough; Sir Peter Hesketh-Fleetwood; and their Canadian cousin, Thomas Chandler Haliburton. Decimus and his siblings, Jane, James (born 1786), Septimus, the solicitor, Octavia, and Jessy, would host Thomas on his visits to London."]}, {"page": "Jean-Baptiste Élie de Beaumont", "response": ["Élie de Beaumont was born at Canon, in Calvados. He was educated at the Lycee Henri IV where he took the first prize in mathematics and physics at the École polytechnique, where he stood first at the exit examination in 1819; and at the École des mines (1819–1822), where he began to show a decided preference for the science with which his name is associated. In 1823 he was selected along with Dufrénoy by Brochant de Villiers, the professor of geology in the École des Mines, to accompany him on a scientific tour to England and Scotland, in order to inspect the mining and metallurgical establishments of the country, and to study the principles on which George Bellas Greenough's geological map of England (1820) had been prepared, with a view to the construction of a similar map of France."]}, {"page": "Flood geology", "response": [" This sentence was removed after the second edition, and Jameson's position changed as shown by his notes in successive editions, but it influenced British views of Cuvier's concept. In 1819, George Bellas Greenough, first president of The Geological Society, issued A Critical Examination of the First Principles of Geology stating that unless erratic boulders deposited hundreds of miles from their original sources had been moved by seas, rivers, or collapsing lakes, \"the only remaining cause, to which these effects can be ascribed, is a Debacle or Deluge.\""]}]}}