{"wiki_id": "http://www.wikidata.org/entity/Q3278614", "itemLabel": "Andromeda Tonks", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Andromeda_Tonks", "wikipedia_page": {"main": "The following are supporting characters in the Harry Potter series written by J. K. Rowling. For members of the Order of the Phoenix, Dumbledore's Army, Hogwarts staff, Ministry of Magic, or for Death Eaters, see the respective articles.", "link_mentions": [{"page": "Draco Malfoy", "response": ["The Malfoy family is one of the few remaining pure-blood wizarding clans in the Harry Potter series, and among the wealthiest. The anti-Muggle editor Brutus Malfoy is their ancestor. Lucius Malfoy was a Death Eater during both wizard wars. He marries Narcissa Black and together they have one son, Draco, who is the first Malfoy family member introduced in the series. The Malfoys are related to the Black family through Narcissa (a first cousin of Sirius Black, Harry's godfather), which makes Draco a nephew of both Bellatrix Lestrange and Andromeda Tonks. Draco is also Nymphadora Tonks' first cousin through their mothers. Three of Draco's grandparents are identified: Abraxas Malfoy, Cygnus Black, and Druella Rosier. Abraxas died before the series begins and was a friend of Professor Slughorn. Draco is, therefore, the scion of two old magical families. The Malfoy home, Malfoy Manor, is an elegant mansion located in the western English county of Wiltshire. They were served by Dobby the house elf until the end of Harry Potter and the Chamber of Secrets."]}, {"page": "Order of the Phoenix (fictional organisation)", "response": ["She is described as having \"a pale heart-shaped face, dark twinkling eyes\", and is usually depicted with different hair colours, which she can change at will. Tonks is seen to be notoriously clumsy and unskilled at household spells. Nymphadora is the only daughter of Ted and Andromeda Tonks, the latter being sister to Bellatrix Lestrange and Narcissa Malfoy; Nymphadora is therefore Draco Malfoy's first cousin yet she never addresses him as family, alluding to him simply as \"the Malfoy boy\". Tonks is sorted into Hufflepuff,What House was Tonks In? and graduates from Hogwarts one year before Harry enters, after which she begins three years of Auror training; under Moody's tutelage, she qualifies as an Auror one year before her first appearance in Order of the Phoenix."]}, {"page": "List of Harry Potter characters", "response": ["*Narcissa Malfoy – Lucius' wife and Draco's mother. Sister of Bellatrix Lestrange and Andromeda Tonks.", "*Andromeda Tonks – Sister of Bellatrix Lestrange and Narcissa Malfoy, and the mother of Nymphadora Tonks. Disowned by her family for marrying Muggle-born Ted Tonks."]}, {"page": "Magical objects in Harry Potter", "response": ["The bike is severely damaged when, with Hagrid and Harry aboard, it crashes into Ted and Andromeda Tonks' garden pond. Mr. Weasley covertly tells Harry that he plans to put the bike back together when \"he has time\", meaning when Mrs. Weasley is distracted or has forgotten about it. He hides it in the chicken coop and manages to repair it, giving it to Harry between the end of Deathly Hallows and the epilogue. The bike is now still in Harry's possession, but he doesn't use it."]}, {"page": "List of fictional witches", "response": ["*Andromeda Tonks (Harry Potter)"]}, {"page": "Tonks", "response": ["*Andromeda Tonks"]}, {"page": "Black (surname)", "response": ["*Andromeda Tonks (née Black), fictional character in the Harry Potter novels"]}, {"page": "Andromeda", "response": ["* Andromeda Tonks, a character in the Harry Potter series of novels and films"]}, {"page": "Sirius Black", "response": ["Sirius Black is the last heir of the House of Black, a once notable Pure-blood Wizarding family. His parents, Orion and Walburga Black, were both Blacks by birth and second cousins. Sirius had a younger brother, Regulus Arcturus Black, and three older cousins: Bellatrix Lestrange, Andromeda Tonks (his favourite cousin and mother of Nymphadora Tonks), and Narcissa Malfoy (mother of Draco Malfoy). In line with the Black family tradition of naming children after stars and constellations, Sirius was named after the Dog Star. Sirius's early life proved unhappy; he had come to hate most of his relatives, in particular his mother. He rejected his family's pure-blood elitism and reverence for the Dark Arts. At Hogwarts, rather than be sorted into Slytherin like the rest of his family, Sirius was placed in Gryffindor."]}, {"page": "Remus Lupin", "response": ["Lupin commands a group of defenders on the school grounds during the Battle of Hogwarts and is last mentioned to be duelling Antonin Dolohov. Both Lupin and Tonks die in combat, killed by Dolohov and Bellatrix Lestrange, respectively, leaving Teddy an orphan with Harry Potter as his godfather and Andromeda Tonks as his guardian. JK Rowling has since stated that she originally intended for both Lupin and Tonks to survive.JK Rowling interview"]}]}}