{"wiki_id": "http://www.wikidata.org/entity/Q327196", "itemLabel": "Joseph Silk", "itemDescription": "British-American astronomer", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Silk", "wikipedia_page": {"main": "Joseph Ivor Silk FRS (born 3 December 1942) is a British-American astrophysicist. He was the Savilian Chair of Astronomy at the University of Oxford from 1999 to September 2011. \nHe is an Emeritus Fellow of New College, Oxford and a Fellow of the Royal Society (elected May 1999). He was awarded the 2011 Balzan Prize for his works on the early Universe. Silk has given more than two hundred invited conference lectures, primarily on galaxy formation and cosmology.\n\n", "link_mentions": [{"page": "Max Tegmark", "response": ["Tegmark left Sweden in 1990 after receiving his M.Sc. in Engineering physics from the Royal Institute of Technology. (He had earned a B.A. in economics the previous year at the Stockholm School of Economics.) His first academic venture beyond Scandinavia brought him to California, where he studied physics at the University of California, Berkeley, earning his M.A. in 1992, and Ph.D. in 1994 under the supervision of Joseph Silk."]}, {"page": "John D. Barrow", "response": ["* The Left Hand of Creation: The Origin and Evolution of the Expanding Universe, Barrow J., and Joseph Silk, Oxford UP, 1983"]}, {"page": "Henry Norris Russell Lectureship", "response": ["|Joseph Silk"]}, {"page": "Gold Medal of the Royal Astronomical Society", "response": ["| 2008 || Joseph Silk || Brian Kennett || || "]}, {"page": "Tired light", "response": ["Tired light mechanisms were among the proposed alternatives to the Big Bang and the Steady State cosmologies, both of which relied on the general relativistic expansion of the universe of the FRW metric. Through the middle of the twentieth century, most cosmologists supported one of these two paradigms, but there were a few scientists, especially those who were working on alternatives to general relativity, who worked with the tired light alternative. As the discipline of observational cosmology developed in the late twentieth century and the associated data became more numerous and accurate, the Big Bang emerged as the cosmological theory most supported by the observational evidence, and it remains the accepted consensus model with a current parametrization that precisely specifies the state and evolution of the universe. Although the proposals of \"tired light cosmologies\" are now more-or-less relegated to the dustbin of history, as a completely alternative proposal tired-light cosmologies were considered a remote possibility worthy of some consideration in cosmology texts well into the 1980s, though it was dismissed as an unlikely and ad hoc proposal by mainstream astrophysicists.See, for example, p. 397 of Joseph Silk's book, The Big Bang. (1980) W. H. Freeman and Company. ."]}, {"page": "Silk (disambiguation)", "response": ["*Joseph Silk (born 1942), American professor and astronomer"]}, {"page": "Rychard Bouwens", "response": ["Rychard J. Bouwens is an associate professor at Leiden University.  He is also a former member of the Advanced Camera for Surveys Guaranteed Time Observation team and postdoctoral research astronomer at the University of California, Santa Cruz.  He obtained his bachelor's degree in physics, chemistry, and mathematics from Hope College. He then went on to earn his Ph.D. in physics at the University of California, Berkeley under the supervision of Joseph Silk and also worked with Tom Broadhurst."]}, {"page": "Royal Society Bakerian Medal", "response": ["*2007 Joseph Silk, The dark side of the Universe"]}]}}