{"wiki_id": "http://www.wikidata.org/entity/Q327049", "itemLabel": "Douglas William Jerrold", "itemDescription": "English dramatist and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Douglas_William_Jerrold", "wikipedia_page": {"main": "Douglas William Jerrold (London 3 January 1803 – 8 June 1857 London) was an English dramatist and writer.", "link_mentions": [{"page": "Charles Dickens", "response": ["In December 1845, Dickens took up the editorship of the London-based Daily News, a liberal paper through which Dickens hoped to advocate, in his own words, \"the Principles of Progress and Improvement, of Education and Civil and Religious Liberty and Equal Legislation.\" Among the other contributors Dickens chose to write for the paper were the radical economist Thomas Hodgskin and the social reformer Douglas William Jerrold, who frequently attacked the Corn Laws. Dickens lasted only ten weeks on the job before resigning due to a combination of exhaustion and frustration with one of the paper's co-owners."]}, {"page": "January 3", "response": ["* 1803 – Douglas William Jerrold, English journalist and playwright (d. 1857)"]}, {"page": "June 8", "response": ["*1857 – Douglas William Jerrold, English journalist and playwright (b. 1803)"]}, {"page": "1857 in literature", "response": ["*August 21 – 24 – Performances of Wilkie Collins' drama The Frozen Deep at the Free Trade Hall, Manchester, for the benefit of the widow of writer Douglas William Jerrold (died June 8), during which Charles Dickens, who is directing and performing, becomes infatuated with the professional actress Ellen Ternan.", "*June 8 – Douglas William Jerrold, English dramatist (born 1803)"]}, {"page": "1832 in literature", "response": ["*Douglas William Jerrold"]}, {"page": "1830 in literature", "response": ["*Douglas William Jerrold – The Mutiny at the Nore"]}, {"page": "1829 in literature", "response": ["*Douglas William Jerrold – Black-Eyed Susan"]}, {"page": "1803 in literature", "response": ["*January 3 – Douglas William Jerrold, English dramatist (died 1857)"]}, {"page": "Gustave Doré", "response": ["Doré's illustrations for the Bible (1866) were a great success, and in 1867 Doré had a major exhibition of his work in London. This exhibition led to the foundation of the Doré Gallery in Bond Street, London.McQueen, A. \"Gustave Doré,\" in Nineteenth-Century Art, Highlights from the Tanenbaum Collection, London: 2015, p. 54. In 1869, Blanchard Jerrold, the son of Douglas William Jerrold, suggested that they work together to produce a comprehensive portrait of London. Jerrold had obtained the idea from The Microcosm of London produced by Rudolph Ackermann, William Pyne, and Thomas Rowlandson (published in three volumes from 1808 to 1810). Doré signed a five-year contract with the publishers Grant & Co that involved his staying in London for three months a year, and he received the vast sum of £10,000 a year for the project. Doré was mainly celebrated for his paintings in his day. His paintings remain world-renowned, but his woodcuts and engravings, like those he did for Jerrold, are where he excelled as an artist with an individual vision."]}, {"page": "Eugène François Vidocq", "response": ["It was not only plays inspired by Vidocq that were shown in the theatre. His one life story also made it on stage several times, usually with his memoirs as a literary template. Especially in England, there was great enthusiasm for Vidocq. The memoirs had been rapidly translated into English, and a few months later, on 6 July 1829, the premiere of Vidocq! The French Police Spy was held at Surrey Theatre in the London Borough of Lambeth. The melodrama in two acts, produced by Robert William Elliston, was penned by Douglas William Jerrold, and the main character was played by TP Cooke. Although the critics, among them one from The Times, were quite positive, the play was performed only nine times in the first month and then dropped."]}, {"page": "John Leech (caricaturist)", "response": ["In 1845 Leech illustrated St Giles and St James in Douglas William Jerrold's new Shilling Magazine, with plates more vigorous and accomplished than those in Bentley, but it is in subjects of a somewhat later date, and especially in those lightly etched and meant to be printed with colour, that we see the artist's best powers with the needle and acid."]}, {"page": "A Child's History of England", "response": ["Dickens dedicated the book to \"My own dear children, whom I hope it may help, bye and bye, to read with interest larger and better books on the same subject\". The history covered the period between 50 BC and 1689, ending with a chapter summarising events from then until the accession of Queen Victoria. In a letter to his friend Douglas William Jerrold, Dickens confessed that he was composing the book so that he could prevent his children from embracing conservatism:"]}, {"page": "William Blanchard Jerrold", "response": ["He was born in London, the eldest son of the dramatist, Douglas William Jerrold. Due to his disagreements with the practices at the elite Mao (\"Martin's Academy at Old Slaughter's\") school, where he was educated for two and a half years, he left school and began working on newspapers at an early age."]}, {"page": "Miser", "response": ["John Overs, with a slight change to his name, became the subject of a three-act drama by Douglas William Jerrold, John Overy or The Miser of Southwark Ferry (1828), roughly based on an incident when he feigned death to save expenses and was killed by accident.The Dramatic Magazine 1, 1829 pp.78-9", "Douglas William Jerrold's John Overy or The Miser of Southwark Ferry, (1828)  also brings in a daughter whom the miser attempts to sell off as a mistress to her disguised lover.The Dramatic Magazine 1, 1829 p.79 Earlier Jerrold had written a one-act farce, The Smoked Miser or The Benefit of Hanging (1823), in which a miser tries to marry off his ward to advantage.Text at Victorian Plays project  Another farce produced in Canada, Major John Richardson's The Miser Outwitted (1841), had an Irish theme and dealt with a plot to trick a miser out of his money.Theatre Research in Canada, Spring 1986 The later Thomas Peckett Prest's The Miser of Shoreditch or the Curse of Avarice (1854) was based on a penny dreadful story by him; later he adapted it as a two-act romantic drama set in time of Henry VIII.Victorian Plays project "]}, {"page": "Muggletonianism", "response": ["In \"The Making of the English Working Class\" E. P. Thompson says, \"The Muggletonians (or followers of Ludovic Muggleton) were still preaching in the fields and parks of London at the end of the eighteenth century.\"E. P. Thompson, \"The Making of the English Working Class\", Harmondsworth: Penguin (1968) p. 52 Those Muggletons whose lives we know about would have rejected preaching as pointless and spiritually dangerous. Were there other groups of Muggletonians who operated differently? At present, historians cannot answer, but the possibility is there. Firstly, other denominations of that era, such as Methodists and Baptists, existed in a profusion of forms as E. P. Thompson's own index shows. Secondly, contact between those Muggletonians about whom we do know was sporadic, at best. \"For example, those in Derbyshire were ignorant of the existence of any persons entertaining the same faith in London until one of their number removed thither to seek employment and, after residing there a short time, heard of the London bretheren by mere accident.\"William Ridsdale of Lenton, Nottingham in a letter to the Inquirer March 21, 1863 Thirdly, the name existed widely in the public domain without much knowledge of what it meant. Sir Walter Scott received eternal damnation for his ignorant remarks in Woodstock. Charles Dickens incorporates All-Muggleton into Pickwick Papers. A character called Mrs Snowdrop in Douglas William Jerrold's Nell Gwynne (1833) says, \"Nothing now will serve her but to go upon the stage. Tisn't my fault. I'm sure I put the pious Mr Muggleton under her pillow every night.\""]}, {"page": "List of San Francisco placename etymologies", "response": ["| Jerrold Avenue || Douglas William Jerrold ||"]}, {"page": "Samuel Phelps", "response": ["Phelps made his début as Shylock in London at the Haymarket Theatre in 1837 and appeared under the management of William Charles Macready at the Theatre Royal, Drury Lane, who recognized Phelps as a potential rival and gave him little opportunity to display his talents, although Phelps did gain popularity in the roles of Captain Channel in Douglas William Jerrold's melodrama The Prisoner of War (1842), and of Lord Tresham in Robert Browning's A Blot in the 'Scutcheon (1843)."]}, {"page": "Harriette Deborah Lacy", "response": ["Taylor's first London appearance was in 1830 as Nina, in William Dimond's Carnival of Naples. Her Rosalind, Aspatia (to Macready's Melantius) in The Bridal, and Lady Teazle to the Charles Surface of Walter Lacy (whom she was married in 1839) confirmed her position and popularity. She was the original Helen in The Hunchback (1832), and also created Nell Gwynne in Douglas William Jerrold's play of that name, and the heroine in his Housekeeper. She was considered the leading Ophelia of her day. She retired in 1848."]}, {"page": "Nineteenth-century theatre", "response": ["Percy Bysshe Shelley and Lord Byron were the most important literary dramatists of their time (although Shelley's plays were not performed until later in the century). Shakespeare was enormously popular, and began to be performed with texts closer to the original, as the drastic rewriting of 17th and 18th century performing versions for the theatre were gradually removed over the first half of the century. Kotzebue's plays were translated into English and Thomas Holcroft's A Tale of Mystery was the first of many English melodramas. Pierce Egan, Douglas William Jerrold, Edward Fitzball, James Roland MacLaren and John Baldwin Buckstone initiated a trend towards more contemporary and rural stories in preference to the usual historical or fantastical melodramas. James Sheridan Knowles and Edward Bulwer-Lytton established a \"gentlemanly\" drama that began to re-establish the former prestige of the theatre with the aristocracy.Brockett and Hildy (2003, 297–298).thumb|left|Henry Irving portrait"]}, {"page": "Jerrold", "response": ["*Douglas William Jerrold (1803–1857), English dramatist and writer"]}, {"page": "List of playwrights by nationality and year of birth", "response": ["*(1803–1857) Douglas William Jerrold"]}, {"page": "Royal Strand Theatre", "response": ["The theatre was again closed under the Patent Acts in March 1835, and the owners brought before the magistrates. It reopened on 25 April 1836, with the necessary licence, under the management of Douglas William Jerrold and William John Hammond. The theatre was enlarged in 1836 and a gallery added in 1839. In 1849 the manager was William Farren. For a while in 1851 it was owned by William Robert Copeland, and known as Punch's' Playhouse and Marionette Theatre. In 1856 the manager was T. Payne."]}, {"page": "Literary Taste: How to Form It", "response": ["* Douglas William Jerrold: Mrs Caudle's Curtain Lectures*"]}, {"page": "Samuel Elliott Hoskins", "response": ["Hoskins was educated at Topsham and Exeter, and, destined for the Guernsey bar was placed under Advocate Charles de Jersey. After a year he gave up the law for medicine. From 1818 to 1820 he was at the united hospitals of Guy's and St. Thomas's, London. He passed as a licentiate of the Society of Apothecaries in 1821, as a member of the Royal College of Surgeons of England in 1822, as an extra licentiate of the Royal College of Physicians in 1834, and a fellow in 1859. While a student he came to know Astley Cooper, Samuel Taylor Coleridge, Charles Lamb, Thomas De Quincey, Thomas Talfourd, and Douglas William Jerrold. After passing his surgical examination he returned to Guernsey and entered into partnership with his old instructor, Dr. Brock. He studied for a short time in Paris in 1827, and settled finally in the Channel Islands."]}, {"page": "Theatre of the United Kingdom", "response": ["In 1847, a critic using the pseudonym Dramaticus published a pamphletDramaticus The stage as it is (1847) describing the parlous state of British theatre. Production of serious plays was restricted to the patent theatres, and new plays were subjected to censorship by the Lord Chamberlain's Office. At the same time, there was a burgeoning theatre sector featuring a diet of low melodrama and musical burlesque; but critics described British theatre as driven by commercialism and a 'star' system. Kotzebue's plays were translated into English and Thomas Holcroft's A Tale of Mystery was the first of many English melodramas. Pierce Egan, Douglas William Jerrold, Edward Fitzball, James Roland MacLaren and John Baldwin Buckstone initiated a trend towards more contemporary and rural stories in preference to the usual historical or fantastical melodramas. James Sheridan Knowles and Edward Bulwer-Lytton established a \"gentlemanly\" drama that began to re-establish the former prestige of the theatre with the aristocracy.Brockett and Hildy (2003, 297–298)."]}, {"page": "Edward Loder", "response": ["*Black-Eyed Susan, or All in the Downs, incidental music for the melodrama by Douglas William Jerrold (18 November 1830, Theatre Royal, Bath)"]}]}}