{"wiki_id": "http://www.wikidata.org/entity/Q327457", "itemLabel": "Bruce Shand", "itemDescription": "British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bruce_Shand", "wikipedia_page": {"main": "Major Bruce Middleton Hope Shand  (22 January 1917 – 11 June 2006) was an officer in the British Army.  He is best known as the father of Camilla, Duchess of Cornwall, the second wife of Charles, Prince of Wales.", "link_mentions": [{"page": "June 11", "response": ["*  2006   – Bruce Shand, English soldier (b. 1917)"]}, {"page": "Camilla, Duchess of Cornwall", "response": ["Camilla Rosemary Shand was born at King's College Hospital, London, on 17 July 1947.Graham, p. 9Some sources report that she was born in Plumpton, but it seems that this is a confusion of her childhood home with her birthplace. She grew up in The Laines—an 18th-century country house in Plumpton, East Sussex—and a three-storey house in South Kensington, her family's second home. Her parents were British Army officer-turned-businessman Major Bruce Shand and his wife Rosalind, the daughter of Roland Cubitt, 3rd Baron Ashcombe. She has a younger sister, Annabel Elliot, and had a younger brother, Mark Shand. One of her maternal great-grandmothers, Alice Keppel, was a mistress of King Edward VII from 1898 to 1910. On 1 November 1947, Camilla was baptised at Firle Church, East Sussex. Camilla's mother was a housewife, while her father had various business interests after retiring from the army. He was most notably a partner in Block, Grey and Block, a firm of wine merchants in South Audley Street, Mayfair, later joining Ellis, Son and Vidler of Hastings and London."]}, {"page": "Royal coat of arms of the United Kingdom", "response": ["||The arms of the Prince of Wales impaled with those of her father, Major Bruce Shand, crowned with the single-arched Coronet of Prince of Wales."]}, {"page": "Elspeth Howe", "response": ["Howe is the daughter of the writer Philip Morton Shand  by his fourth wife, Sybil Mary Shand (née Sissons, previously Mrs. Slee). As such, she is a half-aunt to Camilla, Duchess of Cornwall (née Shand, formerly Parker Bowles), whose father, Bruce Shand, was son of P. Morton Shand by a previous marriage. Elspeth Shand was educated at Wycombe Abbey, a leading private school for girls, and at the London School of Economics. She married the rising politician Geoffrey Howe in 1953, and had three children, Caroline (Cary), and twins, Amanda and Alec."]}, {"page": "Stourpaine", "response": ["After a funeral service at the Holy Trinity Church in Stourpaine on 16 June, Major Bruce Shand's body was cremated. The funeral of his son Mark was also at Stourpaine."]}, {"page": "Wedding of Prince Charles and Camilla Parker Bowles", "response": ["* Major Bruce Shand, the bride's father"]}, {"page": "Plumpton, East Sussex", "response": ["*Camilla, Duchess of Cornwall, second wife of Charles, Prince of Wales, and eldest daughter of Major Bruce Shand, grew up in the former rectory known as The Laines."]}, {"page": "Deaths in June 2006", "response": ["*Bruce Shand, 89, British Army officer, father of Camilla, The Duchess of Cornwall, and father-in-law of Charles, Prince of Wales, cancer."]}, {"page": "William Elliot (RAF officer)", "response": ["In 1931 he married Rosemary Chancellor, daughter of Sir John Chancellor.'ELLIOT, Air Chief Marshal Sir William', Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2008; online edn, Oxford University Press, Dec 2012 ; online edn, Nov 2012 accessed 4 Oct 2013 Sir William and Lady Elliot had a daughter, Louise, and a son, Simon. In 1970, Louise married Stephen Simmons Halsey, an American corporate executive with American Express; over the course of their lives they have resided in New York City, Paris, Hong Kong, Hawaii, and Oregon. In 1972, Simon married Annabel, the daughter of Bruce Shand and sister of Camilla, Duchess of Cornwall.The Peerage.com – Air Chief Marshal Sir William Elliott"]}, {"page": "Shand", "response": ["* Bruce Shand (1917–2006), British Army major, father of Camilla, Duchess of Cornwall"]}, {"page": "Mark Shand", "response": ["Shand was born on 28 June 1951, as the son of Major Bruce Shand (1917–2006) and his wife, the Hon. Rosalind Maud Cubitt (1921–1994), daughter of the 3rd Baron Ashcombe and the former Sonia Rosemary Keppel, daughter of Alice Keppel. He was the brother of Camilla, Duchess of Cornwall, and Annabel Elliot."]}, {"page": "Charles Palmer-Tomkinson", "response": ["* Photograph of Patti Palmer-Tomkinson at the 11 September 2006 memorial service for Bruce Shand, father-in-law of Prince Charles., Retrieved 5 June 2007."]}, {"page": "List of Old Rugbeians", "response": ["* Major Bruce Shand, MC and Bar, officer in the British Army and father of Camilla, HRH The Duchess of Cornwall"]}, {"page": "Philip Morton Shand", "response": ["Shand was married four times. His first marriage was to Edith Marguerite Harrington in April 1916, with whom he had a son, Bruce Shand, father to Camilla, Duchess of Cornwall.  They divorced in 1920."]}, {"page": "Reresby Sitwell", "response": ["He was the nephew of poet and critic Dame Edith Sitwell.Sir Reresby Sitwell, Bt, Timesonline. Retrieved 1 April 2009 During his lifetime, Sitwell wrote a new variation upon the Robin Hood tale, was a partner in a wine business with Bruce Shand, and became known for his support of the arts and the upkeep of Renishaw Hall."]}, {"page": "English heraldry", "response": ["|align=\"center\"|110px||The Duchess of Cornwall||The arms of the Prince of Wales impaled with those of her father, Major Bruce Shand, crowned by the single-arched Crown of Prince of Wales."]}, {"page": "Oflag IX-A/H", "response": ["* Major Bruce Shand, 7th Armoured Division. Captured in the Western Desert Campaign. Father of Camilla, Duchess of Cornwall, second wife of Charles, Prince of Wales."]}, {"page": "Bruce Middleton Hope Shand", "response": ["#REDIRECT Bruce Shand "]}, {"page": "Ben Elliot", "response": ["Elliot is the son of Simon Elliot, a Dorset landowner, and Annabel Elliot (née Shand), an interior designer and antiques dealer. He has two younger sisters, Alice and Catherine. His mother is the sister of Camilla, Duchess of Cornwall, and Mark Shand. His maternal grandparents were Major Bruce Shand and the Hon. Rosalind Cubitt."]}, {"page": "January 1917", "response": ["* Born: Michael Elkins, American journalist, foreign correspondent for CBS News and BBC News, in New York City (d. 2001); Bruce Shand, British noble and army officer, father to Camilla, Duchess of Cornwall, commander of the 12th Royal Lancers during World War II, in London (d. 2006)"]}, {"page": "Herbert Charles Tippet", "response": ["In November 1921 Tippet married Edith Marguerite Shand (née Harrington), a divorcée, formerly married to architectural critic and writer Philip Morton Shand, at St. Martin-in-the-Fields, London.England and Wales Marriage Index, Q4 1921, London, vol. 1a, p. 1320 The only child of her first marriage, Bruce Shand (1917–2006) married the Hon. Rosalind Cubitt, daughter of Roland Cubitt, 3rd Baron Ashcombe, and was later to become the father of Camilla, Duchess of Cornwall. Immediately after his marriage, Tippet left England to take up his position at Meadow Brook in New York,Cunard liner \"Aquitania\" out of Southampton, arrived New York 11 November 1921, New York Passenger Lists 1820-1957 his wife and step-son following him in December 1921.White Star liner \"Cedric\" out of Liverpool for New York 10 December 1921, UK Board of Trade, Outward Passenger Lists 1890-1960 Mrs. Tippet and Bruce Shand returned briefly to the UK in June 1923 before returning to America in September,Cunard liner \"Carmania\" out of Liverpool, arrived New York 3 September 1923, New York Passenger Lists 1820-1957 stating their intention to take US citizenship, although this subsequently did not happen.US Department of Immigration records via Ellis Island Foundation They remained in America until 1927Cunard liner \"Alaunia\" out of New York, arrived Liverpool 4 April 1927, UK Board of Trade, Incoming Passenger Lists 1878-1960 when Tippet returned to take up his post at Royal Wimbledon; Bruce Shand going to Rugby School, an education paid for by the Shands with whom the Tippets remained friends. Indeed, following the death of her husband in 1936, Morton Shand's mother Augusta, lived with the Tippets in Banstead, Surrey. Edith Tippet survived her husband by thirty-three years, dying at Cooden Beach, Bexhill, Sussex in 1981. There were no children of the marriage."]}]}}