{"wiki_id": "http://www.wikidata.org/entity/Q3277117", "itemLabel": "Tony Church", "itemDescription": "British actor (1930-2008)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Church", "wikipedia_page": {"main": "James Anthony Church (11 May 1930 – 25 March 2008) was an English actor, who has appeared on stage and screen. In 1989 he became the Dean of the National Theatre Conservatory, which is the teaching arm of the Denver Center Theatre Company in Denver, Colorado.", "link_mentions": [{"page": "Through the Looking-Glass", "response": ["* A dramatised audio-recorded version, directed by Douglas Cleverdon, was released in 1959 by Argo Records. The book is narrated by Margaretta Scott, starring Jane Asher as Alice, along with actors Frank Duncan (Humpty Dumpty, Red King, Frog), Tony Church, Norman Shelley, and Carleton Hobbs.Cleverdon, Douglas (1959). Alice Through the Looking Glass [sound recording]. Written by Lewis Carroll (1872). London: Argo. Retrieved via National Library of Australia and Archived on 10 April 2020."]}, {"page": "Royal Shakespeare Company", "response": ["*  King Lear, directed by Peter Brook and starring Paul Scofield as Lear, Irene Worth as Goneril, Patience Collier as Regan, Diana Rigg as Cordelia, Peter Jeffrey as the Duke of Albany, Tony Church as the Duke of Cornwall, Alan Webb as the Earl of Gloucester, Tom Fleming as the Earl of Kent, Brian Murray as Edgar, James Booth as Edmund, Clive Swift as Oswald, and Alec McCowen as the Fool. (1962)"]}, {"page": "1983 in film", "response": ["| Krull || Columbia Pictures / Barclays Mercantile / Industrial Finance || Peter Yates (director); Stanford Sherman (screenplay); Ken Marshall, Lysette Anthony, Freddie Jones, Francesca Annis, Trevor Martin, David Battley, Bernard Bresslaw, Alun Armstrong, Liam Neeson, Robbie Coltrane, Michael Elphick, Dicken Ashworth, Todd Carty, Bronco McLoughlin, Gerard Naprous, Andy Bradford, Bill Weston, John Welsh, Graham McGrath, Tony Church, Clare McIntyre, Belinda Mayne || Sci-Fi, Fantasy || Live action", "| The Plague Dogs || Embassy Pictures / United Artists / Nepenthe Productions / Goldcrest Films || Martin Rosen (director/screenplay); John Hurt, Christopher Benjamin, James Bolam, Nigel Hawthorne, Warren Mitchell, Bernard Hepton, Brian Stirner, Penelope Lee, Geoffrey Matthews, Barbara Leigh-Hunt, John Bennett, John Franklyn-Robbins, Bill Maynard, Malcolm Terris, Judy Geeson, Philip Locke, Brian Spink, Tony Church, Anthony Valentine, William Lucas, Dandy Nichols, Rosemary Leach, Patrick Stewart, Percy Edwards || Adventure || Animation"]}, {"page": "1982 in film", "response": ["| The Plague Dogs || Embassy Pictures / United Artists / Nepenthe Productions / Goldcrest Films || Martin Rosen (director/screenplay); John Hurt, Christopher Benjamin, James Bolam, Nigel Hawthorne, Warren Mitchell, Bernard Hepton, Brian Stirner, Penelope Lee, Geoffrey Matthews, Barbara Leigh-Hunt, John Bennett, John Franklyn-Robbins, Bill Maynard, Malcolm Terris, Judy Geeson, Philip Locke, Brian Spink, Tony Church, Anthony Valentine, William Lucas, Dandy Nichols, Rosemary Leach, Patrick Stewart, Percy Edwards || Adventure || Animation"]}, {"page": "1979 in film", "response": ["| Tess || Columbia Pictures || Roman Polanski (director/screenplay); Gérard Brach, John Brownjohn (screenplay); Nastassja Kinski, Peter Firth, Leigh Lawson, John Collin, Rosemary Martin, Carolyn Pickles, Richard Pearson, David Markham, Pascale de Boysson, Suzanna Hamilton, Caroline Embling, Tony Church, Sylvia Coleridge, Fred Bryant, Tom Chadbon, Arielle Dombasle, Dicken Ashworth, Lesley Dunlop || Drama || Live Action"]}, {"page": "BBC Television Shakespeare", "response": ["The Prefaces to Shakespeare episode for King Lear was presented by Tony Church who had played the Fool in a 1962 RSC production directed by Peter Brook. The Shakespeare in Perspective episode was presented by literary critic Frank Kermode."]}, {"page": "Argo Records (UK)", "response": ["The company at this time recorded dramatised versions of Alice in Wonderland (1958) and Through the Looking-Glass, both directed by Douglas Cleverdon and both starring Jane Asher in the title role, with actors Tony Church, Norman Shelley, and Carleton Hobbs, with Margaretta Scott as the narrator; and The Wind in the Willows (1960), adapted and produced by Toby Robertson, with Richard Goolden as Mole, Frank Duncan as Rat, Tony Church as Badger, and Norman Shelley as Toad, with Patrick Wymark as the narrator. Another significant recording from this era is the premiere recording of Benjamin Britten's one-act opera/miracle play for children, Noye's Fludde (1961)."]}, {"page": "Northcott Theatre", "response": ["Ultimately, the university offered a site: Mr Northcott established a trust with a benefaction of £100,000 (later supplemented by donations of £50,000 from the Calouste Gulbenkian Foundation and from other bodies), to establish the \"Northcott Devon Theatre and Arts Centre\", which would serve the needs of the community in the region. The Northcott Theatre opened with a production of The Merchant of Venice, starring Tony Church, its first Artistic Director, on 2 November 1967. Barbara Hepworth unveiled one of her sculptures in the foyer on opening night. The architects were Sir William Holford and Partners and the theatre consultant Michael Warre.", "*1967–1971: Tony Church (Artistic Director), Robin Phillips (Associate Director), Bernard Goss (Writer in Residence)List formerly published on the Northcott Theatre website"]}, {"page": "The Plague Dogs (film)", "response": ["* Tony Church as Civil Servant #3"]}, {"page": "ADC Theatre", "response": ["Many famous actors and comedians acted in the theatre at the start of their careers, including Sir Ian McKellen, Tony Church, Emma Thompson, Marius Goring, Sir Derek Jacobi, Dan Stevens, Rebecca Hall, Stephen Fry, Hugh Laurie, Hattie Morahan, Tom Hollander, Tilda Swinton, Jan Ravens, Julie Covington, Tom Hiddleston, Eddie Redmayne, Richard Ayoade, Ellie Nunn, Liam Williams, David Mitchell, Robert Webb, Phil Wang, Simon Bird and Joe Thomas. Among famous directors to have gained early experience there are Sir Peter Hall, Sir Trevor Nunn and Sam Mendes. Viral comedian Ken Cheng performed multiple times at the ADC Theatre in his early career."]}, {"page": "Krull (film)", "response": ["The film stars an ensemble cast: Kenneth Marshall as Prince Colwyn, Lysette Anthony as Princess Lyssa, Trevor Martin as the voice of the Beast, Freddie Jones as Ynyr, Bernard Bresslaw as Rell the Cyclops, David Battley as Ergo the Magnificent, Tony Church and Bernard Archard as kings and the fathers of Colwyn and Lyssa, Alun Armstrong as the leader of a group of bandits that include early screen roles for actors Liam Neeson and Robbie Coltrane, John Welsh as The Emerald Seer, Graham McGrath as Titch, and Francesca Annis as The Widow of the Web.", "* Tony Church as King Turold and Bernard Archard as King Eirig, fathers of Colwyn and Lyssa respectively."]}, {"page": "1930 in the United Kingdom", "response": ["* 11 May – Tony Church, actor (died 2008)"]}, {"page": "2008 in British television", "response": ["|Tony Church"]}, {"page": "2008 in the United Kingdom", "response": ["* 25 March – Tony Church, actor (born 1930)"]}, {"page": "Deaths in March 2008", "response": ["*Tony Church, 77, British actor."]}, {"page": "Laurence Olivier Award for Best Actor in a Supporting Role", "response": ["| Tony Church"]}, {"page": "List of British actors", "response": ["* Tony Church (1930–2008)"]}, {"page": "Tony Church (actor)", "response": ["#REDIRECT Tony Church"]}, {"page": "List of actors in Royal Shakespeare Company productions", "response": ["*Tony Church"]}, {"page": "Tess (1979 film)", "response": ["* Tony Church as Parson Tringham"]}, {"page": "On Giant's Shoulders", "response": ["* Hospital Administrator - Tony Church"]}, {"page": "The Gentle Killers", "response": ["The Gentle Killers is a 1957 television serial. The six-part half-hour series was produced by ATV and aired on ITV. Cast included Tony Church and Hazel Court. It was written by Lewis Greifer and Leigh Vance. There is very scarce information on this series online, even though (unlike many British series of the era) the episodes still exist in the archives."]}, {"page": "1981 Laurence Olivier Awards", "response": ["** Tony Church as Polonius in Hamlet – RSC at the Aldwych "]}, {"page": "Duane Boutte", "response": ["Duane Boutté's early career was managed by Summer of '42 actress Jennifer O'Neill.  In these years ('86-'88), Boutté filmed episodes of What's Happening Now, A Year in the Life and a made-for-TV movie directed by Anson Williams, and starring Dermot Mulroney.  Boutte completed his B.A. in theatre at UCLA, and earned an M.F.A. in acting under Tony Church at the National Theatre Conservatory in Denver before moving to New York in 1991. That year, Boutté toured the U.S. with Jeffrey Wright (actor), Rainn Wilson and other young actors in The Acting Company's A Midsummer Night's Dream. In 1994, he played \"Enoch Snow, Jr.\" in Lincoln Center's TONY Award-winning revival of Carousel, and was one of Michael Hayden's \"Billy Bigelow\" understudies.  Boutté returned to Broadway in 1999 in Parade. He has performed numerous roles in classical and contemporary plays Off-Broadway and at leading regional theatres throughout the country.  In 2001, Boutté played \"Orestes\" in the Oresteia trilogy directed by Tony Taccone and Stephen Wadsworth, inaugurating Berkeley Repertory Theatre's new RODA Theatre.  Among his favorite roles performed, Boutté names \"Mercutio\" at Oregon Shakespeare Festival, and opportunities to premiere works by playwrights like Terrence McNally, Eric Overmyer, Charles Randolph-Wright, and Robert O'Hara.  Of note among his premieres are Kirsten Childs' Off-Broadway musical The Bubbly Black Girl Sheds Her Chameleon Skin (Playwrights Horizons), and Brian Freeman's play Civil Sex in which Boutté played civil rights activist Bayard Rustin (Berkeley Repertory Theatre).  In New York, Boutté has been listed among Vineyard Theatre's esteemed \"Community of Artists.\""]}, {"page": "Bonfils Memorial Theatre", "response": ["The theatre presented main stage, cabaret, and children's theatre. It staged more than 400 productions from 1953 to 1986. Performers at the Bonfils Memorial Theatre included John Ashton, Tony Church, and Cleo Parker Robinson. Celebrities who appeared in theatrical productions included Helen Bonfils (herself an actress and theatrical producer), Mary Jo Catlett, Julia Child (she gave a cooking demonstration), Kevin Kline, Patti LuPone, Ted Shackelford, David Ogden Stiers, Marilyn Van Derbur (Miss Colorado 1957 and Miss America 1958), Joan Van Ark, Emlyn Williams, and Paul Winfield. Bonfils lent her extensive collection of \"fur coats, jewels, silver, furniture, and rugs\" as props for many productions."]}, {"page": "Charlesworth (TV series)", "response": ["Charlesworth is a British crime television series which first aired on BBC in 1959.Radio Times, Volume 143 p.19 A police procedural, it starred Wensley Pithey as  Detective Superintendent Charlesworth, with Tony Church as Detective Sergeant Spence. It followed on from the previous year's Charlesworth at Large ."]}, {"page": "Charlesworth at Large", "response": ["* Tony Church as  Sgt. Spence "]}]}}