{"wiki_id": "http://www.wikidata.org/entity/Q328713", "itemLabel": "William Hechler", "itemDescription": "British priest", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Hechler", "wikipedia_page": {"main": "William Henry Hechler (1 October 1845 – 30 January 1931) was an English Restorationist Anglican clergyman; eschatological writer; crusader against antisemitism; promoter of Zionism; and aide, counselor, friend and legitimiser of Theodor Herzl, the founder of modern Zionism.", "link_mentions": [{"page": "Timeline of Zionism", "response": [";1896–1904: Herzl, with the help of William Hechler, unsuccessfully approaches world leaders for assistance in the creation of a Jewish National Home but creates political legitimacy for the movement."]}, {"page": "Christian Zionism", "response": ["An important, though often neglected, figure in British support of the restoration of the Jews was William Hechler (1845–1931), an English clergyman of German descent who was Chaplain of the British Embassy in Vienna and became a close friend of Theodor Herzl. Hechler was instrumental in aiding Herzl through his diplomatic activities, and may, in that sense, be called the founder of modern Christian Zionism. When it came to mark the twenty-fifth anniversary of the death of Theodor Herzl, it was noted by the editors of the English-language memorial volume that William Hechler would prove \"not only the first, but the most constant and the most indefatigable of Herzl’s followers\".", "* William Hechler"]}, {"page": "Frederick I, Grand Duke of Baden", "response": ["Frederick I had a pivotal role in the history of the Zionist movement. In 1896 he met Theodor Herzl (the founder of political Zionism) via their mutual acquaintance the reverend William Hechler, and helped Herzl in obtaining an audience with his nephew Wilhelm II, German Emperor. After some persuasion on the part of the grand duke, the emperor accepted the appeal for an audience. It took place in Palestine on 2 November 1898, during the emperor's visit to inaugurate the Church of the Redeemer, Jerusalem."]}, {"page": "Theodor Herzl", "response": ["On 10 March 1896, Herzl was visited by Reverend William Hechler, the Anglican minister to the British Embassy in Vienna. Hechler had read Herzl's Der Judenstaat, and the meeting became central to the eventual legitimization of Herzl and Zionism. Herzl later wrote in his diary, \"Next we came to the heart of the business. I said to him: (Theodor Herzl to Rev. William Hechler) I must put myself into direct and publicly known relations with a responsible or non responsible ruler – that is, with a minister of state or a prince. Then the Jews will believe in me and follow me. The most suitable personage would be the German Kaiser.\"The Diaries of Theodor Herzl, edited by Marvin Lowenthal, Gloucester, Massachusetts, Peter Smith Pub., 1978 p. 105 Hechler arranged an extended audience with Frederick I, Grand Duke of Baden, in April 1896. The Grand Duke was the uncle of the German Emperor Wilhelm II. Through the efforts of Hechler and the Grand Duke, Herzl publicly met Wilhelm II in 1898. The meeting significantly advanced Herzl's and Zionism's legitimacy in Jewish and world opinion.London Daily Mail Friday 18 November 1898 \"An Eastern Surprise: Important Result of the Kaiser's Tour: Sultan and Emperor Agreed in Palestine: Benevolent Sanction Given to the Zionist Movement One of the most important results, if not the most important, of the Kaiser's visit to Palestine is the immense impetus it has given to Zionism, the movement for the return of the Jews to Palestine. The gain to this cause is the greater since it is immediate, but perhaps more important still is the wide political influence which this Imperial action is like to have. It has not been generally reported that when the Kaiser visited Constantinople, Dr. Herzl, the head of the Zionist movement, was there; again when the Kaiser entered Jerusalem, he found Dr.Herzl there. These were no mere coincidences, but the visible signs of accomplished facts.\" Herzl had achieved political legitimacy.", "Herzl visited Jerusalem for the first time in October 1898. He deliberately coordinated his visit with that of Wilhelm II to secure what he thought had been prearranged with the aid of Rev. William Hechler, public world power recognition of himself and Zionism.Herzl had written in his diary of the necessity for world power recognition. 11 March 1896\""]}, {"page": "Christian Zionism in the United Kingdom", "response": ["William Hechler, an Anglican minister has been described as, 'not only the first, but the most constant and the most indefatigable of Herzl’s followers'.25th Anniversary Volume for Theodor Herzl cited in Paul Merkley, The Politics of Christian Zionism 1891-1948,  Due to his German court connections, Hechler initially introduced Herzl to the Grand Duke of Baden, and through him hoped to present early Zionist proposals to Kaiser Wilhelm II, prompting one historian to suggest that with less German suspicion, the Zionist cause might instead have been brought to birth through its own initiative."]}, {"page": "Christ Church, Vienna", "response": ["===William Hechler===", "The Reverend William Hechler was Chaplain from 1885 to 1910. The son of a German-born missionary to the Jews in Germany and France, Hechler was raised with an intimate knowledge of Jewish tradition and history and developed a passionate belief in prophecies to be found in the Books of the Old Testament. He had previously been tutor to the son of the Grand Duke of Baden, and through this contact this shambling white-bearded eccentric, often wearing a huge cape made with pockets designed to hold Bibles and cushions, became a popular figure in the Courts of Germany. When serving in Vienna, he spent much of his time travelling across the continent lecturing European royalty on the latest archaeological finds from the Holy Land. His study in Vienna became a museum overflowing with archaeological treasures from the Holy Land, models of the Temple and over a thousand rare Bibles.   His lifelong interest in the Jewish people complemented his fascination with Bible prophecy and Hechler became convinced that the years 1897-98 would see the return of the Jews to their ancient homeland."]}, {"page": "Reverend William H. Hechler", "response": ["#REDIRECT William Hechler"]}, {"page": "William H. Hechler", "response": ["#REDIRECT William Hechler"]}, {"page": "Hechler", "response": ["* William Hechler (1845–1931), English Anglican priest"]}, {"page": "Jewish American Society for Historic Preservation", "response": ["* Rev. William Hechler - First Christian Zionist, London, England"]}, {"page": "Payitaht: Abdülhamid", "response": ["Meanwhile, Zalman David Levontin comes to Payitaht disguised as Mr. Gustav, making secret moves against Sultan Abdülhamid. Zalman is eventually exposed and punished, so the Brits send William Hechler as an ambassador. A second railway project in Baghdad was established in addition to the Hejaz Railway, posing a threat to the British in terms of strategic location. Hechler openly becomes enemies with Sultan Abdülhamid, making many moves before being defeated and imprisoned. However, one of Hechler's men arranges an assassination for the Sultan and shoots at him with a sniper which injures Ahmed Pasha (not shown) and the season ends there.", "|British Ambassador to the Ottoman Empire. Works with enemies against the Sultan. Replaced by William Hechler", "|William Hechler "]}, {"page": "Hechler, William", "response": ["#redirectWilliam Hechler"]}, {"page": "Wilhelm II's voyage to the Levant in 1898", "response": ["The visit resulted in the highest-profile political event in the life of Theodor Herzl, considered the founder of Zionism. Through the efforts of William Hechler, via the Frederick I, Grand Duke of Baden, Theodor Herzl publicly met Wilhelm II three times during the voyage, once in Istanbul (on 15 October 1898) and twice in Palestine (29 October and 2 November). The meetings significantly advanced Herzl's and Zionism's legitimacy in Jewish and world opinion.London Daily Mail Friday 18 November 1898 \"An Eastern Surprise: Important Result of the Kaiser's Tour: Sultan and Emperor Agreed in Palestine: Benevolent Sanction Given to the Zionist Movement One of the most important results, if not the most important, of the Kaiser's visit to Palestine is the immense impetus it has given to Zionism, the movement for the return of the Jews to Palestine. The gain to this cause is the greater since it is immediate, but perhaps more important still is the wide political influence which this Imperial action is like to have. It has not been generally reported that when the Kaiser visited Constantinople, Dr. Herzl, the head of the Zionist movement, was there; again when the Kaiser entered Jerusalem, he found Dr.Herzl there. These were no mere coincidences, but the visible signs of accomplished facts.\" Herzl had achieved political legitimacy."]}]}}