{"wiki_id": "http://www.wikidata.org/entity/Q328935", "itemLabel": "Simon Reeve", "itemDescription": "British television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Reeve_(British_TV_presenter)", "wikipedia_page": {"main": "Simon Alan Reeve (born 21 July 1972) is a British author, journalist, adventurer, documentary filmmaker and television presenter. Reeve divides his home time between London and Devon. He makes global travel and environmental documentaries, and has written books on international terrorism, modern history, and his adventures.  Amongst his many television programmes and series for the BBC, Reeve has presented Holidays in the Danger Zone: Places That Don't Exist, Tropic of Cancer, Equator and Tropic of Capricorn.\nReeve is the New York Times best-selling author of The New Jackals (1998), One Day in September (2000) and Tropic of Capricorn (2007). He has received a One World Broadcasting Trust Award and the 2012 Ness Award from the Royal Geographical Society (RGS).", "link_mentions": [{"page": "Munich massacre", "response": ["According to author Simon Reeve, Afif (the son of a Jewish mother and Christian father), Nazzal, and one of their confederates, had all worked in various capacities in the Olympic Village, and had spent a couple of weeks scouting for their potential target. A member of the Uruguayan Olympic delegation, which shared housing with the Israelis, claimed that he found Nazzal inside 31 Connollystraße less than 24 hours before the attack, but since he was recognized as a worker in the Village, nothing was thought of it at the time. The other members of the group entered Munich via train and plane in the days before the attack. All the members of the Uruguay and Hong Kong Olympic teams, which also shared the building with the Israelis, were released unharmed during the attack.", "Author Simon Reeve, among others, writes that the shootout with the well-trained Black September members showed an egregious lack of preparation on the part of the German authorities. They were not prepared to deal with this sort of situation. This costly lesson led directly to the founding, less than two months later, of police counter-terrorism branch GSG 9. German authorities made a number of mistakes. First, because of restrictions in the post-war West German constitution, the army could not participate in the attempted rescue, as the German armed forces are not allowed to operate inside Germany during peacetime. The responsibility was entirely in the hands of the Munich police and the Bavarian authorities.Interview with Ulrich Wegener in One Day in September.", "Simon Reeve writes that the Israeli operations continued for more than twenty years. He details the assassination in Paris in 1992 of Atef Bseiso, the PLO's head of intelligence, and says that an Israeli general confirmed there was a link back to Munich. Reeve also writes that while Israeli officials have stated Operation Wrath of God was intended to exact vengeance for the families of the athletes killed in Munich, \"few relatives wanted such a violent reckoning with the Palestinians.\" Reeve states the families were instead desperate to know the truth of the events surrounding the Munich massacre. Reeve outlines what he sees as a lengthy cover-up by German authorities to hide the truth. After a lengthy court fight, in 2004 the families of the Munich victims reached a settlement of €3 million with the German government."]}, {"page": "Ramzi Yousef", "response": ["Yousef, wanting to get the bombs on a plane bound for the U.S., called a friend with diplomatic immunity in Qatar who was willing to take the suitcases to London and check them on a flight to the U.S. The plan was that they would explode mid-flight and destroy the plane. Yousef planned to use the friend's diplomatic immunity to ensure the suitcases would be loaded on the plane. According to Simon Reeve's book The New Jackals, the name of this friend has not been revealed, but his father is said to be a very senior politician and leading member of the establishment in Qatar (at the time, Yousef's maternal uncle, Khalid Sheikh Mohammed, was living in Qatar as the guest of a Qatari cabinet official). However, there was a problem and the suitcases were not checked in. Yousef and Parker returned to Pakistan on 2 February 1995."]}, {"page": "Operation Infinite Reach", "response": ["ISI director Hamid Gul reportedly notified the Taliban of the missile strikes in advance; bin Laden, who survived the strikes, later claimed that he had been informed of them by Pakistanis.Isma'il, Jamal (September 20, 2001). \"Al-Jazirah TV Broadcasts Usama Bin Ladin's 1998 Interview\". Al Jazeera. In FBIS, Compilation of Usama Bin Ladin Statements 1994 – January 2004, p. 162. A bin Laden spokesman claimed that bin Laden and the Taliban had prepared for the strike after hearing of the evacuation of Americans from Pakistan.'Atwan, 'Abd-al-Bari (August 22, 1998). \"Bin Ladin Warns Clinton 'Battle Has Not Yet Started'\". Al-Quds Al-Arabi. In FBIS, Compilation of Usama Bin Ladin Statements 1994 – January 2004, p. 76. Other U.S. officials reject the tip-off theory, citing a lack of evidence and ISI casualties in the strike; Tenet later wrote in his memoirs that the CIA could not ascertain whether Bin Laden had been warned in advance. Steve Coll reports that the CIA heard after the attack that bin Laden had been at Zhawar Kili Al-Badr but had left some hours before the missiles hit. Bill Gertz writes that the earlier arrest of Mohammed Odeh on August 7, while he was traveling to meet with bin Laden, alerted bin Laden, who canceled the meeting; this meant the camps targeted by the cruise missiles were mainly empty the day of the U.S. strike. Lawrence Wright says the CIA intercepted a phone call indicating that bin Laden would be in Khost, but the al-Qaeda chief instead decided to go to Kabul. Other media reports indicate that the strike was delayed to maximize secrecy, thus missing bin Laden. Scheuer charges that while the U.S. had planned to target the complex's mosque during evening prayers to kill bin Laden and his associates, the White House allegedly delayed the strikes \"to avoid offending the Muslim world\". Simon Reeve states that Pakistani intelligence had informed bin Laden that the U.S. was using his phone to track him, so he turned it off and cancelled the meeting at Khost."]}, {"page": "Camino de Santiago", "response": ["*In 2013, Simon Reeve presented the \"Pilgrimage\" series on BBC2, in which he followed various pilgrimage routes across Europe, including the Camino de Santiago in episode 2."]}, {"page": "The New Jackals", "response": ["The New Jackals: Ramzi Yousef, Osama bin Laden and the future of terrorism is a 1998 book by Simon Reeve."]}, {"page": "Holidays in the Danger Zone", "response": ["The series of travelogues see the presenters Ben Anderson and Simon Reeve visit countries which are far off the beaten track.", "* Meet the Stans was presented by Simon Reeve for the first time, and saw him travel through Central Asia. Along the way, he visited Kazakhstan, Kyrgyzstan, Tajikistan and Uzbekistan."]}, {"page": "Esphigmenou", "response": ["The monks continued to remain inside the premises of Esphigmenou Monastery, under blockade, as shown in a 2016 travel documentary by British presenter Simon Reeve. The supply ship that supports Mt. Athos no longer stops at Esphigmenou, their bank accounts have been seized and nearly all of their property outside Mt. Athos has been taken over by the 'new' monastic community."]}, {"page": "Marine Conservation Society", "response": ["*Simon Reeve"]}, {"page": "Luttif Afif", "response": ["According to Simon Reeve, Afif enjoyed the time he spent in Europe, but joined Fatah in 1966, possibly while residing in Germany. He later returned to the Middle East to fight several battles against Israeli soldiers.", "According to several sources, including Serge Groussard and Simon Reeve, Afif claimed that his own personal reason for taking the Israelis hostage was to get his two brothers out of Israeli prisons. He was described by Manfred Schreiber, chief of the Munich police and one of the German negotiators, as \"very cool and determined, clearly fanatical in his convictions\"; someone who expressed his demands in a forceful manner and at times \"sounded like [one of] those people who aren't completely anchored in reality.\"", "After tense negotiations, the hostage crisis ended after 21 hours, with a bungled ambush of the hostage takers at Fürstenfeldbruck airbase outside of Munich. Afif and four of his compatriots were killed by German snipers, but not before machine-gunning all nine remaining hostages and blowing up a helicopter containing four of them with a hand grenade. Afif is reported in most accounts of the event (and depicted in the films Munich and 21 Hours at Munich) as the guerrilla who threw the hand grenade into the eastern helicopter. Autopsy reports show that the hostages in this helicopter were shot as well; it stands to reason that Afif performed both actions. Another fedayeen, identified by Simon Reeve as Adnan Al-Gashey, machine-gunned the remaining hostages in the western helicopter seconds later."]}, {"page": "Twyford Church of England High School", "response": ["*Simon Reeve (1974-) British documentarian and Journalist"]}, {"page": "Simon Reeve", "response": ["Simon Reeve may refer to:", "* Simon Reeve (Australian TV presenter) (born 1961), Australian television presenter", "* Simon Reeve (British TV presenter) (born 1972), British author and television presenter"]}, {"page": "Simon Reeve (UK)", "response": ["#REDIRECT Simon Reeve (British TV presenter)"]}, {"page": "BBC Natural History Unit filmography", "response": ["|Extraordinary Rituals || 2018 || Three-part (UK version)/Four-part (International version) episodes which explores the spectacular and emotional world of rituals. Also known as Rituals for international release.|| Simon Reeve (narrator, UK version), Matthew Gravelle (narrator, International version)|| No || Yes "]}, {"page": "Tropic of Capricorn (TV series)", "response": ["Tropic of Capricorn is a BBC television documentary series. It was aired on BBC Two in 2008 and showed presenter Simon Reeve travelling along the Tropic of Capricorn."]}, {"page": "Highbury College", "response": ["Highbury NCTJ Diploma in Journalism was recognised as the best-performing newspaper journalism fast-track course in the country for 2007/8. Former Highbury journalism students include political correspondent John Pienaar and Emmy Award, presenter Simon Reeves and former ITV news reader Mark Austin."]}, {"page": "Association of Independent Tour Operators", "response": ["On Tuesday 23 February 2016, AITO celebrated its 40th anniversary at a special dinner at the Royal Horseguards Hotel in London. The special guest for the evening, Simon Reeve, the British author, television presenter and explorer gave the keynote speech and presented the annual awards.AITO Press Release"]}, {"page": "Stuff Your Rucksack", "response": ["The website was relaunched on May 19, 2010 with a party at the Royal Geographical Society in London. It has received support from a number of UK celebrities including Ben Fogle and Simon Reeve.", "* Simon Reeve"]}, {"page": "Pilgrimage with Simon Reeve", "response": ["#REDIRECT Simon Reeve (British TV presenter)#Pilgrimage with Simon Reeve .282013.29"]}, {"page": "Australia with Simon Reeve", "response": ["#REDIRECT Simon Reeve (British TV presenter)#Australia with Simon Reeve (2013) "]}, {"page": "Fernando Montaño", "response": ["In 2020 Montano was made an ambassador of and presented two podcasts for the Marine Conservation Society called Oceancast. Guests included Deborah Meaden, Colin Jackson, Alexandra Dariescu, Simon Reeve, Susie Rodgers, and Cyrus Todiwala."]}, {"page": "Ness Award", "response": ["|2012||Simon Reeve||for popularising geography through television travel documentaries and writing"]}, {"page": "Simon Reeve (UK television presenter)", "response": ["#REDIRECT Simon Reeve (British TV presenter)"]}, {"page": "Giles Cooper (producer)", "response": ["Cooper has promoted music tours for bands such as Placebo and the Happy Mondays and theatre and spoken-word tours for BBC TV presenters such as Simon Reeve and Dan Snow."]}, {"page": "Anneliese Graes", "response": ["Graes had volunteered to work as one of 2,000 Olympic security guards during the 1972 Munich Olympic Games. Upon hearing of the hostage taking Graes rushed to 31 Connollystraße to volunteer as intermediary. According to Simon Reeve, author of the book One Day in September, Graes had a mature, easy manner which her superiors had hoped would put the terrorists at ease.", "At 8:10am Graes made her way to 31 Connollystraße to replace Frau Lauterbach, a young policewoman who had already gone to 31 Connollystraße to establish contact with the terrorists. Although Simon Reeve intimates that Graes volunteered to be an intermediary and was chosen by Manfred Schreiber for the task, it appears Graes went to the scene of her own volition and began to act as intermediary without any prior instruction from her superiors. She would act as the intermediary between the Black September leader Luttif Afif and the German delegation until the terrorists and Israeli hostages left 31 Connollystraße via the underground car park by bus, and then to waiting helicopters which were supposed to transport them to Fürstenfeldbruck Air Base."]}, {"page": "Anton Fliegerbauer", "response": ["On 5 September Fliegerbauer's unit was ordered to Fürstenfeldbruck Air Base, where the West German Police had planned to rescue the nine Israeli hostages taken by eight Black September terrorists. Fliegerbauer took position inside the airport building at the base of the control tower directly opposite where the two Bell UH-1 Iroquois carrying the Israeli hostages and terrorists landed. Upon discovering that the Lufthansa plane had no crew and suspecting a trap, terrorist leader 'Issa' (Luttif Afif) and his deputy 'Tony' (Yusuf Nazzal) ran back towards the two helicopters, shouting as they did so to the terrorists at the helicopters. Three West German Police marksmen stationed on the roof of the control opened fire on the six terrorists at outside the two helicopters and at least one on Afif and Nazzal still moving back towards the helicopters. As they did so, Fliegerbauer, still positioned inside the airport building at the base of the control tower, also opened fire on the terrorist leader and his deputy with a submachine gun. According to Simon Reeve, author of One Day in September, Fliegerbauer had fired less than half the bullets in his magazine when a random shot from the one of the Black September terrorists came through the window and struck him in the side of the head."]}, {"page": "Coffee Trail with Simon Reeve", "response": ["#REDIRECT Simon Reeve (British TV presenter)#Tea_Trail/Coffee_Trail_with_Simon_Reeve_(2014)"]}, {"page": "Giles Cooper Entertainment", "response": ["GCE Live has promoted tours and  produced shows for hundreds of artists, including bands such as Placebo and the Happy Mondays and theatre and spoken-word tours for BBC TV presenters such as Simon Reeve and Dan Snow.", "* Simon Reeve"]}, {"page": "Incredible Journeys with Simon Reeve", "response": ["#REDIRECT Simon Reeve (British TV presenter)"]}]}}