{"wiki_id": "http://www.wikidata.org/entity/Q3289196", "itemLabel": "Lady Victoria Hervey", "itemDescription": "British socialite", "wikipedia_url": "https://en.wikipedia.org/wiki/Lady_Victoria_Hervey", "wikipedia_page": {"main": "Lady Victoria Frederica Isabella Hervey (born 6 October 1976) is an English model, socialite, aristocrat, and former \"It girl\". She is the daughter of the 6th Marquess of Bristol, half-sister of the 7th Marquess, and sister of the 8th Marquess and Lady Isabella Hervey.", "link_mentions": [{"page": "Prince Andrew, Duke of York", "response": ["In an ITV documentary former royal protection officer Paul Page recounted Maxwell's frequent visits to Buckingham Palace and suggested the two might have had an intimate relationship, while Lady Victoria Hervey added that Andrew was present at social occasions held by Maxwell. The Duke of York's name and contact numbers for Buckingham Palace, Sunninghill Park, Wood Farm and Balmoral also appeared in Maxwell and Epstein's 'Little Black Book', a list of contacts of the duo's powerful and famous friends."]}, {"page": "Marquess of Bristol", "response": ["The 6th Marquess of Bristol married three times. His son from his first marriage succeeded as 7th Marquess. A flamboyant character, he died childless at the age of 44 in January 1999. The 6th Marquess's only child from his second marriage, Lord Nicholas Hervey, died at the age of 36 in 1998. From his third marriage, the 6th Marquess had three children: Frederick Hervey, 8th Marquess of Bristol, Lady Victoria Hervey and Lady Isabella Hervey."]}, {"page": "Frederick Hervey, 8th Marquess of Bristol", "response": ["The 8th Marquess is the only son of the late 6th Marquess by his third wife, the former Yvonne Sutton. Bristol's godparents include King Fuad II and his former wife, Queen Fadila of Egypt, Prince Tomislav of Yugoslavia, Prince Nikita Romanoff of Russia, and the Countess of Dundonald. He is the brother of Lady Victoria Hervey (born 1976) and Lady Isabella Hervey (born 1982)."]}, {"page": "Jamie Theakston", "response": ["Theakston lived for about ten years in Wings Place, a Tudor mansion in Ditchling, East Sussex. In 2002, Theakston was the subject of a tabloid scandal when he was documented visiting prostitutes at a Mayfair brothel. Theakston married Sophie Siegle in Ditchling on 15 September 2007, and they live in west London. They have two children. He was previously romantically linked to socialite Lady Victoria Hervey, actor Joely Richardson, and models Erin O'Connor and Sophie Dahl. "]}, {"page": "The Games (British TV series)", "response": ["*Lady Isabella Hervey (sister of Lady Victoria Hervey) – gold medalist"]}, {"page": "Shane Lynch", "response": ["On 8 March 1998, Lynch married Easther Bennett, lead singer of Eternal, but they divorced in July 2000.  In 2002, Lynch was in a relationship with socialite, aristocrat and \"It girl\" Lady Victoria Hervey.  Lynch and singer Sheena White were married in Ireland on 22 August 2007, and on 25 October 2008, White gave birth to their daughter Billie Rae. Shane and Sheena celebrated the birth of their second child in September 2012, another daughter whom they named Marley Mae."]}, {"page": "Lady Isabella Hervey", "response": ["Lady Isabella Frederica Louisa de Pauw (née Hervey, () born 9 March 1982) is a British model, actress, and fitness trainer. She is the daughter of Victor Hervey, 6th Marquess of Bristol, the sister of Lady Victoria Hervey and the incumbent Frederick Hervey, 8th Marquess of Bristol, and half-sister of John Hervey, 7th Marquess of Bristol.", "Lady Isabella has two elder full siblings, the incumbent Frederick Hervey, 8th Marquess of Bristol and fellow media personality Lady Victoria Hervey. In addition to John, who became the 7th Marquess, she had a half-brother Nicholas; both are now deceased."]}, {"page": "The Farm (British TV series)", "response": ["| Lady Victoria Hervey"]}, {"page": "Benenden School", "response": ["*Lady Victoria Hervey, socialite"]}, {"page": "John Hervey, 7th Marquess of Bristol", "response": ["His father's final marriage was to his private secretary, Yvonne Marie Sutton, in 1974, giving him three more half-siblings: the incumbent Frederick Hervey, 8th Marquess of Bristol, media personality Lady Victoria Hervey, and Lady Isabella Hervey. John Hervey did not get on well with Yvonne, whom he referred to as \"Miss Crimplene\", and he reportedly hurled a glass at the wall when he received a telegram from his father announcing the marriage. Around this time, his father attempted to prove that John was an illegitimate child, so could not inherit his titles and estates, but was unsuccessful. He also stripped Ickworth House of its contents while John was away, and he came home one weekend to find everything suddenly missing. Along with his half-brother Nicholas, Earl Jermyn attempted to sue his father's estate after Yvonne and her children were named the principal beneficiaries in the 6th Marquess's will, but failed."]}, {"page": "Victoria Harvey", "response": ["#REDIRECT Lady Victoria Hervey"]}, {"page": "Lady Victoria Harvey", "response": ["#REDIRECT Lady Victoria Hervey"]}, {"page": "Victor Hervey, 6th Marquess of Bristol", "response": ["Victor Hervey was the only son of Herbert Hervey, 5th Marquess of Bristol. He acquired a notorious reputation as a playboy and petty criminal in the 1930s, which culminated in him being imprisoned for jewellery theft in 1939. He inherited the Marquessate on his father's death in 1960, and acquired a large fortune through this and his business dealings. He was married three times and is the father of John Hervey, 7th Marquess of Bristol, Frederick Hervey, 8th Marquess of Bristol, Lord Nicholas Hervey, Lady Victoria Hervey, and Lady Isabella Hervey. He spent his final years in Monaco to avoid income tax with his third wife and three youngest children.", "His third wife was Yvonne Marie Sutton, whom he married on 12 July 1974 at Caxton Hall. They had a son, Frederick Hervey, 8th Marquess of Bristol (born 1979), and two daughters: Lady Victoria Hervey (born 1976) and Lady Isabella Hervey (born 1982), who married Christophe de Pauw. Victor’s eldest son, John, by then Earl Jermyn, did not like Yvonne, and was upset about the third marriage, and with his brother Lord Nicholas unsuccessfully sued his father, after his will named Yvonne and her children as his main beneficiaries."]}, {"page": "Lord Nicholas Hervey", "response": ["Nicholas's father also re-married, to his private secretary, Yvonne Sutton by whom he had three further children, Frederick Hervey, 8th Marquess of Bristol (born 1979), who inherited in 1999 and at whose Roman Catholic christening Nicholas had been a godfather, and two daughters Lady Victoria Hervey and Lady Isabella Hervey."]}, {"page": "Love Island (2005 TV series)", "response": ["|Lady Victoria Hervey", "* In week two, in a bid to boost the ratings, the producers decided series one contestant Paul Danan would be put on Love Island as a regular contestant hoping he would provide the rating winning actions of the previous year. Danan was known by most on the island especially Lee Otway and Lady Victoria Hervey whose sister Isabella was involved with him in the first series and for a short period afterwards.", "* After Sophie Anderton and Chris Brosnan were seen getting closer, evicted Lady Victoria Hervey returned to the Island for a day and hid in the secret suite where she confronted her friend Sophie and poured a bottle of wine over her head for moving in on her man.", "Lady Victoria Hervey was voted off the show on Friday 21 July although her chosen man Chris Brosnan had been the favourite to leave. Hervey told hosts Patrick Kielty and Fearne Cotton that she hoped the relationship would continue in the real world but then had second thoughts when she was shown footage of Brosnan saying that he also liked Colleen."]}, {"page": "Victoria Hervey", "response": ["#REDIRECT Lady Victoria Hervey"]}, {"page": "Hervey", "response": ["*Lady Victoria Hervey (born 1976), English model, socialite and TV personality"]}, {"page": "Patrick Kielty Almost Live", "response": ["*Lady Victoria Hervey"]}, {"page": "Pam Hogg", "response": ["In April 2013 Hogg was honoured during \"Britweek\", for her achievements. In Los Angeles. Pam was given a Fashion Show, the models included Lady Victoria Hervey. The show called \"Opfashart\" was part of an art installation, consisting of British Artists from Los Angeles and London. This included artists Duggie Fields and The Head of BAFTA, in Los Angeles, Nigel Daly, hosted by the artist and writer Amanda Eliasch, with Lisa Zane singing opera with Charles Eliasch. In October the same year she won The Creative Excellence prize from The Scottish Council."]}, {"page": "Snog Marry Avoid?", "response": ["*Episode 1 – The Royal Special – Lady Victoria Hervey"]}, {"page": "Lindka Cierach", "response": ["Lindka Rosalind Wanda Cierach is a British couturier and fashion designer. Notable clients include members of British and European Royal Families, Helen Mirren,Stars attend Last Station premiere | Galleries | Pictures Lady Victoria Hervey and Cherie BlairCherie's designer gives Caplin the cold shoulder - Telegraph among others."]}, {"page": "Morgan Spurlock's New Britannia", "response": ["| Scott Capurro, Lady Victoria Hervey, Russell Kane"]}, {"page": "Chad Marshall (producer)", "response": ["Marshall is also currently attached to Where's My Wedding as the creator, producer and director, a television show being co-produced with Trium Entertainment, and Lady V as the creator, producer and director, a television show starring Lady Victoria Hervey."]}, {"page": "The Jump (series 2)", "response": ["| rowspan=\"2\" style=\"background:salmon;\"|Lady Victoria HerveyK2413.5m", "| Lady Victoria Hervey", "| Lady Victoria Hervey", "|Lady Victoria Hervey", "| Lady Victoria Hervey", "| Lady Victoria Hervey", "| Lady Victoria Hervey"]}, {"page": "Uttrang Kaur Khalsa", "response": ["Aitken remained in London and became part of a charitable 'it girl' set alongside Lady Victoria Hervey and Tara Palmer-Tomkinson."]}, {"page": "Absolutely Fabulous (series 4)", "response": ["* Lady Victoria Hervey as herself"]}, {"page": "Yvonne Hervey, Marchioness of Bristol", "response": ["Yvonne Marie Hervey, Dowager Marchioness of Bristol (née Sutton; born 1945),  is a British peeress, the widow of Victor Hervey, 6th Marquess of Bristol and the mother of the incumbent Frederick Hervey, 8th Marquess of Bristol as well as Lady Victoria Hervey and Lady Isabella Hervey."]}]}}