{"wiki_id": "http://www.wikidata.org/entity/Q328494", "itemLabel": "Logan Pearsall Smith", "itemDescription": "British American-born writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Logan_Pearsall_Smith", "wikipedia_page": {"main": "Logan Pearsall Smith (18 October 1865 – 2 March 1946) was an American-born British essayist and critic. Harvard and Oxford educated, he was known for his aphorisms and epigrams, and was an expert on 17th Century divines. His Words and Idioms made him an authority on correct English language usage. He wrote his autobiography, Unforgotten Years, in 1938.\n\n", "link_mentions": [{"page": "October 18", "response": ["*  1865   – Logan Pearsall Smith, American-English author and critic (d. 1946)"]}, {"page": "Millville, New Jersey", "response": ["* Logan Pearsall Smith (1865–1946), essayist and critic.Logan Pearsall Smith Manuscripts, 1881-1943, Kent State University. Accessed February 11, 2008."]}, {"page": "Desmond MacCarthy", "response": ["A member of the Bloomsbury Group, MacCarthy also had a wider circle of friends, including Logan Pearsall Smith."]}, {"page": "Bernard Berenson", "response": ["After graduating from Boston Latin School, he attended the Boston University College of Liberal Arts as a freshman during 1883–84, but, unable to obtain instruction in Sanskrit from that institution, transferred to Harvard University for his sophomore year.Boston University College of Liberal Arts Class of 1887 50th Anniversary Memory Book, published 1937 He graduated from Harvard and married Mary Smith, who became a notable art historian in her own right. Mary was the sister of Logan Pearsall Smith and of Alys Pearsall Smith, the first wife of Bertrand Russell. Mary had previously been married to barrister Frank Costelloe. Bernard Berenson was also involved in a long relationship with Belle da Costa Greene. Samuels (1987) mentions Mary's \"reluctant acceptance (at times)\" of this relationship."]}, {"page": "Cyril Connolly", "response": ["Connolly left Balliol in 1925 with a third class degree in history. He struggled to find employment, while his friends and family sought to pay off his extensive debts. In summer he went for his annual stay at Urquhart's chalet in the French Alps, and in the autumn went to Spain and Portugal. He obtained a post tutoring a boy in Jamaica and set sail for the Caribbean in November 1925. He returned to England in April 1926 on a banana boat in the company of Alwyn Williams, headmaster of Winchester College. He enrolled as a special constable in the General Strike,Ferrall, C., & McNeill, D., Writing the 1926 General Strike, p. 11. New York: Cambridge University Press, 2015. but it was over before he was actively involved. He responded to an advertisement to work as a secretary for Montague Summers but was warned off by his friends. Then in June 1926 he found a post as a secretary/companion to Logan Pearsall Smith, who was based in Chelsea and also had a house called \"Big Chilling\" in Hampshire overlooking the Solent. Pearsall Smith was to give Connolly an important introduction to literary life, and he influenced his ideas on the role of a writer with a distaste for journalism. Pearsall Smith gave Connolly £8 a week, whether he was around or not, and moreover gave him the run of \"Big Chilling\"."]}, {"page": "John Pope-Hennessy", "response": ["Pope-Hennessy was educated at Downside School, a Catholic boarding school for boys, in Stratton-on-the-Fosse. He then went on to Balliol College at the University of Oxford, where he specialized in modern history. At Oxford, he was introduced by Logan Pearsall Smith, a family friend, to Kenneth Clark, who later became a mentor."]}, {"page": "List of Balliol College, Oxford people", "response": ["*Logan Pearsall Smith (1891)"]}, {"page": "Alys Pearsall Smith", "response": ["Pearsall Smith was born in Philadelphia, Pennsylvania. She was the daughter of Robert Pearsall Smith and Hannah Whitall Smith, prominent figures in the Holiness movement in America and the Higher Life movement in Great Britain. She was the sister of essayist and critic Logan Pearsall Smith and the cousin of Martha Carey Thomas. Pearsall Smith graduated from Bryn Mawr College near Philadelphia."]}, {"page": "Robert Pearsall Smith", "response": ["In 1888, the Smith family moved to England when their daughter Mary married an Irish barrister, Frank Costelloe; she later married Bernard Berenson. Their daughter Alys Pearsall Smith met and married the philosopher Bertrand Russell. Their son, Logan Pearsall Smith, became an essayist and critic."]}, {"page": "Hannah Whitall Smith", "response": ["In 1888, the Smith family moved to England because their daughter Mary married an English barrister, Frank Costelloe.  They eventually divorced, and Mary then married the critic Bernard Berenson.  It was in England that younger daughter  Alys Pearsall Smith met and married the philosopher Bertrand Russell.  Logan Pearsall Smith  became an essayist and critic."]}, {"page": "Logan pearsall smith", "response": ["#REDIRECT Logan Pearsall Smith"]}, {"page": "The Dial", "response": ["* Vol. 71 (July–December 1921) Sherwood Anderson, Padraic Colum, Arthur Dove, Anatole France, D. H. Lawrence, Wyndham Lewis, Amy Lowell, Marianne Moore, J. Middleton Murry, Pablo Picasso, Ezra Pound, Logan Pearsall Smith, Arthur Schnitzler, Max Weber, William Butler Yeats", "* Vol. 77 (July–December 1924) Ernst Barlach, Clive Bell, Marc Chagall, Thomas Craven, Adolphe Dehn, André Derain, José Ortega y Gasset, Maxim Gorky, Duncan Grant, Marianne Moore, Edwin Muir, Jules Romains, Bertrand Russell, Carl Sandburg, Herbert J. Seligmann, Georges Seurat, Logan Pearsall Smith, Oswald Spengler, Leo Stein, Wallace Stevens, Scofield Thayer, Edmund Wilson, Virginia Woolf", "* Vol. 79 (July–December 1925) Thomas Hart Benton, Pierre Bonnard, Kenneth Burke, Joseph Campbell, Thomas Craven, Malcolm Cowley, E. E. Cummings, Charles Demuth, Dostoevsky, Arthur Dove, Élie Faure, Waldo Frank, Roger Fry, Eduard von Keyserling, Marie Laurencin, D. H. Lawrence, Mabel Dodge Luhan, Thomas Mann, Henry McBride, Marianne Moore, Georgia O'Keeffe, Logan Pearsall Smith, Arthur Schnitzler, Édouard Vuillard", "* Vol. 85 (July–December 1928) Conrad Aiken, Kenneth Burke, Kwei Chen, Paul Claudel, Padraic Colum, T. S. Eliot, Waldo Frank, Maxim Gorki, Philip Littell, Aristide Maillol, Frans Masereel, Elie Nadelman, Pablo Picasso, Ezra Pound, Logan Pearsall Smith, Joseph Stella, Jean Toomer, Charles K. Trueblood, Max Weber, William Carlos Williams, Louis Zukofsky"]}, {"page": "Trivia", "response": ["Trivia was used as a title by Logan Pearsall Smith in 1902, followed by More Trivia and All Trivia in 1921 and 1933, respectively, collections of short \"moral pieces\" or aphorisms. Book II of the 1902 publication is headed with a quote from \"Gay's Trivia, or New Art of Walking Streets of London.\",", "Trivialities, bits of information of little consequence was the title of a popular book by British aphorist Logan Pearsall Smith (1865-1946), first published in 1902 but popularized in 1918 (with More Trivia following in 1921 and a collected edition including both in 1933). It consisted of short essays often tied to observation of small things and commonplace moments. Trivia is the plural of trivium, \"a public place.\" The adjectival form of this, trivialis, was hence translated by Smith as \"commonplace.\"Trivia , Online Etymology Dictionary"]}, {"page": "R. C. Trevelyan", "response": ["Robert Calverl(e)y Trevelyan (; 28 June 1872 – 21 March 1951) was an English poet and translator, of a traditionalist sort, and a follower of the lapidary style of Logan Pearsall Smith."]}, {"page": "The Haunted Bookshop", "response": ["* Trivia by Logan Pearsall Smith"]}, {"page": "Logan Smith", "response": ["#Redirect Logan Pearsall Smith"]}, {"page": "List of Haverford College people", "response": ["*Logan Pearsall Smith attended 1881–1884, man of letters, author of Trivia"]}, {"page": "Mary Berenson", "response": ["Her father was Robert Pearsall Smith, her mother Hannah Whitall Smith (born Hannah Tatum Whitall). She studied at the Harvard Annex in 1884-1885. Here Mary met the Irish barrister Benjamin \"Frank\" Conn Costelloe, whom she married in 1885, having converted to Catholicism. This marriage was the occasion for the whole family, including her brother Logan Pearsall Smith and sister Alys Pearsall Smith to move to England in 1888.The Strachey Papers at the Archives in London and the M25 Area However, already in 1892 the couple separated, though Frank would not agree to divorce. "]}, {"page": "Benjamin Ivry", "response": ["*American Writers: a Collection of literary biographies. Supplement XIV, Cleanth Brooks to Logan Pearsall Smith, edited by Jay Parini, essay on Logan Pearsall Smith by Benjamin Ivry, 2004, Charles Scribner's Sons, "]}, {"page": "Logan (given name)", "response": ["*Logan Pearsall Smith (1865–1946), American essayist and critic"]}, {"page": "Horizon (magazine)", "response": ["*Logan Pearsall Smith"]}, {"page": "List of American expatriate writers", "response": ["* Logan Pearsall Smith"]}, {"page": "English phrasal verbs", "response": ["::\"...the term phrasal verb was first used by Logan Pearsall Smith, in Words and Idioms (1925), in which he states that the OED Editor Henry Bradley suggested the term to him .\""]}, {"page": "Ethel Sands", "response": ["Like Lady Sibyl Colefax and Lady Ottoline Morrell, Sands entertained artists and writers with the intention to nurture and discuss ideas relevant to their careers. Affiliated with the Bloomsbury Group,\"Jamie Cullum Ups the Jazziness of Kensal Green; Homes Gossip: Homes & Property,\" The Evening Standard. London, England, 15 December 2004. she was most well known as \"one of the leading artist hostesses of her time,\" her lavish affairs were financially possible due to the significant wealth she inherited from her parents. She was mainly at the Oxford, Newington house until 1920, but when in England she also entertained at her London Lowndes Street house, and between 1913 and 1937 at 15 Vale, Chelsea, London house, where she lived near her mother's friend, Henry James. Notable artists Augustus John and Walter Sickert.  Henry James, Virginia Woolf, Roger Fry and Arnold Bennett were among the writers of the \"cultural elite\" who visited her. Her friends included artist Jacques-Émile Blanche, writer Edith Wharton, poet William Butler Yeats, essayist and critic Logan Pearsall Smith and novelist Howard Overing Sturgis.", "* A Dressing Room, oil on millboard, 46 x 38 cm, The Ashmolean Museum of Art and Archaeology. Before it came to The Ashmolean, it was owned by Logan Pearsall Smith. The museum commented on the similarity of this work to paintings made by Édouard Vuillard.A Dressing Room  Your Paintings: Ethel Sands. BBC. Retrieved 18 January 2014.A Dressing Room  The Ashmolean Museum of Art and Archaeology. Retrieved 18 January 2014.", "* (Lloyd) Logan Pearsall Smith, 1932, oil on canvas, 61.4 x 49.8 cm, National Portrait Gallery, London(Lloyd) Logan Pearsall Smith.  Your Paintings: Ethel Sands. BBC. Retrieved 18 January 2014."]}, {"page": "Blanche Warre-Cornish", "response": ["Blanche Warre-Cornish née Ritchie (widely known as Mrs Cornish, 5 July 1848 – 9 August 1922)Obituary and Death Notice in The Times (London), 10 August 1922, pp. 1 and 14, and 12 August, p. 14. was an English writer and conversationalist, celebrated for the \"pregnant and startling irrelevancies\" of her discourse.According to Logan Pearsall Smith, recorded in Bensoniana & Cornishiana (Stone Trough Books, Settrington, 1999), p. 43. She edited some reminiscences of her cousin, the novelist William Thackeray.", "However, she was noted most of all for her conversation. This engaged and occasionally alarmed generations of Eton schoolboys. Some of her remarks were collected by Logan Pearsall Smith and printed privately in 1935 as Cornishiana. A second edition was printed in Cairo by the Press of the Institut Français d'Archéologie Orientale in 1947 and reprinted in 1999 by Stone Trough Books."]}, {"page": "List of titles in the Home University Library of Modern Knowledge", "response": ["* The English Language by Logan Pearsall Smith (40)"]}, {"page": "Pearsall (surname)", "response": ["* Logan Pearsall Smith, American essayist"]}]}}