{"wiki_id": "http://www.wikidata.org/entity/Q329942", "itemLabel": "Abraham Dee Bartlett", "itemDescription": "British zoologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Abraham_Dee_Bartlett", "wikipedia_page": {"main": "Abraham Dee Bartlett (27 October 1812 – 7 May 1897) was a British taxidermist and an expert on captive animals. A superintendent of the London Zoo, he was a prominent observer of animal life and a zoologist who became a popular authority on wildlife. Bartlett brought the London Zoo into prominence and was associated with many naturalists including Charles Darwin.", "link_mentions": [{"page": "Dodo", "response": ["Throughout the 19th century, several species were classified as congeneric with the dodo, including the Rodrigues solitaire and the Réunion solitaire, as Didus solitarius and Raphus solitarius, respectively (Didus and Raphus being names for the dodo genus used by different authors of the time). An atypical 17th-century description of a dodo and bones found on Rodrigues, now known to have belonged to the Rodrigues solitaire, led Abraham Dee Bartlett to name a new species, Didus nazarenus, in 1852. Based on solitaire remains, it is now a synonym of that species. Crude drawings of the red rail of Mauritius were also misinterpreted as dodo species; Didus broeckii and Didus herberti."]}, {"page": "Highgate Cemetery", "response": ["* Abraham Dee Bartlett, zoologist, superintendent of the London Zoo known for selling the popular African elephant Jumbo to P. T. Barnum"]}, {"page": "1812 in science", "response": ["* October 27 – Abraham Dee Bartlett, English zoologist (died 1897)"]}, {"page": "Rodrigues solitaire", "response": ["Some scientists believed that Réunion was home not only to a white dodo, but also to a white bird similar to the Rodrigues solitaire, both of which are now believed to be misinterpretations of old reports of the Réunion ibis. An atypical 17th-century description of a dodo and bones found on Rodrigues, now known to have belonged to the Rodrigues solitaire, led the British taxidermist Abraham Dee Bartlett to name a new species, Didus nazarenus; it is now a junior synonym of this species."]}, {"page": "1897 in science", "response": ["* May 7 – Abraham Dee Bartlett (born 1812), English zoologist."]}, {"page": "Francis Trevelyan Buckland", "response": ["Buckland studied at Christ Church from 1844–48, graduating at the second attempt. Passing out in May 1848 and at the advice of Richard Owen and Sir Benjamin Brodie, his father sent him to study surgery in London at St George's Hospital under Caesar Hawkins. He attended classes by Henry Gray where another classmate was Francis Day. During this time he also became acquainted with Abraham Dee Bartlett who would send him dead animals at the zoo and he continued to keep many animals.Bompas, pp. 62-49. A visit to Paris in 1849 gave him a chance of comparing their methods with those in London. In London most of the nurses were illiterate; one who claimed to read was tested with a label reading \"This lotion to be applied externally only\". "]}, {"page": "Henry Baker Tristram", "response": ["Tristram was a founder and original member of the British Ornithologists' Union, and appointed a fellow of the Royal Society in 1868. Edward Bartlett, an English ornithologist and son of Abraham Dee Bartlett, accompanied Tristram to Palestine in 1863–1864. During his travels he accumulated an extensive collection of bird skins, which he sold to the World Museum Liverpool."]}, {"page": "Joseph Wolf", "response": ["Wolf was commissioned by the Zoological Society of London to paint a watercolour of wapiti deer in the snow; it is dated January 1881. Wolf soon became the illustrator of choice for all the books published by returning adventurers like David Livingstone, Alfred Russel Wallace and Henry Walter Bates (for instance Bates' 1863 book The Naturalist on the River Amazons).Wolf joined an association called the German Athenaeum which was founded in 1869 and members met for scientific, literary and musical evenings. For their exhibitions he worked on a range of compositions often with natural elements. His favourite medium was charcoal and ink. Wolf became treasurer to a fund for German widows during the Franco-Prussian War  (War of 1870.) After the war, he met Daniel Giraud Elliot in Paris and visited a battlefield. He rendered the image in a design called \"Peace and War\" with turtle doves on a bush over a soldier's helmet. He also produces some cartoon like illustrations including \"Lecture on Embryology\" in which he taunts certain men of science. When Charles Darwin began his study of animal expressions, he was introduced by Abraham Dee Bartlett, the zoo superintendent, to the abilities of Wolf in illustrating minute details of animals in action. Darwin requested Wolf to make some illustrations from photographs and living animals in the zoological garden. Wolf held his own opinions on the reliability of others' observations and even doubted Darwin's interpretation of the face of a monkey as a \"laugh\". Darwin visited him on several occasions and Wolf appreciated him for being very approachable, someone that even \"a child could talk to\"."]}, {"page": "More Letters of Charles Darwin", "response": ["* Abraham Dee Bartlett"]}, {"page": "List of authors of names published under the ICZN", "response": ["* A.D. Bartlett – Abraham Dee Bartlett (1812–1897) general zoology (mainly vertebrates)"]}, {"page": "North Island brown kiwi", "response": ["The brown kiwi was first described as Apteryx australis by Abraham Dee Bartlett, in 1813, based on a specimen from Dusky Sound, South Island, New Zealand.Davies, S. J. J. F. (2003) This is a monotypic species.Clements, J (2007)"]}, {"page": "Edward Bartlett", "response": ["Edward Bartlett (1836 – April 1908) was an English ornithologist and herpetologist. He was the son of Abraham Dee Bartlett."]}, {"page": "Henry Stacy Marks", "response": ["In 1888 the Fine Art Society planned an exhibition on birds and Marks decided to use this opportunity to take up an intensive study of birds and he became a regular visitor at the zoo. In 1890 he had a private exhibition on his bird works.Marks (1894) v2:147-148. As his career progressed, he became increasingly interested in painting birds. Possibly his most famous painting is A Select Committee (1891) which is now in the Walker Art Gallery. He was elected as a member of the Royal Academy following his painting Convocation, which was exhibited in 1878. Both of these demonstrated his interest in birds, in the former parrots and in the latter adjutant storks and in general his paintings depicted large birds and the colourful parrots and he visited the London Zoo regularly to observe them. His early works were in oil (The Convent Raven, 1870) but many of his paintings of birds were watercolours, which he exhibited at the Old Watercolour Society or at the Fine Art Society. St Francis Preaching to the Birds (1870), was first sold for sold for £450 and seven years later for £1155. His diploma work Science is measurement depicting a scientist with measuring instruments before the skeleton of an adjutant stork is considered a classic. He got the idea of painting this scene while taking measurements for his earlier paintings. \"In making studies of the birds, I went to the Museum of the Royal College of Surgeons to take measurements of the bones, their proportionate length, &c. When I had obtained what information I needed, I came away, and crossing Lincoln's Inn Fields, it struck me that the occupation in which I had been engaged would furnish a good subject for the picture.\" To paint this picture he asked for advice on obtaining a skeleton of the adjutant stork from Sir William Flower that could be kept at home so that he could study it at leisure. Flower suggested a taxidermy artist and skeleton preparer in Camden Town who supplied him with a suitable specimen. Marks ensured that he counted the vertebrae and measured them carefully to make sure it was accurate. The title was decided after much discussion with artists and scientists and he submitted it as his diploma picture for the Royal Academy of Arts.Marks (1894). v2:52-54. Abraham Dee Bartlett, superintendent at the London zoo, encouraged him to draw birds with accuracy rather than colour them with anthropomorphism. In later years he painted landscapes and seascapes based on studies in Southwold and Walberswick."]}, {"page": "Bartlett (surname)", "response": ["* Abraham Dee Bartlett (1812–1897), British zoologist"]}]}}