{"wiki_id": "http://www.wikidata.org/entity/Q3295574", "itemLabel": "Martin Newell", "itemDescription": "computer scientist", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Newell_(computer_scientist)", "wikipedia_page": {"main": "Martin Edward Newell is a British-born computer scientist specializing in computer graphics who is perhaps best known as the creator of the Utah teapot computer model.\n\n", "link_mentions": [{"page": "Painter's algorithm", "response": ["The painter's algorithm was initially proposed as a basic method to address the Hidden-surface determination problem by Martin Newell, Richard Newell, and Tom Sancha in 1972, while all three were working at CADCentre. The name \"painter's algorithm\" refers to the technique employed by many painters where they begin by painting distant parts of a scene before parts that are nearer, thereby covering some areas of distant parts. Similarly, the painter's algorithm sorts all the polygons in a scene by their depth and then paints them in this order, farthest to closest. It will paint over the parts that are normally not visible — thus solving the visibility problem — at the cost of having painted invisible areas of distant objects. The ordering used by the algorithm is called a 'depth order' and does not have to respect the numerical distances to the parts of the scene: the essential property of this ordering is, rather, that if one object obscures part of another, then the first object is painted after the object that it obscures. Thus, a valid ordering can be described as a topological ordering of a directed acyclic graph representing occlusions between objects.."]}, {"page": "Utah teapot", "response": ["The teapot model was created in 1975 by early computer graphics researcher Martin Newell, a member of the pioneering graphics program at the University of Utah. It was one of the first to be modeled using bézier curves rather than precisely measured.", "The original, physical teapot was purchased from ZCMI (a department store in Salt Lake City) in 1974. It was donated to the Boston Computer Museum in 1984, where it was on display until 1990. It now resides in the ephemera collection at the Computer History Museum in Mountain View, California where it is catalogued as \"Teapot used for Computer Graphics rendering\" and bears the catalogue number X00398.1984.  The original teapot the Utah teapot was based on is still available from Friesland Porzellan, once part of the German Melitta group. Originally it was given the rather plain name  ('household teapot'); the company only found out about their product's \"fame\" in 2017, whereupon they officially renamed it \"Utah Teapot\". It is available in three different sizes and various colors; the one Martin Newell had used is the white \"1,4L Utah Teapot\".", "* The World's Most Famous Teapot - Tom Scott explains the story of Martin Newell's digital creation (YouTube)"]}, {"page": "Martin Newell", "response": ["Martin Newell may refer to:", "*Martin Newell (computer scientist), British computer scientist, creator of the Utah teapot", "*Martin Newell (musician) (born 1953), British singer-songwriter, poet and author", "*Martin Newell (priest) (born 1967), English priest"]}, {"page": "Martin Newell (computer graphics)", "response": ["#REDIRECT Martin Newell (computer scientist)"]}, {"page": "Martin Newell (computer science)", "response": ["#REDIRECT Martin Newell (computer scientist)"]}, {"page": "Cube mapping", "response": ["Cube mapping was first proposed in 1986 by Ned Greene in his paper “Environment Mapping and Other Applications of World Projections”, ten years after environment mapping was first put forward by Jim Blinn and Martin Newell. However, hardware limitations on the ability to access six texture images simultaneously made it infeasible to implement cube mapping without further technological developments. This problem was remedied in 1999 with the release of the Nvidia GeForce 256. Nvidia touted cube mapping in hardware as “a breakthrough image quality feature of GeForce 256 that ... will allow developers to create accurate, real-time reflections. Accelerated in hardware, cube environment mapping will free up the creativity of developers to use reflections and specular lighting effects to create interesting, immersive environments.”Nvidia, Jan 2000. Technical Brief: Perfect Reflections and Specular Lighting Effects With Cube Environment Mapping  Today, cube mapping is still used in a variety of graphical applications as a favored method of environment mapping."]}, {"page": "The Computer Museum, Boston", "response": ["Realistic image synthesis  Synthetic lighting and shading algorithms for models of three-dimensional objects have classically been tested by rendering of a teapot.  In the early 1970s, Martin Newell, working at The University of Utah, decided to use his teapot as an object with which to test various modeling, lighting and shading techniques.  In the summer of 1982, at the 1982 ACM SIGGRAPH conference,  Martin Newell donated his original teapot to Oliver Strimpel, wryly noting the symbolism of one Englishman giving another Englishman a teapot to be preserved and displayed a stone's throw from the site of the Boston Tea Party revolt of 1773.  The exhibit  displayed Allan Newell's original ceramic teapot alongside an Adage frame buffer display of a Bézier model of it, both responding interactively to changes in lighting selected by museum visitors with switches."]}, {"page": "Newell's algorithm", "response": ["Newell's Algorithm is a 3D computer graphics procedure for elimination of polygon cycles in the depth sorting required in hidden surface removal. It was proposed in 1972 by brothers Martin Newell and Dick Newell, and Tom Sancha, while all three were working at CADCentre."]}, {"page": "M. E. Newell", "response": ["#REDIRECT Martin Newell (computer scientist)"]}, {"page": "Aveva", "response": ["The centre carried out CAD research, and some of its early staff members, such as brothers Dick Newell and Martin Newell, went on to become well known in the worldwide CAD community. Dick Newell oversaw the creation of the Plant Design Management System (PDMS) for the 3D process plant design. He later co-founded two software companies – Cambridge Interactive Systems (CIS) which was known for its Medusa 2D/3D CAD system, and Smallworld with its eponymous Smallworld GIS (Geographical Information System). Martin Newell later went to the University of Utah where he did pioneering 3D solid modelling work; he was also one of the progenitors of PostScript."]}, {"page": "PDMS (software)", "response": ["The Computer-Aided Design Centre (or CADCentre as it was more commonly referred to, and later formally became) was created in Cambridge, England, UK in 1967 by the UK Ministry of Technology. Its mission was to develop computer-aided design techniques and promote their take-up by British industry.  The centre carried out much pioneering CAD research, and many of its early staff members went on to become prominent in the worldwide CAD community, such as brothers Dick Newell and Martin Newell.", "Dick Newell oversaw the creation of the Plant Design Management System (PDMS) for 3D process plant design. He later co-founded two software companies – Cambridge Interactive Systems (CIS) which was  known for its Medusa 2D/3D CAD system, and Smallworld with its eponymous Smallworld GIS (Geographical Information System). Martin Newell later went to the University of Utah where he did pioneering 3D solid modelling work; he was also one of the progenitors of PostScript."]}, {"page": "Dick Newell", "response": ["As a software engineer, he worked at CADCentre alongside his brother Martin Newell who is perhaps best known as the creator of the Utah Teapot (or Newell teapot). It was at the centre that Newell oversaw the creation of the successful Plant Design Management System (PDMS) for 3D process plant design. In 1972 Newell, his brother Martin and Tom Sancha proposed the Newell's algorithm procedure."]}, {"page": "Newell (surname)", "response": ["* Martin Newell (musician) (1953—)", "* Martin Newell (computer scientist)"]}, {"page": "Ashlar-Vellum", "response": ["Ashlar-Vellum, a dba of Ashlar Incorporated, is a developer of Computer-aided design (CAD) and 3D modeling software for both the Macintosh and Microsoft Windows platforms. Ashlar-Vellum's interface, designed in 1988 by Dr. Martin Newell and Dan Fitzpatrick, featured an automated Drafting Assistant that found useful points in the geometry and allowed the artist to quickly connect to locations like the \"midpoint\" or \"tangent\".", "Dr. Martin Newell—the creator of the “Utah teapot” in 1975—founded Ashlar, Incorporated in 1988 with Dan Fitzpatrick in Sunnyvale, California. At Xerox PARC during the 1980s, Dr. Newell researched the interaction between a computer terminal and the computer user contributing to the development of such important tools as the graphical user interface and the computer mouse. After leaving Xerox PARC, Dr. Newell realized his vision of a \"heads up\" CAD interface, where the user was free to focus on designing without distractions from the application. He developed the Inference Engine and patented this intuitive technology as the Drafting Assistant. The Drafting Assistant is the cornerstone of Ashlar-Vellum's unique user interface."]}, {"page": "Computer graphics (computer science)", "response": ["* Martin Newell (computer scientist)"]}, {"page": "Computer graphics", "response": ["* Martin Newell"]}, {"page": "University of Utah College of Engineering", "response": ["* Martin Newell - Computer scientist and graphics pioneer best known as the creator of the Utah Teapot"]}, {"page": "Cobalt (CAD program)", "response": ["Cobalt's interface, which the company named the \"Vellum interface\" after its eponymous flagship product, was designed in 1988 by Dr. Martin Newell (who created the Utah teapot in 1975 and went on to work at Xerox PARC, where the WIMP paradigm for graphical user interfaces was invented) and Dan Fitzpatrick. The central feature of the Vellum interface is its \"Drafting Assistant,\" which facilitates the creation and alignment of the new geometry."]}, {"page": "Programmable Macro Language", "response": ["PML originated from the Computer-Aided Design Centre (or CADCentre) which was established in Cambridge UK in 1967 by the UK Ministry of Technology. CADCentre, which later became AVEVA, carried out a great deal of early pioneering CAD research. Early staff members went on to become prominent in the worldwide CAD community, such as brothers Dick and Martin Newell. CADCentre was arguably the most important single factor in the transformation of Cambridge into one of the world's high technology centers within a few years in the late 1970s and early 1980s."]}, {"page": "List of common 3D test models", "response": ["| Martin Newell"]}, {"page": "List of people associated with PARC", "response": ["* Martin Newell (at PARC 1979–1981),Author biography from  graphics expert who created the Utah teapot"]}, {"page": "University of Utah School of Computing", "response": ["Taylor was credited with initiating the ARPANET project as director of ARPA's Information Processing Techniques Office (1966-1969). The architecture of the ARPANET and the use of a separate Interface Message Processor (IMP) was hatched in 1967 by Wesley A. Clark of Washington University while in a rental car with Taylor and Evans.  Taylor worked with Evans at University of Utah in 1970, before heading to California to launch legendary computer science laboratory Xerox Palo Alto Research Center, which later employed several Utah graduates, including Alan Kay, John Warnock, Martin Newell, Patrick Baudelaire, and Frank Crow.", "The Utah Teapot is one of most iconic image in computer graphics. It was designed by Martin Newell, inspired by an actual Melitta teapot he purchased from a department store in Salt Lake City. Newell was a student of Evans, graduating in 1975, and then a member of the faculty from 1975 to 1977. Originally the teapot was sketched by hand using paper and pencil. Newell then edited bezier control points on a Tektronix storage tube. With this information he created a dataset of mathematical coordinates and a 3-D wire framing. The Utah Teapot was one of the first widely available and photogenic curved-surface 3-D models, an early high-quality virtual object. For this reason, it became a common benchmark model for image synthesis programs.", "*Martin Newell - Computer scientist and graphics pioneer best known as the creator of the Utah Teapot"]}]}}