{"wiki_id": "http://www.wikidata.org/entity/Q3291051", "itemLabel": "Mary Shaw", "itemDescription": "British opera singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Shaw_(contralto)", "wikipedia_page": {"main": "Mary Shaw (1814 – 9 September 1876) was an English classical contralto who had an active international career in concerts and operas during the 1830s and 1840s. She is best remembered today for creating the role of Cuniza in the world premiere of Giuseppe Verdi's first opera Oberto at La Scala in 1839.", "link_mentions": [{"page": "1876 in music", "response": ["*September 9 – Mary Shaw, operatic contralto, 62"]}, {"page": "George Thomas Smart", "response": ["Smart was born in London, his father being a music-seller. He was a choir-boy at the Chapel Royal, and was educated in music, becoming an expert violinist, organist, teacher of singing and conductor. He taught for many years at the Royal Academy of Music where his notable pupils included Elizabeth Greenfield, John Orlando Parry, Mary Shaw, and Willoughby Weiss. In 1811 he was knighted by the Lord Lieutenant of Ireland, having conducted a number of successful concerts in Dublin. On 1 April 1822 he was appointed organist at the Chapel Royal."]}, {"page": "Oberto (opera)", "response": ["thumb|150px|Mary Shaw Postans sang the first Cuniza", "|Mary Shaw", "Given the need at the time for composers to take into account singers' strengths and weaknesses, Verdi's writing for the four principals (rather than the more conventional three of that era) who became the cast for the premiere of Oberto well accommodated the limitations of Mary Shaw's voice and played to the strengths of Antonietta Rainieri-Marini's in the lower register.  Ignazio Marini, the bass who sang the title role, was \"a performer of impressive vocal and dramatic range, for whom Verdi would later write the title role of Attila, notes Parker.  He continues by adding that \"la Marini\" was undoubtedly grateful to Verdi in that it was she who quite probably helped to secure most of the revivals of the opera during the following few years where she appeared as Leonora in four of the five of them."]}, {"page": "St. Paul (oratorio)", "response": ["The work was premiered on 22 May 1836 (having been completed in April of that yearAccording to R. Larry Todd the manuscript's two parts are dated April 8, 1836 and April 18, 1836.) at the Lower Rhenish Music Festival in Düsseldorf. The English premiere was in Liverpool on 3 October 1836 in a translation by Mendelssohn's friend, Karl Klingermann. Contralto Mary Shaw was one of the soloists at the English premiere. The first performance in the United States was in Boston on March 14, 1837. Mendelssohn himself conducted the first performance in Leipzig in the Paulinerkirche on 16 March 1837.Paulus Oratorium 2011 . Accessed 16 June 2011  Numerous performances followed in Europe and in the United States."]}, {"page": "Alfred Shaw (disambiguation)", "response": ["*Alfred Shaw (painter); see Mary Shaw (contralto)"]}, {"page": "Mary Shaw", "response": ["Mary Shaw may refer to:", "*Mary Shaw (contralto) (1814–1876), English classical contralto of concerts and operas", "*Mary Shaw (actress) (1854–1929), American actress, suffragette, early feminist, and playwright", "*Mary Shaw (computer scientist) (born 1943), American software engineer"]}]}}