{"wiki_id": "http://www.wikidata.org/entity/Q329473", "itemLabel": "Alan Cartwright", "itemDescription": "British musician (1945-2021)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Cartwright", "wikipedia_page": {"main": "Alan George Cartwright (10 October 1945 – 4 March 2021) was an English bass player.He was born in London.  Before joining Procol Harum in 1972 he played with the Freddie Mack Show together with fellow Harum band member B.J. Wilson and Roger Warwick. Cartwright's incorporation allowed Chris Copping to concentrate solely on the organ parts. The first Procol Harum album he worked on is the group's only official live album, Procol Harum Live with the Edmonton Symphony Orchestra. He continued touring and recording with the group until their penultimate album Procol's Ninth, after which Copping once again took over on bass.  After retiring from music, Cartwright spent many years in charge of the bar and social events at Bush Hill Park Bowls & Tennis Club, Enfield.Cartwright died on 4 March 2021, having been diagnosed with stomach cancer in 2020.", "link_mentions": [{"page": "1945 in music", "response": ["*October 10 – Alan Cartwright (Procol Harum)"]}, {"page": "Procol Harum Live: In Concert with the Edmonton Symphony Orchestra", "response": ["* Alan Cartwright – bass guitar"]}, {"page": "Grand Hotel (album)", "response": ["* Alan Cartwright – bass guitar, acoustic bass "]}, {"page": "Exotic Birds and Fruit", "response": ["* Alan Cartwright – bass guitar"]}, {"page": "Procol's Ninth", "response": ["* Alan Cartwright – bass guitar"]}, {"page": "Ged Peck", "response": ["In 1966, he joined the Freddie Mack Sound which consisted of anything between ten and eighteen personnel with a full scale horn section led by baritone sax player Roger Warwick and toured Britain, Ireland and France incessantly. It was here that he met drummer B. J. Wilson and bassist Alan Cartwright, both of whom were later to join Procol Harum. The band also included Liverpudlian singer Derry Wilkie who had previously topped the bill over The Beatles in Germany with his band the Pressmen. The Freddie Mack Sound was so popular on the road that people would be turned away at some gigs. This was certainly the case when the band appeared at Liverpool's Cavern Club. Freddie Mack was a former American light-heavyweight boxer of some repute. The connection helped to get them a regular residency at English boxer Billy Walker's Uppercut Club in Forest Gate, east London. They played with all the leading acts of the time such was The Who, Pink Floyd, The Small Faces and Jimi Hendrix.", "Following a myriad of aforementioned backing work, Peck was then invited by Alan Cartwright to join Every Which Way, a short-lived band prior to Cartwright and B. J. Wilson joining Procol Harum. He had a knack for turning down such promising offers having previously refused to join the chart-topping Foundations. He was also known for walking out of engagements he did not like, and was either lauded or criticised by contemporaries for his very fast playing style."]}, {"page": "Conquistador (Procol Harum song)", "response": ["* Alan Cartwrightbass guitar"]}, {"page": "Freddie Mack", "response": ["His first \"group\" was an R&B show with singers, dancers and two bands. This settled down into one backing band, called \"The Mack Sound\" put together by baritone sax player Roger Warwick. The band featured four to five horns, including, for a time, Otis Redding's trombone player Clarence Johnson, and full rhythm section with Alan Cartwright and B.J. Wilson.", "From 1967 onwards his line-ups for the \"Freddie Mack Sound\", the \"Fantastic Freddie Mack Show\" or the \"Freddie Mack Extravaganza\" included, variously, Mel Day (vocals), Ray Lewis (bass), Dave Roffey (lead guitar), Ged Peck (lead guitar), Rod Jones (bass), Dick Morrissey (tenor sax), B.J. Wilson (drums), Roger Truth (drums). Alan Cartwright (bass), Johnny Orlando (vocals), Eddie 'Tan Tan' Thomas (trumpet), Bobby Morris (keyboards), Tex Makin (bass), Bill Davidson (organ), Art Regis(Organ), Viv Prince (Drums), Derry Wilkie (vocals), Tony Gomez (keyboards), Tony Morgan (vocals), Kookie Etan (vocals), Bob Mundy (vocals), Steve Mustang Sallis (lead guitar), Brian Williams (bass), Jimmy Jewell (tenor saxophone), Jeff Bridge (tenor saxophone), Phil Presland (baritone saxophone) John Walsh (organ), Pat Green (drums) and Chris Burdett (Tenor Saxophone) among many others."]}, {"page": "Cartwright (surname)", "response": ["* Alan Cartwright (born 1945), British musician"]}]}}