{"wiki_id": "http://www.wikidata.org/entity/Q3296807", "itemLabel": "Ptolemy Reid", "itemDescription": "Prime Minister of Guyana, teacher, veterinarian, politician (1912-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ptolemy_Reid", "wikipedia_page": {"main": "Ptolemy Alexander Reid (May 8, 1918 – September 2, 2003) was a Guyanese veterinarian and politician who served as Prime Minister of Guyana from 1980 to 1984.", "link_mentions": [{"page": "1912", "response": ["** Ptolemy Reid, 2nd Prime Minister of Guyana (d. 2003)"]}, {"page": "2003", "response": ["* September 2 – Ptolemy Reid, 2nd Prime Minister of Guyana (b. 1912)"]}, {"page": "Jonestown", "response": ["Later, Burnham stated that Guyana allowed the Temple to operate in the manner it did on the references of Moscone, Mondale, and Rosalynn Carter. Burnham also said that, when Deputy Minister Ptolemy Reid traveled to Washington, D.C. in September 1977 to sign the Panama Canal Treaties, Mondale asked him, \"How's Jim?\", which indicated to Reid that Mondale had a personal interest in Jones' wellbeing."]}, {"page": "Prime Minister of Guyana", "response": ["| Ptolemy Reid"]}, {"page": "CARICOM Heads of Government", "response": ["#Note that for Guyana only the past Presidents are listed. In most instances the past Presidents of Guyana since it joined CARICOM were also past Prime Ministers at some point. Only Arthur Chung and Cheddi Jagan have never been Prime Ministers. Prime Ministers of Guyana (since it joined CARICOM) that were never Presidents at some point were  Ptolemy Reid, Hamilton Green and Moses Nagamootoo."]}, {"page": "Guyana National Museum", "response": ["Many of the museum's artefacts have been there for more than fifty years, like the Pork-knocker, which has been on display for over sixty years. There are also miniature versions of the Transport and Harbours Department Ferry boats. On display is also the PR1 vehicle, used by the Prime Minister Dr. Ptolemy Reid, during his tenure in high political office."]}, {"page": "International Visitor Leadership Program", "response": ["| Ptolemy Reid || President || 1966"]}, {"page": "Timothy Stoen", "response": ["In fear of being held in contempt of the court orders, and in an attempt to further manipulate his followers, Jones staged a false sniper attack on himself and began a series of \"White Night\" rallies, called the \"Six Day Siege\", where he told Temple members about attacks from outsiders and had members surround Jonestown with guns and machetes.Reiterman, Tim and John Jacobs. Raven: The Untold Story of Rev. Jim Jones and His People. Dutton, 1982. . p. 360-72 Angela Davis and Huey Newton communicated via radio-telephone to the Jonestown crowd, urging them to hold strong against the \"conspiracy.\"Reiterman, Tim and John Jacobs. Raven: The Untold Story of Rev. Jim Jones and His People. Dutton, 1982. . p. 369 Jones made radio broadcasts stating \"we will die unless we are granted freedom from harassment and asylum.\"Reiterman, Tim and John Jacobs. Raven: The Untold Story of Rev. Jim Jones and His People. Dutton, 1982. . p. 367 Guyanese Deputy Prime Minister Ptolemy Reid finally assured Jones' wife Marceline that Guyana Defence Force would not invade Jonestown.Reiterman, Tim and John Jacobs. Raven: The Untold Story of Rev. Jim Jones and His People. Dutton, 1982. . p. 370 A court clerk refused to sign the arrest warrant for Jones, and there was talk of interference in the legal process by the Guyanese government.Kilduff, Marshall and Ron Javers. Suicide Cult:  The Inside Story of the Peoples Temple Sect and the Massacre in Guyana. Bantam Books, New York, 1978. . page 108."]}, {"page": "Ptolemy Alexander Reid", "response": ["#REDIRECT Ptolemy Reid"]}, {"page": "Ptolemy A. Reid", "response": ["#REDIRECT Ptolemy Reid"]}, {"page": "Minister of Agriculture (Guyana)", "response": ["* Ptolemy Reid (1973-1980) (as Minister of National Development and Agriculture)"]}, {"page": "1964 British Guiana general election", "response": ["|Ptolemy Reid||People's National Congress||Minister of Home Affairs"]}, {"page": "May 1918", "response": ["* Born: Ptolemy Reid, Guyanese state leader, second Prime Minister of Guyana, in Dartmouth, British Guiana (d. 2003)"]}, {"page": "Death and state funeral of Josip Broz Tito", "response": ["*: Ptolemy Reid (Deputy Prime Minister)"]}, {"page": "House of Assembly (British Guiana)", "response": ["|Ptolemy Reid||People's National Congress||Minister of Home Affairs||Cheddi Jagan||||"]}, {"page": "List of state leaders in the 20th century (1951–2000)", "response": ["::*Ptolemy Reid, Prime minister (1980–1984)"]}, {"page": "Vice President of Guyana", "response": ["|| Ptolemy Reid"]}, {"page": "Ministry of Finance (Guyana)", "response": ["*Ptolemy Reid, September 1967 - December 1970"]}, {"page": "List of Afro-Guyanese people", "response": ["* Ptolemy Reid, former Prime Minister of Guyana"]}]}}