{"wiki_id": "http://www.wikidata.org/entity/Q3296561", "itemLabel": "Melvyn Gale", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Melvyn_Gale", "wikipedia_page": {"main": "Melvyn Gale (born 15 January 1952) is an English cellist.", "link_mentions": [{"page": "Electric Light Orchestra", "response": ["Following the release of Eldorado, Kelly Groucutt was recruited as bassist and in early 1975, Melvyn Gale replaced Edwards on cello. The line-up stabilised as the band took to a decidedly more accessible sound. ELO had become successful in the US at this point and the group was a star attraction on the stadium and arena circuit, and regularly appeared on The Midnight Special more than any other band in that show's history with four appearances (in 1973, 1975, 1976 and 1977)."]}, {"page": "1952 in music", "response": ["*January 15 – Melvyn Gale, cellist (Electric Light Orchestra)"]}, {"page": "Face the Music (Electric Light Orchestra album)", "response": ["By January 1975, bass player Mike de Albuquerque and cellist Mike Edwards had left the band during the Eldorado's recording sessions and subsequent tour, respectively. Bass player Kelly Groucutt and classically-trained cellist Melvyn Gale both joined the band as their replacements. Following the conclusion of the Eldorado's European leg of the tour, the band began recording the new album at Musicland Studios in Munich, Germany. ELO had frequently opened for Deep Purple for the initial North American leg of the Eldorado Tour, and Deep Purple had recommended Musicland to ELO. This was the first time ELO recorded at Musicland and the band would later return to record most of the future albums here due to frontman Jeff Lynne's great fondness for it and his working relationship with sound engineer Mack.", "Lynne, also the band's sole songwriter, wanted to move towards more tunes that would be memorable rather than the usual progressive-rock style of the group's first three albums and straight symphonic sound of the Eldorado. New measures were taken to ensure a more-complex but satisfying sound, such as backing female vocalists of Ellie Greenwich, Susan Collins, Nancy O'Neill and Marge Raymond, a choir, and the band's string trio of Mik Kaminski, Hugh McDowell and Melvyn Gale mixed into the backing 30-piece string section and also allowing them to perform some of the solos on the records. While Lynne was the lead vocalist for a vast majority of the band's songs, Kelly Groucutt sang lead vocals on \"Poker\" and (alternating with Lynne) on \"Nightrider\", giving the tracks a dynamic sound. The backing orchestra was recorded separately from the band's initial sessions, being recorded instead at De Lane Lea Studios in London, England.", "* Melvyn Gale – cello"]}, {"page": "A New World Record", "response": ["* Melvyn Gale – cello"]}, {"page": "Out of the Blue (Electric Light Orchestra album)", "response": ["*Melvyn Gale – cello, jangle piano on \"Wild West Hero\" (uncredited)"]}, {"page": "Discovery (Electric Light Orchestra album)", "response": ["Discovery is notable in that it was the first ELO album not to feature their resident string trio of Mik Kaminski, Hugh McDowell and Melvyn Gale, although they did make an appearance on the Discovery music videos.", "*Melvyn Gale – cello"]}, {"page": "Gale (surname)", "response": ["* Melvyn Gale (born 1952), cellist for the Electric Light Orchestra"]}, {"page": "ELO's Greatest Hits", "response": ["*Melvyn Gale – cello (1975 onwards)"]}, {"page": "Afterglow (Electric Light Orchestra album)", "response": ["* Melvyn Gale – cello (1975 onwards)"]}, {"page": "Flashback (Electric Light Orchestra album)", "response": ["*Melvyn Gale – cello (1975–1977)"]}, {"page": "1952 in British music", "response": ["*15 January – Melvyn Gale, cellist (Electric Light Orchestra)"]}, {"page": "Haberdashers' Hatcham College", "response": ["* Melvyn Gale, Musician, Electric Light Orchestra"]}, {"page": "All Over the World: The Very Best of Electric Light Orchestra", "response": ["*Melvyn Gale – Cello"]}, {"page": "Strange Magic: The Best of Electric Light Orchestra", "response": ["*Melvyn Gale - Cello (1974 onwards)"]}, {"page": "Hugh McDowell", "response": ["In 1980, McDowell played on the album Gift Wrapped by former ELO cellist Melvyn Gale, who had founded the group Wilson Gale & Co. "]}, {"page": "Fire On High", "response": ["*Melvyn Gale–cello"]}, {"page": "A Box of Their Best", "response": ["*Melvyn Gale – cello"]}, {"page": "Mr. Blue Sky", "response": ["* Melvyn Gale – cello "]}, {"page": "Wild West Hero", "response": ["\"Wild West Hero\" is a song by Electric Light Orchestra (ELO), and the closing track and third single from the album Out of the Blue. The song was written reputedly by lead singer Jeff Lynne in 4 minutes while on holiday. Melvyn Gale, normally the band's cellist, provided the Western-style piano for this track."]}, {"page": "ELO's Greatest Hits Vol. 2", "response": ["* Melvyn Gale - jangle piano on \"Wild West Hero\""]}]}}