{"wiki_id": "http://www.wikidata.org/entity/Q329107", "itemLabel": "Anthony Epstein", "itemDescription": "British scientist", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Epstein", "wikipedia_page": {"main": "Sir Michael Anthony Epstein,  (born 18 May 1921), known as Anthony Epstein, is a British pathologist and academic. He is one of the discoverers of the Epstein–Barr virus, along with Yvonne Barr and Bert Achong.", "link_mentions": [{"page": "University of Bristol", "response": ["Past academics of the university include, Patricia Broadfoot, vice-chancellor of the University of Gloucestershire, Nigel Thrift, vice-chancellor of the University of Warwick, and Wendy Larner, provost of Victoria University of Wellington. Anthony Epstein, co-discoverer of the Epstein-Barr virus, was Professor of Pathology at the university from 1968 to 1982, Sir John Lennard-Jones, discoverer of the Lennard-Jones potential in physics and Alfred Marshall, one of the University College's principals and influential economist in the latter part of the 19th century. Mathematicians and philosophers Rohit Parikh and Brian Rotman lectured in the mathematics department, and philosophers of science Paul Feyerabend and Alexander Bird taught in the department of philosophy. Another notable current academic in the department of philosophy includes Havi Carel. Notable mathematicians who have worked in the department of mathematics include Hannes Leitgeb, Philip Welch, Ben Green, Andrew Booker, Julia Wolf, Jens Marklof, John McNamara, Howell Peregrine, Christopher Budd John Hogan, Jeremy Rickard, Richard Jozsa, Corinna Ulcigrai, David Evans and the statistician Harvey Goldstein."]}, {"page": "Infectious mononucleosis", "response": ["The Epstein–Barr virus was first identified in Burkitt's lymphoma cells by Michael Anthony Epstein and Yvonne Barr at the University of Bristol in 1964. The link with infectious mononucleosis was uncovered in 1967 by Werner and Gertrude Henle at the Children's Hospital of Philadelphia, after a laboratory technician handling the virus contracted the disease: comparison of serum samples collected from the technician before and after the onset revealed development of antibodies to the virus."]}, {"page": "Wolfson College, Oxford", "response": ["Notable current and former fellows of the college include: William Bradshaw, Baron Bradshaw, Member of the House of Lords; Anthony Epstein, discoverer of the Epstein-Barr virus; Steven Schwartz, Vice Chancellor of Macquarie University in Sydney, Australia; Denis Mack Smith, historian at Oxford; Niko Tinbergen, Dutch ethologist and recipient of the Nobel Prize in Physiology or Medicine; and Dorothy Hodgkin, winner of the Nobel Prize in Chemistry."]}, {"page": "1964 in science", "response": ["* March 28 – The Epstein-Barr virus is first described, by Anthony Epstein, Bert Achong and Yvonne Barr in London."]}, {"page": "List of eponyms (A–K)", "response": ["* Yvonne Barr and Sir Anthony Epstein, British physicians – Epstein–Barr virus", "* Michael Anthony Epstein and Yvonne Barr, British physicians – Epstein–Barr virus"]}, {"page": "Oncovirus", "response": ["In 1964 Anthony Epstein, Bert Achong and Yvonne Barr identified the first human oncovirus from Burkitt's lymphoma cells. A herpesvirus, this virus is formally known as human herpesvirus 4 but more commonly called Epstein–Barr virus or EBV. In the mid 1960s Baruch Blumberg first physically isolated and characterized Hepatitis B while working at the National Institute of Health (NIH) and later the Fox Chase Cancer Center. Although this agent was the clear cause of hepatitis and might contribute to liver cancer hepatocellular carcinoma, this link was not firmly established until epidemiologic studies were performed in the 1980s by R. Palmer Beasley and others."]}, {"page": "Michael Anthony Epstein", "response": ["#REDIRECT Anthony Epstein"]}, {"page": "Denis Parsons Burkitt", "response": ["Burkitt in 1957 observed a child with swellings in the angles of the jaw. \"About two weeks later ... I looked out the window and saw another child with a swollen face ... and began to investigate these jaw tumors.\"Denis P. Burkitt, \"Discovering Burkitt's Lymphoma\" in Paul H. Levine, Epstein-Barr Virus and Human Disease (Humana Press 1987) p. xxi \"Having an intensely enquiring mind, Burkitt took the details of these cases to the records department ... which showed that jaw tumours were common, [and] were often associated with other tumours at unusual sites\"M. Anthony Epstein, \"The Origins of EBV Research\" in Erle S. Robertson, Epstein-Barr Virus (2005) p. 2 in children in Uganda. He kept copious notes and concluded that these apparently different childhood cancers were all manifestations of a single type of malignancy.Epstein, \"Origins\" p. 2 Burkitt published A sarcoma involving the jaws of African children. The newly identified cancer became known as \"Burkitt's lymphoma\". He went on to map the geographical distribution of the tumour. Burkitt, together with Dr. Dennis Wright,Biography Dennis Wright  published a book titled Burkitt's Lymphoma in April 1970."]}, {"page": "Michael Epstein", "response": ["*Sir Anthony Epstein (Michael Anthony Epstein, born 1921), one of the discoverers of the Epstein-Barr virus"]}, {"page": "History of virology", "response": ["Denis Parsons Burkitt (1911–1993) was born in Enniskillen, County Fermanagh, Ireland. He was the first to describe a type of cancer that now bears his name Burkitt's lymphoma. This type of cancer was endemic in equatorial Africa and was the commonest malignancy of children in the early 1960s. In an attempt to find a cause for the cancer, Burkitt sent cells from the tumour to Anthony Epstein (b. 1921) a British virologist, who along with Yvonne Barr and Bert Achong (1928–1996), and after many failures, discovered viruses that resembled herpes virus in the fluid that surrounded the cells. The virus was later shown to be a previously unrecognised herpes virus, which is now called Epstein–Barr virus. Surprisingly, Epstein–Barr virus is a very common but relatively mild infection of Europeans.  Why it can cause such a devastating illness in Africans is not fully understood, but reduced immunity to virus caused by malaria might be to blame. Epstein–Barr virus is important in the history of viruses for being the first virus shown to cause cancer in humans."]}, {"page": "M. Anthony Epstein", "response": ["#REDIRECT Anthony Epstein"]}, {"page": "List of living centenarians", "response": ["|Anthony Epstein || M || May 18, 1921 ||  || British || Pathologist"]}, {"page": "List of Wolfson College, Oxford, people", "response": ["* Anthony Epstein, discovered the Epstein-Barr virus"]}, {"page": "Sir Michael Anthony Epstein", "response": ["#REDIRECT Anthony Epstein"]}, {"page": "Michael A. Epstein", "response": ["#REDIRECT Anthony Epstein"]}]}}