{"wiki_id": "http://www.wikidata.org/entity/Q3299824", "itemLabel": "Matthew Wren", "itemDescription": "British bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Matthew_Wren", "wikipedia_page": {"main": "Matthew Wren (3 December 1585 – 24 April 1667) was an influential English clergyman, bishop and scholar.\n\n", "link_mentions": [{"page": "Book of Common Prayer", "response": ["The Savoy Conference ended in disagreement late in July 1661, but the initiative in prayer book revision had already passed to the Convocations and from there to Parliament. The Convocations made some 600 changes, mostly of details, which were \"far from partisan or extreme\".  However, Edwards states that more of the changes suggested by high Anglicans were implemented (though by no means all ) and Spurr comments that (except in the case of the Ordinal) the suggestions of the \"Laudians\" (Cosin and Matthew Wren) were not taken up possibly due to the influence of moderates such as Sanderson and Reynolds. For example, the inclusion in the intercessions of the Communion rite of prayer for the dead was proposed and rejected. The introduction of \"Let us pray for the whole state of Christ's Church militant here in earth\" remained unaltered and only a thanksgiving for those \"departed this life in thy faith and fear\" was inserted to introduce the petition that the congregation might be \"given grace so to follow their good examples that with them we may be partakers of thy heavenly kingdom\". Griffith Thomas commented that the retention of the words \"militant here in earth\" defines the scope of this petition: we pray for ourselves, we thank God for them, and adduces collateral evidence to this end. Secondly, an attempt was made to restore the Offertory. This was achieved by the insertion of the words \"and oblations\" into the prayer for the Church and the revision of the rubric so as to require the monetary offerings to be brought to the table (instead of being put in the poor box) and the bread and wine placed upon the table. Previously it had not been clear when and how bread and wine got onto the altar. The so-called \"manual acts\", whereby the priest took the bread and the cup during the prayer of consecration, which had been deleted in 1552, were restored; and an \"amen\" was inserted after the words of institution and before communion, hence separating the connections between consecration and communion which Cranmer had tried to make. After communion, the unused but consecrated bread and wine were to be reverently consumed in church rather than being taken away for the priest's own use. By such subtle means were Cranmer's purposes further confused, leaving it for generations to argue over the precise theology of the rite. One change made that constituted a concession to the Presbyterian Exceptions, was the updating and re-insertion of the so-called \"Black Rubric\", which had been removed in 1559. This now declared that kneeling in order to receive communion did not imply adoration of the species of the Eucharist nor \"to any Corporal Presence of Christ's natural Flesh and Blood\"—which, according to the rubric, were in heaven, not here."]}, {"page": "Pembroke College, Cambridge", "response": ["The original Chapel now forms the Old Library and has a striking seventeenth-century plaster ceiling, designed by Henry Doogood, showing birds flying overhead. Around the Civil War, one of Pembroke's fellows and Chaplain to the future Charles I, Matthew Wren, was imprisoned by Oliver Cromwell. On his release after eighteen years, he fulfilled a promise by hiring his nephew Christopher Wren to build a great Chapel in his former college. The resulting Chapel was consecrated on St Matthew's Day, 1665, and the eastern end was extended by George Gilbert Scott in 1880, when it was consecrated on the Feast of the Annunciation."]}, {"page": "Peterhouse, Cambridge", "response": ["Between 1626 and 1634, the Master was Matthew Wren. Wren had previously accompanied Charles I on his journey to Spain to attempt to negotiate the Spanish Match. Wren was a firm supporter of Archbishop William Laud, and under Wren the college became known as a centre of Arminianism. This continued under the Mastership of John Cosin, who succeeded Wren in 1634. Under Cosin significant changes were made to the college's Chapel to bring it into line with Laud's idea of the \"beauty of holiness\". On 13 March 1643, in the early stages of the English Civil War, Cosin was expelled from his position by a Parliamentary ordinance from the Earl of Manchester. The Earl stated that he was deposed \"for his opposing the proceedings of Parliament, and other scandalous acts in the University\". On 21 December of the same year, statues and decorations in the Chapel were pulled down by a committee led by the Puritan zealot William Dowsing.", "Viewed from the main entrance to Peterhouse on Trumpington Street, the altar end of the Chapel is the most immediately visible building. The Chapel was built in 1628 when the Master of the time Matthew Wren (Christopher Wren's uncle) demolished the college's original hostels. Previously the college had employed the adjacent Church of St Mary the Less as its chapel. The Chapel was consecrated on 17 March 1632 by Dr Francis White, Bishop of Ely. The building's style reflects the contemporary religious trend towards Arminianism. The Laudian Gothic style of the Chapel mixes Renaissance details but incorporated them into a traditional Gothic building. The Chapel's Renaissance architecture contains a Pietà altarpiece and a striking ceiling of golden suns. Its placement in the centre of one side of a court, between open colonnades is unusual, being copied for a single other college (Emmanuel) by Christopher Wren. The original stained glass was destroyed by Parliamentarians in 1643, with only the east window's crucifixion scene (based on Rubens's Le Coup de Lance) surviving. The current side windows are by Max Ainmiller, and were added in 1855. The cloisters on each side of the Chapel date from the 17th century. Their design was classicised in 1709, while an ornamental porch was removed in 1755. The Peterhouse Partbooks, music manuscripts from the early years of the Chapel, survive, and are one of the most important collections of Tudor and Jacobean church music. The Chapel Choir, one of the smallest in Cambridge, has recently attracted wider interest for its regular performances of this material, some of which has not been heard since the 16th century. The restoration of the 1763 John Snetzler organ in the Chapel was by Noel Mander."]}, {"page": "1585", "response": ["* December 3 – Matthew Wren, influential English clergyman (d. 1667)"]}, {"page": "1667", "response": ["* April 24 – Matthew Wren, influential English clergyman (b. 1585)"]}, {"page": "Christopher Wren", "response": ["Wren's first known foray into architecture came after his uncle, Matthew Wren, Bishop of Ely offered to finance a new chapel for Pembroke College, Cambridge. Matthew commissioned his nephew for the design, finding the architecturally inexperienced Christopher to be both ideologically sympathetic and stylistically deferential. Wren produced his design in the Winter of 1662 or 1663 and the chapel was completed in 1665."]}, {"page": "St Paul's Cathedral", "response": ["St Paul's Cathedral is built in a restrained Baroque style which represents Wren's rationalisation of the traditions of English medieval cathedrals with the inspiration of Palladio, the classical style of Inigo Jones, the baroque style of 17th century Rome, and the buildings by Mansart and others that he had seen in France. It is particularly in its plan that St Paul's reveals medieval influences.  Like the great medieval cathedrals of York and Winchester, St Paul's is comparatively long for its width, and has strongly projecting transepts. It has much emphasis on its facade, which has been designed to define rather than conceal the form of the building behind it. In plan, the towers jut beyond the width of the aisles as they do at Wells Cathedral. Wren's uncle Matthew Wren was the Bishop of Ely, and, having worked for his uncle, Wren was familiar with the unique octagonal lantern tower over the crossing of Ely Cathedral, which spans the aisles as well as the central nave, unlike the central towers and domes of most churches. Wren adapted this characteristic in designing the dome of St Paul's. In section St Paul's also maintains a medieval form, having the aisles much lower than the nave, and a defined clerestory."]}, {"page": "Norwich", "response": ["In the English Civil War, across the Eastern Counties, Oliver Cromwell's powerful Eastern Association was eventually dominant. However, to begin with, there had been a large element of Royalist sympathy within Norwich, which seems to have experienced a continuity of its two-sided political tradition throughout the period. Bishop Matthew Wren was a forceful supporter of Charles I. Nonetheless, Parliamentary recruitment took hold. The strong Royalist party was stifled by a lack of commitment from the aldermen and isolation from Royalist-held regions. Serious inter-factional disturbances culminated in \"The Great Blow\" of 1648 when Parliamentary forces tried to quell a Royalist riot. The latter's gunpowder was set off by accident in the city centre, causing mayhem. According to Hopper, the explosion \"ranks among the largest of the century\". Stoutly defended though East Anglia was by the Parliamentary army, there were said to have been pubs in Norwich where the king's health was still drunk and the name of the Protector sung to ribald verse."]}, {"page": "Wisbech", "response": ["Across the Eastern Counties, Oliver Cromwell's powerful Eastern Association was eventually dominant. However, to begin with, there had been an element of Royalist sympathy within Wisbech. Bishop Matthew Wren was a staunch supporter of Charles I but even in 1640 was unpopular in Wisbech, after discovering his absence from a 'Commission of Sewers' meeting at the Castle, a crowd of soldiers plundered shops of some of his supporters. The town was near the frontier of the Parliamentary and Royalist forces in 1643. The Castle and town were put into a state of readiness and reinforced. A troop of horse was raised. Locally based troops took part in the Siege of Crowland in 1642. The town controlled the route from Lincolnshire to Norfolk particularly during the Siege of King's Lynn in 1643 as it prevented reinforcements by land of the Royalists holding the Norfolk port."]}, {"page": "Edmund Calamy the Elder", "response": ["He then moved to Bury St Edmunds, where he lectured for ten years, the later Congregationalist Jeremiah Burroughs was another preacher in the town He retired when his bishop Matthew Wren insisted on the observance of certain ceremonial articles: Calamy refused to read out the Book of Sports in his church. In 1636 he was appointed rector (or perhaps only lecturer) of Rochford in Essex, but had to leave for the sake of his health. In 1639 he was elected to the perpetual curacy of St Mary Aldermanbury in London, where he had a large following."]}, {"page": "William Prynne", "response": ["On 11 June Prynne addressed a letter to Archbishop Laud, whom he saw as his chief persecutor, charging him with illegality and injustice. Laud handed the letter to the Attorney-General as material for a new prosecution, but when Prynne was required to own his handwriting, he contrived to get hold of the letter and tore it to pieces. Prynne wrote in the Tower and published anonymous tracts against episcopacy and the Book of Sports. In A Divine Tragedy lately acted, or a Collection of sundry memorable Examples of God's Judgment upon Sabbath-breakers he introduced Noy's recent death as a warning. In an appendix to John Bastwick's Flagellum Pontificis and in A Breviate of the Bishops' intolerable Usurpations he attacked prelates in general (1635). An anonymous attack on Matthew Wren, Bishop of NorwichNews from Ipswich (1636). brought him again before the Star Chamber. On 14 June 1637 Prynne was sentenced once more to a fine of £5,000, to imprisonment for life, and to lose the rest of his ears. At the proposal of Chief Justice John Finch, he was also to be branded on the cheeks with the letters S. L., standing for \"seditious libeller\". Prynne was pilloried on 30 June in company with Henry Burton and John Bastwick; Prynne was handled barbarously by the executioner. He made, as he returned to his prison, a couple of Latin verses explaining the 'S. L.' with which he was branded to mean 'stigmata laudis' (\"sign of praise\", or \"sign of Laud\")."]}, {"page": "Altar rail", "response": ["Archbishop Laud was a strong supporter of rails, but the common story that he introduced them to England is incorrect; he was trying to prevent Puritan clergy from continuing to remove them, and his pressure in favour of rails was bound up with his very controversial \"altar policy\", reasserting the placement of the altar in its medieval position.Cox, 249-255  Matthew Wren, Laudian Bishop of Ely, was imprisoned during the whole of the English Commonwealth and had to defend himself against charges of enforcing altar rails, which he pointed out had been found in many English churches \"time out of mind\". passage quoted in the notes  In both Catholic churches and Anglican ones following Laudian instructions, the congregation was now asked to come up to the rails and receive communion kneeling at them, replacing a variety of earlier habits.  This too was controversial in England, and the Laudian party did not push too hard for this in many dioceses.Spurr, 78-79"]}, {"page": "Hatton Garden", "response": ["The bishops disputed the Hattons' title, but, under the Protectorate, Bishop Matthew Wren was a prisoner in the Tower of London, and the palace itself was sequestrated to Parliamentarian uses and was badly damaged. To raise money Lord Hatton granted a long lease of the site in 1654, which became effectively permanent in 1658, though he retained the freehold. In 1659, John Evelyn observed Hatton Street (Hatton Garden road) being laid out from south to north, hard against the west side of the palace, as the beginning of a new planned town district. W. Bray (ed.), Diary of John Evelyn, 2 vols (M. Walter Dunne, New York/London 1901), I, p. 328. Speculative builders took leases to construct tall and spacious adjoining houses to attract wealthy men at court, city officials and country gentlefolk wanting London homes, convenient for Clerkenwell and the Inns of Court."]}]}}