{"wiki_id": "http://www.wikidata.org/entity/Q3295597", "itemLabel": "Martin Phipps", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Phipps", "wikipedia_page": {"main": "Martin Phipps (born 1 August 1968) is a British composer, who has worked on numerous film and television projects.", "link_mentions": [{"page": "Russell T Davies", "response": ["The series was filmed in the southern suburbs of Manchester between March and June 2001 and often used Davies' own home as a green room. The series was the only Red–Davies collaboration not to be scored by future Doctor Who composer Murray Gold; the soundtrack was a Martin Phipps composition inspired by Hans Zimmer's work on the 1993 film True Romance. It aired on Monday nights in September and October 2001. Critically acclaimed, the series won two British Comedy Awards, and received a nomination at the British Academy Television Awards. However, the series had lower viewership than expected and was moved to a later timeslot for the final two episodes. Although the series was not as successful as he hoped, the show helped Davies rekindle his relationship with his mother shortly before her death, just after the transmission of the fourth episode, which he sees as \"possibly the best thing [he has] ever written\"."]}, {"page": "The Virgin Queen (TV serial)", "response": ["*Composer – Martin Phipps", "The original score was composed by Martin Phipps and features vocals by the Mediæval Bæbes and the London Bulgarian Choir. The score won an Ivor Novello Award for \"Best Television soundtrack\" on 24 May 2007. The lyrics on the track played during the opening sequence were derived from a poem written by Elizabeth I."]}, {"page": "North & South (TV serial)", "response": ["Martin Phipps composed the score for North & South. The short piano tune is played throughout the whole series in different rhythms. The music is especially loud and clear whenever there is a turning point in the relationship between Margaret and Thornton."]}, {"page": "Persuasion (2007 film)", "response": ["The film was scored by Martin Phipps."]}, {"page": "Endgame (2009 film)", "response": ["Location scouting in South Africa was done in January 2008. Rehearsals began on 14 April 2008 and scenes set in the UK were filmed for the rest of the month at a large country house near Reading, Berkshire. The production moved to Cape Town in May, where location filming was done for six weeks. Production wrapped in August.Thorpe, Vanessa (17 August 2008). \"How secret talks killed off apartheid\". The Observer (Guardian News and Media): p. 23.Kemp, Stuart (7 May 2008). \"Pete Travis' 'Endgame' beginning\". The Hollywood Reporter (Nielsen Business Media). Martin Phipps composed the film soundtrack.Carlsson, Mikael (3 December 2008). \"Martin Phipps: Endgame\". Upcoming Film Scores. Retrieved on 7 December 2008. The final cut of the film was completed on 24 December 2008."]}, {"page": "Wallander (British TV series)", "response": ["One Step Behind was filmed in May. The opening scene, featuring a multiple murder and burial in the woods, was filmed on location at the Hagestads nature reserve. A large hole was needed for the shallow grave, so Yellow Bird approached the local authority for permission. The request was granted on the same day as it was lodged, with the stipulation that the hole be filled in after filming.Nilsson, Per (23 May 2008). \"Filmteam fick snabbt besked av länsstyrelsen\" (in Swedish). Ystads Allehanda (Skånemedia AB). Niall MacCormick arrived in Sweden to film Firewall in June, concluding in the third week of July.Mårtensson, Ulf (12 July 2008), \"Wallanderinspelningar rullar på\" (in Swedish), Ystads Allehanda, Skånemedia AB. Retrieved 8 October 2008. Danish Special Effects also worked on body squibs, bullet hits and atmospheric effects. Their post-production work was completed in August.Haraldsted, Soren (15 August 2008). \"DSFX finishes BBC \"Wallander\" production\", Danish Special Effects website. Retrieved 11 September 2008. While the crew were in Sweden, editing was done at The Chimney Pot in Stockholm. Post-production was completed by The Farm in London.Pennington, Adrian (19 November 2008). \"Creative Review—Wallander\", Broadcastnow, Emap Media. Retrieved 27 November 2008. Martin Phipps composed the soundtrack to the series. A version of \"Nostalgia\" by Australian singer-songwriter Emily Barker is the opening theme.Ashryn (24 November 2008). \"Nostalgia Title Track to UK Drama\", FasterLouder.com.au (FasterLouder Pty). Retrieved 30 November 2008. The three films of series 1 were broadcast on BBC One on 30 November 7 December, and 14 December 2008 respectively.", "Branagh won the award for best actor at the 35th Broadcasting Press Guild Television and Radio Awards (2009). It is his first major television award win in the UK.Douglas, Torin (27 March 2009). \"Winners – 35th BPG Television and Radio Awards\". Broadcasting Press Guild. Retrieved 27 March 2009. The series was nominated for Best Drama Series but lost to The Devil's Whore.Douglas, Torin (26 February 2009). \"Shortlist for 35th BPG Television and Radio Awards\". Broadcasting Press Guild. Retrieved 6 March 2009. The series, represented by Sidetracked, won the British Academy Television Award for Best Drama Series. Richard Cottan, Branagh, Philip Martin and Francis Hopkinson are named as the nomination recipients.\"Television Awards Winners 2009 \". British Academy of Film and Television Arts. Retrieved 24 March 2009. At the BAFTA Television Craft Awards, the series won four of five nominations: Martin Phipps for Original Television Music, Anthony Dod Mantle for Photograph & Lighting (Fiction/Entertainment), Jacqueline Abrahams for Production Design, and Bosse Persson, Lee Crichlow, Iain Eyre and Paul Hamblin for Sound (Fiction/Entertainment). Ray Leek was also nominated for his opening titles work.\"Television Craft Nominations 2009 \". British Academy of Film and Television Arts. Retrieved 6 April 2009.Holmwood, Leigh (18 May 2009). \"Wallander wins four Bafta craft awards\". guardian.co.uk (Guardian News and Media). Retrieved 18 May 2009.", "In November 2009, the Royal Television Society presented the series with two awards at the 2009 RTS Craft & Design Awards; Aidan Farrell at post-production house The Farm was presented with the Effects (Picture Enhancement) award, and Martin Phipps and Emily Barker with the Music (Original Title) award for the opening theme. Anthony Dod Mantle was also nominated in the Lighting, Photography & Camera (Photography)—Drama category, and Bosse Persson, Lee Crichlow, Iain Eyre and Paul Hamblin in the Sound (Drama) category.\"RTS Craft & Design Winners 2009 \". Royal Television Society. Retrieved 24 November 2009. The series was nominated in the Best Drama Series/Serial category at the Broadcast Awards 2010.\"Broadcast Awards 2010 Shortlist\". Emap Awards (Emap Media). Retrieved 26 November 2009. The International Press Academy nominated the series for the Satellite Award for Best Miniseries and Branagh for the Satellite Award for Best Actor – Miniseries or Television Film.\"2009 14th Annual Satellite Awards Nominations \". International Press Academy. Retrieved 1 December 2009. The Hollywood Foreign Press Association nominated Branagh for the Golden Globe Award for Best Miniseries or Television Film for his performance in One Step Behind.\"Nominations & Winners (2009) \". Golden Globe Awards, but lost to Kevin Bacon for his role as Michael Strobl for Taking Chance . Retrieved 15 December 2009."]}, {"page": "Primetime Emmy Award for Outstanding Original Main Title Theme Music", "response": ["| Martin Phipps", "| Martin Phipps", "* Martin Phipps"]}, {"page": "Primetime Emmy Award for Outstanding Music Composition for a Series", "response": ["| Martin Phipps, Ruth Barrett and Natalie Holt", "| Martin Phipps", "| Martin Phipps", "* Martin Phipps"]}, {"page": "2007 in British music", "response": ["*Best television soundtrack – The Virgin Queen (Martin Phipps)"]}, {"page": "Small Island (TV series)", "response": ["|Martin Phipps"]}, {"page": "Jack Phipps", "response": ["After a four-year spell as a management trainee at the Daily Mail, Phipps went to work for Ian Hunter at the Harold Holt music management agency in 1954, before he and his wife set up their own management agency in 1965. Their clients included Benjamin Britten (who was also godfather to Phipps’s son MartinMartin Phipps's curriculum vitae  at the web-site of his agents, Cool Music Ltd), Pilar Lorengar, Jessye Norman and Jill Gomez. During his career Phipps forged close links with many musicians, including Colin Davis, Daniel Barenboim, Bernard Haitink and Yehudi Menuhin.", "Phipps was married twice: firstly to Anne Nichol Smith, in 1950, with whom he had two children, Polly and Simon; and secondly to Sue Pears (the niece of Sir Peter Pears) with whom he had a son, the composer Martin Phipps."]}, {"page": "Emily Barker", "response": ["The band's first album released under the name Emily Barker & The Red Clay Halo, Despite The Snow, was recorded in live sessions in a 16th-century barn in Norfolk. Released in November 2008 on Everyone Sang, the album again garnered much praise. In late 2008, the album's opening track \"Nostalgia\" was discovered by composer Martin Phipps who re-recorded it with Emily for use as the theme tune for the hit television series Wallander on BBC1 starring Northern Irish actor Kenneth Branagh. The first series, which attracted over 6 million viewers per episode, won a slew of awards, including several BAFTAs and a Royal Television Society award for its theme tune.", "The song \"Pause\" from Almanac was the theme tune for a major 2011 BBC2 drama serial, The Shadow Line, starring Chiwetel Ejiofor and Christopher Eccleston. Martin Phipps again adapted the song for the title sequence.", "Working once again with Martin Phipps, Emily composed music for The Keeping Room starring Sam Worthington and Brit Marling. She then went on to compose her first feature-length soundtrack for the UK movie Hector (2015) starring Peter Mullan, released in December 2015."]}, {"page": "Hans Zimmer discography", "response": ["| Composed with Martin Phipps"]}, {"page": "Mediæval Bæbes", "response": ["In 2016, the group performed the theme song to the ITV TV series Victoria, performing the composition by Martin Phipps.", "* 2006 The Virgin Queen - Music from the Original Television Series (soundtrack album by Martin Phipps, featuring Mediæval Bæbes)", "* 2017 Victoria (soundtrack album by Martin Phipps and Ruth Barrett, featuring Mediæval Bæbes; digital-only release)"]}, {"page": "Andrew Skeet", "response": ["2015– Woman in Gold (with Martin Phipps) [Orchestrator, conductor]", "2016– War and Peace (with Martin Phipps) [Orchestrator, conductor]"]}, {"page": "Peaky Blinders (TV series)", "response": ["| Best Original Television Music || Martin Phipps || ", "| Best Music in a TV Series or Serial ||Martin Phipps|| "]}, {"page": "List of Ivor Novello Award winners", "response": ["|Martin Phipps"]}, {"page": "2012 in British music", "response": ["*Best Television Soundtrack: The Shadow Line (composed by Martin Phipps)"]}, {"page": "Ruth Barrett", "response": ["After leaving ITV, she freelanced at Strongroom Studios where she began working with her future mentor and collaborator Martin Phipps. This allowed her to further her industry experience, develop her contacts, and led directly a commission for her first drama score.", "| Martin Phipps, Ruth Barrett, and Natalie Holt"]}, {"page": "2014 in British music", "response": ["*Martin Phipps – The Honourable Woman"]}, {"page": "War & Peace (2016 TV series)", "response": ["The executive producers are Faith Penhale, George Ormond, Andrew Davies, Simon Vaughan, Robert Walak and Harvey Weinstein. The director is Tom Harper. The soundtrack was composed by Martin Phipps."]}, {"page": "Primetime Emmy Award for Outstanding Music Composition for a Limited or Anthology Series, Movie or Special", "response": ["| Martin Phipps", "| Martin Phipps", "* Martin Phipps"]}, {"page": "Natalie Holt", "response": ["Holt's breakthrough in composing came in 2012, when she worked with Martin Phipps on Great Expectations, which was nominated for a BAFTA award for Best Score. Holt then co-composed with Phipps for the BBC drama The Honourable Woman, for which they jointly won the 2015 Ivor Novello Award for Best Television Soundtrack, and were nominated again for a BAFTA. She most recently collaborated with Phipps in 2017 for Victoria, for which she was nominated for a Primetime Emmy Award in the category of \"Outstanding Music Composition for a Series\".", "| 2011 || Great Expectations || Three episodes, composed with Martin Phipps (Two episodes)", "| 2014 || The Honourable Woman || Composed with Martin Phipps (8 episodes)"]}, {"page": "Victoria (British TV series)", "response": ["The theme song is by Martin Phipps, sung by the Mediæval Bæbes. Phipps also wrote and conducted incidental music for the early episodes. For later episodes the conducting role was undertaken by Ruth Barrett. An official soundtrack for the first series was released on 12 January 2017. On 23 February 2019, Barrett has posted via her Instagram, she will be releasing a second official soundtrack to accompany the second and third series.  The second official soundtrack was released 22 February 2019 via Amazon for the United States and will be released at a later date for the United Kingdom.", "| Martin Phipps, Ruth Barrett, Natalie Holt for \"Doll 123\"", "| Martin Phipps"]}, {"page": "68th Primetime Creative Arts Emmy Awards", "response": ["** Martin Phipps for War & Peace (Episode: \"Part 1\") (Lifetime)"]}, {"page": "Hated in the Nation", "response": ["James Hawes directed the episode. He focused on pacing the escalation as the scope of the storyline changed from local to global, also choosing a limited colour palette to match the episode's genre. \"Hated in the Nation\" is a near-future story set and filmed in London, the production encompassing 32 locations and taking place over 23 days. The headquarters of Granular was shot on five locations. Faye Marsay played Blue Coulson, having auditioned for a part in series three episode \"Men Against Fire\". Kelly Macdonald starred as DCI Karin Parke. The episode's climax takes place in the safe house and was filmed over three days. The ending was filmed in Gran Canaria, as production time was too limited to shoot in the tropics. It originally featured a shot of Blue putting a knife in her bag. The soundtrack was credited to Martin Phipps, while the closing song was composed by Alev Lenz."]}, {"page": "Phipps (surname)", "response": ["** Martin Phipps (born 1968), composer"]}]}}