{"wiki_id": "http://www.wikidata.org/entity/Q3308292", "itemLabel": "Michael Kennedy", "itemDescription": "British music journalist and biographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Kennedy_(music_critic)", "wikipedia_page": {"main": "George Michael Sinclair Kennedy CBE (19 February 1926 – 31 December 2014) was an English biographer, journalist and writer on classical music. \nKennedy was born in Chorlton-cum-Hardy, Manchester, and attended Berkhamsted School. On 17 November 1941, he joined the Manchester office of Daily Telegraph at age 15, as a tea boy. In his youth, Kennedy auditioned for a role in the musical The Music Man as a member of the school board, but was passed over for the role. This led to his future distaste for the barbershop style later in life, as he noted in the Oxford Dictionary of Music. Following service in the Royal Navy, he returned to the Telegraph as an assistant to the night editor. He began writing music criticism for the paper in 1948, and became staff music critic in 1950. He served as chief sub-editor, and later Northern Editor of the Telegraph from 1960 to 1986, joint chief music critic from 1986 to 2005, and chief music critic of The Sunday Telegraph from 1989 to 2005.  He was on the Board of Governors of the Royal Northern College of Music from 1971 to 2006.  \nAs a writer, Kennedy had particular interests in late Romantic music and the history of music-making in Manchester since the 19th century. He was particularly known for acute and sympathetic studies of the works of Ralph Vaughan Williams (who was during his last years a close friend), Edward Elgar, Benjamin Britten, Gustav Mahler and Richard Strauss.  Kennedy wrote biographies of Vaughan Williams, William Walton, and of John Barbirolli, with authorisation from the composers themselves and the Barbirolli family, respectively. He is also noted for writing The Oxford Dictionary of Music, which he did whilst serving as Northern Editor of the Telegraph. Its second edition was published in 1994. \nKennedy was appointed an Officer (OBE) of the Order of the British Empire in 1981 and a Commander (CBE) in 1997. \nHe received an honorary doctorate degree in music from Manchester University in 2003. In 2005, he was elected an honorary member of the Royal Philharmonic Society.Kennedy was married twice.  His first wife was Eslyn Durdle, who suffered from multiple sclerosis for approximately fifty years.  Their marriage lasted from 1947 until her death in 1999. His second wife was Joyce Bourne, a physician whom Kennedy had met in 1976. Eslyn accepted Joyce, and only asked that he continue to look after her. He did so for 23 more years, marrying Joyce only after Eslyn's death in 1999.  Their own marriage lasted until Kennedy's death.  Bourne served as Kennedy's associate editor for his various editions of The Oxford Dictionary of Music.  Joyce Kennedy died 1 July 2021.", "link_mentions": [{"page": "Early music", "response": ["Interpretations of historical scope of \"early music\" vary. The original Academy of Ancient Music formed in 1726 defined \"Ancient\" music as works written by composers who lived before the end of the 16th century. Johannes Brahms and his contemporaries would have understood Early music to range from the High Renaissance and Baroque, while some scholars consider that Early music should include the music of ancient Greece or Rome before 500 AD (a period that is generally covered by the term Ancient music). Music critic Michael Kennedy excludes Baroque, defining Early music as \"musical compositions from [the] earliest times up to and including music of [the] Renaissance period\"."]}, {"page": "Edward Elgar", "response": ["When Elgar was 29, he took on a new pupil, Caroline Alice Roberts, daughter of the late Major-General Sir Henry Roberts, and published author of verse and prose fiction. Eight years older than Elgar, Alice became his wife three years later. Elgar's biographer Michael Kennedy writes, \"Alice's family was horrified by her intention to marry an unknown musician who worked in a shop and was a Roman Catholic. She was disinherited.\" They were married on 8 May 1889, at Brompton Oratory. From then until her death, she acted as his business manager and social secretary, dealt with his mood swings, and was a perceptive musical critic.\"Some of Elgar's Friends\", The Musical Times, April 1934, p. 319Moore (1984), p. 587 She did her best to gain him the attention of influential society, though with limited success.Moore (1984), p. 134 In time, he would learn to accept the honours given him, realising that they mattered more to her and her social class and recognising what she had given up to further his career. In her diary, she wrote, \"The care of a genius is enough of a life work for any woman.\"Kennedy (1987a), p. 115 As an engagement present, Elgar dedicated his short violin-and-piano piece Salut d'Amour to her. With Alice's encouragement, the Elgars moved to London to be closer to the centre of British musical life, and Elgar started devoting his time to composition. Their only child, Carice Irene, was born at their home in West Kensington on 14 August 1890. Her name, revealed in Elgar's dedication of Salut d'Amour, was a contraction of her mother's names Caroline and Alice.", "The two symphonies divide opinion even more sharply. Mason rates the Second poorly for its \"over-obvious rhythmic scheme\", but calls the First \"Elgar's masterpiece. ... It is hard to see how any candid student can deny the greatness of this symphony.\" However, in the 1957 centenary symposium, several leading admirers of Elgar express reservations about one or both symphonies. In the same year, Roger Fiske wrote in The Gramophone, \"For some reason few people seem to like the two Elgar symphonies equally; each has its champions and often they are more than a little bored by the rival work.\"Fiske, Roger, \"Elgar, Symphony No. 2 in E-flat major, Op. 63\", Gramophone, July 1957, p. 9 The critic John Warrack wrote, \"There are no sadder pages in symphonic literature than the close of the First Symphony's Adagio, as horn and trombones twice softly intone a phrase of utter grief\",Warrack, John, \"Three English Masters\", Gramophone, March 1984, p. 21 whereas to Michael Kennedy, the movement is notable for its lack of anguished yearning and angst and is marked instead by a \"benevolent tranquillity.\"Kennedy (1970), p. 56"]}, {"page": "Fugue", "response": ["Most fugues open with a short main theme, the subject, which then sounds successively in each voice (after the first voice is finished stating the subject, a second voice repeats the subject at a different pitch, and other voices repeat in the same way); when each voice has completed the subject, the exposition is complete. This is often followed by a connecting passage, or episode, developed from previously heard material; further \"entries\" of the subject then are heard in related keys. Episodes (if applicable) and entries are usually alternated until the \"final entry\" of the subject, by which point the music has returned to the opening key, or tonic, which is often followed by closing material, the coda.\"Fugue\", The Concise Oxford Dictionary of Music, fourth edition, ed. Michael Kennedy (Oxford and New York: Oxford University Press, 1996).   In this sense, a fugue is a style of composition, rather than a fixed structure.", "A double fugue has two subjects that are often developed simultaneously. Similarly, a triple fugue has three subjects.\"double fugue\" The Oxford Companion to Music, Ed. Alison Latham, Oxford University Press, 2002,  There are two kinds of double (triple) fugue: (a) a fugue in which the second (third) subject is (are) presented simultaneously with the subject in the exposition (e.g. as in Kyrie Eleison of Mozart's Requiem in D minor or the fugue of Bach's Passacaglia and Fugue in C minor, BWV 582), and (b) a fugue in which all subjects have their own expositions at some point, and they are not combined until later (see for example, the three-subject Fugue No. 14 in F minor from Bach's Well-Tempered Clavier Book 2, or more famously, Bach's \"St. Anne\" Fugue in E major, BWV 552, a triple fugue for organ.)\"Double Fugue\", The Concise Oxford Dictionary of Music, fourth edition, ed. Michael Kennedy (Oxford and New York: Oxford University Press, 1996) "]}, {"page": "List of agnostics", "response": ["* Ralph Vaughan Williams (1872–1958): British composer. Despite the variety of his works with religious connections, Vaughan Williams was decidedly not a believer. According to his classmate Bertrand Russell, Williams was an atheist while attending Cambridge. According to his widow, he later became an agnostic.\"Here we have a man who, while at Cambridge, was 'a most determined atheist'--those were the words of his fellow-undergraduate Bertrand Russell—and who was dismissed at the age of 25 from his post as organist in a church at South Lambeth because he refused to take Communion. Later, according to his widow, he 'drifted into a cheerful agnosticism.'\" The Unknown Vaughan Williams, Michael Kennedy, Proceedings of the Royal Musical Association, Vol. 99. (1972–1973), pp. 31–41."]}, {"page": "Sergei Prokofiev", "response": ["As a member of the Saint Petersburg music scene, Prokofiev developed a reputation as a musical rebel, while getting praise for his original compositions, which he performed himself on the piano.Oxford Concise Dictionary of Music, Michael Kennedy & Joyce Kennedy: Oxford: Oxford University Press, 5th edition 2007Rita McAllister \"Sergey Prokofiev\" in The New Grove Dictionary of Music and Musicians: London: Macmillan Publishers, 1980 In 1909, he graduated from his class in composition with unimpressive marks. He continued at the Conservatory, studying piano under Anna Yesipova and continuing his conducting lessons under Tcherepnin."]}, {"page": "Aida", "response": ["* \"Aida\" in The Oxford Dictionary of Music, (Ed.) Michael Kennedy. 2nd ed. rev., (Accessed 19 September 2010) "]}, {"page": "Laurence Olivier", "response": ["In 1943, at the behest of the Ministry of Information, Olivier began working on Henry V. Originally he had no intention of taking the directorial duties, but ended up directing and producing, in addition to taking the title role. He was assisted by an Italian internee, Filippo Del Giudice, who had been released to produce propaganda for the Allied cause. The decision was made to film the battle scenes in neutral Ireland, where it was easier to find the 650 extras. John Betjeman, the press attaché at the British embassy in Dublin, played a key liaison role with the Irish government in making suitable arrangements. The film was released in November 1944. Brooke, writing for the BFI, considers that it \"came too late in the Second World War to be a call to arms as such, but formed a powerful reminder of what Britain was defending.\" The music for the film was written by William Walton, \"a score that ranks with the best in film music\", according to the music critic Michael Kennedy. Walton also provided the music for Olivier's next two Shakespearean adaptations, Hamlet (1948) and Richard III (1955). Henry V was warmly received by critics. The reviewer for The Manchester Guardian wrote that the film combined \"new art hand-in-hand with old genius, and both superbly of one mind\", in a film that worked \"triumphantly\". The critic for The Times considered that Olivier \"plays Henry on a high, heroic note and never is there danger of a crack\", in a film described as \"a triumph of film craft\". There were Oscar nominations for the film, including Best Picture and Best Actor, but it won none and Olivier was instead presented with a \"Special Award\". He was unimpressed, and later commented that \"this was my first absolute fob-off, and I regarded it as such.\""]}, {"page": "Gustav Holst", "response": ["Holst's absorption of folksong, not only in the melodic sense but in terms of its simplicity and economy of expression,Short, p. 346 helped to develop a style that many of his contemporaries, even admirers, found austere and cerebral.Holst (1980), p. 664 This is contrary to the popular identification of Holst with The Planets, which Matthews believes has masked his status as a composer of genuine originality. Against charges of coldness in the music, Imogen cites Holst's characteristic \"sweeping modal tunes mov[ing] reassuringly above the steps of a descending bass\", while Michael Kennedy points to the 12 Humbert Wolfe settings of 1929, and the 12 Welsh folksong settings for unaccompanied chorus of 1930–31, as works of true warmth."]}, {"page": "List of prominent operas", "response": ["* 1924 Hugh the Drover (Ralph Vaughan Williams). A ballad opera, much of which is based on folksongs.Michael Kennedy, writing in Grove"]}, {"page": "Johann Pachelbel", "response": ["Pachelbel's music enjoyed enormous popularity during his lifetime; he had many pupils and his music became a model for the composers of south and central Germany. Today, Pachelbel is best known for the Canon in D; other well known works include the Chaconne in F minor, the Toccata in E minor for organ, and the Hexachordum Apollinis, a set of keyboard variations.\"Pachelbel, Johann\" The Concise Oxford Dictionary of Music, Ed. Michael Kennedy, (Oxford University Press, 1996) Oxford Reference Online, (accessed 21 March 2007)  (subscription access)"]}, {"page": "Richard Strauss", "response": ["In May 1891 Strauss came down with a serious pneumonia. While convalescing in Feldafing, he wrote to the critic Arthur Seidl: \"Dying may not be so bad, but I should first like to conduct Tristan.\"Michael Kennedy, Richard Strauss, Schirmer Books, New York 1976, p. 22", "In 1948 during a visit by his son Franz in Montreux, Strauss was prompted again to compose. Franz had told him \"Papa, stop writing letters and brooding, it does no good. Write a few nice songs instead.\" A few months later Franz' wife Alice was visiting, and just before she left, Strauss put some scores on the table and told her off-the-cuff: \"Here are the songs your husband ordered\". These were the Four Last Songs.Michael Kennedy, Richard Strauss, Schirmer Books, New York 1976, p. 112"]}, {"page": "Ralph Vaughan Williams", "response": ["While at Charterhouse Vaughan Williams found that religion meant less and less to him, and for a while he was an atheist. This softened into \"a cheerful agnosticism\", and he continued to attend church regularly to avoid upsetting the family. His views on religion did not affect his love of the Authorised Version of the Bible, the beauty of which, in the words of Ursula Vaughan Williams in her 1964 biography of the composer, remained \"one of his essential companions through life.\"Vaughan Williams (1964), p. 29 In this, as in many other things in his life, he was, according to his biographer Michael Kennedy, \"that extremely English product the natural nonconformist with a conservative regard for the best tradition\".Kennedy (1980), p. 43", "Michael Kennedy characterises Vaughan Williams's music as a strongly individual blending of the modal harmonies familiar from folk‐song with the French influence of Ravel and Debussy. The basis of his work is melody, his rhythms, in Kennedy's view, being unsubtle at times.Kennedy, Michael (ed). \"Vaughan Williams, Ralph\", The Oxford Dictionary of Music, 2nd edition, Oxford University Press, retrieved 10 October 2015  Vaughan Williams's music is often described as visionary; Kennedy cites the masque Job and the Fifth and Ninth Symphonies. Vaughan Williams's output was prolific and wide-ranging. For the voice he composed songs, operas, and choral works ranging from simpler pieces suitable for amateurs to demanding works for professional choruses. His comparatively few chamber works are not among his better known compositions.Mark, p. 179 Some of his finest works elude conventional categorisation, such as the Serenade to Music (1938) for sixteen solo singers and orchestra; Flos Campi (1925) for solo viola, small orchestra, and small chorus; and his most important chamber work, in Howes's view—not purely instrumental but a song cycle—On Wenlock Edge (1909) with accompaniment for string quartet and piano.", "In 1994 a group of enthusiasts founded the Ralph Vaughan Williams Society, with the composer's widow as its president and Roy Douglas and Michael Kennedy as vice presidents. The society, a registered charity, has sponsored and encouraged performances of the composer's works including complete symphony cycles and a Vaughan Williams opera festival. The society has promoted premieres of neglected works, and has its own record label, Albion Records.\"About the Society\" , Ralph Vaughan Williams Society, retrieved 10 October 2015"]}, {"page": "Charles Gounod", "response": ["Gounod is best known for his operas – in particular Faust. Celebrated during his lifetime, Gounod's religious music became unfashionable in the 20th century and little of it is regularly heard. His songs, an important influence on later French composers, are less neglected, although only a few are well known. Michael Kennedy writes that Gounod's music has \"considerable melodic charm and felicity, with admirable orchestration\". He adds that Gounod was \"not really a master of the large and imposing forms, in this way perhaps being a French parallel to Sullivan\".Kennedy, Michael. \"Gounod, Charles François\", The Oxford Dictionary of Music, Oxford University Press, 2012. Retrieved 30 November 2019  There is wide agreement among commentators that he was at his finest more often in the earlier decades of his career than later. Robert Orledge judges that in the 1850s and 1860s Gounod introduced to French opera a combination of \"tender, lyrical charm, consummate craftsmanship, and genuine musical characterization\", but his later works tend to \"sentimentality and banality ... in his quest for inspired simplicity\".Orledge, Robert. \"Gounod, Charles (François)\", The Oxford Companion to Music, Oxford University Press, 2011. Retrieved November 2019 "]}, {"page": "Cor anglais", "response": ["Due to the earlier bowed or angular forms it took, the suggestion has been made that anglais might be a corruption of Middle French anglé (angular, or bent at an angle, angulaire in modern French),Michael Kennedy, \"Cor anglais\", The Oxford Dictionary of Music, second edition, revised, Joyce Bourne, associate editor (Oxford and New York: Oxford University Press, 2006); A. J. Greimas, Dictionnaire de l'ancien français jusqu'au milieu du XIV siècle, second edition (Paris: Librarie Larousse, 1968): 31.  but this has been rejected on grounds that there is no evidence of the term cor anglé before it was offered as a possible origin of anglais in the late 19th century.Adam Carse, Musical Wind Instruments: A History of the Wind Instruments Used in European Orchestras and Wind-Bands from the Later Middle Ages Up to the Present Time  (London: Macmillan and Co., 1939): 143; Sybil Marcuse, \"Cor anglais\", in Musical Instruments: A Comprehensive Dictionary, revised edition, The Norton Library (New York: W. W. Norton, 1975). ."]}, {"page": "William Walton", "response": ["In 1923, in collaboration with Edith Sitwell, Walton had his first great success, though at first it was a succès de scandale. Façade was first performed in public at the Aeolian Hall, London, on 12 June. The work consisted of Edith's verses, which she recited through a megaphone from behind a screen, while Walton conducted an ensemble of six players in his accompanying music. The press was generally condemnatory. Walton's biographer Michael Kennedy cites as typical a contemporary headline: \"Drivel That They Paid to Hear\". The Daily Express loathed the work, but admitted that it was naggingly memorable.\"Poetry Through a Megaphone\", The Daily Express, 13 June 1923, p. 7 The Manchester Guardian wrote of \"relentless cacophony\".\"Futuristic Music and Poetry\", The Manchester Guardian, 13 June 1923, p. 3 The Observer condemned the verses and dismissed Walton's music as \"harmless\".\"Music of the Week\", The Observer, 17 June 1923, p. 10 In The Illustrated London News, Dent was much more appreciative: \"The audience was at first inclined to treat the whole thing as an absurd joke, but there is always a surprisingly serious element in Miss Sitwell's poetry and Mr Walton's music ... which soon induced the audience to listen with breathless attention.\"\"The World of Music\", The Illustrated London News, 23 June 1923, p. 1122 In The Sunday Times, Ernest Newman said of Walton, \"as a musical joker he is a jewel of the first water\".Kennedy, p. 31"]}, {"page": "Arnold Bax", "response": ["Neither Bax's views nor his works were fashionable in the two decades after his death. The critic Michael Kennedy writes that the mid-1950s were a time of \"immense change and transition in influential musical circles.\"Kennedy, p. 200 The music favoured by the cultural establishment until then was regarded as having made Britain musically parochial and indifferent to the developments of the past half-century. In Kennedy's words, \"Rubbra, Bax and Ireland found themselves out in the cold\"."]}, {"page": "Michael Tippett", "response": ["Sceptical critics such as the musicologist Derrick Puffett have argued that Tippett's craft as a composer was insufficient for him to deal adequately with the task that he had set himself of \"transmut[ing] his personal and private agonies into ... something universal and impersonal\". Michael Kennedy has referred to Tippett's \"open‐eyed, even naive outlook on the world\", while accepting the technical sophistication of his music.  Others have acknowledged his creative ingenuity and his willingness to adopt whatever means or techniques were necessary to fit his intentions.Bowen, p. 154"]}, {"page": "Adrian Boult", "response": ["Boult was born in Chester, Cheshire, in North West England, the second child and only son of Cedric Randal Boult (1853–1950), and his wife Katharine Florence née Barman (d. 1927).Kennedy, Michael.  \"Boult, Sir Adrian Cedric (1889–1983)\". Oxford Dictionary of National Biography, Oxford University Press, 2004, accessed 1 March 2010 (subscription required) Cedric Boult was a Justice of the Peace and a successful businessman connected with Liverpool shipping and the oil trade; Cedric and his family had \"a Liberal Unitarian outlook on public affairs\" with a history of philanthropy.The Times obituary of Adrian Boult, 24 February 1983, p. 12 When Boult was two years old the family moved to Blundellsands, where he was given a musical upbringing. From an early age he attended concerts in Liverpool, conducted mostly by Hans Richter. He was educated at Westminster School in London, where in his free time he attended concerts conducted by, among others, Sir Henry Wood, Claude Debussy, Arthur Nikisch, Fritz Steinbach, and Richard Strauss.Kennedy, pp. 12–16 and 32 His biographer, Michael Kennedy, writes, \"Few schoolboys can have attended as many performances by great artists as Boult heard between 1901 and October 1908, when he went up to Christ Church, Oxford.\" While still a schoolboy, Boult met the composer Edward Elgar through Frank Schuster, a family friend.", "During the 1930s the BBC Symphony Orchestra became renowned for its high standard of playing and for Boult's capable performances of new and unfamiliar music. Like Henry Wood before him, Boult regarded it as his duty to give the best possible performances of a wide range of composers, including those whose works were not personally congenial to him. His biographer, Michael Kennedy, writes that there was a very short list of composers whose works Boult refused to conduct, \"but it would be difficult to deduce who they were.\"Kennedy, p. 155 Boult's pioneering work with the BBC included an early performance of Schoenberg's Variations, Op. 31, British premières, including Alban Berg's opera Wozzeck and Three Movements from the Lyric Suite,Cummings, David. \"Boult's premières: Problems of Musical Lexicography\", The Musical Times, May 1989, pp. 272–75 and world premières, including Vaughan Williams's Symphony No. 4 in F minorBoult, pp. 186–87 and Bartók's Concerto for Two Pianos and Orchestra. He introduced Mahler's Ninth Symphony to London in 1934, and Bartók's Concerto for Orchestra in 1946. Boult invited Anton Webern to conduct eight BBC concerts between 1931 and 1936.Foreman, Lewis. \"Webern, the BBC and the Berg Violin Concerto\" Tempo, September 1991, pp. 2–10", "In 1952 the LPO negotiated a five-year contract with Decca Records, which was unusually rewarding for the orchestra, giving it a 10 per cent commission on most sales. On top of this, Boult always contributed his share of the recording fees to the orchestra's funds.Kennedy, p. 234 In the same year, the LPO survived a crisis when Russell was dismissed as its managing director. He was an avowed member of the Communist party;Michael Kennedy states that Russell \"was a member of the Communist Party of Great Britain and made no secret of it\"; see p.231 when the Cold War began some influential members of the LPO felt that Russell's private political affiliations compromised the orchestra, and pressed for his dismissal. Boult, as the orchestra's chief conductor, stood up for Russell, but when matters came to a head Boult ceased to protect him. Deprived of that crucial support, Russell was forced out. Kennedy speculates that Boult's change of mind was due to a growing conviction that the orchestra would be \"seriously jeopardized financially\" if Russell remained in post.Kennedy, pp. 215–22 A later writer, Richard Witts, suggests that Boult sacrificed Russell because he believed doing so would enhance the LPO's chance of being appointed resident orchestra at the Royal Festival Hall.Witts, Richard. Boult, Russell & The London Philharmonic Orchestra 1952 . Music in Society Seminar, Institute of British History, 2002"]}, {"page": "Music of Japan", "response": ["Western classical music established a strong presence in Japan, making the country one of the most important markets for this music tradition. Toru Takemitsu composed avant-garde music, contemporary classical music, and movie scoring.\"Takemitsu, Toru\", The Concise Oxford Dictionary of Music, Ed. Michael Kennedy, (Oxford, 1996), Oxford Reference Online, Oxford University Press (accessed March 16, 2007)  (subscription access). Distinguished international performers include conductor Seiji Ozawa and pianist Fujiko Hemming. "]}, {"page": "City of Birmingham Symphony Orchestra", "response": ["Panufnik's unexpectedly early departure created problems for the CBSO's management, who had intended for him ultimately to be succeeded by Meredith Davies, who had been appointed in 1957 from over 150 applicants as the orchestra's second Associate Conductor alongside Harold Gray. Although Davies was offered the Principal Conductor role and was considered to have the confidence of the players, he felt he was still unprepared for the position and suggested that \"an eminent conductor\" be appointed for the 1959–1960 season with the intention that Davies would take over the following year. Davies was therefore appointed as Deputy Music Director, and Adrian Boult returned for one year. Boult had given up the role of  principal conductor of the London Philharmonic Orchestra two years previously and was still much in demand as a guest conductor, but agreed to return to Birmingham in a move described by Michael Kennedy as \"combining nostalgia and a generous rescue act\". Boult's season saw him conduct the premiere of Robert Simpson's Violin Concerto with its dedicatee Ernest Element, and a performance of Brahm's 4th symphony described by Robert Matthew-Walker as \"the greatest performance of Brahms' fourth symphony I have ever heard.\" John Waterhouse of the Birmingham Post wrote that under Boult the CBSO again \"sounded as good as any orchestra in the country\"."]}, {"page": "BBC Symphony Orchestra", "response": ["Leonard Slatkin succeeded Davis as chief conductor, from 2000 to 2004.  His relationship with the players was reported to be uneasy, and his choice of repertoire received criticism.  In February 2005, Jiří Bělohlávek was named the orchestra's next chief conductor, effective with the 2006 Proms season.  He was principal guest conductor of the orchestra from 1995 to 2000, and was the first past principal guest conductor of the orchestra to be named its chief conductor. The classical repertory was regarded as one of Bělohlávek's strengths, but he had no reputation for conducting new works, which remained a core part of the orchestra's remit. He welcomed the fact that the orchestra's new principal guest conductor was David Robertson, a new-music expert and a protégé of Boulez. The orchestra was seen by some as \"a bolshie lot\" and \"grumpy\", but its relations with Bělohlávek were harmonious. Under Bělohlávek the orchestra won glowing reviews: The Times referred to its \"superb musicians\", Michael Kennedy in The Sunday Telegraph referred to a \"rich and opulent [score] magnificently played by the BBC Symphony Orchestra\" under Bělohlávek, and another Telegraph critic praised the BBC SO's \"virtuoso form\"."]}, {"page": "John Barbirolli", "response": ["There are memorials to Barbirolli in Manchester and London. Barbirolli Square in Manchester is named in his honour and features a sculpture of him by Byron Howard (2000).\"John Barbirolli\", Manchester Art Gallery, accessed 26 January 2011 The square includes the present base of the Hallé Orchestra, the Bridgewater Hall, in which the Barbirolli Room commemorates the conductor.\"The Barbirolli Room\" , Bridgewater Hall, accessed 12 October 2014 At his old school, St Clement Danes, now relocated in Chorleywood, the main hall is named in his honour.\"School History\" , St. Clement Danes School, accessed 27 January 2011 A commemorative blue plaque was placed on the wall of the Bloomsbury Park Hotel in Southampton Row in May 1993 to mark Barbirolli's birthplace.Rennison, p. xxvii, entry number 231 The Sir John Barbirolli Memorial Foundation of the Royal Philharmonic Society was instituted after his death to assist young musicians with the purchase of instruments.\"Sir John Barbirolli Memorial Foundation\", Royal Philharmonic Society, accessed 12 January 2011 In 1972 the Barbirolli Society was set up with the principal aim of promoting the continued release of Barbirolli's recorded performances.  Its honorary officers have included Evelyn Barbirolli, Daniel Barenboim and Michael Kennedy.The Barbirolli Society, accessed 1 February 2011  In April 2012, he was voted into the inaugural Gramophone \"Hall of Fame\".\"Sir John Barbirolli\" Gramophone, accessed 10 April 2012", "Barbirolli's repertoire was not as wide as that of many of his colleagues because he insisted on exhaustive preparation for any work he conducted. His colleague Sir Adrian Boult liked and admired Barbirolli but teased him for his meticulousness: \"We can't all be like you and spend months studying these things and then have days of rehearsals before we conduct them. For some of us they're only sporting events.\" Barbirolli was shocked by such levity.Kennedy (1987), p. 268 His approach was illustrated by the care he took with Mahler's symphonies. His biographer Michael Kennedy commented, \"it is ironical that the effort of composing the symphonies shortened Mahler's life; interpreting them certainly put an enormous strain on Barbirolli in his last decade.\"Kennedy (1971), pp. 245–246 He found that mastering a Mahler symphony took between 18 months and two years, and he would spend hours meticulously bowing all the string parts in preparation for his performances. His first performance of Mahler's Ninth took nearly 50 hours of rehearsal.Kennedy (1971), p. 247"]}, {"page": "London Philharmonic Orchestra", "response": ["In January 1951 Boult and the LPO made a tour of Germany, described by Boult's biographer Michael Kennedy as \"gruelling\", with twelve concerts in as many days.Kennedy, p. 232; and Boult, p. 202. The symphonies they played were Beethoven's Seventh, Haydn's London, No 104, Brahms's First, Schumann's Fourth and Schubert's Great C major. The other works were Elgar's Introduction and Allegro, Holst's The Perfect Fool ballet music, Richard Strauss's Don Juan, and Stravinsky's Firebird.Boult, p. 202; and Kennedy, p. 232. Conductors of the 1951–52 season other than Boult included Ralph Vaughan Williams, Benjamin Britten and William Walton.Pirouet, p. 102."]}, {"page": "Hemiola", "response": ["The Oxford Dictionary of Music illustrates hemiola with a superimposition of three notes in the time of two and vice versa.Michael Kennedy, \"Hemiola, Hemiolia\", The Oxford Dictionary of Music (Oxford and New York: Oxford University Press, 2002)."]}]}}