{"wiki_id": "http://www.wikidata.org/entity/Q330882", "itemLabel": "Gregor MacGregor", "itemDescription": "Scottish soldier, adventurer and confidence trickster", "wikipedia_url": "https://en.wikipedia.org/wiki/Gregor_MacGregor", "wikipedia_page": {"main": "General Gregor MacGregor (24 December 1786 – 4 December 1845) was a Scottish soldier, adventurer, and confidence trickster who attempted from 1821 to 1837 to draw British and French investors and settlers to \"Poyais\", a fictional Central American territory that he claimed to rule as \"Cazique\". Hundreds invested their savings in supposed Poyaisian government bonds and land certificates, while about 250 emigrated to MacGregor's invented country in 1822–23 to find only an untouched jungle; more than half of them died. Seen as a contributory factor to the \"Panic of 1825\", MacGregor's Poyais scheme has been called one of the most brazen confidence tricks in history.\nFrom the Clan Gregor, MacGregor was an officer in the British Army from 1803 to 1810; he served in the Peninsular War. He joined the republican side in the Venezuelan War of Independence in 1812, quickly became a general and, over the next four years, operated against the Spanish on behalf of both Venezuela and its neighbour New Granada. His successes included a difficult month-long fighting retreat through northern Venezuela in 1816. He captured Amelia Island in 1817 under a mandate from revolutionary agents to conquer Florida from the Spanish, and there proclaimed a short-lived \"Republic of the Floridas\". He then oversaw two calamitous operations in New Granada during 1819 that each ended with his abandoning British volunteer troops under his command.\nOn his return to Britain in 1821, MacGregor claimed that King George Frederic Augustus of the Mosquito Coast in the Gulf of Honduras had created him Cazique of Poyais, which he described as a developed colony with a community of British settlers. When the British press reported on MacGregor's deception following the return of fewer than 50 survivors in late 1823, some of his victims leaped to his defence, insisting that the general had been let down by those whom he had put in charge of the emigration party. A French court tried MacGregor and three others for fraud in 1826 after he attempted a variation on the scheme there, but convicted only one of his associates. Acquitted, MacGregor attempted lesser Poyais schemes in London over the next decade. In 1838, he moved to Venezuela, where he was welcomed back as a hero. He died in Caracas in 1845, aged 58, and was buried with full military honours in Caracas Cathedral.", "link_mentions": [{"page": "December 4", "response": ["*1845 – Gregor MacGregor, Scottish soldier and explorer (b. 1786)"]}, {"page": "List of Scots", "response": ["* Gregor MacGregor (1786–1845), adventurer, coloniser, land speculator and soldier who fought in South America during the Spanish American wars of independence, before later helping to colonise parts of the continent"]}, {"page": "Micronation", "response": ["*Several recent publications have dealt with the subject of particular historical micronations, including Republic of Indian Stream (University Press), by Dartmouth College geographer Daniel Doan, The Land that Never Was, about Gregor MacGregor and the Principality of Poyais, by David Sinclair (Review, 2003, ) and An Australian Monarch about the Principality of Hutt River by William Pitt (CopyRight Publishing, )."]}, {"page": "1820s", "response": ["* August 18, 1825 – Gregor MacGregor issues a £300,000 loan with 2.5% interest through the London bank of Thomas Jenkins & Company.  His actions lead to the Panic of 1825, the first modern stock market crash in London."]}, {"page": "1825", "response": ["* August 18 – Scottish adventurer Gregor MacGregor issues a £300,000 loan with 2.5% interest, through the London bank of Thomas Jenkins & Company, for the fictitious Central American republic of Poyais. His actions lead to the Panic of 1825, the first modern stock market crash, in England."]}, {"page": "Fernandina Beach, Florida", "response": ["Spanish pressure forced the American evacuation from the island in 1813. Spanish forces erected Fort San Carlos on the island in 1816. However, A Scottish soldier and adventurer named Gregor MacGregor with 55 musketeers seized Fort San Carlos in 1817, claiming the island on behalf of \"the brethren of Mexico, Buenos Ayres, New Grenada and Venezuela\",\"Another View of Gregor MacGregor\"  in Amelia Now On Line, Winter 2001. and raised the Green Cross of Florida flag over the Spanish Fort San Carlos."]}, {"page": "List of micronations", "response": ["| Invented by Scottish adventurer and South American independence hero Gregor MacGregor in the early 19th century. On the basis of a land grant made to him by the Anglophile native king of the Mosquito people in what is present-day Honduras, MacGregor wove one of history's most elaborate hoaxes, managing to charm the highest levels of London's political and financial establishment with tales of the bucolic, resource-rich country he claimed to rule as a benevolent sovereign prince, or \"Cazique\", when he arrived in the UK in 1822."]}, {"page": "Darien scheme", "response": ["* Gregor MacGregor"]}, {"page": "Mosquito Coast", "response": ["The Miskito kings allowed the settlement of foreigners in their lands as long as their sovereignty was respected, opportunity that was seized by British merchants and Garifuna people from Trujillo, Honduras. Between 1820 and 1837 the Scottish con man Gregor MacGregor pretended to have been named \"Cacique of Poyais\" by George Frederic Augustus I and sold forged land rights to eager settlers and investors in Britain and France. Most settlers suffered from the lack of infrastructure and died from tropical diseases, MacGregor having led them to believe that the area was already developed and just in need of skilled workers. In the 1830s and 40s King Robert Charles Frederic also appointed small traders, notably William Hodgson and brothers Peter and Samuel Shepherd, as his agents to administer his claims to tribute and taxes from lands as far south as Panama.Naylor, Robert A.; Penny Ante Imperialism: The Mosquito Shore and the Bay of Honduras, 1600–1914: A Case Study in British Informal Empire, Fairleigh Dickinson University Press, London, 1989, pp. 99–100His grants to them are found in British and Foreign State Papers (1849–50), vol. 38, London, 1862, pp. 687 and 689"]}, {"page": "Cacique", "response": ["*Gregor MacGregor, he claimed to be cacique of Poyais, a fictional Central American country"]}, {"page": "Venezuelan War of Independence", "response": ["Royalist forces under Morillo and Morales captured Cartagena and Bogotá in 1816. Before leaving for New Granada Morillo had decommissioned most of the irregular forces that had fought under Boves, except those that he took to New Granada. With little prospects, some pardos and llaneros began to join the rebellions that were breaking out against Spanish rule in the broad plains of southern Venezuela. In the meantime, Bolívar chose to sail to Jamaica to enlist British aid, which was refused. From there, he went to Haiti, which had been the first Latin American republic to become independent. With the support of the Haitian president Alexandre Pétion and with the naval aid of Luis Brión, another émigré, who was a merchant from Curaçao, Bolívar returned to Margarita Island, a secure republican redoubt, but his command of the republican forces was still not firm. Mariño, who had come back with Bolívar from Haiti, headed his own expeditions and succeeded in temporarily capturing Cumaná in 1817. With Brión supplying a small fleet, Bolívar sailed west along the Venezuelan coast to Ocumare de la Costa (the Expedition of Los Cayos), where, in fulfillment of Pétion's request, he officially proclaimed the end of slavery (although this went unheeded). Morales, back in Venezuela after subduing New Granada, attacked the republican expeditionary force with an army that vastly outnumbered the republicans. Bolívar fled, sailing once again to Haiti with Brión. However, Piar and Gregor MacGregor, a Scottish soldier of fortune, who had previously been active in New Granada, managed to escape with their forces into the interior of the country, defeating Morales at El Juncal in September 1816 before moving south to Guayana."]}, {"page": "Poyais", "response": ["#REDIRECT Gregor MacGregor#Poyais scheme"]}, {"page": "List of fictional countries", "response": ["| A financial fraud committed by Gregor MacGregor", "| A micronation in Central America created by Scottish adventurer and conman Gregor MacGregor in the 1820s, actually a part of the real country of the Mosquito Coast in what is now part of the south-east coast of Honduras.https://www.economist.com/news/christmas-specials/21568583-biggest-fraud-history-warning-professional-and-amateur-investorshttps://www.globalfinancialdata.com/news/Articles/Poyais_article_v2.pdf Poyais consisted of roughly a trangle with corners at Cape Gracias a Dios, Cape Camarón and the Black River's headwaters. Its capital city was the (fictitious) seaside town of St Joseph which MacGregor claimed to have 20,000 people living in it.  While MacGregor was given ownership of the territory in 1820 by the king, George Frederic Augustus I, he did not actually handover its sovereignty and it remained part of the Mosquito Coast. In 1821, MacGregor went to Britain and claimed claimed that George Frederic Augustus made him \"Cazique\" (prince) of Poyais and announced that he was there to find investment and settlers for the new country.https://www.globalfinancialdata.com/news/Articles/Poyais_article_v2.pdf MacGregor claimed that the land was extremely fertile, there was plenty of fish and animals to eat and that large amounts of gold were found in the rivershttps://www.economist.com/news/christmas-specials/21568583-biggest-fraud-history-warning-professional-and-amateur-investors although none of these were true. MacGregor sold lots of land to settlers https://www.economist.com/news/christmas-specials/21568583-biggest-fraud-history-warning-professional-and-amateur-investors and had them exchange their British pounds for (fraudulent) Poyais dollars.https://www.economist.com/news/christmas-specials/21568583-biggest-fraud-history-warning-professional-and-amateur-investors Some 250 people took up the offer and sailed to Poyais in 1821 and 1822, finding that it was not was claimed with some getting sick and dying of malaria with only fewer than 50 returning back to Britain.https://www.economist.com/news/christmas-specials/21568583-biggest-fraud-history-warning-professional-and-amateur-investors  MacGregor was tried for fraud after he tried the Poyais scam in France.https://www.economist.com/news/christmas-specials/21568583-biggest-fraud-history-warning-professional-and-amateur-investorshttps://www.globalfinancialdata.com/news/Articles/Poyais_article_v2.pdf"]}, {"page": "Henry Cockton", "response": ["Henry Cockton's third novel, George St. George Julian The Prince was intended to expose financial corruption, fraud and forgery. In the course of his misadventures the eponymous hero encounters several rogues and cheats, including the historical Gregor MacGregor, the self-styled Cazique of Poyais.Sutherland, op. cit., 242. The publisher collapsed before Henry Cockton had received any payment for George St. George Julian, and he was effectively bankrupted, being imprisoned for debt, but being released after declaring himself an insolvent debtor.The Times 28 Sept 1842, 7; Halliday (2017) 9."]}, {"page": "List of pirates", "response": ["| Gregor MacGregor"]}, {"page": "Clifford Chance", "response": ["Clifford Chance was formed by the merger of two London-based law firms. The first was Coward Chance, which derived from a firm established in 1802 by Anthony Brown, a fishmonger's son. Brown's firm became embroiled in the Panic of 1825, caused by speculation in South American investments, including the non-existent country of Poyais, invented by Scottish soldier Gregor MacGregor. One of the firm's longest clients was Cecil Rhodes. The firm advised him on his diamond mining business in South Africa, administered his estate after his death and helped set up the Rhodes Scholarships. Another client was Guglielmo Marconi. It also helped Midland Bank recover assets in Russia after the 1917 revolution, and advised the state government of Hyderabad on the preparation for Indian independence."]}, {"page": "Amelia Island", "response": ["===Gregor MacGregor and the Republic of the Floridas===", "Insurgencies and filibuster efforts continued. Gregor MacGregor, a Scottish-born soldier of fortune, led an army of 150 men, including recruits from Charleston and Savannah, some War of 1812 veterans, and 55 musketeers, in an assault of Fort San Carlos on June 29, 1817. The commander, Francisco Morales, struck the Spanish flag and fled. MacGregor raised his flag, the \"Green Cross of Florida\", a green cross on a white ground, over the fort and proclaimed the \"Republic of the Floridas\". On September 4, faced with the threat of Spanish reprisal, and lacking money and adequate reinforcements, MacGregor abandoned his plans to conquer Florida and departed Fernandina for the Bahamas with most of his officers, leaving a small detachment of men at Fort San Carlos. The garrison and a force of American irregulars, organized by Bram Yasho and former Pennsylvania congressman Jared Irwin, repelled the Spanish attempt to reassert authority."]}]}}