{"wiki_id": "http://www.wikidata.org/entity/Q3301335", "itemLabel": "Maurice Richards", "itemDescription": "Welsh rugby union and rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Maurice_Richards", "wikipedia_page": {"main": "Maurice Charles Rees Richards (born 2 February 1945) is a Welsh former dual-code international rugby footballer. A wing, he was part of the 1968 British Lions tour to South Africa. His grandfather had been a professional footballer with Charlton Athletic and Bradford City in the 1920s.Richards played rugby union at club level for Cardiff, and the Wales national rugby union team before switching to rugby league in 1969 with Salford.", "link_mentions": [{"page": "Barry John", "response": ["John played infrequently for Cardiff during the 1968/69 season, making just 14 appearances.Davies (1976) p. 158 Despite this he was available for all matches in the 1969 Five Nations Championship, again playing in each match paired with Edwards. The Welsh selectors had dropped five players from the previous Championship, and notable debutants in the team to face Scotland at Murrayfield on 1 February 1969 were J.P.R. Williams and Mervyn Davies. John scored his first international try in the encounter after charging down a kick and dummying his way over. Scotland, who were under enormous pressure from the kick-off, lost 17–3.Godwin (1984) p. 341 When Ireland came to the Cardiff Arms Park in March the team was on a seven match unbeaten run, and were looking at taking the Grand Slam after defeating England, France and Scotland. It therefore came as a surprise at the ease with which the Welsh pack dominated.Godwin (1984) p. 343 Wales won 24–11, with Dai Morris the stand-out Welsh player, though John also had one of his best matches, keeping pressure on the Irish with long touch kicks and scoring with a dropped goal. Despite out-scoring France in tries scored, the match at Stade Colombes ended in an 8–8 draw, preventing a Welsh Grand Slam, though a win in the last match to England would give Wales the Championship. The England decider is best remembered for Maurice Richards' four tries, but John too was on the scoresheet with a dropped goal and a try of his own. The game finished 30–9 to Wales, giving John his first Championship title and made him a Triple Crown winning player, as Wales had beaten all three other Home Nation teams.Godwin (1984) p. 344"]}, {"page": "Salford Red Devils", "response": ["|Maurice Richards", "*  Maurice Richards (Testimonial match 1980)", "*Most career tries: 297 by Maurice Richards, 1969–83", "*Most career appearances: 496 (+2 as substitute) by Maurice Richards, 1969–83"]}, {"page": "Cardiff RFC", "response": ["The 1968 Lions tour was a historic one, containing a record six Cardiff players, wings Keri Jones and Maurice Richards, prop John O'Shea, (then) centre Gerald Davies, fly-half Barry John and scrum-half Gareth Edwards. While Jones and Richards would soon switch codes to play rugby league and O'Shea's tour would be marred somewhat by being the first Lion ever to be sent off for foul play, Davies, John and Edwards would go on to become legends, although their careers got off to inauspicious starts, the Lions losing three of the Tests again South Africa and only drawing the other one.", "*  Maurice Richards 1968"]}, {"page": "Rhondda", "response": ["The most famous rugby player from the Rhondda in the latter half of the 20th century is Cliff Morgan. Morgan was born in Trebanog and gained 29 caps for Wales, four for the British Lions and was one of the inaugural inductees of the International Rugby Hall of Fame. Another notable player is Billy Cleaver from Treorchy, a member of the 1950 Grand Slam winning team. Maurice Richards, born in Tynntyla Road, Ystrad Rhondda, was a Welsh international and British Lion of note, still known today for his scoring achievements playing in this code."]}, {"page": "1968 British Lions tour to South Africa", "response": ["Unlike the previous two tours to South Africa (1955 and 1962), this British Lions team did not stop off in Nairobi, Kenya, to play East Africa on the way home. However, one member of this tour party was later to play against that team; in 1975 Peter Stagg was living in Zambia and playing rugby for the Ndola Wanderers RFC when the Tuskers visited and he played for Zambia in their first international on 31 August 1975 at Kitwe. Six of the squad would ultimately change codes and play professional rugby league, they are; Mike Coulman, Ken Goodall, Keith Jarrett, Keri Jones, Maurice Richards, and Bryan West.", "*Maurice Richards (Cardiff and Wales)"]}, {"page": "Maurice Richard (disambiguation)", "response": ["* Maurice Richards (born 1945), Welsh dual-code rugby player"]}, {"page": "List of dual-code rugby internationals", "response": ["| 70. || Maurice Richards || RU Test v Ireland || 1968 || Lansdowne Road || RL Test v France || 23 Oct 1969 || Salford || Back"]}]}}