{"wiki_id": "http://www.wikidata.org/entity/Q3300924", "itemLabel": "Maurice Hewlett", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Maurice_Hewlett", "wikipedia_page": {"main": "Maurice Henry Hewlett (1861 – 15 June 1923) was an English historical novelist, poet and essayist.", "link_mentions": [{"page": "Cottingley Fairies", "response": ["Early press coverage was \"mixed\", generally a combination of \"embarrassment and puzzlement\". The historical novelist and poet Maurice Hewlett published a series of articles in the literary journal John O' London's Weekly, in which he concluded: \"And knowing children, and knowing that Sir Arthur Conan Doyle has legs, I decide that the Miss Carpenters have pulled one of them.\" The Sydney newspaper Truth on 5 January 1921 expressed a similar view; \"For the true explanation of these fairy photographs what is wanted is not a knowledge of occult phenomena but a knowledge of children.\" Some public figures were more sympathetic. Margaret McMillan, the educational and social reformer, wrote: \"How wonderful that to these dear children such a wonderful gift has been vouchsafed.\" The novelist Henry De Vere Stacpoole decided to take the fairy photographs and the girls at face value. In a letter to Gardner he wrote: \"Look at Alice's [Frances'] face. Look at Iris's [Elsie's] face. There is an extraordinary thing called Truth which has 10 million faces and forms – it is God's currency and the cleverest coiner or forger can't imitate it.\""]}, {"page": "List of English-language poets", "response": ["*Maurice Hewlett (1861–1923, E)"]}, {"page": "Ezra Pound", "response": ["In August 1908 Pound moved to London, carrying 60 copies of A Lume Spento.Baumann (1984), 357 English poets such as Maurice Hewlett, Rudyard Kipling, and Alfred Tennyson had made a particular kind of Victorian verse—stirring, pompous, and propagandistic—popular. According to modernist scholar James Knapp, Pound rejected the idea of poetry as \"versified moral essay\"; he wanted to focus on the individual experience, the concrete rather than the abstract.Knapp (1979), 25–27", "Pound mixed with the cream of London's literary circle, including Maurice Hewlett, Laurence Binyon, Frederic Manning, Ernest Rhys, May Sinclair, Ellen Terry, George Bernard Shaw, Hilaire Belloc, T. E. Hulme, and F. S. Flint.Tytell (1987), 42–45 Through the Shakespears, he was introduced to the poet W. B. Yeats, Olivia Shakespear's former lover. He had already sent Yeats a copy of A Lume Spento, and Yeats had apparently found it \"charming\".Tytell (1987), 46 Pound wrote to William Carlos Williams on 3 February 1909: \"Am by way of falling into the crowd that does things here. London, deah old Lundon, is the place for poesy.\"Pound (1971), 7 According to Richard Aldington, London found Pound amusing. The newspapers interviewed him,Aldington (1941), 105. and he was mentioned in Punch magazine, which on 23 June 1909 described \"Mr. Ezekiel Ton\" as \"the most remarkable thing in poetry since Robert Browning ... [blending] the imagery of the unfettered West, the vocabulary of Wardour Street, and the sinister abandon of Borgiac Italy\".Punch, 23 June 1909, 449; Nadel (2010), 159"]}, {"page": "J. M. Barrie", "response": ["After the First World War, Barrie sometimes stayed at Stanway House near the village of Stanway in Gloucestershire. He paid for the pavilion at Stanway cricket ground. In 1887, he founded an amateur cricket team for friends of similarly limited playing ability, and named it the Allahakbarries under the mistaken belief that \"Allah akbar\" meant \"Heaven help us\" in Arabic (rather than \"God is great\"). Some of the best known British authors from the era played on the team at various times, including H. G. Wells, Rudyard Kipling, Arthur Conan Doyle, P. G. Wodehouse, Jerome K. Jerome, G. K. Chesterton, A. A. Milne, E. W. Hornung, A. E. W. Mason, Walter Raleigh, E. V. Lucas, Maurice Hewlett, Owen Seaman (editor of Punch), Bernard Partridge, George Cecil Ives, George Llewelyn Davies (see below) and the son of Alfred Tennyson. In 1891, Barrie joined the newly formed Authors Cricket Club and also played for its cricket team, the Authors XI, alongside Doyle, Wodehouse and Milne. The Allahakbarries and the Authors XI continued to exist side by side until 1912."]}, {"page": "1900 in literature", "response": ["*Maurice Hewlett – The Life and Death of Richard Yea-and-Nay"]}, {"page": "1898 in literature", "response": ["*Maurice Hewlett – Forest Lovers"]}, {"page": "Conrad of Montferrat", "response": ["An entirely fictionalised, unambiguously wicked version of Conrad appears in Walter Scott's The Talisman, misspelled as 'Conrade of Montserrat' (the novelist apparently misreading 'f' as a long 's' in his sources) and described as a \"marmoset\" and \"popinjay\". He is also a villain in Maurice Hewlett's fanciful The Life and Death of Richard Yea-and-Nay (1900). He appears briefly, again in a negative light, in Ronald Welch's Knight Crusader (1954): the description owes much to his portrayal in Cecil B. de Mille's The Crusades, mentioned below. The nadir of his fictional appearances is in Graham Shelby's 1970 novel The Kings of Vain Intent. In this, he is thoroughly demonised — depicted as a sinister figure, physically resembling a vampire; in a chapter added by the author to the U.S. edition, he beats and rapes Isabella. These works reflect the later Renaissance and Gothic novel cultural/ethnic stereotype of the 'Machiavellian' Italian: corrupt, scheming, dandified, not averse to poisoning, even (as in Shelby's novel) sexually sadistic. In contrast, the Russian-born French novelist Zoé Oldenbourg gives him a more positive but fleeting cameo-role — proud, strong, and as handsome as Choniates described him — in her 1946 novel Argile et Cendres (Clay and Ashes, published in English as The World Is Not Enough in 1948). He is the hero of Luigi Gabotto's 1968 novel Corrado di Monferrato, which covers his whole career. Another sympathetic portrayal is in Alan Gordon's mystery novel, The Widow of Jerusalem (2003), which investigates his murder."]}, {"page": "Harold Monro", "response": ["Lascelles Abercrombie, Richard Aldington, John Alford, A. C. Benson, Laurence Binyon, Edmund Blunden, W. S. Blunt, Gordon Bottomley, Robert Bridges, Rupert Brooke, Samuel \"Erewhon\" Butler, Roy Campbell, G. K. Chesterton, Richard Church, Padraic Colum, A. E. Coppard, Frances Cornford, John Davidson, W. H. Davies, Jeffery Day, Walter de la Mare, Lord Alfred Douglas, John Drinkwater, Helen Parry Eden, T. S. Eliot, Vivian Locke Ellis, Michael Field, J. E. Flecker, F. S. Flint, John Freeman, Stella Gibbons, Wilfrid Gibson, Robert Graves, Thomas Hardy, H. D., Philip Henderson, Maurice Hewlett, Ralph Hodgson, Gerard Manley Hopkins, A. E. Housman, Ford Madox Hueffer, T. E. Hulme, Aldous Huxley, James Joyce, Rudyard Kipling, D. H. Lawrence, Cecil Day-Lewis, John Masefield, R. A. K. Mason, Charlotte Mew, Alice Meynell, Viola Meynell, Harold Monro, T. Sturge Moore, Edwin Muir, Henry Newbolt, Robert Nichols, Alfred Noyes, Wilfred Owen, J. D. C. Pellow, H. D. C. Pepler, Eden Phillpotts, Ezra Pound, Peter Quennell, Herbert Read, Isaac Rosenberg, Siegfried Sassoon, Geoffrey Scott, Edward Shanks, Fredegond Shove, Edith Sitwell, Osbert Sitwell, Sacheverell Sitwell, Stephen Spender, J. C. Squire, James Stephens, Edward Thomas, W. J. Turner, Sylvia Townsend Warner, Max Weber, Anna Wickham, Humbert Wolfe, William Butler Yeats"]}, {"page": "Gudrid Thorbjarnardóttir", "response": ["* Her tale is told in the novel 'Gudrid the Fair' by Maurice Hewlett, and in The Sea Road by Scottish writer Margaret Elphinstone (Canongate Books, 2000)"]}, {"page": "Hugh Walpole", "response": ["In early 1914 James wrote an article for The Times Literary Supplement surveying the younger generation of British novelists and comparing them with their eminent elder contemporaries. In the latter category James put Bennett, Joseph Conrad, John Galsworthy, Maurice Hewlett and HGWells. The four new authors on whom he focused were Walpole, Gilbert Cannan, Compton Mackenzie and D H Lawrence. It was a very lengthy article, to the extent that it had to be spread across two issues of the Supplement in March and April 1914. James said that agreeing to write it had been \"an insensate step\",Edel, p. 712 but from Walpole's point of view it was highly satisfactory: one of the greatest living authors had publicly ranked him among the finest young British novelists.Hart-Davis, pp. 110–112"]}, {"page": "Bertran de Born", "response": ["Dante's depiction of him influenced later literary works. In her epic poem Cœur de Lion (1822), Eleanor Anne Porden portrays him fomenting discord in the Third Crusade and, because of his remorse over his involvement with Richard's imprisonment, becoming a hermit. He also figures as a minor character in Maurice Hewlett's novel The Life and Death of Richard Yea-and-Nay (1900), depicted unflatteringly. He is described as \"a man of hot blood, fumes and rages\", with \"a grudging spirit\". One character dismisses him thus: \"Great poet he was, great thief, and a silly fool.\"", "* Maurice Hewlett, The Life & Death of Richard Yea-and-Nay (London, 1900) (external link to Project Gutenberg text)"]}, {"page": "Maurice Henry Hewlett", "response": ["#REDIRECT Maurice Hewlett"]}, {"page": "The Cantos", "response": ["In the first thread, the figure of Pound/Odysseus reappears in the guise of \"OY TIS\", or No Man, the name the hero uses in the Cyclops episode of the Odyssey. This figure blends into the Australian rain god Wuluwaid, who had his mouth closed up by his father (was deprived of freedom of speech) because he \"created too many things\". He, in turn, becomes the Chinese Ouan Jin, or \"man with an education\". This theme recurs in the line \"a man on whom the sun has gone down\", a reference to the nekuia from canto I, which is then explicitly referred to. This recalls The Seafarer, and Pound quotes a line from his translation, \"Lordly men are to earth o'ergiven\", lamenting the loss of the exiled poet's companions. This is then applied to a number of Pound's dead friends from the London/Paris years, including W.B. Yeats, James Joyce, Ford Madox Ford, Victor Plarr and Maurice Hewlett. Finally, Pound/Odysseus is seen \"on a raft blown by the wind\"."]}, {"page": "Oxford period poetry anthologies", "response": ["Lascelles Abercrombie – Percy Addleshaw – Douglas Ainslie – Thomas Bailie Aldrich – William Alexander – William Allingham – Sir Edwin Arnold – Matthew Arnold – Thomas Ashe – Alfred Austin – William Edmonstoune Aytoun – Philip James Bailey – Richard Harris Barham – Maurice Baring – George Barlow – Jane Barlow – William Barnes – Benjamin Disraeli, 1st Earl of Beaconsfield – Thomas Lovell Beddoes – Henry Charles Beeching – Charles Dent Bell – Hilaire Belloc – Arthur Christopher Benson – Laurence Binyon – John Stuart Blackie – Richard Doddridge Blackmore – Mathilde Blind – Wilfrid Scawen Blunt – George Henry Boker – Gordon Bottomley – Francis William Bourdillon – Robert Bridges – Emily Brontë – Rupert Brooke – Robert Barnabas Brough – Oliver Madox Brown – Thomas Edward Brown – Elizabeth Barrett Browning – Robert Browning – William Cullen Bryant – Robert Buchanan – Arthur Gray Butler – Wathen Mark Wilks Call – Thomas Carlyle – Bliss Carman – John Clare – Caroline Clive – Arthur Hugh Clough – Hartley Coleridge – Mary E. Coleridge – Sara Coleridge – Mortimer Collins – Frances Cornford – William Cory – Frances Burdett Money Coutts – Dinah Maria Craik – Walter Crane – Marquess of Crewe – Arthur Shearly Cripps – Henry Cust – George Darley – John Davidson – William H. Davies – Thomas Osborne Davis – William James Dawson – Walter De la Mare – Lord De Tabley – Sir Aubrey De Vere – Aubrey De Vere – Emily Dickinson – Richard Watson Dixon – Bertram Dobell – Sydney Dobell – Austin Dobson – Alfred Domett – Lord Alfred Douglas – Edward Dowden – Ernest Dowson – Sir Francis Hastings Doyle – John Drinkwater – Agnes Mary Frances Duclaux – Helen, Lady Dufferin – George Louis Palmella Busson du Maurier – Matilda Betham Edwards – George Eliot – Ebenezer Elliott – Henry Ellison – Ralph Waldo Emerson – Frederick William Faber – Sir Samuel Ferguson – Michale Field – Edward Fitzgerald – James Elroy Flecker – Alice Furlong – Norman Gale – Richard Garnett – Wilfrid Wilson Gibson – Adam Lindsay Gordon – Edmund Gosse – Charles Granville – David Gray – Dora Greenwell – Gerald Griffin – Louise Imogen Guiney – Fitz-Greene Halleck – Thomas Hardy – Bret Harte – Robert Stephen Hawker – William Ernest Henley – Maurice Hewlett – Emily Henrietta Hickey – Katharine Tynan Hinkson – Oliver Wendell Holmes – Thomas Hood – George Hookham – Gerard Manley Hopkins – Richard Henry Horne – Lord Houghton – Laurence Housman – Julia Ward Howe – William Dean Howells – Leigh Hunt – Douglas Hyde – Jean Ingelow – Lionel Johnson – Ebenezer Jones – Ernest Charles Jones – James Joyce – John Keble – Frances Anne Kemble – Henry Clarence Kendall – John Kenyon – Charles Kingsley – Henry Kingsley – Rudyard Kipling – Walter Savage Landor – Andrew Lang – Emily Lawless – Eugene Lee-Hamilton – Edward Cracroft Lefroy – Richard Le Gallienne – Amy Levy – William James Linton – Frederick Locker-Lampson – John Gibson Lockhart – Henry Wadsworth Longfellow – James Russell Lowell – Henry Dawson Lowry – Sir Alfred Comyn Lyall – Thomas Toke Lynch – Sidney Royse Lysaght – Earl of Lytton – Lord Lytton – Lord Macaulay – Denis Florence MacCarthy – George MacDonald – Charles Mackay – H. C. Compton Mackenzie – Francis Mahony – James Clarence Mangan – Philip Bourke Marston – Theophile Marzials – John Masefield – Gerald Massey – Annie Matheson – George Meredith – Herman Charles Merivale – Alice Meynell – Richard Middleton – William Cosmo Monkhouse – Harold Monro – Mary Montgomerie – T. Sturge Moore – Sir Lewis Morris – William Morris – Neil Munro – Ernest Myers – Frederic William Henry Myers – John Mason Neale – Henry Newbolt – John Henry Newman – John Nicol – Roden Berkeley Wriothesley Noel – Caroline Elizabeth Sarah Norton – Alfred Noyes – Moira O'Neill – John Boyle O'Reilly – Arthur William Edgar O'Shaughnessy – Francis Turner Palgrave – Sir Gilbert Parker – Fanny Parnell – Coventry Patmore – John Payne – John Swinnerton Phillimore – Stephen Phillips – Eden Phillpotts – William Philpot – Edgar Allan Poe – Walter Herries Pollock – Ezra Pound – Winthrop Mackworth Praed – May Probyn – Adelaide Anne Procter – Bryan Waller Procter – Sir Arthur Quiller-Couch – Ernest Radford – William Brighty Rands – Hardwick Drummond Rawnsley – Ernest Rhys – James Logie Robertson – Sir James Rennell Rodd – Samuel Rogers – T. W. Rolleston – William Caldwell Roscoe – William Stanley Roscoe – Christina Georgina Rossetti – Dante Gabriel Rossetti – Earl of Rosslyn – John Ruskin – George William Russell – Lady Margaret Sackville – George Santayana – William Bell Scott – John Campbell Shairp – William Sharp – Dora Sigerson Shorter – Joseph Skipsey – Douglas Brook Wheelton Sladen – Menella Bute Smedley – Alexander Smith – Walter C. Smith – James Stephens – Robert Louis Stevenson – Charles Swain – Elinor Sweetman – Algernon Charles Swinburne – John Addington Symonds – Arthur Symons – John M. Synge – Sir Henry Taylor – Rachel Annand Taylor – Frederick Tennyson – Lord Tennyson – William Makepeace Thackeray – Francis Thompson – Edward William Thomson – James Thomson (B.V.) – Henry David Thoreau – Wilfrid Thorley – Walter Thornbury – John Todhunter – Archbishop Trench – Herbert Trench – Charles Tennyson Turner – Samuel Waddington – Thomas Wade – Edward Walsh – Thomas Herbert Warren – Rosamund Marriott Watson – William Watson – Theodore Watts-Dunton – Augusta Webster – Thomas Westwood – Charles Whitehead – Walt Whitman – John Greenleaf Whittier – Oscar Wilde – Sarah Williams – Nathaniel Parker Lewis – Margaret L. Woods – Thomas Woolner – William Butler Yeats"]}, {"page": "List of cultural references in The Cantos", "response": ["*Maurice Hewlett – Poet and friend of Pound's in his early days in London. – Canto XCII"]}, {"page": "1923 in poetry", "response": ["* June 15 – Maurice Hewlett, 62 (born 1861), English historical novelist, poet and essayist"]}, {"page": "Louis Joseph Vance", "response": ["Vance moved to Los Angeles to work with Universal Pictures on films based on his work, including The Trey o' Hearts (1914) and a serial and film series (1914–1916) based on his Terence O'Rourke stories. In 1915, he founded Fiction Pictures, Inc., a motion picture production company whose films were distributed by Paramount Pictures. Its first release was The Spanish Jade (1915), with a screenplay by Vance based on his stage adaptation of a novel by Maurice Hewlett. Vance was president and general manager of the company; other principals were Wilfred Lucas (director-general), Gilbert Warrenton (cinematographer) and Bess Meredyth (scenario editor). Fiction Pictures operated in Glendale until a new studio in Hollywood was completed in April 1915. The studio was sold to Famous Players in June, when Fiction Pictures went out of business."]}, {"page": "Bookman list of bestselling novels in the United States in the 1900s", "response": ["# The Life and Death of Richard Yea-and-Nay by Maurice Hewlett"]}, {"page": "1900 in the United Kingdom", "response": ["* Maurice Hewlett's historical novel The Life and Death of Richard Yea-and-Nay."]}, {"page": "1933 in poetry", "response": ["*Maurice Hewlett"]}, {"page": "1895 in poetry", "response": ["* Maurice Hewlett, A Masque of Dead Florentines"]}, {"page": "1861 in poetry", "response": ["* January 22 – Maurice Hewlett (died 1923), English historical novelist, poet and essayist"]}, {"page": "1898 in the United Kingdom", "response": ["* Maurice Hewlett's historical novel Forest Lovers."]}, {"page": "1861 in the United Kingdom", "response": ["* 22 January – Maurice Hewlett, historical novelist, poet and essayist (died 1923)"]}, {"page": "Hilda Hewlett", "response": ["She married barrister and write Maurice Henry Hewlett on 3 January 1888 in St Peter's Church, Vauxhall, where her father was the incumbent. The couple had two children, a daughter, Pia, and a son, Francis, but separated in 1914. Maurice Hewlett was unsympathetic to his wife's involvement in aviation and claimed, \"Women will never be as successful in aviation as men. They have not the right kind of nerve.\"The Elmbridge Hundred, 2009, 2010 – Article on Hilda Hewlett by Anne Wright.   accessed 9 Jan 2012.  ", "Her grandson's wife Gail has carried out exhaustive research into the lives of both Hilda and Maurice Hewlett and recently published the results of this work;Hewlett, Gail (2010) 'Old Bird – The Irrepressible Mrs Hewlett' (Troubadour Publishing Ltd, Leicester, ) the book was officially launched on 26 April 2010 at St Peter's Church in Vauxhall, London."]}, {"page": "Hewlett (surname)", "response": ["*Hilda Hewlett (1864–1943), aviation pioneer, wife of Maurice Hewlett", "*Maurice Hewlett, author, husband of Hilda Hewlett"]}, {"page": "Cultural depictions of Richard I of England", "response": ["*Maurice Hewlett's novel The Life and Death of Richard Yea-and-Nay  (1900) is a novel about Richard's life.Nield, Jonathan, A Guide to the Best Historical Novels and Tales. London, E. Mathews & Marrot, 1929 (p.34)."]}, {"page": "Cultural depictions of Edward III of England", "response": ["Edward III of England is the central character in the play Edward III, sometimes attributed to William Shakespeare. He also appears as a boy in Edward II by Christopher Marlowe. Edward is also the protagonist of William Blake's early drama Edward the Third, part of his Poetical Sketches, published in 1783.  George Bernard Shaw portrayed Edward for dramatic purposes as, in Shaw's preface to The Six of Calais, behaving himself like an unrestrained human being in a very trying situation. He also appears in Gaetano Donizetti's  opera L'assedio di Calais. Edward III appeared in George Alfred Lawrence's \"sensation novel\" about the Hundred Years' War, Brakespeare (1868). Chester W. Topp,  Victorian Yellowbacks & Paperbacks, 1849-1905. Denver, Colo. : Hermitage Antiquarian Bookshop, 1993.   Volume 6, (p. 331) The novella \"The Countess Alys\"  (in The New Canterbury Tales (1901)) by Maurice Hewlett features Edward III as a character. Nield, Jonathan (1925), A Guide to the Best Historical Novels and Tales, G. P. Putnam's sons, , 1925 (pp. 32-33) Edward was also depicted in historical novels for younger readers, including  St. George For England (1885) by G. A. Henty.  Edward is also featured in his role as English commander during the Battle of Crécy, in the novel Red Eve (1911) by Rider Haggard. Myron J. Smith, War story guide: an annotated bibliography of military fiction. Scarecrow Press, 1980.  (p. 25). "]}, {"page": "MH Hewlett", "response": ["#REDIRECT Maurice Hewlett"]}, {"page": "Margaret Morris (dancer)", "response": ["In 1912 she created the part of Guinevere Megan in The Pigeon by John Galsworthy at the Royal Theatre, acting with Gladys Cooper and Dennis Eadie. That same year she had a season at The Royal Court Theatre, London where she performed such ballets as Callisto by Maurice Hewlett and The Little Dream by John Galsworthy. She started the first small theatre in London - Kings Road, Chelsea - giving Christmas Seasons for Children performed by children, including Angela and Hermione Baddeley and Phyllis Calvert. She won acclaim from the press as the first woman 'actor, manager' and the youngest, as she was only 21. In 1913 she took a troupe to Paris to dance at the Théâtre Marigny on the Champs Elysees. In 1915, she produced at her theatre an interpretation of Beethoven's 7th Symphony, costumes designed by J D Fergusson and subsequently performed with full orchestra at Bournemouth Winter Gardens and at Harrogate."]}, {"page": "Pan in popular culture", "response": ["*Pan and the Young Shepherd (1898) by Maurice Hewlett"]}, {"page": "Allahakbarries", "response": ["Allahakbarries was an amateur cricket team founded by author J. M. Barrie, and was active from 1890 to 1913. The team's name was a portmanteau of Barrie's name and the mistaken belief that 'Allah akbar' meant 'Heaven help us' in Arabic (rather than its true meaning: 'God is great').Chaney, Lisa, Hide-and-Seek with Angels - A Life of J. M. Barrie (London: Arrow Books, 2005) Notable figures to have featured for the side included Rudyard Kipling, H. G. Wells, Arthur Conan Doyle, P. G. Wodehouse,Wodehouse: A Life G. K. Chesterton, Jerome K. Jerome, A. A. Milne, E. W. Hornung, Henry Justice Ford, A. E. W. Mason, Walter Raleigh, E. V. Lucas, Maurice Hewlett, Owen Seaman, Bernard Partridge, Augustine Birrell, Paul Du Chaillu, Henry Herbert La Thangue, George Cecil Ives, and George Llewelyn Davies, as well as the son of Alfred Tennyson."]}, {"page": "Cultural depictions of Mary, Queen of Scots", "response": ["* The Queen's Quair (1904) is a novel about Mary by Maurice Hewlett. Joseph Wiesenfarth, History and Representation in Ford Madox Ford's Writings Amsterdam Rodopi, 2004  (p.112)."]}, {"page": "Metropolitan Magazine (New York City)", "response": ["*Maurice Hewlett"]}, {"page": "A Christmas Garland", "response": ["Beerbohm had a gift for parody, and A Christmas Garland is perhaps the best collection of parodies ever written in English. In his book Beerbohm parodied the style of popular writers of his day. These were Henry James, George Bernard Shaw, Thomas Hardy, Joseph Conrad, Rudyard Kipling, H. G. Wells, George Meredith, John Galsworthy, G. K. Chesterton, George Moore, Edmund Gosse, Maurice Hewlett, Hilaire Belloc, G. S. Street, Arnold Bennett, Frank Harris, and A. C. Benson. Beerbohm's parodies of their work are intermixed with a Christmas theme and the inventiveness of his own comic talents.Review of A Christmas Garland published by Yale University Press"]}, {"page": "W. Franke Harling", "response": ["In 1918, Harling contributed incidental music to the Broadway production of the 1898 play Pan and the Young Shepherd by Maurice Hewlett. In 1926, he collaborated with Laurence Stallings on Deep River, a voodoo-themed opera set in New Orleans in 1835. It opened on Broadway at the Imperial Theatre on October 4 and ran for 32 performances. "]}, {"page": "A Survey", "response": ["The caricatures included Joseph Conrad, the book included caricatures of David Lloyd George, Lytton Strachey, Philip Guedalla,  Woodrow Wilson, Edward Gordon Craig, Edward Carson, Maurice Hewlett, Philip Sassoon, Claude Phillips, Edmund Gosse, Paderewski, Gabriele d'Annunzio, James McNeill Whistler, Stephen Gwynn, Alfonso XIII of Spain, Sir Oliver Lodge, Sir E. Ray Lankester, Lord Charles Spencer, Ralph Nevill, George Bernard Shaw, Georg Brandes, Henry James, George Robey, H. H. Asquith, Leon Trotsky, Bonar Law among other eminent men of the day and a variety of contemporary politicians.Beerbohm, Max A Survey William Heinemann, London (1921)", "Image:a-survey-hewlett.jpg|Maurice Hewlett"]}, {"page": "Teffont Evias", "response": ["Teffont Evias is a small village and former civil parish in the Nadder valley in the south of Wiltshire, England. Edric Holmes described the village as \"most delightfully situated\",Wanderings in Wessex. An Exploration of the Southern Realm from Itchen to Otter p249. London: Robert Scott. 1922, no ISBN. Accessed 1 May 2020 via Project Gutenberg and Maurice Hewlett included Teffont in his list of the half dozen most beautiful villages in England. The present buildings are mostly of local stone, and several are thatched."]}]}}