{"wiki_id": "http://www.wikidata.org/entity/Q3308003", "itemLabel": "Michael Attenborough", "itemDescription": "English theatre director", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Attenborough", "wikipedia_page": {"main": "Michael John Attenborough  (born 13 February 1950) is an English theatre director.\n\n", "link_mentions": [{"page": "Jane Seymour (actress)", "response": ["Seymour has been married and divorced four times. Her first marriage, to Michael Attenborough, the son of film actor and director Richard Attenborough, was from 1971 to 1973. She was then briefly married to Attenborough's friend Geoffrey Planer from 1977 to 1978."]}, {"page": "'night, Mother", "response": ["The first London production opened in 1985 at the Hampstead Theatre, directed by Michael Attenborough.London Theatre archive  accessed 11/23/2016 Pitoniak and Bates again starred in a 1986 production at the Mark Taper Forum in Los Angeles.Los Angeles Times review accessed 11/23/2016"]}, {"page": "List of people educated at Westminster School", "response": ["*Michael Attenborough (born 1950), theatre director"]}, {"page": "Thomas Newman", "response": ["He composed the incidental music for the Washington Shakespeare Theatre Company's 2014 production of As You Like It, directed by Michael Attenborough and starring Zoe Waites."]}, {"page": "Kim Thomson", "response": ["| Michael Attenborough"]}, {"page": "This England: The Histories", "response": ["*Michael Attenborough directed the Henry IV plays in medieval dress in a simple set in the Swan Theatre"]}, {"page": "Almeida Theatre", "response": ["The restoration included rebuilding and extending the foyer, installing more comfortable seating and access, plus better backstage facilities with the stage area re-built for flexibility and strength, the roof improved and insulated, the lighting grid strengthened, complete re-wiring, and technical equipment updated. Michael Attenborough took over as artistic director in 2002 and, following the completion of its restoration, the theatre was re-opened in May 2003 with a production of Ibsen's The Lady from the Sea, directed by Trevor Nunn. The theatre's artistic remit was the presentation of bold and adventurous play choices staged to the highest possible standards, in productions which revealed them in a new light. This included classics from the British, American and Irish repertoire, foreign classics in newly commissioned versions, and new plays. In October 2012 Attenborough announced that he would step down early in 2013.", "Rupert Goold was appointed Artistic Director in February 2013, taking up the post full-time in September 2013. His association with the Almeida Theatre Company began in 2008 when he directed Stephen Adly Guirgis' The Last Days of Judas Iscariot. In 2013 his Headlong theatre company co-produced the premiere of Lucy Kirkwood's Chimerica, directed by Lyndsey Turner, at the Almeida: the show subsequently transferred to the West End, winning five Olivier Awards in 2014. Goold's first Almeida production as full-time artistic director was the world premiere production of American Psycho: A new musical thriller (initially programmed by Michael Attenborough), which ran from 3 December 2013 to 1 February 2014. In 2014 he directed the premiere of Mike Bartlett's play King Charles III, which, following its sold-out run at the Almeida, transferred to Wyndham's Theatre and Broadway.", "Almeida Projects is the Almeida Theatre's education and community programme. It was founded in its current form in 2003 by Rebecca Manson Jones, after Michael Attenborough's appointment as artistic director. Almeida Projects activity includes durational residencies with partner schools, a subsidised ticket scheme for school groups visiting the theatre, productions of new plays for young people inspired by the main programme, the Young Friends of the Almeida scheme, social networking Teachers' Evenings for local performing arts teachers and a training programme for workshop leaders.", "* Michael Attenborough, (2002–2013)", "* When the Rain Stops Falling by Andrew Bovell, directed by Michael Attenborough (2009)", "* Through a Glass Darkly by Ingmar Bergman, adapted by Jenny Worton, directed by Michael Attenborough (2010)", "* The Knot of the Heart by David Eldridge, directed by Michael Attenborough, starring Sophie Stanton (2011)", "* Filumena by Eduardo De Filippo, adapted by Tanya Ronder, directed by Michael Attenborough (2012)", "* King Lear by William Shakespeare, directed by Michael Attenborough, starring Jonathan Pryce (2012)"]}, {"page": "Danny Dyer", "response": ["Dyer has performed on stage, most notably in two plays written and directed by 2005 Nobel Laureate Harold Pinter: as the Waiter in the London première of Celebration (2000), at the Almeida Theatre, which transferred to Lincoln Center for the Performing Arts, in New York, as part of the Harold Pinter Festival held there in July and August 2001; and as Foster in the revival of No Man's Land (1975), at the Royal National Theatre, in London, during 2001 and 2002. In March 2008, he played Joey in a revival of Pinter's The Homecoming (1964), directed by Michael Attenborough, at the Almeida Theatre, in London. [Corrected title] He also performed in Peter Gill's play Certain Young Men (1999) in London. From 9 September 2009 to 3 October 2009, Dyer appeared as Sid Vicious in a new play called Kurt and Sid in London's West End at the Trafalgar Studios."]}, {"page": "Ray Fearon", "response": ["He has worked extensively with the Royal Shakespeare Company in their Stratford and London theatres and on tour. He was the first black actor to play the title role in Othello in the main Royal Shakespeare theatre (director Michael Attenborough, 1999) giving a powerful and sexy performance alongside Richard McCabe's strong and repressed Iago.\"First black Othello at RSC since Robeson\" The Independent (Retrieved: 3 March 2010) They also played opposite one another in 1996's The White Devil (Deborah Warner, Swan theatre) where he played Brachiano and McCabe the villain Flamineo. Fearon was directed by Attenborough also as Romeo in Romeo and Juliet (RSC, Swan Theatre, 1997) alongside Zoe Waites as Juliet."]}, {"page": "Shirley Henderson", "response": ["| March 1989 || My Mother Said I Never Should || Rosie ||  Royal Court Theatre, London ||  author: Charlotte Keatley, director: Michael Attenborough ||", "| 22 November−18 December 1999 || Anna Weiss || Lynn ||  Whitehall Theatre, London || author: Mike Cullen, director Michael Attenborough ||"]}, {"page": "Ciarán Hinds", "response": ["| Michael Attenborough"]}, {"page": "National Student Drama Festival", "response": ["* Michael Attenborough"]}, {"page": "Nicholas Woodeson", "response": ["Woodeson was born in Sudan and lived in the Middle East as a boy. He started performing at prep school in Sussex, and Marlborough College. He read English at the University of Sussex, and became involved in student drama productions, where he met Michael Attenborough, Jim Carter, and Andy de la Tour. He took part in the 1970 National Student Drama Festival.  Next was a season in rep at the Lyceum Theatre, Crewe, after deciding not to pursue an academic career. He won a scholarship to the Royal Academy of Dramatic Art (1972–74)."]}, {"page": "Warwick School", "response": ["The former main hall of the school, the Guy Nelson Hall, was built, following an appeal, between 1969 and 1970, and was named after  Alderman Guy Nelson, a long-serving Chairman of Governors, in office from 1938 to 1963. It had seating for about 600 people, but by 2010 this was much less than the total size of the school, with the result that a new building was planned. The hall was demolished in 2015 and was replaced by a much larger one, Warwick Hall, opened in September 2016 by Sir Michael Attenborough."]}, {"page": "Queensland Theatre", "response": ["Productions have included: many Shakespeare's plays presented in the Roma Street Parkland Amphitheatre (formerly called the Albert Park Amphitheatre), as well in the Lyric Theatre, Cremorne Theatre and the Playhouse at the Queensland Performing Arts Centre.Eckersley, M. 1997. Soundings in the Dramaturgy of the Australian Theatre Director. University of Melbourne. Melbourne. p. 33. Other productions have included: Black Diggers, Macbeth (directed by Michael Attenborough), Twelfth Night, The Importance of Being Earnest by Oscar Wilde, The Alchemist by Ben Jonson, That Face by Polly Stenham, God of Carnage by Yasmina Reza, 25 Down by Richard Jordan, The School of Arts by Bille Brown, Ninety by Joanna Murray-Smith,"]}, {"page": "The Herbal Bed", "response": ["In the original 1996 production at The Other Place theatre, the leading role of John Hall was played by Liam Cunningham. Susanna was played by Teresa Banham. The accuser Jack Lane was played by David Tennant and Smith by Joseph Fiennes.Whelan Peter, The Herbal Bed, Warner/Chapel Plays, 1996, front matter. The production was directed by Michael Attenborough.", "During 1997 the play had a successful run at the Duchess Theatre in London's West End.  John Hall was played by Lorcan Cranitch. In 1998, a NYC production played at the Eugene O'Neill Theater with an all-American cast, including Armand Schultz (Rafe), Tuck Milligan (John), and Laila Robins (Susanna). The NYC production was also directed by Michael Attenborough."]}, {"page": "Awake and Sing!", "response": ["Following its American success in revivals, the play was staged in London at the Off West End Almeida Theatre, from August 31, 2007, through October 20, 2007. Directed by Michael Attenborough, the cast featured Stockard Channing as Bessie.Almeida Theatre's 2007 London production  Almeida.co.uk"]}, {"page": "Michael Culver", "response": ["*Roald Amundsen in Terra Nova by Ted Tally; Watford Palace Theatre, 1982. Directed by Michael Attenborough"]}, {"page": "Shakespeare Theatre Company", "response": [":*Michael Attenborough – director (As You Like It)"]}, {"page": "Jim Carter (actor)", "response": ["He appeared in Doug Lucie's Fashion in May–June 1990 at the Tricycle Theatre, directed by Michael Attenborough.\"Rob Wilton Theatricalia: Other Plays, 1990–1999\" in phyllis.demon.co.uk/ Retrieved 6 November 2011\"Victoria and Albert Museum: Theatre Collections, Tricycle Theatre Archive, 1972–2004\" in vam.ac.uk Retrieved 8 November 2011"]}, {"page": "Frederick Attenborough", "response": ["* John Michael Attenborough (1928–2012), Executive at Alfa Romeo"]}]}}