{"wiki_id": "http://www.wikidata.org/entity/Q3305906", "itemLabel": "Samuel Bailey", "itemDescription": "British philosopher", "wikipedia_url": "https://en.wikipedia.org/wiki/Samuel_Bailey", "wikipedia_page": {"main": "Samuel Bailey (5 July 1791 – 18 January 1870) was a British philosopher, economist and writer. He was called the \"Bentham of Hallamshire\".", "link_mentions": [{"page": "Thomas Robert Malthus", "response": ["In 1827, he published Definitions in Political Economy The first chapter put forth \"Rules for the Definition and Application of Terms in Political Economy\". In chapter 10, the penultimate chapter, he presented 60 numbered paragraphs putting forth terms and their definitions that he proposed should be used in discussing political economy following those rules. This collection of terms and definitions is remarkable for two reasons: first, Malthus was the first economist to explicitly organize, define, and publish his terms as a coherent glossary of defined terms; and second, his definitions were for the most part well-formed definitional statements. Between these chapters, he criticized several contemporary economists—Jean-Baptiste Say, David Ricardo, James Mill, John Ramsay McCulloch, and Samuel Bailey—for sloppiness in choosing, attaching meaning to, and using their technical terms."]}, {"page": "1791 in literature", "response": ["*July 5 – Samuel Bailey, English philosopher and author (died 1870)"]}, {"page": "List of ethicists", "response": ["* Samuel Bailey"]}, {"page": "Index of philosophy articles (R–Z)", "response": ["* Samuel Bailey"]}, {"page": "List of people from Sheffield", "response": ["*Samuel Bailey, philosopher and author"]}, {"page": "List of philosophers born in the 18th century", "response": ["* Samuel Bailey, (1791–1870)"]}, {"page": "Bailey (surname)", "response": ["* Sam, Samantha and Samuel Bailey (disambiguation), multiple people", "**** Samuel Bailey (1791–1870), British philosopher and writer"]}, {"page": "List of names in A Biographical Dictionary of Modern Rationalists", "response": ["* Samuel Bailey"]}, {"page": "Value-form", "response": ["===Aristotle and Samuel Bailey===", "In particular, Marx's ideas about the forms of value were influenced by Samuel Bailey's criticism of Ricardo's theory of value.Derek Sayer, Marx's method. Hassocks, Sussex: The Harvester Press, 1979, pp. 37-41; Ulrich Krause, Money & abstract labour; on the analytical foundations of political economy. London: NLB, 1982, p. 161-162 note 1; Helmut Brentel, Soziale Form und ökonomisches Objekt. Studien zum Gegenstands- und Methodenverständnis der Kritik der politischen Ökonomie. Wiesbaden: Springer Fachmedien, 1989, chapter 3; Patrick Murray, \"The Grammar of Value: A Close Look at Marx's Critique of Samuel Bailey\", in: Patrick Murray, The mismeasure of wealth: Essays on Marx and Social Form. Leiden: Brill Publishers, 2016, pp. 189-219; Samuel Bailey, A critical dissertation on the nature, measures, and causes of value; chiefly in reference to Mr Ricardo and his followers. London: R. Hunter, 1825; Samuel Bailey, Money and Its Vicissitudes in Value; as They Affect National Industry and Pecuniary Contracts : with a Postscript on Joint Stock Banks. London, 1837; See Karl Marx, Theories of Surplus Value. Moscow: Progress Publishers, 1978, Part III, pp.139-168, or Marx Engels Collected Works, Vol. 32 (New York: International Publishers, 1989), pp. 313-353. Robert M. Rauner, Samuel Bailey and the Classical Theory of Value. London: LSE, 1961. In Capital, Volume I, Marx stated that Bailey was one of the few political economists who had concerned themselves with the analysis of the form of value.Patrick Murray, \"Avoiding Bad Abstractions A Defense of Co-constitutive Value-Form Theory.\" In: Critique of political economy, Vol. 1 No. 1, September 2011, pp. 217-248, at p. 219. Yet, Marx said, none of the political economists had understood its meaning, because they confused \"the form of value\" with \"value itself\", and because they only paid attention to the quantitative side of the phenomenon, not to the qualitative side.Karl Marx, Capital, Volume I, Penguin 1976, p. 141 note 17. In Capital, Volume II, Marx criticizes Bailey again for \"his general misunderstanding, according to which exchange-value equals value, the form of value is value itself\", leading to the mistaken belief that \"commodity values cease to be comparable once they no longer actively function as exchange-values, and cannot actually be exchanged for one another\".Karl Marx, Capital, Volume II, Penguin 1978, p. 186."]}, {"page": "Logodaedaly", "response": ["Samuel Bailey used the term with greater precision, distinguishing between logodaedaly and logomachy:"]}, {"page": "Joseph Lowe (economist)", "response": ["The first to use weighted index numbers, Lowe in effect anticipated the Laspeyres index. The book reviewed previous work by William Fleetwood, George Shuckburgh and Arthur Young. A German translation appeared in 1823.England nach seinem gegenwärtigen Zustande des Ackerbaues, des Handels und der Finanzen betrachtet, translated by L. H. von Jakob, Leipzig 1823. Lowe innovated in his use of constant price estimates, and the consideration of different demographic groups and their consumption, which anticipated the modern concept of consumer price index. Samuel Bailey argued against the concept of tabular standards, pointing to the difficulties arising from the need for like-to-like comparisons."]}, {"page": "Sam Bailey (disambiguation)", "response": ["* Samuel Bailey (1791–1870), British philosopher"]}]}}