{"wiki_id": "http://www.wikidata.org/entity/Q3303286", "itemLabel": "Dudley Maurice Newitt", "itemDescription": "British chemical engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Dudley_Maurice_Newitt", "wikipedia_page": {"main": "Dudley Maurice Newitt FRS (28 April 1894 – 14 March 1980) was a British chemical engineer who was awarded the Rumford Medal in 1962 in recognition of his 'distinguished contributions to chemical engineering'.Newitt was born in London and started working as an assistant chemist for Nobel in Scotland.  In the First World War, he served in the East Surrey Regiment and was awarded the Military Cross.He married Aliex Schaeffer in 1919, but she died in childbirth in 1923, and the baby was stillborn.  In 1933, he married Doris Garrod, and they had a son and a daughter.In 1921, he gained a first class Bachelor of Science in chemistry from the Royal College of Science in London, and went on to postgraduate studies in chemical engineering at Imperial College, London. During the Second World War, he was scientific director  of Special Operations Executive responsible for the development of technology for sabotage and espionage.  During this period he was elected a Fellow of the Royal Society.In 1945, he was appointed as professor of chemical engineering at Imperial College. By 1952, he was made the Head of Department, being responsible for the new building (completed 1967).  He was appointed pro-rector of the college in 1956 until his retirement in 1961.  He died 14 March 1980 in Farnham, Surrey.", "link_mentions": [{"page": "Special Operations Executive", "response": ["Four departments and some smaller groups were controlled by the director of scientific research, Professor Dudley Maurice Newitt, and were concerned with the development or acquisition and production of special equipment. A few other sections were involved with finance, security, economic research and administration, although SOE had no central registry or filing system. When Gubbins was appointed director, he formalised some of the administrative practices which had grown in an ad hoc fashion and appointed an establishment officer to oversee the manpower and other requirements of the various departments.", "* Dudley Maurice Newitt. Director of Scientific Research. SOE."]}, {"page": "Imperial College London", "response": ["In engineering; Chi Onwurah, politician; Dame Julia Higgins, polymer scientist; Dame Judith Hackitt, former Chair of the Health and Safety Executive; Dudley Maurice Newitt, scientific director of the Special Operations Executive; and Julia King, Baroness Brown of Cambridge, engineer and Member of the House of Lords."]}, {"page": "List of chemical engineers", "response": ["|Dudley Maurice Newitt (1894–1980)||Scientific director of Special Operations Executive developing gadgets for spies during World War II – a real life Q (James Bond). Received Rumford Medal, in 1962 for \"... his distinguished contributions to chemical engineering.\" ||Professor at Imperial College"]}, {"page": "List of fellows of the Royal Society M, N, O", "response": ["| Dudley Maurice Newitt||19/03/1942||28 April 1894 – 14 March 1980"]}, {"page": "Roger Sargent (chemical engineer)", "response": ["Autobiographical summary of his engineering experiences during World War II (with Dudley Maurice Newitt, the real-life prototype for \"M\" in the Bond movies) and post-war in France: http://www.klebos.net/subdomains/home/roger.sargent/papers2016/2011-my-contribution-to-broadening-the-base-of-chemical-engineering.pdf"]}, {"page": "List of fellows of the Royal Society elected in 1942", "response": ["*Dudley Maurice Newitt"]}, {"page": "List of fellows of Imperial College London", "response": ["* Dudley Maurice Newitt"]}]}}