{"wiki_id": "http://www.wikidata.org/entity/Q330059", "itemLabel": "Tyrone Guthrie", "itemDescription": "English actor and director (1900-1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tyrone_Guthrie", "wikipedia_page": {"main": "Sir William Tyrone Guthrie (2 July 1900 – 15 May 1971) was an English theatrical director instrumental in the founding of the Stratford Festival of Canada, the Guthrie Theater in Minneapolis, Minnesota, and the Tyrone Guthrie Centre at his family's ancestral home, Annaghmakerrig, near Newbliss in County Monaghan, Ireland.\n\n", "link_mentions": [{"page": "Christopher Marlowe", "response": ["::directed by Tyrone Guthrie, with Donald Wolfit as Tamburlaine, Old Vic, London, 1951."]}, {"page": "Candide", "response": ["The operetta Candide was originally conceived by playwright Lillian Hellman, as a play with incidental music. Leonard Bernstein, the American composer and conductor who wrote the music, was so excited about the project that he convinced Hellman to do it as a \"comic operetta\".Peyser (1987), p. 247 Many lyricists worked on the show, including James Agee, Dorothy Parker, John Latouche, Richard Wilbur, Leonard and Felicia Bernstein, and Hellman. Hershy Kay orchestrated all the pieces except for the overture, which Bernstein did himself.  Candide first opened on Broadway as a musical on 1 December 1956. The premier production was directed by Tyrone Guthrie and conducted by Samuel Krachmalnick.Peyser (1987), p. 248 While this production was a box office flop, the music was highly praised, and an original cast album was made. The album gradually became a cult hit, but Hellman's libretto was criticised as being too serious an adaptation of Voltaire's novel.Peyser (1987), pp. 249–251 Candide has been revised and reworked several times. The first New York revival, directed by Hal Prince, featured an entirely new libretto by Hugh Wheeler and additional lyrics by Stephen Sondheim. Bernstein revised the work again in 1987 with the collaboration of John Mauceri and John Wells. After Bernstein's death, further revised productions of the musical were performed in versions prepared by Trevor Nunn and John Caird in 1999, and Mary Zimmerman in 2010."]}, {"page": "Hamlet", "response": ["Beginning in 1910, with the publication of \"The Œdipus-Complex as an Explanation of Hamlet's Mystery: A Study in Motive\" Ernest Jones—a psychoanalyst and Freud's biographer—developed Freud's ideas into a series of essays that culminated in his book Hamlet and Oedipus (1949). Influenced by Jones's psychoanalytic approach, several productions have portrayed the \"closet scene\", where Hamlet confronts his mother in her private quarters, in a sexual light. In this reading, Hamlet is disgusted by his mother's \"incestuous\" relationship with Claudius while simultaneously fearful of killing him, as this would clear Hamlet's path to his mother's bed. Ophelia's madness after her father's death may also be read through the Freudian lens: as a reaction to the death of her hoped-for lover, her father. Ophelia is overwhelmed by having her unfulfilled love for him so abruptly terminated and drifts into the oblivion of insanity. In 1937, Tyrone Guthrie directed Laurence Olivier in a Jones-inspired Hamlet at The Old Vic. Olivier later used some of these same ideas in his 1948 film version of the play.", "Notable stagings in London and New York include Barrymore's 1925 production at the Haymarket; it influenced subsequent performances by John Gielgud and Laurence Olivier. Gielgud played the central role many times: his 1936 New York production ran for 132 performances, leading to the accolade that he was \"the finest interpreter of the role since Barrymore\". Although \"posterity has treated Maurice Evans less kindly\", throughout the 1930s and 1940s he was regarded by many as the leading interpreter of Shakespeare in the United States and in the 1938/39 season he presented Broadway's first uncut Hamlet, running four and a half hours. Evans later performed a highly truncated version of the play that he played for South Pacific war zones during World War II which made the prince a more decisive character. The staging, known as the \"G.I. Hamlet\", was produced on Broadway for 131 performances in 1945/46. Olivier's 1937 performance at The Old Vic was popular with audiences but not with critics, with James Agate writing in a famous review in The Sunday Times, \"Mr. Olivier does not speak poetry badly. He does not speak it at all.\" In 1937 Tyrone Guthrie directed the play at Elsinore, Denmark, with Laurence Olivier as Hamlet and Vivien Leigh as Ophelia."]}, {"page": "July 2", "response": ["*1900 – Tyrone Guthrie, English actor and director (d. 1971)"]}, {"page": "May 15", "response": ["*1971 – Tyrone Guthrie, English director, producer, and playwright (b. 1900)"]}, {"page": "Robertson Davies", "response": ["During the 1950s, Davies played a major role in launching the Stratford Shakespearean Festival of Canada. He served on the Festival's board of governors, and collaborated with the Festival's director, Sir Tyrone Guthrie, in publishing three books about the Festival's early years.", "*Renown at Stratford (1953) (with Tyrone Guthrie)", "*Twice Have the Trumpets Sounded (1954) (with Tyrone Guthrie)", "*Thrice the Brindled Cat Hath Mew'd (1955) (with Tyrone Guthrie)"]}, {"page": "Going My Way", "response": ["Risë Stevens, whose character is seen onscreen performing the lead role in a Metropolitan Opera (the Met) production of Carmen, was an actual performer with the Met when the film was made. A few years later she would earn enormous personal triumph as the Met's Carmen in the famous Tyrone Guthrie production of 1951, becoming the leading Carmen of her generation."]}, {"page": "Lady Audley's Secret", "response": ["* 1930 – Cambridge Festival Theatre: a \"melodramatized version\" of the novel including a \"birthday fete\" and Rustic Ballet. The part of Lady Audley was played by (Dame) Flora Robson and the performance was produced by Tyrone Guthrie. It was preceded by a performance of Morton's Cox and Box.Festival Theatre programmes of 25 January and 3 February 1930"]}, {"page": "Laurence Olivier", "response": ["After Hamlet, the company presented Twelfth Night in what the director, Tyrone Guthrie, summed up as \"a baddish, immature production of mine, with Olivier outrageously amusing as Sir Toby and a very young Alec Guinness outrageous and more amusing as Sir Andrew\". Henry V was the next play, presented in May to mark the Coronation of George VI. A pacifist, as he then was, Olivier was as reluctant to play the warrior king as Guthrie was to direct the piece, but the production was a success, and Baylis had to extend the run from four to eight weeks.", "Throughout the war Tyrone Guthrie had striven to keep the Old Vic company going, even after German bombing in 1942 left the theatre a near-ruin. A small troupe toured the provinces, with Sybil Thorndike at its head. By 1944, with the tide of the war turning, Guthrie felt it time to re-establish the company in a London base and invited Richardson to head it. Richardson made it a condition of accepting that he should share the acting and management in a triumvirate. Initially he proposed Gielgud and Olivier as his colleagues, but the former declined, saying, \"It would be a disaster, you would have to spend your whole time as referee between Larry and me.\" It was finally agreed that the third member would be the stage director John Burrell. The Old Vic governors approached the Royal Navy to secure the release of Richardson and Olivier; the Sea Lords consented, with, as Olivier put it, \"a speediness and lack of reluctance which was positively hurtful.\""]}, {"page": "Richard Burton", "response": ["Notwithstanding, Burton began his thirty-nine-week tenure at The Old Vic by rehearsing for Hamlet in July 1953, with Philip providing expert coaching on how to make Hamlet's character match Burton's dynamic acting style. Burton reunited with Bloom, who played Ophelia. Hamlet opened at the Assembly Hall in Edinburgh, Scotland in September 1953 as part of The Old Vic season during the Edinburgh Festival Fringe. The play and Burton's Hamlet were, on the whole, well received, with critics describing his interpretation of the character as \"moody, virile and baleful\" and that he had \"dash, attack and verve\". Burton's Hamlet was quite popular with the young audience, who came to watch the play in numbers as they were quite taken with the aggressiveness with which he portrayed the role. Burton also received appreciation from Winston Churchill. Gielgud was not too happy with Burton's Hamlet and asked him while both were backstage: \"Shall I go ahead and wait until you're better?... ah, I mean ready?\" Burton picked up the hint and infused some of Gielgud's traits to his own in later performances as Hamlet. A greater success followed in the form of the Roman General Gaius Marcius Coriolanus in Coriolanus. At first, Burton refused to play Coriolanus as he didn't like the character's initial disdain for the poor and the downtrodden. Michael Benthall, who was renowned for his association with Tyrone Guthrie in a 1944 production of Hamlet, sought Philip's help to entice Burton into accepting it. Philip convinced Burton by making him realise that it was Coriolanus' \"lack of ambivalence\" which made him an admirable character. Burton received even better reviews for Coriolanus than Hamlet. Hardy thought Burton's Hamlet was \"too strong\" but that \"His Coriolanus is quite easily the best I've ever seen.\" Olivier too agreed it was the greatest Coriolanus he had ever seen till then."]}, {"page": "H.M.S. Pinafore", "response": ["The D'Oyly Carte Opera Company did not allow any other professional company to present the Savoy operas in Britain until the copyrights expired at the end of 1961, although it licensed many amateur and school societies to do so, beginning in the 19th century.l \"The 1968 D'Oyly Carte Opera Company Production of The Gondoliers\", reprinted from theatre programme of 29 January 1968, The Gilbert and Sullivan Archive, Retrieved on 11 March 2009 After 1961, other professional companies mounted productions of the opera in Britain. These have included Tyrone Guthrie's 1960 production from Stratford, Ontario, seen on Broadway in 1960 and in London in 1962It played in London together with Pirates at Her Majesty's Theatre; Mander, p. 154 and \"H.M.S. Pinafore and The Pirates of Penzance\", Theatre World (UK magazine), March 1962, pp. 15–20 and a New Sadler's Wells Opera Company production first seen on 4 June 1984 at Sadler's Wells Theatre,Photos, cast and crew information for the New Sadler's Wells Opera production in 1987, collected at The Gilbert and Sullivan Archive, accessed 10 March 2009 which was seen also in New York.Traubner, Richard. \"A Pinafore Sails In on a Fresh Breeze\", The New York Times, 15 January 1989, accessed 10 March 2009 Scottish Opera, Welsh National Opera and many of the other British opera companies have mounted productions, as did the reconstituted D'Oyly Carte Opera Company between 1990 and its closure in 2003.Bradley (2005), chapters 3 and 4, passim In recent years, the Carl Rosa Opera Company has produced Pinafore several times, including in 2009,\"Dido; Aeneas/ Acis; Galatea\", The Times, 28 March 2009 and Opera della Luna and other British companies continue to mount the piece.\"Fun on the high seas\", The Press and Journal, 22 April 2010"]}, {"page": "Thornton Wilder", "response": ["In 1954, Tyrone Guthrie encouraged Wilder to rework The Merchant of Yonkers into The Matchmaker. This time the play opened in 1955 and enjoyed a healthy Broadway run of 486 performances with Ruth Gordon in the title role, winning a Tony Award for Guthrie, its director. It became the basis for the hit 1964 musical Hello, Dolly!, with a book by Michael Stewart and score by Jerry Herman."]}, {"page": "Arms and the Man", "response": ["* The most prestigious London revival was directed by John Burrell for The Old Vic Company at the New Theatre, which opened on 5 September 1944, starring Ralph Richardson (Bluntschli), Margaret Leighton (Raina Petkoff), Joyce Redman (Louka), and Laurence Olivier (Major Sergius Saranoff). \"Olivier thought Sergius a humbug, a buffoon, a blackguard, a coward, 'a bloody awful part' until Tyrone Guthrie said he would never succeed in the role until he learned to love Sergius. Olivier, spurred and moustachioed, was high camp\": Robert Tanitch.London Stage in the 20th Century, by Robert Tanitch, Haus (2007) "]}, {"page": "Radio drama", "response": ["The question of who was the first to write stream-of-consciousness drama for radio is a difficult one to answer. By 1930, Tyrone Guthrie had written plays for the BBC like Matrimonial News (which consists entirely of the thoughts of a shopgirl awaiting a blind date) and The Flowers Are Not for You to Pick (which takes place inside the mind of a drowning man). After they were published in 1931, Guthrie's plays aired on the American networks. Around the same time, Guthrie himself also worked for the Canadian National Railway radio network, producing plays written by Merrill Denison that used similar techniques. A 1940 article in Variety credited a 1932 NBC play, Drink Deep by Don Johnson, as the first stream-of-consciousness play written for American radio. The climax of Lawrence Holcomb's 1931 NBC play Skyscraper also uses a variation of the technique (so that the listener can hear the final thoughts and relived memories of a man falling to his death from the title building)."]}, {"page": "Flora Robson", "response": ["She struggled to find a footing in the theatre after she graduated from RADA with a bronze medal since she lacked the conventional good looks which were then an absolute requisite for actresses in dramatic roles. After touring in minor parts with Ben Greet's Shakespeare company she may have played small parts for two seasons in the new repertory company at Oxford, but her contract was not renewed. She was told that they required a prettier actress. Unable to secure any acting engagements, she gave up the stage at the age of 23, and she took up work as a welfare officer in the Shredded Wheat factory in Welwyn Garden City.  Tyrone Guthrie, due to direct a season at the new Festival Theatre, Cambridge, asked her to join his company. Her performance as the stepdaughter in Pirandello's Six Characters in Search of an Author made her the theatrical talk of Cambridge. She followed  with Isabella in Measure for Measure with Robert Donat, Pirandello's Naked, the title role in Iphigenia in Tauris, Varya in The Cherry Orchard, and Rebecca West in Henrik Ibsen's Rosmersholm."]}, {"page": "James Mason", "response": ["He joined the Old Vic theatre in London under the guidance of Tyrone Guthrie.Brian McFarlane \"Mason, James (1909–1984)\", BFI screenonline; McFarlane (ed) The Encyclopedia of British Film, London: Methuen/BFI, 2003, p.438 While there he appeared in productions of The Cherry Orchard, Henry VIII, Measure for Measure, The Importance of Being Earnest, Love for Love, The Tempest, Twelfth Night, and Macbeth. Featuring in many of these were Charles Laughton and Elsa Lanchester. In the mid-1930s he also appeared at the Gate Theatre, Dublin, notably in Pride and Prejudice with Betty Chancellor.Christopher Fitz-Simon, The Boys (London: Nick Hern Books, 1994) p. 73 et seq."]}, {"page": "Robert Donat", "response": ["In 1928, he began a year at the Liverpool Playhouse, starring in plays by John Galsworthy, George Bernard Shaw and Harold Brighouse, among others. In 1929, he played at the Festival Theatre in Cambridge under the direction of Tyrone Guthrie. He appeared in a number of plays, some with Flora Robson, and also directed."]}, {"page": "Oedipus Rex", "response": ["The first English-language adaption, Oedipus Rex (1957), was directed by Tyrone Guthrie and starred Douglas Campbell as Oedipus. In this version, the entire play is performed by the cast in masks (Greek: prosopon), as actors did in ancient Greek theatre."]}, {"page": "The Matchmaker", "response": ["Fifteen years later, director Tyrone Guthrie expressed interest in a new production of the play, which Wilder extensively rewrote and rechristened The Matchmaker. The most significant change was the expansion of a previously minor character named Dolly Gallagher Levi, who became the play's centerpiece. A widow who brokers marriages and other transactions in Yonkers, New York at the turn of the 20th century, she sets her sights on local merchant Horace Vandergelder, who has hired her to find him a wife. After a series of slapstick situations involving mistaken identities, secret rendezvous behind carefully placed screens, separated lovers, and a trip to night court, everyone finds themselves paired with a perfect match."]}, {"page": "Theatre director", "response": ["A cautionary note was introduced by the famed director Sir Tyrone Guthrie who said \"the only way to learn how to direct a play, is ... to get a group of actors simple enough to allow you to let you direct them, and direct\"."]}, {"page": "Michael Redgrave", "response": ["Offered a job by Tyrone Guthrie, Redgrave made his first professional debut in London at the Old Vic on 14 September 1936, playing Ferdinand in Love's Labours Lost. During 1936–37 he also played Mr Horner in The Country Wife, Orlando in As You Like It, Warbeck in The Witch of Edmonton and Laertes to Laurence Olivier's Hamlet. His hit of the season was Orlando. Edith Evans was his Rosalind and the two fell very much in love. As he later explained: \"Edith always had a habit of falling in love with her leading men; with us it just went rather further.\" As You Like It transferred to the New Theatre in February 1937 and Redgrave again played Orlando."]}, {"page": "Circus", "response": ["Plays set in a circus include the 1896 musical The Circus Girl by Lionel Monckton, Polly of the Circus written in 1907 by Margaret Mayo, He Who Gets Slapped written by Russian Leonid Andreyev 1915 and later adapted into one of the first circus films, Katharina Knie written in 1928 by Carl Zuckmayer and adapted for the English stage in 1932 as Caravan by playwright Cecily Hamilton, the revue Big Top written by Herbert Farjeon in 1942, Top of the Ladder written by Tyrone Guthrie in 1950, Stop the World, I Want to Get Off written by Anthony Newley in 1961, and Barnum with music by Cy Coleman and lyrics and book by Mark Bramble, Roustabout: The Great Circus Train Wreck written by Jay Torrence in 2006."]}, {"page": "Ralph Richardson", "response": ["After a short run in The Silent Knight, described by Miller as \"a Hungarian fantasy in rhymed verse set in the fifteenth century\", Richardson returned to the Old Vic for the 1937–38 season, playing Bottom once again and switching parts in Othello, playing the title role, with Olivier as Iago. The director, Tyrone Guthrie, wanted to experiment with the theory that Iago's villainy is driven by suppressed homosexual love for Othello. Olivier was willing to co-operate, but Richardson was not; audiences and most critics failed to spot the supposed motivation of Olivier's Iago, and Richardson's Othello seemed underpowered.Neill, p. 78 O'Connor believes that Richardson did not succeed with Othello or Macbeth because of the characters' single-minded \"blind driving passion – too extreme, too inhuman\", which was incomprehensible and alien to him. It was for the same reason, in O'Connor's view, that he never attempted the title roles in Hamlet or King Lear.O'Connor, p. 173"]}, {"page": "The Beggar's Opera", "response": ["* In 1948, Benjamin Britten created an adaptation with new harmonisations and arrangements of pre-existing tunes. Additional dialogue was written by the producer, Tyrone Guthrie. Peter Pears was the first singer of Macheath.1948 Benjamin Britten version of The Beggar's Opera  at the Guide to Musical Theatre It was dedicated to James Haldane Lawrie, who would go on to chair the English Opera Group."]}, {"page": "June Havoc", "response": ["In 1966, Havoc appeared as Millicent Jordan in an all-star revival of Dinner At Eight on Broadway, directed by Sir Tyrone Guthrie, and featuring Walter Pidgeon, Arlene Francis, Darren McGavin and Pamela Tiffin.  The New York Times critic Walter Kerr lauded Havoc’s performance as the hostess of the dinner, noting that she was becoming this country’s Vivien Leigh.  Kerr observed:  “She makes the prospect of spending the entire day on the telephone rounding up a guest list, sound like work for a contented dove. That is to say, she coos cheerily, even with a pencil in her mouth, as she sets about buttering up all the people who can’t say, “no,” and she caresses her very chic white French phone with the exquisite finesse of a Victorian gentlewoman doing needlework.”   Kerr, Walter (September 28 1966).  “Theatre:  ‘Dinner At Eight’ at Alvin:  Kaufman-Ferber Play Directed by Guthrie”, The New York Times; p. 38"]}, {"page": "1900 in literature", "response": ["*July 2 – Tyrone Guthrie, English theatrical director (died 1971)"]}, {"page": "English National Opera", "response": ["In November 1937, Baylis died of a heart attack. Her three companies continued under the direction of her appointed successors: Tyrone Guthrie at the Old Vic, in overall charge of both theatres, with de Valois running the ballet, and Carey and two colleagues running the opera.Gilbert, pp. 63–66 In the Second World War, the government requisitioned Sadler's Wells as a refuge for those made homeless by air-raids. Guthrie decided to keep the opera going as a small touring ensemble of 20 performers. Between 1942 and the war's end in 1945, the company toured continuously, visiting 87 venues. Joan Cross led and managed the company, and also sang leading soprano roles in its productions when needed. The size of the company was increased to 50, and then to 80.Gilbert, pp. 79 and 83 By 1945, its members included singers from a new generation such as Peter Pears and Owen Brannigan, and the conductor Reginald Goodall.Gilbert, pp. 86, 89 and 95"]}, {"page": "The School for Scandal", "response": ["*Blair Brown performed Lady Teazle in the 1975 video directed by Michael Langham and Nich Havinga (made from the production at the Tyrone Guthrie Theatre the previous year)."]}, {"page": "Queen's University Belfast", "response": ["The university's chancellors have included Anthony Ashley-Cooper, 9th Earl of Shaftesbury, Field Marshal Alan Brooke, 1st Viscount Alanbrooke, Sir Tyrone Guthrie, Eric Ashby, Baron Ashby, and George J. Mitchell. The current chancellor is Hillary Clinton, who was appointed in January 2020, filling a vacancy since August 2018, when businessman Thomas Moran died. The role is largely a ceremonial one, and she will be present at graduations, act as an ambassador for Queen's abroad and serve as an advisor for the vice-chancellor. Hillary Clinton was given an honorary doctorate from the university in October 2018."]}, {"page": "Robert Helpmann", "response": ["Helpmann's non-ballet work in the later 1930s included his Oberon in Tyrone Guthrie's production of A Midsummer Night's Dream at the Old Vic, which also starred Vivien Leigh as Titania and Ralph Richardson as Bottom.\"Old Vic\", The Times, 28 December 1937, p. 10 The drama critic of The Times wrote:", "Helpmann returned to Hamlet in 1944 in the title role of the original play, with the Old Vic company. After the laudatory reviews for his Oberon, those for his Hamlet were more mixed.  Ivor Brown thought it \"eager, intelligent and exciting\",Brown, Ivor. \"Theatre and Life\", The Observer, 13 February 1944, p. 2 Agate called Helpmann's prince \"most heart-breaking\"Quoted in Howard, p. 122 and the young Peter Brook found Helpmann's fast-paced performance highly exciting,Mazer, p. 98 but other critics thought it a lightweight interpretation, and opinions varied about the quality of Helpmann's verse-speaking.\"Hamlet: Mr Tyrone Guthrie's Production\", The Manchester Guardian, 14 February 1944, p. 3; and \"New Theatre\", The Times, 12 February 1944; p. 6 During the war Helpmann played his first film roles: the supercilious traitor De Jong in One of Our Aircraft is Missing (1942) and the comically fussy Bishop of Ely in Laurence Olivier's Henry V (1944).Sorley Walker (1998a), pp. 53 and 69"]}, {"page": "Stratford Festival", "response": ["Already established in Canadian theatre, Dora Mavor Moore helped put Patterson in touch with British actor and director Tyrone Guthrie, first with a transatlantic telephone call. On July 13, 1953, actor Alec Guinness spoke the first lines of the first play produced by the festival, a production of Richard III: \"Now is the winter of our discontent / Made glorious summer by this son of York.\"J. Alan B. Somerset. 1991. The Stratford Festival Story, 1st edition. Greenwood Press. Tom Patterson. 1987. First Stage. McClelland and Stewart.  Guinness and Irene Worth were among the cast of Stratford's inaugural performance of Richard III, working for expenses only.", "The Festival Theatre's thrust stage was designed by British designer Tanya Moiseiwitsch to resemble both a classic Greek amphitheatre and Shakespeare's Globe Theatre. It has since become a model for other stages in North America and Great Britain.Tyrone Guthrie. 1959. A Life in the Theatre. McGraw Hill. Martin Hunter. Romancing the Bard: Stratford at Fifty. Dundurn Press. 2001. ", "*Tyrone Guthrie (1953–1955)", "* The Stratford Adventure, a 1954 National Film Board documentary on the founding of the festival, with Tyrone Guthrie and Alec Guinness"]}, {"page": "Paddy Chayefsky", "response": ["The Tenth Man (1959) marked Chayefsky's second Broadway theatrical success, garnering 1960 Tony Award nominations for Best Play, Best Director (Tyrone Guthrie) and Best Scenic Design. Guthrie received another nomination for Chayefsky's Gideon, as did actor Fredric March. Chayefsky's final Broadway theatrical production, a play based on the life of Joseph Stalin, The Passion of Josef D, received unfavorable reviews and ran for only 15 performances.Internet Broadway Database; accessed June 29, 2015."]}, {"page": "Tyrone", "response": ["*Tyrone Guthrie (1900–1971), Anglo-Irish theatrical director"]}, {"page": "Crucible Theatre", "response": ["The Crucible Theatre was built by M J Gleeson and opened in 1971. It replaced the Playhouse Repertory theatre in Townhead Street. In 1967 Colin George, the founding artistic director of the Crucible, recommended a thrust stage for Sheffield, inspired by theatres created by Sir Tyrone Guthrie. Tanya Moiseiwitsch, who had been involved in designing Guthrie's theatres, was recruited to design Gleeson's theatre, as well.Sheffield Theatres – venues  The architects Renton Howard Wood Levin Architects were employed and the building itself began to take shape in 1969. It was completed in two years, with the opening performance in November 1971. Fanfare, an evening's entertainment showing children acting in an improvised scene, Chekhov's Swan Song with Ian McKellen and Edward Petherbridge and a music hall finale with a Sheffield brass band."]}, {"page": "List of theatre directors in the 20th and 21st centuries", "response": ["*Tyrone Guthrie"]}, {"page": "Natalie Schafer", "response": ["Schafer began her career as an actress on Broadway before moving to Los Angeles in 1941 to work in films. She appeared on Broadway in 17 plays between 1927–59, often playing supporting roles. Most of those appearances were in short-run plays, with the exceptions of Lady in the Dark (1941–42), The Doughgirls (1942–44), and Romanoff and Juliet (1957–58). She was seen in a revival of Six Characters in Search of an Author, directed by Sir Tyrone Guthrie (1955–56). She also appeared in stock and regional productions, including the off-Broadway production, The Killing of Sister George, with Claire Trevor in the title role. She also guest starred in TV productions beginning in the 1950’s, such as an episode (“The Shy Ballerina”) of Sherlock Holmes, and in \"The Charm School\" episode of I Love Lucy, both in 1954."]}, {"page": "Sadler's Wells Theatre", "response": ["Designed by F.G.M. Chancellor of Matcham & Co, the new theatre opened on 6 January 1931 with a production of Twelfth Night and a cast headed by Ralph Richardson as Sir Toby Belch and John Gielgud as Malvolio. At the beginning of Baylis's management of Sadler's Wells, it was intended that the two theatres should each offer alternating programmes of drama and opera. This happened for a short while, but it soon became clear that it was not only impractical, but also made dubious commercial sense: drama flourished at the Old Vic but lagged behind opera and dance in popularity at the Wells. The Vic-Wells Opera Company was the name of the opera company performing at Sadler's Wells. By 1933/34 season the drama company under Tyrone Guthrie included a range of acting talent including Charles Laughton, Peggy Ashcroft, Flora Robson, Athene Seyler, Marius Goring and James Mason."]}, {"page": "Peggy Ashcroft", "response": ["After playing briefly and without much pleasure in New York, Ashcroft returned to London in 1937 for a season of four plays presented by Gielgud at the Queen's Theatre. She played the Queen in Richard II, Lady Teazle in The School for Scandal, Irina in Three Sisters and Portia in The Merchant of Venice. The company included Harry Andrews, Glen Byam Shaw, George Devine, Michael Redgrave and Harcourt Williams, with Angela Baddeley and Gwen Ffrangcon-Davies as guests. The directors were Gielgud himself, Tyrone Guthrie and Michel Saint-Denis. Billington considers that this company laid the foundations of post-war ensembles such as the Royal Shakespeare Company and the National Theatre. The Munich crisis and the approach of the Second World War delayed for a decade the further development of such a company."]}, {"page": "Jeffrey Jones", "response": ["After graduating from the Putney School in 1964, Jones enrolled in Lawrence University as a premed student, where his performances in university productions brought him to the attention of Tyrone Guthrie, who recruited him for the Guthrie Theater in Minneapolis, Minnesota. He then went to London in 1969 to study at the London Academy of Music and Dramatic Art, followed by a three-year stint with the Stratford Theatre in Stratford, Ontario."]}, {"page": "Tyrone Power", "response": ["Power was born in Cincinnati, Ohio, in 1914, the son of Helen Emma \"Patia\" (née Reaume) and the English-born American stage and screen actor Tyrone Power Sr., often known by his first name \"Fred\". Power was descended from a long Irish theatrical line going back to his great-grandfather, the Irish actor and comedian Tyrone Power (1795–1841). Tyrone Power's sister, Ann Power, was born in 1915, after the family moved to California.  His mother was Roman Catholic, and her ancestry included the French-Canadian Reaume family and Germans from Alsace-Lorraine. Through his paternal great-grandmother, Anne Gilbert, Power was related to the actor Laurence Olivier; through his paternal grandmother, stage actress Ethel Lavenu, he was related by marriage to author Evelyn Waugh; and through his father's first cousin, Norah Emily Gorman Power, he was related to the theatrical director Sir (William) Tyrone Guthrie, the first Director of the Stratford Festival in Canada; and the Tyrone Guthrie Theatre in Minneapolis, Minnesota.Kidd, Charles (1987). Debrett Goes to Hollywood. St. Martin's Press. ."]}, {"page": "Len Cariou", "response": ["Cariou also became a lead actor at the Tyrone Guthrie Theatre  in Minneapolis in the 1960s, where he played Orlando in As You Like It, Agamemnon in Tyrone Guthrie's compilation of The House of Atreus, Iago, Oberon, and the title roles in Henry V, “Oedipus the King,” and King Lear. He also was an associate director."]}, {"page": "Joseph Mascolo", "response": ["| Directed by Tyrone Guthrie, written by George S. Kaufman & Edna Ferber, and produced by Elliot Martin, Lester Osterman, Jr., Alan King & Walter A. Hyman, Ltd."]}]}}