{"wiki_id": "http://www.wikidata.org/entity/Q330619", "itemLabel": "Dougal Haston", "itemDescription": "British mountain climber", "wikipedia_url": "https://en.wikipedia.org/wiki/Dougal_Haston", "wikipedia_page": {"main": "Dougal Haston (19 April 1940 – 17 January 1977) was a Scottish mountaineer noted for his exploits in the British Isles, Alps, and the Himalayas. From 1967 he was the director of the International School of Mountaineering at Leysin, Switzerland, a role he held until his death in an avalanche while skiing above Leysin.", "link_mentions": [{"page": "List of Scots", "response": ["* Dougal Haston (1940–1977), mountaineer"]}, {"page": "January 17", "response": ["*1977 – Dougal Haston, Scottish mountaineer (b. 1940)"]}, {"page": "1975", "response": ["* September 24 – Dougal Haston and Doug Scott on the 1975 British Mount Everest Southwest Face expedition become the first to reach the summit of Mount Everest via a face and the first Britons to reach the summit by any route."]}, {"page": "Annapurna", "response": ["The south face of Annapurna was first climbed in 1970 by Don Whillans and Dougal Haston also without using supplementary oxygen, members of a British expedition led by Chris Bonington that included the alpinist Ian Clough, who was killed by a falling serac during the descent. They were, however, beaten to the second ascent of Annapurna by a matter of days by a British Army expedition led by Colonel Henry Day."]}, {"page": "List of climbers and mountaineers", "response": ["* Dougal Haston (1940–1977) Scotland, first ascent Annapurna south face (1970), killed in avalanche near Leysin"]}, {"page": "Eiger", "response": ["* Eiger Direct, 1966, by Dougal Haston and Peter Gillman, London: Collins, also known as Direttissima; the Eiger Assault", "* The 1972 novel The Eiger Sanction is an action/thriller novel by Rodney William Whitaker (writing under the pseudonym Trevanian), based around the climbing of the Eiger. This was then made into the 1975 film The Eiger Sanction starring Clint Eastwood and George Kennedy. The Eiger Sanction film crew included very experienced mountaineers (e.g., Mike Hoover, Dougal Haston, and Hamish MacInnes, see Summit, 52, Spring 2010) as consultants, to ensure accuracy in the climbing footage, equipment and techniques.", "* The Eiger, 1974, by Dougal Haston, London: Cassell"]}, {"page": "Chris Bonington", "response": ["* 1974 Changabang, Garhwal Himalaya (6864 metres; 22,520') (First ascent) with Don Whillans, Doug Scott and Dougal Haston", "* 1970 British Annapurna South Face expedition, successful, summit reached by Dougal Haston and Don Whillans; death of Ian Clough", "* 1975 British Mount Everest Southwest Face expedition, successful, summit reached by Doug Scott, Dougal Haston, Peter Boardman, Pertemba Sherpa and Mick Burke; death of Burke"]}, {"page": "Peter Boardman", "response": ["With his postgraduate qualification, and climbing and mountaineering experience, Boardman was set on the path to becoming a professional mountaineer. In 1973, he became an instructor at Glenmore Lodge, Aviemore. He moved on to become the National Officer at the British Mountaineering Council in 1975. In 1978 Boardman took over as Director of the International School of Mountaineering in Leysin, Switzerland, after Dougal Haston's death, a position he held until his own death in 1982.", "When Chris Bonington was recruiting for the large, siege-style expedition to climb the South West Face of Everest, Boardman was recommended by Paul Braithwaite as a talented climber who would be compatible with other team members. The expedition was successful in placing the first two Britons, Doug Scott and Dougal Haston, on the summit on 24 September 1975. Boardman and Pertemba, the expedition's head Sirdar, reached the summit on 26 September. On their descent, they met Mick Burke a short distance below the summit and still ascending. They waited for him at the South Summit in deteriorating weather, but Burke was never seen alive again.Boardman, Peter & Richards, Ronnie (1976) \"British Everest expedition SW face 1975\" Alpine Journal 1976, pp3-15.Bonington, Chris (1976) \"Everest Southwest Face\" American Alpine Journal, 1976, pp345-357.Bonington, Chris (1976) Everest the Hard Way, Hodder and Stoughton, London.Boardman, Peter (1978) \"Everest is Not a Private Affair\" in Ken Wilson (ed)(1978) Games Climbers Play, Diadem Books, London.Documentary film: Everest the Hard Way"]}, {"page": "Scottish Mountaineering Club", "response": ["The SMC consists of experienced and competent climbers and mountaineers, both men and women, who have a commitment to climbing in Scotland. Today, there are approximately 500 members, most of whom live in Scotland but with a sizeable minority in England, the Alps and elsewhere. All are active in the mountains of Scotland, and indeed the world. Some members are at the forefront of Scottish mountaineering developments and this has been the case throughout the Club’s history. For instance, W. H. Murray was one of the preeminent mountaineers of the 1930s and his book, Mountaineering in Scotland, published in 1947, is a classic of the genre. The SMC president at the time was Percy Unna who, as a keen conservationist, raised the funds to purchase Glen Coe and other highland areas, ultimately presenting them to the National Trust for Scotland in order, to safeguard them for future generations. Another well known member was Dougal Haston who, along with Doug Scott, were the first from the UK to successfully summit Mount Everest. "]}, {"page": "Old Man of Hoy", "response": ["The stack was first climbed by mountaineers Chris Bonington, Rusty Baillie and Tom Patey in 1966. From 8–9 July 1967, an ascent featured in The Great Climb, a live BBC three-night outside broadcast, which had around 15 million viewers. This featured three pairs of climbers: Bonington and Patey repeated their original route, whilst two new lines were climbed by Joe Brown and Ian McNaught-Davis and by Pete Crew and Dougal Haston."]}, {"page": "Doug Scott", "response": ["Scott was regarded as one of the world's leading high-altitude and big-wall climbers and was the recipient of numerous awards for his achievements. He was the first English person to reach the summit of Mount Everest and, on the descent, he survived an unplanned bivouac with Dougal Haston 100 metres below the summit, without oxygen, sleeping bags and, as it turned out, without frostbite. Apart from his first ascent of the southwest face of Everest with Haston in 1975, all his other Himalayan climbs were achieved in lightweight or pure Alpine style. He pioneered big wall climbing on Baffin Island, Mount Kenya and in the Karakoram, famously on The Ogre with Chris Bonington, and later on Shivling in the Indian Himalayas."]}, {"page": "Ian Clough", "response": ["In 1970, Clough took part in the expedition to Annapurna led by Chris Bonington, but after the successful ascent of the south face by Dougal Haston and Don Whillans he was killed by a falling sérac (ice-pillar) on the mountain's lower slopes. Bonington dedicated his book Annapurna South Face (1971) with the words \"To IAN CLOUGH, who gave so much\", and a meeting-place and arts venue in Clough's hometown of Baildon was named \"Ian Clough Hall\" in his honour."]}, {"page": "Don Whillans", "response": ["From rock climbing he expanded into mountaineering with trips to the Alps where ascents included the \"Bonatti Pillar\" of the Dru and the first ascent with Chris Bonington, Jan Długosz and Ian Clough of the Central Pillar of Freney on Mont Blanc. In 1962 with Bonington he made the first ascent of the Central Torres del Paine, Patagonia and with Dougal Haston, he made the first ascent of the south face of Annapurna in Bonington's 1970 expedition.", "Whillans participated in the 1971 International Expedition and 1972 European Everest Expedition, each attempting to climb Mount Everest's southwest face. The latter expedition was plagued with personality conflicts and the withdrawal of many climbers. While in camp, some other climbers overheard news that England had lost a football match to Germany. \"It seems we have beaten you at your national sport\", said a German. After a pause Whillans replied, \"Aye, and we've beaten you at yours...twice.\" Another incident occurred one night in an alpine hut when two climbers were engaged in a whispered conversation disturbing the sleep of other climbers, one of whom was Whillans. Eventually he demanded that they shut up; there was a brief pause before one of the youths aggressively refused to be quiet, remarking into the darkness \"Who do you think you are?\" The gruff reply of \"Whillans\" was followed by complete silence. However, Whillans's biographer Jim Perrin suggests many of these stories are myths. Whillans liked to emphasise his working class credentials, and on lecture tours, enjoyed telling the story of being stormbound in a tent high in the Himalayas with Dougal Haston who had finished reading The Lord of the Rings and passed him the book. Whillans read a few pages and remarked: \"I'm not reading that crap, it's full of fooking fairies\"!"]}, {"page": "Hamish MacInnes", "response": ["IN 1972 he was part of an 11-strong team that attempted to be the first to ascent the southwest face of Everest, but their expedition did not reach the summit due bad weather. In 1975, MacInnes was deputy leader to Bonington's Mount Everest Southwest Face expedition, which included Dougal Haston and Doug Scott.\"MacInnes 1975\"  from the American Alpine Journal Vol 20; Number 2; Issue 50; (1976) p. 357 He had been tasked with designing equipment for that expedition but after being caught in an avalanche high on the mountain was unable to continue. He went on to scale the overhanging prow of Mount Roraima in the mountainous regions around Brazil, Venezuela and Guyana."]}, {"page": "The Eiger Sanction (film)", "response": ["Eastwood insisted on doing all his own climbing and stunts—a decision met with disapproval by the director of the International School of Mountaineering, Dougal Haston, who experienced the dangers of the Eiger first-hand, having been with American climber John Harlin when he fell to his death. Cameraman Frank Stanley also thought climbing the perilous mountain to shoot a film was unnecessary. While filming on the Eiger, Stanley fell and sustained injuries that forced him to use a wheelchair for some time. Stanley blamed Eastwood for the accident because of lack of preparation, describing him as a director and actor as a \"very impatient man who doesn't really plan his pictures or do any homework\". One of the most dangerous stunts that Eastwood ever attempted involved him hanging from a rope  above the valley floor in the penultimate scene. The scene required him to cut himself free so he could be pulled to safety by his rescuers. As he cuts the rope supporting his weight, he drops precariously before being saved by a rigged cable. Eastwood  later said, \"I didn't want to use a stunt man, because I wanted to use a telephoto lens and zoom in slowly all the way to my face—so you could see it was really me.\" After 5 weeks at the Eiger, the production unit travelled to Zurich to film the opening scenes of the film around the area of the Grossmünster cathedral and the Limmat River, the Münsterbrücke bridge, the Café Bauschänzli, the Kirchgasse, the Napfgasse, and the Restaurant Karl der Grosse."]}, {"page": "Kelvin Kent (mountaineer)", "response": ["Kelvin Kent is a British adventurer, hiker, mountaineer, businessman and lecturer. He served in the British army for many years, seeing combat in Borneo and working with the Gurkhas of Nepal, before moving to the United States in 1976. Previously he had been a member of two mountaineering expeditions organized by Chris Bonington, to the south face of Annapurna in 1970 and the south-west face of Mount Everest in 1972. The Annapurna expedition, on which Kent served as base camp commander, successfully put Dougal Haston and Don Whillans on the summit, but Kent's friend Ian Clough was killed by a falling ice-pillar on the descent. In 1999 Kent established a commemorative plaque in Clough's memory at the site."]}, {"page": "John Harlin", "response": ["Having established himself as a top-rank mountaineer with the first American ascent of the Eiger North Face's Original Route in 1962 and the American Direct on the Dru, he conceived of climbing the Eiger by the direttissima (Italian for \"most direct\") route. Two thousand feet from the summit his rope broke and he fell to his death. The Scottish mountaineer Dougal Haston, who had been climbing with Harlin, reached the summit with a German party which joined forces to follow the same route, afterwards named the \"Harlin route\" in his honor. The story of the climb was recounted in the book Direttissima: The Eiger Assault by British author (and ground team member) Peter Gillman and Dougal Haston.", "* Fenoli, Marc. « Leysin, le roc des sixties », in Montagnes Magazine, no 158, April 1993 : illustrated dossier on the International school of modern mountaineering in Leysin, Switzerland, and the ascent of the Eiger in 1966 by John Harlin, Dougal Haston, Don Williams."]}, {"page": "Scottish Sports Hall of Fame", "response": ["*Dougal Haston (1940–1977)"]}, {"page": "Currie", "response": ["* Dougal Haston - pioneer of Scottish mountaineering"]}, {"page": "List of first ascents", "response": ["|  || Changabang || 6864 || Himalayas ||  || Tashi Chewang, Balwant Sandhu, Chris Bonington, Martin Boysen, Dougal Haston, Doug Scott ||   || Balwant Singh Sandhu, Mountain by Moonlight - The Ascent of Changabang, 1974, HJ 33 (1975)"]}, {"page": "Timeline of Mount Everest expeditions", "response": ["*  1975 British Mount Everest Southwest Face expedition - On September 24, a British expedition led by Chris Bonington achieved the first ascent of the Southwest Face. Summiteers Doug Scott and Dougal Haston made the first ascent by British citizens.The summitters of the 1953 British expedition were not British but a New Zealander and a Sherpa, though Hillary said that in the early 1950s, like most New Zealanders, he felt \"British first, New Zealand second\". He describes himself variously as British and a New Zealander in his own account of the expedition. A band of cliffs on the southwest face, known as the Rock Band, had defeated five previous expeditions between 1969 and 1973. On September 20, Nick Estcourt and Paul Braithwaite achieved the first ascent of the Rock Band. The summit was reached by two teams: first on September 24 by Scott and Haston, who survived the highest ever bivouac when they were benighted on the South Summit during their descent. On September 26 four more climbers attempted a second ascent. Peter Boardman and Sirdar Pertemba Sherpa were successful, but BBC cameraman Mick Burke, climbing alone after Martin Boysen turned back, failed to return from the summit."]}, {"page": "Haston", "response": ["* Dougal Haston (1940–1977), British mountaineer"]}, {"page": "West Calder", "response": ["* Dougal Haston (1940–1977), mountaineer and pupil at West Calder High"]}, {"page": "September 1975", "response": ["*Dougal Haston and Doug Scott on the 1975 British Mount Everest Southwest Face expedition became the first people to reach the summit of Mount Everest by any of its faces and the first Britons to reach the summit by any route.\"Britons Make Record Everest Climb\", Milwaukee Sentinel, September 26, 1975, p. 4; Stephen Venables, Everest: Summit of Achievement (Simon and Schuster, 2003) p. 226"]}, {"page": "1975 in the United Kingdom", "response": ["* 24 September – Dougal Haston and Doug Scott become the first British people to climb Mount Everest."]}, {"page": "Robin Smith (climber)", "response": ["Although Smith was to climb with a variety of talented and notable partners there are two individuals with whom he was to be most productive. His partnership with Dougal Haston is probably the most well known, resulting in routes such as Gob on Carnmore in Wester Ross in April 1960 and Turnspit on Aonach Dubh in 1961. His account published in the Scottish Mountaineering Club Journal entitled \"The Bat and the Wicked\" described their bruising ascent of The Bat on the Carn Dearg Buttress of Ben Nevis; this piece has entered climbing folklore. Indeed, legend has that whilst discussing this buttress with the older and fiercely short-tempered Manchester climber Don Whillans. Smith was to remark that while Whillans had forged the groundbreaking routes of Centurion and Sassenach on Carn Dearg, Smith and Haston had simply climbed the difficult bit in between. The most recent Ben Nevis climbing guide refers to Smith's article, claiming that the climb was \"named after the great swooping falls taken on the first ascent, much of which was reputedly climbed at night.\""]}, {"page": "West Calder High School", "response": ["* Dougal Haston (1940–1977), mountaineer and pupil at West Calder High"]}, {"page": "Mick Burke (mountaineer)", "response": ["Burke was part of Bonington's 1975 Everest expedition, again to climb the south-west face. Burke's role was primarily as a climber, but he also provided high altitude film coverage for the BBC film crew accompanying the expedition. Following Dougal Haston and Doug Scott's first ascent of the face and successful climb to the summit, Burke was part of a second summit push, from which he did not return. He was last seen alive \"heading upwards, a few hundred metres from the summit\", but it is not known for sure that he reached the highest point. The weather began to deteriorate rapidly just after he was last seen, and within hours storms had set in which lasted for two days, precluding any rescue attempt by his companions who were themselves marooned in the top camp until the storms abated. His body was never recovered. After his death, Jo Moran said \"Mick was never a natural climber. But he succeeded because of his total dedication. His application to the sport was tremendous\""]}, {"page": "Peter Gillman", "response": ["Peter Gillman (born 1942) is a British writer and journalist specializing (but not exclusively) in mountaineering topics. His book, Direttissima; the Eiger Assault (1967), also published under the title Direttissima, co-authored with Dougal Haston, told the story of the ascent of the Eiger North Face  in which John Harlin II lost his life."]}, {"page": "Nottingham Moderns RFC", "response": ["However, the greatest individual achievement from one of the Moderns' players of the time, did not come on the rugby pitch. In 1975, Doug Scott, a founder member of the club, stood alongside Dougal Haston on the summit of Mount Everest - the first Briton to reach the top of the world via the south-west face"]}, {"page": "1975 in Scotland", "response": ["* 24 September – Currie-born climber Dougal Haston and Englishman Doug Scott become the first British people to reach the summit of Mount Everest, via the previously unclimbed south-west face."]}, {"page": "1940 in Scotland", "response": ["* 19 April – Dougal Haston, mountaineer (killed 1977 in the Swiss Alps)"]}, {"page": "Norman Dyhrenfurth", "response": ["Along with J. O. M. Roberts of the United Kingdom, Dyhrenfurth co-led the unsuccessful 1971 International Expedition, which attempted to climb Mount Everest by two routes. The climbers included Dougal Haston and Don Whillans of the United Kingdom, Wolfgang Axt of Austria, Odd Eliassen of Norway, David Isles of the United States, Yvette and Michel Vaucher of Switzerland, Carlo Mauri of Italy, Harsh Vardhan Bahuguna of India and Australian journalist Murray Sayle. The expedition ended in disarray after Bahuguna was killed high on the mountain.", "Dyhrenfurth was the chief technical advisor for the 1975 Clint Eastwood movie The Eiger Sanction. Experienced mountaineers including Mike Hoover, Dougal Haston and Hamish MacInnes were also part of the team."]}, {"page": "List of 20th-century summiters of Mount Everest", "response": ["*Doug Scott and Dougal Haston on September 24, 1975 (1975 British Mount Everest Southwest Face expedition)"]}, {"page": "1975 British Mount Everest Southwest Face expedition", "response": ["The 1975 British Mount Everest Southwest Face expedition was the first to successfully climb Mount Everest by ascending one of its faces. In the post-monsoon season Chris Bonington led the expedition which used rock climbing techniques to put fixed ropes up the face from the Western Cwm to just below the South Summit. A key aspect of the success of the climb was the scaling of the cliffs of the Rock Band at about  by Nick Estcourt and Tut Braithwaite. Two teams then climbed to the South Summit and followed the Southeast Ridge to the main summit – Dougal Haston with Doug Scott on 24 September 1975, who at the South Summit made the highest ever bivouac for that time, and Peter Boardman with Pertemba two days later. It is thought that Mick Burke fell to his death shortly after he had also reached the top. British climbers reached the summit of Everest for the first time in an event that has been described as \"the apotheosis of the big, military-style expeditions\".", "After years of stagnation between the wars, British rock climbing underwent a renaissance, particularly with working-class climbing clubs starting up in the north of England and Scotland. The Rock and Ice Club in Manchester, the Creagh Dhu Mountaineering Club in Glasgow and several university climbing clubs were amongst those that engendered a highly competitive climbing environment. At Clogwyn Du'r Arddu in Wales numerous routes of a very high standard were achieved using strictly free climbing techniques. Hamish MacInnes and Dougal Haston, although not members, climbed with Creagh Dhu. MacInnes had mentored Bonington's youthful climbing as early as 1953. These associations led on to spectacular exploits such as the American-led direttissima route up the North Face of the Eiger in the winter of 1966 (including Haston) and the televised climbing of the Old Man of Hoy in Orkney in the following year (including Bonington and Haston). The public took notice and commercial sponsorship started to become a possibility for even more elaborate expeditions but with an ultimate aim of rock climbing. With all the 8000-metre peaks climbed by 1964, climbing in the Himalayas using rock climbing routes became an aspiration.", "The team was based on the climbers in the 1970 Annapurna and 1972 Southwest Face expeditions. Hamish MacInnes was to be deputy leader and Dougal Haston, Doug Scott, Mick Burke, Nick Estcourt, Mike Thompson and Martin Boysen agreed to take part. All except the last two had Southwest Face experience. A notable absentee was Don Whillans who was not invited because of personality clashes on the Annapurna expedition. People joining the team for the first time were Peter Boardman, Paul (\"Tut\") Braithwaite, Ronnie Richards, Dave Clarke, Allen Fyffe and Mike Rhodes. Rhodes was a Barclays employee, nominated by the bank. The doctors, both experienced mountaineers, were Charles Clarke and Jim Duff. Camp managers were Adrian Gordon and Mike Cheney who both spoke Nepali. There was to be a team of thirty-three climbing sherpas with Pertemba as sirdar and Ang Phu as deputy. Twenty-six porters for the Khumbu Icefall were led by their sirdar Phurkipa. There were further sherpas for general duties."]}]}}