{"wiki_id": "http://www.wikidata.org/entity/Q3302145", "itemLabel": "Lucas Fox", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Lucas_Fox", "wikipedia_page": {"main": "Lucas Fox is an English drummer who was, a founding member, of British rock band Motörhead and London punk rockers Warsaw Pakt.\n\n", "link_mentions": [{"page": "Lemmy", "response": ["After Hawkwind, Lemmy formed a new band called \"Bastard\" with guitarist Larry Wallis (former member of the Pink Fairies, Steve Took's Shagrat and UFO) and drummer Lucas Fox. Lemmy and Took were friends, and Took was the stepfather to Lemmy's son Paul. When his manager informed him that a band by the name of \"Bastard\" would never get a slot on Top of the Pops, Lemmy changed the band's name to \"Motörhead\" – the title of the last song he had written for Hawkwind."]}, {"page": "Motörhead", "response": ["Motörhead () were  an English rock band formed in London in 1975 by Lemmy (lead vocals, bass), Larry Wallis (guitar) and Lucas Fox (drums). Lemmy was also the primary songwriter and only constant member. The band are often considered a precursor to the new wave of British heavy metal, which re-energised heavy metal in the late 1970s and early 1980s. Though several guitarists and drummers have played in Motörhead, most of their best-selling albums and singles feature drummer Phil \"Philthy Animal\" Taylor and guitarist \"Fast\" Eddie Clarke.", "Lemmy wanted the music to be \"fast and vicious, just like the MC5\". His stated aim was to \"concentrate on very basic music: loud, fast, city, raucous, arrogant, paranoid, speedfreak rock n roll ... it will be so loud that if we move in next door to you, your lawn will die\". He recruited guitarist Larry Wallis (formerly of Pink Fairies) on the recommendation of Mick Farren, based on Wallis' work with Steve Peregrin Took's band Shagrat, and Lucas Fox on drums. According to Lemmy, the band's first practice was at the now defunct Sound Management rehearsal studios, in Kings Road, Chelsea in 1975. Sound Management leased the basement area of furniture store The Furniture Cave, located in adjacent Lots Road. Kilmister has said they used to steal equipment, as the band was short on gear. Their first engagement was supporting Greenslade at The Roundhouse, London on 20 July 1975.Burridge, Alan Illustrated Collector's Guide to Motorhead Published: 1995, Collector's Guide Publishing . Used for the line-up numbers as listed in albums in band members section as well as information on recordings and performances. On 19 October, having played 10 gigs, they became the supporting act to Blue Öyster Cult at the Hammersmith Odeon.White Line Fever, p. 101.", "* Lucas Fox – drums (1975)"]}, {"page": "List of drummers", "response": ["* Lucas Fox (Motörhead)"]}, {"page": "Larry Wallis", "response": ["While still a member of the Pink Fairies, in May 1975 Wallis joined a new band called Motörhead with Lemmy and Lucas Fox. In September 1975 Fox left the band and Motörhead recruited a new drummer, Phil \"Philthy Animal\" Taylor. Wallis recorded an album with the band, On Parole. It remained unreleased until 1979 when Motörhead had established some reputation for themselves. In February 1976 Wallis was joined by \"Fast\" Eddie Clarke on guitar. Later in the same month Wallis left Motörhead."]}, {"page": "Pink Fairies", "response": ["Paul Rudolph completed recordings with drummer Lucas Fox and bass player Alan Davey in Austin, Texas, to be released as a Pink Fairies album on Cleopatra Records in 2018. One track appeared on the 2017 compilation Halloween Garage Blues. The LP Resident Reptiles was released on August 24, 2018.", "  bar:Lucas    text:\"Lucas Fox\""]}, {"page": "On Parole", "response": ["On Parole is the only album to feature the band's original line-up of Lemmy on vocals and bass, Larry Wallis on guitar and vocals, and Lucas Fox on drums. Motörhead signed a deal with United Artists when manager Douglas Smith secured a deal with the label's A&R man Andrew Lauder, both men having worked together for Lemmy's previous group Hawkwind. During the sessions, original producer Dave Edmunds relinquished his duties, being replaced by Fritz Fryer. Fox left the band as recording was nearing its conclusion and was replaced by Phil \"Philthy Animal\" Taylor, a casual acquaintance Lemmy had met through the local \"speed\" scene. Taylor had been persuaded to drive him to Rockfield Studios and \"bring his drum kit\", as he had boasted to Lemmy that he was a drummer. Taylor was given the job and set about overdubbing all of Fox's previously recorded drum tracks with the exception of \"Lost Johnny\", as he was being held in jail following an arrest for alleged drunk-and-disorderly conduct when that session was due to take place.", "* Lucas Fox – drums on \"Lost Johnny\" and bonus tracks 10–13"]}, {"page": "Phil Taylor (musician)", "response": ["Born on 21 September 1954, in Hasland, Chesterfield, Derbyshire, Taylor grew up in Leeds, Yorkshire. He took drum lessons at Leeds College of Music on advice from his father. After meeting Lemmy, who was a fellow speed user, he joined Motörhead and replaced Lucas Fox during the recording of the band's first album On Parole in 1975. Lemmy has said that Fox wasn't working out and Taylor \"had a car and could give us a lift back down to the studio\". Taylor, in turn, introduced Lemmy to guitarist \"Fast\" Eddie Clarke, having worked with him while painting a houseboat. "]}, {"page": "The Sisterhood (gothic rock band)", "response": ["In only five days Eldritch recorded a song called \"Giving Ground,\" which he co-wrote with Merciful Release manager Boyd Steemson and co-produced with Lucas Fox. Fox and Eldritch had met in the spring of 1985, when Fox was the stand-in drummer for Australian support band the Scientists on the Sisters of Mercy's UK tour. Eldritch recorded all instruments himself (guitar, bass, synthesizers and drum programming), while Fox programmed some additional percussion tracks. Neil Spencer, Martyn Strickland: \"The Eldritch Story\" (in: Sounds magazine 22 February 1986)", "Eldritch and Lucas Fox returned to Fairview Studios. Merciful Release office manager Boyd Steemson: \"Basically, we had some extra tracks around, so Andrew quickly put some songs together.\"Ken McIntyre: \"The Sisterhood\" (Classic Rock magazine July 2007, page 61) ", "James Ray: \"Lucas Fox done the spoken word stuff.\" \"If I remember correctly I advised Andrew on how Lucas Fox should approach his vocals and that was quite enough for me.\"", "Lucas Fox does the vocal parts on \"Colours\", \"Finland Red, Egypt White\" and \"Rain from Heaven\". The text of \"Finland Red, Egypt White\" comes from an arms dealer's catalogue for the AK-47 rifle, while the title cites the country code for blank cartridges. James Ray remembers Norman Cook (AKA Fatboy Slim), then bassist of local band the Housemartins, having done a mix of the track that remains unreleased. \"Rain from Heaven\" with its choral singing seems to have been one of the tracks Eldritch intended for the Left on Mission and Revenge album, as he later mentioned how \"Wayne and Craig had said those choral singings were insane.\""]}]}}