{"wiki_id": "http://www.wikidata.org/entity/Q3308245", "itemLabel": "Michael Hart", "itemDescription": "Scottish footballer (born 1980)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Hart_(footballer)", "wikipedia_page": {"main": "Michael Hart (born 10 February 1980) is retired a Scottish footballer. Hart played as a right back, and previously played for Aberdeen, Livingston, Preston North End, Hibernian, St Johnstone, Airdrie United and Huntly.\n\n", "link_mentions": [{"page": "Jamie Smith (footballer, born 1980)", "response": ["He returned to Scotland in season 2005–06 with Aberdeen. In August 2005, Smith struck a late winner as the Dons defeated rivals Rangers in a league match for the first time since April 1998, wowing the Aberdeen support in only his third competitive game for the club. He was involved in a car crash along with teammate Michael Hart in July 2007, while on a pre-season tour of Egypt. Smith was treated for concussion, while Hart was unhurt."]}, {"page": "Michael Hart", "response": ["Michael Hart, Mike Hart, or Mickey Hart may refer to:", "* Michael Hart (mayor) (c. 1814–1878), New Zealand politician", "* Michael Hart (Australian politician) (born 1960), Australian politician in Queensland", "* Michael Hart (rower) (born 1951), British rower in 1972 Summer Olympics", "* Michael Hart (footballer) (born 1980), Scottish footballer", "* Michael Hart (political scientist) (born 1956), British academic at Exeter College, Oxford", "* Michael Hart (judge) (1948–2007), judge of the High Court of England and Wales"]}, {"page": "Jamie Langfield", "response": ["Langfield was awarded a testimonial by Aberdeen in 2015. The match against Brighton and Hove Albion was played on 26 July 2015 and ended 1–0 with Adam Rooney scoring the only goal. At half time, some of Langfield's former teammates including Darren Mackie, Lee Miller, Derek Young, Lee Mair, Barry Nicholson, Scott Severin and Michael Hart played in a mini match. Langfield later tweeted \"Thank you for everything always in mine and my family's hearts #COYR.\" He was also in consideration for the club's goalkeeping coach before the role went to Gordon Marshall."]}, {"page": "Kevin McCann (footballer, born 1987)", "response": ["After Hibs signed another right back during the 2010 close season (Michael Hart), McCann was loaned to Inverness Caledonian Thistle. McCann impressed in pre-season and started the first three league games. He scored his first goal for Inverness in his second league appearance, \"an unstoppable shot into the top corner of the net from 30 yards\" in a 4–0 win against Dundee United. McCann returned to Hibs in January 2011 at the end of his loan spell. Inverness manager Terry Butcher commented that he would have been signing McCann again, but he had suffered an injury that would prevent him from playing for up to eight weeks. McCann has not played for Hibs since returning from Inverness and he expected to be released at the end of the 2010–11 season. Hibs confirmed this in late April."]}, {"page": "Hart (surname)", "response": ["* Michael Hart (disambiguation), any of several people of the same name", "* Michael Hart (rower) (fl. 1970s), British rower", "* Michael Hart (Oxford) (born 1956), British academic", "* Michael Hart (footballer) (born 1980), Scottish football (soccer) player"]}, {"page": "2007–08 Aberdeen F.C. season", "response": ["|  Michael Hart || Preston North End || Undisclosed ", "After Michael Hart rejected a new deal with Aberdeen, a fee thought to be in the region of £200,000 was agreed between Aberdeen and Preston North End for his transfer.Dons defender agrees Preston move, BBC Sport, 14 January 2008 However, Preston reduced their offer after carrying out medical tests on an injury due to keep him out for weeks.Dons reject Preston's Hart offer, BBC Sport, 26 January 2008 Aberdeen refused to release the player unless Preston paid the agreed fee. He eventually moved to Preston for an undisclosed fee thought to be in the region of £100,000.Dons' Hart completes Preston move, BBC Sport, 30 January 2008", "| Michael Hart || || || 3|| 3"]}, {"page": "Holy Cross High School, Hamilton", "response": ["*Michael Hart - Preston North End player"]}, {"page": "2010–11 Hibernian F.C. season", "response": ["After signing defenders David Stephens and Michael Hart, John Hughes commented that he would now look to sign a forward. He did this towards the end of the window by signing Darryl Duffy on loan, but this appeared to be in anticipation of selling Anthony Stokes to Celtic. Hibs sold Stokes, their top goalscorer in the previous season, for a reported fee of £1.2M. An injury to Duffy soon afterwards again left Hughes looking to sign a forward, which led in part to the signing of trialist Valdas Trakys.", "|| Michael Hart"]}, {"page": "2010–11 Preston North End F.C. season", "response": ["| Michael Hart || Hibernian || 8 July 2010 || Free"]}, {"page": "2006–07 Motherwell F.C. season", "response": ["| 11 November 2006||Aberdeen||Pittodrie, Aberdeen (A)||1–2|| 10,527|| Michael Hart (og) ||Fir Park Corner"]}, {"page": "2011–12 Hibernian F.C. season", "response": ["| Michael Hart"]}, {"page": "2011–12 St Johnstone F.C. season", "response": ["|45|||| DF|| Michael Hart", "| Michael Hart"]}, {"page": "2000 Scottish Challenge Cup Final", "response": ["|DF ||12|| Michael Hart || || "]}, {"page": "2012–13 Greenock Morton F.C. season", "response": ["|Cameron MacDonald    John Boyle     David Lilley    Michael Hart "]}, {"page": "2012–13 St Johnstone F.C. season", "response": ["| Michael Hart"]}, {"page": "2012–13 Airdrie United F.C. season", "response": ["||| DF||Michael Hart", "|  Michael Hart", "|  Michael Hart"]}, {"page": "Aberdeen F.C. Reserves and Academy", "response": ["*Michael Hart"]}]}}