{"wiki_id": "http://www.wikidata.org/entity/Q330633", "itemLabel": "Anthony Steel", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Steel_(actor)", "wikipedia_page": {"main": "Anthony Maitland Steel (21 May 1920 – 21 March 2001) was a British actor and singer best known for his appearances in British war films of the 1950s such as The Wooden Horse (1950) and Where No Vultures Fly, and his marriage to Anita Ekberg.\nHe was described as \"a glorious throwback to the Golden Age of Empire... the perfect imperial actor, born out of his time, blue-eyed, square-jawed, clean-cut.\" As another writer put it, \"whenever a chunky dependable hero was required to portray grace under pressure in wartime or the concerns of a game warden in a remote corner of the empire, Steel was sure to be called upon.\" Another said \"Never as popular as Stewart Granger or as versatile as Kenneth More, he enjoyed a brief period of fashionability embodying the kind of idealised, true-blue Englishman who probably rowed for his university, played cricket on the village green and exuded calm under pressure as he bravely fought for king and country.\"", "link_mentions": [{"page": "May 21", "response": ["*1918 – Anthony Steel, English actor and singer (d. 2001)"]}, {"page": "March 21", "response": ["*  2001   – Anthony Steel, English actor and singer (b. 1920)"]}, {"page": "Laurence Harvey", "response": ["|Anthony Steel"]}, {"page": "2001 in film", "response": ["| style=\"text-align:center;\"| 21 || Anthony Steel || style=\"text-align:center;\"| 80 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "1980 in film", "response": ["| The Mirror Crack'd || Columbia-Warner Distributors / EMI Films / GW Films || Guy Hamilton (director); Jonathan Hales, Barry Sandler (screenplay); Angela Lansbury, Elizabeth Taylor, Kim Novak, Rock Hudson, Edward Fox, Geraldine Chaplin, Tony Curtis, Charles Gray, Richard Pearson, Wendy Morgan, Margaret Courtenay, Carolyn Pickles, Charles Lloyd-Pack, Pat Nye, Norman Wooland, Richard Leech, Sam Kydd, Pierce Brosnan, Anthony Steel, Dinah Sheridan, Nigel Stock, Hildegard Neil, John Bennett, Allan Cuthbertson, Marella Oppenheim, Maureen Bennett, Eric Dodson, Thick Wilson, Peter Woodthorpe || Mystery || Live action"]}, {"page": "1963 in film", "response": ["*A Matter of Choice, directed by Vernon Sewell, starring Anthony Steel – (U.K.)"]}, {"page": "1958 in film", "response": ["*A Question of Adultery, directed by Don Chaffey, starring Julie London, Anthony Steel, Basil Sydney, Donald Houston – (U.K.)"]}, {"page": "1957 in film", "response": ["*Valerie, directed by Gerd Oswald, starring Sterling Hayden, Anita Ekberg, Anthony Steel"]}, {"page": "1956 in film", "response": ["*The Black Tent, directed by Brian Desmond Hurst, starring Donald Sinden, Anthony Steel, Anna Maria Sandri & André Morell – (U.K.)", "*Checkpoint (1956 film), directed by Ralph Thomas, starring Anthony Steel, Odile Versois, Stanley Baker & James Robertson Justice – (U.K.)"]}, {"page": "1955 in film", "response": ["* Out of the Clouds, directed by Basil Dearden, starring Anthony Steel, Robert Beatty – (U.K.)", "* Passage Home, directed by Roy Ward Baker, starring Anthony Steel, Peter Finch, Diane Cilento – (U.K.)", "* Storm Over the Nile, starring Anthony Steel and Laurence Harvey – (U.K.)"]}, {"page": "1954 in film", "response": ["*The Sea Shall Not Have Them, directed by Lewis Gilbert, starring Michael Redgrave, Dirk Bogarde, Anthony Steel, Nigel Patrick – (GB)", "*West of Zanzibar (1954 film), directed by Harry Watt, starring Anthony Steel, Sheila Sim, Edric Connor & Orlando Martins – (U.K.)"]}, {"page": "1953 in film", "response": ["*Albert R.N., directed by Lewis Gilbert, starring Anthony Steel, Jack Warner, Robert Beatty, William Sylvester – (GB)", "*Malta Story, directed by Brian Desmond Hurst, starring Alec Guinness, Jack Hawkins, Anthony Steel, Muriel Pavlow – (GB)", "*The Master of Ballantrae, directed by William Keighley, starring Errol Flynn, Roger Livesey, Anthony Steel, Beatrice Campbell – (U.K.)"]}, {"page": "1952 in film", "response": ["*Emergency Call, directed by Lewis Gilbert, starring Jack Warner, Anthony Steel, Joy Shelton and Freddie Mills – (U.K.)", "*The Planter's Wife, directed by Ken Annakin, starring Claudette Colbert, Jack Hawkins & Anthony Steel – (GB)", "*Something Money Can't Buy, directed by Pat Jackson, starring Patricia Roc, Anthony Steel, Moira Lister & A.E. Matthews – (U.K.)"]}, {"page": "1951 in film", "response": ["*Another Man's Poison, directed by Irving Rapper, starring Bette Davis, Gary Merrill, Emlyn Williams and Anthony Steel – (GB)", "*Where No Vultures Fly, directed by Harry Watt, starring Anthony Steel, Dinah Sheridan, Harold Warrender and Meredith Edwards – (U.K.)"]}, {"page": "1950 in film", "response": ["*The Wooden Horse, starring Leo Genn and Anthony Steel – (GB)"]}, {"page": "Jack Warner (actor)", "response": ["Warner performed in a comedy Talk of a Million (1951) and a thriller Valley of Eagles (1951). He had a small part in Scrooge (1951) then played a policeman again in Emergency Call (1952). He was one of several stars in Meet Me Tonight (1952) and returned to comedy for Those People Next Door (1953). He was top-billed in The Square Ring and The Final Test (both 1953). In the POW film Albert R.N. (1953) he was billed beneath Anthony Steel."]}, {"page": "Robin of Sherwood", "response": ["| colspan=\"3\" | Rula Lenska as Morgwyn of Ravenscar, Dallas Adams as Peter Verdelet, Norman Bowler as Adam the Miller, Anthony Steel as Earl Godwin, Nick Brimble as Earl Godwin's captain, Marcus Gilbert as Lucifer, Glen Murphy as Sir William Marshall", "| colspan=\"3\" | Rula Lenska as Morgwyn of Ravenscar, Dallas Adams as Peter Verdelet, Norman Bowler as Adam the Miller, Anthony Steel as Earl Godwin"]}, {"page": "The Blue Lamp", "response": ["* Anthony Steel as Police Constable (uncredited)", "Anthony Steel has a small role."]}, {"page": "The Four Feathers", "response": ["| 1955 || Storm Over the Nile || align=center | UK || Terence Young, Zoltan Korda || Starring Anthony Steel, James Robertson Justice, Ian Carmichael, Ronald Lewis, Michael Hordern. A low-budget re-make in cinemascope, using much of the location footage shot for the 1939 version of The Four Feathers and the same script – one of the few instances in which this was done (see Shot-for-shot for other examples)."]}, {"page": "1920 in the United Kingdom", "response": ["** Anthony Steel, actor (died 2001)"]}, {"page": "Anita Ekberg", "response": ["Ekberg returned to Hollywood to make Valerie (1957) with Sterling Hayden and her then-husband Anthony Steel for director Gerd Oswald. She co-starred with Bob Hope and Fernandel in Paris Holiday (1958). It was also directed by Oswald as was Screaming Mimi (1958). She did a third for Warwick, The Man Inside (1958) with Jack Palance. Another film was announced for her, entitled A Lot of Woman, but it was not made.", "Both of Ekberg's marriages were to actors, but neither of them succeeded. She was married to Anthony Steel from 22 May 1956 until their divorce on 14 May 1959 and to Rik Van Nutter from 9 April 1963 until their divorce in 1975. In a 2006 interview she said she wished she had a child, but stated just the opposite six months later."]}, {"page": "A. E. W. Mason", "response": ["Zoltan Korda directed a remake, the much less successful Storm Over the Nile (1955), starring Anthony Steel. Other film versions include three earlier silent films, from 1915, 1921 and 1929, a 1978 American television film with Beau Bridges in the lead role, and The Four Feathers (2002), starring Heath Ledger and Kate Hudson."]}, {"page": "Stanley Baker", "response": ["Baker's first leading role in a feature film came with Child in the House (1956), written and directed by Cy Endfield. He had a support role as a psychotic corporal in A Hill in Korea (1956), a Korean War film that also featured early performances from Michael Caine, Stephen Boyd and Robert Shaw. He was the villain in a racing car drama, Checkpoint (1956), opposite Anthony Steel. It was made by the team of Betty E. Box and Ralph Thomas for the Rank Organisation."]}, {"page": "The Sea Shall Not Have Them", "response": ["The Sea Shall Not Have Them is a 1954 British war film starring Michael Redgrave, Dirk Bogarde and Anthony Steel. It was directed by Lewis Gilbert and is based on the 1953 novel by John Harris, about a North Sea rescue during the Second World War. The musical soundtrack is by composer Malcolm Arnold.", "An RAF Air Sea Rescue sea launch is deployed to the search. Commanded by Flying Officer Treherne (Anthony Steel), Launch 2561, or \"Sixty One\" in radio signals, struggles against the bad weather, mechanical problems and a fire in the galley. Second in command, Flight Sergeant Singsby (Nigel Patrick) dominates the crew, playing a benevolent but demanding hand with the questionable seamanship of junior ranks. On the second day, updated intelligence about the dinghy's likely location is received from the downed German Messerschmitt pilot, who the RAF has since rescued. RAF Air Sea Rescue is now aware the dinghy has drifted inshore, far from its ditching point. As the weather clears, \"Sixty One\" sights the dinghy and approaches for rescue, negotiating fire from enemy shore batteries and a mine field. Launch 2561 safely returns to England where the briefcase with secret documents is delivered. An injured Flying Officer Treherne and Flight Sergeant Mackay are applauded by senior officers.", "Producer Dan Angel arranged one of the strongest male casts of the era. It was one of a number of sea-related themes made in Britain following the success of The Cruel Sea. It was one of a number of war movies Anthony Steel made where he was in support of an older British star."]}, {"page": "Albert R.N.", "response": ["Albert R.N. is a 1953 British war film directed by Lewis Gilbert and starring Jack Warner, Anthony Steel and Robert Beatty.", "* Anthony Steel as Lieutenant Geoffrey Ainsworth", "Jack Warner and Anthony Steel were both leased to producer Daniel Angel by the Rank Organisation. Both had previously appeared in POW movies, The Captive Heart (1946) and The Wooden Horse (1950) respectively, and had just made Emergency Call together. Steel frequently made war films in support of an older British actor. A POW camp was built on Headley Heath.", "Lewis Gilbert said the film earned its money back in the United Kingdom. Variety , Wednesday, October 21, 1953, page 181, described it as \"Well-done British-made prison meller, lacks names for U.S. market\", and went on the say it had \"A solid all-round cast admirably fits into the plot. Anthony Steel handsomely suggests the voung artist responsible for the creation of “Albert” and Jack Warner i.s reliably cast as the senior British officer who maintains discipline with understanding in the camp. Robert Beatty, William Sylvester and Guy Middleton are among the principal POWs. Frederick Valk is a sympathetic camp commandant, but Anton Diffring suggests the typical ruthless Nazi type.\""]}, {"page": "The Wooden Horse", "response": ["The Wooden Horse is a 1950 British Second World War war film directed by Jack Lee and starring Leo Genn,  David Tomlinson and Anthony Steel. It is based on the book of the same name by Eric Williams, who also wrote the screenplay.Williams, Eric, The Wooden Horse (Collins, 1949)", "* Anthony Steel as John Clinton", "Leo Genn played the Eric Williams character while Anthony Steele played a character based on Michael Codner. Codner was later killed in 1952 in an ambush during the Malayan Emergency.", "The film was a breakthrough role for Anthony Steel. \"Tony Steel was fine to work with – just a physical type, a young chap who could do certain things,\" said Lee.Brian MacFarlane, An Autobiography of British Cinema, Methueun 1997 p 357 According to Filmink \"he is clearly meant to be “the cute one” of the trio, spending a considerable amount of the film’s running time walking around in shorts bare-chested.\""]}, {"page": "Return of the Saint", "response": ["| 1–11 || 19 November 1978 || \"The Imprudent Professor\" || Catherine Schell, Susan Penhaligon, Anthony Steel, Godfrey James, Richard LeParmentier, Peter Childs, Bill Simpson, John Moreno"]}, {"page": "The Rebel (1961 film)", "response": ["during Anthony Steel's daydreaming reverie sequence, working at the local government office."]}, {"page": "The Mirror Crack'd", "response": ["In addition, Anthony Steel, Dinah Sheridan, Nigel Stock, Hildegard Neil, John Bennett and Allan Cuthbertson are among the actors who appear in Murder at Midnight, a black and white 'teaser' movie shown at the beginning of the film. Natalie Wood was originally chosen to play the role eventually played by Elizabeth Taylor.The Mirror Crack'd at Trailers from Hell"]}, {"page": "Sheila Sim", "response": ["Sheila Beryl Grant Sim was born in Liverpool, Lancashire, only daughter of banker Stuart Grant Sim (1893–1975) and his wife Ida Isabel Carter, who were married in April 1920. Brought up at \"Carnlea\" overlooking Calderstones Park in Liverpool and later, 18 The Ridge at Purley in Surrey, Sim was privately educated before training at RADA. Sim was mainly active as an actress in the 1940s and 1950s. She appeared in the Powell and Pressburger film, A Canterbury Tale (1944); she acted alongside her husband in the Boulting brothers' The Guinea Pig (1948); and starred opposite Anthony Steel in West of Zanzibar (1954)."]}, {"page": "Another Man's Poison", "response": ["* Anthony Steel as Larry Stevens", "The New York Times described the film as \"a garrulous but occasionally interesting excursion into murder and unrequited love...the script...is basically a static affair that rarely escapes from its sets or the scenarist's verbosity. Suspense is only fitfully generated and then quickly dissipated...Gary Merrill contributes a thoroughly seasoned and convincing portrayal...Emlyn Williams adds a professionally polished characterization...and Anthony Steel and Barbara Murray are adequate...However, Another Man's Poison is strictly Bette Davis' meat. She is permitted a wide latitude of histrionics in delineating the designing neurotic who is as flinty a killer as any we've seen in the recent past.\""]}, {"page": "The Monster Club", "response": ["* Anthony Steel as Lintom Busotsky", "Christopher Lee was originally sought for the role of Chetwynd-Hayes, but flatly turned the offer down simply upon hearing the film's title from his agent. Peter Cushing also turned down a role. It was one of the last feature films for Anthony Steel."]}, {"page": "List of Bergerac episodes", "response": ["| Carol Royle, Ray Winstone, John Gordon Sinclair, Anthony Steel, Dallas Adams, Neville Barber"]}, {"page": "Polygon Records discography", "response": ["*\tP. 1114\tAnthony Steel and the Radio Revellers\tWest Of Zanzibar (Jambo) / Who Cares\tApr-54", "*\tP. 1154\tAnthony Steel and the Radio Revellers / The Radio Revellers\tThe Flame / Under The Southern Cross\tFeb-55"]}, {"page": "List of The Professionals episodes", "response": ["| Anthony Steel, Pamela Salem, Felicity Dean, Walter Gotell, Barry Justice, Stefan Kalipha, Kenneth Watson"]}, {"page": "Ralph Thomas", "response": ["Thomas made a war film, Above Us the Waves (1955), before doing a second \"Doctor\", Doctor at Sea (also 1955). Both these movies would be among the most successful films at the British box office in 1955. He followed them with the less popular Checkpoint (1956), a noir crime thriller concerning car racing starring Anthony Steel and featuring location filming in Europe."]}, {"page": "Man Alive (British TV series)", "response": ["Many of the films can now be seen as invaluable snapshots of British life in a bygone age. In the early Seventies, episodes ranged from \"The Other Woman\", which looked at mistresses, to \"The Office Party\", with all that comes with it. \"The Alternative Press\" looked at not just Oz and IT but also small independent community newspapers that were appearing all over Britain to challenge the national newspaper groups with a more moral and intimate attempt at bringing relevant news to people. \"Don't Call Us\" looked at out-of-work actors, \"The Possessed\" was a look at suburban housewives involved with the occult, and \"Soho\" was a leisurely trek around a fast-changing corner of Bohemian London. \"The Fallen Idols\" looked those who had been to the top and back, two of its subjects being Bill Maynard and Anthony Steel."]}, {"page": "List of pirate films and television series", "response": ["|Errol Flynn, Roger Livesey, Anthony Steel, Beatrice Campbell, Yvonne Furneaux", "|Gianna Maria Canale, Anthony Steel, John Kitzmiller"]}, {"page": "Malta Story", "response": ["* Anthony Steel as Wing Commander Bartlett", "It was one of several war films Anthony Steel made where he played in support of an older male actor."]}, {"page": "Ian Dalrymple", "response": ["None of the films had been particularly successful at the box office. In 1949 Wessex moved from Rank to Korda's London Films, who distributed through British Lion Films. The change had instant results: Wessex's first film in association with London, The Wooden Horse (1950), directed by Lee, was a big hit. It also made a star of Anthony Steel."]}, {"page": "Laughter in Paradise", "response": ["*Anthony Steel as Roger Godfrey, private detective hired by Gordon", "Anthony Steel has a small role."]}, {"page": "The Mudlark", "response": ["* Anthony Steel as Lieutenant Charles McHatten", "Anthony Steel had just become a film name in The Wooden Horse."]}, {"page": "Don't Ever Leave Me", "response": ["Anthony Steel has one of his earliest screen appearances.", "* Anthony Steel as Harris "]}, {"page": "The Planter's Wife (1952 film)", "response": ["The Planter's Wife  is a 1952 British propaganda film and drama movie directed by Ken Annakin, and starring Claudette Colbert, Jack Hawkins and Anthony Steel. It is set against the backdrop of the Malayan Emergency and focuses on a rubber planter and his neighbours who are fending off a campaign of sustained attacks by Communist insurgents while also struggling to save their marriage.PLANTER'S WIFE, The"]}, {"page": "Gianna Maria Canale", "response": ["|Anthony Steel"]}, {"page": "Harry Black (film)", "response": ["The film stars Stewart Granger, Barbara Rush, Anthony Steel, and I. S. Johar in a BAFTA nominated role. It was shot in India.", "* Anthony Steel as Desmond Tanner ", "In August Fox announced Stewart Granger and Anthony Steel would star.\"Anthony Steel Films Announced; Two Stars Set for Science Pacts\" Schallert, Edwin. Los Angeles Times 23 Aug 1957: B7. At this stage of his career Granger was making movies primarily to finance the ranch he owned with then-wife Jean Simmons.\"Grangers Staking All on Life as Ranchers: Ranching Suits the Grangers\" Smith, Cecil. Los Angeles Times 8 June 1958: E1.", "Stewart Granger and Anthony Steel signed to play the lead roles. Brabourne cast IS Johar after hearing the actor speak at the London Indian Film Festival.\"BY WAY OF REPORT: Local Film -- Of 'Noah' Mr. Johar of India\" By HOWARD THOMPSON. New York Times (21 Sep 1958: X9."]}, {"page": "List of Western films of the 1960s", "response": ["|Last of the Renegades || Harald Reinl || Lex Barker, Pierre Brice, Anthony Steel, Karin Dor, Klaus Kinski, Terence Hill || West Germany || Euro-Western"]}]}}