{"wiki_id": "http://www.wikidata.org/entity/Q3307867", "itemLabel": "Roger Pearson", "itemDescription": "British anthropologist and far-right political organiser", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Pearson_(anthropologist)", "wikipedia_page": {"main": "Roger Pearson (born 21 August 1927, in London) is a British anthropologist, businessman, eugenics advocate, political organiser for the extreme right, and publisher of political and academic journals. He has been on the faculty of the Queens College, Charlotte, the University of Southern Mississippi, and Montana Tech, and is now retired. It has been noted that Pearson has been surprisingly successful in combining a career in academia with political activities on the far right. He served in the British Army after World War II, and was a businessman in South Asia. In the late 1950s he founded the Northern League. In the 1960s he established himself in the United States for a while working together with Willis Carto publishing white supremacist and anti-Semitic literature.Pearson's anthropological work is based in the eugenic belief that \"favorable\" genes can be identified and segregated from \"unfavorable\" ones. He advocates a belief in biological racialism, and claims that human races can be ranked. Pearson argues that the future of the human species depends on political and scientific steps to replace the \"genetic formulae\" and populations that he considers to be inferior with ones he considers to be superior.Pearson also published two popular textbooks in anthropology, but his anthropological views on race have been widely rejected as unsupported by contemporary anthropology. In 1976 he found the Journal of Social, Political and Economic Studies, which  has been identified as one of two international journals which regularly publishes articles pertaining to race and intelligence with the goal of supporting the idea that white people are inherently superior (the other such journal being Mankind Quarterly).\nIn 1978 he took over the editorship of Mankind Quarterly founded by Robert Gayre and Henry Garrett, widely considered a scientific racist journal. Most of Pearson's publishing ventures have been managed through the Institute for the Study of Man, and the Pioneer Fund, with which Pearson is closely associated, having received $568,000 in the period from 1981 to 1991.Pearson's opposition to egalitarianism extends to Marxism and socialism. In the 1980s, he was a political organizer for the American far-right; he established the Council for American Affairs in the 1970s and was the American representative in the World Anti-Communist League during the second half of the 1970s. As World Chairman of the WACL he worked with the U.S. government during the cold war, and he collaborated with many anti-communist groups in the organisation, including the Unification Church and former German Nazis.On his website, Pearson disputes specific accusations of race-hate, of anti-semitism, of arguing in favor of genocide, involuntary eugenics, forced repatriation of legal immigrants, subjugation or exploitation by one group of another, extreme or fascist politics—including National Socialism or any totalitarian system—as well as denying accusations of impropriety.\n\n", "link_mentions": [{"page": "William Shockley", "response": ["Shockley's writings and lectures on this topic were partly based on the writings of psychologist Cyril Burt and were funded by the Pioneer Fund. Shockley also proposed that individuals with IQs below 100 be paid to undergo voluntary sterilization. Anthropologist Roger Pearson defended Shockley in a self-published book co-authored with Shockley.Pearson, Roger (1992). Shockley on Eugenics and Race, pg. 15–49. Scott-Townsend Publishers.  University of Wisconsin–Milwaukee professor Edgar G. Epps argued that \"William Shockley's position lends itself to racist interpretations\"."]}, {"page": "Hans Eysenck", "response": ["Eysenck advocated a strong influence from genetics and race on IQ differences. Eysenck supported Arthur Jensen's questioning of whether variation in IQ between racial groups was entirely environmental.Eysenck, H. (1971). Race, Intelligence and Education. London: Maurice Temple Smith. In opposition to this position, Eysenck was punched in the face by a protester during a talk at the London School of Economics.Roger Pearson, Race, Intelligence and Bias in Academe, 2nd edition, Scott-Townsend (1997), , pp. 34–38. Eysenck also received bomb threats and threats to kill his young children.Scientist or showman? – Archive – Mail & Guardian Online", "Eysenck was accused of being a supporter of political causes on the extreme right. Connecting arguments were that Eysenck had articles published in the German newspaper National-Zeitung,Christina Schori-Liang. Europe for the Europeans: The Foreign and Security Policy of the Populist Radical Right. Ashgate 2007. p.160. which called him a contributor, and in Nation und Europa, and that he wrote the preface to a book by a far-right French writer named Pierre Krebs, Das unvergängliche Erbe, that was published by Krebs' Thule Seminar. Linguist  interpreted the preface to Krebs' book as having \"railed against the equality of people, presenting it as an untenable ideological doctrine.\" In the National Zeitung Eysenck reproached Sigmund Freud for alleged trickiness and lack of frankness.Siegfried Jäger. \"Der Singer-Diskurs sowie einige Bemerkungen zu seiner Funktion für die Stärkung rassistischer und rechtsextremer Diskurse in der Bundesrepublik Deutschland \". First appeared in Siegfried Jäger and  (1991). Von Menschen und Schweinen. Der Singer-Diskurs und seine Funktion für den Neo-Rassismus. Duisburg: Diss-Texte Nr. 13. p. 7-30. . Quotation: \"Eysenck stellt sich zudem rückhaltlos hinter rechtsextreme Theorie-Zirkel wie z.B. das Kasseler Thule-Seminar. Zu dem von dessen Leiter herausgegebenen Buch mit dem Titel \"Das unvergängliche Erbe\" verfaßte er das Vorwort, in dem er gegen die Gleichheit der Menschen wettert, indem er sie als \"unhaltbare ideologische Doktrin\" abtut. (in Krebs 1981, S. 12)\" Other incidents that fuelled Eysenck's critics like Michael Billig and Steven Rose include the appearance of Eysenck's books on the UK National Front's list of recommended readings and an interview with Eysenck published by National Front's Beacon (1977) and later republished in the US neo-fascist Steppingstones; a similar interview had been published a year before by Neue Anthropologie, described by Eysenck's biographer Roderick Buchanan as a \"sister publication to Mankind Quarterly, having similar contributors and sometimes sharing the same articles.\" Eysenck also wrote an introduction for Roger Pearson's Race, Intelligence and Bias in Academe. In this introduction to Pearson's book, Eysenck retorts that his critics are \"the scattered troops\" of the New Left, who have adopted the \"psychology of the fascists\". Eysenck's book The Inequality of Man, translated in French as L'Inegalite de l'homme, was published by GRECE's publishing house, Éditions Corpernic. In 1974, Eysenck became a member of the academic advisory council of Mankind Quarterly, joining those associated with the journal in attempting to reinvent it as a more mainstream academic vehicle. referring to  Billig asserts that in the same year Eysenck also became a member of the comité de patronage of GRECE's Nouvelle École.Michael Billig, (1979) Psychology, Racism, and Fascism, on-line edition"]}, {"page": "Larry McDonald", "response": ["* “China in Africa.” Sino-Soviet Intervention in Africa, by Roger Pearson. Washington, D.C.: Council on American Affairs, 1977. ."]}, {"page": "Pioneer Fund", "response": ["* Roger Pearson at the Institute for the Study of Man: eugenicist and anthropologist, founder of the Journal of Indo-European Studies,The Journal of Indo-European Studies  via A. Richard Diebold Center for Indo-European Language and Culture. received over a million dollars in grants in the 1980s and 1990s. Using the pseudonym of Stephan Langton, Pearson was the editor of The New Patriot, a short-lived magazine published in 1966–67 to conduct \"a responsible but penetrating inquiry into every aspect of the Jewish Question\", which included articles such as \"Zionists and the Plot Against South Africa\", \"Early Jews and the Rise of Jewish Money Power\", and \"Swindlers of the Crematoria\". The Northern League, an organization founded in England in 1958 by Pearson, supported Nazi ideologies and included former members of the Nazi Party.", "One of the grantees is the paleoconservative and white supremacist journalist Jared Taylor, the editor of American Renaissance and a member the advisory board of the white nationalist publication the Occidental Quarterly. Another is Roger Pearson's Institute for the Study of Man. Many of the key academic white nationalists in both Right Now! and American Renaissance have been funded by the Pioneer Fund, which was also directly involved in funding the parent organization of American Renaissance, the New Century Foundation."]}, {"page": "Raymond Cattell", "response": ["William H. TuckerTucker, W. H. (1994). The Science and Politics of Racial Research. Urbana, IL: University of Illinois Press. and Barry Mehler Also available at the ISAR website: Beyondism: Raymond B. Cattell and the New EugenicsMehler reports he was mentored by Jerry Hirsch, a critic of Cattell at the University of Illinois, where Cattell and Hirsch spent most of their careers. have criticized Cattell based on his writings about evolution and political systems. They argue that throughout his life Cattell adhered to a mixture of eugenics and a new religion of his devising which he eventually named Beyondism and proposed as \"a new morality from science\". Tucker also notes that Cattell thanked the prominent neo-Nazi and white supremacist ideologues Roger Pearson, Wilmot Robertson, and Revilo P. Oliver in the preface to his Beyondism, and that a Beyondist newsletter with which Cattell was involved favorably reviewed Robertson's book The Ethnostate."]}, {"page": "World League for Freedom and Democracy", "response": ["In 1978, Roger Pearson became the World Chairman of the WACL. Pearson was described in a Washington Post article as having neo-Nazi associations and sources report that as a result of an article in the Washington Post in 1978 critical of WACL and alleging extreme right wing politics of Pearson that either he was expelled from WACL or at least was pressured into resigning from his position as World chairman."]}, {"page": "Wickliffe Draper", "response": ["At age 50, Draper again volunteered for military service, and was assigned a post with British military intelligence in India during World War II. After the war, he returned to eugenicist and segregationist activism, and The Pioneer Fund supported the work of a number of noted and controversial researchers of race and intelligence, such as the Nobel Laureate William Shockley, American differential psychologist Arthur Jensen, Canadian evolutionary psychologist J. Philippe Rushton, and British anthropologist Roger Pearson. Though he never served as the Pioneer Fund's president, Draper remained on its board until his death, leaving his estate to the Fund. He also donated considerable funds to right-wing political organizations and candidates, including the World Anti-Communist League (WACL), which was later headed by Dr. Roger Pearson who had received extensive funding from The Pioneer Fund and Draper during his career at Southern Mississippi University."]}, {"page": "Galton Institute", "response": ["* Roger Pearson"]}, {"page": "The American Mercury", "response": ["The DCF sold it in 1963 to the \"Legion for the Survival of Freedom\" of Jason Matthews; the  LSF cut a deal in June 1966 with the (original) Washington Observer, finally merging with Western Destiny. Western Destiny was a Liberty Lobby publication owned by Willis Carto and Roger Pearson, a major recipient of Pioneer Fund grants in history. Pearson was a well-known neo-Nazi and pro-Fascist who headed the World Anti-Communist League during its most blatantly pro-Fascist periods. Pearson was a close associate of Wickliffe Draper, founder of the Pioneer Fund. By then The American Mercury was a quarterly with a circulation of barely 7,000, and its editorial content was composed almost entirely of attacks upon Jews, African Americans, and other minorities."]}, {"page": "Mankind Quarterly", "response": ["The journal was established in 1960 with funding from segregationists, who designed it to serve as a mouthpiece for their views. The costs of initially launching the journal were paid by the Pioneer Fund's Wickliffe Draper. The founders were Robert Gayre, Henry Garrett, Roger Pearson, Corrado Gini, Luigi Gedda (Honorary Advisory Board), Otmar von Verschuer and Reginald Ruggles Gates. Another early editor was Herbert Charles Sanborn, formerly the chair of the department of Philosophy and Psychology at Vanderbilt University from 1921 to 1942. It was originally published in Edinburgh, Scotland, by the International Association for the Advancement of Ethnology and Eugenics, an organization founded by Draper to promote eugenics and scientific racism.", "Few academic anthropologists would publish in the journal or serve on its board; when Gates died, Carleton S. Coon, an anthropologist sympathetic to the hereditarian and racialistic view of the journal, was asked to replace him, but he rejected the offer stating that \"I fear that for a professional anthropologist to accept membership on your board would be the kiss of death\". The journal continued to be published supported by grant money. Publisher Roger Pearson received over a million dollars in grants from the Pioneer Fund in the 1980s and 1990s.Mehler, Barry (7 July 1998). Race Science and the Pioneer Fund Originally published as \"The Funding of the Science\" in Searchlight, No. 277.", "The editor-in-chief is Richard Lynn.. Previous editors include Roger Pearson, Gerhard MeisenbergInternet Archive capture of Mankind Quarterly's directory from 4 March 2016. and Edward Dutton.Internet Archive capture of Mankind Quarterly's directory from  28 March 2019."]}, {"page": "Douglas Q. Adams", "response": ["He has also co-authored two works on Indo-European culture and languages with J. P. Mallory of the Royal Irish Academy. He is a Linguistics Editor at the Journal of Indo-European Studies, founded by Roger Pearson.  "]}, {"page": "Northern League (United Kingdom)", "response": ["The Northern League was a neo-Nazi organisation founded by Roger Pearson. It was active in the United Kingdom and in northern continental Europe in the latter half of the 20th century.", "Roger Pearson formed the Northern League in collaboration with Peter Huxley-Blythe, who was active in a variety of neo-Nazi groups with connections in Germany and North America.Tauber, 1967, Vol. II, n. 142, 207 The League published the  periodical The Northlander.Online Archive of the Northlander at ISAR", "According to the \"Aims\", Northern Europeans are the \"purest survival of the great Indo-European family of nations, sometimes described as the Caucasian race and at other times as the Aryan race\". Almost all the \"classic civilisations of the past were the product of these Indo-European peoples\". Intermarriage with conquered peoples was said to produce the decay of these civilizations, particularly through interbreeding with slaves. \"The rising tide of Color\" threatens to overwhelm European society, and would result in the \"biological annihilation of the subspecies\", according to the Northern League.Andrew S. Winston \"Shared Eugenic Visions: Raymond B. Cattell and Roger Pearson\"  Institute for the Study of Academic Racism"]}, {"page": "GRECE", "response": ["Prominent personalities have collaborated with GRECE, notably via the membership to the patronage committee of its journal Nouvelle École, including Raymond Abellio, Franz Altheim, Maurice Bardèche, Anthony Burgess, Jean Cau, C. D. Darlington, Pierre Debray-Ritzen, Jacques de Mahieu, Mircea Eliade, Hans Eysenck, Julien Freund, Robert Gayre, Jean Haudry, Arthur Koestler, Manfred Mayrhofer, Edgar Polomé, Colin Renfrew, Marija Gimbutas, Marcel Le Glay, Konrad Lorenz, Thierry Maulnier, Armin Mohler, Louis Pauwels, Roger Pearson, Stefan Thomas Possony, or Louis Rougier."]}, {"page": "Journal of Indo-European Studies", "response": ["The Journal of Indo-European Studies is a peer-reviewed academic journal of Indo-European studies published by the Institute for the Study of Man. It was founded in 1973 by the archaeologist Marija Gimbutas, philologist Edgar C. Polomé, linguist Raimo Aulis Anttila and anthropologist and eugenics advocate Roger Pearson. The journal publishes papers in the fields of anthropology, archaeology, mythology and linguistics relating to the cultural history of the Indo-European-speaking peoples. It is published every three months. The editor-in-chief is Emily Blanchard West. It also publishes the Journal of Indo-European Studies Monograph Series."]}, {"page": "Robert E. Kuttner", "response": ["Kuttner collaborated on racial ideas about \"biopolitics\" with Eustace Mullins. He wrote for Roger Pearson's Northern World, the floundering The American Mercury and was an editor of the Mankind Quarterly. He redacted the book Race and Modern Science (1967), in response to the UNESCO statements on race. It was negatively reviewed by Sherwood Washburn who described it as a \"useful source book for racists. Anthropologists need not bother with it.\"Washburn, Sherwood. (1968). Reviewed Work: Race and Modern Science: A Collection of Essays by Biologists, Anthropologists, Sociologists and Psychologists by Robert E. Kuttner. American Anthropologist 70: 1035-1037."]}, {"page": "Donald A. Swan", "response": ["Swan died in June 1981. After his death, Swan's papers were purchased and donated to Roger Pearson at the Institute for the Study of Man, under a Pioneer Fund grant of $59,000."]}, {"page": "Jürgen Rieger", "response": ["It is alleged that he used the nom-de-plume Jörg Rieck for some of his publications, including in his contribution to the \"programmatic\" book of the Thule Seminar, Das unvergängliche Erbe.http://www.diss-duisburg.de/2012/04/der-singer-diskurs-2/ Rieger was editor of the pseudoscientific racialist Neue Anthropologie, sister journal to Roger Pearson's Mankind Quarterly."]}, {"page": "Edgar C. Polomé", "response": ["From 1972 to 1978, Polomé was chairman of the Language Committee of the American Institute of Indian Studies. Together with the archaeologist Marija Gimbutas, Polomé co-founded the Journal of Indo-European Studies (JIES) in 1973. At JIES, Polomé served from the beginning as mythology editor, was responsible for linguistics, and was made managing editor in 1987. In 1995, Polomé launched the JIES Book Chronicle, which reviews books of interest to Indo-European studies. Together with A. Richard Diebold Jr., Polomé co-edited the Journal of Indo-European Studies Monograph Series. Polomé was a friend of J. P. Mallory, who would eventually assume many of his duties at the journal. Polomé was a co-editor of Mankind Quarterly, which like the JIES is published by the anthropologist Roger Pearson. Polomé was along with Gimbutas, Colin Renfrew, Arthur Koestler and many other scholars of prominence a member of the patronage committee of Nouvelle École, which is the journal of Alain de Benoist's Nouvelle Droite think tank GRECE. While Pearson and Benoist have been associated with far-right politics, Polomé and Gimbutas have not been suspected of harboring such political sympathies.. \"[N]one of Pearson’s writing appeared in the one publication at the institute of acknowledged academic value, the Journal of Indo-European Studies, which he left to the control of respected scholars Edgar Polomé and Marija Gimbutas...\". \"[A]mong the members of the patronage committee of Nouvelle Ecole, we find not only scholars above suspicion, like Manfred Mayrhofer, Edgar Polomé, Colin Renfrew, the late Arthur Koestler or the late Marija Gimbutas, but also the famous scholar Mircea Eliade...\""]}, {"page": "Journal of Social, Political and Economic Studies", "response": ["The Journal of Social, Political, and Economic Studies is a quarterly journal published by the Council for Social and Economic Studies. It was founded in 1976 by anthropologist Roger Pearson, and was originally published by The Council of American Affairs, an American representative in the World Anti Communist League. It is now published by the Council for Social and Economic Studies, of which Pearson was the president as of 1982. It has been identified as one of two international journals which regularly publishes articles pertaining to race and intelligence with the goal of supporting the idea that white people are inherently superior (the other such journal being Mankind Quarterly). Notable contributors to the journal include Jack Kemp, Jesse Helms, and Robert S. McNamara. In 1982, U.S. President Ronald Reagan wrote a letter to Pearson personally thanking him for the most recent issue of the Journal, which was never disavowed by the White House. The White House did, however, request that Pearson stop using the letter."]}, {"page": "Arthur Ehrhardt", "response": ["Following the end of the Second World War Ehrhardt became a strong supporter of Oswald Mosley's Europe a Nation ideal and to this end was the founder (with Herbert Böhme) and editor of the magazine Nation Europa in 1949.G. Macklin, Very Deeply Dyed in Black, London, 2007, p. 111 He was a minority shareholder in the enterpriseBracher, The German Dictatorship, p. 587 and, although the journal was damaged by financial wrangling between Ehrhardt and Werner Naumann,Macklin, Very Deeply Dyed in Black, p. 113 it continued publishing until 2009. He was also a regular writer for Western Destiny, the magazine of Roger Pearson.Foundation for Fascism: the New Eugenics Movement in the United States, Patterns of Prejudice  Politically he was an active member of the European Social Movement and also founded his own group, the Jungeuropäischer Arbeitskreis, in 1958."]}, {"page": "History of the race and intelligence controversy", "response": ["One of Shockley's lobbying campaigns involved the educational psychologist, Arthur Jensen, of the University of California, Berkeley (UC Berkeley). Although earlier in his career Jensen had favored environmental rather than genetic factors as the explanation of race differences in intelligence, he had changed his mind during 1966-1967 when he was at the Center for Advanced Study in the Behavioral Sciences at Stanford. Here Jensen met Shockley and through him received support for his research from the Pioneer Fund. Although Shockley and Jensen's names were later to become linked in the media, Jensen does not mention Shockley as an important influence on his thought in his subsequent writings;Roger Pearson's 1992 book \"Shockley on Race and Eugenics\" contains a foreword by Jensen, giving a lengthy assessment of ShockleyIn , Jensen is reported as saying that Shockley's main contribution was to distract opponents and that \"I have always been amazed that someone as bright as he could have contributed so little over so long a span of time\". rather he describes as decisive his work with Hans Eysenck. He also mentions his interest in  the behaviorist theories of Clark L. Hull which he says he abandoned largely because he found them to be incompatible with experimental findings during his years at Berkeley.", "In 1999 the same journal Intelligence reprinted as an invited editorial a long article by the attorney Harry F. Weyher Jr. defending the integrity of the Pioneer Fund, of which he was then president and of which several editors, including Gottfredson, Jensen, Lynn and Rushton, were grantees. In 1994 the Pioneer-financed journal Mankind Quarterly, of which Roger Pearson was the manager and pseudonymous contributor, had been described by Charles Lane  in a review of The Bell Curve in the New York Review of Books as \"a notorious journal of 'racial history' founded, and funded, by men who believe in the genetic superiority of the white race\"; he had called the fund and its journal \"scientific racism's keepers of the flame.\" Gottfredson had previously defended the fund in 1989-1990, asserting that Mankind Quarterly was a \"multicultural journal\" dedicated to \"diversity ... as an object of dispassionate study\" and that Pearson did not approve of membership of the American Nazi Party.  had himself defended the fund in his book Race, Intelligence and Bias in Academe.See:"]}, {"page": "Roger Pearson", "response": ["Roger Pearson may refer to:", "*Roger Pearson (anthropologist) (born 1927), British anthropologist and political organizer", "*Roger Pearson (literary scholar), professor of French at Oxford University"]}, {"page": "Earnest Sevier Cox", "response": ["As the most prominent surviving nordicist of the generation of the 1920s, Cox became a respected figure on the racialist far-right of the 1950s and '60s. He collaborated extensively with white supremacists Willis Carto and Carleton Putnam. Carto's Noontide Press published reprints of several of Cox's early writings. Cox was also a member of the British-based Northern League founded by Roger Pearson, and he was invited to speak at their 1959 conference in the Teutoburg Forest. In his address titled \"Herman's brother\", Cox described Americans as descendants of the brother of the German cultural hero Arminius (Herman), who defeated the Romans at the Battle of Teutoburg Forest, and hence as \"racial brothers\" of the German people.Jason Ward. 2008. \"A Richmond Institution\": Earnest Sevier Cox, Racial Propaganda, and White Resistance to the Civil Rights Movement. Virginia Magazine of History and Biography. Volume 116, Number 3, pp. 262–93. In 1960 he wrote a letter to George Lincoln Rockwell the founder of the Virginia-based American Nazi Party sending them the address he gave in the Teutoburger forest meeting, and stating that he was in \"fundamental sympathy\" with most of their ideas."]}, {"page": "Raimo Aulis Anttila", "response": ["Raimo Aulis Anttila was born in Finland in 1935. He was Professor of Comparative Linguistics at the University of Helsinki from 1971 to 1976. He was appointed Professor of Indo-European Linguistics at the University of California, Los Angeles (UCLA) in 1976. Anttila is also an authority on Finno-Ugric languages. Along with Marija Gimbutas and Edgar C. Polomé and Roger Pearson, Anttila was a co-founder of the Journal of Indo-European Studies, and was a member of its Editorial Committee in the 1970s.  Anttila was elected a Corresponding Member of the Finnish Academy of Science and Letters in 1995. Anttila has now retired from UCLA as Professor Emeritus."]}, {"page": "Peter Huxley-Blythe", "response": ["In his articles, Huxley-Blythe claimed to be in contact with vast underground armies behind the Iron Curtain, which were ready to rise up the moment that the West started a policy of \"rollback\". Huxley-Blythe compared the nuclear deterrence policies of the Eisenhower administration as the modern equivalent to the Magniot Line, demanding that the West undertake an offensive foreign policy to liquidate the Soviet Union once and for all. In 1958, he merged his journal World Survey with Pearson's journal Northlander to better promote \"scientific and forward looking nationalism\". Together with Roger Pearson he co-founded the Northern League in 1958 whose stated purpose was to protect the \"Nordic race\" from the \"annihilation of our kind\" and to struggle \"against forces which would mongrelise our race and civilisation\". In 1967, the American historian Kurt Tauber described Huxley-Blythe as very active in a number of neo-Nazi groups in both West Germany and the United Kingdom from the late 1940s onward, describing him as a leading anti-Semitic conspiracy theorist. Within far-right circles in Britain, Huxley-Blythe had the reputation as \"a reckless adventurer\".  "]}]}}