{"wiki_id": "http://www.wikidata.org/entity/Q3308207", "itemLabel": "Michael Friedländer", "itemDescription": "British orientalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Friedl%C3%A4nder", "wikipedia_page": {"main": "Michael Friedländer (29 April 1833 – 10 December 1910) was an Orientalist and principal of Jews' College, London.  He is best known for his English translation of Maimonides' Guide to the Perplexed, which was the most popular such translation until the more recent work of Shlomo Pines, and still remains in print.\n\n", "link_mentions": [{"page": "Maimonides", "response": ["* The Guide For the Perplexed by Moses Maimonides translated into English by Michael Friedländer"]}, {"page": "Masei", "response": ["*Maimonides. The Guide for the Perplexed, part 3, chapters 40; 47; 50–51. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 342–43, 369, 382, 390. New York: Dover Publications, 1956. ."]}, {"page": "The Guide for the Perplexed", "response": ["The first complete English translation was The Guide for the Perplexed, by Michael Friedländer, with Mr. Joseph Abrahams and Reverend H. Gollancz, dates from 1881. It was originally published in a three volume edition with footnotes. In 1904 it was republished in a less expensive one volume edition, without footnotes, with revisions.  The second edition is still in use today, sold through Dover Publications.  Despite the age of this publication it still has a good reputation, as Friedländer had solid command of Judeao-Arabic and remained particularly faithful to the literal text of Maimonides' work.Online version"]}, {"page": "Simeon Singer", "response": ["He later moved into the College itself, when he decided to enter the Ministry. His studies there were interrupted by the death of its principal, the Rev Barnett Abrahams. Singer was then fortunate to be taught by the new principal, Dr Michael Friedländer, who \"took a kindly interest in young Singer\". In 1867, whilst still a student, he became part-time minister, and combined this with teaching at the Day School, where he was for a time headmaster. He remained at Jews' College for 12 more years."]}, {"page": "Elisha ben Abuyah", "response": ["* Michael Friedländer, Der Vorchristliche Jüdische Gnosticismus, 1898, pp. 100 et seq."]}, {"page": "Theodor Gaster", "response": ["Gaster was born in London, the son of the folklorist Moses Gaster, then Chief Rabbi of the English Sephardi community, who was Romanian by birth and a well-known linguist and scholar of Judaica. He was also a leading Zionist, and named his son after his friend, Theodor Herzl, who had died in 1904, shortly before the boy's birth. Theodor recalled that the first draft of the Balfour Declaration of 1917 was prepared in his father's home. His mother was the daughter of Michael Friedländer. Visitors to the Gaster home included Churchill, Lenin, and Freud."]}, {"page": "Friedländer", "response": ["* Michael Friedländer (1833–1910), Orientalist and principal of Jews' College, London"]}, {"page": "Bereshit (parashah)", "response": ["Maimonides read  to refer to the evil inclination (yetzer ha-ra). Maimonides taught that the three terms — the adversary (, ha-satan), the evil inclination (yetzer ha-ra), and the angel of death — all designate the same thing. And actions ascribed to these three are in reality the actions of one and the same agent. Maimonides taught that the Hebrew term , satan was derived from the same root as the word , seteh, \"turn away,\" as in , and thus implies the notion of turning and moving away from a thing. Thus, the adversary turns people away from the way of truth, and leads them astray in the way of error. Maimonides taught that the same idea is contained in , \"And the imagination of the heart of man is evil from his youth.\" Maimonides reported that the Sages also said that people receive the evil inclination at birth, for  says, \"at the door sin crouches,\" and  says, \"And the imagination of the heart of man is evil from his youth.\" The good inclination, however, is developed. Maimonides taught that the Sages refer to the evil inclination and the good inclination when they tellIn Babylonian Talmud Shabbat 119b, in, e.g., Talmud Bavli: Tractate Shabbos: Volume 4, elucidated by Michoel Weiner, et al., volume 6, page 119b1. that every person is accompanied by two angels, one on the right side and one on the left, one good and one bad.Maimonides. The Guide for the Perplexed, part 3, chapter 22. Cairo, Egypt, 1190, in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 298–99. New York: Dover Publications, 1956."]}, {"page": "Vayeira", "response": ["Maimonides taught that when Scripture reports that God intended \"to descend,\" it signals that God meant to punish humanity, as in ,, \"And the Lord came down to see\"; ,, \"Let us go down and there confound their language\"; and ,, \"I will go down now and see.\"Maimonides, The Guide for the Perplexed, part 1, chapter 10 (Cairo, Egypt, 1190), in, e.g., Moses Maimonides,  Michael Friedländer, translator, The Guide for the Perplexed (New York: Dover Publications, 1956), page 23."]}, {"page": "Noach (parashah)", "response": ["saw\" would be more properly translated \"it was revealed before God.\"Maimonides. The Guide for the Perplexed, part 1, chapters 47–48. Cairo, Egypt, 1190, in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 63–65. New York: Dover Publications, 1956.", "Thus , \"And God said to Noah,\" reports a prophecy proclaimed by Noah acting as a prophet.Maimonides. The Guide for the Perplexed, part 2, chapter 41, in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 235–36.", "Maimonides taught that although the two Hebrew nouns , ish, and , ishah, were originally employed to designate the \"male\" and \"female\" of human beings, they were afterwards applied to the \"male\" and \"female\" of other species of the animal creation. Thus, in , \"Of every clean beast you shall take seven and seven, each with his mate (, ish ve-ishto),\" the words , ish ve-ishto mean \"male and female\" of those animals.Maimonides. The Guide for the Perplexed, part 1, chapter 6, in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, page 19.", "Maimonides read  to refer to the evil inclination (yetzer ha-ra). Maimonides taught that the three terms — the adversary (, ha-satan), the evil inclination (yetzer ha-ra), and the angel of death — all designate the same thing. And actions ascribed to these three are in reality the actions of one and the same agent. Maimonides taught that the Hebrew term , satan was derived from the same root as the word , seteh, \"turn away,\" as in , and thus implies the notion of turning and moving away from a thing. Thus, the adversary turns people away from the way of truth, and leads them astray in the way of error. Maimonides taught that the same idea is contained in , \"And the imagination of the heart of man is evil from his youth.\" Maimonides reported that the Sages also said that people receive the evil inclination at birth, for  says, \"at the door sin crouches,\" and  says, \"And the imagination of the heart of man is evil from his youth.\" The good inclination, however, is developed. Maimonides taught that the Sages refer to the evil inclination and the good inclination when they tellIn Babylonian Talmud Shabbat 119b, in, e.g., Talmud Bavli. Edited by Yisroel Simcha Schorr and Chaim Malinowitz, volume 6, page 119b1. Brooklyn: Mesorah Publications, 1997. that every person is accompanied by two angels, one on the right side and one on the left, one good and one bad.Maimonides. The Guide for the Perplexed, part 3, chapter 22, in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 298–99.", "Maimonides taught that when Scripture reports that God intended \"to descend,\" it signals that God meant to punish humanity, as in , \"And the Lord came down to see\"; , \"Let us go down and there confound their language\"; and , \"I will go down now and see.\"Maimonides. The Guide for the Perplexed, part 1, chapter 10, in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, page 23.", "*Maimonides. The Guide for the Perplexed, part 1, chapters 6, 10, 47–48; part 2, chapter 41; part 3, chapter 22. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 19, 23, 63–65, 235–36, 298–99. New York: Dover Publications, 1956."]}, {"page": "Chayei Sarah", "response": ["Maimonides cited Laban and Bethuel's words regarding Rebekah in  \"Let her be a wife to the son of your master, as the Lord spoke,\" as an example of the proposition that Scripture ascribes to God events evidently due to chance.Maimonides. The Guide for the Perplexed, part 3, chapter 48. Cairo, Egypt, 1190, in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, 250. New York: Dover Publications, 1956.", "*Maimonides. The Guide for the Perplexed, part 1, chapters 12, 19, 37, 41; part 2, chapters 19, 30, 48. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 24, 28, 53, 56, 188, 218, 250. New York: Dover Publications, 1956. ."]}, {"page": "Mishpatim", "response": ["*Maimonides. The Guide for the Perplexed. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 17–19, 28, 32, 34, 37, 51, 58–59, 64, 96, 160, 163, 221, 223, 277, 315, 317, 323, 333, 339–44, 347, 353, 371, 374–75, 387. New York: Dover Publications, 1956. ."]}, {"page": "Toledot", "response": ["Maimonides read the words \"And she went to inquire of the Lord\" in  as an example of a phrase employed by the Torah where a person was not really addressed by the Lord, and did not receive any prophecy, but was informed of a certain thing through a prophet. Maimonides cited the explanation of the Sages that Rebekah went to the college of Eber, and Eber gave her the answer, and this is expressed by the words, \"And the Lord said to her\" in . Maimonides noted that others have explained these words by saying that God spoke to Rebekah through an angel. Maimonides taught that by \"angel\" Eber is meant, as a prophet is sometimes called an \"angel.\" Alternatively, Maimonides taught that  may refer to the angel that appeared to Eber in his vision.Maimonides. The Guide for the Perplexed, part 2, chapter 41. Cairo, Egypt, 1190, in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, page 236. New York: Dover Publications, 1956."]}, {"page": "Vaychi", "response": ["*Maimonides. The Guide for the Perplexed, part 1, chapter 19; part 2, chapter 45. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 29, 243. New York: Dover Publications, 1956."]}, {"page": "Vayishlach", "response": ["Maimonides taught that when Scripture reports an angel's appearance or speech, it reports a vision or dream, whether Scripture expressly states this or not. This, Maimonides held, was the case when  reports with regard to Jacob, \"And a man wrestled with him.\" Maimonides concluded that this took place in a prophetic vision, as  states that the \"man\" was an angel. Maimonides noted that the circumstances in  are exactly the same as those in the vision of Abraham in , where Scripture starts with the general statement of , \"And the Lord appeared to him . . . ,\" and follows with a detailed description. Similarly, Maimonides taught, the account of Jacob's vision begins in , \"And the angels of God met him.\" Scripture then follows with a detailed description of how it came to pass that they met him. Maimonides argued that the \"man\" of  was one of the angels mentioned in , \"And angels of God met him.\" Maimonides concluded that the wrestling and speaking occurred entirely in Jacob's prophetic vision.Maimonides. The Guide for the Perplexed, part 2, chapter 42. Cairo, Egypt, 1190. Reprinted in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 236–37. New York: Dover Publications, 1956.", "Maimonides taught that the encounter where  reports, \"God said to him: 'Your name is Jacob,\" is an instance of where a prophet reports the words of an angel without mentioning that they were perceived in a dream or vision, assuming that it is well known that prophecy can only originate in one of those two ways.Maimonides. The Guide for the Perplexed, part 2, chapter 41. Reprinted in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, page 235."]}, {"page": "Vayigash", "response": ["*Maimonides. The Guide for the Perplexed, part 1, chapters 18, 27–28, 45, 70; part 2, chapters 45, 48; part 3, chapters 38, 46. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 27, 36, 38, 58, 107, 235–36, 243, 250, 340, 359. New York: Dover Publications, 1956."]}, {"page": "Va'eira", "response": ["*Maimonides. The Guide for the Perplexed, part 1, chapters 24, 45– 46; part 2, chapter 35; part 3, chapters 29, 46, 54. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 33, 58, 61, 224, 318, 359, 397. New York: Dover Publications, 1956."]}, {"page": "Bo (parashah)", "response": ["According to Maimonides, Passover is kept seven days, because a week is the intermediate unit of time between a day and a month. Passover teaches people to remember the miracles that God performed in Egypt, encouraging people to thank God repeatedly and to lead a modest and humble life. Jews therefore eat unleavened bread and bitter herbs on Passover in memory of what happened to the Israelites. And they eat unleavened bread for a week because if the eating were only for one day, Jews might not notice it.Maimonides. The Guide for the Perplexed, part 3, chapter 43. Cairo, Egypt, 1190, in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 352–53. Translated by Michael Friedländer, pages 322–27. New York: Dover Publications, 1956.", "*Maimonides. The Guide for the Perplexed. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 27, 30, 32, 36, 55–56, 214, 325, 340, 346, 359, 361, 370. New York: Dover Publications, 1956."]}, {"page": "Beshalach", "response": ["*Maimonides. The Guide for the Perplexed. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 18, 21, 26, 28, 30–31, 37, 58, 61, 107, 203, 210, 213, 271, 305, 324, 326, 339, 349, 383. New York: Dover Publications, 1956."]}, {"page": "Yitro", "response": ["Maimonides taught that God told the Israelites to erect the altar to God's name in  (20:21 in NJPS) and instituted the practice of sacrifices generally as transitional steps to wean the Israelites off of the worship of the times and move them toward prayer as the primary means of worship. Maimonides noted that in nature, God created animals that develop gradually. For example, when a mammal is born, it is extremely tender, and cannot eat dry food, so God provided breasts that yield milk to feed the young animal, until it can eat dry food. Similarly, Maimonides taught, God instituted many laws as temporary measures, as it would have been impossible for the Israelites suddenly to discontinue everything to which they had become accustomed. So God sent Moses to make the Israelites (in the words of ) “a kingdom of priests and a holy nation.” But the general custom of worship in those days was sacrificing animals in temples that contained idols. So God did not command the Israelites to give up those manners of service, but allowed them to continue. God transferred to God's service what had formerly served as a worship of idols, and commanded the Israelites to serve God in the same manner — namely, to build to a Sanctuary (), to erect the altar to God's name ( (20:21 in NJPS), to offer sacrifices to God (), to bow down to God, and to burn incense before God. God forbad doing any of these things to any other being and selected priests for the service in the temple in . By this Divine plan, God blotted out the traces of idolatry, and established the great principle of the Existence and Unity of God. But the sacrificial service, Maimonides taught, was not the primary object of God's commandments about sacrifice; rather, supplications, prayers, and similar kinds of worship are nearer to the primary object. Thus God limited sacrifice to only one temple (see ) and the priesthood to only the members of a particular family. These restrictions, Maimonides taught, served to limit sacrificial worship, and kept it within such bounds that God did not feel it necessary to abolish sacrificial service altogether. But in the Divine plan, prayer and supplication can be offered everywhere and by every person, as can be the wearing of tzitzit () and tefillin (, 16) and similar kinds of service.Maimonides, The Guide for the Perplexed, part 3, chapter 32 (Cairo, Egypt, 1190), in, e.g., Moses Maimonides, The Guide for the Perplexed, translated by Michael Friedländer (New York: Dover Publications, 1956), pages 322–27.", "*Maimonides. The Guide for the Perplexed. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 19, 23, 25, 32, 36, 60, 77, 96–97, 219, 221–23, 264, 305, 322–23, 327, 346, 352. New York: Dover Publications, 1956."]}, {"page": "Jewish English Bible translations", "response": ["==Michael Friedländer's Jewish Family Bible==", "Michael Friedländer edited a Jewish Family Bible in English and Hebrew. It was published in England in 1881. The Friedländer edition is similar in style to the King James Version but diverges primarily in places where the King James translation reflects a Christian interpretation that is at odds with the traditional Jewish understanding. While it never gained wide popularity, it influenced the editors of the first JPS edition, and is cited as the basis for a revised translation found in the Koren Hebrew-English edition."]}, {"page": "Terumah (parashah)", "response": ["Maimonides taught that God told the Israelites to build to a Sanctuary in  and instituted the practice of sacrifices generally as transitional steps to wean the Israelites off of the worship of the times and move them toward prayer as the primary means of worship. Maimonides noted that in nature, God created animals that develop gradually. For example, when a mammal is born, it is extremely tender, and cannot eat dry food, so God provided breasts that yield milk to feed the young animal, until it can eat dry food. Similarly, Maimonides taught, God instituted many laws as temporary measures, as it would have been impossible for the Israelites suddenly to discontinue everything to which they had become accustomed. So God sent Moses to make the Israelites (in the words of ) \"a kingdom of priests and a holy nation.\" But the general custom of worship in those days was sacrificing animals in temples that contained idols. So God did not command the Israelites to give up those manners of service, but allowed them to continue. God transferred to God's service what had formerly served as a worship of idols, and commanded the Israelites to serve God in the same manner — namely, to build to a Sanctuary (), to erect the altar to God's name (), to offer sacrifices to God (), to bow down to God, and to burn incense before God. God forbad doing any of these things to any other being and selected priests for the service in the Temple in . By this Divine plan, God blotted out the traces of idolatry, and established the great principle of the Existence and Unity of God. But the sacrificial service, Maimonides taught, was not the primary object of God's commandments about sacrifice; rather, supplications, prayers, and similar kinds of worship are nearer to the primary object. Thus God limited sacrifice to only one Temple (see ) and the priesthood to only the members of a particular family. These restrictions, Maimonides taught, served to limit sacrificial worship, and kept it within such bounds that God did not feel it necessary to abolish sacrificial service altogether. But in the Divine plan, prayer and supplication can be offered everywhere and by every person, as can be the wearing of tzitzit () and tefillin (, 16) and similar kinds of service.Maimonides. The Guide for the Perplexed, part 3, chapter 32. Cairo, Egypt, 1190, in, e.g., Moses Maimonides. The Guide for the Perplexed, translated by Michael Friedländer, pages 322–27. New York: Dover Publications, 1956.", "Maimonides taught that the belief in the existence of angels was connected with the belief in the existence of God, and the belief in God and angels led to the belief in prophecy and the Law. To support this understanding, God commanded the Israelites to make over the Ark the form of two angels. Maimonides taught that there was not a single cherub so that the people would not be misled to mistake it for God's image or to assume that the angel was a deity. By making two cherubim and declaring (in ) \"the Lord is our God, the Lord is One,\" Moses proclaimed the theory of the existence of a number of angels and that they were not deities.Maimonides. The Guide for the Perplexed, part 3, chapter 45, in, e.g., Moses Maimonides. The Guide for the Perplexed, translated by Michael Friedländer, page 356.", "*Maimonides. The Guide for the Perplexed, part 1, chapters 3, 6, 38; part 2, chapters 30, 45; part 3, chapter 45. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 16, 19, 53, 216, 245, 356. New York: Dover Publications, 1956."]}, {"page": "Tetzaveh", "response": ["Maimonides taught that God selected priests for service in the Tabernacle in  and instituted the practice of sacrifices generally as transitional steps to wean the Israelites off of the worship of the times and move them toward prayer as the primary means of worship. Maimonides noted that in nature, God created animals that develop gradually. For example, when a mammal is born, it is extremely tender, and cannot eat dry food, so God provided breasts that yield milk to feed the young animal, until it can eat dry food. Similarly, Maimonides taught, God instituted many laws as temporary measures, as it would have been impossible for the Israelites suddenly to discontinue everything to which they had become accustomed. So God sent Moses to make the Israelites (in the words of ) \"a kingdom of priests and a holy nation.\" But the general custom of worship in those days was sacrificing animals in temples that contained idols. So God did not command the Israelites to give up those manners of service, but allowed them to continue. God transferred to God's service what had formerly served as a worship of idols, and commanded the Israelites to serve God in the same manner — namely, to build to a Sanctuary (), to erect the altar to God's name (), to offer sacrifices to God (), to bow down to God, and to burn incense before God. God forbade doing any of these things to any other being and selected priests for the service in the temple in  \"And they shall minister to me in the priest's office.\" By this Divine plan, God blotted out the traces of idolatry, and established the great principle of the Existence and Unity of God. But the sacrificial service, Maimonides taught, was not the primary object of God's commandments about sacrifice; rather, supplications, prayers, and similar kinds of worship are nearer to the primary object. Thus God limited sacrifice to only one temple (see ) and the priesthood to only the members of a particular family. These restrictions, Maimonides taught, served to limit sacrificial worship, and kept it within such bounds that God did not feel it necessary to abolish sacrificial service altogether. But in the Divine plan, prayer and supplication can be offered everywhere and by every person, as can be the wearing of tzitzit () and tefillin (, 16) and similar kinds of service.Maimonides. The Guide for the Perplexed, part 3, chapter 32. Cairo, Egypt, 1190, in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 322–27. New York: Dover Publications, 1956.", "*Maimonides. Guide for the Perplexed, part 1, chapter 25; part 3, chapters 4, 32, 45, 46, 47. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 34, 257, 323, 357, 362, 369. New York: Dover Publications, 1956."]}, {"page": "Ki Tissa", "response": ["Similarly, Maimonides equated knowledge of God's Attributes with knowledge of God's works. Because in , God taught Moses Attributes that refer solely to God's works, Maimonides inferred that God had promised to give Moses a knowledge of God's works. Maimonides thus concluded that the ways that Moses wished to know, and which God taught him, were God's actions. Maimonides equated these with what the Sages called \"Attributes\" (, ), noting that the Talmud spoke of the 13 \"Attributes\" of God.Babylonian Talmud Rosh Hashanah 17b, in, e.g., Talmud Bavli: Tractate Rosh Hashanah, elucidated by Abba Zvi Naiman, et al., volume 18, page 17b1. And the Mishnah also used the term in reference to man, saying, for example, \"There are four different sorts (, ) among those who go to the house of learning,\" and, \"There are four different traits (, ) among those who give charity.\"Mishnah Avot 5:13–14, in, e.g., Jacob Neusner, translator, Mishnah, pages 687–88. Maimonides argued that the Sages did not mean that God really possesses Attributes, but that God performs actions similar to human actions that in humans flow from certain Attributes and certain mental dispositions, whereas God has no such dispositions. Although Moses was shown all God's goodness, that is, all God's works,  mentions only the 13 Attributes, because they include those acts of God that refer to the creation and the government of mankind, and to know these acts was the principal object of the prayer of Moses. Maimonides found evidence for this in the conclusion of the prayer of Moses in , \"that I may know You, that I may find grace in Your sight, and consider that this nation is Your people.\" That is, Moses sought understanding of God's ways in governing the Israelites, so that Moses might act similarly. Maimonides concluded that \"the ways\" used in the Bible are identical with the \"Attributes\" used in the Mishnah, denoting the acts emanating from God in reference to the universe.Maimonides, Guide for the Perplexed, part 1, chapter 54 (Cairo, 1190), in, e.g., Moses Maimonides, The Guide for the Perplexed, translated by Michael Friedländer (New York: Dover Publications, 1956), pages 75–76.", "*Maimonides. Guide for the Perplexed, part 1, chapters 4, 8, 15, 16, 18, 21, 37, 46, 48, 54, 64, 66; part 2, chapters 32, 45, 47; part 3, chapters 17, 24, 32, 41, 45, 48, 49, 51, 53. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 3, 17, 21, 26–27, 30–31, 52–53, 61, 65, 75–76, 96, 98, 221, 245, 248, 287, 304, 323, 346, 358, 371, 380, 385, 392–93. New York: Dover Publications, 1956."]}, {"page": "Vayakhel", "response": ["*Maimonides. The Guide for the Perplexed. Cairo, Egypt, 1190. Reprinted in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 29–31, 393, 397. New York: Dover Publications, 1956. ."]}, {"page": "Pekudei", "response": ["*Maimonides. The Guide for the Perplexed. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 29, 96. New York: Dover Publications, 1956."]}, {"page": "Vayikra (parashah)", "response": ["Maimonides and Nachmanides differed about the reason for the sacrificial system. Maimonides wrote that the reason for the offerings was because when the Israelites lived in Egypt and Chaldea, the Egyptians worshipped sheep and the Chaldeans worshipped demons in the form of goats. And people in India never slaughter cattle. Thus God commanded the Israelites to slaughter cattle, sheep, and goats to God, so that worshipers of the other lands would know that God required the very act that they considered to be the utmost sin, and through that act God would forgive Israel's sins. God thus intended to cure the people of the other nations of false beliefs, which Maimonides characterized as diseases of the soul, for diseases are healed by medicines that are antithetical to the diseases.Maimonides. The Guide for the Perplexed, part 3, chapter 46. Cairo, Egypt, 1190, in, e.g., Moses Maimonides. The Guide for the Perplexed, translated by Michael Friedländer, page 359. New York: Dover Publications, 1956.", "Maimonides taught that God instituted the practice of sacrifices as a transitional step to wean the Israelites off of the worship of the times and move them toward prayer as the primary means of worship. Maimonides noted that in nature, God created animals that develop gradually. For example, when a mammal is born, it is extremely tender, and cannot eat dry food, so God provided breasts that yield milk to feed the young animal, until it can eat dry food. Similarly, Maimonides taught, God instituted many laws as temporary measures, as it would have been impossible for the Israelites to suddenly discontinue everything to which they had become accustomed. So God sent Moses to make the Israelites (in the words of ) \"a kingdom of priests and a holy nation.\" But the general custom of worship in those days was sacrificing animals in temples that contained idols. So God did not command the Israelites to give up those manners of service, but allowed them to continue. God transferred to God's service what had formerly served as a worship of idols, and commanded the Israelites to serve God in the same manner — namely, to build to a Sanctuary (), to erect the altar to God's name (), to offer sacrifices to God (), to bow down to God, and to burn incense before God. God forbad doing any of these things to any other being and selected priests for the service in the Temple in . By this Divine plan, God blotted out the traces of idolatry, and established the great principle of the Existence and Unity of God. But the sacrificial service, Maimonides taught, was not the primary object of God's commandments about sacrifice; rather, supplications, prayers, and similar kinds of worship are nearer to the primary object. Thus God limited sacrifice to only one Temple (see ) and the priesthood to only the members of a particular family. These restrictions, Maimonides taught, served to limit sacrificial worship, and kept it within such bounds that God did not feel it necessary to abolish sacrificial service altogether. But in the Divine plan, prayer and supplication can be offered everywhere and by every person, as can be the wearing of tzitzit () and tefillin (, 16) and similar kinds of service.Maimonides. The Guide for the Perplexed, part 3, chapter 32, in, e.g., Moses Maimonides. The Guide for the Perplexed, translated by Michael Friedländer, pages 322–27."]}, {"page": "Tzav", "response": ["Maimonides and Nachmanides differed about the reason for the sacrificial system. Maimonides wrote that the reason for the offerings was because when the Israelites lived in Egypt and Chaldea, the Egyptians worshipped sheep and the Chaldeans worshipped demons in the form of goats. And people in India never slaughter cattle. Thus God commanded the Israelites to slaughter cattle, sheep, and goats to God, so that worshipers of the other lands would know that God required the very act that they considered to be the utmost sin, and through that act God would forgive Israel's sins. God thus intended to cure the people of the other nations of false beliefs, which Maimonides characterized as diseases of the soul, for diseases are healed by medicines that are antithetical to the diseases.Maimonides, The Guide for the Perplexed, part 3, chapter 46 (Cairo, Egypt, 1190), in, e.g., Moses Maimonides, The Guide for the Perplexed, translated by Michael Friedländer (New York: Dover Publications, 1956), page 359.", "Maimonides taught that God instituted the practice of sacrifices as a transitional step to wean the Israelites off of the worship of the times and move them toward prayer as the primary means of worship. Maimonides noted that in nature, God created animals that develop gradually. For example, when a mammal is born, it is extremely tender, and cannot eat dry food, so God provided breasts that yield milk to feed the young animal, until it can eat dry food. Similarly, Maimonides taught, God instituted many laws as temporary measures, as it would have been impossible for the Israelites suddenly to discontinue everything to which they had become accustomed. So God sent Moses to make the Israelites (in the words of ) \"a kingdom of priests and a holy nation.\" But the general custom of worship in those days was sacrificing animals in temples that contained idols. So God did not command the Israelites to give up those manners of service, but allowed them to continue. God transferred to God's service what had formerly served as a worship of idols, and commanded the Israelites to serve God in the same manner — namely, to build to a Sanctuary (), to erect the altar to God's name (), to offer sacrifices to God (), to bow down to God, and to burn incense before God. God forbad doing any of these things to any other being and selected priests for the service in the temple in  By this Divine plan, God blotted out the traces of idolatry, and established the great principle of the Existence and Unity of God. But the sacrificial service, Maimonides taught, was not the primary object of God's commandments about sacrifice; rather, supplications, prayers, and similar kinds of worship are nearer to the primary object. Thus God limited sacrifice to only one temple (see ) and the priesthood to only the members of a particular family. These restrictions, Maimonides taught, served to limit sacrificial worship, and kept it within such bounds that God did not feel it necessary to abolish sacrificial service altogether. But in the Divine plan, prayer and supplication can be offered everywhere and by every person, as can be the wearing of tzitzit () and tefillin ( 16) and similar kinds of service.Maimonides, The Guide for the Perplexed, part 3, chapter 32, in, e.g., Moses Maimonides, The Guide for the Perplexed, translated by Michael Friedländer, pages 322–27."]}, {"page": "Shemini (parashah)", "response": ["*Maimonides. Guide for the Perplexed, 1:37; 3:46, 47, 48. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 53, 364, 367–68, 370. New York: Dover Publications, 1956. ."]}, {"page": "Tazria", "response": ["Maimonides taught that the laws of impurity serve many uses: (1) They keep Jews at a distance from dirty and filthy objects. (2) They guard the Sanctuary. (3) They pay regard to an established custom. (4) They lightened the burden. For these laws do not impede people affected with impurity in their ordinary occupations. For the distinction between pure and impure applies only with reference to the Sanctuary and the holy objects connected with it; it does not apply to other cases. Citing  \"She shall touch no hallowed thing, nor come into the Sanctuary,\" Maimonides noted that people who do not intend to enter the Sanctuary or touch any holy thing are not guilty of any sin if they remain unclean as long as they like, and eat, according to their pleasure, ordinary food that has been in contact with unclean things.Maimonides. The Guide for the Perplexed, part 3, chapter 47. Cairo, Egypt, 1190. Reprinted in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, page 368. New York: Dover Publications, 1956. .", "*Maimonides. The Guide for the Perplexed, part 1, chapter 42; part 3, chapters 41, 45, 47, 49. Cairo, Egypt, 1190. Reprinted in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 56, 346, 357, 368, 379. New York: Dover Publications, 1956. ."]}, {"page": "Metzora (parashah)", "response": ["*Maimonides. The Guide for the Perplexed, part 3, chapter 47. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 367–68, 370. New York: Dover Publications, 1956. ."]}, {"page": "Acharei Mot", "response": ["Maimonides noted that the scapegoat that was sent into the wilderness in  served as an atonement for all serious transgressions more than any other sin-offering of the congregation. Maimonides explained that as it thus seemed to carry off all sins, the scapegoat was not accepted as an ordinary sacrifice to be slaughtered, burned, or even brought near the Sanctuary. Rather, it was removed as far as possible from the community. Maimonides wrote that there is no doubt that sins cannot actually be carried like a burden, and taken off the shoulder of one being to be laid on that of another being. But the ceremonies of the scapegoat were symbolic, and serve to impress upon people the need to repent, as if to say, we have freed ourselves of our previous deeds, have cast them behind us, and removed them as far as possible.Maimonides. The Guide for the Perplexed, part 3, chapter 46. Cairo, Egypt, 1190, in, e.g., Moses Maimonides. The Guide for the Perplexed, translated by Michael Friedländer, page 366. New York: Dover Publications, 1956.", "Maimonides taught that the object of the Fast of Atonement is the sense of repentance that it creates.  Maimonides noted that it was on Yom Kippur that Moses came down from Mount Sinai with the second tablets and announced to the Israelites God’s pardon of their sin with the Golden Calf.  God therefore appointed Yom Kippur forever as a day devoted to repentance and the true worship of God.  For this reason, the law interdicts all material enjoyment, trouble and care for the body, and work, so that people might spend the day confessing their sins and abandoning them.Maimonides. The Guide for the Perplexed, part 3, chapter 43. Reprinted in, e.g., Moses Maimonides. The Guide for the Perplexed, translated by Michael Friedländer, page 352.", "Reading the prohibition of eating blood in , Maimonides reported that the Sabeans (who lived in what is today Yemen) consumed blood, because they thought it was the food of spirits. Maimonides reported that the Sabeans and other non-Jews hoped that by eating blood, they would gain the company and goodwill of the spirits, who might then tell them about the future. Maimonides explained that  sought to cure humanity of such afflictions. And Maimonides similarly explained that  required that whenever Israelites killed a beast or bird that could be eaten, its blood had to be covered with earth, so that people would not assemble around the blood for the purpose of eating in the presence of spirits.Moses Maimonides. The Guide for the Perplexed, part 3, chapter 46, in, e.g., Moses Maimonides. The Guide for the Perplexed, translated by Michael Friedländer, pages 362–63.", "*Maimonides. The Guide for the Perplexed, part 3, chapters 37, 41, 46, 47, 48, 49. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 334, 346, 362–64, 366, 369, 371, 376–77. New York: Dover Publications, 1956. ."]}, {"page": "Shlach", "response": ["Maimonides taught that the Sages said that inspiration does not come to a prophet when the prophet is sad or languid. Thus Moses did not receive any revelation when he was in a state of depression that lasted from the murmurings of the Israelites upon the evil report of the spies until the death of the warriors of that generation.Maimonides. The Guide for the Perplexed, part 2, chapter 36. Cairo, Egypt, 1190, in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, page 227. New York: Dover Publications, 1956.", "Maimonides wrote that he was at a loss why God commanded the offering of wine in , since idolaters brought wine as an offering. But Maimonides credited another person with suggesting the reason that meat is the best nourishment for the appetite, the source of which is the liver; wine supports best the vital faculty, whose center is the heart; and music is most agreeable to the psychic faculty, the source of which is the brain. Thus, Maimonides wrote, each of a person's faculties approached God with that which it liked best. And thus the sacrifice consisted of meat, wine, and music.Maimonides. The Guide for the Perplexed, part 3, chapter 46, in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, page 366.", "Noting the universal application of the laws of the fringes (, tzitzit) in , Maimonides taught that God designed the wearing of tzitzit as a more enduring form of worship than the practice of sacrifices, which Maimonides taught were a transitional step to wean the Israelites off of the worship of the times and move them toward prayer as the primary means of worship. Maimonides noted that in nature, God created animals that develop gradually. For example, when a mammal is born, it is extremely tender, and cannot eat dry food, so God provided breasts that yield milk to feed the young animal, until it can eat dry food. Similarly, Maimonides taught, God instituted many laws as temporary measures, as it would have been impossible for the Israelites suddenly to discontinue everything to which they had become accustomed. So God sent Moses to make the Israelites (in the words of ) \"a kingdom of priests and a holy nation.\" But the general custom of worship in those days was sacrificing animals in temples that contained idols. So God did not command the Israelites to give up those manners of service, but allowed them to continue. God transferred to God's service what had formerly served as a worship of idols, and commanded the Israelites to serve God in the same manner — namely, to build to a Sanctuary (), to erect the altar to God's name (), to offer sacrifices to God (), to bow down to God, and to burn incense before God. God forbad doing any of these things to any other being and selected priests for the service in the temple in . By this Divine plan, God blotted out the traces of idolatry, and established the great principle of the Existence and Unity of God. But the sacrificial service, Maimonides taught, was not the primary object of God's commandments about sacrifice; rather, supplications, prayers, and similar kinds of worship are nearer to the primary object. Thus God limited sacrifice to only one temple (see ) and the priesthood to only the members of a particular family. These restrictions, Maimonides taught, served to limit sacrificial worship, and kept it within such bounds that God did not feel it necessary to abolish sacrificial service altogether. But in the Divine plan, prayer and supplication can be offered everywhere and by every person, as can be the wearing of tzitzit () and tefillin (, 16) and similar kinds of service.Maimonides. The Guide for the Perplexed, part 3, chapter 32, in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 322–27.", "*Maimonides. The Guide for the Perplexed, part 1, chapters 30, 39, 65; part 2, chapter 36; part 3, chapters 29, 32, 34, 39, 41, 46. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 39–40, 54, 97, 320, 325, 329, 339, 348, 363, 366. New York: Dover Publications, 1956."]}, {"page": "Emor", "response": ["Maimonides proposed reasons for the festivals discussed in .Maimonides. The Guide for the Perplexed, part 3, chapter 43 (Cairo, Egypt, 1190), in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 352–54. New York: Dover Publications, 1956. Maimonides taught that the object of the Sabbath (mentioned in ) was the rest that it affords. One-seventh of the life of every person, small or great, passes in comfort and rest from trouble and exertion. In addition, the Sabbath perpetuates remembrance of the Creation.Maimonides. The Guide for the Perplexed, part 3, chapter 43, in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, page 352.", "According to Maimonides, Passover (mentioned in ) is kept seven days, because a week is the intermediate unit of time between a day and a month. Passover teaches people to remember the miracles that God performed in Egypt, encouraging people to thank God repeatedly and to lead a modest and humble life. Jews therefore eat unleavened bread and bitter herbs on Passover in memory of what happened to the Israelites. And they eat unleavened bread for a week because if the eating were only for one day, Jews might not notice it.Maimonides. The Guide for the Perplexed, part 3, chapter 43, in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 352–53.", "Maimonides wrote that Jews likewise keep Rosh Hashanah (mentioned in ) for one day, for it is a day of repentance, on which Jews are stirred up from forgetfulness, and for this reason the shofar is blown on that day. According to Maimonides, Rosh Hashanah is a preparation for and an introduction to Yom Kippur, as is plain from the tradition about the days between Rosh Hashanah and Yom Kippur.Maimonides. The Guide for the Perplexed, part 3, chapter 43. Reprinted in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, page 353.", "Maimonides taught that Sukkot (discussed in  and 39–44), which is a feast of rejoicing and gladness, is kept seven days, so that the festival may be more noticeable. It is kept in the autumn because, as  says, it is \"When you have gathered in your labors out of the field,\" and thus when people can rest free from pressing labors. Maimonides cited the ninth book of Aristotle's Ethics for the proposition that harvest festivals were a general custom, quoting Aristotle to report, \"In ancient times, the sacrifices and assemblies of the people took place after the ingathering of the corn and the fruit, as if the sacrifices were offered on account of the harvest.\" Maimonides noted the temperate nature of autumn as another reason for Sukkot falling in that season, making it possible to dwell in booths free of great heat and troublesome rain. Maimonides taught that Sukkot reminds Jews of the miracles that God performed in the wilderness, once again to induced Jews to thank God and lead a modest and humble life. Jews thus leave their houses to dwell in sukkot, as inhabitants of deserts do, so as to remember that this had once been their condition, as reported in , \"I made the children of Israel to dwell in booths.\" And Jews join to Sukkot the Feast of Shemini Atzeret to complete in the comfort of their homes their rejoicings, which cannot be perfect in booths. Maimonides taught that the lulav and etrog symbolize the rejoicing that the Israelites had when they replaced the wilderness, which was in the words of , \"no place of seed, or of figs, or of vines, or of pomegranates, or of water to drink,\" with a country full of fruit trees and rivers. To remember this, Jews take the most pleasant fruit of the land, branches that smell best, most beautiful leaves, and also the best of herbs, that is, the willows of the brook. The four species joined in the lulav and etrog also were (1) plentiful in those days in the Land of Israel, so that everyone could easily get them, (2) of a good appearance, and in the case of the etrog and myrtle, excellent smell, and (3) keep fresh and green for seven days.Maimonides. The Guide for the Perplexed, part 3, chapter 43. Reprinted in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 353–54.", "*Maimonides. The Guide for the Perplexed, part 1, chapter 64; part 3, chapters 17, 41, 43, 46, 47, 48, 49. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 96, 287, 344, 346, 353, 360, 369, 371, 379. New York: Dover Publications, 1956. ."]}, {"page": "Behar", "response": ["*Maimonides. The Guide for the Perplexed, part 1, chapter 12; part 3, chapters 38, 45. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 24, 340, 357. New York: Dover Publications, 1956. ."]}, {"page": "Bechukotai", "response": ["Maimonides considered the law concerning the exchange of a sacrifice as preventive, for if it were permitted to substitute a good animal for a bad one, people would substitute a bad animal for a good one, and say that it was better than the original. Thus,  sets forth the rule that if any such change took place, both the \"original sacrifice and the exchange thereof should be holy.\" And Maimonides explained that the reason for the rule of  that when a person redeemed a thing devoted to the Sanctuary, the person needed to add one fifth, was because people are usually selfish and naturally inclined to keep and save their property. The owner would therefore not take the necessary trouble in the interest of the Sanctuary, and would not expose the property sufficiently to the valuer, and its true value would not be fixed. Therefore, the owner had to add one-fifth. Maimonides taught that these rules were laid down in order that people should not despise what was connected to the name of God, and which served as a means of approaching God.Maimonides, The Guide for the Perplexed, part 3, chapter 46 (Cairo, Egypt, 1190), in, e.g., Moses Maimonides, The Guide for the Perplexed, translated by Michael Friedländer (New York: Dover Publications, 1956), pages 360–61.", "*Maimonides. The Guide for the Perplexed, part 1, chapter 30; part 3, chapters 17, 32, 35, 36, 37, 41, 46, 51. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 39, 287, 326, 329, 331–32, 334, 346, 360–61, 388. New York: Dover Publications, 1956. ."]}, {"page": "Bemidbar (parashah)", "response": ["*Maimonides. Guide for the Perplexed, part 3, chapter 24. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, page 305. New York: Dover Publications, 1956. . (wilderness)."]}, {"page": "Naso (parashah)", "response": ["Maimonides taught that the object of the nazirite laws in  was to keep people away from wine — which ruined people in ancient and modern times. Maimonides wrote that the law in  prohibiting the nazirite from eating anything made from the grape vine was an additional precaution, implying that people must consume wine only as much as is absolutely necessary. For  calls those who abstain from drinking wine \"holy\" — equal to the sanctity of the High Priest — an honor given nazirites because they abstain from wine.Maimonides, The Guide for the Perplexed, part 3, chapter 48 (Cairo, Egypt, 1190), in, e.g., Moses Maimonides, The Guide for the Perplexed, translated by Michael Friedländer (New York: Dover Publications, 1956), page 372.", "*Maimonides. The Guide for the Perplexed, part 1, chapters 37, 61; part 3, chapters 33, 46, 47, 48. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 53, 90–91, 327, 364, 366, 370, 372. New York: Dover Publications, 1956. ."]}, {"page": "Behaalotecha", "response": ["*Maimonides. The Guide for the Perplexed, part 1, chapters 3–4, 10, 24, 30, 40, 45, 47, 54; part 2, chapters 24, 30, 36, 41, 45; part 3, chapters 2, 32, 36, 50. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 3, 17–18, 23, 34, 39, 55, 58, 63, 75, 198, 214, 225, 234–35, 242, 245, 254, 324, 331, 383. New York: Dover Publications, 1956. ."]}, {"page": "Moses Gaster", "response": ["Moses Gaster (17 September 1856 – 5 March 1939) was a Romanian, later British scholar, the Hakham of the Spanish and Portuguese Jewish congregation, London, and a Hebrew and Romanian linguist. Moses Gaster was an active Zionist in Romania as well as in England, where in 1899 he helped establish the English Zionist Federation.\"Moses Gaster Projects\", University of Manchester He was the father of Jack and Theodor Gaster and the grandfather of Marghanita Laski. He was also son-in-law to Michael Friedländer and father-in-law to Neville Laski."]}, {"page": "Korach (parashah)", "response": ["*Maimonides. The Guide for the Perplexed, part 1, chapters 15, 20. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 25, 29. New York: Dover Publications, 1956. ."]}, {"page": "Chukat", "response": ["*Maimonides. The Guide for the Perplexed, part 1, chapter 15; part 2, chapters 6, 42; part 3, chapters 43, 47, 50. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 26, 160, 237, 354, 368, 370, 383. New York: Dover Publications, 1956. ."]}, {"page": "Balak (parashah)", "response": ["*Maimonides. The Guide for the Perplexed. Cairo, Egypt, 1190. Reprinted in, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 17, 29, 105, 235, 242, 264, 288, 298. New York: Dover Publications, 1956. ."]}, {"page": "Active intellect", "response": ["Prophecy is, in truth and reality, an emanation sent forth by the Divine Being through the medium of the Active Intellect, in the first instance to man's rational faculty, and then to his imaginative faculty.Maimonides, Guide for the Perplexed (translator: Michael Friedländer), Dover: New York, 1904, p. 225"]}, {"page": "Pinechas (parashah)", "response": ["Maimonides proposed reasons for the festivals discussed in Maimonides. The Guide for the Perplexed, part 3, chapter 43. Cairo, Egypt, 1190, in, e.g., Moses Maimonides. The Guide for the Perplexed, translated by Michael Friedländer, pages 352–54. New York: Dover Publications, 1956. Maimonides taught that the object of the Sabbath (mentioned in ) was the rest that it affords. One-seventh of the life of every person, small or great, passes in comfort and rest from trouble and exertion. In addition, the Sabbath perpetuates remembrance of the Creation.Maimonides, The Guide for the Perplexed, part 3, chapter 43, in, e.g., Moses Maimonides, The Guide for the Perplexed, translated by Michael Friedländer, page 352.", "According to Maimonides, Passover (mentioned in ) is kept seven days, because a week is the intermediate unit of time between a day and a month. Passover teaches people to remember the miracles that God performed in Egypt, encouraging people to thank God repeatedly and to lead a modest and humble life. Jews therefore eat unleavened bread and bitter herbs on Passover in memory of what happened to the Israelites. And they eat unleavened bread for a week because if the eating were only for one day, Jews might not notice it.Maimonides. The Guide for the Perplexed, part 3, chapter 43, in, e.g., Moses Maimonides, The Guide for the Perplexed, translated by Michael Friedländer, pages 352–53.", "Maimonides wrote that Jews likewise keep Rosh Hashanah (mentioned in ) for one day, for it is a day of repentance, on which Jews are stirred up from forgetfulness, and for this reason the shofar is blown on that day. According to Maimonides, Rosh Hashanah is a preparation for and an introduction to Yom Kippur, as is plain from the tradition about the days between Rosh Hashanah and Yom Kippur.Maimonides, The Guide for the Perplexed, part 3, chapter 43, in, e.g., Moses Maimonides. The Guide for the Perplexed, translated by Michael Friedländer, page 353.", "Maimonides taught that Sukkot (discussed in ), which is a feast of rejoicing and gladness, is kept seven days, so that the festival may be more noticeable. It is kept in the autumn because, as  says, it is \"When you have gathered in your labors out of the field,\" and thus when people can rest free from pressing labors. Maimonides cited the ninth book of Aristotle's Ethics for the proposition that harvest festivals were a general custom, quoting Aristotle to report, \"In ancient times, the sacrifices and assemblies of the people took place after the ingathering of the corn and the fruit, as if the sacrifices were offered on account of the harvest.\" Maimonides noted the temperate nature of autumn as another reason for Sukkot falling in that season, making it possible to dwell in booths free of great heat and troublesome rain. Maimonides taught that Sukkot reminds Jews of the miracles that God performed in the wilderness, once again to induced Jews to thank God and lead a modest and humble life. Jews thus leave their houses to dwell in sukkot, as inhabitants of deserts do, so as to remember that this had once been their condition, as reported in  \"I made the children of Israel to dwell in booths.\" And Jews join to Sukkot the Feast of Shemini Atzeret to complete in the comfort of their homes their rejoicings, which cannot be perfect in booths. Maimonides taught that the lulav and etrog symbolize the rejoicing that the Israelites had when they replaced the wilderness, which was in the words of  \"no place of seed, or of figs, or of vines, or of pomegranates, or of water to drink,\" with a country full of fruit trees and rivers. To remember this, Jews take the most pleasant fruit of the land, branches that smell best, most beautiful leaves, and also the best of herbs, that is, the willows of the brook. The four species joined in the lulav and etrog also were (1) plentiful in those days in the Land of Israel, so that everyone could easily get them, (2) of a good appearance, and in the case of the etrog and myrtle, excellent smell, and (3) keep fresh and green for seven days.Maimonides, The Guide for the Perplexed, part 3, chapter 43, in, e.g., Moses Maimonides. The Guide for the Perplexed, translated by Michael Friedländer, pages 353–54.", "*Maimonides. The Guide for the Perplexed, part 3, chapters 42, 46–47. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 351, 363, 365, 369. New York: Dover Publications, 1956. ."]}, {"page": "Matot", "response": ["*Maimonides. The Guide for the Perplexed, part 1, chapter 36; part 3, chapters 39, 40. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 51, 340, 344. New York: Dover Publications, 1956. ."]}, {"page": "Devarim (parashah)", "response": ["*Maimonides. The Guide for the Perplexed, part 1, chapters 18, 45; part 2, chapters 41, 47; part 3, chapter 50. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 27, 58–59, 235, 247–48, 383. New York: Dover Publications, 1956. ."]}, {"page": "Va'etchanan", "response": ["*Maimonides. The Guide for the Perplexed, Introduction; part 1, chapters 3, 18, 30, 36–37, 39, 42–43; part 2, chapters 5, 11, 30–31, 33, 39; part 3, chapters 9, 26–27, 29, 31–33, 39, 41, 48, 51–53. Cairo, Egypt, 1190. In, e.g., Moses Maimonides. The Guide for the Perplexed. Translated by Michael Friedländer, pages 3, 16–17, 28, 40, 50–51, 53–55, 57, 159, 168, 213, 219, 221–22, 231–32, 265, 310, 313, 320–21, 323, 325, 327, 339, 341, 345, 379, 386–87, 392–93. New York: Dover Publications, 1956."]}]}}