{"wiki_id": "http://www.wikidata.org/entity/Q3309464", "itemLabel": "Coco the Clown", "itemDescription": "Russian clown", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicolai_Poliakoff", "wikipedia_page": {"main": "Nicolai Poliakoff OBE (2 October 1900 – 25 September 1974; Latvian: Nikolajs Poļakovs; Russian: Николáй Петрóвич Полякóв) was the creator of Coco the Clown, arguably the most famous clown in the United Kingdom in the mid-20th century.", "link_mentions": [{"page": "Daugavpils", "response": ["*Nicolai Poliakoff OBE (1900–1974), creator of Coco the Clown"]}, {"page": "List of Latvians", "response": ["* Nikolajs Poļakovs (1900–1974) – circus performer; creator of Coco the Clown"]}, {"page": "Circus clown", "response": ["Notable examples of augustes in the circus history include Albert Fratellini, Lou Jacobs, Greg and Karen DeSanto, Coco the Clown, and Charlie Rivel.", "* Coco the Clown (Nicolai Poliakoff) - longtime star clown of the Bertram Mills Circus, after making a name for himself in his native Soviet Union as a master clown"]}, {"page": "List of clowns", "response": ["* Nicolai Poliakoff – Coco the Clown longtime star clown of the Bertram Mills Circus"]}, {"page": "TV Comic", "response": ["For the first decade of its existence, the publication was aimed explicitly at younger children. As well as Muffin the Mule (which ran for nearly 10 years—as the cover feature until 1955, then later as a half-page in black and white), other favourites from the 1950s that made appearances were Sooty, Coco the Clown, Noddy and Lenny the Lion. As the decade passed, so the comic began to acquire a slightly more \"grown-up\" feel, with stories such as Treasure Island, The Lone Ranger and Black Beauty all appearing for a time. Text stories also began to be featured, with religious themes such as \"Jesus and the Bible\".", "*Coco the Clown"]}, {"page": "Late Night Line-Up", "response": ["*Coco the Clown 17 October 1966"]}, {"page": "Michael Polakovs", "response": ["Michael Polakovs (23 February 1923 – 6 December 2009) was an American circus clown and actor, who performed in the US under the name of Coco the Clown, a moniker that his father, Nicolai Poliakoff, had made famous in Europe.", "Michael joined Billy Smart's Circus in 1951, and toured the US with the Mills Brothers Circus in 1953. He returned to the US in the late 1950s, performing under his father's name of Coco the Clown with the Ringling Bros. and Barnum & Bailey Circus. He was hired by the McDonald's fast-food chain in 1966 to revamp the character of Ronald McDonald, for whom he designed the outfit and make-up still in use today. Michael also appeared in the first eight television commercials featuring the new character."]}]}}