{"wiki_id": "http://www.wikidata.org/entity/Q3319086", "itemLabel": "William Alabaster", "itemDescription": "English poet, playwright, and religious writer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Alabaster", "wikipedia_page": {"main": "William Alabaster (also Alablaster, Arblastier) (27 February 1567 – buried 28 April 1640) was an English poet, playwright, and religious writer.Alabaster became a Roman Catholic convert in Spain when on a diplomatic mission as chaplain. His religious beliefs led him to be imprisoned several times; eventually he gave up Catholicism, and was favoured by James I. He received a prebend in St Paul's Cathedral, London, and the living of Therfield, Hertfordshire. He died at Little Shelford, Cambridgeshire.", "link_mentions": [{"page": "February 27", "response": ["*1567 – William Alabaster, English poet (d. 1640)"]}, {"page": "1567", "response": ["* February 27 – William Alabaster, English poet (d. 1640)"]}, {"page": "English Renaissance theatre", "response": ["*William Alabaster", "*William Alabaster"]}, {"page": "List of people educated at Westminster School", "response": ["*William Alabaster (1567–1640), poet"]}, {"page": "1640 in literature", "response": ["*April 28 (burial) – William Alabaster, English poet and playwright (born 1567)"]}, {"page": "1633 in literature", "response": ["*William Alabaster – Ecce sponsus venit"]}, {"page": "1632 in literature", "response": ["*William Alabaster – Roxana (Latin play, first performed in the 1590s, published)"]}, {"page": "1621 in literature", "response": ["*William Alabaster – De bestia Apocalypsis"]}, {"page": "1607 in literature", "response": ["*William Alabaster – Apparatus in Revelationem Jesu Christi"]}, {"page": "1599 in literature", "response": ["*Roger Fenton – An Answer to William Alabaster, His Motives"]}, {"page": "1595 in literature", "response": ["**William Alabaster, Roxana"]}, {"page": "1567 in literature", "response": ["*February 27 – William Alabaster, English poet, dramatist and religious writer (died 1640)"]}, {"page": "William Oughtred", "response": ["About 1628 he was appointed by the Earl of Arundel to instruct his son in mathematics. He corresponded with some of the most eminent scholars of his time, including William Alabaster, Sir Charles Cavendish, and William Gascoigne. He kept up regular contacts with Gresham College, where he knew Henry Briggs and Gunter."]}, {"page": "Oxford poetry anthologies", "response": ["Thomas Wyatt - Henry Howard, Earl of Surrey - Giles Fletcher - Edmund Spenser - Walter Ralegh - Fulke Greville - Philip Sidney - Arthur Gorges - George Chapman - Henry Constable - Samuel Daniel - Michael Drayton - Joshua Sylvester - William Shakespeare - John Davies of Hereford - Thomas Campion - William Alabaster - Barnabe Barnes - John Davies - John Donne - Richard Barnfield - Lord Herbert of Cherbury - William Drummond - Mary Wroth - William Browne - George Herbert - Thomas Carew - William Habington - Edmund Waller - John Milton - Charles Cotton - Philip Ayres - Aphra Behn - Thomas Edwards - Thomas Gray - Thomas Warton - William Cowper - Anna Seward - Charlotte Turner Smith - John Bampfylde - Mary Robinson - William Lisle Bowles - Helen Maria Williams - Thomas Russell - William Wordsworth - Samuel Taylor Coleridge - Mary Tighe - Robert Southey - Charles Lamb - Walter Savage Landor - Ebenezer Elliott - James Henry Leigh Hunt - George Gordon, Lord Byron - John Keble - Percy Bysshe Shelley - John Clare - George Darley - John Keats - Hartley Coleridge - Thomas Hood - William Barnes - Thomas Lovell Beddoes - Elizabeth Barrett Browning - Henry Wadsworth Longfellow - John Greenleaf Whittier - Charles Tennyson Turner - Edgar Allan Poe - Alfred Tennyson, Lord Tennyson - William Bell Scott - Robert Browning - William Edmondstoune Aytoun - Arthur Hugh Clough - Frederick Goddard Tuckerman - Matthew Arnold - William Cory - William Allingham - Sydney Dobell - George Meredith - Dante Gabriel Rossetti - Christina Rossetti - Samuel Butler - John Leicester Warren - Algernon Charles Swinburne - Augusta Webster - Wilfrid Scawen Blunt - Thomas Hardy - Robert Buchanan - Edward Dowden - Robert Bridges - Ada Cambridge - Gerard Manley Hopkins - Louisa Sarah Bevington - Michael Field - Alice Meynell - Digby Mackworth Dolben - William Ernest Henley - Philip Bourke Marston - Robert Louis Stevenson - Oscar Wilde - Agnes Mary Frances Robinson - Francis Thompson - Mary Coleridge - Laurence Hope - Rudyard Kipling - Arthur Symons - William Butler Yeats - Edwin Arlington Robinson - Robert Frost - Edward Thomas - Siegfried Sassoon - Rupert Brooke - Elizabeth Daryush - Robinson Jeffers - Edwin Muir - John Crowe Ransom - Kenneth Leslie - Archibald MacLeish - Edna St. Vincent Millay - Wilfred Owen - Sylvia Townsend Warner - Aldous Huxley - Robert Graves - Charles Hamilton Sorley - Edgell Rickword - Roy Campbell - Kenneth Slessor - Merrill Moore - Patrick Kavanagh - Norman Cameron - William Empson - W. H. Auden - Alec Derwent Hope - Paul Engle - Malcolm Lowry - Roy Fuller - George Barker - Weldon Kees - Dylan Thomas - Gavin Ewart - Charles Causley - Robert Lowell - John Heath-Stubbs - William Meredith - Edwin Morgan - Richard Wilbur - Donald Davie - Philip Larkin - Louis Simpson - James Merrill - Richard Murphy - Peter Porter - Anthony Thwaite - Derek Walcott - Alan Brownjohn - Alistair Elliott - Geoffrey Hill - George MacBeth - Fleur Adcock - Seamus Heaney - Michael Longley - Derek Mahon - Douglas Dunn - Eavan Boland - Susan Wicks - Christopher Reid - Paul Muldoon - Jane Draycott - Carol Ann Duffy - Alan Jenkins - Jamie McKendrick - Simon Armitage - Alice Oswald"]}, {"page": "The Clink", "response": ["* William Alabaster ~ 1597, John Gerard, S.J. (2012), The Autobiography of a Hunted Priest, Ignatius Press. Pages 308-309. poet and playwright."]}, {"page": "List of University of Cambridge people", "response": ["*William Alabaster (Trinity)"]}, {"page": "Christian poetry", "response": ["Even though Southwell was captured, tortured, convicted of high treason and executed at Tyburn in 1595, the underground priest-poet's illegal poetry helped inspire the Metaphysical poets, such as William Alabaster, John Donne, Richard Crashaw, and George Herbert, to write Christian religious poetry as well. "]}, {"page": "Alabaster William", "response": ["#redirectWilliam Alabaster"]}, {"page": "John Overall (bishop)", "response": ["He was briefly, in 1591–1592, vicar of Trumpington, a college living just outside Cambridge. In 1592, Sir Thomas Heneage, on behalf of Elizabeth I, created him vicar of Epping, Essex. In October 1595 he was appointed to the Crown living of Henton by Elizabeth, and in December 1595 Overall was appointed Regius Professor of Divinity at Cambridge. His election may have been a snub for Archbishop John Whitgift, who had adopted the Calvinistic Lambeth Articles. Overall, with Lancelot Andrewes, Samuel Harsnett, and others, had rejected these articles in support of Peter Baro, the Lady Margaret's Professor of Divinity, when on 12 January 1596 he attacked them from the pulpit. This opposition cost Baro his chair, as he failed to be re-elected in 1596. John Overall was also a friend to the erratic mystic William Alabaster (1568–1640), even throughout his years of imprisonment, and was the tutor to Robert Devereux, 2nd Earl of Essex at Trinity College. Perhaps Overall brought these two acquaintances together. Essex became Alabaster’s patron. In Alabaster’s Conversion we read:"]}, {"page": "1567 in poetry", "response": ["* February 27 – William Alabaster (died 1640), English poet"]}, {"page": "Valentin Schindler", "response": ["He is known for his dictionary \"Lexicon Pentaglotton: Hebraicum, Chaldicum, Syriacum, Talmudico-Rabbinicum, et Arabicum\", in which the vocabulary of Hebrew and of four other Semitic languages is translated to Latin.Lexicon Pentaglotton, Hebraicum, Chaldicum, Syriacum, Talmudico-Rabbinicum, et Arabicum, by Valentin Schindler, year 1612. It was published posthumously in 1612, one year before the 1613 Arabic-Latin lexicon of Franciscus Raphelengius. An abridgement was published in 1637 by William Alabaster."]}, {"page": "Rede Lecture", "response": ["*1593 William Alabaster"]}, {"page": "1640 in England", "response": ["* 28 April (bur.) – William Alabaster, poet and dramatist (born 1567)"]}, {"page": "1560s in England", "response": ["** 27 February – William Alabaster, poet (died 1640)"]}, {"page": "1595 in poetry", "response": ["* William Alabaster, Roxana, tragædia (approximate date)"]}, {"page": "1640 in poetry", "response": ["* April 28 (bur.) – William Alabaster (born 1567), English poet and playwright"]}, {"page": "Thomas Beard", "response": ["In 1628, when Richard Neile went before the House of Commons of England accused of anti-puritan practices, Beard was summoned as a witness against him. Cromwell's speech in the debate on the subject covers his likely testimony (the parliament was dissolved before Beard could testify). Beard had been appointed in 1617 to preach a sermon on the Sunday after Easter in London, in which, according to custom, he was to recapitulate three sermons previously preached before the lord mayor from an open pulpit in Spital Square. William Alabaster was the preacher whom Beard had to follow, but he announced his intention of exposing Alabaster's support of certain tenets of popery. On Cromwell's account, Neile as Beard's diocesan bishop (diocese of Lincoln) told him not to preach against Alabaster; and reprimanded him later when on the advice of Nicholas Felton he did so."]}, {"page": "Roger Fenton (priest)", "response": ["Fenton's first work, An Answer to William Alablaster his Motives, was published in 1599, noting that William Alabaster was then a prisoner in the Tower of London."]}, {"page": "Alabaster (surname)", "response": ["* William Alabaster (1567–1640) poet, playwright, and religious writer"]}, {"page": "Alabaster, William", "response": ["#redirectWilliam Alabaster"]}]}}