{"wiki_id": "http://www.wikidata.org/entity/Q33187039", "itemLabel": "Andrew Rodger Waterston", "itemDescription": "Scottish zoologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Rodger_Waterston", "wikipedia_page": {"main": "Dr Andrew Rodger Waterston FRSE FRES (born Ollaberry, 30 March 1912, died Edinburgh, 12 July 1996) was a Scottish zoologist, specialising in malacology and entomology. He was interested in the insect fauna of the Middle East and in the fauna of the Outer Hebrides. He was generally known as Rodger Waterston.", "link_mentions": [{"page": "List of malacologists", "response": ["*Andrew Rodger Waterston (1912–1996) Great Britain"]}, {"page": "Waterston (disambiguation)", "response": ["* Andrew Rodger Waterston (1912-1996) Scottish zoologist and son of James Waterston (entomologist)"]}, {"page": "Ollaberry", "response": ["Andrew Rodger Waterston FRSE (1912–1996) was born and raised in Ollaberry, the son of Rev James Waterston minister of the United Free Church of Scotland."]}, {"page": "1952 Birthday Honours", "response": ["* Andrew Rodger Waterston, Entomological Adviser to the Development Division of the British Middle East Office, Beirut."]}, {"page": "James Waterston (entomologist)", "response": ["In 1917 Waterston joined the Imperial Bureau of Entomology to study the Hymenoptera of the superfamily Chalcidoidea. He was temporarily commissioned in the Royal Army Medical Corps in May 1917 and served as entomologist to the Malaria Commission at Thessaloniki, Greece, with the rank of captain. In May 1920 he joined the staff of the British Museum, Natural History as Assistant Keeper, First Class, in the Department of Entomology. His main areas of work as a taxonomist were the Chalcidoidea, Mallophaga, or bird lice, and Siphonaptera, or fleas. He died, soon after a major operation, on 28 April 1930 in London. His son, Andrew Rodger Waterston (1912–1996) was also a noted entomologist and malacologist and was, like his father, a curator at Department of Entomology at the British Museum, Natural History."]}, {"page": "Morris Young (entomologist)", "response": ["Morris Young FES (1822–1897) was a Scottish naturalist and entomologist. He was the first curator of Paisley Free Library and Museum. Although his main interest was in Entomology, and in particular the rove beetles of the family Staphylinidae, he was however very knowledgeable in most branches of natural history as well as being a skilled illustrator and taxidermist. Before being appointed as curator of the museum he was a schoolmaster in Paisley. In the period before the opening of the Museum in 1871 he coordinated the collection of over 2000 beetle specimens as well as many hundreds of other insects and spiders, as Convener of the Entomology section of the Paisley Philosophical Institution. These collections were added to during the 25 years he was in post as Curator, and they are still in their original cases.  During the Second World War Andrew Rodger Waterston worked on these collections."]}]}}