{"wiki_id": "http://www.wikidata.org/entity/Q3317017", "itemLabel": "Misty Oldland", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Misty_Oldland", "wikipedia_page": {"main": "Misty Oldland (born Michele Oldland) is a British-Swiss singer-songwriter, best known for her 1994 singles \"A Fair Affair (Je T'Aime)\" and \"Got Me a Feeling\", a duet with soul singer Omar Lye-Fook.She has had three of her singles reach the UK Singles Chart. She has had top 10 singles across Europe and Japan, most notably in France, where album, Supernatural, topped the charts for six months, and Iceland where it was number 1. Misty Oldland's songs have been covered by artists including Ophélie Winter (France), Kate Ceberano (Australia), Bonnie Pink (Japan).\nOldland presented the 'Soul of MTV' and co-founded soul and hip-hop club 'Slow Motion' with video director and former partner Jake Nava – listed in the ‘Top ten night clubs in Britain’ by The Sunday Times Magazine.\nIn 2006, she was named 'A Woman of Achievement' by Woman of The Year for self-releasing album 'Forest Soul' which sampled the sounds of endangered animals, and featured musical collaborations with co-producer Joe Dworniak and artists Roachford, Cleveland Watkiss, Tunde Jegede, Faye Simpson, Nikki Brown, Glen Nightingale and HKB Finn. Created to raise awareness for rainforest conservation, Forest Soul was the first carbon neutral CD sleeve to use vegetable ink and a waterless printing method as well as the first 100% recycled LP sleeve. Misty's single Orange Fox was packaged in a 'sing-along' book for children with animated video.\nOldland credits recent success to Dame Anita Roddick MBE and Gordon Roddick of The Body Shop Foundation, who mentored her in ethical business and funded ‘Forest Soul’. \nMisty contributed a chapter about the music business to Anita's book ‘A Revolution in Kindness’ and is currently developing a musical book & TV series for children called 'The Golden Seed'.\nIn between writing and composing, Oldland works behind the scenes to create campaigns with a host of NGO's and social and environmental activists. She was part of the original think tank behind the creation of 38 Degrees and has collaborated with the Green Party, Greenpeace, Trees Have Rights, eradicatingecocide.com, The Ecologist, Polly Higgins, Tamsin Omond, The Inga Foundation and Climate Rush.\nMisty's ancestry is Northern European (Irish Scottish Welsh) French, Swiss, Italian, North African and Spanish.", "link_mentions": [{"page": "Misty", "response": ["* Misty Oldland, British-Swiss singer-songwriter"]}, {"page": "Je t'aime... moi non plus", "response": ["Je t'aime has been sampled in many other songs, including: \"A Fair Affair (Je T'Aime)\" by Misty Oldland; \"Guitar Song\" by Texas, and a version of \"Breathe\" in Kylie Minogue's 2003 Money Can't Buy concert at the Hammersmith Apollo in London."]}, {"page": "Omar Lye-Fook", "response": ["*Misty Oldland"]}, {"page": "Chickenshed", "response": ["# \"Still Waters\" - Misty Oldland"]}, {"page": "A Fair Affair (Je T'Aime)", "response": ["\"A Fair Affair (Je T'Aime)\" is a 1994 song by British-Swiss singer-songwriter Misty Oldland, released as the second single from her debut album, Supernatural. It was a number five hit in Iceland, while peaking at number ten in the Netherlands and number 20 in France. The song samples \"Je t'aime... moi non plus\" by Serge Gainsbourg. The accompanying music video was directed by British director Jake Nava. "]}]}}