{"wiki_id": "http://www.wikidata.org/entity/Q33186406", "itemLabel": "Karen Cargill", "itemDescription": "Scottish mezzo-soprano", "wikipedia_url": "https://en.wikipedia.org/wiki/Karen_Cargill", "wikipedia_page": {"main": "Karen Cargill is a Scottish operatic mezzo-soprano singer. She has performed with the Metropolitan Opera and at the Edinburgh International Festival.", "link_mentions": [{"page": "Hector Berlioz", "response": ["In addition to Davis's versions, Les Troyens has received studio recordings under Charles Dutoit and John Nelson; Nelson and Daniel Barenboim have recorded versions of Béatrice et Bénédict, and Nelson and Roger Norrington have conducted Benvenuto Cellini for CD. Singers who have recorded Les Nuits d'été include Victoria de los Ángeles, Leontyne Price, Janet Baker, Régine Crespin, Jessye Norman and Kiri Te Kanawa,Cairns (2006), p. 3 and more recently, Karen Cargill and Susan Graham. and "]}, {"page": "La damnation de Faust", "response": ["Bryan Hymel, Karen Cargill, Christopher Purves, Gábor Bretz"]}, {"page": "Grammy Award for Best Opera Recording", "response": ["* Yannick Nézet-Séguin (conductor); Karen Cargill, Isabel Leonard, Karita Mattila, Erin Morley & Adrianne Pieczonka (soloists); David Frost (producer) - Poulenc: Dialogues des Carmélites  "]}, {"page": "Royal Conservatoire of Scotland", "response": ["*Karen Cargill"]}, {"page": "Valery Gergiev", "response": ["Karen Cargill, mezzo-soprano"]}, {"page": "National Youth Choir of Scotland", "response": ["The National Girls Choir was formed in 2007. 80 singers between the ages of 12 and 16 were selected by audition from Scotland.  The daily timetable was a mixture of vocal coaching, musicianship training and full choir rehearsals. They performed their first concert in the Queen's Hall in Edinburgh in April 2007. In 2010, the choir formed another section, the National Girls Training Choir. It offers girls who audition successfully, but whose voices are not yet ready for National Girls Choir, places on the National Girls Choir course. The patron of the National Girls Choir is Scottish mezzo-soprano Karen Cargill."]}, {"page": "Prix de Rome cantatas (Berlioz)", "response": ["*Cléopâtre (with Les Nuits d'été): Karen Cargill, Scottish Chamber Orchestra, Robin Ticciati cond. (Linn, rec. 04/2012)", "*Cléopâtre (with Harold en Italie): Karen Cargill, London Symphony Orchestra, Valeriĭ Gergiev cond. (LSO Live, rec. 11/2013)"]}, {"page": "Metropolitan Opera Live in HD", "response": ["* Dialogues des Carmélites (Isabel Leonard, Adrianne Pieczonka, Karita Mattila, Karen Cargill, conducted by Yannick Nézet-Séguin), broadcast on May 11, 2019"]}, {"page": "Simon Lepper", "response": ["Some of the singers he has enjoyed recital partnerships with included Dame Felicity Palmer, Stéphane Degout, Sally Matthews, Karen Cargill, Angelika Kirchschlager, Mark Padmore, Christopher Purves, Nicky Spence, Christiane Karg, Ilker Arcayürek, Benjamin Appl, Soraya Mafi, Stephan Loges, Nicole Cabell, Gillian Keith. He also works with German violinist Carolin Widmann. Their recording of Xenakis, Feldmann, Schoenberg and Zimmerman for ECM records received a Diapason d'or."]}, {"page": "Cargill (surname)", "response": ["*Karen Cargill, a Scottish operatic mezzo-soprano singer"]}, {"page": "Maria Radner", "response": ["Scottish mezzo-soprano Karen Cargill summarized \"Maria Radner, my beloved friend\" in The Guardian: \"She was the most generous-spirited person I have ever met. Hysterical laughter, an obsession with all things Burberry, unadulterated passion for Bayern Munich and the warmest of hugs were things you could always be guaranteed of when you were with her. Her son and partner were her whole life.\" Further down Cargill qualified the latter, in that \"Music was Maria's entire life until she met her partner and they had their son.\""]}, {"page": "Hester Dickson Martineau", "response": ["On the first anniversary of her death, a concert was held in celebration of her life at the Queen's Hall in Edinburgh. The concert featured John Mark Ainsley, Lorna Anderson, Katie Bird, Karen Cargill, Nigel Cliffe, Rebecca Evans, Warren Gillespie, Janis Kelly, Jamie MacDougall, Patricia MacMahon, Ann Murray, Christopher Nairne, Linda Ormiston, Nicky Spence, Damien Thantrey, and Catherine Wyn-Rogers. The orchestra was directed by Tim Dean and led by Ruth Crouch, and organised by her son Malcolm."]}, {"page": "Les Troyens discography", "response": ["| 2013 ||Bryan Hymel,Dwayne Croft,Richard Bernstein,Kwangchul Youn,Eric Cutler,Paul Appleby,Julie Boulianne,Deborah Voigt,Susan Graham,Karen Cargill"]}, {"page": "64th Annual Grammy Awards", "response": ["** Poulenc: Dialogues Des Carmélites (Yannick Nézet-Séguin, Isabel Leonard, Erin Morley, Adrianne Pieczonka, Karita Mattila, Karen Cargill, Metropolitan Opera Chorus and Orchestra) (A)", "** Yannick Nézet-Séguin, conductor; Karen Cargill, Isabel Leonard, Karita Mattila, Erin Morley and Adrianne Pieczonka; David Frost, producer (The Metropolitan Opera Orchestra; The Metropolitan Opera Chorus)"]}]}}