{"wiki_id": "http://www.wikidata.org/entity/Q332347", "itemLabel": "John Profumo", "itemDescription": "British politician (1915-2006)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Profumo", "wikipedia_page": {"main": "John Dennis \"Jack\" Profumo, CBE, OBE (Mil.) ( prə-FEW-moh; 30 January 1915 – 9 March 2006) was a British politician whose career ended in 1963 after a sexual relationship with the 19-year-old model Christine Keeler in 1961. The scandal, which became known as the Profumo affair, led to his resignation from the Conservative government of Harold Macmillan.\nAfter his resignation Profumo worked as a volunteer at Toynbee Hall, a charity in East London, and became its chief fundraiser. These charitable activities helped to restore his reputation and he was appointed a Commander of the Order of the British Empire (CBE) in 1975.", "link_mentions": [{"page": "List of political scandals in the United Kingdom", "response": ["* Profumo affair (1963): Secretary of State for War John Profumo had an affair with Christine Keeler (to whom he had been introduced by pimp and drug-dealer Stephen Ward) who was having an affair with a Soviet spy at the same time."]}, {"page": "Ian McKellen", "response": ["McKellen starred in the British drama Scandal a fictionalised account of the Profumo affair that rocked the government of British prime minister Harold Macmillan. McKellen portrayed John Profumo. The film starred Joanne Whalley, and John Hurt. The film premiered at the 1989 Cannes Film Festival and competed for the Palme d'Or."]}, {"page": "January 30", "response": ["*  1915   – John Profumo, English soldier and politician, Secretary of State for War (d. 2006)"]}, {"page": "June 5", "response": ["*1963 – The British Secretary of State for War, John Profumo, resigns in a sex scandal known as the \"Profumo affair\"."]}, {"page": "March 9", "response": ["*  2006   – John Profumo, English soldier and politician, Secretary of State for War (b. 1915)"]}, {"page": "Privy Council of the United Kingdom", "response": ["Individuals can choose to resign, sometimes to avoid expulsion. Three members voluntarily left the Privy Council in the 20th century: John Profumo, who resigned on 26 June 1963; John Stonehouse, who resigned on 17 August 1976 and Jonathan Aitken, who resigned on 25 June 1997 following allegations of perjury."]}, {"page": "Screaming Lord Sutch", "response": ["In the 1960s Sutch stood in parliamentary elections, often as representative of the National Teenage Party. His first was in 1963, when he contested the by-election in Stratford-upon-Avon caused by the resignation of John Profumo. He gained 208 votes. His next was at the 1966 general election when he stood in Harold Wilson's Huyton constituency. Here he received 585 votes."]}, {"page": "1915", "response": ["** John Profumo, British politician (d. 2006)"]}, {"page": "2006", "response": ["** John Profumo, British politician (b. 1915)"]}, {"page": "Stratford-upon-Avon", "response": ["* Former Secretary of State for War John Profumo was the Member of Parliament (MP) for Stratford-upon-Avon 1950–1963."]}, {"page": "Quintin Hogg, Baron Hailsham of St Marylebone", "response": ["In June 1963 when his fellow Minister John Profumo had to resign after admitting lying to Parliament about his private life, Hailsham attacked him savagely on television. The Labour MP Reginald Paget called this \"a virtuoso performance of the art of kicking a friend in the guts\". He added, \"When self-indulgence has reduced a man to the shape of Lord Hailsham, sexual continence involves no more than a sense of the ridiculous\"."]}, {"page": "Harold Macmillan", "response": ["The Profumo affair of 1963 permanently damaged the credibility of Macmillan's government. The revelation of the affair between John Profumo (Secretary of State for War) and an alleged call-girl, Christine Keeler, who was simultaneously sleeping with the Soviet naval attache Captain Yevgeny Ivanov made it appear that Macmillan had lost control of his government and of events in general.Goodlad & Pearce, 2013 p.180 In the ensuing Parliamentary debate he was seen as a pathetic figure, while Nigel Birch declared, in the words of Browning on Wordsworth, that it would \"Never (be) Glad Confident Morning Again\".Sandford 2005, p. 664  On 17 June 1963, he survived a Parliamentary vote with a majority of 69, one fewer than had been thought necessary for his survival, and was afterwards joined in the smoking-room only by his son and son-in-law, not by any Cabinet minister. However, Butler and Reginald Maudling (who was very popular with backbench MPs at that time) declined to push for his resignation, especially after a tide of support from Conservative activists around the country. Many of the salacious revelations about the sex lives of \"Establishment\" figures during the Profumo affair damaged the image of \"the Establishment\" that Macmillan was seen as a part of, giving him the image by 1963 of a \"failing representative of a decadent elite\"."]}, {"page": "That Was the Week That Was", "response": ["The programme is considered a significant element of the satire boom in the UK in the early 1960s, as it broke ground in comedy by lampooning political figures. Its broadcast coincided with coverage of the politically charged Profumo affair, and John Profumo became a figure of derision. TW3 was broadcast from Saturday, 24 November 1962 through late December 1963. An American version under the same title aired on NBC from 1964 to 1965, also featuring Frost."]}, {"page": "Profumo affair", "response": ["thumb|upright= 1.3|John Profumo in 1960, at his desk as Secretary of State for War", "The Profumo affair was a major scandal in twentieth-century British politics. John Profumo, the Secretary of State for War in Harold Macmillan's Conservative government, had an extramarital affair with 19-year-old model Christine Keeler beginning in 1961. Profumo denied the affair in a statement to the House of Commons, but weeks later a police investigation exposed the truth, proving that Profumo had lied to the House of Commons. The scandal severely damaged the credibility of Macmillan's government, and Macmillan resigned as Prime Minister in October 1963, citing ill health. Ultimately, the fallout contributed to the Conservative government's defeat by the Labour Party in the 1964 general election.", "John Profumo was born in 1915, of Italian descent. He first entered Parliament in 1940 as the Conservative member for Kettering, while serving with the Northamptonshire Yeomanry, and combined his political and military duties through the Second World War. Profumo lost his seat in the 1945 general election, but was elected in 1950 for Stratford-on-Avon. From 1951 he held junior ministerial office in successive Conservative administrations. In 1960, Macmillan promoted Profumo to Secretary of State for War, a senior post outside the cabinet.  After his marriage in 1954 to Valerie Hobson, one of Britain's leading film actresses, Profumo may have conducted casual affairs, using late-night parliamentary sittings as his cover.Davenport-Hines, p. 59 His tenure as war minister coincided with a period of transition in the armed forces, involving the end of conscription and the development of a wholly professional army. Profumo's performance was watched with a critical eye by his opposition counterpart George Wigg, a former regular soldier.Davenport-Hines, p. 66Knightley and Kennedy, pp. 93–94"]}, {"page": "Valerie Hobson", "response": ["Valerie Hobson (born Babette Louisa Valerie Hobson, 14 April 1917 – 13 November 1998) was an Irish-born actress who appeared in a number of films during the 1930s, 1940s and 1950s. Her second husband was John Profumo, a government minister who became the subject of a sensational sex scandal in 1963.", "In 1952 she divorced her first husband, film producer Anthony Havelock-Allan (1904–2003). In 1954, she married Brigadier John Profumo (1915–2006), a Member of Parliament (MP), giving up acting shortly afterwards. Profumo was a prominent politician of Italian descent."]}, {"page": "Christine Keeler", "response": ["Christine Margaret Keeler (22 February 1942 – 4 December 2017) was an English model and showgirl. Her meeting at a dance-club with society osteopath Stephen Ward drew her into fashionable circles. At the height of the Cold War, she became sexually involved with a married government minister, John Profumo, as well as with a Soviet naval attaché, Yevgeny Ivanov.  A shooting incident between two of her other lovers caused the press to investigate her, revealing that her affairs could be threatening national security. In the House of Commons, Profumo denied any improper conduct but later admitted that he had lied.", "On the weekend of 8–9 July 1961, Ward introduced Keeler to John Profumo, the Secretary of State for War, at a pool party at Cliveden, the Buckinghamshire mansion owned by the 3rd Viscount Astor. Profumo began a brief affair with Keeler. The exact length of the affair is disputed. It either ended in August 1961, after Profumo was warned by the security services of the possible dangers of mixing with the Ward circle, or it continued with decreasing fervour until December 1961. Among Ward's other friends, whom Profumo briefly met, was the Soviet naval attaché and GRU officer, Yevgeny Ivanov. According to Keeler, she and Ivanov had a short sexual relationship.", "In the summer of 1963, \"Christine\", a pop single by Joyce Blair, released under the pseudonym 'Miss X', which parodied Keeler's involvement with John Profumo, reached No.37 in the U.K. singles chart despite being banned from airplay by the BBC due its subject matter."]}, {"page": "Mandy Rice-Davies", "response": ["At Murray's Cabaret Club she met Christine Keeler, who introduced her to her friend, the well-connected osteopath Stephen Ward, and to an ex-lover, the slum landlord Peter Rachman.Shirley Green (1979) Rachman. London, Michael Joseph: 159 Rice-Davies became Rachman's mistress and was set up in the house in which he had previously kept Keeler, 1 Bryanston Mews West, Marylebone. Rice-Davies often visited Keeler at the house she shared with Ward at Wimpole Mews, Marylebone, and, after Keeler had moved elsewhere, lived there herself, between September and December 1962. On 14 December 1962, while Keeler was visiting Rice-Davies at Wimpole Mews, one of Keeler's boyfriends, John Edgecombe, attempted to enter and fired a gun several times at the door.Ludovic Kennedy (1964) The Trial of Stephen Ward: 10 His trial brought attention to the girls' involvement with Ward's social set, and intimacy with many powerful people, including Viscount Astor at whose stately home of Cliveden Keeler met the War Minister John Profumo. Profumo's brief relationship with Keeler was the centre of the affair that caused him to resign from the government in June 1963, though Rice-Davies herself never met him.David Profumo (2006) Bringing the House Down"]}, {"page": "Secretary of State for War", "response": ["In the nineteenth century the post was twice held by future prime minister Henry Campbell-Bannerman. At the outset of the First World War, prime minister H. H. Asquith was filling the role, but he quickly appointed Lord Kitchener, who became famous while in this position for Lord Kitchener Wants You. He was replaced by David Lloyd George, who went on to become prime minister. Between the World Wars, the post was held by future prime minister Winston Churchill for two years. In the 1960s, John Profumo was filling this post at the time of the Profumo affair.", "| rowspan=2|John Profumo"]}, {"page": "Stephen Ward", "response": ["Stephen Thomas Ward (19 October 1912 – 3 August 1963) was an English osteopath and artist who was one of the central figures in the 1963 Profumo affair, a British political scandal which brought about the resignation of John Profumo, the Secretary of State for War, and contributed to the defeat of the Conservative government a year later.", "In 1959, Ward met Christine Keeler, a 17-year-old showgirl who was working at Murray's Cabaret Club in Beak Street, Soho. Captivated by his charm, she agreed to move in with him, although their relationship was not sexual, merely platonic. She stayed with him, on and off, for the next several years and often spent time at the riverside cottage. During the weekend of 8–9 July 1961, Keeler was among several guests at the cottage with Ward. At the main house, among a large gathering from the worlds of politics and the arts, was John Profumo, the Secretary of State for War, and his wife, the actress Valerie Hobson."]}, {"page": "We Didn't Start the Fire", "response": ["*British politician sex: British Secretary of State for War John Profumo has a scandalous sexual relationship with showgirl Christine Keeler."]}, {"page": "Cliveden", "response": ["In 1957, the cottage came to the attention of London osteopath Stephen Ward, who had been hired to treat Bill Astor. He leased the cottage from the Astors for a minimal rent for use as a weekend retreat.Crathorne 1995, p. 184 Among the guests invited to stay there were Christine Keeler and Mandy Rice-Davies. A chance meeting in 1961 between Keeler and cabinet minister John Profumo (a guest of the Astors) at the Cliveden swimming pool led to the Profumo affair which so damaged the Macmillan government.Crathorne 1995, p. 185", "* Coates, Tim, The Scandal of Christine Keeler and John Profumo: Lord Denning's Report 1967, London, 2003."]}, {"page": "British European Airways Flight 548", "response": ["* Captain Stanley Key pictured (bottom right) at a BALPA party on 7 December 1955 talking to John Profumo, in a 1955 Flight news item "]}, {"page": "Selwyn Lloyd", "response": ["Lloyd became a popular figure with Conservative Party members after travelling the country in the bitter winter of 1962-3 (the worst since 1946-7) to write his report on party organisation.Thorpe 2010, p. 564. Ferdinand Mount writes that northerners recognised Selwyn as \"one of their own, someone who had gone to London but had not become in the least stuck up and who never pretended to be someone he wasn't\".Mount 2009, p. 255. Macmillan later compared Lloyd to Augustine Birrell for his links to the nonconformist vote of North West England.Thorpe 2010, p. xiv. At Huddersfield he had to give a non-committal reply when Andrew Alexander, then City Editor of The Yorkshire Post, attacked Macmillan's profligate economic policy.Mount 2009, p. 253. His report, urging the proper provision of paid agents in marginal seats, was published in June 1963 so was overshadowed by the Profumo scandal. Lloyd asked John Profumo whether he had had an affair with Christine Keeler, and passed on his denial to Macmillan, adding his own opinion that he did not see how \"Jack\" could have had the time.Davenport-Hines 2013, p. 269.Mount 2009, p. 258."]}, {"page": "List of MPs elected in the 1950 United Kingdom general election", "response": ["|John Profumo"]}, {"page": "Andrew Faulds", "response": ["Faulds first stood for Parliament as the Labour candidate in the 1963 Stratford by-election, caused by the resignation of John Profumo over a security scandal. He fought the constituency again in the general election the following year, but on both occasions he was beaten by the Conservative future Cabinet minister Angus Maude."]}, {"page": "Gerda Munsinger", "response": ["The affair became public in March 1966 when Minister of Justice Lucien Cardin mentioned Munsinger's name during a debate in Parliament, in response to comments from the Conservatives about security problems in the Liberal government of Lester B. Pearson. The Liberals had been made aware of the affair two years earlier during a review of security cases involving senior government officials; Pearson had opted to not publicize it, and had instructed his cabinet ministers not to discuss it. The media heard about Cardin's comments in the House of Commons and began circulating rumours that \"Monsignor\" was a Québécois priest/mobster. Despite being told by Pearson not to say anything further, Cardin disclosed during a press conference that \"Olga\" Munsinger had been involved with Conservative politicians; he compared the incident to the affair between John Profumo and Christine Keeler in the UK. One news report later concluded that \"a blond playgirl... has thrust Parliament into a state of suspended degradation\"."]}, {"page": "Robert McKenzie (psephologist)", "response": ["McKenzie also famously interviewed Lord Hailsham on the BBC programme Gallery in 1963, asking questions on the then recent scandal involving Conservative cabinet minister John Profumo. Hailsham became increasingly fractious as the interview progressed regarding McKenzie's line of questioning, even though Hailsham was strongly critical of Profumo's conduct."]}, {"page": "Toynbee Hall", "response": ["* 1982–5 John Profumo", "*John Profumo dedicated much of his time to the Hall from the 1960s onwards after the Profumo affair forced him out of politics."]}, {"page": "Censorship in the United Kingdom", "response": ["* In 1963, in the Profumo affair, the government instituted criminal proceedings against Stephen Ward to stifle press comment under the sub judice rule concerning the sexual relationship between the War Minister John Profumo and Christine Keeler, who was having a sexual relationship with Yevgeny Ivanov, a Soviet Naval Attache and alleged spy."]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["Seven Privy Counsellors have resigned during Queen Elizabeth's reign—John Profumo (1963) after misleading the House of Commons, and four others upon criminal conviction carrying a sentence of imprisonment,  John Stonehouse (1976),  Jonathan Aitken (1997) Chris Huhne (2013) and Denis MacShane (2013); one, Elliot Morley (2011)  was expelled (the first expulsion since 1921). Additionally, Lord Prescott, the former Deputy Prime Minister, resigned in 2013 in protest over politicisation of handling of a press complaints charter being considered by the Council. Sir Seamus Treacy, a Lord Justice of Appeal in Northern Ireland, resigned shortly after his appointment in 2018.", "*John Profumo (1915–2006) (resigned 1963)"]}]}}