{"wiki_id": "http://www.wikidata.org/entity/Q332412", "itemLabel": "Tony Benn", "itemDescription": "British Labour Party politician (1925–2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Benn", "wikipedia_page": {"main": "Anthony Neil Wedgwood Benn (3 April 1925 – 14 March 2014; known between 1960 and 1963 as Viscount Stansgate) was a British politician, writer and diarist who served as a Cabinet minister in the 1960s and 1970s. A member of the Labour Party, he was Member of Parliament for Bristol South East and Chesterfield for 47 of the 51 years between 1950 and 2001. He later served as President of the Stop the War Coalition from 2001 to 2014.\nThe son of a Liberal and later Labour Party politician, Benn was born in Westminster and privately educated at Westminster School. He was elected for Bristol South East at the 1950 general election but inherited his father's peerage on his death, which prevented him from continuing to serve as an MP. He fought to remain in the House of Commons and campaigned for the ability to renounce the title, a campaign which succeeded with the Peerage Act 1963. He was an active member of the Fabian Society and served as Chairman from 1964 to 1965. He served in the Labour government of Harold Wilson from 1964 to 1970 first as Postmaster General, where he oversaw the opening of the Post Office Tower, and later as Minister of Technology.\nBenn served as Chairman of the National Executive Committee from 1971 to 1972 while in opposition. In the Labour government of 1974–1979, he returned to the Cabinet as Secretary of State for Industry and subsequently served as Secretary of State for Energy. He retained that post when James Callaghan succeeded Wilson as Prime Minister. When the Labour Party was in opposition through the 1980s, he emerged as a prominent figure on the left wing of the party and unsuccessfully challenged Neil Kinnock for the Labour leadership in 1988. After leaving Parliament at the 2001 general election, Benn was President of the Stop the War Coalition until his death in 2014.\nBenn was widely seen as a key proponent of democratic socialism and Christian socialism. Originally considered a moderate within the party, he was identified as belonging to its left wing after leaving ministerial office. The term \"Bennite\" came into usage as someone associated with left-wing politics. He was an influence on the politics of Jeremy Corbyn, who was elected Leader of the Labour Party a year after Benn's death, and John McDonnell, who served as Shadow Chancellor of the Exchequer under Corbyn.", "link_mentions": {}}}