{"wiki_id": "http://www.wikidata.org/entity/Q332979", "itemLabel": "Stephen Hammond", "itemDescription": "British politician (born 1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Hammond", "wikipedia_page": {"main": "Stephen William Hammond (born 4 February 1962) is a British Conservative Party politician who has served as the Member of Parliament (MP) for Wimbledon since 2005.\nOn 4 September 2012, Hammond was appointed Parliamentary Under-Secretary of State for Transport, with responsibility for buses, rail and shipping. He lost his ministerial post in the reshuffle on 15 July 2014 and was succeeded by Claire Perry. He became Vice Chairman of the Conservative Party for London on 20 July 2017 and was sacked the following 16 December after participating in a Brexit rebellion against the government of Theresa May three days earlier. Hammond was however appointed to be a Minister of State at the Department of Health and Social Care on 16 November 2018, following the promotion of Steve Barclay to the position of Secretary of State for Exiting the European Union. On 3 September 2019, he had the whip removed after voting for a bill ruling out leaving the European Union without a deal. However, on 29 October he was one of ten Conservative MPs to have the whip restored.\n\n", "link_mentions": [{"page": "European Free Trade Association", "response": ["In early 2018, British MPs Antoinette Sandbach, Stephen Kinnock and Stephen Hammond all called for the UK to rejoin EFTA."]}, {"page": "February 4", "response": ["*  1962   – Stephen Hammond, English banker and politician"]}, {"page": "Wimbledon, London", "response": ["It is now in the Parliamentary constituency of Wimbledon, and since 2005 has been represented by the Conservative MP Stephen Hammond.", "Since 2005, the north and west of the borough have been represented in Westminster by Stephen Hammond, a Conservative MP. The east and south of the Borough are represented by Siobhain McDonagh, a Labour MP."]}, {"page": "Theresa May", "response": ["In November 2017, May said the actions of Myanmar Army and police against the Rohingya Muslim minority in Myanmar \"looks like ethnic cleansing\".\"Theresa May vows to tackle 'inhuman destruction of Rohingya people'\". Sky News. 14 November 2017. According to May, \"it is something for which the Burmese authorities – and especially the military – must take full responsibility.\" From the 2017 general election to December 2017, May suffered no defeats in whipped votes in the House of Commons. On 13 December 2017, May lost a vote on the EU Withdrawal Bill by 309 votes to 305, due to 11 Conservatives voting against the government, including Stephen Hammond who was then vice-chairman of the Conservative Party."]}, {"page": "King Edward VI School, Southampton", "response": ["* Stephen Hammond, MP for Wimbledon"]}, {"page": "British Rail Class 170", "response": ["However, in March 2014 it was revealed that the nine Turbostars would move to Chiltern Railways. MP Stephen Hammond revealed on 12 March 2014 that all the Class 170/3s would remain with First TransPennine Express until the May 2015 timetable change, when Chiltern would take five of the 170s with the remaining four remaining with First TransPennine Express until the end of the franchise in March 2016 later changed to 8 July 2016. Upon delivery, the Class 170s were modified in Brush Traction to allow them to be used with Chiltern's existing  units, and were subsequently reclassified as Class 168/3s. Today, the unit numbers are 168321-168329."]}, {"page": "Bramley Line", "response": ["In March 2014 the route was declared by Stephen Hammond, the transport minister, to be a \"strategic priority\".  The project cost was considered to be between £35 and £52 million but the route was still felt to have the potential to be profitable, with up to 78,000 people expected to make the journey from Wisbech to Peterborough.BBC news: Hopes boosted for the reopening of the Wisbech line  In February 2015 David Cameron stated that he intended to \"have a proper look at Wisbech to March line and to see whether this can work. Infrastructure is a big part of our plan for the east of England.\"Wisbech Standard: VIDEO: Prime Minister David Cameron on the Wisbech to March rail line, votes for 16 year-olds, and shared council services"]}, {"page": "Woodhead Tunnel", "response": ["On 5 November 2013, it was decided to seal the Victorian tunnels, following a decision not to purchase them from National Grid. Transport Minister Stephen Hammond, said a new tunnel would be a better option if the route should ever be used again for rail traffic, and that the Hope Valley route had the capacity to accommodate foreseeable growth."]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Wimbledon || Stephen Hammond || Conservative || Roger Casale || Labour"]}, {"page": "Wimbledon (UK Parliament constituency)", "response": ["Wimbledon is a constituency represented in the House of Commons of the UK Parliament. Since 2005, the seat has been represented by Stephen Hammond of the Conservatives.", "| rowspan=\"3\" | Stephen Hammond"]}, {"page": "2005 United Kingdom general election", "response": ["|Stephen Hammond"]}, {"page": "List of Parliamentary constituencies in London", "response": ["|Stephen Hammond†"]}, {"page": "List of United Kingdom MPs: H", "response": ["*Stephen Hammond"]}, {"page": "First TransPennine Express", "response": ["However, in March 2014 it was announced that the nine Class 170 Turbostars would move to Chiltern Railways. MP Stephen Hammond revealed on 12 March 2014 that all the class 170/3s would remain with First TransPennine Express until the May 2015 timetable change."]}, {"page": "Stonebridge Railway", "response": ["In June 2013 a £240 million to £280 million plan was proposed to re-open the Stonebridge Railway in order to link Coventry and Birmingham Airport to an interchange station on the proposed High Speed 2 London-Birmingham line. As of January 2014, the proposal has the support of Bob Ainsworth and Christopher Pincher (Members of Parliament for Coventry North East and Tamworth), Paul Kehoe (chief executive of Birmingham Airport), Geoff Inskip, (chief executive of Centro), Birmingham City Council and Transport Minister Stephen Hammond."]}, {"page": "BioMarin Pharmaceutical", "response": ["In April 2019, the BBC reported that patients who took part in a trial treatment for the drug Kuvan (sapropterin hydrochloride) were later denied access to it. The company was criticised by the NHS and Stephen Hammond MP for patient profiteering. The company commented the following in response: \"BioMarin is disappointed that the NHS England has not recognised the value of treating PKU patients with Kuvan, despite more than a decade of positive patient outcomes across 26 countries in Europe, Russia and Turkey\""]}, {"page": "Conservative European Forum (CEF)", "response": ["Sir David Lidington is the current chair and Stephen Hammond is the current deputy chair. Flick Drummond and Liz Spencer are the current vice chairs. Amber Rudd is the president and Baroness Sugg, John Bowis, Dominic Grieve and Dirk Hazell are the current vice presidents."]}, {"page": "Stephen William Hammond", "response": ["#REDIRECT Stephen Hammond"]}, {"page": "Treasury Select Committee", "response": ["| Stephen Hammond MP", "| Stephen Hammond"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Stephen Hammond; MP for Wimbledon (2005–2019; 2019–present)"]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| Wimbledon||style=\"background-color: \"| ||Conservative||style=\"background-color: \"| ||Stephen Hammond (C)||Seat held"]}]}}