{"wiki_id": "http://www.wikidata.org/entity/Q332612", "itemLabel": "Mark Sykes", "itemDescription": "British politician, diplomatic advisor, and traveller (1879-1919)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Sykes", "wikipedia_page": {"main": "Colonel Sir Tatton Benvenuto Mark Sykes, 6th Baronet (16 March 1879 – 16 February 1919) was an English traveller, Conservative Party politician, and diplomatic advisor, particularly with regard to the Middle East at the time of the First World War.\nHe is associated with the Sykes–Picot Agreement, drawn up while the war was in progress regarding the partitioning of the Ottoman Empire by Britain, France and Russia, and was a key negotiator of the Balfour Declaration.", "link_mentions": [{"page": "Balfour Declaration", "response": ["Immediately following their declaration of war on the Ottoman Empire in November 1914, the British War Cabinet began to consider the future of Palestine; within two months a memorandum was circulated to the Cabinet by a Zionist Cabinet member, Herbert Samuel, proposing the support of Zionist ambitions in order to enlist the support of Jews in the wider war. A committee was established in April 1915 by British Prime Minister H. H. Asquith to determine their policy towards the Ottoman Empire including Palestine. Asquith, who had favoured post-war reform of the Ottoman Empire, resigned in December 1916; his replacement David Lloyd George favoured partition of the Empire. The first negotiations between the British and the Zionists took place at a conference on 7 February 1917 that included Sir Mark Sykes and the Zionist leadership. Subsequent discussions led to Balfour's request, on 19 June, that Rothschild and Chaim Weizmann submit a draft of a public declaration. Further drafts were discussed by the British Cabinet during September and October, with input from Zionist and anti-Zionist Jews but with no representation from the local population in Palestine.", "This Anglo-French treaty was negotiated in late 1915 and early 1916 between Sir Mark Sykes and François Georges-Picot, with the primary arrangements being set out in draft form in a joint memorandum on 5 January 1916. Sykes was a British Conservative MP who had risen to a position of significant influence on Britain's Middle East policy, beginning with his seat on the 1915 De Bunsen Committee and his initiative to create the Arab Bureau. Picot was a French diplomat and former consul-general in Beirut. Their agreement defined the proposed spheres of influence and control in Western Asia should the Triple Entente succeed in defeating the Ottoman Empire during World WarI, dividing many Arab territories into British- and French-administered areas. In Palestine, internationalisation was proposed, with the form of administration to be confirmed after consultation with both Russia and Hussein; the January draft noted Christian and Muslim interests, and that \"members of the Jewish community throughout the world have a conscientious and sentimental interest in the future of the country.\""]}, {"page": "Rudyard Kipling", "response": ["Kipling wrote the poem \"Ulster\" in 1912, reflecting his Unionist politics. Kipling often referred to the Irish Unionists as \"our party\".Gilmour, p. 241. Kipling had no sympathy or understanding for Irish nationalism, seeing Home Rule as an act of treason by the government of the Liberal Prime Minister H. H. Asquith that would plunge Ireland into the Dark Ages and allow the Irish Catholic majority to oppress the Protestant minority.Gilmour, pp. 242–244. The scholar David Gilmour wrote that Kipling's lack of understanding of Ireland could be seen in his attack on John Redmond – the Anglophile leader of the Irish Parliamentary Party who wanted Home Rule because he believed it was the best way of keeping the United Kingdom together – as a traitor working to break up the United Kingdom.Gilmour, p. 244. Ulster was first publicly read at an Unionist rally in Belfast, where the largest Union Jack ever made was unfolded. Kipling admitted it was meant to strike a \"hard blow\" against the Asquith government's Home Rule bill: \"Rebellion, rapine, hate, Oppression, wrong and greed, Are loosed to rule our fate, By England's act and deed.\" Ulster generated much controversy with the Conservative MP Sir Mark Sykes – who as a Unionist was opposed to the Home Rule bill – condemning Ulster in The Morning Post as a \"direct appeal to ignorance and a deliberate attempt to foster religious hate.\""]}, {"page": "Lawrence of Arabia (film)", "response": ["* Claude Rains as Mr. Dryden. Like Sherif Ali and Colonel Brighton, Dryden was an amalgamation of several historical figures, primarily Ronald Storrs, a member of the Arab Bureau, but also David George Hogarth, an archaeologist friend of Lawrence; Henry McMahon, the High Commissioner of Egypt who negotiated the McMahon-Hussein Correspondence which effectively trigged the Arab Revolt; and Mark Sykes, who helped draw up the Sykes–Picot Agreement which co-divided the post-war Middle East. Robert Bolt stated that the character was created to \"represent the civilian and political wing of British interests, to balance Allenby's military objectives.\" "]}, {"page": "Eleanor cross", "response": ["*The Sledmere Cross was erected in Sledmere, East Riding of Yorkshire, in 1896–8, commissioned by Sir Tatton Sykes and designed by Temple Lushington Moore. Sir Tatton's son, Sir Mark Sykes, later added engraved brasses to turn it into a war memorial."]}, {"page": "Nili", "response": ["For months, the group was not taken seriously by British intelligence, and attempts by Aaron Aaronsohn and Avshalom Feinberg to establish communication channels in Cairo and Port Said failed. Only after Aaronsohn arrived in London (by way of Berlin and Copenhagen) and owing to his reputation, was he able to obtain cooperation from the diplomat Sir Mark Sykes."]}, {"page": "Emirate of Transjordan", "response": ["Around the same time, another secret treaty was negotiated between the United Kingdom and France, with assent from the Russian Empire and Italy, to define their mutually agreed spheres of influence and control in an eventual partition of the Ottoman Empire. The primary negotiations leading to the agreement occurred between 23 November 1915 and 3 January 1916, on which date the British and French diplomats, Mark Sykes and François Georges-Picot, initialled an agreed memorandum. The agreement was ratified by their respective governments on 9 and 16 May 1916. The agreement allocated to Britain control of what is today southern Israel and Palestine, Jordan and southern Iraq, and an additional small area that included the ports of Haifa and Acre to allow access to the Mediterranean.Eugene Rogan, The Fall of the Ottomans, p.286 The Palestine region, with smaller boundaries than the later Mandatory Palestine, was to fall under an \"international administration\". The agreement was initially used directly as the basis for the 1918 Anglo–French Modus Vivendi which agreed on a framework for the Occupied Enemy Territory Administration in the Levant. Shortly after the war, the French ceded Palestine and Mosul to the British. The geographical area that was later to become Transjordan was allocated to Britain.Peter Gruber, (1991) Historical Dictionary of the Hashemite Kingdom of Jordan p 45-46."]}, {"page": "Spanish flu", "response": ["On 16 September 2008, the body of British politician and diplomat Sir Mark Sykes was exhumed to study the RNA of the flu virus in efforts to understand the genetic structure of modern H5N1 bird flu. Sykes had been buried in 1919 in a lead coffin which scientists hoped had helped preserve the virus. The coffin was found to be split and the cadaver badly decomposed; nonetheless, samples of lung and brain tissue were taken."]}, {"page": "Sykes–Picot Agreement", "response": ["The agreement was based on the premise that the Triple Entente would achieve success in defeating the Ottoman Empire during World War I and formed part of a series of secret agreements contemplating its partition. The primary negotiations leading to the agreement occurred between 23 November 1915 and 3 January 1916, on which date the British and French diplomats, Mark Sykes and François Georges-Picot, initialled an agreed memorandum. The agreement was ratified by their respective governments on 9 and 16 May 1916. p. 8.", "On Tuesday 28 December, Mark Sykes informed Gilbert Clayton that he had \"been given the Picot negotiations\". Sykes and Picot entered into \"almost daily\" private discussions over the six-day period; no documents survive from these discussions.", "Mark Sykes was dispatched on instructions of the War Office at the beginning of June to discuss the Committee's findings with the British authorities in the Near and Middle East and at the same time to study the situation on the spot. He went to Athens, Gallipoli, Sofia, Cairo, Aden, Cairo a second time and then to India coming back to Basra in September and a third time to Cairo in November (where he was apprised of the McMahon–Hussein Correspondence) before returning home on 8 December and finally delivering his report to the War Committee on 16 December."]}, {"page": "McMahon–Hussein Correspondence", "response": ["Hussein asked for an explanation of the Balfour Declaration and in January 1918 Commander David Hogarth, head of the Arab Bureau in Cairo, was dispatched to Jeddah to deliver a letter that was written by Sir Mark Sykes on behalf of the UK government to Hussein, who was now King of Hejaz. The Hogarth message assured Hussein \"the Arab race shall be given full opportunity of once again forming a nation in the world\" and referred to \" ... the freedom of the existing population both economic and political ...\". According to Isaiah Friedman and Kedourie, Hussein accepted the Balfour Declaration  while Charles D. Smith said both Friedman and Kedourie misrepresent documents and violate scholarly standards to reach their conclusions. Hogarth reported that Hussein \"would not accept an independent Jewish State in Palestine, nor was I instructed to warn him that such a state was contemplated by Great Britain\"."]}, {"page": "Gertrude Bell", "response": ["Mark Sykes, the British diplomat responsible for the Sykes–Picot Agreement, was not fond of her."]}, {"page": "Arab Revolt", "response": ["The Ottoman Empire took part in the Middle Eastern theatre of World War I, under the terms of the Ottoman–German Alliance.  Many Arab nationalist figures in Damascus and Beirut were arrested, then tortured. The flag of the resistance was designed by Sir Mark Sykes, in an effort to create a feeling of \"Arab-ness\" in order to fuel the revolt.William Easterly, The White Man's Burden, (2006) p. 295"]}, {"page": "Percy Cox", "response": ["Cox's main priority was to protect and prevent Ibn Saud from joining the Turkish side in the war. He met the Arab Sheikh at Al-Ahsa Oasis where a Treaty was signed guaranteeing a subsidy of £5,000 per month. Cox knew that Sir Mark Sykes was the champion of Sharif Husein, a rival candidate for the desert kingdoms. The delicate diplomatic balance arose as General Maude took Baghdad in March 1917;\"I had a letter from Sir Percy to-day, from the Front, full of exaltation and confidence\". (Gertrude to Herbert Bell, 10 March 1917.) and Allenby Jerusalem that December. Taking part in the campaigns in Mesopotamia and Palestine, he was promoted to Honorary Major-General in May 1917. During this time he established strong relations with Ibn Saud, the powerful ruler of the Nejd, with whom he had already had dealings while Resident, and when he gained the nickname Kokus."]}, {"page": "Eldon Gorst", "response": ["Eldon Gorst was also the lover for two years in the 1880s of (Christina Anne) Jessica Sykes, née Cavendish-Bentinck, whose son Sir Mark Sykes, 6th Bt., later married 1903 Eldon's younger sister Edith."]}, {"page": "Shane Leslie", "response": ["He wrote extensively, in a wide range of styles, in verse, prose, and polemic, over several decades. His writings include The End of a Chapter (1916),Archive.org: The End of a Chapter by Leslie, Shane, 1885-1971 while hospitalised during the Great War, The Oppidan (1922), a roman à clef about his life and contemporaries at Eton, an edition of the Letters of Herbert Cardinal Vaughan to Lady Herbert of Lea (1942), and a biography Mrs Fitzherbert: a life chiefly from unpublished sources (1939), together with an edition of her letters (with Maria Anne Fitzherbert), The letters of Mrs Fitzherbert and connected papers; being the second volume of the life of Mrs. Fitzherbert (1944). He also wrote Mark Sykes: His Life and Letters (1923), a biography of the English traveller, Conservative Party politician and diplomatic advisor.He advised budding novelist Scott Fitzgerald on the title of his 1st novel,they shared correspondence with the future Mnsg William A Hemmick who was Fitzgerald's teacher at the now shut Newman School."]}, {"page": "Pan-Arab colors", "response": ["Pan-Arab colours, used individually in the past, were first combined in 1916 in the flag of the Arab Revolt or Flag of Hejaz,I. Friedman, British Pan-Arab Policy, 1915–1922, Transaction Publ., 2011, p. 135 designed by the British diplomat Sir Mark Sykes.William Easterly, The White Man's Burden (2006), p. 295 Many current flags are based on Arab Revolt colours, such as the flags of Jordan, Kuwait, Palestine, the Sahrawi Arab Democratic Republic, and the United Arab Emirates, and formerly in the flag of the brief (six month) union of the Arab Federation of Iraq and Jordan."]}, {"page": "George Lloyd, 1st Baron Lloyd", "response": ["In 1901 Lloyd joined the family firm Stewarts & Lloyds as its youngest director. In 1903 he first became involved with the tariff reform movement of Joseph Chamberlain. In 1904 he fell in love with Lady Constance Knox, daughter of the 5th Earl of Ranfurly, who forbade the match with his daughter considering him unsuitable (she then married Evelyn Milnes Gaskell, son of Rt. Hon. Charles Gaskell, in November 1905).Gamble, Cynthia, (2015) Wenlock Abbey 1857–1919: A Shropshire Country House and the Milnes Gaskell Family, Ellingham Press. In 1905 he turned down an offer by Stewarts & Lloyds of a steady position in London and chose to embark on a study of the East in the British Empire. Through the efforts of his friends Samuel Pepys Cockerell, working in the commercial department of the Foreign Office, and Gertrude Bell, whom he had come to know, he started work as an unpaid honorary attaché in Constantinople. At \"Old Stamboul\"John Charmley:  Lord Lloyd and the Decline of the British Empire  St Martin's Press, New York 1987  – as he came to remember the Embassy of Sir Nicholas O'Conor – he worked together with Laurence Oliphant, Percy Loraine and Alexander Cadogan. There also he first met Mark Sykes and Aubrey Herbert. In April 1906 Aubrey Herbert joined him on an exploration of the state of the Baghdad Railway.John Charmley  Lord Lloyd  New York 1987 Chapter 2 The Lure of the East His confidential memorandum of November 1906 on the Hejaz railway gave a detailed account of many economic problems. This, and other papers – on Turkish finance, for example – led to his appointment in January 1907 as a special commissioner to investigate trading prospects around the Persian Gulf."]}, {"page": "Aubrey Herbert", "response": ["His friendship with Middle Eastern traveller and advisor Sir Mark Sykes dates from his entry into parliament in 1911 when, with George Lloyd, they were the three youngest Conservative MPs. They shared an interest in foreign policy and worked closely in the Arab Bureau (1916). He was also a close friend of T. E. Lawrence; their letters do not feature in the standard Lawrence collections, but are quoted by Margaret Fitzherbert in her biography of her grandfather, The Man Who Was Greenmantle. (Greenmantle was one of John Buchan's novels about the adventurer Richard Hannay.)", "Despite very poor eyesight, Herbert was able, at the outbreak of World War I in 1914, to join the Irish Guards, in which he served in a supernumerary position. He did this by purchasing a uniform and boarding a troopship bound for France. During the Battle of Mons, he was wounded and briefly taken prisoner. After a convalescence in England, and unable to rejoin due to his ocular disability, Aubrey was proposed for service in military intelligence in Egypt by Kitchener's military secretary, Oswald FitzGerald, via Mark Sykes (see Baghdad Railway).  In January 1915, Herbert was attached to the Intelligence Department in Cairo under Colonel Gilbert Clayton.  In mid-February, he was sent on an intelligence mission into the eastern Mediterranean aboard the cruiser .", "In October 1915, on sick leave in England, Herbert carried with him a memorandum, stating in part: \"They [Foreign Office] trust Egypt with the running of the Arabian Question...\",H.V.F. Winstone, Gertrude Bell, Jonathan Cape, 1978; , p. 171 from the Cairo Intelligence Department from Colonel Clayton to the Foreign Office explaining the situation in the Middle East. In November, the memorandum, at first favourably received, became obsolete after the visit of François Georges-Picot and his subsequent negotiations with Mark Sykes. It would appear that the Arab Bureau continued working along the lines of the memorandum,Compare: Lord Hardinge's letter on the memorandum to Wingate of 28 November 1915 in Winstone 1978, Gertrude Bell, pp. 171–72. which led to contrary promises ensuing accusations of bad faith.FitzHerbert, Chapter 10: \"Kut 1916\"."]}, {"page": "François Georges-Picot", "response": ["François Marie Denis Georges-Picot (21 December 1870 – 20 June 1951) was a French diplomat and lawyer who negotiated the Sykes–Picot Agreement with the English diplomat Sir Mark Sykes between November 1915 and March 1916 before its signing on May 16, 1916. ", "The majority of Arab countries regard Picot in a strongly negative light for his role in leading the 1916 execution of Arab intellectuals and his key role with Mark Sykes in the Sykes-Picot Agreement."]}, {"page": "Sledmere House", "response": ["Sledmere House is a Grade I listed Georgian country house, containing Chippendale, Sheraton and French furnishings and many fine pictures, set within a park designed by Capability Brown. It is located in the village of Sledmere, between Driffield and Malton, in the East Riding of Yorkshire, England. The present house was begun in 1751, extended in the 1790s, and rebuilt after a fire in 1911. It was once the home of Colonel Sir Mark Sykes 6th Baronet, noted English traveller and diplomatic advisor, and is now the home of Sir Tatton Sykes, 8th Baronet.", "In 1751, Sir Richard Sykes demolished the previous Manor House at Sledmere, which had existed since medieval times, and built a new mansion. He also planted some 20,000 trees on the Wolds about his new home. He left no male heir however and on his death the estate passed to his brother Mark Sykes (1711–1783). Sir Mark's son, Sir Christopher Sykes, 2nd Baronet (1749–1801), MP for Beverley, greatly expanded the estate. He and his wife bought and enclosed huge areas of land for cultivation, built two new wings to the house, and landscaped the grounds, planting  of trees. The entire village of Sledmere was moved. Sir Christopher left a vast estate of nearly  and a large mansion set in its own  of parkland, which survives in the family to the present day. Sir Christopher also employed Joseph Rose, the most celebrated plasterer of his day, to decorate Sledmere. The result has been called among the finest plaster-work in England.", "A catastrophic fire in 1911 left the building a shell and destroyed the Adam-style 1790s interiors. It is said that Sir Tatton Sykes, 5th Baronet was too busy eating one of the milk puddings - to which he was addicted - to pay much attention, but villagers and estate workers loyally rescued pictures, statues and furniture, china and carpets, and even doors and banisters, including the house's 1780 copy of the Apollo Belvedere. The roof fell in a few moments later. The original designs for the interiors had survived however, and the house was then restored. Sir Mark Sykes, 6th Baronet inherited the estate after his father.", "The Long Library at Sledmere, superbly restored, is one of the most beautiful rooms in England. The Drawing Room and Music Room were decorated by Joseph Rose. The Music Room contains a fine organ case designed by Samuel Green for the original house in 1751.  However, there is nothing behind the facade pipes and the organ is unplayable. The Turkish Room was designed for Sir Mark Sykes, 6th Baronet, by an Armenian artist, David Ohannessian, inspired by one of the sultan's apartments in the Yeni Mosque in Istanbul. The tiles were made in Kutahya, Anatolia in 1913 in Ohannessian's workshop, the Société Ottomane de Faïence. The attached Roman Catholic chapel has a fine ceiling painted by Thomas Errington. It depicts the four winged creatures of the Evangelist in the Chancel and in the Nave, a variety of birds including a mute swan, grey heron, barn swallow and northern lapwing."]}, {"page": "Flag of Palestine", "response": ["Another version credits the Young Arab Society, which was formed in Paris in 1911. Yet another version is that the flag was designed by Sir Mark Sykes of the British Foreign Office. Whatever the correct story, the flag was used by Sharif Hussein by 1917 at the latest and quickly became regarded as the flag of the Arab national movement in the Mashriq.Tamir Sorek, The orange and the ‘Cross in the Crescent’: imagining Palestine in 1929, Nations and Nationalism, Vol 10 (2004) 269-291."]}, {"page": "Nahum Sokolow", "response": ["Chaim Weizmann wrote to the Manchester Zionist, Harry Sacher, who became a focus for the view that Sokolow and Weizmann had capitulated and forfeited the right to lead by \"preferring British Imperialism... to Zionism\".Stein, 'Letters', letter no.313, 7335, WI – filed miscellaneous; Schneer, p.207 Sokolow acted as Weizmann's eyes and ears in Paris on a diplomatic mission with Sir Mark Sykes to negotiate with the French.  The idea that the Jews would form a new kind of Triple Entente under the Ottoman Empire was unsettling to them. No, the delegation left for Paris on 31 March 1917. One purpose of the Entente was to strengthen the hand of Zionism in the US. \"The Jews represented a powerful political and economic force... if subterranean influence\".Sykes to Picot, 28 February 1917, Oxford, St Anthony's, MEC, SP, GB 165-0275/32B; Schneer, p.211 Sokolow did not know of the Sykes-Picot Agreement and British-French understanding on Middle Eastern policy matters. He believed that he must report to Weizmann that what France really meant by a \"Greater Syria\", taking the whole of Palestine for themselves. In a series of letters in April and May 1917, Weizmann accused Sokolow of letting the Zionists down in negotiations with France. Sokolow countered by replying that he remained totally committed to a British Palestine."]}, {"page": "Sledmere", "response": ["The Wagoners' Memorial in the village, designed by Sir Mark Sykes, 6th Baronet, is dedicated to the Wolds Wagoners Reserve, a corps that Sir Mark raised from the local population to fight in the First World War. It is noted for its unusual shape and its graphic scenes of war and country life.", "The 'Sledmere Cross' takes the form of an Eleanor Cross and is a true 'folly' that was 'converted' in 1919 to a War Memorial by Sir Mark Sykes (of the Sykes–Picot Agreement) who added a series of brass portraits in commemoration of his friends and the local men who fell in the war and also notably himself in crusader armour with the inscription “Laetare Jerusalem (Rejoice Jerusalem)”."]}, {"page": "Kütahya", "response": ["During this time a large number of Christian Armenians settled in Kotyaion/Kütahya, where they came to dominate the tile-making and ceramic-ware production.Hovannisian, Richard G. and Armen Manuk-Khaloyan, \"The Armenian Communities of Asia Minor,\" in Armenian Communities of Asia Minor, ed. Richard G. Hovannisian. UCLA Armenian History and Culture Series: Historic Armenian Cities and Provinces, 13. Costa Mesa, CA: Mazda Publishers, 2014, pp. 32-34. Kütahya emerged as a renowned center for the Ottoman ceramic industry, producing tiles and faience for mosques, churches, and official buildings in places all over the Middle East.See Dickran Kouymjian, \"The Role of Armenian Potters of Kutahia in the Ottoman Ceramic Industry,\" in Armenian Communities of Asia Minor, pp. 107-30. The craft industry of Armenian ceramics in Jerusalem was started by Armenian ceramicist , master of a Kütahya workshop between 1907 and 1915, who was deported from Kütahya in early 1916, during the Armenian genocide, and rediscovered, living as a refugee in Aleppo in 1918, by Sir Mark Sykes, a former patron. Sykes connected him to the new military governor of Jerusalem, Sir Ronald Storrs, and arranged for Ohannessian to travel to Jerusalem to participate in a planned British restoration of the Dome of the Rock.Moughalian, Sato. Feast of Ashes: The Life and Art of David Ohannessian. Stanford, CA: Redwood Press, 2019."]}, {"page": "List of United Kingdom by-elections (1918–1931)", "response": ["|Mark Sykes"]}, {"page": "Kurds in Turkey", "response": ["According to the Kurdish historian Rohat Alakom, the first Kurdish tribe to arrive in Central Anatolia was the Modanlı tribe (itself a sub-tribe of the MerdisiCevdet Türkay, Başbakanlık Arşiv Belgelerine Göre Osmanlı İmparatorluğu'nda Oymak, Aşiret ve Cemaatler, Tercüman Yayınları, 1979, p. 502. ) that settled in Haymana in 1184.Rohat Alakom, ibid, p. 33.  According to Ahmet Nezihî Turan the first Kurdish settlement in Central Anatolia was named Kürtler (\"Kurds\"), founded in Yaban Âbâd (present-day Kızılcahamam-Çamlıdere near Ankara) in 1463.Ahmet Nezili Turan, Yaninâbâd Tarihini Ararken, Kızılcahamam Belediye Yayınları, 1999.  According to Mark Sykes, the earliest population transfer (or exile) of Kurds to Central Anatolia was carried out during the reign of Selim I (1512–20).Mark Sykes, \"The Kurdish Tribes of the Ottoman Empire\", The Journal of the Royal Anthropological Institute of Great Britain and Ireland, Vol. XXXVIII, 1908."]}, {"page": "Beaumont College", "response": ["* Colonel Sir Mark Sykes Bt. (1879–1919); soldier, co-author of the Sykes–Picot Agreement."]}, {"page": "Oxford \"-er\"", "response": ["*Tatters: the Yorkshire squire, Sir Tatton Sykes (1826-1913), father of politician and diplomat Sir Mark Sykes and great-great-grandfather of novelist and socialite Plum Sykes (Worcester College), was referred to in the novels of Robert Surtees as \"Tatters\" or \"Old Tat\";Elizabeth Hamilton (1999) The Warwickshire Scandal"]}, {"page": "Spanish flu research", "response": ["* Mark Sykes – exhumation of a British flu victim in the United Kingdom"]}, {"page": "Plum Sykes", "response": ["Sykes' mother Valerie Goad, a dress designer, separated from Sykes' father Mark while Plum was at Oxford. The effects of this left her impecunious for a while and she received assistance from Worcester to remain at the college.Oxford Girl, op.cit Sykes' grandfather, Christopher Sykes (1907–1986), whom she knew as \"Fat Grandpa\" or \"F.G.\", was a friend and official biographer (1975) of the novelist Evelyn WaughOxford Girl, op.cit. Sykes thought her grandfather glamorous for eating croissants with unsalted French butter for breakfast, which she has described as \"rareties in 1980s England\" (ibid.) and son of the diplomat Sir Mark Sykes, sixth baronet (1869–1919), associated with the so-called Sykes–Picot Agreement of 1916, by which Britain and France provided for the partition of the Ottoman Empire after the end of the First World War.Martin Evans in History Today, April 2012 An 18th century forebear, the second baronet, Sir Christopher Sykes (1749–1801), was a major figure in the enclosure movement that seized ownership of common land for private use."]}, {"page": "Arab Bureau", "response": ["It was constituted on the initiative of Mark Sykes who, in December 1915, reported to London that, in a recent tour of the Middle East from Egypt to India, he had discovered that the German and Turkish Governments were widely distributing anti-British wartime propaganda that countered British imperialism. Sykes was concerned because British command posts in the Middle East were generally uncooperative and thus far unable to produce counterpropaganda. Sykes proposed the creation of a London office under his auspices to gather, filter, and distribute intelligence on the German and Turkish Middle East policy and \"co-ordinate propaganda in favour of Great Britain among non-Indian Moslems.\"Memorandum by Sykes, 23 December 1915, British Foreign Office 882/2 ARB/15/4, fos 1-14. quoted in Polly Mohs, Military Intelligence and the Arab Revolt (New York, 2008), p. 33."]}, {"page": "List of United Kingdom by-elections (1900–1918)", "response": ["|Mark Sykes"]}, {"page": "Kingston upon Hull Central (UK Parliament constituency)", "response": ["| 1911 || Mark Sykes || Unionist"]}, {"page": "Syria", "response": ["During World War I, the Ottoman Empire entered the conflict on the side of Germany and the Austro-Hungarian Empire. It ultimately suffered defeat and loss of control of the entire Near East to the British Empire and French Empire. During the conflict, genocide against indigenous Christian peoples was carried out by the Ottomans and their allies in the form of the Armenian genocide and Assyrian genocide, of which Deir ez-Zor, in Ottoman Syria, was the final destination of these death marches.Pouring a People into the Desert:The \"Definitive Solution\" of the Unionists to the Armenian Question, Fuat Dundar, A Question of Genocide, ed. Ronald Grigor Suny, Fatma Muge Gocek and Norman M. Naimark, (Oxford University Press, 2011), 280–281. In the midst of World War I, two Allied diplomats (Frenchman François Georges-Picot and Briton Mark Sykes) secretly agreed on the post-war division of the Ottoman Empire into respective zones of influence in the Sykes-Picot Agreement of 1916. Initially, the two territories were separated by a border that ran in an almost straight line from Jordan to Iran. However, the discovery of oil in the region of Mosul just before the end of the war led to yet another negotiation with France in 1918 to cede this region to the British zone of influence, which was to become Iraq. The fate of the intermediate province of Zor was left unclear; its occupation by Arab nationalists resulted in its attachment to Syria. This border was recognized internationally when Syria became a League of Nations mandate in 1920 and has not changed to date."]}, {"page": "Christopher Sykes (author)", "response": ["Christopher Hugh Sykes  (17 November 1907 – 8 December 1986) was an English author. Born into the well-off northern English landowning Sykes family of Sledmere, he was the second son of the diplomat Sir Mark Sykes (1879–1919), and his wife, Edith (née Gorst). His sister was Angela Sykes, the sculptor. His uncle, also Christopher Sykes, was, for a time, a close friend of Edward VII.Profile, records.ancestry.com. Retrieved 4 September 2014."]}, {"page": "Sykes", "response": ["* Sir Mark Sykes, British politician and diplomatic advisor"]}, {"page": "Sykes family of Sledmere", "response": ["Mark Sykes (1711–1783) was rector of Roos, and 1st baronet. His correspondence includes letters from the London merchant Henry de Ponthieu about the French in Canada 1761–63 and circa 100 letters from his London banker, Joseph Denison. He was succeeded at Sledmere by his one surviving child, Christopher Sykes (1749–1801), who was MP for Beverley 1784–90. In 1770 he made a fortunate marriage with Elizabeth, the daughter of William Tatton of Wythenshawe, Cheshire whose inheritance of £17,000 from her father was hugely augmented by her inheriting her brother's Cheshire estates and another £60,000 from her aunt in 1780. Christopher Sykes sold off shipping interests and government stock and he and his wife expanded the Sledmere estate. They bought and enclosed huge areas of land for cultivation and built two new wings to the house. The grounds were landscaped and  of trees planted. The entire village of Sledmere was relocated. His correspondence includes two letters from the archbishop of York and about 270 letters from a wide range of people including William Carr of York and Henry Maister of Hull. Christopher Sykes's son, Mark Masterman Sykes (1771–1823),See Dictionary of National Biography. was a knowledgeable collector of books and fine arts, but these were sold when he died childless. He was succeeded by his younger brother, Sir Tatton Sykes, 4th Baronet (1772–1863), who had an interest in agricultural techniques and horse racing. ", "His only son, Sir Tatton Sykes (1826–1913), developed into a rather withdrawn man who sold his father's stud for £30,000 and restored seventeen churches. He married Jessica Cavendish-Bentinck (died 1912). Their one son, Mark Sykes (1879–1919) travelled in the Middle East and wrote Through five Turkish provinces and The Caliph's last heritage. He married Edith Gorst, and their honeymoon took them to Paris, Rome, Constantinople and Jerusalem. They had six children. Mark Sykes was elected MP for Central Hull in 1911 and occupied himself for the early part of the First World War establishing the Waggoner's Special Reserve. From May 1915 he was called to the War Office by Lord Kitchener and is largely remembered for the part he played in forging the Inter-Allied agreement about the Middle East in 1916, the Sykes-Picot Agreement. While in Paris during the peace conference Mark Sykes contracted influenza and died at the age of only 39. He was a key figure in Middle East policy decision-making and his papers are a source of material on policy. Sir Mark Sykes 6th Baronet was succeeded in the title and Sledmere estates by Sir Richard Sykes 7th Baronet (1905–1978) and then Sir Tatton Sykes 8th Baronet, born 1943."]}, {"page": "Declaration to the Seven", "response": ["The Declaration to the Seven was a document written by the Sir Mark Sykes, approved by Charles Hardinge, the Permanent Under-Secretary at the Foreign Office and released on June 16, 1918 in response to a memorandum issued anonymously by seven Syrian notables in Cairo that included members of the soon to be formed Syrian Unity Party, established in the wake of the Balfour Declaration and the November 23, 1917 publication by the Bolsheviks of the secret May 1916 Sykes-Picot Agreement between Britain and France. The memorandum requested a \"guarantee of the ultimate independence of Arabia\". The Declaration stated the British policy that the future government of the regions of the Ottoman Empire occupied by Allies of World War I \"should be based upon the principle of the consent of the governed\"."]}, {"page": "Lucy Sykes", "response": ["Sykes Rellie was born in London, one of six children including a twin sister, Plum Sykes, and grew up in Sevenoaks, Kent. Sykes mother, Valerie Goad, was a dress designer. Sykes Rellie's grandfather, Christopher Sykes (1907–1986), whom she knew as \"Fat Grandpa\" or \"F.G.\", was a friend and official biographer (1975) of the novelist Evelyn WaughOxford Girl, op.cit. Sykes thought her grandfather glamorous for eating croissants with unsalted French butter for breakfast, which she has described as \"rareties in 1980s England\" (ibid.) and son of the diplomat Sir Mark Sykes, sixth baronet (1869–1919), associated with the so-called Sykes-Picot Agreement of 1916, by which Britain and France provided for the partition of the Ottoman Empire after the end of the First World War.Martin Evans in History Today, April 2012 An 18th century forebear, the second baronet, Sir Christopher Sykes (1749–1801), was a major figure in the enclosure movement that seized ownership of common land for private use."]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["Lieutenant-Colonel Sir Mark Sykes, 6th Baronet (5th Battalion The Yorkshire Regiment); born 1879: died 1919 of Spanish influenza at Paris while attending peace negotiations. MP (Conservative Party) for Kingston upon Hull Central (1911-death)."]}]}}