{"wiki_id": "http://www.wikidata.org/entity/Q3320941", "itemLabel": "Seán Mac Diarmada", "itemDescription": "Irish revolutionary", "wikipedia_url": "https://en.wikipedia.org/wiki/Se%C3%A1n_Mac_Diarmada", "wikipedia_page": {"main": "Seán Mac Diarmada (27 January 1883 – 12 May 1916), also known as Seán MacDermott, was an Irish republican political activist and revolutionary leader. He was one of the seven leaders of the Easter Rising of 1916, which he helped to organise as a member of the Military Committee of the Irish Republican Brotherhood (IRB) and was a signatory of the Proclamation of the Irish Republic. He was executed for his part in the Rising at age 33.\nBrought up in rural County Leitrim, he was a member of many associations which promoted the cause of the Irish language, Gaelic revival and Irish nationalism in general, including the Gaelic League and (early in his career) the Irish Catholic fraternity the Ancient Order of Hibernians. He was national organiser for Sinn Féin, and later manager of the newspaper Irish Freedom, started in 1910 by Bulmer Hobson and others.", "link_mentions": [{"page": "Easter Rising", "response": ["thumb|The signatories of the Proclamation: Tom Clarke, Seán Mac Diarmada, Thomas MacDonagh, Patrick Pearse, Éamonn Ceannt, James Connolly, Joseph Plunkett", "The Supreme Council of the IRB met on 5 September 1914, just over a month after the British government had declared war on Germany. At this meeting, they decided to stage an uprising before the war ended and to secure help from Germany.Caulfield, Max, p. 18 Responsibility for the planning of the rising was given to Tom Clarke and Seán Mac Diarmada.Foy and Barton, p. 16 The Irish Volunteers—the smaller of the two forces resulting from the September 1914 split over support for the British war effortFoy and Barton, p. 13—set up a \"headquarters staff\" that included Patrick PearseSean Farrell Moran, Patrick Pearse and the Politics of Redemption: The Mind of the Easter Rising, (1994), Ruth Dudley Edwards, Patrick Pearse and the Triumph of Failure, (1977), Joost Augustin, Patrick Pearse, (2009) as Director of Military Organisation, Joseph Plunkett as Director of Military Operations and Thomas MacDonagh as Director of Training. Éamonn Ceannt was later added as Director of Communications.Townshend, p. 92", "A joint force of about 400 Volunteers and Citizen Army gathered at Liberty Hall under the command of Commandant James Connolly. This was the headquarters battalion, and it also included Commander-in-Chief Patrick Pearse, as well as Tom Clarke, Seán Mac Diarmada and Joseph Plunkett.McNally and Dennis, p. 41 They marched to the General Post Office (GPO) on O'Connell Street, Dublin's main thoroughfare, occupied the building and hoisted two republican flags. Pearse stood outside and read the Proclamation of the Irish Republic.Foy and Barton, pp. 192, 195 Copies of the Proclamation were also pasted on walls and handed out to bystanders by Volunteers and newsboys.McGarry, p. 134 The GPO would be the rebels' headquarters for most of the Rising. Volunteers from the GPO also occupied other buildings on the street, including buildings overlooking O'Connell Bridge. They took over a wireless telegraph station and sent out a radio broadcast in Morse code, announcing that an Irish Republic had been declared. This was the first radio broadcast in Ireland.McGee, John. \"Time to celebrate a centenary of Irish broadcast heroes\" . Irish Independent, 6 March 2016.", "* 12 May: James Connolly and Seán Mac Diarmada"]}, {"page": "1916", "response": ["** Seán Mac Diarmada, Irish republican (executed) (b. 1883)"]}, {"page": "Éamon de Valera", "response": ["De Valera was among the few republican leaders the British did not execute. It has been argued that his life was saved by four facts. First, he was one of the last to surrender and he was held in a different prison from other leaders, thus his execution was delayed by practicalities. Second, the US Consulate in Dublin made representations before his trial (i.e., was he actually a United States citizen and if so, how would the United States react to the execution of one of its citizens?) while the full legal situation was clarified. The UK was trying to bring the US into the war in Europe at the time, and the Irish American vote was important in US politics. Third, when Lt-Gen Sir John Maxwell reviewed his case he said, \"Who is he? I haven't heard of him before. I wonder would he be likely to make trouble in the future?\" On being told that de Valera was unimportant, he commuted the court-martial's death sentence to life imprisonment.Barton, Brian. From Behind a Closed Door, Secret Court Martial Records of 1916, The History Press De Valera had no Fenian family or personal background and his MI5 file in 1916 was very slim, detailing only his open membership in the Irish Volunteers. Fourth, by the time de Valera was court-martialled on 8 May, political pressure was being brought to bear on Maxwell to halt the executions; Maxwell had already told British Prime Minister H. H. Asquith that only two more were to be executed, Seán Mac Diarmada and James Connolly, although they were court-martialled the day after de Valera. His late trial, representations made by the American Consulate, his lack of Fenian background and political pressure all combined to save his life, though had he been tried a week earlier he would probably have been shot."]}, {"page": "County Leitrim", "response": ["*Seán Mac Diarmada (1883-1916) – political activist and revolutionary leader executed following the 1916 Rising.  "]}, {"page": "Fianna Éireann", "response": ["Fianna officers made a decision and detoured with their gun-laden cart up the Howth Road, arriving eventually at Kilmore Road, Artane, where the arms were stored for future recovery. Hobson reluctantly allowed John Redmond to gain influence over the Volunteers, leading to a split at the outbreak of World War I. This and his subsequent opposition to the Easter Rising (he was kept under armed guard that Easter Monday by Seán Mac Diarmada until the rising was well underway) led to Hobson's being sidelined by the republican movement and removed from any leadership role for the rest of his life."]}, {"page": "Kilmainham Gaol", "response": ["* Seán Mac Diarmada, 1916"]}, {"page": "Richard Mulcahy", "response": ["Richard Mulcahy married Min Ryan, the former fiancée of Seán Mac Diarmada, in 1920, and lived in a flat in Oakley House, Ranelagh.Brian Feeney, Sinn Fein: A Hundred Turbulent Years, p.57. McCoole, No Ordinary Women, 75. Min, a member of the Cumann na mBan Executive, had herself been involved in nationalist activity at the time of the Rising.www.bureauofmilitaryhistory.ie WS Ref #: 541, Witness: Nancy Wyse Power, Officer, Cumann na mBan, 1914–21  One of his sons, Risteárd Mulcahy, was for many years a cardiologist in Dublin. His daughter Neillí Mulcahy (1925–2012) was one of Ireland's leading fashion designers. She designed the uniforms for Aer Lingus in 1962. Another son was the structural engineer and visual artist Seán Mulcahy (1926–2018)."]}, {"page": "Capital punishment in the United Kingdom", "response": ["*3 - 12 May 1916: Patrick Pearse, Tom Clarke, Joseph Plunkett, Éamonn Ceannt, James Connolly, Seán Mac Diarmada and several others were shot at Kilmainham Gaol, Dublin (then part of Britain), for their part in the Easter Rising. "]}, {"page": "Irish Volunteers", "response": ["With MacNeill willing to take part, O'Rahilly and Hobson sent out invitations for the first meeting at Wynn's Hotel in Abbey Street, Dublin, on 11 November.The Irish Volunteers 1913–1915, F. X. Martin (cited) 1963, page 25 Hobson himself did not attend this meeting, believing his standing as an \"extreme nationalist\" might prove problematical. The IRB, however, was well represented by, among others, Seán Mac Diarmada and Éamonn Ceannt, who would prove to be substantially more extreme than Hobson.Aengus Ó Snodaigh, \"The Irish Volunteers founded\" , An Phoblacht/Republican News, 26 November 1998 Several others meetings were soon to follow, as prominent nationalists planned the formation of the Volunteers, under the leadership of MacNeill. Meanwhile, labour leaders in Dublin began calling for the establishment of a citizens' defence force in the aftermath of the lock out of 19 August 1913. Thus formed the Irish Citizen Army, led by James Larkin and James Connolly, which, though it had similar aims, at this point had no connection with the Irish Volunteers (were later allies in the Easter Rising.)", "*Members: Piaras Béaslaí (Irish Republican Brotherhood (IRB)), Sir Roger Casement (GL), Éamonn Ceannt (IRB, GL, SF), John Fitzgibbon (GL, SF), Liam Gogan, Bulmer Hobson (IRB, Fianna Éireann (FÉ)), Michael J. Judge (AOH), Thomas Kettle (IPP, AOH), James Lenehan (AOH), Michael Lonergan (IRB, Fianna Éireann (FÉ)), Peter (Peadar) Macken (IRB, Labour leader, SF, GL), Seán Mac Diarmada (IRB, Irish Freedom), Thomas MacDonagh (GL), Liam Mellows (IRB), Maurice Moore (IPP, GL, Connaught Rangers), Séamus O'Connor (IRB), Colm O'Loughlin (IRB, St. Enda's School (SES)), Peter O'Reilly (Ancient Order of Hibernians (AOH)), Robert Page (IRB, Gaelic Athletic Association (GAA)), Patrick Pearse (GL, SES), Joseph M. Plunkett (GL, Irish Review), John Walsh (AOH), Peter White (Celtic Literary Society);"]}, {"page": "Proclamation of the Irish Republic", "response": ["* Seán Mac Diarmada"]}, {"page": "Irish Republican Brotherhood", "response": ["By the start of the 20th century, the IRB was a stagnating organisation, concerned more with Dublin municipal politics than the establishment of a republic according to F. S. L. Lyons.Lyons, p. 315 A younger generation of Ulster republicans aimed to change this, and in 1905 Denis McCullough and Bulmer Hobson founded the Dungannon Clubs. Inspired by the Volunteers of 1782, the purpose of these clubs was to discourage enlistment into the British Army, and encourage enlistment into the IRB, with the overall goal of complete independence from Britain in the form of an Irish Republic.Lyons, p. 316. They were joined by Seán Mac Diarmada, and in 1908 he and Hobson relocated to Dublin, where they teamed up with veteran Fenian Tom Clarke. Clarke had been released from Portland Prison in October 1898 after serving fifteen and a half years, and had recently returned to Ireland after living in the United States.Clarke K. p. 24 & 36 Sent by John Devoy and the Clan na Gael to reorganise the IRB, Clarke set about to do just that.Charles Townshend, Easter 1916: The Irish rebellion, 2005, p. 18; Sean Cronin, The McGarrity Papers: revelations of the Irish revolutionary movement in Ireland and America 1900–1940, 1972, pp. 16, 30; Patrick Bishop & Eamonn Mallie, The Provisional IRA, 1988, p. 23; J Bowyer Bell, The Secret Army: The IRA, rev. ed., 1997, p. 9; Tim Pat Coogan, The IRA, 1984, p. 31 In 1909 the young Michael Collins was introduced to the brotherhood by Sam Maguire. By 1914 the Supreme Council was largely purged of its older, tired leadership, and was dominated by enthusiastic men such as Hobson, McCullough, Patrick McCartan, John MacBride, Seán Mac Diarmada, and Tom Clarke.Lyons, pp. 318–319 The latter two were to be the primary instigators of the Easter Rising in 1916."]}, {"page": "Ballymun Flats", "response": ["The Ballymun tower blocks were seven landmark residential towers built in the 1960s. The seven towers were named after the seven leaders of the 1916 rising; Patrick Pearse, Thomas MacDonagh, Seán Mac Diarmada, Éamonn Ceannt, Thomas Clarke, James Connolly, and Joseph Plunkett.", "*Seán MacDermott tower (Seán Mac Diarmada) (1966–2005) was the fifth tower to be built, in 1966. In 2005, it was demolished by controlled implosion and collapsed in less than eight seconds."]}, {"page": "Tom Clarke (Irish republican)", "response": ["In Ireland, Clarke opened a tobacconist shop in Dublin and immersed himself in the IRB which was undergoing a substantial rejuvenation under the guidance of younger men such as Bulmer Hobson and Denis McCullough. Clarke had a very close kinship with Hobson, who along with Seán Mac Diarmada, became his protégé."]}, {"page": "Éamonn Ceannt", "response": ["In 1907 Ceannt joined the Dublin central branch of Sinn Féin and over the following years he became increasingly determined to see an Independent Ireland.  In 1912 he was sworn to the Irish Republican Brotherhood by Seán Mac Diarmada.  This movement was pledged to achieve Irish independence and to do so by using physical force if necessary.", "In May 1915, the IRB Military Council, consisting of Joseph Plunkett and Seán Mac Diarmada as well as Ceannt, began plans for a rebellion. Ceannt was one of the seven men to sign the Proclamation of Independence for the Irish Republic and had been appointed Director of Communications. He was made commandant of the 4th Battalion of the Volunteers, and during the Rising was stationed at the South Dublin Union, with more than 100 men under his command, notably his second-in-command Cathal Brugha, and W. T. Cosgrave. The South Dublin Union controlled a large area south of Kilmainham around Dolphin's Barn."]}, {"page": "National Volunteers", "response": ["Eoin MacNeill, along with Sir Roger Casement and other leaders of the Irish Volunteers, had indeed sought Redmond's approval of and input in the organisation, but did not want to hand control over to him. In June 1914, the Volunteer leadership reluctantly agreed, in the interest of harmony, to permit Redmond to nominate half of the membership of the Volunteer Executive;Irish Volunteer Soldiers 1913–23, p. 8,  as some of the standing members were already Redmondites, this would make his supporters a majority of the Volunteers' leadership. The motion was bitterly opposed by the radical members of the committee (mostly members of the secret Irish Republican Brotherhood), notably Patrick Pearse, Seán Mac Diarmada, and Éamonn Ceannt, but was carried nevertheless to prevent a split. With the support of the Irish Party the Volunteer organisation grew dramatically."]}, {"page": "John MacDermott", "response": ["*Seán Mac Diarmada (1883–1916), Irish rebel, leader in the 1916 Easter Rising in Ireland (born John MacDermott)"]}, {"page": "Sean MacDiarmada", "response": ["#REDIRECT Seán Mac Diarmada"]}, {"page": "Sean MacDiarmida", "response": ["#REDIRECT Seán Mac Diarmada"]}, {"page": "Sean macdermott", "response": ["#REDIRECT Seán Mac Diarmada"]}, {"page": "Denis McCullough", "response": ["McCullough was a separatist nationalist from an early age. Both his father and grandfather were in the Irish Republican Brotherhood, as was his brother. When he was 17, his father had him inducted into the Irish Republican Brotherhood (IRB) at the side door of a pub by a man who seemed to view the ritual as an unpleasant distraction to a night of drinking.F.S.L. Lyons. Ireland Since the Famine, Fontana Publishing, 1973; OCLC 800472120, 2 volumes (880 pages), p. 315 The event disillusioned McCullough with the IRB, and he took it upon himself to revitalise the organisation, with assistance from, among others, Bulmer Hobson and Seán Mac Diarmada. The trio founded the Dungannon Clubs as a non-sectarian, republican, separatist organisation (it was later absorbed into Sinn Féin), for recruitment. They worked to remove \"armchair republicans\" from positions of power. Their cause prospered with the return of veteran Fenian Tom Clarke to Ireland in 1907. "]}, {"page": "Thomas MacDonagh", "response": ["In 1913 both MacDonagh and Plunkett attended the inaugural meeting of the Irish Volunteers and joined its Provisional Committee. MacDonagh was later appointed Commandant of Dublin's 2nd battalion, and eventually made commandant of the entire Dublin Brigade.  Although originally a pure constitutionalist, through his dealings with men such as Pearse, Plunkett, and Seán Mac Diarmada, and through the increasing militarisation of Europe in the onset of World War I, MacDonagh developed stronger republican beliefs, joining the Irish Republican Brotherhood (IRB), probably during the summer of 1915.  Around this time Tom Clarke asked him to plan the grandiose funeral of Jeremiah O'Donovan Rossa, which was a resounding propaganda success, largely due to the graveside oration delivered by Pearse."]}, {"page": "Sligo", "response": [" Connections to Enniskillen and the north followed in 1881 and Limerick and the south in 1895. The line to Enniskillen closed in 1957 and passenger services to Galway-Ennis-Limerick closed in 1963. For many years Córas Iompair Éireann (CIÉ) kept the latter line open for freight traffic, before its full closure. The proposed Western Rail Corridor redevelopment project seeks to reopen it. In 1966 Sligo railway station was renamed Sligo Mac Diarmada Station after Irish rebel Seán Mac Diarmada from County Leitrim."]}, {"page": "Ancient Order of Hibernians", "response": ["Many republican leaders in the 1916–1923 period, among them Seán Mac Diarmada, J. J. Walsh, and Rory O'Connor, had been \"Hibs\" before the formation of the Irish Volunteers in 1913."]}, {"page": "P. J. Ruttledge", "response": ["During the Irish War of Independence he was active in the Irish Republican Army. He was a close friend of Seán Mac Diarmada, with whom he lived for some time. He also took part in local politics, becoming chair of Ballina Urban Council from 1919 to 1932 and chair of Mayo County Council from 1922 to 1926."]}, {"page": "1916 in Ireland", "response": ["*12 May – two more leaders, Seán Mac Diarmada and James Connolly are executed. Connolly, who was wounded in the fighting, is strapped to a chair and shot. Meanwhile, Prime Minister H. H. Asquith arrives in Dublin for a week-long visit.", "**Seán Mac Diarmada, nationalist, rebel and an Easter Rising leader, executed (born 1883)."]}, {"page": "Fionán Lynch", "response": ["While in Swansea, and keen on fostering the Irish language both written and spoken, Lynch had formed a branch of the Gaelic League. When he returned to Dublin in 1912 Lynch, Gearóid O'Sullivan and his friend Diarmuid O'Hegarty joined the very active and influential Keating Branch of the Gaelic League, where IRB influence was strong. The Chairman of the branch was Cathal Brugha and Piaras Béaslaí was a member, with Seán Mac Diarmada a frequent visitor. Lynch, O’Sullivan and Ó Hegarty were soon brought onto the committee of the branch and undertook teaching of both adults and children.", "During 1914 to 1915, they produced plays in Irish at intervals in Dublin and in the summer of 1914 they did a tour of Cork and Kerry producing plays in different towns each night and finishing off with two or three nights at the Oireachtas in Killarney. In July 1914, they were producing Irish plays at the Oireachtas in Drogheda and Seán Mac Diarmada insisted that they go ahead even though it clashed with the Howth gun running.", "Soon after this he was asked by his close friend Seán Mac Diarmada, along with Con Collins, to join the Irish Republican Brotherhood. The IRB supreme Council were trying to ensure volunteer officers were members of the brotherhood and the fact that he was already friendly with Seán MacDiarmada made him acceptable. He subsequently took the oath and was sworn in around spring 1915. He was allocated to the Circle in Gardiner Street, with Diarmuid Ó Hegarty and Gearoid O’Sullivan members of the same circle."]}, {"page": "Bulmer Hobson", "response": ["Hobson was sworn into the IRB in 1904 by Denis McCullough, their head in Belfast.Martin, p. 99 Together they founded the Dungannon Clubs, whose object was to celebrate the victory of Volunteers of 1782 in restoring to Ireland her own Parliament,T.A. Jackson, pp. 105-13 although they were additionally an \"open front\" for the IRB.Michael Tierney, Eoin MacNeill: Scholar and Man of Action 1867–1945, Clarendon Press Oxford, 1980, edited by F.X. Martin, p. 113 The Volunteers of 1782 were an armed militia whose success, they suggested, could offer instructive lessons. The first Dungannon Club manifesto read: “The Ireland we seek to build is not an Ireland for the Catholic or the Protestant, but an Ireland for every Irishman Irrespective of his creed or class.\" Under the direction of Denis McCullough, Hobson became one of the key figures in the ongoing revitalisation of the IRB in Ulster, along with Seán Mac Diarmada, Patrick McCartan and Ernest Blythe."]}]}}