{"wiki_id": "http://www.wikidata.org/entity/Q333431", "itemLabel": "Christopher Chataway", "itemDescription": "British runner and politician (1931-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Chataway", "wikipedia_page": {"main": "Sir Christopher John Chataway (31 January 1931 – 19 January 2014) was a British middle- and long-distance runner, television news broadcaster, and Conservative politician.", "link_mentions": [{"page": "January 31", "response": ["*  1931   – Christopher Chataway, English runner, journalist, and politician (d. 2014)"]}, {"page": "January 19", "response": ["*  2014   – Christopher Chataway, English runner, journalist, and politician (b. 1931)"]}, {"page": "London Borough of Lewisham", "response": ["| Christopher Chataway"]}, {"page": "Guinness World Records", "response": ["On 10 November 1951, Sir Hugh Beaver, then the managing director of the Guinness Breweries, went on a shooting party in the North Slob, by the River Slaney in County Wexford, Ireland. After missing a shot at a golden plover, he became involved in an argument over which was the fastest game bird in Europe, the golden plover or the red grouse – it is the plover. That evening at Castlebridge House, he realised that it was impossible to confirm in reference books whether or not the golden plover was Europe's fastest game bird. Beaver knew that there must have been numerous other questions debated nightly among the public, but there was no book in the world with which to settle arguments about records. He realised then that a book supplying the answers to this sort of question might prove successful. Beaver's idea became reality when Guinness employee Christopher Chataway recommended university friends Norris and Ross McWhirter, who had been running a fact-finding agency in London. The twin brothers were commissioned to compile what became The Guinness Book of (Superlatives and now) Records, in August 1954. A thousand copies were printed and given away."]}, {"page": "Roger Bannister", "response": ["The pace-setters from his major 1953 attempts, future Commonwealth Games gold medallist Christopher Chataway from the 2 May attempt, and future Olympic Games gold medallist Chris Brasher from the 27 June attempt, combined to provide pacing for Bannister's run. The raceIncludes full footage of the race. was broadcast live by BBC Radio and commentated by 1924 Olympic 100 metres champion Harold Abrahams, of Chariots of Fire fame."]}, {"page": "Postmaster General of the United Kingdom", "response": ["| Christopher ChatawayMP for Chichester"]}, {"page": "Inner London Education Authority", "response": ["The initial composition of the ILEA in 1964 was 43 Labour members to 9 Conservatives, with one Independent. After the 1967 election the Conservatives won a majority, and Christopher Chataway became Leader. However, Labour won control in 1970 and Ashley Bramall began his long leadership. His term saw the ILEA go over to comprehensive education, and the abolition of school corporal punishment. He retained power despite the Conservative election victory in the 1977 GLC elections.", "*Christopher Chataway 1967–1969"]}, {"page": "Television in the United Kingdom", "response": ["The election of a Conservative government in June 1970 brought in changes to the control of broadcasting hours. At first, the typical broadcasting day was extended to 8 hours a day, with an increase in exemptions over Christmas, and an increase in the sport/outside broadcasting quota. On 19 January 1972, the then Minister for Posts and Telecommunications, Christopher Chataway, announced to the British House of Commons that all restrictions on broadcasting hours on television would be lifted from that day, with the broadcasters allowed to set their own broadcasting hours from then on. By November 1972, a full daytime schedule had been launched on ITV from 9.30am each day, with the BBC also expanding their schedules to include more daytime programming."]}, {"page": "Norris McWhirter", "response": ["One of the athletes covered was runner Christopher Chataway, the employee at Guinness who recommended them to Sir Hugh Beaver. After an interview in which the Guinness directors enjoyed testing the twins' knowledge of records and unusual facts, the brothers agreed to start work on the book that became The Guinness Book of Records in 1954. In August 1955, the first slim green volume – 198 pages long – was at the bookstalls, and in four more months it was Britain's No. 1 nonfiction best-seller."]}, {"page": "Ross McWhirter", "response": ["While building up their business, they both worked as sports journalists. One of the athletes they knew and covered was runner Christopher Chataway, an employee at Guinness who recommended them to Hugh Beaver. After an interview in 1954 in which the Guinness directors enjoyed testing the twins' knowledge of records and unusual facts, the brothers agreed to start work on the book that would become The Guinness Book of Records. In August 1955, the first slim green volume – 198 pages long – was at the bookstalls, and in four more months it was the UK's number one non-fiction best-seller. Both brothers were regulars on the BBC show Record Breakers. They were noted for their encyclopedic memories, enabling them to provide detailed answers to questions from the audience about entries in The Guinness Book of Records. Norris continued to appear on the programme after Ross's death."]}, {"page": "ITN", "response": ["ITN was founded in May 1955 by a consortium of the initial four Independent Television (later ITV) broadcasting companies, with former Labour MP Aidan Crawley as editor-in-chief. The first bulletin was broadcast at 10 pm on 22 September 1955 on ITV's launch night. The bulletin was presented by former champion athlete Christopher Chataway. From the start, ITN broke new ground by introducing in-vision and named 'newscasters' (rather than the BBC's nameless and sound-only 'newsreaders'), and reporter packages. The unique, probing reporting style of Robin Day caused shock among politicians, finding themselves questioned continually for information – this had never been the case with the BBC. There was also some early tensions with the ITV companies. ABC Television, the ITV contractor for the north and Midlands on weekends, immediately called for shorter ITN bulletins. While the ITA ruled on a minimum of a 20-minute bulletin, disagreements with the ITV companies over ITN's budget triggered the resignation of its news editor Aidan Crawley after just one year in 1956. He was replaced by Geoffrey Cox."]}, {"page": "Chichester", "response": ["William Juxon, born 1582, attended The Prebendal School before studying at Oxford. He became chaplain to Charles I and was the last English cleric to hold both church and secular high office. He became Archbishop of Canterbury following the Restoration. William Cawley, born 1602 in Chichester, was on the other side of the English Civil War. Also educated at Oxford University he became the Member of Parliament for Chichester in 1628 and for Midhurst in 1640. He was a regicide and served on the Council of State during the Commonwealth, being forced to flee to Switzerland after the Restoration.T. Peacey, ‘Cawley, William (bap. 1602, d. 1667)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, Jan 2008 A later MP for the town, William Huskisson was one of the earlier people to die from a railway accident, when he was run over by Stephenson's Rocket at the opening of the Liverpool and Manchester Railway. In modern times middle-distance runner Christopher Chataway was elected to Parliament in 1969."]}, {"page": "1966 United Kingdom general election", "response": ["*Christopher Chataway (Lewisham North)"]}, {"page": "Anthony Steen", "response": ["In 1963, Sir John Foster, then MP for Northwich, highlighted Steen's work in an Adjournment Debate in the House of Commons. As a result, Christopher Chataway MP, a junior minister for education (from 1962 to 1964), offered government funding for Task Force. The subsequent government, under Prime Minister Harold Wilson, asked Steen to head up a national equivalent to Task Force. The Young Volunteer Force Foundation (YVFF) was launched in 1968 at 10 Downing Street, with the object of recruiting young people throughout the UK to tackle community and social problems, to encourage altruism, promote people to care for those less fortunate than themselves. YVFF employed around 100 young people. The Chairman was Selwyn Lloyd MP, a former Chancellor and Foreign Secretary, and the Vice-Chairmen were Jo Grimond MP, Leader of the Liberal Party, and Douglas Houghton MP, Chairman of the Labour Party. Projects were launched in England, Scotland and Wales, resulting in greater community involvement and social awareness. The Young Volunteer Force was subsequently renamed the Community Development Foundation. Steen was its first Director, serving from 1968 to 1974. It was the largest organisation of its kind, and attracted over £1 million of government grant annually."]}, {"page": "List of United Kingdom MPs: C", "response": ["* Christopher Chataway (1959–1966), (1969–1974)"]}, {"page": "Vladimir Kuts", "response": ["Kuts was born in Oleksyne, Ukraine, USSR.Vladimir Kuts (Soviet athlete). Encyclopædia Britannica. Retrieved on 2014-08-08. His father died due to alcoholism when Kuts was five years old. During World War II he falsified his age and served two years with the Soviet Army as a courier. He took up running after the war, while continuing his military service as a navy sniper. In 1951 he won his first national titles, in the 5000 and 10000 m, an achievement he repeated in 1953–1956. His first international success came in 1954, when he defeated the favourites – Emil Zátopek and Christopher Chataway – in the 5000 m at the European Championships, setting a new world record. He lost the world record months later to Chataway (who beat him narrowly), only to take it back 10 days later."]}]}}