{"wiki_id": "http://www.wikidata.org/entity/Q333058", "itemLabel": "Gillian Shephard", "itemDescription": "British politician (born 1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gillian_Shephard", "wikipedia_page": {"main": "Gillian Patricia Shephard, Baroness Shephard of Northwold, PC, DL  (née Watts; born 22 January 1940), is an English Conservative politician. She was the Member of Parliament for South West Norfolk and served as a Cabinet Minister, and is now Chairman of the Association of Conservative Peers.\nBaroness Shephard is currently the chair of the Alumni Association of Oxford University. She was the chair of the Council of the Institute of Education until 2015 and deputy commissioner of the Social Mobility and Child Poverty Commission until 2017.", "link_mentions": [{"page": "January 22", "response": ["*  1940   – Gillian Shephard, English educator and politician, Secretary of State for Education"]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Gillian Shephard", "| Gillian Shephard"]}, {"page": "St Hilda's College, Oxford", "response": ["* Gillian Shephard, Baroness Shephard of Northwold, politician"]}, {"page": "Secretary of State for Education", "response": ["| Gillian Shephard", "| Gillian Shephard"]}, {"page": "Secretary of State for Employment", "response": ["| Gillian Shephard", "| width=200|Gillian Shephard"]}, {"page": "Gillian Shepherd", "response": ["#REDIRECT Gillian Shephard"]}, {"page": "Minister of Agriculture, Fisheries and Food", "response": ["| The Right HonourableGillian ShephardMP for South West Norfolk(1940–)"]}, {"page": "List of barons in the peerages of Britain and Ireland", "response": ["#*Gillian Shephard, Baroness Shephard of Northwold"]}, {"page": "Julian Brazier", "response": ["Brazier became the Parliamentary Private Secretary (PPS) to Gillian Shephard, the Minister of State at the Treasury. He remained Shephard's PPS following the 1992 general election in her new capacity as the Secretary of State for Employment, but he resigned in 1993 as a protest against defence cuts. He was awarded the 'Backbencher of the Year' at the annual Spectator magazine awards in 1996. Following the 1997 general election, he became a member of the Defence Select committee."]}]}}