{"wiki_id": "http://www.wikidata.org/entity/Q333294", "itemLabel": "Anthony Ashley-Cooper, 7th Earl of Shaftesbury", "itemDescription": "British politician (1801-1885)", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Ashley-Cooper,_7th_Earl_of_Shaftesbury", "wikipedia_page": {"main": "Anthony Ashley Cooper, 7th Earl of Shaftesbury  (28 April 1801 – 1 October 1885), styled Lord Ashley from 1811 to 1851 and then Lord Shaftesbury following the death of his father, was a British politician, philanthropist and social reformer. He was the eldest son of The 6th Earl of Shaftesbury and his wife, Lady Anne Spencer, daughter of The 4th Duke of Marlborough, and older brother of Henry Ashley, MP. As a social reformer who was called the \"Poor Man's Earl\", he campaigned for better working conditions, reform to lunacy laws, education and the limitation of child labour. He was also an early supporter of the Zionist movement and the YMCA and a leading figure in the evangelical movement in the Church of England.\n\n", "link_mentions": [{"page": "Labour law", "response": ["As England was the first country to industrialize, it was also the first to face the often appalling consequences of the industrial revolution in a less regulated economic framework. Over the course of the late 18th and early to the mid-19th century the foundation for modern labour law was slowly laid, as some of the more egregious aspects of working conditions were steadily ameliorated through legislation. This was largely achieved through the concerted pressure from social reformers, notably Anthony Ashley-Cooper, 7th Earl of Shaftesbury, and others."]}, {"page": "1885", "response": ["* October 1 – Anthony Ashley-Cooper, 7th Earl of Shaftesbury, British politician and philanthropist (b.1801)"]}, {"page": "YMCA", "response": ["The Young Men's Christian Association (YMCA) was founded by George Williams and 11 friends. Williams was a London draper who was typical of the young men drawn to the cities by the Industrial Revolution. They were concerned about the lack of healthy activities for young men in major cities; the options available were usually taverns and brothels. Williams' idea grew out of meetings he held for prayer and Bible-reading among his fellow workers in a business in the city of London, and on 6 June 1844, he held the first meeting that led to the founding of YMCA with the purpose of \"the improving of the spiritual condition of young men engaged in the drapery, embroidery, and other trades.\"Report of the Thirteenth International Conference: xix Anthony Ashley-Cooper, 7th Earl of Shaftesbury served as YMCA's first president from 1851 until his death in 1885."]}, {"page": "Henry John Temple, 3rd Viscount Palmerston", "response": ["In 1839, Palmerston married his mistress of many years, the noted Whig hostess Emily Lamb, widow of Peter Leopold Louis Francis Nassau Clavering-Cowper, 5th Earl Cowper (1778–1837) and sister of William Lamb, 2nd Viscount Melbourne, prime minister (1834 and 1835–1841). They had no legitimate children, although at least one of Lord Cowper's putative children, Lady Emily Cowper, the wife of Anthony Ashley-Cooper, 7th Earl of Shaftesbury, was widely believed to have been fathered by Palmerston.K D Reynolds, Oxford DNB, 'Temple, Emily'. Palmerston left his family seat Broadlands to her fourth, but 2nd surviving son Rt. Hon. Evelyn Melbourne Ashley (24 July 1836 – 15 November 1907) Palmerston resided at Brocket Hall in Hertfordshire, his wife's inheritance. His London townhouse was Cambridge House on Piccadilly in Mayfair. He also owned Broadlands at Romsey in Hampshire.David Brown, Palmerston: A Biography (2010), pp. 474-78."]}, {"page": "Shaftesbury", "response": ["In 1539, the last Abbess of Shaftesbury, Elizabeth Zouche, signed a deed of surrender, the (by then extremely wealthy) abbey was demolished, and its lands sold, leading to a temporary decline in the town. Sir Thomas Arundell purchased the abbey and much of the town in 1540, but when he was later exiled for treason his lands were forfeit, and the lands passed to Pembroke then Anthony Ashley-Cooper, 7th Earl of Shaftesbury, and finally to the Grosvenors."]}, {"page": "Anthony Ashley Cooper, 7th Earl of Shaftesbury", "response": ["#redirect Anthony Ashley-Cooper, 7th Earl of Shaftesbury"]}, {"page": "Christian Zionism", "response": ["The crumbling of the Ottoman Empire threatened the British route to India via the Suez Canal as well as sundry French, German and American economic interests. In 1831 the Ottomans were driven from Greater Syria (including Palestine) by an expansionist Egypt, in the First Turko-Egyptian War. Although Britain forced Muhammad Ali to withdraw to Egypt, the Levant was left for a brief time without a government. The ongoing weakness of the Ottoman Empire made some in the west consider the potential of a Jewish state in the Holy Land. A number of important figures within the British government advocated such a plan, including Charles Henry Churchill.The Question of Palestine: British-Jewish-Arab Relations, 1914–1918, Isaiah. Friedman, Transaction Publishers, 1992, see Chapter 1 with a summary in the IntroductionThe foreign policy of Palmerston, 1830–1841: Britain, the liberal movement and the Eastern question, Charles Kingsley Webster, Pub. G. Bell, 1951 Again during the lead-up to the Crimean War (1854), there was an opportunity for political rearrangements in the Near East. In July 1853, Anthony Ashley-Cooper, 7th Earl of Shaftesbury, who was President of the London Society for Promoting Christianity Amongst the Jews, wrote to Prime Minister Aberdeen urging Jewish restoration as a means of stabilizing the region.Shaftsbury as cited in Hyamson, Albert, \"British Projects for the Restoration of Jews to Palestine,\" American Jewish Historical Society, Publications 26, 1918 p. 140 ", "* Anthony Ashley-Cooper, 7th Earl of ShaftesburyBritish politician."]}, {"page": "Thomas Southwood Smith", "response": ["Smith was a close ally on public health matters with Edwin Chadwick, and like him supported the miasma theory. From 1848 to 1854 they worked closely together at the Central Board of Health. But the appointment of Lord Seymour made their work very difficult, despite the support of Anthony Ashley-Cooper, 7th Earl of Shaftesbury."]}]}}