{"wiki_id": "http://www.wikidata.org/entity/Q333459", "itemLabel": "Alan Milburn", "itemDescription": "British politician (born 1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Milburn", "wikipedia_page": {"main": "Alan Milburn (born 27 January 1958) is a British Labour politician who was Member of Parliament (MP) for Darlington from 1992 to 2010. He served for five years in the Cabinet, first as Chief Secretary to the Treasury from 1998 to 1999, and subsequently as Secretary of State for Health until 2003, when he resigned. He briefly rejoined the Cabinet as Chancellor of the Duchy of Lancaster in order to manage Labour's 2005 re-election campaign. He did not seek re-election in the 2010 election.\nMilburn was Chair of the Social Mobility Commission from 2012 to 2017. Since 2015, he has been Chancellor of Lancaster University.", "link_mentions": [{"page": "January 27", "response": ["*  1958   – Alan Milburn, English businessman and politician, Chancellor of the Duchy of Lancaster"]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Alan Milburn", "| Alan Milburn"]}, {"page": "1992 United Kingdom general election", "response": ["|Alan Milburn"]}, {"page": "Darlington", "response": ["the Member of Parliament (MP) for this seat is Conservative Peter Gibson. Former members of parliament for the town include Jenny Chapman, the former Shadow Prisons Minister and Shadow Minister for Leaving the European Union, Alan Milburn, the former Secretary of State for Health under the Tony Blair Labour Government and Michael Fallon, who was Secretary of State for Defence under the David Cameron coalition government and Theresa May's Conservative government."]}, {"page": "Private finance initiative", "response": ["Two months after Tony Blair's Labour Party took office, the Health Secretary, Alan Milburn, announced that \"when there is a limited amount of public-sector capital available, as there is, it's PFI or bust\". PFI expanded considerably in 1996 and then expanded much further under New Labour with the NHS (Private Finance) Act 1997, resulting in criticism from many trade unions, elements of the Labour Party, the Scottish National Party (SNP), and the Green Party, as well as commentators such as George Monbiot. Proponents of the PFI include the World Bank, the IMF and the Confederation of British Industry."]}, {"page": "John Reid, Baron Reid of Cardowan", "response": ["Reid was made Secretary of State for Health in June 2003, replacing Alan Milburn after the latter's resignation. He was reportedly less than happy with the appointment. He was reported by Private Eye at the time as reacting \"Oh fuck, not health.\"Private Eye, 12 June 2003. But Reid had established himself as one of Tony Blair's most trusted ministers and his appointment as Health Secretary took him into his fourth cabinet job in less than a year."]}, {"page": "Chancellor of the Duchy of Lancaster", "response": ["From 1997 until 2009, the holder of the title also served as the Minister for the Cabinet Office.  This applied in the case of Alan Milburn, who was given the title by Prime Minister Tony Blair in 2004 and at the same time rejoined the Cabinet. However, in the reshuffle of 5 June 2009, the chancellorship went to the Leader of the House of Lords, the Baroness Royall. In David Cameron's first cabinet, the chancellorship remained with the leader of the House of Lords until 2014."]}, {"page": "Charles Clarke", "response": ["On 8 September 2006, Clarke gave an interview to the Evening Standard in which he criticised the 'presumption' that Gordon Brown would succeed Tony Blair as Prime Minister, helping trigger further disputes about the Labour leadership. Clarke said of Brown's reaction to the leadership crisis, \"A lot of people are very upset and cross about that. It was absolutely stupid – a stupid, stupid thing to do.\" He named Alan Milburn as a politician who had the stature to be Prime Minister instead of Brown.", "Clarke with Alan Milburn set up The 2020 Vision website to discuss the direction of the Labour party after Tony Blair ceased being prime minister. Some observers saw this as a way for Gordon Brown's political opponents to create an axis against him. The website has since closed."]}, {"page": "Lancaster University", "response": ["Lancaster is ranked in the top thirteen in all three national league tables, and received a Gold rating in the Government's inaugural (2017) Teaching Excellence Framework. The annual income of the institution for 2018/19 was £317.9 million of which £42.0 million was from research grants and contracts, with an expenditure of £352.7 million. Along with the universities of Durham, Leeds, Liverpool, Manchester, Newcastle, Sheffield and York, Lancaster is a member of the N8 Group of research universities. Elizabeth II, Duke of Lancaster, is the visitor of the university. The current chancellor is Alan Milburn, since 2015.", "The Chancellor, currently Alan Milburn, is the formal and ceremonial head of the university.", "|Alan Milburn", "* Alan Milburn, History (1979, Pendle) – Chancellor of Lancaster University and Former MP for Darlington"]}, {"page": "Chief Secretary to the Treasury", "response": ["| Alan MilburnMP for Darlington"]}, {"page": "Galgate", "response": ["Former Radio 4 Gardener's Question Time panellist Fred Downham is a long-term resident of the village.  Alan Milburn, a former Labour minister, lived in the village whilst studying at Lancaster University."]}, {"page": "Blairism", "response": ["* Alan Milburn – Former Secretary of State for Health, MP and Social Mobility Tsar under the Conservative-Liberal Democrat coalition."]}, {"page": "Frank Dobson", "response": ["After Labour's landslide victory at the 1997 general election, Dobson was appointed as Secretary of State for Health. This was a high-profile post, but Dobson found it hard to build an impact. He faced interference from civil servants, who would claim that prime minister Tony Blair raised the issue of further private sector involvement in meetings with Dobson, which Dobson said to them \"just wasn't true\". He also had his hands tied by the decision to stick within spending limits set by the previous Conservative government. Dobson wrote a memo to Blair saying, \"If you want a first-class service, you have to pay a first-class fare – and we're not doing it.\" When money was finally diverted to the NHS, Blair credited Dobson for kickstarting it. Dobson's abolition of the internal market in the NHS was reversed by his successor, Alan Milburn, who Dobson said was \"carried away with the idea that the private sector could make a big contribution\". Dobson was also instrumental, working with Tessa Jowell, in establishing Sure Start, which aimed to improve childcare, early education and health care for families with children.", "In the Labour leadership controversy after Tony Blair's declaration he would step down within a year of September 2006, Dobson called for Blair to step down right away and end uncertainty. He also attacked Alan Milburn for making a \"terrible mess\" of the NHS. Milburn had been mentioned by Charles Clarke as a potential future Labour leader several hours earlier."]}, {"page": "Secretary of State for Health and Social Care", "response": ["| Alan Milburn"]}]}}