{"wiki_id": "http://www.wikidata.org/entity/Q3338823", "itemLabel": "Neve McIntosh", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Neve_McIntosh", "wikipedia_page": {"main": "Neve McIntosh (born Carol McIntosh on 9 April 1972) is a Scottish actress.", "link_mentions": [{"page": "Mervyn Peake", "response": ["In 2000, the BBC and WGBH Boston co-produced a lavish miniseries, titled Gormenghast, based on the first two books of the series. It starred Jonathan Rhys-Meyers as Steerpike, Neve McIntosh as Fuchsia, June Brown as Nannie Slagg, Ian Richardson as Lord Groan, Christopher Lee as Flay, Richard Griffiths as Swelter, Warren Mitchell as Barquentine, Celia Imrie as Countess Gertrude, Lynsey Baxter and Zoë Wanamaker as the twins Cora and Clarice, and John Sessions as Dr Prunesquallor. The supporting cast included Olga Sosnovska, Stephen Fry and Eric Sykes, and the series is also notable as the last screen performance by comedy legend Spike Milligan (as the Headmaster)."]}, {"page": "Sontaran", "response": ["Sporting an updated design, Sontarans returned to the revived series in the Series 4 episodes \"The Sontaran Strategem\" and \"The Poison Sky\" (2008). The Sontarans plan to terraform the Earth into a new clone world, but their plans are averted by the Tenth Doctor (David Tennant). It is also revealed that the race was excluded from the Last Great Time War of the revived series' backstory. In \"Turn Left\" (2008), the same events are depicted in a parallel universe, where Rose Tyler (Billie Piper) describes their plan as foiled by Torchwood (characters from the spin-off show of that name), at the cost of their lives, with Torchwood leader Captain Jack Harkness (John Barrowman) being captured by the Sontarans. In \"The Stolen Earth\" (2008), UNIT is revealed to have developed a teleportation device based on Sontaran technology. A lone survivor from the events of \"The Poison Sky\", Commander Kaagh (Anthony O'Donnell), next appears in The Last Sontaran (2008), from spin-off series The Sarah Jane Adventures. Kaagh appears again in Enemy of the Bane (2008). In Doctor Whos \"The End of Time, Part Two\" (2010), a Sontaran sniper (Dan Starkey) briefly appears pursuing the Doctor's former companions Mickey Smith (Noel Clarke) and his wife Martha Jones (Freema Agyeman), but is defeated by the Doctor before he can assassinate them. Alongside the Eleventh Doctor (Matt Smith), Sontaran battle fleets are seen in Series 5 finale episode, \"The Pandorica Opens\" (2010), as part of an alliance of the Doctor's enemies. Series 6 episode \"A Good Man Goes to War\" (2011) introduces Commander Strax (Starkey), a Sontaran nurse who has been assigned this role as a means of making penance. He fights on the side of the Doctor and his allies, which include the Silurian warrior Madame Vastra (Neve McIntosh) and her wife, Jenny Flint (Catrin Stewart). Strax then appears alongside Vastra and Jenny in \"The Snowmen\" (2012), \"The Crimson Horror\", \"The Name of the Doctor\" (both 2013), and \"Deep Breath\" (2014). A troop of Sontarans is also shown among Trenzalore's invaders in the 2013 Christmas special \"The Time of the Doctor\". A Sontaran appears briefly in the 2015 episode \"Face the Raven\" as a refugee."]}, {"page": "Aphra Behn", "response": ["Behn's life has been adapted for the stage in the 2014 play Empress of the Moon: The Lives of Aphra Behn by Chris Braak, and the 2015 play [exit Mrs Behn] or, The Leo Play by Christopher VanderArk. She is one of the characters in the 2010 play Or, by Liz Duffy Adams. Behn appears as a character in Daniel O'Mahony's Newtons Sleep, in Philip José Farmer's The Magic Labyrinth and Gods of Riverworld, in Molly Brown's Invitation to a Funeral (1999), in Susanna Gregory’s \"Blood On The Strand\", and in Diana Norman's The Vizard Mask. She is referred to in Patrick O'Brian's novel Desolation Island. Liz Duffy Adams produced Or,, a 2009 play about her life. The 2019 Big Finish Short Trip audio play The Astrea Conspiracy features Behn alongside The Doctor, voiced by actress Neve McIntosh. In recognition of her pioneering role in women's literature, Behn was featured during the \"Her Story\" video tribute to notable women on U2's North American tour in 2017 for the 30th anniversary of The Joshua Tree."]}, {"page": "Silurian (Doctor Who)", "response": ["Recurring character Madame Vastra (Neve McIntosh) is then introduced in \"A Good Man Goes to War\" (2011) as a Silurian detective in the Victorian era, who befriended the Doctor after a brief rampage on the London Underground. She lives with her human wife Jenny Flint (Catrin Stewart), and after \"A Good Man\", also employs the Sontaran Strax (Dan Starkey) as her butler. The \"Paternoster Gang\", as the three are known, sometimes including the Doctor, appear again in \"The Snowmen\" (2012) and its three short prequels in 2012–2013, \"The Crimson Horror\", \"The Name of the Doctor\" (both 2013), and \"Deep Breath\" (2014). In \"The Crimson Horror\", Vastra claims to be from 65 million years ago."]}, {"page": "Bodies (TV series)", "response": ["* Neve McIntosh as Sister Donna Rix", "The series continues with the main overlying storyline of the constant struggle between Hurley and Lake. This season also saw the arrival of a new departmental manager, Chrissy Farrell (Vicky Hall). At the start of the second series, Lake is about to leave the hospital but, with no real job prospects elsewhere, he decides to remain. Lake and Hurley then begin to form a respectful professional relationship, with Lake turning a blind eye to Hurley's incompetence. Despite this, Donna Rix (Neve McIntosh), a nurse with whom Lake was having an affair, views Hurley's ineptitude with increasing alarm. She starts to voice her distress and sends anonymous letters to management in an attempt to bring wider attention to this issue. Lake, seeing this, pleads with Donna to act with restraint, claiming that Hurley will be brought down but not in this fashion. Towards the end of the series, Hurley's life begins to unravel. Attempts to have a third child are scuppered after he finds out he has a low sperm count and furthermore, is suspected of having an affair with a fellow doctor, soon leading to the breakdown of his marriage."]}, {"page": "List of Doctor Who supporting characters", "response": ["*Madame Vastra (Neve McIntosh)"]}, {"page": "The Hellbound Heart", "response": ["A full-cast audio adaptation of the novella was released in 2018, adapted by Paul Kane and produced by Bafflegab Productions. It starred Alice Lowe as Kirsty,  Neve McIntosh as Julia, and Tom Meeten as both Frank and Rory. Other roles are played by Evie Dawnay, Chris Pavlo, Nicholas Vince, Scott Brooksbank, and Lisa Bowerman (famous for her portrayal of Bernice Summerfield and her work with Big Finish Productions)."]}, {"page": "Lady Fuchsia Groan", "response": ["Lady Fuchsia Groan is a fictional character: The daughter of Sepulchrave, 76th Earl of Groan, in Mervyn Peake's novels Titus Groan (1946) and Gormenghast (1950). In the BBC film adaptation (2000), Fuchsia is portrayed by Scottish actress Neve McIntosh.  ", "Fuchsia is a dreamer and a romantic, who escapes the dull pace of life in Gormenghast by reading fantasy tales. She frequently disappears into her secret attic rooms to fantasize and sulk. She scrawls on walls with charcoal and makes such wild claims as \"[W]hen I am Queen, I am going to burn down the castle!\", which upsets the aged Nannie Slagg. Lady Fuchsia Groan will never become Queen; but her fantasies of romance and adventure seem to keep her forever young. She responds to everything with childlike enthusiasm; and, beneath her callous and bratty exterior, she is sweet and loving. She loves her father, though she barely knows him; and, during his slow descent into madness, she often says she \"cannot bear\" to see him this way. She also has an enduring friendship with Dr. Alfred Prunesquallor, the Gormenghast physician. What Fuchsia seems to want most is someone to love her. Actress Neve McIntosh said of the character, \"She locks herself in her attic where she lives in her imagination. All she wants is a knight in shining armor to come up to the castle tower and carry her off.\"Fuchsia, PBS.org Fuchsia's favorite drink is elderberry wine.The Gormenghast Trilogy by Mervyn Peake\", The Hitchhiker's Guide to the Galaxy: Earth Edition"]}, {"page": "New Series Adventures", "response": ["|S3 ||Dark Horizons||J T Colgan||Eleventh||None|| 7 July 2012 || || Neve McIntosh", "|54 ||The Crawling Terror ||Mike Tucker||Twelfth||Clara Oswald|| 11 September 2014 ||  || Neve McIntosh"]}, {"page": "Gormenghast (TV serial)", "response": ["| Lady Fuchsia Groan || Neve McIntosh"]}, {"page": "Romani people in fiction", "response": ["|2001||Gypsy Woman||UK||Starring Jack Davenport and Neve McIntosh."]}, {"page": "Fantasporto", "response": ["| 2010 ||  Neve McIntosh ||Salvage"]}, {"page": "The Hound of the Baskervilles (2002 film)", "response": ["*Neve McIntosh as Beryl Stapleton"]}, {"page": "Boroughmuir High School", "response": ["*Neve McIntosh (actress)"]}, {"page": "Niamh", "response": ["*Neve McIntosh (born 1972), Scottish actress"]}, {"page": "The Ghost Squad", "response": ["* Neve McIntosh as W.P.C. Sarah Houghton (Episode 6)"]}, {"page": "List of Scottish actors", "response": ["*Neve McIntosh (born 1972)"]}, {"page": "River Song (Doctor Who)", "response": ["River appears again in the fifth episode of the seventh series, titled \"The Angels Take Manhattan\" (2012), where she encounters the Doctor and her parents, Rory and Amy, in 1930s New York City. At this later point in her timeline, she is a professor of archaeology and a free woman, having been released from the Stormcage Prison after the Doctor erased all evidence of his existence. When her parents are sent permanently back in time by the Weeping Angels, to be forever parted from the Doctor, she arranges for Amy to leave the Doctor a message in the form of an epilogue in a book they have been reading written by her in the 1930s. Although she agrees to travel with the Doctor for the time being, she declines his offer of being a full-time companion. In \"The Name of the Doctor\" (2013), the deceased River's consciousness is summoned from the Library computer, where she has existed since \"Forest of the Dead\", into a psychic 'conference call' by the Doctor's friend Madame Vastra (Neve McIntosh). There, she and Clara (Jenna Coleman) learn that the Doctor's grave has been discovered. River maintains the psychic link with Clara after the call ends, and counsels her throughout the exploration of the Doctor's tomb, although she seems to be invisible to everyone else. When the Doctor and his companions are threatened by the Great Intelligence, she whispers the Doctor's name in order to open his tomb which is inside the TARDIS. After Clara enters the Doctor's time stream to save him from the Great Intelligence, who entered it first so he could destroy the Doctor in all his regenerations, the Doctor reveals that he could see River all along, but had been avoiding confronting her continued existence because it was too painful for him to bear. After he kisses her, River feels closure and fades away. However, before disappearing River points out that her continued presence indicates that Clara has not been destroyed by entering his time stream, and, therefore, he can save her."]}, {"page": "Debbie Rush", "response": ["After training at the Manchester School of Acting when she was in her thirties, she has also starred in Shameless and Hollyoaks in the City. Rush also filmed the role of Pam in the horror film Salvage alongside Neve McIntosh."]}, {"page": "Twelfth Doctor", "response": ["In February 2019, the Twelfth Doctor made his first Big Finish appearance in The Astrea Conspiracy, narrated by Neve McIntosh. The Twelfth Doctor has since appeared in more Short Trips stories and the anthology series The Twelfth Doctor Chronicles narrated by Jacob Dudman."]}, {"page": "Phoenix Fan Fusion", "response": ["|Alex Kingston, Billie Piper, Oded Fehr, Mark Pellegrino, Timothy Omundson, Bob Morley, Arryn Zech, Caitlin Glass, Caity Lotz, Dan Starkey, David Fielding, David Ramsey, D. C. Douglas, Emma Caulfield, Eve Myles, Gates McFadden, Glenn Morshower, James Marsters, Jess Harnell, Kane Hodder, Sam Jones, Patrick Rothfuss, George Perez, Kara Ashley, Ksenia Solo, Lee Majors, Lindsay Wagner, Martin Kove, Maurice LaMarche, Neve McIntosh, Nolan North, Ralph Macchio, Robert Beltran, Sean Astin, Tony Todd, Troy Baker, William Zabka, Mike Zeck, among others."]}, {"page": "Gallifrey One", "response": ["|colspan=\"3\"|Freema Agyeman, Sylvester McCoy, Philip Hinchcliffe, Mark Strickson, Peter Purves, Deborah Watling, Ben Browder, Frances Barber, Michael Jayston, Neve McIntosh, Frazer Hines, Nicholas Pegg, Dan Starkey, Neve McIntosh, Ian McNeice, Finn Jones, Ashley Eckstein, Paul Marc Davis, Anjli Mohindra, Gary Russell, Ed Stradling, Richard Dinnick", "| colspan=\"3\" |John Hurt, Peter Davison, Colin Baker, Michelle Gomez, Ingrid Oliver, Samuel Anderson, Nicola Bryant, Frazer Hines, Clare Higgins, Neve McIntosh, Julian Glover, Patricia Quinn, Ian McNeice, Sarah Dollard, Jamie Mathieson, Jessica Martin, India Fisher, Sarah Douglas, Naoko Mori, Andrew Hayden-Smith, Andy Pryor, Andrew Cartmel, Gary Russell, Paul Cornell, Phil Plait, Michelle Thaller, Simon Guerrier, Nichelle Nichols, Tony Lee, Richard DinnickConvention Guests Gallifrey 2016 GallifreyOne.com. Retrieved 13 February 2016."]}, {"page": "Doctor Who (series 5)", "response": ["Alex Kingston, who played River Song in the Series 4 episodes, \"Silence in the Library\" and \"Forest of the Dead\", reprised her role in the two-part stories \"The Time of Angels\" and \"Flesh and Stone\" and \"The Pandorica Opens\" and \"The Big Bang\". Although Kingston did not expect to return, Moffat always intended for River to return to the series. Arthur Darvill appeared in seven episodes as Rory Williams, Amy's fiancé, and was a companion in six of the episodes. Darvill had worked with Smith on a play, Swimming with Sharks. He received two scenes from the first episode and one from the sixth for his audition, but (except for Rory being Amy's boyfriend) he was not informed of the character's details. Moffat noted \"just how funny\" Darvill was during his audition. The actor felt \"privileged\" to be part of the show, and was pleased with Rory's storyline. Guest stars in the series included Olivia Colman, James Corden, Annette Crosbie, Tony Curran, Iain Glen, Daisy Haggard, Terrence Hardiman, Toby Jones, Helen McCrory, Neve McIntosh, Ian McNeice, Stephen Moore, Lucian Msamati, Bill Nighy, Sophie Okonedo, Bill Paterson, Alex Price, Robert Pugh, Nia Roberts, Meera Syal and Nina Wadia."]}, {"page": "The Be All and End All", "response": ["The Be All and End All is a 2009 British film shot in Liverpool. It stars Eugene Byrne, Josh Bolt, Connor McIntyre, Liza Tarbuck and Neve McIntosh. With comic and heartfelt results the story tells the story of a friendship between two boys Ziggy (Byrne) and Robbie (Bolt). Robbie is dying of cardiomyopathy and desperately does not want to leave the earth a virgin."]}, {"page": "Cold Blood (Doctor Who)", "response": ["Continuing from the previous episode, alien time traveller the Doctor (Matt Smith) and geologist Nasreen Chaudhry (Meera Syal) have taken the TARDIS deep below the ground to the Silurian city where the Doctor's companion Amy Pond (Karen Gillan), a local man named Mo (Alun Raglan), and Mo's son, Elliot (Samuel Davies), are being held hostage. Meanwhile, above ground, Amy's fiancé, Rory (Arthur Darvill); Mo's wife, Ambrose (Nia Roberts); and Ambrose's father, Tony (Robert Pugh), keep watch over Alaya (Neve McIntosh), a captured Silurian who is the key to freeing the hostages. While the Doctor leaves Amy and Nasreen to negotiate sharing the planet with the Silurians, to help Mo find his son Eliot, it is revealed that Restac's sister Alaya has been killed by Ambrose on the surface."]}, {"page": "The Hungry Earth", "response": ["In the episode, the Eleventh Doctor—a time travelling alien played by Matt Smith—and his companions Amy Pond (Karen Gillan) and Rory Williams (Arthur Darvill) land in Wales in 2020, where a drilling operation headed by Nasreen Chaudhry (Meera Syal) is drilling deep into the earth and disrupting a civilisation of Silurians who dwell beneath the earth. The Silurians cause holes to open in the earth, one of which consumes Amy. The Doctor and Rory capture one Silurian, Alaya (Neve McIntosh), and the Doctor instructs Rory and a local family to not harm Alaya, as it could spark a war. He then takes Nasreen in the TARDIS to the Silurian civilisation to rescue Amy and kidnapped locals Mo (Alun Raglan) and Elliot (Samuel Davies).", "Patrick Mulkern of Radio Times gave the episode a positive review, saying that it felt \"like proper, classic Doctor Who\" in terms of  \"gripping storytelling, terrific pace, spooky direction, a grand idea...a small-scale Earth setting in the near future, characters worth caring about...plenty of meat for the three leads\" and \"a companion in real peril\". He particularly praised the performances of Syal and Smith. He also enjoyed the Silurian's redesign, saying that the old one \"would...look ridiculous today\". Though he \"missed\" the old voice from Peter Halliday, he said he adjusted to Neve McIntosh."]}, {"page": "List of British films of 2010", "response": ["|Salvage || Lawrence Gough || Neve McIntosh, Shaun Dooley || Comedy ||TBA|| https://www.bbc.co.uk/bbcfilms/film/salvage"]}, {"page": "Single Father (TV series)", "response": ["*Neve McIntosh – Anna, Rita's adoptive sister"]}, {"page": "Sarah Frankcom", "response": ["* The Lady from the Sea by Henrik Ibsen with Neve McIntosh and Reece Dinsdale (Oct. 2010)Exchange Theatre, About Us"]}]}}