{"wiki_id": "http://www.wikidata.org/entity/Q333050", "itemLabel": "Robert Stewart, Viscount Castlereagh", "itemDescription": "British politician (1769-1822)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Stewart,_Viscount_Castlereagh", "wikipedia_page": {"main": "Robert Stewart, 2nd Marquess of Londonderry,  (18 June 1769 – 12 August 1822), usually known as Lord Castlereagh, derived from the courtesy title Viscount Castlereagh (UK:  KAH-səl-ray) by which he was styled from 1796 to 1821, was an Irish politician and a British statesman. As secretary to the Viceroy of Ireland, he worked to suppress the Rebellion of 1798 and to secure passage in 1800 of the Irish Act of Union. As the Foreign Secretary of the United Kingdom from 1812, he was central to the management of the coalition that defeated Napoleon, and was British plenipotentiary at the Congress of Vienna. In the post-war government of Lord Liverpool, Castlereagh was seen to support harsh measures against agitation for reform. Taking his own life, he died in office in 1822.\nEarly in his career in Ireland, and following a visit to revolutionary France, Castlereagh recoiled from the democratic politics of his Presbyterian constituents in Ulster. Crossing the floor of the Irish Commons in support of the government, he took a leading role in detaining members of the republican conspiracy, the United Irishmen, his former political associates among them. After the 1798  Rebellion, as Chief Secretary for Ireland he pushed the Act of Union through the Irish Parliament. But it was without the Catholic Emancipation that both he and British Prime Minister William Pitt believed should have accompanied the creation of a United Kingdom.\nFrom 1804 Castlereagh served under Pitt and then the Duke of Portland as Secretary of State for War. In 1809 he was obliged to resign after figthing a duel with the Foreign Secretary, George Canning, in a dispute over the Walcheren Expedition. In 1812 Castlreagh returned to government serving Lord Liverpool as Foreign Secretary and as Leader of the House of Commons.\nCastlereagh organised and financed the alliance that defeated Napoleon, bringing the powers together at the Treaty of Chaumont in 1814. After Napoleon's second abdication in 1815, Castlereagh worked with the European courts represented at the Congress of Vienna to frame the territorial, and broadly conservative, continental order that was to hold until mid century. He blocked harsh terms against France believing that a treaty based on vengeance and retaliation would upset a necessary balance of powers. France was restored to the frontiers of 1791, and her British-occupied colonies were returned. In 1820 Castlereagh enunciated a policy of non-intervention, proposing that Britain hold herself aloof from continental affairs. \nAfter 1815, at home Castlereagh supported repressive measures that linked him in public opinion to the Peterloo Massacre of 1819. Widely reviled in both Ireland and Great Britain, overworked, and personally distressed, Castlereagh committed suicide in 1822.\nHis biographer John Bew writes:\n\nNo British statesman of the 19th century reached the same level of international influence....But very few have been so maligned by their own countrymen and so abused in history. This shy and handsome Ulsterman is perhaps the most hated domestic political figure in both modern British and Irish political history.", "link_mentions": [{"page": "August 12", "response": ["*1822 – Robert Stewart, Viscount Castlereagh, Irish-English politician, Secretary of State for Foreign Affairs (b. 1769)"]}, {"page": "June 18", "response": ["*1769 – Robert Stewart, Viscount Castlereagh, Irish-English politician, Secretary of State for Foreign and Commonwealth Affairs (d. 1822)"]}, {"page": "1822", "response": ["* August 12 – Robert Stewart, Viscount Castlereagh, British foreign secretary (suicide) (b. 1769)"]}, {"page": "1769", "response": ["* June 18 – Robert Stewart, Viscount Castlereagh, British statesman, diplomat, and soldier (d. 1822)"]}, {"page": "Rum Rebellion", "response": ["Bligh, under instructions from the Colonial Office, attempted to normalise trading conditions in the colony by prohibiting the use of spirits as payment for commodities. Bligh communicated his policy to the Colonial Office in 1807, with the advice that his policy would be met with resistance. Robert Stewart, Viscount Castlereagh, Secretary of State for War and the Colonies wrote back to Bligh, his instructions being received on 31 December 1807.  The instructions were to stop the barter of spirits and H.V. Evatt concludes in his history of the Rebellion that ... \"Bligh was authorised to prevent free importation, to preserve the trade under his entire control, to enforce all penalties against illegal import, and to establish regulations at his discretion for the sale of spirits\".Evatt, pp. 88–9"]}, {"page": "County Armagh", "response": ["* Robert Stewart, Viscount Castlereagh (1759–1822), educated in The Royal School, Armagh. British Foreign Secretary, Secretary for War, Leader of the United Kingdom House of Commons and Chief Secretary for Ireland"]}, {"page": "County Down", "response": ["* Robert Stewart, Viscount Castlereagh, British Foreign Secretary and diplomat at Congress of Vienna, brought up in family seat Mount Stewart"]}, {"page": "Regency era", "response": ["* Robert Stewart, Viscount Castlereagh", "* Robert Stewart, Viscount Castlereagh"]}]}}