{"wiki_id": "http://www.wikidata.org/entity/Q333182", "itemLabel": "Iain Macleod", "itemDescription": "British politician, cabinet minister and contract bridge player (1913-1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Iain_Macleod", "wikipedia_page": {"main": "Iain Norman Macleod (11 November 1913 – 20 July 1970) was a British Conservative Party politician and government minister.\nA playboy and professional bridge player in his twenties, after war service Macleod worked for the Conservative Research Department before entering Parliament in 1950. He was an outstanding orator and debater, and was soon appointed Minister of Health, later serving as Minister of Labour. He served an important term as Secretary of State for the Colonies under Harold Macmillan in the early 1960s, overseeing the independence of many African countries from British rule but earning the enmity of Conservative right-wingers, and the soubriquet that he was \"too clever by half\".\nMacleod was unhappy with the \"emergence\" of Sir Alec Douglas-Home as party leader and Prime Minister in succession to Macmillan in 1963 (he claimed to have supported Macmillan's deputy Rab Butler, although it is unclear exactly what his recommendation had been). He refused to serve in Home's government, and whilst serving as editor of The Spectator, alleged that the succession had been stitched up by Macmillan and a \"magic circle\" of Old Etonians.\nMacleod did not contest the first ever Conservative Party leadership election in 1965, but endorsed the eventual winner Edward Heath. When the Conservatives returned to power in June 1970, he was appointed Chancellor of the Exchequer in Heath's government, but died suddenly only a month later.", "link_mentions": [{"page": "Distance education", "response": ["The Open University in the United Kingdom was founded by the-then Labour government led by Prime Minister, Harold Wilson, based on the vision of Michael Young. Planning commenced in 1965 under the Minister of State for Education, Jennie Lee, who established a model for the Open University (OU) as one of widening access to the highest standards of scholarship in higher education and set up a planning committee consisting of university vice-chancellors, educationalists, and television broadcasters, chaired by Sir Peter Venables. The British Broadcasting Corporation (BBC) Assistant Director of Engineering at the time, James Redmond, had obtained most of his qualifications at night school, and his natural enthusiasm for the project did much to overcome the technical difficulties of using television to broadcast teaching programs .The Open University revolutionized the scope of the correspondence program and helped to create a respectable learning alternative to the traditional form of education. It has been at the forefront of developing new technologies to improve the distance learning service as well as undertaking research in other disciplines. Walter Perry was appointed the OU's first vice-chancellor in January 1969, and its foundation secretary was Anastasios Christodoulou. The election of the new Conservative government under the leadership of Edward Heath, in 1970; led to budget cuts under Chancellor of the Exchequer Iain Macleod (who had earlier called the idea of an Open University \"blithering nonsense\"). However, the OU accepted its first 25,000 students in 1971, adopting a radical open admissions policy. At the time, the total student population of conventional universities in the United Kingdom was around 130,000."]}, {"page": "July 20", "response": ["*1970 – Iain Macleod, English journalist and politician, Chancellor of the Exchequer (b. 1913)"]}, {"page": "Neville Chamberlain", "response": ["Conservative MP Iain Macleod's 1961 biography of Chamberlain was the first major biography of a revisionist school of thought on Chamberlain. The same year, A. J. P. Taylor, in his The Origins of the Second World War, found that Chamberlain had adequately rearmed Britain for defence (though a rearmament designed to defeat Germany would have taken massive additional resources) and described Munich as \"a triumph for all that was best and most enlightened in British life ... [and] for those who had courageously denounced the harshness and short-sightedness of Versailles\"."]}, {"page": "Roy Jenkins", "response": ["In 1993, he was appointed to the Order of Merit. Also that year, his Portraits and Miniatures was published. The main body of the book is a set of 6 biographical essays (Rab Butler, Aneurin Bevan, Iain Macleod, Dean Acheson, Konrad Adenauer, Charles de Gaulle), along with lectures, articles and book reviews.Campbell, Roy Jenkins: A Well-Rounded Life, p. 690."]}, {"page": "Stagflation", "response": ["The term, a portmanteau of stagnation and inflation, is generally attributed to Iain Macleod, a British Conservative Party politician who became Chancellor of the Exchequer in 1970. Macleod used the word in a 1965 speech to Parliament during a period of simultaneously high inflation and unemployment in the United Kingdom.Online Etymology Dictionary Douglas Harper, Historian. http://dictionary.reference.com/browse/stagflation (accessed 5 May 2007).House of Commons Official Report (also known as Hansard), 17 November 1965, page 1,165.Introduction, page 9. Warning the House of Commons of the gravity of the situation, he said: \"We now have the worst of both worlds—not just inflation on the one side or stagnation on the other, but both of them together. We have a sort of 'stagflation' situation. And history, in modern terms, is indeed being made.\""]}, {"page": "Sierra Leone", "response": ["On 20 April 1960, Milton Margai led a 24-member Sierra Leonean delegation at constitutional conferences that were held with the Government of Queen Elizabeth II and British Colonial Secretary Iain Macleod in negotiations for independence held in London."]}, {"page": "History of Sierra Leone", "response": ["On 20 April 1960, Sir Milton Margai led the Sierra Leonean delegation in the negotiations for independence at the constitutional conferences held with Queen Elizabeth II and British Colonial Secretary Iain Macleod, at Lancaster House in London. All twenty-four members of the Sierra Leonean delegation were prominent and well-respected politicians including Sir Milton's younger brother lawyer Sir Albert Margai, trade unionist Siaka Stevens, SLPP-strongman Lamina Sankoh, Creole activist Isaac Wallace-Johnson, Paramount chief Ella Koblo Gulama, educationist Mohamed Sanusi Mustapha, Dr John Karefa-Smart, Professor Kande Bureh, lawyer Sir Banja Tejan-Sie, former Freetown Mayor Eustace Henry Taylor Cummings, educationist Amadu Wurie, and Creole diplomat Hector Reginald Sylvanus Boltman."]}, {"page": "Conservative Party (UK)", "response": ["In 1958, Geoffrey Howe co-authored the report A Giant's Strength published by the Inns of Court Conservative Association. The report argued that the unions had become too powerful and that their legal privileges ought to be curtailed. Iain Macleod discouraged the authors from publicising the report. Macmillan believed that trade union votes had contributed towards the 1951 and 1955 victories and thought that it \"would be inexpedient to adopt any policy involving legislation which would alienate this support\"."]}, {"page": "Enoch Powell", "response": ["Though he voted for the Labour Party in their 1945 landslide victory, because he wanted to punish the Conservative Party for the Munich agreement, after the war he joined the Conservatives and worked for the Conservative Research Department under Rab Butler, where his colleagues included Iain Macleod and Reginald Maudling.", "In October 1963, along with Iain Macleod, Reginald Maudling and Lord Hailsham, Powell tried in vain to persuade Rab Butler not to serve under Alec Douglas-Home, in the belief that the latter would be unable to form a government. Powell commented that they had given Butler a revolver, which he had refused to use in case it made a noise or hurt anyone.Shepherd 1994, p. 334. Macleod and Powell refused to serve in Home's Cabinet. This refusal is not usually attributed to personal antipathy to Douglas-Home but rather to anger at what Macleod and Powell saw as Macmillan's underhand manipulation of colleagues during the process of choosing a new leader. However, at the meeting at his house on the evening of 17 October, Powell, who still enjoyed a liberal reputation on racial issues after his Hola Massacre Speech, reportedly said of Home: \"How can I serve under a man whose views on Africa are positively Portuguese?\"Sandbrook 2005, pp. 701–705.", "In mid-1968, Powell's book The House of Lords in the Middle Ages was published after twenty years' work. At the press conference for its publication, Powell said if the government introduced a Bill to reform the Lords he would be its \"resolute enemy\". Later in 1968, when the Labour government published its Bills for the new session, Powell was angry at Heath's acceptance of the plan drawn up by the Conservative Iain Macleod and Labour's Richard Crossman to reform the Lords, titled the Parliament (No. 2) Bill. Crossman, opening the debate on 19 November, said the government would reform the Lords in five ways: removing the voting rights of hereditary peers; making sure no party had a permanent majority; ensuring the government of the day usually passed its laws; weakening the Lords' powers to delay new laws; and abolishing the power to refuse subordinate legislation if it had been passed by the Commons. Powell spoke in the debate, opposing these plans. He said the reforms were \"unnecessary and undesirable\" and that there was no weight in the claim that the Lords could \"check or frustrate the firm intentions\" of the Commons. He claimed that only election or nomination could replace the hereditary nature of the Lords. If they were elected it would pose the dilemma of which House was truly representative of the electorate. He also had another objection: \"How can the same electorate be represented in two ways so that the two sets of representatives can conflict and disagree with one another?\" Those nominated would be bound to the Chief Whip of their party through a sort of oath and Powell asked \"what sort of men and women are they to be who would submit to be nominated to another chamber upon condition that they will be mere dummies, automatic parts of a voting machine?\" He also stated that the inclusion in the proposals of thirty crossbenchers was \"a grand absurdity\", because they would have been chosen \"upon the very basis that they have no strong views of principle on the way in which the country ought to be governed\". Powell claimed the Lords derived their authority not from a strict hereditary system but from its prescriptive nature: \"It has long been so, and it works\". He then added that there was not any widespread desire for reform: he indicated a recent survey of working-class voters that showed that only one-third of them wanted to reform or abolish the House of Lords, with another third believing the Lords were an \"intrinsic part of the national traditions of Britain\". Powell deduced from this, \"As so often, the ordinary rank and file of the electorate have seen a truth, an important fact, which has escaped so many more clever people—the underlying value of that which is traditional, that which is prescriptive\"."]}, {"page": "Edward Heath", "response": ["Chancellor of the Exchequer Iain Macleod died and was replaced on 20 July 1970 by Anthony Barber. Heath's planned economic policy changes (including a significant shift from direct to indirect taxation) remained largely unimplemented: the Selsdon policy document was more or less abandoned as unemployment increased considerably by 1972. By January that year, the number of unemployed reached a million, the highest level for more than two decades. Opposed to unemployment on moral grounds, Heath encouraged a famous \"U-Turn\" in economic policy that precipitated what became known as the \"Barber boom\". This was a two-range process involving the budgets of 1972 and 1973, the former of which pumped £2.5 billion into the economy in increased pensions and benefits and tax reductions. By early 1974, as a result of this Keynesian economic strategy, unemployment had fallen to under 550,000. The economic boom did not last, and the Heath government implemented various cuts that led to the abandonment of policy goals such as a planned expansion of nursery education."]}, {"page": "The Spectator", "response": ["Editorship of The Spectator has often been a step on the ladder to high office in the Conservative Party in the United Kingdom. Past editors include Boris Johnson (1999–2005) and other former cabinet members Ian Gilmour (1954–1959), Iain Macleod (1963–1965), and Nigel Lawson (1966–1970). Since 2009, the magazine's editor has been journalist Fraser Nelson.", "Gilmour gave up the editorship in 1959, in part to abet his chance of selection as a Conservative MP. He appointed his deputy Brian Inglis, who introduced to the magazine a fresh spirit of political and satirical satire. In 1959—much to the embarrassment of Gilmour (who remained the owner)—The Spectator advised either voting for the Liberal Party or tactically abstaining. Despite a marked increase in sales, Gilmour felt that The Spectator was losing its political edge, so replaced him in 1962 with Iain Hamilton. Hamilton successfully balanced a keener focus on current affairs with some more raucous contributions: the young team behind Private Eye were commissioned to write a mock eight-page \"Child's Guide to Modern Culture\". Much to the shock of Hamilton and the Spectator staff, Gilmour replaced Hamilton in 1963 with Iain Macleod, the Conservative MP who had resigned from the cabinet on the controversial appointment of Sir Alec Douglas-Home to succeed Harold Macmillan as Prime Minister. A widely circulated letter, signed by Spectator journalists and board members, berated Gilmour for mistreating an admired editor and appointing an active politician who could jeopardise the independence of the magazine: \"We believe strongly that The Spectator, with its long and honourable history of independent opinion, should not be tossed about at the whim of the proprietor or lose its independence by identification with a narrow political faction.\"Letter first printed in The Times of 2 Nov. 1963.", "In disclosing, from the horse's mouth, the mysterious circumstances of Douglas-Home's appointment, the article caused an immediate sensation. Churchill's book was all but obliterated by the review, which said that \"four fifths\" of it \"could have been compiled by anyone with a pair of scissors, a pot of paste and a built-in prejudice against Mr Butler and Sir William Haley\".The Spectator, 17 January 1964 That week's edition, bearing the headline \"Iain Macleod, What Happened\", sold a record number of copies.", "*Iain Macleod, 1963–1965"]}, {"page": "Aneurin Bevan", "response": ["In March 1952, a poorly prepared Bevan came off the worse in an evening Commons debate on health with Conservative backbencher Iain Macleod, whose performance led Churchill to appoint him as Minister of Health some six weeks after the debate."]}, {"page": "Chancellor of the Exchequer", "response": ["| Iain Macleod"]}, {"page": "Harold Macmillan", "response": ["Macmillan felt that if the costs of holding onto a particular territory outweighed the benefits then it should be dispensed with. During the Kenya Emergency, the British authorities tried to protect the Kikuyu population from the Mau Mau guerrillas (who called themselves the “Land and Freedom Army”) by interning the Kikuyu in camps. A scandal erupted when the guards at the Hola camp publicly beat 11 prisoners to death on 3 March 1959, which attracted much adverse publicity as the news filtered out from Kenya to the United Kingdom. Many in the British media compared the living conditions in the Kenyan camps to the concentration camps of Nazi Germany, saying that the people in the camps were emaciated and sickly. The report of the Devlin Commission in July 1959 concerning the suppression of demonstrators in Nyasaland (modern-day Malawi) called Nyasaland \"a police state\". In the aftermath of criticism about colonial policies in Kenya and Nyasland, Macmillan from 1959 onward started to see the African colonies as a liability, arguing at cabinet meetings that the level of force required to hang onto them would result in more domestic criticism, international opprobrium, costly wars, and would allow the Soviet Union to establish influence in the Third World by supporting self-styled \"liberation\" movements that would just make things worse. After securing a third term for the Conservatives in 1959 he appointed Iain Macleod as Colonial Secretary. Macleod greatly accelerated decolonisation and by the time he was moved to Conservative Party chairman and Leader of the Commons in 1961 he had made the decision to give independence to Nigeria, Tanganyika, Kenya, Nyasaland (as Malawi) and Northern Rhodesia (as Zambia).Toye, Richard Churchill's Empire: The World That Made Him and the World He Made (2010) p. 306 Macmillan embarked on his \"Wind of Change\" tour of Africa, starting in Ghana on 6 January 1960. He made the famous 'wind of change' speech in Cape Town on 3 February 1960. It is considered a landmark in the process of decolonisation.", "* Iain Macleod: Minister of Labour and National Service", "* Iain Macleod: Secretary of State for the Colonies", "* Iain Macleod: Secretary of State for the Colonies", "* Iain Macleod: Chancellor of the Duchy of Lancaster", "* Iain Macleod: Chancellor of the Duchy of Lancaster"]}, {"page": "One-nation conservatism", "response": ["The describing phrase 'one-nation Tory' originated with Benjamin Disraeli (1804–1881), who served as the chief Conservative spokesman and became Prime Minister in February 1868. He devised it to appeal to working-class people, who he hoped would see it as a way to improve their lives via factory and health acts as well as greater protection for workers. The ideology featured heavily during Disraeli's terms in government, during which considerable social reforms were passed by the British parliament. Towards the end of the 19th century, the Conservative Party moved away from paternalism in favour of free-market capitalism. In the first half of the 20th century, fears of extremism saw a revival of one-nation conservatism. The Conservative Party continued to espouse the philosophy throughout the post-war consensus from 1945. One-nation thinking influenced their tolerance of the Labour government's Keynesian intervention in the economy, formation of a welfare state and the National Health Service. Thanks to Iain Macleod, Edward Heath and Enoch Powell, special attention after 1950 was paid to one-nation conservatism that promised support for the poorer and working class elements in the Party coalition.Robert Walsha, \"The one nation group and one nation Conservatism, 1950–2002.\" Contemporary British History 17.2 (2003): 69–120."]}]}}