{"wiki_id": "http://www.wikidata.org/entity/Q333680", "itemLabel": "Chloe Smith", "itemDescription": "British politician (born 1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chloe_Smith", "wikipedia_page": {"main": "Chloe Rebecca Smith (born 17 May 1982) is a British Conservative Party politician who has served as Member of Parliament (MP) for Norwich North since 2009.\nSmith was elected to the seat in a by-election on 23 July 2009 following the resignation of Labour MP Ian Gibson after the MPs' expenses scandal.  Smith held a number of junior ministerial roles under both the Cameron-Clegg ministry and the first May ministry. In February 2020, she was promoted to Minister of State for the Cabinet Office during the first Johnson ministry.\nIn September 2021, Smith was appointed Minister of State for Disabled People, Work and Health at the Department for Work and Pensions during the cabinet reshuffle.", "link_mentions": [{"page": "Banjo", "response": ["The five-string banjo has been used in classical music since before the turn of the 20th century. Contemporary and modern works have been written or arranged for the instrument by Jerry Garcia, Buck Trent, Béla Fleck, Tony Trischka, Ralph Stanley, Steve Martin, George Crumb, Modest Mouse, Jo Kondo, Paul Elwood, Hans Werner Henze (notably in his Sixth Symphony), Daniel Mason of Hank Williams III's Damn Band, Beck, the Water Tower Bucket Boys, Todd Taylor, J.P. Pickens, Peggy Honeywell, Norfolk & Western, Putnam Smith, Iron & Wine, The Avett Brothers, The Well Pennies, Punch Brothers, Julian Koster, Sufjan Stevens, Sarah Jarosz and sisters Leah Song and Chloe Smith from Rising Appalachia"]}, {"page": "May 17", "response": ["*  1982   – Chloe Smith, English politician"]}, {"page": "Norfolk", "response": ["*Norwich North. Won in 2019 by Chloe Smith (Conservative)."]}, {"page": "Jeremy Paxman", "response": ["On 26 June 2012, he interviewed the Economic Secretary to the Treasury Chloe Smith about Chancellor George Osborne's decision that day to delay plans to increase fuel duty. Paxman questioned the apparent change in her views on fuel duty. Senior politicians, including John Prescott, questioned Osborne's judgement for sending a junior minister onto the programme in place of himself."]}, {"page": "Chloe", "response": ["* Chloe Smith (born 1982), British Conservative Party politician", "* Chloe Smith (musician), American folk musician and activist"]}, {"page": "Norwich", "response": ["Norwich North, which includes some rural wards of Broadland District, was held by Labour from 1950 to 1983 when it was gained by the Conservatives. Labour regained the seat in 1997, holding it until a by-election in 2009. The current MP is the Conservative, Chloe Smith, who held the seat in the 2015 General Election. Norwich South, which includes part of South Norfolk District, was held by Labour from February 1974 to 1983, when it was gained by the Conservatives. John Garrett regained the seat for Labour in 1987. Charles Clarke became Labour MP for Norwich South in 1997. In the 2010 General Election, Labour lost the seat to the Liberal Democrats, with Simon Wright becoming MP. At the 2015 General Election, Clive Lewis regained the seat for Labour."]}, {"page": "Ian Gibson (politician)", "response": ["Believing his position was \"untenable\" following the panel's decision, he resigned as an MP through the traditional procedural device of becoming Crown Steward and Bailiff of the three Chiltern Hundreds of Stoke, Desborough and Burnham. In the subsequent 2009 Norwich North by-election, Conservative Chloe Smith won the seat over the Labour candidate, who saw the party's vote share drop by almost 27%."]}, {"page": "Department for Work and Pensions", "response": ["| Chloe Smith MP"]}, {"page": "List of United Kingdom by-elections (1979–2010)", "response": ["|Chloe Smith"]}, {"page": "Minister for the Cabinet Office", "response": ["|Chloe Smith"]}, {"page": "Economic Secretary to the Treasury", "response": ["|Chloe Smith"]}, {"page": "Norwich North (UK Parliament constituency)", "response": ["Norwich North is a constituency represented in the House of Commons of the UK Parliament since 2009 by Chloe Smith, a Conservative.", "It was initially a safe seat for the Labour Party, held continuously by the party until 1983, when major boundary changes made the seat much more favourable to the Conservatives, who then held the seat from 1983 to 1997. The Labour member from 1997 to 2009 was Dr Ian Gibson, who resigned as an MP with immediate effect on 5 June 2009 after being implicated in the expenses scandal. A by-election was held to replace him on 23 July 2009, which was won by the Conservative Chloe Smith. Chloe Smith has retained the seat in the 2010, 2015, 2017 and 2019 general elections, achieving over 50% of the vote for the first time in 2019.", "| Chloe Smith"]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["* 23 July: Norwich North - Chloe Smith (Con) to replace Ian Gibson (Lab), who resigned after a Labour Party panel prohibited him from standing for re-election."]}, {"page": "Justine Greening", "response": ["As the first Conservative elected on the evening of the election, her victory was the first real sign that the Conservative Party was to reduce the Labour Government's majority and begin to recover from the landslide defeats of the 1997 and 2001 general elections. Michael Howard, who had visited Putney to give a speech on his first day as Conservative Leader, returned there on the morning after the election to congratulate Putney Conservatives and give the speech in which he announced his intention to step down. Greening was the youngest female Conservative MP in the House of Commons until Chloe Smith was elected to Parliament on 12 October 2009."]}, {"page": "Jo Swinson", "response": ["Swinson was elected to the House of Commons as the MP for East Dunbartonshire at the 2005 general election. She defeated John Lyons of Labour by 4,061 votes, and was the first ever Member of Parliament born in the 1980s. As the youngest MP she replaced fellow Lib Dem MP Sarah Teather as the \"Baby of the House\". This lasted until 2009, when Conservative MP Chloe Smith was elected at the Norwich North by-election."]}]}}