{"wiki_id": "http://www.wikidata.org/entity/Q3336784", "itemLabel": "Nathaniel Dance-Holland", "itemDescription": "English portrait painter and politician (1735-1811)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nathaniel_Dance-Holland", "wikipedia_page": {"main": "Sir Nathaniel Dance-Holland, 1st Baronet  (8 May 1735 – 15 October 1811) was a notable English portrait painter and later a politician.", "link_mentions": [{"page": "James Cook", "response": ["Upon his return, Cook was promoted to the rank of post-captain and given an honorary retirement from the Royal Navy, with a posting as an officer of the Greenwich Hospital. He reluctantly accepted, insisting that he be allowed to quit the post if an opportunity for active duty should arise. His fame extended beyond the Admiralty; he was made a Fellow of the Royal Society and awarded the Copley Gold Medal for completing his second voyage without losing a man to scurvy. Nathaniel Dance-Holland painted his portrait; he dined with James Boswell; he was described in the House of Lords as \"the first navigator in Europe\". But he could not be kept away from the sea. A third voyage was planned, and Cook volunteered to find the Northwest Passage. He travelled to the Pacific and hoped to travel east to the Atlantic, while a simultaneous voyage travelled the opposite route."]}, {"page": "Joshua Reynolds", "response": ["In the Battle of Ushant against the French in 1778, Lord Keppel commanded the Channel Fleet and the outcome resulted in no clear winner; Keppel ordered the attack be renewed and was obeyed except by Sir Hugh Palliser, who commanded the rear, and the French escaped bombardment. A dispute between Keppel and Palliser arose and Palliser brought charges of misconduct and neglect of duty against Keppel and the Admiralty decided to court-martial him. On 11 February 1779 Keppel was acquitted of all charges and became a national hero. One of Keppel's lawyers commissioned Sir Nathaniel Dance-Holland to paint a portrait of Keppel but Keppel redirected it to Reynolds. Reynolds alluded to Keppel's trial in the painting by painting his hand on his sword, reflecting the presiding officer's words at the court-martial: \"In delivering to you your sword, I am to congratulate you on its being restored to you with so much honour\".McIntyre, pp. 350–353."]}, {"page": "May 8", "response": ["*1735 – Nathaniel Dance-Holland, English painter and politician (d. 1811)"]}, {"page": "October 15", "response": ["*1811 – Nathaniel Dance-Holland, English painter and politician (b. 1735)"]}, {"page": "List of artworks on stamps of the United States", "response": ["|| 1732 || 1978 || || || James Cook portrait || Nathaniel Dance-Holland ||"]}, {"page": "1811 in art", "response": ["*October 15 – Sir Nathaniel Dance-Holland, English portrait painter and politician (born 1735)"]}, {"page": "Charles Seymour, 6th Duke of Somerset", "response": ["Charles was educated at Harrow School and Trinity College, Cambridge, where his portrait by Nathaniel Dance-Holland survives in the college's collection."]}, {"page": "George Dance the Younger", "response": ["* 143 Piccadilly for his brother Nathaniel Dance-Holland (his brother changed his name) (1807)"]}, {"page": "Francis Hayman", "response": ["He was an able teacher. His pupils included Mason Chamberlin, Nathaniel Dance-Holland, Thomas Seton and Lemuel Francis Abbott, and he was also a strong influence on Thomas Gainsborough."]}, {"page": "George Dance the Elder", "response": ["* Third son Sir Nathaniel Dance-Holland (1735–1811) was a notable painter. "]}, {"page": "East Grinstead (UK Parliament constituency)", "response": ["| 1807 || Sir Nathaniel Dance-Holland, Bt. || rowspan=\"4\" | Charles Ellis"]}, {"page": "1776 in art", "response": ["* Nathaniel Dance-Holland – The Dashwoods at West Wycombe Park"]}, {"page": "1811 in the United Kingdom", "response": ["* 15 October – Sir Nathaniel Dance-Holland, portrait painter and politician (born 1735)"]}, {"page": "1735 in art", "response": ["* May 8 – Sir Nathaniel Dance-Holland, English portrait painter and later a politician (died 1811)"]}, {"page": "1775 in art", "response": ["*Nathaniel Dance-Holland – Portrait of Captain James Cook"]}, {"page": "Great Bedwyn (UK Parliament constituency)", "response": ["| Sir Nathaniel Dance-Holland, Bt"]}]}}