{"wiki_id": "http://www.wikidata.org/entity/Q333811", "itemLabel": "John Swinney", "itemDescription": "Deputy First Minister of Scotland (born 1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Swinney", "wikipedia_page": {"main": "John Ramsay Swinney (born 13 April 1964) is a Scottish politician currently serving as Deputy First Minister of Scotland since 2014 and Cabinet Secretary for Covid Recovery since 2021. He was the leader of the Scottish National Party (SNP) from 2000 to 2004. He served as Finance Secretary from 2007 to 2016 and as Education Secretary from 2016 to 2021. Swinney has also served as the Member of the Scottish Parliament (MSP) for Perthshire North since 2011, having previously represented North Tayside from 1999 to 2011.\nSwinney served in the British House of Commons as Member of Parliament for Tayside North from 1997 to 2001. After Alex Salmond resigned the leadership in 2000, Swinney was elected Leader of the Scottish National Party in the ensuring leadership election. He became Leader of the Opposition in the Scottish Parliament. Swinney's leadership proved ineffectual, with a loss of one MP in 2001 and a further reduction to 27 MSPs in 2003 despite the Officegate scandal unseating previous First Minister Henry McLeish. However, the only parties to gain seats in that election where the Scottish Greens and the Scottish Socialist Party (SSP) which, like the SNP, support independence. After an unsuccessful leadership challenge in 2003, Swinney stepped down following disappointing results in the 2004 European Parliament election with Salmond returning to the role in the subsequent 2004 leadership contest.\nThe SNP won the highest number of seats in the Scottish Parliament in the 2007 election and Salmond was subsequently appointed First Minister. Swinney served under Salmond as Cabinet Secretary for Finance, Employment and Sustainable Growth from 2007 to 2014. After Nicola Sturgeon succeeded Salmond, she appointed Swinney as Deputy First Minister of Scotland in 2014. He also served as Cabinet Secretary for Finance, Constitution and Economy, until that role was divided into two posts in the second Sturgeon government as a result of the expansion of the Scottish Parliament's financial powers; he was then appointed Education Secretary in 2016, and then as Cabinet Secretary for Covid Recovery in 2021.", "link_mentions": [{"page": "List of Scots", "response": ["* John Swinney (born 1964), Scottish National Party (SNP) politician"]}, {"page": "Scotland", "response": ["The Scottish Parliament is a unicameral legislature with 129 members (MSPs): 73 of them represent individual constituencies and are elected on a first-past-the-post system; the other 56 are elected in eight different electoral regions by the additional member system. MSPs normally serve for a five-year period. The Parliament nominates one of its Members, who is then appointed by the monarch to serve as first minister. Other ministers are appointed by the first minister and serve at his/her discretion. Together they make up the Scottish Government, the executive arm of the devolved government. The Scottish Government is headed by the first minister, who is accountable to the Scottish Parliament and is the minister of charge of the Scottish Government. The first minister is also the political leader of Scotland. The Scottish Government also comprises the deputy first minister, currently John Swinney MSP, who deputises for the first minister during a period of absence. Alongside the deputy first minister's requirements as Deputy, the minister also has a cabinet ministerial responsibility. The current Scottish Government has nine cabinet secretaries and there are 15 other ministers who work alongside the cabinet secretaries in their appointed areas."]}, {"page": "Scottish National Party", "response": ["Alex Salmond had been elected MP for Banff and Buchan in 1987, after the re-admittance of 79 Group members, and was able to seize the party leadership after Wilson's resignation in 1990 after a contest with Margaret Ewing. This was a surprise victory as Ewing had the backing of much of the party establishment, including Sillars and then-Party Secretary John Swinney. The defection of Labour MP Dick Douglas further evidenced the party's clear left-wing positioning, particularly regarding opposition to the poll tax. Despite this, Salmond's leadership was unable to avert a fourth successive general election disappointment in 1992 with the party reduced back from 5 to 3 MPs.", "This meant that the party began as the official opposition in the parliament to a Labour-Liberal Democrat coalition government. Salmond found the move to a more consensual politics difficult and sought a return to Westminster, resigning the leadership in 2000 with John Swinney, like Salmond a gradualist, victorious in the ensuring leadership election. Swinney's leadership proved ineffectual, with a loss of one MP in 2001 and a further reduction to 27 MSPs in 2003 despite the Officegate scandal unseating previous First Minister Henry McLeish. However, the only parties to gain seats in that election were the Scottish Greens and the Scottish Socialist Party (SSP) which like the SNP support independence.", "At the 2017 UK general election the SNP underperformed compared to polling expectations, losing 21 seats to bring their number of Westminster MPs down to 35 – however this was still the party's second best result ever at the time. This was largely attributed by many, including former Deputy First Minister John Swinney, to their stance on holding a second Scottish independence referendum and saw a swing to the Unionist parties, with seats being picked up by the Conservatives, Labour and the Liberal Democrats and a reduction in their majorities in the other seats. Stephen Gethins, MP for North East Fife, came out of this election with a majority of just 2 to the Liberal Democrat candidate. High-profile losses included SNP Commons leader Angus Robertson in Moray and former party leader and First Minister Alex Salmond in Gordon.", "|John Swinney (born 1964)", "|John Swinney (born 1964)", "* John Swinney, 1986–1992", "* John Swinney (North Tayside), 2000–2004", "| rowspan=\"2\" data-sort-value=\"Swinney\" | John Swinney MSP for Perthshire North", "| align=left| John Swinney", "| align=left| John Swinney"]}, {"page": "Perth, Scotland", "response": ["For the purposes of the Scottish Parliament, Perth forms part of the constituencies of Perthshire North and Perthshire South and Kinross-shire. These two constituencies were created in 2011 as two of the nine constituencies within the Mid Scotland and Fife electoral region. Each constituency elects one Member of the Scottish Parliament (MSP) by the first past the post system of election, and the region elects seven additional members to produce a form of proportional representation. Perthshire North is currently represented by John Swinney (SNP) and Perthshire South and Kinross-shire is currently represented by Jim Fairlie (SNP)."]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| John Swinney"]}, {"page": "Perth and Kinross", "response": ["Perth and Kinross is covered by two Scottish Parliament constituencies and one electoral region. Following the 2021 Scottish Parliament election these two constituencies - Perthshire South and Kinross-shire and Perthshire North - are held respectively by Jim Fairlie and John Swinney, both members of the Scottish National Party. Following the same election the electoral region - Mid Scotland and Fife - is represented by four members of the Scottish Conservatives, two members of Scottish Labour, and one member of the Scottish Greens."]}, {"page": "Alex Neil (politician)", "response": ["The following year he stood unsuccessfully in the hard-fought contest for the leadership of the SNP against John Swinney. Thereafter he was appointed chair of the Scottish Parliament's Enterprise and Lifelong Learning Committee, a role he kept on until 2003."]}, {"page": "SNP Students", "response": ["In the 2000 SNP leadership election the organisation supported Alex Neil who lost to John Swinney. In the two subsequent leadership campaigns the organisation did not officially endorse any candidate."]}, {"page": "Politics of Scotland", "response": ["* John Swinney (21 November 2014 – present)"]}, {"page": "Scottish Government", "response": ["| rowspan=\"2\" data-sort-value=\"Swinney\" | John Swinney "]}, {"page": "First Minister of Scotland", "response": ["| John Swinney", "| John Swinney", "| John Swinney"]}, {"page": "Margo MacDonald", "response": ["By the mid-1990s, she had returned to the SNP and in 1999 she was elected to the Scottish Parliament, representing the Lothians. She earned a high media profile by her outspoken views on a number of issues, including sex workers' rights and MSPs' salaries. She quickly established herself as a rebel within the party, and was disciplined in 2000 for missing a parliamentary vote without permission and briefing a Sunday newspaper against party policy. Meanwhile, she lost influence with the party leadership, firstly under Alex Salmond and then John Swinney, for being in the SNP Fundamentalist mould and having supported Alex Neil in the party leadership election in 2000. She placed fifth on the SNP list for Lothians for the 2003 Parliament election, effectively ending her chances of being re-elected as an SNP MSP."]}, {"page": "2003 Scottish Parliament election", "response": ["*SNP – John Swinney"]}, {"page": "Kenny MacAskill", "response": ["After MacAskill became on MSP in 1999 upon the establishment of the Scottish Parliament as a regional list member for the Lothians he moderated his political position, seeing the development of the Scottish Parliament as the most achievable route for Scotland to become an independent nation state. In this respect he was regarded as having adopted a gradualist approach to Scottish independence in place of his previous fundamentalist position. He was one of former SNP leader John Swinney's closest supporters.", "In 2004, after John Swinney stood down as SNP party leader, Kenny MacAskill backed the joint leadership ticket of Alex Salmond and Nicola Sturgeon. He had initially intended to stand for deputy leader himself on a joint ticket with Nicola Sturgeon, who would have sought the leadership. He gave way when Salmond reconsidered his earlier decision not to seek re-election to the leadership. Upon their election as leader and deputy leader respectively, MacAskill was selected to be Deputy Leader of the SNP in the Scottish Parliament. He served in the SNP Shadow Cabinet as Shadow Minister for Enterprise and Lifelong Learning from 2001 to 2003, Shadow Minister for Transport and Telecommunications from 2003 to 2004 and Shadow Minister for Justice from 2004 to 2007."]}, {"page": "Roseanna Cunningham", "response": ["John Swinney announced his resignation as leader of the SNP on 22 June 2004, and on the same day Cunningham announced that she would be a candidate in the subsequent election for the party leadership. In the early stages of the campaign she appeared to be the clear front-runner, but former leader Alex Salmond entered the race just before nominations closed and Cunningham finished a distant second."]}, {"page": "Education in Scotland", "response": ["On 1 February 2017 the share each primary and secondary school will receive for the academic year 2017–2018 from the Scottish Government's £120 million Pupil Equity Funding was announced by the Deputy First Minister and Cabinet Secretary for Education and Skills John Swinney.  This funding is provided through the Attainment Scotland Fund and allocated directly to schools, targeted at those children most affected by the poverty related attainment gap.", "All Scottish universities have the power to award degrees at all levels: undergraduate, taught postgraduate, and doctoral. Education in Scotland is controlled by the Scottish Government under the terms of the Scotland Act 1998. The minister responsible for higher education is the Cabinet Secretary for Education and Skills, currently John Swinney MSP of the Scottish National Party. University status in Scotland and throughout the United Kingdom today is conferred by the Privy Council which takes advice from the Quality Assurance Agency for Higher Education."]}, {"page": "Pitlochry", "response": ["The Scottish Parliamentary constituency is Tayside North, represented by John Swinney of the Scottish National Party. The British Parliament constituency is Perth and North Perthshire. The MP is Peter Wishart, also of the Scottish National Party.upmystreet.comThe political reps for Pitlochry"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|John Swinney"]}]}}