{"wiki_id": "http://www.wikidata.org/entity/Q333688", "itemLabel": "Charles Townshend", "itemDescription": "British Army general (1861-1924)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Townshend_(British_Army_officer)", "wikipedia_page": {"main": "Major General Sir Charles Vere Ferrers Townshend,  (21 February 1861 – 18 May 1924) was a soldier who during the First World War led an overreaching military campaign in Mesopotamia. His troops were besieged and captured at the Siege of Kut (December 1915 to April 1916), which was possibly the worst defeat suffered by the Allies. \nControversially and in contrast to the miserable captivity endured by his men, Townshend was held on Prinkipo, where he was treated like an esteemed guest until his release in October 1918. He was briefly a Conservative Member of Parliament from 1920 to 1922.", "link_mentions": [{"page": "Kut", "response": ["Kut was the scene of a fierce battle during World War I. The British Mesopotamian Expeditionary Force, led by Major General Charles Townshend, marched north from Basra in September 1915 in what became known as the Mesopotamian Campaign. They reached Kut on September 26, where after three days of fighting they drove the Ottoman forces from the town."]}, {"page": "Siege of Kut", "response": ["The 6th (Poona) Division of the Indian Army, under Major-General Charles Townshend, had fallen back to the town of Kut after retreating from Ctesiphon. The British Empire forces arrived at Kut around 3 December 1915. They had suffered significant losses, numbering only 11,000 soldiers (plus cavalry). General Townshend chose to stay and hold the position at Kut instead of continuing the march downriver towards Basra. Contained within a long river loop, Kut offered a good defensive position although supply lines from distant Basra were stretched."]}, {"page": "The Wrekin (UK Parliament constituency)", "response": ["| Sir Charles Townshend"]}, {"page": "January 1916", "response": ["* Battle of Wadi – A British force of 19,000 men under command of Lieutenant-General Fenton Aylmer attacked an Ottoman defensive force of 22,500 along the Wadi River in what is now modern-day Iraq, but a cost of 1,600 men compared to the 527 lost on the Ottoman side. The battle only further weakened British attempts to relieve beleaguered forces under command of General Charles Townshend in Kut."]}, {"page": "C. V. F. Townshend", "response": ["#REDIRECT Charles Townshend (British Army officer)"]}, {"page": "6th (Poona) Division", "response": ["*1915-1916: Major-General Charles Townshend CB DSO"]}, {"page": "Charles Townshend (disambiguation)", "response": ["Charles Townshend (1725-1767) was a British Chancellor of the Exchequer.", "Charles Townshend may also refer to:", "*Charles Townshend, 3rd Viscount Townshend (1700–1764), father of the Chancellor", "*Charles Townshend, 2nd Viscount Townshend (1674–1738), known as Turnip Townshend, grandfather of the Chancellor", "*Lord Charles Townshend (1769–1796), son of the 1st Marquess Townshend, British MP for Great Yarmouth", "*Lord Charles Townshend (1785–1853), son of the 2nd Marquess Townshend, British MP for Tamworth", "*Sir Charles Townshend (British Army officer) (1861–1924), British Army officer and politician", "*Charles Townshend (historian) (born 1945), British historian", "*Charles Townshend, 1st Baron Bayning (1728–1810), British politician, cousin of the Chancellor", "*Charles Townshend, 2nd Baron Bayning (1785–1823), British peer and Tory Member of Parliament", "*Charles Townshend, 8th Marquess Townshend (born 1945)"]}, {"page": "Al-Gharraf River", "response": ["The Turks surrounded and besieged General Charles Townshend's British Empire forces which occupied Kut. The Gharraf River was picked by the Ottoman Army as an advantage point as part of that siege. During the siege the Ottomans repelled relief attempts by Anglo-Indian forces in the Battle of Hanna in January 1916 and the Battle of Dujaila in March. One of the reasons the British had decided to defend Kut was that the canal was considered as a possible route for the Turks or the Anglo-Indian Force to transport troops between the Tigris and Euphrates and vice versa. By 20 May 1916 the British occupied the right (south) bank of the Tigris as far west as the Gharraf, clearing it of Turkish forces, but had not yet recaptured Kut. They were able to cross to the other side on 13 December 1916. The Turks evacuated Kut on 24 February 1917 and retreated to Baghdad."]}, {"page": "September 1915", "response": ["* Battle of Es Sinn — British and Indian forces under command of Charles Townshend defeated Ottoman forces at a strategic point in the Tigris and Euphrates rivers, setting the Allied forces for siege on Kut in what is now Iraq."]}, {"page": "November 1915", "response": ["* Battle of Ctesiphon — A force of 11,000 British and Indian soldiers under Charles Townshend, plus two naval warships, attacked a defending force of 18,000 Ottoman troops under command of Nureddin Pasha near the site of the ancient city of Ctesiphon, located on the Tigris southeast of Baghdad."]}, {"page": "December 1915", "response": ["* British Indian forces under Major-General Charles Townshend arrived at Kut, located on the Tigris in what is now eastern Iraq. Since the Battle of Ctesiphon weeks earlier, the army had been reduced to a third of its strength and 400 miles deep into Ottoman territory.", "* Siege of Kut – Major-General Charles Townshend chose the 6th Division of the British Indian Army to make a stand against an Ottoman force of 11,000 men at Kut 100 miles south of Baghdad rather than retreat further south to Basra, allowing the Ottomans to reinforce their siege while making it harder for the British to send reinforcements."]}, {"page": "November 1920 The Wrekin by-election", "response": ["The Wrekin by-election of 1920 was held on 20 November 1920.  The by-election was held due to the death of the incumbent Independent Parliamentary Group MP, Charles Palmer.  It was won by the Independent Parliamentary Group candidate, 59-year old retired Major-General Sir Charles Townshend, who was against the current Unionist-Liberal coalition government and beat Charles Duncan, 55-year old Labour candidate and former MP."]}, {"page": "Sir Charles Vere Ferrers Townshend", "response": ["#REDIRECT Charles Townshend (British Army officer)"]}, {"page": "Patrick Hehir", "response": ["He saw active service in many military campaigns and was highly decorated. In the First World War he served in Mesopotamia as the Principal Medical Officer. He was present at the Battle of Ctesiphon and the ill-fated Siege of Kut under General Charles Townshend. He was captured when the garrison surrendered on 29 April 1916 but was released 25 September 1916.List of British Officers taken prisoner in the various Theatres of War between August, 1914, and November 1918 by Cox & Co.  He went on to see service in Waziristan in 1917 and lastly Afghanistan (1919)."]}, {"page": "Charles Vere Ferrers Townshend", "response": ["#REDIRECT Charles Townshend (British Army officer)"]}, {"page": "2nd Wessex Brigade, Royal Field Artillery", "response": ["The battery landed at Basra on 23 March 1915 with 12th Indian Division to join Indian Expeditionary Force 'D'. Soon afterwards it transferred to 6th (Poona) Division, which had been in action against Turkish forces in Mesopotamia since the previous November. In April 1915 the column under Maj-Gen Charles Townshend began its advance up the Tigris. At the Battle of Amara  on 31 May, 6th (Poona) Division captured a series of hills, powerfully supported by heavy guns firing from river barges and the howitzers of 1/5th Hampshire Bty firing from Fort Snipe, though the battery was out of range when the infantry took the last hill. The attack was resumed the next day, with the guns concentrating on Abu Aran, and Amara fell on 2 June.Farndale, pp. 203–8.Moberly, Appendix VIII, p. 477.Perry, pp. 76–8. 12th Indian Division then began to advance up the Euphrates towards Nasiriyah. When it ran into serious opposition in 14 July, reinforcements were sent across from the Tigris, including a section of 1/5th Hampshire Bty. The renewed attack went in on 24 July, with the howitzers firing on enemy trenches at Thorneycroft Point. As the infantry advanced the guns lifted in front of them; by 13.00 the enemy were in full retreat, driven out once more by the guns. 1/5th Hampshire Bty then returned to the Tigris.Farndale, pp. 209–10."]}, {"page": "General Townshend", "response": ["*Charles Townshend (British Army officer) (1861–1924), British Army major general"]}]}}