{"wiki_id": "http://www.wikidata.org/entity/Q333270", "itemLabel": "Eamonn Duggan", "itemDescription": "Irish lawyer and politician (1874-1936)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eamonn_Duggan", "wikipedia_page": {"main": "Eamonn Seán Duggan (Irish: Éamonn Ó Dúgáin; 2 March 1878 – 6 June 1936) was an Irish lawyer and politician who served as Government Chief Whip and Parliamentary Secretary to the Minister for Defence from 1927 to 1932, Parliamentary Secretary to the Minister for Finance from 1926 to 1927, Parliamentary Secretary to the Executive Council from 1922 to 1926, Minister without portfolio September 1922 to December 1922 and Minister for Home Affairs January 1922 to September 1922. He served as a Teachta Dála (TD) from 1918 to 1933. He was a Senator for the University of Dublin from 1933 to 1936.\n\n", "link_mentions": [{"page": "Michael Collins (Irish leader)", "response": ["The Irish delegates sent  to London were designated as \"plenipotentiaries\", meaning that they had full authority to sign an agreement on behalf of the Dáil government. The Treaty would then be subject to approval by the Dáil. The majority of the delegates, including Arthur Griffith (leader), Robert Barton and Eamonn Duggan (with Erskine Childers as Secretary General to the delegation) set up headquarters at 22 Hans Place in Knightsbridge on 11 October 1921. Collins shared quarters at 15 Cadogan Gardens with the delegation's publicity department, secretary Diarmuid O'Hegarty, Joseph McGrath as well as substantial intelligence and bodyguard personnel including Liam Tobin, Tom Cullen, Ned Broy, Emmet Dalton and Joseph Dolan of The Squad.Mackay, p. 217"]}, {"page": "Anglo-Irish Treaty", "response": ["| Eamonn Duggan  TD for Louth–Meath  (MP for South Meath)"]}, {"page": "Second Dáil", "response": ["On 14 September 1921, the Dáil ratified the appointment of Arthur Griffith, Michael Collins, Robert Barton, Eamonn Duggan and George Gavan Duffy as envoys plenipotentiary for the peace conference in England. Of the five only Collins, Griffith and Barton were members of the cabinet. These envoys eventually signed the Anglo-Irish Treaty on 6 December. Between the Truce and the signing of the Treaty the Second Dáil only sat on 10 days, and did not discuss in detail the options available to it. The debate on the Treaty started on 14 December, and continued for thirteen days of debate until 7 January 1922. On that date, the Dáil approved the treaty by 64 in favour to 57 against. The Treaty Debates were the first publicly reported debate on what Sinn Féin felt that it had achieved and could achieve. In the vote, the deputies who represented more than one constituency were each only permitted to vote once, but this would not have changed the outcome. As the leader of the anti-Treaty minority de Valera resigned as President, and on 9 January his opponent Arthur Griffith was elected as president on a vote of 60–58. The anti-Treaty deputies continued to attend the Dáil, with de Valera becoming the first Leader of the Opposition in the Dáil."]}, {"page": "County Meath", "response": ["Meath's Eamonn Duggan served as the IRA's director of intelligence during and after the rising, and was a signatory of the Anglo-Irish treaty in 1921. Meath largely sided with the pro-treaty forces during the Civil War, with the Louth–Meath constituency returning one anti-treaty and four pro-treaty TDs in the 1922 general election. Duggan later joined Cumann na nGaedheal and held various ministerial offices until his death in 1936. Following independence, various government-backed Gaelic revival efforts were centered on the county and its history, including the foundation of 5 Gaeltacht areas within Meath, and the symbolic hosting of the Tailteann Games."]}, {"page": "Government of the 6th Dáil", "response": ["|rowspan=\"2\"|Eamonn Duggan", "|rowspan=\"2\"|Eamonn Duggan"]}, {"page": "Government of the 5th Dáil", "response": ["|rowspan=\"2\"|Eamonn Duggan"]}, {"page": "Government of the 4th Dáil", "response": ["||Eamonn Duggan", "|Eamonn Duggan"]}, {"page": "Government of the 3rd Dáil", "response": ["|Eamonn Duggan", "|Eamonn Duggan"]}, {"page": "Irish Volunteers", "response": ["The other elected members were: M. W. O'Reilly (Dublin); Austin Stack (Kerry); Con Collins (Limerick); Seán MacEntee (Belfast); Joseph O'Doherty (Donegal); Paul Galligan (Cavan); Eoin O'Duffy (Monaghan); Séamus Doyle (Wexford); Peadar Bracken (Offaly); Larry Lardner (Galway); Richard Walsh (Mayo) and another member from Connacht. There were six co-options to make-up the full number when the directors were named from within their ranks. The six were all Dublin men: Eamonn Duggan; Gearóid O'Sullivan; Fintan Murphy; Diarmuid O'Hegarty; Dick McKee and Paddy Ryan."]}, {"page": "1933 Irish general election", "response": ["*Eamonn Duggan (Retired)"]}, {"page": "Government of the 2nd Dáil", "response": ["|Eamonn Duggan", "|Eamonn Duggan"]}, {"page": "Minister for Justice (Ireland)", "response": ["|Eamonn Duggan"]}, {"page": "1936 in Ireland", "response": ["*6 June – Eamonn Duggan, solicitor, nationalist, member 1st Dáil (Pro Treaty), representing South Meath, Minister for Home Affairs (1922) (born 1874)."]}, {"page": "Fionán Lynch", "response": ["The Military Service Pensions Act of 1924 aided post-Civil War reconciliation and, from October 1924 until October 1928, Lynch acted as a member of the Board of Assessors for the adjudication of military service pensions, along with Eamonn Duggan and Gearóid O'Sullivan acting as Secretary."]}]}}