{"wiki_id": "http://www.wikidata.org/entity/Q333847", "itemLabel": "David Steel", "itemDescription": "British politician (born 1938)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Steel", "wikipedia_page": {"main": "David Martin Scott Steel, Baron Steel of Aikwood,  (born 31 March 1938) is a British politician. Elected as Member of Parliament for Roxburgh, Selkirk, and Peebles, followed by Tweeddale, Ettrick, and Lauderdale, he served as the final leader of the Liberal Party, from 1976 to 1988. His tenure spanned the duration of the alliance with the Social Democratic Party, which began in 1981 and concluded with the formation of the Liberal Democrats in 1988.Steel served as a Member of the UK Parliament for 32 years, from 1965 to 1997, and as a Member of the Scottish Parliament (MSP) from 1999 to 2003, during which time he was the parliament's Presiding Officer. He was a member of the House of Lords as a life peer from 1997 to 2020. Steel resigned from the House of Lords after the Independent Inquiry into Child Sexual Abuse accused him of an \"abdication of responsibility\" over his failure to investigate allegations of child sex abuse against Liberal MP, Cyril Smith.", "link_mentions": [{"page": "Liberal Party (UK)", "response": ["Thorpe was subsequently forced to resign after allegations that he attempted to have his homosexual lover murdered by a hitman. The party's new leader, David Steel, negotiated the Lib-Lab pact with Wilson's successor as prime minister, James Callaghan. According to this pact, the Liberals would support the government in crucial votes in exchange for some influence over policy. The agreement lasted from 1977 to 1978, but proved mostly fruitless, for two reasons: the Liberals' key demand of PR was rejected by most Labour MPs, whilst the contacts between Liberal spokespersons and Labour ministers often proved detrimental, such as between finance spokesperson John Pardoe and Chancellor of the Exchequer Denis Healey, who were mutually antagonistic.", "* David Steel (1976–1988)", "|rowspan=\"3\"|David Steel"]}, {"page": "List of Scots", "response": ["* David Steel (born 1938), Liberal Party leader from 1976 to 1988, first Presiding Officer of the Scottish Parliament"]}, {"page": "Friedrich Hayek", "response": ["In 1978, Hayek came into conflict with Liberal Party leader David Steel, who claimed that liberty was possible only with \"social justice and an equitable distribution of wealth and power, which in turn require a degree of active government intervention\" and that the Conservative Party were more concerned with the connection between liberty and private enterprise than between liberty and democracy. Hayek claimed that a limited democracy might be better than other forms of limited government at protecting liberty, but that an unlimited democracy was worse than other forms of unlimited government because \"its government loses the power even to do what it thinks right if any group on which its majority depends thinks otherwise\"."]}, {"page": "Margaret Thatcher", "response": ["Jim Prior suggested Thatcher as a Shadow Cabinet member after the Conservatives' 1966 defeat, but party leader Edward Heath and Chief Whip William Whitelaw eventually chose Mervyn Pike as the Conservative Shadow Cabinet's sole woman member. At the 1966 Conservative Party conference, Thatcher criticised the high-tax policies of the Labour government as being steps \"not only towards Socialism, but towards Communism\", arguing that lower taxes served as an incentive to hard work. Thatcher was one of the few Conservative MPs to support Leo Abse's bill to decriminalise male homosexuality. She voted in favour of David Steel's bill to legalise abortion, as well as a ban on hare coursing. She supported the retention of capital punishment and voted against the relaxation of divorce laws.", "Britain's economy during the 1970s was so weak that then Foreign Secretary James Callaghan warned his fellow Labour Cabinet members in 1974 of the possibility of \"a breakdown of democracy\", telling them: \"If I were a young man, I would emigrate.\" In mid-1978, the economy began to recover, and opinion polls showed Labour in the lead, with a general election being expected later that year and a Labour win a serious possibility. Now prime minister, Callaghan surprised many by announcing on 7 September that there would be no general election that year, and he would wait until 1979 before going to the polls. Thatcher reacted to this by branding the Labour government \"chickens\", and Liberal Party leader David Steel joined in, criticising Labour for \"running scared\"."]}, {"page": "March 31", "response": ["*  1938   – David Steel, Scottish academic and politician"]}, {"page": "Roy Jenkins", "response": ["In a speech to the London Labour Conference in May 1967, Jenkins said his vision was of \"a more civilised, more free and less hidebound society\" and he further claimed that \"to enlarge the area of individual choice, socially, politically and economically, not just for a few but for the whole community, is very much what democratic socialism is about\".Campbell, Roy Jenkins: A Well-Rounded Life, p. 293. He gave strong personal support to David Steel's Private Member's Bill for the legalisation of abortion, which became the Abortion Act 1967, telling the Commons that \"the existing law on abortion is uncertain and...harsh and archaic\", adding that \"the law is consistently flouted by those who have the means to do so. It is, therefore, very much a question of one law for the rich and one law for the poor\". When the Bill looked likely to be dropped due to insufficient time, Jenkins helped ensure that it received enough parliamentary time to pass and he voted for it in every division.Campbell, Roy Jenkins: A Well-Rounded Life, pp. 295–296.", "Seven days after Jenkins' by-election victory Argentina invaded the Falklands and the subsequent Falklands War transformed British politics, increased substantially the public's support for the Conservatives and ended any chance that Jenkins' election would reinvigorate the SDP's support.Campbell, Roy Jenkins: A Well-Rounded Life, p. 599, p. 609. In the SDP leadership election, Jenkins was elected with 56.44 of the vote, with David Owen coming second.Campbell, Roy Jenkins: A Well-Rounded Life, p. 608. During the 1983 election campaign his position as the prime minister-designate for the SDP-Liberal Alliance was questioned by his close colleagues, as his campaign style was now regarded as ineffective; the Liberal leader David Steel was considered to have a greater rapport with the electorate.Campbell, Roy Jenkins: A Well-Rounded Life, p. 618. Jenkins held on to his seat in Hillhead, which was the subject of boundary changes. While on the old boundaries the Conservatives had held the seat prior to Jenkins' victory, it was estimated by the BBC and ITN that on the new boundaries Labour would have captured the seat with a majority of just over 2,000 votes in 1979. Jenkins was challenged by Neil Carmichael, the sitting Labour MP for the Glasgow Kelvingrove constituency which had been abolished and a ministerial colleague of Jenkins in the Wilson governments. Jenkins defeated Carmichael by 1,164 votes to retain his seat in the House of Commons. According to The Glasgow Herald Labour supporters at the election count in the Kelvin Hall booed and jeered when Jenkins' victory was announced, and he and his wife were \"dismayed as police pushed back jostling crowds.\""]}, {"page": "1999", "response": ["* May 12 – David Steel becomes the first Presiding Officer (Speaker) of the modern Scottish Parliament."]}, {"page": "1976", "response": ["** David Steel becomes leader of the UK's Liberal Party in the aftermath of the scandal which forced out Jeremy Thorpe."]}, {"page": "1979 United Kingdom general election", "response": ["The Conservative campaign employed the advertising agency Saatchi & Saatchi, and pledged to control inflation as well as curbing the power of the trade unions. The Conservatives also ran their campaign on the theme that \"Labour Isn't Working\" (unemployment reached a 40-year high of 1.5 million during 1978). The Liberal Party was damaged by allegations that its former leader Jeremy Thorpe had been involved in a homosexual affair, and had conspired to murder his former lover. The Liberals were now being led by David Steel, meaning that all three major parties entered the election with a new leader.", "David Steel had replaced Jeremy Thorpe as leader of the Liberal Party in 1976, after allegations of homosexuality and conspiracy to murder his former lover forced Thorpe to resign. The Thorpe affair led to a fall in the Liberal vote, after what had been thought to be a breakthrough in the February 1974 election.", "A proposal for the two main party leaders to participate in two televised debates was put forward by former Labour MP turned broadcaster Brian Walden. These would have been produced by LWT and were planned to be shown on ITV on 22 & 29 April 1979. While James Callaghan immediately accepted Walden's proposal, Margaret Thatcher decided to \"wait a few days before replying\" to the invitation. According to The Glasgow Herald Some of Mrs Thatcher's advisers were concerned that she had more to lose from such debates, fearing that it would lead to a \"presidential-style 'Her or me' campaign\" which would see policy issues become of less importance. However it was also reported that the danger of declining was that Mrs Thatcher would be charged by Labour as being \"scared\" to face the Prime Minister. At the insistence of the Liberals, their leader David Steel was also invited by LWT to take part, and accepted the offer. However Mrs Thatcher declined the offer to take part, saying that the election was for a government, not a president, which meant that the debates did not go ahead."]}, {"page": "Fife", "response": ["*David Steel, former Presiding Officer of the Scottish Parliament and leader of the Liberal party and MSP for Lothian and MP for Tweeddale, Ettrick and Lauderdale"]}, {"page": "Metropolitan county", "response": ["While the abolition of the GLC was highly controversial, the abolition of the MCCs was much less so. The Liberal Party leader David Steel had supported abolition of the MCCs in his 1981 conference speech . The government's stated reasons for the abolition of the MCCs were based on efficiency and their overspending."]}, {"page": "Henry John Temple, 3rd Viscount Palmerston", "response": ["Temple was then at the University of Edinburgh (1800–1803), where he learnt political economy from Dugald Stewart, a friend of the Scottish philosophers Adam Ferguson and Adam Smith.Ridley, p. 14. Temple later described his time at Edinburgh as producing \"whatever useful knowledge and habits of mind I possess\".David Steele, ‘Temple,  Henry John, third Viscount Palmerston  (1784–1865)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, May 2009, accessed 11 December 2010. Lord Minto wrote to the young Palmerston's parents that Henry Temple was well-mannered and charming. Stewart wrote to a friend, saying of Temple: \"In point of temper and conduct he is everything his friends could wish. Indeed, I cannot say that I have ever seen a more faultless character at this time of life, or one possessed of more amiable dispositions.\"Ridley, p. 15.", "Palmerston has traditionally been viewed as \"a Conservative at home and a Liberal abroad\".Ridley, p. 587. He believed that the British constitution as secured by the Glorious Revolution of 1688 was the best which human hands had made, with a constitutional monarchy subject to the laws of the land but retaining some political power. He supported the rule of law and opposed further democratisation after the Reform Act 1832. He wished to see this liberal system of a mixed constitution in-between the two extremes of absolute monarchy and republican democracy replace the absolute monarchies on the Continent.Ridley, p. 588. More recently some historians have seen his domestic policies as prime minister as not merely liberal but genuinely progressive by the standards of his era.David Steele, Palmerston and Liberalism, 1855–1865 (Cambridge University Press, 1991)."]}, {"page": "1970 United Kingdom general election", "response": ["Unusually for the Liberal Party, the by-elections between 1966 and 1970 had proved almost fruitless, with many Liberal candidates losing deposits. The one exception was its by-election gain of Birmingham Ladywood in June 1969; this was promptly lost in the 1970 general election. The party found itself struggling to introduce its new leader Jeremy Thorpe to the public, owing to the extensive coverage and attention paid to Enoch Powell. The election result was poor for the Liberals, with Thorpe only narrowly winning his own seat in North Devon. Indeed, of the six MPs returned, three (Thorpe, David Steel and John Pardoe) were elected by a majority of less than 1,000 votes."]}, {"page": "Abortion in the United Kingdom", "response": ["The Abortion Act 1967 sought to clarify the law. Introduced by David Steel and subject to heated debate, it allowed for legal abortion on a number of grounds, with the added protection of free provision through the National Health Service. The Act was passed on 27 October 1967 and came into effect on 27 April 1968. Pdf."]}, {"page": "1987 United Kingdom general election", "response": ["The Labour Party, led by Neil Kinnock following Michael Foot's resignation in the aftermath of their landslide defeat at the 1983 general election, was slowly moving towards a more centrist policy platform following the promulgation of a left-wing one under its previous leader Michael Foot. The main aim of the Labour Party was simply to re-establish itself as the main progressive centre-left alternative to the Conservatives, after the rise of the Social Democratic Party (SDP) forced Labour onto the defensive. Indeed, the Labour Party succeeded in doing so at this general election. The Alliance between the SDP and the Liberal Party was renewed but co-leaders David Owen and David Steel could not agree whether to support either major party in the event of a hung parliament."]}, {"page": "Jo Grimond", "response": ["In 1962, the Liberals almost succeeded in capturing Blackpool North, West Derbyshire and Chippenham from the Conservatives and Leicester North East from Labour. Grimond's dynamic and principled leadership proved attractive to many young aspiring politicians, including John Pardoe and three future party leaders, David Steel, Paddy Ashdown and Sir Menzies Campbell.", "In 1967, having led the party through three general elections, he made way for a younger leader, the charismatic Jeremy Thorpe. In 1976, when Thorpe was forced to resign because of a scandal, Grimond stepped in as interim leader until the election of a replacement, David Steel.BBC website – Jeremy Thorpe – Former Liberal Party Leader in the UK. Retrieved 2 December 2013."]}, {"page": "Private member's bill", "response": ["Only a small proportion of private members' bills are enacted. This is generally because of lack of time – a controversial private member's bill can be \"talked out\". In some cases, measures that a government does not want to take responsibility for may be introduced by backbenchers, with the government secretly or openly backing the measure and ensuring its passage. They are sometimes known as \"handouts\" or \"whips' bills\". The Abortion Act 1967 was enacted in the United Kingdom through this means: with the Bill itself being introduced by a Liberal Party Member of Parliament, David Steel; through the support from Labour Home Secretary Roy Jenkins the Bill was given enough government time to allow a full debate."]}, {"page": "Liberal International", "response": ["| David Steel"]}, {"page": "SDP–Liberal Alliance", "response": ["Following the establishment of the Social Democratic Party (SDP) by the 'Gang of Four' (Roy Jenkins, David Owen, Bill Rodgers, Shirley Williams), who had left the Labour Party in March 1981, the SDP entered into an informal alliance with the Liberal Party, led by David Steel. The SDP fought its first by-election, in Warrington, with future leader Roy Jenkins standing as \"SDP with Liberal support\".", "|Roy Jenkins (SDP) and David Steel (Liberal)", "|David Owen (SDP) and David Steel (Liberal)"]}, {"page": "Spitting Image", "response": ["The SDP-Liberal Alliance was portrayed by the election-losing, populist, arrogant and undecided David Owen, with whining, bedwetting David Steel in his pocket. They were soon replaced by Paddy Ashdown, whose \"equidistance\" from the larger parties was satirised by his frequent appearance at the side of the screen during unrelated sketches, saying: \"I am neither in this sketch nor not in it, but somewhere in-between\". This running gag was used when Ashdown's extramarital affair was revealed, and his puppet commented that \"I didn't touch her on the left leg, or the right leg, but somewhere in-between.\" Former Liberal MP Cyril Smith also made a few appearances depicted as a morbidly obese giant."]}, {"page": "David Owen", "response": ["Owen is widely regarded as having been, at the very least, a competent party leader. He had high popularity ratings throughout his leadership as did the SDP–Liberal Alliance. Owen kept a high profile, so much so that Spitting Image, the satirical puppet show, depicted the Liberal leader David Steel popping up like a jack-in-the-box in Owen's pocket. He succeeded in keeping the party in the public eye and in maintaining its independence from the Liberals for the length of the 1983 Parliament. Moreover, under him, the SDP increased its representation from six to eight seats via the by-election victories of Mike Hancock, at Portsmouth South (1984), and Rosie Barnes, at Greenwich (1987).", "In 1987 immediately after the election, the Liberal leader David Steel proposed a full merger of the Liberal and SDP parties and was supported for the SDP by Roy Jenkins, Shirley Williams and Bill Rodgers. Owen rejected this notion outright, on the grounds that he and other Social Democrats wished to remain faithful to social democracy as it was practised within Western Europe, and it was unlikely that any merged party would be able to do this, even if it was under his leadership. Nevertheless, the majority of the SDP membership supported the merger."]}, {"page": "Jeremy Thorpe", "response": ["As Harold Wilson did not have an overall majority after the February 1974 election, he was widely expected to call another election before too long; he did so in September 1974. Thorpe anticipated a turning point in the Liberals' fortunes and campaigned under the slogan \"one more heave\", aiming for a complete breakthrough with entering a coalition a last resort. The phrase is attributed to advertising agent and Liberal parliamentary candidate Adrian Slade. Future Liberal Party leader David Steel called the whole campaign \"a slightly less successful re-run of February.\" In the October 1974 general election, the Liberals received over 700,000 fewer votes and returned 13 MPs, down one, with Wilson achieving an overall majority of three.", "Thorpe's resignation brought him a period of temporary calm. The new Liberal leader, David Steel, made him party spokesman on foreign affairs, with responsibility for European issues. Wilson had by this time retired as prime minister, and been replaced by James Callaghan. Thorpe lobbied the government hard for legislation to introduce direct elections to the European Parliament; at that time MEPs were appointed by member nations' parliaments."]}, {"page": "List of political parties in the United Kingdom", "response": ["| David Steel"]}, {"page": "Politics of Scotland", "response": ["* 1965: David Steel won the Roxburgh, Selkirk and Peebles by-election for the Liberals.", "* David Steel (12 May 1999 – 7 May 2003)"]}]}}