{"wiki_id": "http://www.wikidata.org/entity/Q333855", "itemLabel": "Herbert Austin, 1st Baron Austin", "itemDescription": "British politician (1866-1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Austin,_1st_Baron_Austin", "wikipedia_page": {"main": "Herbert Austin, 1st Baron Austin  (8 November 1866 – 23 May 1941) was an English automobile designer and builder who founded the Austin Motor Company. For the majority of his career he was known as Sir Herbert Austin, and the Northfield bypass is called \"Sir Herbert Austin Way\" after him.\n\n", "link_mentions": [{"page": "November 8", "response": ["*1866 – Herbert Austin, 1st Baron Austin, English businessman, founded the Austin Motor Company (d. 1941)"]}, {"page": "List of United Kingdom MPs: A", "response": ["*Sir Herbert Austin, 1st Baron Austin; MP for Birmingham King's Norton (1918–1924)"]}, {"page": "Baron Austin", "response": ["#REDIRECT Herbert Austin, 1st Baron Austin "]}, {"page": "Northfield, Birmingham", "response": ["Northfield is centred on the main A38 road, which runs southwards from Birmingham and leads to Bromsgrove, Worcester, Gloucester, Bristol, Exeter and eventually Bodmin in Cornwall. The section of this road through Northfield was traditionally very congested around the old village centre, but in 2006 a relief road was built, which has significantly improved the situation.  The relief road involved widening a part of an existing road Bell Lane, a new by pass was also built and named, \"Sir Herbert Austin Way\" in recognition of Herbert Austin, 1st Baron Austin who started producing cars at the Longbridge plant and built Austin Village in the Northfield part of Turves Green."]}, {"page": "Lord Austin", "response": ["#REDIRECT Herbert Austin, 1st Baron Austin"]}, {"page": "Herbert Austin, Baron Austin", "response": ["#REDIRECT Herbert Austin, 1st Baron Austin"]}, {"page": "1941 in the United Kingdom", "response": ["* 23 May – Herbert Austin, 1st Baron Austin, car designer and manufacturer (born 1866)"]}, {"page": "1866 in the United Kingdom", "response": ["* 8 November – Herbert Austin, 1st Baron Austin, car designer (died 1941)"]}, {"page": "Herbert Austin", "response": ["#REDIRECT Herbert Austin, 1st Baron Austin"]}, {"page": "St Laurence's Church, Northfield", "response": ["The church was presented with a new organ by Herbert Austin, 1st Baron Austin and Lady Austin in memory of 2nd Lieutenant Vernon James Austin, who had died in 1915. It was built by the Compton Organ Company and opened on 22 March 1937. It comprises three manuals and pedals and is built on the extension principle. A specification of the organ can be found on the National Pipe Organ Register."]}, {"page": "Sir Herbert Austin", "response": ["#REDIRECT Herbert Austin, 1st Baron Austin"]}, {"page": "Herbert (Baron Austin) Austin", "response": ["#REDIRECT Herbert Austin, 1st Baron Austin"]}, {"page": "Rotherham Grammar School", "response": ["* Herbert Austin, 1st Baron Austin - founded the Austin Motor Company, and Conservative MP from 1918-24 for Birmingham King's Norton"]}, {"page": "Holy Trinity Church, Lickey", "response": ["Herbert Austin, 1st Baron Austin, the automobile designer and builder who founded the Austin Motor Company, lived at nearby Lickey Grange and is buried in the churchyard."]}]}}