{"wiki_id": "http://www.wikidata.org/entity/Q3339781", "itemLabel": "Nick Ormerod", "itemDescription": "British theatre designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Nick_Ormerod", "wikipedia_page": {"main": "Nicholas Ronald Ormerod OBE (born 9 December 1951) is a British theatre designer and co-founder of the international theatre company Cheek by Jowl. In 1981 he founded Cheek by Jowl with Declan Donnellan, and they are the company's co-artistic directors. In addition to his Cheek by Jowl productions, Ormerod has made theatre, opera and ballet with companies across the world. He studied law at Trinity College, Cambridge before studying for BA in theatre design at the Wimbledon School of Art.", "link_mentions": [{"page": "Measure for Measure", "response": ["Between 2013 and 2017, theatre company Cheek by Jowl staged a Russian-language version of the play in association with the Pushkin Theatre, Moscow, and the Barbican Centre, London. The production was directed by Declan Donnellan and designed by Nick Ormerod."]}, {"page": "The Winter's Tale", "response": ["Also in 2015, Cheek by Jowl staged the play, directed by Declan Donnellan and designed by Nick Ormerod. The production toured to France, Spain, the US and Russia among others. In a partnership with the BBC and Riverside Studios the production was livestreamed all around the world."]}, {"page": "Great Expectations", "response": ["* 2005 – Royal Shakespeare Company adaptation by the Cheek by Jowl founders Declan Donnellan and Nick Ormerod, with Sian Phillips as Miss Havisham."]}, {"page": "List of Old Etonians born in the 20th century", "response": ["*Nick Ormerod (born 1951), stage designer"]}, {"page": "Disney Theatrical Productions", "response": ["In November 2013, Disney Theatrical Productions, announced plans to mount a stage version of the film Shakespeare in Love in London, with Sonia Friedman Productions as co-producer. The West End production played at the Noël Coward Theatre, with the world premiere scheduled for July 23, 2014. Based on the screenplay by Marc Norman and Tom Stoppard, it has been adapted for the stage by Lee Hall. The production is directed by Declan Donnellan and designed by Nick Ormerod, the driving force behind the noted theatre company, Cheek by Jowl. However, it was announced that the production would close on 18 April 2015."]}, {"page": "Declan Donnellan", "response": ["Declan Michael Martin Donnellan  (born 4 August 1953) is an English film/stage director and author. He co-founded the Cheek by Jowl theatre company with Nick Ormerod in 1981. In addition to his Cheek by Jowl productions, Donnellan has made theatre, opera and ballet with a variety of companies across the world.  In 1992, he received an honorary degree from the University of Warwick and in 2004 he was made a Chevalier de l'Ordre des Arts et des Lettres for his work in France.Declan Donnellan  at Cheek by Jowl In 2010, he was made an honorary fellow of Goldsmiths' College, University of London. Donnellan was appointed Officer of the Order of the British Empire (OBE) in the 2017 Birthday Honours for services to theatre.", "He founded Cheek by Jowl with Nick Ormerod in 1981.\"As he likes it\", profile of Donnellan by Michael Coveney, The Guardian, 4 February 2006 Since 2006 the company has been part of the Barbican's International Theatre Program (BITE) resulting in co-productions of The Changeling (2006), Cymbeline (2007) and Troilus and Cressida (2008).Cymbeline, review by Philip Fisher, British Theatre Guide, 2007Review of Troilus and Cressida by Michael Billington, The Guardian, 29 May 2009 He has directed plays at the Royal Shakespeare Company, the English National Opera, the Old Vic and the Bolshoi Ballet, among others.", "For the Royal Shakespeare Company he has directed The School for Scandal, King Lear (Academy 2002) and an adaptation of Great Expectations (2005) with Nick Ormerod. The cast of Great Expectations included Gwendoline Christie and Sian Phillips. He has also directed Le Cid for the Avignon Festival, Falstaff for the Salzburg Festival and the ballet of Romeo and Juliet for the Bolshoi Theatre in Moscow. Other work in Russia includes The Winter's Tale for the Maly Drama Theatre of Saint Petersburg.The Winter's Tale , production details, Maly Drama Theatre, Saint Petersburg", "In 2014, Donnellan directed the stage play of Shakespeare in Love (play) at the Noël Coward Theatre. The play was adapted for stage by Lee Hall (playwright) from the screenplay by Tom Stoppard and Marc Norman and produced by Disney Theatrical Productions and Sonia Friedman Productions. The production was designed by Donnellan’s co-Artistic Director of Cheek by Jowl theatre company, Nick Ormerod. The original cast included David Oakes as Christopher Marlowe, Paul Chahidi as Philip Henslowe and Anna Carteret as Elizabeth I. From January 2015, the cast included Eve Ponsonby as Viola de Lesseps, Orlando James as William Shakespeare and Suzanne Burden as Elizabeth I of England. Peter Moreton, who played Antigonus and the Old Shepherd in Cheek by Jowl’s The Winter’s Tale in 2015, played Richard Burbage in Shakespeare in Love, and Ryan Donaldson, who played Autolycus in the Cheek by Jowl’s The Winter’s Tale, played Edward Alleyn. Eve Ponsonby, Orlando James, Suzanne Burden and Peter Moreton had all previously worked with Cheek by Jowl in Tis Pity She’s a Whore. Eve Ponsonby played Annabella and Orlando James played her brother Giovanni in the 2014 revival. Suzanne Burden played Hippolita in 2011-2012, alongside Peter Moreton, who played the Cardinal and the Doctor.", "*2005 Great Expectations, with the RSC, a new adaptation by Declan Donnellan and Nick Ormerod"]}, {"page": "Wimbledon College of Arts", "response": ["* Nick Ormerod (theatre designer)"]}, {"page": "'Tis Pity She's a Whore", "response": ["* Between 2011 and 2014, theatre company Cheek by Jowl staged the play, directed by Declan Donnellan and designed by Nick Ormerod. The production went on tour to the Brooklyn Academy of Music in New York and the Barbican Centre in London, amongst others. The production was revived with different casts in 2012 and 2014. In 2011–2012, Lydia Wilson played Annabella, and the role was played by Gina Bramhill in 2012–2013 and Eve Ponsonby in 2014."]}, {"page": "Cheek by Jowl", "response": ["Cheek by Jowl is an international theatre company founded in the United Kingdom by director Declan Donnellan and designer Nick Ormerod in 1981. Donnellan and Ormerod are Cheek by Jowl's artistic directors and together direct and design all of Cheek by Jowl's productions. The company's recent productions include an Italian-language version of Thomas Middleton's The Revenger's Tragedy, Russian-language productions of William Shakespeare's Measure for Measure and Francis Beaumont's The Knight of the Burning Pestle, an English-language production of The Winter's Tale and a French-language production of Shakespeare's Pericles, Prince of Tyre. Cheek by Jowl is an Arts Council England National Portfolio Organisation and an Associate Company of the Barbican Centre, London.", "In 2014, Cheek by Jowl celebrated the 20th anniversary of their As You Like It revival with a screening of the production in the Noel Coward Theatre in London, formerly the Albery Theatre, one of the venues where the revival toured to in 1994 and 1995. The production was filmed, and screened with permission from the Victoria and Albert Museum’s Theatre and Performance Archive. The screening was attended by director Declan Donnellan and designer Nick Ormerod, as well as actor Adrian Lester, who played Rosalind in the production. The play originally opened in 1991 with an all-male cast, touring to, amongst others, New York, Tokyo, Belfast, Adelaide and Rio de Janeiro."]}, {"page": "List of films set in Paris", "response": ["*Bel-Ami, by Declan Donnellan and Nick Ormerod"]}, {"page": "Laurence Olivier Award for Best Set Design", "response": ["|Nick Ormerod"]}, {"page": "Bel Ami (2012 film)", "response": ["Bel Ami is a 2012 drama film directed by Declan Donnellan and Nick Ormerod and starring Robert Pattinson, Uma Thurman, Kristin Scott Thomas, Christina Ricci and Colm Meaney. The film is based on the 1885 French novel of the same name by Guy de Maupassant."]}, {"page": "Ormerod", "response": ["*Nick Ormerod (born 1951), British theatre designer"]}, {"page": "List of British films of 2012", "response": ["|| Directors: Declan Donnellan, Nick Ormerod   Cast: Robert Pattinson, Uma Thurman, Kristin Scott Thomas, Christina Ricci, Colm Meaney, Anthony Higgins"]}, {"page": "62nd Berlin International Film Festival", "response": ["|Declan Donnellan, Nick Ormerod "]}, {"page": "List of French films of 2012", "response": ["| Bel Ami || Declan Donnellan, Nick Ormerod || Robert Pattinson, Uma Thurman, Kristin Scott Thomas, Christina Ricci, Colm Meaney, Anthony Higgins || Drama ||British–French–Italian co-production"]}, {"page": "1988 Laurence Olivier Awards", "response": ["** Nick Ormerod for A Family Affair, Philoctetes and The Tempest – Donmar Warehouse"]}, {"page": "Shakespeare in Love (play)", "response": ["The play premiered at the Noël Coward Theatre in London's West End on 22 July 2014. It was produced by Disney Theatrical Productions and Sonia Friedman Productions and directed by Declan Donnellan, with design by Nick Ormerod and music by Paddy Cunneen. The original cast included David Oakes appearing as Marlowe, Tom Bateman as Will, and Lucy Briggs-Owen as the heroine Viola De Lesseps. The production closed on 18 April 2015.Shakespeare In Love. Accessed: 21 March 2015."]}, {"page": "Radu Poklitaru", "response": ["* Two-act ballet Hamlet based on William Shakespeare’s play to the music of the 5th and 15th symphonies of Dmitri Shostakovich (director Declan Donnellan, scenographer Nick Ormerod), 2015"]}, {"page": "Angelique Rockas", "response": ["In November 1980, Rockas set up the performance of 'Tis Pity She's a Whore by John Ford in which she played the lead part of Annabella. She financed the production herself and enlisted the then unknown Declan Donnellan to direct the play to be performed at London's Half Moon Theatre and Theatre Space. The production was designed by Nick Ormerod."]}, {"page": "2015 WhatsOnStage Awards", "response": ["**Nick Ormerod – Shakespeare in Love"]}, {"page": "Linbury Prize for Stage Design", "response": ["| 2009 || Aleš Valášek (OW)Samal BlakJean ChanRuth Sutcliffe || Katrina LindsayBob CrowleyNick Ormerod || Birmingham Opera CompanyaRoyal Theatre NorthamptonSound & Fury in collaboration with Fuel and Unicorn Theatre"]}, {"page": "Odile Dicks-Mireaux", "response": ["| Declan Donnellan and Nick Ormerod"]}]}}