{"wiki_id": "http://www.wikidata.org/entity/Q333824", "itemLabel": "William Sidney, 1st Viscount De L'Isle", "itemDescription": "Recipient of the Victoria Cross (1909-1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Sidney,_1st_Viscount_De_L%27Isle", "wikipedia_page": {"main": "William Philip Sidney, 1st Viscount De L'Isle,  (23 May 1909 – 5 April 1991), known as The Lord De L'Isle and Dudley between 1945 and 1956, was a British Army officer, politician and Victoria Cross recipient who served as the 15th Governor-General of Australia, in office from 1961 to 1965. He was the last non-Australian to hold the position.\nSidney was born into a minor aristocratic family, and attended Eton College before going on to Magdalene College, Cambridge. He became a chartered accountant, but also joined the Territorial Army. During the Second World War, Sidney served with the Grenadier Guards in France and Italy; he was awarded the Victoria Cross in 1944 for his actions in the Battle of Anzio. He was elected to the House of Commons later that year, as a member of the Conservative Party.\nIn 1945, Sidney succeeded his father as Baron De L'Isle and Dudley, consequently being elevated to the House of Lords. He served as Secretary of State for Air from 1951 to 1955, under Winston Churchill, and was raised to the viscountcy in 1956. Lord De L'Isle became governor-general in 1961 on the recommendation of Robert Menzies, the Prime Minister of Australia. He served for just under four years with little controversy; as well as being the last foreign governor-general, he was also the last to wear the traditional vice-regal uniform.", "link_mentions": [{"page": "April 5", "response": ["*  1991   – William Sidney, 1st Viscount De L'Isle (b. 1909)"]}, {"page": "1991", "response": ["** William Sidney, 1st Viscount De L'Isle, former Governor-General of Australia (b. 1909)"]}, {"page": "William Philip Sidney", "response": ["#REDIRECTWilliam Sidney, 1st Viscount De L'Isle"]}, {"page": "Viscount De L'Isle", "response": ["*William Sidney, 1st Viscount De L'Isle (1909–1991)"]}, {"page": "List of knights and ladies of the Garter", "response": ["| William Sidney, 1st Viscount De L'Isle"]}, {"page": "List of Old Etonians born in the 20th century", "response": ["*William Sidney, 1st Viscount De L'Isle (1909–1991), Second World War Victoria Cross"]}, {"page": "Penshurst", "response": ["** William Sidney, 1st Viscount De L'Isle  (1909–1991), Governor-General of Australia"]}]}}