{"wiki_id": "http://www.wikidata.org/entity/Q333628", "itemLabel": "Lord George Hamilton", "itemDescription": "British politician (1845-1927)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lord_George_Hamilton", "wikipedia_page": {"main": "Lord George Francis Hamilton  (17 December 1845 – 22 September 1927) was a British Conservative Party politician of the late 19th and early 20th centuries who served as First Lord of the Admiralty and Secretary of State for India.", "link_mentions": [{"page": "William Ewart Gladstone", "response": ["In December 1893, an Opposition motion proposed by Lord George Hamilton called for an expansion of the Royal Navy. Gladstone opposed increasing public expenditure on the naval estimates, in the tradition of free trade liberalism of his earlier political career as Chancellor. All his Cabinet colleagues believed in some expansion of the navy. He declared in the Commons on 19 December that naval rearmament would commit the government to expenditure over a number of years and would subvert \"the principle of annual account, annual proposition, annual approval by the House of Commons, which...is the only way of maintaining regularity, and that regularity is the only talisman which will secure Parliamentary control\".David Brooks, \"Gladstone's Fourth Administration, 1892–1894\", in David Bebbington and Roger Swift (eds.), Gladstone Centenary Essays (Liverpool University Press, 2000), p. 239. In January 1894, Gladstone wrote that he would not \"break to pieces the continuous action of my political life, nor trample on the tradition received from every colleague who has ever been my teacher\" by supporting naval rearmament.Anthony Howe, 'Gladstone and Cobden', in David Bebbington and Roger Swift (eds.), Gladstone Centenary Essays (Liverpool University Press, 2000), p. 115. Gladstone also opposed Chancellor Sir William Harcourt's proposal to implement a graduated death duty. In a fragment of autobiography dated 25 July 1894, Gladstone denounced the tax as"]}, {"page": "Joseph Chamberlain", "response": ["When the Cabinet meeting failed to endorse his proposals, Chamberlain announced his resignation, but Balfour did not tell the meeting about Chamberlain's resignation letter, instead telling many members of his belief that Chamberlain was not serious about resigning. The Prime Minister then forced the resignations of Ritchie and Lord Balfour of Burleigh for having submitted memoranda advocating Free Trade. The next day, Lord George Hamilton resigned, and the following day, 16 September, Balfour announced the resignations of Ritchie, Hamilton and Chamberlain. The Free Trade ministers were appalled that Chamberlain's letter of resignation had been kept secret, and the Duke of Devonshire, who had also resigned, rescinded his decision. But when Balfour explained his fiscal policy on 1 October, Devonshire re-submitted his resignation. The resignations of Chamberlain, Ritchie and Devonshire left the government gravely weakened."]}, {"page": "Secretary of State for India", "response": ["| rowspan=2 | The Right HonourableLord George HamiltonMP for Ealing"]}, {"page": "John Bright", "response": ["Bright was re-elected by his Birmingham constituents and it turned out to be his last Parliament. He sat as a Liberal allied to the Conservative and Liberal Unionist coalition government who had won the election. Bright participated little in this Parliament, however his actions could still decide events. Lord George Hamilton recorded that when the government introduced the Criminal Law Amendment (Ireland) Bill in March 1887, which increased the authorities' coercive powers, the Liberal Party opposed it. Bright did not speak in the debate but Hamilton notes that great importance was attached to how Bright would vote: \"If he abstained from voting or voted against the Government, the Unionist coalition would have been practically broken up. On the other hand if he, in order to avert Home Rule, voted for a procedure which was so contrary to his previous professions, the Coalition would receive a fresh source of strength and cohesion. When the Division Bell rang, Mr. Bright, who was sitting close by Gladstone, without a moment's hesitation walked straight into the Government's lobby\".Trevelyan, p. 459."]}, {"page": "Secretary of State for Education", "response": ["| Lord George Hamilton"]}, {"page": "Prince Louis of Battenberg", "response": ["Although born in Austria, and brought up in Italy and Germany, he enrolled in the United Kingdom's Royal Navy at the age of fourteen. Queen Victoria and her son the Prince of Wales (later Edward VII) occasionally intervened in his career: the Queen thought that there was \"a belief that the Admiralty are afraid of promoting Officers who are Princes on account of the radical attacks of low papers and scurrilous ones\".Queen Victoria to First Lord of the Admiralty Lord George Hamilton, 5 September 1891, quoted in ", "On his penultimate day aboard the Queen's yacht, 30 August 1885, Louis was promoted to the rank of commander.Kerr, p. xii The next four years were spent in the shore establishments  and  on half-pay, on HMS Cambridge, very briefly at Milford Haven in August 1886, and on board  in the Mediterranean.Kerr, p. xiii and p. 110 Irish nationalist Member of Parliament (MP) Willie Redmond and Liberal MP Charles Conybeare both questioned Battenberg's appointment to Dreadnought in the British House of Commons. Conybeare asked, \"What special qualifications have entitled a foreigner to be promoted over the heads of some 30 British officers?\" First Lord of the Admiralty Lord George Hamilton said, \"Captain Stephenson, who commands the Dreadnought, applied for Prince Louis of Battenberg to fill the appointment. I may add that another officer who is about to command a large iron-clad in the Mediterranean has made a similar application.\" He added that 22 commanders junior to Battenberg held similar appointments, and that Battenberg was a naturalised British subject. Another Liberal MP, Edward Pickersgill, backed up by Conybeare and Irish nationalist Charles Tanner, questioned the propriety of Battenberg's appointment to the Navy in 1868, given Battenberg's failure to get the required medical certificate, and suggested that he only got in the Navy because of royal favour."]}]}}