{"wiki_id": "http://www.wikidata.org/entity/Q3336241", "itemLabel": "Nasser Khalili", "itemDescription": "British-Iranian scholar, collector and philanthropist", "wikipedia_url": "https://en.wikipedia.org/wiki/Nasser_Khalili", "wikipedia_page": {"main": "Sir Nasser David Khalili (Persian: ناصر داوود خلیلی, born 18 December 1945) is a British-Iranian scholar, collector, and philanthropist based in London. Born in Iran and educated at Queens College, City University of New York and the School of Oriental and African Studies in London, he is now a British citizen. Khalili has assembled eight art collections—the Khalili Collections—each considered among the most important in its field. These collections total 35,000 artworks and include the largest private collection of Islamic art and a collection of Japanese art rivalling that of the Japanese imperial family. He has spent tens of millions of pounds on conserving, researching, and documenting the collections, publishing more than seventy volumes of catalogues and research so far. Exhibitions drawn from the collections have appeared in institutions around the world.\nHe first started to collect art in New York City during the 1970s, later investing in property in the United Kingdom during the 1980s. Since then his wealth has grown substantially, which he stated in an interview was due to \"dealing in art, commodities and real estate\". Khalili is known for the purchase and renovation of a number of large properties in London.\nThrough his philanthropic organisation, the Khalili Foundation, he supports a range of activities to promote mutual understanding and dialogue between Abrahamic religions. His donations funded the creation of a research centre in Islamic art at the University of Oxford as well as the first university chair in the subject, at the School of Oriental and African Studies. He also supports the creation and distribution of educational materials and has written and distributed a history of Islamic art and architecture.\nKhalili is a UNESCO Goodwill Ambassador and has taken part in United Nations and UNESCO events on the theme of peace between cultures. His work for intercultural dialogue and peace has been recognised with honorary degrees from five universities and awards from the French National Assembly and the High Sheriff of Greater London. He is the recipient of the Legion of Honour, presented by French President François Hollande. He is also a trustee of the City of Jerusalem and has received knighthoods from two Popes. He received a knighthood in the 2020 Queen's Birthday Honours \"for services to interfaith relations and charity\".\nWhen asked about his collections, Khalili stated that he \"found things that belonged to a great heritage that was just sitting there unnoticed. [...] They were displaced from history and deserved to be preserved and recognised\".\n\n", "link_mentions": [{"page": "Meiji (era)", "response": ["Today, Masayuki Murata owns more than 10,000 Meiji art works and is one of the most enthusiastic collectors. From that time, most of the excellent works of Meiji Art were bought by foreign collectors and only a few of them remained in Japan, but because he bought back many works from foreign countries and opened the Kiyomizu Sannenzaka Museum,Kiyomizu Sannenzaka Museum the study and reevaluation of Meiji Art rapidly advanced in Japan after the 21st century.第12回「創造する伝統賞」. Japan Arts Foundation. Nasser Khalili is also one of the world's most dedicated collectors of Meiji art, and his collection encompasses many categories of Meiji art. The Japanese Imperial Family also owns excellent works of Meiji Art, some of which were donated to the state and are now stored in the Museum of the Imperial Collections."]}, {"page": "Japanese art", "response": ["Today, Masayuki Murata owns more than 10,000 Meiji art works and is one of the most enthusiastic collectors. From that time, most of the excellent works of Meiji Art were bought by foreign collectors and only a few of them remained in Japan, but because he bought back many works from foreign countries and opened the Kiyomizu Sannenzaka Museum,Kiyomizu Sannenzaka Museum the study and reevaluation of Meiji Art rapidly advanced in Japan after the 21st century.第12回「創造する伝統賞」. Japan Arts Foundation. Nasser Khalili is also one of the world's most dedicated collectors of Meiji art, and his collection encompasses many categories of Meiji art. The Japanese Imperial Family also owns excellent works of Meiji Art, some of which were donated to the state and are now stored in the Museum of the Imperial Collections."]}, {"page": "1945 in art", "response": ["* December 18 – Nasser Khalili, Iranian-British collector, art scholar, investor and philanthropist"]}, {"page": "Royal Order of Francis I", "response": ["* Nasser Khalili"]}, {"page": "Japanese lacquerware", "response": ["Today, Japanese lacquerware is sought by collectors and museums around the world. Modern collections of Japanese lacquerware outside Japan include the Nasser D. Khalili Collection of Japanese Art which includes works by Shitaba Zeshin and other notable artists. Nasser Khalili has run exhibitions focused on Shibata Zeshin's work in four countries. The Charles A. Greenfield Collection in the United States covers the period from 1600 to 1900. Marie Antoinette's collection of domestic lacquer is split between the Louvre, the Guimet Museum, and the Palace of Versailles. The V&A Museum in London has a collection of mainly export lacquerware totalling around 2,500 pieces."]}, {"page": "David Khalili", "response": ["#REDIRECT Nasser Khalili"]}, {"page": "List of Queens College people", "response": ["*Nasser Khalili - Scholar, philanthropist"]}, {"page": "Khalili", "response": ["*Nasser Khalili, (born 1945), British-Iranian scholar, collector and philanthropist"]}, {"page": "List of most expensive books and manuscripts", "response": ["59 folios from the second volume of the \"Arabic Manuscript\". Purchased by Nasser Khalili for the Khalili Collection of Islamic Art"]}, {"page": "Peter Cruddas, Baron Cruddas", "response": ["In 2016, Cruddas and his wife Fiona paid £42 million in cash for Balfour House, a seven-storey Victorian mansion close to Park Lane in London's Mayfair, formerly owned by the Iranian-born art dealer Nasser Khalili, who lived there for 22 years."]}, {"page": "Nasser David Khalili", "response": ["#REDIRECT Nasser Khalili"]}, {"page": "List of Honorary Fellows of Wolfson College, Oxford", "response": ["* Nasser Khalili"]}, {"page": "Professor Khalili", "response": ["#REDIRECT Nasser Khalili"]}, {"page": "7 and 8 Balfour Place", "response": ["In 2016, billionaire British banker Peter Cruddas and his wife Fiona paid £42 million in cash for the seven-storey mansion, formerly owned by the Iranian-born art dealer Nasser Khalili, who lived there for 22 years."]}, {"page": "List of Iranians by net worth", "response": ["| 2005–2013 || Nasser Khalili ||  || 1.0 billion (2007) || art, real estate || "]}]}}