{"wiki_id": "http://www.wikidata.org/entity/Q333250", "itemLabel": "Shirley Williams", "itemDescription": "British politician (1930-2021)", "wikipedia_url": "https://en.wikipedia.org/wiki/Shirley_Williams", "wikipedia_page": {"main": "Shirley Vivian Teresa Brittain Williams, Baroness Williams of Crosby,  (née Catlin; 27 July 1930 – 11 April 2021) was a British politician and academic. Originally a Labour Party Member of Parliament (MP), she served in the Labour cabinet from 1974 to 1979. She was one of the \"Gang of Four\" rebels who founded the Social Democratic Party (SDP) in 1981 and, at the time of her retirement from politics, was a Liberal Democrat.Williams was elected to the House of Commons for Hitchin in the 1964 general election. She served as Minister for Education and Science from 1967 to 1969 and Minister of State for Home Affairs from 1969 to 1970. She served as Shadow Home Secretary from 1971 and 1973. In 1974, she became Secretary of State for Prices and Consumer Protection in Harold Wilson's cabinet. When Wilson was succeeded by James Callaghan, she served as Secretary of State for Education and Science and Paymaster General from 1976 to 1979. She lost her seat to the Conservative Party at the 1979 general election.\nIn 1981, dismayed with the Labour Party's left-ward movement under Michael Foot, she was one of the \"Gang of Four\"—centrist Labour figures who formed the SDP. Williams won the 1981 Crosby by-election and became the first SDP member elected to Parliament, but she lost the seat in the 1983 general election. She served as President of the SDP from 1982 to 1987 and supported the SDP's merger with the Liberal Party that formed the Liberal Democrats.\nBetween 2001 and 2004, she served as Leader of the Liberal Democrats in the House of Lords and, from 2007 to 2010, as Adviser on Nuclear Proliferation to Prime Minister Gordon Brown. She remained an active member of the House of Lords until announcing her retirement in January 2016, and was a Professor Emerita of Electoral Politics at the John F. Kennedy School of Government at Harvard University at the time of her death at age 90, having been one of the last surviving members of the Labour governments of the 1970s.", "link_mentions": [{"page": "Liberal Party (UK)", "response": ["In 1981, defectors from a moderate faction of the Labour Party, led by former Cabinet ministers Roy Jenkins, David Owen and Shirley Williams, founded the Social Democratic Party (SDP). The new party and the Liberals quickly formed the SDP–Liberal Alliance, which for a while polled as high as 50% in the opinion polls and appeared capable of winning the next general election. Indeed, Steel was so confident of an Alliance victory that he told the 1981 Liberal conference, \"Go back to your constituencies, and prepare for government!\"."]}, {"page": "July 27", "response": ["*  1930   – Shirley Williams, English academic and politician, Secretary of State for Education (d. 2021)"]}, {"page": "Michael Foot", "response": ["Almost immediately following  his election as leader, he was faced with a serious crisis. On 25 January 1981, four senior politicians on the right-wing of the Labour Party (Roy Jenkins, Shirley Williams, David Owen and William Rodgers, the so-called \"Gang of Four\") left Labour and formed the SDP, which was launched on 26 March 1981. This was largely seen as the consequence of the Labour Party's swing to the left, polarising divisions in an already divided party."]}, {"page": "Official Monster Raving Loony Party", "response": ["Two others were important in the formation of the OMRLP: John Desmond Dougrez-Lewis stood in the Crosby by-election of 1981 (won by the Social Democratic Party's co-founder Shirley Williams); and Dougrez-Lewis stood in the by-election as \"Tarquin Fin-tim-lin-bin-whin-bim-lim-bus-stop-F'tang-F'tang-Olé-Biscuitbarrel\", taken from the Election Night Special Monty Python sketch. He had changed his name by deed poll from John Desmond Lewis, on behalf of the Cambridge University Raving Loony Society (CURLS). CURLS were an \"anti-political party\" and charity fundraising group formed largely as a fun counter-response to increasingly polarised student politics in Cambridge, and they were responsible for a number of fun stunts. Their Oxford University equivalents were the \"Oxford Raving Lunatics\". Dougrez-Lewis became Sutch's agent at the notorious Bermondsey by-election mentioned above, where the OMRLP banner was first officially unfurled. Reverting to his original name, Dougrez-Lewis stood for the new party in Cambridge in the 1983 general election."]}, {"page": "Roy Jenkins", "response": ["Although becoming increasingly disillusioned during this time by what he considered the party's drift to the left, he was the leading Labour figure in the EEC referendum of June 1975 (and was also president of the 'Yes' campaign). In September 1974 he had followed Shirley Williams in stating that he \"could not stay in a Cabinet which had to carry out withdrawal\" from the EEC.David Wood, 'Mr Jenkins says he too would resign if Britain decided to leave EEC', The Times (27 September 1974), p. 1. During the referendum campaign, Tony Benn claimed that 500,000 jobs had been lost due to Britain's membership; Jenkins replied on 27 May that \"I find it increasingly difficult to take Mr Benn seriously as an economics minister\".George Clark, 'Mr Wilson joins in criticism of Mr Benn's figures', The Times (28 May 1975), p. 1. He added that Britain outside the EEC would enter \"an old people's home for fading nations. ... I do not even think it would be a comfortable or agreeable old people's home. I do not much like the look of some of the prospective wardens\".Roger Berthoud, 'Mr Jenkins sees cold world outside Nine', The Times (28 May 1975), p. 3. The two men debated Britain's membership together on Panorama, which was chaired by David Dimbleby.Campbell, Roy Jenkins: A Well-Rounded Life, p. 447. According to David Butler and Uwe Kitzinger, \"they achieved a decidedly more lucid and intricate level of discussion than is commonly seen on political television\".David Butler and Uwe Kitzinger, The 1975 Referendum (London: Macmillan, 1976), p. 205. Jenkins found it congenial to work with the centrists of all parties in the campaign and the 'Yes' campaign won by two to one.Campbell, Roy Jenkins: A Well-Rounded Life, p. 448.", "In October 1978 Tribune reported (falsely) that Jenkins and his wife had not paid their Labour Party subscription for several years. After this was repeated in the national press, Jenkins' drafted his wife's letter to The Times that refuted the allegation.Campbell, Roy Jenkins: A Well-Rounded Life, p. 505.Jennifer Jenkins, 'A Labour Party subscription', The Times (20 October 1978), p. 17. Jenkins blamed the story on a \"malicious Trot in the North Kensington Labour Party\". Jenkins was disillusioned with the Labour Party and he was almost certain that he could not stand again as a Labour candidate; in January 1979 he told Shirley Williams that the \"big mistake we had made was not to go and support Dick Taverne in 1973; everything had got worse since then\".Roy Jenkins, European Diary, 1977–1981 (London: Collins, 1989), p. 387.", "The Labour Party conference at Blackpool in September 1980 adopted a unilateralist defence policy, withdrawal from the EEC and further nationalisation, along with Tony Benn's demands for the mandatory reselection of MPs and an electoral college to elect the party leader.Campbell, Roy Jenkins: A Well-Rounded Life, p. 551. In November Labour MPs elected the left-winger Michael Foot over the right-wing Denis HealeyCampbell, Roy Jenkins: A Well-Rounded Life, p. 552. and in January 1981 Labour's Wembley conference decided that the electoral college that would elect the leader would give the trade unions 40 per cent of the vote, with MPs and constituency parties 30 per cent each.Campbell, Roy Jenkins: A Well-Rounded Life, p. 557. Jenkins then joined David Owen, Bill Rodgers and Shirley Williams (known as the \"Gang of Four\") in issuing the Limehouse Declaration. This called for the \"realignment of British politics\". They then formed the Social Democratic Party (SDP) on 26 March.Campbell, Roy Jenkins: A Well-Rounded Life, p. 559."]}, {"page": "Tony Richardson", "response": ["Richardson was born in Shipley, West Riding of Yorkshire in 1928, the son of Elsie Evans (Campion) and Clarence Albert Richardson, a chemist.Richardson, pp 1–5 He was Head Boy at Ashville College, Harrogate and attended Wadham College, University of Oxford. His Oxford contemporaries included Rupert Murdoch, Margaret Thatcher, Kenneth Tynan, Lindsay Anderson and Gavin Lambert. He had the unprecedented distinction of being the President of both the Oxford University Dramatic Society and the Experimental Theatre Club (the ETC), in addition to being the theatre critic for the university magazine Isis.Richardson, p.45 Those he cast in his student productions included Shirley Williams (as Cordelia), John Schlesinger, Nigel Davenport and Robert Robinson.Adler, p.26"]}, {"page": "Somerville College, Oxford", "response": ["The ground floor contains the Flora Anderson Hall (FAH) and Brittain-Williams Room, named after Vera Brittain and Shirley Williams, the college's most famous mother-daughter alumnae. The room was designed in 2012 by the architect Niall McLaughlin and opened on 29 November 2013 by Williams at an event that included her unveiling a portrait of herself, which now hangs in the room. The FAH is used for lectures and events, notably college parties (or bops) and mock exams, known as Collections.", "Somervillians include Prime Ministers Margaret Thatcher and Indira Gandhi, Nobel Prize winning scientist Dorothy Hodgkin, television personalities Esther Rantzen and Susie Dent, reformer Cornelia Sorabji, writers Marjorie Boulton, A. S. Byatt, Vera Brittain, Susan Cooper, Penelope Fitzgerald, Winifred Holtby, Nicole Krauss, Iris Murdoch and Dorothy L. Sayers, politicians Shirley Williams, Margaret Jay and Sam Gyimah, Princess Bamba Sutherland and her sister, biologist Marian Dawkins, philosophers G. E. M. Anscombe, Patricia Churchland, Philippa Foot and Mary Midgley, psychologist Anne Treisman, archaeologist Kathleen Kenyon, actress Moon Moon Sen, soprano Emma Kirkby, banker Baroness Vadera and numerous (women's rights) activists."]}, {"page": "1979 United Kingdom general election", "response": ["Future Prime Minister John Major, who went on to succeed Thatcher in November 1990, entered Parliament at this election, retaining the Huntingdon seat in Cambridgeshire for the Conservatives. Jeremy Thorpe, Shirley Williams and Barbara Castle were all among the members of parliament who resigned or lost their seats.", "|Shirley Williams"]}, {"page": "1983 United Kingdom general election", "response": ["As the likes of Blair, Brown and Corbyn entered parliament, a string of prominent members of parliament stepped aside or lost their seats. Former Labour Prime Minister Harold Wilson stood down from parliament after 38 years, while the SDP's Shirley Williams and Bill Rodgers lost their seats only a short time after winning them. Joan Lestor, Tony Benn as well as Speaker of the House of Commons and former Labour cabinet minister George Thomas also departed from parliament at this election, although Benn would return after winning a by-election in Chesterfield the following year, and Lestor returned to parliament after winning a seat at the following general election in 1987. In addition, two future Leaders of the Liberal Democrats were first elected—Paddy Ashdown and Charles Kennedy. Michael Howard, who later served the Conservatives as Home Secretary in government and as party leader in opposition, was also elected to parliament in 1983.", "Michael Foot was elected leader of the Labour Party at the end of 1980, replacing James Callaghan. The election of Foot signalled that the core of the party was swinging to the left and the move exacerbated divisions within the party. During 1981, a group of senior figures including Roy Jenkins, David Owen, Bill Rodgers and Shirley Williams left Labour to found the Social Democratic Party (SDP). The SDP agreed to a pact with the Liberals for the 1983 election and stood as \"The Alliance\". For a while the Alliance topped the opinion polls and looked capable of achieving their goal of forming a coalition government at the next general election, but the success of the Falklands campaign in 1982 saw the political tide turn in favour of the Conservative government.", "The election saw a landslide victory for the Conservatives, achieving their best results since 1935. Although there was a slight drop in their share of the vote, they made significant gains at the expense of Labour. The night was a disaster for the Labour Party; their share of the vote fell by over 9%, which meant they were only 700,000 votes ahead of the newly-formed third party, the SDP–Liberal Alliance. The massive increase of support for the Alliance at the expense of Labour meant that, in many seats, the collapse in the Labour vote allowed the Conservatives to gain. Despite winning over 25% of the national vote, the Alliance got fewer than 4% of seats, 186 fewer than Labour. The most significant Labour loss of the night was Tony Benn, who was defeated in the revived Bristol East seat. SDP President Shirley Williams, then a prominent leader in the Social Democratic Party, lost her Crosby seat which she had won in a by-election in 1981. Bill Rodgers, another leading figure in the Alliance (like Williams, one of the \"Gang of Four\") also failed to win his old seat that he previously held as a Labour MP.", "|Shirley Williams"]}, {"page": "Tony Benn", "response": ["In a keynote speech to the Labour Party Conference of 1980, shortly before the resignation of party leader James Callaghan and election of Michael Foot as successor, Benn outlined what he envisaged the next Labour Government would do. \"Within days\", a Labour Government would gain powers to nationalise industries, control capital and implement industrial democracy; \"within weeks\", all powers from Brussels would be returned to Westminster, and the House of Lords would be abolished by creating one thousand new peers and then abolishing the peerage. Benn received tumultuous applause. On 25 January 1981, Roy Jenkins, David Owen, Shirley Williams and Bill Rodgers (known collectively as the \"Gang of Four\") launched the Council for Social Democracy, which became the Social Democratic Party in March. The \"Gang of Four\" left the Labour Party because of what they perceived to be the influence of the Militant tendency and the Bennite \"hard left\" within the party. Benn was highly critical of the SDP, saying that \"Britain has had SDP governments for the past 25 years.\""]}, {"page": "Buxton", "response": ["*Vera Brittain (1893–1970), Buxton-born authorBiography and List of Works at Litweb website archive retrieved January 2018. of Testament of Youth and mother of Shirley Williams, went to school in Buxton."]}, {"page": "Linacre College, Oxford", "response": ["* 2016: Shirley Williams, \"The Value of Europe and European Values\"."]}, {"page": "John Smith (Labour Party leader)", "response": ["Smith first stood as a Labour parliamentary candidate aged 23 at a by-election in 1961 in the East Fife constituency; he contested that seat again in the 1964 general election. As it was a safe seat for the Unionist Party (who at the time ran in place of the Conservatives), Smith came second by some distance on both occasions. At the 1970 general election he was elected as Member of Parliament (MP) for North Lanarkshire, succeeding Peggy Herbison.Stuart, Mark, John Smith: A Life (London: Politico's, 2005), p. 63. Smith made his maiden speech on 10 November 1970, opposing the Conservative government's Family Income Supplements Act 1970.Stuart, p. 63. On 28 October 1971, Smith defied the Labour whips in joining Labour MPs led by Roy Jenkins to vote in favour of entry to the European Communities.Stuart, p. 64. These included Roy Hattersley, Shirley Williams, Bill Rodgers and David Owen, with all of whom he was later to sit in the Callaghan cabinet."]}, {"page": "Tom Baker", "response": ["For the third series of the British game show Cluedo, Baker was cast as Professor Plum, a \"man with a degree in suspicion\". He was also cast in the 2004 series Strange, as a blind priest who possessed knowledge of the Devil. In addition, he played the part of Donald MacDonald in the BBC series Monarch of the Glen, from 2004 until 2005. Previously, he had appeared as a guest on the quiz show Have I Got News For You and was subsequently described by presenter Angus Deayton as the funniest guest in the series' history. A particular highlight was when Baker gave an anecdotal account of how, while entering a recording studio in Wales, he was accosted by a member of the public who told Baker: \"I will never forgive you, nor will my wife, for what you did to our grammar schools.\" Baker responded with: \"What are you talking about, you daft bugger?\" to which the stranger replied: \"I'm so sorry. For a moment I thought you were Shirley Williams.\""]}, {"page": "Imperial War Museum", "response": [" HMS Belfast, a Town class cruiser, was launched in 1938 and served throughout the Second World War, participating in the December 1943 Battle of North Cape and firing some of the first shots of Operation Overlord, the Allied invasion of Normandy in June 1944. She saw further combat in the Korean War. Expected to be disposed of as scrap after she was decommissioned in 1963, in 1967 efforts were initiated to preserve Belfast as a museum ship. A joint committee of the Imperial War Museum, the National Maritime Museum and the Ministry of Defence was established, and reported in June 1968 that preservation was practical. In 1971 the government decided against preservation, prompting the formation of the private HMS Belfast Trust to campaign for her to be saved for the nation. The Trust was successful in its efforts, and the government transferred the ship to the Trust in July 1971. Brought to London, she was moored on the River Thames near Tower Bridge in the Pool of London. Opened to the public in October 1971 Belfast became a branch of the Imperial War Museum on 1 March 1978, being acknowledged by the then Secretary of State for Education and Science, Shirley Williams, as \"a unique demonstration of an important phase of our history and technology\"."]}, {"page": "University of East Anglia", "response": ["The University hosted its inaugural literary festival in 1991 and has welcomed notable speakers including Madeleine Albright, Martin Amis, Martin Bell, Alan Bennett, Cherie Blair, Melvyn Bragg, Eleanor Catton, Richard Dawkins, Alain de Botton, Sebastian Faulks, Niall Ferguson, Stephen Fry, Frank Gardner, Richard E. Grant, Germaine Greer, Seamus Heaney, Clive James, P. D. James, Doris Lessing, Mario Vargas Llosa, Hilary Mantel, Iris Murdoch, Rageh Omaar, Michael Palin, Jeremy Paxman, Harold Pinter, Stephen Poliakoff, Terry Pratchett, Salman Rushdie, Simon Schama, Will Self, John Simpson, Zadie Smith, Paul Theroux, Peter Ustinov, Shirley Williams and Robert Winston."]}, {"page": "Gillian Ayres", "response": ["In 1941, Ayres was sent to Colet Court, the junior school for St Paul's, Hammersmith.Gooding, pg. 15 She passed the entrance exam for St Paul's Girls' School the following year, and developed an interest in art while there. Among her schoolfriends was Shirley Williams, with whom she taught art to children in bomb-damaged parts of London."]}, {"page": "HMS Belfast", "response": ["By 1977, the financial position of the HMS Belfast Trust had become marginal, and the Imperial War Museum sought permission to merge the Trust into the museum. On 19 January 1978 the Secretary of State for Education and Science, Shirley Williams, accepted the proposal stating that HMS Belfast \"is a unique demonstration of an important phase of our history and technology\". The ship was transferred to the museum on 1 March 1978, and became the Imperial War Museum's third branch, Duxford aerodrome having been acquired in 1976. In October 1998, the HMS Belfast Association was formed to reunite former members of the ship's company. The Imperial War Museum's Sound Archive also seeks to record oral history interviews with former crewmen."]}, {"page": "SDP–Liberal Alliance", "response": ["Following the establishment of the Social Democratic Party (SDP) by the 'Gang of Four' (Roy Jenkins, David Owen, Bill Rodgers, Shirley Williams), who had left the Labour Party in March 1981, the SDP entered into an informal alliance with the Liberal Party, led by David Steel. The SDP fought its first by-election, in Warrington, with future leader Roy Jenkins standing as \"SDP with Liberal support\".", "* Crosby (Shirley Williams of the SDP),"]}, {"page": "Steve Nallon", "response": ["Nallon worked as a stand-up comedian on the northern club circuit in the 1970s. After taking a degree in English and Drama he had a short time in repertory theatre at Theatre Clwyd (1983) before becoming a founding member of the Spitting Image team in 1984. The series aired on the ITV network for twelve years from 1984 to 1996 and featured puppet caricatures of celebrities. Although Nallon became well known for providing the voice of Margaret Thatcher on the show, he also voiced many of the show's other characters, including Roy Hattersley, The Queen Mother, Alan Bennett, David Attenborough, Harold Wilson, Bruce Forsyth, Robert Runcie, Edward Heath, Shirley Williams, David Frost and Malcolm Rifkind."]}, {"page": "Newcastle-under-Lyme", "response": ["The town has been the birthplace of several notable politicians and activists. Fanny Deakin was a campaigner for better nourishment for babies and young children and better maternity care for mothers. The former chairwoman of Campaign for Nuclear Disarmament (CND), Janet Bloomfield (née Hood) is a peace and disarmament campaigner. Vera Brittain  writer, feminist (and mother of Liberal Democrat Shirley Williams) was born in the town.", "*Vera Brittain (1893–1970), author, reformer, pacifist, and mother of Shirley WilliamsThe Guardian, 30 August 2003, The making of a peacenik. Retrieved December 2017."]}, {"page": "David Owen", "response": ["Early in 1981, Owen and three other senior moderate Labour politicians – Roy Jenkins, Bill Rodgers and Shirley Williams – announced their intention to break away from the Labour Party to form a \"Council for Social Democracy\". The announcement became known as the Limehouse Declaration and the four as the \"Gang of Four\". The council they formed became the Social Democratic Party (SDP), with a collective leadership. Although Owen was one of the founding members of the party, he was not always enthusiastic about creating a schism on the centre-left, saying to the Glasgow Herald in January 1981 that he felt \"haunted by the possibility that, if the Labour Party splits, the centre left will never again form the Government in Britain\".", "In 1987 immediately after the election, the Liberal leader David Steel proposed a full merger of the Liberal and SDP parties and was supported for the SDP by Roy Jenkins, Shirley Williams and Bill Rodgers. Owen rejected this notion outright, on the grounds that he and other Social Democrats wished to remain faithful to social democracy as it was practised within Western Europe, and it was unlikely that any merged party would be able to do this, even if it was under his leadership. Nevertheless, the majority of the SDP membership supported the merger."]}, {"page": "Paymaster General", "response": ["|Shirley Williams"]}, {"page": "Vera Brittain", "response": ["In 1925, Brittain married George Catlin, a political scientist (1896–1979). Their son, John Brittain-Catlin (1927–1987), with whom Vera had a bad relationship, was an artist, painter, businessman and the author of the autobiography Family Quartet, which appeared in 1987. Their daughter, born 1930, was the former Labour Cabinet Minister, later Liberal Democrat peer, Shirley Williams (1930–2021), one of the \"Gang of Four\" rebels on the Social Democratic wing of the Labour Party who founded the SDP in 1981. Like Brittain, Catlin was raised Anglican but unlike her, he had converted to the Catholic Church prior to the 1920s, and thus he raised their children as Catholics."]}, {"page": "Testament of Youth", "response": ["In 2009 it was announced that the feature film Testament of Youth was in development by BBC Films and Heyday Films producer David Heyman, and was to be directed by James Kent. This had the support of the Vera Brittain Estate, Brittain's daughter Shirley Williams, and Brittain's biographer Mark Bostridge who is acting as consultant. Saoirse Ronan was cast to play Brittain in 2012 but was replaced in December 2013 when it was announced that Alicia Vikander would play Vera Brittain in the film which was released in late 2014 as part of the First World War commemorations. On 4 February 2014 Kit Harington joined the cast to play the role of Brittain's fiancé Roland Leighton. On 13 February 2014, Colin Morgan, Taron Egerton, and Alexandra Roach were announced to have joined the film's cast. An ensemble cast was later confirmed as filming began, including Dominic West, Emily Watson, Joanna Scanlan, Hayley Atwell, Jonathan Bailey and Anna Chancellor. It substituted Merton College, Oxford in the scenes showing Brittain's time as a student at Somerville College, arguing that filming in Somerville itself would been too difficult in light of the new buildings constructed there since the film's time period."]}]}}