{"wiki_id": "http://www.wikidata.org/entity/Q333951", "itemLabel": "Home Riggs Popham", "itemDescription": "Royal Navy admiral (1762-1820)", "wikipedia_url": "https://en.wikipedia.org/wiki/Home_Riggs_Popham", "wikipedia_page": {"main": "Rear Admiral Sir Home Riggs Popham, KCB, KCH (12 October 1762 – 20 September 1820), was a Royal Navy commander who saw service against the French during the Revolutionary and Napoleonic Wars. He is remembered for his scientific accomplishments, particularly the development of a signal code that was adopted by the Royal Navy in 1803.", "link_mentions": [{"page": "History of South America", "response": ["Between 1806 and 1807, British military forces tried to invade the area of the Rio de la Plata, at the command of Home Riggs Popham and William Carr Beresford, and John Whitelocke. The invasions were repelled, but powerfully affected the Spanish authority."]}, {"page": "Francisco de Miranda", "response": ["In 1804 with informal British help, Miranda presented a military plan to liberate the Captaincy General of Venezuela from Spanish rule. At the time, Britain was at war with Spain, an ally of Napoleon. Home Riggs Popham was commissioned by prime minister Pitt in 1805 to study the plans proposed by Miranda to the British Government, Popham then persuaded the authorities that, as the Spanish Colonies were discontented, it would be easier to promote a rising in Buenos Aires. Disappointed by this decision in November 1805, Miranda travelled to New York, where he rekindled his acquaintance with William S. Smith to organize an expedition to liberate Venezuela. Smith introduced him to merchant Samuel Ogden."]}, {"page": "Battle of Copenhagen (1807)", "response": ["* Prince of Wales 98 (flag of Admiral James Gambier, 1st Captain Sir Home Riggs Popham, 2nd Captain Adam Mackenzie)"]}, {"page": "Home Popham", "response": ["#REDIRECT Home Riggs Popham"]}, {"page": "West Gate Bridge", "response": ["On 11 March 2014, a 10 metre (33 ft) high artist-designed flag was raised on the western side of the bridge as part of the 'Melbourne Now' exhibition, On Top of the World: Flags for Melbourne. The flag was a collaborative design between four contributing artists (Brook Andrew, Helen Johnson, Kate Daw and Jon Campbell) who shared an affinity with the bridge. The flag design is a reference to 1803 maritime communications by Rear Admiral Home Riggs Popham, the symbol on the flag meaning ‘I can spare what you asked for’. The flag was flown until the end of the 'Melbourne Now' show on 25 March 2014.http://www.ngv.vic.gov.au/melbournenow/projects/007 Melbourne Now "]}, {"page": "Sir Home Riggs Popham", "response": ["#REDIRECT Home Riggs Popham"]}, {"page": "John Popham (judge)", "response": ["*Sir Francis Popham (c. 1573 – 1644), only son, and heir, MP, of Wellington, Somerset and Littlecote, Wiltshire, who married Anne Gardiner Dudley and was the father of Edward Popham (1610–1651), General-at-Sea, and of Colonel Alexander Popham (1605–1669), JP, MP, who fought for the Parliamentarians during the Civil War and had a garrison stationed at Littlecote House. Another of his descendants was Admiral Sir Home Riggs Popham (1762–1820), who developed the Signal Code adopted by the Navy in 1803."]}, {"page": "17th Lancers", "response": ["In 1806, the regiment took part in the disastrous expeditions to Spanish-controlled South America, then an ally of France during the Napoleonic Wars.Cannon, p. 48 Sir Home Riggs Popham had orchestrated an expedition against South America without the British government's sanction. This invasion failed, but a second invasion was launched. The regiment was part of this second force, under Sir Samuel Auchmuty. The British force besieged and captured Montevideo. In 1807, the regiment was part of the force, now under John Whitelocke, that tried to capture Buenos Aires, but this failed abysmally.Cannon, p. 49 The British force (including the regiment), was forced to surrender, and did not return home until January 1808.Cannon, p. 52"]}, {"page": "Santiago de Liniers, 1st Count of Buenos Aires", "response": ["The Napoleonic Wars expanded to South America. Britain gained naval supremacy over France with its victory at the battle of Trafalgar. France attacked Britain economically by imposing the Continental System, locking the continent to British trade. Needing new markets, Britain invaded Buenos Aires and Montevideo, two Spanish colonies in South America (Spain was allied to France in the war). Home Riggs Popham attempted to invade Buenos Aires, without official orders. He knew the risk: if he succeeded, Britain would honour his deed, but if he failed, he would be condemned for it.Groussac, pp. 39–41"]}, {"page": "British invasions of the River Plate", "response": ["All these proposals were discussed in 1804 by William Pitt, Lord Henry Melville, Francisco de Miranda and Sir Home Riggs Popham. Popham did not believe a complete military occupation of South America was practical but argued for taking control of key locations to allow the main objective, to open new markets for the British economy. Although there was consensus for weakening Spanish control over its South American colonies, there was no agreement as to the system and the moment to take such action. For instance, it was not even agreed whether the cities be turned into British colonies after their capture or just be made into British protectorates.Luna, p. 15-17"]}, {"page": "Charlotte (1784 ship)", "response": ["Charlotte was one of the transport vessels that were part of the expedition under General Sir David Baird and Admiral Sir Home Riggs Popham that would in 1806 capture the Dutch Cape Colony. "]}, {"page": "Ipswich (UK Parliament constituency)", "response": ["| Sir Home Riggs Popham \t"]}, {"page": "Popham numeric code", "response": ["#REDIRECT Home Riggs Popham"]}, {"page": "HMS Leda (1800)", "response": ["Leda was one of the escorts to a convoy of transports and EIC vessels that were part of the expedition under General Sir David Baird and Admiral Sir Home Riggs Popham that would in 1806 capture the Dutch Cape Colony. They would carry supplies and troops to the Cape, and then continue on their voyages."]}, {"page": "Yarmouth (Isle of Wight) (UK Parliament constituency)", "response": ["| Captain Sir Home Riggs Popham"]}, {"page": "Charles Stirling", "response": ["On 22 July 1805, Stirling took part in the Battle of Cape Finisterre under Sir Robert Calder, during which his squadron attacked the combined French and Spanish fleets off Cape Finisterre. In July 1806 he was given command of the ship  and order to convoy General Samuel Auchmuty's troops to Buenos Aires, where he would relieve Admiral Sir Home Riggs Popham, who, with troops under William Carr Beresford, had captured Buenos Aires in the first of a series of British invasions of the Río de la Plata. By the time he arrived, Buenos Aires had been retaken by the Spanish, so after relieving Popham and transferring to Popham's ship, , Stirling aided Auchmuty in a successful attack on Montevideo. He was later praised in both Houses of Parliament and in the British press for his good judgement."]}, {"page": "Battle of Blaauwberg", "response": ["The British force, under Baird, departed England at August. The squadron included 9 warships & many transport vessels under the command of Cmdre. Home Riggs Popham, assembled from two fleets out of Cork and Falmouth. Popham took the 64 gun HMS Diadem as his flagship, his warships included the 64 gun ships HMS Raisonnable and HMS Belliqueur, 50 gun HMS Diomede, 38 gun HMS Leda, 32 gun HMS Narcissus, 18 gun HMS Espoir, 14 gun HMS Encounter and HMS Protector. The Honourable East India Company ships Dutchess of Gordon, Sir William Pulteney, Europe, Streatham, Union, Comet, Northampton, Glory and William Pitt ferried the invasion force at their holds."]}, {"page": "John Goldingham", "response": ["On April 20, 1796, he married Maria Louisa Popham, niece of Admiral Sir Home Riggs Popham, at St. Mary's in Fort St. George. They had two sons. In 1815 he married Ann Baxter and they had a son and two daughters."]}, {"page": "HMS Raisonnable (1768)", "response": ["Raisonnable remained on blockade duty until sailing from Cork in late 1805 with Commodore Sir Home Riggs Popham's squadron, consisting of 9 vessels, including another of Raisonnables sister ships, , for the Cape of Good Hope. The following campaign saw British troops drive the Dutch out of Cape Town, and the subsequent peace terms handed the Cape dependencies to the British crown. In April 1806, after receiving news that the people of Buenos Aires were unhappy with Spanish rule, and would welcome the British, Popham sailed with his squadron to the Río de la Plata. Popham was replaced by Rear Admiral Murray, and following a disastrous second attempt to take Buenos Aires, Raisonnable returned to the Cape."]}, {"page": "Shaftesbury (UK Parliament constituency)", "response": ["| Captain Sir Home Riggs Popham"]}, {"page": "List of Gibraltarians", "response": ["* Rear Admiral Sir Home Riggs Popham, KCB, KCH (12 October 1762 – 20 September 1820), was a Royal Navy commander who saw service against the French during the Revolutionary and Napoleonic Wars. He is remembered for his scientific accomplishments, particularly the development of a signal code that was adopted by the Royal Navy in 1803."]}, {"page": "HMS Royal Charlotte", "response": ["* Royal Charlotte (Transport) - was at Montevideo in 1806 as part of Sir Home Riggs Popham's invasion of the Rio de la Plata.Naval Chronicle, Vol. 17, pp.79-80. She was lost during a gale on 10 March 1807.Marx (1987), p.444."]}, {"page": "Josceline Percy (Royal Navy officer)", "response": ["He moved to  sometime before 1806, for he was in that ship that year with Sir Home Riggs Popham during Cape Town's capture and was promoted from it to his first independent command came on 13 January 1806, over the brig . To reach that ship he was posted to the Dutch ship Bato, then thought to be in Simon's Bay, but - finding the Bato destroyed and that the Espoir had already sailed back to England - he had no choice but to return to the Diadem. The French 46-gun frigate Volontaire arrived in Table Bay on 4 March (not knowing the British had captured the Cape), and was seized, commissioned into the Royal Navy, and put under Percy's command, with orders to reach St Helena and head a convoy then returning to England. He also received confirmation of his two promotions of 1806, which were given the dates of 22 January and 25 September 1806 respectively. On arrival in England, he became the Tory Member of Parliament for Beer Alston, Devon (a 'pocket borough' of his father's), a role he held until 1820."]}, {"page": "Rafael de Sobremonte, 3rd Marquis of Sobremonte", "response": ["About 1,500 troops, commanded by William Carr Beresford landed from the ships commanded by Home Riggs Popham, the invasion plan's author."]}, {"page": "Flag semaphore", "response": ["Flag semaphore originated in 1866 as a handheld version of the optical telegraph system of Home Riggs Popham used on land, and its later improvement by Charles Pasley.  The land system consisted of lines of fixed stations (substantial buildings) with two large, moveable arms pivoted on an upright member.  Such a system was inconvenient to install on board a ship.  Flag semaphore provided an easy method of communicating ship-to-ship or ship-to-shore when the distances were not too great.  According to Alexander J. Field of Santa Clara University, \"there is evidence\" that Popham based his telegraph on the French coastal stations used for ship-to-shore communication.Alexander J. Field, \"French optical telegraphy, 1795–1855: Hardware, software, administration\", Technology and Culture, vol. 35, no. 2, pp. 315–347, April 1994. Many of the codepoints of flag semaphore match those of the Foy-Breguet electrical telegraph, also descended from the French optical telegraph.  Although based on the optical telegraph, by the time flag semaphore was introduced the optical telegraph had been entirely replaced by the electrical telegraph some years previously.Signals at Sea, Information sheet no 104, Library and Information Services, The National Museum: Royal Navy: Portsmouth, accessed and archived 26 October 2019."]}, {"page": "Commander-in-Chief, Africa (Royal Navy)", "response": ["*Commodore Sir Home Riggs Popham, (1806–07)"]}, {"page": "British Army during the Napoleonic Wars", "response": ["The naval commander of the expedition, Admiral Home Riggs Popham then conceived the idea of occupying the Spanish Plate River colonies. A detachment under Major General William Carr Beresford occupied Buenos Aires for six weeks, but was expelled by Spanish troops and local militias."]}]}}