{"wiki_id": "http://www.wikidata.org/entity/Q3330788", "itemLabel": "Charles Wellington Furse", "itemDescription": "English painter (1868-1904)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Wellington_Furse", "wikipedia_page": {"main": "Charles Wellington Furse  (13 January 1868 – 16 October 1904) was an English painter.He was born at Staines, the son of Jane Diana (Monsell) and the Rev. C. W. Furse, archdeacon of Westminster, and rector of St John's, Smith Square and descended collaterally from Sir Joshua Reynolds; and in his short span of life demonstrated such skill as a portrait and figure painter that he forms an important link in the chain of British portraiture which extends from the time when Van Dyck was called to the court of Charles I into the 20th century.\nHis talent was precocious; at the age of seven he gave indications of it in a number of drawings illustrating the novels of Sir Walter Scott. He attended public school at Haileybury College. He entered the Slade School in 1884, winning the Slade scholarship in the following year, and completed his education at Julian's atelier in Paris. Hard worker as he was, his activity was frequently interrupted by spells of illness, for he had developed signs of consumption whilst still attending the Slade School. An important canvas called Cain was his first contribution (1888) to the Royal Academy, to the associateship of which he was elected in the year of his death. For some years before he had been a staunch supporter of the New English Art Club, to the exhibitions of which he was a regular contributor.\nIn October 1900 he married Katharine Symonds, the daughter of John Addington Symonds. She later became known as Dame Katharine Furse. The couple had two sons, Peter Reynolds Furse (in 1901), a Royal Navy Cartographer, and John Paul Wellington Furse (in 1904), later a Rear Admiral, painter and later plant hunter.His fondness for sport and of an open-air life found expression in his art and introduced a new, fresh and vigorous note into portraiture. There is never a suggestion of the studio or of the fatiguing pose in his portraits. The sitters appear unconscious of being painted, and are generally seen in the pursuit of their favourite outdoor sport or pastime, in the full enjoyment of life. Such are the Diana of the Uplands (1903-04), the Lord Roberts (1893) and The Return from the Ride (1902) at the Tate Gallery; the four children in the Cubbing with the York and Ainsty, The Lilac Gown, Mr. and Mrs. Oliver Fishing and the portraits of Lord Charles Beresford and William Johnson Cory. His revealing portrait of a younger Charles Darling who as Mr Justice Darling was later to sit on the criminal appeal of Sir Roger Casement is in the National Portrait Gallery.\nNearly all of Furse's work shows a pronounced decorative tendency. His sense of space, composition and decorative design can best be judged by his mural decorations for Liverpool Town Hall, executed between 1899 and 1902. A memorial exhibition of Furse's paintings and sketches was held at the Burlington Fine Arts Club in 1906.\nHis granddaughter was U.S. Congresswoman Elizabeth Furse.", "link_mentions": {}}}