{"wiki_id": "http://www.wikidata.org/entity/Q334057", "itemLabel": "Henry Fawcett", "itemDescription": "British academic, statesman and economist (1833-1884)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Fawcett", "wikipedia_page": {"main": "Henry Fawcett (26 August 1833 – 6 November 1884) was a British academic, statesman and economist.", "link_mentions": [{"page": "Alfred Marshall", "response": ["Marshall returned to Cambridge, via a brief period at Balliol College, Oxford, during 1883–84, to take the seat as Professor of Political Economy in 1884 on the death of Henry Fawcett. At Cambridge he endeavoured to create a new tripos for economics, a goal which he would achieve only in 1903. Until that time, economics was taught under the Historical and Moral Sciences Triposes which failed to provide Marshall the kind of energetic and specialised students he desired."]}, {"page": "Millicent Fawcett", "response": ["left|thumb|404x404px|Millicent and Henry Fawcett", "John Stuart Mill introduced Millicent to many other women's rights activists, including Henry Fawcett, a Liberal Member of Parliament who had intended to marry her sister Elizabeth before she decided to focus on her medical career. Millicent and Henry married on 23 April 1867. Henry had been blinded in a shooting accident in 1858 and Millicent acted as his secretary. Their marriage was said to be based on \"perfect intellectual sympathy\"; Millicent pursued a writing career while caring for Henry, and ran two households, one in Cambridge, one in London. The family had some radical beliefs in support of proportional representation, individualistic and free trade principles, and opportunities for women. Their only child was Philippa Fawcett, born in 1868, who was much encouraged by her mother in her studies. In 1890 Philippa became the first woman to obtain top score in the Cambridge Mathematical Tripos exams.Caroline Series, \"And what became of the women?\", Mathematical Spectrum, Vol. 30 (1997/1998), pp. 49–52.", "*1872: Essays and Lectures on Social and Political Subjects (with Henry Fawcett) Full text online."]}, {"page": "Salisbury", "response": ["*Henry Fawcett PC (1833 in Salisbury – 1884)The University of Glasgow Story  retrieved 28 September 2017 academic, statesman and economist"]}, {"page": "Postmaster General of the United Kingdom", "response": ["| 1880–1884||Henry Fawcett"]}, {"page": "Kensal Green Cemetery", "response": ["*SOUTH FACE: Elizabeth Fry, Sarah Martin, Mary Carpenter, Benjamin Flower, Henry Fawcett, Barbara Bodichon, Maria Grey, Arnold Toynbee, W. K. Clifford, Edward T. Craig, C. Dobson Collet, Charles Bradlaugh, Richard Congreve, William Morris, John Ruskin, F. Power Cobbe, Herbert Spencer, Wathen M.W. Call, Francis Newman, Hodgson Pratt, Lydia Becker, Josephine Butler, Anna Swanwick, C. Jacob Holyoake, J. Kells Ingram"]}, {"page": "Post Office Ltd", "response": ["Post Office savings stamps were first introduced by Henry Fawcett in the 1880s but were phased out in the 1960s. These were re-introduced in August 2004 because of consumer demand. In 2010 saving stamps were withdrawn and replaced by the Budget Card."]}, {"page": "Philippa Fawcett", "response": ["Philippa Garrett Fawcett was born on 4 April 1868, the daughter of the suffragist Millicent Fawcett (née Garrett) and Henry Fawcett MP, Professor of Political Economy at Cambridge and Postmaster General in Gladstone's government. Her aunt was Elizabeth Garrett Anderson, the first English female doctor. When her father died, she and her mother went to live with Millicent's sister Agnes Garrett, who had set up an interior design business on Gower Street, Bloomsbury."]}, {"page": "List of Privy Counsellors (1837–1901)", "response": ["*Henry Fawcett (1833–1884)"]}, {"page": "Henry Moor", "response": ["Four years later a further by-election was held when Brighton's other MP, William Coningham, resigned. Moor was again a candidate, and although supported by the Conservative Party declared himself to be going forward on \"independent principles\" and claimed to be \"bound by no party and no political club\". Moor described himself as a \"Liberal Conservative\" and found himself facing no fewer than three Liberal candidates and one independent. Benefitting from this split vote, Moor was  duly elected with a majority of 181 votes over his nearest rival, Henry Fawcett.", "His time in the House of Commons was to be brief. A general election was held in 1865, and Moor was one of three candidates seeking the two Brighton seats. The two other candidates were the sitting MP James White and his opponent of the previous year, Henry Fawcett. Moor was defeated, winning 2,134 votes with White securing 3,065 and Fawcett 2,665. He made an attempt to regain the seat at the 1868 general election, but failed to be elected, coming last of six candidates."]}, {"page": "Edward John Eyre", "response": ["These events created great controversy in Britain, resulting in demands for Eyre to be arrested and tried for murdering Gordon. John Stuart Mill organised the Jamaica Committee, which demanded his prosecution and included some well-known British liberal intellectuals such as John Bright, Charles Darwin, Frederic Harrison, Thomas Hughes, Thomas Henry Huxley, Herbert Spencer and A. V. Dicey. Other notable members of the committee included Charles Buxton, Edmond Beales, Leslie Stephen, James Fitzjames Stephen, Edward Frankland, Thomas Hill Green, Frederick Chesson, Goldwin Smith, Charles Lyell and Henry Fawcett."]}, {"page": "Professor of Political Economy (Cambridge)", "response": ["* Henry Fawcett (1863)"]}, {"page": "Morant Bay rebellion", "response": ["Opponents of Eyre established the Jamaica Committee in December 1865, which called for Eyre to be tried for mass murder. More radical members of the Committee wanted him tried for the murder of British subjects, such as George William Gordon, under the rule of law, stating that Eyre's actions taken under the aegis of martial law were illegal. The Committee leaders included the MPs John Bright, Charles Buxton, and Peter Taylor, as well as the scholars Charles Darwin, Thomas Henry Huxley, and Goldwin Smith.  Other supporters included T. H. Green, Henry Fawcett, and A. V. Dicey."]}, {"page": "Alfred Gilbert", "response": ["Having returned to England, Gilbert took a studio in a complex off Fulham Road, where he built a foundry with Thomas Stirling Lee and Edward Onslow Ford. His next major work was again an innovation in terms of size: The Fawcett memorial (1885–87) featured a bronze bust of politician Henry Fawcett above seven small detailed figures of around fifteen inches, which individually represented Fawcett's virtues. The memorial received praise from critics when it was unveiled at Westminster Abbey on 29 January 1887. By then Gilbert had been commissioned to produce another memorial, this time for Golden Jubilee of Queen Victoria, which was placed in the Great Hall at Winchester Castle. From the late 1880s to the mid-1890s he was in his most creative period. He diversified into goldsmithing and damascening, making an epergne (1887–1890) given to Queen Victoria by officers of the British Army and a chain for the mayor of Preston (1888–1892). Gilbert produced medals, such as the cast bronze portrait of Matthew Ridley Corbet (1881) and the struck bronze medal marking 50 years of the Art Union of London (1887). He also created spoons, cups, dishes and jewellery; many of his designs can be seen in the collection of Stichting van Caloen on display at Loppem Castle. Marion Spielmann, a contemporary art critic, wrote in 1901 \"his taste is so pure, his genius so exquisitely right, that he may give full rein to his fancy without danger where another man would run riot and come to grief\"."]}, {"page": "Robert Hunter (civil servant)", "response": ["A leading member of the Commons Preservation Society during this period was the Liberal politician Henry Fawcett. He was appointed Postmaster General by Gladstone in 1880. When the post of solicitor to the General Post Office (GPO) became vacant in 1881 Fawcett decided that Hunter would be the best choice for the position. Hunter's fitness for the post was confirmed by independent advisers and he was appointed on 1 February 1882. Fawcett later said that nothing in his official career had given him more satisfaction than securing a man of Hunter's character and ability for the service of the nation."]}, {"page": "Michael Davitt", "response": ["Davitt's views on land reform were based on a pre-capitalist understanding of access to land for subsistence farming to be a human right that superseded property rights, the so-called \"unwritten law\". He believed that the landlord system was feudal in nature and had been imposed on Ireland by the British. His ideas were also heavily shaped by his association with Henry George, and he cited thinkers such as Herbert Spencer, Henry Fawcett and Bonamy Price in his writings advocating radical land reform. Davitt came to agree with George that tenancy reform would not achieve \"land for the people\". In addition, even peasant proprietorship would fall short of this goal. Davitt foresaw that public funds spent on land purchases would never benefit landless labourers, and believed that the resulting smallholdings would eventually be consolidated into estates. Instead, from 1882, Davitt advocated for compulsory land nationalisation with compensation for current owners, so that all ground rent could be reclaimed by the state and used on public projects to benefit all citizens. According to Marxist historian Peter Linebaugh, Davitt's ideas inspired James Connolly's \"Celtic communism\"."]}, {"page": "Rector of the University of Glasgow", "response": ["|1883–1884 || Henry Fawcett|| || economist and parliamentarian"]}, {"page": "More Letters of Charles Darwin", "response": ["* Henry Fawcett"]}, {"page": "Edward Linley Sambourne", "response": ["Henry Fawcett, "]}, {"page": "Second Gladstone ministry", "response": ["| Henry Fawcett"]}, {"page": "John Lowther du Plat Taylor", "response": ["He proposed at his regiment's 1872 annual prize giving the formation of a reservist Telegraph and Postal CorpsDaily News (London, England), Thursday, 30 May 1872 and in 1877 the War Office established a committee  \"to consider the formation of a Corps for the performance of Postal Duties in the Field\".Public Records Office WO/33/30 The War Office rejected the committee's recommendation that such an organisation should be formed, reasoning that it would be too expensive.   However, in mid July 1882 du Plat Taylor was authorised by the Postmaster General, Henry Fawcett and the Secretary of State for War, Hugh Childers to organise an Army Post Office Corps (APOC), and on Saturday 22 July 1882 Queen Victoria issued a Royal Warrant to that effect."]}, {"page": "T. Madhava Rao", "response": ["Madhava Rao was respected and regarded for his administrative abilities. British Liberal statesman Henry Fawcett called him \"the Turgot of India\". In 1866, he was made a Knight Commander of the Order of the Star of India.", "However, due to misunderstandings which arose between the Dewan and the Maharajah, Madhava Rao retired in February 1872. Indian Magazine and Review, Issues 241-252 By National Indian Association in Aid of Social Progress and Education in India., 1891 - Education , Page 310 The Maharajah, however, respected his work and granted him a pension of Rs. 1000, a princely amount in those days. His initial plan was to retire to Madras but instead there was great demand for his services among the Princes of India, because of his having secured for Travancore the appellation of \"Model State of India\" by the British Government. Henry Fawcett described, on hearing of his retirement in 1872, Madhava Rao as:"]}, {"page": "Jamaica Committee", "response": ["Other prominent members of the committee included Charles Buxton, Frederic Harrison, Edmond Beales,  Frederick Chesson, Leslie Stephen, Thomas Hill Green, Henry Fawcett, Goldwin Smith, Charles Lyell and Edward Frankland."]}, {"page": "1833 in the United Kingdom", "response": ["* 26 August – Henry Fawcett, statesman, economist and Postmaster General (d. 1884)"]}, {"page": "Irish University Bill", "response": ["The abolition of the Anglican test oath for Dublin University and Trinity College, except in the School of Divinity, was effected by the University of Dublin Tests Act, 1873 (An Act to abolish Tests in Trinity College and the University of Dublin; 36 & 37 Victoria, c. 22) introduced by Henry Fawcett and hence called \"Fawcett's Act\".  Until 1970, the Irish Catholic hierarchy discouraged Catholics from attending the university. Under the Disraeli administration, the University Education (Ireland) Act 1879 altered the Queen's University of Ireland into the Royal University of Ireland and facilitated access to it for the Catholic and Presbyterian colleges. Trinity College and Dublin University were not affected."]}, {"page": "Hackney (UK Parliament constituency)", "response": ["|Henry Fawcett || Liberal"]}, {"page": "Trumpington", "response": ["The church is the resting place of Henry Fawcett, the blind academic and politician who, as Postmaster General (1880–84), introduced parcel post, postal orders and other innovations. The primary school is named Fawcett School after him."]}, {"page": "Lawrence Goldman", "response": ["* The blind Victorian: Henry Fawcett and British liberalism (Cambridge: Cambridge University Press, 1989)", "* Henry Fawcett (1833–1884)"]}, {"page": "Constance Jones", "response": ["She was coached for the entrance examination for Girton College, Cambridge by Miss Alice Grüner, a former student of Newnham at her home in Sydenham, Kent. She went up to Girton in 1875Girton College Register, 1869–1946: Cambridge; CUP; 1948 where, prompted by having read Henry Fawcett's Political Economy (1863) and Mill's Logic (1843), she chose the Moral Sciences Tripos. However, she almost immediately had to withdraw in order to look after the aunt with whom she then lived. Her undergraduate career was considerably interrupted because the education of her younger brothers took precedence over her own, but despite this in 1880 she was awarded a first class in the Moral Sciences Tripos."]}, {"page": "David Blunkett", "response": ["Following Labour's landslide victory in the 1997 general election, he became Secretary of State for Education and Employment, thus becoming Britain's first blind cabinet minister (Henry Fawcett, husband of suffragist Millicent Fawcett, had been a member of the Privy Council, of which the Cabinet is the executive committee, more than a century before). The role of Education Secretary was a vital one in a government whose prime minister had in 1996 described his priorities as \"education, education, education\" and which had made reductions in school class sizes a pledge."]}, {"page": "King's College School", "response": ["*Henry Fawcett, (1833–1884) blind British economist, statesman, academic and campaigner for women's suffrage."]}, {"page": "Political Economy Club", "response": ["David Ricardo, Thomas Malthus, James Mill, Colonel Thomas Moody, Kt., Robert Torrens, Thomas Tooke, John Stuart Mill, John Ramsey McCulloch, Nassau Senior, John Elliott Cairnes, Henry Fawcett, William Newmarch, Samuel Jones-Loyd, 1st Baron Overstone, Jane Marcet, George Warde Norman, William Blake, Walter Coulson, George Pryme, George R. Porter, William T. Thornton, Walter Bagehot, and Jean-Baptiste Say."]}, {"page": "Brighton (UK Parliament constituency)", "response": ["| Henry Fawcett"]}, {"page": "List of names in A Biographical Dictionary of Modern Rationalists", "response": ["* Henry Fawcett"]}, {"page": "1884 in the United Kingdom", "response": ["** Henry Fawcett, statesman, economist and Postmaster General (born 1833)"]}]}}