{"wiki_id": "http://www.wikidata.org/entity/Q334491", "itemLabel": "Tim Boswell", "itemDescription": "British politician (born 1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Boswell", "wikipedia_page": {"main": "Timothy Eric Boswell, Baron Boswell of Aynho  (born 2 December 1942) is a British politician who was formerly the Conservative Member of Parliament (MP) for Daventry from 1987 until he stood down at the 2010 general election, after which he was raised to the House of Lords as a Conservative life peer.\n\n", "link_mentions": [{"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Tim Boswell", "| Tim Boswell"]}, {"page": "University Challenge", "response": ["*Tim Boswell – New College, Oxford"]}, {"page": "List of barons in the peerages of Britain and Ireland", "response": ["#*Tim Boswell, Baron Boswell of Aynho"]}, {"page": "Timothy Eric Boswell", "response": ["#REDIRECT Tim Boswell"]}, {"page": "Timothy Boswell", "response": ["#REDIRECT Tim Boswell"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Tim Boswell"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Tim Boswell"]}, {"page": "List of political families in the United Kingdom", "response": ["*Tim Boswell (1942–), Conservative MP 1987–2010."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Tim Boswell"]}, {"page": "List of United Kingdom MPs: B", "response": ["* Tim Boswell (1987–2010)"]}, {"page": "Gender Recognition Act 2004", "response": ["Support for the bill in the House of Commons was split broadly down party lines. At both the second and third readings (i.e. before and after amendments), all Labour Party, Liberal Democrat, Plaid Cymru and Scottish National Party votes were in favour of the bill; all Ulster Unionist and Democratic Unionist Party votes were against. Conservative Party MPs were split on the issue, and the party leadership did not issue a whip mandating MPs to take a particular stance on the bill, instead allowing its MPs a free vote. 25 Conservative MPs voted in favour and 22 against the bill at its second reading, and 20 voted in favour and 39 voted against the bill at its third reading. Less than half of the Conservative Party's 166 MPs participated in either vote. Among those who voted against the bill were Ann Widdecombe (who opposed it on religious grounds), Dominic Grieve, Peter Lilley and Andrew Robathan. Among Conservative MPs who supported the bill were Kenneth Clarke, Constitutional Affairs spokesman Tim Boswell, and future speaker John Bercow."]}, {"page": "University of Derby", "response": ["In January 1994, Britannia MillBritannia Mill, Derby.ac.uk, 2008 (a renovated mill) opened, at a cost of £10M. On 4 March 1994, the B block (business and management subjects, which lies north of the East Tower) was opened by the Conservative MP, Tim Boswell."]}, {"page": "Chris Heaton-Harris", "response": ["Chris Heaton-Harris was a member of the Conservative A-List and was selected to succeed Tim Boswell as candidate for the safe Conservative constituency of Daventry in June 2006. He won the seat at the 2010 general election with a majority of 19,188."]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Daventry || Tim Boswell || Conservative || Tim Boswell || Conservative"]}, {"page": "Daventry (UK Parliament constituency)", "response": ["| Tim Boswell"]}, {"page": "Milton Malsor", "response": ["The Member of Parliament from 2010 is Chris Heaton-Harris, Conservative, for the Daventry Parliamentary Constituency. Prior to the 2010 General Election the village was in Northampton South Parliamentary Constituency. Initially the Boundary Commission wanted to move the village into the new parliamentary constituency of South Northamptonshire. However, as this was inconvenient for election administration purposes, the Boundary Commission put Milton with fellow ward villages in South Northants Council's \"Harpole and Grange\" ward into the Daventry Constituency previously held Tim Boswell who stood down at 2010 General Election."]}, {"page": "1942 in the United Kingdom", "response": ["** Tim Boswell, farmer and politician"]}, {"page": "List of Old Marlburians", "response": ["* Tim Boswell, MP for Daventry"]}, {"page": "List of University of Oxford people in British public life", "response": ["| Tim Boswell"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Tim Boswell; MP for Daventry (1987–2010)"]}, {"page": "Boswell (surname)", "response": ["*Tim Boswell (born 1942), British politician"]}, {"page": "Innovation, Universities, Science and Skills Select Committee", "response": ["| Tim Boswell MP"]}, {"page": "List of New College, Oxford people", "response": ["*Tim Boswell, former Conservative MP"]}, {"page": "List of Lords Commissioners of the Treasury", "response": ["**Tim Boswell"]}, {"page": "Institute for Learning", "response": ["IfL has the support of six patrons, the first four patrons: Baroness Sharp of Guildford, formerly a Liberal Democrat spokesperson for further and higher education; Barry Sheerman, member of parliament for Huddersfield and former chair of the education select committee; Tim Boswell, former member of the innovation, universities, science and skills select committee; and Stella Mbubaegbu CBE, principal and chief executive of Highbury College Portsmouth were announced on 30 March 2011."]}, {"page": "List of MPs who stood down at the 2010 United Kingdom general election", "response": ["# Tim Boswell — Daventry, announced 31 March 2006"]}]}}