{"wiki_id": "http://www.wikidata.org/entity/Q334258", "itemLabel": "Alastair Goodlad", "itemDescription": "British Conservative politician (born 1943)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alastair_Goodlad", "wikipedia_page": {"main": "Alastair Robertson Goodlad, Baron Goodlad  (born 4 July 1943) is a British politician who served as Chief Whip of the House of Commons from 1995 to 1997 and British High Commissioner to Australia from 2000 to 2005. A member of the Conservative Party, he was Member of Parliament (MP) for Eddisbury, formerly Northwich, from February 1974 to 1999.", "link_mentions": [{"page": "John Major", "response": ["Although many Conservative MPs wanted Major to resign as leader immediately because of the election loss, there was a movement among the grassroots of the party, encouraged by his political allies, to have him stay on as leader until the autumn. Lord Cranborne, his chief of staff during the election, and the chief whip, Alastair Goodlad, both pleaded with him to stay on: they argued that remaining as leader for a few months would give the party time to come to terms with the scale of defeat before electing a successor. Major refused, saying: \"It would be terrible, because I would be presiding with no authority over a number of candidates fighting for the crown. It would merely prolong the agony.\""]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Alastair Goodlad"]}, {"page": "Stephen O'Brien", "response": ["He was formerly a  Member of the United Kingdom Parliament (MP), representing Eddisbury. He was first elected in a by-election in July 1999, after Alastair Goodlad was made British High Commissioner in Australia by Tony Blair and thus had to leave Parliament. A member of the Conservative Party, within the Conservative-Liberal Democrat Coalition he was appointed as the Parliamentary Undersecretary of State in the Department for International Development. In September 2013 he became the Prime Minister's Envoy to the Sahel, encompassing nine countries across North and West Africa."]}, {"page": "Edward Garnier", "response": ["In the House of Commons, he served on the home affairs select committee from 1992 until he was appointed as the Parliamentary Private Secretary (PPS) to the Minister of State at the Foreign and Commonwealth Office Alastair Goodlad and David Davis for a year in 1994. In 1996 he became the PPS to the Attorney General Nicholas Lyell and in 1997 he was briefly the PPS to the Chancellor of the Duchy of Lancaster Roger Freeman. He joined the frontbench under William Hague as a spokesman on the Lord Chancellor's Department in 1997 and entered the Shadow Cabinet in 1999 as the Shadow Attorney General, according to a BBC News report\"earning wide acclaim for a thoughtful performance in that role, in which he demonstrated his legal expertise without becomingly excessively partisan\". He returned to the backbenches after the 2001 general election but became Opposition Spokesman for Home Affairs after the 2005 general election and later Shadow Attorney General."]}, {"page": "Alastair Goodland", "response": ["#REDIRECT Alastair Goodlad"]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Alastair Goodlad"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Alastair Goodlad"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|Alastair Goodlad"]}, {"page": "List of MPs elected in the October 1974 United Kingdom general election", "response": ["|Alastair Goodlad"]}, {"page": "Alastair Robertson Goodlad", "response": ["#REDIRECT Alastair Goodlad"]}]}}