{"wiki_id": "http://www.wikidata.org/entity/Q334633", "itemLabel": "Robert Bontine Cunninghame Graham", "itemDescription": "British politician (1852-1936)", "wikipedia_url": "https://en.wikipedia.org/wiki/Cunninghame_Graham", "wikipedia_page": {"main": "Robert Bontine Cunninghame Graham (24 May 1852 – 20 March 1936) was a Scottish politician, writer, journalist and adventurer. He was a Liberal Party Member of Parliament (MP); the first ever socialist member of the Parliament of the United Kingdom; a founder, and the first president, of the Scottish Labour Party; a founder of the National Party of Scotland in 1928; and the first president of the Scottish National Party in 1934.", "link_mentions": [{"page": "Scottish National Party", "response": ["* James Graham, 6th Duke of Montrose and Robert Bontine Cunninghame Graham (joint), 1934–1936 "]}, {"page": "National Party of Scotland", "response": ["The NPS was formed in 1928 after John MacCormick of the Glasgow University Scottish Nationalist Association called a meeting of all those favouring the establishment of a party favouring Scottish Home Rule. The meeting was presided over by Robert Bontine Cunninghame Graham, who had been a Liberal Party, then Scottish Labour Party politician.  The NPS was formed by the amalgamation of GUSNA with the Scots National League, Lewis Spence's Scots National Movement and the Scottish Home Rule Movement. On 23 June an inauguration took place in Stirling."]}, {"page": "Scottish Labour Party (1888)", "response": ["The Scottish Labour Party (SLP), also known as the Scottish Parliamentary Labour Party, was formed by Robert Bontine Cunninghame Graham, the first socialist MP in the Parliament of the United Kingdom, who later went on to become the first president of the Scottish National Party, and Keir Hardie, who later became the first leader of the Independent Labour Party."]}, {"page": "Nostromo", "response": ["* As the travel writer John Gimlette points out in his At the Tomb of the Inflatable Pig: Travels through Paraguay (2003), there are many striking similarities to Paraguay and its tortured 19th century history of despotism, war, and revolution: \"Conrad, meanwhile, was absorbing the Paraguayan story. His nightmarish political novel, Nostromo, emerged in 1904. It is Paraguay, seen through the prisms of his great friend's [Robert Bontine Cunninghame Graham] anger--Napoleonic dictators and a Great Conspiracy. There is even 'a barefoot army of scarecrows' and a priest who becomes the state torturer.\" Graham having an obsession with Paraguay, arriving there in 1873, and a writer of many books on it. In addition, the Paraguayan politician, journalist and political philosopher, Jose Segundo Decoud, was the great man of Paraguay in the late 19th century who never became president, even if his thoughts animated the ruling Colorado Party and its presidents."]}, {"page": "Robert Graham", "response": ["*Robert Bontine Cunninghame Graham (1852–1936), Scottish politician, writer, journalist and adventurer"]}]}}