{"wiki_id": "http://www.wikidata.org/entity/Q334325", "itemLabel": "Austin Mitchell", "itemDescription": "British politician (born 1934)", "wikipedia_url": "https://en.wikipedia.org/wiki/Austin_Mitchell", "wikipedia_page": {"main": "Austin Vernon Mitchell  (19 September 1934 – 18 August 2021) was a British academic, journalist and Labour Party politician who was the member of Parliament (MP) for Great Grimsby from a 1977 by-election to 2015. He was also the chair of the Labour Euro-Safeguards Campaign.\n\n", "link_mentions": [{"page": "Cottingley Fairies", "response": ["Elsie and Frances were interviewed by journalist Austin Mitchell in September 1976, for a programme broadcast on Yorkshire Television. When pressed, both women agreed that \"a rational person doesn't see fairies\", but they denied having fabricated the photographs. In 1978 the magician and scientific sceptic James Randi and a team from the Committee for the Scientific Investigation of Claims of the Paranormal examined the photographs, using a \"computer enhancement process\". They concluded that the photographs were fakes, and that strings could be seen supporting the fairies. Geoffrey Crawley, editor of the British Journal of Photography, undertook a \"major scientific investigation of the photographs and the events surrounding them\", published between 1982 and 1983, \"the first major postwar analysis of the affair\". He also concluded that the pictures were fakes."]}, {"page": "Euroscepticism", "response": ["Although often associated with being a cause on the right in the twenty-first century with the contemporary Labour Party supporting EU membership, there have been notable Eurosceptic politicians on the left of British politics, such as former Labour cabinet minister Tony Benn who held a longstanding opposition to British membership of the EU throughout his career. Other Labour MPs who have supported eurosceptic sentiments and British withdrawal have included Kate Hoey, Frank Field, Graham Stringer, Ian Austin, Tom Harris, Gisela Stuart and Austin Mitchell. Other figures on the left have included George Galloway and socialist politician and trade unionist Arthur Scargill who both endorsed Britain's exit from the European Union."]}, {"page": "September 19", "response": ["*  1934   – Austin Mitchell, English academic and politician"]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Austin Mitchell", "| Austin Mitchell"]}, {"page": "Wetherby", "response": ["The town's main Working Men's Club, Wetherby and District Social Club is based on the Sandbeck Industrial Estate, opened by former MP Austin Mitchell in the early 70s. This burnt down in 2002. A new club was rebuilt in its original location. In 2018, the social club closed and was taken over by new owners and opened as a pub and community space called ‘The Wetherby’. This closed during the COVID outbreak of 2020, and remains so as of 2021."]}, {"page": "Ossett", "response": ["* From Austin Mitchell's Talkin' Yorkshire (page 48):"]}, {"page": "Baildon", "response": ["and Austin Mitchell, Labour Member of Parliament (MP) for Great Grimsby from 1977 until 2015, was born in Baildon. The former wool merchant and RAF Officer, was born in Baildon in 1904."]}, {"page": "Brian Clough", "response": ["On the evening of his dismissal, Clough discussed his short reign at Elland Road with Yorkshire Television's Calendar. The programme also brought Revie into the studio where, in a live broadcast, the two ex-managers spent as much time debating management practice with each other as with the host Austin Mitchell. Describing this televised interview as the culmination of the bitter rivalry between the two men, journalist Roger Hermiston stated: \"It was like watching a bickering couple about to get a divorce....\""]}, {"page": "Culture of New Zealand", "response": ["New Zealand's most successful early writers were expatriates such as Katherine Mansfield. From the 1950s, Frank Sargeson, Janet Frame and others had (non lucrative) writing careers while still living in New Zealand. Until about the 1980s, the main New Zealand literary form was the short story, but in recent decades novels such as Alan Duff's Once Were Warriors, Elizabeth Knox's The Vintner's Luck and others have achieved critical and popular success. Māori culture is traditionally oral rather than literate, but in recent years Māori novelists such as Duff, Witi Ihimaera and Keri Hulme and poets such as Hone Tuwhare have shown their mastery of literary forms. Austin Mitchell wrote two \"Pavlova Paradise\" books about New Zealand. Barry Crump was a popular author who embodied and expounded the myth of the Kiwi larrikin and multi-skilled labourer. Sam Hunt and Gary McCormick are well-known poets. James K Baxter was an eccentric but admired author. Maurice Gee is also a household name for his novels about New Zealand life."]}, {"page": "John Prescott", "response": ["On 7 May 2006, The Sunday Times quoted Linda McDougall, wife of Austin Mitchell, as saying that in 1978 Prescott had pushed her \"quite forcefully\" against a wall and put his hand up her skirt as she opened the door for him to a meeting in her own house just after her husband became an MP; Prescott had not previously met her."]}, {"page": "Grimsby", "response": ["Since the December 2019 general election, Lia Nici (Conservative) has been the Member of Parliament for the Great Grimsby constituency, having won the seat from the former MP, Melanie Onn (Labour), who had served since 2015. This lost the seat to the Labour Party for the first time in 74 years, not least under Austin Mitchell (Labour), who held it from 1977 to 2015"]}, {"page": "Socialist Campaign Group", "response": ["* Austin Mitchell (2015)"]}, {"page": "Austin Vernon Mitchell", "response": ["#redirect Austin Mitchell"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Austin Mitchell"]}, {"page": "Mark Oaten", "response": ["In February 2010 Channel 4 broadcast a four-part series called Tower Block of Commons in which four MPs lived with on different council estates in England. Taking part alongside Oaten were Tim Loughton, Austin Mitchell and Nadine Dorries."]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Austin Mitchell"]}, {"page": "Nick Palmer", "response": ["Based on his experience as a computer software developer, he spoke against the terms of the Digital Economy Bill and joined Tom Watson and Austin Mitchell in leading a Labour rebellion against its third reading."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Austin Mitchell"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Austin Mitchell"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|Austin Mitchell"]}, {"page": "List of Have I Got News for You episodes", "response": ["|Austin Mitchell MP"]}, {"page": "Peter Hitchens", "response": ["A regular on British radio and television, Hitchens has been on Question Time, Any Questions?, This Week, The Daily Politics and The Big Questions. He has authored and presented several documentaries on Channel 4, including critical examinations of Nelson Mandela and David Cameron. In the late 1990s, Hitchens co-presented a programme on Talk Radio UK with Derek Draper and Austin Mitchell."]}, {"page": "The Freedom Association", "response": ["In April 2006 TFA launched Better Off Out - a campaign for the UK to leave the EU. This has attracted the support of one Labour, one UKIP and twelve Tory MPs, plus a number of MEPs, Peers, academics, journalists and influential business figures. It was officially launched in Parliament by Philip Davies, despite criticism from Conservative party leader David Cameron. Signatories to the campaign include Daniel Hannan, Douglas Carswell, Philip Hollobone, Jeffrey Donaldson, David Nuttall, Austin Mitchell, David Campbell-Bannerman, Nigel Farage, Gerard Batten, Roger Helmer, and Patrick Minford."]}]}}