{"wiki_id": "http://www.wikidata.org/entity/Q334614", "itemLabel": "Richard Monckton Milnes, 1st Baron Houghton", "itemDescription": "British politician and poet (1809-1885)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Monckton_Milnes,_1st_Baron_Houghton", "wikipedia_page": {"main": "Richard Monckton Milnes, 1st Baron Houghton, FRS (19 June 1809 – 11 August 1885) was an English poet, patron of literature and a politician who strongly supported social justice.\n\n", "link_mentions": [{"page": "1885 in literature", "response": ["*August 11 – Richard Monckton Milnes, 1st Baron Houghton, English man of letters, poet and politician (born 1809)"]}, {"page": "Sadism and masochism in fiction", "response": ["*The Rodiad (1871), a pornographic poem on the subject of flagellation, falsely attributed to George Colman the Younger: probably by Richard Monckton Milnes, 1st Baron Houghton."]}, {"page": "George Colman the Younger", "response": ["After his death, Colman was falsely stated to have been the author of certain pornographic works.  The Rodiad, on flagellation, was published by John Camden Hotten in 1871, falsely dated to 1810 and ascribed to Colman; the true author seems to have been Richard Monckton Milnes, 1st Baron Houghton.  Canadian author John Glassco maintained and extended the hoax in 1967 by repeating the attribution and also claiming that his own Squire Hardman had been written by Colman."]}, {"page": "Richard Monckton Milnes, 1st baron Houghton", "response": ["#REDIRECT Richard Monckton Milnes, 1st Baron Houghton"]}, {"page": "Richard Monckton Milnes", "response": ["#REDIRECT Richard Monckton Milnes, 1st Baron Houghton"]}, {"page": "Robert Crewe-Milnes, 1st Marquess of Crewe", "response": ["Robert Offley Ashburton Milnes was born at 16 Upper Brook Street, Mayfair, London, the only son of Richard Monckton Milnes, 1st Baron Houghton, by his wife the Hon. Annabella Crewe, daughter of John Crewe, 2nd Baron Crewe, and was educated firstly at Winton House, near Winchester, and then Harrow.  He went up to Trinity College, Cambridge, graduating in 1880."]}, {"page": "Milnes", "response": ["* Richard Monckton Milnes, 1st Baron Houghton, English poet and politician"]}, {"page": "Marquess of Crewe", "response": ["*Richard Monckton Milnes, 1st Baron Houghton (1809–1885)"]}]}}