{"wiki_id": "http://www.wikidata.org/entity/Q334307", "itemLabel": "Seán Etchingham", "itemDescription": "Irish politician (1870-1923)", "wikipedia_url": "https://en.wikipedia.org/wiki/Se%C3%A1n_Etchingham", "wikipedia_page": {"main": "Seán Redmond Etchingham (27 March 1868 – 23 April 1923) was an Irish Sinn Féin politician.He was born in the townland of Ballintray, Courtown, County Wexford, one of five children of John Etchingham, described as a coachman, servant or butler, and Elizabeth (Bessie) Redmond, both of whom were also from County Wexford. Like two of his siblings, his surname was recorded as Hutchingham in the birth register, although the family is referred to as Etchingham in most official documents.\nIn 1901, he was living in Church Lane, Gorey, where he was employed as a horse trainer. By 1911, he was back in Courtown, where he gave his profession as journalist in the census of that year.He became a member of the Irish Volunteers, Sinn Féin, the Gaelic League and the Irish Republican Brotherhood (IRB).\nHe was jailed in 1916 for his part in the Enniscorthy raid to seize the railway and to prevent reinforcements reaching Dublin to put down the Easter Rising. When the Dublin rising failed, Etchingham surrendered and was arrested, but released in the amnesty of 1917.He was first elected as a Sinn Féin candidate for Wicklow East at the 1918 general election. As with the other Sinn Féin MPs, he did not take his seat in the British House of Commons, sitting instead in the revolutionary First Dáil, which met in the Mansion House, Dublin in January 1919.\nHe was later appointed to the government as Secretary for Fisheries. He was returned unopposed in the 1921 general election and opposed the Anglo-Irish Treaty in the Dáil debates and again at the Volunteer Executive. He lost his Dáil seat in the 1922 election. He was jailed in 1923 during the Irish Civil War and died in prison from natural causes later that year.\n\n", "link_mentions": [{"page": "Easter Rising", "response": ["In County Wexford, 100–200 Volunteers—led by Robert Brennan, Séamus Doyle and Seán Etchingham—took over the town of Enniscorthy on Thursday 27 April until Sunday.Boyle, John F. The Irish Rebellion of 1916: a brief history of the revolt and its suppression  (Chapter IV: Outbreaks in the Country). BiblioBazaar, 2009. pp. 127–152 Volunteer officer Paul Galligan had cycled 200 km from rebel headquarters in Dublin with orders to mobilise.Dorney, John. The Easter Rising in County Wexford . The Irish Story. 10 April 2012. They blocked all roads into the town and made a brief attack on the RIC barracks, but chose to blockade it rather than attempt to capture it. They flew the tricolour over the Athenaeum building, which they had made their headquarters, and paraded uniformed in the streets.Townshend, p. 241 They also occupied Vinegar Hill, where the United Irishmen had made a last stand in the 1798 rebellion. The public largely supported the rebels and many local men offered to join them."]}, {"page": "Government of the 2nd Dáil", "response": ["|Seán Etchingham"]}, {"page": "Government of the 1st Dáil", "response": ["|Seán Etchingham"]}, {"page": "Minister for the Environment, Climate and Communications", "response": ["|Seán Etchingham", "|Seán Etchingham"]}, {"page": "1923 in Ireland", "response": ["*23 April – Seán Etchingham, Sinn Féin politician, member of 1st Dáil, Cabinet Minister."]}, {"page": "East Wicklow (UK Parliament constituency)", "response": ["| Seán Etchingham"]}, {"page": "List of Sinn Féin MPs", "response": ["| Seán Etchingham"]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["|Seán Etchingham"]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["|||Seán Etchingham||1868||1923 (Died of sickness in prison under Irish Free State)||Political detainee during Irish Civil War||Wicklow East (1918–22 but did not sit)||Sinn Féin; also Irish Teachta Dála and Secretary for Fisheries in Free State government."]}, {"page": "Anglo-Irish Treaty Dáil vote", "response": ["|Seán Etchingham"]}, {"page": "Sean Etchingham", "response": ["#REDIRECT Seán Etchingham "]}, {"page": "County Wexford (1914–23)", "response": ["In 1916, a small rising occurred at EnniscorthySee: Furlong and Hayes, pp 46 – 70. on cue with that at Dublin. On Thursday, 27 April 1916, Enniscorthy town was taken over by about 600 armed patriots,”[British] Commanding Officer's Report – G.A. French, 2 May 1916\", in  Furlong and Hayes, p 61. almost without opposition in a surprise attack. They were led by Robert Brennan (journalist) (1881–1964). The rebels consisted primarily of Irish Volunteers, supplemented by members of Fianna Éireann and Cumann na mBan. Seamus Doyle and Seán Etchingham were next in command. The patriots made the Athenaeum Theatre, near Enniscorthy Castle, their headquarters, taking over the town and blocking the roads and the railway line. They surrounded the R.I.C. barracks and though shots were fired, no real attempt was made to take the barracks. Meanwhile, a force under Paul Galligan occupied the town of Ferns and some northern parts of the county. The British responded by sending a force of more than 1,000 men to retake Enniscorthy, under the command of G.A. French.George Arthur French (d. 1950) was a Co. Wexford native, who lived at Newbay House near Wexford town after his marriage in 1899. The fact that he was from Co. Wexford seems to have been a big influence in resolving the situation at Enniscorthy without bloodshed. On Saturday, 29 April 1916, news of the general surrender in Dublin reached Enniscorthy. The rebels refused to believe it. They refused the demand to surrender and required also that the Dublin surrender be confirmed to them. They would only surrender if ordered to do so by Patrick Pearse.Furlong and Hayes, p. 46. The next day, 30 April 1916, the British escorted two patriots, Seamus Doyle and Seán R. Etchingham, to Dublin to consult Pearse in Arbor Hill Prison. The order to surrender was obtained. On Monday, 1 May 1916, the Enniscorthy patriots surrendered unconditionally. There had been no fatalities and relatively little damage to property. Some of the leaders, including Robert Brennan, were sentenced to death, but all had their sentences commuted. Furlong and Hayes state that \"270 were arrested, of whom 150 were interned at Frongoch in north Wales\". Frongoch internment camp was formerly a German prisoner-of-war camp. It was cleared of German prisoners to accommodate the Irish patriots involved in the Easter Rising, the first of whom arrived there 9 June 1916. The camp was located at Frongoch, three miles from the town of Bala in Merionethshire, North Wales.Coogan, Michael Collins, p. 49."]}, {"page": "Robert Brennan (journalist)", "response": ["He commanded the insurgents in Wexford during the 1916 Easter Rising and, along with other leaders Seamus Rafter and Seán Etchingham, was sentenced to death. The sentence was commuted to penal servitude. His continuing political activity resulted in further imprisonments in 1917 and afterwards. His daughter Maeve Brennan was born while he was in prison. In April 1918 he was placed in charge of a newly formed Sinn Féin Department of Propaganda/Publicity. However, in November 1918 he was arrested in the run-up to the General Election (held in December), in an effort by the British Government to stifle the Sinn Féin election campaign. The election manifesto on which he had worked was \"mutilated by the censor\" - only about one half of it could be published. He became Sinn Féín National Director of Elections in December 1918. The election turned out to be a resounding success for the party."]}, {"page": "John Etchingham", "response": ["#redirectSeán Etchingham"]}, {"page": "Etchingham (disambiguation)", "response": ["*Seán Etchingham (1868–1923), Irish Sinn Féin politician"]}, {"page": "List of members of the Oireachtas imprisoned during the Irish revolutionary period", "response": ["| Seán Etchingham"]}]}}