{"wiki_id": "http://www.wikidata.org/entity/Q335896", "itemLabel": "John Douglas, 9th Marquess of Queensberry", "itemDescription": "Scottish noble (1844-1900)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Douglas,_9th_Marquess_of_Queensberry", "wikipedia_page": {"main": "John Sholto Douglas, 9th Marquess of Queensberry (20 July 1844 – 31 January 1900), was a Scottish nobleman, remembered for his atheism, his outspoken views, his brutish manner, for lending his name to the \"Queensberry Rules\" that form the basis of modern boxing, and for his role in the downfall of the Irish author and playwright Oscar Wilde.\n\n", "link_mentions": [{"page": "January 31", "response": ["*1900 – John Douglas, 9th Marquess of Queensberry, Scottish nobleman (b. 1844)"]}, {"page": "United Kingdom", "response": ["The 'Queensberry rules', the code of general rules in boxing, was named after John Douglas, 9th Marquess of Queensberry in 1867, and formed the basis of modern boxing. Snooker is another of the UK's popular sporting exports, with the world championships held annually in Sheffield. In Northern Ireland, Gaelic football and hurling are popular team sports, both in terms of participation and spectating. Irish expatriates in the UK and the US also play them. Shinty (or camanachd) is popular in the Scottish Highlands. Highland games are held in spring and summer in Scotland, celebrating Scottish and celtic culture and heritage, especially that of the Scottish Highlands.\"Sport in Scotland\". Scotland.org. Retrieved 20 June 2015."]}, {"page": "1900", "response": ["* January 31 – John Douglas, 9th Marquess of Queensberry, Scottish nobleman, boxer (b. 1844)"]}, {"page": "Lord Alfred Douglas", "response": ["Douglas was born at Ham Hill House in Powick, Worcestershire, the third son of John Douglas, 9th Marquess of Queensberry and his first wife, Sibyl Montgomery."]}, {"page": "Douglas (surname)", "response": ["* John Douglas, 9th Marquess of Queensberry (1844–1900), Scottish nobleman"]}, {"page": "Archibald Primrose, 5th Earl of Rosebery", "response": ["Like Oscar Wilde, he was hounded by John Douglas, 9th Marquess of Queensberry for his association with Francis Douglas, Viscount Drumlanrig, Queensberry's first born sonMurray, Douglas Bosie: A Biography of Lord Alfred Douglas  – who had become his private secretary in 1892 when Rosebery became Foreign Secretary. A few months later he arranged for Drumlanrig, who was 26 at the time, to be made a junior member of the government with a seat in the House of Lords."]}, {"page": "John Sholto Douglas", "response": ["#REDIRECT John Douglas, 9th Marquess of Queensberry"]}, {"page": "John Sholto Douglas, 9th Marquess of Queensbury", "response": ["#REDIRECT John Douglas, 9th Marquess of Queensberry"]}, {"page": "Culture of the United Kingdom", "response": ["The 'Queensberry rules', the code of general rules in boxing, was named after John Douglas, 9th Marquess of Queensberry in 1867, that formed the basis of modern boxing.Encyclopædia Britannica (2006).ŷ Queensbury Rules, Britannica Britain's first heavyweight world champion Bob Fitzsimmons made boxing history as the sport's first three-division world champion. The 1980s saw the emergence of heavyweight Frank Bruno who would become hugely popular with the British public. In the 1990s, Chris Eubank, Nigel Benn, Steve Collins and Michael Watson had a series of fights against each other in the super-middleweight division, drawing audiences of up to 20 million in the UK. Eubank's eccentric personality made him one of the most recognisable celebrities in the UK along with the cocky ”Prince\" Naseem Hamed. The Nigel Benn vs. Gerald McClellan fight in 1995 drew 13 million. Other big draw fighters in the UK included Lennox Lewis, Joe Calzaghe and Ricky Hatton."]}, {"page": "Zermatt", "response": ["* John Douglas, 9th Marquess of Queensberry (1844–1900) Scottish nobleman, eponym of the Queensberry Rules, linked with Oscar Wilde, wrote The Spirit of the Matterhorn in Zermatt in 1873  "]}, {"page": "Wilde (film)", "response": ["* Tom Wilkinson as John Douglas, 9th Marquess of Queensberry "]}, {"page": "Sport in the United Kingdom", "response": ["The United Kingdom played a key role in the evolution of modern boxing, with the codification of the rules of the sport known as the Queensberry Rules, named after John Douglas, 9th Marquess of Queensberry in 1867.Encyclopædia Britannica (2006).ŷ Queensbury Rules, Britannica Britain's first heavyweight world champion Bob Fitzsimmons made boxing history as the sport's first three-division world champion. Some of the best contemporary British boxers have included super-middleweight champion Joe Calzaghe, featherweight champion Naseem Hamed, and heavyweight champions Lennox Lewis, Tyson Fury and Anthony Joshua. Welshman Calzaghe's display against Jeff Lacy in 2006 prompted Lacy's trainer to state \"I have never seen a better performance than that in the world.\""]}, {"page": "List of Scottish representative peers", "response": ["| John Douglas, 9th Marquess of Queensberry"]}, {"page": "John Sholto Douglas, 8th Marquess of Queensberry", "response": ["#REDIRECT John Douglas, 9th Marquess of Queensberry"]}, {"page": "Francis Douglas, Viscount Drumlanrig", "response": ["Born at 8 Chesterfield Street, Mayfair, London, Drumlanrig was the eldest son of John Douglas, 9th Marquess of Queensberry, by his first wife Sibyl, daughter of Alfred Montgomery. As the heir apparent of the Marquess, he used the courtesy title Viscount Drumlanrig.thepeerage.com Francis Archibald Douglas, Viscount Drumlanrig He was educated at Harrow and at the Royal Military Academy, Sandhurst and served as Lieutenant in the 2nd Battalion of the Coldstream Guards from 1887 to 1893."]}, {"page": "John Douglas", "response": ["*John Douglas, 9th Marquess of Queensberry (1844–1900), Scottish nobleman"]}, {"page": "John Sholto Douglas, 9th Marquess of Queensberry", "response": ["#REDIRECT John Douglas, 9th Marquess of Queensberry"]}, {"page": "1895 in poetry", "response": ["* February 18 – John Douglas, 9th Marquess of Queensberry (father of Lord Alfred Douglas, Oscar Wilde's lover), leaves his calling card at the Albemarle Club in London, inscribed: \"For Oscar Wilde, posing somdomite\", i.e. a sodomite, inducing Wilde to charge him with criminal libel."]}]}}