{"wiki_id": "http://www.wikidata.org/entity/Q33546324", "itemLabel": "Rex Sanders", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Rex_Sanders", "wikipedia_page": {"main": "Wing Commander Rex Southern Sanders  (14 December 1922 – 10 May 2017) was a Royal Air Force navigator who won a DFC for his service during the Second World War and an AFC for his part in secret photographic and radar reconnaissance missions behind Soviet lines in the 1950s during the Cold War.", "link_mentions": [{"page": "Rex (given name)", "response": ["* Rex Sanders (1922–2017), English military aviator "]}, {"page": "John Crampton", "response": ["In the early postwar years, Crampton transitioned from piston-engined bombers to jet fighters, piloting the Gloster Meteor as part of 12 Group at RAF Horsham St. Faith and later the de Havilland Vampire. In July 1951 he was selected to lead a special duty flight that would train on USAF RB-45C reconnaissance aircraft. After extensive training at Barksdale Air Force Base, his crew which included his navigator Rex Sanders and two others began covert operations. Code-named Operation Ju-jitsu, four North American RB-45C Tornado aircraft were stripped of their USAF markings and repainted in RAF colours. Based at RAF Sculthorpe, the aircraft were tasked with flying deep level reconnaissance missions over the Soviet Union to gather electronic and photographic intelligence. The special duties flight conducted missions during the period 1952–54. It was not until 1994 (under the \"fifty year rule\" of the Public Records Act 1958) that the existence of the spy missions became public knowledge. During the final mission, Crampton's aircraft came under anti-aircraft fire and was nearly intercepted by MiG 15s. In the aftermath, the Jiu Jitsu flights were folded up. Initially, Squadron Leader Micky Martin of Dambusters fame was chosen to lead the operations but he failed a mandatory high altitude pressurisation test and Crampton was selected instead. He was awarded the Air Force Cross on 10 June 1954."]}, {"page": "Deaths in May 2017", "response": ["*Rex Sanders, 94, British Royal Air Force officer.Wing Commander Rex Sanders, navigator on operation Ju-Jitsu – obituary"]}, {"page": "Rex Southern Sanders", "response": ["#REDIRECT Rex Sanders"]}]}}