{"wiki_id": "http://www.wikidata.org/entity/Q3359003", "itemLabel": "Owen Moran", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Owen_Moran", "wikipedia_page": {"main": "Owen Moran (born 4 October 1884 in Birmingham, England – died 17 March 1949) was an English boxer. Known as \"The Fearless\", Moran is recognized by some historians as a former world bantamweight champion.  During his career, Moran knocked out former lightweight king Battling Nelson and also fought boxing greats Jim Driscoll, Packey McFarland, Abe Attell, Ad Wolgast, Frankie Neil and George Dixon. Moran retired in 1916 with over 100 fights. He was inducted into the International Boxing Hall of Fame in 2002.\n\n", "link_mentions": [{"page": "Abe Attell", "response": ["|align=left| Owen Moran", "|align=left| Owen Moran", "|align=left| Owen Moran", "|align=left| Owen Moran", "|align=left| Owen Moran", "|align=left| Owen Moran", "|align=left| Owen Moran", "|align=left| Owen Moran", "|align=left| Owen Moran", "|align=left| Owen Moran"]}, {"page": "George Dixon (boxer)", "response": ["|align=left| Owen Moran", "|align=left| Owen Moran"]}, {"page": "Monte Attell", "response": ["===Loss to flyweight champ Owen Moran, 1905===", "upright=.7|right|thumb|Owen Moran", "Attell lost to accomplished British boxer Owen Moran on May 15, 1905 in a twenty-round points decision at the Pallisades in New York before a private, affluent crowd of around 150, who paid as much as $10 to see the fight, a princely sum in that era.  Moran held the BBBC Flyweight Championship of Great Britain in 1903 and would compete several times for the bantamweight championship of his native land.  Moran fought with more telling blows which won him the decision.  By the sixth, both fighters were fatigued, and in the seventh, Moran hooked a strong left to the jaw of Attell staggering him, and causing him to fall against the ropes as the round ended.  Moran tried to finish Attell through the final ten rounds, but was unable, as his opponent would retreat or clinch to save himself. The bout caused a serious eye injury to Attell which became permanent and eventually led to blindness.\"Moran of England Whipped Montie Attell\", The Buffalo Times, Buffalo, New York, pg. 6, 16 May 1905", "Attell initially retired from boxing in 1916, largely as the result of an eye infection that eventually led to his going blind in the eye.  He had lost most of his vision in the other eye as a result of injuries sustained during his fight with Owen Moran in May 1905.  One of his last bouts was a seven-round knockout loss on October 16, 1930, to Marty Taylor, known as Kid Taylor, a featherweight who had fought but not beaten several quality boxers.  In his youth, he had knocked out Taylor on April 21, 1905 in New York.", "| Owen Moran"]}, {"page": "Jim Driscoll", "response": ["|align=left| Owen Moran", "|align=left| Owen Moran"]}, {"page": "Battling Nelson", "response": ["|style=\"text-align:left;\"| Owen Moran", "|style=\"text-align:left;\"| Owen Moran"]}, {"page": "Ad Wolgast", "response": ["|style=\"text-align:left;\"| Owen Moran", "|style=\"text-align:left;\"| Owen Moran", "|style=\"text-align:left;\"| Owen Moran", "|style=\"text-align:left;\"| Owen Moran"]}, {"page": "Matt Wells (boxer)", "response": ["Wells defeated British boxer and former claimant of the 1907 British sanctioned World Bantamweight championship Owen Moran on 27 September 1913 in Sydney Stadium in Australia. Moran was a former contender for the World Featherweight championship against Abe Attell on New Years Day 1908 in Colma, California, but failed to knockout Attell in 25 rounds.", "|style=\"text-align:left;\"| Owen Moran", "|style=\"text-align:left;\"| Owen Moran"]}, {"page": "Digger Stanley", "response": ["|style=\"text-align:left;\"|Owen Moran", "|style=\"text-align:left;\"|Owen Moran", "|style=\"text-align:left;\"|Owen Moran"]}, {"page": "Harlem Tommy Murphy", "response": ["|align=left| Owen Moran", "|align=left| Owen Moran", "|align=left| Owen Moran", "|align=left| Owen Moran"]}, {"page": "Packey McFarland", "response": ["|align=left| Owen Moran", "|align=left| Owen Moran"]}, {"page": "Llew Edwards", "response": ["upright=.8|left|thumb|Featherweight Jim DriscollBritain's 1910 featherweight champion Jim Driscoll, a fellow Welsh boxer from nearby Cardiff, acted as a mentor to Edwards in his career.  Driscoll fought many of the same boxers, particularly Owen Moran for the British Empire featherweight title. Driscoll was twelve years older and able to share his boxing experience with his friend and fellow Welshman Edwards.  His stellar boxing career was over in 1913, just as Edwards's was beginning his career and already showing remarkable potential. ", "The Welsh boxer, as a rising star, began a winning streak on 22 September 1913 that continued nearly uninterrupted until 13 May 1915, when he next met Owen Moran for the title.", "== Taking the British and British Empire featherweight title, Owen Moran, 1915 ==", "upright=.750|left|thumb|Owen Moran", "These wins allowed him to face the exceptional British champion Owen Moran in the title match on 31 May 1915 at Covent Garden's National Sporting Club, the most prestigious boxing venue in London. The incomparable Moran was a former British and world bantamweight champion, and the most accomplished opponent of Edwards's career.  With one hundred wins already in his record, the Cincinnati Enquirer, picked Edwards to become the new British champion, and he handily achieved the feat after Moran was disqualified in the tenth round for repeatedly punching low.  It was the prime of his career and Edwards's greatest victory.  One week earlier, he had stunned a sizable audience by knocking out featherweight contender Harold Walker in one round at the West London Stadium.\"Veteran Ring Expert Picks\", The Cincinnati Enquirer, Cincinnati, Ohio, pg. 39, 30 May 1915 Having married earlier in June, Edwards sailed for Australia in July, where he had eleven fights arranged with guaranteed earnings of £2,500."]}, {"page": "November 1910", "response": ["*Owen Moran won the lightweight boxing championship by knocking out Battling Nelson in the 11th round at a bout in San Francisco.\"Battling Nelson Is Knocked Out\", New York Times, November 27, 1910, pC-5; \"Fearless: When Owen Moran thrilled America\" by Mike Casey, CyberBoxingZone.com"]}, {"page": "List of Commonwealth Boxing Council champions", "response": ["|align=left |  Owen Moran"]}, {"page": "Joe Mandot", "response": ["Mandot won an eight round points decision with Owen Moran on April 1, 1912.  Mandot was down for a long count in the second, but carried the fight to the Englishman for the remainder of the match, scoring a comfortable lead in points by the eighth.\"Joe Mandot Gives Owen Moran A Bad Beating\", The Los Angeles Times, Los Angeles, California, pg. 29, 2 April 1912    Mandot forced the fight after the second round with little or no counterpunching from Moran.\"Joe Mandot Gives Owen Moran a Bad Beating\", The Los Angeles Times, Los Angeles, California, pg. 29, 2 April 1912   "]}, {"page": "Joe Bowker", "response": ["In a very short time Bowker was rated the best bantamweight in Britain. He defeated Harry Ware in London for the British bantamweight championship on 15 December 1902, and successfully defended his title four times, beating Andrew Tokell, Bill King, Alf Fellows, and Owen Moran. The defeat of Fellows from Chicago, on 9 November 1903 at the National Sporting Club in London, was by a ninth-round knockout.Police Gazette, 28 November 1903", "|style=\"text-align:left;\"|Owen Moran"]}, {"page": "Frankie Neil", "response": ["150 px|right|thumb|Owen Moran, Hall of Fame boxer", "In his ill-advised comeback to the ring in November 22, 1907, Neil lost badly to the accomplished boxer Owen Moran at the Dreamland Rink in San Francisco.  As noted by The San Francisco Call, of his eight-month hiatus from boxing, \"it is this letup which is the factor that is hard to estimate in figuring upon his chances.\" Though sometimes taking on top talent, such as Young Brit, and Monte Attell, Neil lost 13 of 21 of his better publicized bouts after his loss to Moran.", "|style=\"text-align:left;\"|Owen Moran", "|style=\"text-align:left;\"|Owen Moran", "|style=\"text-align:left;\"|Owen Moran"]}, {"page": "Arthur Frederick Bettinson", "response": ["Famous boxers Jim Driscoll and Owen Moran were to fight for the World Featherweight title in Birmingham on 16 December 1911. Before the bout took place, both boxers and the promoter of the event, Gerald Austin, were summoned to the Birmingham Court, accused of arranging and attempting to participate in a prize fight."]}]}}