{"wiki_id": "http://www.wikidata.org/entity/Q335557", "itemLabel": "Ian Russell, 13th Duke of Bedford", "itemDescription": "British peer and writer (1917-2002)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Russell,_13th_Duke_of_Bedford", "wikipedia_page": {"main": "John Ian Robert Russell, 13th Duke of Bedford (24 May 1917 – 25 October 2002), styled Lord Howland until 1940 and Marquess of Tavistock between 1940 and 1953, was a British peer and writer.  With J. Chipperfield he founded Woburn Safari Park and was the first Duke to open to the public the family seat, Woburn Abbey, which houses a large gallery of European paintings.", "link_mentions": [{"page": "Edsel", "response": ["In the first year, 63,110 Edsels were sold in the United States, and 4,935 were sold in Canada. Though below expectations, this nevertheless represented the second-largest launch for any new car brand to date, exceeded only by the DeSoto introduction in 1929. There was one four-door Citation model purchased and delivered in October 1957 to the United Kingdom for Ian Russell, 13th Duke of Bedford. Its current whereabouts is unknown.  In January 1958, the free-standing Edsel division was added to Lincoln-Mercury, with the re-christened Mercury-Edsel-Lincoln Division (M-E-L) adopting Edsel sales and marketing operations.  As the model year progressed and sales fell under expectations, multiple Edsel-only dealers closed or expanded their brand offerings with the encouragement of Ford Motor Company, including Lincoln-Mercury or imported Ford of Britain and Ford of Germany franchises."]}, {"page": "Herbrand Russell, 11th Duke of Bedford", "response": ["His grandson Ian Russell, 13th Duke of Bedford describes him as follows: \"A selfish, forbidding man, with a highly developed sense of public duty and ducal responsibility, he lived a cold, aloof existence, isolated from the outside world by a mass of servants, sycophants and an eleven-mile wall.\" In conjunction with his son Hastings Russell, 12th Duke of Bedford, he developed plans to protect the Bedford fortune from the British tax regime. However, he died too soon for these to come to fruition and the only result was to involve his grandson in enormous difficulties in obtaining access to the family properties."]}, {"page": "John Robert Russell, 13th Duke of Bedford", "response": ["#REDIRECT Ian Russell, 13th Duke of Bedford"]}, {"page": "The Iron Maiden", "response": ["* Ian Russell, 13th Duke of Bedford as himself."]}, {"page": "International Best Dressed Hall of Fame List", "response": ["|Ian Russell, 13th Duke of Bedford"]}, {"page": "John Robert Russell", "response": ["#REDIRECT Ian Russell, 13th Duke of Bedford"]}, {"page": "2002 in the United Kingdom", "response": ["*25 October – Ian Russell, 13th Duke of Bedford, peer (born 1917)"]}, {"page": "Ian Russell", "response": ["*Ian Russell, 13th Duke of Bedford (1917–2002), British peer and writer"]}, {"page": "1917 in the United Kingdom", "response": ["** Ian Russell, 13th Duke of Bedford, peer (died 2002)"]}, {"page": "Lydia, Duchess of Bedford", "response": ["#REDIRECT Ian Russell, 13th Duke of Bedford"]}, {"page": "Lord Francis Hastings Russell", "response": ["#REDIRECT Ian Russell, 13th Duke of Bedford"]}, {"page": "Lydia Russell, Duchess of Bedford", "response": ["#REDIRECT Ian Russell, 13th Duke of Bedford"]}, {"page": "John Russell, 13th Duke of Bedford", "response": ["#REDIRECT Ian Russell, 13th Duke of Bedford"]}, {"page": "Chorleywood House Estate", "response": ["She was very close to her only sister Ermyntrude Malet (1856-1927) who was widowed in 1908. Her husband had been Sir Edward Baldwin Malet.The Peerage website Online reference Her great nephew Ian Russell, 13th Duke of Bedford remembered both of them in his autobiography published in 1959. He said:"]}, {"page": "Deaths in October 2002", "response": ["*Ian Russell, 13th Duke of Bedford, 85, British peer and writer."]}, {"page": "Duchess of Bedford", "response": ["*Lydia Lyle (1917–2006), 2nd wife of Ian Russell, 13th Duke of Bedford", "*Nicole Russell, Duchess of Bedford (Nicole Milinaire) (1920–2012), 3rd wife of Ian Russell, 13th Duke of Bedford"]}]}}