{"wiki_id": "http://www.wikidata.org/entity/Q335679", "itemLabel": "James Lindesay-Bethune, 16th Earl of Lindsay", "itemDescription": "British peer (born 1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Lindesay-Bethune,_16th_Earl_of_Lindsay", "wikipedia_page": {"main": "James Randolph Lindesay-Bethune, 16th Earl of Lindsay,  (born 19 November 1955), is a Scottish businessman and Conservative politician.\nThe son of David Lindesay-Bethune, 15th Earl of Lindsay, and his first wife Mary Douglas-Scott-Montagu, he was educated at Eton, the University of Edinburgh and the University of California, Davis. He succeeded his father as Earl of Lindsay in 1989. He was vice-chairman of the Inter-Party Union Committee on Environment 1994–95, and was Parliamentary Under-Secretary of State for Scotland from 1995 to 1997, during which time he was responsible for agriculture, fisheries and environment. His work has been involved with the environment and the food industry. Between 2012 and 2017, Lord Lindsay was President of the National Trust of Scotland and was appointed as President of the Chartered Trading Standards Institute in April 2021.In 1982 he married Diana Mary Chamberlayne-Macdonald, a granddaughter of Sir Alexander Somerled Angus Bosville Macdonald of Sleat, 16th Baronet; the two have five children:\n\nLady Frances Mary Lindesay-Bethune (b. 1986)\nLady Alexandra Penelope Lindesay-Bethune (b. 1988), married to Jack Coleman. They have two sons: Nicholas Tankerville Wallace (b. 2019) and James Horatio Somerled (b. 2021).\nWilliam James Lindesay-Bethune, Viscount of Garnock (b. 30 December 1990)\nThe Hon. David Nigel Lindesay-Bethune (b. 1993)\nLady Charlotte Diana Lindesay-Bethune (b. 1993), married to Prince Jaime of Bourbon-Two Sicilies, Duke of Noto, eldest child of Prince Pedro of Bourbon-Two Sicilies, on 25 September 2021 at Monreale Cathedral.The Countess of Lindsay is a patroness of the Royal Caledonian Ball and a master of the Fife Foxhounds.", "link_mentions": [{"page": "Politics of Scotland", "response": ["* James Lindesay-Bethune, 16th Earl of Lindsay (former Under-Secretary of State for Scotland)"]}, {"page": "List of earls in the peerages of Britain and Ireland", "response": ["|18. ||The Earl of Lindsay|| (1633)||25px||James Lindesay-Bethune, 16th Earl of Lindsay||data-sort-value=2|Scotland|| "]}, {"page": "James Lindsay", "response": ["*James Lindesay-Bethune, 16th Earl of Lindsay (born 1955), Scottish nobleman"]}]}}