{"wiki_id": "http://www.wikidata.org/entity/Q335747", "itemLabel": "Hector Monro, Baron Monro of Langholm", "itemDescription": "British politician (1922-2006)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hector_Monro,_Baron_Monro_of_Langholm", "wikipedia_page": {"main": "Hector Seymour Peter Monro, Baron Monro of Langholm, AE, PC (4 October 1922 – 30 August 2006), was a Scottish Conservative and Unionist Party politician. He was Member of Parliament for Dumfriesshire for over 32 years, from 1964 to 1997, and then a life peer in the House of Lords.\nAfter piloting flying boats in the Second World War, Monro became a farmer in his native Dumfriesshire.  He became active in local test politics in the 1950s, and was elected as MP for Dumfries in 1964.  He served as a Conservative whip and held three junior ministerial positions, twice in the Scottish Office and once as Minister for Sport in the Department for the Environment.  He became a member of the House of Lords in 1997, after he stood down from the House of Commons.  He was particularly concerned with Scottish and rural issues, the RAF, and sport, and was noted for his strong links with his constituency. He was in office at the time of the Lockerbie Disaster in 1988, which occurred in his constituency.", "link_mentions": [{"page": "Baron Monro of Langholm", "response": ["#REDIRECT Hector Monro, Baron Monro of Langholm"]}, {"page": "Lord Monro of Langholm", "response": ["#REDIRECT Hector Monro, Baron Monro of Langholm"]}, {"page": "Hector Seymour Peter Monro", "response": ["#REDIRECT Hector Monro, Baron Monro of Langholm"]}, {"page": "Hector Seymour Peter Monro, Baron Monro of Langholm", "response": ["#REDIRECT Hector Monro, Baron Monro of Langholm"]}, {"page": "1922 in the United Kingdom", "response": ["* 4 October – Hector Monro, Baron Monro of Langholm, Conservative politician (died 2006)"]}, {"page": "Canford School", "response": ["*Hector Monro, Baron Monro of Langholm (1922–2006), Conservative politician"]}, {"page": "List of United Kingdom MPs: M", "response": ["*Hector Monro, Baron Monro of Langholm, (1964–1997)"]}, {"page": "Deaths in August 2006", "response": ["*Hector Monro, Baron Monro of Langholm, 83, British MP and government minister."]}, {"page": "Hector Munro", "response": ["*Hector Monro, Baron Monro of Langholm (1922–2006), Scottish Conservative & Unionist Party politician"]}, {"page": "2006 in the United Kingdom", "response": ["** Hector Monro, Baron Monro of Langholm, politician (born 1922)"]}, {"page": "2006 in Scotland", "response": ["* 30 August – Hector Monro, Baron Monro of Langholm, Conservative and Unionist MP (born 1922)"]}, {"page": "Monro", "response": ["* Hector Monro, Baron Monro of Langholm, Conservative & Unionist Party politician"]}]}}