{"wiki_id": "http://www.wikidata.org/entity/Q335484", "itemLabel": "A. L. Rowse", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/A._L._Rowse", "wikipedia_page": {"main": "Alfred Leslie Rowse  (4 December 1903 – 3 October 1997) was a British historian and author, best known for his work on Elizabethan England.\nBorn in Cornwall and raised in humble circumstances, he was encouraged to study for Oxford by fellow-Cornishman Sir Arthur Quiller-Couch. He was elected a fellow of All Souls College and later appointed lecturer at Merton College. Best known of his many works was The Elizabethan Age trilogy. His work on Shakespeare included a claim to have identified the 'Dark Lady of the Sonnets' as Emilia Lanier, which attracted much interest from scholars, but also many counter-claims.\nRowse was in steady demand as a lecturer in America. In the 1930s, he stood unsuccessfully for Parliament in the Labour interest, though he ended as a conservative in old age.\n\n", "link_mentions": [{"page": "Cornwall", "response": ["Charles Causley, the poet, was born in Launceston and is perhaps the best known of Cornish poets. Jack Clemo and the scholar A. L. Rowse were also notable Cornishmen known for their poetry; The Rev. R. S. Hawker of Morwenstow wrote some poetry which was very popular in the Victorian period.*Woolf, Cecil (1965).\"Hawker of Morwenstow, 1803-1875.\"  The Book Collector 14 no 1 (spring): 62-71; 14 no 2 (summer): 202-211."]}, {"page": "Elizabeth I", "response": ["The picture of Elizabeth painted by her Protestant admirers of the early 17th century has proved lasting and influential.Haigh, 175, 182. Her memory was also revived during the Napoleonic Wars, when the nation again found itself on the brink of invasion.Dobson and Watson, 258. In the Victorian era, the Elizabethan legend was adapted to the imperial ideology of the day, and in the mid-20th century, Elizabeth was a romantic symbol of the national resistance to foreign threat.Haigh, 175. Historians of that period, such as J. E. Neale (1934) and A. L. Rowse (1950), interpreted Elizabeth's reign as a golden age of progress.Haigh, 182. Neale and Rowse also idealised the Queen personally: she always did everything right; her more unpleasant traits were ignored or explained as signs of stress.Kenyon, 207"]}, {"page": "Francis Bacon", "response": ["The true reason for his acknowledgement of guilt is the subject of debate, but some authors speculate that it may have been prompted by his sickness, or by a view that through his fame and the greatness of his office he would be spared harsh punishment. He may even have been blackmailed, with a threat to charge him with sodomy, into confession.A. L. Rowse, quoted in Parris; Maguire (2004: 8): \"a charge of sodomy was... to be brought against the sixty-year-old Lord Chancellor\".", "Several authors believe that, despite his marriage, Bacon was primarily attracted to men.A. L. Rowse, Homosexuals in History, New York: Carroll & Garf, 1977. p. 44Jardine, Lisa; Stewart, Alan Hostage To Fortune: The Troubled Life of Francis Bacon Hill & Wang, 1999. p. 148 Forker,Charles R. Forker, \"'Masculine Love', Renaissance Writing, and the 'New Invention' of Homosexuality: An Addendum\" in the Journal of Homosexuality (1996), Indiana University for example, has explored the \"historically documentable sexual preferences\" of both Francis Bacon and King James I and concluded they were both oriented to \"masculine love\", a contemporary term that \"seems to have been used exclusively to refer to the sexual preference of men for members of their own gender.\"Journal of Homosexuality, Volume: 31 Issue: 3, 1996, pp. 85–93, "]}, {"page": "Hamlet", "response": ["Scholars have often speculated that Hamlets Polonius might have been inspired by William Cecil (Lord Burghley)—Lord High Treasurer and chief counsellor to Queen Elizabeth I. E. K. Chambers suggested Polonius's advice to Laertes may have echoed Burghley's to his son Robert Cecil. John Dover Wilson thought it almost certain that the figure of Polonius caricatured Burghley. A. L. Rowse speculated that Polonius's tedious verbosity might have resembled Burghley's. Lilian Winstanley thought the name Corambis (in the First Quarto) did suggest Cecil and Burghley. Harold Jenkins considers the idea that Polonius might be a caricature of Burghley to be conjecture, perhaps based on the similar role they each played at court, and also on Burghley addressing his Ten Precepts to his son, as in the play Polonius offers \"precepts\" to Laertes, his own son. Jenkins suggests that any personal satire may be found in the name \"Polonius\", which might point to a Polish or Polonian connection. G. R. Hibbard hypothesised that differences in names (Corambis/Polonius:Montano/Raynoldo) between the First Quarto and other editions might reflect a desire not to offend scholars at Oxford University."]}, {"page": "Richard III of England", "response": ["Richard had two acknowledged illegitimate children, John of Gloucester and Katherine Plantagenet. Also known as 'John of Pontefract', John of Gloucester was appointed Captain of Calais in 1485. Katherine married William Herbert, 2nd Earl of Pembroke, in 1484. Neither the birth dates nor the names of the mothers of either of the children is known. Katherine was old enough to be wedded in 1484, when the age of consent was twelve, and John was knighted in September 1483 in York Minster, and so most historians agree that they were both fathered when Richard was a teenager. There is no evidence of infidelity on Richard's part after his marriage to Anne Neville in 1472 when he was around 20. This has led to a suggestion by the historian A. L. Rowse that Richard \"had no interest in sex\"."]}, {"page": "1903", "response": ["** A. L. Rowse, English historian (d. 1997)"]}, {"page": "George II of Great Britain", "response": ["* Dickinson, Harry T.; introduced by A. L. Rowse (1973) Walpole and the Whig Supremacy. London: The English Universities Press. "]}, {"page": "Howard Spring", "response": ["Howard Spring died of a stroke. In 1967, his widow, Marion Spring, wrote an affectionate story of their life together, called Howard, with a foreword by A. L. Rowse. It was published by Collins."]}, {"page": "Stanley Baldwin", "response": ["In July 1940, a bestseller Guilty Men appeared, which blamed Baldwin for failing to rearm enough. In May 1941, Hamilton Fyfe wrote an article (\"Leadership and Democracy\") for Nineteenth Century and After, which also laid those charges against Baldwin. In 1941, A. L. Rowse criticised Baldwin for lulling the people into a false sense of security and as a practitioner in \"the art of taking the people in\":", "what can this man think in the still watches of the night, when he contemplates the ordeal his country is going through as the result of the years, the locust years, in which he held power?A. L. Rowse, 'Reflections on Lord Baldwin', Political Quarterly, XII (1941), pp. 305–17. Reprinted in Rowse, End of an Epoch (1947)."]}, {"page": "List of historians", "response": ["*A. L. Rowse (1903–1997), English"]}, {"page": "All Souls College, Oxford", "response": ["* A. L. Rowse (1925), historian and poet", "* A. L. Rowse"]}, {"page": "A. J. P. Taylor", "response": ["Other historians who criticised The Origins of the Second World War included: Isaac Deutscher, Barbara Tuchman, Ian Morrow, Gerhard Weinberg, Elizabeth Wiskemann, W. N. Medlicott, Tim Mason, John Lukacs, Karl Dietrich Bracher, Frank Freidel, Harry Hinsley, John Wheeler-Bennett, Golo Mann, Lucy Dawidowicz, Gordon A. Craig, A. L. Rowse, Raymond Sontag, Andreas Hillgruber and Yehuda Bauer. Rowse, who had once been a close friend of Taylor's, attacked him with an intensity and vehemence that was second only to Trevor-Roper's. In addition, several historians wrote books on the origins of the Second World War with the aim of refuting Taylor's thesis. Taylor was angered by some of the criticism, especially the implication that he had set out to exonerate Hitler, writing that \"to the best of my recollection, those who now display indignation against me were not active [against appeasement] on the public platform\".Burk 2002, p. 292 Some notable examples include Gerhard Weinberg's two-volume The Foreign Policy of Hitler's Germany and Andreas Hillgruber's Deutschlands Rolle in der Vorgeschichte der beiden Weltkriege [Germany's Role in the Background to Both World Wars], translated as Germany and the Two World Wars."]}, {"page": "James Anthony Froude", "response": ["* A. L. Rowse, Froude the Historian: Victorian Man of Letters, Alan Sutton, Gloucester, 1987, "]}, {"page": "Humphrey Gilbert", "response": ["Gilbert was part of a remarkable generation of Devonshire men, who combined the roles of adventurer, writer, soldier and mariner. A. L. Rowse wrote of him as,", "an interesting psychological case, with the symptoms of disturbed personality that often go with men of mark, not at all the simple Elizabethan seaman of Froude's Victorian view. He was passionate and impulsive, a nature liable to violence and cruelty – as came out in his savage repression of rebels in Ireland – but also intellectual and visionary, a questing and original mind, with the personal magnetism that went with it. People were apt to be both attracted and repelled by him, to follow his leadership and yet be mistrustful of him.A. L. Rowse The Elizabethan Renaissance: the Life of the Society (1971) p. 160. "]}, {"page": "John Stow", "response": ["John Stow (also Stowe; 1524/25 – 5 April 1605) was an English historian and antiquarian. He wrote a series of chronicles of English history, published from 1565 onwards under such titles as The Summarie of Englyshe Chronicles, The Chronicles of England, and The Annales of England; and also A Survey of London (1598; second edition 1603). A. L. Rowse has described him as \"one of the best historians of that age; indefatigable in the trouble he took, thorough and conscientious, accurate – above all things devoted to truth\".Rowse 1971, p. 15."]}, {"page": "Fowey", "response": ["*Henderson, Charles (1935) Fowey. In: Essays in Cornish History edited by A. L. Rowse and M. I. Henderson; pp. 26–43"]}, {"page": "St Austell", "response": ["St Austell is not mentioned in Domesday Book (1086). However A. L. Rowse, in his book St. Austell: Church, Town, and Parish, cites records which show a church was dedicated on 9 October 1262 by Bishop Bronescombe, and other records show a church there in 1169, dedicated to \"Sanctus Austolus\".  The current church dates from the 13th–14th centuries, and was extended in 1498–99. The join between the two sections is still visible.St Austell Parish Church website, visited 11 May 2020."]}, {"page": "List of historians by area of study", "response": ["* A. L. Rowse (1903–1997) – Cornish history and Elizabethan England"]}, {"page": "Willem Schouten", "response": ["Among historians, including A. L. Rowse, there is no consensus about the authorship of this Journal. Schouten has got the credit for it, and thus the voyage has come down to us under his name. The Dutch, French, German and Latin texts all have nine engraved maps and plates which are not present in the English version, THE RELATION."]}, {"page": "Prayer Book Rebellion", "response": ["In Cornwall and Devon, the issue of the Book of Common Prayer proved to be the final indignity that the people could peaceably bear. Two decades of oppression were followed by two years of rampant inflation, in which wheat prices had quadrupled.A. L. Rowse, Tudor Cornwall, London: Macmillan, 1969, p. 262 Along with the rapid enclosure of common lands, the attack on the Church, which was felt to be central to the rural community, led to an explosion of anger.  In Cornwall, an army gathered at the town of Bodmin under the leadership of its mayor, Henry Bray, and two staunch Catholic landowners, Sir Humphrey Arundell of Helland and John Winslade of Tregarrick."]}, {"page": "Saltash", "response": ["After the Norman Conquest, Robert, Count of Mortain, who held the castle and manor at Trematon, took the market from the canons at St. Germans and established it at Saltash. The Count granted Trematon and other manors to the de Valletorts, who had then to provide for the ferry boat. In the twelfth century a borough was founded (1190), and Saltash became the only franchised seaport between Dartmouth and Fowey. This fact has given rise to the Saltash saying, Saltash was a borough town, when Plymouth was a fuzzy down ('fuzzy' = 'fursy' i.e. covered in gorse), as the town of Plymouth and its seaport did not exist in 1190. In medieval times the ferry was part of the manor of Trematon, held by the Valletorts.Henderson, C. (1935) \"Cornish Ferries\", in Essays in Cornish History, edited by A. L. Rowse and M. I. Henderson. Oxford: Clarendon Press; pp. 163-67"]}]}}