{"wiki_id": "http://www.wikidata.org/entity/Q335819", "itemLabel": "William Maclagan", "itemDescription": "Archbishop of York 1826-1910", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Maclagan", "wikipedia_page": {"main": "William Dalrymple Maclagan (18 June 1826 – 19 September 1910) was Archbishop of York from 1891 to 1908, when he resigned his office, and was succeeded in 1909 by Cosmo Gordon Lang, later Archbishop of Canterbury. As Archbishop of York, Maclagan crowned Queen Alexandra in 1902.", "link_mentions": [{"page": "Bishopthorpe", "response": ["Bishopthorpe has a long history of notable ecclesiastical residents. The latest Archbishop of York is Stephen Cottrell, who has been resident since July 2020 when he succeeded John Sentamu. Many of the streets in Bishopthorpe are named after previous Archbishops: for example, Ramsey Avenue (Michael Ramsey, 1956–1961), Maclagan Road (William Maclagan, 1891–1908), Lamplugh Crescent (Thomas Lamplugh, 1688–1691), Coggan Way (Donald Coggan, 1961–1974), Garbett Way (Cyril Garbett, 1942–1955), Temple Road (William Temple, 1929–1942), Lang Road (Cosmo Gordon Lang, 1909 – 1928), Vernon Close (Edward Venables-Vernon, 1808–1847, Drummond Way (Robert Hay Drummond, 1761–1776), Wolsley Drive (Thomas Wolsey, 1514–1530) and De Grey Place (Walter de Gray, 1216–1255)."]}, {"page": "Frederick Temple", "response": ["As archbishop he presided in 1897 over the decennial Lambeth Conference. In the same year Temple and Archbishop of York William Maclagan issued a joint response to Apostolicae curae, an encyclical of the pope which denied the validity of Anglican orders. In 1899 the archbishops again acted together, when an appeal was addressed to them by the united episcopate, to rule on the use of incense in divine service and on the carrying of lights in liturgical processions. After hearing the arguments the two archbishops decided against both practices.The archbishops on the lawfulness of the liturgical use of incense and the carrying of lights in procession. Lambeth Palace, 31 July 1899 During his archeiscopate Temple was deeply distressed by the divisions which were weakening the Anglican Church, and many of his most memorable sermons were calls for unity."]}]}}