{"wiki_id": "http://www.wikidata.org/entity/Q3351879", "itemLabel": "Omar Lye-Fook", "itemDescription": "British soul singer, songwriter and musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Omar_Lye-Fook", "wikipedia_page": {"main": "Omar Christopher Lye-Fook, MBE (born 14 October 1968 in London), known professionally as Omar, is a British soul singer, songwriter and musician. Omar grew up in Canterbury, Kent. He learned his craft classically, playing the trumpet, piano and percussion. He also spent two years at Chetham's School of Music in Manchester and the Guildhall School of Music in London. His most well-known song was his debut single \"There's Nothing Like This\". It reached number 14 in the UK Singles Chart on re-release in 1991. AllMusic noted that he is described by some as the father of British neo soul.\n\n", "link_mentions": [{"page": "Omar (disambiguation)", "response": ["* Omar Lye-Fook or Omar (born 1968), British soul singer"]}, {"page": "Neo soul", "response": ["Neo soul originated in the 1980s and early 1990s, with the work of musical acts such as Prince, Tony! Toni! Toné!, Terence Trent D'Arby, Joi,Mock, Brentin. The Joyful Noise of Janelle Monáe . The Atlantic. Retrieved May 18, 2010. and Mint Condition, whose music deviated from the conventions of most contemporary R&B at the time. Tony! Toni! Toné!-member Raphael Saadiq later embarked on a solo career and produced various works of other neo soul artists. Influential to neo soul, UK act Sade achieved success in the 1980s with music that featured a smooth jazzy style of pop rock called sophisti-pop. The band was part of a new wave of British R&B-oriented artists during the late-1980s and early 1990s that also included Soul II Soul, Caron Wheeler, The Brand New Heavies, Jamiroquai, and Lisa Stansfield.Henderson, Alex (August 1, 2003). British Soul. Allmusic. Retrieved March 6, 2011. AllMusic's Alex Henderson writes that, \"Many of the British artists who emerged during that period had a neo-soul outlook and were able to blend influences from different eras\". Other British progenitors of the neo soul movement at the time included Young Disciples and Omar Lye-Fook, the latter of whom has been cited as \"the father of British neo-soul\" and an influence on many future artists.Cordor, Cyril (2005). Biography: Omar . Allmusic. Retrieved March 6, 2011."]}, {"page": "What's Going On (Marvin Gaye song)", "response": ["In 1994, the song was covered in the Music Relief '94. This cover was released as a benefit single released in memory of the Rwandan genocide and is also on the album Now That's What I Call Music! 29 to find. All singers who participated in the project are: C. J. Lewis, Andrew Roachford, Yazz, Aswad, Edwin Starr, Peter Cunnah of D Ream, Kim Appleby, MAD Jones of BAD, Rozalla, Tony Di Bart, Paul Young, Paul Carrack, Angie Brown of Ramona 55, Jimmy Ruffin, Omar Lye-Fook, Apache Indian, Worlds Apart, Kaos, The Pasadenas, Gus Isidore, Jools Holland, Mark King of Level 42, Nik Kershaw, Larry Adler and Dannii Minogue."]}, {"page": "Mica Paris", "response": ["The follow up album, Contribution, was released in 1990. This extended Paris' soul and gospel influences to bring in hip-hop and house music and featured the track \"If I Love U 2 Nite\", written by Prince and recorded at his Paisley Park studios. With Omar Lye-Fook, a classically trained musician, Paris recorded \"I Should've Known Better\" in 1990. It was issued on the B-side to \"South of the River\". Paris also recorded with Anita Baker, Bonnie Raitt and Natalie Cole on the album Nelson Mandela: An International Tribute for a Free South Africa (1990), and provided the title track to Isaac Julien's Young Soul Rebels movie soundtrack the following year. She worked with the saxophonist Courtney Pine (\"Redemption Song\" – 1992), the Stereo MCs (\"Don't Let Up\" – 1992) and Bobby Womack (\"I Wish I'd Never Met You\" – 1991)."]}, {"page": "Rupert Friend", "response": ["Friend was asked by Kairos 4tet leader Adam Waldmann to write the lyrics for a track on their 2011 album Statement of Intent, and was then asked to contribute lyrics for their 2013 album Everything We Hold, which received positive reviews. His lyrics were sung by Marc O'Reilly, Omar Lye-Fook, and Emilia Martensson."]}, {"page": "Omar Hammer", "response": ["#redirect Omar Lye-Fook"]}, {"page": "Fook", "response": ["*Omar Lye-Fook (born 1968), British soul singer, songwriter and musician"]}, {"page": "Cat Simmons", "response": ["Simmons returned to the Young Vic in summer 2009 to appear in Ché Walker's and Arthur Darvil's musical premiere of Been So Long with nu-classic soul singer Omar Lye-Fook. The production then toured to the Edinburgh Fringe Festival to showcase at the Traverse Theatre."]}, {"page": "List of people from Kent", "response": ["*Omar Lye-Fook (born 1968) – soul singer, songwriter and musician"]}, {"page": "List of television theme music", "response": ["*Chef! (\"Serious Profession\") - Omar Lye-Fook"]}, {"page": "Ol' Dirty Bastard discography", "response": ["*1997 \"Say Nothin'\" (from the Omar Lye-Fook album This Is Not a Love Song)"]}]}}