{"wiki_id": "http://www.wikidata.org/entity/Q335376", "itemLabel": "Kevin McNally", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Kevin_McNally", "wikipedia_page": {"main": "Kevin Robert McNally (born 27 April 1956) is an English actor and writer. He is known for portraying Joshamee Gibbs in the Pirates of the Caribbean film series.", "link_mentions": [{"page": "Braveheart", "response": ["On February 9, 2018, a sequel titled Robert the Bruce was announced. The film will lead directly on from Braveheart and follow the widow Moira, portrayed by Anna Hutchison, and her family (portrayed by Gabriel Bateman and Talitha Bateman), who save Robert the Bruce, with Angus Macfadyen reprising his role from Braveheart. The cast includes Jared Harris, Patrick Fugit, Zach McGowan, Emma Kenney, Diarmaid Murtagh, Seoras Wallace, Shane Coffey, Kevin McNally, and Melora Walters. Richard Gray directed the film, with Macfadyen and Eric Belgau writing the script. Helmer Gray, Macfadyen, Hutchison, Kim Barnard, Nick Farnell, Cameron Nuggent, and Andrew Curry produced the film. Filming took place in 2019 and was completed with a limited cinematic release the same year."]}, {"page": "Tony Hancock", "response": ["Paul Merton, in 1996, appeared in remakes of six of Galton and Simpson's Hancock scripts, which were not critically well received. In 2014, five of the wiped radio instalments of Hancock's Half Hour, chosen by Galton and Simpson, were re-staged for BBC Radio 4 under the umbrella title The Missing Hancocks, with Kevin McNally taking the title role."]}, {"page": "Henry the Young King", "response": ["* He was also portrayed by Alan Cox (as a young boy), Dominic Savage (as a teenager) and Kevin McNally (as an adult) in the 1978 BBC TV series The Devil's Crown, which dramatised the reigns of his father and brothers."]}, {"page": "Johnny Depp", "response": ["In March 2021, City of Lies, which was originally scheduled for 2018, was released in theaters and streaming services. The same month, an online petition to bring Depp back to the Pirates franchise, begun four months earlier, reached its goal of 500,000 signatures. His Pirates co-star Kevin McNally also expressed support for Depp returning to the role. In July 2021, Andrew Levitas, the director of Minamata (2020), accused MGM of trying to bury the film due to Depp's involvement, with Depp claiming he is being boycotted by the Hollywood industry and calling his changed reputation an \"absurdity of media mathematics.\" Minamata was released in the UK and Ireland in August 2021, and in North America in December 2021. The film received positive reviews, with multiple publications praising Depp's performance as his best in years. Depp also continues as the face of Dior's men's fragrance, Sauvage."]}, {"page": "Dad (TV series)", "response": ["Dad is a BBC1 sitcom that ran for 13 episodes (each 30 minutes long) over two series and a Christmas special. Described by the BBC as a 'generation-gap comedy', it centered on the trials and tribulations of Alan Hook (Kevin McNally) and his father Brian (George Cole). Alan would often find himself getting increasingly frustrated with the endeavours of his father, whilst the world seemed to be forever against him.", "* Kevin McNally as Alan Hook", "During the second series, writer Andrew Marshall was convinced the show would go to a third series. Kevin McNally also believed they'd be doing the show for quite a while. However, after 13 episodes, and despite going from strength to strength, 'Dad' ended with a 1999 Christmas special. McNally commented that the show got 'somehow lost', and its cancellation was to do with a regime change at the BBC. George Cole believed the shows cancellation was down to focus groups that began to decide what TV shows should be axed.", "Both series one and two are available on DVD in Australia; they were released by 'Madman'. Both DVDs come with special features, one of which is an audio commentary from George Cole and Kevin McNally who discuss the show; it hasn't been released in the United States or UK, and it also isn't repeated on TV in these two countries."]}, {"page": "Savoy Theatre", "response": ["In 1993 Noël Coward's Relative Values, played at the theatre, having premièred there in 1951, an original run of 477 performances.Gaye, p. 1537 Tom Stoppard's Travesties, with Antony Sher was next, and in 1994 the musical She Loves Me played, with Ruthie Henshall and John Gordon Sinclair. These were followed by Terry Johnson's Dead Funny; Alan Ayckbourn's Communicating Doors (which transferred to the theatre in 1996), with Angela Thorne; J. B. Priestley's When We Are Married, with Dawn French, Alison Steadman, and Leo McKern; and Ben Travers' Plunder, with Griff Rhys Jones and Kevin McNally. In 1997 a group led by Sir Stephen Waley-Cohen was given management of the theatre by The Savoy Group. Productions that followed included Simon Callow in The Importance of Being Oscar; Pet Shop Boys in concert; Ian Richardson in Pinero's The Magistrate; Edward Fox in A Letter of Resignation; the Royal Shakespeare Company's production of Richard III, with Robert Lindsay; and Coward's Hay Fever, with Geraldine McEwan in 1999."]}, {"page": "2001 in film", "response": ["| Conspiracy || HBO Films || Frank Pierson (director); Loring Mandel (screenplay); Kenneth Branagh, Stanley Tucci, Colin Firth, Ian McNeice, Kevin McNally, David Threlfall, Ewan Stewart, Brian Pettifer, Nicholas Woodeson, Jonathan Coy, Brendan Coyle, Ben Daniels, Barnaby Kay, Owen Teale, Peter Sullivan, Tom Hiddleston, Ross O'Hennessy, Claire Bullus, Simon Markey, David Glover, David Willoughby, David Spinx, Dirk Martens, Andreas Guenther, Florian Panzner, Hinnerk Schonemann, Sebastian Jacob, Paul Bannon, Nick Brown, Rod Culbertson, Karl Moffatt, Terence Mustoo || Biography, Drama, History, War || Live action"]}, {"page": "2003 in film", "response": ["| Pirates of the Caribbean: The Curse of the Black Pearl || Walt Disney Pictures / Jerry Bruckheimer Films || Gore Verbinski (director); Ted Elliott, Terry Rossio (screenplay); Johnny Depp, Geoffrey Rush, Orlando Bloom, Keira Knightley, Jack Davenport, Jonathan Pryce, Kevin McNally, Lee Arenberg, Mackenzie Crook, Zoe Saldana, Martin Klebba, David Bailie,  Greg Ellis, Guy Siner, Damian O'Hare, Giles New, Angus Barnett, Michael Berry Jr., Isaac C. Singleton Jr., Michael Tighe, Trevor Goddard, Vanessa Branch || Action, Fantasy, Thriller || || Live Action", "| Johnny English || Universal Pictures / StudioCanal / Working Title Films || Peter Howitt (director); Neal Purvis, Robert Wade, William Davies (screenplay); Rowan Atkinson, John Malkovich, Ben Miller, Natalie Imbruglia, Oliver Ford Davies, Tim Pigott-Smith, Kevin McNally, Douglas McFerran, Steve Nicolson, Greg Wise, Tim Berrington, Prunella Scales, Tasha de Vasconcelos, Nina Young, Sam Beazley, Jenny Galloway, Chris Tarrant, Trevor McDonald || Comedy || || Live Action"]}, {"page": "1998 in film", "response": ["| Spice World || Columbia Pictures / PolyGram Filmed Entertainment / Icon Productions || Bob Spiers (director); Kim Fuller, Jamie Curtis (screenplay); Victoria Beckham, Melanie Brown, Emma Bunton, Melanie Chisholm, Geri Halliwell, Richard E. Grant, Alan Cumming, George Wendt, Mark McKinney, Claire Rushbrook, Roger Moore, Michael Barrymore, Richard Briers, Elvis Costello, David Fahm, Jason Flemyng, Neil Fox, Stephen Fry, Bob Geldof, Jools Holland, Bob Hoskins, Barry Humphries, Elton John, Craig Kelly, Hugh Laurie, Meat Loaf, Kevin McNally, Naoko Mori, Neil Mullarkey, Steven O'Donnell, Bill Paterson, Jonathan Ross, Jennifer Saunders, Simon Shepherd, Perdita Weeks, Dominic West || Comedy, Musical || Live action", "| Sliding Doors || Paramount Pictures / Miramax Films / Mirage Enterprises || Peter Howitt (director/screenplay); Gwyneth Paltrow, John Hannah, John Lynch, Jeanne Tripplehorn, Virginia McKenna, Zara Turner, Paul Brightwell, Nina Young, Kevin McNally, Christopher Villiers || Romance, Comedy, Drama || Live action"]}, {"page": "1999 in film", "response": ["| Entrapment || 20th Century Fox / Regency Enterprises || Jon Amiel (director); Ronald Bass, William Broyles Jr. (screenplay); Sean Connery, Catherine Zeta-Jones, Ving Rhames, Will Patton, Maury Chaykin, Kevin McNally, Terry O'Neill, Madhav Sharma, David Yip, Tim Potter, Rolf Saxon || Action, Romance || Live action", "| The Legend of 1900 || Fine Line Features || Giuseppe Tornatore (director/screenplay); Tim Roth, Pruitt Taylor Vince, Mélanie Thierry, Bill Nunn, Peter Vaughan, Niall O'Brien, Gabriele Lavia, Alberto Vazquez, Clarence Williams III, Sidney Cole, Kevin McNally, Harry Ditson, Adrian McCourt, Eamon Geoghegan || Drama || Live action"]}, {"page": "1987 in film", "response": ["| Cry Freedom || Universal Pictures || Richard Attenborough (director); John Briley (screenplay); Denzel Washington, Kevin Kline, Penelope Wilton, Alec McCowen, Kevin McNally, Ian Richardson, John Thaw, Timothy West, Josette Simon, John Hargreaves, Miles Anderson, Zakes Mokae, John Matshikiza || Epic, Drama || Live action"]}, {"page": "1992 in film", "response": ["| Stalin || HBO Pictures / MGM Television / Warner Bros. Television || Ivan Passer (director); Paul Monash (screenplay); Robert Duvall, Julia Ormond, Maximilian Schell, Jeroen Krabbé, Joan Plowright, Frank Finlay, Roshan Seth, Daniel Massey, András Bálint, John Bowe, Jim Carter, Murray Ewen, Stella Gonet, Ravil Isyanov, Colin Jeavons, Miriam Margoyles, Kevin McNally, Clive Merrison, Lisa Orgolini, Joanna Roth, Emil Wolk, Levani Uchaneischvili, Mátyás Usztics, Oleg Tabakov, Aleksandr Feklistov, Vladimir Gorushin, Olga Anokhina, Gulya Isyanov, Dora Dezseri, Robert Szilvasi, Natalya Kislitsyna, Vsevolod Larionov, Eugene Lazarev, Nikolai Lazarev, Irina Lazareva, Gene Ruby, Yelena Seropova, Stanislav Strelkov || Biography, Crime, Drama || Live action"]}, {"page": "1980 in film", "response": ["| The Long Good Friday || Paramount Pictures / Black Lion Films / HandMade Films / Calendar Productions || John Mackenzie (director); Barrie Keeffe (screenplay); Bob Hoskins, Helen Mirren, Bryan Marshall, Derek Thompson, Eddie Constantine, Dave King, P.H. Moriarty, Paul Freeman, Stephen Davies, Brian Hall, Paul Barber, Pauline Melville, Nigel Humphreys, Karl Howman, Gillian Taylforth, Dexter Fletcher, Pierce Brosnan, Daragh O'Malley, Kevin McNally || Gangster || Live action"]}, {"page": "1977 in film", "response": ["* Kevin McNally – The Spy Who Loved Me"]}, {"page": "Hancock's Half Hour", "response": ["Episodes 2, 5, 7, 8, 9 and 15 no longer exist. However, in April 2014 the BBC re-recorded \"The Hancock Festival\", selected by and recorded in the presence of Galton and Simpson, with Kevin McNally as Tony Hancock. The episode aired in November 2014, the sixtieth anniversary of its first airing. \"The Marriage Bureau\" was re-recorded in September 2015 and broadcast on 7 December 2015. \"The Department Store Santa\" was re-recorded on 3 September 2017 and broadcast in December 2018 as the first part of a fourth series of The Missing Hancocks. On 24 September 2017 \"Christmas at Aldershot\" was re-recorded for broadcast on Christmas Day 2019 along with \"The Christmas Eve Party\" which was broadcast on 21 December 2021. \"The Diamond Ring\" was re-recorded on 11 January 2019 and broadcast (in keeping with its Guy Fawkes theme) on 5 November 2019.", "Episodes 1, 2, 3, 4, 7, 10 and 12 (more than half the series, including all four of Harry Secombe's guest appearances) no longer exist. However, in April 2014 the BBC re-recorded \"The Matador\", selected by and recorded in the presence of Galton and Simpson with Kevin McNally as Tony Hancock, for broadcast around the sixtieth anniversary of its first airing.) On 2 December 2016 the BBC re-recorded \"A Holiday in France\" followed by \"The Race Horse\" and \"The Crown Jewels\" with Andy Secombe as his late father Harry. On 13 January 2019 \"Prime Minister Hancock\" was re-recorded for broadcast on 18 December that year. Also re-recorded was \"A Visit To Swansea\" which featured Tony being forced to go and thank Harry Secombe who'd returned to Wales.  The episode was littered with references to how good Secombe had been.  ", "Episodes 4, 5, 7, 9, 10, 11, 15 and 17 no longer exist. Only a short extract from episode 12 survives; this plus episodes 8 and 16 only survive in poor sound quality. However, in April 2014 the BBC re-recorded \"The New Neighbour\", \"The Breakfast Cereal\" and \"The Newspaper\", selected by and recorded in the presence of Galton and Simpson, with Kevin McNally as Tony Hancock. The episodes were broadcast in October & November 2014 to celebrate the sixtieth anniversary of their first airing. Episode 4 was rerecorded in August 2016."]}, {"page": "The A.B.C. Murders", "response": ["In 2018, an adaptation of the novel, written by Sarah Phelps, was filmed for the BBC. It was aired as a three-part miniseries over three consecutive days from 26 December that year. It starred John Malkovich as Hercule Poirot, and Rupert Grint as Inspector Crome with guest stars including Eamon Farren as Alexander Bonaparte Cust, Jack Farthing as Donald Fraser, Freya Mavor as Thora Grey, Kevin McNally as Inspector Japp, and Anya Chalotra as Lily Marbury."]}, {"page": "Johnny English", "response": ["* Kevin McNally as Tony Blair, Prime Minister of the United Kingdom"]}, {"page": "Inspector Japp", "response": ["A retired Japp is played by Kevin McNally in The ABC Murders (2018); the series starts with Japp dying of a heart attack, and a recurring sub-plot is Inspector Crome, Japp's protege, expressing distrust of Poirot as he feels that working with Poirot ruined Japp's career."]}, {"page": "Survivors (1975 TV series)", "response": ["The series' main actors included Carolyn Seymour (Abby), Lucy Fleming (Jenny), Ian McCulloch (Greg), and Denis Lill (Charles). The child actor Stephen Dudley (John) was given his part by his father, the show's producer Terence Dudley; while the child actress Tanya Ronder (who in series 1 and 2 played Lizzie) is the daughter of Jack Ronder, who wrote eight episodes of Survivors. In addition, the few appearances of Greg and Jenny's baby son Paul on Survivors saw Lucy Fleming's real-life son Diggory appear as Paul, although uncredited. Notable guest stars in the series included Patrick Troughton, Peter Jeffrey, Brian Blessed, George Baker, Philip Madoc, Bryan Pringle, Iain Cuthbertson, and Peter Bowles. Appearing in the series before becoming famous were Kevin McNally (Pirates of the Caribbean), Robert Fyfe (Last of the Summer Wine), Denis Lawson (Star Wars), David Neilson (Coronation Street), Peter Duncan (Blue Peter), June Brown (EastEnders), David Troughton, and Roger Lloyd-Pack (Only Fools and Horses and The Vicar of Dibley).", "* Kevin McNally as Jeff Kane (ep. 10)"]}, {"page": "Entrapment (film)", "response": ["* Kevin McNally as Haas"]}, {"page": "The Phantom of the Opera (2004 film)", "response": ["* Kevin McNally as Joseph Buquet"]}, {"page": "Pirates of the Caribbean: The Curse of the Black Pearl", "response": ["Principal photography began on October 9, 2002 and wrapped by March 7, 2003. The quick shoot was only marred by two accidents: as Jack Sparrow steals Interceptor, three of the ropes attaching it to Dauntless did not break at first, and when they did snap, debris hit Depp's knee, though he was not injured, and the way the incident played out on film made it look like Sparrow merely ducks. A more humorous accident was when the boat Sparrow was supposed to arrive in at Port Royal sank. In October, the crew was shooting scenes at Rancho Palos Verdes, by December they were shooting at Saint Vincent and the Grenadines, and in January they were at the cavern set at Los Angeles. The script often changed with Elliott and Rossio on set, with additions such as Gibbs (Kevin McNally) telling Will how Sparrow allegedly escaped from an island—strapping two turtles together with rope made of his back hair—and Pryce was written into the climactic battle to keep some empathy for the audience."]}, {"page": "Spooks (TV series)", "response": ["The second episode gained notoriety for the violent killing of character Helen Flynn (Lisa Faulkner), which drew the largest number of complaints to the Broadcasting Standards Commission in 2002.The Broadcasting Standards Commission receives 154 complaints after Helen Flynn's killing, Spy show draws record complaints BBC News, 17 July 2003 During an undercover operation Helen and Tom were captured by race riot instigator Robert Osborne, played by Kevin McNally, who tortured Helen with a deep fryer in an attempt to make Tom reveal classified information. He refused and she was killed. This provoked an angry reaction from many viewers who jammed BBC phone switchboards with complaints, despite the show airing after the 9 pm watershed.", "The programme was created by writer David Wolstencroft, and produced by Kudos for the BBC. A trademark style, coupled with the series' popularity, attracted a large number of high-profile guest stars. These included Martine McCutcheon, Hugh Laurie, Haluk Bilginer, Robert Hardy, Tim McInnerny, Bruce Payne, Reece Dinsdale, Ian McDiarmid, Ewen Bremner, Jimi Mistry, Andy Serkis, Benedict Cumberbatch, Kevin McNally, Rupert Graves, Andrew Tiernan, Anton Lesser, Anupam Kher, Alexander Siddig, and Anthony Head."]}, {"page": "Hay Fever (play)", "response": ["A 2012 revival at the Noël Coward Theatre included in the cast Lindsay Duncan as Judith, Jeremy Northam as Richard, Kevin McNally as David, Olivia Colman as Myra, Sam Callis as Sandy, Freddie Fox as Simon, Amy Morgan as Jackie, Phoebe Waller-Bridge as Sorrel, and Jenny Galloway as Clara. 2014 revivals included one at the Stratford Festival, in Canada, with Lucy Peacock as Judith, Cynthia Dale as Myra, and Tyrone Savage as Sandy; and a UK tour with Felicity Kendal as Judith, Simon Shepherd as David, Sara Stewart as Myra, Celeste Dodwell as Jackie, and Alice Orr-Ewing as Sorrel."]}, {"page": "Masada (miniseries)", "response": ["*Kevin McNally        – Norbanus"]}, {"page": "Noël Coward Theatre", "response": ["* Hay Fever (23 February 2012 – 2 June 2012) by Noël Coward starring Lindsay Duncan, Jeremy Northam, Kevin McNally and Olivia Colman"]}, {"page": "Drusus Julius Caesar", "response": ["He features under the name Castor in the novel I, Claudius by Robert Graves, and in its BBC adaptation (in which he was played by Kevin McNally)."]}, {"page": "Cry Freedom", "response": ["* Kevin McNally as Ken Robertson"]}, {"page": "De-Lovely", "response": ["* Kevin McNally as Gerald Murphy"]}, {"page": "Rab C. Nesbitt", "response": ["The series has featured guest appearances from the likes of Norman Lovett, Peter Mullan, Rikki Fulton, Mary Lee, Anita Dobson, Timothy Spall, Stanley Baxter, Kevin McNally, Clive Russell, Jerry Sadowitz, Viv Lumsden, Sylvester McCoy, Russell Hunter, Peter Capaldi and then-unknowns David Tennant, Ashley Jensen, Ford Kiernan, Greg Hemphill, Karen Dunbar, Jane McCarry and Paul Riley. Series 10 episode 2 notably featured an appearance by Scottish singer Susan Boyle who was the runner-up on Britain's Got Talent in 2009. The series was taken live on tour in 1991, known as Rab C. Nesbitt: In the Flesh, thus meaning that no new series was broadcast that year. A live recording of the tour was released on VHS in 1992 as Rab C. Nesbitt: Live. Two script books accompanying the series have also been released, alongside Rab's autobiography, a novel entitled A Stranger Here Myself."]}, {"page": "Pirates of the Caribbean: Dead Man's Chest", "response": ["* Kevin McNally as Joshamee Gibbs: The Black Pearl's first mate and Jack Sparrow's loyal friend, he once served in the Royal Navy under Lieutenant James Norrington."]}, {"page": "The Twin Dilemma", "response": ["Colin Baker also provides, uncredited, the voice of a Jacondan at Freighter Control in part three. Dennis Chinnery had previously appeared as Albert C. Richardson in the William Hartnell story The Chase and as Gharman in the Tom Baker story Genesis of the Daleks. Edwin Richfield had previously appeared as Captain Hart alongside Jon Pertwee's Doctor in The Sea Devils. Kevin McNally later played Henry in the audio play Spider's Shadow. Seymour Green had previously played Hargreaves in The Seeds of Doom. Helen Blatch had earlier been a voice artist in The Deadly Assassin."]}, {"page": "Enigma (1982 film)", "response": ["Enigma is a 1982 Anglo-American thriller film directed by Jeannot Szwarc\"Overview: 'Enigma'.\" Turner Classic Movies, 2019. Retrieved: August 17, 2019. and starring Martin Sheen, Sam Neill, Brigitte Fossey, and Kevin McNally. Based on Michael Barak's novel Enigma Sacrifice, the film centers on a CIA agent who tries to infiltrate Soviet intelligence in order to stop a murderous plot.Floyd 2004, p. 357.", "* Kevin McNally as Bruno, CIA"]}, {"page": "Conspiracy (2001 film)", "response": ["*Martin Luther (Kevin McNally), the obsequious Foreign Ministry's liaison to the SS", "* Kevin McNally as Martin Luther: Undersecretary and SS liaison, Foreign Ministry."]}, {"page": "The Long Good Friday", "response": ["* Kevin McNally as Irish youth"]}, {"page": "Martin Luther (diplomat)", "response": ["* In the 2001 HBO film Conspiracy, Luther is played by Kevin McNally."]}, {"page": "The Young Indiana Jones Chronicles", "response": ["Notable guest stars (playing either fictional or historical characters) include: Catherine Zeta-Jones, Daniel Craig, Christopher Lee, Clark Gregg, Tom Courtenay, Peter Firth, Vanessa Redgrave, Beata Pozniak, Jennifer Ehle, Elizabeth Hurley, Timothy Spall, Anne Heche, Paul Freeman, Jean-Pierre Castaldi, Jeffrey Wright, Jeroen Krabbé, Jason Flemyng, Michael Kitchen, Kevin McNally, Francisco Quinn, Ian McDiarmid, Max von Sydow, Douglas Henshall, Sean Pertwee, Vincenzo Nicoli, Terry Jones, Keith David, Lukas Haas, Frank Vincent, Jay Underwood, Michael Gough, Maria Charles, Elsa Zylberstein, Isaach de Bankolé, Emil Abossolo-Mbo, Haluk Bilginer and Saginaw Grant."]}, {"page": "Sliding Doors", "response": ["* Kevin McNally as Paul"]}, {"page": "Sophia Myles", "response": ["In 2021, Myles starred as Beth Barnes in the comedy-heist film Decrypted about the kidnap the creator of Bitcoin, alongside Amanda Abbington and Kevin McNally. In November 2021, she starred in the film All That Glitters playing a wealthy woman hiding the fact that she is domestically abused; a role that won her Best Actress at the New Renaissance Film Festival and the Gold Movie Awards respectively. In December 2021, Myles played Louise Campbell, Duchess of Argyll in the acclaimed BBC television mini-series A Very British Scandal with Claire Foy and Paul Bettany."]}, {"page": "The Legend of 1900", "response": ["* Kevin McNally"]}, {"page": "Play of the Month", "response": ["|Tom Courtenay,Michael Hordern,Alun Armstrong,Hilda Braid,Keith Chegwin,Kenneth Colley,Paul Copley,Christopher Guard,Brian Glover,Tony Haygarth,David Jackson,Kevin McNally,John Normington,Terry Scully,Nina Thomas,Raymond Westwell"]}, {"page": "Lindsay Duncan", "response": ["Duncan started 2012 as a guest in the New Year special of Absolutely Fabulous, playing the part of Saffy's favourite film actress, 'Jeanne Durand'. In February, she returned to the West End in Noël Coward's Hay Fever with Kevin McNally, Jeremy Northam and Olivia Colman, once again under the direction of Howard Davies. Later in 2012, Duncan featured in BBC2's productions of Shakespeare's history plays. She played the Duchess of York in the first film, Richard II, with David Suchet as the Duke of York and Patrick Stewart as John of Gaunt."]}, {"page": "Percy Alexander MacMahon", "response": ["In the movie The Man Who Knew Infinity Kevin McNally plays as MacMahon. The film accurately depicts the first meeting of MacMahon and Srinivasa Ramanujan, where Ramanujan successfully completes some mathematical calculations. Gian-Carlo Rota notes in his introduction to Volume I of MacMahon’s Collected Papers: "]}, {"page": "The Loneliness of the Long Distance Walker", "response": ["*Kevin McNally as Captain Mainwaring"]}, {"page": "Under Fire (Dad's Army)", "response": ["*Kevin McNally as Captain Mainwaring"]}]}}