{"wiki_id": "http://www.wikidata.org/entity/Q336911", "itemLabel": "Alf Morris", "itemDescription": "British politician (1928-2012)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alf_Morris", "wikipedia_page": {"main": "Alfred Morris, Baron Morris of Manchester,  (23 March 1928 – 12 August 2012) was a British Labour Co-operative politician and disability rights campaigner.", "link_mentions": [{"page": "August 12", "response": ["*  2012   – Alf Morris, English politician and activist (b. 1928)"]}, {"page": "Paul Goggins", "response": ["He served as a councillor in the City of Salford from 1990 to 1998. He was elected to the House of Commons at the 1997 general election for the newly created Wythenshawe and Sale East seat vacated by the retirement of Alf Morris, the former Labour MP for Manchester Wythenshawe. Goggins held the safe Labour seat with a majority of 15,019 and remained the MP there for almost 17 years. He made his maiden speech on 20 May 1997."]}, {"page": "List of political families in the United Kingdom", "response": ["*Alf Morris, Labour MP for Manchester Wythenshawe 1964–1997"]}, {"page": "Jack Ashley, Baron Ashley of Stoke", "response": ["He became a tireless campaigner for the disabled, especially the deaf and blind, and won broad cross-party sympathy, support and respect in parliament for his approach. In 1972, he sponsored the pivotal motion in the House of Commons making a distinction between legal and moral obligation. The success of this enabled The Sunday Times to continue its moral campaign for improved compensation for children disabled by thalidomide even while the parents' legal case was still technically in the courts. His Labour colleague Alf Morris (later Lord Morris of Manchester) was also a supporter. The editor of The Sunday Times, Harold Evans, later wrote in Good Times, Bad Times how Ashley selflessly gave up writing his autobiography so as to concentrate on the thalidomide campaign. He also campaigned for compensation for vaccine damage and for damage caused by the arthritis drug Opren. He became a Companion of Honour in the 1975 New Year Honours, and joined the Privy Council in 1979."]}, {"page": "David Sumberg", "response": ["Prior to his election to Westminster, he stood unsuccessfully for Manchester Wythenshawe in 1979, being beaten by Labour's Alf Morris. He had also been a Manchester City Councillor for Brooklands ward in Wythenshawe.  As an MP he acted as the Parliamentary Private Secretary for the Attorney General,  Sir Patrick Mayhew.'UK's laziest MEP' made two speeches in 4 years, The Independent, 2008-06-10  Retrieved 2014-11-21. He seconded the Loyal Humble Address of Ian Gow MP in November 1989; a privilege that was traditionally afforded only once to an MP. He held on to his seat in 1992 with a majority of 788 votes over Labour's Hazel Blears, making Bury South one of the most marginal in the country."]}, {"page": "Social model of disability", "response": ["There is a hint from before the 1970s that the interaction between impairment and society was beginning to be considered. British politician and disability rights campaigner Alf Morris wrote in 1969 (emphasis added):When the title of my Bill was announced, I was frequently asked what kind of improvements for the chronically sick and disabled I had in mind. It always seemed best to begin with the problems of access. I explained that I wanted to remove the severe and gratuitous social handicaps inflicted on disabled people, and often on their families and friends, not just by their exclusion from town and county halls, art galleries, libraries and many of the universities, but even from pubs, restaurants, theatres, cinemas and other places of entertainment ... I explained that I and my friends were concerned to stop society from treating disabled people as if they were a separate species.The history of the social model of disability begins with the history of the disability rights movement. Around 1970, various groups in North America, including sociologists, disabled people, and disability-focused political groups, began to pull away from the accepted medical lens of viewing disability. Instead, they began to discuss things like oppression, civil rights, and accessibility. This change in discourse resulted in conceptualizations of disability that was rooted in social constructions."]}, {"page": "Wythenshawe", "response": ["Manchester Wythenshawe was a parliamentary constituency created in 1950 and represented by Alf Morris of the Labour Party between 1964 and 1997. Before the 1997 election, the boundaries were redrawn and part of the neighbouring area of Sale included in the seat. The new constituency is called Wythenshawe and Sale East. In the same year, Alf Morris stepped down and was replaced by Paul Goggins. It is still considered a safe Labour seat, with Labour securing over 50% of the vote (and more than twice as many votes as its nearest rival) in the 1997, 2001 and 2005 elections. Labour kept the seat in the 2010 elections, though their share of the vote was decreased to 44.1%. In early 2014, following the death of Paul Goggins, a by-election was held. Labour candidate Mike Kane (a former Northenden councillor until 2008) won the seat with 55.3% of the vote, though voter turnout was low (28%). The 2017 general election saw the largest vote share for Labour in the history of both the current and former Wythenshawe seat with 62.2% of the vote and a 15,000 majority, though the 2019 election saw this fall back to approximate previous levels with a majority of 10,396 and a 53.3% share of the vote."]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| Alf Morris"]}, {"page": "List of MPs elected in the 1964 United Kingdom general election", "response": ["Notable newcomers to the House of Commons included Geoffrey Howe, Roy Hattersley, Shirley Williams, Peter Shore, Robert Maxwell, Brian Walden, Alan Williams, Anthony Meyer, Alf Morris, George Younger and Bernard Weatherill.", "| Alf Morris"]}, {"page": "List of MPs elected in the 1966 United Kingdom general election", "response": ["| Alf Morris"]}, {"page": "List of disability rights activists", "response": ["* Alf Morris – introduced the Chronically Sick and Disabled Persons Act and first \"Minister for the Disabled\" in Great Britain or anywhere else"]}, {"page": "Alfred Morris, Baron Morris of Manchester", "response": ["#REDIRECT Alf Morris"]}, {"page": "1994 Labour Party leadership election", "response": ["| Alf Morris || Blair || Beckett"]}, {"page": "Chelsea and Fulham (UK Parliament constituency)", "response": ["In the early 1960s the Chelsea Labour Party (old boundaries) created the National Campaign for the Young Chronic Sick, led by constituency member (Mr) Marsh Dickson, which generated national TV and newspaper coverage leading to the Chronically Sick and Disabled Persons Act 1970 promoted as a Private Members Bill by Alf Morris MP."]}, {"page": "List of Labour Party (UK) MPs", "response": ["* Alf Morris, Manchester Wythenshawe, 1964–1997"]}, {"page": "List of Labour Co-operative MPs", "response": ["* Alf Morris, Manchester Wythenshawe, 1964–1997"]}, {"page": "Alfred Morris", "response": ["* Alf Morris (1928–2012), British Labour Co-operative politician and disability campaigner"]}, {"page": "Charles Morris (British politician)", "response": ["His brother, Alf Morris, was Labour Co-operative MP for Manchester Wythenshawe from 1964 to 1997, and was created a life peer as Baron Morris of Manchester."]}, {"page": "Manchester Wythenshawe (UK Parliament constituency)", "response": ["| 1964 || Alf Morris || Labour"]}, {"page": "Alfred Morris, Baron Morris", "response": ["#REDIRECT Alf Morris"]}, {"page": "Baron Morris of Manchester", "response": ["#REDIRECT Alf Morris"]}, {"page": "Lord Morris of Manchester", "response": ["#REDIRECT Alf Morris"]}, {"page": "Labour government, 1974–1979", "response": ["|Under-Secretary of State, Disabled Industry||Alf Morris||11 March 1974 – 4 May 1979|| "]}, {"page": "1928 in the United Kingdom", "response": ["**Alf Morris, politician (died 2012)"]}, {"page": "1994 Labour Party deputy leadership election", "response": ["| Alf Morris || Tony Blair || Margaret Beckett"]}, {"page": "Alf (name)", "response": ["* Alf Morris (1928–2012), Baron Morris of Manchester, British politician and disability campaigner"]}]}}