{"wiki_id": "http://www.wikidata.org/entity/Q336379", "itemLabel": "Robert Vansittart, 1st Baron Vansittart", "itemDescription": "British diplomat (1881-1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Vansittart,_1st_Baron_Vansittart", "wikipedia_page": {"main": "Robert Gilbert Vansittart, 1st Baron Vansittart,  (25 June 1881 – 14 February 1957), known as Sir Robert Vansittart between 1929 and 1941, was a senior British diplomat in the period before and during the Second World War. He was Principal Private Secretary to the Prime Minister from 1928 to 1930 and Permanent Under-Secretary at the Foreign Office from 1930 to 1938 and later served as Chief Diplomatic Adviser to the British Government. He is best remembered for his opposition to appeasement and his strong stance against Germany during and after the Second World War. Vansittart was also a published poet, novelist and playwright.", "link_mentions": [{"page": "Robert Vansittart", "response": ["*Robert Vansittart, 1st Baron Vansittart (1881–1957), British diplomat"]}, {"page": "Robert G. Vansittart", "response": ["#REDIRECT Robert Vansittart, 1st Baron Vansittart"]}, {"page": "List of Old Etonians born in the 19th century", "response": ["* Robert Vansittart, 1st Baron Vansittart (1881–1957)"]}, {"page": "Sir Robert Vansittart", "response": ["#REDIRECT Robert Vansittart, 1st Baron Vansittart"]}, {"page": "Robert Gilbert Vansittart, Baron Vansittart", "response": ["#REDIRECT Robert Vansittart, 1st Baron Vansittart"]}, {"page": "Luckington", "response": ["* Guy N Vansittart (1893–1989), younger brother of diplomat Robert Vansittart, 1st Baron Vansittart, was a director of General Motors Ltd on the continent and managed their HQ in London from 1938. He lived at Luckington Court in the 1940s, and was recruited into \"Z” Network and the SOE, headed by Claude Dansey. The Z organisation was supposed to operate independently of British embassies and thus avoid the attention of foreign internal security agencies. He moved to London post-war, continuing his career with General Motors and died in 1989.The Vansittart brothers"]}, {"page": "Sonderweg", "response": ["* Robert Vansittart, 1st Baron Vansittart"]}, {"page": "British People's Party (1939)", "response": ["After the outbreak of the Second World War the BPP was involved in British Union of Fascists-led initiatives to forge closer links between the disparate groups on the far right, although in private Oswald Mosley had a low opinion of the BPP, dismissing Beckett as a \"crook\", Tavistock as \"woolly headed\" and Greene as \"not very intelligent\". Beckett's internment under Defence Regulation 18B in 1940 saw the party go into hibernation, although it was not subject to any government ban. The patronage of Lord Tavistock, who succeeded to the dukedom of Bedford in 1940, ensured that the BPP was exempted from proscription. The group was briefly involved in a clandestine alliance with A.K. Chesterton's National Front After Victory in 1944, a group that also attracted the interest of J.F.C. Fuller, Henry Williamson, Jeffrey Hamm, William Morris, 1st Viscount Nuffield and Lymington (who had succeeded his father as Earl of Portsmouth in the meantime) amongst others. However, the movement was scuppered when it was infiltrated by the Board of Deputies of British Jews, who fed information to Robert Vansittart, 1st Baron Vansittart, whose speech about the dangers of a revival of fascism led to a crackdown on such movements."]}, {"page": "Vincent Square", "response": ["*Robert Vansittart, 1st Baron Vansittart"]}]}}