{"wiki_id": "http://www.wikidata.org/entity/Q336344", "itemLabel": "Cosmo Gordon Lang", "itemDescription": "British archbishop and clergyman (1864-1945)", "wikipedia_url": "https://en.wikipedia.org/wiki/Cosmo_Gordon_Lang", "wikipedia_page": {"main": "William Cosmo Gordon Lang, 1st Baron Lang of Lambeth,  (31 October 1864 – 5 December 1945) was a Scottish Anglican prelate who served as Archbishop of York (1908–1928) and Archbishop of Canterbury (1928–1942). His elevation to Archbishop of York, within 18 years of his ordination, was the most rapid in modern Church of England history. As Archbishop of Canterbury during the abdication crisis of 1936, he took a strong moral stance, his comments in a subsequent broadcast being widely condemned as uncharitable towards the departed king.\nThe son of a Scots Presbyterian minister, Lang abandoned the prospect of a legal and political career to train for the Anglican priesthood. Beginning in 1890, his early ministry was served in slum parishes in Leeds and Portsmouth, except for brief service as Vicar of the University Church of St Mary the Virgin in Oxford. In 1901 he was appointed suffragan Bishop of Stepney in London, where he continued his work among the poor. He also served as a canon of St Paul's Cathedral, London.\nIn 1908 Lang was nominated as Archbishop of York, despite his relatively junior status as a suffragan rather than a diocesan bishop. His religious stance was broadly Anglo-Catholic, tempered by the liberal Anglo-Catholicism advocated in the Lux Mundi essays. He consequently entered the House of Lords as a Lord Spiritual and caused consternation in traditionalist circles by speaking and voting against the Lords' proposal to reject David Lloyd George's 1909 \"People's Budget\". This radicalism was not maintained in subsequent years. At the start of the First World War, Lang was heavily criticised for a speech in which he spoke sympathetically of the German Emperor. This troubled him greatly and may have contributed to the rapid ageing which affected his appearance during the war years. After the war he began to promote church unity and at the 1920 Lambeth Conference was responsible for the Church's Appeal to All Christian People. As Archbishop of York he supported controversial proposals for the 1928 revision of the Book of Common Prayer but, after acceding to Canterbury, he took no practical steps to resolve this issue.\nLang became Archbishop of Canterbury in 1928. He presided over the 1930 Lambeth Conference, which gave limited church approval to the use of contraception. After denouncing the Italian invasion of Abyssinia in 1935 and strongly condemning European anti-semitism, Lang later supported the appeasement policies of the British government. In May 1937 he presided over the coronation of King George VI and Queen Elizabeth. On retirement in 1942 Lang was raised to the peerage as Baron Lang of Lambeth and continued to attend and speak in House of Lords debates until his death in 1945. Lang himself believed that he had not lived up to his own high standards. Others have praised his qualities of industry, his efficiency and his commitment to his calling.", "link_mentions": [{"page": "Archbishop of Canterbury", "response": ["* 1928–1942: Cosmo Gordon Lang", "| Cosmo Gordon Lang"]}, {"page": "York", "response": ["* Cosmo Gordon Lang: 1928."]}, {"page": "1945", "response": ["* December 5 – Cosmo Gordon Lang, Archbishop of Canterbury (b. 1864)"]}, {"page": "1932", "response": ["* January 8 – In England the Archbishop of Canterbury, Cosmo Gordon Lang, forbids Anglican church remarriage of divorced persons."]}, {"page": "Weapon of mass destruction", "response": ["The first use of the term \"weapon of mass destruction\" on record is by Cosmo Gordon Lang, Archbishop of Canterbury, in 1937 in reference to the aerial bombardment of Guernica, Spain:"]}, {"page": "All Souls College, Oxford", "response": ["* Cosmo Gordon Lang, 1st Baron Lang of Lambeth (1888),\"Sir William Anson \" Archbishop of Canterbury", "* Cosmo Gordon Lang"]}, {"page": "Wentworth Woodhouse", "response": ["King George V and Queen Mary visited South Yorkshire from 8 to 12 July 1912, and stayed at Wentworth Woodhouse for four days. The house party consisted of a large number of guests, including: Dr Cosmo Gordon Lang, the then-Archbishop of York; The 5th Earl of Harewood and The Countess of Harewood; The Marchioness of Londonderry; The 1st Marquess of Zetland and Lady Zetland; The 10th Earl of Scarborough and Lady Scarborough; The 5th Earl of Rosse and Lady Rosse; Admiral Lord Charles Beresford and Lady Mina Beresford; Mr Walter Long and Lady Doreen Long; and Lord Helmsley and Lady Helmsley."]}, {"page": "Bishopthorpe", "response": ["Bishopthorpe has a long history of notable ecclesiastical residents. The latest Archbishop of York is Stephen Cottrell, who has been resident since July 2020 when he succeeded John Sentamu. Many of the streets in Bishopthorpe are named after previous Archbishops: for example, Ramsey Avenue (Michael Ramsey, 1956–1961), Maclagan Road (William Maclagan, 1891–1908), Lamplugh Crescent (Thomas Lamplugh, 1688–1691), Coggan Way (Donald Coggan, 1961–1974), Garbett Way (Cyril Garbett, 1942–1955), Temple Road (William Temple, 1929–1942), Lang Road (Cosmo Gordon Lang, 1909 – 1928), Vernon Close (Edward Venables-Vernon, 1808–1847, Drummond Way (Robert Hay Drummond, 1761–1776), Wolsley Drive (Thomas Wolsey, 1514–1530) and De Grey Place (Walter de Gray, 1216–1255)."]}]}}