{"wiki_id": "http://www.wikidata.org/entity/Q336852", "itemLabel": "Jonathan Guinness, 3rd Baron Moyne", "itemDescription": "British peer (born 1930)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Guinness,_3rd_Baron_Moyne", "wikipedia_page": {"main": "Jonathan Bryan Guinness, 3rd Baron Moyne (born 16 March 1930), is a British peer and businessman. A member of the Guinness family, he is the elder of the two sons of Bryan Guinness, 2nd Baron Moyne, and his first wife Diana Mitford (later Lady Mosley), and until his retirement was a merchant banker for Messrs Leopold Joseph.", "link_mentions": [{"page": "Diana Mitford", "response": ["She was survived by her four sons: Desmond Guinness; Jonathan Guinness, 3rd Baron Moyne; Alexander and Max Mosley. Her stepson Nicholas Mosley was a novelist who also wrote a critical memoir of his father for which Diana reportedly never forgave him, despite their previously close relationship. A great-granddaughter, Jasmine Guinness, a great-niece, Stella Tennant, a granddaughter, Daphne Guinness, and a grandson, Tom Guinness, are models."]}, {"page": "Conservative Monday Club", "response": ["*Jonathan Guinness, 3rd Baron Moyne"]}, {"page": "Caroline, Princess of Hanover", "response": ["Caroline was romantically linked to many famous men, including Mark Shand, the younger brother of Camilla, Duchess of Cornwall; Guillermo Vilas; Sebastian Taylor, who had previously dated Princess Elizabeth of Yugoslavia; Jonathan Guinness, the son of Jonathan Guinness, 3rd Baron Moyne; Henri Giscard d'Estaing, the son of former President of France Valéry Giscard d'Estaing; and French singer Philippe Lavil. Following her divorce from Philippe Junot, she was briefly engaged to Robertino Rossellini, the son of Roberto Rossellini and Ingrid Bergman. Between her second and third marriages, Caroline had a relationship with French actor Vincent Lindon."]}, {"page": "List of barons in the peerages of Britain and Ireland", "response": ["#*Jonathan Guinness, 3rd Baron Moyne"]}, {"page": "List of political families in the United Kingdom", "response": ["*****Jonathan Guinness, 3rd Baron Moyne, grandson of Walter through Bryan Guinness, 2nd Baron Moyne, candidate in the 1973 Lincoln by-election and 1976 Coventry North West by-election"]}, {"page": "Max Mosley", "response": ["Max Mosley was born on 13 April 1940 in London, in the early years of the Second World War. His father was Sir Oswald Mosley and his mother was Diana, Lady Mosley, one of the Mitford sisters. In addition to his older full-brother Alexander, Mosley had five older half-siblings. On his father's side, they included the novelist Nicholas Mosley, 3rd Baron Ravensdale (1923–2017). On his mother's side they were the merchant banker Jonathan Guinness, 3rd Baron Moyne (born 1930), and the Irish preservationist Desmond Guinness (1931 - 2020).Jones (2004), pp. 23, 71, 75. He was a nephew of Deborah Cavendish, Duchess of Devonshire and first cousin of Peregrine Cavendish, 12th Duke of Devonshire.  He was also third cousin of Winston Churchill MP, the grandson of the British prime minister and fifth cousin of Queen Elizabeth The Queen Mother."]}, {"page": "Jonathan Guinness", "response": ["#REDIRECT Jonathan Guinness, 3rd Baron Moyne"]}, {"page": "Stavros Niarchos", "response": ["**Spyros (b. 1955) married 1987 (divorced 1999) the Hon. Daphne Guinness (b. 1967), daughter of Jonathan Guinness, 3rd Baron Moyne by his second wife Suzanne Lisney, and had issue three children: Nicolas Stavros Niarchos (b. 1989), Alexis Spyros Niarchos (b. 1991) and Ines Niarchos (b. 1995). Spyros is a good friend of Prince Ernst August of Hanover, and was best man at his wedding to Princess Caroline of Monaco."]}, {"page": "Guinness family", "response": ["********Jonathan Guinness, 3rd Baron Moyne (born 1930)"]}, {"page": "Desmond Guinness", "response": ["His brother is Jonathan Guinness, 3rd Baron Moyne. He was the older half-brother (on his mother's side) of Max Mosley, former President of the FIA."]}]}}