{"wiki_id": "http://www.wikidata.org/entity/Q3369949", "itemLabel": "Patrick Weston Joyce", "itemDescription": "Irish historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Patrick_Weston_Joyce", "wikipedia_page": {"main": "Patrick Weston Joyce, commonly known as P. W. Joyce (1827 – 7 January 1914) was an Irish historian, writer and music collector, known particularly for his research in Irish etymology and local place names of Ireland.\n\n", "link_mentions": [{"page": "Taoiseach", "response": ["\"\" (\"More of Cloyne\") is a traditional air collected by Patrick Weston Joyce in 1873. \"Amhrán Dóchais\" (\"Song of Hope\") is a poem written by Osborn Bergin in 1913. John A. Costello chose the air as his musical salute. The salute is played by army bands on the arrival of the Taoiseach at state ceremonies. Though the salute is often called \"\", Brian Ó Cuív argues \"\" is the correct title."]}, {"page": "Geography of Ireland", "response": ["* The Origin and History of Irish names of Places, Patrick Weston Joyce, three volumes, Dublin, 1869, 1875, 1913."]}, {"page": "Tribes of Galway", "response": ["* Patrick Weston Joyce (1827 – November 1914) historian, writer, and music collector"]}, {"page": "Brigid of Kildare", "response": ["In liturgical iconography and statuary Saint Brigid is often depicted holding a reed cross, a crozier of the sort used by abbots, and a lamp. Early hagiographers portray Brigid's life and ministry as touched with fire. According to Patrick Weston Joyce, tradition holds that nuns at her monastery kept an eternal flame burning there. Leitmotifs, some of them borrowed from the apocrypha such as the story where she hangs her cloak on a sunbeam, are associated with the wonder tales of her hagiography and folklore. Cogitosus' circa 650 Vita Sanctae Brigidae portrays Brigid as having the power to multiply such things as butter, bacon and milk, to bestow sheep and cattle, and to control the weather.Ó Ríordáin, J. J., The Music of What Happens: Celtic Spirituality (Dublin: Columba Press / Winona, MN: Saint Mary's Press, 1996), p. 86."]}, {"page": "Trevor Joyce", "response": ["Born in Dublin, Ireland, in 1947, Joyce was brought up between Mary Street, in the city centre, and the Galway Gaeltacht. Galway is the ancestral home of both his mother's and father's families, and Patrick Weston Joyce, historian, writer and collector of Irish music, and Robert Dwyer Joyce, poet, writer and fellow collector of music, are numbered among his great-granduncles.Goodby, John, \"'Through My Dream': Trevor Joyce's Translations\", Études Irlandaises, 35:2 (Automne 2010), 149–64. Recent poems such as \"Trem Neul\" see Joyce appropriate elements of the folk music gathered by Patrick Weston Joyce and engage ideas of lineage and transmission."]}, {"page": "Monaghan", "response": ["The Irish name Muineachán derives from a diminutive plural form of the Irish word muine meaning \"brake\" (a thickly overgrown area) or sometimes \"hillock\". The Irish historian and writer Patrick Weston Joyce interpreted this as \"a place full of little hills or brakes\".Joyce, Patrick Weston (1870), Irish Local Names Explained. Monaghan County Council's preferred interpretation is \"land of the little hills\", a reference to the numerous drumlins in the area."]}, {"page": "Joyce (name)", "response": ["*Patrick Weston Joyce (1827–1914), Irish author and brother of Robert Dwyer Joyce"]}, {"page": "Carrauntoohil", "response": ["Carrauntoohil is the most common and official spelling of the name, being the only version in use by Ordnance Survey Ireland, the Placenames Database of Ireland, and by Irish academic Paul Tempan, compiler of the Irish Hill and Mountain Names database (2010). Carrauntoohill has also been used in the past, for example by Irish historian Patrick Weston Joyce in 1870. Other less common spelling variations have included Carrantoohil, Carrantouhil, Carrauntouhil and Carrantuohill; all of which are anglicisations of the Irish placename.", "Paul Tempan's Irish Hill and Mountain Names database notes that \"its name is shrouded in uncertainty\", and that \"Unlike some lesser peaks, such as Mangerton or Croagh Patrick, it is not mentioned in any surviving early Irish texts\". The official Irish name is , which Tempan notes is interpreted as \"Tuathal's sickle\", Tuathal being a male first name. Patrick Weston Joyce previously interpreted it as \"inverted sickle\", translating from the Irish language term  meaning left-handed but according to PWJ, \"is applied to everything reversed from its proper direction\". From yet another perspective, one of the earliest written accounts of the mountain by Isaac Weld in 1812, calls it Gheraun-Tuel, and Samuel Lewis's Topographical Dictionary of Ireland (1837) calls it Garran Tual; suggesting the first element was  ('fang')—which is found in the names of other Kerry mountains—and that the earlier name may have been  ('Tuathal's fang')."]}, {"page": "Eblana", "response": ["Eblana () is the name of an ancient Irish settlement which appears in the Geographia of Claudius Ptolemaeus (Ptolemy), the Greek astronomer and cartographer, around the year 140 AD. It was traditionally believed by scholars to refer to the same site as the modern city of Dublin.E.g. in Thomas Osmond Summers, ed. Dublin: an historical sketch of Ireland's metropolis, 1852, etc., and in Patrick Weston Joyce, The Origin and History of Irish Names of Places, 2 vols. 1869 (vol. I:79 in the 7th ed., 1901). For example, the 19th-century writer Louis AgassizAgassiz, Bibliographia zoologiæ et geologiæ: A general catalogue of all books, tracts and memoirs on zoology and geology, 1848, vol.1:74. used Eblana as a Latin equivalent for Dublin. More recent scholarship however favours the north County Dublin seaside village of LoughshinnyDarcy, R.; Flynn, William: \"Ptolemy's map of Ireland: a modern decoding.\" Irish Geography 41/1 (March 2008), pp. 49–69 due to its proximity to Drumanagh, an important trading site with strong links to Roman Britain; it has even been described as a bridgehead of a possible Roman invasion. There is no definitive proof to tie Eblana with any location, however, so its exact identity is still a matter of speculation."]}, {"page": "1914 in Ireland", "response": ["*7 January – Patrick Weston Joyce, historian and musicologist (born 1827)."]}, {"page": "Irish folk music (1900–1949)", "response": ["* 1909 Old Irish Folk Music by Patrick Weston Joyce (1827–1949"]}, {"page": "Niall of the Nine Hostages", "response": ["* Patrick Weston Joyce, A Social History of Ancient Ireland, Vol. I and A Social History of Ancient Ireland, Vol. II. Longmans, Green, and Co. 1903."]}, {"page": "Mongfind", "response": ["According to Cormac's Glossary,ed. 1868 she was a goddess the pagan Irish worshipped on Samhain. This was also called the Féile Moingfhinne i.e. \"Festival of Mongfind\". Later legend, as documented in Patrick Weston Joyce's Social History of Ancient Ireland, makes her a banshee. A prominent hill called Cnoc Samhna (\"Hill of Samhain\")Placenames Database of Ireland or Ard na Ríoghraidhe (\"Height of the Kingfolk\") in County Limerick is associated with a tale linked to Mongfind. \"Anocht Oíche Shamhna Moingfhinne banda\" is children's rhyme from County Waterford which translates as \"Tonight is the eve of Samhain of Mongfhionn the goddess\".  "]}, {"page": "Derry/Londonderry name dispute", "response": ["The earliest Irish name for the site of the modern city was , Old Irish for \"oak wood of Calgach\", after an unknown pagan.Lacey 1990, p.10 John Keys O'Doherty, the Roman Catholic Bishop of Derry from 1889 to 1907, sought to identify Calgach with Agricola's opponent Calgacus, whereas Patrick Weston Joyce says Calgach, meaning \"fierce warrior\", was a common given name. A Celtic Christian monastery was founded at  in the sixth century;Lacey 1990, pp.15,19 Adomnán names Saint Columba as founder. The name was changed to Daire Coluimb Chille, \"oak wood of Columba\", first mentioned in the Annals of Ulster for 1121.Lacey 1990, p.34 As the monastic site grew in prominence, the name was reduced to just Doire (now pronounced ). This was later anglicised to Derry.  In 1604, \"Derrie\" was granted its first royal charter as a city and county corporate by James I of England.Lacey 1990, pp.76–7 The settlement was destroyed in 1608 by Cahir O'Doherty, Irish chieftain of Inishowen.Lacey 1990, pp.78–9 "]}, {"page": "List of Irish historians", "response": ["* Patrick Weston Joyce1827-1914"]}, {"page": "Colcannon", "response": ["Colcannon is most commonly made with only four ingredients: potatoes, butter, milk and cabbage (or kale). Irish historian Patrick Weston Joyce defined it as \"potatoes mashed with butter and milk, with chopped up cabbage and pot herbs\". It can contain other ingredients such as scallions (spring onions), leeks, laverbread, onions and chives. Some recipes substitute cabbage for kale. There are many regional variations of this staple dish. It was a cheap, year-round food. It is often eaten with boiled ham, salt pork or Irish bacon. As a side dish it goes well with corned beef and cabbage."]}, {"page": "List of Limerick people", "response": ["*Patrick Weston Joyce, historian, music-collector, onomastician, and lexicographer"]}]}}