{"wiki_id": "http://www.wikidata.org/entity/Q336881", "itemLabel": "Melvyn Bragg", "itemDescription": "British broadcaster and author (born 1939)", "wikipedia_url": "https://en.wikipedia.org/wiki/Melvyn_Bragg", "wikipedia_page": {"main": "Melvyn Bragg, Baron Bragg,  (born 6 October 1939), is an English broadcaster, author and parliamentarian. He is best known for his work with ITV as editor and presenter of The South Bank Show (1978–2010), and for the BBC Radio 4 documentary series In Our Time.\nEarlier in his career, Bragg worked for the BBC in various roles including presenter, a connection that resumed in 1988 when he began to host Start the Week on Radio 4. After his ennoblement in 1998, he switched to presenting the new In Our Time, an academic discussion radio programme, which has run to over 900 broadcast editions and is a popular podcast. He was Chancellor of the University of Leeds from 1999 until 2017.", "link_mentions": [{"page": "A Modest Proposal", "response": ["* A Modest Proposal BBC Radio 4 In Our Time with Melvyn Bragg"]}, {"page": "Anatomy", "response": ["* Anatomy, In Our Time. BBC Radio 4. Melvyn Bragg with guests Ruth Richardson, Andrew Cunningham and Harold Ellis."]}, {"page": "Ecclesiastes", "response": ["* The passage in chapter 3, with its repetition of \"A time to ...\" has been used as a title in many other cases, including the novels A Time to Dance by Melvyn Bragg and A Time to Kill by John Grisham, the records ...And a Time to Dance by Los Lobos and A Time to Love by Stevie Wonder, and films A Time to Love and a Time to Die, A Time to Live and A Time to Kill."]}, {"page": "Epistolary novel", "response": ["* BBC Radio 4's 15 March 2007 edition of In Our Times, \"Epistolary Literature\". Hosted by Melvyn Bragg."]}, {"page": "Eric Clapton", "response": ["In an interview from October 1976 with Sounds magazine, Clapton said that he did not \"know much about politics\" and said of his immigration speech that \"I just don't know what came over me that night. It must have been something that happened in the day but it came out in this garbled thing.\" In a 2004 interview with Uncut, Clapton referred to Powell as \"outrageously brave\". He said that the UK was \"inviting people in as cheap labour and then putting them in ghettos\". In 2004, Clapton told an interviewer for Scotland on Sunday, \"There's no way I could be a racist. It would make no sense.\" In his 2007 autobiography, Clapton said he was \"oblivious to it all\". In a December 2007 interview with Melvyn Bragg on The South Bank Show, Clapton said he was not a racist but still believed Powell's comments were relevant."]}, {"page": "Erasmus", "response": ["* In Our Time podcast from BBC Radio 4 with Melvyn Bragg, and guests Diarmaid MacCulloch, Eamon Duffy, and Jill Kraye."]}, {"page": "Individualist anarchism", "response": ["Pierre-Joseph Proudhon was the first philosopher to label himself an \"anarchist\".\"Anarchism\", BBC Radio 4 program, In Our Time, Thursday December 7, 2006. Hosted by Melvyn Bragg of the BBC, with John Keane, Professor of Politics at University of Westminster, Ruth Kinna, Senior Lecturer in Politics at Loughborough University, and Peter Marshall, philosopher and historian. Some consider Proudhon to be an individualist anarchist while others regard him to be a social anarchist.Bowen, James & Purkis, Jon. 2004. Changing Anarchism: Anarchist Theory and Practice in a Global Age. Manchester University Press. p. 24Knowles, Rob. \"Political Economy from below : Communitarian Anarchism as a Neglected Discourse in Histories of Economic Thought\". History of Economics Review, No.31 Winter 2000. Some commentators do not identify Proudhon as an individualist anarchist due to his preference for association in large industries, rather than individual control.Woodcock, George. Anarchism: A History of Libertarian Ideas and Movements, Broadview Press, 2004, p. 20 Nevertheless, he was influential among some of the American individualists—in the 1840s and 1850s, Charles Anderson DanaDana, Charles A. Proudhon and his \"Bank of the People\"  (1848). and William Batchelder Greene introduced Proudhon's works to the United States. Greene adapted Proudhon's mutualism to American conditions and introduced it to Benjamin Tucker.Tucker, Benjamin R., \"On Picket Duty\", Liberty (Not the Daughter but the Mother of Order) (1881–1908); 5 January 1889; 6, 10; APS Online p. 1"]}, {"page": "Multiverse", "response": ["* Multiverse – Radio-discussion on BBC Four with Melvyn Bragg"]}, {"page": "October 6", "response": ["*1939 – Melvyn Bragg, English journalist, author, and academic"]}, {"page": "Poincaré conjecture", "response": ["*\"The Poincaré Conjecture\" – BBC Radio 4 programme In Our Time, 2 November 2006. Contributors June Barrow-Green, Lecturer in the History of Mathematics at the Open University, Ian Stewart, Professor of Mathematics at the University of Warwick, Marcus du Sautoy, Professor of Mathematics at the University of Oxford, and presenter Melvyn Bragg."]}, {"page": "Søren Kierkegaard", "response": ["Kierkegaard had a profound influence on psychology. He is widely regarded as the founder of Christian psychology and of existential psychology and therapy. Existentialist (often called \"humanistic\") psychologists and therapists include Ludwig Binswanger, Viktor Frankl, Erich Fromm, Carl Rogers, and Rollo May. May based his The Meaning of Anxiety on Kierkegaard's The Concept of Anxiety. Kierkegaard's sociological work Two Ages: The Age of Revolution and the Present Age critiques modernity. Ernest Becker based his 1974 Pulitzer Prize book The Denial of Death on the writings of Kierkegaard, Freud and Otto Rank. Kierkegaard is also seen as an important precursor of postmodernism. Danish priest Johannes Møllehave has lectured about Kierkegaard. In popular culture, he was the subject of serious television and radio programmes; in 1984, a six-part documentary, Sea of Faith, presented by Don Cupitt, featured an episode on Kierkegaard, while on Maundy Thursday in 2008, Kierkegaard was the subject of discussion of the BBC Radio 4 programme presented by Melvyn Bragg, In Our Time, during which it was suggested that Kierkegaard straddles the analytic/continental divide. Google honoured him with a Google Doodle on his 200th anniversary. The novel Therapy by David Lodge details a man experiencing a mid-life crisis and becoming obsessed with the works of Kierkegaard."]}, {"page": "Trojan War", "response": ["* BBC audio podcast Melvyn Bragg interviews Edith Hall and others on historicity, history and archaeology of the war. []"]}, {"page": "Talk radio", "response": ["Some notable British talk radio presenters include Jenni Murray, John Humphrys, Martha Kearney, Jonathan Dimbleby, Libby Purves, Laurie Taylor, Pam Ayres, Melvyn Bragg, Tommy Boyd, James Whale, Steve Allen, Nick Abbot, Iain Lee, James Stannage, George Galloway, Julia Hartley-Brewer, Ian Collins, John Nicoll, Brian Hayes, Scottie McClue, James O'Brien, Nicky Campbell, and Simon Mayo. Pete Price on CityTalk is also known as the DJ who rushed to the aid of a regular caller who died live on air during a call. Previously, he had kept a teenager talking for 45 minutes before meeting him to convince him not to commit suicide."]}, {"page": "Ted Hughes", "response": ["In October 2015, the BBC Two major documentary Ted Hughes: Stronger Than Death examined Hughes's life and work. The programme included contributions from poets Simon Armitage and Ruth Fainlight, broadcaster Melvyn Bragg, biographers Elaine Feinstein and Jonathan Bate, activist Robin Morgan, critic Al Alvarez, publicist Jill Barber, friend Ehor Boyanowsky, patron Elizabeth Sigmund, friend Daniel Huws, Hughes's US editor Frances McCullough and younger cousin Vicky Watling. His daughter Frieda spoke for the first time about her father and mother."]}, {"page": "Wolfgang Pauli", "response": ["* Pauli exclusion principle with Melvyn Bragg, Frank Close, Michela Massimi, Graham Farmelo \"In Our Time 6 April 2017\""]}, {"page": "1939", "response": ["* October 6 - Melvyn Bragg, Baron Bragg, English broadcaster, Parliamentarian and author (The South Bank Show"]}, {"page": "William Tyndale", "response": ["* 2013, The Most Dangerous Man in Tudor England, BBC Two, 60-minute documentary written and presented by Melvyn Bragg"]}, {"page": "Keep the Aspidistra Flying", "response": ["For an edition of the BBC Television show Omnibus, (The Road to the Left, broadcast 10 January 1971), Melvyn Bragg interviewed Norman Mailer. Bragg said he \"just assumed Mailer had read Orwell. In fact he's mad on him.\" Of Keep the Aspidistra Flying Mailer said : \"It is perfect from the first page to the last.\"Radio Times 9–15 January 1971"]}, {"page": "Laurence Olivier", "response": ["In 1948 Olivier led the Old Vic company on a six-month tour of Australia and New Zealand. He played Richard III, Sir Peter Teazle in Sheridan's The School for Scandal and Antrobus in Thornton Wilder's The Skin of Our Teeth, appearing alongside Leigh in the latter two plays. While Olivier was on the Australian tour and Richardson was in Hollywood, Esher terminated the contracts of the three directors, who were said to have \"resigned\". Melvyn Bragg in a 1984 study of Olivier, and John Miller in the authorised biography of Richardson, both comment that Esher's action put back the establishment of a National Theatre for at least a decade. Looking back in 1971, Bernard Levin wrote that the Old Vic company of 1944 to 1948 \"was probably the most illustrious that has ever been assembled in this country\". The Times said that the triumvirate's years were the greatest in the Old Vic's history; as The Guardian put it, \"the governors summarily sacked them in the interests of a more mediocre company spirit\"."]}, {"page": "Philip Larkin", "response": ["Larkin turned sixty in 1982. This was marked most significantly by a collection of essays entitled Larkin at Sixty, edited by Anthony Thwaite and published by Faber and Faber.Thwaite 1982. There were also two television programmes: an episode of The South Bank Show presented by Melvyn Bragg in which Larkin made off-camera contributions, and a half-hour special on the BBC that was devised and presented by the Labour Shadow Cabinet Minister Roy Hattersley.Motion 1993, p. 494.", "In 1982, as part of the celebrations for his sixtieth birthday, Larkin was the subject of The South Bank Show. Although Larkin declined the invitation to appear in the programme, he recorded (on audio tape) \"a lot of poems\"Thwaite 1992, p. 651 specifically for it. Melvyn Bragg commented, in his introduction to the programme, that the poet had given his full cooperation. The programme, broadcast on 30 May, featured contributions from Kingsley Amis, Andrew Motion and Alan Bennett. Bennett was also filmed reading several Larkin poems a few years later, in an edition of  Poetry in Motion, broadcast by Channel 4 in 1990."]}]}}