{"wiki_id": "http://www.wikidata.org/entity/Q336850", "itemLabel": "Michael Nazir-Ali", "itemDescription": "Bishop of Rochester (born 1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Nazir-Ali", "wikipedia_page": {"main": "Michael James Nazir-Ali (Urdu:  مائیکل نذیر علی; born 19 August 1949) is a Pakistani-born British Catholic priest and former Anglican prelate who served as the 106th Bishop of Rochester from 1994 to 2009 and, before that, as Bishop of Raiwind in Pakistan. He is currently the director of the Oxford Centre for Training, Research, Advocacy and Dialogue. In 2021, he was received into the Catholic Church and was ordained as a priest for the Ordinariate of Our Lady of Walsingham on 30 October 2021. He is a dual citizen of Pakistan and Britain.", "link_mentions": [{"page": "August 19", "response": ["*1949 – Michael Nazir-Ali, Pakistani-English bishop"]}, {"page": "St Edmund Hall, Oxford", "response": ["File:Michael Nazir-Ali.jpg|Bishop Michael Nazir-Ali"]}, {"page": "Lambeth Conference", "response": ["In 2008, four Anglican primates announced that they intended to boycott the Lambeth conference because of their opposition to the actions of Episcopal Church in the USA (the American province of the Anglican Communion) in favour of homosexual clergy and same-sex unions. These primates represent the Anglican provinces of Nigeria, Uganda, Kenya and Rwanda. In addition, Peter Jensen, Archbishop of Sydney, Australia and Michael Nazir-Ali, Bishop of Rochester, among others announced their intentions not to attend."]}, {"page": "Christian Peoples Alliance", "response": ["The party had more success in 2006, gaining two more council seats in Canning Town. In the following year, the party had two members elected at parish council level for Aston cum Aughton in the Metropolitan Borough of Rotherham. In the same year, it also gained encouragement from Scottish Catholic bishops Keith O'Brien and Philip Tartaglia for its social stances, including its stance on marriage, rights for unborn children and supporting the Church in the adoption debate. The party also defended the Anglican bishop Michael Nazir-Ali after comments he made in the media regarding Islam.- "]}, {"page": "Ridley Hall, Cambridge", "response": ["*Michael Nazir-Ali"]}, {"page": "List of Catholic priests", "response": ["*Michael Nazir-Ali – Former prominent Anglican bishop who became Catholic and was ordained a priest on the 30th of October, 2021"]}, {"page": "List of converts to Catholicism", "response": ["*Michael Nazir-Ali: Anglican Bishop of Rochester from 1994 to 2009. Currently the director of the Oxford Centre for Training, Research, Advocacy and Dialogue. Converted to Catholicism in 2021, ordained a priest for the Anglican Ordinariate"]}, {"page": "List of University of Cambridge people", "response": ["*Michael Nazir-Ali (Ridley Hall/Fitzwilliam), Bishop of Rochester"]}, {"page": "Anglican Church of Southern Africa", "response": ["Bethlehem Nopece, Bishop of Port Elizabeth, has been the leading name of the Anglican realignment in the province since he strongly opposed the consecration of partnered homosexual Gene Robinson as a bishop of the Episcopal Church in 2003. Nopece was the only bishop of the ACSA to have attended the Global Anglican Future Conference that took place in Jerusalem on 23–28 June 2008. He decided the following year to launch the Fellowship of Confessing Anglicans in South Africa after the resolution on 22 August 2009 of the Anglican Diocese of Cape Town to pass pastoral guidelines to members of the church who live in same-sex unions. Nopece presided at the launching of the Fellowship of Confessing Anglicans at St. John's Church, Port Elizabeth, on 3 September 2009, with the presence of a retired Anglican Archbishop of Kenya, Benjamin Nzimbi. The event was greeted with messages of support from some of the leading names of the Anglican realignment, archbishops Peter Akinola of the Church of Nigeria, Peter Jensen of the Anglican Diocese of Sydney, Robert Duncan of the Anglican Church in North America and Bishop Michael Nazir-Ali of the Church of England. Nopece led a 10 members delegation, which included Bishop Nathaniel Nakwatumbah of the Anglican Diocese of Namibia, to the GAFCON II that took place at Nairobi, Kenya, on 21–26 October 2013. Bishop Nopece led once again the province's delegation to GAFCON III, held in Jerusalem, on 17–22 June 2018, comprised by 18 members, 16 from South Africa, Bishop Vicente Msosa, of the Anglican Diocese of Niassa, as the only delegate from Mozambique, and another one from Namibia."]}, {"page": "Michael Scott-Joynt", "response": ["In 2003, he was (unexpectedly at the time) signatory to an open letter from 17 Church of England bishops opposing the nomination of Jeffrey John, an openly gay priest in a long-term relationship, as suffragan bishop-designate of Reading.Telegraph – And suspicion begat spite, back-stabbing and schism The other nine diocesan bishop signatories were: Michael Langrish (Exeter), Michael Nazir-Ali (Rochester), Peter Forster (Chester), James Jones (Liverpool), George Cassidy (Southwell & Nottingham), Graham Dow (Carlisle), John Hind (Chichester) and David James (Bradford).Frost's Meditations – Nazir-Ali "]}, {"page": "Christianity in Pakistan", "response": ["When Pakistan was created on 14 August 1947, the organization and activities of the Christian community changed drastically; the Catholic Union of India granted independence to its branches in Sind and Baluchistan in its Second Annual General Meeting in Bangalore in October 1947. Some Christians in Punjab and Sindh had been quite active after 1945 in their support for Muhammad Ali Jinnah's Muslim League. Even before the final phase of the movement, leading Indian Christians like Pothan Joseph had rendered valuable services as journalists and propagandists of the Muslim League. Jinnah had repeatedly promised all citizens of Pakistan complete equality of citizenship, but this promise was not kept by his successors. Pakistan became an Islamic Republic in 1956, making Islam the source of legislation and cornerstone of the national identity, while guaranteeing freedom of religion and equal citizenship to all citizens. In the mass population exchanges that occurred between Pakistan and India upon independence due to conflict between Muslims and followers of Indian religions, most Hindus and nearly all Sikhs fled the country. Pakistani Punjab is now over 2% Christian, with very few Hindus and Sikhs left. Christians have made some contributions to the Pakistani national life. Pakistan's first non-Muslim Chief Justice of Pakistan Supreme Court was Justice A. R. Cornelius. Pakistani Christians also distinguished themselves as great fighter pilots in the Pakistan Air Force. Notable amongst them are Cecil Chaudhry, Peter O'Reilly and Mervyn L Middlecoat. Christians have also contributed as educationists, doctors, lawyers and businessmen. One of Pakistan's cricketers, Yousuf Youhana, was born Christian, but later converted to Islam, taking the Islamic name Mohammad Yousuf. In Britain, the bishop emeritus of Rochester Michael Nazir-Ali is a Pakistani Christian."]}, {"page": "Church Mission Society", "response": ["Notable general secretaries of the society later in the 20th century were Max Warren and John Vernon Taylor. The first woman president of the CMS, Diana Reader Harris (serving 1969–1982), was instrumental in persuading the society to back the 1980 Brandt Report on bridging the North-South divide. In the 1990s CMS appointed its first non-British general secretary, Michael Nazir-Ali, who later became Bishop of Rochester in the Church of England, and its first women general secretary, Diana Witts. Gillian Joynson-Hicks was its president from 1998 to 2007.", "* 1989 to 1994: Michael Nazir-Ali"]}, {"page": "Anglican Network in Canada", "response": ["The Anglican Network in Canada has received strong support from several members of the Anglican Communion, such as the former Bishop of Rochester in the Church of England, Michael Nazir-Ali, who spoke at the 2010 Anglican Network synod at St. Paul University and at St. Peter & St. Paul's Anglican Church (formerly St. George's Anglican Church) in Ottawa, Ontario.Letters of support for Anglican Network in Canada November 22–23, 2007 . Anglicannetwork.ca. Retrieved 25 November 2010. Support has been received from other leaders in the Anglican Communion, including from the Global South (Anglican) Primates."]}, {"page": "Caroline Cox, Baroness Cox", "response": ["Since 2009, Baroness Cox has participated in a conservative umbrella body within the Church of England, the Federation of Confessing Anglicans, led by her close associate, then Bishop of Rochester Michael Nazir-Ali.", "Cox has been a supporter of Syria's President Bashar Assad. She visited him during the Syrian Civil War, during the siege of Aleppo, along with Michael Nazir-Ali, fellow crossbench peer Lord Hylton, and Andrew Ashdown, an Anglican vicar.  She was widely condemned. Labour MP John Woodcock, vice-president of the All Party Parliamentary Group on Syria, said: \"It is shocking to see a British parliamentarian giving international pariah al-Assad a photo opportunity to distract from the brutal and ongoing slaughter he is perpetrating on Syrian families. Whatever good intentions this British delegation has will fail; their presence at this man's side can only strengthen him as his campaign of terror continues.\" Liberal Democrat peer Baroness Hussein-Ece said it was \"shameful\" for members of the House of Lords to \"sit down for a chat with a mass murderer and a war criminal\".British peers and priests accused of 'chatting with mass murderer' after meeting Assad in Syria, Daily Telegraph, 5 September 2016 Russian state media claimed Cox said that Assad had an “openness for the development of civil society, democracy and change”.Former British archbishop meets top Assad adviser in Damascus, Middle East Eye, 28 November 2017 After her visit, in early 2017, she went to the US to lobby for president Assad's government.A British Baroness Wants To Rekindle Donald Trump's Affection For Bashar Assad, Huffington Post, May 2017 While there, she expressed doubt that Syrian government forces were responsible for Khan Shaykhun chemical attack."]}]}}