{"wiki_id": "http://www.wikidata.org/entity/Q336414", "itemLabel": "Wayland Young, 2nd Baron Kennet", "itemDescription": "British Baron (1923-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/Wayland_Young,_2nd_Baron_Kennet", "wikipedia_page": {"main": "Wayland Hilton Young, 2nd Baron Kennet (2 August 1923 – 7 May 2009) was a British writer and politician, notably concerned with planning and conservation. As a Labour minister, he was responsible for setting up the Department of the Environment and the Royal Commission on Environmental Pollution. Later he joined the SDP. He lost his seat in the Lords, following the House of Lords Act 1999.", "link_mentions": [{"page": "Wayland Hilton Young, 2nd Baron Kennet", "response": ["#REDIRECT Wayland Young, 2nd Baron Kennet"]}, {"page": "See Emily Play", "response": ["The song was reportedly about a girl named Emily, who Barrett claimed to have seen while sleeping in the woods after taking a psychedelic drug. According to A Saucerful of Secrets: The Pink Floyd Odyssey, by Nicholas Schaffner, Emily is the Honourable Emily Young,Biography , Emily Young Sculpture. daughter of Wayland Young, 2nd Baron Kennet and nicknamed \"the psychedelic schoolgirl\" at the UFO Club. Bassist Roger Waters later said the woods mentioned in the song were based next to the Gog Magog Hills near Cambridge."]}, {"page": "1923 in the United Kingdom", "response": ["** Wayland Young, 2nd Baron Kennet, writer and politician (died 2009)"]}, {"page": "Carlton in Lindrick", "response": ["*Kathleen Scott, Baroness Kennet, English sculptor (born Kathleen Bruce, 1878–1947), was born in Carlton as the youngest child of the Anglican rector. She married Captain Robert Falcon Scott, Antarctic explorer, and was mother to the artist, ornithologist and painter Peter Scott. Her son by her second husband, politician and writer Hilton Young, 1st Baron Kennet, was Wayland Young, 2nd Baron Kennet, also a politician and writer."]}, {"page": "2009 in the United Kingdom", "response": ["**Wayland Young, 2nd Baron Kennet, writer and politician (b. 1923)"]}, {"page": "Wayland Young", "response": ["#REDIRECT Wayland Young, 2nd Baron Kennet"]}, {"page": "Deaths in May 2009", "response": ["*Wayland Young, 2nd Baron Kennet, 85, British politician and writer.Lord Kennet"]}, {"page": "Prohibition of Female Circumcision Act 1985", "response": ["The Prohibition of Female Circumcision Act 1985 (c. 38) is a repealed Act of the Parliament of the United Kingdom. It made female genital mutilation a crime throughout the UK, allowing for sentences of up to five years' imprisonment.S. 1(2) It was introduced to the House of Lords by Wayland Young, 2nd Baron Kennet, and passed on 16 July 1985, coming into force two months later.S. 4"]}]}}