{"wiki_id": "http://www.wikidata.org/entity/Q3368570", "itemLabel": "Pat Moss", "itemDescription": "British racing driver (1934-2008)", "wikipedia_url": "https://en.wikipedia.org/wiki/Pat_Moss", "wikipedia_page": {"main": "Patricia Ann \"Pat\" Moss-Carlsson (née Moss; 27 December 1934 – 14 October 2008) was one of the most successful female auto rally drivers of all time, achieving three outright wins and seven podium finishes in international rallies. She was crowned European Ladies' Rally Champion five times (1958, 1960, 1962, 1964–65). Her older brother Stirling Moss was a Formula One Grand Prix star during the 1950s.  From 1963 until her death in 2008, Swedish rally driver Erik Carlsson was both her driving-partner and her husband.She is the author of a memoir The Story So Far (1967) and, with her husband, co-author of The Art and Technique of Driving (1965).", "link_mentions": [{"page": "Mini", "response": ["| 1962 || Pat Moss || Ann Wisdom || Ladies' Award", "|  Pat Moss", "|  Pat Moss"]}, {"page": "Stirling Moss", "response": ["Moss was born in London, son of Alfred Moss, a dentist of Bray, Berkshire, and Aileen (née Craufurd). His grandfather was Jewish, from a family that changed their surname from Moses to Moss. He was brought up at Long White Cloud house on the south bank of the River Thames. His father was an amateur racing driver who had come 16th in the 1924 Indianapolis 500. Aileen Moss had also been involved in motorsport, entering prewar hillclimbs at the wheel of a Singer Nine. Stirling was a gifted horse rider as was his younger sister, Pat Moss, who became a successful rally driver in her own right and also married Swedish rally driver Erik Carlsson."]}, {"page": "Erik Carlsson", "response": ["Carlsson was born in Trollhättan. Erik Carlsson married Pat Moss on 9 July 1963Mr Saab, The Tale of Erik Carlsson \"on the roof\", page 9.  in London. Pat was also a famous rally driver and younger sister of Stirling Moss. On 1 December 1969 they had a daughter, Susie Carlsson, who was later to become successful in show jumping.", "In 1965 Pat Moss and Erik Carlsson wrote a book: The Art and Technique of Driving (published by Heinemann, London, selling for 25 shillings). This book was translated into Dutch, German, Japanese and Spanish. "]}, {"page": "Berkeley Cars", "response": ["The SE328 enjoyed considerable success and press exposure through their involvement with lightweight motor racing, and their famous drivers included Pat Moss who drove one in the 1958 Liège-Brescia-Liège rally for cars up to 500 cc. The Berkeley team – a works-supported entry of six cars including BBC commentator Robin Richards – led as far as Slovenia, but slow climbing in summer heat found their weakness and Pat ended up being towed back to Italy by another Berkeley.  None of the Berkeleys finished the event."]}, {"page": "Michèle Mouton", "response": ["Mouton states that in her mind she did not try to beat her male rivals, but to be at their level. She noted that in rallying the quickest elapsed time is the most important thing. David Evans of Autosport described her as \"motorsport's most successful ever female driver\". Rally journalist and historian Graham Robson credits Mouton, along with Pat Moss, as \"the driver by whom all other females measure their skills and achievements\".Robson 2008, p. 50. Mouton and Moss were of different eras and did not compete directly against each other, although they both appeared at the 1973 Monte Carlo Rally where Mouton co-drove. In 1985, they swapped cars in a private test session with Moss driving the Quattro and Mouton an Austin-Healey 3000. Stirling Moss regarded Mouton as \"one of the best\", and Niki Lauda described her as a \"superwoman\"."]}, {"page": "Austin A40 Farina", "response": ["In the January 1959 Monte Carlo Rally driven by Pat Moss and Ann Wisdom the A40 won the Coupe des Dames, Houbigant Cup, RAC Challenge Trophy and Souvenir Award, \"L'Officiel de la Couture\" and was 2nd in class for standard series production touring cars up to 1000 cc. The little car was 10th in General Classification.The Times, 26 January 1959"]}, {"page": "Moss (surname)", "response": ["*Pat Moss (1934–2008), British rally driver"]}, {"page": "Paddy Hopkirk", "response": ["He finished third at the 1962 Monte Carlo Rally in a Sunbeam Rapier. However, Hopkirk was becoming frustrated by the Rapier's lack of reliability, culminating in all three works cars blowing their engines within the space of a kilometre at that year's Acropolis Rally. After being impressed by a test drive of Pat Moss' Austin-Healey 3000, he set his mind on a move, joining the British Motor Corporation and making his debut in a 3000 at the Liège-Sofia-Liège rally in August. In his second competition with the 3000, the RAC Rally, he finished in second despite having to complete two miles of a special stage with a shredded tyre after a puncture. He first competed in a Mini at the 1963 Monte Carlo Rally, where he finished sixth. That season he also finished second on the Tulip Rally, sixth on Liège-Sofia-Liège, and fourth on the RAC Rally. In addition he took the Mini to third place in the Tour de France Automobile's Touring Category behind two 3.8-litre Jaguars, winning his class and the overall on handicap."]}, {"page": "Alfred Moss", "response": ["Moss became a successful London dentist, and from his mid-twenties he was also an enthusiastic competition driver, beginning his racing career at the Essex Motor Club's Winter Trial in 1921 driving a 1000 cc AV cyclecar. He was disqualified for seeking help after his rear tyres had burst twice. His AV later caught fire in Park Lane, and Moss then acquired a GN cyclecar, with which he enjoyed success in trials and hillclimbs, and which he raced at Brooklands. In 1922, he bought and began to race a Crouch Le Mans sports car which had no front brakes.Stuart Turner, Harnessing Horsepower: The Pat Moss Carlsson Story, p. 6 In the 1924 Indianapolis 500, he placed 14th or 16th (sources differ) in a Fronty Ford.P. R. H. Newsome, \"Alfred Moss, the Dentist Who Became a Champion Race-Car Driver\" in Bulletin of the History of Dentistry (American Academy of the History of Dentistry, 1988), pp. 22–25", "Moss met his future wife, Aileen Craufurd, at Brooklands. She had been an ambulance driver in the First World War, and also did some racing. They were married at St Marylebone in 1928\"MOSS Alfred E\t/ Craufurd Nora A\" in Register of Marriages for Marylebone Registration District, vol. 1a (1928), p. 1041 and were the parents of the Formula One driver Stirling Moss and the rallying champion Pat Moss."]}, {"page": "1934 in the United Kingdom", "response": ["* 27 December – Pat Moss, racing driver (died 2008)"]}, {"page": "Pat Moss-Carlsson", "response": ["#REDIRECT Pat Moss"]}, {"page": "List of family relations in auto racing", "response": ["|Pat Moss", "|Brothers-in-law; Erik Carlsson married Stirling Moss' sister Pat Moss"]}, {"page": "European Rally Championship", "response": ["|  Pat Moss", "|  Pat Moss", "|  Pat Moss", "|  Pat Moss", "|  Pat Moss"]}, {"page": "2008 in the United Kingdom", "response": ["** Pat Moss, racing driver, daughter of Alfred Moss (born 1934)"]}, {"page": "List of professional sports families", "response": ["|Stirling Moss, Pat Moss", "| Pat Moss"]}, {"page": "Austin-Healey Sebring Sprite", "response": ["No less than 7 Sebring Sprites contested the long-distance races at Sebring in 1961. Five Healey-prepared BMC works cars were driven by Ed Leavens, Briggs Cunningham, Dick Thompson, Bruce McLaren and Walt Hansgen. There were also two of John Sprinzel's striking coupes, piloted by one of the top-rated Grand Prix drivers of all time, Stirling Moss, together with his sister Pat Moss, Britain's most successful woman rally driver. The Sebring Sprites finished in six of the top eight places in the 4-hour race for one-litre homologated GT cars. In the 12-hour race, Sebring Sprites were driven by Ed Leavens, John Colgate, Joe Buzetta, Glenn Carlson, Cyril Simson and future F1 driver Paul Hawkins to strong performances, finishing 2nd, 3rd and 4th in the 1150cc sports (prototype) class and 15th and 25th and 37th overall."]}, {"page": "Deaths in October 2008", "response": ["*Pat Moss, 73, British rally driver, sister of Stirling Moss, cancer."]}, {"page": "Unsinkable Seven", "response": ["Factory teams and drivers soon began to arrive, and the likes of the future husband and wife Pat Moss and Erik Carlsson competing in the event.", "Pat Moss in her Renault 16 retired when she crashed into a stone barrier erected by locals in Uganda. Timo Mäkinen rolled his BMC 1800 before he reached Uganda; teammate Aaltonen, although he placed third at Kampala, failed to reach Nairobi. Rally leader Vic Preston in a semi-factory Ford Cortina Mk. II was excluded for missing passage control. Meanwhile, Joginder Singh in a factory Datsun Cedric led the twenty-one survivors but fell to fifth after engine problems slowed him down. Howard Lawrence-Brown in his Triumph 2000 regained the lead at Mombasa but by the time he reached Dar es Salaam, German born local Peter Huth in his Cortina overtook him."]}, {"page": "Tulip Rally", "response": ["|  Pat Moss"]}, {"page": "List of Desert Island Discs episodes (1961–1970)", "response": ["|||Pat Moss||James Bond novels by Ian Fleming||Bed|| more"]}, {"page": "Alpine Rally", "response": ["The Coupe des Alpes was awarded 166 times from 1938 to 1971. Recipients included Mike Hawthorn (1952), Jean Rédélé (1954), Pat Moss (1960 and 1962), Rauno Aaltonen (1963 and 1964), Erik Carlsson (1964), Vic Elford (1964), Tony Fall (1965), Timo Mäkinen (1965), Lucien Bianchi (1966), Roger Clark (1966), Jean-Pierre Nicolas (1966 and 1969), Harry Källström (1967 and 1969), Jean-Claude Andruet (1969) and Bernard Darniche (1971)."]}, {"page": "Tommy Wisdom", "response": ["Thomas Henry Wisdom (16 February 1906 – 12 November 1972http://www.driverdb.com/drivers/tom-wisdom/) was a British motoring correspondent for the Daily Herald. He was also a racing driver who took part in numerous races and rallies.Harnessing Horsepower: The Pat Moss Carlsson story, S. Turner, Veloce Publishing, 2011, p.29", "Wisdom was born in Brighton.  His wife Elsie (known as \"Bill\") was also a racing driver, and their daughter Ann Wisdom competed in International rallies, most notably as Pat Moss's co-driver.http://speedqueens.blogspot.nl/2010/07/elsie-wisdom.htmlhttp://www.goodwood.co.uk/members-meeting/news-and-coverage/articles/cocktails,-cakes-and-a-racing-heroine-called-bill-.aspxFast Ladies – Female Racing Drivers 1888–1970, J-F. Bouzanquet, Veloce Publishing, 2009, p.84  Tommy Wisdom, died in Birmingham, aged 66."]}, {"page": "List of female World Rally Championship drivers", "response": ["|align=left|  Pat Moss-Carlssonhttps://www.ewrc-results.com/profile/51206-pat-moss-carlsson/1"]}, {"page": "Ann Wisdom", "response": ["During the late 1950s and early 1960s, she was well known as a navigator for Pat Moss, the sister of Sir Stirling Moss. Their partnership ensured them to compete at the same level as the men. In 1962, she ended her rally career in order to start a family, marrying the gentleman rally driver, Peter Riley. Pat bounced back, hiring erstwhile driver Pauline Mayman to navigate.", "In 1962, shortly after retiring, she married rally driver Peter Riley in Worthing and remained married until her death on October 14, 2015, exactly seven years after the death of Pat Moss. Peter died just under a year later, in July 2016."]}, {"page": "Valerie Domleo", "response": ["During the 1960s, she competed in European Rally Championship events, mainly as co-driver to numerous lady drivers of that period, including Rosemary Smith, Pat Moss, Pauline Mayman and Anne Hall. With Anne Hall she won the Ladies Award in the 1960 RAC Rally and the 1961 Monte Carlo Rally."]}, {"page": "1955 Internationale Tulpenrallye", "response": ["|  Pat Moss"]}, {"page": "Elizabeth Nyström", "response": ["Nyström's father was a keen auto rally driver, and the 1960s she was map reader first for her father, and eventually for rally driver Pat Moss."]}, {"page": "Ewy Rosqvist-von Korff", "response": ["She won the European Championship in 1959, 1960 and 1961, the latter shared with Pat Moss. She won the ladies' classification in Midnattssolsrallyt (\"Rally to the Midnight Sun\", now called Rally Sweden) from 1959 to 1962."]}, {"page": "Ursula Wirth", "response": ["Wirth and Rosqvist won the Coupe des Dames at the 1963 Monte Carlo rally. Wirth worked with English driver Pat Moss in 1964, and left racing in 1965, but taught driving for almost thirty years in Stockholm. In 1969, she appeared in the film Monte Carlo or Bust!."]}]}}