{"wiki_id": "http://www.wikidata.org/entity/Q336845", "itemLabel": "Thomas Humphrey Paget", "itemDescription": "British engraver", "wikipedia_url": "https://en.wikipedia.org/wiki/Humphrey_Paget", "wikipedia_page": {"main": "Thomas Humphrey Paget OBE (13 August 1893 – 30 April 1974) was an English medal and coin designer and modeller. \nPaget's designs are indicated by the initials 'HP'.\n\nPaget was first approached by the Royal Mint in 1936 after the accession of King Edward VIII. Paget's recommendation had come via his earlier design for the obverse of a medal featuring the then-Prince of Wales. After some controversy regarding the direction the monarch was to face on the coinage (it had been tradition for each successive monarch to face in the opposite direction to the predecessor, but the King felt that the features of his left were better than his right), Paget's work was approved in two slightly differing designs: one for silver and another for non-silver. However Edward's abdication meant that, apart from a few trial pieces, Paget's designs never reached the minting stage. Some did find their way out of the Mint for testing purposes, and as such have become amongst the rarest and most collectable pieces of all sterling coinage.\nA measure of the success of the Edward portrait can be seen in the fact that Paget alone was commissioned to design George VI's effigy in 1937. He is the only artist to have a second obverse design approved for use in sterling coinage in the 20th century. The portrait of George VI has since been described as \"the classic coinage head of the 20th century\".Although principally known as an obverse designer, Paget carried out some work for reverses, including most famously a design featuring the Elizabethan galleon the Golden Hind. Originally intended for the halfcrown, it was adopted for the halfpenny in 1937 where it remained until it was withdrawn in 1969 (in readiness for decimalisation in 1971).He was awarded the O.B.E. (Civil) in the King's Birthday Honours of 1948. His O.B.E. was gazetted in the Supplement to The London Gazette, Number 38311 [1], Page 3377, published on 4 June 1948.\nPaget later designed a wide variety of issues for both Commonwealth and non-Commonwealth countries. Notable amongst his later work included an effigy of King Faisal II of Iraq in 1955 and the 1970 Commonwealth Games medal which featured the Duke of Edinburgh. He also produced an effigy of Queen Elizabeth II for a commemorative Isle of Man issue in 1965.\nPaget's work remains part of current sterling circulation: his 1970 portrait of the Duke of Edinburgh appears on the reverse of a 2017 commemorative five pound coin.", "link_mentions": {}}}