{"wiki_id": "http://www.wikidata.org/entity/Q336580", "itemLabel": "Gerald Grosvenor, 6th Duke of Westminster", "itemDescription": "British billionaire landowner, businessman and Territorial Army officer (1951-2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gerald_Grosvenor,_6th_Duke_of_Westminster", "wikipedia_page": {"main": "Major General Gerald Cavendish Grosvenor, 6th Duke of Westminster,  (22 December 1951 – 9 August 2016), was a British landowner, businessman, philanthropist, Territorial Army general, and peer. He was the son of Robert Grosvenor, 5th Duke of Westminster, and Viola Lyttelton. He was Chairman of the property company Grosvenor Group. In the first ever edition of The Sunday Times Rich List, published in 1989, he was ranked as the second richest person in the United Kingdom, with a fortune of £3.2 billion (approximately £8.14 billion in today's value), with only The Queen above him.\nBorn in Northern Ireland, Grosvenor moved from an island in the middle of Lower Lough Erne to be educated at Sunningdale and Harrow boarding schools in the south of England. After a troubled education, he left school with two O-levels. He entered the Royal Military Academy, Sandhurst, and served in the Territorial Army, where he was promoted to major-general in 2004.\nVia Grosvenor Estates, the business he inherited along with the dukedom in 1979, the Duke was the richest property developer in the United Kingdom and one of the country's largest landowners, with property in Edinburgh, Liverpool, Oxford, Cambridge, Southampton and Cheshire, including the family's country seat of Eaton Hall, as well as 300 acres (0.47 sq mi) of Mayfair and Belgravia in Central London. The business also has interests in other parts of Europe. According to The Sunday Times Rich List in 2016, the Duke was worth £9.35 billion, placing him sixth in the list and making him the third-richest British citizen.\nThe Duke died on 9 August 2016 after suffering a heart attack. The title then passed to his son, Hugh.", "link_mentions": [{"page": "August 9", "response": ["*2016 – Gerald Grosvenor, 6th Duke of Westminster, third-richest British citizen (b. 1951)Duke of Westminster, Gerald Cavendish Grosvenor, dies aged 64"]}, {"page": "December 22", "response": ["*  1951   – Gerald Grosvenor, 6th Duke of Westminster, British landowner, businessman and philanthropist (d. 2016)"]}, {"page": "Enniskillen", "response": ["* Gerald Grosvenor, 6th Duke of Westminster, brought up at the family's estate at Ely Lodge"]}, {"page": "2016", "response": ["* August 9 – Gerald Grosvenor, 6th Duke of Westminster (b. 1951)"]}, {"page": "Saint-Ouen-sur-Seine", "response": ["Saint-Ouen-sur-Seine is home to Paris' flea market, the highest concentration of antique dealers and second-hand furniture dealers in the world. The flea market (marché aux puces) is held every Saturday, Sunday, and Monday; because of this high frequency, compared to other flea markets, it has tended to consist only of professionals who rent their spot for a minimum term of three years. In 2014 the flea market site was acquired by Jean-Cyrille Boutmy from Gerald Grosvenor, 6th Duke of Westminster."]}, {"page": "List of knights and ladies of the Garter", "response": ["| Gerald Grosvenor, 6th Duke of Westminster"]}, {"page": "University of Chester", "response": ["* 2005–2016: Major General Gerald Grosvenor, 6th Duke of Westminster"]}, {"page": "Gerald Cavendish Grosvenor, 6th Duke of Westminster", "response": ["#REDIRECT Gerald Grosvenor, 6th Duke of Westminster"]}, {"page": "Gerald Cavendish Grosvenor", "response": ["#redirectGerald Grosvenor, 6th Duke of Westminster"]}, {"page": "Nicholas Ashley-Cooper, 12th Earl of Shaftesbury", "response": ["Nicholas Ashley-Cooper was born on 3 June 1979, in London, the younger son of Anthony Ashley-Cooper, 10th Earl of Shaftesbury (1938–2004), and his Swedish wife Christina Eva Montan (born c. 1940), the daughter of Nils Montan, a former Swedish Ambassador to Germany. His godfathers were Gerald Grosvenor, 6th Duke of Westminster, and Simon Elliot, later brother-in-law of Charles, Prince of Wales."]}, {"page": "Inheritance Tax in the United Kingdom", "response": ["This critique followed the death of Gerald Grosvenor, 6th Duke of Westminster, whose significant at-death loose \"interests\", the benefit of which his children by trustees' discretion perhaps receive demonstrate suspected tax savings.  The unpublished size of the late Duke's death estate compares with the valuation of the family-related landholdings of  £9,000,000,000. Critics claim inheritance tax impacts more on the living standards of the middle class and less on plutocrats and the super rich.\"Letters: Tax and the Duke of Westminster's death\", The Guardian, 12 August 2016 If the family assets were taxed as if one taxable estate the taxation would equate to the inheritance taxes paid nationally for 2014–2015.\"How much tax will the Duke of Westminster pay on his estate\" Carter Solicitors. Accessed 2017-09-10"]}, {"page": "Natalia Grosvenor, Duchess of Westminster", "response": ["#REDIRECT Gerald Grosvenor, 6th Duke of Westminster"]}, {"page": "List of Old Harrovians", "response": ["*Gerald Grosvenor, 6th Duke of Westminster (1951–2016), British landowner and businessman, chairman of Grosvenor Group"]}, {"page": "Natalia Grosvenor, The Duchess of Westminster", "response": ["#REDIRECT Gerald Grosvenor, 6th Duke of Westminster"]}, {"page": "Charles Innes-Ker, 11th Duke of Roxburghe", "response": ["Captain Charles Robert George Innes-Ker is the 11th Duke of Roxburghe. He is the eldest son of the 10th Duke of Roxburghe and his first wife, the former Lady Jane Meriel Grosvenor, daughter of the 5th Duke of Westminster.Tom O'Sullivan, The young elite 11–20, The Guardian, 12 March 2000 His uncle was Gerald Grosvenor, 6th Duke of Westminster. He was educated at Eton College and the University of Newcastle upon Tyne. He attended the Royal Military Academy Sandhurst, passed out in December 2004, and has served with the Blues and Royals in Windsor and Iraq. Prior to succeeding to the dukedom on his father's death in August 2019, he was styled Marquess of Bowmont and Cessford."]}, {"page": "Royal Society of St George", "response": ["*Gerald Grosvenor, 6th Duke of Westminster  "]}, {"page": "North Irish Horse", "response": ["* Gerald Grosvenor, 6th Duke of Westminster"]}, {"page": "Sunningdale School", "response": ["* Gerald Grosvenor, 6th Duke of Westminster, the former richest aristocrat in the UK"]}, {"page": "Royal Order of Francis I", "response": ["* Gerald Grosvenor, 6th Duke of Westminster (2006)"]}]}}