{"wiki_id": "http://www.wikidata.org/entity/Q336666", "itemLabel": "William Douglas-Hamilton, 12th Duke of Hamilton", "itemDescription": "Scottish nobleman (1845-1895)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Douglas-Hamilton,_12th_Duke_of_Hamilton", "wikipedia_page": {"main": "William Alexander Louis Stephen Douglas-Hamilton, 12th Duke of Hamilton, 9th Duke of Brandon, 2nd Duke of Châtellerault KT (12 March 1845 in London – 16 May 1895 in Algiers) was a Scottish nobleman.", "link_mentions": [{"page": "William Hamilton", "response": ["*William Douglas-Hamilton, 12th Duke of Hamilton (1845–1895), Scottish nobleman"]}, {"page": "Douglas (surname)", "response": ["* William Douglas-Hamilton, 12th Duke of Hamilton and 8th Earl of Selkirk (1845–1895)"]}, {"page": "Earl of Selkirk", "response": ["On his death in 1885, the heirs male of the younger sons of the 1st earl expired. The heir male of the 1st earl's eldest son was William Douglas-Hamilton, 12th Duke of Hamilton, but under the special remainder (provision 2 above) the titles passed instead to his younger brother, Lord Charles Hamilton, who succeeded as 7th earl. When he died unmarried in 1886, the titles reverted to his elder brother, who had no further brothers to whom they could pass, and who accordingly succeeded as 8th earl. When he died without a son in 1895, the dukedom passed to his fourth cousin, Alfred Douglas-Hamilton, who succeeded as 13th duke of Hamilton. As he also had no brothers, he also succeeded as 9th earl of Selkirk."]}, {"page": "List of Knights and Ladies of the Thistle", "response": ["|William Douglas-Hamilton, 12th Duke of Hamilton||75px||1845–1895||1878|| "]}, {"page": "Louisa Cavendish, Duchess of Devonshire", "response": ["# Lady Mary Louisa Elizabeth Montagu (1854–1934), who was born at Kimbolton Castle and married, firstly, to William Douglas-Hamilton, 12th Duke of Hamilton, at Kimbolton Castle on 10 December 1873, and had issue. She secondly married on 20 July 1897 to Robert Carnaby Forster of Easton Park, Wickham Market, Suffolk (d. 1925), without issue."]}, {"page": "William Hamilton, 11th Duke of Hamilton", "response": ["* William Douglas-Hamilton, 12th Duke of Hamilton (1845–1895)"]}, {"page": "William Montagu, 7th Duke of Manchester", "response": ["* Lady Mary Louisa Elizabeth Montagu (1854–1934), who married William Douglas-Hamilton, 12th Duke of Hamilton on 10 December 1873. She remarried Robert Forster on 20 July 1897."]}, {"page": "William Alexander Louis Stephen Douglas-Hamilton, 12th Duke of Hamilton", "response": ["#REDIRECT William Douglas-Hamilton, 12th Duke of Hamilton"]}, {"page": "Clan Douglas", "response": ["In 1895, Alfred Douglas-Hamilton inherited the Dukedom of Hamilton from his cousin William Douglas-Hamilton, 12th Duke of Hamilton and became Alfred Douglas-Hamilton, 13th Duke of Hamilton. His Grace Alfred Douglas Hamilton was the great-great-great grandson of James Hamilton, 4th Duke of Hamilton through a collateral line. During World War 1, Hamilton Palace, the main family seat, was used as a hospital with his blessing. During World War 2, his sons, Douglas Douglas-Hamilton, 14th Duke of Hamilton, George Douglas-Hamilton, 10th Earl of Selkirk, Lord Malcolm Douglas-Hamilton, and Lord David Douglas-Hamilton made history by all being squadron leaders or above at the outbreak of the war.  Lord David Douglas-Hamilton was killed in action in 1944. Douglas Douglas-Hamilton, 14th Duke of Hamilton was the first man to fly over Mt. Everest. His son, Angus Douglas-Hamilton, 15th Duke of Hamilton was also in the Royal Air Force and achieved the rank of flight lieutenant during his service in the Cold War. He was the father of the current Duke, Alexander Douglas-Hamilton, 16th Duke of Hamilton. The current heir presumptive to the Dukedom is the 16th Duke's son, Douglas Charles Douglas-Hamilton, Marquess of Douglas and Clydesdale."]}, {"page": "Easton, Suffolk", "response": ["William Douglas-Hamilton, 12th Duke of Hamilton, died without male issue in 1895 and the title passed to his fourth cousin, who became Alfred Douglas-Hamilton, 13th Duke of Hamilton. Although the Dukedom and estates had passed, a large share of the Hamilton lands and properties, including Easton park, went to Lady Mary, the 12th Duke and Duchess's only child."]}, {"page": "William Alexander Stephen Douglas-Hamilton, 12th Duke of Hamilton", "response": ["#REDIRECT William Douglas-Hamilton, 12th Duke of Hamilton"]}, {"page": "Louisa Acheson, Countess of Gosford", "response": ["Lady Gosford was the third of five children born to Countess Louisa van Alten by her first husband, William Montagu, 7th Duke of Manchester. Her older brother, George, became the 8th Duke of Manchester and married Cuban-American heiress Consuelo Yznaga. Her elder sister, Lady Mary Louisa Elizabeth Montagu, married William Douglas-Hamilton, 12th Duke of Hamilton, and her younger siblings were Lord Charles William Augustus Montagu (husband of the Hon. Mildred Cecilia Harriet Stuart, daughter of Henry Sturt, 1st Baron Alington), and Lady Alice Maude Olivia Montagu (wife of Edward Stanley, 17th Earl of Derby)."]}, {"page": "Hamilton Mausoleum", "response": ["*William Douglas-Hamilton, 12th Duke of Hamilton, on 31 May 1895"]}, {"page": "List of University of Oxford people in British public life", "response": ["| William Douglas-Hamilton, 12th Duke of Hamilton"]}, {"page": "WALS Douglas-Hamilton", "response": ["#REDIRECT William Douglas-Hamilton, 12th Duke of Hamilton"]}, {"page": "Princess Marie Amelie of Baden", "response": ["* William Douglas-Hamilton, 12th Duke of Hamilton ( 12 March 1845 – 16 May 1895) he married Lady Mary Montagu on 10 December 1873. They had one daughter."]}, {"page": "Charles Powell Hamilton", "response": ["Following the death in 1895 of William Douglas-Hamilton, 12th Duke of Hamilton without male issue, Hamilton's great-grandson, Alfred Douglas Hamilton inherited the Dukedom of Hamilton."]}, {"page": "Duchess of Hamilton", "response": ["* Lady Mary Montagu, wife of William Douglas-Hamilton, 12th Duke of Hamilton"]}, {"page": "Doris Langley Moore", "response": ["In addition to her other interests, Doris Langley Moore was a well-respected Byron scholar and wrote a number of books on Byron and his world. As well as a biography of Byron's legitimate daughter Ada Lovelace, Langley Moore wrote biographies of the author E. Nesbit, the 19th century ballerina Carlotta Grisi, and Marie Bashkirtseff, the Russian artist, sculptor and diarist. The title of this last book, Marie & the Duke of H, focused on Bashkirtseff's childhood infatuation with William Douglas-Hamilton, 12th Duke of Hamilton."]}, {"page": "Manor of Byng", "response": ["From this time to the death of Sir Henry Wingfield 4th bart in 1677 the manor descended in the same course as the manor of Dallinghoo, in Loes Hundred from the 4th bart, Sir Henry Wingfield, this manor passed to his son and heir Sir Henry Wingfield 5th bart, who sold it in 1708 to William Nassau de Zuylestein, 1st Earl of Rochford, who died the same year. The manor passed to his son and heir William Nassau de Zuylestein, 2nd Earl of Rochford, who died in 1710 at the battle of Almenar. The manor passed to his son and heir Frederick van Nassau de Zuylnstein, 3rd Earl of Rochford who died in 1738. The manor then passed to his son and heir Richard Savage Nassau, born 1 June 1723. He married Anne Spencer, widow of James Hamilton 5th Duke of Hamilton. On the death of Richard Savage Nassau on 17 May 1780, the manor passed to his son and heir William Henry Nassau de Zuylestein, 5th Earl of Rochford, born 28 June 1754. William became 5th Earl Rochford upon the death of his cousin William Henry Nassau de Zuylestein, 4th Earl of Rochford who died without issue. William 5th Earl of Rochford died on 3 September 1830, and the manor passed to Alexander Douglas-Hamilton, 10th Duke of Hamilton, born 5 October 1767. Alexander was also 7th Duke of Brandon. Alexander died 18 August 1852, the manor passed to his son and heir William Douglas-Hamilton, 11th Duke of Hamilton, born 18 February 1811. William, 11th Duke of Hamilton married Princess Marie Zahringen, ancestor of the current Prince of Monaco. William, 11th Duke of Hamilton, died 15 July 1863 in Paris and the manor passed to his son and heir William Douglas-Hamilton, 12th Duke of Hamilton, born 12 March 1845. He married Lady Mary Louisa Elizabeth Montagu on 10 December 1873. In 1895, the 12th Duke died and the manor passed to his daughter Lady Mary Louise Hamilton, born 1 November 1884.The Manors of Suffolk notes on their History and Devolution The Hundreds of Thingow, Theedling, Wangford and Wilford. By W.A. Coppinger. M.A. LLD FSA FRSA of the Middle Temple, Barrister at Law. Professor and Dean of the Faculty of Law in the Victoria University of Manchester, sometime President of the Bibliographical Society, Author of County of Suffolk; It History as Disclosed by Existing Records. Volume 7, Taylor Garnett & Evans & Co. Ltd Manchester 1911. Lady Hamilton married James Graham 6th Duke of Montrose, Marquess of Graham, on 14 June 1906. The manor, along with the manors of Easton, Letheringham, Kettleburgh - Charsfield, Hoo-Charsfield, Martley Hall, Hoo, and Wickham with its members,  was sold by Lady Mary on 14 September 1920 to Adolphus George Maskell, Solicitor, of Chelmsford, Essex.Kellys Directory of Suffolk.Conveyance dated 14 September 1920 between the Most Honourable Mary Louise Graham (commonly called the Marchioness of Graham, and thereinafter called \"the Marchioness\") the wife of the Most Honourable James Graham  (commonly called the Marquess of Graham and thereinafter called  \"the Marquess\") of the first part the marquess the marchioness Colonel Donald W Walter Cameron of Lochiel of Achnacarry Spean Bridge in the county of Inverness and George Francis Dalziel of Edinburgh Writer to the Signet (hereinafter collectively called \"the Trustees\") of the second part Harry Urban Capon of Kenton Hall in the county of Suffolk Farmer of the third part and Adolphus George Maskell of Chelmsford in the county of Essex Solicitor (thereinafter called the purchaser) of the fourth part. The manor along with Wickham with its members, was sold by Maskell on 9 January 1934, to Adnams Brewery of Southwold, Suffolk.Conveyance dated 9 January 1934 between Adolphus George Maskell of Chelmsford in the county of Essex Solicitor (hereinafter called the vendor) of the one part and Adnams and Company Limited whose registered office is situate at Sole Bay Brewery Southwold in the county of Suffolk (hereinafter called the purchasers) of the other part. The manor was held by Adnams until it was sold on 14 February 2003 to Richard Glasgow of Leadenham, Lincolnshire.Conveyance dated 14 February 2003 between Adnams PLC whose registered office is situate at Sole Bay Brewery East Green Southwold IP18 6JW (hereinafter called \"the vendor\") of the one part and Richard Glasgow of Leadenham in the county of Lincolnshire (hereinafter called \"the purchaser\") of the other part. who is the current Lord of the manor of Byng, Suffolk, and the manors of Stotfold, and Spalding.", "* 1863 to 1895 William Douglas-Hamilton, 12th Duke of Hamilton, 9th Duke of Brandon, 2nd Duke of Châtellerault KT"]}]}}