{"wiki_id": "http://www.wikidata.org/entity/Q3376742", "itemLabel": "Peter Marlow", "itemDescription": "British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Marlow_(photographer)", "wikipedia_page": {"main": "Peter Marlow (19 January 1952 – 21 February 2016) was a British photographer and photojournalist, and member of Magnum Photos.", "link_mentions": [{"page": "Kenilworth", "response": ["*Peter Marlow (1952–2016) was a photojournalist and photographer."]}, {"page": "Magnum Photos", "response": ["| Peter Marlow", "| Member from 1986\"Peter Marlow\", Magnum Photos. Retrieved 16 January 2010. to his death in 2016."]}, {"page": "Chris Steele-Perkins", "response": ["Steele-Perkins photographed wars and disasters in the third world, leaving Viva in 1979 to join Magnum Photos as a nominee (on encouragement by Josef Koudelka), and becoming an associate member in 1981 and a full member in 1983.Russell Miller, Magnum: Fifty Years at the Front Line of History (New York: Grove, 1998; ), p.268. He continued to work in Britain, taking photographs published as The Pleasure Principle, an examination (in colour) of life in Britain but also a reflection of himself. With Peter Marlow, he successfully pushed for the opening of a London office for Magnum; the proposal was approved in 1986.Miller, Magnum, pp. 268–70."]}, {"page": "John Goodall (author)", "response": ["Other recent projects include contributions to the photographic book The English Cathedral by Peter Marlow and a chapter on the siege of Dover in 1216–17 for the book accompanying the Dan Snow Battle Castle television series. He has acted as series consultant for the Country Life book series taken from the archive of the magazine, including Curious Observations (2011) and Letters to the Editor."]}, {"page": "Peter Marlow (athlete)", "response": ["Peter Marlow (born 20 April 1941) is a British racewalker who competed at the 1972 Olympic Games in Munich, finishing 17th in the 20 km walk. He was born in London.Peter Marlow at Sports Reference"]}, {"page": "Harry Gruyaert", "response": ["*Way to Gods: Magunamu Foto: Kumano kodō, Santiago e no michi (), ed. Nagasaka Yoshimitsu (). Tokyo: Kawade Kobō Shinsha, 1999. .  (Additional title on front cover: Ancient Kumano Roads and Roads to Santiago.) Contains photographs of Camino de Santiago by Gruyaert and Peter Marlow, and of Kumano kodō by Marlow, Elliott Erwitt and Chris Steele-Perkins."]}, {"page": "2016 in the United Kingdom", "response": ["**Peter Marlow, 63, news photographer."]}, {"page": "Deaths in February 2016", "response": ["*Peter Marlow, 63, British news photographer, influenza contracted during a stem cell transplant.In memoriam Peter Marlow 1952–2016"]}, {"page": "Tish Murtha", "response": ["In 1982, Murtha moved to London, where she worked on London By Night (1983) along with Bill Brandt, Brian Griffin and Peter Marlow. The group exhibition documenting Soho and the commercial sex industry, was exhibited in The Photographers’ Gallery, London. Murtha lived in the capital for five years, working on commission for Edward Arnold Publishers. She also photographed emerging celebrities Julian Clary and Philip Herbert and took the first headshots of a young Declan Donnelly upon her return to the north east in 1987."]}, {"page": "Peter Marlow", "response": ["Peter Marlow may refer to:", "* Peter Marlow (athlete) (born 1941), British racewalker", "* Peter Marlow (photographer) (1952–2016), British news photographer"]}, {"page": "Open Eye Gallery", "response": ["Work is also held by John Davies, Gabriele Basilico, Vanley Burke, Bruce Gilden, E. Chambré Hardman, Peter Kennard, Mari Mahr, Peter Marlow, Joel Meyerowitz, Simon Norfolk, Martin Parr, Ewen Spencer, Ed van der Elsken, John Edwards), Ian Beesley, Steve Conlan, Philippe Conti, Will Curwen, Paul Fazackerley, Steve Hale, Sean Halligan, Thurston Hopkins, Greg Leach, Peter Hagerty, Harry Hammond, Derek Massey, Neil McDowall, Rob Meighen, Paul O’Donnell, Caroline Penn, Michael Robinson, Ludwig Schirmer, Samantha Seneviratne, Patrick Shanahan, John Stoddart, Wolfgang Suschitsky, Jan Svenungsson, Ali Taptik, Sandy Volz, Wojtek Wilczyk, Rob Williams, and David Reid."]}, {"page": "Shuggie Bain", "response": ["The Grove Press cover features a photograph by Peter Marlow. Douglas Stuart expressed a fondness for the photograph, saying \"it captures perfectly the fierce love that Shuggie has for his troubled mother\". The Picador cover features a photograph by Jez Coulson, shot in Easterhouse, Glasgow (about which Stuart tweeted on 13 August 2020:\" I was instantly struck by the power of Jez's photo the moment I saw it\")."]}, {"page": "Marlow (surname)", "response": ["*Peter Marlow (disambiguation)", ":*Peter Marlow (athlete) (born 1941), British racewalker", ":*Peter Marlow (photographer) (1952–2016), British news photographer"]}]}}