{"wiki_id": "http://www.wikidata.org/entity/Q3371126", "itemLabel": "Paul Dukes", "itemDescription": "British spy and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Dukes", "wikipedia_page": {"main": "Sir Paul Henry Dukes  (10 February 1889 – 27 August 1967) was a British MI6 officer and author.", "link_mentions": [{"page": "Augustus Agar", "response": ["Agar set up a small base at Terijoki, just inside Finland and close to the Soviet frontier. From here he undertook a top secret and dangerous mission to retrieve Paul Dukes, a man he knew only by the MI6 codename ST-25, from the coast of the Bay of Petrograd. The last British agent left in Russia, Dukes had been infiltrating the Bolshevik government for some time and had made copies of top secret documents. A master of disguise, he was known as \"The Man with A Hundred Faces\", but his resources had run out by this time. In order to spirit Dukes away, Agar's boats had to cross Bolshevik minefields and pass by a number of forts and ships guarding the entrance to the Bolshevik naval base at Kronstadt and to Petrograd, now St. Petersburg.", "Paul Dukes, meanwhile, thinking Agar dead because of his failure to appear at their rendezvous point, resolved to leave Petrograd by land and was forced to jump from tram to tram in the city to shake off Cheka agents. After a series of extraordinary adventures through war-torn Latvia under a variety of disguises, he got back to London with his secret documents copied onto tissue paper. He was subsequently knighted by King George V, and remains the only man to be knighted based entirely on his exploits as a spy."]}, {"page": "Giles Milton", "response": ["The spies included Sidney Reilly, Arthur Ransome, George Hill, Somerset Maugham, Paul Dukes and Augustus Agar. They worked undercover and in disguise, operating out of Moscow and Petrograd."]}, {"page": "Duke (surname)", "response": ["* Paul Dukes (1889–1967), English journalist and MI6 officer"]}, {"page": "Sir Paul Dukes", "response": ["#REDIRECT Paul Dukes"]}, {"page": "Ashley Dukes", "response": ["He was the older brother of MI6 spy Paul Dukes and pathologist Cuthbert Dukes, and grandfather of poet Aidan Andrew Dun."]}, {"page": "Cuthbert Dukes", "response": ["He was the younger brother of British playwright Ashley Dukes and MI6 agent Sir Paul Dukes."]}, {"page": "The Unforgettable Year 1919", "response": ["*Vladimir Kenigson as Paul Dukes"]}, {"page": "History of espionage", "response": ["Another pivotal figure was Sir Paul Dukes, arguably the first professional spy of the modern age. Recruited personally by Mansfield Smith-Cumming to act as a secret agent in Imperial Russia, he set up elaborate plans to help prominent White Russians escape from Soviet prisons after the Revolution and smuggled hundreds of them into Finland. Known as the \"Man of a Hundred Faces,\" Dukes continued his use of disguises, which aided him in assuming a number of identities and gained him access to numerous Bolshevik organizations. He successfully infiltrated the Communist Party of the Soviet Union, the Comintern, and the political police, or CHEKA. Dukes also learned of the inner workings of the Politburo, and passed the information to British intelligence."]}, {"page": "Secret Intelligence Service", "response": ["* Paul Dukes, SIS officer and author"]}, {"page": "August 1967", "response": ["**Sir Paul Dukes, 78, British MI-6 officer known as \"The Man with a Hundred Faces\"Harry Ferguson, Operation Kronstadt: The Greatest True Story of Honor, Espionage, and the Rescueof Britain's Greatest Spy, The Man with a Hundred Faces (The Overlook Press, 2010) for his disguises and alternative identities while infiltrating the Communist Party during his espionage in Russia."]}, {"page": "Vladimir Kenigson", "response": ["* The Unforgettable Year 1919 (1951) as Paul Dukes"]}, {"page": "Dukes, Paul", "response": ["#redirectPaul Dukes"]}]}}