{"wiki_id": "http://www.wikidata.org/entity/Q3379050", "itemLabel": "Philip Meadows Taylor", "itemDescription": "administrator and novelist", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Meadows_Taylor", "wikipedia_page": {"main": "Colonel Philip Meadows Taylor,  (25 September 1808 – 13 May 1876), an administrator in British India and a novelist, made notable contributions to public knowledge of South India. Though largely self-taught, he was a polymath, working alternately as a judge, engineer, artist, and man of letters.", "link_mentions": [{"page": "Thuggee", "response": ["*The 1839 novel Confessions of a Thug by Philip Meadows Taylor is based on the Thuggee cult, revolving around a fictional Thug who is named AmeerHistory of Ameer Ali Thug Ali. The novel popularized the word \"thug\" in the English language."]}, {"page": "Hyderabad", "response": ["The discovery of Megalithic burial sites and cairn circles in the suburbs of Hyderabad, in 1851 by Philip Meadows Taylor, a polymath in the service of the Nizam, had provided evidence that the region in which the city stands has been inhabited from the Stone Age. Archaeologists excavating near the city have unearthed Iron Age sites that may date from 500 BCE. The region comprising modern Hyderabad and its surroundings was ruled by the Chalukya dynasty from 624 CE to 1075 CE. Following the dissolution of the Chalukya empire into four parts in the 11th century, Golconda came under the control of the Kakatiya dynasty from 1158, whose seat of power was at Warangal— northeast of modern Hyderabad. The Kakatiya ruler Ganapatideva 1199–1262 built a hilltop outpost—later known as Golconda Fort—to defend their western region."]}, {"page": "Rani of Jhansi", "response": ["* Seeta: This mutiny novel written by Philip Meadows Taylor in 1872 is showing the admiration of Taylor for the Rani."]}, {"page": "1839 in literature", "response": ["*Philip Meadows Taylor – Confessions of a Thug"]}, {"page": "History of crime fiction", "response": ["Forerunners of today's crime fiction include the ghost story, the horror story, and the revenge story. Early examples of crime stories include Thomas Skinner Sturr's anonymous Richmond, or stories in the life of a Bow Street officer (1827), Steen Steensen Blicher's The Rector of Veilbye (1829), Philip Meadows Taylor's Confessions of a Thug (1839), and Maurits Christopher Hansen's \"Mordet paa Maskinbygger Roolfsen\" - The Murder of Engineer Roolfsen (1839)."]}, {"page": "Menton", "response": ["* Philip Meadows Taylor (1808–1876), British Indian civil servant and author"]}, {"page": "Anglo-Indian", "response": ["* Philip Meadows TaylorPhilip Meadows Taylor The Story of My Life (Edinburgh: William Blackwood & Sons) 1877 pp62-3"]}, {"page": "The Haunted Bookshop", "response": ["* Confessions of a Thug by Philip Meadows Taylor"]}, {"page": "Yadgir", "response": ["The town was part of the empire of the Western Chalukyas from the 10th to the 12th centuries. The name Yadgir (historically Yetagiri) is derived from its early medieval rulers, the 'Yadavas'. Their establishments were on a hill ('giri' in Kannada means hill). Major economic development of the city took place under Philip Meadows Taylor, the British administrator of the principality of Shorapur."]}, {"page": "Lingasugur", "response": ["Lingasugur  is a municipal town in Raichur district in the Indian state of Karnataka.  There are many Temples, hills and forts (Quila). The festivals of Muharram and Maha Shivaratri are important here. Mudgal in Lingasugur taluk has a very ancient fort. It has often been mentioned in the autobiography of Philip Meadows Taylor. Lingasugur, then known as Chavani was the site of a major British cantonment in the region."]}, {"page": "Shorapur", "response": ["The town has been vividly described in the autobiography of Philip Meadows Taylor - The story of my life and also Jamiya Masjid of Timmapur.", "*Philip Meadows Taylor. The story of my life, by M. Taylor. Ed. by his daughter (A.M. Taylor). Oxford University, 1882."]}, {"page": "Phil Taylor", "response": ["*Philip Meadows Taylor (1808–1876), Anglo-Indian administrator and novelist"]}, {"page": "Confessions of a Thug (novel)", "response": ["Confessions of a Thug is an English novel written by Philip Meadows Taylor in 1839 based on the Thuggee cult in British India. It was a best-seller in 19th-century Britain, becoming the British Empire's most sensational ethnographic fiction in the first half of the 19th century; its avid readers included Queen Victoria. It was one of the best-selling crime novels of the 19th century, and was the most influential novel about India prior to Rudyard Kipling's Kim (1901). The novel's popularity established the word \"thug\" in the English language."]}, {"page": "Mark Cubbon", "response": ["Cubbon arrived in India earlier than required in the summer of 1801 at Calcutta. He gained an appointment to the 2nd Madras Battalion in 1802, and moved to the 2nd Battalion 5th Native Infantry in July 1804, serving in Travancore under Col. John Chalmers. Cubbon had great admiration for the Sepoys and respected their religious views. In 1809 he received a civil appointment but the new governor of Madras, George Barlow, had passed a pledge that was unpopular among the Europeans in the Madras Army. Cubbon refused to sign the declaration and he lost his appointment during this so-called white mutiny in Madras. He was reappointed in 1810 in the Commissariat Department initially under Col. Close  in central India during the Pindari War and then under Colonel Philip Meadows Taylor in Kurnool. A year later, he was then made an Assistant Commissary-General, a position well above the ranks within the army. He became a Major on 23 November 1823 and was a Lieutenant-Colonel on 22 April 1826. In 1827 he moved south to serve under the Travancore Resident as Commissary-General, succeeding William Morrison."]}, {"page": "Philip Taylor", "response": ["*Philip Meadows Taylor (1808-1876), Anglo-Indian administrator and novelist"]}, {"page": "Raja Venkatappa Nayaka", "response": ["This district was ruled by Valmiki Nayaka's (berad) who had given tough resistance to Aurangzeb. The British appointed Philip Meadows Taylor, a writer, as its Resident and Regent when the ruler there died, leaving a young prince Venkatappa. Venkatappa Nayaka was educated in English and Taylor had endeared himself to the prince, who addressed Taylor as \"Appa\"."]}, {"page": "John Mitford", "response": ["Mitford was born at Mitford, Northumberland. As one of the Mitfords of Mitford Castle he was a cousin to Admiral Robert Mitford the bird-artist and Philip Meadows Taylor (author of Confessions of a Thug), and distantly related to Lord Redesdale (attorney general), William Mitford (historian), the Reverend John Mitford, and Mary Russell Mitford (author of Our Village). The younger son of a younger son, Mitford had to make his own way in life and he chose a career in the navy. The patronage of his relative Lord Redesdale secured him a place as a midshipman on the  in April 1795."]}, {"page": "Meadows Taylor", "response": ["#Redirect Philip Meadows Taylor"]}, {"page": "Phillip Meadows Taylor", "response": ["#Redirect Philip Meadows Taylor"]}, {"page": "Hire Benakal", "response": ["The first published reports on Hirebenakal were those in the Journal of the Royal Asiatic Society in 1835, by Philip Meadows Taylor, who was under the service of the Nizam of Hyderabad. For over a century afterwards, no further systematic study of the site was conducted. Between 1944-48, Sir Mortimer Wheeler undertook archaeological excavations; these were supplemented by Adiga Sundara and were published in 1975. In his publication, \"The Early Chamber Tombs of South India: A Study of the Iron Age Megalithic Monuments of North Karnataka\", Sundara's cataloguing describes details of 300 megalithic burial chambers at a site which was surrounded by thick forest. Andrew Bauer of the Department of Anthropology at Stanford University has carried out investigations in recent years and identified about 1000 different types of antiquaries within an area of about . His findings describe anthropomorphic funerary structures, menhirs, and circle-shaped stone fences. Bauer states in his writings that   the dolmens supported by stone slabs appear to have been erected perfectly, without any joining mortar."]}, {"page": "Bonal Bird Sanctuary", "response": ["*Philip Meadows Taylor. The story of my life, by M. Taylor. Ed. by his daughter (A.M. Taylor). Oxford University, 1882."]}, {"page": "Thugs of Hindostan", "response": ["By February 2017, Khan had prepared his look for the film. In the same month, Shraddha Kapoor gave a costume look test and audition for the film. In March 2017, it was reported that Khan suggested Fatima Sana Shaikh's name for a role in the film; while denying rumours of casting, Sheikh expressed her eagerness to work in the project. In May 2017, Shaikh was confirmed to play a role in the film, with her audition look being revealed. She replaced Kapoor. Kaif was confirmed to star in the film on Yash Raj Films' official website. Khan, Bachchan and Acharya met during the month of May to discuss script changes. Contrary to initial reports, the film is not based on Philip Meadows Taylor's 1839 novel Confessions of a Thug (which was about Indian thugs); the film tells a fictional story based on historical events. Acharya links the misunderstanding to the word thug appearing in both works. Khan also denied rumours of Thugs of Hindostan being inspired by Pirates of the Caribbean, stating in May 2017 that they are both simply action-adventure productions, among many others in the action-adventure film genre, such as the Indiana Jones series."]}]}}