{"wiki_id": "http://www.wikidata.org/entity/Q337380", "itemLabel": "Hugh Gaitskell", "itemDescription": "British politician (1906-1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Gaitskell", "wikipedia_page": {"main": "Hugh Todd Naylor Gaitskell  (9 April 1906 – 18 January 1963) was Leader of the British Labour Party from 1955 until his death in 1963. An economics lecturer and wartime civil servant, he was elected to Parliament in 1945 and held office in Clement Attlee's governments, notably as Minister of Fuel and Power after the bitter winter of 1946–47, and eventually joining the Cabinet as Chancellor of the Exchequer. Facing the need to increase military spending in 1951, he imposed National Health Service charges on dentures and spectacles, prompting the leading left-winger Aneurin Bevan to resign from the Cabinet.\nThe perceived similarity in his outlook to that of his Conservative Party counterpart Rab Butler was dubbed \"Butskellism\", initially a satirical term blending their names, and was one aspect of the post-war consensus through which the major parties largely agreed on the main points of domestic and foreign policy until the 1970s. With Labour in opposition from 1951, Gaitskell won bitter leadership battles with Bevan and his supporters to become the Leader of the Labour Party and Leader of the Opposition in 1955. In 1956 he opposed the Eden government's use of military force at Suez. Against a backdrop of a booming economy he led Labour to its third successive defeat at the 1959 general election.\nIn the late 1950s, in the teeth of opposition from the major trade unions, he attempted in vain to remove Clause IV of the Labour Party Constitution, which committed Labour to nationalisation of all the means of production. He did not reject public ownership altogether, but also emphasised the ethical goals of liberty, social welfare and above all equality, and argued that they could be achieved by fiscal and social policies within a mixed economy. His revisionist views, on the right wing of the Labour Party, were sometimes called Gaitskellism.\nDespite this setback, Gaitskell reversed an attempt to adopt unilateral nuclear disarmament as Labour Party policy, and opposed Prime Minister Harold Macmillan's attempt to lead the UK into the European Common Market. He was loved and hated for his confrontational leadership and brutal frankness. He died suddenly in 1963, when he appeared to be on the verge of leading Labour back into power and becoming the next Prime Minister.", "link_mentions": [{"page": "April 9", "response": ["*  1906   – Hugh Gaitskell, British politician and leader of the Labour Party (died 1963)"]}, {"page": "Clement Attlee", "response": ["By 1951, the Attlee government was exhausted, with several of its most senior ministers ailing or ageing, and with a lack of new ideas. Attlee's record for settling internal differences in the Labour Party fell in April 1951, when there was a damaging split over an austerity Budget brought in by the Chancellor, Hugh Gaitskell, to pay for the cost of Britain's participation in the Korean War. Aneurin Bevan resigned to protest against the new charges for \"teeth and spectacles\" in the National Health Service introduced by that Budget, and was joined in this action by several senior ministers, including the future Prime Minister Harold Wilson, then the President of the Board of Trade. Thus escalated a battle between the left and right wings of the Party that continues today.", "The period was dominated by infighting between the Labour Party's right wing, led by Hugh Gaitskell, and its left, led by Aneurin Bevan. Many Labour MPs felt that Attlee should have retired after the 1951 election and allowed a younger man to lead the party. Bevan openly called for him to stand down in the summer of 1954.Williams, Charles. Harold Macmillan (2009), p. 221 One of his main reasons for staying on as leader was to frustrate the leadership ambitions of Herbert Morrison, whom Attlee disliked for both political and personal reasons. At one time, Attlee had favoured Aneurin Bevan to succeed him as leader, but this became problematic after Bevan almost irrevocably split the party.", "Attlee, now aged 72, contested the 1955 general election against Anthony Eden, which saw Labour lose 18 seats, and the Conservatives increase their majority. He retired as Leader of the Labour Party on 7 December 1955, having led the party for twenty years, and on 14 December Hugh Gaitskell was elected as his replacement."]}, {"page": "January 18", "response": ["*1963 – Hugh Gaitskell, English academic and politician, Chancellor of the Exchequer (b. 1906)"]}, {"page": "Michael Foot", "response": ["Foot returned to parliament at a by-election in Ebbw Vale, Monmouthshire, in 1960, the seat having been left vacant by Bevan's death. He had the Labour whip withdrawn in March 1961 after rebelling against the Labour leadership over air force estimates. He only returned to the Parliamentary Labour Group in 1963, when Harold Wilson became Labour leader after the sudden death of Hugh Gaitskell."]}, {"page": "Margaret Thatcher", "response": ["After Tony Blair's election as Labour Party leader in 1994, Thatcher praised Blair as \"probably the most formidable Labour leader since Hugh Gaitskell\", adding: \"I see a lot of socialism behind their front bench, but not in Mr Blair. I think he genuinely has moved.\" Blair responded in kind: \"She was a thoroughly determined person, and that is an admirable quality.\""]}, {"page": "Roy Jenkins", "response": ["Like Healey and Crosland, he had been a close friend of Hugh Gaitskell and for them Gaitskell's death and the elevation of Harold Wilson as Labour Party leader was a setback. For Jenkins, Gaitskell would remain his political hero.Campbell, Roy Jenkins: A Well-Rounded Life, p. 230. After the 1964 general election Jenkins was appointed Minister of Aviation and was sworn of the Privy Council. While at Aviation he oversaw the high-profile cancellations of the BAC TSR-2 and Concorde projects (although the latter was later reversed after strong opposition from the French Government). In January 1965 Patrick Gordon Walker resigned as Foreign Secretary and in the ensuing reshuffle Wilson offered Jenkins the Department for Education and Science; however, he declined it, preferring to stay at Aviation.Campbell, Roy Jenkins: A Well-Rounded Life, p. 249.", "Jenkins hailed Tony Blair's election as Labour Party leader in July 1994 as \"the most exciting Labour choice since the election of Hugh Gaitskell\". He argued that Blair should stick \"to a constructive line on Europe, in favour of sensible constitutional innovation...and in favour of friendly relations with the Liberal Democrats\". He added that he hoped Blair would not move Labour further to the right: \"Good work has been done in freeing it from nationalisation and other policies. But the market cannot solve everything and it would be a pity to embrace the stale dogmas of Thatcherism just when their limitations are becoming obvious\".Roy Jenkins, 'Labour's most exciting leader since Gaitskell', The Times (23 July 1994), p. 14."]}, {"page": "1963", "response": ["* January 18 - Hugh Gaitskell, leader of the U.K.'s Labour Party, dies and is replaced by acting leader George Brown.", "** Hugh Gaitskell, British politician, leader of the Labour Party (b. 1906)"]}, {"page": "Harold Wilson", "response": ["Born in Huddersfield, Yorkshire, to a politically active middle class family, Wilson won a scholarship to attend Royds Hall Grammar School and went on to study modern history at Jesus College, Oxford. He was later an economic history lecturer at New College, Oxford and a research fellow at University College, Oxford. Elected to Parliament in 1945 for the seat of Ormskirk, Wilson was immediately appointed to the Attlee Government as a Parliamentary Secretary; he became Secretary for Overseas Trade in 1947, and was elevated to the Cabinet shortly thereafter as President of the Board of Trade. In 1950, he moved to represent the nearby seat of Huyton. Following Labour's defeat at the 1955 election, Wilson joined the Shadow Cabinet as Shadow Chancellor, and was moved to the role of Shadow Foreign Secretary in 1961. When Labour Leader Hugh Gaitskell died suddenly in January 1963, Wilson won the subsequent leadership election to replace him, becoming Leader of the Opposition.", "In mid-1949, with Chancellor of the Exchequer Stafford Cripps having gone to Switzerland in an attempt to recover his health, Wilson was one of a group of three young ministers, all of them former economics dons and wartime civil servants, convened to advise Prime Minister Attlee on financial matters. The others were Douglas Jay (Economic Secretary to the Treasury) and Hugh Gaitskell (Minister of Fuel and Power), both of whom soon grew to distrust him. Jay wrote of Wilson's role in the debates over whether or not to devalue sterling that \"he changed sides three times within eight days and finished up facing both ways\". Wilson was given the task during his Swiss holiday of taking a letter to Cripps informing him of the decision to devalue, to which Cripps had been opposed.Dell 1997, pp. 120, 122. Wilson had tarnished his reputation in both political and official circles. Although a successful minister, he was regarded as self-important. He was not seriously considered for the job of Chancellor when Cripps stepped down in October 1950—it was given to Gaitskell—possibly in part because of his cautious role during devaluation.Dell 1997, p. 137.Pimlott (1992) pp 133–153. ", "Wilson's course in intra-party matters in the 1950s and early 1960s left him neither fully accepted nor trusted by the left or the right in the Labour Party. Despite his earlier association with Bevan, in 1955 he backed Hugh Gaitskell, the right-wing candidate in internal Labour Party terms, against Bevan for the party leadership. Gaitskell appointed him Shadow Chancellor of the Exchequer in 1955, and he proved to be very effective.Pimlott, pp. 211–12. One of his procedural moves caused a substantial delay to the progress of the Government's Finance Bill in 1955, and his speeches as Shadow Chancellor from 1956 were widely praised for their clarity and wit. He coined the term \"Gnomes of Zürich\" to ridicule Swiss bankers for selling Britain short and pushing the pound down by speculation. He conducted an inquiry into the Labour Party's organisation following its defeat in the 1955 general election, which compared Labour's organisation to an antiquated \"penny farthing\" bicycle, and made various recommendations for improvements.Pimlott, pp. 194–96. Unusually, Wilson combined the job of Chairman of the House of Commons' Public Accounts Committee with that of Shadow Chancellor from 1959, holding that position until 1963.", "The continued relevance of industrial nationalisation (a centrepiece of the post-War Labour government's programme) had been a key point of contention in Labour's internal struggles of the 1950s and early 1960s. Wilson's predecessor as leader, Hugh Gaitskell, had tried in 1960 to tackle the controversy head-on, with a proposal to expunge Clause Four (the public ownership clause) from the party's constitution, but had been forced to climb down. Wilson took a characteristically more subtle approach: No significant expansion of public ownership took place under Wilson's government, however, he placated the party's left-wing by renationalising the steel industry in 1967 (which had been denationalised by the Conservatives in the 1950s) creating the British Steel Corporation.", "Among the more challenging political dilemmas Wilson faced was the issue of British membership of the European Community, the forerunner of the present European Union. An entry attempt was vetoed in 1963 by French President Charles de Gaulle. The Labour Party in Opposition had been divided on the issue, with Hugh Gaitskell having come out in 1962 in opposition to Britain joining the Community. After initial hesitation, Wilson's Government in May 1967 lodged the UK's second application to join the European Community. It was vetoed by de Gaulle in November 1967. After De Gaulle lost power, Conservative prime minister Edward Heath negotiated Britain's admission to the EC in 1973."]}, {"page": "James Callaghan", "response": ["Callaghan was popular with Labour MPs, and was elected to the Shadow Cabinet every year while the Labour Party was in opposition from 1951 to 1964. He was now a staunch Gaitskellite on the Labour right wing. He was Parliamentary Adviser to the Police Federation from 1955 to 1960 when he negotiated an increase in police pay with then-General Secretary Arthur Charles Evans. He ran for the Deputy Leadership of the party in 1960 as an opponent of unilateral nuclear disarmament, and despite the other candidate of the Labour right (George Brown) agreeing with him on this policy, he forced Brown to a second vote. In November 1961, Callaghan became Shadow Chancellor. When Hugh Gaitskell died in January 1963, Callaghan ran to succeed him, but came third in the leadership contest, which was won by Harold Wilson. However, he did gain the support of right-wingers, such as Denis Healey and Anthony Crosland, who wanted to prevent Wilson from being elected leader but who also did not trust George Brown."]}, {"page": "Ian Fleming", "response": ["After Ann Charteris's first husband died in the war, she expected to marry Fleming, but he decided to remain a bachelor. On 28 June 1945, she married the second Viscount Rothermere. Nevertheless, Charteris continued her affair with Fleming, travelling to Jamaica to see him under the pretext of visiting his friend and neighbour Noël Coward. In 1948 she gave birth to Fleming's daughter, Mary, who was stillborn. Rothermere divorced Charteris in 1951 because of her relationship with Fleming, and the couple married on 24 March 1952 in Jamaica, a few months before their son Caspar was born in August. Both Fleming and Ann had affairs during their marriage, she with Hugh Gaitskell, the Leader of the Labour Party and Leader of the Opposition. Fleming had a long-term affair in Jamaica with one of his neighbours, Blanche Blackwell, the mother of Chris Blackwell of Island Records."]}, {"page": "Suez Crisis", "response": ["Increasingly Nasser came to be viewed in British circles—and in particular by Eden—as a dictator, akin to Benito Mussolini. Ironically, in the buildup to the crisis, it was the Labour leader Hugh Gaitskell and the left-leaning tabloid newspaper The Mirror that first made the comparison between Nasser and Mussolini. Anglo-Egyptian relations would continue on their downward spiral.", "Eden was hosting a dinner for King Feisal II of Iraq and his Prime Minister, Nuri es-Said, when he learned the canal had been nationalised. They both unequivocally advised Eden to \"hit Nasser hard, hit him soon, and hit him by yourself\" – a stance shared by the vast majority of the British people in subsequent weeks. \"There is a lot of humbug about Suez,\" Guy Millard, one of Eden's private secretaries, later recorded. \"People forget that the policy at the time was extremely popular.\" Opposition leader Hugh Gaitskell was also at the dinner. He immediately agreed that military action might be inevitable, but warned Eden would have to keep the Americans closely informed. After a session of the House of Commons expressed anger against the Egyptian action on 27 July, Eden justifiably believed that Parliament would support him; Gaitskell spoke for his party when he called the nationalisation a \"high-handed and totally unjustifiable step\". When Eden made a ministerial broadcast on the nationalisation, Labour declined its right to reply."]}, {"page": "The Spectator", "response": ["In 1954, Wrench and his co-owner Angus Watson sold The Spectator to the barrister Ian Gilmour, who restored the Spectator tradition of simultaneously acting as editor. Having a libertarian and pro-European outlook, he \"enlivened the paper and injected a new element of irreverence, fun and controversy\". He was critical of both Anthony Eden's and Harold Macmillan's governments, and while supporting the Conservatives was also friendly to the Hugh Gaitskell wing of the Labour Party."]}, {"page": "Aneurin Bevan", "response": ["Bevan was named Minister of Labour in 1951, but resigned after two months in office, when the Attlee government proposed the introduction of prescription charges for dental and vision care and decided to transfer funds from the National Insurance Fund to pay for rearmament. His influence waned after his departure, although a left-wing group (not under his control) within the party became known as \"Bevanites\". When Attlee retired in 1955, Bevan unsuccessfully contested the party leadership with Hugh Gaitskell, but was appointed Shadow Colonial Secretary and later Shadow Foreign Secretary. In 1959, he was elected Deputy Leader of the Labour Party and held the post for a year until his death from stomach cancer at the age of 62.", "Bevan was instead appointed Minister of Labour in January 1951 in place of George Isaacs. The move was seen by some as a sideways or backwards step, although a potential rearmament program was expected to make the post of future importance. During his tenure, he helped to secure a deal for railwaymen which provided them with a significant pay increase. However, three months after his appointment, Hugh Gaitskell introduced a proposal of prescription charges for dental care and spectacles—created to save a potential £25m to meet the financial demands imposed by the Korean War. An infuriated Bevan stated that he would never be a member of a government that imposed charges on the National Health Service. The Labour MP David Marquand has stated that the savings were introduced by Gaitskell simply to \"impose his will\" upon Bevan who he saw as a political rival. Bevan resigned from his position two weeks later, stating both the proposed changes and the increase in military expenditure that necessitated the need for such proposals. Two other ministers, John Freeman and Harold Wilson, resigned at the same time. Bevan received unanimous support for his actions from his local Labour constituency leaders.", "Out of office, Bevan soon exacerbated the split within the Labour Party between the right and the left. For the next five years, he was the leader of the left wing of the Labour Party, who became known as Bevanites. They criticised high defence expenditure (especially for nuclear weapons), called for better relations with the Soviet Union, and opposed the party leader, Clement Attlee, on most issues. According to Richard Crossman, Bevan hated \"the in-fighting which you have to do in politics.... He wasn't cut out to be a leader, he was cut out to be a prophet\". In April 1954, Bevan resigned from the Labour parliamentary committee, having been rebuked by Attlee after accusing the Labour leader of surrendering to American pressure over a proposed multi-national defence organisation in Asia and the Pacific. He later said that he had resigned his position to \"call attention to the fact that their movement was in grave crisis\", and stated his belief that he would be have been party chairman by the following year if he had remained. In July of the same year, Bevan announced his intention to stand for election as the Treasurer of the Labour Party against Hugh Gaitskell. His nomination received a severe blow on the same day it was announced, when two unions that traditionally sided with the left, the National Union of Mineworkers and the Amalgamated Engineering Union, pledged their support for his opponent. Although unsuccessful in his bid, he did celebrate 25 years as the MP for Ebbw Vale.", "In his 2014 biography, Nick Thomas-Symonds described \"an outpouring of national mourning\" that followed Bevan's death. The Daily Herald stated that some MPs were seen to be crying in Parliament and described how there was \"sorrow at every street corner\" in the South Wales Valleys. Harold Macmillan ended his Prime Minister's Questions session in Parliament two days after Bevan's death by paying tribute to the opposition MP, describing him as \"a great personality and a great national figure\". Macmillan noted that despite being a \"controversial figure\" during his career, Bevan's death had seen an outpouring of genuine \"admiration and affection\". Labour leader Hugh Gaitskell also paid tribute to his former shadow cabinet member and ended his speech by labelling Bevan as \"one of the great men of our day\"."]}, {"page": "Chancellor of the Exchequer", "response": ["| Hugh Gaitskell"]}, {"page": "Harold Macmillan", "response": ["Macmillan saw himself as both a \"gownsman\" and a \"swordsman\" and would later display open contempt for other politicians (e.g. Rab Butler, Hugh Gaitskell, Harold Wilson) who, often through no fault of their own, had not seen military service in either World War.Campbell 2009, pp. 246–47", "Macmillan led the Conservatives to victory in the 1959 general election, increasing his party's majority from 60 to 100 seats. The campaign was based on the economic improvements achieved as well as the low unemployment and improving standard of living; the slogan \"Life's Better Under the Conservatives\" was matched by Macmillan's own 1957 remark, \"indeed let us be frank about it—most of our people have never had it so good,\" usually paraphrased as \"You've never had it so good.\" Such rhetoric reflected a new reality of working-class affluence; it has been argued that \"the key factor in the Conservative victory was that average real pay for industrial workers had risen since Churchill's 1951 victory by over 20 per cent\".Lamb, Macmillan Years, p. 62. The scale of the victory meant that not only had the Conservatives won three successive general elections, but they had also increased their majority each time. It sparked debate as to whether Labour (now led by Hugh Gaitskell) could win a general election again. The standard of living had risen enough that workers could participate in a consumer economy, shifting the working class concerns away from traditional Labour Party views.", "By the early 1960s, many were starting to find Macmillan's courtly and urbane Edwardian manners anachronistic, and satirical journals such as Private Eye and the television show That Was the Week That Was mercilessly mocked him as a doddering, clueless leader.Goodlad & Pearce, 2013 p.179 Macmillan's handling of the Vassall affair – in which an Admiralty clerk, John Vassall, was convicted in October 1962 of passing secrets to the Soviet Union – undermined his \"Super-Mac\" reputation for competence. D. R. Thorpe writes that from January 1963 \"Macmillan's strategy lay in ruins\", leaving him looking for a \"graceful exit\". The Vassall affair turned the press against him.Thorpe 2010, p. 613 In the same month, opposition leader Hugh Gaitskell died suddenly at the age of 56. With a general election due before the end of the following year, Gaitskell's death threw the future of British politics into fresh doubt. In the following month Harold Wilson was elected as the new Labour leader, and he proved to be a popular choice with the public."]}]}}