{"wiki_id": "http://www.wikidata.org/entity/Q337536", "itemLabel": "Nigel Waterson", "itemDescription": "British politician (born 1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Waterson", "wikipedia_page": {"main": "Nigel Christopher Waterson (born 12 October 1950) is a British former politician. He was the Conservative Member of Parliament for Eastbourne from 1992 until 2010. Waterson was a junior minister in the government of John Major. He has been the chairman of the Equity Release Council since 2012.", "link_mentions": [{"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Nigel Waterson", "| Nigel Waterson"]}, {"page": "1992 United Kingdom general election", "response": ["|Nigel Waterson"]}, {"page": "David Bellotti", "response": ["Two years later Bellotti was defeated by Nigel Waterson in the 1992 general election in which John Major's Conservative government was re-elected."]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Nigel Waterson"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Nigel Waterson"]}, {"page": "Nick Palmer", "response": ["He gave speeches in the Commons on animal welfare issues and in December 2009 he was one of 8 cross-party supporters of a bill introduced by Nigel Waterson to \"make provision for residents of care homes and sheltered accommodation to keep domestic pets in certain circumstances.\""]}, {"page": "Bow Group", "response": ["| Nigel Waterson  "]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Eastbourne || Nigel Waterson || Conservative || Nigel Waterson || Conservative"]}, {"page": "Eastbourne (UK Parliament constituency)", "response": ["| Nigel Waterson"]}, {"page": "Willingdon and Jevington", "response": ["Wannock below the South Downs between the villages of Polegate and Jevington. It has a village hall, but no church, pub or shops. It has 300 suburban homes, mainly bungalows housing elderly residents. There were once two tea gardens in Wannock which were popular with coach parties visiting from nearby Eastbourne. A dance hall stood on stilts over the local beauty spot of Wannock Glen. Wannock may be a Saxon place name; according to one source, Wannock supposedly contains the element \"Wan\" from \"Woden\"Castleden, Rodney. 'The Wilmington Giant: The Quest For a Lost Myth. Turnstone Press, 1983, The University of Michigan. , . Length: 208 pages. page 62 Wannock is mentioned in the Domesday Book (1086) and in an Napoleonic assessment/inventory of the British south coast defences. There is a manor Wannock Place, two medieval cottages and a cottage which was a watermill. One medieval cottage is called \"Stream Cottage\", the other medieval cottage is owned by Nigel Waterson, former local MP. The area was once known for its walnut groves and some house gardens still contain walnut trees."]}, {"page": "Ernle Money", "response": ["Money retired to Eastbourne in the 1990s. In 2010 he was reported in local press urging voters not to re-elect Eastbourne's Conservative MP Nigel Waterson but instead to vote for his LibDem opponent Stephen Lloyd.  Money had homes in both Eastbourne and Malta."]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Nigel Waterson; MP for Eastbourne (1992–2010)"]}, {"page": "Leeds Grammar School", "response": ["* Nigel Waterson MP (b. 1950) - Member of Parliament for Eastbourne"]}, {"page": "Waterson", "response": ["* Nigel Waterson (born 1950), Member of Parliament for Eastbourne"]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| Eastbourne||style=\"background-color: \"| ||Conservative||style=\"background-color: \"| ||Stephen Lloyd (LD)||Gain.  Defeated incumbent Nigel Waterson"]}, {"page": "Stephen Lloyd", "response": ["In 2002, Lloyd was selected by the Liberal Democrats to be their next candidate for the constituency of Eastbourne in East Sussex. Viewed as a high target seat for the party, selection was competitive and he beat future parliamentary colleagues Duncan Hames and Tessa Munt to the final nomination. Lloyd spent the next three years becoming engaged in local causes, in preparation for the next general election. At the 2005 general election, Lloyd lost to the sitting Conservative MP, Nigel Waterson.", "At the 2010 general election, Lloyd's campaign centred on local issues and highlighting of the expenses claims of his Conservative Party opponent, Nigel Waterson. He also asked to be lent votes by local supporters of the Labour and Green parties. Liberal Democrat leader Nick Clegg hosted his eve of poll rally, where former Conservative MP Ernle Money, who had moved to Eastbourne, pledged his support to Lloyd. On 7 May, Lloyd was elected the MP for Eastbourne with a majority of 3,435 votes."]}, {"page": "List of MPs who lost their seat in the 2010 United Kingdom general election", "response": ["|Nigel Waterson"]}]}}