{"wiki_id": "http://www.wikidata.org/entity/Q3376627", "itemLabel": "Peter Guillam", "itemDescription": "Fictional intelligence officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Guillam", "wikipedia_page": {"main": "Pierre Guillame, better known by the anglicised form Peter Guillam, is a fictional character in John le Carré's series of espionage novels. He first appears in Call for the Dead. He is the trusted right-hand-man of George Smiley, the protagonist of many of le Carre's novels, and is often the person Smiley turns to for assistance when he fears he cannot trust his peers or subordinates.", "link_mentions": [{"page": "The Spy Who Came in from the Cold", "response": ["The Spy Who Came in from the Cold is a 1963 Cold War spy novel by the British author John le Carré. It depicts Alec Leamas, a British agent, being sent to East Germany as a faux defector to sow disinformation about a powerful East German intelligence officer. It serves as a sequel to le Carré's previous novels Call for the Dead and A Murder of Quality, which also featured the fictitious British intelligence organization, \"The Circus\", and its agents George Smiley and Peter Guillam.", "* Peter Guillam: British spy"]}, {"page": "Casabianca (poem)", "response": ["In the 2011 film Tinker Tailor Soldier Spy, Peter Guillam is heard reciting the opening lines as he and George Smiley check microphones in a safe house."]}, {"page": "Tinker Tailor Soldier Spy", "response": ["These are the fifth, sixth, and seventh le Carré spy novels featuring George Smiley (The first four being: Call for the Dead, A Murder of Quality, The Spy Who Came in from the Cold, and The Looking Glass War). Two of the characters, Peter Guillam and Inspector Mendel, first appeared in le Carré's first book, Call for the Dead (1961).", "The failure resulted in the dismissal of Control, Smiley, and allies such as Connie Sachs and Gerald Westerby, and their replacement by a new guard consisting of Percy Alleline, Toby Esterhase, Bill Haydon, and Roy Bland. Control has since died, and Smiley's former protege, Peter Guillam, has been demoted to the \"scalphunters\".", "* Peter Guillam: He is the head of the scalphunters, the section of the Circus used in operations that require physical action and/or violence, and is based in Brixton. Son of a French businessman and an Englishwoman, he is a longtime associate of Smiley.", "Swedish director Tomas Alfredson made a film adaptation in 2011, based on a screenplay by Bridget O'Connor and Peter Straughan. The film was released in the UK and Ireland on 16 September 2011, and in the United States on 9 December 2011. It included a cameo appearance by John le Carré in the Christmas party scene as the older man in the grey suit who stands suddenly to sing the Soviet anthem. The film received numerous Academy Award nominations including a nomination for Best Actor for Gary Oldman for his role as George Smiley. The film also starred Colin Firth as Bill Haydon, Benedict Cumberbatch as Peter Guillam, Tom Hardy as Ricki Tarr, and Mark Strong as Jim Prideaux."]}, {"page": "George Smiley", "response": ["Smiley first appears in Call for the Dead, le Carré's debut novel. After an introductory chapter documenting Smiley's wartime bravery, the narrative moves to 1960, which finds the formerly heroic Smiley working a menial intelligence job, security-clearing civil servants. After a man he interviewed apparently commits suicide in despair over being a suspected communist, Smiley resigns from the Circus in disgust; the revelation that the man's death may in fact have been a murder spurs Smiley to launch an independent investigation with the help of his protege, Peter Guillam, and police detective Oliver Mendel. Smiley's investigation uncovers that the \"suicide\" was in fact a murder perpetrated by an East German spy ring operating in the UK and being operated by one of his own former agents, whom he accidentally kills in a physical altercation. Although the Circus offers him his job back as a reward, Smiley declines, instead leaving England for a tentative reunion with Ann, who had earlier left him for a racing car driver. Smiley spends much of the story bemoaning the loss of the talented agents who were his mentors prior to the war, and their replacement by such talentless bureaucrats as the current head of service, Maston, who is widely, if secretly, mocked.", "Several years pass between Smiley's appearance in The Looking Glass War, set circa 1964, and Tinker Tailor Soldier Spy, which takes place in 1973. During this period, Smiley's position in the Circus comes to be threatened by his contemporary Bill Haydon, proteges Toby Esterhase and Roy Bland, and ambitious newcomer Percy Alleline. Alleline develops a personal feud with Control due to the latter's class and ethnic prejudice against Percy's Scottish heritage, prompting factions to form within the Circus, with Control, Smiley, and Peter Guillam on one side and Alleline, Haydon, Esterhase, and Bland on the other. When Control is eased out of the Circus in late 1972 after the capture of agent Jim Prideaux in Czechoslovakia, Smiley too is forced out. The Circus is taken over by Alleline, with Haydon running \"London Station\", a branch overseeing all of the service's spy networks. Guillam remains in the Circus as Smiley's sole resource/ally, albeit in a greatly diminished position.", "Smiley appears in le Carré's 2017 novel A Legacy of Spies, set after 2010. At the end of the novel, which explores fallout from the events depicted in The Spy Who Came In from the Cold, Smiley meets with the novel's central character, Peter Guillam. The nonagenarian Smiley is now a resident of Freiburg, Germany, where he lives in a small apartment and conducts research at a library. The novel portrays him as still visited occasionally by his wife, Ann, and in touch with his old associate Jim Prideaux. Speaking with Guillam, he contends that his work had ultimately been for the benefit of Europe."]}, {"page": "Smiley's People", "response": ["Smiley flies to Hamburg and tracks down Claus Kretzschmar, an old associate of Leipzig and owner of the night club where the photograph was taken. He finds that Leipzig has been murdered by Karla's agents. Kretzschmar gives Smiley tape recordings of Leipzig and Kirov. Smiley hastens to Paris where, with help from his old colleague Peter Guillam, he gets Maria to safety. He also learns that Kirov has been summoned back to Moscow, and has probably been killed for his indiscretions.", "*Peter Guillam – Smiley's friend and former lieutenant, now head of the British Intelligence section in the Paris embassy"]}, {"page": "The Honourable Schoolboy", "response": ["In the aftermath, the CIA detains and interrogates Nelson, freezing the Circus out. The success of the operation yields top Circus jobs for Enderby, who becomes Chief, and Collins, who becomes Head of Operations.  Smiley and Connie Sachs are retired and most of the older generation of Circus personnel are moved on. In the aftermath of the debacle, Peter Guillam contemplates the possibility that Smiley allowed the CIA to gain the upper hand so as to have himself removed as head of the Circus.", "* Peter Guillam — Circus \"cupbearer\" to Smiley", "* Molly Meakin — skilful, junior staff; a pretty Circus girl who catches Peter Guillam's eye"]}, {"page": "The Duchess of Malfi", "response": ["* In the culmination of John le Carré's Call for the Dead, Smiley is reported to have been quoting from The Duchess of Malfi in his delirium – \"I bade thee when I was distracted of my wits go kill my dearest friend, and thou hast done it\", according to Peter Guillam."]}, {"page": "Michael Jayston", "response": ["He made two appearances in the anthology series Thriller in 1974, and in 1975 played Quiller, a spy who never used a gun, in the short-lived British TV series of the same name. He appeared as Dornford Yates' gentleman hero Jonathan Mansel in the 1977 BBC adaptation of She Fell Among Thieves. In 1979, he played Peter Guillam opposite Alec Guinness in the series Tinker Tailor Soldier Spy.", "Jayston has recorded most of John le Carré's novels in audiobook format, providing a link with his role as Peter Guillam in the 1979 TV series Tinker Tailor Soldier Spy. He was also the storyteller in the BBC radio readings of the novels  Rogue Male and Rogue Justice, both written by Geoffrey Household.", "*Tinker Tailor Soldier Spy - Peter Guillam (1979)"]}, {"page": "Benedict Cumberbatch", "response": ["In 2006, Cumberbatch played late 18th/early 19th century British parliamentarian William Pitt the Younger in Amazing Grace, a role that garnered him a nomination for the London Film Critics Circle \"British Breakthrough Acting Award\". In Atonement (2007), Cumberbatch played what The Guardian called one of his \"small parts in big films\", and came to the attention of Sue Vertue and Stephen Moffat, who would later cast him in Sherlock.Benedict Cumberbatch: London and Hollywood, By Lynnette Porter, Andrews UK Limited, 2016 In 2008 he had a supporting role in The Other Boleyn Girl, and the next year he appeared in the Charles Darwin biographical film Creation as Darwin's friend Joseph Hooker. In 2010, he appeared in The Whistleblower as well as Four Lions. He portrayed Peter Guillam, George Smiley's right-hand man, in the 2011 adaptation of the John le Carré novel Tinker Tailor Soldier Spy. The film was directed by Tomas Alfredson and featured Gary Oldman and Colin Firth. Cumberbatch played Major Jamie Stewart in Steven Spielberg's War Horse in 2011."]}, {"page": "Toby Esterhase", "response": ["Esterhase is exceptionally short; he's called \"Tiny Tobe\" by colleague Connie SachsTinker Tailor Soldier Spy, 91-92. and known around The Circus as \"Snow White\" for his meticulously maintained white hair,Tinker Tailor Soldier Spy, 178. which he covers with a net when he sleeps.Tinker Tailor Soldier Spy, 179. He further gained the nickname \"Our shadow foreign secretary\" from Bill Haydon.Tinker Tailor Soldier Spy, 178. Esterhase is known for multiple eccentricities, including \"dressing like a male model,\" washing his own clothes rather than having them laundered,Tinker Tailor Soldier Spy, 179. never smiling,Tinker Tailor Soldier Spy, 91-92. and sending all of his coworkers bottles of alcohol for Christmas. He has a unique manner of speech which vacillates between ultra-correct English and unusual syntax. Esterhase's former espionage partner, Peter Guillam, indicates that he's something of a polyglot, musing \"Toby spoke no known language perfectly, but he spoke them all.\" In The Secret Pilgrim, though, he is seen to speak fluent Hungarian to a pair of fellow expatriates, during which the narrator Ned notes that he becomes more animate and expressive than when speaking any other language.The Secret Pilgrim, 144-145. Guillam further recounts that Esterhase appears impervious to fear, recalling an incident in which he stopped to tip hotel employees while fleeing would-be captors. ", "George Smiley recruited Esterhase (Eszterházy — Hungarian spelling — or Esterházy — German spelling), a Hungarian, in Vienna sometime around World War II, when he was a starving student living in the ruins of a museum of which his late uncle had been curator.John Le Carre, Tinker Tailor Soldier Spy (London: Coronet Books/Hodder & Stoughton, 1989), 150. . (Esterházy is the name of a historically prominent Hungarian noble family; evidently, Toby Esterhase either was or pretended to be a member of that family, though this is never explicitly mentioned). He was paired with Peter Guillam on overseas missions, which had varying degrees of success, including a posting in Bern, Switzerland in which they were suspected of seditious activities by local police and had to flee the country. He eventually rose to be head of the Lamplighter division sometime prior to 1973.", "After patient investigation, Smiley decides to interview Esterhase in private, in a safe house meeting to which he has been lured on a pretext by Peter Guillam. After realizing that he's been taken advantage of, and that Smiley has the official backing of Whitehall, Esterhase helps Smiley entrap the real mole, Bill Haydon.", "Esterhase is briefly mentioned in a cameo role in A Legacy of Spies where he, together with Percy Alleline and Roy Bland, meet Peter Guillam at the field dispatch office at Heathrow Airport during a flashback; whether Toby is still alive in the present day is not revealed. John Le Carre, A Legacy of Spies (London: Viking, 2017), 149 and also 145. . "]}, {"page": "Call for the Dead", "response": ["Now hospitalised, Smiley directs the case direction from bed rest. Mendel discovers that Elsa attended a local theatre twice a month, in which she liaises with someone the theatre staff believe is her husband. Upon further investigation, this turns out to be \"Blondie\", and Mendel learns that the two always carry music cases to each performance, which they trade. With assistance from fellow Circus agent and Smiley's protégé Peter Guillam, the men learn that \"Blondie\" is actually called Hans-Dieter Mundt, and is an East German agent working undercover as a diplomatic member of the East German Steel Mission for one Dieter Frey. Smiley becomes concerned at this revelation, as Frey was one his operatives during the war. Fanatically opposed to the Nazis, Frey was repeatedly antagonistic about them at great risk to himself. Not only was he a dissident, but he was physically disabled in one leg and needed a cane for most of his life, at a time where the Nazis euthanised many physically and mentally disabled people. Smiley recommended Frey to the Circus, although he never knew if Frey was accepted or not on account of the Circus' rules on anonymity. Frey was later captured by the Nazis and sentenced to a stretch in a political prison camp doing hard labour. After the war, however, Frey rose through the ranks of East German government service and became one of its most important agents. Smiley also concludes that Frey is likely using a courier service to access only one highly placed domestic agent. Shortly after this revelation, Guillam reports that Mundt has fled to East Germany after he was identified by cabin crew on a flight out of London.", "* Peter Guillam – an officer of the Circus subordinate to Smiley", "Call for the Dead was first adapted as a BBC Radio 4 drama in 1978. Subsequently, it was the first story to be broadcast in BBC Radio 4's major series to feature all the Smiley novels (\"The Complete Smiley\"), with Simon Russell Beale in the main role. Other characters and actors are as follows; Inspector Mendel—Kenneth Cranham, Elsa Fennan—Eleanor Bron, Ann Smiley—Anna Chancellor, Peter Guillam—Richard Dillane, Maston—James Laurenson, Dieter Frey—Henry Goodman, Adam Scarr/Mundt—Sam Dale, Ludo Oriel—Janice Acquah, Nursing Sister—Caroline Guthrie with Benjamin Askew and Jonathan Tafler. The novel was adapted as a 90-minute drama by Robert Forrest, produced by Patrick Raynor, and was transmitted, also on BBC Radio 4, on 23 May 2009."]}, {"page": "The Secret Pilgrim", "response": ["Brandt refuses to take Bella back for then-unknown reasons, which gives Ned the impression that Haydon informed Brandt of Bella's infidelity, out of mischief. In 1989, during a lunch with Toby Esterhase, Ned learns that Esterhase and Peter Guillam were in Moscow as a part of an intelligence delegation. During their guided tour in Moscow Centre headquarters, they run into a familiar figure who is none other than Captain Brandt. It was Brandt who had betrayed the previous network, as well as the new one."]}, {"page": "Richard Dillane", "response": ["He was Wernher von Braun in the BBC television docudrama Space Race, Nero in Howard Brenton's play Paul at the National Theatre of Great Britain and appeared several times as Stephen Maturin in the BBC radio adaptations of the Patrick O'Brian Aubrey–Maturin novels and Peter Guillam in three John le Carré adaptations."]}, {"page": "Karla (character)", "response": ["Much of Karla's history is unconfirmed rumour, passed by Smiley to his protégé Peter Guillam.  Among the rumours are: that his father was a professional intelligence officer, first for the Czarist Okhrana and later for the Bolshevist Cheka; that as a boy Karla worked as a kitchen boy on a train in occupied Siberia during the Russo-Japanese War of 1904–1905 (putting his birth somewhere in the late 19th century); and that he was trained in espionage by \"Berg\" (a possible reference to an alias used by Alexander Mikhailovich Orlov), which Smiley compares to \"being taught music by a great composer.\"", "Smiley recounts what little he knows of Karla's history to his protege, Peter Guillam, including his interview with Karla in Delhi, and opines that Karla is a \"fanatic\", which he hopes will one day cause his downfall. After Jim Prideaux is freed from capture by the Soviets, Smiley interrogates him, learning that Karla came to visit Prideaux in prison and showed him that he still had Smiley's lighter."]}, {"page": "Tinker Tailor Soldier Spy (film)", "response": ["Field agent Ricki Tarr warns undersecretary Oliver Lacon that there is a mole at the top of the Circus. Knowing that Control had the same theory, Lacon asks Smiley to investigate, helped by Tarr's boss Peter Guillam and retired Special Branch officer Mendel."]}, {"page": "Tinker Tailor Soldier Spy (TV series)", "response": ["Smiley begins a secret investigation into the events surrounding Operation Testify, believing it will lead him to the identity of the mole, whom Moscow Centre has given the cover name Gerald. With the help of his protégé, Peter Guillam, who is still in the Circus, he gradually uncovers a labyrinthine plot as well as the ultimate betrayal—of country, the service and friendship.", "* Michael Jayston as Peter Guillam"]}, {"page": "Smiley's People (TV series)", "response": ["*Michael Byrne as Peter Guillam"]}, {"page": "Control (fictional character)", "response": ["In A Legacy of Spies, during Peter Guillam's initial interview, it is revealed that there have been at least four \"Controls\" over the years."]}]}}