{"wiki_id": "http://www.wikidata.org/entity/Q3378501", "itemLabel": "A. L. Morton", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/A._L._Morton", "wikipedia_page": {"main": "Arthur Leslie Morton (4 July 1903 – 23 October 1987) was an English Marxist historian. He worked as an independent scholar; from 1946 onwards he was the Chair of the Historians Group of the Communist Party of Great Britain (CPGB). He is best known for A People's History of England, but he also did valuable work on William Blake and the Ranters, and for the study The English Utopia.", "link_mentions": [{"page": "Historiography", "response": ["Other important Marxist historians included Eric Hobsbawm, C. L. R. James, Raphael Samuel, A. L. Morton and Brian Pearce."]}, {"page": "Abiezer Coppe", "response": ["Coppe has been written about by Norman Cohn, M.A. Poultney and the Marxist historians A. L. Morton and Christopher Hill."]}, {"page": "A. L. Lloyd", "response": ["During this decade, Lloyd joined the Communist Party of Great BritainBrocken p. 25 and was strongly influenced by the writings of the Marxist historian, A. L. Morton, particularly his 1938 book A People's History of England.Brocken p. 26 In 1937, Lloyd's article \"The People's own Poetry\" was published in the Daily Worker (since 1966 renamed Morning Star) newspaper."]}, {"page": "Edgell Rickword", "response": ["He joined the Communist Party of Great Britain in 1934,Hobday, p. 153. and became increasingly active in political work during the period of the Spanish Civil War; while still writing poetry. He was friendly with Randall Swingler, the 'official' poetry voice of the CPGB, and with Jack Lindsay, his only real rival as a theoretician. He was closely connected with the leading cultural figures on the hard Left, such as Mulk Raj Anand, Ralph Fox, Julius Lipton, A. L. Morton, Sylvia Townsend Warner and Alick West. When Lawrence & Wishart was created as the official CPGB publishing house, in 1936, Rickword became a director.Hobday, p. 168. It was through Rickword that Lawrence & Wishart published Nancy Cunard's Negro: An Anthology, though at her own expense.Anne Chisholm, Nancy Cunard: A Biography (1979), p. 277."]}, {"page": "Leslie Morton", "response": ["#REDIRECT A. L. Morton"]}, {"page": "Arthur Leslie Morton", "response": ["#REDIRECT A. L. Morton"]}, {"page": "People's history", "response": ["Lucien Febvre first used the phrase \"histoire vue d'en bas et non d'en haut\" (history seen from below and not from above) in 1932 when praising Albert Mathiez for seeking to tell the \"histoire des masses et non de vedettes\" (history of the masses and not of starlets).When the State Trembled 1442660228 Reinhold Kramer, Tom Mitchell - 2010 \"It was Lucien Febvre who first used the phrase 'history from below' when in 1932 he observed that Albert Mathiez, a founding member of the Annales tradition, had sought 'histoire des masses et non de vedettes; histoire vue d'en bas en non ...\" It was also used in the title of A. L. Morton's 1938 book, A People's History of England.AL Morton Compendium of Communist Biographies, Graham Stevenson, Accessed Feb 2014 Yet it was E. P. Thompson's essay History from Below in The Times Literary Supplement (1966) which brought the phrase to the forefront of historiography from the 1970s.Black and MacRaild wrote that Thompson's 1966 essay, 'History from below', in the Times Literary Supplement  \"was the real starting point, not only of the term, but of attempts to define it, to intellectualise about it, and to give it a coherent agenda....\" It was popularized among non-historians by Howard Zinn's 1980 book, A People's History of the United States.", "* A People's History of England by A. L. Morton (Victor Gollancz: London, 1938)"]}, {"page": "A.L. Morton", "response": ["#REDIRECT A. L. Morton"]}, {"page": "Thomas A. Jackson", "response": [" Jackson was married to another SPGB founder member, Kate Hawkins, a socialist and suffragette descended from naval commander (and early slave trader) Sir John Hawkins and a cousin of Anthony Hope, the author of The Prisoner of Zenda. The couple had three daughters: Eleanor (who died in infancy), Stella and Vivien, who was a teacher at Summerhill School and married A. L. Morton. Kate died in January 1927, having been committed to Claybury Hospital due to declining mental health. Jackson married a second time later that year, to Lydia Packman: she died unexpectedly in 1943 following a minor operation. Before 1914 he was notable in the North and Wales, and for his flowing locks according to his obituary. His Manchester Guardian obituary said he was a \"Marxist scholar of weight\", and that Solo Trumpet was a \"racy autobiography\". Historian Stuart Macintyre has described Jackson's book Dialectics: The Logic of Marxism and its Critics as \" perhaps... the most considerable literary achievement of Jackson's generation of working-class intellectuals\"."]}, {"page": "Jacob Bauthumley", "response": ["Historian E. P. Thompson calls his views 'quasi-pantheistic' in their re-definition of God and Christ, and quotes A. L. Morton to the effect that this is the central Ranter doctrine.Witness Against the Beast: William Blake and the Moral Law (1993), p. 26."]}, {"page": "A L Morton", "response": ["#REDIRECT A. L. Morton "]}, {"page": "AL Morton", "response": ["#REDIRECT A. L. Morton "]}, {"page": "Philip Spratt", "response": ["Philip Spratt won a university scholarship in 1921 to study Mathematics at Downing College, Cambridge. He writes in his memoirs: \"But I was in no mood to devote myself to my proper studies, or to associate with the dull dogs who stuck to theirs. I dabbled in literature and philosophy and psychology and anthropology.\"Philip Spratt. Blowing Up India: Reminiscences and Reflections of a Comintern Emissary. Calcutta: Prachi Prakashan, 1955. p. 10 He was awarded a First-class degree on completing the Mathematics tripos. He joined the Union Society, the University Labour Club and a private discussion society called the Heretics, of which Charles Kay Ogden was president; Frank P. Ramsey, I.A. Richards and Patrick Blackett often attended. Philip Spratt, Maurice Dobb, John Desmond Bernal, Ivor Montagu, the historian Allen Hutt, A. L. Morton, A. L. Bacharach, Barnet Woolf and Michael Roberts comprised the tiny handful of Communist Party members at the university at that time. Spratt, Woolf and Roberts would sell the Worker's Weekly to railwaymen at the town railway station or canvass the working-class areas of Cambridge. Spratt worked, for a while, at the Labour Research Department in the Metropolitan Borough of Deptford, and was a member of the London University Labour Party."]}, {"page": "List of members of Peterhouse, Cambridge", "response": ["* A. L. Morton, Marxist historian"]}, {"page": "Arthur Morton", "response": ["*A. L. Morton (1903–1987), English Marxist historian"]}, {"page": "Marxist schools of thought", "response": ["The British Marxist historians were a circle of scholars that originated in the Communist Party of Great Britain in the 1930s, eventually forming the Communist Party Historians Group in 1946. They shared a common interest in \"history from below\" and class structure in early capitalist society. Important members of the group included Maurice Dobb, Dona Torr, A. L. Morton, Rodney Hilton, E. P. Thompson, Eric Hobsbawm, George Rudé, Christopher Hill, Dorothy Thompson, John Saville, Victor Kiernan and Raphael Samuel."]}, {"page": "Communist Party Historians Group", "response": ["A subdivision of the Communist Party of Great Britain (CPGB), the Communist Party Historians Group (CPHG) formed a highly influential cluster of British Marxist historians, who contributed to \"history from below\" from 1946 to 1956. Famous members included such leading lights of 20th-century British historiography as Christopher Hill, Eric Hobsbawm, Raphael Samuel and E. P. Thompson, as well as non-academics like A. L. Morton and Brian Pearce. ", "*A. L. Morton"]}, {"page": "Communist Party of Great Britain", "response": ["* A. L. Morton"]}, {"page": "Marxist historiography", "response": ["Other important British Marxist historians included Raphael Samuel (1934–1996), A. L. Morton (1903–1987), and Brian Pearce (1915–2008)."]}, {"page": "Historiography of the United Kingdom", "response": ["Other important Marxist historians included Eric Hobsbawm, C. L. R. James, Raphael Samuel, A. L. Morton and Brian Pearce."]}]}}