{"wiki_id": "http://www.wikidata.org/entity/Q3376789", "itemLabel": "Peter O'Dowd", "itemDescription": "English footballer (1908-1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_O%27Dowd", "wikipedia_page": {"main": "James Peter O'Dowd (26 February 1908 – 8 May 1964) was an English professional footballer who played as a central defender. He won three caps for the England national football team. He retired at the age of 29 after suffering a broken leg while playing for Torquay United.", "link_mentions": [{"page": "O'Dowd", "response": ["* Peter O'Dowd (1908–1964), English professional footballer"]}, {"page": "Valenciennes FC", "response": ["In the second division's inaugural season, Valenciennes finished in 7th place in its group. In the following season, the league table was converted into a single table and Valenciennes finished in 2nd-place position earning promotion to Division 1 as a result. During this period, the club was notably led by foreign players such as Englishmen Peter O'Dowd and George Gibson and the German-born attackers Édouard Waggi and Ignace Kowalczyk. In the club's first season in Division 1, Valenciennes finished 15th place falling back to Division 2. The club finished equal on points with Red Star Olympique, but due to having less wins and a lesser goal difference, Valenciennes were relegated. After suffering relegation, the club brought in a new president known by the surname of Turbot. Soon after arriving, Turbot released several of the club's international players and brought in the likes of Ernest Libérati to replace them. The transition was a success with the club earning promotion back to Division 1 in 1937. However, Valenciennes stint back in Division 1 was the equivalent of its first. The club finished in last place in the 1937–38 season and relegated back to Division 2. Due to World War II, Valenciennes reverted to amateur status and spent three of the six seasons in wartime playing amateur league football."]}, {"page": "List of foreign Ligue 1 players: E", "response": ["* James Peter O'Dowd – Valenciennes – 1935–36"]}, {"page": "O'Dowd, Peter", "response": ["#redirectPeter O'Dowd"]}]}}