{"wiki_id": "http://www.wikidata.org/entity/Q3379031", "itemLabel": "Philip Louis Pratley", "itemDescription": "Canadian civil engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Louis_Pratley", "wikipedia_page": {"main": "Philip Louis Pratley (December 4, 1884 – August 1, 1958) was an English-born Canadian bridge designer.He was born in Liverpool and received a BSc and BEng from the University of Liverpool. Pratley then apprenticed with Francis Morton & Co. Ltd. in Garston, Lancashire. In 1906, he came to Canada, first working for the Locomotive and Machine Company and then for the Dominion Bridge Company, both based in Montreal. In 1908, he earned a MEng from the University of Liverpool. In 1909, Pratley played an important role in the planning of the Quebec Bridge over the Saint Lawrence River. He went on to work with the Saint Lawrence bridge company in the construction of the Quebec bridge. He was also involved in the construction of the Boucanée River Viaduct (1913) and the Saint John Highway Arch Bridge (1915) in New Brunswick. In 1920, he conducted a review of the bridges on the Grand Trunk Railway on behalf of the Canadian government. The following year, Pratley formed the consulting company Monsarrat & Pratley in partnership with Charles Monsarrat. The company was responsible for the design and supervision of construction of the Jacques Cartier Bridge at Montreal, the Île d'Orléans Bridge at Quebec City, the Lions Gate Bridge at Vancouver, the Angus L. Macdonald Bridge at Halifax, Nova Scotia and the Burlington Bay Skyway Bridge near Hamilton, Ontario.At the time of his death, Pratley was working on the Champlain Bridge at Montreal and the South Channel Bridge of Three Nations Crossing at Cornwall, Ontario. His son, H. Hugh L. Pratley, was also a bridge designer, whose work included collaborating with his father on the Angus L. Macdonald Bridge, and completing the Champlain Bridge.In 2005, Pratley was designated a Person of National Historic Significance by the government of Canada. A commemorative plaque has been placed at the northern approach to the Jacques Cartier Bridge in Montreal.", "link_mentions": [{"page": "Jacques Cartier Bridge", "response": ["Discussions began as early as 1874 about the construction of a new bridge to alleviate the congestion on Victoria Bridge, which was then a rail-only bridge, the wintertime ice bridge and the ferries used to connect the city to its south shore. The decision to build the bridge was made official in 1924. The bridge was designed by engineer Philip Louis Pratley."]}, {"page": "Angus L. Macdonald Bridge", "response": ["It is named after the former premier of Nova Scotia, Angus L. Macdonald, who had died in 1954 and had been instrumental in having the bridge built. The bridge was designed by Philip Louis Pratley, one of Canada's foremost long-span bridge designers who had also been responsible for the Lions Gate Bridge in Vancouver. The bridges have a similar design, which is most notable in the towers. The contractor was Dominion Bridge Company Ltd."]}, {"page": "Reversing Falls Bridge", "response": ["The first bridge was a suspension bridge, built by Joseph Tomlinson III, measured 190 m in length. Its replacement, the current steel arch structure or Saint John Highway Arch Bridge (designed by Philip Louis Pratley), was opened to public use alongside the original in 1915.  Both structures have shared the site of this crossing with the Reversing Falls Railway Bridge since 1885. It is also known as the floating bridge."]}, {"page": "Dominion Bridge Company", "response": ["In 1890 civil engineer for various railways James Ross replaced Job Abbott as president of the company. Although credited to the drive of Ross, vice-president James Pawley Dawes lead the developed via joint-venture the St Lawrence Bridge Company to construct the Quebec Bridge. George Herrick Duggan joined the Engineering Department in 1886, becoming Chief Engineer in 1901, and rose to become President of the company.  Another notable employee was Philip Louis Pratley, a Person of National Historic Significance."]}, {"page": "Persons of National Historic Significance", "response": ["|Philip Louis Pratleyhttp://www.passrob.com/documents/philip-louis-pratley-web.pdf"]}, {"page": "Charles Monsarrat", "response": ["He was born in Montreal and was educated by private tuition and at the High School of Montreal. Monsarrat joined the Canadian Pacific Railway as a structural draftsman; in 1903, he became chief engineer of bridges. He became a member of the Canadian Society of Civil Engineers (later the Engineering Institute of Canada) in 1898 and was vice-president in 1917. He married Mary Alice Foster in 1898. Monsarrat served with the Royal Highlanders in France during World War I, becoming lieutenant-colonel in 1915. From 1911 to 1918, he was president and chief engineer of the Quebec Bridge Board. Monsarrat also served as a consulting engineer to the Canadian government and to the Canadian National Railway. In 1921, he became a partner in a consulting company with Philip Louis Pratley. The company was responsible for the design and supervision of construction for the Jacques Cartier Bridge at Montreal, the Île d'Orléans Bridge at Quebec City, the Ambassador Bridge between Detroit and Windsor, the Lions Gate Bridge at Vancouver and the Angus L. Macdonald Bridge at Halifax, Nova Scotia."]}, {"page": "Phillip Pratley", "response": ["#REDIRECT Philip Louis Pratley"]}, {"page": "Boucanée River", "response": ["In 1913 Boucanée River Viaduct was built for the National Transcontinental Railway near Rivieres du Loup, Quebec by designer Philip Louis Pratley."]}, {"page": "Pratley", "response": ["*Philip Louis Pratley (1884–1958), English-born Canadian bridge designer"]}]}}