{"wiki_id": "http://www.wikidata.org/entity/Q3376889", "itemLabel": "Peter Squires", "itemDescription": "English county cricketer and international rugby union player (born 1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Squires_(sportsman)", "wikipedia_page": {"main": "Peter John Squires (born  (1951-08-04) 4 August 1951) is an English former rugby union player and a first-class cricketer, who played in forty nine first-class matches for Yorkshire County Cricket Club between 1972 and 1976.Squires was born 4 August 1951 in Ripon, Yorkshire, England. He was educated at both Ripon Grammar School and York St John University. Despite his healthy number of appearances, this right-handed opening batsman found runs hard to come by, scoring 1,271 at an average of 16.72, with a best score of 70.  He was no more prolific in his fifty six List A one day matches from 1971 to 1976, making 708 runs at 16.46 with a top score of 79 not out.  The only ball he bowled in one day cricket went to the boundary, and his 6.2 overs in first-class cricket cost 32 runs without success. Squires took fourteen first-class catches. He played club cricket for Manningham Mills C.C.as well as for Harrogate C.C.\nSquires was better known for his rugby union exploits, playing on the wing for Ripon R.U.F.C. and Harrogate R.U.F.C. and twenty nine times for England in the 1970s, scoring six tries, as well as playing for the British and Irish Lions on the 1977 British Lions tour to New Zealand.  He continued to play for Ripon into his early forties.  He played in England's 23-6 victory over Australia at Twickenham in January 1976.\nSquires also performed a stint at Harrogate Grammar School as games teacher, coaching the senior boys primarily in rugby union, but also in other sports such as cricket, hockey and athletics.\nHe is currently the Business Development Manager for Wharfe Bank Brewery in Pool in Wharfedale, near Otley in Yorkshire.", "link_mentions": [{"page": "York St John University", "response": ["* Peter Squires, former England rugby international"]}, {"page": "Ripon Grammar School", "response": ["British Lions player Sir Ian McGeechan officially opened the school's new £1m world-class all-weather 3G pitch in February 2020, an event also attended by past pupil Peter Squires, British Lion & England Rugby Union International/Yorkshire County Cricketer.", "* Peter Squires, British Lion & England Rugby Union International/Yorkshire County Cricketer"]}, {"page": "Keith Smith (rugby)", "response": ["His first English appearance was a disappointing 12-12 draw against France played at Parc des Princes in Paris on 2 March 1974. In this game his centre pairing was Coventry’s Geoff Evans. Peter Squires and Alan Old also played alongside him, they were both from his Yorkshire club. The following day over 200 people, many rugby supporters returning from the match, were killed in an air crash over Northern France."]}, {"page": "1977 British Lions tour to New Zealand", "response": ["* Peter Squires (Harrogate and England)"]}, {"page": "1975 England rugby union tour of Australia", "response": ["* Peter Squires (Harrogate) 12 caps"]}, {"page": "1973 England rugby union tour of Fiji and New Zealand", "response": ["*Peter Squires (Harrogate) 2 Caps"]}, {"page": "1979 England rugby union tour of Japan, Fiji and Tonga", "response": ["In 1979 an  rugby union touring team toured Japan, Fiji and Tonga.  The tourists won all their seven matches, scoring 270 points and conceding only 93. Only the first international against  was close, with Japan leading 19–15 going into injury time – a converted try by Peter Squires allowed England to win the match.", "*Peter Squires (Harrogate)"]}, {"page": "List of cricket and rugby union players", "response": ["| Peter Squires"]}, {"page": "List of England national rugby union players", "response": ["|1021||Peter Squires||wing ||1973-02-24||v France at Twickenham"]}, {"page": "1975–76 Australia rugby union tour of Britain, Ireland and the United States", "response": ["ENGLAND: Alastair Hignell, Peter Squires, Andy Maxwell, Barry Corless, David Duckham, Martin Cooper, Mike Lampkowski, Fran Cotton, Peter Wheeler, Mike Burton, Bill Beaumont, Bob Wilkinson, Mark Keyworth, Tony Neary (c), Andy Ripley"]}, {"page": "1978 Argentina rugby union tour of Britain, Ireland and Italy", "response": [" North of England: D.Boyd; Peter Squires, Tony Bond, W.Lyon, Mike Slemen; John Horton, Malcolm Young; Fran Cotton; K.Pacey, J.Bell, Bill Beaumont (capt.), J.Buttler, Peter Dixon, P.Moss, K.Higgins. "]}, {"page": "Ripon Cricket Club", "response": ["Ripon boasts many players who have gone onto play cricket at the highest standard including the current club president Peter Squires who played first class cricket for Yorkshire County Cricket Club as well as representing England twenty nine times in Rugby Union, scoring six tries."]}, {"page": "Ripon Rugby Union Football Club", "response": ["In April 2012 the club celebrated their 125th anniversary. The festival at Mallorie Park, titled '125 years of Ripon rugby', was attended by several notable ex players including former England international Peter Squires as well as the members of the Wooden Spoon Anti-Assassins Club."]}, {"page": "Squires (surname)", "response": ["* Peter Squires (sportsman) (born 1951), English rugby union footballer"]}, {"page": "1979 Five Nations Championship squads", "response": ["# Peter Squires"]}, {"page": "1978 Five Nations Championship squads", "response": ["# Peter Squires"]}, {"page": "1977 Five Nations Championship squads", "response": ["# Peter Squires"]}, {"page": "1976 Five Nations Championship squads", "response": ["# Peter Squires"]}, {"page": "1975 Five Nations Championship squads", "response": ["# Peter Squires"]}, {"page": "1974 Five Nations Championship squads", "response": ["# Peter Squires"]}, {"page": "1973 Five Nations Championship squads", "response": ["# Peter Squires"]}, {"page": "1977–78 Divisional Championship (rugby union)", "response": ["|RW ||14||  Peter Squires (Harrogate)"]}, {"page": "Peter Squires", "response": ["Peter Squires may refer to:", "* Peter Squires (sportsman), English cricketer and rugby union player", "* Peter Squires (diver), English diver"]}]}}