{"wiki_id": "http://www.wikidata.org/entity/Q337958", "itemLabel": "Roger Casale", "itemDescription": "Labour Member of Parliament for Wimbledon, 1997 - 2005", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Casale", "wikipedia_page": {"main": "Roger Mark Casale (born 22 May 1960) is a former Labour Member of Parliament for Wimbledon, having represented the seat from 1997 to 2005.\nIn June 2013, Casale founded New Europeans, a pro-EU campaigning group.\n\n", "link_mentions": [{"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Roger Casale", "| Roger Casale"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Roger Casale"]}, {"page": "List of United Kingdom MPs: C", "response": ["* Roger Casale (1997–2005)"]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Wimbledon || Stephen Hammond || Conservative || Roger Casale || Labour"]}, {"page": "Wimbledon (UK Parliament constituency)", "response": ["||1997 || Roger Casale"]}, {"page": "Stephen Hammond", "response": ["Hammond first stood for Parliament for North Warwickshire at the 1997 general election, being comfortably defeated by Labour's Mike O'Brien. Contesting Wimbledon in 2001 general election, he failed to regain what had been a safe seat for the Conservatives before Labour's 1997 landslide and was defeated by the Labour incumbent, Roger Casale. He was elected a councillor for the Village ward in the London Borough of Merton election in 2002 and subsequently became Deputy Leader of the Conservative Group on Merton Council."]}, {"page": "2005 United Kingdom general election", "response": ["|Roger Casale"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Roger Casale, Wimbledon, 1997–2005"]}, {"page": "King's College School", "response": ["*Roger Casale, (1960–) MP for Wimbledon "]}, {"page": "List of British Italians", "response": ["* Roger Casale"]}, {"page": "Old Johnians (Hurstpierpoint College)", "response": ["* Roger Casale, Labour Member of Parliament"]}, {"page": "Casale (surname)", "response": ["*Roger Casale (born 1960), former Labour Member of Parliament for Wimbledon"]}, {"page": "2019 European Parliament election in the United Kingdom", "response": ["Change UK said it had had 3,700 applicants to be candidates, including former MPs from both the Labour Party and the Conservative Party. Their candidates included writer Rachel Johnson (sister of Conservative MP Boris Johnson and formerly of the Liberal Democrats), former BBC journalist Gavin Esler, former Conservative MPs Stephen Dorrell and Neil Carmichael, former Labour MEP Carole Tongue, former Labour MPs Roger Casale and Jon Owen Jones, former Liberal Democrat MEP Diana Wallis, and former deputy Prime Minister of Poland Jacek Rostowski. It stood 70 candidates (all of Great Britain, but not Northern Ireland). Two of its candidates subsequently withdrew from the ballot due to reports that they had made misogynistic and racist remarks."]}, {"page": "List of campaign organisations supporting Remain in the 2016 United Kingdom European Union membership referendum", "response": ["New Europeans is a civil rights movement based in Brussels and London which campaigns for the rights of EU citizens, in particular mobile EU citizens and the rights of third country nationals, migrants and refugees in the European Union. It was founded in 2013 by former Member of Parliament Roger Casale. After the 2016 UK's vote to leave the European Union, it moved its European operations to Brussels. New Europeans conducts research on European citizenship issues and runs grant funded programmes aimed at empowering transnational EU citizens (i.e. EU citizens who live and work outside their EU member state of origin)."]}, {"page": "Change UK", "response": ["The party announced on 23 April that it would stand a full slate of candidates in Great Britain for the European Parliament elections, including Ashworth, writer Rachel Johnson (sister of Conservative MPs Jo and Boris Johnson); former BBC journalist Gavin Esler; former Conservative MPs Stephen Dorrell and Neil Carmichael; former Labour MEP Carole Tongue; former Labour MPs Roger Casale and Jon Owen Jones; former Liberal Democrat MEP Diana Wallis; and the former deputy Prime Minister of Poland Jacek Rostowski."]}, {"page": "Party lists in the 2019 European Parliament election in the United Kingdom", "response": ["The party announced on 23 April that it would stand a full slate of candidates in Great Britain for the European Parliament elections, including Ashworth, writer Rachel Johnson (sister of Conservative MPs Jo and Boris Johnson); former BBC journalist Gavin Esler; former Conservative MPs Stephen Dorrell and Neil Carmichael; former Labour MEP Carole Tongue; former Labour MPs Roger Casale and Jon Owen Jones; former Liberal Democrat MEP Diana Wallis; and the former deputy Prime Minister of Poland Jacek Rostowski. None of the Change UK candidates won any seats."]}, {"page": "Change UK election results", "response": ["Change UK stood in the 2019 European Parliament elections in every regional constituency except Northern Ireland as a member of the EPP but failed to win a single seat. Candidates included high-profile celebrities like Robin Bextor, the father of singer Sophie Ellis-Bextor, incumbent Conservative MEP Richard Ashworth, writer Rachel Johnson (sister of Conservative MPs Jo and Boris Johnson); former BBC journalist Gavin Esler; former Conservative MPs Stephen Dorrell and Neil Carmichael; former Labour MEP Carole Tongue; former Labour MPs Roger Casale and Jon Owen Jones; former Liberal Democrat MEP Diana Wallis; and the former deputy Prime Minister of Poland, Jacek Rostowski."]}, {"page": "List of MPs who lost their seat in the 1997 United Kingdom general election", "response": ["|Roger Casale"]}]}}