{"wiki_id": "http://www.wikidata.org/entity/Q3370427", "itemLabel": "Paul Ackford", "itemDescription": "English rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Ackford", "wikipedia_page": {"main": "Paul Ackford (born 26 February 1958) is a former English rugby union international who played lock forward. He was formerly an inspector in the Metropolitan Police, and is now a columnist for The Telegraph.", "link_mentions": [{"page": "Federico Méndez", "response": ["Méndez started his career with Mendoza RC in his hometown; he made his Argentina debut as a teenager, and was sent off in a match against England for a punch on English lock Paul Ackford in 1990."]}, {"page": "Wade Dooley", "response": ["Dooley made his international debut on 5 January 1985 against Romania. He later established a second row partnership with fellow police officer Paul Ackford."]}, {"page": "Plymouth College", "response": ["*Paul Ackford (born 1958), England rugby union player and rugby journalist"]}, {"page": "Harlequin F.C.", "response": ["Harlequins hold the world record for providing the most players from one club (8) in a Rugby World Cup final.  In the second ever RWC final at Twickenham in November 1991, seven Harlequin players appeared for England (Will Carling, Simon Halliday, Jason Leonard, Brian Moore, Paul Ackford, Mickey Skinner, Peter Winterbottom) and Troy Coker played in the Australian pack."]}, {"page": "The Varsity Match", "response": ["*  Paul Ackford (Lock, Cambridge)."]}, {"page": "Mike Teague", "response": ["Teague represented England at Under 23 level before playing his first England B game in the 20–10 win over France B in November 1981, winning a place in the England trial the following month. Teague made his test debut on 2 February 1985 aged 24, in the then five nations, as a substitute for Jon Hall in a 9–9 draw against  at Twickenham. He was then selected for England's final game of the tournament against Wales but the match was called off due to icy conditions and John Hall won his place back for the re-arranged fixture. Teague made his full test début on the summer tour of New Zealand the same year, playing in both test matches. He was not selected to represent England at any level for a further three years before playing for England B against Russia in 1988, eventually re-gaining his place in the full England team in a 12–12 draw with  in the 1989 five nations. In order to bulk up and regain his place in the England team he trained every day with body builders in the local gym, as well as doing 'Mad Dog' training with Gloucester. That involved hill running, often at three-quarter pace, carrying logs and rocks. It was intense and he had to find the time for daily training between his work as a builder. He went on to play in 3 matches during the 1990 five nations and was a key member of England's Grand Slam team of 1991, scoring the only try in England's 25–6 win against Wales in Cardiff on 19 January, England's first win in Cardiff for 28 years, as well as scoring against Ireland in England's victory in Dublin. In the same year he helped England reach the World Cup final, playing in five of England's six matches including the final, a narrow 12–6 defeat to Australia at Twickenham. The world cup final was his last appearance for a year; he sat out the 1992 Five Nations suffering from injury and exhaustion. However, he would reappear in England colours, playing against South Africa on their return to Twickenham after the sporting embargo had been lifted.  His final England cap was against Ireland at Lansdowne Road in the 5 nations in 1993.  second row Paul Ackford christened Teague 'Iron Mike' at the time when Mike Tyson was world heavyweight champion. Teague played 27 times for his country, 19 times as blindside flanker and 8 times at number 8. He scored a total of 3 tries for England against New Zealand in Christchurch on 1 June 1985, Wales in Cardiff on 19 January 1991 and Ireland in Dublin on 2 March 1991."]}, {"page": "1989 British Lions tour to Australia", "response": ["|Paul Ackford"]}, {"page": "1958 in the United Kingdom", "response": ["* 26 February – Paul Ackford, rugby player"]}, {"page": "Experimental law variations", "response": ["There has also been criticism from many coaches, players and fans in the northern hemisphere. Sean Fitzpatrick, (former All Black hooker and most capped All Black of all time), Shaun Edwards (coach London Wasps/Wales), Warren Gatland (former All Black and coach Wales), Jason Leonard (most capped prop in history), Martin Johnson (2003 World Cup Winning captain and ex-England Coach), Brian Moore, Paul Ackford and Josh Kronfeld (All Black), amongst others have and continue to raise concerns that the Stellenbosch Laws will be to the detriment of the game. The reduction of breaks in the game, faster paced play and the tendency to mix backs and forwards requires the players to be fitter and more athletic. This may produce the desired effect for television viewers watching the elite players, but the requirements may make rugby virtually unplayable for participants at the amateur level, undermining a fundamental claim of Rugby Union, that it is a game for \"all shapes and all sizes\". The law allowing collapsing of a maul has become a major worry at community level because of the dangers it may cause inexperienced players."]}, {"page": "List of University of Kent people", "response": ["*Paul Ackford - former England Rugby and British and Irish Lions rugby player, The Sunday Telegraph sports journalist"]}]}}