{"wiki_id": "http://www.wikidata.org/entity/Q3377178", "itemLabel": "Stephen Kinnock", "itemDescription": "British politician and diplomat (born 1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Kinnock", "wikipedia_page": {"main": "Stephen Nathan Kinnock (born 1 January 1970) is a Welsh Labour Party politician who has been the Member of Parliament (MP) for Aberavon since the 2015 general election. His wife is the former Danish Prime Minister Helle Thorning-Schmidt. His father, Neil Kinnock, is a former Leader of the Labour Party and was also a European Commissioner and Vice President of the European Commission. His mother, Glenys Kinnock, formerly served as a Labour Party Member of the European Parliament (MEP).", "link_mentions": [{"page": "Aberavon (UK Parliament constituency)", "response": ["Aberavon (Welsh: Aberafan) is a constituency represented in the House of Commons of the Parliament of the United Kingdom since 2015 by Stephen Kinnock of the Welsh Labour Party. It includes the town of Aberavon, although the largest town in the constituency is Port Talbot.", "The constituency was created for the 1918 general election by the dividing of the Swansea District. With the exception of the first term, it has always been held by the Labour Party. Ramsay MacDonald, who became Labour's first Prime Minister in 1924, held the seat from 1922 to 1929. Its current MP, Stephen Kinnock, is the son of Neil Kinnock, who was Labour leader and Leader of the Opposition from 1983 to 1992.", "|Stephen Kinnock", "thumb|upright=0.55|Stephen Kinnock"]}, {"page": "European Free Trade Association", "response": ["In early 2018, British MPs Antoinette Sandbach, Stephen Kinnock and Stephen Hammond all called for the UK to rejoin EFTA."]}, {"page": "Neil Kinnock", "response": ["He has been married to Glenys Kinnock since 1967. They have two children – son Stephen Kinnock (born January 1970, now a Labour MP), and daughter Rachel Kinnock (born 1971).\"Kinnock is Leader at his Rachel's Wedding Party\", Sunday Mirror, 22 July 2001."]}, {"page": "National Secular Society", "response": ["*Stephen Kinnock MP"]}, {"page": "Queens' College, Cambridge", "response": ["Other notable alumni include Arthurian author T. H. White, Cambridge University's first black graduate Alexander Crummell, Israeli politician Abba Eban, founding father of Ghana William Ofori Atta, newsreader and journalist Emily Maitlis, actor Stephen Fry, Governor of the Bank of England Andrew Bailey, and British Parliamentarians such as Stephen Kinnock and Liz Kendall. ", "File:Official portrait of Stephen Kinnock MP crop 2.jpg|Stephen Kinnock, Welsh Labour MP", "|Stephen Kinnock"]}, {"page": "Neath Port Talbot", "response": ["*Aberavon, current MP is Stephen Kinnock, Labour since 2015"]}, {"page": "Political family", "response": ["*The Kinnock family: Current Labour MP Stephen Kinnock is the son of Neil Kinnock, Leader of the Opposition from 1983 to 1992. Stephen is also married to Helle Thorning-Schmidt, former Prime Minister of Denmark."]}, {"page": "Glenys Kinnock", "response": ["Kinnock grew up speaking Welsh, but did not use the language in conversation with her husband or her son, Stephen Kinnock. Her son is married to the former Danish prime minister Helle Thorning-Schmidt and through him she has two granddaughters. Through her daughter Rachel she has two granddaughters and a grandson. She is a member of the GMB trade union and the Co-operative Party."]}, {"page": "Hywel Francis", "response": ["On 22 November 2013, Francis made the announcement that he would be standing down as MP for Aberavon at the 2015 general election. Stephen Kinnock, son of former Labour leader Neil Kinnock, was selected to succeed Francis as the Labour candidate for Aberavon."]}, {"page": "List of political families in the United Kingdom", "response": ["**Stephen Kinnock, Labour MP (2015–present). Son of Neil and Glenys."]}, {"page": "British Council", "response": ["In 2008 the British Council was called before the Public Accounts Committee (PAC) following earlier publication of a National Audit Office report. The subsequent PAC report confirmed that Nigel Griffiths MP – Vice Chair of The British Council Associate Parliamentary Group – was part of the small number of PAC members who approved this report on the British Council despite not having been recorded as being present during the evidence session – in June 2008 – where the British Council's Chief Executive was cross-examined. Mr Griffiths had earlier travelled to Russia and spoke favourably of British Council activities there in January 1998 around the time that their man in St Petersburg (Stephen Kinnock) was expelled."]}, {"page": "List of United Kingdom MPs: K", "response": ["* Stephen Kinnock (2015–present)"]}, {"page": "Social Market Foundation", "response": ["The SMF has a 20 member Policy Advisory Board, which as of 2018 included the Members of Parliament (MPs) Stephen Kinnock, Norman Lamb, Chris Leslie, Alison McGovern, Tom Tugendhat, Chuka Umunna and John Woodcock."]}, {"page": "Briton Ferry", "response": ["The town is currently in the parliamentary constituency of Aberavon, having been in Neath constituency from 1945 until 1983. The current MP is Stephen Kinnock, while the current Senedd Member is David Rees and there are three West Wales Regional Assembly Members. The town encompasses the electoral wards of Briton Ferry East and Briton Ferry West. Today, the Town Council consists of twelve members and meets monthly in the Council Chamber at the Community Resource Centre, the community-managed library."]}, {"page": "Tredegar", "response": ["* Stephen Kinnock, Labour Member of Parliament for Aberavon (2015 to date), business executive and husband of Danish Prime Minister, Helle Thorning-Schmidt"]}, {"page": "College of Europe", "response": ["| 1992–1993 ||Charles IV|| 264 ||Jacques Santer||Helle Thorning-Schmidt (Danish prime minister), Stephen Kinnock||thumb|100px|Stephen Kinnock", "*Stephen Kinnock, Director at the World Economic Forum"]}, {"page": "Helle Thorning-Schmidt", "response": ["Thorning-Schmidt married Welsh politician Stephen Kinnock in 1996, becoming the daughter-in-law of Neil Kinnock, former Leader of the Opposition and leader of the British Labour Party and European Commissioner, and Glenys Kinnock, former British Minister for Europe. She met her husband while they were both attending the College of Europe. They have two daughters, Johanna and Camilla. Thorning-Schmidt lived in Copenhagen with their children, while her husband partly resided in Davos, Switzerland, where he worked as a director for the World Economic Forum. In 2014, he worked for London-based Xyntéo as managing director for the \"Global Leadership and Technology Exchange\", but was elected Member of Parliament (MP) for Aberavon at the 2015 United Kingdom general election. The family have been living in Kilburn, London since Thorning-Schmidt became CEO of Save the Children, whilst also spending time at Kinnock's constituency in Port Talbot. Thorning-Schmidt has also campaigned for her husband and for the British Labour Party.", "The Danish tax authorities (SKAT) investigated reports that Thorning-Schmidt's husband, Stephen Kinnock, was guilty of tax evasion. Kinnock had declared that he was not a resident of Denmark and thus not subject to Danish taxes, while at the same time Thorning-Schmidt had declared, in an application for dispensation for Kinnock to own property in Denmark, that he resided in Denmark \"every weekend of the year from Friday through to Monday\".Danish politics rocked over Kinnock tax status, BBC News 3 August 2010 Thorning-Schmidt attributed the discrepancy to a \"big and sloppy error\". On 16 September 2010, Danish tax authorities acquitted the couple and the charges of tax evasion were dropped.Revisor: Skat frikender Thorning i skattesag, Politiken 16 September 2010 "]}, {"page": "Labour Campaign for Electoral Reform", "response": ["Other current supporters include MPs David Lammy, Jonathan Reynolds, Tulip Siddiq, Stephen Kinnock, Alan Whitehead, John McDonnell, and, from the House of Lords, Baroness Lister."]}, {"page": "Will Straw", "response": ["Along with Euan Blair (son of former British prime minister Tony Blair), Stephen Kinnock (son of former Labour Leader Neil Kinnock), and Joe Dromey (son of Labour MPs Harriet Harman and Jack Dromey), Straw has been criticised for being a 'Red Prince', which refers to the son of a Labour politician who goes into politics. It is suggested that this nepotism allows them better access to educational, employment and political opportunities. Of the four, only Kinnock has become an MP."]}, {"page": "List of Parliamentary constituencies in West Glamorgan", "response": ["|Stephen Kinnock ‡"]}, {"page": "Policy Exchange", "response": ["The former Australian PM Kevin Rudd, responding to Stephen Kinnock at a Policy Exchange event at Labour Party Conference in autumn 2020, argued that there is a need to \"reset\" British foreign policy towards the Indo-Pacific. This idea has been pursued by Policy Exchange in its Indo-Pacific Commission, a project chaired by Stephen Harper, former Canadian PM, and given public support by Shinzo Abe, former Japanese Prime Minister, who argued in a foreword to the Commission's first report: \"Britain can work with countries throughout the region on upholding democratic values and supporting the multinational institutions that have developed in recent years. On the security front, the British military, and the Royal Navy in particular, will be a welcome presence in the seas of the Indo-Pacific.\""]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Stephen Kinnock, Aberavon, 2015–present"]}, {"page": "Dic Penderyn", "response": ["In 2000 a legal case was started by Lewis's descendants to seek a pardon. In June 2015, Ann Clwyd MP presented a petition for a pardon in the House of Commons. Mike Penning, Minister for Policing, Crime and Criminal Justice, responded that pardons were only granted where evidence has come to light which demonstrates conclusively that the convicted individual was innocent and that the relevant appeal mechanisms have been exhausted. In July 2016, Stephen Kinnock MP presented a 600-signature petition to the Ministry of Justice, calling for a pardon. The Ministry of Justice replied that 10,000 signatures were required to trigger a parliamentary debate, and referred to the answer given by the ministry in 2015. Kinnock said that the fight for a pardon would continue."]}, {"page": "Official Opposition frontbench", "response": ["|Stephen Kinnock"]}, {"page": "Drayton Manor High School", "response": ["*Stephen Kinnock, politician"]}, {"page": "Welsh Affairs Select Committee", "response": ["Following criticism of both an unfilled committee and an all-male lineup, Tonia Antoniazzi, Anna McMorrin, Simon Hoare, Liz Saville Roberts and Stephen Kinnock joined the committee in October 2017. Thelma Walker replaced Stephen Kinnock on 8 January 2018. Walker was then replaced by Susan Elan Jones on 5 February 2018 following criticism of Labour allowing an MP for an English seat to sit on the committee. Guto Bebb joined the committee on 22 October 2018, replacing Glyn Davies. Jack Lopresti joined the committee in November 2018, replacing Simon Hoare.", "During the 2015–2017 Parliament the following were members: Gerald Jones, Antoinette Sandbach, Christina Rees and Carolyn Harris were replaced by: Glyn Davies, Chris Elmore, Paul Flynn and Stephen Kinnock."]}, {"page": "List of Parliamentary constituencies in Wales", "response": [" |Stephen Kinnock‡"]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["Stephen Kinnock, MP for Aberavon since May 2015, is married to Helle Thorning-Schmidt, member of the Danish Parliament 2005–16 and Prime Minister of Denmark 2011–15, resigning shortly after Kinnock's election."]}, {"page": "European Scrutiny Committee", "response": ["| The Hon. Stephen Kinnock MP", "| The Hon. Stephen Kinnock MP (Labour)"]}]}}