{"wiki_id": "http://www.wikidata.org/entity/Q337548", "itemLabel": "Cyril Smith", "itemDescription": "Disgraced UK politician & sex offender (1928-2010)", "wikipedia_url": "https://en.wikipedia.org/wiki/Cyril_Smith", "wikipedia_page": {"main": "Sir Cyril Richard Smith  (28 June 1928 – 3 September 2010) was a prominent British politician who after his death was revealed to have been a prolific serial sex offender against children. A member of the Liberal Party, he was Member of Parliament (MP) for Rochdale from 1972 to 1992. After his death, numerous allegations of child sexual abuse by Smith, including many made during his lifetime, emerged, leading the police to believe he had been guilty of sex offences.\nSmith was first active in local politics as a Liberal in 1945 before switching to Labour in 1950; he served as a Labour councillor in Rochdale, Lancashire, from 1950 and became mayor in 1966. He subsequently switched parties again and entered Parliament as a Liberal in 1972, winning his Rochdale seat on five further occasions. Smith was appointed the Liberal Chief Whip in June 1975 but later resigned on health grounds. In his later years as an MP, Smith opposed an alliance with the Social Democratic Party and did not stand for re-election in 1992, but remained loyal to the Liberal Democrats upon the parties' merger. Throughout much of his career, he maintained a high profile in the media, and became a well-known public figure.\nIn later years, Smith's public esteem was considerably marred by the allegation that he had been involved in a cover-up of a health risk at a local asbestos factory. In 2008, there were calls for Smith to be stripped of his knighthood after it was revealed that he had asked the asbestos company Turner & Newall to prepare a speech for him in 1981, in which he declared: \"the public at large are not at risk from asbestos\". It was later revealed that Smith owned 1,300 shares in the company. In 2008, Smith said that 4,000 asbestos-related deaths a year in the UK was \"relatively low\".\nIn 2012, following allegations of child sexual abuse, the Crown Prosecution Service formally admitted that Smith should have been charged with such abuse during his lifetime. Greater Manchester Police (GMP) said the boys \"were victims of physical and sexual abuse\" by Smith. In November 2012, GMP Assistant Chief Constable Steve Heywood said there was \"overwhelming evidence\" that young boys were sexually and physically abused by Smith. In April 2014, it was reported that there had been 144 complaints against Smith from victims as young as eight, but attempts to prosecute him had always been blocked. Public authorities, including Rochdale Borough Council, the police and intelligence services have been implicated in covering up Smith's alleged crimes. In 2015, it emerged that he had been arrested in the early 1980s in relation to these offences, but a high-level cover-up reportedly led to him being released within hours, the evidence destroyed and the investigating officers prevented from discussing the matter under the Official Secrets Act.", "link_mentions": [{"page": "Cyril", "response": ["* Cyril Smith (1928–2010), English Liberal politician"]}, {"page": "June 28", "response": ["*  1928   – Cyril Smith, English politician (d. 2010)"]}, {"page": "Metropolitan Borough of Rochdale", "response": ["* Sir Cyril Smith : November 1992. (This honour was revoked by a unanimous vote of the Rochdale Borough Council on 18 October 2018)."]}, {"page": "Clement Freud", "response": ["In June 2016, allegations were made in Exposure: Abused and Betrayed – A Life Sentence, an ITV documentary broadcast on 15 June, that Freud was a paedophile in the late 1940s and the 1970s. Two women, who did not know each other, spoke publicly for the first time about how Freud preyed upon them when they were still children and into young adulthood. Sylvia Woosley contacted the ITV news team — the same team that exposed Jimmy Savile — to tell them she had been abused for many years by Freud, from the age of 10 in the 1950s to when she left his home aged 19. The second woman, who remained anonymous, said that Freud groomed her from the age of 11 in 1971, abused her at 14, and violently raped her at 18, by which time Freud had become a Liberal MP, sharing an office with fellow MP Cyril Smith, a prolific abuser of children who was first accused of abuse in the 1960s, but was never prosecuted."]}, {"page": "Spitting Image", "response": ["The SDP-Liberal Alliance was portrayed by the election-losing, populist, arrogant and undecided David Owen, with whining, bedwetting David Steel in his pocket. They were soon replaced by Paddy Ashdown, whose \"equidistance\" from the larger parties was satirised by his frequent appearance at the side of the screen during unrelated sketches, saying: \"I am neither in this sketch nor not in it, but somewhere in-between\". This running gag was used when Ashdown's extramarital affair was revealed, and his puppet commented that \"I didn't touch her on the left leg, or the right leg, but somewhere in-between.\" Former Liberal MP Cyril Smith also made a few appearances depicted as a morbidly obese giant."]}, {"page": "General Assembly of Unitarian and Free Christian Churches", "response": ["* Cyril Smith, member of parliament and alleged serial sex offender"]}, {"page": "David Steel", "response": ["Steel served as a Member of the UK Parliament for 32 years, from 1965 to 1997, and as a Member of the Scottish Parliament (MSP) from 1999 to 2003, during which time he was the parliament's Presiding Officer. He was a member of the House of Lords as a life peer from 1997 to 2020. Steel resigned from the House of Lords after the Independent Inquiry into Child Sexual Abuse accused him of an \"abdication of responsibility\" over his failure to investigate allegations of child sex abuse against Liberal MP, Cyril Smith.", "=== Cyril Smith child sex abuse scandal ===", "On 14 March 2019, Steel was suspended by the Liberal Democrats after an admission that discussions he had conducted in 1979 with the then Liberal MP for Rochdale Cyril Smith, at a time when Steel was leader of the Liberal Party, had led him to conclude that Smith had been a sexual abuser of children in the 1960s and that Steel nonetheless failed to instigate any assessment by the party of whether Smith was an on-going risk to children. Richard Scorer, representing victims at the Independent Inquiry into Child Sexual Abuse, called for him to be stripped of his peerage. On 14 May 2019, the Liberal Democrats ruled that there were \"no grounds for action\" against Steel and reinstated him to party membership."]}, {"page": "Don Estelle", "response": ["In his autobiography, Sing Lofty: Thoughts Of A Gemini (1999), Estelle was extremely bitter about modern-day entertainment producers describing them as being \"tight-crutched, white-trousered morons\". According to his obituary in The Independent, \"in recent years Estelle cut a slightly sorry figure, dressed in his 'Lofty' outfit, setting out a stall of his tapes and singing to passers-by in shopping centres.\" He appeared as a \"dirty old man\" in the promotional video for The Sun Page Three Girl Jo Hicks's single \"Yakety Sax\" in 2001 (based on the theme from The Benny Hill Show). Estelle produced a duo recording with Sir Cyril Smith, by then the former MP for Rochdale. The six-track CD, which included \"The Trail of the Lonesome Pine\", was available by mail-order in 1999."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Cyril Smith"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Cyril Smith"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|Cyril Smith"]}, {"page": "List of MPs elected in the October 1974 United Kingdom general election", "response": ["|Cyril Smith"]}, {"page": "Lawrence Cunliffe", "response": ["He first stood for Parliament in Rochdale. There, he lost the previously Labour-held seat to the Liberal candidate Cyril Smith at a by-election in 1972, and was again defeated by Smith at the subsequent general election in February 1974."]}, {"page": "List of MPs elected in the February 1974 United Kingdom general election", "response": ["|Cyril Smith"]}, {"page": "Rochdale", "response": ["The Rochdale constituency was created by the Reform Act of 1832. The constituency was held for two decades during the 20th century by Cyril Smith, first of the Liberal Party and then of the Liberal Democrats. Following the 2010 General Election, the town was represented by Simon Danczuk MP, who was elected as a Labour MP but was  subsequently suspended and under investigation by the Labour Party.  Tony Lloyd is the current MP for Rochdale constituency following the snap general election held on 8 June 2017.", "The 19th century saw several notable characters. Lancashire dialect poet Edwin Waugh (1817–1890) was born and brought up in the town, as was Roger Fenton, noted as one of the first war photographers. The aristocrat and poet George Gordon Byron was Lord Byron of Rochdale. Rochdale has a proud liberal political heritage, as shown by such people as John Bright, one of the first Quakers to sit in the House of Commons; Samuel Bamford, the radical and writer; and Rev. Joseph Cooke, the inspiration behind the Methodist Unitarian movement. In the 20th century, another prominent (if now controversial) political personality was Cyril Smith."]}, {"page": "Murder of Lesley Molseed", "response": ["Kiszko's mother continued to profess her son's innocence, but was ignored and stonewalled both by politicians, including her local MP Cyril Smith and Prime Ministers James Callaghan (from 1976 to 1979) and Margaret Thatcher (from 1979 to 1990), and by the legal system. In 1984, Kiszko's mother contacted JUSTICE, the UK human rights organisation which at the time investigated many miscarriages of justice. Three years later, she was put in touch with solicitor Campbell Malone, who agreed to take a look at the case."]}, {"page": "Rochdale (UK Parliament constituency)", "response": ["It was held for two decades by Cyril Smith, first of the Liberal Party and then of the Liberal Democrats. He won a by-election in 1972, taking the seat from Labour, and held it until his retirement in 1992. Since Smith's death it emerged Smith was a serial child abuser.", "| rowspan=2|Cyril Smith "]}, {"page": "National Liberal Club", "response": ["Over the years, numerous Liberal and Liberal Democrat MPs have lived at the club, including David Lloyd George in the 1890s,John Grigg, The Young Lloyd George (Eyre Methuen, London, 1973), pp. 127, 164, 225. Cyril Smith in the 1970sCyril Smith, Big Cyril: The Autobiography of Cyril Smith (W.H. Allen, London, 1977). and Menzies Campbell in the late 1980s.Menzies Campbell, Menzies Campbell: My Autobiography (Hodder & Stoughton, London, 2008), p. 108.", "*Cyril Smith, Liberal MP 1972–92"]}, {"page": "Sir Cyril Smith", "response": ["#REDIRECT Cyril Smith"]}, {"page": "List of United Kingdom MPs: S", "response": ["*Cyril Smith"]}, {"page": "2006 Liberal Democrats leadership election", "response": ["*Other notable supporters: Former Liberal MP Sir Cyril Smith, Peter Tatchell (member of the Green Party)"]}, {"page": "1999 Liberal Democrats leadership election", "response": ["*Former MPs: Cyril Smith."]}, {"page": "1988 Social and Liberal Democrats leadership election", "response": ["*MPs: Geraint Howells, Cyril Smith, Alex Carlile, David Alton"]}, {"page": "Colin Wallace", "response": ["The information appears to bear a striking similarity to some of the material contained in the notes which Colin Wallace had been instructed two years earlier as part of the 'Clockwork Orange' project.  People named in Colin Wallace's notes as having been targeted in this manner included Harold Wilson, Edward Heath, Merlyn Rees, Cyril Smith, Jeremy Thorpe, Tony Benn and Ian Paisley."]}, {"page": "Don Hale", "response": ["While editor of the Bury Messenger in the early 1980s, he says Barbara Castle, then the local Member of the European Parliament gave him confidential information on political figures who appeared sympathetic to the Paedophile Information Exchange and indicated that several high ranking senior politicians were also allegedly involved in promoting a Westminster paedophile circle. After refusing pressure to hand over the dossier put on him by Cyril Smith MP and Special Branch not to publish it, his office was then raided by SB officers and the papers were confiscated with the threat of prison."]}, {"page": "List of Liberal Democrat MPs", "response": ["* Sir Cyril Smith, Rochdale, 1988–1992 1"]}, {"page": "List of United Kingdom by-elections (1950–1979)", "response": ["|Cyril Smith"]}, {"page": "List of Liberal Party (UK) MPs", "response": ["* Cyril Smith, Rochdale, 1972 – 88"]}, {"page": "Jack McCann", "response": ["In the consequent by-election in 1972, he was succeeded as MP by the Liberal candidate Cyril Smith, who had previously been a Labour mayor of the town."]}, {"page": "Paedophile Information Exchange", "response": ["On 19 July 2015, Australia's 60 Minutes broadcast an investigation of an alleged paedophile ring, into which abused children were supplied by one of PIE's founders, Peter Righton, who was also a former director of education in the National Institute for Social Work. The alleged network was said to include senior public figures such as Lord Janner and Sir Cyril Smith, alongside a former head of MI6, Sir Peter Telford Hayman."]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["The heaviest MP of all time is believed to be Sir Cyril Smith, MP for Rochdale between 1972 and 1992, who weighed 189.6 kg (nearly 30 stone) at his peak in 1976."]}, {"page": "2007 Liberal Democrats leadership election", "response": ["*Other notable supporters: former MP Richard Allan, former MP Sir Cyril Smith, François Bayrou (President of the French political party Mouvement Démocrate)"]}, {"page": "Cyril Smith (disambiguation)", "response": ["Sir Cyril Smith (1928–2010) was a British Liberal Democrat politician.", "Cyril Smith may also refer to:", "* Cyril Smith (actor) (1892–1963), British actor", "* Cyril Smith (cricketer) (1926–2009), Queensland opening bowler", "* Cyril Smith (pianist) (1909–1974), English classical pianist", "* Cyril Smith (Marxist) (1929–2008), British lecturer of statistics, socialist and revolutionary humanist", "* Cyril Smith (footballer) (born 1893), Welsh footballer"]}]}}