{"wiki_id": "http://www.wikidata.org/entity/Q338868", "itemLabel": "Phyllis Satterthwaite", "itemDescription": "British tennis player", "wikipedia_url": "https://en.wikipedia.org/wiki/Phyllis_Satterthwaite", "wikipedia_page": {"main": "Phyllis Helen Satterthwaite (née Carr; 26 January 1886 – 20 January 1962) was a female tennis player from Great Britain who was active from the early 1910s until the late 1930s.\n\n", "link_mentions": [{"page": "Henri Cochet", "response": ["1928 was the first year of Cochet's hegemony of the world rankings. This was the result of his overall season, that as usual commenced on the French Riviera. Prior to that he was drafted into a Queen's Club – Sporting Club de Paris warm-up team challenge. He contributed to the Parisian victory with two mixed and a singles win. The following month he swept almost all available Riviera titles from February to March. He kicked off the tour by winning his first mixed New Courts L.T.C title with his U.S. Championships partner Eileen Bennett. In February he successfully defended his Métropole Club and Gallia L.T.C. singles titles by defeating Henry Mayes twice in a row. In the Monaco Cup at the La Festa Country Club Cochet turned the tide from two sets down against two-times reigning champion Béla von Kehrling, the first meeting of a rivalry that continued onward into the year. They both reached the mixed doubles final, which remained unplayed and the prize was divided. The Cochet – Brugnon pair also won the Butler Cup there (reserved for doubles of the same nationality). At the Nice Lawn Tennis Club tournament they met again for the singles contest and Cochet won in straight sets. Cochet completed his second triple crown there. In Menton at the official Riviera Championships eventual singles victor Von Kehrling and former Danish Champion Erik Worm warded off Cochet and Count Salm in the doubles final. In the mixed Von Kehrling and Cilly Aussem beat the seasoned duo Cochet–Bennett. His third Côte d'Azur trophy was granted to him after Otto Froitzheim traveled home before the final and gave him a walkover. One week later at the 50th Cannes Championships he reached the final to face Henry Mayes again, but due to misunderstandings he was 10 minutes late and had been defaulted from the tournament. Subsequently, he lost the mixed doubles match alongside Phyllis Satterthwaite and only found his form in the doubles with Jack Hillyard at the expense of their opponents Count Salm and Worm. In April at the Biarritz tournament Cochet routed compatriot Roger George in four sets. He was victorious in Marseilles versus Emmanuel Du Plaix and in the mixed with Cilly Aussem. The Miramar L.T.C. tournament in Juan-les-Pins resulted in a three set final between René Gallèpe of Monaco and Cochet and ended in favor of the Frenchman."]}, {"page": "Great Britain at the 1924 Summer Olympics", "response": ["|align=left| Phyllis Satterthwaite"]}, {"page": "Dorothy Shepherd-Barron", "response": ["Between 1920 and 1939 she participated in 15 editions of the Wimbledon Championships. In the singles event her best result was reaching the quarterfinal in 1921 (lost to Mabel Clayton) and 1924 (lost to Phyllis Satterthwaite. She reached the final of the Wimbledon doubles event in 1929 with Phyllis Howkins Covell but lost in straight sets to compatriots Peggy Saunders Michell and Phoebe Holcroft Watson, a result that would be repeated a few months later in the final of the U.S. National Championships. Two years later, 1931, she partnered Phyllis Mudford King to win the doubles title, defeating Doris Metaxa Howard and  Josane Sigart in three sets."]}, {"page": "Geraldine Beamish", "response": ["She competed at The Championships, Wimbledon from 1910 throughout 1933 in each year the tournament was held, reaching the semifinals three times in 1919, 1922 and 1923. In 1919 she lost to Phyllis Satterthwaite, in 1922, she lost to Molla Mallory and the following year to Suzanne Lenglen."]}, {"page": "World Hard Court Championships", "response": ["|1920||  Dorothy Holman   Phyllis Satterthwaite ||  Germaine Golding   Jeanne Vaussard || 6–3, 6–1"]}, {"page": "1919 Wimbledon Championships – Women's Singles", "response": ["Suzanne Lenglen defeated Phyllis Satterthwaite 6–1, 6–1 in the All Comers' Final, and then defeated the reigning champion Dorothea Lambert Chambers 10–8, 4–6, 9–7 in the Challenge Round to win the Ladies' Singles tennis title at the 1919 Wimbledon Championships.100 Years of Wimbledon by Lance Tingay, Guinness Superlatives Ltd. 1977"]}, {"page": "1921 Wimbledon Championships – Women's Singles", "response": ["Elizabeth Ryan defeated Phyllis Satterthwaite 6–1, 6–0 in the All Comers' Final, but the reigning champion Suzanne Lenglen defeated Ryan 6–2, 6–0 in the Challenge Round to win the Ladies' Singles at the 1921 Wimbledon Championships.100 Years of Wimbledon by Lance Tingay, Guinness Superlatives Ltd. 1977"]}, {"page": "A. Wallis Myers", "response": ["In mixed doubles competition, Myers competed at Monte Carlo in 1909 and later at the 1914 World Hard Court Championships with Phyllis Satterthwaite, reaching the semi-finals. He also teamed up with Molla Bjurstedt Mallory for the 1923 Monte Carlo tournament. "]}, {"page": "1931 in tennis", "response": ["|rowspan=2|29 Dec – 4 Jan|| rowspan=\"2\" style=\"background:#fff;\"|Beausite – L. T. C. de Cannes ChampionshipCannes, France||  George Lyttleton-Rogers8–6, 6–1, 3–6, 7–5 ||  Charles Aeschlimann ||  Elizabeth Ryan4–6, 8–6, 6–1 ||  Phyllis Satterthwaite || style=\"background:#ededed;\" colspan=\"2\"|", "|rowspan=2|5–11 Jan|| rowspan=\"2\" style=\"background:#fff;\"|Métropole Club de Cannes BeausiteCannes, France||  George Lyttleton-Rogers8–10, 7–5, 4–6, 6–4, 6–2 || Paul Féret ||  Hélène Contostavlos6–2, 6–3 ||  Phyllis Satterthwaite || style=\"background:#ededed;\" colspan=\"2\"|", "|rowspan=2|12–19 Jan ||rowspan=2 style=\"background:#fff;\"|Italian Riviera championshipsSanremo, Italy||  Jean Lesueur8–6, 7–5, 1–6, 3–6, 6–2||  Benny Berthet||  Phyllis Satterthwaite5–7, 6–2, 6–2 || Lucia Valerio||style=\"background:#ededed;\" colspan=\"2\"|", "|rowspan=2|19–26 Jan ||rowspan=\"2\" style=\"background:#fff;\"|New Court Lawn Tennis Club II.Cannes, France||  George Lyttleton-Rogers6–0, 6–4, 6–4 ||  Benny Berthet ||  Phyllis Satterthwaite6–3, 10–8 || Lucia Valerio||style=\"background:#ededed;\" colspan=\"2\"|", "|rowspan=2|20 January – February 1||rowspan=2|Gallia L. T. C. de CannesCannes, France||  Jacques Brugnon6–8, 6–0, 6–4. 4–6, 6–0||  George Lyttleton-Rogers ||  Phyllis Satterthwaite5–7, 7–5, 10–8 ||  Lucia Valerio || style=\"background:#ededed;\" colspan=\"2\"|", "|rowspan=2|2–8 February||rowspan=2|Carlton L. T. C. de CannesCannes, France||  George Lyttleton-Rogers6–3, 6–3, 6–2||  Ladislav Hecht ||  Elizabeth Ryan6–4, 6–2 || Phyllis Satterthwaite || style=\"background:#ededed;\" colspan=\"2\"|", "|rowspan=2|February 9–16||rowspan=2|South of France ChampionshipsNice, France||  George Lyttleton-Rogers4–6, 0–6, 6–3, 6–4, 5–0 ret.||  Christian Boussus ||  Phyllis Satterthwaite6–1, 6–3 ||  Paulette Marjollet|| style=\"background:#ededed;\" colspan=\"2\"|", "|rowspan=2|February 16–22||rowspan=2|Hotel Bristol ChampionshipsBeaulieu, France||  George Lyttleton-Rogers6–1, 10–8, 3–6, 5–7, 6–3||  Emmanuel Du Plaix ||  Phyllis Satterthwaite6–2, 6–1 ||  Mary Heeley || style=\"background:#ededed;\" colspan=\"2\"|", "|rowspan=3|February 23 – March 1||rowspan=3|Monte Carlo CupsMonte Carlo, Monaco||  Henri Cochet7–5, 6–2, 6–4||  George Lyttleton-Rogers ||  Simonne Mathieu4–6, 6–4, 7–5 ||  Phyllis Satterthwaite  || style=\"background:#ededed;\" colspan=\"2\"|", "|rowspan=2|March 2–8||rowspan=2|French Riviera Championships and Nations CupMenton, France|| Béla von Kehrling7–5, 6–2, 6–4||  George Lyttleton-Rogers ||  Phyllis Satterthwaite7–5, 6–4 ||  Simonne Mathieu || style=\"background:#ededed;\" colspan=\"2\"|", "|rowspan=2|March 9–18||rowspan=2|Bordighera ChampionshipsBordighera, Italy||  George Lyttleton-Rogers1–6, 6–3, 6–4, 0–6, 6–4||  Béla von Kehrling  ||  Ilse Friedleben5–7, 6–4, 6–4 ||  Phyllis Satterthwaite || style=\"background:#ededed;\" colspan=\"2\"|", "|rowspan=2|16–22 March||rowspan=2|Côte d'Azur ChampionshipsCannes, France||  George Lyttleton-Rogers1–6, 6–2, 4–6, 6–1, 9–7 ||  Charles Aeschlimann ||  Phyllis Satterthwaite6–2, 6–0||  Lolette Payot || style=\"background:#ededed;\" colspan=\"2\"|"]}, {"page": "George Lyttleton Rogers", "response": ["In January, he started the season at the Beausite–L.T.C. de Cannes Championship where he captured the title against Swiss Charles Aeschlimann who took revenge in the doubles final on Rogers and Hillyard. In the Beausite tournament, he was finally victorious against Paul Féret who came back from professional tennis to amateur play. They teamed up for the doubles where they couldn't convert two match points against Hillyard and Vladimir Landau, which backfired on them and lost in five sets. In mixed doubles, Rogers and Elizabeth Ryan found their winning form against Phyllis Satterthwaite and Erik Worm and became mixed champions. In the Parc Imperial L.T.C. de Nice Rogers had an easy victory over Edmond Lotan and in the mixed doubles he and Mrs. Marjollet defeated Mikhail Sumarokov-Elston and Mrs. Franke. At Gallia L.T.C. de Cannes Rogers faced Jacques Brugnon for the championship, and Brugnon was triumphant in a five-set match although he gave Rogers two zero-sets. Also in Cannes at the Carlton Club, Brugnon and Henri Cochet fought a four-set battle against the losing team of Rogers-Aeschlimann."]}, {"page": "Vladimir Landau", "response": ["In 1928 he reached the quarterfinal of the doubles at Monegasque Championships alongside Ludwig von Salm Hoogstraten. The next year he was defeated in the doubles final of the Beaulieu L.T.C. tournament partnering László Dörner of Romania. Also in 1929 he took a major part with his two victories in the first ever Davis Cup tie and victory of Monaco against Switzerland at home and advanced into the second round where they faced Hungary in Budapest. Although they lost Landau scored both victories of his team. In the 1930 French Championships he was the eleventh seed and was eliminated in the third round. In January 1931 at the Beausite Club de Cannes Cup he won the doubles contest with his teammate Hillyard. In February he won a triple crown at the Monte Carlo Country Club tournament beating Hillyard in singles, partnering with him for the doubles victory against Garcia/Chastel and clinching the mixed doubles with British Phyllis Satterthwaite from Garcia/Mrs. Richards. In March he was a runner-up for the Bordighera Championships doubles partnering Béla von Kehrling and only lost to the Irish-Italian duo of George Lyttleton-Rogers and Alberto del Bono. In May in an unofficial challenge between the Davis Cup teams of Monaco and Netherlands his team claimed a clean win with Landau's back-to-back victories over Jan van der Heide, Ody Koopman in two singles and a doubles . In the very first tournament of the 1932 season in Beaulieu Landau, assisted by Irish champion Lyttleton-Rogers, earned the doubles title after a five-set battle. In 1934 he ceded the Monegasque Championships to Charles Aeschlimann in straights sets. In 1936 at the Menton tournament he fell to Norcross Tilney in the semifinals. In January 1937 he captured the Beausite L.T.C. doubles trophy with Kho Sin Kie but unfortunately they met in the singles final as well where in the end Kho was triumphant after a five-set battle wrapping the match with a love-set. He also reached the final of the mixed doubles with Simone Matthieu. In February at the Carlton-Cannes tournaments he aligned with Mrs Merricks and dropped the mixed semifinals to Weiwers and Karstend. In September in Menton in the semifinal encounter between him and compatriot Gaston Médecin he was beaten in two sets but they won the doubles title together."]}, {"page": "Erik Worm", "response": ["Worm entered the last edition of the World Hard Court Championships in 1923 and advanced in the third round losing to count Manuel de Gomar. Between 1922 and 1925 he held the Danish Championships on numerous occasions collecting 8 titles altogether. In 1926 in his first oversees final in the Buffalo tennis and squash club invitational tournament he partnered with two-time singles champion Manuel Alonso for the doubles event, eventually falling to the home favorites Arnald Jones and George Lott. In February 1927 he reached the finals of the New Courts of Cannes mixed contest with Elizabeth Ryan. Next week at the Gallia L.T.C. of Cannes tournament came short in both doubles championship matches; in mixed with Ryan to Henri Cochet and Eileen Bennett and the men's with René Gallèpe to Cochet-Charles Aeschlimann. In June at the inaugural of the newly built Margaret Island courts of Budapest the Hungary Davis Cup team hosted an international meeting with Denmark with the latter team victorious. The score was 3-2, Worm beat Imre Takáts in four sets. In March 1928 at the Menton Cup he paired with Phyllis Satterthwaite and marched to the semifinal match against Cochet-Bennett with the latter team advancing to the final round. He took revenge on Cochet and his partner Salm in the doubles final where he and Kehrling won in straights The two of them went to the final of the singles where the Hungarian doubles partner beat him in a fierce fight. In April 1928 he found success in several tournaments throughout Europe, the Beausite mixed trophy with Ryan from Cochet and Satterthwaite (Worm also was a contender for the men's doubles), the Beaulieu tournament against George Lyttleton-Rogers and  the Pforzheim mixed doubles event in July again alongside Ryan. Next year he defended his Menton doubles title with Kehrling against the Italian duo of Giorgio de Stefani and Alberto del Bono. Although the defending champions split for the mixed and faced each other at the final with Kehrling making a good decision by choosing Cilly Aussem, while Worm and Satterthwaite finished second. In the April edition of the Monte-Carlo tournament Worm clinched the title by beating Junior Monaco champ Wilbur Coen. In mixed O'Connell and Elizabeth Ryan overcame Worm and Satterthwaite. In May George Lyttleton-Rogers had a clean victory over Worm in the singles last four of the L.T.C. Beaulieu tournament. He was more lucky in the doubles where he and Jack Hillyard became the Riviera champions after eliminating the Austrian Davis-Cup partners Hermann Artens and Ludwig Salm-Hoogstraeten. And in the follow-up mixed rematch of O'Connell-Ryan and Worm-Satterthwaite the Danish-Briton team equalized the tally. O'Connell and Worm met again in the mixed final of the Montreux tournament at Switzerland, where they played with Muriel Thomas and the returning Cilly Aussem respectively, but the latter team hadn't found his form yet. Then he toured the Weimar Republic and brought home several titles including the ones from Wiesbaden in doubles with Hector Fisher (also a singles runner-up versus Fisher), the Berlin Blau—Weiss doubles with Fisher (also a singles runner-up versus Franz-Wilhelm Matejka)."]}, {"page": "Satterthwaite (disambiguation)", "response": ["* Phyllis Satterthwaite, British tennis player"]}, {"page": "1930 in tennis", "response": ["|rowspan=2|January 6–12|| rowspan=\"2\" |Monte Carlo Country ClubMonte Carlo, Monaco||  Bill Tilden7–5, 6–2, 6–8, 6–0||  George Lyttleton-Rogers ||  Elizabeth Ryan6–1, 6–4||  Phyllis Satterthwaite || style=\"background:#ededed;\" colspan=\"2\"|", "|rowspan=2|March 10–16|| rowspan=2|Bordighera ChampionshipsBordighera, Italy||colspan=\"2\"|  Pat Hughes vs.  Harry LeeN/A||colspan=\"2\"|  Lucia Valerio vs.  Phyllis SatterthwaiteN/A|| style=\"background:#ededed;\" colspan=\"2\"|", "|colspan=\"2\"|  Hughes /  Lee vs.  Worm /  KehrlingN/A||  N/A || N/A ||colspan=\"2\"|  Hughes /  Phyllis Satterthwaite vs.  Worm /  ValerioN/A", "|rowspan=2|March 17–23|| rowspan=2|Italian riviera ChampionshipsSanremo, Italy||  Erik Worm3–6, 6–2, 6–4, 3–6, 6–3||  Pat Hughes ||  Phyllis Satterthwaite6–0, 6–1||  Hilde Eisenmenger || style=\"background:#ededed;\" colspan=\"2\"|", "|rowspan=2|April 14–20|| rowspan=\"2\"|Beaulieu ChampionshipBeaulieu-sur-Mer, France||  Bill Tildenw/o||  Wilbur Coen ||  Phyllis Satterthwaite2–6, 8–6, 6–4|| Helen Jacobs || style=\"background:#ededed;\" colspan=\"2\"|"]}, {"page": "Tennis performance timeline comparison (women) (1884–1977)", "response": ["|align=\"left\"|  Phyllis Satterthwaite"]}, {"page": "Kent Championships", "response": ["|1913 ||  Dorothea Douglass ||  Phyllis Satterthwaite || 6–4, 6–4", "|1923 ||  Elizabeth Ryan ||  Phyllis Satterthwaite || 6–3, 3–6, 6–3"]}]}}