{"wiki_id": "http://www.wikidata.org/entity/Q338166", "itemLabel": "Richard Caborn", "itemDescription": "British politician (born 1943)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Caborn", "wikipedia_page": {"main": "Richard George Caborn (born 6 October 1943) is a British politician who served as Minister of Sport from 2001 to 2007 and later as the prime minister's ambassador for England's 2018 FIFA World Cup bid. He previously served as a junior minister in the Department of Environment, Transport and the Regions and Department of Trade and Industry. A member of the Labour Party, he was Member of Parliament (MP) for Sheffield Central from 1983 to 2010.", "link_mentions": [{"page": "October 6", "response": ["*1943 – Richard Caborn, English engineer and politician, Minister for Sport and the Olympics"]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Richard Caborn", "| Richard Caborn"]}, {"page": "Geoff Hoon", "response": ["On 9 December 2010, Hoon, along with Stephen Byers and Richard Caborn were banned from having an ex-members pass. The Standards and Privileges Committee banned Hoon for a minimum five years as his was the most serious breach, whilst Byers received two years and Caborn six months."]}, {"page": "Stephen Byers", "response": ["On 9 December 2010, Geoff Hoon along with Stephen Byers and Richard Caborn were banned from parliament, the Standards and Privileges Committee banned Geoff Hoon for a minimum five years as his was the most serious breach, whilst Byers received two years and Caborn six months."]}, {"page": "Cambridge United F.C.", "response": ["In 2005, after 35 years in the Football League, Cambridge United were relegated into the Football Conference. This brought with it financial difficulties and the club filed for administration on 29 April. On 22 July 2005 the club came out of administration with a deal being struck with HM Revenue and Customs at the eleventh hour after the intervention of then sports minister Richard Caborn. Cambridge had sold their Abbey Stadium home earlier in the season for £1.9 million to keep the club afloat."]}, {"page": "Sheffield Hallam University", "response": ["* Richard Caborn, former Labour MP for Sheffield Central, and former Minister of Sport"]}, {"page": "Sheffield United F.C.", "response": ["* Richard Caborn, Labour Party politician", "Sheffield United's Academy is responsible for youth development at the club. It has produced such players as Manchester City defender Kyle Walker and defender Phil Jagielka, both England internationals, and also Swansea City defender Kyle Naughton, Burnley full back Matthew Lowton, Manchester United defender and club captain Harry Maguire and current club captain Billy Sharp. The Academy building and training facilities in the Sheffield suburb of Shirecliffe were opened in 2002 by then Minister for Sport Richard Caborn. Sheffield United Academy U18s currently play in the Professional Development League at the Shirecliffe ground at Firshill Crescent, and finished as runners-up in the 2011 FA Youth Cup. In addition, SteelPhalt are the sponsor of the Shirecliffe-based Academy, and are also the major sponsor of Sheffield United Women."]}, {"page": "Secretary of State for the Environment, Transport and the Regions", "response": ["*Richard Caborn (1997–1999)"]}, {"page": "Richard George Caborn", "response": ["#redirect Richard Caborn"]}, {"page": "Tony Banks, Baron Stratford", "response": ["His funeral was held on 21 January at the City of London Crematorium. John Prescott, Tessa Jowell, Margaret Beckett, Alastair Campbell, Tony Benn, Chris Smith and Richard Caborn attended. Banks's friend, Conservative MP David Mellor, gave an address paying tribute. \"A lord of misrule, a cheeky chappy, call him what you will—he can be defined but he cannot be replaced,\" said Mellor."]}, {"page": "List of current members of the British Privy Council", "response": ["| Richard Caborn"]}, {"page": "Richard Burden", "response": ["He speaks French and is an avid motorsport fan. In 2002 he became the special advisor to the Minister of Sport, Richard Caborn, on motorsport."]}, {"page": "Kelvin Hopkins", "response": ["In the House of Commons, he was a member of the Broadcasting Select committee from 1999 to 2001, and has served on the Public Administration Select Committee since 2002. He also served as an adviser to Richard Caborn on yachting when Caborn was Minister of Sport. Hopkins is a member of many all-party groups. He served as the chairman of the group on further education and lifelong learning, and as the vice-chairman of the groups on jazz appreciation; historic vehicles; Norway; constitution and citizenship; transport infrastructure and trans-European networks. He also served as the treasurer of the group on building societies and financial mutuals. Hopkins was on the left wing of the Labour Party, being a member of the Socialist Campaign Group and is a Eurosceptic. He was known for his rebellious stance amongst Labour MPs, and has been described as a \"rebellion prone left-wing economist\" by Andrew Roth in The Guardian."]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Richard Caborn"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Richard Caborn"]}, {"page": "Ben Chapman (politician)", "response": ["After the election of the Labour government in 1997, Ben Chapman became the Parliamentary Private Secretary to Richard Caborn who was the Minister of State at the Department for the Environment, Transport and the Regions, he then returned in the same position with Caborn to his former employing department at the Department of Trade and Industry in 1999. Following the 2001 General Election Caborn was made the Minister of Sport at the Department for Culture, Media and Sport and took Chapman with him. Chapman ceased to be Caborn's PPS after the 2005 General Election and sat on the Intelligence and Security (Cabinet Office) Committee during the 2005–10 parliament."]}, {"page": "David Clelland", "response": ["He ceased being a whip following the 2001 election, and became a member of the Office of the Deputy Prime Minister Select Committee, until 2005. Following the 2005 General Election he became a member of the Transport Select Committee. In 2002, he was appointed an advisor to the Minister of Sport Richard Caborn on greyhound racing."]}, {"page": "Roger Godsiff", "response": ["In Parliament he was a special adviser to the former Minister of Sport Richard Caborn on cricket and was the chairman of the All Party Japan Group. In October 2006, Godsiff was one of 12 Labour MPs to back Plaid Cymru and the Scottish National Party's call for an inquiry into the Iraq War. He also rebelled against the government in November 2005 on legislation permitting the detention of terrorist suspects for 90 days without trial."]}, {"page": "Ivan Henderson", "response": [" where funding that was obtained by Tendring District Council came about through Henderson's discussions with the Football Association.  When it came to be opened, Ivan managed to secure a visit from Richard Caborn MP. He also successfully campaigned for Trinity House HQ to remain in Harwich, he was later reelected to his former East Ward on the Town and District council."]}, {"page": "John Mann, Baron Mann", "response": ["Mann has served on the Treasury Select Committee. He had previously been the Parliamentary Private Secretary (PPS) to Tessa Jowell and Richard Caborn. Mann is also a prominent campaigner against antisemitism. On 7 September 2019, he announced that he would not stand as an MP at the next general election and would instead take up full-time role his role as the UK Government's independent adviser on antisemitism in the United Kingdom, at the Ministry of Housing, Communities and Local Government, which he had been appointed to on 23 July 2019."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Richard Caborn"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Richard Caborn"]}, {"page": "List of United Kingdom MPs: C", "response": ["* Richard Caborn (1983–2010) "]}, {"page": "Bill Michie", "response": ["Michie was elected to parliament for Sheffield Heeley at the 1983 general election, significantly bettering the result of his Labour predecessor in an election when his party struggled nationally. In 1985 he became vice-chairman of the Yorkshire group of Labour MPs and in 1987 became treasurer of the Campaign Group. According to the obituary of Michie in The Yorkshire Post opponents in  the Conservatives called him \"Labour's most Left-wing politician\" during his time as an MP.  Fellow Labour MP Richard Caborn, who considered Michie a \"very dear friend\" said that he was always associated with the left of the Labour Party and \"always on the side of the minorities\"."]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*Richard Caborn (b. 1943)"]}, {"page": "List of members of the European Parliament for the United Kingdom (1979–1984)", "response": ["|Richard Caborn"]}, {"page": "Patrick Duffy (British politician)", "response": ["Duffy was selected to stand for Sheffield Attercliffe (which had been a safe seat for the Labour Party) at the 1970 general election following a close selection contest with George Caborn, father of future Sheffield MP Richard Caborn.\"Sheffield MP's early struggle for power\", Sheffield Star, 31 July 2005 He was consequently elected to represent the constituency in the House of Commons at that general election; Duffy held onto the seat with five-figure majorities at each of the subsequent contests he fought there."]}, {"page": "Mind sport", "response": ["It is a term that became fixed from games trying to obtain equal status to sports. For example, from 2002 British Minister for Sport, Richard Caborn said: ...I believe we should have the same obligation to mental agility as we do to physical agility. Mind sports have to form UK national bodies and get together with the government to devise an acceptable amendment to the 1937 Act that clearly differentiates mind sports from parlour board games."]}, {"page": "Minister for Sport and Civil Society", "response": ["| width=200|Richard Caborn "]}, {"page": "Sheffield Central (UK Parliament constituency)", "response": ["Labour's Richard Caborn represented Sheffield Central from its recreation in 1983 until he retired in 2010 and was narrowly succeeded at the ballot box by another Labour MP, Paul Blomfield.", "| Richard Caborn"]}]}}