{"wiki_id": "http://www.wikidata.org/entity/Q338441", "itemLabel": "Ron Harris", "itemDescription": "English footballer and manager (born 1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ron_Harris_(English_footballer)", "wikipedia_page": {"main": "Ronald Edward Harris (born 13 November 1944), known by the nickname \"Chopper\" for his tough style of defending, is an English former footballer who played for Chelsea in the 1960s and 1970s. Harris captained Chelsea to FA Cup and UEFA Cup Winners' Cup success, and made a club record 795 appearances. His brother Allan Harris was also a professional footballer and they were teammates at Chelsea in the mid-1960s.", "link_mentions": [{"page": "Chelsea F.C.", "response": ["Chelsea's highest appearance-maker is ex-captain Ron Harris, who played in 795 competitive games for the club between 1961 and 1980.For the appearance and goalscoring records of all Chelsea players, see  Four other players made more than 500 appearances for the club: Peter Bonetti (729; 1959–79), John Terry (717; 1998–2017), Frank Lampard (648; 2001–2014) and John Hollins (592; 1963–1975 and 1983–1984). With 103 caps (101 while at the club) for England, Lampard is Chelsea's most capped international player. Every starting player in Chelsea's 57 games of the 2013–14 season was a full international – a new club record."]}, {"page": "Peter Bonetti", "response": ["He then returned to Chelsea, where his experience proved invaluable in helping new manager Eddie McCreadie's young team gain promotion in 1976–77. Two years later, in May 1979, he played his final appearance for Chelsea, a 1–1 draw with Arsenal, having made a total of 729 appearances for the club in nineteen years – only Ron Harris has made more – and kept over 200 clean sheets. He conceded one goal or less in two-thirds of his appearances for Chelsea."]}, {"page": "Eddie Gray (footballer, born 1948)", "response": ["Gray's marking full back was David Webb, a steady but undistinguished defender whom, for the 90 minutes and extra-time period, Gray tormented. Webb was repeatedly left on his backside or looking the wrong way as Gray ghosted past him, including one run where he cut inside onto his 'weaker' right foot and crashed a shot against the crossbar. Though Leeds dominated the match, the game still ended 2–2 and a replay was required – Gray had taken the corner which had allowed Jack Charlton to open the scoring. In the replay, Chelsea changed tactics and put the more uncompromising Ron Harris on to Gray and as a result, the danger was snuffed out – Harris badly injured Gray with a brutal tackle to the back of the knee. Chelsea won 2–1 and, in a final twist, it was Webb who scored the winner. Leeds lost the League championship race to Everton and the European Cup semi-final to Celtic, thereby ended with nothing."]}, {"page": "Stamford Bridge (stadium)", "response": ["* Harris Suite (Ron Harris)"]}, {"page": "Tommy Docherty", "response": ["Docherty led Chelsea to the FA and the Inter-Cities Fairs Cup semi-finals a year later, before reaching the FA Cup Final in 1967, which they lost to Tottenham Hotspur. He resigned in October 1967. The core of the team Docherty had put together, including Peter Osgood, Charlie Cooke, Ron Harris, Bonetti and John Hollins, went on to win the FA Cup and Cup Winners' Cup under Docherty's successor, Dave Sexton. A decade later Sexton succeeded Docherty as manager of Manchester United."]}, {"page": "Martin Foyle", "response": ["He made 98 appearances and scored 35 goals in the league for Aldershot, as the \"Shots\" posted mid-table finishes in the Fourth Division in 1984–85 under Ron Harris. Foyle was named as Aldershot Town Player of the Season for the 1984–85 campaign. Harris was replaced by Len Walker for the 1985–86 campaign, and another mid-table finish ensued. The club won promotion in 1986–87 after beating Wolverhampton Wanderers 3–0 in the play-off Final. However Foyle missed out on the celebrations, as he was transferred to Oxford United on 26 March 1987 for a fee of £140,000, of which Southampton received £40,000."]}, {"page": "Ron Harris", "response": ["* Ron Harris (Australian footballer) (1924–2006), played for Hawthorn in the VFL", "* Ron Harris (English footballer) (born 1944), 1960s-1970s English footballer", "* Ron Harris, one of the two American professional wrestlers who wrestled as The Harris Brothers", "* Ron Harris (ice hockey) (born 1942), former ice hockey player", "* Ron Harris (photographer) (1933–2017), nude photographer", "* Ron Harris, a detective character from the TV show Barney Miller"]}, {"page": "Ewell", "response": ["In sport, footballer Ron Harris lived in Ewell during the 1970s, cyclist Sean Yates in childhood, Trevor \"Tosh\" Chamberlain  lives in the town, and Michael \"Venom\" Page was a former resident. Michael Frayn, author and playwright, lived as a child in Hillside Road, off Queensmead Avenue, East Ewell."]}, {"page": "David Webb (footballer)", "response": ["It was with Chelsea that Webb really made his name in football, in particular for his role in Chelsea's win in the 1970 FA Cup final against Leeds United at Old Trafford. During the first game at Wembley, Webb, playing at right-back, had a nightmare and was tormented throughout the match by the nimble and tricky Leeds winger Eddie Gray as Chelsea were somewhat fortunate to emerge with a 2–2 draw. Manager Dave Sexton made a tactical switch for the replay, moving Webb to the centre to partner John Dempsey while the more uncompromising Ron Harris was detailed to mark Gray. Webb – and Chelsea overall – performed markedly better in the replay and it was he who proved the unlikely hero, heading in the winner from an Ian Hutchinson throw-in in extra time."]}, {"page": "1970 FA Cup Final", "response": ["Modern-day referee David Elleray reviewed the match in 1997, and concluded that the sides would have received six red cards and twenty yellow cards between them, in the modern era of football.See \"Interpretation of the Laws of the Game – Law 12\" at the FIFA website Tommy Baldwin and Terry Cooper, admittedly two of the quieter men in the two sides, were kicking lumps out of one another, as the battle began. Not long into the game, Chelsea's Ron Harris caught winger Eddie Gray with a kick to the back of the knee, an action which neutralised the Scottish winger for the rest of the game. Norman Hunter and Ian Hutchinson traded punches while Eddie McCreadie, in his own penalty area, made a flying kick to Billy Bremner's head and Johnny Giles also lunged at a Chelsea opponent. Charlton kneed and headbutted Peter Osgood while Chelsea's goalkeeper Peter Bonetti was injured after being bundled into the net by Leeds' Jones, who, minutes later, shot past the limping Bonetti for the opening goal.", "|CB ||6 || Ron Harris (c) || || ", "|RB ||2 || Ron Harris (c) "]}, {"page": "Blue Is the Colour (song)", "response": ["*Ron Harris"]}, {"page": "List of Chelsea F.C. records and statistics", "response": ["Domestically, Chelsea have won six top-flight titles, eight FA Cups and five League Cups. In Europe, they have won the UEFA Champions League, the UEFA Cup Winners' Cup, the UEFA Europa League and the UEFA Super Cup twice apiece. They were the first English club to win all four European trophies and are the only London club to win the UEFA Champions League. The club's record appearance maker is Ron Harris, who made 795 appearances between 1961 and 1980. Frank Lampard is Chelsea's record goalscorer, scoring 211 goals in total.", "*Most appearances in all competitions: 795, Ron Harris (1961–1980).", "*Most league appearances: 655, Ron Harris (1961–1980).", "*Most FA Cup appearances: 64, Ron Harris (1961–1980).", "*Most League Cup appearances: 48, John Hollins (1963–1975 and 1983–1984) and Ron Harris (1961–1980).", "|1||style=\"text-align:left;\"| Ron Harris||||655||64||48||27||1||795"]}, {"page": "List of Chelsea F.C. players", "response": ["! scope=\"row\" data-sort-value=\"Harris, Ron\" |  Ron Harris", "! scope=\"row\" data-sort-value=\"Harris, Ron\" |  Ron Harris"]}, {"page": "History of Chelsea F.C.", "response": ["Birrell's biggest contribution to Chelsea was off the field. In a bid to counter the spiraling cost of transfer fees in football, he oversaw the development of an extensive new youth and scouting programme, headed by ex-players Dickie Foss, Dick Spence and Jimmy Thompson, which would ultimately see the club produce its own players. The policy would provide the core of Chelsea's first team for the next three decades in particular, producing such players as Jimmy Greaves, Bobby Smith, Peter Osgood, Peter Bonetti, Ray Wilkins, Ron Harris, Bobby Tambling, Alan Hudson, Terry Venables and John Hollins.", "Chelsea competed with Tottenham Hotspur in the first all-London FA Cup final, known as the Cockney Cup Final. It was Chelsea's first appearance in the final since 1915 and their first ever appearance in the final at Wembley. In leading out the side, Ron Harris, at 22, was the youngest ever captain to take to the field in the competition's finale. In a game which failed to match the anticipation, Chelsea underperformed and a late Tambling header was not enough to prevent a 2–1 loss to a Spurs side containing both Venables and Jimmy Greaves. Docherty was sacked shortly into the next season with the team having won only two of their opening ten games, which included a 6–2 home loss to Southampton, amidst rumours of dressing room unrest over bonus payments and whilst serving a 28-day ban from football management handed out by the FA."]}, {"page": "Marvin Hinton", "response": ["When Hinton moved to Chelsea he reverted to full back.  Playing as part of a richly-talented team including the likes of Charlie Cooke, Alan Hudson, Bobby Tambling, John Hollins, Peter Bonetti and Peter Osgood he was part of the successful Chelsea side of the 60s and early 70s, earning his first winners' medal with the League Cup in 1965. After the departure of John Mortimore and Frank Upton, Hinton formed a long lasting partnership with Ron Harris in central defence. An appearance in the 1967 FA Cup Final defeat to Tottenham Hotspur earned him a runners-up medal and further success was to follow with victory in the 1970 FA Cup Final, where Chelsea defeated Leeds United, the reigning League Champions and one of the strongest teams of the era, in a replay at Old Trafford; Hinton came on as a substitute in both games. as the signing of John Dempsey and David Webb increased competition for first team places. Under coach (and later Manager) Dave Sexton, Hinton, Harris and Eddie McCreadie pioneered the zonal marking system of defense in the English First Division, consistently playing together throughout the Sixties."]}, {"page": "West London derby", "response": ["* Ron Harris – first Chelsea, then Brentford. Was also assistant manager at Brentford.", "*Allan Harris – Full back, brother of Ron Harris. Later assistant manager under El Tel."]}, {"page": "List of Live 8 artists", "response": ["*Andi Peters, Andy Townsend, Anouschka Menzies, Barry Killerby, David Beckham, Denis Irwin, Don Austen, Emma Ledden, Emma Forbes, Frank Stapleton, Gareth Southgate, Gary Lineker, Gary McFadden, Harriet Thorpe, Harrison Oldroyd, Heather Suttie, Geoff Hurst, George Cohen, Jack Charlton, Jamie Theakston, Jason McAteer, Jill Greenacre, John Aldridge, John Barrowman, John Eccleston, Julia St. John, Katy Hill, Kenny Cunningham, Kevin Keegan, Kevin Moran, Martin Peters, Matt Le Tissier, Mike Burns, Mitch Johnson, Norman Hunter, Ortis Deley, Packie Bonner, Peter Shilton, Peter Simon, Pippa Haywood, Ray Houghton, Ron Atkinson, Ron Harris, Ronnie Whelan, Russell Porter, Sarah Cawood, Stephen Churchett, Steve Staunton, Steve Wilson, Thomas Sangster, Tim Marriott, Trevor and Simon, Trey Farley & Zoe Ball."]}, {"page": "1965 Football League Cup Final", "response": ["|FB ||3 || Ron Harris", "|FB ||4 || Ron Harris"]}, {"page": "Chelsea F.C. Under-23s and Academy", "response": ["* Ron Harris"]}, {"page": "1967 FA Cup Final", "response": ["|DF ||6 || Ron Harris (c)"]}, {"page": "2007 FA Cup Final", "response": ["*Ron Harris – Chelsea captain, 1970"]}, {"page": "Ray Bloomfield", "response": ["As a young player he represented England at schoolboy level, where he played alongside David Pleat, Barry Fry and Ron Harris, and at youth level."]}, {"page": "List of people from Epsom", "response": ["*Ron Harris, Chelsea F.C. defender, nicknamed Chopper, lived in West Gardens, The Headway and his parents ran a sweet shop on Ruxley Lane in the 1960s and 1970s"]}, {"page": "Len Walker", "response": ["In January 1981, he was appointed manager of his former club, Aldershot. Apart from finishing one place outside of promotion in 1984, Walker achieved little of note during his first spell as manager, and was sacked later that year after the club's new owners decided to replace him with the higher-profile Ron Harris. Harris moved on at the end of that season however, which led to Walker being re-appointed. During his second spell as manager, Aldershot achieved promotion from the Fourth Division in 1987 - only the second promotion in their Football League history."]}, {"page": "1971 European Cup Winners' Cup Final", "response": ["|DF ||3 || Ron Harris (c)", "|LB ||3 || Ron Harris (c)"]}, {"page": "1972 Football League Cup Final", "response": ["|DF ||3 || Ron Harris (c)"]}, {"page": "Gordon Bolland", "response": ["A striker, Bolland joined Londoners Chelsea as a teenager, and was a member of the sides which won the FA Youth Cup in 1960 and 1961, alongside the likes of Peter Bonetti, Ron Harris, Terry Venables and Bobby Tambling. Despite this, he only made two appearances for the first team and was released in March 1962, after which he signed for Leyton Orient."]}, {"page": "Chopper Harris", "response": ["#REDIRECT Ron Harris (English footballer)"]}, {"page": "1969–70 Chelsea F.C. season", "response": ["|DF|| Ron Harris"]}, {"page": "Norman Giller", "response": ["Giller's 82nd book was The Lane of Dreams, a complete history of the Tottenham Hotspur ground at White Hart Lane before the bulldozers move in. The book is introduced by Jimmy Greaves and Steve Perryman. It is a self-published book by Giller, who experimented by having the second-half written on line by Tottenham supporters. He had six books published in 2010, written in collaboration with his sports statistician son, Michael Giller, and sports agent Terry Baker: Jimmy Greaves At Seventy and The Golden Double, the story of Tottenham's historic League and FA Cup triumph in 1960–61, Greavsie's Greatest (The 50 greatest post-war British strikers, selected by Jimmy Greaves), World Cup 2010, (a day to day diary of the tournament), Chopper's Chelsea, in collaboration with former Stamford Bridge captain Ron Harris, and Hammers-80, the story of West Ham United's FA Cup success of 1979–80, introduced by Sir Trevor Brooking. His 88th book is a powerful novel about corruption in football, The Glory and the Greed', which has been produced ahead of traditional publication as an e-Book for reading on screen. Book No. 98, published in November 2014, was Spurs IQ, a part history, part quiz book about Tottenham Hotspur.", "*Chopper's Chelsea (with Ron Harris and Terry Baker)"]}, {"page": "1970–71 Chelsea F.C. season", "response": ["|DF|| Ron Harris"]}]}}