{"wiki_id": "http://www.wikidata.org/entity/Q3380736", "itemLabel": "Gavin Peacock", "itemDescription": "football player from England (born 1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gavin_Peacock", "wikipedia_page": {"main": "Gavin Keith Peacock (born 18 November 1967) is an English former professional footballer and sports television pundit.\nAs a player he was midfielder and striker from 1984 until 2002, notably playing in the Premier League for Newcastle United and Chelsea. He also played in the Football League for Queens Park Rangers, Gillingham, AFC Bournemouth and Charlton Athletic. \nHe then worked in the media as a pundit, notably for BBC Sport, before in September 2008 he relocated to Canada to study theology with a view to becoming a Christian minister.", "link_mentions": [{"page": "Newcastle United F.C.", "response": ["|1992|| Gavin Peacock"]}, {"page": "Crayford", "response": ["*Keith and Gavin Peacock, father and son footballers."]}, {"page": "Kevin Keegan", "response": ["Top scorer David Kelly and influential midfielder Gavin Peacock were both sold during the close season, and Keegan brought striker Peter Beardsley back to Newcastle from Everton, six years after he had been sold by Newcastle to Liverpool."]}, {"page": "Eltham", "response": ["*Gavin Peacock – former Charlton Athletic, Chelsea, Queens Park Rangers Footballer, former football pundit for the BBC and currently studying to become a vicar."]}, {"page": "Glenn Hoddle", "response": ["In June 1993, Hoddle became player-manager of Chelsea. His assistant at Chelsea was the former Tottenham manager Peter Shreeves, and they reached the FA Cup final in Hoddle's first season, where they lost 4–0 to Manchester United. But United had done the double, and consolation for their failure to win the trophy came in the form of a European Cup Winners' Cup place - Chelsea's first European campaign for more than 20 years. Chelsea finished 14th in the league that season, memorably managing to inflict two of just four league defeats on the double winners that season, winning 1–0 at Stamford Bridge in September and 1–0 at Old Trafford in March, with Gavin Peacock scoring both times.", "Chelsea reached the semi-finals of the European Cup Winners' competition in 1994–95 and lost by a single goal to Real Zaragoza, who went on to beat Arsenal in the final. Hoddle guided Chelsea to the FA Cup Semi-finals in 1995–96, but was unable to take them beyond 11th place in the Premiership – they had occupied this final position three times in four years. He did establish them as a force in cup competitions and made them capable of attracting top-class players – such as Ruud Gullit – to the club. Other notable signings were Mark Hughes, Dan Petrescu, Gavin Peacock, David Rocastle and Mark Stein."]}, {"page": "Ridley Hall, Cambridge", "response": ["*Gavin Peacock"]}, {"page": "Songs of Praise", "response": ["Guest presenters have included Sir Cliff Richard, Gavin Peacock, Michael Buerk, Pete Waterman,\"The Hitman and Hymn\", BBC Press Office, 7 October 2002. Ann Widdecombe and Caron Keating. Jonathan Edwards' departure from the programme in 2007 was notable after he publicly renounced his Christian faith."]}, {"page": "Linvoy Primus", "response": ["He was also involved in supporting the Alpha course, which is run all over the world, and is designed to explain Christian beliefs and promote discussion. Primus appeared in a cinema advertisement for the movement, alongside the comedian Lennie Bennett. At his former club Portsmouth, he founded a prayer group which has included teammates such as Nwankwo Kanu, Sean Davis and Benjani. In December 2006, he took part in a Football Focus feature on faith in the game presented by fellow Christian footballer Gavin Peacock. On 16 April 2013, Primus played for Portsmouth in a charity match raising money for the Portsmouth supporters trust."]}, {"page": "Rob Lee", "response": ["Lee who also has ancestry ties to the North East, having relatives who marched in the Jarrow March, signed for Newcastle in 1992. Despite his North East connections, Lee noted it was his childhood footballing hero Kevin Keegan who influenced him to move to Newcastle United. Keegan also promised Lee that if he moved to Newcastle United he would play for England. Newcastle player Gavin Peacock had first alerted Keegan to the ability of Lee. In passing a comment, Peacock stated to Keegan that there is a player from Charlton who could play at the highest level. "]}, {"page": "History of Newcastle United F.C.", "response": ["Smith then signed Portsmouth striker Mick Quinn and Newcastle began the 1989-90 season on a high note, beating promotion favourites Leeds United 5-2 on the opening day with Quinn scoring four goals, and Newcastle appeared to be on the path to a revival. However, they missed out on automatic promotion by one place, before enduring a humiliating play-off exit at the hands of local rivals Sunderland. The intensifying boardroom battle soon took its toll on the club, and Smith resigned early in the following season with the side stuck in mid-table. Ossie Ardiles became the club's new manager, and despite being initially being the club's most popular manager since Joe Harvey, Newcastle dropped to the bottom of the Second Division in October 1991. Results failed to improve, despite the acquisition of a new striker in David Kelly and the efforts of promising young players including Steve Howey, Steve Watson and Gavin Peacock, and in February 1992 Ardiles was sacked. Despite being the best-supported side in the division and frequently still managing to pull in crowds of more than 20,000, Newcastle were also millions of pounds in debt and faced with the real prospect of third tier football for the first time ever. A saviour was needed, and in came new chairman John Hall, who offered the manager's job to Kevin Keegan. Despite having vowed never to enter management following his retirement as a player, Keegan accepted the offer to manage Newcastle. His first task was to deliver Second Division survival."]}, {"page": "List of Newcastle United F.C. players", "response": ["|align=\"left\"|Gavin Peacock||||AM/FW||1990–1993||119||42||"]}, {"page": "1993–94 in English football", "response": ["12 August 1993 – Chelsea buy midfielder Gavin Peacock from Newcastle United for £1.2million, while Everton's longest-serving player Kevin Ratcliffe leaves Goodison Park after 15 years and joins Cardiff City on a free transfer.", "11 September 1993 – Kevin Campbell scores a hat-trick in Arsenal's 4–0 home league win over Ipswich Town. Eric Cantona's shot from the halfway line at Stamford Bridge hits the crossbar, and a Gavin Peacock goal gives Chelsea a 1–0 win over Manchester United. Down in Division One, Oxford United climb six places from the foot of the table with a spectacular 4–2 home win over Bristol City."]}, {"page": "1995–96 in English football", "response": ["4 February 1996: Gavin Peacock scores a hat-trick in Chelsea's 5–0 win against Middlesbrough."]}, {"page": "1967 in association football", "response": ["* November 18 – Gavin Peacock, English footballer and sportscaster"]}, {"page": "Bexley Grammar School", "response": ["* Gavin Peacock, former professional footballer"]}, {"page": "West London derby", "response": ["QPR and Chelsea have competed in two pre-season friendlies since the turn of the century. The most recent was in 2003 when Chelsea thrashed a QPR Legends XI 7–0. On 28 July 2001, QPR stunned the £50 million Chelsea line-up by beating them 3–1. Jesper Grønkjær gave Chelsea a first-half lead, but QPR got an equaliser from Leroy Griffiths and then took lead from a long range effort by Karl Connolly. QPR confirmed the win when Gavin Peacock, also a former Chelsea player, scored late on.", "*Gavin Peacock – Played for Chelsea in the nineties, either side of spells at QPR."]}, {"page": "Show Racism the Red Card", "response": ["*Gavin Peacock"]}, {"page": "1994 FA Cup Final", "response": ["The match took place on a rainy May afternoon, and, in the first half, Chelsea were the better team. Gavin Peacock had the best chance of the opening 45 minutes when his half-volley hit the crossbar. In the second half, Manchester United took over with three goals in the space of nine minutes; two almost identical penalties by Eric Cantona and a shot by Mark Hughes, following a slip by Chelsea defender Frank Sinclair. Brian McClair scored a late fourth following an unselfish pass by Paul Ince. Referee David Elleray has since stated that he regrets giving the second penalty to Manchester United, stating \"It was my big game and I made a disappointing decision.\"", "|CM ||10|| Gavin Peacock"]}]}}