{"wiki_id": "http://www.wikidata.org/entity/Q338338", "itemLabel": "Shaun Ryder", "itemDescription": "musician, singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Shaun_Ryder", "wikipedia_page": {"main": "Shaun William George Ryder (born 23 August 1962) is an English singer/songwriter and poet. As lead singer of Happy Mondays, he was a leading figure in the Madchester cultural scene during the late 1980s and early 1990s. In 1993, he formed Black Grape with former Happy Mondays dancer Bez. He was the runner-up on the tenth series of I'm a Celebrity...Get Me Out of Here!.", "link_mentions": [{"page": "August 23", "response": ["*  1962   – Shaun Ryder, English singer-songwriter and actor"]}, {"page": "Gorillaz", "response": ["Demon Days found the band taking a darker tone, partially influenced by a train journey Albarn had taken with his family through impoverished rural China. Albarn described the album as a concept album: \"The whole album kind of tells the story of the night — staying up during the night — but it's also an allegory. It's what we're living in basically, the world in a state of night.\" Believing that the album needed \"a slightly different approach\" compared to the first album, Albarn enlisted American producer Brian Burton, better known by his stage name Danger Mouse, to produce the album, whom Albarn praised as \"one of the best young producers in the world\" after hearing his 2004 mashup album The Grey Album. Burton felt he and Albarn had a high degree of affinity with each other, stating in an interview on the creation of the album: \"We never had any arguments. We even have that finish-each-other's-sentences thing happening. There are a lot of the same influences between us, like Ennio Morricone and psychedelic pop-rock, but he has 10 years on me, so I have some catching up to do. Where he can school me on new wave and punk of the late ’70s/early ’80s, I can school him on a lot of hip-hop. We’re very competitive and pushed each other.\" Similar to the first album, Demon Days features collaborations with several different artists, including Bootie Brown, Shaun Ryder, Ike Turner, MF Doom (who was recording with Danger Mouse as Danger Doom at the time) and Martina Topley-Bird, among others."]}, {"page": "Talking Heads", "response": ["Weymouth, Frantz, and Harrison toured without Byrne as Shrunken Heads in the early 90s. In 1996, they released an album, No Talking, Just Head, under the name the Heads. The album featured a number of vocalists, including Gavin Friday of The Virgin Prunes, Debbie Harry of Blondie, Johnette Napolitano of Concrete Blonde, Andy Partridge of XTC, Gordon Gano of Violent Femmes, Michael Hutchence of INXS, Ed Kowalczyk of Live, Shaun Ryder of Happy Mondays, Richard Hell, and Maria McKee. It was accompanied by a tour with Napolitano as the vocalist. Byrne took legal action to prevent the band using the name The Heads, which he saw as \"a pretty obvious attempt to cash in on the Talking Heads name\". The band briefly reunited in 1999 to promote the 15th anniversary re-release of Stop Making Sense, but did not perform together."]}, {"page": "1962", "response": ["** Shaun Ryder, English musician, singer-songwriter, actor"]}, {"page": "Triple J Hottest 100", "response": ["#Gorillaz featuring Shaun Ryder – \"Dare\""]}, {"page": "Madchester", "response": ["The Happy Mondays were formed in Salford in 1980. The members between then and the break-up of the band in 1992 were Shaun Ryder, his brother Paul, Mark \"Bez\" Berry, Paul Davis, Mark Day, and Gary Whelan. They were signed to Factory Records, supposedly after Haçienda DJ Mike Pickering saw them at a Battle of the Bands contest in which they came last. They released two singles—\"45\", produced by Pickering in 1985, and \"Freaky Dancin'\", produced by New Order's Bernard Sumner in 1986—before putting out an album produced by John Cale and bearing the title Squirrel and G-Man Twenty Four Hour Party People Plastic Face Carnt Smile (White Out) in 1987."]}, {"page": "Happy Mondays", "response": ["Happy Mondays are an English rock band formed in Salford in 1980. The band's original line-up was Shaun Ryder (vocals), his brother Paul Ryder (bass), Gary Whelan (drums), Paul Davis (keyboard), and Mark Day (guitar). Mark \"Bez\" Berry later joined the band onstage as a dancer/percussionist. Rowetta joined the band as a vocalist in 1990.", "By the late 1980s, the Happy Mondays were an important part of the Manchester music scene and personified rave culture. Numerous world tours meant the band had international success as well as massive success in their home country. The line-up of the band during this first and most important ten-year phase never changed, and the six original members Shaun Ryder, Paul Ryder, Gary Whelan, Paul Davis, Mark Day, and Mark \"Bez\" Berry remained a tight unit until the first incarnation came to an end in 1994. The band headlined the Friday night at Glastonbury Festival 1990. In November of that year, Paul McCartney commented in NME: \"I saw the Happy Mondays on TV, and they reminded me of the Beatles in their 'Strawberry Fields' phase.\"", "Happy Mondays disbanded in 1993, and Shaun Ryder and Bez formed Black Grape with ex-Paris Angels guitarist \"Wags\" (who would later go on to serve in the 1999–2000 reincarnation of the Mondays) and ex-Ruthless Rap Assassins star Kermit. Seven years passed, and in 1999 Happy Mondays re-formed, with founding members Shaun Ryder, Paul Ryder, Gary Whelan and Bez minus Paul Davis and Mark Day. In the place of Day and Davis were Wags and a number of other session musicians including Ben Leach who had once been a member of The Farm, percussionist Lea Mullen, and rapper \"Nuts\". Also joining the new line-up was soul diva Rowetta Satchell (who sang back-up on Pills, Thrills, and Bellyaches, as well as Yes Please!, and who would go on to have solo success). The band toured extensively in the UK and internationally, selling out the 20,000 capacity Manchester Arena and two nights at Brixton Academy, and released a new single, a cover version of the Thin Lizzy hit \"The Boys Are Back in Town\". The single reached number 24 in the UK Singles Chart. They provided support for Oasis on their \"Standing on the Shoulder of Giants\" arena tour, played at the Fuji Rock Festival in Japan, numerous European festivals including T in the Park and also toured Australia the same year. Although critically acclaimed and playing to sell-out crowds, the band once more ceased their activity in 2001 following the departure of bass player and founding member Paul Ryder.", "A fictionalised depiction of the band is featured in the 2002 film 24 Hour Party People, with Danny Cunningham as Shaun Ryder and Paul Popplewell as Paul Ryder. Paul Ryder himself had a cameo role in the film as a gangster and Rowetta (who sang for the band on Pills 'n' Thrills and Bellyaches and Yes Please!) appeared in the film as herself.", "2004 saw another re-formation, comprising original members Bez, Whelan and Shaun Ryder along with another group of musicians. Shaun Ryder recruited Kav Sandhu to join on guitar & bring in a new group of musicians. Kav brought on-board bassist Mikey Shine, keyboard player Dave Parkinson & guitarist Jonn Dunn. Dave Parkinson was later replaced by Dan Broad. Backing singers on the first tour were Angie Brown and Ron Carroll. from 2004 to 2006 the band were managed by Danny Newman, MD at London Club Turnmills brother of London Club DJ Tall Paul. Rowetta's backing vocal role was now being performed by Julie E. Gordon who toured with the band until 2010. Paul Ryder was not present, having sworn to never perform with his brother again following the 2000 break-up, and formed his own band Big Arm. That year, the Mondays released a live DVD of a show in Barcelona. The Mondays played a variety of festival dates in 2005 (including Global Gathering), capping it off with a concert at the Manchester Arena.", "Happy Mondays toured the US and Canada with The Psychedelic Furs in late 2009 with Paul Ryder's son and Shaun Ryder's nephew Jake Ryder filling in for Gaz Whelan on drums.", "This version of the band continued until 2010. Members Mikey Shine, Jonn Dunn & Dan Broad continued to back Shaun Ryder for his solo tour until 2011, surrounding the release of his autobiography.", "On 29 January 2012, Shaun Ryder announced on radio station Xfm that the band would return with the original and definitive lineup of himself, his brother Paul Ryder on bass, Gary Whelan on drums, Rowetta as female vocalist, Mark Day on guitar, Paul Davis on keyboards and dancer Mark Berry. They appeared on ITV's This Morning, and were interviewed by Philip Schofield. Shaun Ryder pronounced that amends had been made, friendships reinstated and that it was just like the old days, but without the madness. They did a 13-date UK tour in May 2012, most of which were sold out, and an extra date was added at London's Brixton Academy due to the demand for tickets. The tour included other shows at the Manchester Arena, plus other dates in Bournemouth, Glasgow, Dublin, Leeds, Sheffield and Nottingham. To coincide with the band's reformation tour a best of album, Double Double Good was released in July 2012, as well as a live recording of the band's May 2012 gig in Brixton. The band went on to play gigs in Chile and Argentina in May 2012 and then a number of European festivals in the summer of 2012, including Ireland's Sea Sessions, Scotland's T in the Park, the band were headliners at Camp Bestival in Dorset in July 2012 and they performed at the V Festivals in August 2012. They then travelled to Majorca and Ibiza to play the Ibiza and Majorca Rocks events.", "* Shaun Ryder – lead vocals, guitar (1980–1993, 1999–2001, 2004–2010, 2012–present)", "  bar:Shaun text:Shaun Ryder"]}, {"page": "Cabaret Voltaire (band)", "response": ["In 1995, Mallinder moved to Perth, Australia, and effectively left Cabaret Voltaire in order to step away from the commercial and financial pressures of what had become of his music career. Opting instead to make music with less emphasis on product, Mallinder set up his own music company in Perth, OffWorld Sounds, while he pursued an academic career. Eventually Mallinder returned to music collaboration with a number of projects including Sassi & Loco and Kuling-Bros. Mallinder also contributed to synthesizer and programming on Shaun Ryder's solo album Amateur Night at the Big Top."]}, {"page": "24 Hour Party People", "response": ["Wilson opens a nightclub, the Haçienda; business is slow at first, but eventually the club is packed each night. Wilson signs another hit band, Happy Mondays, led by Shaun Ryder, and the ecstasy-fuelled rave culture is born.", "* Danny Cunningham as Shaun Ryder (Happy Mondays singer)"]}, {"page": "Through the Keyhole", "response": ["| 1 || Alan CarrRuth LangsfordJonathan Ross || SinittaShaun RyderLaurence Llewelyn-Bowen || 30 August 2014 || 3.35"]}, {"page": "Bez (dancer)", "response": ["Bez is best known as the maraca player, dancer, and de facto mascot of rock band Happy Mondays, having been invited by lead singer Shaun Ryder shortly after the band was formed. He is chiefly remembered for his bizarre style of dancing and use of maracas. The band's second single, \"Freaky Dancin'\", was rumoured to be a tribute to Bez. However, Ryder stated that this was not the case in his autobiography Twistin' My Melon."]}, {"page": "Grand Theft Auto: San Andreas", "response": ["The player assumes the role of Carl \"CJ\" Johnson (voiced by Young Maylay), a veteran member of the Los Santos-based Grove Street Families street gang, who left for Liberty City five years prior in pursuit of a better life, but returns home following his mother's death. The gang is led by CJ's estranged older brother Sean/\"Sweet\" (Faizon Love), and includes his childhood friends Melvin \"Big Smoke\" Harris (Clifton Powell), Lance \"Ryder\" Wilson (MC Eiht), and aspiring rapper Jeffrey \"OG Loc\" Cross (Jas Anderson). Throughout the game, CJ befriends various characters that become important allies, including Cesar Vialpando (Clifton Collins Jr.), the leader of the Hispanic street gang Varrios Los Aztecas and the boyfriend of Carl's sister Kendl (Yo-Yo); hippie weed grower \"The Truth\" (Peter Fonda); tech genius and RC shop owner Zero (David Cross); blind Triad crime boss Wu Zi Mu/\"Woozie\" (James Yaegashi); government agent Mike Toreno (James Woods); crooked lawyer Ken Rosenberg (William Fichtner); criminally connected music producer Kent Paul (Danny Dyer); washed-up singer Maccer (Shaun Ryder); and renowned rapper Madd Dogg (Ice-T)."]}, {"page": "Fallowfield", "response": ["*Shaun Ryder, musician and television personality, best known as a member of the Happy Mondays and Black Grape, lived in Fallowfield during the late 1980s"]}, {"page": "Mark E. Smith", "response": ["Smith had a difficult and often reactionary personality, and was defiantly Northern English in outlook. Brix said that he carried \"a chip on both shoulders. I remember him talking about fucking southern bastards a lot and not wanting to come to London. He hated London intensely. He’s quite contrarian as a person and as a writer, which is what gives him his edge.\"O'Hagan, Sean. \"Brix Smith Start: ‘Mark E Smith? He’s complicated’\". The Observer, 1 May 2016. Retrieved 27 January 2018 Throughout his career, he clashed with musicians, record producers, sound engineers, record label heads and fellow Manchester scene alumni such as Tony Wilson, Peter Hook, Shaun Ryder and Morrissey, whom he disparagingly referred to as \"Steven\". Smith had a working class and anti-intellectual outlook, but a strong interest in literature. As the journalist Andrew Harrison observed, although he wished that a majority of his audience were miners and postmen, a great many were students or Guardian readers."]}, {"page": "Black Grape", "response": ["The band was formed in 1993 by former Happy Mondays members Shaun Ryder and Bez. It was Ryder's first musical project after the disintegration of Happy Mondays due both to his multiple drug addictions and to disagreements about revenues with other band members. The formation of the new band was intended to draw a line between his past life and his new one. Ryder and Bez recruited rappers Paul \"Kermit\" Leveridge and Carl \"Psycho\" McCarthy, drummer Ged Lynch (like Leveridge, a former member of Ruthless Rap Assassins), and guitarist Wags (formerly of the Manchester-based group the Paris Angels) and Oli \"Dirtycash\" Dillon on ocarina. Recording of new material started that year, although the group was not under contract."]}, {"page": "Squirrel and G-Man Twenty Four Hour Party People Plastic Face Carnt Smile (White Out)", "response": ["At age 16, Shaun Ryder left education in 1978, acquiring a job with his father at a post office.Spence 2015, p. 11 Two years later, he formed a band with his brother Paul Ryder on bass, their cousin Matt Carroll on guitar and the Ryders' father's drum machine. Paul Ryder joined Shaun at the post office after finishing his education.Spence 2015, p. 15 In 1981, Mark Day began working at the same post office, and quickly joined the band on guitar.Spence 2015, pp. 17, 19 As the band were rehearsing in Day's attic by early 1982, they went by the name Something in the Attic. After a few more rehearsals, Carroll left, not before giving the band their new name of Avant-Garde.Spence 2015, pp. 19–20 Shaun Ryder learned of drummer Gary Whelan through his fiancé's sister; she and Day independently asked Whelan to join them.Spence 2015, pp. 24–5 By the end of 1982, the band – now named Penguin Dice – were writing original material.Spence 2015, pp. 30, 33 In early 1983, the name was changed to Happy Laws, and eventually to Happy Mondays.", "Happy Mondays met Mark \"Bez\" Berry through mutual friend Little Mini;Spence 2015, p. 68 Bez had previously attended school with Davis, Day and Whelan.Middles 1997, p. 23 At the band's next gig, Bez was invited to dance on stage with him as Ryder had a bad acid trip earlier that evening.Spence 2015, p. 70 Shaun Ryder befriended Terry Hall, who he knew from the latter's work with the Specials and Fun Boy Three.Middles 1997, pp. 42–3 Ryder and the rest of Happy Mondays (with Bez in tow) supported Hall on tour with his newest outfit the Colourfield, observing that band's stage presence in an attempt to improve their own.Middles 1997, p. 43Spence 2015, p. 78 Happy Mondays' next single, the Bernard Sumner-produced \"Freaky Dancin'\", was released in June 1986.Middles 1997, p. 50 It saw wah wah guitar over a backbeat, which could become the band's core sound moving forward.Middles 1997, p. 51 During a promotional shoot while making the song, Bez graduated from being the band's friend to officially becoming their percussionist and dancer.Middles 1997, pp. 51, 53Warburton; Ryder 2011, p. 12", "Musically, the sound of Squirrel and G-Man Twenty Four Hour Party People Plastic Face Carnt Smile (White Out) has been described as mixing the punk-funk of ESG with the atmosphere of Joy Division; it has also been tagged as avant-garde pop. In his biography of the band, Shaun Ryder: Happy Mondays, Black Grape & Other Traumas, author Mick Middles referred to album as: \"A thousand nights, drunk on funk, dull thuds and a wandering bass, [with] a wholly intoxicated [...] sound\".Middles 1997, p. 57 Squirrel and G-Man Twenty Four Hour Party People Plastic Face Carnt Smile (White Out) features many characteristics that would be further developed on the band's second studio album Bummed (1988), such as Ryder's seemingly nonsensical lyrics combined with funk rhythms. Ryder said house music was seeping into the club nights that the members visited, though the band was unable to bring that influence into their songs as he felt they were not competent musicians.Verrico 1998, p. 47", "\"Oasis\" originated from a jam session in Whelan's bedroom, and is named after a city market of the same name that his friend worked out.Spence 2015, p. 55 An earlier version it had previously appeared on the Forty Five EP two years prior.Middles 1997, p. 46 \"Desmond\" has a similar melody to the one heard in \"Ob-La-Di, Ob-La-Da\" (1968) by the Beatles. The song is about the character \"Eddie the Breakdancer\"; Whelan disliked it as he felt the band did not perfect it in the studio. The pseudo-title track \"24 Hour Party People\" deals with people that are on the dole, who would prefer to party instead of looking for job opportunities.Brown 2017, p. 117 Shaun Ryder felt that with the song, he had found his voice in songwriting, being able to write about his life instead of what people expected him to write about.Ryder 2019, p. 12 The intro to the closing track \"Cob 20\" evokes the sound of the Cure. Its title references a school friend of the Ryders' who would ride his sister's Raleigh Twenty bicycle.", "* Shaun Ryder – vocals"]}, {"page": "Bummed", "response": ["Shortly before Christmas 1987, Happy Mondays dancer Bez was introduced to the rave drug ecstasy, and quickly introduced it to the other members.Spence 2015, p. 121 Frontman Shaun Ryder grew tired of their manager Phil Saxe, wanting someone who was more in tune with the scene at the Haçienda. In early 1988, Saxe left his role, citing that he could not devote enough time to them.Middles 1997, p. 68 He was replaced by Nathan McGough, who took on the role full-time, at his suggestion; McGough had been a member of Factory bands the Royal Family and the Poor, and previously managed Factory act Kalima.Middles 1997, pp. 68, 69 McGough's first measure was getting the band legally signed to Factory, who had no formal contracts with their artists up to that point.Middles 1997, p. 70 Around this time, the members had a lucrative business selling ecstasy; through various people, they had accumulated 15,000 pills of the drug.Spence 2015, p. 124", "Hannett would have the band perform the songs over and over for several hours at a time, and as such, would record the majority of the album live. Due to his previous experience as a bass player, Hannett spent time alone with Paul Ryder working on a specific sound. Hannett ran the instrument through a multitude of digital filters, time modulation and effects pedals.Spence 2015, p. 135–6 In addition to using his own guitar on the album, guitarist Mark Day used one of Hannett's. Aware of Hannett's financial issues, Shaun Ryder bought the guitar from him for £300.Spence 2015, p. 136 On one occasion, Wilson visited the band during the sessions. Upon entering the studio, he found it dark and filled with smoke, as the floor was completely covered in house records.Middles 1997, pp. 74–5", "In his biography of the band, Shaun Ryder: Happy Mondays, Black Grape & Other Traumas, author Mick Middles said the public overlooked its intent, theorising that it could be used in varying contexts: \"from the more obvious cadging (e.g. he bummed a fag from his mate) to scrounging a room for the night (e.g. he bummed a carpet)\".Middles 1997, p. 79–80 The 1970 film Performance became a big influence on the band, with Ryder directly lifting lines of dialogues for lyrics, or being inspired by some of the scenes in it. He would mix in slang words he had heard while shifting ecstasy. Ryder was expected to have finished writing the lyrics to the songs in the months prior to recording; by the time recording was nearly done, he had lyrics for less than half of the album. It prompted him to finish the other half in the final few days of the sessions.Verrico 1998, p. 64", "\"Country Song\" – the opening track on Bummed – was originally known as \"Some Cunt from Preston\", acting as rhyming slang for country and western. John Wilde of Melody Maker described it as \"the world's first psycho-reggae-country-western number\".Middles 1997, p. 75 It was written before the band had figured out their sound; while rehearsing at The Boardwalk, they came up with what Ryder called the \"Salford version of a country song\".Ryder 2019, p. 15 Its title changed was from \"Some Cunt from Preston\" to \"Redneck\", before ending up at \"Country Song\".Verrico 1998, p. 74 \"Moving in With\" is about the place Ryder lived at while in Boothstown, Salford.Ryder 2019, p. 17 An earlier version of it was recorded during the same session as \"24 Hour Party People\". With the song, Paul Ryder attempted to emulate the bass part in \"This Must Be the Place (Naive Melody)\" (1983) by Talking Heads. Whelan's drum part was inspired by the one in \"Running Up That Hill\" (1985) by Kate Bush. Shaun Ryder's lyrics were influenced by the folk tale Henny Penny, and namechecks several of its characters.Spence 2015, p. 109", "With \"Wrote for Luck\", the band tried to write a song that could be played at the Haçienda. Paul Ryder unsuccessfully tried to play sequenced basslines, which he heard in the Chicago house music that Pickering was playing at the club, on his bass guitar. Keyboardist Paul Davis tried to play the synth part from \"Two Tribes\" (1984) by Frankie Goes to Hollywood, while Whelan had a go at emulating \"Running Up That Hill\" again. Day later contributed his guitar part, while Shaun Ryder added the song's hook, \"Higher than high high\", based on his mental state at the time.Spence 2015, p. 126 It marked the first time Ryder attempted to write a song about the same topic, namely a heroin drug deal gone wrong. One of its lines is dialogue directly taken from the film Stardust (1974).", "* Shaun Ryder"]}, {"page": "Pills 'n' Thrills and Bellyaches", "response": ["Oakenfold and Osborne were enlisted again to create remixes, which were successful commercially and critically.Spence 2015, p. 183 Around this time, the band appeared on Top of the Pops with the Stone Roses, which acted as a catalyst for the Madchester scene.Middles 1997, pp. 82, 100 Relationships between band members became strained, while manager Nathan McGough spent more time partying than assisting them. Frontman Shaun Ryder was especially disconnected from the others, using heroin as a crutch.Spence 2015, p. 194 In February 1990, Happy Mondays' label in the United States, Elektra Records, picked them to contribute a cover for a 40th anniversary compilation album.Middles 1997, pp. 103–4 Happy Mondays initially considered doing a Tom Waits track, until someone suggested John Kongos; they recorded Kongos' \"He's Gonna Step on You Again\" (1971) at Eden Studios in London.Middles 1997, p. 104", "Spurred on by the laidback nature of the sessions, the band attempted a cover of \"Everybody's Talkin'\" (1966) by Fred Neil. With the guidance of Oakenfold, kept the feel of the song, while scrapping everything else, eventually causing the band to write \"Bob's Yer Uncle\".Spence 2015, p. 228 Shaun Ryder would attempt to get out of recording vocals frequently, claiming he was not in the right mood. Osborne had to talk him into the idea, as he learned from working on \"Step On\", Ryder was \"not somebody who is a super-confident vocalist. Doing vocals for Shaun [Ryder] is not an easy thing\". Ryder would subsequently only do vocals when Osborne was in the control room, aside from the occasional visit from Whelan.Spence 2015, p. 231 Factory founder Tony Wilson visited the band, fearing they would have spent the entirety of recording partying instead of working. Upon hearing a version of \"Bob's Yer Uncle\", he exclaimed that the band's next release would be \"one of the great British albums of the age\". The band flew home on 25 August 1990; one-by-one, each member would further work on the songs at Eden Studios, where Rowetta did guest vocals.Spence 2015, p. 232 Recording concluded by September 1990; Oakenfold and Osborne mixed the final tracks with assistant engineer Dave Burnham.", "Shaun Ryder wrote lyrics to the songs while in his apartment in Los Angeles, fuelled by opium.Spence 2015, p. 230 The album opens with \"Kinky Afro\", an ode to fatherhood and Ryder's father Derek.Warburton; Ryder 2011, p. 30 The song's music is partially influenced by Paul Ryder listening to Hot Chocolate, namely their song \"Brother Louie\" (1973). Shaun Ryder took one of its lines for \"Kinky Afro\"; despite comparisons to \"Lady Marmalade\" (1974) by Labelle, Ryder claimed the song's vocal hook was taken from the film Die Hard (1988).Harrison 1991, p. 55 The song was initially called \"Groovy Afro\", but was changed after \"Groovy Train\" (1990) by the Farm was released sometime prior.Verrico 1998, p. 127 \"God's Cop\" is inspired by James Anderton, the chief constable of the Greater Manchester Police, who claimed God was speaking to him.Ryder 2019, p. 45 It opens with a slide guitar part, leading into a delta blues riff that is heard throughout the rest of the track; it is backed by a drum loop of \"Me Myself and I\" (1989) by De La Soul. \"Donovan\", which musically retreads \"Mad Cyril\" from Bummed, was written after the band was listening to Donovan's back catalogue while touring the US. It borrows a lyric from Donovan's \"Sunshine Superman\" (1966).", "Kongos' \"Step On\" is a protest song that deals with white people's appropriation of land in Africa.Spence 2015, p. 197 Happy Mondays' version opens with an Italo house piano, followed by a funk shuffle. Shaun Ryder ad-libbed various lines, such as \"Call the cops\" and \"You're twisting my melon man\".Spence 2015, p. 199 The former was a catchphrase of a Haçienda patron, while the latter was taken from a line of dialogue in a documentary about Steve McQueen.Ryder 2019, p. 39–40 \"Holiday\" incorporates a portion of \"Sweet Jane\" (1973) by the Velvet Underground, as well as \"A Lover's Holiday\" (1980) by Change. Ryder wrote the song about issues he faced when dealing with customs officers. For \"Harmony\", Ryder attempt to get Whelan to sing the track, in the same manner that the Beatles would get their drummer Ringo Starr to sing a song. The song describes being high on high on the rave drug ecstasy.Ryder 2019, p. 57 It lifts a lyric from \"I'd Like to Teach the World to Sing (In Perfect Harmony)\" (1971) by the New Seekers.", "All lyrics by Shaun Ryder, all music by Happy Mondays, except where noted.", "* Shaun Ryder – vocals"]}, {"page": "Rock Profile", "response": ["* Happy Mondays – Bez (Walliams) is portrayed as a professionally trained dancer who went to the Ramhurst School, claiming that he was in the year above Darcey Bussell. Shaun Ryder (Lucas) is portrayed as mumbling, incoherent and an unenthusiastic interviewee."]}, {"page": "Barcelona (Freddie Mercury and Montserrat Caballé album)", "response": ["Russell Watson covers it on his album The Voice with Shaun Ryder."]}, {"page": "Yes Please!", "response": ["Yes Please! is the fourth studio album by British rock band Happy Mondays, released 22 September 1992 through Factory Records. Following the non-album single \"Judge Fudge\", Factory allotted the band a budget of £150,000 for their next album. After settling on producers Chris Frantz and Tina Weymouth, both members of Talking Heads and Tom Tom Club, Happy Mondays decamped to Blue Wave Studio in Saint Philip, Barbados in February 1992. The sessions were plagued by a variety of issues, such as frontman Shaun Ryder developing a crack habit, and dancer Bez breaking his arm three times. With little finished material and a lack of lyrics the band returned to the United Kingdom; Ryder was admitted into a detox centre. Recording continued for two weeks in May 1992 at Comfort's Place Studio in Lingfield, Surrey, where Ryder did his vocals. Yes Please! is a soul funk album, with a bleak sound that earned it a comparison to Unknown Pleasures (1979) by Joy Division.", "Happy Mondays released their third studio album Pills 'n' Thrills and Bellyaches on 5 November 1990.Spence 2015, p. 317 It peaked at number four in the United Kingdom; all three of its singles reached the top 20 in the UK, with \"Step On\" and \"Kinky Afro\" both peaking at number five. Around the album's release, a newspaper article was published, which detailed frontman Shaun Ryder's past experiences with drugs, making his addiction with heroin (and toying with crack) and stint in a detox centre public in the process.Spence 2015, p. 237 A public relations representative from the band's label Factory Records had to issue a statement on Ryder's behalf, denouncing his drug use.Spence 2015, p. 238 The album was promoted with a UK arena tour, a trek to mainland Europe, and a two-month stint in the United States, ending with a variety of headlining shows and festival appearances in August 1991.", "Guitarist Mark Day got married as bassist Paul Ryder's marriage was coming to an end, resulting in him and Shaun Ryder doing more heroin.Spence 2015, p. 264 Ryder increased his crack intake while drummer Gary Whelan began suffering from depression and turned to alcohol.Spence 2015, p. 265 Rehearsals bore no new ideas; a recording session with Paul Oakenfold and Steve Osborne, producers of Pills 'n' Thrills and Bellyaches, resulted in \"Judge Fudge\" and the unfinished \"Baby Big Head\".Spence 2015, pp. 266, 267 While the idea of a new album was suggested, both producers felt that timing was not right, saying it would descend into chaos due to the state of the band.Spence 2015, p. 268 \"Judge Fudge\" was released as a non-album single in November 1991, charting within the UK top 30.Spence 2015, p. 319 Despite Pills 'n' Thrills and Bellyaches being a commercial success, Factory Records was struggling financially.Middles 1997, p. 140", "During a meeting with their business expenses manager, McGough told the rest of the band that Shaun Ryder (who was absent) had sacked Day, to much surprise. Ryder expected to replace him with Smiths guitarist and Electronic collaborator Johnny Marr. McGough said Day was \"unhappy and Shaun [Ryder] felt culturally he wasn't on board. [... Ryder] made it an issue and for half an hour one afternoon Johnny Marr was in [Happy Mondays]\". Day had been fired over the phone abruptly; Paul Ryder and Whelan visited Day. Day was confused by the idea, thinking the band wanted to kick him out, until they discovered he simply need some time off.Spence 2015, p. 278", "On 17 January 1992, the day after Day had re-joined the band, they flew from Manchester to The Bahamas.Sawyer 1992, p. 41 Factory hoped the remote location would help sedate Shaun Ryder's heroin addiction; he had smuggled methadone (intended as a substitute for heroin) into the island, which he consumed immediately upon arrival.Middles 1997, pp. 143, 144Spence 2015, p. 279 Day, still affected from the sacking and worried about the workload ahead, had a mental breakdown. Whelan and Paul Ryder had been drinking throughout the 13-hour flight to the island, and continued when the band took up residence at Sam Lord's Castle. They were asked to leave the accommodation when they found out keyboardist Paul Davis assaulted the bar band.", "They then travelled to Blue Wave Studio in Saint Philip, Barbados, which was owned by Eddy Grant. The studio itself was housed in a shack in the middle of a sugar plantation, as well as being near a jungle.Spence 2015, p. 280 It was on the driveway of Grant's estate, who was away during this time. The studio's manager heard unfavourable stories about the band, and had to be reassured by Frantz and Weymouth that the pair would handle everything. Frantz, Weymouth and the rest of the band had set up at the studio; when Shaun Ryder showed up, he was unfit to do any work. When sessions were underway, Mark Roula handled recording with assistance from Bryon Europe. Assembled in a live manner, the other members ran through the six partially-completed tracks they had for Frantz and Weymouth. The pair recorded these rehearsals, with the intention of going back to them after writing more material.Sawyer 1992, p. 42", "Spurred on by the pair's enthusiasm, Day, Davis, Paul Ryder and Whelan started having fun, recalling their early rehearsals in Manchester. Day had been influenced by Eastern music, resulting in off-kilter guitar parts. Ryder and Whelan locked into grooves, with the encouragement of Weymouth. The majority of recording was plagued with a variety of issues with the band members.Middles 1997, p. 144 Happy Mondays discovered that the island was full of cheap crack available from local drug dealers, who knew the band were eager to purchase any drugs from them. Shaun Ryder ended up spending 20 hours each day in the toilet smoking crack, while the others were waiting to record. Dancer Bez broke his arm three times: once when crashing a car, the second time in a boat accident, and the third when his girlfriend sat on it.Middles 1997, pp. 144–5", "Paul Ryder began having withdrawal symptoms from the lack of heroin; as both Ryders became ill, McGough had a doctor prescribe them largactil. It resulted in neither of them having an energy left to record anything, especially Shaun Ryder, who was now unable to sing.Spence 2015, p. 281 Day and Whelan relaxed with their families on the island as they had finished their parts for the album, renting houses by the beachside.Spence 2015, p. 282 Frantz and Weymouth attempted to keep recording going, the difficulties with the band members eventually saw the pairs enthusiasm dissipate.Middles 1997, p. 146 The pair felt there was the foundation of ten songs recorded, waiting for Shaun Ryder's input. Amid growing frustration from the others, Ryder had yet to write any lyrics for the new songs.Middles 1997, p. 146–7 They spent a few days trying to coax lyrical inspiration out of Ryder. The constant crack use saw him inflicted with a throat infection, rending the chance of recording vocals impossible. ", "Ryder was admitted to the Charter Clinic detox centre in Chelsea, London for a period of six weeks, with McGough supervising him. When he left, McGough decided to have Ryder avoid Manchester, subsequently booking them an apartment in Newquay for two weeks. While Ryder was in a healthier state, he still struggled with writing new lyrics.Middles 1997, pp. 148, 150 Ryder returned home for a week before going to Comfort's Place Studio in Lingfield, Surrey to do vocals.Sawyer 1992, p. 46 The sessions re-started in May 1992, with assistance from Ray Mascarenas, for a period of two weeks. While Shaun Ryder was doing vocals, the other members kept themselves occupied: Paul Ryder and Astrella Donovan followed the latter's father on tour; Whelan spent time at a gym; Day looked after his newly-born child; Davis moved house; and Bez tended to his broken arm. Trying to aid in the writing, Frantz and Weymouth would have Shaun Ryder do things such as dancing on the spot or consult the I Ching for lyrics.Middles 1997, p. 148 They also employed William S. Burroughs' cut-up technique at Weymouth's suggestion. Ryder found himself struggling to enjoy the music the band had done, regretting that he did not take more of an interest when they were recording it.Spence 2015, p. 285", "As recording finished, McGough set about acquiring the band money. On the verge of receivership, Factory Records entered into a deal with London Recordings owner PolyGram, who would assume ownership of Factory.Middles 1997, pp. 151, 153 Since Factory was occupied, McGough managed to gain funds from the band's music publishing royalties, in the area of £250,000. It arrived in staggered payments of £45,000. As Ryder enacted a legal clause allowing him £20,000 of that sum, Day, Davis, Paul Ryder and Whelan received £5,000 each. The situation repeated twice later in the year; Day said they were \"all pissed off about the money\". Around this time, Shaun Ryder had restarted his alcohol and heroin habits.Spence 2015, p. 287", "\"Stinkin Thinkin\" was picked by both Ryders as the lead single from the album; released on 31 August 1992, it included \"Baby Big Head\" and Stephen Hague and Boy's Own remixes of \"Stinkin Thinkin\" as its B-sides. The music video for \"Stinkin Thinkin\", shot at Shepherd's Bush's shopping centre in London, placed a focus on Bez and Shaun Ryder has the director had a disliking for the rest of the band.Verrico 1998, p. 164 They performed the song on Top of the Pops; Ryder sung his vocals live and forgot the words partway through, prompting the need to read off a sheet.Spence 2015, p. 287 Yes Please! was released on 22 September 1992. In preparation for an upcoming tour, McGough had the band set up in a rehearsal space in Ancoats.", "Shaun Ryder was absent from  the practices, while Paul Ryder was suffering from an heroin addiction, and Day, Davis and Whelan were unsure about the future of the band.Spence 2015, p. 290 They embarked on a stint of the UK in October 1992; several of the shows sold out in advance, with a handful more being added as a result.Spence 2015, p. 289 They then played a one-off show in Japan with Big Audio Dynamite. \"Sunshine and Love\" was released as the second single from the album on 9 November 1992.Spence 2015, p. 295 with a cover of \"Stayin' Alive\" (1977) by Bee Gees and remixes of \"Sunshine and Love\" and \"24 Hour Party People\" as its B-sides. Wilson had corralled about £1,000 to make a music video for \"Sunshine and Love\"; Ryder refused to leave his band for the filming.Warburton; Ryder 2011, p. 41", "Author John Warburton in his book Hallelujah!: The Extraordinary Story of Shaun Ryder and Happy Mondays said Yes Please! was \"slammed by the critics as anodyne, uninspired and pedestrian\", while author Lisa Verrico in her book High Life 'N' Low Down Dirty: The Thrills and Spills of Shaun Ryder wrote that \"[e]ven the weekly press [...] had to concede that ...Yes Please! had its highlights\".Warburton; Ryder 2011, p. 38 The staff at Q said the band were \"back on the case\" and \"against all odds, they've pulled it off again\". The staff at Melody Maker called it \"actually pretty good. At best, we're talking about the oceanic funk of late, late Can; at worst, a typically tropical soundtrack to the Mondays' expensive vacation\". The NME said that despite the band's attitude over the preceding two years, \"they're back again, unflinching and honest and sick after their own shaggy fashion\".Verrico 1998, p. 165", "For Trouser Press, Doug Brod and Michael Krugman said that due to the rift between Ryder and his bandmates, the album \"often feels like a document of a band at odds with itself — the sprightly dance tracks clash with Shaun’s deeply bent mindfuck wordiness\". Doug Iverson of The Blade saw the album as a regression, with the band's energy being compromised by Frantz and Weymouth.Iverson 1992, p. B3 Spin Al Weisel, on the other hand, saw it as a \"kinder, gentler\" release, aided by the band and Frantz and Weymouth sharing a \"similar philosophy: 'Who needs to think when your feet just go?Weisel 1992, p. 119 Cardew said it was \"steeped in age and regret, haunted by a 30-year-old Shaun Ryder who surveys the wreckage of his life and doesn’t like what he sees\". In a review for Select, journalist Andrew Harrison saw as \"so disappointing\", describing it as an \"unwieldy collision of beach-barbie niceness with the products of Shaun Ryder's depraved extracurricular activities\".", "* Shaun Ryder – vocals"]}, {"page": "Spiders (album)", "response": ["Spiders was described by critics as disregarding genre, and displays influence from a large array of genres and styles, such as hip hop, \"brooding\" Eastern European folk music, funk, techno, indie dance and Hawaiian xylophone music. Parts of the album are said to echo British bands such as Squeeze, the Kinks, Madness and Buzzcocks as well as crooner Frank Sinatra and The Walker Brothers. According to Westnet, \"many of the tracks offer two or three completely distinct styles within four minutes of pop bliss.\" They described the album as \"why full albums were invented, instead of singles\" and said \"the only common thread\" between the tracks is their alternative pop sensibility. The magazine reckoned the closest comparison for Spiders would be the \"psychedelic dance beats of Shaun Ryder's groups, Happy Mondays and Black Grape\"."]}, {"page": "Young Maylay", "response": ["In the game, Maylay starred alongside celebrities such as actors Samuel L. Jackson, James Woods, Peter Fonda, Clifton Powell, Faizon Love, Big Boy, David Cross, Andy Dick, Chris Penn, Danny Dyer, Frank Vincent, Sara Tanaka, Charlie Murphy and William Fichtner, rappers Ice-T, MC Eiht, Chuck D, The Game, Kid Frost and Yo-Yo and musicians George Clinton, Axl Rose and Shaun Ryder. When asked if he would consider reprising the role of CJ in any future Grand Theft Auto titles if given the opportunity, Maylay stated that he would never play the role of CJ again due to conflicts with Rockstar Games."]}, {"page": "Juke Box Jury", "response": ["* 7 October 1990 – Anthony Wilson, Rachael Lindsay, Shaun Ryder, Barbara Windsor"]}, {"page": "List of UK Singles Chart number ones of the 2000s", "response": ["| Gorillaz featuring Shaun Ryder||\"Dare\""]}, {"page": "Max and Paddy's Road to Nowhere", "response": ["* Episode two: Bez and Shaun Ryder"]}, {"page": "List of people from Manchester", "response": ["* Shaun Ryder vocalist and songwriter with the Happy MondaysVideo: Shaun Ryder - The mild man of rock ‘n’ roll Manchester Evening News, 26 January 2011 who became famous in the Madchester eraMadchester remembered: 'There was amazing creative energy at the time' The Observer, 21 April 2012"]}, {"page": "Russell Watson", "response": ["Watson was now managed by Perry Hughes, who was pivotal in the success of Watson's career during these years. Watson's début album, The Voice, followed in May 2001. A mixture of operatic arias and covers of pop songs, it topped the UK classical chart and eventually reached number five in the UK Albums Chart. When it was released in the United States, it took the number one spot, the first time a British artist had held both the US and UK classical number one. The album contained perhaps Watson's most unusual collaboration to date, with former Happy Mondays singer Shaun Ryder who lent his vocals to the Freddie Mercury and Montserrat Caballé song \"Barcelona\". It also featured a duet with Faye Tozer of pop group Steps on \"Someone Like You\". Cleo later duetted with Russell again, on his third album Reprise, on \"The Best That Love Can Be\"."]}, {"page": "Demon Days", "response": ["Demon Days is the second studio album by British virtual band Gorillaz. It was first released on 11 May 2005 in Japan and on 23 May 2005 in the United Kingdom by Parlophone and in the United States by Virgin Records. Produced by the band, Danger Mouse, Jason Cox, and James Dring, the album features contributions from De La Soul, Neneh Cherry, Martina Topley-Bird, Roots Manuva, MF Doom, Ike Turner, Bootie Brown of the Pharcyde, Shaun Ryder, and Dennis Hopper. As with the band's eponymous 2001 debut, the release of Demon Days and its respective live performances were both accompanied by various multimedia, including interactive features on the Gorillaz website, a total of four animated music videos, and animatics for select videos. Almost all visuals associated with the album were designed by Gorillaz co-creator Jamie Hewlett, under his design company Zombie Flesh Eaters.", "As on Gorillaz there are plenty of guest collaborators including rappers De La Soul, Bootie Brown from the Pharcyde, and MF Doom along with Ike Turner on keyboards, the singer Shaun Ryder from Happy Mondays and the actor and director Dennis Hopper, who narrates a parable (Fire Coming Out of the Monkey's Head) about innocence, greed and retribution set to a droll reggae bounce. That song leads into a stretch of ethereal vocal harmonies in a clear homage to the Beach Boys. Albarn said he couldn't make the vocal parts sound right until he had a minor revelation. \"If you've ever seen the Beach Boys in footage, they're all smiling, desperately keeping the upbeat Beach Boy thing alive, while Brian Wilson is just absolutely glum as hell. So I did three harmonies smiling with my face. And then one just being really miserable, which was Brian. Now it's got that vibe.\"", "Regarding the song \"Dare\" and the collaboration with Shaun Ryder, Albarn also said: \"I love Shaun Ryder. During the whole Oasis thing, he and Bernard Sumner were the only two who cared about what I was going through. Being constantly taken the piss out of by Noel & Liam (Gallagher). How can you fight when you've got the tabloids and a working class attitude on your back? You're fucked. But Shaun was really sweet to me and made me feel a whole lot better about it. Because I did get quite upset about it, so was selecting Shaun karma in action, then? Yeah, definitely\". The song's title is purported to have come about due to Ryder's thick Mancunian accent he was unable to say the phrase \"It's There\", which was the song's original title, so it was change simply to \"Dare\". Roses Gabor takes over the role of \"Noodle\" from Miho Hatori, who provided the vocals for her on the first album. Albarn provides backing vocals; however, to blend his vocals with Gabor's, his voice was toned down to be slightly covered up. Albarn's full vocalization can be heard on the D-Sides remix album. D-Sides features a demo version of \"Dare\" entitled \"People\". This version contains the same background beat while lacking the majority of the keyboards and effects in the final recording. Unlike the final version, it is completely sung by Damon Albarn and features an Omnichord breakdown.", "Demon Days was first mentioned in articles detailing the reopening of Gorillaz' website in early December 2004. Initially, a March or April 2005 release date was announced, but this date was later pushed back. In an article for Q in February 2005 it was reported that the album was to be titled We Are Happy Landfill. Another early title was reported to be Reject False Icons, which is also the title of Gorillaz' culture jamming project. In January 2005 a promo for the song \"Dirty Harry\" was released as a white label 12\", and an exclusive video was released online entitled \"Rock It\". It was later reported that the track would not appear on the album, although it later appeared on D-Sides, a collection of remixes, rare songs and B-sides released in November 2007. Demon Days' lead single \"Feel Good Inc.\" became Gorillaz' biggest hit at the time, while the album's second single, \"Dare\" featuring Shaun Ryder, was a big hit as well and gave the band their first No. 1 single in the UK. Since its release, Demon Days has been certified double platinum in the US and 6× platinum in the UK. It was also certified Gold in Japan.", "* Shaun Ryder – vocals "]}, {"page": "X (disambiguation)", "response": ["* Shaun Ryder (born 1962), English musician and singer–songwriter, sometimes uses the pseudonym X"]}, {"page": "XFM Manchester", "response": ["Before its launch 20 February 2006, XFM Manchester began occasional technical test transmissions consisting of a playlist of songs chosen to appeal to its audience. XFM Manchester was officially launched at 8 am on 15 March 2006. A collage of Manchester related clips was played, and I Am the Resurrection by The Stone Roses, and  Song 2 by Blur. The first presenter on air was Paul Tonkinson with guest Shaun Ryder of the Happy Mondays. Launch events were held all day across Manchester, including a world record attempt in Albert Square hosted by Bez to shake the most number of maracas at any one time."]}, {"page": "Jenny Eclair", "response": ["On 18 November 2010, she joined the 2010 series of I'm a Celebrity... Get Me Out of Here!, finishing in third place behind Stacey Solomon and Shaun Ryder."]}, {"page": "TFI Friday", "response": ["The show attracted controversy when Happy Mondays frontman Shaun Ryder appeared on the second episode of the first series, slipped out the word \"fuck\" during his interview on the show. A week later, Ewan McGregor also slipped out the word \"fuck\" on the show, when ranting about the Conservative government of the time. A month later, Shaun Ryder was invited back on the show to do a Stars in Their Eyes skit. Ryder performed (as Johnny Rotten) the Sex Pistols' \"Pretty Vacant\". The section was transmitted live, as it was not an interview. Ryder shouted \"fuck\" several times. Subsequently, the show was forced to be pre-recorded in later editions and Ryder has been barred from appearing live on any Channel 4 programme – he is the only person listed by name in the Channel 4 transmission guidebook. Despite this, he reappeared for the live 20th Anniversary Special in June 2015."]}, {"page": "Dare (song)", "response": ["\"Dare\" (stylised as \"DARE\" and \" (DARE)\") is a song by British virtual band Gorillaz, taken as the second single from their second studio album, Demon Days. The track features Happy Mondays and Black Grape frontman Shaun Ryder and is also sung by Rosie Wilson (also known as Roses Gabor) with backing vocals from Damon Albarn. It peaked at number one on the UK Singles Chart in September 2005, becoming the band's only UK number one. \"Dare\" additionally reached the top 10 in the Commonwealth of Independent States (CIS), Ireland, New Zealand, and Scotland.", "Chris Evans stated at the 2006 Brit Awards that the song was originally to have been called \"It's There\", but was changed due to Shaun Ryder's strong Mancunian accent making it sound like he was saying \"It's dare.\" In a 2017 interview with Chris Moyles on Radio X Ryder confirmed his version of events, that it was him requesting a change to his headphone level, \"it's going up, it's going up, it's there!\".", "The music video for \"Dare\" included an appearance by Shaun Ryder (of Happy Mondays and Black Grape fame, at the request of Damon Albarn) as a giant disembodied head kept alive by machinery in Noodle's wardrobe. In a departure for the band, the song is mostly performed in the video by Noodle, with 2-D, Russel, and Murdoc only appearing in short cameos in the video; 2-D is seen listening into Noodle's room by pressing his ear to the floor, Russel is shown seated on a toilet reading a newspaper directly below Noodle's room and Murdoc appears at the end of the video lying in bed with Shaun Ryder, who wakes up, apparently having dreamt up the entire sequence of the video. A voice beside him growls, \"go back to sleep, honey,\" revealing the voice to belong to Murdoc, after which it is further revealed to be another nightmare. That time, it was actually dreamt by Murdoc, who also wakes up bolt upright in his own bed gasping and panting.", "This video calls back to classic horror movies. In the very beginning of the video we see Gorillaz' 'reject false icons' statue, which one may recognize as Pazuzu, the figurine from The Exorcist and son of the devil. Crows are flying around the building, in a tribute to Alfred Hitchcock's The Birds. Shaun Ryder is depicted as a Frankenstein-like monster who is brought to life as the music begins. Amongst the contraptions that are part of the life support system appear to be two Atari joysticks and a Speak & Spell from the early 1980s. Ryder's head being kept alive is a reference to the movie The Brain That Wouldn't Die. The tube attached to Ryder's cheek switches from side to side as a tribute to the goofs commonly made in early horror movies. When we see Russel sitting on the toilet, he is holding a newspaper with a headline that reads CANNIBAL MASSAKREN, the Danish title of Cannibal Holocaust. The zoom on Noodle's eye at the end of the video is taken directly from Ringu and its American remake, The Ring.", "* Shaun Ryder – additional vocals"]}, {"page": "1996 in British music", "response": ["* 22 March - Black Grape perform a cover of \"Pretty Vacant\" by The Sex Pistols on TFI Friday on Channel 4.  During the performance, Shaun Ryder uses several f-words and the incident results in Ryder being banned from live broadcasting and TFI Friday being recorded instead of being broadcast live."]}, {"page": "The Wheeltappers and Shunters Social Club", "response": ["A clip from the show can be seen in the film 24 Hour Party People, where Shaun Ryder, in his formative years, is seen watching Karl Denver perform \"The Lion Sleeps Tonight\" (\"Wimoweh\")."]}, {"page": "The Boys Are Back in Town", "response": ["A cover version of The Boys Are Back in Town became the last Top 40 single for the Madchester rock band Happy Mondays (featuring vocalist Shaun Ryder and dancer Bez), when it peaked at number 24 in the UK Singles Chart in May 1999. According to the band they did not think that their version was a straight cover, but a record “inspired by the Phil Lynott song, but doesn’t sound a thing like the original”."]}, {"page": "Don Letts", "response": ["|The Heads with Shaun Ryder"]}, {"page": "Pete Mitchell (broadcaster)", "response": ["Mitchell presented his first Xfm (now Radio X) breakfast show on 15 June 2009 and his alternative radio show Razor Cuts on 21 June 2009. His first Razor Cuts guest was former New Order member bassist Peter Hook, who spoke candidly about the break-up of the legendary band. Guitarist Johnny Marr revealed that he had been offered $50 million to reform The Smiths on the show recently. Other guests included Jarvis Cocker, Shaun Ryder, Paul Weller, Bernard Sumner, Mike Joyce, Delphic, Ian McCulloch, Dave Grohl, Jack White and Courtney Love."]}, {"page": "It's Great When You're Straight...Yeah", "response": ["It's Great When You're Straight...Yeah is the debut studio album by British rock band Black Grape, released on 7 August 1995 through Radioactive Records. Following the break-up of Happy Mondays, frontman Shaun Ryder formed Black Grape with vocalist Paul \"Kermit\" Leveridge and dancer Bez. They were put in contact with management company Nicholl and Dime, who secured the band a recording contract with Radioactive Records. After demos and the band finalizing their line-up, Ryder met with producers Stephen Lironi and Danny Saber. Black Grape recorded their debut album in late 1994 and early 1995 at Rockfield Studios in Wales, Chapel Studios in Lincolnshire and Boundary Row in London. It's Great When You're Straight...Yeah is a dance-pop and pop funk album, with its title meaning being sober from drugs.", "Happy Mondays released their fourth studio album Yes Please! in September 1992. The band's label Factory Records went into administration two months later.Spence 2015, p. 294 Their manager had secured a contract with EMI; in February 1993, the band met a representative from the label.Spence 2015, p. 299 Frontman Shaun Ryder bailed on an interview with the rep; after a band meeting, where they realised it would be difficult to revive interest with the label, they decided to break up.Spence 2015, p. 300Middles 1997, p. 157 Following this, Ryder lived in Cheshire, left his long-term girlfriend, and started to date Donovan's daughter Oriole Leitch; dancer Mark \"Bez\" Berry became a local celebrity around Manchester.Middles 1997, pp. 158, 160, 161 Despite Ryder saying he left the music industry, he guested on a Intastella B-side.Middles 1997, pp. 161, 162Warburton; Ryder 2011, p. 42 Ryder formed a band with his brother, bassist Paul Ryder, who would leave shortly after to start a band with his girlfriend.Spence 2015, p. 305 Bez and Ruthless Rap Assassins member Paul \"Kermit\" Leveridge then joined Shaun Ryder's act, which was now named Black Grape.Middles 1997, p. 168", "Musically, the sound of It's Great When You're Straight...Yeah has been described as dance-pop and pop funk.Middles 1997, p. 173 Author Lisa Verrico in her book High Life 'N' Low Down Dirty: The Thrills and Spills of Shaun Ryder wrote that with its \"funky basslines, stuttering hip hop beats, odd noises, psychedelic effects and jubilant brass section,\" she dubbed it the \"ultimate party album\". According to Ryder, the album title refers sarcastically to being free of mood-altering substances, despite the band frequently consuming drugs during the time period.Ryder 2019, p. 71 Ryder compared the writing process to that of Happy Mondays' third studio album Pills 'n' Thrills and Bellyaches (1990), which was partially written in the studio.Ryder 2019, p. 65 Him and Kermit would come up lyrics by vocally sparring with each other; any lines they thought would work in a song were kept.Ryder 2019, p. 68 In addition to the band, other musicians contributed to the recordings: Saber with guitars, bass, keyboards, Hammond organ and programming; Anthony Guarderas with bass; Lironi keyboards, Hammond organ and programming; Dahni Birihani with sitar; and Michael Scherchen with programming.", "Writing credits per booklet. All recordings produced by Danny Saber, Stephen Lironi, Shaun Ryder.", "* Shaun Ryder – vocals", "* Shaun Ryder – producer"]}, {"page": "Manchester v Cancer", "response": ["As part of the show's finale, both Marr and Rourke played together alongside New Order and Doves on a mass rendition of Happy Mondays' song Wrote For Luck, lyrics being sung by Mondays' frontman Shaun Ryder."]}, {"page": "Demon Days Live (film)", "response": ["Nearly all of the album's performers were available to participate in the event, including Neneh Cherry, Bootie Brown, Shaun Ryder and Ike Turner. MF Doom and Dennis Hopper appeared through video and audio narration, respectively. Local Manchester choirs were hired for the performances.", "#\"Dare\" (featuring Roses Gabor and Shaun Ryder) – 4:38", "* Shaun Ryder – Guest vocals on \"Dare\""]}, {"page": "Northern Uproar", "response": ["On 30 June 2011, Northern Uproar performed at the AAA Shaun Ryder + friends Exhibition by the Manchester-based photographer Karin Albinsson. The band were featured in the exhibition alongside Shaun Ryder, Noel Gallagher, David Bowie, Howard Marks and others. On 8 July 2011, Northern Uproar played to a sold out Sound Control, Manchester as special guests of Rochdale-based band Proud Mary."]}, {"page": "Triple J Hottest 100, 2005", "response": ["| 5 || DARE || Gorillaz featuring Shaun Ryder || "]}]}}