{"wiki_id": "http://www.wikidata.org/entity/Q3381082", "itemLabel": "Phill Jones", "itemDescription": "New Zealand basketball player", "wikipedia_url": "https://en.wikipedia.org/wiki/Phill_Jones", "wikipedia_page": {"main": "Phillip Charles George \"Phill\" Jones (born 25 January 1974) is a New Zealand former professional basketball player who is best known for his time spent with the Nelson Giants in the New Zealand National Basketball League (NZNBL). The two-time Olympian has scored more points in the New Zealand NBL than any other Kiwi player and is second overall in league scoring history. In 2004, he ranked second among all points scorers at the Athens Olympics. In 2016, he became the first player in New Zealand NBL history to reach 400 games.", "link_mentions": [{"page": "Nelson College", "response": ["* Phill Jones, basketballer"]}, {"page": "Reefton", "response": ["*Phill Jones – basketball player, grew up in Reefton"]}, {"page": "New Zealand men's national basketball team", "response": ["* Phill Jones – Former Cairns Taipans captain", "Sean Marks, Pero Cameron, Mark Dickel, Phill Jones, Kirk Penney, Robert Hickey, Nenad Vučinić, Tony Rampton, Paul Henare, Brad Riley, Ralph Lattimore, Peter Pokai (Head Coach: Keith Mair)", "Sean Marks, Pero Cameron, Mark Dickel, Phill Jones, Kirk Penney, Robert Hickey, Dillon Boucher, Damon Rampton, Ed Book, Paul Henare, Paora Winitana, Judd Flavell (Head Coach: Tab Baldwin)", "Sean Marks, Mark Dickel, Phill Jones, Pero Cameron, Kirk Penney, Dillon Boucher, Ed Book, Paul Henare, Paora Winitana, Tony Rampton, Aaron Olson, Craig Bradshaw (Head Coach: Tab Baldwin)", "Kirk Penney, Pero Cameron, Phill Jones, Mark Dickel, Casey Frank, Paul Henare, Dillon Boucher, Paora Winitana, Tony Rampton, Craig Bradshaw, Aaron Olson, Mika Vukona (Head Coach: Tab Baldwin)", "Thomas Abercrombie, Benny Anthony, Craig Bradshaw, Pero Cameron, Michael Fitchett, Casey Frank, Phill Jones, Jeremy Kench, Kirk Penney, Alex Pledger, Lindsay Tait, Mika Vukona (Head Coach: Nenad Vučinić)"]}, {"page": "New Zealand at the 2000 Summer Olympics", "response": [":* Phill Jones"]}, {"page": "January 1974", "response": ["**Phill Jones, New Zealand Olympic and professional basketball player; in Christchurch, Canterbury, New Zealand"]}, {"page": "NBL Best Sixth Man Award", "response": ["| Phill Jones"]}, {"page": "Cairns Taipans", "response": ["*  Phill Jones"]}]}}