{"wiki_id": "http://www.wikidata.org/entity/Q3398651", "itemLabel": "Ronnie Hazlehurst", "itemDescription": "English composer (1928-2007)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ronnie_Hazlehurst", "wikipedia_page": {"main": "Ronald Hazlehurst (13 March 1928 – 1 October 2007) was an English composer and conductor who, having joined the BBC in 1961, became its Light Entertainment Musical Director.\nHazlehurst composed the theme tunes for many well-known British sitcoms and gameshows of the 1970s and the 1980s, including Yes Minister, Are You Being Served?, I Didn't Know You Cared and Last of the Summer Wine.", "link_mentions": [{"page": "History of Wikipedia", "response": ["* In October 2007, in their obituaries of recently deceased TV theme composer Ronnie Hazlehurst, many British media organisations reported that he had co-written the S Club 7 song \"Reach\". In fact, he hadn't, and it was discovered that this information had been sourced from a hoax edit to Hazlehurst's Wikipedia article.\"Braindead obituarists hoaxed by Wikipedia\" . Andrew Orlowski. The Register. 3 October 2007."]}, {"page": "October 1", "response": ["*2007 – Ronnie Hazlehurst, English conductor and composer (b. 1928)"]}, {"page": "British sitcom", "response": ["Only Fools and Horses, (1976–1985, 2001–2003) is one of the most successful British sitcoms of all time and stars David Jason of Roy Clarke's Open All Hours with comedy actor Ronnie Barker) began in 1981 and ran for 64 episodes, with specials, until 2003. It was the most durable of several series written by John Sullivan. The 1996 episode \"Time on Our Hands\" (originally billed as the last episode) holds the record for the highest UK audience for a sitcom episode, attracting 24.3 million viewers. Critically and popularly acclaimed, the series received numerous awards, including recognition from BAFTA, the National Television Awards and the Royal Television Society, as well as winning individual accolades for both Sullivan and Jason. It was voted Britain's Best Sitcom in a 2004 BBC poll. In a 2001 Channel 4 poll Del Boy was ranked fourth on their list of the 100 Greatest TV Characters. The series influenced British culture, contributing several words and phrases to the English language.  It was named one of the top 20 cult television programmes of all-time by TV critic Jeff Evans. Evans spoke of: \"[shows] such as Only Fools and Horses, which gets tremendous viewing figures but does inspire conventions of fans who meet in pubs called the Nag's Head and wander round dressed as their favourite characters.\" The theme music is by Ronnie Hazlehurst (1981) and John Sullivan (1982–2003). Only Fools and Horses, came top in a research and analysis by a team of scientists led by  Dr Helen Pilcher, a molecular neurobiologist and stand-up comedian with a speciality in scientific humour.", "Major supporting roles were played by Angela Thorne as Audrey's friend Marjory, and Daphne Heard as Mrs Polouvicka, Richard's mother. Other members of the cast included Alan David, John Rudling, Michael Bilton, Gerald Sim, Michael Cochrane, and Georgie Glen. The music was written by Ronnie Hazlehurst.", "Lynn and Jay explained \"After we wrote the episode, we would show it to some secret sources, always including somebody who was an expert on the subject in question. They would usually give us extra information which, because it was true, was usually funnier than anything we might have thought up.\" In a 2004 BBC programme paying tribute to the series, it was revealed that Jay and Lynn had drawn on information provided by two insiders from the governments of Harold Wilson and James Callaghan, namely Marcia Falkender and Bernard Donoughue.Jonathan Lynn Comedy Rules: From the Cambridge Footlights to Yes, Prime Minister. Faber & Faber, 18 August 2011  The theme music was composed by Ronnie Hazlehurst. The series was the favourite television programme of the then Prime Minister, Margaret Thatcher. In  2012, just two years in office, Prime Minister David Cameron talking about the series admitted that  \"I can tell you, as prime minister, it is true to life.\"", "Goodbye, Mr Kent (1982) was written by  Peter Vincent and Peter Robinson, and 7 episodes starring Richard Briers and Hannah Gordon were produced for the BBC by Gareth Gwenlan, with music by Ronnie Hazlehurst.", "Ronnie Hazlehurst was the most prolific of composers of music for sitcom and many comedy productions, game shows and other programmes. He joined the BBC in 1961, and became a staff arranger; his early works included the incidental music for The Likely Lads, and The Liver Birds. In 1968 he became the Light Entertainment Musical Director and, during his tenure, he composed the theme tunes of many sitcoms, including Are You Being Served?; Some Mothers Do 'Ave 'Em; Last of the Summer Wine (where he also wrote all the instrumental music for the show); I Didn't Know You Cared; The Fall and Rise of Reginald Perrin; To the Manor Born; Yes, Minister; Yes, Prime Minister; Just Good Friends and Three Up, Two Down. He also arranged the themes for Butterflies, Sorry!, and the first series of Only Fools and Horses.", "West Yorkshire, whose theme tune for The Good Life is among his memorable credits.  He was a successful light entertainment composer and musical director including his  arrangements for  comedienne Beryl Reid's 1968-67  Beryl Reid Says Good Evening. He collaborated with many stars including Judy Garland, Pearl Bailey, Sammy Davis Jr., Vic Damone and Bruce Forsyth.   Rhodes was often referred to as \"the musicians’ musician\". He counted musicians such as Ronnie Hazlehurst, Monty Norman and Phil Phillips among his friends.  In 1958 he scored the theme  for  Dr No, the first James Bond film."]}, {"page": "Last of the Summer Wine", "response": ["Composer and conductor Ronnie Hazlehurst, who also produced themes for such series as Are You Being Served?, Yes Minister, and Only Fools and Horses, created the theme for the show. The BBC initially disliked Hazlehurst's theme, feeling it was not proper for a comedy programme to have such mellow music. He was asked to play the music faster for more comedic effect but eventually his original slower version was accepted. A jauntier, upbeat version was played by a brass band in the episode \"Full Steam Behind\".", "A spin-off prequel show, First of the Summer Wine, premiered on BBC1 in 1988. The new programme was written by Roy Clarke and used different actors to follow the activities of the principal characters from Last of the Summer Wine in the months leading up to World War II. Unlike its mother show, First of the Summer Wine was not filmed in Holmfirth. Period music was used instead of Ronnie Hazlehurst's score to create a more World War II era atmosphere. New supporting characters were added to those from Last of the Summer Wine. Peter Sallis and Jonathan Linsley were the only actors from the original series to appear in the spin-off: Sallis played the father of his own character from the original show and Linsley appeared during the second series as a different character.", "In 1993, the Summer Wine Appreciation Society asked their members for their favourite musical themes from Last of the Summer Wine. Ronnie Hazlehurst used the resulting list for an independently released CD collection titled Last of the Summer Wine: Original Music from the TV Series. BBC Radio released audio-only versions of episodes starting in 1995. Peter Sallis provided narration to compensate for the loss of the televised visual elements. All twelve audio episodes were released in CD format."]}, {"page": "Yes Minister", "response": ["The theme music was composed by Ronnie Hazlehurst and is largely based on the Westminster Quarters: the chimes of Big Ben. When asked in an interview about its Westminster influence, Hazlehurst replied, \"That's all it is. It's the easiest thing I've ever done.\""]}, {"page": "Are You Being Served?", "response": ["The theme song, written by the show's co-writer David Croft and composer Ronnie Hazlehurst, consists of a lift girl (whose voice was provided by Stephanie Gathercole) announcing each floor over the musique concrète sounds of a cash register (which effectively serves as the only percussion instrument) and a simple musical accompaniment."]}, {"page": "Some Mothers Do 'Ave 'Em", "response": ["The theme tune by Ronnie Hazlehurst features two piccolos spelling out the title in Morse code, excluding the apostrophes."]}, {"page": "1928 in music", "response": ["*March 13 – Ronnie Hazlehurst, conductor and composer (died 2007)"]}, {"page": "Eurovision Song Contest 1992", "response": ["* Ronnie Hazlehurst"]}, {"page": "Eurovision Song Contest 1991", "response": ["* Ronnie Hazlehurst"]}, {"page": "Eurovision Song Contest 1989", "response": ["* Ronnie Hazlehurst"]}, {"page": "Eurovision Song Contest 1987", "response": ["* Ronnie Hazlehurst"]}, {"page": "Eurovision Song Contest 1988", "response": ["* Ronnie Hazlehurst"]}, {"page": "Eurovision Song Contest 1982", "response": ["* Ronnie Hazlehurst"]}, {"page": "Eurovision Song Contest 1977", "response": ["The British conductor Ronnie Hazlehurst used an umbrella and wore a bowler hat during the UK entry.", "* Ronnie Hazlehurst", "* Ronnie Hazlehurst"]}, {"page": "Only Fools and Horses", "response": ["Only Fools and Horses has separate theme songs for the opening and closing credits, \"Only Fools and Horses\" and \"Hooky Street\", respectively. The original theme tune was produced by Ronnie Hazlehurst and recorded on 6 August 1981 at Lime Grove Studios. Alf Bigden, Paul Westwood, Don Hunt, John Dean, Judd Proctor, Eddie Mordue, and Rex Morris were hired to play the music. The tune was changed after the first series, and the new one was written by John Sullivan (he disliked the tune for the first series, and his new one explained the show's title), and Hazlehurst conducted it. It was recorded at Lime Grove on 11 May 1982, with musicians John Horler, Dave Richmond, Bigden, and Proctor. Sullivan had intended Chas & Dave to sing it because they had enjoyed success with the \"Rockney\" style, a mixture of rock n' roll and traditional Cockney music. Sullivan was persuaded to do it himself by Ray Butt. Despite the creation of a new theme tune, the original one remained in occasional use. Chas & Dave did later contribute to the show, performing the closing credits song for the 1989 episode \"The Jolly Boys' Outing\". Both songs are performed by Sullivan himself, and not – as is sometimes thought – by Nicholas Lyndhurst."]}, {"page": "To the Manor Born", "response": ["The theme tune for To the Manor Born was composed by Ronnie Hazlehurst, the BBC's Light Entertainment Music Director who composed the theme tunes for many sitcoms around this time."]}, {"page": "Top of the Pops", "response": [" Ronnie Hazlehurst conducted the orchestra from 1982 to 1983.The final episode to credit Ronnie Hazlehurst as musical director was "]}, {"page": "Westminster Quarters", "response": ["* For the satirical TV series Yes Minister (1980–1984) and its sequel Yes, Prime Minister (1986–1988), about a British politician and his interactions with the civil servants who nominally serve him, the theme music was composed by Ronnie Hazlehurst and is largely based on the chimes (though with a longer duration for the first note of each quarter, which arguably makes the derivation less obvious). When asked in an interview about its Westminster influence, Hazlehurst replied, \"That's all it is. It's the easiest thing I've ever done.\""]}, {"page": "The Two Ronnies", "response": ["The main theme music for the show was composed by Ronnie Hazlehurst. Although opening and closing credits appear to use different themes they are respectively the first & third sections of a longer piece."]}, {"page": "United Kingdom in the Eurovision Song Contest 1982", "response": ["The television show A Song for Europe was used once again to select the British entry, as it had since the United Kingdom's debut at the Contest in 1957. Terry Wogan once again hosted the contest, which was held on 24 March in Studio 1 of Television Centre, London. Eight songs were shortlisted from those submitted to the Music Publishers Association. Bucks Fizz were guests at the show, singing their current single My Camera Never Lies in a pre-recorded performance. The group were interviewed by Terry Wogan live during the show and group member Bobby G performed backing vocals for the winning artists, Bardo. The BBC Concert Orchestra under the direction of Ronnie Hazlehurst as conductor accompanied all the songs, but despite performing live, the orchestra were off-screen, behind the set. The set itself gave a suggestion as to the main Eurovision stage in Harrogate which also used light columns and mirrors, in addition this set was partially recycled for the Doctor Who adventure Snakedance, broadcast almost a year later."]}, {"page": "United Kingdom in the Eurovision Song Contest 1986", "response": ["The British national final to select their entry, A Song for Europe 1986, was held on 2 April 1986 at the BBC Television Centre, London in Studio 1, and was hosted by Terry Wogan. The BBC Concert Orchestra under the direction of Ronnie Hazlehurst as conductor accompanied all but the winning song, but despite performing live, the orchestra were off-screen, behind the set. The rule introduced for 1984 prohibiting groups or 'made for Eurovision' acts from participating was rescinded. In total, 335 entries where received, and reduced tot the final eight by a variety of music industry experts."]}, {"page": "United Kingdom in the Eurovision Song Contest 1987", "response": ["The final was held on 10 April 1987, live from Studio 1 of the BBC Television Centre, London. The contest was hosted by Terry Wogan. It was also broadcast on BBC Radio 2, and this was the first and only instance in which the radio commentator could also be heard on television, passing comment after each song, and during the interval act. The BBC Concert Orchestra under the direction of Ronnie Hazlehurst as conductor accompanied all the songs, but despite performing live, the orchestra were off-screen, behind the set. Hazlehurst's arrangement of the title music which had made its debut the previous year, was an upbeat arrangement of the traditional Te Deum music and was used again for the title sequence."]}, {"page": "United Kingdom in the Eurovision Song Contest 1988", "response": ["The final was held on 25 March 1988, in Studio 1 at the BBC Television Centre. It was hosted by Terry Wogan. The theme music and title sequence were the same the one used in the previous year, a revamped Te Deum. The BBC Concert Orchestra under the direction of Ronnie Hazlehurst as conductor accompanied all the songs, but despite performing live, the orchestra were off-screen, behind the set. The contest was broadcast on Radio 2 and BBC 1."]}, {"page": "United Kingdom in the Eurovision Song Contest 1989", "response": ["The BBC Concert Orchestra under the direction of Ronnie Hazlehurst as conductor accompanied all but the winning song, but despite performing live, the orchestra were off-screen, behind the set. Hazlehurst conducted two live keyboard players who accompanied the UK entry’s backing track at the Eurovision final in Lausanne."]}, {"page": "Lynsey de Paul", "response": ["In 2007, de Paul briefly returned to acting and played the glamorous character 'Sheila Larsen' in the first episode of Kingdom, the Stephen Fry drama series. Peter Kingdom managed to clear up a feud between Sheila Larsen's two sons that starts after she dies suddenly and whose money apparently disappeared.  She also appeared on the BBC program, Breakfast, on 4 October 2007 talking about the loss of her friend and colleague Ronnie Hazlehurst, specifically the TV themes he penned and his conducting of the orchestra with rolled up umbrella for de Paul and Moran at the 1977 Eurovision Song Contest, where he was dressed in a pin-striped suit and a bowler hat.  On 10 April 2008, de Paul participated in a celebrity version of the Channel 4 show Come Dine with Me along with Tamara Beckwith, MC Harvey and Jonathan Ansell. De Paul, who was the only vegetarian among the group, came in last place. She was also featured on a celebrity version of Cash in the Attic in March 2009 where she became a temporary auctioneer."]}, {"page": "United Kingdom in the Eurovision Song Contest 1991", "response": ["That year's A Song for Europe was held on 29 March 1991 and was hosted by Terry Wogan. Following the somewhat negative comments by one member of the celebrity panel in 1990, the panel idea was dropped in 1991. The BBC Concert Orchestra under the direction of Ronnie Hazlehurst as conductor accompanied all the songs, the musicians appearing on camera for the first time since 1978."]}, {"page": "Dukinfield", "response": ["*Ronnie Hazlehurst, celebrated composer and arranger of TV and radio theme music."]}, {"page": "Germany in the Eurovision Song Contest", "response": ["| Ronnie Hazlehurst"]}, {"page": "Butterflies (TV series)", "response": ["The Butterflies theme song, \"Love Is Like a Butterfly\", is a 1974 single written and originally recorded by American country music artist Dolly Parton. The cover version used at the opening of each episode was recorded for the series by Clare Torry, with a band conducted by BBC TV composer Ronnie Hazlehurst."]}, {"page": "Hazlehurst", "response": ["*Ronnie Hazlehurst (1928–2007), musician known for his work for the BBC"]}, {"page": "Just Good Friends", "response": ["Jan Francis, who had played Lisa Colbert in Secret Army, was cast as Penny, and established theatre actor Paul Nicholas was chosen to play Vincent, although this was his first major television role. Being a notable singer, Nicholas also performed the title theme song, written by John Sullivan and arranged by Ronnie Hazlehurst. For the end title music, Hazlehurst arranged the theme for flugelhorn.Ronnie Hazlehurst at IMDb, retrieved 4 December 2006"]}, {"page": "Ben Daglish", "response": ["Daglish lived in Derbyshire where he composed, played and performed in a number of UK bands, including Loscoe State Opera. He also regularly performed with violinist Mark Knight and the band SID80s at retro computer game events such as Back in Time Live and Retrovision. He had also performed with Commodore 64 revival band Press Play On Tape together with Rob Hubbard. He was a fan of the late Ronnie Hazlehurst, a prolific composer for television.Daglish's pages on Hazlehurst, who he described as \"one of the most talented of 20th century composers.\"  Ben-daglish.net He died from complications from lung cancer on 1 October 2018."]}, {"page": "1928 in British television", "response": ["*13 March – Ronnie Hazlehurst, English light music composer and director, theme tune composer (d. 2007)"]}, {"page": "Jade (disambiguation)", "response": ["* \"Jade\", a 1973 single by Ronnie Hazlehurst"]}, {"page": "Sorry! (TV series)", "response": ["The theme music was composed by Gaynor Colbourn and Hugh Wisdom, arranged by Gaynor Colbourn and conducted by Ronnie Hazlehurst."]}, {"page": "Matt Berry", "response": ["Berry voiced his appreciation of the television themes of Ronnie Hazlehurst in an episode of Charlie Brooker's Screenwipe, and his band played out the Screenwipe Christmas special with a rendition of Hazlehurst's theme tune for 1980s British sitcom Sorry!"]}, {"page": "Ronnie Hazelhurst", "response": ["#REDIRECT Ronnie Hazlehurst"]}, {"page": "Wyatt's Watchdogs", "response": ["Wyatt's Watchdogs is a 30-minute BBC1 situation comedy that starred Brian Wilde and Trevor Bannister.  Created and written by Miles Tredinnick, the six-episode series was transmitted in the autumn of 1988.  Alan J. W. Bell directed and the music was composed by Ronnie Hazlehurst."]}, {"page": "By the Sea (1982 film)", "response": ["The film followed the extended family of \"The General\", played by Barker, as they went on an eventful seaside holiday. It was set on the Dorset coast in \"Tiddly Cove\", actually the coast between Bournemouth and Swanage. The film is completely free of speech, with the score by Ronnie Hazlehurst and various sound effects and vocalisations in their place.", "Despite being given a budget to reshoot scenes if required, Bell re-structured the film and cut it down to fifty-five minutes. He commissioned Ronnie Hazlehurst to write an original music score. To add comic effect and to replicate the feel of silent films, the film was also slightly undercranked to speed it up. BBC Comedy Guide"]}, {"page": "Dear John (British TV series)", "response": ["As with his other series, the title music was composed by the series' writer, John Sullivan. It was arranged by Ronnie Hazlehurst, the composer of music used in many BBC comedies and light entertainment programmes, Joan Baxter provided the vocals."]}, {"page": "Reliability of Wikipedia", "response": ["A 2016 BBC article by Ciaran McCauley similarly noted that \"plenty of mischievous, made-up information has found its way\" on to Wikipedia and that \"many of these fake facts have fallen through the cracks and been taken as gospel by everyone from university academics to major newspapers and broadcasters.\" Listing examples of journalists being embarrassed by reproducing hoaxes and other falsifications from Wikipedia in their writing, including false information propagated by major news organizations in their obituaries of Maurice Jarre and Ronnie Hazlehurst, McCauley stated: \"Any journalist in any newsroom will likely get a sharp slap across the head from an editor for treating Wikipedia with anything but total skepticism (you can imagine the kicking I've taken over this article).\""]}, {"page": "Scott Fitzgerald (singer)", "response": ["In 1988, he was the first ever artist chosen by telephone vote to sing the UK's entry in the Eurovision Song Contest with the song \"Go\". The song was written and composed by Julie Forsyth, daughter of the entertainer Sir Bruce Forsyth. Forsyth joined Fitzgerald on stage at the contest in Dublin, alongside her husband Dominic Grant (also of Guys 'n' Dolls) and Des Dyer (formerly of Jigsaw), to perform backing vocals. Ronnie Hazlehurst conducted the live orchestration.  Fitzgerald came second in the contest, by one point, to Switzerland's winning entry performed by Celine Dion. \"Go\" reached number 52 in the UK Singles Chart in April 1988."]}]}}