{"wiki_id": "http://www.wikidata.org/entity/Q3398347", "itemLabel": "Lewis Morris", "itemDescription": "British cartographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Lewis_Morris_(1701%E2%80%931765)", "wikipedia_page": {"main": "Lewis Morris (2 March 1701 – 11 April 1765) was a Welsh hydrographer, antiquary, poet and lexicographer, the eldest of the Morris brothers of Anglesey.\nLewis Morris was the eldest son of Morris ap Rhisiart Morris, a farmer, of Llanfihangel-Tre'r-Beirdd in Anglesey.\nHis bardic name was Llewelyn Ddu o Fôn (\"Black Llewelyn [Lewis] of Anglesey\").  The correspondence between him and his younger brothers is a valuable historical source. In 1751, he founded the Honourable Society of Cymmrodorion along with his brother Richard.", "link_mentions": [{"page": "1765", "response": ["* April 11 – Lewis Morris (1701–1765), Welsh hydrographer (b. 1701)"]}, {"page": "1701", "response": ["* March 2 – Lewis Morris, Welsh hydrographer (d. 1765)"]}, {"page": "Mordred", "response": ["The 18th-century Welsh antiquarian Lewis Morris, based on statements made by the Scottish chronicler Boece, suggested that Medrawd had a wife named Cwyllog, daughter of Caw. Another late Welsh tradition was that Medrawd's wife was Gwenhwy(f)ach, sister of Guinevere."]}, {"page": "Ida of Bernicia", "response": ["Some 18th- and 19th-century commentators, beginning with Lewis Morris, associated Ida with the figure of Welsh tradition known as Fflamddwyn (\"Flame-bearer\"). This Fflamddwyn was evidently an Anglo-Saxon leader opposed by Urien Rheged and his children, particularly his son Owain, who slew him.Bromwich, p. 353. However, Rachel Bromwich notes that such an identification has little to back it; other writers, such as Thomas Stephens and William Forbes Skene, identify Fflamddwyn instead with Ida's son Theodric, noting the passages in the genealogies discussing Theodric's battles with Urien and his sons."]}, {"page": "1765 in literature", "response": ["*April 11 – Lewis Morris, Welsh poet, antiquary and lexicographer (born 1701)"]}, {"page": "1701 in literature", "response": ["*March 2 – Lewis Morris, Welsh lexicographer and writer (died 1765)"]}, {"page": "Lewis Morris (disambiguation)", "response": ["Lewis Morris (1726–1798) was a signer of the United States Declaration of Independence.", "Lewis Morris may also refer to:", "* Lewis Morris (governor) (1671–1746), American colonial leader in New York and New Jersey", "* Lewis Morris (speaker) (1698–1762), American judge, politician and landowner", "* Lewis Morris (1701–1765), Welsh poet", "* Sir Lewis Morris (1833–1907), Welsh poet, academic and politician"]}, {"page": "Milford Haven", "response": ["Milford Haven appears in a number of literary works, including Shakespeare's Cymbeline as \"blessed Milford\",Shakespeare, William; Cymbeline Act 3, Scene 4 The Complete Works of William Shakespeare, retrieved 16 June 2018 and the location where King Arthur landed from Ireland in pursuit of the Twrch Trwyth boar as part of the medieval Welsh prose romance Culhwch and Olwen.Arthur and the Twrch Trwyth: Introduction www.aattt.org.uk Retrieved 17 December 2018 Drayton described the area in his Poly-Olbion as \"So highly Milford is in every mouth renowned / Noe haven hath aught good, in her that is not found\".Lowther, F.L. Milford Haven, Vickery, Kyrle & Co, 1924 Lewis Morris made Milford and Hakin the subject of his poem \"The Fishing Lass of Hakin\",Curtis, Tony The Poetry of Pembrokeshire, Seren, 1989  and the gothic novel The Horrors of Oakendale Abbey used Milford as a key location.Sir Anthony Carlisle and Mrs Carver  Romantic Textualities: Literature and Print Culture, 1780–1840, (Winter 2009), Retrieved 29 July 2018 The town lends its name to the fictional Californian location featured in the novelisations and radio plays by author Mara Purl.Days of Our Lives Soap Actress Mara Purl Finds Major Success as Author ... What the Heart Knows Begins the Journey www.bellekeepbooks.com Retrieved 16 June 2018 Robert Watson uses the town as the principal setting in his novel Slipping Away From Milford,Slipping Away from Milford www.serenbooks.com Retrieved 23 July 2018 as did Taprell Dorling writing as Taffrail, whose thriller Mystery at Milford Haven explored the 1930s criminal underworld in the area.Novels of the Day: Contraband - The Sydney Morning Herald: 22nd May 1936 Trove: National Library of Australia, www.trove.nla.gov.au Retrieved 23 July 2018 The town was used as a filming location for the BBC drama The Onedin Line,The Onedin Line (1971–1980): Filming & Production Internet Movie Database, Retrieved 16 June 2018 the 1968 film The Lion in WinterThe Lion in Winter (1968) Filming & Production Internet Movie Database, Retrieved 16 June 2018 and the 1984 short cult film \"Vengeance\".Vengeance (1984) Internet Movie Database, Retrieved 6 May 2020Frightmares MJ Simpson: Cult films and the people who make them. Retrieved 6 May 2020 The town's Mount Estate provided the location for a BBC documentary entitled The Mount: A Welsh Estate, which received criticism locally for its portrayal of residents.Mounting Criticism Over TV Show Western Telegraph. Retrieved 7 April 2012Reaction Mounts As Show Nears End Milford Mercury. Retrieved 7 April 2012  Locations in the town, including Hakin Point and Gelliswick, were used in filming for The Pembrokeshire Murders in 2020.The Pembrokeshire Murders: The exact locations where the ITV crime drama was filmed Wales Online, 11 January 2021"]}, {"page": "Llewelyn Ddu o Fôn", "response": ["#REDIRECT Lewis Morris (1701–1765)"]}, {"page": "List of Welsh-language authors", "response": ["*Lewis Morris (Llywelyn Ddu o Fôn) (1701–1765)"]}, {"page": "Daniel Silvan Evans", "response": ["In 1876 Silvan Evans was collated to the living of Llanwrin, Montgomeryshire. He assisted Thomas Stephens with his monumental composition Literature of the Kymry, co-edited a new edition of Llyfr Gweddi Cyffredin (the Book of Common Prayer in Welsh), and in 1878 edited Lewis Morris's Celtic Remains. Through his son-in-law, Benjamin Williams, Vicar of Llanover, Monmouthshire, he was associated with Lady Llanover's attempt to rekindle Welshness on her model estate. These years were saddened by the loss of six of his seven children, and by his wife's fatal accident in 1889."]}, {"page": "Pabo Post Prydain", "response": ["A tradition identifies Pabo as the founder of St Pabo's Church, Llanbabo (at Llanbabo, Anglesey). The first author to record it is antiquarian Henry Rowlands (d. 1723), who writes that \"Pabo, frequently called Post Prydain, i.e. the Support of Britain, for his great valour against the Picts and Scots, retired here [in Anglesey], and built his church at Llan Babo.\"Rowlands, Mona antiqua restaurata, p. 157-8. A stone cross was erected in the ruler's memory in the abbey's churchyard at the same time Bangor Cathedral was being built. Welsh poet Lewis Morris reports that the memorial cross was discovered there around 1650. The monument, dated to the 14th Century, bears the carved image of a king and an accompanying inscription. The inscription is in part illegible but the following reading has been suggested;"]}, {"page": "Honourable Society of Cymmrodorion", "response": ["The Society was founded by the brothers Lewis and Richard Morris, natives of Anglesey. The name, coined by Lewis Morris, was a form of the  (\"earliest natives\"), in reference to the place of the Welsh as heirs to the ancient Britons.", "Several factors combined to prompt the foundation of the new society. One may have been Lewis Morris's disappointment at his failure to be elected a Fellow of the Royal Society. More important was a desire to support the Welsh Charity School, established in 1716 under the auspices of another London Welsh Society, the Honourable and Loyal Society of Antient Britons. By the 1740s the Antient Britons had become somewhat moribund, and the new Society of Cymmrodorion was intended in part to supplement its efforts. It was also to raise funds to relieve impoverished Welsh people in London. The Society's primary object, however, was to be a hub of social activity for the Welsh in London, and (in the absence of a recognised political or cultural \"capital\" of Wales) a focus of Welsh culture. Regular meetings were held on the first Wednesday of each month, when papers were read on a variety of literary and learned topics."]}, {"page": "Cwrtmawr manuscripts", "response": ["In addition to the major groups there are a number of important smaller ones. It includes manuscripts relating to each of the following: manuscript transcriber Margaret Davies (c. 1700–1785); Morris Davies (1796–1876), author, hymnologist and musician; William Davies (1805–1859); Independent minister and schoolmaster David Ellis; James Spinther James (1837-1914), Baptist historian Owen Jones, 'Manoethwy' (1838–1866); schoolteacher and writer Owen Jones (1833–1899); Calvinistic Methodist minister, writer and bibliophile Richard Robert Jones (Dic Aberdaron); Lewis Morris; Robert Prys Morris (c. 1831–1890), local historian and antiquary; John Peter (Ioan Pedr, 1833–1877), Independent minister and Welsh scholar; Hugh Pugh (1803–1868), Independent minister and schoolmaster; and Robert Williams (1810–1881), cleric, Celtic scholar and antiquary."]}, {"page": "1760s in Wales", "response": ["**11 April - Lewis Morris, hydrographer and writer, eldest of the Morris brothers of Anglesey, 64"]}, {"page": "Llewelyn Ddu o Fon", "response": ["#REDIRECT Lewis Morris (1701–1765)"]}, {"page": "Goronwy Owen (poet)", "response": ["He learnt much of his poetic craft from Lewis Morris, a fellow Anglesey man who, with his brothers and others, was a key figure in the Welsh literary circle referred to by Saunders Lewis as a \"school of Welsh Augustans\".Saunders Lewis, A School of Welsh Augustans (Cardiff, 1924; reprinted by Cedric Chivers, Bath, 1969).", "*Diddanwch Teuluaidd (1763, 1817). (\"A seemly diversion\") Anthology in three parts. Includes most of his poems together with works by Lewis Morris and Huw Huws."]}, {"page": "Lewis Morris (1701-1765)", "response": ["#REDIRECT Lewis Morris (1701–1765)"]}, {"page": "William Wynn (poet)", "response": ["Wynn's earliest poem was written whilst he was a student at Oxford, in 1733, and he wrote further poems between then and 1738, including poems to members of the royal family.  A printed copy of one of these poems were given to the Welsh antiquarian and poet Lewis Morris in 1737, Morris and Lewes being regular correspondents after that time (if they were not already), each sending copies of poems that they had written to the other.  Wynn wrote few other poems, but his other work included a poem to Morris himself (1744), poems on the subject of the day of judgment and a yacht owned by William Vaughan (1755) and some carols.  He owned various Welsh-language manuscripts and was known to be a scholar, leading to his becoming a member of the Honourable Society of Cymmrodorion soon after 1751."]}, {"page": "Lewis (given name)", "response": ["* Lewis Morris, signer of the American Declaration of Independence", "* Lewis Morris (governor), American colonial leader in New York and New Jersey", "* Lewis Morris (speaker), American judge, politician and landowner", "* Sir Lewis Morris (1833–1907), Welsh poet, academic and politician", "* Lewis Morris (1701–1765), Welsh hydrographer, antiquary, poet and lexicographer"]}, {"page": "Mac Durnan Gospels", "response": ["By 1574 it was owned by the Archbishop of Canterbury, Matthew Parker. It was probably Parker who had folios decorated with miniatures taken from a 13th-century Psalter and gave the work its current binding. After his death, Parker bequeathed all his manuscripts, save the Mac Durnan Gospels, to Corpus Christi College, Cambridge. The reason for this is unknown though he may have gifted to a friend while he was alive. The only known owner thereafter is Brother Howel, a manufacturer of measuring instruments in London, who showed the work to antiquarian and poet Lewis Morris. The manuscript probably entered the library of Lambeth Palace on the initiative of its director, Andrew Coltee Ducarel, who assumed the post in 1757. However, the work isn't listed in any library records from the time and doesn't make its first appearance in the catalogues until 1932."]}, {"page": "1763 in Wales", "response": ["*Goronwy Owen, Lewis Morris et al. - Diddanwch Teuluaidd"]}, {"page": "1760 in Wales", "response": ["*Lewis Morris settles his long-standing legal appeal and is appointed JP for Cardiganshire."]}, {"page": "1735 in Wales", "response": ["*Lewis Morris - Tlysau yr Hen Oesoedd"]}, {"page": "1741 in Wales", "response": ["*Lewis Morris resumes his survey of Welsh ports on behalf of the Navy Office."]}, {"page": "1748 in Wales", "response": ["*Lewis Morris - Plans of Harbours, Bays, and Roads in St. George's and the Bristol Channels"]}, {"page": "St Pabo's Church, Llanbabo", "response": ["The date of foundation of the church in Llanbabo, Anglesey, is unknown, but it is known that there was a church here before 1254 as it is recorded in the Norwich Valuation of that year.  According to tradition, it was founded by Pabo Post Prydain (Pabo the \"Pillar of Britain\"), a 5th-century prince from North Britain who was driven out in 460 and settled thereafter in Anglesey. He is also said to have been buried in the area. A stone slab gravestone dating from the late 14th century, made from Flintshire sandstone, was found in about 1680: according to the 17th-century Welsh historian Lewis Morris, it was unearthed by a sexton digging a grave in the churchyard. The rectangular slab (from the same workshop as one at Bangor Cathedral and one of St Iestyn at St Iestyn's Church, Llaniestyn, given the similarities between them) has a shallowly engraved full-length image of a bearded man wearing a crown and a loose, pleated tunic over a garment reaching to his wrists.  He holds a sceptre in his right hand; his head is on a cushion underneath an arch, and the background is decorated with flowers.  The effect is somewhat like a monumental brass in stone; the slab is now displayed vertically inside the church.  The inscription, which is incomplete, reads \"\" (or \"Prud\") – \"Here lies Pabo the Pillar of Britain\". Additional letters have been interpreted as denoting the name of the donor of the monument. Apart from this, the tradition linking Pabo to the church is not recorded in writing until the Welsh antiquarian Henry Rowlands in the 18th century, nor is there evidence that Pabo devoted himself to religion or died in Anglesey; accordingly, modern writers suggest that there is no link between him and the church. "]}, {"page": "Cwyllog", "response": ["According to critics, Cwyllog may be a fictional creation. Her name could be a back-formation from the place-name Llangwyllog. The original saint of that location would be Gwrddelw, son of Caw, whose feast day is also 7 January. Cwyllog's connection to Mordred originated with readings of Hector Boece, who said Mordred's wife was a daughter of Gawolane. Some scholars identified \"Gawolane\" as Caw of Prydyn, which caused Welsh antiquary Lewis Morris to list Gildas as Medrawd's brother-in-law and, eventually, “Kwyllog” as Medrawd's wife."]}, {"page": "Philip Yorke (antiquary)", "response": ["His first genealogical book, the Tracts of Powys, was published in 1795, in a run of 70 copies. Dedicated to Thomas Pennant of Downing, it was based on a limited range of printed sources as well as on correspondence with scholars such as Walter Davies. The work details the history of the descendants of Bleddyn ap Cynfyn, offers a stern riposte to Polydore Vergil's negative appraisal of the early Britons, and devotes some space to the crown lordships of Powys. The appendix includes letters by Goronwy Owen and Lewis Morris."]}, {"page": "Robert ap Huw", "response": ["During the 18th century the manuscript came into the possession of Welsh poet and antiquary Lewis Morris. Morris had the manuscript bound with extra leaves added to the front and back, to which he added his own notes on the antiquities of Welsh music. Upon Morris' death in 1765 the manuscript passed to his brother Richard, who at one stage lent the work to the noted Welsh harpist John Parry. The manuscript eventually found itself in the ownership of the London Welsh School, whose Governors presented it to the British Museum in 1844."]}, {"page": "Evan Evans (poet)", "response": ["From an early age he cultivated poetry, and he was soon noticed by Lewis Morris the antiquary. He diligently applied himself to the study of Welsh literature, and employed his leisure time in transcribing ancient Welsh manuscripts, for which purpose he visited most of the libraries in Wales. At one time he received small annuities from Sir Watkin Williams Wynn and Dr John Warren, when bishop of St David's, to enable him to pursue his research. His first publication was entitled Some Specimens of the Poetry of the Antient Welsh Bards, translated into English; with explanatory notes on the historical passages, and a short account of men and places mentioned by the Bards; in order to give the curious some idea of the tastes and sentiments of our Ancestors, and their manner of writing. London, 1764, reprinted at Llanidloes [1862]. This work gained for its author a high reputation as an antiquary and a critic, and furnished Gray with matter for some of his most beautiful poetry. In it is included a Latin treatise by Evans, De Bardis Dissertatio; in qua nonnulla quæ ad eorum antiquitatem et munus respiciunt, et ad præcipuos qui in Cambria floruerunt, breviter discutiuntur."]}, {"page": "Anglo-Saxon royal genealogies", "response": ["Some 18th- and 19th-century commentators, beginning with Lewis Morris, associated Ida with the figure of Welsh tradition known as Flamdwyn (\"Flame-bearer\"). This Flamdwyn was evidently an Anglo-Saxon leader opposed by Urien Rheged and his children, particularly his son Owain, who slew him., p. 353. However, Rachel Bromwich notes that such an identification has little to back it; other writers, such as Thomas Stephens and William Forbes Skene, identify Flamdwyn instead with Ida's son Theodric, noting the passages in the genealogies discussing Theodric's battles with Urien and his sons."]}, {"page": "Josiah Rees", "response": ["In literature Rees's first and major venture was the Welsh magazine Trysorfa Gwybodaeth, neu yr Eurgrawn Cymraeg. It was the first sustained publication of the kind in Wales: a similar magazine, Tlysau yr Hen Oesoedd or \"Gems of Ancient Times\", projected in 1735 by Lewis Morris, only lasted one number. Rees's Trysorfa was produced at his own expense. The first number—32 pages at 3d.—appeared on 3 March 1770; it was published by John Ross of Carmarthen. Fourteen fortnightly numbers followed. The magazine was discontinued with the fifteenth number, on 15 September 1770, for want of support. With every number were given eight pages of Caradoc of Llancarfan's Brut y Tywysogion, or Chronicle of the Princes."]}, {"page": "1729 in Wales", "response": ["**Lewis Morris, eldest of the noted Morris brothers of Anglesey, becomes a customs official."]}, {"page": "Trefeurig", "response": ["When Lewis Morris came to Cwmsymlog in the mid-18th century, he reported seeing the remains of an old mining method at Twll-y-Mwyn, Cwmsebon, and stone tools that he claimed had belonged to prehistoric miners. As these artefacts were not available by the 20th century, there is considerable uncertainty about these claims.", "* Lewis Morris - hydrographer, writer, scholar. Moved to Trefeurig upon appointment as Crown Steward of Mid Wales Mines. He lived in Cwmsymlog, later moving between 1746 to Gelffadog as well as Penrhyn-coch in 1757. "]}, {"page": "Hugh Hughes (poet)", "response": ["Hughes was a disciple of Lewis Morris, and practically ceased to write poetry after Morris's death. His verses were esteemed by Goronwy Owen."]}, {"page": "1723 in Wales", "response": ["*7 May - Lewis Morris arrives in London from Anglesey."]}, {"page": "National Library of Wales General Manuscript Collection", "response": ["A hundred and thirty-seven of the Additional Manuscripts were purchased at the Sir Thomas Phillipps sale in 1895, which Davies described as including some of considerable interest, for instance the letters contained in bound volumes of the papers of Bardd y Brenin, that Sir Thomas had bought. There are also some important manuscripts such as the holograph of George Owen's Treatise on the Lordships Marcher of Wales (NLW MS 10), a collection of notes by Lewis Morris (NLW MS 67), a copy of the journal that Sir Joseph Banks kept of his tour through Wales (NLW MS 147), a copy of the original manuscript of T. F. Dukes's Antiquities of Shropshire, the notebook of Theophilus Jones (NLW MS 235), and a volume of letters to the Welsh Antiquary Edward Lhuyd (NLW MS 309)."]}, {"page": "Literature in the other languages of Britain", "response": ["A mover in the classical revival of Welsh literature in the 18th century was Lewis Morris, one of the founders in 1751 of the Honourable Society of Cymmrodorion, a Welsh literary society in London—at that time the most important centre of Welsh publishing. He set out to counter the trend among patrons of Welsh literature to turn towards English culture. He attempted to recreate a classic school of Welsh poetry with his support for Goronwy Owen and other Augustans. Goronwy Owen's plans for a Miltonic epic were never achieved, but influenced the aims of eisteddfodau competitions through the 19th century."]}, {"page": "Llanddona fish weir", "response": ["Llanddona fish weir is first mentioned in the 17th century in the records of the Baron Hill estate and is also shown on a chart of 1748 by Lewis Morris, a hydrographer, surveyor and author from Anglesey.", "*Lewis Morris's Map of Red Wharf Bay, 1748 – from a collection at Liverpool University"]}]}}