{"wiki_id": "http://www.wikidata.org/entity/Q3400666", "itemLabel": "Scott Beaumont", "itemDescription": "British mountain biker", "wikipedia_url": "https://en.wikipedia.org/wiki/Scott_Beaumont", "wikipedia_page": {"main": "Scott Beaumont (born 2 June 1978), nicknamed Boom Boom, is an English pro mountain bike racer, specialising in the disciplines of downhill and fourcross. He lives in the UK.\nBeaumont was born in Droitwich Spa, Worcestershire in 1978. He started racing BMX aged four, and went on to win several national titles, and was World BMX Champion in 1995 and 1996.\nIt was in 1996 that Beaumont first began to ride mountain bikes. The new discipline of dual slalom had been created, and mountain bike teams were looking for experienced BMX riders to transition into the new discipline. When dual slalom was replaced by four-cross, Beaumont made the transition. He remains a high-profile figure in the British mountain biking scene, and is one of the leading elite riders in the British national 4X series, winning the 2008,2012, 2013 and 2015 British national 4X championship.", "link_mentions": [{"page": "List of British cyclists", "response": ["* Scott Beaumont"]}, {"page": "Mountain Biking UK", "response": ["The magazine along with co-sponsors such as Nike, Santa Cruz and Fox Racing operated a successful professional mountain bike team from the mid-1990s until the mid-2000s, including riders of the calibre of Steve Peat, Scott Beaumont, Rob Warner and Will Longden and competing in the UCI Mountain Bike World Cup."]}, {"page": "British National Mountain Biking Championships", "response": ["| Scott Beaumont", "| Scott Beaumont", "| Scott Beaumont"]}, {"page": "UCI BMX World Championships", "response": ["* Junior Men Cruiser: Scott Beaumont "]}, {"page": "List of professional mountain bikers", "response": ["* Scott Beaumont "]}, {"page": "Beaumont (surname)", "response": ["* Scott Beaumont, English mountain bike racer"]}, {"page": "Boom Boom (nickname)", "response": ["* Scott Beaumont (born 1978), English mountain bike racer"]}]}}