{"wiki_id": "http://www.wikidata.org/entity/Q34004176", "itemLabel": "Sarah Birch", "itemDescription": "American political scientist and academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Birch", "wikipedia_page": {"main": "Sarah Birch,  (born 5 December 1963) is an American political scientist and academic, specialising in comparative politics. Since 2016, she has been Professor of Political Science at King's College London. She had taught at the University of Essex between 1996 and 2013, and held the Chair of Comparative Politics at the University of Glasgow between 2013 and 2016.\n\n", "link_mentions": [{"page": "List of political scientists", "response": ["* Sarah Birch - professor in comparative politics at King's College London"]}, {"page": "Green Party of England and Wales", "response": ["According to political scientist Sarah Birch, the Green Party draws support from \"a wide spectrum of the population\". In 1995, sociologist Chris Rootes stated that the Green Party \"appeals disproportionately to younger, highly educated professional people\", although he noted that this support base was \"not predominantly urban\". In 2009, Birch noted that the Green's strongest areas of support were Labour-held seats in university towns or urban areas with relatively large student populations. She noted that there were also strong correlations between areas of high Green support and high percentages of people who define themselves as having no religion."]}, {"page": "University of Essex", "response": ["Notable academics linked to the department over its history include Brian Barry, Sarah Birch, R. A. W. Rhodes, Jean Blondel, Sir Ivor Crewe, Peter Frank, Robert E Goodin, Anthony King, Ernesto Laclau and Kristian Skrede Gleditsch, current holder of the Regius Professorship in Political Science."]}, {"page": "2001 World Rowing Championships", "response": ["|    Sarah Birch (b)Jo Nitsch (s)  || 7:23.00"]}, {"page": "Birch (surname)", "response": ["* Sarah Birch (born 1963), American political scientist and academic"]}, {"page": "British Journal of Political Science", "response": ["* Sarah Birch, co-editor from 2002 to 2011"]}, {"page": "List of fellows of the British Academy elected in the 2010s", "response": ["* Sarah Birch, Chair of Comparative Politics, University of Glasgow"]}]}}