{"wiki_id": "http://www.wikidata.org/entity/Q3404543", "itemLabel": "Canna", "itemDescription": "6th century female Welsh saint", "wikipedia_url": "https://en.wikipedia.org/wiki/Saint_Canna", "wikipedia_page": {"main": "Saint Canna was a sixth-century mother of saints and later a nun in south Wales.\nAccording to the writings of the unreliable Iolo Morganwg, Canna was a daughter of the Breton King Tudur Mawr, and widely held to be related to Saint Illtud.\nShe married her cousin Sadwrn, and in his old age, Sadwyn accompanied Saint Cadfan to Britain where he founded two churches, one in Anglesey and one in Carmarthenshire. Canna accompanied her husband, with their son Crallo. After the death of Sadwrn, she remarried and became the mother of Saint Elian Geimiad.\n\nCanna founded a church in West Wales and then became a nun. She reportedly founded a church in Llangan in the Vale of Glamorgan, where there is a church dedicated to her, built on the site of at least one previous. Near the west wall of St. Canna's Church is a 9th-10th c. disc-headed cross slab, 1.3m high, depicting the Crucifixion. There was a well below the old church called Ffynnon Ganna, {Canna's Holy Well}, whose water was believed to have curative properties and was a site of pilgrimage for many centuries.Her name also appears as part of two Cardiff districts: Canton (English translation of the Welsh Treganna, Saint Canna's Town); and Pontcanna (Welsh for Canna's Bridge). St. Canna's Close is located in Canton.\nCanna's Feast day is celebrated on 25 October.A Masonic Lodge No. 6725, within South Wales Eastern Division, is named after Saint Canna.St Crallo's Church is dedicated to Canna's son, the 6th century Celtic saint, Saint Crallo, whose feast is August 8. The village in which the church is situated, Coychurch is known in the Welsh language as Llangrallo; Llan – Church, Grallo – Crallo, the church of Crallo. It is believed that the saint founded a church on the site before the construction of the present medieval building.", "link_mentions": [{"page": "October 25", "response": ["**Canna"]}, {"page": "Pontcanna", "response": ["The name Pontcanna stems from Pont Canna Farm, which in turn was named after a bridge across the Whitehouse Brook,The suburbs of Riverside and Pontcanna www.cardiffians.co.uk a one-time tributary of the River Taff which ran between Llandaff Fields and Riverside. The bridge is believed to have stood near the junction of what, today, are Teilo Street and Cathedral Road. The bridge was removed (and the brook covered up) in 1896. Saint Canna is said to have been a 6th-century saint, although there is little early evidence of her existence."]}, {"page": "Canton, Cardiff", "response": ["The name (from \"St. Canna's Town\") refers to the 6th-century female saint after whom Pontcanna is also named. Canton, also known as Treganna (tref town + Saint Canna), was a 13th-century manor in Llandaff. It became part of Victorian era Cardiff in 1875.Cardiff Pubs in Canton", "Canton, or Treganna in the Welsh language, was formed around a 13th-century Manor in Cardiff and assumed lands from nearby Llandaff and Leckwith parishes under the stewardship of an Earl (or Baron) de Kanetune, although today the manor comes under the jurisdiction of the Manor of Llandaff. It is believed that Canton is named after St Canna, the holy matron in the Celtic age of Saints, and Canna herself is reputed to have been a relative of King Arthur"]}, {"page": "Canna", "response": ["Canna may refer to:", "* Canna, Western Australia, a locality in the Shire of Morawa, Australia", "* Canna, Calabria, a comune in the Province of Cosenza, Italy", "* Cannae, a frazione in the Province of Barletta-Andria-Trani, Apulia, Italy", "* Canna, Scotland, an island in the Inner Hebrides", "* Canna (name)", "* Canna (gamer), (born 2000), League of Legends player", "* Saint Canna, sixth-century mother of saints and nun in south Wales", "* Canna (plant), a genus of flowering plants", "* Canna (unit), an ancient Italian length unit, equal to 2–3 m", "* Canna Creek, a tributary to Lobutcha Creek, Mississippi", "* MV Canna, a car ferry built for Caledonian MacBrayne", "* Cannae (disambiguation)"]}, {"page": "Category talk:French saints", "response": ["Saint CannaStub"]}, {"page": "Category talk:British saints", "response": ["Saint CannaStub"]}, {"page": "Category talk:Ancient Christian denominations", "response": ["Saint CannaStub"]}, {"page": "List of Breton saints", "response": ["* Canna"]}, {"page": "Canna (name)", "response": ["Canna is a given name and surname. Notable people with the name include:", "*Saint Canna, 6th-century Welsh saint and Breton princess", "*Achille Canna (born 1932), Italian basketball player", "*Carlo Canna (born 1992), Italian rugby union player", "*Nobutoshi Canna, Japanese voice actor"]}, {"page": "List of Welsh women", "response": ["*Saint Canna (6th century), nun"]}, {"page": "St Crallo's Church", "response": ["The church is dedicated to the 6th century Celtic saint, Crallo, supposedly related to both Saint Illtyd and Saint Canna. The village in which the church is situated, Coychurch is known in the Welsh language as Llangrallo; Llan – Church, Grallo – Crallo, the church of Crallo. It is believed that the saint founded a church on the site before the construction of the present medieval building."]}, {"page": "List of Church in Wales churches", "response": ["|St Canna"]}, {"page": "St. Canna", "response": ["#REDIRECT Saint Canna"]}]}}