{"wiki_id": "http://www.wikidata.org/entity/Q3402530", "itemLabel": "Rhys Davies", "itemDescription": "Welsh novelist", "wikipedia_url": "https://en.wikipedia.org/wiki/Rhys_Davies_(writer)", "wikipedia_page": {"main": "Vivian Rees Davies  (9 November 1901 – 21 August 1978), known as Rhys Davies,  was a Welsh novelist and short story writer, who wrote in the English language.", "link_mentions": [{"page": "Welsh literature in English", "response": ["An early work of the first wave of Anglo-Welsh writers was The Withered Root (1927) by Rhys Davies (1901–78) from the Rhondda Valley. While he probably wrote more fiction about the industrial world of the South Wales Valleys than anyone else, Rhys Davies was in fact a grocer's son who was living in London by the time he was twenty. Unlike that of other writers from the mining community, his fiction is more concerned with individuals, in particular women, than with politics.A Hundred Years of Fiction, p.64. D. H. Lawrence was a major influence on Rhys, though similarities with Caradoc Evans have been noted, and it has been suggested that he had \"The tendency to process images of the Welsh valleys for consumption by English audiences\".A Pocket Guide, p.104. Another Anglo-Welsh novelist (and playwright) was Jack Jones (1884–1970), a miner's son from Merthyr Tydfil who was himself a miner from the age of 12. He was active in the union movement and politics, starting with the Communist Party, but in the course of his life he was involved, to some degree, with all the major British parties. Amongst his novels of working-class life are Rhondda Roundabout (1935) and Bidden to the Feast (1938). The political development of a young miner is the subject of Cwmardy (1937), Lewis Jones's (1897–1939) largely autobiographical novel."]}, {"page": "Anna Kavan", "response": ["Many of her works were published posthumously, some edited by her friend and legatee, the Welsh writer Rhys Davies. London-based Peter Owen Publishers have been long-serving advocates of Kavan's work and continue to keep her work in print. Doris Lessing, J.G. Ballard, Anaïs Nin, Jean Rhys, Brian Aldiss, Christopher Priest, Nina Allan, Virginia Ironside and Maggie Gee are among the writers who have praised her work.", "Kavan was friends with the Welsh writer Rhys Davies, who based his 1975 novel Honeysuckle Girl on her early life.", "Silverglass by DJ Britton is a play about the relationship between Rhys Davies and Anna Kavan.  It was presented as a premiere during the Rhys Davies Short Story Conference 2013 held in Swansea. The play is set in the late 1960s and depicts Davies' late literary recognition as well as Kavan's final tragedy.  Both writers lived 'a life of self-invention, in which secrets, sexuality and deep questions of personal identity lurked constantly in the shadows'.http://www.taliesinartscentre.co.uk/performances.php?id=710"]}, {"page": "Tribune (magazine)", "response": ["Other writers who contributed to Tribune in the 1940s include Naomi Mitchison, Stevie Smith, Alex Comfort, Arthur Calder-Marshall, Julian Symons, Elizabeth Taylor, Rhys Davies, Daniel George, Inez Holden, and Phyllis Shand Allfrey."]}, {"page": "Mandrake Press", "response": ["Mandrake Press published over 30 items, including D. H. Lawrence, The Paintings of D H Lawrence together with works by Liam O'Flaherty, Rhys Davies, Giovanni Boccaccio, Peter Warlock under the pseudonym Rab Noolas, S. S. Koteliansky, Aleister Crowley, Thomas Burke, Cecil Roth, Beresford Egan, W. J. Turner, Brinsley MacNamara, Edgell Rickword, Richard Barham Middleton, V. V. Rozanov, Philip Owens, Vernon Knowles, and others.The Mandrake Press 1929–1930 Catalogue of an exhibition at Cambridge University Library September to November 1985. Limited to 300 copies. With a prefatory essay by Jack Lindsay, arranged and with a tabulation of items published by the Mandrake Press. New edition published by Cambridge: Cambridge University Library, 1985."]}, {"page": "Tonypandy", "response": ["* Writer Rhys Davies (1901 – 1978) "]}, {"page": "Transition (literary journal)", "response": ["Also Paul Bowles, Bob Brown,  Kathleen Cannell, Malcolm Cowley, Hart Crane, Abraham Lincoln Gillespie Jr. (on music), Eugene Jolas (also as Theo Rutra), Marius Lyle, Robert McAlmon, Archibald McLeish Allen Tate; Bryher, Morley Callaghan, Rhys Davies, Robert Graves, Sidney Hunt, Robie Macauley, Laura Riding, Ronald Symond, Dylan Thomas."]}, {"page": "Charles Lahr", "response": ["In 1915 he was interned for four years as an enemy alien in Alexandra Palace. In 1920-22 he was briefly a member of the Communist Party of Great Britain; he was excluded from membership in October 1922 on the grounds of 'political unreliability'.The Communist (London), 28 October 1922, p. 8. His interest in politics led him to befriend many left-wing thinkers, several of whom went on to establish important left-wing groups in the UK. In 1921 he took over the Progressive Bookshop, in Red Lion Street, Holborn. From there he would branch out into publishing, and establish many literary friendships (including H. E. Bates, Rhys Davies, T. F. Powys) and  D. H. Lawrence. At one point when Lahr was in financial difficulties his writer friends gathered a collection of stories together and published these as Charles Wain (1933)."]}, {"page": "Pig in a poke", "response": ["In the April 1929 edition of the literary magazine London Aphrodite, a story by Rhys Davies, titled \"A Pig in a Poke\", was published, in which a Welsh coal miner takes a woman from London for his wife and regrets it. (Boulton 1993: p. 278)"]}, {"page": "1904–1905 Welsh revival", "response": ["* The novels Queen of the Rushes (1906) by Allen Raine, and The Withered Root (1927) by Rhys Davies were inspired by the 1904–1905 Welsh revival."]}, {"page": "Clara Novello Davies", "response": ["The character \"Madame Annie\" in Rhys Davies' The Painted King (1954) is based on Clara Novello Davies."]}, {"page": "Agnes Miller Parker", "response": ["* Rhys Davies et al. – Daisy Matthews and Three Other Tales (GCP, 1932)"]}, {"page": "1978 in Wales", "response": ["*21 August - Rhys Davies, 76, novelist and short story writer"]}, {"page": "1971 in Wales", "response": ["*Rhys Davies - Nobody Answered the Bell"]}, {"page": "1969 in Wales", "response": ["*Rhys Davies – Print of a Hare's Foot"]}, {"page": "1967 in Wales", "response": ["*Rhys Davies wins an Edgar Allan Poe Award for his story \"The Chosen One\", originally published in The New Yorker."]}, {"page": "1957 in Wales", "response": ["*Rhys Davies – The Perishable Quality"]}, {"page": "Clydach Vale", "response": ["* Rhys Davies, novelist, born at 6 Clydach Road, BlaenclydachMeic Stephens, ‘Davies, Rhys  (1901–1978)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 24 April 2010"]}, {"page": "1944 in Wales", "response": ["*Rhys Davies – Black Venus"]}, {"page": "Seren Books", "response": ["Seren's list includes the well-known poets Sheenagh Pugh and Pascale Petit, as well as younger, award-winning Welsh poets Owen Sheers and Kathryn Gray. Novelists include Richard Collins, whose debut work, The Land as Viewed from the Sea, was shortlisted for a Whitbread Award in 2004; and Lloyd Jones whose novel Mr Cassini won the English-language Wales Book of the Year award in 2007. Amongst other writers are Dannie Abse, Mike Jenkins, Ruth Bidgood, Tony Curtis, Rhys Davies, Dic Edwards, Rhian Edwards, Catherine Fisher, Raymond Garlick, Paul Groves, Paul Henry, Glyn Jones, Alun Lewis, Gary Ley, Ivy Alvarez, Christopher Meredith, Edward Thomas, R. S. Thomas and John Tripp.Seren: Authors Retrieved 25 March 2014."]}, {"page": "1935 in Wales", "response": ["*Rhys Davies – Honey and Bread"]}, {"page": "55 Short Stories from the New Yorker", "response": ["*Rhys Davies"]}, {"page": "Literature Wales", "response": ["Literature Wales is the Welsh national literature promotion agency and society of writers, existing to promote Welsh-language and English-language literature in Wales.Official website It offers bursaries for writing projects, runs literary events and lectures, and provides financial assistance for creative mentoring and other literary-based ventures. The organisation also selects the National Poet for Wales, and manages competitions including Wales Book of the Year, the Cardiff International Poetry Competition, and the Rhys Davies Short Story Competition."]}, {"page": "1927 in Wales", "response": ["*Rhys Davies - The Withered Root"]}, {"page": "Rhys Davies", "response": ["Rhys Davies may refer to:", "*Rhys Davies (writer) (1901–1978), Welsh novelist and short story writer", "*Rhys Davies (engineer) (died 1838), American engineer in Richmond, Virginia associated with the Tredegar Iron Works", "*Rhys Davies (politician), British Labour Member of Parliament for Westhoughton from 1921 to 1951", "*Rhys Davies (golfer) (born 1985), Welsh golfer", "*Rhys Davies (canoeist), British slalom canoeist", "*Rhys Davies (rugby union, born February 1998), Welsh rugby union player", "*[Rhys Davies (rugby for Pontypridd  RFC u14 born 5th March 2008)]], welsh rugby player", "*John Rhys Davies (priest) (1890–1953), Welsh priest"]}, {"page": "1901 in Wales", "response": ["*9 November – Rhys Davies, writer (died 1978)"]}, {"page": "Proletarian literature", "response": ["There were a number of Welsh writers who wrote works based on their experiences as coal miners, including novelist (and playwright) Jack Jones (1884–1970), novelists Gwyn Thomas (1913–1981). Lewis Jones (1897–1939), and Gwyn Jones (1907–1999), and poet Idris Davies (1905–53). Jack Jones was a miner's son from Merthyr Tydfil who was himself a miner from the age of 12. He was active in the union movement and politics, starting with the Communist Party, but in the course of his life he was involved, to some degree, with all the major British parties. Amongst his novels of working-class life are Rhondda Roundabout (1935) and Bidden to the Feast (1938). The political development of a young miner is the subject of Cwmardy (1937), Lewis Jones's (1897–1939) largely autobiographical novel. Gwyn Thomas (1913–81) was also a coalminer's son from the Rhondda, but won a scholarship to Oxford and then became a schoolmaster. He wrote 11 novels as well as short stories, plays, and radio and television scripts, most of which focused on unemployment in the Rhondda Valley in the 1930s. Thomas's first accepted book was a collection of short stories, Where Did I Put My Pity: Folk-Tales From the Modern Welsh, which appeared in 1946. Another writer who escaped from his proletarian background was Gwyn Jones (1907–1999). He wrote about this world in novels and short stories, including Times Like These (1936) which explores the life of a working-class family during the 1926 miners' strike. The mining valleys produced a significant working-class poet in Idris Davies (1905–53), who worked as a coal miner before qualifying as a teacher. He initially wrote in Welsh \"but rebellion against chapel religion\", along with the \"inspirational influence of English\" poets, led him to write in English. Gwalia Deserta (1938) is about the Great Depression, while the subject of The Angry Summer (1943) is the 1926 miners' strike. Rhys Davies, author of A Time To Laugh (1937), and Menna Gallie, author of Strike for a Kingdom (1959) and The Small Mine (1962), while not working class, also wrote about life in the mining valleys of South Wales. Harold Heslop, author of the novel The Earth Beneath (1946) was another coal miner, but from the north-east of England, as was Sid Chaplin, who wrote The Thin Seam (1949)."]}, {"page": "List of atheist authors", "response": ["* Rhys Davies (1901–1978): Welsh novelist and short story writer.\"As a boy he attended a nonconformist chapel, and later an Anglican church, but in later life was to declare himself an atheist.\" Meic Stephens: 'Davies, Rhys (1901–1978)', Oxford Dictionary of National Biography, Oxford University Press, 2004  (accessed April 30, 2008)."]}, {"page": "Horizon (magazine)", "response": ["*Rhys Davies"]}, {"page": "List of Edgar Allan Poe Award for Best Short Story winners", "response": ["* 1967 Rhys Davies \"The Chosen One\""]}, {"page": "The Adelphi", "response": ["The Adelphi or New Adelphi was an English literary journal founded by John Middleton Murry and published between 1923 and 1955. The first issue appeared in June 1923, with issues published monthly thereafter. Between August 1927 and September 1930 it was renamed the New Adelphi and issued quarterly. Murry was editor until 1930, when he handed over to Sir Richard Rees and the monthly issues resumed. Rees was succeeded by Max Plowman in 1938.Magazine Data File The magazine included one or two stories per issue with contributions by Katherine Mansfield, D. H. Lawrence, H. E. Bates, Rhys Davies, G.B. EdwardsEdward Chaney, Genius Friend: G.B. Edwards and The Book of Ebenezer Le Page, (Blue Ormer Publishing, 2015) and Dylan Thomas. The Adelphi published George Orwell's \"The Spike\" in 1931 and Orwell contributed regularly thereafter, particularly as a reviewer."]}, {"page": "Meic Stephens", "response": ["Stephens wrote many articles about literature in Wales for the Western Mail, as well as obituaries of eminent Welsh people for The Independent. He took a particular interest in the life and work of Rhys Davies, the novelist and short story writer, and founded and served as secretary of the Rhys Davies Trust, which promoted the writing of short fiction in Wales.", "*Rhys Davies - A Writer's Life (2013. Parthian Books )", "* Rhys Davies Trust - official website"]}, {"page": "Black Venus", "response": ["* The Black Venus, a novel by Rhys Davies"]}, {"page": "Parthian Books", "response": ["Many award-winning individual short stories and poems have later been included in Parthian collections. Most notably, these include 'Mr. Roopratna's Chocolate' from Lewis Davies' Love and Other Possibilities, which won the Rhys Davies Prize in 1999, and 'Moon Dog' from Rebecca F John's Clown's Shoes, which won the PEN International New Voices Award in 2015. Since 2012, Parthian has published Cheval: the annual Terry Hetherington Award anthology. Many of the winners of this award, including Mari Ellis Dunning, Natalie Ann Holborow, Jemma L. King and Joâo Morais, have later released their debut publications with Parthian.", "*A Time to Laugh, Rhys Davies", "*The Withered Root, Rhys Davies"]}, {"page": "Lewis Davies", "response": ["Arthur Lewis Davies (26 January 1913 – 9 December 2011), the younger brother of Rhys Davies, was a Welsh librarian and philanthropist who in his later years established a foundation (the Rhys Davies Trust) devoted to the promotion of Welsh writing in English.", "In 1990, he decided to use the proceeds of substantial bequests to help promote the literary reputation of his brother and other Anglo-Welsh writers.The Rhys Davies Trust  at Literature Wales", "* Rhys Davies Short Story Competition Anthologies at Literature Wales. Accessed 7 April 2012."]}, {"page": "British regional literature", "response": ["** Rhys Davies (1901–1978) – the Rhondda Valley, South Wales"]}, {"page": "Fred Urquhart (writer)", "response": ["Urquhart was homosexual. He moved to Ashdown Forest in East Sussex in 1958 with his companion, the dancer Peter Wyndham Allen, but when Wyndham Allen died in 1990 Urquhart moved back to Scotland. He was a friend of Rhys Davies, with whom he shared a cottage in Tring in 1946, and of Norah Hoult."]}, {"page": "Now (1940–1947 magazine)", "response": ["*Rhys Davies"]}, {"page": "1968 Birthday Honours", "response": ["* Rhys Davies, Author."]}, {"page": "Jo Mazelis", "response": ["She has won a prize in the Rhys Davies Short Story Award five times, was longlisted for the Asham Award and received prizes in the PenFRO PenFRO 2014 winners retrieved 2017-10-20 and Allen Raine competitions.Allen Raine website retrieved 2017-10-20."]}, {"page": "2018 in Wales", "response": ["*Meic Stephens – Rhys Davies – A Writer's Life"]}]}}