{"wiki_id": "http://www.wikidata.org/entity/Q3400440", "itemLabel": "Daniel Rowland", "itemDescription": "Welsh Calvinistic Methodist leader", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Rowland_(preacher)", "wikipedia_page": {"main": "Daniel Rowland (also spelt Rowlands, 1713 – 16 October 1790) served as an Evangelist and early on as an Anglican curate. He was one of the foremost figures in the Welsh Calvinistic Methodist revival, along with the evangelist Howell Harris and the hymnist William Williams. For 55 years Daniel Rowland was one of the leading evangelists in Wales.", "link_mentions": [{"page": "Evangelicalism", "response": ["The spring of 1735 also marked important events in England and Wales. Howell Harris, a Welsh schoolteacher, had a conversion experience on May 25 during a communion service. He described receiving assurance of God's grace after a period of fasting, self-examination, and despair over his sins. Sometime later, Daniel Rowland, the Anglican curate of Llangeitho, Wales, experienced conversion as well. Both men began preaching the evangelical message to large audiences, becoming leaders of the Welsh Methodist revival. At about the same time that Harris experienced conversion in Wales, George Whitefield was converted at Oxford University after his own prolonged spiritual crisis. Whitefield later remarked, \"About this time God was pleased to enlighten my soul, and bring me into the knowledge of His free grace, and the necessity of being justified in His sight by faith only\"."]}, {"page": "John Wesley", "response": ["In 1770, the controversy broke out anew with violence and bitterness, as people's view of God related to their views of men and their possibilities. Augustus Toplady, Daniel Rowland, Sir Richard Hill and others were engaged on one side, while Wesley and Fletcher stood on the other. Toplady was editor of The Gospel Magazine, which had articles covering the controversy."]}, {"page": "History of Wales", "response": ["The 18th century also saw the Welsh Methodist revival, led by Daniel Rowland, Howell Harris and William Williams Pantycelyn.Jenkins, G.H. The foundations of modern Wales pp. 347–50 In the early 19th century the Welsh Methodists broke away from the Anglican church and established their own denomination, now the Presbyterian Church of Wales. This also led to the strengthening of other nonconformist denominations, and by the middle of the 19th century Wales was largely Nonconformist in religion. This had considerable implications for the Welsh language as it was the main language of the nonconformist churches in Wales. The Sunday schools which became an important feature of Welsh life made a large part of the population literate in Welsh, which was important for the survival of the language as it was not taught in the schools."]}, {"page": "List of Welsh people", "response": ["*Daniel Rowland (1713–1790), Methodist preacher in the Welsh Revival"]}, {"page": "Howell Harris", "response": ["Howell Harris (; 23 January 1714 – 21 July 1773) was a Calvinistic Methodist evangelist. He was one of the main leaders of the Welsh Methodist revival in the 18th century, along with Daniel Rowland and William Williams Pantycelyn.", "In 1750 Harris retreated to his home at Trefeca, having fallen out with a fellow evangelist, Daniel Rowland, and become the subject of public scandal for his close friendship with \"Madam\" Sidney Griffith. In 1752 he was inspired by the example of the Moravians to found a religious community there known as Teulu Trefeca (The Trefeca family) with himself as \"Father\"."]}, {"page": "William Williams Pantycelyn", "response": ["William Williams, PantycelynGlyn Tegai Hughes, Meic Stephens and R. Brinley Jones (eds), Writers of Wales – Wiliams Pantycelyn, University Press of Wales on behalf of the Welsh Arts Council, 1983. p. 2. (c. 11 February 1717 – 11 January 1791), also known as William Williams, Williams Pantycelyn, and Pantycelyn, is generally seen as Wales's premier hymnist. He is also rated as one of the great literary figures of Wales, as a writer of poetry and prose. In religion he was among the leaders of the 18th-century Welsh Methodist revival, along with the evangelists Howell Harris and Daniel Rowland.", "Welsh Methodism predates 1739 and can be traced back to the conversions of the two main leaders of the Welsh Methodists, Howell Harris and Daniel Rowland, in 1735. It was an indigenous, parallel movement to its sister movement in England, and the Welsh Methodists were mainly Calvinists, who worked much more closely with George Whitefield than they did with John Wesley.", "He also wrote a series of elegies in memory of various Methodist and other Christian leaders, including: Griffith Jones of Llanddowror, Howel Davies (the Pembrokeshire preacher), George Whitefield, and Daniel Rowland."]}, {"page": "Ceredigion", "response": ["Pen-y-wenallt was home to 17th century theologian and author, Theophilus Evans. In the 18th century there was an evangelical revival of Christianity, and nonconformism became established in the county as charismatic preachers like Daniel Rowland of Llangeitho attracted large congregations. Every community built its own chapel or meeting house, and Cardiganshire became one of the centres of Methodism in Wales; the Aeron Valley was at the centre of the revival."]}, {"page": "First Great Awakening", "response": ["The Evangelical Revival first broke out in Wales. In 1735, Howell Harris and Daniel Rowland experienced a religious conversion and began preaching to large crowds throughout South Wales. Their preaching initiated the Welsh Methodist revival."]}, {"page": "List of Christian preachers", "response": ["* Daniel Rowland (1713–1790)"]}, {"page": "Llangeitho", "response": ["The village is linked with Daniel Rowland, born here in 1713, and the Welsh Methodist revival in the 18th century. Rowland served as curate at Llangeitho and Nantcwnlle. The village chapel, built in 1760, became famous throughout Wales as a Calvinistic Methodist centre. Thousands visited it to hear the preaching. Rowland was buried in the village and there remains a memorial column to him. Larger replacement chapels were built in 1764 and 1814."]}, {"page": "Welsh Methodist revival", "response": ["The Welsh Methodist revival was an evangelical revival that revitalised Christianity in Wales during the 18th century. Methodist preachers such as Daniel Rowland, William Williams and Howell Harris were heavily influential in the movement. The revival led eventually to the establishment of the Welsh Calvinistic Methodists as a denomination (now more commonly known as the Presbyterian Church of Wales) and it also revitalised older dissenting churches.", "Many  consider Griffith Jones (1684–1761), the rector of Llanddowror, Carmarthenshire to have been a forerunner of the Methodist movement in Wales. Through his circulating schools he taught thousands in Wales to read the Bible and created a generation of people which would be receptive to Methodist ideas. He himself also preached in the open air as later Methodist leaders would do. In fact, the newly converted Harris visited him for spiritual guidance and direction, and it was through his preaching that Daniel Rowland was converted and began to preach Methodist ideas."]}, {"page": "Presbyterian Church of Wales", "response": ["The church was born out of the Welsh Methodist revival and the preaching of Howell Harris and Daniel Rowland in the 18th century and seceded from the Church of England in 1811. In 1823, a Confession of Faith was created and adopted, based on the standard Westminster Confession.www.ebcpcw.org.uk/english/about/beliefs Theological colleges for ministerial training were opened in Bala, then in Merionethshire, now Gwynedd (1837), Trefeca, then in Brecknockshire, now Powys (1842), and Aberystwyth, in Ceredigion (1906). It produces a quarterly journal Y Traethodydd and a monthly periodical the Treasury. It is distinguished from other forms of Methodism by the Calvinistic nature of its theology. For the history of the church, see Calvinistic Methodists. In 1840, the Foreign Missionary Society was formed in Liverpool to provide missionaries to India. It held its first General Assembly in 1864. In 1928 it officially adopted the name Presbyterian Church in Wales but still retained the name Welsh Calvinistic Methodism with equal standing. In 1933 its constitution was modified as a result of the Presbyterian Church in Wales Act of Parliament in 1933, receiving Royal assent.www.reformiert-online.net/adressen/detail.php?id=1467&lg=eng In 1947 the Association in the East was established for English-speaking churches. In 1978 Pamela Turner became the first woman to be ordained as a minister. In 2004 the central office moved to Whitchurch, Cardiff. In 2007 new boundaries and structures was adopted for presbyteries.www.ebcpcw.org.uk/english/about/our-history It claims to be the only truly Welsh denomination in Christianity, and is rare among Presbyterian Churches, by originating in the Methodist Revival rather than deriving from the Calvinist Reformation.www.oikoumene.org/en/member-churches/presbyterian-church-of-waleswww.british-history.ac.uk/report.aspx?compid=38767"]}, {"page": "Griffith Jones (priest)", "response": ["Daniel Rowland was converted through his preaching."]}, {"page": "Martyn Lloyd-Jones", "response": ["Lloyd-Jones was born in Cardiff on 20 December 1899 and raised in Llangeitho, Cardiganshire. His father was a grocer, and he had two brothers: Harold died during the 1918 flu pandemic, while Vincent went on to become a High Court judge.  Llangeitho is associated with the Welsh Methodist revival, as it was the location of Daniel Rowland's ministry. Attending a London grammar school between 1914 and 1917 and then St Bartholomew's Hospital as a medical student, in 1921 he started work as assistant to the Royal Physician, Sir Thomas Horder. Lloyd-Jones obtained a medical degree from the University of London, and became a Member of the Royal College of Physicians.  After struggling for two years over what he sensed was a calling to preach, in 1927 Lloyd-Jones returned to Wales, having married Bethan Phillips (with whom he later had two children, Elizabeth and Ann), accepting an invitation to minister at a church in Aberavon (Port Talbot)."]}, {"page": "Thomas Charles", "response": ["Charles had been influenced by the great revival movement in Wales, and at the age of seventeen had been converted by a sermon of Daniel Rowland. This was enough to make him unpopular with many of the Welsh clergy, and being denied the privilege of preaching for nothing at two churches, he helped his old Oxford friend John Mayor, now vicar of Shawbury, Shropshire, from October until 11 January 1784. On 25 January he took charge of Llanymawddwy (14 miles from Bala), but was forced to leave after three months, because three influential people, including the rector of Bala, had persuaded his rector to dismiss him. His preaching, his catechizing of the children after evensong, and his connection with the Bala Methodists, his wife's stepfather being a Methodist preacher, gave great offence. After a fortnight more at Shawbury, he wrote to John Newton and another clergyman friend in London for advice. The Church of England denied him employment, and the Methodists desired his services. His friends advised him to return to England, but it was too late. In September, accompanied by Henry Newman (his rector at Shepton Beauchamp and Sparkford), he went on a tour in Caernarfonshire. In December, he was preaching at the Bont Uchel Association; and he joined the Methodists in 1784."]}, {"page": "Penrhyndeudraeth", "response": ["The town has not always been very religious. Early in the history of the Methodists, they established chapels, and fellowship meetings (seiadau) were established. There is a history of revivalists such as Daniel Rowland who held meetings at Tyddyn Isaf and the poet Dafydd Siôn Siâms who publicly cursed the new religion before himself being converted. He chastised the Methodists mercilessly before burning all their critical poetic works in a public bonfire in the village square. The Old Methodists' original communion chalice is to be seen in the National Library in Aberystwyth. The town was originally in two Anglican parishes, Llanfrothen and Llandecwyn. Holy Trinity church was built in 1858 and a new parish of Penrhyndeudraeth was created in 1897."]}, {"page": "Calvinistic Methodists", "response": ["==Daniel Rowland and Howell Harris==", "Griffith Jones, preaching at Llanddewi Brefi, Cardiganshire found Daniel Rowland (1713–1790), curate of Llangeitho, in his audience, and his patronising attitude in listening drew from the preacher a personal supplication on his behalf in the middle of the discourse. Rowland was deeply moved, and became an ardent apostle of the new movement. Naturally a fine orator, his new-born zeal gave an edge to his eloquence, and his fame spread abroad.Evans, Rev John, A memoir of the Rev. Daniel Rowlands (1840)"]}, {"page": "Hereford Cathedral School", "response": ["*Daniel Rowland, Welsh Calvinistic Methodist preacher"]}, {"page": "Allen Raine", "response": ["whose father was a lawyer and the grandson of David Davis (1745–1827). Allen Raine's mother was also the granddaughter of Daniel Rowland."]}, {"page": "1790s in Wales", "response": ["**16 October - Daniel Rowland, Methodist leader, 77"]}, {"page": "1770s in Wales", "response": ["*Daniel Rowland - Pum Pregeth ac Amryw o Hymnau (1772)"]}, {"page": "1750s in Wales", "response": ["*Daniel Rowland - Ymddiddan rhwng Methodist Uniawngred ac un Cyfeiliornus"]}, {"page": "1740s in Wales", "response": ["*Howell Harris & Daniel Rowland - Sail, Dibenion, a Rheolau'r Societies (collection of hymns)"]}, {"page": "1710s in Wales", "response": ["*approximate date - Daniel Rowland, Methodist leader (d. 1790)"]}, {"page": "1790 in Wales", "response": ["*16 October - Daniel Rowland, Methodist leader, c.79"]}, {"page": "1772 in Wales", "response": ["*Daniel Rowland - Pum Pregeth ac Amryw o Hymnau"]}, {"page": "Welsh-language literature", "response": ["In the 18th century the trend towards religious literature continued and grew even stronger as Nonconformism began to take hold in Wales. The Welsh Methodist revival, initially led by Howell Harris and Daniel Rowland, produced not only sermons and religious tracts, but also hymns and poetry by William Williams Pantycelyn, Ann Griffiths and others. The Morris brothers of Anglesey were leading figures in the establishment of the London Welsh societies, and their correspondence is an important record of the time. The activities of the London Welshmen helped ensure that Wales retained some kind of profile within Britain as a whole."]}, {"page": "Rowley Thomas", "response": ["He was also a leading member of the Carmarthenshire Hunt, and at his funeral his hunting clothes and boots were placed alongside him in his coffin. Thomas was also a descendant of Daniel Rowland the Methodist cleric."]}, {"page": "1769 in Wales", "response": ["**Daniel Rowland turns down the living of Newport, Pembrokeshire, to stay with his congregation at Llangeitho."]}, {"page": "1737 in Wales", "response": ["*13 August - Howel Harris and Daniel Rowland meet for the first time, at Defynnog."]}, {"page": "1742 in Wales", "response": ["*Howell Harris, Daniel Rowland and their converts form the Methodist Association in Wales.  One of these, William Prichard, is exiled with his family from Glasfryn Fawr and relocates to Plas Penmynydd, Anglesey."]}, {"page": "Sidney Griffith", "response": ["In 1746, Sidney Griffith heard a sermon by a Methodist preacher, Peter Williams, and began to follow Methodist teachings.  In 1748 she came into contact with the charismatic Methodist leader Howell Harris, and later with his colleague Daniel Rowland.  After a quarrel with her husband over money, she sought refuge with the Methodist \"family\" at Trefeca, but her close friendship with Harris made her unpopular with some of his followers and particularly with his fellow Methodist leader George Whitefield. It was a contributory factor in Harris's falling-out with Rowland."]}, {"page": "1734 in Wales", "response": ["**Daniel Rowland marries Eleanor Davies of Caer-llugest and is ordained a deacon."]}, {"page": "Wesleyan Methodist Church (Great Britain)", "response": ["The Wesleyan Methodist Church was the name used by the majority Methodist movement in England following its split from the Church of England after the death of John Wesley and the appearance of parallel Methodist movements. The word Wesleyan in the title differentiated it from the Welsh Calvinistic Methodists (who were a majority of the Methodists in Wales) and from the Primitive Methodist movement, which separated from the Wesleyans in 1807.Molland, E. (1959) Christendom. London: A. R. Mowbray; pp. 267-70 The Wesleyan Methodist Church followed the Wesleys in holding to an Arminian theology, in contrast to the Calvinism held by George Whitefield, by Selina Hastings (founder of the Countess of Huntingdon's Connexion), and by Howell Harris and Daniel Rowland, the pioneers of Welsh Methodism. Its Conference was also the legal successor to John Wesley as holder of the property of the original Methodist societies.Davies, R. E. (1985) Methodism, 2nd ed. Peterborough: Epworth Press. ; p. 109."]}, {"page": "1750 in Wales", "response": ["*\"Disruption of 1750\": Howell Harris and Daniel Rowland quarrel, resulting in a lasting split in the Welsh Methodist movement.", "*Daniel Rowland - Ymddiddan rhwng Methodist Uniawngred ac un Cyfeiliornus"]}, {"page": "Christian revival", "response": ["The 18th century Age of Enlightenment had two camps: those who identified humans as only intellectual beings, Rationalists, and those who believed humans to be only passionate beings, followers of Romanticism. The philosophy of Earl of Shaftesbury III led to a Proto-Romanticism that mixed with Christian worship to produce a tertium quid. The Methodist revival of John Wesley, Charles Wesley and George Whitefield in England and Daniel Rowland, Howel Harris and William Williams, Pantycelyn in Wales and the Great Awakening in America prior to the Revolution. A similar (but smaller scale) revival in Scotland took place at Cambuslang, then a village and is known as the Cambuslang Work.A. Fawcett, The Cambuslang Revival: the Scottish Evangelical Revival of the eighteenth century (Banner of Truth Trust, London, 1971)."]}, {"page": "1743 in Wales", "response": ["*Daniel Rowland & Ralph Erskine - Traethawd am farw i'r ddeddf, a byw i Dduw"]}, {"page": "Edward Jones (Methodist preacher)", "response": ["In 1774 he began to hold Welsh-language services in Cock Lane, Smithfield; and in 1785 he established, and became pastor of, a Welsh Calvinistic Methodist chapel in Wilderness Row (now Clerkenwell Road), Clerkenwell.Jones 2001, pp. 82, 95. However, he managed to alienate a number of members of his congregation, particularly when he expelled two granddaughters of the prominent Welsh Calvinistic Methodist leader Daniel Rowland for marrying \"outside the Connexion\". "]}, {"page": "Nonconformity in Wales", "response": ["Nonconformity was a major religious movement in Wales from the 18th to the 20th centuries. The Welsh Methodist revival of the 18th century was one of the most significant religious and social movements in the modern history of Wales. The revival began within the Church of England in Wales, partly as a reaction to the neglect generally felt in Wales at the hands of absentee bishops and clergy. For two generations from the 1730s onwards the main Methodist leaders such as Howell Harris, Daniel Rowland and William Williams Pantycelyn remained within the Church of England, but the Welsh revival differed from the Methodist revival in England in that its theology was Calvinist rather than Arminian. Methodists in Wales gradually built up their own networks, structures, and meeting houses (or chapels), which led, at the instigation of Thomas Charles, to the secession of 1811 and the formal establishment of the Calvinistic Methodist Presbyterian Church of Wales in 1823."]}, {"page": "Kilsby Jones", "response": ["Kilsby established himself as one of the most popular exponents of the public lecture in the Welsh language. He usually lectured on religious figures such as Rhys Pritchard, Vicar of Llandovery and Daniel Rowland, the Methodist pioneer. These lectures were often associated with raising funds for chapel building. For example, Kilsby lectured on Rowland at Cwmavon in December 1869, with the funds going towards the building of a new chapel at Rock, Cwmavon, The \"chief inhabitants\" of the valley were reported to be present at the event."]}, {"page": "Philip Pugh", "response": ["Pugh avoided controversy, but he regarded with abhorrence the Arminian doctrines introduced by Jenkin Jones and the Arian doctrines propagated by David Lloyd (1725–1779). He sympathised, however, with the Calvinistic Methodist movement under Daniel Rowlands, and induced Rowlands to modify the ferocity of his early manner of preaching. Of the churches with which Pugh was more or less connected, three continue to be congregationalist, three have gone over to the Methodists, and three are Unitarian."]}, {"page": "Daniel Rowland", "response": ["Daniel Rowland may refer to:", "* Daniel Rowland (preacher) (1711–1790), leader in the Welsh Calvinistic Methodist revival", "* Daniel Rowland (runner) (born 1984), Zimbabwean long-distance trail runner", "* Daniel Rowland (cricketer) (1826–1891), English cricketer", "* Daniel Rowland (conductor), (born 1972), conductor and violinist"]}, {"page": "Philip Dafydd", "response": ["The poetical works of Dafydd include elegies on Daniel Rowland (printed in 1797) and William Williams Pantycelyn (printed in 1791)."]}, {"page": "Eifion Evans (church historian)", "response": ["Evans wrote several books about Christianity in Wales, including accounts of the revivals of 1859 and 1904–05, as well as biographies of Daniel Rowland, Howell Harris, and William Williams Pantycelyn."]}, {"page": "1711 in Wales", "response": ["**Daniel Rowland, Methodist leader (died 1790)"]}]}}