{"wiki_id": "http://www.wikidata.org/entity/Q3401572", "itemLabel": "Robert ap Huw", "itemDescription": "Welsh harpist and copyist", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_ap_Huw", "wikipedia_page": {"main": "Robert ap Huw (or Hugh; c.1580 – 1665), was a Welsh harpist and music copyist. He is most notable for compiling a manuscript, now known as the Robert ap Huw manuscript, which is the main extant source of cerdd dant and is a late medieval collection of harp music. It is one of the most important sources of early Welsh music.", "link_mentions": [{"page": "List of Welsh people", "response": ["*Robert ap Huw (c.1580–1665), harpist"]}, {"page": "Tremolo", "response": ["There is some speculation that tremolo was employed in medieval Welsh harp music, as indicated in the transcription by Robert ap Huw."]}, {"page": "Historically informed performance", "response": ["*The music may be written using alternative, non-modern notations, such as tablature. Some tablature notations are only partially decoded, such as the notationPeter Greenhill, The Robert ap Huw Manuscript: An Exploration of its Possible Solutions, 5 vols. (all), Bangor: University of Wales, CAWMS dissertation, 1995–2000. in the harp manuscriptThurston Dart, \"Robert ap Huw's Manuscript of Welsh Harp Music\", The Galpin Society Journal, Vol 21 (1963). . by Robert ap Huw."]}, {"page": "Music of Wales", "response": ["Wales has a history of using music as a primary form of communication. Harmony and part singing is synonymous with Welsh music. Examples of well-developed, vertical harmony can be found in the Robert ap Huw Manuscript dating back to the 1600s. This text contains pieces of Welsh music from the fourteenth and fifteenth centuries that show amazing harmonic development. ", "The earliest written records of the Welsh harpists' repertoire are contained in the Robert ap Huw manuscript, which documents 30 ancient harp pieces that make up a fragment of the lost repertoire of the medieval Welsh bards. The music was composed between the 14th and 16th centuries, transmitted orally, then written down in a unique tablature and later copied in the early 17th century. This manuscript contains the earliest body of harp music from anywhere in Europe and is one of the key sources of early Welsh music. The manuscript has been the source of a long-running effort to accurately decipher the music it encodes."]}, {"page": "Pibroch", "response": ["Karen Marshalsay is a Scottish harper who performed with Allan MacDonald in his 2004 Edinburgh International Festival series of pibroch concerts From Battle Lines to Bar Lines, performing The Battle of The Bridge of Perth and other pibrochs on wire-strung clarsach.  She also performed pibroch on wire-strung clarsach and music from the Robert ap Huw ms on bray harp at the National Piping Centre’s 2013  concert. She later recorded The Battle of the Bridge of Perth in a 2019 released solo CD.The Road to Kennacraig 2019 Cramasie Records.", " is being situated within a broader medieval cultural milieu in the British Isles through the revival of early Welsh  (\"string music\").The term  in its common modern Welsh usage has become synonymous with  (verse singing) which originated in the 18th century. This was improvised singing over European and particularly Italian baroque influenced Welsh melodies that were largely composed from the 1700s onwards and played on chromatic European triple harps or later modern pedal harps. It has little relationship with medieval or early  bardic art music composed up until the 1600s and played on diatonic bray harps. This genre of Irish influenced medieval Welsh music offers a precedent for Scottish pibroch as an aristocratic extended art music played on the harp with a repeated melodic theme or ground and elaborate formal variations.Frans Buisman \"A Parallel between Scottish Pibroch and Early Welsh Harp Music\",  / Welsh Music History Volume 6, November 2004. Welsh Cerdd Dant repertoire from the late-Middle Ages was documented in the  manuscripts in the 17th century by Robert ap Huw as a binary system of tabulature notation.The Robert ap Huw manuscript, Musica, B. M. Addl. MS 14905, Cardiff: University of Wales Press Board, 1936. Hinrichsen Edition, #378.See also: Music of the Robert ap Huw Manuscript, Bangor University.", "Bill Taylor is an early Scottish and Welsh harper who is researching, reconstructing and recording definitive performances of early  music on replica historical gut-strung Romanesque harps and late-medieval bray harps.Bill Taylor, Two Worlds of the Welsh Harp, (CD) 1999. Dorian DOR-90260. Audio samples of \"/Caniad of the white piper\" (Robert ap Huw MS, pp.36-37) and \"\" (Robert ap Huw MS, pp.15-17) from this CD, played on a replica bray-harp, are available online on http://www.triplepipe.net/measures.html, a web resource by Barnaby Brown on the binary measures that characterise the  harp notation.Bill Taylor, Musica, (CD) 2010. Taith, TRCD011.  Taylor has published extensive online resources outlining this applied performance-based research.Bill Taylor, \"Medieval Welsh Bardic Music:  Interpreting the Robert ap Huw MS.\", available online: http://spanglefish.com/billtaylor/index.asp?pageid=74247; Bill Taylor, video of live performances of music from ap Huw MS., The Sound World of , Symposium on the poetry of Dayfdd ap Gwilym, Swansea, 4 April 2007.  Taylor and Irish wire-strung harpist Paul Dooley discuss and perform demonstrations of the ap Huw music in the recent BBC documentary History of the Harp.Bill Taylor and Paul Dooley, in History of the Harp with Catrin Finch, Television Documentary, BBC4, 2007. Videos available online on YouTube: Part 1 (from 9.15sec), continued on Part 2.", "There is debate over the interpretation of references in Welsh manuscripts to the role of gut-strung and horse hair-strung bray harps in the late-Middle Ages. Taylor considers these to be the authentic instruments for the performance of .Bill Taylor, Medieval Welsh Bardic Music: Interpreting the Robert ap Huw MS. Bill Taylor website.  Heymann and Chadwick are contributing to a research project to reconstruct an early Welsh horse hair-strung bray harp, testing this theory through application. - Project Telyn Rawn, website, with audio file excerpt of a demonstration performance of \"\" by Ann Heymann on an experimental horse-hair strung Ardival Gothic bray harp or .", "Paul Dooley has researched and recorded a dedicated album of ap Huw compositions played on a replica early Irish wire-strung clairseach harp.Paul Dooley \"Music from the Robert Ap Huw Manuscript Vol 1\" (CD), 2004. Paul Dooley. Ann Heymann has researched the ap Huw manuscript with a particular focus on the interpretation of the notation of playing techniques that are comparable to the Irish wire-strung harp techniques noted down by Edward Bunting in the late 18th century.Ann Heymann, \"Biography,\" Ann Heymann.com website. She has recorded \"\", one of the oldest compositions in the  repertoire on a replica early Irish wire-strung clairseach harp.Ann Heymann, \"\", on  • Harp Of Gold (CD), 2006. Ann Heymann, CMC0706D. Simon Chadwick also includes this piece in his live repertoire, played on a replica early Scottish Queen Mary wire-strung clarsach harp.See also: Simon Chadwick, \"Kaniad San Silin\", Robert ap Huw MS,  a live demonstration performance on a replica Queen Mary medieval wire-strung clarsach harp. Video excerpt available online via YouTube."]}, {"page": "Bragod", "response": ["Robert Evans plays the crwth and the six-stringed lyre, while Mary-Anne Roberts sings with a distinctive rather buzzing style. They use Pythagorean tuning. Their interpretation of the older music is based on Evans's research on the Robert ap Huw Manuscript in the British Library."]}, {"page": "Robert ap Hugh", "response": ["#REDIRECT Robert ap Huw"]}, {"page": "Robert Ap Huw", "response": ["#REDIRECT Robert ap Huw"]}, {"page": "Robert Ap Hugh", "response": ["#REDIRECT Robert ap Huw"]}, {"page": "List of harpists", "response": ["* Robert ap Huw"]}, {"page": "The Woodland Mass", "response": ["The Scottish composer John Hearne's Offeren y Llwyn or Woodland Worship (1958) is a cantata for chorus and strings, setting Dafydd's poem in the original Welsh and in an alternative English version.  Jeffrey Lewis's \"The Woodland Mass\", a short choral setting, dates from 1976.  The folk duo Bragod, comprising Mary-Anne Roberts and Robert Evans, included on their album Llatai a performance of Dafydd's poem to music drawn from the works of the 17th-century harpist Robert ap Huw."]}]}}