{"wiki_id": "http://www.wikidata.org/entity/Q3403049", "itemLabel": "Brian Edrich", "itemDescription": "English cricketer (1922-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Edrich", "wikipedia_page": {"main": "Brian Robert Edrich (18 August 1922 – 31 May 2009) was an English cricketer who played first-class cricket for Kent and Glamorgan between 1947 and 1956. He was a member of the Edrich cricketing family from Norfolk. His three brothers, Eric, Geoff and Bill, and his cousin, John, all played first-class cricket.\n\n", "link_mentions": [{"page": "John Edrich", "response": ["John Hugh Edrich,  (21 June 1937 – 23 December 2020) was an English first-class cricketer who, during a career that ran from 1956 to 1978, was considered one of the best batsmen of his generation. Born in Blofield, Norfolk, Edrich came from a cricketing family, his four cousins, Eric Edrich, Bill Edrich, Geoff Edrich and Brian Edrich, all having played first-class cricket. He was educated at the private Bracondale School between the ages of eight and seventeen, during which time he played cricket at weekends and was coached by former cricketer C. S. R. Boswell."]}, {"page": "List of International cricket families", "response": ["Brian Edrich, Eric Edrich and Geoff Edrich were brothers of Bill, who also played first-class cricket."]}, {"page": "B.R.Edrich", "response": ["#redirect Brian Edrich"]}, {"page": "B. R. Edrich", "response": ["#REDIRECT Brian Edrich"]}, {"page": "Fred Ridgway", "response": ["Though in 1948 he was badly affected by injury, 1949 proved to be Ridgway's best year, for he took 105 wickets for 22.88 runs each, which ranked him as the fourth-best pace bowler in the country after Bedser, Gladwin and Les Jackson. Ridgway's most notable performance was on the featherbed Trent Bridge wicket, where he took six for 79 in the first innings, and paved the way for an easy Kent victory. Apart from teammate Doug Wright in the second innings, no visiting bowler at Trent Bridge bettered those figures all year, but Ridgway's most notable feat that year was his striking consistency: with only one haul of eight or more in a match he still took 90 wickets in 20 county games. Moreover, playing against Sussex,Cricketarchive.com Ridgway \"shared in a record partnership of 161 for the ninth wicket\" with Brian Edrich.Cricketarchive.com This partnership, just under half the total of 379, was made in a losing cause."]}, {"page": "1947 English cricket season", "response": ["Kent improved from seventh to fourth and were able to announce increased attendances and membership. The team was again captained by Bryan Valentine and featured England stars Godfrey Evans and Doug Wright, though they missed several championship matches for Test calls. Kent were particularly well served by their batsmen, although Valentine had problems with loss of form at times. Les Ames, Les Todd and Arthur Fagg all scored more than 2,000 runs in the season. The young left-hander Peter Hearn was regarded as a fine prospect and was awarded his county cap. Wright was the main bowler and was supported by off spinner Ray Dovey, all-rounder Jack Davies and the two pacemen Fred Ridgway and Norman Harding. Harding died unexpectedly in September, aged 31.Wisden 1948 – obituary, p. 783. Other players included Geoffrey Anson, Brian Edrich, the veteran Hopper Levett in his final season, Tony Mallett, future captain Bill Murray-Wood and Tony Pawson. A curious case was pace bowler Jack Martin, who played for Kent only twice in 1947 and yet was selected to play for England in the Trent Bridge Test.Playfair, pp. 89–90."]}, {"page": "Edrich", "response": ["* Brian Edrich (1922–2009), English cricketer, Kent and Glamorgan batsman"]}, {"page": "List of Kent County Cricket Club players", "response": ["* Brian Edrich (1947–1953) : B. R. Edrich"]}, {"page": "2009 in Wales", "response": ["*31 May - Brian Edrich, former Glamorgan cricket coach, 86"]}, {"page": "Deaths in May 2009", "response": ["*Brian Edrich, 86, British cricketer."]}, {"page": "Norman Owen", "response": ["Having played for the Surrey Second XI in 1934 and 1935 in the Minor Counties Championship, Owen joined Durham following World War II.  He made his debut for the county in the Minor Counties Championship against the Yorkshire Second XI.  He played Minor counties cricket for Durham from 1947 to 1955, making 59 appearances for the county.  He made a single first-class appearance for the Minor Counties against Kent in 1951.  In this match, he was dismissed in the Minor Counties first-innings by Brian Edrich for 14 runs, while in their second-innings (in which they followed-on) he scored 12 runs before being dismissed by the same bowler.  In Kent's only innings, he took the wicket of Dicky Mayes for the cost of 33 runs from 14 overs.  Kent went on to win the match by an innings and 10 runs."]}, {"page": "Leonard Hemming", "response": ["Early in his life he emigrated to Australia with his parents, before returning to England in the mid–1930s. Hemming made his debut for Oxfordshire against Berkshire in the 1946 Minor Counties Championship. He played minor counties cricket for Oxfordshire from 1946 to 1954, making 42 appearances, the last of which came against Cornwall in the 1954 Minor Counties Championship. Playing minor counties cricket for Oxfordshire allowed Hemming to represent the combined Minor Counties cricket team, who he made a single first-class appearance for against Kent in 1951 at the St Lawrence Ground, Canterbury. Kent batted first and made 365/8 declared, with Hemming taking the wicket of Brian Edrich, to finish with figures of 1/60 from 23 overs. The Minor Counties responded in their first-innings by making 169 all out, with Hemming being dismissed by Ted Witherden for 14 runs. Forced to follow-on in their second-innings, where they were dismissed for 186, with Hemming himself 14 runs before he was dismissed by Edrich."]}, {"page": "List of Glamorgan County Cricket Club players", "response": ["* Brian Edrich (1954–1956) : B. R. Edrich"]}, {"page": "Edrich, Brian", "response": ["#redirectBrian Edrich"]}]}}