{"wiki_id": "http://www.wikidata.org/entity/Q3402352", "itemLabel": "Henry Newbolt", "itemDescription": "English poet and writer (1862-1938)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Newbolt", "wikipedia_page": {"main": "Sir Henry John Newbolt, CH (6 June 1862 – 19 April 1938) was an English poet, novelist and historian. He also had a role as a government adviser with regard to the study of English in England. He is perhaps best remembered for his poems \"Vitaï Lampada\" and \"Drake's Drum\".\n\n", "link_mentions": [{"page": "List of English-language poets", "response": ["*Henry Newbolt (1862–1938, E)"]}, {"page": "June 6", "response": ["*1862 – Henry Newbolt, English historian, author, and poet (d. 1938)"]}, {"page": "Joseph Conrad", "response": ["A striking portrait of Conrad, aged about 46, was drawn by the historian and poet Henry Newbolt, who met him about 1903:"]}, {"page": "William Morris", "response": ["Sir Henry Newbolt's medieval allegorical novel Aladore was influenced by Morris's fantasies. James Joyce also drew inspiration from his work."]}, {"page": "1914 in literature", "response": ["*September 2 – Charles Masterman invites 25 \"eminent literary men\" to Wellington House in London to form a secret British War Propaganda Bureau. Those who attend include William Archer, Arnold Bennett, Hall Caine, G. K. Chesterton, Arthur Conan Doyle, Ford Madox Hueffer, John Galsworthy, Thomas Hardy, Rudyard Kipling, John Masefield, Henry Newbolt, Gilbert Parker, G. M. Trevelyan and H. G. Wells. Kipling soon afterwards writes the poem \"For all we have and are\". W. B. Yeats, however, refuses to sign a letter of support for the War signed by most of the participants and published in The Times on September 18."]}, {"page": "1938 in literature", "response": ["*April 19 – Sir Henry Newbolt, English poet (born 1862)"]}, {"page": "1862 in literature", "response": ["*June 6 – Henry Newbolt, English poet (died 1938)"]}, {"page": "Charles Villiers Stanford", "response": ["In a 1981 survey of Stanford's operas, the critic Nigel Burton writes that Shamus O'Brien lacks good tunes, and that the only memorable melody in it is not by Stanford but is an English folk song, \"The Glory of the West.\"Burton, p. 349 Burton is more dismissive of The Critic, which he describes as \"a poor man's Ariadne auf Naxos.\" Dibble rates The Critic much higher, considering it to be one of Stanford's two best operas. In 1921, Porte wrote that it contains music that is \"remarkably fresh, melodious and thoroughly individual in character and outlook. The vocal and instrumental writing is done with consummate skill.\"Porte, p. 107 Burton praises Much Ado About Nothing, judging it to contain some of Stanford's best operatic music. He rates the last of the composer's operas, The Travelling Companion as his finest operatic achievement, though Burton credits much of its power to the brilliant story adapted by Henry Newbolt from Hans Andersen. Porte writes that the music is often solemn and romantic, and curiously impressive.Porte, p. 111 Christopher Webber writes that it has \"an atmosphere not quite like any other: The Travelling Companion has timeless qualities ... [which] could go far to enhance Stanford's reputation as an opera composer\".Christopher Webber, 'Charles Villiers Stanford - An Operatic Chameleon', Opera, November 2018, pp.1352-1356"]}, {"page": "Quantock Hills", "response": ["*The poet Henry Newbolt lived in Aisholt in the 1920s.A P Baggs and M C Siraut, 'Aisholt', in A History of the County of Somerset: Volume 6, andersfield, Cannington, and North Petherton Hundreds (Bridgwater and Neighbouring Parishes), ed. R W Dunning and C R Elrington (London, 1992), pp. 68-69 http://www.british-history.ac.uk/vch/som/vol6/pp68-69 [accessed 17 May 2015]. Walter de la Mare stayed with him and wrote in his visitors book:"]}, {"page": "Georgian Poetry", "response": ["In the 1930s, Henry Newbolt \"estimated there were still at least 1000 active poets\" in England, and that \"the vast majority would be recognisably 'Georgian'\"."]}, {"page": "Harold Monro", "response": ["Lascelles Abercrombie, Richard Aldington, John Alford, A. C. Benson, Laurence Binyon, Edmund Blunden, W. S. Blunt, Gordon Bottomley, Robert Bridges, Rupert Brooke, Samuel \"Erewhon\" Butler, Roy Campbell, G. K. Chesterton, Richard Church, Padraic Colum, A. E. Coppard, Frances Cornford, John Davidson, W. H. Davies, Jeffery Day, Walter de la Mare, Lord Alfred Douglas, John Drinkwater, Helen Parry Eden, T. S. Eliot, Vivian Locke Ellis, Michael Field, J. E. Flecker, F. S. Flint, John Freeman, Stella Gibbons, Wilfrid Gibson, Robert Graves, Thomas Hardy, H. D., Philip Henderson, Maurice Hewlett, Ralph Hodgson, Gerard Manley Hopkins, A. E. Housman, Ford Madox Hueffer, T. E. Hulme, Aldous Huxley, James Joyce, Rudyard Kipling, D. H. Lawrence, Cecil Day-Lewis, John Masefield, R. A. K. Mason, Charlotte Mew, Alice Meynell, Viola Meynell, Harold Monro, T. Sturge Moore, Edwin Muir, Henry Newbolt, Robert Nichols, Alfred Noyes, Wilfred Owen, J. D. C. Pellow, H. D. C. Pepler, Eden Phillpotts, Ezra Pound, Peter Quennell, Herbert Read, Isaac Rosenberg, Siegfried Sassoon, Geoffrey Scott, Edward Shanks, Fredegond Shove, Edith Sitwell, Osbert Sitwell, Sacheverell Sitwell, Stephen Spender, J. C. Squire, James Stephens, Edward Thomas, W. J. Turner, Sylvia Townsend Warner, Max Weber, Anna Wickham, Humbert Wolfe, William Butler Yeats"]}, {"page": "Walter de la Mare", "response": ["He worked from 1890 in the statistics department of the London office of Standard Oil for eighteen years to support his family, but nevertheless found time to write. In 1908, through the efforts of Sir Henry Newbolt he received a Civil List pension which enabled him to concentrate on writing."]}, {"page": "Palgrave's Golden Treasury", "response": ["Matthew Arnold – William Barnes – F. W. Bourdillon – Robert Bridges – Emily Brontë – Rupert Brooke – Elizabeth Barrett Browning – Robert Browning – John Clare – Arthur Hugh Clough – Mary Coleridge – William Johnson Cory – John Davidson – Austin Dobson – D. M. Dolben – George Darley – R. W. Dixon – Edward FitzGerald – James Elroy Flecker – Thomas Hardy – Thomas Hood – Gerard Manley Hopkins – Lionel Johnson – Charles Kingsley – Rudyard Kipling – Walter Savage Landor – Hon. Emily Lawless – J. C. Mangan – John Masefield – George Meredith – William Morris – Sir Henry Newbolt – Alice Meynell – William Morris – Wilfred Owen – Coventry Patmore – Christina Georgina Rossetti – Dante Gabriel Rossetti – Charles Sorley – Robert Louis Stevenson – Algernon Charles Swinburne – Alfred, Lord Tennyson – Edward Thomas – Francis Thompson – H. F. Trench – William Butler Yeats"]}, {"page": "Granville Bantock", "response": ["*Three Sea Songs (1920s, Henry Newbolt)"]}, {"page": "If—", "response": ["* \"Vitaï Lampada\" by Henry Newbolt"]}, {"page": "David Thomas (composer)", "response": ["Thomas is remembered mainly for his hymn tunes and songs such as \"Drosom ni\" and \"Cymru fach i mi\". His other works include a cantata, \"Merch y Llyn\" (\"Lady of the Lake\"), and a choral work, \"He Fell Among Thieves\", a setting of the famous poem by Sir Henry Newbolt."]}, {"page": "Henry John Newbolt", "response": ["#REDIRECT Henry Newbolt"]}, {"page": "Clifton College", "response": ["The Close featured in a well-known poem by O.C. Sir Henry Newbolt – Vitaї Lampada (\"There's a breathless hush in the Close to-night\")", "* Derek Winterbottom, Henry Newbolt and the Spirit of Clifton (Redcliffe Press, Bristol, 1986)"]}, {"page": "Horace Smith-Dorrien", "response": ["* 'The Story of a General' by Henry Newbolt (1916)"]}, {"page": "Henry John, Sir Newbolt", "response": ["#REDIRECT Henry Newbolt"]}, {"page": "Newbolt, Henry John, Sir", "response": ["#REDIRECT Henry Newbolt"]}, {"page": "Frederick Burnaby", "response": ["Henry Newbolt's poem \"Vitaï Lampada\" is often quoted as referring to Burnaby's death at Abu Klea; \"The Gatling's jammed and the Colonel's dead...\", (although it was a Gardner machine gun which jammed). It was, perhaps, because of an impromptu order by Burnaby (who, as a supernumerary, had no official capacity in the battle) that the Dervishes managed to get inside the square. Yet the song \"Colonel Burnaby\" was written in his honour and his portrait hangs in the National Portrait Gallery, London.The life of Colonel Fred Burnaby by Charles P. Corning There are two contradictory accounts:"]}, {"page": "Oxford Book of Modern Verse 1892–1935", "response": ["*Henry Newbolt"]}, {"page": "The Faber Book of Twentieth Century Verse", "response": ["L. Aaronson - Lascelles Abercrombie - Dannie Abse - Drummond Allison - W. H. Auden - George Barker - William Bell - John Betjeman - Laurence Binyon - Thomas Blackburn - Edmund Blunden - Wilfrid Scawen Blunt - Robert Bridges - Rupert Brooke - Norman Cameron - Roy Campbell - Maurice Carpenter - Charles Causley - G. K. Chesterton - Alex Comfort - A. E. Coppard - John Davidson - Idris Davies - W. H. Davies - Walter de la Mare - C. M. Doughty - Keith Douglas - Lawrence Durrell - T. S. Eliot - William Empson - James Elroy Flecker - David Gascoyne - Wilfrid Gibson - W. S. Graham - Robert Graves - Thomas Hardy - H. D. - Thomas Hennell - Rayner Heppenstall - Ralph Hodgson - A. E. Housman - James Joyce - Patrick Kavanagh - Sidney Keyes - Rudyard Kipling - James Kirkup - D. H. Lawrence - Laurie Lee - Alun Lewis - C. Day Lewis - Hugh MacDiarmid - Patrick MacDonogh - Louis MacNeice - John Masefield - Harold Monro - T. Sturge Moore - Edwin Muir - Henry Newbolt - Robert Nichols - Norman Nicholson - Wilfred Owen - Herbert Palmer - Ruth Pitter - William Plomer - Paul Potts - Ezra Pound - F. T. Prince - Kathleen Raine - Herbert Read - Edgell Rickword - Anne Ridler - W. R. Rodgers - Isaac Rosenberg - Siegfried Sassoon - John Short - Edith Sitwell - Stevie Smith - Sydney Goodsir Smith - Stephen Spender - J. C. Squire - Arthur Symons - Dylan Thomas - Edward Thomas - W. J. Turner - Dorothy Wellesley - Vernon Watkins - Anna Wickham - Charles Williams - W. B. Yeats - Andrew Young"]}, {"page": "Mary Elizabeth Coleridge", "response": ["Coleridge died of complications arising from appendicitis while on holiday in Harrogate in 1907, leaving an unfinished manuscript for her next novel and hundreds of unpublished poems. Her poetry was first published under her own name in the posthumous Poems (1908).  In the preface to this volume, Henry Newbolt wrote: ", "** posthumous, with an introduction by Henry Newbolt."]}, {"page": "Caistor", "response": ["Caistor Grammar School dates from the reign of Charles I. An academy with a selective pupil intake, it has specialist school status for sports and humanities. Sir Henry Newbolt, author of Drake's Drum, was educated at the school."]}, {"page": "William Henry Ogilvie", "response": ["His good friend Harry 'Breaker' Morant was said to write like Ogilvie, beginning 'to write prose and verse – mostly horse-verse and lovey-dovey rhymes'.  Similarly some outside influences can be seen in some of Ogilvie's work: that of John Greenleaf Whittier in Memory town, Rudyard Kipling in Black sheep, and perhaps a little of Henry Lawson.  Robert Burns, Robert Browning, James Hogg, and John Keats have all been ascribed.  Within the poet's own A song of the poets, he also hints at Robert Bridges, Abercrombie, Davies, W. B. Yeats, Noyes, Watson, Henry Newbolt and John Masefield."]}, {"page": "Penguin poetry anthologies", "response": ["William Allingham - Alexander Anderson - Matthew Arnold - Alfred Austin - W. E. Aytoun - Jane Barlow - William Barnes - Thomas Lovell Beddoes - Hilaire Belloc - A. C. Benson - L. S. Bevington - Laurence Binyon - Samuel Laman Blanchard - Mathilde Blinde - Robert Bridges - Anne Brontë - Charlotte Brontë - Shirley Brooks - T. E. Brown - Elizabeth Barrett Browning - Caerleon - C. S. Calverley - William Canton - Lewis Carroll - Elizabeth Charles - John Clare - Arthur Hugh Clough - Hartley Coleridge - Mary E. Coleridge - Mortimer Collins - Eliza Cook - Thomas Cooper - William Johnson Cory - John Davidson - Richard Watson Dixon - Sydney Thompson Dobell - Digby Mackworth Dolben - Alfred Domett - Edward Dowden - Ernest Dowson - R. E. Egerton-Warburton - George Eliot - Ebenezer Elliott - Anne Evans - Sebastian Evans - Michael Field - Edward Fitzgerald - David Gray - John Gray - Dora Greenwell - Thomas Gordon Hake - John Hanmer - Thomas Hardy - Frances Ridley Havergal - Robert Stephen Hawker - W. E. Henley - James Henry - Thomas Hood - Gerard Manley Hopkins - A. E. Housman - Mary Howitt - Leigh Hunt - Jean Ingelow - Lionel Johnson - Ebenezer Jones - Ernest Jones - May Kendall - Harriet Eleanor Hamilton King - Charles Kingsley - Rudyard Kipling - Mary Montgomerie Lamb - Letitia Elizabeth Landon - Walter Savage Landor - William Larminie - Edward Lear - Eugene Lee-Hamilton - Robert Leighton - Amy Levy - Caroline Lindsay - Frederick Locker-Lampson - Alfred Comyns Lyall - Robert Bulwer-Lytton - James Clarence Mangan - Philip Bourke Marston - George Meredith - Alice Meynell - Thomas Miller - F. B. Money-Coutts - Cosmo Monkhouse - William Morris - Arthur Munby - Robert Fuller Murray - Constance Naden - Edith Nesbit - Henry Newbolt - Eliza Ogilvy - George Outram - Coventry Patmore - Emily Pfeiffer - Stephen Phillips - Victor Plarr - May Probyn - Adelaide Anne Procter - Bryan Waller Procter - Dollie Radford - William Brighty Rands - William Renton - James Logie Robertson - Mary. F. Robinson - William Caldwell Roscoe - William Stewart Rose - Christina G. Rossetti - George William Russell - Richard Hill Sandys - William Bell Scott - George Augustus Simcox - Joseph Skipsey - Menella Bute Smedley - Alexander Smith - Walter C. Smith - J. K. Stephen - Robert Louis Stevenson - Henry Septimus Sutton - Algernon Charles Swinburne - Arthur Symons - Henry Taylor - Alfred Tennyson - William Makepeace Thackeray - William Thom - Francis Thompson - James Thomson - John Todhunter - Charles Turner - John Leicester Warren - Rosamund Marriott Watson - William Watson - Augusta Webster - Charles Whitehead - Oscar Wilde - James Chapman Woods - William Wordsworth - W. B. Yeats", "Alfred Austin - John Barlas - Aubrey Beardsley - Laurence Binyon - Olive Custance - John Davidson - R. W. Dixon - Lord Alfred Douglas - Ernest Dowson - Michael Field - John Gray - G. A. Greene - Thomas Hardy - W. E. Henley - Herbert Horne - A. E. Housman - Selwyn Image - Lionel Johnson - Rudyard Kipling - Richard Le Gallienne - Eugene Lee-Hamilton - Alice Meynell - Henry Newbolt - Vincent O'Sullivan - Stephen Phillips - Victor Plarr - Dollie Radford - Ernest Radford - Ernest Rhys - Arthur Symons - Francis Thompson - Theodore Wratislaw - W. B. Yeats"]}, {"page": "Constantine (Briton)", "response": ["Constantine features in some modern treatments of the legend. Katrina Trask's Under King Constantine, an 1892 book comprising three long romantic poems, is set in his reign.Lupack & Lupack, p. 12. He is an important unseen character in Henry Newbolt's 1895 play Mordred in his usual role as Arthur's successor.Fisher, p. 166. He similarly appears in Rosemary Sutcliff's 1963 novel Sword at Sunset, in which the grievously wounded \"Artos\" voluntarily passes the crown to him.Taylor & Brewer, p. 303. In Parke Godwin's 1984 novel Beloved Exile, Constantine is one of several nobles fighting Guenevere, the protagonist, in a bid to succeed Arthur.Hoburg, pp. 72–73, 75–78. He is the chief protagonist of the 1990 computer game Spirit of Excalibur; players control Constantine and his allies as they defend the kingdom after Arthur's death.Thompson & Lacy, p. 590. Darrell Schweitzer's 1995 fantasy story \"The Epilogue of the Sword\" features an ageing Lancelot returning to serve Constantine against the Saxons.Thompson, p. 605. Constantine elaborately figures into Arthur Phillips' 2011 novel The Tragedy of Arthur, which centers on an apocryphal Arthurian play attributed to William Shakespeare that the narrator, a fictional version of Phillips, insists is a hoax created by his father. In the play-within-the-novel, Constantine is Guenhera's brother and Arthur's vassal and heir; the novel's narrator claims that Constantine is based on his father's old nemesis, prosecutor Ted Constantine.Phillips, pp. 254, 257–259, 297."]}, {"page": "Sir Henry Newbolt", "response": ["#REDIRECT Henry Newbolt"]}, {"page": "Arthur St John Adcock", "response": ["As an influential critic, Adcock has been classed with conservatives such as Hilaire Belloc, Edmund Gosse, Henry Newbolt, E. B. Osborn and Arthur Waugh."]}, {"page": "T. E. Hulme", "response": ["Hulme developed an interest in poetry\"It was probably the contrast between the sensory image and a traditional diction that first suggested to T. E. Hulme the isolation of the image. If the image could be identified as the only poetic force within a poem, why not proceed to identify poem and image, as had been the common practice in China or Japan? To cut the cackle – that was to be the first aim of a modern poetry.\" — Read, Herbert (1955). \"The Drift of Modern Poetry,\" Encounter, Vol. IV, No. 1, p. 6. and wrote a small number of poems. He was made secretary of the Poets' Club, attended by such establishment figures as Edmund Gosse and Henry Newbolt. There he encountered Ezra Pound and F. S. Flint.Isaacs, Jacob (1952). \"The Coming of the Image,\" in The Background of Modern Poetry. New York: E. P. Dutton & Co., Inc., pp. 34–51. In late 1908 Hulme delivered his paper A Lecture on Modern Poetry to the club. Hulme's poems \"Autumn\" and \"A City Sunset\", both published in 1909 in a Poets' Club anthology,For Christmas MDCCCCVIII (London: The Poets' Club), 1909. have the distinction of being the first Imagist poems.Schmidt, Michael (1998). Lives of the Poets. London: Weidenfeld & Nicolson  "]}, {"page": "Oxford period poetry anthologies", "response": ["Lascelles Abercrombie – Percy Addleshaw – Douglas Ainslie – Thomas Bailie Aldrich – William Alexander – William Allingham – Sir Edwin Arnold – Matthew Arnold – Thomas Ashe – Alfred Austin – William Edmonstoune Aytoun – Philip James Bailey – Richard Harris Barham – Maurice Baring – George Barlow – Jane Barlow – William Barnes – Benjamin Disraeli, 1st Earl of Beaconsfield – Thomas Lovell Beddoes – Henry Charles Beeching – Charles Dent Bell – Hilaire Belloc – Arthur Christopher Benson – Laurence Binyon – John Stuart Blackie – Richard Doddridge Blackmore – Mathilde Blind – Wilfrid Scawen Blunt – George Henry Boker – Gordon Bottomley – Francis William Bourdillon – Robert Bridges – Emily Brontë – Rupert Brooke – Robert Barnabas Brough – Oliver Madox Brown – Thomas Edward Brown – Elizabeth Barrett Browning – Robert Browning – William Cullen Bryant – Robert Buchanan – Arthur Gray Butler – Wathen Mark Wilks Call – Thomas Carlyle – Bliss Carman – John Clare – Caroline Clive – Arthur Hugh Clough – Hartley Coleridge – Mary E. Coleridge – Sara Coleridge – Mortimer Collins – Frances Cornford – William Cory – Frances Burdett Money Coutts – Dinah Maria Craik – Walter Crane – Marquess of Crewe – Arthur Shearly Cripps – Henry Cust – George Darley – John Davidson – William H. Davies – Thomas Osborne Davis – William James Dawson – Walter De la Mare – Lord De Tabley – Sir Aubrey De Vere – Aubrey De Vere – Emily Dickinson – Richard Watson Dixon – Bertram Dobell – Sydney Dobell – Austin Dobson – Alfred Domett – Lord Alfred Douglas – Edward Dowden – Ernest Dowson – Sir Francis Hastings Doyle – John Drinkwater – Agnes Mary Frances Duclaux – Helen, Lady Dufferin – George Louis Palmella Busson du Maurier – Matilda Betham Edwards – George Eliot – Ebenezer Elliott – Henry Ellison – Ralph Waldo Emerson – Frederick William Faber – Sir Samuel Ferguson – Michale Field – Edward Fitzgerald – James Elroy Flecker – Alice Furlong – Norman Gale – Richard Garnett – Wilfrid Wilson Gibson – Adam Lindsay Gordon – Edmund Gosse – Charles Granville – David Gray – Dora Greenwell – Gerald Griffin – Louise Imogen Guiney – Fitz-Greene Halleck – Thomas Hardy – Bret Harte – Robert Stephen Hawker – William Ernest Henley – Maurice Hewlett – Emily Henrietta Hickey – Katharine Tynan Hinkson – Oliver Wendell Holmes – Thomas Hood – George Hookham – Gerard Manley Hopkins – Richard Henry Horne – Lord Houghton – Laurence Housman – Julia Ward Howe – William Dean Howells – Leigh Hunt – Douglas Hyde – Jean Ingelow – Lionel Johnson – Ebenezer Jones – Ernest Charles Jones – James Joyce – John Keble – Frances Anne Kemble – Henry Clarence Kendall – John Kenyon – Charles Kingsley – Henry Kingsley – Rudyard Kipling – Walter Savage Landor – Andrew Lang – Emily Lawless – Eugene Lee-Hamilton – Edward Cracroft Lefroy – Richard Le Gallienne – Amy Levy – William James Linton – Frederick Locker-Lampson – John Gibson Lockhart – Henry Wadsworth Longfellow – James Russell Lowell – Henry Dawson Lowry – Sir Alfred Comyn Lyall – Thomas Toke Lynch – Sidney Royse Lysaght – Earl of Lytton – Lord Lytton – Lord Macaulay – Denis Florence MacCarthy – George MacDonald – Charles Mackay – H. C. Compton Mackenzie – Francis Mahony – James Clarence Mangan – Philip Bourke Marston – Theophile Marzials – John Masefield – Gerald Massey – Annie Matheson – George Meredith – Herman Charles Merivale – Alice Meynell – Richard Middleton – William Cosmo Monkhouse – Harold Monro – Mary Montgomerie – T. Sturge Moore – Sir Lewis Morris – William Morris – Neil Munro – Ernest Myers – Frederic William Henry Myers – John Mason Neale – Henry Newbolt – John Henry Newman – John Nicol – Roden Berkeley Wriothesley Noel – Caroline Elizabeth Sarah Norton – Alfred Noyes – Moira O'Neill – John Boyle O'Reilly – Arthur William Edgar O'Shaughnessy – Francis Turner Palgrave – Sir Gilbert Parker – Fanny Parnell – Coventry Patmore – John Payne – John Swinnerton Phillimore – Stephen Phillips – Eden Phillpotts – William Philpot – Edgar Allan Poe – Walter Herries Pollock – Ezra Pound – Winthrop Mackworth Praed – May Probyn – Adelaide Anne Procter – Bryan Waller Procter – Sir Arthur Quiller-Couch – Ernest Radford – William Brighty Rands – Hardwick Drummond Rawnsley – Ernest Rhys – James Logie Robertson – Sir James Rennell Rodd – Samuel Rogers – T. W. Rolleston – William Caldwell Roscoe – William Stanley Roscoe – Christina Georgina Rossetti – Dante Gabriel Rossetti – Earl of Rosslyn – John Ruskin – George William Russell – Lady Margaret Sackville – George Santayana – William Bell Scott – John Campbell Shairp – William Sharp – Dora Sigerson Shorter – Joseph Skipsey – Douglas Brook Wheelton Sladen – Menella Bute Smedley – Alexander Smith – Walter C. Smith – James Stephens – Robert Louis Stevenson – Charles Swain – Elinor Sweetman – Algernon Charles Swinburne – John Addington Symonds – Arthur Symons – John M. Synge – Sir Henry Taylor – Rachel Annand Taylor – Frederick Tennyson – Lord Tennyson – William Makepeace Thackeray – Francis Thompson – Edward William Thomson – James Thomson (B.V.) – Henry David Thoreau – Wilfrid Thorley – Walter Thornbury – John Todhunter – Archbishop Trench – Herbert Trench – Charles Tennyson Turner – Samuel Waddington – Thomas Wade – Edward Walsh – Thomas Herbert Warren – Rosamund Marriott Watson – William Watson – Theodore Watts-Dunton – Augusta Webster – Thomas Westwood – Charles Whitehead – Walt Whitman – John Greenleaf Whittier – Oscar Wilde – Sarah Williams – Nathaniel Parker Lewis – Margaret L. Woods – Thomas Woolner – William Butler Yeats", "Sir Edwin Arnold – Alfred Austin – Aubrey Beardsley – Robert Bridges – Edward Carpenter – Mary Coleridge – John Davidson – Austin Dobson – Digby Mackworth Dolben – Edward Dowden – Ernest Dowson – Mary Duclaux – Edwin John Ellis – Michael Field – Richard Le Gallienne – Sir W. S. Gilbert – Sir Edmund Gosse – John Gray – William Ernest Henley – Ellice Hopkins – Gerard Manley Hopkins – A. E. Housman – Lionel Johnson – Rudyard Kipling – Andrew Lang – Eugene Lee-Hamilton – Alfred Lyall – Charlotte Mew – Alice Meynell – A. C. Miall – Sir Henry Newbolt – Roden Noel – Arthur O'Shaughnessy – William James Renton – T. W. Rolleston – George William Russell – William Sharp – J. K. Stephen – Algernon Charles Swinburne – John Addington Symonds – Arthur Symons – Lord De Tabley – James Thomson (B.V.) – Francis Thompson – Margaret Veley – Sir William Watson – Augusta Webster – Oscar Wilde – W. B. Yeats"]}, {"page": "Category talk:Military writers", "response": ["List of all pages in category Military writers retrieved by PockBot.PockBot is currently Undergoing Trials. If you have any comments on its performance please leave them at Wikipedia:Bots/Requests_for_approval/PockBotArticleClass / StatusList of military writersnot yet classifiedMansur Abdulinnot yet classifiedAndrew Laytonnot yet classifiedDenis Davydovnot yet classifiedDerek Wood (author)not yet classifiedMikhail Ivanovich Dragomirovnot yet classifiedSextus Julius Frontinusnot yet classifiedFyodor Glinkanot yet classifiedW. E. B. Griffinnot yet classifiedAntoine-Henri JominiStartDmitry MilyutinStartDaniel Rosenfeldnot yet classifiedHunter Scottnot yet classifiedSun Binnot yet classifiedSun TzuStartAlexander SuvorovBLeon Trotskynot yet classifiedRick Atkinsonnot yet classifiedP. G. T. BeauregardBPark Benjaminnot yet classifiedMatthew Bogdanosnot yet classifiedMark Bowdennot yet classifiedJohn Boyd (military strategist)BJames Bradley (author)StubGary Brechernot yet classifiedB. G. Burkettnot yet classifiedSmedley Butler14px GACaleb Carrnot yet classifiedDennis Chalkernot yet classifiedTom Clancynot yet classifiedÈve Curienot yet classifiedWilfred P. Deacnot yet classifiedDonald Burgettnot yet classifiedJim Dunnigannot yet classifiedIvan Elandnot yet classifiedEdward EllsbergStartShelby Footenot yet classifiedWesley L. Foxnot yet classifiedDouglas S. Freemannot yet classifiedFrancis Vinton Greenenot yet classifiedDave Grossman (author)not yet classifiedVictor Davis HansonBJulian Hatchernot yet classifiedJohn Hattendorfnot yet classifiedPeter Huchthausennot yet classifiedBeirne Lay, Jr.StartWilliam S. Lindnot yet classifiedRichard Marcinkonot yet classifiedCharles F. MarshallStubRichard Newcombnot yet classifiedMichael Alfred Peszkenot yet classifiedRalph Petersnot yet classifiedKim Pondersnot yet classifiedH. John PooleStubGordon Prangenot yet classifiedFletcher Prattnot yet classifiedSteven Pressfieldnot yet classifiedClark G. Reynoldsnot yet classifiedQuentin Reynoldsnot yet classifiedTheophilus Francis RodenboughStubAlexander Procofieff de Severskynot yet classifiedPeter W. Singernot yet classifiedSarah Smileynot yet classifiedCordwainer Smithnot yet classifiedBert Stilesnot yet classifiedHarry G. Summers, Jr.StartStephen Van Everanot yet classifiedBing WestStartCornelis DeWitt Willcoxnot yet classifiedJames Grant WilsonStartGeorge Wood Wingatenot yet classifiedChe Guevara14px FAGeoffrey Michael Brooksnot yet classifiedCharles Cornwallis Chesneynot yet classifiedJ.F.C. FullerStubBill Gunstonnot yet classifiedEdward Bruce Hamleynot yet classifiedJames Haywardnot yet classifiedBasil Liddell Hartnot yet classifiedJohn Frederick Mauricenot yet classifiedCharles Pasleynot yet classifiedRex King-ClarkStubSpenser Wilkinsonnot yet classifiedJean Charles, Chevalier Folardnot yet classifiedPhilippe Henri, Comte de Grimoardnot yet classifiedJacques Antoine Hippolyte, Comte de GuibertStartCharles OudinotStartArdant du PicqStartMaurice de SaxeStartFriedrich von BernhardiStubPaul Bronsart von Schellendorfnot yet classifiedFreiherr Dietrich Heinrich von Bülownot yet classifiedCarl von ClausewitzBColmar Freiherr von der GoltzBHeinz Guderiannot yet classifiedErich von MansteinBHelmuth von Moltke the ElderBHermann-Bernhard RamckeStartErhard Rausnot yet classifiedErwin RommelBWilhelm von Scherffnot yet classifiedSigismund von SchlichtingStubFrido von SengerStartJulius von Verdy du Vernoisnot yet classifiedStephen AmbroseStartAndrew GodefroyStartCorrelli BarnettStartCharles BeanBAntony BeevorStartDavid BercusonStartChristopher Browningnot yet classifiedAnthony J. Bryantnot yet classifiedMichael Carver, Baron CarverStubRana Chhinanot yet classifiedAlan Clarknot yet classifiedEliot A. Cohennot yet classifiedArthur Conan Doylenot yet classifiedJulian Corbettnot yet classifiedRobert Cowleynot yet classifiedGordon A. Craignot yet classifiedMartin van Creveldnot yet classifiedDan van der Vatnot yet classifiedLen Deightonnot yet classifiedTheodore Ayrault Dodgenot yet classifiedMartin Du BellayStubGwynne Dyernot yet classifiedEdgar O'BallanceStubCyril Fallsnot yet classifiedPaul Fussellnot yet classifiedPaolo GiovioStubDavid GlantzStartAdrian Goldsworthynot yet classifiedJack Granatsteinnot yet classifiedDavid H. HackworthStartDavid Charles Harveynot yet classifiedMax Hastingsnot yet classifiedAndreas HillgruberStartRichard Holmes (military historian)not yet classifiedAlistair Hornenot yet classifiedMichael Howard (historian)not yet classifiedDonald Kagannot yet classifiedJohn KeeganStartRichard LandwehrStubEric Linklaternot yet classifiedCanon William Lummisnot yet classifiedEdward Luttwaknot yet classifiedLyn MacDonaldnot yet classifiedSamuel Lyman Atwood MarshallStartMartin Middlebrooknot yet classifiedWilliam Francis Patrick Napiernot yet classifiedRobin Neillandsnot yet classifiedHans Werner Neulennot yet classifiedLeo Niehorsternot yet classifiedAryeh Nusbachernot yet classifiedCharles OmanStartPeter Paretnot yet classifiedForrest Poguenot yet classifiedGerhard Ritternot yet classifiedRobert M. Citinonot yet classifiedCornelius Ryannot yet classifiedSociety for Military HistoryStubNorman Stonenot yet classifiedHew Strachannot yet classifiedBill Sweetmannot yet classifiedBruce Taylor (historian)not yet classifiedJohn TerraineStartStephen Turnbull (historian)StartRussell Weigleynot yet classifiedGerhard Weinbergnot yet classifiedJay WinterStubTom Wintringhamnot yet classifiedQuincy Wrightnot yet classifiedAlexander Zhmodikovnot yet classifiedValentine Bakernot yet classifiedEdwyn Graynot yet classifiedGeorge Hanger, 4th Baron Colerainenot yet classifiedRaymond Akernot yet classifiedRobert G. Albionnot yet classifiedRaoul Castexnot yet classifiedPhilip Howard Colombnot yet classifiedJames Fenimore Coopernot yet classifiedAlbert Gleavesnot yet classifiedAndrew Gordon (naval historian)not yet classifiedR. J. B. Knightnot yet classifiedDudley Wright Knoxnot yet classifiedAndrew Lambertnot yet classifiedCharles A. Lockwoodnot yet classifiedAlfred Thayer MahanStartTyrone G. Martinnot yet classifiedSamuel Eliot Morisonnot yet classifiedHenry Newboltnot yet classifiedHugo O'Donnell, Duke of Tetuannot yet classifiedGeorge H. Preblenot yet classifiedAnthony Preston (naval historian)not yet classifiedWerner Rahnnot yet classifiedNicholas Rodgernot yet classifiedWilliam Ledyard Rodgersnot yet classifiedJohan Carel Marinus Warnsincknot yet classifiedWolfgang Wegener (naval historian)not yet classifiedColin White (historian)not yet classifiedDe Rebus BellicisStubHero of Byzantiumnot yet classifiedKekaumenosnot yet classifiedNikephoros OuranosStartVegetiusStartPockBot 09:14, 7 December 2006 (UTC)"]}]}}