{"wiki_id": "http://www.wikidata.org/entity/Q3402409", "itemLabel": "John Edward Lloyd", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Edward_Lloyd", "wikipedia_page": {"main": "Sir John Edward Lloyd (5 May 1861 – 20 June 1947) was a Welsh historian, He was the author of the first serious history of the country's formative years, A History of Wales from the Earliest Times to the Edwardian Conquest (1911).\nAnother of his great works was Owain Glendower: Owain Glyn Dŵr (1931). For his achievements in the field, he was made a Knight Bachelor in 1934. Under his editorship, the first edition of the Dictionary of Welsh Biography was compiled, though not published until after his death (1950).\n\n", "link_mentions": [{"page": "Llywelyn ap Gruffudd", "response": ["*John Edward Lloyd (1911) A history of Wales from the earliest times to the Edwardian conquest (Longmans, Green & Co.)"]}, {"page": "Celtic Christianity", "response": ["At the end of the 6th century, Pope Gregory I dispatched a mission under Augustine of Canterbury to convert the Anglo-Saxons, establish new sees and churches throughout their territories, and reassert papal authority over the native church. Gregory intended for Augustine to become the metropolitan bishop over all of southern Britain, including the existing dioceses under Welsh and Cornish control. Augustine met with British bishops in a series of conferences – known as the Synod of Chester – that attempted to assert his authority and to compel them to abandon aspects of their service that had fallen out of line with Roman practice. The Northumbrian cleric Bede's Ecclesiastical History of the English People is the only surviving account of these meetings: according to it, some of the clerics of the nearest British province met Augustine at a site on the border of the Kingdom of Kent that was known thereafter as Augustine's Oak. Augustine focused on seeking assistance for his work among the Saxons and reforming the Britons' obsolete method for calculating Easter; the clerics responded that they would need to confer with their people and await a larger assembly. Bede relates that the bishops particularly consulted a hermit on how to respond. He told them to respond based on Augustine's conduct: were he to rise to greet them, they would know him for a humble servant of Christ and should submit to his authority but, were he to remain seated, they would know him to be arrogant and prideful and should reject him. As it happened, Augustine did keep his seat, provoking outrage. In the negotiations that followed, he offered to allow the Britons to maintain all their native customs but three: they should adopt Rome's more advanced method of calculating the date of Easter, reform their baptismal ritual, and join the missionary efforts among the Saxons. The British clerics rejected all of these, as well as Augustine's authority over them. John Edward Lloyd argues that the primary reason for the British bishops' rejection of Augustine – and especially his call for them to join his missionary effort – was his claim to sovereignty over them, given that his see would be so deeply entwined with Anglo-Saxon Kent."]}, {"page": "List of rulers of Wales", "response": ["*A history of Wales from the earliest times, John Edward Lloyd, 1911"]}, {"page": "Gruffydd ap Llywelyn", "response": ["Gruffydd ap Llywelyn (c. 1010-5 August 1063) was the King of Wales and had repeatedly defeated the English forces. He was the son of King Llywelyn ap Seisyll and Angharad, daughter of Maredudd ab Owain. He was the great-great-grandson of Hywel Dda.John Edward Lloyd (1911), A history of Wales from the earliest times to the Edwardian conquest (Longmans, Green & Co.)", "*John Edward Lloyd (1911) A history of Wales from the earliest times to the Edwardian conquest (Longmans, Green & Co.)"]}, {"page": "List of historians", "response": ["*John Edward Lloyd (1861–1947), Welshness"]}, {"page": "John Lloyd", "response": ["*John Edward Lloyd (1861–1947), Welsh historian"]}, {"page": "1861 in literature", "response": ["*May 5 – Sir John Edward Lloyd, Welsh historian (died 1947)"]}, {"page": "Merionethshire", "response": ["Welsh records from the end of this period, and later, treat Dunoding as a vassal of Gwynedd, ruled by an ancient cadet branch of the same family. Nevertheless, according to John Edward Lloyd, Dunoding had been independent of Gwynedd, at the time of Cadfan ap Iago (in the early 7th century), and before."]}, {"page": "List of historians by area of study", "response": ["* John Edward Lloyd (1861–1947) – early Welsh history"]}, {"page": "Kingdom of Gwynedd", "response": ["During the later 9th and 10th centuries, the coastal areas of Gwynedd, particularly Anglesey, were coming under increasing attack by the Vikings. These raids no doubt had a seriously debilitating effect on the country but fortunately for Gwynedd, the victims of the Vikings were not confined to Wales. The House of Cunedda – as the direct descendants of Cunedda are known – eventually expired in the male line in 825 upon the death of Hywel ap Rhodri Molwynog and, as John Edward Lloyd put it, \"a stranger possessed the throne of Gwynedd.\"Lloyd (2004), p. 323.", "On the death of Einion ap Cadwgan, lord of Meirionnydd, a quarrel engulfed his kinsmen on who should succeed him. Meirionnydd was then a vassal cantref of Powys, and the family there a cadet of the Mathrafal house of Powys. Gruffudd gave licence to his sons Cadwallon and Owain to press the opportunity the dynastic strife in Meirionnydd presented. The brothers raided Meirionnydd with the Lord of Powys as important there as he was in the Perfeddwlad. However it would not be until 1136 that the cantref was firmly within Gwynedd's control. Perhaps because of their support of Earl Hugh of Chester, Gwynedd's rival, in 1124 Cadwallon slew the three rulers of Dyffryn Clwyd, his maternal uncles, bringing the cantref firmly under Gwynedd's vassalage that year. And in 1125 Cadwallon slew the grandsons of Edwin ap Goronwy of Tegeingl, leaving Tegeingl bereft of lordship. However, in 1132 while on campaign in the commote of Nanheudwy, near Llangollen, 'victorious' Cadwallon was defeated in battle and slain by an army from Powys. The defeat checked Gwynedd's expansion for a time, \"much to the relief of the men of Powys\", wrote historian Sir John Edward Lloyd (J.E Lloyd).", "In 1146 news reached Owain that his favoured eldest son and heir, Rhun ab Owain Gwynedd, died. Owain was overcome with grief, falling into a deep depression from which none could console him, until news reached him that Mold Castle in Tegeingl had fallen to Gwynedd, \"[reminding Owain] that he had still a country for which to live,\" wrote historian Sir John Edward Lloyd.Lloyd (2004), Rhun's death, p. 96.", "According to Sir John Edward Lloyd, the challenges of campaigning in Wales were exposed during the 20-year Norman invasion. If a defender could bar any road, control any river-crossing or mountain pass, and control the coastline around Wales, then the risks of extended campaigning in Wales were too great."]}, {"page": "Ceredig", "response": ["* A history of Wales from the earliest times, John Edward Lloyd, 1911"]}, {"page": "Myrddin Wyllt", "response": ["Welsh historian John Edward Lloyd suggests there were three traditions that were conflated. The first, \"Merlinus Ambrosius\", Giraldus Cambrensis identifies as \"Myrddin Emrys\", who was found at Carmarthen and prophesied before Vortigern. The second, \"Merlinus Silvester\" or \"Merlinus Celidonius\" came from the North (Alba), was a contemporary of Arthur, saw a horrible portent in the sky while fighting in a battle, and spent the rest of his days a madman in the woods. Lloyd says Myrddin Wyllt is neither of these, and identifies him with the \"Lailoken\" mentioned in Jocelyn of Furness' Life of St. Kentigern."]}, {"page": "Aurelius Conanus", "response": ["Little else can be said of Aurelius Conanus with any certainty; it is not even known in which part of Britain he ruled. Historian John Edward Lloyd suggests that the form Caninus, appearing in one important manuscript of De Excidio, may have been a corruption of the more common Cuna(g)nus, or Cynan in Welsh.Lloyd, p. 132. As such he may be identified with one of the figures of that era who bore that name, such as Cynan Garwyn of Powys or his relative Cynin ap Millo. Lloyd suggests a connection with the degenerate descendants of the great hero Ambrosius Aurelianus whom Gildas mentions in Chapter 25. In this case his kingdom may have been located out in the territory later taken by the Anglo-Saxons, i.e. what is now England."]}, {"page": "Edward Lloyd", "response": ["*John Edward Lloyd (1861–1947), Welsh historian"]}]}}