{"wiki_id": "http://www.wikidata.org/entity/Q340108", "itemLabel": "James Collinson", "itemDescription": "British artist (1825-1881)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Collinson", "wikipedia_page": {"main": "James Collinson (9 May 1825 – 24 January  1881) was a Victorian painter who was a member of the Pre-Raphaelite Brotherhood from 1848 to 1850.\n\n", "link_mentions": [{"page": "January 24", "response": ["*1881 – James Collinson, English painter (b. 1825)"]}, {"page": "May 9", "response": ["*1825 – James Collinson, Victorian painter (d. 1881) "]}, {"page": "Pre-Raphaelite Brotherhood", "response": ["The Pre-Raphaelite Brotherhood  (later known as the Pre-Raphaelites) was a group of English painters, poets, and art critics, founded in 1848 by William Holman Hunt, John Everett Millais, Dante Gabriel Rossetti, William Michael Rossetti, James Collinson, Frederic George Stephens and Thomas Woolner who formed a seven-member \"Brotherhood\" modelled in part on the Nazarene movement.Henri Dorra, Symbolist Art Theories: A Critical Anthology (Berkeley, University of California Press, 1995) p.17 The Brotherhood was only ever a loose association and their principles were shared by other artists of the time, including Ford Madox Brown, Arthur Hughes and Marie Spartali Stillman.  Later followers of the principles of the Brotherhood included Edward Burne-Jones, William Morris and John William Waterhouse.", "As an aspiring poet, Rossetti wished to develop the links between Romantic poetry and art. By autumn, four more members, painters James Collinson and Frederic George Stephens, Rossetti's brother, poet and critic William Michael Rossetti, and  sculptor Thomas Woolner, had joined to form a seven-member-strong brotherhood. Ford Madox Brown was invited to join, but the more senior artist remained independent but supported the group throughout the PRB period of Pre-Raphaelitism and contributed to The Germ. Other young painters and sculptors became close associates, including Charles Allston Collins, and Alexander Munro. The PRB intended to keep the existence of the brotherhood secret from members of the Royal Academy.", "* James Collinson (painter)"]}, {"page": "Christina Rossetti", "response": ["In her late teens, Rossetti became engaged to the painter James Collinson, the first of three suitors. He, like her brothers Dante and William, was a founding member of the avant-garde Pre-Raphaelite Brotherhood, established in 1848.Packer, Lona Mosk (1963) Christina Rossetti University of California Press, p. 29. The engagement was broken in 1850 when he reverted to Catholicism. In 1853, when the family had continuing financial difficulties, Christina helped her mother keep a school in Fromefield, Frome, but it did not succeed. A plaque commemorates the house. In 1854 the pair returned to London, where Christina's father died. She later became involved with the linguist Charles Cayley, but declined to marry him, also for religious reasons. The third offer came from the painter John Brett, whom she likewise refused."]}, {"page": "1881 in art", "response": ["* January 24 – James Collinson, English Pre-Raphaelite painter (born 1825)"]}, {"page": "Frederic George Stephens", "response": ["He is sometimes cited  as the great exponent of writer's block: He started to write a political sonnet for the first number of The Germ magazine. On 13 October 1849 he had completed 11½ lines, which he showed to James Collinson, who said they were \"the best of all.\" By 12 November it had \"attained the length of 12 lines, with the reservation of a tremendous idea for the final two.\" The magazine appeared in January 1850 but the poem was never published."]}, {"page": "List of converts to Catholicism", "response": ["* James Collinson: artist who briefly went back to Anglicanism in order to marry Christina Rossetti: \"She accepted him when he reverted to Anglicanism but canceled their wedding plans when he \"went over to\" Rome for a second time. Collinson's parents disowned him, and he was reduced to begging from his friends in the Pre-Raphaelite Brotherhood.\""]}, {"page": "The Germ (periodical)", "response": ["The Germ published poetry by William Michael Rossetti (who also edited the magazine) and other members of the Brotherhood, including his brother Dante Gabriel Rossetti, Thomas Woolner and James Collinson. It also printed contributions of verse and essays on art and literature by associates of the Brotherhood, including Ford Madox Brown and Coventry Patmore, as well as occasional book reviews."]}, {"page": "Collinson", "response": ["* James Collinson (1825–1881), Victorian painter who was a member of the Pre-Raphaelite Brotherhood "]}, {"page": "List of Catholic artists", "response": ["*James CollinsonThe Cambridge Companion to the Pre-Raphaelites edited by Elizabeth Prettejohn, pg 72Aspects of the Emblem by Karl J. Höltgen, pg 147"]}, {"page": "Medievalism", "response": ["The Pre-Raphaelite Brotherhood was a group of English painters, poets, and critics, founded in 1848 by William Holman Hunt, John Everett Millais and Dante Gabriel Rossetti.R. Cronin, A. Chapman and A. H. Harrison, A Companion to Victorian Poetry (Wiley-Blackwell, 2002), p. 305. The three founders were soon joined by William Michael Rossetti, James Collinson, Frederic George Stephens and Thomas Woolner to form a seven-member \"brotherhood\".J. Rothenstein, An Introduction to English Painting (I.B.Tauris, 2001), p. 115. The group's intention was to reform art by rejecting what they considered to be the mechanistic approach first adopted by the Mannerist artists who succeeded Raphael and Michelangelo. They believed that the Classical poses and elegant compositions of Raphael in particular had been a corrupting influence on the academic teaching of art. Hence the name \"Pre-Raphaelite\". In particular, they objected to the influence of Sir Joshua Reynolds, the founder of the English Royal Academy of Arts, believing that his broad technique was a sloppy and formulaic form of academic Mannerism. In contrast, they wanted to return to the abundant detail, intense colours, and complex compositions of Quattrocento Italian and Flemish art.S. Andres, The pre-Raphaelite art of the Victorian novel: narrative challenges to visual gendered boundaries (Ohio State University Press, 2004), p. 247."]}, {"page": "1878 in art", "response": ["* James Collinson – The Holy Family"]}, {"page": "1850 in art", "response": ["*Controversial exhibition of Pre-Raphaelite paintings by Holman Hunt and Millais at the Royal Academy, Millais' Christ in the House of His Parents being attacked for its ultra-realism. James Collinson resigns from the Pre-Raphaelite Brotherhood, which then dissolves.", "*James Collinson"]}, {"page": "1825 in art", "response": ["*May 9 – James Collinson, English Pre-Raphaelite painter (died 1881)"]}]}}