{"wiki_id": "http://www.wikidata.org/entity/Q3403145", "itemLabel": "William Abraham", "itemDescription": "Welsh trade unionist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Abraham_(trade_unionist)", "wikipedia_page": {"main": "William Abraham (14 June 1842 – 14 May 1922), universally known by his bardic name, Mabon, was a Welsh trade unionist and Liberal/Labour politician, and a member of parliament (MP) from 1885 to 1920. Although an MP for 35 years, it was as a trade unionist that Abraham is most well known. Initially a pioneer of trade unionism, who fought to enshrine the principle of workers' representation against the opposition of the coal-owners, he was regarded in later life as a moderate voice believing that disputes should be solved through conciliation rather than industrial action. This drew him into conflict with younger and more militant leaders from the 1890s onwards. Although the defeat of the miners in the Welsh coal strike of 1898 was a clear defeat for Mabon's strategy, his prestige was sufficient to ensure that he became the first president of the South Wales Miners' Federation which was established in the wake of the dispute. Abraham was noted for his powerful speaking voice, and was a renowned orator in English and Welsh.", "link_mentions": [{"page": "Aberdare", "response": ["Aberdare, during its boom years, was considered a centre of Welsh culture: it hosted the first National Eisteddfod in 1861, with which David Williams (Alaw Goch) was closely associated. A number of local eisteddfodau had long been held in the locality, associated with figures such as William Williams (Carw Coch) The Eisteddfod was again held in Aberdare in 1885, and also in 1956 at Aberdare Park where the Gorsedd standing stones still exist. At the last National Eisteddfod held in Aberdare in 1956 Mathonwy Hughes won the chair. From the mid nineteenth century, Aberdare was an important publishing centre where a large number of books and journals were produced, the majority of which were in the Welsh language. A newspaper entitled Y Gwladgarwr (the Patriot) was published at Aberdare from 1856 until 1882 and was circulated widely throughout the South Wales valleys.  From 1875 a more successful newspaper, Tarian y Gweithiwr (the Workman's Shield) was published at Aberdare by John Mills. Y Darian, as it was known, strongly supported the trade union movements among the miners and ironworkers of the valleys. The miners' leader, William Abraham, derived support from the newspaper, which was also aligned with radical nonconformist liberalism. The rise of the political labour movement and the subsequent decline of the Welsh language in the valleys, ultimately led to its decline and closure in 1934."]}, {"page": "List of Welsh people", "response": ["*William Abraham (1842–1922), Liberal–Labour and Labour, trade unionist and first working-class MP", "*William Abraham (1842–1922), also known as Mabon"]}, {"page": "List of United Kingdom MPs: A", "response": ["| rowspan=\"2\" |William Abraham"]}, {"page": "National Democratic and Labour Party", "response": ["In 1916, this committee formed the British Workers League. It described itself as a \"patriotic labour\" group, and focused on support for the war and the British Empire and opposition to Little Englander and Cobdenite laissez-faire economics.Martin Pugh, Speak for Britain! A New History of the Labour Party (The Bodley Head, 2010), p. 115. The League was subsidised by Lord Milner,Peter Barberis, John McHugh, Mike Tyldesley entry on British Workers League Encyclopedia of British and Irish Political Organizations (Continuum International Publishing Group, 2005), p. 274. who consulted with Fisher during the war.J. Lee Thompson, Forgotten Patriot: A Life of Alfred, Viscount Milner of St. James's and Cape Town (Fairleigh Dickinson University Press), p. 320. The League was supported by Labour MPs such as James O'Grady, Stephen Walsh and William Abraham.Pugh, p. 115."]}, {"page": "Mabon", "response": ["*William Abraham (trade unionist), also known as Mabon (1842-1922), Welsh politician"]}, {"page": "Vernon Hartshorn", "response": ["At the point of his election as Miners' Agent in Maesteg in 1905 Hartshorn was regarded as one of the upcoming men of the Federation.  He had shown that he had a good deal of perseverance, a keen insight into mining and political matters, and a determination to do what he considered to be right however heavy the odds against him.  He was recommended for the post by the principal leaders of the South Wales Miners' Federation at the time, including William Abraham(Mabon), William Brace and James Winstone, all of them speaking of his \"unblemished moral character, his keenness, tact and ability, his knowledge of economic problems, and his good executive abilities\".  He was going to require all of those characteristics and skills in the years to come.Glamorgan Gazette, 25 March 1910, pg 8, col 2", "During the National Coal Strike of 1912 there are references to Hartshorn in the press as a militant, an extremist, a socialist, as pugnacious, uncompromising and out for trouble . That said, he was not one of the group of young socialists from the Rhondda who published the Syndicalist manifesto, 'The Miners Next Step', with its sustained critique of the style of union leadership shown by the likes of William Abraham. Nor was he an advocate of conciliation and compromise, of co-operation with the coal-owners at any cost.  He believed that the 'strike weapon' could and should be used."]}, {"page": "Rhondda (UK Parliament constituency)", "response": ["|rowspan=\"2\"|William Abraham", "thumb|120px|William Abraham"]}, {"page": "Christopher Rice Mansel Talbot", "response": ["Talbot, at this time, was asked by William Abraham for his views on the election of labour representatives to the House of Commons, and specifically the desirability of a labour member representing the new Rhondda constituency. Talbot replied as follows:"]}, {"page": "Tonypandy riots", "response": ["On 1 September 1910, the owners posted a lock-out notice at the mine, closing the site to all 950 workers, not just the 70 at the newly opened Bute seam. The Ely Pit miners reacted by going on strike. The Cambrian Combine then called in strikebreakers from outside the area, to which the miners responded by picketing the work site. On 1 November, the miners of the South Wales coalfield were balloted for strike action by the South Wales Miners' Federation, resulting in the 12,000 men working for the mines owned by the Cambrian Combine going on strike. A conciliation board was formed to reach an agreement, with William Abraham acting on behalf of the miners and F. L. Davis for the owners. Although an agreed wage of 2s 3d per ton was arrived at, the Cambrian Combine workmen rejected the agreement.", "A more official version states that \"The strike finally ended in August 1911, with the workers forced to accept the 2s 3d per ton negotiated by William Abraham MP prior to the strike ... the workers actually returning to work on the first Monday in September\", ten months after the strike began and twelve months after the lock-out which started the confrontation."]}, {"page": "Miners' Federation of Great Britain", "response": [" |rowspan=5| William Abraham"]}, {"page": "Liberal-Labour (UK)", "response": ["The first Lib–Lab candidate to stand was George Odger in the 1870 Southwark by-election. The first Lib–Lab candidates to be elected were Alexander MacDonald and Thomas Burt, both members of the Miners' Federation of Great Britain (MFGB), in the 1874 general election.  In 1880, they were joined by Henry Broadhurst of the Operative Society of Masons and the movement reached its peak in 1885, with twelve MPs elected. These include William Abraham (Mabon) in the Rhondda division whose claims to the Liberal nomination were essentially based on his working class credentials.", "|William Abraham"]}, {"page": "Cwmafan", "response": ["* William Abraham, trade unionist and MP."]}, {"page": "List of Labour Party (UK) MPs", "response": ["*William Abraham, Rhondda, 1910–18;Formerly a Lib-Lab MP. Rhondda West, 1918–20"]}, {"page": "List of MPs elected in the December 1910 United Kingdom general election", "response": ["1915 William Abraham (Rhondda) resigned the Labour whip and joined the Liberals."]}, {"page": "John Williams (Gower MP)", "response": ["Williams was born in Aberaman, and began working at a local coal mine at the age of twelve.  Eight years later, he was elected as checkweighman, a post he held for twelve years.  He then became a full-time miners' agent for the Western Miners' Association.  In this role he was a close associate of William Abraham."]}, {"page": "1920 Rhondda West by-election", "response": ["The seat had become vacant when the constituency's Labour Member of Parliament (MP), William Abraham, resigned from Parliament.  He had held the seat since its creation at the 1918 general election, when he was returned unopposed. He had been the MP for the previous Rhondda constituency from its creation for the 1885 general election."]}, {"page": "William Abraham", "response": ["William Abraham is the name of:", "* William Abraham (Irish politician) (1840–1915), Irish Parliamentary Party Member of Parliament in the British House of Commons", "* William Abraham (trade unionist) (1842–1922), Welsh Liberal-Labour Member of Parliament for the Rhondda, 1885–1920", "* William Abraham (bishop) (1792–1837), Roman Catholic Bishop of Waterford and Lismore"]}, {"page": "South Wales Miners' Federation", "response": ["The Amalgamated Association of Miners (AAM) was influential in South Wales during the early 1870s, but it collapsed in 1875.  Of the AAM's various districts, only the Cambrian Miners' Association survived the collapse, but it steadily grew in membership, and other local unions were founded.  The local unions disagreed over whether to negotiate wages as part of a \"sliding scale\", where pay rose and fell in line with coal export prices.  This began to change in 1892, when the unions formed a joint committee.  Its initial members were William Abraham, David Beynon, Thomas Davies, Daronwy Isaac, J. Jones, David Morgan, Alfred Onions and Morgan Weeks from the sliding scale districts, and David Ajax, John Davies, J. Edwards, Joseph Phillips and M. Williams from the non-sliding scale districts.  Thomas Richards was elected as secretary, and the following year, Abraham was elected as president, Morgan as vice-president, and Josiah Edwards as the treasurer.  The committee achieved little, but formed a basis for the formation of the SWMF.", "In the early twentieth century, its leadership were aligned with the Liberal Party; MPs Thomas Richards, William Abraham, John Williams and William Brace all took the Liberal Party whip in parliament.  However, when the MFGB held a ballot on affiliation to the Labour Party in 1906, a majority of SWMF members voted in favour.  As the national federation narrowly voted against, another vote was held in 1908, by which time SWMF members voted 74,675 to 44,616 in favour.David Howell, British Workers and the Independent Labour Party, 1888-1906, p.51  Some in the union were radicalised by such events as the Cambrian Combine Dispute and the Tonypandy Riot of 1910."]}, {"page": "1911 in Wales", "response": ["*4 September - Members of the South Wales Miners' Federation return to work after a ten-month strike against colliery owners in the Cambrian Combine which triggered the Tonypandy riots, having accepted the 2s 3d per ton payment rate negotiated prior to the strike by William Abraham."]}, {"page": "1875 in Wales", "response": ["*December - South Wales miners, led by William Abraham, come to agreement on a sliding scale of wages in relation to prices and profits."]}, {"page": "Archibald Hood", "response": ["Hood died in Cardiff on 27 October 1902. Due to the high esteem in which he was held, his workers decided to fund a memorial in his honour. The miners contributed to a statue to be built, amassing over £600 for its construction. The 7ft6inch bronze statue was erected on the grounds of Llwynypia Library, pointing towards his colliery and was unveiled in July 1906 by William Abraham (Mabon). It was the first public statue in the Rhondda."]}]}}