{"wiki_id": "http://www.wikidata.org/entity/Q3403718", "itemLabel": "Sara Sugarman", "itemDescription": "Welsh actress and film director", "wikipedia_url": "https://en.wikipedia.org/wiki/Sara_Sugarman", "wikipedia_page": {"main": "Sara Sugarman (born 13 October 1962) is a Welsh actress and film director whose work includes Disney's Confessions of a Teenage Drama Queen (2004) and Very Annie Mary (2001). She has also appeared in films including Dealers (1989) and Those Glory Glory Days (1983).", "link_mentions": [{"page": "List of Welsh people", "response": ["*Sara Sugarman (born 1962)"]}, {"page": "Mark Mothersbaugh", "response": ["| Confessions of a Teenage Drama Queen || Sara Sugarman || Walt Disney Pictures || "]}, {"page": "Prunella Scales", "response": ["For ten years, Scales appeared as \"Dotty\" Turnbull, together with Jane Horrocks as her character's daughter, Kate Neall, in advertisements for UK supermarket chain Tesco. In 1996, Scales starred in the television film, Lord of Misrule, alongside Richard Wilson, Emily Mortimer and Stephen Moyer. The film was directed by Guy Jenkins and filming took place in Fowey in Cornwall. Also in 1996, she appeared as Miss Bates in Jane Austen's Emma. In 1997, Scales starred in Chris Barfoot's science-fiction film short Phoenix which was first aired in 1999 by NBCUniversal's Sci Fi Channel. Scales played 'The Client', an evil government minister funding inter-genetic time travel experiments. The same year she played Minny Stinkler in the comedy film Mad Cows, directed by Sara Sugarman. In 1993 Scales voiced Mrs Tiggy-Winkle in The World of Peter Rabbit and Friends."]}, {"page": "1987 in film", "response": ["| Straight to Hell || Island Pictures || Alex Cox (director/screenplay); Dick Rude (screenplay); Dick Rude, Sy Richardson, Courtney Love, Joe Strummer, Dennis Hopper, Xander Berkeley, Grace Jones, Elvis Costello, Jim Jarmusch, Miguel Sandoval, Jennifer Balgobin, Sara Sugarman, Biff Yeager, Shane MacGowan, Spider Stacy, Terry Woods, Kathy Burke, Del Zamora, Edward Tudor-Pole, Graham Fletcher-Cook, Anne-Marie Ruddock, Zander Schloss, Fox Harris || Action, Comedy || Live action"]}, {"page": "1986 in film", "response": ["| Sid and Nancy || The Samuel Goldwyn Company / Palace Pictures / Zenith Productions || Alex Cox (director/screenplay); Abbe Wool (screenplay); Gary Oldman, Chloe Webb, David Hayman, Debby Bishop, Andrew Schofield, Xander Berkeley, Perry Benson, Courtney Love, Edward Tudor-Pole, Kathy Burke, Sara Sugarman, Sy Richardson, Anne Lambton, Mark Monero, Biff Yeager, Peter Lee-Wilson, Gloria LeRoy, Milton Selzer, Iggy Pop, Tony London, Graham Fletcher-Cook, Michele Winstanley, Andy Bradford, Barbara Coles || Biopic || Live action"]}, {"page": "Keith Allen (actor)", "response": ["In September 2011 he appeared in the BBC six-part drama series The Body Farm as DI Hale. 2013 saw the release of the Sara Sugarman comedy film Vinyl in which Keith played an ageing rock star who finds himself back in the public eye after his band member fools the music industry into giving them a record deal. In 2013 he played Darren the farmer in episode 1.5 of the comedy drama series Great Night Out."]}, {"page": "Mary Hopkin", "response": ["She made a guest appearance on The Crocketts' album The Great Brain Robbery, sang the theme song for Billy Connolly's BBC TV series World Tour of England, Ireland and Wales and re-recorded \"Those Were The Days\" with Robin Williams rapping. She also appeared in the Sara Sugarman film Very Annie Mary."]}, {"page": "Tom Felton", "response": ["In January 2021, Felton was confirmed for the lead role in Sara Sugarman’s Save The Cinema which began filming in the month in Wales. He joined Jonathan Pryce and Samantha Morton. The movie will tells the true story of Liz Evans, a hairdresser and leader of a youth theatre in Carmarthen, Wales, who began a campaign in 1993 to save the Lyric theatre from closure."]}, {"page": "Rhyl", "response": ["*Sara Sugarman (born 1962), actress and film director"]}, {"page": "Confessions of a Teenage Drama Queen", "response": ["Confessions of a Teenage Drama Queen is a 2004 American teenager musical comedy film directed by Sara Sugarman from a screenplay by Gail Parent, based on Dyan Sheldon's 1999 novel of the same name. It stars Lindsay Lohan as an aspiring teenage actress whose family moves from New York City to New Jersey, Adam Garcia as her favorite rock musician, Glenne Headly as her mother and Alison Pill as her best friend. The film introduced Megan Fox in her theatrical film acting debut.", "Pre-production began on May 5, 2003, beginning with choreography rehearsals and make-up tests. Produced on a budget of $15 million, filming began on June 4. Behind the camera was Welsh director Sara Sugarman, who was known for directing the musical comedy film Very Annie Mary. While taking place in New Jersey, the film was filmed in the Canadian cities of Toronto, Hamilton, and Oakville. Scenes at Dellwood High School were filmed at King City Secondary School in King City and Birchmount Park Collegiate Institute in Scarborough. Mall scenes were filmed at Erin Mills Town Centre in Mississauga. Scenes depicting the family's move from New York to New Jersey were filmed in Hamilton. It was also filmed on-location for the scenes in New York City. Scenes involving the train station were filmed at the Watchung Avenue Train Station in Montclair, New Jersey, on New Jersey Transit's Montclair-Boonton Line."]}, {"page": "David Thewlis", "response": ["Thewlis was married to Welsh actress Sara Sugarman from 1992 until their divorce in 1994. He then had a brief relationship with English actress Kate Hardie. He was in a relationship with English actress Anna Friel from 2001 until late 2010.David Thewlis is the 'Anonymous' actor who's everywhere, Los Angeles Times, 12 January 2012. Their daughter, Gracie, was born on 9 July 2005 and later became an actress.  Thewlis married French designer Hermine Poitou on 5 August 2016."]}, {"page": "Escape from Sobibor", "response": ["* Sara Sugarman as Naomi"]}, {"page": "Arts University Bournemouth", "response": ["* Sara Sugarman, director of Confessions of a Teenage Drama Queen and Waking the Dead (Film & Television, Bournemouth Film School)"]}, {"page": "Jonas Åkerlund", "response": ["* Midas Man (2022); replaced by Sara Sugarman"]}, {"page": "Juliet Bravo", "response": ["A number of famous names, either of the time or of the future, appeared in the show. They included David Ryall, Kevin Whately, Eric Richard, Jeff Rawle, Jean Boht, Patricia Hayes, Peter Jeffrey, Peter Martin, Brenda Fricker, David Daker, Andrew Burt, Frances White, Malcolm Terris, Joe Gladwin, Sara Sugarman, Tenniel Evans, Nadim Sawalha, Jack Smethurst, John Savident, William Gaunt, Colin Baker, Kenneth Waller, Rita May, Stephen Yardley, John Woodvine, Stephen McGann, Leslie Schofield, Alan Parnaby, Shirley Stelfox, Maggie Ollerenshaw, John Quarmby, Neil Morrissey, Del Henney, Iain Cuthbertson, Leslie Sands, Hilda Braid, Melanie Hill, John Challis, Paul Chapman, Simon Williams, Christopher Ettridge, George Irving, Bill Wallis, Carolyn Pickles, Jonathan Newth, Kenneth Cope, Sally Whittaker, Karl Howman, Diana Coupland, Martin Jarvis, Rosalind Ayres, Yvette Fielding, Bert Parnaby, Robert Glenister, Mona Hammond, Steve Hodson, Danny O'Dea and Bernard Kay."]}, {"page": "List of female film and television directors", "response": ["* Sara Sugarman (UK)"]}, {"page": "Sugarman", "response": ["* Sara Sugarman, Welsh actress and film director "]}, {"page": "Matthew Rhys", "response": ["In January 1998, Rhys went to New Zealand to star in Greenstone, a colonial costume drama for television. He then landed a role in Titus, Julie Taymor's adaptation of Titus Andronicus, starring Anthony Hopkins and Jessica Lange. Next he played Ray in Peter Hewitt's film comedy, Whatever Happened to Harold Smith? After returning to Wales, he did two consecutive films with Jonathan Pryce: The Testimony of Taliesin Jones, a film about a dysfunctional single-parent family in which he played the elder son, and Sara Sugarman's comedy Very Annie Mary, in which he played the role of Nob. Rhys would later reunite with Very Annie Mary star Rachel Griffiths on Brothers & Sisters."]}, {"page": "2001 in Wales", "response": ["*Sara Sugarman writes and directs Very Annie Mary, featuring Welsh stars such as Jonathan Pryce, Kenneth Griffith, Matthew Rhys, Ioan Gruffudd, Mary Hopkin and Ruth Madoc."]}, {"page": "52nd British Academy Film Awards", "response": ["* Anthrakitts – Natasha Dack and Sara Sugarman"]}, {"page": "Pontycymer", "response": ["Among those born in the village are the artist and journalist Molly Parkin (Molly Thomas), snooker player Ryan Day, Welsh rugby captain John Lloyd, Welsh rugby league player Ike Owens and news reader Huw Edwards. Dr Dan Davies (physician to the king and chief advisor for the establishment of the NHS), Phylip Henry Rees (preacher and evangelist of the Gospel) and Wendy Phillips, ‘the cleaning lady who went to Hollywood’ who was the inspiration for all Sara Sugarman's films. It was also home to the author, neuroscientist, and stand-up comedian Dean Burnett.", "Numerous locations in Pontycymer feature as the fictional village of Ogw in the film Very Annie Mary, as well as scenes from six other short films by same director, Sara Sugarman."]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Sara Sugarman (Acting Diploma 1989)"]}, {"page": "Perry Benson", "response": ["In 2013 he played an ageing rock star alongside Phil Daniels and Keith Allen in Sara Sugarman's film Vinyl."]}, {"page": "Cinema of Wales", "response": ["Later Welsh directors, such as Sara Sugarman and Marc Evans made films set in Wales."]}, {"page": "Stephen H. Burum", "response": ["| Sara Sugarman"]}, {"page": "List of American films of 2004", "response": ["| Confessions of a Teenage Drama Queen || Walt Disney Pictures || Sara Sugarman (director); Gail Parent (screenplay); Lindsay Lohan, Adam Garcia, Glenne Headly, Alison Pill, Eli Marienthal, Megan Fox, Carol Kane, Sheila McCarthy, Tom McCamus, Ashley Leggat, Adam MacDonald, Pedro Miguel Arce, Richard Fitzpatrick, Sheila Sealy-Smith, Barbara Mamabalo, Maggie Oskam, Rachael Oskam, Connor Lynch || Teen, Comedy, Drama, Family ||"]}, {"page": "BAFTA Award for Best Short Film", "response": ["|Anthrakitis || Sara Sugarman, Natasha Dack "]}, {"page": "List of Western films of the 1980s", "response": ["|Straight to Hell || Alex Cox || Dick Rude, Sy Richardson, Courtney Love, Joe Strummer, Miguel Sandoval, Jennifer Balgobin, Sara Sugarman, Biff Yeager, Shane MacGowan, Spider Stacy, Terry Woods, Xander Berkeley, Kathy Burke, Elvis Costello, Del Zamora, Edward Tudor-Pole, Dennis Hopper, Jim Jarmusch, Grace Jones, Graham Fletcher-Cook, Anne-Marie Ruddock, Zander Schloss, Fox Harris || United Kingdom || Punk Rock Spaghetti Western"]}, {"page": "List of Welsh films", "response": ["2001: Very Annie Mary, starring Rachel Griffiths, Holywell-born Jonathan Pryce and Ioan Gruffudd, was directed by Sara Sugarman."]}, {"page": "History of the Jews in Wales", "response": ["* Sara Sugarman"]}, {"page": "List of British films of 1999", "response": ["|Mad Cows||Sara Sugarman||Anna Friel, Joanna Lumley||Comedy|| http://www.bbfc.co.uk/releases/mad-cows-1999-1"]}, {"page": "List of directorial debuts", "response": ["* Sara Sugarman† – Mad Cows"]}, {"page": "Dealers (film)", "response": ["*Sara Sugarman as Elana"]}, {"page": "List of British former child actors", "response": ["*Sara Sugarman (born 1962)"]}, {"page": "Graham Broadbent", "response": ["He previously created and directed with Damien Jones the production company Dragon Pictures, for which he produced Welcome to Sarajevo (1996) by Michael Winterbottom, shown in the Festival de Cannes 1997, and cited by Time Magazine as one of the ten best films of the year, as well as Dancing at the Blue Iguana (2000) by Michael Radford, Some Voices by Simon Cellan Jones, Very Annie Mary (2001) by Sara Sugarman, Splendor (1999) by Gregg Araki, A Texas Funeral by William Blake Herron and The Debt Collector."]}, {"page": "Very Annie Mary", "response": ["Very Annie Mary is a 2001 musical-comedy film, written and directed by Sara Sugarman and starring Rachel Griffiths and Jonathan Pryce. It is a coming-of-age tale, set in south Wales, about a woman in her 30s who lives with her verbally abusive father. It was filmed on location in Bridgend and at Workingman's Institute and Memorial Hall, Newbridge, Wales."]}, {"page": "Morag Siller", "response": ["| Jack Shepherd/Sara Sugarman"]}, {"page": "Jynine James", "response": ["James has also appeared with Phil Daniels in the Sara Sugarman film Vinyl, the Tim Burton film Charlie and the Chocolate Factory, and the BAFTA-nominated BBC Three reality TV series Little Angels.", "| 2013 || Vinyl || Mourner || Altive films || Sara Sugarman "]}, {"page": "Laura Evans", "response": ["In September 2014 she joined other well known Welsh and American actors to celebrated the 100th birthday of Dylan Thomas, appearing in a staged radio play of Under Milk Wood  with LA Theater works LA Theatre works alongside Mathew Rhys and Kate Burton directed by Sara Sugarman playing several roles and singing the famous folk song as character Polly Garter.  She has most recently played Belle in the Newcastle pantomime, Beauty and the Beast, at the Newcastle Theatre Royal from November 2019 to January 2020.She has also played Tinker Bell, Goldilocks and Cinderella at the Theatre Royal Newcastle in Peter Pan, Goldilocks and the Three Bears and Cinderella"]}, {"page": "List of Minder episodes", "response": ["|colspan=\"3\"|Guest stars: Stanley Meadows as Ronald Shyver, Sara Sugarman as Zoe, Gerard Murphy as Kevin O'Hara, Richard Ireson as Market Stallholder, George Little as Ted."]}, {"page": "Those Glory Glory Days", "response": ["Those Glory Glory Days is a 1983 British made-for-television film about football directed by Philip Saville and starring Zoë Nathenson, Sara Sugarman and Cathy Murphy. The screenplay was written by the sports journalist Julie Welch. The film is inspired by Welch's childhood love of football, and helped to establish her as a screenwriter. The film was part of David Puttnam's 'First Love' series broadcast on Channel 4. It was released on 17 November 1983.", "*Sara Sugarman – Toni"]}, {"page": "2012 in Wales", "response": ["*Vinyl – directed by Sara Sugarman and starring Keith Allen, based on the story of the hoax single released by Mike Peters under the guise of a younger band in 2004."]}]}}