{"wiki_id": "http://www.wikidata.org/entity/Q3418621", "itemLabel": "Ramsay Traquair", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Ramsay_Traquair_(architect)", "wikipedia_page": {"main": "Ramsay Traquair (29 March 1874 – 26 August 1952) was a Scottish architect and academic with strong links to Canada. He is remembered more for his numerous publications than for his buildings, which are limited in number. He was a particular expert on Early Canadian and French-Canadian architecture.", "link_mentions": [{"page": "List of Scots", "response": ["* Ramsay Traquair, architect and academic with strong links to Canada"]}, {"page": "Chalcis", "response": ["The church of Saint Paraskevi (the patron saint of the island) was the church of the Dominican Priory of Negroponte, one of the first two houses authorized for the Order of Preachers' Province of Greece in 1249. Started about 1250, this is among the oldest examples of early Dominican architecture surviving, and is one of the only early Dominican churches to retain its original form until the present.Nikolaus Delinikolaos and Vasiliki Vemi, \"Αγία Παρασκευή Χαλκίδας. Ένα βενετικό πρόγραμμα ανοικοδόμησης του 13ο αιώνα.\"  in Chryssa Maltezou and  Christina E. Papakosta eds., Venezia-Eubea, Da Egripos a Negroponte, 2006, 229-266, at pages 248—49.Pierre MacKay, \"St. Mary of the Dominicans: The Monastery of the Fratres Praedicatores in Negropont.\" in Chryssa Maltezou and  Papakosta eds., Venezia-Eubea, 125-156. The central arch over the iconostasis and the ceiling and walls of the south chapel are the best examples of Italian Gothic stone-carving in Greece.Ramsay Traquair, \"Frankish Architecture in Greece,\" Journal of the Royal Institute of British Architects Third Series, 31, (1923—24) 42—48, fig. 13 (\"Italian Gothic\", p. 47). Images of the Dominican saints, Dominic and Peter Martyr, stand at the base of the central arch.The two first Dominican saints can just be made out at the base of the arch in a photograph in Beata Panagopoulos, Cistercian and Mendicant Monasteries in Mediaeval Greece. Chicago, 1979, plate 105, p. 133, but not with any detail. The north chapel holds the tomb of the founder of the senatorial Lippamano family of Venice.  Some of the column capitals are Byzantine."]}, {"page": "Frank Mears", "response": ["He trained as an architect, initially under Hippolyte Blanc (1896-1901), and then, in 1903, under Robert Weir Schultz (1860-1951). In 1906, after tours of England and the Continent, he returned to Scotland and worked under Ramsay Traquair (1874-1952). In 1908 he became an assistant to the pioneer planner Patrick Geddes (1854-1932), working on the Civic Survey of EdinburghGeddes, P. (1911), The Civic Survey of Edinburgh, Transactions of the Town Planning Conference of the Royal Institute of British Architects, 10–15 October 1910, RIBA 1911 for the first ever Town Planning Exhibition (1910).", "In the course of his career, Mears prepared a number of schemes for monuments and memorials.  With Ramsay Traquair he prepared schemes for a memorial to Edward VII & I at the foot of the Canongate (1911) and the completion of the National Monument on Calton Hill (1912).Mears, F.C. & Traquair, R. (1912), 'Public Monuments', in The Blue Blanket: An Edinburgh Civic Review, vol. 1, no. 1, January 1912 In 1919 he submitted a proposal for a Scottish National War Memorial as Via Sacra following the line of Johnston Terrace on the southern slope of the Edinburgh Castle Rock.  In 1926, Mears was engaged to prepare a scheme for a National Memorial to David Livingstone at Livingstone's birthplace in Blantyre. A series of relief tableaux and a World Fountain were devised in collaboration with the sculptor, Charles d'Orville Pilkington Jackson.MacNair, James I. (1951), The Story of the Scottish National Memorial to David Livingstone, The Scottish National Memorial to David Livingstone Trust, Blantyre In 1950, Mears worked with his partners, H.A. Rendel Govan and Robert J. Naismith, and Pilkington Jackson on the design for the monument to his old regiment, the Royal Scots, in Princes Street Gardens, Edinburgh.'A monument to commemorate the past services of the Royal Scots Regiment', The Architect and Building News, 28 April 1950'Monument to the Royal Scots Regiment, The Architect and Building News, 26 June 1952"]}, {"page": "Ramsay Traquair", "response": ["thumb|Ramsay Traquair's grave, Colinton churchyard, Edinburgh"]}, {"page": "Architecture of Scotland", "response": ["* Ramsay Traquair, architect and academic with strong links to Canada"]}, {"page": "Arts Building (McGill University)", "response": ["In 1855, the new principal of McGill College, Sir William Dawson arrived to a disorderly campus. Dawson, who lived in the building's east wing, decided to fix up the campus, and hired J.W. Hopkins to add the portico with Doric columns that the Royal Institution had previously intended to build in front of the central block, though made out of wood. Dawson convinced Sir William Molson to donate to construct the McGill College Building's west wing, which would be called Molson Hall. The west wing was built in 1861 by William Spier, and held the convocation hall, classrooms, chemistry labs, a museum and a library. In 1888, Alexander Francis Dunlop made major alterations to the building's east wing for the Science Department. At some point within the next few decades, as McGill continued to grow, the McGill College Building was renamed the Arts Building. In 1921, Ramsay Traquair, the director of the McGill School of Architecture at the time, designed the McGill flag and presented it to the university. As of 2020, it continues to fly above the Arts Building."]}, {"page": "Stewart Henbest Capper", "response": ["The partnership with Simon was brief and dissolved in 1892, and Capper thereafter involved himself closely in the project ideas of Patrick Geddes who sought to make good use of abandoned and derelict properties in Edinburgh’s Old Town to house students for the \"Town and Gown University Settlement\", which although now viewed largely as a philanthropic and conservationist gesture this was primarily as a money-making exercise. This involved Capper hugely extending the previously very small Georgian terrace at Ramsay Gardens to create a hugely picturesque building now an iconic part of Edinburgh’s townscape. This (although now hard to believe) was done as low-cost student housing but incorporated a house for Geddes himself within it. Sadly Capper’s ill-health returned during the project and over-seeing of the completion and final detailing was done by Sydney Mitchell who is often incorrectly given credit for the full project. Together with the Ramsay Gardens project Capper also remodelled Riddle’s Court, James Court and several Lawnmarket blocks as part of the same University Settlement concept. During this period Capper employed Ramsay Traquair as his assistant.", "In 1903 he returned to Britain, taking a chair as Professor of Architecture in Victoria University of Manchester. His successor in McGill University, Percy Erskine Hobbs, left McGill in 1909 and Capper expressed an interest in returning, but the position was instead filled, rather ironically, by Capper’s former assistant, Ramsay Traquair, and Capper continued in Manchester until 1912."]}, {"page": "Thistle Chapel", "response": ["The Thistle Chapel also dates to a period of when Scottish architects were attempting to recreate a distinctly Scottish style of church architecture. Ranald MacInnes, Miles Glendinning, and Aonghus MacKechnie identify the Thistle Chapel as \"the most emphatic example of the nationalist trend in church architecture\". MacInnes, Glendinning, and MacKechnie contrast the Chapel's \"ecclesiastical lavishness\" and \"Rosslyn-like elaboration\" with John James Burnet's \"simpler evocation of archaic monumentality\" and Ramsay Traquair and Reginald Fairlie's revival of the neo-Romanesque trend in 15th century Scottish church architecture.MacInnes, Glendinning, MacKechnie 1996, p. 372.MacInnes, Glendinning, MacKechnie 1999, p. 89."]}, {"page": "Traquair (disambiguation)", "response": ["* Ramsay Traquair (1840–1912), Scottish palaeontologist", "* Ramsay Traquair (architect) (1874–1952), Scottish architect"]}, {"page": "Moray Estate", "response": ["Notable residents include Thomas de Quincey (1), Thomas Chalmers (3), Robert Omond (4), John Montgomerie Bell (4), Ramsay Traquair (4), Sir Alexander Kinloch (5), David Paulin (6) and Archibald Fleming (9), James Maidment (10)."]}, {"page": "McGill School of Architecture", "response": ["In 1903, Capper returned to England to establish the School of Architecture at Victoria University of Manchester, which was the fourth university architecture school to be established in the British Commonwealth, after University of Toronto (1890), University of Liverpool (1894) and McGill (1896). The second director of the School, Percy Nobbs, arrived at McGill in 1903 to only two students. Nobbs is credited with designing the McGill coat of arms three years into his tenure. As director, he divided the four-year course into two streams, the BArch degree and the BSc degree in Architectural Engineering. By 1906, he was teaching six classes, so he hired three new staff to assist him, including his former colleague Cecil Burgess. Nobbs believed students should be exposed to architecture in practice, and designed the McGill Union (today the McCord Museum) across from McGill's Roddick Gates. After the Macdonald Engineering Building burned down in 1907, Nobbs designed the new building in its place, and the School of Architecture moved to its ground floor. By 1912, the School had grown to eight students, and the next year, Philip J. Turner joined the faculty. In 1913, Ramsay Traquair became the new director. He is credited with designing the McGill flag, which he presented to the university in 1921 and has since flown above the Arts Building. ", "| Ramsay Traquair || 1913–1939", "*Ramsay Traquair – third director of the School, taught from 1913 to 1939"]}, {"page": "Philip J. Turner", "response": ["Turner emigrated to Canada in 1906, and joined the McGill School of Architecture's faculty in 1910, where he first taught a lecture on Building Construction. He soon began to also teach Materials of Construction, Professional Practice and Specifications, and was appointed Professor in 1933. In addition to teaching at the School of Architecture, Turner was appointed Special Lecturer on Library Buildings in 1926 in the McGill Library School, which he continued to hold until after his retirement from the architecture school. In 1939, he succeeded Ramsay Traquair as the director of the School of Architecture, a position he held for only two years until 1941. During these two years, however, he accomplished a great deal at the School. Turner became director at a time when student enrollment was very low, in the wake of the Great Depression in Canada and the outbreak of World War II. Enrollment was so low that the Principal of McGill at the time, Lewis Williams Douglas considered phasing out architectural education at McGill. As director, Turner, along with his Executive Secretary, John Bland, fought the threat of the School's closing and gathered the support of several distinguished architects in Montreal, ultimately convincing the Principal not to close the School. He created an advisory committee on the School of Architecture in 1939, with E.I. Barott, Harold Lea Fetherstonhaugh and J.C. McDougal representing the profession, and he and Percy Nobbs representing the School."]}]}}