{"wiki_id": "http://www.wikidata.org/entity/Q342962", "itemLabel": "Anthony Head", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Head", "wikipedia_page": {"main": "Anthony Stewart Head (born 20 February 1954) is an English actor and singer. Primarily a performer in musical theatre, he rose to fame in the UK in the 1980s following his role in the Gold Blend couple television advertisements for Nescafé, which led to major roles in several television series. He is best known for his roles as Rupert Giles in Buffy the Vampire Slayer (1997–2003), the Prime Minister in Little Britain (2003–2006), and Uther Pendragon in Merlin (2008–2012), as well as voicing Herc Shipwright in BBC Radio 4's Cabin Pressure.", "link_mentions": [{"page": "February 20", "response": ["*  1954   – Anthony Head, English actor"]}, {"page": "1954", "response": ["** Anthony Head, English actor, musician"]}, {"page": "Christopher Lee", "response": ["In 2007, Lee collaborated with Burton on Sweeney Todd: The Demon Barber of Fleet Street, playing the spirit of Sweeney Todd's victims, called the Gentleman Ghost, alongside Anthony Head, with both singing \"The Ballad of Sweeney Todd,\" its reprises and the Epilogue. These songs were recorded, but eventually cut since Burton felt that the songs were too theatrical for the film. Lee's appearance was completely cut from the film, but Head still had an uncredited one-line cameo."]}, {"page": "Uther Pendragon", "response": ["*In the BBC television series Merlin, Uther, played by Anthony Head, has banned magic in Camelot and slaughtered any who openly practise the art. It is revealed his wife Ygraine was unable to conceive, so Nimueh, a sorceress and friend, helped in the conception of Arthur. However, to keep balance in the world, a life had to be taken in exchange. Thus, Ygraine died at Arthur's birth, and Uther's guilt spurred him to purge all magic from Camelot. His wanton cruelty eventually causes his ward Morgana, who possesses magic herself, to turn against him. She is later revealed as his illegitimate daughter, and covets control of Camelot from then on. In series 4, Uther is wounded during an assassination attempt on Arthur. Merlin tries to heal him but due to Morgana's meddling, the spell instead kills him."]}, {"page": "The Rocky Horror Show", "response": ["The Rocky Horror Show has toured the United Kingdom regularly since the 1990–91 West End revival at the Piccadilly Theatre in productions produced by Richard O'Brien's and Howard Panter's Rocky Horror Company. Notable celebrities have been cast including Daniel Abineri, Peter Blake, Tim McInnerny, Anthony Head, Robin Cousins, Jason Donovan and Jonathan Wilkes as Frank-N-Furter, Gina Bellman as Janet Weiss, Edward Tudor-Pole as Riff Raff and TV's Craig Ferguson and Adrian Edmonson as Brad Majors.", "On 3 May 2006, a benefit concert version of the musical to raise money for Amnesty International. Entitled The Rocky Horror Tribute Show, it was staged at the Royal Court Theatre (where the show had its world premiere in 1973) as a one night only event hosted by Richard O'Brien. The cast featured Anthony Head and Michael Ball sharing the role of Frank-N-Furter, Ade Edmondson and Stephen Gately sharing the role of Brad, Joanne Farrell and Sophie Lawrence sharing the role of Janet, Kraig Thornber as Riff Raff, Toyah Willcox as Magenta, Amy Rosefield as Columbia, Gary Amers as Rocky Horror, Ben Richards as Eddie, Julian Littman as Dr. Scott, and original cast member Patricia Quinn as The Usherette. Christopher Biggins, Rayner Bourton, Robin Cousins, Steve Pemberton, Tony Slattery, Jamie Theakston and O'Brien served as the show's narrators, introducing each musical number. The concert also featured guest appearances from the original Columbia Nell Campbell, and Kimi Wong, O'Brien's first wife and cast member from the 1975 film adaptation of the musical.", "In 2015, the 40th anniversary tour was staged in the London Playhouse Theatre and also broadcast in many cinemas across Europe, as well as on the BBC in October 2015, with Richard O'Brien taking the role as narrator for the London dates only. On opening night, he received seven standing ovations when appearing on-stage. Tickets for the first week sold out in 72 hours so a second week was added. A charity gala night on 17 September at the Playhouse featured actors Stephen Fry, Anthony Head and former Spice Girl Emma Bunton sharing the role of narrator. A UK-wide tour followed the London production.", "| align=\"center\"|Emma BuntonAde EdmondsonStephen FryAnthony HeadMel GiedroycRichard O'Brien"]}, {"page": "Alexis Denisof", "response": ["The end of the series in 2004 saw a lag in Denisof's career. Save for appearing in three episodes of the hit series How I Met Your Mother, as the goofy philandering Sandy Rivers, Denisof would not work as much as he used to for the next several years. During this time he appeared in several stage productions, including Rope at Chichester Festival Theatre's Minerva Theatre with Anthony Head, who played Wesley's predecessor Rupert Giles on Buffy. Most likely due to his time playing an English character on Angel, Denisof was among 200 actors considered for the role of James Bond in Casino Royale, but lost out to Daniel Craig. Later, in 2008, he appeared in season 2 of Private Practice as a man named Daniel, a bigamist who has two pregnant wives who don't know about each other. In 2009, he appeared in four episodes of Joss Whedon's Dollhouse as Senator Daniel Perrin."]}, {"page": "1954 in television", "response": ["| Anthony Head"]}, {"page": "1981 in film", "response": ["| Lady Chatterley's Lover ||  Cannon Films / Columbia Pictures || Just Jaeckin (director/screenplay); Marc Behm, Christopher Wicking (screenplay); Sylvia Kristel, Nicholas Clay, Shane Briant, Ann Mitchell, Elizabeth Spriggs, Pascale Rivault, Peter Bennett, Anthony Head, Frank Moorey, Bessie Love, John Tynan, Michael Huston, Fran Hunter, Ryan Michael, Mark Colleano || Romance, Drama || Live action"]}, {"page": "Xander Harris", "response": ["Xander Harris is introduced in season one's (1997) two-part premiere \"Welcome to the Hellmouth\"/\"The Harvest\". Xander meets Buffy Summers (Gellar), the Slayer, on her first day at Sunnydale High, as well as her Watcher Rupert Giles (Anthony Head). While in the library, he secretly listens in on a and conversation between Buffy and Giles in which she idenitifies herself as, the Slayer. After his friend Jesse (Eric Balfour) is made a vampire, Xander accidentally kills him, resulting in him resenting vampires. Xander and his best friend Willow (Hannigan) become Buffy's reliable sidekicks. He pines for Buffy's romantic affection, oblivious to Willow's affections for him, and distrusts Buffy's boyfriend, the ensouled vampire Angel (David Boreanaz). In the season finale, \"Prophecy Girl\", Xander saves Buffy's life by administering CPR after she is drowned by the Master (Mark Metcalf). "]}, {"page": "Tony Head", "response": ["#REDIRECT Anthony Head"]}, {"page": "James Marsters", "response": ["He attracted the attention of the general public for his appearance as villain (and later anti-hero) Spike on the television series Buffy the Vampire Slayer (first appearing in season 2). For the role, he put on a London accent and he received informal coaching from English co-star Anthony Head."]}, {"page": "Jenny Calendar", "response": ["Originally trained as a dancer who toured and appeared in music videos with Prince, Robia LaMorte won the part of Jenny Calendar. LaMorte had appeared in contemporary television series such as Beverly Hills, 90210, but remarked specifically that she knew at once the material given to her to read in the audition for Buffy was different: \"Sometimes you get scripts, and you just know. The words just fit in your mouth a different way when you know you're supposed to speak them. And I kind of knew I was going to get it.\" Anthony Head, who plays Giles on the series, had already been cast and was scheduled to read with LaMorte so the casting department could gauge their chemistry—which Head acknowledged, later saying, \"She's gorgeous, like a David Bailey picture.\" LaMorte spent a few minutes before the audition speaking and joking with Head, assuming he was a producer. When it came time for them to enter the audition room together, she handed him the chewing gum from her mouth only to learn that he was the actor cast to play opposite her.Golden and Holder, pp. 219–221."]}, {"page": "Michael Fenton Stevens", "response": ["In 2020, with help from his son John Fenton Stevens, a series of podcasts have been released called My Time Capsule with guests such as Stephen Fry, Rebecca Front, Rick Wakeman, Mark Gatiss, Rufus Hound, David Mitchell, Anthony Head, Chris Addison, Rev Richard Coles, Griff Rhys Jones, Richard Herring and David Baddiel."]}, {"page": "Chess (musical)", "response": ["The London version expanded the storyline of the concept album, adding considerable new recitative. The three principal singers from the concept album, Elaine Paige, Tommy Körberg and Murray Head reprised their roles on stage. Barbara Dickson was unable to appear, and Siobhán McCarthy played the part of Svetlana, and the cast also featured Anthony Head, Grainne Renihan, Ria Jones, David Burt and Peter Karrie, during its three-year run. The show won the Critics' Circle Theatre Award for Best Musical and received three 1986 Laurence Olivier Award nominations for Best Musical, Outstanding Performance by an Actor (Tommy Körberg) and Outstanding Performance by an Actress (Elaine Paige). The production closed on 8 April 1989."]}, {"page": "Murray Head", "response": ["Head was born in London to Seafield Laurence Stewart Murray Head (1919 – 22 March 2009) and Helen Shingler (1919−2019). Head's father was a documentary filmmaker for Verity Films. Head's mother played Mme Maigret alongside Rupert Davies in the BBC 1960s television adaptation of the Maigret novels written by Georges Simenon. Head's younger brother Anthony Head is also an actor, best known for playing Rupert Giles in the TV series Buffy the Vampire Slayer."]}, {"page": "Jonathan Creek", "response": ["The role of Adam Klaus was originally cast to Anthony Head in 1997 in the pilot episode (\"The Wrestler's Tomb\"). However, after accepting the role of Rupert Giles on Buffy the Vampire Slayer, Head was unable to play Adam Klaus in later episodes, leaving the way clear for Stuart Milligan to take over the role. This explains why Adam Klaus is missing in episodes 2–5 of series 1.", "| Anthony Head"]}, {"page": "My Family", "response": ["* Anthony Head"]}, {"page": "Spooks (TV series)", "response": ["The programme was created by writer David Wolstencroft, and produced by Kudos for the BBC. A trademark style, coupled with the series' popularity, attracted a large number of high-profile guest stars. These included Martine McCutcheon, Hugh Laurie, Haluk Bilginer, Robert Hardy, Tim McInnerny, Bruce Payne, Reece Dinsdale, Ian McDiarmid, Ewen Bremner, Jimi Mistry, Andy Serkis, Benedict Cumberbatch, Kevin McNally, Rupert Graves, Andrew Tiernan, Anton Lesser, Anupam Kher, Alexander Siddig, and Anthony Head."]}, {"page": "Doctor Who (film)", "response": ["Casting sessions took place in March 1994; actors who actually auditioned for the role include Liam Cunningham, Mark McGann, Robert Lindsay, Tim McInnerny, Nathaniel Parker, Peter Woodward, John Sessions, Anthony Head, and Tony Slattery. Paul McGann was first considered around the time of these auditions, but did not formally audition for the part until later.", "*Anthony Head guest-starred in the Series 2 episode \" School Reunion\" as Mr. Finch."]}, {"page": "List of show business families", "response": ["*Murray (1946–) and Anthony Head (1954–)"]}, {"page": "Little Britain", "response": ["Other regular cast include: Anthony Head as the Prime Minister, Ruth Jones as Myfanwy, Charu Bala Chokshi as Meera, and Joann Condon as Fat Pat."]}, {"page": "List of sibling pairs", "response": ["* Murray and Anthony Head; actors"]}, {"page": "Alfred Pennyworth", "response": ["* Anthony Head voiced Alfred Pennyworth in Batman: Gotham by Gaslight."]}, {"page": "Manchild (TV series)", "response": ["The show starred Ray Burdis (Gary), Nigel Havers (Terry), Anthony Head (James) and Don Warrington (Patrick) as four successful fifty-something men dealing with  different problems such as marriage and children or life after divorce, aging parents, sexual dysfunction, lost youth, a succession of (younger) girlfriends, and the problems of how to enjoy the wealth and success they worked so hard to achieve."]}, {"page": "Master (Buffy the Vampire Slayer)", "response": ["When Buffy arrives in the school library, however, she finds that the new librarian, Giles (Anthony Head), is expecting her and ready to continue her training. His expectation that she is there to take up her role as Slayer upsets her; she wants nothing to do with him or with Slaying. Giles is, in fact, Buffy's new Watcher, a mentor who will teach her about the demons she must face, as well as supervise her training in weapons and battle strategy. Although she desperately desires to be a mere high school student, she is unsuccessful in avoiding her destiny to fight vampires. On her first day she finds a vampire's victim at school, and resumes her work as the Slayer.Kaveny, p. 14.Stafford, pp. 2–6.Golden and Holder, pp. 2–5."]}, {"page": "Adam (Buffy the Vampire Slayer)", "response": ["Buffy the Vampire Slayer had been very successful in its first three seasons on television, but some of the characters left the series and storylines ended, creating a need for an entire shift in location and mission. Buffy and the core group of friends who fight with her graduate from high school, while the school itself was blown up in the third-season finale. The fourth season, therefore, presents viewers with Buffy, her best friends Willow (Alyson Hannigan), Xander (Nicholas Brendon), and mentor Giles (Anthony Head) at a crossroads. Series creator Joss Whedon called it a \"strange, sort of schizophrenic season\" with a \"weird incoherence\", but also stated that the episodes in the fourth season were among the series' best. The writers set out to explore the characters' trials as they discover more about themselves following the defining years of high school. Although they had been a cohesive group of friends in the first three seasons, situations arise in the fourth to separate them. The writers focused on each of the four core characters individually throughout the season to increase the impact of their finally coming back together in the penultimate episode, \"Primeval\", when they merge their essences to form a super-Buffy in order to defeat Adam."]}, {"page": "Graham Linehan", "response": ["Linehan has also appeared in The Day Today and in two episodes of Garth Marenghi's Darkplace, and has had cameos in Black Books (series one, episode two, as \"I love books\" Guy, and series one, episode five as Fast Food Customer), and the Father Ted episodes \"Good Luck Father Ted\", \"Entertaining Father Stone\", \"Flight Into Terror\", \"Cigarettes, Alcohol and Rollerblading\" and \"Chirpy Burpy Cheap Sheep\". He had cameos in four episodes of The IT Crowd: as Messy Joe's Restaurant Musician, in series one, episode three; the blind sorcerer, in series two, Episode six; as an audience member of Jen's speech, in series three, episode four; and as Beth Gaga Shaggy, in series four, episode three. He appeared in the Identity Parade round of Never Mind the Buzzcocks. He has also appeared in the pilot of Little Britain, as well as in series one, episode four, as a bystander who gets in the way of character Kenny Craig when he is attempting to hypnotise, from a distance, a man whose car he has crashed into. He also appeared in series one, episode five, in which he played a journalist called Roy Sloan (from Whizzer and Chips) during a conference with Prime Minister Michael Stevens (Anthony Head). Linehan was one of the writers interviewed by Charlie Brooker in a special interview episode of the fifth series of Brooker's Screenwipe programme, and again on Brooker's Gameswipe in 2010. Linehan also appeared as a guest panellist on Have I Got News for You in 2011 and again in 2012, and he made his debut as a guest on the BBC show QI in the 11th series (K series) in 2013, receiving a score of −19."]}, {"page": "David Walliams", "response": ["The pair are best known for Little Britain, which ran from 2003 to 2009 on the BBC in the UK and from 2008 onwards on HBO in the USA. The programme first aired on BBC Three before moving to the more mainstream BBC One. Among the characters Walliams played were Emily Howard, a deluded \"transvestite\"; Ray McCooney, an insane Scottish hotel owner; and Sebastian Love, an aide de camp to the Prime Minister (portrayed by Anthony Head) on whom Love has a huge crush. A successful live stage show of the series, Little Britain Live, was produced in 2006. A number of seasonal and charity specials followed, up to 2009. A spin-off series produced in the United States by HBO, Little Britain USA, aired in 2008. The characters from Little Britain played by Walliams and Lucas appeared in a 2010 UK television advertising campaign for the Nationwide Building Society. In January 2005 Walliams and Lucas were named the most powerful people in TV comedy by Radio Times."]}, {"page": "Gabriele Amorth", "response": ["Amorth was also interviewed for the second episode of True Horror with Anthony Head, presented by Anthony Head. He explained he would never perform an exorcism based solely on someone's claims of possession; always directs people to psychiatrists and doctors first, and that when he sees someone is not possessed but the person still insists, he replies: \"You have no devil. If you have a problem, talk to a good vet.\""]}, {"page": "Angel (Buffy the Vampire Slayer)", "response": ["Angel's first appearance is in \"Welcome to the Hellmouth\", the first episode of Buffy the Vampire Slayer in 1997. In it, he meets the protagonist Buffy Summers (Sarah Michelle Gellar), a young girl destined to fight evil in the small town of Sunnydale, California. For the first half of the season, Angel is an enigmatic love interest for Buffy, showing up only to offer her cryptic messages about upcoming threats. It isn't until the episode \"Angel\" that the character is revealed to be a benevolent vampire from Galway, Ireland, who emigrated to the United States to escape his past as the sadistic Angelus after his soul was restored by a vengeful Romani clan. Although uneasy about trusting a vampire, Buffy and the Scooby Gang eventually come to view Angel as an ally. In the second season (1997–1998), Buffy and Angel's romantic relationship develops and the pair make love in the episode \"Surprise\". For experiencing a moment of pure happiness, however, the Romani curse on Angel is revoked, unleashing his soulless alter-ego, who reunites with his old friends, vampires Spike (James Marsters) and Drusilla (Juliet Landau), and begins terrorizing Buffy and her friends. Upon discovering Romani descendant Jenny Calendar (Robia LaMorte), who is working to translate the text of a spell to restore Angel's soul, Angelus murders her by breaking her neck, and places her body in the bed of her boyfriend, Giles (Anthony Head), for him to discover. Angelus then attempts to destroy the world by awakening the demon Acathla. In the season finale, neophyte witch Willow (Alyson Hannigan) manages to restore Angel's soul at the last moment, but Buffy is forced to kill him to save the world from Acathla, and Angel is sent to hell. In season three (1998–1999), episode three, \"Faith, Hope & Trick\", Angel is inexplicably returned from hell by an unknown party and is soon found by Buffy. The Scooby Gang are outraged when they discover that Buffy has been secretly caring for him since his resurrection, but grudgingly accept him after he saves Willow's life in episode seven, \"Revelations\". In the episode \"Amends\", the primordial First Evil attempts to manipulate Angel to murder Buffy, but Angel chooses suicide instead by waiting for the sun to rise on Christmas morning. California's heatwave is suddenly interrupted by a freak snowstorm hiding the sun, sparing Angel's life, which he takes as a sign from God that he was brought back for a reason. Buffy and Angel initially attempt to be friends but eventually resume their romance. However, Angel becomes more and more aware of their limitations as a couple and breaks up with her in the hopes that she will be happier without him, leaving Sunnydale altogether after attending Buffy's prom and helping her in the battle against Mayor Wilkins (Harry Groener)."]}, {"page": "Mayor (Buffy the Vampire Slayer)", "response": ["In their efforts to track and defeat Balthazar and his cohorts, Buffy and Faith flirt with lawlessness, breaking into a store and stealing weapons, then escaping police custody to complete their mission. The Deputy Mayor, who has begun to show a reluctance to participate in the Mayor's plans and is keeping track of the Slayers, follows them to warn them of Mr. Trick and the Mayor's intention to have them killed. In the heat of fighting, Faith accidentally stakes and kills the Deputy Mayor, believing him to be a vampire. While Buffy feels terrible guilt for being a part of the Deputy Mayor's death, Faith claims not to, and resents Buffy for continuing to speak of it in \"Consequences\". Faith tells Buffy's Watcher Giles (Anthony Head) that it was Buffy who killed the Deputy Mayor; he does not believe her and she is taken into custody to be dealt with by the Watchers' Council. She escapes and tries to leave town, only to be stopped by Buffy. Mr. Trick appears on the scene to try to kill them both, and Faith saves Buffy by killing Mr. Trick. She then goes to the Mayor's office and offers him her services,Holder, et al, pp. 175–176. but continues to pretend to be fighting on Buffy's side. Eventually her alliance with the Mayor is exposed and she is revealed as Buffy's enemy."]}, {"page": "Michael Ball", "response": ["* Rocky Horror Tribute Show (2008) Frank-N-Furter (Recorded in 2006 – Ball shared the role with Anthony Head)"]}, {"page": "List of American advertising characters", "response": ["| Taster's Choice couple || Taster's Choice instant coffee || data-sort-value=\"1990\" | debuted 1990 || played by Anthony Head and Sharon Maughan"]}, {"page": "Doctor Who spin-offs", "response": ["The 2006 and 2007 series were companioned with a CBBC show entitled Totally Doctor Who. Series 1 was presented by CBBC and Smile presenter Barney Harwood and Blue Peter presenter Liz Barker.  For the show's second series Barker was replaced by SMart presenter Kirsten O'Brien. During the second series, an animated serial, The Infinite Quest, was featured.  David Tennant and Freema Agyeman reprised their roles from the live-action television series while Anthony Head, a guest star during the 2006 season, returned in a different role."]}, {"page": "Michael Easton", "response": ["Easton returned to acting in 1995 with Fox's VR.5 as Duncan, co-starring with Fame alumni Lori Singer and Buffy the Vampire Slayer’s Anthony Head. This was followed up with a turn as the lead in showrunner Stephen J. Cannell's Two. He played the dual roles of a Seattle professor who is framed for murder by his previously unknown twin, and is forced to go on the run from the FBI in order to clear himself of his brother's crimes. Easton co-wrote the episode “A.D.”, and also penned the series finale, “The Reckoning”."]}]}}