{"wiki_id": "http://www.wikidata.org/entity/Q3423320", "itemLabel": "Reg Skrimshire", "itemDescription": "Welsh rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Reg_Skrimshire", "wikipedia_page": {"main": "Reginald \"Reg\" Truscott Skrimshire (30 January 1878 – 20 September 1963) was a Welsh international rugby union forward who played club rugby for Newport and county rugby for Kent. He won three caps for Wales and was the only Welsh representative on the 1903 British Isles tour.", "link_mentions": [{"page": "Newport RFC", "response": ["*  Reg Skrimshire 1903"]}, {"page": "1963 in Wales", "response": ["*20 December – Reg Skrimshire, Wales and British Lions rugby union player, 85"]}, {"page": "1878 in Wales", "response": ["*30 January – Reg Skrimshire, Wales and British Lions rugby union player (died 1963)"]}, {"page": "1899 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea) capt., Viv Huzzey (Cardiff), Gwyn Nicholls (Cardiff), Reg Skrimshire (Newport), Llewellyn (Llwynypia), Evan James (Swansea), David James (Swansea), Jere Blake (Cardiff), Tom Dobson (Cardiff), William Alexander (Llwynypia), Fred Scrine (Swansea), David Daniel (Llanelli), Alfred Brice (Aberavon), Jehoida Hodges (Newport), Will Parker (Swansea)", "Wales: Billy Bancroft (Swansea) capt., Viv Huzzey (Cardiff), Gwyn Nicholls (Cardiff), Reg Skrimshire (Newport), Llewellyn (Llwynypia), Selwyn Biggs (Cardiff), Llewellyn Lloyd (Newport), Jere Blake (Cardiff), Tom Dobson (Cardiff), William Alexander (Llwynypia), Fred Scrine (Swansea), Alfred Brice (Aberavon), Jehoida Hodges (Newport), Will Parker (Swansea), Dick Hellings (Llwynypia) ", "Wales: Billy Bancroft (Swansea) capt., Viv Huzzey (Cardiff), Gwyn Nicholls (Cardiff), Reg Skrimshire (Newport), Willie Llewellyn (Llwynypia), Selwyn Biggs (Cardiff), Llewellyn Lloyd (Newport), William Alexander (Llwynypia), Jere Blake (Cardiff), Fred Cornish (Cardiff), David Daniel (Llanelli), Alfred Brice (Aberavon), Jehoida Hodges (Newport), George Boots (Newport), Dick Hellings (Llwynypia)"]}, {"page": "Blaenavon RFC", "response": ["* Reg Skrimshire 1899 Wales (3 caps) and British Lions."]}, {"page": "Willie Llewellyn", "response": ["Llewellyn made his debut for Wales against England in 1899, alongside Welsh greats Billy Bancroft and Gwyn Nicholls. It was an impressive display from Llewellyn and the team, with England thoroughly beaten and Llewellyn scoring four tries.Thomas (1979), pg22 Llewellyn scored again on his second game, which was against Scotland, and should have scored on his third match when he faced Ireland but for a poor choice by team mate Reg Skrimshire."]}, {"page": "List of people from Newport", "response": ["* Reg Skrimshire"]}, {"page": "Lou Phillips", "response": ["Phillips began playing rugby while at Monmouth Grammar School. He went on to play for Newport RFC, earning selection for the first team in 1897. His first season at Newport was disappointing for the club, which lost seven games, after the previous six consecutive years of success. Several players had moved to Yorkshire to play rugby league, while others had married and retired. Nevertheless, Phillips was one of four new players in the team to 'make an impact', alongside George Boots, Jehoida Hodges and Reg Skrimshire."]}, {"page": "1903 British Lions tour to South Africa", "response": ["Having lost only one game out of 40 matches in the previous two tours of South Africa, the British Isles team were truly tested by the South African rugby nation on this tour. Of the 22 games played, the tourist won eleven, drew three and lost eight. Unlike past teams, the British Isles three-quarter line was not seen as the team's strongest asset and more reliance was placed in the pack. Of the backs, only Reg Skrimshire, the only Welsh player selected, was judged to have shown any true flair; while the pack failed to live up to expectations, even when led by Scottish power-house David Bedell-Sivright.", "* Reg Skrimshire (Newport/Blackheath F.C./Kent/Barbarian F.C.)"]}, {"page": "Pussy Jones", "response": ["Under the guidance of Nicholls, Jones's performance improved the next season at Cardiff, scoring nine tries.Parry-Jones (1999), pg 49. Despite his growth at club level, Jones was left out of the 1899 trial match,Parry-Jones (1999), pg 69. and when the 1899 Home Nations Championship began, Jones was replaced by Newport's Reg Skrimshire, and didn't play at international level again."]}, {"page": "Skrimshire", "response": ["* Reg Skrimshire (1878–1930), Welsh rugby player"]}, {"page": "1902–03 Rugby Union County Championship", "response": ["| || Reg Skrimshire || Blackheath"]}]}}