{"wiki_id": "http://www.wikidata.org/entity/Q3427366", "itemLabel": "Goddard Henry Orpen", "itemDescription": "Irish historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Goddard_Henry_Orpen", "wikipedia_page": {"main": "Goddard Henry Orpen (8 May 1852 – 15 May 1932) was an Irish historian. He attended The Abbey School, Tipperary and graduated from Trinity College, Dublin.\nOrpen was the son of Dr. John Herbert Orpen (1805–1888) and Ellen Susanna Gertude Richards (?–1855) and a second cousin of Sir William Orpen. He married his first cousin once removed, Adela Elizabeth Richards, on 18 August 1880.Orpen's main work was Ireland under the Normans, a four-volume work of a total of c. 1500 pages, first published by Clarendon Press 1911–20, and then reissued in 1968. Ireland under the Normans generated political controversy when it was published, as Orpen \"affronted many fellow Irishmen with his contrast between Ireland’s ‘progress, vigour and comparative order’ under Anglo-Norman rule, and ‘retrogression, stagnation, and comparative anarchy’ under ‘the recrudescence of Celtic tribalism’ in the two centuries after 1333\". A new one-volume edition was published by Four Courts Press in 2005.He also edited and translated The Song of Dermot and the Earl in 1892.\nOrpen died at Monksgrange, Enniscorthy, Co. Wexford, on 15 May 1932.", "link_mentions": [{"page": "Eoin MacNeill", "response": ["He was a contributor to the RIA's Clare Island Survey, recording the Irish place names of the island. On 25 February 1911, he delivered the inaugural address on \"Academic Education and Practical Politics\" to the Legal and Economic Society of UCD.. His disagreements and disputes with Goddard Henry Orpen, particularly over the latter's book Ireland under the Normans generated controversy."]}, {"page": "War poet", "response": ["The chronicle survived only in a single manuscript which was re-discovered in the 17th century at Lambeth Palace in London.Lambeth Palace, MS Carew 596 The manuscript bears no title, but has been commonly dubbed The Song of Dermot and the Earl since Goddard Henry Orpen published a diplomatic edition under this title in 1892."]}, {"page": "Anglo-Norman literature", "response": ["The History of the Dukes of Normandy by Benoît de Sainte-More is based on the work of Wace. It was composed at the request of Henry II. about 1170, and takes us as far as the year 1135 (ed. by Francisque Michel, 1836–1844, Collection de documents inédits, 3 vols.). The 43,000 lines which it contains are of but little interest to the historian; they are too evidently the work of a romancier courtois, who takes pleasure in recounting love-adventures such as those he has described in his romance of Troy. Other works, however, give us more trustworthy information, for example, the anonymous poem on Henry II.'s Conquest of Ireland in 1172 (ed. Francisque Michel, London, 1837), which, together with the Expugnatio hibernica of Giraud de Barri, constitutes our chief authority on this subject. The Conquest of Ireland was republished in 1892 by Goddard Henry Orpen, under the title of The Song of Dermot and the Earl (Oxford, Clarendon Press). Similarly, Jourdain Fantosme, who was in the north of England in 1174, wrote an account of the wars between Henry II., his sons, William the Lion of Scotland and Louis VII., in 1173 and 1174 (Chronicle of the reigns of Stephen ... III., ed. by Joseph Stevenson and Fr. Michel, London, 1886, pp. 202–307). Not one of these histories, however, is to be compared in value with The History of William the Marshal, Count of Striguil and Pembroke, regent of England from 1216–1219, which was found and subsequently edited by Paul Meyer (Société de l'histoire de France, 3 vols., 1891–1901). This masterpiece of historiography was composed in 1225 or 1226 by a professional poet of talent at the request of William, son of the marshal. It was compiled from the notes of the marshal's squire, John d'Early (d. 1230 or 1231), who shared all the vicissitudes of his master's life and was one of the executors of his will. This work is of great value for the history of the period 1186–1219, as the information furnished by John d'Early is either personal or obtained at first hand. In the part which deals with the period before 1186, it is true, there are various mistakes, due to the author's ignorance of contemporary history, but these slight blemishes are amply atoned for by the literary value of the work. The style is concise, the anecdotes are well told, the descriptions short and picturesque; the whole constitutes one of the most living pictures of medieval society. Very pale by the side of this work appear the Chronique of Peter of Langtoft, written between 1311 and 1320, and mainly of interest for the period 1294–1307 (ed. by T. Wright, London, 1866–1868); the Chronique of Nicholas Trevet (1258?–1328?), dedicated to Princess Mary, daughter of Edward I. (Duffus Hardy, Descr. Catal. III., 349-350); the Scala Chronica compiled by Thomas Gray of Heaton († c. 1369), which carries us to the year 1362-1363 (ed. by J. Stevenson, Maitland Club, Edinburgh, 1836); the Black Prince, a poem by the poet Chandos Herald, composed about 1386, and relating the life of the Black Prince from 1346-1376 (re-edited by Francisque Michel, London and Paris, 1883); and, lastly, the different versions of the Brutes, the form and historical importance of which have been indicated by Paul Meyer (Bulletin de la Société des anciens textes français, 1878, pp. 104–145), and by F. W. D. Brie (Geschichte und Quellen der mittelenglischen Prosachronik, The Brute of England or The Chronicles of England, Marburg, 1905)."]}, {"page": "William Orpen", "response": ["Born in Stillorgan, County Dublin, William Orpen was the fourth and youngest son of Arthur Herbert Orpen (1830–1926), a solicitor, and his wife, Anne Caulfield (1834–1912), the eldest daughter of the Right Rev. Charles Caulfield (1804–1862), the Bishop of Nassau. Both his parents were amateur painters, and his eldest brother, Richard Caulfield Orpen, became a notable architect. His nieces were Bea Orpen and Kathleen Delap. The historian Goddard Henry Orpen was his second cousin. The family lived at 'Oriel', a large house with extensive grounds containing stables and a tennis court. Orpen appears to have had a happy childhood there."]}, {"page": "The Song of Dermot and the Earl", "response": ["The chronicle survives only in a single manuscript which was re-discovered in the 17th century in London.Lambeth Palace, MS Carew 596 The work bears no title in the manuscript, but has been commonly referred to as The Song of Dermot and the Earl since Goddard Henry Orpen in 1892 published a diplomatic edition under this title. It has also been known as The Conquest of Ireland and The Conquest of Ireland by Henry II; in the most recent edition it was called  La Geste des Engleis en Yrlande (\"The Deeds of the English in Ireland\")."]}, {"page": "Kilgarvan", "response": ["*Sir Richard John Theodore Orpen (1788-1876): Since 1868 Knight of Tully,Royal Dublin Society (RDS) - Past Members - Richard John Theodore Orpen  was one of the principal lessors in the parishes of Kenmare and Kilgravan. In the 1870s his estate amounted to over 12,000 acres in county Kerry as well as 300 acres in county Cork.NUI Galway - Landed Estates Database - Estate: Orpen He built \"Ardtully House\" in 1847 outside Kilgarvan. Sir Richard Orpen was a grandfather of the famous painter Sir William Orpen, the great uncle of the Irish historian Goddard Henry Orpen and a brother of Dr. Charles Orpen (1791-1856)Geni - Charles Edward Herbert Millerd Orpen who founded the \"Claremont Institution\", the first Institution for the Deaf and Dumb in Ireland at Glasnevin near Dublin.Kilgarvan Co. Kerry "]}, {"page": "Baron Offaly", "response": [" including what was then \"Offelan\", a word that derived from the Irish Uí Faelain and not from what is now County Offaly.Note on earlier barony and \"Offelan\" by Goddard Henry Orpen. Offelan was also sometimes spelt Ophelan. The Uí Faelain were a branch of the former Gaelic-era Leinster dynasty The original grant of the lordship of Offelan was in 1175 to Maurice FitzGerald, one of Strongbow's main supporters.Journal of the Co. Kildare Archaeological Soc, 1893, p.186 Online version here"]}, {"page": "Risteárd de Tiúit", "response": ["Le cantref pus de hadhnorkur, A meiler, qui ert de grant valur, Donad huge de laci, Al bon meiler le fiz herui; A gilbert de nangle en fin, Donat tut makerigalin; A iocelin donat le nouan, E la tere de ardbrechan: Li vn ert fiz, li alter pere, Solum le dit de la mere; A richard tuit ensement, Donad riche feffement'. This extract from Maurice Regan's La Chanson Dermot e le Conte or 'The Song of Diarmaid and the Earl', written circa 1225AD and the most famous literary introduction to the Norman invasion translates thus: 'Of Hugh de Lacy I shall tell you, How he enfeoffed his barons, Knights, sergeants and retainers Castleknock in the first place he gave To Hugh Tyrrell, whom he loved so much; And the Castle Brack, according to the writing, To baron William le Petit, Magheradernon likewise And the land of Rathkenny; The cantred of Ardnorcher then To Meiler, who was of great worth, Gave Hugh de Lacy- To the good Meiler Fitz Henry; To Gilbert de Nangle, moreover, He gave the whole of Morgallion; To jocelin he gave the Navan, And the land of Ardbraccan, (The one was son, the other father, according to the statement of the mother); To Richard Tuite likewise He gave a rich fief', The Song of Dermot and the Earl: An old French Poem about the coming of the Normans to Ireland (From the Carew Manuscript No 596 in the Archiepiscopal Library at Lambeth Palace), ed. & trans. Goddard Henry Orpen (Clarendon Press, 1892, reprinted 1994)]"]}, {"page": "Laudabiliter", "response": ["Goddard Henry Orpen notes that as early as 1615 Laudabiliter was denounced as a forgery by Stephen White, to be followed by John Lynch in 1662 and later still by Abbé Mac Geoghegan. Francis Aidan Gasquet writes that during the residence of the pontifical Court at Avignon two Lives of Pope Adrian IV were written. One was composed in 1331 and the second in 1356. In neither is there any mention of this important act of the Pope, although the authors find a place for many less important documents."]}, {"page": "The Abbey School (Tipperary)", "response": ["*Goddard Henry Orpen (1852–1932), historian"]}, {"page": "G.H. Orpen", "response": ["#REDIRECT Goddard Henry Orpen"]}, {"page": "Goddard Orpen", "response": ["#REDIRECT Goddard Henry Orpen"]}, {"page": "Ella Sophia Armitage", "response": ["Armitage – along with John Horace Round, George Neilson, and Goddard Henry Orpen – proved in a string of publications that British motte-and-bailey castles, which had previously been assumed to be of Anglo-Saxon origin, were not constructed until after the 1066 Norman conquest of England. Her book The Early Norman Castles of the British Isles is considered a seminal work on the subject."]}, {"page": "Adam de Hereford", "response": ["OrpenGoddard Henry Orpen , Ireland under the Normans 1169-1216, (1911), pages 329-331 says that it is not quite clear in which port the fight took place. While he says that Dungarvan is named in the Book of Howth and in Bray's Conquest of Ireland, The conquest of Ireland wrote by Thomas Bray and copied by Josiah Jones, a transcript of the greater part of Lambeth Palace Ms. 598, containing the Bray part and \"the arms of some of the nobles of Ireland, 1246\" in trick, 1744 he thinks that Youghal harbour was the more likely site.", "Among the lands bestowed by Strongbow on de Hereford was half the vill of Aghaboe.Grant by Earl Richard, son of Earl Gislebert, to Adam de Hereford of half the vill of Achebo (Aghaboe) and the half cantred in which the vill is situated, as Dermod O Kelli held them, c. 1172., Manuscript in the National Library of Ireland, DublinGoddard Henry Orpen , Ireland under the Normans 1169-1216, (1911), pages 388 This land presumably included what is now the townland of Rathpiper South in County Laois, where one of his descendants, Pipard, is believed to have been the builder of a castle less than one kilometre to the south-west of Coolkerry Castle.Seosamh Ó Cinnéide, The monastic heritage & folklore of County Laois, , (2003), pages 57-59 Although the castle is no longer to be seen, it was marked on the first Ordnance Survey map and has been saidElizabeth Fitzpatrick, Royal Inauguration in Gaelic Ireland C. 1100-1600: A Cultural Landscape Study, , (2004) page 24William Carrigan, The History and Antiquities of the Diocese of Ossory, Volume 1, (1905), page 6 to have been still standing in 1836."]}, {"page": "Orpen", "response": ["*Goddard Henry Orpen (1852–1932), Irish historian"]}, {"page": "Edward Richards-Orpen", "response": ["Edward R Richards Orpen was born in 1884 to the family of Adela and Goddard Henry Orpen of Monksgrange, a renowned historian of the Anglo-Norman period of Irish history. He was also related to Irish portrait painter, William Orpen and was married to Margaret. In late 1916, at the age of 32, Edward joined Army Services Corps. popularly known as ASC that undertook the vital but life-threatening work of food and weapon supply to the soldiers at the front. Because of his dedicated work, discipline and leadership qualities, Edward got quick promotions. After few months of joining, precisely in early 1917, he had been promoted to second lieutenant position followed by the post of acting captain."]}, {"page": "Goddard H. Orpen", "response": ["#REDIRECTGoddard Henry Orpen"]}, {"page": "Orpen, Goddard Henry", "response": ["#REDIRECTGoddard Henry Orpen"]}, {"page": "Adela Orpen", "response": ["It was the economic difficulties that arose from the withholding of rents that delayed her marriage to her first cousin once removed, Goddard Henry Orpen. Her father also resisted the marriage as he thought Goddard was financially inadequate, as he was only at the beginning of his career as a London barrister. They eventually married on 18 August 1880 at St. Peter's Church, Aungier Street, Dublin. Her husband described their marriage as \"a perfect union.\""]}, {"page": "List of English translations from medieval sources: C", "response": ["* Aenach Carman: Its Site (1906). By Irish historian Goddard Henry Orpen (1852–1932).Orpen, Goddard Henry. In Thom's Irish Who's Who. ", "* The song of Dermot and the Earl (1892).Regan, M., Orpen, G. Henry. (1892). The song of Dermot and the Earl: an Old French poem from the Carew manuscript no. 596 in the archiepiscopal library at Lambeth palace. Oxford: Clarendon press. An Old French poem from the Carew manuscript no. 596 in the archiepiscopal library at Lambeth palace. With literal translation and notes, with a facsimile and map, by Irish historian Goddard Henry Orpen (1852–1932). "]}]}}