{"wiki_id": "http://www.wikidata.org/entity/Q3429875", "itemLabel": "Rhys Williams", "itemDescription": "fictional character of Torchwood", "wikipedia_url": "https://en.wikipedia.org/wiki/Rhys_Williams_(Torchwood)", "wikipedia_page": {"main": "Rhys Alun Williams, portrayed by Kai Owen, is a fictional character in the BBC television programme Torchwood, a spin-off from the long-running series Doctor Who. The character is introduced in the premiere episode as the co-habiting boyfriend of principal character Gwen Cooper. Initially a recurring character, Rhys' role is increased after the second series; actor Kai Owen is given star billing from the show's third series — a five-part serial subtitled Torchwood: Children of Earth — onwards. The character has gone on to appear in expanded universe material such as the Torchwood novels and audiobooks, comic books and radio plays.\nThroughout the first series (2006), Rhys is initially unaware of Gwen's vocation as a Torchwood agent, believing her to work in generic special forces. Gwen's relationship with Rhys languishes while she is unable to communicate fully with him, but in the early part of series two (2008) he discovers the truth, and from then on in their relationship is revitalised; the two enter a marriage based on honesty later in the series. In the third series (2009) Rhys becomes directly involved in assisting the Torchwood team in lieu of a fourth team member. In the show's fourth series — a 2011 BBC/Starz co-production — Rhys again finds himself having to assist Torchwood, though he would rather live a domestic life with Gwen and their daughter Anwen.\nThe original intention of the writers had been to kill off Rhys at the end of the first series, but series creator Russell T Davies found it necessary to keep the show grounded through Rhys as Gwen evolved as a character. Producer Richard Stokes stated that \"without him, it simply becomes a sci-fi show about sci-fi people, running around and hunting aliens.\" Following from the first series the production team decided to make Rhys less of a \"sap\" whilst continuing to use him as a contrast to Torchwood's activities and its charismatic leader Jack Harkness. Whilst early response to the character was mixed — the character was parodied as \"Barry Backstory\" — subsequent reviews praised the character's larger role in later episodes.", "link_mentions": [{"page": "Big Finish Productions", "response": ["Two TV spin-offs from the Doctor Who universe have been continued in audio form by Big Finish: Torchwood and Class which has featured the return of several characters from the original cast: Gwen Cooper (Eve Myles), Owen Harper (Burn Gorman), Toshiko Sato (Naoko Mori), Ianto Jones (Gareth David-Lloyd), Rhys Williams (Kai Owen), Andy Davidson (Tom Price), Suzie Costello (Indira Varma), Captain John Hart (James Marsters) and Bilis Manger (Murray Melvin) have all reprised their roles in Torchwood. Characters from Doctor Who have also appeared in Torchwood audios, including Yvonne Hartman (Tracy Ann Oberman) and Jo Grant. Big Finish have also created several new characters of Torchwood in their continuation of the series from Miracle Day, most notably Tyler Steele (Jonny Green). Starting with January 2017, Big Finish also began releasing the \"Torchwood One\" series set before the events of Doomsday (Doctor Who)."]}, {"page": "Llanrwst", "response": ["*Kai Owen (born 1975), actor notable as Rhys Williams in Torchwood"]}, {"page": "Rhys", "response": ["* Rhys Williams (rugby union, born 1980), Welsh rugby player", "* Rhys Williams, in the BBC science fiction series Torchwood"]}, {"page": "Rhys Williams", "response": ["*Rhys Williams (rugby union, born 1980), Welsh rugby union player", "*Rhys Williams (hurdler) (born 1984), Welsh athlete", "*Rhys Williams (rugby union, born 1988), Welsh rugby union player who plays at centre for Llanelli Scarlets", "*Rhys Williams (soccer, born 1988), Australian professional association football player", "*Rhys Williams (rugby league) (born 1989), Welsh rugby league player", "*Rhys Williams (rugby union, born 1990), Welsh rugby union player who plays at hooker for Cardiff Blues", "*Rhys Williams (soccer, born 1995), American soccer player", "*Rhys Williams (footballer, born 2001), English footballer", "*Rhys Williams (Canadian actor) (born 1983), actor and stunt performer", "*Rhys Williams (Welsh actor) (1897–1969), Welsh actor", "*Albert Rhys Williams (1883–1962), Welsh-American political activist", "*Rhys Williams (Torchwood), portrayed in British science fiction series Torchwood", "*Rhys Williams, a primary character in the 1977 novel Bloodline, by Sidney Sheldon"]}, {"page": "Torchwood", "response": ["| Kai Owen || Rhys Williams || colspan=2  || colspan=2 ", "Unlike its parent programme, Torchwood centres on a team instead of a single character with companions. The show initially depicts a small team of alien-hunters known as Torchwood Three, based in Cardiff. The team is made up of five operatives led by Captain Jack Harkness (John Barrowman), formerly a time-travelling \"Time Agent\" and con man from the distant future who has lived on Earth as an immortal since the 19th century. Gwen Cooper (Eve Myles), the female lead, joins the team in the first episode; she is originally an audience surrogate, but later grows into a more morally complicated character. The original cast is filled out by Torchwood medical officer Owen Harper (Burn Gorman), computer specialist Toshiko Sato (Naoko Mori), and general factotum-cum-administrator Ianto Jones (Gareth David-Lloyd). Toshiko and Owen are killed off in the second series finale, as is Ianto in the show's third series. Recurring characters are Rhys Williams (Kai Owen), Gwen's live-in boyfriend and later husband; and Andy Davidson (Tom Price), Gwen's former police partner and occasional comic relief. Kai Owen becomes a main cast member in the programme beginning with the third series; his character is initially unaware of Gwen's activities with Torchwood, but later becomes her close confidant and the team's ally. Price appears in all four series.", "Although fewer in number than Doctor Who spoofs, there have been a number of parodies of Torchwood in various media. Verity Stob, a technology columnist for online newspaper The Register, wrote a parody of Torchwood called Under Torch Wood. The piece is in the style of Under Milk Wood, a Dylan Thomas radio play. The piece comments on the level of swearing present in Torchwood and the role of Rhys Williams, whom the piece describes as \"Barry Backstory\". In its third series, the Doctor Who parody Nebulous also began to parody Torchwood, with references to \"baby dinosaurs falling through a hole in time\" and \"the sheer amount of paranormal activity in the Cardiff area alone ... starting to threaten the Earth's plausibility shield\"."]}, {"page": "Gwen Cooper", "response": ["Despite being promoted as the show's heart and moral conscience, the flaws in Gwen's own morality are explored throughout the series; a press release noted that she is both selfless and selfish. The first series sees Gwen embark on a brief affair with colleague Owen Harper. Executive producer Russell T Davies explains that the episode \"Countrycide\" was deliberately structured in order to make the affair seem inevitable as Gwen struggles to cope with Torchwood life. For Davies, the dalliance is a \"human\" one, told in an adult manner characterised by \"lust and anger and hurt and the joy you get out of the initial stages of having an affair\". Myles commented that Gwen's compromised morality, as demonstrated by her affair was suitably challenging for a science fiction audience, and served to demonstrate that none of the Torchwood team were \"safe\" from temptation. Writer Stephen James Walker argues that Gwen's moral ambiguity made her a more compelling character. Since she was introduced as an audience surrogate, Walker claimed it would have been an easy trap to make her a \"one-dimensional paragon of virtue\". Instead, the writers made Gwen more \"realistic\" by giving her \"distinct human failings\", which Walker felt made her \"arguably the most complex and interesting of the five regulars\". He identified these failures as her \"tendency towards egotism\", \"self-righteousness\", and \"selfishness\", evident in her \"highly questionable treatment\" of boyfriend Rhys Williams. Walker cited her affair with Owen as an example, as well as the scene in \"Combat\" where she confesses this betrayal to Rhys after dosing him with the amnesia drug Retcon so he won't remember."]}, {"page": "Senedd building", "response": ["The Doctor Who episode \"The Lazarus Experiment\" was filmed in the Senedd building, along with the ending of \"The Almost People\" as was the Doctor Who spin-off programme Torchwood, which used the Senedd building in the episode \"Meat\", where Gwen Cooper and Rhys Williams sit on the steps of the Senedd building."]}, {"page": "Owen Harper", "response": ["Owen is introduced in the first episode of Torchwood in 2006, as the sarcastic and womanising medical officer for Torchwood Three; the first episode sees him recreationally use alien technology to get a woman and her boyfriend to sleep with him. Owen's first centric episode comes in \"Ghost Machine\", when an alien device makes him experience the rape and murder of a girl in the 1950s, which drives him to seek revenge for her. The next episode sees him kiss teammate Gwen (Eve Myles) in the midst of a Cyberman attack on the Hub, and as the series continues they continue a destructive affair which Gwen conceals from boyfriend Rhys Williams (Kai Owen). Owen remains oblivious to the devotion of teammate Toshiko (Naoko Mori), but experiences real love with a time-lost 1953 pilot Diane (Louise Delamere) and is distraught when she disappears in an attempt to return to her time, and despondent over this, Owen ends the affair with Gwen. Owen investigates a men's 'fight club' which uses alien Weevils, and Owen attempts to allow one to almost devour him; in the episode's dénouement, however, Torchwood's captive Weevil mysteriously cowers in fear from Owen. When Captain Jack (John Barrowman) and Toshiko are lost to the past, Owen as second-in-command takes control and fights with Ianto (Gareth David-Lloyd) over whether to open the Rift and 'rescue them'; Owen truly intends to rescue Diane, and is successful in opening the Rift and saving his teammates, but with consequences, for which Jack fires him. In the series finale, the opened Rift causes global chaos. An apparition of Diane sent by Bilis Manger (Murray Melvin) convinces Owen to lead a mutiny against Jack to open the Rift yet again; Owen goes so far as to shoot Jack twice in the head. Having unwittingly released the demon Abaddon, who is eventually defeated by a resurrected Jack, Owen is shocked to discover that Jack offers Owen his forgiveness."]}, {"page": "Day One (Torchwood)", "response": ["A date between Gwen Cooper and her boyfriend Rhys Williams (Kai Owen) is cut short when they witness a meteor crashing outside Cardiff. Gwen receives a message on her mobile phone, and is called into action. As the Army secures the area, Torchwood investigate the meteor. Colleague Owen Harper (Burn Gorman) taunts Gwen by calling her the \"new girl\". In an attempt to retaliate, she throws a chisel at him, but misses and cracks open the meteor, allowing a purple gaseous entity to escape. The gas finds a young woman, Carys Fletcher, outside a nightclub and takes her host. In the club, a possessed Carys seduces a man and takes him to a restroom, where they proceed to have sex. At the moment of climax however, the man dissolves into dust while Carys absorbs the energy that remains."]}, {"page": "Out of Time (Torchwood)", "response": ["Emma-Louise bonds with Gwen Cooper, and discovers that sex is much more promiscuous than in the 1950s. Gwen and her boyfriend Rhys Williams help Emma to become more accustomed to modern romance, although Rhys' trust in Gwen is damaged when he learns that her story about Emma-Louise being a distant relative is false."]}, {"page": "Kai Owen", "response": ["Kai Owen (born 4 September 1975) is a Welsh actor of stage and screen, known to Welsh audiences for his numerous roles on Welsh language television and to worldwide audiences for his portrayal of Rhys Williams in Torchwood and Pete Buchanan in Hollyoaks.", "2006 saw Owen cast as recurring character Rhys Williams in Torchwood, a spin-off from the science fiction television series Doctor Who, a role for which he has become most renowned. He was elevated to star billing for the third series, broadcast on BBC One in summer 2009, reflecting his growing role in the series. He reprised his role in the fourth series of Torchwood - Torchwood: Miracle Day, broadcast during summer 2011.", "| 2006–2011 || Torchwood || Rhys Williams || Recurring cast series 1-2Main Cast series 3-4", "| 2009 || \"The Dead Line\" ||rowspan=\"2\"| Rhys Williams||rowspan=\"2\"| Torchwood Radio Plays (BBC Radio 4)", "|| 2015–present || Torchwood || Rhys Williams|||  Big Finish Productions "]}, {"page": "List of Torchwood characters", "response": ["thumb|140px|left|Kai Owen plays Gwen's partner, Rhys Williams", "===Rhys Williams===", "Bilis Manger, played by Murray Melvin, is a main antagonist of the first series. He has the ability to walk through time and teleport at will, In \"Captain Jack Harkness\", he appears as the manager of a 1941 dance hall, and in the present day remains its caretaker, ostensibly co-operating with Gwen when she visits the now derelict venue searching for Jack and Toshiko. However, he sabotages Toshiko's plans back in 1941 to send the full second half of the equations needed to bring back her and Jack more safely, by scratching away the last part of the equation. He took photographs, though, to ensure that the team would locate them in the past and have to open the rift to rescue them. In \"End of Days\", he reappears, first as an apparition to Gwen, then, in his shop, A Stitch in Time, where he reveals that he is able to travel between eras at will. He then infiltrates the Torchwood base, stabbing Rhys Williams, spurring Gwen to once more open the rift to save everyone's lives, however, this full opening unwittingly releases Abaddon. Moments later, Manger is found outside by the members of the team, telling them that his plan all along was to release Abaddon, who had been \"chained under the rift\", before vanishing again.", "Anwen Williams is the daughter of Gwen Cooper and Rhys Williams who makes her first television appearance in Torchwood: Miracle Day. Anwen is conceived three weeks prior to the events of Children of Earth. She spends her early months in hiding with them in the wilds of South Wales. She becomes part of a chase when assassins call on her parents' house, and Gwen is forced to fight with Anwen in her arms. In \"Immortal Sins\", Anwen is captured along with Rhys and Mary and used as leverage for Gwen to turn in Jack Harkness. However, the infant is later rescued by the intervention of a South Wales attack force, led by sergeant Andy Davidson. A scene in Gareth David Lloyd's Shrouded had previously depicted Gwen cradling an unnamed and ungendered baby in her arms, whilst the novel First Born, also set prior to Miracle Day, features a storyline where Anwen draws unwanted attention."]}, {"page": "Anwen", "response": ["*Anwen Williams, fictional character in the BBC series Torchwood (daughter of Gwen Cooper and Rhys Williams)"]}]}}