{"wiki_id": "http://www.wikidata.org/entity/Q342873", "itemLabel": "John Bridgeman", "itemDescription": "sculptor (1916-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Bridgeman_(sculptor)", "wikipedia_page": {"main": "Arthur John Bridgeman ARCA, FRBS, FRBSA (2 February 1916 – 29 December 2004) was an English sculptor.\n\n", "link_mentions": [{"page": "Coventry Cathedral", "response": ["Coventry's new cathedral adopted a modernist design. The interior is notable for its huge tapestry (once thought to be the world's largest) of Christ, designed by Graham Sutherland, the emotive sculpture of the Mater Dolorosa by John Bridgeman in the East end, and the Baptistry window designed by John Piper (made by Patrick Reyntiens), of abstract design that occupies the full height of the bowed baptistery, which comprises 195 panes, ranging from white to deep colours. The stained glass windows in the Nave, by Lawrence Lee, Keith New and Geoffrey Clarke, face away from the congregation. Spence's concept for these Nave windows was that the opposite pairs would represent a pattern of growth from birth to old age, culminating in heavenly glory nearest the altar—one side representing Human, the other side, the Divine. Also worthy of note is the Great West Window known as the Screen of Saints and Angels, engraved directly onto the screen in expressionist style by John Hutton. A pane of the Hutton window, depicting The Angel with the Eternal Gospel, was smashed during a burglary in January 2020. (Although referred to as the West Window, this is the 'liturgical west' opposite the altar which is traditionally at the east end. In this cathedral the altar is actually at the north end.) The foundation stone, the ten stone panels inset into the walls of the cathedral called the Tablets of the Word, and the baptismal font were designed and carved by the émigré German letter carver Ralph Beyer. The lectern has a bookrest in the form of an eagle, by the sculptor Elisabeth Frink. She also designed the canopy for the Bishop's throne."]}, {"page": "List of British painters", "response": ["*John Bridgeman (1914–2004)"]}, {"page": "William Bloye", "response": ["Bloye studied, and later, taught at the Birmingham School of Art (his training was interrupted by World War I, when he served in the Royal Army Medical Corps from 1915 to 1917; he was eventually succeeded at Birmingham by John Bridgeman), where his pupils included Gordon Herickx, Roy Kitchin, Raymond Mason, John Poole and Ian Walters. He also studied stone-carving and letter cutting under Eric Gill around 1921."]}, {"page": "Felixstowe", "response": ["* John Bridgeman (1916–2004) an English sculptor"]}, {"page": "2004 in the United Kingdom", "response": ["* 29 December – John Bridgeman, sculptor (born 1916)"]}, {"page": "1962 in art", "response": ["* May 25 – The new Coventry Cathedral, designed by Basil Spence, is consecrated in England; artworks incorporated include: the exterior sculpture St Michael's Victory over the Devil by Sir Jacob Epstein; the tapestry Christ in Glory in the Tetramorph, designed by Graham Sutherland; the Mater Dolorosa sculpture by John Bridgeman; the Baptistry window by John Piper and Patrick Reyntiens; and the engraved glass Screen of Saints and Angels by John Hutton."]}, {"page": "List of British artists", "response": ["* John Bridgeman (1916–2004)"]}, {"page": "Bridgeman", "response": ["*John Bridgeman (bishop)", "*John Bridgeman (sculptor)", "*Sir John Bridgeman, 2nd Baronet", "*Sir John Bridgeman, 3rd Baronet"]}, {"page": "John Bridgeman", "response": ["John Bridgeman may refer to:", "*John Bridgeman (died 1523), MP for Exeter", "*John Bridgeman (died 1729) (c. 1655–1729), of Prinknash, Member of Parliament for Gloucester", "*John Bridgeman (American politician), member of the North Carolina House of Representatives", "*John Bridgeman (judge) (1568/9–1638), of Prinknash, Chief Justice of Chester", "*John Bridgeman (bishop) (1577–1652), English bishop of Chester", "*Sir John Bridgeman, 2nd Baronet (1631–1710)", "*Sir John Bridgeman, 3rd Baronet (1667–1747)", "*John Bridgeman (sculptor) (1916–2004), British sculptor"]}, {"page": "1916 in the United Kingdom", "response": ["* 2 February – John Bridgeman, sculptor (died 2004)"]}, {"page": "List of Birmingham City University people", "response": ["*John Bridgeman — sculptor"]}, {"page": "Art of Birmingham", "response": ["Bloye's replacement at the School of Art when he retired in 1956 was John Bridgeman, one of the first British sculptors to embrace fibreglass, plastics, concrete and fondue cement as sculptural materials and a pioneer of new sculptural forms such as play sculpture and sculpture integrated within buildings' architecture. His arrival marked a break with the city's existing tradition and the decisive ascendency of abstract sculpture."]}, {"page": "Deaths in December 2004", "response": ["*John Bridgeman, 88, British sculptor."]}, {"page": "Church of the Ascension, Stirchley (II)", "response": ["A statue of the Risen Christ was erected on the facade of the new church. It was designed by John Bridgeman of Leamington Spa, made of fibre glass and cost £600. A window of the ascending Christ in slab glass and concrete was designed by John Lawson and a crucifix was designed by John Skelton."]}, {"page": "John Bridgeman play sculpture, Birmingham", "response": ["The sculptor John Bridgeman was commissioned in the early 1960s by playground designer Mary Frances Mitchell, to create an abstract sculpture in concrete, for a Birmingham City Council playground, on Curtis Gardens, on a housing estate on Fox Hollies Road in the Acocks Green district of Birmingham, England. It has been described as \"fish like\"."]}]}}