{"wiki_id": "http://www.wikidata.org/entity/Q342784", "itemLabel": "Matthew Rhys", "itemDescription": "Welsh actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Matthew_Rhys", "wikipedia_page": {"main": "Matthew Rhys Evans (born 8 November 1974; ) is a Welsh actor. He is known for playing Kevin Walker in Brothers & Sisters (2006–2011) and Philip Jennings in The Americans (2013–2018), for which he received two Golden Globe Award nominations and a Primetime Emmy Award. In film, he appeared as Dylan Thomas in the film The Edge of Love (2008) and as Daniel Ellsberg in the film The Post (2017) and starred in A Beautiful Day in the Neighborhood (2019). In 2020, he starred in the lead role on the HBO period series Perry Mason, for which he received his third Golden Globe Award nomination for Best Actor – Television Series Drama.", "link_mentions": [{"page": "Calista Flockhart", "response": ["Flockhart performed in a starring role as Kitty Walker, opposite Sally Field, Rachel Griffiths and Matthew Rhys, in the ABC critically acclaimed prime time series Brothers & Sisters, which premiered in September 2006 in the time slot after Desperate Housewives. The show was cancelled in May 2011 after running for five years. Flockhart's character was significant throughout the series' first four years, but her appearances were reduced for the 2010–2011 season, coinciding with the departure of TV husband Rob Lowe."]}, {"page": "1974", "response": ["** Matthew Rhys, Welsh actor"]}, {"page": "List of Welsh people", "response": ["*Matthew Rhys (born 1974)"]}, {"page": "Perry Mason", "response": ["The character of Perry Mason was adapted for motion pictures and a long-running radio series. These were followed by the best known adaptation, the CBS television series Perry Mason (1957–1966) starring Raymond Burr. A second television series, The New Perry Mason starring Monte Markham, ran from 1973 to 1974; and 30 Perry Mason television films ran from 1985 to 1995, with Burr reprising the role of Mason in 26 of them prior to his death in 1993. A third television series, HBO's Perry Mason starring Matthew Rhys, started airing in 2020.", "In August 2016, HBO announced a potential new series. In August 2017 a change in the writing staff for the project was announced, with Rolin Jones and Ron Fitzgerald taking over for Nic Pizzolatto. In January 2019, Robert Downey Jr. announced on his Twitter page that Matthew Rhys would be portraying Perry Mason in the new production; Downey was originally going to portray Mason, but was forced to bow out due to scheduling conflicts. The HBO revival and reboot adapted its setting to Great Depression-era Los Angeles, some twenty years earlier than the CBS show (but in line with the earliest novels by Gardner). It features John Lithgow and Tatiana Maslany in additional roles."]}, {"page": "Daniel Ellsberg", "response": ["* The Post is a 2017 historical drama film directed and co-produced by Steven Spielberg from a script written by Liz Hannah and Josh Singer about a pair of The Washington Post employees who battle the federal government over their right to publish the Pentagon Papers. In the movie, Ellsberg is portrayed by Matthew Rhys. The film also stars Tom Hanks as Ben Bradlee and Meryl Streep as Katharine Graham."]}, {"page": "Royal Academy of Dramatic Art", "response": ["* Matthew Rhys – (Brothers & Sisters, The Americans)"]}, {"page": "2002 in film", "response": ["* Deathwatch, starring Jamie Bell, Matthew Rhys and Andy Serkis – (UK/Germany)"]}, {"page": "1999 in film", "response": ["| Titus || Fox Searchlight Pictures || Julie Taymor (director/screenplay); Anthony Hopkins, Jessica Lange, Alan Cumming, Colm Feore, James Frain, Laura Fraser, Harry Lennix, Angus Macfadyen, Matthew Rhys, Jonathan Rhys Meyers, Kenny Doughty, Colin Wells, Blake Ritson, Raz Degan, Geraldine McEwan || Drama || Live action"]}, {"page": "1974 in television", "response": ["|Matthew Rhys"]}, {"page": "1974 in film", "response": ["*November 4 – Matthew Rhys, Welsh actor"]}, {"page": "Look-alike", "response": ["*  The Scapegoat (2012) is a remake of the 1959 Alec Guinness film, starring Matthew Rhys."]}, {"page": "Pentagon Papers", "response": ["* The Post (2017) is a historical drama film directed and co-produced by Steven Spielberg from a script written by Liz Hannah and Josh Singer about a pair of The Washington Post employees who battle the federal government over their right to publish the Pentagon Papers. The film stars Tom Hanks as Ben Bradlee and Meryl Streep as Katharine Graham. Daniel Ellsberg is played by Matthew Rhys."]}, {"page": "Keira Knightley", "response": ["Knightley appeared alongside Sienna Miller, Cillian Murphy, and Matthew Rhys in John Maybury's 2008 wartime drama The Edge of Love. The film had her play the role of Vera Phillips, a childhood friend of Welsh poet Dylan Thomas and his wife Caitlin Macnamara. Knightley wrote the script with her mother, Sharman Macdonald, with Macnamara in mind. After Knightley signed on, her character's role was increased with the film focusing on her romance with a British soldier. Knightley connected to Vera's quietness, and described her as \"tragic and beautiful\".  She based her performance on Marlene Dietrich, and was to mime to her prerecorded voice, before being told by Maybury to sing live. Knightley initially felt embarrassed to do so, saying she \"[shook] like a leaf\" but eventually went through with the plan. Upon release, the film became a moderate critical and commercial success.-  Knightley's performance and singing abilities were praised;The Independent noted that Knightley \"gives Vera an independence and complexity that's aeons ahead\", while the Los Angeles Times wrote \"the film belongs to the women, with Knightley going from strength to strength (and showing she can sing!)\".- "]}, {"page": "Columbo", "response": ["* Matthew Rhys as Justin Price (Episode: Columbo Likes the Nightlife)"]}, {"page": "Shooters (2002 film)", "response": ["* Matthew Rhys as Eddie"]}, {"page": "Under Milk Wood", "response": ["|Mr. Mog Edwards||Allen F. Collins||Dafydd Harvard||||Aubrey Richards|| Richard Davies ||Victor Spinetti||Matthew Rhys||Ioan Gruffudd", "|Voice|| || || || || || || ||Matthew Rhys"]}, {"page": "Ioan Gruffudd", "response": ["In July 2008 he featured in a promotional trailer in Welsh for BBC Wales, alongside fellow Welshmen Matthew Rhys and Gethin Jones, publicising BBC coverage of the 2008 National Eisteddfod of Wales in Cardiff. In early 2014, Gruffudd was among the stars of Wales in a short film from the BBC to mark the centenary of the birth of Welsh poet Dylan Thomas.", "One of Gruffudd's best men and speechmakers at the wedding was fellow Welsh actor Matthew Rhys, his long-time friend and former flatmate of eight years. Both are patrons of Trust PA, a UK spinal injuries charity."]}, {"page": "Keri Russell", "response": ["From 2013 to 2018, she starred in the FX drama series The Americans, playing Elizabeth Jennings, a deep-undercover Russian KGB spy living as an American in the 1980s Cold War era. She appeared opposite Matthew Rhys, who portrays her character's husband and spy partner. Russell and Rhys became partners in real life during this time. The series ended after six seasons.", "In 2006, Russell became engaged to Shane Deary, a Brooklyn-based contractor she met through mutual friends. The couple married in New York on February 14, 2007. They have two children together, a son born in 2007 and a daughter born in 2011. Russell and Deary separated in early 2013 and divorced in mid-2014. Since 2014, Russell has been in a relationship with her co-star in The Americans, Matthew Rhys. They have a son, born in 2016."]}, {"page": "Cillian Murphy", "response": ["Murphy made a brief re-appearance as the Scarecrow in Nolan's The Dark Knight (2008), the sequel to Batman Begins, before starring in The Edge of Love—about a love quadrangle involving the poet Dylan Thomas—with Keira Knightley, Sienna Miller and Matthew Rhys. In July 2008, Murphy made a debut appearance in another medium—on a postage stamp; the Irish Post Office, An Post, released a series of four stamps paying homage to the creativity of films recently produced in Ireland, including one featuring Murphy in a still from The Wind That Shakes the Barley. In 2009, Murphy starred opposite rock singer Feist and actor David Fox in The Water, directed by Kevin Drew of Broken Social Scene. The 15-minute Canadian short film, released online in April 2009, is nearly silent until the Feist song of the same title plays close to the end. Murphy was attracted to the role as a fan of Broken Social Scene and the prospect of making a silent movie, which he considered to be the \"hardest test for any actor\". Murphy also starred in Perrier's Bounty, a crime dramedy from the makers of Intermission, in which he portrayed a petty criminal on the run from a gangster played by Brendan Gleeson."]}, {"page": "Rachel Griffiths", "response": ["In 2006, she became part of the ensemble cast, co-starring alongside Sally Field, Calista Flockhart, Balthazar Getty and Matthew Rhys, of the dramatic series Brothers & Sisters, in which she portrays Sarah Walker, who inherits control of the family business after her father's death. Griffiths received a 2007 Emmy nomination and a 2008 Emmy nomination for her work on the series, followed by 2008 and 2009 Golden Globe nominations. Griffiths starred on the series until its conclusion in 2011. Additionally, she appeared as Inez Scull in the 2008 miniseries adaptation of Larry McMurtry's Comanche Moon."]}, {"page": "New Quay", "response": ["Much of the location filming for The Edge of Love, a 2008 film based around Thomas and Caitlin's friendship with Vera Killick, was carried out in and around New Quay. It starred Sienna Miller, Keira Knightley, Matthew Rhys and Cillian Murphy. The film, said the scriptwriter, Sharman Macdonald, was a work of fiction: it was “not true, it's surmise on my part, it's a fiction… I made it up.” Macdonald's comment is at http://www.bbc.co.uk/writersroom/insight/sharman_macdonald2.shtml One incident in the film that Macdonald did not make up was the shooting at Majoda in March 1945, after which Vera's husband, William Killick, was charged with attempted murder and later acquitted.D. N. Thomas (2000) ch.4 with further information at D. N Thomas (2002) ch.4."]}, {"page": "Brooklyn Heights", "response": ["* Keri Russell (born 1976), actressPrice, Lydia. \"Keri Russell & Matthew Rhys: Inside Their Love Story\", People (magazine), January 16, 2016. Accessed June 20, 2017. \"Evidence began to pile up in favor of the former when the twosome was spotted walking around Russell’s neighborhood in Brooklyn Heights a few days before Christmas 2013.\"", "* Matthew Rhys (born 1974), actor"]}]}}