{"wiki_id": "http://www.wikidata.org/entity/Q3434884", "itemLabel": "Robert Cyril Layton Perkins", "itemDescription": "British entomologist, ornithologist, and naturalist who studied the fauna of the islands of Hawaii and Hymenoptera (1866-1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Cyril_Layton_Perkins", "wikipedia_page": {"main": "Robert Cyril Layton Perkins FRS (15 November 1866 – 29 September 1955) was a distinguished British entomologist, ornithologist, and naturalist noted for his work on the fauna of the islands of Hawaii and on Hymenoptera. He is not to be confused with his son John Frederick Perkins, also a hymenopterist.", "link_mentions": [{"page": "Linnean Medal", "response": ["*1912: Robert Cyril Layton Perkins"]}, {"page": "David Sharp (entomologist)", "response": ["*1896 – 1913 With Robert Cyril Layton Perkins and Alfred Newton Fauna Hawaiiensis."]}, {"page": "Lānaʻi hookbill", "response": ["The Lānai hookbill was first collected by George C. Munro from Lānai's Kaiholena Valley on February 22, 1913. In 1919 Robert Cyril Layton Perkins described the species as Dysmorodrepanis munroi based upon this specimen, placing the hookbill in a new, monotypic genus. The genus name is derived from the Ancient Greek words dusmoros \"ill-fated,\" and drepanis to identify the species as a Hawaiian honeycreeper. Drepanis comes from the Ancient Greek word drepane \"sickle,\" in reference to most Hawaiian honeycreeper's bills. The specific name munroi recognizes the collector of the specimen, George C. Munro. The common name came from the species' limited range and distinctive bill shape."]}, {"page": "Paroreomyza", "response": ["Category:Taxa named by Robert Cyril Layton Perkins"]}, {"page": "Leptogryllus deceptor", "response": ["Category:Taxa named by Robert Cyril Layton Perkins"]}, {"page": "Oʻahu nukupuʻu", "response": ["Of the last known specimens recorded of the Oahu nukupuu, about nine specimens were collected in 1837 by naturalist Ferdinand Deppe and ornithologist John Kirk Townsend.  A few more specimens were collected through 1841, and after an extensive search by ornithologist Robert Cyril Layton Perkins, the Oahu nukupuu was considered extinct since at the start of the 21st century."]}, {"page": "R. C. L. Perkins", "response": ["#REDIRECT Robert Cyril Layton Perkins"]}, {"page": "Ischnocoelia", "response": ["Category:Taxa named by Robert Cyril Layton Perkins"]}, {"page": "Nesodynerus", "response": ["Category:Taxa named by Robert Cyril Layton Perkins"]}, {"page": "Robert Perkins (entomologist)", "response": ["#REDIRECT Robert Cyril Layton Perkins"]}, {"page": "Robert Perkins", "response": ["*Robert Cyril Layton Perkins (1866–1955), British entomologist"]}, {"page": "Robert C. L. Perkins", "response": ["#redirect Robert Cyril Layton Perkins"]}, {"page": "Hawaiian Entomological Society", "response": ["The Hawaiian Entomological Society was formed in early 1900 and first convened on January 26, 1905 in the Board Room of the Bureau of Agriculture and Forestry in Honolulu, Hawaii. The original officers of the group included the prominent  British entomologist, ornithologist, and naturalist Robert Cyril Layton Perkins (President), Alexander Craw (Vice President), Jacob Kotinsky (Secretary-Treasurer), Otto H. Swezey, (Executive Committee Member & Editor), D.L. Van Dine (Executive Committee), and G.W. Kirkaldy (Editor). The society publishes the Proceedings of the Hawaiian Entomological Society."]}, {"page": "List of fellows of the Royal Society P, Q, R", "response": ["| Robert Cyril Layton Perkins||13 May 1920||15 November 1866 – 29 September 1955"]}, {"page": "Progonostola cremnopis", "response": ["The description of Robert Cyril Layton Perkins (1913) reads: \"Near Honolulu it may be found resting on tree-trunks or the stems of tree-ferns on Mt. Tantalus, and on the decomposed lava of steep cliffs at Nuuanu Pali.\""]}, {"page": "Megalotica aphoristis", "response": ["Robert Cyril Layton Perkins (1913) noted that this species has been recorded flying during the day and has habits rather similar to those of Megalotica holombra."]}, {"page": "Megalotica holombra", "response": ["Robert Cyril Layton Perkins (1913) noted: \"this conspicuous dark-coloured, day-flying moth, of which two specimens are recorded, I observed in hundreds, if not thousands on one occasion, flying in the forest on Maui, but being always hampered with a gun and much occupied with birds, I neglected to catch a series and did not again have the chance.\""]}, {"page": "Chedra microstigma", "response": ["It was first described by Lord Walsingham in 1907 as Batrachedra microstigma from specimens collected at  in altitude in the Waianae Mountains of Oahu by Robert Cyril Layton Perkins, and moved to the genus Chedra by Elwood Zimmerman in 1978. Upon closer examination of the original type series, Zimmerman determined that Walsingham had in fact collected two species, and described the new species Chedra mimica from some of those same specimens. Otto Herman Swezey collected larvae at a coastal marshland near the city of Honolulu known as 'Kewalo', now long lost to development, which he then reared to adult moths. These August Busck then described as Batrachedra cuniculator, which Zimmerman synonymised in 1978. "]}, {"page": "Chedra mimica", "response": ["It was first collected by Robert Cyril Layton Perkins in the Waianae Mountains of Oahu together with Chedra microstigma in the beginning of the 20th century. These Lord Walsingham used, both species mixed together, to construct a type series which he used to describe the new Batrachedra microstigma in 1907."]}, {"page": "Batrachedrodes", "response": ["All six species were collected by Robert Cyril Layton Perkins and then described by Thomas de Grey, 6th Baron Walsingham in 1907. He classified them in the genus Batrachedra, although before publication he questioned if these species were not so distinct that they were better segregated in an independent genus. The genus was eventually split from Batrachedra by Elwood Zimmerman in his 1978 treatment of the microlepidoptera of Hawaii."]}, {"page": "Calliscelio", "response": ["Calliscelio is a parasitoid wasp monotypic genus which contains one species, C. elegans. It was first described as Caloteleia elegans on Oahu in the Hawaiian Islands in 1910 by British entomologist Robert Cyril Layton Perkins, who believed it not to be an indigenous species of Hawaii. Its pantropical species distribution is now well-established  and it is still considered to be an adventive species in Hawaii. C. elegans was reassigned from its original genus to Caenoteleia in 1926 by French entomologist Jean-Jacques Kieffer and then to Calliscelio in 2009.", "Category:Taxa named by Robert Cyril Layton Perkins"]}, {"page": "John Frederick Perkins", "response": ["John Frederick Perkins FRES (5 May 1910 in Paignton, Devon – 14 May 1983) was an English entomologist. He was the son of Zoë Lucy Sherrard Alatau and Robert Cyril Layton Perkins, also a hymenopterist. He was first educated at Newton College (Devon) and graduated with a First class Honours degree from the Imperial College of Science in 1932. In 1933, he was appointed an Assistant Keeper in the Department of  Entomology British Museum (Natural History) where he specialised in Hymenoptera."]}, {"page": "Elenchidae", "response": ["Category:Taxa named by Robert Cyril Layton Perkins"]}, {"page": "Heteropsyche stenomorpha", "response": ["Category:Taxa named by Robert Cyril Layton Perkins"]}, {"page": "Macrocalymma", "response": ["Category:Taxa named by Robert Cyril Layton Perkins"]}, {"page": "Hylaeus longiceps", "response": ["Category:Taxa named by Robert Cyril Layton Perkins"]}, {"page": "List of fellows of the Royal Society elected in 1920", "response": ["*Robert Cyril Layton Perkins"]}]}}