{"wiki_id": "http://www.wikidata.org/entity/Q3436730", "itemLabel": "Robert of Scone", "itemDescription": "Bishop of St Andrews", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_of_Scone", "wikipedia_page": {"main": "Robert of Scone (died 1159) was a 12th-century bishop of Cell Rígmonaid (or Kilrymont, now St Andrews). Robert's exact origins are unclear. He was an Augustinian canon at the Priory of St. Oswalds, at Nostell. His French name indicates a Norman rather than an Anglo-Saxon origin, but as he was likely born in the later 11th century, this may be due merely to the acculturation of his parents.", "link_mentions": [{"page": "David I of Scotland", "response": ["One of the first problems David had to deal with as king was an ecclesiastical dispute with the English church. The problem with the English church concerned the subordination of Scottish sees to the archbishops of York and/or Canterbury, an issue which since his election in 1124 had prevented Robert of Scone from being consecrated to the see of St Andrews (Cell Ríghmonaidh). It is likely that since the 11th century the bishopric of St Andrews functioned as a de facto archbishopric. The title of \"Archbishop\" is accorded in Scottish and Irish sources to Bishop GiricDauvit Broun, \"Recovering the Full Text of Version A of the Foundation Legend\", pp. 108–14. and Bishop Fothad II.AU 1093.2, text &  English translation; see also Alan Orr Anderson, Early Sources , p. 49", "Thurstan travelled to Rome, as did the Archbishop of Canterbury, William de Corbeil, and both presumably opposed David's request. David however gained the support of King Henry, and the Archbishop of York agreed to a year's postponement of the issue and to consecrate Robert of Scone without making an issue of subordination.Duncan, Making of the Kingdom, p. 260; John Dowden, Bishops of Scotland, (Glasgow, ), ed. J. Maitland Thomson, (Glasgow, 1912) pp. 4–5. York's claim over bishops north of the Forth were in practice abandoned for the rest of David's reign, although York maintained her more credible claims over Glasgow.Duncan, Scotland: The Making of the Kingdom, pp. 60–1."]}, {"page": "Scone (disambiguation)", "response": ["*Robert of Scone (died 1159), 12th century bishop of Cell Rígmonaid (or Kilrymont, now St Andrews)"]}, {"page": "Archbishop of St Andrews", "response": ["|Robert of Scone||1123/24–1159||Previously Prior of Scone."]}, {"page": "John Scotus (bishop of Dunkeld)", "response": ["John had studied at the University of Oxford and the University of Paris before beginning his ecclesiastical career at St. Andrews, entering the service of Bishop Richard. The latter made him Archdeacon of the see. His nickname would usually be taken to indicate that he was either a Gaelic-speaker or from Scotland-north-of-the-Forth (Scotia), but according to John of Fordun, he was from the villa of Podoth in Cheshire.John Dowden, The Bishops of Scotland, ed. J. Maitland Thomson, (Glasgow, 1912), p. 8. He certainly had Scottish connections in his family. For instance, he was the nephew of both Robert of Scone, a previous bishop of Cell Rígmonaid, and Matthew, Bishop of Aberdeen.D.D.R. Owen, The Reign of William the Lion: Kingship and Culture, 1143-1214, (East Linton, 1997), p. 62."]}]}}