{"wiki_id": "http://www.wikidata.org/entity/Q3431132", "itemLabel": "Richard Pool-Jones", "itemDescription": "English rugby union player and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Pool-Jones", "wikipedia_page": {"main": "Richard Pool-Jones (born 22 October 1969) is an English former rugby union player and current coach. He earned one cap for England in 1998, playing in the record 76-0 loss to Australia. Pool-Jones, who played club rugby in France for Biarritz Olympique and Stade Français, played for the latter in the 2001 Heineken Cup Final.After retiring from rugby, Pool-Jones began a media career in France. During the 2011 Rugby World Cup, he co-hosted a radio show with Vincent Moscato and Sébastien Chabal. He also served as a vice-president at Stade Français, and was credited with helping broker a deal that saved the club from bankruptcy before the 2011–12 season.In May 2012, he was named the new head coach of Stade Français, replacing Michael Cheika.", "link_mentions": [{"page": "King's School, Macclesfield", "response": ["* Richard Pool-Jones (born 1969), former England rugby union and Stade Francais player", "|Richard Pool-Jones(born 1969)"]}, {"page": "Stade Français", "response": ["At this time, Thomas Savare, Managing Director of the new shareholder, the Oberthur Fiduciaire group, took over as President of the club, replacing Max Guazzini. He invested 11 million Euros in the club, saying goodbye to Bernard Laporte and choosing the former third row of the Paris club, Richard Pool-Jones, as Vice-President. During the European campaign of the 2012–13 season, Stade Français increased the number of matches it played elsewhere for the European Challenge Cup matches, playing at the Stade Océane in Le Havre, the MMArena in Le Mans and the Stade du Hainaut in Valenciennes. Furthermore, on March 30, 2013, they played a league match against Toulon at the Stade Pierre-Mauroy in Lille.", "*20px|England Richard Pool-Jones", "*  Richard Pool-Jones (2012 – 2013)"]}, {"page": "Biarritz Olympique", "response": ["*  Richard Pool-Jones"]}, {"page": "Barbarian Rugby Club", "response": ["*  Richard Pool-Jones"]}, {"page": "1998 England rugby union tour of Australasia and South Africa", "response": ["Tony Diprose (Saracens), Steve Ojomoh (Bath), Richard Pool-Jones (Stade Francais Paris), Ben Sturnham (Saracens), Ben Clarke (Richmond), Pat Sanderson (Sale Sharks), Lewis Moody (Leicester Tigers)."]}, {"page": "List of England national rugby union players", "response": ["|1197||Richard Pool-Jones||flanker ||1998-06-06||v Australia at Brisbane"]}, {"page": "2001 Heineken Cup Final", "response": ["|OF ||7 || Richard Pool-Jones"]}, {"page": "1999–2000 French Rugby Union Championship", "response": ["|OF ||7 || Richard Pool-Jones "]}, {"page": "1997–98 French Rugby Union Championship", "response": ["|OF ||7 || Richard Pool-Jones || "]}, {"page": "2012–13 Top 14 season", "response": ["| align=\"left\"|  || 1997 || 22.8 || 7 || align=\"left\"|Richard Pool-JonesChristophe LaussucqDavid Auradou ||align=\"left\"| Stade CharlétyStade de France || 20,000"]}, {"page": "1991–92 French Rugby Union Championship", "response": ["|OF ||7 || Richard Pool-Jones "]}, {"page": "Leicester Tigers in cup finals", "response": ["|OF ||7 || Richard Pool-Jones ||"]}, {"page": "Pool-Jones, Richard", "response": ["#redirectRichard Pool-Jones"]}]}}