{"wiki_id": "http://www.wikidata.org/entity/Q3438184", "itemLabel": "Richard Norris", "itemDescription": "field hockey player", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Norris_(field_hockey)", "wikipedia_page": {"main": "Richard Owen Alfred Norris (10 December 1931 – 25 August 2012) was a British field hockey player who competed in the 1952 Summer Olympics in Helsinki, winning a bronze medal.\nHe was the youngest member of the British field hockey team, which won the bronze medal. He played all three matches as forward. Norris was among the surviving team members who had a reunion at the London Olympics to celebrate the 60th Anniversary of their medal winning achievement.", "link_mentions": [{"page": "Field hockey at the 1952 Summer Olympics", "response": ["| width=150 | Denys Carnill (capt) John CockettJohn ConroyGraham DaddsDerek DayDennis EaganRobin FletcherW A Lindsay-SmithRoger MidgleyRichard NorrisNeil NugentAnthony NunnAnthony John RobinsonP D R SmithJohn Paskin TaylorS T TheobaldEric Claude Newby"]}, {"page": "Great Britain at the 1952 Summer Olympics", "response": ["* Denys Carnill, John Cockett, John Conroy, Graham Dadds, Derek Day, Dennis Eagan, Robin Fletcher, Roger Midgley, Richard Norris, Neil Nugent, Anthony Nunn, Anthony Robinson, and John Taylor — Field Hockey, Men's Team Competition"]}, {"page": "List of Olympic medalists in field hockey", "response": ["|valign=top|Denys CarnillJohn CockettJohn ConroyGraham DaddsDerek DayDennis EaganRobin FletcherRoger MidgleyRichard NorrisNeil NugentAnthony NunnAnthony John RobinsonJohn Paskin Taylor"]}, {"page": "Richard Norris", "response": ["Richard Norris may refer to:", "*Richard Norris (1807–1874), American locomotive engineer with Norris Locomotive Works", "*Richard Norris (actor) (1910–1943), American actor, killed during World War II", "*Richard Norris (1922–2005), American actor, starred in Abie's Irish Rose", "*Richard Norris (field hockey) (1931–2012), British Olympic field hockey player", "*Richard Norris (musician) (born 1965), British music producer and musician, with The Grid"]}, {"page": "Deaths in August 2012", "response": ["*Richard Norris, 80, British Olympic bronze medallist field hockey player (1952)."]}]}}