{"wiki_id": "http://www.wikidata.org/entity/Q3434408", "itemLabel": "Robert Alan Mowbray Stevenson", "itemDescription": "British art historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Alan_Mowbray_Stevenson", "wikipedia_page": {"main": "Robert Alan Mowbray Stevenson (1847–1900) was a Scottish art critic, a cousin of the writer Robert Louis Stevenson and the brother of Katharine de Mattos.\n\n", "link_mentions": [{"page": "Alan Stevenson", "response": ["On 11 September 1844, he married Margaret Scott Jones (1813–1895), daughter of Jean (née Scott) and Humphrey Herbert Jones of Anglesey. They had three daughters, Jean, Dorothea and the author and journalist Katherine Elizabeth de Mattos Stevenson (1851–1939), and one son, art critic Robert Alan Mowbray Stevenson (1827–1880).Inscription on grave of Alan Stevenson, New Calton Cemetery"]}, {"page": "Stevenson", "response": ["**Robert Alan Mowbray Stevenson (1847–1900), art critic"]}, {"page": "Carolus-Duran", "response": ["Mary Fairchild MacMonnies Low, Paul Helleu, Alexandre Jean Baptiste Brun, Robert Alan Mowbray Stevenson, Lucy Lee-Robbins, Ramón Casas i Carbó, Ernest Ange Duez and James CadenheadMowat, Alison (Ed.) (2013), James Cadenhead RSA RSW 1858 - 1927: His Letters Home as a Young Man, Alison Mowat, pp. 98 - 100 Of his twenty-five most notable students, the majority were British or American."]}, {"page": "Robert Stevenson", "response": ["* Robert Alan Mowbray Stevenson (1847–1900), Scottish art critic"]}, {"page": "1847 in Scotland", "response": ["* 28 March – Robert Alan Mowbray Stevenson, art critic (died 1900)"]}, {"page": "Katharine de Mattos", "response": ["Katharine Elizabeth Alan de Mattos, née Stevenson (1851–1939) was a Scottish author and journalist. She was the youngest daughter of Margaret Scott Jones, daughter of Humphrey Herbert Jones of Anglesey and the lighthouse engineer, Alan Stevenson. Her brother was the art critic Robert Alan Mowbray Stevenson."]}]}}