{"wiki_id": "http://www.wikidata.org/entity/Q3431828", "itemLabel": "John Man", "itemDescription": "British historian and travel writer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Man_(author)", "wikipedia_page": {"main": "John Anthony Garnet Man (born 15 May 1941) is a British historian and travel writer. His special interests are China, Mongolia and the history of written communication.", "link_mentions": [{"page": "Golden ratio", "response": ["* Historian John Man states that both the pages and text area of the Gutenberg Bible were \"based on the golden section shape\". However, according to his own measurements, the ratio of height to width of the pages is 1.45.Man, John, Gutenberg: How One Man Remade the World with Word (2002) pp.  166–167, Wiley, . \"The half-folio page (30.7 × 44.5 cm) was made up of two rectangles—the whole page and its text area—based on the so called 'golden section', which specifies a crucial relationship between short and long sides, and produces an irrational number, as pi is, but is a ratio of about 5:8.\""]}, {"page": "Western Xia", "response": ["The destruction of Western Xia during the second campaign was nearly total. According to John Man, Western Xia is little known to anyone other than experts in the field due to Genghis Khan's policy calling for their complete eradication. He states that \"There is a case to be made that this was the first ever recorded example of attempted genocide. It was certainly very successful ethnocide.\" However, some members of the Western Xia royal clan emigrated to western Sichuan, northern Tibet, and even possibly Northeast India, in some instances becoming local rulers.Franke, Herbert and Twitchett, Denis, ed. (1995). The Cambridge History of China: Vol. VI: Alien Regimes & Border States, 907–1368. Cambridge: Cambridge University Press. pg. 214. A small Western Xia state was established in Tibet along the upper reaches of the Yalong River while other Western Xia populations settled in what are now the modern provinces of Henan and Hebei. In China, remnants of the Western Xia persisted into the middle of the Ming dynasty."]}, {"page": "Marc Chagall", "response": ["The website also notes, \"The colours address our vital consciousness directly, because they tell of optimism, hope and delight in life\", says Monsignor Klaus Mayer, who imparts Chagall's work in mediations and books. He corresponded with Chagall during 1973, and succeeded in persuading the \"master of colour and the biblical message\" to create a sign for Jewish-Christian attachment and international understanding. Centuries earlier Mainz had been \"the capital of European Jewry\", and contained the largest Jewish community in Europe, notes historian John Man.Man, John, The Gutenberg Revolution, (2002) Headline Book Publishing\"Jewish Life and Times in Medieval Mainz\", City of Mainz website In 1978, at the age of 91, Chagall created the first window and eight more followed. Chagall's collaborator Charles Marq complemented Chagall's work by adding several stained glass windows using the typical colors of Chagall."]}, {"page": "Qin Shi Huang", "response": ["The Chinese historian Sima Qian, writing a century after the First Emperor's death, wrote that it took 700,000 men to construct the emperor's mausoleum. British historian John Man points out that this figure is larger than the population of any city in the world at that time and he calculates that the foundations could have been built by 16,000 men in two years.Man, John. The Terracotta Army, Bantam Press 2007 p. 125. . While Sima Qian never mentioned the terracotta army, the statues were discovered by a group of farmers digging wells on 29 March 1974.Huang, Ray. (1997). China: A Macro History. Edition: 2, revised, illustrated. M.E. Sharpe publishing. . p. 37 The soldiers were created with a series of mix-and-match clay molds and then further individualized by the artists' hand. Han Purple was also used on some of the warriors.Thieme, C. 2001. (translated by M. Will) Paint Layers and Pigments on the Terracotta Army: A Comparison with Other Cultures of Antiquity. In: W. Yongqi, Z. Tinghao, M. Petzet, E. Emmerling and C. Blänsdorf (eds.) The Polychromy of Antique Sculptures and the Terracotta Army of the First Chinese Emperor: Studies on Materials, Painting Techniques and Conservation. Monuments and Sites III. Paris: ICOMOS, 52–57.", "One of the first projects which the young king accomplished while he was alive was the construction of his own tomb. In 215 BCE Qin Shi Huang ordered General Meng Tian to begin its construction with the assistance of 300,000 men. Other sources suggest that he ordered 720,000 unpaid laborers to build his tomb according to his specifications. Again, given John Man's observation regarding populations at the time (see paragraph above), these historical estimates are debatable. The main tomb (located at ) containing the emperor has yet to be opened and there is evidence suggesting that it remains relatively intact. Sima Qian's description of the tomb includes replicas of palaces and scenic towers, \"rare utensils and wonderful objects\", 100 rivers made with mercury, representations of \"the heavenly bodies\", and crossbows rigged to shoot anyone who tried to break in.Man, John. The Terracotta Army, Bantam Press 2007 p. 170. . The tomb was built at the foot of Mount Li, 30 kilometers away from Xi'an. Modern archaeologists have located the tomb, and have inserted probes deep into it. The probes revealed abnormally high quantities of mercury, some 100 times the naturally occurring rate, suggesting that some parts of the legend are credible. Secrets were maintained, as most of the workmen who built the tomb were killed.Leffman, David. Lewis, Simon. Atiyah, Jeremy. Meyer, Mike. Lunt, Susie. (2003). China. Edition: 3, illustrated. Rough Guides publishing. . p. 290."]}, {"page": "Legalism (Chinese philosophy)", "response": ["John Man describes the early Mao as a \"dyed-in-the-wool\" Legalist or \"Lord Shang-style 'sage ruler', who defined the law according to revolutionary needs\".John Man 2008. p. 51. Terra Cotta Army."]}, {"page": "John Mann", "response": ["John Mann may refer to:", "*John Mann (British actor), British radio actor", "*John Mann (musician) (1962–2019), Canadian folk-rock musician and actor", "*John Mann (engineer), guitar engineer", "*John Mann (Australian cricketer) (1919-1969), Australian cricketer", "*John Mann (English cricketer) (born 1983), English cricketer", "*John Mann (water polo) (born 1985), American water polo player", "*John Mann (Australian politician) (1869–1939), Australian politician", "*John Mann, Baron Mann (born 1960), British politician", "*John Mann (New Hampshire politician)", "*John Man (author) (born 1941), British author", "*John Man (1512–1569), English churchman and diplomat"]}, {"page": "Genocides in history (before World War I)", "response": ["The second campaign against Western Xia, the final military action led by Genghis Khan, and during which he died, involved an intentional and systematic destruction of Western Xia cities and culture. According to John Man, because of this policy of total obliteration, Western Xia is little known to anyone other than experts in the field because so little record is left of that society. He states that \"There is a case to be made that this was the first ever recorded example of attempted genocide. It was certainly very successful ethnocide.\""]}, {"page": "Timberlake Wertenbaker", "response": ["Wertenbaker has a home in north London, where she lives with her husband, the writer John Man. The couple have one daughter."]}, {"page": "Canons of page construction", "response": ["=== John Man's interpretation of Gutenberg ===", "Historian John Man suggests that both the Gutenberg Bible's pages and printed area were based on the golden ratio (commonly approximated as the decimal 0.618 or the ratio 5:8). He quotes the dimensions of Gutenberg's half-folio Bible page as 30.7 x 44.5 cm, a ratio of 0.690, close to Rosarivo's golden 2:3 (0.667) but not to the golden ratio (0.618).", "John Man's quoted Gutenberg page sizes are in a proportion not very close to the golden ratio, but Rosarivo's or van de Graaf's construction is applied by Tschichold to make a pleasing type area on pages of arbitrary proportions, even such accidental ones."]}, {"page": "Mongol conquest of China", "response": ["Möngke Khan dispatched Kublai to the Dali Kingdom in 1253 to outflank the Song. The Gao family dominated the court, resisted and murdered Mongol envoys. The Mongols divided their forces into three. One wing rode eastward into the Sichuan basin. The second column under Uryankhadai took a difficult way into the mountains of western Sichuan.John Man Kublai Khan, p.79 Kublai himself headed south over the grasslands, meeting up with the first column. While Uryankhadai galloping in along the lakeside from the north, Kublai took the capital city of Dali and spared the residents despite the slaying of his ambassadors. The Dali King  () himself defected to the Mongols, who used his troops to conquer the rest of Yunnan. The Mongols appointed King Duan Xingzhi as Maharajah and stationed a pacification commissioner there.C. P. Atwood Encyclopedia of Mongolia and the Mongols, p.613 After Kublai's departure, unrest broke out among the Black Jang (one of the main ethnic groups of the Dali kingdom). By 1256, Uryankhadai, the son of Subutai had completely pacified Yunnan. The Duan family were originally Han Chinese from Wuwei in Gansu."]}, {"page": "Charles Bawden", "response": ["He wrote extensively on Mongolian history and literature, and published a Mongolian-English dictionary that is often cited as the most comprehensive available. There is an extensive assessment of his scholarship in his British Academy obituary.Charles Roskelly BAWDEN FBA Obituary Among his students were John Man, Professor Craig Clunas FBA and Prof. Dr. Veronika Veit."]}, {"page": "Genghis Khan", "response": ["The conquests and leadership of Genghis Khan included widespread devastation and mass murder. The targets of campaigns that refused to surrender would often be subject to reprisals in the form of enslavement and wholesale slaughter. The second campaign against Western Xia, the final military action led by Genghis Khan, and during which he died, involved an intentional and systematic destruction of Western Xia cities and culture. According to John Man, because of this policy of total obliteration, Western Xia is little known to anyone other than experts in the field because so little record is left of that society. He states that \"There is a case to be made that this was the first ever recorded example of attempted genocide. It was certainly very successful ethnocide.\" In the conquest of Khwarezmia under Genghis Khan, the Mongols razed the cities of Bukhara, Samarkand, Herāt, Ṭūs, and Neyshābūr and killed the respective urban populations. His invasions are considered the beginning of a 200-year period known in Iran and other Islamic societies as the \"Mongol catastrophe.\" Ibn al-Athir, Ata-Malik Juvaini, Seraj al-Din Jozjani, and Rashid al-Din Fazl-Allah Hamedani, Iranian historians from the time of Mongol occupation, describe the Mongol invasions as a catastrophe never before seen. A number of present-day Iranian historians, including Zabih Allah Safa, have likewise viewed the period initiated by Genghis Khan as a uniquely catastrophic era. Steven R. Ward writes that the Mongol violence and depredations in the Iranian Plateau \"killed up to three-fourths of the population... possibly 10 to 15 million people. Some historians have estimated that Iran's population did not again reach its pre-Mongol levels until the mid-20th century.\""]}, {"page": "John Man", "response": ["John Man (1512–1569) was an English churchman, college head, and a diplomat", "Dr. John Man was a Protestant cleric, who called the pope in public a canting little monk.", "*Gary M. Bell, \"John Man: The Last Elizabethan Resident Ambassador in Spain\", Sixteenth Century Journal, 7/2 (1976): 75-93"]}, {"page": "Mongol conquest of Western Xia", "response": ["The destruction of Western Xia during the second campaign was near total. According to John Man, Western Xia is little known to anyone other than experts in the field precisely because of Genghis Khan's policy calling for their complete eradication. He states that \"There is a case to be made that this was the first ever recorded example of attempted genocide. It was certainly very successful ethnocide.\"Man 2004, pp. 116–117"]}]}}