{"wiki_id": "http://www.wikidata.org/entity/Q3442515", "itemLabel": "Rosemary Rogers", "itemDescription": "British-American romance novelist", "wikipedia_url": "https://en.wikipedia.org/wiki/Rosemary_Rogers", "wikipedia_page": {"main": "Rosemary Rogers, née Jansz (born 7 December 1932 in Panadura, British Ceylon, now Sri Lanka – died 12 November 2019) was a Sri Lankan Burgher best-selling author of historical romance novels. Her first book, Sweet Savage Love, was published in 1974.  She was the second romance author, after Kathleen Woodiwiss, to have her novels published in trade paperback format. Both writers found their initial success working with editor Nancy Coffey who was then with Avon Books. Rogers is considered to be one of the founders of the modern historical romance, and many of today's writers cite her writing as one of their biggest influences.  She lived in California.", "link_mentions": [{"page": "December 7", "response": ["*  1932   – Rosemary Rogers, American journalist and author"]}, {"page": "Romance novel", "response": ["In the US, modern romance genre fiction was born in 1972, with Avon's publication of Kathleen Woodiwiss's The Flame and the Flower, which was the first of the modern \"bodice ripper\" romance novels to follow \"the principals into the bedroom.\" Aside from its content, the book was revolutionary in that it was one of the first single-title romance novels to be published as an original paperback, rather than being first published in hardcover, and, like the category romances, was distributed in drug stores and other mass-market merchandising outlets. The novel went on to sell 2.35 million copies. Avon followed its release with the 1974 publication of Woodiwiss's second novel, The Wolf and the Dove and two more sexually graphic novels by newcomer Rosemary Rogers, Sweet Savage Love and Dark Fires. The latter sold two million copies in its first three months of release. By 1975, Publishers Weekly had reported that the \"Avon originals\" had sold a combined .Thurston, pp 47-48. The following year over 150 historical romance novels, many of them paperback originals, were published, selling over ."]}, {"page": "Avon (publisher)", "response": ["In 1972, Avon entered the modern romance genre with the publication of Kathleen Woodiwiss' The Flame and the Flower. The novel went on to sell 2.35 million copies. Avon followed its release with the 1974 publication of Woodiwiss's second novel, The Wolf and the Dove. The next two romances by newcomer Rosemary Rogers, Sweet Savage Love and Dark Fires, also published in 1974, reached bestseller status. The latter sold two million copies in its first three months of release and the former inspired the name of the genre: \"sweet savage romances\"."]}, {"page": "Miss Universe 1983", "response": ["* Rosemary Rogers"]}, {"page": "Historical romance", "response": ["The modern mass-market romance genre was born in America 1972 with Avon's publication of Kathleen Woodiwiss's historical romance The Flame and the Flower. Set around 1900. it is the first romance novel \"to [follow] the principals into the bedroom.\"  Aside from its content, the book was revolutionary in that it was one of the first single-title romance novels to be published as an original paperback, rather than being first published in hardcover, and, like the category romances, was distributed in drug stores and other mass-market merchandising outlets.  The novel went on to sell  2.35 million copies. Avon followed its release with the 1974 publication of Woodiwiss's second novel, The Wolf and the Dove and two novels by newcomer Rosemary Rogers.  One of Rogers's novels, Dark Fires sold two million copies in its first three months of release, and, by 1975, Publishers Weekly had reported that the \"Avon originals\" had sold a combined 8 million copies.Thurston, pp 47–48.  The following year over 150 historical romance novels, many of them paperback originals, were published, selling over 40 million copies.  Unlike Woodiwiss, Rogers's novels featured couples who travelled the world, usually were separated for a time, and had multiple partners within the book."]}, {"page": "Kate Hoffmann", "response": ["Hoffmann majored in music in college, later she settled into a job teaching music to elementary school children. After she left teaching, she had jobs in fashion merchandising, advertising, public relations and marketing/communications on both the agency and corporate side.  She began reading romantic novels in 1979, when she picked up a copy of Ashes in the Wind by Kathleen E. Woodiwiss, after which she immediately read all by Kathleen E. Woodiwiss, Rosemary Rogers, Laurie McBain, Valerie Sherwood, Johanna Lindsey and Jennifer Blake."]}, {"page": "The Flame and the Flower", "response": ["Avon followed its release of The Flame and the Flower with the 1974 publication of Woodiwiss's second novel, The Wolf and the Dove and two similarly themed romance novels by newcomer Rosemary Rogers.  In 1975, Publishers Weekly reported that these four \"Avon originals\" had sold a combined 8 million copies.Thurston, pp 47-48. Avon's \"extraordinary success\" led other paperback publishing firms to begin featuring original works by new authors. Avon became known as the premier publishing company for new writers of romance novels."]}, {"page": "Dark Fire", "response": ["* Dark Fires, a novel by Rosemary Rogers"]}, {"page": "Rosemary Janz", "response": ["#REDIRECT Rosemary Rogers"]}, {"page": "Rosemary (given name)", "response": ["*Rosemary Rogers (born 1932), American author"]}, {"page": "List of Burgher people", "response": ["* Rosemary Rogers – best-selling author of romance novels in the USA; has been on the New York Times best-sellers list"]}, {"page": "List of Sri Lankan Americans", "response": ["* Rosemary Rogers - best-selling author of romance novels in the US; has been on the New York Times best-sellers list"]}, {"page": "Rosemary Jansz", "response": ["#REDIRECT Rosemary Rogers"]}, {"page": "Rosemary Navaratnam", "response": ["#REDIRECT Rosemary Rogers"]}, {"page": "Rosemary Kadison", "response": ["#REDIRECT Rosemary Rogers"]}, {"page": "December 1932", "response": ["*Born: Paul Caponigro, photographer, in Boston, Massachusetts; Rosemary Rogers, historical romance novelist, in Panadura, Ceylon (d. 2019); J. B. Sumarlin, economist and finance minister, in Nglegok, East Java (d. 2020)"]}, {"page": "Sherry Thomas", "response": ["Thomas improved her English by reading science fiction and romance novels, including those by Rosemary Rogers. Thomas reportedly read Rogers' novel Sweet Savage Love using a Chinese-English dictionary. Thomas found English-language romance books interesting due to their departure from Chinese cultural understandings of courtship. \"I was quite surprised later to discover that the hero and the heroine in a romance weren’t required to hate each other for 600 pages running.\""]}, {"page": "Index of Sri Lanka–related articles (Q–R)", "response": ["# Rosemary Rogers"]}, {"page": "Rosemary Rodgers", "response": ["#REDIRECT Rosemary Rogers"]}, {"page": "Deaths in November 2019", "response": ["*Rosemary Rogers, 86, British-American novelist.Rosemary Rogers"]}, {"page": "The Limbo Line", "response": ["* Rosemary Rogers  as Joan Halst "]}, {"page": "Summa Navaratnam", "response": ["He married Sri Lankan born British-American best-selling author Rosemary Rogers and the couple had two daughters, Rosanne and Sharon. The couple later divorced and Rosemary moved to London with her daughters in 1960. He was later married to Romaine and has two children."]}]}}