{"wiki_id": "http://www.wikidata.org/entity/Q3445554", "itemLabel": "Robert Orledge", "itemDescription": "English musicologist and music historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Orledge", "wikipedia_page": {"main": "Robert Orledge (born 5 January 1948) is a British musicologist, and a professor emeritus of the University of Liverpool. He specialises in French music of the early twentieth century.", "link_mentions": [{"page": "Claude Debussy", "response": ["Debussy's musical development was slow, and as a student he was adept enough to produce for his teachers at the Conservatoire works that would conform to their conservative precepts. His friend Georges Jean-Aubry commented that Debussy \"admirably imitated Massenet's melodic turns of phrase\" in the cantata L'enfant prodigue (1884) which won him the Prix de Rome. A more characteristically Debussian work from his early years is La Damoiselle élue, recasting the traditional form for oratorios and cantatas, using a chamber orchestra and a small body of choral tone and using new or long-neglected scales and harmonies.Jean-Aubry, Georges. (trans. Frederick H. Martens). \"Claude Debussy\", The Musical Quarterly, October 1918, pp. 542–554  His early mélodies, inspired by Marie Vasnier, are more virtuosic in character than his later works in the genre, with extensive wordless vocalise; from the Ariettes oubliées (1885–1887) onwards he developed a more restrained style. He wrote his own poems for the Proses lyriques (1892–1893) but, in the view of the musical scholar Robert Orledge, \"his literary talents were not on a par with his musical imagination\".Orledge, Robert. \"Debussy, (Achille-)Claude\", The Oxford Companion to Music, Oxford University Press, 2011, retrieved 21 May 2018 "]}, {"page": "Erik Satie", "response": ["In 1887, at the age of 21, Satie moved from his father's residence to lodgings in the 9th arrondissement. By this time he had started what was to be an enduring friendship with the romantic poet Contamine de Latour, whose verse he set in some of his early compositions, which Satie senior published. His lodgings were close to the popular Chat Noir cabaret on the southern edge of Montmartre where he became an habitué and then a resident pianist. The Chat Noir was known as the \"temple de la 'convention farfelue'\" – the temple of zany convention,Rey, p. 14 and as the biographer Robert Orledge puts it, Satie, \"free from his restrictive upbringing … enthusiastically embraced the reckless bohemian lifestyle and created for himself a new persona as a long-haired man-about-town in frock coat and top hat\". This was the first of several personas that Satie invented for himself over the years."]}, {"page": "Gabriel Fauré", "response": ["Fauré's biographer Nectoux writes in the Grove Dictionary of Music and Musicians that Fauré is widely regarded as the greatest master of French song, and that alongside the mélodies, the chamber works rank as \"Fauré's most important contribution to music\". The critic Robert Orledge writes, \"His genius was one of synthesis: he reconciled such opposing elements as modality and tonality, anguish and serenity, seduction and force within a single non-eclectic style, as in the Pelléas et Mélisande suite, his symphonic masterpiece. The quality of constant renewal within an apparently limited range ... is a remarkable facet of his genius, and the spare, elliptical style of his single String Quartet suggests that his intensely self-disciplined style was still developing at the time of his death\".Orledge, Robert. \"Fauré, Gabriel (Urbain)\", The Oxford Companion to Music, Oxford Music Online, accessed 26 September 2010 "]}, {"page": "Charles Gounod", "response": ["Gounod is best known for his operas – in particular Faust. Celebrated during his lifetime, Gounod's religious music became unfashionable in the 20th century and little of it is regularly heard. His songs, an important influence on later French composers, are less neglected, although only a few are well known. Michael Kennedy writes that Gounod's music has \"considerable melodic charm and felicity, with admirable orchestration\". He adds that Gounod was \"not really a master of the large and imposing forms, in this way perhaps being a French parallel to Sullivan\".Kennedy, Michael. \"Gounod, Charles François\", The Oxford Dictionary of Music, Oxford University Press, 2012. Retrieved 30 November 2019  There is wide agreement among commentators that he was at his finest more often in the earlier decades of his career than later. Robert Orledge judges that in the 1850s and 1860s Gounod introduced to French opera a combination of \"tender, lyrical charm, consummate craftsmanship, and genuine musical characterization\", but his later works tend to \"sentimentality and banality ... in his quest for inspired simplicity\".Orledge, Robert. \"Gounod, Charles (François)\", The Oxford Companion to Music, Oxford University Press, 2011. Retrieved November 2019 "]}, {"page": "Vincent d'Indy", "response": ["According to the biographer Robert Orledge, the death of d'Indy's first wife in 1905 removed the stabilising influence in the composer's life, and he became \"increasingly vulnerable to politically motivated attacks on the Schola Cantorum and apprehensive of dangerously decadent trends in contemporary music in both France and Germany\". His aesthetic ideas, Orledge argues, became \"increasingly reactionary and dogmatic\" and his political views right-wing and anti-Semitic. He joined the Ligue de la patrie française (League of the French Fatherland) during the Dreyfus affair."]}, {"page": "Beechen Cliff School", "response": ["* Robert Orledge, scholar of early twentieth century French music"]}, {"page": "Charles Koechlin", "response": ["* Robert Orledge, Charles Koechlin (1867–1950): His Life and Works, London, Psychology Press, 1989."]}, {"page": "List of compositions by Claude Debussy", "response": ["completed, revised, and orchestrated by Juan Allende-Blin 1979; also completed (new version) by Robert Orledge 2013", "|unfinished, reconstructed by Robert Orledge 2005, revised 2012 and 2014, premiered 2015", "|unfinished, reconstructed by Robert Orledge 2011, premiered 2015"]}, {"page": "Pavane (Fauré)", "response": ["The Fauré scholar Jean-Michel Nectoux writes that the Pavane has become one of the composer's best-known pieces, and \"there will be few to deny that it is one of the most attractive of his lesser works: the flute theme, once heard, is not easily forgotten\".Nectoux, pp. 108–109 In a 1979 study, Robert Orledge describes the scoring of the Pavane as \"delicate and airy, with some practical and inspired woodwind writing and a variety of string textures…\" He adds that the strings sometimes double the viola part on either second violins or cellos, \"perhaps for safety's sake\". After the opening flute theme, there is a more dramatic central section, comprising a series of four-bar sequences over bass pedals which descend whole tones – a favourite device of Fauré's. There are small and barely perceptible changes to the main theme during the work and reharmonisations that Orledge calls \"a miracle of Fauréan ingenuity\".Orledge, p. 101"]}, {"page": "Jeux", "response": ["Jeux (Games) is a ballet written by Claude Debussy. Described as a \"poème dansé\" (literally a \"danced poem\"), it was written for Sergei Diaghilev's Ballets Russes with choreography by Vaslav Nijinsky. Debussy initially objected to the scenario but reconsidered the commission when Diaghilev doubled the fee. Debussy wrote the score quickly, from mid-August to mid-September 1912. Robert Orledge has analysed the chronology of Debussy's composition and preserved manuscripts of the score."]}, {"page": "Images pour orchestre", "response": ["Controversy exists over the role of André Caplet in the orchestration of Gigues.  Robert Orledge and Williametta Spencer are two writers, for example, who have accepted Caplet as assisting with the orchestration.  In contrast, François Lesure has stated, based on manuscript examination in the Bibliothèque nationale (MS 1010), that Caplet did not assist with the orchestration."]}, {"page": "Unfinished creative work", "response": ["* Claude Debussy's fragment La chute du Maison Usher was realized three times, by Carolyn Abbate, Juan Allende-Blin and Julian Grant, and completed by Robert Orledge, using other extant music by Debussy."]}, {"page": "Dolly (Fauré)", "response": ["Allegro vivo. \"Mi-a-ou\" was written for Dolly's second birthday in June 1894. The title does not refer to a pet cat, as has often been supposed,  but to Dolly's attempts to pronounce the name of her elder brother Raoul, who later became one of Fauré's favourite pupils. The young Dolly called her brother Messieu Aoul, which Fauré took as the original title for the piece. In his finished manuscript the title is shortened to \"Miaou\" (without hyphens). The Fauré scholar Robert Orledge writes that the title \"Mi-a-ou\", like that of the \"Kitty-valse\" later in the suite, is the responsibility of Fauré's publisher, Julien Hamelle.Orledge, "]}, {"page": "La chute de la maison Usher (opera)", "response": ["In 1909 Debussy wrote that he had almost finished Roderick Usher's monologue: \"It almost makes the stones weep ... as a matter of fact it is all about the influence of stones on the minds of neurasthenic people. The mustiness is charmingly rendered by contrasting the low notes of the oboe with the harmonics of the violin (a patent device of my own).\" Debussy had believed he had been subject to neurasthenia but around this time his doctor diagnosed him as suffering from the rectal cancer which was to kill him. According to Robert Orledge, \"Debussy began increasingly to identify with Roderick Usher, whose mental breakdown Poe had identified with the crumbling House itself.\" Debussy made three attempts at writing a libretto. Only when he was satisfied with the third one did he produce a short-score draft of the music to the first scene and part of the second in 1916–17. He went no further with Usher before his death in 1918. The surviving manuscript of the libretto is held at the Harry Ransom Center.", "In 2004, Robert Orledge completed and orchestrated the work using Debussy's draft. His reconstruction has been performed several times. It has also been recorded on DVD (Capriccio 93517)\"Debussy Completions and Orchestrations\" by Robert Orledge, December 2013 (see Recordings below). The first German staging of Orledge's reconstruction took place in Mannheim in 2019, expanded to 90 minutes with other music by Debussy.Rolf Fath. \"Report from Mannheim.\" Opera, November 2019, vol. 70, no. 11, p. 1412."]}, {"page": "List of compositions by Germaine Tailleferre", "response": ["3. Robert Orledge's catalog of manuscript sources in Germaine Tailleferre (1892–1983) : A Centenary Appraisal\" Muziek & Wetenschap 2 (Summer 1992) which he examined in Paris during September, 1991, which include complete scientific descriptions of the manuscript objects."]}, {"page": "Adela Maddison", "response": ["During 1898 –  1905, she lived in Paris without her husband; Fauré's biographer Robert Orledge believes there was a romantic liaison with Fauré, who dedicated his Nocturne No. 7, Op. 74, to her in 1898; this piece was expressive of his feelings towards her, according to Orledge. Fauré gave her the nocturne's manuscript; it is now in the Bibliothèque nationale de France. In Paris she was also acquainted with Delius, Debussy and Ravel, and produced performances of her own works and those of others. She hosted the first performance of Delius's opera Koanga in March 1899 at her residence there, attended by Prince Edmond de Polignac and the Princesse de Polignac. Fauré was among the performers."]}, {"page": "Nocturnes (Satie)", "response": ["The Nocturnes are five piano pieces (planned as a set of seven, but unfinished) Satie planned to write at least seven Nocturnes, with No. 4 serving as an \"interlude\" between two sets of three, based on material in the composer's notebooks at the Bibliothèque nationale de France, Paris. See Robert Orledge, \"Satie the Composer\", Cambridge University Press, 1990, pp. 194–195 and p. 318. by Erik Satie. They were written between August and November 1919. With the exception of the Premier Menuet (1920) they were his final works for solo piano, and are considered among his most significant achievements in the genre.Rollo H. Myers, \"Erik Satie\", Dover Publications, Inc., NY, 1968, p. 58. Originally published in 1948 by Denis Dobson Ltd., London.Patrick Gowers and Nigel Wilkins, \"Erik Satie\", \"The New Grove: Twentieth-Century French Masters\", Macmillan Publishers Limited, London, 1986, p. 142. Reprinted from \"The New Grove Dictionary of Music and Musicians\", 1980 edition. The Nocturnes stand apart from Satie's piano music of the 1910s in their complete seriousness, lacking the zany titles, musical parody, and extramusical texts he typically featured in his scores of the time. In performance the set lasts about 13 minutes.", "Satie's notebooks reveal he initially intended to present the Nocturnes with the whimsical literary humor the Parisian public had come to expect from him. The first piece had the working title Faux Nocturne and was accompanied by one of those little stories he enjoyed writing for the pianist's private amusement:Satie manuscript, BNF 9609 (2) pp. 2–6, Bibliothèque nationale de France. See Robert Orledge, \"Appendix: Chronological Catalogue of Satie's Compositions and Research Guide to the Manuscripts\", published in Dr. Caroline Potter (ed.), \"Erik Satie: Music, Art and Literature\", Ashgate Publishing, LTD, 2013, pp. 243-324.", "On August 24, 1919, Satie informed Valentine Hugo: \"I am coming to the end of my Third Nocturne. I am dedicating it to you. The three of them are not at all bad. The first serves as a prelude; the second is shorter and very tender – very nocturnal; the third, yours, is a more rapid and dramatic nocturne, a little longer than the first. Between the three of them they form a whole with which I am very pleased – though the first is the least good.\"http://thefrogweb.wordpress.com/2010/04/18/satie1/ Quoted by Robert Orledge in \"Erik Satie - Six Nocturnes - and a trio of Sevens\", part of the article \"Erik Satie: Autour des Nocturnes\" posted on The Frogweb April 18, 2010. This assessment was premature. Satie was not satisfied with the second Nocturne until the following month, and he continued to tinker with No. 3 until October - by which time he was developing ideas for additional pieces in the series. Nos. 4 and 5 are dated October and November 1919, respectively.", "Shortly before his death in 1925, Satie told Robert Caby that the manuscript of his sixth Nocturne was virtually complete and might be published someday.Orledge, Potter (ed.), \"Erik Satie: Music, Art and Literature\", pp. 243–324. Six decades later, musicologist Robert Orledge examined Satie's notebooks from the period and discovered a single full draft of a piano piece, missing only two bars of the left-hand part.Satie manuscript, BNF 9609 (2) pp. 15–18,  Bibliothèque nationale de France. Orledge, Potter (ed.), \"Erik Satie: Music, Art and Literature\", pp. 243–324. Orledge completed a performing version and it was published as Satie's Nocturne No. 6 in 1994. Speculative versions of a Nocturne No. 7, based on a 12-bar sketch in the notebooks,Satie manuscript, BNF 9609 (4) pp. 6–8, Bibliothèque nationale de France. Orledge, Potter (ed.), \"Erik Satie: Music, Art and Literature\", pp. 243-324. have been created by Orledge and others."]}, {"page": "Avant-dernières pensées", "response": ["The outbreak of World War I in July 1914 was a setback for Satie just as he was gaining belated recognition as a composer. Although at age 48 he remained a civilian,In August 1914 Satie briefly served as a corporal in the Socialist militia of Arcueil-Cachan, whose duties consisted of patrolling these Paris suburbs at night \"armed to the teeth\". They were ordered to suspend their activities because they were preventing people from sleeping. See Ornella Volta, \"Satie Seen Through His Letters\", Marion Boyars Publishers, New York, 1989, pp. 103–104. wartime conditions seriously disrupted French musical life. Publishers ceased commissioning his music and the pending publication of his 1914 compositions was suspended for two years or more.Of the 1914 works, Choses vues à droite et à gauche (sans lunettes), Heures séculaires et instantanées, Les trois valses distinguées du précieux dégoûté, and Trois poèmes d'amour were published in 1916. Sports et divertissements would not see print until 1923.Satie's notebooks show he planned 9 additional piano suites through November 1914, with such titles as Venomous Obstacles and Boring Globules. He abandoned this series due to the war. See Robert Orledge, \"Satie the Composer\", Cambridge University Press, 1990, pp. 306–308.  As he had renounced playing piano in Paris cabarets – his primary source of income for many years – Satie had only the generosity of friends and occasional private teaching to subsist on.One of his wartime pupils was the wealthy chemist and spare-time composer Albert Verley, whose Pastels sonores Satie arranged for orchestra and for piano 4-hands in 1916. In August 1915 he appealed to composer Paul Dukas to help him get financial assistance from charitable organizations, remarking, \"For me, this war is like a sort of Apocalypse, more idiotic than real.\"Quoted in Orledge, \"Satie the Composer\", p. 65. Some aid must have been forthcoming, for he was soon at work on the pensées.", "Unlike most of his other piano suites of the period, the pensées contain no musical quotations for parodic effect, nor does Satie attempt to pastiche his fellow composers. In each piece bitonal melodic phrases evolve over an unchanging ostinato played from beginning to end: a four-note motif in the Idylle, rapid triplets in the Meditation.Allmusic review by Alexander Carpenter, http://www.allmusic.com/composition/avant-derni%C3%A8res-pens%C3%A9es-next-to-last-thoughts-pieces-3-for-piano-mc0002657941 In the Aubade it takes the form of two arpeggiated chords (the second played twice) that suggest the strumming of a guitar or mandolin.Robert Orledge, liner notes to Eve Egoyan's Satie album \"Hidden Corners\", 2002, http://eveegoyan.com/EveEgoyan/hiddennoteseng.html The conclusions of the outer two movements are quietly punctuated with a single chord; the strumming obstinato has the final say in the Aubade.", "The whimsy of Satie's extramusical commentaries is somewhat subdued here. Each concerns a poet, further described in the Aubade as an \"old\" poet, calling to mind how Satie categorized composers as either \"poets\" or \"pundits.\"Erik Satie, \"Not To Be Confused\", Le Coq, No. 3, July–September 1920. Wilkins, \"The Writings of Erik Satie\", p. 84. Robert Orledge has proposed that the texts for the first two pieces are \"observations\" of the dedicatees.Orledge, \"Satie the Composer\", p. 102. The nature-loving poet of Idylle contemplates a tree-lined creek under sun and moonlight but takes no pleasure in it because, he confesses, \"my heart is very small.\" The morning serenade of Aubade originally bore the subtitle \"A fiancé beneath the balcony of his fiancée\",Orledge, \"Hidden Corners\". and could well allude to Dukas' courtship of Suzanne Pereyra, 18 years his junior, whom he finally married in 1916.Bibliotheque nationale de France database, http://data.bnf.fr/14792048/suzanne_pereyra/ Orledge further writes that the Méditation, despite the dedication to Roussel, is a self-portrait: A poet is locked in a tower, where he is beset by winds that are manifestations of the devil (which he mistakes for the spirit of genius) and indigestion brought on by \"bitter disappointments.\""]}, {"page": "Ludions", "response": ["Fargue first published the Ludions as a series of eight poems in the March 1923 edition of   Monnier's house journal Intentions.See Robert Orledge, Preface to Soundkiosk edition of the Ludions, 2011, p. 8. http://www.soundkiosk.com/pdffiles/Sample%20book%20web%20Vol%203.pdf Satie was then under commission to provide music for Count Étienne de Beaumont's upcoming costume ball, an annual Parisian high society event to which he and Fargue (as leading avant-gardists) were regularly invited, and he happily seized on his friend's idiosyncratic verses to add to the program.", "One of Satie's tasks for the Beaumont fête was to help showcase the newly restored 18th Century pipe organ the Count had installed at his Paris mansion. The two musical numbers he composed for the event - the danced divertissement La statue retrouvée and the Ludions - were to be performed on this instrument. Dismissing fears it would bring a somber note to the festivities, the composer wrote to Countess Edith de Beaumont, \"The organ isn't necessarily religious & funereal...Just remember the gilt-painted merry-go-round.\"Volta, \"Satie Seen Through His Letters\",  p. 161. Satie's notebooks show he originally conceived the accompaniments for piano, from which he then created separate organ arrangements for the private premiere.Robert Orledge, \"Satie the Composer\", Cambridge University Press, 1990, pp. 326-327. The Ludions were completed on May 15, 1923, two weeks before Beaumont's masquerade was due to take place.", "Robert Orledge observed that \"Fargue's poems are as important for their sounds and word-play as they are for their literal meanings.\"Orledge, Soundkiosk, p. 8. Laden with puns, deformed words, obscure allusions and baby talk, they are almost untranslatable.", "The Ludions were first performed as part of the extravagant \"Baroque Ball\" Beaumont held at his home at 2 rue Duroc in Paris on May 30, 1923. Marguerite Jacquemaire (later Countess Marie-Blanche de Polignac) was the soprano soloist, with composer Germaine Tailleferre, the lone female member of Les Six, at the organ. Satie found Jacquemaire's voice \"angelic\"Volta, \"Satie Seen Through His Letters\",  p. 163 and Igor Stravinsky reportedly admired the cycle's \"perfect word-setting.\"Henri Sauget, \"Quelques extraits des souvenirs\", La Revue Musicale, 361-3, 1983, pp. 247-249. Translated by Roger Nichols and reprinted in Robert Orledge, \"Satie Remembered\", Faber and Faber Ltd., 1995, p. 210. For the creators, however, the occasion had already been marred by backstage drama.", "One of Satie's final acts as a professional musician, on his deathbed in a Paris hospital in 1925, was to sign a contract with Jacques Lerolle of Rouart, Lerolle & Cie for the publication of the Ludions. Lerolle urged Fargue to visit the dying composer, to no avail; nor did the poet attend Satie's funeral in July.Volta, \"Satie Seen Through His Letters\",  pp. 164-165. The songs were issued in 1926. Fargue re-published his complete texts as an illustrated booklet in 1930. In later years he wrote of Satie as \"a true master\" and privately remembered him with relish.André Beucler, \"Poet of Paris: Twenty years with Léon-Paul Fargue\", Chatto & Windus, London, 1955, pp. 56-57. Reprinted in Robert Orledge, \"Satie Remembered\", ibid, pp. 128-129.", "In 2011 Robert Orledge published a corrected edition of the Ludions, including the alternative organ part for those interested in replicating the first private performance."]}, {"page": "Choses vues à droite et à gauche (sans lunettes)", "response": ["Choses vues à droite et à gauche (sans lunettes), commonly translated as Things Seen Right-to-Left (Without Glasses), is a suite for violin and piano by Erik Satie. Composed in January 1914 and published in 1916, it is the only work he published for violin-piano duet.In March 1917 Satie planned to write a violin-piano piece, L'embarquement pour Cythère, for violinist Hélène Jourdan-Morhange, but abandoned it after some sketches. These were completed by Robert Orledge and published in 1995 (Salabert). See", "One of Satie's infrequent excursions into chamber music, the Choses vues is contemporaneous with the bulk of his humoristic piano suites (1913-1914) and was conceived in a similar spirit.Robert Orledge observed that the concluding Fantaisie musculaire acquired its title and \"mock-virtuosic concept\" before Satie wrote a note of its final version. See Robert Orledge, \"Satie the Composer\", Cambridge University Press, 1990, p. 100. It has been interpreted as a spoof of academic musical training, in particular that of the Schola Cantorum in Paris,Jane F. Fulcher, \"French Cultural Politics and Music: From the Dreyfus Affair to the First World War\", Oxford University Press, 1998, p. 203. where the composer had recently ended his studies (at age 46) with Vincent d'Indy.", "Humor aside, Satie was painstaking in his efforts to redevelop these old musical forms in modern terms, harmonically and structurally. He rejected the first movement he completed, an untitled 31-bar chorale in G Major, and experimented with several fugue subjects (including a quotation of the folksong Au clair de la lune) for the Fugue à tâtons.Orledge, \"Satie the Composer\", p. 96.Satie would quote Au clair de la lune in his next work, Sports et divertissements (in the piece Le Flirt). See Orledge, \"Satie the Composer\", p. 202. In his analysis of Satie's composing methods Robert Orledge remarked on \"how ordinary his first thoughts often were\",Orledge, \"Satie the Composer\", p. 77. and this certainly applies to the Choses vues. Satie's original order for the pieces - Fantaisie, Choral, Fugue Orledge, \"Satie the Composer\", p. 302. - would have given the suite a conventional fast-slow-fast pattern, with the cadenza appearing in the first movement in the manner of a traditional concerto, and the coda of the Fugue providing a conclusive-sounding finish. In the end Satie chose to scramble this clichéd sequence, and by positioning the Fantaisie as the finale saved most of the suite's musical jokes for last.", "The unused chorale in G Major was discovered by Robert Orledge and first performed by him with violinist Helen Sanderson at the University of Exeter on May 29, 1987.Orledge, \"Satie the Composer\", p. 303. It was published under the title Autre choral in a new performing version of the Choses vues, edited by Orledge in 1995."]}, {"page": "La statue retrouvée", "response": ["In December 1922, Satie was invited by Count Étienne de Beaumont (1883-1956) and his wife Edith (1877-1952) to compose a divertissement for their upcoming annual masquerade ball, a glamorous high society affair. Its theme was \"The Antiquity of Louis XIV\" and the entertainment would consist of a series of musical tableaux vivants performed by select members among the distinguished guests.Robert Orledge, preface to \"Music by Claude Debussy and Erik Satie\", SOUNDkiosk Editions, 2011, at http://www.soundkiosk.com/pdffiles/Sample%20book%20web%20Vol%203.pdf One of Satie's tasks was to help showcase the newly restored 18th Century pipe organ the couple had installed in the gilded music room of their Paris mansion. He had written nothing for the instrument since his (yet unperformed) 1895 Messe des pauvres, but welcomed the challenge.", "The piece acquired additional prestige thanks to Satie's wide connections in the Parisian cultural scene. By April 1923 he had brought in Picasso to create the wardrobe and Massine to regulate the choreography.Robert Orledge, \"Satie the Composer\", Cambridge University Press, 1990, pp. 325-326. Count Beaumont, who dabbled in costume and theatre design, gave Picasso specific instructions, demanding \"women in shades of gold with white wigs and masks...men in shades of brown with golden wigs, and draperies over their formal costumes...needless to say the costumes should be of utmost fantasy made from stuffs of utmost simplicity.\"Quoted in John Richardson, \"A Life of Picasso: The Triumphant Years, 1917-1932\", Alfred A. Knopf, 2010, pp. 226-227. Picasso also offered to paint four large grisaille panels on classical subjects to serve as backdrops for the masquerade. Beaumont enthusiastically agreed, but Picasso's dealer Paul Rosenberg persuaded the artist to drop that idea as too unremunerative for the amount of work involved.Richardson, \"A Life of Picasso\", p. 227. Richardson believes Picasso's large neoclassical grisaille painting The Three Graces (completed by May 1923) was inspired by and possibly intended for the Beaumont commission. Incidentally, a parody of the Three Graces would appear in the Picasso-Satie-Massine ballet Mercure, produced by Beaumont in 1924.", "La statue retrouvée was premiered as the grand finale of the extravagant \"Baroque Ball\" the Beaumonts held at their estate at 2 rue Duroc in Paris on May 30, 1923. Massine and the Beaumonts danced small roles in La statue while composer Germaine Tailleferre, the lone female member of Les Six, performed the organ score.Robert Orledge, \"Appendix: Chronological Catalogue of Satie's Compositions and Research Guide to the Manuscripts\", published in Dr. Caroline Potter (ed.), \"Erik Satie: Music, Art and Literature\", Ashgate Publishing, LTD, 2013, pp. 243-324. The event attracted Le Tout-Paris and was covered in the July and August 1923 issues of French Vogue.Davis, \"Classic Chic: Music, Fashion, and Modernism\", p. 283.", "The fates of Satie's two compositions for the Beaumont fête could hardly have been more different. He arranged for the publication of the Ludions shortly before his death in 1925, and it has long been considered one of his finest works.Pierre-Daniel Templier, \"Erik Satie\", MIT Press, 1969, p. 104. Translated from the original French edition published by Rieder, Paris, 1932. La statue retrouvée was set aside and forgotten. Satie's first biographers Pierre-Daniel Templier (1932) and Rollo H. Myers (1948) made no mention of it, and as nothing under that title was found in his posthumous papers, the music was long thought lost. In the 1980s Robert Orledge discovered the \"Mme Fellowes\" manuscript among the composer's notebooks at the Bibliothèque nationale de France and confirmed it was the missing score for La statue. He first published it in his book Satie the Composer (1990) and edited a performing edition published by Salabert in 1997. Orledge conceded it was \"hardly first-rate Satie.\"Orledge, \"Satie the Composer\", pp. 226-227."]}, {"page": "Messe des pauvres", "response": ["This paradox came to a head in October 1893 when Satie founded his own mock religious sect, the Église Métropolitaine de l'Art de Jésus Conducteur (Metropolitan Church of Art of Jesus the Conductor), with himself as High priest, choirmaster, and sole member. It was a spoof of the flamboyant Péladan, whose Rose + Croix creed (\"the transformation of society through art\") and habit of \"excommunicating\" his critics in bombastic letters to newspapers Satie gleefully adopted.Steven Moore Whiting, \"Satie the Bohemian: From Cabaret to Concert Hall\", Oxford University Press, 1999, pp. 162-163, 170-171. He carried the charade into his daily existence, dressing in monkish robes and referring to his tiny room at 6 Rue Cortot as his abbatiale (abbey). \"[Satie] liked to affect the unctuous manners of a priest,\" his friend Francis Jourdain recalled. \"They suited him so well, he played his part so accurately - being careful not to overdo things - that the question arose as to whether a slightly false air was not innate in him.\"Quoted in Robert Orledge, \"Satie Remembered\", Faber and Faber Ltd., 1995, p. 39.", "Against this background, Satie's motives for writing the Messe des pauvres - the sole composition linked to his church - are obscure. Originally entitled Grande Messe de l'Eglise Métropolitaine d'Art,Robert Orledge, \"Satie the Composer\", Cambridge University Press, 1990, p. 352, note 16. it was his most ambitious work to date, although there was no evident prospect of having it performed.Schwandt, \"A New Gloria for Satie's Messe Des Pauvres\", p. 38. Satie authorities Ornella Volta and Robert Orledge believe he conceived the mass to occupy his mind following his recent breakup with the painter Suzanne Valadon, which had left him emotionally devastated.Ornella Volta, \"Satie Seen Through His Letters\", Marion Boyars Publishers, New York, 1989, p. 48.Orledge, \"Satie the Composer\", p. 211. At the midpoint of their turbulent six-month affair in March 1893, Satie had composed his Danses gothiques as a \"Novena for the great calm and profound tranquility of my Soul\"; similarly, the first mass movement he completed (in late 1893) was the Prière pour le salut de mon âme (\"Prayer for the salvation of my soul\").Orledge, \"Satie the Composer\", p. 279. It is unknown how the mass assumed its final title Messe des pauvres. The texts Satie chose make no reference to the poor at large, giving further weight to speculations that, impoverished as he was, he essentially wrote the mass for his own solace.", "In 1895, a substantial cash gift from a friend enabled Satie to publish a series of tracts in which, under the guise of his church, he criticised those of whom he disapproved. Portions of the Messe des pauvres appeared in two of them: an extract from the Commune qui mundi nefas in a pamphlet of the same name (January 1895), and the complete Dixit Domine - calligraphed in faux Gregorian notation by Satie - in the brochure Intende votis supplicum (March 1895).Facsimiles of both scores appear in Nigel Wilkins (ed.), \"The Writings of Erik Satie\", Eulenburg Books, London, 1980, pp. 38-42. The only contemporary account of the mass is an article by the composer's brother, Conrad Satie, published in the June 1895 issue of Le coeur. He described it as a work in progress, humbly scored for organ and a choir of children's and men's voices. \"This mass is music for the divine sacrifice, and there will be no part for the orchestras which, I'm sorry to say, find their way into most masses,\" he wrote.Conrad Satie, \"Erik Satie\", Le coeur, June 1895, pp. 2-3. Quoted in Robert Orledge, \"Satie Remembered\", Faber and Faber, London, 1995, pp. 49-50. He also made an intriguing statement about its structure: \"Between the Kyrie and the Gloria a prayer is inserted called Prière des orgues.\" The Gloria movement was not found in Satie's posthumous papers and is considered lost.", "The published score presents the mass in seven movements:According to Robert Orledge, Satie listed the opening organ solo (Prelude) as a separate movement, even though it serves to introduce the material of the Kyrie which follows without a break. With the missing Gloria the mass would have had nine movements. See Orledge, \"Satie the Composer\", p. 279.", "Examining the score in the 1980s, Robert Orledge found \"sprawling uncertainties\" in its \"assortment of movements\" and believed the mass was left unfinished.Orledge, \"Satie the Composer\", p. 164 and p. 352, note 16. Sketches of two or three pieces from Satie's notebooks of the period may relate to the work, but whether he planned to expand it or to provide plainsong-like text settings for some of the organ solos must remain speculative.The sketches are titled Spiritus sancte deus miserere nobis, Harmonies de Saint-Jean, and Modéré. See Orledge, \"Satie the Composer\", p. 280.Schwandt, \"A New Gloria for Satie's Messe Des Pauvres\", pp. 39, 44."]}, {"page": "Danses gothiques", "response": ["The title of the Danses gothiques is something of a misnomer. It is in fact one continuous piece of music, a series of interrelated chord sequences unified by a recurring rhythmic figure of two eighth notes and a quarter note.Rovi review at Allmusic http://www.allmusic.com/composition/mc0002358058 These were divided - apparently after the music was composed - into nine parts by what Robert Orledge called \"quasi-religious and self-pitying titles.\"Robert Orledge, \"Satie the Composer\", Cambridge University Press, 1990, pp. 157, 276. The central focus is the Dance No. 5 (For the poor deceased), which in length almost exactly balances No. 1 and employs all but one of the work's motifs. The \"dances\" themselves are meditative rather than dance-like, and are all to be played très lent (\"very slow\"), the characteristic tempo of Satie's \"Rosicrucian\" compositions.", "Curiously, four of the titles (Nos. 4, 7-9) are introduced in mid-motif, obscuring where the parts are supposed to begin and end. Satie, with his interdisciplinary interests, was as much concerned with the look of his scores on the printed page as he was with their musical effect.http://www.gresham.ac.uk/lectures-and-events/erik-satie-part-one-saties-musical-and-personal-logic-and-satie-as-poet. Robert Orledge, \"Satie's Musical and Personal Logic\", transcript of Gresham College lecture delivered April 16, 2010. This led Swedish pianist-musicologist Olof Höjer, who recorded Satie's complete keyboard works in the 1990s, to suggest a theory about the extramusical structure of the Danses gothiques: \"Judging by the appearance of the manuscript, it seems that his main interest was the optical impression that the arrangement of the different parts would make on the score along with the headings. Perhaps this is an early example - maybe even the first - of a musical mise en page, an artistically intended integration of music, notation and text, quite probably inspired by Satie's contact with contemporary poets.\"Olof Höjer, notes to \"Erik Satie\", pp. 18-20.", "The title Concerning Saint Bernard and Saint Lucy (No. 4) touches on Satie's lifelong fascination with eyes and their recurrence as a literary motif in his work.See Robert Orledge, notes to Soundkiosk editions of Satie's music, 2011, p. 19. http://www.soundkiosk.com/pdffiles/Sample%20book%20web%20Vol%203.pdf At first glance the 12th century French abbot who preached the Second Crusade and the 3rd century Sicilian virgin martyr would seem a strange pairing. But Saint Lucy is a patron of the blind, and eyes figure in the iconography of both. Saint Lucy was often depicted bearing her eyes on a platter, having (according to one tradition) gouged them out herself to ward off a persistent suitor.In his \"Christian ballet\" Uspud (1892) Satie presented a Saint Micanar (?) also carrying his eyes on a platter. And in a variant of Saint Bernard's \"Lactation Miracle\" he was healed of an ailment that threatened his sight by praying to an image of the Nursing Madonna. The icon came to life and squirted her breast milk into his eyes.Patrick J. Hayes, \"Miracles: An Encyclopedia of People, Places, and Supernatural Events from Antiquity to the Present\", ABC-CLIO, 2016, p. 78. "]}, {"page": "Bonjour Biqui, Bonjour!", "response": ["Satie composed this musical curio on April 2, 1893, as part of an Easter Sunday gift for Valadon, whom he affectionately nicknamed \"Biqui\".Robert Orledge, \"Understanding Satie's 'Vexations'\", Archives de la Fondation Erik Satie, Paris, 2000. Also includes score and facsimile of original manuscript. Retrieved from Niclas Fogwall's defunct \"Satie Homepage\" (1996-2014) via Internet Archive Wayback Machine at https://web.archive.org/web/20041023204150/http://www.af.lu.se/~fogwall/articl11.html. On a single sheet of music paper, and alternating the use of regular and watered-down ink, he concocted a rather jarring little ditty with just three chords and five notes in the vocal line.Robert Orledge, \"Erik Satie's ballet uspud: Prime Numbers and the Creation of a New Language with Only Half the Alphabet\", The Musical Times, Vol. 150, No. 1908 (Autumn, 2009), pp. 31-41. Available at http://www.soundkiosk.com/pdffiles/Erik%20Satie%20prime%20numbers%2013%20letters%20Robert%20Orledge%202008.pdf. The song does not have an actual title. Its pride of place at the top of the score is instead taken by the playing direction très lent (\"very slow\"), and the greeting \"Bonjour Biqui, Bonjour!\" constitutes the entire \"lyrics.\"", "Robert Orledge found stylistic links between the song and two other Satie compositions which place all three within the context of the Satie-Valadon affair. Bonjour Biqui and the piano piece Vexations are constructed entirely from \"ambiguous diminished chords\" first found in the Danses gothiques, which Satie completed on March 23, 1893 in an attempt to regain his composure in the midst of his stormy romance;Ornella Volta, \"Satie Seen Through His Letters\", Marion Boyars Publishers, New York, 1989, p. 48. and the Vexations begins with the same chord with which Bonjour Biqui ends, almost as if one was meant to be an extension of the other. For Orledge these chords were undoubtedly associated with Valadon. \"Thus, Bonjour Biqui, Bonjour! is far from being the home-made musical 'Happy Easter' card that it might seem at first glance, and it might well reveal the same anguish over unreciprocated affection that found a more extensive and private expression in Vexations,\" he wrote.Orledge, \"Understanding Satie's 'Vexations'\". These observations also provide a plausible time frame (April–June, 1893) for the undated Vexations.Robert Orledge, \"Satie the Composer\", Cambridge University Press, 1990 p. 144."]}, {"page": "Allegro (Satie)", "response": ["In 1884 Satie was still struggling through his unhappy studies (1879-1886) at the Paris Conservatoire, which he later described as a \"penitentiary\".Pierre-Daniel Templier, \"Erik Satie\", MIT Press, 1969, pp. 7-8. Translated from the original French edition published by Rieder, Paris, 1932. Significantly, he produced the Allegro - his first surviving attempt at composing - not as a student exercise but on his own, during a summer holiday visit to his native Honfleur in Normandy. It was the only music he would ever compose in his hometown.Robert Orledge, \"Satie the Composer\", Cambridge University Press, 1990, p. 11. With the exception of the Allegro, all Satie's works were written in Paris or in the Parisian  suburb of Arcueil, Satie's home from 1898 until his death.", "The existence of the Allegro was unknown for nearly a century before it was discovered amongst Satie's papers at the Bibliothèque nationale de France. Facsimiles of the manuscript were first published by Alan M. Gillmor (1972)Alan M. Gillmor, \"Erik Satie and the Concept of the Avant-Garde\", Ph.D thesis for the University of Toronto, 1972. Cited by Orledge, \"Satie the Composer\", p. 372.  and Nigel Wilkins (1980).Nigel Wilkins (ed.), \"The Writings of Erik Satie\", Eulenburg Books, London, 1980, p. 19. Three performance versions, edited by Robert Orledge, were issued by Salabert between 1995 and 1998.http://www.worldcat.org/title/allegro-pour-piano-1884-oeuvre-posthume/oclc/658865476/editions?referer=di&editionsView=true The Allegro was given its concert premiere by pianist Giancarlo Carlini at the Teatro di Porta Romana in Milan, Italy, on April 12, 1980.Orledge, \"Satie the Composer\", p. 268. It was first recorded by Jean-Pierre Armengaud for the Le Chant Du Monde label in 1986."]}, {"page": "Pièces froides", "response": ["The title Pièces froides—which can also be translated as Cold Rooms or Cold Cuts Daniel Albright, \"Modernism and Music: An Anthology of Sources\", University of Chicago Press, 2004, p. 323.—has been viewed as a punning allusion to the dire poverty Satie experienced during his last years living in Montmartre.Steven Moore Whiting, \"Satie the Bohemian\", Clarendon Press, 1999, p. 181. In July 1896, he had been forced to move from his room at 6 Rue Cortot into an unheated ground floor closet (he called it a \"cupboard\")\"Placard\" in French. in the same building, which the landlord offered him for 20 francs per quarter.Pierre-Daniel Templier, \"Erik Satie\", MIT Press, 1969, p. 20. Translated from the original French edition published by Rieder, Paris, 1932.Mary E. Davis, \"Erik Satie\", Reaktion Books, 2007, p. 60. The space was so small that Satie's camp bed all but blocked the door shut, and on frigid nights he kept warm by sleeping fully dressed with the rest of his clothing piled on top of him.J. P. Contamine de Latour, \"Erik Satie intime: souvenirs de jeunesse\", Comoedia, 3, 5, 6 August 1925. Reprinted in Robert Orledge, \"Satie Remembered\", Faber and Faber Ltd., 1995, p. 28. These conditions were hardly conducive to composing, but one prospect gave him hope over the bitter 1896–97 winter.", "Having observed how Debussy arranged his music, Satie attempted to orchestrate two numbers from this set—the first of the Airs à faire fuir and the second of the Danses de travers—for the SNM. On March 22, he joked to his friend Louis Lemonnier, \"I am going to play you these symphonic pieces on the tormented slide-trombone and make you block up your ears.\"Robert Orledge, \"Satie the Composer\", Cambridge University Press, 1990, pp. 109. But after 19 trials, he got no further than nine bars and abandoned the project.Orledge, \"Satie the Composer\", p. 110. In the end, the Société remained uninterested in his work, and Satie lapsed into another creative silence that lasted until after his move to the distant Parisian suburb of Arcueil in October 1898.According to a 1916 lecture by Alexis Roland-Manuel, Satie wrote his famous cabaret song Je te veux in 1897. Robert Orledge supports this date, even though Satie did not register the music with SACEM until November 1902 and it was not performed or published until the following year. See Orledge, \"Satie the Composer\", p. 281.", "The first two pieces, which were completed by April 22,Whiting, \"Satie the Bohemian\", p. 345. are contrapuntal settings of the same popular-sounding melody that also show Satie – perhaps with tongue-in-cheek – experimenting with the harmonic styles of Debussy and Gabriel Faure.\"Orledge, \"Satie the Composer\", pp. 169–172. He showed them to an acquaintance of long standing, the younger composer Florent Schmitt; the feedback he received may not have been entirely positive, for he then wrote the concluding Sur un pont in a more austere, personal manner. Robert Orledge opined that the Nouvelles pièces froides were an inconclusive offshoot of Satie's Schola studies and that he was \"wise not to publish them during his lifetime.\"Orledge, \"Satie the Composer\", pp. 169–172."]}, {"page": "En habit de cheval", "response": ["En habit de cheval (In Riding Gear) is a 1911 suite for piano duet by Erik Satie. He arranged it for orchestra that same year. It is a transitional work, composed towards the end of Satie's studies at the Schola Cantorum in Paris (1905-1912) and foreshadowing his pre-World War I \"humoristic\" or \"fantaisiste\" period.Alexander Carpenter, Allmusic review at http://www.allmusic.com/composition/en-habit-de-cheval-in-riding-habit-4-pieces-for-piano-duet-or-orchestra-mc0002358594. Robert Orledge wrote that \"En habit de cheval offers the best example of Satie integrating Schola teaching with his own composition, and in it he also worked out his own individual concept of orchestration.\"Robert Orledge, \"Satie the Composer\", Cambridge University Press, 1990, p. 95. In performance it lasts about 7 minutes.", "Satie's skills as an orchestrator have long been a subject of debate.Orledge, \"Satie the Composer\", pp. 105-106.Ornella Volta (editor), \"Satie Seen Through His Letters\", Marion Boyars Publishers, London, 1989, p. 105.Harrison Birtwistle, introductory note to his reorchestration of Satie's ballet Mercure, Universal Edition, 1980, at http://www.universaledition.com/Erik-Satie/composers-and-works/composer/629/work/3620/work_introduction. Among his defenders, Robert Orledge has challenged the notion that in his pared-down handling of the medium Satie was simply \"making a virtue of his technical limitations\":"]}, {"page": "Descriptions automatiques", "response": ["This sardonic blurb shows how Satie often invented the curious titles and texts of his compositions before the music was written,Robert Orledge, \"Satie the Composer\", Cambridge University Press, 1990, p. 307. though these were subject to change depending on where his inspiration took him. The Descriptions automatiques had already gone through two working titles (Descriptions hypocrites and Vocations électriques) before the April 5 announcement,Orledge, \"Satie the Composer\", p. 298. while the music would not be composed until April 21–26, 1913. Satie's sketches also show how the first piece (Sur un vaisseau) initially described a wolf and a tuna fish before evolving into a description of a ship.Olof Höjer, notes to Erik Satie: Complete Piano Music, Vol. 5, Swedish Society Discofil, 1996, p. 13.", "Satie would borrow from popular sources for comic effect in a number of his compositions, though never more extensively than in the years 1913-1914, the most prolific of his career. Robert Orledge listed the practical reasons for this: \"First, they helped him to sustain the unaccustomed bout of creativity that followed the sudden demand for novel groups of piano pieces from his publisher Demets. Second, they gave these humorous piano pieces greater popular appeal. Third, guessing their sources provided a sort of musical quiz that helped sustain public interest after their initial vogue had faded: the way Satie succeeded in this respect can be seen from the number of editions these pieces enjoyed in subsequent years. Lastly, popular sources helped Satie rediscover his path forward by taking some of the responsibility for inventing original material from his shoulders.\"Orledge, \"Satie the Composer\", p. 204.", "A nocturne in all but designation, this little night piece is built on the refrain of the French revolutionary song La Carmagnole (\"Let's dance the Carmagnole\"), which is transposed and fragmented over a tiptoeing pianissimo two-chord rhythm. Satie actually derived his title from another revolutionary tune, Ça Ira,Robert Orledge, \"Satie the Composer\", Cambridge University Press, 1990, p. 202. with its call to hang the ruling classes from the street lamps (\"Les aristocrats à la lanterne!\"); it was frequently sung in conjunction with La Carmagnole during the Reign of Terror.Belva Jean Hare, \"The Uses and Aesthetics of Musical Borrowing in Erik Satie’s Humoristic Piano Suites, 1913-1917\", University of Texas at Austin, December 2005, p. 113, at https://www.lib.utexas.edu/etd/d/2005/hareb78915/hareb78915.pdf The violence implied by these sources is barely hinted at in the music (to be played nocturnement),  or in the extramusical texts for the pianist which suggest a child speaking to a lamplighter going about his duties.Steven Moore Whiting, \"Satie the Bohemian: From Cabaret to Concert Hall\", Clarendon Press, 1999, pp. 364-365.  Biographer Pierre-Daniel Templier found in Sur une lanterne \"a new form of mysticism in Satie - a kind of elusive mystery, subtly evoked in a musical atmosphere which is partly poetic, partly amused, but very moving.\"Pierre-Daniel Templier, \"Erik Satie\", MIT Press, 1969, pp. 82-83. Translated from the original French edition published by Rieder, Paris, 1932."]}, {"page": "Sports et divertissements", "response": ["There is no record that Satie had contact with Charles Martin or access to his illustrations while composing the suite.Helen Julia Minors, \"Exploring Interart Dialogue in Erik Satie's Sports et divertissements (1914/1922)\", published as Chapter 6 in Dr. Caroline Potter (ed.), \"Erik Satie: Music, Art and Literature\", Ashgate Publishing, Ltd., 2013. Musicologists Robert Orledge and Steven Moore Whiting believe Satie directly musicalized at least one of the pictures, Le Golf (the last piece he composed);Robert Orledge, \"Satie the Composer\", Cambridge University Press, 1990, p. 214. otherwise, according to Whiting, \"one finds a wide range of relationships between music-cum-story and drawing, from the close correspondence in Le Golf to outright contradiction, with varying degrees of reinterpretation in between.\"Whiting, \"Satie the Bohemian\", p. 403. If Satie knew of the images beforehand he evidently did not feel obligated to use them as the basis for his work, and filtered the different sporting themes through his own imagination instead. Thus, again from Whiting,  \"While the relation of Satie's music to his own texts is quite close, the relation of music to drawing is more elusive.\"Whiting, \"Satie the Bohemian\", p. 402.", "As noted on the individual scores, the pieces were completed from March 14 (La Pêche) to May 20 (Le Golf), 1914. Satie delivered them to Vogel in groups of three as the work progressed, drawing part of his fee (150 francs per piece) each time. The Préface and introductory chorale may have been tossed in gratis, as they were not part of the original project.Ornella Volta, \"Give a Dog a Bone: Some investigations into Erik Satie.\" Originally published as \"Le rideau se leve sur un os\" in the Revue International de la Musique Francaise, Vol. 8, No. 23, 1987. English translation by Todd Niquette. Retrieved from Niclas Fogwall's defunct Satie Homepage (1996-2014) through the Internet Archive Wayback Machine at https://web.archive.org/web/20041014172728/http://www.af.lu.se/~fogwall/articl10.html#sports07r. Satie would insist on installment payments for all his later big commissions. Conscious of his spendthrift nature when he had money, he used this method to cover his immediate living expenses and save himself from the temptation of squandering his entire fee at once, which had happened in the past.Ornella Volta (ed.), \"Satie Seen Through His Letters\", Marion Boyars Publishers, London, 1989, pp. 75, 169-170.Satie evidently never kept a bank account. Author Blaise Cendrars recalled a 1924 experience helping the composer cash a large check in Paris and then trying to get him safely home with the money, while Satie insisted on stopping for meals, drinks, and to stock up on cigars and his favorite detachable collars (of which he bought a gross). Blaise Cendrars, interview on French Radio, July 3, 1950. Reprinted in Robert Orledge, \"Satie Remembered\", Faber and Faber Limited, 1995, pp. 132-134. Also see Henri Sauguet's reminiscences in the same book, p. 210.", "Dance-like. A pleasant outing - to which \"Everyone has brought very cold veal\" - gets rained out by a storm. The music opens with a folk-like dance that segues into a veiled allusion to Claude Debussy's cakewalk Le petit Nègre (1909).Robert Orledge, \"Satie & Les Six\". Published as Chapter 6 in Richard Langham Smith, Caroline Potter (editors), \"French Music Since Berlioz\", Ashgate Publishing, Ltd., 2006, pp. 223-248, info cited on pp. 227-228. After a recapitulation of the folk dance the piece ends abruptly with suggestions of thunder, which the picnickers initially mistake for the sound of an airplane.", "The order of the pieces from the original edition onwards was chosen by Vogel and does not reflect Satie's preferences. The composer had a specific musical sequence in mind in 1914, which upon further reflection he changed for the 1922 public premiere.Satie's 1914 notebooks reveal he originally wanted the pieces played in this order: 1, 8, 18, 17, 10, 5, 11, 7, 12, 21, 15, 13, 9, 3, 2, 16, 6, 14, 4, 20, 19. The numbers refer to the sequence chosen by Vogel, published in all editions and cited in this article. See Orledge, \"Satie the Composer\", p. 304.The sequence Marcelle Meyer played at the premiere was 1, 9, 16, 12, 6, 11, 19, 10, 21, 17, 5, 8, 18, 3, 13, 14, 15, 7, 20, 2, 4. See Orledge, \"Satie the Composer\", p. 304. While he eschewed standard compositional development and structure, Satie was highly aware of the formal \"architecture\" of his music and sequenced his multi-movement works with great care.Whiting, \"Satie the Bohemian\", p. 475. Robert Orledge, for one, believes that either of Satie's versions are musically preferable to the one selected by his publisher and ubiquitously performed ever since.Orledge, \"Satie the Composer\", p. 304.", "For over 80 years most of Martin's 1914 illustrations were known only to a handful of private collectors and interested scholars. Ornella Volta published two (Le Water-chute and Le Pique-nique) in a 1987 article,Volta, \"Give a Dog a Bone\", cited above. and Le Golf appeared in Robert Orledge's book Satie the Composer (1990).Orledge, \"Satie the Composer\", p. 214. An almost complete set (minus Le Traîneau) was presented in Volta's edition of Satie's literary writings, A Mammal's Notebook (1996), making the bulk of Martin's original work available for the first time.Volta, \"A Mammal's Notebook: The Writings of Erik Satie\", Atlas Publishing, London, 1996 (reissued 2014), pp. 29-45."]}, {"page": "Sarabandes (Satie)", "response": ["The Sarabandes emerged at a point in Satie's life when he was beginning to assert his independence as a man and artist. In November 1886, the 20-year-old composer dropped out of the Paris Conservatoire and enlisted in the French army. His close friend and collaborator at the time, the poet Contamine de Latour, claimed Satie had persisted with his hated Conservatory courses only so he could qualify for a student exemption that would reduce his five years' compulsory military service to one year in the reserves.Robert Orledge, \"Satie Remembered\", Faber and Faber, London, 1995, p. 17.Frank Northen Magill, \"Dictionary of World Biography: The 20th century, O-Z\", Routledge, 1999, p. 3331. Satie was duly assigned as a reservist to the 33rd Infantry Regiment at the Citadel in Arras,Myers, \"Erik Satie\", Dover Publications, Inc., NY, 1968, p. 18. nicknamed La belle inutile (\"The Useless Beauty\") for its fine architecture and lack of strategic importance.Arras France Tourism Guide: The Citadel of Arras But even this comparatively mild duty proved too onerous for his liking. He sought to make himself ill by sneaking out of his barracks at night and strolling about bare-chested in the winter air, with the result that he came down with a severe case of bronchitis.Ornella Volta (ed.), \"Satie Seen Through His Letters\", Marion Boyars Publishers, London, 1989, pp. 22-23. By April 1887 he was back at his family's home in Paris on a two-month medical leave.Robert Orledge, \"Satie Remembered\", Faber and Faber Limited, 1995, p. xxiii.", "Biographer Mary E. Davis wrote that \"the Sarabandes introduce compositional approaches that would prove important not only in Satie's later work but also in the broader history of French music...they presented a new conception of large-scale form, in which groups of three very similar pieces, deliberately interlinked by means of motivic cells, harmonic events and recurring interval patterns, combine to constitute a unified work.\"Mary E. Davis, \"Erik Satie\", Reaktion Books, 2007, pp. 25-27. Satie called this tripartite structure he invented \"an absolutely original form\" that was \"good in itself,\"Robert Orledge, Satie's Musical and Personal Logic, transcript of lecture at Gresham College, April 16, 2010 a means of exploring a central musical idea from three different perspectives without resorting to traditional variation techniques. In place of continuous development we are given mosaic-like progressions of unresolved dissonances, shifting between movement and stasis, which imbue the stately dignity of the sarabande with a suspended, timeless quality.Joseph Smith, notes to \"Erik Satie's First Sarabande\", 2012, at ", "The possible influence of Chabrier on Satie's advanced harmonic language of the 1880s has long been noted, by Maurice Ravel in the 1920sMaurice Ravel, \"Contemporary Music,\" Rice Institute Pamphlet, Rice University Studies, 15, no. 2 (1928). Transcript of lecture Ravel gave at the Rice Institute (now Rice University), Houston, Texas, April 7, 1928. and biographer Rollo H. Myers (1948)Myers, \"Erik Satie\", p. 68. up to the present, focusing on the similarities of the unresolved ninths in the Sarabandes and those found in the Prelude of Le roi malgré lui.Templier, \"Erik Satie\", p. 76. Yet there are signs Satie was already feeling his way towards a harmonic \"no-man's land\" in the unconventional ninths and even thirteenths that appear in his 3 mélodies (to poems by Latour) of 1886,Robert Orledge, \"Satie the Composer\", Cambridge University Press, 1990, p. 34.Olof Höjer's notes to \"Erik Satie: The Complete Piano Music, Vol. 1\", pp. 15-17, Swedish Society Discofil, 1996. and his tonal approach in the Sarabandes is radically different. Chabrier's dissonances in Le roi malgré lui enrich the musical color but function within a traditional dramatic framework; Satie's dissonances become musical events in themselves. Or as pianist-author Joseph Smith put it, \"For Chabrier, the A.1. Sauce; for Satie, the steak.\"Smith, notes to \"Erik Satie's First Sarabande\". See Note 18. Robert Orledge proposed that Chabrier's real impact lay in \"proving to Satie that the Wagnerian path was the wrong one for a composer of wit and originality to follow.\"Orledge, \"Satie the Composer\", p. 36. ", "Sarabandes. He did not keep them a secret from his intimates, however. They were the probable model for his friend Claude Debussy's Sarabande, composed in 1894 and revised before its inclusion in the set Pour le piano (1901).Francis Poulenc, \"Erik Satie's Piano Music\", La Revue Musicale, No. 214, June 1952, pp. 23-26. Reprinted in Nicolas Southon, \"Francis Poulenc: Articles and Interviews: Notes from the Heart\", Ashgate Publishing, Ltd., 2014.Orledge, \"Satie the Composer\", p. 40.Davis, \"Erik Satie\", p. 36. In an article on his brother's music for the June 1895 issue of the esoteric religious journal Le coeur, Conrad Satie referred to the unpublished Sarabandes as the \"works of a mystic pagan, and which give a foretaste of the Catholic who was to write the Danses gothiques.\"Conrad Satie, \"Erik Satie\", Le coeur, June 1895, pp. 2-3. Quoted in Robert Orledge, \"Satie Remembered\", Faber and Faber, London, 1995, pp. 49-50. Maurice Ravel, who first met Satie in 1893, knew of the pieces and spoke highly of them to members of his circle. In 1905 Ravel introduced critic Michel-Dimitri Calvocoressi to Satie, who showed him the manuscript of the Sarabandes. Calvocoressi later declared, \"I promptly saw the truth in Ravel's assertion that Satie's music contained the germ of many things in the modern developments of music.\"Michel-Dimitri Calvocoressi, \"Erik Satie. A few recollections and remarks\", The Monthly Musical Record, 55, January 1, 1925, pp. 6-7. Quoted in Orledge, \"Satie Remembered\", pp. 148-149."]}]}}