{"wiki_id": "http://www.wikidata.org/entity/Q3446124", "itemLabel": "John Cary", "itemDescription": "English cartographer and engraver", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Cary", "wikipedia_page": {"main": "John Cary (c. 1754 – 1835) was an English cartographer.\n\n", "link_mentions": [{"page": "Europe", "response": ["The mapmakers continued to differ on the boundary between the lower Don and Samara well into the 19th century. The 1745 atlas published by the Russian Academy of Sciences has the boundary follow the Don beyond Kalach as far as Serafimovich before cutting north towards Arkhangelsk, while other 18th- to 19th-century mapmakers such as John Cary followed Strahlenberg's prescription. To the south, the Kuma–Manych Depression was identified circa 1773 by a German naturalist, Peter Simon Pallas, as a valley that once connected the Black Sea and the Caspian Sea,Peter Simon Pallas, Journey through various provinces of the Russian Empire, vol. 3 (1773) and subsequently was proposed as a natural boundary between continents."]}, {"page": "Charing Cross", "response": ["Road distances from London continue to be measured from Charing Cross. Prior to its selection as a commonly agreed central datum point, various points were used for this purpose. John Ogilby's Britannia of 1675, of which editions and derivations continued to be published throughout the 18th century, used the \"Standard\" (a former conduit head) in Cornhill; while John Cary's New Itinerary of 1798 used the General Post Office in Lombard Street. The milestones on the principal turnpike roads were generally measured from the terminus of the individual road, mostly on the perimeter of the metropolitan area: these points included Hyde Park Corner, Whitechapel Church, the southern end of London Bridge, the southern end of Westminster Bridge, Shoreditch Church, Tyburn Turnpike, Holborn Bars, St Giles's Pound, Hicks Hall (the terminus of the Great North Road), and the Stones' End in The Borough. Some roads into Surrey and Sussex were measured from St Mary-le-Bow church. Some of these structures had been moved or destroyed, but their former locations continued to be used for distances. The result was that \"all the Books of Roads ... published, differ in the Situation of Mile Stones, and instead of being a Guide to the Traveller, serve only to confound him\"."]}, {"page": "William Smith (geologist)", "response": ["In 1801, he drew a rough sketch of what would become the first geological map of most of Great Britain. Smith travelled extensively across Great Britain working as a mineral surveyor allowing him to meet prominent people such as Thomas Coke, 1st Earl of Leicester, and the Duke of Bedford. In 1815 he published this geological map, based on a John Cary map. It covered the whole of England and Wales, and parts of Scotland. While this was not the world's first geological map (a map of the United States by William Maclure was published six years earlier),1911 Encyclopædia BritannicaGreene, J.C.  and Burke, J.G. (1978) “The Science of Minerals in the Age of Jefferson”. Transactions of the American Philosophical Society, New Series, Vol. 68, No. 4, pp. 1–113 [39] Smith's was the first geological map covering such a large area in detail, and is one of the first stratigraphical analyses to utilize paleontological indices. Conventional symbols were used to mark canals, tunnels, tramways and roads, collieries, lead, copper and tin mines, together with salt and alum works. The various geological types were indicated by different colours, applied by hand. Nevertheless, the map is remarkably similar to modern geological maps of England. It also included a 'Sketch of the succession of STRATA and their relative Altitudes'. This geological cross-section was not a new technique in itself, but its appearance on a map, with the clear intention of illustrating the relationship between relief and rocks and their structure, was novel. He published his Delineation of the Strata of England in the same year. In another of his books Strata Identified by Organized Fossils (London 1816–1819) he recognised that strata contained distinct fossil assemblages which could be used to match rocks across regions (Smith's laws). In 1817 he drew a remarkable geological section from Snowdon to London, a development of the ‘sketch’ on his map, illustrating the three-dimensional relationship between geology and landscape via a perspective sketch of the landscape showing the topography. Effectively this was the first block diagram, now routinely used in geography textbooks and animations."]}, {"page": "West Florida", "response": ["*Map of West Florida, 1806, by John Cary"]}, {"page": "Limehouse Cut", "response": ["John Cary's New and Accurate Plan of London of 1795 shows that, by that date, a portion of the canal, near its outlet at Limehouse, had been expanded to form a large basin, with an island in the middle marked \"Timber Yd\", accessible by a causeway. This was the first basin in Limehouse, built 25 years before the better known Regent's Canal dock which now bears that name.", "| \"River Lea\" (even where entering Thames at Limehouse)||John Cary's New and Accurate Plan of London and WestminsterCary's New And Accurate Plan Of London And Westminster 1795: Limehouse & Redriff || 1795 "]}, {"page": "Longnor, Staffordshire", "response": ["The 1787 Cary map of Staffordshire shows the village on a major crossroads.John Cary's 1787 New and Correct English Atlas  Cary wrote the name LONGNOR rather than Longnor, a style shared only with Leek and Cheadle in Staffordshire north of Stafford and The Potteries.  This implies that Longnor was then a market town of some significance."]}, {"page": "Kyiv", "response": ["In English, Kiev appeared in print as early as 1804 in John Cary's \"New map of Europe, from the latest authorities\", and in Mary Holderness's 1823 travelogue New Russia: Journey from Riga to the Crimea by way of Kiev. The Oxford English Dictionary included Kiev in a quotation published by 1883, and Kyiv in 2018."]}, {"page": "John Pinkerton", "response": ["Pinkerton was a celebrated master of the Edinburgh school of cartography which lasted from roughly 1800 to 1830. Pinkerton, along with John Thomson & Co. and John Cary, redefined cartography by exchanging the elaborate cartouches and fantastical beasts used in the 18th century for more accurate detail. Pinkerton's main work was the \"Pinkerton's Modern Atlas\" published from 1808 through 1815 with an American version by Dobson & Co. in 1818. Pinkerton maps are today greatly valued for their quality, size, colouration, and detail."]}, {"page": "Denmark Hill", "response": ["In John Cary's map of 1786 the area is shown as Dulwich Hill. The only building apparent is the \"Fox under the Hill\". The present \"Fox on the Hill\" pub is a hundred yards or so further up (south), on the site of former St Matthew's Vicarage adjacent to a triangle of land rumoured to be a \"plague pit\" or burial ground. The name of the area was changed in honour of the husband of Queen Anne, Prince George of Denmark."]}, {"page": "Aaron Arrowsmith", "response": ["He moved to Soho Square, London from Winston, County Durham when about twenty years of age, and was employed by John Cary, the engraver and William Faden.  He became Hydrographer to the Prince of Wales  and subsequently to the King in 1820.  In January 1790 he made himself famous by his large chart of the world on Mercator projection. Four years later he published another large map of the world on the globular projection, with a companion volume of explanation. "]}, {"page": "Republic of West Florida", "response": ["* Map of West Florida, 1806, by John Cary"]}, {"page": "The Map that Changed the World", "response": ["Related topics, such as the founding of the Geological Society of London, are included. Smith's map was published by John Cary, a leading map publisher. Winchester describes the practice of publishing at the time as well as the system of debtor's prisons through his account of the sojourn of Smith in the King's Bench Prison."]}, {"page": "Mapman", "response": ["* John Cary's \"Inland Navigation\" (1796)"]}, {"page": "Whitechapel Road", "response": ["The road has been an important thoroughfare and coaching route for centuries. Whitechapel High Street and Whitechapel Road are named as such on John Rocque's Map of London, 1746, both marked as \"White Chapel\". On John Cary's \"Environs of London\" of 1795 (published in his New Itinerary of 1798) there are properties on both sides of the road. By the ninth edition in 1821, the road is shown as extensively built up. In the mid-19th century, drovers steered livestock from local farms along the road towards Smithfield Market, causing considerable traffic congestion. By the 1870s, the road had become extensively developed with properties along the entire stretch of the road."]}, {"page": "Boundaries between the continents of Earth", "response": ["Philip Johan von Strahlenberg in 1725 was the first to depart from the classical Don boundary by drawing the line along the Volga, following the Volga north until the Samara Bend, along Obshchy Syrt (the drainage divide between the Ural and Volga rivers) and then north along the Ural Mountains. The mapmakers continued to differ on the boundary between the lower Don and Samara well into the 19th century. The 1745 atlas published by the Russian Academy of Sciences has the boundary follow the Don beyond Kalach as far as Serafimovich before cutting north towards Arkhangelsk, while other 18th- to 19th-century mapmakers such as John Cary followed Strahlenberg's prescription. To the south, the Kuma–Manych Depression was identified circa 1773 by a German naturalist, Peter Simon Pallas, as a valley that, once upon a time, connected the Black Sea and the Caspian Sea,Peter Simon Pallas, Journey through various provinces of the Russian Empire, vol. 3 (1773) and subsequently was proposed as a natural boundary between continents.", "|1806 map of Asia by John Cary, boundary along the Don and then the Volga until Samara, and north of Perm following the Urals, placing Novaya Zemlya in Asia."]}, {"page": "Brampton, Eden", "response": ["Brampton is spelt in Christopher Saxton’s 1579 map of Westmorland and Cumberland as 'Branton'. The same name is mentioned again in Schenk and Valck’s 1670 map. In John Cary’s map of 1794 'Bramton' is marked, however the first cartographic mention of the village's current name comes from an 1831 map of the area."]}, {"page": "Old Hunstanton Lighthouse", "response": ["By 1750 the front lighthouse, the smaller of the two, seems to have been taken out of commission. It seems that the structure remained standing for a time: but while two lighthouses are shown on John Cary's county map of 1787,Image: Antique county map of NORFOLK by JOHN CARY 1787 there is only one on his map of 1794.Sheets 44-45. (Cary's England, Wales, and Scotland). "]}, {"page": "Mountains of Kong", "response": ["300px|right|thumb|A map of Africa, made by John Cary in 1805, showing the Mountains of Kong extending eastwards to the Mountains of the Moon.", "The German map maker Johann Reinecke included the mountains in his map of 1804 as the Geburg Kong. In 1805 the London engraver John Cary showed them for the first time linking to the Mountains of the Moon."]}, {"page": "Little Thetford", "response": ["A half-mile () section of the Roman road Akeman Street is shown on the 1903 Ordnance Survey map, three-quarters of a mile () due west of the village. This straight north-north-east section originates in Stretham and heads towards Ely. John Cary, the 18th-century cartographer, documents a coach route from London to King's Lynn passing by the village in his Cary's New Itinerary Road vehicle access to the village is now from the A10 road at Thetford Corner. Stagecoach operate the X9 bus service, Cambridge to March via Ely. This service stops near The Wyches, Thetford Corner. The village is a cul-de-sac to road vehicles, with no possible passage except in and out. It is a five-minute walk to the River Great Ouse from the eastern end of Holt Fen."]}, {"page": "Turnpike trusts in Greater Manchester", "response": ["Image:Cary map lancashire 1814.jpg|An 1814 map of Lancashire by John Cary which shows many of the turnpike roads."]}]}}