{"wiki_id": "http://www.wikidata.org/entity/Q345814", "itemLabel": "Augustus Matthiessen", "itemDescription": "British scientist", "wikipedia_url": "https://en.wikipedia.org/wiki/Augustus_Matthiessen", "wikipedia_page": {"main": "Augustus Matthiessen, FRS (2 January 1831, in London – 6 October 1870, in London), the son of a merchant, was a British chemist and physicist who obtained his PhD in Germany at the University of Gießen in 1852 with Johann Heinrich Buff. He then worked with Robert Bunsen at the University of Heidelberg from 1853 to 1856. His work in this period included the isolation of calcium and strontium in their pure states. He then returned to London and studied with August Wilhelm von Hofmann from 1857 at the Royal College of Chemistry, and set up his own research laboratory at 1 Torrington Place, Russell Square, London. He was elected a Fellow of the Royal Society (FRS) in 1861. He worked as a lecturer on chemistry at St Mary's Hospital, London, from 1862 to 1868, and then at St Bartholomew's Hospital, London, from 1868. His research was chiefly on the constitution of alloys and opium alkaloids. He contributed to both physics and chemistry. (Please see references below.) For his work on metals and alloys, he was awarded the Royal Society's Royal Medal in 1869.\nMatthiessen committed suicide in 1870 under \"severe nervous strain\".\n\n", "link_mentions": [{"page": "Barium", "response": ["Carl Scheele determined that baryte contained a new element in 1774, but could not isolate barium, only barium oxide. Johan Gottlieb Gahn also isolated barium oxide two years later in similar studies. Oxidized barium was at first called \"barote\" by Guyton de Morveau, a name that was changed by Antoine Lavoisier to baryta. Also in the 18th century, English mineralogist William Withering noted a heavy mineral in the lead mines of Cumberland, now known to be witherite. Barium was first isolated by electrolysis of molten barium salts in 1808 by Sir Humphry Davy in England.Davy, H. (1808) \"Electro-chemical researches on the decomposition of the earths; with observations on the metals obtained from the alkaline earths, and on the amalgam procured from ammonia,\" Philosophical Transactions of the Royal Society of London, vol. 98, pp. 333–370. Davy, by analogy with calcium, named \"barium\" after baryta, with the \"-ium\" ending signifying a metallic element. Robert Bunsen and Augustus Matthiessen obtained pure barium by electrolysis of a molten mixture of barium chloride and ammonium chloride."]}, {"page": "Lithium", "response": ["* Arwedson, Aug. (1818) \"Untersuchung einiger bei der Eisen-Grube von Utö vorkommenden Fossilien und von einem darin gefundenen neuen feuerfesten Alkali\"  (Investigation of some minerals occurring at the iron mines of Utö and of a new refractory alkali found therein), Journal für Chemie und Physik, 22 (1) : 93–117. (in German) In 1818, Christian Gmelin was the first to observe that lithium salts give a bright red color to flame. However, both Arfwedson and Gmelin tried and failed to isolate the pure element from its salts. It was not isolated until 1821, when William Thomas Brande obtained it by electrolysis of lithium oxide, a process that had previously been employed by the chemist Sir Humphry Davy to isolate the alkali metals potassium and sodium.Brande, William Thomas (1821) A Manual of Chemistry, 2nd ed. London, England: John Murray, vol. 2, pp. 57-58.  Brande also described some pure salts of lithium, such as the chloride, and, estimating that lithia (lithium oxide) contained about 55% metal, estimated the atomic weight of lithium to be around 9.8 g/mol (modern value ~6.94 g/mol). In 1855, larger quantities of lithium were produced through the electrolysis of lithium chloride by Robert Bunsen and Augustus Matthiessen. The discovery of this procedure led to commercial production of lithium in 1923 by the German company Metallgesellschaft AG, which performed an electrolysis of a liquid mixture of lithium chloride and potassium chloride."]}, {"page": "Alkaline earth metal", "response": ["Barite, a mineral containing barium, was first recognized as containing a new element in 1774 by Carl Scheele, although he was able to isolate only barium oxide. Barium oxide was isolated again two years later by Johan Gottlieb Gahn. Later in the 18th century, William Withering noticed a heavy mineral in the Cumberland lead mines, which are now known to contain barium. Barium itself was finally isolated in 1808 when Humphry Davy used electrolysis with molten salts, and Davy named the element barium, after baryta. Later, Robert Bunsen and Augustus Matthiessen isolated pure barium by electrolysis of a mixture of barium chloride and ammonium chloride."]}, {"page": "Heike Kamerlingh Onnes", "response": ["In 1911 Kamerlingh Onnes measured the electrical conductivity of pure metals (mercury, and later tin and lead) at very low temperatures. Some scientists, such as William Thomson (Lord Kelvin), believed that electrons flowing through a conductor would come to a complete halt or, in other words, metal resistivity would become infinitely large at absolute zero. Others, including Kamerlingh Onnes, felt that a conductor's electrical resistance would steadily decrease and drop to nil. Augustus Matthiessen said that when the temperature decreases, the metal conductivity usually improves or in other words, the electrical resistivity usually decreases with a decrease of temperature."]}, {"page": "Electrical resistivity and conductivity", "response": ["If more than one source of scattering is simultaneously present, Matthiessen's Rule (first formulated by Augustus Matthiessen in the 1860s)A. Matthiessen, Rep. Brit. Ass. 32, 144 (1862)A. Matthiessen, Progg. Anallen, 122, 47 (1864) states that the total resistance can be approximated by adding up several different terms, each with the appropriate value of ."]}, {"page": "British Science Association", "response": ["The undertaking was suggested to the BA by William Thomson, and its success was due to the use of Thomson's mirror galvanometer. Josiah Latimer Clark and Fleeming Jenkin made preparations. Thomson, with his students, found that impure copper, contaminated with arsenic, introduced significant extra resistance. The chemist Augustus Matthiessen contributed an appendix (A) to the final 1873 reportFleeming Jenkin (1873) Reports of the Committee on Electrical Standards appointed by the British Association for the Advancement of Science, link from HathiTrust. that showed temperature-dependence of alloys."]}, {"page": "Electron mobility", "response": ["Normally, more than one source of scattering is present, for example both impurities and lattice phonons. It is normally a very good approximation to combine their influences using \"Matthiessen's Rule\" (developed from work by Augustus Matthiessen in 1864):"]}, {"page": "Matthiessen", "response": ["* Augustus Matthiessen (1831–1870), British physicist and chemist, notable for Matthiessen's rule."]}, {"page": "Henry Edward Armstrong", "response": ["Armstrong pursued further studies under Hermann Kolbe at Leipzig, earning a PhD in 1869 for work on \"acids of sulfur.\" He returned to London and worked under Augustus Matthiessen in the medical school of St Bartholomew's Hospital, in charge of chemistry classes for students taking the London degree. A permanent appointment in 1879 at City and Guilds of London Institute, now also a part of Imperial College, followed. At age 36, Armstrong became Professor of Chemistry at yet another Imperial College precursor, the Central Institution in 1884. It was here that he established a three-year diploma course in chemical engineering, \"seeing the need for a more scientific attitude of mind among British industrialists\""]}, {"page": "Charles Romley Alder Wright", "response": ["Wright was employed by the Weston works of the Runcorn Soap and Alkali Company during 1866-1867. He then moved to London where he worked with Albert James Bernays at St. Thomas's Hospital; with Augustus Matthiessen of St. Mary's Hospital and St Bartholomew's Hospital; and with Sir Lowthian Bell. He earned his DSc (Lond) in 1870."]}, {"page": "List of fellows of the Royal Society M, N, O", "response": ["| Augustus Matthiessen||06/06/1861||2 January 1831 – 6 October 1870"]}]}}