{"wiki_id": "http://www.wikidata.org/entity/Q345716", "itemLabel": "Thomas Watson", "itemDescription": "poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Watson_(poet)", "wikipedia_page": {"main": "Thomas Watson (1555–1592) was an English poet and translator, and the pioneer of the English madrigal. His lyrics aside, he wrote largely in Latin, also being the first to translate Sophocles's Antigone from Greek. His incorporation of Italianate forms into English lyric verse influenced a generation of English writers, including Shakespeare, who was referred to in 1595 by William Covell as \"Watson's heyre\" (heir). He wrote both English and Latin compositions, and was particularly admired for the Latin. His unusual 18-line sonnets were influential, although the form was not generally taken up.\n\n", "link_mentions": [{"page": "Christopher Marlowe", "response": ["It has been speculated that Marlowe was the \"Morley\" who was tutor to Arbella Stuart in 1589.He was described by Arbella's guardian, the Countess of Shrewsbury, as having hoped for an annuity of some £40 from Arbella, his being \"so much damnified (i.e. having lost this much) by leaving the University.\": British Library Lansdowne MS. 71, f.3. and Nicholl, (1992), pp. 340–2. This possibility was first raised in a Times Literary Supplement letter by E. St John Brooks in 1937; in a letter to Notes and Queries, John Baker has added that only Marlowe could have been Arbella's tutor owing to the absence of any other known \"Morley\" from the period with an MA and not otherwise occupied.John Baker, letter to Notes and Queries 44.3 (1997), pp. 367–8 If Marlowe was Arbella's tutor, it might indicate that he was there as a spy, since Arbella, niece of Mary, Queen of Scots, and cousin of James VI of Scotland, later James I of England, was at the time a strong candidate for the succession to Elizabeth's throne.Elizabeth I and James VI and I, History in Focus. Frederick S. Boas dismisses the possibility of this identification, based on surviving legal records which document Marlowe's \"residence in London between September and December 1589\". Marlowe had been party to a fatal quarrel involving his neighbours and the poet Thomas Watson in Norton Folgate and was held in Newgate Prison for a fortnight.Frederick S. Boas, Christopher Marlowe: A biographical and critical study (Oxford: Clarendon Press, 1953), pp. 101ff. In fact, the quarrel and his arrest occurred on 18 September, he was released on bail on 1 October and he had to attend court, where he was acquitted on 3 December, but there is no record of where he was for the intervening two months."]}, {"page": "List of English-language poets", "response": ["*Thomas Watson (1555–1592, E)"]}, {"page": "Francis Walsingham", "response": ["Protestants lauded Walsingham as \"a sound pillar of our commonwealth and chief patron of virtue, learning and chivalry\".Thomas Watson quoted in Hutchinson, p. 261 He was part of a Protestant intelligentsia that included Philip Sidney, Edmund Spenser and John Dee: men who promoted an expansionist and nationalist English Renaissance.Wilson, p. 242 Spenser included a dedicatory sonnet to Walsingham in the Faerie Queene, likening him to Maecenas who introduced Virgil to the Emperor Augustus. After Walsingham's death, Sir John Davies composed an acrostic poem in his memory and Watson wrote an elegy, Meliboeus, in Latin. On the other hand, Jesuit Robert Persons thought Walsingham \"cruel and inhumane\" in his persecution of Catholics.Hutchinson, p. 63 Catholic sources portray a ruthless, devious man driven by religious intolerance and an excessive love for intrigue. Walsingham attracts controversy still.Cooper, pp. 130–131 Although he was ruthless, his opponents on the Catholic side were no less so; the treatment of prisoners and suspects by Tudor authorities was typical of European governments of the time.Hutchinson, pp. 261–264 Walsingham's personal, as opposed to his public, character is elusive; his public papers were seized by the government while many of his private papers, which might have revealed much, were lost. The fragments that do survive demonstrate his personal interest in gardening and falconry.Adams et al.; Cooper, p. 44"]}, {"page": "List of poets", "response": ["*Thomas Watson (1555–1592), English lyric poet in English and Latin"]}, {"page": "16th century in literature", "response": ["**Thomas Watson – Hekatompathia or Passionate Century of Love"]}, {"page": "1593 in literature", "response": ["*Thomas Watson (posthumously, as T. W.) – The Tears of Fancie, or Love Disdained (sonnets)"]}, {"page": "1592 in literature", "response": ["*September 26 (burial) – Thomas Watson, English lyric poet writing in English and Latin (born 1555)"]}, {"page": "1585 in literature", "response": ["*Thomas Watson – Amyntas (pastoral epic in Latin)"]}, {"page": "1584 in literature", "response": ["*Thomas Watson – Hekatompathia or Passionate Centurie of Love (publication)"]}, {"page": "1555 in literature", "response": ["**Thomas Watson, English poet writing in English and Latin (died 1592)"]}, {"page": "John Lyly", "response": ["Lyly dedicated his second Euphues novel to Edward de Vere, 17th Earl of Oxford, who seems to have acted as patron to most of Lyly's literary associates when they left Oxford for London,Dover Wilson, John. John Lyly, Macmillan and Bowes, Cambridge, 1905.  and it is about this time that Lyly became his private secretary. De Vere was Burghley's son-in-law, and two years later a letter from Lyly to Burghley, dated July 1582, protests against an accusation of dishonesty which had brought him into trouble with the Earl, and requests a personal interview in order to clear his name. In the same year, he contributed an introductory epistle, John Lyly to the Author his friend, to Thomas Watson's collection of poems Hekatompathia, or passionate Centurie of Love, also published by Cawood, and which Watson also dedicated to de Vere.Feuillerat, Albert. John Lyly: Contribution a l'Histoire de la Renaissance en Angleterre. Cambridge: University Press. 1910. p. 528-9.  "]}, {"page": "Abraham Fraunce", "response": ["* The Lamentations of Amintas for the death of Phyllis (1587), a version in English hexameters of his friend, Thomas Watson's, Latin Amyntas"]}, {"page": "Chronology of Shakespeare's plays", "response": [":Evidence: because the three versions of Hamlet which appeared in 1603, 1604/1605 and 1623 differ so much from one another, dating the play is exceptionally difficult. In his 1987 edition of the play for the Oxford Shakespeare (which uses F1 as the control text), G R. Hibbard writes \"exactly when Hamlet was composed depends in part on which Hamlet is under consideration, for the play exists in three different forms.\" Hamlet was originally written sometime between September 1599 and July 1602 (when it was registered in the Stationers Register). The terminus post quem of September 1599 is fixed by a reference to Julius Caesar (3.2.96–97), the earliest recorded performance of which took place in September 1599. Another important internal piece of evidence is found in Rosencrantz and Guildenstern's report to Hamlet of \"an aerie of children, little eyases, that cry out on the top of question and are most tyrannically clapped for't\" (2.2.335–337). This is probably a reference to the Children of the Chapel, a playing company of young boys who performed at Blackfriars with such success as to make them genuine rivals to the adult acting companies. The subsequent comment, \"there has been much to-do on both sides; and the nation holds it no sin to tar them to controversy. There was, for a while, no money bid for argument, unless the poet and the player went to cuffs in to the question\" (2.2.348–352) is thought to refer to the War of the Theatres between Ben Jonson on one side and John Marston and Thomas Dekker on the other. The conflict began in 1599 when Marston mocked Jonson with the character of Chrisoganus in Histriomastix. Jonson responded by satirizing Marston's style in Every Man out of His Humour, leading to a series of plays in which the various writers mocked one another. The \"conflict\" concluded in 1601, when Dekker mocked Jonson with the character of Horace in Satiromastix, at which point Jonson and Marston apparently reconciled. Both the reference to the child actors and the War of the Theatres suggest a date of composition of 1600–1601. Additionally, in his 1598 copy of the works of Geoffrey Chaucer, Gabriel Harvey has written in a marginal note that Shakespeare's \"Lucrece & his tragedie of Hamlet, prince of Denmarke, have it in them, to please the wiser sort.\" Harvey also mentions the Earl of Essex as still alive, which would suggest he wrote the note prior to 25 February 1601, when Essex was executed. This would seem to narrow the date of composition to between September 1599 and February 1601. However, not all scholars accept that Harvey's note can be used for dating purposes, mainly due to the fact that it infers Thomas Watson (d.1592) and Edmund Spenser (d.1599) are both still alive, but also mentions John Owen's 1607 epigrams, making it impossible to ascertain exactly when the note was written. Stylistic evidence has also been cited, usually as illustrative of a date of composition of 1600 or 1601, with subsequent revisions up to, and possibly beyond, 1605. This dating, however, is far from universally accepted."]}, {"page": "St Bartholomew-the-Less", "response": ["* Thomas Watson, poet: buried 1592"]}, {"page": "Thomas Watson", "response": ["Thomas Watson may refer to:", "*Thomas Watson (bishop of Lincoln) (1515–1584), Catholic bishop", "*Thomas Watson (bishop of St David's) (1637–1717), English clergyman", "*Thomas Watson (poet) (c. 1557–1592), English poet and translator", "*Thomas Watson (Puritan) (c. 1620–1686), nonconformist preacher and writer", "*Thomas Watson (engraver) (1750–1781), fine engraver", "*Thomas Watson (cricketer, born 1880) (1880–1944), English clergyman and cricketer", "*Thomas Watson (cricketer, born 1913) (1913–1994), English cricketer and educator", "*Thomas Watson (silk spinner) (1823–1887), British politician; MP for Ilkeston, Derbyshire, 1885–1887", "*Thomas Watson, 3rd Earl of Rockingham (1715–1746), English nobleman and politician; MP for Canterbury", "*Thomas Watson (Berwick-upon-Tweed MP) (c. 1701–1766), British politician; MP for Berwick-upon-Tweed, 1754–1765", "*J. Thomas Watson (1885–1954), Attorney General of Florida", "*Thomas Watson (surveyor), early Western Australian surveyor", "*Thomas Watson (trade unionist) (1860s–1921), British trade union leader", "*Sir Thomas Watson, 1st Baronet (1792–1882), president of the Royal College of Physicians, 1862–66"]}, {"page": "1590 in music", "response": ["* Thomas Watson – The first sett, Of Italian Madrigalls Englished, published in London."]}, {"page": "Charles Beauclerk (author)", "response": ["Through his father he is the heir of the family of Edward de Vere, 17th Earl of Oxford (hence the double surname), and has played a prominent role in promoting the Oxfordian theory that his ancestor wrote the works of William Shakespeare. He also claims that de Vere was the real author of works attributed to other Elizabethan writers, including John Lyly, George Gascoigne and Thomas Watson. Beauclerk regularly lectures on Oxfordian subjects in the United States."]}, {"page": "Joannes Susenbrotus", "response": ["Susenbrotus' textbooks spread his name to pupils all over Europe. William Shakespeare seems to have known Epitome troporum, since – as T. W. Baldwin pointed out – he uses numerous examples from Susenbrotus' book in his works. He is also a well-known rhetorician to other Elizabethan writers and poets such as Gabriel Harvey, Thomas Nashe and Thomas Watson. On 12 March 1615, students of Trinity College, Cambridge, played the Latin comedy, Susenbrotus, or Fortunia, probably written by John Chappell, in the presence of King James I at Royston. As late as 1660 the English educationalist Charles Hoole recommends Susenbrotus' Epitome as a textbook for grammar schools."]}, {"page": "Arden of Faversham", "response": ["It has also been suggested that it may be the work of Thomas Watson with contributions by Shakespeare."]}, {"page": "Serafino dell'Aquila", "response": ["Serafino and fellow Petrarchans have also been claimed as an influence on the French poet Maurice Scève,I.D. McFarlane, introduction to Scève’s Délie, Cambridge University 1966, pp.26-7 and in England twelve later sonnets by Thomas Watson have been identified as versions of Serafino’s.Sidney Lee, “Thomas Watson”, Dictionary of National Biography 1900"]}, {"page": "Alice Arden", "response": ["In 1592, the events were dramatized in the play Arden of Faversham. The paternity of the play has been long disputed, with William Shakespeare being the most prominent of the candidates, and Thomas Watson purported to be the main author in 2020. The play was later adapted by George Lillo into a domestic tragedy. Alice Arden's story was also adapted into a broadside ballad, \"The complaint and lamentation of Mistresse Arden of Feversham in Kent\".Facsimiles and recordings of the ballad can be found on the English Broadside Ballad Archive."]}, {"page": "Sonnet 130", "response": ["\"This sonnet plays with poetic conventions in which, for example, the mistress's eyes are compared with the sun, her lips with coral, and her cheeks with roses. His mistress, says the poet, is nothing like this conventional image, but is as lovely as any woman\".Mowat, Barbara A., and Paul Werstine, eds. Shakespeare's Sonnets. New York: Washington Square, 2004. Print. Here, Barbara Mowat offers her opinion of the meaning behind Sonnet 130; this work breaks the mold to which Sonnets had come to conform. Shakespeare composed a sonnet which seems to parody a great many sonnets of the time. Poets like Thomas Watson, Michael Drayton, and Barnabe Barnes were all part of this sonnet craze and each wrote sonnets proclaiming love for an almost unimaginable figure;Quennell, P. Shakespeare: the Poet and his Background. Weidenfeld and Nicolson, London, 1964. Print Patrick Crutwell posits that Sonnet 130 could actually be a satire of the Thomas Watson poem \"Passionate Century of Love\", pointing out that the Watson poem contains all but one of the platitudes that Shakespeare is making fun of in Sonnet 130.Crutwell, Patrick. The Shakespearean Moment and its Place in the Poetry of the 17th Century. New York:  Random House.  1960. Print However, E.G. Rogers points out the similarities between Watson's \"Passionate Century of Love,\" Sonnet 130, and Richard Linche's Poem collection entitled \"Diella.\"Rogers, E.G., \"Sonnet CXXX:  Watson to Linche to Shakespeare.\"  Shakespeare Quarterly.  11.2 (1960):  232-233.  Print. There is a great deal of similarity between sections of the Diella poem collection and Shakespeare's \"Sonnet 130\", for example in \"130\" we see, \"If hairs be wires, black wires grow on her head,\" where in \"Diella\" we see \"Her hayre exceeds fold forced in the smallest wire.\"Rogers, E.G., \"Sonnet CXXX:  Watson to Linche to Shakespeare.\"  Shakespeare Quarterly.  11.2 (1960):  232-233.  Print. Each work uses a comparison of hairs to wires; while in modern sense this may seem unflattering, one could argue that Linche's work draws upon the beauty of weaving gold and that Shakespeare mocks this with harsh comparison. This, along with other similarities in textual content, leads, as E.G. Rogers points out, the critic to believe that Diella may have been the source of inspiration for both homage, by Watson's \"Passionate Century of Love,\" and satire by Shakespeare's \"Sonnet 130.\" The idea of Satire is further enforced by the final couplet of \"130\" in which the speaker delivers his most expositional line: \"And yet, by heaven, I think my love as rare, as any she belied with false compare.\" This line projects the message behind this work, demeaning the false comparisons made by many poets of the time.Vendler, Helen. The Art of Shakespeare's Sonnets. Harvard University Press, Massachusetts, 1997"]}, {"page": "Sonnet sequence", "response": ["*Thomas Watson, ΕΚΑΤΟΜΠΑΟΙΑ or Passionate Centurie of Love (1582), 100 'sonnets', most of which are of eighteen lines each, yet still emulating the general idea of Petrarch whom Watson had translated into Latin.", "*Anon., The Tears of Fancie (1593), 60 sonnets formerly attributed to Thomas Watson."]}, {"page": "Sonnet 24", "response": ["Edward Capell amended quarto \"steeld\" to \"stelled,\" a word more closely related to the metaphor of the first quatrain. Edward Dowden notes parallels for the opening conceit in Henry Constable's Diana and in Thomas Watson's Tears of Fancy."]}, {"page": "Musica Transalpina", "response": ["The collection appeared with a dedication to Gilbert Talbot. It was edited by Nicholas Yonge and printed by Thomas East. Several similar anthologies followed immediately after the success of the first. For example, in 1590 East published The First Set of Italian Madrigals; the compositions (which were mainly by Marenzio) were provided with English texts by the poet Thomas Watson. "]}, {"page": "Mathew Roydon", "response": ["In Thomas Nashe's Address to the gentlemen students of both universities, prefixed to Robert Greene's Arcadia (1587), Roydon is mentioned with Thomas Achlow and George Peele as leading London poets. Francis Meres, in his Palladis Tamia (1598), describes Roydon as worthy of comparison with the great poets of Italy. Apart from his elegy on Sidney, the only other compositions by Roydon in print are some verses before Thomas Watson's Sonnets (1581), and before Sir George Peckham's True Reporte (1583). Martin Garrett writes that Roydon \"was associated at various times with Spenser, Marlowe, and Chapman\",Martin Garrett, Sidney: The Critical Heritage (1996) p.105-6. and quotes Nashe, prefacing Greene's Menaphon (1589), in saying that Roydon \"hath shewed himselfe singular in the immortall Epitaph of his beloved Astrophell, besides many other most absolute Comike inventions\".The works of Thomas Nashe, ed. Ronald B. McKerrow, 5 vols, Oxford, 1958, vol. 3, p. 323. According to Garrett:"]}, {"page": "The Phoenix Nest", "response": ["It was the first to show the influence of the new life and vigour of such compilations. The Phoenix Nest is dedicated, as it were, to the memory of Robert Dudley, 1st Earl of Leicester, and opens with three elegies upon Astrophel (i.e. Sir Philip Sidney). The volume contains poems by certain anonymous writers who clearly belong to the old, rather than to the new, school of poets. And, in the main, N. B. Gent, as Nicholas Breton is here written, belongs to that school too. Identified writers who contributed to the volume include Edward de Vere, Edward Dyer, Robert Greene, Thomas Lodge, George Peele, Walter Raleigh, Mathew Roydon, William Smith, and Thomas Watson. "]}, {"page": "John Case (Aristotelian writer)", "response": ["He also wrote an Apologia Musices, tam vocalis quam instrumentalis et mixtae (1588), of which there is a copy in the Lambeth Library.  The Praise of Musicke; wherein...is described the sober and lawful use of the same in the Congregation and Church of God (1586) is also attributed to him.  This is dedicated to Sir Walter Raleigh by the printer Barnes, who calls it \"an orphan of one of Lady Musicke's children.\"  A contemporary, Thomas Watson, wrote some verses, now in the Rawlinson manuscripts, to Case on the publication called \"A Gratification unto Mr. John Case for his learned book lately made on the Praizes of Musick.\"", "* Ellen E. Knight, \"The Praise of Musicke: John Case, Thomas Watson, and William Byrd,\" Current Musicology, vol. 30, 1980, pp. 37–51."]}, {"page": "1582 in poetry", "response": ["* Thomas Watson, "]}, {"page": "Amyntas", "response": ["*Amyntas, the title shepherd in Thomas Watson's Latin eclogue cycle Amyntas"]}, {"page": "Library Edition of the British Poets", "response": [":::The following poets: John Gower; John Barbour; Andrew Wyntoun; Blind Harry; James I of Scotland; John the Chaplain—Thomas Occleve; John Lydgate; John Harding, John Kay; Robert Henryson; William Dunbar; Gavin Douglas; Hawes, Barclay; Skelton; Sir David Lyndsay; Thomas Tusser; Vaux, Edwards; George Gascoigne; Thomas Sackville, Lord Buckhurst and Earl of Dorset; John Harrington; Sir Philip Sidney; Robert Southwell; Thomas Watson; Thomas Turberville; Unknown."]}, {"page": "Thomas Edwards (poet)", "response": ["The author concluded each work with a long postscript. In Narcissus this includes, using aliases, references to other poets including Amintas (Thomas Watson), Collyn (Edmund Spenser), Leander (Christopher Marlowe), Rosamond (Samuel Daniel) and Adon (Shakespeare).Katherine Duncan Jones, ' Shakespeare, The Motley Player,’ in The Review of English Studies, NS, Vol. 60, No 247, Oxford University Press, 2009 pp. 723–742, pp. 724–726. A mysterious poet \"in purple robes\" praised at the end of the list has not been convincingly identified."]}, {"page": "Amintas", "response": ["#REDIRECTThomas Watson (poet)"]}, {"page": "Thomas Walsingham (literary patron)", "response": ["Sir Thomas Walsingham (c. 1561 – 11 August 1630) was a courtier to Queen Elizabeth I and literary patron to such poets as Thomas Watson, Thomas Nashe, George Chapman and Christopher Marlowe. He was related to Elizabeth's spymaster Francis Walsingham and the employer of Marlowe's murderer Ingram Frizer. This connection is one of the reasons offered for suggesting that Marlowe's death may have been linked with intelligence work, and not a dispute over a bill for food and accommodation, as in the coroner's verdict.", "The first poet to seek Walsingham's patronage was Thomas Watson, an old acquaintance from the time when both men had been engaged on Sir Francis's secret business in France.Nicholl (1992: 182) His timely dedication to Thomas Walsingham, newly come into money through his inheritance, prefaced A Lament for Meliboeus, an elegy on the death of Sir Francis. Watson's venture was based on the family relationship between the dedicatee and the dead statesman, but Thomas Walsingham proved to be a genuine patron of literary endeavour and other poets followed the example. It is probable that Watson introduced Marlowe, a friend from the London literary circle with whom he was arrested for brawling in September 1589,Kuriyama (2002: xvi; 99) to Thomas Walsingham (although their paths may have crossed earlier, during Marlowe's own service to the late Sir Francis). Walsingham appreciated the dedication, and the introduction, with Marlowe becoming a frequent house-guest at Scadbury. Later dedications from other poets imply familiarity and affection, rather than the subservience and duty more common at the time.For example, the dedication in George Chapman's Hero and Leander (a completion of Marlowe's work) includes good wishes to Sir Thomas's wife and young son, whom, it is evident, Chapman knows well.  Walsingham was a mourner at Marlowe's funeral."]}, {"page": "1591 in poetry", "response": ["** The Countesse of Pembrokes Yvychurch, Part 1 adapted from Torquato Tasso's Aminta; Part 2 a revision of Fraunce's translation of Amyntas 1587 by Thomas Watson; volume also includes translations of the second Bucolic of Virgil (first published in Fraunce's The Lawiers Logike) and of the opening of Heliodorus's Aethiopica (see also The Third Part 1592)"]}, {"page": "1592 in poetry", "response": ["* September 26 (bur.) – Thomas Watson (born 1555), English lyrical poet"]}, {"page": "1555 in poetry", "response": ["* Thomas Watson (died 1592), English lyrical poet who wrote in English and Latin"]}, {"page": "Thomas East", "response": ["In 1589 Byrd's Songs of Sundrie Natures and the first book of his Cantiones Sacræ were published by East (at the sign of the Black Horse in Aldersgate Street). In the following year the same composer contributed two madrigals to Thomas Watson's First Sett of Italian Madrigalls Englished,Thomas Watson: The first set of Italian madrigals Englished. Retrieved December 2013 as he had previously done in the case of Musica Transalpina. In 1591 the second set of Byrd's own Cantiones Sacræ was issued by his assignee."]}]}}