{"wiki_id": "http://www.wikidata.org/entity/Q345864", "itemLabel": "Francis Cadell", "itemDescription": "Scottish painter (1883-1937)", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Cadell_(artist)", "wikipedia_page": {"main": "Francis Campbell Boileau Cadell RSA (12 April 1883 – 6 December 1937) was a Scottish Colourist painter, renowned for his depictions of the elegant New Town interiors of his native Edinburgh, and for his work on Iona.\nFrom October 2011 - March 2012 the Scottish National Gallery of Modern Art held a major solo retrospective of Cadell's work, the first since that held at the National Gallery of Scotland in 1942.", "link_mentions": [{"page": "Kirkcudbright", "response": ["Kirkcudbright has had a long association with the Glasgow art movement. Several artists, including the Glasgow Boys and the famed Scottish Colourists, such as Samuel Peploe and Francis Cadell, based themselves in the area over a 30-year period from 1880 to 1910, establishing the Kirkcudbright Artists' Colony. Also among those who moved here from Glasgow were Edward Hornel, George Henry and Jessie M. King. Later another small group of Glasgow-trained artists built their studios across the river at The Stell, including John Charles Lamont and Robert Sivell. Landscape painter Charles Oppenheimer moved to Kirkcudbright in 1908. He is given credit along with artist Dorothy Nesbitt for protecting the Harbour Cottage (art) Gallery from demolition in 1956.  Kirkcudbright became known as \"the artists' town\", although longtime residents considered it a \"fishing town\". Other artists include:"]}, {"page": "Dean Cemetery", "response": ["* Francis Cadell (artist) (1883–1937) Scottish colourist, his actress sister Jean Cadell (1884–1967) and great nephew, comedy actor Simon Cadell (1950–1996) star of Enemy at the Door and  Hi-de-Hi"]}, {"page": "Modern art", "response": ["* Scottish Colourists – Francis Cadell, Samuel Peploe, Leslie Hunter, John Duncan Fergusson"]}, {"page": "Portland Gallery", "response": ["Founded in 1984 by Tom Hewlett, the gallery displays modern British and Contemporary paintings. A particular specialization is the work of Scottish colourists Samuel Peploe, Francis Cadell, George Leslie Hunter, and John Duncan Fergusson, and their immediate followers, including Anne Redpath and John Maclauchlan Milne. The gallery also hosts the estate collections of Cadell, Maclauchlan Milne, and Edward Seago."]}, {"page": "Scottish Colourists", "response": ["The Scottish Colourists were a group of four painters, three from Edinburgh, whose Post-Impressionist work, though not universally recognized initially, came to have a formative influence on contemporary Scottish art and culture. They were Francis Cadell, John Duncan Fergusson, Leslie Hunter and Samuel Peploe.", "Largely recognised as the leading figure of the group was Samuel Peploe. The other Scottish Colourists were Francis Cadell, John Duncan Fergusson and Leslie Hunter. They \"absorbed and reworked the strong and vibrant colours of contemporary French painting into a distinctive Scottish idiom during the 1920s and 1930s\"."]}, {"page": "1883 in art", "response": ["** Francis Cadell, Scottish Colourist painter (died 1937)"]}, {"page": "1937 in art", "response": ["** Francis Cadell, Scottish Colourist painter (b. 1883)"]}, {"page": "Scottish National Gallery of Modern Art", "response": ["Works from the collection are presented here as well as a programme of changing exhibitions. The early part of the collection features European art from the beginning of the twentieth century, including work by André Derain and Pierre Bonnard, cubist paintings and holdings of expressionist and modern British art. Special highlights include paintings by Henri Matisse and Pablo Picasso and the Scottish Colourists Samuel John Peploe, John Duncan Fergusson, Francis Cadell and Leslie Hunter."]}, {"page": "Calton Hill", "response": ["Most of the properties on the terraces are occupied as houses but on Royal Terrace there is a number of hotels, by far the largest being the Crowne Plaza HotelThe Royal Terrace Hotel  Accessed 6 August 2009 while on Regent Terrace is located the United States Consulate. Royal Terrace with its views over Leith and the Firth of Forth was popular with early owners who were shipowners and traders in Leith. Some of these were involved in the whisky trade, Leith being a centre for whisky blending and storage, and for a time in the 19th century the street was known as Whisky Row. Louis-Antoine, Duke of Angoulême (the elder son of Charles X of France, last of the Bourbon kings) and his wife Marie-Thérèse-Charlotte, (the daughter of Louis XVI of France and Marie Antoinette), moved into what is now 22 (then 21) Regent Terrace in 1830. Marie-Caroline de Bourbon-Sicile, duchess de Berry, sister in law of the Duc d'Angoulême, also lived at what is now 12 (then 11) Regent Terrace at that time.Mackenzie-Stuart, A.J., (1995), \"A French King at Holyrood\" John Donald Publishers Ltd., Edinburgh,    Her young son, Henri, the Comte de Chambord, is said to have wept bitterly when his family left for Austria in 1832 as he had become very attached to Scotland.  The painter Francis Cadell, one of the Scottish Colourists, lived in 30 Regent Terrace from 1930-1935.Painting \"30 Regent Terrace\"  by Frances Cadell (1934) Accessed 6 August 2009  The western end of Regent Terrace was closed in 2001 to traffic because of security concerns about the United States Consulate.Edinburgh City Council Traffic Regulation Order to make temporary closure since 2001 permanent Accessed 9 August 2009"]}, {"page": "Simon Cadell", "response": ["Born in London, he was the son of theatrical agent John Cadell, grandson of the Scottish character actress Jean Cadell, great nephew of Francis Cadell RSA, the brother of the actress Selina Cadell and commercials director Patrick Cadell, the cousin of the actor Guy Siner and son-in-law of the television producer David Croft. He was educated at The Hall School in Hampstead and Bedales School at Petersfield where his close friends included Gyles Brandreth, who remained a friend until Cadell's death.Nicholas Shakespeare \"The Diary of a Lifetime by Gyles Brandreth: review\", Daily Telegraph, 31 October 2009"]}, {"page": "Jean Cadell", "response": ["She was born at 4 Buckingham TerraceEdinburgh Post Office Directory 1884 in Edinburgh, the daughter of Dr Francis Cadell (1844-1909), a wealthy surgeon, and his wife, Mary Hamilton Boileau (1853-1907).Cadell grave, Dean Cemetery The family moved to 22 Ainslie Place, a huge Georgian house on the Moray Estate, in her youth.Edinburgh Post Office Directory 1890", "Her brother, Francis Cadell, was one of the Scottish Colourists. She married actor Perceval Perceval-Clark.Simon Cadell Jean and Perceval both appeared in the play The Man Who Stayed at Home."]}, {"page": "Samuel Peploe", "response": ["Samuel John Peploe (pronounced PEP-low; 27 January 1871 – 11 October 1935) was a Scottish Post-Impressionist painter, noted for his still life works and for being one of the group of four painters that became known as the Scottish Colourists. The other colourists were John Duncan Fergusson, Francis Cadell and Leslie Hunter.", "In 1910 Peploe married Margaret MacKay (1873–1958), whom he had known since 1894. He also moved to Paris in 1910, a period which saw him concentrate increasingly on still life and landscape painting. His still-life works show the influence of Manet, with combinations of fluid brushwork, thick impasto and dark backgrounds with strong lighting. Returning to Scotland in 1912 he found that his usual dealer refused his work and he was obliged to stage his own exhibition.Biography and works at Portland Gallery , accessed December 2012 Peploe went on regular painting trips with friends to many parts of the country, and during the 1920s he spent several summers with Francis Cadell, another Scottish Colourist, painting in Iona."]}, {"page": "F. C. B. Cadell", "response": ["#REDIRECT Francis Cadell (artist)"]}, {"page": "F C B Cadell", "response": ["#REDIRECTFrancis Cadell (artist)"]}, {"page": "Francis Campbell Boileau Cadell", "response": ["#REDIRECTFrancis Cadell (artist)"]}, {"page": "FCB Cadell", "response": ["#REDIRECTFrancis Cadell (artist)"]}, {"page": "Francis Cadell", "response": ["Francis Cadell may refer to:", "*Francis Cadell (explorer) (1822–1879), Scottish explorer and riverboat pioneer in Australia ", "*Francis Cadell (artist) (1883–1937), Scottish artist"]}, {"page": "Cadell", "response": ["* Francis Cadell (explorer) (1822–1879), Scottish-born explorer of Australia", "* Francis Cadell (artist) (1883–1937), Scottish painter", "* Cadell, South Australia, named after Francis Cadell"]}, {"page": "Scottish art", "response": ["The next significant group of artists to emerge were the Scottish Colourists in the 1920s. The name was later given to four artists who knew each other and exhibited together, but did not form a cohesive group. All had spent time in France between 1900 and 1914Chilvers, Oxford Dictionary of Art and Artists, p. 575. and all looked to Paris, particularly to the Fauvists, such as Monet, Matisse and Cézanne, whose techniques they combined with the painting traditions of Scotland. They were John Duncan Fergusson (1874–1961), Francis Cadell (1883–1937), Samuel Peploe (1871–1935) and Leslie Hunter (1877–1931). They have been described as the first Scottish modern artists and were the major mechanism by which post-impressionism reached Scotland."]}, {"page": "Francis (Campbell Boileau) Caddel", "response": ["#REDIRECT Francis Cadell (artist)"]}, {"page": "Selina Cadell", "response": ["Selina Jane Cadell (born 12 August 1953) is an English actress. She is the younger sister of actor Simon Cadell and granddaughter of actress Jean Cadell. She is the great niece of the Scottish artist Francis Cadell."]}, {"page": "Edinburgh Art Festival", "response": ["The Edinburgh International Festival began in 1947, and significant visual art exhibitions were included in the early years. Exhibitions included the French artists Pierre Bonnard and Édouard Vuillard in 1948; a retrospective of the three Scottish Colourists, Samuel Peploe, Francis Cadell and Leslie Hunter in 1949; and Rembrandt in 1950.  Thereafter, there was acknowledgement from the Festival authorities that the visual arts needed to be more \"emphatically represented\" in the Festival itself, and a series of partnerships was forged between the Festival Society and the then Arts Council of Great Britain, the Royal Museum of Scotland, the National Galleries of Scotland, the University of Edinburgh and the Royal Scottish Academy. With a few exceptions, these looked beyond the art of Scotland and contributed to a declared part of the Festival’s international aims. Not only did the exhibitions bring the works of foreign artists to Scotland, they cultivated an interest in Scotland amongst wealthy collectors and patrons from around the world."]}, {"page": "Regent Terrace", "response": ["The painter Sir George Harvey lived at 21 Regent Terrace from 1854 to 1876. Sir George was one of the founders of the Royal Scottish Academy, was elected president in 1864 and was knighted in 1867.  The influential Scottish minister and author the Reverend Dr. Maxwell Nicholson lived at 3 Regent Terrace for most of his later life until 1874. The architect Duncan Menzies lived at 31 Regent Terrace from about 1891–1910.Sir James Puckering Gibson 1st Baronet of Regent Terrace was Lord Provost of Edinburgh from 1906 to 1909 and represented Edinburgh East in the House of Commons as a Liberal between 1909 and 1912.  He lived at 33 Regent Terrace from 1880 and was created in the Baronetage of the United Kingdom on 23 November 1909.The Baronetage of England, Ireland, Nova Scotia, Great Britain and the United Kingdom, Leigh Rayment  Accessed 2009-09-07  Sir James had no children so when he died in 1812 his title became extinct. Professor Sir Thomas Hudson Beare was Professor of Engineering Heriot-Watt University, Edinburgh, and University College, London.  He was also  Regius Professor of Engineering in Edinburgh University and lived at 10 Regent Terrace from 1901. The architect William Gordon Dey was born at 9 Regent Terrace in 1911 and went to the Royal High School which was close by.  A Regius Professor of English at Edinburgh University Sir H. J. C. Grierson lived at 12 Regent Terrace from 1913–1933. His daughter Janet (married name Janet Teissier du Cros) was an author who later wrote Divided Loyalties about her years as a Scottish woman in the Cevennes in occupied France during the war when the French resistance was active.  The painter Francis Cadell, one of the Scottish Colourists, lived in 30 Regent Terrace from 1930–1935.Painting \"30 Regent Terrace\"  by Frances Cadell (1934) Accessed 2009-08-06  Lady Margaret Sackville, daughter of Reginald Windsor Sackville, 7th Earl De La Warr, and second cousin of Vita Sackville-West lived at 30 Regent Terrace from 1930–1932. Sir George Dick-Lauder, 10th Baronet, an Indian Civil Service Administrator, lived at 16 Regent Terrace and died there in 1936.\"Scottish Baronet Dead  Sir George Dick-Lauder\", The Scotsman, 1936-05-08\"Executry Notice – All persons having claims against the estate of the late Sir George William Dalrymple Dick Lauder, Bart., who resided at 16 Regent Terrace..\", The Scotsman, 1936-05-20  Queen Mary used to visit Sir Hew Hamilton Dalrymple KCVO at Number 24.  Sir Hew, brother of the Earl of Stair, Member of Parliament for Wigtownshire and Captain of the Royal Company of Archers, the King's Bodyguard for Scotland, lived there until he died in 1945.  John Murray, 9th Earl of Dunmore lived at 14 Regent Terrace until his death in 1980.John Murray, 9th Earl of Dunmore Accessed 2009-08-09Dunmore Family papers Accessed 2009-09-07 In 1993 Peter Fraser, Baron Fraser of Carmyllie,  then Minister of State at the Scottish Office, was living in Regent Terrace.", "*30 – Lady Margaret Sackville (1930–1932), Francis Cadell (1930–1935)"]}, {"page": "Reginald Fairlie", "response": ["Curiously, James Smith Forbes of Reid and Forbes lodged with Fairlie even after the end of their business partnership. His neighbour at 7 Ainslie Place was Francis Cadell the artist, and they became friends and remained so even after Cadell moved house."]}, {"page": "Royal Glasgow Institute of the Fine Arts", "response": ["The Institute's exhibition program continued despite the outbreak of war in 1914. It continued to attract painters from the south: both the older established \"Glasgow boys\" such as Sir John Lavery (RA), George Henry (RA), David Gauld, Stuart Park, James Guthrie, Edward Arthur Walton, Edward Atkinson Hornel etc., but also younger artist such as Samuel Peploe, Leslie Hunter and Francis Cadell who had connections with the art of pre-war Paris and the paintings of Matisse and Picasso.", "* Francis Cadell"]}, {"page": "List of painters by name beginning with \"C\"", "response": ["*Francis Cadell (1883–1937), Scottish painter"]}, {"page": "Scotland in the modern era", "response": ["In art, the first significant group to emerge in the 20th century were the Scottish Colourists in the 1920s: John Duncan Fergusson (1874–1961), Francis Cadell (1883–1937), Samuel Peploe (1871–1935) and Leslie Hunter (1877–1931). Influenced by the Fauvists, they have been described as the first Scottish modern artists and were the major mechanism by which post-impressionism reached Scotland.I. Chilvers, ed., The Oxford Dictionary of Art and Artists (Oxford: Oxford University Press, 4th edn., 2009), , p. 575. In the inter-war period, elements of modernism and the Scottish Renaissance, were incorporated into art by figures including Stanley Cursiter (1887–1976), who was influenced by Futurism, and William Johnstone (1897–1981), whose work marked a move towards abstraction.M. Gardiner, Modern Scottish Culture (Edinburgh: Edinburgh University Press, 2005), , p. 173. Johnstone also played a part in developing the concept of a Scottish Renaissance with poet Hugh MacDiarmid, which attempted to introduce elements of modernism into Scottish cultural life and bring it into line with contemporary art elsewhere.D. Macmillan, \"Review: Painters in Parallel: William Johnstone & William Gillies\", Scotsman.com, 19 January 2012, retrieved 8 May 2012. James McIntosh Patrick (1907–98) and Edward Baird (1904–) were influenced by elements of surrealism."]}, {"page": "Art in modern Scotland", "response": ["The first significant group of Scottish artists to emerge in the twentieth century were the Scottish Colourists in the 1920s. The name was retrospectively given to John Duncan Fergusson (1874–1961), Francis Cadell (1883–1937), Samuel Peploe (1871–1935) and Leslie Hunter (1877–1931). They knew each other and exhibited together, but did not form a cohesive group. All had spent time in France between 1900 and 1914I. Chilvers, ed., The Oxford Dictionary of Art and Artists (Oxford: Oxford University Press, 4th edn., 2009), , p. 575. and looked for inspiration to Paris, particularly to the Fauvists, such as Monet, Matisse and Cézanne, whose techniques they combined with the painting traditions of Scotland. They have been described as the first Scottish modern artists and were the major mechanism by which post-impressionism reached Scotland. Fergusson in particular would later be a major influence on bringing modernism to Scottish art."]}, {"page": "1937 in Scotland", "response": ["* 6 December – Francis Cadell, Colourist painter (born 1883)"]}, {"page": "Portrait painting in Scotland", "response": ["The generation of painters that followed Raeburn included David Watson, John Watson Gordon and David Wilkie, who became one of the most influential British artists of the century. From the mid-nineteenth century, portrait painting, particularity the miniature, declined as an art, photography also began to influence painting. Major figures who worked in portraiture and came to prominence in the second half of the century included Francis Grant, Robert Scott Lauder, William Quiller Orchardson and John Pettie. In the twentieth century the move away from figurative painting to impressionism and abstraction, speeded the decline of portrait painting. Artists who continued to pursue portraiture included Francis Cadell, Cecile Walton, Dorothy Johnstone and James Cowie. The second half of the twentieth century saw a general movement back towards figurative representation. Alexander Moffat was among the leading Scottish intellectuals from the 1960s. The artists associated with Moffat known as the \"new Glasgow Boys\" included Steven Campbell, Peter Howson, Ken Currie and Adrian Wisniewski. A parallel movement in Edinburgh, focused around the 369 Gallery in the city, included Caroline McNairn, Robert MacLaurin and Gwen Hardie.", "In the twentieth century, the move away from figurative painting to impressionism and abstraction continued the decline of portrait painting.J. Barzun, The Use and Abuse of Art (Princeton University Press, 1975), , p. 55. The first significant group of Scottish artists to emerge in the twentieth century were the four members of the Scottish Colourists in the 1920s. They have been described as the first Scottish modern artists and were the major mechanism by which post-impressionism reached Scotland.I. Chilvers, ed., The Oxford Dictionary of Art and Artists (Oxford: Oxford University Press, 4th edn., 2009), , p. 575. Of their number Francis Cadell (1883–1937), emerged as a significant painter of still lives and single figure compositions, particularly with interior backdrops, before moving closer to abstraction.MacDonald, Scottish Art, p. 160. Of the next significant movement, known as The Edinburgh School, Cecile Walton (1891–1956) referenced classical forms, particularly in her ironic self-portrait Romance (1920), which draws on Titian's Venus of Urbino and Manet's Olympia. Her close friend Dorothy Johnstone's portraits, such as the young girl in September Sunlight (1916), made use of interior natural light.MacDonald, Scottish Art, p. 168. The work of James Cowie (1886–1956), who painted a number of girls in interior settings, is similar in theme to that of Johnstone, but had a more distant and elegiac feel that can be seen in Falling Leaves (1934), which has been read as a commentary as a commentary on the transition from childhood to adolescence.MacDonald, Scottish Art, p. 174."]}, {"page": "1883 in Scotland", "response": ["* 12 April – Francis Cadell, Colourist painter (died 1937)"]}, {"page": "Landscape painting in Scotland", "response": ["The first significant group of Scottish artists to emerge in the twentieth century were the Scottish Colourists in the 1920s. They were John Duncan Fergusson, Francis Cadell, Samuel Peploe and Leslie Hunter, who placed an emphasis on colour above form. The group of artists connected with Edinburgh, most of whom had studied at Edinburgh College of Art during or soon after the First World War, became known as the Edinburgh School. They were influenced by French painters and the St. Ives School and their art was characterised by use of vivid and often non-naturalistic colour and the use of bold technique above form. Members included William Gillies, John Maxwell, William Crozier and William MacTaggart. William Johnstone was one of the artists most closely associated with the Scottish Renaissance, an attempt to introduce modernism into art and to create a distinctive national art. Stanley Cursiter was influenced by the Celtic revival, Post-Impressionism and Futurism. Later in his career he became a major painter of the coastline of this native Orkney. Other artists strongly influenced by modernism included James McIntosh Patrick and Edward Baird, both of whom were influenced by surrealism and the work of Bruegel.", "The first significant group of Scottish artists to emerge in the twentieth century were the Scottish Colourists in the 1920s. The name was later given to four artists who knew each other and exhibited together, but did not form a cohesive group. All had spent time in France between 1900 and 1914Chilvers, The Oxford Dictionary of Art and Artists, p. 575. and all looked for inspiration to Paris, particularly to the Fauvists, such as Monet, Matisse and Cézanne, whose techniques they combined with the painting traditions of Scotland. They were John Duncan Fergusson (1874–1961), Francis Cadell (1883–1937), Samuel Peploe (1871–1935) and Leslie Hunter (1877–1931). They have been described as the first Scottish modern artists and were the major mechanism by which post-impressionism reached Scotland. From 1912 Cadell visited Iona annually to paint and he was joined there by Peploe from 1920. They produced a number of works using the west-coast light and Iona landscape, particularly views of Ben More, which both painted several times. John Duncan, the arts and crafts artist, was still active in the early twentieth century and painted several landscapes similar in style to those of Cadell and Peploe.MacDonald, Scottish Art, p. 162. Hunter used a vibrant palette to create notable paintings of the landscape around Balloch on Loch Lomond.MacDonald, Scottish Art, pp. 163–4. Leading architect Charles Rennie Mackintosh (1868–1928) abandoned architecture for painting after World War I and created a number of landscapes, particularly of southern France. He became associated with Fergusson, who pursued also experimental landscape in the inter-war years, many of which were around his home in the Highlands, like that at Craigcornash (c. 1925). The work of Mackintosh and Fergusson has similarities to that of David Young Cameron (1865–1945) who pursued the systematic painting of the Highlands in his later years.MacDonald, Scottish Art, p. 178."]}, {"page": "F.C.B. Cadell", "response": ["#redirect Francis Cadell (artist)"]}, {"page": "List of people educated at Edinburgh Academy", "response": ["* Francis Cadell, explorer of the Murray River in Australia."]}, {"page": "Adam Bruce Thomson", "response": ["On 15 April 1918 Thomson married Jessie I. Hislop, the sister of his great friend and fellow Edinburgh artist Walter Balmer Hislop and they set up home in Marchmont. The couple had three children born between 1919 and 1924. In 1919 Thomson resumed his staff position at the Edinburgh College of Art and would remain there until 1950. During this career Thomson taught etching, composition, still life to the painting school and colour theory to the art and architecture students. Regular visitors to the Thomson family home included his student and protégé William Wilson and also William Crozier. Other close colleagues from the Edinburgh College of Art and the Royal Scottish Academy included Stanley Cursiter and David Macbeth Sutherland. In the 1920s in particular Thomson's work was at its closest to that of Samuel Peploe, Francis Cadell and other contemporaries, notably John Guthrie Spence Smith and Penelope Beaton."]}, {"page": "December 1937", "response": ["*Died: Francis Cadell, 54, Scottish Colourist painter"]}]}}