{"wiki_id": "http://www.wikidata.org/entity/Q3453757", "itemLabel": "Ryan Cartwright", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Ryan_Cartwright", "wikipedia_page": {"main": "Ryan Cartwright (born 14 March 1981) is an English actor.", "link_mentions": [{"page": "Jane Seymour (actress)", "response": ["Seymour appeared in the Hallmark Channel film Dear Prudence (2008) with Jamey Sheridan and Ryan Cartwright; the romantic comedy Love, Wedding, Marriage (2011) with Mandy Moore; and the Hallmark Movie Channel film Lake Effects (2012) with Scottie Thompson and Madeline Zima."]}, {"page": "1981 in American television", "response": ["|Ryan Cartwright"]}, {"page": "Brummie dialect", "response": ["Examples of speakers include TV presenter Adrian Chiles, singer/musician Christine McVie, comedian Jasper Carrott, Goodies actor and TV presenter Bill Oddie, hip-hop and garage musician Mike Skinner, rock musicians Ozzy Osbourne, Tony Iommi, Geezer Butler, Bill Ward (all members of the original Black Sabbath), Roy Wood, Jeff Lynne (ELO founders), Rob Halford (Judas Priest), Dave Pegg (of Fairport Convention and Jethro Tull),  broadcaster Les Ross, politicians Clare Short and Jess Phillips, SAS soldier and author John \"Brummie\" Stokes, TV presenter Alison Hammond, and many actresses and actors including Martha Howe-Douglas, Donnaleigh Bailey, Nicolas Woodman, Sarah Smart, John Oliver and Ryan Cartwright."]}, {"page": "Erdington", "response": ["* Ryan Cartwright, an actor who plays the character of Gary Bell in the SyFy science fiction drama Alphas."]}, {"page": "Look Around You", "response": ["* Ryan Cartwright: \"Sam Macnamara\", associate of Pat Taylor and veteran 'volunteer' of 50–60 sex-changes."]}, {"page": "List of autistic fictional characters", "response": ["|Ryan Cartwright"]}, {"page": "All About Me", "response": ["*Ryan Cartwright – Peter Craddock"]}, {"page": "Bones (TV series)", "response": ["*Ryan Cartwright as Vincent Nigel-Murray (seasons 4–6): Vincent is an Englishman and a graduate of the University of Leeds. He has a habit of reciting trivia while working. In season six, he is fatally shot in the chest by sniper Jacob Broadsky; his death ends up being the catalyst in Booth and Brennan's relationship. Hodgins and Angela give their son the second middle name Vincent.", "Beginning with season four, Zack Addy (Eric Millegan) was replaced by a succession of lab assistants: Wendell Bray (Michael Grant Terry), Colin Fisher (Joel Moore), Arastoo Vaziri (Pej Vahdat), Vincent Nigel-Murray (Ryan Cartwright), Clark Edison (Eugene Byrd) and Daisy Wick (Carla Gallo). One—Scott Starett (played by Michael Badalucco, formerly of The Practice)—is much older than the typical grad student. Marisa Coughlan guest-starred in a few mid-season episodes as FBI agent Payton Perotta, who was brought to the Jeffersonian as a temporary substitute for Booth when he was incapacitated. Betty White guest starred as Dr. Beth Mayer, a mentor to Brennan, in seasons 11 and 12."]}, {"page": "Hardware (TV series)", "response": ["*Ryan Cartwright - Steve", "Hardware is set in \"Hamway's Hardware Store\" in London, where main character Mike (Martin Freeman) works with Steve (Ryan Cartwright) and Kenny (Peter Serafinowicz) for shop owner Rex (Ken Morley). They relax at the next-door-but-one cafe, \"Nice Day Cafe\", where Mike's girlfriend Anne (Susan Earl) works with Julie (Ella Kenion). The series revolves around the store staff as they engage in a daily wisecrack battle with packs of DIY obsessed clients."]}, {"page": "The Grimleys", "response": ["The Grimleys follows the ups and downs of the dysfunctional Grimley family in their struggles with everyday life. Gordon Grimley (James Bradshaw) is an intellectual but feeble schoolboy who has a crush on his teacher, Miss Geraldine Titley (Amanda Holden; Samantha Janus in the pilot). His younger brother Darren (Ryan Cartwright), who also narrates the storyline and sets the scene, is fond of Gordon and sympathetic to his unrequited love for Miss Titley, but is frustrated by his brother's fey personality and his nickname, \"The School Spanner\". Their father Baz (Nigel Planer) is a bone-idle British Leyland car worker, who injured his back on his first day at the Longbridge plant and went on strike on the second. He has not moved from his armchair since then and spends his days watching television. He is particularly infuriated by Gordon's artistic leanings and is determined that he should do \"a man's job\" rather than go to university, unlike their hard-working mother Janet (Jan Ravens).", "*Ryan Cartwright as Darren Grimley"]}, {"page": "Coconut (song)", "response": ["* Bones (TV series) season 6 penultimate episode (#22 - The Hole in the Heart) lab assistant Vincent Nigel-Murray (Ryan Cartwright) is killed by a sniper, and in valediction the cast sing his favourite song at the suggestion of Dr Sweets (John Francis Daley)."]}, {"page": "Seriously Weird", "response": ["The show revolves around the misadventures of three teenagers in Draper High School in upstate New York. Harris Pembleton (Ryan Cartwright), a new arrival from England, has a magnet for all that is weird after he disrespects Steve, the Ruler of The Weird Dimension. He befriends locals Fenella Day (Lucinda Davis) and Hugo Short (Ricky Mabe)."]}, {"page": "Rebecca Hunter", "response": ["Her first TV role was on the Disney-produced, BAFTA award-winning CBBC sitcom Microsoap, alongside Paul Terry, Jeff Rawle and Ryan Cartwright, between 1998 and 2000. She has also appeared in My Dad's the Prime Minister and UGetMe. In addition, while a member of allSTARS*, she made an appearance as a guest on Never Mind the Buzzcocks in 2001."]}, {"page": "Fortis Academy", "response": ["* Ryan Cartwright, Actor "]}, {"page": "List of Bones characters", "response": ["| Ryan Cartwright", "| Ryan Cartwright || Vincent Nigel-Murray || 4–6", ": Portrayed by Ryan Cartwright"]}, {"page": "Ryan (given name)", "response": ["*Ryan Cartwright (born 1981), English actor"]}, {"page": "Microsoap", "response": ["Played by Ryan Cartwright, David is the eldest of the children, at sixteen years old; a typical lazy and occasionally rude teenager, particularly to the younger children. His main interests are his music, though he is not particularly good, and trying to impress girls. Not long after meeting the Parkers, he found he had a crush on Emily, but quickly dealt with his feelings after she said that it would never work between them, as they had begun to live as a family unit. Later, he forms a relationship with Lisa"]}, {"page": "Warehouse 13", "response": ["* Ryan Cartwright and Erin Way who worked together on Alphas were cast together in the third episode of the final season: \"A Faire to Remember\" (S5E3)"]}, {"page": "Dear Prudence (2008 film)", "response": ["* Ryan Cartwright as Nigel Forsythe III"]}, {"page": "List of Mad Men characters", "response": ["|Ryan Cartwright", "John Hooker (Ryan Cartwright), an Englishman, is Lane Pryce's assistant during Season 3. His title is \"secretary\", but he insists his status is higher than that of the other secretaries at Sterling Cooper, telling Joan, \"I'm Mr. Pryce's right arm; I'm not his typist.\" To this end, he asks that the switchboard operators address him as \"Mr. Hooker\" rather than \"John\". He assumes Joan's position as office manager after her departure to become a housewife. A variety of Sterling Cooper employees refer to John as \"Moneypenny\", much to his chagrin.  His officious, self-important manner annoys nearly everyone in the office, particularly Joan and including Lane and Rebecca Pryce, who call him a \"toad\".  When the primary partners abandon the company to form Sterling Cooper Draper Pryce, John is left to deal with the Putnam, Powell & Lowe executives, who are infuriated."]}, {"page": "List of British actors", "response": ["* Ryan Cartwright (born 1981)"]}, {"page": "Alphas", "response": ["* Ryan Cartwright as Gary Bell – A young, autistic man who is socially functional to a degree. A prodigious savant, his diagnosis is transduction meaning he has the ability to see all electromagnetic radiation/electromagnetic wavelengths and process information as fast as any computer. In season two, he is able to find the wavelengths of forks, trees, and other non-electric items when faced with no technology."]}, {"page": "Cartwright (surname)", "response": ["* Ryan Cartwright (born 1981), British actor"]}, {"page": "Bones (season 4)", "response": ["*Ryan Cartwright as Vincent Nigel-Murray"]}, {"page": "Bones (season 5)", "response": ["*Ryan Cartwright as Vincent Nigel-Murray"]}, {"page": "Sironia", "response": ["* Ryan Cartwright as Nick"]}, {"page": "Bones (season 6)", "response": ["*Ryan Cartwright as Vincent Nigel-Murray", "Intern Vincent Nigel-Murray Ryan Cartwright, introduced as a recurring character in season four, was killed off in the penultimate episode of this season, shot by sniper Jacob Broadsky. Series creator Hart Hanson explained the reasoning for this decision was due to the television series Alphas being picked up, in which Cartwright is a series regular. Hanson explained, \"We knew [his exit] would happen before the end of this season, so the story has been in the works for a while. We knew that one of our squints, who are [played by] very, very talented actors, would get a job\". Hanson also explained that, \"He's a well-beloved character... probably the favorite squint of the audience, so we decided to kill him for the heartbreak\"."]}, {"page": "Joseph M. Petrick", "response": ["In 2009, MTV hired Petrick & Bowser to create a pilot for a half-hour sketch comedy show. They created The Underground which starred Bowser as a man who lived in the basement of the network and hacked into their broadcast feed to air sketches and interstitials that featured him and his puppet co-horts. It was not picked up by the network but contained sketches that were featured on CollegeHumor and won FunnyOrDie & HBO's Let's Go Viral contest, which led to creating the exclusive sketch Cycop for FunnyOrDie which premiered on July 12, 2010 and featured the protagonist from The Mother of Invention in a poorly made film of his creation. The sketch starred Bowser, Juno Temple, Ryan Cartwright and Zelda Williams and announced the DVD release of the film.VincentDooly on Funny or Die The same year Petrick also directed his first solo feature film, Ashes starring Tim Venable and Ruby Wendell as a brother and sister who must travel to Arizona to pick up the ashes of their estranged father. The film co-starred Craig Anton and Jim Turner.Ashes (2009) – IMDb"]}, {"page": "Andrew Bowser", "response": ["In 2009, MTV hired Bowser & Petrick to create a pilot for a half-hour sketch comedy show. They created The Underground which starred Bowser as a man who lived in the basement of the network and hacked into their broadcast feed to air sketches and interstitials that featured him and his puppet co-horts. It was not picked up by the network but contained sketches that were featured on CollegeHumor and won FunnyOrDie & HBO's Let's Go Viral contest, which led to creating the exclusive sketch Cycop for FunnyOrDie which premiered on July 12, 2010 and featured the protagonist from The Mother of Invention in a poorly made film of his creation. The sketch starred Bowser, Juno Temple, Ryan Cartwright and Zelda Williams and announced the DVD release of the film.VincentDooly on Funny or Die"]}, {"page": "Virgin Territory", "response": ["* Ryan Cartwright - Ghino"]}, {"page": "List of Alphas characters", "response": ["* Gary Bell (Ryan Cartwright) – An autistic prodigious savant young man who lives with his mother and is socially functional to a degree. His ability of Transduction allows him to view, and interact with, natural electromagnetic radiation, man-made wireless communication, and process information faster than any computer. He states, however, that he is unable to process signals using a Nokia platform. Gary's ability can be used in a number of ways ranging from tracking people by hacking surveillance cameras, to decoding an entire language as seen in Season 1, Episode 4, \"Rosetta\". He's also been seen streaming videos, checking (or most times hacking) e-mails, and in Episode 5, \"Never Let Go\", even logged onto Twitter. Recently, events motivated Gary into creating the Anna Lives site. He is immune to Nina's \"Push\" ability, an ability Dr. Rosen attributed to Gary's autism, meaning he has unique cellular structure and neurochemistry."]}, {"page": "The Big Bang Theory (season 6)", "response": ["* Ryan Cartwright as Cole"]}, {"page": "Mom (TV series)", "response": ["* Ryan Cartwright and Melissa Tang as Jeff and Suzanne Taylor (seasons 1–2): the couple that adopts Violet's daughter."]}]}}