{"wiki_id": "http://www.wikidata.org/entity/Q346323", "itemLabel": "Emery Walker", "itemDescription": "English printer (1851-1933)", "wikipedia_url": "https://en.wikipedia.org/wiki/Emery_Walker", "wikipedia_page": {"main": "Sir Emery Walker FSA (2 April 1851 – 22 July 1933) was an English engraver, photographer and printer. Walker took an active role in many organisations that were at the heart of the Arts and Crafts movement, including the Art Workers Guild, the Society for the Protection of Ancient Buildings, and the Arts and Crafts Exhibition Society.", "link_mentions": [{"page": "William Morris", "response": ["7, Hammersmith Terrace is the former home of Sir Emery Walker, a close friend and colleague of Morris. The house is decorated in the Arts & Crafts style, including with extensive collections of Morris wallpaper, furniture, and textiles. 7, Hammersmith Terrace is operated by the Emery Walker Trust, and is open to the public for tours."]}, {"page": "Eric Gill", "response": ["In 1904 Gill married Ethel Hester Moore (1878–1961), later known as Mary, the daughter of a plant nursery owner who was also the head verger at Chichester Cathedral. Gill and Moore would eventually have three daughters (Elizabeth, Petra, and Joanna) and foster a son, Gordian. After a short period in Battersea, the couple moved into 20 Black Lion Lane, Hammersmith in west London, near the (recently married) Johnstons' home on Hammersmith Terrace. A number of artists associated with the Arts and Crafts movement, including Emery Walker and May Morris were already based in the area, as were a number of printing presses, notably the Doves Press. Gill formed a business partnership with Lawrence Christie and recruited a number of staff, including the 14-year old Joseph Cribb, to work in his studio. Gill began giving lectures at the Central School and taught courses in monumental masonary and lettering for stone masons at the Paddington Institute. In 1905 he was elected to the Arts and Crafts Exhibition Society and joined the Fabian Society the following year.  "]}, {"page": "Walker (surname)", "response": ["*Emery Walker (1851–1933), English photographer"]}, {"page": "T. J. Cobden-Sanderson", "response": ["As a friend of William Morris, Cobden-Sanderson was involved with the Arts and Crafts ideology, and during a dinner party with the Morrises he was persuaded by Morris's wife Jane Burden to take up book-binding. In about 1884 he opened a workshop, abandoning his law practice. In 1887 Cobden-Sanderson suggested a new group be named the \"Arts and Crafts Exhibition Society,\" and in so doing gave the movement its name. His wife was concerned that his interests were too abstract and she encouraged him to become a bookbinder. In 1893 he set up the Doves Bindery in Hammersmith, London, naming it after a nearby pub, The Dove. It was his wife who took credit for keeping the business running. By 1900 he had established the Doves Press. Emery Walker became a partner in 1900 and oversaw the creation of the Doves Type used for all of their books. They produced a number of letterpress books, including a five-volume Doves Bible.", "By 1909 Cobden-Sanderson and his partner Emery Walker were at the height of a protracted and bitter dispute involving the rights to the Doves Type in the dissolution of their partnership. As part of the partnership dissolution agreement, all rights to the Doves Type were to pass to Emery Walker upon the death of Cobden-Sanderson. Yet, when the press closed in 1916 Cobden-Sanderson threw the type along with its punches and matrices into the Thames. In this time, as there was no digitization, destroying the punches and matrices constituted destroying the typeface itself."]}, {"page": "Private press", "response": ["The term \"private press\" is often used to refer to a movement in book production which flourished around the turn of the 20th century under the influence of the scholar-artisans William Morris, Sir Emery Walker and their followers. The movement is often considered to have begun with the founding of Morris' Kelmscott Press in 1890, following a lecture on printing given by Walker at the Arts and Crafts Exhibition Society in November 1888. Morris decried that the Industrial Revolution had ruined man's joy in work and that mechanization, to the extent that it has replaced handicraft, had brought ugliness with it. Those involved in the private press movement created books by traditional printing and binding methods, with an emphasis on the book as a work of art and manual skill, as well as a medium for the transmission of information. Morris was greatly influenced by medieval codices and early printed books and the 'Kelmscott style' had a great, and not always positive, influence on later private presses and commercial book-design. The movement was an offshoot of the Arts and Crafts movement, and represented a rejection of the cheap mechanised book-production methods which developed in the Victorian era. The books were made with high-quality materials (handmade paper, traditional inks and, in some cases, specially designed typefaces), and were often bound by hand. Careful consideration was given to format, page design, type, illustration and binding, to produce a unified whole. The movement dwindled during the worldwide depression of the 1930s, as the market for luxury goods evaporated. Since the 1950s, there has been a resurgence of interest, especially among artists, in the experimental use of letterpress printing, paper-making and hand-bookbinding in producing small editions of 'artists' books', and among amateur (and a few professional) enthusiasts for traditional printing methods and for the production 'values' of the private press movement."]}, {"page": "Kelmscott Press", "response": ["The Kelmscott Press, founded by William Morris and Emery Walker, published fifty-three books in sixty-six volumes between 1891 and 1898. Each book was designed and ornamented by Morris and printed by hand in limited editions of around 300. Many books were illustrated by Edward Burne-Jones. Kelmscott Press books sought to replicate the style of 15th-century printing and were part of the Gothic revival movement. Kelmscott Press started the contemporary fine press movement, which focuses on the craft and design of bookmaking, often using hand presses. While their most famous books are richly decorated, most Kelmscott Press books did not have elaborate decoration, but were published simply.", "Morris was interested in medieval book design, visiting the Bodleian Library often with Burne-Jones to examine illuminated manuscripts. He designed and published several books before founding Kelmscott Press. Book dealers and designers complained about the poor quality of books published on the new rotary printing presses. Morris agreed that their quality was poor. After attending a lecture by Emery Walker on book design, Morris was inspired to collaborate with him on a new font of type, and their collaboration led to the founding of the Kelmscott Press, named after Kelmscott Manor, Morris's home in Oxfordshire. ", "Emery Walker, a book-collector, was friends and neighbours with Morris. In 1888, the Arts and Crafts Society sponsored several lectures including two lectures by Walker on bookbinding and letterpress printing and illustration. His lecture included slides of books, including enlarged type to demonstrate good and bad book design. After the second lecture, Morris asked Walker to make a new font of type with him. Walker was initially skeptical, since he could not contribute capital. Walker told Morris where to buy high-quality tools and materials for printing, as well as where to hire skilled printers. In January 1891, Morris began renting a cottage near to Kelmscott House, No. 16 Upper Mall in Hammersmith, which would serve as the first premises of the Kelmscott Press, before relocating to the neighbouring No. 14 in May, that same month in which the company was founded. The Kelmscott Press was named after Kelmscott Manor, Morris's home in Oxfordshire. While Morris did not pay himself any sort of salary, he usually broke even or made a little bit of money from the sales of Kelmscott Press books. Sales from smaller books, which were easier to produce and sell, supported production of folios and quartos. Morris organised outings for his workers and paid them above-average wages.", "Cobden-Sanderson worked as a binder in the Doves Bindery, which carried out the pigskin bindings for the Kelmscott Chaucer. Together with Emery Walker, Cobden-Sanderson founded Doves Press and used similar paper and vellum to Kelmscott. Cobden-Sanderson disliked the decorative style of the Kelmscott books; books from the Doves Press had only an occasional calligraphic initials. They created a font that copied fonts in Nicolas Jenson's renaissance publications. Their 5-volume folio Bible remains an important landmark in the history of fine press, and their editions of Goethe inspired the formation of several fine presses in Germany. The most prominent of these were Bremer Press, Janus Presse, Kleukens Presse, Ernst Ludwig Presse, and Serpentis Presse. "]}, {"page": "Elizabeth Yeats", "response": ["She trained and worked as an art teacher and was a member of William Morris's circle in London before her family returned to Dublin in 1900. Yeats wrote and created the artwork for Elementary Brush-Work Studies (published in 1900), an educational book that teaches young children the technique of painting flowers and plants using her simple method. At the suggestion of Emery Walker, who worked with Morris on the Kelmscott Press, Yeats studied printing with the Women's Printing Society in London."]}, {"page": "Cuala Press", "response": ["At the suggestion of Emery Walker, Elizabeth Yeats trained as a printer at the Women's Printing Society in London.Miller, Liam. The Dun Emer Press, Later the Cuala Press. Dublin: Cuala Press, 1973, p. 22 In 1902, Elizabeth Yeats and her sister Lily joined their friend Evelyn Gleeson in the establishment of a craft studio near Dublin which they named Dun Emer. Dun Emer became a focus of the burgeoning Irish Arts and Crafts Movement, specialising in printing, embroidery, and rug and tapestry-making. Elizabeth ran the printing operation, and Lily managed the needlework department.Sheehy 1980, p. 158"]}, {"page": "List of museums in London", "response": ["| 125px || Hammersmith || Hammersmith and Fulham || West || Historic house || Former home of Emery Walker, friend and mentor to William Morris, house features Arts and Crafts style interior"]}, {"page": "Augustus Theodore Bartholomew", "response": ["Books were of course one of his primary interests and in 1903 he was among the first members of the University's Baskerville Club. In 1909 he bought a copy of the Doves Press Shakespeare's Sonnets at a cost of £1 10s (which he called 'a horrible extravagance') and in November that year was sounded out by Sydney Cockerell about becoming Emery Walker's assistant.See Bartholomew's diary for November 1909 (CUL MS Add. 8786/1/4) Through Geoffrey Keynes, he became acquainted with Gwen and Jacques Raverat (Gwen, a granddaughter of Charles Darwin, was the sister of Keynes' wife Margaret) and acquired a copy of Jacques' edition of William Blake's The marriage of heaven and hell (printed at the Ashendene Press in just 24 copies in 1910).Now in Cambridge University Library (shelfmark Keynes.L.3.19) With Keynes Bartholomew worked on John Evelyn, the two publishing a handlist of his works in 1916 (in 25 copies), and for a time Bartholomew worked on editing Evelyn's diary for publication until giving it up in 1921. He collected a wide range of books, including many on homosexuality and sexology."]}, {"page": "The Burlington Magazine", "response": ["The first issues of The Burlington Magazine were printed on high-quality paper, had a typeface designed by Herbert Horne and were richly illustrated with black and white photographs, many by the arts and crafts photographer Emery Walker."]}, {"page": "Guild of St George", "response": ["Since 1871, some of the Guild's Companions have included: Lord Courtauld-Thomson, W. G. Collingwood, Sir Emery Walker, Sir Hubert Llewellyn Smith, Sir Evelyn Wrench,  Emily Warren, William Lethaby, Alfred Hoare Powell, Almyra Gray, Katharine Harris Bradley, J. Howard Whitehouse, John Henry Chamberlain, Frances Colenso, Benjamin Creswick, Frederick Leach, William Monk, Sydney Morse, William Smart, Fanny Talbot, T. Edmund Harvey  and Victor Branford.Roll of Companions of the Guild of St George (Guild of St George, 2013)."]}, {"page": "Doves Press", "response": ["The Doves Press was founded by T. J. Cobden-Sanderson before 1900 when he asked Emery Walker to join him. The business was financed by Anne Cobden-Sanderson. Their partnership was dissolved in 1908 but Cobden-Sanderson continued to print."]}, {"page": "Bruce Rogers (typographer)", "response": ["In 1916 Rogers left for England to work with Emery Walker, hoping to establish a press for fine editions.  However, because of wartime conditions, only one book was produced, and Rogers soon sought employment with the Cambridge University Press.  He found conditions at the press to be poor, and his report to the syndics of the press resulted in many reforms and paved the way for the hiring of Stanley Morison as typographic adviser.Hendrickson, Bruce Rogers, pp. 65-66.", "* Emery Walker Trust"]}, {"page": "Grolier Club", "response": ["Honorary members have included I.N. Phelps Stokes (elected 1927), Bruce Rogers (1928), Henry Watson Kent (1930), Franklin D. Roosevelt (1934), Rudolph Ruzicka (1946), Lawrence C. Wroth (1950), Carl Purington Rollins (1951), Elmer Adler (1952), Joseph Blumenthal (1967), and Mary C. Hyde Eccles (1989); while Honorary Foreign Corresponding members have included Emery Walker (elected 1920), Alfred W. Pollard (1921), Sir Geoffrey Keynes (1922), Michael Sadleir (1925), Stanley Morison (1951), Giovanni Mardersteig (1964), Howard M. Nixon (1971), Nicolas Barker (1972), John Carter (1973), and Hermann Zapf (2003).Members of the Grolier Club, 1884–2009 (New York: Grolier Club, 2009), pp. 9–12."]}, {"page": "Fine press", "response": ["* Doves Press (1900–1916) - Founded by T. J. Cobden-Sanderson and Emery Walker"]}, {"page": "John Brandon-Jones", "response": ["It was also on Orkney that he encountered three rare houses on Hoy designed by William Lethaby, and his interest in and study of these led him to become one of the most respected authorities in arts and crafts domestic architecture.  By pure chance, this interest was encouraged by the gift from his good friend, Dorothy Walker (the daughter of Emery Walker), of a bundle of original designs and sketches by Philip Webb. In 1955 Brandon-Jones purchased one of a pair of houses designed by Webb in Redington Road, Hampstead, in which house Brandon-Jones lived with his family until his death in 1999. His championship of Webb's reputation helped persuade the National Trust to take the Webb designed Standen into their collection."]}, {"page": "Colin Franklin (bibliographer)", "response": ["*Franklin, Colin. Emery Walker: some light on his theories of printing and on his relations with William Morris and Cobden-Sanderson. Cambridge: University Printing House, 1973."]}, {"page": "Edmund Hort New", "response": ["In 1905, New moved from Evesham, the place of his birth, to Oxford where he started work on a series of drawings of the University of Oxford colleges, a project which was to occupy him for the rest of his life and remain unfinished. The drawings were engraved by Emery Walker and sold as the \"New Loggan Prints\".\"Loggan\" was a reference to artist David Loggan (1635–1692) and his work \"Oxonia illustrata\". He also provided further illustrations for a series of books called the \"College monographs\" (see below)."]}, {"page": "Emery (name)", "response": ["* Emery Walker (1851–1933), English engraver, photographer and printer"]}, {"page": "Joseph Cribb", "response": ["Born in Hammersmith, London, Cribb's career as an artist began when he was fourteen. He was recruited by Eric Gill as his assistant in 1906 and was taught letter cutting and masonry skills by his master. He was suggested to Gill by his father Herbert William Cribb's associate, the Arts and Crafts printer Emery Walker. His father was a graphic artist, specialising in cartography."]}, {"page": "Hope (painting)", "response": ["Some were beginning to see it as embodying sentimentality and bad taste, but Hope continued to remain popular with the English public. In 1905 The Strand Magazine noted that it was the most popular picture in the Tate Gallery, and remarked that \"there are few print-sellers who fail to exhibit it in their windows.\", reproduced  After Watts's death the Autotype Company purchased from Mary Seton Watts the rights to make carbon print copies of Hope, making reproductions of the image affordable for poorer households, and in 1908 engraver Emery Walker began to sell full-colour photogravure prints of Hope, the first publicly available high-quality colour reproductions of the image."]}, {"page": "John F. Baddeley", "response": ["His most outstanding work was Russia, Mongolia, China; being some record of the relations between them from the beginning of the XVIIth century to the death of the Tsar Alexei Mikhailovich, A.D. 1602–1676; rendered mainly in the form of narratives dictated or written by the envoys sent by the Russian tsars, or their voevodas in Siberia, to the Kalmuk and Mongol khans & princes, and to the emperors of China; with introductions, historical and geographical; also a series of maps showing the progress of geographical knowledge in regard to northern Asia during the XVIth, XVIIth & early XVIIIth centuries. The texts taken more especially from manuscripts in the Moscow Foreign Office Archives; the whole by John F. Baddeley; a monumental work, published in 1919 in two volumes as a limited edition of only 250 copies, with an elaborate frontispiece (\"the book epitomised in a series of pictures\", said Baddeley) drawn by Amédée Forestier and engraved by Emery Walker. It bore a dedication To my friend of many years The Right Honourable Sir William Mather, stating that the production of the book was due to his generosity alone. It earned Baddeley the Victoria Medal of the Royal Geographical Society, and has been later republished as facsimile."]}, {"page": "The Hobby Horse", "response": ["The Hobby Horse aimed to champion the philosophy and aims of the Century Guild and was carefully produced under the tutelage of Emery Walker (1851–1933), the renowned printer and typographer at the Chiswick Press. \"The exceptional quality of Hobby Horse accounted for the relatively high cost of each issue. Its paper was rag and its binding of the finest quality. Technological innovations in the printing trade, particularly in the areas of photography and reproduction of art and illustrations, were applied. Hobby Horse used the photogravure technique to reproduce everything from Italian Renaissance woodcuts to Pre-Raphaelite painting.\" The fine production values correlated to the academic writings in the magazine."]}, {"page": "The Rice portrait", "response": ["In 1884 the portrait was used as an illustration in a collected edition of her letters published by Lord Brabourne, a relative of Jane Austen. It was used again by another relative, Mary Augusta Austen-Leigh, in her book about Austen published in 1920. It was photographed by Emery Walker in about 1910. The National Portrait Gallery, London attempted to purchase the work in the 1930s but were unable to buy it. In 1948, the Austen scholar, R. W. Chapman, rejected the identity of the sitter based on costume evidence, although he was not himself a costume expert.Art Daily News"]}, {"page": "7 Hammersmith Terrace", "response": ["7 Hammersmith Terrace is an historic house in the London borough of Hammersmith and Fulham, England, and the former home of English engraver and printer Emery Walker. Walker was an important figure in the English Arts and Crafts movement, and a close friend of textile designer William Morris, who lived nearby. During his life, Walker furnished the home in an Arts and Crafts style, reflecting his friendships with Morris and others.", "The property is  under the ownership of the Emery Walker Trust, a registered charity, who describe it as \"the last authentic Arts and Crafts interior in Britain\". The house may be visited through prebooked guided tours. Hammersmith Terrace is located immediately off the A4 road, west of Hammersmith Broadway.", "The seventeen houses on Hammersmith Terrace were built c. 1755, offering a cheaper alternative to more central London housing. In the late nineteenth and early twentieth centuries, the Terrace was home to several artists and creative professionals, including the actor F. G. Stephens and calligrapher Edward Johnston. Emery Walker moved into number 7 with his wife and children in 1903, having spent the previous 24 years living at 3 Hammersmith Terrace.", "When Walker died in 1933, ownership of the property passed to his daughter Dorothy, who attempted to preserve the house and its contents. Upon her death in 1963, the house became the property of Dorothy's nurse-companion, Elizabeth de Hass. She followed Dorothy's attempts to preserve the house, which consequently remained in a similar state to when Walker was alive. Before her death in 1999, de Hass approached experts at various institutions, with a view to setting up a trust to continue managing the property. The Emery Walker Trust was established in February 1999, using money raised by selling print items in Walker's private collection. This Trust subsequently gained ownership of the house.", "The Emery Walker Trust opened the house to the public for the first time in April 2005. Initially, there were fears that financial constraints would prevent future openings, but the house offers prebooked guided tours to individuals and groups each summer since. The house has a blue plaque to commemorate the life of its former resident.", "right|thumb|William Morris, friend of Emery Walker. Many of Morris's designs and possessions can be found inside 7 Hammersmith Terrace."]}, {"page": "Katharine Adams", "response": ["Adams was born in Bracknell, a town in Berkshire, England, to Catherine Mary Horton (d. 1912) and Reverend William Fulford Adams (d. 1912). Her childhood friends included Jenny and May Morris, daughters of the artist William Morris. Adams trained briefly as a bookbinder with Sarah Prideaux and T. J. Cobden-Sanderson in London in 1897, then set up her own workshop in Lechlade. In May 1898, she won first prize in amateur bookbinding at the Oxford arts and crafts exhibition. In 1901, Adams established the Eadburgha Bindery in Gloucestershire, where she employed and trained two assistants, both women. She soon received frequent commissions from the likes of Emery Walker and Sydney Cockerell. Two of her most important commissions were The Bindings of the British Museum presented to George V and a psalter presented to Queen Mary. Her patrons also included the Doves Press, the Ashendene Press, and the Kelmscott Press. In 1913, she married Edmund James Webb, and they moved to Otmoor near Islip in Oxfordshire before returning to Gloucestershire in the 1930s."]}, {"page": "List of English Heritage blue plaques in London", "response": ["| Sir Emery Walker(1851–1933)", "| Emery Walker house, 7 Hammersmith TerraceChiswick W6 9TS"]}, {"page": "Hammersmith Terrace", "response": ["No. 3 was once home to the actress and singer Rosemond Mountain (Mrs Mountain) (1768–1841). It was later home to the Arts and Crafts printer Emery Walker for 24 years, until he moved to no. 7 in 1903. The calligrapher Edward Johnston (1872–1944) lived here from 1905 to 1912 and is commemorated with a blue plaque.", "7 Hammersmith Terrace was home to the Arts and Crafts printer Emery Walker from 1903 to 1933. It is now a museum."]}]}}