{"wiki_id": "http://www.wikidata.org/entity/Q347064", "itemLabel": "Henry Miers Elliot", "itemDescription": "British historian and colonial administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Miers_Elliot", "wikipedia_page": {"main": "Sir Henry Miers Elliot  (1 March 1808 – 20 December 1853) was an English civil servant and historian who worked with the East India Company in India for 26 years. He is most known for The History of India, as Told by Its Own Historians based on his works, published posthumously in eight volumes, between 1867–1877 in London.", "link_mentions": [{"page": "1877 in literature", "response": ["*Henry Miers Elliot (ed. by John Dowson) – The History of India, as Told by Its Own Historians"]}, {"page": "Alwar", "response": ["* Rath region: current Behror and Neemrana, was ruled by Lah Chauhan rajput zamindar who had descended from Prithviraj Chauhan. Sahesh Mal was a son of Raja Sangat Singh Chauhan. Sangat was the great grandson of Chahir Deo Chauhan, brother of famous king Prithviraj Chauhan.Henry Miers Elliot and John Beames, 1869, Memoirs on the history, folk-lore, and distribution of the races of the North Western Provinces of India: being an amplified edition of the original supplemental glossary of Indian terms. Trübner & co. p.64 and 82. In accordance with the pledge by the raja Sangat Singh Chauhan to his younger queen for marrying her in his old age, her two sons from him were bestowed the Rath area and its headquarter of Mandhan near Neemrana. King Sangat Singh Chauhan's 19 sons from the older queen set out to seek their fortunes. Of the 19 brothers, Harsh Dev Chauhan and Sahesh Mal Chauhan arrived in the Gurgaon district.  Lah Chauhan, the ruler of Rath, was a son of raja Sangat Singh Chauhan by the younger Rani whose two sons became inheritors of Raja Sangat Singh's territory of Rath with its headquarter at Mandhan when other 19 sons from the other wives were required to quit the kingdom as per the promise of Raja Sangat.Henry Miers Elliot and John Beames, Memoirs on the History, Folk-lore, and Distribution of the Races, Volume 1.Henry Miers Elliot,  Supplemental Glossary of Terms Used in the North Western ProvincesHenry Miers Elliot, Supplement to the Glossary of Indian Terms, A.-JPanjab Notes and Queries, Volume 1"]}, {"page": "Pratap Singh Prabhakar", "response": ["Pratap Singh Prabhakar, a Kachwaha Rajput, was the founder king of Alwar State princely state in 1770 CE with its capital at Alwar city during the British Raj in India.Henry Miers Elliot and John Beames, Memoirs on the History, Folk-lore, and Distribution of the Races, Volume 1.Henry Miers Elliot, Supplemental Glossary of Terms Used in the North Western ProvincesHenry Miers Elliot, Supplement to the Glossary of Indian Terms, A.-JPanjab Notes and Queries, Volume 1"]}, {"page": "The History of India, as Told by Its Own Historians", "response": ["The History of India, as Told by Its Own Historians is a book comprising translations of medieval Persian chronicles based on the work of Henry Miers Elliot. It was originally published as a set of eight volumes between 1867-1877 in London. The translations were in part overseen by Elliot, whose efforts were then extended and edited posthumously by John Dowson.", "Henry Miers Elliot was born in 1808. He was an administrator who worked for the British East India Company (EIC) and rose to the position of foreign secretary under the Governor-Generalships of Henry Hardinge and James Broun-Ramsay, 1st Marquess of Dalhousie. His academic capability in oriental languages, classics and mathematics enabled him to pass the open entrance examination for the EIC in 1826, foregoing the place at New College, Oxford that he had been expected to attend."]}, {"page": "Beary", "response": ["Noori disputes the claim that the first Muslims came to India along with Alauddin Khalji between 1296 and 1316 AD and points out that according to renowned historian, Henry Miers Elliot, (The History of India as told by its own Historians, Part I) the first ship bearing Muslim travellers was seen on the Indian coast as early as 630 AD. H.G.(Hugh George) Rawlinson, in his book: Ancient and Medieval History of India, Ancient and Medieval History of India claims the first Arab Muslims settled on the Indian coast in the last part of the 7th century AD. Bartholomew also has similar things to say about the early Muslim settlers in India. J. Sturrock in his Madras Districts Manuals: South Kanara, says that Parsi and Arab businessmen settled in different places of the Malabar coast during the 7th century. Ahmed Noori has quoted these and other sources to validate his argument that the Arab and other Settlers came to India much before the Arab, Turk and Afghan conquerors came to North India."]}, {"page": "Caste system among South Asian Muslims", "response": ["* Henry Miers Elliot's Supplement to the glossary of Indian terms (1844), later amplied into Memoirs on the history, folk-lore, and distribution of the Races of the North Western Provinces of India"]}, {"page": "Allahabad", "response": ["Henry Miers Elliot believed that a town existed before Allahabad was founded. He adds that after Mahmud of Ghazni captured Asní near Fatehpur, he couldn't have crossed into Bundelkhand without visiting Allahabad had there been a city worth plundering. He further adds that its capture should have been heard when Muhammad of Ghor captured Benares. however, Ghori's historians never noticed it.  Akbarnama mentions that the Mughal emperor Akbar founded a great city in Allahabad. 'Abd al-Qadir Bada'uni and Nizamuddin Ahmad mention that Akbar laid the foundations of an Imperial City there which he called Ilahabas."]}, {"page": "John Beames", "response": ["* Henry Miers Elliot, Memoirs on the History, Folk-lore and Distribution of the Races of the North Western Provinces of India: Being an Amplified Edition of the Original Supplemental Glossary of Indian Terms, 2 vols. revised by John Beames. London: Trübner, 1869; New Delhi, Asian Educational Services, 2 vols. (2004)  "]}, {"page": "John Dowson", "response": ["Dowson's duties as professor suggested his Grammar of the Urdu or Hindustani Language (1862), and he also translated one of the tracts of the Ikhwānu-s-Safa, or Brotherhood of Purity. His major work was The History of India, as Told by Its Own Historians. The Muhammadan Period, which he edited from the papers of Henry Miers Elliot, in eight volumes (1867–77). He compiled the Classical Dictionary of Hindu Mythology and Religion, History and Literature (1879), and contributed to the Encyclopædia Britannica and the Journal of the Royal Asiatic Society. His theory of the Invention of the Indian Alphabet, claiming a Hindu origin, met with little support."]}, {"page": "Elliot", "response": ["* Henry Miers Elliot (1808-1853), English civil servant and historian who worked in India"]}, {"page": "Gurdan Saini", "response": ["According to Kishori Lal, \"Saini was a great general and had led several expeditions into the country of Malwa and Gujarat.\" He was killed in battle. The historians Henry Miers Elliot and John Dowson cite Miftah al-Futuh, a work by Amir Khusro, who describes Gurdan Saini in the  Rajput army of Rana Hamir: "]}, {"page": "Ahibaran", "response": ["Baran is mentioned in Mahabharata.Ahich chhatran kalkutan Gadgakulank ch Bharata, Varana vatdhanam ch Yamunash Chev Parvatah (V.19.30) Mahabharata There is also evidence of baran, The old name 'Baran' can be still be traced in the old Government documents. According to the book Etihasik Sthanavali, Baran was very important and attractive place for many kings at that time. Sir Henry Miers Elliot writes quoting the Yamini which says that, in his Twelfth Expedition A.H. 409 (1018-1019 AD) after passing by the borders of Kashmir, that is, close under the sub-Himalayan range, and crossing the Jumna, Mahmud of Ghazni takes Baran. Later the seat of power went to Dors and Chauhans, with the rise of Hardatta, a Dor ruler who took possession of Baran along with Meerut and Koil. In 1192 CE when Muhammad Ghauri conquered parts of India, his Senapati (Military commander) Qutbu l-Din Aibak surrounded Fort Baran and with the help of traitors, was able to kill King Chandrasen Dor and in the process take control of the Baran kingdom. Baran is presently named as Bulandshahr which mean High city."]}, {"page": "Henry Elliot (disambiguation)", "response": ["* Henry Miers Elliot (1808–1853), Indian civil servant and historian"]}, {"page": "Bighoto", "response": ["In the neighborhood of Bighoto existed the territories of Dhundhoti, Rath and Chandain. Bighoto region, established by and named after Bigha Raj Chauhan, was an area of 12 villages including greater part of Taoru that were collectively known as Chandain, remained under the Chand Chauhans, descendants of Sahesh Mal Chauhan. According to Sir Henry Miers Elliot, Bighoto included Rewari, Kot Kasim, Bawal, Kanon, Pataudi, Kotkasim, and a great part of the Bahraich jagir. Sahesh Mal was a son of Raja Sangat Singh Chauhan. Sangat was the great grandson of Chahir Deo Chauhan, brother of famous rajput king Prithviraj Chauhan.Henry Miers Elliot and John Beames, 1869, Memoirs on the history, folk-lore, and distribution of the races of the North Western Provinces of India: being an amplified edition of the original supplemental glossary of Indian terms. Trübner & co. p.64 and 82.", "A popular saying is बोघोतो को दू धानी खोरो और चौहान; \"Bighoto has two lords, Khoros (amongst Ahirs), and Chauhans (amongst Rajputs).\"Memoirs on the history, folk-lore, and distribution of the races of the ...what By Sir Henry Miers Elliot"]}, {"page": "H. Elliot", "response": ["#Redirect Henry Miers Elliot"]}, {"page": "Sir H. Elliot", "response": ["#Redirect Henry Miers Elliot"]}, {"page": "Sir H. M. Elliot", "response": ["#Redirect Henry Miers Elliot"]}, {"page": "H. M. Elliot", "response": ["#Redirect Henry Miers Elliot"]}]}}