{"wiki_id": "http://www.wikidata.org/entity/Q3471273", "itemLabel": "Samuel Wilks", "itemDescription": "British doctor", "wikipedia_url": "https://en.wikipedia.org/wiki/Samuel_Wilks", "wikipedia_page": {"main": "Sir Samuel Wilks, 1st Baronet,   (2 June 1824 – 8 November 1911) was a British physician and biographer.", "link_mentions": [{"page": "Myasthenia gravis", "response": ["The first to write about MG were Thomas Willis, Samuel Wilks, Erb, and Goldflam. The term \"myasthenia gravis pseudo-paralytica\" was proposed in 1895 by Jolly, a German physician. Mary Walker treated a person with MG with physostigmine in 1934. Simpson and Nastuck detailed the autoimmune nature of the condition. In 1973, Patrick and Lindstrom used rabbits to show that immunization with purified muscle-like acetylcholine receptors caused the development of MG-like symptoms."]}, {"page": "GKT School of Medical Education", "response": ["* Sir Samuel Wilks, pathologist"]}, {"page": "Guy's Hospital", "response": ["* Sir Samuel Wilks"]}, {"page": "Thomas Hodgkin", "response": ["Hodgkin described the disease that bears his name (Hodgkin lymphoma) in 1832, in a paper titled On Some Morbid Appearances of the Absorbent Glands and Spleen. He received 33 years later the eponym through the recognition of British physician Samuel Wilks, who rediscovered the disease. It is a malignancy that produces enlargement of lymphoid tissue, spleen, and liver, with invasion of other tissues. A more benign form is called Hodgkin's paragranuloma, while a more invasive form is called Hodgkin's sarcoma."]}, {"page": "Joseph Towne", "response": ["In 1852, he made \"The magnificent bust by Towne\" that was mentioned by Sir Samuel Wilks and Daldy in their \"Collected Works of Thomas Addison\"."]}, {"page": "Aldenham School", "response": ["*Sir Samuel Wilks, FRS, (1824–1911), physician and pathologist."]}, {"page": "Sam wilks", "response": ["#REDIRECT Samuel Wilks"]}, {"page": "S Wilks", "response": ["#REDIRECT Samuel Wilks"]}, {"page": "Eden Paul", "response": ["* (ed.) Lectures on pathology: delivered at the London Hospital by Henry Gawen Sutton, revised by Samuel Wilks. London: J. & A. Churchill; Philadelphia: Blakiston, 1891. "]}, {"page": "Wilks", "response": ["* Samuel Wilks (born 1827), British physician"]}, {"page": "Frederick Akbar Mahomed", "response": ["On June 14, 1873 at the parish church of St Nicholas', Brighton, Mahomed married Ellen (Nellie) Chalk. The couple had two children, a son, Archibald in 1874  and a daughter, Ellen in 1876. Only a month after the birth of Ellen in 1876, his wife, Ellen, died suddenly of sepsis and Mahomed and his family moved in with his uncle, Horatio, also a widower, in Seymour Street near Portman Square, London. In 1879 Mahomed married Ada Chalk, the younger sister of his first wife. As such a marriage was not legal under English law, the couple married in Switzerland. They lived at 12 St Thomas' Street, close to Guy's Hospital. The couple had two daughters, Dorothy in 1880, and Janet in 1881, and a son, Humphry in 1883. In 1884 the family moved from St Thomas' Street into a six-story Georgian house at 24 Manchester Square. Sadly, later that year, Mahomed contracted typhoid fever, presumably from a patient at the London Fever Hospital, where he was working. He died on 22 November 1884 from an intestinal hemorrhage and a perforated intestine. He was buried at Highgate Cemetery. On his death a  subscription was set up to assist his family and several notable physicians including Sir William Gull, Sir Samuel Wilks, Sir James Paget and Elizabeth Garrett Anderson contributed. His oldest son, Archibald, later became a doctor, and in 1914 Archibald and the rest of the family changed their name to Deane (possibly acknowledging Frederick's grandfather's name, Deen) to lessen the impact of the xenophobia and racial prejudice associated with the outbreak of the World War I. Frederick's second wife, Ada Deane, died in New York in 1940. Of Frederick's children, Archibald Deane died in 1948, Ellen died in 1954, Janet in died 1955, Humphry died in 1955  and Dorothy died in 1962."]}, {"page": "Harveian Oration", "response": ["*1879 Samuel Wilks"]}, {"page": "Hodgkin lymphoma", "response": ["In 1856, Samuel Wilks independently reported on a series of patients with the same disease that Hodgkin had previously described. Wilks, a successor to Hodgkin at Guy's Hospital, was unaware of Hodgkin's prior work on the subject. Bright informed Wilks of Hodgkin's contribution and in 1865, Wilks published a second paper, entitled \"Cases of enlargement of the lymphatic glands and spleen\", in which he named the illness \"Hodgkin's disease\" in honor of his predecessor."]}]}}