{"wiki_id": "http://www.wikidata.org/entity/Q3479149", "itemLabel": "Serena Evans", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Serena_Evans", "wikipedia_page": {"main": "Serena Evans (born 2 December 1959 in London, England) is a British actress who is best known for playing Police Sergeant Patricia Dawkins in the sitcom The Thin Blue Line which was shown on BBC1 from 1995 to 1996.\nShe also had a regular role as Sarah Chapman in ITV sitcom The Piglet Files, and appeared in six episodes of The Comic Strip Presents playing various characters, such as the schoolgirl, in  'The Bad News Tour'.\nEvans is the daughter of actors Tenniel Evans and Evangeline Banks, and is granddaughter of actor/director/producer Leslie Banks on her mother's side; her brother Matthew Evans is a TV director. On her father's side she is a direct descendant of Isaac Evans, brother of Mary Ann Evans otherwise known as author George Eliot. She is married to the actor Daniel Flynn and they have two children together.\nIn 2010, Evans appeared in the role of Mistress Page in The Merry Wives of Windsor at Shakespeare's Globe Theatre in London.", "link_mentions": [{"page": "The Thin Blue Line (British TV series)", "response": ["* Serena Evans as Sergeant Patricia Dawkins, a desk sergeant, Dawkins is Inspector Fowler’s long-suffering partner. She is forever on a quest for more sexual attention from Fowler, who is usually reluctant to oblige. Despite her frustration and anger, she loves Fowler devotedly and dreams of marrying him and having a child."]}, {"page": "Candida (play)", "response": ["In 2003 the Canadian Broadcasting Corporation broadcast a production of the play. An Oxford Stage Company production of Candida toured the UK in 2004, with Andrew Havill as Morell, Serena Evans as Candida, and Richard Glaves as Marchbanks."]}, {"page": "The Piglet Files", "response": ["*Sarah Chapman – Serena Evans"]}, {"page": "The Killing of Sister George", "response": ["A West End revival in 1995 starred Miriam Margolyes, Serena Evans, and Josephine Tewson. In 2011, a revival at the Arts Theatre in London featured Meera Syal as George. Directed by Iqbal Khan, the cast also included Elizabeth Cadwallader, Belinda Lang, and Helen Lederer."]}, {"page": "Tenniel Evans", "response": ["Walter Tenniel Evans was born in Nairobi, Kenya. His middle name derived from the illustrator Sir John Tenniel, a distant relation.name=\"Obituary\"Biography of Tenniel Evans , White Rabbit Press. His daughter, Serena Evans, is an actress, and his son, Matthew, is a television director."]}, {"page": "List of people with surname Evans", "response": ["*Serena Evans (born 1959), British actress"]}, {"page": "Beaconsfield High School", "response": ["* Serena Evans, actress, and daughter of actor Tenniel Evans, and married to actor Daniel Flynn"]}, {"page": "Janie Dee", "response": ["From March until June 2014, Dee co-starred in the London revival of Noël Coward's Blithe Spirit at the Gielgud Theatre, opposite Dame Angela Lansbury, who reprised her 2009 Tony Award-winning Broadway performance as Madame Arcati. The London cast was Charles Edwards, Jemima Rooper, Serena Evans, Simon Jones and Patsy Ferran."]}, {"page": "Laurence Olivier Award for Best Performance in a Supporting Role", "response": ["| Serena Evans "]}, {"page": "Seven Deadly Sins Four Deadly Sinners", "response": ["* Serena Evans"]}, {"page": "The Witch from the Well", "response": ["*Agnes Bates - Serena Evans"]}, {"page": "1988 Laurence Olivier Awards", "response": ["** Serena Evans as Zoe in Henceforward – Vaudeville"]}, {"page": "Every Woman Knows a Secret", "response": ["*Serena Evans as Lizzie"]}, {"page": "There She Goes (TV series)", "response": ["* Serena Evans as Grandma Cath"]}, {"page": "Belgravia (TV series)", "response": ["*Serena Evans as Mrs Pope, foster mother to Charles Pope"]}]}}