{"wiki_id": "http://www.wikidata.org/entity/Q348230", "itemLabel": "Wayne Marshall", "itemDescription": "British pianist, organist and conductor", "wikipedia_url": "https://en.wikipedia.org/wiki/Wayne_Marshall_(classical_musician)", "wikipedia_page": {"main": "Wayne Ea Marshall  (born 13 January 1961, Oldham, Lancashire) is a British pianist, organist, and conductor.", "link_mentions": [{"page": "Chetham's School of Music", "response": ["*Wayne Marshall – pianist, organist and conductor"]}, {"page": "John Rutter", "response": ["* The Piano Collection: A Flower Remembered: arrangements of eight of his most popular choral pieces for solo piano. They were recorded by Wayne Marshall on an album released in July 2020 by Decca Records.", "* John Rutter: The Piano Collection was recorded by Wayne Marshall and released in November 2020 by Decca Records. The album features the eight pieces from The Piano Collection: A Flower Remembered and also eight piano arrangements of Christmas pieces composed by Rutter."]}, {"page": "Audra McDonald", "response": ["* Bernstein – Wonderful Town with Kim Criswell, Thomas Hampson, Wayne Marshall, Simon Rattle, and Berlin Philharmonic, DVD (2005)"]}, {"page": "Graham Bickley", "response": ["He has appeared in concert performances of Leonard Bernstein’s Wonderful Town playing the role of The Wreck with The Rotterdam Philharmonic, and Guys and Dolls, playing Nathan Detroit with The Vienna Konzerthaus, both conducted by Wayne Marshall. Bickley has also appeared in concert arena productions of Jesus Christ Superstar and Evita."]}, {"page": "University of Music and Performing Arts Vienna", "response": ["*Wayne Marshall"]}, {"page": "List of organists", "response": ["* Wayne Marshall (born 1961)"]}, {"page": "Choir of St George's Chapel, Windsor Castle", "response": ["*Wayne Marshall 1980–1983"]}, {"page": "The Great Gatsby (opera)", "response": ["The first European performance was on 6 December 2015 at the Semperoper in Dresden conducted by Wayne Marshall.", "!European Premiere, December 6, 2015(Conductor: Wayne Marshall)"]}, {"page": "Wayne Marshall (deejay)", "response": ["Wayne Mitchell (born 9 April 1980), better known by his stage name Wayne Marshall, is a Jamaican reggae and dancehall artist. He is most notable for his collaborations with Sean Paul, Elephant Man and Beenie Man. He also attended the Wolmer's Boys' School for Boys and married fellow reggae/dancehall artiste Tami Chynn in 2009.", "Wayne Marshall's debut solo album Marshall Law was released by VP Records is 2003. Reviewers noted strong hip-hop influences in Marshall's dancehall music. Forbidden Fruit was released the next year, and Tru Story!, released by Federation Sound, followed in 2008.", "He recorded the Damian Marley-produced album Tru Colours in 2013, which was released in January 2014, with an EP of the same name released in November 2013.Campbell, Howard (2013) \"Wayne Marshall to show Tru Colors\", Jamaica Observer, 27 October 2013. Retrieved 27 October 2013", "In 2014, he recorded \"Jamaican Mannaz\" for the organization Do Good Jamaica, aimed at encouraging good manners in children.Grizzle, Shereita (2014) \"Wayne Marshall Joins Do Good For Values Campaign\", Jamaica Gleaner, 18 May 2014. Retrieved 20 May 2014"]}, {"page": "Wayne Marshall", "response": ["Wayne Marshall may refer to:", "*Wayne Marshall (classical musician) (born 1961), English pianist, organist and conductor", "*Wayne Marshall (deejay) (born 1980), Jamaican dancehall musician", "*Wayne Marshall (singer), now known as Marshayne, English R&B singer", "*Wayne Marshall (ethnomusicologist), American scholar focusing on the musical and cultural production of the Caribbean and the Americas", "*Wayne Marshall (basketball) (born 1986), American basketball player", "*Wayne Marshall (rugby league) (born 1963), Australian rugby league player"]}, {"page": "List of compositions by James MacMillan", "response": ["**co-commissioned by the Los Angeles Philharmonic and the BBC for the BBC Philharmonic; premièred by organist Wayne Marshall with the Los Angeles Philharmonic under Esa-Pekka Salonen in Disney Hall, Los Angeles, California on 7 October 2004."]}, {"page": "Wayne Marshall (conductor)", "response": ["#REDIRECT Wayne Marshall (classical musician)"]}, {"page": "A Scotch Bestiary", "response": ["A Scotch Bestiary: Enigmatic Variations on a Zoological Carnival at a Caledonian Exhibition is an organ concerto by the Scottish composer James MacMillan.  The work was commissioned by the BBC and the Los Angeles Philharmonic.  It was composed from 2003 to 2004 and was first performed by the organist Wayne Marshall and the Los Angeles Philharmonic under the direction of Esa-Pekka Salonen at the Walt Disney Concert Hall on October 7, 2004. Paul Jacobs (organist) gave the American East Coast premiere of this work in January 2018 in Philadelphia's Kimmel Center for the Performing Arts with the Philadelphia Orchestra and conductor Yannick Nézet-Séguin."]}, {"page": "Chineke! Orchestra", "response": ["The Chineke! Foundation was established in 2015, and its parallel orchestra followed in the same year, with the express purpose of providing \"career opportunities to young Black and Minority Ethnic (BME) classical musicians in the UK and Europe\".  The ensemble debuted at the Queen Elizabeth Hall, Southbank Centre in London in September 2015, conducted by Wayne Marshall, and highlighting works by Black British composers, such as Samuel Coleridge-Taylor’s Ballade for Orchestra and Elegy: In memoriam – Stephen Lawrence by Philip Herbert.  The orchestra's first two concerts  was initially Black, Asian & ethnically diverse, but has since included white musicians.  Chineke! became a resident orchestra at the Southbank Centre in 2016.  The orchestra made its debut at The Proms in August 2017, conducted by Kevin John Edusei.", "*Orchid Classics - Stewart Goodyear: Callaloo, Piano Sonata; George Gershwin: Rhapsody in Blue - Stewart Goodyear, piano; Wayne Marshall, conductor (1 CD, released 31 May 2019)", "*NMC - \"Spark Catchers\" - Errollyn Wallen: Concerto Grosso; James Wilson: The Green Fuse; Daniel Kidane: Dream Song; Hannah Kendall: The Spark Catchers; Philip Herbert: Elegy: In Memoriam - Stephen Lawrence; Julian Joseph: Carry That Sound - Roderick Williams, baritone; Tai Murray, violin; Chi-chi Nwanoku, double bass; Isata Kanneh-Mason, piano; Anthony Parnther, conductor; Kevin John Edusei, conductor; Wayne Marshall, conductor (1 CD, released 17 January 2020)"]}, {"page": "Lurine Cato", "response": ["In December 2016 Cato performed for a carol concert at the Old Royal Naval College Chapel in aid of the Demelza Hospice Care for Children Earlier that year she also performed for the MVISA Awards alongside other artists such as Chyna Whyne, Zara Zykes and Wayne Marshall"]}, {"page": "Vincent Boussard", "response": ["His productions have since been widely distributed in Europe, including Staatsoper Unter den Linden, Strasbourg Opera House, Liceu of Barcelona, Théâtre du Capitole de Toulouse, Hamburg State Opera. La Monnaie in Brussels, Theater an der Wien, Royal Swedish Opera, Semperoper in Dresden, Saint Gall Theater, Bayerische Staatsoper, Aalto Theatre, and the Opéra de Marseille. He has staged operas in Asia, such as New National Theatre Tokyo, and in the US, including the Brooklyn Academy of Music. He has collaborated with conductors such as Yves Abel, Rinaldo Alessandrini, Lionel Bringuier, Paolo Carignani, Riccardo Frizza, Patrick Fournillier, Daniel Harding, René Jacobs, Alexander Joel, Alessandro De Marchi, Wayne Marshall, Carlo Montanaro, , Andreas Spering and Christian Thielemann, among others. He is also invited by festivals such as the Salzburg Easter Festival, Aix-en-Provence Festival, Innsbruck Festival of Early Music, Festival dei due mondi in Spoleto, and Festival Amazonas de Ópera. In international collaboration, his staging of Massenet's Manon began in 2015 at the Vilnius National Opera, and was later also presented at the San Francisco Opera and the Korea National Opera. His production of Bellini's I puritani was jointly shown at the Opéra Royal de Wallonie in Liège and the Oper Frankfurt."]}, {"page": "Show Boat (1988 cast album)", "response": ["* Wayne Marshall (born 1961), stage piano"]}, {"page": "2020 in British music", "response": ["** Colin Balsam, Natalie Clein, and Wayne Marshall are each made an Officer of the Order of the British Empire."]}, {"page": "2020 in classical music", "response": ["*** Natalie Clein and Wayne Marshall are each made an Officer of the Order of the British Empire."]}, {"page": "2021 New Year Honours", "response": ["* Wayne Marshall. Conductor and Organist. For services to Music. (Abroad)"]}]}}