{"wiki_id": "http://www.wikidata.org/entity/Q348855", "itemLabel": "Pat Sanderson", "itemDescription": "English rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Pat_Sanderson", "wikipedia_page": {"main": "Pat Sanderson (born 6 September 1977 in Chester) is a former England international rugby union player and a former flanker for Worcester. He is the brother of the former England player Alex Sanderson.\nHis early rugby union career blossomed at Bury Grammar School, Littleborough RUFC and then at Kirkham Grammar School and included his first international cap for the England 16 Group Schools team. He joined Manchester Sale (now Sale Sharks) in 1996 and was capped by England U21s and England A. He moved to Harlequins where he played in the 2001 Powergen Cup final, when Quins lost to Newcastle by 30–27.\nSanderson was first capped on England's 1998 southern hemisphere tour as a 20-year-old, facing New Zealand twice and South Africa, and he won another three caps on the 2001 tour to North America, during which he scored a try against the United States.At the end of the 2003–04 season he moved to newly promoted Worcester Warriors, as captain, he was instrumental in ensuring the Warriors remained in the Premiership. He started every Premiership game last in 2004/5 and Sanderson was nominated for Zurich Player of the Season 2004–05 and the PRA Players’ Player of the Year. This consistency resulted in an England recall for the autumn test opener against Australia in November 2005. Despite some impressive performances in the 2005 autumn internationals and being made captain for England's tour to Australia in 2006, he fell out of favour with England when Brian Ashton replaced Andy Robinson as coach in late 2006 and has not featured since.\nSanderson is an established and firm favourite at Worcester Warriors – both of the supporters and the club, and is fondly referred to as 'Captain Fantastic'. He has played over 100 top flight games and scored 22 tries for Worcester and has again being named as club captain for the 2008/09 season by Director of Rugby for Worcester Mike Ruddock.\nSanderson is also a high-calibre sevens player, having made his debut back in 1997 in Hong Kong. In 2003–04 he played in six of the IRB World Series rounds including the three wins in South Africa, Hong Kong and London. He also helped England win the prestigious Hong Kong event. In 2002 he was also a member of England’s Commonwealth Games squad in Manchester.\nSanderson is the Chairman of the Professional Rugby Players’ Association and he is well placed to understand the problems players face, particularly with injuries. A fractured shoulder, two damaged knees and prolapsed disc have all kept him out of the game at different stages. Sanderson is also now the players representative of the This is Rugby campaign, in association with The Professional Rugby Players' Association, Premier Rugby Limited and the RFU, to promote the Core Values of rugby following a spate of disreputable incidents in professional premiership rugby.\nSanderson committed his future to Worcester Warriors on the eve of the 2007/08 season by agreeing a new two-year deal, which would see him remain at Sixways until 2010.\nIn August 2011, Sanderson was forced to retire from rugby after failing to recover from a shoulder injury.", "link_mentions": [{"page": "Chester", "response": ["* Pat Sanderson (born 1977), international rugby union player"]}, {"page": "Andy Robinson", "response": ["| rowspan=2|Pat Sanderson"]}, {"page": "Bury Grammar School", "response": ["| Pat Sanderson"]}, {"page": "Rugby Aid", "response": ["|OF ||7 || Pat Sanderson"]}, {"page": "Alex Sanderson", "response": ["Alexander Sanderson (born 7 October 1979 in Chester) is an English former rugby union footballer who played in the back row during the 1990s and 2000s for Saracens and Sale Sharks. He is the brother of Pat Sanderson who also played rugby for Littleborough RUFC. He is currently Director of Rugby at Sale Sharks."]}, {"page": "2006 end-of-year rugby union internationals", "response": ["|N8 ||8 ||Pat Sanderson || ", "|N8 ||8 ||Pat Sanderson || || ", "|OF ||7 ||Pat Sanderson || "]}]}}