{"wiki_id": "http://www.wikidata.org/entity/Q348754", "itemLabel": "Kyle Naughton", "itemDescription": "English association football player (born 1988)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kyle_Naughton", "wikipedia_page": {"main": "Kyle Naughton (born 17 November 1988) is an English professional footballer who plays as a right back for EFL Championship club Swansea City.\nNaughton was a product of Sheffield United's academy before breaking into their first team in 2008, transferring to Tottenham Hotspur the following year. He has represented England at under-21 level as well as having loan spells with Gretna, Middlesbrough, Leicester City and Norwich City.", "link_mentions": [{"page": "November 11", "response": ["*  1988   – Kyle Naughton, English footballer"]}, {"page": "Sven-Göran Eriksson", "response": ["Boosted by the loan signings of players such as Kyle Naughton and later Yakubu, results steadily improved under Eriksson as Leicester gradually began to climb the table, until a good run of form in the new year saw Leicester win seven of their first eight league games of 2011, and also take Premier League title challengers and eventual cup winners Manchester City to a replay in the FA Cup."]}, {"page": "Leicester City F.C.", "response": ["* 2011 – Championship –  Kyle Naughton,  Andy King"]}, {"page": "Sheffield United F.C.", "response": ["Sheffield United's Academy is responsible for youth development at the club. It has produced such players as Manchester City defender Kyle Walker and defender Phil Jagielka, both England internationals, and also Swansea City defender Kyle Naughton, Burnley full back Matthew Lowton, Manchester United defender and club captain Harry Maguire and current club captain Billy Sharp. The Academy building and training facilities in the Sheffield suburb of Shirecliffe were opened in 2002 by then Minister for Sport Richard Caborn. Sheffield United Academy U18s currently play in the Professional Development League at the Shirecliffe ground at Firshill Crescent, and finished as runners-up in the 2011 FA Youth Cup. In addition, SteelPhalt are the sponsor of the Shirecliffe-based Academy, and are also the major sponsor of Sheffield United Women."]}, {"page": "List of people from Sheffield", "response": ["*Kyle Naughton, footballer"]}, {"page": "Naughton", "response": ["* Kyle Naughton (born 1988), English footballer currently playing for Swansea City"]}, {"page": "Stephen Dobbie", "response": ["After the Swans were promoted to the Premier League, Dobbie made his league debut for the club in a 4–0 defeat versus Manchester City. Dobbie had seven appearances in the Premier League without scoring a goal. Dobbie twisted his left ankle under a challenge from Kyle Naughton and suffered an injury. Dobbie's injury kept him out of action for a week until he returned to action versus Manchester United. After eight appearances in the Premier League, Dobbie found himself down the pecking order behind strikers Danny Graham, Leroy Lita, Luke Moore and new signing Rory Donnelly. Finding his first-team appearances limited, manager Brendan Rodgers allowed Dobbie to leave on loan after his former club Blackpool had enquired about his availability. Birmingham City also enquired on his availability, although lack of finances meant that the club could only get Dobbie on loan with a view to a permanent deal at the end of his loan spell. However, neither the Blues nor the Seasiders signed him on loan before the close of the transfer window on 31 January 2012. After failing to find a loan deal in the January transfer window, Rodgers understood Dobbie's frustration at his lack of first-team opportunities, although he did not allow Dobbie to leave the club on loan, as he could be required to play in the first-team if other players were out injured."]}, {"page": "Andy King (footballer, born 1988)", "response": ["King had his best season yet in terms of goalscoring in 2010–11, as he ended up the club's top scorer, netting 15 times in the league and 16 times in all competitions from midfield. He earned himself a four-year contract on 15 April 2011, keeping him at the club until 2015. Three days later, King's form that season was acknowledged by his fellow professionals as he was named in the Championship's PFA Team of the Year with teammate Kyle Naughton. He then took the club's players' player of the season award for the second season in a row."]}, {"page": "2008–09 Huddersfield Town A.F.C. season", "response": ["After a disappointing opening to the season with a 1–1 draw against Stockport County, Town trounced neighbours Bradford City, on 12 August, 4–0 in the first round of the League Cup, with new signing Gary Roberts scoring a brace. Huddersfield were drawn at home to Championship side Sheffield United in the second round. They narrowly lost the tie by 2 goals to 1. Michael Flynn gave Town the lead with a deflected shot after 34 minutes. But, 2 goals in the last 10 minutes from the Blades from Darius Henderson and Kyle Naughton sent Town crashing out in the cruelest of fashions. On 6 September, Town were drawn away to League Two side Darlington in the second round of the Football League Trophy North-East section. They lost that match 1–0 on 7 October. In the FA Cup 1st round, Town were given a home tie against League Two side Port Vale. That match took place on 8 November and saw Town let a 3–1 lead slip to lose 4–3."]}, {"page": "2008–09 Hull City A.F.C. season", "response": ["The fifth round replay took place on 26 February at the KC stadium. Hull took the lead when a header from United defender Kyle Naughton bounced off his own crossbar and crossed the line for an own-goal. United levelled soon after with a Billy Sharp shot. City sealed the match early in the second half when Péter Halmosi shot in from a Nick Barmby cross. Hull's 2–1 win gave them a place in the last eight for the first time in 38 years."]}, {"page": "2008–09 Football League Championship", "response": ["|Kyle Naughton", "| DF || Kyle Naughton || Sheffield United"]}, {"page": "Kyle Walker", "response": ["On 22 July 2009, Walker left Sheffield United to join Tottenham Hotspur along with fellow defender Kyle Naughton for a combined fee of £9 million, but was loaned back to United for the duration of the 2009–10 season as part of the deal. While at Bramall Lane he was virtually ever present at right-back for the first half of the season but was unexpectedly recalled back to Spurs on 1 February 2010, just before the close of the January 2010 transfer window, after Alan Hutton was loaned out to Sunderland. Walker made his debut for Tottenham on Saturday 27 March 2010, in a 2–0 victory over Portsmouth and went on to make one more league appearance that season."]}, {"page": "2009 Football League Championship play-off Final", "response": ["Burnley kicked off the second half and three minutes in, they were awarded a corner which Michael Duff toe-poked just wide of the post.  Stephen Quinn's run was brought to a halt by an Alexander tackle before Guðjónsson's tap-in attempt was cleared by United's Nick Montgomery.   In the 58th minute, Sheffield United made their first substitution of the game, with David Cotterill being replaced by Jamie Ward.  Eight minutes later, Walker played Thompson onside, who picked out Blake.  A last-second tackle from Walker did enough to distract Blake whose shot from  went wide.  United appealed for another penalty in the 69th minute when Walker was seemingly brought down by Christian Kalvenes, but it was not awarded.  A minute later, Burnley made their second substitution with Blake, suffering from a hamstring injury, being replaced by Chris Eagles.  In the 72nd minute, a break from Ward allowed him to shoot from a tight angle but Jensen deflected the strike.  Burnley's final substitution was made in the 74th minute with Jay Rodriguez coming on for Thompson.  A minute later, Ward was booked after a deliberate handball.  On 77 minutes, an Eagles pass found Paterson on the wing who cut inside to shoot, but it was blocked by Kyle Naughton.  Ward was shown a second yellow card for another intentional handball in the 79th minute.  Arturo Lupoli was then brought on by Sheffield United to replace Howard, before Quinn was substituted by Lee Hendrie on 85 minutes. In the last minute of regular time, Morgan and Kalvenes clashed heads and the latter was booked.  The resulting free kick was struck into the wall allowing Burnley to break but they failed to score as Montgomery cleared a poor pass from Paterson. Deep into additional time, Lupoli was booked for a foul on Elliott, and the final whistle was blown, with Burnley winning the match 1–0.", "|LB ||30||Kyle Naughton"]}, {"page": "2009–10 Tottenham Hotspur F.C. season", "response": ["The first acquisitions made in the summer transfer window were the signings of youngsters Kyle Naughton and Kyle Walker, both from Sheffield United. Naughton moved straight into the first team, receiving the number 16 shirt, whereas Walker received a loan move back to Sheffield United for a year to continue his development at the Championship club.", "Following the Wembley Cup, Tottenham competed in the 2009 Asia Trophy Tournament alongside fellow Premier League outfits West Ham United, Hull City and Chinese Super League team Beijing Guoan. Tottenham started the tournament against West Ham, winning 1–0. Goalkeeper Robert Green made several saves before ex-West Ham player Jermain Defoe returned to haunt his former club with a finish from close range to send Spurs to the final. Tottenham then claimed the Trophy with a 3–0 win over Hull City. Robbie Keane claimed two goals, one from open play and one from the penalty spot, and Aaron Lennon wrapped up the game with a tap-in, supplied by new signing Kyle Naughton.", "On the final day, Tottenham loaned out three players from the first team squad. Initially, young talent Kyle Naughton returned to the Championship, joining Middlesbrough until the end of the season, followed later in the day, with Scottish international Alan Hutton moving to Sunderland in a loan move until the league end in May, The transfer window closed in England at 5pm, however due to the Scottish transfer window remaining open until midnight, it paved the way for Robbie Keane to join Celtic in a loan deal until the end of the season, to the conclude Tottenham's 2009–10 January transfer window.", "| 22 July 2009 || Kyle Naughton||Sheffield United||Undisclosed", "| 1 February 2010 || Kyle Naughton||Middlesbrough||9 May 2010", "| align=\"left\" |  Kyle Naughton"]}]}}