{"wiki_id": "http://www.wikidata.org/entity/Q348584", "itemLabel": "Alec Cheyne", "itemDescription": "Scottish footballer (1907-1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alec_Cheyne", "wikipedia_page": {"main": "Alexander George Cheyne (28 April 1907 – 5 July 1983) was a Scottish footballer who played as an inside forward. He is reputed to have been responsible for the Hampden Roar following his goal in the 'Cheyne International' of 1929.\n\n", "link_mentions": [{"page": "Arbroath F.C.", "response": ["* Alec Cheyne (1949–1955)"]}, {"page": "Hampden Park", "response": ["The Hampden Roar was first noticed in a game against England in 1929. Scotland, who had played the second half with ten players due to an injury to Alex Jackson, equalised in the final minute with a goal from Alec Cheyne direct from a corner kick. The roar that followed the goal was so loud that Jackson, who was a mile away in the Glasgow Victoria Infirmary, could tell that Scotland had scored."]}, {"page": "Hughie Gallacher", "response": ["Gallacher joined David Calderhead's Chelsea as part of a £25,000 spending spree which also saw the club sign his fellow Scottish forwards Alex Jackson and Alec Cheyne; such was his popularity at Newcastle, when Chelsea visited St James' Park, the home of Newcastle United, that season the attendance was a record 68,386 with several thousand more locked out. Gallacher scored 81 goals in 144 games and was Chelsea's top scorer in each of his four seasons in west London. The team sometimes clicked, such as in a 6–2 win over Manchester United and a 5–0 win over Sunderland but trophies remained elusive."]}, {"page": "1928–29 in Scottish football", "response": ["|Alec Cheyne", "|Alec Cheyne (3), Jimmy Nisbet (2), Bobby Rankin, Tully Craig"]}, {"page": "Andrew Wilson (footballer, born 1896)", "response": ["He made 253 appearances for Chelsea and scored 52 goals in the next eight years. In that time he lined up beside compatriots such as Willie Ferguson, Tommy Law, Hughie Gallacher, Alex Jackson and Alec Cheyne."]}, {"page": "David Calderhead", "response": ["Calderhead was notoriously shy of the media, earning the nickname \"The Sphinx of Stamford Bridge\". But he was not afraid to spend headline-making transfer fees on star strikers (especially fellow Scots), bringing the likes of Hughie Gallacher, Alex Jackson and Alec Cheyne to Stamford Bridge. Despite the glamour of the squad, trophies remained elusive. 1931–32 brought a further FA Cup semi final. Tommy Lang inspired Newcastle to a 2-goal lead and despite Gallacher pulling a goal back, Newcastle progressed to the final."]}, {"page": "Cheyne", "response": ["*Alec Cheyne (1907–1983), Scottish footballer (Aberdeen, Chelsea, Nîmes, Colchester United, Scotland)"]}, {"page": "History of Chelsea F.C.", "response": ["To capitalise on the 1930 promotion, the club spent £25,000 ($49,000) on three big-name players: Scots Hughie Gallacher, Alex Jackson and Alec Cheyne. Gallacher in particular was one of the biggest talents of his era, known for his goalscoring and for having captained Newcastle to a championship in 1926–27. He and Jackson had also been members of the Wembley Wizards team (as had Law), the Scotland team which beat England 5–1 at Wembley in 1928."]}, {"page": "Alex Jackson (footballer, born 1905)", "response": ["Jackson signed for David Calderhead's big-spending Chelsea in September 1930 for £8,500, joining international teammates Hughie Gallacher, Tommy Law and Alec Cheyne already at the club. His time at Chelsea was hampered by injuries, though he linked up well with the prolific Gallacher and himself scored 31 goals from 78 games for the club. Jackson's first-class career was then ended prematurely during the 1932–33 season. Having already fallen foul of the Chelsea hierarchy for activities relating to the public house he operated, he and several other star players at the club were approached by French side Nîmes with a lucrative contract offer, which Jackson threatened to accept unless Chelsea broke their maximum wage structure and increased his salary. The club refused to budge and, in the days before the Bosman ruling, Jackson could do little. He was forced to finish his career playing for a series of non-league clubs such as Ashton National (from Ashton-under-Lyne) and Margate. He later joined French side Nice."]}, {"page": "Vic Woodley", "response": ["Woodley was spotted by a Chelsea scout whilst playing for Windsor & Eton and signed for the club in 1931, making his debut the same year.Daily Herald, 28 August 1931 p14 \"Woodley In The Chelsea Goal\" Woodley was a member of the glamorous Chelsea side of the 1930s, playing alongside the likes of Hughie Gallacher, Alex Jackson and Alec Cheyne. Known for his reliability and his impressive sense of anticipation, Woodley's performances were often key to preserving Chelsea's First Division status with his high-profile teammates invariably failing to live up to expectations. So reliable was he that he kept John Jackson, Scotland's first choice goalkeeper, out of the Chelsea side.Falkirk Herald, 3 May 1939 p10 \"Official Opening At Denny\""]}, {"page": "1928–29 British Home Championship", "response": ["Both England and Scotland began strongly, England defeating the Irish at home, whilst the Scots did likewise against the Welsh in a commanding performance. England then became tournament front–runners by beating Wales away 3–2. Wales and Ireland drew 2–2 in the last game for the Welsh, a result which put both sides out of contention for tournament champion. Scotland's next match was in Ireland and the ensuing ten goal thriller made them favourites for the trophy as they put seven goals past the Irish, conceding three in return. In the final game, both England and Scotland performed strongly, but buoyed by their recent rout of the Irish in Belfast, Scotland secured the tournament with a late goal from Alec Cheyne."]}, {"page": "Jimmy McEwan", "response": ["McEwan started his career with East Craigie in the Scottish Junior Football Association set up in his birth town of Dundee. From there he joined the senior ranks signing for Arbroath in the second tier of the Scottish Football League. At Arbroath he hit what the club's history suggests is the fastest ever goal at their Gayfield stadium, scoring after 10 seconds against Dumbarton on 6 January 1951. He was managed by Arch Anderson and then Alec Cheyne.\"Club History\" arbroathfc.co.uk"]}, {"page": "Alexander George Cheyne", "response": ["#REDIRECT Alec Cheyne"]}, {"page": "Scotland national football team results (1920–1939)", "response": ["|Alec Cheyne", "|Bobby Rankin, Tully Craig, Alec Cheyne (3), Jimmy Nisbet (2)"]}, {"page": "Willie Ferguson", "response": ["To capitalise on the 1930 promotion, Chelsea spent £25,000 ($49,000) on three big-name players; Scots Hughie Gallacher, Alex Jackson and Alec Cheyne. Though the team sometimes clicked, trophies remained elusive through the decade. Some felt money was too often spent on inappropriate players, especially forwards, while the defence remained neglected."]}]}}